[
  {
    "title": "Trump says steep drop-off in international travel to the U.S. is 'not a big deal'",
    "description": "'We treat our tourists great. We are the tourism capital of the world,' said Trump when asked whether risk of being detained at the U.S. border might be deterring tourists",
    "link": "https://nationalpost.com/news/world/trump-says-steep-drop-off-in-international-travel-to-the-u-s-is-not-a-big-deal",
    "timestamp": "2025-04-24T19:39:16Z"
  },
  {
    "title": "Trump Announces Meeting with Atlantic’s Jeffrey Goldberg",
    "description": "President Donald Trump plans to meet on Thursday with Atlantic Editor-in-Chief Jeffrey Goldberg, who published the Signal story in March and the hoax story claiming Trump called fallen World War I soldiers “suckers” and “losers.” Trump announced in the late m…",
    "link": "https://freerepublic.com/focus/f-news/4313027/posts",
    "timestamp": "2025-04-24T19:38:57Z"
  },
  {
    "title": "Michele Fiore gets fraud conviction pardon from President Donald Trump",
    "description": "The former Las Vegas City councilwoman was scheduled to be sentenced in May after being convicted of wire fraud and conspiracy to commit wire fraud.",
    "link": "https://www.ktnv.com/news/michele-fiore-gets-fraud-conviction-pardon-from-president-donald-trump",
    "timestamp": "2025-04-24T19:37:56Z"
  },
  {
    "title": "Trump Says Russia's Concession In Ukraine Talks Is To Not Take 'The Whole Country'",
    "description": "The art of the lopsided deal.",
    "link": "https://www.huffpost.com/entry/trump-russia-ukraine-concessions_n_680a8599e4b042d124856b38",
    "timestamp": "2025-04-24T19:37:15Z"
  },
  {
    "title": "Trade talk disconnect: Trump, China at odds over negotiations",
    "description": "President Donald Trump said his administration was talking with China on trade, even after Beijing denied the existence of negotiations on a deal and demanded the United States revoke all unilateral tariffs.",
    "link": "https://www.bostonherald.com/2025/04/24/trade-talk-disconnect-trump-china-at-odds-over-negotiations/",
    "timestamp": "2025-04-24T19:36:58Z"
  },
  {
    "title": "Trump giving interview to The Atlantic's Jeffrey Goldberg after Signal chat bombshell",
    "description": "After years of bashing Jeffrey Goldberg for his coverage of his administration, President Donald Trump said he will sit down with the editor of \"The Atlantic.\"",
    "link": "https://abcnews.go.com/Politics/trump-meet-atlantics-jeffrey-goldberg-interview-despite-signal/story?id=121128726",
    "timestamp": "2025-04-24T19:36:35Z"
  },
  {
    "title": "Trump Trade Deals Appear Distant As Tariff Tensions Simmer",
    "description": "US President Donald Trump's promises of securing trade deals with major partners took another blow Thursday, with a French minister saying an agreement with the EU was \"a long way\" off and China insisting talks had not even started.",
    "link": "https://www.ibtimes.com/trump-trade-deals-appear-distant-tariff-tensions-simmer-3771298",
    "timestamp": "2025-04-24T19:36:21Z"
  },
  {
    "title": "'We defeated Trump': Defense expert warns president is walking into propaganda nightmare",
    "description": "President Donald Trump's administration is barreling head-first into another war — and a defense expert warned it was going to be a propaganda nightmare.The conflict Mohammed al-Basha, a Yemeni defense analyst, \r\nreferred to is the bombing campaign launched a…",
    "link": "https://www.rawstory.com/trump-war/",
    "timestamp": "2025-04-24T19:35:52Z"
  },
  {
    "title": "Millions of Measles Cases Could Hit U.S. Over Next 25 Years If Vaccination Rates Drop",
    "description": "Even if measles vaccination rates stay the same, there could still be over 850,000 cases according to new research.",
    "link": "https://gizmodo.com/millions-of-measles-cases-could-hit-u-s-over-next-25-years-if-vaccination-rates-drop-2000593944",
    "timestamp": "2025-04-24T19:35:22Z"
  },
  {
    "title": "Fox Reporter Says the Trump White House Is Giving Wall Street Executives Inside Info on Tariff Negotiations",
    "description": "Charles Gasparino reported on Thursday that President Donald Trump's administration is giving insider tips to Wall Street executives about ongoing trade deals.\nThe post Fox Reporter Says the Trump White House Is Giving Wall Street Executives Inside Info on Ta…",
    "link": "https://www.mediaite.com/news/fox-reporter-says-the-trump-white-house-is-giving-wall-street-executives-inside-info-on-tariff-negotiations/",
    "timestamp": "2025-04-24T19:35:07Z"
  },
  {
    "title": "Ex-NHL goalie calls Trump a 'traitor' and says former Russian president Dmitry Medvedev threatened to kill him",
    "description": "Two-time Stanley Cup champion Dominik Hasek has consistently referred to President Donald Trump as siding with criminals in regard to trying to make a peace deal between Russia and Ukraine.Hasek, a 60-year-old born in the Czech Republic (then Czechoslovakia),…",
    "link": "https://www.theblaze.com/fearless/dominik-hasek-russia-ukraine-trump",
    "timestamp": "2025-04-24T19:35:00Z"
  },
  {
    "title": "Oil Gains as Supply Tightness Counters Trade Concerns",
    "description": "Tight supplies and bullish market signals supported gains in both WTI and Brent.",
    "link": "https://www.rigzone.com/news/wire/oil_gains_as_supply_tightness_counters_trade_concerns-24-apr-2025-180333-article/",
    "timestamp": "2025-04-24T19:34:11Z"
  },
  {
    "title": "John Bolton, Donald Trump’s former national security adviser, reveals the exact time the President will fire Pete Hegseth",
    "description": "John Bolton, ex-advisor to Donald Trump, forecasts Pete Hegseth's exit. Bolton suggests Hegseth's tenure is limited due to recent scandals. He believes Hegseth's actions show poor judgment. Bolton anticipates a delayed removal to avoid appearing pressured. He…",
    "link": "https://economictimes.indiatimes.com/news/international/us/john-bolton-donald-trumps-former-national-security-adviser-reveals-the-exact-time-the-president-will-fire-pete-hegseth/articleshow/120594882.cms",
    "timestamp": "2025-04-24T19:33:34Z"
  },
  {
    "title": "The market keeps proving itself as the biggest foil for Trump and Musk - Business Insider",
    "description": "The market keeps proving itself as the biggest foil for Trump and MuskBusiness Insider  Why Trump&rsquo;s &lsquo;Blame Jerome Powell&rsquo; Strategy Flopped So HardTime Magazine  The economy puts the brakes on TrumpEL PA&#205;S English  Trump Meets His Match:…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177126343",
    "timestamp": "2025-04-24T19:33:12Z"
  },
  {
    "title": "Trump Brags About Ukraine Deal as Putin Allies Literally Laugh at Him",
    "description": "Russian propagandists were practically giddy as they celebrated top U.S. officials—including Donald Trump—bending to the Kremlin’s demands.\r\n“No one could have imagined we would live to see the day where the correct answer about to whom Crimea belongs would c…",
    "link": "https://newrepublic.com/post/194383/donald-trump-ukraine-deal-vladimir-putin-allies-laugh",
    "timestamp": "2025-04-24T19:32:55Z"
  },
  {
    "title": "GOP Sen. Rand Paul Wants to Strip Tariffs Authority From Trump, Give It to Congress",
    "description": "Sen. Rand Paul, R-Ky., is continuing his push against President Donald Trump's tariffs, with legislation he is co-sponsoring against them to come before the Senate next week. Paul says lawmakers should be in control of tariffs, rather than Trump, through the …",
    "link": "https://freerepublic.com/focus/f-news/4313025/posts",
    "timestamp": "2025-04-24T19:32:27Z"
  },
  {
    "title": "Trump trade deals appear distant as tariff tensions simmer",
    "description": "US President Donald Trump’s promises of securing trade deals with major partners took another blow Thursday, with a French minister saying an agreement with the EU was “a long way” off and China insisting talks had not even started. Since returning to the pre…",
    "link": "https://www.digitaljournal.com/world/trump-trade-deals-appear-distant-as-tariff-tensions-simmer/article",
    "timestamp": "2025-04-24T19:32:20Z"
  },
  {
    "title": "Obama-Appointed Judge Blocks Trump From Denying Funds To Sanctuary Cities",
    "description": "An Obama-appointed judge blocked the Trump administration from denying federal funds to sanctuary jurisdictions that refuse to cooperate with ICE agents.",
    "link": "https://dailycaller.com/2025/04/24/obama-judge-blocks-sanctuary-city-defunding/",
    "timestamp": "2025-04-24T19:32:19Z"
  },
  {
    "title": "Trump's online store now selling 'Trump 2028' hats as he floats idea of third term",
    "description": "The Trump Organization on Thursday began selling \"Trump 2028\" hats as President Donald Trump said he's \"not joking\" about running for a third term.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/24/trump-2028-hats-sold-online-store/83253354007/",
    "timestamp": "2025-04-24T19:31:55Z"
  },
  {
    "title": "Interior Secretary Doug Burgum to Streamline Permitting Time from Years to One Month",
    "description": "Interior Secretary Doug Burgum said that his streamlining of permits will bring department review time from potentially years to just 28 days.\nThe post Interior Secretary Doug Burgum to Streamline Permitting Time from Years to One Month appeared first on Brei…",
    "link": "https://www.breitbart.com/politics/2025/04/24/interior-secretary-doug-burgum-to-streamline-permitting-time-from-years-to-one-month/",
    "timestamp": "2025-04-24T19:30:34Z"
  },
  {
    "title": "A Federal Court Just Blocked Key Parts of Trump’s Anti-Voting Executive Order",
    "description": "A federal judge on Thursday blocked key parts of a sweeping anti-voting executive order issued by President Donald Trump in March. Voting rights advocates described the order as “an astonishing and unprecedented voter suppression” effort that would upend how …",
    "link": "https://www.motherjones.com/politics/2025/04/federal-court-trump-voting-executive-order-blocked/",
    "timestamp": "2025-04-24T19:29:55Z"
  },
  {
    "title": "Hedge Funds Seek Out Ways to Navigate Trump’s Anti-Climate Agenda",
    "description": "As President Donald Trump takes a hatchet to the clean-energy transition, a number of hedge funds are trying to figure out how to make money on low-carbon investments that appear resilient to White House attacks.",
    "link": "https://financialpost.com/pmn/business-pmn/hedge-funds-seek-out-ways-to-navigate-trumps-anti-climate-agenda",
    "timestamp": "2025-04-24T19:27:31Z"
  },
  {
    "title": "Did 9 firms making deals with Trump violate bribery, anti-fraud laws? Democratic letters seek answers",
    "description": "Sixteen Democratic lawmakers have sent letters to nine law firms that ask them to disavow deals with President Donald Trump and to answer questions about their legality.",
    "link": "https://www.abajournal.com/news/article/did-9-law-firms-making-deals-with-trump-violate-bribery-anti-fraud-laws-democratic-letters-seek-answers",
    "timestamp": "2025-04-24T19:26:00Z"
  },
  {
    "title": "Hedge Funds Seek Out Ways to Navigate Trump’s Anti-Climate Agenda",
    "description": "As President Donald Trump takes a hatchet to the clean-energy transition, a number of hedge funds are trying to figure out how to make money on low-carbon investments that appear resilient to White House attacks.",
    "link": "https://www.livemint.com/companies/news/hedge-funds-seek-out-ways-to-navigate-trump-s-anti-climate-agenda-11745522730443.html",
    "timestamp": "2025-04-24T19:25:30Z"
  },
  {
    "title": "Elmo's Sharing And Caring Remains A Target For The Trump Administration",
    "description": "And we are not tickled.",
    "link": "https://www.huffpost.com/entry/trump-administration-elmo-sesame-street-dei-inclusion-education_n_68092ff6e4b0e2b5fca2d922",
    "timestamp": "2025-04-24T19:24:36Z"
  },
  {
    "title": "Change on cards for EV manufacturing policy",
    "description": "India is considering modifying its electric car manufacturing policy (SPMEPCI) to accommodate potentially lower import tariffs under a future India-US trade agreement. The scheme, designed to attract EV investments with discounted import duties, faces uncerta…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/change-on-cards-for-ev-manufacturing-policy/articleshow/120595259.cms",
    "timestamp": "2025-04-24T19:19:24Z"
  },
  {
    "title": "Orders for big-ticket items like autos and appliances surged 9.2% in March in rush to beat tariffs",
    "description": "Companies in March accelerated their orders for big-ticket long-lasting goods ahead of President Donald Trump’s aggressive tariffs on U.S. imports, the Commerce Department reported Thursday.",
    "link": "https://www.nbcnews.com/business/consumer/orders-big-ticket-items-autos-appliances-surged-9point2-percent-march-rcna202868",
    "timestamp": "2025-04-24T19:19:16Z"
  },
  {
    "title": "Trump Store Selling $50 'Trump 2028' Hats As Allies Tout Third Term Despite Constitutional Ban",
    "description": "The Trump Stote, owned by the Trump Organization, is selling hats potentially advocating for a third term in the White House despite the Constitution forbidding it",
    "link": "https://www.ibtimes.com/trump-store-selling-50-trump-2028-hats-allies-tout-third-term-despite-constitutional-ban-3771291",
    "timestamp": "2025-04-24T19:18:54Z"
  },
  {
    "title": "Trump Team Accidentally Uploads Memo Dissing Its Own Case Against Congestion Pricing",
    "description": "The internal document from the Department of Justice was uploaded and quickly removed.",
    "link": "https://gizmodo.com/trump-team-accidentally-uploads-memo-dissing-its-own-case-against-congestion-pricing-2000593941",
    "timestamp": "2025-04-24T19:17:24Z"
  },
  {
    "title": "Trump Says Russia's Concession To End Ukraine War Is Not 'Taking The Whole Country': 'Pretty Big Concession'",
    "description": "President Donald Trump said Russia is making a concession toward ending the war in Ukraine by not \"taking the whole country\"",
    "link": "https://www.ibtimes.com/trump-says-russias-concession-end-ukraine-war-not-taking-whole-country-pretty-big-3771288",
    "timestamp": "2025-04-24T19:16:53Z"
  },
  {
    "title": "How Trump altered the government in ways that could benefit himself and his inner circle",
    "description": "Some of Trump’s policy shifts align with his advisers’ financial interests, setting up potential conflicts of interest",
    "link": "https://www.cnn.com/2025/04/24/politics/donald-trump-cabinet-policy-ethics/index.html",
    "timestamp": "2025-04-24T19:16:37Z"
  },
  {
    "title": "The Obamas Aren’t Divorcing, Michelle Is Just Embracing ‘No’",
    "description": "There is no impending Obama divorce, Michelle Obama is just embracing ‘no.’ On her ‘IMO’ podcast, the former First Lady said her reason for skipping Trump’s inauguration wasn’t about Barack; she just didn’t want to go.",
    "link": "http://nymag.com/intelligencer/article/obama-not-divorcing-michelle-embracing-no.html",
    "timestamp": "2025-04-24T19:15:28Z"
  },
  {
    "title": "New Balance chair donates $1 million to super PAC supporting Josh Kraft",
    "description": "Billionaire Jim Davis spent big in efforts to defeat Mayor Michelle Wu during her 2021 campaign. He's now backing Josh Kraft.",
    "link": "https://www.boston.com/news/politics/2025/04/24/new-balance-chair-donates-1-million-to-super-pac-supporting-josh-kraft/",
    "timestamp": "2025-04-24T19:14:40Z"
  },
  {
    "title": "Trump Says the US Is Putting a Lot of Pressure on Russia",
    "description": "President Donald Trump speaks with reporters at the White House about the state of US-Russia relations. Sign up for the ...",
    "link": "https://biztoc.com/x/1d102939b1d60868",
    "timestamp": "2025-04-24T19:12:16Z"
  },
  {
    "title": "Federal judge partially blocks Trump's effort to deny funding to pro-DEI public schools",
    "description": "A New Hampshire federal judge's ruling blocks President Donald Trump's attempt to strip federal funding from public schools that maintain DEI programs.",
    "link": "https://www.foxnews.com/politics/federal-judge-partially-blocks-trumps-effort-deny-funding-pro-dei-public-schools",
    "timestamp": "2025-04-24T19:11:51Z"
  },
  {
    "title": "Why Palantir (PLTR) Stock Is Trading Up Today",
    "description": "Shares of data-mining and analytics company Palantir (NYSE:PLTR) jumped 6.6% in the afternoon session after stocks extended their rebound, led by strong...",
    "link": "https://finance.yahoo.com/news/why-palantir-pltr-stock-trading-191103147.html",
    "timestamp": "2025-04-24T19:11:03Z"
  },
  {
    "title": "It could be anyone",
    "description": "Those who are accused of committing crimes in this country, no matter how much we deplore their alleged actions, are still entitled to due process under the law.",
    "link": "https://www.ncspin.com/it-could-be-anyone",
    "timestamp": "2025-04-24T19:10:29Z"
  },
  {
    "title": "In his closing pitch, Poilievre paints a dark picture of Canada if Liberals are re-elected",
    "description": "Conservative Leader Pierre Poilievre painted a gloomy picture of Canada in his closing pitch to voters on Thursday, saying life will get worse if voters return a Liberal government in this election.",
    "link": "https://www.cbc.ca/news/politics/poilievre-dark-picture-closing-pitch-1.7517815",
    "timestamp": "2025-04-24T19:10:23Z"
  },
  {
    "title": "'Big win!' Trump foe cheers as admin loses again against ex-White House ethics czar",
    "description": "On Thursday, President Donald Trump's administration lost another procedural motion in one of its legal battles brought by lawyer Norm Eisen, a former White House ethics czar.Eisen won an injunction for the League of United Latin American Citizens, or LULAC, …",
    "link": "https://www.rawstory.com/trump-2671840339/",
    "timestamp": "2025-04-24T19:09:32Z"
  },
  {
    "title": "Trump plans to meet with Atlantic editor who was added to secret Signal chat",
    "description": "A month earlier, Mr Goldberg was inadvertently added to a Signal group discussing an upcoming Houthi attack.",
    "link": "https://www.bbc.com/news/articles/c5yrwdw124do",
    "timestamp": "2025-04-24T19:07:47Z"
  },
  {
    "title": "Majority of Republicans Say Trump Can't Defy Supreme Court: Poll",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe vast majority of Republicans believe President Donald Trump cannot defy orders from the U.S. Supreme Court but nearly one in three said they don't think the president needs to heed lower court rulings, acc…",
    "link": "https://biztoc.com/x/38f3c48bcccbffaf",
    "timestamp": "2025-04-24T19:07:41Z"
  },
  {
    "title": "Jim Acosta Scathingly Complains ‘Trump Has Cracked The Code’ to ‘Hurt The Press’ Amid CBS Bombshell",
    "description": "Jim Acosta ripped CBS over the resignation that rocked the media world, complaining Trump has \"cracked the code\" to bending media companies to his will.\nThe post Jim Acosta Scathingly Complains ‘Trump Has Cracked The Code’ to ‘Hurt The Press’ Amid CBS Bombshe…",
    "link": "https://www.mediaite.com/news/jim-acosta-scathingly-complains-trump-has-cracked-the-code-to-hurt-the-press-amid-cbs-bombshell/",
    "timestamp": "2025-04-24T19:06:14Z"
  },
  {
    "title": "‘You Have No Idea’: Trump Snaps At Reporter Accusing Him Of Not Putting Enough ‘Pressure’ On Russia",
    "description": "President Donald Trump snapped at a reporter Thursday who accused him of not putting enough \"pressure\" on Russia to end its war against Ukraine.",
    "link": "https://dailycaller.com/2025/04/24/trump-reporter-pressure-russia-ukraine/",
    "timestamp": "2025-04-24T19:05:53Z"
  },
  {
    "title": "UN Chief Calls For \"Maximum Restraint\" After Pahalgam Terror Attack",
    "description": "United Nations Secretary-General Antonio Guterres calls on India and Pakistan to exercise &quot;maximum restraint&quot; to prevent further deterioration of the tense situation in the subcontinent after a terrorist attack in Kashmir.",
    "link": "https://www.ndtv.com/world-news/un-chief-calls-for-maximum-restraint-after-pahalgam-terror-attack-8249016",
    "timestamp": "2025-04-24T19:04:49Z"
  },
  {
    "title": "New investigation to review fundraising giant that has delivered billions to Dems",
    "description": "Suspicions include money-laundering, fraud, foreign cash influencing elections",
    "link": "https://www.wnd.com/2025/04/new-investigation-to-review-fundraising-giant-that-has-delivered-billions-to-dems/",
    "timestamp": "2025-04-24T19:03:50Z"
  },
  {
    "title": "50+ House Democrats demand answers after whistleblower report on DOGE",
    "description": "Over fifty Democratic lawmakers have signed a letter demanding answers from senior U.S. government officials about a recent potential exposure of sensitive data about American workers.\n\n\n The letter is addressed to the acting General Counsel of the National L…",
    "link": "https://slashdot.org/submission/17335511/50-house-democrats-demand-answers-after-whistleblower-report-on-doge",
    "timestamp": "2025-04-24T19:03:37Z"
  },
  {
    "title": "Why Trump Could Succeed in the Mideast Where Other Presidents Failed",
    "description": "The dealmaker president has been willing to pressure Israel and not just the Palestinians.",
    "link": "http://foreignpolicy.com/2025/04/24/trump-middle-east-diplomacy-israel-gaza-war/",
    "timestamp": "2025-04-24T19:01:48Z"
  },
  {
    "title": "Majority of Republicans Say Trump Can't Defy Supreme Court: Poll",
    "description": "Three in 10 Republicans, however, say they don't think the president needs to follow lower court orders.",
    "link": "https://www.newsweek.com/donald-trump-supreme-court-order-republicans-poll-2063789",
    "timestamp": "2025-04-24T19:01:42Z"
  },
  {
    "title": "Trump Hypes a ‘Pretty Big Concession’ Putin Is Willing to Make in Ukraine: Not ‘Taking the Whole Country’",
    "description": "Trump was asked about his plans to end the Russian invasion of Ukraine and what concessions he believes Vladimir Putin is making to end the war.\nThe post Trump Hypes a ‘Pretty Big Concession’ Putin Is Willing to Make in Ukraine: Not ‘Taking the Whole Country’…",
    "link": "https://www.mediaite.com/tv/trump-hypes-a-pretty-big-concession-putin-is-willing-to-make-in-ukraine-not-taking-the-whole-country/",
    "timestamp": "2025-04-24T19:00:22Z"
  },
  {
    "title": "Now selling '2028' hat...",
    "description": "PRESIDENT Donald Trump has made a sly nod at a third presidential run with a brand new piece of merchandise. His real estate company just dropped a red hat with “2028” proudly displayed…",
    "link": "https://www.the-sun.com/news/14098937/donald-trump-hat-third-term-presidential-2028/",
    "timestamp": "2025-04-24T19:00:03Z"
  },
  {
    "title": "Major Lenders Withdraw From Green Operations",
    "description": "Financial hubs are ditching green finance, fresh research shows, after President Donald Trump’s return to the White House triggered a global retreat.  Centres across the world had their green finance rating reduced in the 15th edition of Z/Yen Global Green Fi…",
    "link": "https://oilprice.com/Energy/Energy-General/Major-Lenders-Withdraw-From-Green-Operations.html",
    "timestamp": "2025-04-24T19:00:00Z"
  },
  {
    "title": "KFF Health News' 'What the Health?': Can Congress Reconcile Trump’s Wishes With Medicaid’s Needs?",
    "description": "When Congress returns next week, it will be writing a budget reconciliation bill that’s expected to cut taxes but also make deep cuts to Medicaid. But at least some Republicans are concerned about cutting a program that aids so many of their constituents. Sar…",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-394-medicaid-cuts-budget-congress-trump-april-24-2025/",
    "timestamp": "2025-04-24T19:00:00Z"
  },
  {
    "title": "DOGE Cuts Update: Pam Bondi Announces DOJ Cuts for Trans Inmates",
    "description": "The newly created Department of Government Efficiency is attempting to oversee drastic cuts in federal government spending.",
    "link": "https://www.newsweek.com/doge-cuts-update-pam-bondi-announces-doj-cuts-trans-inmates-2063798",
    "timestamp": "2025-04-24T18:59:53Z"
  },
  {
    "title": "10-hour shifts, 7 days a week, $11/hr: This job ad got went viral for all the wrong reasons",
    "description": "A Louisiana staffing agency is getting dragged after posting a job ad offering an $11-per-hour, 7-day-a-week farm labor job in the summer sun. The ad, which has since been taken down, promised zero days off and shifts lasting up to 10 hours a day to pick blue…",
    "link": "https://www.dailydot.com/culture/hiring-farm-pickers-job-ad/",
    "timestamp": "2025-04-24T18:59:40Z"
  },
  {
    "title": "White House Faith Office Leader Says 'It’s Not Hard' For Wives To 'Submit' To Husbands",
    "description": "Paula White-Cain said men are becoming \"the bedrock\" of the church, \"which is how God designed it.”",
    "link": "https://www.huffpost.com/entry/paula-white-cain-wives-submit-husbands_n_680a6681e4b0d1cc4a5a80d8",
    "timestamp": "2025-04-24T18:59:00Z"
  },
  {
    "title": "Trump Announces Meeting with Atlantic's Jeffrey Goldberg",
    "description": "President Donald Trump plans to meet on Thursday with Atlantic Editor-in-Chief Jeffrey Goldberg, who published the Signal story in March and the hoax story claiming Trump called fallen World War I soldiers \"suckers\" and \"losers.\"\nThe post Trump Announces Meet…",
    "link": "https://www.breitbart.com/politics/2025/04/24/trump-announces-meeting-with-atlantics-jeffrey-goldberg/",
    "timestamp": "2025-04-24T18:58:34Z"
  },
  {
    "title": "Trump on Ukraine Conflict: Next Few Days Are Crucial for Swift Resolution",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump said on Thursday that Washington is seeking a swift resolution to the Ukraine conflict and noted that \"a lot of progress\" has been made.",
    "link": "https://sputnikglobe.com/20250424/trump-on-ukraine-conflict-next-few-days-are-crucial-for-swift-resolution-1121928401.html",
    "timestamp": "2025-04-24T18:57:51Z"
  },
  {
    "title": "The market keeps proving itself as the biggest foil for Trump and Musk",
    "description": "Donald Trump and Elon Musk have both had their agenda checked by the market this year.\n- The president has walked back some of his most contentious policies in response to volatility.\n- The same applies to Musk, who, after a rough quarter for Tesla, said he w…",
    "link": "https://biztoc.com/x/8a54db13adb29ff6",
    "timestamp": "2025-04-24T18:56:49Z"
  },
  {
    "title": "UK economy faces growth shock from Trump tariffs, says Bank governor",
    "description": "Andrew Bailey says UK not close to recession but he would be ‘encouraged’ if trade deal with US were agreed\nThe Bank of England’s governor, Andrew Bailey, has said the UK economy faces a “growth shock” as a result of Donald Trump’s trade policies.\nSpeaking on…",
    "link": "https://biztoc.com/x/9501b855d0130fe6",
    "timestamp": "2025-04-24T18:56:39Z"
  },
  {
    "title": "Judge Halts Federal Scrutiny of $200 Transactions",
    "description": "Among the many intrusions of the federal government into our lives is the requirement that cash transactions of $10,000 or more be reported to the",
    "link": "https://reason.com/2025/04/25/judge-halts-federal-scrutiny-of-200-transactions/",
    "timestamp": "2025-04-24T18:52:02Z"
  },
  {
    "title": "'Flagrantly Enabling Insider Trading': Trump White House Reportedly Tips Off Wall St on Trade Talks",
    "description": "Officials inside U.S. President Donald Trump's White House have reportedly tipped off Wall Street executives about a potentially imminent trade agreement with India, a move that one watchdog group described as further evidence that the administration is \"flag…",
    "link": "https://www.commondreams.org/news/trump-wall-street-trade-talks",
    "timestamp": "2025-04-24T18:51:48Z"
  },
  {
    "title": "Judge Blocks Trump’s Proof of Citizenship Requirement",
    "description": "\"A federal judge has halted parts of an executive order signed by President Donald Trump that sought to boost requirements that Americans show documents proving their citizenship when registering to vote,\" CNN reports. \"Senior District",
    "link": "https://politicalwire.com/2025/04/24/judge-blocks-trumps-proof-of-citizenship-requirement/",
    "timestamp": "2025-04-24T18:50:38Z"
  },
  {
    "title": "Donald Trump Is Tanking One of America’s Greatest Exports in the Middle of a Trade War",
    "description": "The United States exports more than $44 billion per year in education.",
    "link": "https://slate.com/news-and-politics/2025/04/trade-war-donald-trump-tanking-economy.html",
    "timestamp": "2025-04-24T18:49:06Z"
  },
  {
    "title": "White House torches Tim Walz's speech about Trump's 'gulags,' 'chaos': 'His largest city burned to the ground'",
    "description": "Kamala Harris' ex-running mate Gov. Tim Walz blasted President Donald Trump's \"chaos\" and illegal immigration crackdown at the Minnesota state of the state address.",
    "link": "https://www.foxnews.com/politics/white-house-torches-tim-walzs-speech-about-trumps-gulags-chaos-his-largest-city-burned-ground",
    "timestamp": "2025-04-24T18:47:34Z"
  },
  {
    "title": "Walz takes aim at Trump's deportation policies, says 'university students' being 'shoved into unmarked vans'",
    "description": "Kamala Harris' ex-running mate Gov. Tim Walz blasted President Donald Trump's \"chaos\" and illegal immigration crackdown at the Minnesota state of the state address.",
    "link": "https://www.foxnews.com/politics/tim-walz-takes-aim-trumps-deportation-policies-say-university-students-being-shoved-unmarked-vans",
    "timestamp": "2025-04-24T18:47:34Z"
  },
  {
    "title": "Tariffs Helped Wreck the Economy in the 1930s. Why Is Trump Making the Same Mistake?",
    "description": "History may not perfectly repeat itself, but it often rhymes. Two protectionist episodes—the infamous Smoot-Hawley Tariff Act of 1930 and the Trump-era",
    "link": "https://reason.com/2025/04/24/tariffs-helped-wreck-the-economy-in-the-1930s-why-is-trump-making-the-same-mistake/",
    "timestamp": "2025-04-24T18:47:29Z"
  },
  {
    "title": "Trump says pressuring Russia, claims concessions",
    "description": "US President Donald Trump said Thursday he was applying pressure on Russia to end the Ukraine war, insisting that Moscow agreeing not to take over the entire country was a “big concession.” Trump issued a rare rebuke of Russian leader Vladimir Putin after Mos…",
    "link": "https://www.digitaljournal.com/world/trump-says-pressuring-russia-claims-concessions/article",
    "timestamp": "2025-04-24T18:47:22Z"
  },
  {
    "title": "12 Years After Factory Collapse, Bangladeshi Workers Fight for a Better Future",
    "description": "Survivors of the Rana Plaza disaster, many who can no longer work, are still fighting for compensation.",
    "link": "https://truthout.org/articles/12-years-after-factory-collapse-bangladeshi-workers-fight-for-a-better-future/",
    "timestamp": "2025-04-24T18:47:01Z"
  },
  {
    "title": "Washington's Broken Promises Leave Afghan Allies in Limbo",
    "description": "Following the August 2021 Taliban takeover of Afghanistan, the Afghan allies—including interpreters, government professionals, media members, and military",
    "link": "https://reason.com/2025/04/24/washingtons-broken-promises-leave-afghan-allies-in-limbo/",
    "timestamp": "2025-04-24T18:46:36Z"
  },
  {
    "title": "Trump Reveals Russia's 'Pretty Big Concession' in Peace Talks with Ukraine",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFormer President Donald Trump asserted Thursday that Russia has already made a \"pretty big concession\" in the war in Ukraine by not attempting to seize the entire country.\nHowever, that claim has been met with…",
    "link": "https://biztoc.com/x/9ca71c66c98b6c64",
    "timestamp": "2025-04-24T18:45:59Z"
  },
  {
    "title": "Chair of Cantor Fitzgerald Teams Up With Tether, SoftBank and Bitfinex To Form Bitcoin Acquisition Firm: Report",
    "description": "The chair of the brokerage company Cantor Fitzgerald is reportedly creating a consortium with SoftBank, Tether and Bitfinex to take advantage of the booming crypto industry under US President Donald Trump. Citing people familiar with the matter, the Financial…",
    "link": "https://dailyhodl.com/2025/04/24/chair-of-cantor-fitzgerald-teams-up-with-tether-softbank-and-bitfinex-to-form-bitcoin-acquisition-firm-report/",
    "timestamp": "2025-04-24T18:45:56Z"
  },
  {
    "title": "US and China holding talks on trade war, Trump says after Beijing rebuttal",
    "description": "President’s comments follow Chinese government’s denial of ‘baseless’ claim that Washington was close to deal\nThe US and China held talks on Thursday to help resolve the trade war between the world’s two largest economies, Donald Trump said.\n“We may reveal it…",
    "link": "https://biztoc.com/x/7e573ac33c3bf597",
    "timestamp": "2025-04-24T18:45:53Z"
  },
  {
    "title": "Canada caught up in China-U.S. trade war as Trump claims fentanyl continues to flow",
    "description": "WASHINGTON — Pulling Canada into his trade war with China, U.S. President Donald Trump claimed Thursday that Chinese fentanyl continues to “pour” into the United States across both borders. Trump complained on social media about Chinese airlines refusing to a…",
    "link": "https://financialpost.com/pmn/canada-caught-up-in-china-u-s-trade-war-as-trump-claims-fentanyl-continues-to-flow",
    "timestamp": "2025-04-24T18:44:43Z"
  },
  {
    "title": "IMF chief urges countries to move 'swiftly' to resolve trade tensions that threaten global growth",
    "description": "The IMF urges swift resolution of trade disputes, citing the threat to global economic growth from Trump's tariffs. Uncertainty caused by these policies is delaying investments and consumer spending, leading to a downgraded global outlook. The IMF also warns …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/imf-chief-urges-countries-to-move-swiftly-to-resolve-trade-tensions-that-threaten-global-growth/articleshow/120594744.cms",
    "timestamp": "2025-04-24T18:44:37Z"
  },
  {
    "title": "Department of the Interior Implements Emergency Permitting Procedures to Strengthen Domestic Energy Supply",
    "description": "Accelerates permitting procedures to develop American Energy Dominance... In response to President Donald J. Trump’s declaration of a National Energy Emergency, the U.S. Department of the Interior will implement emergency permitting procedures to accelerate t…",
    "link": "https://freerepublic.com/focus/f-news/4313020/posts",
    "timestamp": "2025-04-24T18:43:55Z"
  },
  {
    "title": "Trump Organization Fires Lawyer as President Blasts Harvard Work",
    "description": "The Trump Organization fired a conservative lawyer who served as its ethics adviser hours after the president attacked him for helping Harvard University sue the administration.",
    "link": "https://www.livemint.com/companies/news/trump-organization-fires-lawyer-as-president-blasts-harvard-work-11745520183390.html",
    "timestamp": "2025-04-24T18:43:03Z"
  },
  {
    "title": "Coalition’s campaign lacks good planning and enough elbow grease",
    "description": "Whatever the result on May 3, even people within the Liberals think they have run a very poor national campaign. Not just poor, but odd.",
    "link": "https://www.abc.net.au/news/2025-04-25/coalition-campaign-lacks-good-planning/105213810",
    "timestamp": "2025-04-24T18:41:55Z"
  },
  {
    "title": "Trump Memecoin Leaps After the President of the United States Offers Dinner With Top Holders",
    "description": "Donald Trump’s official memecoin (TRUMP) is skyrocketing after the President offered to have dinner with its top holders. In a new announcement, the top 220 TRUMP holders are invited to a Gala dinner event with the President on May 22nd at his private nationa…",
    "link": "https://dailyhodl.com/2025/04/24/trump-memecoin-leaps-after-the-president-of-the-united-states-offers-dinner-with-top-holders/",
    "timestamp": "2025-04-24T18:41:11Z"
  },
  {
    "title": "More than 50 House Democrats demand answers after whistleblower report on DOGE",
    "description": "Members of the Congressional Labor Caucus wrote the letter after NPR reported that a whistleblower says DOGE may have removed sensitive labor data and compromised the security of computer systems.",
    "link": "https://www.npr.org/2025/04/24/nx-s1-5375118/congress-doge-nlrb-whistleblower",
    "timestamp": "2025-04-24T18:40:22Z"
  },
  {
    "title": "Fact check: Trump lies about the price of eggs, groceries and gas (Daniel Dale/CNN)",
    "description": "Daniel Dale / CNN:\nFact check: Trump lies about the price of eggs, groceries and gas  —  Gas.  Groceries.  Eggs.  Over the last week, President Donald Trump has lied about the price of all of them — using this repeated deception to try to minimize widespread …",
    "link": "https://www.memeorandum.com/250424/p95",
    "timestamp": "2025-04-24T18:40:01Z"
  },
  {
    "title": "Trump Reveals Russia's 'Pretty Big Concession' in Peace Talks with Ukraine",
    "description": "Earlier in the day, Trump issued an unusually direct message to Russian President Putin, urging him to \"STOP!\" attacks on Ukraine.",
    "link": "https://www.newsweek.com/trump-reveals-russias-pretty-big-concession-peace-talks-ukraine-2063802",
    "timestamp": "2025-04-24T18:38:56Z"
  },
  {
    "title": "Democrats' vice chair gets ultimatum: stay neutral in primaries or step down from party leadership",
    "description": "The DNC has vowed to stay neutral in Democratic primaries following vice chair David Hogg's plan to shell out $20 million through his outside political group, Leaders We Deserve, to primary-challenge some older Democrats in blue districts.",
    "link": "https://www.foxnews.com/politics/democrats-vice-chair-gets-ultimatum-neutral-primaries-down-party-leadership",
    "timestamp": "2025-04-24T18:38:33Z"
  },
  {
    "title": "BREAKING: Attorney Ty Clevenger Exposes FBI’s Role in Hiding Seth Rich Records and Perpetuating the Russia Hoax — Sends Scathing Letter to Pam Bondi, Kash Patel, and Trump Officials",
    "description": "Ty Clevenger has fired off a blistering letter to Attorney General Pam Bondi and FBI Director Kash Patel, accusing the FBI of flagrantly concealing critical records about the late DNC staffer Seth Rich and the now-discredited Russia collusion narrative. In Fe…",
    "link": "https://freerepublic.com/focus/f-news/4313019/posts",
    "timestamp": "2025-04-24T18:38:33Z"
  },
  {
    "title": "SEN. JONI ERNST: Here’s How Congress Can Save Millions Of American Jobs",
    "description": "Eight years ago, I worked with President Trump to enact the most significant simplification of our tax code in decades, the Tax Cuts and Jobs Act (TCJA), also known as the Trump tax cuts.",
    "link": "https://dailycaller.com/2025/04/24/senator-joni-ernst-american-tax-cuts-jobs-act-trump/",
    "timestamp": "2025-04-24T18:38:30Z"
  },
  {
    "title": "Voters Should Pick their Candidates, Not Party Bosses",
    "description": "Ken Martin, chair of the Democratic National Committee argues that party officers should remain neutral in Democratic primaries.",
    "link": "https://time.com/7280045/voters-should-pick-their-candidates-not-party-bosses/",
    "timestamp": "2025-04-24T18:38:29Z"
  },
  {
    "title": "Trump says effort for Iran nuclear deal going well",
    "description": "WASHINGTON (Reuters) - President Donald Trump on Thursday said U.S. attempts to broker a nuclear deal with Iran are going well, ahead of technical talks between U.S. and Iranian delegations in Oman on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/trump-says-effort-for-iran-nuclear-deal-going-well",
    "timestamp": "2025-04-24T18:37:00Z"
  },
  {
    "title": "Tech Talk: What you need to know about crossing the US border with your phone",
    "description": "Breaking tech down to its simple parts so we can all understand it a little better",
    "link": "https://www.androidcentral.com/phones/tech-talk-what-you-need-to-know-about-crossing-the-us-border-with-your-phone",
    "timestamp": "2025-04-24T18:37:00Z"
  },
  {
    "title": "Talks only if all unilateral tariffs gone, China tells US",
    "description": "China demands the US to revoke all unilateral tariffs, denying any ongoing trade deal talks, despite Trump's softened stance. Beijing insists on seeing sincerity and respect from Washington, including addressing concerns over sanctions and Taiwan, before enga…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/talks-only-if-all-unilateral-tariffs-gone-china-tells-us/articleshow/120594602.cms",
    "timestamp": "2025-04-24T18:35:53Z"
  },
  {
    "title": "Pahalgam Carnage: A Wake-Up Call for India",
    "description": "Bairaj ChawalgamiOnce again the Sufi land has been soaked by the innocent human blood and much blood has been spilled and there is need that spilling of innocent human blood should stop. The savage and inhuman terrorists have enacted Nadimarg and 2000 Pahalga…",
    "link": "https://statetimes.in/pahalgam-carnage-a-wake-up-call-for-india/",
    "timestamp": "2025-04-24T18:35:39Z"
  },
  {
    "title": "A dozen states sue the Trump administration to stop tariff policy",
    "description": "Twelve states in America have filed a lawsuit against the Trump administration. The suit challenges the legality of President Trump's tariff policy. States argue that the policy is unlawful and disrupts the American economy. They claim Trump's actions exceed …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-dozen-states-sue-the-trump-administration-to-stop-tariff-policy/articleshow/120594600.cms",
    "timestamp": "2025-04-24T18:35:37Z"
  },
  {
    "title": "State and local election officials question agency about Trump’s attempt to overhaul operations",
    "description": "Election officials from around the country questioned the leaders of a federal agency tasked by President Trump with implementing parts of his sweeping election overhaul.",
    "link": "https://www.pbs.org/newshour/politics/state-and-local-election-officials-question-agency-about-trumps-attempt-to-overhaul-operations",
    "timestamp": "2025-04-24T18:35:13Z"
  },
  {
    "title": "EXCLUSIVE: Christian Groups Sue to Block Reinstatement of Biden Official Who Weaponized Law to Force Gender Ideology on Employers",
    "description": "FIRST ON THE DAILY SIGNAL—Two Christian organizations are intervening in a lawsuit brought against the Trump administration by a fired independent agency employee who claims... Read More\nThe post EXCLUSIVE: Christian Groups Sue to Block Reinstatement of Biden…",
    "link": "https://www.dailysignal.com/2025/04/24/exclusive-christian-employee-files-discrimination-lawsuit-radical-eeoc-commissioner-fired-by-trump/",
    "timestamp": "2025-04-24T18:35:12Z"
  },
  {
    "title": "When Will Tariffs Go Into Effect 2025? What US Consumers Should Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs the United States continues to negotiate trade deals amid President Donald Trump's tariff pause, a key deadline looms over the global economy—one that could impact prices on imported goods and effect U.S. c…",
    "link": "https://biztoc.com/x/df596759320f8b43",
    "timestamp": "2025-04-24T18:35:07Z"
  },
  {
    "title": "US judge blocks Trump from withholding funds from 16 'sanctuary' cities, counties (Nate Raymond/Reuters)",
    "description": "Nate Raymond / Reuters:\nUS judge blocks Trump from withholding funds from 16 ‘sanctuary’ cities, counties  —  A federal judge on Thursday blocked Donald Trump's administration from withholding federal funding from more than a dozen so-called sanctuary jurisdi…",
    "link": "https://www.memeorandum.com/250424/p94",
    "timestamp": "2025-04-24T18:35:01Z"
  },
  {
    "title": "Trump slams China for reneging on Boeing planes purchase",
    "description": "WASHINGTON: US President Donald Trump on Thursday criticised China for backing out of a deal to buy new Boeing planes due to tariffs imposed in the rivals' trade war. \"Boeing should default",
    "link": "https://www.channelnewsasia.com/world/trump-slams-china-reneging-boeing-planes-purchase-5087556",
    "timestamp": "2025-04-24T18:35:00Z"
  },
  {
    "title": "Trump: We'll set prices for deals at some point",
    "description": "United States President Donald Trump stated on Thursday that Washington is going to just \"at one point set prices\" for tariff deals with other countries.\"They either negotiate a deal or we set a deal ...",
    "link": "https://biztoc.com/x/365d1e46e95edf75",
    "timestamp": "2025-04-24T18:34:47Z"
  }
]