[
  {
    "title": "Donald Trump’s attacks on Rob Reiner after his murder draw condemnation - Financial Times",
    "description": "Donald Trump’s attacks on Rob Reiner after his murder draw condemnationFinancial Times Opinion | Our Petty, Hollow, Squalid Ogre in ChiefThe New York Times Speaker Johnson on Trump’s remarks on Reiner killings: ‘That’s not the way I would have done it’thehill…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180412039",
    "timestamp": "2025-12-17T18:32:23Z"
  },
  {
    "title": "'Break within MAGA': GOP lawmaker admits party dividing over Trump",
    "description": "A Republican lawmaker admitted Wednesday that MAGA is splintering over President Donald Trump and his policies. Rep. Michael McCaul (R-TX) told CNN's Wolf Blitzer that even with the friction among lawmakers over the president, he still thinks Trump has power …",
    "link": "https://www.rawstory.com/break-within-maga-gop-lawmaker-admits-party-dividing-over-trump/",
    "timestamp": "2025-12-17T18:32:08Z"
  },
  {
    "title": "The oil blockade threat creates anxiety in Venezuela but people stick to their daily lives",
    "description": "U.S. President Donald Trump is threating to blockade sanctioned oil tankers from Venezuela, a move that could devastate a country already wrangling with...",
    "link": "https://www.yahoo.com/news/articles/oil-blockade-threat-creates-anxiety-183206661.html",
    "timestamp": "2025-12-17T18:32:06Z"
  },
  {
    "title": "Why the EU-Mercosur Trade Deal Matters for Luxury",
    "description": "On Wednesday, Italy's Prime Minister Giorgia Meloni joined French President Emmanuel Macron in an attempt to delay the finalization of a crucial EU trade agreement that could pave the way for a free-trade zone with the South American bloc.",
    "link": "http://wwd.com/business-news/government-trade/eu-mercosur-trade-deal-luxury-market-expansion-1238427758/",
    "timestamp": "2025-12-17T18:31:32Z"
  },
  {
    "title": "Accused Lefty Extremist Texted FBI Snitch About ‘Terrorist Diary’: ‘Lmaooooo I Have To Get Rid Of That’",
    "description": "Leftists charged in a suspected bombing plot in California allegedly told an undercover FBI informant of their radical intentions several times before their Friday arrest, even mentioning a “terrorist diary,” court records show. The paid informant and an unde…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357836/posts",
    "timestamp": "2025-12-17T18:31:18Z"
  },
  {
    "title": "Honduras' special election recount still paralyzed amid protests",
    "description": "TEGUCIGALPA, Dec 17 (Reuters) - A special manual recount of some votes in Honduras' presidential election was still not underway on Wednesday amid protests that prevented electoral staff from working and calls by the ruling party for a review of every single …",
    "link": "https://www.thestar.com.my/news/world/2025/12/18/honduras039-special-election-recount-still-paralyzed-amid-protests",
    "timestamp": "2025-12-17T18:31:00Z"
  },
  {
    "title": "They prosecuted the Capitol rioters. Now the rioters and the DOJ are after them.",
    "description": "The Capitol riot of January 2021 set off the largest criminal investigation in the Justice Department’s history. For federal prosecutor Ashley Akers, it was a defining moment in a seven-year career spent untangling complex cases, from wire fraud to domestic t…",
    "link": "https://freerepublic.com/focus/f-news/4357835/posts",
    "timestamp": "2025-12-17T18:30:41Z"
  },
  {
    "title": "“Like nothing they have ever seen”: Trump orders blockade of Venezuela",
    "description": "The president said the Maduro regime was \"completely surrounded\" in a post to social media.",
    "link": "https://www.salon.com/2025/12/17/like-nothing-they-have-ever-seen-trump-threatens-venezuela-with-blockade/",
    "timestamp": "2025-12-17T18:30:38Z"
  },
  {
    "title": "Trump's first impeachment started with a phone call and ended with a newspaper",
    "description": "When Trump was elected president in 2016, he joined the world's most exclusive and revered club. But three years later, the president added his name to a smaller list of US leaders who'd been impeached.",
    "link": "https://www.abc.net.au/news/2025-12-18/the-lessons-from-donald-trump-s-first-impeachment-trial/106137900",
    "timestamp": "2025-12-17T18:30:00Z"
  },
  {
    "title": "Actions of Bondi Beach hero declared ‘a source of pride for Syria’",
    "description": "Ahmed al-Ahmed has received praise from political leaders for tackling gunman and saving ‘countless’ lives",
    "link": "https://www.irishtimes.com/world/middle-east/2025/12/17/actions-of-bondi-beach-hero-declared-a-source-of-pride-for-syria/",
    "timestamp": "2025-12-17T18:29:46Z"
  },
  {
    "title": "‘There can be no excuse’: Donald Trump questions why Brown University has few security cameras as search for shooter enters fifth day",
    "description": "Brown has 1,200 security cameras, according to Brown University President Christina Paxson.",
    "link": "https://indianexpress.com/article/world/donald-trump-questions-why-brown-university-has-few-security-cameras-search-for-shooter-fifth-day-10425855/",
    "timestamp": "2025-12-17T18:28:59Z"
  },
  {
    "title": "EXCLUSIVE: CBP Busts Meth Breakfast Cereal Smuggling Attempt",
    "description": "Customs and Border Protection has thwarted a large drug smuggling attempt in Texas.   CBP officers in the Lone Star State discovered a tractor trailer filled with cereal ingredients. More than $10.3 million... Read More\nThe post EXCLUSIVE: CBP Busts Meth Brea…",
    "link": "https://www.dailysignal.com/2025/12/17/exclusive-cbp-busts-meth-breakfast-cereal-smuggling-attempt/",
    "timestamp": "2025-12-17T18:26:50Z"
  },
  {
    "title": "What Is “Crocodile Economics,” and What Does It Mean for Fossil Fuels?",
    "description": "The past 12 months have been harsh on climate advocates. But surveys show it's less about abandoning the work and more about changing how it's discussed. Enter \"Crocodile Economics,\" a new term for an old concept that's taking hold around the world. TriplePun…",
    "link": "https://triplepundit.com/2025/crocodile-economics-decoupling-emissions-growth/",
    "timestamp": "2025-12-17T18:26:19Z"
  },
  {
    "title": "Marjorie Taylor Greene Again Slams Trump, Says 'He's Got Real Problems With Republicans'",
    "description": "Republican Rep. Marjorie Taylor Greene again criticized President Donald Trump as her exit from Congress gets closer.",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-again-slams-trump-says-hes-got-real-problems-republicans-3792962",
    "timestamp": "2025-12-17T18:24:44Z"
  },
  {
    "title": "Trump's Surging LNG Exports Cost US Consumers $12 Billion in Just 9 Months",
    "description": "Underscoring expert warnings that exporting liquefied natural gas not only worsens the climate emergency but also drives up energy prices for Americans, Public Citizen revealed Tuesday that as LNG exports surged under the Trump administration, US households p…",
    "link": "https://www.commondreams.org/news/us-lng-export",
    "timestamp": "2025-12-17T18:24:43Z"
  },
  {
    "title": "Trump-appointed judge makes case against Second Amendment rights for noncitizens",
    "description": "What it means to be an American is an enduring question of the Donald Trump era, as his administration targets lawful and unlawful immigrants alike while trying to convince the Supreme Court to upend birthright citizenship. \nWhile that citizenship litigation …",
    "link": "https://biztoc.com/x/3e488c5812fefa0a",
    "timestamp": "2025-12-17T18:24:13Z"
  },
  {
    "title": "Trump officials privately raise doubts about Hassett for Fed chair",
    "description": "Trump officials privately raise doubts about Hassett for Fed chair\nHassett’s critics say he has not been effective as head of the National Economic Council, playing little part in driving policies.\nDirector of the National Economic Council Kevin Hassett liste…",
    "link": "https://biztoc.com/x/0d98a04cae9f0c5b",
    "timestamp": "2025-12-17T18:23:56Z"
  },
  {
    "title": "President Trump to Deliver Prime Time Address on Major Accomplishments and Plans for Upcoming Year",
    "description": "President Donald Trump is expected to deliver a prime time address on Wednesday evening, where he is slated to tout some of the major accomplishments of his administration while also previewing what is to come in America's Golden Age. \nThe post President Trum…",
    "link": "https://www.breitbart.com/politics/2025/12/17/president-trump-to-deliver-prime-time-address-on-major-accomplishments-and-plans-for-upcoming-year/",
    "timestamp": "2025-12-17T18:23:35Z"
  },
  {
    "title": "Yemen separatist forces seize key oil region, urge US to partner against Iran-backed Houthis",
    "description": "Yemen's Southern Transitional Council claims control of government-held territory, positioning itself as America's key partner against Iran-backed Houthis.",
    "link": "https://www.foxnews.com/world/yemen-separatist-forces-seize-key-oil-region-urge-us-partner-against-iran-backed-houthis",
    "timestamp": "2025-12-17T18:22:53Z"
  },
  {
    "title": "‘It’s a Dumb Ass Question!’ Anti-Trump Prosecutor Who Was Disqualified for Misconduct Rages at Hearing",
    "description": "Fulton County District Attorney Fani Willis was utterly dumbfounded by a question she was asked Wednesday at a Georgie Senate hearing.\nThe post ‘It’s a Dumb Ass Question!’ Anti-Trump Prosecutor Who Was Disqualified for Misconduct Rages at Hearing first appear…",
    "link": "https://www.mediaite.com/media/news/its-a-dumb-ass-question-anti-trump-prosecutor-who-was-disqualified-for-misconduct-rages-at-hearing/",
    "timestamp": "2025-12-17T18:21:33Z"
  },
  {
    "title": "Trump Imposes 25% Tariffs On All Incoming Christmas Presents From The North Pole",
    "description": "WASHINGTON, D.C. — Families hoping for financial relief for the holiday season received troubling news today, as President Donald Trump announced he was imposing 25% tariffs on all incoming Christmas presents from the North Pole.",
    "link": "https://babylonbee.com/news/trump-imposes-25-tariffs-on-all-incoming-christmas-presents-from-the-north-pole",
    "timestamp": "2025-12-17T18:21:31Z"
  },
  {
    "title": "New details revealed: How the Mossad took out 11 Iranian nuclear scientists",
    "description": "A new documentary details the Israeli operation to eliminate key figures involved in Iran’s nuclear research.",
    "link": "https://www.israelnationalnews.com/news/419513",
    "timestamp": "2025-12-17T18:21:26Z"
  },
  {
    "title": "Russia will seek to extend gains in Ukraine if peace talks fail, says Putin",
    "description": "Russian President Vladimir Putin warned on Wednesday that Moscow will seek to extend its gains in Ukraine if Kyiv and its Western allies reject the Kremlin's demands in peace talks.",
    "link": "https://www.independent.ie/world-news/europe/russia-will-seek-to-extend-gains-in-ukraine-if-peace-talks-fail-says-putin/a1749213471.html",
    "timestamp": "2025-12-17T18:21:16Z"
  },
  {
    "title": "Trump Administration Is Dismantling A World-Class Climate, Weather Research Center",
    "description": "The news about the Colorado-based National Center for Atmospheric Research comes after threats over the continued imprisonment of Tina Peters.",
    "link": "https://www.huffpost.com/entry/trump-national-center-atmospheric-research_n_6942d336e4b0bafbdedd59a0",
    "timestamp": "2025-12-17T18:21:01Z"
  },
  {
    "title": "President Trump Will Pause the Survivor Finale for His Own Means",
    "description": "Maybe Trump scheduled his address then because he is a Rizo fan who wants the suspense to continue for his boy.",
    "link": "http://www.vulture.com/article/trump-will-interrupt-survivor-finale-for-his-address.html",
    "timestamp": "2025-12-17T18:20:59Z"
  },
  {
    "title": "FCC Chair Admits He’ll Cave to Trump’s Worst Demands",
    "description": "Federal Communications Commission Chair Brendan Carr admitted that he sees President Donald Trump as his boss during a congressional hearing Wednesday, and refused to say that it would be wrong to do the president’s bidding as the chairman of what is supposed…",
    "link": "https://newrepublic.com/post/204554/fcc-chair-brandon-carr-cave-trump-silence-critics",
    "timestamp": "2025-12-17T18:20:38Z"
  },
  {
    "title": "Tech stocks slump on AI debt fears",
    "description": "European markets mixed on “busy” day",
    "link": "https://www.irishtimes.com/business/2025/12/17/tech-stocks-slump-on-ai-debt-fears/",
    "timestamp": "2025-12-17T18:20:07Z"
  },
  {
    "title": "Senate passes $901 billion defense bill that pushes Hegseth for boat strike video",
    "description": "The Senate has given final passage to an annual military policy bill that will authorize $901 billion in defense programs. The legislation is attempting to overhaul how the Pentagon purchases weapons and pressures Defense Secretary Pete Hegseth to provide law…",
    "link": "https://apnews.com/article/defense-bill-boat-strikes-hegseth-a0886906eb50432c38a4d5bf08e6a719",
    "timestamp": "2025-12-17T18:20:00Z"
  },
  {
    "title": "I know Trump has an ‘alcoholic’s personality’ because I have one too",
    "description": "White House Chief of Staff Susie Wiles has claimed that President Donald Trump has an ‘alcoholic’s personality’ in a Vanity Fair interview, in addiction circles it is also known as ‘King Baby’, something Charlotte Cripps knows all too well.",
    "link": "https://www.the-independent.com/life-style/health-and-families/features/trump-susie-wiles-alcoholic-s-personality-vanity-fair-interview-b2886262.html",
    "timestamp": "2025-12-17T18:19:27Z"
  },
  {
    "title": "Trump's Own Staff Are Questioning His Mental Stability After 'Merciless Disparagement' of Reiner",
    "description": "Donald Trump's reaction to the deaths of filmmaker Rob Reiner and his wife has sparked outrage and renewed concern, with commentator Michael Wolff claiming senior White House aides are privately questioning the president's mental stability.",
    "link": "https://www.ibtimes.com/trumps-own-staff-are-questioning-his-mental-stability-after-merciless-disparagement-reiner-3792960",
    "timestamp": "2025-12-17T18:18:16Z"
  },
  {
    "title": "‘Gold cards’ and a gilded toilet: Donald Trump’s affordability message problem",
    "description": "US president hit with blowback for branding cost of living crisis a ‘hoax’ while flaunting expensive White House renovations",
    "link": "https://www.irishtimes.com/world/us/2025/12/17/gold-cards-and-a-gilded-toilet-donald-trumps-affordability-message-problem/",
    "timestamp": "2025-12-17T18:17:20Z"
  },
  {
    "title": "US Congress passes defense bill defying Trump anti-Europe rhetoric",
    "description": "American lawmakers have approved a significant defense policy bill. This action demonstrates strong bipartisan backing for Europe. It also signals a clear rejection of President Donald Trump's critical views on NATO and allied nations. The bill ensures contin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-congress-passes-defense-bill-defying-trump-anti-europe-rhetoric/articleshow/126043946.cms",
    "timestamp": "2025-12-17T18:16:31Z"
  },
  {
    "title": "Trump’s Chief of Staff Called JD Vance a Conspiracy Theorist—and Somehow It’s Not News",
    "description": "Susie Wiles said it on the record in Vanity Fair. The allegation went to the heart of governing competence. The silence that followed was the real story.\nThe post Trump’s Chief of Staff Called JD Vance a Conspiracy Theorist—and Somehow It’s Not News first app…",
    "link": "https://www.mediaite.com/opinion/trumps-chief-of-staff-called-jd-vance-a-conspiracy-theorist-and-somehow-its-not-news/",
    "timestamp": "2025-12-17T18:15:58Z"
  },
  {
    "title": "Billionaire Jared Isaacman confirmed as Nasa chief after turbulent nomination",
    "description": "The amateur jet pilot is the the first NASA administrator in decades to come directly from outside government.",
    "link": "https://www.bbc.com/news/articles/c5ydvlx28kwo",
    "timestamp": "2025-12-17T18:13:39Z"
  },
  {
    "title": "‘It’s another clarifying moment in our age of moral collapse’",
    "description": "‘Donald Trump’s reaction to Rob Reiner’s death is vile, even for him’\nBruce Arthur at the Toronto Star\nIt “feels like a sin to make the death of Rob Reiner about something other than Rob Reiner,” but we “live in a world dominated to an unreasonable degree by …",
    "link": "https://biztoc.com/x/9b2d1174355d9d07",
    "timestamp": "2025-12-17T18:13:14Z"
  },
  {
    "title": "Trump vows naval blockade of most Venezuelan oil",
    "description": "What happened\nPresident Donald Trump announced on social media Tuesday night that he had ordered a “TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela.” The military campaign to block oil exports, the lifeblood of Vene…",
    "link": "https://biztoc.com/x/a3f628f0fbd4ffbf",
    "timestamp": "2025-12-17T18:13:11Z"
  },
  {
    "title": "'Just heard a single vertebrae!' Johnson finally responds to Trump’s cruel Reiner comments",
    "description": "House Speaker Mike Johnson Wednesday was forced to respond to President Donald Trump's cruel comments on Hollywood legend Rob Reiner following the news that he and his wife were murdered.Trump attacked Reiner, who was found stabbed to death with his wife Mich…",
    "link": "https://www.rawstory.com/just-heard-a-single-vertibre-johnson-finally-responds-to-trumps-cruel-reiner-comments/",
    "timestamp": "2025-12-17T18:11:15Z"
  },
  {
    "title": "McBride says Republicans are ‘obsessed with trans people’ as bills restricting youth access to gender care come to a vote",
    "description": "Rep. Sarah McBride on Wednesday criticized congressional Republicans as being “obsessed with trans people” ahead of a vote on bills that would restrict youth access to gender identity care and penalize health workers who provide it.",
    "link": "https://www.cnn.com/2025/12/17/politics/mcbride-trans-gender-identity-care",
    "timestamp": "2025-12-17T18:10:05Z"
  },
  {
    "title": "US Senate passes big defense spending bill, ties some funds to release of boat strike videos",
    "description": "The bills would withhold a quarter of Hegseth’s travel budget until he provides unedited video of the strikes to congressional committees.",
    "link": "https://www.oregonlive.com/business/2025/12/us-senate-passes-big-defense-spending-bill-ties-some-funds-to-release-of-boat-strike-videos.html",
    "timestamp": "2025-12-17T18:08:40Z"
  },
  {
    "title": "Trump criticizes Brown University for having 'so few' cameras amid gunman search",
    "description": "Trump criticizes Brown University for having 'so few' cameras amid gunman searchgo.com",
    "link": "https://abcnews.go.com/US/trump-criticizes-brown-university-cameras-amid-gunman-search/story?id=128477115",
    "timestamp": "2025-12-17T18:07:58Z"
  },
  {
    "title": "‘Melania,’ the Documentary, May Not Reveal Much About Melania, the Person",
    "description": "A new trailer divulges that the Brett Ratner feature on the first lady was shot over 20 days in January.",
    "link": "https://www.vanityfair.com/hollywood/story/melania-the-documentary-may-not-reveal-much-about-melania-the-person",
    "timestamp": "2025-12-17T18:06:52Z"
  },
  {
    "title": "Keir Starmer’s new media plan: Fight like Donald Trump",
    "description": "The British prime minister has chosen populist soccer scraps as he tries to show voters he's on their side.",
    "link": "https://www.politico.eu/article/uk-keir-starmer-new-media-plan-fight-like-donald-trump/",
    "timestamp": "2025-12-17T18:05:45Z"
  },
  {
    "title": "Senate Passes $900 Billion Defense Bill, Sends NDAA To Trump",
    "description": "The Senate has approved the annual National Defense Authorization Act, sending the nearly $900 billion defense policy bill to President Donald Trump for signature. \nThe measure passed by a 77–20 vote after clearing the House last week and includes a 3.8 perce…",
    "link": "https://biztoc.com/x/5d48d85cbce19cc0",
    "timestamp": "2025-12-17T18:02:02Z"
  },
  {
    "title": "Trump’s Inflation Trap",
    "description": "By Daniel McCarthy via The Daily Signal | December 17, 2025\nWhat can Donald Trump do to stop morphing into Joe Biden? The two presidents could hardly be more different in most ways—but in the one that counts most with voters, Trump is in danger of resembling …",
    "link": "https://biztoc.com/x/fcb2e1b1f1af9813",
    "timestamp": "2025-12-17T18:01:57Z"
  },
  {
    "title": "UN urges 'restraint' after US-Venezuela oil tanker move",
    "description": "United Nations Secretary-General Antonio Guterres has called for \"restraint\" following a fresh escalation between the United States and Venezuela after President Donald Trump announced a blockade of V...",
    "link": "https://biztoc.com/x/5788b3717adea9f5",
    "timestamp": "2025-12-17T18:01:45Z"
  },
  {
    "title": "Trump Administration to Dismantle Key Climate Research Center in Colorado",
    "description": "This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration. The Trump administration is breaking up a research center praised as a “crown jewel” of climate research after accusing it of spreading “alar…",
    "link": "https://www.motherjones.com/politics/2025/12/trump-administration-vought-national-center-atmospheric-research-colorado-climate-alarmism/",
    "timestamp": "2025-12-17T18:01:21Z"
  },
  {
    "title": "Trump Adds Countries to List That Limits Nationals From Traveling to U.S.",
    "description": "\"I have also determined to fully restrict and limit the entry of individuals using travel documents issued or endorsed by the Palestinian Authority (PA).\"\nThe post Trump Adds Countries to List That Limits Nationals From Traveling to U.S. first appeared on Le·…",
    "link": "https://legalinsurrection.com/2025/12/trump-adds-countries-to-list-that-limits-nationals-from-traveling-to-u-s/",
    "timestamp": "2025-12-17T18:00:17Z"
  },
  {
    "title": "FCC Chair Brendan Carr Lucked Out That His Senate Hearing Is After The 'South Park' Finale",
    "description": "Trey Parker and Matt Stone are probably watching C-SPAN right now",
    "link": "https://www.cracked.com/article_49496_fcc-chair-brendan-carr-lucked-out-that-his-senate-hearing-is-after-the-south-park-finale.html",
    "timestamp": "2025-12-17T18:00:00Z"
  },
  {
    "title": "'Unbothered' Melania Trump Snubs The Don in Newly Released Footage for Her Upcoming Movie — as Rumors Their Marriage Is 'Crumbling' Ramp Up",
    "description": "The first lady bluntly dismissed the president in a video clip featured in the trailer for her upcoming film, 'MELANIA.'",
    "link": "https://radaronline.com/p/melania-trump-snubs-donald-trailer-movie-marriage-rumors/",
    "timestamp": "2025-12-17T18:00:00Z"
  },
  {
    "title": "Tonight's 'Survivor' Finale Will Be Interrupted by a Presidential Address. But for How Long?",
    "description": "What time is the Survivor finale on? How long will the interruption be?",
    "link": "https://www.today.com/popculture/tv/survivor-finale-49-what-time-trump-address-rcna249708",
    "timestamp": "2025-12-17T17:59:35Z"
  },
  {
    "title": "Venezuela Inflation Soars Above 500% as Trump Steps Up Pressure",
    "description": "Venezuelan inflation is skyrocketing as US President Donald Trump ratchets up his campaign to financially isolate the socialist regime in Caracas.",
    "link": "https://financialpost.com/pmn/business-pmn/venezuela-inflation-soars-above-500-as-trump-steps-up-pressure",
    "timestamp": "2025-12-17T17:58:35Z"
  },
  {
    "title": "Nebraska plans to be the first state to implement Trump’s new Medicaid work requirements",
    "description": "Trump signed a law requiring states to start enforcing the requirements by 2027.",
    "link": "https://www.bostonherald.com/2025/12/17/medicaid-work-requirements/",
    "timestamp": "2025-12-17T17:57:28Z"
  },
  {
    "title": "Ted Cruz Scolds Trump’s FCC Chair Over Jimmy Kimmel at Hearing",
    "description": "Sen. Ted Cruz (R-TX) scolded FCC Chairman Brendan Carr Wednesday about his role in the suspension of Jimmy Kimmel's late night ABC show -- but then let him get by with an answer that attacked Democrats and moved on.\nThe post Ted Cruz Scolds Trump’s FCC Chair …",
    "link": "https://www.mediaite.com/politics/ted-cruz-scolds-trumps-fcc-chair-over-jimmy-kimmel-at-hearing/",
    "timestamp": "2025-12-17T17:56:33Z"
  },
  {
    "title": "Fani Willis Melts Down As She Accuses Georgia State Senators Of ‘Trying To Intimidate’ Her",
    "description": "Fani Willis erupted on Wednesday while testifying before a special Georgia Senate committee scrutinizing her prosecution of President Donald Trump.",
    "link": "https://dailycaller.com/2025/12/17/fani-willis-melts-down-as-she-accuses-georgia-state-senators/",
    "timestamp": "2025-12-17T17:55:59Z"
  },
  {
    "title": "Son of filmmaker Rob Reiner makes court appearance on charges he murdered parents",
    "description": "LOS ANGELES, Dec 17 (Reuters) - The younger son of Hollywood filmmaker and political activist Rob Reiner made his first court appearance on Wednesday for the two murder charges he faces in the stabbing deaths of his parents, who were found slain in their Los …",
    "link": "https://www.thestar.com.my/news/world/2025/12/18/son-of-filmmaker-rob-reiner-makes-court-appearance-on-charges-he-murdered-parents",
    "timestamp": "2025-12-17T17:54:00Z"
  },
  {
    "title": "Billionaire Ray Dalio joins Michael Dell to back Trump Accounts",
    "description": "Billionaire Ray Dalio and his wife said they would donate $250 to the Trump Accounts of about 300,000 children in Connecticut.",
    "link": "https://www.businessinsider.com/ray-dalio-trump-accounts-donation-michael-dell-2025-12",
    "timestamp": "2025-12-17T17:52:08Z"
  },
  {
    "title": "Several countries immediately hit back at Trump's expanded travel ban",
    "description": "After implementing a travel ban, inspired by his first term in the White House, at the start of June, President Donald Trump announced it would expand to 20 more countries and the Palestinian Authority on Tuesday afternoon, Dec. 16.\nPassport holders from Mali…",
    "link": "https://biztoc.com/x/e7492ca9ee20f324",
    "timestamp": "2025-12-17T17:50:41Z"
  },
  {
    "title": "James Woods Opens Up About Friend Rob Reiner’s Death",
    "description": "Famous actor James Woods reflected on his friendship with Rob Reiner and called out the \"infuriating and distasteful\" comments made about him after his death.",
    "link": "https://dailycaller.com/2025/12/17/political-views-james-woods-defends-rob-reiner-hateful-comments-donald-trump-charlie-kirk-assassination/",
    "timestamp": "2025-12-17T17:49:45Z"
  },
  {
    "title": "How, and why, I invented OnlyFans. In 2004",
    "description": "Sometimes having a multi-billion dollar idea a decade ahead of the competition is the problem. The story of how, and why, I managed not to become a billionaire after inventing \"OnlyFans\".",
    "link": "https://themosthandsomemanintheworld.com/how-and-why-i-invented-onlyfans-in-2004/",
    "timestamp": "2025-12-17T17:48:21Z"
  },
  {
    "title": "Ex-Goldman Banker Berko Loses Bid to Dismiss US Bribery Case",
    "description": "Former Goldman Sachs Group Inc. banker Asante Berko, who was charged in 2020 of conspiring with at least two high-ranking Ghana officials in a bribery scheme, lost a long shot bid to have a judge dismiss the criminal case against him.",
    "link": "https://financialpost.com/pmn/business-pmn/ex-goldman-banker-berko-loses-bid-to-dismiss-us-bribery-case",
    "timestamp": "2025-12-17T17:48:16Z"
  },
  {
    "title": "Hegseth rejects release of full boat strike footage",
    "description": "There are calls to release video of the military killing two survivors of a Sept. 2 missile strike on an alleged drug trafficking boat",
    "link": "https://theweek.com/politics/hegseth-congress-boat-strike-video",
    "timestamp": "2025-12-17T17:47:47Z"
  },
  {
    "title": "Inmate reveals cheat code DOJ handed Ghislaine Maxwell as Trump mulls pardon",
    "description": "Residents of a Texas town that's home to a now-famous women’s prison camp are openly airing their concerns that President Donald Trump could pardon the most notorious inmate housed there.Chatter has picked up as the traditional Christmas pardoning season near…",
    "link": "https://www.rawstory.com/ghislaine-maxwell-pardon-2674414758/",
    "timestamp": "2025-12-17T17:47:26Z"
  },
  {
    "title": "The Lumbee Tribe's federal recognition is assured, with a final push by Trump",
    "description": "With the passage of the National Defense Authorization Act by the Senate on Wednesday, the Lumbee Tribe of North Carolina is all but assured to become a...",
    "link": "https://www.yahoo.com/news/articles/lumbee-tribes-federal-recognition-assured-174726546.html",
    "timestamp": "2025-12-17T17:47:26Z"
  },
  {
    "title": "US Congress passes defense bill defying Trump anti-Europe rhetoric",
    "description": "US lawmakers on Wednesday passed a sweeping defense policy bill, signaling ironclad bipartisan support for Europe and delivering a blistering repudiation of President Donald Trump’s increasingly hostile posture toward NATO and America’s closest allies. The co…",
    "link": "https://www.digitaljournal.com/world/us-congress-passes-defense-bill-defying-trump-anti-europe-rhetoric/article",
    "timestamp": "2025-12-17T17:47:20Z"
  },
  {
    "title": "Brown University gunman still at large as manhunt enters fifth day",
    "description": "Dec 17 (Reuters) - The gunman who killed two Brown University students remained at large on Wednesday, and there was no indication that authorities have grown closer to identifying the suspect four days after he opened fire inside a classroom and escaped into…",
    "link": "https://www.thestar.com.my/news/world/2025/12/18/brown-university-gunman-still-at-large-as-manhunt-enters-fifth-day",
    "timestamp": "2025-12-17T17:47:00Z"
  },
  {
    "title": "Putin predicts European ‘swine’ backing Ukraine will lose power",
    "description": "Russian president vows to liberate ‘historic lands’ in hardline speech",
    "link": "https://www.irishtimes.com/world/europe/2025/12/17/putin-predicts-european-swine-backing-ukraine-will-lose-power/",
    "timestamp": "2025-12-17T17:45:28Z"
  },
  {
    "title": "Treasury asks philanthropists to invest in Trump Accounts. Ray Dalio pledges for Connecticut kids",
    "description": "The U.S. Treasury asked major philanthropic donors to contribute to new investment accounts for children Wednesday in part of what Secretary Scott Bessent called a “50 State Challenge” to raise funds for the Trump Accounts program. The accounts were created a…",
    "link": "https://apnews.com/article/trump-accounts-ray-dalio-086e4ec76806711d88c6499961c37e71",
    "timestamp": "2025-12-17T17:45:17Z"
  },
  {
    "title": "Stock indexes fall while gold and silver rise with oil",
    "description": "NEW YORK/LONDON, Dec 17 : MSCI's global equities gauge fell with pressure from U.S. technology stocks while silver prices hit a record high and gold was angling for its seventh gain in a row on renewed hopes for Federal Reserve rate cuts and after U.S. Presid…",
    "link": "https://www.channelnewsasia.com/business/stock-indexes-fall-while-gold-and-silver-rise-oil-5612836",
    "timestamp": "2025-12-17T17:45:10Z"
  },
  {
    "title": "Stock indexes fall on AI angst while gold and silver rise with oil",
    "description": "NEW YORK/LONDON, Dec 17 : MSCI's global equities gauge fell on Wednesday, pressured by U.S. technology stocks, while silver prices hit a record high and gold rose for a seventh straight day on renewed hopes for Federal Reserve rate cuts and after U.S. Preside…",
    "link": "https://www.channelnewsasia.com/business/stock-indexes-fall-ai-angst-while-gold-and-silver-rise-oil-5612836",
    "timestamp": "2025-12-17T17:45:10Z"
  },
  {
    "title": "Shock Dem has lead for first time over Republican JD Vance in 2028 prez poll",
    "description": "Survey suggests that the next White House race could be very competitive.",
    "link": "https://www.silive.com/politics/2025/12/shock-dem-has-lead-for-first-time-over-republican-jd-vance-in-2028-prez-poll.html",
    "timestamp": "2025-12-17T17:44:41Z"
  },
  {
    "title": "Sheryl Sandberg says Silicon Valley’s hyper-masculine rhetoric is ‘terrible’—contributing to ‘one of the worst’ corporate climates she’s ever seen",
    "description": "\"We’ve seen this backsliding before, and that is not an excuse for companies not to do the right thing,” Meta’s former COO said.",
    "link": "https://fortune.com/2025/12/17/sheryl-sandberg-silicon-valley-hyper-masculine-culture-terrible-worst-work-environments-women-in-business/",
    "timestamp": "2025-12-17T17:44:23Z"
  },
  {
    "title": "‘It’s another clarifying moment in our age of moral collapse’",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-rob-reiner-death-nigeria-insurance",
    "timestamp": "2025-12-17T17:42:27Z"
  },
  {
    "title": "Billionaire Ray Dalio joins push to fund Trump Accounts, pledging $75 million to Connecticut kids",
    "description": "The U.S. Treasury asked major philanthropic donors to contribute to new investment accounts for children Wednesday in part of what Secretary Scott Bessent called a “50 State Challenge” to raise funds for the Trump Accounts program",
    "link": "https://abcnews.go.com/US/wireStory/billionaire-ray-dalio-joins-push-fund-trump-accounts-128489814",
    "timestamp": "2025-12-17T17:42:15Z"
  },
  {
    "title": "Jack Smith tells Congress he could prove Trump engaged in a 'criminal scheme' to overturn 2020 election",
    "description": "WASHINGTON — Former special counsel Jack Smith told a congressional committee Wednesday that his team found \"proof beyond a reasonable doubt” that President Donald Trump engaged in a “criminal scheme” to overturn the results of the 2020 election, according to…",
    "link": "https://www.nbcnews.com/politics/justice-department/jack-smith-tells-congress-prove-trump-engaged-criminal-scheme-overturn-rcna249715",
    "timestamp": "2025-12-17T17:41:28Z"
  },
  {
    "title": "Filmmaker Rob Reiner's son appears in court charged with murder of parents",
    "description": "Nick Reiner, who is accused of murdering his film director father Rob Reiner and mother Michele at their home in Los Angles, will be arraigned on January 7, his lawyer Alan Jackson said.",
    "link": "https://www.independent.ie/world-news/north-america/filmmaker-rob-reiners-son-appears-in-court-charged-with-murder-of-parents/a99599789.html",
    "timestamp": "2025-12-17T17:39:46Z"
  },
  {
    "title": "Silver soars past $66 as gold hits new heights on Fed hopes",
    "description": "Silver prices shattered records on Wednesday, surging past $66 per ounce for the first time in history as investors piled into precious metals amid growing expectations that the Federal Reserve will cut interest rates in 2026. The white metal climbed approxim…",
    "link": "https://rollingout.com/2025/12/17/silver-soars-past-66-as-gold-hits-new/",
    "timestamp": "2025-12-17T17:39:06Z"
  },
  {
    "title": "Trump’s National Guard deployment in Washington can continue for now, an appeals court says",
    "description": "The decision stays a lower-court ruling that had ordered an end to the troops' presence.",
    "link": "https://www.bostonherald.com/2025/12/17/national-guard-washington/",
    "timestamp": "2025-12-17T17:39:03Z"
  },
  {
    "title": "Billionaire Ray Dalio joins push to fund Trump Accounts, pledging $75 million to Connecticut kids",
    "description": "The U.S. Treasury asked major philanthropic donors to contribute to new investment accounts for children Wednesday as part of what Secretary Scott Bessent...",
    "link": "https://finance.yahoo.com/news/billionaire-ray-dalio-joins-push-173813511.html",
    "timestamp": "2025-12-17T17:38:13Z"
  },
  {
    "title": "Billionaire Ray Dalio joins push to fund Trump Accounts, pledging $75 million to Connecticut kids",
    "description": "The U.S. Treasury asked major philanthropic donors to contribute to new investment accounts for children Wednesday as part of what Secretary Scott Bessent...",
    "link": "https://finance.yahoo.com/news/billionaire-ray-dalio-joins-push-173813388.html",
    "timestamp": "2025-12-17T17:38:13Z"
  },
  {
    "title": "Who is Laura Loomer? Trump accidentally spills MAGA influencer's engagement news",
    "description": "President Donald Trump revealed the engagement of far-right activist Laura Loomer during a White House Christmas party. Loomer, a known supporter of Trump, confirmed the news on social media. She expressed excitement about her upcoming marriage and thanked th…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/who-is-laura-loomer-trump-accidentally-spills-maga-influencers-engagement-news/articleshow/126042556.cms",
    "timestamp": "2025-12-17T17:37:13Z"
  },
  {
    "title": "Trafficked, exploited, married off: Rohingya children’s lives crushed by foreign aid cuts",
    "description": "Violations against children in the camps have risen sharply this year, according to UNICEF.",
    "link": "https://www.bostonherald.com/2025/12/17/foreign-aid-the-lost-children/",
    "timestamp": "2025-12-17T17:36:41Z"
  },
  {
    "title": "Which countries people are fleeing from – and why",
    "description": "With Trump’s immigration crackdown intensifying, what factors are prompting people to leave their countries?",
    "link": "https://theconversation.com/which-countries-people-are-fleeing-from-and-why-268930",
    "timestamp": "2025-12-17T17:34:50Z"
  },
  {
    "title": "White House aide's claim about 'special' Trump 'spaces' startles Vanity Fair editor",
    "description": "A White House aide startled one of the Vanity Fair staffers during a photoshoot to illustrate a bombshell report based on interviews with President Donald Trump's chief of staff.Mark Guiducci, the magazine's global editorial director, accompanied photographer…",
    "link": "https://www.rawstory.com/vanity-fair-white-house/",
    "timestamp": "2025-12-17T17:33:57Z"
  },
  {
    "title": "Warner Bros Discovery rejects Paramount’s hostile takeover bid",
    "description": "Board's decision comes day after Affinity Partners, fund backed by Trump son-in-law Jared Kushner, pulled out of deal.",
    "link": "https://www.aljazeera.com/economy/2025/12/17/warner-bros-discovery-rejects-paramounts-hostile-takeover-bid",
    "timestamp": "2025-12-17T17:33:45Z"
  },
  {
    "title": "Trump 'Taking a Sledgehammer' to One of World's Most Vital Climate Research Center, Scientists Warn",
    "description": "One US House Democrat pledged Tuesday night that Colorado officials will fight the Trump administration's latest attack on science \"with every legal tool that we have\" after top White House budget adviser Russell Vought announced a decision to break up a cruc…",
    "link": "https://www.commondreams.org/news/science-and-climate-change",
    "timestamp": "2025-12-17T17:32:49Z"
  },
  {
    "title": "Ford’s New EV Strategy: A Pivot, And A Hedge",
    "description": "One of America's iconic car makers struggles to balance capital risk with policy risk after sustaining billions in losses making cars consumers didn't want to buy.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/12/17/fords-new-ev-strategy-a-pivot-and-a-hedge/",
    "timestamp": "2025-12-17T17:31:07Z"
  },
  {
    "title": "Israel's Netanyahu demands Western governments act to battle antisemitism: 'Heed our warnings'",
    "description": "Israeli Prime Minister Benjamin Netanyahu is demanding that Western nations battle antisemitism and ensure the safety of Jewish individuals.",
    "link": "https://www.foxnews.com/world/israels-netanyahu-demands-western-governments-act-battle-antisemitism-heed-our-warnings",
    "timestamp": "2025-12-17T17:30:00Z"
  },
  {
    "title": "Jack Smith tells lawmakers his team developed 'proof beyond a reasonable doubt' against Trump...",
    "description": "Former Justice Department special counsel Jack Smith has told lawmakers in a closed-door interview his team “developed proof beyond a reasonable doubt” President Donald Trump criminally conspired to overturn his 2020 election loss. That's according to portion…",
    "link": "https://apnews.com/article/jack-smith-congress-justice-department-d35557d525fcfe51a20d08c6abb7f71d",
    "timestamp": "2025-12-17T17:28:37Z"
  },
  {
    "title": "Ghislaine lawyer warns unsealing will spark retrial...",
    "description": "Ghislaine lawyer warns unsealing will spark retrial...\r\n\n \n \n \n (Top headline, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:'FULL' EPSTEIN FILES SET FOR RELEASE...\r\nWhat DOJ is required to disclose, and what could be withheld...",
    "link": "https://www.themirror.com/news/politics/ghislaine-maxwells-lawyer-warns-unsealing-1566821",
    "timestamp": "2025-12-17T17:28:36Z"
  },
  {
    "title": "Democrat wins election by 47-point landslide in Kentucky",
    "description": "Democrat Gary Clemons, a South Louisville union leader and U.S. Army veteran, won Kentucky’s vacant Senate District 37 seat on Tuesday in a roughly 47.5‑point landslide, taking 72.6 percent of the vote to Republican Calvin Leach’s 25.1 percent, according to u…",
    "link": "https://freerepublic.com/focus/f-news/4357824/posts",
    "timestamp": "2025-12-17T17:28:11Z"
  },
  {
    "title": "FCC Chairman Brendan Carr Grilled In Senate Over His Jimmy Kimmel “Easy Way Or The Hard Way” Warning To ABC Stations",
    "description": "FCC Chairman Brendan Carr faced his first congressional grilling over his comments about Jimmy Kimmel on Wednesday, as Democrats claimed that he has operated the agency to go after critics of Donald Trump. Carr at once claimed that he was not threatening broa…",
    "link": "http://deadline.com/2025/12/fcc-jimmy-kimmel-senate-hearing-1236651060/",
    "timestamp": "2025-12-17T17:28:05Z"
  },
  {
    "title": "Senate sends $901B defense bill to Trump after clashes over boat strike, DC airspace",
    "description": "Despite possible hiccups, the Senate coalesced around the National Defense Authorization Act of 2026, marking one of the final legislative hurdles the upper chamber had to overcome for the year.",
    "link": "https://www.foxnews.com/politics/senate-sends-901b-defense-bill-trump-after-clashes-over-boat-strike-dc-airspace",
    "timestamp": "2025-12-17T17:26:15Z"
  },
  {
    "title": "Democrats notch blowout win in Kentucky district Trump allies eyed as a flip",
    "description": "Democrats extended their special election hot streak Tuesday with a decisive landslide in Kentucky Senate District 37, a Louisville-area seat Republicans hoped to make competitive after a close 2024 presidential showing. Democrat Gary Clemons crushed GOP nomi…",
    "link": "https://www.rawstory.com/voting-2674407823/",
    "timestamp": "2025-12-17T17:25:02Z"
  }
]