[
  {
    "title": "James Comer Says Shooting of National Guard Members in D.C. Shows ‘We Do Need More National Guard Troops in Washington’",
    "description": "Rep. James Comer said he fully supports President Trump's plan to deploy 500 more National Guard members to Washington, D.C., hours after two troops were shot\nThe post James Comer Says Shooting of National Guard Members in D.C. Shows ‘We Do Need More National…",
    "link": "https://www.mediaite.com/media/james-comer-says-shooting-of-national-guard-members-in-d-c-shows-we-do-need-more-national-guard-troops-in-washington/",
    "timestamp": "2025-11-27T01:06:35Z"
  },
  {
    "title": "Donald Trump Should Stick to His Guns on Venezuela",
    "description": "The U.S. president was right to resist regime change before, and he should do so again now.",
    "link": "http://foreignpolicy.com/2025/11/26/trump-resist-regime-change-venezuela/",
    "timestamp": "2025-11-27T01:04:50Z"
  },
  {
    "title": "‘Why in the Hell Are You Doing That?’ Fox News Contributor Slams Trump’s Deployment of More National Guard Members After D.C. Shooting",
    "description": "Fox News contributor Ted Williams bashed President Donald Trump's decision to deploy 500 additional National Guard members to Washington, D.C., after two soldiers were shot.\nThe post ‘Why in the Hell Are You Doing That?’ Fox News Contributor Slams Trump’s Dep…",
    "link": "https://www.mediaite.com/media/tv/why-in-the-hell-are-you-doing-that-fox-news-contributor-slams-trumps-deployment-of-more-national-guard-members-after-d-c-shooting/",
    "timestamp": "2025-11-27T01:03:00Z"
  },
  {
    "title": "Colorado doesn’t plan to transfer imprisoned former county clerk to federal custody",
    "description": "Peters’ release has become a cause celebre in the election conspiracy movement.",
    "link": "https://www.bostonherald.com/2025/11/26/trump-colorado-clerk/",
    "timestamp": "2025-11-27T01:01:17Z"
  },
  {
    "title": "Pro-Trump CEO Slams Tariffs On MAGA TV",
    "description": "The Real America's Voice MAGA network has begun pushing back against President Donald Trump's tariffs by highlighting his small-business supporters who have been hit hard.\n\n\nOn Monday, Real America's Voice host David Brody spoke to Kenneth Bernardo of the Bay…",
    "link": "https://crooksandliars.com/2025/11/pro-trump-ceo-slams-tariffs-maga-tv",
    "timestamp": "2025-11-27T01:00:01Z"
  },
  {
    "title": "Trump urged Japan PM to avoid escalation in China dispute, sources say",
    "description": "US President Donald Trump advised Japanese Prime Minister Sanae Takaichi to de-escalate a dispute with China over Taiwan. This call followed discussions between Trump and Chinese President Xi Jinping. China claims Taiwan, while Taiwan insists on self-determin…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-urged-japan-pm-to-avoid-escalation-in-china-dispute-sources-say/articleshow/125602423.cms",
    "timestamp": "2025-11-27T00:53:27Z"
  },
  {
    "title": "North Carolina Can Use Republican-Friendly Congressional Map, Court Says - The New York Times",
    "description": "North Carolina Can Use Republican-Friendly Congressional Map, Court SaysThe New York Times Judges allow North Carolina to use Republican-drawn congressional mapThe Guardian Federal Court Greenlights North Carolina’s Trump-Ordered GerrymanderDemocracy Docket D…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180219979",
    "timestamp": "2025-11-27T00:52:40Z"
  },
  {
    "title": "Let's Make Sure No One Wants To Visit America (Erik Loomis/Lawyers, Guns & Money)",
    "description": "Erik Loomis / Lawyers, Guns & Money:\nLet's Make Sure No One Wants To Visit America  —  Donald Trump continues to show his amazing business genius, doubling down on trying to end international tourism in America through drastically hiking entrance fees into na…",
    "link": "https://www.memeorandum.com/251126/p120",
    "timestamp": "2025-11-27T00:50:00Z"
  },
  {
    "title": "'Republicans in no-win position' as Trump pushes health plan that would 'freeze out' many - NewsBreak",
    "description": "A proposed healthcare plan from the Trump administration would \"freeze out a lot of people\", a political commentator has warned. The repeal of Affordable C",
    "link": "https://www.newsbreak.com/share/4367598283269-republicans-in-no-win-position-as-trump-pushes-health-plan-that-would-freeze-out-many?s=a2&amp;share_destination_id=MjM0MDQ4ODgtMTc2NDIwNDU1MDE4Mg%3D%3D&amp;pd=01aCgCa3&amp;hl=en_US&amp;send_time=1764204550&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.3.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-27T00:49:38Z"
  },
  {
    "title": "Report: Democrat Sen. Jon Ossoff Took Credit for Funding Bill Before Voting Against It",
    "description": "Sen. Jon Ossoff (D-GA) voted against the final passage of the funding bill that he previously bragged about supporting, with media outlets ignoring the flip-flop after reporting that he had secured a \"historic\" investment for his state.\nThe post Report: Democ…",
    "link": "https://www.breitbart.com/politics/2025/11/26/report-dem-sen-jon-ossoff-took-credit-for-funding-bill-before-voting-against-it/",
    "timestamp": "2025-11-27T00:49:25Z"
  },
  {
    "title": "What we know about the Washington, D.C., shooting of two National Guard members",
    "description": "Two National Guard members were shot in broad daylight in Washington, D.C., on Wednesday afternoon, just one day before Thanksgiving, in what officials described as a \"targeted\" attack",
    "link": "https://www.nbcnews.com/news/us-news/what-to-know-dc-national-guard-shooting-rahmanullah-lakanwal-rcna246154",
    "timestamp": "2025-11-27T00:48:45Z"
  },
  {
    "title": "Judges Allow North Carolina To Use A Map Drawn In Bid To Give Republicans Another U.S. House Seat",
    "description": "Federal judges have allowed North Carolina to use a redrawn congressional map designed to give Republicans an additional U.S. House seat.",
    "link": "https://www.huffpost.com/entry/election-2026-redistricting-north-carolina_n_69279c95e4b034dca9c504f5",
    "timestamp": "2025-11-27T00:44:12Z"
  },
  {
    "title": "National Guard soldiers shot in 'targeted' attack near White House",
    "description": "Two National Guard soldiers were shot in a targeted ambush near the White House. The suspect is in custody after being wounded. The incident prompted a lockdown of the White House. Officials are investigating the shooting as an act of terrorism. The motive re…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/two-national-guard-soldiers-shot-in-targeted-attack-near-white-house/articleshow/125602356.cms",
    "timestamp": "2025-11-27T00:42:56Z"
  },
  {
    "title": "North Carolina can use GOP-drawn congressional map designed to add another Republican House seat, court rules",
    "description": "The federal court allowed the state to use a new Republican-drawn congressional map that would help the GOP pick up another House seat in next year's midterms.",
    "link": "https://www.nbcnews.com/politics/2026-election/federal-court-allows-north-carolina-use-new-republican-drawn-map-2026-rcna246156",
    "timestamp": "2025-11-27T00:34:46Z"
  },
  {
    "title": "Issue instructions to deport illegals from Bengal, BJP tells EC",
    "description": "India News: NEW DELHI: Upping the ante in its political battle with TMC over the Special Intensive Revision (SIR) of electoral roll in West Bengal, BJP on Wednesd.",
    "link": "https://timesofindia.indiatimes.com/india/issue-instructions-to-deport-illegals-from-bengal-bjp-tells-ec/articleshow/125602289.cms",
    "timestamp": "2025-11-27T00:34:19Z"
  },
  {
    "title": "EXCLUSIVE: 'Insane' Moment OJ Simpson 'Recreated' Wife's Knife Slaughter With a BANANA Resurfaces Thanks to Reality Show",
    "description": "A resurfaced clip showing OJ Simpson 'recreating' a knife scene using a banana as resurfaced.",
    "link": "https://radaronline.com/p/oj-simpson-recreated-knife-scene-with-banana-video/",
    "timestamp": "2025-11-27T00:20:00Z"
  },
  {
    "title": "Bihar battle won, now prep for Bengal & Tamil Nadu: Amit Shah to party workers",
    "description": "India News: NEW DELHI: Asserting that NDA's big win in Bihar is the victory of every Indian's resolve to throw out infiltrators from the country, home minister Am.",
    "link": "https://timesofindia.indiatimes.com/india/bihar-battle-won-now-prep-for-bengal-tamil-nadu-amit-shah-to-party-workers/articleshow/125602253.cms",
    "timestamp": "2025-11-27T00:19:18Z"
  },
  {
    "title": "​GOP strategist says Trump's attacks on Democratic veterans are already backfiring",
    "description": "Ever since President Donald Trump called for the imprisonment of several Democratic members of Congress — even endorsing a call for them to be hanged — their national profiles have been significantly elevated. One Republican strategist is warning that Trump m…",
    "link": "https://www.rawstory.com/alternet-posts/trump-backfiring/",
    "timestamp": "2025-11-27T00:18:52Z"
  },
  {
    "title": "Miss Universe owners in Mexico, Thailand hit with fraud, trafficking claims",
    "description": "The Miss Universe beauty pageant was hit by fresh scandal days after it ended, with the Mexican co-owner of the contest accused of trafficking drugs and arms and his Thai counterpart accused of fraud. This year’s Miss Universe contest concluded last week in T…",
    "link": "https://www.digitaljournal.com/world/miss-universe-owners-in-mexico-thailand-hit-with-fraud-trafficking-claims/article",
    "timestamp": "2025-11-27T00:17:20Z"
  },
  {
    "title": "Gunman Who Shot National Guardsmen Identified As Afghan National",
    "description": "The gunman who allegedly shot two West Virginia National Guard personnel has been identified as an Afghan national, according to multiple media outlets.",
    "link": "https://dailycaller.com/2025/11/26/gunman-who-shot-national-guardsmen-identified-as-afghan-national/",
    "timestamp": "2025-11-27T00:16:00Z"
  },
  {
    "title": "Two National Guard members in critical condition after shooting near White House",
    "description": "The lone suspect - whose motive is unknown - is in custody after opening fire on the soldiers, before being subdued.",
    "link": "https://www.bbc.com/news/articles/c3r7qpqddnro",
    "timestamp": "2025-11-27T00:15:50Z"
  },
  {
    "title": "‘Wearing uniforms and wearing masks’: Reporter takes mere minutes to blame ICE for shooting of National Guardsmen",
    "description": "MS NOW's Ken Dilanian suggests that anger toward immigration enforcement played into incident",
    "link": "https://www.wnd.com/2025/11/wearing-uniforms-wearing-masks-reporter-takes-mere-minutes/",
    "timestamp": "2025-11-27T00:09:37Z"
  },
  {
    "title": "Liberals Blame Trump for National Guard Shooting",
    "description": "THE DAILY CALLER NEWS FOUNDATION—Two National Guard members were shot in Washington, D.C. on Wednesday; a tragedy that immediately spurred a deluge of prominent liberal... Read More\nThe post Liberals Blame Trump for National Guard Shooting appeared first on T…",
    "link": "https://www.dailysignal.com/2025/11/26/liberals-blame-trump-for-national-guard-shooting/",
    "timestamp": "2025-11-27T00:08:53Z"
  },
  {
    "title": "Thankfulness isn’t a ‘problem’ — let’s bring humility back to the holiday",
    "description": "When was the last time you heard a national leader recommend penitence? For much of American history, it was part and parcel of Thanksgiving observance.",
    "link": "https://nypost.com/2025/11/26/opinion/thankfulness-isnt-a-problem-lets-bring-humility-back/",
    "timestamp": "2025-11-27T00:08:19Z"
  },
  {
    "title": "'This is the scandal': Experts floored as 'staggering' figures undercut key Trump pledge",
    "description": "The libertarian Cato Institute this week further undermined the Trump administration’s claims that it is targeting “the worst of the worst” with its violent immigration operations in communities across the United States by publishing data about the criminal h…",
    "link": "https://www.rawstory.com/donald-trump-ice/",
    "timestamp": "2025-11-27T00:07:24Z"
  },
  {
    "title": "Trump backs Asfura to counter Maduro influence in Honduras",
    "description": "United States President Donald Trump took to Truth Social to weigh in on Honduras' upcoming election. He said \"Democracy is on trial\" and urged voters to support National Party candidate...",
    "link": "https://biztoc.com/x/8d819970bd6ffc7a",
    "timestamp": "2025-11-27T00:05:56Z"
  },
  {
    "title": "Trump transition team discloses donors one year after pledged release (Bridget Bowman/NBC News)",
    "description": "Bridget Bowman / NBC News:\nTrump transition team discloses donors one year after pledged release  —  The 45-person list includes Education Secretary Linda McMahon and Commerce Secretary Howard Lutnick, who both co-chaired the transition.  —  President Donald …",
    "link": "https://www.memeorandum.com/251126/p115",
    "timestamp": "2025-11-27T00:05:00Z"
  },
  {
    "title": "Why the Meandering Borders of Ukraine Are No Hill For America First To Die On",
    "description": "Here we go again. The Donald had no more than offered a constructive 28-point plan that correctly identified America’s Homeland Security interest in Ukraine as nichts, nada, nugatory and nyet – when the Washington neocon brigade that he foolishly invited back…",
    "link": "https://original.antiwar.com/david_stockman/2025/11/26/why-the-meandering-borders-of-ukraine-are-no-hill-for-america-first-to-die-on/",
    "timestamp": "2025-11-27T00:00:53Z"
  },
  {
    "title": "An Unexpected Con To End Free Speech",
    "description": "Rooting out terrorism and antisemitism was the supposed reason that plainclothed ICE agents arrested doctoral student Rümeysa Öztürk on a street in Somerville, Massachusetts, after she coauthored an op-ed calling on Tufts University to divest from companies w…",
    "link": "https://original.antiwar.com/mattea_kramer/2025/11/26/an-unexpected-con-to-end-free-speech/",
    "timestamp": "2025-11-27T00:00:53Z"
  },
  {
    "title": "Al Sharpton Wastes No Time Blaming Trump For National Guard Shooting",
    "description": "Al Sharpton quickly pointed the finger at President Donald Trump on Wednesday after two National Guard soldiers were shot and critically wounded on Thanksgiving Eve.",
    "link": "https://dailycaller.com/2025/11/26/al-sharpton-blames-trump-national-guard-shooting/",
    "timestamp": "2025-11-26T23:59:59Z"
  },
  {
    "title": "National Guard Shooting Suspect Believed to Be Afghan National: Report",
    "description": "The suspect alleged to have shot and killed two National Guard troops in Washington, D.C. on Wednesday, is believed to be an Afghan national, according to three law enforcement sources who spoke with CBS News.\nThe post National Guard Shooting Suspect Believed…",
    "link": "https://www.mediaite.com/media/news/national-guard-shooting-suspect-believed-to-be-afghan-national-report/",
    "timestamp": "2025-11-26T23:58:11Z"
  },
  {
    "title": "Hegseth: Trump Requests 500 More Guardsmen for D.C.",
    "description": "In the aftermath of Wednesday’s shooting of two National Guard troops near the White House, War Secretary Pete Hegseth said President Donald Trump has requested the deployment of another 500 Guard members to the nation’s capital. \"President Trump has asked me…",
    "link": "https://freerepublic.com/focus/f-bloggers/4354768/posts",
    "timestamp": "2025-11-26T23:55:23Z"
  },
  {
    "title": "Hegseth: Trump Requests 500 More Guardsmen for D.C.",
    "description": "In the aftermath of Wednesday’s shooting of two National Guard troops near the White House, War Secretary Pete Hegseth said President Donald Trump has requested the deployment of another 500 Guard members to the nation’s capital. \"President Trump has asked me…",
    "link": "https://freerepublic.com/focus/f-news/4354768/posts",
    "timestamp": "2025-11-26T23:55:23Z"
  },
  {
    "title": "Deranged Libs Immediately Blame Trump For National Guard Shooting",
    "description": "Prominent liberal commentators and activists took to social media to blame Donald Trump after two National Guard members were shot in Washington, D.C.",
    "link": "https://dailycaller.com/2025/11/26/deranged-libs-blame-trump-for-national-guard-shooting/",
    "timestamp": "2025-11-26T23:55:03Z"
  },
  {
    "title": "Contextualizing claims State Department declared abortion, DEI and LGBTQ+ rights 'human rights violations'",
    "description": "Outlets reported U.S. diplomats are now required \"to scrutinize the prevalence of abortion and gender-transition surgery among children.\"",
    "link": "https://www.snopes.com//news/2025/11/26/aborton-dei-lgbtq-human-rights/",
    "timestamp": "2025-11-26T23:53:00Z"
  },
  {
    "title": "Contextualizing claims State Department declared abortion, DEI and LGBTQ+ rights 'human rights violations'",
    "description": "Outlets reported U.S. diplomats are now required \"to scrutinize the prevalence of abortion and gender-transition surgery among children.\"",
    "link": "https://www.snopes.com/news/2025/11/26/aborton-dei-lgbtq-human-rights/",
    "timestamp": "2025-11-26T23:53:00Z"
  },
  {
    "title": "Do the lessons of the Holocaust apply to Israel and “skinny Palestinians”?",
    "description": "Sarah Hurwitz acknowledges sounding obscene to younger Jews concerned with the Gaza genocide.",
    "link": "https://electronicintifada.net/blogs/michael-f-brown/do-lessons-holocaust-apply-israel-and-skinny-palestinians",
    "timestamp": "2025-11-26T23:50:34Z"
  },
  {
    "title": "Thailand’s pork industry fears influx of cheap US imports under Trump",
    "description": "Thai pork producers are bracing for intense competition as the US seeks duty-free access to a $3bn market.",
    "link": "https://www.aljazeera.com/economy/2025/11/26/thailands-pork-industry-fears-influx-of-cheap-us-imports-under-trump",
    "timestamp": "2025-11-26T23:49:06Z"
  },
  {
    "title": "White House blasts MS NOW correspondent's 'beyond sick' reaction to DC shooting of National Guardsmen",
    "description": "MS NOW correspondent Ken Dilanian went viral for saying some \"might object\" to National Guard presence in American cities following the DC shooting.",
    "link": "https://www.foxnews.com/media/white-house-blasts-ms-now-correspondents-beyond-sick-reaction-dc-shooting-national-guardsmen",
    "timestamp": "2025-11-26T23:47:29Z"
  },
  {
    "title": "What Democrats Have Recently Said About National Guard",
    "description": "Amid the tragic news that 2 National Guard members had been shot in Washington, D.C., Wednesday, social media users drew attention to recent comments by... Read More\nThe post What Democrats Have Recently Said About National Guard appeared first on The Daily S…",
    "link": "https://www.dailysignal.com/2025/11/26/what-democrats-have-recently-said-about-national-guard/",
    "timestamp": "2025-11-26T23:46:05Z"
  },
  {
    "title": "Billboards Urging National Guardsmen to Refuse Orders from Trump Admin Sprout Up Around Country",
    "description": "A left-wing group is putting up billboards in high-crime cities where President Donald Trump deployed the National Guard, telling military service members that is not what they \"signed up for\" and encouraging them to refuse \"unlawful orders.\"\nThe post Billboa…",
    "link": "https://www.breitbart.com/national-security/2025/11/26/billboards-urging-national-guardsmen-to-refuse-orders-from-trump-admin-sprout-up-around-country/",
    "timestamp": "2025-11-26T23:45:44Z"
  },
  {
    "title": "Kennedy Katch and Kill Kontinued",
    "description": "Ryan Lizza has further elaborated on his accusations that Olivia Nuzzi was acting as an operative for Robert F. Kennedy Jr. while presenting herself to the public as a reporter: The ex-fiancé of Robert F. Kennedy Jr.’s digital lover, Olivia Nuzzi, is now clai…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/kennedy-katch-and-kill-kontinued",
    "timestamp": "2025-11-26T23:44:07Z"
  },
  {
    "title": "Trump-MbS Meeting Was Strained Behind Closed Doors: 'Disappointment & Irritation'",
    "description": "Trump-MbS Meeting Was Strained Behind Closed Doors: 'Disappointment & Irritation'\n \nAxios reported some new details this week related to the recent meeting between US President Donald Trump and Saudi Crown Prince Mohammed bin Salman at the White House.\nThere …",
    "link": "https://biztoc.com/x/dffbca45cd529185",
    "timestamp": "2025-11-26T23:44:00Z"
  },
  {
    "title": "Wednesday Night Open Thread",
    "description": "Everyone gets a complimentary seagull at my hotel, and we have named ours Milton. Within five minutes of being here I put my hand in a pile of bird shit on the railing. So everything is as it should be. We’re heading out for dinner so I will keep this brief. …",
    "link": "https://balloon-juice.com/2025/11/26/wednesday-night-open-thread-88/",
    "timestamp": "2025-11-26T23:40:28Z"
  },
  {
    "title": "Trump's bizarre justification shares a grim parallel with maritime cannibalism",
    "description": "By Martin Danahay, Professor, English Language and Literature, Brock University The Trump administration has authorized killing people in boats on the Caribbean Sea and eastern Pacific, claiming they’re transporting illegal drugs.Maritime and international la…",
    "link": "https://www.rawstory.com/trump-venezuela-2674338629/",
    "timestamp": "2025-11-26T23:36:14Z"
  },
  {
    "title": "Judges allow North Carolina to use a map drawn in bid to give Republicans another US House seat",
    "description": "A three-judge panel denied a preliminary injunction request, acting after a hearing in mid-November.",
    "link": "https://www.bostonherald.com/2025/11/26/election-2026-redistricting-north-carolina-judges/",
    "timestamp": "2025-11-26T23:36:04Z"
  },
  {
    "title": "Trump backs conservative Asfura in Honduras' tight presidential race",
    "description": "(Reuters) -U.S. President Donald Trump weighed in on Honduras' tightly contested presidential race on Wednesday, backing Nasry Asfura of the conservative National Party, saying he can work with Asfura to counter drug trafficking. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/27/trump-backs-conservative-asfura-in-honduras039-tight-presidential-race",
    "timestamp": "2025-11-26T23:35:00Z"
  },
  {
    "title": "Bitcoin Rises Back Above $90,000 as Investors Expect Interest Rate Cuts",
    "description": "The price of Bitcoin rose above $90,000 for the first time in about a week, recovering after a month-long selloff, Bloomberg reported Wednesday (Nov. 26). Bitcoin exchange-traded funds (ETFs) also saw a turnaround, with inflows of $130 million on Tuesday (Nov…",
    "link": "https://www.pymnts.com/blockchain/bitcoin/2025/bitcoin-rises-back-above-90000-as-investors-expect-interest-rate-cuts/",
    "timestamp": "2025-11-26T23:33:32Z"
  },
  {
    "title": "Olivia Nuzzi’s Ex Accuses Her of Being RFK Jr.’s ‘Private Political Operative’ in Latest Bombshell",
    "description": "Ryan Lizza alleges that Nuzzi advised Kennedy on campaign strategy, killed potentially negative stories and helped navigate his Donald Trump endorsement\nThe post Olivia Nuzzi’s Ex Accuses Her of Being RFK Jr.’s ‘Private Political Operative’ in Latest Bombshel…",
    "link": "https://www.thewrap.com/ryan-lizza-olivia-nuzzi-rfk-jr-political-operative/",
    "timestamp": "2025-11-26T23:31:08Z"
  },
  {
    "title": "Oaths Of Office, And How Everyone Not Moving To Impeach Trump Is Violating Their Own",
    "description": "Until very recently the only member of Congress excused from not having moved to impeach Trump was Rep. Grijalva, because until someone swore her in there was nothing she could officially do. But for everyone else already sworn into this 119th Congress, there…",
    "link": "https://www.techdirt.com/2025/11/26/oaths-of-office-and-how-everyone-not-moving-to-impeach-trump-is-violating-their-own/",
    "timestamp": "2025-11-26T23:30:52Z"
  },
  {
    "title": "Zohran Mamdani, put your grin to good use — and prod courtesy from NYC workers",
    "description": "The mayor-elect can employ his smiley superpower to improve daily life for New Yorkers by making the city’s 300,000 employees turn on the charm when they interact with the public.",
    "link": "https://nypost.com/2025/11/26/opinion/zohran-mamdani-put-your-grin-to-good-use-and-prod-courtesy-from-nyc-workers/",
    "timestamp": "2025-11-26T23:29:15Z"
  },
  {
    "title": "‘From reliance to resilience’: Carney offers fresh support for steel, lumber industries",
    "description": "While the Canadian economy has showed some resilience in recent months, the targetted industries have been hit hard as exports to the U.S. have tumbled",
    "link": "https://nationalpost.com/news/canada/from-reliance-to-resilience-carney-offers-fresh-support-for-steel-lumber-industries",
    "timestamp": "2025-11-26T23:27:35Z"
  },
  {
    "title": "Watch: How the shooting of two National Guard members unfolded",
    "description": "The two soldiers are in critical condition after being attacked blocks from the White House in Washington DC.",
    "link": "https://www.bbc.com/news/videos/cly1k34y426o",
    "timestamp": "2025-11-26T23:27:17Z"
  },
  {
    "title": "Blood on the streets, silence in the hall",
    "description": "Explore the escalating Nigeria security crisis as mass killings and kidnappings surge. Why is the government silent amid calls for decisive action?\n\nRead More: https://punchng.com/blood-on-the-streets-silence-in-the-hall/",
    "link": "https://punchng.com/blood-on-the-streets-silence-in-the-hall/",
    "timestamp": "2025-11-26T23:23:04Z"
  },
  {
    "title": "Tinubu sends three ambassadorial nominees to Senate",
    "description": "President Bola Tinubu has transmitted the names of three ambassadorial nominees to the Nigerian Senate for screening and confirmation after a mass recall.\n\nRead More: https://punchng.com/tinubu-sends-three-ambassadorial-nominees-to-senate/",
    "link": "https://punchng.com/tinubu-sends-three-ambassadorial-nominees-to-senate/",
    "timestamp": "2025-11-26T23:20:05Z"
  },
  {
    "title": "Dominican Republic grants U.S. access to restricted areas for its fight against drug trafficking",
    "description": "It is the first major public agreement that the U.S. has struck with a Caribbean nation as it seeks friendly allies to support its attacks against alleged drug-smuggling boats in the region and beyond.",
    "link": "https://www.pbs.org/newshour/politics/dominican-republic-grants-u-s-access-to-restricted-areas-for-its-fight-against-drug-trafficking",
    "timestamp": "2025-11-26T23:17:24Z"
  },
  {
    "title": "Two National Guards Not Dead: FBI Director Reveals 'Critical Condition' After Gov. Morrisey Blunder",
    "description": "FBI Director Kash Patel confirms two National Guard members remain in critical condition following a targeted DC ambush, correcting West Virginia Governor Patrick Morrisey's erroneous fatality report.",
    "link": "https://www.ibtimes.com/two-national-guards-not-dead-fbi-director-reveals-critical-condition-after-gov-morrisey-blunder-3791469",
    "timestamp": "2025-11-26T23:15:06Z"
  },
  {
    "title": "Here's where all the legal cases against Trump stand since his return to the White House (Associated Press)",
    "description": "Associated Press:\nHere's where all the legal cases against Trump stand since his return to the White House  —  Before he fought his way back to the White House, President Donald Trump was in court battling a slew of civil lawsuits and criminal charges that th…",
    "link": "https://www.memeorandum.com/251126/p104",
    "timestamp": "2025-11-26T23:10:01Z"
  },
  {
    "title": "AI Most Likely to Be Named TIME's 2025 Person of the Year at 36% Odds, Beating Trump and Pope Leo",
    "description": "Artificial intelligence leads the race for TIME's 2025 Person of the Year with a 36% chance, ahead of NVIDIA's Jensen Huang, Pope Leo XIV, and Donald Trump.",
    "link": "https://www.ibtimes.com/ai-most-likely-named-times-2025-person-year-36-odds-beating-trump-pope-leo-3791443",
    "timestamp": "2025-11-26T23:09:45Z"
  },
  {
    "title": "FACT FOCUS: It is not illegal for voters to show ID in New York and California",
    "description": "Social media users are using false information to advocate for more voter ID laws.",
    "link": "https://www.bostonherald.com/2025/11/26/fact-check-voter-id-california-new-york/",
    "timestamp": "2025-11-26T23:09:37Z"
  },
  {
    "title": "Canada announces new support for lumber, steel industries hit by tariffs",
    "description": "The new plan comes amid stalled trade talks between Ottawa and Washington.",
    "link": "https://www.aljazeera.com/economy/2025/11/26/canada-announces-new-support-for-lumber-steel-industries-hit-by-tariffs",
    "timestamp": "2025-11-26T23:09:19Z"
  },
  {
    "title": "Review of B.C.'s emissions recommends renewed efforts as critics say LNG stands in way of progress",
    "description": "While the review tries to balance the B.C. government’s priorities around LNG projects with aims to lower pollution, some critics — including the B.C. Green Party, who pushed for the review — say LNG sets the province back in its overall climate efforts.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/clean-bc-review-lng-9.6993870",
    "timestamp": "2025-11-26T23:08:25Z"
  },
  {
    "title": "Georgia prosecutor drops Trump election interference case",
    "description": "Georgia prosecutor Peter Skandalakis drops the racketeering case against President Trump and 18 others.",
    "link": "https://www.israelnationalnews.com/news/418424",
    "timestamp": "2025-11-26T23:08:22Z"
  },
  {
    "title": "Trump Says 'He's Doing A Good Job' As Patel Denies Plot To Oust FBI Director",
    "description": "Trump publicly backs FBI Director Kash Patel, calling his performance 'great', after a report alleged the administration was weighing his removal.",
    "link": "https://www.ibtimes.com/trump-says-hes-doing-good-job-patel-denies-plot-oust-fbi-director-3791453",
    "timestamp": "2025-11-26T23:06:21Z"
  },
  {
    "title": "Hegseth: Trump Requested 500 More National Guard for D.C. After Guardsmen Shot Near White House",
    "description": "Secretary of War Pete Hegseth said that President Donald Trump has requested an additional 500 National Guardsmen be deployed to Washington following the shooting of two Guardsmen near the White House on Thanksgiving eve.\nThe post Hegseth: Trump Requested 500…",
    "link": "https://www.breitbart.com/crime/2025/11/26/hhegseth-trump-requested-500-more-national-guard-for-d-c-after-guardsmen-shot-near-white-house/",
    "timestamp": "2025-11-26T23:06:08Z"
  },
  {
    "title": "New EPA Rule Gives Oil, Gas Firms More Time to Fix Equipment Leaking Methane",
    "description": "The Environmental Protection Agency on Wednesday finalized a rule granting oil and gas operators more than a year in additional time to comply with mandates set by former President Joe Biden to replace leaky equipment and routinely monitor for escaped methane.",
    "link": "https://financialpost.com/pmn/business-pmn/new-epa-rule-gives-oil-gas-firms-more-time-to-fix-equipment-leaking-methane",
    "timestamp": "2025-11-26T23:05:59Z"
  },
  {
    "title": "Leak Shows Trump Aide Coaching Russians On How To Flatter Trump For Peace Deal",
    "description": "A leaked transcript reveals that US envoy Steve Witkoff coached Russian officials on how to flatter Donald Trump to get approval for a controversial Ukraine peace plan, raising questions about the legitimacy of the diplomacy.",
    "link": "https://www.ibtimes.com/leak-shows-trump-aide-coaching-russians-how-flatter-trump-peace-deal-3791465",
    "timestamp": "2025-11-26T23:04:33Z"
  },
  {
    "title": "2 National Guardsmen Shot in D.C., Suspect in Custody",
    "description": "Two members of the National Guard were shot on Wednesday afternoon in Washington, D.C.—just two blocks from the White House—while on deployment.",
    "link": "https://reason.com/2025/11/26/2-national-guardsmen-shot-in-d-c-suspect-in-custody/",
    "timestamp": "2025-11-26T23:00:10Z"
  },
  {
    "title": "Judges allow North Carolina to use a map drawn in bid to give Republicans another U.S. House seat",
    "description": "The map targets the state’s only swing seat, held by Democratic Rep. Don Davis, who represents over 20 northeastern counties.",
    "link": "https://www.pbs.org/newshour/politics/judges-allow-north-carolina-to-use-a-map-drawn-in-bid-to-give-republicans-another-u-s-house-seat",
    "timestamp": "2025-11-26T23:00:07Z"
  },
  {
    "title": "Donald Trump Scores Redistricting Win in North Carolina",
    "description": "North Carolina is among several states where Trump has broken with tradition by directing mid-decade map changes.",
    "link": "https://biztoc.com/x/278d9954c685bff1",
    "timestamp": "2025-11-26T22:58:15Z"
  },
  {
    "title": "Miss Universe pageant co-owners face separate charges",
    "description": "The co-owners of the Miss Universe Organization are facing charges: Rocha Cantu of Mexico and Jakkaphong \"Anne\" Jakrajutatip of Thailand.",
    "link": "https://www.upi.com/Top_News/US/2025/11/26/Miss-Universe-co-owners-face-separate-charges/7481764192254/",
    "timestamp": "2025-11-26T22:57:51Z"
  },
  {
    "title": "‘Disgusting Ghoul’: White House Slams New Yorker Writer for Saying National Guard Should ‘Never Have Been’ in DC",
    "description": "The White House's X account lambasted New Yorker writer Jane Mayer as a \"ghoul\" after she said the National Guard shouldn't have been in Washington, D.C.\nThe post ‘Disgusting Ghoul’: White House Slams New Yorker Writer for Saying National Guard Should ‘Never …",
    "link": "https://www.mediaite.com/media/news/disgusting-ghoul-white-house-slams-new-yorker-writer-for-saying-national-guard-should-never-have-been-in-dc/",
    "timestamp": "2025-11-26T22:56:42Z"
  },
  {
    "title": "2nd LD: 2 U.S. National Guard members shot near White House, suspect in custody",
    "description": "WASHINGTON, Nov. 26 (Xinhua) -- Two U.S. National Guard members were shot near the White House on Wednesday and a suspect is in custody, according to local authorities. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/27/2nd-ld-2-us-national-guard-members-shot-near-white-house-suspect-in-custody",
    "timestamp": "2025-11-26T22:55:00Z"
  },
  {
    "title": "Trump transition team discloses donors one year after pledged release",
    "description": "The 45-person list includes Education Secretary Linda McMahon and Commerce Secretary Howard Lutnick, who both co-chaired the transition, as well as GOP megadonors.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-transition-team-discloses-donors-one-year-pledged-release-rcna246131",
    "timestamp": "2025-11-26T22:52:01Z"
  },
  {
    "title": "Ryan Lizza Accuses Olivia Nuzzi of Conspiring With RFK Jr. to Kill Damaging Stories — Including the Infamous Bear Cub Carcass",
    "description": "Ryan Lizza published the third scathing installment of his series eviscerating Olivia Nuzzi Wednesday, this time accusing his former fiancée of additional breaches of journalistic ethics by helping \"catch and kill\" damaging stories about Robert F. Kennedy Jr.…",
    "link": "https://www.mediaite.com/media/ryan-lizza-accuses-olivia-nuzzi-of-conspiring-with-rfk-jr-to-kill-damaging-stories-including-the-infamous-bear-cub-carcass/",
    "timestamp": "2025-11-26T22:46:55Z"
  },
  {
    "title": "Bipartisan support, outrage pour in after 'targeted' DC shooting of National Guardsmen: 'Horrific'",
    "description": "President Donald Trump, West Virginia leaders and top national Democrats condemned the shooting of two guardsmen near the White House, calling the ambush a horrific act of violence.",
    "link": "https://www.foxnews.com/politics/bipartisan-support-outrage-pour-after-targeted-dc-shooting-national-guardsmen-horrific",
    "timestamp": "2025-11-26T22:44:30Z"
  },
  {
    "title": "LA Mayor Bass Faces Backlash for Calling Developer Home a 'Fire Rebuild'",
    "description": "Los Angeles Mayor Karen Bass is being challenged over her decision to spotlight a developer project as the “first home rebuilt” after the devastating Palisades fire, even though records show the project was planned and initiated before the blaze but formally …",
    "link": "https://www.breitbart.com/politics/2025/11/26/la-mayor-bass-faces-backlash-for-calling-developer-home-a-fire-rebuild/",
    "timestamp": "2025-11-26T22:43:40Z"
  },
  {
    "title": "Morrisey: West Virginia National Guard members shot in Washington DC",
    "description": "WASHINGTON (WOWK) – West Virginia Governor Patrick Morrisey says two National Guard Members shot in an attack in Washington, DC on Wednesday were members of the West Virginia National Guard. During a press conference in Washington, D.C., just before 5 p.m., o…",
    "link": "https://freerepublic.com/focus/f-news/4354764/posts",
    "timestamp": "2025-11-26T22:41:17Z"
  },
  {
    "title": "FLASHBACK: Democrats, Media Espoused Anti-National Guard Rhetoric Leading Up To Shooting",
    "description": "Democrats and the corporate media stoked fear about Donald Trump deploying the National Guard in the lead-up to a shooting that left two guardsmen injured.",
    "link": "https://dailycaller.com/2025/11/26/democrats-media-anti-national-guard-rhetoric-shooting/",
    "timestamp": "2025-11-26T22:40:58Z"
  },
  {
    "title": "Is there any peace deal that Putin would accept? (Joshua Keating/Vox)",
    "description": "Joshua Keating / Vox:\nIs there any peace deal that Putin would accept?  —  The 28-point peace plan is now a 19-point peace plan.  —  President Donald Trump says the plan for ending Russia's war in Ukraine that was presented to Kyiv last week, and was so heavi…",
    "link": "https://www.memeorandum.com/251126/p98",
    "timestamp": "2025-11-26T22:40:01Z"
  },
  {
    "title": "Washington Democrat says he believes Trump issued illegal orders to the military",
    "description": "Rep. Adam Smith, D-Wash., said President Donald Trump has issued illegal military orders after Democratic lawmakers urged service members to refuse illegal orders.",
    "link": "https://www.foxnews.com/media/washington-democrat-says-he-believes-trump-issued-illegal-orders-military",
    "timestamp": "2025-11-26T22:39:29Z"
  },
  {
    "title": "US: Two National Guard members shot in Washington DC",
    "description": "Two West Virginia National Guard soldiers are in critical condition after they were shot near the White House in Washington DC. Police have said one suspect is in custody.",
    "link": "https://www.dw.com/en/washington-dc/a-74913502",
    "timestamp": "2025-11-26T22:38:00Z"
  },
  {
    "title": "Trump Sure Has Been Nasty Toward Female Journalists Lately",
    "description": "From slamming one as \"ugly\" to calling another \"piggy,\" the president has been on a tear.",
    "link": "https://www.huffpost.com/entry/trump-female-journalist-attacks_n_69276008e4b034dca9c4e91d",
    "timestamp": "2025-11-26T22:37:01Z"
  },
  {
    "title": "Trump Pardoned Gobble and Waddle. He Should Pardon More Deserving People, Too.",
    "description": "The president loves freeing people. His controversial clemency grants should not obscure the fact that the pardon power is incredibly important.",
    "link": "https://reason.com/2025/11/27/trump-pardoned-gobble-and-waddle-he-should-pardon-more-deserving-people-too/",
    "timestamp": "2025-11-26T22:36:36Z"
  },
  {
    "title": "Two National Guard soldiers shot in ambush-style attack as horrific shoot-out sparks lockdown at White House",
    "description": "Two National Guard soldiers have been shot in an ambush-style attack just 800 yards from the White House, sparking a lockdown at the president's residence. The suspected gunman is in custody and two soldiers are in critical condition after a shoot-out at Farr…",
    "link": "https://freerepublic.com/focus/f-chat/4354762/posts",
    "timestamp": "2025-11-26T22:36:02Z"
  },
  {
    "title": "Russia’s frozen assets at center of negotiations over Ukraine peace deal",
    "description": "There’s agreement on using Russian assets to cover Ukraine’s future needs.",
    "link": "https://www.bostonherald.com/2025/11/26/europe-russia-frozen-assets/",
    "timestamp": "2025-11-26T22:30:27Z"
  },
  {
    "title": "Trump yanks G20 invitation from South Africa over false genocide claims",
    "description": "The US president has repeatedly accused South Africa of perpetrating human rights abuses against white Afrikaners.",
    "link": "https://www.aljazeera.com/news/2025/11/26/trump-yanks-g20-invitation-from-south-africa-over-false-genocide-claims",
    "timestamp": "2025-11-26T22:29:50Z"
  },
  {
    "title": "The right is making a big mistake by giving young men permission to be victims",
    "description": "Podcaster Ben Shapiro rightly called out conservatives for inculcating young men with a “nihilistic” worldview rather than giving them the “tough talk” they need.",
    "link": "https://nypost.com/2025/11/26/us-news/the-right-is-making-a-big-mistake-by-victimizing-young-men/",
    "timestamp": "2025-11-26T22:28:40Z"
  },
  {
    "title": "The National Guard shooting in DC, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: Two National Guard members were shot in downtown Washi…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/470751/national-guard-shooting-washington-dc-briefly-explained",
    "timestamp": "2025-11-26T22:26:04Z"
  },
  {
    "title": "DC National Guard Shooting Suspect: Updates on the Alleged White House Gunman",
    "description": "Officials called the shooting a 'targeted attack' against the National Guard in Washington, D.C., which took place just blocks away from the White House.",
    "link": "https://hollywoodlife.com/2025/11/26/dc-national-guard-shooting-suspect/",
    "timestamp": "2025-11-26T22:25:15Z"
  },
  {
    "title": "Grassley",
    "description": "You know really deserves a hit piece? Charles Grassley, who has slipped under the radar for years, with his horrors being largely ignored even as he embraced Trump like almost no other senior Republican (though Bob Dole loved him some Trump before he died). H…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/grassley-2",
    "timestamp": "2025-11-26T22:24:00Z"
  },
  {
    "title": "Don’t Let Big Tech Hold America’s Kids Hostage",
    "description": "It appears the dam is finally breaking as Republicans in the House advance a package of child safety bills that bereaving and aggrieved parents have... Read More\nThe post Don’t Let Big Tech Hold America’s Kids Hostage appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/26/dont-let-big-tech-hold-americas-kids-hostage/",
    "timestamp": "2025-11-26T22:23:14Z"
  },
  {
    "title": "Top U.S. Military Officials Meet With Caribbean Leaders",
    "description": "The meetings come as the Trump administration weighs next steps in its pressure campaign against Venezuela.",
    "link": "http://foreignpolicy.com/2025/11/26/us-boat-strikes-caribbean-drug-trafficking-trump-maduro-venezuela-hegseth-caine/",
    "timestamp": "2025-11-26T22:22:39Z"
  },
  {
    "title": "Senior U.S. Military Officials Visit the Caribbean",
    "description": "The meetings come as the Trump administration weighs next steps in its pressure campaign against Venezuela.",
    "link": "http://foreignpolicy.com/2025/11/26/us-boat-strikes-caribbean-drug-trafficking-trump-maduro-venezuela/",
    "timestamp": "2025-11-26T22:22:34Z"
  },
  {
    "title": "CNN’s Charles Ramsey Questions National Guard Training Immediately After 2 Guardsmen Were Shot In DC",
    "description": "CNN Chief Legal Analyst Charles Ramsey appeared to question the National Guardsmen training just minutes after two guardsmen had been shot.",
    "link": "https://dailycaller.com/2025/11/26/cnn-analyst-questions-national-guard-training-minutes-after-two-guardsmen-shot/",
    "timestamp": "2025-11-26T22:21:28Z"
  },
  {
    "title": "Shooting Of Two National Guard Members In Washington D.C. Was ‘Targeted Attack,’ Mayor Says (Live Updates)",
    "description": "The shooting suspect was injured in the incident but reportedly does not have life-threatening injuries.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/11/26/two-national-guard-members-in-critical-condition-suspect-in-custody-after-washington-dc-shooting-live-updates/",
    "timestamp": "2025-11-26T22:19:58Z"
  }
]