[
  {
    "title": "Trump To Roll Back Scientific Finding That Greenhouse Gases Endanger Human Health",
    "description": "The scientific finding has long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change.",
    "link": "https://www.huffpost.com/entry/trump-to-roll-back-scientific-finding-that-greenhouse-gases-endanger-human-health_n_698ba625e4b0073b47b0cfbb",
    "timestamp": "2026-02-10T21:52:37Z"
  },
  {
    "title": "Justification unsealed for FBI's seizure of 2020 Fulton County ballots (Politico)",
    "description": "Politico:\nJustification unsealed for FBI's seizure of 2020 Fulton County ballots … Evans' affidavits confirm that the criminal investigation originated with a referral from Kurt Olsen, an ally in President Donald Trump's quest to subvert the 2020 election, wh…",
    "link": "https://www.memeorandum.com/260210/p121",
    "timestamp": "2026-02-10T21:50:01Z"
  },
  {
    "title": "Trump administration plans to hold back grant money for some Democratic-led states",
    "description": "Full details have not been released, including whether the states could take any steps to avoid losing the funding.",
    "link": "https://www.bostonherald.com/2026/02/10/trump-administration-plans-to-hold-back-grant-money-for-some-democratic-led-states/",
    "timestamp": "2026-02-10T21:48:44Z"
  },
  {
    "title": "Senate Leader Thune throws cold water on filibuster change in push for voter-ID bill",
    "description": "Voter ID legislation backed by President Donald Trump and his GOP allies faces an uphill climb in the Senate.",
    "link": "https://www.cnbc.com/2026/02/10/senate-filibuster-thune-trump-save-act.html",
    "timestamp": "2026-02-10T21:42:56Z"
  },
  {
    "title": "Man Shoots Daughter Dead After She Argued With Him on Trump",
    "description": "A 23-year-old British woman was reportedly shot and killed by her father after arguing with him about Donald Trump.New testimony offered as part of a coroner’s inquest Tuesday shed more light on the death of Lucy Harrison, who was fatally shot in January last…",
    "link": "https://newrepublic.com/post/206433/man-shoots-daughter-donald-trump",
    "timestamp": "2026-02-10T21:41:04Z"
  },
  {
    "title": "Trump hints at second carrier in Middle East as Iran and U.S. near talks",
    "description": "In interviews with Israeli media, American president said the United States would have to do 'something very tough' if a deal is not reached with Iran",
    "link": "https://www.haaretz.com/middle-east-news/iran/2026-02-10/ty-article/trump-hints-at-second-carrier-in-middle-east-as-iran-and-u-s-near-talks/0000019c-4954-dc22-a9de-fb77e9ed0000",
    "timestamp": "2026-02-10T21:40:44Z"
  },
  {
    "title": "Trump says his 'Great Ballroom' will be used for 'future Presidential Inaugurations'",
    "description": "President Donald Trump posted new drawings of his 'Great Ballroom' that he said would be \"used for future Presidential Inaugurations.\"",
    "link": "https://abcnews.com/Politics/trump-great-ballroom-future-presidential-inaugurations/story?id=130037879",
    "timestamp": "2026-02-10T21:39:44Z"
  },
  {
    "title": "Will Britain’s Labour Party Survive the Epstein Files?",
    "description": "Pressure mounts for Prime Minister Keir Starmer to resign from Downing Street.",
    "link": "http://foreignpolicy.com/2026/02/10/keir-starmer-resign-labour-party-uk-peter-mandelson-jeffrey-epstein-files/",
    "timestamp": "2026-02-10T21:38:23Z"
  },
  {
    "title": "Trump's reaction to new footage of Guthrie abduction was 'pure disgust,' Leavitt says",
    "description": "FBI released shocking footage of a masked, armed person at Nancy Guthrie's home on the day she vanished, prompting President Donald Trump to react with \"pure disgust.\"",
    "link": "https://www.foxnews.com/politics/trumps-reaction-new-footage-guthrie-abduction-pure-disgust-leavitt-says",
    "timestamp": "2026-02-10T21:37:02Z"
  },
  {
    "title": "9 Leading Candidates For Next Year's Super Bowl Halftime Show",
    "description": "Bad Bunny broke down barriers at this year's Super Bowl by putting on a show that only 15% of the viewing audience could understand, which has people wondering how the NFL will follow it up.",
    "link": "https://babylonbee.com/news/9-leading-candidates-for-next-years-super-bowl-halftime-show",
    "timestamp": "2026-02-10T21:36:09Z"
  },
  {
    "title": "Trump’s Plan for an American Gulag Just Got a Major Boost in Court",
    "description": "President Donald Trump’s mass deportation campaign seemed to hit a horrifying crescendo in the last month. The situation is about to get worse.",
    "link": "https://slate.com/news-and-politics/2026/02/trump-plan-texas-gulag-supreme-court-analysis.html",
    "timestamp": "2026-02-10T21:32:41Z"
  },
  {
    "title": "Trump commerce chief denies having any relationship with Epstein",
    "description": "The latest release of Epstein files reveal Donald Trump's commerce chief had visited the convicted sex offender's private island for lunch years after he claimed to have cut off ties.",
    "link": "https://www.abc.net.au/news/2026-02-11/trump-commerce-chief-claims-no-relationship-with-epstein/106329468",
    "timestamp": "2026-02-10T21:32:18Z"
  },
  {
    "title": "Leavitt Pressed On If Trump Still Stands Behind Howard Lutnick After Bombshell Epstein File Revelations",
    "description": "Press Secretary Karoline Leavitt was pressed on President Trump's relationship with a top cabinet member who admitted to visiting Jeffrey Epstein's island.\nThe post Leavitt Pressed On If Trump Still Stands Behind Howard Lutnick After Bombshell Epstein File Re…",
    "link": "https://www.mediaite.com/politics/leavitt-pressed-on-if-trump-still-stands-behind-howard-lutnick-after-bombshell-epstein-file-revelations/",
    "timestamp": "2026-02-10T21:32:10Z"
  },
  {
    "title": "STEPHEN MOORE: From Dow 800 to 50,000--Reagan, Trump and the supply-side miracle",
    "description": "Stephen Moore analyzes how the Dow Jones surpassed 50,000, crediting Reagan and Trump's tax policies for America's unprecedented wealth growth and economic success.",
    "link": "https://www.foxnews.com/opinion/stephen-moore-from-dow-800-5000-reagan-trump-supply-side-miracle",
    "timestamp": "2026-02-10T21:31:50Z"
  },
  {
    "title": "The Art of the Steal",
    "description": "President Donald Trump seemingly cannot let the 2020 election go. Despite winning convincingly in 2024, including, for the first time in his political career, the popular vote, he remains fixated on the idea that he also won four years prior, against former P…",
    "link": "https://www.vox.com/politics/478708/donald-trump-2026-midterm-elections-threat-take-over",
    "timestamp": "2026-02-10T21:30:55Z"
  },
  {
    "title": "RFK Jr.'s Candid Heroin Confession: 'I Go to Meetings Every Day — 12-step Recovery Saved My Life'",
    "description": "Robert F. Kennedy Jr. revealed he still makes the time to attend daily 12-step meetings after beating a heroin addiction 43 years ago.",
    "link": "https://radaronline.com/p/robert-kennedy-jr-heroin-confession-attends-daily-meetings/",
    "timestamp": "2026-02-10T21:30:00Z"
  },
  {
    "title": "Honda reports declining profit",
    "description": "Honda Motor Co reported Tuesday a 42% drop in profit for the nine months through December, compared to a year earlier, as U.S. President Donald Trump’s tariffs hurt the Japanese automaker’s earnings. Honda’s profit over the three quarters totaled 465.4 billio…",
    "link": "https://japantoday.com/category/business/honda-reports-declining-profit-as-trump%27s-tariffs-and-ev-moves-hurt-japanese-automaker%27s-results",
    "timestamp": "2026-02-10T21:29:18Z"
  },
  {
    "title": "Jill Zarin Fired From E!’s ‘Real Housewives Of New York City’ Reunion Series After Racist Rant Over Bad Bunny’s Super Bowl Show",
    "description": "Jill Zarin has been fired from The Golden Life, E!’s reunion series featuring former cast members of Bravo’s The Real Housewives of New York City. The move comes after Zarin took to social media to share her take on Bad Bunny’s Super Bowl Halftime Show, makin…",
    "link": "http://deadline.com/2026/02/jill-zarin-fired-real-housewives-racist-bad-bunny-comments-1236714864/",
    "timestamp": "2026-02-10T21:29:04Z"
  },
  {
    "title": "FBI releases first surveillance images of masked person on Nancy Guthrie's porch",
    "description": "Authorities investigating the disappearance of Nancy Guthrie released the first surveillance images Tuesday showing a masked person with what looked like a handgun holster on her porch the night she went missing more than a week ago. Video released by the FBI…",
    "link": "https://japantoday.com/category/world/savannah-guthrie-pleads-for-the-public%27s-help-in-the-search-for-her-missing-mother",
    "timestamp": "2026-02-10T21:27:13Z"
  },
  {
    "title": "U.S.-Canada bridge brouhaha deepens as White House says Trump could amend a permit for the project",
    "description": "The White House says President Donald Trump has the right to amend a permit for a new bridge between Canada and Michigan, prolonging the latest dispute between the U.S. and its northern neighbor hours after its prime minister signaled there could be a detente…",
    "link": "https://japantoday.com/category/world/u.s.-canada-bridge-brouhaha-deepens-as-white-house-says-trump-could-amend-a-permit-for-the-project",
    "timestamp": "2026-02-10T21:27:03Z"
  },
  {
    "title": "Trump hints at second carrier in Middle East as Iran and U.S. near talks",
    "description": "U.S. President Donald Trump on Tuesday said he was considering sending a second aircraft carrier to the Middle East, even as Washington and Tehran prepare to resume negotiations aimed at averting a ‌new conflict. Oman facilitated talks between Iran and the U.…",
    "link": "https://japantoday.com/category/world/trump-hints-at-second-carrier-in-middle-east-as-iran-and-us-near-talks",
    "timestamp": "2026-02-10T21:26:43Z"
  },
  {
    "title": "Top EU diplomat drafts list of concessions Russia needs to make to secure real peace in Ukraine",
    "description": "Top European Union diplomat Kaja Kallas said Tuesday that she is drafting a list of concessions that she believes Russia must make to secure any long-term peace in Ukraine as U.S.-run talks to end four years of war show little sign of progress. Russian forces…",
    "link": "https://japantoday.com/category/world/eu-drafts-a-list-of-concessions-it-says-russia-must-make-to-secure-real-peace-in-ukraine",
    "timestamp": "2026-02-10T21:26:32Z"
  },
  {
    "title": "ICE chief defends officers' actions before Congress after the deaths of 2 protesters",
    "description": "Todd Lyons, the acting head of Immigration and Customs Enforcement, defended his agency’s officers before Congress on Tuesday, standing behind their tactics and saying they would not be intimidated as they carry out the president’s mass deportation plans. Lyo…",
    "link": "https://japantoday.com/category/world/trump%27s-immigration-chiefs-to-testify-in-congress-following-protester-deaths",
    "timestamp": "2026-02-10T21:26:22Z"
  },
  {
    "title": "UK leader Starmer averts a leadership challenge for now but remains damaged by Epstein fallout",
    "description": "Keir Starmer fights another day. After indirect fallout from the Jeffrey Epstein files sparked a dramatic day of crisis that threatened to topple him, the UK prime minister was saved by a pugnacious fightback and hesitation among his rivals inside the governi…",
    "link": "https://japantoday.com/category/world/uk-leader-starmer-averts-a-leadership-challenge-for-now-but-remains-damaged-by-epstein-fallout",
    "timestamp": "2026-02-10T21:26:00Z"
  },
  {
    "title": "Annual governors' gathering with White House unraveling after Trump excludes Democrats",
    "description": "An annual meeting of the nation’s governors that has long served as a rare bipartisan gathering is unraveling after President Donald Trump excluded Democratic governors from White House events. The National Governors Association said it will no longer hold a …",
    "link": "https://japantoday.com/category/world/governors-won%27t-hold-trump-meeting-after-white-house-only-invited-republicans",
    "timestamp": "2026-02-10T21:25:44Z"
  },
  {
    "title": "WATCH: White House won't confirm whether Trump called Palm Beach sheriff about Epstein",
    "description": "White House Press Secretary Karoline Leavitt said she did not know if the call had occurred, saying it is something that \"may or may not have happened in 2006.\"",
    "link": "https://www.pbs.org/newshour/politics/watch-white-house-wont-confirm-whether-trump-called-palm-beach-sheriff-about-epstein",
    "timestamp": "2026-02-10T21:25:11Z"
  },
  {
    "title": "Days ahead of elections, another Hindu man is killed in Bangladesh",
    "description": "A 62-year-old rice trader, Susen Chandra Sarkar, was brutally murdered in his shop in Mymensingh, Bangladesh, just days before the February 12 elections. Unidentified assailants hacked him to death and looted cash. This incident fuels fears among minority com…",
    "link": "https://timesofindia.indiatimes.com/world/south-asia/days-ahead-of-elections-another-hindu-man-is-killed-in-bangladesh/articleshow/128176447.cms",
    "timestamp": "2026-02-10T21:21:07Z"
  },
  {
    "title": "Service of notices for revenue hearings via email to soon become valid in Maharashtra",
    "description": "Mumbai: Service of notices for revenue hearings via email will soon be legally valid. The state cabinet on Tuesday approved a proposal to amend Sectio.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/service-of-notices-for-revenue-hearings-via-email-to-soon-become-valid-in-maharashtra/articleshow/128171906.cms",
    "timestamp": "2026-02-10T21:21:00Z"
  },
  {
    "title": "IGR to hear Amadea appeal on stamp duty liability, penalty on Feb 16",
    "description": "Pune: The inspector general of registration (IGR) has granted a hearing on Feb 16 to Amadea Enterprises LLP, which filed an appeal challenging the sta.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/igr-to-hear-amadea-appeal-on-stamp-duty-liability-penalty-on-feb-16/articleshow/128171904.cms",
    "timestamp": "2026-02-10T21:21:00Z"
  },
  {
    "title": "3 held for theft of 2.5L jewels from Aarey flat",
    "description": "Mumbai: Three men were arrested by Aarey Colony police—two of them repeat offenders— for breaking into an apartment at Goregaon East and looting ornam.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/3-held-for-theft-of-2-5l-jewels-from-aarey-flat/articleshow/128171914.cms",
    "timestamp": "2026-02-10T21:21:00Z"
  },
  {
    "title": "MEGYN KELLY PRETTY SURE FOOTBALL IS WHITE, DAMMIT, JUST LIKE SANTA AND JESUS",
    "description": "And other dispatches from the very serious side of American political commentary after the Bad Bunny show!",
    "link": "https://www.wonkette.com/p/megyn-kelly-pretty-sure-football",
    "timestamp": "2026-02-10T21:20:51Z"
  },
  {
    "title": "‘Evil’: Trump personally called cops on Epstein for being creepy around teen girls",
    "description": "'Thank goodness you're stopping him everyone has known he's been doing this'",
    "link": "https://www.wnd.com/2026/02/evil-trump-personally-called-cops-epstein-being-creepy/",
    "timestamp": "2026-02-10T21:20:34Z"
  },
  {
    "title": "Federal Court Gives Trump Green Light to End 'Temporary' Amnesty for 60K Migrants",
    "description": "A federal court has given President Donald Trump's administration the green light to end Temporary Protected Status (TPS) for about 60,000 migrants living in the United States with no other immigration status.\nThe post Federal Court Gives Trump Green Light to…",
    "link": "https://www.breitbart.com/politics/2026/02/10/federal-court-gives-trump-green-light-to-end-temporary-amnesty-for-60k-migrants/",
    "timestamp": "2026-02-10T21:19:44Z"
  },
  {
    "title": "Will TrumpRX Help You Save? It Depends.",
    "description": "TrumpRx is a federal website offering prescription drug discounts, though some users may face hurdles to see a benefit.",
    "link": "https://www.nerdwallet.com/insurance/health/news/trump-rx#article",
    "timestamp": "2026-02-10T21:17:50Z"
  },
  {
    "title": "SC's gender handbook is too 'Harvard-oriented': CJI",
    "description": "Chief Justice Surya Kant criticized the Supreme Court's gender stereotype handbook as overly technical and inaccessible to common people and rape survivors. He emphasized the need for practical training for High Court judges on handling sexual assault cases. …",
    "link": "https://timesofindia.indiatimes.com/india/scs-gender-handbook-is-too-harvard-oriented-cji/articleshow/128176372.cms",
    "timestamp": "2026-02-10T21:17:50Z"
  },
  {
    "title": "'We are only getting started,' ICE boss vows at fiery hearing",
    "description": "Democrats level a litany of complaints against the heads of America's immigration agencies during a rare hearing in Washington.",
    "link": "https://www.abc.net.au/news/2026-02-11/ice-customs-border-patrol-heads-questioned-by-congress/106329244",
    "timestamp": "2026-02-10T21:16:03Z"
  },
  {
    "title": "Opposition, barring TMC, submits notice for removal of Speaker",
    "description": "Opposition parties, excluding TMC, have submitted a notice to remove Lok Sabha Speaker Om Birla, accusing him of \"blatant partisanship.\" The move follows repeated denials of permission for Rahul Gandhi to speak, escalating tensions. Birla will abstain from pr…",
    "link": "https://timesofindia.indiatimes.com/india/opposition-barring-tmc-submits-notice-for-removal-of-speaker/articleshow/128176312.cms",
    "timestamp": "2026-02-10T21:14:25Z"
  },
  {
    "title": "Leavitt Brags Trump’s Call, Which ‘May or May Not Have Happened,’ Wrecks the Media’s Epstein Narrative",
    "description": "Karoline Leavitt argued a 2006 call that \"may or may not have happened\" where Trump thanked cops for investigating Epstein sabotages the media's narrative\nThe post Leavitt Brags Trump’s Call, Which ‘May or May Not Have Happened,’ Wrecks the Media’s Epstein Na…",
    "link": "https://www.mediaite.com/media/leavitt-brags-trumps-call-which-may-or-may-not-have-happened-wrecks-the-medias-epstein-narrative/",
    "timestamp": "2026-02-10T21:13:21Z"
  },
  {
    "title": "Trump threatens Iran with ‘something very tough’ if US demands are not met",
    "description": "Tensions between US and Iran continue to grow as Trump warns of US military strikes, absent concessions from Tehran.",
    "link": "https://www.aljazeera.com/news/2026/2/10/trump-threatens-iran-with-something-very-tough-if-us-demands-are-not-met",
    "timestamp": "2026-02-10T21:13:12Z"
  },
  {
    "title": "The 50: Karan Patel refuses to indulge in fights; says, “I don’t want my daughter to hear people say they saw her dad fight on camera”",
    "description": "In the latest season of the reality sensation 'The 50', the stakes are high with fierce competitions and celebrity rivalries taking center stage. Yet, actor Karan Patel is carving a different path. By putting his daughter first, he shuns the show's manufactur…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/the-50-karan-patel-refuses-to-indulge-in-fights-says-i-dont-want-my-daughter-to-hear-people-say-they-saw-her-dad-fight-on-camera/articleshow/128176207.cms",
    "timestamp": "2026-02-10T21:12:41Z"
  },
  {
    "title": "Charley Crockett criticized after political comments on Trump, Musk",
    "description": "Austin-based country singer Charley Crockett is facing backlash after his negative comments on Donald Trump and Elon Musk went viral on social media.",
    "link": "https://www.statesman.com/entertainment/music/article/charley-crockett-trump-musk-instagram-21345515.php",
    "timestamp": "2026-02-10T21:11:41Z"
  },
  {
    "title": "DOJ moves to wipe Steve Bannon contempt conviction tied to Jan. 6 probe",
    "description": "Justice Department seeks to dismiss Steve Bannon's contempt conviction despite completed four-month prison sentence for defying Jan. 6 Committee subpoena.",
    "link": "https://www.foxnews.com/politics/doj-moves-wipe-steve-bannon-contempt-conviction-tied-jan-6-probe",
    "timestamp": "2026-02-10T21:10:11Z"
  },
  {
    "title": "Experienced Pilots Advancing Safety Announces Support for Jeff Anderson ICAO Nomination",
    "description": "Organization Announces Continued Support Following Senate Review and Executive Vetting Organization Announces Continued Support Following Senate Review and Executive Vetting",
    "link": "https://www.globenewswire.com/news-release/2026/02/10/3235790/0/en/Experienced-Pilots-Advancing-Safety-Announces-Support-for-Jeff-Anderson-ICAO-Nomination.html",
    "timestamp": "2026-02-10T21:09:00Z"
  },
  {
    "title": "Experts taken aback by revelations in new FBI docs on Trump admin's election hub raid",
    "description": "Some eyebrow-raising revelations surfaced Tuesday in a newly unsealed FBI affidavit on the Fulton County elections hub raid this month. Kurt Olsen, an attorney appointed by President Donald Trump who worked with the president to undermine the 2020 presidentia…",
    "link": "https://www.rawstory.com/fulton-county-2675256758/",
    "timestamp": "2026-02-10T21:07:34Z"
  },
  {
    "title": "Overtime pay and night vision binoculars: UC San Diego is among agencies helping patrol border",
    "description": "Local police forces get money every year from the Department of Homeland Security to assist with border patrol operations. This includes the UC San Diego Police Department, which helps monitor for smuggling along the coastline.",
    "link": "https://www.kpbs.org/news/border-immigration/2026/02/10/uc-san-diego-is-among-agencies-helping-patrol-border",
    "timestamp": "2026-02-10T21:04:44Z"
  },
  {
    "title": "Maharashtra cabinet approves new public-private partnership policy, projects worth over Rs 25 crore to be cleared by infrastructure committee",
    "description": "Mumbai: The state cabinet on Tuesday cleared the public-private partnership (PPP) policy, under which projects worth more than Rs 25 crore will have t.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/maharashtra-cabinet-approves-new-public-private-partnership-policy-projects-worth-over-rs-25-crore-to-be-cleared-by-infrastructure-committee/articleshow/128171825.cms",
    "timestamp": "2026-02-10T21:04:00Z"
  },
  {
    "title": "UK urging Israel to reverse West Bank move",
    "description": "The British government has urged Israel to reverse its latest move to facilitate settlement building in the West Bank Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632278-uk-israel-west-bank/",
    "timestamp": "2026-02-10T21:02:59Z"
  },
  {
    "title": "Venezuelan Thug-in-Chief Diosdado Cabello Defends Abduction of 'Freed' Political Prisoner",
    "description": "Venezuela's socialist strongman Diosdado Cabello celebrated the abduction and rearrest of opposition politician Juan Pablo Guanipa.\nThe post Venezuelan Thug-in-Chief Diosdado Cabello Defends Abduction of ‘Freed’ Political Prisoner appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2026/02/10/venezuelan-thug-chief-diosdado-cabello-defends-abduction-freed-political-prisoner/",
    "timestamp": "2026-02-10T21:02:39Z"
  },
  {
    "title": "Security expert explains ‘one of the most important clues’ in Nancy Guthrie's kidnapping",
    "description": "A camera that was reportedly found on the roof of the Nancy Guthrie's Arizona home could prove 'crucial', security expert Dan Donovan said.",
    "link": "https://www.ladbible.com/news/us-news/nancy-guthrie-kidnapping-security-expert-clue-camera-on-roof-394231-20260210",
    "timestamp": "2026-02-10T21:02:08Z"
  },
  {
    "title": "Maharashtra cabinet approves land policy for development of ‘Third Mumbai’ project",
    "description": "Mumbai: The state cabinet on Tuesday approved a comprehensive land acquisition and allotment policy for the proposed Third Mumbai project, which is co.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/maharashtra-cabinet-approves-land-policy-for-development-of-third-mumbai-project/articleshow/128171764.cms",
    "timestamp": "2026-02-10T21:02:00Z"
  },
  {
    "title": "Trump Commerce Secretary Admits He Did, In Fact, Go to Epstein’s Island",
    "description": "President Donald Trump's commerce secretary admitted during a Congressional hearing on Tuesday that he lied to the public about his relationship with the billionaire sex offender Jeffrey Epstein, who was his next-door neighbor for 13 years.As suspicion swirle…",
    "link": "https://www.commondreams.org/news/lutnick-epstein-island",
    "timestamp": "2026-02-10T21:01:39Z"
  },
  {
    "title": "FBI searched Fulton County offices in probe of possible 2020 election 'defects,' affidavit says",
    "description": "The FBI obtained a search warrant to seize hundreds of boxes of ballots from election offices in Fulton County, Georgia, as part of a criminal investigation into possible \"deficiencies or defects\" in the vote count in the 2020 contest lost by President Donald…",
    "link": "https://www.pbs.org/newshour/politics/fbi-searched-fulton-county-offices-in-probe-of-possible-2020-election-defects-affidavit-says",
    "timestamp": "2026-02-10T21:01:00Z"
  },
  {
    "title": "Ghislaine Maxwell Offers “Exonerating” Information On Trump And Clinton If Pardoned",
    "description": "Jeffery Epstein's convicted accomplice, Ghislaine Maxwell, has offered to deliver \"exonerating\" information on both Donald Trump and Bill and Hillary Clinton in exchange for a full pardon. Maxwell was the ex-girlfriend of Epstein and is currently serving 20 y…",
    "link": "https://www.shtfplan.com/headline-news/ghislaine-maxwell-offers-exonerating-information-on-trump-and-clinton-if-pardoned",
    "timestamp": "2026-02-10T21:00:18Z"
  },
  {
    "title": "Munich 2007: Putin’s warning to the West",
    "description": "Western leaders ignored the Russian president’s 2007 Munich Security Conference speech at their peril Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632269-putin-munich-2007-warning/",
    "timestamp": "2026-02-10T21:00:08Z"
  },
  {
    "title": "Inquest hears British woman Lucy Harrison, 23, shot dead by dad in US after 'row about Donald Trump'",
    "description": "An inquest has heard that Lucy Harrison had been staying with her dad in the US and was shot dead after a 'row about Donald Trump'",
    "link": "https://www.ladbible.com/news/uk-news/lucy-harrison-inquest-woman-shot-dead-173917-20260210",
    "timestamp": "2026-02-10T20:58:38Z"
  },
  {
    "title": "Saudis have nukes – ex-Iranian commander",
    "description": "Saudi Arabia possesses nuclear weapons and the US knows it, former Iranian military commander Hussein Kanani has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632271-saudi-nuclear-iran-us/",
    "timestamp": "2026-02-10T20:57:49Z"
  },
  {
    "title": "White House Insists Trump Threat to Canada Bridge Is “America First”",
    "description": "It was Canada that footed the bill for the Gordie Howe International Bridge that connects Detroit to Windsor, Ontario. The project created new American labor, and was constructed with U.S. supplies. The six-lane bridge was scheduled to open sometime in 2026—b…",
    "link": "https://newrepublic.com/post/206432/donald-trump-threat-canada-bridge-america-first",
    "timestamp": "2026-02-10T20:56:05Z"
  },
  {
    "title": "Lt. Gov. Delgado ends campaign for New York governor",
    "description": "New York Lt. Gov. Antonio Delgado has suspended his campaign for governor, ending his challenge to Gov. Kathy Hochul",
    "link": "https://abcnews.com/Politics/wireStory/lt-gov-delgado-ends-campaign-new-york-governor-130039790",
    "timestamp": "2026-02-10T20:53:32Z"
  },
  {
    "title": "The Year of the Fire Horse Finds Xi on Edge",
    "description": "China’s president looks secure on the world stage, but trouble is brewing on the home front.",
    "link": "http://foreignpolicy.com/2026/02/10/china-xi-new-year-spring-festival-fire-horse-diplomacy-military-purge/",
    "timestamp": "2026-02-10T20:53:12Z"
  },
  {
    "title": "Trump wants lower mortgage rates. His Fed pick may push the other way. - The Washington Post",
    "description": "Trump wants lower mortgage rates. His Fed pick may push the other way.The Washington Post How much power does the Fed chair really have? : Planet MoneyNPR Warsh Call for Fed-Treasury Accord Stirs Debate in $30 Trillion Bond MarketBloomberg Untangling the idea…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180767626",
    "timestamp": "2026-02-10T20:52:51Z"
  },
  {
    "title": "“Millions lost health care so Washington Republicans could give their rich friends yet another tax cut,” Warnock says as ACA subsidy fight stalls",
    "description": "“Millions lost health care so Washington Republicans could give their rich friends yet another tax cut,” Warnock says as ACA subsidy fight stallsnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4485832183633-millions-lost-health-care-so-washington-republicans-could-give-their-rich-friends-yet-another-tax-cut-warnock-says-as-aca-subsidy-fight-stalls?_f=app_share&amp;pd=03RCUnbt&amp;lang=en_US&amp;send_time=1770756581&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.4.1.12%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-02-10T20:50:43Z"
  },
  {
    "title": "FBI reviewing Fulton County vote-count ‘deficiencies,’ court docs reveal",
    "description": "FBI probes Fulton County’s 2020 election over ballot irregularities and record-keeping failures, according to search warrant affidavits from agent Hugh Evans.",
    "link": "https://www.foxnews.com/politics/fbi-reviewing-fulton-county-vote-count-deficiencies-court-docs-reveal",
    "timestamp": "2026-02-10T20:50:32Z"
  },
  {
    "title": "Mike Epps Walks Back ‘Non-Filtered’ Joke About Donald Trump Engaging In A Sex Act With Nicki Minaj, Barbz Blast Him",
    "description": "Mike Epps has apologized for a crude sexual joke he made about Nicki Minaj following her recent endorsement of Donald Trump, an apology the Barbz hope Nicki doesn’t accept. The comedian got a lot of heat from Barbz after he made a crude joke about Nicki Minaj…",
    "link": "https://bossip.com/4357889/mike-epps-apology-nicki-minaj/",
    "timestamp": "2026-02-10T20:49:22Z"
  },
  {
    "title": "It turns out that Joe Biden really did crush Americans’ dreams for the future. Just look at how the vibe changed 5 years ago",
    "description": "More than four in 10 Americans don’t anticipate “high-quality life” in five years’ time, the lowest mark in nearly 20 years",
    "link": "https://fortune.com/2026/02/10/gallup-poll-american-optimism-inflation-joe-biden-donald-trump-democrats-republicans/",
    "timestamp": "2026-02-10T20:49:16Z"
  },
  {
    "title": "Trump Friendly Pollster Stuns With Survey Comparing Biden And Trump’s Job Performance",
    "description": "President Donald Trump was hit with negative negative numbers this week from a polling firm that is typically considered far more favorable to the president.\nThe post Trump Friendly Pollster Stuns With Survey Comparing Biden And Trump’s Job Performance first …",
    "link": "https://www.mediaite.com/media/news/trump-friendly-pollster-stuns-with-survey-comparing-biden-and-trumps-job-performance/",
    "timestamp": "2026-02-10T20:47:52Z"
  },
  {
    "title": "JD Vance on deal-making spree in Azerbaijan, Armenia",
    "description": "US Vice President JD Vance is on a trip to Armenia and Azerbaijan this week to back up a US-brokered peace process in the South Caucasus region with energy, defense and trade deals.",
    "link": "https://www.dw.com/en/jd-vance-on-deal-making-spree-in-azerbaijan-armenia/a-75902110",
    "timestamp": "2026-02-10T20:47:00Z"
  },
  {
    "title": "Fake Facebook account in Bengaluru police chief’s name sparks probe",
    "description": "Bengaluru: Cyberfraudsters have created a fake Facebook profile impersonating Bengaluru police commissioner Seemanth Kumar Singh. The profile, named i.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/fake-facebook-account-in-bengaluru-police-chiefs-name-sparks-probe/articleshow/128171560.cms",
    "timestamp": "2026-02-10T20:43:00Z"
  },
  {
    "title": "Bengaluru Metro users face UPI payment issues",
    "description": "Bengaluru: Namma Metro passengers faced difficulties in purchasing tickets and recharging travel cards through the Unified Payments Interface (UPI) sy.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-metro-users-face-upi-payment-issues/articleshow/128171536.cms",
    "timestamp": "2026-02-10T20:42:00Z"
  },
  {
    "title": "Dropped phone leads Bengaluru police to armed robbery gang",
    "description": "Bengaluru: A mobile phone accidentally left behind by one of the robbers proved to be the key clue in cracking a daring armed robbery at a jewellery s.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/dropped-phone-leads-bengaluru-police-to-armed-robbery-gang/articleshow/128171521.cms",
    "timestamp": "2026-02-10T20:42:00Z"
  },
  {
    "title": "Anjanapura residents on edge as leopard evades capture",
    "description": "Bengaluru: Panic and anxiety resurfaced among residents of Anjanapura, near JP Nagar 9th Phase in south Bengaluru, after an elusive leopard — first sp.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/anjanapura-residents-on-edge-as-leopard-evades-capture/articleshow/128171554.cms",
    "timestamp": "2026-02-10T20:42:00Z"
  },
  {
    "title": "Trump Told Police Chief ‘Everyone’ Knew About Epstein Abuse",
    "description": "The Epstein files reveal Trump said ‘everyone’ knew about Epstein’s abuse in a 2006 call to a police chief. The Trump administration said the call is fake, or maybe real, but either way it “corroborates” everything Trump ever said about Epstein.",
    "link": "http://nymag.com/intelligencer/article/trump-told-police-chief-everyone-knew-about-epstein-abuse.html",
    "timestamp": "2026-02-10T20:41:46Z"
  },
  {
    "title": "Tree for a tree: Angry farmer axes sandalwood outside Vidhana Soudha in Bengaluru to protest land acquisition",
    "description": "Bengaluru: Angered over the acquisition of his sandalwood farm for a highway project, a farmer travelled over 250 kilometres to Bengaluru and resorted.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/tree-for-a-tree-angry-farmer-axes-sandalwood-outside-vidhana-soudha-in-bengaluru-to-protest-land-acquisition/articleshow/128171502.cms",
    "timestamp": "2026-02-10T20:41:00Z"
  },
  {
    "title": "The Epstein files might bring down a government. Just not the US government.",
    "description": "The questions about the exact nature of Donald Trump’s relationship with the late financier and sexual predator Jeffrey Epstein that have dogged his presidency in both terms were given fresh life last week when the Justice Department released millions of new …",
    "link": "https://www.vox.com/politics/478719/starmer-mandelson-epstein-uk",
    "timestamp": "2026-02-10T20:40:53Z"
  },
  {
    "title": "FBI raided Georgia election hub in search of evidence of 2020 voter fraud, court docs show",
    "description": "The FBI raided a Georgia election hub near Atlanta and seized ballots and voter records at the urging of a lawyer who had worked with President Donald Trump to try to overturn the results of the 2020 election, a newly released court record revealed Tuesday",
    "link": "https://www.nbcnews.com/politics/elections/fbi-raided-georgia-election-hub-search-evidence-2020-voter-fraud-court-rcna258344",
    "timestamp": "2026-02-10T20:40:18Z"
  },
  {
    "title": "American universities are losing ground to their foreign counterparts",
    "description": "While Harvard is still near the top, other colleges have slipped",
    "link": "https://theweek.com/education/american-universities-foreign-education-rankings",
    "timestamp": "2026-02-10T20:39:54Z"
  },
  {
    "title": "Conestoga Valley plans to revisit proposal limiting sports participation by sex at birth in spring",
    "description": "Conestoga Valley School District’s board on Monday reopened discussion about changing the district’s athletics policy to restrict participation in school sports to a student’s sex at birth, rather than gender identity. Final action on the policy would not com…",
    "link": "https://lancasteronline.com/news/local/conestoga-valley-plans-to-revisit-proposal-limiting-sports-participation-by-sex-at-birth-in-spring/article_87dae2df-fb2a-47e9-9f0d-ce9a2bd857fd.html",
    "timestamp": "2026-02-10T20:39:00Z"
  },
  {
    "title": "NATO allies expected to ‘do more’– US envoy",
    "description": "Washington wants “Europe to take over the conventional defense” of the continent, US envoy to NATO Matthew Whitaker has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632276-us-envoy-whitaker-nato-europe-should-do-more/",
    "timestamp": "2026-02-10T20:34:44Z"
  },
  {
    "title": "US governors cancel White House meeting after Donald Trump didn’t invite Democrats: Report",
    "description": "The National Governors Association canceled its meeting with President Trump after the White House excluded Democratic governors. This decision undermines federal-state collaboration, as the association emphasizes unity and constructive engagement. The White …",
    "link": "https://timesofindia.indiatimes.com/world/us/us-governors-cancel-white-house-meeting-after-donald-trump-didnt-invite-democrats-report/articleshow/128175196.cms",
    "timestamp": "2026-02-10T20:32:26Z"
  },
  {
    "title": "Judge Blocks Trump Admin Bid for Mich. Voter Data",
    "description": "A federal judge blocked the Trump administration's attempt to force Michigan to hand over its full, unredacted voter registration rolls. The judge ruled that federal law does not require the state to disclose voters' private information. U.S. District Judge H…",
    "link": "https://freerepublic.com/focus/f-bloggers/4366314/posts",
    "timestamp": "2026-02-10T20:31:37Z"
  },
  {
    "title": "US curler Rich Ruohonen calls ICE operations in Minnesota 'wrong': 'There's no shades of grey'",
    "description": "U.S. Olympic curler and lawyer Rich Ruohonen spoke out against ICE operations in Minnesota, citing constitutional concerns at the 2026 Milan Cortina Games.",
    "link": "https://www.foxnews.com/sports/us-curler-rich-ruohonen-calls-ice-operations-minnesota-wrong-theres-no-shades-grey",
    "timestamp": "2026-02-10T20:31:27Z"
  },
  {
    "title": "Justice Ketanji Brown Jackson dismisses GOP concerns about 'impartiality' after attending Grammys",
    "description": "Justice Ketanji Brown Jackson defends attending the Grammy Awards on \"The View\" after Republican criticism that it showed a lack of impartiality.",
    "link": "https://www.foxnews.com/media/justice-ketanji-brown-jackson-dismisses-gop-concerns-about-impartiality-after-attending-grammys",
    "timestamp": "2026-02-10T20:30:17Z"
  },
  {
    "title": "What Happens When Trump Loses? (Jonathan V. Last/The Bulwark)",
    "description": "Jonathan V. Last / The Bulwark:\nWhat Happens When Trump Loses?  —  A guide to the chaos ahead.  —  ∙ Paid  —  1. Winter Is Coming  —  Yesterday the White House published an “article” attempting to reassure some unnamed people that Donald Trump was winning.  —…",
    "link": "https://www.memeorandum.com/260210/p108",
    "timestamp": "2026-02-10T20:30:01Z"
  },
  {
    "title": "US’s largest public utility says it now doesn’t want to close two coal-fired plants",
    "description": "The new plan would still include introducing natural gas-fired plants at two locations.",
    "link": "https://www.bostonherald.com/2026/02/10/federal-utility-coal/",
    "timestamp": "2026-02-10T20:28:12Z"
  },
  {
    "title": "Opposition grows in Congo over US mineral deal",
    "description": "Congo’s President Felix Tshisekedi is entering into partnership with the U.S. for investment in Congo's minerals sector and in-country opposition to the deal is growing. Tshisekedi attended the U.S. minerals summit last week where he was praised by U.S. offic…",
    "link": "https://apnews.com/article/congo-us-minerals-tshisekedi-kinshasa-rebels-fa1f70440477bf488e668b4f7a5e5b2b",
    "timestamp": "2026-02-10T20:26:47Z"
  },
  {
    "title": "Erika Kirk Boasts About Alternative Halftime Show",
    "description": "She's been everywhere lately, but couldn't make it to Kid Rock's performance.",
    "link": "https://littlethings.com/entertainment/erika-kirk-alternative-halftime-show",
    "timestamp": "2026-02-10T20:26:27Z"
  },
  {
    "title": "Karnataka legislator’s bail plea in murder case rejected",
    "description": "Bengaluru: The high court rejected a petition by BA Basavaraja, BJP MLA from KR Pura constituency, seeking anticipatory bail in connection with the Ju.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/karnataka-legislators-bail-plea-in-murder-case-rejected/articleshow/128171499.cms",
    "timestamp": "2026-02-10T20:26:00Z"
  },
  {
    "title": "Kid Rocks Flips Off ‘Haters’ and ‘Fake News Media’ Over Halftime Show Lip-Sync Claims",
    "description": "The musician says the show's production mistakenly botched the audio because they weren't familiar with his song \"Bawitdaba\" \nThe post Kid Rocks Flips Off ‘Haters’ and ‘Fake News Media’ Over Halftime Show Lip-Sync Claims appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/music/kid-rocks-flips-off-haters-fake-news-media-halftime-show-lip-sync/",
    "timestamp": "2026-02-10T20:25:13Z"
  },
  {
    "title": "Families Struggling To Find ICE Detainees Who Are Hospitalized",
    "description": "Here are the morning&#8217;s top stories on Tuesday, February 10, 2026 As federal immigration enforcement efforts continue across California, families of detainees are struggling with a new problem. Many can&#8217;t find loved ones who&#8217;ve been hospitali…",
    "link": "https://www.kqed.org/news/12072974/families-struggling-to-find-ice-detainees-who-are-hospitalized",
    "timestamp": "2026-02-10T20:24:34Z"
  },
  {
    "title": "Mamdani, Schumer & NYC Council demand National Park Service return Pride flag to Stonewall National Monument",
    "description": "The New York City Council on Tuesday pressed the National Park Service to restore the Pride flag at the Stonewall National Monument, escalating a dispute that has turned one of the most hallowed sites in LGBTQ+ history into a fresh battleground with the Trump…",
    "link": "https://www.advocate.com/politics/new-york-mamdani-stonewall-pride-flag",
    "timestamp": "2026-02-10T20:24:19Z"
  },
  {
    "title": "Trump Nominee Goes On Offense After Chuck Schumer Accuses Him Of ‘White Supremacy’",
    "description": "President Donald Trump's nominee Jeremy Carl is going on offense after Democrat Senate Minority leader Chuck Schumer accused him of white supremacy.",
    "link": "https://dailycaller.com/2026/02/10/chuck-schumer-jeremy-carl-zohran-mamdani-jasmine-crockett-white-supremacy/",
    "timestamp": "2026-02-10T20:24:04Z"
  }
]