[
  {
    "title": "‘It’s Racist’: James Carville, Dem Senator Torch Their Party For Treating All Minorities As ‘The Same’",
    "description": "James Carville and Elissa Slotkin criticized their party in a Saturday video for treating all minorities as if they are identical rather than unique.",
    "link": "https://dailycaller.com/2025/02/17/james-carville-elissa-slotkin-torch-democratic-party/",
    "timestamp": "2025-02-17T18:39:22Z"
  },
  {
    "title": "Trump ICE Idiot Tom Homan: Bad Cop",
    "description": "(There is no good cop in this scenario.)",
    "link": "https://www.wonkette.com/p/trump-ice-idiot-tom-homan-bad-cop",
    "timestamp": "2025-02-17T18:39:16Z"
  },
  {
    "title": "Monday headlines: Dreaming of electric sheep",
    "description": "Even as a decline in illegal border crossings is a gift for Trump, it makes it harder for ICE to put up the arrest and deportation numbers it wants. / The Washington Post [+]\n\nMore journalists were killed in 2024 than ever before, and Israel was responsible f…",
    "link": "https://themorningnews.org/p/monday-headlines-dreaming-of-electric-sheep",
    "timestamp": "2025-02-17T18:39:00Z"
  },
  {
    "title": "Mark Zuckerberg’s Meta’s AI-powered smart glasses helping the blind — Over 1 million sold in 2024",
    "description": "Meta’s Ray-Ban smart glasses come with a camera, microphones and an AI assistant that can identify objects and answer questions.",
    "link": "https://economictimes.indiatimes.com/news/international/us/mark-zuckerbergs-metas-ai-powered-smart-glasses-helping-the-blind-over-1-million-sold-in-2024/articleshow/118337786.cms",
    "timestamp": "2025-02-17T18:38:19Z"
  },
  {
    "title": "The Death of Government Expertise (Tom Nichols/The Atlantic)",
    "description": "Tom Nichols / The Atlantic:\nThe Death of Government Expertise  —  Why Trump and Musk are on a firing spree  —  One of the greatest tricks that Donald Trump and Elon Musk ever pulled is to convince millions of people that DOGE, the self-styled Department of Go…",
    "link": "https://www.memeorandum.com/250217/p58",
    "timestamp": "2025-02-17T18:35:01Z"
  },
  {
    "title": "Republican Introduces Pathetic Bill to Create Trump National Holiday",
    "description": "In a rather pointless, sycophantic move, a New York member of Congress wants to make Donald Trump’s birthday a national holiday. \r\nRepublican Representative Claudia Tenney introduced the “Trump’s Birthday and Flag Day Holiday Establishment Act” Friday, hoping…",
    "link": "https://newrepublic.com/post/191603/republican-bill-trump-birthday-national-holiday",
    "timestamp": "2025-02-17T18:34:34Z"
  },
  {
    "title": "Yes, GOP congresswoman introduced bill to make Trump's birthday a federal holiday",
    "description": "In February 2025, Republican U.S. Rep. Claudia Tenney introduced a bill that would make President Donald Trump's birthday a federal holiday.",
    "link": "https://www.snopes.com//fact-check/trump-birthday-holiday/",
    "timestamp": "2025-02-17T18:34:00Z"
  },
  {
    "title": "Trump’s Team ‘Putting Pressure’ On Romania To Lift Restrictions On Andrew Tate & His Brother",
    "description": "President Trump and his administration are reportedly putting pressure on Romania to lift their travel restrictions on the Tate brothers. Both Andrew Tate and his brother, Tristan Tate, are currently on house arrest while awaiting trial in Romania on charges …",
    "link": "https://brobible.com/culture/article/trumps-team-andrew-tate-brother/",
    "timestamp": "2025-02-17T18:33:49Z"
  },
  {
    "title": "Trump fires FAA employees amid safety concerns",
    "description": "The firings come amid an existing shortage of air traffic controllers and staffing challenges",
    "link": "https://www.wcvb.com/article/trump-fires-faa-employees-aviation-safety/63820608",
    "timestamp": "2025-02-17T18:32:48Z"
  },
  {
    "title": "Mark Levin Attacks ‘Hysterical’ Fox News Colleague Andy McCarthy Over Criticism of Trump",
    "description": "Mark Levin attacked his Fox News colleague Andy McCarthy over his criticism of President Donald Trump and Attorney General Pam Bondi's Department of Justice.\nThe post Mark Levin Attacks ‘Hysterical’ Fox News Colleague Andy McCarthy Over Criticism of Trump fir…",
    "link": "https://www.mediaite.com/news/mark-levin-attacks-hysterical-fox-news-colleague-andy-mccarthy-over-criticism-of-trump/",
    "timestamp": "2025-02-17T18:32:42Z"
  },
  {
    "title": "Many weary Ukrainians long for an end to the war but now fear it will come on unfavorable terms",
    "description": "After nearly three years of living under constant threat of Russian airstrikes while their troops fight a grinding campaign against Russia’s invasion, many Ukrainians long for an end to the war",
    "link": "https://abcnews.go.com/International/wireStory/weary-ukrainians-long-end-war-now-fear-unfavorable-118899923",
    "timestamp": "2025-02-17T18:30:26Z"
  },
  {
    "title": "UK offers Ukraine peacekeeping troops as Europe holds emergency summit",
    "description": "British Prime Minister Keir Starmer has said Europe must \"step up\" on security ahead of peace talks between Russia and Ukraine",
    "link": "https://www.abc.net.au/news/2025-02-18/starmer-ukraine-peacekeeping-troops/104948624",
    "timestamp": "2025-02-17T18:30:09Z"
  },
  {
    "title": "U.S. Fuel Prices Surge On Refinery Maintenance And Outages",
    "description": "U.S. gasoline prices have resumed their uptrend, with AAA reporting the national average at $3.161 per gallon of regular compared to $3.139 a week ago and $3.115 a month ago. The national average price of diesel has increased 0.8 cents and now stands at $3.63…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Fuel-Prices-Surge-On-Refinery-Maintenance-And-Outages.html",
    "timestamp": "2025-02-17T18:30:00Z"
  },
  {
    "title": "Radar Exposes Tortured Murdoch Brats' War: How James Murdoch Branded 93-Year-Old News Titan Dad a 'Misogynist' and Brother Seethed Media Empire Was 'S---Co'",
    "description": "The Murdoch family has been broken by their father's fight to give control of his empire to his eldest son while his younger kids continue to call him out.",
    "link": "https://radaronline.com/p/rupert-murdoch-war-james-news-titan-dad-misogynist-media-empire/",
    "timestamp": "2025-02-17T18:30:00Z"
  },
  {
    "title": "Zelensky Goes Rogue, Wants To Burn Ukraine To Rule Over the Ashes – Needs to Keep War and Martial Law Going To Keep His Grip on Power",
    "description": "Emboldened by the European outcry against the new peace negotiations between the US and Russia, Ukrainian President Volodymyr Zelensky turns his back on the US leader Donald J. Trump, insists that he will not recognize any US-Russia peace deal that he is not …",
    "link": "https://freerepublic.com/focus/f-bloggers/4298287/posts",
    "timestamp": "2025-02-17T18:29:19Z"
  },
  {
    "title": "Jarrett says Trump admin will prevail against 'nonsense' legal challenges to Elon Musk, DOGE team's authority",
    "description": "Fox News legal analyst Gregg Jarrett criticized Democratic attorneys general for suing DOGE, with Musk arguing, 'their lawsuits make it look like they favor financial abuse.'",
    "link": "https://www.foxnews.com/media/jarrett-says-trump-admin-prevail-against-nonsense-legal-challenges-elon-musk-doge-teams-authority",
    "timestamp": "2025-02-17T18:27:12Z"
  },
  {
    "title": "Elon Musk sides with MAGA for a change, blasts CBS's 60 Minutes for lying about DOGE’s raid at the United States’ international aid agency",
    "description": "Elon Musk accused CBS's 60 Minutes of fabricating information in their report about severance packages following a Musk-led shutdown at the US international aid agency. Musk's comments followed the airing of an interview with a former USAID worker. This incid…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-sides-with-maga-for-a-change-blasts-cbss-60-minutes-for-lying-about-doges-raid-at-the-united-states-international-aid-agency/articleshow/118337237.cms",
    "timestamp": "2025-02-17T18:24:05Z"
  },
  {
    "title": "Trump casts psychiatric, weight-loss drugs as threats to children",
    "description": "NEW YORK, Feb. 17 (Xinhua) -- U.S. President Donald Trump has instructed his administration to scrutinize the \"threat\" to children posed by antidepressants, stimulants and other common psychiatric drugs, targeting medication taken by millions in his latest ch…",
    "link": "https://www.thestar.com.my/news/world/2025/02/18/trump-casts-psychiatric-weight-loss-drugs-as-threats-to-children",
    "timestamp": "2025-02-17T18:24:00Z"
  },
  {
    "title": "Dem Donors Turn Off Money Tap For Left-Wing Activist Groups As Party Remains In Disarray",
    "description": "Influential Democratic donors are reportedly pausing donations to left-wing activist groups, citing the Democratic Party's failure to articulate a new vision.",
    "link": "https://dailycaller.com/2025/02/17/democratic-party-donors-left-wing-activist-groups-finances/",
    "timestamp": "2025-02-17T18:23:45Z"
  },
  {
    "title": "Mexico says it will wait for new response from Google on Gulf of Mexico name dispute before filing lawsuit",
    "description": "“We will wait for Google’s response and if not, we will proceed to court,” Sheinbaum said Monday during a morning press briefing.",
    "link": "https://www.pbs.org/newshour/politics/mexico-says-it-will-wait-for-new-response-from-google-on-gulf-of-mexico-name-dispute-before-filing-lawsuit",
    "timestamp": "2025-02-17T18:23:28Z"
  },
  {
    "title": "Megyn Kelly announces new project that is sure to be controversial",
    "description": "American media personality Megyn Kelly has announced her latest venture which aims to &apos;slice through the leftist propaganda&apos; that she believes surrounds the coverage of D",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/02/17/67b377d846163f61b28b4579.html",
    "timestamp": "2025-02-17T18:23:08Z"
  },
  {
    "title": "Mexico awaits new response from Google on dispute over Gulf of Mexico name before filing lawsuit",
    "description": "Mexico says it’s awaiting a new response from Google to its request that the tech company fully restore the name Gulf of Mexico to its Google Maps service before filing a lawsuit.",
    "link": "https://www.clickondetroit.com/business/2025/02/17/mexico-awaits-new-response-from-google-on-dispute-over-gulf-of-mexico-name-before-filing-lawsuit/",
    "timestamp": "2025-02-17T18:22:50Z"
  },
  {
    "title": "How Biden’s last-minute roadblocks are hamstringing Trump",
    "description": "Former President Joe Biden’s massive expansion of the federal workforce and flurry of administrative moves on his way out the door have already created roadblocks for President Donald Trump as he seeks to deliver on the sweeping reforms he promised. From gree…",
    "link": "https://freerepublic.com/focus/f-news/4298285/posts",
    "timestamp": "2025-02-17T18:21:35Z"
  },
  {
    "title": "Alina Habba Claims Eric Adams Was Charged Because of Immigration Policies",
    "description": "Habba claims Adams was targeted because of immigration policies when he was charged with bribery.",
    "link": "https://www.newsweek.com/alina-habba-eric-adams-immigration-charges-2032295",
    "timestamp": "2025-02-17T18:20:23Z"
  },
  {
    "title": "‘Morning Joe’ Panelist Compares DOGE’s Cuts To Biden’s Afghanistan Withdrawal That Killed 13 Americans",
    "description": "MSNBC political analyst Elise Jordan said DOGE was similar to the botched withdrawal from Afghanistan, during which 13 American military personnel were killed.",
    "link": "https://dailycaller.com/2025/02/17/morning-joe-panelist-seriously-compared-doges-cuts-to-bidens-afghanistan-withdrawal-that-killed-13-americans/",
    "timestamp": "2025-02-17T18:20:03Z"
  },
  {
    "title": "Is Elon Musk's government role unconstitutional? What the Supreme Court might say.",
    "description": "Federal courts are considering whether Elon Musk’s status as de facto administrator of DOGE complies with the Constitution’s Appointments Clause.",
    "link": "https://abcnews.go.com/Politics/elon-musks-government-role-unconstitutional-supreme-court/story?id=118846052",
    "timestamp": "2025-02-17T18:19:40Z"
  },
  {
    "title": "Why Trump Can Use Blackmail Against EU and Get Away With It",
    "description": "EU leaders, most of them “preselected by the Bilderberg and US globalist elites,” will obey the United States’ wishes, says Hong Kong-based political and financial analyst Angelo Giuliano.",
    "link": "https://sputnikglobe.com/20250217/why-trump-can-use-blackmail-against-eu-and-get-away-with-it-1121576864.html",
    "timestamp": "2025-02-17T18:19:19Z"
  },
  {
    "title": "House Democrat's smear of Border Patrol bill backfires after dozens of Dems support it: 'Fearmongering'",
    "description": "Oregon Democratic Rep. Janelle Bynum called a bill meant to crack down on police pursuits at the border similar to \"The Fugitive Slave Act of 1850.\" The bill ended up passing with 50 Democratic votes, and it now headed to the Senate.",
    "link": "https://www.foxnews.com/politics/house-democrats-smear-border-patrol-bill-backfires-after-dozens-dems-support-it-fearmongering",
    "timestamp": "2025-02-17T18:18:57Z"
  },
  {
    "title": "Trump begins firings of FAA air traffic control staff just weeks after fatal DC plane crash - NewsBreak",
    "description": "WASHINGTON (AP) — The Trump administration has begun firing several hundred Federal Aviation Administration employees, upending staff on a busy air travel",
    "link": "https://www.newsbreak.com/share/3816664820910-trump-begins-firings-of-faa-air-traffic-control-staff-just-weeks-after-fatal-dc-plane-crash?s=a2&share_destination_id=MjExODU4ODkzLTE3Mzk4MTYyOTAzNDI%3D&pd=0EKwAvwc&hl=en_US&send_time=1739816290&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v9",
    "timestamp": "2025-02-17T18:18:37Z"
  },
  {
    "title": "European leaders holding emergency meeting over US moves on Ukraine",
    "description": "French President Emmanuel Macron has held a phone call with Donald Trump just as he was about to greet key EU nations and the UK in Paris for an emergency meeting on how to react to the US diplomatic blitz on Ukraine.",
    "link": "https://www.independent.ie/world-news/europe/european-leaders-holding-emergency-meeting-over-us-moves-on-ukraine/a982879605.html",
    "timestamp": "2025-02-17T18:17:44Z"
  },
  {
    "title": "Former Vice President Kamala Harris to be honored by NAACP with its Chairman’s Award",
    "description": "Harris was the first woman and first person of color to serve as vice president.",
    "link": "https://www.bostonherald.com/2025/02/17/kamala-harris-naacp-honor/",
    "timestamp": "2025-02-17T18:17:22Z"
  },
  {
    "title": "Egypt is developing a plan to rebuild Gaza, countering Trump’s call to depopulate the territory",
    "description": "Egyptian officials have been discussing the plan with European diplomats and Arab countries, as well as ways to fund it.",
    "link": "https://www.bostonherald.com/2025/02/17/gaza-reconstruction-egypt-plan/",
    "timestamp": "2025-02-17T18:17:05Z"
  },
  {
    "title": "'Incompetence and arson': Fury grows over Trump mass firing of health workforce",
    "description": "Reducing the price of groceries—a key campaign promise made by U.S. President Donald Trump—has thus far ranked low on his administration's list of priorities, but mass firings at numerous federal health agencies over the weekend suggested that scaling back ef…",
    "link": "https://www.alternet.org/cdc-firing/",
    "timestamp": "2025-02-17T18:16:23Z"
  },
  {
    "title": "Trump Supporters Rip On Tom Hanks’ ‘Doug’ Character In SNL Skit",
    "description": "Donald Trump supporters ripped into Tom Hanks over his depiction of a racist MAGA supporter in Sunday's 50th anniversary special of \"Saturday Night Live.\"",
    "link": "https://dailycaller.com/2025/02/17/tom-hanks-50th-anniversary-special-episode-saturday-night-live-trump-maga-doug-kenan-thompson/",
    "timestamp": "2025-02-17T18:15:38Z"
  },
  {
    "title": "Elon Musk’s DOGE wants access to the tax information of every American, and Trump plans to give it to him",
    "description": "Elon Musk’s DOGE team is seeking access to sensitive taxpayer data held by the IRS. A 25-year-old staffer is reportedly set to gain access to it.",
    "link": "https://www.newsbreak.com/share/3816563488538-elon-musk-s-doge-wants-access-to-the-tax-information-of-every-american-and-trump-plans-to-give-it-to-him?s=a99&amp;share_destination_id=MTUyMjg4MDM4LTE3Mzk4MTYwMzE3MDQ%3D&amp;pd=0AIz4gyV&amp;hl=en_US&amp;send_time=1739816031&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v6%2Cns_foryou_rank_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v5",
    "timestamp": "2025-02-17T18:14:23Z"
  },
  {
    "title": "A Full Implementation of the Israel-Hamas Ceasefire is Uncertain",
    "description": "On January 19, Israel and Hamas implemented a ceasefire agreement that would end the fighting in Israel and Palestine, see the return of hostages and prisoners, and begin a period of recovery and reconstruction for Palestine. Although the past several weeks h…",
    "link": "https://www.ipsnews.net/2025/02/full-implementation-israel-hamas-ceasefire-uncertain/",
    "timestamp": "2025-02-17T18:14:12Z"
  },
  {
    "title": "Trump Envoy Says US Will Not \"Impose\" Deal On Ukraine",
    "description": "US envoy Keith Kellogg on Monday said that he would not tell Ukraine to accept whatever deal is negotiated by President Donald Trump to end Russia&#039;s war, ahead of a visit to Kyiv.",
    "link": "https://www.ndtv.com/world-news/trump-envoy-says-us-will-not-impose-deal-on-ukraine-7733632",
    "timestamp": "2025-02-17T18:13:30Z"
  },
  {
    "title": "Europe grapples over its \"collective security\" under pressure from Trump",
    "description": "Britain and Sweden have become the first European nations to say they could send troops to help secure Ukraine after an end to the war there.",
    "link": "https://www.cbsnews.com/news/trump-russia-war-ukraine-nato-uk-sweden-troops-europe-security/",
    "timestamp": "2025-02-17T18:13:15Z"
  },
  {
    "title": "Ukraine: Scholz calls for US, European unity at Paris summit",
    "description": "Europe's leaders have met to chart a course forward as the US plans bilateral talks with Russia in a sudden policy shift. European Commission chief von der Leyen has said Europe needs an \"urgency mindset\" on defense.",
    "link": "https://www.dw.com/en/ukraine-scholz-calls-for-us-european-unity-at-paris-summit/live-71634533",
    "timestamp": "2025-02-17T18:13:00Z"
  },
  {
    "title": "CHARLIE KIRK: Shut Up About Egg Prices — Trump Is Saving Consumers Millions",
    "description": "'Democrats are positively giddy about the price of eggs.'",
    "link": "https://dailycaller.com/2025/02/17/charlie-kirk-egg-prices-donald-trump-inflation/",
    "timestamp": "2025-02-17T18:11:33Z"
  },
  {
    "title": "Who is Norm Eisen? The Legal Hatchet Man Behind the Anti-Trump ‘Color Revolution’ [just sued Musk]",
    "description": "Norm Eisen ... is a political operative who has spent his career using the legal system to target conservatives—especially Donald Trump. He is also an expert on color revolutions. Let’s break it down. Norm graduated Harvard Law School in 1991, where he met hi…",
    "link": "https://freerepublic.com/focus/f-news/4298281/posts",
    "timestamp": "2025-02-17T18:10:47Z"
  },
  {
    "title": "U.S. tariffs sour outlook for Canadian sugar and candy companies",
    "description": "Canadian sugar and confectionary companies would be hit particularly hard if U.S. tariffs come into play because most of the industry’s sales go south of the border, experts say. “Sugar and confectionary does stand out as one of those sectors, especially in t…",
    "link": "https://financialpost.com/pmn/u-s-tariffs-sour-outlook-for-canadian-sugar-and-candy-companies",
    "timestamp": "2025-02-17T18:10:27Z"
  },
  {
    "title": "War-weary Gazans reel from '500 days of humiliation'",
    "description": "GAZA: For 500 days since an unprecedented Hamas attack on Israel triggered the Gaza Strip's deadliest war, Mohammed Abu Mursa has grappled with \"humiliation, suffering and bloodshed\" in his fight for survival",
    "link": "https://www.channelnewsasia.com/world/war-weary-gazans-reel-500-days-humiliation-4943596",
    "timestamp": "2025-02-17T18:10:06Z"
  },
  {
    "title": "Federal employee firings: How one Iowa man lost his dream job as a National Park Service Ranger",
    "description": "Brian Gibbs had no clue Friday would be his last day at his dream job. The education technician park ranger at Effigy Mounds National Monument in Iowa reported to work, only to be terminated on despite receiving an exceptional performance evaluation in the fa…",
    "link": "https://www.cnn.com/2025/02/17/us/iowa-federal-employee-fired-park-ranger/index.html",
    "timestamp": "2025-02-17T18:08:49Z"
  },
  {
    "title": "Donald Trump appeals to Supreme Court to fire watchdog head",
    "description": "President Donald Trump's declarations have targeted public spending and the dismantling of federal agencies in particular, and have triggered multiple legal challenges. The White House fired Hampton Dellinger, head of the Office of Special Counsel, on Februar…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-appeals-to-supreme-court-to-fire-watchdog-head/articleshow/118337317.cms",
    "timestamp": "2025-02-17T18:08:15Z"
  },
  {
    "title": "‘No Longer Justifies The Cost’: Migrant Shelters Close Down As Border Numbers Plunge Under Trump",
    "description": "Migrant shelters along the border and across the country are closing down as unlawful border crossings continue to plunge under the Trump administration.",
    "link": "https://dailycaller.com/2025/02/17/shelters-close-as-migrant-crossings-drop/",
    "timestamp": "2025-02-17T18:08:01Z"
  },
  {
    "title": "‘Doctor Who’ Star David Tennant Rages at ‘Villain’ Trump During BAFTA Film Awards Opening Speech",
    "description": "BAFTA Film Awards host and Doctor Who star David Tennant took several shots at President Donald Trump during Sunday’s ceremony, labeling Trump a “villain” and making jokes about his hair. During Tennant’s opening monologue at the BAFTA Film Awards, the actor …",
    "link": "https://freerepublic.com/focus/f-news/4298280/posts",
    "timestamp": "2025-02-17T18:06:36Z"
  },
  {
    "title": "Christopher Luxon open to sending NZ peacekeepers to Ukraine amid global tensions",
    "description": "PM says NZ often aligns with Britain's foreign policy decisions.",
    "link": "https://www.nzherald.co.nz/nz/politics/christopher-luxon-open-to-sending-nz-peacekeepers-to-ukraine-amid-global-tensions/PDKIGQW6EFCE5GA3AMNVZCR2JA/",
    "timestamp": "2025-02-17T18:05:41Z"
  },
  {
    "title": "Hundreds of FAA workers were fired weeks after deadly DC crash, union says, as Trump promises aviation safety upgrades",
    "description": "President Donald Trump pledged to make rapid improvements to increase aviation safety after a deadly plane crash in Washington, DC, in January.",
    "link": "https://www.businessinsider.com/faa-employees-fired-trump-doge-dc-plane-crash-2025-2",
    "timestamp": "2025-02-17T18:05:02Z"
  },
  {
    "title": "Ukraine: European leaders meet for emergency defense summit",
    "description": "Europe's leaders are meeting to chart a course forward as the US plans bilateral talks with Russia in a sudden policy shift. European Commission chief von der Leyen has said Europe needs an \"urgency mindset\" on defense. European leaders meet in Paris to discu…",
    "link": "https://www.dw.com/en/ukraine-european-leaders-meet-for-emergency-defense-summit/live-71634533",
    "timestamp": "2025-02-17T18:05:00Z"
  },
  {
    "title": "Mexico awaits new response from Google on dispute over Gulf of Mexico name before filing lawsuit",
    "description": "Mexico says it’s awaiting a new response from Google to its request that the tech company fully restore the name Gulf of Mexico to its Google Maps service before filing a lawsuit. President Claudia Sheinbaum shared a letter addressed to her government from Go…",
    "link": "https://www.seattlepi.com/news/world/article/mexico-awaits-new-response-from-google-on-dispute-20171974.php",
    "timestamp": "2025-02-17T18:03:27Z"
  },
  {
    "title": "PHOTOS: Crews 'Heroically' Perform 50 Rescues as Floodwaters Slam Kentucky Town",
    "description": "Residents in the small town of Pikeville, Kentucky, are grappling with disastrous flooding as crews work to rescue their neighbors.\nThe post PHOTOS: Crews ‘Heroically’ Perform 50 Rescues as Floodwaters Slam Kentucky Town appeared first on Breitbart.",
    "link": "https://www.breitbart.com/weather/2025/02/17/photos-crews-heroically-perform-50-rescues-floodwaters-slam-kentucky-town/",
    "timestamp": "2025-02-17T18:02:54Z"
  },
  {
    "title": "Trump has vowed to ‘unleash’ oil and gas drilling. Workers in Oklahoma hope for a boom",
    "description": "As President Trump is promising to \"unleash\" oil and gas production, employees in that industry are wondering if that'll mean more work for them.",
    "link": "https://www.pbs.org/newshour/nation/trump-has-vowed-to-unleash-oil-and-gas-drilling-workers-in-oklahoma-hope-for-a-boom",
    "timestamp": "2025-02-17T18:02:16Z"
  },
  {
    "title": "Trump admin makes emergency appeal to Supreme Court to allow whistleblower agency head’s firing",
    "description": "In an emergency appeal, Justice Department lawyers have asked the high court to lift a federal judge's order temporarily blocking Special Counsel Hampton Dellinger from being fired.",
    "link": "https://nypost.com/2025/02/17/us-news/trump-admin-wants-the-supreme-court-to-let-the-firing-of-whistleblower-agency-head-proceed/",
    "timestamp": "2025-02-17T18:01:36Z"
  },
  {
    "title": "Europeans try to muster coalition on Ukraine contributions, but split on peacekeeping troops",
    "description": "Both Poland and Spain have said they would need more assurances before making a decision.",
    "link": "https://www.euractiv.com/section/politics/news/europeans-try-to-muster-coalition-on-ukraine-contributions-but-split-on-peacekeeping-troops/",
    "timestamp": "2025-02-17T18:00:04Z"
  },
  {
    "title": "Coalition of could-be’s: As Washington goes AWOL, Europeans search for Ukraine unity",
    "description": "Both Poland and Spain have said they would need more assurances before making a decision.",
    "link": "https://www.euractiv.com/section/politics/news/coalition-of-could-bes-as-washington-goes-awol-europeans-search-for-ukraine-unity/",
    "timestamp": "2025-02-17T18:00:04Z"
  },
  {
    "title": "Macron’s Ukraine summit a gathering of ‘warmongers’ – EU state’s FM",
    "description": "EU leaders who support the continuation of the Ukraine conflict are gathering in Paris, Hungarian Foreign Minister Peter Szijjarto has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612879-macron-ukraine-summit-warmongers/",
    "timestamp": "2025-02-17T17:59:57Z"
  },
  {
    "title": "SNL 50 Review: Even A Few Missteps Couldn't Wipe The Smile Off My Face Throughout A (Mostly) Successful Blending Of Old & New",
    "description": "While it's longer runtime led to some misfire sketches, the Saturday Night Live 50th Anniversary Special was a wonderful tribute to its rich history.",
    "link": "https://screenrant.com/saturday-night-live-50-review/",
    "timestamp": "2025-02-17T17:58:20Z"
  },
  {
    "title": "Trump Tells Supreme Court It Gave Him 'Unrestricted Power' to Fire People",
    "description": "The Supreme Court's ruling on presidential immunity is now being used by the Trump administration.",
    "link": "https://www.newsweek.com/president-donald-trump-supreme-court-immunity-harmpton-dellinger-appeal-2032291",
    "timestamp": "2025-02-17T17:58:09Z"
  },
  {
    "title": "German election: Climate and environment take a back seat",
    "description": "Germany has expanded wind and solar energy but failed to cut back on fossil fuel use in the transport sector. Environmental issues did not feature prominently the election campaign — unlike the last time around. When the coalition government comprising the ce…",
    "link": "https://www.dw.com/en/german-election-climate-and-environment-take-a-back-seat/a-71643886",
    "timestamp": "2025-02-17T17:57:00Z"
  },
  {
    "title": "German election: Climate protection takes a back seat",
    "description": "Germany has expanded wind and solar energy but failed to cut back on fossil fuel use in the transport sector. Environmental issues did not feature prominently the election campaign — unlike the last time around. When the coalition government comprising the ce…",
    "link": "https://www.dw.com/en/german-election-climate-protection-takes-a-back-seat/a-71643886",
    "timestamp": "2025-02-17T17:57:00Z"
  },
  {
    "title": "Disney's Latest Sneak Peek for 'Snow White' Starring Rachel Zegler Gets 84K Dislikes in Just Two Days",
    "description": "The latest sneak peek for the Walt Disney Company's live-action remake of \"Snow White,\" starring Rachel Zegler, is getting hammered online, with the video receiving 84,000 \"dislikes\" on YouTube in just two days.\nThe post Disney’s Latest Sneak Peek for ‘Snow W…",
    "link": "https://www.breitbart.com/entertainment/2025/02/17/disneys-latest-sneak-peek-for-snow-white-starring-rachel-zegler-gets-84k-dislikes-in-just-two-days/",
    "timestamp": "2025-02-17T17:56:19Z"
  },
  {
    "title": "50 Terrible Songs on Great Albums",
    "description": "Even the greatest artists are guilty of putting garbage songs on otherwise classic LPs, from the Beatles and Bob Dylan to Harry Styles and Taylor Swift",
    "link": "http://www.rollingstone.com/music/music-lists/bad-songs-great-albums-1235262304/",
    "timestamp": "2025-02-17T17:55:56Z"
  },
  {
    "title": "Mexico awaits new response from Google on dispute over Gulf of Mexico name before filing lawsuit",
    "description": "MEXICO CITY (AP) — Mexico said Monday it’s awaiting a new response from Google to its request that the tech company fully restore the name Gulf of Mexico to its Google Maps service before filing a lawsuit. President Claudia Sheinbaum shared a letter addressed…",
    "link": "https://financialpost.com/pmn/mexico-awaits-new-response-from-google-on-dispute-over-gulf-of-mexico-name-before-filing-lawsuit",
    "timestamp": "2025-02-17T17:53:33Z"
  },
  {
    "title": "Republicans playing with fire! Right wing activist Steve Bannon warns medicaid cuts could burn MAGA movement and backfire for Donald Trump",
    "description": "Steve Bannon warned Republicans that cutting Medicaid would hurt Trump's base, as many MAGA supporters rely on the program.",
    "link": "https://economictimes.indiatimes.com/news/international/us/republicans-playing-with-fire-right-wing-activist-steve-bannon-warns-medicaid-cuts-could-burn-maga-movement-and-backfire-for-donald-trump/articleshow/118337038.cms",
    "timestamp": "2025-02-17T17:53:23Z"
  },
  {
    "title": "‘SNL50’ Played the Hits",
    "description": "The latest anniversary special recycled some aspects of past tribute shows, with little controversy, a lot of celebrity, and a sweet, knowing sentimentality",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/snl50-recap-review-1235267821/",
    "timestamp": "2025-02-17T17:53:02Z"
  },
  {
    "title": "Trump Administration Reportedly Unfires Staffers In Nuclear Security, Indian Health Service—Here’s What We Know",
    "description": "Some employees at the National Nuclear Security Administration, which oversees the U.S.’ nuclear weapons, were reportedly summoned back to work after being laid off last week.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/02/17/trump-administration-reportedly-unfires-staffers-in-nuclear-security-indian-health-service-heres-what-we-know/",
    "timestamp": "2025-02-17T17:52:49Z"
  },
  {
    "title": "A short history of the separation of powers: from Cicero’s Rome to Trump’s America",
    "description": "The checks and balances that hold a functioning democracy together may be coming under threat in the US.",
    "link": "https://theconversation.com/a-short-history-of-the-separation-of-powers-from-ciceros-rome-to-trumps-america-249819",
    "timestamp": "2025-02-17T17:51:38Z"
  },
  {
    "title": "Europe left scrambling in face of wavering US security guarantees",
    "description": "European leaders are stunned at the radical change of direction signalled by Donald Trump and his team.",
    "link": "https://theconversation.com/europe-left-scrambling-in-face-of-wavering-us-security-guarantees-249978",
    "timestamp": "2025-02-17T17:51:29Z"
  },
  {
    "title": "Geoengineering is politically off-limits – could a Trump presidency change that?",
    "description": "Trump has long been a climate-sceptic. But he’s close to tech figures who like big technological solutions to global problems.",
    "link": "https://theconversation.com/geoengineering-is-politically-off-limits-could-a-trump-presidency-change-that-248589",
    "timestamp": "2025-02-17T17:51:25Z"
  },
  {
    "title": "When a bishop called on Trump to ‘have mercy’, she was following the old Christian tradition of parrhesia",
    "description": "Christian history shows how bishops have used bold speech to challenge the powerful.",
    "link": "https://theconversation.com/when-a-bishop-called-on-trump-to-have-mercy-she-was-following-the-old-christian-tradition-of-parrhesia-248494",
    "timestamp": "2025-02-17T17:51:24Z"
  },
  {
    "title": "Majority of Americans believe foreign aid 'wasted on corruption', survey finds (Joe Miller/Financial Times)",
    "description": "Joe Miller / Financial Times:\nMajority of Americans believe foreign aid ‘wasted on corruption’, survey finds  —  Exclusive poll suggests voters back Donald Trump and Elon Musk's view of USAID  —  A majority of American voters believe most US foreign aid never…",
    "link": "https://www.memeorandum.com/250217/p51",
    "timestamp": "2025-02-17T17:50:00Z"
  },
  {
    "title": "THE TRASH REPORT: Flares, Margs, and a Thesis Proposal! Am I in College Again?",
    "description": "Time to pick up the trash—your weekly pile of gossip trash, that is.\n \n by Elinor Jones\n \n \n \n Hello Trash Pandas and welcome back to the Trash Report. I'm Elinor Jones, and I've missed you so much! I didn't write a column last week because I was on \"vacation…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/02/17/47647223/the-trash-report-flares-margs-and-a-thesis-proposal-am-i-in-college-again",
    "timestamp": "2025-02-17T17:50:00Z"
  },
  {
    "title": "Mexican president says government may sue Google over 'Gulf of America' name change",
    "description": "Claudia Sheinbaum said in a statement on Friday that the Mexican government would file a civil suit against Google ‘if necessary’.",
    "link": "https://www.thejournal.ie/mexico-president-sue-google-gulf-of-america-6625709-Feb2025/",
    "timestamp": "2025-02-17T17:47:47Z"
  },
  {
    "title": "'How Does This Help Working People?' Fury Over Trump Mass Firing of Health Workforce",
    "description": "Reducing the price of groceries—a key campaign promise made by U.S. President Donald Trump—has thus far ranked low on his administration's list of priorities, but mass firings at numerous federal health agencies over the weekend suggested that scaling back ef…",
    "link": "https://www.commondreams.org/news/healthcare-trump",
    "timestamp": "2025-02-17T17:46:35Z"
  },
  {
    "title": "‘It’s Remarkable’: Glenn Greenwald Celebrates His Warm Welcome on Fox News as Proof of the ‘Trump Realignment’",
    "description": "Glenn Greenwald, who has long been associated with the far-left of American politics, celebrated his recent appearance on Fox News as “remarkable.”\nThe post ‘It’s Remarkable’: Glenn Greenwald Celebrates His Warm Welcome on Fox News as Proof of the ‘Trump Real…",
    "link": "https://www.mediaite.com/tv/its-remarkable-glenn-greenwald-celebrates-his-warm-welcome-on-fox-news-as-proof-of-the-trump-realignment/",
    "timestamp": "2025-02-17T17:46:21Z"
  },
  {
    "title": "These are the two big things we're watching in the stock market in the week ahead",
    "description": "Housing data and earnings from our newest Club holding are big events in the holiday-shortened week.",
    "link": "https://www.cnbc.com/2025/02/17/two-big-things-were-watching-in-the-stock-market-in-the-week-ahead.html",
    "timestamp": "2025-02-17T17:45:20Z"
  },
  {
    "title": "This Is the Way to Stop Elon Musk",
    "description": "Senate Democrats have the power to block federal contracts to Tesla and SpaceX. It’s the path to pushing Musk out of politics.\nThe post This Is the Way to Stop Elon Musk appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/02/17/elon-musk-trump-government-tesla-spacex/",
    "timestamp": "2025-02-17T17:44:19Z"
  },
  {
    "title": "Ukraine: Emergency summit underway in Paris",
    "description": "Europe's leaders are meeting to chart a course forward as the US plans bilateral talks with Russia in a sudden policy shift. European Commission chief von der Leyen has said Europe needs an \"urgency mindset\" on defense.",
    "link": "https://www.dw.com/en/ukraine-emergency-summit-underway-in-paris/live-71634533",
    "timestamp": "2025-02-17T17:44:00Z"
  },
  {
    "title": "Ukraine: Emergency summit underway in Paris",
    "description": "European Commission chief von der Leyen has said Europe needs an \"urgency mindset\" on defense as US pursues unilateral talks with Russia. European leaders are meeting to chart a course forward. DW has more. European leaders meet in Paris to discuss Ukraine an…",
    "link": "https://www.dw.com/en/ukraine-emergency-summit-underway-in-paris/live-71634533",
    "timestamp": "2025-02-17T17:44:00Z"
  },
  {
    "title": "Rubella Back?: RFK Jr. Confirmed As Health Secretary, Nation Shudders",
    "description": "Robert F. Kennedy Jr. was confirmed as Health and Human Services Secretary on Thursday in a narrow vote. All Democratic senators voted against him, with Senator Mitch McConnell the only Republican to join them.",
    "link": "https://hiphopwired.com/2611721/rfk-jr-confirmed-health-secretary-nation-shudders/",
    "timestamp": "2025-02-17T17:43:00Z"
  },
  {
    "title": "Michigan Police Defy Donald Trump's Mass Deportation Plan",
    "description": "Grand Rapids Police Chief Eric Winstrom refuses to assist ICE, saying immigration enforcement is the federal government's job.",
    "link": "https://www.newsweek.com/michigan-police-donald-trump-mass-deportation-2032275",
    "timestamp": "2025-02-17T17:41:09Z"
  },
  {
    "title": "Musk’s takeover of US health agencies raises pandemic threat, experts warn - NewsBreak",
    "description": "Musk’s takeover of US health agencies raises pandemic threat, experts warn - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3814302406527-musk-s-takeover-of-us-health-agencies-raises-pandemic-threat-experts-warn?s=a2&amp;share_destination_id=MTU4NDA5NTY1LTE3Mzk4MTM5NjE0MTk%3D&amp;pd=0AifYzAz&amp;hl=en_US&amp;send_time=1739813961&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v6%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v2",
    "timestamp": "2025-02-17T17:39:55Z"
  },
  {
    "title": "Trump’s Napoleon Quote Baits the Left Into Yet Another Meltdown",
    "description": "“He who saves his Country does not violate any law,” Trump posted over the weekend.\nThe post Trump’s Napoleon Quote Baits the Left Into Yet Another Meltdown appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/17/trumps-napoleon-quote-baits-the-left-into-yet-another-meltdown/",
    "timestamp": "2025-02-17T17:38:16Z"
  },
  {
    "title": "Elon Musk Urges Alarming Action Against CBS's '60 Minutes'",
    "description": "\"60 Minutes are the biggest liars in the world!\" the world's richest man wrote on his social media platform, X.",
    "link": "https://www.huffpost.com/entry/elon-musk-60-minutes_n_67b3553ae4b0e4f0516445e3",
    "timestamp": "2025-02-17T17:37:40Z"
  },
  {
    "title": "‘The View’: Alyssa Farah Griffin Finds the Big Flaw in Democrats’ ‘Playbook’ Against Trump | Video",
    "description": "\"They've got to get quick and smart if they're wanting to push back,\" the ABC host says\nThe post ‘The View’: Alyssa Farah Griffin Finds the Big Flaw in Democrats’ ‘Playbook’ Against Trump | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-view-alyssa-farah-griffin-why-democrats-cant-beat-trump/",
    "timestamp": "2025-02-17T17:36:58Z"
  },
  {
    "title": "The price of eggs just hit an all-time high. Here’s how the cost of everyday consumer goods is changing under the Trump administration.",
    "description": "Using Consumer Price Index data, the Tribune is tracking 11 everyday costs for Americans and how they are changing under the Trump administration.",
    "link": "https://www.denverpost.com/2025/02/17/us-consumer-goods-price-tracker/",
    "timestamp": "2025-02-17T17:36:26Z"
  },
  {
    "title": "The price of eggs just hit an all-time high. Here’s how the cost of everyday consumer goods is changing under the Trump administration.",
    "description": "Using Consumer Price Index data, the Tribune is tracking 11 everyday costs for Americans and how they are changing under the Trump administration.",
    "link": "https://www.bostonherald.com/2025/02/17/us-consumer-goods-price-tracker/",
    "timestamp": "2025-02-17T17:36:26Z"
  },
  {
    "title": "The anti-Musk protest movement is expected to ramp up with Congress on recess",
    "description": "President Donald Trump's billionaire top lieutenant, Elon Musk, is the focus for thousands of Democratic activists launching a massive protest campaign this week.",
    "link": "https://www.local10.com/business/2025/02/17/the-anti-musk-protest-movement-is-expected-to-ramp-up-with-congress-on-recess/",
    "timestamp": "2025-02-17T17:35:57Z"
  },
  {
    "title": "Musk team seeks access to IRS system with taxpayers’ records | Honolulu Star-Advertiser",
    "description": "The IRS is preparing to give a team member working with Elon Musk’s so-called Department of Government Efficiency access to sensitive taxpayer data, people familiar with the matter said.",
    "link": "https://www.staradvertiser.com/2025/02/17/breaking-news/musk-team-seeks-access-to-irs-system-with-taxpayers-records/",
    "timestamp": "2025-02-17T17:35:55Z"
  },
  {
    "title": "As Trump Bars Asylum Claims, Migrants Struggle in Mexico City",
    "description": "Trump’s crackdown has caused distress and anguish for many, compounding their already precarious mental health.",
    "link": "https://prismreports.org/2025/02/17/trump-asylum-ban-migrants-mental-health/",
    "timestamp": "2025-02-17T17:35:42Z"
  },
  {
    "title": "NYT Strands, the word-search game: Hints, ‘spangram’ and more for the February 17, 2025, puzzle",
    "description": "Facing trouble in solving February 17's NYT Strands. Here we provide hints and answers that can easily help you in solving the puzzle game. The theme for the day is Sun shade and the spangram for today is horizontal and Yellow colour.",
    "link": "https://economictimes.indiatimes.com/news/international/us/nyt-strands-the-word-search-game-hints-spangram-and-more-for-the-february-17-2025-puzzle/articleshow/118336720.cms",
    "timestamp": "2025-02-17T17:34:47Z"
  },
  {
    "title": "Trump Lawyer Downplays Elon Musk’s Authority In Court Hearing —Here’s What To Know About DOGE",
    "description": "A federal judge is expected to rule shortly on whether DOGE can keep accessing federal data.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/02/17/trump-lawyer-downplays-elon-musks-authority-in-court-hearing--heres-what-to-know-about-doge/",
    "timestamp": "2025-02-17T17:34:15Z"
  },
  {
    "title": "Washington Post Columnists Back Trump’s Move to Ditch the Penny — ‘And the Nickel and Dime, Too!’",
    "description": "Donald Trump's announcement that he was ordering the Treasury Department to stop minting pennies was cheered on by a group of WaPo columnists.\nThe post Washington Post Columnists Back Trump’s Move to Ditch the Penny — ‘And the Nickel and Dime, Too!’ first app…",
    "link": "https://www.mediaite.com/news/washington-post-columnists-back-trumps-move-to-ditch-the-penny-and-the-nickel-and-dime-too/",
    "timestamp": "2025-02-17T17:34:12Z"
  },
  {
    "title": "Exclusive — Trump’s USDA Secretary Brooke Rollins on Lowering Egg Prices: ‘We’re On It,’ ‘Going to Do Everything We Can to Address It’",
    "description": "WASHINGTON — U.S. Department of Agriculture (USDA) Secretary Brooke Rollins told Breitbart News late last week that President Donald Trump and his administration are keenly focused on lowering the price of eggs in the United States and prepared to take any an…",
    "link": "https://www.breitbart.com/politics/2025/02/17/exclusive-trumps-usda-secretary-brooke-rollins-on-lowering-egg-prices-were-on-it-going-to-do-everything-we-can-to-address-it/",
    "timestamp": "2025-02-17T17:32:07Z"
  }
]