[
  {
    "title": "No Big Surprise: Trump's 'Big Beautiful Bill' Will Favor The Rich",
    "description": "The pro-worker tax cuts Trump proposed during the campaign aren't enough to skew the bill in a more populist direction.",
    "link": "https://www.huffpost.com/entry/one-big-beautiful-bill-tax-distribution_n_682cb006e4b012527e8600b5",
    "timestamp": "2025-05-20T18:42:19Z"
  },
  {
    "title": "EU Likely to Propose Quota to Ban Russia Gas Imports by End 2027",
    "description": "The European Union is likely to propose a quota as the mechanism to enforce a bloc-wide import ban on Russian gas by the end of 2027, which officials say should provide companies with a legal basis to terminate long-term purchase contracts.",
    "link": "https://financialpost.com/pmn/business-pmn/eu-likely-to-propose-quota-to-ban-russia-gas-imports-by-end-2027",
    "timestamp": "2025-05-20T18:41:06Z"
  },
  {
    "title": "Federal judge with history of anti-Trump remarks assigned to Hannah Dugan criminal case",
    "description": "Milwaukee Judge Hannah Dugan's trial, overseen by Judge Lynn Adelman, raises concerns of political bias due to Adelman's past remarks on Trump and Roberts.",
    "link": "https://www.foxnews.com/politics/federal-judge-history-anti-trump-remarks-assigned-hannah-dugan-criminal-case",
    "timestamp": "2025-05-20T18:40:23Z"
  },
  {
    "title": "Danish man in Mississippi detained by ICE at citizenship meeting",
    "description": "A Danish man living in Mississippi for a dozen years has been imprisoned in Louisiana for more than a month after Immigration and Customs Enforcement officers took him into custody because of a “paperwork miscommunication” during his effort to become a natura…",
    "link": "https://www.rawstory.com/danish-man-living-in-mississippi-detained-by-ice-at-citizenship-meeting/",
    "timestamp": "2025-05-20T18:40:22Z"
  },
  {
    "title": "NOAA Has ‘Ground to a Halt’ as Lutnick Has Left Contracts Unsigned",
    "description": "A NOAA official says that “everything has ground to a halt” at the agency as staffers have waited for Secretary of Commerce Howard Lutnick to review more than 200 agreements",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/05/20/noaa-paralyzed-by-backlog-of-unsigned-contracts-00357095",
    "timestamp": "2025-05-20T18:40:00Z"
  },
  {
    "title": "Noem says Trump can deport who he wants, botches what 'habeas corpus' means",
    "description": "Homeland Security Secretary Kristi Noem said Tuesday that President Donald Trump has an absolute right to deport people without due process, after she incorrectly defined the meaning of the term habeas corpus.\nNoem was grilled on habeas corpus — the constitut…",
    "link": "https://biztoc.com/x/1ac41c5236bc0d44",
    "timestamp": "2025-05-20T18:37:10Z"
  },
  {
    "title": "Energy Company’s Latest Bitcoin Buy Brings Treasury to $78 Million",
    "description": "Energy storage company KULR Technology Group has bought an additional $9 million Bitcoin for its corporate treasury, the company announced Tuesday.",
    "link": "https://decrypt.co/321119/energy-companys-bitcoin-buy-brings-treasury-to-78-million",
    "timestamp": "2025-05-20T18:36:53Z"
  },
  {
    "title": "Trump Envoy Frees U.S. Vet From Venezuela Through Diplomatic Channels",
    "description": "A U.S. Air Force veteran detained in Venezuela was released Tuesday after a secret mission led by President Donald Trump’s envoy, Ric Grenell. Joseph St. Clair, a 33-year-old disabled veteran, was arrested in October 2024 while traveling near the Colombian-Ve…",
    "link": "https://biztoc.com/x/14b229b1f50cf51c",
    "timestamp": "2025-05-20T18:36:25Z"
  },
  {
    "title": "Trump's tech advisers question Romanian election, diverging from U.S. diplomat's message",
    "description": "Right-wing tech moguls who are part of Donald Trump’s White House are casting doubt on democracy in Romania, at odds with the top U.S. diplomat in the country.",
    "link": "https://www.nbcnews.com/tech/internet/trumps-tech-advisers-question-romanian-election-odds-us-diplomat-rcna207803",
    "timestamp": "2025-05-20T18:36:05Z"
  },
  {
    "title": "State Farm Not Satisfied with 17% Rate Hike in California; Asks for Nearly 30%",
    "description": "State Farm is evidently not satisfied with an emergency 17% rate hike for homeowners in California, and intends to ask for 11% more, adding up to a total of nearly 30% -- despite failing its obligations to consumers.\nThe post State Farm Not Satisfied with 17%…",
    "link": "https://www.breitbart.com/politics/2025/05/20/state-farm-not-satisfied-with-17-rate-hike-california-asks-for-nearly-30/",
    "timestamp": "2025-05-20T18:34:40Z"
  },
  {
    "title": "Young girl asks President Trump's press secretary: 'How many people has he fired?'",
    "description": "Trump secretary Karoline Leavitt answered questions from kids about Trump's favorite food, whether he liked hugs ‒ and how many people he'd fired.",
    "link": "https://www.usatoday.com/story/news/politics/2025/05/20/girl-asks-how-many-trump-fired/83747039007/",
    "timestamp": "2025-05-20T18:34:12Z"
  },
  {
    "title": "EU to lift remaining economic sanctions on Syria to support war-torn country's recovery",
    "description": "It comes after US President Donald Trump announced he would lift sanctions on Syria last week.",
    "link": "https://www.thejournal.ie/eu-to-lift-remaining-sanctions-on-syria-6710132-May2025/",
    "timestamp": "2025-05-20T18:34:02Z"
  },
  {
    "title": "4G Calling (VoLTE) flaw allowed to locate any O2 customer with a phone call",
    "description": "A flaw in O2 4G Calling (VoLTE) leaked user location data via network responses due to improper IMS standard implementation. A flaw in 4G Calling (VoLTE) service of the UK telecom O2 exposed user location data through network responses due to flaws in the IMS…",
    "link": "https://securityaffairs.com/178114/hacking/4g-calling-volte-flaw-allowed-to-locate-any-o2-customer-with-a-phone-call.html",
    "timestamp": "2025-05-20T18:34:00Z"
  },
  {
    "title": "CBS Vs. Trump Flashback: Seven Times ‘The Good Fight’ Trashed 45-47",
    "description": "Given the circumstances surrounding Donald Trump’s lawsuit against 60 Minutes and how the news division is apparently under pressure to temper its criticism of the current administration, it seems hard to believe that just a few years ago, a CBS-owned show al…",
    "link": "http://deadline.com/2025/05/cbs-vs-trump-seven-times-the-good-fight-trashed-45-47-1236405904/",
    "timestamp": "2025-05-20T18:33:03Z"
  },
  {
    "title": "Jamie Dimon issues chilling warning about Donald Trump’s scaled-back tariffs, says Wall Street is ignoring a looming economic shock",
    "description": "JPMorgan Chase CEO Jamie Dimon cautioned about the US tariff policy. He highlighted potential economic damage. Dimon noted rising tariffs and inflated asset prices. He also mentioned tougher borrowing conditions for businesses. Dimon suggested a possible stoc…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jamie-dimon-issues-chilling-warning-about-donald-trumps-scaled-back-tariffs-says-wall-street-is-ignoring-a-looming-economic-shock/articleshow/121298824.cms",
    "timestamp": "2025-05-20T18:31:56Z"
  },
  {
    "title": "Children take over White House briefing room with questions about Trump's favorite ice cream, superpower",
    "description": "Karoline Leavitt shares insights on President Trump's preferences, including his favorite food and ice cream, during a fun Q&A with children at the White House.",
    "link": "https://www.foxnews.com/politics/children-take-over-white-house-briefing-room-questions-about-trumps-favorite-ice-cream-superpower",
    "timestamp": "2025-05-20T18:31:53Z"
  },
  {
    "title": "Exclusive -- Brooke Rollins: It Is a 'New Day' in America as We Work to Address the World Economy and 'Put America First'",
    "description": "It is a \"new day\" in America as the Trump administration works to address the world economy and \"put America first,\" Agriculture Secretary Brooke Rollins said.\nThe post Exclusive — Brooke Rollins: It Is a ‘New Day’ in America as We Work to Address the World E…",
    "link": "https://www.breitbart.com/politics/2025/05/20/exclusive-brooke-rollins-it-is-new-day-america-we-work-address-world-economy-put-america-first/",
    "timestamp": "2025-05-20T18:30:50Z"
  },
  {
    "title": "First lady Melania Trump welcomes children to White House for work day celebration",
    "description": "Melania Trump celebrates \"Take Our Daughters and Sons to Work Day,\" inviting children to the East Garden at the White House and decorating wooden flags following recent \"Be Best\" wins.",
    "link": "https://www.foxnews.com/lifestyle/first-lady-melania-trump-welcomes-children-white-house-work-day-celebration",
    "timestamp": "2025-05-20T18:30:49Z"
  },
  {
    "title": "What to know about the GENIUS Act, a crypto regulation bill",
    "description": "The Senate voted 66-22 to advance the measure late Monday.",
    "link": "https://abcnews.go.com/Business/genius-act-crypto-regulation-bill/story?id=121981442",
    "timestamp": "2025-05-20T18:30:25Z"
  },
  {
    "title": "Noem says Trump can deport who he wants, botches what 'habeas corpus' means",
    "description": "Kristi Noem spoke after White House aide Stephen Miller  floated suspending the writ of habeas corpus for migrants.",
    "link": "https://www.cnbc.com/2025/05/20/kristi-noem-habeas-corpus-immigration.html",
    "timestamp": "2025-05-20T18:30:11Z"
  },
  {
    "title": "Reds vs. Pirates odds, prediction: MLB best bets, picks for Tuesday",
    "description": "Stitches makes his pick for Reds vs. Pirates on Tuesday.",
    "link": "https://nypost.com/2025/05/20/betting/reds-vs-pirates-odds-prediction-mlb-best-bets-picks/",
    "timestamp": "2025-05-20T18:30:00Z"
  },
  {
    "title": "How due process helps Trump-aligned defendants in the Arizona fake electors case",
    "description": "If there’s a legal term that dominates Donald Trump’s presidency, “due process” might be it.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/fake-electors-arizona-due-process-rcna207960",
    "timestamp": "2025-05-20T18:29:37Z"
  },
  {
    "title": "‘Blatant political attack’: US lawmaker charged over ICE centre standoff",
    "description": "Democrats say the Trump administration's decision to charge Congresswoman LaMonica McIver sets a 'dangerous precedent'.",
    "link": "https://www.aljazeera.com/news/2025/5/20/blatant-political-attack-us-lawmaker-charged-over-ice-centre-standoff",
    "timestamp": "2025-05-20T18:28:38Z"
  },
  {
    "title": "Trump to Announce $25 Billion for ‘Golden Dome’",
    "description": "\"President Donald Trump will announce $25 billion for his 'Golden Dome' defense project Tuesday afternoon, a fraction of the amount it would eventually cost to build the ambitious national missile system he’s demanded,\" Politico reports.",
    "link": "https://politicalwire.com/2025/05/20/trump-to-announce-25-billion-for-golden-dome/",
    "timestamp": "2025-05-20T18:28:33Z"
  },
  {
    "title": "Report: Syria gives Israel belongings of Mossad spy Eli Cohen as goodwill gesture to Trump",
    "description": "The archive of legendary Israeli spy Eli Cohen was announced to be back in Israeli hands on Sunday. Now, sources tell Reuters that Syrian President al-Sharaa offered the archives to Israel as an indirect gesture, as he seeks to cool tensions and build Trump's…",
    "link": "https://www.haaretz.com/middle-east-news/2025-05-20/ty-article/report-syria-gives-israel-belongings-of-mossad-spy-eli-cohen-as-goodwill-gesture-to-trump/00000196-eec5-dc13-a3bf-fffd34aa0000",
    "timestamp": "2025-05-20T18:27:18Z"
  },
  {
    "title": "Pentagon Gives Update on Qatar's Jet Gift Becoming Trump Air Force One",
    "description": "During a Senate hearing, Air Force Secretary Meink acknowledged that the Qatari aircraft would need \"significant modifications.\"",
    "link": "https://www.newsweek.com/hegseth-update-qatar-jet-trump-air-force-one-2074837",
    "timestamp": "2025-05-20T18:27:13Z"
  },
  {
    "title": "Biden’s Late Cancer Diagnosis Exposes Democrats And The Media As Legitimate National Security Risks",
    "description": "Until Democrats start naming names and apologizing for their reckless, craven conduct as it relates to Joe Biden, I don’t want to hear another word about Pete Hegseth’s Signal chats. It was fine timing to get news over the weekend that the former president, a…",
    "link": "https://freerepublic.com/focus/f-news/4318128/posts",
    "timestamp": "2025-05-20T18:26:39Z"
  },
  {
    "title": "EU, UK put more curbs on Russia; target companies, oil tankers",
    "description": "London and Brussels said their new measures would zero in on Moscow's \"shadow fleet\" of oil tankers and financial companies that have helped it avoid the impact of other sanctions imposed over the war. \"Sanctions matter, and I am grateful to everyone who make…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-uk-put-more-curbs-on-russia-target-companies-oil-tankers/articleshow/121299419.cms",
    "timestamp": "2025-05-20T18:26:28Z"
  },
  {
    "title": "Rubio 'Didn't Even Know' About Trump's Upcoming Memecoin Dinner Involving Foreign Guests: 'This is the First I've Heard of It'",
    "description": "Marco Rubio testified at a Senate hearing where he claimed he \"didn't even know\" about an exclusive dinner Donald Trump is hosting for his memecoin holders.",
    "link": "https://www.ibtimes.com/rubio-didnt-even-know-about-trumps-upcoming-memecoin-dinner-involving-foreign-guests-this-3774098",
    "timestamp": "2025-05-20T18:26:08Z"
  },
  {
    "title": "Venezuela minister says U.S. detainee handed over to Trump envoy in Antigua",
    "description": "CARACAS (Reuters) -Venezuela information minister Freddy Nazareth Nanez said in a message to Reuters on Tuesday that an American detainee was handed over to Richard Grenell, an envoy of U.S. President Donald Trump in Antigua. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/21/venezuela-minister-says-us-detainee-handed-over-to-trump-envoy-in-antigua",
    "timestamp": "2025-05-20T18:24:00Z"
  },
  {
    "title": "Friend turned foe? Reports say Benjamin Netanyahu manipulated American aid in his pursuit of power through war",
    "description": "Netanyahu is not America’s ally — that’s the powerful message behind Donald Trump’s bold decision to skip Israel during his Middle East tour. In a rare political shift, Trump signals that the U.S. is no longer blindly backing Israeli Prime Minister Benjamin N…",
    "link": "https://economictimes.indiatimes.com/news/international/us/friend-turned-foe-reports-say-benjamin-netanyahu-manipulated-american-aid-in-his-pursuit-of-power-through-war/articleshow/121297830.cms",
    "timestamp": "2025-05-20T18:23:53Z"
  },
  {
    "title": "House GOP’s ‘Big, Beautiful Bill’ Rebels Still Holding Out After Trump’s High-Stakes Capitol Hill Visit",
    "description": "A group of House Republicans threatening to withhold their vote from President Donald Trump's \"Big, Beautiful Bill\" are standing firm.\nThe post House GOP’s ‘Big, Beautiful Bill’ Rebels Still Holding Out After Trump’s High-Stakes Capitol Hill Visit first appea…",
    "link": "https://www.mediaite.com/media/news/house-gops-big-beautiful-bill-rebels-still-holding-out-after-trumps-high-stakes-capitol-hill-visit/",
    "timestamp": "2025-05-20T18:23:16Z"
  },
  {
    "title": "U.S. sends 68 migrants back to Honduras and Colombia in first voluntary deportation",
    "description": "Experts believe the self-deportation offer will appeal to a small portion of migrants already considering return, but unlikely to spur high demand.",
    "link": "https://www.nbcnews.com/news/latino/us-sends-flights-migrants-self-deport-honduras-colombia-rcna208048",
    "timestamp": "2025-05-20T18:22:50Z"
  },
  {
    "title": "Joe Biden Has Nothing to Do With the 2028 Election",
    "description": "Democratic presidential aspirants should not feel obligated to self-flagellate to win back the public trust. The what-did-they-know-and-when-did-they-know-it media frenzy was just getting started, with Democratic officeholders being pressed by last week’s Sun…",
    "link": "https://freerepublic.com/focus/f-news/4318127/posts",
    "timestamp": "2025-05-20T18:22:03Z"
  },
  {
    "title": "Trump mocked for not knowing gas prices: 'Divorced from reality'",
    "description": "President Donald Trump spoke to the press inside the Capitol Tuesday after he met with the House Republican caucus about the budget bill they aim to pass this week. However, viewers noticed some of Trump's tangents or answers to questions were unusual — or do…",
    "link": "https://www.rawstory.com/trump-budget-2672171407/",
    "timestamp": "2025-05-20T18:21:04Z"
  },
  {
    "title": "Equality Caucus Chair slams Trump loyalist’s ‘morally bankrupt’ DOJ arrest of Democratic congresswoman",
    "description": "Congressional leaders and LGBTQ+ equality advocates are speaking out forcefully after the Trump administration charged Rep. LaMonica McIver, a Black Democrat from New Jersey, with felony assault, accusing her of attacking law enforcement officers during what …",
    "link": "https://www.advocate.com/crime/alina-habba-charges-lamonica-mciver",
    "timestamp": "2025-05-20T18:17:58Z"
  },
  {
    "title": "Chanel reports 28% drop in full-year profit",
    "description": "French luxury group Chanel said Tuesday that it suffered a 28.2-percent drop in net profit to $3.4 billion last year because of “challenging” conditions in some markets. “We saw challenging macroeconomic conditions which had an impact on sales in some markets…",
    "link": "https://www.digitaljournal.com/world/chanel-reports-28-drop-in-full-year-profit/article",
    "timestamp": "2025-05-20T18:17:32Z"
  },
  {
    "title": "Trump admin ends halt on New York offshore wind project",
    "description": "President Donald Trump’s administration has reversed its halt on a giant offshore wind project in New York led by Norwegian company Equinor, US officials confirmed Tuesday. New York Governor Kathy Hochul and Equinor had announced the policy shift in statement…",
    "link": "https://www.digitaljournal.com/world/trump-admin-ends-halt-on-new-york-offshore-wind-project/article",
    "timestamp": "2025-05-20T18:17:32Z"
  },
  {
    "title": "Inside the Democrats’ Reboot",
    "description": "Like a lot of Democrats these days, Chris Murphy has been doing some soul searching. For years, the Connecticut Senator, who took office shortly after the mass shooting at Sandy Hook Elementary in Newtown, was one of the nation’s most outspoken advocates for …",
    "link": "https://freerepublic.com/focus/f-news/4318123/posts",
    "timestamp": "2025-05-20T18:15:49Z"
  },
  {
    "title": "Trump Admin Ends Halt On New York Offshore Wind Project",
    "description": "President Donald Trump's administration has reversed its halt on a giant offshore wind project in New York led by Norwegian company Equinor, US officials confirmed Tuesday.",
    "link": "https://www.ibtimes.com/trump-admin-ends-halt-new-york-offshore-wind-project-3774097",
    "timestamp": "2025-05-20T18:15:19Z"
  },
  {
    "title": "White House says Trump is reviewing IVF policy recommendations promised in executive order",
    "description": "The report was sent to the president days after an explosion damaged part of a fertility clinic in Palm Springs.",
    "link": "https://www.bostonherald.com/2025/05/20/trump-ivf/",
    "timestamp": "2025-05-20T18:15:15Z"
  },
  {
    "title": "By Trump's Logic, Biden Deserves Credit for a Dramatic Drop in Overdose Deaths",
    "description": "That conclusion implausibly assumes presidents have the power to curtail substance abuse by attacking the drug supply.",
    "link": "https://reason.com/2025/05/21/by-trumps-logic-biden-deserves-credit-for-a-dramatic-drop-in-overdose-deaths/",
    "timestamp": "2025-05-20T18:15:11Z"
  },
  {
    "title": "Democrats Are Greenlighting Trump's Crypto Corruption (Chris Lehmann/The Nation)",
    "description": "Chris Lehmann / The Nation:\nDemocrats Are Greenlighting Trump's Crypto Corruption  —  Sixteen senators backed a disastrous bill that enshrines the crypto industry's flagrant abuses into law.  —  Bluesky  —  Pocket  —  When President Donald Trump convenes his …",
    "link": "https://www.memeorandum.com/250520/p93",
    "timestamp": "2025-05-20T18:15:00Z"
  },
  {
    "title": "Trump Admin Reportedly Lets NY Advance Green Project Hoping For Pipeline — But Team Hochul Downplays Deal",
    "description": "A Norwegian company will continue construction on its $5 billion subsidized offshore wind project after the Trump administration lifted its pause on Monday.",
    "link": "https://dailycaller.com/2025/05/20/hochul-trump-pipelin-offshore-wind-new-york/",
    "timestamp": "2025-05-20T18:14:41Z"
  },
  {
    "title": "S&P 500's win steak may end — but, our newest stock gets a double-dose of good news",
    "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "link": "https://www.cnbc.com/2025/05/20/sp-500s-win-steak-may-end-but-our-newest-stock-gets-a-double-dose-of-good-news.html",
    "timestamp": "2025-05-20T18:14:24Z"
  },
  {
    "title": "Elon Musk plans to cut back political spending",
    "description": "Elon Musk plans to cut back political spending\nBillionaire Elon Musk has said he expects to dial back his political donations, a major shift from the figure who shook up the 2024 election as a top donor to President Donald Trump.\nMusk, who ultimately spent mo…",
    "link": "https://biztoc.com/x/c854e30d922fcd86",
    "timestamp": "2025-05-20T18:14:17Z"
  },
  {
    "title": "Elon Musk says he will cut back on political spending after heavily backing Trump in 2024",
    "description": "Elon Musk, the richest person in the world and a key financial supporter of President Donald Trump, says he’ll be spending less on political campaigns",
    "link": "https://biztoc.com/x/b0eaedb0f328f8a5",
    "timestamp": "2025-05-20T18:14:17Z"
  },
  {
    "title": "EU-UK deal a ‘lost opportunity’ that could have gone further, says Varadkar",
    "description": "Former taoiseach describes ‘reset’ pact as ‘underwhelming’",
    "link": "https://www.irishtimes.com/politics/2025/05/20/eu-uk-deal-a-lost-opportunity-that-could-have-gone-further-says-varadkar/",
    "timestamp": "2025-05-20T18:14:16Z"
  },
  {
    "title": "Trump Denies He's Losing Patience Over Tax Bill",
    "description": "President Donald Trump on Tuesday pushed back on demands from Republicans who have threatened to sink his giant tax bill if the legislation does not significantly boost the state and local tax deduction, lawmakers said.\nIn a private meeting with House Republi…",
    "link": "https://biztoc.com/x/6cef3f6c90fc6bd6",
    "timestamp": "2025-05-20T18:14:12Z"
  },
  {
    "title": "20 Reasons Why Congress Must Unite Behind the One, Big, Beautiful Bill",
    "description": "Congressional Republicans MUST unite to pass President Donald J. Trump’s One, Big, Beautiful Bill and take advantage of the once-in-a-generation opportunity they were given by voters.Here are 20 reasons why Congress must unite behind the One, Big, Beautiful B…",
    "link": "https://freerepublic.com/focus/f-news/4318122/posts",
    "timestamp": "2025-05-20T18:14:05Z"
  },
  {
    "title": "Trump-Hochul Deal Revives New York Offshore Wind Project—and Possibly Pipelines",
    "description": "The Trump administration is allowing construction to resume on a $5 billion wind farm off Long Island after reaching a deal with New York Governor Kathy Hochul that could allow new natural gas pipelines to be built in the state.",
    "link": "https://gcaptain.com/trump-hochul-deal-revives-new-york-offshore-wind-project-and-possibly-pipelines/",
    "timestamp": "2025-05-20T18:13:59Z"
  },
  {
    "title": "Embattled NY AG Letitia James touts Trump legal battles — while blasting DOJ probe into alleged real estate fraud",
    "description": "\"As of today, we have filed 21, 22, 23 lawsuits against this administration,\" James boasted after delivering the keynote address at the Association for a Better New York's \"Power Breakfast.\"",
    "link": "https://nypost.com/2025/05/20/us-news/ny-ag-letitia-james-rips-doj-probe-into-alleged-real-estate-fraud/",
    "timestamp": "2025-05-20T18:13:35Z"
  },
  {
    "title": "Rubio fires back after Dem senator says he regrets voting for him, sparking tense exchange",
    "description": "Secretary of State Marco Rubio said that Sen. Chris Van Hollen's \"regret\" shows that Rubio and the Trump administration are doing their job correctly.",
    "link": "https://www.foxnews.com/politics/rubio-fires-back-after-dem-senator-says-he-regrets-voting-him-sparking-tense-exchange",
    "timestamp": "2025-05-20T18:13:22Z"
  },
  {
    "title": "Italy's Meloni ready to help if Vatican agrees to Trump's war mediation plan",
    "description": "For now the Holy See says the idea of even hosting talks is more a hope than a concrete plan.",
    "link": "https://www.bbc.com/news/articles/cd7ggg9j1v0o",
    "timestamp": "2025-05-20T18:13:19Z"
  },
  {
    "title": "'That's Incorrect': Kristi Noem Fails Junior High Civics Test on Habeas Corpus During Senate Hearing",
    "description": "Fueling further alarm over the Trump administration's lurch toward authoritarianism, U.S. Homeland Security Secretary Kristi Noem could not accurately describe the principle of habeas corpus when asked a question that may appear on a junior high school studen…",
    "link": "https://www.commondreams.org/news/habeas-corpus-definition",
    "timestamp": "2025-05-20T18:13:07Z"
  },
  {
    "title": "Musk says he will do 'a lot less' political spending in the future",
    "description": "Billionaire Elon Musk, the top donor in the 2024 election who helped boost President Donald Trump's path to victory, says he plans to scale back his political spending.",
    "link": "https://abcnews.go.com/US/musk-asked-2026-midterms-lot-political-spending-future/story?id=121992082",
    "timestamp": "2025-05-20T18:12:36Z"
  },
  {
    "title": "Netflix Just Saved Sesame Street. The GOP Might Kill It Anyway.",
    "description": "A Netflix rescue and a union win was good news for Sesame Street. But the price of survival might be the soul of the show.",
    "link": "https://slate.com/technology/2025/05/sesame-street-signs-netflix-deal-pbs-gop-defund.html",
    "timestamp": "2025-05-20T18:12:15Z"
  },
  {
    "title": "Drunk moms left young kids in car — with big bag of weed in ‘easy reach’ — to hit tequila bar: cops",
    "description": "Two drunk moms left four young kids, including a baby, inside a car with a big bag of weed while they went drinking in a bar, according to cops. The unidentified moms were busted after alarmed onlookers saw a small child running around a parking lot in Glenda…",
    "link": "https://freerepublic.com/focus/f-chat/4318121/posts",
    "timestamp": "2025-05-20T18:12:10Z"
  },
  {
    "title": "New Trump vaccine policy limits access to COVID shots",
    "description": "WASHINGTON (AP) — Annual COVID-19 shots for healthy younger adults and children will no longer be routinely approved under a major new policy shift unveiled",
    "link": "https://ksltv.com/health/new-trump-vaccine-policy-limits-access-to-covid-shots/776850/",
    "timestamp": "2025-05-20T18:11:43Z"
  },
  {
    "title": "Karoline Leavitt Refuses to Answer ‘Controversial’ Question About Trump’s Kids in Bring Your Child to Work Day Press Conference",
    "description": "The White House press briefing room was taken over by youngsters , and at least one question was too \"controversial\" for Karoline Leavitt.\nThe post Karoline Leavitt Refuses to Answer ‘Controversial’ Question About Trump’s Kids in Bring Your Child to Work Day …",
    "link": "https://www.mediaite.com/politics/karoline-leavitt-refuses-to-answer-controversial-question-about-trumps-kids-in-bring-your-child-to-work-day-press-conference/",
    "timestamp": "2025-05-20T18:11:42Z"
  },
  {
    "title": "Rally in European shares continues as Wall Street slides",
    "description": "Iseq index touched record highs on Tuesday, led higher by banks and Ryanair",
    "link": "https://www.irishtimes.com/business/2025/05/20/rally-in-european-shares-continues-as-wall-street-slides/",
    "timestamp": "2025-05-20T18:11:33Z"
  },
  {
    "title": "G-7 Finance Ministers Aim to Avoid Public Spats With US Despite Trade Turmoil",
    "description": "When Germany’s Angela Merkel was photographed at the 2018 Group of Seven meeting, surrounded by others and leaning over a cross-armed Donald Trump, the image was seen as a public display of world leaders pushing back against a disruptive US president.",
    "link": "https://financialpost.com/pmn/business-pmn/g-7-finance-ministers-aim-to-avoid-public-spats-with-us-despite-trade-turmoil",
    "timestamp": "2025-05-20T18:10:32Z"
  },
  {
    "title": "Massie unmoved on Trump's 'big, beautiful bill' after president's personal pitch (Politico)",
    "description": "Politico:\nMassie unmoved on Trump's ‘big, beautiful bill’ after president's personal pitch  —  President Donald Trump called Rep. Thomas Massie a “grandstander” during his visit to the Capitol Tuesday morning to whip support for his “big, beautiful bill,” aft…",
    "link": "https://www.memeorandum.com/250520/p89",
    "timestamp": "2025-05-20T18:10:00Z"
  },
  {
    "title": "Trump officials set new requirements for COVID-19 vaccines in healthy adults, children",
    "description": "NEW YORK, May 20 (Xinhua) -- Annual COVID-19 shots for healthy younger adults and children will no longer be routinely approved under a major new policy shift unveiled Tuesday by the Donald Trump administration. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/21/trump-officials-set-new-requirements-for-covid-19-vaccines-in-healthy-adults-children",
    "timestamp": "2025-05-20T18:09:00Z"
  },
  {
    "title": "Elon Musk Says He's Scaling Back Political Spending: 'I've Done Enough'",
    "description": "The Republican donor spent at least $250 million to get Trump elected last year and had moved on to statewide elections.",
    "link": "https://www.huffpost.com/entry/elon-musk-political-spending-trump_n_682ca0bbe4b01df8005f30fc",
    "timestamp": "2025-05-20T18:07:35Z"
  },
  {
    "title": "Senate Will Try to Block California Vehicle Standards That Would Phase Out Gas-Powered Cars",
    "description": "The U.S. Senate will move this week to block California from enforcing a series of vehicle emissions standards that are tougher than the federal government’s, including first-in-the-nation rules phasing out the sale of new gas-powered cars by 2035. Majority L…",
    "link": "https://www.insurancejournal.com/news/west/2025/05/20/824554.htm",
    "timestamp": "2025-05-20T18:06:47Z"
  },
  {
    "title": "$400 Direct Payments Aren't That Popular: Poll",
    "description": "Less than half of New Yorkers support inflation relief payments that will be sent out later this year, a new poll found.",
    "link": "https://www.newsweek.com/new-york-poll-direct-payments-inflation-relief-2074815",
    "timestamp": "2025-05-20T18:06:39Z"
  },
  {
    "title": "Prosecutors charge congresswoman with pushing and grabbing agents while trying to stop mayor’s arrest",
    "description": "Democratic Rep. LaMonica McIver has denied any wrongdoing and accused federal agents of escalating the situation.",
    "link": "https://www.bostonherald.com/2025/05/20/immigration-protest-justice-department/",
    "timestamp": "2025-05-20T18:04:13Z"
  },
  {
    "title": "Russian arms giant mocks new EU sanctions",
    "description": "The EU is “the champion of meaningless measures,” state-owned Rostec told RIA Novosti Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617926-russia-rostec-eu-sanctions/",
    "timestamp": "2025-05-20T18:03:28Z"
  },
  {
    "title": "Donald Trump Hotel Gets Dragged Into Sean 'Diddy' Combs Trial",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSean \"Diddy\" Combs' former assistant said the rapper and music mogul's favorite hotel in New York City was the Trump International Hotel.\nDavid James, who worked as Combs' assistant from 2007 to 2009, continue…",
    "link": "https://biztoc.com/x/722d384e0ab1468b",
    "timestamp": "2025-05-20T18:03:27Z"
  },
  {
    "title": "Spike Lee says ‘people are hurting’ in jab at Trump’s foreign-made film tariffs",
    "description": "‘I don’t know how much we can talk about American values considering who is the president,’ the director said",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/spike-lee-trump-cannes-hollywood-tariffs-b2754649.html",
    "timestamp": "2025-05-20T18:03:26Z"
  },
  {
    "title": "US not discussing Gazan deportation to Libya, Rubio tells Senate",
    "description": "Washington has asked other countries in the region if they would be open to accepting Gazans who voluntarily opt to leave.",
    "link": "https://www.jpost.com/international/article-854764",
    "timestamp": "2025-05-20T18:03:17Z"
  },
  {
    "title": "A running list of Trump's conflicts of interest",
    "description": "President Donald Trump has been at the center of ethics concerns going all the way back to his 2016 candidacy, largely as a result of his strong business ties that critics say could represent significant conflicts of interest. These conflicts, many of which h…",
    "link": "https://biztoc.com/x/22627784e61796de",
    "timestamp": "2025-05-20T18:03:13Z"
  },
  {
    "title": "Donegal man to be deported from US following driving charge after more than 15 years in Boston",
    "description": "Man (40) with American-born children has been living undocumented after overstaying visa waiver",
    "link": "https://www.irishtimes.com/ireland/2025/05/20/donegal-man-to-be-deported-from-us-following-driving-charge-after-more-than-15-years-in-boston/",
    "timestamp": "2025-05-20T18:02:52Z"
  },
  {
    "title": "Trump, Putin discussed possible prisoner swap involving 9 Americans: report",
    "description": "A phone call between President Donald Trump and Russian President Vladimir Putin included talk of a prisoner swap involving nine Americans and nine Russians, a report said.",
    "link": "https://www.foxnews.com/politics/trump-putin-discussed-possible-prisoner-swap-involving-9-americans-report",
    "timestamp": "2025-05-20T18:02:46Z"
  },
  {
    "title": "Trump urges House Republicans not to mess with Medicaid: Sources",
    "description": "President Donald Trump on Tuesday morning turned up the heat on the more than a dozen House Republican holdout votes endangering passage of the bill.",
    "link": "https://abcnews.go.com/Politics/trump-urges-house-republicans-mess-medicaid-amid-push/story?id=121990592",
    "timestamp": "2025-05-20T18:02:39Z"
  },
  {
    "title": "Does Kristi Noem Even Know What Habeas Corpus Is?",
    "description": "Days after the Trump administration threatened to attempt to suspend habeas corpus in an effort to bulldoze due process protections for its mass deportation campaign, one key Cabinet member seems a bit confused about the scheme. “What is habeas corpus?” Sen. …",
    "link": "https://www.motherjones.com/politics/2025/05/kristi-noem-habeas-corpus/",
    "timestamp": "2025-05-20T18:02:20Z"
  },
  {
    "title": "Gov. Maura Healey says ‘some’ of Trump’s border policies make sense",
    "description": "Gov. Maura Healey has offered a rare nod of approval to President Trump’s immigration policies, saying “some” of the decisions the Republican made this year to restrict access for migrants trying to enter the U.S. at the border make “a lot of sense.”",
    "link": "https://www.bostonherald.com/2025/05/20/gov-maura-healey-says-some-of-trumps-border-policies-make-sense/",
    "timestamp": "2025-05-20T18:01:03Z"
  },
  {
    "title": "Donald Trump Hotel Gets Dragged Into Sean 'Diddy' Combs Trial",
    "description": "Sean \"Diddy\" Combs' former assistant said the rapper and music mogul's \"favorite\" hotel in New York was Trump International Hotel.",
    "link": "https://www.newsweek.com/donald-trump-hotel-gets-dragged-sean-diddy-combs-trial-2074800",
    "timestamp": "2025-05-20T18:00:08Z"
  },
  {
    "title": "Iran Nuclear Talks Are Running Into Red Lines",
    "description": "Once-hopeful negotiations are falling prey to a bitter fight over uranium enrichment.",
    "link": "http://foreignpolicy.com/2025/05/20/iran-nuclear-negotiations-trump-uranium-enrichment-khamenei-talks/",
    "timestamp": "2025-05-20T18:00:04Z"
  },
  {
    "title": "Coinbase CEO's journey from no 'political causes' to hiring DOGE staff",
    "description": "Five years ago, Brian Armstrong wanted employees of his cryptocurrency exchange to refrain from expressing political views at work. Now, the Coinbase CEO seems to be open to involvement with Republican figures, including members of US President Donald Trump’s…",
    "link": "https://cointelegraph.com/news/brian-armstrong-coinbase-political-journey",
    "timestamp": "2025-05-20T18:00:00Z"
  },
  {
    "title": "Elon Musk says he will cut back on political spending after heavily backing Trump in 2024",
    "description": "Elon Musk, the richest person in the world and a key financial supporter of President Donald Trump, says he’ll be spending less on political campaigns",
    "link": "https://abcnews.go.com/Business/wireStory/elon-musk-cut-back-political-spending-after-heavily-121988998",
    "timestamp": "2025-05-20T17:58:18Z"
  },
  {
    "title": "Kristi Noem's 'Habeas Corpus' Response to Senators Raises Eyebrows",
    "description": "The Homeland Security secretary gave an incorrect answer when quizzed by Senator Margaret Hassan.",
    "link": "https://www.newsweek.com/kristi-noem-habeas-corpus-definition-senate-committee-hearing-2074812",
    "timestamp": "2025-05-20T17:58:16Z"
  },
  {
    "title": "A running list of Trump's conflicts of interest",
    "description": "A potential Qatari plane is the latest in a series of problematic connections",
    "link": "https://theweek.com/politics/trumps-conflicts-of-interest",
    "timestamp": "2025-05-20T17:57:47Z"
  },
  {
    "title": "Tapper and Thompson: Biden handlers ‘increasingly deceitful’ as health worsened - NewsBreak",
    "description": "Reporters Alex Thompson and Jake Tapper claimed their book proves the Biden administration worked to “increasingly” shield the public from former President",
    "link": "https://www.newsbreak.com/share/4015848407630-tapper-and-thompson-biden-handlers-increasingly-deceitful-as-health-worsened?s=a99&amp;share_destination_id=MjA2ODYzNzU2LTE3NDc3NTgwOTQwMTU%3D&amp;pd=0DzyiC6x&amp;hl=en_US&amp;send_time=1747758094&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.19.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v3%2Cns_local_strategy_25q1_exp-v12%2Cns_foryou_model_exp_25q2_v2-control%2Cns_foryou_recall_exp_25q2-v2%2Cns_foryou_blend_exp_25q2-v3",
    "timestamp": "2025-05-20T17:56:03Z"
  },
  {
    "title": "New Trump vaccine policy limits access to COVID shots",
    "description": "Federal health officials will no longer routinely approve annual COVID-19 shots for younger adults and children who are healthy",
    "link": "https://www.wsbtv.com/news/new-trump-vaccine/RX24ESE4IFGBXBV2UJBSKNLG2Q/",
    "timestamp": "2025-05-20T17:55:07Z"
  },
  {
    "title": "Korean Boy Band Member Shouts ‘I Love Trump!’ at Los Angeles Concert",
    "description": "The lead singer of the longstanding Korean boy band Super Junior, Leeteuk, has faced a torrent on online backlash in the past week following his shouted declaration of love for President Donald Trump during a concert in California. Leeteuk, whose real name is…",
    "link": "https://freerepublic.com/focus/f-bloggers/4318119/posts",
    "timestamp": "2025-05-20T17:54:17Z"
  },
  {
    "title": "Trump Delivers Marching Orders to House Republicans on Budget Bill",
    "description": "President Donald Trump met with the entire House Republican Conference on Tuesday and delivered a strong message—namely, that the time for negotiations on the budget... Read More\nThe post Trump Delivers Marching Orders to House Republicans on Budget Bill appe…",
    "link": "https://www.dailysignal.com/2025/05/20/trump-delivers-warning-budget-congressional-meeting/",
    "timestamp": "2025-05-20T17:53:56Z"
  },
  {
    "title": "Supercharges NVIDIA AI Factories With Enterprise Data",
    "description": "In This Article:\nWe recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Elastic N.V. (NYSE:ESTC) stands against other AI stocks on Wall Street’s radar. US President Donald Trump is all set to…",
    "link": "https://biztoc.com/x/d92fef58237f2db3",
    "timestamp": "2025-05-20T17:53:07Z"
  },
  {
    "title": "Mizuho Raises Advanced Micro Devices (AMD) Target to $135, Reiterates Outperform",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other AI stocks on Wall Street’s radar.\nUS President Donald Trump is all set to…",
    "link": "https://biztoc.com/x/466291ad1389f457",
    "timestamp": "2025-05-20T17:53:03Z"
  },
  {
    "title": "Susquehanna Reiterates Positive Rating on Alibaba Group (BABA), Keeps $175 Target",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Alibaba Group Holding Limited (NYSE:BABA) stands against other AI stocks on Wall Street’s radar.\nUS President Donald Trump is all set to…",
    "link": "https://biztoc.com/x/4f1b518f0e318853",
    "timestamp": "2025-05-20T17:53:02Z"
  },
  {
    "title": "JMP Reiterates Outperform on Salesforce (CRM), Cites Agentforce Pricing Shift",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Salesforce Inc. (NYSE:CRM) stands against other AI stocks on Wall Street’s radar.\nUS President Donald Trump is all set to revive the cou…",
    "link": "https://biztoc.com/x/8dc5d0ecc01fc448",
    "timestamp": "2025-05-20T17:53:01Z"
  },
  {
    "title": "Cantor Fitzgerald Bullish on Tesla (TSLA), Keeps $425 Price Target",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other AI stocks on Wall Street’s radar.\nUS President Donald Trump is all set to revive the coun…",
    "link": "https://biztoc.com/x/2c7ef28e879dfab4",
    "timestamp": "2025-05-20T17:52:56Z"
  },
  {
    "title": "Bernstein Maintains Hold on Alphabet (GOOGL), Keeps $185 Price Target",
    "description": "In This Article:\nWe recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other AI stocks on Wall Street’s radar. US President Donald Trump is all se…",
    "link": "https://biztoc.com/x/0dc8bb412cea9583",
    "timestamp": "2025-05-20T17:52:56Z"
  },
  {
    "title": "Evercore ISI Reiterates Outperform on Apple (AAPL), Targets $250",
    "description": "We recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks on Wall Street’s radar.\nUS President Donald Trump is all set to revive the count…",
    "link": "https://biztoc.com/x/41b7e1da150f64b1",
    "timestamp": "2025-05-20T17:52:48Z"
  },
  {
    "title": "Trump State Chief Rubio’s Hearing Explodes Into All-Out Brawl Over Margaritas",
    "description": "Trump Secretary of State Marco Rubio sparked fury and a heated verbal brawl at a Senate hearing when he referenced a staged photo of Sen. Chris Van Hollen (D-MD) and wrongly-deported migrant Kilmar Abrego Garcia. Van Hollen came under attack from President Do…",
    "link": "https://www.mediaite.com/news/trump-state-chief-rubios-hearing-explodes-into-all-out-brawl-over-margaritas/",
    "timestamp": "2025-05-20T17:52:47Z"
  },
  {
    "title": "Trump State Chief Rubio’s Hearing Explodes Into All-Out Brawl Over Margaritas",
    "description": "Trump Secretary of State Marco Rubio sparked fury and a heated verbal brawl at a Senate hearing when he referenced a staged photo of Sen. Chris Van Hollen (D-MD) and wrongly-deported migrant Kilmar Abrego Garcia. Van Hollen came under attack from President Do…",
    "link": "https://www.mediaite.com/media/news/trump-state-chief-rubios-hearing-explodes-into-all-out-brawl-over-margaritas/",
    "timestamp": "2025-05-20T17:52:47Z"
  },
  {
    "title": "Apple Under-Owned, Meta Platforms (META) Over-Owned—Morgan Stanley Stays Bullish on Both",
    "description": "In This Article:\nWe recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other AI stocks on Wall Street’s radar.\nUS President Donald Trump is …",
    "link": "https://biztoc.com/x/c72eeb614cbafe97",
    "timestamp": "2025-05-20T17:52:46Z"
  },
  {
    "title": "Raymond James Reiterates Strong Buy on NVIDIA (NVDA), Targets $150",
    "description": "In This Article:\nWe recently published a list of 11 AI Stocks On Wall Street’s Radar. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other AI stocks on Wall Street’s radar.\nUS President Donald Trump is al…",
    "link": "https://biztoc.com/x/e49bc490613138de",
    "timestamp": "2025-05-20T17:52:41Z"
  }
]