[
  {
    "title": "Qataris search for bodies of Americans killed by Islamic State in Syria ahead of Trump visit",
    "description": "While the sources did tell Reuters whose remains the Qataris were searching for, it is believed that the bodies of two journalists and one aid worker are being recovered.",
    "link": "https://www.jpost.com/middle-east/article-853398",
    "timestamp": "2025-05-10T05:24:31Z"
  },
  {
    "title": "Mexico sues Google for changing 'Gulf of Mexico' to 'Gulf of America' after Trump's order",
    "description": "Mexico has sued Google after it changed the label for the Gulf of Mexico to the Gulf of America on its maps platform to match U.S. President Donald Trump's executive order.",
    "link": "https://www.foxnews.com/politics/mexico-sues-google-changing-gulf-mexico-gulf-america-after-trumps-order",
    "timestamp": "2025-05-10T05:18:40Z"
  },
  {
    "title": "Hegseth Warns Migrants Crossing into Pentagon's Border Zone: 'You Will Be Charged'",
    "description": "Secretary of Defense Pete Hegseth issued a warning to illegal aliens thinking of crossing into the United States through land controlled by the U.S. military, telling them they \"will be charged.\"\nThe post Hegseth Warns Migrants Crossing into Pentagon’s Border…",
    "link": "https://www.breitbart.com/immigration/2025/05/09/hegseth-warns-migrants-crossing-pentagon-border-zone-charged/",
    "timestamp": "2025-05-10T05:13:29Z"
  },
  {
    "title": "US, Chinese officials to meet in Geneva to discuss tariffs, as the world looks for signs of hope",
    "description": "Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer will meet in Geneva with a Chinese delegation led by Vice Premier He Lifeng",
    "link": "https://www.thehindubusinessline.com/news/world/us-chinese-officials-to-meet-in-geneva-to-discuss-tariffs-as-the-world-looks-for-signs-of-hope/article69560067.ece",
    "timestamp": "2025-05-10T05:08:05Z"
  },
  {
    "title": "India, Pakistan move closer to full war",
    "description": "ISLAMABAD &mdash; Pakistan's army said it struck several Indian military sites early Saturday in retaliation for missile strikes on airbases, a significant escalation that moves the two nuclear-armed neighbours closer to all-out war.",
    "link": "https://www.bangkokpost.com/world/3022257/india-and-pakistan-move-closer-to-full-war-after-bases-targeted",
    "timestamp": "2025-05-10T05:08:00Z"
  },
  {
    "title": "Irish-founded Tullow Oil faces $1.4bn refinancing headache amid falling crude prices",
    "description": "Shares in the exploration firm have slumped and are being sold off at rates not seen in five years",
    "link": "https://www.irishtimes.com/business/2025/05/10/tullow-oil-gas-falling-prices/",
    "timestamp": "2025-05-10T05:00:01Z"
  },
  {
    "title": "Never mind the new pope, who’s going to replace Liveline’s spiritual leader, Joe Duffy?",
    "description": "Michael McDowell coy at book launch, Bertie gives state-of-the-world address and Mark Daly feels the heat",
    "link": "https://www.irishtimes.com/politics/2025/05/10/miriam-lords-week-never-mind-the-new-pope-whos-going-to-replace-livelines-spiritual-leader-joe-duffy/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "What does the latest round of EU retaliatory tariffs mean for Ireland?",
    "description": "Getting caught in US-EU trade dispute would ‘definitely curtail our expansion plans’ says Irish seafood firm",
    "link": "https://www.irishtimes.com/politics/2025/05/10/what-does-the-latest-round-of-eu-retaliatory-tariffs-mean-for-ireland/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "‘Be prepared’: Home Depot worker issues warning about new changes to the car industry",
    "description": "Earlier this year, President Donald Trump announced a sweeping array of tariffs on every country on Earth. While many of these tariffs have since been halted, there is still a baseline 10% tariff on every country, with goods from China receiving a significant…",
    "link": "https://www.dailydot.com/news/home-depot-worker-car-industry/",
    "timestamp": "2025-05-10T05:00:00Z"
  },
  {
    "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
    "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade",
    "link": "https://abcnews.go.com/Business/wireStory/dolls-30-toys-become-latest-symbol-trumps-trade-121646128",
    "timestamp": "2025-05-10T04:54:23Z"
  },
  {
    "title": "Two dolls instead of 30? Toys become the latest symbol of Trump's trade war",
    "description": "Toy dolls have become the latest rhetorical poster child for President Donald Trump's tariffs crusade",
    "link": "https://abcnews.go.com/US/wireStory/dolls-30-toys-become-latest-symbol-trumps-trade-121646126",
    "timestamp": "2025-05-10T04:54:22Z"
  },
  {
    "title": "How US-China tariffs reached sky-high levels in 3 months",
    "description": "Talks planned this weekend between U.S. and Chinese officials in Switzerland are a culmination of more than three months of dizzying rounds of retaliatory tariffs between the two countries that have crippled each other’s exporters and dragged on their economi…",
    "link": "https://www.seattlepi.com/news/world/article/how-us-china-tariffs-reached-sky-high-levels-in-3-20320396.php",
    "timestamp": "2025-05-10T04:53:25Z"
  },
  {
    "title": "Trade deal platform for going further - Mandelson",
    "description": "The UK ambassador to the US spoke to BBC Newsnight in his first broadcast interview since appointment.",
    "link": "https://www.bbc.com/news/articles/cn5yzw24v9ro",
    "timestamp": "2025-05-10T04:49:17Z"
  },
  {
    "title": "Mayor of Newark, New Jersey, released after arrest at immigration detention center",
    "description": "The mayor of Newark, New Jersey, has been released from custody after being arrested at a federal immigration detention center where he has been protesting its opening this week",
    "link": "https://abcnews.go.com/US/wireStory/mayor-newark-new-jersey-released-after-arrest-immigration-121663382",
    "timestamp": "2025-05-10T04:46:29Z"
  },
  {
    "title": "US and Chinese officials meet in Geneva to discuss tariffs",
    "description": "The U.S. Treasury Secretary and America’s top trade negotiator will meet with high-ranking Chinese officials in Switzerland this weekend to de-escalate a dispute that threatens to cut off trade between the world’s two biggest economies and damage the g...",
    "link": "https://abcnews.go.com/International/wireStory/us-chinese-officials-meet-geneva-discuss-tariffs-world-121663197",
    "timestamp": "2025-05-10T04:43:19Z"
  },
  {
    "title": "Lea Michele explains why internet theory about her reading skills is so ‘frustrating’",
    "description": "The actor’s ability to read and write has been a source of internet humour since 2017",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/lea-michele-interview-cant-read-internet-theory-b2748384.html",
    "timestamp": "2025-05-10T04:41:55Z"
  },
  {
    "title": "Trump involved in discussions over suspending habeas corpus, sources say (CNN)",
    "description": "CNN:\nTrump involved in discussions over suspending habeas corpus, sources say  —  President Donald Trump has been personally involved in discussions inside the administration over potentially suspending habeas corpus, a legal procedure that allows people to c…",
    "link": "https://www.memeorandum.com/250510/p2",
    "timestamp": "2025-05-10T04:40:01Z"
  },
  {
    "title": "De minimis changes: 'I freaked out and spent $400 online'",
    "description": "'I freaked out and spent $400 online – it felt like a last hurrah'\nEarlier this year, Deborah Grushkin, an enthusiastic online shopper from New Jersey, \"freaked out\".\nUS President Donald Trump had signed an order to stop allowing packages from China worth les…",
    "link": "https://biztoc.com/x/0090198c1871b2bf",
    "timestamp": "2025-05-10T04:38:31Z"
  },
  {
    "title": "US-China trade talk optimism drives oil prices to weekly gains",
    "description": "Oil prices surged nearly 2% on Friday, marking their first weekly gain since mid-April, fueled by optimism surrounding a U.S.-UK trade agreement and upcoming U.S.-China talks. Brent crude settled at $63.91 a barrel, while WTI reached $61.02, both benchmarks u…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/us-china-trade-talk-optimism-drives-oil-prices-to-weekly-gains/articleshow/121048611.cms",
    "timestamp": "2025-05-10T04:36:45Z"
  },
  {
    "title": "US dollar makes weekly gains on renewed trade deal optimism",
    "description": "The dollar is poised for a weekly gain against major currencies amid optimism surrounding potential U.S.-China trade talks, fueled by a recent U.S.-UK trade agreement. While the Federal Reserve held rates steady, the Bank of England cut them. Bitcoin's resurg…",
    "link": "https://economictimes.indiatimes.com/markets/forex/us-dollar-makes-weekly-gains-on-renewed-trade-deal-optimism/articleshow/121048496.cms",
    "timestamp": "2025-05-10T04:32:46Z"
  },
  {
    "title": "China's consumption slide deepens as tariff war bites",
    "description": "BEIJING: China said on Saturday (May 10) that consumer prices slumped in April for the third straight month, reflecting persistent challenges as leaders attempt to revive an economy stymied by sluggish spending and a fierce trade war with Washington. The worl…",
    "link": "https://www.channelnewsasia.com/east-asia/chinas-consumption-slide-deepens-tariff-war-bites-5121326",
    "timestamp": "2025-05-10T04:30:57Z"
  },
  {
    "title": "Gold edges higher on softer dollar ahead of key US-China trade talks",
    "description": "Gold prices surged over 1% on Friday, buoyed by a weaker dollar and market anticipation surrounding U.S.-China trade talks. Spot gold reached $3,340.29 an ounce, marking a 3.1% weekly gain and a 27% rise year-to-date. Trump's tariff comments and geopolitical …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-edges-higher-on-softer-dollar-ahead-of-key-us-china-trade-talks/articleshow/121048418.cms",
    "timestamp": "2025-05-10T04:29:19Z"
  },
  {
    "title": "Europe leaders head to Kiev on unprecedented visit",
    "description": "The leaders of France, Britain, Germany and Poland will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky, vowing to ratchet up pressure on Russia until it agrees a ceasefire.",
    "link": "https://www.hurriyetdailynews.com/europe-leaders-head-to-kiev-on-unprecedented-visit-209014",
    "timestamp": "2025-05-10T04:29:00Z"
  },
  {
    "title": "'I freaked out and spent $400 online – it felt like a last hurrah'",
    "description": "'I freaked out and spent $400 online – it felt like a last hurrah'\nEarlier this year, Deborah Grushkin, an enthusiastic online shopper from New Jersey, \"freaked out\".\nUS President Donald Trump had signed an order to stop allowing packages from China worth les…",
    "link": "https://biztoc.com/x/1f7d933dd6524d56",
    "timestamp": "2025-05-10T04:26:59Z"
  },
  {
    "title": "Europe's Stoxx up marginally, Germany's DAX hits record high on hopes of easing trade tensions",
    "description": "European stock markets saw gains. Germany's DAX reached a record high. Investors felt relieved by signs of a possible ease in the global trade war. U.S. and China are expected to discuss trade. BP shares increased following takeover speculation. Energy and re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-up-marginally-germanys-dax-hits-record-high-on-hopes-of-easing-trade-tensions/articleshow/121048322.cms",
    "timestamp": "2025-05-10T04:26:32Z"
  },
  {
    "title": "Europe's Stoxx jumps 600 points, Germany's DAX hits record high on hopes of easing trade tensions",
    "description": "European stock markets saw gains. Germany's DAX reached a record high. Investors felt relieved by signs of a possible ease in the global trade war. U.S. and China are expected to discuss trade. BP shares increased following takeover speculation. Energy and re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-jumps-600-points-germanys-dax-hits-record-high-on-hopes-of-easing-trade-tensions/articleshow/121048322.cms",
    "timestamp": "2025-05-10T04:26:32Z"
  },
  {
    "title": "Live updates: Pakistan and India agree to ceasefire; Trump makes the surprise announcement",
    "description": "US President Donald Trump made a surprise announcement that Pakistan and India have agreed to a ceasefire after their conflict escalated further overnight. Top Pakistani and Indian officials have confirmed the halt in fighting. Follow for live updates.",
    "link": "https://www.cnn.com/world/live-news/india-pakistan-operation-sindoor-05-10-25",
    "timestamp": "2025-05-10T04:26:23Z"
  },
  {
    "title": "New US envoy to Türkiye says he is 'eager' to 'building bridges'",
    "description": "New U.S. Ambassador to Türkiye Tom Barrack said Friday that he is “eager to get to work building bridges” with the Turkish people.",
    "link": "https://www.hurriyetdailynews.com/new-us-envoy-to-turkiye-says-he-is-eager-to-building-bridges-209013",
    "timestamp": "2025-05-10T04:25:01Z"
  },
  {
    "title": "Global stocks, Bitcoin rally on renewed trade deal hopes",
    "description": "Global stocks showed strength, nearing six-week highs. This followed a US-UK trade agreement, boosting hopes for tariff talks. India offered tariff cuts to the US, seeking exemptions. Germany's Dax hit a record high. The US-UK deal is seen as a positive sign …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-bitcoin-rally-on-renewed-trade-deal-hopes/articleshow/121048110.cms",
    "timestamp": "2025-05-10T04:19:16Z"
  },
  {
    "title": "When Politics Leaves Reality Behind",
    "description": "Sacramento (Special to Informed Comment; Feature) - The traditional left–right political spectrum no longer captures the forces driving division in America today. That model works when we’re dealing with competing ideologies and when ideological disagreement …",
    "link": "https://www.juancole.com/2025/05/politics-leaves-reality.html",
    "timestamp": "2025-05-10T04:15:18Z"
  },
  {
    "title": "Paschal Donohoe on How Feminist Economics Can Change Our World; Making Sense of Chaos; and Why We’re Getting Poorer",
    "description": "These authors seek to understand the behaviour of economies and the influence they have on our societies",
    "link": "https://www.irishtimes.com/culture/books/review/2025/05/10/books-in-brief-paschal-donohoe-on-how-feminist-economics-can-change-our-world-making-sense-of-chaos-and-why-were-getting-poorer/",
    "timestamp": "2025-05-10T04:15:00Z"
  },
  {
    "title": "US Stocks end flat as investors await US-China trade talks",
    "description": "Wall Street saw a quiet end to the week as investors awaited U.S.-China trade discussions. Donald Trump suggested tariff adjustments before the meeting in Switzerland. The Dow, S&P 500, and Nasdaq experienced slight weekly declines. Energy sector showed gains…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-flat-as-investors-await-us-china-trade-talks/articleshow/121047974.cms",
    "timestamp": "2025-05-10T04:14:08Z"
  },
  {
    "title": "South Korean conservative party moves to switch presidential candidates as election turmoil deepens",
    "description": "People Power Party’s original presidential candidate Kim Moon Soo has denounced the move as an “overnight political coup”.",
    "link": "https://www.channelnewsasia.com/east-asia/south-korean-conservative-party-moves-switch-presidential-candidates-election-turmoil-deepens-5121261",
    "timestamp": "2025-05-10T04:14:00Z"
  },
  {
    "title": "Wall Street Week Ahead: US market leadership faces test as economic data takes centre stage",
    "description": "Investors are keenly awaiting economic data this week. They are observing if the US stock market's leadership shifts from defensive sectors. This shift could signal a higher risk appetite. Upcoming data includes the Consumer Price Index and retail sales figur…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-market-leadership-faces-test-as-economic-data-takes-centre-stage/articleshow/121047922.cms",
    "timestamp": "2025-05-10T04:11:49Z"
  },
  {
    "title": "Europe leaders head to Kyiv on unprecedented visit",
    "description": "The leaders of France, Britain, Germany and Poland  will make an unprecedented joint visit to Ukraine on Saturday for talks with President Volodymyr Zelensky...",
    "link": "https://www.yahoo.com/news/europe-leaders-head-kyiv-unprecedented-215018020.html",
    "timestamp": "2025-05-10T04:08:37Z"
  },
  {
    "title": "France, Germany blocking Türkiye’s EU bid for domestic politics: Fidan",
    "description": "Foreign Minister Hakan Fidan said Friday that Türkiye’s bid for EU membership is being blocked by France and Germany for domestic political reasons.",
    "link": "https://www.hurriyetdailynews.com/france-germany-blocking-turkiyes-eu-bid-for-domestic-politics-fidan-209011",
    "timestamp": "2025-05-10T04:07:38Z"
  },
  {
    "title": "Families of Hamas-held hostages tell of growing concern for their fate",
    "description": "One family said the hostages were at risk \"every day\" they continued to be held captive.",
    "link": "https://www.bbc.com/news/articles/c8d1pngdjzmo",
    "timestamp": "2025-05-10T04:07:35Z"
  },
  {
    "title": "China in distress: Protests, economic signals reveal pressure from U.S. tariffs",
    "description": "In the \"socialist market economy\" of China, some cracks are visible that show a country unprepared to stand up to Trump tariffs long-term. China has been increasingly opaque in markets and manufacturing information. As Beijing and Washington meet this weekend…",
    "link": "https://freerepublic.com/focus/f-news/4316088/posts",
    "timestamp": "2025-05-10T04:06:39Z"
  },
  {
    "title": "'I freaked out and spent $400 online – it felt like a last hurrah'",
    "description": "How consumers are reacting to shipping changes that mean low-value packages entering the US no longer avoid tariffs.",
    "link": "https://www.bbc.com/news/articles/c4g2j45d5zeo",
    "timestamp": "2025-05-10T04:01:38Z"
  },
  {
    "title": "The Real Evil Empire May Surprise You",
    "description": "Forty years ago this month, I was commissioned a second lieutenant in the U.S. Air Force. I would be part of America’s all-volunteer force (AVF) for 20 years, hitting my marks and retiring as a lieutenant colonel in 2005. In my two decades of service, I met a…",
    "link": "https://www.lewrockwell.com/2025/05/no_author/the-real-evil-empire-may-surprise-you/",
    "timestamp": "2025-05-10T04:01:00Z"
  },
  {
    "title": "Will Trump Follow Nixon’s IRS Road to Ruin?",
    "description": "On Friday morning, President Trump proclaimed on his Truth Social: “We are going to be taking away Harvard’s Tax Exempt Status. It’s what they deserve!” Trump is being hailed as a hero for demanding that the IRS bring Harvard University to its knees. But Trum…",
    "link": "https://www.lewrockwell.com/2025/05/james-bovard/will-trump-follow-nixons-irs-road-to-ruin/",
    "timestamp": "2025-05-10T04:01:00Z"
  },
  {
    "title": "No escaping Alcatraz as Trump offers up another shiny distraction",
    "description": "The president’s suggestion to reopen the island prison-turned-museum just serves to move attention away from the issues that matter",
    "link": "https://www.irishtimes.com/world/us/2025/05/10/trump-alcatraz-reopen/",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Lessons from life with the black bears in New Mexico's mountains",
    "description": "It's probably true that most human beings today spend much of their lives in search of stability and security.\r\n\r\nThat likely goes double for those living in war-torn countries or those without adequate food supplies, personal safety, or democrat...",
    "link": "https://www.americanthinker.com/blog/2025/05/lessons_from_life_with_the_black_bears_in_new_mexico_s_mountains.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Leftists are right that it’s not a coincidence that the DOJ is looking into Letitia James",
    "description": "News broke yesterday that the DOJ had officially opened a criminal investigation into Letitia James’s more recent real estate transactions. Leftists immediately countered with the accusation that this investigation was no coincidence, and is no...",
    "link": "https://www.americanthinker.com/blog/2025/05/leftists_are_right_that_it_s_not_a_coincidence_that_the_doj_is_looking_into_letitia_james.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "After papal election, Liz Cheney demonstrates how Trump continues to live rent-free inside her head",
    "description": "With Pope Leo XIV's election in the Vatican, politicians and world leaders of all kinds moved to deliver their congratulations, extending their best wishes.\r\n\r\nBut then there's Liz Cheney, still dreaming of Donald Trump over anything else, ev...",
    "link": "https://www.americanthinker.com/blog/2025/05/after_papal_election_liz_cheney_demonstrates_how_trump_continues_to_live_rent_free_inside_her_head.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Maybe Donald will visit Letitia’s trial",
    "description": "About a year ago, AG Leticia James was in the courtroom watching President Trump on trial.  My guess is that she was enjoying the show and imagining what her TV ads for governor were going to be like.  “Vote for me because no one, not...",
    "link": "https://www.americanthinker.com/blog/2025/05/maybe_donald_will_visit_leticia_s_trial.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Trump Just Fired the Librarian of Congress, Here's Why Black People Should Care",
    "description": "In just over 100 days, we’ve seen President Donald Trump work overtime to erase every ounce of cultural and racial diversity from our government institutions, including threatening to end funding to the National Museum of African American History. His latest …",
    "link": "https://www.theroot.com/trump-just-fired-the-librarian-of-congress-heres-why-b-1851780094",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "A Canada-China embrace?",
    "description": "Now-former Canadian Prime Minister Justin Trudeau famously complimented China’s government.\r\n\r\nNewly installed Canadian Prime Minister Mark Carney is a globalist who has frequently criticized his American counterpart, President Donald Trump.\r\n\r...",
    "link": "https://www.americanthinker.com/blog/2025/05/canada_and_china_to_reconcile.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Celebrating Victory, Celebrating Defeat",
    "description": "President Donald Trump issued a proclamation celebrating Victory in Europe Day (VE Day), marking the 80th anniversary of the unconditional surrender of Nazi Germany on May 8, 1945. He stated “we celebrate the unmatched might, strength, and powe...",
    "link": "https://www.americanthinker.com/articles/2025/05/celebrating_victory_celebrating_defeat.html",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "Trump’s latest bluster about reopening Alcatraz offers up another shiny distraction",
    "description": "The president’s suggestion to reopen the island prison-turned-museum just serves to move attention away from the issues that matter",
    "link": "https://www.irishtimes.com/world/us/2025/05/10/trumps-latest-bluster-about-reopening-alcatraz-offers-up-another-shiny-distraction/",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "The Folly of Realism: How the West Deceived Itself about Russia and Betrayed Ukraine by Alexander Vindman – An unsparing critique of US ‘crisis management’ policy",
    "description": "The writer’s theme is one of lost opportunities that could have prevented today’s war",
    "link": "https://www.irishtimes.com/culture/books/review/2025/05/10/the-folly-of-realism-how-the-west-deceived-itself-about-russia-and-betrayed-ukraine-by-alexander-vindman-an-unsparing-critique-of-us-crisis-management-policy/",
    "timestamp": "2025-05-10T04:00:00Z"
  },
  {
    "title": "The US and China are finally talking. Why now?",
    "description": "The US and China are finally talking. Why now?\nThe US-China trade war could be letting up, with the world's two largest economies set to begin talks in Switzerland.\nTop trade officials from both sides will meet on Saturday in the first high-level meeting sinc…",
    "link": "https://biztoc.com/x/474f2c2fffc27d0e",
    "timestamp": "2025-05-10T03:53:32Z"
  },
  {
    "title": "US Top Diplomat Marco Rubio Calls Pakistan Army Chief, Urges De-escalation",
    "description": "Marco Rubio also offered US assistance in starting &quot;constructive&quot; talks between the two countries to &quot;avoid future conflicts.",
    "link": "https://www.ndtv.com/world-news/us-top-diplomat-marco-rubio-calls-pakistan-army-chief-urges-de-escalation-8377248",
    "timestamp": "2025-05-10T03:53:09Z"
  },
  {
    "title": "News Summary Intelligence Report 5/9/2025*Newsdump Friday*European Leaders Visit Kiev*MTG Declines Senate Run*Pakistan-India Trade Attacks*Trump Talks Lower China Tariffs*World Leaders At Russia's Victory Day***",
    "description": "House Ways and Means Committee partially revealing tax legislation... leaders of at least four nations headed into Ukraine...Kremlin appreciation for President Trump's efforts to settle the war... South African officials criticizing the US plan to take in whi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4316084/posts",
    "timestamp": "2025-05-10T03:47:18Z"
  },
  {
    "title": "GOP Megadonor Ken Griffin Warns Trump Tariffs Are 'Terrifying,' Says Government Is Picking 'Winners And Losers' Amid Soaring Trade Deficit",
    "description": "Citadel founder Ken Griffin is sounding the alarm on President Donald Trump‘s tariff policies, warning they have “unleashed an era of crony capitalism” where the government picks “winners and losers” in the economy.\nWhat Happened: “Tariffs open the doors to c…",
    "link": "https://biztoc.com/x/e049fbe58652ae4e",
    "timestamp": "2025-05-10T03:42:19Z"
  },
  {
    "title": "America Humbled",
    "description": "America Humbled\n \nAuthored by Arthur Schaper via American Greatness,\nThe United States, the American people, Donald Trump, and even myself: we have all been humbled over the last four years—or the last sixteen years … or even thirty years.\nAnd we needed it.\nM…",
    "link": "https://biztoc.com/x/50996203b8c6d4ce",
    "timestamp": "2025-05-10T03:42:19Z"
  },
  {
    "title": "As US and China begin trade talks in Geneva, Trump's tariff hammer looks less mighty than he claims",
    "description": "The way President Donald Trump sees it, beating China in a trade war should be easy",
    "link": "https://biztoc.com/x/8d290c71a1133f8a",
    "timestamp": "2025-05-10T03:42:17Z"
  },
  {
    "title": "As US and China begin trade talks in Geneva, Trump's tariff hammer looks less mighty than he claims",
    "description": "The way President Donald Trump sees it, beating China in a trade war should be easy",
    "link": "https://biztoc.com/x/8d290c71a1133f8a",
    "timestamp": "2025-05-10T03:42:17Z"
  },
  {
    "title": "Trump hints at cutting China tariffs to 80%",
    "description": "US News: President Donald Trump suggested on Friday that he was open to sharply reducing the tariffs that the United States had imposed on China, as American a.",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-hints-at-cutting-china-tariffs-to-80/articleshow/121047378.cms",
    "timestamp": "2025-05-10T03:42:00Z"
  },
  {
    "title": "Newark Mayor Ras Baraka Reacts After Arrest at ICE Facility: 'Humiliating'",
    "description": "Baraka said after being released from custody Friday night that he \"didn't do anything wrong.\"",
    "link": "https://www.newsweek.com/newark-ras-baraka-ice-detention-new-jersey-2070497",
    "timestamp": "2025-05-10T03:41:12Z"
  },
  {
    "title": "Reporting from behind shifting front lines in Myanmar’s civil war",
    "description": "Journalists with the Shan State-based news outlet Shwe Phee Myay continue to report amid civil war and repression.",
    "link": "https://www.aljazeera.com/news/2025/5/10/reporting-from-behind-shifting-front-lines-in-myanmars-civil-war",
    "timestamp": "2025-05-10T03:38:43Z"
  },
  {
    "title": "Judge pauses much of Trump administration's massive downsizing of federal agencies",
    "description": "A California judge has ordered the Trump administration to halt much of its massive downsizing of the federal workforce",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-pauses-trump-administrations-massive-downsizing-federal-agencies-121660970",
    "timestamp": "2025-05-10T03:26:28Z"
  },
  {
    "title": "As US and China begin trade talks in Geneva, Trump's tariff hammer looks less mighty than he claims",
    "description": "The way President Donald Trump sees it, beating China in a trade war should be easy",
    "link": "https://abcnews.go.com/Business/wireStory/us-china-begin-trade-talks-geneva-trumps-tariff-121632913",
    "timestamp": "2025-05-10T03:26:18Z"
  },
  {
    "title": "Trump offers illegal migrants an ‘exit bonus’ — and ‘free flight out of our country’ — via self-deport executive order",
    "description": "“As long as it's not here, you can go anywhere you want,” President Trump declared.",
    "link": "https://nypost.com/2025/05/09/us-news/trump-offers-illegal-migrants-exit-bonus-free-flight-out-of-us-via-self-deport-executive-order/",
    "timestamp": "2025-05-10T03:24:21Z"
  },
  {
    "title": "Trump keeps insisting on lower rates. But his own policies are making that tough for the Fed",
    "description": "President Donald Trump has repeatedly said he'll deliver lower interest rates and lower prices.\n- But the economic jitters caused by his tariff policies are working against both aims.\n- Businesses and shoppers are souring on their economic outlooks, and the F…",
    "link": "https://biztoc.com/x/15e7881de64f1707",
    "timestamp": "2025-05-10T03:20:29Z"
  },
  {
    "title": "Trump’s first trade pact offers faint glimpse of art of the deal",
    "description": "For global leaders puzzling over how to negotiate with Donald Trump, the U.S. president’s inaugural pact with the U.K. offers a few clues on how much ground he’s prepared to give.",
    "link": "https://biztoc.com/x/0222b2b552832f5a",
    "timestamp": "2025-05-10T03:20:06Z"
  },
  {
    "title": "Magic spells, innuendo and riddles: Your guide to all 37 Eurovision songs",
    "description": "With just a week to go, here's our guide to the songs and artists taking part in Eurovision 2025.",
    "link": "https://www.bbc.com/news/articles/c9vg8k4zxk9o",
    "timestamp": "2025-05-10T03:15:58Z"
  },
  {
    "title": "Unsealed files in NYC mayor’s criminal case shed light on corruption investigation",
    "description": "Federal agents investigating New York City Mayor Eric Adams were still seizing phones days before the Justice Department  ordered prosecutors to drop the case.",
    "link": "https://www.nbcnews.com/news/us-news/unsealed-files-nyc-mayors-criminal-case-shed-light-investigation-rcna205998",
    "timestamp": "2025-05-10T03:14:29Z"
  },
  {
    "title": "Trump’s first trade pact offers faint glimpse of art of the deal",
    "description": "For global leaders puzzling over how to negotiate with Donald Trump, the U.S. president’s inaugural pact with the U.K. offers a few clues on how much ground he’s prepared to give.",
    "link": "https://www.japantimes.co.jp/business/2025/05/10/economy/trump-trade-uk-focus/",
    "timestamp": "2025-05-10T03:06:00Z"
  },
  {
    "title": "‘Look What He’s Done With the Economy!’ Hannity Praises Trump on Economy Despite the Fact It Shrank Last Quarter",
    "description": "A contracting economy and underwater poll numbers on the matter were no obstacles for Sean Hannity, who heaped praise on President Donald Trump's handling of the issue.\nThe post ‘Look What He’s Done With the Economy!’ Hannity Praises Trump on Economy Despite …",
    "link": "https://www.mediaite.com/tv/look-what-hes-done-with-the-economy-hannity-praises-trump-on-economy-despite-the-fact-it-shrank-last-quarter/",
    "timestamp": "2025-05-10T03:03:47Z"
  },
  {
    "title": "\"To All Illegal Aliens\": Trump Launches Paid Self-Deportation Program",
    "description": "Donald Trump lashed out at immigrants, blaming &quot;a full-scale invasion&quot; of those who stay in the US illegally for crime and violence.",
    "link": "https://www.ndtv.com/world-news/to-all-illegal-aliens-trump-launches-paid-self-deportation-program-8376954",
    "timestamp": "2025-05-10T02:55:17Z"
  },
  {
    "title": "Trump launches paid self-deportation program to end 'invasion'",
    "description": "President Donald Trump signed an executive order Friday to create a federally funded self-deportation program with paid flights and an \"exit bonus\" for those who seek to \"voluntarily and permanently\" leave the US. In a statement posted to the White House's we…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-launches-paid-self-deportation-program-to-end-invasion/articleshow/121046656.cms",
    "timestamp": "2025-05-10T02:47:15Z"
  },
  {
    "title": "Judge Pauses Much Of Trump Administration's Massive Downsizing Of Federal Agencies",
    "description": "A California judge has ordered the Trump administration to halt much of its massive downsizing of the federal workforce.",
    "link": "https://www.huffpost.com/entry/us-trump-mass-firings_n_681eba5ae4b0108bb6b70283",
    "timestamp": "2025-05-10T02:46:26Z"
  },
  {
    "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
    "description": "A San Francisco judge issued the emergency order in a lawsuit filed by labor unions and cities.",
    "link": "https://www.bostonherald.com/2025/05/09/trump-mass-firings-pause/",
    "timestamp": "2025-05-10T02:43:09Z"
  },
  {
    "title": "Trump Media reports Q1 net sales up 6.6% YoY to $821.2K, a net loss of $31.7M, vs. a $327.6M net loss in Q1 2024, and $759M in cash and investments (Todd Spangler/Variety)",
    "description": "Todd Spangler / Variety:\nTrump Media reports Q1 net sales up 6.6% YoY to $821.2K, a net loss of $31.7M, vs. a $327.6M net loss in Q1 2024, and $759M in cash and investments  —  Trump Media & Technology Group, the company majority-owned by President Donald Tru…",
    "link": "https://mediagazer.com/250509/p19",
    "timestamp": "2025-05-10T02:40:00Z"
  },
  {
    "title": "Ex-Biden Official Rips Into Former President for Recent Interviews",
    "description": "Anthony Coley said Biden's interviews are \"not helpful\" for the Democratic Party after its election loss.",
    "link": "https://www.newsweek.com/ex-biden-official-rips-former-president-recent-interviews-2070500",
    "timestamp": "2025-05-10T02:38:21Z"
  },
  {
    "title": "Thune: ‘I Don’t Want to See Taxes Go Up’",
    "description": "Senate Majority Leader John Thune (R-SD) said Friday on CNBC’s “Squawk Box” that he did not want to see taxes go up on anybody when asked about President Donald Trump’s comments on taxes. On Truth Social Trump posted, “The problem with even a “TINY” tax incre…",
    "link": "https://freerepublic.com/focus/f-news/4316076/posts",
    "timestamp": "2025-05-10T02:25:39Z"
  },
  {
    "title": "House Tax Panel Releases Partial Version of Trump BIll",
    "description": "The House Ways and Means Committee on Friday night released a partial version of President Donald Trump’s tax proposal that calls for increasing the maximum child tax credit to $2,500 and raising the estate tax exemption to $15 million.",
    "link": "https://financialpost.com/pmn/business-pmn/house-tax-panel-releases-partial-version-of-trump-bill",
    "timestamp": "2025-05-10T02:24:46Z"
  },
  {
    "title": "Bitcoin yet to hit $150K because outsiders are ghosting — Michael Saylor",
    "description": "Strategy founder Michael Saylor says Bitcoin hasn’t reached $150,000 yet because holders without a long-term outlook have been selling off while a new cohort of investors are beginning to enter the market.“I think we’re going through a rotation right now,” Sa…",
    "link": "https://cointelegraph.com/news/strategy-michael-saylor-bitcoin-price-lagging-rotation-new-investors",
    "timestamp": "2025-05-10T02:18:57Z"
  },
  {
    "title": "Indiana Jones in Glasgow: The US films you never knew were shot in UK",
    "description": "Hollywood blockbusters such and World War Z and Spider-Man, were made closer to home than you think.",
    "link": "https://www.bbc.com/news/articles/c2e3dvjkdmxo",
    "timestamp": "2025-05-10T02:18:44Z"
  },
  {
    "title": "LNG imports may create hub status",
    "description": "The government's plan to import more liquefied natural gas (LNG) from the US could not only ease the trade imbalance between the two countries, but also lead to a new business opportunity.",
    "link": "https://www.bangkokpost.com/business/general/3022182/lng-imports-may-create-hub-status",
    "timestamp": "2025-05-10T02:17:00Z"
  },
  {
    "title": "Lady Gaga at Coachella? This meme says it may be a recession indicator",
    "description": "A new Lady Gaga album, knee-high Converse and Snooki at the club. According to social media, signs of a recession are everywhere.",
    "link": "https://www.abc.net.au/news/2025-05-10/recession-indicator-meme-explained-as-us-tariff-discontent-grows/105214384",
    "timestamp": "2025-05-10T02:13:09Z"
  },
  {
    "title": "Fans wonder about Trump effect as cheap seats available for Leafs playoff games in Florida",
    "description": "Anyone in Florida looking for tickets to Friday night’s pivotal game three showdown between the Toronto Maple Leafs and the Panthers could find something almost unthinkable on this side of the border: (relatively) cheap seats.",
    "link": "https://www.cbc.ca/news/canada/toronto/leafs-panthers-game-3-nhl-playoffs-1.7531530",
    "timestamp": "2025-05-10T02:12:39Z"
  },
  {
    "title": "European leaders head to Kyiv to show support after Putin's parade",
    "description": "The leaders of Britain, France, Germany and Poland headed to Kyiv on Saturday for talks with Ukrainian President Volodymyr Zelenskiy in a show of unity a day after Russia's Vladimir Putin hosted his allies in a Victory Day parade on Red Square. The summit wil…",
    "link": "https://freerepublic.com/focus/f-news/4316073/posts",
    "timestamp": "2025-05-10T02:06:07Z"
  },
  {
    "title": "The Apprentice: Carney plays nice during first White House visit",
    "description": "It was another surreal moment in the bizarre relationship between President Donald Trump and new Canadian Prime Minister Mark Carney, staunch political opponents who nonetheless seem to have a genuine affection for each other — at least when face to face.Carn…",
    "link": "https://www.theblaze.com/the-apprentice-carney-plays-nice-during-first-white-house-visit",
    "timestamp": "2025-05-10T02:00:00Z"
  },
  {
    "title": "Donald Trump to announce US recognizes Palestinian state, Gulf diplomatic source claims - The Jerusalem Post",
    "description": "Donald Trump to announce US recognizes Palestinian state, Gulf diplomatic source claimsThe Jerusalem Post Opinion | This Israeli Government Is Not Our AllyThe New York Times Trump Heads Back to Where He StartedThe Atlantic President Trump's Saudi Arabia trip …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177416293",
    "timestamp": "2025-05-10T01:52:40Z"
  },
  {
    "title": "New FEMA head says he will \"run right over\" staff who resist his changes",
    "description": "SummaryNew FEMA head says all decisions must now go through himRichardson says he will 'run right over' anyone who resists changes to the agencyRichardson says will look at increasing costs borne by states hit by disasters as FEMA narrows missionWASHINGTON, M…",
    "link": "https://freerepublic.com/focus/f-news/4316070/posts",
    "timestamp": "2025-05-10T01:41:26Z"
  },
  {
    "title": "Ethereum price greenlit for further upside after surprise 29% ETH rally",
    "description": "Key takeaways:<ul><li>ETH price rallied by 22% on May 8, but demand for spot ETH ETFs and derivatives remains muted. \r\n</li><li>President Trump’s reversal on certain altcoins aligns with ETH’s renewed outlook. \r\n</li></ul>Ether (ETH) posted an impressive 29% …",
    "link": "https://cointelegraph.com/news/ethereum-price-greenlit-for-further-upside-after-surprise-29-eth-rally",
    "timestamp": "2025-05-10T01:40:56Z"
  },
  {
    "title": "Trump firma orden ejecutiva para programa de auto deportaciones",
    "description": "Donald Trump firmó una Orden Ejecutiva para lanzar el primer programa de auto deportación.\"TODOS LOS INMIGRANTES ILEGALES: ¡RESERVEN SU VUELO GRATIS AHORA MISMO!\", señaló a través de una publicación en su cuenta de X.Today, I signed an Executive Order to laun…",
    "link": "https://www.milenio.com/internacional/trump-firma-orden-ejecutiva-programa-auto-deportaciones",
    "timestamp": "2025-05-10T01:33:48Z"
  },
  {
    "title": "Government agency quietly advances controversial plan that could endanger millions of lives: 'This will increase health risks' - NewsBreak",
    "description": "\"It also allows the market for toxic chemicals to continue.\" Government agency quietly advances controversial plan that could endanger millions of lives:",
    "link": "https://www.newsbreak.com/share/3998599736135-government-agency-quietly-advances-controversial-plan-that-could-endanger-millions-of-lives-this-will-increase-health-risks?s=a2&share_destination_id=MjE4OTk3MDExLTE3NDY4NDA2MDA0NzI%3D&pd=0Eot7rKF&hl=en_US&send_time=1746840600&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.18.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-v4%2Cns_local_strategy_25q1_exp-v4%2Cns_foryou_model_exp_25q2_v2-control%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v9",
    "timestamp": "2025-05-10T01:30:31Z"
  },
  {
    "title": "John Downing: War commemorations lay bare vital role of EU, and our place within it",
    "description": "Big anniversaries are often hard to pin down. Take this week’s 80th VE Day anniversary, marking the end of our most murderous war and a most evil regime.",
    "link": "https://www.independent.ie/opinion/comment/john-downing-war-commemorations-lay-bare-vital-role-of-eu-and-our-place-within-it/a696563031.html",
    "timestamp": "2025-05-10T01:30:00Z"
  },
  {
    "title": "Improvement to Irish film tax break delayed due to Donald Trump tariff threat",
    "description": "The Government postponed the announcement of an improvement to Ireland’s film tax incentive this week, following US president Donald Trump’s threat to put a 100pc tariff on movies produced outside America.",
    "link": "https://www.independent.ie/business/improvement-to-irish-film-tax-break-delayed-due-to-donald-trump-tariff-threat/a508134335.html",
    "timestamp": "2025-05-10T01:30:00Z"
  },
  {
    "title": "The Irish Independent’s view: Eighty years on from World War II, a worrying new order is emerging",
    "description": "Ireland may have evaded the very worst of Donald Trump’s tariffs so far, but anyone with a sense of history will feel a tinge of sadness that 80 years after World War II and the transatlantic alliances, barriers are going up instead of coming down.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-eighty-years-on-from-world-war-ii-a-worrying-new-order-is-emerging/a9242417.html",
    "timestamp": "2025-05-10T01:30:00Z"
  },
  {
    "title": "Letters: American Pope is a sign power is shifting from the centre of the periphery",
    "description": "When Cardinal Robert Prevost was elected Pope Leo XIV, I received texts from two friends – one in Canada, one in Ireland – both joking that Donald Trump would no doubt claim credit. The irony, of course, is that they may not be entirely wrong.",
    "link": "https://www.independent.ie/opinion/letters/letters-american-pope-is-a-sign-power-is-shifting-from-the-centre-of-the-periphery/a963637347.html",
    "timestamp": "2025-05-10T01:30:00Z"
  },
  {
    "title": "Judge Allows CIA To Fire Official Who Played Role In Biden’s Military COVID-19 Vaccine Mandate",
    "description": "A federal district judge is allowing the CIA to fire the agency’s director of the Center for Global Health Services Dr. Terry Adirim. Adirim filed a lawsuit against the CIA on May 2 after she was fired by the agency and accused it of denying her due process a…",
    "link": "https://dailycaller.com/2025/05/09/judge-cia-firing-terry-adirim-covid/",
    "timestamp": "2025-05-10T01:25:50Z"
  }
]