[
  {
    "title": "UK to boost defence spending to Cold War levels amid Russian 'menace'",
    "description": "British Prime Minister Sir Keir Starmer says the spending boost, worth $26 billion, was designed to counter Russian aggression, amid uncertainty in Europe about the US' commitment to their defence.",
    "link": "https://www.abc.net.au/news/2025-02-26/uk-to-boost-military-spending/104982430",
    "timestamp": "2025-02-25T14:32:52Z"
  },
  {
    "title": "Stock market today: Stocks waver, bitcoin tumbles below $90,000 for first time since November",
    "description": "Tech stocks are poised for more losses as uncertainty over tariffs and risks to Nvidia take hold.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-stocks-waver-bitcoin-tumbles-below-90000-for-first-time-since-november-143122111.html",
    "timestamp": "2025-02-25T14:31:22Z"
  },
  {
    "title": "Fintech’s Gender Gap: Why Progress Isn’t Moving Fast Enough",
    "description": "The fintech industry, like traditional finance, remains stubbornly male-dominated—despite hard data showing companies with more women leaders are more profitable.",
    "link": "https://observer.com/2025/02/fintechs-gender-gap-why-progress-isnt-moving-fast-enough/",
    "timestamp": "2025-02-25T14:30:46Z"
  },
  {
    "title": "Crypto Bloodbath In 2025? CEO Says Most Altcoins Will Vanish",
    "description": "The crypto sector is undergoing a fundamental transition that may revolutionize investment methods by 2025. Related Reading: Bitcoin ETF Frenzy: Research Finds Most Investors Aren’t Sticking Around “It’s a selective altseason—most altcoins will not make it,” …",
    "link": "https://bitcoinist.com/crypto-bloodbath-in-2025-ceo-says-most-altcoins-will-vanish/",
    "timestamp": "2025-02-25T14:30:15Z"
  },
  {
    "title": "Bahrain F1 testing 2025: Lewis Hamilton’s Ferrari debut and rookie watch — What to expect as teams prepare for the new season",
    "description": "The 2025 Formula 1 winter testing in Bahrain begins with rookies making their debuts and Lewis Hamilton driving a Ferrari for the first time. Teams will fine-tune their cars ahead of the season opener in Melbourne, while fans analyse early performance indicat…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bahrain-f1-testing-2025-lewis-hamiltons-ferrari-debut-and-rookie-watch-what-to-expect-as-teams-prepare-for-the-new-season/articleshow/118561534.cms",
    "timestamp": "2025-02-25T14:30:10Z"
  },
  {
    "title": "How China’s ‘Ne Zha 2’ Beat ‘Inside Out 2’ to Become the Highest-Grossing Animated Film in History",
    "description": "This year’s biggest blockbuster (so far) isn’t from Marvel, Pixar or James Cameron. In fact, most Americans aren’t even familiar with the box office juggernaut — because it’s barely playing in North America. “Ne Zha 2,” a Chinese animated movie, has become an…",
    "link": "https://variety.com/2025/film/box-office/ne-zha-2-biggest-animated-movie-box-office-china-1236318940/",
    "timestamp": "2025-02-25T14:30:00Z"
  },
  {
    "title": "This Refinery Wants to Make Sustainable Aviation Fuel Mainstream. Trump’s Cuts Could Kill It",
    "description": "A sprawling Minnesota refinery wants to make low-carbon aviation fuel mainstream—but without government support experts believe the project could be \"dead in the water.\"",
    "link": "https://www.wired.com/story/refinery-saf-sustainable-fuel-rollout-problem/",
    "timestamp": "2025-02-25T14:30:00Z"
  },
  {
    "title": "Oil Prices Under Pressure Despite Fresh Sanctions on Iran",
    "description": "Oil prices were under pressure early on Tuesday morning despite the Trump administration announcing fresh sanctions on Iran's oil industry on Monday.- President Trump’s recent push for a deal between Russia and Ukraine, his foot-dragging over Canadian and Mex…",
    "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Under-Pressure-Despite-Fresh-Sanctions-on-Iran.html",
    "timestamp": "2025-02-25T14:30:00Z"
  },
  {
    "title": "Trump Accidentally Insults Himself: ‘Who Would Ever Sign A Thing Like This?’",
    "description": "The president recently rebuked a 2020 trade deal known as the U.S.-Mexico-Canada Agreement even though he signed it.",
    "link": "https://www.huffpost.com/entry/trump-usmca-nafta-tariffs-canada-mexico_n_67bda523e4b0f4e8df29f534",
    "timestamp": "2025-02-25T14:29:55Z"
  },
  {
    "title": "Donald Trump Accidentally Insults Himself: ‘Who Would Ever Sign A Thing Like This?’",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_24067e6e-2dc1-413b-9791-28954ff9743c",
    "timestamp": "2025-02-25T14:29:55Z"
  },
  {
    "title": "Google has mislabeled Canada's provincial parks as 'state' parks for years",
    "description": "Canadians have taken to social media wondering why Google Maps was referring to some provincial parks as \"state\" parks, an incorrect designation that has ruffled feathers at a time of heightened tension between Canada and the United States.",
    "link": "https://www.nationalobserver.com/2025/02/25/news/google-mislabeled-canada-provincial-parks-state",
    "timestamp": "2025-02-25T14:28:57Z"
  },
  {
    "title": "What minerals does Ukraine have – and why does Donald Trump want them?",
    "description": "Donald Trump is ramping up pressure on his Ukrainian counterpart to sign away up to 50% of its mineral supplies.",
    "link": "https://news.sky.com/story/what-minerals-does-ukraine-have-and-why-does-donald-trump-want-them-13316629",
    "timestamp": "2025-02-25T14:26:00Z"
  },
  {
    "title": "Gaza ceasefire: As clock ticks down, Israel prepares for more war",
    "description": "The Gaza ceasefire looks increasingly like it may end up being a fleeting interlude.",
    "link": "https://www.cnn.com/2025/02/25/middleeast/israel-hamas-gaza-ceasefire-intl/index.html",
    "timestamp": "2025-02-25T14:26:00Z"
  },
  {
    "title": "Republicans Are Starting a War Over Medicaid Cuts",
    "description": "Republicans are starting a war over Medicaid cuts in the GOP budget plan. Trump and Mike Johnson may talk about reducing waste, fraud, and abuse in the essential health care program for poor folks, but people know cuts when they see them.",
    "link": "http://nymag.com/intelligencer/article/republicans-medicaid-cuts-budget.html",
    "timestamp": "2025-02-25T14:25:43Z"
  },
  {
    "title": "'Really concerning': Massive bruise spotted on Trump's right hand, sparks frenzied speculation online",
    "description": "US President Donald Trump and French President Emmanuel Macron met in the Oval Office on Monday, drawing the public's attention to their awkward greeting. What caught netizens' attention was a massive and mysterious bruise on Trump's right hand which sparked …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-macron-meeting-really-concerning-massive-bruise-spotted-on-donald-trumps-right-hand-sparks-health-fears/articleshow/118561304.cms",
    "timestamp": "2025-02-25T14:25:06Z"
  },
  {
    "title": "SCOOP: FCC to brief lawmakers on George Soros investigation in closed-door meeting",
    "description": "The House of Representatives' Republican Study Committee is hosting FCC Chair Brendan Carr at its weekly lunch, Fox News Digital has learned.",
    "link": "https://www.foxnews.com/politics/scoop-fcc-brief-lawmakers-george-soros-investigation-closed-door-meeting",
    "timestamp": "2025-02-25T14:24:23Z"
  },
  {
    "title": "The Trump Presidency Is an Unmitigated Catastrophe for Ukraine",
    "description": "Kyiv is by far the best-defended Ukrainian city. The cafes are open and bustling, the supermarkets full, and cultural life is, if anything, more active than it was before Russia’s full-scale invasion of Ukraine on February 24, 2002, so much so that a signific…",
    "link": "https://newrepublic.com/article/191870/trump-presidency-catastrophe-ukraine",
    "timestamp": "2025-02-25T14:23:12Z"
  },
  {
    "title": "POLITICO: Trump allies circulate mass deportation plan calling for ‘processing camps’ and a private citizen ‘army’",
    "description": "A group of prominent military contractors, including former Blackwater CEO Erik Prince, has pitched the Trump White House on a proposal to carry out mass deportations through a network of “processing camps” on military bases, a private fleet of 100 planes, an…",
    "link": "https://freerepublic.com/focus/f-chat/4300325/posts",
    "timestamp": "2025-02-25T14:23:09Z"
  },
  {
    "title": "Elon Musk’s DOGE email to federal workers sparks backlash even as Donald Trump applauds it",
    "description": "US President Donald Trump defended Elon Musk’s recent actions, portraying them as an attempt to expose fraud and inefficiency in government operations. He praised an email sent to federal employees, calling it a strategic move. Meanwhile, a federal worker cri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-doge-email-to-federal-workers-sparks-backlash-even-as-donald-trump-applauds-it/articleshow/118561346.cms",
    "timestamp": "2025-02-25T14:23:00Z"
  },
  {
    "title": "Arizona plane collision raises questions about air traffic control towers. Here’s what to know",
    "description": "Of the 5,100 public airports across the United States, only about 10% have control towers staffed by people who direct the flow of traffic. \n\nTens of thousands of planes take off, land, and perform touch-and-goes at the Marana Regional Airport in southern Ari…",
    "link": "https://www.fastcompany.com/91284443/arizona-plane-collision-raises-questions-about-air-traffic-control-towers-heres-what-know",
    "timestamp": "2025-02-25T14:20:41Z"
  },
  {
    "title": "Trump: Ukraine's Zelenskiy May Visit Washington for Minerals Deal",
    "description": "President Donald Trump says the US is very close to reaching a deal with Ukraine over its natural resources. “Looks like we are getting close to a deal where we get our money back over time,” President Trump said during a meeting with French President Emmanue…",
    "link": "https://biztoc.com/x/2bf9258c6d249c21",
    "timestamp": "2025-02-25T14:17:11Z"
  },
  {
    "title": "complete list of Trump’s actions in his fifth week in office",
    "description": "President Donald Trump speaks during the signing of executive orders at his Mar-a-Lago resort in Palm Beach, Fla., on Feb. 18, 2025.",
    "link": "https://biztoc.com/x/af7f4deb739c40ab",
    "timestamp": "2025-02-25T14:16:49Z"
  },
  {
    "title": "Medicaid Cuts Threaten A Key House Vote On Trump’s Agenda Today—Here’s Why The GOP Is Divided",
    "description": "Trump has endorsed the House budget, but has also vowed that his administration would leave Medicaid intact.",
    "link": "https://www.forbes.com/sites/saradorn/2025/02/25/medicaid-cuts-threaten-a-key-house-vote-on-trumps-agenda-today-heres-why-the-gop-is-divided/",
    "timestamp": "2025-02-25T14:16:23Z"
  },
  {
    "title": "EXCLUSIVE… Enrique Tarrio Interview: The Only Evidence DOJ Had Against Proud Boys Was a Document They Knew Was Written by the FBI! – They Sentenced Them to 20 Years Anyway!",
    "description": "In an exclusive interview, former Proud Boys leader Enrique Tarrio reveals shocking allegations of FBI manipulation in the January 6 narrative—claiming the agency authored key evidence against him. This compelling testimony raises critical questions about gov…",
    "link": "https://www.thegatewaypundit.com/2025/02/exclusive-enrique-tarrio-interview-only-evidence-doj-had/",
    "timestamp": "2025-02-25T14:15:59Z"
  },
  {
    "title": "\"Slavery produced a genuine affection between the races\": Hegseth's church foretold \"DEI\" firings - NewsBreak",
    "description": "Donald Trump's administration is barely bothering to pretend that the firings at the Department of Defense are about anything but bigotry. On Friday, Trump",
    "link": "https://www.newsbreak.com/share/3828494519031-slavery-produced-a-genuine-affection-between-the-races-hegseth-s-church-foretold-dei-firings?_f=app_share&amp;pd=0DUd10BK&amp;lang=en_US&amp;send_time=1740492749&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v8&amp;s=i2",
    "timestamp": "2025-02-25T14:13:58Z"
  },
  {
    "title": "Trapped in Gaza: Residents speak out as Egypt blocks exit, rejects Trump’s relocation plan",
    "description": "Gazans trapped by closed borders voice frustration, with some supporting Trump’s relocation plan as Egypt blocks exits and Hamas clings to control amid devastation.",
    "link": "https://www.foxnews.com/world/trapped-gaza-residents-speak-out-egypt-blocks-exit-rejects-trumps-relocation-plan",
    "timestamp": "2025-02-25T14:12:13Z"
  },
  {
    "title": "Ash Sarkar: ‘Left-wingers on Twitter aren’t sane, I include myself in that’",
    "description": "Ash Sarkar discusses her new book Minority Rule, a wide-ranging polemic which analyses the function of ‘the culture war’ and why conservatives are winning it",
    "link": "https://www.dazeddigital.com/life-culture/article/66200/1/ash-sarkar-interview-minority-rule-book-review?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=ash-sarkar-left-wingers-on-twitter-aren-t-sane-i-include-myself-in-that",
    "timestamp": "2025-02-25T14:10:00Z"
  },
  {
    "title": "Savannah Chrisley Says Her Conservative Beliefs Have Cost Her",
    "description": "Savannah Chrisley Says Her Conservative Beliefs Have Cost Herlittlethings.com",
    "link": "https://littlethings.com/entertainment/savannah-chrisley-lost-deals-vocal-trump-supporter",
    "timestamp": "2025-02-25T14:08:14Z"
  },
  {
    "title": "Manitoba's craft brewers hazy and a little bitter over U.S. tariff threats and potential impacts",
    "description": "The U.S. tariff threat on aluminum is brewing up concerns for some Manitoba craft beer makers, who say a small increase in can prices could make a big impact on already-slim profit margins.",
    "link": "https://www.cbc.ca/news/canada/manitoba/craft-brewers-manitoba-aluminum-tariffs-1.7466794",
    "timestamp": "2025-02-25T14:07:43Z"
  },
  {
    "title": "British PM Starmer pledges 2.5% GDP defence spending from 2027",
    "description": "\"This government will begin the biggest sustained increase in defence spending since the end of the Cold War,\" Starmer told parliament on Tuesday.",
    "link": "https://www.euractiv.com/section/politics/news/british-pm-starmer-pledges-2-5-gdp-defence-spending-from-2027/",
    "timestamp": "2025-02-25T14:07:17Z"
  },
  {
    "title": "British PM Starmer pledges 2.5% GDP defence spending by 2027",
    "description": "\"This government will begin the biggest sustained increase in defence spending since the end of the Cold War,\" Starmer told parliament on Tuesday.",
    "link": "https://www.euractiv.com/section/politics/news/british-pm-starmer-pledges-2-5-gdp-defence-spending-by-2027/",
    "timestamp": "2025-02-25T14:07:17Z"
  },
  {
    "title": "You can still claim up to $2,000 per kid from the child tax credit, but that amount may drop after 2025—here's what to know",
    "description": "Many parents with children under age 17 can claim the child tax credit worth up to $2,000 per child for tax year 2024. But that could change after 2025, affecting returns filed in 2027.\nThat's because the 2017 Tax Cuts and Jobs Act enacted by President Donald…",
    "link": "https://biztoc.com/x/c49a00760d5e0793",
    "timestamp": "2025-02-25T14:05:59Z"
  },
  {
    "title": "FACT CHECK: Has Elon Musk Mandated Drug Testing For Federal Employees?",
    "description": "A viral post shared on Threads claims Tesla CEO and Department of Government Efficiency (DOGE) lead Elon Musk has purportedly mandated drug testing for federal employees.   View on Threads   Verdict: False The claim is not referenced on Musk’s verified X acco…",
    "link": "https://checkyourfact.com/2025/02/25/fact-check-musk-drug-testing-federal-employees/",
    "timestamp": "2025-02-25T14:04:58Z"
  },
  {
    "title": "Elon Musk Issues Ominous Warning After DOGE Productivity Email Pulled Back, Gives Employees ‘Another Chance’ to Answer",
    "description": "Elon Musk has conceded that federal employees who failed to reply to his cross-agency productivity audit email issued Saturday were given “another chance” at President Donald Trump’s “discretion” — but warned that next time, ignoring the email would result in…",
    "link": "https://www.mediaite.com/news/elon-musk-issues-ominous-warning-after-doge-productivity-email-pulled-back-gives-employees-another-chance-to-answer/",
    "timestamp": "2025-02-25T14:04:38Z"
  },
  {
    "title": "Landmark moment as the return of Trump stuns UK into action on defence",
    "description": "This is the moment the government finally woke up to the enormity of the threat faced by the UK and the inability of its hollowed-out armed forces to cope.",
    "link": "https://news.sky.com/story/landmark-moment-as-the-return-of-trump-stuns-uk-into-action-on-defence-13316819",
    "timestamp": "2025-02-25T14:03:00Z"
  },
  {
    "title": "Provinces have roughly $100B at hand for tariff relief, Desjardins estimates",
    "description": "OTTAWA — Canada’s provincial governments have enough fiscal firepower to respond to looming U.S. tariffs without supersizing their debt burdens, a new report says. The analysis released Tuesday from Desjardins Economics predicted upcoming provincial budgets w…",
    "link": "https://financialpost.com/pmn/provinces-have-roughly-100b-at-hand-for-tariff-relief-desjardins-estimates",
    "timestamp": "2025-02-25T14:00:52Z"
  },
  {
    "title": "Provinces have roughly $100B available for tariff relief",
    "description": "Before the threat of tariffs, most provinces expected their fiscal situations to improve in 2025 amid forecasts for renewed economic growth",
    "link": "https://financialpost.com/news/economy/provinces-have-100b-for-tariff-relief",
    "timestamp": "2025-02-25T14:00:52Z"
  },
  {
    "title": "Exclusive: Center for Peace Communications Launches Interview Series of Gazans Wishing to Emigrate, Supporting Trump’s Regional Plan",
    "description": "President Donald Trump's plan to rebuild Gaza by resettling its citizens has significant support among many Gazans and is the “only solution” for struggling civilians, according to the Center for Peace Communications, which is fighting for Gazans to be given …",
    "link": "https://www.breitbart.com/politics/2025/02/25/exclusive-center-peace-communications-launches-interview-series-gazans-wishing-emigrate/",
    "timestamp": "2025-02-25T14:00:38Z"
  },
  {
    "title": "Trump Order Revives Fears of Real Estate Push for San Francisco’s Presidio",
    "description": "President Donald Trump’s order renews concerns over a real estate push in San Francisco’s Presidio, but legal protections may block development, much like past failed bayfront plans.",
    "link": "https://www.kqed.org/news/12028300/trump-order-revives-fears-real-estate-push-san-franciscos-presidio",
    "timestamp": "2025-02-25T14:00:33Z"
  },
  {
    "title": "Shuttered NYC migrant shelter highlights Trump’s successful immigration clampdown: NY lawmaker",
    "description": "President Donald Trump's quick action to secure the border has helped alleviate the migrant crisis in places like New York City, one Republican State lawmaker argues.",
    "link": "https://www.foxnews.com/politics/shuttered-nyc-migrant-shelter-highlights-trumps-successful-immigration-clampdown-ny-lawmaker",
    "timestamp": "2025-02-25T14:00:32Z"
  },
  {
    "title": "Apple Will Invest $500 Billion, Add 20K Jobs Amid Tariffs on China",
    "description": "Apple will work with Foxconn Technology Group to build \"the servers that power the cloud component of Apple Intelligence — a system called Private Cloud Compute — in Houston.\"\nThe post Apple Will Invest $500 Billion, Add 20K Jobs Amid Tariffs on China first a…",
    "link": "https://legalinsurrection.com/2025/02/apple-will-invest-500-billion-add-20k-jobs-amid-tariffs-on-china/",
    "timestamp": "2025-02-25T14:00:29Z"
  },
  {
    "title": "As Facebook abandons fact-checking, it’s also offering bonuses for viral content",
    "description": "Hours after Donald Trump was sworn in as president, users spread a false claim on Facebook that Immigration and Customs Enforcement was paying a bounty for reports of undocumented people. “BREAKING — ICE is allegedly offering $750 per illegal immigrant that y…",
    "link": "https://www.niemanlab.org/2025/02/as-facebook-abandons-fact-checking-its-also-offering-bonuses-for-viral-content/",
    "timestamp": "2025-02-25T14:00:18Z"
  },
  {
    "title": "EXCLUSIVE: Enrique Tarrio Nails Joe Biden’s DOJ to the Cross – Here Is the Video Clip That Will Take The Democrats Down! (VIDEO)",
    "description": "Enrique Tarrio's explosive allegations against the Biden DOJ reveal a troubling narrative surrounding January 6, 2021. His refusal to comply with demands could have profound implications for the Democrats and mainstream media.\nThe post EXCLUSIVE: Enrique Tarr…",
    "link": "https://www.thegatewaypundit.com/2025/02/exclusive-enrique-tarrio-nails-joe-bidens-doj-cross/",
    "timestamp": "2025-02-25T14:00:09Z"
  },
  {
    "title": "You can still claim up to $2,000 per kid from the child tax credit, but that amount may drop after 2025—here's what to know",
    "description": "If Congress doesn't address the soon-expiring expanded child tax credit, parents could see a higher tax bill in the coming years.",
    "link": "https://www.cnbc.com/2025/02/25/how-much-child-tax-credit-is-worth-2024-taxes.html",
    "timestamp": "2025-02-25T14:00:01Z"
  },
  {
    "title": "Study: Hollywood’s Male Role Models Are Failing Young Men. Where Does That Go in the Trump Era?",
    "description": "A 2024 report finds young males (13-30) crave vulnerable male characters. But experts wonder if a cultural shift could lead Hollywood in another direction\nThe post Study: Hollywood’s Male Role Models Are Failing Young Men. Where Does That Go in the Trump Era?…",
    "link": "https://www.thewrap.com/hollywood-male-role-models-study/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "K-12 DEI Program Faces Federal Scrutiny Amid Trump Crackdown",
    "description": "THE CENTER SQUARE—A parental rights education group has filed a federal complaint against a California school for allegedly offering training sessions to some teachers and... Read More\nThe post K-12 DEI Program Faces Federal Scrutiny Amid Trump Crackdown appe…",
    "link": "https://www.dailysignal.com/2025/02/25/k-12-dei-program-faces-federal-scrutiny-amid-trump-crackdown/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "Bernie Sanders on Battling a Government ‘Of, By, and For’ the Billionaires",
    "description": "An exclusive interview with Bernie Sanders as he launched his ‘Fighting Oligarchy’ tour, countering billionaire power and Trump tax cuts in Omaha.",
    "link": "http://www.rollingstone.com/politics/politics-features/bernie-sanders-elon-musk-donald-trump-oligarchy-government-billionaires-1235278831/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "What we know about posts calling for 'economic blackout' on Feb. 28",
    "description": "Historian Heather Cox Richardson was not involved with this grassroots effort.",
    "link": "https://www.snopes.com//news/2025/02/25/economic-blackout-february-25/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "Iran will not yield to US 'pressure and sanctions' on nuclear dispute",
    "description": "\"Iran's position regarding nuclear talks is clear and we will not negotiate under pressure and sanctions,\" Araghchi said.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-843708",
    "timestamp": "2025-02-25T13:59:35Z"
  },
  {
    "title": "Trump Revokes Biden Memo Threatening to Withhold Arms from Israel",
    "description": "President Donald Trump has reportedly revoked a policy under President Joe Biden to threaten arms sales to Israel if the country does not satisfy critics of its human rights record while battling Palestinian Hamas terrorists in Gaza.\nThe post Trump Revokes Bi…",
    "link": "https://www.breitbart.com/politics/2025/02/25/trump-revokes-biden-memo-threatening-to-withhold-arms-from-israel/",
    "timestamp": "2025-02-25T13:58:43Z"
  },
  {
    "title": "Cryptogate: Trump’s Snub of Zelensky Greatly Complicates Argentina’s President Milei’s Already Precarious Situation.",
    "description": "Amid the political upheaval caused by the cryptocurrency scandal, Argentinian President Javier Milei remained silent on the criticism leveled at Volodymyr Zelensky by Donald Trump despite always supporting the Ukrainian president. With this, the self-describe…",
    "link": "https://www.globalresearch.ca/trump-snub-zelensky-complicates-milei-situation/5880848",
    "timestamp": "2025-02-25T13:58:18Z"
  },
  {
    "title": "US Health Secretary Delays Rule Updating Definition of Healthy on Food Labels",
    "description": "The Food and Drug Administration announced in late 2024 that it was updating the definition of healthy on food labels.",
    "link": "https://www.theepochtimes.com/health/us-health-secretary-delays-rule-updating-definition-of-healthy-on-food-labels-5815877",
    "timestamp": "2025-02-25T13:56:58Z"
  },
  {
    "title": "Putin offers Russian and Ukrainian rare minerals to US",
    "description": "Russian President Vladimir Putin said he is open to offering the US access to rare minerals, including from Russian-occupied Ukraine. This comes after US President Donald Trump has repeatedly pushed for Ukraine to give up some of its minerals in exchange for …",
    "link": "https://freerepublic.com/focus/f-chat/4300320/posts",
    "timestamp": "2025-02-25T13:56:50Z"
  },
  {
    "title": "LGBT Americans reach record number, more likely to be Dems, Gen Z: Gallup poll",
    "description": "The overall number of Americans identifying as non-heterosexual soared to a record high according to a 2024 Gallup poll published last week.",
    "link": "https://www.foxnews.com/politics/lgbt-americans-reach-record-number-more-likely-dems-gen-z-gallup-poll",
    "timestamp": "2025-02-25T13:56:38Z"
  },
  {
    "title": "Lurid sex chats among NSA agents exposed as intel chief Tulsi Gabbard vows to punish workers posting about 'kinks, fetishes and polyamory'",
    "description": "Director of National Intelligence Tulsi Gabbard was irate and promised to root out National Security Administration agents who held lurid sex chats in sensitive government chat rooms in the name of DEI. The revelations of chats about 'polyamory and castration…",
    "link": "https://freerepublic.com/focus/f-news/4300319/posts",
    "timestamp": "2025-02-25T13:55:51Z"
  },
  {
    "title": "Russia-Ukraine war: How the US position has changed on UN resolutions",
    "description": "The US vote against Ukraine and Europe's UN resolution reflects larger policy changes of the Trump administration.",
    "link": "https://www.aljazeera.com/news/2025/2/25/russia-ukraine-war-how-the-us-position-has-changed-on-un-resolutions",
    "timestamp": "2025-02-25T13:55:41Z"
  },
  {
    "title": "Dow Jones Futures: Trump Tariffs 'Going Forward;' Hims Stock Crashes On Earnings",
    "description": "The Dow Jones Industrial Average and other major stock futures tentatively ventured into positive ground Tuesday as Wall Street digested President Donald Trump's announcement that the tariffs on Canada and Mexico will go into effect early March. Among stocks,…",
    "link": "https://biztoc.com/x/81b2b33ea25afe44",
    "timestamp": "2025-02-25T13:55:29Z"
  },
  {
    "title": "UK's Starmer boosts defence spending on eve of Washington trip",
    "description": "LONDON: Prime Minister Keir Starmer said on Tuesday (Feb 25) he would increase defence spending to 2.5 per cent of GDP every year by 2027, rising to 3 per cent after 2029, a clear signal to US President Donald Trump that Britain will step up its efforts to bo…",
    "link": "https://www.channelnewsasia.com/world/uk-starmer-defence-spending-washington-trip-trump-4959216",
    "timestamp": "2025-02-25T13:54:29Z"
  },
  {
    "title": "UK's Starmer boosts defence spending on eve of Washington trip",
    "description": "LONDON (Reuters) - Prime Minister Keir Starmer said on Tuesday he would increase defence spending to 2.5% of GDP every year by 2027, rising to 3% after 2029, a clear signal to U.S. President Donald Trump that Britain will step up its efforts to boost Europe's…",
    "link": "https://www.thestar.com.my/news/world/2025/02/25/uk039s-starmer-boosts-defence-spending-on-eve-of-washington-trip",
    "timestamp": "2025-02-25T13:54:00Z"
  },
  {
    "title": "The radical shift in US policy that shut Ukraine out amid talks to end war",
    "description": "The first month of President Donald Trump's second term has already delivered a radical American pivot on Russia's offensive war against Ukraine.",
    "link": "https://abcnews.go.com/International/radical-shift-us-policy-shut-ukraine-amid-talks/story?id=119094200",
    "timestamp": "2025-02-25T13:53:56Z"
  },
  {
    "title": "Trump’s Pick To Run White House Faith Office Sparks Theological Turf War",
    "description": "A religious row has erupted among conservative Christians over President Donald Trump’s decision to re-appoint Paula White-Cain to run the White House Faith Office, with theological fissures erupting within Trump’s Christian coalition as leaders stake out dif…",
    "link": "https://freerepublic.com/focus/f-religion/4300316/posts",
    "timestamp": "2025-02-25T13:51:33Z"
  },
  {
    "title": "Apple Says To Invest $500 Bn In US As Trump Tariffs Bite",
    "description": "Apple said on Monday it will spend more than $500 billion in the United States over the next four years and hire 20,000 people, with President Donald Trump quickly taking credit for the announcement.",
    "link": "https://www.ibtimes.com.au/apple-says-invest-500-bn-us-trump-tariffs-bite-1856527",
    "timestamp": "2025-02-25T13:49:48Z"
  },
  {
    "title": "Trump Names Right-wing Podcaster As FBI Deputy Director",
    "description": "US President Donald Trump has announced the appointment of right-wing podcaster Dan Bongino as deputy director of the Federal Bureau of Investigation, a break with tradition that puts yet another loyalist in a key law enforcement position.",
    "link": "https://www.ibtimes.com.au/trump-names-right-wing-podcaster-fbi-deputy-director-1856521",
    "timestamp": "2025-02-25T13:49:45Z"
  },
  {
    "title": "EU Vows To Enforce Digital Rules Despite Trump Tariff Warning",
    "description": "The EU promised on Monday to enforce its digital rules and to defend its laws \"decisively\" if necessary, after US President Donald Trump threatened to slap tariffs on countries that levy digital taxes on US tech firms.",
    "link": "https://www.ibtimes.com.au/eu-vows-enforce-digital-rules-despite-trump-tariff-warning-1856516",
    "timestamp": "2025-02-25T13:49:40Z"
  },
  {
    "title": "Nvidia, Super Micro Computer, Strategy: Stocks to watch today",
    "description": "U.S. stock futures remained largely flat early Tuesday as global trade tensions intensified. President Donald Trump reaffirmed that tariffs on imports from Canada and Mexico will proceed once the current 30-day reprieve expires. Additionally, his administrati…",
    "link": "https://qz.com/nvidia-smci-microstrategy-stocks-markets-1851766293",
    "timestamp": "2025-02-25T13:48:00Z"
  },
  {
    "title": "Lawrence O'Donnell Flags Moment Trump Was ‘Fully Humiliated On The World Stage’ - NewsBreak",
    "description": "Donald Trump was “humiliated and exposed in a way that no previous president ever could be,\" said the MSNBC anchor.",
    "link": "https://www.newsbreak.com/share/3828266284634-lawrence-o-donnell-flags-moment-trump-was-fully-humiliated-on-the-world-stage?s=a2&amp;share_destination_id=MTk3NTQzNjEwLTE3NDA0OTEyMDYyMTU%3D&amp;pd=0DMs7G9U&amp;hl=en_US&amp;send_time=1740491206&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.8.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v5%2Cns_foryou_blend_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v1%2Cns_foryou_model_exp_25q1-v4%2Cns_foryou_recall_exp_25q1-v5",
    "timestamp": "2025-02-25T13:47:14Z"
  },
  {
    "title": "Germany’s Merz vows ‘independence’ from Trump’s America, warning NATO may soon be dead",
    "description": "Election winner likens the Trump administration to Putin’s Russia as he bids to take Europe in a new direction. BERLIN — Friedrich Merz did not even wait for the final results in Germany's election before delivering what could well be a defining verdict on U.…",
    "link": "https://freerepublic.com/focus/f-chat/4300313/posts",
    "timestamp": "2025-02-25T13:46:05Z"
  },
  {
    "title": "Bitcoin Drops Below AU$145K: Australians Weigh In on Trump's Influence As Markets Slide",
    "description": "The U.S. market, including cryptocurrencies, reacted negatively after Trump confirmed that tariffs would be imposed on Canada and Mexico, starting March 4.",
    "link": "https://www.ibtimes.com.au/bitcoin-drops-below-au145k-australians-weigh-trumps-influence-markets-slide-1856514",
    "timestamp": "2025-02-25T13:45:31Z"
  },
  {
    "title": "Starbucks' largest layoffs in company's history. Why is the coffee giant firing 1,100 employees?: 10 point-explainer",
    "description": "Starbucks Layoffs: Starbucks has planned to lay off 1,100 corporate employees globally as new Chairman and CEO Brian Niccol streamlines operations. This is the largest layoff in the company's history, though warehouse, roasting and store employees are not par…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-starbucks-layoffs-starbucks-announces-largest-layoffs-in-companys-history-why-is-the-coffee-giant-firing-1100-employees-10-point-explainer/articleshow/118560793.cms",
    "timestamp": "2025-02-25T13:45:29Z"
  },
  {
    "title": "A (nearly) complete list of Trump’s actions in his fifth week in office",
    "description": "President Donald Trump continued to look for new ways to consolidate power in the White House in his fifth week in office.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-firing-generals-temporary-protected-status-week-5-rcna192636",
    "timestamp": "2025-02-25T13:44:57Z"
  },
  {
    "title": "Trump Reportedly Targets China's Tech Sector With Stricter Biden-Era Chip Curbs. It Will Backfire, Says Beijing",
    "description": "In a move to further tighten the noose on China’s burgeoning tech sector, President Donald Trump is reportedly considering stricter measures on the country’s semiconductor industry. This move is seen as an extension of efforts initiated under the Joe Biden ad…",
    "link": "https://biztoc.com/x/e825a11f06bb5414",
    "timestamp": "2025-02-25T13:44:15Z"
  },
  {
    "title": "Japanese Carmakers Want Government Help to Negate US Tariffs",
    "description": "Auto industry leaders in Japan called on Tuesday for the government to shield carmakers from tariffs that US President Donald Trump wants to impose on imported cars and parts.\nThe Japan Automobile Manufacturers’ Association fears hefty tariffs on auto imports…",
    "link": "https://biztoc.com/x/b5d22ada5a39ad80",
    "timestamp": "2025-02-25T13:44:03Z"
  },
  {
    "title": "Keith Olbermann Accuses MSNBC of ‘Racist Purge’ After Joy Reid’s Show Canceled: ‘Makes You Think It Was Done By Musk’",
    "description": "Keith Olbermann accused his former network MSNBC of a \"racist purge\" following the cancellation of Joy Reid's primetime show.\nThe post Keith Olbermann Accuses MSNBC of ‘Racist Purge’ After Joy Reid’s Show Canceled: ‘Makes You Think It Was Done By Musk’ first …",
    "link": "https://www.mediaite.com/media/keith-olbermann-accuses-msnbc-of-racist-purge-after-joy-reids-show-canceled-makes-you-think-it-was-done-by-musk/",
    "timestamp": "2025-02-25T13:43:26Z"
  },
  {
    "title": "Ian Buruma on Gaza, Trump, authoritarianism, and more",
    "description": "This week in Say More, PS talks with Ian Buruma, the author of numerous books, including Murder in Amsterdam: The Death of Theo Van Gogh and the Limits of Tolerance, Year Zero: A History of 1945, A Tokyo Romance: A Memoir, The Churchill Complex: The Curse of …",
    "link": "https://www.project-syndicate.org/onpoint/an-interview-with-ian-buruma-on-gaza-trump-spinoza-authoritarianism-2025-02",
    "timestamp": "2025-02-25T13:42:51Z"
  },
  {
    "title": "Trans woman and advocate announces plans to compete in Miss Georgia USA",
    "description": "Bella Bautista, a 22-year-old transgender woman, is preparing to compete in the upcoming Miss Georgia USA pageant starting June 12.",
    "link": "https://www.fox5atlanta.com/news/trans-woman-advocate-announces-plans-compete-miss-georgia-usa",
    "timestamp": "2025-02-25T13:40:41Z"
  },
  {
    "title": "Apple shareholders not expected to scrap diversity programs despite broader backlash",
    "description": "The proposal drafted by the National Center for Public Policy Research - a self-described conservative think tank - urges Apple to follow a litany of high-profile companies that have retreated from diversity, equity and inclusion initiatives currently in the …",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-shareholders-not-expected-to-scrap-diversity-programs-despite-broader-backlash/articleshow/118560759.cms",
    "timestamp": "2025-02-25T13:40:03Z"
  },
  {
    "title": "Home Depot Expects Tepid Recovery in Demand for Renovations",
    "description": "Home Depot Inc.’s sales will rise less than expected this year, as it anticipates consumers will remain cautious on large home projects.",
    "link": "https://financialpost.com/pmn/business-pmn/home-depot-expects-tepid-recovery-in-demand-for-renovations",
    "timestamp": "2025-02-25T13:38:22Z"
  },
  {
    "title": "10 championship teams that didn't visit the White House under Donald Trump",
    "description": "A bunch of champions didn't visit the White House in Donald Trump's first term.",
    "link": "https://ftw.usatoday.com/lists/donald-trump-white-house-champions-didnt-visit",
    "timestamp": "2025-02-25T13:38:09Z"
  },
  {
    "title": "Why Nvidia’s earnings are important to the entire U.S. stock market",
    "description": "Nvidia stock’s movement carries more weight on the S&P 500 and other indexes than every company except Apple.",
    "link": "https://www.denverpost.com/2025/02/25/nvidia-earnings-stock-market-impact/",
    "timestamp": "2025-02-25T13:37:52Z"
  },
  {
    "title": "Taliban Detains Elderly British Couple for Allegedly Teaching Women",
    "description": "Taliban terrorists arrested Peter and Barbie Reynolds, British nationals and longtime residents of Afghanistan, and cut off communication with their families in Britain, relatives lamented to the BBC on Sunday.\nThe post Taliban Detains Elderly British Couple …",
    "link": "https://www.breitbart.com/europe/2025/02/25/taliban-detains-elderly-british-couple-for-allegedly-teaching-women/",
    "timestamp": "2025-02-25T13:37:11Z"
  },
  {
    "title": "Trump’s claims of vast presidential powers run up against Article 2 of the Constitution and exceed previous presidents’ power grabs",
    "description": "Donald Trump claims that Article 2 of the Constitution gives him the right ‘to do whatever I want as President.’ A constitutional law scholar says ‘Not so.’",
    "link": "https://theconversation.com/trumps-claims-of-vast-presidential-powers-run-up-against-article-2-of-the-constitution-and-exceed-previous-presidents-power-grabs-249662",
    "timestamp": "2025-02-25T13:35:49Z"
  },
  {
    "title": "India-UK FTA: Focus on tariff reductions, social security agreement",
    "description": "After duty cut on bourbon, motorcycles, expectation that India may give similar relaxation to scotch whisky and automobiles",
    "link": "https://www.businesstoday.in/latest/economy/story/india-uk-fta-focus-on-tariff-reductions-social-security-agreement-465957-2025-02-25",
    "timestamp": "2025-02-25T13:34:57Z"
  },
  {
    "title": "Dems are preparing to blast Republicans on health care. It worked in 2018. - NewsBreak",
    "description": "Dems are preparing to blast Republicans on health care. It worked in 2018. - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3828418918468-dems-are-preparing-to-blast-republicans-on-health-care-it-worked-in-2018?s=a2&share_destination_id=MjI5MTQ2MzUwLTE3NDA0OTAxOTc4MTY%3D&pd=0FVTQsxU&hl=en_US&send_time=1740490197&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_blend_exp_25q1-v5",
    "timestamp": "2025-02-25T13:34:13Z"
  },
  {
    "title": "Ukrainian MPs support Zelensky’s rule at second attempt",
    "description": "US President Donald Trump earlier described the leader’s government as a dictatorship Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/613276-ukraine-elections-putin-zelensky/",
    "timestamp": "2025-02-25T13:33:56Z"
  },
  {
    "title": "If US attempts World Bank retreat, the China-led AIIB could be poised to step in – and provide a model of global cooperation",
    "description": "The AIIB is a paradox: an institution connected to the rules and norms of the liberal international order, but one created by an illiberal regime.",
    "link": "https://theconversation.com/if-us-attempts-world-bank-retreat-the-china-led-aiib-could-be-poised-to-step-in-and-provide-a-model-of-global-cooperation-244595",
    "timestamp": "2025-02-25T13:32:34Z"
  },
  {
    "title": "CBS Shows Sign Of A Backbone In Standoff With Trump And His Extremist FCC",
    "description": "Last October, Trump sued CBS claiming (falsely) that a 60 Minutes interview of Kamala Harris had been “deceitfully edited” to her benefit (they simply shortened some of her answers for brevity, as news outlets often do). As Mike explored, the lawsuit was utte…",
    "link": "https://www.techdirt.com/2025/02/25/cbs-shows-sign-of-a-backbone-in-standoff-with-trump-and-his-extremist-fcc/",
    "timestamp": "2025-02-25T13:32:09Z"
  },
  {
    "title": "DOGE's latest request came with plenty of confusion",
    "description": "A few weeks after considering buyout offers, federal workers faced another dilemma: Responding to Elon Musk's \"What did you do last week?\" email.",
    "link": "https://www.businessinsider.com/federal-workers-deciding-respond-musk-doge-email-deadline-conflicting-guidance-2025-2",
    "timestamp": "2025-02-25T13:32:01Z"
  },
  {
    "title": "Donald Trump is coming after one of his biggest critics and most public political foes, Nancy Pelosi; here's what he plans to do",
    "description": "Nancy Pelosi Federal Building is set to be sold by the Trump administration, raising questions about political motives. While the White House claims cost-cutting benefits, critics argue it's targeted revenge against Democrats. Former Congresswoman Jackie Spei…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-is-coming-after-one-of-his-biggest-critics-and-most-public-political-foes-nancy-pelosi-heres-what-he-plans-to-do/articleshow/118560372.cms",
    "timestamp": "2025-02-25T13:31:51Z"
  },
  {
    "title": "INSANE VIDEO: Alec Baldwin Threatens Trump Impersonator for Heckling Him About Shooting — ‘I’d Snap Your F–king Neck in Half’",
    "description": "Alec Baldwin's explosive confrontation with a Trump impersonator escalated dramatically as he issued chilling threats amid taunts about his past. This incident raises questions about celebrity accountability and public discourse.\nThe post INSANE VIDEO: Alec B…",
    "link": "https://www.thegatewaypundit.com/2025/02/insane-video-alec-baldwin-threatens-trump-impersonator-heckling/",
    "timestamp": "2025-02-25T13:30:25Z"
  },
  {
    "title": "Musk’s Starlink gets FAA contract, raising new conflict of interest concerns | CNN Business",
    "description": "The Federal Aviation Administration has agreed to use SpaceX’s Starlink internet system to upgrade the information technology networks it uses to manage US airspace, raising new concerns about conflicts of interest for CEO Elon Musk in one of his other roles,…",
    "link": "https://www.cnn.com/2025/02/25/business/musk-faa-starlink-contract/index.html",
    "timestamp": "2025-02-25T13:30:16Z"
  },
  {
    "title": "Here's what upcoming budget negotiations may mean for Social Security",
    "description": "Benefit cuts are off the table for now in upcoming budget negotiations, experts say. But the agency may continue to struggle with customer service woes.",
    "link": "https://www.cnbc.com/2025/02/25/heres-what-upcoming-budget-negotiations-may-mean-for-social-security-.html",
    "timestamp": "2025-02-25T13:30:01Z"
  },
  {
    "title": "Trump DOGE Dividend Check Could Be Much Less Than $5,000",
    "description": "The idea of a hefty DOGE dividend stimulus check is undeniably appealing, but current data suggest that, if implemented, it would be more symbolic than transformative.",
    "link": "https://www.forbes.com/sites/shaharziv/2025/02/25/trump-doge-dividend-stimulus-check-could-be-much-less-than-5000/",
    "timestamp": "2025-02-25T13:30:00Z"
  },
  {
    "title": "Lawrence O'Donnell Flags Moment Trump Was ‘Fully Humiliated On The World Stage’ - NewsBreak",
    "description": "Donald Trump was “humiliated and exposed in a way that no previous president ever could be,\" said the MSNBC anchor.",
    "link": "https://www.newsbreak.com/share/3828266284634-lawrence-o-donnell-flags-moment-trump-was-fully-humiliated-on-the-world-stage?_f=app_share&amp;pd=0GpYKw6i&amp;lang=en_US&amp;send_time=1740490131&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v9&amp;s=i2",
    "timestamp": "2025-02-25T13:29:38Z"
  },
  {
    "title": "Fire Engulfs Russian Plant Making Gunpowder for Cruise Missiles",
    "description": "The Bryansk Chemical Plant was previously targeted by Ukraine in an attack in January.",
    "link": "https://www.newsweek.com/fire-russia-bryansk-chemical-plant-missiles-2035844",
    "timestamp": "2025-02-25T13:29:27Z"
  },
  {
    "title": "Taiwan coast guard detains Chinese-crewed vessel suspected of cutting undersea cable",
    "description": "Taiwan detained eight Chinese nationals crewing a ship suspected of severing an undersea cable connecting the island of Penghu.",
    "link": "https://www.foxnews.com/world/taiwan-coast-guard-detains-chinese-crewed-vessel-suspected-cutting-undersea-cable",
    "timestamp": "2025-02-25T13:27:05Z"
  }
]