[
  {
    "title": "Morgan Stanley seen as front-runner for SpaceX IPO, sources say",
    "description": "NEW YORK, Dec 19 : Morgan Stanley is emerging as a leading contender for a key role in SpaceX's blockbuster initial public offering, as the bank's close ties to CEO Elon Musk give it an edge in his decision, according to three people familiar with the matter.…",
    "link": "https://www.channelnewsasia.com/business/morgan-stanley-seen-front-runner-spacex-ipo-sources-say-5652606",
    "timestamp": "2025-12-19T17:44:43Z"
  },
  {
    "title": "Wisconsin Judge's Case Is 'Far From Over,' Advocates Say After Conviction for Helping Immigrant at Courthouse",
    "description": "The case of Wisconsin Judge Hannah Dugan \"is a long way from over\" said a lawyer for the judge after a jury found her guilty late Thursday of the felony charge of obstructing immigration agents who showed up at her courtroom in April with the aim of arresting…",
    "link": "https://www.commondreams.org/news/milwaukee-judge-hannah-dugan",
    "timestamp": "2025-12-19T17:44:37Z"
  },
  {
    "title": "Morgan Stanley seen as front-runner for SpaceX IPO, sources say",
    "description": "Morgan Stanley is emerging as a leading contender for a key role in SpaceX's blockbuster initial public offering, as the bank's close ties to CEO Elon Musk...",
    "link": "https://finance.yahoo.com/news/morgan-stanley-seen-front-runner-174313230.html",
    "timestamp": "2025-12-19T17:43:13Z"
  },
  {
    "title": "Trump Boasts Unemployment Bump Was Caused by His Federal Workforce Cuts: ‘Those Jobs Are Not Necessary’",
    "description": "President Donald Trump boasted that the slight uptick in unemployment last month was attributable to cuts his administration has made to the federal workforce.\nThe post Trump Boasts Unemployment Bump Was Caused by His Federal Workforce Cuts: ‘Those Jobs Are N…",
    "link": "https://www.mediaite.com/media/news/trump-boasts-unemployment-bump-was-caused-by-his-federal-workforce-cuts-those-jobs-are-not-necessary/",
    "timestamp": "2025-12-19T17:40:36Z"
  },
  {
    "title": "High time to unlock marijuana's secrets",
    "description": "The Trump era has witnessed a significant legislative change as cannabis has been reclassified for medical research purposes. This strategic move aligns federal policies with state-level initiatives, enabling researchers to delve into the herb's potential for…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/high-time-to-unlock-marijuanas-secrets/articleshow/126082035.cms",
    "timestamp": "2025-12-19T17:40:05Z"
  },
  {
    "title": "'Now violating federal law!' Dems declare war on Trump admin over unreleased Epstein files",
    "description": "Democratic members of the House Oversight Committee are declaring all-out war on the Trump administration over its apparent failure to release files on Jeffrey Epstein, which it was mandated by law to do by the end of Friday.“Donald Trump and the Department o…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2674814770/",
    "timestamp": "2025-12-19T17:38:09Z"
  },
  {
    "title": "Trump says war with Venezuela not ruled out",
    "description": "President Trump signals a potential escalation, stating he has not ruled out a Trump Venezuela war amid increased military and economic pressure on the nat\n\nRead More: https://punchng.com/trump-says-war-with-venezuela-not-ruled-out/",
    "link": "https://punchng.com/?p=2014663",
    "timestamp": "2025-12-19T17:38:01Z"
  },
  {
    "title": "Circles of Epstein Hell",
    "description": "Though association with the man is certainly worthy of scrutiny, not everyone in his network is guilty of participation in his abusive sexual enterprise—or necessarily guilty at all.",
    "link": "https://www.theatlantic.com/ideas/2025/12/epstein-released-files-doj/685341/",
    "timestamp": "2025-12-19T17:36:27Z"
  },
  {
    "title": "Vance Has Racist Meltdown While Trying To Pimp The Economy",
    "description": "The other day, J. Divan Vance went to Allenton, PA, to try to sell the country's failing economy. But while shoveling his bullshit about the economy and about Biden, he went on a racist tirade, blaming the high cost of housing on immigrants.\n\nThe vice preside…",
    "link": "https://crooksandliars.com/2025/12/vance-has-racist-meltdown-while-plugging",
    "timestamp": "2025-12-19T17:36:26Z"
  },
  {
    "title": "2 strikes on alleged drug boats kill 5 in eastern Pacific, U.S. military says",
    "description": "The U.S. military said Thursday that it had conducted two more strikes against boats it said were smuggling drugs in the eastern Pacific Ocean, killing five people.",
    "link": "https://www.pbs.org/newshour/world/2-strikes-on-alleged-drug-boats-kill-5-in-eastern-pacific-u-s-military-says",
    "timestamp": "2025-12-19T17:34:08Z"
  },
  {
    "title": "Rob Reiner's Son Nick Expected to Plead Insanity on Parents' Murder Charges: Report",
    "description": "The 32-year-old's legal team will reportedly plead not guilty, arguing that medication prescribed for schizophrenia made him \"erratic and dangerous\"",
    "link": "https://exclaim.ca/film/article/rob-reiner-s-son-nick-expected-to-plead-insanity-on-parents-murder-charges-report",
    "timestamp": "2025-12-19T17:28:00Z"
  },
  {
    "title": "Dershowitz: Constitution doesn’t prevent President Trump from having 3rd term",
    "description": "\"The framers of the 22nd Amendment explicitly rejected language that would have prohibited serving, holding, or acting as president'",
    "link": "https://www.wnd.com/2025/12/dershowitz-constitution-doesnt-prevent-president-trump-having-3rd/",
    "timestamp": "2025-12-19T17:27:19Z"
  },
  {
    "title": "IRS cracks down on math errors — here’s how the new law affects your tax filing",
    "description": "The IRS has introduced a new law to fix tax filing math errors more clearly. The IRS MATH Act helps taxpayers understand mistakes, know where they happened, and respond on time. It aims to reduce confusion, save effort, and make dealing with IRS tax notices e…",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-cracks-down-on-math-errors-heres-how-the-new-law-affects-your-tax-filing/articleshow/126081562.cms",
    "timestamp": "2025-12-19T17:26:37Z"
  },
  {
    "title": "SD Governor Gets Shitty After Town Announces It Won’t Be Pitching In With Upcoming ICE Raids",
    "description": "If there’s anything the GOP/MAGA party can’t stand, it’s people who won’t fall in line. It openly courts fascism while still pretending its ultimate concern is the protection of (certain) civil liberties. It cheers on politically motivated prosecutions while …",
    "link": "https://www.techdirt.com/2025/12/19/sd-governor-gets-shitty-after-town-announces-it-wont-be-pitching-in-with-upcoming-ice-raids/",
    "timestamp": "2025-12-19T17:26:23Z"
  },
  {
    "title": "Every Kennedy Family Member’s Reaction to the Kennedy Center Being Renamed",
    "description": "The Kennedy Center in Washington, D.C. is one step closer to being called the Trump-Kennedy Center. On Thursday, December 18, the White House confirmed the board of the Kennedy Center voted to rename the building that is in honor of President John F. Kennedy.…",
    "link": "https://www.usmagazine.com/celebrity-news/news/every-kennedy-family-members-reaction-to-kennedy-center-being-renamed/#article",
    "timestamp": "2025-12-19T17:25:50Z"
  },
  {
    "title": "Schumer accuses Trump admin of Epstein files 'cover-up' amid document dispute",
    "description": "Justice Department to release Epstein documents in phases over coming weeks, not all at once as federal deadline arrives for controversial file dump.",
    "link": "https://www.foxnews.com/politics/schumer-accuses-trump-admin-epstein-files-cover-up-amid-document-dispute",
    "timestamp": "2025-12-19T17:24:19Z"
  },
  {
    "title": "Trump appeals court order restoring Harvard funding",
    "description": "The Trump administration has appealed a federal court order that restored billions in funding it had cut from Harvard University over alleged bias.\n\nRead More: https://punchng.com/trump-appeals-court-order-restoring-harvard-funding/",
    "link": "https://punchng.com/trump-appeals-court-order-restoring-harvard-funding/",
    "timestamp": "2025-12-19T17:23:46Z"
  },
  {
    "title": "New Trump-Kennedy Center sign is affixed to building facade despite concerns about legality",
    "description": "The John F. Kennedy Center for the Performing Arts in Washington donned a new name — the Trump-Kennedy Center — on the exterior of the building Friday, just a day after President Donald Trump's hand-picked board voted to change the arts institution's name.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-kennedy-center-name-change-congress-rcna250081",
    "timestamp": "2025-12-19T17:22:28Z"
  },
  {
    "title": "Why does Trump want to reclassify marijuana?",
    "description": "Nearly two-thirds of Americans want legalization",
    "link": "https://theweek.com/politics/trump-reclassify-marijuana-legalization",
    "timestamp": "2025-12-19T17:22:26Z"
  },
  {
    "title": "President Trump's Name Officially Added to Kennedy Center Building",
    "description": "The board of the Kennedy Center voted to change the name to the Trump Kennedy Center Thursday.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/president-trump-name-added-kennedy-center-building-dc-1236455022/",
    "timestamp": "2025-12-19T17:22:02Z"
  },
  {
    "title": "Heart is where the home is: Immigration expands civilisations, doesn't erase it as Trump would think",
    "description": "Donald Trump's National Security Strategy predicts civilizational erasure in Europe due to migration. The article argues this fear is unfounded, contrasting modern immigrants with historical colonizers. Immigrants integrate, enriching host countries. While de…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/heart-is-where-the-home-is-immigration-expands-civilisations-doesnt-erase-it-as-trump-would-think/articleshow/126081648.cms",
    "timestamp": "2025-12-19T17:22:01Z"
  },
  {
    "title": "Trump WH Urged to Review LGBTQ Content in Netflix Shows for Children Ahead of Warner Bros. Deal: 'Shocking Numbers, Most Parents Are Unaware'",
    "description": "President Donald Trump's administration is being urged to take a close look at Netflix's LGBTQ+ inclusion in its children's shows ahead of the streamer's possible acquisition of Warner Bros. Discovery.",
    "link": "https://www.breitbart.com/entertainment/2025/12/19/trump-wh-urged-to-review-lgbtq-content-in-netflix-shows-for-children-ahead-of-warner-bros-deal-shocking-numbers-most-parents-are-unaware/",
    "timestamp": "2025-12-19T17:21:02Z"
  },
  {
    "title": "Military families are fuming after IVF coverage cut from defense bill",
    "description": "Congress slashed military insurance coverage for IVF treatments in the defense bill, angering spouses who feel let down.",
    "link": "http://taskandpurpose.com/military-life/military-spouses-ivf-defense-bill/",
    "timestamp": "2025-12-19T17:15:48Z"
  },
  {
    "title": "Nasdaq rises again today: Nasdaq jumps more than 1% as AI stocks rebound; Oracle, Nvidia and Micron lead market rally",
    "description": "Nasdaq rose more than 1% again today as AI stocks staged a strong rebound. Oracle jumped after a TikTok deal headline. Nvidia climbed on chip export optimism. Micron extended gains on bullish guidance. Volatility remains high with record options expiry approa…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nasdaq-rises-again-today-nasdaq-jumps-more-than-1-as-ai-stocks-rebound-oracle-nvidia-and-micron-lead-market-rally/articleshow/126081466.cms",
    "timestamp": "2025-12-19T17:14:53Z"
  },
  {
    "title": "‘Donald’ Already Added to Kennedy Center Building Facade | Photo",
    "description": "The John F. Kennedy Center for the Performing Arts gets a slight facelift just one day after the board voted to rename it\nThe post ‘Donald’ Already Added to Kennedy Center Building Facade | Photo appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/donald-trump-kennedy-center-building-name-change-photo/",
    "timestamp": "2025-12-19T17:14:15Z"
  },
  {
    "title": "Man suspected in Brown University shooting and MIT professor’s killing is found dead, officials say",
    "description": "The suspect is a former Brown student and Portuguese national.",
    "link": "https://www.denverpost.com/2025/12/19/brown-campus-shooting-suspect/",
    "timestamp": "2025-12-19T17:14:10Z"
  },
  {
    "title": "Trump suspends green card lottery in wake of Brown University, MIT shootings",
    "description": "It is unclear how the Trump administration will pause the lottery",
    "link": "https://www.salon.com/2025/12/19/trump-suspends-green-card-lottery-in-wake-of-brown-university-mit-shootings/",
    "timestamp": "2025-12-19T17:14:05Z"
  },
  {
    "title": "UN aims to fix budget rule cutting cash availability amid crisis",
    "description": "GENEVA, Dec 18 (Reuters) - U.N. ‌officials are hoping to overhaul a \"bizarre\" rule that could see the global body ‌credit hundreds of millions of dollars in unspent dues to states next year, even ‌as it faces fears of bankruptcy. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/20/un-aims-to-fix-budget-rule-cutting-cash-availability-amid-crisis",
    "timestamp": "2025-12-19T17:14:00Z"
  },
  {
    "title": "The Future of CNN Has Never Been More Bleak as Warner Bros. Acquisition Looms",
    "description": "CNN is heading into an uncertain future with its parent company Warner Bros. Discovery (WBD) destined for a takeover — and US President Donald Trump hoping the change will allow him to influence the iconic news network’s programming.\nThe post The Future of CN…",
    "link": "https://www.breitbart.com/entertainment/2025/12/19/the-future-of-cnn-has-never-been-more-bleak-as-warner-bros-acquisition-looms/",
    "timestamp": "2025-12-19T17:11:48Z"
  },
  {
    "title": "The answer to all these questions about Trump is the same — and it's chilling",
    "description": "Today, after almost a year of Donald Trump’s second regime, I want to talk about the challenge Trump and his regime pose to America’s moral purpose. The best way into the subject is, I think, to ask a few questions about what’s been happening, and then offer …",
    "link": "https://www.rawstory.com/white-nationalism-2674813980/",
    "timestamp": "2025-12-19T17:11:17Z"
  },
  {
    "title": "Exclusive – Chip Roy Leads Conservatives Urging HR2 Border Security Vote",
    "description": "Conservatives led by Rep. Chip Roy (R-TX) are urging a January 2026 vote on Republicans' signature border security legislation to ensure continuation of President Donald Trump's border security achievements through the next administration and beyond.\nThe post…",
    "link": "https://www.breitbart.com/politics/2025/12/19/exclusive-chip-roy-leads-conservatives-urging-hr2-border-security-vote/",
    "timestamp": "2025-12-19T17:10:50Z"
  },
  {
    "title": "Sole suspect in Brown, MIT shootings found dead",
    "description": "The mass shooting suspect, a former Brown grad student, died of self-inflicted gunshot wounds",
    "link": "https://theweek.com/crime/brown-university-shooting-suspect-found-dead",
    "timestamp": "2025-12-19T17:10:26Z"
  },
  {
    "title": "The Clock Is Ticking And The DOJ Has Still Not Released The Epstein Files",
    "description": "Deputy Attorney General Todd Blanche suggested the DOJ may not comply with the legally mandated deadline to make the records public.",
    "link": "https://www.huffpost.com/entry/doj-deadline-epstein-files-release_n_69457c3ce4b0eb872d662158",
    "timestamp": "2025-12-19T17:06:14Z"
  },
  {
    "title": "Trump's Justice department won't meet deadline to release all the Epstein files",
    "description": "The U.S. Department of Justice will not be releasing all of its files on convicted sex offender Jeffrey Epstein by Friday’s deadline, Deputy Attorney General Todd Blanche said, defying legislation passed by Congress and signed into law by President Donald Tru…",
    "link": "https://www.cbc.ca/news/world/trump-justice-department-epstein-9.7022854",
    "timestamp": "2025-12-19T17:06:06Z"
  },
  {
    "title": "4 months in, activists say Trump’s operation in Washington targets immigrants",
    "description": "Activists describe frequent and frightening arrests. A lawsuit alleges many arrests are unlawful.",
    "link": "https://www.bostonherald.com/2025/12/19/dc-federal-enforcement-immigration/",
    "timestamp": "2025-12-19T17:05:15Z"
  },
  {
    "title": "DEI hustlers lash out after Trump official solicits discrimination complaints from white men",
    "description": "In his damning Dec. 15 article in Compact magazine titled \"The Lost Generation,\" Los Angeles-based writer Jacob Savage detailed the disenfranchisement of white male Millennials and their systematic exclusion from various industries, especially academia, enter…",
    "link": "https://www.theblaze.com/news/dei-hustlers-lash-out-after-eeoc-chairwoman-solicits-discrimination-complaints-from-white-men",
    "timestamp": "2025-12-19T17:05:00Z"
  },
  {
    "title": "Larger tax refunds from the One Big Beautiful Bill Act could boost Apple’s U.S. sales in 2026",
    "description": "In December 2025, President Trump touted the \"largest tax refund season of all time,\" thanks to the One Big Beautiful Bill Act enacted…\nThe post Larger tax refunds from the One Big Beautiful Bill Act could boost Apple’s U.S. sales in 2026 appeared first on Ma…",
    "link": "https://macdailynews.com/2025/12/19/larger-tax-refunds-from-the-one-big-beautiful-bill-act-could-boost-apples-u-s-sales-in-2026/",
    "timestamp": "2025-12-19T17:01:46Z"
  },
  {
    "title": "Donald Trump and the White Man’s Burden in Nigeria",
    "description": "US President Donald Trump recently threatened to take military action against Nigeria to save Christians from a “genocide.” Trump has three possible motives for making such a threat: his mercantilist quest for rare-earth minerals, his pandering to evangelical…",
    "link": "https://www.project-syndicate.org/commentary/trump-threats-to-invade-nigeria-reflect-colonizers-civilizing-mission-by-adekeye-adebajo-2025-12",
    "timestamp": "2025-12-19T17:01:23Z"
  },
  {
    "title": "Moon Race Heats Up as New NASA Chief Pits One Billionaire Against Another",
    "description": "Whichever company can produce a viable crew lander first will win the Artemis 3 contract, NASA’s new chief says.",
    "link": "https://gizmodo.com/moon-race-heats-up-as-new-nasa-chief-pits-one-billionaire-against-another-2000701826",
    "timestamp": "2025-12-19T17:00:12Z"
  },
  {
    "title": "Klarna partners with Coinbase to receive stablecoin funds from institutional investors",
    "description": "The buy-now-pay-later giant launched its own stablecoin in late November on a blockchain backed by Stripe and the VC firm Paradigm.",
    "link": "https://fortune.com/2025/12/19/klarna-coinbase-stablecoin-funds-institutional-investors/",
    "timestamp": "2025-12-19T17:00:00Z"
  },
  {
    "title": "‘This Is Not Dignified’: Maria Shriver Lashes Out Against Renaming Of Kennedy Center",
    "description": "Maria Shriver took to social media Thursday to convey her disappointment over the Trump administration's decision to rename The Kennedy Center.",
    "link": "https://dailycaller.com/2025/12/19/maria-shriver-lashes-out-renaming-kennedy-center-donald-trump-john-f-kennedy/",
    "timestamp": "2025-12-19T16:58:27Z"
  },
  {
    "title": "Terraform’s $4 billion Jump lawsuit exposes the hidden “shadow trading” that may be artificially holding up stablecoin prices",
    "description": "A fresh $4 billion lawsuit tied to Terraform Labs’ collapse is becoming a test of what a stablecoin’s $1 promise means amid the adoption of dollar tokens as payment rails. The case is about more than who pays for a 2022-era failure. It also decides whether a …",
    "link": "https://cryptoslate.com/terraforms-4-billion-jump-lawsuit-exposes-the-hidden-shadow-trading-that-may-be-artificially-holding-up-stablecoin-prices/",
    "timestamp": "2025-12-19T16:55:59Z"
  },
  {
    "title": "Sanctioned Tanker Hyperion to Test Trump’s Blockade of Venezuela",
    "description": "The tanker Hyperion, sanctioned by the US for having shipped Russian oil, will likely be the first ship to test President Donald Trump’s naval blockade of Venezuela.",
    "link": "https://financialpost.com/pmn/business-pmn/sanctioned-tanker-hyperion-to-test-trumps-blockade-of-venezuela",
    "timestamp": "2025-12-19T16:55:14Z"
  },
  {
    "title": "What to know about Trump's 'Patriot Games' announcement",
    "description": "In-mid December 2025, U.S. President Donald Trump announced the Patriot Games, a four-day athletics competition between young men and women from all U.S. states and territories.",
    "link": "https://www.snopes.com//fact-check/trump-patriot-games/",
    "timestamp": "2025-12-19T16:55:00Z"
  },
  {
    "title": "Senate confirms Ethan Klein to be fifth US CTO",
    "description": "In a sweeping nominee package, Klein was confirmed alongside Kirsten Davies to be DOD CIO and Pedro Allende to be DHS Undersecretary for Science and Technology.",
    "link": "https://www.nextgov.com/people/2025/12/senate-confirms-ethan-klein-be-fifth-us-cto/410297/",
    "timestamp": "2025-12-19T16:54:00Z"
  },
  {
    "title": "Trump’s “Warrior Dividend” Might Be His Scariest Idea Yet",
    "description": "Elie Mystal\n\n\n\nThis week’s “Elie v. US” explores the authoritarian threat beneath Trump’s bonuses for military families. Plus, a case for getting rid of the Second Amendment. \r\n\n\r\n\n\nThe post Trump’s “Warrior Dividend” Might Be His Scariest Idea Yet appeared f…",
    "link": "https://www.thenation.com/article/politics/newsletter-warrior-dividend-school-shootings/",
    "timestamp": "2025-12-19T16:53:52Z"
  },
  {
    "title": "PHOTOS: Crews begin changing Kennedy Center signage to Trump Kennedy Center",
    "description": "The change comes after the Kennedy Center board reportedly unanimously voted to rename the performing arts venue on Thursday.",
    "link": "https://www.wusa9.com/article/entertainment/trump-kennedy-center-new-signage-photos/65-a19a5a3c-7a30-4c14-8774-9b389f7a6eda",
    "timestamp": "2025-12-19T16:53:45Z"
  },
  {
    "title": "Trump name added to Kennedy Center signage",
    "description": "The Kennedy Center board on Thursday voted to add Trump's name to the famed arts institution.",
    "link": "https://www.cnbc.com/2025/12/19/trump-kennedy-center-added-signage.html",
    "timestamp": "2025-12-19T16:53:13Z"
  },
  {
    "title": "Workers Add Donald Trump’s Name To Facade Of Kennedy Center",
    "description": "A day after the Donald Trump-controlled board of the Kennedy Center voted to add the president’s name to the arts institution, workers on Friday installed the lettering to the facade of the complex. But Democrats, Kennedy family members and others say that on…",
    "link": "http://deadline.com/2025/12/trump-kennedy-center-facade-1236653693/",
    "timestamp": "2025-12-19T16:52:49Z"
  },
  {
    "title": "Erika Kirk says Turning Point will throw weight behind JD Vance for 2028 presidential campaign",
    "description": "Erika Kirk, now the leader of the Turning Point USA organization after her husband Charlie Kirk's slaying in September, said the group will work to get Vice-President JD Vance elected president in 2028.",
    "link": "https://www.cbc.ca/news/world/turning-point-erika-kirk-vance-2028-presidency-9.7022450",
    "timestamp": "2025-12-19T16:51:14Z"
  },
  {
    "title": "'Hellbent on hiding truth': Dem leader pounces as DOJ official hints at holding back files",
    "description": "The top Democrat in the Senate has directly responded to Deputy Attorney General Todd Blanche after he said that \"thousands\" of Jeffrey Epstein files would be withheld by the Department of Justice despite a law requiring \"all\" documents to be released by Frid…",
    "link": "https://www.rawstory.com/schumer-blanche-epstein/",
    "timestamp": "2025-12-19T16:50:10Z"
  },
  {
    "title": "Rubio Backs USAID Closure, Says Dire Warnings Proved Wrong",
    "description": "WASHINGTON (Sputnik) - US State Secretary Marco Rubio said on Friday that the decision to shut down the Agency for International Development (USAID) was the right move, and all predictions of negative consequences have not occurred.",
    "link": "https://sputnikglobe.com/20251219/rubio-backs-usaid-closure-says-dire-warnings-proved-wrong-1123334295.html",
    "timestamp": "2025-12-19T16:48:46Z"
  },
  {
    "title": "US judge found guilty of helping migrant evade immigration agents",
    "description": "The 66-year-old could face up to five years in prison for ushering the man out a courtroom side door.",
    "link": "https://www.bbc.com/news/articles/c0kd2d4gj08o",
    "timestamp": "2025-12-19T16:48:45Z"
  },
  {
    "title": "Erika Kirk endorses JD Vance for president in 2028",
    "description": "Kirk vowed to use Turning Point's influence to get Vance elected.",
    "link": "https://abcnews.go.com/Politics/erika-kirk-endorses-jd-vance-president-2028/story?id=128552499",
    "timestamp": "2025-12-19T16:47:20Z"
  },
  {
    "title": "Slog AM: Ferguson Has a Ferry Plan, Brown Shooting Suspect Found Dead, Don't Go to the Patrick Mahomes Steak House",
    "description": "The Stranger's morning news round-up.\n \n by Nathalie Graham\n \n \n \n Bob's Billion Dollar Boats: Gov. Bob Ferguson announced via his supplemental budget plan that he intends to buy three new ferry boats ($1 billion) and spend cash ($150 million) to keep the cur…",
    "link": "https://www.thestranger.com/slog-am/2025/12/19/80379808/slog-am-ferguson-has-a-ferry-plan-brown-shooting-suspect-found-dead-dont-go-to-the-patrick-mahomes-steak-house",
    "timestamp": "2025-12-19T16:47:00Z"
  },
  {
    "title": "Meta CEO Mark Zuckerberg cuts off pro-immigration group he founded in retreat from advocacy",
    "description": "Zuckerberg’s pivot has unfolded even as his business continues to rely heavily on foreign workers.",
    "link": "https://nypost.com/2025/12/19/business/meta-ceo-mark-zuckerberg-cuts-off-pro-immigration-group-fwd-us/",
    "timestamp": "2025-12-19T16:45:42Z"
  },
  {
    "title": "Official Says 11 States Open to Stopping Residents From Voting at DOJ’s Request",
    "description": "The DOJ’s effort “should frighten everybody across the political spectrum,” said an election expert.",
    "link": "https://stateline.org/2025/12/18/trumps-doj-offers-states-confidential-deal-to-wipe-voters-flagged-by-feds-as-ineligible/",
    "timestamp": "2025-12-19T16:44:30Z"
  },
  {
    "title": "Trump Ends Year on Voters’ Naughty List As Rising Unemployment and Snowballing Prices Crush Holiday Spirit",
    "description": "As 2025 comes to a close, Americans are taking stock of an economy that looks nothing like what Donald Trump promised. Instead of lower prices and stable jobs, working families are staring down the highest unemployment rate in four years, soaring costs, and t…",
    "link": "https://www.commondreams.org/newswire/trump-ends-year-on-voters-naughty-list-as-rising-unemployment-and-snowballing-prices-crush-holiday-spirit",
    "timestamp": "2025-12-19T16:44:18Z"
  },
  {
    "title": "Mark Zuckerberg's CZI philanthropy stops funding the pro-immigration advocacy group he cofounded",
    "description": "Mark Zuckerberg and Priscilla Chan's philanthropy organization did not fund FWD.us in 2025. Zuckerberg cofounded the immigration reform group in 2013.",
    "link": "https://www.businessinsider.com/zuckerberg-chan-initative-czi-stops-funding-immigration-group-fwd-us-2025-12",
    "timestamp": "2025-12-19T16:42:37Z"
  },
  {
    "title": "Major Left-Leaning Group Deploys Capitol Hill ‘Climate Deniers’ Watchlist",
    "description": "The Center for American Progress, a left-leaning D.C. think tank, released a report Thursday identifying the \"climate deniers\" on Capitol Hill.",
    "link": "https://dailycaller.com/2025/12/19/center-american-progress-climate-deniers-trump-administration-congress/",
    "timestamp": "2025-12-19T16:41:40Z"
  },
  {
    "title": "This Report Should Be Setting Off Alarm Bells in the Pentagon",
    "description": "The people running the U.S. military should be sweating right now.",
    "link": "https://slate.com/news-and-politics/2025/12/trump-news-military-pentagon-new-york-times-pete-hegseth.html",
    "timestamp": "2025-12-19T16:41:27Z"
  },
  {
    "title": "These are Americans’ biggest priorities for the government in 2026, according to a new poll",
    "description": "A poll finds Americans are more likely to prioritize health care than last year.",
    "link": "https://www.bostonherald.com/2025/12/19/american-priorities-poll/",
    "timestamp": "2025-12-19T16:40:50Z"
  },
  {
    "title": "'The brink of illegitimacy': Professors warn no turning back for 'noxious' Supreme Court",
    "description": "Two American university professors Friday warned the \"noxious\" Supreme Court can no longer be saved. Harvard law professor Ryan Doerfler and Yale law professor Samuel Moyn wrote an opinion piece published by The Guardian about how the high court's legitimacy …",
    "link": "https://www.rawstory.com/supreme-court-donald-trump-2674814431/",
    "timestamp": "2025-12-19T16:39:22Z"
  },
  {
    "title": "GOP alternative to Obamacare subsidy extension could cut health insurance prices by 11% - NewsBreak",
    "description": "After 15 years of Republican railing against the Affordable Care Act, GOP lawmakers have it on the ropes. But four House Republicans are trying to help pro",
    "link": "https://www.newsbreak.com/share/4404619194838-gop-alternative-to-obamacare-subsidy-extension-could-cut-health-insurance-prices-by-11?_f=app_share&amp;pd=083E5AEe&amp;lang=en_US&amp;send_time=1766162303&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.38.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-19T16:38:50Z"
  },
  {
    "title": "'Another Backdoor Deal'? Billionaire Trump Ally Larry Ellison at Center of TikTok Spin-Off",
    "description": "A group of investors including Oracle—a software giant led by billionaire Trump ally and GOP megadonor Larry Ellison—is set to control TikTok's US operations under a spin-off agreement formalized Thursday, raising concerns of undue political influence on the …",
    "link": "https://www.commondreams.org/news/larry-ellison-tiktok",
    "timestamp": "2025-12-19T16:35:29Z"
  },
  {
    "title": "Trump Promises $1,776 ‘Warrior Dividend’ for Troops—Here’s What Service Members Need to Know",
    "description": "President Donald Trump's promised one-time $1,776 payment for U.S. service members dubbed a “Warrior Dividend” is being framed as both a financial boost and a symbolic gesture tied to the nation’s founding. The announcement made Wednesday evening during a nat…",
    "link": "https://freerepublic.com/focus/f-chat/4358153/posts",
    "timestamp": "2025-12-19T16:35:02Z"
  },
  {
    "title": "Justice Department faces deadline to release files on Epstein sex trafficking investigation",
    "description": "A bill allows redactions for victims or ongoing investigations but not for embarrassment or politics.",
    "link": "https://www.bostonherald.com/2025/12/19/epstein-files-release/",
    "timestamp": "2025-12-19T16:34:39Z"
  },
  {
    "title": "Justice Department faces deadline to release files on Epstein sex trafficking investigation",
    "description": "A bill allows redactions for victims or ongoing investigations but not for embarrassment or politics.",
    "link": "https://www.denverpost.com/2025/12/19/epstein-files-release/",
    "timestamp": "2025-12-19T16:34:39Z"
  },
  {
    "title": "'His reign will end': Ex-GOP insider flags evidence Trump's power is already 'waning'",
    "description": "Conservative political strategist Rick Wilson, one of President Donald Trump’s most vocal critics, urged his readers on Friday to “be of good cheer,” saying he believes the Trump administration is nearing collapse after what he described as a particularly dif…",
    "link": "https://www.rawstory.com/maga-2674814527/",
    "timestamp": "2025-12-19T16:33:45Z"
  },
  {
    "title": "Nolte: Polls Show Democrats Losing Ground for 2026 Midterms",
    "description": "As President Trump puts more focus on the economy and everyday people begin to feel the easing of Bidenflation, things do not look as rosy for Democrats in the upcoming midterm elections.\nThe post Nolte: Polls Show Democrats Losing Ground for 2026 Midterms ap…",
    "link": "https://www.breitbart.com/politics/2025/12/19/nolte-polls-show-democrats-losing-ground-for-2026-midterms/",
    "timestamp": "2025-12-19T16:33:04Z"
  },
  {
    "title": "Economic Sentiment Collapses to All-Time Lows, Why?",
    "description": "I think consumer sentiment is near all-time lows because of a combination of real and widespread economic hardship, the drumbeat of the vibecession narrative on social media and major media reinforcing anecdotal evidence of real hardship, and the gobsmackingl…",
    "link": "https://www.jezebel.com/consumer-sentiment-collapses-to-all-time-lows-why",
    "timestamp": "2025-12-19T16:32:34Z"
  },
  {
    "title": "Gates Are Closing on Escaping South Africans",
    "description": "After leftists fundamentally transform a country, people must be prevented from escaping. South Africa is no exception. Via CDM: On Tuesday, December 16, 2025, a U.S.-affiliated refugee processing center in Johannesburg was raided by South African officials w…",
    "link": "https://moonbattery.com/gates-are-closing-on-escaping-south-africans/",
    "timestamp": "2025-12-19T16:32:15Z"
  },
  {
    "title": "Federal Reserve moves toward narrower, crypto-driven take on master accounts",
    "description": "The U.S. central bank has been mulling the idea of a \"skinny\" version of master accounts for firms that want payments access without the deeper Fed demands.",
    "link": "https://www.coindesk.com/policy/2025/12/19/federal-reserve-moves-toward-narrower-crypto-driven-take-on-master-accounts",
    "timestamp": "2025-12-19T16:31:37Z"
  },
  {
    "title": "Mystery surrounds a content creator’s livestream appearing on White House website",
    "description": "‘There’s no way this is real, right?’ Matt Farley posted online after the inexplicable incident",
    "link": "https://www.the-independent.com/tech/white-house-live-stream-matt-farley-b2887925.html",
    "timestamp": "2025-12-19T16:30:56Z"
  },
  {
    "title": "Russia ready to ‘compromise’ on Ukraine – Putin",
    "description": "Russia has agreed to “compromise” on a Ukraine settlement and is ready to end the conflict through diplomatic means, Vladimir Putin has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629766-putin-russia-compromise-ukraine/",
    "timestamp": "2025-12-19T16:30:16Z"
  },
  {
    "title": "An Anthology, Non-Fiction, and More",
    "description": "Smart Bitches, Trashy Books",
    "link": "https://smartbitchestrashybooks.com/2025/12/an-anthology-non-fiction-and-more/",
    "timestamp": "2025-12-19T16:30:08Z"
  },
  {
    "title": "Da’wa in Doha: Qatar’s 21st Century Muslim Brotherhood Strategy",
    "description": "On November 24, 2025, U.S. President Donald Trump issued an executive order designating Muslim Brotherhood chapters as Foreign Terrorist Organizations. Three weeks later, Qatar—considered the world hub for the Muslim Brotherhood—hosted two major international…",
    "link": "https://freerepublic.com/focus/f-chat/4358151/posts",
    "timestamp": "2025-12-19T16:29:55Z"
  },
  {
    "title": "Trump Secretary Has Dystopian Idea for How to Stop More Immigration",
    "description": "The political party that has historically pitched itself as a proponent of “states’ rights” is now advocating for a mass federal seizure of state land.Speaking with Newsmax on Friday, Interior Secretary Doug Burgum suggested that the next course of action to …",
    "link": "https://newrepublic.com/post/204656/donald-trump-secretary-doug-burgum-military-installation-stop-immigration",
    "timestamp": "2025-12-19T16:29:42Z"
  },
  {
    "title": "Epstein files won’t be released by deadline, Department of Justice says",
    "description": "Members of Congress have warned that officials could face legal repercussions for the delay",
    "link": "https://www.salon.com/2025/12/19/epstein-files-wont-be-released-by-deadline-department-of-justice-says/",
    "timestamp": "2025-12-19T16:29:22Z"
  },
  {
    "title": "Deputy AG Todd Blanche Admits Trump Admin Will Miss Deadline to Release Epstein Files",
    "description": "Deputy Attorney General Todd Blanche admitted that the Trump administration would miss Friday's deadline to release the Epstein files, with more documents released in coming weeks.\nThe post Deputy AG Todd Blanche Admits Trump Admin Will Miss Deadline to Relea…",
    "link": "https://www.mediaite.com/crime/deputy-ag-todd-blanche-admits-trump-admin-will-miss-deadline-to-release-epstein-files/",
    "timestamp": "2025-12-19T16:28:57Z"
  },
  {
    "title": "The Kennedy Center starts work to add Trump’s name onto the building",
    "description": "The board that voted on the name change was handpicked by Trump",
    "link": "https://www.bostonherald.com/2025/12/19/kennedy-center-name/",
    "timestamp": "2025-12-19T16:27:15Z"
  },
  {
    "title": "'Run it hot': Wall Street is trotting out a new playbook for a high-growth, high-inflation economy in 2026",
    "description": "Bank of America was among the first to flag a \"run-it-hot\" scenario for the US economy, defined by robust growth and above-target inflation.",
    "link": "https://www.businessinsider.com/how-to-invest-2026-stock-market-inflation-hot-economic-outlook-2025-12",
    "timestamp": "2025-12-19T16:26:33Z"
  },
  {
    "title": "'None Of That Is True': Fact-Checker Tears Into Trump's National Address",
    "description": "Donald Trump's widely panned address to the nation in a nutshell was that nothing is his fault, and he hates Joe Biden. The nationally-televised address was packed full of lies, so much so that even CNN's Daniel Dale looked exhausted. \n“I saw a whole bunch of…",
    "link": "https://crooksandliars.com/2025/12/none-true-fact-checker-tears-trumps",
    "timestamp": "2025-12-19T16:26:09Z"
  },
  {
    "title": "Trump officials to release only some Epstein files as midnight deadline looms",
    "description": "The Friday deadline was mandated by a bill that got near-unanimous support in Congress, and was later signed into law by President Donald Trump.",
    "link": "https://www.bbc.com/news/articles/ckg9plrkl8no",
    "timestamp": "2025-12-19T16:24:56Z"
  },
  {
    "title": "The Trump administration is preparing to release hundreds of thousands of documents in the Epstein case",
    "description": "Today is the deadline set by law for the release of all documents in the possession of the Trump administration in this case\nThe post The Trump administration is preparing to release hundreds of thousands of documents in the Epstein case appeared first on Pro…",
    "link": "https://en.protothema.gr/2025/12/19/the-trump-administration-is-preparing-to-release-hundreds-of-thousands-of-documents-in-the-epstein-case/",
    "timestamp": "2025-12-19T16:24:25Z"
  },
  {
    "title": "Fox Admits Economy Is in Shambles as Key Indicator Hits Record Low",
    "description": "Not even Fox Business can pretend like President Donald Trump isn’t wrecking the economy.Fox Business anchors Lauren Simonetti and Stuart Varney reported Friday that a University of Michigan survey found that an index of consumer sentiment had sunk even furth…",
    "link": "https://newrepublic.com/post/204648/fox-donald-trump-economy-key-indicator-record-low",
    "timestamp": "2025-12-19T16:23:53Z"
  },
  {
    "title": "Trump Media to merge with nuclear fusion company that wants to power AI",
    "description": "Trump Media & Technology announced its merger with TAE Technologies in an all-stock deal that the companies said Thursday is valued at more than $6 billion. The combined company says it plans to find a site and begin construction next year on the \"world's fir…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-media-to-merge-with-nuclear-fusion-company-that-wants-to-power-ai/articleshow/126080706.cms",
    "timestamp": "2025-12-19T16:22:54Z"
  },
  {
    "title": "Defense Spending Law Restricts US Investment in Chinese Tech Companies",
    "description": "A defense spending bill signed into law Thursday (Dec. 18) by President Donald Trump reportedly includes provisions that restrict United States investment in Chinese tech firms. The National Defense Authorization Act’s outbound-investment provisions enable th…",
    "link": "https://www.pymnts.com/legal/2025/defense-spending-law-restricts-united-states-investment-chinese-tech-companies/",
    "timestamp": "2025-12-19T16:21:01Z"
  },
  {
    "title": "Who owns Trump Mobile?",
    "description": "Where's the Trump Phone? We're going to keep talking about it every week, except next week, when we take a break until the new year. We've reached out, as usual, to ask about the Trump Phone's whereabouts. As usual, we're still waiting for a response. In the …",
    "link": "https://www.theverge.com/tech/848029/trump-mobile-ownership-structure-licensing",
    "timestamp": "2025-12-19T16:20:27Z"
  },
  {
    "title": "RNC Says It Won’t Defy Trump On Voting Despite Legacy Media Reports",
    "description": "The RNC told the Daily Caller that it isn't planning on leaning in to mail-in voting, despite reports that the party might be breaking with Trump and doing so.",
    "link": "https://dailycaller.com/2025/12/19/republican-national-committee-mail-in-voting-trump-election-integrity-2026-midterms/",
    "timestamp": "2025-12-19T16:19:11Z"
  },
  {
    "title": "Today’s News in a Nutshell",
    "description": "KATHMANDU: Khabarhub brings you a glimpse of major developments of the day in Nepal, including politics, business/economy, sports, entertainment, and more. Rabi Lamichhane released after posting bank bail Rabi Lamichhane, President of the Rastriya Swatantra P…",
    "link": "https://english.khabarhub.com/2025/19/512172/",
    "timestamp": "2025-12-19T16:15:21Z"
  },
  {
    "title": "Rights Groups Warn FBI Probe of Anti-ICE Activity Portends New Crackdown on Lawful Dissent",
    "description": "Rights groups are expressing alarm over new reporting about the FBI carrying out nationwide anti-terrorism probes against activists protesting against federal immigration enforcement officers.The Guardian on Friday published a report detailing an internal FBI…",
    "link": "https://www.commondreams.org/news/fbi-memo-anti-ice",
    "timestamp": "2025-12-19T16:15:09Z"
  },
  {
    "title": "Jasmine Crockett Can’t Stop Gushing Over Jack Smith",
    "description": "Democratic Texas Rep. Jasmine Crockett lavished praise on former special counsel Jack Smith.",
    "link": "https://dailycaller.com/2025/12/19/jasmine-crockett-gushing-jack-smith/",
    "timestamp": "2025-12-19T16:14:19Z"
  },
  {
    "title": "The Kennedy Center starts work to add Trump’s name onto the building - WTOP News",
    "description": "The Kennedy Center started the work of adding Donald Trump’s name to the D.C. building on Friday, a day after the president’s handpicked board voted to do so.",
    "link": "https://wtop.com/entertainment/2025/12/the-kennedy-center-starts-work-to-add-trumps-name-onto-the-building/",
    "timestamp": "2025-12-19T16:13:46Z"
  }
]