[
  {
    "title": "President Trump Calls for Portrait in Colorado State Capitol to Be Taken Down",
    "description": "Donald Trump said a portrait by Sarah A. Boardman in Colorado was 'purposefully distorted' and demanded it be removed.",
    "link": "https://www.artnews.com/art-news/news/president-trump-calls-removal-colorado-portrait-1234736546/",
    "timestamp": "2025-03-24T17:16:51Z"
  },
  {
    "title": "Michigan's Mallory McMorrow Issues Update on Senate Run",
    "description": "The state senator is tipped to run for the hotly contested U.S. Senate seat in Michigan that Gary Peters is vacating next year.",
    "link": "https://www.newsweek.com/michigan-mcmorrow-democrat-senate-run-update-2049600",
    "timestamp": "2025-03-24T17:14:52Z"
  },
  {
    "title": "Defense Secretary Pete Hegseth Launches Investigation into Leaks of Sensitive and Classified Information",
    "description": "The Department of Defense over the weekend announced an investigation into leaks of sensitive and classified information following a series of unauthorized disclosures to several legacy news media outlets.\nThe post Defense Secretary Pete Hegseth Launches Inve…",
    "link": "https://www.breitbart.com/politics/2025/03/24/defense-secretary-pete-hegseth-launches-investigation-leaks-sensitive-classified-information/",
    "timestamp": "2025-03-24T17:14:30Z"
  },
  {
    "title": "Mike Myers Boosts “Good Guys” Canada As Election Kicks Off; Endorses PM Mark Carney, Praises CBC",
    "description": "Skating even deeper into Canadian politics, Wayne’s World star Mike Myers today officially endorsed incumbent Prime Minister Mark Carney, bodychecked Conservative Opposition leader Pierre Poilievre & robustly flew the Maple Leaf flag in the face of Donald Tru…",
    "link": "http://deadline.com/2025/03/mike-myers-canada-election-1236347867/",
    "timestamp": "2025-03-24T17:13:53Z"
  },
  {
    "title": "Trump: People in Greenland want something to happen",
    "description": "United States President Donald Trump said during a cabinet meeting on Monday that people in Greenland \"want something to happen.\" The president reiterated the importance of Denmark's Arctic territory ...",
    "link": "https://biztoc.com/x/021ee8bb3ac84688",
    "timestamp": "2025-03-24T17:13:10Z"
  },
  {
    "title": "Musk set to earn billions from Trump administration",
    "description": "What happened\nTesla stock has fallen back to where it was trading before President Donald Trump won in November and named CEO Elon Musk to lead his \"Department of Government Efficiency.\" The Tesla slump has cost Musk a fortune on paper, but the world's riches…",
    "link": "https://biztoc.com/x/c44258592a802fff",
    "timestamp": "2025-03-24T17:13:05Z"
  },
  {
    "title": "MAGA's push to impeach federal judges",
    "description": "Trump launches a 'stunning assault' on judicial branch",
    "link": "https://theweek.com/politics/trump-maga-push-impeach-federal-judges",
    "timestamp": "2025-03-24T17:12:51Z"
  },
  {
    "title": "Trump demands his ‘distorted’ portrait in Colorado’s Capitol be taken down",
    "description": "The portrait was paid for with a Republican-led fundraising effort.",
    "link": "https://www.bostonherald.com/2025/03/24/trump-portrait-colorado-capitol/",
    "timestamp": "2025-03-24T17:12:51Z"
  },
  {
    "title": "Maybe J.D. Vance Isn’t Trump’s Puppet",
    "description": "Turns out J.D. Vance’s bad thoughts might actually be his own. A blockbuster report today about how your government plans its bombing in group chats revealed that Vance and Trump aren’t always on the same page.",
    "link": "http://nymag.com/intelligencer/article/jd-vance-disagrees-with-donald-trump-signal-group-chat.html",
    "timestamp": "2025-03-24T17:12:48Z"
  },
  {
    "title": "TikTok Taps Khartoon Weiss to Lead North America Sales Amid Leadership Shake-Up",
    "description": "TikTok is reshuffling its leadership ranks as it navigates mounting uncertainty in the U.S.",
    "link": "https://www.adweek.com/media/tiktok-taps-khartoon-weiss-to-lead-north-america-sales-amid-leadership-shake-up/",
    "timestamp": "2025-03-24T17:11:40Z"
  },
  {
    "title": "Trump hedges on whether he actually signed his Alien Enemies Act order",
    "description": "The White House insists that the president recently signed a directive on the Alien Enemies Act. So why did Donald Trump suggest he \"didn’t sign it\"?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-hedges-whether-actually-signed-alien-enemies-act-order-rcna197827",
    "timestamp": "2025-03-24T17:11:24Z"
  },
  {
    "title": "Trump—Seeking Revenge for His Mortality—Wages War on Everything That Lives",
    "description": "Allow me to stipulate that I do not wish to die. In fact, had anyone consulted me about the construction of the universe, I would have made my views on the subject quite clear: Mortality is a terrible idea. I’m opposed to it in general. (In wiser moments, I k…",
    "link": "https://tomdispatch.com/trump-rages-to-snuff-out-democracys-candle/",
    "timestamp": "2025-03-24T17:10:36Z"
  },
  {
    "title": "Trump: 25% Tariff On Anyone Who Buys Venezuelan Oil & Gas",
    "description": "U.S. President Donald Trump has announced that any country that buys oil or gas from Venezuela will pay a 25% secondary tariff on trades with the United States, Reuters reported on Monday, with Trump claiming that Venezuela has sent \"tens of thousands\" of peo…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-25-Tariff-On-Anyone-Who-Buys-Venezuelan-Oil-Gas.html",
    "timestamp": "2025-03-24T17:10:00Z"
  },
  {
    "title": "Tiger Woods confirms his relationship with Vanessa Trump in a social media post",
    "description": "The golfer's social media post said, “Love is in the air.”",
    "link": "https://www.denverpost.com/2025/03/24/tiger-woods-vanessa-trump-social-media/",
    "timestamp": "2025-03-24T17:09:49Z"
  },
  {
    "title": "Tiger Woods confirms his relationship with Vanessa Trump in a social media post",
    "description": "The golfer's social media post said, “Love is in the air.”",
    "link": "https://www.bostonherald.com/2025/03/24/tiger-woods-vanessa-trump-social-media/",
    "timestamp": "2025-03-24T17:09:49Z"
  },
  {
    "title": "WATCH: Subway Rider Tries to Steal MAGA Hat Off Trump Fan’s Head — And Instantly Regrets It",
    "description": "A New York City subway rider tried to rip a fellow straphanger's \"Make America Great Again\" hat off his head in a tense exchange aboard a train but quickly paid for it when the dispute spilled onto the platform.\nThe post WATCH: Subway Rider Tries to Steal MAG…",
    "link": "https://www.mediaite.com/news/watch-subway-rider-tries-to-steal-maga-hat-off-trump-fans-head-and-instantly-regrets-it/",
    "timestamp": "2025-03-24T17:09:44Z"
  },
  {
    "title": "Hyundai to announce a $20 billion investment in the United States",
    "description": "South Korean-based Hyundai will announce a $20 billion investment in U.S. on-shoring on Monday, which includes a $5 billion steel plant in Louisiana, the White House confirmed.",
    "link": "https://www.abc12.com/news/business/hyundai-to-announce-a-20-billion-investment-in-the-united-states/article_41de68d5-aeae-5f78-be77-27356ff228e1.html",
    "timestamp": "2025-03-24T17:09:21Z"
  },
  {
    "title": "Tesla share price is down by 30 per cent for year. Is Elon Musk responsible for EV maker's US stock market downfall?",
    "description": "Share price of Elon Musk's Tesla was witnessing an uptick on Monday and is on track to record its biggest one-day percentage jump since November 6.",
    "link": "https://economictimes.indiatimes.com/news/international/us/tesla-share-price-is-down-by-30-per-cent-for-year-is-elon-musk-responsible-for-ev-makers-us-stock-market-downfall/articleshow/119436290.cms",
    "timestamp": "2025-03-24T17:09:01Z"
  },
  {
    "title": "Musk set to earn billions from Trump administration",
    "description": "Musk's company SpaceX will receive billions in federal government contracts in the coming years",
    "link": "https://theweek.com/politics/elon-musk-trump-spacex-contracts",
    "timestamp": "2025-03-24T17:08:49Z"
  },
  {
    "title": "Trump says he will soon announce tariffs on autos, aluminum, pharmaceuticals",
    "description": "U.S. President Donald Trump announced that tariffs on automobiles, aluminum, and pharmaceuticals would soon be imposed to protect the nation’s interests. Commerce Secretary Howard Lutnick indicated that the tariffs would be implemented on April 2, marking the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-he-will-soon-announce-tariffs-on-autos-aluminum-pharmaceuticals/articleshow/119436416.cms",
    "timestamp": "2025-03-24T17:08:11Z"
  },
  {
    "title": "I Am A USAID Worker Who Lost My Job. Here's What Trump And Musk Aren't Telling You About The Cuts.",
    "description": "\"By eviscerating USAID, Trump and Elon Musk are redefining what it means to be American.\"",
    "link": "https://www.huffpost.com/entry/usaid-worker-cuts-job-lost_n_67e15ea4e4b0bd547770ef36",
    "timestamp": "2025-03-24T17:08:00Z"
  },
  {
    "title": "GOP Squabbling Shows Passing Trump’s Agenda Is Harder Than Doing Executive Orders",
    "description": "House and Senate Republicans are sniping at each other over tax cuts and cuts to Medicaid.",
    "link": "https://www.huffpost.com/entry/republican-budget-resolution-senate_n_67e17f42e4b0b3ae9e410fb5",
    "timestamp": "2025-03-24T17:07:46Z"
  },
  {
    "title": "Trump Demands That Colorado Take Down His Jowly Portrait",
    "description": "Trump demanded that Colorado take down his jowly portrait. On Truth Social, Trump claimed that artist Sarah Boardman ‘purposely distorted’ his image. But she actually tried to make him look ‘neutral,’ and her Obama and Bush portraits look similar.",
    "link": "http://nymag.com/intelligencer/article/trump-colorado-portrait-sarah-boardman.html",
    "timestamp": "2025-03-24T17:07:01Z"
  },
  {
    "title": "Veterans becoming face of Trump’s government cuts and Democrats’ resistance",
    "description": "Former service members have been acutely affected by the Republican president's actions, including layoffs at the Department of Veterans Affairs and a Pentagon purge of archives that documented military diversity.",
    "link": "https://www.pbs.org/newshour/politics/veterans-becoming-face-of-trumps-government-cuts-and-democrats-resistance",
    "timestamp": "2025-03-24T17:05:37Z"
  },
  {
    "title": "In sports, DEI is not a luxury item, but a necessity",
    "description": "PROVIDENCE, R.I. — When you work in the field of sport and play, it’s easy — convenient even — to insulate yourself from disruptions outside the arena, especially during March Madness. But in the last month, the disruptions have become too pronounced to ignor…",
    "link": "https://andscape.com/features/in-sports-dei-is-not-a-luxury-item-but-a-necessity/",
    "timestamp": "2025-03-24T17:03:53Z"
  },
  {
    "title": "Bay Area Democrat Holds Town Halls In Red-Leaning Districts",
    "description": "Congressman Ro Khanna heard from both Democrats and Republicans, frustrated by the actions of the Trump administration.",
    "link": "https://www.kqed.org/news/12032708/bay-area-democrat-holds-town-halls-in-red-leaning-districts",
    "timestamp": "2025-03-24T17:02:53Z"
  },
  {
    "title": "Trump’s Tariff ‘Liberation Day’ Is 9 Days Away: Here’s What To Know As Reciprocal Tariffs Loom",
    "description": "“Presumably something is going to happen,” but “the hard part is trying to figure out what precisely that might be,” UBS economists shrugged about Trump’s April 2 circling of the calendar.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/24/trumps-tariff-liberation-day-is-9-days-away-heres-what-to-know-as-reciprocal-tariffs-loom/",
    "timestamp": "2025-03-24T17:02:14Z"
  },
  {
    "title": "'Fake tough guy': J.D. and Usha Vance blasted for Greenland threat and 'aggressive' visit",
    "description": "Vice President JD Vance and Second Lady Usha Vance are launching a coordinated campaign targeting Greenland, the semi-autonomous Danish territory that President Donald Trump has repeatedly expressed interest in acquiring for the United States—despite firm res…",
    "link": "https://www.rawstory.com/fake-tough-guy-j-d-and-usha-vance-blasted-for-greenland-threat-and-aggressive-visit/",
    "timestamp": "2025-03-24T17:01:46Z"
  },
  {
    "title": "Trump expects the Fed to lower rates",
    "description": "United States President Donald Trump expects the US Federal Reserve to lower interest rates as soon as possible, per a statement during a cabinet meeting on Monday.His comment comes just a week after ...",
    "link": "https://biztoc.com/x/2c3458f8573808fb",
    "timestamp": "2025-03-24T17:01:40Z"
  },
  {
    "title": "Mia Love Cause of Death: First Black GOP Congresswoman Passes Away at 49",
    "description": "Reading Time: 3 minutesCongresswoman Mia Love has passed away the age of 49.\nMia Love Cause of Death: First Black GOP Congresswoman Passes Away at 49 was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/03/mia-love-cause-of-death-first-black-gop-congresswoman-passes-away-at-49/",
    "timestamp": "2025-03-24T17:01:36Z"
  },
  {
    "title": "Who is Alina Habba? Trump's loyal Attorney appointed as U.S. Attorney for New Jersey amid promises to reform justice system",
    "description": "Alina Habba, former Trump personal attorney and White House counselor, has been appointed interim U.S. Attorney for New Jersey by Donald Trump. Known for her loyalty and high-profile legal representation of Trump, including lawsuits against The New York Times…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-alina-habba-trumps-loyal-attorney-appointed-as-u-s-attorney-for-new-jersey-amid-promises-to-reform-justice-system/articleshow/119435810.cms",
    "timestamp": "2025-03-24T17:01:24Z"
  },
  {
    "title": "Fears of ad spend cuts grow as Sorrell and marketing leaders warn of Trump tariff turmoil",
    "description": "The S4 Capital boss today said uncertainty around tariffs would make for tough trading in 2025. He’s not the only one in marketing that’s concerned.Business was already tough enough for Sir Martin Sorrell before the will-they-won’t-they tariff saga began with…",
    "link": "https://www.thedrum.com/news/2025/03/24/fears-ad-spend-cuts-grow-sorrell-and-marketing-leaders-warn-trump-tariff-turmoil",
    "timestamp": "2025-03-24T17:01:00Z"
  },
  {
    "title": "Legal expert accuses 'judge shopping' Democrats of manipulating courts to derail Trump agenda",
    "description": "Fox News legal analyst Gregg Jarrett accused Democrats and liberal groups of seeking out sympathetic judges who are guaranteed to rule against President Trump's agenda.",
    "link": "https://www.foxnews.com/media/legal-expert-accuses-judge-shopping-democrats-manipulating-courts-derail-trump-agenda",
    "timestamp": "2025-03-24T17:00:54Z"
  },
  {
    "title": "U.S. and Russia Continue Saudi Arabia Talks for Ukraine Cease-Fire",
    "description": "US and Russian officials are holding talks in Saudi Arabia aimed at reaching a cease-fire deal in Ukraine. The negotiations on March 24 came a day after separate talks between the US and Ukraine which Kyiv called \"productive.\" The US-Russia talks are expected…",
    "link": "https://oilprice.com/Energy/Energy-General/US-and-Russia-Continue-Saudi-Arabia-Talks-for-Ukraine-Cease-Fire.html",
    "timestamp": "2025-03-24T17:00:00Z"
  },
  {
    "title": "‘U dodged a massive bullet’: Woman turns down older man at the gym. Then she sees what kind of car he gets into",
    "description": "There are fewer vehicles out on the road that get more hate than the Tesla Cybertruck. Some people dislike the car due to its \"dumpster\"-like design. Others have an issue with Tesla CEO Elon Musk. Despite what you may think of them, there's no questioning tha…",
    "link": "https://www.dailydot.com/news/cybertruck-dating-red-flag/",
    "timestamp": "2025-03-24T17:00:00Z"
  },
  {
    "title": "Trump to announce auto, aluminum and pharma tariffs ‘very soon’",
    "description": "Commerce Secretary Howard Lutnick added that on April 2, the U.S. will launch an “external revenue service” alongside the tariff measures.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-to-announce-auto-aluminum-and-pharma-tariffs-very-soon/article69370363.ece",
    "timestamp": "2025-03-24T16:59:58Z"
  },
  {
    "title": "\"No more loans to babies or the dead\": Elon Musk's DOGE backs SBA's crackdown on fraudulent loans",
    "description": "Elon Musk has thrown his weight behind the U.S. Small Business Administration's (SBA) new fraud-prevention policy, which now requires loan applicants to provide their date of birth. The Department of Government Efficiency (DOGE), Musk’s initiative to curb was…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-more-loans-to-babies-or-the-dead-elon-musks-doge-backs-sbas-crackdown-on-fraudulent-loans/articleshow/119435488.cms",
    "timestamp": "2025-03-24T16:59:56Z"
  },
  {
    "title": "Why Did Vanessa Trump Divorce Donald Trump Jr.? Their Split",
    "description": "Vanessa and Don Jr.'s high-profile divorce made headlines as infidelity rumors circulated for years.",
    "link": "https://hollywoodlife.com/feature/why-did-vanessa-trump-divorce-donald-trump-jr-5376380/",
    "timestamp": "2025-03-24T16:59:50Z"
  },
  {
    "title": "DHS Secretary Kristi Noem to visit El Salvador prison holding deported illegal aliens",
    "description": "'If you come to our country and break our laws, we will hunt you down, and lock you up'",
    "link": "https://www.wnd.com/2025/03/dhs-secretary-kristi-noem-to-visit-el-salvador-prison-holding-deported-illegal-aliens/",
    "timestamp": "2025-03-24T16:59:37Z"
  },
  {
    "title": "‘Quit Being a Coward!’ Chuck Grassley Gets an Earful About Trump and Musk at Heated Iowa Town Hall",
    "description": "Sen. Chuck Grassley (R-IA) faced an angry crowd at a town hall this past weekend in Hampton, Iowa, as constituents complained about recent actions by President Donald Trump and DOGE head Elon Musk and demanded their senator do more to oppose them.\nThe post ‘Q…",
    "link": "https://www.mediaite.com/politics/quit-being-a-coward-chuck-grassley-gets-an-earful-about-trump-and-musk-at-heated-iowa-town-hall/",
    "timestamp": "2025-03-24T16:59:17Z"
  },
  {
    "title": "Watch: Videos Show How Disney's 'Snow White' Bombed in Real Time: 'Hilariously Abysmal'",
    "description": "Disney's \"Snow White\" is churning out empty cinemas, according to X users who shared embarrassing photos showcasing the films screenings resulting in zero or one reserved seat in movie theaters. \"This is hilariously abysmal,\" one social media user said of the…",
    "link": "https://www.breitbart.com/entertainment/2025/03/24/watch-videos-show-how-disneys-snow-white-bombed-in-real-time-hilariously-abysmal/",
    "timestamp": "2025-03-24T16:58:23Z"
  },
  {
    "title": "Ivanka Trump Reacts To Trump World's Newest Romance",
    "description": "The first daughter reacted to Tiger Woods and Vanessa Trump's public debut in an Instagram comment.",
    "link": "https://www.huffpost.com/entry/ivanka-trump-tiger-woods-vanessa-trump-relationship-debut_n_67e178cce4b006252f73ad4e",
    "timestamp": "2025-03-24T16:57:47Z"
  },
  {
    "title": "Trende: The Democratic Party Is Still Standing Because Trump Is a One-Man Turnout Machine for Their Base",
    "description": "Thursday on the RealClearPolitics podcast, Tom Bevan, Carl Cannon, and Sean Trende looked at some interesting demographic trends reported by David Shor about the 2024 election results and what they suggest about the future of the Democratic Party.\n\n\"White vot…",
    "link": "https://www.realclearpolitics.com/video/2025/03/24/trende_the_reason_the_democratic_party_is_still_standing_is_trump_is_a_one_man_turnout_machine_for_their_base.html",
    "timestamp": "2025-03-24T16:56:42Z"
  },
  {
    "title": "Former Utah Rep. Mia Love, the first Black Republican woman elected to the US House, has died",
    "description": "Her daughter had said the former lawmaker was no longer responding to brain cancer treatment.",
    "link": "https://www.bostonherald.com/2025/03/24/obit-mia-love/",
    "timestamp": "2025-03-24T16:55:05Z"
  },
  {
    "title": "Protesters in Serbia rally against real estate project with Trump son-in-law Kushner",
    "description": "Thousands of protesters in Serbia have rallied against plans to turn a former army headquarters into a luxury complex",
    "link": "https://abcnews.go.com/International/wireStory/protesters-serbia-rally-real-estate-project-trump-son-120103342",
    "timestamp": "2025-03-24T16:54:39Z"
  },
  {
    "title": "IRS Braces for Huge Revenue Hit Thanks to Elon Musk’s DOGE",
    "description": "Elon Musk’s decision to take a chainsaw to the Internal Revenue Service is fast-tracking the agency for a steep decline in revenue.\r\nAbrupt, DOGE-directed staff cuts at the agency have sparked fears that U.S. tax revenue could plummet by 10 percent, or $500 b…",
    "link": "https://newrepublic.com/post/193093/irs-revenue-elon-musk-doge-cuts",
    "timestamp": "2025-03-24T16:53:42Z"
  },
  {
    "title": "THE TRASH REPORT: Marital Woes and Expensive Cheetos",
    "description": "Slip on your hazmat suit and dig in to this week's pile of hot goss.\n \n by Elinor Jones\n \n \n \n Hello sweet angel baby Trash Pandas, and welcome back to the Trash Report! It's me, Portland's Best Kept Secret™, Elinor Jones. Remember in Jerry Maguire when Tom C…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/03/24/47700060/the-trash-report-marital-woes-and-expensive-cheetos",
    "timestamp": "2025-03-24T16:53:00Z"
  },
  {
    "title": "‘We Are in an Emergency’: Progressive TikTok Star Launches Bid to Unseat Old Guard Dem",
    "description": "The progressive TikTok star is running for Congress in a Democratic district that hasn’t had a competitive primary in decades.",
    "link": "http://www.rollingstone.com/politics/politics-features/kat-abughazaleh-congress-1235301996/",
    "timestamp": "2025-03-24T16:52:58Z"
  },
  {
    "title": "Bomb Squad Finds 'Incendiary Devices' at Texas Tesla Dealership",
    "description": "The FBI recently issued a warning as protests against Tesla continue to be used to show opposition against the Trump admin.",
    "link": "https://www.newsweek.com/bomb-squad-finds-incendiary-devices-texas-tesla-dealership-2049720",
    "timestamp": "2025-03-24T16:52:15Z"
  },
  {
    "title": "Stock Market Today: Dow Jones Jumps, Tesla Roars On Trump Tariff News; Cathie Wood Buys This Stock Amid 53% Dive (Live Coverage)",
    "description": "The Dow Jones Industrial Average and other indexes surged on the stock market today as it appeared President Donald Trump would back off on some tariff plans. Tesla (TSLA), Nvidia (NVDA) and Palantir Technologies (PLTR) were among the biggest winners. Also, f…",
    "link": "https://biztoc.com/x/6bcafb978302b96a",
    "timestamp": "2025-03-24T16:50:59Z"
  },
  {
    "title": "Who Are the Three Judges on Appeals Panel in Trump Deportation Case?",
    "description": "A panel of three D.C. appeals court judges will hear arguments into whether a judge can block President Donald Trump from using the 1798 Alien Enemies Act to deport individuals believed to be part of a Venezuelan gang without due process.\nWhy It Matters\nThe T…",
    "link": "https://biztoc.com/x/9b083ab6ae36d834",
    "timestamp": "2025-03-24T16:50:21Z"
  },
  {
    "title": "Donald Trump Tells Clay Travis That Jeff Bezos Wants To Fix The Washington Post (Ian Miller/OutKick)",
    "description": "Ian Miller / OutKick:\nDonald Trump Tells Clay Travis That Jeff Bezos Wants To Fix The Washington Post  —  The 2024 presidential election changed nearly everything about American life, culture, and the prevailing political attitude.  —  President Donald Trump'…",
    "link": "https://www.memeorandum.com/250324/p73",
    "timestamp": "2025-03-24T16:50:01Z"
  },
  {
    "title": "Greenland condemns planned visits by Usha Vance and Trump adviser (James FitzGerald/BBC)",
    "description": "James FitzGerald / BBC:\nGreenland condemns planned visits by Usha Vance and Trump adviser  —  Greenland's politicians have condemned plans for high-profile US visits, in the wake of President Donald Trump's threats to take over the island.  —  Second Lady Ush…",
    "link": "https://www.memeorandum.com/250324/p72",
    "timestamp": "2025-03-24T16:50:01Z"
  },
  {
    "title": "‘I Don’t Agree’: Charlamagne, Co-Host Rail Against Dem Strategy To Resist Trump At All Costs",
    "description": "Radio hosts Charlamagne Tha God and DJ Envy criticized the Democratic Party's strategy to resist President Donald Trump's entire agenda.",
    "link": "https://dailycaller.com/2025/03/24/i-dont-agree-charlamagne-co-host-rail-against-dem-strategy-to-resist-trump-at-all-costs/",
    "timestamp": "2025-03-24T16:49:27Z"
  },
  {
    "title": "Tiger Woods-Vanessa Trump romance: Dave Portnoy slams golfer’s request for privacy",
    "description": "Dave Portnoy has slammed Tiger Woods’ post asking for privacy regarding his new relationship with Vanessa Trump. The businessman referenced Woods’ cheating scandals in an interview and said he has never been a fan of the golfing legend. Tiger Woods made his r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tiger-woods-vanessa-trump-romance-dave-portnoy-slams-golfers-request-for-privacy/articleshow/119435734.cms",
    "timestamp": "2025-03-24T16:49:22Z"
  },
  {
    "title": "China woos CEOs of big global companies against backdrop of US tariffs",
    "description": "China Development Forum in Beijing hears that the country is willing to open its market further to foreign investment",
    "link": "https://www.irishtimes.com/business/economy/2025/03/24/china-woos-ceos-of-big-global-companies-against-backdrop-of-us-tariffs/",
    "timestamp": "2025-03-24T16:49:19Z"
  },
  {
    "title": "Trump NatSec Adviser Accidentally Added The Atlantic’s Jeffrey Goldberg to a Group Chat About Secret War Plans",
    "description": "National Security Adviser Mike Waltz accidentally added The Atlantic's Jeffrey Goldberg to a groupchat in which the administration's war plans were discussed.\nThe post Trump NatSec Adviser Accidentally Added The Atlantic’s Jeffrey Goldberg to a Group Chat Abo…",
    "link": "https://www.mediaite.com/news/trump-natsec-adviser-accidentally-added-the-atlantics-jeffrey-goldberg-to-a-group-chat-about-secret-war-plans/",
    "timestamp": "2025-03-24T16:48:59Z"
  },
  {
    "title": "The 5 at 5: Monday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/five-at-five-monday-march-6658019-Mar2025/",
    "timestamp": "2025-03-24T16:48:33Z"
  },
  {
    "title": "Erdoğan optimistic on US-Türkiye ties after 'cordial' phone call",
    "description": "Turkish President Recep Tayyip Erdoğan has expressed optimism about the future of Türkiye-U.S. relations during a speech following a cabinet meeting in the capital Ankara on March 24, describing a recent phone call with U.S. President Donald Trump as “cordial…",
    "link": "https://www.hurriyetdailynews.com/erdogan-optimistic-on-us-turkiye-ties-after-cordial-phone-call-207288",
    "timestamp": "2025-03-24T16:48:18Z"
  },
  {
    "title": "Journalist stunned as Pete Hegseth inadvertently sends him top-secret war plans",
    "description": "The Atlantic's Jeffrey Goldberg had advance notice of a recent United States military strike against Houthi rebels in Yemen because he was inadvertently sent plans for the strike in a message from Defense Secretary Pete Hegseth.Goldberg writes that this massi…",
    "link": "https://www.rawstory.com/trump-houthi/",
    "timestamp": "2025-03-24T16:47:54Z"
  },
  {
    "title": "Judge who blocked Trump deportations took junket to event with anti-Trump speakers, sponsor",
    "description": "Months before he blocked President Donald Trump’s deportations of illegal alien gang members, U.S. District Court Judge James Boasberg attended a privately-funded legal conference in Idaho that featured sponsors and speakers who have expressed clear anti-Trum…",
    "link": "https://freerepublic.com/focus/f-news/4306447/posts",
    "timestamp": "2025-03-24T16:47:25Z"
  },
  {
    "title": "LARRY PROVOST: If King Charles Offers Trump Membership In Commonwealth, US Should Strongly Consider Joining",
    "description": "The idea is intriguing and one that, once the prejudice against it is sorted through, has tremendously positive implications for America and its members.",
    "link": "https://dailycaller.com/2025/03/24/opinion-king-charles-offers-trump-membership-commonwealth-larry-provost/",
    "timestamp": "2025-03-24T16:47:24Z"
  },
  {
    "title": "Judge declines to lift ban on Trump deportations under wartime powers",
    "description": "The ruling comes as the Trump administration seeks the judge's removal in an appeals court on Monday afternoon.",
    "link": "https://www.bbc.com/news/articles/cp3y03l1gvko",
    "timestamp": "2025-03-24T16:45:34Z"
  },
  {
    "title": "Who Are the Three Judges on Appeals Panel in Trump Deportation Case?",
    "description": "One Democratic-appointed judge and two GOP-appointed judges are hearing arguments into the case on Monday.",
    "link": "https://www.newsweek.com/three-judges-panel-trump-venezuela-deportation-case-2049691",
    "timestamp": "2025-03-24T16:43:38Z"
  },
  {
    "title": "Mexican cartel recruits allegedly killed for resisting training",
    "description": "A Mexican drug cartel allegedly tortured and killed recruits who refused to cooperate or tried to flee a training camp where bones and clothing were found, the government said Monday. So far, however, there is no evidence that the ranch in the western state o…",
    "link": "https://www.digitaljournal.com/world/mexican-cartel-recruits-allegedly-killed-for-resisting-training/article",
    "timestamp": "2025-03-24T16:42:20Z"
  },
  {
    "title": "Trump allies push WH to curb Elon Musk’s interviews after he called Social Security ‘the biggest Ponzi scheme of all time’",
    "description": "Though President Donald Trump has vowed that Social Security is not going anywhere, Elon Musk – the face of the government’s cost-slashing committee – has increasingly slammed the program during media interviews.",
    "link": "https://nypost.com/2025/03/24/business/trump-allies-urge-white-house-to-curb-elon-musks-media-interviews-report/",
    "timestamp": "2025-03-24T16:41:41Z"
  },
  {
    "title": "Trump’s Border Czar Admits He Doesn’t Care That He’s Breaking the Law",
    "description": "Border czar Tom Homan gave up the game on Donald Trump’s revenge scheme to rob noncitizens of their legal rights under the Alien Enemies Act.\r\nDuring a Sunday interview on ABC News’s This Week with Jonathan Karl, a sedated-sounding Homan struggled to answer q…",
    "link": "https://newrepublic.com/post/193095/donald-trump-border-czar-tom-homan-due-process",
    "timestamp": "2025-03-24T16:39:34Z"
  },
  {
    "title": "Trump: Auto tariffs coming soon, pharma to follow later",
    "description": "United States President Donald Trump said on Monday that the announcement regarding auto tariffs will be made very soon, just before pharmaceutical levies are imposed.Speaking at a cabinet meeting, th...",
    "link": "https://biztoc.com/x/d5e1224e583ff421",
    "timestamp": "2025-03-24T16:39:14Z"
  },
  {
    "title": "Trump and DOGE propel VA mental health system into turmoil | Honolulu Star-Advertiser",
    "description": "Late in February, as the Trump administration ramped up its quest to transform the federal government, a psychiatrist who treats veterans was directed to her new workstation — and was incredulous.",
    "link": "https://www.staradvertiser.com/2025/03/24/breaking-news/trump-and-doge-propel-va-mental-health-system-into-turmoil/",
    "timestamp": "2025-03-24T16:38:58Z"
  },
  {
    "title": "Bitcoin jumps 3% on reports that Trump will opt for fewer tariffs than expected",
    "description": "Bitcoin has gained 3% in the last 24 hours amid reports upcoming U.S. tariffs on its trading partners will be less dramatic than expected.\nThe original cryptocurrency climbed from $84,000 to $88,600 between Sunday and Monday morning, after reports over the we…",
    "link": "https://biztoc.com/x/efec20595e9d2bda",
    "timestamp": "2025-03-24T16:38:49Z"
  },
  {
    "title": "US government could face default risk as soon as July, analyst projects",
    "description": "The U.S. government will risk defaulting on some of its $36.6 trillion in debt sometime between mid-July and early October unless Congress acts to raise the ...",
    "link": "https://finance.yahoo.com/news/us-government-could-face-default-163754932.html",
    "timestamp": "2025-03-24T16:37:54Z"
  },
  {
    "title": "Weather balloon cuts threaten forecast accuracy",
    "description": "Reduced weather balloon launches raise concerns about America's ability to forecast severe weather events",
    "link": "https://www.wcvb.com/article/weather-balloon-launch-cuts-impact-forecasts/64273940",
    "timestamp": "2025-03-24T16:37:44Z"
  },
  {
    "title": "Weather balloon cuts threaten forecast accuracy",
    "description": "Reduced weather balloon launches raise concerns about America's ability to forecast severe weather events",
    "link": "https://www.kcra.com/article/weather-balloon-launch-cuts-impact-forecasts/64273940",
    "timestamp": "2025-03-24T16:37:40Z"
  },
  {
    "title": "Tiger Woods and Vanessa Trump Go Public With Relationship, Ask for Privacy",
    "description": "The confirmation of their relationship comes not long after they were spotted together.",
    "link": "https://www.complex.com/sports/a/backwoodsaltar/tiger-woods-vanessa-trump-go-public-relationship",
    "timestamp": "2025-03-24T16:37:01Z"
  },
  {
    "title": "GSA issues major changes to Multiple Awards Schedule program",
    "description": "Contracts that do not meet sales thresholds will be allowed to expire, among other changes introduced through a new initiative.",
    "link": "https://www.nextgov.com/acquisition/2025/03/gsa-issues-major-changes-multiple-awards-schedule-program/403986/",
    "timestamp": "2025-03-24T16:36:00Z"
  },
  {
    "title": "NASA Scraps Promise to Land ‘First Woman and Person of Color’ on the Moon",
    "description": "Under the new administration, the agency is moving away from promoting its efforts to diversify its Artemis crew.",
    "link": "https://gizmodo.com/nasa-scraps-promise-to-land-first-woman-and-person-of-color-on-the-moon-2000579744",
    "timestamp": "2025-03-24T16:35:30Z"
  },
  {
    "title": "Social Security Cuts Warning Issued by Republican: 'We're Not Being Honest'",
    "description": "Utah Senator John Curtis said politicians are \"not being honest\" about the future of Social Security in an interview on Monday.",
    "link": "https://www.newsweek.com/social-security-cuts-warning-issued-republican-2049673",
    "timestamp": "2025-03-24T16:34:11Z"
  },
  {
    "title": "Tom sub-Homan doesn't think immigrants are entitled to due process [Asinine]",
    "description": "Tom sub-Homan doesn't think immigrants are entitled to due process",
    "link": "https://www.fark.com/comments/13608294/Tom-sub-Homan-doesnt-think-immigrants-are-entitled-to-due-process",
    "timestamp": "2025-03-24T16:31:40Z"
  },
  {
    "title": "Trump Vows 25% ‘Secondary’ Tariff on Buyers of Venezuelan Oil",
    "description": "President Donald Trump on Monday threatened a 25% tariff on any nation purchasing oil and gas from Venezuela, ratcheting up his dispute with the Latin American country over immigration with a move that risks roiling the global energy trade.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-vows-25-secondary-tariff-on-buyers-of-venezuelan-oil",
    "timestamp": "2025-03-24T16:31:16Z"
  },
  {
    "title": "New York Times Hits Back At Trump's 'Intimidation Tactics' After Attacking Reporters",
    "description": "Trump slammed alleged “fake news hit pieces” while singling out reporters Peter Baker and Maggie Haberman for criticism.",
    "link": "https://www.huffpost.com/entry/new-york-times-trump-peter-baker-maggie-haberman_n_67d81c33e4b08db67385246b",
    "timestamp": "2025-03-24T16:31:10Z"
  },
  {
    "title": "Democrats on possible Biden political reemergence: 'his time has passed'",
    "description": "Democrats appear far from excited over possibility of former President Joe Biden re-entering the political arena, after Fox News confirmed the former president offered party leaders his help.",
    "link": "https://www.foxnews.com/politics/democrats-possible-biden-political-reemergence-his-time-has-passed",
    "timestamp": "2025-03-24T16:30:51Z"
  },
  {
    "title": "Walmart and Target Wrangling With Suppliers Following Tariffs",
    "description": "Walmart and Target are reportedly haggling with suppliers over proposed price hikes in the face of tariffs. As Reuters reported Monday (March 24), the outcome of these negotiations will decide when prices on products go up — and by how much — and could even d…",
    "link": "https://www.pymnts.com/news/retail/2025/walmart-and-target-wrangling-with-suppliers-following-tariffs/",
    "timestamp": "2025-03-24T16:30:43Z"
  },
  {
    "title": "Trump Taps Alina Habba as Interim U.S. Attorney for District of New Jersey",
    "description": "President Donald Trump has elevated Counselor to the President, Alina Habba, to serve as interim U.S. attorney for the District of New Jersey.\nThe post Trump Taps Alina Habba as Interim U.S. Attorney for District of New Jersey appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/24/trump-taps-alina-habba-as-interim-u-s-attorney-for-district-of-new-jersey/",
    "timestamp": "2025-03-24T16:30:32Z"
  },
  {
    "title": "Volodymyr Zelenskyy Defends His Stance During Oval Office Clash With Trump",
    "description": "White House envoy Steve Witkoff claimed the Ukrainian president disrespected Trump during the tense exchange last month.",
    "link": "https://www.huffpost.com/entry/volodymyr-zelenskyy-defends-clash-with-trump_n_67e168d6e4b08529e902b474",
    "timestamp": "2025-03-24T16:30:23Z"
  },
  {
    "title": "Contempt Of Court",
    "description": "I think lots of people know the kind of person who thinks they’re more clever than they really are. The kind of person who thinks that they can outwit the system by playing stupid games. The kind of person who thinks that this kind of beating the system is be…",
    "link": "https://www.techdirt.com/2025/03/24/contempt-of-court/",
    "timestamp": "2025-03-24T16:29:15Z"
  },
  {
    "title": "Rosie O’Donnell Tells Irish TV She Hopes Trump’s Election Victory Will ‘Be Investigated’",
    "description": "Rosie O’Donnell says she hopes there’s an investigation into Donald Trump’s victory in the 2024 election, saying “it’s curious to me” how Trump won every single swing state and beat Kamala Harris, who was filling stadiums while Trump “was not able to do that.…",
    "link": "https://freerepublic.com/focus/f-chat/4306442/posts",
    "timestamp": "2025-03-24T16:29:03Z"
  },
  {
    "title": "Taylor Swift and Travis Kelce's romance faces its biggest test yet because of Donald Trump",
    "description": "Taylor Swift and Travis Kelce&apos;s relationship might be facing its first major test. President Donald Trump&apos;s upcoming invitation to the Kansas City Chiefs to celebrate the",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/03/24/67e185e3e2704ede9b8b458d.html",
    "timestamp": "2025-03-24T16:28:06Z"
  },
  {
    "title": "Whoopi Goldberg Censored On ‘The View’ For Calling Out Republicans’ Lack Of “Cajones”",
    "description": "\"There are so many Republicans that have decided not to engage at all.\"",
    "link": "https://decider.com/2025/03/24/whoopi-goldberg-censored-view-calling-out-republicans-lack-cajones/",
    "timestamp": "2025-03-24T16:27:48Z"
  },
  {
    "title": "Trump slams Biden's chip act as 'disaster'",
    "description": "United States President Donald Trump on Monday referred to the Chips and Science Act enabled by his predecessor Joe Biden as a \"disaster,\" vowing he would \"bring chips back to America.\"More to come......",
    "link": "https://biztoc.com/x/810d35a7f7cea80f",
    "timestamp": "2025-03-24T16:27:42Z"
  },
  {
    "title": "'Snow White' has brutal box office opening weekend, fails to meet expectations despite huge budget",
    "description": "Disney's \"Snow White\" live-action remake earned $43 million in domestic ticket sales its opening weekend, making it one of the worst-performing live-action Disney adaptations ever.",
    "link": "https://www.foxnews.com/media/snow-white-has-brutal-box-office-opening-weekend-fails-meet-expectations-despite-huge-budget",
    "timestamp": "2025-03-24T16:26:55Z"
  },
  {
    "title": "Donald Trump revokes legal status for 530,000 Cubans and other nationalities in latest immigration crackdown",
    "description": "US President Donald Trump's administration will revoke the temporary legal status of 530,000 Cubans, Haitians, Nicaraguans and Venezuelans in the United States, according to a Federal Register notice, the latest expansion of his crackdown on immigration.",
    "link": "https://www.independent.ie/world-news/donald-trump-revokes-legal-status-for-530000-cubans-and-other-nationalities-in-latest-immigration-crackdown/a1605198695.html",
    "timestamp": "2025-03-24T16:26:44Z"
  },
  {
    "title": "The Guy Who Predicted the 2008 Crash Issues Warning About Elon Musk Torpedoing Federal Spending",
    "description": "Everyone's talking about recession indicators right now — which itself may be an augury of some kind. But if doom prophesying about the economy is your thing, why not hear what one of the guys who predicted the last major recession has to say? Danny Moses, wh…",
    "link": "https://futurism.com/danny-moses-warning-elon-musk",
    "timestamp": "2025-03-24T16:25:54Z"
  }
]