[
  {
    "title": "Tariff Stimulus Checks Are an Unserious Idea",
    "description": "President Donald Trump's proposal to deliver huge stimulus checks to many American households is the latest bit of fiscal fantasy to emerge from the White House.\nIn a post on Truth Social, Trump promised checks of $2,000 to low- and middle-income Americans, s…",
    "link": "https://biztoc.com/x/ed5065daebcddbc2",
    "timestamp": "2025-11-11T15:50:04Z"
  },
  {
    "title": "Trump downplays economic woes as partisan spin, saying, 'Costs are way down'",
    "description": "President Donald Trump continued to insist the economy is strong and even insisted polls showing Americans are feeling economic pain are \"fake.\"",
    "link": "https://abcnews.go.com/Politics/trump-downplays-economic-woes-partisan-spin-costs/story?id=127407410",
    "timestamp": "2025-11-11T15:49:33Z"
  },
  {
    "title": "Why is Donald Trump reaching out to Syria’s new president Ahmed al-Sharaa?",
    "description": "Syria’s jihadist-turned-president caps extraordinary transformation with White House visit",
    "link": "https://www.irishtimes.com/world/2025/11/11/why-is-donald-trump-reaching-out-to-syrias-new-president-ahmed-al-sharaa/",
    "timestamp": "2025-11-11T15:48:40Z"
  },
  {
    "title": "CNN’s Harry Enten Runs Through Horrific Numbers For Chuck Schumer",
    "description": "Harry Enten said that Senate Minority Leader Chuck Schumer's popularity stands at a record low for Democratic Senate leaders dating back to at least 1985.",
    "link": "https://dailycaller.com/2025/11/11/cnns-harry-enten-runs-through-horrific-numbers-for-chuck-schumer/",
    "timestamp": "2025-11-11T15:48:32Z"
  },
  {
    "title": "Trump Finally Reveals His Health Care Plan—and It’s Bad",
    "description": "Donald Trump should take his concepts of a plan back to the drawing board.",
    "link": "https://newrepublic.com/post/203018/donald-trump-reveals-health-care-plan",
    "timestamp": "2025-11-11T15:48:20Z"
  },
  {
    "title": "The War that Made the Fed; the Fed that Made the War",
    "description": "This post The War that Made the Fed; the Fed that Made the War appeared first on Daily Reckoning.\nIt’s Veterans’ Day, originally called “Armistice Day” to commemorate the end of the Great War (aka World War I) on Nov. 11, 1918. In this regard, it’s appropriat…",
    "link": "https://dailyreckoning.com/the-war-that-made-the-fed-the-fed-that-made-the-war/",
    "timestamp": "2025-11-11T15:47:49Z"
  },
  {
    "title": "Bank of England's Breeden says diluting stablecoin rules further could damage financial system",
    "description": "LONDON (Reuters) -Bank of England Deputy Governor Sarah Breeden on Tuesday warned that further diluting rules for stablecoins risked endangering financial...",
    "link": "https://finance.yahoo.com/news/bank-englands-breeden-says-diluting-154709522.html",
    "timestamp": "2025-11-11T15:47:09Z"
  },
  {
    "title": "Trump’s controversial 50 year mortgage plan",
    "description": "President Donald Trump has introduced a controversial new approach to address America’s housing affordability crisis by proposing 50-year mortgage loans that would extend traditional home financing by two decades. Federal Housing Finance Agency Director Bill …",
    "link": "https://rollingout.com/2025/11/11/trump-50-year-mortgage-plan/",
    "timestamp": "2025-11-11T15:46:10Z"
  },
  {
    "title": "‘He has no business sh***ing on them’: Pete Buttigieg goes to war with Trump over air-traffic controllers",
    "description": "'You FORCED me to inject an experimental dangerous drug into my body in order to keep my job and paycheck. You, sir, can sit down and shut up'",
    "link": "https://www.wnd.com/2025/11/he-has-no-business-shing-them-pete-buttigieg/",
    "timestamp": "2025-11-11T15:41:35Z"
  },
  {
    "title": "Now Trump Wants to Send in Troops to Save … a Shopping District?",
    "description": "What exactly does Donald Trump expect the National Guard to do about the state of commercial real estate?",
    "link": "https://newrepublic.com/post/203016/donald-trump-send-troops-shopping-district-chicago",
    "timestamp": "2025-11-11T15:40:26Z"
  },
  {
    "title": "Brian Kelly sues LSU over $54M buyout after school allegedly changes termination story: report",
    "description": "Brian Kelly had reportedly filed a lawsuit against LSU, accusing the school of trying to dodge his $54 million buyout by retroactively attempting to fire him for cause.",
    "link": "https://www.foxnews.com/sports/brian-kelly-sues-lsu-over-54m-buyout-after-school-allegedly-changes-termination-story-report",
    "timestamp": "2025-11-11T15:40:21Z"
  },
  {
    "title": "BBC must 'stand up for our journalism', Davie tells staff",
    "description": "Outgoing BBC director-general Tim Davie has told staff the corporation has to \"stand up for our journalism\", insisting it will control its own narrative which \"will not just be given by our enemies\".",
    "link": "https://www.rte.ie/news/2025/1111/1543396-bbc-tim-davie/",
    "timestamp": "2025-11-11T15:40:01Z"
  },
  {
    "title": "BBC apologizes as chiefs quit over editing of Trump speech",
    "description": "The BBC on Monday apologised for the editing of the program, which aired in October 2024 and spliced together sections of a speech Trump gave in Washington on January 6 2021, the day of the post-election riot at the US Capitol",
    "link": "https://www.bloomberg.com/news/articles/2025-11-09/bbc-leaders-announce-resignation-as-trump-editing-causes-turmoil",
    "timestamp": "2025-11-11T15:38:55Z"
  },
  {
    "title": "Trump doubles down on plan for 600,000 Chinese student visas despite MAGA backlash",
    "description": "President Donald Trump defends his plan to offer 600,000 visas to Chinese students during Fox News interview, facing criticism from conservative circles.",
    "link": "https://www.foxnews.com/politics/trump-doubles-down-plan-600000-chinese-student-visas-despite-maga-backlash",
    "timestamp": "2025-11-11T15:38:04Z"
  },
  {
    "title": "BBC crisis: Outgoing director general hits out at ‘weaponisation’ of criticisms",
    "description": "Tim Davie says narrative ‘will not just be given by our enemies’",
    "link": "https://www.irishtimes.com/world/uk/2025/11/11/bbc-crisis-outgoing-director-general-hits-out-at-weaponisation-of-criticisms/",
    "timestamp": "2025-11-11T15:37:58Z"
  },
  {
    "title": "Even With Trump Controversy, South Park’s Creators Have Not Faced Cancellation Danger",
    "description": "South Park Studios\nSouth Park has made some major changes with its latest seasons airing this year by officially introducing United States President Donald Trump into its animated world, and the creators behind it all have revealed that even with all of the c…",
    "link": "http://comicbook.com/tv-shows/news/even-with-trump-controversy-south-parks-creators-have-not-faced-cancellation-danger/",
    "timestamp": "2025-11-11T15:36:40Z"
  },
  {
    "title": "Swiss Billionaires Pivotal in Wooing Trump Ahead of Tariff Deal",
    "description": "As Switzerland closes in on a deal with the US to lower tariffs on the country, it will owe thanks to some of its richest executives who played a key role in wooing President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/swiss-billionaires-pivotal-in-wooing-trump-ahead-of-tariff-deal",
    "timestamp": "2025-11-11T15:35:12Z"
  },
  {
    "title": "Michelino Sunseri Pardoned By President Trump in Grand Teton Switchback-Cutting Case",
    "description": "The post Michelino Sunseri Pardoned By President Trump in Grand Teton Switchback-Cutting Case appeared first on iRunFar.\nMichelino Sunseri cleared of switchback-cutting charges by presidential pardon. \nMichelino Sunseri Pardoned By President Trump in Grand Te…",
    "link": "https://www.irunfar.com/michelino-sunseri-pardoned-by-president-trump-in-grand-teton-switchback-cutting-case#article",
    "timestamp": "2025-11-11T15:35:06Z"
  },
  {
    "title": "Tariff Stimulus Checks Are an Unserious Idea",
    "description": "The president's proposal to deliver huge stimulus checks to many American households is the latest bit of fiscal fantasy to emerge from the White House.",
    "link": "https://reason.com/2025/11/11/tariff-stimulus-checks-are-an-unserious-idea/",
    "timestamp": "2025-11-11T15:34:42Z"
  },
  {
    "title": "GOP's Redistricting Power Grab One Step Closer to Spectacularly Backfiring",
    "description": "President Donald Trump's push for mid-decade redistricting to prevent Republicans from losing control of the US House of Representatives appears to be on the verge of backfiring.The latest blow to Trump's nationwide redistricting efforts came in Utah, where D…",
    "link": "https://www.commondreams.org/news/trump-republican-redistricting-plan",
    "timestamp": "2025-11-11T15:33:38Z"
  },
  {
    "title": "Boston’s WGBH Has Fourth Round Of Layoffs This Year",
    "description": "“Fifteen employees were told that their positions were being eliminated, according to a statement from President and CEO Susan Goldberg. She cited the loss of federal funding and said that staff numbers were being reduced ‘as contracts and seasons end.’” – Bo…",
    "link": "https://www.boston.com/news/local-news/2025/11/07/gbh-lays-off-15-employees-in-fourth-wave-of-cuts-this-year/",
    "timestamp": "2025-11-11T15:33:00Z"
  },
  {
    "title": "With These 3 Bills, Arizona’s Biggs Salutes Veterans",
    "description": "Rep. Andy Biggs, R-Ariz., has introduced three bills intended to enhance the well-being of American veterans through improvements in burial procedures, oversight of the Department... Read More\nThe post With These 3 Bills, Arizona’s Biggs Salutes Veterans appe…",
    "link": "https://www.dailysignal.com/2025/11/11/with-these-3-bills-arizonas-biggs-salutes-veterans/",
    "timestamp": "2025-11-11T15:30:00Z"
  },
  {
    "title": "Flight cancellations inch up to 6% one day after Senate passes bill to end shutdown",
    "description": "Airlines are expected to cancel 6% of their flights at 40 high-traffic airports on Tuesday in compliance with the Federal Aviation Administration mandate amid the government shutdown, despite the Senate passing a preliminary agreement to end the impasse",
    "link": "https://www.nbcnews.com/business/travel/flight-cancellations-inch-6-one-day-senate-passes-bill-end-shutdown-rcna243180",
    "timestamp": "2025-11-11T15:29:39Z"
  },
  {
    "title": "ICE agents pose at 'The Bean' for photoshoot after Chicago suburb raids...",
    "description": "ICE agents pose at 'The Bean' for photoshoot after Chicago suburb raids...\r\n\n \n \n \n (Second column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Firefighter detained on the job speaks out after deportation: 'I feel betrayed'...",
    "link": "https://www.themirror.com/news/us-news/ice-agents-pose-the-bean-1497264",
    "timestamp": "2025-11-11T15:28:37Z"
  },
  {
    "title": "Republicans Face Epstein Reckoning...",
    "description": "Republicans Face Epstein Reckoning...\r\n\n \n \n \n (First column, 9th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Schumer stares down progressive fury over handling of shutdown...\r\nFight over hemp could delay reopening...",
    "link": "https://www.newsweek.com/republicans-jeffrey-epstein-reckoning-shutdown-end-looms-11027112",
    "timestamp": "2025-11-11T15:28:37Z"
  },
  {
    "title": "Trump Comments on Marjorie Taylor Greene",
    "description": "US President Donald Trump says Georgia Republican Representative Marjorie Taylor Greene has \"lost her way.\"\nAsked about criticism by Taylor Green that he's too focused on foreign policy and should focus more on affordability issues in the U.S., the president …",
    "link": "https://biztoc.com/x/198a24ad9296b24c",
    "timestamp": "2025-11-11T15:27:30Z"
  },
  {
    "title": "Utah Judge rejects Republican-drawn congressional map, adopts alternative creating Democratic-leaning district",
    "description": "The newly approved map gives Democrats a much stronger chance to flip a seat in a state that has not had a Democrat in Congress since early 2021.",
    "link": "https://www.pbs.org/newshour/politics/utah-judge-rejects-republican-drawn-congressional-map-adopts-alternative-creating-democratic-leaning-district",
    "timestamp": "2025-11-11T15:27:20Z"
  },
  {
    "title": "UC Berkeley Turning Point USA Event Draws Protests After Charlie Kirk’s Death",
    "description": "Hundreds clashed with police at UC Berkeley as protesters disrupted a Turning Point USA event held in memory of conservative activist Charlie Kirk.",
    "link": "https://www.kqed.org/news/12063406/uc-berkeley-turning-point-usa-event-draws-protests-after-charlie-kirks-death",
    "timestamp": "2025-11-11T15:27:12Z"
  },
  {
    "title": "Fox Host Corrects Trump on How Mortgages Work as He Touts 50-Year Plan",
    "description": "Donald Trump doesn’t seem to understand what the average mortgage looks like for Americans.",
    "link": "https://newrepublic.com/post/203020/fox-host-corrects-trump-mortgages-50-year-plan",
    "timestamp": "2025-11-11T15:26:18Z"
  },
  {
    "title": "US aircraft carrier moves into Latin America region, officials say",
    "description": "WASHINGTON (Reuters) -The Gerald Ford aircraft carrier strike group has moved into the Latin America region, two U.S. officials told Reuters on Tuesday, dramatically escalating a military buildup in the Caribbean that has stoked tensions with Venezuela. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/11/11/us-aircraft-carrier-moves-into-latin-america-region-officials-say",
    "timestamp": "2025-11-11T15:26:00Z"
  },
  {
    "title": "Confused Trump, 79, Demands Troop Deployment Over Fictional Shopping Center",
    "description": "President Donald Trump has threatened to deploy troops to Chicago over a distressed shopping center that does not exist. “The Miracle Mile Shopping Center in...",
    "link": "https://www.thedailybeast.com/president-donald-trump-79-demands-troop-deployment-over-fictional-chicago-shopping-center/",
    "timestamp": "2025-11-11T15:25:14Z"
  },
  {
    "title": "Scott Jennings Gets James Clyburn To Admit He Favors Judges Forcing Trump Into Spending Cash Congress Never Approved",
    "description": "Scott Jennings made James Clyburn admit he supported rulings by federal judges ordering President Donald Trump to fund SNAP benefits during the shutdown.",
    "link": "https://dailycaller.com/2025/11/11/scott-jennings-james-clyburn-judges-trump-congress-snap/",
    "timestamp": "2025-11-11T15:22:41Z"
  },
  {
    "title": "US Senate votes to end shutdown: Why Democrats are upset with Chuck Schumer",
    "description": "The Senate Democratic minority leader is being blamed for allowing centrist Democrats to abandon party cause.",
    "link": "https://www.aljazeera.com/news/2025/11/11/us-senate-votes-to-end-shutdown-why-democrats-are-upset-with-chuck-schumer",
    "timestamp": "2025-11-11T15:20:20Z"
  },
  {
    "title": "Trump Asks Supreme Court To Overturn $5 Million E. Jean Carroll Verdict",
    "description": "President Donald Trump has asked the U.S. Supreme Court to review a 2023 federal jury verdict that found him liable for sexually abusing and defaming writer E. Jean Carroll, according to CBS News.\nTrump is seeking to overturn the $5 million judgment, calling …",
    "link": "https://biztoc.com/x/65ef507b3a41c098",
    "timestamp": "2025-11-11T15:16:35Z"
  },
  {
    "title": "Is Trump renaming Veterans Day? He previously said it would be 'Victory Day for WWI’",
    "description": "President Trump had previously said Veterans Day should be renamed to “Victory Day for World War I.” He will be Arlington National Cemetery on Nov. 11",
    "link": "https://www.usatoday.com/story/news/politics/2025/11/11/donald-trump-veterans-day-victory-day/87143390007/",
    "timestamp": "2025-11-11T15:15:59Z"
  },
  {
    "title": "CNN’s Jake Tapper Mocks ‘Insane’ Trump Claim on Obamacare in Direct-to-Camera Rant",
    "description": "Tapper mocked Trump over an \"insane\" Obamacare claim in a direct-to-camera rant that included an explainer on \"stupid people\" believing their own expertise.\nThe post CNN’s Jake Tapper Mocks ‘Insane’ Trump Claim on Obamacare in Direct-to-Camera Rant first appe…",
    "link": "https://www.mediaite.com/media/news/cnns-jake-tapper-mocks-insane-trump-claim-on-obamacare-in-direct-to-camera-rant/",
    "timestamp": "2025-11-11T15:15:43Z"
  },
  {
    "title": "US House returns to Washington for vote to end government shutdown",
    "description": "WASHINGTON (Reuters) -Members of the House of Representatives returned to Washington on Tuesday, braving the nation's tangled airports for a vote that could bring the longest U.S. government shutdown in history to a close. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/11/us-house-returns-to-washington-for-vote-to-end-government-shutdown",
    "timestamp": "2025-11-11T15:14:00Z"
  },
  {
    "title": "Calls for ‘mano dura’ as crime-rattled Chile votes for president",
    "description": "A surge in violent crime looks set to dominate presidential elections Sunday in Chile, where the far-right is riding high with promises to crack down on transnational gangs and carry out mass migrant deportations.  A sharp increase in murders, kidnappings and…",
    "link": "https://www.digitaljournal.com/world/calls-for-mano-dura-as-crime-rattled-chile-votes-for-president/article",
    "timestamp": "2025-11-11T15:12:20Z"
  },
  {
    "title": "Calisthenics comeback: Is body weight enough to get a good workout?",
    "description": "Experts say calisthenics can improve everything from muscle strength to aerobic conditioning.",
    "link": "https://www.readingeagle.com/2025/11/11/calisthenics-workouts/",
    "timestamp": "2025-11-11T15:11:18Z"
  },
  {
    "title": "Calisthenics are making a comeback. Is body weight enough to get a good workout?",
    "description": "Experts say calisthenics can improve everything from muscle strength to aerobic conditioning.",
    "link": "https://www.bostonherald.com/2025/11/11/calisthenics-workouts/",
    "timestamp": "2025-11-11T15:10:12Z"
  },
  {
    "title": "Laura Ingraham Presses Trump On Allowing Flood Of Chinese Students Into US",
    "description": "Fox News' Laura Ingraham did not let President Donald Trump off the hook as she pressed him on allowing a flood of Chinese students to study in the U.S.",
    "link": "https://dailycaller.com/2025/11/11/laura-ingraham-trump-chinese-students-us-colleges/",
    "timestamp": "2025-11-11T15:10:05Z"
  },
  {
    "title": "Centrist Democrats say they had no choice but to craft a deal to end the shutdown. Progressives are fed up",
    "description": "Some progressives are renewing their calls for Democratic Senate leader Chuck Schumer to step aside, even as he publicly opposes the deal.",
    "link": "https://www.pbs.org/newshour/politics/centrist-democrats-say-they-had-no-choice-but-to-craft-a-deal-to-end-the-shutdown-progressives-are-fed-up",
    "timestamp": "2025-11-11T15:07:10Z"
  },
  {
    "title": "BBC Should Go The Way Of NPR After Trump J6 Speech Deceptive Edits Scandal",
    "description": "By Jarrett Stepman, The Daily Signal | November 10, 2025\nIt looks like there’s big, Trump-sized trouble in store for the BBC. On Monday, President Donald Trump threatened the government-funded British Broadcasting Corporation with a $1 billion lawsuit over it…",
    "link": "https://biztoc.com/x/d1509274827a3524",
    "timestamp": "2025-11-11T15:05:35Z"
  },
  {
    "title": "This man could have brought down Trump. There's no way to defend him",
    "description": "MSNBC’s Ken Dilanian recently discussed a new book\r\n that claims to reveal the nature of deliberations inside the US Department of Justice after the 2020 presidential election that “may have hampered the federal criminal investigations” of Donald Trump.In Inj…",
    "link": "https://www.rawstory.com/raw-investigates/merrick-garland/",
    "timestamp": "2025-11-11T15:04:22Z"
  },
  {
    "title": "“So Petty”: Sydney Sweeney And Zendaya’s “Bitter Feud” Escalates Over Latest Controversies",
    "description": "Once good friends who grew close on the set of ‘Euphoria,’ Sydney Sweeney and Zendaya seemed to have hit a rough patch because of Sydney’s recent controversies.",
    "link": "https://www.boredpanda.com/zendaya-sydney-sweeney-bitter-feud-over-alleged-ideological-differences/",
    "timestamp": "2025-11-11T15:03:25Z"
  },
  {
    "title": "India awaits US’ response to its trade proposal",
    "description": "India awaits a US response on its trade proposal, as both nations aim for a balanced bilateral agreement amidst key challenges.",
    "link": "https://www.thehindubusinessline.com/economy/india-awaits-us-response-to-its-trade-proposal/article70267854.ece",
    "timestamp": "2025-11-11T15:02:24Z"
  },
  {
    "title": "Sucky Funding Bill Also Enshrines Legalized Bribery, Kills Fun Dead",
    "description": "It would hurt if we weren't already completely dead inside.",
    "link": "https://www.wonkette.com/p/sucky-funding-bill-also-enshrines",
    "timestamp": "2025-11-11T15:02:17Z"
  },
  {
    "title": "12 far-right influencers targeting the LGBTQ+ community",
    "description": "The far-right movement of recent years has been significantly shaped by right-wing influencers -- podcasters, YouTubers, and other online pot-stirrers with increasingly extreme viewpoints. And many of these influencers regularly target LGBTQ+ people, opposing…",
    "link": "https://www.advocate.com/news/anti-lgbtq-far-right-influencers",
    "timestamp": "2025-11-11T15:02:01Z"
  },
  {
    "title": "Swing-state Democrats turn on 8 centrists not facing reelection over hijacked shutdown",
    "description": "“After 40 days, it wasn’t going to work,” longtime moderate Sen. Tim Kaine said of his fellow Democrats’ demands.",
    "link": "https://fortune.com/2025/11/11/democrats-infighting-leftist-centrist-2026-reelection-shutdown/",
    "timestamp": "2025-11-11T15:01:04Z"
  },
  {
    "title": "Bitcoin traders are still rattled after $340 billion wipeout",
    "description": "The token briefly topped $107,000 on Monday before slipping back below $105,000.",
    "link": "https://fortune.com/2025/11/11/bitcoin-traders-are-still-rattled-after-340-billion-wipeout/",
    "timestamp": "2025-11-11T15:00:28Z"
  },
  {
    "title": "No One Is Winning the YouTube TV Dispute With ESPN. It's Time for Both Sides To Call It Off.",
    "description": "Plus: Betting scandals come to baseball, and happy Veterans Day",
    "link": "https://sports.yahoo.com/article/no-one-winning-youtube-tv-150001485.html",
    "timestamp": "2025-11-11T15:00:01Z"
  },
  {
    "title": "Bill Maher & Cheryl Hines on Hollywood's 'Witch Hunt for People' Not 'Woke Enough,' 'Mean' Democrats, Trump's Anti-War Crusade",
    "description": "Comedian Bill Maher hosted Cheryl Hines on his Club Random podcast where he lamented that certain sections of Hollywood have pushed a blacklist for people not woke enough.",
    "link": "https://www.breitbart.com/entertainment/2025/11/11/bill-maher-to-cheryl-hines-theres-a-witch-hunt-for-people-not-woke-enough/",
    "timestamp": "2025-11-11T14:58:29Z"
  },
  {
    "title": "Financial market survey says Bank of Canada's next interest rate move will be a hike",
    "description": "Financial market participants believe the Bank of Canada will hold interest rates before raising them to 2.5% late in 2027. Read on",
    "link": "https://financialpost.com/news/economy/bank-of-canada-next-interest-rate-move-hike-survey",
    "timestamp": "2025-11-11T14:56:53Z"
  },
  {
    "title": "Softbank dumps its entire Nvidia portfolio worth $5.8 billion as its CEO goes all-in on OpenAI to the tune of $30 billion",
    "description": "Masayoshi Son, the 68-year-old CEO of SoftBank, has a mixed track record when it comes to massive, high-stakes investments.",
    "link": "https://finance.yahoo.com/news/softbank-dumps-entire-nvidia-portfolio-145532866.html",
    "timestamp": "2025-11-11T14:55:32Z"
  },
  {
    "title": "Softbank dumps its entire Nvidia portfolio worth $5.8 billion as its CEO goes all-in on OpenAI to the tune of $30 billion",
    "description": "Masayoshi Son, the 68-year-old CEO of SoftBank, has a mixed track record when it comes to massive, high-stakes investments.",
    "link": "https://fortune.com/2025/11/11/softbank-nvidia-openai-masayoshi-son-sam-altman-investment/",
    "timestamp": "2025-11-11T14:55:32Z"
  },
  {
    "title": "Outgoing Douglas County school board considers transgender athlete ban",
    "description": "The draft policy — a copy of the one adopted earlier this year by District 49 in El Paso County — only recognizes two genders: biological males and biological females.",
    "link": "https://www.denverpost.com/2025/11/11/douglas-county-school-district-transgender-athlete-ban/",
    "timestamp": "2025-11-11T14:55:29Z"
  },
  {
    "title": "Trump Asks Supreme Court To Take Up E. Jean Carroll's Defamation Case",
    "description": "Trump Asks Supreme Court To Take Up E. Jean Carroll's Defamation Case\n \nAuthored by Sam Dorman via The Epoch Times,\nPresident Donald Trump has asked the Supreme Court to wade into his defamation dispute with author E. Jean Carroll, alleging that an appeals co…",
    "link": "https://biztoc.com/x/76e1832ce61803c3",
    "timestamp": "2025-11-11T14:54:14Z"
  },
  {
    "title": "‘Unlike you, I can read’: House Dem delivers brutal putdown to 'racist' Trump attack",
    "description": "Rep. Ilhan Omar (D-MN) delivered a brutal putdown to President Donald Trump on Tuesday in response to the president’s attack on her the day before.In an interview with Fox News’ Laura Ingram that aired Monday, Trump aimed an onslaught at Omar and her country …",
    "link": "https://www.rawstory.com/trump-2674284828/",
    "timestamp": "2025-11-11T14:54:05Z"
  },
  {
    "title": "BBC Chief Urges Staff To “Fight For Truth” As Trump Threatens $1 Billion Lawsuit",
    "description": "Outgoing BBC Director-General Tim Davie urged staff to “fight for our journalism” on Tuesday amid political pressure and a looming $1 billion defamation threat from President Donald Trump, according to BBC News and CBS News reports.\nTrump’s legal team accused…",
    "link": "https://biztoc.com/x/88cb4a3f581f3832",
    "timestamp": "2025-11-11T14:53:55Z"
  },
  {
    "title": "UK balks at EU militarization demand – Bloomberg",
    "description": "The British government has reportedly rejected an EU demand to pay billions to join a scheme aimed at deterring an alleged Russian threat Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627645-uk-balks-eu-militarization-demand/",
    "timestamp": "2025-11-11T14:51:28Z"
  },
  {
    "title": "“Get back to work, NOW!!!”: Trump pressures unpaid controllers as FAA grounds thousands of flights",
    "description": "He called for a $10,000 bonus for those who’ve stayed on the job and suggested docking pay for those who haven’t.",
    "link": "https://fortune.com/2025/11/11/trump-pressures-airline-workers-to-work-without-pay-shutdown-chicago-new-york/",
    "timestamp": "2025-11-11T14:51:20Z"
  },
  {
    "title": "Russia says it is 'ready' to discuss US accusations of secret nuclear tests",
    "description": "MOSCOW: Russian Foreign Minister Sergei Lavrov said on Tuesday (Nov 11) that Moscow was \"ready\" to discuss with Washington accusations by President Donald Trump that it had carried out secret undergro",
    "link": "https://www.channelnewsasia.com/world/russia-us-accusations-secret-nuclear-tests-5460641",
    "timestamp": "2025-11-11T14:46:50Z"
  },
  {
    "title": "WH Staff Reportedly Irate With Housing Official Who Pitched Trump on 50-Year Mortgage Plan: ‘Doesn’t Know the First F*cking Thing’",
    "description": "A new report reveals that White House staffers are furious with a top housing official who pitched President Donald Trump on the idea of 50-year mortgages.\nThe post WH Staff Reportedly Irate With Housing Official Who Pitched Trump on 50-Year Mortgage Plan: ‘D…",
    "link": "https://www.mediaite.com/media/news/wh-staff-reportedly-irate-with-housing-official-who-pitched-trump-on-50-year-mortgage-plan-doesnt-know-the-first-fcking-thing/",
    "timestamp": "2025-11-11T14:46:03Z"
  },
  {
    "title": "'Blindsided' White House panics as Trump faces 'furious backlash from conservative allies'",
    "description": "Politico reports White House officials are furious with Federal Housing Finance Agency Director Bill Pulte for talking President Donald Trump into suggesting a 50-year mortgage plan, according to a report.“The White House was blindsided by the idea, according…",
    "link": "https://www.rawstory.com/blindsided-white-house-panics-as-trump-faces-furious-backlash-from-conservative-allies/",
    "timestamp": "2025-11-11T14:45:58Z"
  },
  {
    "title": "White House aides want an 'affordability' pivot. Does Trump? (MSNBC)",
    "description": "MSNBC:\nWhite House aides want an ‘affordability’ pivot.  Does Trump?  —  As White House advisers try to refocus on Americans' economic anxieties, there's one primary factor complicating that move: the president himself.  —  President Donald Trump is facing a …",
    "link": "https://www.memeorandum.com/251111/p35",
    "timestamp": "2025-11-11T14:45:01Z"
  },
  {
    "title": "Democrat Judges Pump Brakes On Trump Admin’s Crackdown On Illegal Migrant Truckers",
    "description": "A pair of Democrat-appointed judges have issued an administrative stay againstthe Department of Transportation's crackdown on illegal migrant truck drivers.",
    "link": "https://dailycaller.com/2025/11/11/dem-judges-pause-order-on-illegal-truckers/",
    "timestamp": "2025-11-11T14:44:01Z"
  },
  {
    "title": "EU Eyes Huawei Ban Over Half-Decade After Trump Flagged 'Security Danger'",
    "description": "EU Eyes Huawei Ban Over Half-Decade After Trump Flagged 'Security Danger'\n \nOnce again Donald Trump has proven himself light-years ahead of Europe in foreseeing major security issues and deep flaws in EU policy.\nIt was of course all the way back in President …",
    "link": "https://biztoc.com/x/8cd1308954122360",
    "timestamp": "2025-11-11T14:43:09Z"
  },
  {
    "title": "Laura Ingraham Asks Trump If 50-Year Mortgage Terms For Homebuyers Are ‘Really A Good Idea’",
    "description": "Fox News host Laura Ingraham asked President Donald Trump on Monday whether 50-year mortgage terms would actually benefit American homebuyers.",
    "link": "https://dailycaller.com/2025/11/11/laura-ingraham-trump-50-year-mortgage-homebuyers/",
    "timestamp": "2025-11-11T14:43:03Z"
  },
  {
    "title": "How the federal government hurt the economy: $11 billion vanishes with 1.25 million unpaid and 2,000 canceled flights",
    "description": "“Short-lived shutdowns are usually invisible in the data, but this one will leave a lasting mark,\" Gregory Daco, chief economist at accounting giant EY said.",
    "link": "https://fortune.com/2025/11/11/government-shutdown-impact-on-economy-unpaid-workers-flights-airlines/",
    "timestamp": "2025-11-11T14:37:39Z"
  },
  {
    "title": "As Shutdown Ends, Will Democrats’ Civil War Begin?",
    "description": "For the first time in decades, the Democrats have lost their bid to engineer a federal government shutdown, blame the Republicans for it, and win political concessions for doing so. Now that they’ve lost, they’re blaming moderates in their own party for the m…",
    "link": "https://freerepublic.com/focus/f-chat/4351921/posts",
    "timestamp": "2025-11-11T14:36:35Z"
  },
  {
    "title": "'Huge blunder': Famed pollster claims single decision turned America against Trump",
    "description": "Donald Trump has seen his approval rating slump after a \"huge blunder\" during the government shutdown.Pollster Nate Silver believes there's a clear reason behind the new low. RealClearPolling recorded a -8.9% drop in approval, while the Newsweek Tracker shows…",
    "link": "https://www.rawstory.com/donald-trump-approval-rating-2674284408/",
    "timestamp": "2025-11-11T14:36:21Z"
  },
  {
    "title": "Black Man Pardoned By Trump For 2020 ‘Fake Electors’ Scandal Wants Pardon From Federal Assault Charge",
    "description": "Harrison Floyd who was pardoned by Donald Trump for “fake electors” scandal to overturn the 2020 election\nThe post Black Man Pardoned By Trump For 2020 ‘Fake Electors’ Scandal Wants Pardon From Federal Assault Charge appeared first on Bossip.",
    "link": "https://bossip.com/4026936/man-pardoned-for-2020-election-scandal-wants-assault-pardon/",
    "timestamp": "2025-11-11T14:34:07Z"
  },
  {
    "title": "Punching Bag Schumer",
    "description": "A bipartisan vote advances a short-term spending bill, angering Democrats who say Schumer gave up leverage against Donald Trump.",
    "link": "https://reason.com/2025/11/11/punching-bag-schumer/",
    "timestamp": "2025-11-11T14:32:57Z"
  },
  {
    "title": "Trump Hails Syria's 'Strong' President After White House Talks",
    "description": "Syrian President Ahmed al-Sharaa secured additional sanctions relief and pledged to join a US-led coalition to defeat the Islamic State as he met with US President Donald Trump at the White House.\n“We want to see Syria be successful along with the rest of the…",
    "link": "https://biztoc.com/x/4e87b217b8edb1e4",
    "timestamp": "2025-11-11T14:31:57Z"
  },
  {
    "title": "Trump Literally Shushes Fox Host When She Asks About Affordability",
    "description": "Donald Trump clearly thinks voters are too stupid to understand what’s really happening.",
    "link": "https://newrepublic.com/post/203006/donald-trump-affordability-voters-economy",
    "timestamp": "2025-11-11T14:31:51Z"
  },
  {
    "title": "Supreme Court expected to rule on whether full SNAP payments must resume",
    "description": "Resuming the program is a piece of the legislation adopted by the Senate and now headed to the House on to reopen the federal government.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-expected-to-rule-on-whether-full-snap-payments-must-resume",
    "timestamp": "2025-11-11T14:30:20Z"
  },
  {
    "title": "Off-year election losses spark Republican concerns about redistricting (NBC News)",
    "description": "NBC News:\nOff-year election losses spark Republican concerns about redistricting  —  Inside the White House, however, Trump remains confident in his strategy to push new maps to insulate the Republican House majority in 2026.  —  President Donald Trump is con…",
    "link": "https://www.memeorandum.com/251111/p30",
    "timestamp": "2025-11-11T14:30:01Z"
  },
  {
    "title": "Democrats Score Big Win As Republican-Appointed Judge Tosses GOP Map In Deep Red State",
    "description": "A Utah judge on Monday struck down a Republican-drawn congressional map that would have secured all four of the state’s GOP-held U.S. House seats.",
    "link": "https://dailycaller.com/2025/11/11/democrats-score-big-win-as-republican-appointed-judge-tosses-gop-map-in-deep-red-state/",
    "timestamp": "2025-11-11T14:25:57Z"
  },
  {
    "title": "Serbian protesters vow to prevent real estate project linked to Trump son-in-law Kushner",
    "description": "Thousands of protesters in Serbia have formed a human shield around a bombed-out military complex, vowing to protect it from redevelopment",
    "link": "https://abcnews.go.com/International/wireStory/serbian-protesters-vow-prevent-real-estate-project-linked-127411934",
    "timestamp": "2025-11-11T14:22:02Z"
  },
  {
    "title": "Carol Leonnig & Ken Dilanian Talk About Covering A “Five-Alarm Fire” At DOJ, Protecting Sources Amid Trump Threats And Working At A Rebranded MS Now",
    "description": "MSNBC will rebrand as MS Now on Saturday, a reflection of the cable news network’s separation from Comcast and sister network NBC News. As the new Versant network sets out on its own, it has been building up its own newsroom, with two major hires with a focus…",
    "link": "http://deadline.com/2025/11/ms-now-carol-leonnig-ken-dilanian-trump-justice-department-1236611329/",
    "timestamp": "2025-11-11T14:21:45Z"
  },
  {
    "title": "‘TRUMP’ party launches in EU state",
    "description": "A new right-wing party named after US President Donald Trump has been launched in Belgium Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627618-belgium-new-party-trump/",
    "timestamp": "2025-11-11T14:20:25Z"
  },
  {
    "title": "China raises alarm over alleged US role in one of the largest Bitcoin hacks",
    "description": "After announcing the “largest forfeiture action” in the history of the DOJ, the US now faces questions about how it accessed the 127,271 Bitcoin stolen from the LuBian mining pool.",
    "link": "https://cointelegraph.com/news/china-raises-alarm-united-states-lubian-127k-bitcoin-hack",
    "timestamp": "2025-11-11T14:17:54Z"
  },
  {
    "title": "Europe has season finale in Dubai. PGA Tour goes to Bermuda and LPGA returns to Florida",
    "description": "Notes: The final tournament of the season for the top 50 in the Race to Dubai is effectively a two-man race between Rory McIlroy and Marco Penge. McIlroy has...",
    "link": "https://sports.yahoo.com/article/europe-season-finale-dubai-pga-141738998.html",
    "timestamp": "2025-11-11T14:17:38Z"
  },
  {
    "title": "How Nigeria’s grazing law also shapes land divisions and violence",
    "description": "Conflict over land, pastoral mobility and weak governance often overlap with religious fault lines, but can’t be reduced to them.",
    "link": "https://theconversation.com/how-nigerias-grazing-law-also-shapes-land-divisions-and-violence-268923",
    "timestamp": "2025-11-11T14:17:29Z"
  },
  {
    "title": "3 Bob Ross paintings to be auctioned off after funding cuts",
    "description": "Three original paintings by Bob Ross are set to be auctioned off Tuesday as part of a series to help raise money for public television stations after the Trump administration cut funding.",
    "link": "https://www.nbcnews.com/news/us-news/3-bob-ross-paintings-auctioned-funding-cuts-rcna243192",
    "timestamp": "2025-11-11T14:16:29Z"
  },
  {
    "title": "If the Supreme Court orders Trump to repay tariffs, U.S. importers say it wouldn't be 'messy'",
    "description": "U.S. Customs has collected nearly $200 billion in tariffs since the beginning of 2025. Supreme Court just raised concerns the process of repaying them.",
    "link": "https://www.cnbc.com/2025/11/11/trump-tariffs-trade-supreme-court-repayment.html",
    "timestamp": "2025-11-11T14:14:22Z"
  },
  {
    "title": "Trump Doubles Down Trashing Major Voter Gripe: Just ‘A Con Job By The Democrats’",
    "description": "The president argued during a recent Fox News interview that voters have been lied to about this widespread concern.",
    "link": "https://www.huffpost.com/entry/trump-doubles-down-major-voter-gripe-con-job-democrats_n_6913167ae4b0f8fc6ee40d85",
    "timestamp": "2025-11-11T14:13:33Z"
  },
  {
    "title": "Even Trump’s own team doesn’t believe his weird boasts about the economy",
    "description": "On the economy, Donald Trump has failed to convince his own economic team, which sees parts of the economy in recession.",
    "link": "https://biztoc.com/x/05f191a05cd8cdbb",
    "timestamp": "2025-11-11T14:10:04Z"
  },
  {
    "title": "Bessent Deflects Inflation Concerns, Sees Better Times in 2026",
    "description": "US Treasury Secretary Scott Bessent deflected concerns about high costs under President Donald Trump, saying the administration had inherited elevated price levels and that its policies would generate real income gains for American workers.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-deflects-inflation-concerns-sees-better-times-in-2026",
    "timestamp": "2025-11-11T14:08:06Z"
  },
  {
    "title": "WATCH: Jasmine Crockett spouts conspiracy theory about Republicans rigging midterm elections",
    "description": "'I think that they're trying to solidify their cheat potentially with the voting machines'",
    "link": "https://www.wnd.com/2025/11/watch-jasmine-crockett-spouts-conspiracy-theory-about-republicans/",
    "timestamp": "2025-11-11T14:07:41Z"
  },
  {
    "title": "'Significant chunk hates Trump': Conservative begs for scrapping of massive ego project",
    "description": "Donald Trump’s drive to get the new stadium being built for the NFL Washington Commanders named after himself was on the receiving end of a beat-down Tuesday morning from conservative columnist Jim Geraghty, who found himself wondering if he has ever heard of…",
    "link": "https://www.rawstory.com/trump-washington-stadium/",
    "timestamp": "2025-11-11T14:04:51Z"
  },
  {
    "title": "Trump asks Supreme Court to throw out E. Jean Carroll's $5 million win against him",
    "description": "President Trump is taking his last shot at overturning a jury decision that found him liable for sexually abusing and defaming writer E. Jean Carroll.",
    "link": "https://www.usatoday.com/story/news/politics/2025/11/11/trump-supreme-court-e-jean-carroll/86056626007/",
    "timestamp": "2025-11-11T14:02:59Z"
  }
]