[
  {
    "title": "US senators demand probe into Trump’s ‘drug boat’ strikes",
    "description": "US senators have urged to check whether the strikes on alleged drug vessels amount to war crimes Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628702-us-senators-boat-strikes-war-crimes/",
    "timestamp": "2025-11-30T23:50:33Z"
  },
  {
    "title": "The 'Free' World Is Coming for Your Private Messages",
    "description": "Nobody expects China or Iran to protect privacy. But as seen in the European debate over chat control, even nominally free countries are becoming intrusive when it comes to the digital world.",
    "link": "https://reason.com/2025/12/01/the-free-world-is-coming-for-your-private-messages/",
    "timestamp": "2025-11-30T23:49:24Z"
  },
  {
    "title": "Trump invites families of 2 National Guard members who were shot to White House",
    "description": "U.S. Army Spc. Sarah Beckstrom died after the Wednesday shooting in Washington, D.C., while her seriously injured colleague, U.S. Air Force Staff Sgt. Andrew Wolfe, remained in critical condition. The president said he's discussed a White House visit for the …",
    "link": "https://www.pbs.org/newshour/politics/trump-invites-families-of-2-national-guard-members-who-were-shot-to-white-house",
    "timestamp": "2025-11-30T23:45:48Z"
  },
  {
    "title": "‘Just the picture of health, isn’t he?’: Trump dozes off mid-meal at his golf club—and somewhere, Biden’s cackling to himself",
    "description": "‘Just the picture of health, isn’t he?’: Trump dozes off mid-meal at his golf club—and somewhere, Biden’s cackling to himselfnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4373496266600-just-the-picture-of-health-isn-t-he-trump-dozes-off-mid-meal-at-his-golf-club-and-somewhere-biden-s-cackling-to-himself?_f=app_share&amp;pd=09TzEAAl&amp;lang=en_US&amp;send_time=1764545845&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.47.0.44%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-30T23:37:55Z"
  },
  {
    "title": "Taiwan eyes Iron Dome-like defence against China",
    "description": "President announces historic increase in defence spending as Chinese aggression towards autonomous island escalates",
    "link": "https://theweek.com/defence/taiwan-iron-dome-missile-defence-system-china",
    "timestamp": "2025-11-30T23:35:25Z"
  },
  {
    "title": "Oil rises on OPEC+ output plan, Venezuela worries",
    "description": "PERTH, Dec 1 : Oil prices rose as much as 1.5 per cent on Monday after OPEC+ members reaffirmed a plan to pause production increases in the first quarter of next year and the prospect of U.S. action against oil producer Venezuela unsettled the market.Brent cr…",
    "link": "https://www.channelnewsasia.com/business/oil-rises-opec-output-plan-venezuela-worries-5498701",
    "timestamp": "2025-11-30T23:34:07Z"
  },
  {
    "title": "Trump says he'll release MRI results; he doesn't know what part of his body was scanned",
    "description": "President Donald Trump said Sunday that he would release the results of his MRI test that he received in October.  “If you want to have it released, I’ll...",
    "link": "https://www.yahoo.com/news/articles/trump-says-hell-release-mri-233348721.html",
    "timestamp": "2025-11-30T23:33:48Z"
  },
  {
    "title": "China factory activity slumps for longest stretch on record",
    "description": "A diplomatic spat with Japan in recent weeks has added to trade uncertainty. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/china-factory-activity-slumps-for-longest-stretch-on-record",
    "timestamp": "2025-11-30T23:32:30Z"
  },
  {
    "title": "Trump Grilled About Pardoning Ex-Honduran President: Why Would You Pardon a ‘Notorious Drug Trafficker?’",
    "description": "President Donald Trump was grilled about his decision to pardon former president of Honduras and convicted drug trafficker Juan Orlando Hernandez.\nThe post Trump Grilled About Pardoning Ex-Honduran President: Why Would You Pardon a ‘Notorious Drug Trafficker?…",
    "link": "https://www.mediaite.com/politics/trump-grilled-about-pardoning-ex-honduran-president-why-would-you-pardon-a-notorious-drug-trafficker/",
    "timestamp": "2025-11-30T23:32:14Z"
  },
  {
    "title": "Trump 'Wouldn't Have Wanted' Second Strike on Venezuela Boat",
    "description": "President Donald Trump said that Defense Secretary Pete Hegseth assured him he did not order the deaths of survivors in a strike.",
    "link": "https://biztoc.com/x/6d9a907622381519",
    "timestamp": "2025-11-30T23:28:25Z"
  },
  {
    "title": "National Guard shooting suspect radicalized in U.S., homeland secretary head says",
    "description": "U.S. authorities believe the Afghan immigrant accused of ambushing National Guard members in Washington, D.C., was not radicalized until after he came to the United States, Homeland Security Secretary Kristi Noem said on Sunday. Speaking on NBC's &quot;Meet t…",
    "link": "https://japantoday.com/category/world/national-guard-shooting-suspect-radicalized-in-us-homeland-secretary-says1",
    "timestamp": "2025-11-30T23:18:38Z"
  },
  {
    "title": "Trump commutes 7-year prison sentence for private equity exec convicted in scheme to defraud more than 10,000 investors",
    "description": "President Donald Trump has commuted the prison sentence of former investment manager David Gentile, who was convicted of defrauding investors — the latest in a series of clemency actions Trump has taken in white-collar criminal cases.\nGentile had reported to …",
    "link": "https://biztoc.com/x/13fe710e40babd51",
    "timestamp": "2025-11-30T23:17:37Z"
  },
  {
    "title": "Donald Trump had major losses in the “only number he cares about,” according to an inauspicious new poll.",
    "description": "Donald Trump was mocked for setting a new low in the polls with a key demographic on Sunday. “When you look at those overall poll numbers, you’ve got to go...",
    "link": "https://www.thedailybeast.com/trump-feeling-the-impact-with-record-low-polling-in-key-group/",
    "timestamp": "2025-11-30T23:17:09Z"
  },
  {
    "title": "As Tampon Tim Panics, Insiders Accuse Him of Ignoring Fraud While Millions Flow to Terror",
    "description": "A group of over 400 Minnesota Department of Human Services employees has turned the spotlight on Governor Tim Walz, charging that his administration turned a blind eye to rampant fraud draining the state’s coffers. In a blunt statement on X, the workers decla…",
    "link": "https://freerepublic.com/focus/f-bloggers/4355365/posts",
    "timestamp": "2025-11-30T23:15:00Z"
  },
  {
    "title": "Trump Downplays Venezuelan Airspace Threat as US Mulls New Steps (Josh Wingrove/Bloomberg)",
    "description": "Josh Wingrove / Bloomberg:\nTrump Downplays Venezuelan Airspace Threat as US Mulls New Steps  —  President Donald Trump said Sunday that people shouldn't read much into a social media post where he said Venezuelan airspace should be considered closed.  —  His …",
    "link": "https://www.memeorandum.com/251130/p51",
    "timestamp": "2025-11-30T23:15:00Z"
  },
  {
    "title": "‘He Said He Didn’t Do it’: Trump Confronted Over Report Pete Hegseth Ordered Killings Of Suspected Drug Boat Crew",
    "description": "President Trump said he believed Pete Hegseth was telling the truth when he denied telling Seal Team 6 to strike at an alleged drug boat for a second time.\nThe post ‘He Said He Didn’t Do it’: Trump Confronted Over Report Pete Hegseth Ordered Killings Of Suspe…",
    "link": "https://www.mediaite.com/politics/he-said-he-didnt-do-it-trump-confronted-over-report-pete-hegseth-ordered-killings-of-suspected-drug-boat-crew/",
    "timestamp": "2025-11-30T23:12:44Z"
  },
  {
    "title": "'Fu*king Doorknob': Mace Blasted For Taking Credit For Bill She Voted Against",
    "description": "South Carolina GOP Rep. Nancy Mace is a very unserious, and insufferable politician. She's gone from stating in 2023 that she was \"pro-transgender rights\" and \"pro-LGBTQ\" to quickly changing her role to Chief of Police of bathrooms. Mace has blasted Joe Biden…",
    "link": "https://crooksandliars.com/2025/11/fuking-doornob-mace-blasted-taking-credit",
    "timestamp": "2025-11-30T23:08:26Z"
  },
  {
    "title": "Over Half of Childless Women Do Not Want to Become Moms",
    "description": "When asked if they possess a \"desire to have children,\" only 40 percent of women under 50 said \"definitely\" or \"probably.\"",
    "link": "https://www.westernjournal.com/half-childless-women-not-want-become-moms/",
    "timestamp": "2025-11-30T23:06:44Z"
  },
  {
    "title": "Ukraine peace talks productive as ex-government official says country rethinking 'uncompromising' stance",
    "description": "Peace negotiations between Ukraine and the U.S. advance in Florida after Andriy Yermak's resignation, with Rustem Umerov now leading Ukraine's diplomatic team.",
    "link": "https://www.foxnews.com/world/ukraine-peace-talks-productive-ex-government-official-says-country-rethinking-uncompromising-stance",
    "timestamp": "2025-11-30T23:04:28Z"
  },
  {
    "title": "Venezuela and the world will be far better off with the Maduro regime GONE",
    "description": "Exactly what Team Trump intends to do with (or to) Venezuela is far from clear, but it clearly wants the Maduro regime gone ASAP, and with excellent reason.",
    "link": "https://nypost.com/2025/11/30/opinion/venezuela-and-the-world-will-be-far-better-off-with-the-maduro-regime-gone/",
    "timestamp": "2025-11-30T23:04:19Z"
  },
  {
    "title": "Trump’s callous response to soldier’s death sparks fury",
    "description": "President Donald Trump sparked widespread outrage after responding to questions about a fallen National Guard member’s funeral by pivoting to self-promotional remarks about his election performance. The jarring disconnect between the tragedy at hand and his p…",
    "link": "https://rollingout.com/2025/11/30/trumps-tone-deaf-response-to-tragedy/",
    "timestamp": "2025-11-30T23:04:02Z"
  },
  {
    "title": "‘Just the picture of health, isn’t he?’: Trump dozes off mid-meal at his golf club—and somewhere, Biden’s cackling to himself",
    "description": "‘Just the picture of health, isn’t he?’: Trump dozes off mid-meal at his golf club—and somewhere, Biden’s cackling to himselfnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4373496266600-just-the-picture-of-health-isn-t-he-trump-dozes-off-mid-meal-at-his-golf-club-and-somewhere-biden-s-cackling-to-himself?s=a2&amp;share_destination_id=MTY2MjgyNjMxLTE3NjQ1NDM2MzM2Mjc%3D&amp;pd=0BFhhvIM&amp;hl=en_US&amp;send_time=1764543633&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.46.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-30T23:01:00Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Homeland Security Secretary Kristi Noem said on NBC News’ “Meet the Press” Sunday that authorities believe the suspect in the National Guard shooting was radicalized in the U.S.Rahmanullah Lakanwal came to the U.S. in 2021, during the Biden administration, bu…",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-november-30-rcna246364",
    "timestamp": "2025-11-30T23:00:42Z"
  },
  {
    "title": "Dow Jones Futures Due; Trump Says He's Made Fed Chief Decision",
    "description": "Dow Jones futures will open Sunday evening, along with S&P 500 futures and Nasdaq futures. President Donald Trump said Sunday that he's picked his next Federal Reserve chairman and will make his announcement soon. The stock market rally had a powerful, holida…",
    "link": "https://biztoc.com/x/301675f383e88b8c",
    "timestamp": "2025-11-30T22:55:19Z"
  },
  {
    "title": "Florida GOP primary shaping up into a test of Trump's lasting influence",
    "description": "Florida's gubernatorial race is getting messy despite President Donald Trump's early endorsement of a favored candidate.The president's endorsement of MAGA loyalist Rep. Byron Donalds (R-LF) didn't clear the Republican field quite as expected, and the GOP pri…",
    "link": "https://www.rawstory.com/florida-republican-primary-2026/",
    "timestamp": "2025-11-30T22:55:05Z"
  },
  {
    "title": "Lawmakers sound alarm over report on Hegseth’s boat strike order — ‘This rises to the level of a war crime if it’s true’",
    "description": "The Washington Post reported that Defense Secretary Pete Hegseth issued a verbal order for all crew members to be killed as part of a Sept. 2 attack.",
    "link": "https://fortune.com/2025/11/30/lawmakers-pete-hegseth-boat-strike-order-drugs-venezuela-war-crime/",
    "timestamp": "2025-11-30T22:52:49Z"
  },
  {
    "title": "Trump Says He's Picked Next Fed Chief, Will Make Announcement Soon",
    "description": "President Donald Trump said Sunday that he's picked his next Federal Reserve chairman and will make his announcement soon. Markets are betting it'll be Kevin Hassett, director of Trump's National Economic Council.\nThe post Trump Says He's Picked Next Fed Chie…",
    "link": "https://biztoc.com/x/ea762beccfdb6567",
    "timestamp": "2025-11-30T22:44:15Z"
  },
  {
    "title": "The MAGA/America 1st Memorandum ~~ December 2025 Edition",
    "description": "A Very Merry December, MAGAdonians ... ... bad guys, not so much",
    "link": "https://freerepublic.com/focus/f-news/4355362/posts",
    "timestamp": "2025-11-30T22:39:06Z"
  },
  {
    "title": "Armed men kidnap 13 women in Nigeria’s latest abduction",
    "description": "A bride, 10 bridesmaids, a baby and two women were kidnapped during a night raid in Sokoto State.",
    "link": "https://www.aljazeera.com/news/2025/11/30/armed-men-kidnap-13-women-in-nigerias-latest-abduction",
    "timestamp": "2025-11-30T22:27:17Z"
  },
  {
    "title": "U.S. and Ukrainian officials hold 'very productive' meeting in Florida",
    "description": "Top U.S. officials and a Ukrainian delegation met in Florida on Sunday for the latest round of discussions on a plan to end Russia's war in Ukraine — talks both sides described positively but provided no details and took no questions.\"Much work remains, but t…",
    "link": "https://www.nbcnews.com/politics/trump-administration/us-ukrainian-officials-hold-productive-meeting-florida-rcna246598",
    "timestamp": "2025-11-30T22:22:05Z"
  },
  {
    "title": "What is driving US President’s Trump’s actions against Venezuela?",
    "description": "Donald Trump declared Venezuela's airspace 'closed' on Saturday.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/11/30/what-is-driving-us-presidents-trumps-actions-against-venezuela",
    "timestamp": "2025-11-30T22:21:03Z"
  },
  {
    "title": "‘Stay Tuned For Right After Thanksgiving!’ Kash Patel Says FBI Has ‘Numerous Options to Pursue’ On Dismissed Comey Case",
    "description": "Kash Patel warned that he wasn't quite done with the prosecution of his predecessor, James Comey, after a federal judge dismissed the perjury case against him.\nThe post ‘Stay Tuned For Right After Thanksgiving!’ Kash Patel Says FBI Has ‘Numerous Options to Pu…",
    "link": "https://www.mediaite.com/politics/stay-tuned-for-right-after-thanksgiving-kash-patel-says-fbi-has-numerous-options-to-pursue-on-dismissed-comey-case/",
    "timestamp": "2025-11-30T22:19:42Z"
  },
  {
    "title": "Trump shares post claiming Afghans would behead anyone who showed them a NESPRESSO machine",
    "description": "President Donald Trump shared a social media post claiming Afghans would 'chop off your head' and 'assume you were a witch' if you showed them a Nespresso machine. Robert O'Neill, the Navy Seal veteran who claimed to have killed Osama bin Laden, shared a post…",
    "link": "https://freerepublic.com/focus/f-chat/4355361/posts",
    "timestamp": "2025-11-30T22:19:34Z"
  },
  {
    "title": "GOP Senator Defends Trump Pardoning Honduran President Convicted Of Drug Trafficking",
    "description": "“There was a direct message,” Sen. Markwayne Mullin (R-Okla.) said.",
    "link": "https://www.huffpost.com/entry/markwayne-mullin-defends-trump-former-honduran-president-pardon_n_692c8ecbe4b05a7b18769319",
    "timestamp": "2025-11-30T22:16:25Z"
  },
  {
    "title": "Trump confirms he spoke with Venezuela's Maduro",
    "description": "WASHINGTON, Nov 30 (Reuters) - U.S. President Donald Trump confirmed on Sunday that he had spoken with Venezuela's Nicolas Maduro, but did not provide details on what the two leaders discussed. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/01/trump-confirms-he-spoke-with-venezuela039s-maduro",
    "timestamp": "2025-11-30T22:16:00Z"
  },
  {
    "title": "Ticker: China’s factory activity contracts; Trump commutes prison sentence for former private equity executive",
    "description": "China’s factory activity contracted for the eighth straight month in November, according to an official survey on Sunday, underscoring challenges for the country’s economy despite the U.S.-China trade truce.",
    "link": "https://www.bostonherald.com/2025/11/30/ticker-chinas-factory-activity-contracts-trump-commutes-prison-sentence-for-former-private-equity-executive/",
    "timestamp": "2025-11-30T22:11:38Z"
  },
  {
    "title": "Ex-CIA station chief warns Putin using talks to gain leverage as Ukraine delegation meets top Trump officials",
    "description": "Former CIA Moscow station chief warns Putin may use Ukraine negotiations for battlefield advantage rather than genuine peace, citing Russia's unchanged goals.",
    "link": "https://www.foxnews.com/media/ex-cia-station-chief-warns-putin-using-talks-gain-leverage-ukraine-delegation-meets-top-trump-officials",
    "timestamp": "2025-11-30T22:00:51Z"
  },
  {
    "title": "‘Sources’ tell CNN Hegseth Ordered Survivors of Drug Boat Strike to be Killed",
    "description": "\"The US military was aware there were survivors in the water following the first strike on September 2 and carried out another to both sink the vessel and kill the remaining crew, the sources said.\"\nThe post ‘Sources’ tell CNN Hegseth Ordered Survivors of Dru…",
    "link": "https://legalinsurrection.com/2025/11/sources-tell-cnn-hegseth-ordered-survivors-of-drug-boat-strike-to-be-killed/",
    "timestamp": "2025-11-30T22:00:12Z"
  },
  {
    "title": "Trump confirms call with Maduro",
    "description": "United States President Donald Trump confirmed on Sunday he spoke by phone with Venezuelan President Nicolas Maduro.\nHe offered no further details, telling reporters only that the conversation took p...",
    "link": "https://biztoc.com/x/aed57280c9300aef",
    "timestamp": "2025-11-30T21:59:32Z"
  },
  {
    "title": "Trump makes 11th-hour plea for Matt Van Epps over Aftyn Behn, whom he claims 'hates Christianity'",
    "description": "President Donald Trump urged Tennessee voters to support Matt Van Epps in Dec. 2 special election, attacking Democratic state representative Aftyn Behn.",
    "link": "https://www.foxnews.com/politics/trump-makes-11th-hour-plea-matt-van-epps-over-aftyn-behn-whom-he-claims-hates-christianity",
    "timestamp": "2025-11-30T21:58:15Z"
  },
  {
    "title": "US is already fighting war with Venezuela’s traffickers — and it’s even deadlier than Vietnam, Sen. McCormick says",
    "description": "The US is already facing a war from Venezuelan drug traffickers and narco-terrorists who are helping to smuggle fentanyl, opioids, cocaine and more into America, Sen. Dave McCormick warned on Sunday.",
    "link": "https://nypost.com/2025/11/30/us-news/us-is-already-fighting-war-with-venezuelas-traffickers-and-its-even-deadlier-than-vietnam-sen-mccormack-says/",
    "timestamp": "2025-11-30T21:55:51Z"
  },
  {
    "title": "Trump decision could cost residents thousands in MAGA stronghold",
    "description": "President Donald Trump made a decision that's hurting residents in a stronghold of support that helped propel him to re-election.The president denied disaster aid Oct. 22 to two electric utilities in rural northern Michigan – where his support has historicall…",
    "link": "https://www.rawstory.com/trump-michigan-disaster/",
    "timestamp": "2025-11-30T21:49:35Z"
  },
  {
    "title": "New report examines how David Sacks might profit from Trump administration role",
    "description": "David Sacks’ role as President Donald Trump’s artificial intelligence and crypto czar could work out very well for his investments, as well as his friends, according to a new report The New York Times.\nHowever, Sacks fired back in a post on X, in which he des…",
    "link": "https://biztoc.com/x/38f14f25d77b3d4d",
    "timestamp": "2025-11-30T21:48:22Z"
  },
  {
    "title": "Exclusive -- Nate Morris: Race to Replace Mitch McConnell 'Final Boss' for 'MAGA to Live on for Generations'",
    "description": "Kentucky Senate Republican candidate Nate Morris said on Breitbart News Saturday that the race to replace the outgoing Sen. Mitch McConnell (R-KY) is the \"final boss\" for MAGA to live on for generations.\nThe post Exclusive — Nate Morris: Race to Replace Mitch…",
    "link": "https://www.breitbart.com/politics/2025/11/30/exclusive-nate-morris-race-to-replace-mitch-mcconnell-final-boss-for-maga-to-live-on-for-generations/",
    "timestamp": "2025-11-30T21:47:41Z"
  },
  {
    "title": "New report examines how David Sacks might profit from Trump administration role | TechCrunch",
    "description": "David Sacks’ role as President Donald Trump’s artificial intelligence and crypto czar could work out very well for his investments, according to a new report. However, Sacks fired back, calling the story a \"nothing burger.\"",
    "link": "https://techcrunch.com/2025/11/30/new-report-examines-how-david-sacks-might-profit-from-trump-administration-role/",
    "timestamp": "2025-11-30T21:41:41Z"
  },
  {
    "title": "WATCH: Trump Drains Chip Shot in Front of Brooks Koepka: 'Winning Is Always Nice'",
    "description": "The 47th president, wearing his trademark red MAGA hat and white golf shirt, took to the links on Saturday in a foursome that included five-time major winner Brooks Koepka, hockey legend Wayne Gretzky, and Fox News anchor Bret Baier.\nThe post WATCH: Trump Dra…",
    "link": "https://www.breitbart.com/politics/2025/11/30/watch-trump-impresses-brooks-koepka-with-superb-chip-shot-winning-is-always-nice/",
    "timestamp": "2025-11-30T21:39:18Z"
  },
  {
    "title": "New report examines how David Sacks might profit from Trump administration role",
    "description": "David Sacks’ role as President Donald Trump’s artificial intelligence and crypto czar could work out very well for his investments, according to a new report...",
    "link": "https://finance.yahoo.com/news/report-examines-david-sacks-might-213904399.html",
    "timestamp": "2025-11-30T21:39:04Z"
  },
  {
    "title": "Donald Trump not well? Mar-a-Lago photo sparks concern as calls grow for MRI results and Biden comparison trends",
    "description": "Donald Trump not well? Mar-a-Lago photo sparks concern after a new picture from the Florida club shows him with closed eyes and open mouth. Social media users question his health and ask for MRI results. Comparisons with Joe Biden in Nantucket intensify the d…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-not-well-mar-a-lago-photo-sparks-concern-as-calls-grow-for-mri-results-and-biden-comparison-trends-new-image-florida-club-closed-eyes-open-mouth-joe-bidens-nantucket-appearance/articleshow/125680379.cms",
    "timestamp": "2025-11-30T21:28:14Z"
  },
  {
    "title": "China's factory activity contracts for 8th month in November despite trade war truce",
    "description": "China’s factory activity contracted for the eighth straight month in November, according to an official survey on Sunday, underscoring challenges for the country’s economy despite the U.S.-China trade truce. The official manufacturing purchasing managers inde…",
    "link": "https://japantoday.com/category/business/china%27s-factory-activity-contracts-for-8th-month-in-november-despite-trade-war-truce",
    "timestamp": "2025-11-30T21:27:54Z"
  },
  {
    "title": "American and Syrian forces conduct airstrikes on ISIS weapons storage facilities",
    "description": "The U.S. military said on Sunday that it recently destroyed 15 sites containing Islamic State weapons caches in southern Syria. U.S. Central Command said it and Syrian forces identified and destroyed the storage facilities across the Rif Damashq province duri…",
    "link": "https://japantoday.com/category/world/american-and-syrian-forces-conduct-airstrikes-on-isis-weapons-storage-facilities-us-military-says",
    "timestamp": "2025-11-30T21:26:29Z"
  },
  {
    "title": "Netanyahu requests pardon to end his ongoing corruption trial in Israel",
    "description": "Israeli Prime Minister Benjamin Netanyahu on Sunday asked the country’s president to grant him a pardon from corruption charges, seeking to end a long-running trial that has bitterly divided the nation. Netanyahu, who has been at war against Israel’s legal sy…",
    "link": "https://japantoday.com/category/world/netanyahu-submits-request-for-a-pardon-amid-his-ongoing-corruption-trial",
    "timestamp": "2025-11-30T21:26:14Z"
  },
  {
    "title": "Lawmakers voice support for congressional reviews of Trump's military strikes on boats",
    "description": "Lawmakers from both parties said Sunday they support congressional reviews of U.S. military strikes against vessels suspected of smuggling drugs in the Caribbean Sea and eastern Pacific Ocean, citing a published report that Defense Secretary Pete Hegseth issu…",
    "link": "https://japantoday.com/category/world/lawmakers-voice-support-for-congressional-reviews-of-trump%27s-military-strikes-on-boats",
    "timestamp": "2025-11-30T21:26:00Z"
  },
  {
    "title": "Rubio says U.S.-Ukraine talks on Russia war were productive but much work remains in search of deal",
    "description": "U.S. and Ukrainian officials completed roughly four hours of talks Sunday aimed at finding an endgame to the war between Russia and Ukraine. Secretary of State Marco Rubio told reporters afterward that the session was productive but work remains in the search…",
    "link": "https://japantoday.com/category/world/rubio-and-witkoff-are-meeting-with-ukraine%27s-negotiators-in-florida-as-trump-pushes-to-broker-a-deal",
    "timestamp": "2025-11-30T21:25:53Z"
  },
  {
    "title": "Today's 'weak men' feel threatened by rising female power and independence",
    "description": "How the male has fallen! From a long way up it’s a long way down. The pride a man could once take simply in being a man is no more – good riddance to it say most women and many men but it’s a loss all the same, and a…",
    "link": "https://japantoday.com/category/features/kuchikomi/today%27s-%27weak-men%27-feel-threatened-by-rising-female-power-and-independence",
    "timestamp": "2025-11-30T21:22:18Z"
  },
  {
    "title": "Trump commutes prison sentence for former private equity executive David Gentile",
    "description": "President Donald Trump has commuted the prison sentence of a former investment manager convicted of defrauding investors",
    "link": "https://abcnews.go.com/US/wireStory/trump-commutes-prison-sentence-former-private-equity-executive-127985735",
    "timestamp": "2025-11-30T21:13:04Z"
  },
  {
    "title": "Rubio says Ukraine peace talks productive but work remains",
    "description": "Marco Rubio says he expects the talks between US and Ukrainian officials on Sunday about finding a peace deal with Russia to yield progress in ending the war.",
    "link": "https://www.abc.net.au/news/2025-12-01/ukraine-talks-productive-but-work-remains-for-peace-deal/106085142",
    "timestamp": "2025-11-30T21:11:21Z"
  },
  {
    "title": "Trump commutes prison sentence for former private equity executive David Gentile",
    "description": "President Donald Trump has commuted the prison sentence of a former investment manager convicted of defrauding investors.",
    "link": "https://www.news4jax.com/business/2025/11/30/trump-commutes-prison-sentence-for-former-private-equity-executive-david-gentile/",
    "timestamp": "2025-11-30T21:09:58Z"
  },
  {
    "title": "Rosie O'Donnell brands Trump a 'pig' who is 'in the throes of a serious cognitive health crisis' - NewsBreak",
    "description": "Rosie O'Donnell, who has been beefing with President Donald Trump for over two decades, moved to Ireland with her youngest daughter, following his second p",
    "link": "https://www.newsbreak.com/share/4372726250520-rosie-o-donnell-brands-trump-a-pig-who-is-in-the-throes-of-a-serious-cognitive-health-crisis?_f=app_share&amp;pd=00SZiqXz&amp;lang=en_US&amp;send_time=1764536946&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.42.1.12%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-30T21:09:34Z"
  },
  {
    "title": "WATCH: Jasmine Crockett imagines what Republicans ‘would have done to a little baby Jesus’",
    "description": "'This is the party that says that they care so much about life until life actually shows up at their front door'",
    "link": "https://www.wnd.com/2025/11/watch-jasmine-crockett-imagines-what-republicans-would-have/",
    "timestamp": "2025-11-30T21:08:36Z"
  },
  {
    "title": "Josh Brolin Knows Trump as a ‘Different Guy’ Having ‘Been a Friend’ of His Before Presidency: ‘No Greater Genius Than Him in Marketing’",
    "description": "Josh Brolin remembers Donald Trump before he was elected president of the United States. 'South Park' Thanksgiving Episode: Saudi Arabia Sponsors the Annua",
    "link": "https://www.newsbreak.com/share/4372596346301-josh-brolin-knows-trump-as-a-different-guy-having-been-a-friend-of-his-before-presidency-no-greater-genius-than-him-in-marketing?s=a7&amp;share_destination_id=MTY2MjUwOTE3LTE3NjQ1MzY0ODU3NzU%3D&amp;pd=0BFZSPLh&amp;hl=en_US&amp;send_time=1764536485&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.47.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-30T21:06:18Z"
  },
  {
    "title": "Troy Nehls' Identical Twin Brother Wants to Replace Him in Congress (Amelia Benavides-Colón/NOTUS)",
    "description": "Amelia Benavides-Colón / NOTUS:\nTroy Nehls' Identical Twin Brother Wants to Replace Him in Congress  —  The Texas Republican, a staunch ally of Donald Trump, said he spoke with the president prior to making his retirement announcement.  — Copy  —  Rep. Troy N…",
    "link": "https://www.memeorandum.com/251130/p45",
    "timestamp": "2025-11-30T21:05:01Z"
  },
  {
    "title": "Donald Trump Afghans Nespresso machine claim online repost sparks debate: Who is Robert O’Neill? Here's whole remark",
    "description": "Donald Trump Afghans Nespresso machine claim surfaced after Trump shared a post about Afghans reacting to a Nespresso machine. The repost came after a DC shooting involving two National Guard members. The statement and timing raised questions about immigratio…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-afghans-nespresso-machine-claim-online-repost-sparks-debate-who-is-robert-oneill-heres-whole-remark-us-president-statement-national-guard-members-shooting-washington-dc-asylum-visas-navy-seal-veteran-robert-oneill-afghanistan-rahmanullah-lakanwal-alleged-shooter/articleshow/125680230.cms",
    "timestamp": "2025-11-30T21:04:04Z"
  },
  {
    "title": "Jan. 6 cop makes startling prediction about Trump's post-presidency fate",
    "description": "A former police officer who nearly lost his life during the Jan. 6 insurrection mad a bold prediction about President Donald Trump's eventual fate.Former D.C. Metro police officer Michael Fanone, who was beaten and tased by Trump supporters during the U.S. Ca…",
    "link": "https://www.rawstory.com/jan-6-2674356761/",
    "timestamp": "2025-11-30T21:03:37Z"
  },
  {
    "title": "Ukraine talks 'productive' but more work needed, Rubio says",
    "description": "American and Ukrainian delegations meet in Florida to discuss the outlines of a peace deal with Russia.",
    "link": "https://www.bbc.com/news/articles/cd9z2e3exk9o",
    "timestamp": "2025-11-30T21:03:08Z"
  },
  {
    "title": "Sen. Mark Kelly Says Trump’s Response To National Guard Shooting Is Incredibly Revealing",
    "description": "The ambush shooting of two National Guard members in Washington, D.C., has been tied to an Afghan national.",
    "link": "https://www.huffpost.com/entry/mark-kelly-trump-immigration-crackdown-national-guard-shooting_n_692c8e95e4b05a7b18769318",
    "timestamp": "2025-11-30T21:02:09Z"
  },
  {
    "title": "Kevin Roberts: A Playbook for the Work Ahead",
    "description": "As we enter the final month of 2025, there’s no better time to start thinking about the year ahead and how we as conservatives can... Read More\nThe post Kevin Roberts: A Playbook for the Work Ahead appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/30/kevin-roberts-a-playbook-for-the-work-ahead/",
    "timestamp": "2025-11-30T21:00:53Z"
  },
  {
    "title": "Mark Kelly pressed on whether he would refuse orders if he was still in uniform",
    "description": "Sen. Mark Kelly was pressed on whether he'd refuse military orders if he was still in uniform, after the Democratic lawmaker urged troops to disobey \"illegal\" orders from the Trump administration.",
    "link": "https://www.foxnews.com/media/mark-kelly-pressed-whether-he-would-refuse-orders-he-still-uniform",
    "timestamp": "2025-11-30T21:00:43Z"
  },
  {
    "title": "Trump commutes prison sentence for private equity executive",
    "description": "President Donald Trump has commuted the prison sentence of a former investment manager convicted of defrauding investors. It's the latest in a series of clemency actions Trump has taken in white-collar criminal cases. David Gentile had been convicted for his …",
    "link": "https://apnews.com/article/trump-clemency-commutation-david-gentile-fraud-4901d5e2f710b47ee0372a3f0835fa6c",
    "timestamp": "2025-11-30T20:58:24Z"
  },
  {
    "title": "U.S. lawmakers calling for review after report on Trump's boat strikes prompt war crime fears",
    "description": "Lawmakers from both U.S. parties said Sunday they support congressional reviews of military strikes against vessels suspected of smuggling drugs in the Caribbean Sea and eastern Pacific Ocean, citing a published report that Defence Secretary Pete Hegseth issu…",
    "link": "https://www.cbc.ca/news/world/military-boat-strike-review-trump-venezuela-9.6998143",
    "timestamp": "2025-11-30T20:56:25Z"
  },
  {
    "title": "Trump calls for turnout in Tennessee race",
    "description": "United States President Donald Trump urged voters in Tennessee's 7th Congressional District to support Republican candidate Matt Van Epps.\nTrump called on \"America First Patriots\" to tu...",
    "link": "https://biztoc.com/x/e50bb5d9e61df681",
    "timestamp": "2025-11-30T20:52:38Z"
  },
  {
    "title": "Hondurans vote in close presidential race overshadowed by surprise Trump intervention",
    "description": "Hondurans voted Sunday to elect a new president only days after U.S. President Donald Trump intervened in a close race with an endorsement of one candidate and announced that he would pardon a former president.",
    "link": "https://biztoc.com/x/e320782271418dea",
    "timestamp": "2025-11-30T20:41:36Z"
  },
  {
    "title": "Maureen Dowd: My brother believes that America will never buy socialism",
    "description": "Cracks are beginning to show in Trump’s ironclad hold on the Republican Party but Democrats should hope Mamdani flops",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/11/27/opinion/maureen-dowd-brother-thanksgiving-trump.html",
    "timestamp": "2025-11-30T20:39:15Z"
  },
  {
    "title": "West Virginia high school remembers slain National Guard member as caring and willing to help",
    "description": "Mourners gathered at a small West Virginia high school have remembered a National Guard member fatally shot last week as a caring and positive person who wanted to help others",
    "link": "https://abcnews.go.com/US/wireStory/west-virginia-high-school-remembers-slain-national-guard-127985149",
    "timestamp": "2025-11-30T20:37:40Z"
  },
  {
    "title": "Mary Trump Says Donald Is Clearly 'Rattled'",
    "description": "Mary Trump Says Donald Is Clearly 'Rattled'littlethings.com",
    "link": "https://littlethings.com/entertainment/mary-trump-says-president-trump-clearly-rattled",
    "timestamp": "2025-11-30T20:33:13Z"
  },
  {
    "title": "Venezuela's National Assembly to investigate US boat strikes",
    "description": "Nov 30 (Reuters) - Venezuela's National Assembly will form a special commission to investigate U.S. President Donald Trump's deadly strikes on suspected drug trafficking boats off the Venezuelan coast and in the eastern Pacific Ocean, the congressional body's…",
    "link": "https://www.thestar.com.my/news/world/2025/12/01/venezuela039s-national-assembly-to-investigate-us-boat-strikes",
    "timestamp": "2025-11-30T20:31:00Z"
  },
  {
    "title": "Hondurans vote in close presidential race overshadowed by surprise Trump intervention",
    "description": "Hondurans voted Sunday to elect a new president only days after U.S. President Donald Trump intervened in a close race with an endorsement of one candidate and announced that he would pardon a former president.",
    "link": "https://www.pbs.org/newshour/world/hondurans-vote-in-close-presidential-race-overshadowed-by-surprise-trump-intervention",
    "timestamp": "2025-11-30T20:29:06Z"
  },
  {
    "title": "West Virginia high school remembers slain National Guard member as caring and willing to help",
    "description": "By SOPHIA TAREEN Mourners gathered at a West Virginia high school this weekend remembered a National Guard member fatally shot last week as a caring and positive person who wanted to help others. U.S. Army Spc. Sarah Beckstrom died after a Wednesday shooting …",
    "link": "https://www.bostonherald.com/2025/11/30/west-virginia-high-school-remembers-slain-national-guard-member-as-caring-and-willing-to-help/",
    "timestamp": "2025-11-30T20:25:27Z"
  },
  {
    "title": "Trump issues White House invitation to families of the two National Guard members who were shot",
    "description": "Mourners gathered at a West Virginia high school this weekend remembered a National Guard member fatally shot last week as a caring and positive person who wanted to help others.",
    "link": "https://www.bostonherald.com/2025/11/30/trump-issues-white-house-invitation-to-families-of-the-two-national-guard-members-who-were-shot/",
    "timestamp": "2025-11-30T20:25:27Z"
  },
  {
    "title": "Mark Kelly fires back at Trump over military orders dispute",
    "description": "Arizona Sen. Mark Kelly unleashed sharp criticism against President Donald Trump and Defense Secretary Pete Hegseth during a Sunday interview, escalating tensions over a controversial video that urged military personnel to refuse unlawful orders. The Democrat…",
    "link": "https://rollingout.com/2025/11/30/mark-kelly-fire-back-trump-over-military/",
    "timestamp": "2025-11-30T20:24:43Z"
  },
  {
    "title": "Lawmakers voice support for congressional reviews of Trump’s military strikes on boats",
    "description": "Maduro's government accused Trump of making a ”colonial threat” and seeking to undermine the South American country's sovereignty.",
    "link": "https://indianexpress.com/article/world/lawmakers-voice-support-for-congressional-reviews-of-trumps-military-strikes-on-boats-10394938/",
    "timestamp": "2025-11-30T20:14:41Z"
  },
  {
    "title": "Trump Fires Off Bizarre Post Urging Tennessee Voters to Reject Candidate Who ‘Hates Christianity’ and ‘Openly Disdains Country Music’",
    "description": "Trump ripped Democrat Aftyn Behn in a wild Truth Social post — accusing her of being someone who \"hates Christianity\" and \"openly disdains country music\"\nThe post Trump Fires Off Bizarre Post Urging Tennessee Voters to Reject Candidate Who ‘Hates Christianity…",
    "link": "https://www.mediaite.com/media/news/trump-fires-off-bizarre-post-urging-tennessee-voters-to-reject-candidate-who-hates-christianity-and-openly-disdains-country-music/",
    "timestamp": "2025-11-30T20:11:45Z"
  },
  {
    "title": "It’s time for the Polish-Ukrainian Commonwealth",
    "description": "Would be a check on Russia, undermine China and provide the 'most lethal and capable army in Europe'",
    "link": "https://www.wnd.com/2025/11/its-time-polish-ukrainian-commonwealth/",
    "timestamp": "2025-11-30T20:10:03Z"
  },
  {
    "title": "After protestors block ICE in Chinatown, NYC immigrant advocates pledge more resistance",
    "description": "NYPD responds as immigration activists block a garage used by ICE vans in Manhattan Saturday.\n \n\nThey also called on the NYPD to drop charges against people after clashes with officers. [ more › ]",
    "link": "https://gothamist.com/news/after-protestors-block-ice-in-chinatown-immigrant-advocates-pledge-more-resistance",
    "timestamp": "2025-11-30T20:07:00Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Nov. 30, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Rep. Mike Turner and Sen. Tim Kaine join Nancy Cordes.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-11-30-2025/",
    "timestamp": "2025-11-30T20:06:35Z"
  },
  {
    "title": "Trump’s Approval Strong With Republicans Despite Dustup With Marjorie Taylor Greene",
    "description": "\"Like a rock, to quote Bob Seger\"\nThe post Trump’s Approval Strong With Republicans Despite Dustup With Marjorie Taylor Greene first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/trumps-approval-strong-with-republicans-despite-dustup-with-marjorie-taylor-greene/",
    "timestamp": "2025-11-30T20:00:37Z"
  },
  {
    "title": "Officer Injured By January 6 Predicts Trump Will Flee US After 2026 Elections: 'He'll Be Hopping on That Qatari Jet to Saudi Arabia'",
    "description": "Former District of Columbia Metro police officer Michael Fanone has speculated that President Donald Trump might leave the United States after the 2026 elections.\nWhat Happened: Fanone, who endured a heart attack after being assaulted in the Capitol riot, voi…",
    "link": "https://biztoc.com/x/291d2f9086acdc77",
    "timestamp": "2025-11-30T19:56:47Z"
  },
  {
    "title": "Fed Contender Hassett Says Market Is Ready for Trump Chair Pick (María Paula Mijares Torres/Bloomberg)",
    "description": "María Paula Mijares Torres / Bloomberg:\nFed Contender Hassett Says Market Is Ready for Trump Chair Pick  —  White House National Economic Council Director Kevin Hassett touted a positive market response to indications that Donald Trump could pick the next Fed…",
    "link": "https://www.memeorandum.com/251130/p36",
    "timestamp": "2025-11-30T19:55:05Z"
  },
  {
    "title": "What, exactly, just happened to the left’s dark money behemoth Arabella Advisors?",
    "description": "Company says it 'has ceased operations,' and its replacement appears immediately",
    "link": "https://www.wnd.com/2025/11/what-exactly-just-happened-lefts-dark-money-behemoth/",
    "timestamp": "2025-11-30T19:53:16Z"
  },
  {
    "title": "US sees progress after talks in Florida with Ukraine, but more work needed to reach deal",
    "description": "Trump has repeatedly pressured Ukraine to accept territorial concessions in exchange for a peace deal with Russia.",
    "link": "https://www.channelnewsasia.com/world/us-ukraine-russia-florida-progress-talk-deal-5498506",
    "timestamp": "2025-11-30T19:50:00Z"
  }
]