[
  {
    "title": "Jeffrey Epstein’s Birthday Album Included Letters From Bill Clinton, Leon Black",
    "description": "Former president, Wall Street billionaire were listed along with Donald Trump as ‘friends’ in the 2003 book’s table of contents, which named around five dozen contributors.",
    "link": "https://biztoc.com/x/4bafbeee0c3399f6",
    "timestamp": "2025-07-24T23:18:48Z"
  },
  {
    "title": "Trump and Powell can't agree on numbers, and it's more than just interest rates",
    "description": "Trump became the first president to visit the Federal Reserve in nearly two decades.\nKent Nishimura/REUTERS\nPresident Donald Trump became the first president to visit the Federal Reserve in nearly two decades.\nTrump said the Federal Reserve renovation now cos…",
    "link": "https://biztoc.com/x/b21df532d91d6d29",
    "timestamp": "2025-07-24T23:18:25Z"
  },
  {
    "title": "Homicide spiked in big cities during the pandemic. Now it’s plunging",
    "description": "Crime concerns helped push out progressive prosecutors and formed key part of Trump 2024 campaign message",
    "link": "https://www.the-independent.com/news/world/americas/crime/homicide-murder-rate-decline-covid-b2795635.html",
    "timestamp": "2025-07-24T23:15:57Z"
  },
  {
    "title": "FCC approves Paramount's $8 billion deal with Skydance after months of turmoil",
    "description": "Federal regulators on Thursday approved Paramount's $8 billion merger with Skydance, clearing the way to close a deal that combined Hollywood glitz with political intrigue.",
    "link": "https://www.scrippsnews.com/business/company-news/federal-regulators-approve-paramounts-8-billion-deal-with-skydance-capping-months-of-turmoil",
    "timestamp": "2025-07-24T23:15:45Z"
  },
  {
    "title": "Jeff Daniels Says He Hopes Those Who Voted For Trump Are ‘Losing Tons Of Money’",
    "description": "“He’s everything that’s wrong with not just America, but being a human being,” the “Newsroom” alum said of the president.",
    "link": "https://www.huffpost.com/entry/jeff-daniels-says-he-hopes-those-who-voted-for-trump-are-losing-tons-of-money_n_6882a06fe4b0c2d9e4d96091",
    "timestamp": "2025-07-24T23:13:03Z"
  },
  {
    "title": "US Regulators Let Skydance Acquire Paramount Global",
    "description": "US regulators on Thursday approved an $8 billion deal for Skydance to acquire Paramount Global after receiving assurances the merged company will follow Trump administration guidelines against programs promoting diversity, equity and inclusion.",
    "link": "https://www.ibtimes.com/us-regulators-let-skydance-acquire-paramount-global-3779380",
    "timestamp": "2025-07-24T23:12:18Z"
  },
  {
    "title": "Kellyanne Conway Explains Why America Can’t Just Move On From Russiagate Hoax",
    "description": "Kellyanne Conway discussed the enduring impact of the Russiagate investigation on American politics Thursday on Fox Business.",
    "link": "https://dailycaller.com/2025/07/24/kellyanne-conway-russiagate-hoax-trump/",
    "timestamp": "2025-07-24T23:10:02Z"
  },
  {
    "title": "Transgender Air Force cadet's dream of joining the military on hold amid Trump's ban",
    "description": "Hunter Marquez expected to be commissioned into the Air Force after graduating in May, but Trump's ban on transgender service members is keeping them out of the military.",
    "link": "https://abcnews.go.com/US/transgender-air-force-cadets-dream-joining-military-put/story?id=124048051",
    "timestamp": "2025-07-24T23:08:50Z"
  },
  {
    "title": "White House Responds to 'South Park' Parodying Trump in Season 27 Premiere",
    "description": "Donald Trump is not very happy with South Park. In the season 27 premiere of the long-running animated Comedy Central series that aired on Wednesday night (July 23), the show trolled Trump, 79, by making fun his lawsuit with Paramount, the Jeffrey Epstein fil…",
    "link": "https://www.justjared.com/2025/07/24/white-house-responds-to-south-park-parodying-trump-in-season-27-premiere/",
    "timestamp": "2025-07-24T23:07:51Z"
  },
  {
    "title": "Starmer urged to match Macron’s plan to recognise Palestinian state",
    "description": "Senior Labour figures claim UK prime minister is blocking move because he wants to stay close to Donald Trump",
    "link": "https://biztoc.com/x/d6ab3cf8f353a98b",
    "timestamp": "2025-07-24T23:07:30Z"
  },
  {
    "title": "Trump stays cautious during tense Fed tour",
    "description": "The News\nThe remarkable display of President Donald Trump and Federal Reserve Chair Jerome Powell touring the central bank in hard hats on Thursday was followed by another rare moment: Trump sounding almost cautious.\nTrump and several senior GOP officials vis…",
    "link": "https://biztoc.com/x/1f0682dd2e5cc87a",
    "timestamp": "2025-07-24T23:07:07Z"
  },
  {
    "title": "Federal Court Sides with Christian Mom Blocked from Adoption over Oregon’s LGBTQ+ Affirmation Policy",
    "description": "A federal court on Thursday sided with an Oregon Christian mother after state officials denied her application in 2023 to adopt foster children because of her religious beliefs about gender and sexuality. \nThe post Federal Court Sides with Christian Mom Block…",
    "link": "https://www.breitbart.com/politics/2025/07/24/federal-court-sides-with-christian-mom-blocked-from-adoption-over-oregons-lgbtq-affirmation-policy/",
    "timestamp": "2025-07-24T23:06:56Z"
  },
  {
    "title": "Hulk Hogan’s legacy isn’t complicated",
    "description": "Hulk Hogan, born Terry Gene Bolea, died Thursday in Clearwater, Florida. He was 71 years old. Hogan was one of the most recognizable figures in American pop culture from the 20th century, thanks to his dominance as one of professional wrestling’s biggest star…",
    "link": "https://andscape.com/features/hulk-hogan-legacy-death/",
    "timestamp": "2025-07-24T23:06:48Z"
  },
  {
    "title": "Trump issues executive order for college sports",
    "description": "President Donald Trump has directed members of his Cabinet to develop a plan in the next 30 days aimed at preserving college sports opportunities and preventing college athletes from becoming professionals.",
    "link": "https://www.espn.com/college-sports/story/_/id/45817663/donald-trump-signs-order-seeks-clarify-ncaa-athletes-employment-status",
    "timestamp": "2025-07-24T23:05:22Z"
  },
  {
    "title": "Trump and Powell can't agree on numbers, and it's more than just interest rates",
    "description": "Aside from interest rates, the president and Powell are also not on the same page about the Federal Reserve renovation costs and inflation.",
    "link": "https://www.businessinsider.com/donald-trump-jerome-powell-federal-reserve-renovation-interest-rate-inflation-2025-7",
    "timestamp": "2025-07-24T23:04:26Z"
  },
  {
    "title": "Federal regulators approve Paramount's $8 billion deal with Skydance",
    "description": "The stamp of approval comes after months of turmoil revolving around President Trump’s legal battle with ’60 Minutes.’",
    "link": "https://www.sun-sentinel.com/2025/07/24/paramount-skydance-deal/",
    "timestamp": "2025-07-24T23:03:02Z"
  },
  {
    "title": "Trump's Latest Executive Order Empowers States, Cities to Remove Homeless from Streets",
    "description": "President Donald Trump on Thursday signed an executive order to empower state and local governments to remove homeless individuals from the nation's streets.\nThe post Trump’s Latest Executive Order Empowers States, Cities to Remove Homeless from Streets appea…",
    "link": "https://www.breitbart.com/politics/2025/07/24/trump-signs-executive-order-empowers-states-cities-to-remove-homeless/",
    "timestamp": "2025-07-24T23:02:37Z"
  },
  {
    "title": "Donald Trump to travel to Scotland for five-day trip",
    "description": "US President Donald Trump will travel to Scotland today for a five-day trip that will see him visit two of his golf resorts.",
    "link": "https://www.rte.ie/news/uk/2025/0725/1525249-trump-scotland/",
    "timestamp": "2025-07-24T23:01:03Z"
  },
  {
    "title": "Appeals Court Affirms Nationwide Injunction on Trump’s Birthright Citizenship Order",
    "description": "The decision came shortly after the U.S. Supreme Court held that some nationwide \"injunctions likely exceed the equitable authority\" of federal courts.\nThe post Appeals Court Affirms Nationwide Injunction on Trump’s Birthright Citizenship Order first appeared…",
    "link": "https://legalinsurrection.com/2025/07/appeals-court-affirms-nationwide-injunction-on-trumps-birthright-citizenship-order/",
    "timestamp": "2025-07-24T23:00:15Z"
  },
  {
    "title": "Florida Republicans love Alligator Alcatraz; many not bothered if legal residents are mistakenly deported",
    "description": "Florida Republicans are enthusiastic about Alligator Alcatraz. A public public opinion poll from the University of North Florida, released Thursday, found 65...",
    "link": "https://www.sun-sentinel.com/2025/07/24/florida-republicans-love-alligator-alcatraz-many-not-bothered-if-legal-residents-are-mistakenly-deported/",
    "timestamp": "2025-07-24T23:00:00Z"
  },
  {
    "title": "Longtime Biden Confidante Says Hillary Clinton Wanted Biden out in 2024",
    "description": "Joe Biden’s first White House chief of staff and longtime confidante told House of Representatives investigators Thursday that Biden became less energetic in office and... Read More\nThe post Longtime Biden Confidante Says Hillary Clinton Wanted Biden out in 2…",
    "link": "https://www.dailysignal.com/2025/07/24/longtime-biden-confidante-says-hillary-clinton-wanted-biden-2024/",
    "timestamp": "2025-07-24T23:00:00Z"
  },
  {
    "title": "Federal regulators approve Paramount’s $8 billion deal with Skydance, capping months of turmoil",
    "description": "The stamp of approval comes after months of turmoil revolving around President Trump’s legal battle with '60 Minutes.'",
    "link": "https://www.bostonherald.com/2025/07/24/paramount-skydance-deal/",
    "timestamp": "2025-07-24T22:59:29Z"
  },
  {
    "title": "FCC approves Paramount’s $8 billion deal with Skydance, capping months of turmoil",
    "description": "The stamp of approval from the Federal Communications Commission comes after months of turmoil revolving around President Donald Trump’s legal battle with “60 Minutes,” the crown jewel of Paramount-owned broadcast network CBS.",
    "link": "https://www.pbs.org/newshour/economy/fcc-approves-paramounts-8-billion-deal-with-skydance-capping-months-of-turmoil",
    "timestamp": "2025-07-24T22:59:14Z"
  },
  {
    "title": "Dr. Oz under fire after declaring war on the sick: ‘Won’t tolerate it anymore’",
    "description": "Dr. Mehmet Oz, President Donald Trump’s Administrator of the Centers for Medicare and Medicaid Services, declared that the administration will no longer “tolerate” what he called a culture that makes it “easy to be sick in America.” Framing childhood illness …",
    "link": "https://www.rawstory.com/dr-oz-2673754890/",
    "timestamp": "2025-07-24T22:59:02Z"
  },
  {
    "title": "11 Most Controversial ‘South Park’ Moments, From Trump-Paramount to Muhammad",
    "description": "The long-running series’ latest parody is a reminder that the animated comedy loves to pack a punch\nThe post 11 Most Controversial ‘South Park’ Moments, From Trump-Paramount to Muhammad appeared first on TheWrap.",
    "link": "https://www.thewrap.com/south-park-controversial-episodes-moments-trump-paramount-muhammad/",
    "timestamp": "2025-07-24T22:56:54Z"
  },
  {
    "title": "Dems rail against Colbert’s cancellation – here’s why",
    "description": "'Younger viewers spend their time on TikTok and YouTube, watching clips and streaming content'",
    "link": "https://www.wnd.com/2025/07/dems-rail-against-colberts-cancellation-heres-why/",
    "timestamp": "2025-07-24T22:54:59Z"
  },
  {
    "title": "White House lashes out at 'South Park' Trump parody - France 24",
    "description": "White House lashes out at 'South Park' Trump parodyFrance 24 South Park targets Paramount after signing $1.5bn deal and skewers Trump: ‘He can do anything to anyone’The Guardian Trump's Epstein Problem Hits Pop CulturePolitico White House Slams South Park Ove…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178459852",
    "timestamp": "2025-07-24T22:54:51Z"
  },
  {
    "title": "Has Donald Trump’s policy of imposing trade tariffs worked?",
    "description": "President Trump signs major trade deal with Japan, and Tokyo pledges to invest in the United States.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/7/24/has-donald-trumps-policy-of-imposing-trade-tariffs-worked",
    "timestamp": "2025-07-24T22:51:38Z"
  },
  {
    "title": "It’s been a rough week for Gen X — losing Theo, Ozzy and now ‘Real American’ icon Hulk Hogan",
    "description": "It's been a week of tremendous loss for kids of the 1980s. The last few days on social media has felt like one long requiem for our pop culture.",
    "link": "https://nypost.com/2025/07/24/opinion/its-been-a-rough-week-for-gen-x-and-now-weve-lost-hulk-hogan/",
    "timestamp": "2025-07-24T22:51:11Z"
  },
  {
    "title": "Trump cracks California’s egg regulations",
    "description": "State law requires 'full mobility by the egg-laying hen without constant contact with other chickens or any restraint'",
    "link": "https://www.wnd.com/2025/07/trump-cracks-californias-egg-regulations/",
    "timestamp": "2025-07-24T22:51:01Z"
  },
  {
    "title": "Could Israel be planning a second war on Iran?",
    "description": "Analysts warn Israel seeks pretexts for new conflicts with Iran amid speculation over covert operations.",
    "link": "https://www.aljazeera.com/news/2025/7/24/could-israel-be-planning-a-second-war-on-iran",
    "timestamp": "2025-07-24T22:48:30Z"
  },
  {
    "title": "Trump Holds Fed Chief’s Feet to Fire on HQ Construction Cost Overruns",
    "description": "President Donald Trump put Federal Reserve Chairman Jerome Powell on the spot about the cost of renovations to the Fed’s Washington headquarters building going over... Read More\nThe post Trump Holds Fed Chief’s Feet to Fire on HQ Construction Cost Overruns ap…",
    "link": "https://www.dailysignal.com/2025/07/24/trump-holds-fed-chairmans-feet-fire-hq-construction-cost-overruns/",
    "timestamp": "2025-07-24T22:45:00Z"
  },
  {
    "title": "‘Do You Still Think That Jerome Powell’s a Numbskull?’ Kaitlan Collins Asks Trump About Fed Chair – Who’s Standing Right Next to Him",
    "description": "CNN's Kaitlan Collins asked President Donald Trump if he still believes Federal Reserve Chairman Jerome Powell is a moron.\nThe post ‘Do You Still Think That Jerome Powell’s a Numbskull?’ Kaitlan Collins Asks Trump About Fed Chair – Who’s Standing Right Next t…",
    "link": "https://www.mediaite.com/media/tv/do-you-still-think-that-jerome-powells-a-numbskull-kaitlan-collins-asks-trump-about-fed-chair-whos-standing-right-next-to-him/",
    "timestamp": "2025-07-24T22:44:22Z"
  },
  {
    "title": "Tesla sales have collapsed and profits nosedived — but never fear, Elon has the answer",
    "description": "Tesla insists its collapsing sales and plummeting profits aren't the whole story. But will investors be willing to bet on Elon Musk?\nThe post Tesla sales have collapsed and profits nosedived — but never fear, Elon has the answer appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/07/25/tesla-sales-collapse-elon-musk-ai/",
    "timestamp": "2025-07-24T22:42:31Z"
  },
  {
    "title": "Iranian Lawmaker Warns: Tehran Ready to Exit Nuclear Treaty if Western Powers Reimpose Sanctions",
    "description": "Iran is prepared to withdraw from the NPT if the U.K., France, and Germany trigger a sanctions snapback. This move would remove international restrictions on Iran's uranium enrichment activities.",
    "link": "https://www.shtfplan.com/headline-news/iranian-lawmaker-warns-tehran-ready-to-exit-nuclear-treaty-if-western-powers-reimpose-sanctions",
    "timestamp": "2025-07-24T22:42:06Z"
  },
  {
    "title": "Lara Trump Announces She Will Not Run for U.S. Senate in North Carolina to Replace RINO Thom Tillis",
    "description": "Lara Trump, the fiery daughter-in-law of President Donald Trump and a powerhouse in her own right, has announced she will not pursue a run for the U.S.\nThe post Lara Trump Announces She Will Not Run for U.S. Senate in North Carolina to Replace RINO Thom Tilli…",
    "link": "https://www.thegatewaypundit.com/2025/07/lara-trump-announces-she-will-not-run-u/",
    "timestamp": "2025-07-24T22:40:55Z"
  },
  {
    "title": "Read FCC Commissioner Anna M. Gomez’s Scathing Dissent After Skydance-Paramount Approval: ‘Direct Violation of the First Amendment’",
    "description": "Meanwhile, Commissioner Olivia Trusty says the deal signifies the \"free market at work\"\nThe post Read FCC Commissioner Anna M. Gomez’s Scathing Dissent After Skydance-Paramount Approval: ‘Direct Violation of the First Amendment’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/fcc-commissioner-anna-gomez-blasts-paramount-skydance-merger/",
    "timestamp": "2025-07-24T22:40:48Z"
  },
  {
    "title": "Trump aides and surrogates swarm NBC to tell them us how much they are NOT talking about Epstein....or Bruno for that matter [Fail]",
    "description": "Trump aides and surrogates swarm NBC to tell them us how much they are NOT talking about Epstein....or Bruno for that matter",
    "link": "https://www.fark.com/comments/13752518/Trump-aides-surrogates-swarm-NBC-to-tell-them-us-how-much-they-are-NOT-talking-about-Epsteinor-Bruno-for-that-matter",
    "timestamp": "2025-07-24T22:36:00Z"
  },
  {
    "title": "The White House wants more states to redraw House maps to help GOP. Democrats are readying a fight",
    "description": "This multi-state redistricting battle could be the first step in the fight for House control ahead of next year’s midterms.",
    "link": "https://www.bostonherald.com/2025/07/24/election-2026-redistricting/",
    "timestamp": "2025-07-24T22:35:38Z"
  },
  {
    "title": "Why didn’t Biden release the Epstein files?",
    "description": "Reports of Donald Trump’s name repeatedly appearing in the Jeffrey Epstein files, coupled with the unearthing of a suggestive birthday card that the president sent the convicted sex offender, have renewed scrutiny of their relationship.  But if the government…",
    "link": "https://www.vox.com/politics/421141/epstein-files-biden-trump-conspiracy",
    "timestamp": "2025-07-24T22:34:55Z"
  },
  {
    "title": "The Dangers of Weaponizing Antisemitism",
    "description": "As Gaza faces more death and starvation, criticism of Israel is needed more than ever.",
    "link": "http://foreignpolicy.com/2025/07/24/the-dangers-of-weaponizing-antisemitism/",
    "timestamp": "2025-07-24T22:31:38Z"
  },
  {
    "title": "Paramount's Blockbuster Merger with Skydance Cleared by FCC",
    "description": "The green light follows Paramount's $16 million settlement of a suit filed by Trump, related to a 60 Minutes interview with Kamala Harris.",
    "link": "https://www.newsweek.com/paramount-merger-skydance-approved-fcc-trump-settlement-2103793",
    "timestamp": "2025-07-24T22:30:11Z"
  },
  {
    "title": "India, UK start a new chapter with FTA",
    "description": "India and the UK have formalized a Comprehensive Economic and Trade Agreement (CETA), targeting a trade volume exceeding $100 billion by 2030. This landmark deal, India's 16th such pact, eliminates tariffs on key sectors like leather and apparel in the UK, wh…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-uk-start-a-new-chapter-with-fta/articleshow/122890357.cms",
    "timestamp": "2025-07-24T22:30:00Z"
  },
  {
    "title": "Russiagate Scandal Should Forever Taint Obama’s Disintegrating Legacy",
    "description": "Russiagate is one of the most significant scandals in American history, and it totally shatters the media-manufactured myth of Barack Obama. Newly released details by Director of... Read More\nThe post Russiagate Scandal Should Forever Taint Obama’s Disintegra…",
    "link": "https://www.dailysignal.com/2025/07/24/russiagate-scandal-should-forever-taint-obamas-disintegrating-legacy/",
    "timestamp": "2025-07-24T22:30:00Z"
  },
  {
    "title": "Texas Republicans Redraw District Maps to Gain Seats in Congress",
    "description": "But is it a “gerrymander,” or a “dummymander?”",
    "link": "https://slate.com/podcasts/political-gabfest/2025/07/politics-epstein-trump-lawsuit-wsj-john-roberts-supreme-court-texas-gerrymandering-republicans",
    "timestamp": "2025-07-24T22:30:00Z"
  },
  {
    "title": "Trump's South Park fiasco exposed who really holds the cards: Deadline editor",
    "description": "MSNBC's Nicolle Wallace welcomed Hollywood insider and Deadline executive editor on to laugh about the Comedy Central show \"South Park\" making fun of President Donald Trump, along with their parent network, Paramount. Dominic Patten explained that behind the …",
    "link": "https://www.rawstory.com/south-and-park/",
    "timestamp": "2025-07-24T22:29:01Z"
  },
  {
    "title": "Alarm as 'Legal Terrorist' Helps Texan Sue Dr. Over Girlfriend's Abortion Pills",
    "description": "As polling reaffirms U.S. public support for abortion rights, a new case in Texas is generating alarm and outrage, as it involves a federal \"zombie law\" that the forced birth movement aims to use to block people across the country from accessing abortion pill…",
    "link": "https://www.commondreams.org/news/comstock-act",
    "timestamp": "2025-07-24T22:25:39Z"
  },
  {
    "title": "Trump spars with Powell over renovation costs during Fed visit, but backs off firing threats (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nTrump spars with Powell over renovation costs during Fed visit, but backs off firing threats … President Donald Trump and Federal Reserve Chairman Jerome Powell went back and forth in front of the press Thursday over Trump's claims ab…",
    "link": "https://www.memeorandum.com/250724/p124",
    "timestamp": "2025-07-24T22:25:01Z"
  },
  {
    "title": "Columbia pays Trump’s ransom",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: Columbia University has struck a deal with the Trump a…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/421137/columbia-university-trump-administration-settlement-research-funding-freeze",
    "timestamp": "2025-07-24T22:24:49Z"
  },
  {
    "title": "Trump Redefines the Washington Scandal",
    "description": "In a Presidency where everything is an outrage, what does it say that MAGA’s revolt over the Jeffrey Epstein files is the one crisis that really might hurt him?",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/trump-redefines-the-washington-scandal",
    "timestamp": "2025-07-24T22:24:28Z"
  },
  {
    "title": "U.S.-Brazil Feud Could Speed Up De-Dollarization",
    "description": "A popular Brazilian payment system is causing concerns in Washington.",
    "link": "http://foreignpolicy.com/2025/07/24/brazil-trump-tariff-trade-visa-ban-dollar-pix/",
    "timestamp": "2025-07-24T22:23:50Z"
  },
  {
    "title": "Trump Administration OKs Skydance Merger With CBS Parent Company Paramount",
    "description": "FCC Chairman Brendan Carr said he's hopeful Skydance will make \"significant changes\" at CBS News.",
    "link": "https://www.huffpost.com/entry/fcc-skydance-paramount-cbs-merger_n_6882af3be4b01be72b3e7d76",
    "timestamp": "2025-07-24T22:22:53Z"
  },
  {
    "title": "Trump went to the Fed to pressure Powell. Did he chicken out instead?",
    "description": "President Donald Trump made a dramatic gesture to ramp up his attacks on Federal Reserve Chair Jerome Powell with a historic visit on Thursday to Powell’s home turf, but in the end he offered relatively measured remarks about the U.S. central bank’s chief.",
    "link": "https://biztoc.com/x/a9b2d37a60c2f405",
    "timestamp": "2025-07-24T22:22:40Z"
  },
  {
    "title": "Trump says US can afford new Fed building",
    "description": "Donald Trump visited the Federal Reserve building alongside Chairman Jerome Powell and Senator Tim Scott, sharing his thoughts in a Truth Social post. Trump criticized the ongoing renovation, saying i...",
    "link": "https://biztoc.com/x/23b9867747cd2bfd",
    "timestamp": "2025-07-24T22:22:24Z"
  },
  {
    "title": "Trump Order Forces Hospitalization of Homeless",
    "description": "President Donald Trump directed federal agencies to find ways to make it easier to forcibly hospitalize homeless people with mental illness and addiction for longer periods — an effort to fight what the administration calls",
    "link": "https://politicalwire.com/2025/07/24/trump-order-forces-hospitalization-of-homeless/",
    "timestamp": "2025-07-24T22:21:22Z"
  },
  {
    "title": "U.S. unemployment claims remain at historical low after falling for 6th straight week",
    "description": "The Labor Department reported Thursday that jobless claims for the week ending July 19 fell by 4,000 to 217,000. That’s fewer than the 227,000 new applications analysts were expecting.",
    "link": "https://www.pbs.org/newshour/economy/u-s-unemployment-claims-remain-at-historical-low-after-falling-for-6th-straight-week",
    "timestamp": "2025-07-24T22:21:16Z"
  },
  {
    "title": "BREAKING: Trump Admin Approves Merger Between Paramount and Skydance",
    "description": "The Trump administration's Federal Communications Commission approved an $8 billion merger between Paramount and Skydance on Thursday.\nThe post BREAKING: Trump Admin Approves Merger Between Paramount and Skydance first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/breaking-trump-admin-approves-merger-between-paramount-and-skydance/",
    "timestamp": "2025-07-24T22:21:15Z"
  },
  {
    "title": "The Bob Cesca Podcast: His P*nis Is Teeny Tiny",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: His P*nis Is Teeny Tiny -- Bob at Star Trek Las Vegas on August 10. The new Wall Street Journal Trump/Epstein bombshell. There's an Excel spreadsheet of all the Trump mentions in the Epstein f…",
    "link": "https://littlegreenfootballs.com/article/54783_The_Bob_Cesca_Podcast-_His_P*n",
    "timestamp": "2025-07-24T22:20:58Z"
  },
  {
    "title": "President Trump's Executive Order Seeks to Clarify College Athletes' Employment Status",
    "description": "President Donald Trump signed an executive order mandating that federal authorities clarify whether college athletes can be considered employees of the schools they play for — attempting to create clearer standards for the NCAA’s NIL program.",
    "link": "https://www.foxsports.com/stories/college-football/president-trumps-executive-order-seeks-clarify-college-athletes-employment-status",
    "timestamp": "2025-07-24T22:20:33Z"
  },
  {
    "title": "Justice Elena Kagan urges judges not to be intimidated by increase in threats (Lawrence Hurley/NBC News)",
    "description": "Lawrence Hurley / NBC News:\nJustice Elena Kagan urges judges not to be intimidated by increase in threats  —  President Donald Trump and his allies have been frequent critics of judges and at times have called for the impeachment of those who rule against him…",
    "link": "https://www.memeorandum.com/250724/p123",
    "timestamp": "2025-07-24T22:20:00Z"
  },
  {
    "title": "Trump signs bill to cancel $9 billion in foreign aid, public broadcasting funding (Kevin Freking/Associated Press)",
    "description": "Kevin Freking / Associated Press:\nTrump signs bill to cancel $9 billion in foreign aid, public broadcasting funding  —  President Donald Trump signed a bill Thursday canceling about $9 billion that had been approved for public broadcasting and foreign aid as …",
    "link": "https://www.memeorandum.com/250724/p121",
    "timestamp": "2025-07-24T22:20:00Z"
  },
  {
    "title": "Trump visits US Federal Reserve HQ amid feud with Chairman Powell",
    "description": "The visit comes days before the US Fed's two-day policy meeting where the central bank sets rates.",
    "link": "https://www.aljazeera.com/economy/2025/7/24/trump-visits-us-federal-reserve-hq-amid-feud-with-chairman-powell",
    "timestamp": "2025-07-24T22:18:13Z"
  },
  {
    "title": "FCC approves Paramount-Skydance merger following Trump settlement, Colbert cancellation",
    "description": "FCC Chairman Brendan Carr released a statement announcing his approval of the $8 billion merger between Paramount Global and Skydance Media after a yearlong saga.",
    "link": "https://www.foxnews.com/media/fcc-approves-paramount-skydance-merger-following-trump-settlement-colbert-cancellation",
    "timestamp": "2025-07-24T22:17:57Z"
  },
  {
    "title": "Epstein's estate has his 50th birthday book, victims' lawyer says",
    "description": "\"Ask or subpoena the estate or their lawyers,\" attorney Brad Edwards said.",
    "link": "https://abcnews.go.com/US/epsteins-estate-50th-birthday-book-victims-lawyer/story?id=124051882",
    "timestamp": "2025-07-24T22:17:50Z"
  },
  {
    "title": "Ghislaine Maxwell may hold the keys to Epstein investigation – but victims, prosecutors warn against trusting her",
    "description": "“Does she have information that could potentially help? Yes. Will she be truthful about it? Who knows,” lawyer Bradley Edwards told MSNBC.",
    "link": "https://nypost.com/2025/07/24/us-news/ghislaine-maxwell-lied-about-victims-prison-conditions-prosecutors/",
    "timestamp": "2025-07-24T22:15:14Z"
  },
  {
    "title": "U.S. stocks close mixed on corporate earnings",
    "description": "NEW YORK, July 24 (Xinhua) -- U.S. stocks ended mixed on Thursday as investors digested a wave of corporate earnings and weighed the implications of accelerating global trade negotiations. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/25/us-stocks-close-mixed-on-corporate-earnings",
    "timestamp": "2025-07-24T22:13:00Z"
  },
  {
    "title": "Federal health minister non-committal on signing more pharmacare deals",
    "description": "OTTAWA — Federal Health Minister Marjorie Michel is not committing to sign pharmacare funding deals with all provinces and territories.",
    "link": "https://www.sootoday.com/national-news/federal-health-minister-non-committal-on-signing-more-pharmacare-deals-10989177",
    "timestamp": "2025-07-24T22:11:46Z"
  },
  {
    "title": "Trump executive order seeks to limit NIL payments in college sports. Can he?",
    "description": "President Trump signed an executive order that looks to end \"third-party, pay-for-play\" NIL payments for college athletes. Here's what it means.",
    "link": "https://www.tallahassee.com/story/sports/college/fsu/2025/07/24/trump-nil-college-sports-executive-order/85364159007/",
    "timestamp": "2025-07-24T22:11:38Z"
  },
  {
    "title": "Trump releases long-awaited executive order on college athletics. It’s not the quick fix the White House promised | CNN",
    "description": "The Trump administration Thursday released a long-anticipated executive order on college sports, an attempt to provide federal guidance to the wild world of big money that has transformed collegiate athletics in recent years.",
    "link": "https://www.cnn.com/2025/07/24/sport/college-athletics-executive-order-spt",
    "timestamp": "2025-07-24T22:08:51Z"
  },
  {
    "title": "Justice Elena Kagan criticizes pro-Trump rulings, court's lack of explanation",
    "description": "Justice Elena Kagan criticizes pro-Trump rulings, court's lack of explanationgo.com",
    "link": "https://abcnews.go.com/Politics/justice-elena-kagan-criticizes-pro-trump-rulings-courts/story?id=124048835",
    "timestamp": "2025-07-24T22:08:36Z"
  },
  {
    "title": "Republican Oklahoma schools chief to roll out anti-'woke' test for teachers coming in from blue states",
    "description": "Ryan Walters, the far-right, deeply anti-LGBTQ+ Oklahoma schools superintendent, says the state will give teachers moving in from liberal states a test to assure they won’t teach so-called woke ideology.",
    "link": "https://www.advocate.com/politics/republican-oklahoma-anti-woke-test",
    "timestamp": "2025-07-24T22:08:11Z"
  },
  {
    "title": "Floods Are Becoming Deadlier. We Aren’t Worried Enough About It.",
    "description": "Flooding is getting more frequent, extreme, and hard to predict—and most of us are dangerously unaware of its risks.",
    "link": "https://slate.com/business/2025/07/texas-hill-country-nyc-flood-risks-extreme-weather-climate-change.html",
    "timestamp": "2025-07-24T22:07:45Z"
  },
  {
    "title": "Trump signs bill canceling $9 billion in foreign aid and public broadcasting funding",
    "description": "The White House had billed the legislation as a test case for Congress and said more such rescission packages would be on the way.",
    "link": "https://www.pbs.org/newshour/politics/trump-signs-bill-canceling-9-billion-in-foreign-aid-and-public-broadcasting-funding",
    "timestamp": "2025-07-24T22:07:28Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Thursday marked another winning day for the S&P 500 and Nasdaq, as both indexes posted fresh all-time intraday and closing highs.",
    "link": "https://www.cnbc.com/2025/07/24/stock-market-today-live-updates.html",
    "timestamp": "2025-07-24T22:06:15Z"
  },
  {
    "title": "Fact Check: Another old photo of Trump and daughter Ivanka makes the rounds again",
    "description": "The photo gained renewed attention amid broader discussions about Trump's past associations in July 2025.",
    "link": "https://www.snopes.com/fact-check/trump-photo-ivanka/",
    "timestamp": "2025-07-24T22:06:00Z"
  },
  {
    "title": "Another old photo of Trump and daughter Ivanka makes the rounds again",
    "description": "An old photo authentically shows U.S. President Donald Trump with his daughter Ivanka Trump sitting on his lap.",
    "link": "https://www.snopes.com//fact-check/trump-photo-ivanka/",
    "timestamp": "2025-07-24T22:06:00Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Saves College Sports (The White House)",
    "description": "The White House:\nFact Sheet: President Donald J. Trump Saves College Sports  —  SAVING COLLEGE SPORTS: Today, President Donald J. Trump signed an Executive Order to protect student-athletes and collegiate athletic scholarships and opportunities, including in …",
    "link": "https://www.memeorandum.com/250724/p119",
    "timestamp": "2025-07-24T22:05:05Z"
  },
  {
    "title": "The Graying of America",
    "description": "Forget the Golden Age. Based on today’s trends, we’re set for the Silver Age. The general fertility rate is at a new low, according to... Read More\nThe post The Graying of America appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/24/silver-age-fertility-rate-hits-new-low/",
    "timestamp": "2025-07-24T22:04:42Z"
  },
  {
    "title": "Barack Obama’s dirty trick destroyed a presidency — and our trust",
    "description": "It was the dirtiest political trick in US history — and as intended, the Russia hysteria paralyzed the incoming Trump administration.",
    "link": "https://nypost.com/2025/07/24/opinion/obamas-dirty-trick-destroyed-a-presidency-and-our-trust/",
    "timestamp": "2025-07-24T22:04:31Z"
  },
  {
    "title": "Trump signs executive order to regulate the business of college sports",
    "description": "President Donald Trump's new executive order prohibits third-party pay-to-play payments to college athletes after the House v. NCAA settlement on paying college athletes.",
    "link": "https://www.foxnews.com/sports/trump-signs-executive-order-regulate-business-college-sports",
    "timestamp": "2025-07-24T22:03:49Z"
  },
  {
    "title": "Trump administration appeals to Supreme Court to allow $783 million research-funding cuts",
    "description": "The Trump administration’s appeal also takes aim at nearly two dozen cases over funding.",
    "link": "https://www.bostonherald.com/2025/07/24/trump-research-funding-cuts/",
    "timestamp": "2025-07-24T22:03:18Z"
  },
  {
    "title": "Paramount-Skydance Merger Gets the OK From the FCC",
    "description": "Paramount and Skydance’s roughly $8 billion deal is officially cleared to close after months of delay from Trump’s FCC – and after the company finalized a $16 million settlement with the president over ‘60 Minutes.’",
    "link": "http://www.vulture.com/article/paramount-skydance-merger-approved-trump-fcc.html",
    "timestamp": "2025-07-24T22:02:48Z"
  },
  {
    "title": "Crypto, fintech lobbies urge Trump to defend open banking amid big banks’ legal challenge",
    "description": "A coalition of crypto, fintech, and retail trade groups has urged President Donald Trump to take a firm stance in defending the nation’s open banking framework, warning that legal challenges by major banks threaten consumer data rights and could derail the ad…",
    "link": "https://cryptoslate.com/?p=491178",
    "timestamp": "2025-07-24T22:02:16Z"
  },
  {
    "title": "Hosts Of 'The View' Go On Hiatus To Tear Unwary Sailors Apart With Their Talons",
    "description": "THE HIGH SEAS — Following the announcement of the show's annual summer break, the hosts of ABC's The View revealed they were going on hiatus to tear unwary sailors apart with their talons.",
    "link": "https://babylonbee.com/news/hosts-of-the-view-go-on-hiatus-to-tear-unwary-sailors-apart-with-their-talons",
    "timestamp": "2025-07-24T22:01:31Z"
  },
  {
    "title": "Ghislaine Maxwell 'Ready to Drop New Evidence' About Epstein in Prison Meeting With Feds — As Convicted Madam Doing All She Can to Be Set Free",
    "description": "Ghislaine Maxwell is ready to drop new evidence about ex-boyfriend Jeffrey Epstein before she gets deposed by members of congress.",
    "link": "https://radaronline.com/p/ghislaine-maxwell-new-evidence-epstein-prison-meeting-feds/",
    "timestamp": "2025-07-24T22:01:11Z"
  },
  {
    "title": "Tesla Warns of 'Rough Quarters'--Shares Plunge While Alphabet Climbs",
    "description": "Dow Slides Amid Soaring Yields and Mixed Q2 Reports",
    "link": "https://finance.yahoo.com/news/tesla-warns-rough-quarters-shares-220055070.html",
    "timestamp": "2025-07-24T22:00:55Z"
  },
  {
    "title": "‘Stinks of High Corruption’: Schumer Nukes Trump For DOJ Sending Ex-Personal Lawyer to Interview Ghislaine Maxwell",
    "description": "“Attorney General Pam Bondi just does Trump’s bidding. And no matter how you slice it, she lied to the American people.”\nThe post ‘Stinks of High Corruption’: Schumer Nukes Trump For DOJ Sending Ex-Personal Lawyer to Interview Ghislaine Maxwell first appeared…",
    "link": "https://www.mediaite.com/politics/stinks-of-high-corruption-schumer-nukes-trump-for-doj-sending-ex-personal-lawyer-to-interview-ghislaine-maxwell/",
    "timestamp": "2025-07-24T22:00:33Z"
  },
  {
    "title": "Instant Reaction: Trump, Powell Discuss Rates, Clash on Cost of Fed Renovations",
    "description": "Donald Trump downplayed jostling with Federal Reserve Chairman Jerome Powell over cost overruns during a tour of the central bank’s renovation project, even as he used the interaction to again push for lower interest rates.After a tour that saw Trump and Powe…",
    "link": "https://omny.fm/shows/bloomberg-businessweek/instant-reaction-trump-powell-discuss-rates-clash-on-cost-of-fed-renovations",
    "timestamp": "2025-07-24T22:00:33Z"
  },
  {
    "title": "Trade deal with U.S. still weighs on Japan's inflation-hit economy",
    "description": "The Japan-U.S. trade deal provides only a brief relief, as tariffs remain at higher levels than before, threatening to hinder Japan's inflation-plagued economy from recovering, analysts say. While Japan offered an increased $550 billion investment in the U.S.…",
    "link": "https://japantoday.com/category/business/focus-trade-deal-with-u.s.-still-weighs-on-japan%27s-inflation-hit-economy",
    "timestamp": "2025-07-24T22:00:04Z"
  },
  {
    "title": "EXCLUSIVE: Congress Has Power To Rein In Wacky, Wasteful DEI Spending In Science, Watchdog Says",
    "description": "Congress has the power to end diversity, equity and inclusion (DEI) in scientific research grantmaking at the NSF, according to an analysis from OpenTheBooks.",
    "link": "https://dailycaller.com/2025/07/24/congress-dei-spending-science-grantmaking-exclusive/",
    "timestamp": "2025-07-24T22:00:02Z"
  },
  {
    "title": "Here's why MAGA won't abandon Trump over Epstein",
    "description": "By Alex Hinton, Distinguished Professor of Anthropology; Director, Center for the Study of Genocide and Human Rights, Rutgers University — Newark.President Donald Trump signed the wide-ranging One Big Beautiful Bill Act into law on July 4, 2025. It focuses on…",
    "link": "https://www.rawstory.com/maga-trump-2673753365/",
    "timestamp": "2025-07-24T22:00:02Z"
  },
  {
    "title": "Trump, Who Promised To Save TikTok, Threatens To Shut Down TikTok",
    "description": "An anonymous reader quotes a report from Ars Technica: Donald Trump vowed to save TikTok before taking office, claiming only he could make a deal to keep the app operational in the US despite national security concerns. But then, he put Vice President JD Vanc…",
    "link": "https://tech.slashdot.org/story/25/07/24/2019225/trump-who-promised-to-save-tiktok-threatens-to-shut-down-tiktok",
    "timestamp": "2025-07-24T22:00:00Z"
  },
  {
    "title": "Trump heads to Scotland: What to expect from his visit",
    "description": "The BBC's James Cook explains the significance of US President Donald Trump's visit to Scotland.",
    "link": "https://www.bbc.com/news/videos/cz6g633933do",
    "timestamp": "2025-07-24T21:59:16Z"
  },
  {
    "title": "Trump takes time out to open Scottish golf course",
    "description": "His private visit is exceptional as US presidents rarely promote their personal interests so publicly while in office.",
    "link": "https://www.bbc.com/news/articles/cg4r4z2gx2qo",
    "timestamp": "2025-07-24T21:57:22Z"
  }
]