[
  {
    "title": "DOJ devises 'wackadoodle' plan to save Alina Habba's legal cases from collapse: expert",
    "description": "The Department of Justice has concocted an \"unprecedented\" scheme to preserve dozens of criminal cases filed by interim U.S. Attorney Alina Habba after a Manhattan defense attorney challenged her appointment.Defense attorney Thomas Mirigliano, whose client wa…",
    "link": "https://www.rawstory.com/alina-habba-2674259836/",
    "timestamp": "2025-11-03T16:13:52Z"
  },
  {
    "title": "Gregg Jarrett Dunks On Judges Acting Like ‘Super-Presidents’ Thwarting Trump’s Agenda",
    "description": "Fox News legal analyst Gregg Jarrett predicted that rulings blocking Donald Trump from deploying the National Guard to various cities would be overturned.",
    "link": "https://dailycaller.com/2025/11/03/gregg-jarrett-dunks-on-judges-acting-like-super-presidents-thwarting-trumps-agenda/",
    "timestamp": "2025-11-03T16:13:37Z"
  },
  {
    "title": "Judge again bars Trump administration from deploying troops to Portland",
    "description": "The city and state of Oregon sued in September to block the deployment.",
    "link": "https://www.bostonherald.com/2025/11/03/federal-enforcement-oregon/",
    "timestamp": "2025-11-03T16:10:45Z"
  },
  {
    "title": "Mamdani Taunts Cuomo For Getting Last-Minute Trump Endorsement as NYC Early Voting Breaks Record",
    "description": "Democratic New York City mayoral candidate Zohran Mamdani on Monday taunted top rival Andrew Cuomo for receiving a decidedly backhanded endorsement from President Donald Trump.During an interview on CBS News' \"60 Minutes\" that aired on Sunday, Trump criticize…",
    "link": "https://www.commondreams.org/news/zohran-mamdani-andrew-cuomo-2674260071",
    "timestamp": "2025-11-03T16:10:37Z"
  },
  {
    "title": "CBS News Edited Out Part of Trump's “60 Minutes” Interview That He Said Would 'Embarrass' Them, According to Full Transcript",
    "description": "The readout reveals several elements of Trump's interview with the CBS show haven't been shown",
    "link": "https://people.com/trump-suggestion-60-minutes-interview-transcript-cbs-11841877",
    "timestamp": "2025-11-03T16:09:21Z"
  },
  {
    "title": "The New Jersey Problem",
    "description": "Mikie Sherill should be waltzing to victory. And she probably will win the governor of New Jersey race tomorrow, but it’s hardly the kind of statement that Democrats will be hanging their hats on as they go into the midterms, unlike Virginia. Alex Shephard lo…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/the-new-jersey-problem",
    "timestamp": "2025-11-03T16:08:00Z"
  },
  {
    "title": "Defiant George Clooney has no regrets on damning Biden op-ed — but admits Kamala’s run was a ‘mistake’",
    "description": "Harris 'had to run against her own record' in addition to Republican nominee Donald Trump, the Oscar winner told CBS News 'Sunday Morning.'",
    "link": "https://nypost.com/2025/11/03/us-news/defiant-george-clooney-has-no-regrets-on-damning-biden-op-ed-but-admits-kamalas-run-was-a-mistake/",
    "timestamp": "2025-11-03T16:07:14Z"
  },
  {
    "title": "Le président syrien Al-Sharaa se rendra aux États-Unis pour signer un accord d'adhésion de la Syrie à la « coalition internationale » (Anglais)",
    "description": "Thomas Barrack, the US envoy to Syria, said that Syria’s transitional president, Ahmad al-Sharaa, is scheduled to visit Washington on […]",
    "link": "https://english.enabbaladi.net/archives/2025/11/al-sharaa-to-visit-the-us-to-sign-syrias-accession-agreement-to-the-international-coalition/",
    "timestamp": "2025-11-03T16:07:09Z"
  },
  {
    "title": "PM Modi meets exporters to discuss growth strategy",
    "description": "Labour-intensive sectors such as garments, gems & jewellery, leather, marine, engineering, all hit by US tariffs, participated in the meet",
    "link": "https://www.thehindubusinessline.com/economy/pm-modi-meets-exporters-to-discuss-growth-strategy/article70237337.ece",
    "timestamp": "2025-11-03T16:06:57Z"
  },
  {
    "title": "Trump turned tariffs into his foreign-policy weapon. This week, the Supreme Court will decide if he went too far",
    "description": "President Donald Trump sees tariffs — or the threat of them — as a powerful tool to bend nations to his will.\nHe has used them in an unprecedented way, not only as the underpinning of his economic agenda, but also as the cornerstone of his foreign policy in h…",
    "link": "https://biztoc.com/x/6e029f2a02cbfa3c",
    "timestamp": "2025-11-03T16:06:54Z"
  },
  {
    "title": "Mike Johnson Accuses Media of Allowing Dems to Get Away With ‘Most Extreme Example of Gaslighting’ in US History Over Gov Shutdown",
    "description": "Mike Johnson accused the mainstream press of allowing Democrats to get away with the \"most extreme example of gaslighting\" in US history on the gov shutdown\nThe post Mike Johnson Accuses Media of Allowing Dems to Get Away With ‘Most Extreme Example of Gasligh…",
    "link": "https://www.mediaite.com/politics/mike-johnson-accuses-media-of-allowing-dems-to-get-away-with-most-extreme-example-of-gaslighting-in-us-history-over-gov-shutdown/",
    "timestamp": "2025-11-03T16:06:42Z"
  },
  {
    "title": "Hearings to focus on National Guard deployments in the nation’s capital and Memphis, Tennessee",
    "description": "Courts in two states will hear arguments on the legality of the deployment of the National Guard.",
    "link": "https://www.bostonherald.com/2025/11/03/national-guard-deployment-hearings/",
    "timestamp": "2025-11-03T16:05:21Z"
  },
  {
    "title": "Trump Declares ICE Hasn’t Gone Far Enough in Chilling Threat",
    "description": "Donald Trump isn’t fazed by any of his federal agents’ violent immigration raids.",
    "link": "https://newrepublic.com/post/202585/trump-ice-not-far-enough-60-minutes",
    "timestamp": "2025-11-03T16:03:12Z"
  },
  {
    "title": "Trans Service Members Have Always Been Part of U.S. History",
    "description": "The first time Commander Emily “Hawking” Shilling climbed into the cockpit of a Navy fighter jet after her transition, she knew eyes were on her. Some doubted she would ever be cleared to fly tactical jets again. Others assumed transitioning would ground her …",
    "link": "https://www.advocate.com/history/history-of-trans-miltary-members",
    "timestamp": "2025-11-03T16:03:04Z"
  },
  {
    "title": "Turkey, Muslim allies say Palestinian self-rule key to Gaza future",
    "description": "Gaza’s future must be Palestinian-led and avoid any new system of tutelage, Turkey and six of its top Muslim allies said Monday after talks in Istanbul.  Turkey, which played a central role in forging the now shaky three-week-old ceasefire, is pushing for Mus…",
    "link": "https://www.digitaljournal.com/world/turkey-muslim-allies-say-palestinian-self-rule-key-to-gaza-future/article",
    "timestamp": "2025-11-03T16:02:20Z"
  },
  {
    "title": "Trump turned tariffs into his foreign-policy weapon. This week, the Supreme Court will decide if he went too far",
    "description": "White House press secretary Karoline Leavitt said that the Trump trade team is working on contingency plans should the high court rule against him.",
    "link": "https://fortune.com/2025/11/03/trump-tariffs-supreme-court-foreign-policy-weapon/",
    "timestamp": "2025-11-03T16:01:42Z"
  },
  {
    "title": "Donald Trump endorses Nassau Exec Bruce Blakeman in move that could sway Long Island race: ‘100% MAGA’",
    "description": "President Trump threw his support behind Bruce Blakeman in a Sunday Truth Social post, calling him an “America First Patriot” as he urged Nassau residents to vote for the incumbent.",
    "link": "https://nypost.com/2025/11/03/us-news/donald-trump-endorses-nassau-exec-bruce-blakeman-in-move-that-could-sway-long-island-race/",
    "timestamp": "2025-11-03T16:01:17Z"
  },
  {
    "title": "Snap benefits in limbo as judges press Trump administration to fund food aid",
    "description": "One in eight Americans receive a food assistance programme called Snap, which has gone unfunded since Saturday.",
    "link": "https://www.bbc.com/news/articles/cglg632n719o",
    "timestamp": "2025-11-03T16:00:49Z"
  },
  {
    "title": "President Trump Sets New Course with Shipbuilding and Maritime Plans",
    "description": "US will share tech information on nuclear subs with let South Korea, partner with Japan on shipbuilding, and plans E.O. returning U.S. Naval ships back to steam for catapults and hydraulic systems for elevators.\nThe post President Trump Sets New Course with S…",
    "link": "https://legalinsurrection.com/2025/11/president-trump-sets-new-course-with-shipbuilding-and-maritime-plans/",
    "timestamp": "2025-11-03T16:00:40Z"
  },
  {
    "title": "Heather Cox Richardson: Trump Repeatedly Ignores and Defies the Law",
    "description": "Heather Cox Richardson reviews Trump’s flagrant indifference to the law. She writes: Yesterday I wrote that President Donald J. Trump’s celebration of his new marble bathroom in the White House was so tone deaf at a time when federal employees are working wit…",
    "link": "https://dianeravitch.net/2025/11/03/heather-cox-richardson-trump-repeatedly-ignores-the-law/",
    "timestamp": "2025-11-03T16:00:00Z"
  },
  {
    "title": "Clashing credos will determine Gaza’s future",
    "description": "Trump and his Real Estate moguls insist that the war is over. For Hamas that would be heresy. Opinion.",
    "link": "https://www.israelnationalnews.com/news/417233",
    "timestamp": "2025-11-03T16:00:00Z"
  },
  {
    "title": "War Crimes Stacking Up: Three More Killed In US Attack On A Venezuelan Boat",
    "description": "The United States is committing more war crimes, unapologetically, as it strikes and kills three more people on another alleged trafficking vessel in the Caribbean Sea. Secretary of War Pete Hegseth said that \"the Department of War carried out a lethal kineti…",
    "link": "https://www.shtfplan.com/member-exclusive/war-crimes-stacking-up-three-more-killed-in-us-attack-on-a-venezuelan-boat",
    "timestamp": "2025-11-03T16:00:00Z"
  },
  {
    "title": "Trump Is Renovating the Lincoln Bathroom",
    "description": "The burden of office must rest heavily on Trump’s shoulders. But foreign policy and economic policy are not what captures his imagination and passion. He loves decorating and renovating. The Washington Post reported that he has undertaken the upgrade of the L…",
    "link": "https://dianeravitch.net/2025/11/03/trump-is-renovating-the-lincoln-bathroom/",
    "timestamp": "2025-11-03T16:00:00Z"
  },
  {
    "title": "Are Americans Better Or Worse Off Since January?",
    "description": "By Victor Davis Hanson, The Daily Signal | November 01, 2025\nThe left wing and media rage hysterically from one Trump psychodrama to the next, while President Donald Trump trolls both on social media.\nBut all that is verbiage. What matters is the data and fac…",
    "link": "https://biztoc.com/x/e6fe42c3c7c4255d",
    "timestamp": "2025-11-03T15:56:01Z"
  },
  {
    "title": "FBI raid at Idaho horse track shows how immigration is a top focus across law enforcement",
    "description": "More than 200 officers from at least 14 agencies detained around 400 people.",
    "link": "https://www.bostonherald.com/2025/11/03/immigration-gambling-raid-idaho/",
    "timestamp": "2025-11-03T15:55:27Z"
  },
  {
    "title": "Here's What CBS Cut Out Of Its ‘60 Minutes’ Interview With Trump",
    "description": "CBS aired a condensed, 28-minute version of a 73-minute interview for “60 Minutes.”",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/11/03/heres-what-cbs-cut-out-of-its-60-minutes-interview-with-trump/",
    "timestamp": "2025-11-03T15:54:21Z"
  },
  {
    "title": "Big manufacturing economies struggle as US tariffs hit order books",
    "description": "Global manufacturing faced a tough October. Weak demand from the United States and President Donald Trump's tariffs hit factory orders. Major economies like the Eurozone and China saw manufacturing activity slow or contract. While some countries experienced m…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/big-manufacturing-economies-struggle-as-us-tariffs-hit-order-books/articleshow/125062891.cms",
    "timestamp": "2025-11-03T15:51:40Z"
  },
  {
    "title": "Tylenol, Kleenex, Band-Aid and more put under one roof in $48.7 billion consumer brands deal",
    "description": "Shareholders of Kimberly-Clark will own about 54% of the combined company.",
    "link": "https://www.bostonherald.com/2025/11/03/tylenol-sold-deal/",
    "timestamp": "2025-11-03T15:51:33Z"
  },
  {
    "title": "New Pentagon memo dictates how transgender troops must look to defend their service",
    "description": "The Trump administration has formalized a process to remove transgender Americans from military service through a seven-page Pentagon memorandum that advocates and legal experts say transforms discrimination into official policy under the guise of “readiness.”",
    "link": "https://www.advocate.com/politics/pentagon-transgender-dress-grooming-policy",
    "timestamp": "2025-11-03T15:51:03Z"
  },
  {
    "title": "Tylenol, Kleenex, Band-Aid and more put under one roof in $48.7 billion consumer brands deal",
    "description": "Kenvue shareholders will receive $3.50 per share in cash and 0.14625 Kimberly-Clark shares for each Kenvue share held at closing.",
    "link": "https://www.pbs.org/newshour/economy/tylenol-kleenex-band-aid-and-more-put-under-one-roof-in-48-7-billion-consumer-brands-deal",
    "timestamp": "2025-11-03T15:49:29Z"
  },
  {
    "title": "Trump Reveals Long-Awaited Endorsement in New York City Mayoral Race",
    "description": "After months of declining to weigh in, President Donald Trump has revealed his preferred candidate in the New York City mayoral race. “If it’s going... Read More\nThe post Trump Reveals Long-Awaited Endorsement in New York City Mayoral Race appeared first on T…",
    "link": "https://www.dailysignal.com/2025/11/03/trump-reveals-long-awaited-endorsement-new-york-city-mayoral-race/",
    "timestamp": "2025-11-03T15:46:28Z"
  },
  {
    "title": "Marvel Mogul Seated Next to Trump at Mar-a-Lago Gatsby Bash",
    "description": "Isaac \"Ike\" Perlmutter held court with the president and Marco Rubio at the Palm Beach Halloween bash.",
    "link": "http://www.hollywoodreporter.com/business/business-news/isaac-perlmutter-donald-trump-halloween-1236416587/",
    "timestamp": "2025-11-03T15:46:06Z"
  },
  {
    "title": "President Trump Slams Seth Meyers As “A Truly Deranged Lunatic” Who Is “100% Anti Trump”",
    "description": "Trump said he had tuned into Late Night \"for the first time in years\" – and he was not impressed.",
    "link": "https://decider.com/2025/11/03/president-trump-slams-seth-meyers-as-a-truly-deranged-lunatic-who-is-100-anti-trump/",
    "timestamp": "2025-11-03T15:45:51Z"
  },
  {
    "title": "One Section of Donald Trump's '60 Minutes' Interview Gets Cut, Goes Viral After CBS Posts Transcript",
    "description": "There’s one part of Donald Trump‘s interview with 60 Minutes that is going viral after CBS edited it out of the broadcast. If you don’t know, the 79-year-old POTUS sat down with Norah O’Donnell on the news program on Sunday night (November 2), but they did no…",
    "link": "https://www.justjared.com/2025/11/03/a-section-of-donald-trumps-60-minutes-interview-gets-cut-goes-viral-after-cbs-posts-transcript/",
    "timestamp": "2025-11-03T15:45:35Z"
  },
  {
    "title": "US govt shutdown could become longest ever as Trump says he 'won't be extorted' by Democrats",
    "description": "The government shutdown is on track to become the longest in history as negotiations between Democrats and Republicans remain stalled. Millions face the loss of food aid and expiring healthcare subsidies, with President Trump refusing to negotiate until the g…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-govt-shutdown-could-become-longest-ever-as-trump-says-he-wont-be-extorted-by-democrats/articleshow/125062806.cms",
    "timestamp": "2025-11-03T15:45:35Z"
  },
  {
    "title": "Trump says he has 'no idea who' Binance's CZ is after pardoning him",
    "description": "President Donald Trump said he knows nothing about Binance founder Changpeng Zhao — or that company's recent involvement in a cryptocurrency venture linked to Trump's family — despite granting him a pardon last month.\nAsked in a CBS \"60 Minutes\" interview tha…",
    "link": "https://biztoc.com/x/68d76e2a30e309d5",
    "timestamp": "2025-11-03T15:45:23Z"
  },
  {
    "title": "Trump threatens Nigeria with a ‘guns-a-blazing’ response, adding to his target list",
    "description": "As Donald Trump eyes possible military intervention in Nigeria, it’s worth appreciating just how long the Republican's international target list has become.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-threatens-nigeria-guns-blazing-response-adding-target-list-rcna241583",
    "timestamp": "2025-11-03T15:45:20Z"
  },
  {
    "title": "Zohran Mamdani spews word salad excuse after Barack Obama endorsement snub just one day before election",
    "description": "Democratic nominee and proud socialist Zohran Mamdani tried to downplay former President Barack Obama’s refusal to offer up an endorsement over the weekend — with just one day left in one of the most-watched races in the country. “I appreciated the call with …",
    "link": "https://nypost.com/2025/11/03/us-news/zohran-mamdani-spews-word-salad-excuse-after-barack-obama-endorsement-snub-just-one-day-before-election/",
    "timestamp": "2025-11-03T15:45:13Z"
  },
  {
    "title": "Trump backtracks on attending Supreme Court tariffs case arguments",
    "description": "President Donald Trump, who recently suggested he would be at the Supreme Court on Wednesday for oral arguments in the case that will determine the fate of many of his wide-ranging tariffs, now says he will not attend.\n\"I will not be going to the Court on Wed…",
    "link": "https://biztoc.com/x/03cae53cd418f1a2",
    "timestamp": "2025-11-03T15:45:09Z"
  },
  {
    "title": "Kimberly-Clark buys Tylenol maker Kenvue in a cash and stock deal for $48.7 billion",
    "description": "Kimberly-Clark is buying Tylenol maker Kenvue in a cash and stock deal worth about $48.7 billion, creating a massive consumer health goods company.",
    "link": "https://nypost.com/2025/11/03/business/tylenol-kleenex-band-aid-and-more-put-under-one-roof-in-48-7-billion-deal/",
    "timestamp": "2025-11-03T15:44:45Z"
  },
  {
    "title": "Energy secretary reveals how US nuclear tests will work",
    "description": "Energy Secretary Christopher Wright clarifies U.S. nuclear testing plans, confirming no explosive detonations but systems testing of weapons components instead.",
    "link": "https://www.foxnews.com/politics/energy-secretary-reveals-how-us-nuclear-tests-work",
    "timestamp": "2025-11-03T15:44:19Z"
  },
  {
    "title": "Nvidia and other tech companies prop up Wall Street as most stocks fall",
    "description": "The S&P 500 was virtually unchanged Monday, even though the majority of stocks within the index were falling.",
    "link": "https://www.bostonherald.com/2025/11/03/wall-street-tech-companies-boost/",
    "timestamp": "2025-11-03T15:43:42Z"
  },
  {
    "title": "The new great game over rare earths",
    "description": "China's export curbs on vital Rare Earth Elements are escalating global trade tensions. This highlights the world's deep dependence on China for these critical minerals. India faces significant economic and strategic implications. Swift policy responses are n…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/the-new-great-game-over-rare-earths/articleshow/125062644.cms",
    "timestamp": "2025-11-03T15:42:35Z"
  },
  {
    "title": "Trump backtracks on attending Supreme Court tariffs case arguments",
    "description": "Lower federal courts ruled that President Trump did not have authority under the law he cited to imposed reciprocal and fentanyl tariffs on imports.",
    "link": "https://www.cnbc.com/2025/11/03/trump-supreme-court-tariffs-trade-arguments.html",
    "timestamp": "2025-11-03T15:39:28Z"
  },
  {
    "title": "Trump says he has 'no idea who' Binance's CZ is after pardoning him",
    "description": "Trump's claim that he doesn't know about the ex-Binance CEO comes as he and Republicans target former President Joe Biden's pardon over his \"autopen\" use.",
    "link": "https://www.cnbc.com/2025/11/03/trump-60-minutes-binance-cz-pardon.html",
    "timestamp": "2025-11-03T15:39:19Z"
  },
  {
    "title": "Doctor talks Trump's 'brain fog' as health fears mount - NewsBreak",
    "description": "There could finally be an explanation for President Donald Trump’s rumored health problems — and it’s disturbing, Knewz.com can reveal.  What’s wrong with",
    "link": "https://www.newsbreak.com/share/4327516218353-doctor-talks-trump-s-brain-fog-as-health-fears-mount?_f=app_share&amp;pd=03GqxCC4&amp;lang=en_US&amp;send_time=1762184316&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.36.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-03T15:39:04Z"
  },
  {
    "title": "America, the Juvenile",
    "description": "The Trump administration is a regime of troubled grade-schoolers.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/11/trump-maga-insults-trolling/684786/",
    "timestamp": "2025-11-03T15:37:51Z"
  },
  {
    "title": "Trump’s Secret Weapon Is His Incompetence",
    "description": "Rebecca Gordon\n\n\n\nThe president’s spectacular ineptitude frequently winds up benefiting those in power. \r\n\n\r\n\n\nThe post Trump’s Secret Weapon Is His Incompetence appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/donald-trump-strategic-incompetence/",
    "timestamp": "2025-11-03T15:37:12Z"
  },
  {
    "title": "Worried Trump, 79, Makes Total Supreme Court U-Turn",
    "description": "President Donald Trump has abandoned his controversial plan to attend oral arguments for the Supreme Court case that will decide the fate of his signature...",
    "link": "https://www.thedailybeast.com/worried-donald-trump-79-makes-total-supreme-court-u-turn-on-tariffs-case/",
    "timestamp": "2025-11-03T15:35:39Z"
  },
  {
    "title": "Trump says it would be 'hard for me' to fund New York City if Mamdani becomes mayor",
    "description": "Left-wing candidate Zohran Mamdani is leading many opinion polls in Tuesday's mayoral race.",
    "link": "https://www.bbc.com/news/articles/c231e284345o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-11-03T15:34:55Z"
  },
  {
    "title": "Trump says it would be 'hard for me' to fund New York City if Mamdani becomes mayor",
    "description": "Left-wing candidate Zohran Mamdani is leading many opinion polls in Tuesday's mayoral race.",
    "link": "https://www.bbc.com/news/articles/c231e284345o",
    "timestamp": "2025-11-03T15:34:50Z"
  },
  {
    "title": "Government shutdown could become longest ever as Trump says he ‘won’t be extorted’ by Democrats",
    "description": "President Donald Trump says he \"won't be extorted\" by Democrats to reopen the government, making clear he has no plans to negotiate.",
    "link": "https://biztoc.com/x/a9a188bdc861fcb8",
    "timestamp": "2025-11-03T15:33:36Z"
  },
  {
    "title": "Goldman Sachs CEO says AI-induced growth offers a ‘path out’ of America’s $38 trillion debt crisis",
    "description": "\"The path out is a growth path,\" Solomon said. \"The difference between compounding growth of 3% and 2% is monstrous in terms of dealing with this issue.\"",
    "link": "https://fortune.com/2025/11/03/goldman-sachs-david-solomon-path-growth-ai-productivity/",
    "timestamp": "2025-11-03T15:33:08Z"
  },
  {
    "title": "Obama Judge’s Bid To Help Deep State Spy On GOP In Secret May Have Violated Federal Law",
    "description": "Judge James Boasberg signed nondisclosure orders preventing cell phone carriers from notifying members of Congress their records had been subpoenaed.",
    "link": "https://dailycaller.com/2025/11/03/obama-judge-james-boasberg-jack-smith-secret-subpoenas-federal-law/",
    "timestamp": "2025-11-03T15:30:17Z"
  },
  {
    "title": "What is President Donald Trump's current approval rating? See the most recent polls",
    "description": "Presidential approval ratings show Americans' views during each term. See what the latest polls rated Donald Trump and how it compares to past terms.",
    "link": "https://www.azcentral.com/story/news/politics/arizona/2025/11/03/donald-trumps-approval-rating-see-the-latest-polls/87018536007/",
    "timestamp": "2025-11-03T15:27:31Z"
  },
  {
    "title": "US manufacturing contracts further in October; supplier delivery times lengthen",
    "description": "American factories saw a decline for the eighth month in a row during October. New orders remained low, and suppliers took longer to deliver materials. Tariffs on imported goods are impacting production. This trend continues despite some positive signs in con…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-manufacturing-contracts-further-in-october-supplier-delivery-times-lengthen/articleshow/125062562.cms",
    "timestamp": "2025-11-03T15:27:12Z"
  },
  {
    "title": "Leftist Canada PM Mark Carney, Elected to Challenge Trump, Apologizes to Trump",
    "description": "Leftist Canadian Prime Minister Mark Carney admitted this weekend he had apologized to President Donald Trump in person during their mutual attendance at events related to the Asia-Pacific Economic Cooperation (APEC) summit in South Korea last week. Carney ma…",
    "link": "https://freerepublic.com/focus/f-news/4350413/posts",
    "timestamp": "2025-11-03T15:26:28Z"
  },
  {
    "title": "Chuck Schumer Floats Filing FCC Complaint Over The Way CBS Edited Donald Trump’s ’60 Minutes’ Interview",
    "description": "Senate Minority Leader Chuck Schumer offered his take on Donald Trump’s sit down with 60 Minutes, riffing that he should perhaps file a complaint with the FCC over the way that the interview was edited. Schumer wrote on X, “Maybe I should file a complaint wit…",
    "link": "http://deadline.com/2025/11/chuck-schumer-trump-60-minutes-1236605303/",
    "timestamp": "2025-11-03T15:25:58Z"
  },
  {
    "title": "Key takeaways from Trump’s 60 Minutes interview",
    "description": "The US president appeared on the news show for the first time since 2020, when he walked out during an interview.",
    "link": "https://www.aljazeera.com/news/2025/11/3/key-takeaways-from-trumps-60-minutes-interview",
    "timestamp": "2025-11-03T15:25:36Z"
  },
  {
    "title": "‘Not secret’: Judge unseals latest in Letitia James lawfare agenda",
    "description": "Indicted New York attorney general fighting 'selective enforcement' investigation",
    "link": "https://www.wnd.com/2025/11/not-secret-judge-unseals-latest-letitia-james-lawfare/",
    "timestamp": "2025-11-03T15:24:09Z"
  },
  {
    "title": "Here Are The Major Takeaways — And 1 Thing You Didn't See — From Trump's '60 Minutes' Interview",
    "description": "The president's rambling appearance on the CBS News program was mostly standard Trump fare. Except when it wasn't.",
    "link": "https://www.huffpost.com/entry/trump-60-minutes-takeaways_n_6908bf49e4b0ad5446e0dc7a",
    "timestamp": "2025-11-03T15:23:50Z"
  },
  {
    "title": "President Trump Calls Chuck Schumer 'Kamikaze Pilot' Over Government Shutdown",
    "description": "Fresh off his 3-country tour across Asia, President Donald Trump may have learned some new terms ... and he couldn't wait to use one of them in a sit-down on \"60 Minutes.\" In an extended interview clip from Sunday night's program, POTUS tells Norah…",
    "link": "https://www.tmz.com/2025/11/03/donald-trump-chuck-schumer-kamikaze-government-shutdown/",
    "timestamp": "2025-11-03T15:23:37Z"
  },
  {
    "title": "2025’s AI Spending Frenzy Continues: OpenAI Signs $38 Billion Cloud Deal With Amazon(List)",
    "description": "Spending on AI has accelerated in recent months, as Wall Street anticipates global expenditures nearing half a trillion dollars by 2026.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/11/03/2025s-ai-spending-frenzy-continues-openai-signs-38-billion-cloud-deal-with-amazonlist/",
    "timestamp": "2025-11-03T15:23:06Z"
  },
  {
    "title": "Putin unveils 'unstoppable' nuclear weapon capable of producing 'radioactive tidal waves'",
    "description": "Russia has unveiled its latest addition to the nation's nuclear arsenal, a Khabarovsk submarine capable of Russia's Poseidon nuclear drones.",
    "link": "https://www.ladbible.com/news/world-news/russia-new-nuclear-submarine-khabarovsk-putin-583590-20251103",
    "timestamp": "2025-11-03T15:23:06Z"
  },
  {
    "title": "Xi Quips About Backdoors During Xiaomi Phone Gift To Korea's Lee",
    "description": "An anonymous reader shares a report: Chinese President Xi Jinping joked about security backdoors while presenting a pair of Xiaomi smartphones to his South Korean counterpart, a rare moment of spontaneous levity captured during a week of tense trade negotiati…",
    "link": "https://it.slashdot.org/story/25/11/03/1523219/xi-quips-about-backdoors-during-xiaomi-phone-gift-to-koreas-lee",
    "timestamp": "2025-11-03T15:23:00Z"
  },
  {
    "title": "“No, You’re Wrong”: Trump Spirals When Pressed on Rising Food Prices",
    "description": "Donald Trump freaked out on 60 Minutes when he was reminded that the stock market doesn’t benefit everyone but everyone goes to the grocery store.",
    "link": "https://newrepublic.com/post/202586/no-youre-wrong-trump-spirals-food-prices-60-minutes",
    "timestamp": "2025-11-03T15:21:37Z"
  },
  {
    "title": "Trump Flails Trying to Distract From His Failure to Control Putin",
    "description": "Donald Trump waved around pieces of paper touting his success rather than discuss Ukraine.",
    "link": "https://newrepublic.com/post/202589/donald-trump-distract-failure-putin-ukraine",
    "timestamp": "2025-11-03T15:20:01Z"
  },
  {
    "title": "EU baffled by mixed US-China signals on rare earths restrictions",
    "description": "The European Commission’s bewilderment also comes despite a meeting of EU and Chinese trade officials in Brussels last week",
    "link": "https://www.euractiv.com/news/eu-baffled-by-mixed-us-china-signals-on-rare-earths-restrictions/",
    "timestamp": "2025-11-03T15:19:46Z"
  },
  {
    "title": "Trump says he ‘won’t be extorted’ as the shutdown is about to become the longest ever—and millions could soon lose food aid",
    "description": "As the shutdown drags on, the White House is leaning into online trolling with fake MySpace pages and memes.",
    "link": "https://fortune.com/2025/11/03/trump-government-shutdown-extorted-democrats-snap-food-aid/",
    "timestamp": "2025-11-03T15:17:30Z"
  },
  {
    "title": "After mistaken deportation, Abrego Garcia fights smuggling charges. Here’s what to know",
    "description": "A judge next month will hear arguments on Kilmar Abrego Garcia's motion to dismiss charges of human smuggling against him on the grounds of “vindictive prosecution.\"",
    "link": "https://www.bostonherald.com/2025/11/03/abrego-garcia-smuggling-charges/",
    "timestamp": "2025-11-03T15:17:20Z"
  },
  {
    "title": "Government shutdown could become longest ever as Trump says he ‘won’t be extorted’ by Democrats",
    "description": "President Donald Trump says he \"won't be extorted\" by Democrats to reopen the government, making clear he has no plans to negotiate.",
    "link": "https://www.pbs.org/newshour/politics/government-shutdown-could-become-longest-ever-as-trump-says-he-wont-be-extorted-by-democrats",
    "timestamp": "2025-11-03T15:16:22Z"
  },
  {
    "title": "Here's Michael Saylor's Year End Bitcoin Price Target",
    "description": "Bitcoin would reach $150,000 by year end, according to Strategy (NASDAQ:MSTR) Chair Michael Saylor. “Our expectation right now is end of the year, it...",
    "link": "https://finance.yahoo.com/news/heres-michael-saylors-end-bitcoin-151605535.html",
    "timestamp": "2025-11-03T15:16:05Z"
  },
  {
    "title": "Erika Kirk Recalls Heartbreaking Conversations With Daughter in First Interview Since Charlie Kirk Assassination",
    "description": "Watters talked with Kirk’s widow, who he married in 2021 and with whom he had two children, about how she relayed the news of his death to his young daughter.\nThe post Erika Kirk Recalls Heartbreaking Conversations With Daughter in First Interview Since Charl…",
    "link": "https://www.mediaite.com/media/tv/erika-kirk-recalls-heartbreaking-conversations-with-daughter-in-first-interview-since-charlie-kirk-assassination/",
    "timestamp": "2025-11-03T15:16:00Z"
  },
  {
    "title": "Untangling The Tariff And Tax Delegation Case At The Supreme Court",
    "description": "Marie Sapirie argues that two companies’ nondelegation argument in their Supreme Court challenge to President Trump’s tariff actions is unlikely to succeed.",
    "link": "https://www.forbes.com/sites/taxnotes/2025/11/03/untangling-the-tariff-and-tax-delegation-case-at-the-supreme-court/",
    "timestamp": "2025-11-03T15:14:49Z"
  },
  {
    "title": "FDA's top drug regulator resigns after federal officials probe 'serious concerns'",
    "description": "The head of the Food and Drug Administration’s drug center abruptly resigned Sunday amid concerns about his personal conduct",
    "link": "https://www.wftv.com/news/health/fdas-top-drug/BCMJ5ASA4Y7PXJ7YDIMWW2I5MU/",
    "timestamp": "2025-11-03T15:14:42Z"
  },
  {
    "title": "The Democratic Thrill for Mamdani Is a Tell",
    "description": "What political insurgencies can teach us about major parties.",
    "link": "https://reason.com/2025/11/03/the-democratic-thrill-for-mamdani-is-a-tell/",
    "timestamp": "2025-11-03T15:13:16Z"
  },
  {
    "title": "One year out from Election Day 2026, Tuesday's results could shape 2026 midterms - ABC News",
    "description": "One year out from Election Day 2026, Tuesday's results could shape 2026 midtermsABC News 5 key races to watch on Election Day 2025Fox News November 2, 2025 - Trump administration and government shutdown newsCNN What’s on the ballot in the first general electi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179951414",
    "timestamp": "2025-11-03T15:13:11Z"
  },
  {
    "title": "Christian, Muslim Nigerians Push Back On Threatened US Strikes - Barron's",
    "description": "Christian, Muslim Nigerians Push Back On Threatened US StrikesBarron's Trump threat of military action in Nigeria prompts confusion and alarmThe Washington Post Donald Trump warns Nigeria that US troops or airstrikes 'could be' used to prevent killing of Chri…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179951410",
    "timestamp": "2025-11-03T15:12:50Z"
  },
  {
    "title": "Businesses press Supreme Court to strike down Donald Trump’s emergency tariff power",
    "description": "Businesses are pressing the U.S. Supreme Court to rule against Trump's emergency tariff powers ahead of a hearing this week. Read here",
    "link": "https://financialpost.com/financial-times/supreme-court-trump-tariff-power",
    "timestamp": "2025-11-03T15:12:46Z"
  },
  {
    "title": "Deadline nears for Trump administration to comply with court orders for SNAP funding",
    "description": "President Donald Trump’s administration faces deadlines on Monday to tell two federal judges whether it will comply with court orders that it continue to fund SNAP, the nation’s biggest food aid program, using contingency funds during the government shutdown.…",
    "link": "https://biztoc.com/x/12abf50e31b9ef5a",
    "timestamp": "2025-11-03T15:11:40Z"
  },
  {
    "title": "Hegseth visits inter-Korean border ahead of security talks with South Korean officials",
    "description": "Hegseth and South Korean Defense Minister Ahn Gyu-back received a briefing at Observation Post Ouellette, a site visited by past U.S. presidents.",
    "link": "https://www.pbs.org/newshour/politics/hegseth-visits-inter-korean-border-ahead-of-security-talks-with-south-korean-officials",
    "timestamp": "2025-11-03T15:11:13Z"
  },
  {
    "title": "Nick Fuentes Is the GOP’s Latest Frankenstein Monster",
    "description": "Jeet Heer\n\n\n\nThe extremist podcaster’s rise and rise is a sign that racists and antisemites are tired of being the junior partners in the Republican coalition.\r\n\n\r\n\n\nThe post Nick Fuentes Is the GOP’s Latest Frankenstein Monster appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/nick-fuentes-tucker-carlson-interview-analysis/",
    "timestamp": "2025-11-03T15:10:08Z"
  },
  {
    "title": "Trump Fires Back At CBS News’ Norah O’Donnell Suggesting He’s Seeking Political Retribution Against Opponents",
    "description": "President Donald Trump shot back at CBS News' Norah O'Donnell on Sunday as she suggested that he is seeking \"political retribution\" against his opponents.",
    "link": "https://dailycaller.com/2025/11/03/trump-cbs-norah-odonnell-political-retribution-comey-tish-james/",
    "timestamp": "2025-11-03T15:09:44Z"
  },
  {
    "title": "Judge Blocks Trump from Deploying National Guard to Portland, Says Anti-ICE Protests Haven't Gotten Violent Enough Yet",
    "description": "Judge Blocks Trump from Deploying National Guard to Portland, Says Anti-ICE Protests Haven't Gotten Violent Enough Yetwesternjournal.com",
    "link": "https://www.westernjournal.com/federal-judge-blocks-trump-deploying-national-guard-portland-says-anti-ice-protests-havent-gotten-violent-enough-yet/",
    "timestamp": "2025-11-03T15:09:29Z"
  },
  {
    "title": "Ex-White House Doctor Calls Out Red Flag in Trump Health Saga - NewsBreak",
    "description": "A top doctor to three U.S. presidents is calling BS on the MAGA administration’s claims that 79-year-old Donald Trump is still in the prime of his life. Je",
    "link": "https://www.newsbreak.com/share/4327814852860-ex-white-house-doctor-calls-out-red-flag-in-trump-health-saga?_f=app_share&amp;pd=03GqxCC4&amp;lang=en_US&amp;send_time=1762182311&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.36.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-03T15:08:14Z"
  },
  {
    "title": "Ex-White House Doctor Calls Out Red Flag in Trump Health Saga - NewsBreak",
    "description": "A top doctor to three U.S. presidents is calling BS on the MAGA administration’s claims that 79-year-old Donald Trump is still in the prime of his life. Je",
    "link": "https://www.newsbreak.com/share/4327814852860-ex-white-house-doctor-calls-out-red-flag-in-trump-health-saga?_f=app_share&amp;pd=03GqxCC4&amp;lang=en_US&amp;send_time=1762182336&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.36.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-03T15:06:42Z"
  },
  {
    "title": "Leftist Canada PM Mark Carney, Elected to Challenge Trump, Apologizes to Trump",
    "description": "Leftist Canadian Prime Minister Mark Carney admitted this weekend that he had apologized to President Donald Trump in person during their mutual attendance at events related to the Asia-Pacific Economic Cooperation (APEC) summit in South Korea last week.\nThe …",
    "link": "https://www.breitbart.com/economy/2025/11/03/leftist-canada-pm-mark-carney-elected-to-challenge-trump-apologizes-to-trump/",
    "timestamp": "2025-11-03T15:06:05Z"
  },
  {
    "title": "The Disgrace of an Ex-Governor: Andrew Cuomo of New York",
    "description": "The entire country will be watching as New Yorkers go to the polls tomorrow to elect the new mayor of the city. Zohran Mamdani, the Muslim-American democratic socialist whose meteoric rise to the top of the Democratic field has made him the front runner, is a…",
    "link": "https://www.commondreams.org/opinion/andrew-cuomo-a-disgrace",
    "timestamp": "2025-11-03T15:05:58Z"
  },
  {
    "title": "A Return to Nuclear Testing",
    "description": "Donald Trump directed “the Department of War to start testing our Nuclear Weapons on an equal basis” with other countries.  The Department of War doesn’t test nuclear weapons, the Department of Energy does all the time in lots of different ways.  Some people …",
    "link": "https://www.armscontrolwonk.com/archive/1220959/a-return-to-nuclear-testing/",
    "timestamp": "2025-11-03T15:02:08Z"
  },
  {
    "title": "Shutdown, Breakdown, Takedown: They're Busted! (Again)",
    "description": "It's your Sunday shows rundown!",
    "link": "https://www.wonkette.com/p/shutdown-breakdown-takedown-theyre",
    "timestamp": "2025-11-03T15:01:48Z"
  },
  {
    "title": "Trump pressed on whether he ordered DOJ to target James Comey, John Bolton, Letitia James",
    "description": "During a \"60 Minutes\" interview, President Donald Trump indicated that he did not direct the U.S. Department of Justice to take aim at James Comey, John Bolton and Letitia James",
    "link": "https://www.foxnews.com/politics/trump-pressed-whether-he-ordered-doj-target-james-comey-john-bolton-letitia-james",
    "timestamp": "2025-11-03T15:00:49Z"
  },
  {
    "title": "Report: Rep. Nancy Pelosi Will Not Seek Reelection",
    "description": "Rep. Nancy Pelosi, D-Calif., reportedly will not seek reelection in 2026 as Democrats are preparing for Pelosi's retirement from Congress. The retirement plans are expected to be announced after Tuesday's elections, multiple party sources told NBC News. Pelos…",
    "link": "https://freerepublic.com/focus/f-chat/4350408/posts",
    "timestamp": "2025-11-03T15:00:21Z"
  }
]