[
  {
    "title": "RFK Jr. struggles to navigate frustrated supporters and a demanding boss",
    "description": "Some of Kennedy’s allies say he’s become almost inaccessible since his confirmation and complain that he’s made glacial progress advancing MAHA goals, such as halting mRNA-based COVID shots and removing fluoride from drinking water.",
    "link": "https://www.pennlive.com/politics/2025/04/rfk-jr-struggles-to-navigate-frustrated-supporters-and-a-demanding-boss.html",
    "timestamp": "2025-04-21T01:08:24Z"
  },
  {
    "title": "Salvadoran Catholic leader urges Bukele not to turn country into US prison",
    "description": "El Salvador's top Catholic leader on Sunday urged President Nayib Bukele not to turn the country into a Guantanamo-style US prison, after Bukele made a deal with Washington to house deported migrants from the United States in a notorious jail.\"We ask that our…",
    "link": "https://www.rawstory.com/salvadoran-catholic-leader-urges-bukele-not-to-turn-country-into-us-prison/",
    "timestamp": "2025-04-21T01:05:19Z"
  },
  {
    "title": "'I was careful and followed instructions closely, but still lost my crypto'",
    "description": "A customer's experience highlights issues dealing with cryptocurrency, where many regular banking safeguards do not apply.",
    "link": "https://www.bbc.com/news/articles/c93gydxj8n7o",
    "timestamp": "2025-04-21T01:04:27Z"
  },
  {
    "title": "US assets decline amid tariff, Fed consternation",
    "description": "The dollar weakened against its major peers with euro among the outperformers. The yen climbed to the strongest level against the greenback since September. Treasuries dropped and equity-index futures for the S&P 500 and the Nasdaq 100 retreated. Japanese sto…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-assets-decline-amid-tariff-fed-consternation/articleshow/120468155.cms",
    "timestamp": "2025-04-21T01:03:46Z"
  },
  {
    "title": "South Korea finds 'Made in Korea' breaches intended to avoid US tariffs",
    "description": "SEOUL (Reuters) -South Korea has found rising attempts to disguise foreign products as Korean exports, mostly from China, to avoid U.S. President Donald...",
    "link": "https://www.yahoo.com/news/south-korea-finds-made-korea-010230620.html",
    "timestamp": "2025-04-21T01:02:30Z"
  },
  {
    "title": "South Korea finds 'Made in Korea' breaches intended to avoid US tariffs",
    "description": "SEOUL (Reuters) -South Korea has found rising attempts to disguise foreign products as Korean exports, mostly from China, to avoid U.S. President Donald...",
    "link": "https://ca.finance.yahoo.com/news/south-korea-finds-made-korea-010230781.html",
    "timestamp": "2025-04-21T01:02:30Z"
  },
  {
    "title": "Report Hegseth Shared Attack Plans in 2nd Signal Chat Sparks Critics' Fury",
    "description": "Defense Secretary Hegseth shared Yemen strike details in a private Signal chat with family and aides despite security warnings.",
    "link": "https://www.newsweek.com/report-pete-hegseth-shared-attack-plans-second-signal-chat-critics-2061948",
    "timestamp": "2025-04-21T01:01:44Z"
  },
  {
    "title": "Zelenskyy says Russia is trying to create an 'impression of a ceasefire' as attacks continue",
    "description": "President Zelenskyy accused Russia of violating the announced Easter ceasefire, citing continued attacks and shelling despite Putin's declaration. Ukraine reported numerous instances of Russian aggression, while Russia accused Ukraine of attacks on its territ…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskyy-says-russia-is-trying-to-create-an-impression-of-a-ceasefire-as-attacks-continue/articleshow/120468147.cms",
    "timestamp": "2025-04-21T01:01:16Z"
  },
  {
    "title": "GOP senator says Trump admin deporting Kilmar Abrego Garcia was a 'screw up'",
    "description": "Sen. John Kennedy said Sunday that the the Trump administration's deportation of Kilmar Abrego Garcia was a \"screw up\" during an interview on \"Meet The Press.\"",
    "link": "https://www.foxnews.com/media/gop-senator-says-trump-admin-deporting-kilmar-abrego-garcia-screw-up",
    "timestamp": "2025-04-21T01:00:32Z"
  },
  {
    "title": "US defense secretary reportedly shared Yemen attack details with family",
    "description": "A month after sharing details of an attack on Houthi rebels in a signal chat group that included a magazine editor, US media outlets are reporting US Defense Secretary Pete Hegseth also shared details about the mission with family members.",
    "link": "https://www.abc.net.au/news/2025-04-21/defence-secretary-pete-hegseth-share-yemen-attack-in-second-chat/105196450",
    "timestamp": "2025-04-21T00:58:11Z"
  },
  {
    "title": "'Big downsizing': GOP plans to snatch health coverage from 'millions of low-income' people",
    "description": "When Democrats recaptured the U.S. House of Representatives in the 2018 midterms and enjoyed a net gain of 41 seats, President Donald Trump's unpopular efforts to overturn the Affordable Care Act of 2010, a.k.a. Obamacare, were cited as a major factor. Obamac…",
    "link": "https://www.rawstory.com/big-downsizing-obamacare-mike-johnson/",
    "timestamp": "2025-04-21T00:55:15Z"
  },
  {
    "title": "China opposes any deals between US, other nations at its expense",
    "description": "BEIJING (Reuters) -China respects all parties resolving economic and trade differences with the United States through consultation on an equal footing, but...",
    "link": "https://ca.finance.yahoo.com/news/china-opposes-deals-between-us-005128264.html",
    "timestamp": "2025-04-21T00:51:28Z"
  },
  {
    "title": "Alito's Dissent In Deportation Case Says Court Rushed To Block Trump With Middle-of-the Night Order",
    "description": "Justice Samuel Alito has written a sharp dissent that castigates the seven-member majority.",
    "link": "https://www.huffpost.com/entry/alito-dissent-trump-deportations_n_68059344e4b079fefa2794b7",
    "timestamp": "2025-04-21T00:50:19Z"
  },
  {
    "title": "Trump Skips Church to Go on Unhinged Easter Posting Spree Instead",
    "description": "President Donald Trump had a lot to get off his chest on Easter Sunday. Trump went on another spiteful Truth Social posting spree, skipping church to spend...",
    "link": "https://www.thedailybeast.com/trump-skips-church-and-goes-on-unhinged-easter-posting-spree-instead/",
    "timestamp": "2025-04-21T00:50:19Z"
  },
  {
    "title": "CNBC Daily Open: Trump’s desire to intervene in Fed could cause chaos",
    "description": "An administration that aims to please the populace might cut rates despite high inflation, leading to further economic difficulties.",
    "link": "https://www.cnbc.com/2025/04/21/cnbc-daily-open-if-trump-intervenes-in-fed-market-trouble-may-ensue.html",
    "timestamp": "2025-04-21T00:48:58Z"
  },
  {
    "title": "Stocks, dollar sink with Fed independence at risk",
    "description": "U.S. stocks, Treasuries and the dollar sank as traders weighed  Trump’s threats to try to remove the Federal Reserve Chairman. Read here",
    "link": "https://financialpost.com/investing/us-assets-decline-amid-tariff-fed-consternation",
    "timestamp": "2025-04-21T00:47:55Z"
  },
  {
    "title": "Stocks, dollar sink with Fed independence at risk",
    "description": "U.S. stocks, Treasuries and the dollar sank as traders weighed Trump’s threats to try to remove the Federal Reserve Chairman. Read here",
    "link": "https://financialpost.com/news/us-assets-decline-amid-tariff-fed-consternation",
    "timestamp": "2025-04-21T00:47:55Z"
  },
  {
    "title": "US Assets Decline Amid Tariff, Fed Consternation: Markets Wrap",
    "description": "US stock-index futures and the dollar fell early Monday as investors remained on edge amid US trade talks with Japan and the European Union, and criticism of the Federal Reserve by President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/us-assets-decline-amid-tariff-fed-consternation-markets-wrap",
    "timestamp": "2025-04-21T00:47:55Z"
  },
  {
    "title": "Trump’s global trade war hangs over Vance’s India visit",
    "description": "Vance’s visit comes as hopes are running high in India that the country can secure a quick deal and a reprieve from weightier levies.",
    "link": "https://www.japantimes.co.jp/news/2025/04/21/world/politics/trump-trade-war-vance-india/",
    "timestamp": "2025-04-21T00:44:00Z"
  },
  {
    "title": "Ukraine: Russia ends Easter truce, resumes Ukraine strikes",
    "description": "The Kremlin says it has restarted air attacks on Ukrainian positions following a surprise 30-hour ceasefire. US President Donald Trump said \"hopefully\" Russia and Ukraine will make a peace deal \"this week.\" DW has more.",
    "link": "https://www.dw.com/en/ukraine-russia-ends-easter-truce-resumes-ukraine-strikes/live-72295513",
    "timestamp": "2025-04-21T00:37:00Z"
  },
  {
    "title": "Ukraine: Russia ends Easter truce, resumes Ukraine strikes",
    "description": "The Kremlin says it has restarted air attacks on Ukrainian positions following a surprise 30-hour ceasefire. US President Donald Trump said \"hopefully\" Russia and Ukraine will make a peace deal \"this week.\" DW has more. Russia says it has resumed fighting aft…",
    "link": "https://www.dw.com/en/ukraine-russia-ends-easter-truce-resumes-strikes/live-72295513",
    "timestamp": "2025-04-21T00:37:00Z"
  },
  {
    "title": "Ukraine: Trump says he's hopeful on 'a deal this week'",
    "description": "US President Donald Trump said \"hopefully\" Russia and Ukraine will make a deal \"this week.\" Elsewhere, Moscow and Kyiv have traded allegations of ceasefire breaches. DW has more. Trump hopeful of a Russia-Ukraine deal this week\nMoscow and Kyiv accuse each oth…",
    "link": "https://www.dw.com/en/ukraine-trump-says-hes-hopeful-on-a-deal-this-week/live-72295513",
    "timestamp": "2025-04-21T00:37:00Z"
  },
  {
    "title": "Donald Trump Makes Christians Furious",
    "description": "\"What did Trump just say about Jesus that made some Christians absolutely lose their minds?\"",
    "link": "https://freerepublic.com/focus/f-religion/4312232/posts",
    "timestamp": "2025-04-21T00:36:04Z"
  },
  {
    "title": "Did DOGE “breach” Americans’ data? (Lock and Code S06E08)",
    "description": "This week on the Lock and Code podcast, we speak with Sydney Saubestre about DOGE and its access to Americans' data.",
    "link": "https://www.malwarebytes.com/blog/podcast/2025/04/did-doge-breach-americans-data-lock-and-code-s06e08",
    "timestamp": "2025-04-21T00:34:00Z"
  },
  {
    "title": "Did DOGE “breach” Americans’ data? (Lock and Code S06E08)",
    "description": "This week on the Lock and Code podcast, we speak with Sydney Saubestre about DOGE and its access to Americans' data.",
    "link": "https://www.malwarebytes.com/blog/uncategorized/2025/04/did-doge-breach-americans-data-lock-and-code-s06e08",
    "timestamp": "2025-04-21T00:34:00Z"
  },
  {
    "title": "First shockwaves of Trump’s tariffs about to hit world economy",
    "description": "New economic forecasts and surveys this week will point to the initial fallout. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/first-shockwaves-of-trumps-tariffs-about-to-hit-world-economy",
    "timestamp": "2025-04-21T00:33:49Z"
  },
  {
    "title": "How Donald Trump is changing the world order - opinion",
    "description": "Since Donald Trump assumed the presidency for a second term, the US is no longer committed to the previous world order it had played such a major role in creating and running",
    "link": "https://www.jpost.com/opinion/article-850808",
    "timestamp": "2025-04-21T00:21:37Z"
  },
  {
    "title": "Google to face off with US government in attempt to break up company in search monopoly case",
    "description": "Google will confront an existential threat Monday as the U.S. government tries to break up the company as punishment for turning its revolutionary search...",
    "link": "https://finance.yahoo.com/news/google-face-off-us-government-002008266.html",
    "timestamp": "2025-04-21T00:20:08Z"
  },
  {
    "title": "Brace yourself, market is likely to get even shakier: Mark Mobius",
    "description": "To export, companies must be able to import machinery and other components and, right now, that is very difficult because of the bureaucracy involved in setting up businesses in India. So, this is an urgent requirement for India to address. If they ease the s…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/brace-yourself-market-is-likely-to-get-even-shakier-mark-mobius/articleshow/120467980.cms",
    "timestamp": "2025-04-21T00:19:04Z"
  },
  {
    "title": "Even as equities bounce investors not ready to lower their guard",
    "description": "Equity market participants have had a roller coaster month so far, with Trump imposing reciprocal tariffs on all countries on April 2, including 26% on India, and then announcing a 90-day pause on tariffs just before its final implementation. Such moves have …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/even-as-equities-bounce-investors-not-ready-to-lower-their-guard/articleshow/120467874.cms",
    "timestamp": "2025-04-21T00:07:52Z"
  },
  {
    "title": "Hegseth had second Signal chat where he shared details of Yemen strike, New York Times reports",
    "description": "WASHINGTON (AP) — Defense Secretary Pete Hegseth created another Signal messaging chat that included his wife and brother where he shared similar details of a<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/hegseth-had-second-signal-chat-where-he-shar…",
    "link": "https://whdh.com/news/hegseth-had-second-signal-chat-where-he-shared-details-of-yemen-strike-new-york-times-reports/",
    "timestamp": "2025-04-21T00:07:37Z"
  },
  {
    "title": "Trump blasts China for pollution in Pacific Ocean",
    "description": "United States President Donald Trump shared via his TruthSocial account photos of polluted areas in the Pacific Ocean, with a comment calling it \"a gift from China.\"The president's remark comes at a t...",
    "link": "https://biztoc.com/x/0ab0252981d37693",
    "timestamp": "2025-04-21T00:05:08Z"
  },
  {
    "title": "Encounter with Leftists at The 250 Year Anniversary of April 19, 1775 in Concord at The Old North Bridge (VANITY)",
    "description": "I live near this event (The April 19th Reenactment of the encounter between Colonials and the British at the Old North Bridge) but had only gone to it once before many years ago, and it was rainy with no visibility of the event due to crowd size. I determined…",
    "link": "https://freerepublic.com/focus/f-news/4312225/posts",
    "timestamp": "2025-04-21T00:03:07Z"
  },
  {
    "title": "Does Khamenei Play Chess?",
    "description": "Israel and several countries in the region, such as Saudi Arabia, are not only concerned about Iran building its first bomb, but also about its capacity to become a nuclear military power and potentially construct a small atomic arsenal within a matter of wee…",
    "link": "https://www.hoover.org/research/does-khamenei-play-chess",
    "timestamp": "2025-04-21T00:00:00Z"
  },
  {
    "title": "First shockwaves of Trump's tariffs are about to hit world economy",
    "description": "The following day, purchasing manager indexes from Japan to Europe to the US will offer the first coordinated glimpse of manufacturing and services activity since Trump's global tariffs-now partly on hold-were unleashed on April 2. Business surveys from major…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/first-shockwaves-of-trumps-tariffs-are-about-to-hit-world-economy/articleshow/120467414.cms",
    "timestamp": "2025-04-20T23:54:43Z"
  },
  {
    "title": "Trump hopeful Russia and Ukraine can make a deal after temporary Easter ceasefire ends",
    "description": "President Trump says he is hopeful that Russia and Ukraine can make a deal this week after a temporary Easter ceasefire was called between the two countries.",
    "link": "https://www.foxnews.com/politics/trump-hopeful-russia-ukraine-can-make-deal-after-temporary-easter-ceasefire-ends",
    "timestamp": "2025-04-20T23:47:56Z"
  },
  {
    "title": "Supreme Court stops deportations",
    "description": "It has become clear that the Trump gang’s plan is to summarily detain and deport people before they have had a chance to challenge their detention in the courts via a habeas corpus petition. Once the people have been deported, they then claim that there is no…",
    "link": "https://freethoughtblogs.com/singham/2025/04/20/supreme-court-stops-deportations/",
    "timestamp": "2025-04-20T23:46:25Z"
  },
  {
    "title": "Kyiv and Moscow accuse each other of breaking Easter ceasefire",
    "description": "Russia and Ukraine blamed each other on Sunday for breaking a one-day Easter ceasefire, and the Kremlin said there was no order for a ceasefire extension.",
    "link": "https://www.nbcnews.com/news/world/kyiv-moscow-accuse-breaking-easter-ceasefire-rcna202064",
    "timestamp": "2025-04-20T23:37:35Z"
  },
  {
    "title": "Ukrainian envoy asks for 30% of Germany’s military equipment",
    "description": "Ukraine’s envoy to the UN has called on Germany to send 30% of its heavy military equipment to Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616035-ukraine-asks-germany-weapons/",
    "timestamp": "2025-04-20T23:30:36Z"
  },
  {
    "title": "Ukraine reports nearly 3,000 violations of Russia's own Easter ceasefire vow",
    "description": "The violations came as U.S. President Donald Trump surprisingly announced that the war rivals could make a \"deal\" this week.",
    "link": "https://www.japantimes.co.jp/news/2025/04/21/world/russia-breaks-ukraine-ceasefire/",
    "timestamp": "2025-04-20T23:29:00Z"
  },
  {
    "title": "Hegseth had a second Signal chat where he shared details of Yemen strike, New York Times reports",
    "description": "By TARA COPP WASHINGTON (AP) — Defense Secretary Pete Hegseth created another Signal messaging chat that included his wife and brother where he shared similar details of a March military airstrike against Yemen’s Houthi militants that were sent in another cha…",
    "link": "https://www.bostonherald.com/2025/04/20/hegseth-had-a-second-signal-chat-where-he-shared-details-of-yemen-strike-new-york-times-reports/",
    "timestamp": "2025-04-20T23:20:11Z"
  },
  {
    "title": "REVEALED: Lengthy rap sheets of Tren de Aragua detainees ACLU, Supreme Court want to keep in US",
    "description": "The Trump administration responded to the Supreme Court’s decision to temporarily block the deportation of illegal immigrant gang members by releasing the criminal records of several individuals alleged to be members of the violent Venezuelan gang Tren de Ara…",
    "link": "https://freerepublic.com/focus/f-news/4312222/posts",
    "timestamp": "2025-04-20T23:15:03Z"
  },
  {
    "title": "Elizabeth Hurley debuts new relationship with Billy Ray Cyrus",
    "description": "The relationship news comes months after the country artist settled his divorce with Firerose",
    "link": "https://www.the-independent.com/life-style/elizabeth-hurley-billy-ray-cyrus-relationship-b2736475.html",
    "timestamp": "2025-04-20T23:14:53Z"
  },
  {
    "title": "Alito says court rushed to block Trump deportations",
    "description": "WASHINGTON — The Supreme Court acted “literally in the middle of the night” and without sufficient explanation in blocking the Trump administration from deporting any Venezuelans held in northern Texas under an 18th-century wartime law, Justice Samuel Alito w…",
    "link": "https://www.bostonherald.com/2025/04/20/alito-says-court-rushed-to-block-trump-deportations/",
    "timestamp": "2025-04-20T23:12:44Z"
  },
  {
    "title": "Jensen Huang says Nvidia will 'continue serving the Chinese market' despite tariffs",
    "description": "Nvidia has lost more than $270 billion in market value this month.",
    "link": "https://www.laptopmag.com/ai/jensen-huang-says-nvidia-will-continue-serving-chinese-market-despite-tariffs",
    "timestamp": "2025-04-20T23:08:24Z"
  },
  {
    "title": "‘Fear across the board’ for undocumented Irish in the United States, says immigration lawyer",
    "description": "An Irish immigration lawyer in the US has warned that people who hold green cards are also ‘feeling afraid’.",
    "link": "https://www.thejournal.ie/fear-across-the-board-for-undocumented-irish-in-the-united-states-6680063-Apr2025/",
    "timestamp": "2025-04-20T23:05:50Z"
  },
  {
    "title": "Chicago Fed: Tariff-Related Panic Buying Could Precede Economic Slump",
    "description": "“Panic buying” in the U.S. could create an “artificially high” level of economic activity. That’s according to Federal Reserve Bank of Chicago President Austan Goolsbee, who discussed the uptick in purchasing by businesses and consumers in response to new tar…",
    "link": "https://www.pymnts.com/economy/2025/chicago-fed-tariff-related-panic-buying-could-precede-economic-slump/",
    "timestamp": "2025-04-20T23:01:47Z"
  },
  {
    "title": "Dr. Oz’s daughter speaks out after child’s health episode in the White House",
    "description": "Dr. Oz's granddaughter fainted shortly after he was sworn in to oversee the Center for Medicare and Medicaid Services Friday, but her mom says she was okay.",
    "link": "https://www.foxnews.com/media/dr-ozs-daughter-speaks-out-after-childs-health-episode-white-house",
    "timestamp": "2025-04-20T23:00:54Z"
  },
  {
    "title": "Flashback: In the 1980s the Holy Hermit of Loreto, Italy Predicted Donald Trump Will Lead America Back to God",
    "description": "A prophetic encounter from the 1980s reveals the Holy Hermit of Loreto's remarkable prediction about Donald Trump's future role in America's spiritual revival. This intriguing narrative sheds light on faith and leadership in contemporary politics.\nThe post Fl…",
    "link": "https://www.thegatewaypundit.com/2025/04/flashback-1980s-holy-hermit-loreto-italy-predicted-donald/",
    "timestamp": "2025-04-20T23:00:19Z"
  },
  {
    "title": "‘Despicable and unAmerican!’ Trump Flips Out at Abrego Garcia Being Treated as ‘Innocent’ by ‘Lunatic’ Democrats, Media: ‘Dangerous LIE’",
    "description": "Trump attacked Democrats for \"falsely making Abrego Garcia out to be a very sweet and innocent person, which is a total, blatant, and dangerous LIE!\"\nThe post ‘Despicable and unAmerican!’ Trump Flips Out at Abrego Garcia Being Treated as ‘Innocent’ by ‘Lunati…",
    "link": "https://www.mediaite.com/trump/despicable-and-unamerican-trump-flips-out-at-abrego-garcia-being-treated-as-innocent-by-lunatic-democrats-media-dangerous-lie/",
    "timestamp": "2025-04-20T22:57:44Z"
  },
  {
    "title": "Tariff fears cloud ASML's outlook as Intel, Samsung pull back",
    "description": "Amid ongoing tariff disputes, the semiconductor industry is facing a severe test. In addition to the imminent semiconductor tariffs promised by US President Donald Trump, which remain somewhat ambiguous, concerns regarding whether demand for AI chips can cont…",
    "link": "https://www.digitimes.com/news/a20250418PD222/asml-intel-samsung-semiconductor-industry-market.html",
    "timestamp": "2025-04-20T22:50:03Z"
  },
  {
    "title": "Narendra Modi – US Vice President J D Vance to hold talks today",
    "description": "NEW DELHI, April 20: Prime Minister Narendra Modi will host a dinner for US Vice President J D Vance and Indian-origin Second Lady Usha on Monday evening after holding talks with the American leader on a range of key issues, including trade, tariff, regional …",
    "link": "https://thehillstimes.in/national/narendra-modi-us-vice-president-j-d-vance-to-hold-talks-today",
    "timestamp": "2025-04-20T22:50:00Z"
  },
  {
    "title": "PHOTOS: Anti-Trump protesters rally in cities and towns across the country",
    "description": "Opponents of President Donald Trump’s administration took to the streets of communities large and small across the U.S. on Saturday, decrying what they see as threats to the nation’s democratic ideals.",
    "link": "https://biztoc.com/x/c9f80cdc429d1ffb",
    "timestamp": "2025-04-20T22:47:30Z"
  },
  {
    "title": "PHOTOS: Anti-Trump protesters rally in cities and towns across the country",
    "description": "Opponents of President Donald Trump’s administration took to the streets of communities large and small across the U.S. on Saturday, decrying what they see as threats to the nation’s democratic ideals.",
    "link": "https://www.pbs.org/newshour/politics/photos-anti-trump-protesters-rally-in-cities-and-towns-across-the-country",
    "timestamp": "2025-04-20T22:41:44Z"
  },
  {
    "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
    "description": "Trump’s defense chief leaked classified strike details in a private Signal group with his family, the 'New York Times' reporter.",
    "link": "https://www.jpost.com/american-politics/article-850849",
    "timestamp": "2025-04-20T22:39:06Z"
  },
  {
    "title": "Joe Rogan Paints A Picture Of Trump: In Between Golf Swings, He's On The Phone With Other Presidents: 'We're Going To Need More Money!'",
    "description": "It seems that Joe Rogan isn’t buying the idea that there’s some hidden genius behind President Donald Trump’s actions, especially not when it comes to the economy. On a recent episode of “The Joe Rogan Experience,” Rogan and comedian Ron White took turns joki…",
    "link": "https://biztoc.com/x/9370fded2f5a131c",
    "timestamp": "2025-04-20T22:36:36Z"
  },
  {
    "title": "Egg-ceptional: Democrats honor their presidents for Easter – except their most recent one!",
    "description": "John F. Kennedy, Jimmy Carter, Bill Clinton and Barack Obama all featured",
    "link": "https://www.wnd.com/2025/04/egg-ceptional-democrats-honor-their-presidents-for-easter-except-their-most-recent-one/",
    "timestamp": "2025-04-20T22:34:16Z"
  },
  {
    "title": "Dr. Oz's Granddaughter Recovering After White House Medical Scare",
    "description": "Dr. Oz's granddaughter is doing fine after her medical scare in the White House last week, her mom says ... and, she says President Donald Trump did a great job keeping her kids calm. Daphne Oz took to Instagram Sunday morning to share an update on…\n Permalink",
    "link": "https://www.tmz.com/2025/04/20/dr-oz-granddaughter-recover-white-house-medical-scare/",
    "timestamp": "2025-04-20T22:33:58Z"
  },
  {
    "title": "Why do we still have Biden holdovers and career anti-Trump bureaucrats at the National Intelligence Council undermining President Trump and his agenda?",
    "description": "Laura Loomer @LauraLoomer Why do we still have Biden holdovers and career anti-Trump bureaucrats at the National Intelligence Council undermining President Trump and his agenda? Perhaps some folks over at the National intelligence council need to be replaced …",
    "link": "https://freerepublic.com/focus/f-bloggers/4312218/posts",
    "timestamp": "2025-04-20T22:33:06Z"
  },
  {
    "title": "Joe Rogan Paints A Picture Of Trump: In Between Golf Swings, He's On The Phone With Other Presidents: 'We're Going To Need More Money!'",
    "description": "It seems that Joe Rogan isn’t buying the idea that there’s some hidden genius behind President Donald Trump’s actions, especially not when it comes to the...",
    "link": "https://finance.yahoo.com/news/joe-rogan-paints-picture-trump-223052993.html",
    "timestamp": "2025-04-20T22:30:52Z"
  },
  {
    "title": "The feds’ Penn Station takeover is ALL about protecting taxpayers from NY pols’ seedy schemes",
    "description": "The MTA certainly has far better uses for any cash that comes its way; it was only dragged into these plans as a pawn in the pols’ games.",
    "link": "https://nypost.com/2025/04/20/opinion/the-feds-penn-station-takeover-is-all-about-protecting-taxpayers-from-ny-pols-seedy-schemes/",
    "timestamp": "2025-04-20T22:27:33Z"
  },
  {
    "title": "Vance set to meet with Modi in India",
    "description": "The News\nUS Vice President JD Vance is set to meet with Indian Prime Minister Narendra Modi in New Delhi on Monday, with trade on the agenda.\nVance’s visit alongside his wife, Usha, the daughter of Indian immigrants, reflects warming ties under US President D…",
    "link": "https://biztoc.com/x/a6f4de1e8a56bd5d",
    "timestamp": "2025-04-20T22:25:50Z"
  },
  {
    "title": "How Donald Trump's 'America first' agenda may backfire on him - opinion",
    "description": "What we’re witnessing might be called the “nationalist boomerang” – when one country’s overassertive nationalism triggers defensive nationalist responses elsewhere.",
    "link": "https://www.jpost.com/opinion/article-850803",
    "timestamp": "2025-04-20T22:22:58Z"
  },
  {
    "title": "Five Key Charts to Watch in Global Commodity Markets This Week",
    "description": "As goes the price of oil, so go US rig fleets, which have been getting idled on the shale patch. BloombergNEF has issued its latest energy outlook before the group holds a summit in New York later this month. And exactly what are those rare earth metals China…",
    "link": "https://financialpost.com/pmn/business-pmn/five-key-charts-to-watch-in-global-commodity-markets-this-week-85",
    "timestamp": "2025-04-20T22:20:25Z"
  },
  {
    "title": "1 Artificial Intelligence (AI) Stock-Buyback Stock to Buy Hand Over Fist During the Nasdaq Sell-Off",
    "description": "In This Article:\nEver since President Donald Trump announced a new tariff agenda on April 2, the stock market has been experiencing outsized volatility. Technology stocks in particular have been vulnerable to widespread selling, driven by fear and uncertainty…",
    "link": "https://biztoc.com/x/c8f6f87c6efcf0ef",
    "timestamp": "2025-04-20T22:14:39Z"
  },
  {
    "title": "Here’s a better idea, Joe: What if you charge $300K NOT to speak?",
    "description": "No one wants to pay Joe Biden's $300,000 speaking fee, but we have a much better idea!",
    "link": "https://nypost.com/2025/04/20/opinion/heres-a-better-idea-joe-biden-what-if-rich-people-pay-you-300k-not-to-speak/",
    "timestamp": "2025-04-20T22:10:15Z"
  },
  {
    "title": "Donald Trump Vows to Make America ‘More Religious’ Than Ever Before - NewsBreak",
    "description": "President Donald Trump promised on Sunday that he would help make the United Sates \"more religious.\" \"We are, together, going to make America bigger, bette",
    "link": "https://www.newsbreak.com/share/3970934389995-donald-trump-vows-to-make-america-more-religious-than-ever-before?s=a3&share_destination_id=MzIyMzUwMTE4LTE3NDUxODY3MDMzMzg%3D&pd=0LoXzSK4&hl=en_US&send_time=1745186703&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.16.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-v7%2Cns_push_exp_rt_bucketv12-v5%2Cns_local_strategy_25q1_exp-v17%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v8",
    "timestamp": "2025-04-20T22:07:39Z"
  },
  {
    "title": "'We really need to talk'",
    "description": "With trade tensions exacerbated by the US's reciprocal tariffs, key business sectors are calling on the Thai government to prioritise negotiations with Washington during the 90-day pause, as the nation is expected to be one of the hardest hit from the tariff …",
    "link": "https://www.bangkokpost.com/business/general/3007414/we-really-need-to-talk",
    "timestamp": "2025-04-20T22:06:00Z"
  },
  {
    "title": "President Donald Trump Is Saving Social Security Hundreds of Millions of Dollars per Year. But Is It Enough to Prevent Benefit Cuts?",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_44aa8c1e-f5b1-48fa-aeaf-240968a51a49",
    "timestamp": "2025-04-20T22:05:00Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Video from Friday night shows Immigration and Customs Enforcement buses full of Venezuelan migrants heading toward an airport in north Texas before abruptly turning around amid a legal battle to prevent their deportation.",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-april-20-rcna201856",
    "timestamp": "2025-04-20T22:00:00Z"
  },
  {
    "title": "Trump Goes On All-Caps Easter Posting Spree, Angrily Calls Himself ‘GREATEST FRIEND AMERICAN CAPITALISM EVER HAD!’",
    "description": "In a half hour burst of messages on tariffs and Ukraine, Trump kicked off an afternoon of posts on Truth Social that spilled over later into a second burst.\nThe post Trump Goes On All-Caps Easter Posting Spree, Angrily Calls Himself ‘GREATEST FRIEND AMERICAN …",
    "link": "https://www.mediaite.com/trump/trump-goes-on-all-caps-easter-posting-spree-angrily-calls-himself-greatest-friend-american-capitalism-ever-had/",
    "timestamp": "2025-04-20T21:55:51Z"
  },
  {
    "title": "Meta's chief AI scientist calls French initiative to attract US scientists a 'smart move'",
    "description": "Meta's Yann LeCun called France's initiative to attract top scientists a \"smart move\" amid tightened US immigration and reduced research funding.",
    "link": "https://www.businessinsider.com/meta-yann-lecun-france-attract-scientists-us-trump-funding-2025-4",
    "timestamp": "2025-04-20T21:52:30Z"
  },
  {
    "title": "Russia’s economy falters under oil price drop and indirect pressure from Trump’s trade war / The New Voice of Ukraine",
    "description": "Falling oil prices are squeezing the already slowing economy\nof aggressor state Russia and threatening to cut its military budget, The\nWall Street Journal reported on April 20, analyzing the indirect impact of\nU.S. President Donald Trump’s trade war despite n…",
    "link": "https://english.nv.ua/business/russia-s-economy-falters-under-oil-price-drop-and-indirect-pressure-from-trump-s-trade-war-50507819.html",
    "timestamp": "2025-04-20T21:52:12Z"
  },
  {
    "title": "Time To Make Democrats Choke On A Big Dose Of Their Own Medicine",
    "description": "It’s a good thing Rob O’Neil ventilated Osama bin Laden’s head and did not take him into custody, or else Democrats would be forming a conga line of stupidity to march into whatever prison he was being held in to demand his release. Not immediately, they’d wa…",
    "link": "https://freerepublic.com/focus/f-news/4312212/posts",
    "timestamp": "2025-04-20T21:49:05Z"
  },
  {
    "title": "Daryl Hannah Claims Trump's White House Tried 'Every Trick' to Stop Husband Neil Young’s Citizenship Bid",
    "description": "Daryl Hannah claimed Neil Young, now a dual Canadian-American citizen, went through 'bureaucratic hell' during the first Trump administration.",
    "link": "https://radaronline.com/p/daryl-hannah-donald-trump-white-house-husband-neil-youngs-bid/",
    "timestamp": "2025-04-20T21:45:00Z"
  },
  {
    "title": "Sen. Chris Van Hollen Calls BS After Gavin Newsom Calls Unlawful Deportation A 'Distraction'",
    "description": "The Democratic senator, who recently visited a wrongly deported man in El Salvador, said politicians who aren’t willing to defend the constitution don’t “deserve to lead.”",
    "link": "https://www.huffpost.com/entry/van-hollen-newsom-distraction-doesnt-deserve-to-lead_n_6805389be4b0a6a013849a95",
    "timestamp": "2025-04-20T21:36:36Z"
  },
  {
    "title": "What Happened to Dr. Oz's Granddaughter at White House? Daphne Oz Gives Health Update",
    "description": "Two days after Dr. Oz's 11-year-old granddaughter Philomena fainted during his April 18 swearing-in ceremony at the White House, disrupting President Donald Trump's remarks, her mom, Daphne Oz, shared a health update.",
    "link": "https://people.com/what-happened-to-dr-oz-granddaughter-philomena-white-house-daphne-oz-gives-health-update-11718598",
    "timestamp": "2025-04-20T21:36:27Z"
  },
  {
    "title": "Taxes on super rich and tech giants stall under Trump",
    "description": "Global tax plans targeting billionaires and multinational companies are running aground, with the United States torpedoing reforms under President Donald Trump. The billionaire real estate tycoon has pulled the United States out of an international deal on ta…",
    "link": "https://japantoday.com/category/business/taxes-on-super-rich-and-tech-giants-stall-under-trump",
    "timestamp": "2025-04-20T21:35:03Z"
  },
  {
    "title": "Tariffs could lift Boeing and Airbus plane prices even higher",
    "description": "Commercial plane prices, already lifted in recent years due to pandemic supply chain shocks, are poised to climb further as Boeing and Airbus are buffeted by trade tariffs. &quot;Compared with 2018, prices for commercial jets have risen by around 30 percent,&…",
    "link": "https://japantoday.com/category/business/tariffs-could-lift-boeing-and-airbus-plane-prices-even-higher",
    "timestamp": "2025-04-20T21:34:55Z"
  },
  {
    "title": "Pope Francis, a Trump critic, meets Vance on Easter morning",
    "description": "Pope Francis held a private meeting at the Vatican on Sunday morning with U.S. Vice President JD Vance, the Vatican said in a statement. Vance, a Catholic who has clashed with the pontiff over the Trump administration's immigration policies, met Francis at hi…",
    "link": "https://japantoday.com/category/world/pope-francis-a-trump-critic-meets-us-vp-vance-on-easter-morning",
    "timestamp": "2025-04-20T21:30:59Z"
  },
  {
    "title": "Trump eyes gutting U.S. diplomacy in Africa, cutting soft power: draft plan",
    "description": "The United States would drastically reduce its diplomatic footprint in Africa and scrap State Department offices dealing with climate change, democracy and human rights, according to a draft White House order. The executive order, framed as a strategy to cut …",
    "link": "https://japantoday.com/category/world/trump-eyes-gutting-us-diplomacy-in-africa-cutting-soft-power-draft-plan",
    "timestamp": "2025-04-20T21:30:44Z"
  },
  {
    "title": "Trump slams 'weak' judges as deportation row intensifies",
    "description": "The clash over President Donald Trump's bid to exercise unprecedented powers in deporting migrants deepened Sunday as he again bashed the judiciary, while a top Democrat warned the country was &quot;closer and closer&quot; to a constitutional crisis. The late…",
    "link": "https://japantoday.com/category/world/trump-slams-%27weak%27-judges-as-deportation-row-intensifies",
    "timestamp": "2025-04-20T21:30:37Z"
  },
  {
    "title": "Trump: World knows we're serious about tariffs",
    "description": "United States President Donald Trump revealed, in a post on TruthSocial, that \"world leaders and business executives\" asked him for \"relief from tariffs.\" The president added \"it's good to see the wor...",
    "link": "https://biztoc.com/x/02d66b39b4de2866",
    "timestamp": "2025-04-20T21:30:35Z"
  },
  {
    "title": "Kyiv and Moscow accuse each other of breaking Easter ceasefire",
    "description": "Russia and Ukraine blamed each other on Sunday for breaking a one-day Easter ceasefire declared by President Vladimir Putin, with both sides accusing the other of hundreds of attacks and the Kremlin saying there was no order for an extension. Putin, who sent …",
    "link": "https://japantoday.com/category/world/kyiv-and-moscow-accuse-each-other-of-breaking-easter-ceasefire-no-extension-seen2",
    "timestamp": "2025-04-20T21:30:28Z"
  },
  {
    "title": "Houston YMCA Cutting Staff After Trump Funding Blow",
    "description": "Harris County's Alief Family YMCA, which primarily served refugees, will close next month following the Trump administration's cuts to refugee program funding.",
    "link": "https://www.newsweek.com/houston-texas-ymca-cuts-staff-due-refugee-funding-cuts-2061934",
    "timestamp": "2025-04-20T21:24:05Z"
  },
  {
    "title": "Dem Jeffries brushes aside DNC big’s primary schtick, vows to stand by incumbents",
    "description": "Last week, David Hogg, who has been serving as one of three DNC vice chairs since February, announced that his organization, \"Leaders We Deserve,\" will pump out $20 million to challenge low-key House Dem incumbents in favor of more combative contenders.",
    "link": "https://nypost.com/2025/04/20/us-news/hakeem-jeffries-brushes-aside-david-hoggs-primary-schtick-vows-to-stand-by-incumbents/",
    "timestamp": "2025-04-20T21:23:21Z"
  },
  {
    "title": "Biden Declares Easter Sunday as \"Transgender Day of Visibility\"",
    "description": "Can’t forget this scumbag fast enough. https://www.theguardian.com/us-news/2024/mar/31/biden-transgender-day-of-visibility-trump-republicansA Joe Biden White House spokesperson said Republicans who have spent the Easter weekend criticizing the president for d…",
    "link": "https://freerepublic.com/focus/f-news/4312207/posts",
    "timestamp": "2025-04-20T21:22:11Z"
  },
  {
    "title": "Anti-Trump resistance sees another leader in Van Hollen as Democrats' leadership carousel turns (Steve Peoples/Associated Press)",
    "description": "Steve Peoples / Associated Press:\nAnti-Trump resistance sees another leader in Van Hollen as Democrats' leadership carousel turns  —  Now, it's Chris Van Hollen's turn.  The mild-mannered Maryland senator has suddenly emerged as a leading figure in the resist…",
    "link": "https://www.memeorandum.com/250420/p46",
    "timestamp": "2025-04-20T21:10:01Z"
  },
  {
    "title": "Trump hopes Russia, Ukraine will reach deal 'this week'",
    "description": "United States President Donald Trump expressed hope that Russia and Ukraine will reach a deal \"this week.\" In addition, the president said both countries would then be able to \"start to do big busines...",
    "link": "https://biztoc.com/x/8ef2f53eb456b3e6",
    "timestamp": "2025-04-20T21:08:16Z"
  },
  {
    "title": "‘War On Coal Is Finally Over’: Energy Experts Say Trump Admin’s Deregulation Agenda Could Fuel Coal’s Revival",
    "description": "Energy generated from burning coal only powers roughly 16% of the U.S., though 40 states are dependent on coal, according to data from America’s Power. Energy generation through coal reached a record low in 2023, a Rhodium Group study reported. In 2021, howev…",
    "link": "https://wattsupwiththat.com/2025/04/20/war-on-coal-is-finally-over-energy-experts-say-trump-admins-deregulation-agenda-could-fuel-coals-revival/",
    "timestamp": "2025-04-20T21:00:00Z"
  },
  {
    "title": "Will the global economy stall?",
    "description": "The timing could hardly have been less propitious. Just as the world economy was showing signs of stabilising, the odds of a policy-induced global recession have risen significantly. The latest update to the Brookings-FT Tiger index reveals a mixed picture, w…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3007159/will-the-global-economy-stall-",
    "timestamp": "2025-04-20T21:00:00Z"
  },
  {
    "title": "Democratic Party's Easter post on X snubs Biden while resurfacing holiday photos of Obama, Clinton, JFK",
    "description": "The Democratic Party's official X account went viral on Easter Sunday for its holiday post celebrating several Democratic presidents but omitting Joe Biden.",
    "link": "https://www.foxnews.com/media/democratic-partys-easter-post-x-snubs-biden-while-resurfacing-holiday-photos-obama-clinton-jfk",
    "timestamp": "2025-04-20T21:00:00Z"
  },
  {
    "title": "Tariffs divide New Hampshire business leaders | CloseUp",
    "description": "Hollie Noveletsky with Novel Iron Works and Jim Jalbert with C&J Bus Lines join WMUR's Adam Sexton on CloseUp to discuss how the recent tariffs imposed by President Donald Trump are impacting their businesses.",
    "link": "https://www.wmur.com/article/closeup-tariffs-business-new-hampshire/64534072",
    "timestamp": "2025-04-20T20:57:24Z"
  }
]