[
  {
    "title": "Iran Denies Trump Claim of New Nuclear Talks",
    "description": "Iran hasn’t asked for nuclear negotiations with the United States to resume, Iranian Foreign Ministry Spokesman Esmaeil Baghaei said on Tuesday, disputing U.S. President Donald Trump’s remarks that a new round of talks is scheduled to be held soon. During a m…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Iran-Denies-Trump-Claim-of-New-Nuclear-Talks.html",
    "timestamp": "2025-07-08T12:15:00Z"
  },
  {
    "title": "A look at the countries that received Trump’s tariff letters",
    "description": "President Donald Trump sent letters to 14 countries Monday outlining higher tariffs they’ll face if they don’t make trade deals with the U.S. by Aug. 1. In the letters, which were posted on Truth Social, Trump warned countries that they would face even higher…",
    "link": "https://financialpost.com/pmn/a-look-at-the-countries-that-received-trumps-tariff-letters",
    "timestamp": "2025-07-08T12:14:07Z"
  },
  {
    "title": "Hold GOP Accountable: Youngest Dem. Congresswoman on Medicaid, Climate Cuts & Her Visit to ICE Jail",
    "description": "“The most important thing that we have to do right now is hold the Republicans that voted for this bill accountable for the devastation that they are causing and the lives that will be impacted.” Democratic Congressmember Yassamin Ansari of Arizona explains h…",
    "link": "https://www.democracynow.org/2025/7/8/rep_yassamin_ansari_big_beautiful_bill",
    "timestamp": "2025-07-08T12:12:57Z"
  },
  {
    "title": "Capitol agenda: It’s crypto crunch time for the House",
    "description": "Senate Republicans and President Donald Trump are pushing to jam the House again. This time, it’s all about crypto. \nThe brewing clash — not unlike the megabill saga — is over how big and how quickly Hill Republicans should deliver on one of Trump’s most nota…",
    "link": "https://biztoc.com/x/bccb956761d4b77c",
    "timestamp": "2025-07-08T12:11:49Z"
  },
  {
    "title": "Trump says US will send more weapons to Ukraine",
    "description": "Delivery of some weapons was held up last week over concerns that US stockpiles were low",
    "link": "https://www.irishtimes.com/world/europe/2025/07/08/trump-says-us-will-send-more-weapons-to-ukraine/",
    "timestamp": "2025-07-08T12:09:49Z"
  },
  {
    "title": "Federal lands larger than Delaware move closer to coming up for sale to coal mining companies",
    "description": "The reversal on selling public lands stems from an executive order signed on Trump's first day in office.",
    "link": "https://fortune.com/2025/07/08/coal-mining-leases-federal-lands-wyoming-montana-powder-river/",
    "timestamp": "2025-07-08T12:06:56Z"
  },
  {
    "title": "IRS backs Christian media group arguing against rarely enforced tax exemption law",
    "description": "“I will get rid of and totally destroy the Johnson Amendment and allow our representatives of faith to speak freely and without fear of retribution,” Trump said at a National Prayer Breakfast in 2017.",
    "link": "https://fortune.com/2025/07/08/irs-pastors-endorse-political-candidates-shouldnt-risk-losing-tax-exempt-status/",
    "timestamp": "2025-07-08T12:05:17Z"
  },
  {
    "title": "We ask you: what are your fondest memories of the late Norman Tebbit?",
    "description": "YET another member of the beloved Thatcher cabinet we grew up with has passed on. How will you remember Norman Tebbit?",
    "link": "https://www.thedailymash.co.uk/politics/we-ask-you-what-are-your-fondest-memories-of-the-late-norman-tebbit-20250708258497",
    "timestamp": "2025-07-08T12:04:21Z"
  },
  {
    "title": "Forbes Daily: Another Delayed Tariff Deadline As Trump Imposes New Rates",
    "description": "Today’s Forbes Daily covers new tariff updates from Trump, Tesla’ robotaxi risks, TSA makes a screening change, how Mamdani could target billionaires and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/07/08/forbes-daily-another-delayed-tariff-deadline-as-trump-imposes-new-rates/",
    "timestamp": "2025-07-08T12:03:53Z"
  },
  {
    "title": "Posthaste: Canadians might want to brace for bigger budget deficit than expected",
    "description": "Canada's federal budget won't be out until the fall, but economists say the deficit is bound to be bigger than projected. Read more",
    "link": "https://financialpost.com/news/canadians-should-brace-bigger-federal-budget-deficit",
    "timestamp": "2025-07-08T12:01:37Z"
  },
  {
    "title": "Harmeet Dhillon: Civil rights being rebuilt after ‘cultural shift’ under Trump",
    "description": "The Justice Department‘s Civil Rights Division is undergoing a complete internal transformation under President Donald Trump’s second term — not just of enforcement strategy but of personnel, institutional practices, and long-held assumptions about how federa…",
    "link": "https://freerepublic.com/focus/f-news/4327454/posts",
    "timestamp": "2025-07-08T12:01:08Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "In This Article:\nU.S. stock futures are mixed and little changed after President Donald Trump pushed back his \"reciprocal\" tariffs deadline to Aug. 1 and announced new duty levels on 14 nations, including Japan and South Korea; Amazon's (AMZN) four-day \"Prime…",
    "link": "https://biztoc.com/x/2715aafed0d660ab",
    "timestamp": "2025-07-08T12:00:37Z"
  },
  {
    "title": "Donald Trump Drops Below Joe Biden, Hillary Clinton in Popularity Ranking",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's popularity has fallen below that of former President Joe Biden and former Secretary of State Hillary Clinton, according to a recently released YouGov ranking the most popular politicia…",
    "link": "https://biztoc.com/x/458cf25abb743dcd",
    "timestamp": "2025-07-08T12:00:19Z"
  },
  {
    "title": "Key advisor called Hunter Biden's role on strategy call ‘inappropriate’ after he overruled legal guidance",
    "description": "Biden's White House Counsel Ed Siskel said Hunter Biden's unexpected presence on a call about the Supreme Court's immunity ruling was \"inappropriate,\" a new book says.",
    "link": "https://www.foxnews.com/politics/key-advisor-called-hunter-bidens-role-strategy-call-inappropriate-after-he-overruled-legal-guidance",
    "timestamp": "2025-07-08T12:00:17Z"
  },
  {
    "title": "Day 1,231 of WW3. Budanov has a new target as Ukraine IDs orc who attacked a children's hospital last year. Black Sea Fleet warships have basically abandoned Crimea, and UAF is producing 200k drones per month. This is your Tuesday Ukraine war thread [News]",
    "description": "Day 1,231 of WW3. Budanov has a new target as Ukraine IDs orc who attacked a children's hospital last year. Black Sea Fleet warships have basically abandoned Crimea, and UAF is producing 200k drones per month. This is your Tuesday Ukraine war thread",
    "link": "https://www.fark.com/comments/13733436/Day-1231-of-WW3-Budanov-has-a-new-target-as-Ukraine-IDs-orc-who-attacked-a-childrens-hospital-last-year-Black-Sea-Fleet-warships-have-basically-abandoned-Crimea-UAF-is-producing-200k-drones-per-month-This-is-your-Tuesday-Ukraine-war-thread",
    "timestamp": "2025-07-08T12:00:00Z"
  },
  {
    "title": "Morning Report: Daniel Cormier, Chael Sonnen question UFC White House logistics, Conor McGregor involvement",
    "description": "UFC President Donald Trump wants to bring the octagon to The White House, but is it even possible?",
    "link": "https://www.mmafighting.com/2025/7/8/24463020/morning-report-daniel-cormier-chael-sonnen-question-ufc-white-house-conor-mcgregor-involvement",
    "timestamp": "2025-07-08T12:00:00Z"
  },
  {
    "title": "Jones Shakes Off Cobwebs, Steps Back Into Gym",
    "description": "Jon Jones is literally cleaning the spiderwebs off his home gym and getting back to training for another fight in the UFC.",
    "link": "https://www.mmamania.com/2025/7/8/24463683/video-jon-jones-shakes-off-cobwebs-steps-back-into-garage-gym",
    "timestamp": "2025-07-08T12:00:00Z"
  },
  {
    "title": "Death at California meatpacking plant stirs grief and anger over working conditions",
    "description": "“This company has a long history of not taking care of their workers,” an employee rights advocate said.",
    "link": "https://www.fresnobee.com/news/local/article309807805.html",
    "timestamp": "2025-07-08T12:00:00Z"
  },
  {
    "title": "Rome To Host Ukraine Recovery Conference As US Support Falters",
    "description": "Ukrainian President Volodymyr Zelensky heads to Rome this week for a conference of world leaders and businesses aimed at boosting support for rebuilding his war-torn country as US military aid stalls.",
    "link": "https://www.ibtimes.com/rome-host-ukraine-recovery-conference-us-support-falters-3777879",
    "timestamp": "2025-07-08T11:57:19Z"
  },
  {
    "title": "Q&A: What does the latest Trump tariff move mean for Ireland?",
    "description": "While talks are ongoing, the prospect of a full-blown trade war cannot be ruled out",
    "link": "https://www.irishtimes.com/business/2025/07/08/qa-what-does-the-latest-trump-tariff-move-mean-for-ireland/",
    "timestamp": "2025-07-08T11:55:00Z"
  },
  {
    "title": "Trump is “restoring peace in country after country”, Netanyahu told the White House yesterday – He nominated him for the Nobel Prize",
    "description": "Despite Trump's optimism for a ceasefire agreement in Gaza \"this week\", indirect negotiations between Israeli government and Hamas delegations in Doha remain fruitless\nThe post Trump is “restoring peace in country after country”, Netanyahu told the White Hous…",
    "link": "https://en.protothema.gr/2025/07/08/trump-is-restoring-peace-in-country-after-country-netanyahu-told-the-white-house-yesterday-he-nominated-him-for-the-nobel-prize/",
    "timestamp": "2025-07-08T11:54:49Z"
  },
  {
    "title": "Why Is the Media Normalizing Nuclear War and Its Effects on US Populations?",
    "description": "As a political journalist, I typically monitor about six or seven print publications and a somewhat absurd number of online ones. But I recently noticed a disturbing trend—a slew of articles with titles like “Apocalyptic map shows worst U.S. states to live in…",
    "link": "https://www.commondreams.org/opinion/media-normalize-nuclear-war",
    "timestamp": "2025-07-08T11:53:02Z"
  },
  {
    "title": "Federal Judge Blocks Planned Parenthood Defunding",
    "description": "A federal judge in Boston on Monday blocked the portion of the One Big Beautiful Bill that President Trump signs that defunds Planned Parenthood. U.S. District Judge Indira Talwani, an Obama appointee, issued the temporary nationwide restraining order days af…",
    "link": "https://freerepublic.com/focus/f-news/4327449/posts",
    "timestamp": "2025-07-08T11:52:45Z"
  },
  {
    "title": "Rome to host Ukraine recovery conference as US support falters",
    "description": "Ukrainian President Volodymyr Zelensky heads to Rome this week for a conference of world leaders and businesses aimed at boosting support for rebuilding his war-torn country as US military aid stalls. The Ukraine Recovery Conference takes place in the Italian…",
    "link": "https://www.digitaljournal.com/world/rome-to-host-ukraine-recovery-conference-as-us-support-falters/article",
    "timestamp": "2025-07-08T11:52:20Z"
  },
  {
    "title": "Kristi Noem shrugs off oversight as detainee deaths surge: report",
    "description": "Homeland Security Secretary Kristi Noem is casting off government oversight as she carries out President Donald Trump's mass deportation orders, according to a report.At least 11 people have died while in the custody of Immigration and Customs Enforcement sin…",
    "link": "https://www.rawstory.com/homeland-security-2672943159/",
    "timestamp": "2025-07-08T11:52:14Z"
  },
  {
    "title": "What to learn about the flash floods in Texas that killed over 100 people",
    "description": "Flash floods in Texas killed more than 100 people over the Fourth of July holiday weekend and left others still missing, including girls attending a summer camp. The devastation along the Guadalupe River, outside of San Antonio, has drawn a massive search eff…",
    "link": "https://www.nationalobserver.com/2025/07/08/news/what-learn-about-flash-floods-texas-killed-over-100-people",
    "timestamp": "2025-07-08T11:51:38Z"
  },
  {
    "title": "Anand visits Malaysia, Japan as Carney crafts approach to Indo-Pacific strategy",
    "description": "Foreign Affairs Minister Anita Anand is headed off to Japan and Malaysia as the Carney government shapes its diplomatic and trade approach to the Indo-Pacific region.",
    "link": "https://www.nationalobserver.com/2025/07/08/news/anand-visits-malaysia-japan-carney-crafts-approach-indo-pacific-strategy",
    "timestamp": "2025-07-08T11:50:33Z"
  },
  {
    "title": "Donald Trump Drops Below Joe Biden, Hillary Clinton in Popularity Ranking",
    "description": "YouGov's recent ranking shows that Trump is less popular than his vice president JD Vance.",
    "link": "https://www.newsweek.com/donald-trump-popularity-ranking-joe-biden-hillary-clinton-2095914",
    "timestamp": "2025-07-08T11:50:22Z"
  },
  {
    "title": "What tariffs? World markets tick up as Trump deadline looms",
    "description": "“Financial markets have reacted to news of higher US tariffs in sanguine fashion,” Chris Turner, ING’s global head of markets, wrote in a commentary.",
    "link": "https://fortune.com/2025/07/08/how-stock-markets-worldwide-react-trump-tariffs-taco-trade/",
    "timestamp": "2025-07-08T11:50:21Z"
  },
  {
    "title": "Nebraska independent Dan Osborn will challenge GOP Sen. Pete Ricketts in second Senate run | CNN Politics",
    "description": "Former independent US Senate candidate Dan Osborn announced Tuesday that he will make another run for office next year, this time against GOP Sen. Pete Ricketts of Nebraska.",
    "link": "https://www.cnn.com/2025/07/08/politics/dan-osborn-ricketts-senate",
    "timestamp": "2025-07-08T11:50:19Z"
  },
  {
    "title": "FIFA opens office in Trump Tower (Paul Dallison/Politico)",
    "description": "Paul Dallison / Politico:\nFIFA opens office in Trump Tower  —  World football governing body FIFA has boosted its ties with U.S. President Donald Trump by opening an office in New York's Trump Tower.  —  The move comes a year ahead of the men's World Cup — wh…",
    "link": "https://www.memeorandum.com/250708/p13",
    "timestamp": "2025-07-08T11:50:00Z"
  },
  {
    "title": "Tesla Stock Is Up. Board Needs to Act as Trump and Musk Spar, Analyst Says",
    "description": "",
    "link": "https://biztoc.com/x/fad618619f712767",
    "timestamp": "2025-07-08T11:49:10Z"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens",
    "description": "News of the day for July 8, 2025",
    "link": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-july-08-2025-11767987",
    "timestamp": "2025-07-08T11:49:00Z"
  },
  {
    "title": "As US abruptly ends support, Liberia faces empty health clinics and unplanned pregnancies",
    "description": "Roseline Phay is a farmer in the West African nation of Liberia",
    "link": "https://abcnews.go.com/International/wireStory/us-abruptly-ends-support-liberia-faces-empty-health-123559141",
    "timestamp": "2025-07-08T11:42:26Z"
  },
  {
    "title": "Morning Joe Crew Tears Apart Netanyahu’s ‘Fanciful’ Idea to Move Gazans Elsewhere: ‘Preposterous!’",
    "description": "Morning Joe crew tore apart an idea floated by Israeli Prime Minister Benjamin Netanyahu that other countries take in Palestinians who want to leave Gaza.\nThe post Morning Joe Crew Tears Apart Netanyahu’s ‘Fanciful’ Idea to Move Gazans Elsewhere: ‘Preposterou…",
    "link": "https://www.mediaite.com/media/tv/morning-joe-crew-tears-apart-netanyahus-fanciful-idea-to-move-gazans-elsewhere-preposterous/",
    "timestamp": "2025-07-08T11:42:04Z"
  },
  {
    "title": "CFOs shift strategies as economic uncertainty dims growth outlook",
    "description": "Finance chiefs have lowered projections for revenue, earnings, and capital investments, according to a Deloitte survey.",
    "link": "https://fortune.com/2025/07/08/cfo-shift-strategies-economic-uncertainty-dims-growth-outlook/",
    "timestamp": "2025-07-08T11:41:23Z"
  },
  {
    "title": "Netanyahu says he nominated Trump for a Nobel Peace Prize. From there, it’s a secretive process",
    "description": "A nomination for the prestigious Nobel Peace Prize is only one small step in the secretive process.",
    "link": "https://www.bostonherald.com/2025/07/08/nobel-peace-prize-explainer-trump/",
    "timestamp": "2025-07-08T11:41:16Z"
  },
  {
    "title": "Donald Trump Signals He’s Open to Negotiations Over Tariffs",
    "description": "",
    "link": "https://biztoc.com/x/87c22f380c0e5846",
    "timestamp": "2025-07-08T11:38:24Z"
  },
  {
    "title": "US to send 'more weapons' to Ukraine: Trump",
    "description": "Washington (AFP) July 8, 2025\n\n\n President Donald Trump has said the United States will send additional weapons to Ukraine, triggering Russian criticism after Moscow claimed new gains in its grinding war against its neighbor. \n\nThe Kremlin warned Tuesday that…",
    "link": "https://www.spacewar.com/reports/US_to_send_more_weapons_to_Ukraine_Trump_999.html",
    "timestamp": "2025-07-08T11:38:09Z"
  },
  {
    "title": "Netanyahu, Trump to talk about Iran, Hamas in White House meeting today",
    "description": "Washington DC (UPI) Jul 7, 2025 \n\n\n Israeli Prime Minister Benjamin Netanyahu will meet President Donald Trump in the White House early Monday evening in an effort to broker a truce with Hamas in Gaza and nine days after the United States bombed nuclear sites…",
    "link": "https://www.spacewar.com/reports/Netanyahu_Trump_to_talk_about_Iran_Hamas_in_White_House_meeting_today_999.html",
    "timestamp": "2025-07-08T11:38:09Z"
  },
  {
    "title": "Netanyahu surprises Trump with Nobel Peace Prize nomination during White House dinner",
    "description": "The Israeli PM handed over the nomination letter as the two leaders discussed Gaza ceasefire plans and Trump pledged more weapons to Ukraine.",
    "link": "https://7news.com.au/news/netanyahu-surprises-trump-with-nobel-peace-prize-nomination-during-white-house-dinner-c-19288798",
    "timestamp": "2025-07-08T11:38:08Z"
  },
  {
    "title": "Global stock markets are calling Trump’s bluff on tariffs",
    "description": "U.S. President Donald Trump slapped punitive tariff rates on 14 trading partners on Monday — but global markets are so far shrugging off the new policies.\nThe president announced on Monday that he had sent letters to the leaders of Japan, South Korea, Malaysi…",
    "link": "https://biztoc.com/x/2a77d057facd8767",
    "timestamp": "2025-07-08T11:38:05Z"
  },
  {
    "title": "Marjorie Taylor Greene Raises New Epstein Question Over 'Little Black Book'",
    "description": "The staunch Trump ally joined others in the MAGA movement raising doubt about the Epstein conclusions.",
    "link": "https://www.newsweek.com/marjorie-taylor-greene-jeffrey-epstein-client-list-black-book-2095954",
    "timestamp": "2025-07-08T11:37:28Z"
  },
  {
    "title": "There are many things American voters agree on, from fears about technology to threats to democracy",
    "description": "Americans of both parties are worried about Trump having a third term, and have other shared concerns.",
    "link": "https://theconversation.com/there-are-many-things-american-voters-agree-on-from-fears-about-technology-to-threats-to-democracy-258440",
    "timestamp": "2025-07-08T11:36:43Z"
  },
  {
    "title": "There are many things Americans voters agree on, from fears about technology to threats to democracy",
    "description": "Americans of both parties are worried about Trump having a third term, and have other shared concerns.",
    "link": "https://theconversation.com/there-are-many-things-americans-voters-agree-on-from-fears-about-technology-to-threats-to-democracy-258440",
    "timestamp": "2025-07-08T11:36:43Z"
  },
  {
    "title": "The FBI now claims that there is no Jeffrey Epstein ‘client list’, how strange",
    "description": "Embed from Getty Images For years now, various people have demanded the public release of Jeffrey Epstein’s “client/blackmail list.” It happened during the first Trump administration too, weirdly, because I don’t think MAGA cultists actually understood that D…",
    "link": "https://www.celebitchy.com/929920/the_fbi_now_claims_that_there_is_no_jeffrey_epstein_client_list_how_strange/",
    "timestamp": "2025-07-08T11:35:15Z"
  },
  {
    "title": "World shares mostly rise as markets shrug off Trump’s tariff pressures",
    "description": "Wall Street is mixed in quiet trading as markets appeared to shrug off a new U.S. tariff deadline for trading partners.",
    "link": "https://www.bostonherald.com/2025/07/08/stock-market-trump-tariff-reaction-2/",
    "timestamp": "2025-07-08T11:35:07Z"
  },
  {
    "title": "Lt. Gov. Burt Jones announces campaign for Georgia governor",
    "description": "Lt. Gov. Burt Jones has launched his campaign to succeed Gov. Brian Kemp as the next governor of Georgia.",
    "link": "https://www.fox5atlanta.com/news/lt-gov-burt-jones-announces-campaign-georgia-governor",
    "timestamp": "2025-07-08T11:35:02Z"
  },
  {
    "title": "Trump Convenes Cabinet, Countries Scramble Response to New Tariff Deadline",
    "description": "Trump delays tariff deadline to Aug. 1, warning dozens of nations to finalize trade deals or face steep new duties. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donald-trump-administration-tariffs-cabinet-live-updates-2095945",
    "timestamp": "2025-07-08T11:32:14Z"
  },
  {
    "title": "FIFA opens office in Trump Tower",
    "description": "World football chief Gianni Infantino has forged a close relationship with Donald Trump.",
    "link": "https://www.politico.eu/article/fifa-opens-office-donald-trump-tower/",
    "timestamp": "2025-07-08T11:30:49Z"
  },
  {
    "title": "What Pete Hegseth Doesn’t Understand About Soldiers",
    "description": "Lethality alone doesn’t win wars.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/08/warrior-myth-lethality-pete-hegseth/683247/",
    "timestamp": "2025-07-08T11:30:00Z"
  },
  {
    "title": "Global stock markets are calling Trump’s bluff on tariffs",
    "description": "Global markets shrugged off news of Trump's latest tariffs, with both Asia-Pacific and Europe stocks staging a muted response Tuesday.",
    "link": "https://www.cnbc.com/2025/07/08/trump-tariffs-global-stock-markets-call-presidents-bluff-ftse-100-sp-500-nasdaq-dow-jones-dax-nikkei.html",
    "timestamp": "2025-07-08T11:26:50Z"
  },
  {
    "title": "Trump lies as GOP protects their stocks while ripping health care from 17 million Americans - NewsBreak",
    "description": "Trump lies as GOP protects their stocks while ripping health care from 17 million Americans - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4090926780672-trump-lies-as-gop-protects-their-stocks-while-ripping-health-care-from-17-million-americans?s=a2&amp;share_destination_id=MjA4NDA5Njc1LTE3NTE5NzM5MTY3Mjk%3D&amp;pd=0E6SsNAP&amp;hl=en_US&amp;send_time=1751973916&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v1%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_recall_exp_25q3-v9%2Cns_foryou_model_exp_25q2_v2-v7",
    "timestamp": "2025-07-08T11:26:31Z"
  },
  {
    "title": "Quote of the Day",
    "description": "“In another life we would be friends and go golfing.” — Donald Trump, quoted by Axios, speaking to Joe Biden after the 2024 election.",
    "link": "https://politicalwire.com/2025/07/08/quote-of-the-day-4207/",
    "timestamp": "2025-07-08T11:25:52Z"
  },
  {
    "title": "US adults want the government to focus on child care costs, not birth rates, AP-NORC poll finds",
    "description": "A new AP-NORC poll finds most Americans do not want the government to focus on increasing birth rates, despite efforts by the Trump administration to make this a priority. Instead, people want the government to focus on reducing child care costs and improving…",
    "link": "https://www.seattlepi.com/news/article/us-adults-want-the-government-to-focus-on-child-20760481.php",
    "timestamp": "2025-07-08T11:25:43Z"
  },
  {
    "title": "Trump Tariffs Shake Markets — Discover the Best Altcoins to Weather the Tariff Storm",
    "description": "If there’s one constant in crypto, it’s that Donald Trump will either pump the market to the moon or smash it into the floor. This time, it’s the latter. Trump’s latest round of tariffs – 25% on Japan and South Korea, plus vague threats to BRICS-aligned count…",
    "link": "https://bitcoinist.com/trump-tariffs-shake-markets-the-best-altcoins-to-weather-the-tariff-storm/",
    "timestamp": "2025-07-08T11:25:42Z"
  },
  {
    "title": "Gracie Hunt, daughter of Chiefs owners, mourns loss of young relative killed in Texas floods",
    "description": "Gracie Hunt, the daughter of Kansas City Chiefs owners Clark and Tavia Hunt, mourned the loss of a 9-year-old relative killed in the Texas floods.",
    "link": "https://www.foxnews.com/sports/gracie-hunt-daughter-chiefs-owners-mourns-loss-young-relative-killed-texas-floods",
    "timestamp": "2025-07-08T11:25:27Z"
  },
  {
    "title": "Tesla’s troubles are deeper than you think | CNN Business",
    "description": "Tesla’s troubles go far beyond CEO Elon Musk’s recent dust-up with President Donald Trump, who accused the former “first buddy” of going “completely ‘off the rails’” in a social media slap fight over the weekend.",
    "link": "https://www.cnn.com/2025/07/08/business/tesla-troubled-financial-outlook",
    "timestamp": "2025-07-08T11:23:43Z"
  },
  {
    "title": "Trump Extends His Tariff Deadline as He Threatens More Dues",
    "description": "President Donald Trump says the window for countries to negotiate new trade deals with the United States to avoid a spike in tariffs is all but closed with one day to go before the 90-day deadline to strike a deal or face “reciprocal tariffs.” It comes as he …",
    "link": "https://www.today.com/video/trump-raises-tariff-rates-on-14-countries-up-to-40-242837061817",
    "timestamp": "2025-07-08T11:21:45Z"
  },
  {
    "title": "Ex-Trump Press Secretary Hogan Gidley Says Elon Musk’s New Party Is Great ‘in Theory,’ But Warns Billionaire Has ‘No Natural Base’",
    "description": "Former Trump White House deputy press secretary Hogan Gidley argued that while Elon Musk's launch of a third party was great \"in theory,\" Musk had no base.\nThe post Ex-Trump Press Secretary Hogan Gidley Says Elon Musk’s New Party Is Great ‘in Theory,’ But War…",
    "link": "https://www.mediaite.com/media/tv/ex-trump-press-secretary-hogan-gidley-says-elon-musks-new-party-is-great-in-theory-but-warns-billionaire-has-no-natural-base/",
    "timestamp": "2025-07-08T11:21:35Z"
  },
  {
    "title": "Elon Musk's Net Worth Takes $15B Hit After Forming New Political Party",
    "description": "The Tesla CEO's net worth has decreased since he announced he would form a new political party.",
    "link": "https://www.newsweek.com/elon-musk-new-political-party-net-worth-2095896",
    "timestamp": "2025-07-08T11:19:19Z"
  },
  {
    "title": "Five Israeli soldiers killed in Gaza as pressure mounts for ceasefire",
    "description": "At least 887 Israeli soldiers have been killed in 21-month Gaza war, which has left at least 57,523 Palestinians dead.",
    "link": "https://www.aljazeera.com/news/2025/7/8/five-israeli-soldiers-killed-in-gaza-as-pressure-mounts-for-ceasefire",
    "timestamp": "2025-07-08T11:18:41Z"
  },
  {
    "title": "US adults want the government to focus on child care costs, not birth rates, AP-NORC poll finds",
    "description": "A new AP-NORC poll finds most Americans do not want the government to focus on increasing birth rates, despite efforts by the Trump administration to make this a priority.",
    "link": "https://www.clickondetroit.com/health/2025/07/08/us-adults-want-the-government-to-focus-on-child-care-costs-not-birth-rates-ap-norc-poll-finds/",
    "timestamp": "2025-07-08T11:15:00Z"
  },
  {
    "title": "Report: Leftwing Activists Tell Dem Lawmakers to ‘Prepare For Violence’ to Stop Trump, ‘There Needs to Be Blood’",
    "description": "Crazed Left-wing activists throughout the country are reportedly demanding that Democrat members of Congress “break the rules, fight dirty” and even resort to violence to stop President Trump from implementing his agenda. According to Axios, House Democrats a…",
    "link": "https://freerepublic.com/focus/f-chat/4327444/posts",
    "timestamp": "2025-07-08T11:14:48Z"
  },
  {
    "title": "Tuesday, July 8. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,230.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/07/08/tuesday-july-8-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-07-08T11:14:34Z"
  },
  {
    "title": "North Carolina governor vetoes ‘mean-spirited’ anti-trans and DEI bills",
    "description": "North Carolina Democratic governor Josh Stein has vetoed “mean-spirited” bills targeting trans rights and Diversity, Equity and Inclusion (DEI) policies. Stein, who is also pro-choice, vetoed three anti-DEI measures and one that would target trans rights.  Th…",
    "link": "https://www.thepinknews.com/2025/07/08/north-carolina-governor-vetoes-mean-spirited-anti-trans-and-dei-bills/",
    "timestamp": "2025-07-08T11:13:22Z"
  },
  {
    "title": "Barron Trump's love life revealed: US President's son has a mysterious girlfriend amid college life? What we know",
    "description": "Barron Trump has a mysterious girlfriend and this has set the internet ablaze. According to reports, Barron Trump, the youngest son Donald Trump and Melania Trump, has got his first girlfriend and spends all his time with her. Tongues are wagging that the New…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trumps-love-life-revealed-us-presidents-son-has-a-mysterious-girlfriend-amid-college-life-what-we-know/articleshow/122319734.cms",
    "timestamp": "2025-07-08T11:12:40Z"
  },
  {
    "title": "World’s premier cancer institute faces crippling cuts and chaos | CNN",
    "description": "The Trump administration’s broadsides against scientific research have caused unprecedented upheaval at the National Cancer Institute, the storied federal government research hub that has spearheaded advances against the disease for decades.",
    "link": "https://www.cnn.com/2025/07/08/health/national-cancer-institute-cuts-kff-health-news",
    "timestamp": "2025-07-08T11:12:03Z"
  },
  {
    "title": "China says it will retaliate on unfavorable deals after Trump warns Asia of higher tariffs",
    "description": "Chinese state media warned the Trump administration against striking deals that sideline China, after the president announced that Asian countries would face higher tariffs starting on Aug. 1.",
    "link": "https://www.nbcnews.com/world/asia/china-will-retaliate-trump-warns-asia-higher-tariffs-transshipments-rcna217414",
    "timestamp": "2025-07-08T11:11:22Z"
  },
  {
    "title": "Indonesia to respond soon to US 32 percent tariff, says minister",
    "description": "The Indonesian government will soon announce its response to the United States&rsquo; decision to maintain a 32 percent import tariff on Indonesian goods, ...",
    "link": "https://en.antaranews.com/news/364865/indonesia-to-respond-soon-to-us-32-percent-tariff-says-minister",
    "timestamp": "2025-07-08T11:08:43Z"
  },
  {
    "title": "Houston Reverend Condemns Girlfriend’s Viral ‘White-Only’ Rant About Deadly Camp Mystic Flood",
    "description": "The reverend boyfriend of Sadé Perkins publicly condemned her incendiary rant about the deadly flood that killed 27 girls and counselors at Camp Mystic in Texas.\nThe post Houston Reverend Condemns Girlfriend’s Viral ‘White-Only’ Rant About Deadly Camp Mystic …",
    "link": "https://www.mediaite.com/media/news/houston-reverend-condemns-girlfriends-viral-white-only-rant-about-deadly-camp-mystic-flood/",
    "timestamp": "2025-07-08T11:08:09Z"
  },
  {
    "title": "Iran president faces backlash over 'soft' stance",
    "description": "Iranian President Masoud Pezeshkian came under fire on July 8 after voicing support for renewed talks with the United States, with critics accusing him of being \"too soft\" in the wake of last month's attacks on the country.",
    "link": "https://www.hurriyetdailynews.com/iran-president-faces-backlash-over-soft-stance-211238",
    "timestamp": "2025-07-08T11:07:33Z"
  },
  {
    "title": "GOP lawmakers rip Newsom, California officials for allowing trans athletes to compete in girls' sports",
    "description": "Republican California lawmakers took the state's education department and Gov. Gavin Newsom to task after officials refused to be in Title IX compliance.",
    "link": "https://www.foxnews.com/sports/gop-lawmakers-rip-newsom-california-officials-allowing-trans-athletes-compete-girls-sports",
    "timestamp": "2025-07-08T11:05:18Z"
  },
  {
    "title": "Here Comes the Bribe. What To Do About the $16M CBS Is Paying Donald Trump | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIncredibly, it's happened. In broad daylight, amid credible claims of corruption, CBS has agreed to pay President Donald Trump's library $16 million for Federal Communication Commission (FCC) approval of a bro…",
    "link": "https://biztoc.com/x/db326b9148362a1b",
    "timestamp": "2025-07-08T11:05:10Z"
  },
  {
    "title": "Elon Musk's Trump fallout poses deepening risks to Tesla, SpaceX",
    "description": "",
    "link": "https://biztoc.com/x/7594c60d50fd845e",
    "timestamp": "2025-07-08T11:05:07Z"
  },
  {
    "title": "Firefighters From Mexico Help Rescue And Recover Teams In Texas",
    "description": "Let's play a game called 'Remember This?' Back when western North Carolina towns were rattled, and some were destroyed by Hurricane Helene, Donald J. Trump flew in to tell officials that President Biden \"did a bad job.\" Then, in late April, FEMA, which operat…",
    "link": "https://crooksandliars.com/2025/07/firefighters-mexico-help-rescue-and",
    "timestamp": "2025-07-08T11:02:54Z"
  },
  {
    "title": "Scrutiny over Texas flood alerts and conservative anger after Epstein memo release: Morning Rundown",
    "description": "A look at one Texas city’s weather warning system, as questions swirl about the timing of flash flood warnings.",
    "link": "https://www.nbcnews.com/news/us-news/texas-flood-alerts-epstein-memo-release-morning-rundown-rcna217402",
    "timestamp": "2025-07-08T11:02:01Z"
  },
  {
    "title": "Owning Pride: Overcoming oppression and being true selves (Letters)",
    "description": "\"I am not “proud” because I am gay. I am proud because somehow I found in the depths of my being, against all these realities of my young life, the courage to simply be and live openly as the gay person I am.\"\n-- Wayne Thrash, Denver",
    "link": "https://www.denverpost.com/2025/07/08/colorado-pride-support-lgbtq-community/",
    "timestamp": "2025-07-08T11:01:21Z"
  },
  {
    "title": "Gaza civil defence says 29 killed in Israeli strikes",
    "description": "Gaza's civil defence agency said that 29 people were killed in Israeli strikes across the Palestinian territory devastated by 21 months of war.",
    "link": "https://www.rte.ie/news/2025/0708/1522425-displaced-people-gaza/",
    "timestamp": "2025-07-08T11:01:13Z"
  },
  {
    "title": "Environmental activists complain California Democrats have 'backed down' on climate change",
    "description": "California Democrats faced backlash from climate change lobbyists and activists over appearing to roll back environmental laws over the past few weeks.",
    "link": "https://www.foxnews.com/media/environmental-activists-complain-california-democrats-have-backed-down-climate-change",
    "timestamp": "2025-07-08T11:00:34Z"
  },
  {
    "title": "Transcript: Trump Blurts Out Awkward Truth about ICE as MAGA Seethes",
    "description": "The following is a lightly edited transcript of the July 8 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\n President…",
    "link": "https://newrepublic.com/article/197676/transcript-trump-blurts-awkward-truth-ice-maga-seethes",
    "timestamp": "2025-07-08T11:00:07Z"
  },
  {
    "title": "Even without wins, Musk party may be threat to Trump...",
    "description": "Donald Trump has shrugged off Elon Musk's plans for a new political party as \"ridiculous\" -- but the announcement underscored the threat the disaffected...",
    "link": "https://www.yahoo.com/news/even-without-wins-musks-party-011505179.html",
    "timestamp": "2025-07-08T11:00:03Z"
  },
  {
    "title": "Here Comes the Bribe. What To Do About the $16M CBS Is Paying Donald Trump | Opinion",
    "description": "The truth about these shabby dealings should have consequences.",
    "link": "https://www.newsweek.com/here-comes-bribe-what-do-about-16m-cbs-paying-donald-trump-opinion-2095687",
    "timestamp": "2025-07-08T11:00:01Z"
  },
  {
    "title": "Call Your Doctor—RFK's Anti-Vax Coup Means Your Kids' Vaccines May Be Out of Reach | Opinion",
    "description": "If RFK has his way, even if you still have coverage, you may not be able to afford the shots that your doctor wants to give.",
    "link": "https://www.newsweek.com/call-your-doctorrfks-anti-vax-coup-means-your-kids-vaccines-may-out-reach-opinion-2095598",
    "timestamp": "2025-07-08T11:00:01Z"
  },
  {
    "title": "Musk faces a daunting path in challenging U.S. two-party system",
    "description": "Musk announced the birth of the \"America Party” — dedicated, he said, to defeating Republicans who backed Trump’s massive tax-cut and spending bill.",
    "link": "https://www.japantimes.co.jp/news/2025/07/08/world/politics/musk-political-party-hurdles/",
    "timestamp": "2025-07-08T11:00:00Z"
  },
  {
    "title": "Russia Just Launched Its Largest Air Strikes on Ukraine Yet",
    "description": "The Ukrainian Interior Ministry confirmed that Russia’s latest attack killed at least one civilian and injured between 23 and 26 people, including several children.\nThe post Russia Just Launched Its Largest Air Strikes on Ukraine Yet appeared first on The Nat…",
    "link": "https://nationalinterest.org/blog/buzz/russia-just-launched-largest-air-strikes-ukraine-hk",
    "timestamp": "2025-07-08T11:00:00Z"
  },
  {
    "title": "Trump’s New Favorite General",
    "description": "Dan “Razin” Caine, chairman of the Joint Chiefs, doesn’t want the spotlight—but with this White House, there’s no avoiding it.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/07/razin-caine-donald-trump-joint-chiefs/683440/",
    "timestamp": "2025-07-08T11:00:00Z"
  },
  {
    "title": "Gainers & Losers: Titan, BSE among 6 stocks in action on Tuesday",
    "description": "Sensex and Nifty ended higher as tariff delays and India-US deal hopes boosted sentiment. Stocks like Alok, Kotak rose, while Titan, BSE, and Angel One declined post updates and probes.",
    "link": "https://m.economictimes.com/markets/web-stories/gainers-amp-losers-titan-bse-among-6-stocks-in-action-on-tuesday/slideshow/122319521.cms",
    "timestamp": "2025-07-08T10:59:57Z"
  },
  {
    "title": "Who’s definitely in the Epstein Files, by a gobshite down the pub",
    "description": "YOU know why they’ve lost that Epstein client list, don’t you? Trump’s all over it. And Prince Andy, of course, and Musk. Mine’s a pint and I’ll tell all.",
    "link": "https://www.thedailymash.co.uk/politics/whos-definitely-in-the-epstein-files-by-a-gobshite-down-the-pub-20250708258493",
    "timestamp": "2025-07-08T10:59:23Z"
  },
  {
    "title": "Emmanuel Macron greeted by Prince William and Kate Middleton as he arrives in UK for 3-day state visit",
    "description": "Macron’s three-day visit, at the invitation of King Charles III, is the first state visit to the UK by a European Union head of state since Brexit.",
    "link": "https://nypost.com/2025/07/08/world-news/frances-emmanuel-macron-greeted-by-prince-william-and-kate-middleton-as-he-arrives-in-uk-for-3-day-state-visit/",
    "timestamp": "2025-07-08T10:59:01Z"
  },
  {
    "title": "Trump says US close to trade deal with India amid tariffs on 14 nations",
    "description": "President Trump nears trade deal with India, imposes tariffs on 14 nations including Japan and South Korea. #USIndiaTrade #TrumpTariffs",
    "link": "https://www.thehindubusinessline.com/multimedia/video/trump-says-us-close-to-trade-deal-with-india-amid-tariffs-on-14-nations/article69787242.ece",
    "timestamp": "2025-07-08T10:58:34Z"
  },
  {
    "title": "Fired State Dept bureaucrats reportedly using their regime change skills to sabotage Trump",
    "description": "Fired government bureaucrats with regime change experience abroad are reportedly applying those skills domestically against President Trump's administration.",
    "link": "https://www.foxnews.com/media/fired-state-dept-bureaucrats-reportedly-using-regime-change-skills-sabotage-trump",
    "timestamp": "2025-07-08T10:57:49Z"
  },
  {
    "title": "Donald Trump's Chances of Winning Nobel Peace Prize: Odds",
    "description": "The president is currently the second favorite among bookies.",
    "link": "https://www.newsweek.com/donald-trump-chances-winning-nobel-peace-prize-benjamin-netanyahu-odds-2095892",
    "timestamp": "2025-07-08T10:57:34Z"
  },
  {
    "title": "Trump reimposes 25% tariffs on Malaysian-made goods to the US, although semiconductors exempted",
    "description": "The on-again, off-again Trump tariffs on foreign-made goods are now back on again, as US president Donald Trump will reinstate a 25% tariff on products produced in Malaysia from August 1, Malay Mail has reported. […]\nThe post Trump reimposes 25% tariffs on Ma…",
    "link": "https://paultan.org/2025/07/08/trump-reimposes-25-tariffs-on-malaysian-made-goods-to-the-us-although-semiconductors-exempted/",
    "timestamp": "2025-07-08T10:56:36Z"
  },
  {
    "title": "Media and aid groups should be allowed in to see ‘full horrors’ of Gaza bombardment, Taoiseach says",
    "description": "Tánaiste says extension for EU-US tariff talks a ‘clear indication’ that Donald Trump understands need to secure agreement",
    "link": "https://www.irishtimes.com/politics/2025/07/08/media-and-aid-groups-should-be-allowed-in-to-see-full-horrors-of-gaza-bombardment-taoiseach-says/",
    "timestamp": "2025-07-08T10:55:47Z"
  },
  {
    "title": "Links 7/8/2025",
    "description": "Our rollicking daily links: RFK, Jr. hearts bird flu, nuclear renaissance? BRICS underwhelms, China-India rare earths dustup, moar NATO fear-mongering, Tucker Pezeshkian interview, Netanyahu nominates Trump for Peace Prize, Russia to gear up? Trump tariff thr…",
    "link": "https://www.nakedcapitalism.com/2025/07/links-7-8-2025.html",
    "timestamp": "2025-07-08T10:55:33Z"
  },
  {
    "title": "Jon Stewart Obliterates GOP’s Big Beautiful Bill Flip-Flop and Dems’ ‘Fecklessness’: ‘Washington Bullsh*ttery!’",
    "description": "Stewart torched GOP flip-flopping and Democratic \"fecklessness\" while skewering Trump’s “big, beautiful bill” as a giveaway to the wealthy.\nThe post Jon Stewart Obliterates GOP’s Big Beautiful Bill Flip-Flop and Dems’ ‘Fecklessness’: ‘Washington Bullsh*ttery!…",
    "link": "https://www.mediaite.com/media/tv/jon-stewart-obliterates-gops-big-beautiful-bill-flip-flop-and-dems-fecklessness-washington-bullshttery/",
    "timestamp": "2025-07-08T10:54:22Z"
  }
]