[
  {
    "title": "US carries out new drug boat strike in Caribbean, as admiral resigns",
    "description": "The latest strike came a day after US President Trump confirmed he had authorised CIA operations in Venezuela.",
    "link": "https://www.aljazeera.com/news/2025/10/17/us-carries-out-new-drug-boat-strike-as-admiral-announces-shock-resignation",
    "timestamp": "2025-10-17T02:33:43Z"
  },
  {
    "title": "Scott Bessent Says US Investment Boom 'Sustainable' Under Trump: 'The Only Thing Slowing Us Down...'",
    "description": "U.S. Treasury Secretary Scott Bessent credited the country’s investment boom to President Donald Trump‘s policies on Wednesday, and expressed optimism about ...",
    "link": "https://finance.yahoo.com/news/scott-bessent-says-us-investment-023111948.html",
    "timestamp": "2025-10-17T02:31:11Z"
  },
  {
    "title": "Ace Frehley, KISS lead guitarist, dies at 74",
    "description": "Ace Frehley, the original lead guitarist for the rock band KISS, has died. He was 74.Frehley reportedly suffered a brain bleed when he fell in his studio a couple weeks ago, according to TMZ. The family said he died \"peacefully surrounded by family in Morrist…",
    "link": "https://freerepublic.com/focus/f-chat/4346864/posts",
    "timestamp": "2025-10-17T02:28:45Z"
  },
  {
    "title": "Boston prepares for 'No Kings' rally as thousands expected to attend",
    "description": "Boston prepares for 'No Kings' rally as thousands expected to attendwcvb.com",
    "link": "https://www.wcvb.com/article/boston-no-kings-rally-preparations/69065194",
    "timestamp": "2025-10-17T02:28:29Z"
  },
  {
    "title": "Turns out one military commander doesn't want to follow unlawful orders to kill boaters in the Caribbean [News]",
    "description": "Turns out one military commander doesn't want to follow unlawful orders to kill boaters in the Caribbean",
    "link": "https://www.fark.com/comments/13847510/Turns-out-one-military-commander-doesnt-want-to-follow-unlawful-orders-to-kill-boaters-in-Caribbean",
    "timestamp": "2025-10-17T02:27:01Z"
  },
  {
    "title": "BL Morning report: October 17, 2025",
    "description": "Consumer durable makers see strong Diwali sales post-GST cuts, Trump claims Modi will halt Russian oil imports, Wipro reports modest growth.",
    "link": "https://www.thehindubusinessline.com/multimedia/audio/bl-morning-report-october-17-2025/article70172411.ece",
    "timestamp": "2025-10-17T02:25:00Z"
  },
  {
    "title": "US lawmaker says licensing deal for TikTok algorithm would raise serious concerns",
    "description": "WASHINGTON: The chair of the House Select Committee on China said on Thursday (Oct 16) that a licensing agreement for use of the TikTok algorithm, as part of a deal by China-based ByteDance t",
    "link": "https://www.channelnewsasia.com/world/us-tiktok-algorithm-licensing-deal-bytedance-serious-concerns-5407161",
    "timestamp": "2025-10-17T02:24:00Z"
  },
  {
    "title": "Homeland Security says Marine's father who was deported had faced domestic violence, assault charges",
    "description": "The Department of Homeland Security says the father of a Marine arrested by immigration authorities when visiting his pregnant daughter at Camp Pendleton has a criminal record that includes charges of domestic violence and aggravated assault with a dea...",
    "link": "https://abcnews.go.com/US/wireStory/homeland-security-marines-father-deported-faced-domestic-violence-126602492",
    "timestamp": "2025-10-17T02:22:00Z"
  },
  {
    "title": "Accelerating Authoritarian Dynamics: Assessment of Democratic Decline",
    "description": "Article URL: https://steadystate1.substack.com/p/accelerating-authoritarian-dynamics\nComments URL: https://news.ycombinator.com/item?id=45612748\nPoints: 12\n# Comments: 0",
    "link": "https://steadystate1.substack.com/p/accelerating-authoritarian-dynamics",
    "timestamp": "2025-10-17T02:17:38Z"
  },
  {
    "title": "Putin-Trump call a curveball for Zelensky ahead of White House meeting",
    "description": "The phone conversation, held while Zelensky was flying to Washington, stole a march on his big moment.",
    "link": "https://www.bbc.com/news/articles/cze63r34213o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-17T02:17:27Z"
  },
  {
    "title": "Trump plans to leave his mark on Washington by building a Paris-like arch near the Lincoln Memorial (Darlene Superville/Associated Press)",
    "description": "Darlene Superville / Associated Press:\nTrump plans to leave his mark on Washington by building a Paris-like arch near the Lincoln Memorial  —  Add AP News to Google Add AP News as your preferred source to see more of our stories on Google.  Share  —  Presiden…",
    "link": "https://www.memeorandum.com/251016/p168",
    "timestamp": "2025-10-17T02:15:01Z"
  },
  {
    "title": "North Carolina GOP's proposed map seeks to thwart Democratic incumbent's reelection",
    "description": "Republican leaders in North Carolina have proposed a new U.S. House district map that could thwart reelection prospects of a Democratic incumbent in the state's only swing seat",
    "link": "https://abcnews.go.com/US/wireStory/north-carolina-gops-proposed-map-seeks-thwart-democratic-126598036",
    "timestamp": "2025-10-17T02:13:38Z"
  },
  {
    "title": "Carmakers push to secure chips as China trade spat escalates",
    "description": "While Chinese leader Xi Jinping and U.S. President Donald Trump are to meet this month to hammer out a trade accord, both sides announced restrictions that have raised tensions.",
    "link": "https://biztoc.com/x/4144ce5c4c2a56ee",
    "timestamp": "2025-10-17T02:09:29Z"
  },
  {
    "title": "Putin-Trump call a curveball for Zelensky ahead of White House meeting",
    "description": "The phone conversation, held while Zelensky was flying to Washington, stole a march on his big moment.",
    "link": "https://www.bbc.com/news/articles/cze63r34213o",
    "timestamp": "2025-10-17T02:08:18Z"
  },
  {
    "title": "Erika Kirk shows TPUSA staff Charlie's Medal of Freedom: 'You guys are all part of the legacy'",
    "description": "Erika Kirk, now CEO of Turning Point USA, shares her late husband Charlie Kirk's Presidential Medal of Freedom with staff in an emotional office moment.",
    "link": "https://www.foxnews.com/politics/erika-kirk-shows-tpusa-staff-charlies-medal-freedom-you-guys-all-part-legacy",
    "timestamp": "2025-10-17T02:07:23Z"
  },
  {
    "title": "Carmakers push to secure chips as China trade spat escalates",
    "description": "While Chinese leader Xi Jinping and U.S. President Donald Trump are to meet this month to hammer out a trade accord, both sides announced restrictions that have raised tensions.",
    "link": "https://www.japantimes.co.jp/business/2025/10/17/carmakers-chips-china-trade/",
    "timestamp": "2025-10-17T02:07:00Z"
  },
  {
    "title": "'This Is The Caribbean, Peace And Love': Trinidadians On US Boat Strikes",
    "description": "Trinidad and Tobago was in shock Thursday over the reported deaths of two local men in a US strike on a suspected drug boat, the latest of Venezuela's neighbors to become sucked into Washington's pressure campaign.",
    "link": "https://www.ibtimes.com/this-caribbean-peace-love-trinidadians-us-boat-strikes-3787361",
    "timestamp": "2025-10-17T02:06:12Z"
  },
  {
    "title": "Dollar set for weekly slide as trade, shutdown concerns weigh",
    "description": "The dollar is on a downward trend, fueled by escalating global trade disputes and indicators of a sluggish U.S. economy. This shift bolsters the argument for the Federal Reserve to consider lowering interest rates. As a result, investors are gravitating towar…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-set-for-weekly-slide-as-trade-shutdown-concerns-weigh/articleshow/124618393.cms",
    "timestamp": "2025-10-17T02:05:58Z"
  },
  {
    "title": "Oil set for weekly loss as Trump-Putin summit looms",
    "description": "Oil prices are witnessing a dip, thanks to the alleviation of global energy supply anxieties. In a pivotal moment for international relations, President Donald Trump is preparing to sit down with President Vladimir Putin to deliberate on solutions for the Ukr…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-set-for-weekly-loss-as-trump-putin-summit-looms/articleshow/124618369.cms",
    "timestamp": "2025-10-17T02:02:28Z"
  },
  {
    "title": "Selmayr’s possible comeback raises prospect of major von der Leyen-Kallas turf war",
    "description": "One of the EU's most powerful men could be in line for a big job at the heart of the bloc's decision-making. Some officials are alarmed.",
    "link": "https://www.politico.eu/article/martin-selmayr-comeback-raises-prospect-major-ursula-von-der-leyen-kaja-kallas-turf-war/",
    "timestamp": "2025-10-17T02:02:00Z"
  },
  {
    "title": "As France burned, Macron was looking for his legacy",
    "description": "The French president's dogged determination to defend his achievements risks backfiring.",
    "link": "https://www.politico.eu/article/emmanuel-macron-france-legacy-crisis-egypt/",
    "timestamp": "2025-10-17T02:02:00Z"
  },
  {
    "title": "Democrats Enlist Obama to Endorse Abigail Spanberger in Virginia, an Obvious Sign of Desperation (VIDEO)",
    "description": "Democrats are worried about the governor race in Virginia.\nThe post Democrats Enlist Obama to Endorse Abigail Spanberger in Virginia, an Obvious Sign of Desperation (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/democrats-enlist-obama-endorse-abigail-spanberger-virginia-obvious/",
    "timestamp": "2025-10-17T02:00:58Z"
  },
  {
    "title": "Gold extends record rally above $4,300, eyes best weekly gain since 2008",
    "description": "Gold has reached unprecedented heights, with rising tensions between the U.S. and China driving investors towards this safe haven. Anticipation of upcoming U.S. interest rate cuts adds more fuel to the fire, prompting a spike in demand. Simultaneously, silver…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-extends-record-rally-above-4300-eyes-best-weekly-gain-since-2008/articleshow/124618334.cms",
    "timestamp": "2025-10-17T01:58:34Z"
  },
  {
    "title": "Russian barrage causes blackouts in Ukraine as Zelenskyy seeks Trump's help",
    "description": "Russia has launched a heavy bombardment on Ukraine's energy facilities, using hundreds of drones and dozens of missiles",
    "link": "https://abcnews.go.com/International/wireStory/russian-barrage-causes-blackouts-ukraine-zelenskyy-seeks-trumps-126572365",
    "timestamp": "2025-10-17T01:57:23Z"
  },
  {
    "title": "Federal Grand Jury Indicts Two Alleged Antifa Members with Terrorism Charges for Attack on ICE Facility",
    "description": "Two alleged Antifa members were indicted by a federal grand jury this week for reportedly attacking an Immigration and Customs Enforcement (ICE) facility in Texas this past July.\nThe post Federal Grand Jury Indicts Two Alleged Antifa Members with Terrorism Ch…",
    "link": "https://www.breitbart.com/politics/2025/10/16/federal-grand-jury-indicts-two-alleged-antifa-members-terrorism-charges-ice-facility/",
    "timestamp": "2025-10-17T01:55:19Z"
  },
  {
    "title": "Donald Trump's Dream Palace of Puffery (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nDonald Trump's Dream Palace of Puffery  —  The Pentagon's ban on real journalism looks to be a preview of where the White House is headed.  —  Two weeks into a federal-government shutdown, with no end in sight and President Dona…",
    "link": "https://www.memeorandum.com/251016/p167",
    "timestamp": "2025-10-17T01:55:01Z"
  },
  {
    "title": "Wall Street ends down; Zions sparks worries about regional banks",
    "description": "In the latest market session, Indian shares slipped as concerns loom over regional banking stability and complex trade dynamics with the US and China. Notably, Zions Bancorporation and Western Alliance faced hefty losses, dragging down the tech sector as well.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/wall-street-ends-down-zions-sparks-worries-about-regional-banks/articleshow/124618308.cms",
    "timestamp": "2025-10-17T01:54:48Z"
  },
  {
    "title": "Tomahawk missiles, Ukraine peace, and next in-person summit: Key takeaways from new Putin-Trump phone call",
    "description": "Donald Trump and Vladimir Putin discussed the Ukraine conflict during their phone call on Thursday Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626573-putin-trump-call-recap/",
    "timestamp": "2025-10-17T01:54:16Z"
  },
  {
    "title": "Marc Elias: John Bolton was indicted \"because Donald Trump hates him\"",
    "description": "Former national security adviser John Bolton has been indicted, another escalation in Trump's retribution campaign against ...",
    "link": "https://biztoc.com/x/8917a751f618c984",
    "timestamp": "2025-10-17T01:49:47Z"
  },
  {
    "title": "China and US step up war of words ahead of possible Trump-Xi face-off",
    "description": "Trade warChina and US step up war of words ahead of possible Trump-Xi face-off\nBeijing says US actions 'mainly' to blame for friction, decoupling 'not realistic'\nChinese shipping containers at the Port of Oakland in California. U.S. President Donald Trump thi…",
    "link": "https://biztoc.com/x/55173b1d9bfecddc",
    "timestamp": "2025-10-17T01:47:09Z"
  },
  {
    "title": "Over 170 US Citizens held by immigration agents — some for days without contact",
    "description": "We Found That More Than 170 U.S. Citizens Have Been Held by Immigration Agents. They’ve Been Kicked, Dragged and Detained for Days.by Nicole Foy, photography by Sarahbeth ManeyProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big …",
    "link": "https://www.rawstory.com/immigration-arrests/",
    "timestamp": "2025-10-17T01:47:03Z"
  },
  {
    "title": "Trump, Crime Loom Large in New York Mayor Debate. Here Are 4 Key Moments.",
    "description": "Three candidates debated for the first time Thursday night in New York’s mayoral race. The election has garnered a significant amount of attention this year... Read More\nThe post Trump, Crime Loom Large in New York Mayor Debate. Here Are 4 Key Moments. appear…",
    "link": "https://www.dailysignal.com/2025/10/16/trump-crime-loom-large-in-new-york-mayor-debate-here-are-4-key-moments/",
    "timestamp": "2025-10-17T01:45:55Z"
  },
  {
    "title": "JB Pritzker Thinks Trump Has 'Mental Health Issues' — And This Insider Is Making The Most Of It",
    "description": "The governor of Illinois worried about the president's \"diminished capacity\" and how it might make it all too easy for insiders to co-opt his power.",
    "link": "https://www.huffpost.com/entry/jb-pritzker-trump-mental-health-issues-stephen-miller_n_68f15c7ee4b017d85b749197",
    "timestamp": "2025-10-17T01:45:38Z"
  },
  {
    "title": "'No doubt' Albanese and Trump will discuss critical minerals: Chalmers",
    "description": "Anthony Albanese will \"no doubt\" use a meeting with Donald Trump next week to discuss critical minerals, the treasurer says as he dismisses a call for Australia to \"decouple\" with China over rare earth materials.",
    "link": "https://www.abc.net.au/news/2025-10-17/albanese-trump-chalmers-critical-minerals-deal/105903392",
    "timestamp": "2025-10-17T01:44:14Z"
  },
  {
    "title": "States are redistricting to help one party but sometimes the move can backfire",
    "description": "An unprecedented number of states are considering redrawing their congressional district lines mid-decade",
    "link": "https://abcnews.go.com/Politics/wireStory/states-redistricting-party-move-backfire-126595411",
    "timestamp": "2025-10-17T01:42:03Z"
  },
  {
    "title": "Mamdani Does Not Deny Cuomo’s Accusation That He Skipped Voting For Kamala In 2024",
    "description": "Democratic New York City mayoral nominee Zohran Mamdani did not appear to deny his opponent’s charge that he did not vote for former Vice President Kamala Harris in the 2024 presidential election. During Thursday’s debate, ahead of the New York City mayoral g…",
    "link": "https://dailycaller.com/2025/10/16/zohran-mamdani-andrew-cuomo-kamala-harris-debate/",
    "timestamp": "2025-10-17T01:40:28Z"
  },
  {
    "title": "Election Denier Kathy Griffin Doesn’t Think Trump Won in 2024, Calls Elon Musk a ‘Professional Nazi’ (VIDEO)",
    "description": "Kathy Griffin supposedly used to be a comedian.\nThe post Election Denier Kathy Griffin Doesn’t Think Trump Won in 2024, Calls Elon Musk a ‘Professional Nazi’ (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/election-denier-kathy-griffin-doesnt-think-trump-won/",
    "timestamp": "2025-10-17T01:40:02Z"
  },
  {
    "title": "Trump refiles $15 billion defamation lawsuit against New York Times",
    "description": "President Donald Trump revived his $15 billion lawsuit against The New York Times after a federal judge in Florida threw it out of court for being too long.",
    "link": "https://www.foxnews.com/media/trump-refiles-15-billion-defamation-lawsuit-against-new-york-times",
    "timestamp": "2025-10-17T01:39:52Z"
  },
  {
    "title": "Mamdani Hews to Left Message at Mayoral Debate, While Cuomo and Sliwa Battle",
    "description": "The candidates were pressed on issues like Israel and Trump in the first hour, before the debate turned to local issues like housing, safety and education.",
    "link": "https://www.huffpost.com/entry/mamdani-cuomo-sliwa-new-york-city-mayor-debate_n_68f19caee4b061265b2c5c5f",
    "timestamp": "2025-10-17T01:38:55Z"
  },
  {
    "title": "The Australian agrees to new Pentagon press rules, according to US reports",
    "description": "The newspaper had joined a small list of publications to agree to controversial new media rules, which led to major news outlets walking away from their press access.",
    "link": "https://www.smh.com.au/business/companies/the-australian-does-a-u-turn-on-controversial-pentagon-press-rules-20251017-p5n38t.html",
    "timestamp": "2025-10-17T01:38:54Z"
  },
  {
    "title": "Texts, Trump, and More: 4 Key Takeaways from Virginia’s Attorney General Debate",
    "description": "Virginia’s Republican Attorney General Jason Miyares kicked off the Thursday debate referencing text messages in which his Democrat opponent Jay Jones wished death on a... Read More\nThe post Texts, Trump, and More: 4 Key Takeaways from Virginia’s Attorney Gen…",
    "link": "https://www.dailysignal.com/2025/10/16/texts-trump-and-more-4-key-takeaways-from-virginias-attorney-general-debate/",
    "timestamp": "2025-10-17T01:38:49Z"
  },
  {
    "title": "Trump rages at Senate Republican over 'old and ridiculous' practice: 'What a shame!'",
    "description": "President Donald Trump raged at Sen. Chuck Grassley (R-IA) on Thursday night over what the president described as an \"old and ridiculous custom\" that is preventing him from confirming more U.S. attorneys. \"I have eight GREAT U.S. Attorneys, Highly Respected A…",
    "link": "https://www.rawstory.com/trump-2674207208/",
    "timestamp": "2025-10-17T01:36:26Z"
  },
  {
    "title": "Trump’s claims on India’s oil imports from Russia underline Delhi’s challenge",
    "description": "It must reiterate red lines, while also moving ahead",
    "link": "https://indianexpress.com/article/opinion/editorials/trump-claims-india-oil-imports-russia-delhi-challenge-10311360/",
    "timestamp": "2025-10-17T01:34:46Z"
  },
  {
    "title": "China has found Trump's pain point - rare earths",
    "description": "China holds a near-monopoly in the processing of the elements crucial for making everything from smartphones to fighter jets.",
    "link": "https://www.bbc.com/news/articles/ckg1jr18z4ko?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-17T01:32:48Z"
  },
  {
    "title": "Deaths in Gaza continue despite cease-fire, IDF fire kills dozens since Friday",
    "description": "At least 38 Palestinians have been killed by Israeli fire since last Friday's U.S.-brokered cease-fire, while clashes between Hamas and local militias escalate amid widespread destruction and a mounting humanitarian crisis",
    "link": "https://www.haaretz.com/middle-east-news/2025-10-17/ty-article/.premium/deaths-in-gaza-continue-despite-cease-fire-idf-fire-kills-dozens-since-friday/00000199-edc7-d705-a5bb-fdcfcdce0000",
    "timestamp": "2025-10-17T01:29:34Z"
  },
  {
    "title": "Ace Frehley, Kiss' original lead guitarist and founding member, dies at 74",
    "description": "Frehley died peacefully surrounded by family in Morristown, New Jersey, following a recent fall, according to his agent.",
    "link": "https://cnalifestyle.channelnewsasia.com/entertainment/ace-frehley-kiss-original-member-dead-472731",
    "timestamp": "2025-10-17T01:28:25Z"
  },
  {
    "title": "Trump Plans To Meet Putin Within Two Weeks As Russia-Ukraine War Intensifies",
    "description": "US President Donald Trump said on Thursday he plans to meet Russian President Vladimir Putin in the Hungarian capital Budapest in the coming two weeks. \"I'll be meeting him probably over the next two weeks,\" Trump told reporters in the Oval Office, adding tha…",
    "link": "https://www.ndtvprofit.com/world/trump-plans-to-meet-putin-within-two-weeks-as-russia-ukraine-war-intensifies",
    "timestamp": "2025-10-17T01:27:49Z"
  },
  {
    "title": "Trump’s Middle East breakthrough may prove fragile",
    "description": "Hamas is unlikely to give up its weapons. Its existence is predicated on armed resistance to the Jewish state and disarmed it will be prey to its enemies among the Palestinians.",
    "link": "https://www.japantimes.co.jp/editorials/2025/10/17/trumps-fragile-middle-east-breakthrough/",
    "timestamp": "2025-10-17T01:26:00Z"
  },
  {
    "title": "India refiners to trim Russia oil buying as Trump sows confusion",
    "description": "India has flip-flopped between defying the U.S. and crimping Russian imports in response to pressure from Washington to cut back.",
    "link": "https://www.japantimes.co.jp/business/2025/10/17/india-refiners-russia-trump/",
    "timestamp": "2025-10-17T01:26:00Z"
  },
  {
    "title": "North Carolina GOP's Proposed Map Seeks To Thwart Democratic Incumbent's Reelection",
    "description": "Republican leaders in North Carolina have proposed a new U.S. House district map that could thwart the reelection prospects of a Democratic incumbent in the state's only swing seat.",
    "link": "https://www.huffpost.com/entry/election-2026-redistricting-north-carolina-don-davis_n_68f198b5e4b0ab08d3199f71",
    "timestamp": "2025-10-17T01:22:39Z"
  },
  {
    "title": "In a first, U.S. strike in Caribbean leaves survivors",
    "description": "The U.S. military carried out a new strike on Thursday against a suspected drug vessel in the Caribbean, and in what is believed to be the first such case, there were survivors among the crew, a U.S. official told Reuters. The official, who spoke on condition…",
    "link": "https://japantoday.com/category/world/exclusive-in-a-first-us-strike-in-caribbean-leaves-survivors-us-official-says",
    "timestamp": "2025-10-17T01:19:45Z"
  },
  {
    "title": "National Guard not welcome: NYC mayoral candidates come out strong against troop deployments",
    "description": "President Donald Trump’s deployment of National Guard troops to major American cities loomed large over Thursday night’s New York City mayoral debate.",
    "link": "https://www.foxnews.com/politics/national-guard-not-welcome-nyc-mayoral-candidates-come-out-strong-against-troop-deployments",
    "timestamp": "2025-10-17T01:16:09Z"
  },
  {
    "title": "California green lights carbon capture pipelines",
    "description": "Gov. Gavin Newsom signed a bill that lifts a ban on carbon pipelines and directs the State Fire Marshal to develop safety standards.",
    "link": "https://www.kpbs.org/news/environment/2025/10/16/california-green-lights-carbon-capture-pipelines",
    "timestamp": "2025-10-17T01:15:18Z"
  },
  {
    "title": "Trump Critic John Bolton Indicted For Mishandling Classified Info",
    "description": "John Bolton, Donald Trump's former national security advisor, was indicted on Thursday -- the third foe of the US president to be hit with criminal charges in recent weeks.",
    "link": "https://www.ibtimes.com.au/trump-critic-john-bolton-indicted-mishandling-classified-info-1860884",
    "timestamp": "2025-10-17T01:12:05Z"
  },
  {
    "title": "Zohran Mamdani Has Pushed the Liberal Consensus on Palestine. The Left Isn’t Satisfied.",
    "description": "The debate over Mamdani's candidacy highlights the ongoing identity crisis within the Democratic Party as voters turn against Israel over its genocide.\nThe post Zohran Mamdani Has Pushed the Liberal Consensus on Palestine. The Left Isn’t Satisfied. appeared f…",
    "link": "https://theintercept.com/2025/10/16/zohran-mamdani-palestine-israel-nyc-mayor-debate/",
    "timestamp": "2025-10-17T01:11:52Z"
  },
  {
    "title": "Zohran Mamdani and Andrew Cuomo clash over policy and handling Trump in a fiery NYC mayoral debate",
    "description": "Andrew Cuomo and Zohran Mamdani both opened Thursday’s New York City mayoral debate by saying a future headline about their first year in office would celebrate lowering costs for New Yorkers.",
    "link": "https://www.nbcnews.com/politics/elections/zohran-mamdani-andrew-cuomo-clash-policy-handling-trump-fiery-nyc-mayo-rcna237800",
    "timestamp": "2025-10-17T01:10:00Z"
  },
  {
    "title": "US strike on suspected Venezuelan drug boat 'extrajudicial executions'",
    "description": "A US strike against a suspected Venezuelan drug-smuggling vessel has left multiple survivors, as Venezuela's ambassador to the United Nations condemned the strikes as a \"series of assassinations\".",
    "link": "https://www.abc.net.au/news/2025-10-17/new-usa-strike-on-venezuelan-drugs-boat-leaves-survivors/105903128",
    "timestamp": "2025-10-17T01:09:15Z"
  },
  {
    "title": "Norwegian Nobel Socialists Snub Trump, Give Prize to Eco-Extremist Economist",
    "description": "The Associated Press recently dug up some “experts” to diss President Donald Trump as being too nasty for the Nobel Peace Prize, since he -- gasp -- \"does not believe in climate change.\" But one of the recipients of the elitist honors in the Nobel Economics P…",
    "link": "https://freerepublic.com/focus/f-bloggers/4346857/posts",
    "timestamp": "2025-10-17T01:04:47Z"
  },
  {
    "title": "Oil set for weekly loss as Trump-Putin summit looms",
    "description": "(Reuters) -Oil prices edged lower in early trade on Friday, heading for a weekly loss, with uncertainty over global energy supplies after U. President Donald...",
    "link": "https://finance.yahoo.com/news/oil-set-weekly-loss-trump-010150935.html",
    "timestamp": "2025-10-17T01:01:50Z"
  },
  {
    "title": "Tech CEO shares how he was an early supporter of Trump running for president before his 2016 campaign",
    "description": "Palmer Luckey reveals on Joe Rogan's show he supported Donald Trump since 2009, praising the former president's consistent stance against foreign wars.",
    "link": "https://www.foxnews.com/media/tech-ceo-shares-how-he-early-supporter-trump-running-president-before-his-2016-campaign",
    "timestamp": "2025-10-17T01:00:50Z"
  },
  {
    "title": "FBI Director Kash Patel announces terrorism charges for Texas ICE shooting",
    "description": "The charges follow an order from President Donald Trump labelling antifa as a 'domestic terrorist organisation'.",
    "link": "https://www.aljazeera.com/news/2025/10/17/fbi-director-kash-patel-announces-terrorism-charges-for-texas-ice-shooting",
    "timestamp": "2025-10-17T01:00:25Z"
  },
  {
    "title": "Oil set for weekly loss as Trump-Putin summit looms",
    "description": "(Reuters) -Oil prices edged lower in early trade on Friday, heading for a weekly loss, with uncertainty over global energy supplies after U. President Donald...",
    "link": "https://finance.yahoo.com/news/oil-set-weekly-loss-trump-005937352.html",
    "timestamp": "2025-10-17T00:59:37Z"
  },
  {
    "title": "H-1B Visa Holders Disappear from US Housing Market",
    "description": "Article URL: https://www.newsweek.com/h-1b-visa-holders-disappear-from-us-housing-market-10882216\nComments URL: https://news.ycombinator.com/item?id=45612359\nPoints: 20\n# Comments: 7",
    "link": "https://www.newsweek.com/h-1b-visa-holders-disappear-from-us-housing-market-10882216",
    "timestamp": "2025-10-17T00:58:20Z"
  },
  {
    "title": "Soybeans and Cooking Oil Take Center Stage in China Trade Dispute",
    "description": "President Donald Trump on Tuesday threatened to block imports of Chinese cooking oil in retaliation for China’s apparent blockade of soybeans from the United States.\nThe post Soybeans and Cooking Oil Take Center Stage in China Trade Dispute appeared first on …",
    "link": "https://www.breitbart.com/economy/2025/10/16/soybeans-cooking-oil-take-center-stage-china-trade-dispute/",
    "timestamp": "2025-10-17T00:57:06Z"
  },
  {
    "title": "Will meet Putin in Budapest, says Trump after 'productive' call",
    "description": "US President Donald Trump said he would meet Russia's Vladimir Putin in Hungary after a \"very productive\" call Thursday, and questioned Kyiv's push for Tomahawk missiles just a day before hosting Ukraine's leader at the White House. Ukraine's President Volody…",
    "link": "https://economictimes.indiatimes.com/news/defence/will-meet-putin-in-budapest-says-trump-after-productive-call/articleshow/124618001.cms",
    "timestamp": "2025-10-17T00:53:52Z"
  },
  {
    "title": "Jay Jones invokes Trump nearly 50 times during Virginia AG debate, ties Miyares to ‘MAGA’",
    "description": "Democratic candidate Jay Jones focused heavily on attacking Donald Trump rather than Republican opponent Jason Miyares during the Virginia attorney general debate on Thursday.",
    "link": "https://www.foxnews.com/politics/jay-jones-invokes-trump-nearly-50-times-during-virginia-ag-debate-ties-miyares-maga",
    "timestamp": "2025-10-17T00:53:21Z"
  },
  {
    "title": "Did the threat of Tomahawks for Ukraine force Putin into peace talks?",
    "description": "US President Donald Trump threatened Tomahawk missiles for Ukraine if Russia did not return to peace talks, but analysts say the long-range weapons are not the game-changer they are made out to be.",
    "link": "https://www.abc.net.au/news/2025-10-17/us-tomahawk-long-range-missiles-supply-ukraine-russia-talks/105884192",
    "timestamp": "2025-10-17T00:53:17Z"
  },
  {
    "title": "Asian shares dip after credit woes hit Wall Street",
    "description": "Asian shares declined Friday as US bank bad loans and credit market concerns dampened investor sentiment. Gold and silver hit record highs amid US economic fears and US-China tensions. The Bank of Japan signaled continued tightening, while the White House is …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-dip-after-credit-woes-hit-wall-street/articleshow/124617994.cms",
    "timestamp": "2025-10-17T00:52:53Z"
  },
  {
    "title": "'Trump Couldn't Have Been Friendlier': Jeffrey Epstein Abuse Accuser Virginia Giuffre Details the Moment She Met The Prez at His Office in Posthumous Memoir",
    "description": "Epstein's most famous accuser is set to spill all of his secrets from beyond the grave in her highly anticipated tell-all.",
    "link": "https://radaronline.com/p/donald-trump-jeffrey-epstein-abuse-accuser-virginia-giuffre-meeting-posthumous-memoir/",
    "timestamp": "2025-10-17T00:49:19Z"
  },
  {
    "title": "Oil Set for Weekly Drop With Focus on Supply, US-China Tensions",
    "description": "Oil headed for a third weekly decline as investors focused on oversupply and the fallout from renewed US-China trade tensions.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-set-for-weekly-drop-with-focus-on-supply-us-china-tensions",
    "timestamp": "2025-10-17T00:48:12Z"
  },
  {
    "title": "Trump critic John Bolton indicted for mishandling classified info",
    "description": "Former Trump advisor John Bolton faces criminal charges. He is indicted on 18 counts related to classified information. Trump called Bolton a \"bad guy.\" This follows charges against New York Attorney General Letitia James and ex-FBI director James Comey. Jame…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-critic-john-bolton-indicted-for-mishandling-classified-info/articleshow/124617977.cms",
    "timestamp": "2025-10-17T00:48:07Z"
  },
  {
    "title": "Appeals court keeps order blocking Trump from deploying National Guard in Illinois",
    "description": "Appeals court keeps order blocking Trump from deploying National Guard in Illinois.",
    "link": "https://abcnews.go.com/US/appeals-court-declines-lift-order-blocking-trump-deploying/story?id=126599445",
    "timestamp": "2025-10-17T00:44:32Z"
  },
  {
    "title": "Who is John Bolton? The former Trump national security adviser indicted over mishandling classified information",
    "description": "John Bolton, former national security adviser under Donald Trump, has been indicted on 18 counts for allegedly mishandling classified information. Prosecutors claim he stored top-secret files at home and shared sensitive diary-style notes with relatives, some…",
    "link": "https://timesofindia.indiatimes.com/education/news/who-is-john-bolton-the-former-trump-national-security-adviser-indicted-over-mishandling-classified-information/articleshow/124617795.cms",
    "timestamp": "2025-10-17T00:43:08Z"
  },
  {
    "title": "The John Bolton indictment",
    "description": "Each case will be judged on its own merits, but this is part of a pattern of selective prosecution.President Donald Trump has embarked on a campaign of prosecuting political foes, from ex-FBI director James Comey to New York Attorney General Letitia James (D)…",
    "link": "https://freerepublic.com/focus/f-news/4346845/posts",
    "timestamp": "2025-10-17T00:42:39Z"
  },
  {
    "title": "Virginia AG candidates Jay Jones and Jason Miyares clash over violent rhetoric in feisty debate",
    "description": "Republican Attorney General Jason Miyares and former Democratic Del",
    "link": "https://abcnews.go.com/US/wireStory/virginia-ag-candidates-jay-jones-jason-miyares-clash-126600895",
    "timestamp": "2025-10-17T00:38:02Z"
  },
  {
    "title": "Trump says if Hamas keeps killing, there is ‘no choice but to go in’",
    "description": "Trump’s warning came after Hamas said it could not produce the bodies of additional hostages without special machinery, with Israel accusing the group of not trying hard enough.",
    "link": "https://www.japantimes.co.jp/news/2025/10/17/world/trump-hamas-reprisal-threat/",
    "timestamp": "2025-10-17T00:37:00Z"
  },
  {
    "title": "Watch Jay Jones Need Three Tries To Explain Why Voters Should Trust His Judgment",
    "description": "Jay Jones needed three tries during his debate against incumbent Republican Attorney General Jason Miyares to explain why Virginians should trust his judgment.",
    "link": "https://dailycaller.com/2025/10/16/jay-jones-three-tries-explain-voters-trust-judgement-virginia-debate-attorney-general/",
    "timestamp": "2025-10-17T00:34:32Z"
  },
  {
    "title": "India refutes Trump's claim on halting Russian oil purchase",
    "description": "India's Ministry of External Affairs has refuted US President Donald Trump's claim that Prime Minister Narendra Modi assured him of ending Russian oil purchases. The MEA stated no such telephonic conversation occurred, emphasizing India's consistent priority …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-refutes-trumps-claim-on-halting-russian-oil-purchase-nayara-energy/articleshow/124613897.cms",
    "timestamp": "2025-10-17T00:30:00Z"
  },
  {
    "title": "India, America, and the logic of engagement",
    "description": "Intricate ties. Trumpism will last long after Trump exits. It is in India’s interests to recognise this and engage with the US in calibrated manner",
    "link": "https://www.thehindubusinessline.com/opinion/india-america-and-the-logic-of-engagement/article70171890.ece",
    "timestamp": "2025-10-17T00:30:00Z"
  },
  {
    "title": "It Sure Looks Like Trump Is About to Weaponize the IRS",
    "description": "In an exclusive story on Wednesday, the Wall Street Journal reported on the Trump administration’s plans to weaponize the IRS, much as he has weaponized the Department of Justice, against his perceived enemies. “Sweeping changes” are planned, the Journal repo…",
    "link": "https://www.motherjones.com/politics/2025/10/wall-street-journal-irs-trump-audits-criminal-investigations-liberal-democrat-groups-weaponization/",
    "timestamp": "2025-10-17T00:28:49Z"
  },
  {
    "title": "In surprise move, head of US military for Latin America to step down",
    "description": "WASHINGTON: The admiral who leads US military forces in Latin America will step down at the end of this year, two years ahead of schedule, Defense Secretary Pete Hegseth announced on Thursday (Oct 17), in a surprise move amid escalating tensions with Venezuel…",
    "link": "https://www.channelnewsasia.com/world/in-surprise-move-head-us-military-latin-america-step-down-5407621",
    "timestamp": "2025-10-17T00:28:46Z"
  },
  {
    "title": "Labor unions sue US over monitoring social media of visa holders",
    "description": "By Simon Lewis WASHINGTON (Reuters) -Labor unions filed a lawsuit against the U.S. government on Thursday, alleging that the Trump administration violated...",
    "link": "https://www.yahoo.com/news/articles/labor-unions-sue-us-over-002808511.html",
    "timestamp": "2025-10-17T00:28:08Z"
  },
  {
    "title": "Trump says he may 'go watch' as Supreme Court weighs his power to impose sweeping tariffs",
    "description": "The Supreme Court is slated to hear oral arguments in the tariffs case on Nov. 5.U.S. President Donald Trump said Wednesday he may attend the Supreme Court's oral arguments in a major case where justices will consider whether he has the unilateral power to im…",
    "link": "https://freerepublic.com/focus/f-news/4346840/posts",
    "timestamp": "2025-10-17T00:27:33Z"
  },
  {
    "title": "Dem AG candidate Jay Jones' grilled over reckless driving conviction by GOP opponent",
    "description": "Virginia Attorney General hopeful Jay Jones faced debate scrutiny as GOP rival Jason Miyares grilled him over a reckless driving case and past violent rhetoric about a Republican rival.",
    "link": "https://www.foxnews.com/politics/dem-ag-candidate-jay-jones-grilled-over-reckless-driving-conviction-gop-opponent",
    "timestamp": "2025-10-17T00:26:59Z"
  },
  {
    "title": "Louisiana judge orders review of Gulf Coast liquefied natural gas facility's climate change impacts",
    "description": "A Louisiana judge has tossed out a key permit for a liquefied natural gas facility that won approval from President Donald Trump’s administration",
    "link": "https://abcnews.go.com/Business/wireStory/louisiana-judge-orders-review-gulf-coast-liquefied-natural-126599572",
    "timestamp": "2025-10-17T00:22:05Z"
  },
  {
    "title": "Trump to meet Putin in Budapest to discuss war in Ukraine",
    "description": "Trump expressed optimism that the meeting, set to be in Budapest, could result in a ceasefire breakthrough even though an August meeting in Alaska failed to yield one.",
    "link": "https://www.japantimes.co.jp/news/2025/10/17/world/politics/trump-putin-budapest/",
    "timestamp": "2025-10-17T00:22:00Z"
  },
  {
    "title": "Comedian Details How RFK Jr. Caused Her To End Close Friendship With Cheryl Hines",
    "description": "Comedian Details How RFK Jr. Caused Her To End Close Friendship With Cheryl Hineshuffpost.com",
    "link": "https://www.huffpost.com/entry/tig-notaro-rfk-jr-end-friendship-cheryl-hines_n_68f14d0fe4b061265b2c2bbb",
    "timestamp": "2025-10-17T00:21:14Z"
  },
  {
    "title": "Former Trump aide John Bolton indicted over handling of classified material (Washington Post)",
    "description": "Washington Post:\nFormer Trump aide John Bolton indicted over handling of classified material  —  Bolton is the third longtime target of President Donald Trump to be federally charged in a month.  —  just now  —  John Bolton, a former national security adviser…",
    "link": "https://www.memeorandum.com/251016/p159",
    "timestamp": "2025-10-17T00:20:00Z"
  },
  {
    "title": "SOUTHCOM Commander Steps Down",
    "description": "Admiral Alvin Holsey, who has been SOUTHCOM commander for only a year, will retire at the end of the year. SOUTHCOM is the command under which those boats are being blown out of the water. Defense Secretary Pete Hegseth, in his impeccable professional manner,…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/southcom-commander-steps-down",
    "timestamp": "2025-10-17T00:16:10Z"
  },
  {
    "title": "Virginia attorney general debate centers on Jay Jones' violent texts",
    "description": "Republican Jason Miyares and Democrat Jay Jones faced off in a contentious debate for Virginia attorney general Thursday that focused in large part on the recently surfaced violent texts that Jones sent three years earlier",
    "link": "https://www.nbcnews.com/politics/elections/virginia-attorney-general-debate-jay-jones-violent-texts-rcna237543",
    "timestamp": "2025-10-17T00:14:41Z"
  },
  {
    "title": "Jones and Miyares clash over murder texts as Dem repeatedly invokes Trump at heated, high-stakes debate",
    "description": "Democratic nominee Jay Jones repeatedly invokes Trump while defending murder texts as Republican Jason Miyares questions his qualifications for attorney general.",
    "link": "https://www.foxnews.com/politics/jones-miyares-clash-over-murder-texts-dem-repeatedly-invokes-trump-heated-high-stakes-debate",
    "timestamp": "2025-10-17T00:12:09Z"
  },
  {
    "title": "John Bolton, former Trump adviser, charged with sharing classified information (Reuters)",
    "description": "Reuters:\nJohn Bolton, former Trump adviser, charged with sharing classified information  — Trump's former adviser has criticized Republican president  — Two other Trump foes indicted in recent weeks  —  John Bolton, President Donald Trump's former national se…",
    "link": "https://www.memeorandum.com/251016/p157",
    "timestamp": "2025-10-17T00:10:00Z"
  },
  {
    "title": "NYC mayoral candidates on working with Trump while in office",
    "description": "During the New York City mayoral debate, candidates Zohran Mamdani, Andrew Cuomo and Curtis Sliwa detailed what they would say on their first phone call to President Donald Trump.",
    "link": "https://biztoc.com/x/74a95972fa659b44",
    "timestamp": "2025-10-17T00:07:41Z"
  },
  {
    "title": "Trump Administration Negotiates Most Favored Nations Deal to Drastically Reduce IVF Drug Prices",
    "description": "President Donald Trump and his administration have negotiated a deal with EMD Serono, a leading fertility drug manufacturer, to radically reduce the cost of in vitro fertilization drug prices.\nThe post Trump Administration Negotiates Most Favored Nations Deal…",
    "link": "https://www.breitbart.com/politics/2025/10/16/trump-administration-negotiates-most-favored-nations-deal-to-drastically-reduce-ivf-drug-prices/",
    "timestamp": "2025-10-17T00:03:57Z"
  },
  {
    "title": "MSNBC’s Nicolle Wallace Voices Concern Over John Bolton Indictment: ‘Where Are We Heading?’ | Video",
    "description": "\"We're talking about the treatment of critics through the prism of the rule of law,\" the political commentator adds\nThe post MSNBC’s Nicolle Wallace Voices Concern Over John Bolton Indictment: ‘Where Are We Heading?’ | Video  appeared first on TheWrap.",
    "link": "https://www.thewrap.com/msnbc-nicolle-wallace-reacts-john-bolton-indictment/",
    "timestamp": "2025-10-17T00:03:20Z"
  },
  {
    "title": "Bernie Sanders Raises Eyebrows By Calling Marjorie Taylor Greene A ‘Good’ Republican",
    "description": "Republicans are “doing less of representing their districts” and more of “just swearing allegiance” to President Donald Trump, Sanders warned.",
    "link": "https://www.huffpost.com/entry/senator-bernie-sanders-marjorie-taylor-greene-good-republican_n_68f10ee4e4b0ab08d3192285",
    "timestamp": "2025-10-17T00:01:39Z"
  },
  {
    "title": "President Trump Goes to War!",
    "description": "“My proudest legacy will be that of a peacemaker,” U.S. President Donald Trump said in his inaugural address. He promised to “measure our success… most importantly [by] the wars we never get into.” Trump has proudly boasted that  he is “the first President in…",
    "link": "https://original.antiwar.com/ted_snider/2025/10/16/president-trump-goes-to-war/",
    "timestamp": "2025-10-17T00:00:20Z"
  },
  {
    "title": "The Trump Administration’s Military Occupation of America",
    "description": "Reprinted from TomDispatch: Earlier this month, President Donald Trump threatened to unleash the armed forces on more American cities during a rambling address to top military brass. He told the hundreds of generals and admirals gathered to hear him that some…",
    "link": "https://original.antiwar.com/nick_turse/2025/10/16/the-trump-administrations-military-occupation-of-america/",
    "timestamp": "2025-10-17T00:00:18Z"
  }
]