[
  {
    "title": "'This sounds like a threat': Dem gets DOJ letter after 'bar fight' analogy about Musk",
    "description": "Rep. Robert Garcia (D-CA) posted a letter he received from U.S. Attorney Edward Martin on Department of Justice letterhead asking about his attacks on Elon Musk. \"As a United States Attorney for the District of Columbia, I receive requests for information and…",
    "link": "https://www.rawstory.com/trump-justice-department-2671190340/",
    "timestamp": "2025-02-20T20:48:31Z"
  },
  {
    "title": "Trump’s War on Workers",
    "description": "But hey, at least Sean O’Brien gets to hate trans folk and immigrants! In his first few weeks back in office, Trump fired the acting chair of the National Labor Relations Board (NLRB), leaving the US’s top labor watchdog without a quorum to enforce laws that …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/trumps-war-on-workers",
    "timestamp": "2025-02-20T20:47:00Z"
  },
  {
    "title": "Jeremy Roenick Thinks USA-Canada Will Be Most Watched Hockey Game In 20 Yrs",
    "description": "Jeremy Roenick is so pumped for the USA vs. Canada 4 Nations championship game, he can barely contain himself ... just hours before the nations face off in what the NHL legend predicts will be the most-watched game in decades! \"I am so pumped up,\"…\n Permalink",
    "link": "https://www.tmz.com/2025/02/20/jeremy-roenick-usa-canada-hockey-four-nations/",
    "timestamp": "2025-02-20T20:45:45Z"
  },
  {
    "title": "Hyundai, Kia Plan to Boost American Auto Production to Avoid Trump Tariffs",
    "description": "Hyundai Motor Company and Kia aim to boost American automobile production to avoid President Donald Trump's planned 25 percent auto tariff, according to a report.\nThe post Hyundai, Kia Plan to Boost American Auto Production to Avoid Trump Tariffs appeared fir…",
    "link": "https://www.breitbart.com/politics/2025/02/20/hyundai-kia-plan-to-boost-american-auto-production-to-avoid-trump-tariffs/",
    "timestamp": "2025-02-20T20:45:18Z"
  },
  {
    "title": "JOSEPH PITTS: Democrats Continue Blowing Smoke About Nicotine Products",
    "description": "Nicotine is having a bit of a moment on the American right.",
    "link": "https://dailycaller.com/2025/02/20/opinion-democrats-nicotine-products-joseph-pitts/",
    "timestamp": "2025-02-20T20:45:08Z"
  },
  {
    "title": "Ukraine seeks to soothe Trump spat with call for ‘strong, effective’ deal on US ties",
    "description": "Russia backs White House criticism of Kyiv as European leaders support Zelenskiy",
    "link": "https://www.irishtimes.com/world/europe/2025/02/20/ukraine-seeks-to-soothe-trump-spat-with-call-for-strong-effective-deal-on-us-ties/",
    "timestamp": "2025-02-20T20:45:00Z"
  },
  {
    "title": "At CPAC, Vance talks faith, says policies should help ‘choose life’ and ‘start families’",
    "description": "U.S. Vice President JD Vance speaks with Mercedes Schlapp at the 2025 Conservative Action Political Conference on Feb. 20, 2025, in National Harbor, Maryland. / Credit: Courtesy of Conservative Action Political Conference/YouTube screenshot\n\nWashington, D.C. …",
    "link": "https://www.catholicnewsagency.com/news/262327/at-cpac-vance-talks-faith-says-policies-should-help-choose-life-and-start-families",
    "timestamp": "2025-02-20T20:45:00Z"
  },
  {
    "title": "Trump Vows to ‘Make Sure’ Gold Is at Fort Knox",
    "description": "\"President Donald Trump promised to investigate Fort Knox in Kentucky after Elon Musk made calls to audit gold at the military base,\" USA Today reports. Said Trump: \"We're going to go to Fort Knox, the",
    "link": "https://politicalwire.com/2025/02/20/trump-vows-to-make-sure-gold-is-at-fort-knox/",
    "timestamp": "2025-02-20T20:44:58Z"
  },
  {
    "title": "End of an era? Europe's shaky security strategy for Ukraine",
    "description": "Sidelined from talks on finding an end to the war in Ukraine, the European Union is scrambling to find a security strategy that is independent from an increasingly disengaged US.",
    "link": "https://www.dw.com/en/end-of-an-era-europes-shaky-security-strategy-for-ukraine/a-71692712",
    "timestamp": "2025-02-20T20:42:00Z"
  },
  {
    "title": "NBC Reporter Confronts Trump Aide Over Claims Of ‘Fraud’ and ‘Theft’ On Way Out of Briefing",
    "description": "A hot mic caught NBC's Peter Alexander putting Trump aide Stephen Miller on the spot over claims of \"theft\" and fraud that were made at the briefing.\nThe post NBC Reporter Confronts Trump Aide Over Claims Of ‘Fraud’ and ‘Theft’ On Way Out of Briefing first ap…",
    "link": "https://www.mediaite.com/news/hot-mic-catches-nbc-reporter-confronting-trump-aide-over-claims-of-fraud-and-theft-at-briefing/",
    "timestamp": "2025-02-20T20:40:00Z"
  },
  {
    "title": "Ros Atkins on... the fight for Ukraine's critical minerals",
    "description": "The BBC's Analysis Editor Ros Atkins looks at why the US wants access to Ukraine's minerals.",
    "link": "https://www.bbc.com/news/videos/czx7d0e70dxo",
    "timestamp": "2025-02-20T20:39:20Z"
  },
  {
    "title": "Oath Keepers' ex-leader convicted of sedition now wants to work for FBI",
    "description": "NATIONAL HARBOR, MD — Elmer Stewart Rhodes III, the founder and former leader of the Oath Keepers, told reporters at CPAC Thursday that he would enjoy working for the FBI or for Director of National Intelligence Tulsi Gabbard. Rhodes, who was sentenced to 18 …",
    "link": "https://www.rawstory.com/stewart-rhodes-2671190081/",
    "timestamp": "2025-02-20T20:38:47Z"
  },
  {
    "title": "Trump administration cuts duration of deportation protections for 521,000 Haitians",
    "description": "WASHINGTON -U.S. Homeland Security Secretary Kristi Noem on Thursday cut the duration of deportation protections and work permits for 521,000 Haitians covered by the Temporary Protected Status program so that they will expire in August, a Department of Homela…",
    "link": "https://www.thestar.com.my/news/world/2025/02/21/trump-administration-cuts-duration-of-haitian-deportation-protections-to-august",
    "timestamp": "2025-02-20T20:37:00Z"
  },
  {
    "title": "India and Israel can learn from each other’s experiences with ‘difficult neighbors'",
    "description": "The members of the Sharaka delegation expressed sympathy for Israel’s struggle for security and highlighted the extensive military cooperation between the two countries.",
    "link": "https://www.jpost.com/israel-news/article-843098",
    "timestamp": "2025-02-20T20:34:39Z"
  },
  {
    "title": "Circuit Court Rejects Trump Appeal of Block on Birthright Citizenship Order",
    "description": "The next step for Trump could be appealing the decision to the United States Supreme Court.",
    "link": "https://truthout.org/articles/circuit-court-rejects-trump-appeal-of-block-on-birthright-citizenship-order/",
    "timestamp": "2025-02-20T20:34:04Z"
  },
  {
    "title": "Exclusive — American Asks Trump to Help After His Business Seized by Vladimir Putin: ‘My Company Is Being Destroyed’",
    "description": "Leonid Smirnov, an American business leader whose company Glavproduct was seized by the Kremlin, is asking President Donald Trump to intervene.\nThe post Exclusive — American Asks Trump to Help After His Business Seized by Vladimir Putin: ‘My Company Is Being …",
    "link": "https://www.breitbart.com/politics/2025/02/20/exclusive-american-asks-trump-help-his-business-seized-vladimir-putin-my-company-is-being-destroyed/",
    "timestamp": "2025-02-20T20:34:02Z"
  },
  {
    "title": "Two days after laying off US-based developers, NetEase says Marvel Rivals has surpassed 40 million players",
    "description": "Marvel Rivals continues to do big numbers, which probably comes as cold comfort to former employees of NetEase's Seattle studio.",
    "link": "https://www.pcgamer.com/games/third-person-shooter/two-days-after-laying-off-us-based-developers-netease-says-marvel-rivals-has-surpassed-40-million-players/",
    "timestamp": "2025-02-20T20:32:09Z"
  },
  {
    "title": "Conservative Media Should Tell the Unvarnished Truth About Donald Trump’s Ghastly Attacks on Ukraine",
    "description": "Conservative journalists have an obligation to tell the unvarnished truth about what is happening and who is responsible for it.\nThe post Conservative Media Should Tell the Unvarnished Truth About Donald Trump’s Ghastly Attacks on Ukraine first appeared on Me…",
    "link": "https://www.mediaite.com/opinion/conservative-media-should-tell-the-unvarnished-truth-about-donald-trumps-ghastly-attacks-on-ukraine/",
    "timestamp": "2025-02-20T20:31:42Z"
  },
  {
    "title": "Gov. Hochul won't remove NYC Mayor Adams from office, sources say",
    "description": "Gov. Kathy Hochul and Mayor Eric Adams at City Hall in December 2024.\n \n\nHochul will instead unveil a new plan that would expand Albany’s oversight of the mayor’s office. [ more › ]",
    "link": "https://gothamist.com/news/gov-hochul-wont-remove-nyc-mayor-adams-from-office-for-now-source-says",
    "timestamp": "2025-02-20T20:31:00Z"
  },
  {
    "title": "Will Elon Musk Back Cardano In US Crypto Adoption? Hoskinson Thinks So",
    "description": "In a recent livestream, Cardano founder Charles Hoskinson sparked significant speculation regarding whether the US government could adopt Cardano under the guidance of Elon Musk—now heading the newly formed Department of Government Efficiency (DOGE). Though n…",
    "link": "https://bitcoinist.com/will-elon-musk-back-cardano-hoskinson-thinks-so/",
    "timestamp": "2025-02-20T20:30:37Z"
  },
  {
    "title": "New arrivals at Guantanamo Bay are Venezuelan immigrants with final deportation orders",
    "description": "U.S. immigration and military authorities say they are holding exclusively Venezuelan immigrants subject to final deportation orders at the U.S. naval station at Guantanamo Bay, Cuba",
    "link": "https://abcnews.go.com/US/wireStory/new-arrivals-guantanamo-bay-venezuelan-immigrants-final-deportation-119017286",
    "timestamp": "2025-02-20T20:30:15Z"
  },
  {
    "title": "New election official picked in Arizona county where leaders embraced conspiracy theories",
    "description": "A Republican who worked previously in law enforcement and as a staff member at the Arizona Legislature has been appointed to replace an election official who resigned in a southern Arizona county where some leaders embraced voting conspiracy theories",
    "link": "https://abcnews.go.com/US/wireStory/new-election-official-picked-arizona-county-leaders-embraced-119017194",
    "timestamp": "2025-02-20T20:29:58Z"
  },
  {
    "title": "Elon Musk makes surprise appearance at CPAC",
    "description": "Elon Musk is set to deliver his debut speech at the Conservative Political Action Conference (CPAC) on Thursday afternoon.",
    "link": "https://www.foxnews.com/politics/elon-musk-makes-surprise-appearance-cpac",
    "timestamp": "2025-02-20T20:29:26Z"
  },
  {
    "title": "CDC vaccination committee meeting postponed days after RFK Jr. took over at HHS",
    "description": "A panel of experts that advises the Centers for Disease Control and Prevention on vaccine policy will not meet as previously scheduled next week. The Advisory Committee on Immunization Practices was supposed to meet in Atlanta from Feb. 26 to 28. It would hav…",
    "link": "https://www.seattlepi.com/news/article/cdc-vaccination-committee-meeting-postponed-days-20178049.php",
    "timestamp": "2025-02-20T20:29:18Z"
  },
  {
    "title": "Zelensky would lose if elections were held now – Economist",
    "description": "The media outlet says polls show former Commander-in-Chief Valery Zaluzhny winning with 65% of the vote Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/613081-zelensky-would-lose-election-ukraine/",
    "timestamp": "2025-02-20T20:28:57Z"
  },
  {
    "title": "Broadcast and Cable News Outlets Added to Letters in Support of the Associated Press",
    "description": "Donald Trump's administration has given the Associated Press the cold shoulder treatment in recent weeks. Reporters from the news organization have been barred from attending White House events and boarding Air Force 1 due to the AP refusing to recognize the …",
    "link": "https://www.adweek.com/tvnewser/broadcast-cable-news-outlets-support-associated-press/",
    "timestamp": "2025-02-20T20:27:07Z"
  },
  {
    "title": "Arab Leaders To Meet In Saudi Arabia Today To Counter Trump Gaza Plan",
    "description": "Arab leaders will meet in Saudi Arabia on Friday to counter President Donald Trump&#039;s plan for US control of Gaza and the expulsion of its people, diplomatic and government sources said.",
    "link": "https://www.ndtv.com/world-news/arab-leaders-to-meet-in-saudi-arabia-today-to-counter-trump-gaza-plan-7757845",
    "timestamp": "2025-02-20T20:26:53Z"
  },
  {
    "title": "‘Bring weapons’ congressman added to probe of violent rhetoric",
    "description": "Prosecutor already had announced plans to review Schumer's intimidation of Supreme Court justices",
    "link": "https://www.wnd.com/2025/02/bring-weapons-congressman-added-to-probe-of-violent-rhetoric/",
    "timestamp": "2025-02-20T20:26:13Z"
  },
  {
    "title": "Trump wants to abolish IRS after tariff revenues make ‘whole economy explode,’ new Commerce secretary Howard Lutnick reveals",
    "description": "Last month, President Donald Trump announced a new \"External Revenue Service\" that would be tasked with collecting revenue from tariffs, and potentially replace the IRS as America has been \"taxing ourselves.\"",
    "link": "https://nypost.com/2025/02/20/business/commerce-secretary-howard-lutnick-reveals-trumps-goal-to-abolish-the-irs-utilize-tariffs-so-whole-economy-explodes/",
    "timestamp": "2025-02-20T20:23:29Z"
  },
  {
    "title": "Trump Replaces White House Desk After Elon Musk's Son Picked Nose",
    "description": "Donald Trump is sitting behind a new desk.\nMore than one week after Elon Musk and Grimes’ son X Æ A-Xii Musk, 4, went viral for picking his nose by the Resolute Desk during a visit to the White...",
    "link": "https://www.eonline.com/news/1413713/donald-trump-replaces-desk-after-elon-musks-son-picks-nose-during-white-house-visit",
    "timestamp": "2025-02-20T20:23:00Z"
  },
  {
    "title": "Christian leaders set to unveil West Bank resolution at Dallas event",
    "description": "Christian leaders will unveil a resolution supporting Israeli sovereignty over the West Bank at an upcoming media convention, with over 3,000 pastoral signatures to be presented to President Trump.",
    "link": "https://www.jpost.com/christianworld/article-843095",
    "timestamp": "2025-02-20T20:22:55Z"
  },
  {
    "title": "Trump: Federal Government ‘Should Govern District of Columbia’",
    "description": "THE CENTER SQUARE—President Donald Trump voiced his support for repealing the District of Columbia’s Home Rule Act, citing crime, homelessness and “graffiti.” Trump relayed his... Read More\nThe post Trump: Federal Government ‘Should Govern District of Columbi…",
    "link": "https://www.dailysignal.com/2025/02/20/trump-federal-government-should-govern-district-of-columbia/",
    "timestamp": "2025-02-20T20:22:32Z"
  },
  {
    "title": "Senate GOP Not Backing Down From Budget Proposal Fearing Funds for Trump’s Border Security Agenda Could Run Dry",
    "description": "DAILY CALLER NEWS FOUNDATION—Senate Republicans are plowing ahead with their budget proposal despite President Donald Trump throwing his weight behind the House version, arguing their... Read More\nThe post Senate GOP Not Backing Down From Budget Proposal Fear…",
    "link": "https://www.dailysignal.com/2025/02/20/senate-gop-not-backing-down-from-budget-proposal-fearing-funds-trumps-border-security-agenda-could-run-dry/",
    "timestamp": "2025-02-20T20:21:38Z"
  },
  {
    "title": "When are we Europeans going to stop being scandalised about Donald Trump...",
    "description": "When are we Europeans going to stop being scandalised about Donald Trump and start helping him to end this war? Of course Ukraine didn’t start the war. You might as well say that America attacked Japan at Pearl Harbor. Of course a country undergoing a violent…",
    "link": "https://freerepublic.com/focus/f-bloggers/4299167/posts",
    "timestamp": "2025-02-20T20:21:01Z"
  },
  {
    "title": "Ukraine needs 'reliable' security guarantees, Zelenskyy tells Trump envoy amid row",
    "description": "Volodymyr Zelenskyy says he told Donald Trump's Ukraine envoy his country needs a \"reliable and clear system of security guarantees\" before a peace deal can be struck with Russia.",
    "link": "https://news.sky.com/story/ukraine-needs-reliable-and-clear-security-guarantees-to-end-war-zelenskyy-tells-trump-envoy-13313693",
    "timestamp": "2025-02-20T20:20:00Z"
  },
  {
    "title": "Oil Holds Above $72 Amid Supply Uncertainty",
    "description": "Oil prices extended modest gains above $72 as supply concerns, a weaker dollar, and refinery shifts influenced market sentiment, while trading remained rangebound amid investor caution.",
    "link": "https://www.rigzone.com/news/wire/oil_holds_above_72_amid_supply_uncertainty-20-feb-2025-179695-article/",
    "timestamp": "2025-02-20T20:19:34Z"
  },
  {
    "title": "The National Institute of Standards and Technology Braces for Mass Firings",
    "description": "Approximately 500 NIST staffers, including at least three lab directors, are expected to lose their jobs at the standards agency as part of the ongoing DOGE purge, sources tell WIRED.",
    "link": "https://www.wired.com/story/the-national-institute-of-standards-and-technology-braces-for-mass-firings/",
    "timestamp": "2025-02-20T20:19:27Z"
  },
  {
    "title": "Spurs star Victor Wembanyama ruled out for rest of NBA season due to deep vein thrombosis",
    "description": "San Antonio Spurs’ star Victor Wembanyama will miss the rest of the season due to deep vein thrombosis in his right shoulder. The 7’3” rookie was having a stellar season, but his absence leaves the Spurs in a difficult position. With playoff hopes dimming, th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/spurs-star-victor-wembanyama-ruled-out-for-rest-of-nba-season-due-to-deep-vein-thrombosis/articleshow/118429775.cms",
    "timestamp": "2025-02-20T20:16:28Z"
  },
  {
    "title": "Why Elon Musk is the wrong guy to boast about ‘full transparency’",
    "description": "Elon Musk boasted about the \"full transparency\" surrounding the DOGE operation. The closer one looks, the more misguided the claim appears.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/elon-musk-wrong-guy-boast-full-transparency-rcna193052",
    "timestamp": "2025-02-20T20:16:15Z"
  },
  {
    "title": "What Does Elon Musk's '14 Flags' Post Mean? The Controversial Meaning Of The 14 American Flag Emojis Explained",
    "description": "Elon Musk is going viral right now after posting 14 American flag Emojis in response to a Trump tweet, which some are calling a dog whistle. Here's why.",
    "link": "https://knowyourmeme.com/editorials/guides/what-does-elon-musks-14-flags-post-mean-theories-about-the-controversial-meaning-of-the-14-american-flag-emojis-explained",
    "timestamp": "2025-02-20T20:15:02Z"
  },
  {
    "title": "'Danger': Secret Service reportedly alarmed over 'lovestruck' Trump aide's 'obsession'",
    "description": "Secret Service agents have become concerned that one of Donald Trump's aides – known as the \"human printer\" – could become a “potential danger to herself as well as to the president,” according to a new book.Natalie Harp, a personal aide who follows the presi…",
    "link": "https://www.rawstory.com/natalie-harp-trump/",
    "timestamp": "2025-02-20T20:14:06Z"
  },
  {
    "title": "Op-Ed: Misreading the world — Trump parrots Russian propaganda about Ukraine",
    "description": "If the US enters a Depression scenario as a result of all these dollar-based neuroses, that’s likely to be fatal.\nThe post Op-Ed: Misreading the world — Trump parrots Russian propaganda about Ukraine appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/op-ed-misreading-the-world-trump-parrots-russian-propaganda-about-ukraine/article",
    "timestamp": "2025-02-20T20:14:02Z"
  },
  {
    "title": "US official demands Zelenskyy return to talks over critical minerals deal",
    "description": "White House national security adviser Mike Waltz also criticises Kyiv over 'insults' to US president.",
    "link": "https://www.aljazeera.com/news/2025/2/20/us-envoy-cancels-press-conference-with-ukraines-zelenskyy-after-kyiv-talks",
    "timestamp": "2025-02-20T20:13:59Z"
  },
  {
    "title": "Honduras to 'immediately' transfer Venezuelan migrants deported from US",
    "description": "(Reuters) - Some 170 Venezuelan migrants are set to arrive in the Central American nation of Honduras from the United States, the Honduran government said on Thursday, before being transported \"immediately\" back to Venezuela. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/21/honduras-to-039immediately039-transfer-venezuelan-migrants-deported-from-us",
    "timestamp": "2025-02-20T20:13:00Z"
  },
  {
    "title": "Senate confirms Kash Patel to lead FBI",
    "description": "Patel is now poised to lead an agency he has long criticized of being politically biased against Donald Trump",
    "link": "https://www.nextgov.com/people/2025/02/senate-confirms-kash-patel-lead-fbi/403156/",
    "timestamp": "2025-02-20T20:13:00Z"
  },
  {
    "title": "Trump’s Ukraine wake-up call: Points he’s now making are what Russia said all along",
    "description": "When a war is built on lies, making peace will hurt the liars Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613070-trump-arguments-russia-ukraine/",
    "timestamp": "2025-02-20T20:12:54Z"
  },
  {
    "title": "Mexico's Claudia Sheinbaum plans constitutional reforms as US labels drug cartels as terrorists",
    "description": "After the US designated Sinaloa Cartel and other Mexican drug cartels as global terrorist organisations, Mexico's President Claudia Sheinbaum on Thursday said she will propose constitutional reforms to protect national sovereignty. But she added that Mexican …",
    "link": "https://economictimes.indiatimes.com/news/international/us/mexicos-claudia-sheinbaum-plans-constitutional-reforms-as-us-labels-drug-cartels-as-terrorists/articleshow/118429732.cms",
    "timestamp": "2025-02-20T20:12:03Z"
  },
  {
    "title": "Breaking: Kash Patel Confirmed as FBI Director in Tight Senate Vote",
    "description": "The Senate confirmed Kash Patel to be FBI director Thursday in a 51-49 vote, with two Senate Republicans voting \"no.\"",
    "link": "https://www.westernjournal.com/breaking-kash-patel-confirmed-fbi-director-tight-senate-vote/",
    "timestamp": "2025-02-20T20:09:31Z"
  },
  {
    "title": "'You don't boo the U.S.': JD Vance jokes if Canada doesn't win 'tariffs are even higher'",
    "description": "Displeased with anthem booing at the teams' first meeting, U.S. President JD Vance is hoping Team USA will defeat Team Canada in a rematch.",
    "link": "https://nationalpost.com/sports/hockey/vance-team-usa-team-canada",
    "timestamp": "2025-02-20T20:09:30Z"
  },
  {
    "title": "What Trump's USAID freeze means for the rest of the world",
    "description": "There are fears millions of people could die from preventable diseases after Donald Trump signed an executive order halting billions of dollars worth of USAID.",
    "link": "https://www.abc.net.au/news/2025-02-21/what-trumps-usaid-freeze-means-for-developing-countries/104937326",
    "timestamp": "2025-02-20T20:09:20Z"
  },
  {
    "title": "CDC vaccination committee meeting postponed days after RFK Jr. took over at HHS",
    "description": "A panel of experts that advises the Centers for Disease Control and Prevention on vaccine policy will not meet as previously scheduled next week",
    "link": "https://abcnews.go.com/US/wireStory/cdc-vaccination-committee-meeting-postponed-days-after-rfk-119016356",
    "timestamp": "2025-02-20T20:06:28Z"
  },
  {
    "title": "In the Trump administration, nearly every major department is an immigration agency",
    "description": "Trump's sweeping promises have translated into a whole-of-government approach for immigration enforcement.",
    "link": "https://www.bostonherald.com/2025/02/20/trump-immigration-every-department/",
    "timestamp": "2025-02-20T20:06:18Z"
  },
  {
    "title": "Report: TikTok Begins Laying Off Members of Trust and Safety Team",
    "description": "TikTok CEO Shou Zi Chew said in testimony before Congress last January that the company would spend more than $2 billion on trust and safety efforts, but layoffs in those areas that reportedly began Thursday suggest a reversal of that strategy. Reuters report…",
    "link": "https://www.adweek.com/media/report-tiktok-begins-laying-off-members-of-trust-and-safety-team/",
    "timestamp": "2025-02-20T20:05:00Z"
  },
  {
    "title": "Revolving Door Round-Up: Adrienne Roark Moves From CBS News to Tegna",
    "description": "CBS News departure: Broadcast news executive Adrienne Roark has left CBS News for the local TV station group Tegna Inc., where she will be their chief content officer. At CBS News, Roark was president of editorial and newsgathering, a role she held since Augu…",
    "link": "https://www.adweek.com/tvnewser/revolving-door-round-up-adrienne-roark-cbs-news-to-tegna/",
    "timestamp": "2025-02-20T20:02:52Z"
  },
  {
    "title": "Donald Trump's NATO strategy change sparks concerns among European leaders",
    "description": "Concerns about NATO's stability have grown after Donald Trump’s change in approach. His decision to cut US support for Ukraine and repeat Russian talking points has made European leaders doubt Washington's commitment. With worries about a possible US military…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-nato-strategy-change-sparks-concerns-among-european-leaders/articleshow/118429626.cms",
    "timestamp": "2025-02-20T20:01:19Z"
  },
  {
    "title": "New York Gov. Hochul will not remove Mayor Eric Adams 'right now'",
    "description": "The DOJ is seeking to dismiss its criminal case against Adams, citing the need for his cooperation on Trump immigration enforcement policies.",
    "link": "https://www.cnbc.com/2025/02/20/new-york-gov-hochul-will-not-remove-mayor-eric-adams-right-now.html",
    "timestamp": "2025-02-20T19:59:08Z"
  },
  {
    "title": "Ukraine must strike minerals deal, says Trump adviser",
    "description": "The comments overshadowed Zelensky's meeting with US envoy Keith Kellogg in Kyiv.",
    "link": "https://www.bbc.com/news/articles/ceqjn74gdwzo",
    "timestamp": "2025-02-20T19:59:06Z"
  },
  {
    "title": "What is Humphrey's Executor? A look at the 90-year-old Supreme Court decision Trump is targeting",
    "description": "A month into President Donald Trump’s second term, lawyers for the Republican administration seem intent on provoking a legal fight to overturn a 90-year-old Supreme Court decision known as Humphrey’s Executor. The 1935 case has been critical to the developme…",
    "link": "https://www.seattlepi.com/business/article/what-is-humphrey-s-executor-a-look-at-the-20177655.php",
    "timestamp": "2025-02-20T19:56:52Z"
  },
  {
    "title": "Russia's Lavrov joins top European diplomats at a G20 meeting in South Africa. Rubio is skipping it",
    "description": "Russian Foreign Minister Sergey Lavrov is in South Africa for a two-day meeting of the Group of 20 nations, where top European diplomats are expected to reinforce their support for Ukraine. U.S. Secretary of State Marco Rubio is a high-profile absentee. Lavro…",
    "link": "https://www.seattlepi.com/news/world/article/g20-meeting-of-foreign-ministers-gets-underway-in-20176971.php",
    "timestamp": "2025-02-20T19:56:52Z"
  },
  {
    "title": "EU official meets with Trump counterparts to resolve tariff threats",
    "description": "A top European Union official, who is trying to head off a potential trade conflict, stressed the importance of active engagement and fairness in trade during a four-hour meeting with Trump administration officials on Wednesday. President Donald Trump has thr…",
    "link": "https://www.seattlepi.com/news/politics/article/eu-official-meets-with-trump-counterparts-to-20177646.php",
    "timestamp": "2025-02-20T19:56:52Z"
  },
  {
    "title": "Donald Trump Was Once a Pariah in Silicon Valley—Now He’s the Ultimate Disrupter",
    "description": "Trump has always been a wrecking ball, but now that he’s pummeling Big Tech’s perceived enemies, he’s become a hero to a previously liberal industry.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-silicon-valley-elon-musk",
    "timestamp": "2025-02-20T19:55:13Z"
  },
  {
    "title": "Kash Patel Confirmed to Lead FBI",
    "description": "Kashyap \"Kash\" Patel was confirmed to lead the Federal Bureau of Investigation (FBI) in a 51-49 Senate vote Thursday, despite Democrats' desperate attempts to block his nomination.\nThe post Kash Patel Confirmed to Lead FBI appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/20/kash-patel-confirmed-to-lead-fbi/",
    "timestamp": "2025-02-20T19:55:06Z"
  },
  {
    "title": "Trump broke Mitch McConnell.",
    "description": "Trump broke Mitch McConnell. He woke up today, announced he won’t be running for re-election, and then he voted YES to confirm Kash Patel! Good turtle",
    "link": "https://freerepublic.com/focus/f-news/4299158/posts",
    "timestamp": "2025-02-20T19:54:28Z"
  },
  {
    "title": "Any reduction in EU-US trade would result in job losses and higher global prices, Paschal Donohoe says",
    "description": "Donohoe claims US president’s comments have ‘consequences’, and he profoundly disagrees with Trump’s analysis of recent events in Europe",
    "link": "https://www.irishtimes.com/politics/2025/02/20/paschal-donohoe-says-any-reduction-in-eu-us-trade-would-result-in-job-losses-and-higher-global-prices/",
    "timestamp": "2025-02-20T19:52:05Z"
  },
  {
    "title": "McConnell, longest-serving US Senate leader, to retire in early 2027",
    "description": "U.S. Senator Mitch McConnell announced on Thursday, his 83rd birthday, that he will not seek reelection when his current term ends next year.\n\n\nFirst elected in 1984, McConnell made the announcement from the Senate floor.\n\n\n“Seven times, my fellow Kentuckians…",
    "link": "https://www.voanews.com/a/mcconnell-longest-serving-us-senator-to-retire-in-early-2027/7982278.html",
    "timestamp": "2025-02-20T19:51:04Z"
  },
  {
    "title": "Has Donald Trump replaced the iconic 145-year-old Resolute desk at the Oval office in White House? Here's the truth",
    "description": "President Donald Trump has temporarily replaced the iconic 145-year-old Resolute Desk in the Oval Office with the C&O Desk while the Resolute Desk undergoes light refinishing. This substitution marks a significant change, as the Resolute Desk has been a stapl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/has-donald-trump-replaced-the-iconic-145-year-old-resolute-desk-at-the-oval-office-in-white-house-heres-the-truth/articleshow/118429277.cms",
    "timestamp": "2025-02-20T19:50:58Z"
  },
  {
    "title": "A Texas ICE Officer Seems to Have a Completely Predictable Side-Gig: Running a White Supremacist Twitter",
    "description": "The account is a sewer, as you probably have guessed.",
    "link": "https://www.esquire.com/news-politics/politics/a63855452/texas-ice-prosecutor-white-supremacist-twitter/",
    "timestamp": "2025-02-20T19:50:00Z"
  },
  {
    "title": "Can the relationship between the US and Ukraine be saved?",
    "description": "Donald Trump launches tirade against Volodymyr Zelenskyy.",
    "link": "https://www.aljazeera.com/program/inside-story/2025/2/20/can-the-relationship-between-the-us-and-ukraine-be-saved",
    "timestamp": "2025-02-20T19:48:54Z"
  },
  {
    "title": "Trump considering buying used planes to serve as Air Force One amid Boeing delays",
    "description": "President Trump says he's considering buying used Boeing aircraft to use as Air Force One as he fumes over the U.S. plane-maker’s delays in producing two specially modified ones for presidential use.",
    "link": "https://www.pbs.org/newshour/politics/trump-considering-buying-used-planes-to-serve-as-air-force-one-amid-boeing-delays",
    "timestamp": "2025-02-20T19:48:44Z"
  },
  {
    "title": "Kash Patel, A Trump Loyalist, Confirmed As FBI Director",
    "description": "The Republican-controlled US Senate on Thursday confirmed Kash Patel, a staunch loyalist of President Donald Trump, to be director of the FBI, the country&#039;s top law enforcement agency.",
    "link": "https://www.ndtv.com/world-news/kash-patel-a-trump-loyalist-confirmed-as-fbi-director-7757722",
    "timestamp": "2025-02-20T19:48:27Z"
  },
  {
    "title": "DOGE uncovers 4 million gov’t credit cards linked to 90 million transactions",
    "description": "Defense Department leads the way with 27 million 'swipes' in 1 fiscal year",
    "link": "https://www.wnd.com/2025/02/doge-uncovers-4-million-govt-credit-cards-linked-to-90-million-transactions/",
    "timestamp": "2025-02-20T19:47:28Z"
  },
  {
    "title": "The Supreme Court must bring gavel down on activist judges hamstringing President Trump",
    "description": "President Trump campaigned on a platform of hiring Elon Musk, establishing DOGE, and shrinking the federal government by cutting waste, fraud, and abuse. The American people liked what they heard, and they gave Trump a broad electoral mandate. Trump is now do…",
    "link": "https://freerepublic.com/focus/f-news/4299155/posts",
    "timestamp": "2025-02-20T19:47:14Z"
  },
  {
    "title": "Senate Confirms Kash Patel As FBI Director",
    "description": "The Senate confirmed Kash Patel as FBI director Thursday in a 51-49 vote",
    "link": "https://dailycaller.com/2025/02/20/kash-patel-confirmed-fbi-director/",
    "timestamp": "2025-02-20T19:46:55Z"
  },
  {
    "title": "‘Good Riddance’: Trump Fires ‘Biden Era’ Prosecutors",
    "description": "In his effort to purge the federal government of political corruption, President Donald Trump is firing all prosecutors hired by his predecessor. On Tuesday evening,... Read More\nThe post ‘Good Riddance’: Trump Fires ‘Biden Era’ Prosecutors appeared first on …",
    "link": "https://www.dailysignal.com/2025/02/20/good-riddance-trump-fires-biden-era-prosecutors/",
    "timestamp": "2025-02-20T19:45:01Z"
  },
  {
    "title": "Pentagon Schools Pull JD Vance’s Memoir Amid Trump-Era Book Purge",
    "description": "“The recent removal of books from DoDEAschools… is nothing but censorship,” said transgender activist Ash Lazarus Orr.",
    "link": "https://truthout.org/articles/pentagon-schools-pull-vp-jd-vances-memoir-amid-trump-era-book-purge/",
    "timestamp": "2025-02-20T19:44:51Z"
  },
  {
    "title": "U.S. Attorney Ed Martin May Have Already Messed Up Trump’s Retribution Tour",
    "description": "“He’s a fantastically bad manager—a tone deaf bully who inspires ridicule rather than trust.”",
    "link": "https://slate.com/news-and-politics/2025/02/ed-martin-musk-trump-revenge-prosecutions-fail.html",
    "timestamp": "2025-02-20T19:43:29Z"
  },
  {
    "title": "Zachary Levi Discusses Choosing Trump Support Over Career",
    "description": "\"What am I really afraid of at the end of the day? ... If I lose all of my acting career, and I hope I don't, and so far I haven't. …  But none of that matters,\" he said while appearing on 'The Megyn Kelly Show.'",
    "link": "http://www.hollywoodreporter.com/news/politics-news/zachary-levi-trump-support-career-1236141984/",
    "timestamp": "2025-02-20T19:42:22Z"
  },
  {
    "title": "30 GOP Senators Urge ATF to Rescind Regulatory Gun Controls Implemented Under Biden",
    "description": "Thirty Republican Senators have signed a letter urging the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) to rescind regulatory gun controls implemented during the Biden administration.\nThe post 30 GOP Senators Urge ATF to Rescind Regulatory Gun Co…",
    "link": "https://www.breitbart.com/2nd-amendment/2025/02/20/30-gop-senators-urge-atf-to-rescind-regulatory-gun-controls-implemented-under-biden/",
    "timestamp": "2025-02-20T19:42:03Z"
  },
  {
    "title": "January 6 Conspiracist With Revenge List Becomes Trump’s FBI Director",
    "description": "The Senate voted 51–49 Thursday to confirm Kash Patel to lead the Federal Bureau of Investigation. Senators Susan Collins and Lisa Murkowski were the two lone Republicans to join a unified caucus of Democrats against Patel’s nomination.\r\nIn the weeks leading …",
    "link": "https://newrepublic.com/post/191779/kash-patel-january-6-enemies-list-donald-trump-fbi-director",
    "timestamp": "2025-02-20T19:41:19Z"
  },
  {
    "title": "Top Fertilizer Firm Says US Farmers Would Bear Trump Trade Costs",
    "description": "US farmers would bear the cost of tariffs on imported Canadian fertilizers should President Donald Trump’s levies take effect, according to top supplier Nutrien Ltd.",
    "link": "https://www.livemint.com/companies/news/top-fertilizer-firm-says-us-farmers-would-bear-trump-trade-costs-11740080469028.html",
    "timestamp": "2025-02-20T19:41:08Z"
  },
  {
    "title": "Trump Layoffs Hit Social Security Administration, But On A Smaller Scale",
    "description": "The agency’s shrinking staff administers retirement benefits for a growing senior population.",
    "link": "https://www.huffpost.com/entry/social-security-administration-trump-layoffs_n_67b77a08e4b05145b9c4ea55",
    "timestamp": "2025-02-20T19:40:45Z"
  },
  {
    "title": "Mitch McConnell, Announcing Retirement, Calls on Senators To Prioritize National Security and the Constitution",
    "description": "Sen. Mitch McConnell (R., Ky.) in a Senate floor speech announced his retirement and urged his fellow senators to stand up for \"national security\" and \"the rule of law.\"\nThe post Mitch McConnell, Announcing Retirement, Calls on Senators To Prioritize National…",
    "link": "https://freebeacon.com/latest-news/mitch-mcconnell-announcing-retirement-calls-on-senators-to-prioritize-national-security-and-the-constitution/",
    "timestamp": "2025-02-20T19:40:25Z"
  },
  {
    "title": "Democratic Senator Mocks Trump After He Referred to Himself as 'King': 'A Royal Pain in the Ass'",
    "description": "Sen. Sheldon Whitehouse slammed Donald Trump's \"king\" remark, which also sparked online backlash over Trump's disregard for America's democratic principles.",
    "link": "https://www.ibtimes.com/democratic-senator-mocks-trump-after-he-referred-himself-king-royal-pain-ass-3764501",
    "timestamp": "2025-02-20T19:39:26Z"
  },
  {
    "title": "Trump Deputies Stop Funding Free Lawyers for Migrant Youths",
    "description": "Donald Trump's administration has stopped providing free lawyers to 26,000 migrant youths, many who are asking for green cards.\nThe post Trump Deputies Stop Funding Free Lawyers for Migrant Youths appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/02/20/trump-deputies-stop-funding-free-lawyers-for-migrant-youths/",
    "timestamp": "2025-02-20T19:38:41Z"
  },
  {
    "title": "Capitol Hill conservatives confront Donald Trump over DOGE cuts; critics question wisdom of Elon Musk-led slashes",
    "description": "The Donald Trump administration is currently on a spree to cut down federal spending as well as purge White House jobs but White House Conservatives are getting concerned with the recent development around job cuts",
    "link": "https://economictimes.indiatimes.com/news/international/us/capitol-hill-conservatives-confront-donald-trump-over-doge-cuts-critics-question-wisdom-of-elon-musk-led-slashes/articleshow/118429377.cms",
    "timestamp": "2025-02-20T19:38:06Z"
  },
  {
    "title": "Senate Confirms Kash Patel as FBI Director",
    "description": "The Senate confirmed Kash Patel to become FBI director today on a narrow vote of 51-49. Republican Sens. Susan Collins of Maine and Lisa Murkowski... Read More\nThe post Senate Confirms Kash Patel as FBI Director appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/02/20/senate-confirms-kash-patel-fbi-director/",
    "timestamp": "2025-02-20T19:36:25Z"
  },
  {
    "title": "Bank of Greece chief warns U.S. Tariffs could slow Eurozone growth",
    "description": "ATHENS, Feb. 20 (Xinhua) -- Bank of Greece Governor Yannis Stournaras has warned that new U.S. tariffs on eurozone imports could significantly impact economic growth in the region, the Greek official news agency ANA-MPA reported on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/21/bank-of-greece-chief-warns-us-tariffs-could-slow-eurozone-growth",
    "timestamp": "2025-02-20T19:36:00Z"
  },
  {
    "title": "SpaceX is getting ready to take the International Space Station out of orbit",
    "description": "Elon Musk says it’s about time for SpaceX to deorbit the International Space Station — “as soon as possible.”Read more...",
    "link": "https://qz.com/elon-musk-iss-space-station-spacex-trump-starliner-1851765682",
    "timestamp": "2025-02-20T19:36:00Z"
  },
  {
    "title": "'MAGA doesn’t support Putin': Fox News host turns on Trump’s 'un-American' policy",
    "description": "Fox News host Mark Levin offered a rebuttal of President Donald Trump’s misleading claims about the war between Russia and Ukraine on his radio show Wednesday, voicing his support for Ukrainian President Volodymyr Zelenskyy.“While Levin did not present his ar…",
    "link": "https://www.rawstory.com/maga-doesnt-support-putin-fox-news-host-goes-off-on-trumps-un-american-foreign-poli/",
    "timestamp": "2025-02-20T19:34:39Z"
  },
  {
    "title": "Mitch McConnell Touts 'Unfinished Business' in Ramping Up American Foreign Intervention in Retirement Announcement",
    "description": "Sen. Mitch McConnell touted bringing home the bacon to Kentucky and his \"unfinished business\" perpetuating a national defense strategy crafted in the 1980s in a Senate floor speech Thursday announcing his retirement.\nThe post Mitch McConnell Touts ‘Unfinished…",
    "link": "https://www.breitbart.com/politics/2025/02/20/mitch-mcconnell-touts-unfinished-business-ramping-up-defense-spending-american-foreign-intervention-retirement-announcement/",
    "timestamp": "2025-02-20T19:34:33Z"
  },
  {
    "title": "In the Trump administration, nearly every major department is an immigration agency",
    "description": "As the Trump administration works on pledges to crack down on illegal immigration, the flurry of activity has stretched across the federal government",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-administration-major-department-immigration-agency-119015006",
    "timestamp": "2025-02-20T19:34:22Z"
  },
  {
    "title": "Kash Patel, Trump’s Pick for FBI Director, Is Confirmed by Senate",
    "description": "Kash Patel, a known Trump loyalist and critic of the FBI, has been confirmed as the agency's new director.",
    "link": "https://time.com/7259969/kash-patel-fbi-director-confirmation-senate-hearing-trump-pick/",
    "timestamp": "2025-02-20T19:34:12Z"
  },
  {
    "title": "Trump's security advisor touts hostage release, plan for 'hellhole' Gaza",
    "description": "National Security Advisor Mike Waltz highlights hostage returns, tells press briefing former approach led to 'better deals for perpetrators'",
    "link": "https://www.jpost.com/international/article-843092",
    "timestamp": "2025-02-20T19:34:08Z"
  }
]