[
  {
    "title": "Trump is an anarchic toddler, constantly causing upheaval as the un-American president",
    "description": "The president has pulverised our national ideals, leaving the US seen as sinister, selfish, unruly and at everybody’s throats",
    "link": "https://www.irishtimes.com/world/us/2026/01/25/trump-is-an-anarchic-toddler-constantly-causing-upheaval-as-the-un-american-president/",
    "timestamp": "2026-01-25T06:00:01Z"
  },
  {
    "title": "Will Donald Trump’s advance on Doonbeg be kept in check by a humble snail?",
    "description": "Plus: Leo Varadkar’s birthday, Ryan’s Pub without Ryanair and a close look at Ireland’s sludge",
    "link": "https://www.irishtimes.com/ireland/2026/01/25/will-donald-trumps-advance-on-doonbeg-be-kept-in-check-by-a-humble-snail/",
    "timestamp": "2026-01-25T06:00:00Z"
  },
  {
    "title": "Zelensky seeks urgent meeting with Trump as Ukraine peace deal hangs in the balance",
    "description": "Ukrainian President Volodymyr Zelensky seeks an immediate meeting with Trump to finalize a controversial peace deal, fearing dwindling Western support amid battlefield losses and corruption scandals. The original 28-point plan, demanding major Ukrainian conce…",
    "link": "https://www.naturalnews.com/2026-01-25-zelensky-seeks-urgent-meeting-trump-ukraine-deal.html",
    "timestamp": "2026-01-25T06:00:00Z"
  },
  {
    "title": "Ritter: Trump backstabbed Netanyahu with his inaction in Iran destabilization plot",
    "description": "Former UN weapons inspector Scott Ritter claims Trump deliberately undermined a covert plan to destabilize Iran, potentially to silence regime-change advocates like Israel PM Netanyahu and Sen. Lindsey Graham. Trump’s inaction allowed Iran – with Russian cybe…",
    "link": "https://www.naturalnews.com/2026-01-25-ritter-trump-backstabbed-netanyahu-inaction-iran-destabilization.html",
    "timestamp": "2026-01-25T06:00:00Z"
  },
  {
    "title": "Putin offers $1B from frozen funds for Trump’s Gaza peace board",
    "description": "Russian President Vladimir Putin offers $1 billion from frozen Russian assets in the U.S. to fund President Donald Trump’s proposed ‘Board of Peace’ for Gaza. Putin conditions the use of remaining U.S.-frozen assets on a finalized peace treaty between Russia …",
    "link": "https://www.naturalnews.com/2026-01-25-putin-offers-1b-frozen-funds-gaza-peace-board.html",
    "timestamp": "2026-01-25T06:00:00Z"
  },
  {
    "title": "Decoding the Naval Buildup: A Dangerous Neo-Imperial Gamble in the Middle East",
    "description": "Introduction: A Flotilla of Folly As the world watches with bated breath, the U.S. military machine shifts into high gear, directing a colossal naval force towards the Persian Gulf. In January 2026, President Donald Trump confirmed the deployment, stating, “W…",
    "link": "https://www.naturalnews.com/2026-01-25-dangerous-neo-imperial-gamble-in-middle-east.html",
    "timestamp": "2026-01-25T06:00:00Z"
  },
  {
    "title": "‘SNL’ Takes Aim at ICE During ‘Weekend Update’ After I.C.U. Nurse Is Killed in Minnesota",
    "description": "“Saturday Night Live” lightly took on ICE during “Weekend Update,” hours after a 37-year-old Minneapolis intensive care nurse was killed by Border Patrol agents. “Vice President J.D. Vance criticized protesters confronting ICE Officers, saying they should ins…",
    "link": "https://variety.com/2026/tv/news/snl-slams-ice-weekend-update-1236640253/",
    "timestamp": "2026-01-25T05:48:46Z"
  },
  {
    "title": "EMILY STACK: Families Paying Price For Big Pharma’s Legal Games",
    "description": "For moms, nothing matters more than our families’ health. But for too many families, staying healthy has become unaffordable. Health insurance premiums keep in",
    "link": "https://dailycaller.com/2026/01/25/opinion-families-are-paying-a-price-for-big-pharmas-legal-games-emily-stack/",
    "timestamp": "2026-01-25T05:46:58Z"
  },
  {
    "title": "Albanese takes safe course, appointing defence chief Greg Moriarty to replace Kevin Rudd",
    "description": "The highly-respected senior bureaucrat is a safe choice, and his defence background will be an added bonus on AUKUS.",
    "link": "https://theconversation.com/albanese-takes-safe-course-appointing-defence-chief-greg-moriarty-to-replace-kevin-rudd-274026",
    "timestamp": "2026-01-25T05:44:52Z"
  },
  {
    "title": "Albanese takes safe course, appointing defence chief Greg Moriaty to replace Kevin Rudd",
    "description": "The highly-respected senior bureaucrat is a safe choice, and his defence background will be an added bonus on AUKUS.",
    "link": "https://theconversation.com/albanese-takes-safe-course-appointing-defence-chief-greg-moriaty-to-replace-kevin-rudd-274026",
    "timestamp": "2026-01-25T05:44:52Z"
  },
  {
    "title": "Trump escalates Canada-US trade standoff with threat of 100 percent tariffs over China relations and recent EV deal",
    "description": "America's President Donald Trump has threatened severe tariffs on all Canadian products. This action follows Canadian Prime Minister Mark Carney's speech about global economic shifts. Trump believes Canada is considering a trade deal with China. He warned thi…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/trump-escalates-canada-us-trade-standoff-with-threat-of-100-percent-tariffs-over-china-relations-and-recent-ev-deal/articleshow/127454195.cms",
    "timestamp": "2026-01-25T05:44:14Z"
  },
  {
    "title": "Does Trump own Gaza?",
    "description": "Usually we like Trump's American swagger. But not when it comes to Israel, our most loyal ally in the Middle East. Opinion.",
    "link": "https://www.israelnationalnews.com/news/421414",
    "timestamp": "2026-01-25T05:43:00Z"
  },
  {
    "title": "Trump cites Minnesota fraud cases to warn against migration from ‘failed’ societies",
    "description": "President Donald Trump took a shot at Somalia and claimed that the investigations Minnesota faces into alleged fraud schemes are a reminder that the West cannot allow mass migration from \"failed\" societies. Minnesota has encountered heightened scrutiny in rec…",
    "link": "https://freerepublic.com/focus/f-bloggers/4363845/posts",
    "timestamp": "2026-01-25T05:36:11Z"
  },
  {
    "title": "Richard Curran: After Greenland dreamland, the EU need only watch the markets to predict Trump’s next move",
    "description": "Who won the battle for Greenland that never was? The EU appears flummoxed, amid accusations of how “ineffectual” European leaders are in the face of the combative and threatening negotiating style of Donald Trump.",
    "link": "https://www.independent.ie/business/irish/richard-curran-after-greenland-dreamland-the-eu-need-only-watch-the-markets-to-predict-trumps-next-move/a24021726.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "Race is on to protect economy against more Trump turmoil, warns Simon Harris",
    "description": "Tánaiste Simon Harris has warned Government departments that there can be no excuses or delays when it comes to increasing Ireland’s competitiveness in the face of chaos caused by US president Donald Trump.",
    "link": "https://www.independent.ie/irish-news/race-is-on-to-protect-economy-against-more-trump-turmoil-warns-simon-harris/a202438004.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "‘I saw the warning signs’ – ‘Donald dash’ hots up as growing number of wealthy Americans race to get Irish visas and passports",
    "description": "There has been a significant increase in wealthy Americans moving to Ireland to escape life under Donald Trump, new figures from the Department of Justice reveal.",
    "link": "https://www.independent.ie/irish-news/i-saw-the-warning-signs-donald-dash-hots-up-as-growing-number-of-wealthy-americans-race-to-get-irish-visas-and-passports/a1208094930.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "Shane Ross: With Donald Trump on the prowl, Ireland’s watchword must be ‘Don’t poke the bear’",
    "description": "The control freaks in Iveagh House must have been up the wall in recent days.",
    "link": "https://www.independent.ie/opinion/comment/shane-ross-with-donald-trump-on-the-prowl-irelands-watchword-must-be-dont-poke-the-bear/a1589397910.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "Caitríona Perry: Recent history shows that any threat from President Donald Trump can no longer be written off as bluster",
    "description": "A rupture, a big blow, a splinter, a gulf. Call it what you will, it is unlikely that European-US relations will ever be quite the same after the events of the last week.",
    "link": "https://www.independent.ie/opinion/caitriona-perry-recent-history-shows-that-any-threat-from-president-donald-trump-can-no-longer-be-written-off-as-bluster/a1836488196.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "Any Other Business: Will Gabriel Makhlouf get another turn on Central Bank merry-go-round?",
    "description": "While all eyes are on who Donald Trump will appoint to lead the US Federal Reserve, America’s central bank, no one has been too concerned about who the Irish Government will choose to lead ours. Until now.",
    "link": "https://www.independent.ie/business/media/any-other-business-will-gabriel-makhlouf-get-another-turn-on-central-bank-merry-go-round/a363140280.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "Caitríona Perry: Recent history shows that President Donald Trump generally says what he is going to do, and then does some version of it, sooner or later",
    "description": "A rupture, a big blow, a splinter, a gulf. Call it what you will, it is unlikely that European-US relations will ever be quite the same after the events of the last week.",
    "link": "https://www.independent.ie/opinion/caitriona-perry-recent-history-shows-that-president-donald-trump-generally-says-what-he-is-going-to-do-and-then-does-some-version-of-it-sooner-or-later/a1836488196.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "The Sunday Independent’s View: Ireland-US relationship will outlast Donald Trump, so we must take the long-term view",
    "description": "It is that time of year again when the Irish debate among themselves whether the Taoiseach should boycott the tradi­tional St Patrick’s Day shindig in the White House. Last year it was over the war in Gaza. This year? Take your pick.",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-ireland-us-relationship-will-outlast-donald-trump-so-we-must-take-the-long-term-view/a347808303.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "‘No delays or excuses allowed’, Finance Minister warns departments in race to protect economy against Trump’s chaos",
    "description": "Tánaiste Simon Harris has warned Government departments that there can be no excuses or delays when it comes to increasing Ireland’s competitiveness in the face of chaos caused by US president Donald Trump.",
    "link": "https://www.independent.ie/irish-news/no-delays-or-excuses-allowed-finance-minister-warns-departments-in-race-to-protect-economy-against-trumps-chaos/a202438004.html",
    "timestamp": "2026-01-25T05:30:00Z"
  },
  {
    "title": "‘SNL’ Cold Open: Vanity-Loving Trump ‘Just Getting Started’ Destroying the Country",
    "description": "On SNL, Donald Trump indulges his vanity and hosts an awards show about himself while the country faces crisis after crisis",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-cold-open-trump-just-getting-started-destroying-country-1235504321/",
    "timestamp": "2026-01-25T05:29:16Z"
  },
  {
    "title": "NASA is set to send astronauts around the Moon again",
    "description": "NASA is moving into a new phase of space exploration, with major progress across human spaceflight, science missions, and advanced technology. In just one year, the agency has launched multiple crewed and science missions, test-flown new aircraft, and pushed …",
    "link": "https://www.sciencedaily.com/releases/2026/01/260124234535.htm",
    "timestamp": "2026-01-25T05:25:37Z"
  },
  {
    "title": "Woman who stands between Trump and Greenland",
    "description": "Denmark's Prime Minister Mette Frederiksen has successfully navigated President Trump's threats to acquire Greenland. Her firm stance and strategic alliances, including involving European allies, appear to have deterred Trump from using force. Frederiksen rem…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/woman-who-stands-between-trump-and-greenland/articleshow/127453100.cms",
    "timestamp": "2026-01-25T05:23:25Z"
  },
  {
    "title": "SNL Gives Trump More Awards, Brings Back Mike Myers As Elon Musk — Watch Video",
    "description": "SNL handed Donald Trump more meaningless awards and brought back Mike Myers as billionaire Elon Musk - watch video.",
    "link": "https://www.tvline.com/2084153/snl-video-trump-awards-elon-musk-mike-myers/",
    "timestamp": "2026-01-25T05:21:02Z"
  },
  {
    "title": "'Nihilist penguin' goes political: Trump joins penguin's death march trend with 'embrace the penguin' post, Internet mocks White House errors. Check latest memes",
    "description": "The 'Nihilist penguin' is all over social media. US President Donald Trump also joined the Nihilist penguin trend after the White House posted an AI-generated image of him walking next to a penguin carrying the US flag, while the Greenland flag stood at a dis…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/nihilist-penguin-goes-political-trump-joins-penguins-death-march-trend-with-embrace-the-penguin-post-internet-mocks-white-house-errors-check-latest-memes/articleshow/127452404.cms",
    "timestamp": "2026-01-25T05:16:59Z"
  },
  {
    "title": "Witness videos of CBP killing a Minnesota man appear to counter Trump administration’s narrative",
    "description": "Eyewitness videos showing at least one federal agent shooting and killing Alex Pretti, 37, in Minneapolis appear to counter the Trump administration’s description of events, presenting two starkly different narratives.",
    "link": "https://www.nbcnews.com/news/us-news/witness-videos-cbp-killing-minnesota-man-appear-counter-trump-administ-rcna255791",
    "timestamp": "2026-01-25T05:15:57Z"
  },
  {
    "title": "How Minnesotans became Palestinians: Top 5 Ways they are Occupied",
    "description": "Occupied people do not have rights, and they do not even have the right to have rights. They are lesser.",
    "link": "https://www.juancole.com/2026/01/minnesotans-palestinians-occupied.html",
    "timestamp": "2026-01-25T05:15:32Z"
  },
  {
    "title": "SNL Cold Open: The 1st Annual Trumps: Elon Musk, Aunt Gladys & More",
    "description": "NBC's Saturday Night Live Season 51 returned tonight with host Teyana Taylor (One Battle After Another) and musical guest Geese, with the night kicking off with the SNL Cold Open. We've got The 1st Annual Trumps, hosted by none other than Trump (James Austin …",
    "link": "https://bleedingcool.com/tv/snl-cold-open-the-1st-annual-trumps-elon-musk-aunt-gladys-more/",
    "timestamp": "2026-01-25T05:15:06Z"
  },
  {
    "title": "Polymarket sees January US gov't shutdown odds surge to 77%",
    "description": "Polymarket odds have jumped to a 77% chance of a US government shutdown, with many previously pointing to last year’s shutdown as a key reason for delays to the CLARITY Act.",
    "link": "https://cointelegraph.com/news/us-government-shutdown-january-polymarket-odds-surge",
    "timestamp": "2026-01-25T05:13:51Z"
  },
  {
    "title": "Protesters demand immigration agents leave Minneapolis after man is shot and killed during crackdown",
    "description": "Democratic officials and protesters on the streets are demanding that federal immigration officers leave Minnesota after a Border Patrol agent fatally shot a man in Minneapolis",
    "link": "https://abcnews.go.com/US/wireStory/protesters-demand-immigration-agents-leave-minneapolis-after-man-129535255",
    "timestamp": "2026-01-25T05:10:18Z"
  },
  {
    "title": "FIFA World Cup 2026: Germany FA Official In Favour Of Boycott Amid Trump's Greenland Push",
    "description": "A potential boycott from EU-linked countries could be catastrophic for the World Cup, as Europe still remains the footballing powerhouse, home to tournament favourites such as France, Germany, Spain...",
    "link": "https://www.ndtvprofit.com/sports/fifa-world-cup-2026-germany-fa-official-in-favour-of-boycott-amid-trumps-greenland-push-10881232",
    "timestamp": "2026-01-25T05:07:07Z"
  },
  {
    "title": "Chicago Police Chief: 'Federal Agents Are Officers'",
    "description": "Chicago’s police chief delivered a blunt warning amid rising confrontations with federal immigration officers, reminding residents in October that ICE and HSI personnel are “law enforcement officers” and that attacking or obstructing them is a criminal act. H…",
    "link": "https://www.breitbart.com/border/2026/01/24/chicago-police-chief-federal-agents-are-officers/",
    "timestamp": "2026-01-25T05:04:18Z"
  },
  {
    "title": "Aid by permission: How Israel’s NGO ban is reshaping life and survival in Gaza",
    "description": "Staff faces risks, cuts, after Israel revoked the licenses of 37 humanitarian organizations for not complying with new registration rules",
    "link": "https://www.juancole.com/2026/01/permission-reshaping-survival.html",
    "timestamp": "2026-01-25T05:04:02Z"
  },
  {
    "title": "‘SNL’ Cold Open Sees Mike Myers Return as Elon Musk at Trump Awards Show: ‘I Feel So Emotionless to Be Here’",
    "description": "This week’s “Saturday Night Live” featured a surprise cameo from series alum Mike Myers, who returned to the long-running NBC sketch comedy show to once again spoof Elon Musk. The cold open took place during The Trumps, an award show meant to honor “the best …",
    "link": "https://variety.com/2026/tv/news/snl-cold-open-mike-myers-elon-musk-trump-awards-1236640258/",
    "timestamp": "2026-01-25T04:55:58Z"
  },
  {
    "title": "Greenland capital hit by power outage after strong winds",
    "description": "Greenland's capital, Nuuk, was plunged into darkness over the weekend. Strong winds caused a transmission failure, leaving the city without electricity for hours. The state utility company is working to restore power using an emergency plant. Internet connect…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/greenland-capital-hit-by-power-outage-after-strong-winds/articleshow/127451700.cms",
    "timestamp": "2026-01-25T04:55:24Z"
  },
  {
    "title": "Florida Rep. Maxwell Frost says he was punched in the face at Sundance Film Festival party",
    "description": "Florida Rep. Maxwell Frost said he was “punched in the face” on Friday while at the Sundance Film Festival by a man who allegedly told him President Donald Trump was going to deport him.",
    "link": "https://www.nbcnews.com/politics/politics-news/florida-maxwell-frost-says-punched-face-sundance-film-festival-party-rcna255790",
    "timestamp": "2026-01-25T04:53:43Z"
  },
  {
    "title": "Board of Peace: Indonesia's true intention to support Palestine",
    "description": "Indonesia has officially joined the Board of Peace, launched by US President Donald Trump on the sidelines of the World Economic Forum in Davos on January ...",
    "link": "https://en.antaranews.com/news/401526/board-of-peace-indonesias-true-intention-to-support-palestine",
    "timestamp": "2026-01-25T04:53:31Z"
  },
  {
    "title": "Man is shot and killed during Minneapolis immigration crackdown, National Guard activated",
    "description": "MINNEAPOLIS (AP) — A federal immigration officer shot and killed a man Saturday in Minneapolis, drawing hundreds of protesters onto the frigid streets and ratcheting up tensions in a city already shaken by another fatal shooting weeks earlier. Family members …",
    "link": "https://www.pbs.org/newshour/nation/man-is-shot-and-killed-during-minneapolis-immigration-crackdown-national-guard-activated",
    "timestamp": "2026-01-25T04:52:25Z"
  },
  {
    "title": "Trump warns Canada of 100% tariffs over potential China trade deal",
    "description": "WASHINGTON DC: US President Donald Trump has threatened to impose a 100% tariff on Canadian goods if Canada finalizes any trade agreement with China. Posting on Truth Social, Trump said, “If Canada makes a deal with China, it will immediately face a 100% tari…",
    "link": "https://english.khabarhub.com/2026/25/532419/",
    "timestamp": "2026-01-25T04:45:51Z"
  },
  {
    "title": "US Fed set to keep rates steady as officials defend independence",
    "description": "The US Federal Reserve is widely expected to keep interest rates unchanged when it meets in the coming week, holding firm despite President Donald Trump's pressure to slash levels as it guards against threats to its independence. - External pressure - The Fed…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-set-to-keep-rates-steady-as-officials-defend-independence/articleshow/127450286.cms",
    "timestamp": "2026-01-25T04:27:21Z"
  },
  {
    "title": "\"Focus on what we can control,\" says Canadian PM Carney after Trump threatens 100% tariffs",
    "description": "PM Mark Carney urges Canadians to \"Buy Canadian\" amid threats of 100% tariffs from Trump, focusing on local economic strength.",
    "link": "https://www.thehindubusinessline.com/news/world/focus-on-what-we-can-control-says-canadian-pm-carney-after-trump-threatens-100-tariffs/article70548779.ece",
    "timestamp": "2026-01-25T04:17:11Z"
  },
  {
    "title": "Booker winner George Saunders: ‘I can rage against Trump all day long. But is it helping?’",
    "description": "The Booker winner on his new novel, Vigil, about the implications of comforting bad people; why he tries to understand the US administration; and why he doesn’t consider himself a proper novelist",
    "link": "https://www.irishtimes.com/culture/books/2026/01/25/booker-winner-george-saunders-i-can-rage-against-trump-all-day-long-but-is-it-helping/",
    "timestamp": "2026-01-25T04:12:00Z"
  },
  {
    "title": "The Man Killed By A U.S. Border Patrol Officer In Minneapolis Was An ICU Nurse, Family Says",
    "description": "Alex Jeffrey Pretti, 37, was an avid outdoorsman who enjoyed getting in adventures with Joule, his beloved Catahoula Leopard dog who also recently died.",
    "link": "https://www.huffpost.com/entry/immigration-enforcement-minnesota-protester_n_69759565e4b0757fa12b66c0",
    "timestamp": "2026-01-25T04:09:07Z"
  },
  {
    "title": "Australia calls on Trump to respect NATO soldiers",
    "description": "Australian Prime Minister Anthony Albanese has strongly condemned remarks by former US President Donald Trump. Trump had criticized the contributions of non-US troops in Afghanistan. Albanese stated these comments were unacceptable and deeply hurtful to Austr…",
    "link": "https://economictimes.indiatimes.com/news/defence/australia-calls-on-trump-to-respect-nato-soldiers/articleshow/127449075.cms",
    "timestamp": "2026-01-25T04:04:26Z"
  },
  {
    "title": "Trump envoy hails ‘very constructive’ Russia-US-Ukraine talks",
    "description": "US Special Envoy Steve Witkoff has described the three-way talks with Russia and Ukraine as “very constructive” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631474-trump-envoy-hails-constructive-talks/",
    "timestamp": "2026-01-25T03:55:01Z"
  },
  {
    "title": "Tenacious D \"Will Be Back\": Kyle Gass \"Hashed It Out\" with Jack Black",
    "description": "The breakup of Jack Black and Kyle Gass… otherwise known as \"The Greatest Rock Duo to Ever Rock The Planet\"… otherwise known as \"The D\"… otherwise known as Tenacious D… is a subject we haven't touched on in a little over six months. For those who need a histo…",
    "link": "https://bleedingcool.com/tv/tenacious-d-will-be-back-kyle-gass-hashed-it-out-with-jack-black/",
    "timestamp": "2026-01-25T03:37:07Z"
  },
  {
    "title": "Ocasio-Cortez: ICE Shooting Was an ‘Execution’",
    "description": "Saturday on CNN’s “Newsroom Live,” Rep. Alexandria Ocasio-Cortez (D-NY) said the fatal shooting of Alex Pretti in Minneapolis was an “execution” by Immigration and Customs Enforcement (ICE). Ocasio-Cortez said, “There’s a second angle that appears to be circu…",
    "link": "https://freerepublic.com/focus/f-chat/4363834/posts",
    "timestamp": "2026-01-25T03:27:28Z"
  },
  {
    "title": "US winter storm: 13,000 flights canceled as temperatures dip",
    "description": "Millions of people hunkered down as a major winter storm pummeled much of central and eastern half of the country. Thousands of flights were canceled, and thousands reported power outages in dangerously cold conditions.",
    "link": "https://www.dw.com/en/us-winter-storm-13000-flights-canceled-as-temperatures-dip/a-75645912",
    "timestamp": "2026-01-25T03:26:00Z"
  },
  {
    "title": "With Donroe Doctrine, Trump Threatens to Export His Brand of Authoritarianism",
    "description": "International solidarity, not liberal imperialism, is the only way to stop Trump’s global class war.",
    "link": "https://truthout.org/articles/with-donroe-doctrine-trump-threatens-to-export-his-brand-of-authoritarianism/",
    "timestamp": "2026-01-25T03:24:46Z"
  },
  {
    "title": "France Yellow Vests Week 373*Macron Asserts French Independence From US Control*Trump Disses Macron Showing Texts*Budget Pushed Through As PM Breaks Promise*",
    "description": "This week French President Emmanuel Macron distanced himself from US President Donald Trump's Board of Peace and seized an oil tanker of Russia's 'shadow fleet' demonstrating notions of French independence and power. The decision on not joining the \"Board of …",
    "link": "https://freerepublic.com/focus/f-bloggers/4363831/posts",
    "timestamp": "2026-01-25T03:16:19Z"
  },
  {
    "title": "Another killing by a federal officer deepens Trump’s self-inflicted political nightmare | CNN Politics",
    "description": "President Donald Trump and his administration this week seemed to belatedly come to the realization that their Immigration and Customs Enforcement operations in Minneapolis are going poorly.",
    "link": "https://www.cnn.com/2026/01/24/politics/shooting-minneapolis-trump-politics",
    "timestamp": "2026-01-25T03:13:05Z"
  },
  {
    "title": "Anti-ICE Rioters Barricading Entire Blocks In Minneapolis As Police Appear To Be MIA",
    "description": "Left-wing rioters erected barricades in the streets of Minneapolis after Border Patrol agents fatally shot a man in possession of a gun Saturday.",
    "link": "https://dailycaller.com/2026/01/24/anti-immigration-customs-enforcement-rioters-barricading-blocks-minneapolis-police/",
    "timestamp": "2026-01-25T03:11:46Z"
  },
  {
    "title": "News Today Live Updates, 25 January | ‘Ramayan: Eternal | UniversaL’ juxtaposes early prints from the Raja Ravi Varma Press with modern works",
    "description": "Latest News Live Updates | Revisiting Ramayana & its many visual interpretations",
    "link": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-01-25-2026-news-headlines-10493211/",
    "timestamp": "2026-01-25T03:10:18Z"
  },
  {
    "title": "DAVID BLACKMON: Bessent Torches Biden ‘Muppets’ On Rare Earth Minerals Crisis",
    "description": "Treasury Secretary Scott Bessent has had enough of what he calls the “Muppets” from the Joe Biden administration taking shots at the Trump 47 presidency, especi",
    "link": "https://dailycaller.com/2026/01/24/opinion-bessent-torches-biden-muppets-on-rare-earth-minerals-crisis-david-blackmon/",
    "timestamp": "2026-01-25T03:09:26Z"
  },
  {
    "title": "Rough bond market was behind Trump’s abrupt deescalation on Greenland",
    "description": "Don­ald Trump this past week abruptly ditched his plan to invade Greenland — and the head-spinning about-face came thanks to the US bond market.",
    "link": "https://nypost.com/2026/01/24/business/trump-ditches-plan-to-take-over-greenland-amid-state-of-us-bond-market/",
    "timestamp": "2026-01-25T03:07:18Z"
  },
  {
    "title": "US Govt Shutdown Looms As Democrats Vow to Block Funding Over ICE Killing",
    "description": "Democratic opposition to the funding package potentially affects not just Homeland Security but also the departments of Defense, Labor, and Education",
    "link": "https://www.ndtvprofit.com/world/us-govt-shutdown-looms-as-democrats-vow-to-block-funding-over-minneapolis-ice-killings-10880885",
    "timestamp": "2026-01-25T03:07:14Z"
  },
  {
    "title": "Billionaires, Bagmen, and Thieves (Heidi Cuda/Byline Supplement)",
    "description": "Heidi Cuda / Byline Supplement:\nBillionaires, Bagmen, and Thieves  —  This week has shown that the plot to install Trump as President was the greatest success of foreign espionage in history, writes American political columnist Heidi Siegmund Cuda  —  Everyon…",
    "link": "https://www.memeorandum.com/260124/p84",
    "timestamp": "2026-01-25T03:05:00Z"
  },
  {
    "title": "Did former special counsel Jack Smith release all his files on Trump? Here's the truth",
    "description": "In January 2026, former special counsel Jack Smith unexpectedly released all of his files on U.S. President Donald Trump by publicly uploading them.",
    "link": "https://www.snopes.com//fact-check/jack-smith-release-files-trump/",
    "timestamp": "2026-01-25T03:00:00Z"
  },
  {
    "title": "AG Pam Bondi Tells Minnesota Democrats: 'Accountability Is Coming'",
    "description": "\"Accountability is coming\" to Minnesota, Attorney General Pam Bondi declared as Democrats try to shift public attention away from large-scale government fraud and towards the chaos they have created in Minneapolis.\nThe post AG Pam Bondi Tells Minnesota Democr…",
    "link": "https://www.breitbart.com/crime/2026/01/24/pam-bondi-tell-minnesota-democrats-accountability-is-coming/",
    "timestamp": "2026-01-25T02:57:50Z"
  },
  {
    "title": "Ukraine will be the business opportunity of the decade",
    "description": "Once peace takes hold, Ukraine will become one of the world’s most dynamic emerging economies, Howard J. Shatz writes in a guest commentary.",
    "link": "https://www.livemint.com/opinion/online-views/ukraine-will-be-the-business-opportunity-of-the-decade-11769308522715.html",
    "timestamp": "2026-01-25T02:38:46Z"
  },
  {
    "title": "Trump’s latest Canada threat previews rocky USMCA negotiations",
    "description": "US President Donald Trump's tariff threats are creating uncertainty for upcoming trade talks with Canada and Mexico. These discussions are crucial for the USMCA agreement. Canada's trade with China is a point of contention. Economists anticipate a positive ou…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-latest-canada-threat-previews-rocky-usmca-negotiations/articleshow/127444653.cms",
    "timestamp": "2026-01-25T02:38:41Z"
  },
  {
    "title": "'We Negotiate, But We Never Submit'; Sheinbaum Sets Limits in the Face of Trump's Threats",
    "description": "“Sol Prendido” for Borderland Beat  This was in response to former President Donald Trump's threats of possible actions against drug cartels...",
    "link": "https://www.borderlandbeat.com/2026/01/we-negotiate-but-we-never-submit.html",
    "timestamp": "2026-01-25T02:34:00Z"
  },
  {
    "title": "Mark Carney Counters After Trump's 100% Tariff Warning Over China Deal",
    "description": "This is a direct response to US President Donald Trump, who levelled a threat on its neighbour this past weekend, announcing steep tariffs of up to 100% if Canada goes ahead and pursues economic deals with China.",
    "link": "https://www.ndtvprofit.com/world/buy-canadian-mark-carney-counters-after-trumps-100-tariff-warning-over-china-deal-10880825",
    "timestamp": "2026-01-25T02:30:13Z"
  },
  {
    "title": "‘What’s Happening In Minnesota Is Appalling’: Schumer Vows Dems Won’t Support ‘Woefully Inadequate’ DHS Funding Bill",
    "description": "Senate Minority Leader Chuck Schumer said he and other Democrats will not back a package including a bill funding DHS, risking a partial government shutdown.",
    "link": "https://dailycaller.com/2026/01/24/chuck-schumer-democrats-oppose-department-homeland-security-funding-bill-minneapolis-shooting-immigration-customs-enforcement-border-patrol/",
    "timestamp": "2026-01-25T02:28:43Z"
  },
  {
    "title": "Frey, Klobuchar call for ICE to leave Minneapolis following deadly CBP shooting in city",
    "description": "Several Minnesota leaders united against ICE operations on Saturday after a fatal shooting incident, with Sen. Amy Klobuchar, D-Minn., saying federal agents outnumber local police \"three to one.\"",
    "link": "https://www.foxnews.com/politics/frey-klobuchar-call-ice-leave-minneapolis-following-deadly-cbp-shooting-city",
    "timestamp": "2026-01-25T02:25:54Z"
  },
  {
    "title": "Zelenskyy says trilateral talks ended constructively and more are possible next week",
    "description": "Representatives from Ukraine, Russia, and the United States concluded two days of talks in the UAE. Discussions focused on potential parameters for ending the nearly four-year-old war. Negotiators will reconvene on February 1. The meetings covered military an…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskyy-says-trilateral-talks-ended-constructively-and-more-are-possible-next-week/articleshow/127444398.cms",
    "timestamp": "2026-01-25T02:24:22Z"
  },
  {
    "title": "Fed Decision On Wednesday: Why Interest-Rate Hold Is Likely On Cards",
    "description": "Officials in Washington are widely expected to defy US President Donald Trumps calls for lower borrowing costs on Wednesday.",
    "link": "https://www.ndtvprofit.com/global-economy/fed-decision-on-wednesday-powell-led-panel-set-to-lead-global-peers-with-interest-rate-hold-10880816",
    "timestamp": "2026-01-25T02:23:13Z"
  },
  {
    "title": "Trump Says Canada Will Face 100% Tariffs if It \"Makes A Deal With China\"",
    "description": "U.S. President Donald Trump says Canadian goods exported to the United States would be hit with 100 percent tariffs if Canada makes a deal with China.“If Governor Carney thinks he is going to make Canada a ‘Drop Off Port’ for China to send goods and products …",
    "link": "https://freerepublic.com/focus/f-news/4363825/posts",
    "timestamp": "2026-01-25T02:23:13Z"
  },
  {
    "title": "Videos show deadly Minneapolis shooting and political leaders reach different conclusions",
    "description": "Videos quickly emerged Saturday showing the fatal shooting of a Minneapolis protester by a Border Patrol agent, with Democratic leaders in Minnesota saying the footage showed the deadly encounter was the result of untrained federal officers overreacting and t…",
    "link": "https://japantoday.com/category/world/videos-show-deadly-minneapolis-shooting-and-political-leaders-reach-different-conclusions",
    "timestamp": "2026-01-25T02:19:49Z"
  },
  {
    "title": "Did ICE Use a 5-Year-Old Child as 'Bait'?",
    "description": "On Tuesday of this week, ICE approached an immigrant from Ecuador who it was targeting for deportation. What happened next has become a story of great contention with activists and Democratic officials claiming a 5-year-old child was used as bait and then kid…",
    "link": "https://freerepublic.com/focus/f-news/4363822/posts",
    "timestamp": "2026-01-25T02:15:50Z"
  },
  {
    "title": "Trump praises British troops after drawing outrage at comments downplaying NATO’s role in Afghanistan - CNN",
    "description": "Trump praises British troops after drawing outrage at comments downplaying NATO’s role in AfghanistanCNN Donald Trump walks back comments about UK soldiers in AfghanistanThe Guardian UK PM, others outraged at Trump's comments downplaying NATO allies' role dur…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180651942",
    "timestamp": "2026-01-25T02:12:59Z"
  },
  {
    "title": "Let public buy war bonds to raise £20bn for defence, say Lib Dems",
    "description": "Liberal Democrat leader Sir Ed Davey says the bonds would \"give ordinary people the opportunity to contribute to Britain's security\".",
    "link": "https://www.bbc.com/news/articles/cq5y7edg169o",
    "timestamp": "2026-01-25T02:12:17Z"
  },
  {
    "title": "2 die as bullet train bridge plate ‘falls’ in Gujarat",
    "description": "A 35-year-old man and his nine-year-old daughter were killed on Saturday after a heavy metal plate fell from an under-construction bullet train bridge over the Tapi River near Kathore village on the outskirts of the city.\n\nThe deceased were identified as Mohs…",
    "link": "https://timesofindia.indiatimes.com/city/surat/man-daughter-die-as-metal-plate-falls-on-their-boat-in-tapi/articleshow/127415736.cms",
    "timestamp": "2026-01-25T02:10:25Z"
  },
  {
    "title": "Minneapolis shooting raises odds of US government shutdown",
    "description": "US senators plan to block government spending bills. This follows the killing of a second American citizen by federal agents in Minneapolis. Funding for key departments like Homeland Security expires soon. Democrats are refusing to support the bill if it incl…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/minneapolis-shooting-raises-odds-of-us-government-shutdown/articleshow/127443699.cms",
    "timestamp": "2026-01-25T02:09:18Z"
  },
  {
    "title": "Another Shutdown Looms? Schumer Threatens Dems Will Vote Against Funding ICE After Latest Minnesota Shooting",
    "description": "Chuck Schumer vowed congressional Democrats will vote against a package that includes billions of dollars for DHS after Alex Pretti was shot in Minnesota\nThe post Another Shutdown Looms? Schumer Threatens Dems Will Vote Against Funding ICE After Latest Minnes…",
    "link": "https://www.mediaite.com/politics/another-shutdown-looms-schumer-threatens-dems-will-vote-against-funding-ice-after-latest-minnesota-shooting/",
    "timestamp": "2026-01-25T02:09:00Z"
  },
  {
    "title": "Noem says Minneapolis suspect committed ‘domestic terrorism,’ accuses Walz, Frey of inciting violence",
    "description": "DHS Secretary Kristi Noem warns the Trump administration is considering Insurrection Act as tensions escalate in Minneapolis following deadly Border Patrol shooting and unrest.",
    "link": "https://www.foxnews.com/politics/noem-says-minneapolis-suspect-committed-domestic-terrorism-accuses-walz-frey-inciting-violence",
    "timestamp": "2026-01-25T02:07:57Z"
  },
  {
    "title": "CNN Medical Analyst Urges ‘Bipartisan Congressional Inquiry’ Into Trump’s Mental Fitness After Greenland Letter to Norway’s PM - NewsBreak",
    "description": "CNN medical analyst Dr. Jonathan Reiner is urging Congress to take action after President Donald Trump sent a letter to Norwegian Prime Minister Jonas Gahr",
    "link": "https://www.newsbreak.com/share/4458275025448-cnn-medical-analyst-urges-bipartisan-congressional-inquiry-into-trump-s-mental-fitness-after-greenland-letter-to-norway-s-pm?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1769306753&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.1.11%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-25T02:06:42Z"
  },
  {
    "title": "Meet the barbies powering India’s unicorn boom",
    "description": "A new wave of Indian entrepreneurs, dubbed BARBIE founders, are returning from abroad to build successful startups. These individuals, who pursued undergraduate degrees overseas, are outperforming IIT and BITS alumni in creating unicorns. Their global exposur…",
    "link": "https://timesofindia.indiatimes.com/india/meet-the-barbies-powering-indias-unicorn-boom/articleshow/127442010.cms",
    "timestamp": "2026-01-25T02:06:28Z"
  },
  {
    "title": "Health insurance is even less affordable this year – here’s why",
    "description": "(CNN) — Millions of Americans got a nasty reminder this month of just how costly health care coverage is.",
    "link": "https://www.wkow.com/health-insurance-is-even-less-affordable-this-year-here-s-why/article_baad8577-8357-54a8-a1e7-a72ccdc47483.html",
    "timestamp": "2026-01-25T02:00:40Z"
  },
  {
    "title": "US snowstorm triggers flight cancellations, power outages",
    "description": "A monster snowstorm is moving across the US, cancelling thousands of flights, knocking out power and snarling major roadways with ice.",
    "link": "https://www.abc.net.au/news/2026-01-25/us-winter-storm-power-outages-thousands-of-flight-cancellations/106267082",
    "timestamp": "2026-01-25T01:58:25Z"
  },
  {
    "title": "Toothpick! Twiggy! Why does thin-shaming get a free pass?",
    "description": "The author recounts a lifetime of casual body policing and \"thin shaming\" despite cultural ideals of thinness. She details the constant, often well-intentioned but hurtful, comments and assumptions about her naturally thin physique, highlighting the double st…",
    "link": "https://timesofindia.indiatimes.com/india/toothpick-twiggy-why-does-thin-shaming-get-a-free-pass/articleshow/127442841.cms",
    "timestamp": "2026-01-25T01:57:16Z"
  },
  {
    "title": "Protest forms in Milwaukee after man with Wisconsin ties shot, killed by federal agent in Minneapolis",
    "description": "Protest forms in Milwaukee after man with Wisconsin ties shot, killed by federal agent in Minneapoliswisn.com",
    "link": "https://www.wisn.com/article/protest-forms-in-milwaukee-after-man-with-wisconsin-ties-shot-killed-by-federal-agent-in-minneapolis/70124485",
    "timestamp": "2026-01-25T01:56:16Z"
  },
  {
    "title": "Upasana Singh reacts to rumours of rift with Kapil Sharma; says 'If he ever needs me on the show...'",
    "description": "Upasana Singh has put the whispers of a rift with Kapil Sharma to rest, reaffirming that he is akin to a younger brother to her and their camaraderie is intact. She mentioned that should the opportunity arise for a substantial role, she'd be thrilled to colla…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/upasana-singh-reacts-to-rumours-of-rift-with-kapil-sharma-says-if-he-ever-needs-me-on-the-show-/articleshow/127442508.cms",
    "timestamp": "2026-01-25T01:52:21Z"
  },
  {
    "title": "Report: Netanyahu blocked Herzog from attending Trump’s Gaza Peace Board launch",
    "description": "According to Axios, Netanyahu rejected a White House request for Herzog to attend Trump’s Gaza Peace Board launch in Davos, prompting tense exchanges.",
    "link": "https://www.israelnationalnews.com/news/421406",
    "timestamp": "2026-01-25T01:47:33Z"
  },
  {
    "title": "Happy Republic Day 2026: Top 50 Wishes, Messages, and Quotes to Share with Friends and Colleagues",
    "description": "India celebrates its 76th Republic Day on January 26, 2026, commemorating the adoption of its Constitution. The grand parade on Kartavya Path will highlight military strength, cultural diversity, and technological advancements, with a special focus on the 150…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/happy-republic-day-2026-top-50-wishes-messages-greetings-card-whatsapp-and-facebook-status-pictures-images-and-quotes-to-share-with-friends-and-colleagues/articleshow/127394375.cms",
    "timestamp": "2026-01-25T01:45:13Z"
  },
  {
    "title": "Rep. Maxwell Frost Claims he was punched at Sundance; suspect arrested",
    "description": "Rep. Maxwell Frost, who represents the 10th Congressional District of Florida, said he was assaulted at the Sundance Film Festival in Park City, Utah, on Friday night after claiming a man punched him and shouted racist remarks.",
    "link": "https://www.wftv.com/news/local/rep-maxwell-frost-claims-he-was-punched-sundance-suspect-arrested/ESRG46W4DNGJNMOKQFN6OMQ34M/",
    "timestamp": "2026-01-25T01:44:28Z"
  },
  {
    "title": "Trump and Stephen Miller Want You Not to Trust Your Own Eyes",
    "description": "But this is exactly as bad as it looks.",
    "link": "https://slate.com/news-and-politics/2026/01/minneapolis-ice-shooting-today-alex-pretti-trump-stephen-miller.html",
    "timestamp": "2026-01-25T01:44:22Z"
  },
  {
    "title": "Videos show deadly Minneapolis shooting and political leaders reach different conclusions",
    "description": "A second fatal shooting in Minneapolis again led tensions to boil over as local, state and national leaders weighed in with conflicting accounts of how the situation unfolded",
    "link": "https://abcnews.go.com/US/wireStory/videos-show-deadly-minneapolis-shooting-political-leaders-reach-129533802",
    "timestamp": "2026-01-25T01:41:31Z"
  },
  {
    "title": "Dem Lawmaker Accuses Trump-Loving ‘Racist’ Man of Punching Him in the Face at Sundance Film Festival",
    "description": "Maxwell Alejandro Frost accused a man of drunkenly screaming \"racist\" remarks about President Trump deporting him before punching him in the face at Sundance\nThe post Dem Lawmaker Accuses Trump-Loving ‘Racist’ Man of Punching Him in the Face at Sundance Film …",
    "link": "https://www.mediaite.com/politics/dem-lawmaker-accuses-trump-loving-racist-man-of-punching-him-in-the-face-at-sundance-film-festival/",
    "timestamp": "2026-01-25T01:41:13Z"
  },
  {
    "title": "World Health Organization says it regrets US decision to withdraw",
    "description": "The World Health Organization (WHO) said it regrets that the US has officially withdrawn from the UN health agency and it hopes Washington returns to active participation in the future.",
    "link": "https://www.gmanetwork.com/news/topstories/world/974046/world-health-organization-says-it-regrets-us-decision-to-withdraw/story/",
    "timestamp": "2026-01-25T01:41:04Z"
  },
  {
    "title": "Australian defence department chief to replace Kevin Rudd as US ambassador",
    "description": "SYDNEY, Jan 25 (Reuters) - Australian Prime Minister Anthony Albanese on Sunday named the country’s defence department chief as the next ambassador to the U.S., after Kev… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/25/australian-defence-department-chief-to-replace-kevin-rudd-as-us-ambassador",
    "timestamp": "2026-01-25T01:39:38Z"
  },
  {
    "title": "US foreign policy in five doctrines",
    "description": "Looking back at five big US foreign policy shifts from the Monroe doctrine in the 19th Century to the post-9/11 strategies of the Bush doctrine in the early 2000s. Justin Webb and his guests examine how America’s approach to the world has constantly changed o…",
    "link": "https://www.bbc.co.uk/programmes/p0mwv556",
    "timestamp": "2026-01-25T01:30:00Z"
  },
  {
    "title": "Family of ICE Victim Call Out ‘Sickening Lies’ from Trump Admin: ‘Reprehensible and Disgusting’",
    "description": "The family of Alex Pretti slammed the Trump administration for spreading \"sickening lies\" about the 37-year old ICU nurse who was shot by Border Patrol agents\nThe post Family of ICE Victim Call Out ‘Sickening Lies’ from Trump Admin: ‘Reprehensible and Disgust…",
    "link": "https://www.mediaite.com/media/news/family-of-ice-victim-call-out-sickening-lies-from-trump-admin-reprehensible-and-disgusting/",
    "timestamp": "2026-01-25T01:29:23Z"
  },
  {
    "title": "US envoys urge Netanyahu to move into Gaza ceasefire's second phase",
    "description": "American envoys pressed Israeli Prime Minister Benjamin Netanyahu to move to the second phase of the Gaza ceasefire. Discussions focused on recovering the last hostage's remains and demilitarizing the territory. Egypt strongly advocates for the immediate reop…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-envoys-urge-netanyahu-to-move-into-gaza-ceasefires-second-phase/articleshow/127441837.cms",
    "timestamp": "2026-01-25T01:28:50Z"
  },
  {
    "title": "Protests as immigration agents shoot man in Minneapolis",
    "description": "United States immigration agents shot and killed a US citizen in Minneapolis, officials said, sparking fierce protests and condemnations from local leaders.",
    "link": "https://www.rte.ie/news/world/2026/0125/1554928-minneapolis-shooting/",
    "timestamp": "2026-01-25T01:26:26Z"
  }
]