[
  {
    "title": "Days after their friendly meeting, Mamdani says he still thinks Trump is a fascist",
    "description": "Days after their friendly meeting, NYC Mayor-elect Zohran Mamdani said Sunday he still believes President Donald Trump is a fascist and a threat to democracy.",
    "link": "https://abcnews.go.com/Politics/days-after-friendly-meeting-mamdani-thinks-trump-fascist/story?id=127807736",
    "timestamp": "2025-11-23T23:27:14Z"
  },
  {
    "title": "X's new country-of-origin feature reveals many 'US' accounts to be foreign-run",
    "description": "Elon Musk's X, formerly Twitter, has rolled out a feature where going to the ‘Joined’ tab on one's profile, displays the country of origin for that account.",
    "link": "https://www.hindustantimes.com/world-news/us-news/xs-new-country-of-origin-feature-shakes-maga-and-democrat-circles-as-many-us-accounts-revealed-to-be-foreignrun-101763857104296.html",
    "timestamp": "2025-11-23T23:25:03Z"
  },
  {
    "title": "'I would not be happy!' Trump bashes new FCC plan in Truth Social rant",
    "description": "President Donald Trump, in a new Truth Social rant, bashed a report of a new plan by the Federal Communications Commission that would allow alleged anti-Trump television networks to mergeNewsmax reported on Sunday that FCC Chair Brendan Carr, a staunch Trump …",
    "link": "https://www.rawstory.com/trump-2674335883/",
    "timestamp": "2025-11-23T23:12:57Z"
  },
  {
    "title": "Donald Trump Expresses Caution About Lifting FCC Limits On Ownership Of TV Stations",
    "description": "Donald Trump weighed in on what has been a key priority for broadcasters during his administration: Lifting a cap on the number of TV stations any one entity can own. Trump posted on Truth Social on Sunday, “If this would also allow the Radical Left Networks …",
    "link": "http://deadline.com/2025/11/trump-fcc-ownership-cap-nexstar-1236626906/",
    "timestamp": "2025-11-23T23:11:35Z"
  },
  {
    "title": "Hillary Clinton 'daydreaming' about national sound system announcement that Trump is 'gone'",
    "description": "Former Secretary of State Hillary Clinton said in a post on Instagram Saturday that she was \"daydreaming\" during a recent event about a \"Goodbye, Trump\" announcement that would notify the nation that President Donald Trump is \"gone.\" Clinton posted a video fr…",
    "link": "https://freerepublic.com/focus/f-chat/4354236/posts",
    "timestamp": "2025-11-23T23:11:16Z"
  },
  {
    "title": "Michigan Sen. Elissa Slotkin Admits That Trump Has Not Issued Illegal Orders to U.S. Military",
    "description": "Sen. Elissa Slotkin (D-MI) admitted on Sunday that to her knowledge she was \"not aware\" that President Donald Trump has issued an illegal order to U.S. Military service members.\nThe post Michigan Sen. Elissa Slotkin Admits That Trump Has Not Issued Illegal Or…",
    "link": "https://www.breitbart.com/politics/2025/11/23/michigan-sen-elissa-slotkin-admits-that-trump-has-not-issued-illegal-orders-to-u-s-military/",
    "timestamp": "2025-11-23T23:05:39Z"
  },
  {
    "title": "In 'Political Attack,' Trump Revokes Protected Status for Minnesota Somalis",
    "description": "President Donald Trump's Friday announcement that he was ending Temporary Protected Status for Somali immigrants in Minnesota prompted outrage and fear from Minnesota Somalis and their allies over the weekend.In a Truth Social Post, Trump said that he was ter…",
    "link": "https://www.commondreams.org/news/trump-tps-somalis-minnesota",
    "timestamp": "2025-11-23T23:03:58Z"
  },
  {
    "title": "‘It didn’t have to be this way’ — Top economist warns affordability crisis will continue as tariffs and immigration crackdown send inflation higher",
    "description": "Moody’s Analytics chief economist Mark Zandi lamented what could’ve been, if President Donald Trump hadn’t waged war on trade and immigration. \nIn a social media post on Sunday, he noted that prices have surged since the pandemic and are continuing to climb a…",
    "link": "https://biztoc.com/x/ad324c71a138cac3",
    "timestamp": "2025-11-23T23:02:12Z"
  },
  {
    "title": "Officials meet in Geneva for Ukraine talks as peace plan’s author called into question",
    "description": "In Geneva on Sunday, U.S. officials put the heat on Ukraine to accept a peace deal to end the war with Russia or else. The author of the plan became a point of contention, while President Donald Trump said Ukrainian leadership had expressed “zero gratitude” f…",
    "link": "https://biztoc.com/x/ed851d16a229e8f1",
    "timestamp": "2025-11-23T23:02:03Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "President Donald Trump inserted fresh tension into the high-stakes Ukraine-Russia peace talks Sunday, publicly accusing Kyiv’s leaders of showing “zero gratitude” for U.S. support just as U.S. officials in Geneva were working to show a united front",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-november-23-rcna245240",
    "timestamp": "2025-11-23T23:00:00Z"
  },
  {
    "title": "Treasury Secretary Denies Possibility Of Incoming Recession: 'I Am Very Confident About 2026'",
    "description": "\"We have set the table for a very strong, noninflationary growth economy,\" Scott Bessent said on NBC News’ “Meet the Press.”",
    "link": "https://www.huffpost.com/entry/treasury-secretary-denies-possibility-of-incoming-recession_n_69236472e4b0ba57449cf213",
    "timestamp": "2025-11-23T22:58:02Z"
  },
  {
    "title": "Justice Department again asks judge to unseal Epstein grand jury testimony | CNN Politics",
    "description": "The Justice Department has asked a federal judge in Florida to reconsider unsealing grand jury materials related to an investigation into accused sex trafficker Jeffrey Epstein, as the agency faces a deadline to release all documents related to Epstein next m…",
    "link": "https://www.cnn.com/2025/11/23/politics/justice-department-judge-unseal-epstein-grand-jury-testimony",
    "timestamp": "2025-11-23T22:52:48Z"
  },
  {
    "title": "JD Vance Responds to 'Illegal Orders' Argument From Democrats",
    "description": "Vice President JD Vance responded on Sunday to Senator Elissa Slotkin's comments on ABC News' This Week where the Michigan Democrat acknowledged being unaware of any illegal orders issued by President Donald Trump involving the U.S. military.\nVance reposted t…",
    "link": "https://biztoc.com/x/1671465784003bce",
    "timestamp": "2025-11-23T22:50:54Z"
  },
  {
    "title": "Officials meet in Geneva for Ukraine talks as peace plan’s author called into question",
    "description": "In Geneva on Sunday, U.S. officials put the heat on Ukraine to accept a peace deal to end the war with Russia or else. The author of the plan became a point of contention, while President Donald Trump said Ukrainian leadership had expressed “zero gratitude” f…",
    "link": "https://www.pbs.org/newshour/show/officials-meet-in-geneva-for-ukraine-talks-as-peace-plans-author-called-into-question",
    "timestamp": "2025-11-23T22:50:02Z"
  },
  {
    "title": "Fifty kidnapped Catholic school students escape captors in Nigeria",
    "description": "However, more than 250 students and 12 staff members are still being held, in what is one of the worst mass kidnappings ever recorded in the country.",
    "link": "https://www.abc.net.au/news/2025-11-24/nigerian-students-escape-kidnappers-st-marys-school/106043750",
    "timestamp": "2025-11-23T22:44:22Z"
  },
  {
    "title": "Marjorie Taylor Greene jumps to third place for 2028 Republican presidential nominee, but will she run?",
    "description": "'Instead of swallowing lies that you are spoon fed and parroting attack phrases against me in your comments, you all should open your eyes and focus on real actions and what is actually happening to our country'",
    "link": "https://www.wnd.com/2025/11/marjorie-taylor-greene-jumps-third-place-2028-republican/",
    "timestamp": "2025-11-23T22:43:30Z"
  },
  {
    "title": "‘It didn’t have to be this way’ — Top economist warns affordability crisis will continue as tariffs and immigration crackdown send inflation higher",
    "description": "\"Consumer price inflation is near 3%, well above the Fed’s inflation target, and everything points to even higher inflation dead-ahead.\"",
    "link": "https://fortune.com/2025/11/23/affordability-crisis-inflation-outlook-trump-tariffs-immigration-crackdown-prices/",
    "timestamp": "2025-11-23T22:42:25Z"
  },
  {
    "title": "Trump set to propose framework to fix Obamacare subsidies (Jake Traylor/MS NOW)",
    "description": "Jake Traylor / MS NOW:\nTrump set to propose framework to fix Obamacare subsidies  —  The president's health-care legislation would seek to terminate what one of the White House officials referred to as ‘surprise premium hikes’ generated by the ACA.  —  Presid…",
    "link": "https://www.memeorandum.com/251123/p63",
    "timestamp": "2025-11-23T22:40:00Z"
  },
  {
    "title": "EXCLUSIVE: Trump tells Just the News he will designate Muslim Brotherhood a terrorist organization (John Solomon/Just The News)",
    "description": "John Solomon / Just The News:\nEXCLUSIVE: Trump tells Just the News he will designate Muslim Brotherhood a terrorist organization  —  Announcement came just days after Just the News published a long expose on the Muslim Brotherhood's activities.  — Article  — …",
    "link": "https://www.memeorandum.com/251123/p64",
    "timestamp": "2025-11-23T22:40:00Z"
  },
  {
    "title": "Trump Gets Teed Up By Glenn Beck to Attack ‘Seditious’ Democrats By Digging Up the Specific Law He’d Use to Go After Them",
    "description": "Glenn Beck lit a fire under Donald Trump Sunday after digging up a specific law to bolster claims of \"sedition\" against a handful of Democratic lawmakers.\nThe post Trump Gets Teed Up By Glenn Beck to Attack ‘Seditious’ Democrats By Digging Up the Specific Law…",
    "link": "https://www.mediaite.com/media/news/trump-gets-teed-up-by-glenn-beck-to-attack-seditious-democrats-by-digging-up-the-specific-law-hed-use-to-go-after-them/",
    "timestamp": "2025-11-23T22:37:45Z"
  },
  {
    "title": "Trump Makes Surprising U-Turn On Plans To Deploy National Guard To New York City",
    "description": "The president's comments came after his surprisingly cordial meeting with New York City Mayor-elect Zohran Mamdani at the White House.",
    "link": "https://www.huffpost.com/entry/trump-wont-deploy-troops-new-york-city_n_69233cece4b049cdc6d4f583",
    "timestamp": "2025-11-23T22:35:41Z"
  },
  {
    "title": "A battle with her blood",
    "description": "This beautifully written essay by Tatiana Schlossberg, a granddaughter of JFK via his daughter and her mother Caroline, is both very moving and absolutely enraging. As to the former, it is full of details like these: The nurses brought me warm blankets and le…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/a-battle-with-her-blood",
    "timestamp": "2025-11-23T22:33:35Z"
  },
  {
    "title": "Canada’s prime minister says trade talks with US will resume ‘when appropriate’",
    "description": "President Trump last month suspended the talks over an anti-tariff advertisement issued by Ontario's provincial government.",
    "link": "https://nypost.com/2025/11/23/business/canadas-prime-minister-says-trade-talks-with-us-will-resume-when-appropriate/",
    "timestamp": "2025-11-23T22:31:51Z"
  },
  {
    "title": "US ‘very optimistic’ Ukraine peace plan can be reached ‘very soon’: Rubio",
    "description": "Rubio says 'tremendous' progress made in meetings with Ukrainian and European officials on proposal to halt the war.",
    "link": "https://www.aljazeera.com/news/2025/11/23/us-very-optimistic-ukraine-peace-plan-can-be-reached-very-soon-rubio",
    "timestamp": "2025-11-23T22:26:04Z"
  },
  {
    "title": "'They want it both ways': Trump ally reveals boat strikes eroding key part of MAGA base",
    "description": "One of President Donald Trump's allies in Congress revealed that the administration's continued strikes against alleged drug boats are eroding a key base within the MAGA movement, according to a new report. During an interview on CBS News' \"Face the Nation,\" …",
    "link": "https://www.rawstory.com/rand-paul-2674335814/",
    "timestamp": "2025-11-23T22:22:05Z"
  },
  {
    "title": "HC CJ retired, escaped probe for NCLAT 'interference': CJI Gavai",
    "description": "India News: NEW DELHI: Outgoing CJI B R Gavai disclosed Sunday that it was a high court chief justice who had attempted to influence a judicial member of the Nati.",
    "link": "https://timesofindia.indiatimes.com/india/hc-cj-retired-escaped-probe-for-nclat-interference-cji-gavai/articleshow/125527251.cms",
    "timestamp": "2025-11-23T22:18:51Z"
  },
  {
    "title": "10 Major Movie Cameos That You Totally Missed",
    "description": "A fun cameo can elevate a good movie to greatness, but these surprise appearances were so subtle that not everybody would have noticed them.",
    "link": "https://screenrant.com/actor-movie-cameos-missed/",
    "timestamp": "2025-11-23T22:16:17Z"
  },
  {
    "title": "“Not Going To Be Intimidated”: Dem Senator Rips Into Trump",
    "description": "Senator Mark Kelly, one of the Democratic lawmakers targeted by President Donald Trump for his role in a video advising military personnel to respect the constitution over the president’s orders, had some strong words for the president.“[The president] tries …",
    "link": "https://newrepublic.com/post/203572/mark-kelly-aoc-rips-trump",
    "timestamp": "2025-11-23T22:14:14Z"
  },
  {
    "title": "EU sanctions against Russia ‘failed’ – US Treasury Secretary",
    "description": "The EU is “funding the war” on its own with its ineffective sanctions strategy against Russia, US Treasury Secretary Scott Bessent has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628266-eu-sanctions-russia-failed/",
    "timestamp": "2025-11-23T22:13:12Z"
  },
  {
    "title": "No double standards in global terror fight: PM Modi at G20",
    "description": "India News: PM Narendra Modi participated in the IBSA Leaders' Meeting on G20 margins, stressing that UNSC reform is imperative, and said that there should be no .",
    "link": "https://timesofindia.indiatimes.com/india/no-double-standards-in-global-terror-fight-pm-modi-at-g20/articleshow/125525998.cms",
    "timestamp": "2025-11-23T22:09:51Z"
  },
  {
    "title": "Jasmine Crockett calls out Marjorie Taylor Greene for resigning from Congress amid Trump feud",
    "description": "Rep. Jasmine Crockett, D-Texas, reacted to Rep. Marjorie Taylor Greene, R-Ga., announcing that she was resigning from Congress, telling CNN's Jake Tapper, \"You've got to be kidding me.\"",
    "link": "https://www.foxnews.com/media/jasmine-crockett-calls-out-marjorie-taylor-greene-resigning-from-congress-amid-trump-feud",
    "timestamp": "2025-11-23T22:08:05Z"
  },
  {
    "title": "Trump says Ukraine has expressed 'zero gratitude' for U.S. help amid peace plan talks",
    "description": "President Donald Trump inserted fresh tensions into the high-stakes Ukraine-Russia peace talks on Sunday, publicly accusing Kyiv’s leaders of showing “zero gratitude” for U.S. support.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-says-ukraine-expressed-zero-gratitude-us-help-peace-plan-talks-rcna245412",
    "timestamp": "2025-11-23T22:07:34Z"
  },
  {
    "title": "If You Had Invested $100 in NuScale Power 1 Year Ago, Here's How Much You Would Have Today",
    "description": "Key Points\n-\nNuScale Power's stock price has plunged nearly 40% over the past three months.\n-\nPresident Donald Trump issued executive orders last May meant to spur growth in the nuclear energy industry.\n-\nShares of NuScale Power benefited from President Trump…",
    "link": "https://biztoc.com/x/2dce3fd0fb3e13fb",
    "timestamp": "2025-11-23T22:06:16Z"
  },
  {
    "title": "Trump Softens Toward Mamdani As Congress Moves To Condemn Socialism",
    "description": "Hours after the United States House of Representatives approved a bipartisan resolution denouncing what it called the “horrors of socialism,” New York City Mayor-Elect Zohran Mamdani arrived in Washington for his first meeting with President Donald Trump, a m…",
    "link": "https://bossip.com/4084867/trump-embraces-mamdani-congress-condemns-socialism/",
    "timestamp": "2025-11-23T22:05:09Z"
  },
  {
    "title": "Letter: Mail-in balloting fills accessibility need | Honolulu Star-Advertiser",
    "description": "I’m right behind the writer who says they won’t be voting if mail-in balloting is no longer allowed (“Longtime voter needs mail-in convenience,” Star-Advertiser, Letters, Nov. 12). The same for me, too.",
    "link": "https://www.staradvertiser.com/2025/11/23/editorial/letters/letter-mail-in-balloting-fills-accessibility-need/",
    "timestamp": "2025-11-23T22:00:28Z"
  },
  {
    "title": "Senators Claim Rubio Called Ukrainian Peace Plan a ‘Leaked’ Russian ‘Wish List’",
    "description": "\"It is not our recommendation. It is not our peace plan. It is a proposal that was received, and as an intermediary, we have made arrangements to share it — and we did not release it. It was leaked.\"\nThe post Senators Claim Rubio Called Ukrainian Peace Plan a…",
    "link": "https://legalinsurrection.com/2025/11/senators-claim-rubio-called-ukrainian-peace-plan-a-leaked-russian-wish-list/",
    "timestamp": "2025-11-23T22:00:05Z"
  },
  {
    "title": "Aussie PM Leads G20 Rebuke of President Trump’s Climate Defiance",
    "description": "\"... Mr Albanese said on Sunday (AEDT) it was “a good thing” and “a very positive sign that the world wants to get on with co-operating\" ...\"",
    "link": "https://wattsupwiththat.com/2025/11/23/aussie-pm-leads-g20-rebuke-of-president-trumps-climate-defiance/",
    "timestamp": "2025-11-23T22:00:00Z"
  },
  {
    "title": "50 children in Nigeria escape after kidnapping as 38 worshippers rescued",
    "description": "At least 50 of the more than 300 children snatched by gunmen from a Catholic school in Nigeria have escaped their captors, a Christian group said on Sunday, as the president announced the rescue of 38 worshippers seized in a separate attack last week. Gunmen …",
    "link": "https://www.digitaljournal.com/world/50-children-in-nigeria-escape-after-kidnapping-as-38-worshippers-rescued/article",
    "timestamp": "2025-11-23T21:57:20Z"
  },
  {
    "title": "Fifty kidnapped Catholic school students in Nigeria escape",
    "description": "More than 250 children and 12 staff still held by kidnappers, church association says",
    "link": "https://www.irishtimes.com/world/africa/2025/11/23/fifty-kidnapped-catholic-school-students-in-nigeria-escape/",
    "timestamp": "2025-11-23T21:54:47Z"
  },
  {
    "title": "Trump's healthcare cost plan may be out on Monday",
    "description": "United States President Donald Trump could map out his proposal for healthcare cost reform as early as Monday, MSNBC reported on Sunday.According to two people familiar with the matter, Trump will unv...",
    "link": "https://biztoc.com/x/e4f638da23df0cbe",
    "timestamp": "2025-11-23T21:54:46Z"
  },
  {
    "title": "President Trump’s Brain Is Officially Fried, But EVs Just Keep Getting Better",
    "description": "Nissan is banking on the all new 2026 Nissan LEAF to pump up its EV sales in the US, riding a wave of publicity from the car's inclusion as a Top 3 Finalist in the North American Utility Vehicle of the Year award program.\nThe post President Trump’s Brain Is O…",
    "link": "https://cleantechnica.com/2025/11/23/president-trumps-brain-is-officially-fried-but-evs-just-keep-getting-better/",
    "timestamp": "2025-11-23T21:53:43Z"
  },
  {
    "title": "Zelensky Responds to Trump Slamming Ukrainian ‘LEADERSHIP’ By Saying He’s Grateful for ‘Help’ Ending War",
    "description": "Volodymyr Zelensky posted a video claiming he was \"grateful\" for help ending the war with Russia — after Donald Trump accused Him of showing ‘ZERO GRATITUDE.'\nThe post Zelensky Responds to Trump Slamming Ukrainian ‘LEADERSHIP’ By Saying He’s Grateful for ‘Hel…",
    "link": "https://www.mediaite.com/media/news/zelensky-responds-to-trump-slamming-ukrainian-leadership-by-saying-hes-grateful-for-help-ending-war/",
    "timestamp": "2025-11-23T21:51:28Z"
  },
  {
    "title": "Trump Grumbles Over 'Inherited' Russia-Ukraine War In Heated Post",
    "description": "The president also took aim at former President Joe Biden, arguing that Putin only attacked Ukraine because Biden was president at the time.",
    "link": "https://www.huffpost.com/entry/trump-ukraine-ungrateful-russia-war-peace-plan_n_69233da6e4b049cdc6d4f58d",
    "timestamp": "2025-11-23T21:44:28Z"
  },
  {
    "title": "Sudden reemergence of Ukraine deal threatened to turn G20 into a tale of two summits",
    "description": "The summit was long-waited for South Africa, but the G20′s western membership were soon rushing into behind-closed-doors meetings.",
    "link": "https://www.thejournal.ie/g20-ukraine-6883712-Nov2025/",
    "timestamp": "2025-11-23T21:44:00Z"
  },
  {
    "title": "Dem Sen. Slotkin, Who Pushed Video Telling Troops To Disobey Trump, Forced To Admit She Can’t Name One Illegal Order",
    "description": "Democratic Michigan Sen. Elissa Slotkin admitted Sunday she couldn't identify any illegal order issued by President Trump when pressed by ABC's Martha Raddatz.",
    "link": "https://dailycaller.com/2025/11/23/elissa-slotkin-video-troops-disobey-donald-trump-cannot-name-one-illegal-order-martha-raddatz-abc/",
    "timestamp": "2025-11-23T21:39:23Z"
  },
  {
    "title": "WATCH: Forget their recent ‘lovefest,’ Mamdani doubles down on calling Trump a ‘fascist’",
    "description": "'Everything I said in the past I continue to believe and that's the thing that's important about politics'",
    "link": "https://www.wnd.com/2025/11/watch-forget-their-recent-lovefest-mamdani-doubles-down/",
    "timestamp": "2025-11-23T21:38:20Z"
  },
  {
    "title": "Trump blasts Ukrainian leadership for having ‘ZERO GRATITUDE’ towards U.S. efforts to end the Russia-Ukraine war",
    "description": "President Donald Trump blasted Ukrainian leaders for having “zero gratitude” towards the United States’ effort to end the Russia-Ukraine war. President Trump’s comments came in a Sunday Truth Social post, blaming former President Joe Biden’s administration fo…",
    "link": "https://freerepublic.com/focus/f-bloggers/4354225/posts",
    "timestamp": "2025-11-23T21:36:54Z"
  },
  {
    "title": "Make Etiquette Great Again: Your Guide to Winning the Holidays",
    "description": "We’ve all been there. Standing at the holiday party with nothing to say to a room full of well-dressed strangers. Or wondering what fork we are supposed to... Read More\nThe post Make Etiquette Great Again: Your Guide to Winning the Holidays appeared first on …",
    "link": "https://www.dailysignal.com/2025/11/23/make-etiquette-great-again-your-guide-to-winning-the-holidays/",
    "timestamp": "2025-11-23T21:30:00Z"
  },
  {
    "title": "Cop30: five reasons the UN climate conference failed to deliver on its ‘people’s summit’ promise",
    "description": "Deals were agreed but with crucial elements missing.",
    "link": "https://theconversation.com/cop30-five-reasons-the-un-climate-conference-failed-to-deliver-on-its-peoples-summit-promise-269750",
    "timestamp": "2025-11-23T21:27:16Z"
  },
  {
    "title": "David Cameron reveals he has been treated for prostate cancer",
    "description": "The former PM has shared his health news in a bid to add himself to the growing list of people calling for a targeted screening programme.",
    "link": "https://news.sky.com/story/david-cameron-reveals-he-has-been-treated-for-prostate-cancer-13474658",
    "timestamp": "2025-11-23T21:26:00Z"
  },
  {
    "title": "Trump's accusations of treason draw bipartisan rebuke (Nicholas Kerr/ABC News)",
    "description": "Nicholas Kerr / ABC News:\nTrump's accusations of treason draw bipartisan rebuke  —  Trump said the lawmakers' action could be “punishable by death.”  —  Sen. Elissa Slotkin, D-Mich., appears on ABC News' “This Week” on Nov. 23, 2025.  —  President Donald Trum…",
    "link": "https://www.memeorandum.com/251123/p57",
    "timestamp": "2025-11-23T21:25:01Z"
  },
  {
    "title": "Former Mets star Darryl Strawberry thanks Trump for pardon during sermon at Tulsa church",
    "description": "Former New York Mets great Darryl Strawberry praised Jesus and thanked President Donald Trump for pardoning his past tax evasion and drug charges as he...",
    "link": "https://www.yahoo.com/news/articles/former-mets-star-darryl-strawberry-212457308.html",
    "timestamp": "2025-11-23T21:24:57Z"
  },
  {
    "title": "Fmr CIA Ops Officer: Slotkin ‘Knew Exactly What She Was Doing = Sedition",
    "description": "Fmr CIA Ops Officer: Slotkin ‘Knew Exactly What She Was Putting Together with Her Little Propaganda Video’ On Friday’s “Jesse Watters Primetime” on FNC, former CIA operations officer and host of the “The Wright Report” podcast, Bryan Dean Wright, argued that …",
    "link": "https://freerepublic.com/focus/f-news/4354223/posts",
    "timestamp": "2025-11-23T21:20:00Z"
  },
  {
    "title": "Report: FBI Concludes Trump's Would-Be Assassin in Butler Acted Alone",
    "description": "Officials with the Federal Bureau of Investigation (FBI) reportedly said Thursday the man who tried to assassinate President Donald Trump in Butler, Pennsylvania, acted alone.\nThe post Report: FBI Concludes Trump’s Would-Be Assassin in Butler Acted Alone appe…",
    "link": "https://www.breitbart.com/crime/2025/11/23/report-fbi-concludes-trumps-would-be-assassin-in-butler-acted-alone/",
    "timestamp": "2025-11-23T21:19:41Z"
  },
  {
    "title": "RAND PAUL predicts GOP will 'fracture' over Venezuelan strikes",
    "description": "Sen. Rand Paul on Sunday warned that President Donald Trump’s focus on Venezuela may lead to a “fracture” among those who were drawn in by his campaign promise of avoiding foreign wars. In an interview with CBS’s “Face the Nation,” the Kentucky Republican tol…",
    "link": "https://freerepublic.com/focus/f-news/4354222/posts",
    "timestamp": "2025-11-23T21:18:15Z"
  },
  {
    "title": "The follies and the files",
    "description": "'What the Democrats did Wednesday was nothing less than a political dirty trick'",
    "link": "https://www.wnd.com/2025/11/follies-files/",
    "timestamp": "2025-11-23T21:17:25Z"
  },
  {
    "title": "Rubio Touches Down in Geneva for Ukraine Peace Plan Talks",
    "description": "U.S. Secretary of State Marco Rubio touched down in Geneva on Sunday morning for discussions on a 28-point plan for peace to end the Ukraine war, after Washington signalled flexibility on the controversial proposal.As Breitbart News detailed, the plan — repor…",
    "link": "https://freerepublic.com/focus/f-news/4354221/posts",
    "timestamp": "2025-11-23T21:16:27Z"
  },
  {
    "title": "Rule by Project 2025",
    "description": "It’s so great that the media took Trump’s claims that Project 2025’s architects wouldn’t rule his administration seriously…. The environmental rollbacks came one after the next this week, potentially affecting everything from the survival of rare whales to th…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/rule-by-project-2025",
    "timestamp": "2025-11-23T21:16:00Z"
  },
  {
    "title": "Israel eliminates Hezbollah's top military commander Haytham Ali Tabatabai in targeted Beirut strike",
    "description": "Israeli strike kills Hezbollah chief of staff Haytham Ali Tabatabai in Beirut as Israeli Prime Minister Benjamin Netanyahu calls him a \"mass murderer\" with $5 million bounty on his head.",
    "link": "https://www.foxnews.com/world/israel-eliminates-hezbollahs-top-military-commander-haytham-ali-tabatabai-targeted-beirut-strike",
    "timestamp": "2025-11-23T21:10:01Z"
  },
  {
    "title": "Crypto Crash Is Eroding Wealth for Trump’s Family and Followers",
    "description": "",
    "link": "https://biztoc.com/x/2a93650abf26a760",
    "timestamp": "2025-11-23T21:09:53Z"
  },
  {
    "title": "Trump set to propose framework to fix Obamacare subsidies",
    "description": "President Donald Trump is expected to announce, as early as Monday, a general framework to address health care costs, calling on Congress to send a bill to his desk that would halt Affordable Care Act premium spikes, according to two White House officials fam…",
    "link": "https://biztoc.com/x/276caae6391fc01b",
    "timestamp": "2025-11-23T21:09:40Z"
  },
  {
    "title": "Olympics Fair Games Nonprofit Denounces Trump Allies on LA28 Board, Says ICE Can’t Be Allowed at Games",
    "description": "\"LA28 cannot credibly claim to represent the working people of Los Angeles or stand with immigrant communities while letting MAGA enthusiasts sit at the table,\" the coalition says\nThe post Olympics Fair Games Nonprofit Denounces Trump Allies on LA28 Board, Sa…",
    "link": "https://www.thewrap.com/la28-board-trump-allies-fair-games-coalition/",
    "timestamp": "2025-11-23T21:08:44Z"
  },
  {
    "title": "“Got to be kidding me”: Crockett roasts MTG over resignation",
    "description": "The Texas congresswoman clowned Greene for being unable to \"take the heat.\"",
    "link": "https://www.salon.com/2025/11/23/got-to-be-kidding-me-crockett-roasts-mtg-over-resignation/",
    "timestamp": "2025-11-23T21:06:41Z"
  },
  {
    "title": "Trump’s DOGE now ‘doesn’t exist’ – Reuters",
    "description": "DOGE has disbanded, its functions and staff reportedly taken on by other sections of the US government, Reuters has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628262-doge-quietly-disbanded-reuters/",
    "timestamp": "2025-11-23T21:04:52Z"
  },
  {
    "title": "Captivity survivor: 'We dug a pit for food, we lived in starvation and fear'",
    "description": "Hamas captivity survivor Segev Kalfon tells of the relentless fear, even after his release from captivity, and the moving moments after his return to Israel.",
    "link": "https://www.israelnationalnews.com/news/418241",
    "timestamp": "2025-11-23T21:04:45Z"
  },
  {
    "title": "President Trump set to propose health care plan to fix Obamacare subsidies",
    "description": "President Trump set to propose health care plan to fix Obamacare subsidiesms.now",
    "link": "https://www.ms.now/news/trump-health-care-plan-obamacare-aca-subsidies",
    "timestamp": "2025-11-23T21:04:06Z"
  },
  {
    "title": "US hails 'tremendous progress' on Ukraine peace plan - but says negotiators 'need more time'",
    "description": "The US secretary of state has hailed a \"tremendous amount of progress\" on peace talks after the US and Ukraine delegations met in Geneva - but said that negotiators would \"need more time\".",
    "link": "https://news.sky.com/story/us-hails-tremendous-progress-on-ukraine-peace-plan-but-says-negotiators-need-more-time-13474651",
    "timestamp": "2025-11-23T21:04:00Z"
  },
  {
    "title": "EU fights for seat at the table as US–Ukraine talks advance",
    "description": "Ukraine's delegation also met with high-level officials from Britain, France and Germany",
    "link": "https://www.euractiv.com/news/eu-fights-for-seat-at-the-table-as-us-ukraine-talks-advance/",
    "timestamp": "2025-11-23T21:02:03Z"
  },
  {
    "title": "Democrats Love Epstein",
    "description": "Breaking news: The sun rose in the east today.  In an equally predictable development, Democrats screamed at Republicans for allegedly doing what Democrats actively perpetrate.... Read More\nThe post Democrats Love Epstein appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/11/23/democrats-love-epstein/",
    "timestamp": "2025-11-23T21:00:00Z"
  },
  {
    "title": "U.S. and Ukraine report making progress toward ending Russia-Ukraine war but provide scant details",
    "description": "Top U.S. and Ukrainian officials said Sunday they were making progress toward ending the Russia-Ukraine war but provided scant details as they discussed the American proposal to achieve peace despite concerns among many of Washington's European allies that th…",
    "link": "https://japantoday.com/category/world/ukraine-and-western-allies-meet-in-geneva-to-discuss-us-peace-plan",
    "timestamp": "2025-11-23T20:53:40Z"
  },
  {
    "title": "Bolsonaro says ankle monitor damage caused by paranoia",
    "description": "Brazil's convicted ex-president blames medication for tempering with his monitor under house arrest.",
    "link": "https://www.bbc.com/news/articles/c4gplp979j1o",
    "timestamp": "2025-11-23T20:49:58Z"
  },
  {
    "title": "European countries propose Ukraine peace plan radically different to Trump’s",
    "description": "Kyiv-friendly counterproposal for ending war omits a number of pro-Russia points",
    "link": "https://www.irishtimes.com/world/europe/2025/11/23/european-countries-propose-ukraine-peace-plan-radically-different-to-trumps/",
    "timestamp": "2025-11-23T20:48:42Z"
  },
  {
    "title": "WATCH: Behind the scenes with ICE in sanctuary state that endangers agents and children",
    "description": "'We've been getting attacked for almost a year now, right? Our officers, our agents, our law enforcement partners that are here supporting us, they’re being followed. They're being doxed'",
    "link": "https://www.wnd.com/2025/11/watch-behind-scenes-ice-sanctuary-state-that-endangers/",
    "timestamp": "2025-11-23T20:48:03Z"
  },
  {
    "title": "Bolsonaro says ankle monitor tampering driven by ‘paranoia’",
    "description": "Brazil’s former president Jair Bolsonaro, detained after allegedly using a soldering iron on his court-ordered ankle monitor, argued Sunday that a state of “paranoia” had led him to tamper with the device. The 70-year-old was taken to prison on Saturday from …",
    "link": "https://www.digitaljournal.com/world/bolsonaro-says-ankle-monitor-tampering-driven-by-paranoia/article",
    "timestamp": "2025-11-23T20:42:20Z"
  },
  {
    "title": "Mamdani stands by Trump criticism despite friendly White House meeting",
    "description": "New York City Mayor-elect Zohran Mamdani didn't back down in an interview that aired Sunday from past criticism that President Donald Trump acted like a despot and a fascist after a surprisingly friendly White House meeting between the two men. The newly elec…",
    "link": "https://japantoday.com/category/world/mamdani-stands-by-trump-criticism-despite-friendly-white-house-meeting",
    "timestamp": "2025-11-23T20:39:42Z"
  },
  {
    "title": "50 kidnapped Catholic school students in Nigeria escape",
    "description": "Fifty of the more than 300 students kidnapped from a Nigerian Catholic school last week have escaped and have been reunited with their parents, the Catholic Church and Christian Association of Nigeria (CAN) said on Sunday. But around 253 of those kidnapped, i…",
    "link": "https://japantoday.com/category/world/fifty-kidnapped-catholic-school-students-in-nigeria-escape1",
    "timestamp": "2025-11-23T20:39:31Z"
  },
  {
    "title": "DOGE no longer exists with eight months left on its charter",
    "description": "U.S. President Donald Trump's Department of Government Efficiency has disbanded with eight months left to its mandate, ending an initiative launched with fanfare as a symbol of Trump's pledge to slash the government's size but which critics say delivered few …",
    "link": "https://japantoday.com/category/world/exclusive-doge-%27doesn%27t-exist%27-with-eight-months-left-on-its-charter",
    "timestamp": "2025-11-23T20:39:13Z"
  },
  {
    "title": "G20 summit in South Africa ends with glaring absence of U.S. after Trump's boycott",
    "description": "The Group of 20 summit in South Africa ended Sunday with the glaring absence of the United States — the next country to lead the bloc — after the Trump administration boycotted the two days of talks involving leaders of the world's richest and top developing …",
    "link": "https://japantoday.com/category/world/the-g20-summit-in-south-africa-ends-with-the-glaring-absence-of-the-us-after-trump%27s-boycott",
    "timestamp": "2025-11-23T20:39:06Z"
  },
  {
    "title": "Democratic strategist calls Mamdani's Trump meeting 'weak' after tough campaign talk",
    "description": "NYC Mayor-elect Zohran Mamdani faced backlash from the left after his \"weak\" meeting with President Donald Trump, as one strategist called him out for backtracking on promises.",
    "link": "https://www.foxnews.com/media/democratic-strategist-calls-mamdanis-trump-meeting-weak-after-tough-campaign-talk",
    "timestamp": "2025-11-23T20:36:58Z"
  },
  {
    "title": "‘Total Capitulation’: Dem Senator Warns Fox News Trump-Backed Ukraine Peace Proposal Rivals ‘Neville Chamberlain Giving In to Hitler’",
    "description": "Sen. Warner said it would be a \"total capitulation\"for Ukraine to accept the reported peace deal, saying it would be like Chamberlain's infamous appeasement\nThe post ‘Total Capitulation’: Dem Senator Warns Fox News Trump-Backed Ukraine Peace Proposal Rivals ‘…",
    "link": "https://www.mediaite.com/politics/total-capitulation-dem-senator-warns-fox-news-trump-backed-ukraine-peace-proposal-rivals-neville-chamberlain-giving-in-to-hitler/",
    "timestamp": "2025-11-23T20:36:09Z"
  },
  {
    "title": "COP30 deal exposes fragile climate unity as U.S. steps back",
    "description": "In the final fractious hours of the U.N. climate summit in Brazil, when a deal to advance the world's fight against global warming was slipping out of reach, COP30 President Andre Correa do Lago reminded them about the cost of failure. This was the first inte…",
    "link": "https://japantoday.com/category/features/opinions/analysis-cop30-deal-exposes-fragile-climate-unity-as-us-steps-back",
    "timestamp": "2025-11-23T20:32:59Z"
  },
  {
    "title": "Elon Musk’s ambitious DOGE project ends in failure",
    "description": "Elon Musk’s highly publicized effort to overhaul federal government spending has come to an unexpected end, with the Department of Government Efficiency quietly shuttered eight months before its planned conclusion. The Tesla and SpaceX CEO’s ambitious cost-cu…",
    "link": "https://rollingout.com/2025/11/23/elon-musks-doge-project-ends-in-failure/",
    "timestamp": "2025-11-23T20:32:29Z"
  },
  {
    "title": "Mark Cuban Compares Daryl Morey To Donald Trump As Tensions Escalate",
    "description": "The longstanding rivalry between Dallas Mavericks owner Mark Cuban and former Houston Rockets general manager Daryl Morey has been a source of intrigue for NBA fans. This off-court feud, which began in 2014, underscores the intense competition that exists bey…",
    "link": "https://sports.yahoo.com/article/mark-cuban-compares-daryl-morey-202842631.html",
    "timestamp": "2025-11-23T20:28:42Z"
  },
  {
    "title": "Report: President Trump to Designate Muslim Brotherhood as Foreign Terrorist Organization",
    "description": "President Donald Trump is reportedly preparing to designate the Muslim Brotherhood as a foreign terrorist organization, according to a report.\nThe post Report: President Trump to Designate Muslim Brotherhood as Foreign Terrorist Organization appeared first on…",
    "link": "https://www.breitbart.com/politics/2025/11/23/report-president-trump-to-designate-muslim-brotherhood-as-foreign-terrorist-organization/",
    "timestamp": "2025-11-23T20:28:25Z"
  },
  {
    "title": "“JD Kirk”: Usha Vance Addresses Split Rumors After Ringless Photo Sparks Online Marriage Meltdown",
    "description": "\"I must get separated every weekend as I never wear my ring over the weekend.\"",
    "link": "https://www.boredpanda.com/jd-vance-wife-usha-addresses-split-rumors-after-spotted-without-ring/",
    "timestamp": "2025-11-23T20:26:51Z"
  },
  {
    "title": "Mamdani maintains Trump a ‘fascist’ despite cordial White House meeting",
    "description": "The incoming NYC mayor says he still believes the US president is a fascist, two days after they had a friendly meeting.",
    "link": "https://www.aljazeera.com/news/2025/11/23/mamdani-maintains-trump-a-fascist-despite-cordial-white-house-meeting",
    "timestamp": "2025-11-23T20:22:44Z"
  },
  {
    "title": "Nigeria: 50 children escape after Catholic school kidnapping",
    "description": "A Christian group has announced that at least 50 of the more than 300 children snatched by gunmen from a Catholic school in Nigeria have fled from their captors.",
    "link": "https://www.dw.com/en/nigeria-50-children-escape-after-catholic-school-kidnapping/a-74855166",
    "timestamp": "2025-11-23T20:16:00Z"
  },
  {
    "title": "Who is Shedeur Sanders? NFL legend's son with one of the wackiest starts to a pro career yet",
    "description": "Shedeur Sanders' path from Colorado success under father Deion Sanders to Cleveland Browns backup quarterback includes family drama, draft controversy, and off-field issues.",
    "link": "https://www.foxnews.com/sports/who-shedeur-sanders-nfl-legends-son-one-wackiest-starts-pro-career-yet",
    "timestamp": "2025-11-23T20:14:38Z"
  },
  {
    "title": "Jasmine Crockett Says Marjorie Taylor Greene Fanned 'The Flames Of Hate' And Now Can't Take It",
    "description": "The two lawmakers have had a longstanding feud, and now Crockett is saying Greene can't take the heat she once instigated.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-marjorie-taylor-greene-cant-take-the-heat-from-trump_n_69235166e4b0ba57449cef22",
    "timestamp": "2025-11-23T20:13:27Z"
  },
  {
    "title": "Georgia GOP Thanks Greene, as Trump Says She ‘Went Bad’",
    "description": "THE CENTER SQUARE—Less than 24 hours after the surprise resignation of U.S. Rep. Marjorie Taylor Greene, the Georgia Republican received thanks from the state Republican... Read More\nThe post Georgia GOP Thanks Greene, as Trump Says She ‘Went Bad’ appeared fi…",
    "link": "https://www.dailysignal.com/2025/11/23/georgia-gop-thanks-greene-as-trump-says-she-went-bad/",
    "timestamp": "2025-11-23T20:09:32Z"
  },
  {
    "title": "Pete Hegseth's Army Recruitment Video Is Problematic",
    "description": "Hegseth wants soldiers to be warriors. The internet wants to know… for what?",
    "link": "https://cafemom.com/entertainment/pete-hegseths-army-recruitment-video",
    "timestamp": "2025-11-23T20:08:51Z"
  },
  {
    "title": "Rubio Speaks Out Amid Flap Over Peace Plan — Claims Latest Meeting With Ukraine ‘Most Productive’ to Date",
    "description": "Marco Rubio said from Geneva, Switzerland, Sunday that his latest meeting on ending the Russia-Ukraine war was the \"most productive\" so far.\nThe post Rubio Speaks Out Amid Flap Over Peace Plan — Claims Latest Meeting With Ukraine ‘Most Productive’ to Date fir…",
    "link": "https://www.mediaite.com/media/news/rubio-speaks-out-amid-flap-over-peace-plan-claims-latest-meeting-with-ukraine-most-productive-to-date/",
    "timestamp": "2025-11-23T20:05:38Z"
  },
  {
    "title": "'They’re getting ready for war' Ex-Antifa reveals inside the far-left | Documentary",
    "description": "In recent years, America has seen a wave of far-Left violence, from the murder of Charlie Kirk, to the shooting at an ICE facility in Texas; from attempts on Donald Trump’s life, to the killing of a healthcare CEO. Across the country, radical activists claim …",
    "link": "https://freerepublic.com/focus/f-bloggers/4354210/posts",
    "timestamp": "2025-11-23T20:04:56Z"
  },
  {
    "title": "'They’re getting ready for war' Ex-Antifa reveals inside the far-left | Documentary",
    "description": "In recent years, America has seen a wave of far-Left violence, from the murder of Charlie Kirk, to the shooting at an ICE facility in Texas; from attempts on Donald Trump’s life, to the killing of a healthcare CEO. Across the country, radical activists claim …",
    "link": "https://freerepublic.com/focus/f-news/4354210/posts",
    "timestamp": "2025-11-23T20:04:56Z"
  },
  {
    "title": "Strange weekend political developments",
    "description": "There were two surprises last Friday. One was the meeting between New York City mayor-elect Zohran Mamdani and Trump. Given that the former had referred to the latter as a despot and fascist and Trump in return had called him a lunatic communist, you might ha…",
    "link": "https://freethoughtblogs.com/singham/2025/11/23/strange-weekend-political-developments/",
    "timestamp": "2025-11-23T20:03:13Z"
  },
  {
    "title": "WEEKLY PREVIEW: Ukraine peace efforts intensify ahead of Thanksgiving",
    "description": "The revived efforts for a settlement of the war in Ukraine are expected to be in focus in the coming days after United States President Donald Trump said he hoped a deal could be reached by Thursday, ...",
    "link": "https://biztoc.com/x/5210b0926d6a7a39",
    "timestamp": "2025-11-23T20:02:25Z"
  }
]