[
  {
    "title": "Treasury Secretary Says East Wing Demolition Is Fine Because There 'Could Have' Been Mold",
    "description": "He also called Trump a \"master builder.\"",
    "link": "https://www.huffpost.com/entry/treasury-secretary-scott-bessent-east-wing-demolition-mold_n_68fe7dbce4b0049ce5fd3e40",
    "timestamp": "2025-10-26T21:36:12Z"
  },
  {
    "title": "Trump Says He Won't Meet With Putin Until There's A Deal On Ukraine",
    "description": "Trump Says He Won't Meet With Putin Until There's A Deal On Ukraine\n \nAuthored by Jacki Thrapp via The Epoch Times,\nPresident Donald Trump said on Oct 25 that he doesn’t plan to meet with Russian President Vladimir Putin until a peace deal with Ukraine is rea…",
    "link": "https://biztoc.com/x/1f1e010928db8cf9",
    "timestamp": "2025-10-26T21:35:12Z"
  },
  {
    "title": "US, China say trade deal close",
    "description": "KUALA LUMPUR, Malaysia — A trade deal between the United States and China is drawing closer, officials from the world’s two largest economies said Sunday as they reached an initial consensus for President Donald Trump and Chinese leader Xi Jinping to aim to f…",
    "link": "https://biztoc.com/x/1f11cfa37c7458e2",
    "timestamp": "2025-10-26T21:35:10Z"
  },
  {
    "title": "US, China say trade deal close",
    "description": "A trade deal between the United States and China is drawing closer, officials from the world's two largest economies said Sunday as they reached an initial consensus for President Donald Trump and Chinese leader Xi Jinping to aim to finalize during their high…",
    "link": "https://www.bostonherald.com/2025/10/26/us-china-say-trade-deal-close/",
    "timestamp": "2025-10-26T21:30:13Z"
  },
  {
    "title": "‘We’ve Got to Do Something!’ GOP Lawmakers Call Out Party’s ‘Morally Bankrupt’ Inaction On Health Care Costs - NewsBreak",
    "description": "Republican lawmakers are call over the prospect of not having a plan in place to lower health care costs, as Democrats continue to dig in their heels over",
    "link": "https://www.newsbreak.com/share/4315126795865-we-ve-got-to-do-something-gop-lawmakers-call-out-party-s-morally-bankrupt-inaction-on-health-care-costs?s=a2&amp;share_destination_id=MjMxOTYxNzUtMTc2MTUxNDE1OTMxMw%3D%3D&amp;pd=01ZKNrmo&amp;hl=en_US&amp;send_time=1761514159&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.43.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-26T21:30:05Z"
  },
  {
    "title": "For Japan's new leader, the key to a good relationship with Trump could come in a Ford F-150 truck",
    "description": "President Donald Trump arrives Monday in Japan where new Prime Minister Sanae Takaichi is banking on building a friendly personal relationship with the U.S. leader to ease trade tensions. One key to this strategy might lie in an idea floated by Japan’s govern…",
    "link": "https://japantoday.com/category/politics/for-japan%27s-new-leader-the-key-to-a-good-relationship-with-trump-could-come-in-a-ford-f-150-truck",
    "timestamp": "2025-10-26T21:24:28Z"
  },
  {
    "title": "Dem star makes stunning prediction about this GOP leader's impact on Trump's 2028 decision",
    "description": "California Gov. Gavin Newsom, who has become a star in the Democratic Party, warned on Sunday that there is a GOP leader who could decide the fate of President Donald Trump's attempts to serve a third term in 2028 during an interview with CNN. Newsom predicte…",
    "link": "https://www.rawstory.com/gavin-newsom-2674234406/",
    "timestamp": "2025-10-26T21:23:51Z"
  },
  {
    "title": "Trump's redistricting push hits roadblocks in Indiana and Kansas as Republican lawmakers resist",
    "description": "For most of President Donald Trump's second term, Republicans have bent to his will. But in two Midwestern states, Trump's plan to maintain control of the U.S. House in next year’s election by having Republicans redraw congressional districts has hit a roadbl…",
    "link": "https://japantoday.com/category/world/trump%27s-redistricting-push-hits-roadblocks-in-indiana-and-kansas-as-republican-lawmakers-resist",
    "timestamp": "2025-10-26T21:23:49Z"
  },
  {
    "title": "Argentina votes in midterm elections set to test President Milei's mandate and U.S. support",
    "description": "On the northern bank of Argentina’s Riachuelo River, luxury car dealerships report sales surging since libertarian President Javier Milei scrapped import restrictions. Streets in the Puerto Madero financial district in Buenos Aires bustle with bankers who pra…",
    "link": "https://japantoday.com/category/world/argentina-votes-in-midterm-elections-set-to-test-president-milei%27s-mandate-and-us-support",
    "timestamp": "2025-10-26T21:23:33Z"
  },
  {
    "title": "Democratic Gov Newsom of California says he'll consider presidential run after 2026 midterms",
    "description": "California Gov. Gavin Newsom, a leading Democratic critic of President Donald Trump, says he will consider running for the White House in 2028 after the midterm elections next year. Asked in an interview with “CBS Sunday Morning” whether if would be fair to s…",
    "link": "https://japantoday.com/category/world/democratic-gov.-gavin-newsom-of-california-says-he%27ll-consider-presidential-run-after-2026-midterms",
    "timestamp": "2025-10-26T21:23:27Z"
  },
  {
    "title": "Russia has tested a new nuclear-capable missile, Putin and top general say",
    "description": "Russia tested a new nuclear-capable and powered cruise missile fit to confound existing defenses, inching closer to deploying it to its military, President Vladimir Putin said in remarks released on Sunday. The announcement, which followed years of tests of t…",
    "link": "https://japantoday.com/category/world/russia-has-tested-a-new-nuclear-capable-missile-putin-and-top-general-say",
    "timestamp": "2025-10-26T21:23:21Z"
  },
  {
    "title": "U.S., China talks sketch out rare earths deal, tariff pause for Trump and Xi to consider",
    "description": "BTop Chinese and U.S. economic officials on Sunday hashed out the framework of a trade deal for U.S. President Donald Trump and Chinese President Xi Jinping to decide on later this week that would pause steeper American tariffs and Chinese rare earths export …",
    "link": "https://japantoday.com/category/world/us-china-talks-sketch-out-rare-earths-tariff-pause-for-trump-and-xi-to-consider",
    "timestamp": "2025-10-26T21:23:04Z"
  },
  {
    "title": "Novartis to acquire Avidity Biosciences for about $12 billion",
    "description": "(Fixes timeframe in last paragraph to \"In July\") By Padmanabhan Ananthan and Angela Christy M (Reuters) -Swiss drugmaker Novartis on Sunday said it agreed to...",
    "link": "https://finance.yahoo.com/news/novartis-acquire-avidity-biosciences-12-211946494.html",
    "timestamp": "2025-10-26T21:19:46Z"
  },
  {
    "title": "All Jewish councils in key New Jersey area endorse Jack Ciattarelli for governor: report",
    "description": "Orthodox Jewish leaders across Ocean County unite behind Republican Jack Ciattarelli in historic first for New Jersey politics, forming influential coalition.",
    "link": "https://www.foxnews.com/politics/all-jewish-councils-key-new-jersey-area-endorse-jack-ciattarelli-governor-report",
    "timestamp": "2025-10-26T21:12:45Z"
  },
  {
    "title": "Trump Re-Ups Jarring All-Caps Warning to Pregnant Women: ‘DON’T USE TYLENOL UNLESS ABSOLUTELY NECESSARY!’",
    "description": "Donald Trump took a moment out of his week-long trip to Asia to warn pregnant women once again about Tylenol and childhood vaccines.\nThe post Trump Re-Ups Jarring All-Caps Warning to Pregnant Women: ‘DON’T USE TYLENOL UNLESS ABSOLUTELY NECESSARY!’ first appea…",
    "link": "https://www.mediaite.com/media/news/trump-re-ups-jarring-all-caps-warning-to-pregnant-women-dont-use-tylenol-unless-absolutely-necessary/",
    "timestamp": "2025-10-26T21:04:22Z"
  },
  {
    "title": "Federal workers flock to D.C. food bank as they miss first full paycheck of shutdown",
    "description": "Federal workers lined up around the corner outside of the Capital Area Food Bank in Southeast Washington, D.C., on Friday after missing their first full paycheck since the now 24-day government shutdown began. The food bank, set up specifically for federal wo…",
    "link": "https://freerepublic.com/focus/f-news/4348779/posts",
    "timestamp": "2025-10-26T21:00:02Z"
  },
  {
    "title": "Report: State Department Officially Dismantled 'Disinformation' Agency",
    "description": "The State Department has officially canceled the Global Engagement Center (GEC) as part of President Donald Trump's mission to shut down the \"censorship industrial complex,\" according to a report.\nThe post Report: State Department Officially Dismantled ‘Disin…",
    "link": "https://www.breitbart.com/politics/2025/10/26/report-state-department-officially-dismantled-disinformation-agency/",
    "timestamp": "2025-10-26T20:52:11Z"
  },
  {
    "title": "These Tech CEOs Campaign to Stop Donald Trump From Sending Troops to San Francisco",
    "description": "President Donald Trump has retracted his decision to initiate a law-enforcement “surge” in San Francisco. This change comes after engaging in discussions with San Francisco’s Mayor Daniel Lurie and CEOs of prominent tech companies in the Bay Area, including N…",
    "link": "https://biztoc.com/x/6199baea7374eaf2",
    "timestamp": "2025-10-26T20:51:15Z"
  },
  {
    "title": "November 1st Deadline: When 42 Million Americans Suddenly Have Their Food Stamp Benefits Shut Off, What Do You Think Is Going To Happen?",
    "description": "Approximately 1 out of every 8 U.S. residents in on food stamps. So how do you think they are going to react when their EBT cards suddenly don’t work anymore? The government shutdown has already been going on for 25 days, and there is no end in sight. The Dem…",
    "link": "http://theeconomiccollapseblog.com/november-1st-deadline-when-42-million-americans-suddenly-have-their-food-stamps-shut-off-what-do-you-think-is-going-to-happen/",
    "timestamp": "2025-10-26T20:51:04Z"
  },
  {
    "title": "Bessent says U.S. and China have reached framework in tariff negotiations (Nicholas Kerr/Associated Press)",
    "description": "Nicholas Kerr / Associated Press:\nBessent says U.S. and China have reached framework in tariff negotiations  —  Treasury secretary also alluded to deals on rare earth minerals and soybeans.  —  Treasury Secretary Scott Bessent listens as Donald Trump speaks b…",
    "link": "https://www.memeorandum.com/251026/p49",
    "timestamp": "2025-10-26T20:50:00Z"
  },
  {
    "title": "“Rigged and stolen”: Trump calls for ban on mail-in, early voting ahead of midterms",
    "description": "The president urged his party to put an end to mail-in ballots and early voting before the midterms.",
    "link": "https://www.salon.com/2025/10/26/rigged-and-stolen-trump-calls-for-ban-on-mail-in-early-voting-ahead-of-midterms/",
    "timestamp": "2025-10-26T20:47:48Z"
  },
  {
    "title": "Canadians ditch once-popular Trump Halloween costumes this year amid trade war",
    "description": "Demand for Trump Halloween costumes was high when the U.S. president was first campaigning against Democrat Hillary Clinton in 2016, Canadian costume shop owners say, but it has since fallen in recent years.",
    "link": "https://www.cbc.ca/news/canada/trump-costumes-halloween-canada-9.6954347",
    "timestamp": "2025-10-26T20:43:40Z"
  },
  {
    "title": "Egypt and Red Cross join search for hostage bodies in Gaza",
    "description": "Israel said the teams have been permitted to search beyond the so-called \"yellow line\" in the area controlled by its forces in Gaza.",
    "link": "https://www.bbc.com/news/articles/cx2l0mjkjkvo",
    "timestamp": "2025-10-26T20:39:24Z"
  },
  {
    "title": "‘We’ve Got to Do Something!’ GOP Lawmakers Call Out Party’s ‘Morally Bankrupt’ Inaction On Health Care Costs - NewsBreak",
    "description": "Republican lawmakers are call over the prospect of not having a plan in place to lower health care costs, as Democrats continue to dig in their heels over",
    "link": "https://www.newsbreak.com/share/4315126795865-we-ve-got-to-do-something-gop-lawmakers-call-out-party-s-morally-bankrupt-inaction-on-health-care-costs?s=a2&amp;share_destination_id=MzMxMTY1NjU2LTE3NjE1MTA5MzIzOTM%3D&amp;pd=0MPXJYvo&amp;hl=en_US&amp;send_time=1761510932&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.43.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-26T20:37:41Z"
  },
  {
    "title": "US docks warship in Caribbean",
    "description": "A U.S. warship docked in Trinidad and Tobago 's capital Sunday as the Trump administration boosts military pressure on neighboring Venezuela and its President Nicolás Maduro.",
    "link": "https://www.bostonherald.com/2025/10/26/us-docks-warship-in-caribbean/",
    "timestamp": "2025-10-26T20:35:54Z"
  },
  {
    "title": "Gaza Tribunal calls for ‘Israeli perpetrators and enablers’ to face justice",
    "description": "The tribunal's message came as it released its genocide verdict following four days of public hearings in Istanbul.",
    "link": "https://www.aljazeera.com/news/2025/10/26/gaza-tribunal-calls-for-israeli-perpetrators-and-enablers-to-face-justice",
    "timestamp": "2025-10-26T20:30:45Z"
  },
  {
    "title": "Bill Clinton once called the White House movie theater the ‘best perk’ of the job. It was destroyed this week",
    "description": "One of the stars of the White House is no more. The White House Family Theater, the movie theater which first came to be in 1942 when a cloakroom was converted into a screening room, was demolished this week as part of the destruction of the East Wing to make…",
    "link": "https://freerepublic.com/focus/f-chat/4348775/posts",
    "timestamp": "2025-10-26T20:30:44Z"
  },
  {
    "title": "‘Have You Apologized?’ MSNBC’s Host Stops Karine Jean-Pierre Cold With Tough Question On Biden’s Cognitive Decline",
    "description": "Ex-Biden Press Secretary Karine Jean-Pierre was left scrambling for an answer when MSNBC anchor Elise Jordan pressed her on the \"mental acuity\" of her old boss\nThe post ‘Have You Apologized?’ MSNBC’s Host Stops Karine Jean-Pierre Cold With Tough Question On B…",
    "link": "https://www.mediaite.com/media/have-you-apologized-msnbcs-host-stops-karine-jean-pierre-cold-with-tough-question-on-bidens-cognitive-decline/",
    "timestamp": "2025-10-26T20:27:28Z"
  },
  {
    "title": "Qld is rich in critical minerals. What will it gain from the Trump deal?",
    "description": "A multi-billion-dollar critical minerals partnership between Australia and the US is touted as a landmark industry deal and is expected to speed up projects in minerally rich outback Queensland.",
    "link": "https://www.abc.net.au/news/2025-10-27/what-trump-critical-minerals-deal-means-for-north-west-qld/105928800",
    "timestamp": "2025-10-26T20:22:20Z"
  },
  {
    "title": "Jeffries spars with CBS host on claims the upcoming midterms will be 'rigged elections'",
    "description": "House Minority Leader Hakeem Jeffries defended his claims that redistricting could \"rig\" the midterm elections during a CBS \"Face the Nation\" interview.",
    "link": "https://www.foxnews.com/media/jeffries-spars-cbs-host-claims-upcoming-midterms-rigged-elections",
    "timestamp": "2025-10-26T20:19:43Z"
  },
  {
    "title": "Scaramucci Expresses Support for Pardoned Changpeng Zhao: 'I Supported CZ Prior to His Sentencing and Wrote on His Behalf'",
    "description": "In a post on X, Anthony Scaramucci expressed his support for the recently pardoned Binance CEO Changpeng Zhao.\nScaramucci, a well-known figure in the finance world, took to X on Saturday to voice his support for CZ, who was recently pardoned by President Dona…",
    "link": "https://biztoc.com/x/b9655ce8f0e93095",
    "timestamp": "2025-10-26T20:17:55Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fox-26-10-25-6857434-Oct2025/",
    "timestamp": "2025-10-26T20:15:10Z"
  },
  {
    "title": "For Japan’s new leader, the key to a good relationship with Trump could come in a Ford F-150 truck",
    "description": "TOKYO (AP) — President Donald Trump arrives Monday in Japan where new Prime Minister Sanae Takaichi is banking on building a friendly personal relationship with the U.S. leader to ease trade tensions. One key to this strategy might lie in an idea floated by J…",
    "link": "https://financialpost.com/pmn/for-japans-new-leader-the-key-to-a-good-relationship-with-trump-could-come-in-a-ford-f-150-truck",
    "timestamp": "2025-10-26T20:14:56Z"
  },
  {
    "title": "STEVE MILLOY: Trump Moves To Break US Dependence On Communist China",
    "description": "It’s great news that the Trump administration agreed this week with Australia to take steps toward breaking Communist China’s chokehold on rare earth minerals.",
    "link": "https://dailycaller.com/2025/10/26/opinion-trump-moves-to-break-us-dependence-on-communist-china-steve-milloy/",
    "timestamp": "2025-10-26T20:14:15Z"
  },
  {
    "title": "Trump Reaches Trade Pacts With Southeast Asian Nations - The Wall Street Journal",
    "description": "Trump Reaches Trade Pacts With Southeast Asian NationsThe Wall Street Journal Trump Leans Into Showmanship on Day 1 of His Asia TripThe New York Times Donald Trump dances in Malaysia as Asia trip kicks offUSA Today Trump’s Visit Spurs Hopes for Least-Loved Em…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179878346",
    "timestamp": "2025-10-26T20:12:28Z"
  },
  {
    "title": "For Japan's new leader, the key to a good relationship with Trump could come in a Ford F-150 truck",
    "description": "President Donald Trump arrives Monday in Japan where new Prime Minister Sanae Takaichi is banking on building a friendly personal relationship with the U.S. ...",
    "link": "https://www.yahoo.com/news/articles/japans-leader-key-good-relationship-201157330.html",
    "timestamp": "2025-10-26T20:11:57Z"
  },
  {
    "title": "Democratic Gov. Gavin Newsom says he'll consider presidential run after 2026 midterms",
    "description": "California Gov. Gavin Newsom, a leading Democratic critic of President Donald Trump, says he'll consider running for the White House in 2028 after the midterm elections next year",
    "link": "https://abcnews.go.com/Politics/wireStory/democratic-gov-gavin-newsom-california-hell-presidential-run-126881574",
    "timestamp": "2025-10-26T20:01:35Z"
  },
  {
    "title": "‘We’ve Got to Do Something!’ GOP Lawmakers Call Out Party’s ‘Morally Bankrupt’ Inaction On Health Care Costs - NewsBreak",
    "description": "Republican lawmakers are call over the prospect of not having a plan in place to lower health care costs, as Democrats continue to dig in their heels over",
    "link": "https://www.newsbreak.com/share/4315126795865-we-ve-got-to-do-something-gop-lawmakers-call-out-party-s-morally-bankrupt-inaction-on-health-care-costs?s=a2&amp;share_destination_id=NTI0MjYxNDEtMTc2MTUwODg1NjgxNg%3D%3D&amp;pd=03XyQvHt&amp;hl=en_US&amp;send_time=1761508856&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.43.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-26T20:01:33Z"
  },
  {
    "title": "Kyrgyzstan Partners With Binance To Launch National Stablecoin – Details",
    "description": "Kyrgyzstan has rolled out a national stablecoin in collaboration with the world’s biggest exchange, Binance. This action represents one of many significant developments following multiple contacts between the Central Asian nation and Binance co-founder and fo…",
    "link": "https://bitcoinist.com/kyrgyzstan-partners-binance-on-national-stablecoin/",
    "timestamp": "2025-10-26T20:00:36Z"
  },
  {
    "title": "WATCH: Military CRISIS Hits Venezuela, Is Donald Trump Preparing For WAR?",
    "description": "WATCH: Military CRISIS Hits Venezuela, Is Donald Trump Preparing For WAR?\nThe post WATCH: Military CRISIS Hits Venezuela, Is Donald Trump Preparing For WAR? appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/watch-military-crisis-hits-venezuela-is-donald-trump/",
    "timestamp": "2025-10-26T20:00:06Z"
  },
  {
    "title": "“I Am Not Done”: Harris and Newsom Both Weigh White House Runs After 2026",
    "description": "Both former Vice President Kamala Harris and Democrat California Gov. Gavin Newsom said this weekend that they will consider running for president after the 2026... Read More\nThe post “I Am Not Done”: Harris and Newsom Both Weigh White House Runs After 2026 a…",
    "link": "https://www.dailysignal.com/2025/10/26/i-am-not-done-harris-and-newsom-both-weigh-white-house-runs-after-2026/",
    "timestamp": "2025-10-26T20:00:00Z"
  },
  {
    "title": "The Irish Times view on Cop30: climate progress in peril",
    "description": "Donald Trump is at the vanguard of a global populist right movement that is climate change sceptic",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/10/26/the-irish-times-view-on-cop30-climate-progress-in-peril/",
    "timestamp": "2025-10-26T20:00:00Z"
  },
  {
    "title": "Eric Swalwell Wants Candidate Litmus Test: Must Pledge to Demolish the Trump Ballroom",
    "description": "Rep. Eric Swalwell (D-CA) has become the latest to succumb to what Trump supporters are now calling “BDS” – Ballroom Derangement Syndrome.\nThe post Eric Swalwell Wants Candidate Litmus Test: Must Pledge to Demolish the Trump Ballroom appeared first on Breitba…",
    "link": "https://www.breitbart.com/politics/2025/10/26/eric-swalwell-wants-candidate-litmus-test-must-pledge-to-demolish-the-trump-ballroom/",
    "timestamp": "2025-10-26T19:58:03Z"
  },
  {
    "title": "Harris, Newsom jockey for 2028",
    "description": "Just 10 months into President Donald Trump’s second term, key Democrats are already starting to look ahead to the race to replace him in 2028.",
    "link": "https://www.bostonherald.com/2025/10/26/harris-newsom-jockey-for-2028/",
    "timestamp": "2025-10-26T19:57:38Z"
  },
  {
    "title": "US sanctions harm prospects for restoring relations – Kremlin",
    "description": "Despite new US sanctions against Russian oil companies, Moscow would like to revive bilateral ties, Kremlin spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626989-kremlin-peskov-trump-new-sanctions-russia/",
    "timestamp": "2025-10-26T19:57:09Z"
  },
  {
    "title": "Donald Trump dances in Malaysia as Asia trip kicks off",
    "description": "Donald Trump danced with performers as he disembarked from Air Force One in Malaysia for the first stop of his tour in Asia.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/26/donald-trump-dance-malaysia/86917010007/",
    "timestamp": "2025-10-26T19:57:04Z"
  },
  {
    "title": "Scott Bessent Mocked by Left for Saying He Feels the ‘Pain’ of Soybean Farmers Because He is One: ‘Net Worth is Over $500 Million’",
    "description": "Liberals are taking to social media to call out Treasury Secretary Scott Bessent for claiming he feels the \"pain\" of soybean farmers because he's one of them.\nThe post Scott Bessent Mocked by Left for Saying He Feels the ‘Pain’ of Soybean Farmers Because He i…",
    "link": "https://www.mediaite.com/media/news/scott-bessent-mocked-by-left-for-saying-he-feels-the-pain-of-soybean-farmers-because-he-is-one-net-worth-is-over-500-million/",
    "timestamp": "2025-10-26T19:56:15Z"
  },
  {
    "title": "U.S., China Agree to Trade Deal Framework",
    "description": "State of the Union: The deal, whose details have yet to be finalized, will end the ongoing trade war between the two superpowers.\nThe post U.S., China Agree to Trade Deal Framework appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/u-s-china-agree-to-trade-deal-framework/",
    "timestamp": "2025-10-26T19:50:00Z"
  },
  {
    "title": "Hamas expands search for remains of hostages in Gaza as Egypt deploys team to help",
    "description": "Under the U.S.-brokered ceasefire, which took effect on Oct. 10, Hamas is expected to return the remains of all Israeli hostages as soon as possible. Israel has agreed to return 15 bodies of Palestinians for each one.",
    "link": "https://www.pbs.org/newshour/world/hamas-expands-search-for-remains-of-hostages-in-gaza-as-egypt-deploys-team-to-help",
    "timestamp": "2025-10-26T19:48:12Z"
  },
  {
    "title": "Election of the Day",
    "description": "Javier Milei is not on the ballot today; this is something of an American-style midterm election. But of course his agenda and leadership, and assessments thereof, will obviously play a major role in today’s outcome. As with the US, 1/3 of the Argentinian Sen…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/election-of-the-day-2",
    "timestamp": "2025-10-26T19:46:49Z"
  },
  {
    "title": "US warship arrives in Trinidad and Tobago - as Venezuela hits out at 'military provocation'",
    "description": "Government officials in Trinidad and Tobago and from the US say the warship will remain in Trinidad until Thursday for training exercises. Meanwhile, Venezuela claims it captured a group of mercenaries who intended to carry out a false flag attack in the regi…",
    "link": "https://news.sky.com/story/us-warship-arrives-in-trinidad-and-tobago-as-venezuela-hits-out-at-military-provocation-13458445",
    "timestamp": "2025-10-26T19:46:00Z"
  },
  {
    "title": "U.S. and China say trade deal drawing closer as Trump and Xi prepare for high-stakes meeting",
    "description": "A trade deal between the United States and China is drawing closer, officials from the world’s two largest economies said Sunday as they reached an initial consensus for President Donald Trump and Chinese leader Xi Jinping to aim to finalize during their high…",
    "link": "https://biztoc.com/x/7598cd1fa42333b2",
    "timestamp": "2025-10-26T19:44:46Z"
  },
  {
    "title": "Swiss drugmaker Novartis to buy Avidity Biosciences for $12 billion",
    "description": "Swiss drugmaker Novartis agreed to acquire U.S. biotech firm Avidity Biosciences for about $12 billion.",
    "link": "https://www.usatoday.com/story/money/2025/10/26/novartis-to-acquire-biotech-for-12-billion/86918280007/",
    "timestamp": "2025-10-26T19:43:33Z"
  },
  {
    "title": "Sen. Murphy: Trump Wants Shutdown 'Because He Thinks He Can Exercise King-Like Powers'",
    "description": "Twenty-six days into the shutdown, US Sen. Chris Murphy argued on CNN's \"State of the Union\" Sunday that President Donald Trump \"is refusing to negotiate... because he likes the fact that the government is closed, because he thinks he can exercise king-like p…",
    "link": "https://www.commondreams.org/news/chris-murphy-trump",
    "timestamp": "2025-10-26T19:41:34Z"
  },
  {
    "title": "The Tariff Scandal Based on a Doctored Ad Is Going to Cost Canada a Lot",
    "description": "Canada FAFO. Canada really messed up and they soon were under the eye of President Trump. A Canadian politician put together an ad against tariffs to air in the US. The problem is the ad was a lie. It actually takes gall to be so dishonest @benryanwriter “Her…",
    "link": "https://joehoft.com/the-tariff-scandal-based-on-a-doctored-ad-is-going-to-cost-canada-a-lot/",
    "timestamp": "2025-10-26T19:40:02Z"
  },
  {
    "title": "U.S. and China say trade deal drawing closer as Trump and Xi prepare for high-stakes meeting",
    "description": "A trade deal between the United States and China is drawing closer, officials from the world’s two largest economies said Sunday as they reached an initial consensus for President Donald Trump and Chinese leader Xi Jinping to aim to finalize during their high…",
    "link": "https://www.pbs.org/newshour/world/u-s-and-china-say-trade-deal-drawing-closer-as-trump-and-xi-prepare-for-high-stakes-meeting",
    "timestamp": "2025-10-26T19:37:24Z"
  },
  {
    "title": "PM to discuss trade, Trump and security at ASEAN summit",
    "description": "Anthony Albanese arrives in Kuala Lumpur, following in the footsteps of US President Donald Trump, who is also at the summit.",
    "link": "https://www.abc.net.au/news/2025-10-27/trade-trump-and-security-asean-summit-/105936256",
    "timestamp": "2025-10-26T19:35:06Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Secures Peace and Prosperity in Malaysia - The White House (.gov)",
    "description": "Fact Sheet: President Donald J. Trump Secures Peace and Prosperity in MalaysiaThe White House (.gov) Trump touts his peacemaking skills as Thailand and Cambodia sign ceasefire dealNBC News How to win prizes and lose influenceThe Economist Trump attends ceasef…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179878142",
    "timestamp": "2025-10-26T19:32:23Z"
  },
  {
    "title": "‘I See That Burn Coming From the Controllers’: Sec. Duffy Calls on Dems to End Government Shutdown",
    "description": "Air traffic controllers will miss their paycheck on Tuesday because the Democrat Party would rather keep the government closed than help Americans, Transportation Secretary Sean... Read More\nThe post ‘I See That Burn Coming From the Controllers’: Sec. Duffy C…",
    "link": "https://www.dailysignal.com/2025/10/26/i-see-that-burn-coming-from-the-controllers-sec-duffy-calls-on-dems-to-end-government-shutdown/",
    "timestamp": "2025-10-26T19:30:00Z"
  },
  {
    "title": "After Epstein Scandal, Former US Ambassador Lord Peter Mandelson Returns to Britain, Where Reports Suggest He May Be Writing a ‘Tell-All’ Memoir To Get Back at PM Keir Starmer",
    "description": "‘Petey’ is back in Britain, looking for a vengeance. And so it happens that Lord Peter Mandelson is back to Britain, after getting fired as US ambassador in the wake of the scandal caused by his emails to late pedophile Jeffrey Epstein. Instead of the glory h…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348761/posts",
    "timestamp": "2025-10-26T19:29:41Z"
  },
  {
    "title": "‘I’d be lying otherwise’: Newsom confirms he’s prepping run for president, calls Trump ‘an invasive species’",
    "description": "'It's an unf***ing-believable moment. All this anti-woke stuff is just anti-black. Period. Full stop'",
    "link": "https://www.wnd.com/2025/10/id-be-lying-otherwise-newsom-confirms-hes-prepping/",
    "timestamp": "2025-10-26T19:23:36Z"
  },
  {
    "title": "Dressing as Trump for Halloween not so funny in 2025, Canadian costume shops say",
    "description": "Dressing up as Donald Trump used to be hilarious for Halloween, say Canadian businesses that rent or sell costumes, but they say hardly anyone is finding the joke funny in 2025. “Certainly I haven’t set up somebody dressing up like Trump in a very long time,”…",
    "link": "https://financialpost.com/pmn/dressing-as-trump-for-halloween-not-so-funny-in-2025-canadian-costume-shops-say-2",
    "timestamp": "2025-10-26T19:21:10Z"
  },
  {
    "title": "Trump Urges DOJ to Investigate Dems With ‘Gusto’ Over 2020 Election — Swipes at NBA Gambling Scandal in Wild Truth Social Post",
    "description": "President Trump urged his DoJ to investigate Democrats over the 2020 election with \"as much 'gusto'\" as the feds investigated the NBA gambling scandal\nThe post Trump Urges DOJ to Investigate Dems With ‘Gusto’ Over 2020 Election — Swipes at NBA Gambling Scanda…",
    "link": "https://www.mediaite.com/media/news/trump-urges-doj-to-investigate-dems-with-gusto-over-2020-election-swipes-at-nba-gambling-scandal-in-wild-truth-social-post/",
    "timestamp": "2025-10-26T19:21:03Z"
  },
  {
    "title": "Republican lawmakers in these deep-red Midwestern states are blocking Trump’s redistricting push",
    "description": "Despite weeks of campaigning by the White House, Republicans in Indiana and Kansas say their party doesn't have enough votes to pass new, more GOP-friendly maps.",
    "link": "https://fortune.com/2025/10/26/republican-lawmakers-indiana-kansas-trump-redistricting-congress/",
    "timestamp": "2025-10-26T19:18:39Z"
  },
  {
    "title": "Rand Paul Rips 'Extrajudicial Killings' In Caribbean: 'Akin To What Iran Does'",
    "description": "Rand Paul continues to butt heads with the Trump administration over their lawless killings of supposed drug traffickers in the Caribbean:\nSen. Rand Paul (R-KY) blasted the Trump administration Sunday for its ongoing military strikes on suspected drug traffic…",
    "link": "https://crooksandliars.com/2025/10/rand-paul-rips-extrajudicial-killings",
    "timestamp": "2025-10-26T19:14:06Z"
  },
  {
    "title": "Gavin Newsom Admits He’ll Decide on a 2028 Presidential Bid After Midterms: ‘I’d Be Lying If I Said Otherwise’ | Video",
    "description": "\"I'm looking forward to who presents themselves in 2028 and who meets that moment,\" California's governor tells CBS Sunday Morning\nThe post Gavin Newsom Admits He’ll Decide on a 2028 Presidential Bid After Midterms: ‘I’d Be Lying If I Said Otherwise’ | Video …",
    "link": "https://www.thewrap.com/gavin-newsom-admits-hell-decide-on-a-2028-presidential-bid-after-midterms-id-be-lying-if-i-said-otherwise-video/",
    "timestamp": "2025-10-26T19:10:22Z"
  },
  {
    "title": "Despite Trump's anger, Canadian politicians won't say Ontario's anti-tariff ad was a mistake",
    "description": "Although an Ontario government anti-tariff advertisement has shredded Canada-U.S. trade talks, Canadian officials all the way from the municipal to the federal level are backing Ontario Premier Doug Ford’s approach and won’t say the ad was a mistake.",
    "link": "https://www.cbc.ca/news/politics/trump-tariff-advertisement-ontario-blowback-9.6954292",
    "timestamp": "2025-10-26T19:08:05Z"
  },
  {
    "title": "German Judge Calls Trump Admin “Fascist” as German Government Raids Homes, Files 50 Hate Speech cases A DAY",
    "description": "A German court ruled the Trump administration is “openly far-right” with “fascist tendencies” as German police raided several prominent conservative critics for alleged “Hate Speech” last week. Firing back, the US Embassy in Berlin warned of “censorship and o…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348757/posts",
    "timestamp": "2025-10-26T19:04:40Z"
  },
  {
    "title": "Trump: Millions of ballots being 'shipped' in California",
    "description": "United States President Donald Trump claimed on Sunday that \"millions of ballots are being 'shipped'\" in California's special election early voting.\"The 2020 Presidential Election, being Rigged and St...",
    "link": "https://biztoc.com/x/a0dd463e10a61fe5",
    "timestamp": "2025-10-26T19:01:03Z"
  },
  {
    "title": "Republican Jack Ciattarelli Barnstorming New Jersey in Final Days of Campaign",
    "description": "“We look forward to joining a coalition of organizations that are supporting Jack in the upcoming election and know that he is the right person to lead New Jersey in the right direction”\nThe post Republican Jack Ciattarelli Barnstorming New Jersey in Final Da…",
    "link": "https://legalinsurrection.com/2025/10/republican-jack-ciattarelli-barnstorming-new-jersey-in-final-days-of-campaign/",
    "timestamp": "2025-10-26T19:00:03Z"
  },
  {
    "title": "Will the Democrats Finally Have a Primary in 2028?",
    "description": "Democrats haven’t had a real primary since 2008, and I’m not bullish on the chances for a real contest in 2028, either. By contrast, Donald... Read More\nThe post Will the Democrats Finally Have a Primary in 2028? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/26/will-democrats-finally-have-primary-2028/",
    "timestamp": "2025-10-26T19:00:00Z"
  },
  {
    "title": "Trump Has Confirmed The CIA is Operating In Venezuela",
    "description": "United States ruler Donald Trump has confirmed that he’s authorized the CIA (Central Intelligence Agency) to conduct operations in Venezuela. Trump said the operations are covert in nature and will mark a sharp escalation of tensions between the two countries…",
    "link": "https://www.activistpost.com/trump-has-confirmed-the-cia-is-operating-in-venezuela/",
    "timestamp": "2025-10-26T19:00:00Z"
  },
  {
    "title": "Trump unveils flurry of Asia trade pacts ahead of Xi meet",
    "description": "In a strategic move, President Donald Trump has announced fresh trade agreements with Southeast Asian nations, aimed at enhancing American agricultural exports and ensuring access to vital minerals. These deals are pivotal as the US gears up for an important …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-unveils-flurry-of-asia-trade-pacts-ahead-of-xi-meet/articleshow/124833748.cms",
    "timestamp": "2025-10-26T18:59:26Z"
  },
  {
    "title": "What are the challenges in forming a stabilisation force in Gaza?",
    "description": "Israel asserts it has veto power over the force&#039;s composition; Palestinians are not consulted.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/10/26/what-are-the-challenges-in-forming-a-stabilisation-force-in-gaza",
    "timestamp": "2025-10-26T18:58:31Z"
  },
  {
    "title": "Treasury Secretary Scott Bessent says Trump's 100% tariff threat on China is 'effectively off the table'",
    "description": "Treasury Secretary Scott Bessent expects major progress on both trade negotiations and a TikTok deal when Trump meets Xi in Korea next week.",
    "link": "https://www.businessinsider.com/trump-china-tiktok-tariffs-deals-scott-bessent-2025-10",
    "timestamp": "2025-10-26T18:57:36Z"
  },
  {
    "title": "Bay Area activists brace for fallout even after Trump pivots off SF",
    "description": "Demonstrations unfolded across the Bay Area on Thursday as activists mobilized against President Donald Trump’s threats of a federal immigration “surge.” Although Trump called off the surge in San Francisco after talking to local tech and political leaders, t…",
    "link": "https://freerepublic.com/focus/f-news/4348755/posts",
    "timestamp": "2025-10-26T18:56:04Z"
  },
  {
    "title": "Newsom Takes Down Trump For Attacking ‘Naked And Sleeping’ People In Violent ICE Raids",
    "description": "The Democratic governor decried Trump for causing \"terror on the streets of America.\"",
    "link": "https://www.huffpost.com/entry/gavin-newsom-slams-trump-ice-raids_n_68fe34c0e4b0049ce5fd2fd4",
    "timestamp": "2025-10-26T18:54:56Z"
  },
  {
    "title": "Rand Paul Takes to Fox News Sunday to Condemn Trump Over Shutdown Gridlock, ‘Extrajudicial Killings’ On Suspected Drug Boats",
    "description": "Sen. Rand Paul (R-KY) condemned President Donald Trump on two major issues during an appearance on Fox News Sunday with host Shannon Bream.\nThe post Rand Paul Takes to Fox News Sunday to Condemn Trump Over Shutdown Gridlock, ‘Extrajudicial Killings’ On Suspec…",
    "link": "https://www.mediaite.com/media/news/rand-paul-takes-to-fox-news-sunday-to-condemn-trump-over-shutdown-gridlock-extrajudicial-killings-on-suspected-drug-boats/",
    "timestamp": "2025-10-26T18:52:38Z"
  },
  {
    "title": "Potential 2028 hopeful Pete Buttigieg slams Cuomo, gushes over Mamdani’s ‘capacity to be a great mayor’",
    "description": "Possible 2028 presidential hopeful Pete Buttigieg tore into former New York Gov. Andrew Cuomo and gushed over socialist Democratic mayoral nominee Zohran Mamdani. Buttigieg, who has previously praised Mamdani’s “extraordinary” campaign, stopped short of endor…",
    "link": "https://freerepublic.com/focus/f-news/4348753/posts",
    "timestamp": "2025-10-26T18:46:55Z"
  },
  {
    "title": "'Bad for humanity, good for business': The firms helping Europe arm for war",
    "description": "As European countries rush to shore up their defences amid relentless fighting in Ukraine and a growing Russian \"shadow\" threat, companies here are capitalising on the age of drone warfare.",
    "link": "https://www.abc.net.au/news/2025-10-27/ukraine-war-sends-australian-drone-tech-manufacturers-soaring/105911352",
    "timestamp": "2025-10-26T18:44:03Z"
  },
  {
    "title": "Novartis to acquire Avidity Biosciences for about $12 billion",
    "description": "By Padmanabhan Ananthan and Angela Christy M (Reuters) -Swiss drugmaker Novartis on Sunday said it agreed to acquire U.S. biotech firm Avidity Biosciences...",
    "link": "https://finance.yahoo.com/news/novartis-acquire-avidity-biosciences-12-184046281.html",
    "timestamp": "2025-10-26T18:40:46Z"
  },
  {
    "title": "Donald Trump Got Mad at the TV, So Now Stuff Costs More (Jeremy Schulman/Mother Jones)",
    "description": "Jeremy Schulman / Mother Jones:\nDonald Trump Got Mad at the TV, So Now Stuff Costs More  —  “ALL TRADE NEGOTIATIONS WITH CANADA ARE HEREBY TERMINATED.”  —  Last month, Donald Trump's administration assured the US Supreme Court that the president's massive tar…",
    "link": "https://www.memeorandum.com/251026/p39",
    "timestamp": "2025-10-26T18:40:00Z"
  },
  {
    "title": "This Painting Tricked Everyone With a Hidden Message [8:07]",
    "description": "For over a century, everyone believed that The Devil's Checkmate (1831), the famous painting by Friedrich August Moritz Retzsch, depicted the ultimate defeat of the human soul at the hands of the devil -- a dark scene with no apparent way out. But in 1888, ch…",
    "link": "https://freerepublic.com/focus/f-chat/4348750/posts",
    "timestamp": "2025-10-26T18:38:16Z"
  },
  {
    "title": "US warship docks in Trinidad and Tobago, puts more pressure on Venezuela",
    "description": "A U.S. warship has docked in Trinidad and Tobago's capital as the Trump administration increases military pressure on Venezuela and its President Nicolás Maduro",
    "link": "https://abcnews.go.com/International/wireStory/us-warship-docks-trinidad-tobago-puts-pressure-venezuela-126880667",
    "timestamp": "2025-10-26T18:37:44Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Oct. 26, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Treasury Secretary Scott Bessent and House Minority Hakeem Jeffries join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-10-26-2025/",
    "timestamp": "2025-10-26T18:36:50Z"
  },
  {
    "title": "Trump has a 'Sputnik moment' but China is wiping the floor with America",
    "description": "To remind the US president: China is both communist and working passably well, something he and the United States generally are being forced reluctantly to confront.",
    "link": "https://www.abc.net.au/news/2025-10-27/trump-china-rare-earths-ai-bellbots-communism/105935300",
    "timestamp": "2025-10-26T18:34:53Z"
  },
  {
    "title": "'I am surprised you posted this': Trump official publicly feuds with MAGA leader",
    "description": "A top Donald Trump official is feuding with a MAGA ally who has been loyal to the president, with the administration adviser declaring publicly Sunday, \"I'm surprised you posted this.\"MAGA influencer Laura Loomer, who is known to have to ear of the president …",
    "link": "https://www.rawstory.com/gorka-loomer-fight-qatar/",
    "timestamp": "2025-10-26T18:28:28Z"
  },
  {
    "title": "Flight delays in US to grow worse, transportation secretary warns",
    "description": "Air traffic controllers are calling out or finding side jobs while they work without pay during the government shutdown, leading to delays.",
    "link": "https://www.bbc.com/news/articles/cwy7xd5ej7ko",
    "timestamp": "2025-10-26T18:27:33Z"
  },
  {
    "title": "Foreign spies are trying to steal Australian research. We should be doing more to stop them",
    "description": "Australia’s universities face escalating, deliberate efforts from foreign spies who want to steal commercially and militarily valuable research.",
    "link": "https://theconversation.com/foreign-spies-are-trying-to-steal-australian-research-we-should-be-doing-more-to-stop-them-268185",
    "timestamp": "2025-10-26T18:27:25Z"
  },
  {
    "title": "Arnold Schwarzenegger dismisses Newsom argument that redistricting effort is temporary as 'total fantasy'",
    "description": "Arnold Schwarzenegger says Gov. Gavin Newsom's claim that redistricting plan is temporary as \"total fantasy,\" warning California's gerrymandering fix will become permanent.",
    "link": "https://www.foxnews.com/media/arnold-schwarzenegger-dismisses-newsom-argument-redistricting-effort-temporary-total-fantasy",
    "timestamp": "2025-10-26T18:26:39Z"
  },
  {
    "title": "'This Week' Transcript 10-26-25: Treasury Secretary Scott Bessent, Sen. Mark Kelly, Lt. Gen Doug Lute (Ret.) and Kathryn Bigelow (ABC News)",
    "description": "ABC News:\n‘This Week’ Transcript 10-26-25: Treasury Secretary Scott Bessent, Sen. Mark Kelly, Lt. Gen Doug Lute (Ret.) and Kathryn Bigelow  —  Treasury Secretary Scott Bessent listens as Donald Trump speaks before a lunch with Ukraine's President Volodymyr Ze…",
    "link": "https://www.memeorandum.com/251026/p36",
    "timestamp": "2025-10-26T18:20:01Z"
  },
  {
    "title": "‘Islamophobia is endemic,’ Mamdani says of Republicans’ push to deport him",
    "description": "Two US House Republicans are pushing the federal justice department to investigate the path to citizenship of Zohran Mamdani, the Democratic candidate favored to win the 4 November election for New York City mayor. Congressman Randy Fine of Florida and Andy O…",
    "link": "https://freerepublic.com/focus/f-news/4348745/posts",
    "timestamp": "2025-10-26T18:17:29Z"
  },
  {
    "title": "Federal deficit reaches almost $2 trillion",
    "description": "Indebtedness now reaching $110,000 per person across America",
    "link": "https://www.wnd.com/2025/10/federal-deficit-reaches-almost-2-trillion/",
    "timestamp": "2025-10-26T18:15:10Z"
  },
  {
    "title": "‘You Will Respect Our President!’ Ilhan Omar Defended Trump Hard When a European Diplomat Trashed Him, GOP Congresswoman Claims",
    "description": "Rep. Ilhan Omar passionately defended President Trump (R) to a \"jerk\" European politician while traveling abroad, Rep. Anna Paulina Luna said on a podcast\nThe post ‘You Will Respect Our President!’ Ilhan Omar Defended Trump Hard When a European Diplomat Trash…",
    "link": "https://www.mediaite.com/media/news/you-will-respect-our-president-ilhan-omar-defended-trump-hard-when-a-european-diplomat-trashed-him-gop-congresswoman-claims/",
    "timestamp": "2025-10-26T18:13:20Z"
  },
  {
    "title": "‘We’ve Got to Do Something!’ GOP Lawmakers Call Out Party’s ‘Morally Bankrupt’ Inaction On Health Care Costs",
    "description": "Manu Raju has been talking to GOP lawmakers who are worried about there being no definitive plan to address rising health care costs over tax credits.\nThe post ‘We’ve Got to Do Something!’ GOP Lawmakers Call Out Party’s ‘Morally Bankrupt’ Inaction On Health C…",
    "link": "https://www.mediaite.com/media/news/weve-got-to-do-something-gop-lawmakers-call-out-partys-morally-bankrupt-inaction-on-health-care-costs/",
    "timestamp": "2025-10-26T18:12:53Z"
  },
  {
    "title": "Cuomo blames junior staffer for posting the quickly deleted AI \"Criminals for Mamdani\" ad, but you can still watch it here",
    "description": "The Cuomo campaign threw up an AI generated political ad attacking his political opponent Zohran Mamdani, And it's both hilarious and frightening. Take a look: VIDEO AT LINK................. https://x.com/prem_thakker/status/1981150231174746370 According to t…",
    "link": "https://freerepublic.com/focus/f-bloggers/4348744/posts",
    "timestamp": "2025-10-26T18:11:34Z"
  },
  {
    "title": "Israel says it decides which foreign troops can enter Gaza; Hamas widens search for hostages",
    "description": "Prime Minister Benjamin Netanyahu said on Sunday Israel would determine which foreign forces it would allow as part of a planned international force in Gaza to help secure a fragile ceasefire. Meanwhile, Hamas has expanded its search for bodies of hostages.",
    "link": "https://www.cbc.ca/news/world/israel-gaza-ceasefire-foreign-troops-hamas-9.6954276",
    "timestamp": "2025-10-26T18:11:19Z"
  }
]