[
  {
    "title": "One text message in the Signal group chat puts Pete Hegeth’s ineptitude on full display",
    "description": "While Waltz has rightfully come under fire for starting the Signal chat and adding Jeffrey Goldberg, Secretary of Defense Pete Hegseth deserves more scrutiny.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/pete-hegseth-signal-houthis-group-text-atlantic-rcna197992",
    "timestamp": "2025-03-26T17:35:31Z"
  },
  {
    "title": "Oscar-Nominated Documentarian Julie Cohen Resigns from Columbia Program Over Trump Capitulation",
    "description": "“We all need to find what our own ways are of standing up,\" she tells TheWrap after stepping down from the duPont-Columbia Awards jury \nThe post Oscar-Nominated Documentarian Julie Cohen Resigns from Columbia Program Over Trump Capitulation appeared first on …",
    "link": "https://www.thewrap.com/julie-cohen-documentarian-resigns-columbia-program/",
    "timestamp": "2025-03-26T17:35:08Z"
  },
  {
    "title": "'They likely perjured themselves': The View calls out Trump officials' testimony",
    "description": "\"The View's\" Sunny Hostin believes that top officials in President Donald Trump's administration may have perjured themselves while testifying before the Senate Intelligence Committee on Tuesday about the recent Signal scandal.On Monday, a bombshell report in…",
    "link": "https://www.rawstory.com/signal-scandal-2671509101/",
    "timestamp": "2025-03-26T17:35:03Z"
  },
  {
    "title": "NPR chief admits dismissing Hunter Biden laptop story was a mistake",
    "description": "NPR CEO Katherine Maher admitted Wednesday it was a mistake for her organization to dismiss the Hunter Biden laptop story when it emerged during the 2020 election.",
    "link": "https://www.foxnews.com/media/npr-chief-admits-dismissing-hunter-biden-laptop-story-mistake",
    "timestamp": "2025-03-26T17:34:11Z"
  },
  {
    "title": "Trump Considering 'Compensation Fund' for Pardoned Capitol Rioters Leaves Users Appalled: 'Paid for Committing Treason'",
    "description": "President Donald Trump's openness to a suggestion of financially compensating pardoned January 6 rioters has sparked outrage online.",
    "link": "https://www.ibtimes.com/trump-considering-compensation-fund-pardoned-capitol-rioters-leaves-users-appalled-paid-3767706",
    "timestamp": "2025-03-26T17:33:44Z"
  },
  {
    "title": "Trump’s deregulation is one of many boons for tech barons in America’s new “Gilded Age”",
    "description": "In the late 19th and early 20th centuries, industrialist “Robber Barons” controlled much of America’s wealth and harnessed the power of government to build and sustain their dominance. Ronald W. Pruessen writes that today’s tech barons can be considered to be…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/03/26/trumps-deregulation-is-one-of-many-boons-for-tech-barons-in-americas-new-gilded-age/",
    "timestamp": "2025-03-26T17:32:14Z"
  },
  {
    "title": "How Trump's 'Liberation Day' might affect the economy",
    "description": "He's calling it \"Liberation Day.\" It's a branding term for the moment when President Donald Trump's promised regime of retaliatory tariffs against America's trading partners goes into effect, perhaps on April 2. And it could shake up the global economy.\nTrump…",
    "link": "https://biztoc.com/x/359414e0064dceda",
    "timestamp": "2025-03-26T17:31:27Z"
  },
  {
    "title": "Waltz takes blame for texts amid calls for Hegseth ouster",
    "description": "What happened\nPresident Donald Trump downplayed the seriousness of his top national security officials discussing operational details of an imminent military strike on Yemen in a Signal group text chat, calling it a \"glitch\" that \"turned out not to be a serio…",
    "link": "https://biztoc.com/x/776f0f34de6ffc1b",
    "timestamp": "2025-03-26T17:31:08Z"
  },
  {
    "title": "Trump’s America is facing an Andrew Jackson moment – and it’s bad news for the constitution",
    "description": "Andrew Jackson was the first president to defy the US supreme court. The question is whether Donald Trump will take a leaf out of his book.",
    "link": "https://theconversation.com/trumps-america-is-facing-an-andrew-jackson-moment-and-its-bad-news-for-the-constitution-253047",
    "timestamp": "2025-03-26T17:31:07Z"
  },
  {
    "title": "Britons increasingly trust each other – but trust in politicians has slumped since the pandemic",
    "description": "While Britons are less trusting of those with political authority, they appear to be more trusting in each other.",
    "link": "https://theconversation.com/britons-increasingly-trust-each-other-but-trust-in-politicians-has-slumped-since-the-pandemic-252762",
    "timestamp": "2025-03-26T17:31:01Z"
  },
  {
    "title": "Dave Portnoy Calls Out Donald Trump for Reaction to Signal War Plan Texts",
    "description": "The Barstool Sports owner said the president should not be downplaying the group chat scandal.",
    "link": "https://www.newsweek.com/dave-portnoy-signal-group-chat-trump-2050927",
    "timestamp": "2025-03-26T17:31:00Z"
  },
  {
    "title": "How two recent productions of Oedipus offer different meanings through the role of the chorus",
    "description": "Two concurrent London productions of Oedipus might seem like overkill, but they actually worked to demonstrate the versatility of the tragic form.",
    "link": "https://theconversation.com/how-two-recent-productions-of-oedipus-offer-different-meanings-through-the-role-of-the-chorus-252862",
    "timestamp": "2025-03-26T17:30:47Z"
  },
  {
    "title": "Donald Trump’s ‘chilling effect’ on free speech and dissent is threatening US democracy",
    "description": "Attacks on the judiciary, the press and universities are all part of a concerted attempt to stifle dissent in America.",
    "link": "https://theconversation.com/donald-trumps-chilling-effect-on-free-speech-and-dissent-is-threatening-us-democracy-253139",
    "timestamp": "2025-03-26T17:30:45Z"
  },
  {
    "title": "Trump Prepares Auto Tariff Announcement as Soon as Today (Bloomberg)",
    "description": "Bloomberg:\nTrump Prepares Auto Tariff Announcement as Soon as Today  —  President Donald Trump is readying an announcement on auto levies as soon as Wednesday, according to people familiar with the matter, a move that would escalate his fight with global trad…",
    "link": "https://www.memeorandum.com/250326/p77",
    "timestamp": "2025-03-26T17:30:02Z"
  },
  {
    "title": "Deferred EU Ban On Transshipment of Russian LNG In Force Today",
    "description": "An EU ban on transshipment of Russian liquefied gas (LNG) in ports introduced in June 2024, with a deferral granted until March 26, 2025, has finally come into force. The sanctions also prohibit EU countries from providing technical support, brokerage service…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Deferred-EU-Ban-On-Transshipment-of-Russian-LNG-In-Force-Today.html",
    "timestamp": "2025-03-26T17:30:00Z"
  },
  {
    "title": "The Atlantic releases entire Signal chat showing Hegseth's detailed attack plans",
    "description": "What was revealed was jaw-dropping in its specificity and includes the type of information that is kept to a very close hold to protect the security of a military strike.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_0fe18837-d749-5d05-93a5-cc1cb578420e.html",
    "timestamp": "2025-03-26T17:30:00Z"
  },
  {
    "title": "The Atlantic releases entire Signal chat showing Hegseth's detailed attack plans",
    "description": "What was revealed was jaw-dropping in its specificity and includes the type of information that is kept to a very close hold to protect the security of a military strike.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_2f502981-a141-5ba5-9222-63e2cc91ab22.html",
    "timestamp": "2025-03-26T17:30:00Z"
  },
  {
    "title": "Federal Guidance Clarifies IDR Recertification After Pause",
    "description": "A new FAQ published by the Department of Education clarifies what borrowers can expect with IDR recertification.",
    "link": "https://www.forbes.com/sites/robertfarrington/2025/03/26/federal-guidance-clarifies-idr-recertification-after-pause/",
    "timestamp": "2025-03-26T17:28:29Z"
  },
  {
    "title": "Mike Waltz: ‘We’re Trying to Figure Out’ How I Did This",
    "description": "Mike Waltz: ‘We’re trying to figure out’ how I did this.’ In an interview with Laura Ingraham, the national security adviser said Elon Musk has the “best technical minds” investigating how he added Jeffrey Goldberg to a war plans Signal group text.",
    "link": "http://nymag.com/intelligencer/article/mike-waltz-ingraham-interview-signal-group-text.html",
    "timestamp": "2025-03-26T17:26:33Z"
  },
  {
    "title": "Denmark Celebrates JD Vance's Scaled-Back Greenland Visit",
    "description": "Denmark's foreign minister has said JD Vance's decision to only visit a U.S. base in Greenland over the weekend is \"very positive.\"",
    "link": "https://www.newsweek.com/denmark-celebrates-jd-vance-scaled-back-greenland-visit-2050898",
    "timestamp": "2025-03-26T17:26:32Z"
  },
  {
    "title": "US projected to hit debt limit this summer absent congressional action",
    "description": "The debt ceiling, currently at $36.1 trillion, establishes a statutory limit that the government may borrow.",
    "link": "https://abcnews.go.com/Politics/us-projected-hit-debt-limit-summer-absent-congressional/story?id=120180695",
    "timestamp": "2025-03-26T17:26:01Z"
  },
  {
    "title": "ICE detains Tufts University student amid Trump admin's campus crackdown",
    "description": "Immigration and Customs Enforcement has detained Tufts University student Rumeysa Ozturk in Somerville, Massachusetts, according to the agency and a statement the school.",
    "link": "https://www.foxnews.com/us/ice-detains-tufts-university-student-amid-trump-admins-campus-crackdown",
    "timestamp": "2025-03-26T17:25:09Z"
  },
  {
    "title": "Inside DOGE's Plan to Invade the Treasury--and Throttle USAID (Wired)",
    "description": "Wired:\nInside DOGE's Plan to Invade the Treasury—and Throttle USAID  —  Court filings show that from the earliest days of the second Trump administration, Elon Musk's DOGE had a plan to infiltrate US Treasury payment systems—and turn them against USAID.  —  F…",
    "link": "https://www.memeorandum.com/250326/p75",
    "timestamp": "2025-03-26T17:25:01Z"
  },
  {
    "title": "How Trump's 'Liberation Day' might affect the economy",
    "description": "Tariffs will rise, but consumer confidence is down",
    "link": "https://theweek.com/business/economy/trump-liberation-day-affect-economy-tariffs",
    "timestamp": "2025-03-26T17:24:17Z"
  },
  {
    "title": "Vanderbilt Donations for Florida Campus Crimped by Market Tumult",
    "description": "Fundraising has slowed for Vanderbilt University’s planned campus in West Palm Beach, Florida, as financial-market turmoil deters potential donors.",
    "link": "https://financialpost.com/pmn/business-pmn/vanderbilt-donations-for-florida-campus-crimped-by-market-tumult",
    "timestamp": "2025-03-26T17:24:11Z"
  },
  {
    "title": "Barstool’s Dave Portnoy Says Mike Waltz ‘Has to Go Down’ Amid Signal Chat Scandal: ‘You Can’t Downplay It’",
    "description": "Barstool Sports founder Dave Portnoy called for National Security Adviser Mike Waltz's ouster in response to the controversy surrounding the Signal group chat.\nThe post Barstool’s Dave Portnoy Says Mike Waltz ‘Has to Go Down’ Amid Signal Chat Scandal: ‘You Ca…",
    "link": "https://www.mediaite.com/news/barstools-dave-portnoy-says-mike-waltz-has-to-go-down-amid-signal-chat-scandal-you-cant-downplay-it/",
    "timestamp": "2025-03-26T17:23:49Z"
  },
  {
    "title": "Europe Wonders if Trump Can Be Bought Off With Arctic Concessions",
    "description": "The U.S. president’s Greenland obsession may reflect strategic concerns.",
    "link": "http://foreignpolicy.com/2025/03/26/trump-arctic-europe-greenland-security/",
    "timestamp": "2025-03-26T17:20:57Z"
  },
  {
    "title": "Will This Combat Aircraft Make It to a Century of Service?",
    "description": "American president Donald Trump recently announced that Boeing had been awarded a contract to produce the U.S. Air Force’s new generation of fighter jets. While the U.S. currently has several fifth-generation aircraft in its fleet, the F-47 — named for Trump’…",
    "link": "https://biztoc.com/x/34bbf07db5271ef3",
    "timestamp": "2025-03-26T17:20:46Z"
  },
  {
    "title": "Waltz takes blame for texts amid calls for Hegseth ouster",
    "description": "Democrats are calling for Defense Secretary Pete Hegseth and national security adviser Michael Waltz to step down",
    "link": "https://theweek.com/politics/trump-hegseth-war-plans-leak-signal",
    "timestamp": "2025-03-26T17:20:30Z"
  },
  {
    "title": "‘Shockingly Egregious F*ck-Up’: Right-Wing Media Torches Trump Team Over War Plans Groupchat Leak",
    "description": "A number of right-wing media figures have voiced their concern over Signalgate -- and the Trump administration's attempts to explain it away.\nThe post ‘Shockingly Egregious F*ck-Up’: Right-Wing Media Torches Trump Team Over War Plans Groupchat Leak first appe…",
    "link": "https://www.mediaite.com/news/shockingly-egregious-fck-up-right-wing-media-torches-trump-team-over-war-plans-groupchat-leak/",
    "timestamp": "2025-03-26T17:20:09Z"
  },
  {
    "title": "Researchers in limbo as Columbia bows to Trump’s demands in bid to restore $400M federal funding",
    "description": "Some researchers say they’re appealing the cuts, which were prompted by Trump’s concerns about antisemitism on campus.",
    "link": "https://www.bostonherald.com/2025/03/26/columbia-university-research-cuts/",
    "timestamp": "2025-03-26T17:19:27Z"
  },
  {
    "title": "Congress weighs changes to regulatory agency CFPB",
    "description": "Congress is taking a second look at federal agencies like the CFPB and considering reforms to ease regulatory and compliance burdens for businesses.",
    "link": "https://www.techtarget.com/searchcio/news/366621412/Congress-weighs-changes-to-regulatory-agency-CFPB",
    "timestamp": "2025-03-26T17:19:00Z"
  },
  {
    "title": "Mike Waltz Hounded for Answers After Declaring 'NO WAR PLANS' Were Shared as Journalist Reveals Full Texts: 'Lying Doesn't Make It Go Away'",
    "description": "Mike Waltz is facing backlash after denying that military attack plans were shared in a leaked Signal chat after full messages were recently published.",
    "link": "https://www.ibtimes.com/mike-waltz-hounded-answers-after-declaring-no-war-plans-were-shared-journalist-reveals-full-3767701",
    "timestamp": "2025-03-26T17:18:05Z"
  },
  {
    "title": "UK Defence Minister: America Has a Point on Europe Being 'Pathetic Freeloaders'",
    "description": "The United Kingdom accepts \"the Americans have absolutely got a case\" on lack of military spending on the continent.\nThe post UK Defence Minister: America Has a Point on Europe Being ‘Pathetic Freeloaders’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/03/26/uk-defence-minister-america-has-a-point-on-europe-being-pathetic-freeloaders/",
    "timestamp": "2025-03-26T17:17:44Z"
  },
  {
    "title": "House Dems rally around Hamas sympathizer facing potential deportation: 'Free Mahmoud Khalil'",
    "description": "House Democratic Lawmakers reacted to the detention of anti-Israel activist and Columbia University graduate Mahmoud Khalil, as he could potentially be deported, including calling for him to be released.",
    "link": "https://www.foxnews.com/politics/house-dems-rally-around-hamas-sympathizer-facing-potential-deportation",
    "timestamp": "2025-03-26T17:17:31Z"
  },
  {
    "title": "Democrats invoke children’s shows in bizarre defense of PBS, NPR: ‘Fire Elon, Save Elmo’",
    "description": "Democrats had some bizarre defenses for NPR and PBS in Wednesday’s House DOGE Subcommittee, invoking characters from Sesame Street and the Muppets to attack Republican efforts to cut funding.",
    "link": "https://www.foxnews.com/politics/democrats-invoke-childrens-shows-bizarre-defense-pbs-npr-fire-elon-save-elmo",
    "timestamp": "2025-03-26T17:17:05Z"
  },
  {
    "title": "‘We’re seriously outgunned’ in trade war, warns former Bank of Canada governor",
    "description": "'When the dust settles, we will need our U.S. partnership, just as much as we need it today' — Stephen Poloz",
    "link": "https://financialpost.com/news/economy/former-bank-of-canada-governor-warns-canada-outgunned-trade-war",
    "timestamp": "2025-03-26T17:16:59Z"
  },
  {
    "title": "India, US holding very active and intense discussions on trade: Jaishankar",
    "description": "India and the US are currently engaged in active and intense trade discussions, aiming for a bilateral trade agreement by fall 2025. Following recent talks between Prime Minister Modi and President Trump, the negotiations also include topics like opening up I…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-holding-very-active-and-intense-discussions-on-trade-jaishankar/articleshow/119550760.cms",
    "timestamp": "2025-03-26T17:16:51Z"
  },
  {
    "title": "NATO is a well-designed risk pool that deserves US support",
    "description": "Since before his first run for president in 2016, Donald Trump has repeatedly criticized NATO and called for its member states to contribute more resources towards their own defense. Lee Cronk writes that NATO is an example of a public good and a well-designe…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/03/26/nato-is-a-well-designed-risk-pool-that-deserves-us-support/",
    "timestamp": "2025-03-26T17:14:40Z"
  },
  {
    "title": "Lawsuit Claims LADWP Power Line Sparked Second Blaze in Palisades Fire",
    "description": "A lawsuit filed Monday claims that the Los Angeles Department of Water and Power (LADWP) is to blame for at least some of the damage in the Palisades Fire due to a power line that allegedly sparked a second blaze during the event.\nThe post Lawsuit Claims LADW…",
    "link": "https://www.breitbart.com/politics/2025/03/26/lawsuit-claims-ladwp-power-line-sparked-second-blaze-in-palisades-fire/",
    "timestamp": "2025-03-26T17:14:37Z"
  },
  {
    "title": "Democrat Rep. Dan Goldman Calls FBI Task Force on Tesla Terrorism 'Political Weaponization' of DOJ",
    "description": "Rep. Daniel Goldman (D-NY) bizarrely referred to the FBI task force on Tesla terrorism as \"lawfare\" and the \"political weaponization\" of the DOJ. Goldman's statement is especially curious given Democrat's campaign of lawfare and weaponization against Donald T…",
    "link": "https://www.breitbart.com/tech/2025/03/26/democrat-rep-dan-goldman-calls-fbi-task-force-on-tesla-terrorism-political-weaponization-of-doj/",
    "timestamp": "2025-03-26T17:13:51Z"
  },
  {
    "title": "Ryan Leaks Backstage ‘Bones’ Story ‘That Nobody Knows’",
    "description": "Famed grappling deity Gordon Ryan leaks backstage Jon Jones story involving Donald Trump “that nobody knows” regarding his UFC 309 knockout victory over Stipe Miocic in New York.",
    "link": "https://www.mmamania.com/2025/3/26/24394529/video-gordon-ryan-reveals-legendary-jon-jones-story-nobody-knows-until-now-ufc",
    "timestamp": "2025-03-26T17:13:30Z"
  },
  {
    "title": "WSJ National Security Reporter Scoffs at White House Defense That Leaked Chat Had ‘Attack’ Plans, Not ‘War’ Plans: Attack Plans Are ‘More Sensitive’",
    "description": "Wall Street Journal national security reporter Alex Ward poured ice cold water over one of the Trump administration's defenses to the shocking scandal that's been dubbed \"Signalgate,\" citing military sources to say their response actually made it worse.\nThe p…",
    "link": "https://www.mediaite.com/news/wsj-national-security-reporter-scoffs-at-white-house-defense-that-leaked-chat-had-attack-plans-not-war-plans-attack-plans-are-more-sensitive/",
    "timestamp": "2025-03-26T17:13:26Z"
  },
  {
    "title": "'Stupid': Trump ally despairs at White House's leaked war plans response",
    "description": "Even some of President Donald Trump's allies are not pleased with how his administration is handling the fallout of inadvertently leaking its war plans to the editor-in-chief of The Atlantic earlier this month.As Politico reports, the administration seems to …",
    "link": "https://www.rawstory.com/trump-signalgate-response-2671507859/",
    "timestamp": "2025-03-26T17:10:02Z"
  },
  {
    "title": "Tariff exemption to India will push Indo-US bilateral trade: Exporters",
    "description": "Exempting India from US reciprocal tariffs could promote smooth bilateral trade, say exporters. Despite potential tariffs on Indian products, negotiations for a bilateral trade agreement targeting 2025 are ongoing. However, obtaining exemptions might necessit…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/tariff-exemption-to-india-will-push-indo-us-bilateral-trade-exporters/articleshow/119550469.cms",
    "timestamp": "2025-03-26T17:09:28Z"
  },
  {
    "title": "Columbia Student Protester Sues Trump Admin After Permanent Legal Status Revoked",
    "description": "Columbia Student Protester Sues Trump Admin After Permanent Legal Status Revoked\n \nAuthored by Aldgra Fredly via The Epoch Times (emphasis ours),\nA Columbia University student filed a lawsuit on March 24 against President Donald Trump and top administration o…",
    "link": "https://biztoc.com/x/9d9958128e4de464",
    "timestamp": "2025-03-26T17:08:44Z"
  },
  {
    "title": "Trump could sign new auto tariffs today",
    "description": "United States President Donald Trump could introduce new tariffs linked to foreign automobile industries as early as today, CNBC reported on Wednesday, citing a source from the White House.The officia...",
    "link": "https://biztoc.com/x/af0f4cba45013270",
    "timestamp": "2025-03-26T17:08:37Z"
  },
  {
    "title": "‘We’re bullish on stablecoins,’ next-gen DeFi — Coinbase Ventures head",
    "description": "Crypto and blockchain-focused venture capital is unfazed by recent market volatility and is using the opportunity to uncover hidden gems in an industry that’s only “one decade into a 30-year paradigm shift,” according to Hoolie Tejwani, the head of VC firm Co…",
    "link": "https://cointelegraph.com/news/coinbase-ventures-bullish-stablecoins-defi",
    "timestamp": "2025-03-26T17:08:32Z"
  },
  {
    "title": "FACT CHECK: Video Showing Bitcoin Whitepaper Framed In Oval Office Is Digitally Altered",
    "description": "A viral video shared on X claims President Donald Trump purportedly has a Bitcoin whitepaper framed in the Oval Office. The Bitcoin whitepaper is framed in the White House and you think the bull run is over  pic.twitter.com/VFHSLzG9Hz — BTC Bro (@BTC_broo…",
    "link": "https://checkyourfact.com/2025/03/26/fact-check-video-bitcoin-framed-oval-office-altered/",
    "timestamp": "2025-03-26T17:07:52Z"
  },
  {
    "title": "Obama Judge Blocked from Receiving Deportation Info, 'Lacks Competence' to Address National Security",
    "description": "Obama Judge Blocked from Receiving Deportation Info, 'Lacks Competence' to Address National Securitywesternjournal.com",
    "link": "https://www.westernjournal.com/obama-judge-blocked-receiving-deportation-info-lacks-competence-address-national-security/",
    "timestamp": "2025-03-26T17:07:37Z"
  },
  {
    "title": "Analyst reboots Carvana stock price target on pullback",
    "description": "This is what could happen next to Carvana's stock.",
    "link": "https://www.thestreet.com/investing/analyst-reboots-carvana-stock-price-target-on-pullback",
    "timestamp": "2025-03-26T17:07:00Z"
  },
  {
    "title": "America’s allies alarmed by a leaked group chat about attack plans",
    "description": "Some say it casts doubt on intelligence-sharing with Washington and the security of joint military operations.",
    "link": "https://www.bostonherald.com/2025/03/26/america-allies-signal-leak/",
    "timestamp": "2025-03-26T17:06:37Z"
  },
  {
    "title": "Inside DOGE’s Plan to Invade the Treasury—and Throttle USAID",
    "description": "Court filings show that from the earliest days of the second Trump administration, Elon Musk’s DOGE had a plan to infiltrate US Treasury payment systems—and turn them against USAID.",
    "link": "https://www.wired.com/story/elon-musk-doge-plan-treasury-usaid/",
    "timestamp": "2025-03-26T17:06:25Z"
  },
  {
    "title": "The ACA changed everything for me. Now Trump is threatening the life I built.",
    "description": "Trump administration has proposed changes to the Affordable Care Act that could be devastating for trans people who rely on government health care coverage.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-aca-changes-health-care-transgender-rcna198096",
    "timestamp": "2025-03-26T17:06:00Z"
  },
  {
    "title": "Trump asks Supreme Court for OK to cut teacher-training money as part of anti-DEI push",
    "description": "The Trump administration is seeking approval to go ahead with cuts of hundreds of millions of dollars for teacher training.",
    "link": "https://www.wmur.com/article/supreme-court-teacher-training-cuts/64298754",
    "timestamp": "2025-03-26T17:05:47Z"
  },
  {
    "title": "Declassified CIA Documents Claim To Have Located The Ark Of The Covenant",
    "description": "According to recently declassified CIA documents, the Ark of the Covenant was actually located in the 1980s. The Ark of the Covenant, also known as the Ark of the Testimony or the Ark of God, supposedly contained the Ten Commandments from the Bible. The Ark o…",
    "link": "https://brobible.com/culture/article/declassified-cia-documents-located-ark-covenant/",
    "timestamp": "2025-03-26T17:05:45Z"
  },
  {
    "title": "WATCH: New 'Bulldozer Trail' Helps Agents Respond in Unsecured Border Region",
    "description": "A new video from the Center for Immigration Studies shows a newly bulldozed roadway for Border Patrol agents to access an unsecured mountainous region of the U.S.-Mexico border more quickly.\nThe post WATCH: New ‘Bulldozer Trail’ Helps Agents Respond in Unsecu…",
    "link": "https://www.breitbart.com/border/2025/03/26/watch-new-bulldozer-trail-helps-agents-respond-in-unsecured-border-region/",
    "timestamp": "2025-03-26T17:05:44Z"
  },
  {
    "title": "Europe Split on Defense Plan Amid Russia Threat",
    "description": "Southern European countries fear increased military spending will increase debt, while Baltic states are boosting defense budgets.",
    "link": "https://www.newsweek.com/russia-nato-baltic-spain-defense-eu-2050853",
    "timestamp": "2025-03-26T17:05:43Z"
  },
  {
    "title": "Dollar Tree says it's winning over higher-income shoppers and may offset tariffs with price hikes",
    "description": "Dollar Tree said Wednesday that it’s gaining market share with higher-income consumers and could raise prices on some products to offset President Donald Trump’s tariffs.",
    "link": "https://www.nbcnews.com/business/business-news/dollar-tree-says-winning-higher-income-shoppers-offset-tariffs-prices-rcna198216",
    "timestamp": "2025-03-26T17:04:42Z"
  },
  {
    "title": "Signalgate Is Not as Complicated As the White House Wants Us to Think",
    "description": "We don’t need the “best technical minds” to figure this one out.",
    "link": "https://www.vanityfair.com/news/story/mike-waltz-pete-hegseth-signal-trump-ingraham-2025",
    "timestamp": "2025-03-26T17:03:54Z"
  },
  {
    "title": "How Mike Johnson and Jim Jordan could hit back at judges blocking Trump's agenda",
    "description": "House Republicans are looking at multiple lanes to take on activist judges blocking President Trump's agenda.",
    "link": "https://www.foxnews.com/politics/how-mike-johnson-jim-jordan-could-hit-back-judges-blocking-trumps-agenda",
    "timestamp": "2025-03-26T17:01:45Z"
  },
  {
    "title": "Heart guitarist Nancy Wilson says it’s 'more embarrassing’ to be an American now than during the Vietnam War",
    "description": "Heart guitarist Nancy Wilson told the Milwaukee Journal Sentinel she finds it \"more embarrassing now\" to be an American than during the \"dirty politics\" of the Vietnam War.",
    "link": "https://www.foxnews.com/media/heart-guitarist-nancy-wilson-more-embarrassing-american-now-vietnam-war",
    "timestamp": "2025-03-26T17:00:41Z"
  },
  {
    "title": "Alberta premier stands by plan to speak at U.S. fundraiser, despite calls to cancel",
    "description": "Alberta Premier Danielle Smith is defending her plan to fly to Florida to appear at an event alongside a far-right U.S. influencer who calls Canada \"a silly country,\" saying it is her duty to do everything she can to reach out to Americans to prevent tariffs.",
    "link": "https://www.cbc.ca/news/canada/edmonton/alberta-premier-stands-by-plan-to-speak-at-u-s-fundraiser-despite-calls-to-cancel-1.7493869",
    "timestamp": "2025-03-26T17:00:10Z"
  },
  {
    "title": "The Long American Tradition of Categorizing Immigrants as Either Good or Bad",
    "description": "In the 19th century, debates about contract workers sorted immigrants into \"natural\" and \"unnatural\" categories. Today, these ideas remain.",
    "link": "https://time.com/7264315/the-history-of-categorizing-immigrants/",
    "timestamp": "2025-03-26T17:00:05Z"
  },
  {
    "title": "Shale-Oil Bosses Slam Trump’s Tariffs in Anonymous Survey",
    "description": "Executives at US shale companies expect President Donald Trump’s 25% steel import tariffs to lead to lower activity in the shale patch, according to the latest energy survey from the Federal Reserve Bank of Dallas.",
    "link": "https://financialpost.com/pmn/business-pmn/shale-oil-bosses-slam-trumps-tariffs-in-anonymous-survey",
    "timestamp": "2025-03-26T16:58:51Z"
  },
  {
    "title": "What Steve Daines told Chinese leaders about Trump",
    "description": "The News\nSteve Daines has traveled to China on congressional business six times since 2013. Last week’s visit could prove the most consequential of them.\nThat’s in part because of the Montana Republican senator’s outsized influence in his party right now: He’…",
    "link": "https://biztoc.com/x/617fc1a8f7334989",
    "timestamp": "2025-03-26T16:57:48Z"
  },
  {
    "title": "Dem Rep Goes On Quest To Dunk On Trump, Winds Up On Sesame Street",
    "description": "Greg Casar used his questioning time to attack Donald Trump and Elon Musk by contrasting their behavior with PBS children’s characters.",
    "link": "https://dailycaller.com/2025/03/26/dem-rep-dunk-trump-musk-pbs-sesame-street/",
    "timestamp": "2025-03-26T16:57:41Z"
  },
  {
    "title": "Trump could sign new auto tariffs as soon as Wednesday, White House says",
    "description": "President Donald Trump could impose new tariffs on auto imports as soon as Wednesday, a White House official told CNBC.\nBut the timing on Trump's latest tariff announcement is not set in stone, the official said, adding that the new duties could come later in…",
    "link": "https://biztoc.com/x/e98b0c2276c75b81",
    "timestamp": "2025-03-26T16:57:32Z"
  },
  {
    "title": "As global warming grows, Trump sees Greenland & the Arctic as realms of great power rivalry: Klaus Dodds",
    "description": "Professor Klaus Dodds explains that the US is interested in Greenland for its rare earth minerals, hemispheric security, and Arctic shipping routes. The involvement of Asian and Middle Eastern countries in Arctic projects is growing. He also mentions the need…",
    "link": "https://economictimes.indiatimes.com/news/et-evoke/as-global-warming-grows-trump-sees-greenland-the-arctic-as-realms-of-great-power-rivalry-klaus-dodds/articleshow/119549739.cms",
    "timestamp": "2025-03-26T16:57:09Z"
  },
  {
    "title": "50 Cent Calls 'Cap' on Floyd Mayweather Claiming He Owns 'Upwards of 100 Buildings'",
    "description": "Mayweather recently claimed that he owns \"upwards of 100 buildings\" during an appearance on 'The Tonight Show Starring Jimmy Fallon.'",
    "link": "https://www.complex.com/sports/a/backwoodsaltar/50-cent-calls-cap-on-floyd-mayweather-claiming-he-owns-100-buildings",
    "timestamp": "2025-03-26T16:56:13Z"
  },
  {
    "title": "Germany Doubles Down on F-35 Procurement",
    "description": "Minister of Defense Boris Pistorious shut down suggestions that Germany could reverse its decision to buy the F-35A Lightning II following recent tensions between Europe and the United States. Speaking to German media, Pistorious said “The United States is an…",
    "link": "https://theaviationist.com/2025/03/26/germany-doubles-down-f-35-procurement/",
    "timestamp": "2025-03-26T16:56:00Z"
  },
  {
    "title": "KRUGMAN: INCOMPETENT AND EVIL...",
    "description": "KRUGMAN: INCOMPETENT AND EVIL...\r\n\n \n \n \n (Top headline, 8th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:'THIS IS WHEN FIRST BOMBS WILL DROP'...\r\nREPORTER RELEASES ALL!\r\nWHITE HOUSE ROCKED...\r\nEMOJIS SIGNALED TRUMP ROCKETS LAUNCHING...\r\n...WHILE THEY PARTIED AT…",
    "link": "https://paulkrugman.substack.com/p/incompetent-or-evil-a-false-dichotomy",
    "timestamp": "2025-03-26T16:55:36Z"
  },
  {
    "title": "What Trump’s Tariff Critics Are Getting Wrong",
    "description": "US President Donald Trump’s focus on “reciprocal tariffs,” rather than balanced trade, does not suggest that his administration intends to use tariffs strategically to cut the country’s chronic trade deficit. But Democrats must stop dismissing outright a poli…",
    "link": "https://www.project-syndicate.org/commentary/democrats-misguided-criticism-of-trump-tariffs-by-lori-wallach-2025-03",
    "timestamp": "2025-03-26T16:55:17Z"
  },
  {
    "title": "Trump administration asks Supreme Court to freeze dozens of teacher training grants (John Fritze/CNN)",
    "description": "John Fritze / CNN:\nTrump administration asks Supreme Court to freeze dozens of teacher training grants  —  President Donald Trump's administration asked the Supreme Court on Wednesday to allow it to freeze millions of dollars in grants to states for addressin…",
    "link": "https://www.memeorandum.com/250326/p68",
    "timestamp": "2025-03-26T16:55:00Z"
  },
  {
    "title": "White House adds dozens of Chinese tech firms to export ‘blacklist’ in AI crackdown",
    "description": "In total, the US added 80 foreign entities to the list on the basis of national security concerns, including firms from China, the United Arab Emirates, South Africa and Iran.",
    "link": "https://nypost.com/2025/03/26/business/trump-admin-adds-dozens-of-chinese-tech-firms-to-export-blacklist/",
    "timestamp": "2025-03-26T16:53:53Z"
  },
  {
    "title": "Trump Prepares Auto Tariff Announcement",
    "description": "\"President Donald Trump is readying an announcement on auto levies as soon as Wednesday, a move that would escalate his fight with global trading partners ahead of a broader tariff push next week,\" Bloomberg reports.",
    "link": "https://politicalwire.com/2025/03/26/trump-prepares-auto-tariff-announcement/",
    "timestamp": "2025-03-26T16:52:30Z"
  },
  {
    "title": "‘So cringe’: JD Vance trolled for offering ‘victory prayer’ in leaked Yemen Signal group",
    "description": "Vice President JD Vance is being mocked online after messages he sent in a chat group on Signal were published Wednesday.\n\n\nThe fiasco began earlier this week when Jeffrey Goldberg, the editor-in-chief of the Atlantic, revealed that he'd been inadvertently ad…",
    "link": "https://www.dailydot.com/debug/jd-vance-signal-leak-prayer-for-victory/",
    "timestamp": "2025-03-26T16:51:24Z"
  },
  {
    "title": "Trump could sign new auto tariffs as soon as Wednesday, White House says",
    "description": "Trump's latest tariff announcement is not set in stone, a White House official said, adding that the new duties could come later in the week.",
    "link": "https://www.cnbc.com/2025/03/26/trump-could-sign-new-auto-tariffs-as-soon-as-wednesday-white-house-says.html",
    "timestamp": "2025-03-26T16:50:32Z"
  },
  {
    "title": "Social Security to withhold full benefits in case of overpayments starting March 27; check impact",
    "description": "Beginning March 27, the Social Security Administration (SSA) will fully withhold future payments to recover overpayments, replacing the previous 10 per cent deduction policy. This change follows media scrutiny over repayment hardships. Those who received over…",
    "link": "https://economictimes.indiatimes.com/news/international/us/social-security-to-withhold-full-benefits-in-case-of-overpayments-starting-march-27-check-impact/articleshow/119549713.cms",
    "timestamp": "2025-03-26T16:50:18Z"
  },
  {
    "title": "From Greenland to Fort Bragg, America is caught in a name game where place names become political tools",
    "description": "Place names are more than just labels on a map. They influence how people learn about the world around them and perceive their place in it.",
    "link": "https://phys.org/news/2025-03-greenland-fort-bragg-america-caught.html",
    "timestamp": "2025-03-26T16:50:01Z"
  },
  {
    "title": "What Leak? Team Trump Spins Signal Fiasco Into a “Fake-News” Hoax",
    "description": "Mike Waltz and Pete Hegseth continue to gaslight the American public about their enormous security lapse because they know they'll never face accountability.",
    "link": "https://www.vanityfair.com/news/story/what-leak-team-trump-spins-signal-fiasco-into-a-fake-news-hoax",
    "timestamp": "2025-03-26T16:49:54Z"
  },
  {
    "title": "Republicans Are Getting Nervous About Florida's Special Elections",
    "description": "State Senator Randy Fine and Florida Chief Financial Officer Jimmy Patronis look to win congressional seats for the GOP on April 1.",
    "link": "https://www.newsweek.com/republicans-nervous-florida-special-elections-randy-fine-2050796",
    "timestamp": "2025-03-26T16:49:41Z"
  },
  {
    "title": "L.A. Brings Back the Death Penalty -- in Theory",
    "description": "Los Angeles County District Attorney Nathan Hochman officially reinstated the death penalty for the most serious crimes on Tuesday -- though a state moratorium imposed by California Gov. Gavin Newsom in 2019 remains in effect.\nThe post L.A. Brings Back the De…",
    "link": "https://www.breitbart.com/law-and-order/2025/03/26/l-a-brings-back-the-death-penalty-in-theory/",
    "timestamp": "2025-03-26T16:49:39Z"
  },
  {
    "title": "Executive Grant of Clemency for Devon Archer Executive Orders",
    "description": "TO ALL TO WHOM THESE PRESENTS SHALL COME, GREETING: BE IT KNOWN, THAT THIS DAY, I, DONALD J. TRUMP, PRESIDENT OF THE UNITED STATES, PURSUANT TO MY POWERS UNDER ARTICLE II, SECTION 2, CLAUSE 1, OF THE CONSTITUTION, HAVE GRANTED UNTO THE INDIVIDUAL NAMED BELOW …",
    "link": "https://freerepublic.com/focus/f-bloggers/4306899/posts",
    "timestamp": "2025-03-26T16:49:01Z"
  },
  {
    "title": "Court Extends Hussam Abu Safiya’s Detention in Israeli Torture Camp by 6 Months",
    "description": "The Gaza hospital director has faced relentless torture in his three months in Israel’s camps, his legal team says.",
    "link": "https://truthout.org/articles/court-extends-hussam-abu-safiyas-detention-in-israeli-torture-camp-by-6-months/",
    "timestamp": "2025-03-26T16:49:00Z"
  },
  {
    "title": "Nearly half of small businesses do not see the U.S. as a reliable partner: CFIB",
    "description": "TORONTO — Canadian small businesses are losing confidence in the U.S. as a reliable trading partner, and are shifting to suppliers in domestic and other international markets in the wake of President Donald Trump’s tariffs. A new report by the Canadian Federa…",
    "link": "https://financialpost.com/pmn/nearly-half-of-small-businesses-do-not-see-the-u-s-as-a-reliable-partner-cfib",
    "timestamp": "2025-03-26T16:48:58Z"
  },
  {
    "title": "Don't fall for this story about Musk paying medical bills, arranging Neuralink brain implant for sick girl",
    "description": "In March 2025, tech billionaire Elon Musk paid the medical bills of Lily Thompson, a 7-year-old with a rare neurological disorder, and also arranged for an experimental device produced by his company Neuralink to be implanted in the child’s brain.",
    "link": "https://www.snopes.com//fact-check/girl-musk-medical-bills/",
    "timestamp": "2025-03-26T16:48:00Z"
  },
  {
    "title": "How the F-47 Compares to China and Russia's Top Combat Jets",
    "description": "\"Nothing in the world comes even close to it,\" U.S. President Donald Trump said of the next-generation F-47 sixth-generation fighter jet.",
    "link": "https://biztoc.com/x/2cf7d177cb4bce50",
    "timestamp": "2025-03-26T16:46:59Z"
  },
  {
    "title": "Trump admin to allegedly meet with GM, Ford execs",
    "description": "The Trump administration officials are set to meet with top executives from Ford Motor Co. and General Motors Co. this week ahead of United States President Donald Trump's incoming auto tariffs, the D...",
    "link": "https://biztoc.com/x/48df4c58a4557ca8",
    "timestamp": "2025-03-26T16:46:47Z"
  },
  {
    "title": "Trump officials draw judge from deportation case in Signal chat suit",
    "description": "There’s already a lawsuit in response to the Signal situation — and guess who’s been randomly assigned to preside over it? None other than Judge James Boasberg, who is also hearing the deportations case.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/signal-chat-lawsuit-boasberg-signalgate-rcna198186",
    "timestamp": "2025-03-26T16:46:40Z"
  },
  {
    "title": "Trump's Copper Tariffs Might Come Sooner Rather Than Later, Insiders Warn",
    "description": "U.S. tariffs on copper imports could arrive within weeks. In February, President Donald Trump directed the U.S. Commerce Department to conduct an investigation, giving this executive department a nine-month deadline.\nPer a Bloomberg report, the investigation …",
    "link": "https://biztoc.com/x/e36c456ef1b13789",
    "timestamp": "2025-03-26T16:46:35Z"
  },
  {
    "title": "Europe closes mostly lower as tariffs loom closer",
    "description": "Major stock equities in Europe ended Wednesday's trading session mostly with losses after the latest comment by United States President Donald Trump about the upcoming tariffs seemed to dampen investo...",
    "link": "https://biztoc.com/x/c36366115c8ed69a",
    "timestamp": "2025-03-26T16:46:21Z"
  }
]