[
  {
    "title": "Trump Orders Zelenskyy Be Sent To Bed Without His Supper To Think About What He’s Done",
    "description": "WASHINGTON, D.C. — In yet another embarrassing scolding from U.S. leadership to Ukraine, President Donald Trump ordered President Volodymyr Zelenskyy to be sent to bed without his supper to think about what he's done.",
    "link": "https://babylonbee.com/news/trump-orders-zelenskyy-be-sent-to-bed-without-his-supper-and-think-about-what-hes-done",
    "timestamp": "2025-03-04T16:43:08Z"
  },
  {
    "title": "Support the Occupying Force: The Logic Behind Trump’s Foreign Policy",
    "description": "By sending weapons to Israel while halting arms sales to Ukraine, Trump backs nations that are “occupying a less powerful people.”\nThe post Support the Occupying Force: The Logic Behind Trump’s Foreign Policy appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/03/04/trump-ukraine-israel-weapons-military-aid/",
    "timestamp": "2025-03-04T16:42:47Z"
  },
  {
    "title": "Republicans target 4 'sanctuary' cities, including Boston, as Trump pushes mass deportations",
    "description": "WASHINGTON (AP) — Republicans in Congress are taking aim at four cities — often called “sanctuary cities” — over their policies limiting cooperation with immigration enforcement with a hearing this week that comes as President Donald Trump presses ahead with…",
    "link": "https://www.thesunchronicle.com/news/nation_world/republicans-target-4-sanctuary-cities-including-boston-as-trump-pushes-mass-deportations/article_990b66b6-f917-11ef-8898-e3657e088458.html",
    "timestamp": "2025-03-04T16:42:00Z"
  },
  {
    "title": "Republicans Take Aim at 4 ‘Sanctuary’ Cities",
    "description": "There’s no strict definition for sanctuary cities, but the terms generally describe limited cooperation with ICE.",
    "link": "https://time.com/7264260/republicans-take-aim-4-sanctuary-cities/",
    "timestamp": "2025-03-04T16:41:37Z"
  },
  {
    "title": "Agricultural trade, an early casualty of Trump’s protectionist doctrine",
    "description": "The EU is on edge as US President Donald Trump follows through with tariff threats that have already disrupted agriculture and food trade flows and threatens to spark a global trade war.\nCanada swiftly retaliated against Trump’s 25% blanket duties, also appli…",
    "link": "https://biztoc.com/x/69426f9135999b98",
    "timestamp": "2025-03-04T16:40:41Z"
  },
  {
    "title": "US commerce secretary says the tariffs on Canada are just getting started",
    "description": "Howard Lutnick said that the White House will proceed with plans for additional tariffs on April 2nd.",
    "link": "https://www.businessinsider.com/trump-tariffs-canada-mexico-fentanyl-howard-lutnick-2025-3",
    "timestamp": "2025-03-04T16:40:38Z"
  },
  {
    "title": "Trudeau: Canada does not want trade war with US",
    "description": "Outgoing Canadian Prime Minister Justin Trudeau insisted on Tuesday that Ottawa does not want a trade war with the United States while describing that country's president Donald Trump as a \"smart guy,...",
    "link": "https://biztoc.com/x/c5a6389ffd333628",
    "timestamp": "2025-03-04T16:40:16Z"
  },
  {
    "title": "‘We have excess electricity’: Belarus president orders development of crypto mining",
    "description": "After forming a new government, Alexander Lukashenko has prioritized boosting Belarus’ energy grid and using excess power to mine cryptocurrency.",
    "link": "https://cointelegraph.com/news/we-have-excess-electricity-belarusian-president-crypto-mining-industry",
    "timestamp": "2025-03-04T16:40:14Z"
  },
  {
    "title": "Panama Canal ports sold to BlackRock in victory for Donald Trump",
    "description": "Panama Canal ports sold to BlackRock in victory for Donald Trump\nThen $75 per month. Complete digital access to quality FT journalism on any device. Cancel anytime during your trial.",
    "link": "https://biztoc.com/x/7ce665f7111da9c0",
    "timestamp": "2025-03-04T16:40:10Z"
  },
  {
    "title": "What’s up with… Jio Platforms, telco AI, Open RAN",
    "description": "Jio and friends to develop Open Telco AI PlatformGlobal Telco AI Alliance calls for industry collaborationIndonesia to get Open RAN network for 5G FWA",
    "link": "https://www.telecomtv.com/content/telcos-and-ai-channel/what-s-up-with-jio-platforms-telco-ai-open-ran-52481/",
    "timestamp": "2025-03-04T16:40:03Z"
  },
  {
    "title": "Trump Escalates Global Trade War, Sparking Tit-for-Tat Tariffs",
    "description": "President Donald Trump delivered on his threat to hit Canada and Mexico with sweeping import levies and doubled an existing charge on China, spurring swift reprisals that plunged the world economy into a deepening trade war.",
    "link": "https://gcaptain.com/trump-escalates-global-trade-war-sparking-tit-for-tat-tariffs/",
    "timestamp": "2025-03-04T16:40:02Z"
  },
  {
    "title": "Trump pauses aid to Ukraine",
    "description": "Ukraine and its allies have condemned President Trump's decision to suspend all military aid to Kyiv, but Russia has praised the move. Ukrainian politicians said Washington was pushing Kyiv towards capitulation. The Kremlin described the move as the best cont…",
    "link": "https://www.bbc.co.uk/programmes/w172zb9dtwqtly3",
    "timestamp": "2025-03-04T16:40:00Z"
  },
  {
    "title": "The Ukraine Mineral Resources Agreement – A Strategic Partnership in Progress?",
    "description": "The Ukraine Mineral Resources Agreement that was rejected by President Volodymyr Zelenskyy has potential, but further safeguards are needed to prevent abuse. I. Introduction The Ukraine Mineral Resources Agreement, initially proposed as a cornerstone for Ukra…",
    "link": "https://nationalinterest.org/blog/energy-world/the-ukraine-mineral-resources-agreement-a-strategic-partnership-in-progress/",
    "timestamp": "2025-03-04T16:39:55Z"
  },
  {
    "title": "Ex-lawmaker says Republicans are telling him they're 'overwhelmed' by angry calls",
    "description": "Former Rep. Charlie Dent (R-PA) told MSNBC in passing that the Republicans he's hearing from are being \"overwhelmed\" by the flood of angry calls and emails from constituents back home. Republicans are being confronted by voters who are angry with the massive …",
    "link": "https://www.rawstory.com/republican-2671264555/",
    "timestamp": "2025-03-04T16:39:18Z"
  },
  {
    "title": "Trump Press Secretary Struggles to Explain Why His Tariffs Will Work",
    "description": "White House Press Secretary Karoline Leavitt claimed she had the “facts” to back up Donald Trump’s trade war-launching tariffs on Mexico, Canada, and China, but stopped short of saying anything actually true. \r\nDuring an interview with Fox News Monday night, …",
    "link": "https://newrepublic.com/post/192281/donald-trump-press-secretary-karoline-leavitt-tariffs",
    "timestamp": "2025-03-04T16:38:34Z"
  },
  {
    "title": "Mexico, Canada and China retaliate with their own tariffs as US tariffs take effect",
    "description": "Starting just past midnight Tuesday, imports from Canada and Mexico are now taxed at 25%, with Canadian energy products subject to 10% import duties.",
    "link": "https://www.pbs.org/newshour/politics/mexico-canada-and-china-retaliate-with-their-own-tariffs-as-us-tariffs-take-effect",
    "timestamp": "2025-03-04T16:38:21Z"
  },
  {
    "title": "‘Time to Make Things Right’: Zelensky Extends Olive Branch to Trump — Says ‘We Do Really Value How Much America Has Done’",
    "description": "Ukrainian President Volodymyr Zelensky declared his gratitude to the United States and President Donald Trump in an apparent effort to mend fences.\nThe post ‘Time to Make Things Right’: Zelensky Extends Olive Branch to Trump — Says ‘We Do Really Value How Muc…",
    "link": "https://www.mediaite.com/news/time-to-make-things-right-zelensky-extends-olive-branch-to-trump-says-we-do-really-value-how-much-america-has-done/",
    "timestamp": "2025-03-04T16:38:09Z"
  },
  {
    "title": "Real-life James Bond jailed for 60 days for telling police his name",
    "description": "Possessing the name James Bond can have unforeseen consequences, as one unfortunate man found out. The fictional British Secret Service agent James Bond needs no introduction - originally invented in 1953 by author Ian Fleming, the character went on to featur…",
    "link": "https://freerepublic.com/focus/f-bloggers/4302017/posts",
    "timestamp": "2025-03-04T16:37:38Z"
  },
  {
    "title": "'Punched in the face': Quebec aluminum plant stops production after Trump tariffs come into effect",
    "description": "An aluminum plant stopped production, in what appears to be the first casualties of Donald Trump’s 25 per cent tariff on Canadian goods.",
    "link": "https://nationalpost.com/news/canada/quebec-aluminum-plant-stops-production-trump-tariffs",
    "timestamp": "2025-03-04T16:37:15Z"
  },
  {
    "title": "What the White House’s Crypto Strategy Means for Payments Innovation",
    "description": "In a move to position the United States at the forefront of the digital asset landscape, President Donald Trump’s administration plans to create a U.S. cryptocurrency reserve. The strategy, revealed Sunday (March 2), goes further than previous campaign promis…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/what-white-house-crypto-strategy-means-payments-innovation/",
    "timestamp": "2025-03-04T16:37:02Z"
  },
  {
    "title": "Agricultural trade, an early casualty of Trump’s protectionist doctrine",
    "description": "Canada and China have retaliated with tariffs on a wide range of US agricultural products worth billions of dollars.",
    "link": "https://www.euractiv.com/section/agriculture-food/news/agricultural-trade-an-early-casualty-of-trumps-protectionist-doctrine/",
    "timestamp": "2025-03-04T16:36:51Z"
  },
  {
    "title": "Leslie Bibb Reveals When That 'White Lotus' Donald Trump Scene Was Actually Written",
    "description": "Leslie Bibb is dishing on the viral The White Lotus moment with her character, Kate, and Kate’s friends – Jaclyn (Michelle Monaghan) and Laurie (Carrie Coon) – as they discuss Donald Trump. When Kate shares she’s an Independent, not a Republican or Democrat, …",
    "link": "https://www.justjared.com/2025/03/04/leslie-bibb-reveals-when-that-white-lotus-donald-trump-scene-was-actually-written/",
    "timestamp": "2025-03-04T16:36:03Z"
  },
  {
    "title": "Zelenskyy Wants To ‘Make Things Right’ As U.S. Cuts Off Assistance",
    "description": "“It is time to make things right. We would like future cooperation and communication to be constructive,” Ukrainian President Volodymyr Zelenskyy said in a statement on X Tuesday morning.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/03/04/zelenskyy-wants-to-make-things-right-as-us-cuts-off-assistance/",
    "timestamp": "2025-03-04T16:34:48Z"
  },
  {
    "title": "Who is Linda McMahon, elected as new education secretary in the Trump 2.0 administration?",
    "description": "US President Donald Trump took pledge for his second term on January 20 this year. The administration is now witnessing new appointments for different departments. In this regard, the Senate has confirmed the election of Linda McMahon as the new education sec…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-linda-mcmahon-elected-as-new-education-secretary-in-the-trump-2-0-administration/articleshow/118715303.cms",
    "timestamp": "2025-03-04T16:34:23Z"
  },
  {
    "title": "Recession odds surge in online betting markets",
    "description": "The early optimism surrounding President Donald Trump's economic policies has faded and now odds are surging in online betting markets that there will be a recession this year.Bettors on online market Kalshi as of this writing are projecting a 42 percent chan…",
    "link": "https://www.rawstory.com/trump-recession-2671264662/",
    "timestamp": "2025-03-04T16:33:51Z"
  },
  {
    "title": "Trump’s trade war heats up as countries retaliate against tariffs",
    "description": "Mexico, Canada and China all announced they would counter the president's orders after additional duties went into effect this week.",
    "link": "https://www.supplychaindive.com/news/trump-tariffs-canada-mexico-china-begin/741482/",
    "timestamp": "2025-03-04T16:33:00Z"
  },
  {
    "title": "Egypt's $53bn Gaza plan endorsed by Arab leaders and UN",
    "description": "Egypt's alternative to Trump's \"Gaza Riviera\" plan is expected to cost $53 billion and take five years. Cairo says it will host a conference for Gaza reconstruction next month.",
    "link": "https://www.dw.com/en/egypts-53bn-gaza-plan-endorsed-by-arab-leaders-and-un/a-71819003",
    "timestamp": "2025-03-04T16:33:00Z"
  },
  {
    "title": "UN endorses Egypt's $53 billion Gaza reconstruction plan",
    "description": "Egypt's alternative to Trump's \"Gaza Riviera\" plan is expected to cost $53 billion and take five years. Cairo says it will host a conference for Gaza reconstruction next month.",
    "link": "https://www.dw.com/en/un-endorses-egypts-53-billion-gaza-reconstruction-plan/a-71819003",
    "timestamp": "2025-03-04T16:33:00Z"
  },
  {
    "title": "'The West's response has become critical'",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-rwanda-africa-violence-tariffs-putin",
    "timestamp": "2025-03-04T16:32:55Z"
  },
  {
    "title": "Panama Canal ports sold to BlackRock in victory for Donald Trump - Financial Times",
    "description": "Panama Canal ports sold to BlackRock in victory for Donald TrumpFinancial Times BlackRock Strikes $23 Billion Deal for Ports on Both Sides of Panama CanalThe Wall Street Journal CK Hutchison Sells Panama Ports to BlackRock Amid Trump PressureBloomberg Panama …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176613231",
    "timestamp": "2025-03-04T16:32:52Z"
  },
  {
    "title": "The D Brief: US halts Ukraine aid; Defense policy nom testifies; China’s wedges between allies; Another base unrenamed; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/03/the-d-brief-march-04-2025/403453/",
    "timestamp": "2025-03-04T16:32:20Z"
  },
  {
    "title": "Just how bad are plastic straws?",
    "description": "The US government is eschewing paper straws and going back to plastic. So why are the plastic variety restricted in many countries around the world in the first place?",
    "link": "https://www.dw.com/en/just-how-bad-are-plastic-straws/a-71826693",
    "timestamp": "2025-03-04T16:32:00Z"
  },
  {
    "title": "Trump Agriculture Boss Says Cash-Strapped Americans Can Raise Their Own Chickens to Save on Eggs",
    "description": "President Donald Trump's Secretary of Agriculture Brooke Rollins has a message for egg consumers left hungry by out-of-control egg prices: Go cluck yourself — and buy a chicken to produce your own eggs.\nThe post Trump Agriculture Boss Says Cash-Strapped Ameri…",
    "link": "https://www.mediaite.com/tv/trump-agriculture-boss-says-cash-strapped-americans-can-raise-their-own-chickens-to-save-on-eggs/",
    "timestamp": "2025-03-04T16:31:02Z"
  },
  {
    "title": "Donald Trump's Tariff Announcement Had the Market Tumbling With Every Word",
    "description": "Wall Street was clearly rattled Monday as the president escalated his trade war against Canada, Mexico and China, with the Dow dipping in real time by over 600 points.",
    "link": "https://www.vanityfair.com/news/story/donald-trumps-tariff-announcement-market-tumbling",
    "timestamp": "2025-03-04T16:31:01Z"
  },
  {
    "title": "Dem Sen. Warner: ‘Disgusting’ That Trump Is Not Standing with Democracies",
    "description": "Senator Mark Warner (D-VA) claimed Tuesday on CNN’s “The Situation Room” that it is “disgusting” that President Donald Trump is not standing with democracies like Ukraine. Co-host Pamela Brown asked, “Is the United States on team Russia now?” Warner said, “Th…",
    "link": "https://freerepublic.com/focus/f-news/4302015/posts",
    "timestamp": "2025-03-04T16:30:56Z"
  },
  {
    "title": "ICE Nabs ‘High-Ranking’ MS-13 Gangbanger In Town Roughly 6 Miles Away From Nation’s Capital",
    "description": "Federal law enforcement officials Thursday arrested a top MS-13 gang leader who wielded international influence just minutes away from Washington, D.C.",
    "link": "https://dailycaller.com/2025/03/04/ice-nabs-high-ranking-ms-13-gangbanger/",
    "timestamp": "2025-03-04T16:30:42Z"
  },
  {
    "title": "Weekly Review",
    "description": "Relations between the United States and Ukraine curdled over the course of a meeting of some 50 minutes in the Oval Office, during which President Trump discussed a deal that would require Ukraine to invest in mineral extraction infrastructure and stands to g…",
    "link": "https://harpers.org/2025/03/weekly-review-zelensky-trump-mineral-chicken-creme-brulee-nato-drone-rheinmetall-aid-gaza-andrew-tate-andrew-cuomo-whistleblowers-citigroup-anora-mental-agony-tired-and-overwhelmed/",
    "timestamp": "2025-03-04T16:30:06Z"
  },
  {
    "title": "China Hints It Will Slash Cooperation On Fentanyl Trafficking With U.S. Over Trump Tariffs: 'It Will Deal a Heavy Blow'",
    "description": "A spokesperson for the Chinese foreign ministry heavily criticized the Trump administration's decision to double tariffs on the country from 10% to 20%",
    "link": "https://www.ibtimes.com/china-hints-it-will-slash-cooperation-fentanyl-trafficking-us-over-trump-tariffs-it-will-deal-3765104",
    "timestamp": "2025-03-04T16:29:43Z"
  },
  {
    "title": "Airline stocks tumble amid economic concerns",
    "description": "U.S. airline stocks tumbled to their lowest levels since late last year after data showed some economic concerns, hitting what had been a bright spot for consumer spending.\nThe moves also come after President Donald Trump imposed new tariffs on Mexico and Can…",
    "link": "https://biztoc.com/x/cf1765bcc574818c",
    "timestamp": "2025-03-04T16:29:38Z"
  },
  {
    "title": "White House will support rescinding DeFi broker rule: David Sacks",
    "description": "Donald Trump’s advisers said they would recommend the US President sign a resolution repealing the IRS rule into law if passed by the House and Senate.",
    "link": "https://cointelegraph.com/news/white-house-rescinding-defi-broker-rule",
    "timestamp": "2025-03-04T16:29:17Z"
  },
  {
    "title": "EU spending more on Russian energy than on Ukraine aid – Trump",
    "description": "The EU has continued to rely on energy imports from the sanctioned country, according to industry data Read Full Article at RT.com",
    "link": "https://www.rt.com/business/613659-trump-eu-russian-energy-ukraine/",
    "timestamp": "2025-03-04T16:29:09Z"
  },
  {
    "title": "FACT CHECK: No, RFK Jr. Did Not Make X Post Saying He’ll Ban MRNA Vaccines, Chemtrails",
    "description": "An image shared on Facebook purports to show an X post from Robert F. Kennedy Jr. claiming he’ll ban mRNA vaccines and chemtrails in his first 6 months as Secretary of Health and Human Services (HHS). Verdict: False The post, which was originally shared on X …",
    "link": "https://checkyourfact.com/2025/03/04/fact-check-rfk-jr-post-ban-mrna-vaccines-chemtrails/",
    "timestamp": "2025-03-04T16:29:00Z"
  },
  {
    "title": "Mexican President Decries Trump Tariffs, Will Announce Counter-Measures In Massive Public Event",
    "description": "Mexican President Claudia Sheinbaum said the country will answer with \"tariff and non-tariff measures\" to the Trump administration",
    "link": "https://www.ibtimes.com/mexican-president-decries-trump-tariffs-will-announce-counter-measures-massive-public-event-3765107",
    "timestamp": "2025-03-04T16:29:00Z"
  },
  {
    "title": "Putin Agrees to Help Trump Broker Nuclear Talks With Iran",
    "description": "(Bloomberg) -- Russia agreed to assist US President Donald Trump’s administration in communicating with Iran on issues including the Islamic Republic’s nuclear program and its support for regional anti-US proxies, according to people familiar with the situati…",
    "link": "https://freerepublic.com/focus/f-news/4302012/posts",
    "timestamp": "2025-03-04T16:28:25Z"
  },
  {
    "title": "Canada imposing 25% tariffs on $30 billion of US imports, Trudeau says",
    "description": "OTTAWA (Reuters) - Canada is imposing 25% tariffs on C$30 billion worth of U.S. imports effective immediately, Prime Minister Justin Trudeau told reporters on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/05/canada-is-imposing-25-tariffs-on-30-billion-of-us-imports-says-trudeau",
    "timestamp": "2025-03-04T16:28:00Z"
  },
  {
    "title": "Trump’s Tariff War Will Hurt UK and Lift Prices, Reeves Says",
    "description": "A global trade war will damage UK growth and drive up inflation even if Donald Trump excludes Britain from the kind of tariffs he is imposing on China, Canada and Mexico, Chancellor of the Exchequer Rachel Reeves said.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-tariff-war-will-hurt-uk-and-lift-prices-reeves-says",
    "timestamp": "2025-03-04T16:27:33Z"
  },
  {
    "title": "Ukraine and Gaza ‘discussed in detail’ as Simon Harris speaks with US Secretary of State Marco Rubio",
    "description": "Tánaiste Simon Harris has spoken with US Secretary of State Marco Rubio this afternoon.",
    "link": "https://www.independent.ie/irish-news/ukraine-and-gaza-discussed-in-detail-as-simon-harris-speaks-with-us-secretary-of-state-marco-rubio/a990112528.html",
    "timestamp": "2025-03-04T16:27:10Z"
  },
  {
    "title": "Putin Is Celebrating After Trump Gutted All Aid to Ukraine",
    "description": "Russian President Vladimir Putin could not be happier that Donald Trump announced Monday he is pausing U.S. military funding to Ukraine, a once unbelievable move Russia could’ve only dreamed about.\r\nIf the pausing of aid “is true, then this is a decision that…",
    "link": "https://newrepublic.com/post/192284/russia-putin-celebrates-response-trump-aid-ukraine",
    "timestamp": "2025-03-04T16:26:59Z"
  },
  {
    "title": "Rep Darrell Issa nominates Trump for Nobel Peace Prize",
    "description": "Rep. Darrell Issa, a Republican from California, announced that he was nominating President Donald Trump for the Nobel Peace Prize.",
    "link": "https://www.foxnews.com/politics/rep-darrell-issa-nominates-trump-nobel-peace-prize",
    "timestamp": "2025-03-04T16:26:23Z"
  },
  {
    "title": "National Review Says Trump Has Macabre Rationale That Is Generating Lack Of Restraint",
    "description": "The conservative magazine offered a disturbing analysis of the president's mindset during his chaotic start.",
    "link": "https://www.huffpost.com/entry/national-review-donald-trump-probability-of-surviving-term_n_67c6cfebe4b0f2b81e9f2d23",
    "timestamp": "2025-03-04T16:26:17Z"
  },
  {
    "title": "Zelenskyy 'ready to sign' US minerals deal and wants to 'make things right' with Trump",
    "description": "In a post on X, Zelenskyy said Friday’s meeting at the White House “did not go the way it was supposed to be”.",
    "link": "https://www.thejournal.ie/zelenskyy-ready-to-sign-us-minerals-deal-wants-to-make-things-right-with-trump-6639701-Mar2025/",
    "timestamp": "2025-03-04T16:26:00Z"
  },
  {
    "title": "US journalist’s open letter to Trump (FULL TEXT)",
    "description": "A US journalist, Ben Swann, has called on President Donald Trump to drop sanctions against RT and Sputnik in an open letter Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613682-us-journalist-letter-trump-rt/",
    "timestamp": "2025-03-04T16:25:35Z"
  },
  {
    "title": "'I would like to frame it in gilded gold': Mike Johnson gushes ahead of Trump's speech",
    "description": "House Speaker Mike Johnson (R-LA) vowed not to rip up President Donald Trump's speech to a joint session of Congress on Tuesday night and said he would instead \"like to frame it in gilded gold.\"During a Tuesday House Republican press conference, Rep. Steve Sc…",
    "link": "https://www.rawstory.com/mike-johnson-trump-speech-2671264548/",
    "timestamp": "2025-03-04T16:25:29Z"
  },
  {
    "title": "Associated Press Warns Of Trump White House Ban In Latest Court Filing: “The Constitution Does Not Allow The Government To Control Speech”",
    "description": "The Associated Press emphasized that the White House ban on its access to presidential events extends beyond pool opportunities in limited spaces but to larger events open to all credentialed journalists. In its latest court filing, the news organization’s le…",
    "link": "http://deadline.com/2025/03/trump-associated-press-gulf-of-mexico-2-1236310382/",
    "timestamp": "2025-03-04T16:25:19Z"
  },
  {
    "title": "The scary subtext behind the ‘paid protester’ line from Trump and Republicans",
    "description": "For Trump and too many Republicans, Americans who disagree with them are effectively an impossibility that can only be explained through illicit payments.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/scary-subtext-paid-protester-line-trump-republicans-rcna194694",
    "timestamp": "2025-03-04T16:25:06Z"
  },
  {
    "title": "FCC chair says US will defend Big Tech against European watchdogs",
    "description": "FCC chair Brendan Carr says EU regulations against US tech companies are excessive while urging for a “level and fair playing field.” Read more...",
    "link": "https://www.neowin.net/news/fcc-chair-says-us-will-defend-big-tech-against-european-watchdogs/",
    "timestamp": "2025-03-04T16:24:01Z"
  },
  {
    "title": "Diaper-clad Elon Musk depicted holding swastika and poo-filled megaphone at German parade",
    "description": "A carnival float at a German parade depicting Elon Musk wearing a nappy, holding a swastika flag and carrying a poo-filled megaphone has gone viral on social media. The parade at Germany’s Rosenmontag (Shrove Monday) festival in Düsseldorf made clear what man…",
    "link": "https://www.thepinknews.com/2025/03/04/elon-musk-germany-afd/",
    "timestamp": "2025-03-04T16:23:32Z"
  },
  {
    "title": "Dem Sen. Warner: 'Disgusting' That Trump Is Not Standing with Democracies",
    "description": "Senator Mark Warner (D-VA) claimed Tuesday on CNN's \"The Situation Room\" that it is \"disgusting\" that President Donald Trump is not standing with democracies like Ukraine.\nThe post Dem Sen. Warner: ‘Disgusting’ That Trump Is Not Standing with Democracies appe…",
    "link": "https://www.breitbart.com/clips/2025/03/04/dem-sen-warner-disgusting-that-trump-is-not-standing-with-democracies/",
    "timestamp": "2025-03-04T16:23:21Z"
  },
  {
    "title": "Wall Street's losing streak deepens as Trump's tariffs kick in",
    "description": "Stocks are falling again on Wall Street as companies and investors react to President Donald Trump's decision to impose tariffs on the U.S.'s biggest trading partners",
    "link": "https://abcnews.go.com/Business/wireStory/wall-streets-losing-streak-deepens-trumps-tariffs-kick-119411143",
    "timestamp": "2025-03-04T16:22:58Z"
  },
  {
    "title": "Doug Ford flip-flops on pledge to cut off power to the U.S.",
    "description": "Ontario Premier Doug Ford has backed off his repeated threat to cut off power to the U.S. in response to Trump's economic aggression, and has instead announced a 25 per cent tariff on electricity exports to the States.\r\nFord spent Tuesday morning making round…",
    "link": "https://www.blogto.com/city/2025/03/doug-ford-flip-flops-pledge-cut-power-us/",
    "timestamp": "2025-03-04T16:22:32Z"
  },
  {
    "title": "Dow falls nearly 800 points — wiping out post-election Trump surge as tariffs take effect",
    "description": "The Dow was down nearly 800 points as of 11 a.m. Eastern time while the Nasdaq fell more than 260 points.",
    "link": "https://nypost.com/2025/03/04/business/dow-falls-nearly-800-points-wiping-out-post-election-trump-surge/",
    "timestamp": "2025-03-04T16:21:53Z"
  },
  {
    "title": "Zelenskyy says Ukraine ready to work under Trump's 'strong leadership'",
    "description": "Ukrainian President Volodymyr Zelenskyy has offered an olive branch to US President Donald Trump, describing their fiery Oval Office meeting last week as \"regrettable\".",
    "link": "https://www.abc.net.au/news/2025-03-05/volodymyr-zelenskyy-says-donald-trump-meeting-was-regrettable/105011176",
    "timestamp": "2025-03-04T16:21:47Z"
  },
  {
    "title": "Tax deferrals coming, other measures to follow as Manitoba fights back against U.S. 'economic attack': Kinew",
    "description": "Manitoba Premier Wab Kinew said the province will continue to roll out additional non-tariff countermeasures \"to stick up for Manitobans and to stick up for Canada\" if tariffs imposed by U.S. President Donald Trump that came into effect Tuesday persist in the…",
    "link": "https://www.cbc.ca/news/canada/manitoba/tariffs-tax-deferrals-u-s-alcohol-removed-kinew-1.7474133",
    "timestamp": "2025-03-04T16:21:27Z"
  },
  {
    "title": "U.S. alcohol pulled from Manitoba shelves in response to tariffs: Kinew",
    "description": "Manitoba Premier Wab Kinew says U.S. alcohol products are being pulled from the shelves of provincial liquor stores.",
    "link": "https://www.cbc.ca/news/canada/manitoba/alcohol-tariffs-manitoba-kinew-1.7474133",
    "timestamp": "2025-03-04T16:21:27Z"
  },
  {
    "title": "Zelensky regrets spat with Donald Trump after US halts Ukraine aid, says he wants to make things right",
    "description": "Ukrainian President Volodymyr Zelensky on Tuesday said he wanted to \"make things right\" with Donald Trump and to work under the US President's \"strong leadership\" to secure a lasting peace in Ukraine. My team and I stand ready to work under President Trump's …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-regrets-spat-with-donald-trump-after-us-halts-ukraine-aid-says-he-wants-to-make-things-right/articleshow/118715087.cms",
    "timestamp": "2025-03-04T16:21:22Z"
  },
  {
    "title": "Zelensky should allow ‘democratic transition’ in Ukraine – Musk",
    "description": "Elon Musk has suggested that the Vladimir Zelensky would likely be investigated for corruption after the Ukraine conflict ends Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613672-musk-zelensky-democratic-transition/",
    "timestamp": "2025-03-04T16:21:22Z"
  },
  {
    "title": "'Zelle-nsky': Barron Trump embroiled in X scandal after he's accused of mocking Ukraine President? Check details",
    "description": "Barron Trump was recently embroiled in a controversy on X, formerly known as Twitter, after he was accused of mocking Ukraine President Volodymyr Zelenskyy after the latter had a contentious meeting with US President Donald Trump at the White House. The accou…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trump-zelle-nsky-barron-trump-embroiled-in-x-scandal-after-hes-accused-of-mocking-ukraine-president-check-details/articleshow/118715013.cms",
    "timestamp": "2025-03-04T16:21:22Z"
  },
  {
    "title": "Trump’s Foreign Policy: Purely Transactional",
    "description": "President Trump will incorporate “The Art of the Deal” in most, if not every, foreign policy interaction. Where will this mentality take Ukraine, Russia, and Europe as the anticipated peace agreement draws near? In just over one month since the return of Dona…",
    "link": "https://nationalinterest.org/blog/buzz/trumps-foreign-policy-purely-transactional/",
    "timestamp": "2025-03-04T16:20:39Z"
  },
  {
    "title": "Ukraine is ready to come to the negotiating table as soon as possible (On X, just heard this on Fox)",
    "description": "I would like to reiterate Ukraine’s commitment to peace. None of us wants an endless war. Ukraine is ready to come to the negotiating table as soon as possible to bring lasting peace closer. Nobody wants peace more than Ukrainians. My team and I stand ready t…",
    "link": "https://freerepublic.com/focus/f-news/4302011/posts",
    "timestamp": "2025-03-04T16:19:33Z"
  },
  {
    "title": "Wall Street Tumbles As Trump's Tariffs Kick In",
    "description": "Altogether, the decline has wiped out all of the markets’ gains since President Donald Trump’s election in November.",
    "link": "https://www.huffpost.com/entry/wall-street-stocks-trump-tariffs-down_n_67c725a5e4b02e07ca703b32",
    "timestamp": "2025-03-04T16:18:39Z"
  },
  {
    "title": "Fact check: Trump repeats false claim that Canada prohibits US banks | CNN Politics",
    "description": "As his 25% tariffs on imported Canadian products took effect on Tuesday, President Donald Trump repeated one of his many false claims about Canada – wrongly saying, again, that Canada prohibits US banks from operating there.",
    "link": "https://www.cnn.com/2025/03/04/politics/fact-check-trump-repeats-false-claim-that-canada-prohibits-us-banks/index.html",
    "timestamp": "2025-03-04T16:18:31Z"
  },
  {
    "title": "Wall Street Wonders When Trump Steps In as Stocks Keep Falling",
    "description": "As stocks traded near records despite threats from President Donald Trump’s trade policies, sticky inflation and a suddenly fragile economy, strategists theorized an invisible hand was at work: Trump’s.",
    "link": "https://financialpost.com/pmn/business-pmn/wall-street-wonders-when-trump-steps-in-as-stocks-keep-falling",
    "timestamp": "2025-03-04T16:17:14Z"
  },
  {
    "title": "No, USAID didn’t spend millions to make Zelenskyy Time’s Person of the Year, it’s more fake news",
    "description": "No, the United States Agency for International Development (USAID) didn’t spend millions to make Ukrainian president Volodymyr Zelenskyy Time’s “Person of the Year” in 2022, it’s yet more misinformation. A video shared on social media on 26 February, which si…",
    "link": "https://www.thepinknews.com/2025/03/04/usaid-trump-zelenskyy-zelensky-time-person-of-the-year/",
    "timestamp": "2025-03-04T16:17:13Z"
  },
  {
    "title": "Zelenskyy calls White House clash with Trump 'regrettable'",
    "description": "Ukrainian President Volodymyr Zelenskyy says he is ready to negotiate a \"fast\" peace agreement under President Donald Trump's leadership.",
    "link": "https://www.foxnews.com/politics/zelenskyy-says-ukraine-ready-peace-negotiations-calls-trump-meeting-regrettable",
    "timestamp": "2025-03-04T16:17:03Z"
  },
  {
    "title": "JD Vance denies disrespecting UK and France over Ukraine peacekeeping force",
    "description": "LONDON/PARIS (Reuters) - U.S. Vice President JD Vance denied on Tuesday disrespecting Britain and France by describing a planned peacekeeping force in Ukraine as 20,000 troops from some \"random country that has not fought a war in 30 or 40 years\". Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/03/05/jd-vance-denies-disrespecting-uk-and-france-over-ukraine-peacekeeping-force",
    "timestamp": "2025-03-04T16:17:00Z"
  },
  {
    "title": "Trump may have talked America into recession before a trade tariff was even imposed",
    "description": "So perhaps the best thing we can do here is to give you some context on how big a deal the imposition of tariffs here would be. The key thing to remember is that North America has been, in effect, a free trade zone for decades. Goods move back and forth acros…",
    "link": "https://freerepublic.com/focus/f-news/4302009/posts",
    "timestamp": "2025-03-04T16:16:38Z"
  },
  {
    "title": "Today’s news in a nutshell",
    "description": "KATHMANDU: Khabarhub brings you a glimpse of major developments of the day in Nepal, including politics, business/economy, sports, entertainment, and more. Govt to present five ordinances in parliament on Wednesday The government is set to present five ordina…",
    "link": "https://english.khabarhub.com/2025/04/441158/",
    "timestamp": "2025-03-04T16:15:34Z"
  },
  {
    "title": "Trump administration again labels Houthis 'terrorist organization'",
    "description": "WASHINGTON — The U.S. State Department on Tuesday reinstated the \"foreign terrorist organization\" designation for Yemen's Iran-backed Houthi group, fulfilling an order announced by President Donald Trump shortly after he took office.\n\n\nSecretary of State Marc…",
    "link": "https://www.voanews.com/a/trump-administration-again-labels-houthis-terrorist-organization-/7997241.html",
    "timestamp": "2025-03-04T16:15:15Z"
  },
  {
    "title": "JD Vance Suffers Polling Blow After Zelensky Clash",
    "description": "The vice president's net favorable rating has fallen 4 points since his heated exchange with the Ukrainian president.",
    "link": "https://www.newsweek.com/jd-vance-poll-favorable-rating-zelensky-meeting-trump-2039268",
    "timestamp": "2025-03-04T16:15:01Z"
  },
  {
    "title": "Quebec risks losing up to 160K jobs as a result of U.S. tariffs",
    "description": "Quebec Premier François Legault has said his government will launch a fund to give short-term financing to Quebec companies vulnerable to the tariffs that U.S. President Donald Trump imposed on Canadian goods earlier in the day.",
    "link": "https://www.nationalobserver.com/2025/03/04/news/quebec-lose-160k-jobs-us-tariffs",
    "timestamp": "2025-03-04T16:15:01Z"
  },
  {
    "title": "People Are Paying Millions to Dine With Donald Trump at Mar-a-Lago (Wired)",
    "description": "Wired:\nPeople Are Paying Millions to Dine With Donald Trump at Mar-a-Lago  —  Business leaders are paying as much as $5,000,000 to meet one-on-one with the president at his Florida compound, sources tell WIRED, while others are paying $1,000,000 apiece to din…",
    "link": "https://www.memeorandum.com/250304/p67",
    "timestamp": "2025-03-04T16:15:01Z"
  },
  {
    "title": "Zelensky’s Fox Interview After Oval Office Drama Draws 6 Million Viewers",
    "description": "Bret Baier's interview with Zelensky was the most-watched show in cable and broadcast television Friday night.",
    "link": "https://www.forbes.com/sites/markjoyella/2025/03/04/zelenskys-fox-interview-after-oval-office-drama-draws-6-million-viewers/",
    "timestamp": "2025-03-04T16:14:42Z"
  },
  {
    "title": "Trump issues permanent ban on 'illegal protests' as students threatened with arrest - NewsBreak",
    "description": "Donald Trump has taken to social media to warn protestors that they could be sent back to their own country or imprisoned, while also taking aim at schools",
    "link": "https://www.newsbreak.com/share/3839580232753-trump-issues-permanent-ban-on-illegal-protests-as-students-threatened-with-arrest?_f=app_share&amp;pd=0GYSgkSv&amp;lang=en_US&amp;send_time=1741104695&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v7%2Cns_push_exp_rt_bucketv12-v4%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v4&amp;s=i2",
    "timestamp": "2025-03-04T16:14:06Z"
  },
  {
    "title": "Vance visits Capitol Hill to urge senators to confirm Elbridge Colby for Pentagon No. 3 post",
    "description": "Vice President JD Vance praised Elbridge Colby, up for Pentagon’s No. 3 spot, as a \"good man\" and \"honest man.\"",
    "link": "https://www.foxnews.com/politics/vance-visits-capitol-hill-urge-senators-confirm-elbridge-colby-pentagon-no-3-post",
    "timestamp": "2025-03-04T16:14:01Z"
  },
  {
    "title": "People Are Paying Millions to Dine With Donald Trump",
    "description": "Wired: \"Guests are paying millions of dollars to dine and meet with President Donald Trump at special events held at his Mar-a-Lago estate in Palm Beach, Florida.\" \"Business leaders can secure a one-on-one meeting with",
    "link": "https://politicalwire.com/2025/03/04/people-are-paying-millions-to-dine-with-donald-trump/",
    "timestamp": "2025-03-04T16:13:54Z"
  },
  {
    "title": "Daylight Saving Time Starts This Weekend: Here's When the Clocks Spring Forward",
    "description": "Daylight saving time is about to begin again, despite sleep experts and even President Donald Trump wanting to get rid of time changes.",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176613061",
    "timestamp": "2025-03-04T16:13:12Z"
  },
  {
    "title": "GOP Campaign Chair Warns Lawmakers Against In-Person Town Halls — Protests Are Going to Get ‘Worse’",
    "description": "National Republican Congressional Committee Chairman Richard Hudson warned congressional lawmakers to avoid in-person town halls and predicted that protests, which he blamed on Democratic activists, are only going to get worse. The remarks come one day after …",
    "link": "https://www.mediaite.com/news/gop-campaign-chair-warns-lawmakers-against-in-person-town-halls-protests-are-going-to-get-worse/",
    "timestamp": "2025-03-04T16:13:12Z"
  },
  {
    "title": "Zelensky Says Trump Row Regrettable: 'Time to Make Things Right'",
    "description": "Ukraine is ready to work on a peace deal, Zelensky has said, in the wake of his Oval Office spat with Donald Trump",
    "link": "https://www.newsweek.com/zelensky-says-trump-row-regrettable-time-make-things-right-2039408",
    "timestamp": "2025-03-04T16:13:04Z"
  },
  {
    "title": "People Are Paying Millions to Dine With Donald Trump at Mar-a-Lago",
    "description": "Business leaders are paying as much as $5,000,000 to meet one-on-one with the president at his Florida compound, sources tell WIRED, while others are paying $1,000,000 apiece to dine with him in a group setting.",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176613047",
    "timestamp": "2025-03-04T16:12:26Z"
  },
  {
    "title": "Cryptocurrencies Nosedive 48 Hours After Rally As Tariffs Take Effect",
    "description": "The cryptocurrency market tumbled Tuesday just two days after a surge as investors brace for President Trump's tariffs on Canada and Mexico to take effect.",
    "link": "https://dailycaller.com/2025/03/04/cryptocurrencies-bitcoin-nosedive-48-hours-rally-tariffs-canada-mexico/",
    "timestamp": "2025-03-04T16:12:07Z"
  },
  {
    "title": "King Charles also had a ‘highly significant’ meeting with Justin Trudeau",
    "description": "King Charles happily met Ukraine’s President Zelenskyy this weekend in Sandringham. Prime Minister Keir Starmer spearheaded a vivid show of solidarity with Ukraine, inviting European leaders and Prime Minister Justin Trudeau to England over the weekend and do…",
    "link": "https://www.celebitchy.com/911910/king_charles_also_had_a_highly_significant_meeting_with_justin_trudeau/",
    "timestamp": "2025-03-04T16:10:27Z"
  },
  {
    "title": "Trump Threatens To Strip All Federal Funding From Universities That Allow 'Illegal' Anti-Semitic Protests",
    "description": "President Donald Trump announced Tuesday that he will revoke all federal funding from universities that allow \"illegal protests,\" referring to anti-Semitic demonstrations that have erupted on college campuses since Hamas's Oct. 7, 2023, attack on Israel.\nThe …",
    "link": "https://freebeacon.com/latest-news/trump-threatens-to-strip-all-federal-funding-from-universities-that-allow-illegal-anti-semitic-protests/",
    "timestamp": "2025-03-04T16:10:08Z"
  },
  {
    "title": "Why Trump’s joint remarks to Congress won’t be a ‘State of the Union’ address",
    "description": "The president's first-year speech is called something else: a joint address to Congress. The term has its origins in the first term of President Ronald Reagan.",
    "link": "https://www.pbs.org/newshour/politics/why-trumps-joint-remarks-to-congress-wont-be-a-state-of-the-union-address",
    "timestamp": "2025-03-04T16:09:06Z"
  },
  {
    "title": "Canadians are furious about Trump's tariffs: 'Nobody expected the rug to be pulled'",
    "description": "Contrary to the American popular stereotype, Canadians do in fact get angry. And right now, much of the country is irate at the U.S. over tariffs that took effect just after midnight Tuesday.Read more...",
    "link": "https://qz.com/canada-trump-tariffs-rage-boycott-trudeau-politics-1851767419",
    "timestamp": "2025-03-04T16:09:00Z"
  },
  {
    "title": "Ukraine: Zelenskyy ready to work with Trump toward peace",
    "description": "Ukraine's Zelenskyy has said he is ready to negotiate peace \"as soon as possible\" after President Donald Trump cut US military aid to Ukraine. DW has the latest.",
    "link": "https://www.dw.com/en/ukraine-zelenskyy-ready-to-work-with-trump-toward-peace/live-71818042",
    "timestamp": "2025-03-04T16:09:00Z"
  },
  {
    "title": "Kim Jong Un's Sister Issues Threat to US Over Military Move",
    "description": "North Korean continues to maintain U.S. \"provocations\" justify its nuclear ambitions.",
    "link": "https://www.newsweek.com/north-korea-kim-yo-jong-us-aircraft-carrier-carl-vinson-busan-port-south-korea-2039206",
    "timestamp": "2025-03-04T16:08:33Z"
  },
  {
    "title": "Russia ready to facilitate US-Iran negotiations – Kremlin",
    "description": "Washington has ramped up sanctions on Tehran just weeks after the Islamic Republic signed a strategic partnership with Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613679-russia-facilitate-us-iran-talks/",
    "timestamp": "2025-03-04T16:08:32Z"
  }
]