[
  {
    "title": "Comer warns contempt as Clintons face January dates for Epstein-probe depositions",
    "description": "House Oversight Chair James Comer threatens contempt proceedings against Bill and Hillary Clinton if they skip January 2026 depositions in Epstein probe.",
    "link": "https://www.foxnews.com/politics/comer-warns-contempt-clintons-face-january-dates-epstein-probe-depositions",
    "timestamp": "2025-12-16T14:19:00Z"
  },
  {
    "title": "Donald Trump Jr. & Bettina Anderson Engaged After 1 Year",
    "description": "Reading Time: 3 minutesDonald Trump Jr. and socialite Bettina Anderson announced their engagement at the White House about a year after going public.\nDonald Trump Jr. & Bettina Anderson Engaged After 1 Year was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/12/donald-trump-jr-engaged-bettina-anderson/",
    "timestamp": "2025-12-16T14:18:14Z"
  },
  {
    "title": "Rachel Maddow Says Trump Is Excelling At Just 1 Thing Right Now. And It’s Brutal.",
    "description": "The MS NOW host ran through an extensive list Monday of controversial policy decisions, public statements and scandals.",
    "link": "https://www.huffpost.com/entry/rachel-maddow-trump-approval-ratings_n_694138cfe4b0a75967041582",
    "timestamp": "2025-12-16T14:17:24Z"
  },
  {
    "title": "U.S. Ambassador Signals Hope on F-35s, Türkiye Firm on S-400s",
    "description": "U.S. Ambassador Tom Barrack voiced hope for progress on F-35 talks, but Turkish officials said there are no new developments regarding the S-400 air defence system. In a recent post on X, U.S. Ambassador to Türkiye Tom Barrack stated his hope that “talks will…",
    "link": "https://theaviationist.com/2025/12/16/turkish-f-35-talks/",
    "timestamp": "2025-12-16T14:15:45Z"
  },
  {
    "title": "Obamas due to see Reiners the night they were killed",
    "description": "Former US first lady Michelle Obama has said she and her husband Barack Obama were meant to see Hollywood director Rob Reiner and his wife, photographer Michele Reiner, the night they were killed.",
    "link": "https://www.rte.ie/entertainment/2025/1216/1549304-obamas-due-to-see-reiners-the-night-they-were-killed/",
    "timestamp": "2025-12-16T14:15:15Z"
  },
  {
    "title": "Trump sues BBC for $10 billion over documentary",
    "description": "Donald Trump filed a massive $10 billion defamation lawsuit against the BBC Monday, claiming the British broadcaster manipulated footage from his January 6 speech to make him appear responsible for violence at the Capitol. The legal action targets a documenta…",
    "link": "https://rollingout.com/2025/12/16/trump-sues-bbc/",
    "timestamp": "2025-12-16T14:14:55Z"
  },
  {
    "title": "Trump praises India, Modi amid long-drawn negotiations on trade pact",
    "description": "US President Donald Trump said India is an important strategic partner and reiterated that Prime Minister Narendra Modi was a “great friend”",
    "link": "https://www.thehindubusinessline.com/economy/trump-praises-india-modi-amid-long-drawn-negotiations-on-trade-pact/article70403617.ece",
    "timestamp": "2025-12-16T14:14:33Z"
  },
  {
    "title": "Kushner scraps Trump Tower Belgrade after officials indicted",
    "description": "Jared Kushner’s private equity firm dropped its plans for a hotel in Serbia after the indictment of a government official. Read more.",
    "link": "https://financialpost.com/real-estate/kushner-scraps-trump-tower-belgrade-officials-indicted",
    "timestamp": "2025-12-16T14:13:31Z"
  },
  {
    "title": "US Moves Unto Piracy to Enforce Its Sanctions Against Venezuela. Escalation of Its Economic and Military Campaign?",
    "description": "The United States has escalated its military and economic campaign against the Venezuelan government by moving beyond economic sanctions to the physical seizure of an oil tanker off the coast of the Bolivarian country. US military and law enforcement personne…",
    "link": "https://www.globalresearch.ca/us-piracy-enforce-sanctions-venezuela/5909236",
    "timestamp": "2025-12-16T14:13:17Z"
  },
  {
    "title": "EU likely to delay free-trade deal with South America as French farmers block roads",
    "description": "PARIS (AP) — French farmers are driving opposition to a massive transatlantic trade deal between five South American nations of the Mercosur bloc and the 27-nation European Union that officials say will likely lead to its delay. Farmers turned out across Fran…",
    "link": "https://financialpost.com/pmn/eu-likely-to-delay-free-trade-deal-with-south-america-as-french-farmers-block-roads",
    "timestamp": "2025-12-16T14:11:52Z"
  },
  {
    "title": "Trump sues BBC for $10 billion, accusing it of defamation deceptive practices over editing of his Jan. 6 speech",
    "description": "The suit accused the BBC of \"splicing together two entirely separate parts of President Trump's speech on January 6, 2021\" in order to \"intentionally misrepresent the meaning of what President Trump said.\"",
    "link": "https://www.pbs.org/newshour/politics/trump-sues-bbc-for-10-billion-accusing-it-of-defamation-deceptive-practices-over-editing-of-his-jan-6-speech",
    "timestamp": "2025-12-16T14:11:47Z"
  },
  {
    "title": "Rob Reiner’s Charlie Kirk Comments Resurface Following Brutal Murder",
    "description": "Reading Time: 2 minutesRob Reiner's comments regarding Charlie Kirk have resurfaced following the famed director's murder.\nRob Reiner’s Charlie Kirk Comments Resurface Following Brutal Murder was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/12/rob-reiners-charlie-kirk-comments-resurface-following-brutal-murder/",
    "timestamp": "2025-12-16T14:11:25Z"
  },
  {
    "title": "‘A Conspiracy Theorist for a Decade’: Trump’s Chief of Staff Gets Stunningly Candid in Blockbuster Vanity Fair Exposé",
    "description": "Wiles offered a remarkably candid window into a presidency she described as driven by impulse and a widening view of power, in a blockbuster portrait.\nThe post ‘A Conspiracy Theorist for a Decade’: Trump’s Chief of Staff Gets Stunningly Candid in Blockbuster …",
    "link": "https://www.mediaite.com/media/news/a-conspiracy-theorist-for-a-decade-trumps-chief-of-staff-gets-stunningly-candid-in-blockbuster-vanity-fair-expose/",
    "timestamp": "2025-12-16T14:10:16Z"
  },
  {
    "title": "Oil prices tumble to lowest since May, on pace for biggest decline in 7 years",
    "description": "The oil market is under pressure as OPEC+ members have rapidly ramped up production and the U.S. pressures Ukraine to accept a peace agreement with Russia.",
    "link": "https://www.cnbc.com/2025/12/16/crude-oil-prices-today.html",
    "timestamp": "2025-12-16T14:07:10Z"
  },
  {
    "title": "LATE BREAKING: Don Jr. Announces Surprise Engagement to Bettina Anderson at WH Party - in Her Response Anderson Praised Melania",
    "description": "LATE BREAKING: Don Jr. Announces Surprise Engagement to Bettina Anderson at WH Party - in Her Response Anderson Praised Melaniawesternjournal.com",
    "link": "https://www.westernjournal.com/late-breaking-don-jr-announces-surprise-engagement-bettina-anderson-wh-party-response-anderson-praised-melania/",
    "timestamp": "2025-12-16T14:06:40Z"
  },
  {
    "title": "The Irresistible Temptation of Chile’s Polarized Politics",
    "description": "Four years ago, Chileans were tempted by the promise of a progressive “refoundation” of the country under Gabriel Boric, a former student leader, and elected him president. Now they have swung in the opposite direction, electing the far-right José Antonio Kas…",
    "link": "https://www.project-syndicate.org/commentary/polarized-chile-new-far-right-president-kast-by-andres-velasco-2025-12",
    "timestamp": "2025-12-16T14:05:18Z"
  },
  {
    "title": "South Africa will attend G20 summit in US – official",
    "description": "A spokesperson for South Africa’s president urged G20 leaders not to boycott next year’s summit in Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/629516-south-africa-will-attend-g20-us/",
    "timestamp": "2025-12-16T14:03:43Z"
  },
  {
    "title": "“Slop” Is Merriam-Webster’s 2025 Word Of The Year",
    "description": "Merriam-Webster’s 2025 word of the year is “slop.” The word was first used in the 1700s to mean soft mud. It evolved more generally to mean something of little value. The definition has since expanded to mean “digital content of low quality that is produced u…",
    "link": "https://apnews.com/article/merriam-webster-dictionary-word-year-2025-slop-2dffb2379cac6001aa30e148669e3393",
    "timestamp": "2025-12-16T14:03:00Z"
  },
  {
    "title": "Michelle Obama Says She and Barack Were Supposed to See Rob Reiner on Night of Death",
    "description": "Obama addressed Donald Trump's disparaging comments about the late director during an appearance on Jimmy Kimmel Live.\nMichelle Obama Says She and Barack Were Supposed to See Rob Reiner on Night of Death\nScoop Harrison",
    "link": "https://consequence.net/2025/12/michelle-obama-rob-reiner-kimmel/",
    "timestamp": "2025-12-16T14:02:45Z"
  },
  {
    "title": "US in no position to lecture others after ‘rigged’ Biden election – Lukashenko",
    "description": "Belarusian President Alexander Lukashenko has criticized the US approach toward Venezuela and its claims about foreign elections Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629515-lukashenko-rigged-biden-election/",
    "timestamp": "2025-12-16T14:01:59Z"
  },
  {
    "title": "Pentagon prepares major military reorganization plan: Report",
    "description": "US Joint Chiefs Chairman Dan Caine was expected to present the plan to Hegseth in coming days, a senior defense official familiar with the discussion told the Washington Post.",
    "link": "https://economictimes.indiatimes.com/news/defence/pentagon-prepares-major-military-reorganization-plan-report/articleshow/126007235.cms",
    "timestamp": "2025-12-16T14:01:47Z"
  },
  {
    "title": "Michelle Obama Breaks Her Silence After Trump Blames The Rob Reiner Tragedy On Fake Syndrome",
    "description": "Michelle Obama condemned President Donald Trump’s Truth Social post blaming Rob Reiner’s passing on “Trump Derangement Syndrome.”",
    "link": "https://www.boredpanda.com/michelle-obama-breaks-silence-on-rob-michele-reiner-tragedy/",
    "timestamp": "2025-12-16T14:01:21Z"
  },
  {
    "title": "Mark Carney warns US-Canada economic relationship is ‘now over.’ How to survive a ‘drastically different world’",
    "description": "What was once a strength could now be a vulnerability.",
    "link": "https://finance.yahoo.com/news/mark-carney-warns-us-canada-140100528.html",
    "timestamp": "2025-12-16T14:01:00Z"
  },
  {
    "title": "Bitcoin Mining Hit Hard: 10% Hashrate Loss Linked To China Shutdowns",
    "description": "According to a post by former Canaan (a Chinese tech company) executive Jianping Kong, Bitcoin’s estimated hashrate fell roughly 10% in a single day, sliding from about 1,053 TH/s to just under 943 TH/s. Related Reading: Binance And HTX Get Regulatory Nod To …",
    "link": "https://bitcoinist.com/bitcoin-mining-hit-hard-10-hashrate-loss-linked-to-china-shutdowns/",
    "timestamp": "2025-12-16T14:00:53Z"
  },
  {
    "title": "GOP accuses Democrats of 'fabricating' Trump-Epstein link with selective document leaks, internal memo shows",
    "description": "House Oversight Committee GOP fires back at Democrats over Epstein probe, claiming selective leaks create a false Trump narrative in new memo to lawmakers.",
    "link": "https://www.foxnews.com/politics/gop-accuses-democrats-fabricating-trump-epstein-link-selective-document-leaks-internal-memo-shows",
    "timestamp": "2025-12-16T14:00:36Z"
  },
  {
    "title": "Hollywood filmmaker’s son charged in parents’ double murder",
    "description": "Nick Reiner, son of famed director Rob Reiner, has been charged with the murder of his parents after they were found stabbed to death in their home.\n\nRead More: https://punchng.com/hollywood-filmmakers-son-charged-in-parents-double-murder/",
    "link": "https://punchng.com/hollywood-filmmakers-son-charged-in-parents-double-murder/",
    "timestamp": "2025-12-16T14:00:28Z"
  },
  {
    "title": "Does the Boxing Movie Have Anything Left to Say?",
    "description": "This year’s fighting films, like ‘Christy’ and ‘The Smashing Machine,’ attempted to modernize a classic American story but still felt behind the times.",
    "link": "http://www.thecut.com/article/christy-smashing-machine-2025-boxing-movie-genre-trend.html",
    "timestamp": "2025-12-16T14:00:05Z"
  },
  {
    "title": "What Trump has said about Project 2025 over the years: A timeline",
    "description": "During his 2024 presidential campaign, Trump distanced himself from Project 2025. Now his administration is enacting many of its proposals.",
    "link": "https://www.snopes.com//news/2025/12/16/trump-project-2025-timeline/",
    "timestamp": "2025-12-16T14:00:00Z"
  },
  {
    "title": "EU: Flagship Corporate Accountability Law Suffers Big Losses",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n European activists march in Brussels on September 23, 2025 to protest EU governments’ efforts to weaken the EU’s corporate accountability law, the Corporate Sustainability Due Diligence Directive.\n © 2025 Friends of …",
    "link": "https://www.hrw.org/news/2025/12/16/eu-flagship-corporate-accountability-law-suffers-big-losses",
    "timestamp": "2025-12-16T14:00:00Z"
  },
  {
    "title": "Musk and Trump Have Blood on Their Hands After Canceling US AID",
    "description": "At the start of the second Trump administration, Trump unilaterally created a fake “Department of Government Efficiency,” led by Elon Musk. Only Congress can create or eliminate Departments. According to the Constitution, the House of Representatives is respo…",
    "link": "https://dianeravitch.net/2025/12/16/musk-and-trump-have-blood-on-their-hands-after-canceling-us-aid/",
    "timestamp": "2025-12-16T14:00:00Z"
  },
  {
    "title": "‘Never uttered this sequence of words’: Trump sues BBC for billions over deceptively edited speech",
    "description": "Documentary made it appear president incited the riot at U.S. Capitol on Jan. 6",
    "link": "https://www.wnd.com/2025/12/never-uttered-this-sequence-words-trump-sues-bbc/",
    "timestamp": "2025-12-16T13:59:47Z"
  },
  {
    "title": "Trump Finds Way To Be Bigger Piece Of Sh*t Than Ever, Re: Rob Reiner",
    "description": "Every time we think he can't go any lower, Daddy provides.",
    "link": "https://www.wonkette.com/p/trump-finds-way-to-be-bigger-piece",
    "timestamp": "2025-12-16T13:59:45Z"
  },
  {
    "title": "EXCLUSIVE: Biden State Dept Appeared To Ignore Emails From Would-Be Trump Assassin",
    "description": "Would-be Trump assassin Ryan Routh tried — and seemingly failed — to get the State Department to help him recruit foreign soldiers for the war in Ukraine.",
    "link": "https://dailycaller.com/2025/12/16/exclusive-biden-state-department-ryan-routh-ukraine-emails/",
    "timestamp": "2025-12-16T13:57:45Z"
  },
  {
    "title": "Trump announces son’s engagement",
    "description": "The US president shared the news at a White House Christmas event, revealing Trump Jr.’s engagement to Palm Beach socialite Bettina Anderson Read Full Article at RT.com",
    "link": "https://www.rt.com/pop-culture/629518-trump-announces-son-engagement/",
    "timestamp": "2025-12-16T13:54:00Z"
  },
  {
    "title": "Morning Minute: Decrypt Names Trump as Crypto Person of the Year",
    "description": "It's hard to argue the impact Trump has had on crypto - but has that impact been net positive or negative?",
    "link": "https://decrypt.co/352529/morning-minute-decrypt-names-trump-as-crypto-person-of-the-year",
    "timestamp": "2025-12-16T13:53:55Z"
  },
  {
    "title": "Trump Files $10B Defamation Lawsuit Against BBC Over Jan 6 Speech Edit",
    "description": "In the 46-page long filing Trump's team argue the BBC edit gave the \"mistaken impression\" he called for violence on that day.\nThe post Trump Files $10B Defamation Lawsuit Against BBC Over Jan 6 Speech Edit first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-files-10b-defamation-lawsuit-against-bbc-over-jan-6-speech-edit/",
    "timestamp": "2025-12-16T13:51:13Z"
  },
  {
    "title": "EU leaders genetically wired for theft – Lavrov",
    "description": "Russian Foreign Minister Sergey Lavrov has accused European officials of being inherently inclined to steal other countries’ assets Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629506-lavrov-eu-assets-theft/",
    "timestamp": "2025-12-16T13:50:20Z"
  },
  {
    "title": "U.S. Military Willing to Attack “Designated Terrorist Organizations” Within America, General Says",
    "description": "“If I had no concerns and I was confident in the lawful order, I would definitely execute that order.”\nThe post U.S. Military Willing to Attack “Designated Terrorist Organizations” Within America, General Says appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/12/16/trump-domestic-attack-dtos/",
    "timestamp": "2025-12-16T13:49:02Z"
  },
  {
    "title": "Trump admin defends White House ballroom as national security matter",
    "description": "Legal battle erupts over Trump's massive White House ballroom addition as preservationists challenge the controversial $300 million construction project.",
    "link": "https://www.foxnews.com/politics/trump-admin-defends-white-house-ballroom-national-security-matter",
    "timestamp": "2025-12-16T13:46:58Z"
  },
  {
    "title": "Watch: Michelle and Barack Obama Had Dinner Plans with Rob Reiner and His Wife the Night They Were Killed",
    "description": "Michelle Obama revealed on Jimmy Kimmel Live! she and her husband had dinner planned with Rob and Michele Reiner the night they were killed, “We were supposed to be seeing them that night — last night.”",
    "link": "https://www.breitbart.com/entertainment/2025/12/16/watch-michelle-and-barack-obama-had-dinner-plans-with-rob-reiner-and-his-wife-the-night-they-were-killed/",
    "timestamp": "2025-12-16T13:46:48Z"
  },
  {
    "title": "2 superpowers, 1 playbook: Why Chinese and US bureaucrats think and act alike",
    "description": "The men and women tasked with implementing policy are governed by the same incentives and constraints − whether in Beijing or Washington.",
    "link": "https://theconversation.com/2-superpowers-1-playbook-why-chinese-and-us-bureaucrats-think-and-act-alike-266305",
    "timestamp": "2025-12-16T13:46:44Z"
  },
  {
    "title": "Michelle Obama defends Rob Reiner following Trump comments",
    "description": "Obama said she and her husband Barack were due to meet the couple the night of their deaths.",
    "link": "https://www.thejournal.ie/michelle-obama-defends-rob-reiner-following-trumps-comments-6905163-Dec2025/",
    "timestamp": "2025-12-16T13:45:47Z"
  },
  {
    "title": "If tried by court-martial, senator accused of ‘seditious behavior’ would be deprived of several constitutional rights",
    "description": "US Sen. Mark Kelly correctly articulated military law when he said service members have a duty to not obey unlawful orders, according to a military law scholar.",
    "link": "https://theconversation.com/if-tried-by-court-martial-senator-accused-of-seditious-behavior-would-be-deprived-of-several-constitutional-rights-271990",
    "timestamp": "2025-12-16T13:43:27Z"
  },
  {
    "title": "“Wait, What?”: Donald Trump Jr.’s Engagement So Soon After Breakup Sparks Hilarious Reactions",
    "description": "The eldest son of President Donald Trump allegedly chose a woman he knew would “impress” his father.",
    "link": "https://www.boredpanda.com/donald-trump-jrs-engagement-soon-after-breakup-sparks-hilarious-reactions/",
    "timestamp": "2025-12-16T13:41:41Z"
  },
  {
    "title": "Europe establishes Ukraine reparations commission amid push to end war",
    "description": "The International Claims Commission is tasked with assessing reparation claims and determining amounts to be paid.",
    "link": "https://www.aljazeera.com/news/2025/12/16/europe-establishes-ukraine-reparations-commission-amid-push-to-end-war",
    "timestamp": "2025-12-16T13:41:16Z"
  },
  {
    "title": "Labor secretary announces 'strike team' going to Minnesota to investigate rampant fraud",
    "description": "Secretary of Labor Lori Chavez-DeRemer told the \"Ruthless Podcast\" that the Labor Department will be sending a \"strike team\" to Minnesota to investigate rampant fraud.",
    "link": "https://www.foxnews.com/media/labor-secretary-announces-strike-team-going-minnesota-investigate-rampant-fraud",
    "timestamp": "2025-12-16T13:40:20Z"
  },
  {
    "title": "Labor secretary announces 'strike team' heading to Minnesota to investigate rampant fraud",
    "description": "Secretary of Labor Lori Chavez-DeRemer told the \"Ruthless Podcast\" that the Labor Department will be sending a \"strike team\" to Minnesota to investigate rampant fraud.",
    "link": "https://www.foxnews.com/media/labor-secretary-announces-strike-team-heading-minnesota-investigate-rampant-fraud",
    "timestamp": "2025-12-16T13:40:20Z"
  },
  {
    "title": "Air strikes on casinos, colonial borders and a failed Trump ceasefire: What’s happening in the Thai-Cambodia conflict",
    "description": "Renewed fighting between Thailand and Cambodia along their shared border has now raged for over a week, undercutting U.S. President Donald Trump’s aspirations to be a peacemaker, while also threatening an economy that spreads across Southeast Asia. \nThai and …",
    "link": "https://biztoc.com/x/8210b48552237486",
    "timestamp": "2025-12-16T13:38:35Z"
  },
  {
    "title": "US job growth beats expectations in November; unemployment rate at 4.6%",
    "description": "By Lucia Mutikani WASHINGTON, Dec 16 (Reuters) - U.S. job growth rebounded in November after nonfarm payrolls declined in October because of government...",
    "link": "https://www.yahoo.com/news/articles/us-job-growth-beats-expectations-133625139.html",
    "timestamp": "2025-12-16T13:38:24Z"
  },
  {
    "title": "Economy added 64,000 jobs in November: The key facts and figures",
    "description": "The October report was canceled because of the government shutdown, so the report for November offers some key insights into the labor market.",
    "link": "https://www.washingtonexaminer.com/policy/finance-and-economy/3918701/economy-64000-jobs-november-facts-figures/",
    "timestamp": "2025-12-16T13:37:42Z"
  },
  {
    "title": "Political tokens played key role in memecoin boom and bust: CoinGecko",
    "description": "CoinGecko data links memecoin volatility to political narratives, highlighting how election hype fueled rapid growth before triggering a sharp market reversal.",
    "link": "https://cointelegraph.com/news/political-tokens-played-key-role-in-memecoin-boom-and-bust-coingecko",
    "timestamp": "2025-12-16T13:36:42Z"
  },
  {
    "title": "Kevin Warsh moves ahead in Fed chief race on Kalshi after Hassett pushback",
    "description": "Traders marked Warsh as the narrow favorite to replace Jerome Powell, assigning him roughly a 46% chance of nomination, compared with about 39% for Hassett.",
    "link": "https://www.cnbc.com/2025/12/16/kevin-warsh-moves-ahead-in-fed-chief-race-on-kalshi-after-hassett-pushback.html",
    "timestamp": "2025-12-16T13:36:08Z"
  },
  {
    "title": "US suppresses competitors using ‘dirty methods’ – Lavrov",
    "description": "Russian Foreign Minister Sergey Lavrov has accused the US of employing ‘dirty methods’ such as tariffs and sanctions to suppress rivals Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629509-lavrov-us-dirty-methods-diktat/",
    "timestamp": "2025-12-16T13:35:43Z"
  },
  {
    "title": "Trump Is Raging at a Looming Supreme Court Loss on Tariffs. He's Got a Point. (Ankush Khardori/Politico)",
    "description": "Ankush Khardori / Politico:\nTrump Is Raging at a Looming Supreme Court Loss on Tariffs.  He's Got a Point. … The fate of the Trump administration's tariff regime hangs in the balance before the Supreme Court, and no one seems more concerned about the likeliho…",
    "link": "https://www.memeorandum.com/251216/p21",
    "timestamp": "2025-12-16T13:35:01Z"
  },
  {
    "title": "Donald Trump says Ukraine peace deal 'closer than ever' after talks in Berlin (Financial Times)",
    "description": "Financial Times:\nDonald Trump says Ukraine peace deal ‘closer than ever’ after talks in Berlin  —  Germany says US to provide security guarantees as Kyiv and Washington admit differences on territorial issues  —  Max Seddon and Anne-Sylvaine Chassany in Berli…",
    "link": "https://www.memeorandum.com/251216/p19",
    "timestamp": "2025-12-16T13:35:01Z"
  },
  {
    "title": "Donald Trump Jr. and Bettina Anderson Are Engaged",
    "description": "Donald Trump Jr. and Bettina Anderson are taking the next step. \nDonald Trump announced his eldest son's engagement during a holiday party held at the White House Dec. 15. In a video shared to X,...",
    "link": "https://www.eonline.com/news/1426238/donald-trump-jr-engaged-to-bettina-anderson",
    "timestamp": "2025-12-16T13:34:13Z"
  },
  {
    "title": "US employers added 64,000 jobs in November but lost 105,000 in October, the government said in delayed reports",
    "description": "The United States gained a decent 64,000 jobs in November but lost 105,000 in October as federal workers departed after cutbacks by the Trump administration, the government said in delayed reports.",
    "link": "https://www.bostonherald.com/2025/12/16/us-employers-added-64000-jobs-in-november-but-lost-105000-in-october-the-government-said-in-delayed-reports/",
    "timestamp": "2025-12-16T13:33:54Z"
  },
  {
    "title": "Bettina Anderson net worth: How much is the Palm Beach socialite and Donald Trump Jr.’s fiancée worth?",
    "description": "Donald Trump Jr. announced his engagement to Bettina Anderson, drawing attention to her background. Anderson, raised in Palm Beach, Florida, comes from a family of wealth and privilege, with a father who was a bank president and a mother involved in philanthr…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/bettina-anderson-net-worth-how-much-is-the-palm-beach-socialite-and-donald-trump-jr-s-fiance-worth/articleshow/126004525.cms",
    "timestamp": "2025-12-16T13:32:40Z"
  },
  {
    "title": "Trump says small cars can bring down big prices. Here’s why that’s unlikely | CNN Business",
    "description": "President Donald Trump has a tiny solution to a big problem: have US factories manufacture very small cars, like the ones found in Asia and Europe, to drive down giant price tags.",
    "link": "https://www.cnn.com/2025/12/16/business/trump-small-cars-prices",
    "timestamp": "2025-12-16T13:32:17Z"
  },
  {
    "title": "Trump Seeking Billions From BBC In Lawsuit Over Edited Speech",
    "description": "President Donald Trump formally filed suit against the British Broadcasting Corporation (BBC) Monday over its editing of his speech on Jan. 6, 2021.",
    "link": "https://dailycaller.com/2025/12/16/trump-billions-bbc-lawsuit-edited-j6-speech/",
    "timestamp": "2025-12-16T13:30:56Z"
  },
  {
    "title": "Air strikes on casinos, colonial borders and a failed Trump ceasefire: What’s happening in the Thai-Cambodia conflict",
    "description": "Last week’s border clashes have undercut Trump’s hopes to be a peacemaker, while also endangering a regional economy across the Thai-Cambodia border.",
    "link": "https://fortune.com/2025/12/16/thailand-cambodia-war-trump-ceasefire/",
    "timestamp": "2025-12-16T13:30:21Z"
  },
  {
    "title": "'Alcoholic’s personality': Trump's top aide compares him to her own drunk father",
    "description": "President Donald Trump famously does not drink alcohol, but one of his top White House officials said his personality calls to mind her alcoholic father.White House chief of staff Susie Wiles gave a series of 11 interviews to Vanity Fair writer Chris Whipple,…",
    "link": "https://www.rawstory.com/donald-trump-susie-wiles/",
    "timestamp": "2025-12-16T13:30:19Z"
  },
  {
    "title": "Make America Affordable Again: Trump, GOP Look to Lower Costs as Midterm Year Approaches",
    "description": "Republicans are entering midterm campaign mode with an emphasis on messaging about affordability. As President Donald Trump recently kicked off a speaking tour on affordability... Read More\nThe post Make America Affordable Again: Trump, GOP Look to Lower Cost…",
    "link": "https://www.dailysignal.com/2025/12/16/make-america-affordable-again-trump-gop-look-to-lower-costs-as-midterm-year-approaches/",
    "timestamp": "2025-12-16T13:30:00Z"
  },
  {
    "title": "M2i Global, along with Volato Group, and Next-Gen Energy Technology Advance Strategic Partnership Amid Historic U.S.–Australia Critical Minerals Framework",
    "description": "First Li-NCA Cathode Materials Manufacturing Plant Outside of China Is On Track for Commissioning by Q2 2027   Adelaide, Australia, Atlanta, GA and Reno,...",
    "link": "https://www.globenewswire.com/news-release/2025/12/16/3206227/0/en/M2i-Global-along-with-Volato-Group-and-Next-Gen-Energy-Technology-Advance-Strategic-Partnership-Amid-Historic-U-S-Australia-Critical-Minerals-Framework.html",
    "timestamp": "2025-12-16T13:30:00Z"
  },
  {
    "title": "Israel is imploding",
    "description": "Quietly, but steadily, the Israeli geopolitical clout is shrinking while the Israeli state is succumbing to dysfunction.",
    "link": "https://www.aljazeera.com/opinions/2025/12/16/israel-is-imploding",
    "timestamp": "2025-12-16T13:29:37Z"
  },
  {
    "title": "Nobody (Including Advertisers) Cared About Bari Weiss’ New CBS ‘Town Hall’",
    "description": "We’ve already explored at length how Bari Weiss was hired by the billionaire Ellison family to make CBS even more friendly to billionaires and authoritarians after their embarrassing capitulation to (and bribery of) U.S. autocrats. This isn’t really a pivot r…",
    "link": "https://www.techdirt.com/2025/12/16/nobody-including-advertisers-cared-about-bari-weiss-new-cbs-town-hall/",
    "timestamp": "2025-12-16T13:26:03Z"
  },
  {
    "title": "CNN’s Scott Jennings Has Blunt Reaction to Trump’s Rob Reiner Comments",
    "description": "Fiercely pro-MAGA pundit gave his verdict on what president wrote.",
    "link": "https://www.tvinsider.com/1234359/cnn-scott-jennings-trump-rob-reiner-comments/",
    "timestamp": "2025-12-16T13:26:00Z"
  },
  {
    "title": "‘Where Was Any Grown Up?’ Morning Joe Crew Rips White House Staff ‘Enabling’ Trump in ‘Double Down’ After Rob Reiner Attack",
    "description": "On Morning Joe the team reviewed the widespread backlash against the post from the president’s own base, warning jabs like this were \"hurting Donald Trump.\"\nThe post ‘Where Was Any Grown Up?’ Morning Joe Crew Rips White House Staff ‘Enabling’ Trump in ‘Double…",
    "link": "https://www.mediaite.com/media/tv/where-was-any-grown-up-morning-joe-crew-rips-white-house-staff-enabling-trump-in-double-down-after-rob-reiner-attack/",
    "timestamp": "2025-12-16T13:23:38Z"
  },
  {
    "title": "Marjorie Taylor Greene engaged: Who is Brian Glenn, and what does he do?",
    "description": "US Representative Marjorie Taylor Greene is engaged to journalist Brian Glenn, marking a new personal and professional chapter. Glenn will leave his White House correspondent role to join Greene in Georgia as she resigns from Congress on January 5th. The anno…",
    "link": "https://economictimes.indiatimes.com/news/international/us/marjorie-taylor-greene-engaged-who-is-brian-glenn-and-what-does-he-do/articleshow/126002852.cms",
    "timestamp": "2025-12-16T13:23:20Z"
  },
  {
    "title": "Jobs data, Tesla's rally, tariff revenue hits $200 billion and more in Morning Squawk in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/12/16/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-12-16T13:18:28Z"
  },
  {
    "title": "Six Polls That Show Donald Trump Is in Deep Economic Trouble",
    "description": "A series of national polls show President Donald Trump facing sustained disapproval over his handling of the U.S. economy, with warning signs even emerging among core Republican voters.\nFrom record-low approval ratings to cracks in his MAGA base, the numbers …",
    "link": "https://biztoc.com/x/28d49540a1326a79",
    "timestamp": "2025-12-16T13:16:59Z"
  },
  {
    "title": "Bystanders seen confronting Australian gunman during ISIS-inspired deadly rampage",
    "description": "Heroic bystanders were seen on video disarming an ISIS-inspired gunman on a deadly shooting rampage in Sydney, Australia, during a Hanukkah celebration.",
    "link": "https://www.foxnews.com/world/bystanders-seen-confronting-australian-gunman-during-isis-inspired-deadly-rampage",
    "timestamp": "2025-12-16T13:15:37Z"
  },
  {
    "title": "Here’s what’s in the House GOP health care bill - NewsBreak",
    "description": "(CNN) — House Republicans are set to vote this week on their version of a health care bill as the expiration of enhanced Affordable Care Act subsidies loom",
    "link": "https://www.newsbreak.com/share/4397463847046-here-s-what-s-in-the-house-gop-health-care-bill?s=a2&amp;share_destination_id=MzMxMTU0OTA4LTE3NjU4OTA3Mjk4NTQ%3D&amp;pd=0MPUWCR0&amp;hl=en_US&amp;send_time=1765890729&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.16.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-16T13:15:16Z"
  },
  {
    "title": "U.S. And Mexico Sign Deal To Address Tijuana River Sewage Crisis After Trump Calls It a 'Threat'",
    "description": "The U.S. and Mexico have signed an agreement to address the pollution caused by sewage flowing into the Tijuana river.",
    "link": "https://www.ibtimes.com/us-mexico-sign-deal-address-tijuana-river-sewage-crisis-after-trump-calls-it-threat-3792825",
    "timestamp": "2025-12-16T13:13:33Z"
  },
  {
    "title": "Woman Who Says Neighbors 'Need to Go Back to Mexico' Uses Trump to Justify Her Racism",
    "description": "A Phoenix woman's attempt to justify racist remarks with references to Donald Trump has sparked outrage, legal scrutiny and renewed debate about xenophobia and political rhetoric in the United States.",
    "link": "https://www.ibtimes.com/woman-who-says-neighbors-need-go-back-mexico-uses-trump-justify-her-racism-3792823",
    "timestamp": "2025-12-16T13:13:27Z"
  },
  {
    "title": "Trump 'mighty unhappy' as own DOJ blindsided him with Ghislaine Maxwell: chief of staff",
    "description": "In a series of interviews with Vanity Fair, Donald Trump's chief of staff Susie Wiles revealed that the president was unaware the Department of Justice would transfer convicted sex trafficker Ghislaine Maxwell to a minimum-security prison following an intervi…",
    "link": "https://www.rawstory.com/blanche-maxwell-2674403247/",
    "timestamp": "2025-12-16T13:13:11Z"
  },
  {
    "title": "Pro-Trump New York Post Hits RFK Jr. With The Damning ‘Ugly Truth’",
    "description": "The tabloid slammed one of the Trump health secretary's moves as not only “mind-bogglingly irresponsible” but “downright cruel.\"",
    "link": "https://www.huffpost.com/entry/new-york-post-rfk-jr-ugly-truth_n_69414f7de4b0a7596704319a",
    "timestamp": "2025-12-16T13:11:41Z"
  },
  {
    "title": "Intel hires ex-Trump fixer as Washington whisperer",
    "description": "But when will Chipzilla bring back will.i.am?\nIntel has hired a veteran Republican operator as its head of government affairs, just months after Uncle Sam became the struggling chip vendor's biggest shareholder.…",
    "link": "https://www.theregister.com/2025/12/16/trump_economic_advisor_intel/",
    "timestamp": "2025-12-16T13:11:14Z"
  },
  {
    "title": "Joe: I've never seen a president try and turn a grisly murder into political advantage",
    "description": "President Donald Trump faced blowback from fellow Republicans Monday after he baselessly suggested that legendary director ...",
    "link": "https://biztoc.com/x/1dc05ce60a2f869a",
    "timestamp": "2025-12-16T13:10:37Z"
  },
  {
    "title": "Starmer’s Trump-Whispering Tested by Rifts Over BBC and Tech",
    "description": "Prime Minister Keir Starmer tried to hold President Donald Trump close this year in a bid to shield the UK from the sharp end of his trade policies. Right now, that strategy seems to be breaking down.",
    "link": "https://financialpost.com/pmn/business-pmn/starmers-trump-whispering-tested-by-rifts-over-bbc-and-tech",
    "timestamp": "2025-12-16T13:10:34Z"
  },
  {
    "title": "How a Trump Media deal with a crypto firm exposes potential conflicts of interest",
    "description": "WASHINGTON (AP) — Crypto.com was under siege. For more than a year, the firm had been investigated by President Joe Biden’s Democratic administration, part of an aggressive push to regulate the largely unregulated cryptocurrency industry. Financial regulators…",
    "link": "https://financialpost.com/pmn/how-a-trump-media-deal-with-a-crypto-firm-exposes-potential-conflicts-of-interest",
    "timestamp": "2025-12-16T13:10:16Z"
  },
  {
    "title": "‘Civilian heroes’: Dashcam shows older couple confronting Bondi gunman before they were killed",
    "description": "Video shows the moment Boris Gurman tackled Sajid Akram and wrestled a gun from him",
    "link": "https://www.irishtimes.com/world/australia/2025/12/16/civilian-heroes-dashcam-shows-older-couple-confronting-bondi-gunman-before-they-were-killed/",
    "timestamp": "2025-12-16T13:10:09Z"
  },
  {
    "title": "Zelenskyy says proposals to end the war in Ukraine could be presented to Russia within days",
    "description": "Ukrainian President Volodymyr Zelenskyy says peace proposals for U.S. officials to present to Russia could be finalized within days",
    "link": "https://abcnews.go.com/Business/wireStory/zelenskyy-proposals-end-war-ukraine-presented-russia-days-128443866",
    "timestamp": "2025-12-16T13:09:38Z"
  },
  {
    "title": "UK launches BBC funding review, as broadcaster reels from Trump lawsuit",
    "description": "Britain has begun a review of the BBC's funding. This comes as the broadcaster faces a lawsuit from US President Donald Trump. The BBC is also dealing with competition from streaming services. The government is considering reforms to ensure the BBC's future. …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/uk-launches-bbc-funding-review-as-broadcaster-reels-from-trump-lawsuit/articleshow/126005527.cms",
    "timestamp": "2025-12-16T13:09:20Z"
  },
  {
    "title": "'This isn't a Brown problem': Trump blames school in shooting, Neronha calls shooting 'symptom' | ABC6",
    "description": "President Donald Trump blamed Brown University when asked why the FBI has been unable to make an arrest in Saturday's deadly mass shooting.",
    "link": "https://www.abc6.com/this-isnt-a-brown-problem-trump-blames-school-in-shooting-neronha-calls-shooting-symptom/",
    "timestamp": "2025-12-16T13:08:43Z"
  },
  {
    "title": "Trump Sues BBC For $10 Billion Over Misleading Jan. 6 Edits",
    "description": "Trump Sues BBC For $10 Billion Over Misleading Jan. 6 Edits\n \nAuthored by Troy Myers & Joseph Lord via The Epoch Times (emphasis ours),\nPresident Donald Trump on Monday evening filed a lawsuit against the British Broadcasting Corporation (BBC) seeking $10 bil…",
    "link": "https://biztoc.com/x/a13bef120a7f82fd",
    "timestamp": "2025-12-16T13:05:35Z"
  },
  {
    "title": "Donald Trump Scores Boost From 24 States in Migrant Detention Battle",
    "description": "A coalition of 24 Republican-led states is backing Trump’s migrant detentions, saying courts lack power to question his authority.",
    "link": "https://biztoc.com/x/4c811273442487b2",
    "timestamp": "2025-12-16T13:05:27Z"
  },
  {
    "title": "Experts Doubt If Trump's $550 Billion Japan Trade Deal Would 'Ever Be Implemented' As Promised: Report",
    "description": "Despite the initial fanfare, experts are skeptical about the full implementation of Japan’s $550 billion investment pledge in the U.S., as per a recent report.\nQuestions Raised Over Japan Deal\nThe massive investment deal was announced by President Donald Trum…",
    "link": "https://biztoc.com/x/dc445e77c75a8091",
    "timestamp": "2025-12-16T13:05:08Z"
  },
  {
    "title": "Trump, 79, Cakes Hand in Makeup After Insisting It’s Treason to Discuss His Health Problems",
    "description": "Trump, 79, Cakes Hand in Makeup After Insisting It’s Treason to Discuss His Health Problemsthedailybeast.com",
    "link": "https://www.thedailybeast.com/trump-79-cakes-hand-in-makeup-after-insisting-its-treason-to-discuss-his-health-problems/",
    "timestamp": "2025-12-16T13:04:44Z"
  },
  {
    "title": "Crypto deal exposes potential conflicts of interest in Trump presidency",
    "description": "Crypto.com was under siege — investigated by President Joe Biden's Democratic administration and told enforcement action was likely. Then Donald Trump won the 2024 election, and the company’s legal peril dissipated. Crypto.com tapped a lobbyist close to Trump…",
    "link": "https://apnews.com/article/trump-cryptocurrency-cryptocom-conflicts-of-interest-0fc877e023520b9cc261d6996fecd1e7",
    "timestamp": "2025-12-16T13:03:59Z"
  },
  {
    "title": "GOP Sen. Markwayne Mullin Defends Trump's Post Disparaging Rob Reiner: 'Don't Think They're Controversial'",
    "description": "Republican Sen. Markwayne Mullin defended President Donald Trump's publication disparaging prolific director Rob Reiner following his killing, claiming it wasn't \"controversial.\"",
    "link": "https://www.ibtimes.com/gop-sen-markwayne-mullin-defends-trumps-post-disparaging-rob-reiner-dont-think-theyre-3792791",
    "timestamp": "2025-12-16T13:03:24Z"
  },
  {
    "title": "MIT Blames Closure of Two Libraries on New Endowment Tax",
    "description": "“the endowment already supports approximately 40% of [the] annual campus budget”\nThe post MIT Blames Closure of Two Libraries on New Endowment Tax first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/12/mit-blames-closure-of-two-libraries-on-new-endowment-tax/",
    "timestamp": "2025-12-16T13:00:34Z"
  },
  {
    "title": "Marjorie Taylor Greene Engaged to Brian Glenn, Who Finds Her 'Mystical Like a Unicorn'",
    "description": "Marjorie Taylor Greene is engaged to journalist Brian Glenn. He proposed in DC and is now leaving his White House correspondent role for the 'mystical' congresswoman.",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-engaged-brian-glenn-who-finds-her-mystical-like-unicorn-3792799",
    "timestamp": "2025-12-16T13:00:01Z"
  },
  {
    "title": "Chevron Reduces Price for Venezuelan Oil",
    "description": "Chevron lowered the price of Venezuelan crude offered to U.S. refiners after a tanker was seized by American forces in the Caribbean.",
    "link": "https://www.rigzone.com/news/wire/chevron_reduces_price_for_venezuelan_oil-16-dec-2025-182545-article/",
    "timestamp": "2025-12-16T13:00:00Z"
  },
  {
    "title": "85% of people given federal pardons or clemency this year are white, House lawmaker’s report says",
    "description": "Eighty-five percent of the people granted pardons or clemency this year by President Donald Trump are white, and Jan. 6 defendants made up 90% of those who benefited, according to a new report compiled by Rep.",
    "link": "https://www.nbcnews.com/news/us-news/85-people-federal-pardons-clemency-year-are-white-house-lawmakers-repo-rcna248867",
    "timestamp": "2025-12-16T13:00:00Z"
  },
  {
    "title": "Trump sues BBC for $10B, alleging defamation over editing of Jan. 6 speech",
    "description": "Trump's lawsuit calls the BBC's editing “a brazen attempt to interfere in and influence” the 2024 U.S. presidential election.",
    "link": "https://www.boston.com/news/politics/2025/12/16/trump-sues-bbc-for-10-billion-accusing-it-of-defamation-over-editing-of-presidents-jan-6-speech/",
    "timestamp": "2025-12-16T12:59:00Z"
  }
]