[
  {
    "title": "$1.99: Skin in the Game: Hidden Asymmetries in Daily Life (Incerto) (eBook) by Nassim Nicholas Taleb",
    "description": "Previous *Frontpage Deal* at *$3* with *37* Deal Score and 13 comments. \n \n*Available Retailers:*[list][*]Amazon [amazon.com] (Kindle eBook)[*]iBooks [apple.com][*]Barnes & Noble [barnesandnoble.com]...",
    "link": "https://slickdeals.net/f/18657550-1-99-skin-in-the-game-hidden-asymmetries-in-daily-life-incerto-ebook-by-nassim-nicholas-taleb",
    "timestamp": "2025-10-03T07:35:55Z"
  },
  {
    "title": "Hamas Official Says Group Still Needs Time To Study Trump's Gaza Plan",
    "description": "A Hamas official told AFP on Friday that the group still needed time to study a plan for Gaza put forward by US President Donald Trump and backed by Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.ibtimes.com/hamas-official-says-group-still-needs-time-study-trumps-gaza-plan-3785379",
    "timestamp": "2025-10-03T07:30:16Z"
  },
  {
    "title": "Putin denounces Europe’s militarization",
    "description": "Sochi, Russia, Oct 3 : Russian President Vladimir Putin has pledged a “significant” response to “Europe’s militarisation” and says the […]\nThe post Putin denounces Europe’s militarization appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/10/03/putin-denounces-europes-militarizaion/",
    "timestamp": "2025-10-03T07:30:00Z"
  },
  {
    "title": "How much of Europe’s oil and gas still comes from Russia?",
    "description": "In 2021, Russia supplied 45% of the EU’s gas and 27% of its oil. By 2024, these dropped to 19% and 3%.",
    "link": "https://www.aljazeera.com/news/2025/10/3/how-much-of-europes-oil-and-gas-still-comes-from-russia",
    "timestamp": "2025-10-03T07:29:52Z"
  },
  {
    "title": "Will Trump-style billionaire return to power? What the Czech election means for Ukraine",
    "description": "Czechs head to the polls this Friday and Saturday in an election which could impact the country’s support for Ukraine.",
    "link": "https://news.sky.com/story/will-trump-style-billionaire-andrej-babis-return-to-power-what-the-czech-election-means-for-ukraine-13443356",
    "timestamp": "2025-10-03T07:23:00Z"
  },
  {
    "title": "Trump to Visit Japan on October 27th",
    "description": "Former US President Donald Trump is arranging a three-day visit to Japan starting on October 27th, marking his first trip to the country in six years. (News On Japan)",
    "link": "https://newsonjapan.com/article/147130.php",
    "timestamp": "2025-10-03T07:21:56Z"
  },
  {
    "title": "Asian shares mixed as tech shares lead Wall Street to more records",
    "description": "Asian shares were mixed on Friday after heavy buying of tech shares led benchmarks on Wall Street to more records. US. futures and oil prices were higher. Markets have largely shrugged off the shutdown of the U.S. government after Democrat and Republican lawm…",
    "link": "https://japantoday.com/category/business/asian-shares-are-mixed-as-tech-shares-lead-wall-street-to-more-records",
    "timestamp": "2025-10-03T07:14:05Z"
  },
  {
    "title": "Two senior prosecutors fired from Virginia US Attorney's office following Comey indictment",
    "description": "Two top prosecutors in the US Attorney's Office for the Eastern District of Virginia were terminated following the indictment of former FBI Director James Comey. National security official Michael Ben'Ary and prosecutor Maya Song were removed amid criticism f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/two-senior-prosecutors-fired-from-virginia-us-attorneys-office-following-comey-indictment/articleshow/124285804.cms",
    "timestamp": "2025-10-03T07:13:16Z"
  },
  {
    "title": "Trump administration approves another generic abortion pill",
    "description": "Federal health officials have approved another generic version of the abortion pill, prompting outrage from some abortion opponents aligned with President Donald Trump",
    "link": "https://www.wpxi.com/news/health/fda-approves-another/EDJZNKG7EIZEPGU34FBBTGJL4I/",
    "timestamp": "2025-10-03T07:05:18Z"
  },
  {
    "title": "Czechia: Who is Andrej Babis, the man who hopes to be PM?",
    "description": "Billionaire and former prime minister Andrej Babis has been linked to all kinds of scandals in Czechia over the years, yet he could become PM again. His party is expected to win this week's parliamentary election. Andrej Babis has been dressing down for this …",
    "link": "https://www.dw.com/en/czechia-who-is-andrej-babis-the-man-who-hopes-to-be-pm/a-74222350",
    "timestamp": "2025-10-03T07:01:00Z"
  },
  {
    "title": "Czech Republic: Who is Andrej Babis, the man who hopes to be PM?",
    "description": "Billionaire and former prime minister Andrej Babis has been linked to all kinds of scandals in Czechia over the years, yet he could become PM again. His party is expected to win this week's parliamentary election.",
    "link": "https://www.dw.com/en/czech-republic-czechia-andrej-babis-parliamentary-election-ano-party-next-prime-minister/a-74222350",
    "timestamp": "2025-10-03T07:01:00Z"
  },
  {
    "title": "The revolt of Marjorie Taylor Greene, now Donald Trump’s fiercest critic",
    "description": "Once on the political margins, Marjorie Taylor Greene is now emerging as one of Trump’s loudest GOP critics, exposing cracks in a party built to follow his lead.",
    "link": "https://www.foxnews.com/media/revolt-marjorie-taylor-greene-now-donald-trumps-fiercest-critic",
    "timestamp": "2025-10-03T07:00:38Z"
  },
  {
    "title": "Donald Trump Posts Project 2025 Music Video",
    "description": "President Trump has shared a largely AI generated music video which depicts Office of Management and Budget (OMB) Director Russell Vought, one of the architects of the conservative Project 2025 plan, as the grim reaper on his Truth Social website.\nIn the vide…",
    "link": "https://biztoc.com/x/0c6ec9be3e0e395a",
    "timestamp": "2025-10-03T06:54:56Z"
  },
  {
    "title": "Israel and Iran on the brink: Preventing the next war",
    "description": "Israel and Iran on the brink: Preventing the next war\nfanny.pollet@i…\nFri, 10/03/2025 - 09:54\n\n\n 10 minutes\n \n The 12-day war of June 2025 marks a watershed moment: Israel, Iran and the United States demonstrated unprecedented willingness to engage in direct …",
    "link": "https://www.iss.europa.eu/publications/briefs/israel-and-iran-brink-preventing-next-war",
    "timestamp": "2025-10-03T06:54:45Z"
  },
  {
    "title": "US government shutdown enters third day, expected to last past weekend",
    "description": "White House says it plans to cut 'thousands' of federal jobs as it freezes funding to Democratic states.",
    "link": "https://www.aljazeera.com/news/2025/10/3/us-government-shutdown-enters-third-day-expected-to-last-past-weekend",
    "timestamp": "2025-10-03T06:53:22Z"
  },
  {
    "title": "Derek Barrs confirmed to take over as FMCSA Administrator",
    "description": "Barrs has experience in law enforcement after a career with the Florida DOT and Florida Highway Patrol. He becomes FMCSA's first full-time administrator since January 2024.",
    "link": "https://www.overdriveonline.com/regulations/article/15768623/fmcsa-gets-first-fulltime-administrator-in-18-months",
    "timestamp": "2025-10-03T06:53:19Z"
  },
  {
    "title": "Türkiye pushes energy diversification, says energy minister",
    "description": "Energy and Natural Resources Minister Alparslan Bayraktar said that Türkiye is pursuing diversified energy supplies, including cheaper U.S. LNG after 2027, while ramping up Black Sea gas production to meet rising demand.",
    "link": "https://www.hurriyetdailynews.com/turkiye-pushes-energy-diversification-says-energy-minister-214268",
    "timestamp": "2025-10-03T06:51:43Z"
  },
  {
    "title": "Stephen Colbert Fires Back At JD Vance In Most NSFW Possible Way",
    "description": "The \"Late Show\" host provided a very visual reminder of a rumor about the vice president.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-vance-sofa-meme_n_68df4de8e4b0dbcd325ed060",
    "timestamp": "2025-10-03T06:48:48Z"
  },
  {
    "title": "What is Trump’s new TrumpRx website and will it bring medicine prices down?",
    "description": "The US president has launched the website to reduce the cost of prescription drugs for Americans.",
    "link": "https://www.aljazeera.com/news/2025/10/3/what-is-trumps-new-trumprx-website-and-will-it-bring-medicine-prices-down",
    "timestamp": "2025-10-03T06:46:57Z"
  },
  {
    "title": "Texas megachurch founder Robert Morris pleads guilty to child sex abuse charges",
    "description": "The abuse began in 1982 when the victim was 12 and Morris was a traveling evangelist staying in Hominy, Oklahoma, with her family, according to the statement by Oklahoma Attorney General Gentner Drummond.",
    "link": "https://nypost.com/2025/10/03/us-news/texas-megachurch-founder-robert-morris-pleads-guilty-to-child-sex-abuse-charges/",
    "timestamp": "2025-10-03T06:35:05Z"
  },
  {
    "title": "Judge to sentence Sean 'Diddy' Combs later after conviction on two prostitution-related counts",
    "description": "Combs’s lawyers have asked that the judge grant him 14 months, which would effectively be time served.",
    "link": "https://www.thejournal.ie/judge-to-sentence-sean-diddy-combs-later-6833884-Oct2025/",
    "timestamp": "2025-10-03T06:29:45Z"
  },
  {
    "title": "New York judge to sentence Sean 'Diddy' Combs after blockbuster trial",
    "description": "Sean \"Diddy\" Combs will be sentenced Friday for his conviction on two prostitution-related counts, crimes prosecutors say deserve more than a decade behind bars as the music mogul seeks \"mercy\" and a swift release.",
    "link": "https://www.citizen.digital/entertainment/new-york-judge-to-sentence-sean-diddy-combs-after-blockbuster-trial-n370792",
    "timestamp": "2025-10-03T06:28:06Z"
  },
  {
    "title": "Hamas official: Hamas 'not rejecting Trump plan outright'",
    "description": "Mohammed Nazal, member of Hamas' political bureau, says terror group is seeking 'gray areas' in ceasefire plan, will soon announce decision.",
    "link": "https://www.israelnationalnews.com/news/415737",
    "timestamp": "2025-10-03T06:26:00Z"
  },
  {
    "title": "Is TikTok about to go full Maga? – podcast",
    "description": "Investigative journalist Emily Baker-White on the deal to transfer TikTok’s US operations to Trump allies\nLast week, Donald Trump signed an executive order approving a proposed deal to keep TikTok operating in the US. The $14bn deal, if finalised, would see t…",
    "link": "https://biztoc.com/x/ded57c01cdf3fb48",
    "timestamp": "2025-10-03T06:22:29Z"
  },
  {
    "title": "'Daily Show' Nails The Absolutely 'Weird' Thing About Trump's Budget Director",
    "description": "Ronny Chieng spotted how Russell Vought may be \"even more excited\" about dismantling the federal government than the president.",
    "link": "https://www.huffpost.com/entry/daily-show-ronny-chieng-donald-trump-russell-vought_n_68df3de4e4b0c7ccc3c11dfe",
    "timestamp": "2025-10-03T06:17:50Z"
  },
  {
    "title": "Apple pulls ICE tracking apps after Trump admin request",
    "description": "The Justice Department reportedly reached out to Apple to take down ICEBlock and similar apps, citing security risks to immigration enforcement officers.",
    "link": "https://www.dw.com/en/apple-pulls-ice-tracking-apps-after-trump-admin-request/a-74225261",
    "timestamp": "2025-10-03T06:17:00Z"
  },
  {
    "title": "The Nobel Prize winners will be announced next week. What to know about the prestigious awards",
    "description": "The Nobel Prize winners will be announced next week",
    "link": "https://abcnews.go.com/International/wireStory/nobel-prize-winners-announced-week-prestigious-awards-126172325",
    "timestamp": "2025-10-03T06:06:26Z"
  },
  {
    "title": "TOKEN2049 Singapore 2025 Kicks Off With Robinhood, GEMtrust DAO, and High-Profile Sessions",
    "description": "Singapore’s TOKEN2049 opened with a clear message: the next chapter of crypto is being written at the crossroads of institutional infrastructure, real-world asset tokenization, and sensible regulation. Related Reading: XRP Ledger’s MPT Standard Goes Live, Pro…",
    "link": "https://bitcoinist.com/token2049-singapore-2025-kicks-off-with-robinhood/",
    "timestamp": "2025-10-03T06:00:48Z"
  },
  {
    "title": "U.S. escalates proxy war against Russia as NATO allies push for direct conflict",
    "description": "The U.S. has discreetly approved Ukraine’s use of American intelligence to carry out attacks deep within Russia—especially targeting energy infrastructure—marking a sharp escalation in Washington’s involvement. NATO allies, particularly Poland, have publicly …",
    "link": "https://www.naturalnews.com/2025-10-03-us-escalates-war-russia-nato-push-conflict.html",
    "timestamp": "2025-10-03T06:00:00Z"
  },
  {
    "title": "Trump administration DEPORTS 120 Iranians under agreement with Tehran",
    "description": "In a rare cooperation with Tehran, the U.S. deported 120 Iranian nationals – many of whom entered illegally via Mexico – under a broader agreement to repatriate 400 migrants. The repatriation was facilitated via Iran’s U.S. Interests Section in Pakistan due t…",
    "link": "https://www.naturalnews.com/2025-10-03-trump-admin-deports-iranians-under-agreement-tehran.html",
    "timestamp": "2025-10-03T06:00:00Z"
  },
  {
    "title": "Netanyahu vows Israeli forces will remain in Gaza, defying international peace efforts",
    "description": "Israeli Prime Minister Benjamin Netanyahu has firmly rejected withdrawing troops from Gaza, creating a major political crisis. This stance directly contradicts a new peace proposal from President Donald Trump and the growing international call to end the war.…",
    "link": "https://www.naturalnews.com/2025-10-03-netanyahu-israeli-forces-remain-gaza-peace-efforts.html",
    "timestamp": "2025-10-03T06:00:00Z"
  },
  {
    "title": "Donald Trump, Henry David Thoreau and Civil Disobedience",
    "description": "Watching Donald Trump’s disjointed, narcissistic ramble at the United Nations, I kept thinking: “Why don’t the delegates walk out?” After all, he insulted many of their countries. “You’re destroying your countries. Your countries are going to hell,” he shoute…",
    "link": "https://www.counterpunch.org/2025/10/03/donald-trump-henry-david-thoreau-and-civil-disobedience/",
    "timestamp": "2025-10-03T05:58:45Z"
  },
  {
    "title": "EU Climate Breakdown",
    "description": "In the sharpest possible contrast to the US approach to climate change, in a very grown-up adult fashion, the EU has publicly stated: “EU officials warn climate breakdown and wildlife loss are ruining ecosystems that underpin the economy.” (Environmental Dama…",
    "link": "https://www.counterpunch.org/2025/10/03/eu-climate-breakdown/",
    "timestamp": "2025-10-03T05:55:24Z"
  },
  {
    "title": "Newsom threatens state funding for California universities that agree to Trump demands (Sophia Bollag/San Francisco Chronicle)",
    "description": "Sophia Bollag / San Francisco Chronicle:\nNewsom threatens state funding for California universities that agree to Trump demands  —  SACRAMENTO — Gov. Gavin Newsom threatened Thursday to withhold state funding from California universities that agree to new pol…",
    "link": "https://www.memeorandum.com/251003/p5",
    "timestamp": "2025-10-03T05:55:00Z"
  },
  {
    "title": "Trump piles pain on Democrats over US government shutdown",
    "description": "Donald Trump signaled Thursday that he plans to follow through on his threat for mass layoffs of U.S. federal workers as he ratcheted pressure on Democrats to back moves to end the government shutdown.",
    "link": "https://www.hurriyetdailynews.com/trump-piles-pain-on-democrats-over-us-government-shutdown-214262",
    "timestamp": "2025-10-03T05:52:46Z"
  },
  {
    "title": "Trump at Quantico: Demented Ramblings",
    "description": "The government shutdown is …taking over the political conversation…But I urge everyone not to overlook the dangerous speech Donald Trump (and Pete Hegseth) gave yesterday in front of members of the U.S. military. It was an unhinged rant, in which Trump told h…",
    "link": "https://www.counterpunch.org/2025/10/03/trump-at-quantico-demented-ramblings/",
    "timestamp": "2025-10-03T05:52:17Z"
  },
  {
    "title": "New York Judge To Sentence Sean 'Diddy' Combs After Blockbuster Trial",
    "description": "Sean \"Diddy\" Combs will be sentenced Friday for his conviction on two prostitution-related counts, crimes prosecutors say deserve more than a decade behind bars as the music mogul seeks \"mercy\" and a swift release.",
    "link": "https://www.ibtimes.com/new-york-judge-sentence-sean-diddy-combs-after-blockbuster-trial-3785373",
    "timestamp": "2025-10-03T05:48:14Z"
  },
  {
    "title": "New York Judge To Sentence Sean 'Diddy' Combs After Blockbuster Trial",
    "description": "Sean \"Diddy\" Combs will be sentenced Friday for his conviction on two prostitution-related counts, crimes prosecutors say deserve more than a decade behind bars as the music mogul seeks \"mercy\" and a swift release.",
    "link": "https://www.ibtimes.com.au/new-york-judge-sentence-sean-diddy-combs-after-blockbuster-trial-1860702",
    "timestamp": "2025-10-03T05:48:11Z"
  },
  {
    "title": "Democrats take major gamble over US government shutdown",
    "description": "Democrats’ refusal to pass funding Bill sees Republicans threaten mass federal lay-offs",
    "link": "https://www.irishtimes.com/world/us/2025/10/03/democrats-take-major-gamble-over-us-government-shutdown/",
    "timestamp": "2025-10-03T05:47:58Z"
  },
  {
    "title": "Thoughts From the Shutdown",
    "description": "As we go through Trump Shutdown IV, I had a few thoughts to share. Montana Senator Steve Daines – Truth Telling Republican At a time when Vice President Vance is running around saying that the shutdown is because Democrats want to give free health care to “il…",
    "link": "https://www.counterpunch.org/2025/10/03/thoughts-from-the-shutdown/",
    "timestamp": "2025-10-03T05:46:57Z"
  },
  {
    "title": "Late Night Pop Cult Open Thread: Bad, Bad Bunny!",
    "description": "Trump advisor Corey Lewandowski has threatened that ICE agents could potentially deport attendees at Bad Bunny’s Super Bowl LX halftime show. [image or embed] — The Daily Beast (@thedailybeast.bsky.social) October 1, 2025 at 7:31 PM Musical icon versus ICE Ba…",
    "link": "https://balloon-juice.com/2025/10/03/late-night-pop-cult-open-thread-bad-bad-bunny/",
    "timestamp": "2025-10-03T05:46:18Z"
  },
  {
    "title": "US Seeks to Make Kurdish Oil Exports Long-Lasting After Key Deal",
    "description": "The Trump administration is working to ensure oil exports from northern Iraq, which resumed after a two-year halt, keep flowing in the long term to bolster the nation’s economy, benefit US companies and counter Iran’s influence in the region.",
    "link": "https://financialpost.com/pmn/business-pmn/us-seeks-to-make-kurdish-oil-exports-long-lasting-after-key-deal",
    "timestamp": "2025-10-03T05:42:42Z"
  },
  {
    "title": "Asian shares are mixed as tech shares lead Wall Street ticks to more records",
    "description": "Asian shares are mixed after U.S. stocks rose to more records on heavy buying of technology shares",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-mixed-tech-shares-lead-wall-street-126171505",
    "timestamp": "2025-10-03T05:41:32Z"
  },
  {
    "title": "Former Israeli hostage 'very worried' Trump's peace plan will not happen",
    "description": "Eli Sharabi tells BBC in a rare interview that Trump must \"finish the job\" by ensuring the release of the remaining 48 hostages.",
    "link": "https://www.bbc.com/news/articles/cwyw2pgjg1no",
    "timestamp": "2025-10-03T05:30:17Z"
  },
  {
    "title": "Texas megachurch founder Robert Morris pleads guilty to child sex abuse charges",
    "description": "Authorities say a Texas megachurch founder has pleaded guilty to lewd and indecent acts with a child after he was accused of sexually abusing a young girl in the 1980s in Oklahoma while he was a traveling minister",
    "link": "https://abcnews.go.com/US/wireStory/texas-megachurch-founder-robert-morris-pleads-guilty-child-126164118",
    "timestamp": "2025-10-03T05:17:21Z"
  },
  {
    "title": "Green Party leader rejects 'radical' tag",
    "description": "Zack Polanski speaks to BBC South East on the party's new approach ahead of the party's conference.",
    "link": "https://www.bbc.com/news/articles/c20e20rzje2o",
    "timestamp": "2025-10-03T05:16:53Z"
  },
  {
    "title": "AGOA Crisis: Ruto Engages Industry As US Deal Expires",
    "description": "The closed-door meeting that took place at State House, Nairobi came in the wake of fears that thousands of Kenyans could lose their jobs following the expiry of AGOA.",
    "link": "https://thekenyatimes.com/business/ruto-convenes-meeting-amid-agoa-fears/",
    "timestamp": "2025-10-03T05:16:16Z"
  },
  {
    "title": "Seth Meyers Calls Out Trump's 'Bulls**t' From This Massive Meeting Brag",
    "description": "The \"Late Night\" host knocked the president for \"openly admitting\" he lied on the campaign trail.",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-project-2025_n_68df39a4e4b061291b1469ec",
    "timestamp": "2025-10-03T05:13:16Z"
  },
  {
    "title": "Japan's ruling party is in crisis as voters swing to right-wing rivals",
    "description": "Article URL: https://www.cnn.com/2025/10/02/asia/japan-ruling-party-election-explainer-intl-hnk\nComments URL: https://news.ycombinator.com/item?id=45459214\nPoints: 12\n# Comments: 0",
    "link": "https://www.cnn.com/2025/10/02/asia/japan-ruling-party-election-explainer-intl-hnk",
    "timestamp": "2025-10-03T05:10:36Z"
  },
  {
    "title": "Asim Munir’s strategic gamble with Trump",
    "description": "President Trump's meeting with Pakistan's Army Chief Munir signals a dramatic US policy U-turn, re-engaging Islamabad despite its unreliability. Pakistan leverages strategic exaggeration and offers military support for Gaza to regain American favour. This val…",
    "link": "https://economictimes.indiatimes.com/news/defence/asim-munirs-strategic-gamble-with-trump/articleshow/124283488.cms",
    "timestamp": "2025-10-03T05:08:26Z"
  },
  {
    "title": "Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals",
    "description": "President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its architects works to use the government shutdown to accelerate his goals of slashing the size of the fed…",
    "link": "https://japantoday.com/category/world/trump-no-longer-distancing-himself-from-project-2025-as-he-uses-shutdown-to-further-pursue-its-goals",
    "timestamp": "2025-10-03T05:08:14Z"
  },
  {
    "title": "Justine McCarthy: Netanyahu and Trump have a lot in common but only one of them is an evil genius",
    "description": "Israeli prime minister has duped the vainglorious Trump into thinking his ‘eternal peace’ document is not what it actually is – a licence to continue the genocide",
    "link": "https://www.irishtimes.com/opinion/2025/10/03/justine-mccarthy-netanyahu-and-trump-have-a-lot-in-common-but-only-one-of-them-is-an-evil-genius/",
    "timestamp": "2025-10-03T05:00:01Z"
  },
  {
    "title": "Like Bethpage next year’s Irish Open at Trump’s Doonbeg will be about more than golf",
    "description": "The decision to use Co Clare links course for the national Open is divisive",
    "link": "https://www.irishtimes.com/sport/golf/2025/10/03/like-bethpage-next-years-irish-open-at-trumps-doonbeg-will-be-about-more-than-golf/",
    "timestamp": "2025-10-03T05:00:00Z"
  },
  {
    "title": "Bloomberg: “Climate Deniers are Increasingly Hiding in Plain Sight”",
    "description": "Are you or have you ever been a climate denier?",
    "link": "https://wattsupwiththat.com/2025/10/02/bloomberg-climate-deniers-are-increasingly-hiding-in-plain-sight/",
    "timestamp": "2025-10-03T05:00:00Z"
  },
  {
    "title": "Paper reactors and paper tigers",
    "description": "(I wrote this piece a week or so ago, meant to do a bit more work but haven’t got around to it. Hence slightly dated allusions) The culmination of Donald Trump’s state visit to the UK was a press conference at which both American and British leaders waved pie…",
    "link": "https://crookedtimber.org/2025/10/03/paper-reactors-and-paper-tigers/",
    "timestamp": "2025-10-03T04:57:19Z"
  },
  {
    "title": "Venezuela reports ‘illegal’ US F-35 flight near its borders",
    "description": "Venezuela has accused the US of “illegally” flying F-35s near its borders amid rising tensions in the Caribbean Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625842-venezuela-us-f35-jets/",
    "timestamp": "2025-10-03T04:56:39Z"
  },
  {
    "title": "What the history of US government shutdowns tells us",
    "description": "While shutdowns have been a possibility since 1976, when Congress introduced the modern budget process, they've been a relatively rare occurrence. Here's a look at how previous shutdowns have played out.",
    "link": "https://www.abc.net.au/news/2025-10-03/us-government-shutdown-history/105848348",
    "timestamp": "2025-10-03T04:49:13Z"
  },
  {
    "title": "Asian shares are mixed as tech shares lead Wall Street ticks to more records",
    "description": "MANILA, Philippines (AP) — Asian shares were mixed on Friday after heavy buying of tech shares led benchmarks on Wall Street to more records. US. futures and oil prices were higher. Markets have largely shrugged off the shutdown of the U.S. government after D…",
    "link": "https://financialpost.com/pmn/asian-shares-are-mixed-as-tech-shares-lead-wall-street-ticks-to-more-records",
    "timestamp": "2025-10-03T04:48:09Z"
  },
  {
    "title": "Silicon Valley Rep. Ro Khanna says the H-1B visa needs change — but a 'blanket' $100k fee isn't the solution",
    "description": "Ro Khanna said that the H-1B system needs changes. But he said the $100,000 fee could hurt startups, many of which are located in his district.",
    "link": "https://www.businessinsider.com/ro-khanna-blanket-100k-fee-on-h1b-not-the-solution-2025-10",
    "timestamp": "2025-10-03T04:43:29Z"
  },
  {
    "title": "Asian shares are mixed as tech shares lead Wall Street ticks to more records",
    "description": "Asian shares were mixed on Friday after heavy buying of tech shares led benchmarks on Wall Street to more records.  Markets have largely shrugged off the...",
    "link": "https://finance.yahoo.com/news/asian-shares-mixed-tech-shares-044208815.html",
    "timestamp": "2025-10-03T04:42:08Z"
  },
  {
    "title": "Wall Street finishes its winning week with more records",
    "description": "Most U.S. stocks ticked higher on Friday, sending Wall Street to more records.  Usually, the first Friday of each month has Wall Street transfixed on the...",
    "link": "https://finance.yahoo.com/news/asian-shares-mixed-tech-shares-044208437.html",
    "timestamp": "2025-10-03T04:42:08Z"
  },
  {
    "title": "Putin says global economy can’t function without Russian oil",
    "description": "President Vladimir Putin said on Thursday that the global economy would suffer without Russian oil, warning that prices would jump to over $100 per barrel if its supplies were cut off.",
    "link": "https://www.thehindubusinessline.com/news/world/putin-says-global-economy-cant-function-without-russian-oil/article70120059.ece",
    "timestamp": "2025-10-03T04:41:43Z"
  },
  {
    "title": "Kamala Harris still blaming Gaza protesters",
    "description": "Democratic voters recognize reality of genocide as elected officials and mainstream media fall short.",
    "link": "https://electronicintifada.net/blogs/michael-f-brown/kamala-harris-still-blaming-gaza-protesters",
    "timestamp": "2025-10-03T04:34:00Z"
  },
  {
    "title": "Apple removes US immigration enforcement tracker from app store",
    "description": "Apple removed several apps, including ICEBlock, used to track US Immigration and Customs Enforcement (ICE) agents from its App Store on Thursday. This action reportedly followed Trump administration pressure, citing safety concerns for officers after a deadly…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/apple-removes-us-immigration-enforcement-tracker-from-app-store/articleshow/124283039.cms",
    "timestamp": "2025-10-03T04:33:24Z"
  },
  {
    "title": "Antifa Whistleblower Shares What Made Him Quit After 10 Years",
    "description": "An Antifa whistleblower said he left the now-designated terrorist organization after a decade due to \"pressure\" and \"ostracization\" from other members.",
    "link": "https://dailycaller.com/2025/10/03/antifa-whistleblower-shares-what-made-him-quit-after-10-years/",
    "timestamp": "2025-10-03T04:31:35Z"
  },
  {
    "title": "Donald Trump using shutdown to inflict pain on ‘radical left’ and cut Democrat agencies",
    "description": "US president Donald Trump said he was meeting with his budget director Russell Vought to determine which “Democrat Agencies” to cut, as he looks to inflict pain on his political opposition in the second day of a government shutdown.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-using-shutdown-to-inflict-pain-on-radical-left-and-cut-democrat-agencies/a1026043890.html",
    "timestamp": "2025-10-03T04:30:00Z"
  },
  {
    "title": "‘It is beyond revenge, enough is enough’ – Egypt calls for peace agreement, but says ball now in Hamas court",
    "description": "Egypt’s foreign minister said yesterday that Cairo was working with Qatar and Turkey to convince Hamas to accept US president Donald Trump’s plan to end a nearly two-year-old war in Gaza, and warned the conflict would escalate if the militant group refused.",
    "link": "https://www.independent.ie/world-news/middle-east/it-is-beyond-revenge-enough-is-enough-egypt-calls-for-peace-agreement-but-says-ball-now-in-hamas-court/a1369281958.html",
    "timestamp": "2025-10-03T04:30:00Z"
  },
  {
    "title": "US judge rejects Kilmar Abrego Garcia’s bid for asylum",
    "description": "A US judge has denied a bid for asylum from Kilmar Abrego ­Garcia, whose case has been at the centre of a power struggle over immigration policy.",
    "link": "https://www.independent.ie/world-news/north-america/us-judge-rejects-kilmar-abrego-garcias-bid-for-asylum/a1605821347.html",
    "timestamp": "2025-10-03T04:30:00Z"
  },
  {
    "title": "Letters: Looking at how hospitals allocate beds, it really is no wonder we have a crisis",
    "description": "I note that Hiqa “makes clear that at the heart of the ongoing risk to patients’ safety is lack of beds”.",
    "link": "https://www.independent.ie/opinion/letters/letters-looking-at-how-hospitals-allocate-beds-it-really-is-no-wonder-we-have-a-crisis/a586729199.html",
    "timestamp": "2025-10-03T04:30:00Z"
  },
  {
    "title": "Vladimir Putin hits back at Donald Trump and says Russia is ready to respond to any European threat",
    "description": "Russian president Vladimir Putin ­criticised US president Donald Trump for calling Russia a “paper tiger” and said Moscow would respond swiftly if it thinks Europe is provoking it.",
    "link": "https://www.independent.ie/world-news/europe/vladimir-putin-hits-back-at-donald-trump-and-says-russia-is-ready-to-respond-to-any-european-threat/a1091408153.html",
    "timestamp": "2025-10-03T04:30:00Z"
  },
  {
    "title": "Trump administration taps Army Reserve and National Guard for temporary immigration judges",
    "description": "The Trump administration is tapping National Guard and Army Reserve lawyers to be temporary immigration judges after firing dozens of existing judges",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-taps-army-reserve-national-guard-temporary-126170959",
    "timestamp": "2025-10-03T04:29:33Z"
  },
  {
    "title": "FACT FOCUS: Democrats did not shut down government to give health care to immigrants - NewsBreak",
    "description": "President Donald Trump and other high-ranking Republicans claim Democrats forced the government shutdown fight because they want to give free health care t",
    "link": "https://www.newsbreak.com/share/4269009889946-fact-focus-democrats-did-not-shut-down-government-to-give-health-care-to-immigrants?s=a2&amp;share_destination_id=MzIxMDgwNTMyLTE3NTk0NjU2OTcxOTQ%3D&amp;pd=0LjDiGMs&amp;hl=en_US&amp;send_time=1759465697&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1",
    "timestamp": "2025-10-03T04:28:46Z"
  },
  {
    "title": "Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals",
    "description": "President Donald Trump is now openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-longer-distancing-project-2025-shutdown-pursue-goals-126170597",
    "timestamp": "2025-10-03T04:21:35Z"
  },
  {
    "title": "Trump administration taps Army Reserve and National Guard for temporary immigration judges",
    "description": "The Trump administration is deploying National Guard and Army Reserve lawyers as temporary immigration judges, aiming to address court backlogs and support its immigration crackdown. This move follows the firing of existing judges, raising concerns among expe…",
    "link": "https://economictimes.indiatimes.com/nri/latest-updates/trump-administration-taps-army-reserve-and-national-guard-for-temporary-immigration-judges/articleshow/124282843.cms",
    "timestamp": "2025-10-03T04:17:48Z"
  },
  {
    "title": "Tesla's former global sales chief says there are so many EV models now that the market can grow without subsidies",
    "description": "Tesla's former president for global sales, Jon McNeill, said the EV market in Europe continued to grow even when subsidies were rolled back there.",
    "link": "https://www.businessinsider.com/tesla-ex-global-sales-chief-ev-market-grow-without-subsidies-2025-10",
    "timestamp": "2025-10-03T04:13:31Z"
  },
  {
    "title": "FACT FOCUS: Democrats did not shut down government to give health care to immigrants - NewsBreak",
    "description": "President Donald Trump and other high-ranking Republicans claim Democrats forced the government shutdown fight because they want to give free health care t",
    "link": "https://www.newsbreak.com/share/4269009889946-fact-focus-democrats-did-not-shut-down-government-to-give-health-care-to-immigrants?s=a2&amp;share_destination_id=MTU4Njc5MjcxLTE3NTk0NjQ1ODQ2OTE%3D&amp;pd=0Ajnj5wi&amp;hl=en_US&amp;send_time=1759464584&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-03T04:12:27Z"
  },
  {
    "title": "Czechs Head To Polls With Billionaire Ex-premier Tipped To Come First",
    "description": "Czechs will cast ballots on Friday and Saturday in a general election which the party of self-described \"Trumpist\" Andrej Babis is expected to top, though without getting a majority.",
    "link": "https://www.ibtimes.com/czechs-head-polls-billionaire-ex-premier-tipped-come-first-3785363",
    "timestamp": "2025-10-03T04:12:15Z"
  },
  {
    "title": "Czechs head to polls with billionaire ex-premier tipped to come first",
    "description": "Czechs will cast ballots on Friday and Saturday in a general election which the party of self-described “Trumpist” Andrej Babis is expected to top, though without getting a majority. A possible return to power of the billionaire ex-premier could draw the Czec…",
    "link": "https://www.digitaljournal.com/world/czechs-head-to-polls-with-billionaire-ex-premier-tipped-to-come-first/article",
    "timestamp": "2025-10-03T04:07:20Z"
  },
  {
    "title": "Czechs head to polls with billionaire ex-premier tipped to come first",
    "description": "Czechs will cast ballots on Friday and Saturday in a general election which the party of self-described \"Trumpist\" Andrej Babis is expected to top, though...",
    "link": "https://www.yahoo.com/news/articles/czechs-head-polls-billionaire-ex-040650185.html",
    "timestamp": "2025-10-03T04:06:50Z"
  },
  {
    "title": "New Mexico Legislature approves bills to prop up rural health care",
    "description": "New Mexico legislators moved quickly to prop up funding for food assistance and rural health care services in response to President Donald Trump’s cuts in federal spending on Medicaid and nutrition programs",
    "link": "https://abcnews.go.com/Politics/wireStory/new-mexico-legislature-approves-bills-prop-rural-health-126166522",
    "timestamp": "2025-10-03T04:06:31Z"
  },
  {
    "title": "How Donald Trump Surrendered on Greentech to China Abroad and to Big Oil at Home",
    "description": "( Middle East Monitor ) - Ours would be the normal story of imperial powers rising and falling on Planet Earth — nothing new there, of course — if it weren’t for one thing: the fact that this world, too, is now falling. Unfortunately, nothing is truly normal …",
    "link": "https://www.juancole.com/2025/10/donald-surrendered-greentech.html",
    "timestamp": "2025-10-03T04:04:19Z"
  },
  {
    "title": "Pressuring Putin: A Play in Three Acts",
    "description": "Before they were a government, Ukraine’s President Volodymyr Zelensky and many of the people who have surrounded him, including his chief of staff and closest adviser, Andriy Yermak, wrote and produced TV shows and movies. Writing scripts may be what they do …",
    "link": "https://www.theamericanconservative.com/pressuring-putin-a-play-in-three-acts/",
    "timestamp": "2025-10-03T04:03:00Z"
  },
  {
    "title": "Musing About Trump’s Recent Moves",
    "description": "U.S. President Donald Trump is pushing his country into an uncomfortable direction. What might be the reasons for him to do so? His recent address to a gathering of all military commanders included the demand to fight the ‘enemy’ within the country: He did, h…",
    "link": "https://www.lewrockwell.com/2025/10/no_author/musing-about-trumps-recent-moves/",
    "timestamp": "2025-10-03T04:01:00Z"
  },
  {
    "title": "New York judge to sentence Sean ‘Diddy’ Combs after blockbuster trial",
    "description": "Sean “Diddy” Combs will be sentenced Friday for his conviction on two prostitution-related counts, crimes prosecutors say deserve more than a decade behind bars as the music mogul seeks “mercy” and a swift release. Following two months of often searing testim…",
    "link": "https://www.digitaljournal.com/world/new-york-judge-to-sentence-sean-diddy-combs-after-blockbuster-trial/article",
    "timestamp": "2025-10-03T04:01:00Z"
  },
  {
    "title": "Trump no longer distancing himself from Project 2025 as he uses shutdown to further pursue its goals",
    "description": "President Donald Trump is openly embracing the conservative blueprint he desperately tried to distance himself from during the 2024 campaign, as one of its...",
    "link": "https://www.yahoo.com/news/articles/trump-no-longer-distancing-himself-040016714.html",
    "timestamp": "2025-10-03T04:00:16Z"
  },
  {
    "title": "Senator Booker: Neither a Spartacus nor a Socrates is he",
    "description": "The Bible tells the story of a tax collector beating his chest in an act of sorrow. This is quite different from the reason we have seen Senator Cory Booker (D-NJ) beat his chest during some Senate hearings. The tax collector’s chest beating re...",
    "link": "https://www.americanthinker.com/blog/2025/10/senator_booker_neither_a_spartacus_nor_a_socrates_is_he.html",
    "timestamp": "2025-10-03T04:00:00Z"
  },
  {
    "title": "Chuck is in deep trouble",
    "description": "It's entertaining to watch the Democrats defend their decision to close down the government. Yes they did, no matter how many times they try to blame the Orange Man. In other words, Chuck has a bad hand and he knows it. This is from Ingrid J...",
    "link": "https://www.americanthinker.com/blog/2025/10/chuck_is_in_deep_trouble.html",
    "timestamp": "2025-10-03T04:00:00Z"
  },
  {
    "title": "FDA approves another generic abortion pill, prompting outrage from conservatives",
    "description": "Federal health officials have approved another generic version of the abortion pill, prompting outrage from some abortion opponents aligned with President Donald Trump",
    "link": "https://biztoc.com/x/8752b2cf50dc0080",
    "timestamp": "2025-10-03T03:59:03Z"
  },
  {
    "title": "European Leaders Caught On Camera Laughing Over Trump's Confusion",
    "description": "The president has famously struggled with the names of these countries.",
    "link": "https://www.huffpost.com/entry/european-leaders-trump-laugh_n_68df3fdce4b061291b146c9f",
    "timestamp": "2025-10-03T03:58:06Z"
  }
]