[
  {
    "title": "Venezuelan opposition leader seized by armed men after being released from jail",
    "description": "María Corina Machado said Venezuelan opposition leader Juan Pablo Guanipa was seized by armed men in Caracas after his release from prison.",
    "link": "https://www.foxnews.com/world/venezuelan-opposition-leader-seized-armed-men-after-being-released-from-jail",
    "timestamp": "2026-02-09T17:44:39Z"
  },
  {
    "title": "Ed Martin Denies Rift With Deputy AG Todd Blanche",
    "description": "Pardon Attorney Ed Martin denied claims of friction between him and Deputy Attorney General Todd on Monday.",
    "link": "https://dailycaller.com/2026/02/09/ed-martin-denies-rift-with-deputy-ag-todd-blanche/",
    "timestamp": "2026-02-09T17:43:45Z"
  },
  {
    "title": "At Least One Country Is Having a Serious Epstein Reckoning",
    "description": "U.K. Prime Minister Keir Starmer is facing Cabinet resignations and calls to step down for appointing Epstein friend Peter Mandelson as U.S. ambassador.",
    "link": "http://nymag.com/intelligencer/article/the-u-k-s-real-political-crisis-over-epstein-and-mandelson.html",
    "timestamp": "2026-02-09T17:43:36Z"
  },
  {
    "title": "US snowboard star Chloe Kim calls for unity after Trump bashes teammate over immigrant crackdown",
    "description": "Chloe Kim and Eileen Gu, two Olympic standouts who have faced their share of hate over the years, each weighed in Monday on Donald Trump's bashing of their friend, American freeskier Hunter Hess, for having said he didn't back the U.S. president's heightened …",
    "link": "https://sports.yahoo.com/articles/us-snowboard-star-chloe-kim-173948498.html",
    "timestamp": "2026-02-09T17:39:48Z"
  },
  {
    "title": "Bill Maher Vents to Jimmy Kimmel’s Former Co-Host About His Feud With ABC Host: ‘I Don’t Think I Did Anything Wrong’",
    "description": "Bill Maher opened up about his ongoing feud with late-night host Jimmy Kimmel during an interview with Kimmel's former co-host Adam Carolla on Monday.\nThe post Bill Maher Vents to Jimmy Kimmel’s Former Co-Host About His Feud With ABC Host: ‘I Don’t Think I Di…",
    "link": "https://www.mediaite.com/media/tv/bill-maher-vents-to-jimmy-kimmels-former-co-host-about-his-feud-with-abc-host-i-dont-think-i-did-anything-wrong/",
    "timestamp": "2026-02-09T17:39:20Z"
  },
  {
    "title": "Arizona Mexican restaurant offering free meals to ICE agents sparks online reaction",
    "description": "A Trump-backing Arizona restaurant owner offers free meals to ICE agents, faces fierce online backlash and boycott threats over immigration enforcement support policy.",
    "link": "https://www.foxnews.com/media/arizona-mexican-restaurant-offering-free-meals-ice-agents-sparks-online-reaction",
    "timestamp": "2026-02-09T17:39:09Z"
  },
  {
    "title": "Gabbard’s office denies wrongdoing amid scrutiny over whistleblower complaint",
    "description": "ODNI said she acted within her authority in response to reports describing an NSA-intercepted phone call tied to the case.",
    "link": "https://www.nextgov.com/people/2026/02/gabbards-office-denies-wrongdoing-amid-scrutiny-over-whistleblower-complaint/411287/",
    "timestamp": "2026-02-09T17:39:00Z"
  },
  {
    "title": "US Vice President Vance in Armenia for peace talks",
    "description": "Vice President JD Vance became the highest-ranking US politician ever to visit Armenia. He will travel to Azerbaijan on Tuesday in hopes of finalizing a peace deal kicked off in the White House last August.",
    "link": "https://www.dw.com/en/us-vice-president-vance-in-armenia-for-peace-talks/a-75885494",
    "timestamp": "2026-02-09T17:36:00Z"
  },
  {
    "title": "US, Armenia sign nuclear deal during Vance visit",
    "description": "During a visit by Vice President JD Vance, the US and Armenia agreed to cooperate in the civil nuclear sector. Vance will also travel to Azerbaijan, hoping to finalize a peace deal kicked off in the White House.",
    "link": "https://www.dw.com/en/us-armenia-sign-nuclear-deal-during-vance-visit/a-75885494",
    "timestamp": "2026-02-09T17:36:00Z"
  },
  {
    "title": "US military boards sanctioned oil tanker in the Indian Ocean after pursuit from the Caribbean",
    "description": "The Pentagon didn't say whether the ship was connected to Venezuela.",
    "link": "https://www.bostonherald.com/2026/02/09/pentagon-oil-tanker/",
    "timestamp": "2026-02-09T17:35:54Z"
  },
  {
    "title": "US shifts NATO commands to Britain, Italy",
    "description": "The US is handing over two key NATO commands to European allies, a significant NATO commands shift as President Trump pushes for greater responsibility.\n\nRead More: https://punchng.com/us-shifts-nato-commands-to-britain-italy/",
    "link": "https://punchng.com/?p=2059628",
    "timestamp": "2026-02-09T17:35:13Z"
  },
  {
    "title": "Trump Bashes Bad Bunny Super Bowl Show He Said He Was Skipping, Gets Clowned",
    "description": "On Sunday (Feb. 8), the Puerto Rican superstar Bad Bunny thrilled the audience at the 2026 Super Bowl halftime show. The most vocal critic of his performance was President Donald Trump, who soundly slammed him on his Truth Social media platform – and was swif…",
    "link": "https://hiphopwired.com/3037267/trump-bashes-bad-bunny-super-bowl-show-gets-clowned/",
    "timestamp": "2026-02-09T17:35:10Z"
  },
  {
    "title": "Ghislaine Maxwell declined to answer questions from a House committee, citing 5th Amendment rights",
    "description": "House lawmakers tried Monday to interview Ghislaine Maxwell, but the former girlfriend and confidant of Jeffrey Epstein invoked her Fifth Amendment rights to avoid answering questions that would be self-incriminating.",
    "link": "https://www.wpxi.com/news/local/ghislaine-maxwell-declined-answer-questions-house-committee-citing-5th-amendment-rights/XIPSAAXNEJECXMMKEP3IIGH7TQ/",
    "timestamp": "2026-02-09T17:35:01Z"
  },
  {
    "title": "Ghislaine Maxwell Refuses to Testify Unless Trump Grants Clemency, Lawyer Says",
    "description": "Maxwell’s lawyer warned on Monday that she would not say a word unless Trump intervenes with clemency after she declined to answer questions before Congress.\nThe post Ghislaine Maxwell Refuses to Testify Unless Trump Grants Clemency, Lawyer Says first appeare…",
    "link": "https://www.mediaite.com/media/news/ghislaine-maxwell-refuses-to-testify-unless-trump-grants-clemency-lawyer-says/",
    "timestamp": "2026-02-09T17:34:02Z"
  },
  {
    "title": "Bad Bunny Mysteriously Deletes All Instagram Posts After Super Bowl Halftime Show",
    "description": "Bad Bunny has inexplicably scrubbed all of his Instagram posts in the hours since his Super Bowl Halftime Show performance in California on Sunday evening.\nThe post Bad Bunny Mysteriously Deletes All Instagram Posts After Super Bowl Halftime Show first appear…",
    "link": "https://www.mediaite.com/media/entertainment/bad-bunny-mysteriously-deletes-all-instagram-posts-after-super-bowl-halftime-show/",
    "timestamp": "2026-02-09T17:33:39Z"
  },
  {
    "title": "WATCH: Ghislaine Maxwell not cooperating because she is campaigning for Trump pardon, Democrats say",
    "description": "An attorney for Ghislaine Maxwell told lawmakers Manday that she would be willing to testify that neither President Donald Trump nor former President Bill Clinton were culpable for wrongdoing in their relationships with Epstein, according to both Democratic a…",
    "link": "https://www.pbs.org/newshour/politics/watch-ghislaine-maxwell-not-cooperating-because-she-is-campaigning-for-trump-pardon-democrats-say",
    "timestamp": "2026-02-09T17:32:26Z"
  },
  {
    "title": "US set to relinquish several senior NATO command posts",
    "description": "The United States is transferring leadership of two key NATO regional commands to Italy and Britain as part of a broader push for allies to increase defense responsibilities.",
    "link": "https://economictimes.indiatimes.com/news/defence/us-set-to-relinquish-several-senior-nato-command-posts/articleshow/128124627.cms",
    "timestamp": "2026-02-09T17:31:25Z"
  },
  {
    "title": "Doctors increasingly see AI scribes in a positive light. But hiccups persist",
    "description": "AI's potential to transform the health care system is an area of intense focus.",
    "link": "https://www.bostonherald.com/2026/02/09/health-care-ai-scribes/",
    "timestamp": "2026-02-09T17:31:23Z"
  },
  {
    "title": "‘White With Fear,’ Coming To PBS Next Month, Argues Conservative Politicians “Successfully Weaponized Racism And Fear For Decades”",
    "description": "EXCLUSIVE: President Trump’s dissemination of a video last week depicting former Pres. Obama and First Lady Michelle Obama as apes has earned widespread condemnation. But it’s not the first time Republican Party leaders have used racist imagery for political …",
    "link": "http://deadline.com/2026/02/white-with-fear-pbs-documentary-1236712929/",
    "timestamp": "2026-02-09T17:30:00Z"
  },
  {
    "title": "Bombshell Report Reveals Minnesota Officials Were Right About FBI",
    "description": "Donald Trump’s Department of Justice blocked prosecutors in Minnesota from investigating Renee Good’s killing, several people told The New York Times. Before he resigned from his role last month, former acting U.S. Attorney Joseph H. Thompson emailed colleagu…",
    "link": "https://newrepublic.com/post/206355/minnesota-officials-fbi-investigation-renee-nicole-good",
    "timestamp": "2026-02-09T17:26:26Z"
  },
  {
    "title": "Musk shifts focus to Moon as Mars mission remains years away",
    "description": "Elon Musk took to X to proclaim that SpaceX would focus on building out a base on the moon before sending humans to Mars.",
    "link": "https://www.mercurynews.com/2026/02/09/elon-musk-shifts-focus-moon/",
    "timestamp": "2026-02-09T17:25:42Z"
  },
  {
    "title": "Cuba Makes Major Fuel Shortage Announcement",
    "description": "Cuba’s government says international airlines can’t refuel on the island nation starting Monday. Cuban authorities issued an official Notice to Airmen over the weekend, warning... Read More\nThe post Cuba Makes Major Fuel Shortage Announcement appeared first o…",
    "link": "https://www.dailysignal.com/2026/02/09/cuba-makes-major-fuel-shortage-announcement/",
    "timestamp": "2026-02-09T17:25:36Z"
  },
  {
    "title": "In this Trump era, the Olympics are no longer neutral ground for American politics",
    "description": "Officials avoided answering questions about President Donald Trump calling a U.S. skier a 'real Loser' after the athlete expressed 'mixed feelings' about representing his divided nation",
    "link": "https://nationalpost.com/sports/olympics/olympics-no-longer-neutral-ground-u-s-politics",
    "timestamp": "2026-02-09T17:25:01Z"
  },
  {
    "title": "MAHA’s Views on Food Are Widely Popular. Its Anti-Vaccine Identity Isn’t.",
    "description": "Even the MAHA base says in polling that they don't trust RFK Jr.'s views on vaccines. So why is he crafting vaccine policy?",
    "link": "https://www.jezebel.com/maha-platform-position-vaccine-food-safety-pyramid-polling-candidates-measles",
    "timestamp": "2026-02-09T17:24:53Z"
  },
  {
    "title": "JPMorgan’s nationwide home price forecast hides a Sun Belt full of pain. Watch out, Florida and Texas",
    "description": "JPMorgan Global Research sees prices falling quickest on the West Coast and in the Sun Belt.",
    "link": "https://fortune.com/2026/02/09/housing-market-outlook-forecast-home-prices-0-percent-growth-2026-trump-mortgage-rates/",
    "timestamp": "2026-02-09T17:23:11Z"
  },
  {
    "title": "The View’s Ana Navarro Gets Emotional Over Bad Bunny’s Performance: ‘Can’t Overstate What it Means’ After What Trump ‘Has Done to My Community’",
    "description": "Ana Navarro heralded Bad Bunny's Super Bowl half time performance as a \"micro joy\" needed to help with \"macro sadness\" being experienced by Latinos.\nThe post The View’s Ana Navarro Gets Emotional Over Bad Bunny’s Performance: ‘Can’t Overstate What it Means’ A…",
    "link": "https://www.mediaite.com/media/news/the-views-ana-navarro-gets-emotional-over-bad-bunnys-performance-cant-overstate-what-it-means-after-what-trump-has-done-to-my-community/",
    "timestamp": "2026-02-09T17:22:02Z"
  },
  {
    "title": "Paul Thomas Anderson, Jonny Greenwood want 'Phantom Thread' score pulled from 'Melania' movie",
    "description": "Director Paul Thomas Anderson and Radiohead’s Jonny Greenwood requested that music from their 2017 film “Phantom Thread” be removed from the Melania Trump documentary.",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/paul-thomas-anderson-jonny-greenwood-want-phantom-thread-score-pulled-rcna258192",
    "timestamp": "2026-02-09T17:20:59Z"
  },
  {
    "title": "US senators visit Greenland to 'rebuild trust' broken by Trump",
    "description": "The visit comes after the US president backed off from a series of threats to take over the Arctic Island and agreed to a \"framework\" deal.",
    "link": "https://www.channelnewsasia.com/world/us-senators-trump-greenland-denmark-5918461",
    "timestamp": "2026-02-09T17:20:00Z"
  },
  {
    "title": "Great News! The Turning Point USA Halftime Show Is On!",
    "description": "Isn’t Bad Bunny an American artist? Don’t millions of people love his music? At the Turning Point USA alternative show, we forget about all that.",
    "link": "https://www.theatlantic.com/newsletters/2026/02/turning-point-usa-halftime-show/685932/",
    "timestamp": "2026-02-09T17:19:00Z"
  },
  {
    "title": "Trump’s anti-DEI orders can proceed after appeals courts ends block",
    "description": "A preliminary injunction blocking President Donald Trump’s executive orders to withhold federal funding for diversity, equity and inclusion grants and contracts was lifted by the 4th U.S. Circuit Court of Appeals at Richmond, Virginia, on Friday.",
    "link": "https://www.abajournal.com/news/article/trumps-anti-dei-orders-can-proceed-after-appeals-courts-ends-block",
    "timestamp": "2026-02-09T17:18:00Z"
  },
  {
    "title": "Where Sanders and AOC backed progressive congressional candidate Analilia Mejia stands on key issues",
    "description": "Where progressive Analilia Mejia, the Bernie Sanders and AOC back candidate who is close to pulling off an upset victory in a Democratic congressional primary, stands on issues",
    "link": "https://www.foxnews.com/politics/where-sanders-aoc-backed-progressive-congressional-candidate-analilia-mejia-stands-key-issues",
    "timestamp": "2026-02-09T17:14:25Z"
  },
  {
    "title": "In the Arctic, the major climate threat of black carbon is overshadowed by geopolitical tensions",
    "description": "Black carbon absorbs sunlight and speeds up melting.",
    "link": "https://www.bostonherald.com/2026/02/09/climate-arctic-black-carbon/",
    "timestamp": "2026-02-09T17:14:13Z"
  },
  {
    "title": "What did Hunter Hess say at Olympics about representing the U.S.?",
    "description": "The freestyle skier spoke out about representing the United States at the Winter Olympics, but the \"mixed emotions\" that come with it.",
    "link": "https://ftw.usatoday.com/story/sports/olympics/2026/02/09/hunter-hess-olympics-team-usa-flag-olympics-trump/88590165007/",
    "timestamp": "2026-02-09T17:06:03Z"
  },
  {
    "title": "‘The View’ Co-Host Visibly Chokes Up While She Gushes Over Bad Bunny",
    "description": "\"The View\" co-host Ana Navarro choked up on Monday while she gushed over rapper Bad Bunny's performance during the Super Bowl Halftime Show.",
    "link": "https://dailycaller.com/2026/02/09/the-view-ana-navarro-bad-bunny-super-bowl/",
    "timestamp": "2026-02-09T17:04:48Z"
  },
  {
    "title": "Dalai Lama Breaks Silence After He Appears More Than 150 Times In The Epstein Files",
    "description": "90-year-old Tibetan spiritual leader, the Dalai Lama, issued a statement after his name appeared more than 150 times in the Epstein files released by the U.S. Department of Justice.",
    "link": "https://www.boredpanda.com/dalai-lama-breaks-silence-after-he-appears-more-than-150-times-in-the-epstein-files/",
    "timestamp": "2026-02-09T17:01:46Z"
  },
  {
    "title": "Mars can wait: Elon Musk shifts focus to the Moon first. Here’s what changed",
    "description": "Elon Musk now aims for the Moon first.  He believes a lunar base offers quicker protection for life.  Mars colonization remains a long-term goal.  SpaceX will align with NASA's Artemis program.  New business ventures like space-based data centers could fund t…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/mars-can-wait-elon-musk-shifts-focus-to-the-moon-first-heres-what-changed/articleshow/128123467.cms",
    "timestamp": "2026-02-09T17:01:20Z"
  },
  {
    "title": "Hong Kong jails democracy advocate Jimmy Lai",
    "description": "The former media tycoon was sentenced to 20 years in prison",
    "link": "https://theweek.com/crime/hong-kong-sentences-jimmy-lai-20-years",
    "timestamp": "2026-02-09T17:01:10Z"
  },
  {
    "title": "Bad Bunny erases Instagram posts – and sparks fan speculation after Super Bowl backlash",
    "description": "Donald Trump and Jake Paul were two of the critics who joined in on the backlash following Bad Bunny’s Super Bowl performance",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/bad-bunny-deletes-instagram-super-bowl-b2916801.html",
    "timestamp": "2026-02-09T17:00:09Z"
  },
  {
    "title": "The Silver Psychological Attack: How Friday’s Crash Was an Engineered Demolition",
    "description": "Introduction: A Stampede of Fear and an Opportunity to Stack On a recent Friday, the price of silver, the indispensable industrial metal and monetary asset, was violently taken to the slaughter. Headlines blared about a crash, and mainstream financial media q…",
    "link": "https://www.activistpost.com/the-silver-psychological-attack-how-fridays-crash-was-an-engineered-demolition/",
    "timestamp": "2026-02-09T17:00:00Z"
  },
  {
    "title": "Bill Maher and Adam Carolla Bash ‘Exclusionary’ Liberals for Sticking to ‘Groupthink’: ‘They’re Not That Bright!’",
    "description": "Bill Maher and Adam Carolla bashed liberals for being unintelligent bullies who want nothing to do with Americans who do not share their \"woke\" opinions\nThe post Bill Maher and Adam Carolla Bash ‘Exclusionary’ Liberals for Sticking to ‘Groupthink’: ‘They’re N…",
    "link": "https://www.mediaite.com/media/bill-maher-and-adam-carolla-bash-exclusionary-liberals-for-sticking-to-groupthink-theyre-not-that-bright/",
    "timestamp": "2026-02-09T16:59:41Z"
  },
  {
    "title": "Wegovy maker sues Hims & Hers over copycat weight loss drug",
    "description": "The lawsuit is the latest escalation in a price war between companies manufacturing weight loss drugs",
    "link": "https://www.the-independent.com/life-style/health-and-families/novo-nordisk-hims-and-hers-lawsuit-stock-wegovy-weight-loss-drug-b2916877.html",
    "timestamp": "2026-02-09T16:59:21Z"
  },
  {
    "title": "Ghislaine Maxwell declined to answer House committee questions",
    "description": "Lawmakers tried to interview Ghislaine Maxwell, but the former girlfriend and confidante of Jeffrey Epstein invoked her 5th Amendment rights.",
    "link": "https://www.wgal.com/article/ghislaine-maxwell-declines-to-answer-questions/70288232",
    "timestamp": "2026-02-09T16:59:08Z"
  },
  {
    "title": "WATCH LIVE: House gavels in as deadline for Homeland Security funding nears",
    "description": "Whether to ban the masks — or allow the masking to continue — has emerged as a central question in the debate in Congress over funding Homeland Security ahead of Friday's midnight deadline, when it faces a partial agency shutdown.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-house-gavels-in-as-deadline-for-homeland-security-funding-nears",
    "timestamp": "2026-02-09T16:58:28Z"
  },
  {
    "title": "US issues fresh guidance to vessels transiting Strait of Hormuz as Iran tensions simmer",
    "description": "Feb 9 (Reuters) - The United States ‌issued fresh guidance on Monday to commercial vessels transiting the Strait ‌of Hormuz, a key shipping lane for Middle East oil supplies, ‌as tensions simmered between Washington and Tehran over Iran's nuclear program. Rea…",
    "link": "https://www.thestar.com.my/news/world/2026/02/10/us-issues-fresh-guidance-to-vessels-transiting-strait-of-hormuz-as-iran-tensions-simmer",
    "timestamp": "2026-02-09T16:58:00Z"
  },
  {
    "title": "Japan’s ruling party secures historic election victory – but challenges lie ahead",
    "description": "Japan’s ruling LDP has secured an outright majority in the lower house of parliament, enabling the party to implement its agenda.",
    "link": "https://theconversation.com/japans-ruling-party-secures-historic-election-victory-but-challenges-lie-ahead-275279",
    "timestamp": "2026-02-09T16:57:50Z"
  },
  {
    "title": "Iran suggests it could dilute highly enriched uranium for sanctions relief",
    "description": "Iran's atomic energy chief makes comment as more mediated negotiations with the US expected.",
    "link": "https://www.aljazeera.com/news/2026/2/9/iran-suggests-it-could-dilute-highly-enriched-uranium-for-sanctions-relief",
    "timestamp": "2026-02-09T16:57:03Z"
  },
  {
    "title": "Straight Nonsense: Donald Trump does something racist—again",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_df947020-efb8-473a-8e39-bb37357c631b",
    "timestamp": "2026-02-09T16:57:00Z"
  },
  {
    "title": "Israeli plans deepen de facto annexation of occupied West Bank",
    "description": "Israel approves plans to expand its power across the West Bank, making it easier to seize Palestinian land illegally.",
    "link": "https://www.aljazeera.com/features/2026/2/9/israeli-plans-deepen-de-facto-annexation-of-occupied-west-bank",
    "timestamp": "2026-02-09T16:55:35Z"
  },
  {
    "title": "DOJ Under Congressional Scrutiny After Improper Redactions in Epstein Files",
    "description": "“Concealing the reputations of these powerful men is a blatant violation” of federal law, Rep. Ro Khanna said.",
    "link": "https://truthout.org/articles/doj-under-congressional-scrutiny-after-improper-redactions-in-epstein-files/",
    "timestamp": "2026-02-09T16:55:20Z"
  },
  {
    "title": "Massie Threatens to Go 'Nuclear' and Reveal Epstein Client Names If Bondi Won't Unredact Them",
    "description": "With 3 million Jeffrey Epstein files still being withheld from the public and the names of many possible clients and co-conspirators still blacked out, Rep. Thomas Massie is threatening to invoke what he has called a \"nuclear option\" to force transparency fro…",
    "link": "https://www.commondreams.org/news/massie-nuclear-epstein-files",
    "timestamp": "2026-02-09T16:54:24Z"
  },
  {
    "title": "Honduras Readies Spending Cuts as IMF Mission Prepares to Visit",
    "description": "Honduras plans to slash this year’s budget and halt central bank transfers to the government, as International Monetary Fund officials prepare to visit this month.",
    "link": "https://financialpost.com/pmn/business-pmn/honduras-readies-spending-cuts-as-imf-mission-prepares-to-visit",
    "timestamp": "2026-02-09T16:52:53Z"
  },
  {
    "title": "U.S. government isn't poised to sweep in with bitcoin buys, despite Jim Cramer rumor",
    "description": "President Donald Trump did order a bitcoin reserve, but it doesn't yet exist, even as the CNBC host says the feds will start filling it when bitcoin hits $60,000.",
    "link": "https://www.coindesk.com/news-analysis/2026/02/09/u-s-government-isn-t-poised-to-sweep-in-with-bitcoin-buys-despite-jim-cramer-rumor",
    "timestamp": "2026-02-09T16:50:04Z"
  },
  {
    "title": "CNN Data Guru Warns Trump’s ‘Collapsing’ Approval with Working Class Voters is Dragging Down GOP",
    "description": "Enten exclaimed the shift as “a 23 point switcheroo\" as he warned of potential consequences for the GOP in the upcoming midterms.\nThe post CNN Data Guru Warns Trump’s ‘Collapsing’ Approval with Working Class Voters is Dragging Down GOP first appeared on Media…",
    "link": "https://www.mediaite.com/media/tv/cnn-data-guru-warns-trumps-collapsing-approval-with-working-class-voters-is-dragging-down-gop/",
    "timestamp": "2026-02-09T16:49:54Z"
  },
  {
    "title": "US seizes tanker in Indian Ocean that fled Caribbean blockade",
    "description": "The Pentagon says the vessel was operating in breach of Donald Trump's orders on sanctioned ships in the region.",
    "link": "https://www.abc.net.au/news/2026-02-10/us-seizes-tanker-in-indian-ocean-that-fled-caribbean-blockade/106324658",
    "timestamp": "2026-02-09T16:49:01Z"
  },
  {
    "title": "Video Appears To Show Bad Bunny's Halftime Show Playing At Trump's Super Bowl Party",
    "description": "HuffPost reached out to the White House for confirmation, and they didn't exactly deny it.",
    "link": "https://www.huffpost.com/entry/video-trump-super-bowl-party_n_6989ebf4e4b0959e2d93b031",
    "timestamp": "2026-02-09T16:48:52Z"
  },
  {
    "title": "Japan’s Takaichi cements power with snap election win",
    "description": "President Donald Trump congratulated the conservative prime minister",
    "link": "https://theweek.com/politics/japan-election-results-takaichi-china-defense",
    "timestamp": "2026-02-09T16:48:26Z"
  },
  {
    "title": "Measles outbreak surges in US as Dr. Oz begs people to get vaccinated: ‘We have a solution’",
    "description": "Oz, a heart surgeon, defended some recently revised federal vaccine recommendations as well as past comments from President Donald Trump and the nation’s health chief, Robert F. Kennedy Jr., about the efficacy of vaccines.",
    "link": "https://nypost.com/2026/02/09/us-news/measles-outbreak-surges-in-us-as-dr-oz-begs-people-to-get-vaccinated/",
    "timestamp": "2026-02-09T16:47:53Z"
  },
  {
    "title": "Trump slams Olympian for expressing 'mixed emotions' about what's 'going on in the U.S.'",
    "description": "President Donald Trump said Sunday it's hard to cheer for American Olympians who are speaking out against his administration's policies.",
    "link": "https://www.pbs.org/newshour/politics/trump-slams-olympian-for-expressing-mixed-emotions-about-whats-going-on-in-the-u-s",
    "timestamp": "2026-02-09T16:45:48Z"
  },
  {
    "title": "‘I Love My Country’: Team USA Skier Speaks Out Following Trump Attack",
    "description": "The president called Hunter Hess \"a real loser\" after the athlete shared his conflicted feelings about competing for the U.S. at the Winter Olympics.",
    "link": "https://www.huffpost.com/entry/hunter-hess-responds-trump-attack-winter-olympics-2026_n_69894c57e4b0959e2d926db6",
    "timestamp": "2026-02-09T16:43:17Z"
  },
  {
    "title": "Whoopi Goldberg Calls Trump Out On ‘The View’ For Skipping Kid Rock’s Halftime Show So He Could Complain About Bad Bunny’s Instead: “What Was Happening With Kid Rock, Wasn’t That Your Thing?”",
    "description": "\"It's clear that you watched it,\" she said.",
    "link": "https://decider.com/2026/02/09/whoopi-goldberg-trump-the-view-skipping-kid-rocks-halftime-bad-bunnys/",
    "timestamp": "2026-02-09T16:42:46Z"
  },
  {
    "title": "US issues fresh guidance to vessels transiting Strait of Hormuz as Iran tensions simmer",
    "description": "Feb 9 (Reuters) - The United States issued fresh guidance on Monday to commercial vessels transiting the Strait of Hormuz, a key shipping lane for Middle East oil supplie… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/09/us-issues-fresh-guidance-to-vessels-transiting-strait-of-hormuz-as-iran-tensions-simmer",
    "timestamp": "2026-02-09T16:40:21Z"
  },
  {
    "title": "Timeline: Key issues facing Keir Starmer so far",
    "description": "A timeline examining key issues during Keir Starmer's year-and-a-half as Prime Minister.",
    "link": "https://www.rte.ie/news/uk/2026/0209/1557541-starmer-timeline/",
    "timestamp": "2026-02-09T16:39:59Z"
  },
  {
    "title": "Minerals, militants, US-made guns: Why Donald Trump’s bet on Asim Munir is set to fail",
    "description": "A recent mosque bombing in Islamabad highlights Pakistan's security challenges. The nation seeks US investment in its vast mineral wealth, including copper and lithium. However, a growing insurgency in Balochistan and border regions, armed with US-made weapon…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/minerals-militants-us-made-guns-why-donald-trumps-bet-on-asim-munir-is-set-to-fail/articleshow/128122336.cms",
    "timestamp": "2026-02-09T16:39:12Z"
  },
  {
    "title": "Seahawks trounce Patriots in Super Bowl LX",
    "description": "The Seattle Seahawks won their second Super Bowl against the New England Patriots",
    "link": "https://theweek.com/sports/seahawks-beat-patriots-super-bowl-lx-bad-bunny",
    "timestamp": "2026-02-09T16:38:36Z"
  },
  {
    "title": "Olympian Amber Glenn Says She Got “Scary” Threats for Supporting LGBTQ+ Rights",
    "description": "“I did anticipate this but I am disappointed by it,” Glenn wrote on Instagram.",
    "link": "https://www.them.us/story/amber-glenn-scary-threats-lgbtq-rights",
    "timestamp": "2026-02-09T16:38:18Z"
  },
  {
    "title": "China calls on banks to limit exposure to US debt – Bloomberg",
    "description": "China has urged banks to limit holdings of US Treasuries amid market volatility and rising risk concerns, according to Bloomberg Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632208-china-us-treasury-holdings/",
    "timestamp": "2026-02-09T16:38:13Z"
  },
  {
    "title": "Hawaii Lawmakers Approve Bill To Let Patients Use Medical Marijuana At Health Facilities - Marijuana Moment",
    "description": "Hawaii lawmakers have advanced a bill to allow qualifying patients to access medical marijuana at health facilities. In one of the latest examples of states pursuing what’s known as “Ryan’s law”—a reference to a young medical cannabis patient in California wh…",
    "link": "https://www.marijuanamoment.net/hawaii-lawmakers-approve-bill-to-let-patients-use-medical-marijuana-at-health-facilities/",
    "timestamp": "2026-02-09T16:37:01Z"
  },
  {
    "title": "Turning Point USA’s All-American Halftime Show Wasn’t Broadcast Live",
    "description": "The halftime show featuring performances from Kid Rock, Gabby Barrett and more was reportedly not even aired live up against Bad Bunny at Super Bowl LX",
    "link": "https://www.usmagazine.com/entertainment/news/turning-point-usas-all-american-halftime-show-wasnt-broadcast-live/",
    "timestamp": "2026-02-09T16:34:48Z"
  },
  {
    "title": "Trump Insists He's 'The Least Racist President You've Had in a Long Time' — As The Don Continues to Face Intense Backlash Over Video Depicting Barack and Michelle Obama as Apes",
    "description": "Donald Trump insisted he's 'the least racist president you've had in a long time' amid backlash for a repost on Truth Social.",
    "link": "https://radaronline.com/p/donald-trump-racist-president-least-claim-obama-apes-video/",
    "timestamp": "2026-02-09T16:34:05Z"
  },
  {
    "title": "Ghislaine Maxwell Pleads Fifth In Deposition, Holds Out For Trump Pardon",
    "description": "Jeffrey Epstein's accomplice told members of Congress that she would only speak if President Donald Trump lets her out of prison.",
    "link": "https://www.huffpost.com/entry/ghislaine-maxwell-epstein-deposition_n_698a08f0e4b02d49a779b37f",
    "timestamp": "2026-02-09T16:33:23Z"
  },
  {
    "title": "He Fled Torture in Uganda. ICE Is Trying to Send Him Back.",
    "description": "Last December, Steven Tendo stood on the steps of the First Unitarian Universalist Society of Burlington, Vermont, speaking to a crowd holding a candlelight vigil for immigrant justice. “I believe that when we gather like this,” said Tendo, an ordained minist…",
    "link": "https://www.motherjones.com/politics/2026/02/torture-ice-uganda-steven-tendo-vermont-deportation-asylum-trump/",
    "timestamp": "2026-02-09T16:33:21Z"
  },
  {
    "title": "James Comer Trashes ‘Very Bad Person’ Ghislaine Maxwell for Taking the Fifth",
    "description": "James Comer was pressed by reporters Monday shortly after Epstein conspirator Ghislaine Maxwell pleaded the fifth at her closed-door congressional hearing.\nThe post James Comer Trashes ‘Very Bad Person’ Ghislaine Maxwell for Taking the Fifth first appeared on…",
    "link": "https://www.mediaite.com/media/news/james-comer-trashes-very-bad-person-ghislaine-maxwell-for-taking-the-fifth/",
    "timestamp": "2026-02-09T16:32:53Z"
  },
  {
    "title": "Kremlin lashes out at Trump over ‘anti-Russian policy’ as US boards vessel known to carry sanctioned Russian oil",
    "description": "Russia’s top diplomat blasted the Trump administration, accusing Washington of talking cooperation while waging an economic war against Moscow.",
    "link": "https://nypost.com/2026/02/09/world-news/kremlin-lashes-out-at-trump-over-anti-russian-policy-as-us-boards-vessel-known-to-carry-sanctioned-russian-oil/",
    "timestamp": "2026-02-09T16:32:50Z"
  },
  {
    "title": "Paul Thomas Anderson & Composer Jonny Greenwood Call For Removal Of ‘Phantom Thread’ Music From ‘Melania’ Documentary",
    "description": "After taking notice of the use of a piece of music from their 2017 film Phantom Thread in Amazon MGM Studios’ Melania Trump documentary, Melania, filmmaker Paul Thomas Anderson and composer Jonny Greenwood are requesting its removal. “It has come to our atten…",
    "link": "http://deadline.com/2026/02/jonny-greenwood-melania-doc-remove-phantom-thread-music-1236713106/",
    "timestamp": "2026-02-09T16:32:29Z"
  },
  {
    "title": "Donald Trump Blasts ‘Terrible’ Bad Bunny Super Bowl Halftime Show: ‘A …",
    "description": "Reading Time: 3 minutesPredictably, Donald Trump is not a Bad Bunny fan.\nDonald Trump Blasts ‘Terrible’ Bad Bunny Super Bowl Halftime Show: ‘A … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/02/donald-trump-blasts-terrible-bad-bunny-super-bowl-halftime-show-a-slap-in-the-face-to-our-country/",
    "timestamp": "2026-02-09T16:31:02Z"
  },
  {
    "title": "【2月10日】看軍聞學英語",
    "description": "■林國賓 原文： Iran has withdrawn from active participation in the BRICS+ naval exercises in South Africa following threats by Donald Trump to impose tariffs on participating countries. According to News24, the decision was prompted by an ultimatum from the U.S. ad…",
    "link": "https://tw.news.yahoo.com/2%E6%9C%8810%E6%97%A5-%E7%9C%8B%E8%BB%8D%E8%81%9E%E5%AD%B8%E8%8B%B1%E8%AA%9E-163000894.html",
    "timestamp": "2026-02-09T16:30:00Z"
  },
  {
    "title": "Influencer records herself ‘not watching’ Bad Bunny live from Super Bowl 2026 — ‘loses 1K followers in 2 minutes’",
    "description": "The influencer shared a video of herself dancing in the stands at Levi's Stadium while wearing wired headphones and watching Turning Point USA's halftime program on her phone.",
    "link": "https://nypost.com/2026/02/09/sports/influencers-bad-bunny-decision-at-super-bowl-2026-backfires-spectacularly/",
    "timestamp": "2026-02-09T16:29:30Z"
  },
  {
    "title": "Jonny Greenwood, Paul Thomas Anderson Want the ‘Phantom Thread’ Score Axed From ‘Melania’",
    "description": "The Radiohead musician said he wasn't notified about his music being licensed for Brett Ratner's controversial doc, allegedly in \"breach of his composer agreement\"",
    "link": "http://www.rollingstone.com/music/music-news/jonny-greenwood-melania-doc-phantom-thread-score-removed-1235513362/",
    "timestamp": "2026-02-09T16:28:07Z"
  },
  {
    "title": "Strong support in Pakistan for Gaza peacekeeping force but questions linger",
    "description": "Poll finds Pakistanis ready to support Gaza peacekeeping mission under Muslim alliance and UN approval framework.",
    "link": "https://www.aljazeera.com/news/2026/2/9/survey-finds-strong-pakistani-support-for-gaza-force-but-questions-linger",
    "timestamp": "2026-02-09T16:27:51Z"
  },
  {
    "title": "Super Bowl Sunday On The Sunday Shows Was Full Of Liars And Quacks, As Usual",
    "description": "We watch so you never have to!",
    "link": "https://www.wonkette.com/p/super-bowl-sunday-on-the-sunday-shows",
    "timestamp": "2026-02-09T16:26:09Z"
  },
  {
    "title": "The D Brief: More maritime strikes, seizure; Warships off Haiti; US official hints at new nukes; Introducing ‘Fictional Intelligence’; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2026/02/the-d-brief-february-09-2026/411284/",
    "timestamp": "2026-02-09T16:24:42Z"
  },
  {
    "title": "FBI found no evidence of Epstein sex-trafficking network – AP",
    "description": "The FBI has so far found no evidence indicating that disgraced financier Jeffrey Epstein was running a sex-trafficking ring, AP claims Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632218-ap-fbi-found-no-evidence-epstein-sex-trafficking-ring/",
    "timestamp": "2026-02-09T16:24:34Z"
  },
  {
    "title": "Ghislaine Maxwell declined to answer questions from a House committee, citing 5th Amendment rights",
    "description": "Maxwell was to be questioned Monday during a video call.",
    "link": "https://www.bostonherald.com/2026/02/09/ghislaine-maxwell-congress/",
    "timestamp": "2026-02-09T16:24:31Z"
  },
  {
    "title": "Winter Olympics: U.S. athletes respond to Trump chastising freestyle skier Hunter Hess",
    "description": "Hess' comments have sparked a minor firestorm that's drawn criticism from President Trump, others.",
    "link": "https://sports.yahoo.com/olympics/article/winter-olympics-us-athletes-respond-to-trump-chastising-freestyle-skier-hunter-hess-162415163.html",
    "timestamp": "2026-02-09T16:24:15Z"
  },
  {
    "title": "Security reforms ongoing in Nigeria, but much remains – First Lady",
    "description": "Nigeria’s First Lady, Oluremi Tinubu, outlines sweeping security reforms, including increased troop recruitment and US cooperation to tackle insurgency.\n\nRead More: https://punchng.com/security-reforms-ongoing-in-nigeria-but-much-remains-first-lady/",
    "link": "https://punchng.com/security-reforms-ongoing-in-nigeria-but-much-remains-first-lady/",
    "timestamp": "2026-02-09T16:22:41Z"
  },
  {
    "title": "'Please get me out of here': Heartbreaking kids' messages come out of ICE center",
    "description": "Fourteen-year-old Ariana Velasquez had been held at the immigrant detention center in Dilley, Texas, with her mother for some 45 days when I managed to get inside to meet her. The staff brought everyone in the visiting room a boxed lunch from the cafeteria: a…",
    "link": "https://www.rawstory.com/please-get-me-out-of-here-heartbreaking-kids-messages-come-out-of-ice-center/",
    "timestamp": "2026-02-09T16:22:02Z"
  },
  {
    "title": "Pushing for Regime Change, Trump Accused of 'Asphyxiating' Cuba With Fuel Embargo",
    "description": "The Trump administration's decision to tighten the decadeslong US stranglehold on the Cuban economy by depriving the island nation of its largest source of oil has plunged the country into a rapidly worsening energy crisis, forcing its government to take far-…",
    "link": "https://www.commondreams.org/news/trump-cuba-regime-change",
    "timestamp": "2026-02-09T16:20:58Z"
  },
  {
    "title": "Purported Nancy Guthrie ransom note deadline approaches as search enters a second week",
    "description": "There’s still no word on whether Nancy Guthrie is alive.",
    "link": "https://www.bostonherald.com/2026/02/09/nancy-guthrie-ransom-note/",
    "timestamp": "2026-02-09T16:17:11Z"
  },
  {
    "title": "Fake News: CNN Anchor Spreads 'Misinformation' About Child Actor in Bad Bunny Super Bowl Halftime Show",
    "description": "A CNN anchor who has pushed fake news in the past is accused of doing it again after the Super Bowl on Sunday evening.\nThe post Fake News: CNN Anchor Spreads ‘Misinformation’ About Child Actor in Bad Bunny Super Bowl Halftime Show appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/02/09/fake-news-cnn-anchor-spreads-misinformation-about-child-actor-in-bad-bunny-super-bowl-halftime-show/",
    "timestamp": "2026-02-09T16:17:10Z"
  },
  {
    "title": "Labor Department orders lawyers to cut ties with ABA, slams group as ‘radical’ activist force",
    "description": "Trump administration expands effort to weaken American Bar Association as Labor Department joins other agencies in severing official ties with legal organization.",
    "link": "https://www.foxnews.com/politics/labor-department-orders-lawyers-cut-ties-aba-slams-group-radical-activist-force",
    "timestamp": "2026-02-09T16:15:33Z"
  }
]