[
  {
    "title": "Senate Republicans move to slash CFPB funding by half, risking hundreds of job cuts",
    "description": "The bureau was created to police potential bad actors in the financial services industry.",
    "link": "https://www.bostonherald.com/2025/06/27/congress-cfpb-cuts/",
    "timestamp": "2025-06-27T18:10:34Z"
  },
  {
    "title": "Wingnuts Exactly As Calm As You'd Expect Over Mamdani's NYC Primary Win",
    "description": "And some Democrats aren't covering themselves in glory, either cough Kirsten Gillibrand cough.",
    "link": "https://www.wonkette.com/p/wingnuts-exactly-as-calm-as-youd",
    "timestamp": "2025-06-27T18:09:34Z"
  },
  {
    "title": "Under Pressure From Trump, UVA President Reportedly Resigns",
    "description": "Under Pressure From Trump, UVA President Reportedly Resigns\n\n \n\n\n \njessica.blake@…\n\nFri, 06/27/2025 - 02:08 PM\n\nThe move is a “major blow” to the independence of American institutions, one expert said.\n \n Byline(s)\r\n\n \n Jessica Blake\r\n\n Katherine Knott",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/06/27/university-virginia-president-resigns-after-trumps",
    "timestamp": "2025-06-27T18:08:45Z"
  },
  {
    "title": "WATCH: State officials give tour of new ‘Alligator Alcatraz’ detention center site",
    "description": "Facility for illegal aliens launching in wildlife-infested Everglades after suggestion from Florida AG James Uthmeier, and Gov. DeSantis calls it 'as secure as it gets'",
    "link": "https://www.wnd.com/2025/06/watch-state-officials-give-tour-new-alligator-alcatraz/",
    "timestamp": "2025-06-27T18:08:44Z"
  },
  {
    "title": "Trump says Iran must open itself to inspection to verify it doesn't restart its nuclear program",
    "description": "U.S. President Donald Trump says he expects Iran to open itself to international inspection to verify it doesn’t restart its nuclear program. Asked during a White House news conference Friday if he would demand during expected talks with Iran that…",
    "link": "https://apnews.com/article/israel-iran-war-nuclear-06-27-2025-e30d8ae4e3c6d13e4cfb562c35dd744b",
    "timestamp": "2025-06-27T18:07:00Z"
  },
  {
    "title": "Trump Says Saved Iran Leader From 'Ignominious Death'",
    "description": "US President Donald Trump said Friday he had saved Iran's Ayatollah Ali Khameni from assassination and lashed out at the supreme leader for ingratitude, declaring he would order more bombing if the country tried to pursue nuclear weapons.",
    "link": "https://www.ibtimes.com/trump-says-saved-iran-leader-ignominious-death-3777095",
    "timestamp": "2025-06-27T18:06:25Z"
  },
  {
    "title": "Donald Trump Cuts Off Trade Talks with Canada, 'Effective Immediately'",
    "description": "Canada and the U.S. have said recently progress is being made to rekindle their relationship, which has been roiled by trade tensions.",
    "link": "https://www.newsweek.com/trump-canada-ends-trade-talks-tariff-2091826",
    "timestamp": "2025-06-27T18:06:14Z"
  },
  {
    "title": "JUST IN: Trump Rages at Canada, Announces ‘Terminating ALL Discussions on Trade’",
    "description": "President Donald Trump announced on Truth Social on Friday that he was “terminating” all trade talks with Canada and that he will unilaterally decide the tariff on America’s northern neighbor within seven days. “We have just been informed that Canada, a very …",
    "link": "https://www.mediaite.com/media/news/just-in-trump-rages-at-canada-announces-terminating-all-discussions-on-trade/",
    "timestamp": "2025-06-27T18:06:07Z"
  },
  {
    "title": "Trump would strike Iran 'without question' if it restarts nuclear weapons program",
    "description": "President Donald Trump said that additional strikes against Iran would continue if Tehran attempted to advance its nuclear program again.",
    "link": "https://www.foxnews.com/politics/trump-would-strike-iran-without-question-restarts-nuclear-weapons-program",
    "timestamp": "2025-06-27T18:05:31Z"
  },
  {
    "title": "Trump ends all U.S. trade talks with Canada over digital services tax",
    "description": "Trump's announcement on Truth Social accused Canada of \"copying the European Union\" with the \"egregious\" tax.",
    "link": "https://www.cnbc.com/2025/06/27/trump-canada-trade-talks-tariffs.html",
    "timestamp": "2025-06-27T18:04:58Z"
  },
  {
    "title": "Ron DeSantis Sued Over Alligator Alcatraz",
    "description": "Two environmental nonprofit groups are suing to block Homeland Security Secretary Kristi Noem’s expedited plans to open “Alligator Alcatraz,” an ICE detention center in the middle of the Florida Everglades. \r\nA nonprofit called Friends of the Everglades, Inc.…",
    "link": "https://newrepublic.com/post/197379/florida-ron-desantis-immigration-detention-alligator-alcatraz",
    "timestamp": "2025-06-27T18:04:26Z"
  },
  {
    "title": "Massie Rakes In Cash Despite Trump Wrath",
    "description": "Republican Rep. Thomas Massie announced on Thursday on X that his campaign raked in $177,394 over the past week following repeated attacks by President Trump.",
    "link": "https://dailycaller.com/2025/06/27/thomas-massie-campaign-donations-trump/",
    "timestamp": "2025-06-27T18:04:10Z"
  },
  {
    "title": "Supreme Court backs Trump on birthright citizenship injunctions. Here’s what that means:",
    "description": "The Supreme Court ended its term on Friday with a major decision in the closely watched birthright citizenship case, that is likely to have a profound impact on whether the lower courts can pause or halt President Donald Trump’s executive orders—which many le…",
    "link": "https://biztoc.com/x/72a1b08204ee6136",
    "timestamp": "2025-06-27T18:03:46Z"
  },
  {
    "title": "Supreme Court curbs judges' power to block Trump's orders in birthright citizenship case",
    "description": "Because of the ruling to limit injunctions, Trump's birthright citizenship order will be able to take effect, 30 days after the courts opinion was filed, the court said.",
    "link": "https://www.bbc.com/news/articles/cev0d10kdd9o",
    "timestamp": "2025-06-27T18:03:46Z"
  },
  {
    "title": "Trump says he would 'absolutely' bomb Iran again if keeps enriching uranium",
    "description": "US President Donald Trump said Friday he would “absolutely” be willing to bomb Iran again if the country appeared to be enriching uranium at a concerning level.\nHis remarks during a White House press conference come amid conflicting reports, including from US…",
    "link": "https://biztoc.com/x/d4a4dcfefce25e17",
    "timestamp": "2025-06-27T18:03:45Z"
  },
  {
    "title": "Trump is ending trade talks with Canada | CNN Business",
    "description": "President Donald Trump ceased trade talks with Canada and will soon announce a new tariff rate the country will have to pay, he said in a Truth Social post on Friday.",
    "link": "https://www.cnn.com/2025/06/27/business/trump-breaks-off-canada-trade-talks",
    "timestamp": "2025-06-27T18:03:32Z"
  },
  {
    "title": "Trump's World Liberty Financial signs partnership deal with London hedge fund",
    "description": "World Liberty Financial, a DeFi protocol partially owned by US President Donald Trump and his family, partnered with UK-based hedge fund Re7.",
    "link": "https://cointelegraph.com/news/trump-world-liberty-financial-partnership-re7-london-fund",
    "timestamp": "2025-06-27T18:03:04Z"
  },
  {
    "title": "No truce on horizon as Gaza's children starve",
    "description": "Deadly ambush whips up dissent against “pointless” war.",
    "link": "https://electronicintifada.net/blogs/maureen-clare-murphy/no-truce-horizon-gazas-children-starve",
    "timestamp": "2025-06-27T18:01:31Z"
  },
  {
    "title": "Deal with Beijing will speed China's export of minerals to the US, treasury secretary says",
    "description": "Washington and Beijing have signed a trade agreement that will make it easier for American firms to obtain magnets and rare earth minerals from China that are critical to manufacturing and microchip production.",
    "link": "https://www.news4jax.com/business/2025/06/27/trump-says-us-has-signed-a-deal-with-china-on-trade-without-giving-details/",
    "timestamp": "2025-06-27T18:01:24Z"
  },
  {
    "title": "Trump says he's ending 'all discussions on trade with Canada' effective immediately",
    "description": "U.S. President Donald Trump said he's pulling back from the bilateral trade discussions because Canada plans to move ahead with its digital services tax.",
    "link": "https://www.cbc.ca/news/politics/trump-terminating-trade-discussions-canada-1.7572964",
    "timestamp": "2025-06-27T18:01:02Z"
  },
  {
    "title": "It’s back to court on refugees, birthright citizenship, sanctuary cities and much more",
    "description": "After Supreme Court ruling for president, senator announces, 'If you disagree with a president or Congress, fill out a hurt feelings report—but you can’t put their actions on hold because you don't like them'",
    "link": "https://www.wnd.com/2025/06/its-back-court-refugees-birthright-citizenship-sanctuary-cities/",
    "timestamp": "2025-06-27T18:00:26Z"
  },
  {
    "title": "Trump terminates trade talks with Canada",
    "description": "President Donald Trump said Friday that he had terminated trade discussions with Canada, citing an incoming Canadian tax on digital service providers including ones based in the U.S..",
    "link": "https://www.nbcnews.com/business/economy/trump-terminates-ends-canada-trade-talks-tariffs-rcna215608",
    "timestamp": "2025-06-27T18:00:17Z"
  },
  {
    "title": "Bret Baier on Trump’s Love-Hate Relationship with Fox News",
    "description": "On The New Yorker Radio Hour, the Fox News anchor discusses the channel’s nightly news show, his role in the current media ecosystem, and what liberal outlets have got wrong about covering Trump.",
    "link": "https://www.newyorker.com/podcast/the-new-yorker-radio-hour/bret-baier-on-trumps-love-hate-relationship-with-fox-news",
    "timestamp": "2025-06-27T18:00:00Z"
  },
  {
    "title": "California governor sues Fox News over alleged defamation in story about call with Trump",
    "description": "Gov. Gavin Newsom is asking for $787 million in punitive damages.",
    "link": "https://www.bostonherald.com/2025/06/27/newsom-fox-news-lawsuit/",
    "timestamp": "2025-06-27T17:59:21Z"
  },
  {
    "title": "'You can’t walk in there': Trump calls full access to India 'unthinkable' amid trade talks",
    "description": "President Trump indicated ongoing trade discussions with India, expressing uncertainty about removing all trade barriers. While hinting at a potential agreement to open up India's market, he emphasized the desire for fair trade access. Both U.S. and Indian of…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/you-cant-walk-in-there-trump-calls-full-access-to-india-unthinkable-amid-trade-talks/articleshow/122118152.cms",
    "timestamp": "2025-06-27T17:58:45Z"
  },
  {
    "title": "Footage Shows Masked ICE Agents Detain 3-Year-Old Boy, Mom at Texas Court",
    "description": "Exclusive footage obtained by Newsweek shows the moment the wife and son are led away by President Trump's immigration enforcers.",
    "link": "https://www.newsweek.com/ice-detains-three-year-old-boy-mom-texas-court-2091789",
    "timestamp": "2025-06-27T17:57:28Z"
  },
  {
    "title": "Trump claims he stopped India-Pakistan war by threatening to 'cancel all deals'",
    "description": "Donald Trump claimed he averted a potential nuclear war between India and Pakistan by threatening to halt trade with both nations. He stated that he instructed officials to cancel deals, leading to a cessation of hostilities. However, India maintains that the…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-claims-he-stopped-india-pakistan-war-by-threatening-to-cancel-all-deals/articleshow/122118265.cms",
    "timestamp": "2025-06-27T17:56:40Z"
  },
  {
    "title": "Russia kills 5 in Ukraine’s Samar, as Putin seems ready for new peace talks",
    "description": "Russian leader indicates longterm plan to cut army spending, as his forces vie for foothold in Ukraine’s Dnipropetrovsk.",
    "link": "https://www.aljazeera.com/news/2025/6/27/russia-kills-5-in-ukraines-samar-as-putin-says-ready-for-peace-talks",
    "timestamp": "2025-06-27T17:55:37Z"
  },
  {
    "title": "Democratic Senator Gillibrand Goes on Islamophobic Rant Against Mamdani",
    "description": "The Democrat’s rant has sparked calls for her to resign over her bigoted language.",
    "link": "https://truthout.org/articles/democratic-senator-gillibrand-goes-on-islamophobic-rant-against-mamdani/",
    "timestamp": "2025-06-27T17:53:37Z"
  },
  {
    "title": "BREAKING: New York Times Grows A Pair, Stands Up To Bully",
    "description": "Well, hush my mouth! I nevah thought I'd see the day! Trump threatens the Times, and they don't back down! Via Mediaite:\nThe New York Times struck a defiant tone in a Thursday letter in response to a personal lawyer for President Donald Trump demanding the pa…",
    "link": "https://crooksandliars.com/2025/06/breaking-new-york-times-grows-pair-stands",
    "timestamp": "2025-06-27T17:53:26Z"
  },
  {
    "title": "Trump says plans a letter soon telling countries their tariff rate",
    "description": "President Donald Trump announced on Friday his intention to dispatch letters within the next week and a half, informing countries of the specific U.S. tariff rates they will be subjected to. During a White House news conference, Trump also mentioned ongoing e…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-plans-a-letter-soon-telling-countries-their-tariff-rate/articleshow/122118173.cms",
    "timestamp": "2025-06-27T17:52:55Z"
  },
  {
    "title": "Trump calls New York Democratic mayoral candidate Zohran Mamdani 'a communist'",
    "description": "Some New York investors and business leaders are dismayed that democratic socialist Zohram Mamdani will become the next mayor of New York City.",
    "link": "https://www.cnbc.com/2025/06/27/trump-new-york-zohran-mamdani-communist.html",
    "timestamp": "2025-06-27T17:52:04Z"
  },
  {
    "title": "MSNBC's O'Donnell: We're Just Going To Have To Assume Pete Hegseth Was Stone Cold Sober When He Told The Stupidest Public Lie In Military History",
    "description": "MSNBC's Lawrence O'Donnell wonders whether Defense Secretary Pete Heseth is drinking again: \r\n\r\nLAWRENCE O’DONNELL, MSNBC: Pete Hegseth was reported to have had such a severe drinking problem while working as a weekend morning host at Fox that he promised Rep…",
    "link": "https://www.realclearpolitics.com/video/2025/06/27/msnbcs_odonnell_were_just_going_to_have_to_assume_pete_hegseth_was_stone_cold_sober_when_he_told_the_stupidest_public_lie_in_military_history.html",
    "timestamp": "2025-06-27T17:51:20Z"
  },
  {
    "title": "CNN’s Elie Honig Says the ‘Presidency Is Far More Powerful’ Thanks to Supreme Court Ruling on Trump Executive Order",
    "description": "Elie Honig declared that the Supreme Court made the presidency \"far more powerful\" with a 6-3 ruling against injunctions blocking an executive order from Trump.\nThe post CNN’s Elie Honig Says the ‘Presidency Is Far More Powerful’ Thanks to Supreme Court Rulin…",
    "link": "https://www.mediaite.com/media/tv/cnns-elie-honig-says-the-presidency-is-far-more-powerful-thanks-to-supreme-court-ruling-on-trump-executive-order/",
    "timestamp": "2025-06-27T17:50:45Z"
  },
  {
    "title": "Newsom Sues Fox News for $787 Million, Saying It Lied About Trump Phone Call",
    "description": "Gov. Gavin Newsom’s defamation lawsuit claims Fox News lied about when he spoke with President Donald Trump about the immigration raids and protests in Los Angeles.",
    "link": "https://www.kqed.org/news/12046271/newsom-sues-fox-news-for-787-million-saying-it-lied-about-trump-phone-call",
    "timestamp": "2025-06-27T17:46:23Z"
  },
  {
    "title": "How Grants Pass Ruling Affected Homeless Enforcement In California",
    "description": "Homeless residents of some of California’s biggest cities increasingly are facing criminal penalties.",
    "link": "https://www.kqed.org/news/12046259/how-grants-pass-ruling-affected-homeless-enforcement-in-california",
    "timestamp": "2025-06-27T17:45:13Z"
  },
  {
    "title": "Challenge to panel that recommends no-cost preventive health care is rejected by Supreme Court | CNN Politics",
    "description": "The Supreme Court on Friday upheld a task force that recommends preventive health care services that insurers must cover at no-cost, turning away the latest legal challenge to Obamacare to reach the high court.",
    "link": "https://www.cnn.com/2025/06/27/politics/preventative-services-obamacare-supreme-court-braidwood",
    "timestamp": "2025-06-27T17:44:03Z"
  },
  {
    "title": "Florida man indicted for '86' posts threatening to kill Alina Habba",
    "description": "Florida man indicted for allegedly threatening Alina Habba, Trump's former counselor, in online \"86\" posts interpreted by law enforcement as meaning \"get rid of.\"",
    "link": "https://www.foxnews.com/politics/florida-man-indicted-86-posts-threatening-kill-alina-habba",
    "timestamp": "2025-06-27T17:43:37Z"
  },
  {
    "title": "Trump: Iran sanctions to remain due to Khamenei",
    "description": "United States President Donald Trump said on Friday that he was looking into sanction relief for Iran, but after Iranian Supreme Leader Ayatollah Ali Khamenei's statement about victory, he will no lon...",
    "link": "https://biztoc.com/x/c72a6ae01c8c261f",
    "timestamp": "2025-06-27T17:41:40Z"
  },
  {
    "title": "Pentagon strips activist Harvey Milk's name from Navy ship in latest diversity purge",
    "description": "U.S. Defence Secretary Pete Hegseth announced Friday that the USNS Harvey Milk will be renamed after a Second World War sailor who received the Medal of Honor, stripping the ship of the name of a slain gay rights activist who served during the Korean War.",
    "link": "https://www.cbc.ca/news/world/harvey-milk-ship-renamed-1.7572838",
    "timestamp": "2025-06-27T17:40:19Z"
  },
  {
    "title": "Federal Budget Bill May Reduce Aid for Nearly 500,000 Texas College Students",
    "description": "A proposal in the House would cut the maximum Pell Grant award by $1,500 and remove eligibility for part-time students.",
    "link": "https://www.texastribune.org/2025/06/27/texas-pell-grant-cuts-financial-aid/",
    "timestamp": "2025-06-27T17:38:30Z"
  },
  {
    "title": "‘I Love You — Who Are You?’ Trump Fawns Over Lindell TV Question About 2020 Presidential Election",
    "description": "“Well, that's just a very nice question. And it's not a setup. I have no idea who you are, but I appreciate that question,” Trump replied\nThe post ‘I Love You — Who Are You?’ Trump Fawns Over Lindell TV Question About 2020 Presidential Election first appeared…",
    "link": "https://www.mediaite.com/politics/i-love-you-who-are-you-trump-fawns-over-lindell-tv-question-about-2020-presidential-election/",
    "timestamp": "2025-06-27T17:38:22Z"
  },
  {
    "title": "‘BTC All-Time Highs Are Coming’: Arthur Hayes Reveals 3 Key Catalysts For Next Parabolic Bitcoin Bull Run",
    "description": "BitMEX co-founder Arthur Hayes has highlighted multiple catalysts that could supercharge the next BTC bull run to fresh all-time highs.",
    "link": "https://zycrypto.com/btc-all-time-highs-are-coming-arthur-hayes-reveals-3-key-catalysts-for-next-parabolic-bitcoin-bull-run/",
    "timestamp": "2025-06-27T17:38:04Z"
  },
  {
    "title": "Wanted: Two-bit swindler for tinpot dictatorship",
    "description": "The classified ad's wording leaps to mind upon reading only the first portion of the first sentence of The NY Review article, \"Flicking the War Switch\": \"On July 21, 2021, after Donald Trump had finished his first term as president, he gave an interview at hi…",
    "link": "https://www.pmcarpenter.com/post/wanted-two-bit-swindler-for-tinpot-dictatorship",
    "timestamp": "2025-06-27T17:38:03Z"
  },
  {
    "title": "Don’t Let a Fake Victory Forestall Real Peace",
    "description": "Trump’s misplaced faith in the efficacy of the Iran attacks will bring more war.",
    "link": "http://foreignpolicy.com/2025/06/27/trump-iran-israel-democrats-intelligence-peace/",
    "timestamp": "2025-06-27T17:37:53Z"
  },
  {
    "title": "Trump Punts on Crypto Divestment, Says If US Didn't Have Bitcoin 'China Would'",
    "description": "President Trump deflected when asked whether he would consider divesting from personal crypto interests to help get legislation passed.",
    "link": "https://decrypt.co/327451/trump-punts-crypto-divestment-if-us-didnt-have-bitcoin-china-would",
    "timestamp": "2025-06-27T17:36:42Z"
  },
  {
    "title": "The Zohran Mamdani Revolution",
    "description": "They did it. They finally did it. Those maniacs. They blew it up. As New Yorkers walk dazed through the streets of the world’s greatest... Read More\nThe post The Zohran Mamdani Revolution appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/27/zohran-mamdani-revolution/",
    "timestamp": "2025-06-27T17:36:03Z"
  },
  {
    "title": "Trump Says Deadline For Tariff Negotiations Isn’t Firm After All",
    "description": "Trump has suggested he will impose his own tariff rates against countries that don’t make deals with his administration.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/27/trump-says-deadline-for-tariff-negotiations-isnt-firm-after-all/",
    "timestamp": "2025-06-27T17:35:55Z"
  },
  {
    "title": "Bitwise Files Updated Application For Spot Dogecoin ETF Amid Overwhelming SEC Approval Odds",
    "description": "Asset manager Bitwise has updated its filing for a U.S.-listed spot Dogecoin (DOGE) exchange-traded fund (ETF).",
    "link": "https://zycrypto.com/bitwise-files-updated-application-for-spot-dogecoin-etf-amid-overwhelming-sec-approval-odds/",
    "timestamp": "2025-06-27T17:34:13Z"
  },
  {
    "title": "Joe Rogan Gives MAGA a Liberal Makeover After Splitting With Trump on Iran",
    "description": "After Donald Trump demanded absolute loyalty on Truth Social, the Spotify king used his massive platform to challenge the MAGA echo chamber's biggest flaw: its intolerance for dissent.",
    "link": "https://gizmodo.com/joe-rogan-gives-maga-a-liberal-makeover-after-splitting-with-trump-on-iran-2000621394",
    "timestamp": "2025-06-27T17:33:59Z"
  },
  {
    "title": "Trump threatens to sue New York Times, CNN over reports undermining Iran strike claims",
    "description": "President Donald Trump is threatening to sue the New York Times and CNN over reports that contradicted his claim that recent US airstrikes on Iran “obliterated” the country’s nuclear capabilities. The president’s legal team says both outlets defamed him by re…",
    "link": "https://nypost.com/2025/06/27/media/trump-threatens-to-sue-new-york-times-cnn-over-iran-strike-reports/",
    "timestamp": "2025-06-27T17:33:38Z"
  },
  {
    "title": "I have saved him from a very ugly and ignominious death: Trump questions Iran Supreme Leader Ayatollah Khamenei declaring victory",
    "description": "Donald Trump claimed he saved Ayatollah Khamenei's life, preventing Israel and the US military from terminating him, despite Iran's alleged declaration of victory against Israel. Trump stated he halted a large Israeli air attack on Tehran and ceased working o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/i-have-saved-him-from-a-very-ugly-and-ignominious-death-trump-questions-iran-supreme-leader-ayatollah-khamenei-declaring-victory/articleshow/122117708.cms",
    "timestamp": "2025-06-27T17:33:29Z"
  },
  {
    "title": "The Beach Boys' Co-Founder Brian Wilson Cause of Death Revealed",
    "description": "The cause of death for The Beach Boys' co-founder Brian Wilson -- who died on June 11 at the age of 82 -- has been revealed.\nThe post The Beach Boys’ Co-Founder Brian Wilson Cause of Death Revealed appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/06/27/the-beach-boys-co-founder-brian-wilson-cause-of-death-revealed/",
    "timestamp": "2025-06-27T17:32:17Z"
  },
  {
    "title": "What is Birthright Citizenship? 10 key points to know about the US Supreme Court’s decision today",
    "description": "US Supreme Court birthright citizenship ruling has opened a new chapter in America’s immigration and legal policy. On June 27, 2025, the Court ruled 6–3 to limit federal courts from issuing nationwide blocks on presidential actions, giving President Donald Tr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-birthright-citizenship-10-key-points-to-know-about-the-us-supreme-courts-decision-today/articleshow/122117619.cms",
    "timestamp": "2025-06-27T17:31:12Z"
  },
  {
    "title": "Trump: I halted sanctions relief for Iran after Khamenei's lie of victory",
    "description": "In a post on Truth Social, President Trump slams Iran's Supreme Leader for claiming victory over Israel, stating he saved Khamenei’s life and halted a massive Israeli attack on Tehran. Trump also reveals he ceased working on Iran sanctions relief after Khamen…",
    "link": "https://www.israelnationalnews.com/news/410778",
    "timestamp": "2025-06-27T17:31:02Z"
  },
  {
    "title": "Iran Says It Delivered A “Slap To America’s Face” Before The Ceasefire",
    "description": "Iranian ruler Ayatollah Ali Khamenei said that Iran has delivered a \"slap to America's face\" before the ceasefire went into effect. The ruler of Iran claimed that by striking a United States military base in Qatar, a warning was issued against further attacks.",
    "link": "https://www.shtfplan.com/headline-news/iran-says-it-delivered-a-slap-to-americas-face-before-the-ceasefire",
    "timestamp": "2025-06-27T17:30:54Z"
  },
  {
    "title": "Trump Reacts to Supreme Court Ruling on Birthright Citizenship",
    "description": "A sharply divided #US #SupremeCourt limited the power of judges to block #government policies nationwide but left unresolved a fight over President Donald #Trump’s restrictions on automatic birthright citizenship. The 6-3 ruling Friday said Trump’s restrictio…",
    "link": "https://biztoc.com/x/69c78471561f1553",
    "timestamp": "2025-06-27T17:30:51Z"
  },
  {
    "title": "Harvard Begs Major Corporations for Cash Amid Trump's Funding Cuts: Report",
    "description": "Harvard University is asking major corporations for research funding after President Donald Trump revoked more than $2 billion in federal grants from the school over campus anti-Semitism and diversity, equity, and inclusion (DEI) initiatives.\nThe post Harvard…",
    "link": "https://freebeacon.com/latest-news/harvard-begs-major-corporations-for-cash-amid-trumps-funding-cuts-report/",
    "timestamp": "2025-06-27T17:30:46Z"
  },
  {
    "title": "Trump: Iran sanctions to remain after Khamenei's remarks",
    "description": "United States President Donald Trump said on Friday that he was looking into sanction relief for Iran, but that after Iranian Supreme Leader Ayatollah Ali Khamenei's statement about victory, he will n...",
    "link": "https://biztoc.com/x/10a19d92b9e7c008",
    "timestamp": "2025-06-27T17:30:46Z"
  },
  {
    "title": "Trump says July 4 is “not the end all”",
    "description": "President Donald Trump on Friday backed off the July 4 deadline he set for Congress to pass his megabill, acknowledging that the timing could slip as Republicans work through a series of political and logistical hurdles. \n“It’s not the end all,” Trump said of…",
    "link": "https://biztoc.com/x/159504e7e51fa2ec",
    "timestamp": "2025-06-27T17:30:37Z"
  },
  {
    "title": "Sadly, “Squid Game” may be right about democracy",
    "description": "\"Squid Game\" began as a critique of late-stage capitalism. It ends as a cautionary parable about tribalism.",
    "link": "https://www.salon.com/2025/06/27/squid-game-season-3-premiere/",
    "timestamp": "2025-06-27T17:30:36Z"
  },
  {
    "title": "Gov. Newsom accuses Fox News of defamation in $787 million lawsuit",
    "description": "California Gov. Gavin Newsom has accused Fox News of defamation in a $787 million lawsuit, he announced Thursday. The lawsuit centers on claims made by Fox News host Jesse Watters, who said Newsom lied about his phone calls with President Donald Trump during …",
    "link": "https://freerepublic.com/focus/f-news/4325670/posts",
    "timestamp": "2025-06-27T17:30:05Z"
  },
  {
    "title": "Origins of COVID-19 still unclear according to final report from WHO expert group",
    "description": "An expert group charged by the World Health Organization to investigate how the COVID-19 pandemic started released its final report Friday, reaching an unsatisfying conclusion: Scientists still aren't sure how the worst health emergency in a century began.",
    "link": "https://www.cbc.ca/news/health/covid-19-origins-report-1.7572830",
    "timestamp": "2025-06-27T17:27:56Z"
  },
  {
    "title": "What the Islamophobic Attacks on Mamdani Reveal",
    "description": "Rather than cement its new multiracial coalition, the MAGA movement seems almost desperate to break it apart.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/zohran-mamdani-maga-islamophobia/683349/",
    "timestamp": "2025-06-27T17:26:00Z"
  },
  {
    "title": "Trump on July 4 Tax-Cut Bill Deadline: 'It's Not the End-All'",
    "description": "President Donald Trump says his July 4 goal to pass his tax bill isn't an absolute deadline during a news conference at the White ...",
    "link": "https://biztoc.com/x/563b19fb09c9ae7e",
    "timestamp": "2025-06-27T17:25:55Z"
  },
  {
    "title": "US Supreme Court delivers major blow by siding with parents in LGBTQ+ school curriculum, hands Trump a 'huge win'",
    "description": "The US Supreme Court today handed two significant victories to US President Donald Trump. The Supreme Court backed President Donald Trump’s effort to curtail lower court orders that have hampered his agenda for months in a case related to his birthright citiz…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-sides-with-parents-maryland-in-lgbtq-school-curriculum-hands-trump-a-huge-win/articleshow/122117679.cms",
    "timestamp": "2025-06-27T17:25:40Z"
  },
  {
    "title": "Ivanka Trump is pretty in pink at Lauren Sánchez and Jeff Bezos’ wedding",
    "description": "The first daughter wore a stunning floral Tony Ward gown covered in glittering beads.",
    "link": "https://pagesix.com/2025/06/27/style/ivanka-trump-is-pretty-in-pink-at-lauren-sanchez-and-jeff-bezos-wedding/",
    "timestamp": "2025-06-27T17:25:28Z"
  },
  {
    "title": "DR Congo and Rwanda sign long-awaited peace deal in Washington",
    "description": "The deal has been hailed by President Trump as \"a great day\" but there are potential pitfalls.",
    "link": "https://www.bbc.com/news/articles/c1e0ggw7d43o",
    "timestamp": "2025-06-27T17:24:07Z"
  },
  {
    "title": "Justice Jackson issues fiery dissent: 'Existential threat to law'",
    "description": "The Biden appointee said the Trump administration “wants to continue doing something that a court has determined violates the Constitution.”",
    "link": "https://www.msnbc.com/top-stories/latest/supreme-court-ruling-nationwide-injunctions-dissent-justice-jackson-rcna215547",
    "timestamp": "2025-06-27T17:21:48Z"
  },
  {
    "title": "“No Right Is Safe.” SCOTUS Bars Judges From Reining in Trump",
    "description": "The Supreme Court halted courts from issuing national injunctions, forcing “judges to shrug and turn their backs to intermittent lawlessness.”\nThe post “No Right Is Safe.” SCOTUS Bars Judges From Reining in Trump appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/27/supreme-court-birthright-citizenship-injunction/",
    "timestamp": "2025-06-27T17:21:32Z"
  },
  {
    "title": "Will NATO countries meet their new spending goal?",
    "description": "President Donald Trump has long accused other NATO countries of being freeloaders, relying on the United States to provide the bulk of Europe's defense. Now those countries have pledged to ramp up their spending amid fears of an American pullout.\nNATO leaders…",
    "link": "https://biztoc.com/x/1aa1b09300766825",
    "timestamp": "2025-06-27T17:19:51Z"
  },
  {
    "title": "WATCH LIVE: Rubio hosts peace deal signing ceremony between Rwanda and Democratic Republic of Congo",
    "description": "The peace deal is due to be signed in Washington on Friday afternoon. It has been lauded by U.S. President Donald Trump as \"a big day for the world.\"",
    "link": "https://biztoc.com/x/38dc20ce69539458",
    "timestamp": "2025-06-27T17:19:44Z"
  },
  {
    "title": "Donald Trump Expects Iran Inspections - Or Bombs Could Drop Again",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump at a press conference on Friday said he expects Iran to work with international inspectors to verify it doesn't restart its nuclear program, warning in a separate response that if Iran c…",
    "link": "https://biztoc.com/x/592589eb19594e78",
    "timestamp": "2025-06-27T17:19:39Z"
  },
  {
    "title": "Israeli secret services ‘used fake phone call’ to lure Iran’s air force elite to their deaths",
    "description": "The successful hit reportedly hobbled Iran’s ability to respond to the first wave of Israeli Air Force strikes across the country. Israel secret services used a fake phone call to trick the top commanders of Iran’s air force into gathering at a single locatio…",
    "link": "https://freerepublic.com/focus/f-news/4325667/posts",
    "timestamp": "2025-06-27T17:18:20Z"
  },
  {
    "title": "Trump supports growing Bitcoin use amid talk it eases strain on the dollar",
    "description": "Trump's endorsement of Bitcoin could accelerate its mainstream adoption, potentially reshaping global financial dynamics and US economic policy.\nThe post Trump supports growing Bitcoin use amid talk it eases strain on the dollar appeared first on Crypto Brief…",
    "link": "https://cryptobriefing.com/trump-bitcoin-adoption-dollar/",
    "timestamp": "2025-06-27T17:18:04Z"
  },
  {
    "title": "Gavin Newsom Sues Fox News for $787 Million, Claiming Network Defamed Him over L.A. Riots",
    "description": "California Governor Gavin Newsom is suing Fox News for $787 million over its \"deceptive editing\" of a call he had with the president during the Los Angeles immigration riot.\nThe post Gavin Newsom Sues Fox News for $787 Million, Claiming Network Defamed Him ov…",
    "link": "https://www.breitbart.com/politics/2025/06/27/gavin-newsom-sues-fox-news-for-787-million-claiming-network-defamed-him-over-la-riots/",
    "timestamp": "2025-06-27T17:17:18Z"
  },
  {
    "title": "Trump: I would 'absolutely' consider bombing Iran nuclear sites again",
    "description": "President Trump declares he'd \"absolutely\" consider bombing Iranian nuclear sites again if intelligence dictated, but adds he believes Iran is \"exhausted\" and not focused on nuclear pursuits.",
    "link": "https://www.israelnationalnews.com/news/410777",
    "timestamp": "2025-06-27T17:17:09Z"
  },
  {
    "title": "Why DOGE Failed",
    "description": "Musk’s mission, and why America’s budget crisis can’t be fixed.When Donald Trump vowed to tackle excessive federal spending, few expected Elon Musk, the world’s most prominent entrepreneur, to lead the charge. Yet, in a move that reflected Trump’s unconventio…",
    "link": "https://freerepublic.com/focus/f-news/4325666/posts",
    "timestamp": "2025-06-27T17:16:52Z"
  },
  {
    "title": "The Supreme Court's birthright citizenship decision isn't as devastating as you think (Ian Millhiser/Vox)",
    "description": "Ian Millhiser / Vox:\nThe Supreme Court's birthright citizenship decision isn't as devastating as you think  —  On Friday, the Supreme Court released its long-awaited decision in Trump v. CASA, a case challenging President Donald Trump's attempt to strip many …",
    "link": "https://www.memeorandum.com/250627/p81",
    "timestamp": "2025-06-27T17:15:03Z"
  },
  {
    "title": "UVa President Jim Ryan resigns",
    "description": "University of Virginia President Jim Ryan has resigned under pressure from the DOJ, which claimed he lied about his efforts to dismantle DEI at the school.",
    "link": "https://dailyprogress.com/tncms/asset/editorial/c5265d69-887e-46cd-97d7-772c2089fda6/",
    "timestamp": "2025-06-27T17:15:00Z"
  },
  {
    "title": "Bitcoin owners emerge as pivotal voting bloc ahead of 2026 midterms, poll shows",
    "description": "Bitcoin owners are becoming a significant voting group in the United States, and their influence is poised to grow ahead of the 2026 midterm elections. Following their noticeable role in the 2024 presidential vote, recent polling from Cygnal shows that these …",
    "link": "https://cryptoslate.com/bitcoin-owners-emerge-as-pivotal-voting-bloc-ahead-of-2026-midterms-poll-shows/",
    "timestamp": "2025-06-27T17:14:53Z"
  },
  {
    "title": "Ivanka Trump Steps Out in Strapless Tony Ward Gown for Bezos-Sánchez Wedding Celebration",
    "description": "Ivanka Trump wore a pink floral Tony Ward dress to attend the wedding of Lauren Sánchez and Amazon founder Jeff Bezos in Venice, Italy, on Friday.",
    "link": "http://wwd.com/pop-culture/celebrity-news/ivanka-trump-tony-ward-dress-bezos-sanchez-wedding-venice-1237955929/",
    "timestamp": "2025-06-27T17:14:40Z"
  },
  {
    "title": "Donald Trump Expects Iran Inspections - Or Bombs Could Drop Again",
    "description": "President Donald Trump tackled a range of topics at a press conference Friday originally intended to address Supreme Court decisions.",
    "link": "https://www.newsweek.com/donald-trump-expects-iran-inspections-bombs-drop-2091809",
    "timestamp": "2025-06-27T17:13:40Z"
  },
  {
    "title": "Denmark seeks to make it illegal to spread deepfake images, citing concern about misinformation",
    "description": "Culture Minister Jakob Engel-Schmidt, in a statement, said that it was \"high time that we now create a safeguard against the spread of misinformation and at the same time send a clear signal to the tech giants.\"",
    "link": "https://economictimes.indiatimes.com/tech/technology/denmark-seeks-to-make-it-illegal-to-spread-deepfake-images-citing-concern-about-misinformation/articleshow/122117662.cms",
    "timestamp": "2025-06-27T17:13:36Z"
  },
  {
    "title": "WATCH LIVE: Rubio hosts peace deal signing ceremony between Rwanda and Democratic Republic of Congo",
    "description": "The peace deal is due to be signed in Washington on Friday afternoon. It has been lauded by U.S. President Donald Trump as \"a big day for the world.\"",
    "link": "https://www.pbs.org/newshour/politics/watch-live-rubio-hosts-peace-deal-signing-ceremony-between-rwanda-and-democratic-republic-of-congo",
    "timestamp": "2025-06-27T17:13:20Z"
  },
  {
    "title": "'He's a communist!': Trump lashes out at NYC Democratic winner",
    "description": "President Donald Trump attacked the winner of the New York City mayoral primary race on Tuesday, claiming that he is a \"communist.\" The young left-wing candidate, Zohran Mamdani, identifies as a democratic socialist, a label that Sen. Bernie Sanders (I-VT) ha…",
    "link": "https://www.rawstory.com/trump-new-york-mayor-presser/",
    "timestamp": "2025-06-27T17:12:48Z"
  },
  {
    "title": "Republican plan for nationwide private school vouchers deemed in violation of Senate rules",
    "description": "The Senate parliamentarian said the proposal would run afoul of procedural rules.",
    "link": "https://www.bostonherald.com/2025/06/27/school-vouchers/",
    "timestamp": "2025-06-27T17:10:05Z"
  },
  {
    "title": "Gingrich: Democrats have exposed themselves as elitists, demanding ‘privilege’",
    "description": "'Listen to what they’re saying to you. My God, what if they had to actually serve themselves? What if they had to actually mow their lawn? I mean, the brutality of the Trump regime'",
    "link": "https://www.wnd.com/2025/06/gingrich-democrats-have-exposed-themselves-as-elitists-demanding/",
    "timestamp": "2025-06-27T17:09:57Z"
  },
  {
    "title": "Old Democrat Comes Back To Haunt Trump From The Grave",
    "description": "'Parliamentarian is wreaking havoc on Trump's Big, Beautiful Bill, and Republicans are letting it happen.'",
    "link": "https://dailycaller.com/2025/06/27/democrat-big-beautiful-bill-trump-reid-macdonough-thune/",
    "timestamp": "2025-06-27T17:08:59Z"
  },
  {
    "title": "The government cuts key data used in hurricane forecasting, and experts sound an alarm",
    "description": "Weather experts are warning that hurricane forecasts will be severely hampered by the upcoming cutoff of key data from U.S. Department of Defense satellites.",
    "link": "https://www.clickondetroit.com/tech/2025/06/27/the-government-cuts-key-data-used-in-hurricane-forecasting-and-experts-sound-an-alarm/",
    "timestamp": "2025-06-27T17:08:23Z"
  },
  {
    "title": "Will NATO countries meet their new spending goal?",
    "description": "The cost of keeping Trump happy",
    "link": "https://theweek.com/politics/nato-increase-military-spending-trump",
    "timestamp": "2025-06-27T17:08:09Z"
  },
  {
    "title": "California Gov. Newsom sues Fox News for defamation",
    "description": "California Gov. Gavin Newsom is suing Fox News, says it misled viewers and edited Trump video to make Newsom look like a liar.",
    "link": "https://www.usatoday.com/story/news/nation/2025/06/27/gavin-newsom-sues-fox-news-defamation/84384337007/",
    "timestamp": "2025-06-27T17:07:49Z"
  },
  {
    "title": "Nike to raise costs as Trump’s tariffs on China bite",
    "description": "Nike joins companies like Walmart, Target and Mattel that have said they will need to raise prices because of tariffs.",
    "link": "https://www.aljazeera.com/economy/2025/6/27/nike-to-raise-costs-as-trumps-tariffs-on-china-bite",
    "timestamp": "2025-06-27T17:07:07Z"
  },
  {
    "title": "Eric Trump Threatens Political Run: ‘I Think I Could Do It’",
    "description": "Eric Trump threatens political run: ‘I Think I Could Do It.’ In an interview with ‘Financial Times,’ Donald Trump’s son said he — or perhaps one of his family members — might enter politics. This significantly increases the threat of a Trump dynasty.",
    "link": "http://nymag.com/intelligencer/article/eric-trump-threatens-political-run-i-think-i-could-do-it.html",
    "timestamp": "2025-06-27T17:07:01Z"
  },
  {
    "title": "The S&P 500 has retaken all-time highs. Here’s how much European and Chinese stocks raced ahead while U.S. markets regained lost ground",
    "description": "Where would the S&P 500 be today if Trump hadn't shocked Wall Street with much steeper-than-expected tariffs?",
    "link": "https://fortune.com/2025/06/27/stock-market-all-time-high-europe-china-trade/",
    "timestamp": "2025-06-27T17:06:59Z"
  },
  {
    "title": "Jeff Bezos and Lauren Sanchez's Venice Wedding in Pictures",
    "description": "Jeff Bezos and Lauren Sanchez's wedding events are underway in Venice, Italy.",
    "link": "https://www.newsweek.com/jeff-bezos-lauren-sanchezs-venice-wedding-pictures-2091700",
    "timestamp": "2025-06-27T17:05:42Z"
  }
]