[
  {
    "title": "Trump Tower in North Korea Suggested as Kim Jong Un Meeting Teased",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSouth Korean President Lee Jae Myung floated the idea of building a Trump Tower in North Korea during a meeting at the White House this week, as U.S. President Donald Trump expressed interest in reviving direc…",
    "link": "https://biztoc.com/x/35984bb61fd748dc",
    "timestamp": "2025-08-26T09:49:19Z"
  },
  {
    "title": "Trump says he’s firing Fed governor Lisa Cook, she vows she ‘will not resign’",
    "description": "President Donald Trump said Monday night that he’s firing Federal Reserve Governor Lisa Cook, an unprecedented move that would constitute a sharp escalation in his battle to exert greater control over what has long been considered an institution independent f…",
    "link": "https://biztoc.com/x/47f2bb9c2c28af5f",
    "timestamp": "2025-08-26T09:49:01Z"
  },
  {
    "title": "Trump Family Went Pro-Crypto After Biden 'Weaponized' Banks",
    "description": "Trump Family Went Pro-Crypto After Biden 'Weaponized' Banks\n \nEric Trump, son of US President Donald Trump, said the family became pro-crypto after they were “debanked” in the aftermath of the Capitol attack incident in early 2021.\nSeveral banks shut down hun…",
    "link": "https://biztoc.com/x/b552ddcf775b7cdd",
    "timestamp": "2025-08-26T09:48:59Z"
  },
  {
    "title": "71% of Britons Say Left-Wing Starmer Doing Bad Job on Borders, Farage's Reform Most Trusted",
    "description": "Vast majority think the UK govt is doing a bad job on borders and asylum, polling finds, even among supporters of PM Starmer's own party.\nThe post 71% of Britons Say Left-Wing Starmer Doing Bad Job on Borders, Farage’s Reform Most Trusted appeared first on Br…",
    "link": "https://www.breitbart.com/europe/2025/08/26/71-of-britons-say-left-wing-starmer-doing-bad-job-on-borders/",
    "timestamp": "2025-08-26T09:48:52Z"
  },
  {
    "title": "“He lies about his lies”: MLB legend Roger Clemens reveals Donald Trump’s golf struggles as steroids accusations resurface",
    "description": "Donald Trump's golf outing with Roger Clemens at Trump National Golf Club ended with the former president trailing behind. Clemens shared the scorecard on Instagram, highlighting Trump's last-place finish despite shooting a 77. This event followed Trump's voc…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/he-lies-about-his-lies-mlb-legend-roger-clemens-reveals-donald-trumps-golf-struggles-as-steroids-accusations-resurface/articleshow/123522961.cms",
    "timestamp": "2025-08-26T09:46:31Z"
  },
  {
    "title": "Trump Tower in North Korea Suggested as Kim Jong Un Meeting Teased",
    "description": "The South Korean president broached the idea of building a Trump Tower on the Korean Peninsula as a sign of peace.",
    "link": "https://www.newsweek.com/trump-tower-north-korea-kim-jong-un-2119239",
    "timestamp": "2025-08-26T09:45:59Z"
  },
  {
    "title": "Cracker Barrel, under fire from Donald Trump Jr. and Steak n’ Shake, apologizes to fans but won’t drop new logo",
    "description": "“If the last few days have shown us anything, it's how deeply people care about Cracker Barrel ... You've also shown us that we could have done a better job sharing who we are and who we'll always be.”",
    "link": "https://fortune.com/2025/08/26/cracker-barrel-logo-apology-social-media-trump-steak-shake/",
    "timestamp": "2025-08-26T09:45:43Z"
  },
  {
    "title": "SCO Summit in Tianjin: Xi, Putin, Modi to showcase Global South unity",
    "description": "While substantive breakthroughs appear unlikely, the summit underscores China’s bid to shape a post-American global order alongside Russia and other Global South nations..",
    "link": "https://www.thehindubusinessline.com/news/world/sco-summit-in-tianjin-xi-putin-modi-to-showcase-global-south-unity/article69978626.ece",
    "timestamp": "2025-08-26T09:45:03Z"
  },
  {
    "title": "Trump has bought $100 million in bonds since taking office. His portfolio is poised to get a boost if the Fed cuts rates.",
    "description": "Trump has repeatedly pressured the Fed to cut rates, something that could boost bond portfolios, including his own.",
    "link": "https://www.businessinsider.com/trump-bond-buying-how-much-return-fed-interest-rate-cuts-2025-8",
    "timestamp": "2025-08-26T09:45:01Z"
  },
  {
    "title": "Trump Wants to Change Voting Rules. He Should Be Careful What He Wishes For.",
    "description": "He may disenfranchise more Republicans than Democrats.",
    "link": "https://slate.com/news-and-politics/2025/08/trump-vote-by-mail-elections-democrats-republicans-absentee-ballot.html",
    "timestamp": "2025-08-26T09:45:00Z"
  },
  {
    "title": "Donald Trump's Executive Order to End Cashless Bail: What to Know",
    "description": "\"This is a waste of public resources and a threat to public safety,\" the president said of the bail reform policy on Monday.",
    "link": "https://www.newsweek.com/trump-cashless-bail-order-what-know-2119242",
    "timestamp": "2025-08-26T09:44:36Z"
  },
  {
    "title": "Trump says he’s firing Fed governor Lisa Cook, she vows she ‘will not resign’",
    "description": "Trump's move is likely to touch off an extensive legal battle that will probably go to the Supreme Court and could disrupt financial markets.",
    "link": "https://fortune.com/2025/08/26/trump-federal-reserve-lisa-cook-says-hes-firing-supreme-court/",
    "timestamp": "2025-08-26T09:42:19Z"
  },
  {
    "title": "Quad important for critical minerals for India and Japan, Indian foreign ministry says",
    "description": "Quad grouping includes India, Japan, Australia and the U.S. and New Delhi is expected to host the summit of its leaders this year amid a souring of its ties with Washington over tariffs imposed on Indian goods by President Donald Trump",
    "link": "https://www.thehindubusinessline.com/news/world/quad-important-for-critical-minerals-for-india-and-japan-indian-foreign-ministry-says/article69978627.ece",
    "timestamp": "2025-08-26T09:40:58Z"
  },
  {
    "title": "Donald Trump announces \"tariff investigation\" for US furniture imports",
    "description": "US president Donald Trump has announced that he will be launching a probe on furniture imports with the aim of bringing furniture businesses back to states such as North Carolina. Published last Friday 0n Trump's Truth Social account, the statement suggested …",
    "link": "https://www.dezeen.com/2025/08/26/tariff-investigation-us-furniture-imports-donald-trump/",
    "timestamp": "2025-08-26T09:38:28Z"
  },
  {
    "title": "China Sends Senior Trade Negotiator to Meet US Officials",
    "description": "China is sending a key trade negotiator to the US, a move that signals talks are progressing after President Donald Trump extended a tariff truce earlier this month.",
    "link": "https://financialpost.com/pmn/business-pmn/china-sends-senior-trade-negotiator-to-meet-us-officials",
    "timestamp": "2025-08-26T09:34:03Z"
  },
  {
    "title": "This shocking Trump assault on democracy is no conspiracy theory",
    "description": "Donald Trump is now raiding the homes and launching investigations into political insiders who’ve publicly criticized him. Other former Trump administration officials are clamming up. We’ve entered the phase of this transition to fascism where objections to h…",
    "link": "https://www.rawstory.com/raw-investigates/donald-trump-election-results/",
    "timestamp": "2025-08-26T09:30:02Z"
  },
  {
    "title": "American Democracy, RIP",
    "description": "David Faris\n\n\n\nThe bulwarks of self-government have given way under multiple MAGA putsches. Instead of pledging to protect our democracy, Democrats need a plan to restore it\r\n\n\r\n\n\nThe post American Democracy, RIP appeared first on The Nation.",
    "link": "https://www.thenation.com/article/archive/democracy-maga-authoritarianism/",
    "timestamp": "2025-08-26T09:30:00Z"
  },
  {
    "title": "미국 Z세대, 레이건·부시84 티셔츠 인기",
    "description": "Donald Trump's book helped South Korean President Lee Jae Myung avoid a \"Zelenskiy moment\" at the White House https://t.co/WdcInoAifw— Bloomberg (@business) August 26, 2025 Donald Trump dramatically escalated his fight for control over the Federal Reserve by …",
    "link": "https://ryueyes11.tistory.com/511804",
    "timestamp": "2025-08-26T09:27:44Z"
  },
  {
    "title": "How Rare Is DC's 12-day Homicide-Free Run?",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWashington, D.C. has had three periods in 2025 where there were no murders for more than a week, despite claims by President Donald Trump suggesting otherwise—as of Monday evening, the capital had not recorded…",
    "link": "https://biztoc.com/x/b830116c31f7b2ec",
    "timestamp": "2025-08-26T09:26:35Z"
  },
  {
    "title": "'Powerful optics': China's Xi to welcome Putin, Modi in grand show of solidarity",
    "description": "President Xi Jinping will host the Shanghai Cooperation Organisation summit in Tianjin. Over twenty world leaders are expected to attend. Prime Minister Narendra Modi will visit China after seven years. Discussions will focus on regional security and cooperat…",
    "link": "https://economictimes.indiatimes.com/news/india/powerful-optics-chinas-xi-to-welcome-putin-modi-in-grand-show-of-solidarity/articleshow/123522457.cms",
    "timestamp": "2025-08-26T09:22:49Z"
  },
  {
    "title": "Battenfeld: Trump threat to deploy troops to other cities puts Michelle Wu’s crime claims to test",
    "description": "With the Guard possibly moving into Chicago and Baltimore, just the threat of an expansion into Boston would be a challenge to Wu’s strength in the heat of her re-election race.",
    "link": "https://www.bostonherald.com/2025/08/26/battenfeld-trump-threat-to-deploy-troops-to-other-cities-puts-michelle-wus-crime-claims-to-test/",
    "timestamp": "2025-08-26T09:21:16Z"
  },
  {
    "title": "How Rare Is DC's 12-day Homicide-Free Run?",
    "description": "President Donald Trump has claimed it has been \"many years\" since D.C. had a murder-free stretch of more than a week.",
    "link": "https://www.newsweek.com/washington-dc-homicide-crime-rate-2119222",
    "timestamp": "2025-08-26T09:20:21Z"
  },
  {
    "title": "Indonesia says US agrees tariff exemption for its palm oil, cocoa, rubber",
    "description": "JAKARTA (Reuters) -The United States has agreed in principle to exempt Indonesian exports of cocoa, palm oil and rubber from President Donald Trump's tariff ...",
    "link": "https://finance.yahoo.com/news/indonesia-says-us-agrees-tariff-091819735.html",
    "timestamp": "2025-08-26T09:18:19Z"
  },
  {
    "title": "Are President Trump's Tariffs Finally Hitting Crypto?",
    "description": "Key Points\n-\nThe Trump administration's tariffs are causing a lot of volatility.\n-\nThey may ultimately throw a wet blanket on the crypto market.\n-\nThere isn't much evidence to suggest that's happening currently.\nWith President Donald Trump's tariff regime now…",
    "link": "https://biztoc.com/x/dcd078b97e15edc4",
    "timestamp": "2025-08-26T09:17:00Z"
  },
  {
    "title": "Trump Says He Wants To Meet North Korean Dictator Kim Jong Un This Year",
    "description": "Since Trump's January inauguration, Kim has ignored Trump's repeated calls to revive the direct diplomacy he pursued in his first term.",
    "link": "https://www.huffpost.com/entry/trump-says-he-wants-to-meet-kim-jong-un-again_n_68ad789de4b075305188c828",
    "timestamp": "2025-08-26T09:16:00Z"
  },
  {
    "title": "MAGA Rages Over Trump's Chinese Student Numbers: 'Should Never Allow That'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSupporters of President Donald Trump are outraged by his announcement that 600,000 Chinese students will be allowed into the United States to study.\nTrump made the comments at the White House on Monday as trad…",
    "link": "https://biztoc.com/x/658ef5c1402ade05",
    "timestamp": "2025-08-26T09:15:23Z"
  },
  {
    "title": "Trump’s Intel deal gambles with the perils of picking national champions",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/08/26/trumps-intel-deal-gambles-with-the-perils-of-picking-national-champions/",
    "timestamp": "2025-08-26T09:13:52Z"
  },
  {
    "title": "Ireland back in Trump’s crosshairs as he promises ‘substantial tariffs’ on countries who ‘attack’ American tech companies",
    "description": "US president Donald Trump has said he will impose \"substantial additional tariffs” on countries regulating American big tech firms, in a move that could have implications for Ireland.",
    "link": "https://www.independent.ie/world-news/north-america/ireland-back-in-trumps-crosshairs-as-he-promises-substantial-tariffs-on-countries-who-attack-american-tech-companies/a233149067.html",
    "timestamp": "2025-08-26T09:13:08Z"
  },
  {
    "title": "Karoline Leavitt's Truly Unbelievable New Claim About Trump Backfires Immediately",
    "description": "Critics mocked the White House press secretary over her latest wild claim about the president.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-trump-transparency_n_68ad6067e4b0a97e93631c74",
    "timestamp": "2025-08-26T09:09:09Z"
  },
  {
    "title": "MAGA Rages Over Trump's Chinese Student Numbers: 'Should Never Allow That'",
    "description": "President Donald Trump said he would allow 600,000 Chinese students to come to the United States.",
    "link": "https://www.newsweek.com/maga-rages-trump-chinese-student-numbers-2119215",
    "timestamp": "2025-08-26T09:08:11Z"
  },
  {
    "title": "Trump vows to impose furniture tariffs. What would that mean for prices?",
    "description": "Trump vows to impose furniture tariffs. What would that mean for prices?go.com",
    "link": "https://abcnews.go.com/Business/trump-vows-impose-furniture-tariffs-prices/story?id=124948334",
    "timestamp": "2025-08-26T09:07:59Z"
  },
  {
    "title": "U.S. Treasury yields: Trump says he's firing Fed Governor Lisa Cook",
    "description": "U.S. Treasury yields were mixed after U.S. President Donald Trump moved to fire Federal Reserve Governor Lisa Cook from the central bank board.",
    "link": "https://www.cnbc.com/2025/08/26/us-treasury-yields-trump-says-hes-firing-fed-governor-lisa-cook-.html",
    "timestamp": "2025-08-26T09:03:14Z"
  },
  {
    "title": "Trump’s 50% tariff shock for India to hit soon – what it means for growth, jobs, and hardest-hit sectors",
    "description": "Trump India Tariffs Impact: US 50% tariffs on Indian exports take effect tomorrow, targeting textiles, seafood, gems, jewellery, and leather. Analysts warn the move could threaten millions of jobs and shave 0.5% off India’s GDP.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-tarrifs-impact-50-shock-for-india-to-hit-soon-what-it-means-for-growth-jobs-and-hardest-hit-sectors/articleshow/123521817.cms",
    "timestamp": "2025-08-26T09:02:30Z"
  },
  {
    "title": "MORNING GLORY: Are President Trump’s tariffs actually working?",
    "description": "If so, will skeptics revise their disdain for them?",
    "link": "https://www.foxnews.com/opinion/morning-glory-president-trumps-tariffs-actually-working",
    "timestamp": "2025-08-26T09:00:46Z"
  },
  {
    "title": "LIZ PEEK: Trump pranks Democrats into opposing something they've always claimed to support",
    "description": "Donald Trump is trying to reverse course after Joe Biden. He is threatening to send troops to violence-prone cities and has just signed an executive order to eliminate cashless bail.",
    "link": "https://www.foxnews.com/opinion/liz-peek-trump-pranks-democrats-opposing-something-theyve-always-claimed-support",
    "timestamp": "2025-08-26T09:00:11Z"
  },
  {
    "title": "Bankruptcies Are Hitting America's Health Care Giants",
    "description": "\"There's a lot of wreckage out there along the highway in health care,\" one healthcare expert told Newsweek.",
    "link": "https://www.newsweek.com/bankruptcies-hitting-american-healthcare-giants-2117925",
    "timestamp": "2025-08-26T09:00:02Z"
  },
  {
    "title": "The Americans Stealing Palestinian Land",
    "description": "Carolina Sophia Pedrazzi\n\n\n\nAs the West Bank gets carved up for illegal settlements, US real estate companies are eager to cash in.\r\n\n\r\n\n\nThe post The Americans Stealing Palestinian Land appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=568056",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "'Maybe they will, maybe they won't': Trump voices doubt over Zelenskyy-Putin talks",
    "description": "President Donald Trump is signaling fresh doubts about whether Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin will meet anytime soon.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-voices-doubt-zelenskyy-putin-meeting-ukraine-war-russia-rcna227047",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "Blue States That Sued Kept Most CDC Grants, While Red States Feel Brunt of Trump Clawbacks",
    "description": "The Trump administration's cuts of public health funds to state and local health departments had vastly uneven effects depending on the political leanings of where someone lives, a new KFF Health News analysis shows.",
    "link": "https://kffhealthnews.org/news/article/cdc-grant-trump-clawbacks-blue-red-state-comparison/",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "When hospitals and insurers fight, patients get caught in the middle",
    "description": "About 90,000 people spent months in limbo as central Missouri's major medical provider fought over insurance contracts. These disputes between insurers and hospitals are a recurring problem.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/08/26/nx-s1-5515408/health-insurance-network-contract-price-legal-patients",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "MAHA loves dietary supplements. But that hasn’t led to gains in Washington — yet.",
    "description": "MAHA loves dietary supplements. But that hasn’t yet led to gains for the industry in Washington.",
    "link": "https://www.nbcnews.com/news/us-news/maha-loves-dietary-supplements-hasnt-led-gains-washington-rcna226973",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "How China Engineered the Next Century",
    "description": "Rollin Hu\n\n\n\nDan Wang argues that the battle between China and the United States is simply a conflict between engineers and lawyers. The situation is much more complicated than that. \r\n\n\r\n\n\nThe post How China Engineered the Next Century appeared first on The …",
    "link": "https://www.thenation.com/?post_type=article&p=567204",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "The Chilling Evolution From George W. Bush to Trump 2.0",
    "description": "Thomas Drake\n\n\n\nThe raids on my home and on John Bolton’s mark inflection points—the weaponization of secrecy as a political strategy and the radical extension of state power to silence critics. \r\n\n\r\n\n\nThe post The Chilling Evolution From George W. Bush to Tr…",
    "link": "https://www.thenation.com/?post_type=article&p=568020",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "Graham Platner Is the Real Deal",
    "description": "Aaron Regunberg\n\n\n\nThe Maine oyster farmer embodies the populist energy that Americans have been looking for. He’s the best candidate to defeat Republican Senator Susan Collins.\r\n\n\r\n\n\nThe post Graham Platner Is the Real Deal appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=568222",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "A DNC Member Is Calling for an Arms Embargo on Israel. Will the Party Leadership Listen?",
    "description": "Zoya Alam\n\n\n\nAllison Minnerly speaks about her upcoming resolution urging a ceasefire, an arms embargo on Israel, and recognition of Palestine as a state.\r\n\n\r\n\n\nThe post A DNC Member Is Calling for an Arms Embargo on Israel. Will the Party Leadership Listen? …",
    "link": "https://www.thenation.com/?post_type=article&p=567996",
    "timestamp": "2025-08-26T09:00:00Z"
  },
  {
    "title": "Clearing debris after a storm is big business. For some communities, it’s also a burden",
    "description": "How the necessary work of cleaning up can make an even bigger mess.",
    "link": "https://www.nationalobserver.com/2025/08/26/news/cleaning-debris-after-storm-hurricane-helene",
    "timestamp": "2025-08-26T08:55:02Z"
  },
  {
    "title": "ETtech Explainer: How 50% US tariff could impact India’s tech ecosystem",
    "description": "The Indian IT sector, though not directly targeted by the US tariffs, could be hit by reduced tech spending from US clients facing cost pressures. With slow revenue growth, rising layoffs, and client hesitation, the sector faces growing uncertainty. Tradition…",
    "link": "https://economictimes.indiatimes.com/tech/technology/ettech-explainer-how-50-us-tariff-could-impact-indias-tech-ecosystem/articleshow/123521487.cms",
    "timestamp": "2025-08-26T08:50:52Z"
  },
  {
    "title": "Trump administration halts construction of nearly finished offshore wind farm",
    "description": "Ørsted’s Revolution Wind project off the coast of Massachusetts and Rhode Island is hit with a stop-work order over vague ​“national security” concerns.",
    "link": "https://www.canarymedia.com/articles/offshore-wind/trump-admin-halts-construction-of-nearly-finished-offshore-wind-farm",
    "timestamp": "2025-08-26T08:45:00Z"
  },
  {
    "title": "TACO trade crumbles: Trump's fresh 25% tariff hammer falls tonight as export stocks crash",
    "description": "President Trump’s fresh 25% tariff on Indian goods, effective midnight, doubled the effective duty to 50%, triggering a market rout. The Sensex crashed over 600 points and the Nifty shed 1% as hopes of a reprieve faded. Export-driven sectors like textiles, fi…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/taco-trade-crumbles-trumps-fresh-25-tariff-hammer-falls-tonight-as-export-stocks-crash/articleshow/123521705.cms",
    "timestamp": "2025-08-26T08:42:22Z"
  },
  {
    "title": "US, India reaffirm commitment to energy security partnership at IACC energy summit",
    "description": "Amid ongoing tariff issues, Xiaobing Feng, Principal Commercial Officer at the US Embassy in India, on Tuesday reaffirmed the US commitment to work with India in many sectors, specifically in the energy security partnership.",
    "link": "https://economictimes.indiatimes.com/industry/energy/us-india-reaffirm-commitment-to-energy-security-partnership-at-iacc-energy-summit/articleshow/123521631.cms",
    "timestamp": "2025-08-26T08:39:04Z"
  },
  {
    "title": "In China, EVs are now cheaper than gas cars. In the U.S., the Big Three still haven’t closed a premium that’s $14,000 per vehicle",
    "description": "Detroit isn’t doomed, said Dan Sperling, founding director of the UC Davis Institute of Transportation Studies. But it requires some key policy support.",
    "link": "https://fortune.com/2025/08/26/china-ev-prices-cheaper-gas-us-big-three-gm-ford-stellantis/",
    "timestamp": "2025-08-26T08:34:00Z"
  },
  {
    "title": "California High-Speed Rail Needs $1 Billion More Per Year from Cash-Strapped State to Survive",
    "description": "California's troubled high-speed rail project needs an additional $1 billion per year from the state legislature to survive, officials said Monday, after the withdrawal of $4 billion in funding by the Trump administration.\nThe post California High-Speed Rail …",
    "link": "https://www.breitbart.com/politics/2025/08/26/california-high-speed-rail-needs-1-billion-more-per-year-from-cash-strapped-state-to-survive/",
    "timestamp": "2025-08-26T08:33:07Z"
  },
  {
    "title": "US futures down as Trump-Cook spat escalates",
    "description": "Equities on Wall Street traded lower in the premarket on Tuesday after US President Donald Trump announced that he had removed Federal Reserve Board Governor Lisa Cook from her position. She responded...",
    "link": "https://biztoc.com/x/7b432455f934c90a",
    "timestamp": "2025-08-26T08:30:38Z"
  },
  {
    "title": "Moldova set to choose between Trump and Brussels – analyst",
    "description": "The EU candidate nation is said to be at a crossroads between two versions of democracy as it approaches parliament elections Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623525-moldova-us-eu-choice/",
    "timestamp": "2025-08-26T08:25:24Z"
  },
  {
    "title": "Agreement on Japan’s $550 billion investment pledge to be released this week",
    "description": "The U.S. commerce secretary continues to insist that the U.S. president will control the funds.",
    "link": "https://www.japantimes.co.jp/business/2025/08/26/economy/lutnick-japan-agreement/",
    "timestamp": "2025-08-26T08:24:00Z"
  },
  {
    "title": "Aid To Famine-struck Gaza Still 'Drop In The Ocean': WFP",
    "description": "The World Food Programme warned Tuesday that the aid Israel is allowing to enter Gaza remains a \"drop in the ocean\", days after famine was formally declared in the war-torn Palestinian territory.",
    "link": "https://www.ibtimes.com/aid-famine-struck-gaza-still-drop-ocean-wfp-3781679",
    "timestamp": "2025-08-26T08:21:21Z"
  },
  {
    "title": "Trump Threatens 200% Tariffs On China, Beijing Reportedly Rushes Top Trade Negotiator To Washington",
    "description": "President Donald Trump has warned of a potential tariff hike on Chinese rare-earth magnets, a move that could jeopardize the ongoing trade truce between the U.S. and China.\nTrump Threatens Steep Tariffs If China Limits Magnet Exports\nTrump, on Monday, caution…",
    "link": "https://biztoc.com/x/d50fe3a135306e67",
    "timestamp": "2025-08-26T08:19:28Z"
  },
  {
    "title": "Aid to famine-struck Gaza still ‘drop in the ocean’: WFP",
    "description": "The World Food Programme warned Tuesday that the aid Israel is allowing to enter Gaza remains a “drop in the ocean”, days after famine was formally declared in the war-torn Palestinian territory. The United Nations declared a famine in Gaza on Friday, blaming…",
    "link": "https://www.digitaljournal.com/world/aid-to-famine-struck-gaza-still-drop-in-the-ocean-wfp/article",
    "timestamp": "2025-08-26T08:17:20Z"
  },
  {
    "title": "European church leaders call for a just peace in Ukraine",
    "description": "European churches are calling on political leaders to do everything in their power to bring an end to the war in Ukraine.",
    "link": "https://www.christiantoday.com/news/european-church-leaders-call-for-a-just-peace-in-ukraine",
    "timestamp": "2025-08-26T08:14:00Z"
  },
  {
    "title": "François Bye-Bye-rou?",
    "description": "Good morning, and welcome to The Capitals. Brussels is still dozing through the final days of summer, with the real rentrée yet to arrive. For now, the political action is playing out a little further south. This is Eddy Wax,...",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-francois-bye-bye-rou/",
    "timestamp": "2025-08-26T08:13:23Z"
  },
  {
    "title": "Trump 'very angry' with Putin as Ukraine strikes continue despite peace push",
    "description": "President Donald Trump again on Monday expressed frustration with Russian counterpart Vladimir Putin as Russian strikes on Ukraine continued.",
    "link": "https://abcnews.go.com/International/trump-angry-putin-ukraine-strikes-continue-despite-peace/story?id=124977411",
    "timestamp": "2025-08-26T08:12:11Z"
  },
  {
    "title": "‘Get out of the room’: Trump kicks out his Oval Office staff for distracting him during press conference; video surfaces",
    "description": "A video circulating online shows US President Trump abruptly ordering White House staff secretary Will Scharf to leave the Oval Office during a press conference on Monday. Reports suggest the outburst was triggered by a disruptive noise, possibly a cell phone…",
    "link": "https://economictimes.indiatimes.com/news/international/us/get-out-of-the-room-trump-kicks-out-his-oval-office-staff-for-distracting-him-during-press-conference-video-surfaces/articleshow/123520972.cms",
    "timestamp": "2025-08-26T08:11:27Z"
  },
  {
    "title": "US Takes Steps to Hit India With 50% Tariff From Wednesday",
    "description": "The Trump Administration outlined plans to implement a 50% tariff on products from India in a draft notice published Monday, the latest signal that the White House plans to push ahead with the heightened levies as efforts to broker a peace deal between Russia…",
    "link": "https://financialpost.com/pmn/business-pmn/us-takes-steps-to-hit-india-with-50-tariff-from-wednesday",
    "timestamp": "2025-08-26T08:02:25Z"
  },
  {
    "title": "Is Europe’s support for Ukraine a federal moment?",
    "description": "Vera Spyrakou argues the pressures of war are driving Europe to act as a political union, even in domains once thought beyond its reach. The meeting in Brussels on 17 … Continued\nThe post Is Europe’s support for Ukraine a federal moment? first appeared on EUR…",
    "link": "https://blogs.lse.ac.uk/europpblog/2025/08/26/is-europes-support-for-ukraine-a-federal-moment-european-federalism/",
    "timestamp": "2025-08-26T08:02:02Z"
  },
  {
    "title": "Critics Go To War Over Trump’s 'WTF' Military Rebrand Idea",
    "description": "The president's proposal sparked a war of words from his detractors.",
    "link": "https://www.huffpost.com/entry/donald-trump-rebrand-idea_n_68ad5770e4b075305188b100",
    "timestamp": "2025-08-26T08:00:47Z"
  },
  {
    "title": "Greater Israel or Palestinian capital? Tiny strip of land could divide the West Bank",
    "description": "Israel has approved a settlement in the occupied West Bank that would cut the territory in two, and could destroy hopes for a future Palestinian state.",
    "link": "https://www.nbcnews.com/world/middle-east/greater-israel-palestinian-capital-tiny-strip-land-divide-west-bank-rcna226955",
    "timestamp": "2025-08-26T08:00:35Z"
  },
  {
    "title": "Beijing Tests Trump's America in South China Sea",
    "description": "\"China responds to risk, not confidence building measures,\" a Manila-based analyst told Newsweek.",
    "link": "https://www.newsweek.com/china-tests-us-strength-south-china-sea-2119118",
    "timestamp": "2025-08-26T08:00:01Z"
  },
  {
    "title": "Why a Quebec food can maker reshored its supply chain back to Canada from the U.S.",
    "description": "With U.S. tariffs still weighing on Canada's steel and aluminum sectors, a Quebec-based food can manufacturer is expanding its operations — and bringing the American portion of its supply chain back home.",
    "link": "https://www.cbc.ca/news/business/quebec-food-can-maker-ideal-can-reshoring-supply-chain-1.7617190",
    "timestamp": "2025-08-26T08:00:00Z"
  },
  {
    "title": "Trump signs executive order that aims to end cashless bail in Washington, D.C., other cities",
    "description": "U.S. President Donald Trump signed an executive order aiming to end cashless bail in Washington, D.C., and identify other jurisdictions that use cashless bail systems — and withhold funding from those states.",
    "link": "https://www.cbc.ca/news/world/donald-trump-cashless-bail-system-1.7617023",
    "timestamp": "2025-08-26T08:00:00Z"
  },
  {
    "title": "U.S. Treasury Yields Mostly Rise as Trump Moves to Remove Fed's Cook",
    "description": "Dow, S&P 500, and Nasdaq futures are falling in premarket trading as the stock market reacts to President Donald Trump saying he had removed Lisa Cook from her job as a Federal Reserve governor.",
    "link": "https://www.barrons.com/livecoverage/stock-market-news-today-082625",
    "timestamp": "2025-08-26T07:58:53Z"
  },
  {
    "title": "Don’t Be Fooled By NATO’s Change In Climate Discourse",
    "description": "Climate discourse has shifted from skepticism to morality, economics, and security - now it’s so tied to geopolitics it can’t be ignored.",
    "link": "https://www.forbes.com/sites/elenabou/2025/08/26/dont-be-fooled-by-natos-change-in-climate-discourse/",
    "timestamp": "2025-08-26T07:58:05Z"
  },
  {
    "title": "Stock Market Today: Dow, S&P 500, Nasdaq Set to Open Down; Trump Fed Fears; Intel, Nvidia, More Movers",
    "description": "LIVE\nDow Set to Open Down After Trump Says He's Removing Fed’s Cook\nS&P 500 and Nasdaq futures are also falling in premarket trading.\nLast Updated:\nAug. 26, 2025 at 3:50 AM ET\nKey Events\nLatest Updates\nU.S. stocks looked set to drop on Tuesday after President…",
    "link": "https://biztoc.com/x/3f2dbe6e3fa0b87a",
    "timestamp": "2025-08-26T07:56:56Z"
  },
  {
    "title": "Mass evacuations in eastern Pakistan as India releases water from swollen rivers",
    "description": "Officials say rescuers in eastern Pakistan have evacuated tens of thousands of people to safer areas after neighboring India released water from overflowing dams and swollen rivers into low-lying border regions",
    "link": "https://abcnews.go.com/International/wireStory/mass-evacuations-eastern-pakistan-india-releases-water-swollen-124977507",
    "timestamp": "2025-08-26T07:50:26Z"
  },
  {
    "title": "Donald Trump says he'd like to meet Kim Jong Un this year",
    "description": "US President Donald Trump says he would like to meet North Korean leader Kim Jong Un this year.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-says-hed-like-to-meet-kim-jong-un-this-year/a378762018.html",
    "timestamp": "2025-08-26T07:49:49Z"
  },
  {
    "title": "Asian stocks down after Trump Fed firing, tariff threats",
    "description": "Asian stocks retreated Tuesday after a series of market-rattling announcements by US President Donald Trump, including an unusual move to fire a central bank...",
    "link": "https://finance.yahoo.com/news/asian-stocks-down-trump-fed-025501866.html",
    "timestamp": "2025-08-26T07:47:39Z"
  },
  {
    "title": "Japan's Nikkei ends at over 2-week low as yen gains after Trump fires Fed's Cook",
    "description": "Japan's Nikkei share average ended at a more than two-week low on Tuesday, as the yen strengthened after U.S. President Donald Trump fired a Federal Reserve governor.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-over-2-week-low-as-yen-gains-after-trump-fires-feds-cook/articleshow/123520587.cms",
    "timestamp": "2025-08-26T07:46:26Z"
  },
  {
    "title": "European shares fall on French political risks, Fed concerns",
    "description": "European shares dropped on Tuesday, led by losses in France as political uncertainty deepened in the country, while mounting concerns over the U.S. Federal Reserve's independence curbed appetite for riskier assets globally.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-fall-on-french-political-risks-fed-concerns/articleshow/123520524.cms",
    "timestamp": "2025-08-26T07:43:54Z"
  },
  {
    "title": "The 9 at 9: Tuesday",
    "description": "Here’s all the news to know as you start your day.",
    "link": "https://www.thejournal.ie/the-9-at-9-tuesday-116-6799243-Aug2025/",
    "timestamp": "2025-08-26T07:43:27Z"
  },
  {
    "title": "Gold prices rise to 2-week high at Rs 1,00,950/10 grams as Trump fires Fed Governor. More safe haven buying ahead?",
    "description": "Gold and silver prices rose in domestic markets, driven by safe-haven demand after Fed Governor Lisa Cook’s firing and expectations of a September rate cut. Gold touched Rs 1,00,950/10g, silver Rs 1,16,284/kg. Volatility is expected amid rupee movements, doll…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-prices-rise-to-2-week-high-at-rs-100950/10-grams-as-trump-fires-fed-governor-more-safe-haven-buying-ahead/articleshow/123520450.cms",
    "timestamp": "2025-08-26T07:42:10Z"
  },
  {
    "title": "Donald Trump threatens retaliation over taxes that ‘discriminate’ against US tech",
    "description": "European Union and UK in president’s sights as he claims other countries’ digital levies hurt US companies while ignoring China",
    "link": "https://www.irishtimes.com/business/economy/2025/08/26/donald-trump-threatens-retaliation-over-taxes-that-discriminate-against-us-tech/",
    "timestamp": "2025-08-26T07:36:58Z"
  },
  {
    "title": "Trump threatens more tariffs for countries with digital taxes",
    "description": "Sources said earlier that the Trump administration was considering imposing sanctions on European Union or member state officials responsible for implementing the bloc's landmark Digital Services Act.",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-threatens-more-tariffs-for-countries-with-digital-taxes/articleshow/123520328.cms",
    "timestamp": "2025-08-26T07:35:21Z"
  },
  {
    "title": "UK guilt yields rise after Trump's Fed move",
    "description": "The yields on the United Kingdom government bonds increased on Tuesday, following United States President Donald Trump's decision to fire Federal Reserve Governor Lisa Cook. Trump claimed that Cook co...",
    "link": "https://biztoc.com/x/eee8b8bf9c7c27cd",
    "timestamp": "2025-08-26T07:34:32Z"
  },
  {
    "title": "Korean Air to buy 103 Boeing jets as Trump pressures trading partners",
    "description": "Korean Air to buy 103 Boeing jets as Trump pressures trading partners\nUS aviation giant Boeing and Korean Air announced a deal worth about $36bn (£24bn) on Monday for 103 planes as President Donald Trump presses trading partners to do more business with Ameri…",
    "link": "https://biztoc.com/x/c3efab65e806ab5a",
    "timestamp": "2025-08-26T07:34:27Z"
  },
  {
    "title": "Lutnick says announcement on Japan trade deal to be made this week",
    "description": "U.S. Commerce Secretary Howard Lutnick said Monday that an announcement regarding a recent trade deal with Japan will be made &quot;later this week.&quot; Without elaborating, Lutnick touched on the plan during an interview with Fox News while speaking about …",
    "link": "https://japantoday.com/category/politics/update1-lutnick-says-announcement-on-japan-trade-deal-to-be-made-this-week",
    "timestamp": "2025-08-26T07:33:37Z"
  },
  {
    "title": "India Refiners to Curb Russian Buys",
    "description": "Refiners in India are planning to trim their purchases in the coming weeks, a modest concession to Washington's hawks less than a day ahead of a hike in US tariffs.",
    "link": "https://www.rigzone.com/news/wire/india_refiners_to_curb_russian_buys-26-aug-2025-181580-article/",
    "timestamp": "2025-08-26T07:31:54Z"
  },
  {
    "title": "Botswana declares public health emergency over medicine shortage",
    "description": "The crisis is linked to the high price of medicines, a shrinking national budget and cuts in US aid.",
    "link": "https://www.aljazeera.com/news/2025/8/26/botswana-declares-public-health-emergency-over-medicine-shortage",
    "timestamp": "2025-08-26T07:31:47Z"
  },
  {
    "title": "Trump Accused of 'Totalitarian Approach' After Threats to ABC, NBC",
    "description": "The president suggested two major news networks could have their broadcast licenses revoked over their coverage of him.",
    "link": "https://www.newsweek.com/trump-accused-totalitarian-approach-after-threats-abc-nbc-2119190",
    "timestamp": "2025-08-26T07:29:01Z"
  },
  {
    "title": "Mass evacuations in eastern Pakistan as India releases water from swollen rivers",
    "description": "Pakistan has evacuated tens of thousands of people to safer areas after neighboring India released water from overflowing dams and swollen rivers into low...",
    "link": "https://www.yahoo.com/news/articles/mass-evacuations-eastern-pakistan-india-072527266.html",
    "timestamp": "2025-08-26T07:25:27Z"
  },
  {
    "title": "Trump moves to fire Fed governor on mortgage fraud claims",
    "description": "US President Donald Trump continued to increase pressure on the Federal Reserve yesterday by moving to fire Governor Lisa Cook \"effective immediately\", a step the independent central bank official said he had \"no authority\" to take.",
    "link": "https://www.rte.ie/news/business/2025/0826/1530179-trump-moves-to-fire-a-fed-governor/",
    "timestamp": "2025-08-26T07:25:01Z"
  },
  {
    "title": "Trump Issues New Tariff Threat Over Digital Taxes",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has threatened to impose additional tariffs on countries that impose \"discriminatory\" digital taxes and regulatory requirements on U.S. tech companies.\nWhy It Matters\nThe issue of digita…",
    "link": "https://biztoc.com/x/1a0e6516bbab5aab",
    "timestamp": "2025-08-26T07:23:18Z"
  },
  {
    "title": "Trump threatens tariffs on countries that ‘discriminate’ against US tech",
    "description": "President’s move could hit UK’s digital services tax and measures in EU states such as France, Italy and Spain\nBusiness live – latest updates\nDonald Trump has threatened to impose tariffs and export restrictions on countries whose taxes, legislation and regul…",
    "link": "https://biztoc.com/x/941f62993187dec4",
    "timestamp": "2025-08-26T07:23:16Z"
  }
]