[
  {
    "title": "Harvard President Takes Serious Swipe At Trump Without Saying His Name At Commencement",
    "description": "Alan Garber got a massive ovation from thousands of graduates in attendance and reportedly upset the White House in the process.",
    "link": "https://www.huffpost.com/entry/harvard-university-president-alan-garber-trump-2025-commencement-speech_n_6839245ce4b018224f89d2a6",
    "timestamp": "2025-05-30T04:47:37Z"
  },
  {
    "title": "Republicans plan to tax US college endowments: Who will that hurt?",
    "description": "Republicans say their new bill holds 'woke' universities and tax-exempt entities accountable.",
    "link": "https://www.aljazeera.com/news/2025/5/30/republicans-plan-to-tax-us-college-endowments-who-will-that-hurt",
    "timestamp": "2025-05-30T04:45:28Z"
  },
  {
    "title": "The bond vigilantes are on the prowl",
    "description": "In a number of key markets, investors are losing patience with governments still wanting to borrow like there’s no tomorrow",
    "link": "https://www.irishtimes.com/business/economy/2025/05/30/the-bond-vigilantes-are-on-the-prowl/",
    "timestamp": "2025-05-30T04:45:00Z"
  },
  {
    "title": "A bad wrap: An angry Trump blasts the 'TACO Theory'",
    "description": "WASHINGTON - President Donald Trump made no pretense at hiding his irritation this week when he was asked by a reporter about \"TACO\" -- an acronym that has been gaining traction among Wall Street traders who believe that \"Trump Always Chickens Out.\"",
    "link": "https://www.bangkokpost.com/world/3038117/a-bad-wrap-an-angry-trump-blasts-the-taco-theory",
    "timestamp": "2025-05-30T04:45:00Z"
  },
  {
    "title": "Trump administration’s MAHA report on children’s health filled with flawed references, including some studies that don’t exist",
    "description": "By Brenda Goodman, Jacqueline Howard, Betsy Klein, CNN (CNN) — The first report from the Trump administration’s Make America Healthy Again",
    "link": "https://krdo.com/news/2025/05/29/trump-administrations-maha-report-on-childrens-health-filled-with-flawed-references-including-some-studies-that-dont-exist/",
    "timestamp": "2025-05-30T04:42:19Z"
  },
  {
    "title": "Performers and opera lovers see 'The Central Park Five' as a show of resistance against Trump",
    "description": "As Detroit Opera officials made plans last fall to bring a production based on the Central Park Five to their 2025 lineup, then-presidential candidate Donald Trump loomed large and just off stage",
    "link": "https://abcnews.go.com/US/wireStory/performers-opera-lovers-central-park-show-resistance-trump-122334523",
    "timestamp": "2025-05-30T04:38:28Z"
  },
  {
    "title": "Jonathan Turley Says Trump Has Authority To Slap Tariffs On World",
    "description": "Jonathan Turley said Thursday on \"The Ingraham Angle\" that President Donald Trump has the authority to hit other countries with reciprocal tariffs.",
    "link": "https://dailycaller.com/2025/05/30/jonathan-turley-donald-trump-tariffs-fox-news/",
    "timestamp": "2025-05-30T04:34:51Z"
  },
  {
    "title": "FBI probes strange texts asking for cash, pardon advice from person impersonating White House chief of staff Susie Wiles: report",
    "description": "The imposter has reportedly fired off text messages and placed phone calls to Republican lawmakers, governors and business executives in recent weeks pretending to be Wiles, the WSJ reported.",
    "link": "https://nypost.com/2025/05/30/us-news/fbi-probes-texts-impersonating-white-house-chief-of-staff-susie-wiles/",
    "timestamp": "2025-05-30T04:34:49Z"
  },
  {
    "title": "Trump Admin Moves to Create ‘Remigration’ Office to Supercharge Deportations",
    "description": "As part of the president's immigration agenda, the State Department detailed plans to \"facilitate the voluntary return of migrants to their country of origin\"",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-remigration-office-immigration-deportations-1235350960/",
    "timestamp": "2025-05-30T04:33:13Z"
  },
  {
    "title": "Bernard Kerik, NYPD Commissioner during 9/11, dies at 69; all about him",
    "description": "Bernard Kerik, the former New York City Police Commissioner who led the department during the 9/11 attacks, has died at 69. Once a high-profile figure in US law enforcement, Kerik's career collapsed following federal convictions for tax fraud and corruption. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/bernard-kerik-nypd-commissioner-during-9/11-dies-at-69-all-about-him/articleshow/121506033.cms",
    "timestamp": "2025-05-30T04:33:02Z"
  },
  {
    "title": "Hyperliquid whale losses near $100M after Bitcoin dips below $105K",
    "description": "Hyperliquid trader James Wynn has seen his 949 Bitcoin long positions liquidated after the cryptocurrency dipped below $105,000.",
    "link": "https://cointelegraph.com/news/hyperliquid-whale-loss-100-million-bitcoin-dips-below-105",
    "timestamp": "2025-05-30T04:31:10Z"
  },
  {
    "title": "PM Modi should tell nation how many Rafales were shot down by Pakistan: Revanth Reddy",
    "description": "Telangana Chief Minister A Revanth Reddy launched a strong attack on Prime Minister Narendra Modi, demanding answers about the Rafale aircraft allegedly shot down by Pakistan during a recent conflict. Reddy questioned why Modi didn't convene an all-party meet…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/pm-modi-should-tell-nation-how-many-rafales-were-shot-down-by-pakistan-revanth-reddy/articleshow/121505993.cms",
    "timestamp": "2025-05-30T04:30:25Z"
  },
  {
    "title": "US Treasury Secretary says trade talks with China 'stalled'",
    "description": "Trade negotiations between the US and China have stalled, according to US Treasury Secretary Scott Bessent. He suggested that President Trump and President Xi Jinping might get involved to move the discussions forward. Both countries agreed to pause reciproca…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-treasury-secretary-says-trade-talks-with-china-stalled/articleshow/121505927.cms",
    "timestamp": "2025-05-30T04:27:11Z"
  },
  {
    "title": "US proposes 60-day ceasefire for Gaza, plan shows",
    "description": "A US plan for Gaza seen by Reuters on Friday (May 30), proposes a 60-day ceasefire and the release of 28 Israeli hostages, alive and dead, in the first week and the release of 125 Palestinian prisoners sentenced to life and the remains of 180 dead Palestinian…",
    "link": "https://www.channelnewsasia.com/world/us-proposes-60-day-ceasefire-gaza-israel-war-5159726",
    "timestamp": "2025-05-30T04:19:43Z"
  },
  {
    "title": "Airline chiefs meet in India amid turbulence of Trump",
    "description": "Airline bosses meet from Sunday in New Delhi at their annual industry conference, battling to mitigate the impact of Donald Trump’s policies that have hit travel to the United States and potentially raised costs for aviation. Trump’s bid to impose tariffs on …",
    "link": "https://www.digitaljournal.com/world/airline-chiefs-meet-in-india-amid-turbulence-of-trump/article",
    "timestamp": "2025-05-30T04:17:20Z"
  },
  {
    "title": "Germany mulls 10% tax on tech giants like Google, Facebook",
    "description": "The proposal comes as Chancellor Friedrich Merz is expected to travel to Washington soon to meet with US President Donald Trump",
    "link": "https://www.thehindubusinessline.com/info-tech/germany-mulls-10-tax-on-tech-giants-like-google-facebook/article69636413.ece",
    "timestamp": "2025-05-30T04:15:42Z"
  },
  {
    "title": "Is Trump’s Axis of the Plutocrats Marginalizing Israel?",
    "description": "( Tomdispatch.com ) - Colorful career criminal Willie Sutton once may (or may not) have been asked why he robbed banks. “Because that is where the money is,” he supposedly replied. A similar principle may explain the first foreign trip of President Donald J. …",
    "link": "https://www.juancole.com/2025/05/trumps-plutocrats-marginalizing.html",
    "timestamp": "2025-05-30T04:15:25Z"
  },
  {
    "title": "Airline Chiefs Meet In India Amid Turbulence Of Trump",
    "description": "Airline bosses meet from Sunday in New Delhi at their annual industry conference, battling to mitigate the impact of Donald Trump's policies that have hit travel to the United States and potentially raised costs for aviation.",
    "link": "https://www.ibtimes.com/airline-chiefs-meet-india-amid-turbulence-trump-3774908",
    "timestamp": "2025-05-30T04:15:19Z"
  },
  {
    "title": "Trump aims to exceed first term's weapons sales to Taiwan: Reuters",
    "description": "The U.S. plans to sell more weapons to Taipei, exceeding President Trump's first term as China intensifies military pressure, according to U.S. officials.",
    "link": "https://www.cnbc.com/2025/05/30/trump-aims-to-exceed-first-terms-weapons-sales-to-taiwan-reuters-.html",
    "timestamp": "2025-05-30T04:13:53Z"
  },
  {
    "title": "The Take: Who could be Poland’s next president?",
    "description": "Poland, the next political battleground in Europe, is choosing between a Trump-backed candidate and a pro-EU challenger.",
    "link": "https://www.aljazeera.com/podcasts/2025/5/30/the-take-who-could-be-polands-next-president",
    "timestamp": "2025-05-30T04:10:00Z"
  },
  {
    "title": "American doctors look to relocate to Canada to avoid the Trump administration",
    "description": "Earlier this year, as President Donald Trump was beginning to reshape the American government, Michael, an emergency room doctor who was born, raised, and trained in the United States, packed up his family and left the country. Michael now works in a small-to…",
    "link": "https://freerepublic.com/focus/f-news/4319912/posts",
    "timestamp": "2025-05-30T04:08:18Z"
  },
  {
    "title": "Trump holding Pennsylvania rally to promote deal for Japan-based Nippon to 'partner' with US Steel",
    "description": "Donald Trump plans a rally in Pennsylvania to celebrate Nippon Steel's investment in US Steel. The deal aims to keep the iconic American steelmaker under US control. Details are still emerging, but it involves Nippon buying US Steel and investing billions in …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-holding-pennsylvania-rally-to-promote-deal-for-japan-based-nippon-to-partner-with-us-steel/articleshow/121505579.cms",
    "timestamp": "2025-05-30T04:07:53Z"
  },
  {
    "title": "Macron will kick off Singapore security conference with Hegseth in attendance",
    "description": "French President Emmanuel Macron and U.S. Defense Secretary Pete Hegseth are among world leaders, diplomats and top defense officials in Singapore this weekend for a security forum that comes amid concerns about China’s growing assertiveness, the globa...",
    "link": "https://abcnews.go.com/International/wireStory/macron-kick-off-singapore-security-conference-hegseth-attendance-122332326",
    "timestamp": "2025-05-30T04:06:19Z"
  },
  {
    "title": "What's in a name? A small fortune for businesses around Fort Bragg",
    "description": "When it came to a picking a name for his business, Ralph Rodriguez rolled the dice.  “That’s signage, uniforms, stationery, business cards, advertising, and ...",
    "link": "https://www.yahoo.com/news/whats-name-small-fortune-businesses-040435690.html",
    "timestamp": "2025-05-30T04:04:35Z"
  },
  {
    "title": "News Summary-Intelligence Report 5/29/2025*Newsdump Thursday*US Appeals Court Rules For Trump Tariffs*Netnayahu Says He Will \"Move Forward\" On US-Gaza Plan*Israel's Opposition Calls For Support Of Latest US Gaza...*New Anti-China Chip Measures*",
    "description": "\"The President of the United States must be allowed to protect America against those who are it Economic and Financial harm\"...President Trump... Tonight, Israel ordering a mass evacuation in northern Gaza... The FBI arresting a Defense Intelligence Agency em…",
    "link": "https://freerepublic.com/focus/f-bloggers/4319911/posts",
    "timestamp": "2025-05-30T04:03:06Z"
  },
  {
    "title": "After Trump, Shinzo Abe’s widow meets Putin",
    "description": "Russian leader Vladimir Putin hosted the widow of assassinated former Japanese prime minister Shinzo Abe, the Kremlin said, five months after then US president-elect Donald Trump welcomed her at Mar-a-Lago. Akie Abe was not in Russia in an official capacity, …",
    "link": "https://www.digitaljournal.com/world/after-trump-shinzo-abes-widow-meets-putin/article",
    "timestamp": "2025-05-30T04:02:20Z"
  },
  {
    "title": "Did Smoot-Hawley Cause the Great Depression?",
    "description": "Americans are taught in school that the Smoot-Hawley tariff legislation of 1930 greatly exacerbated the Great Depression and sent the world spinning off into a decade of debt deflation and economic contraction. This seems to make sense until we remember that …",
    "link": "https://www.lewrockwell.com/2025/05/no_author/did-smoot-hawley-cause-the-great-depression/",
    "timestamp": "2025-05-30T04:01:00Z"
  },
  {
    "title": "How Donald Trump Discovers the Art of Political Negotiation",
    "description": "We don’t understand the negotiations in Ukraine and the Middle East because we don’t understand the difference between wars and civil conflicts. We approach peacemaking as if it were a matter of dividing up common property during a divorce, after a few years …",
    "link": "https://www.lewrockwell.com/2025/05/thierry-meyssan/how-donald-trump-discovers-the-art-of-political-negotiation/",
    "timestamp": "2025-05-30T04:01:00Z"
  },
  {
    "title": "Is Trump’s attack on the Federalist Society and an individual within the society righteous?",
    "description": "Yesterday evening, Donald Trump launched an attack on the Federalist Society, long viewed as a bastion of conservative thought within the legal community. He also explicitly called out a man named Leonard Leo, someone most people have never heard of....",
    "link": "https://www.americanthinker.com/blog/2025/05/is_trump_s_attack_on_the_federalist_society_and_an_individual_within_the_society_righteous.html",
    "timestamp": "2025-05-30T04:00:00Z"
  },
  {
    "title": "Court rulings jolt Trump trade talks",
    "description": "Court decisions striking down President Donald Trump’s tariffs on dozens of countries have reduced pressure to ‘cave in’ to his demands, said one official.",
    "link": "https://www.politico.eu/article/court-rulings-jolt-trump-trade-talks/",
    "timestamp": "2025-05-30T04:00:00Z"
  },
  {
    "title": "When Jeb and Hillary Saved the Republic",
    "description": "There was a moment in the late spring of 2015 when I realized that the ground beneath our feet was shifting.  During an appearance on Fox News, Charles Krauthammer was asked to predict the Republican and Democrat nominees for the 2016 election.&...",
    "link": "https://www.americanthinker.com/articles/2025/05/when_jeb_and_hillary_saved_the_republic.html",
    "timestamp": "2025-05-30T04:00:00Z"
  },
  {
    "title": "Hitchhiker’s Guide to the Tax Code",
    "description": "Donald Trump’s “One Big Beautiful Bill” is making its way through Congress. What sounds like it was pulled from a kindergarten politics workshop might just mark the return of the United States as the true",
    "link": "https://www.americanthinker.com/articles/2025/05/hitchhiker_s_guide_to_the_tax_code.html",
    "timestamp": "2025-05-30T04:00:00Z"
  },
  {
    "title": "IT guy at Defense Intelligence Agency gets nabbed after offering to sell classified secrets to foreign actors because he doesn’t like Trump",
    "description": "We’re being held hostage by emotional terrorists, turned literal terrorists.\r\n\r\nAccording to a report at Fox News, a young IT professional working at the Defense Intelligence Agency who held a top secret clearance, was recently nabbed by law en...",
    "link": "https://www.americanthinker.com/blog/2025/05/it_guy_at_defense_intelligence_agency_gets_nabbed_after_offering_to_sell_classified_secrets_to_foreign_actors_because_he_doesn_t_like_trump.html",
    "timestamp": "2025-05-30T04:00:00Z"
  },
  {
    "title": "U.S.-China trade talks ‘stalled,’ may require direct talks between Trump and Xi, Bessent says",
    "description": "Trade talks between the U.S. and China are “a bit stalled,” Treasury Secretary Scott Bessent said Thursday, adding that a breakthrough will likely hinge on President Donald Trump and Chinese President Xi Jinping speaking directly.",
    "link": "https://biztoc.com/x/8452bd1dea4584d4",
    "timestamp": "2025-05-30T03:55:39Z"
  },
  {
    "title": "Japan’s top LNG buyer inks preliminary pact with Alaska project",
    "description": "Jera, which is also the nation’s largest power producer, inked the nonbinding pact ahead of a summit in the U.S. state next week.",
    "link": "https://www.japantimes.co.jp/business/2025/05/30/companies/jera-alaska-gas-project-preliminary-pact/",
    "timestamp": "2025-05-30T03:55:00Z"
  },
  {
    "title": "UK police could search period apps, homes after stillbirths reported to be abortions",
    "description": "A leading UK police body has advised investigators to search apps and homes if they believe a stillbirth was the result of a terminated pregnancy outside of legally permitted circumstances.",
    "link": "https://www.abc.net.au/news/2025-05-30/npcc-guidelines-on-stillbirths-abortions-draws-controversy/105332518",
    "timestamp": "2025-05-30T03:50:16Z"
  },
  {
    "title": "North Korea’s Surging Military Aid to Russia Detailed in Report",
    "description": "North Korea has become a crucial source of missiles, munitions and even soldiers for Russia’s war in Ukraine as the sanctions-defying alliance between the two countries intensifies, according to a report by 11 countries, including the US and Japan.",
    "link": "https://financialpost.com/pmn/business-pmn/north-koreas-surging-military-aid-to-russia-detailed-in-report",
    "timestamp": "2025-05-30T03:49:33Z"
  },
  {
    "title": "U.S. soft power is a casualty in Trump’s war on Harvard",
    "description": "The fight against Harvard will do extensive and potentially irreparable injury. It is an extraordinary act of self-harm.",
    "link": "https://www.japantimes.co.jp/editorials/2025/05/30/trump-declares-war-harvard/",
    "timestamp": "2025-05-30T03:48:00Z"
  },
  {
    "title": "Savannah Chrisley Shares 1st Photos of Dad Todd After Prison Release",
    "description": "Savannah Chrisley has shared new photos of her father Todd Chrisley after he was released from prison along with her mother Julie Chrisley this week. Taking to social media, Savannah, 27, posted several selfies alongside her dad via an Instagram Reel on Thurs…",
    "link": "https://www.usmagazine.com/celebrity-news/news/savannah-chrisley-shares-first-photos-of-todd-after-prison-release/#article",
    "timestamp": "2025-05-30T03:41:35Z"
  },
  {
    "title": "트럼프의 미국 경제 3년 만에 역성장",
    "description": "President Trump promised to lower housing costs for families.But thanks to his economic chaos, mortgage rates are now topping 7%—pushing up the cost of housing development and homeownership for millions of families. https://t.co/ChJZoTYAFH— Senate Banking and…",
    "link": "https://ryueyes11.tistory.com/511655",
    "timestamp": "2025-05-30T03:41:20Z"
  },
  {
    "title": "Japan’s Top LNG Buyer Inks Preliminary Pact With Alaska Project",
    "description": "Japan’s largest liquefied natural gas importer, JERA Co., signed an expression of interest to explore buying the fuel from a long-delayed export project in Alaska, according to people with knowledge of the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/japans-top-lng-buyer-inks-preliminary-pact-with-alaska-project",
    "timestamp": "2025-05-30T03:39:29Z"
  },
  {
    "title": "Musk says 50-50 chance of sending uncrewed Starship to Mars by late 2026",
    "description": "The billionaire's Mars mission claim comes despite SpaceX experiencing several failed test launches over recent months.",
    "link": "https://www.aljazeera.com/news/2025/5/30/musk-says-50-50-chance-of-sending-uncrewed-starship-to-mars-by-late-2026",
    "timestamp": "2025-05-30T03:30:35Z"
  },
  {
    "title": "Fastex Expands U.S. Presence With Los Angeles Office",
    "description": "In an interview with CoinDesk, Fastex’s chief legal officer said that the crypto regulatory shift under President Donald Trump has made it possible for the exchange to expand in the U.S.",
    "link": "https://www.coindesk.com/policy/2025/05/29/fastex-expands-u-s-presence-with-los-angeles-office",
    "timestamp": "2025-05-30T03:21:23Z"
  },
  {
    "title": "Defense Intelligence Agency Employee Charged With Trying To Send Classified Data To Foreign Government",
    "description": "FBI officials arrested a DIA employee for allegedly attempting to transmit national defense information to an officer or agent of a foreign government.",
    "link": "https://dailycaller.com/2025/05/29/defense-intelligence-agency-employee-aressted-charged-fbi/",
    "timestamp": "2025-05-30T03:21:16Z"
  },
  {
    "title": "High-yielding bonds in EM may beat peers as treasuries decline",
    "description": "Bloomberg's analysis suggests that riskier emerging-market bonds, particularly from India, Indonesia, Brazil, and South Africa, are outperforming due to the dollar's decline offsetting rising Treasury yields. Goldman Sachs strategists note that a weaker dolla…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/high-yielding-bonds-in-em-may-beat-peers-as-treasuries-decline/articleshow/121504298.cms",
    "timestamp": "2025-05-30T03:16:56Z"
  },
  {
    "title": "RFK Jr.’s MAHA Report Cites Studies That Don’t Seem To Exist, Misinterprets Others",
    "description": "We recently talked about Donald Trumps foray into medicine when he declared, sans any actual evidence of course, that autism cannot possibly be caused by anything other than some external source. It was an admittedly odd stance to take for someone who seems t…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177861517",
    "timestamp": "2025-05-30T03:15:27Z"
  },
  {
    "title": "Exclusive: Trump aims to exceed first term's weapons sales to Taiwan, officials say (Reuters)",
    "description": "Reuters:\nExclusive: Trump aims to exceed first term's weapons sales to Taiwan, officials say  —  The United States plans to ramp up weapons sales to Taipei to a level exceeding President Donald Trump's first term as part of an effort to deter China as it inte…",
    "link": "https://www.memeorandum.com/250529/p158",
    "timestamp": "2025-05-30T03:15:00Z"
  },
  {
    "title": "Donald Trump tells Jay Powell the Federal Reserve is making a ‘mistake’ by not cutting US interest rates",
    "description": "Donald Trump tells Jay Powell the Federal Reserve is making a ‘mistake’ by not cutting US interest rates\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade wa…",
    "link": "https://biztoc.com/x/514c04b1643814b4",
    "timestamp": "2025-05-30T03:10:51Z"
  },
  {
    "title": "RFK Jr.’s MAHA Report Cites Studies That Don’t Seem To Exist, Misinterprets Others",
    "description": "We recently talked about Donald Trump’s foray into medicine when he declared, sans any actual evidence of course, that autism cannot possibly be caused by anything other than some external source. It was an admittedly odd stance to take for someone who seems …",
    "link": "https://www.techdirt.com/2025/05/29/rfk-jr-s-maha-report-cites-studies-that-dont-seem-to-exist-misinterprets-others/",
    "timestamp": "2025-05-30T03:05:47Z"
  },
  {
    "title": "Trump goes after Leonard Leo and the Federalist Society in fury over court ruling (Politico)",
    "description": "Politico:\nTrump goes after Leonard Leo and the Federalist Society in fury over court ruling  —  Trump's attack came after the U.S. Court of International Trade struck down his tariffs, a blow to the primary pillar of his economic agenda.  —  President Donald …",
    "link": "https://www.memeorandum.com/250529/p156",
    "timestamp": "2025-05-30T03:05:01Z"
  },
  {
    "title": "Asian markets reverse as appeals court gives Trump tariffs reprieve",
    "description": "HONG KONG: Asian shares fell Friday (May 30) after a US appeal court gave Donald Trump's sweeping tariffs a temporary reprieve, fanning uncertainty a day after judges had ruled the controversial measures were unconstitutional. The losses reversed a rally acro…",
    "link": "https://www.channelnewsasia.com/business/asian-markets-reverse-appeals-court-gives-trump-tariffs-reprieve-5159696",
    "timestamp": "2025-05-30T03:05:00Z"
  },
  {
    "title": "Trouble in Trumpland: From Gaza and Iran to a court date, dark clouds hover over Netanyahu",
    "description": "On every possible front, the Americans make have made it clear to Netanyahu that they have had enough of his foot-dragging ■ According to our prime minister, Israel recorded zero achievement from the War of Independence to the Six-Day War ■ The opposition has…",
    "link": "https://www.haaretz.com/israel-news/2025-05-30/ty-article/.premium/trouble-in-trumpland-from-gaza-and-iran-to-a-court-date-dark-clouds-hover-over-netanyahu/00000197-1d3f-d57f-a7d7-3fff4f550000",
    "timestamp": "2025-05-30T03:02:03Z"
  },
  {
    "title": "Without Elon Musk, DOGE likely to fizzle out, says ex-staffer",
    "description": "DOGE has overseen job cuts at nearly every federal agency as part of U.S. President Donald Trump's attempts to shake up the federal bureaucracy.However, software engineer Sahil Lavingia, who spent almost two months working for the group of pro-Musk technologi…",
    "link": "https://economictimes.indiatimes.com/tech/technology/without-elon-musk-doge-likely-to-fizzle-out-says-ex-staffer/articleshow/121503400.cms",
    "timestamp": "2025-05-30T03:01:40Z"
  },
  {
    "title": "Bessent says U.S.-China talks ‘stalled,’ pushes for Trump-Xi call",
    "description": "U.S. Treasury Secretary Scott Bessent said trade talks with China are “a bit stalled,” and that a call between President Donald Trump and his counterpart Xi Jinping may be needed for the world’s two largest economies to reach a deal.\n“I would say that they ar…",
    "link": "https://biztoc.com/x/563340bb918ed88c",
    "timestamp": "2025-05-30T03:00:08Z"
  },
  {
    "title": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon",
    "description": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon\nSince returning to power, US President Donald Trump has wielded tariffs – or the threat of them - as his economic weapon of choice.\nHe has slapped import duties against allies …",
    "link": "https://biztoc.com/x/55bfb64da05a9e95",
    "timestamp": "2025-05-30T02:59:55Z"
  },
  {
    "title": "'I left one conflict zone to enter another': Harvard's Jewish foreign students on Trump row",
    "description": "The BBC's Nomia Iqbal meets foreign Jewish students at Harvard left scared and uncertain after Trump's threats against the university.",
    "link": "https://www.bbc.com/news/articles/ckg4908n834o",
    "timestamp": "2025-05-30T02:59:19Z"
  },
  {
    "title": "Trump Turns on Conservative Group’s ‘Sleazebag’ Leader Who Recommended Judges: ‘Probably Hates America’",
    "description": "President Donald Trump laid into the conservative Federalist Society and its \"sleazebag\" chairman of the board Leonard Leo, accusing him of \"hating America.\"\nThe post Trump Turns on Conservative Group’s ‘Sleazebag’ Leader Who Recommended Judges: ‘Probably Hat…",
    "link": "https://www.mediaite.com/politics/trump-turns-on-conservative-groups-sleazebag-leader-who-recommended-judges-probably-hates-america/",
    "timestamp": "2025-05-30T02:56:16Z"
  },
  {
    "title": "Average Ethereum ETF investor ‘substantially underwater’ — Glassnode",
    "description": "Glassnode says investors in BlackRock and Fidelity’s spot Ether ETFs are “substantially underwater” as the asset’s has failed to rally alongside Bitcoin.",
    "link": "https://cointelegraph.com/news/ethereum-etf-investors-substantially-underwater-glassnode",
    "timestamp": "2025-05-30T02:55:27Z"
  },
  {
    "title": "Peter Doocy Asks Why Trump Doesn’t Just Ask Congress ‘To Make a New Law’ After Spate of Court Losses",
    "description": "Fox News Senior White House Correspondent Peter Doocy asked the White House press secretary why President Donald Trump does not simply ask Congress to pass bills that would obviate unfavorable court rulings. \nThe post Peter Doocy Asks Why Trump Doesn’t Just A…",
    "link": "https://www.mediaite.com/media/tv/peter-doocy-asks-why-trump-doesnt-just-ask-congress-to-make-a-new-law-after-spate-of-court-losses/",
    "timestamp": "2025-05-30T02:53:27Z"
  },
  {
    "title": "Asian Markets Reverse As Appeals Court Gives Trump Tariffs Reprieve",
    "description": "Asian shares fell Friday after a US appeal court gave Donald Trump's sweeping tariffs a temporary reprieve, fanning uncertainty a day after judges had ruled the controversial measures were unconstitutional.",
    "link": "https://www.ibtimes.com/asian-markets-reverse-appeals-court-gives-trump-tariffs-reprieve-3774904",
    "timestamp": "2025-05-30T02:51:15Z"
  },
  {
    "title": "Pressure mounts on a reluctant Trump to impose sanctions on Russia",
    "description": "Trump has held off on such penalties for months, believing he could have fruitful dealings with Putin to end the war.",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/world/politics/trump-russia-sanction-pressure-mounts/",
    "timestamp": "2025-05-30T02:51:00Z"
  },
  {
    "title": "Bessent: Trade Talks with China 'a Bit Stalled', 'Close' on a Couple 'Very Large Deals'",
    "description": "On Thursday’s broadcast of the Fox News Channel’s “Special Report,” Treasury Secretary Scott Bessent said that there are a couple of “very large” trade deals that “are close” but talks with China “are a bit stalled.” And will require direct\nThe post Bessent: …",
    "link": "https://www.breitbart.com/clips/2025/05/29/bessent-trade-talks-with-china-a-bit-stalled-close-on-a-couple-very-large-deals/",
    "timestamp": "2025-05-30T02:50:53Z"
  },
  {
    "title": "Chris Hayes Runs Down Why Elon Musk’s Trump Tenure Was an ‘Abject Failure’: ‘No One Likes the Guy’ | Video",
    "description": "\"He convinced himself, because he's worth a lot of money, that everyone loves him,\" the MSNBC host says, but \"they would really much rather he just go away\"\nThe post Chris Hayes Runs Down Why Elon Musk’s Trump Tenure Was an ‘Abject Failure’: ‘No One Likes the…",
    "link": "https://www.thewrap.com/chris-hayes-elon-musk-trump-doge-abject-failure-msnbc/",
    "timestamp": "2025-05-30T02:50:15Z"
  },
  {
    "title": "The US dollar's dominance is unwinding in #Asia #stocks #business #shorts",
    "description": "As Donald Trump tries to remake global trade, the dollar's historic dominance in Asia is unwinding. Find out what's driving Asia's ...",
    "link": "https://biztoc.com/x/cbdf8d6b6b5b9327",
    "timestamp": "2025-05-30T02:49:48Z"
  },
  {
    "title": "Jamie Raskin Wants Trump To Disclose His Crypto Dinner Guest List, Says Foreigners Can't Donate Dollar But Are Buying Access To President Through Memecoin",
    "description": "A leading Democratic lawmaker launched a probe Thursday into the private dinner held by President Donald Trump for top investors in his Official Trump (CRYPTO: TRUMP)\nWhat Happened: Rep. Jamie Raskin (D-Md.), Ranking Member of the House Judiciary Committee, s…",
    "link": "https://biztoc.com/x/827ff1f86c1418f1",
    "timestamp": "2025-05-30T02:48:51Z"
  },
  {
    "title": "Cambodia PM urges 'industrial recalibrations' under Trump tariff pressure",
    "description": "TOKYO -- Cambodian Prime Minister Hun Manet said his country's businesses and communities must pursue \"industrial recalibrations\" as the economy comes under pressure from U.S. President Donald Trump's trade policy.\nHun Manet delivered a keynote address to Nik…",
    "link": "https://biztoc.com/x/a339bf418c652643",
    "timestamp": "2025-05-30T02:48:50Z"
  },
  {
    "title": "Asian markets reverse as appeals court gives Trump tariffs reprieve",
    "description": "Asian shares fell Friday after a US appeal court gave Donald Trump’s sweeping tariffs a temporary reprieve, fanning uncertainty a day after judges had ruled the controversial measures were unconstitutional. The losses reversed a rally across world markets the…",
    "link": "https://www.digitaljournal.com/world/asian-markets-reverse-as-appeals-court-gives-trump-tariffs-reprieve/article",
    "timestamp": "2025-05-30T02:47:32Z"
  },
  {
    "title": "Trump Slams Leonard Leo and Federalist Society",
    "description": "“President Donald Trump leveled unusually pointed criticism of a prominent conservative legal activist and organization Thursday as he railed against a ruling that struck down his sweeping tariffs,” Politico reports. “The president, in a post",
    "link": "https://politicalwire.com/2025/05/29/trump-slams-leonard-leo-and-federalist-society/",
    "timestamp": "2025-05-30T02:42:01Z"
  },
  {
    "title": "Hubris, denial and deceit",
    "description": "There comes a point when we all need to reckon with the changes that come to all of us as we age. Sometimes hubris and denial work against us. Deceit always catches up with us.",
    "link": "https://www.ncspin.com/hubris-denial-and-deceit",
    "timestamp": "2025-05-30T02:41:51Z"
  },
  {
    "title": "Bernard Kerik, New York Police Commissioner on 9/11, dies at 69",
    "description": "Bernard Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died.",
    "link": "https://www.nbcnews.com/news/us-news/bernard-kerik-new-york-police-commissioner-911-dies-69-rcna209887",
    "timestamp": "2025-05-30T02:41:14Z"
  },
  {
    "title": "‘Existential Crisis’: Victor Davis Hanson Predicts Why Chuck Schumer Will Go Down In Reelection",
    "description": "Victor Davis Hanson predicted Democrat Senate Minority Leader Chuck Schumer will be booted out of his Senate seat by Rep. Alexandria Ocasio-Cortez.",
    "link": "https://dailycaller.com/2025/05/29/victor-davis-hanson-prediction-chuck-schumer-senate-alexandria-ocasio-cortez-new-york/",
    "timestamp": "2025-05-30T02:40:08Z"
  },
  {
    "title": "SHOCK: Washington, DC Mayor Muriel Bowser Quietly Working to Reverse ‘Sanctuary City’ Policy",
    "description": "Did Washington, DC Mayor Muriel Bowser start taking common sense pills this year or something?\nThe post SHOCK: Washington, DC Mayor Muriel Bowser Quietly Working to Reverse ‘Sanctuary City’ Policy appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/shock-washington-dc-mayor-muriel-bowser-quietly-working/",
    "timestamp": "2025-05-30T02:40:05Z"
  },
  {
    "title": "Fox Host Hits Back At Trump Adviser's 'Rogue' Talk With Ice Cold Reality Check",
    "description": "Liz Claman wasn't having it with Peter Navarro as he tried to dismiss a court's ruling on the president's trade policy.",
    "link": "https://www.huffpost.com/entry/fox-business-liz-claman-trump-peter-navarro-judges-tariffs_n_6838f8f9e4b04cbc7110dcc8",
    "timestamp": "2025-05-30T02:39:22Z"
  },
  {
    "title": "Three Judges Blocking Trump's Tariffs Have Decades-Long Histories of Democrat Activism",
    "description": "The judges on the U.S. Court of International Trade who ruled that President Donald Trump's \"Liberation Day\" tariffs are illegal have a history of Democrat Party activism.\nThe post Three Judges Blocking Trump’s Tariffs Have Decades-Long Histories of Democrat …",
    "link": "https://www.breitbart.com/politics/2025/05/29/three-judges-blocking-trumps-tariffs-have-decades-long-histories-of-democrat-activism/",
    "timestamp": "2025-05-30T02:36:13Z"
  },
  {
    "title": "Tariffs court fight threatens Trump's power to wield his favourite economic weapon",
    "description": "Despite the legal mire, all signs point to this being a battle the Republican president won't give up easily.",
    "link": "https://www.bbc.com/news/articles/cvg788jrxrro",
    "timestamp": "2025-05-30T02:34:20Z"
  },
  {
    "title": "Thanks for the evidence",
    "description": "Trump's white supremacy leanings were never more evident than when the president of South Africa met with Trump in the White House.",
    "link": "https://www.ncspin.com/thanks-for-the-evidence",
    "timestamp": "2025-05-30T02:31:52Z"
  },
  {
    "title": "Trump’s tariffs: Turfed out but raring to return",
    "description": "The US Court of International Trade struck down America’s ‘reciprocal’ tariffs for exceeding the president’s authority. As the legal battle over their validity thickens, could the rule of law in the US come to the global economy’s rescue?",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-us-congress-ieepa-us-supreme-court-trade-barriers-us-court-of-international-trade-steel-tariffs-fentanyl-11748533411139.html",
    "timestamp": "2025-05-30T02:30:10Z"
  },
  {
    "title": "Ross Ulbricht Speaks at Bitcoin 2025: 'You Didn’t Forget Me'",
    "description": "Ulbricht called for unity in the crypto community saying its now more \"important than ever to stay true to our principles.\"",
    "link": "https://decrypt.co/322898/ross-ulbricht-speaks-at-bitcoin-2025-you-didnt-forget-me",
    "timestamp": "2025-05-30T02:27:16Z"
  },
  {
    "title": "Less TACO, more chaos theory: The only thing Trump can offer is a crash course in economic uncertainty",
    "description": "The US economic policymaking apparatus is systemically dysfunctional. And rivals stand ready to take full advantage of that fact.\nThe post Less TACO, more chaos theory: The only thing Trump can offer is a crash course in economic uncertainty appeared first on…",
    "link": "http://www.crikey.com.au/2025/05/30/donald-trump-tariffs-courts-economic-uncertainty/",
    "timestamp": "2025-05-30T02:25:43Z"
  },
  {
    "title": "Ben & Jerry's board accuses Israel of 'genocide' in Gaza, deepening Unilever feud",
    "description": "Ben & Jerry's independent board escalates its feud with parent company Unilever, issuing a statement denouncing the Gaza conflict as \"genocide.\"",
    "link": "https://www.israelnationalnews.com/news/409220",
    "timestamp": "2025-05-30T02:23:12Z"
  },
  {
    "title": "Elon exiled, tariffs turfed: Welcome to the MAGA meltdown",
    "description": "The second Trump administration is reverting to type as the pain of actually having to govern kicks in.\nThe post Elon exiled, tariffs turfed: Welcome to the MAGA meltdown appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/05/30/elon-musk-tariffs-donald-trump-usa-recap/",
    "timestamp": "2025-05-30T02:22:51Z"
  },
  {
    "title": "Trump's Lawyers Claim Kamala Harris' '60 Minutes' Interview Caused Him 'Mental Anguish'",
    "description": "The president reportedly turned down a $15 million settlement offer from CBS because he's seeking millions more and an apology.",
    "link": "https://www.huffpost.com/entry/trump-claim-kamala-harris-60-minutes-interview-mental-anguish_n_6838ebe1e4b09b466de9b66f",
    "timestamp": "2025-05-30T02:22:46Z"
  },
  {
    "title": "Bernie Kerik, who served as NYPD commissioner during 9/11 attacks, dies at 69",
    "description": "Bernie Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died",
    "link": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
    "timestamp": "2025-05-30T02:19:06Z"
  },
  {
    "title": "US-Chinese trade talks ‘stalled’ – Treasury Secretary",
    "description": "Presidents Trump and Xi may need to get personally involved to accelerate US-Chinese trade talks, Treasury Secretary Scott Bessent has said Read Full Article at RT.com",
    "link": "https://www.rt.com/business/618338-us-china-trade-talks-stalled/",
    "timestamp": "2025-05-30T02:18:54Z"
  },
  {
    "title": "Ex-NY Police Commissioner Bernie Kerik, Who Pleaded Guilty To Federal Tax Fraud, Has Died",
    "description": "Bernie Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died.",
    "link": "https://www.huffpost.com/entry/us-bernie-kerik-obit_n_68391443e4b03a503eaa4bb8",
    "timestamp": "2025-05-30T02:18:53Z"
  },
  {
    "title": "How Julie Chrisley Feels About Ditching Her Blonde Hair After Prison",
    "description": "Julie Chrisley has left prison a changed woman.\nA day after she and husband Todd Chrisley walked free thanks to presidential pardons from Donald Trump, the Chrisley Knows Best matriarch debuted a...",
    "link": "https://www.eonline.com/news/1418129/julie-chrisley-ditching-blonde-hair-for-good-after-prison",
    "timestamp": "2025-05-30T02:17:50Z"
  },
  {
    "title": "Heritage President Argues That America is Entering a ‘Golden Age’",
    "description": "Is America heading into a “golden age” in President Donald Trump’s second term? That was the question put up for discussion Thursday in a Munk... Read More\nThe post Heritage President Argues That America is Entering a ‘Golden Age’ appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/05/29/heritage-president-argues-that-america-is-entering-a-golden-age/",
    "timestamp": "2025-05-30T02:17:50Z"
  },
  {
    "title": "DOT Sec. Duffy Announces 'Great American Road Trip' to Stimulate Economy",
    "description": "WASHINGTON, DC — Transportation Secretary Sean Duffy announced his department's project to celebrate the United States' 250th birthday while also stimulating the economy — the Great American Road Trip.\nThe post DOT Sec. Duffy Announces ‘Great American Road Tr…",
    "link": "https://www.breitbart.com/economy/2025/05/29/dot-sec-duffy-announces-great-american-road-trip-to-stimulate-economy/",
    "timestamp": "2025-05-30T02:16:28Z"
  },
  {
    "title": "GM CEO Mary Barra backs Trump’s auto tariffs as a tool to help US manufacturers ‘level the playing field’",
    "description": "General Motors CEO Mary Barra is voicing support for the Trump administration’s automotive tariffs, arguing they allow U.S. automakers to compete more fairly in the international market.",
    "link": "https://nypost.com/2025/05/29/business/gm-ceo-mary-barra-backs-trumps-auto-tariffs-as-a-tool-to-help-us-manufacturers/",
    "timestamp": "2025-05-30T02:16:22Z"
  },
  {
    "title": "Trump's tariffs to remain in effect after appeals court grants stay",
    "description": "A federal appeals court temporarily reinstated the most sweeping of Trump's tariffs a day after a US trade court ruled that Trump had exceeded his authority in imposing the duties and ordered a block",
    "link": "https://www.jpost.com/international/article-856041",
    "timestamp": "2025-05-30T02:16:21Z"
  },
  {
    "title": "U.N. eyes budget and job cuts for 2026 as U.S. scales back aid",
    "description": "The U.N. Secretariat is preparing to cut its $3.7 billion budget by 20% and slash about 6,900 jobs, according to an internal memo.",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/world/un-job-cuts/",
    "timestamp": "2025-05-30T02:16:00Z"
  },
  {
    "title": "US SEC dismisses lawsuit against Binance crypto exchange",
    "description": "The SEC sued Binance and Zhao in June 2023, accusing the exchange of artificially inflating trading volumes, diverting customer funds and misleading investors about its surveillance controls. Binance was also accused of unlawfully facilitating trading of seve…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-sec-dismisses-lawsuit-against-binance-crypto-exchange/articleshow/121502060.cms",
    "timestamp": "2025-05-30T02:15:22Z"
  },
  {
    "title": "Trump's lost control of his tariff see-saw, making his aims even harder",
    "description": "Since Trump's \"Liberation Day\" tariffs were announced, they have been changing constantly. But does the escalating court battle to implement them give the president an off-ramp to soften his second-term trade agenda without facing political fallout?",
    "link": "https://www.abc.net.au/news/2025-05-30/donald-trump-tariff-trade-war-court-uncertainty/105356192",
    "timestamp": "2025-05-30T02:08:31Z"
  },
  {
    "title": "Dollar poised for fifth-straight monthly drop on trade, fiscal uncertainty",
    "description": "The U.S. dollar weakened, marking its fifth consecutive monthly drop. Trade and fiscal uncertainties loomed. Investors awaited a key inflation report. Trump's tariff policies added to market worries. Emerging market currencies gained. The Japanese yen rose af…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-poised-for-fifth-straight-monthly-drop-on-trade-fiscal-uncertainty/articleshow/121501980.cms",
    "timestamp": "2025-05-30T02:07:16Z"
  }
]