[
  {
    "title": "GOP lawmakers move to codify DOGE to block left's lawfare",
    "description": "A group of Republican lawmakers plans to introduce legislation that would codify President Donald Trump's executive order that established the Department of Government Efficiency.If passed, the legislation would help to block the DOGE from the left's lawfare …",
    "link": "https://www.theblaze.com/news/gop-lawmakers-move-to-codify-doge-to-block-left-s-lawfare",
    "timestamp": "2025-03-19T19:20:00Z"
  },
  {
    "title": "John Oliver jokes about Oregonians betting on table tennis",
    "description": "On \"Last Week Tonight,\" John Oliver poked fun at Oregonians' apparent love of betting on table tennis matches in a segment on the rise of sports betting apps.",
    "link": "https://www.oregonlive.com/entertainment/2025/03/watch-john-oliver-mocks-oregon-love-of-sports-betting-on-last-week-tonight.html",
    "timestamp": "2025-03-19T19:18:24Z"
  },
  {
    "title": "Fed keeps policy rate outlook intact amid projected growth slowdown, temporary inflation jump",
    "description": "WASHINGTON: The Federal Reserve held interest rates steady on Wednesday (Mar 19), as expected, but US central bank policymakers indicated they still anticipate reducing borrowing costs by half a percentage point by the end of this year in the context of slowi…",
    "link": "https://www.channelnewsasia.com/world/fed-keeps-policy-rate-outlook-intact-amid-projected-growth-slowdown-temporary-inflation-jump-5011661",
    "timestamp": "2025-03-19T19:18:00Z"
  },
  {
    "title": "Auto Show in Canada Boots Tesla Over Safety Concerns",
    "description": "Elon Musk told Fox News \"they basically want to kill me\" when discussing opposition to Tesla.",
    "link": "https://gizmodo.com/auto-show-in-canada-boots-tesla-over-safety-concerns-2000578218",
    "timestamp": "2025-03-19T19:15:54Z"
  },
  {
    "title": "Trump’s crypto Czar slams media for misrepresenting divestment as dump",
    "description": "White House AI and crypto advisor David Sacks criticized claims that he “dumped” his crypto holdings and clarified that, after being appointed by President Donald Trump, he was required to divest due to government ethics rules. In a March 19 social media post…",
    "link": "https://cryptoslate.com/trumps-crypto-czar-slams-media-for-misrepresenting-divestment-as-dump/",
    "timestamp": "2025-03-19T19:15:23Z"
  },
  {
    "title": "Trump Fires Democratic FTC Commissioners",
    "description": "President Donald Trump fired Democratic Federal Trade Commission (FTC) Commissioners Alvaro Bedoya and Rebecca Kelly Slaughter on Tuesday. In so doing,",
    "link": "https://reason.com/2025/03/19/trump-fires-democratic-ftc-commissioners/",
    "timestamp": "2025-03-19T19:15:18Z"
  },
  {
    "title": "The Conspiracy Theory That Says a Lot About How Much Trumpworld Has Changed",
    "description": "This time around, conspiracy theorists are all over the government.",
    "link": "https://slate.com/life/2025/03/what-is-autopen-trump-biden-signature-pardons.html",
    "timestamp": "2025-03-19T19:13:45Z"
  },
  {
    "title": "'Two rapists in the White House': TD tells Dáil McGregor's visit to Trump was an insult to women",
    "description": "The MMA figher visited the Oval Office with his family on St Patrick’s Day.",
    "link": "https://www.thejournal.ie/mcgregor-trump-two-rapists-6654042-Mar2025/",
    "timestamp": "2025-03-19T19:13:16Z"
  },
  {
    "title": "California’s wine industry leery of tariffs, but some growers hope they help",
    "description": "LODI, Calif. (AP) — Escalating trade tensions between the U.S. and Europe are being closely watched in California’s iconic wine industry, which is already struggling due to declining global wine consumption, rising costs and swings in weather. Many fear tarif…",
    "link": "https://financialpost.com/pmn/californias-wine-industry-leery-of-tariffs-but-some-growers-hope-they-help",
    "timestamp": "2025-03-19T19:12:25Z"
  },
  {
    "title": "First Solana Futures ETF To Hit Markets This Week",
    "description": "The products are a significant step forward for the approval of a spot Solana ETF.",
    "link": "https://www.coindesk.com/markets/2025/03/19/first-solana-futures-etf-to-hit-markets-this-week",
    "timestamp": "2025-03-19T19:12:04Z"
  },
  {
    "title": "'The cowardice!' Republican slammed for anonymous attack on Trump",
    "description": "President Donald Trump, SpaceX/Tesla/X.com leader Elon Musk and other MAGA Republicans are calling for federal judges who block the president's executive orders to be impeached. One of Trump's targets is U.S. District Judge James Boasberg, who temporarily blo…",
    "link": "https://www.rawstory.com/the-cowardice-republican-slammed-for-anonymous-on-trump/",
    "timestamp": "2025-03-19T19:11:33Z"
  },
  {
    "title": "Report: Judge bashing Trump’s military trans decision donated to Democrats",
    "description": "Even involved in litigation against president during his 1st term",
    "link": "https://www.wnd.com/2025/03/report-judge-bashing-trumps-military-trans-decision-donated-to-democrats/",
    "timestamp": "2025-03-19T19:10:58Z"
  },
  {
    "title": "Boeing Says It Doesn’t Expect Major Impact From Tariffs",
    "description": "Boeing’s chief financial officer said tariffs most likely won’t have a short-term impact on the supply chain or plane orders. \n -Meghna Maharishi",
    "link": "http://skift.com/2025/03/19/boeing-doesnt-expect-major-impact-from-tariffs/",
    "timestamp": "2025-03-19T19:10:07Z"
  },
  {
    "title": "Trump Floated US Ownership Of Ukraine Power Plants: White House",
    "description": "President Donald Trump has raised the possibility of the United States taking ownership of Ukrainian power plants, the White House said Wednesday as efforts to end the war with Russia proceed.",
    "link": "https://www.ndtv.com/world-news/trump-floated-us-ownership-of-ukraine-power-plants-white-house-7963277",
    "timestamp": "2025-03-19T19:08:59Z"
  },
  {
    "title": "Karoline Leavitt Brutally Fact-Checked on Judge Who Blocked Trump",
    "description": "President Donald Trump’s administration is going all in on smearing the federal judge who ordered the White House to hold off on its massive deportations—and now it’s just making stuff up.\r\nDuring a press briefing Wednesday, White House press secretary Karoli…",
    "link": "https://newrepublic.com/post/192935/donald-trump-karoline-leavitt-fact-checked-judge-immigration",
    "timestamp": "2025-03-19T19:08:46Z"
  },
  {
    "title": "Trump and Musk Are Running a Disinformation Campaign on Social Security",
    "description": "Donald Trump keeps saying he has no intention of slashing Social Security, but…he and his mini-me, Elon Musk, won’t stop making outlandish claims about the program and appear to be setting the table for cuts that they will try to call something other than “cu…",
    "link": "https://www.motherjones.com/politics/2025/03/trump-musk-doge-disinformation-campaign-social-security/",
    "timestamp": "2025-03-19T19:08:04Z"
  },
  {
    "title": "House Democrat Calls For Chuck Schumer’s Ouster From Leadership: ‘Afraid It May Be Time’",
    "description": "\"He's done a lot of great things. But I'm afraid that it may be time for the Senate Democrats to pick new leadership as we move forward.\"\nThe post House Democrat Calls For Chuck Schumer’s Ouster From Leadership: ‘Afraid It May Be Time’ first appeared on Media…",
    "link": "https://www.mediaite.com/politics/house-democrat-calls-for-chuck-schumers-ouster-from-leadership-afraid-it-may-be-time/",
    "timestamp": "2025-03-19T19:08:01Z"
  },
  {
    "title": "Poland To Turn NATO's Eastern Border With Russia Into Minefield",
    "description": "Poland is stepping up defenses with the Baltic states ahead of possible Russian aggression as the war with Ukraine intensifies.",
    "link": "https://www.newsweek.com/poland-turn-natos-eastern-border-russia-minefield-2047313",
    "timestamp": "2025-03-19T19:07:45Z"
  },
  {
    "title": "Energy sector CEOs call on Ottawa to use emergency powers to speed up key projects",
    "description": "In an open letter, the CEOs of 10 of the largest oil and natural gas companies and the four largest pipeline companies outlined their plan to strengthen Canadian economic sovereignty.",
    "link": "https://www.cbc.ca/news/canada/calgary/energy-ceos-open-letter-1.7487793",
    "timestamp": "2025-03-19T19:07:30Z"
  },
  {
    "title": "Netanyahu says 'leftist Deep State' in Israel, US weaponizes justice system against strong right wing leaders",
    "description": "Israeli Prime Minister Benjamin Netanyahu on Wednesday said Israeli and American right wing leaders face opposition from the \"leftist Deep State.\"",
    "link": "https://www.foxnews.com/world/netanyahu-says-leftist-deep-state-israel-us-weaponizes-justice-system-against-strong-right-wing-leaders",
    "timestamp": "2025-03-19T19:07:11Z"
  },
  {
    "title": "How Many Transgender People Are in the Military? What Data Shows",
    "description": "Data shows very few transgender Americans serve in the armed forces.",
    "link": "https://www.newsweek.com/how-many-transgender-people-are-military-what-data-shows-2047358",
    "timestamp": "2025-03-19T19:07:02Z"
  },
  {
    "title": "If Anyone’s Destroying The Judiciary’s ‘Legitimacy,’ It’s Chief Justice John Roberts",
    "description": "Roberts' attempts to preserve what he views as the judiciary's 'legitimacy' are only destroying its credibility with the American people.",
    "link": "https://thefederalist.com/2025/03/19/if-anyones-destroying-the-judiciarys-legitimacy-its-chief-justice-john-roberts/",
    "timestamp": "2025-03-19T19:06:27Z"
  },
  {
    "title": "$15M reward announced for alleged Chinese ringleader, others accused of smuggling US drone technology to Iran",
    "description": "The State Department is offering $15 million for information on Chinese nationals accused of smuggling U.S. weapons technology to Iran terror groups.",
    "link": "https://www.foxnews.com/us/15m-reward-announced-alleged-chinese-ringleader-others-accused-smuggling-us-drone-technology-iran",
    "timestamp": "2025-03-19T19:06:22Z"
  },
  {
    "title": "Turkey Wants to Be a European Power Now",
    "description": "Ankara is preparing to send peacekeeping troops to Ukraine—and to deepen ties with the EU.",
    "link": "http://foreignpolicy.com/2025/03/19/turkey-wants-to-be-a-european-power-now/",
    "timestamp": "2025-03-19T19:05:30Z"
  },
  {
    "title": "Donald Trump and Joe Biden's FBI Most Wanted Arrests Compared",
    "description": "President Donald Trump's administration has captured three individuals on the Federal Bureau of Investigation's \"Ten Most Wanted Fugitives\" list nearly two months after Trump took office.\nAt this same point in time in former President Joe Biden's term, the FB…",
    "link": "https://biztoc.com/x/35b82cc85f75b7b3",
    "timestamp": "2025-03-19T19:05:06Z"
  },
  {
    "title": "Was NBC Camera Removed From Trump Meeting? What We Know",
    "description": "An NBC camera filming President Donald Trump at the Kennedy Center Board Meeting abruptly stopped filming midway through the president's remarks, sparking concerns that the president may have them shut down.\nHowever, a source familiar with the situation told …",
    "link": "https://biztoc.com/x/41bc9438c469df67",
    "timestamp": "2025-03-19T19:04:55Z"
  },
  {
    "title": "Auto suppliers face more dire circumstances than automakers amid Trump tariffs",
    "description": "DETROIT — President Donald Trump’s proposed tariffs on goods from Mexico and Canada would hit automotive suppliers harder than automakers, but their problems could quickly have ripple effects on the broader industry.",
    "link": "https://biztoc.com/x/5b2d462918101cd9",
    "timestamp": "2025-03-19T19:04:40Z"
  },
  {
    "title": "Biden-Appointed Judge Blocks Pentagon Ban on Transgender Troops",
    "description": "A Biden-appointed federal judge on Tuesday blocked the Trump Pentagon from implementing its policy that would bar transgender troops.\nThe post Biden-Appointed Judge Blocks Pentagon Ban on Transgender Troops appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/19/biden-appointed-judge-blocks-pentagon-ban-transgender-troops/",
    "timestamp": "2025-03-19T19:04:16Z"
  },
  {
    "title": "Trump threatens Houthi rebels that they’ll be ‘completely annihilated’ as airstrikes pound Yemen",
    "description": "President Donald Trump threatened Yemen’s Houthi rebels on Wednesday that they’ll be “completely annihilated” as American airstrikes pounded locations under their control.",
    "link": "https://www.nbcnews.com/news/world/trump-yemen-threatens-houthi-rebels-airstrikes-rcna197107",
    "timestamp": "2025-03-19T19:03:53Z"
  },
  {
    "title": "Schumer Faces Growing Calls From Democrats to Resign Over Cowardice",
    "description": "Democrats aren’t so sure that Senate Minority Leader Chuck Schumer should continue to front the party.\r\nSeveral Democratic lawmakers in the House of Representatives believe that the New York lawmaker should “step down” after he pushed his caucus to back the G…",
    "link": "https://newrepublic.com/post/192939/chuck-schumer-democrats-resign-donald-trump",
    "timestamp": "2025-03-19T19:03:13Z"
  },
  {
    "title": "Here’s what 'will eventually seal Elon Musk’s fate' in Trump’s orbit: reporter",
    "description": "Billionaire Elon Musk — head of SpaceX, Tesla and X.com (formerly Twitter) and the richest man in the world — was a major contributor to Donald Trump's 2024 campaign. And after Trump\r\n narrowly won the election, Trump thanked Musk by putting him in charge of …",
    "link": "https://www.rawstory.com/heres-what-will-eventually-seal-elon-musks-fate-in-trumps-orbit-reporter/",
    "timestamp": "2025-03-19T19:02:11Z"
  },
  {
    "title": "Ben & Jerry’s says its CEO was fired over the company’s political posts",
    "description": "Ben & Jerry’s claims its CEO was wrongly fired by its parent company Unilver because of the ice cream company’s progressive political stance.",
    "link": "https://www.today.com/food/news/ben-and-jerrys-ceo-fired-rcna197076",
    "timestamp": "2025-03-19T19:00:38Z"
  },
  {
    "title": "Inside the mission that brought NASA's 'stranded' astronauts home",
    "description": "After 268 days without fresh air or a proper shower, Butch Wilmore and Sunita Williams made their final journey back to Earth.",
    "link": "https://www.abc.net.au/news/2025-03-20/astronauts-return-iss-dragon-spacex-suni-williams-butch-wilmore/105070946",
    "timestamp": "2025-03-19T19:00:18Z"
  },
  {
    "title": "House Dems Ramp Up Calls for Schumer's Resignation as Donors Lament 'Despair and Hopelessness'",
    "description": "Democratic politicians and donors are sounding the alarm over the party's discord during President Donald Trump's second term, with House Democrats calling for Senate minority leader Chuck Schumer (D., N.Y.) to step down.\nThe post House Dems Ramp Up Calls for…",
    "link": "https://freebeacon.com/latest-news/house-dems-ramp-up-calls-for-schumers-resignation-as-donors-lament-despair-and-hopelessness/",
    "timestamp": "2025-03-19T19:00:06Z"
  },
  {
    "title": "Fed Pauses Interest Rate Cuts. Where Do Mortgage Rates Go From Here?",
    "description": "Concerns over Trump's economic policies are clouding the rate outlook ahead of the spring homebuying season.",
    "link": "https://www.cnet.com/personal-finance/fed-pauses-interest-rate-cuts-where-do-mortgage-rates-go-from-here/",
    "timestamp": "2025-03-19T19:00:00Z"
  },
  {
    "title": "Donald Trump and Joe Biden's FBI Most Wanted Arrests Compared",
    "description": "Three people on the FBI's Most Wanted list have been captured in nearly two months.",
    "link": "https://www.newsweek.com/donald-trump-joe-bidens-fbi-most-wanted-arrests-compared-2047329",
    "timestamp": "2025-03-19T18:59:00Z"
  },
  {
    "title": "Auto suppliers face more dire circumstances than automakers amid Trump tariffs",
    "description": "DETROIT — President Donald Trump’s proposed tariffs on goods from Mexico and Canada would hit automotive suppliers harder than automakers, but their problems could quickly have ripple effects on the broader industry.",
    "link": "https://www.nbcnews.com/business/autos/auto-suppliers-face-dire-circumstances-automakers-trump-tariffs-rcna197143",
    "timestamp": "2025-03-19T18:56:42Z"
  },
  {
    "title": "Was NBC Camera Removed From Trump Meeting? What We Know",
    "description": "An NBC camera operator broadcasting the President's remarks at the Kennedy Center turned away and stopped the broadcast mid-recording.",
    "link": "https://www.newsweek.com/was-nbc-camera-removed-trump-meeting-what-we-know-2046368",
    "timestamp": "2025-03-19T18:56:35Z"
  },
  {
    "title": "Trump’s defiance of a federal court order fuels a constitutional crisis − a legal scholar unpacks the complicated case",
    "description": "The current case focused on the deportation of Venezuelan immigrants raises concerns about whether the president will continue to respect the country’s legal system.",
    "link": "https://theconversation.com/trumps-defiance-of-a-federal-court-order-fuels-a-constitutional-crisis-a-legal-scholar-unpacks-the-complicated-case-252591",
    "timestamp": "2025-03-19T18:56:34Z"
  },
  {
    "title": "Biden LNG Study Shelved After Pollution Impacts Deemed Minor",
    "description": "When the Biden administration stopped approving licenses to export US liquefied natural gas in January of last year, officials said they first needed to determine how those shipments would affect the environment and economy.",
    "link": "https://financialpost.com/pmn/business-pmn/biden-lng-study-shelved-after-pollution-impacts-deemed-minor",
    "timestamp": "2025-03-19T18:56:26Z"
  },
  {
    "title": "Courtney Love Applies for UK Citizenship to Flee ‘Emperor’ Trump: ‘It’s Like Cyanide Now’",
    "description": "\"It's frightening,\" the musician says of President Trump's reign over the U.S. \nThe post Courtney Love Applies for UK Citizenship to Flee ‘Emperor’ Trump: ‘It’s Like Cyanide Now’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/courtney-love-uk-citizenship-donald-trump/",
    "timestamp": "2025-03-19T18:55:49Z"
  },
  {
    "title": "Trump to attend NCAA wrestling championships in longtime Democrat-run city",
    "description": "President Donald Trump will be at the NCAA Division I wrestling championships this weekend in Philadelphia, Karoline Leavitt confirmed.",
    "link": "https://www.foxnews.com/sports/trump-attend-ncaa-wrestling-championships-longtime-democrat-run-city",
    "timestamp": "2025-03-19T18:55:13Z"
  },
  {
    "title": "'Significant moment': Report claims Columbia Uni close to giving in to Trump $400M threat",
    "description": "Columbia University could be close to giving in to President Donald Trump's demand that it enact certain measures aimed to combat anti-semitism on campus or lose $400 million in federal funding, according to reporting in The Wall Street Journal.The Trump admi…",
    "link": "https://www.rawstory.com/a-significant-moment-deadline-approaching-for-columbia-u-to-take-trump-s-400m-offer/",
    "timestamp": "2025-03-19T18:54:07Z"
  },
  {
    "title": "Student Loan Borrowers See Payments Soar After Trump's Changes",
    "description": "Some student loan borrowers are seeing their payments skyrocket amid changes to the Education Department under President Donald Trump.\nTrump has updated the department's income-driven federal student loan repayment programs, causing some borrowers to see thei…",
    "link": "https://biztoc.com/x/aea2018cc9dc908e",
    "timestamp": "2025-03-19T18:53:44Z"
  },
  {
    "title": "‘We Have to Have Hope and We Have to Fight Hard’: The Ms. Q&A With Trailblazing Former Rep. Barbara Lee",
    "description": "This Women’s History Month, as we honor the many women who have helped shape this country throughout the years, I had the opportunity to speak with one such history maker, former longtime U.S. Representative Barbara Lee (D-Calif.).\nAs the first Black woman el…",
    "link": "https://msmagazine.com/2025/03/19/barbara-lee-interview-hope-fight-hard-civil-rights-democracy-trump-womens-history-month/",
    "timestamp": "2025-03-19T18:53:42Z"
  },
  {
    "title": "Trump to Meet Oil CEOs Amid Market Turmoil",
    "description": "U.S. President Donald Trump is set to host on Wednesday a group of oil company executives in the first such sit-down since his return to the White House.\nPresident Trump will meet at a closed-door event members of the executive committee of the American Petro…",
    "link": "https://biztoc.com/x/4ec5e1c4afa25fdf",
    "timestamp": "2025-03-19T18:53:38Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang says tariff impact won't be meaningful in the near term",
    "description": "Nvidia CEO Jensen Huang downplayed the negative impact from President Donald Trump’s tariffs, saying there won’t be any significant damage in the short run.",
    "link": "https://www.nbcnews.com/business/business-news/nvidia-ceo-jensen-huang-says-tariff-impact-wont-meaningful-term-rcna197141",
    "timestamp": "2025-03-19T18:53:16Z"
  },
  {
    "title": "Murkowski Says Her Colleagues Are Afraid of Trump",
    "description": "Sen. Lisa Murkowski (R-AK) said her Republican colleagues are afraid of challenging President Donald Trump or Elon Musk, warning that she could face an expensive primary challenge for her criticism of the administration, Politico reports.",
    "link": "https://politicalwire.com/2025/03/19/murkowski-says-her-colleagues-are-afraid-of-trump-and-musk/",
    "timestamp": "2025-03-19T18:53:14Z"
  },
  {
    "title": "Student Loan Borrowers See Payments Soar After Trump's Changes",
    "description": "Some borrowers will see their monthly payments rise anywhere from $500 to $5,000 amid Education Department dismantling.",
    "link": "https://www.newsweek.com/student-loan-repayment-income-driven-donald-trump-layoffs-2047291",
    "timestamp": "2025-03-19T18:52:03Z"
  },
  {
    "title": "Fed holds rates, sees slower growth and higher inflation",
    "description": "Holding rates steady comes as US President Donald Trump’s policy agenda has placed the US economy under increasing pressure",
    "link": "https://www.irishtimes.com/business/economy/2025/03/19/fed-holds-rates-sees-slower-growth-and-higher-inflation/",
    "timestamp": "2025-03-19T18:51:51Z"
  },
  {
    "title": "Walton Goggins’ ‘White Lotus’ meme is for anyone trapped in a nightmare conversation",
    "description": "The Walton Goggins meme is the internet’s new go-to reaction for those moments when someone overshares—and you’re left stunned, processing what you just heard. Pulled from a scene in The White Lotus, the meme features Goggins’ character Rick Hatchett wearing …",
    "link": "https://www.dailydot.com/memes/walton-goggins-meme/",
    "timestamp": "2025-03-19T18:51:24Z"
  },
  {
    "title": "White House targets federal judge, gets fact-checked in real time",
    "description": "White House press secretary Karoline Leavitt tried to go after U.S. District Judge James Boasberg during a briefing. It did not go well.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-targets-federal-judge-gets-fact-checked-real-time-rcna197131",
    "timestamp": "2025-03-19T18:49:57Z"
  },
  {
    "title": "How Canadian small businesses can expand into Asian markets and reduce their dependence on the U.S.",
    "description": "Asia has emerged as an attractive alternative for Canadian businesses looking to diversify away from the U.S., but there are challenges they will need to overcome.",
    "link": "https://theconversation.com/how-canadian-small-businesses-can-expand-into-asian-markets-and-reduce-their-dependence-on-the-u-s-251991",
    "timestamp": "2025-03-19T18:49:13Z"
  },
  {
    "title": "Ex-Supreme Court Justice Explains Why John Roberts' Rare Statement Was So Important",
    "description": "The chief justice is \"trying to explain to the people of this country how the legal system works,\" retired Supreme Court Justice Stephen Breyer said.",
    "link": "https://www.huffpost.com/entry/stephen-breyer-john-roberts-trump-statement_n_67daf025e4b0abb74b13a74b",
    "timestamp": "2025-03-19T18:48:54Z"
  },
  {
    "title": "Democrats Entire Theory Of Politics Blown Up By One Poll",
    "description": "A new research poll upends the view of non-voters in the political science world, and the result is not good for Democrats.",
    "link": "https://dailycaller.com/2025/03/19/democrats-blue-rose-research-trump-harris/",
    "timestamp": "2025-03-19T18:47:04Z"
  },
  {
    "title": "Wayne Gretzky wine is under attack again at a different Toronto store",
    "description": "It seems an increasing number of Canadians are turning on Wayne Gretzky under the notion that he has, in many ways, turned on us by remaining cozy with tariff-wielding Donald Trump.\r\nEver since being spotted sporting a MAGA hat while attending the U.S. Presid…",
    "link": "https://www.blogto.com/eat_drink/2025/03/wayne-gretzky-wine-under-attack-toronto-store/",
    "timestamp": "2025-03-19T18:46:15Z"
  },
  {
    "title": "Congress on track for stablecoin, market structure bills by August: Blockchain Association",
    "description": "United States lawmakers are on track to pass legislation setting rules for stablecoins and cryptocurrency market structure by as soon as August, Kristin Smith, CEO of industry advocacy group the Blockchain Association, said during Blockworks’ 2025 Digital Ass…",
    "link": "https://cointelegraph.com/news/congress-stablecoin-market-structure-bills-august-blockchain-association",
    "timestamp": "2025-03-19T18:44:28Z"
  },
  {
    "title": "Immediate analysis: Why İmamoğlu’s arrest now – Erdoğan unchecked, exploiting Trump’s favor to expand",
    "description": "A highly favorable moment for the Turkish president’s plans – Social backlash and the momentum the opposition seeks to exploit\nThe post Immediate analysis: Why İmamoğlu’s arrest now – Erdoğan unchecked, exploiting Trump’s favor to expand appeared first on Pro…",
    "link": "https://en.protothema.gr/2025/03/19/immediate-analysis-why-imamoglus-arrest-now-erdogan-unchecked-exploiting-trumps-favor-to-expand/",
    "timestamp": "2025-03-19T18:43:03Z"
  },
  {
    "title": "Trump suggests to Zelenskyy that U.S. take ownership of Ukrainian power plants for security",
    "description": "President Donald Trump has suggested to Ukrainian President Volodymyr Zelenskyy that the U.S. should take ownership of Ukrainian power plants to ensure the critical facilities' security.",
    "link": "https://biztoc.com/x/d714b1784a6ebf9f",
    "timestamp": "2025-03-19T18:42:19Z"
  },
  {
    "title": "Crypto Companies Looking To Obtain Bank Charters Amid President Trump’s New Regulatory Regime: Report",
    "description": "Crypto firms in the US are reportedly seeking bank charters, encouraged by President Donald Trump’s pro-digital asset regulatory environment. According to a new report from Reuters, crypto and fintech companies are increasingly interested in reducing their bo…",
    "link": "https://dailyhodl.com/2025/03/19/crypto-companies-looking-to-obtain-bank-charters-amid-president-trumps-new-regulatory-regime-report/",
    "timestamp": "2025-03-19T18:41:17Z"
  },
  {
    "title": "Ontario Premier Doug Ford, cabinet ministers sworn in at ceremony on Wednesday",
    "description": "Ontario Premier Doug Ford has named a new cabinet with many familiar faces, though he has shuffled his housing and education ministers. Paul Calandra moves from housing to become the education minister, taking over from Jill Dunlop who moves to emergency prep…",
    "link": "https://www.cbc.ca/news/canada/toronto/premier-ford-cabinet-swearing-in-wednesday-1.7487442",
    "timestamp": "2025-03-19T18:40:52Z"
  },
  {
    "title": "Trump freezes Penn funding over trans swimmer",
    "description": "The Trump administration has suspended approximately $175 million in federal funding for the University of Pennsylvania over the participation of a transgender athlete in its swimming program.",
    "link": "https://www.espn.com/college-sports/story/_/id/44317729/trump-administration-suspends-175m-penn-trans-swimmer",
    "timestamp": "2025-03-19T18:40:45Z"
  },
  {
    "title": "Australian unis losing US funding amid Trump's 'America First' agenda",
    "description": "Donald Trump's \"America First\" agenda hits Australian universities, with at least six reporting funding cuts or pauses under the new administration.",
    "link": "https://www.abc.net.au/news/2025-03-20/trump-america-first-policy-risking-australian-uni-research-funds/105072344",
    "timestamp": "2025-03-19T18:40:37Z"
  },
  {
    "title": "Ford Worker Detained by ICE Faces Death by Torture, Wife Fears",
    "description": "\"If my husband is deported, his life is at risk of being tortured to death,\" Dora Yisel Morales Diaz said.",
    "link": "https://www.newsweek.com/ford-worker-detained-ice-death-torture-2047275",
    "timestamp": "2025-03-19T18:40:30Z"
  },
  {
    "title": "Activists call on Canada to help Afghan women facing deportation due to Trump administration cuts",
    "description": "Activists are calling on the Canadian government and universities to let Afghan women studying under U.S.-funded scholarships to come to Canada, warning the students could face dire and potentially life-threatening consequences if they return to a country und…",
    "link": "https://www.cbc.ca/news/canada/british-columbia/afghan-women-studying-abroad-usaid-cuts-1.7487526",
    "timestamp": "2025-03-19T18:38:57Z"
  },
  {
    "title": "Trump hails 'very good' phone call with Zelensky",
    "description": "The US president says peace efforts are \"very much on track\" after an hour-long conversation.",
    "link": "https://www.bbc.com/news/articles/c62k1w7z5rro",
    "timestamp": "2025-03-19T18:38:11Z"
  },
  {
    "title": "J.D. Vance Wants to Heal the MAGA Populist–Tech Bro Divide? Good Luck.",
    "description": "Tensions between the Steve Bannon and Elon Musk types in Trump’s coalition go a lot deeper than the fight over H1-B visas. In trying to keep them unified Vance has his work cut out for him.",
    "link": "http://nymag.com/intelligencer/article/vance-maga-bannon-musk-populist-tech-divide.html",
    "timestamp": "2025-03-19T18:37:01Z"
  },
  {
    "title": "OpenAI Wants to Ban DeepSeek",
    "description": "Michael Spencer, \nAI Supremacy, \nMar 19, 2025\n\n\n \n \r\nAccording to this article, \" BigTech wants to use U.S. anti-China rhetoric and U.S's push for AI Supremacy to veto Open-source models that might threaten its own global dominance and cash-cows.\" Martin Doug…",
    "link": "https://www.ai-supremacy.com/p/openai-wants-to-ban-deepseek",
    "timestamp": "2025-03-19T18:37:00Z"
  },
  {
    "title": "US holds rates steady despite economy fears",
    "description": "The US central bank warns that economic uncertainty has \"increased\".",
    "link": "https://www.bbc.com/news/articles/cvgp574lvdxo",
    "timestamp": "2025-03-19T18:35:30Z"
  },
  {
    "title": "Pierre Poilievre can't escape Donald Trump",
    "description": "Recent polls show that voters don't trust Pierre Poilievre to deal with Donald Trump. His willingness to take Trump — a known and notorious liar — at his word probably won't help there.",
    "link": "https://www.nationalobserver.com/2025/03/19/opinion/pierre-poilievre-donald-trump",
    "timestamp": "2025-03-19T18:34:23Z"
  },
  {
    "title": "Pierre Poilievre can't escape Donald Trump",
    "description": "Recent polls show that voters don't trust Pierre Poilievre to deal with Donald Trump. His willingness to take Trump — a known and notorious liar — at his word probably won't help there.",
    "link": "https://www.nationalobserver.com/2025/03/20/opinion/pierre-poilievre-donald-trump",
    "timestamp": "2025-03-19T18:34:23Z"
  },
  {
    "title": "EU Enforces DMA, Orders Apple to Open iOS to Competitors",
    "description": "The European Union (EU) has mandated that Apple must open its iOS operating system to enhance compatibility with competing technologies.\nThe post EU Enforces DMA, Orders Apple to Open iOS to Competitors first appeared on iPhone in Canada Blog.",
    "link": "https://www.iphoneincanada.ca/2025/03/19/eu-orders-apple-to-open-ios-to-competitors/",
    "timestamp": "2025-03-19T18:34:18Z"
  },
  {
    "title": "NBC Reporter Fact-Checks Trump Spox Live At Briefing: ‘Felt The Need To Clear That Up’",
    "description": "Garrett Haake fact-checked White House Press Secretary Karoline Leavitt over her claim that a \"Democrat activist\" judge blocked President Donald Trump's agenda.\nThe post NBC Reporter Fact-Checks Trump Spox Live At Briefing: ‘Felt The Need To Clear That Up’ fi…",
    "link": "https://www.mediaite.com/news/nbc-reporter-fact-checks-trump-spox-live-at-briefing-felt-the-need-to-clear-that-up/",
    "timestamp": "2025-03-19T18:34:13Z"
  },
  {
    "title": "Institute of Peace asks Court to halt Trump administration takeover",
    "description": "Board members of the U.S. Institute of Peace, a private nonprofit created by Congress, filed a lawsuit seeking to halt what they call an illegal takeover by the Trump administration that steps on congressional power. The institute and five board members accus…",
    "link": "https://freerepublic.com/focus/f-chat/4305389/posts",
    "timestamp": "2025-03-19T18:33:54Z"
  },
  {
    "title": "Immigrant groups push Beacon Hill to pass enhanced protections amid Trump crackdown",
    "description": "Elected officials in Massachusetts need to create more legal protections for immigrants as they face an “all-out assault” by President Donald Trump’s administration, which has promised to carry out mass deportations all across the country, local advocates sai…",
    "link": "https://www.bostonherald.com/2025/03/19/immigrant-groups-push-beacon-hill-to-pass-enhanced-protections-amid-trump-crackdown/",
    "timestamp": "2025-03-19T18:33:54Z"
  },
  {
    "title": "EAM Jaishankar says 'countries use tariffs, sanctions; it is a reality'",
    "description": "External Affairs Minister S Jaishankar acknowledges the increased use of tariffs and economic measures as tools for global competition. Highlighting the trend over the past decade, he emphasizes the importance of such strategies in countries' quests for compr…",
    "link": "https://economictimes.indiatimes.com/news/india/eam-jaishankar-says-countries-use-tariffs-sanctions-it-is-a-reality/articleshow/119224031.cms",
    "timestamp": "2025-03-19T18:32:49Z"
  },
  {
    "title": "Video: Schumer Defends Democratic Strategy to Resist Trump: \"This Worked in 2017\"",
    "description": "i saw this last night and posted this afteward: app.bsky.feed.post\">Bluesky post Which tells you what I thought about it, but I think people need to see this to understand what's going on in the Democratic Party as Donald Trump continues to advance his autocr…",
    "link": "https://littlegreenfootballs.com/article/54469_Video-_Schumer_Defends_Democra",
    "timestamp": "2025-03-19T18:32:41Z"
  },
  {
    "title": "Elon Musk on X March 19: What SpaceX Billionaire Has Posted So Far",
    "description": "Elon Musk's X use today focused primarily on Tesla, and responding to protests against the company.",
    "link": "https://www.newsweek.com/elon-musk-x-latest-posts-tweets-update-2047310",
    "timestamp": "2025-03-19T18:32:30Z"
  },
  {
    "title": "A man in my position cannot afford to be made to look ridiculous",
    "description": "Krugman gets at the heart of why Elon feels the need to arbitrarily strip the most needy of their Social Security benefits, and obviously the deficit has nothing to do with it: We often think of Social Security as a retirement program, which it is; most Socia…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/a-man-in-my-position-cannot-afford-to-be-made-to-look-ridiculous",
    "timestamp": "2025-03-19T18:32:22Z"
  },
  {
    "title": "Trump suggests to Zelenskyy that the US should take ownership of Ukrainian power plants for security",
    "description": "President Donald Trump and Ukrainian President Volodymyr Zelenskyy discussed moving toward a ceasefire between Kyiv and Moscow, with the U.S. potentially overseeing the security of Ukrainian power plants. Despite some progress, key issues remain unresolved as…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-suggests-to-zelenskyy-that-the-us-should-take-ownership-of-ukrainian-power-plants-for-security/articleshow/119224010.cms",
    "timestamp": "2025-03-19T18:32:16Z"
  },
  {
    "title": "Trump suggests to Zelenskyy that U.S. take ownership of Ukrainian power plants for security",
    "description": "President Donald Trump has suggested to Ukrainian President Volodymyr Zelenskyy that the U.S. should take ownership of Ukrainian power plants to ensure the critical facilities' security.",
    "link": "https://www.pbs.org/newshour/world/trump-suggests-to-zelenskyy-that-u-s-take-ownership-of-ukrainian-power-plants-for-security",
    "timestamp": "2025-03-19T18:31:03Z"
  },
  {
    "title": "Trump said to have given Iran 2 months for nuclear deal",
    "description": "US President Donald Trump sent a letter to Iran's Supreme Leader Ayatollah Ali Khamenei in March, setting a two-month deadline to reach a new nuclear agreement, Axios reported Wednesday, citing a US o...",
    "link": "https://biztoc.com/x/3811b7304a91ea82",
    "timestamp": "2025-03-19T18:31:01Z"
  },
  {
    "title": "Bernie Sanders says Democrats have bigger problems than Schumer, party has 'no grassroots support'",
    "description": "Bernie Sanders lamented on Tuesday that the Democratic Party had \"virtually no grassroots support,\" shifting away some blame from Chuck Schumer amid the fallout from the spending bill.",
    "link": "https://www.foxnews.com/media/bernie-sanders-democrats-bigger-problems-schumer-party-no-grassroots-support",
    "timestamp": "2025-03-19T18:30:43Z"
  },
  {
    "title": "Georgia Supreme Court considers whether judge was right to block new election rules",
    "description": "Just before last year's general election, a judge in Georgia blocked seven new rules passed by the State Election Board and said the board didn't have the authority to pass them",
    "link": "https://abcnews.go.com/Politics/wireStory/georgia-supreme-court-considers-judge-block-new-election-119959273",
    "timestamp": "2025-03-19T18:30:39Z"
  },
  {
    "title": "Federal Reserve cuts US economic growth outlook amid Trump tariffs",
    "description": "Officials raise forecast for price growth, estimating that inflation will increase at average rate of 2.7% this year\nOfficials at the US Federal Reserve cut their US economic growth forecasts and raised their projections for price growth as they kept interest…",
    "link": "https://biztoc.com/x/ec9acbdeb2dfd0e8",
    "timestamp": "2025-03-19T18:30:38Z"
  },
  {
    "title": "Fed Holds Rates, Sees Slower Growth and Higher Inflation",
    "description": "Federal Reserve officials held their benchmark interest rate steady for a second straight meeting, though they telegraphed expectations for slower economic growth and higher inflation.",
    "link": "https://financialpost.com/pmn/business-pmn/fed-holds-rates-sees-slower-growth-and-higher-inflation",
    "timestamp": "2025-03-19T18:30:21Z"
  },
  {
    "title": "EXCLUSIVE: Fury Erupts After Researchers and Conspiracy Theorists Realise Trump's 'Secret' JFK Files are REDACTED Versions of Papers Put Out By Joe Biden — 'Just Like With Epstein, MAGAs Got Played Again… This S--- is OLD'",
    "description": "The long-awaited release of Donald Trump's top secret JFK files was one big anti-climax, according to many disgruntled amateur sleuths who claim the documents were redacted.",
    "link": "https://radaronline.com/p/conspiracy-theorists-trump-secret-jfk-files-redacted-joe-biden-epstein-maga/",
    "timestamp": "2025-03-19T18:30:00Z"
  },
  {
    "title": "Liberal Documentarians Panic as Industry Goes Trump-Friendly, but Conservatives Say ‘They’re Getting a Taste’ of Censorship and It’s ‘Satisfying’",
    "description": "Eight years ago, tech billionaire Jeff Skoll clapped enthusiastically as Al Gore assuaged the opening-night Sundance crowd just hours before Donald Trump was sworn in as the 45th president. “We will win,” Gore said after the Skoll-backed climate change docume…",
    "link": "https://variety.com/2025/film/news/documentary-donald-trump-liberal-conservative-maga-1236342420/",
    "timestamp": "2025-03-19T18:30:00Z"
  },
  {
    "title": "Millions Will Face Benefit Delays as Social Security Ends Phone Verification",
    "description": "The Social Security Administration will no longer allow phone verification, starting on March 31.",
    "link": "https://truthout.org/articles/millions-will-face-benefit-delays-as-social-security-ends-phone-verification/",
    "timestamp": "2025-03-19T18:28:47Z"
  },
  {
    "title": "Fed Holds Rates Citing Higher Economic Uncertainty, Stocks Rise",
    "description": "The Federal Reserve kept rates steady on Wednesday, but members cut their growth target for the year",
    "link": "https://www.ibtimes.com/fed-holds-rates-citing-higher-economic-uncertainty-stocks-rise-3766935",
    "timestamp": "2025-03-19T18:28:36Z"
  },
  {
    "title": "Trump aide uses Scientology 'legal precedent' to avoid 'public humiliation': report",
    "description": "With his re-election as president killing off any criminal charges he was facing for inciting the Jan. 6 insurrection that forced lawmakers from both sides of the aisle to flee for their lives, Donald Trump still faces what could be costly civil lawsuits file…",
    "link": "https://www.rawstory.com/trump-scavino-scinetology/",
    "timestamp": "2025-03-19T18:28:33Z"
  },
  {
    "title": "Judges blocking Trump’s executive orders are acting ‘erroneously,' White House says",
    "description": "On Tuesday, President Donald Trump called for Judge James Boasberg to be impeached, prompting Supreme Court Chief Justice John Roberts to issue a rare statement condemning Trump’s remarks.",
    "link": "https://www.foxnews.com/politics/judges-blocking-trumps-executive-orders-acting-erroneously-white-house-says",
    "timestamp": "2025-03-19T18:27:09Z"
  },
  {
    "title": "WATCH: Anti-Musk radicals draw warning about terrorism charges for Tesla attacks",
    "description": "Extremists are vandalizing, destroying cars because of owner's work to help America",
    "link": "https://www.wnd.com/2025/03/watch-anti-musk-radicals-draw-warning-about-terrorism-charges-for-tesla-attacks/",
    "timestamp": "2025-03-19T18:26:34Z"
  },
  {
    "title": "How to Negotiate With Putin",
    "description": "Britain’s former ambassador to Russia on how Trump can avoid falling into the Kremlin’s trap.",
    "link": "http://foreignpolicy.com/2025/03/19/how-negotiate-putin-trump-ukraine/",
    "timestamp": "2025-03-19T18:25:41Z"
  },
  {
    "title": "Zelenskyy Agrees To Partial Energy Ceasefire In Call With Trump, White House Says",
    "description": "Russia and Ukraine accused each other of continuing attacks overnight Tuesday despite Russia announcing hours earlier it had agreed to an energy and infrastructure ceasefire.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/19/zelenskyy-agrees-to-partial-energy-ceasefire-in-call-with-trump-white-house-says/",
    "timestamp": "2025-03-19T18:25:38Z"
  }
]