[
  {
    "title": "Tuesday: Hili dialogue",
    "description": "Welcome to The Cruelest Day: Tuesday, October 21, 2025, and National Reptile Awareness Day. here’s a video of a very weird turtle, the mata mata turtle (Chelus fimbriata). The video is on FB and can’t be embedded, but if you click on the screenshot you can se…",
    "link": "https://whyevolutionistrue.com/2025/10/21/tuesday-hili-dialogue-550/",
    "timestamp": "2025-10-21T11:45:03Z"
  },
  {
    "title": "Putin's mesmeric sway on Trump (Edward Luce/Financial Times)",
    "description": "Edward Luce / Financial Times:\nPutin's mesmeric sway on Trump  —  Russia bets it can gain in US negotiations what it cannot win on the battlefield  —  If there were a Nobel Prize for patience, Volodymyr Zelenskyy would run away with it.  The Ukrainian leader'…",
    "link": "https://www.memeorandum.com/251021/p10",
    "timestamp": "2025-10-21T11:45:01Z"
  },
  {
    "title": "White House demolition work begins as Trump pushes ahead with $250M ballroom plans",
    "description": "The White House on Monday started tearing down part of the East Wing, the traditional base of operations for the first lady, to build President Donald Trump's $250 million US ballroom despite lacking approval for construction from the federal agency that over…",
    "link": "https://www.cbc.ca/news/world/us-white-house-demolition-trump-ballroom-9.6946487",
    "timestamp": "2025-10-21T11:43:48Z"
  },
  {
    "title": "Joe Biden Rings The Bell After Completing Radiation Therapy Course For Prostate Cancer",
    "description": "The former president was diagnosed with an aggressive form of prostate cancer in May, four months after leaving the White House, his office said.",
    "link": "https://www.huffpost.com/entry/joe-biden-completes-radiation-therapy-course-cancer_n_68f75789e4b0dbac4590ca0f",
    "timestamp": "2025-10-21T11:42:28Z"
  },
  {
    "title": "Forbes Daily: Ticketmaster Policy Changes Put Scalpers On Notice",
    "description": "Today’s Forbes Daily newsletter covers Live Nation’s focus on resellers, gas prices drop, Apple stock soars, highest paid NBA players, Rivian’s EV market push and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/10/21/forbes-daily-ticketmaster-policy-changes-put-scalpers-on-notice/",
    "timestamp": "2025-10-21T11:42:11Z"
  },
  {
    "title": "US Vice President JD Vance is in Israel to shore up the fragile ceasefire in Gaza",
    "description": "The U.S.-brokered deal has teetered over the past few days.",
    "link": "https://www.bostonherald.com/2025/10/21/jd-vance-israel-fragile-ceasefire/",
    "timestamp": "2025-10-21T11:41:55Z"
  },
  {
    "title": "Larry Ellison: the billionaire’s burgeoning media empire",
    "description": "Oracle founder’s takeover of traditional and new media companies labelled ‘dangerous for democracy’ by US press watchdog",
    "link": "https://theweek.com/media/larry-ellison-the-billionaires-burgeoning-media-empire",
    "timestamp": "2025-10-21T11:39:39Z"
  },
  {
    "title": "‘You will not silence us’: No Kings Day protesters send a message to Trump",
    "description": "On Saturday, October 18, an estimated seven million Americans gathered for one of the biggest single-day protests in US history, taking a stand against authoritarianism",
    "link": "https://www.dazeddigital.com/life-culture/article/68932/1/you-will-not-silence-us-no-kings-day-protesters-send-a-message-to-trump?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=you-will-not-silence-us-no-kings-day-protesters-send-a-message-to-trump",
    "timestamp": "2025-10-21T11:38:00Z"
  },
  {
    "title": "Gemini AI’s Dogecoin Price Prediction — Why Maxi Doge Could Be the Next Top Meme Coin",
    "description": "Quick Facts: 1️⃣ US President Donald Trump’s China tariff threat upended what the market expected to be a bullish Uptober. 2️⃣ Dogecoin has been one of the biggest casualties of this recent downturn. So we asked Gemini AI how it will fare in the foreseeable f…",
    "link": "https://bitcoinist.com/gemini-ai-dogecoin-price-prediction-top-meme-coins-like-maxi-to-soar/",
    "timestamp": "2025-10-21T11:35:26Z"
  },
  {
    "title": "Northrop raises annual profit forecast on strong demand",
    "description": "(Reuters) -Northrop Grumman raised its 2025 profit forecast for a second straight quarter on Tuesday, as the defense contractor expects continued demand for ...",
    "link": "https://finance.yahoo.com/news/northrop-raises-annual-profit-forecast-113457501.html",
    "timestamp": "2025-10-21T11:34:57Z"
  },
  {
    "title": "US and Australia strike rare earths deal",
    "description": "The agreement comes as Washington seeks to boost its access to critical resources amid a standoff with Beijing  Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626755-us-australia-rare-earth-deal/",
    "timestamp": "2025-10-21T11:32:46Z"
  },
  {
    "title": "Most Americans worry about health care costs: AP-NORC poll",
    "description": "A new poll finds most U.S. adults are worried about health care becoming more expensive. That comes as Americans make decisions about next year’s health coverage and a government shutdown keeps future health costs in limbo for millions. The AP-NORC poll shows…",
    "link": "https://apnews.com/article/poll-shutdown-health-care-insurance-costs-trump-f0282a0f5bedf3f01172ed3fa0ba4fd2",
    "timestamp": "2025-10-21T11:31:58Z"
  },
  {
    "title": "'You should lose your job!' MAGA lawmaker stuns with wild conspiracy attack on Dem leader",
    "description": "Rep. Clay Higgins (R-LA) made a conspiratorial accusation Monday against House Minority Leader Hakeem Jeffries (D-NY) on social media Monday that left online critics stunned.“Reptilian,” Higgins wrote\r\n on X Monday night along with a photo of Jeffries, refere…",
    "link": "https://www.rawstory.com/web-push-notification/clay-higgins-2674217650/",
    "timestamp": "2025-10-21T11:31:07Z"
  },
  {
    "title": "South Park Season 27 and Season 28 Having Just 5 Episodes Each Was Reportedly Trey Parker and Matt Stone's Plan All Along",
    "description": "The decision to bring South Park Season 27 to an end after just five episodes and kick off Season 28 has gone without an official explanation from either Comedy Central, Paramount, or series co-creators Trey Parker and Matt Stone. But a recent article has sug…",
    "link": "https://www.ign.com/articles/south-park-season-27-and-season-28-having-just-5-episodes-each-was-reportedly-trey-parker-and-matt-stones-plan-all-along",
    "timestamp": "2025-10-21T11:30:46Z"
  },
  {
    "title": "When the White House press secretary says ‘your mom,’ it’s not a joke. It’s the message.",
    "description": "This is The Poynter Report, your daily guide to the news about news. Subscribe to get it in your inbox every weekday. Late last week, after President Donald Trump said […]\nThe post When the White House press secretary says ‘your mom,’ it’s not a joke. It’s th…",
    "link": "https://www.poynter.org/commentary/2025/karoline-leavitt-your-mom-did-reporter-response/",
    "timestamp": "2025-10-21T11:30:45Z"
  },
  {
    "title": "US Tariffs Take Big Bite Out Of Swiss Exports",
    "description": "Stiff US tariffs on Switzerland badly hurt the Alpine country's exports in the third quarter, official figures showed Tuesday, with Swiss watchmakers in particular suffering.",
    "link": "https://www.ibtimes.com/us-tariffs-take-big-bite-out-swiss-exports-3787800",
    "timestamp": "2025-10-21T11:30:27Z"
  },
  {
    "title": "Daily Egyptian Horoscope for October 22, 2025: Unexpected financial gains could turn your luck around for these zodiac signs",
    "description": "Egyptian astrology connects daily energies to divine forces, offering guidance for clarity, strength, and love. Each zodiac sign receives specific advice, encouraging self-compassion, inner growth, and embracing the present moment. The horoscopes emphasize tr…",
    "link": "https://timesofindia.indiatimes.com/astrology/horoscope/daily-egyptian-horoscope-for-october-22-2025-unexpected-financial-gains-could-turn-your-luck-around-for-these-zodiac-signs/articleshow/124720671.cms",
    "timestamp": "2025-10-21T11:28:16Z"
  },
  {
    "title": "Trump Pledges To Make ‘Ninth’ Deal And End Russia-Ukraine War",
    "description": "By Virginia Allen, The Daily Signal | October 17, 2025\nPresident Donald Trump says he is confident a deal can be reached to end the war between Ukraine and Russia.\n“I think that he wants to make a deal,” Trump said of Russian President Vladimir Putin. “I made…",
    "link": "https://biztoc.com/x/28145b453f037229",
    "timestamp": "2025-10-21T11:28:03Z"
  },
  {
    "title": "Rare Earths Stocks Soar After Mega US-Australia Minerals Deal To Slash Dependence On China",
    "description": "Rare Earths Stocks Soar After Mega US-Australia Minerals Deal To Slash Dependence On China\n \nPresident Donald Trump and Australian Prime Minister Anthony Albanese signed a minerals deal on Monday at the White House to expand America's rare earth supply and di…",
    "link": "https://biztoc.com/x/677119046d7e6a04",
    "timestamp": "2025-10-21T11:27:45Z"
  },
  {
    "title": "Most Americans are concerned about higher health care costs next year, an AP-NORC poll finds",
    "description": "A new poll finds most U.S. adults are worried about health care becoming more expensive.",
    "link": "https://www.bostonherald.com/2025/10/21/us-health-care-costs-concern/",
    "timestamp": "2025-10-21T11:27:07Z"
  },
  {
    "title": "AWS recovers, Apple rallies, General Motors beats and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/10/21/5-things-to-know-before-the-stock-market-opens-tuesday.html",
    "timestamp": "2025-10-21T11:27:00Z"
  },
  {
    "title": "General Motors lifts forecast as tariff outlook improves, shares surge 8%",
    "description": "(Reuters) -General Motors lifted its financial outlook for the year and slightly lowered its expected hit from tariffs, as the automaker awaits expected...",
    "link": "https://finance.yahoo.com/news/general-motors-lifts-forecast-tariff-112439774.html",
    "timestamp": "2025-10-21T11:24:39Z"
  },
  {
    "title": "Calling Protesters 'Communists'? Keep Talking, Republicans",
    "description": "CNN commentator Paul Begala took Rep. Nicole Malliotakis to task when she tried to pull the same red-baiting stunt we saw from Sen. Markwayne Mullin the previous day on Fox. As we already discussed here, Mullin tried to paint everyone who showed up for the No…",
    "link": "https://crooksandliars.com/2025/10/its-self-destructive-paul-begala-zings-gop",
    "timestamp": "2025-10-21T11:24:11Z"
  },
  {
    "title": "Transcript: Deep in Texas Trump Country, No Kings Cleverly Shames MAGA",
    "description": "The following is a lightly edited transcript of the October 20 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is the Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent.In the day…",
    "link": "https://newrepublic.com/article/202049/transcript-deep-texas-trump-country-no-kings-cleverly-shames-maga",
    "timestamp": "2025-10-21T11:22:03Z"
  },
  {
    "title": "How Donald Trump has changed the White House while in power",
    "description": "All presidents try to make their mark on the White House, but Donald Trump is making some of the biggest changes in decades.",
    "link": "https://news.sky.com/story/how-donald-trump-has-changed-the-white-house-while-in-power-13454402",
    "timestamp": "2025-10-21T11:22:00Z"
  },
  {
    "title": "White House starts demolishing part of the East Wing to build Donald Trump’s ballroom",
    "description": "The White House has started tearing down part of the East Wing, the traditional base of operations for the first lady, to build US President Donald Trump’s 250 million dollar ballroom.",
    "link": "https://www.independent.ie/world-news/north-america/white-house-starts-demolishing-part-of-the-east-wing-to-build-donald-trumps-ballroom/a1753336167.html",
    "timestamp": "2025-10-21T11:20:06Z"
  },
  {
    "title": "GM boosts full-year outlook as it foresees a smaller impact from tariffs and 3Q results top Street",
    "description": "General Motors anticipates a smaller impact from tariffs and is boosting its full-year adjusted earnings forecast as its third-quarter performance topped...",
    "link": "https://finance.yahoo.com/news/gm-boosts-full-outlook-foresees-111934512.html",
    "timestamp": "2025-10-21T11:19:34Z"
  },
  {
    "title": "Stocks rise and gold dips as investors regain confidence",
    "description": "LONDON (Reuters) -Stocks edged up on Tuesday, taking comfort from a possible easing in trade tensions between the U. and China and an ebbing of nerves over...",
    "link": "https://finance.yahoo.com/news/stocks-rise-gold-dips-investors-111920959.html",
    "timestamp": "2025-10-21T11:19:20Z"
  },
  {
    "title": "Poland warns Russia's Putin against crossing its airspace for Trump summit",
    "description": "WARSAW (Reuters) -Poland warned Russia's President Vladimir Putin on Tuesday against travelling through its airspace for a summit in Hungary with U.S. President Donald Trump, saying it could be forced to execute an international arrest warrant if he did. Read…",
    "link": "https://www.thestar.com.my/news/world/2025/10/21/poland-warns-russia039s-putin-against-crossing-its-airspace-for-trump-summit",
    "timestamp": "2025-10-21T11:18:00Z"
  },
  {
    "title": "Donald Trump is copying the wrong things from China, writes Dan Wang",
    "description": "Donald Trump is copying the wrong things from China, writes Dan Wang\nAmerica is getting authoritarianism without the good stuff\nDONALD TRUMP rarely passes up an opportunity to praise Xi Jinping. Over the years, Mr Trump has regularly buttered up China’s leade…",
    "link": "https://biztoc.com/x/cac080f5c4827b86",
    "timestamp": "2025-10-21T11:16:56Z"
  },
  {
    "title": "Reliance grabs Mideast oil as Russian flows scrutinized",
    "description": "On top of the flurry of spot purchases, Reliance has also been making enquiries to a large number of potential counterparties about the availability of oil from the region of quality similar to Russian crude",
    "link": "https://www.bloomberg.com/news/articles/2025-10-21/india-s-reliance-grabs-mideast-oil-as-russian-flows-scrutinized",
    "timestamp": "2025-10-21T11:16:41Z"
  },
  {
    "title": "Donald Trump Fires Back at Rupert Murdoch in Epstein Lawsuit",
    "description": "Trump’s lawsuit challenges The Wall Street Journal’s reporting standards and tests the limits of press freedom.",
    "link": "https://biztoc.com/x/9b052d94c48c905a",
    "timestamp": "2025-10-21T11:16:34Z"
  },
  {
    "title": "Shraddha Arya celebrates twins’ first Diwali with husband Rahul Nagal, calls it 'sabse pyaari Diwali'",
    "description": "Television star Shraddha Arya celebrated her twins' inaugural Diwali, sharing joyous family moments with husband Rahul Nagal. The actress expressed her delight, calling the festival \"extra special\" with her little ones, Siya and Shaurya, marking their first f…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/shraddha-arya-celebrates-twins-first-diwali-with-husband-rahul-nagal-calls-it-sabse-pyaari-diwali/articleshow/124718388.cms",
    "timestamp": "2025-10-21T11:16:23Z"
  },
  {
    "title": "Mukesh Ambani's Reliance grabs mideast oil as Russian flows face US scrutiny",
    "description": "Reliance Industries Ltd. is exploring new crude oil sources beyond Russia. The Indian refiner bought Middle Eastern crudes recently. This shift comes amid Western pressure on Russian oil flows. An upcoming European Union ban on fuel from Russian crude also in…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/mukesh-ambanis-reliance-grabs-mideast-oil-as-russian-flows-russian-flows-face-us-scrutiny/articleshow/124720313.cms",
    "timestamp": "2025-10-21T11:16:14Z"
  },
  {
    "title": "Europeans say Ukraine battle lines must be start point for talks, as Trump-Putin summit plans hit snags",
    "description": "(Reuters) -European leaders said on Tuesday that current battle lines in Ukraine must be the starting point for any peace talks, as preparations for a summit between Donald Trump and Vladimir Putin appeared to have hit a snag. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/21/europeans-say-ukraine-battle-lines-must-be-start-point-for-talks-as-trump-putin-summit-plans-hit-snags",
    "timestamp": "2025-10-21T11:16:00Z"
  },
  {
    "title": "Trump Administration Announces New Wave of Student Loan Forgiveness for Millions of Borrowers",
    "description": "The White House announced a new wave of student loan forgiveness that will affect more than 2.5 million borrowers across the United States.",
    "link": "https://www.ibtimes.com/trump-administration-announces-new-wave-student-loan-forgiveness-millions-borrowers-3787797",
    "timestamp": "2025-10-21T11:15:13Z"
  },
  {
    "title": "SCOOP: Trump-backed former Navy SEAL launches GOP primary challenge against Massie",
    "description": "FIRST ON FOX - A former longtime Navy SEAL and fifth-generation Kentucky farmer who is backed by President Donald Trump on Tuesday declared his candidacy in the state's 4th Congressional District, as he challenges Republican Rep. Thomas Massie in next year's …",
    "link": "https://freerepublic.com/focus/f-news/4347678/posts",
    "timestamp": "2025-10-21T11:14:23Z"
  },
  {
    "title": "Woman Who Cast Dead Mom’s Ballot For Trump Given Unusual Homework By Judge",
    "description": "Danielle Christine Miller's sentence also included supervised probation and a fine.",
    "link": "https://www.huffpost.com/entry/voting-felony-minnesota-trump_n_68f76655e4b0dbac4590da03",
    "timestamp": "2025-10-21T11:14:05Z"
  },
  {
    "title": "Karine Jean-Pierre's Take on Joe Biden's Mental Health Is a Trainwreck",
    "description": "Former Biden White House Press Secretary Karine Jean-Pierre is making the rounds, promoting her new book Independent, which is routine...",
    "link": "https://townhall.com/tipsheet/mattvespa/2025/10/21/karine-jean-pierres-take-on-joe-bidens-mental-health-is-a-trainwreck-n2665230",
    "timestamp": "2025-10-21T11:11:54Z"
  },
  {
    "title": "Trump Reportedly Considering Commuting Diddy’s Prison Sentence",
    "description": "Diddy could be a free man as early as this week with the help of President Donald Trump. According to TMZ, Trump is considering commuting the Bad Boy mogul’s four-year prison sentence on prostitution-related charges. A high-ranking White House official told t…",
    "link": "http://hiphopdx.com/news/donald-trump-diddy-sentence-commute/",
    "timestamp": "2025-10-21T11:08:30Z"
  },
  {
    "title": "John Bolton charged over classified emails after Iranian hack of his AOL account",
    "description": "Former US national security adviser John Bolton is the latest in a line of Donald Trump's critics to find themselves on the sharp end of charges from the US Department of Justice.\n\nBolton, who left the White Hose in 2021 and wrote a tell-all memoir describing…",
    "link": "https://www.bitdefender.com/en-us/blog/hotforsecurity/john-bolton-charged-over-classified-emails-after-iranian-hack-of-his-aol-account",
    "timestamp": "2025-10-21T11:08:26Z"
  },
  {
    "title": "U.S. stock market futures today, 21 October, 2025: Dow, S&P 500, and Nasdaq futures dip as Wall Street awaits Netflix, Tesla, and Coca-Cola earnings — market rally pauses after peak gains, investors eye Fed rate cuts and tech results",
    "description": "U.S. stock futures slipped slightly on Tuesday after a strong Wall Street rally to start the week. Investors turned cautious ahead of key earnings from Netflix, Tesla, and Coca-Cola. Dow futures fell 69 points (–0.2%), while S&P 500 and Nasdaq futures each di…",
    "link": "https://m.economictimes.com/news/international/us/u-s-stock-market-futures-today-21-october-2025-dow-sp-500-and-nasdaq-futures-dip-as-wall-street-awaits-netflix-tesla-and-coca-cola-earnings-market-rally-pauses-after-peak-gains-investors-eye-fed-rate-cuts-and-tech-results/articleshow/124719983.cms",
    "timestamp": "2025-10-21T11:07:52Z"
  },
  {
    "title": "Morning Joe Hosts Shred ‘Painful’ White House East Wing Demolition: ‘History Torn to Shreds’",
    "description": "Morning Joe hosts slammed Trump for \"taking a wrecking ball\" to the White House’s East Wing.\nThe post Morning Joe Hosts Shred ‘Painful’ White House East Wing Demolition: ‘History Torn to Shreds’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/morning-joe-hosts-shred-painful-white-house-east-wing-demolition-history-torn-to-shreds/",
    "timestamp": "2025-10-21T11:07:03Z"
  },
  {
    "title": "Syria hopes to have US sanctions formally lifted in coming months, says economy minister",
    "description": "LONDON (Reuters) -Syria hopes that U.S. sanctions against the country will be formally lifted in the coming months, the country's Economy Minister Mohammad Nidal al-Shaar told Reuters on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/21/syria-hopes-to-have-us-sanctions-formally-lifted-in-coming-months-says-economy-minister",
    "timestamp": "2025-10-21T11:07:00Z"
  },
  {
    "title": "US Vice President Vance In Israel To Shore Up Gaza Deal",
    "description": "US Vice President JD Vance landed in Israel on Tuesday to shore up a fragile Gaza ceasefire deal, after President Donald Trump warned Hamas it would be wiped out if it breached the truce.",
    "link": "https://www.ibtimes.com/us-vice-president-vance-israel-shore-gaza-deal-3787799",
    "timestamp": "2025-10-21T11:06:19Z"
  },
  {
    "title": "US Vice President Vance In Israel To Shore Up Gaza Deal",
    "description": "US Vice President JD Vance landed in Israel on Tuesday to shore up a fragile Gaza ceasefire deal, after President Donald Trump warned Hamas it would be wiped out if it breached the truce.",
    "link": "https://www.ibtimes.com.au/us-vice-president-vance-israel-shore-gaza-deal-1860931",
    "timestamp": "2025-10-21T11:06:18Z"
  },
  {
    "title": "Russia Responds to Reports Trump, Putin Can Travel on Same Plane",
    "description": "The spokesperson for President Vladimir Putin dismissed media reports on the possibility that the Russian leader could travel to the proposed Budapest summit on the same plane as U.S. President Donald Trump.\nPutin faces a logistical problem in traveling to th…",
    "link": "https://biztoc.com/x/d16157c734ae31f0",
    "timestamp": "2025-10-21T11:05:57Z"
  },
  {
    "title": "Golden Buddha: World’s largest solid gold statue that remained hidden in clay for centuries",
    "description": "A magnificent solid gold Buddha statue, weighing over 12,000 pounds, was discovered in Thailand after being hidden under plaster for centuries. This priceless religious icon, worth millions, showcases Thailand's rich artistry and spiritual heritage. Its accid…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/golden-buddha-worlds-largest-solid-gold-statue-that-remained-hidden-in-clay-for-centuries/articleshow/124720045.cms",
    "timestamp": "2025-10-21T11:05:53Z"
  },
  {
    "title": "US, Australia Sign $8.5bn Deal on Rare Earth, Gallium Projects",
    "description": "Australia and the United States have signed a major agreement on critical minerals in a bid to negate China’s dominance in the rare earths and gallium sectors.\nUS President Donald Trump and Australian Prime Minister Anthony Albanese signed the $8.5-billion de…",
    "link": "https://biztoc.com/x/82341aa2d67e6742",
    "timestamp": "2025-10-21T11:05:48Z"
  },
  {
    "title": "He's Tearing Down The White House. Tabs, Tues., Oct. 21, 2015",
    "description": "Is that cool, or ... ?",
    "link": "https://www.wonkette.com/p/hes-tearing-down-the-white-house",
    "timestamp": "2025-10-21T11:02:27Z"
  },
  {
    "title": "Oil Inches Up as Traders Weigh Surplus and US-China Trade Talks",
    "description": "Oil inched higher as traders weigh signs of oversupply against the outlook for a trade deal between the US and China.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-inches-up-as-traders-weigh-surplus-and-us-china-trade-talks",
    "timestamp": "2025-10-21T11:02:13Z"
  },
  {
    "title": "US pauses Russia sanctions push",
    "description": "The Senate has postponed discussions on the ‘Sanctioning Russia Act’ until after Donald Trump’s summit with Vladimir Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626756-us-senate-pause-russia-sanctions/",
    "timestamp": "2025-10-21T11:01:44Z"
  },
  {
    "title": "No Kings hit-and-run suspect says cops gave him 'a total thumbs-up' after crash",
    "description": "A man accused of striking protesters with his pickup at a No Kings demonstration in northeast Ohio and then driving off insists he did not intend to hit anyone.The Canton Repository tracked down the 77-year-old man who allegedly drove off the side of the road…",
    "link": "https://www.rawstory.com/no-kings-protest-2674217571/",
    "timestamp": "2025-10-21T11:01:42Z"
  },
  {
    "title": "Most Americans worry about health care costs: AP-NORC poll",
    "description": "A new poll finds most U.S. adults are worried about health care becoming more expensive",
    "link": "https://www.wftv.com/news/business/what-americans-think/74G766OASI4ADNNRVQURT4TSLI/",
    "timestamp": "2025-10-21T11:01:41Z"
  },
  {
    "title": "Minnesota Attorney General Keith Ellison announces run for third term",
    "description": "Minnesota Attorney General Keith Ellison has announced he is running for reelection. He sat down on Monday with WCCO to share his decision.",
    "link": "https://www.cbsnews.com/minnesota/news/minnesota-attorney-general-keith-ellison-running-third-term/",
    "timestamp": "2025-10-21T11:01:00Z"
  },
  {
    "title": "The Young Disciples of Angelicism01",
    "description": "In the years after lockdown, four young women roamed lower Manhattan with their lives and work guided by an online presence named Angelicism01, whose face they’d never seen.",
    "link": "http://www.thecut.com/article/angelicism01-girls-lower-manhattan-online-substack.html",
    "timestamp": "2025-10-21T11:00:36Z"
  },
  {
    "title": "Do ‘Deeply Feeling Kids’ Really Exist?",
    "description": "Dr. Becky’s concept is hugely influential. But is it preventing some neurodivergent children from getting diagnoses?",
    "link": "http://www.thecut.com/article/deeply-feeling-kids-dr-becky-neurodivergence.html",
    "timestamp": "2025-10-21T11:00:36Z"
  },
  {
    "title": "India's Reliance Boosts Middle East Crude Purchases",
    "description": "Reliance Industries, the top private refiner in India, has accelerated crude oil purchases from the Middle East, traders told Bloomberg on Tuesday, as the fate of Russian barrels going to India remains unclear.  Reliance, which typically buys crude from the M…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Indias-Reliance-Boosts-Middle-East-Crude-Purchases.html",
    "timestamp": "2025-10-21T11:00:33Z"
  },
  {
    "title": "Fortnight to Election Day: 5 key 2025 races to watch",
    "description": "Rep. Mikie Sherrill and Jack Ciattarelli compete in a tight New Jersey gubernatorial race with polls showing a narrowing gap two weeks before Election Day.",
    "link": "https://www.foxnews.com/politics/fortnight-election-day-5-key-2025-races-watch",
    "timestamp": "2025-10-21T11:00:32Z"
  },
  {
    "title": "22 times Donald Trump has dumped a number 2 on America",
    "description": "The abhorrent wannabe dictator Donald Trump\r\n (a.k.a. Mr. Sludge) reposted a repugnant AI-generated video after the “No Kings” protests over the weekend. The protests drew an astounding 7 million\r\n participants. It was overwhelming, and when Trump is beaten, …",
    "link": "https://www.advocate.com/voices/22-times-trump-craps-america",
    "timestamp": "2025-10-21T11:00:04Z"
  },
  {
    "title": "If Trump Wants Peace, He’ll Need to Go to War With Israel’s Hard Right",
    "description": "Israel’s hard right isn’t giving up on settling Gaza. But the president can restrain it.",
    "link": "https://www.theatlantic.com/international/archive/2025/10/trump-israel-settler-right/684627/",
    "timestamp": "2025-10-21T11:00:00Z"
  },
  {
    "title": "Sask. town thankful Americans keep flocking here to hunt, amid Canada-U.S. tensions",
    "description": "For decades, American hunters have come to Gravelbourg to hunt geese and ducks near the town southwest of Regina, fuelling the multimillion-dollar outfitting industry. While Canada-U.S. tensions might have ruffled some feathers, outdoor opportunities and frie…",
    "link": "https://www.cbc.ca/news/canada/saskatchewan/american-hunters-saskatchewan-9.6942740",
    "timestamp": "2025-10-21T11:00:00Z"
  },
  {
    "title": "Apple attacks EU crackdown in digital law’s biggest court test",
    "description": "Apple Inc. launched a significant legal challenge against the EU's Digital Markets Act, arguing the antitrust rules impose \"hugely onerous and intrusive burdens\" on its rights. The iPhone maker contends the DMA's interoperability mandates and App Store regula…",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-attacks-eu-crackdown-in-digital-laws-biggest-court-test/articleshow/124719977.cms",
    "timestamp": "2025-10-21T10:56:35Z"
  },
  {
    "title": "The UAW, Internationalism, and May Day 2026",
    "description": "Just two months ago, my union—the United Automobile Workers—did a remarkable thing. It made public its pledge to fight for the rights of autoworkers—not its own dues-paying members, but workers overseas—based on the slogan, “An injury to one is an injury to a…",
    "link": "https://www.commondreams.org/opinion/uaw-may-day-2026",
    "timestamp": "2025-10-21T10:56:03Z"
  },
  {
    "title": "Links 10/21/2025",
    "description": "Our daily links, including Trump-Putin meeting falls apart, microplastics treatments, ICE buying chemical weapons, and AI vacations.",
    "link": "https://www.nakedcapitalism.com/2025/10/links-10-21-2025.html",
    "timestamp": "2025-10-21T10:55:38Z"
  },
  {
    "title": "U.S. Vice President JD Vance arrives in Israel to shore up the fragile ceasefire in Gaza",
    "description": "US Vice President JD Vance is in Israel to strengthen a fragile Gaza ceasefire. The plan faces challenges after recent violence. A released hostage's body was identified. Hamas says it is committed to ending the war. The exchange of bodies between Israel and …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/u-s-vice-president-jd-vance-arrives-in-israel-to-shore-up-the-fragile-ceasefire-in-gaza/articleshow/124720000.cms",
    "timestamp": "2025-10-21T10:55:16Z"
  },
  {
    "title": "US Fed to trim rates twice more this year; 2026 rate path very unclear",
    "description": "BENGALURU (Reuters) -The Federal Reserve will lower its key interest rate by 25 basis points next week and again in December, according to a Reuters poll of ...",
    "link": "https://finance.yahoo.com/news/us-fed-trim-rates-twice-105453261.html",
    "timestamp": "2025-10-21T10:54:53Z"
  },
  {
    "title": "Earnings wave checks trade and shutdown hopes",
    "description": "and global markets today , Editor-At-Large, Finance and Markets While U. and world markets got a bounce to start the week, spurred by optimism on trade...",
    "link": "https://finance.yahoo.com/news/earnings-wave-checks-trade-shutdown-105255182.html",
    "timestamp": "2025-10-21T10:52:55Z"
  },
  {
    "title": "Will the Trump bubble burst sooner than you think?",
    "description": "Donald Trump has built his entire political project on hype and delusion … the same ingredients that fuel every economic bubble. But belief cannot defy reality forever. When cruelty replaces competence and lies replace truth, collapse follows.",
    "link": "https://thecuriousbrain.com/?p=149158",
    "timestamp": "2025-10-21T10:52:06Z"
  },
  {
    "title": "US Fed to trim rates twice more this year; 2026 rate path very unclear",
    "description": "Economists polled by Reuters anticipate the Federal Reserve will implement two 25-basis-point interest rate cuts this year, with the first expected next week. This shift in forecast reflects a growing concern among policymakers about the labor market's weaken…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-fed-to-trim-rates-twice-more-this-year-2026-rate-path-very-unclear/articleshow/124719942.cms",
    "timestamp": "2025-10-21T10:51:21Z"
  },
  {
    "title": "Belize agrees to host migrants seeking asylum in US",
    "description": "Belize's prime minister says the deal will mean that migrants can apply for asylum in the country.",
    "link": "https://www.bbc.com/news/articles/c07mze191xko",
    "timestamp": "2025-10-21T10:46:07Z"
  },
  {
    "title": "World markets are mostly higher after Wall Street rally",
    "description": "Shares in Europe and Asia are mostly higher, with Japan's benchmark creeping closer to the symbolically important 50,000 level as conservative lawmaker Sanae Takaichi became the country's first female prime minister",
    "link": "https://abcnews.go.com/US/wireStory/world-markets-higher-after-wall-street-rally-126708344",
    "timestamp": "2025-10-21T10:45:52Z"
  },
  {
    "title": "Western Media Finally Admit That Trump’s Mobilisation of Forces Against Venezuela Is All About Regime Change",
    "description": "CNN has even published an article highlighting the \"dark history of the CIA and regime change\", not just in Latin America but around the world.",
    "link": "https://www.nakedcapitalism.com/2025/10/western-media-finally-admits-that-trumps-mobilisation-of-forces-against-venezuela-is-all-about-regime-change.html",
    "timestamp": "2025-10-21T10:45:37Z"
  },
  {
    "title": "Donald Trump’s “No Kings” sewage video is no joke",
    "description": "The president's scatological video shows his contempt for democracy",
    "link": "https://www.salon.com/2025/10/21/donald-trumps-no-kings-sewage-video-is-no-joke/",
    "timestamp": "2025-10-21T10:45:35Z"
  },
  {
    "title": "Moscow responds to claim that Russia-US meeting on hold",
    "description": "Russian officials say Ukraine’s backers in the EU are using media “infodumps” in a bid to sabotage the proposed Putin-Trump summit Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626753-budapest-summiut-cnn-claims/",
    "timestamp": "2025-10-21T10:44:05Z"
  },
  {
    "title": "Trump wants the IRS to investigate his foes. That won't play out the way he thinks",
    "description": "President Donald Trump is committed to using every tool at his disposal to exact retribution on his political enemies, and now he has turned his attention to the Internal Revenue Service",
    "link": "https://biztoc.com/x/c8bb6ee75e185809",
    "timestamp": "2025-10-21T10:43:27Z"
  },
  {
    "title": "AMA unveils Center for Digital Health and AI",
    "description": "The new center aims to create opportunities for physicians to shape the development and regulation of health AI and digital health tools.",
    "link": "https://www.techtarget.com/healthtechanalytics/news/366633199/AMA-unveils-Center-for-Digital-Health-and-AI",
    "timestamp": "2025-10-21T10:42:00Z"
  },
  {
    "title": "Analysis-Italy's Meloni marks three years in power, embracing stability over growth",
    "description": "ROME (Reuters) -Three years after winning power, Giorgia Meloni has consolidated her position at the helm of Italian politics, defying the economic headwinds and international uncertainty that have unsettled many of her European counterparts. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/21/analysis-italy039s-meloni-marks-three-years-in-power-embracing-stability-over-growth",
    "timestamp": "2025-10-21T10:36:00Z"
  },
  {
    "title": "Diwali is timeless reminder of light’s victory over darkness: Trump wishes Americans celebrating Diwali",
    "description": "US President Donald Trump conveyed his Diwali greetings to Americans. He described the Festival of Lights as a time for families and friends to unite. Trump emphasized Diwali as a reminder of light's triumph over darkness. He stated that the observance signif…",
    "link": "https://economictimes.indiatimes.com/news/india/diwali-is-timeless-reminder-of-lights-victory-over-darkness-trump-wishes-american-celebrating-diwali/articleshow/124719580.cms",
    "timestamp": "2025-10-21T10:35:49Z"
  },
  {
    "title": "Northrop raises annual profit forecast on strong demand",
    "description": "(Reuters) -Northrop Grumman raised its 2025 profit forecast for a second straight quarter on Tuesday, as the defense contractor expects continued demand for ...",
    "link": "https://finance.yahoo.com/news/northrop-raises-annual-profit-forecast-103504064.html",
    "timestamp": "2025-10-21T10:35:04Z"
  },
  {
    "title": "US Fed to trim rates twice more this year; 2026 rate path very unclear",
    "description": "BENGALURU (Reuters) -The Federal Reserve will lower its key interest rate by 25 basis points next week and again in December, according to a Reuters poll of ...",
    "link": "https://finance.yahoo.com/news/us-fed-trim-rates-twice-103406753.html",
    "timestamp": "2025-10-21T10:34:06Z"
  },
  {
    "title": "Trump's $8.5 Billion Deal With Australia Challenges Chinese Dominance",
    "description": "President Donald Trump and Australian Prime Minister Anthony Albanese on Monday signed a multibillion-dollar partnership at the White House. The goal is to secure the future of global critical mineral supply chains and strengthen defense cooperation.\nNew Fram…",
    "link": "https://biztoc.com/x/11d993325d99baf6",
    "timestamp": "2025-10-21T10:31:54Z"
  },
  {
    "title": "“No Kings” missed the mark. Here’s how we can fix that",
    "description": "Opposing Donald Trump is not enough for No Kings to be truly successful",
    "link": "https://www.salon.com/2025/10/21/no-kings-missed-the-mark-heres-how-we-can-fix-that/",
    "timestamp": "2025-10-21T10:30:09Z"
  },
  {
    "title": "Russian oil supplies to India continuing – deputy foreign minister",
    "description": "India is importing crude from Russia despite Trump’s claim that it will stop such purchases, Andrey Rudenko has said Read Full Article at RT.com",
    "link": "https://www.rt.com/india/626754-russian-oil-supplies-to-india/",
    "timestamp": "2025-10-21T10:27:04Z"
  },
  {
    "title": "US Government Shutdown Latest Update — White House Hints At Breakthrough 'Within Days'",
    "description": "A senior White House adviser says the 20-day US government shutdown could end this week, as negotiations over ACA funding show early signs of progress despite gridlock.",
    "link": "https://www.ibtimes.com/us-government-shutdown-latest-update-white-house-hints-breakthrough-within-days-3787788",
    "timestamp": "2025-10-21T10:22:38Z"
  },
  {
    "title": "Diddy Combs Sentencing: Will Trump commute his 4-Year Prison Term and set him free this week? Rapper to appeal in court",
    "description": "Sean Diddy Combs will challenge his conviction and four-year prison sentence. His legal team said that a notice of appeal has been submitted to the Federal District Court in New York. The 55-year-old artist was sentenced earlier this month to 50 months in pri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/diddy-combs-sentencing-will-trump-commute-his-4-year-prison-term-and-set-him-free-this-week-rapper-to-appeal-in-court/articleshow/124719349.cms",
    "timestamp": "2025-10-21T10:22:07Z"
  },
  {
    "title": "Sanders: Trump Having Gov't Take Share of Companies Is One of My Ideas",
    "description": "During an interview with Comedy Central’s “The Daily Show” on Monday, Sen. Bernie Sanders (I-VT) stated that President Donald Trump’s policy of having the government take ownership of part of companies is Sanders’ ideas. Host Jon Stewart said, “[Y]our message…",
    "link": "https://www.breitbart.com/clips/2025/10/21/sanders-trump-having-govt-take-share-of-companies-is-one-of-my-ideas/",
    "timestamp": "2025-10-21T10:21:49Z"
  },
  {
    "title": "Trump’s First 2026 Fundraiser Goes to Congress Hawk Graham",
    "description": "US President Donald Trump is set to support South Carolina Republican Sen. Lindsey Graham* at a fundraiser and golf tournament next month, according to US media reports.",
    "link": "https://sputnikglobe.com/20251021/trumps-first-2026-fundraiser-goes-to-congress-hawk-graham-1122996623.html",
    "timestamp": "2025-10-21T10:20:16Z"
  },
  {
    "title": "Who’s Delusional, Who’s Drugged, Who’s Disinformed? It’s Hard to Tell",
    "description": "From Trump on down to the voters, it's almost impossible to figure out who is delusional, who's drugged, and who's been disinformed.",
    "link": "https://www.nakedcapitalism.com/2025/10/trump-delusional-drugged-disinformed.html",
    "timestamp": "2025-10-21T10:20:03Z"
  },
  {
    "title": "Concerned carmakers race to beat China's rare earths deadline",
    "description": "By Nick Carey and Christina Amann LONDON/BERLIN (Reuters) -Global automakers are scouring the globe for crucial rare earths ahead of looming Chinese export...",
    "link": "https://finance.yahoo.com/news/concerned-carmakers-race-beat-chinas-101632202.html",
    "timestamp": "2025-10-21T10:16:32Z"
  },
  {
    "title": "Watch Margaret Hoover’s Justice Kennedy Interview To See Why Trust In Media Is At Record Lows",
    "description": "Margaret Hoover used her interview with Anthony Kennedy to attempt to discredit SCOTUS and bait the retired justice into attacking Trump.",
    "link": "https://thefederalist.com/2025/10/21/watch-margaret-hoovers-justice-kennedy-interview-to-see-why-trust-in-media-is-at-record-lows/",
    "timestamp": "2025-10-21T10:12:00Z"
  },
  {
    "title": "Stephen Colbert Offers Dietary Advice to ‘King Trump’ After ‘Insane’ AI Poop Video",
    "description": "Colbert tore into Trump for his \"insane\" but \"accurate\" AI-generated video depicting himself flying a fighter jet and dumping feces on Americans.\nThe post Stephen Colbert Offers Dietary Advice to ‘King Trump’ After ‘Insane’ AI Poop Video first appeared on Med…",
    "link": "https://www.mediaite.com/media/tv/stephen-colbert-offers-dietary-advice-to-king-trump-after-insane-ai-poop-video/",
    "timestamp": "2025-10-21T10:09:46Z"
  },
  {
    "title": "Kremlin says it does not have dates for Putin-Trump summit",
    "description": "MOSCOW (Reuters) -The Kremlin said on Tuesday that the timing of a potential summit between Vladimir Putin and Donald Trump was unclear and that no dates had been mentioned. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/21/kremlin-says-it-does-not-have-dates-for-putin-trump-summit",
    "timestamp": "2025-10-21T10:09:00Z"
  },
  {
    "title": "Who is Paul Ingrassia? Trump nominee facing massive backlash for boasting 'Nazi streak' chats",
    "description": "Paul Ingrassia, nominated by Donald Trump for Special Counsel, is under fire. Leaked messages reveal Ingrassia made racist remarks and expressed a \"Nazi streak.\" His Senate confirmation is now in serious jeopardy. Ingrassia previously served as White House li…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-who-is-paul-ingrassia-trump-nominee-facing-massive-backlash-for-boasting-nazi-streak-chats/articleshow/124719103.cms",
    "timestamp": "2025-10-21T10:07:38Z"
  },
  {
    "title": "Stubb, European leaders: \"Putin continues to choose violence and destruction\"",
    "description": "Finnish leaders are to join meetings this week aimed at long-term financial support for Ukraine funded by frozen Russian assets.",
    "link": "https://yle.fi/a/74-20189546",
    "timestamp": "2025-10-21T10:05:48Z"
  },
  {
    "title": "White House’s East Wing partially demolished as work begins on Trump’s $250m ballroom",
    "description": "Critics denounce US president’s ‘vanity project’",
    "link": "https://www.irishtimes.com/world/us/2025/10/21/white-houses-east-wing-partially-demolished-as-work-begins-on-trumps-250m-ballroom/",
    "timestamp": "2025-10-21T10:05:13Z"
  }
]