[
  {
    "title": "We Must Resist Trump’s War Agenda At Home And Abroad",
    "description": "As Donald Trump continues to ramp up his immigration raids and slash social programs, one theme is consistent through his press conferences and executive orders: class war. Not just the one enforced by ICE raids, mass kidnappings, and deportations, but one th…",
    "link": "https://www.counterpunch.org/2025/11/18/we-must-resist-trumps-war-agenda-at-home-and-abroad/",
    "timestamp": "2025-11-18T06:55:59Z"
  },
  {
    "title": "Trump says he'll sell Saudis F-35s as crown prince set to visit White House",
    "description": "Mohammed bin Salman steps foot in the U.S. for the first time since Saudi critic Jamal Khashoggi's 2018 murder that caused global outrage.",
    "link": "https://abcnews.go.com/Politics/saudi-crown-prince-marks-return-us-after-7/story?id=127594469",
    "timestamp": "2025-11-18T06:54:07Z"
  },
  {
    "title": "Saudi crown prince to visit U.S. for the first time since Khashoggi scandal",
    "description": "U.S. President Donald Trump is set to meet with Saudi Arabia's Crown Prince Mohammed bin Salman on Tuesday, with the leaders expected to discuss the deepening of trade and technology ties, artificial intelligence, security and nuclear energy.\nThe trip follows…",
    "link": "https://biztoc.com/x/bdecf7d2cfdbcf32",
    "timestamp": "2025-11-18T06:48:12Z"
  },
  {
    "title": "Asian shares skid after Nvidia and other tech superstars pull Wall Street lower",
    "description": "The U.S. stock market is falling again following a sell-off that swept Europe and Asia. The S&P 500 dropped 0.2% Tuesday and pulled further from its record set late last month. The Dow Jones Industrial Average fell 282 points, and the Nasdaq composite sank 0.…",
    "link": "https://apnews.com/article/stock-markets-nvidia-rates-ai-trump-31160bebd7ab48cdb8e26aa0ad9a3dc8",
    "timestamp": "2025-11-18T06:44:41Z"
  },
  {
    "title": "Merz, Macron to push for European digital ‘sovereignty’",
    "description": "German Chancellor Friedrich Merz and French President Emmanuel Macron will join forces Tuesday to push for greater European digital “sovereignty” and less dependence on US tech titans as the AI race gathers pace. The leaders of Europe’s biggest economies will…",
    "link": "https://www.digitaljournal.com/world/merz-macron-to-push-for-european-digital-sovereignty/article",
    "timestamp": "2025-11-18T06:42:32Z"
  },
  {
    "title": "Trump says inflation back to \"normal\" levels, vows further price relief",
    "description": "Trump argued that his economic policies had helped return inflation to what he described as \"normal\" levels and promised further progress in easing expenses for households",
    "link": "https://www.thehindubusinessline.com/news/world/trump-says-inflation-back-to-normal-levels-vows-further-price-relief/article70293516.ece",
    "timestamp": "2025-11-18T06:41:20Z"
  },
  {
    "title": "Saudi crown prince to visit U.S. for the first time since Khashoggi scandal",
    "description": "The trip follows Trump's visit to Saudi Arabia in May in which the kingdom made a $600 billion trade and investment commitment to the U.S.",
    "link": "https://www.cnbc.com/2025/11/18/saudi-crown-prince-to-visit-us-for-first-time-since-khashoggi-death.html",
    "timestamp": "2025-11-18T06:37:58Z"
  },
  {
    "title": "Monthly Ozempic Cost Slashed After Trump Deal",
    "description": "Topline\nNovo Nordisk on Monday lowered the direct-to-consumer prices of its weight loss drug Wegovy and diabetes treatment Ozempic in a challenge to Eli Lilly’s Zepbound after President Donald Trump announced a deal with the pharmaceutical firms to reduce the…",
    "link": "https://biztoc.com/x/f8a7ce3fe647bd4f",
    "timestamp": "2025-11-18T06:37:05Z"
  },
  {
    "title": "Security Council to vote on new Gaza force: Here's what you need to know",
    "description": "The UN Security Council is expected to vote at 5pm in New York today on a US-sponsored draft resolution that would authorise the creation of an international stabilisation force in the Gaza Strip.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251117-unnews03.htm",
    "timestamp": "2025-11-18T06:35:25Z"
  },
  {
    "title": "Iran's Judiciary orders Attorney General to pursue US accountability for illegal aggression",
    "description": "Iran's Judiciary chief has instructed the Attorney General to pursue Washington's accountability for Israel's blatant aggression against the Islamic Republic in June, following US President Donald Trump's recent admission of a direct role in the illegal assau…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/11/iran-251117-presstv02.htm",
    "timestamp": "2025-11-18T06:35:13Z"
  },
  {
    "title": "Israeli minister urges assassination of PA officials if UN backs Palestinian state",
    "description": "Israeli minister Itamar Ben-Gvir has called for the assassination of Palestinian Authority (PA) officials if the United Nations endorses a plan on postwar management of the Gaza Strip that mentions Palestinian statehood.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251117-presstv02.htm",
    "timestamp": "2025-11-18T06:35:13Z"
  },
  {
    "title": "UN Security Council authorizes temporary international force for Gaza",
    "description": "The UN Security Council adopted a resolution on Monday that endorses a peace plan for Gaza put forward by United States President Donald Trump and a temporary international force in the enclave following two years of war.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251117-unnews02.htm",
    "timestamp": "2025-11-18T06:34:49Z"
  },
  {
    "title": "US naval operations chief maintains ambiguity, 'not surprised' by Takaichi's remarks; US aims to exploit crisis to tighten control over ally, says expert",
    "description": "Amid the fierce tension flared up between China and Japan because of Japanese Prime Minister Sanae Takaichi's recent erroneous remarks on Taiwan, Admiral Daryl Caudle, US chief of naval operations who is visiting Japan, told local media Monday that he was \"no…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251118-globaltimes01.htm",
    "timestamp": "2025-11-18T06:34:32Z"
  },
  {
    "title": "Ecuadorians reject proposal on return of US military bases in referendum",
    "description": "Ecuadorian voters have rejected a proposal to permit the return of US military bases, according to preliminary referendum results.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251117-presstv07.htm",
    "timestamp": "2025-11-18T06:34:31Z"
  },
  {
    "title": "US escalates pressure campaign against Venezuela with new terror designation",
    "description": "The United States will designate the so-called Cartel de los Soles, which Washington claims is led by President Nicolás Maduro and senior Venezuelan officials, as an illegal criminal organization this month.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251117-presstv06.htm",
    "timestamp": "2025-11-18T06:34:31Z"
  },
  {
    "title": "Trump Still Mulling Land Operation in Venezuela, Opting for Diplomacy - Reports",
    "description": "US President Donald Trump has not yet decided whether to launch a ground attack on Venezuela, and a window for diplomacy could be emerging, CNN reported on Monday, citing a White House official and a senior US official.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251117-sputnik01.htm",
    "timestamp": "2025-11-18T06:34:31Z"
  },
  {
    "title": "Three killed in US assault on vessel in Pacific as aircraft carrier arrives in Caribbean",
    "description": "The United States carried out a lethal strike on a boat in the eastern Pacific on Saturday, killing three people, just as its most advanced aircraft carrier entered the Caribbean.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251117-presstv08.htm",
    "timestamp": "2025-11-18T06:34:31Z"
  },
  {
    "title": "Iran neither opposes negotiations nor will it abandon uranium enrichment: Senior official",
    "description": "Head of the Strategic Council on Foreign Relations Kamal Kharazi says Iran does not reject negotiations over its nuclear energy program, but will not abandon its defensive capabilities or its peaceful uranium enrichment activities.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/11/iran-251117-irna03.htm",
    "timestamp": "2025-11-18T06:34:30Z"
  },
  {
    "title": "Trump's Reason For His Raspy Voice: ‘I Blew My Stack’",
    "description": "“It’s so stupid,\" the president said.",
    "link": "https://www.huffpost.com/entry/donald-trump-raspy-voice_n_691c04f7e4b0414d84d727cd",
    "timestamp": "2025-11-18T06:33:17Z"
  },
  {
    "title": "Donald Trump To Host Cristiano Ronaldo At White House Ahead Of Saudi Crown Prince's US Visit",
    "description": "In a significant development, US President Donald Trump is set to host Portuguese football icon Cristiano Ronaldo at the White House on Wednesday, reports MSNow's White House Correspondent, Jake Traylor. Ronaldo will visit the White House on the same day as S…",
    "link": "https://www.ndtvprofit.com/sports/donald-trump-to-host-cristiano-ronaldo-at-white-house-ahead-of-saudi-crown-prince-visit-to-us",
    "timestamp": "2025-11-18T06:33:04Z"
  },
  {
    "title": "SEC makes no specific mention of crypto in 2026 exam priorities",
    "description": "The Securities and Exchange Commission’s latest examination priorities document didn’t mention crypto as an area of focus for the coming year, unlike in previous years.",
    "link": "https://cointelegraph.com/news/sec-no-mention-crypto-2026-exam-priorities",
    "timestamp": "2025-11-18T06:23:01Z"
  },
  {
    "title": "Wall St Regulator to Consider Crypto Token Classification, Chair Says",
    "description": "The head of the U.S. Securities and Exchange Commission said the agency would soon consider establishing a classification for digital assets to help determine when they can be considered securities. “In the coming months, I anticipate that the Commission will…",
    "link": "https://www.insurancejournal.com/news/national/2025/11/18/848001.htm",
    "timestamp": "2025-11-18T06:19:51Z"
  },
  {
    "title": "Risk of stretched tech stocks, and affordable housing while earning six figures",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/11/18/risk-of-stretched-tech-stocks-and-affordable-housing-while-earning-six-figures/",
    "timestamp": "2025-11-18T06:16:51Z"
  },
  {
    "title": "US lawmakers push forward Epstein Files bill despite Trump’s resistance",
    "description": "WASHINGTON: US lawmakers are expected to advance a bill on Tuesday requiring the release of government records related to millionaire sex offender Jeffrey Epstein, setting up a rare confrontation between Republican legislators and former President Donald Trum…",
    "link": "https://english.khabarhub.com/2025/18/506571/",
    "timestamp": "2025-11-18T06:15:33Z"
  },
  {
    "title": "Poor countries got $1 trillion from China. So did rich ones.",
    "description": "In recent years, China has emerged as a formidable global banking force, disbursing over a trillion dollars in loans across the globe. What once primarily served developing nations is now increasingly directed toward affluent countries.",
    "link": "https://economictimes.indiatimes.com/news/international/business/poor-countries-got-1-trillion-from-china-so-did-rich-ones-/articleshow/125403407.cms",
    "timestamp": "2025-11-18T06:11:13Z"
  },
  {
    "title": "Ahead of crucial House vote, why Trump reversed his stance on release of Epstein Files",
    "description": "The files relating to the deceased sex offender Jeffrey Epstein have hung over Trump’s second term like a dark cloud, with a collection of emails released last week referencing the current president’s proximity with the convicted financier",
    "link": "https://indianexpress.com/article/explained/explained-global/house-vote-trump-reversed-release-epstein-files-10371785/",
    "timestamp": "2025-11-18T06:08:14Z"
  },
  {
    "title": "Trump hosts Saudi prince for first time since Khashoggi killing",
    "description": "Saudi Crown Prince Mohammed bin Salman will receive a lavish welcome from US President Donald Trump on Tuesday, signing defense and nuclear deals during his first visit to the United States since the 2018 murder of journalist Jamal Khashoggi. Trump is expecte…",
    "link": "https://www.digitaljournal.com/world/trump-hosts-saudi-prince-for-first-time-since-khashoggi-killing/article",
    "timestamp": "2025-11-18T06:07:20Z"
  },
  {
    "title": "Trump claims Americans are ‘lucky’ he won 2024 elections, warns of economic ‘catastrophe’ under Kamala Harris, but inflation, job numbers tell a different story",
    "description": "President Trump declared Americans are \"so damn lucky\" he won the 2024 election, asserting Kamala Harris would have led to economic catastrophe. He criticized rising welfare and government jobs while real jobs declined. Trump also warned McDonald's franchisee…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-claims-americans-are-lucky-he-won-2024-elections-warns-of-economic-catastrophe-under-kamala-harris-but-inflation-job-numbers-tell-a-different-story/articleshow/125403242.cms",
    "timestamp": "2025-11-18T06:04:45Z"
  },
  {
    "title": "US has warned others to avoid loans from Chinese state banks. But it's the biggest recipient of all",
    "description": "For years, Washington has been warning others not to trust loans from Chinese state banks fueling its rise as a superpower.  China’s state lenders have...",
    "link": "https://www.yahoo.com/news/articles/us-warned-others-avoid-loans-060107430.html",
    "timestamp": "2025-11-18T06:01:07Z"
  },
  {
    "title": "Fintan O'Toole: Donald Trump made a fatal error when he invited vampire Jeffrey Epstein in",
    "description": "A nocturnal Count Jeffrey continues to hover at  the window of Donald Trump’s White House bedroom",
    "link": "https://www.irishtimes.com/opinion/2025/11/18/fintan-otoole-donald-trump-made-a-fatal-error-when-he-invited-vampire-jeffrey-epstein-in/",
    "timestamp": "2025-11-18T06:00:01Z"
  },
  {
    "title": "Why the Thai-Cambodia Peace Deal Is in Tatters",
    "description": "Land mines, and who planted them, have been an ongoing factor.",
    "link": "http://foreignpolicy.com/2025/11/18/thai-cambodia-peace-deal-truce-break/",
    "timestamp": "2025-11-18T06:00:01Z"
  },
  {
    "title": "Hugh Linehan: Is the BBC controversy a right-wing plot?",
    "description": "Will Donald Trump sue? And is public service broadcasting doomed?",
    "link": "https://www.irishtimes.com/media/2025/11/18/hugh-linehan-is-the-bbc-controversy-a-right-wing-plot/",
    "timestamp": "2025-11-18T06:00:01Z"
  },
  {
    "title": "Epstein explicitly claimed Trump was aware of his illegal activities in newly released emails",
    "description": "Newly released documents include emails where Jeffrey Epstein explicitly claims President Donald Trump was aware of his illegal activities, stating Trump “knew about the girls” and asked Ghislaine Maxwell to stop. In private communications, Epstein referred t…",
    "link": "https://www.naturalnews.com/2025-11-18-epstein-emails-trump-aware-of-illegal-activities.html",
    "timestamp": "2025-11-18T06:00:00Z"
  },
  {
    "title": "Trump’s weaknesses are exposed when he faces individuals of principle",
    "description": "Donald Trump, the political entertainer, stormed onto the scene in 2015 as a vessel for the frustrations of millions of Americans who were fed up with a corrupt and unaccountable political machine. His movement promised to dismantle the deep state and challen…",
    "link": "https://www.naturalnews.com/2025-11-18-trump-exposed-in-face-of-principled-leaders.html",
    "timestamp": "2025-11-18T06:00:00Z"
  },
  {
    "title": "SNAP “reset”: USDA requires recipients to reapply for benefits",
    "description": "The Trump administration is requiring every one of the 42 million SNAP (food stamp) recipients to reapply for their benefits, framing it as a fundamental “reset” of the program to combat alleged systemic fraud. The policy is driven by an ongoing USDA audit th…",
    "link": "https://www.naturalnews.com/2025-11-18-usda-requires-snap-recipients-reapply-for-benefits.html",
    "timestamp": "2025-11-18T06:00:00Z"
  },
  {
    "title": "Ukrainian strikes, sanctions fuel global diesel crisis as prices soar",
    "description": "Ukrainian drone attacks on Russian refineries, Western sanctions and refinery outages have caused diesel prices to surge in the U.S. and Europe, leading to fuel rationing and panic buying. Despite falling crude oil prices, refining margins are at record highs…",
    "link": "https://www.naturalnews.com/2025-11-18-ukrainian-strikes-sanctions-fuel-global-diesel-crisis.html",
    "timestamp": "2025-11-18T06:00:00Z"
  },
  {
    "title": "Finnish leader delivers grim forecast: No Ukraine ceasefire in 2025",
    "description": "Finnish President Alexander Stubb thinks a ceasefire or meaningful peace talks between Ukraine and Russia are unlikely to happen in 2025. He suggests the earliest possibility for progress might be early next year. Stubb urges Ukraine’s allies to “maximize pre…",
    "link": "https://www.naturalnews.com/2025-11-18-finnish-leader-forecast-no-ukraine-ceasefire-2025.html",
    "timestamp": "2025-11-18T06:00:00Z"
  },
  {
    "title": "We must stop Trump from slashing research into black holes",
    "description": "Scientists are making huge advances in understanding these keys to the universe",
    "link": "https://newhumanist.org.uk/articles/6478/we-must-stop-trump-from-slashing-research-into-black-holes#utm_source=rss",
    "timestamp": "2025-11-18T06:00:00Z"
  },
  {
    "title": "Ex-Harvard president Larry Summers apologises over Epstein emails",
    "description": "Summers says he will be taking a step back from engagements after questionable emails with Epstein made public.",
    "link": "https://www.aljazeera.com/news/2025/11/18/ex-harvard-president-larry-summers-apologises-over-epstein-emails",
    "timestamp": "2025-11-18T05:59:33Z"
  },
  {
    "title": "Seth Meyers Hits Back at Trump’s Calls to Fire Him: ‘I Finally Have Something in Common With MTG’",
    "description": "\"Trump's really bringing the country together,\" joked Meyers after the president called for NBC to toss the host",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/seth-meyers-trump-fire-marjorie-taylor-greene-1235466858/",
    "timestamp": "2025-11-18T05:57:17Z"
  },
  {
    "title": "UN Security Council votes for international force for Gaza",
    "description": "There were 13 votes in favor of the text, which Trump claimed would lead to \"further Peace all over the World,\" with only Russia and China abstaining – but no vetoes",
    "link": "https://www.euractiv.com/news/un-security-council-votes-for-international-force-for-gaza/",
    "timestamp": "2025-11-18T05:57:05Z"
  },
  {
    "title": "‘Pennies Are Trash Now’: Reporter Shocked to Discover ‘There Is No Plan’ Now That Feds Stopped Minting One-Cent Coins",
    "description": "The federal government stopped minting new pennies last week, but as one reporter who has extensively followed the saga of the little copper-colored coin discovered, there does not seem to be much of a plan for what to do next.\nThe post ‘Pennies Are Trash Now…",
    "link": "https://www.mediaite.com/media/weird/pennies-are-trash-now-reporter-shocked-to-discover-there-is-no-plan-now-that-feds-stopped-minting-one-cent-coins/",
    "timestamp": "2025-11-18T05:56:19Z"
  },
  {
    "title": "Singapore welcomes UN Security Council’s endorsement of Gaza peace plan",
    "description": "The endorsement is a “significant step forward towards a lasting peace in Gaza”, said a Ministry of Foreign Affairs spokesperson.",
    "link": "https://www.channelnewsasia.com/singapore/gaza-peace-plan-un-security-council-us-mfa-5474036",
    "timestamp": "2025-11-18T05:56:00Z"
  },
  {
    "title": "IDF to political echelon: F-35 sale to Saudis endangers Israeli security",
    "description": "The military is warning that if the Saudis acquire the US-made F-35 stealth fighter jets, Israel would lose air superiority in the region.",
    "link": "https://www.israelnationalnews.com/news/417952",
    "timestamp": "2025-11-18T05:51:38Z"
  },
  {
    "title": "Gregory Bovino is exactly who E.B. White — author of 'Charlotte's Web' — warned us about",
    "description": "DHS named its North Carolina anti-immigrant effort \"Operation Charlotte's Web.\" In 1940, White wrote of the \"smell\" that \"rises\" from those who \"adjust to fascism\" over freedom.",
    "link": "https://www.lawdork.com/p/gregory-bovino-is-exactly-who-eb-white-warned-of",
    "timestamp": "2025-11-18T05:47:01Z"
  },
  {
    "title": "Trump says US will sell F-35 stealth jets to Saudi Arabia",
    "description": "President Donald Trump said Monday the United States would sell F-35 stealth fighters to Saudi Arabia, a day before Saudi Crown Prince Mohammed bin Salman visits the White House for talks.",
    "link": "https://www.hurriyetdailynews.com/trump-says-us-will-sell-f-35-stealth-jets-to-saudi-arabia-215850",
    "timestamp": "2025-11-18T05:45:56Z"
  },
  {
    "title": "Why did Trump change his stance on the Epstein files? Factors that may have forced him to back a release he long resisted",
    "description": "Why did Trump change his stance on Epstein files? President Trump has reversed his stance, urging House Republicans to release Jeffrey Epstein files, stating there's  nothing to hide.  This shift follows pressure from his MAGA base and bipartisan congressiona…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-did-trump-change-his-stance-on-the-epstein-files-factors-that-may-have-forced-him-to-back-a-release-he-long-resisted/articleshow/125402659.cms",
    "timestamp": "2025-11-18T05:44:52Z"
  },
  {
    "title": "Federal Immigration Agents Are Surging In Raleigh This Week, Mayor Says",
    "description": "Federal immigration authorities will expand their enforcement action in North Carolina to the city as soon as Tuesday.",
    "link": "https://www.huffpost.com/entry/ap-us-federal-enforcement-north-carolina_n_691c04a1e4b0414d84d727a5",
    "timestamp": "2025-11-18T05:43:44Z"
  },
  {
    "title": "In the violence plaguing Nigeria, many say everyone — Christian or Muslim — is a potential victim",
    "description": "Much of northern Nigeria has been battered by conflict in a longstanding security crisis, and U_S_ President Donald Trump has singled the country out for what he calls “the killing of Christians” by “radical Islamists.”",
    "link": "https://abcnews.go.com/International/wireStory/violence-plaguing-nigeria-christian-muslim-potential-victim-127619302",
    "timestamp": "2025-11-18T05:42:02Z"
  },
  {
    "title": "Paris Hilton shoots down claims that Ghislaine Maxwell tried to recruit her for Jeffrey Epstein",
    "description": "Socialite has no memory of meeting the convicted sex trafficker",
    "link": "https://www.the-independent.com/life-style/paris-hilton-ghislaine-maxwell-jeffrey-epstein-b2867152.html",
    "timestamp": "2025-11-18T05:41:58Z"
  },
  {
    "title": "China’s grip on American medicine cabinets grows more entrenched",
    "description": "America's drug supply faces a serious threat from China's increasing control. A US commission warns that a quarter of generic drugs rely on Chinese ingredients. This dependency could lead to severe shortages and impact healthcare. China is also expanding its …",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-grip-on-american-medicine-cabinets-grows-more-entrenched/articleshow/125402605.cms",
    "timestamp": "2025-11-18T05:41:03Z"
  },
  {
    "title": "Keith Urban Performs at President Donald Trump's Mar-A-Lago Resort",
    "description": "Keith Urban performed at President Donald Trump‘s Mar-a-Lago resort over the weekend. The 58-year-old musician was there to perform at Australian billionaire Anthony Pratt‘s behest, as he used the resort as the venue for his holiday party. Keep reading to fin…",
    "link": "https://www.justjared.com/2025/11/18/keith-urban-performs-at-president-donald-trumps-mar-a-lago-resort/",
    "timestamp": "2025-11-18T05:35:33Z"
  },
  {
    "title": "Trump leaves military action against Venezuela on the table but floats possible talks",
    "description": "President Donald Trump isn't ruling out military action against Venezuela despite bringing up potential diplomatic talks with its leader, Nicolás Maduro",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-leaves-military-action-venezuela-table-floats-talks-127609105",
    "timestamp": "2025-11-18T05:33:30Z"
  },
  {
    "title": "Trump leaves military action against Venezuela on the table but floats possible talks",
    "description": "President Donald Trump isn't ruling out military action against Venezuela despite bringing up potential diplomatic talks with its leader, Nicolás Maduro",
    "link": "https://abcnews.go.com/US/wireStory/trump-leaves-military-action-venezuela-table-floats-talks-127609101",
    "timestamp": "2025-11-18T05:33:28Z"
  },
  {
    "title": "Seth Meyers Hits Back At Trump's Personal Attack With An Embarrassing Reality Check",
    "description": "The \"Late Night\" host reminded the president why he \"can't get mad a second time.\"",
    "link": "https://www.huffpost.com/entry/seth-meyers-trump-attack-catapults-rerun_n_691be41ee4b0b8c5ce72c8b3",
    "timestamp": "2025-11-18T05:31:36Z"
  },
  {
    "title": "Pope Leo Turns Heat Up On Politicians Over Climate At UN Talks Ghosted By Trump Admin",
    "description": "The pontiff warned how the \"political will of some\" to combat the climate crisis is \"failing.\"",
    "link": "https://www.huffpost.com/entry/pope-leo-climate-crisis_n_691c00d4e4b0414d84d72423",
    "timestamp": "2025-11-18T05:31:08Z"
  },
  {
    "title": "Trade is now top concern for Irish firms, says Ibec report",
    "description": "Trade uncertainty has surged past employment and labour cost as the primary concern for Irish businesses this year, according to Ibec’s 2025 Manufacturing Report.",
    "link": "https://www.independent.ie/business/trade-is-now-top-concern-for-irish-firms-says-ibec-report/a1421600279.html",
    "timestamp": "2025-11-18T05:30:00Z"
  },
  {
    "title": "Mike Waltz: What must happen next to cement the peace plan in Gaza",
    "description": "Just weeks ago, in early October, the Middle East was mired in conflict. Israeli hostages were held captive by Hamas terrorists, and Palestinians in Gaza suffered as the war raged on. Then Donald Trump secured a historic peace deal, with the support of Qatar,…",
    "link": "https://www.independent.ie/opinion/comment/mike-waltz-what-must-happen-next-to-cement-the-peace-plan-in-gaza/a1984345963.html",
    "timestamp": "2025-11-18T05:30:00Z"
  },
  {
    "title": "BBC chiefs determined to fight if Donald Trump sues over speech edit, chair Samir Shah says",
    "description": "The BBC is determined to fight any legal action filed by US president Donald Trump and sees no basis for a defamation case over its editing of one of his speeches, its chair said yesterday.",
    "link": "https://www.independent.ie/world-news/britain/bbc-chiefs-determined-to-fight-if-donald-trump-sues-over-speech-edit-chair-samir-shah-says/a164943319.html",
    "timestamp": "2025-11-18T05:30:00Z"
  },
  {
    "title": "National Guard cannot be deployed to Memphis, judge rules",
    "description": "A Tennessee judge has blocked the use of the National Guard in Memphis, but also put the order on hold, giving the government five days to appeal.",
    "link": "https://www.abc.net.au/news/2025-11-18/judge-blocks-use-of-national-guard-in-memphis/106023888",
    "timestamp": "2025-11-18T05:25:56Z"
  },
  {
    "title": "UN Security Council votes for international force for Gaza",
    "description": "The UN Security Council voted Monday in favor of a U.S.-drafted resolution bolstering Donald Trump's Gaza peace plan that includes the deployment of an international force and a path to a future Palestinian state.",
    "link": "https://www.hurriyetdailynews.com/un-security-council-votes-for-international-force-for-gaza-215847",
    "timestamp": "2025-11-18T05:21:40Z"
  },
  {
    "title": "Bitcoin Drops Below $90,000 For The First Time Since April As Crypto Slide Continues",
    "description": "The world’s most valuable cryptocurrency’s weeks-long sell-off has now erased all its gains since the start of 2025.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/11/18/bitcoin-drops-below-90000-for-the-first-time-since-april-as-crypto-slide-continues/",
    "timestamp": "2025-11-18T05:17:29Z"
  },
  {
    "title": "'I Would Be Proud' to Target ‘Cocaine Factories’ in Colombia - Trump",
    "description": "US President Donald Trump said on Monday that he would be \"proud\" to strike what he called \"cocaine factories\" in Colombia.",
    "link": "https://sputnikglobe.com/20251118/i-would-be-proud-to-target-cocaine-factories-in-colombia---trump-1123128095.html",
    "timestamp": "2025-11-18T05:15:51Z"
  },
  {
    "title": "Maher Rips Democratic Socialists: If You Think Mamdani Can Reinvent This Wheel, \"You're In For A Rude Awokening\"",
    "description": "On Friday's episode of HBO's \"Real Time,\" host Bill Maher called out Zohran Mamdani and Sen. Bernie Sanders, pointing to \"collapsed\" Democratic Socialist policies as evidence that socialism doesn't work. \"Democrats should recognize the party moved too far lef…",
    "link": "https://freerepublic.com/focus/f-news/4353121/posts",
    "timestamp": "2025-11-18T05:14:10Z"
  },
  {
    "title": "Jon Stewart Slams Trump For Claiming He Has ‘Nothing to Hide’ With the Epstein Files: ‘It’s Very Clear He Does Not Want These Things’ Released",
    "description": "On this week’s episode of “The Daily Show,” Jon Stewart went after Donald Trump for his scattered response to the thousands of emails released last week in relation to the Jeffrey Epstein files. Stewart opened his monologue by poking fun at one of the most vi…",
    "link": "https://variety.com/2025/tv/news/jon-stewart-trump-nothing-to-hide-epstein-files-1236584255/",
    "timestamp": "2025-11-18T05:13:56Z"
  },
  {
    "title": "Trump says US will sell F-35s to Saudi Arabia ahead of MBS’ Washington visit",
    "description": "President Donald Trump on Monday said he will sell F-35 advanced fighter jets to Saudi Arabia on the eve of Crown Prince Mohammed bin Salman's (MBS) Washington visit, as he praised the kingdom for its long partnership with the United States.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-says-us-will-sell-f-35s-to-saudi-arabia-ahead-of-mbs-washington-visit/article70293219.ece",
    "timestamp": "2025-11-18T05:13:02Z"
  },
  {
    "title": "US lawmakers set for explosive vote on Epstein files",
    "description": "US lawmakers are expected to advance a bill requiring the release of government records on millionaire sex offender Jeffrey Epstein, in defiance of Donald Trump's attempts to keep a lid on one of modern America's most notorious case files.",
    "link": "https://www.rte.ie/news/world/2025/1118/1544523-epstein-files-us/",
    "timestamp": "2025-11-18T05:06:45Z"
  },
  {
    "title": "‘Ashamed’ Former Obama Official Says He Is ‘Stepping Back From Public Commitments’ After Epstein Revelation",
    "description": "Larry Summers, who served in the Clinton and Obama administrations, said on Monday he is \"stepping back from public commitments\" after it was revealed he sought relationship advice from Jeffrey Epstein.\nThe post ‘Ashamed’ Former Obama Official Says He Is ‘Ste…",
    "link": "https://www.mediaite.com/politics/ashamed-former-obama-official-says-he-is-stepping-back-from-public-commitments-after-epstein-revelation/",
    "timestamp": "2025-11-18T05:06:28Z"
  },
  {
    "title": "Trump Dishes About What He Likes At McDonald's In The Strangest Way Possible",
    "description": "The president also had a complaint about his go-to item.",
    "link": "https://www.huffpost.com/entry/trump-mcdonalds-menu_n_691beac9e4b085766d7eb3cb",
    "timestamp": "2025-11-18T05:05:09Z"
  },
  {
    "title": "Trump says US may strike Mexican drug cartels next, after boat attacks",
    "description": "US President Donald Trump says he has been speaking with Mexico about a potential military intervention.",
    "link": "https://www.aljazeera.com/news/2025/11/18/trump-says-us-may-strike-mexican-drug-cartels-next-after-boat-attacks",
    "timestamp": "2025-11-18T05:04:57Z"
  },
  {
    "title": "Jon Stewart Addresses Bombshell Epstein Emails: “You Know It’s Real Because Trump’s Allies Are Working Overtime To Distract”",
    "description": "Jon Stewart opened tonight’s episode of The Daily Show with the latest development in the saga of, as he deemed it, “the very normal and not shady handling of the Epstein files.” Jumping right in, as tackled by Saturday Night Live a couple of nights ago, Stew…",
    "link": "http://deadline.com/2025/11/jon-stewart-jeffrey-epstein-emails-donald-trump-1236621159/",
    "timestamp": "2025-11-18T05:04:12Z"
  },
  {
    "title": "US colleges see 17% drop in newly enrolled international students, report finds",
    "description": "Visa application concerns and travel restrictions among reasons cited for the decline in enrolment of international students in US colleges",
    "link": "https://www.thehindubusinessline.com/news/education/us-colleges-see-17-drop-in-newly-enrolled-international-students-report-finds/article70293226.ece",
    "timestamp": "2025-11-18T05:03:00Z"
  },
  {
    "title": "After years away from Washington, Saudi crown prince to get warm embrace from Trump, US business",
    "description": "President Donald Trump is set to fete Crown Prince Mohammed bin Salman on Tuesday when the de facto leader of Saudi Arabia makes his first White House visit ...",
    "link": "https://www.yahoo.com/news/articles/years-away-washington-saudi-crown-050215433.html",
    "timestamp": "2025-11-18T05:02:15Z"
  },
  {
    "title": "'Would I launch strikes in Mexico to stop drugs? It’s okay with me' - Trump",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump said on Monday that he would be \"okay\" with launching strikes on Mexico to stop drugs from coming into the United States.",
    "link": "https://sputnikglobe.com/20251118/would-i-launch-strikes-in-mexico-to-stop-drugs-its-okay-with-me---trump-1123127968.html",
    "timestamp": "2025-11-18T05:01:37Z"
  },
  {
    "title": "Federal immigration agents will expand enforcement action in North Carolina to Raleigh, mayor says",
    "description": "Federal immigration authorities will expand their enforcement action in North Carolina to Raleigh as soon as Tuesday",
    "link": "https://abcnews.go.com/US/wireStory/federal-immigration-agents-expand-enforcement-action-north-carolina-127592340",
    "timestamp": "2025-11-18T05:01:26Z"
  },
  {
    "title": "The Democrat Party And The Death Of Western Civilization",
    "description": "Will the death of Western Civilization occur while the United States is the global hegemon and unquestioned leader of the West? Due to Euro-socialism and decades of unfettered Islamic immigration, virtually all the nations of Western Europe are swept...",
    "link": "https://www.americanthinker.com/articles/2025/11/the_democrat_party_and_the_death_of_western_civilization.html",
    "timestamp": "2025-11-18T05:00:00Z"
  },
  {
    "title": "Donald Trump and American pragmatism",
    "description": "“The world seems mad in its preoccupation with what is particular and disconnected in politics.  Recovery of sanity depends on seeing these particular things as links in a process.”\r\n\r\n—James Dewey, “Experience and N...",
    "link": "https://www.americanthinker.com/blog/2025/11/donald_trump_and_american_pragmatism.html",
    "timestamp": "2025-11-18T05:00:00Z"
  },
  {
    "title": "Donald Trump Disavows The Self-Serving ‘Populist’ Marjorie Taylor Greene",
    "description": "Donald Trump’s decision to disavow Marjorie Taylor Greene marks one of the most consequential moments within the populist right in years.\r\n\r\nIt’s productive, overdue, and welcome because it cuts through the illusion that Greene ever repre...",
    "link": "https://www.americanthinker.com/articles/2025/11/donald_trump_disavows_the_self_serving_populist_marjorie_taylor_greene.html",
    "timestamp": "2025-11-18T05:00:00Z"
  },
  {
    "title": "Canadian PM Mark Carney clears budget vote, averting snap elections",
    "description": "A handful of opposition abstentions allowed Carney to advance a deficit-boosting budget aimed at countering US tariffs.",
    "link": "https://www.aljazeera.com/news/2025/11/18/canadian-pm-mark-carney-clears-budget-vote-averting-snap-elections",
    "timestamp": "2025-11-18T04:59:55Z"
  },
  {
    "title": "NPR Wins Back $36 Million Contract That Was Yanked Under Pressure From Trump White House",
    "description": "National Public Radio has secured a legal settlement restoring a multimillion-dollar contract that was revoked under pressure from President Donald Trump's administration.\nThe post NPR Wins Back $36 Million Contract That Was Yanked Under Pressure From Trump W…",
    "link": "https://www.mediaite.com/lawcrime/npr-wins-back-36-million-contract-that-was-yanked-under-pressure-from-trump-white-house/",
    "timestamp": "2025-11-18T04:59:36Z"
  },
  {
    "title": "China hints at Xi meeting with Japan's new premier Takaichi",
    "description": "In a noteworthy diplomatic stride, China's Foreign Minister Wang Yi has signaled the possibility of elevated discussions with Japan, following a recent call with his Japanese counterpart, Toshimitsu Motegi. Rumors are swirling about a prospective meeting betw…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-hints-at-xi-meeting-with-japans-new-premier-takaichi/articleshow/125401858.cms",
    "timestamp": "2025-11-18T04:55:05Z"
  },
  {
    "title": "Jon Stewart Roasts Trump for Calling New Epstein Files ‘Boring Stuff’: ‘Did You See the Blowing Email?’ | Video",
    "description": "\"I mean, the little taste of that, no pun intended, did arouse, again, no pun intended, some curiosity about the rest of, if I may, the load,\" the comedian jokes\nThe post Jon Stewart Roasts Trump for Calling New Epstein Files ‘Boring Stuff’: ‘Did You See the …",
    "link": "https://www.thewrap.com/jon-stewart-the-daily-show-trump-epstein-emails-reaction-video/",
    "timestamp": "2025-11-18T04:54:22Z"
  },
  {
    "title": "Trump Says Not Ruling Out Putting US Troops on Ground in Venezuela",
    "description": "WASHINGTON (Sputnik) – US President Donald Trump said on Monday that he is not ruling out putting US troops on the ground in Venezuela as tensions between the countries continue to escalate.",
    "link": "https://sputnikglobe.com/20251118/trump-says-not-ruling-out-putting-us-troops-on-ground-in-venezuela-1123127674.html",
    "timestamp": "2025-11-18T04:53:11Z"
  },
  {
    "title": "Trump loses bid to stop files vote: Epstein problem ensnares BOTH Trump DOJ leaders",
    "description": "There is mounting pressure on Donald Trump's DOJ amid allegations of a potential Epstein cover-up. Former civil prosecutor ...",
    "link": "https://biztoc.com/x/ec88ac4dc87f2092",
    "timestamp": "2025-11-18T04:52:36Z"
  },
  {
    "title": "Trump expresses openness to talks with Venezuela's Maduro",
    "description": "While Donald Trump said he is willing to talk to Nicolas Maduro, he has not ruled out sending US troops to Venezuela. Not long afterwards, Maduro also expressed openness to talks with his US counterpart.",
    "link": "https://www.dw.com/en/trump-expresses-openness-to-talks-with-venezuelas-maduro/a-74785338",
    "timestamp": "2025-11-18T04:52:00Z"
  },
  {
    "title": "Jared Kushner Invited Jeffrey Epstein to Party With Trump and Harvey Weinstein in 2013",
    "description": "Jared Kushner invited the late sex offender Jeffrey Epstein to a 2013 party with his father-in-law Trump and convicted rapist Harvey Weinstein.\nThe post Jared Kushner Invited Jeffrey Epstein to Party With Trump and Harvey Weinstein in 2013 first appeared on M…",
    "link": "https://www.mediaite.com/politics/jared-kushner-invited-jeffrey-epstein-to-party-with-trump-and-harvey-weinstein-in-2013/",
    "timestamp": "2025-11-18T04:49:19Z"
  },
  {
    "title": "Crockett: Trump Has Caused 'Consistent Spike' in Political Violence",
    "description": "Monday on CNN's \"The Lead,\" Rep. Jasmine Crockett (D-TX) said President Donald Trump had caused a \"consistent spike in the violence when it comes to politics.\"\nThe post Crockett: Trump Has Caused ‘Consistent Spike’ in Political Violence appeared first on Brei…",
    "link": "https://www.breitbart.com/clips/2025/11/17/crockett-trump-has-caused-consistent-spike-in-political-violence/",
    "timestamp": "2025-11-18T04:47:28Z"
  },
  {
    "title": "Will Los Angeles Be the Latest City to Elect a Democratic Socialist Mayor? Karen Bass Gets a Challenger",
    "description": "Who would have thunk it? We now have two democratic socialists who have won their mayoral races in major American cities – Zohran Mamdani in New York City, of course, and inexperienced Katie Wilson in Seattle. Both cities have already suffered greatly at the …",
    "link": "https://freerepublic.com/focus/f-news/4353115/posts",
    "timestamp": "2025-11-18T04:45:58Z"
  },
  {
    "title": "Tennessee judge blocks Trump's use of National Guard in Memphis but gives time for government appeal",
    "description": "A Tennessee judge has blocked the use of the National Guard in Memphis under a crime-fighting operation by President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/tennessee-judge-blocks-trumps-national-guard-memphis-time-127617186",
    "timestamp": "2025-11-18T04:45:53Z"
  },
  {
    "title": "Trump Says U.S. Soldiers in Venezuela Are on the Table: ‘I Don’t Rule Out That’",
    "description": "President Donald Trump said on Monday he will not \"rule out\" sending U.S. soldiers to attack Venezuela. \nThe post Trump Says U.S. Soldiers in Venezuela Are on the Table: ‘I Don’t Rule Out That’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-says-u-s-soldiers-in-venezuela-are-on-the-table-i-dont-rule-out-that/",
    "timestamp": "2025-11-18T04:28:46Z"
  },
  {
    "title": "Brit Hume Advises Trump How To Handle Inflation Ahead Of Midterms",
    "description": "Brit Hume urged President Donald Trump to confront soaring prices head-on as inflation continues to squeeze voters in the run-up to the midterms.",
    "link": "https://dailycaller.com/2025/11/17/brit-hume-trump-handle-inflation-midterms/",
    "timestamp": "2025-11-18T04:25:52Z"
  },
  {
    "title": "Valar Atomics Says It's the First Nuclear Startup to Achieve Criticality",
    "description": "Startup Valar Atomics said on Monday that it achieved criticality—an essential nuclear milestone—with the help of one of the country’s top nuclear laboratories. The El Segundo, California-based startup, which last week announced it had secured a $130 million …",
    "link": "https://slashdot.org/submission/17342419/valar-atomics-says-its-the-first-nuclear-startup-to-achieve-criticality",
    "timestamp": "2025-11-18T04:24:53Z"
  }
]