[
  {
    "title": "EU-US tariff deal a ‘positive’ development – Italy’s Meloni",
    "description": "Political opponents have accused Italian Prime Minister Giorgia Meloni of failing to push for better terms for the country Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622074-meloni-trump-eu-deal-positive/",
    "timestamp": "2025-07-28T08:45:36Z"
  },
  {
    "title": "A long-awaited rule to protect workers from heat stress moves forward, even under Trump",
    "description": "While labor experts say the regulation is progressing quickly, advocacy groups wonder what has taken so long.",
    "link": "https://grist.org/labor/federal-workplace-heat-protections-osha-temperature-regulation-trump-farmworkers/",
    "timestamp": "2025-07-28T08:45:00Z"
  },
  {
    "title": "China urges global consensus on balancing AI development, security",
    "description": "Shanghai (AFP) July 26, 2025\n\n\n China's Premier Li Qiang warned Saturday that artificial intelligence development must be weighed against the security risks, saying global consensus was urgently needed even as the tech race between Beijing and Washington show…",
    "link": "https://www.spacewar.com/reports/China_urges_global_consensus_on_balancing_AI_development_security_999.html",
    "timestamp": "2025-07-28T08:42:17Z"
  },
  {
    "title": "Iran says it held 'frank' nuclear talks with European powers",
    "description": "Istanbul (AFP) July 25, 2025\n\n\n Iranian diplomats said they held \"frank and detailed\" nuclear talks on Friday with counterparts from Germany, Britain and France, who have threatened to trigger sanctions if Tehran fails to agree a deal on uranium enrichment an…",
    "link": "https://www.spacewar.com/reports/Iran_says_it_held_frank_nuclear_talks_with_European_powers_999.html",
    "timestamp": "2025-07-28T08:42:17Z"
  },
  {
    "title": "NASA says it will lose about 20 percent of its workforce",
    "description": "Washington (AFP) July 26, 2025\n\n\n The US space agency NASA will lose about 3,900 employees under Donald Trump's sweeping effort to trim the federal workforce - at the same time as the president prioritizes plans for crewed missions to the Moon and Mars. \n\nIn …",
    "link": "https://www.spacedaily.com/reports/NASA_says_it_will_lose_about_20_percent_of_its_workforce_999.html",
    "timestamp": "2025-07-28T08:42:16Z"
  },
  {
    "title": "Will California comply with DOT's 'audit' of non-domiciled CDLs?",
    "description": "Overdrive reporting revealed California doesn't track citizenship status of CDL holders. How can it comply with DOT's \"audit\" of non-domiciled CDLs?",
    "link": "https://www.overdriveonline.com/regulations/article/15751633/will-california-cooperate-with-fmcsas-nondomiciled-cdl-audit",
    "timestamp": "2025-07-28T08:37:13Z"
  },
  {
    "title": "Mixed reactions in Finland over EU-US trade deal",
    "description": "\"It has calmed the situation but there's absolutely no reason for celebration,\" said Minister for Development Cooperation and Foreign Trade, Ville Tavio (Finns).",
    "link": "https://yle.fi/a/74-20174660",
    "timestamp": "2025-07-28T08:35:23Z"
  },
  {
    "title": "'Biggest trade deal ever' — 5 Things to know in Bitcoin this week",
    "description": "Bitcoin gets an early macro tailwind as the US seals trade deals, but plenty of BTC price volatility catalysts are waiting in the wings into August.",
    "link": "https://cointelegraph.com/news/biggest-trade-deal-ever-5-things-bitcoin-this-week",
    "timestamp": "2025-07-28T08:34:46Z"
  },
  {
    "title": "Major blow: German auto industry to lose billions over Trump tariffs",
    "description": "Major blow: German auto industry to lose billions over Trump tariffs\nGerman car manufacturers could lose up to 10 billion euros due to tariffs imposed by US President Donald Trump. The White House's tariff policy could deal a major blow amid broader challenge…",
    "link": "https://biztoc.com/x/b5ae54a080551418",
    "timestamp": "2025-07-28T08:30:12Z"
  },
  {
    "title": "Epstein furor undermines public trust, Republican election hopes, two US lawmakers say",
    "description": "The uproar over disgraced financier and sex offender Jeffrey Epstein could undermine public trust in the Trump administration, as well as Republican hopes of retaining control of Congress in the 2026 midterm elections, two US lawmakers said on Sunday.",
    "link": "https://nypost.com/2025/07/28/us-news/epstein-furor-undermines-public-trust-republican-election-hopes-two-us-lawmakers-say/",
    "timestamp": "2025-07-28T08:25:15Z"
  },
  {
    "title": "Elon Musk's Tesla Diner Hit With Inflatable Nazi Protest",
    "description": "Musk said that the protesters had \"no popular support\" after a group targeted his new diner in California.",
    "link": "https://www.newsweek.com/elon-musk-tesla-diner-nazi-protest-2104891",
    "timestamp": "2025-07-28T08:25:01Z"
  },
  {
    "title": "June 2025 Tariffs Sentiment Polls Strategic Intelligence Survey",
    "description": "Discover the business community’s reactions to tariffs in our comprehensive report based on 14 polls. Analyzing responses from 8,782 participants between April 10 and June 30, 2025, this study reveals the negative sentiment towards recent U.S. tariff policies…",
    "link": "https://www.globenewswire.com/news-release/2025/07/28/3122233/28124/en/June-2025-Tariffs-Sentiment-Polls-Strategic-Intelligence-Survey.html",
    "timestamp": "2025-07-28T08:25:00Z"
  },
  {
    "title": "UN refugee chief says budget cuts propel migrants to Europe",
    "description": "Boosting aid to Africa would \"solve a lot\" of problems, says High Commissioner for Refugees Filippo Grandi.",
    "link": "https://www.politico.eu/article/budget-cuts-un-aid-blame-higher-migration-europe-says-chief-filippo-grandi/",
    "timestamp": "2025-07-28T08:14:27Z"
  },
  {
    "title": "Jordan Klepper Has Just 1 Brutally Blunt Question For Scott Jennings",
    "description": "The \"Daily Show\" correspondent may have found the CNN commentator's real goal.",
    "link": "https://www.huffpost.com/entry/jordan-klepper-scott-jennings_n_68871b30e4b0b306e5bb4862",
    "timestamp": "2025-07-28T08:10:27Z"
  },
  {
    "title": "MAGA Superintendent Ryan Walters Hits Out at Porn Claims",
    "description": "Two members of the Oklahoma State Board of Education said they saw images of nude women on a TV during a meeting in his office.",
    "link": "https://www.newsweek.com/ryan-walters-oklahoma-porn-tv-meeting-2104882",
    "timestamp": "2025-07-28T08:07:36Z"
  },
  {
    "title": "Trump’s tariff deal offers scant relief for Japan automakers as bigger threat looms",
    "description": "Japanese automakers may have sidestepped crushing U.S. tariffs, but the reprieve is offering little comfort as Chinese automakers erode their long-held global edge, complicated by persistent structural challenges at home.\nOn July 22, U.S. President Donald Tru…",
    "link": "https://biztoc.com/x/54ee4d145e0d29c3",
    "timestamp": "2025-07-28T08:07:35Z"
  },
  {
    "title": "Europe 'capitulated' on US tariff deal, says IBEC CEO",
    "description": "CEO of IBEC Danny McCoy has described the deal reached by the European Union and the United States on trade tariffs as a capitulation by Europe.",
    "link": "https://www.rte.ie/news/2025/0728/1525657-tariffs-reaction/",
    "timestamp": "2025-07-28T08:04:06Z"
  },
  {
    "title": "Cambodian and Thai leaders hold ceasefire talks in Malaysia",
    "description": "Ceasefire talks have started between Thai and Cambodian leaders in Malaysia in an urgent effort to resolve deadly border clashes that entered a fifth day despite mounting international calls for peace.",
    "link": "https://www.npr.org/2025/07/28/nx-s1-5482345/cambodia-thailand-ceasefire-talks",
    "timestamp": "2025-07-28T08:01:50Z"
  },
  {
    "title": "Princess Anne wants Prince William to ditch this concerning royal habit: expert",
    "description": "Royal experts claim Princess Anne is eager for Prince William to improve his work ethic and shed allegations of being work-shy as he prepares for his future role as king.",
    "link": "https://www.foxnews.com/entertainment/princess-anne-wants-prince-william-ditch-concerning-royal-habit-expert",
    "timestamp": "2025-07-28T08:00:30Z"
  },
  {
    "title": "The U.S. economy is thriving in spite of tariffs. Will it last?",
    "description": "When the Trump administration launched its trade war, economists said it would cause severe economic pain in both Canada and the U.S. So far, that pain has been contained to specific sectors. That resilience sheds some light on what may come next.",
    "link": "https://www.cbc.ca/news/business/armstrong-trade-trump-tariffs-1.7593202",
    "timestamp": "2025-07-28T08:00:00Z"
  },
  {
    "title": "Gaza civil defence says Israeli fire kills 16",
    "description": "Gaza's civil defence agency said 16 people were killed by Israeli fire today in the Palestinian territory devastated by more than 21 months of war.",
    "link": "https://www.rte.ie/news/world/2025/0728/1525661-gaza-israel-aid/",
    "timestamp": "2025-07-28T07:58:52Z"
  },
  {
    "title": "Aid reaching Gaza is a 'drop in the ocean', says UN",
    "description": "UN Under Secretary-General for Humanitarian Affairs and Emergency Relief Co-Ordinator Tom Fletcher has said that aid being air dropped into Gaza is a step in the right direction, but that the aid getting into the territory in recent months is \"a drop in the o…",
    "link": "https://www.rte.ie/news/world/2025/0728/1525661-gaza-aid/",
    "timestamp": "2025-07-28T07:58:52Z"
  },
  {
    "title": "Aid reaching Gaza is a 'drop in the ocean', says UN",
    "description": "Aid that is being air dropped into Gaza is a step in the right direction, but the level of aid getting into the territory in recent months is \"a drop in the ocean\" of what is needed, UN aid chief Tom Fletcher has said.",
    "link": "https://www.rte.ie/news/world/2025/0728/1525661-gaza-israel/",
    "timestamp": "2025-07-28T07:58:52Z"
  },
  {
    "title": "Dollar strengthens after US and EU agree to tariff deal",
    "description": "TOKYO/LONDON :The dollar rose against major peers on Monday after the United States and the EU struck a framework trade pact, the latest in a flurry of deals to avert a global trade war, with investors also looking to this week's U.S. and Japanese central ban…",
    "link": "https://www.channelnewsasia.com/business/dollar-strengthens-after-us-and-eu-agree-tariff-deal-5261836",
    "timestamp": "2025-07-28T07:58:06Z"
  },
  {
    "title": "Stock Market Today: Dow Chasing Record High; S&P 500, Nasdaq Set to Open Up; Trump, EU Trade Deal; Tesla, Nvidia, Intel, More Movers",
    "description": "LIVE UPDATES\nDow Chasing Record High After Trump's EU Trade Deal\nS&P 500 and Nasdaq 100 futures are also rising in premarket trading Monday.\nLast Updated:\nJuly 28, 2025 at 3:56 AM ET\nKey Events\nLatest Updates\nStocks were on track for another session of gains …",
    "link": "https://biztoc.com/x/021e4de26be662af",
    "timestamp": "2025-07-28T07:56:27Z"
  },
  {
    "title": "China says it wants the world to work together to govern AI. The US, not so much.",
    "description": "China has called for a new global organization to address the AI threat. Getting the US to the table might be a challenge.",
    "link": "https://www.businessinsider.com/china-global-ai-regulation-trump-openai-meta-deepmind-anthropic-2025-7",
    "timestamp": "2025-07-28T07:54:57Z"
  },
  {
    "title": "North Korea: Kim Jong Un's sister rejects South's overtures",
    "description": "North Korea is not interested in talks with South Korea, Kim Jong Un's powerful younger sister says. Kim Yo Jong says there is \"nothing to discuss,\" despite conciliatory moves from Seoul's new president. Kim Yo Jong, the sister of North Korean leader Kim Jong…",
    "link": "https://www.dw.com/en/north-korea-kim-jong-uns-sister-rejects-souths-overtures/a-73433605",
    "timestamp": "2025-07-28T07:50:00Z"
  },
  {
    "title": "North Korea: Kim Jong Un's sister rejects South's overtures",
    "description": "North Korea is not interested in talks with South Korea, Kim Jong Un's powerful younger sister says. Kim Yo Jong says there is \"nothing to discuss,\" despite conciliatory moves from Seoul's new president.",
    "link": "https://www.dw.com/en/north-korea-kim-jong-uns-sister-rejects-souths-overtures/a-73433605",
    "timestamp": "2025-07-28T07:50:00Z"
  },
  {
    "title": "Trump Mulls 'Little Rebate' For Americans Funded By Tariff Revenue — But Here's The 'Big Thing' He Wants To Do First",
    "description": "President Donald Trump is mulling over the idea of issuing rebate checks to Americans, funded by the new tariff revenue collected by his administration.\nWhat Happened: Trump, before his departure for Scotland, stated that a ‘lot of money’ is coming in through…",
    "link": "https://biztoc.com/x/facab69bdccde3b4",
    "timestamp": "2025-07-28T07:45:51Z"
  },
  {
    "title": "MCC compact to continue in Nepal",
    "description": "KATHMANDU: The Millennium Challenge Corporation (MCC) compact between Nepal and the United States will continue as planned, following the conclusion of a review process initiated under the administration of former U.S. President Donald Trump, the Ministry of …",
    "link": "https://english.khabarhub.com/2025/28/488022/",
    "timestamp": "2025-07-28T07:45:32Z"
  },
  {
    "title": "EU-US tariffs deal dominates news front pages",
    "description": "Blocs agree a deal that will lock in tariffs of 15 per cent on most EU imports to the US",
    "link": "https://www.irishtimes.com/world/europe/2025/07/28/eu-us-tariffs-deal-dominates-news-front-pages/",
    "timestamp": "2025-07-28T07:43:17Z"
  },
  {
    "title": "U.S., EU seal trade deal amid concerns over tariff imbalance",
    "description": "U.S. President Donald Trump and European Commission President Ursula von der Leyen claimed Sunday that they had reached a trade deal under which the United States would impose a baseline tariff of 15 percent on European Union (EU) goods.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-pdo03.htm",
    "timestamp": "2025-07-28T07:39:55Z"
  },
  {
    "title": "Trump tariffs leave costly China supply question unanswered",
    "description": "President Donald Trump's recent flurry of trade deals have given Asian exporters some clarity on tariffs, but missing are key details on how to avoid punitive rates that target China's supply chains.",
    "link": "https://www.digitimes.com/news/a20250728VL204/donald-trump-materials-exports-asia-region.html",
    "timestamp": "2025-07-28T07:38:26Z"
  },
  {
    "title": "Stock markets boosted after EU, US strike trade deal",
    "description": "Stock markets rose in Europe and Asia on Monday after the European Union and United States hammered out a deal to avert a potentially damaging trade war.News...",
    "link": "https://finance.yahoo.com/news/most-markets-rise-euro-boosted-030408282.html",
    "timestamp": "2025-07-28T07:37:20Z"
  },
  {
    "title": "US-EU trade deal is ‘fiasco’ – Le Pen",
    "description": "The agreement is a “surrender” for French industry and the EU’s energy and military sovereignty, Marine Le Pen has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622078-us-eu-trade-deal-fiasco-le-pen/",
    "timestamp": "2025-07-28T07:34:58Z"
  },
  {
    "title": "China, US to hold trade talks in Stockholm",
    "description": "Chinese Vice Premier He Lifeng is scheduled to be in Sweden from July 27 to 30 for economic and trade talks with the US. Ahead of the meeting, Chinese state media published commentaries welcoming in-depth dialogue while underscoring Beijing's recognition of t…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/07/china-250728-globaltimes01.htm",
    "timestamp": "2025-07-28T07:34:38Z"
  },
  {
    "title": "Russia Tones Down Naval Celebrations As Drones Fly Near Putin's Hometown",
    "description": "Russia held subdued ceremonies honoring its navy on July 27 in St. Petersburg, citing security concerns, and authorities in the surrounding region reported that air defense forces shot down several drones they said were fired by Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/07/russia-250727-rferl01.htm",
    "timestamp": "2025-07-28T07:34:07Z"
  },
  {
    "title": "US, China to launch new talks on tariff truce extension, easing path for Trump-Xi meeting",
    "description": "Top U.S. and Chinese economic officials will resume talks in Stockholm on Monday to try to tackle longstanding economic disputes at the centre of a trade war between the world's top two economies, aiming to extend a truce by three months and keeping sharply h…",
    "link": "https://japantoday.com/category/world/us-china-to-launch-new-talks-on-tariff-truce-extension-easing-path-for-trump-xi-meeting1",
    "timestamp": "2025-07-28T07:32:52Z"
  },
  {
    "title": "U.S. tariff tussles stuff of nightmares for Bordeaux winemakers",
    "description": "French wine producers, already reeling from a downturn in their market, still do not know how bitter a taste the U.S. tariffs on wine will leave on their palates. In southwestern France, around the Bordeaux region's famed vineyards, months of talk on what U.S…",
    "link": "https://japantoday.com/category/business/us-tariff-tussles-stuff-of-nightmares-for-bordeaux-winemakers",
    "timestamp": "2025-07-28T07:29:41Z"
  },
  {
    "title": "Global Markets Welcome US-EU Trade Deal",
    "description": "Market relief as the United States and European Union avert a trade war.",
    "link": "https://www.newsweek.com/us-eu-trade-deal-tariffs-2104855",
    "timestamp": "2025-07-28T07:28:14Z"
  },
  {
    "title": "Bitcoin Zooms to $120K, ETH Nears $4K as Trump’s EU Tariff Deal Lifts Risk Sentiment",
    "description": "Markets kicked off the week with a renewed wave of optimism after U.S. President Donald Trump confirmed a tariff deal with the European Union, scaling levies down to 15% from the previously threatened 30%.\nThe announcement sent S&P 500 futures up 0.3%, Dow co…",
    "link": "https://biztoc.com/x/d1236b814d5aa70e",
    "timestamp": "2025-07-28T07:23:24Z"
  },
  {
    "title": "Global stock markets jump after trade deal limits US tariffs on EU to 15% – business live",
    "description": "Live, rolling coverage of business, economics and financial markets as Donald Trump and Ursula von der Leyen agree deal in Scotland\nGood morning, and welcome to our live coverage of business, economics and financial markets.\nGlobal stock markets have rallied …",
    "link": "https://biztoc.com/x/85068728ee2f2c90",
    "timestamp": "2025-07-28T07:23:19Z"
  },
  {
    "title": "Japan's Nikkei ends lower as investors gauge corporate earnings",
    "description": "Japan's Nikkei experienced a reversal, closing lower at 40,998.27 due to profit-taking after a recent surge and concerns about corporate earnings justifying current equity levels. Chip-related shares significantly declined, with Advantest and Screen Holdings …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-as-investors-gauge-corporate-earnings/articleshow/122948361.cms",
    "timestamp": "2025-07-28T07:20:41Z"
  },
  {
    "title": "What we know so far about the EU-US trade deal",
    "description": "EU chief Ursula von der Leyen clinched an agreement Sunday with US President Donald Trump to avoid crippling tariffs from hitting the bloc, with both leaders hailing a \"good deal\".",
    "link": "https://www.thelocal.com/20250728/what-we-know-so-far-about-the-eu-us-trade-deal",
    "timestamp": "2025-07-28T07:20:26Z"
  },
  {
    "title": "Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight",
    "description": "A man has been arrested over a disturbance on board an easyJet flight to Scotland.",
    "link": "https://news.sky.com/story/terror-probe-as-man-arrested-after-shouting-allahu-akbar-and-death-to-trump-on-flight-from-luton-to-glasgow-13402895",
    "timestamp": "2025-07-28T07:18:00Z"
  },
  {
    "title": "How the EU succumbed to Trump’s tariff steamroller",
    "description": "Relief at avoiding trade war is tinged with regret at not taking firmer stand from the start",
    "link": "https://www.irishtimes.com/business/2025/07/28/how-the-eu-succumbed-to-trumps-tariff-steamroller/",
    "timestamp": "2025-07-28T07:17:52Z"
  },
  {
    "title": "Following Up On President Trump’s Idea Of Renaming AI",
    "description": "President Trump remarked that \"artificial Intelligence\" might be an insufficient naming. This stirs a reflective moment on the history of AI. Here's an AI insider look.",
    "link": "https://www.forbes.com/sites/lanceeliot/2025/07/28/following-up-on-president-trumps-idea-of-renaming-artificial-intelligence-to-be-something-a-bit-more-befitting/",
    "timestamp": "2025-07-28T07:15:00Z"
  },
  {
    "title": "CK Hutchison eyes 'major' Chinese investor for Panama ports deal",
    "description": "HONG KONG: Hong Kong conglomerate CK Hutchison said Monday (Jul 28) it was considering inviting a Chinese \"major strategic investor\" to join a United States-led consortium negotiating the sale of its global ports business outside China, including operations a…",
    "link": "https://www.channelnewsasia.com/east-asia/ck-hutchison-panama-ports-deal-investor-hong-kong-5262271",
    "timestamp": "2025-07-28T07:14:31Z"
  },
  {
    "title": "Audi cuts forecast over US tariffs and restructuring costs",
    "description": "(Reuters) -German automaker Volkswagen's  premium brand Audi lowered its full-year financial guidance on Monday, citing the impact of higher U.S. import...",
    "link": "https://finance.yahoo.com/news/vws-audi-cuts-full-outlook-070507366.html",
    "timestamp": "2025-07-28T07:05:07Z"
  },
  {
    "title": "Trump in Scotland: Trump, Starmer to Discuss Trade Deal, Gaza Ceasefire",
    "description": "US President Donald Trump and UK Prime Minister Keir Stamer are meeting in Scotland on Monday in a bid to remove the ...",
    "link": "https://biztoc.com/x/bf4f6ba89734eb3b",
    "timestamp": "2025-07-28T07:03:07Z"
  },
  {
    "title": "COVID-19 contrarian Dr. Vinay Prasad meets real world responsibility",
    "description": "Dr. Vinay Prasad parlayed his COVID-19 contrarianism into a high-ranking position in the FDA. Now he's facing real world responsibility, and knives are out for him. Can he survive?\nThe post COVID-19 contrarian Dr. Vinay Prasad meets real world responsibility …",
    "link": "https://sciencebasedmedicine.org/covid-19-contrarian-dr-vinay-prasad-meets-real-world-responsibility/",
    "timestamp": "2025-07-28T07:00:00Z"
  },
  {
    "title": "EU, US reach trade deal, avoid tariff war",
    "description": "Brussels, July 28: The United States and the European Union on Sunday reached a trade deal, ending a months-long standoff.  “We have reached a […]\nThe post EU, US reach trade deal, avoid tariff war appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/07/28/eu-us-reach-trade-deal-avoid-tariff-war/",
    "timestamp": "2025-07-28T07:00:00Z"
  },
  {
    "title": "The Manhattan Statement: A Debate",
    "description": "The Manhattan Statement: A Debate \n\nsara.custer@in…\n\nMon, 07/28/2025 - 03:00 AM\n\nEric Kaufmann responds to John K. Wilson’s criticisms of a conservative group’s “new contract” for higher ed.\n \n Byline(s)\r\n\n \n John K. Wilson",
    "link": "https://www.insidehighered.com/opinion/columns/debatable-ideas/2025/07/28/manhattan-statement-debate",
    "timestamp": "2025-07-28T07:00:00Z"
  },
  {
    "title": "U.S. trade deal offers initial relief but leaves Europe on the backfoot",
    "description": "The U.S. and EU on Sunday announced a trade agreement, including a 15% tariff rate.",
    "link": "https://www.cnbc.com/2025/07/28/us-trade-deal-offers-initial-relief-leaves-europe-on-the-backfoot.html",
    "timestamp": "2025-07-28T06:59:12Z"
  },
  {
    "title": "Why are airdrops on Gaza so dangerous?",
    "description": "The United Nations has condemned airdrops on Gaza, warning they risk killing the starving Palestinians they are intended to help.",
    "link": "https://news.sky.com/story/why-are-airdrops-on-gaza-so-dangerous-13402889",
    "timestamp": "2025-07-28T06:59:00Z"
  },
  {
    "title": "America First: Eurocrats Lament 'Juggernaut Trump' Rolled Brussels in 'Disaster' Trade Deal",
    "description": "In the hours following the Sunday announcement of the landmark trade deal agreed to by the United States and the European Union, a stinging reality began to sink in across the Old Continent: Brussels blinked, and the EU leadership had been utterly routed by P…",
    "link": "https://www.breitbart.com/europe/2025/07/27/america-first-eurocrats-lament-trump-rolled-over-brussels-in-disaster-trade-deal/",
    "timestamp": "2025-07-28T06:57:40Z"
  },
  {
    "title": "EU-US trade deal represents ‘substantial burden’ for Irish businesses",
    "description": "Most exposed sectors will require Brexit-style supports, according to business lobby Ibec",
    "link": "https://www.irishtimes.com/business/2025/07/28/eu-us-trade-deal-represents-substantial-burden-for-irish-businesses/",
    "timestamp": "2025-07-28T06:44:34Z"
  },
  {
    "title": "Stocks surge, euro steady after US-EU trade agreement",
    "description": "Global stocks rose and the euro appreciated on Monday after a trade agreement between the United States and the EU lifted sentiment and provided some clarity in a week of key policy meetings by the Federal Reserve and the Bank of Japan.",
    "link": "https://nypost.com/2025/07/28/business/stocks-surge-euro-steady-after-us-eu-trade-agreement/",
    "timestamp": "2025-07-28T06:41:11Z"
  },
  {
    "title": "CNBC Daily Open: This week's the Olympics for market watchers",
    "description": "These five days will basically be the Olympics for market watchers. And looming over them is Trump's Aug. 1 deadline for his new tariffs.",
    "link": "https://www.cnbc.com/2025/07/28/cnbc-daily-open-this-weeks-the-olympics-for-market-watchers.html",
    "timestamp": "2025-07-28T06:30:01Z"
  },
  {
    "title": "'Total Mental Collapse': Trump Ripped After 'Insane' New Ramble In Europe",
    "description": "Critics tore into the president after an unexpected digression against a familiar target.",
    "link": "https://www.huffpost.com/entry/trump-europe-wind-power-rant_n_6886ecb0e4b0b306e5bb35ac",
    "timestamp": "2025-07-28T06:28:41Z"
  },
  {
    "title": "Democrats probe housing regulator over considering crypto in mortgages",
    "description": "Senate Democrats have probed Federal Housing Finance Agency director William Pulte over his order to Fannie Mae and Freddie Mac to consider how they can assess crypto for mortgages.",
    "link": "https://cointelegraph.com/news/democrats-probe-housing-regulator-considering-crypto-mortgages",
    "timestamp": "2025-07-28T06:28:17Z"
  },
  {
    "title": "Hong Kong's CK Hutchison seeks Chinese investor to join Panama Ports deal",
    "description": "A Hong Kong conglomerate that’s selling ports at the Panama Canal says it may seek a Chinese investor to join a consortium of buyers",
    "link": "https://abcnews.go.com/Business/wireStory/hong-kongs-ck-hutchison-seeks-chinese-investor-join-124126111",
    "timestamp": "2025-07-28T06:28:04Z"
  },
  {
    "title": "CIA Director Ratcliffe: Former Obama Intel Officials May Still Face Criminal Liability Despite Statute of Limitations",
    "description": "During this week's broadcast of FNC's \"Sunday Morning Futures,\" CIA Director John Ratcliffe suggested that, despite the expiration of a statute of limitations on possible crimes committed by members of the outgoing Obama administration during the 2016 electio…",
    "link": "https://www.breitbart.com/clips/2025/07/27/cia-director-ratcliffe-former-obama-intel-officials-may-still-face-criminal-liability-despite-statute-of-limitations/",
    "timestamp": "2025-07-28T06:27:38Z"
  },
  {
    "title": "Can his golf course 'further' US-UK relations? Trump will use meeting with PM to try",
    "description": "President Donald Trump is meeting with British Prime Minister Keir Starmer at his Turnberry golf property in Scotland",
    "link": "https://abcnews.go.com/International/wireStory/golf-us-uk-relations-trump-meeting-prime-minister-124126879",
    "timestamp": "2025-07-28T06:26:13Z"
  },
  {
    "title": "Trump targets Harvard for a bigger settlement than Columbia: What the $2 billion pressure campaign means for US universities",
    "description": "Harvard University and the Trump administration are in talks. The discussion is about restoring over $2 billion in frozen federal research funds. President Donald Trump wants major changes at Harvard. These changes include diversity rollbacks and ideological …",
    "link": "https://timesofindia.indiatimes.com/education/news/trump-targets-harvard-for-a-bigger-settlement-than-columbia-whats-behind-the-2-billion-pressure-campaign/articleshow/122946722.cms",
    "timestamp": "2025-07-28T06:24:58Z"
  },
  {
    "title": "European Union resigned to 15 percent US tariff",
    "description": "The United States and European Union clinched a trade agreement on Sunday that will see EU exports taxed at 15 percent, in a bid to resolve a transatlantic tariff stand-off that threatened to explode into a full-blown trade war.",
    "link": "https://www.hurriyetdailynews.com/european-union-resigned-to-15-percent-us-tariff-211921",
    "timestamp": "2025-07-28T06:24:17Z"
  },
  {
    "title": "Cambodian and Thai leaders hold ceasefire talks in Malaysia as border violence enters fifth day",
    "description": "Thai and Cambodian leaders are meeting in Malaysia in an urgent effort to resolve deadly border clashes that entered a fifth day despite mounting international calls for peace.",
    "link": "https://www.independent.ie/world-news/asia-pacific/cambodian-and-thai-leaders-hold-ceasefire-talks-in-malaysia-as-border-violence-enters-fifth-day/a2147008530.html",
    "timestamp": "2025-07-28T06:24:09Z"
  },
  {
    "title": "EU-US trade deal: ‘A dark day’ for Europe says French PM as Hungary's Orban says agreement is worse than UK’s",
    "description": "The US struck a framework trade agreement with the European Union on Sunday, imposing a 15pc import tariff on most EU goods - half the threatened rate - and averting a bigger trade war between the two allies that account for almost a third of global trade.",
    "link": "https://www.independent.ie/irish-news/politics/eu-us-trade-deal-a-dark-day-for-europe-says-french-pm-as-hungarys-orban-says-agreement-is-worse-than-uks/a1942953498.html",
    "timestamp": "2025-07-28T06:23:00Z"
  },
  {
    "title": "Asian shares are mixed after Wall Street sets more records for US stocks",
    "description": "Stock markets in Asia are mixed after U.S. stocks rose to more records as they closed out another winning week",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-mixed-after-wall-street-sets-records-124127601",
    "timestamp": "2025-07-28T06:22:28Z"
  },
  {
    "title": "Cambodian and Thai leaders hold ceasefire talks as border violence enters fifth day",
    "description": "Thai and Cambodian leaders are meeting in Malaysia to resolve deadly border clashes",
    "link": "https://abcnews.go.com/International/wireStory/cambodian-thai-leaders-hold-ceasefire-talks-malaysia-border-124127791",
    "timestamp": "2025-07-28T06:21:38Z"
  },
  {
    "title": "Thailand and Cambodia truce talks due as strikes continue",
    "description": "Thailand and Cambodia's leaders are due to meet for peace talks, as a festering territorial dispute along their shared frontier dragged into a fifth day of open combat.",
    "link": "https://www.rte.ie/news/2025/0728/1525642-thailand-cambodia/",
    "timestamp": "2025-07-28T06:17:58Z"
  },
  {
    "title": "Europe up premarket after US-EU trade deal",
    "description": "European stock indexes traded higher in the premarket hours on Monday after the United States and the European Union reached a widely expected trade agreement the day before. US President Donald Trump...",
    "link": "https://biztoc.com/x/ea05cbf360e7cc7b",
    "timestamp": "2025-07-28T06:16:44Z"
  },
  {
    "title": "Trump gets a handshake, Europe gets a shakedown",
    "description": "In today’s edition of The Capitals, read about transatlantic stability coming at a price, NGOs defying Brussels over a lobbying clause, Merz pushing Netanyahu for a ceasefire, and Orban threatening to block the EU budget",
    "link": "https://www.euractiv.com/section/politics/news/trump-gets-a-handshake-europe-gets-a-shakedown/",
    "timestamp": "2025-07-28T06:16:40Z"
  },
  {
    "title": "Heineken's first-half profits beat forecasts",
    "description": "Dutch brewer Heineken has today reported a 7.4% rise in half-year organic operating profit, ahead of analyst expectations, even as its sales in Europe dragged and tariff risks increased.",
    "link": "https://www.rte.ie/news/business/2025/0728/1525644-heineken-half-year-results/",
    "timestamp": "2025-07-28T06:13:41Z"
  },
  {
    "title": "Starmer caves to Hamas' starvation campaign",
    "description": "British Prime Minister is expected to convene his cabinet members during the summer recess to discuss the war in Gaza and urge President Trump to 'exert greater pressure on Israel.'",
    "link": "https://www.israelnationalnews.com/news/412355",
    "timestamp": "2025-07-28T06:10:00Z"
  },
  {
    "title": "Trump, EU’s Von Der Leyen cite conflicting details on trade deal",
    "description": "President Trump and European Commission President Von der Leyen's new trade agreement reveals discrepancies in key details, highlighting the challenges in its implementation. The EU agreed to a 15% tariff on most exports to the US, but disagreements persist r…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-eus-von-der-leyen-cite-conflicting-details-on-trade-deal/articleshow/122946597.cms",
    "timestamp": "2025-07-28T06:07:58Z"
  },
  {
    "title": "US-China set to resume Stockholm talks: From Xi-Trump meet to tariff truce, here's what to expect",
    "description": "Top officials from the US and China are meeting in Stockholm for trade discussions. They aim to extend a temporary truce and avoid new tariffs. A short-term pause is likely. A US-EU trade agreement was recently finalized. China will likely seek eased US tarif…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-set-to-resume-stockholm-talks-from-xi-trump-meet-to-tariff-truce-heres-what-to-expect/articleshow/122946497.cms",
    "timestamp": "2025-07-28T06:07:35Z"
  },
  {
    "title": "Europe __ after US-EU trade deal",
    "description": "European stock indexes traded higher in the premarket hours on Monday after the United States and the European Union reached a widely expected trade agreement the day before. US President Donald Trump...",
    "link": "https://biztoc.com/x/fa906295144e4380",
    "timestamp": "2025-07-28T06:05:37Z"
  },
  {
    "title": "Donald Trump pauses export controls to secure trade deal with China - report",
    "description": "",
    "link": "https://biztoc.com/x/b02e75f613ca2f4a",
    "timestamp": "2025-07-28T06:05:14Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Monday",
    "description": "A train derailment in Baden-Württemberg kills three and injures more, Chancellor Merz welcomes 15 percent tariffs, Germany's 'Chaos Computer Club' warns against the use of software made by US firm Palantir and more news on Monday, July 28th.",
    "link": "https://www.thelocal.de/20250728/today-in-germany-a-roundup-of-the-latest-news-on-monday-82",
    "timestamp": "2025-07-28T06:03:56Z"
  },
  {
    "title": "Taoiseach and Tánaiste welcome 15% tariff deal between EU and US",
    "description": "The deal was reached during a meeting between Donald Trump and the president of the European Commission on Sunday.",
    "link": "https://www.thejournal.ie/taoiseach-and-tanaiste-welcome-15-tariff-deal-between-eu-and-us-6775633-Jul2025/",
    "timestamp": "2025-07-28T05:57:48Z"
  },
  {
    "title": "Public Funding is the Solution to Media Bias, Not the Driver",
    "description": "If ever there was a sign that democracy in the United States is in dire straits, it was Congress’s rescission of $9 billion in funding for public media, achieved via a party-line vote of 216 to 213 on July 18, 2025. The vote took place despite the fact that m…",
    "link": "https://www.counterpunch.org/2025/07/28/public-funding-is-the-solution-to-media-bias-not-the-driver/",
    "timestamp": "2025-07-28T05:55:38Z"
  },
  {
    "title": "North Korea says South Korea's overtures 'great miscalculation'",
    "description": "North Korea has no interest in any policy or proposals for reconciliation from South Korea, the powerful sister of its leader Kim Jong Un said on Monday in the first response to South Korean liberal President Lee Jae Myung's peace overtures. Kim Yo Jong, who …",
    "link": "https://japantoday.com/category/world/north-korea-says-south-korea%27s-overtures-%27great-miscalculation%272",
    "timestamp": "2025-07-28T05:55:02Z"
  },
  {
    "title": "'Loktantra par var': Opposition MPs protest on SIR issue; Kharge, Rahul, Sonia, Akhilesh among protestors",
    "description": "The protest saw participation from across Opposition parties, with leaders holding banners which read \"Loktantra par vaar\" (attack on democracy) and placards that read \"Stop SIR\", accusing the government of undermining democratic values.",
    "link": "https://economictimes.indiatimes.com/news/elections/assembly-elections/bihar/loktantra-par-var-opposition-mps-protest-on-sir-issue-kharge-rahul-sonia-akhilesh-among-protestors/articleshow/122946491.cms",
    "timestamp": "2025-07-28T05:52:28Z"
  },
  {
    "title": "Global markets rise after US-EU trade agreement",
    "description": "S&P 500 futures rose 0.4% and the Nasdaq futures gained 0.5% while the euro firmed across the board",
    "link": "https://www.irishtimes.com/business/2025/07/28/global-markets-rise-after-us-eu-trade-agreement/",
    "timestamp": "2025-07-28T05:48:36Z"
  },
  {
    "title": "Florida County School Board Chair Deletes Facebook Comment Celebrating Hulk Hogan Death: 'One Less MAGA'",
    "description": "Sarah Rockwell, school board chair for Alachua County in Florida, publicly celebrated the death of famed wrestler Hulk Hogan.\nThe post Florida County School Board Chair Deletes Facebook Comment Celebrating Hulk Hogan Death: ‘One Less MAGA’ appeared first on B…",
    "link": "https://www.breitbart.com/sports/2025/07/27/florida-county-school-board-chair-deletes-facebook-comment-celebrating-hulk-hogan-death-one-less-maga/",
    "timestamp": "2025-07-28T05:45:32Z"
  },
  {
    "title": "Trump, Starmer to meet in Scotland, with trade and Gaza on agenda",
    "description": "Talks come as hunger crisis in Palestinian enclave worsens and US strikes tariff deal with EU",
    "link": "https://www.irishtimes.com/world/uk/2025/07/28/trump-starmer-to-meet-in-scotland-with-trade-and-gaza-on-agenda/",
    "timestamp": "2025-07-28T05:39:00Z"
  },
  {
    "title": "State of play in Trump’s tariffs, threats and delays",
    "description": "Dozens of economies including India, Canada and Mexico face threats of higher tariffs Friday if they fail to strike deals with Washington.\nThe post State of play in Trump’s tariffs, threats and delays appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/state-of-play-in-trumps-tariffs-threats-and-delays/article",
    "timestamp": "2025-07-28T05:37:27Z"
  },
  {
    "title": "Howard Lutnick Says Chip Import Probe Results Due In 2 Weeks As Trump Threatens New Tariffs To Force US Manufacturing Boom",
    "description": "On Sunday, Commerce Secretary Howard Lutnick said the U.S. will announce the results of its semiconductor import probe in two weeks.\nWhat Happened: Speaking after Donald Trump met with European Commission President Ursula von der Leyen, Lutnick said the natio…",
    "link": "https://biztoc.com/x/1b7b79288d806474",
    "timestamp": "2025-07-28T05:32:12Z"
  },
  {
    "title": "EU-US trade deal 'unbalanced' - French minister",
    "description": "A trade deal clinched by the United States and the European Union will provide temporary stability but is \"unbalanced,\" a French minister has said.",
    "link": "https://www.rte.ie/news/europe/2025/0728/1525638-trade-deal/",
    "timestamp": "2025-07-28T05:29:58Z"
  },
  {
    "title": "Tata Motors shares rise 2% as US-EU tariff deal eases trade concerns",
    "description": "Tata Motors shares: The agreement was announced on Sunday by U.S. President Donald Trump and European Commission President Ursula von der Leyen, narrowly avoiding the August 1 deadline that could have triggered a 30% blanket tariff on EU exports to the United…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-rise-2-as-us-eu-tariff-deal-eases-trade-concerns/articleshow/122946017.cms",
    "timestamp": "2025-07-28T05:28:43Z"
  },
  {
    "title": "Justice Department Prepares Crackdown on Trump Tariff Violators",
    "description": "Federal prosecutors are laying the groundwork to criminally charge companies and individuals that try to evade US tariffs as President Donald Trump readies a fresh round of levies next week. American customs officials have long sought to thwart attempts to …",
    "link": "https://www.insurancejournal.com/news/national/2025/07/28/833340.htm",
    "timestamp": "2025-07-28T05:25:28Z"
  },
  {
    "title": "Starmer to meet Trump for Gaza and trade talks at Turnberry",
    "description": "The leaders will meet at Trump's Ayrshire golf resort a day after the US president struck a new trade deal with the EU.",
    "link": "https://www.bbc.com/news/articles/cy854ze3rx7o",
    "timestamp": "2025-07-28T05:23:16Z"
  },
  {
    "title": "America is slipping behind India’s clean power boom",
    "description": "India's renewable energy sector is experiencing a remarkable resurgence, poised to become a clean energy superpower. Surging wind and solar installations are driven by easing inflation, regulatory deadlines, and ambitious government targets. With substantial …",
    "link": "https://economictimes.indiatimes.com/industry/renewables/america-is-slipping-behind-indias-clean-power-boom/articleshow/122945711.cms",
    "timestamp": "2025-07-28T05:20:45Z"
  },
  {
    "title": "American Publishers Look at the White House AI Action Plan",
    "description": "The Association of American Publishers assesses elements of the Trump administration's  'AI Action Plan' and copyright concerns.\nThe post American Publishers Look at the White House AI Action Plan appeared first on Publishing Perspectives.",
    "link": "https://publishingperspectives.com/2025/07/american-publishers-look-at-the-white-house-ai-action-plan/",
    "timestamp": "2025-07-28T05:18:00Z"
  }
]