[
  {
    "title": "Abrego Garcia’s Attorneys Throw Last-Minute Hail Mary To Save Him From Deportation",
    "description": "Kilmar Abrego Garcia's attorneys requested he remain locked up in order to prevent the Trump administration from swiftly deporting him from the United States.",
    "link": "https://dailycaller.com/2025/06/27/abrego-garcias-hail-mary-on-deportation/",
    "timestamp": "2025-06-27T15:42:26Z"
  },
  {
    "title": "Trump hails ‘giant win’ as supreme court rules on his birthright citizenship order",
    "description": "Decision, split 6:3 along ideological lines, may allow for a reshaping of how citizenship in US is granted",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/06/27/us/supreme-court-birthright-citizenship.html",
    "timestamp": "2025-06-27T15:42:17Z"
  },
  {
    "title": "Sotomayor Rips SCOTUS for Causing Total “Chaos” With LGBT Books Ruling",
    "description": "Justice Sonia Sotomayor excoriated the nation’s highest judiciary Friday for ruling 6–3 to permit a group of Maryland parents to withdraw their children from LGBTQ+ exposure in the public school curriculum on the basis of religious freedom.\r\nThe progressive j…",
    "link": "https://newrepublic.com/post/197366/supreme-court-sonia-sotomayor-lgbt-books-chaos-censorship",
    "timestamp": "2025-06-27T15:42:02Z"
  },
  {
    "title": "In win for Trump, US Supreme Court limits judges' power to block birthright citizenship order",
    "description": "WASHINGTON (Reuters) -The U.S. Supreme Court dealt a blow on Friday to the power of federal judges by restricting their ability to grant broad legal relief in cases as the justices acted in a legal fight over President Donald Trump's bid to limit birthright c…",
    "link": "https://www.thestar.com.my/news/world/2025/06/27/in-win-for-trump-us-supreme-court-limits-judges039-power-to-block-birthright-citizenship-order",
    "timestamp": "2025-06-27T15:42:00Z"
  },
  {
    "title": "Gavin Newsom Hits Fox News With $787 Million Defamation Lawsuit",
    "description": "California Gov. Gavin Newsom (D) is suing Fox News after the network falsely claimed Newsom lied about a call he had with President Donald Trump.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-hits-fox-news-with-787-million-defamation-lawsuit_n_685ea3b2e4b00f68e51c88c3",
    "timestamp": "2025-06-27T15:41:53Z"
  },
  {
    "title": "90 Deals in 90 Days? Trump's Trade War Is Failing on Its Own Terms",
    "description": "The trade deficit is getting bigger, the deals aren't coming, and foreign investment has declined.",
    "link": "https://reason.com/2025/06/27/90-deals-in-90-days-trumps-trade-war-is-failing-on-its-own-terms/",
    "timestamp": "2025-06-27T15:40:30Z"
  },
  {
    "title": "Remembering Bill Moyers, Who Always Strived to Make the Future Work",
    "description": "A point of personal privilege, as they say: I want to take a minute to mark the death and life of Bill Moyers, first because he was a friend and an integral if quiet part of the climate fight, but also because I think—more than almost anyone else—he puts our …",
    "link": "https://billmckibben.substack.com/p/a-great-and-good-man",
    "timestamp": "2025-06-27T15:39:37Z"
  },
  {
    "title": "Dem Donors Not Jumping For Joy Over Idea Of Kamala Harris Comeback",
    "description": "Many Democratic donors are largely unenthused about a potential Kamala Harris gubernatorial run, Politico reported on Friday.",
    "link": "https://dailycaller.com/2025/06/27/democratic-donors-kamala-harris-governor-california-comeback/",
    "timestamp": "2025-06-27T15:39:36Z"
  },
  {
    "title": "Trump Celebrates Supreme Court Win On Court Injunction Limits",
    "description": "President Donald Trump will hold a White House news conference at 11:30 a.m. ET today following what he called a “giant win” at the U.S. Supreme Court in Trump v. CASA. \nThe ruling limits the power of lower courts to issue nationwide injunctions, a tool previ…",
    "link": "https://biztoc.com/x/8364545b2211f9c1",
    "timestamp": "2025-06-27T15:39:35Z"
  },
  {
    "title": "Trump Supporter Detained by ICE Thought Only Criminals Would Be Deported",
    "description": "ICE detentions and deportations are impacting families across the country.",
    "link": "https://www.newsweek.com/trump-supporter-detained-ice-thought-only-criminals-would-deported-2091501",
    "timestamp": "2025-06-27T15:39:30Z"
  },
  {
    "title": "Trump has ramped up pressure on Fed Chair Powell to cut rates. There's one big reason it probably won't work.",
    "description": "Trump has been highly critical of Fed chair Powell for not cutting rates. Some see Trump's pressure campaign against the central bank chief as futile.",
    "link": "https://www.businessinsider.com/trump-powell-replacement-lower-interest-rates-fed-rate-cuts-inflation-2025-6",
    "timestamp": "2025-06-27T15:39:10Z"
  },
  {
    "title": "Mystery Artists Return With Trump Dance Sculpture on the National Mall",
    "description": "“In the United States of America you have the freedom to display your so-called ‘art,’ no matter how ugly it is.” — The Trump White House, June 2025",
    "link": "https://www.artnews.com/art-news/news/mystery-artists-return-with-trump-dance-sculpture-1234746367/",
    "timestamp": "2025-06-27T15:38:29Z"
  },
  {
    "title": "‘Conduct Unbecoming’: Veteran Group Leader Rips Hegseth For ‘Politicizing the Military’ With Wild Attack On the Media",
    "description": "\"To use a military term, it's ‘conduct unbecoming.’ He looks rattled. He obviously looks thin-skinned. He's extremely aggressive and volatile.\"\nThe post ‘Conduct Unbecoming’: Veteran Group Leader Rips Hegseth For ‘Politicizing the Military’ With Wild Attack O…",
    "link": "https://www.mediaite.com/media/tv/conduct-unbecoming-veteran-group-leader-rips-hegseth-for-politicizing-the-military-with-wild-attack-on-the-media/",
    "timestamp": "2025-06-27T15:35:09Z"
  },
  {
    "title": "WATCH LIVE: Trump holds news briefing after Supreme Court rules for limiting nationwide injunctions",
    "description": "The court is issuing decisions on the final six cases left on its docket for the summer, including those that are emergency appeals relating to Trump’s agenda.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-holds-news-briefing-after-supreme-court-rules-for-limiting-nationwide-injunctions",
    "timestamp": "2025-06-27T15:34:04Z"
  },
  {
    "title": "Book excerpt: \"Buckley: The Life and the Revolution That Changed America\"",
    "description": "Sam Tanenhaus' new biography examines the life and influence of the political commentator, magazine editor and TV debater who catalyzed America's conservative movement.",
    "link": "https://www.cbsnews.com/news/book-excerpt-buckley-the-life-and-the-revolution-that-changed-america/",
    "timestamp": "2025-06-27T15:32:11Z"
  },
  {
    "title": "For the fourth time, Affordable Care Act survives far-right Supreme Court challenge",
    "description": "Four times, conservatives have asked the U.S. Supreme Court to gut the Affordable Care Act. Four times, the justices have sided with \"Obamacare.\"",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/fourth-time-affordable-care-act-survives-far-right-supreme-court-chall-rcna215546",
    "timestamp": "2025-06-27T15:30:59Z"
  },
  {
    "title": "Supreme Court says Maryland parents can pull their kids from public school lessons using LGBTQ books",
    "description": "The Supreme Court has ruled that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks.",
    "link": "https://www.news4jax.com/business/2025/06/27/supreme-court-says-maryland-parents-can-pull-their-kids-from-public-school-lessons-using-lgbtq-books/",
    "timestamp": "2025-06-27T15:30:46Z"
  },
  {
    "title": "Bitcoin FOMO: Billionaire Admits Mistake For ‘Not Being Involved’",
    "description": "Philippe Laffont—the billionaire behind Coatue Management—went and dropped Bitcoin into his “Fantastic 40,” his own shortlist of what he thinks will shine as top investments over the next five years. Related Reading: Crypto Reserves Go Global: Nasdaq-Listed C…",
    "link": "https://bitcoinist.com/bitcoin-fomo-billionaire-admits-mistake-for-not-being-involved/",
    "timestamp": "2025-06-27T15:30:32Z"
  },
  {
    "title": "Joe Giudice Asks Donald Trump For Presidential Pardon 6 Years After Being Deported",
    "description": "Reading Time: 3 minutesJoe Giudice is asking Donald Trump to let him back in the country.\nJoe Giudice Asks Donald Trump For Presidential Pardon 6 Years After Being Deported was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/06/joe-giudice-asks-donald-trump-for-presidential-pardon-6-years-after-being-deported/",
    "timestamp": "2025-06-27T15:29:30Z"
  },
  {
    "title": "US Supreme Court limits lower courts' power to block Trump",
    "description": "The Supreme Court has limited the authority of individual district court judges to issue nationwide injunctions, in a decision that could benefit President Donald Trump. Supreme Court ruling curbs nationwide injunctions by lower courts\nUS President Donald Tru…",
    "link": "https://www.dw.com/en/us-supreme-court-limits-lower-courts-power-to-block-trump/live-73070073",
    "timestamp": "2025-06-27T15:29:00Z"
  },
  {
    "title": "Trump hails Supreme Court judgement on birthright citizenship as giant win",
    "description": "The Supreme Court limited lower courts' power to issue nationwide injunctions, a victory for Trump's agenda, though his birthright citizenship order remains partially blocked. The ruling addresses concerns about 'forum shopping' and single judges halting nati…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-hails-supreme-court-judgement-on-birthright-citizenship-as-giant-win/articleshow/122116635.cms",
    "timestamp": "2025-06-27T15:28:30Z"
  },
  {
    "title": "New York Times attorney tells Trump no apology coming for coverage of Iran strikes",
    "description": "President Trump demanded an apology from New York Times over its Iran strike coverage, but the paper's attorney stood firm, saying \"no retraction is needed\" or is coming.",
    "link": "https://www.foxnews.com/media/new-york-times-attorney-tells-trump-no-apology-coming-coverage-iran-strikes",
    "timestamp": "2025-06-27T15:27:56Z"
  },
  {
    "title": "Supreme Court Upholds Texas Law Blocking Kids From Online Porn",
    "description": "The decision reinforces efforts by nearly half of all U.S. states that have passed similar age-verification laws.",
    "link": "https://www.newsweek.com/supreme-court-texas-online-porn-children-ruling-2091730",
    "timestamp": "2025-06-27T15:27:34Z"
  },
  {
    "title": "North Korean Dictator Kim Jong Un to Open Gigantic Beachfront Resort to Boost Tourism",
    "description": "North Korean “Supreme Leader” Kim Jong Un officially inaugurated the Wonsan‑Kalma coastal resort on June 24 — a lavish project covering over 2.5 miles of beach, outfitted with hotels, restaurants, shopping centers, and a water park. Framed by state media as t…",
    "link": "https://freerepublic.com/focus/f-chat/4325641/posts",
    "timestamp": "2025-06-27T15:27:21Z"
  },
  {
    "title": "Planned Belgrade Trump Tower Slammed by Europe Heritage Watchdog (Misha Savic/Bloomberg)",
    "description": "Misha Savic / Bloomberg:\nPlanned Belgrade Trump Tower Slammed by Europe Heritage Watchdog  —  Serbia must protect its monuments and defy plans by Donald Trump's son-in-law to raze downtown blocs in the nation's capital to make way for a large real estate proj…",
    "link": "https://www.memeorandum.com/250627/p64",
    "timestamp": "2025-06-27T15:25:01Z"
  },
  {
    "title": "Susan Collins' Chances of Winning Re-election in Maine, According to Polls",
    "description": "Republican Senator Susan Collins is facing an uphill battle as she prepares to seek a sixth term in 2026.",
    "link": "https://www.newsweek.com/susan-collins-maine-senate-2026-poll-2091638",
    "timestamp": "2025-06-27T15:24:45Z"
  },
  {
    "title": "Another chaotic week in Trumpland as Nato summit navigates ‘daddy’ issues",
    "description": "From a Dáil row over the GPO to further housing woes, your essential end-of-week politics catch-up",
    "link": "https://www.irishtimes.com/politics/2025/06/27/another-chaotic-week-in-trumpland-as-nato-summit-navigates-daddy-issues/",
    "timestamp": "2025-06-27T15:24:32Z"
  },
  {
    "title": "New twist in Trump's immigration crackdown: Kristi Noem drops bombshell, names target countries accepting deported migrants",
    "description": "Homeland Security Secretary Kristi Noem had made a surprising announcement regarding two countries who will take deported asylum seekers.  Guatemala and Honduras have signed agreements with the United States to potentially offer refuge to people from other co…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/new-twist-in-trumps-immigration-crackdown-kristi-noem-drops-bombshell-names-target-countries-accepting-deported-migrants/articleshow/122116506.cms",
    "timestamp": "2025-06-27T15:24:21Z"
  },
  {
    "title": "Trump-Linked DeFi Project World Liberty Teams With Re7 for USD1 Stablecoin Vault",
    "description": "The Re7 Capital partnership marks latest push to scale World Liberty's stablecoin ecosystem on BNB Chain.",
    "link": "https://www.coindesk.com/business/2025/06/27/trump-linked-defi-project-world-liberty-teams-with-re7-for-usd1-stablecoin-vault",
    "timestamp": "2025-06-27T15:24:14Z"
  },
  {
    "title": "Economists Raise Growth Outlook for Canada as Tariff Threats Ease",
    "description": "Analysts boosted their forecasts for economic growth in Canada this year as fears of a drawn-out trade dispute with the US fade.",
    "link": "https://financialpost.com/pmn/business-pmn/economists-raise-growth-outlook-for-canada-as-tariff-threats-ease",
    "timestamp": "2025-06-27T15:23:59Z"
  },
  {
    "title": "A new low for Democrats, Newsom's $9 gas nightmare, and more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/new-low-democrats-newsoms-9-gas-nightmare-more-from-fox-news-opinion",
    "timestamp": "2025-06-27T15:23:54Z"
  },
  {
    "title": "Putin: Would be 'happy' to meet with Trump",
    "description": "Russian President Vladimir Putin told journalists on Friday that a meeting with his United States counterpart Donald Trump is \"quite possible.\" \"I'm always open to contact and meetings ... We would be happy to prepare for it,\" the Russian head of state assert…",
    "link": "https://freerepublic.com/focus/f-chat/4325639/posts",
    "timestamp": "2025-06-27T15:23:24Z"
  },
  {
    "title": "30% increase in navigation in the Strait of Hormuz after the Israel-Iran ceasefire",
    "description": "Despite ceasefire, ships emit unusual nationality signals to avoid attacks - Visible risk of interference to naval tracking systems\nThe post 30% increase in navigation in the Strait of Hormuz after the Israel-Iran ceasefire appeared first on ProtoThema Englis…",
    "link": "https://en.protothema.gr/2025/06/27/30-increase-in-navigation-in-the-strait-of-hormuz-after-the-israel-iran-ceasefire/",
    "timestamp": "2025-06-27T15:23:05Z"
  },
  {
    "title": "Supreme Court rules in favor of Donald Trump's birthright citizenship proposal",
    "description": "The US Supreme Court has ruled in favor of Donald Trump's administration regarding birthright citizenship. The court narrowed the scope of nationwide injunctions. This allows Trump's proposal to potentially move forward in some states. Justice Amy Coney Barre…",
    "link": "https://economictimes.indiatimes.com/news/international/us/supreme-court-rules-in-favor-of-donald-trumps-birthright-citizenship-proposal/articleshow/122115993.cms",
    "timestamp": "2025-06-27T15:22:51Z"
  },
  {
    "title": "BREAKING: SCOTUS Reins In Rogue Judges In Massive Win For Trump",
    "description": "President Donald Trump and his administration are rejoicing on Friday as the Supreme Court issued a ruling limiting the authority of judges to issue nationwide injunctions. Nationwide injunctions are sweeping orders issued by district courts to block executiv…",
    "link": "https://freerepublic.com/focus/f-news/4325638/posts",
    "timestamp": "2025-06-27T15:21:59Z"
  },
  {
    "title": "BREAKING: SCOTUS Reins In Rogue Judges In Massive Win For Trump",
    "description": "President Donald Trump and his administration are rejoicing on Friday as the Supreme Court issued a ruling limiting the authority of judges to issue nationwide injunctions. Nationwide injunctions are sweeping orders issued by district courts to block executiv…",
    "link": "https://freerepublic.com/focus/f-chat/4325638/posts",
    "timestamp": "2025-06-27T15:21:59Z"
  },
  {
    "title": "The Internet Is Calling Out Karoline Leavitt In The Most Hilarious Way After She Claimed Trump Coined A 2000-Year-Old Phrase",
    "description": "\"Does ANYONE in this administration read ANY history?\"",
    "link": "https://www.buzzfeed.com/edmazza/karoline-leavitt-trump-peace-through-strength",
    "timestamp": "2025-06-27T15:21:32Z"
  },
  {
    "title": "MSNBC’s Melissa Murray Bummed SCOTUS Limited Ability Of District Judges To Hamstring Trump Admin",
    "description": "Melissa Murray criticized the Supreme Court for ending lower courts’ power to block Donald Trump's administration's policies through nationwide injunctions.",
    "link": "https://dailycaller.com/2025/06/27/msnbcs-melissa-murray-bummed-scotus-limited-ability-of-district-judges-hamstring-trump-admin/",
    "timestamp": "2025-06-27T15:21:12Z"
  },
  {
    "title": "Amy Coney Barrett Scorches Ketanji Brown Jackson's Dissenting Opinion for 'Embracing an Imperial Judiciary'",
    "description": "Justice Amy Coney Barrett scorched Justice Ketanji Brown Jackson's dissenting opinion in a nationwide injuctions case.\nThe post Amy Coney Barrett Scorches Ketanji Brown Jackson’s Dissenting Opinion for ‘Embracing an Imperial Judiciary’ appeared first on Breit…",
    "link": "https://www.breitbart.com/politics/2025/06/27/amy-coney-barrett-scorches-ketanji-brown-jacksons-dissenting-opinion-embracing-imperial-judiciary/",
    "timestamp": "2025-06-27T15:20:25Z"
  },
  {
    "title": "Street Fighter Movie Casts Anti-Woke Online Personality As Dan",
    "description": "Less than 24 hours ago, we ran a story on the bonkers cast for the upcoming live-action Street Fighter movie. It’s full of the weirdest motley crew of actors I’ve seen in a big-budget film as of late, with rapper 50 Cent, masked country singer Orville Peck, a…",
    "link": "https://kotaku.com/street-fighter-movie-andrew-schulz-dan-hibiki-cast-1851785220",
    "timestamp": "2025-06-27T15:19:00Z"
  },
  {
    "title": "Donald Trump u-turns on bold claim days after launch of $499 golden mobile phone",
    "description": "The Trump Organisation has removed the 'Made in the USA' from the upcoming $499 golden 'Trump phone' days ahead of launch.",
    "link": "https://www.ladbible.com/news/technology/donald-trump-golden-mobile-phone-made-america-claim-682187-20250627",
    "timestamp": "2025-06-27T15:18:19Z"
  },
  {
    "title": "Supreme Court Backs Texas’ Age Verification Law For Adult Websites",
    "description": "Plaintiffs argued the law violated people’s privacy rights and could be used to restrict media, such as R-rated movies.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/06/27/supreme-court-backs-texas-age-verification-law-for-adult-websites/",
    "timestamp": "2025-06-27T15:18:03Z"
  },
  {
    "title": "Brits warned over shocking price of petrol if Iran follows through with plan to retaliate",
    "description": "An economist has warned Brits about a potential surge in oil prices if Iran decides to follow through with one particular retaliation plan.",
    "link": "https://www.ladbible.com/news/world-news/how-much-oil-petrol-prices-uk-increase-strait-hormuz-iran-israel-585071-20250624",
    "timestamp": "2025-06-27T15:17:22Z"
  },
  {
    "title": "Scott Bessent Offers New Details On China Deal Negotiations",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nTreasury Secretary Scott Bessent has offered new insights into the Trump administration's trade negotiations with China.\nPresident Donald Trump announced that he had signed a trade deal with China on Wednesday…",
    "link": "https://biztoc.com/x/3fe3d5e11204bc3c",
    "timestamp": "2025-06-27T15:17:17Z"
  },
  {
    "title": "Donald Trump to Invent Trade Deals for Countries That Refuse to Negotiate",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump may unilaterally decide the tariff rates that countries will face if they fail to strike a deal by the end of the 90-day pause on reciprocal duties, according to the White House.\nSpeakin…",
    "link": "https://biztoc.com/x/1b1ff2edbf59f694",
    "timestamp": "2025-06-27T15:17:15Z"
  },
  {
    "title": "SCOTUS limits courts' ability to block Trump's birthright citizenship plan",
    "description": "The US Supreme Court on Friday handed President Donald Trump a major win by limiting the power of lower courts to block his controversial plan to end birthright citizenship in the country.\nIn a 6-3 decision, the court limited the use of nationwide injunctions…",
    "link": "https://biztoc.com/x/ebdfa414159f5575",
    "timestamp": "2025-06-27T15:17:05Z"
  },
  {
    "title": "‘Special kind of stupid’: Trump slammed for ‘terrible’ news about the economy",
    "description": "Social media users are grilling President Donald Trump after the U.S. economy shrank to negative for this year’s first quarter, the Commerce Department said on Thursday in a final estimate.\nThe Commerce Department said the U.S. gross domestic product, an over…",
    "link": "https://biztoc.com/x/9a5e8e095b96d86f",
    "timestamp": "2025-06-27T15:17:02Z"
  },
  {
    "title": "Lawyers for Kilmar Abrego Garcia ask judge to keep him in jail over deportation concerns",
    "description": "Abrego Garcia’s attorneys said they cannot put any faith in what the Justice Department says.",
    "link": "https://www.bostonherald.com/2025/06/27/kilmar-abrego-garcia-deportation-error/",
    "timestamp": "2025-06-27T15:16:44Z"
  },
  {
    "title": "Gavin Newsom targets Fox News in a $787-million lawsuit",
    "description": "California Gov. Gavin Newsom filed a multimillion-dollar lawsuit agains Fox News on Friday.",
    "link": "https://www.nbcnews.com/politics/politics-news/gavin-newsom-targets-fox-news-787-million-lawsuit-rcna215522",
    "timestamp": "2025-06-27T15:15:54Z"
  },
  {
    "title": "What Is Birthright Citizenship? A Closer Look at the 14th Amendment",
    "description": "As the U.S. Supreme Court weighs Trump’s executive order to restrict birthright citizenship, learn what the 14th Amendment says and where the legal battle stands today.",
    "link": "https://hollywoodlife.com/feature/what-is-birthright-citizenship-14th-amendment-5352361/",
    "timestamp": "2025-06-27T15:15:47Z"
  },
  {
    "title": "Supreme Court Legalizes Trump Presidency",
    "description": "WASHINGTON, D.C. — The Supreme Court issued a ruling this morning that it is legal for President Donald Trump to be the president.",
    "link": "https://babylonbee.com/news/supreme-court-legalizes-trump-presidency",
    "timestamp": "2025-06-27T15:13:26Z"
  },
  {
    "title": "Liberal Justices Scorch Birthright Citizenship Opinion In Foreboding Dissent",
    "description": "\"It is not difficult to predict how this all ends,\" Justice Jackson ominously predicted.",
    "link": "https://www.huffpost.com/entry/scotus-birthright-decision-dissent_n_685ea633e4b0bc17d54c6b83",
    "timestamp": "2025-06-27T15:13:17Z"
  },
  {
    "title": "Supreme Court Signals Support for Religious Opt-Outs on LGBTQ Books",
    "description": "The case is one of several this term in which the Supreme Court has leaned toward expanding religious rights.",
    "link": "https://www.newsweek.com/supreme-court-religious-rights-lgbtq-books-2091705",
    "timestamp": "2025-06-27T15:12:28Z"
  },
  {
    "title": "CNN’s Elie Honig Says SCOTUS Ruling Will Boxout District Judges From Kneecapping Trump’s Executive Orders",
    "description": "CNN senior legal analyst Elie Honig said that the Supreme Court expanded President Donald Trump's power to issue executive orders.",
    "link": "https://dailycaller.com/2025/06/27/cnn-elie-honig-scotus-trump-expansion-lower-courts-birthright-citizenship/",
    "timestamp": "2025-06-27T15:12:04Z"
  },
  {
    "title": "New Poll Shows Just How Hard Hispanic Voters Broke Toward Trump",
    "description": "President Donald Trump won more of a key demographic's vote in the 2024 election than previously known, a new poll shows.",
    "link": "https://dailycaller.com/2025/06/27/donald-trump-hispanic-voters-2024-2020-2016-new-poll-kamala-harris/",
    "timestamp": "2025-06-27T15:10:28Z"
  },
  {
    "title": "'Deathblow to the rule of law': Expert reacts to major Supreme Court ruling",
    "description": "A ruling from the 6-3 conservative majority Supreme Court that made a major ruling regarding President Donald Trump's attempts to limit birthright citizenship is a \"deathblow to the rule of law,\" according to one noted legal scholar.Appearing on MSNBC moments…",
    "link": "https://www.rawstory.com/supreme-court-deathblow/",
    "timestamp": "2025-06-27T15:10:28Z"
  },
  {
    "title": "Donald Trump to Invent Trade Deals for Countries That Refuse to Negotiate",
    "description": "As the 90-day pause on reciprocal tariffs ends, the White House says Trump can \"pick\" what rate will apply to each country.",
    "link": "https://www.newsweek.com/donald-trump-inventing-trade-deals-tariff-pause-2091635",
    "timestamp": "2025-06-27T15:10:14Z"
  },
  {
    "title": "Oil Steadies at End of Turbulent Week as Focus Shifts to Tariffs",
    "description": "Oil gained as traders assessed conflicting comments on the status of nuclear talks between the US and Iran as well as a positive turn in trade negotiations with China.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-steadies-at-end-of-turbulent-week-as-focus-shifts-to-tariffs",
    "timestamp": "2025-06-27T15:09:27Z"
  },
  {
    "title": "Supreme Court says Maryland parents can pull their kids from public school lessons using LGBTQ books",
    "description": "The Supreme Court has ruled that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks. The justices Friday reversed lower-court rulings in favor of the Montgomery County school system in subu…",
    "link": "https://www.seattlepi.com/business/article/supreme-court-says-maryland-parents-can-pull-20397140.php",
    "timestamp": "2025-06-27T15:06:54Z"
  },
  {
    "title": "Trump hails Supreme Court ruling curbing judge injunctions",
    "description": "United States President Donald Trump celebrated on Friday a Supreme Court decision that restricted the power of federal judges to issue nationwide injunctions.The president called the decision \"GIANT ...",
    "link": "https://biztoc.com/x/b6edcefe77d35440",
    "timestamp": "2025-06-27T15:06:15Z"
  },
  {
    "title": "The Supreme Court’s birthright citizenship decision isn’t as devastating as you think",
    "description": "Justices Brett Kavanaugh and Amy Coney Barrett and former Associate Justice Anthony Kennedy talk with President Donald Trump as he arrives to address to a joint session of Congress on March 4, 2025. | Chip Somodevilla/Getty Images \nOn Friday, the Supreme Cour…",
    "link": "https://biztoc.com/x/39e1a5362cec9805",
    "timestamp": "2025-06-27T15:06:12Z"
  },
  {
    "title": "Putin: Would be 'happy' to meet with Trump",
    "description": "Russian President Vladimir Putin told journalists on Friday that a meeting with his United States counterpart Donald Trump is \"quite possible.\"\"I'm always open to contact and meetings ... We would be ...",
    "link": "https://biztoc.com/x/06df06cb41f5bfb8",
    "timestamp": "2025-06-27T15:06:10Z"
  },
  {
    "title": "Donald Trump Touts Supreme Court Victory: 'GIANT WIN'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump reacted to Friday to what he called a \"GIANT WIN\" in Friday's Supreme Court ruling on birthright citizenship.\nTrump posted on Truth Social, \"GIANT WIN in the United States Supreme Court!…",
    "link": "https://biztoc.com/x/6112243d854bceda",
    "timestamp": "2025-06-27T15:05:51Z"
  },
  {
    "title": "Bad News, THE GROCERIES!",
    "description": "You are now more expensive than ever!",
    "link": "https://www.wonkette.com/p/bad-news-the-groceries",
    "timestamp": "2025-06-27T15:05:47Z"
  },
  {
    "title": "Scott Bessent Offers New Details On China Deal Negotiations",
    "description": "Treasury Secretary Scott Bessent has offered new insights into the Trump administration's trade negotiations with China.",
    "link": "https://www.newsweek.com/scott-bessent-offers-new-details-china-deal-negotiations-2091690",
    "timestamp": "2025-06-27T15:05:42Z"
  },
  {
    "title": "The Supreme Court’s birthright citizenship decision isn’t as devastating as you think",
    "description": "On Friday, the Supreme Court released its long-awaited decision in Trump v. CASA, a case challenging President Donald Trump’s attempt to strip many Americans of citizenship. The Court handed Trump a narrow victory along party lines, with all six Republicans i…",
    "link": "https://www.vox.com/scotus/417954/supreme-court-birthright-citizenship-trump-casa-nationwide-injunctions",
    "timestamp": "2025-06-27T15:05:24Z"
  },
  {
    "title": "In a hot fighter-jet market, an F-35 is unable to take off",
    "description": "Amidst a booming fighter jet market driven by geopolitical tensions and modernization efforts, the F-35 faces scrutiny due to rising costs and reliance on US technology. A recent incident involving a stranded British F-35B in India has sparked concerns about …",
    "link": "https://economictimes.indiatimes.com/news/defence/in-a-hot-fighter-jet-market-an-f-35-is-unable-to-take-off/articleshow/122116208.cms",
    "timestamp": "2025-06-27T15:04:17Z"
  },
  {
    "title": "'To do with babies of slaves': Trump announces 'giant win' with history lesson",
    "description": "Donald Trump on Friday announced his big win at the Supreme Court in a birthright citizenship case.\"GIANT WIN in the United States Supreme Court! Even the Birthright Citizenship Hoax has been, indirectly, hit hard,\" Trump wrote on Truth Social. \"It had to do …",
    "link": "https://www.rawstory.com/trump-announces-press-conference/",
    "timestamp": "2025-06-27T15:02:54Z"
  },
  {
    "title": "Supreme Court Sides With Homophobes on LGBTQ Books in Schools",
    "description": "Cue the book bans.\r\nThe Supreme Court sided Friday with a group of Maryland parents in Mahmoud v. Taylor, ruling 6–3 to allow them to pull their children from instruction that involves LGBTQ+ themes.\r\nIn 2022, the Montgomery County school board approved the u…",
    "link": "https://newrepublic.com/post/197362/supreme-court-parents-lgbtq-book-bans-schools",
    "timestamp": "2025-06-27T15:02:35Z"
  },
  {
    "title": "Donald Trump Touts Supreme Court Victory: 'GIANT WIN'",
    "description": "The Supreme Court ruled that individual judges do not have the authority to issue nationwide injunctions, delivering a win for Trump.",
    "link": "https://www.newsweek.com/donald-trump-reacts-supreme-court-victory-giant-win-2091695",
    "timestamp": "2025-06-27T15:01:26Z"
  },
  {
    "title": "Supreme Court Limits Lower Courts’ Power to Block Trump’s Birthright Citizenship Order",
    "description": "In a 6-to-3 decision split along ideological lines, the Court ruled that lower federal judges had overstepped their authority by imposing nationwide injunctions",
    "link": "https://time.com/7298296/supreme-court-birthright-citizenship-injunctions/",
    "timestamp": "2025-06-27T15:01:26Z"
  },
  {
    "title": "U.S. Supreme Court limits nationwide injunctions, in case on Trump birthright citizenship order",
    "description": "In a major victory for Donald Trump, and potentially future presidents, the U.S. Supreme Court dealt a blow on Friday to the power of federal judges by restricting their ability to grant broad legal relief nationally. The justices did not settle the merits of…",
    "link": "https://www.cbc.ca/news/world/scotus-opinion-trump-casa-1.7572403",
    "timestamp": "2025-06-27T15:01:06Z"
  },
  {
    "title": "But fate unclear...",
    "description": null,
    "link": "https://apnews.com/live/supreme-court-decisions-updates",
    "timestamp": "2025-06-27T15:00:03Z"
  },
  {
    "title": "America Just Beat Up These Marines’ Dad",
    "description": "What is it like for Latinos in the military now?",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/latino-soldiers-deportations/683347/",
    "timestamp": "2025-06-27T15:00:00Z"
  },
  {
    "title": "All Eyes on Fundamentals as Geopolitical Risk in Oil Evaporates",
    "description": "Following the collapse of geopolitical risk premium in oil prices, oil is back to trading on supply, demand, and OPEC+ expectations. The Israel-Iran ceasefire and the lack of subsequent retaliatory attacks has drained oil markets of the elevated geopolitical …",
    "link": "https://oilprice.com/Energy/Energy-General/All-Eyes-on-Fundamentals-as-Geopolitical-Risk-in-Oil-Evaporates.html",
    "timestamp": "2025-06-27T15:00:00Z"
  },
  {
    "title": "Rwanda, Democratic Republic of Congo set to sign peace agreement in Washington",
    "description": "WASHINGTON/PARIS/DAKAR (Reuters) -Rwanda and Democratic Republic of Congo are set to sign a U.S.-brokered peace agreement in Washington on Friday, raising hopes for an end to years of fighting that has displaced hundreds of thousands of people. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/27/rwanda-democratic-republic-of-congo-set-to-sign-peace-agreement-in-washington",
    "timestamp": "2025-06-27T14:59:00Z"
  },
  {
    "title": "Supreme Court says Maryland parents can pull their kids from public school lessons using LGBTQ books",
    "description": "The decision was not a final ruling in the case.",
    "link": "https://www.bostonherald.com/2025/06/27/supreme-court-lgbtq-books/",
    "timestamp": "2025-06-27T14:57:43Z"
  },
  {
    "title": "Democrats Vote Against House Resolution Condemning LA Riots",
    "description": "Despite overwhelming opposition from Democrats, the House voted Friday to adopt House Resolution 516, a resolution condemning the violent June 2025 protests in Los Angeles.... Read More\nThe post Democrats Vote Against House Resolution Condemning LA Riots appe…",
    "link": "https://www.dailysignal.com/2025/06/27/democrats-vote-against-house-resolution-condemning-la-riots/",
    "timestamp": "2025-06-27T14:57:24Z"
  },
  {
    "title": "Supreme Court says Maryland parents can pull their kids from public school lessons using LGBTQ books",
    "description": "WASHINGTON (AP) — The Supreme Court ruled on Friday that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks. The justices reversed lower-court rulings in favor of the Montgomery County scho…",
    "link": "https://financialpost.com/pmn/supreme-court-says-maryland-parents-can-pull-their-kids-from-public-school-lessons-using-lgbtq-books",
    "timestamp": "2025-06-27T14:57:21Z"
  },
  {
    "title": "DRC-Rwanda peace deal: what you need to know",
    "description": "A treaty between Rwanda and the Democratic Republic of Congo comes as the United States tries to reassert its role as a global mediator under President Donald Trump. But it leaves many unanswered questions.",
    "link": "https://www.dw.com/en/drc-rwanda-peace-deal-what-you-need-to-know/a-73067776",
    "timestamp": "2025-06-27T14:57:00Z"
  },
  {
    "title": "The Supreme Court’s Ruling on Birthright Citizenship Is a Trump Power Grab",
    "description": "In one of the most anticipated decisions of this Supreme Court term, today the justices granted President Donald Trump’s emergency applications to stay district courts’ orders blocking his efforts to restrict birthright citizenship and upend who gets to be an…",
    "link": "https://www.motherjones.com/politics/2025/06/birthright-citizenship-supreme-court-scotus-decision-explanation-trump-power-grab/",
    "timestamp": "2025-06-27T14:56:12Z"
  },
  {
    "title": "Supreme Court sides with Md. parents who objected to LGBT books",
    "description": "The Supreme Court ruled in favor of Maryland parents who objected on religious grounds to the use of books with LGBTQ characters in elementary school.",
    "link": "https://www.nbcwashington.com/news/local/supreme-court-sides-with-montgomery-county-parents-who-objected-to-lgbtq-books-in-schools/3940889/",
    "timestamp": "2025-06-27T14:56:12Z"
  },
  {
    "title": "WATCH: Jesse Watters Segment at the Heart of Gavin Newsom’s $787 Million Defamation Suit",
    "description": "Gavin Newsom is suing Fox News for $787 million over a Jesse Watters segment that he claims defamed him by deceptively painting him as a liar.\nThe post WATCH: Jesse Watters Segment at the Heart of Gavin Newsom’s $787 Million Defamation Suit first appeared on …",
    "link": "https://www.mediaite.com/media/watch-jesse-watters-segment-at-the-heart-of-gavin-newsoms-787-million-defamation-suit/",
    "timestamp": "2025-06-27T14:55:55Z"
  },
  {
    "title": "Gavin Newsom Sues Fox News",
    "description": "Democratic California Gov. Gavin Newsom is suing Fox News for $787 million, accusing the network of defamation in a Friday lawsuit, Politico reported.",
    "link": "https://dailycaller.com/2025/06/27/gavin-newsom-sues-fox-news-donald-trump-phone-call-national-guard-california/",
    "timestamp": "2025-06-27T14:55:28Z"
  },
  {
    "title": "Supreme Court rules Maryland parents can pull their children from public school lessons that use LGBTQ storybooks",
    "description": "Supreme Court rules Maryland parents can pull their children from public school lessons that use LGBTQ storybooks.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-rules-maryland-parents-can-pull-their-children-from-public-school-lessons-that-use-lgbtq-storybooks",
    "timestamp": "2025-06-27T14:55:20Z"
  },
  {
    "title": "How Trump Lives With the Threat of Iranian Assassination (The Atlantic)",
    "description": "The Atlantic:\nHow Trump Lives With the Threat of Iranian Assassination  —  Fear of being killed has hung over the president and his senior team for months.  —  Hours before launching B-2 bombers at Iran, President Donald Trump stood on a secured airport tarma…",
    "link": "https://www.memeorandum.com/250627/p57",
    "timestamp": "2025-06-27T14:55:01Z"
  },
  {
    "title": "Newsom sues Fox News for defamation over story about call with Trump",
    "description": "Newsom sues Fox News for defamation over story about call with Trump\nCalifornia Gov. Gavin Newsom is suing Fox News for defamation, alleging that the news outlet intentionally manipulated a video to give the appearance that the governor lied about a phone cal…",
    "link": "https://biztoc.com/x/4f428e86af105295",
    "timestamp": "2025-06-27T14:54:35Z"
  },
  {
    "title": "Supreme Court preserves key part of Obamacare coverage requirements",
    "description": "The court rejected a challenge from Christian employers to a provision that affects 150 million.",
    "link": "https://www.bostonherald.com/2025/06/27/supreme-court-obamacare/",
    "timestamp": "2025-06-27T14:51:56Z"
  },
  {
    "title": "Supreme Court preserves key part of Obamacare coverage requirements",
    "description": "The court rejected a challenge from Christian employers to a provision that affects 150 million.",
    "link": "https://www.denverpost.com/2025/06/27/supreme-court-obamacare/",
    "timestamp": "2025-06-27T14:51:56Z"
  },
  {
    "title": "Supreme Court preserves key part of Obamacare coverage requirements",
    "description": "The Supreme Court has preserved a key part of the Affordable Care Act’s preventive health care coverage requirements, rejecting a challenge from Christian employers to the provision that affects 150 million Americans.",
    "link": "https://www.clickondetroit.com/business/2025/06/27/supreme-court-preserves-key-part-of-obamacare-coverage-requirements/",
    "timestamp": "2025-06-27T14:51:49Z"
  },
  {
    "title": "Supreme Court Lets Parents Opt Kids Out Of LGBTQ Books In Schools",
    "description": "Education experts warned the ruling could \"leave public education in shreds.\"",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/06/27/supreme-court-lets-parents-opt-kids-out-of-lgbtq-books-in-schools/",
    "timestamp": "2025-06-27T14:51:45Z"
  }
]