[
  {
    "title": "The Supreme Court just got a bigger role in the Epstein controversy",
    "description": "Whether and when Ghislaine Maxwell testifies to Congress depends, in part, on the Supreme Court.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/ghislaine-maxwell-testimony-congress-supreme-court-rcna222852",
    "timestamp": "2025-08-04T16:12:30Z"
  },
  {
    "title": "Donald Trump goes off the rails over Epstein, again blames Barack Obama in explosive new meltdown",
    "description": "Donald Trump is again blaming Barack Obama. He claims Obama plotted against his presidency. This comes as Trump faces scrutiny over his ties to Jeffrey Epstein. Trump accuses Obama of a 'coup'. He says Obama tried to undermine his win. Tulsi Gabbard supports …",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-goes-off-the-rails-over-epstein-again-blames-barack-obama-in-explosive-new-meltdown/articleshow/123099520.cms",
    "timestamp": "2025-08-04T16:12:23Z"
  },
  {
    "title": "SPAC backed by Trump sons files $300 million IPO",
    "description": "A special purpose acquisition company (SPAC) backed by Eric Trump and Donald Trump Jr. filed on Monday for a $300 million initial public offering in the United States. The company, New America Acquisi...",
    "link": "https://biztoc.com/x/fb10a29a51d358f5",
    "timestamp": "2025-08-04T16:09:04Z"
  },
  {
    "title": "Jaguar CEO Adrian Mardell steps down after controversial 'woke' pink rebrand: Why did he quit after 35 years?",
    "description": "Adrian Mardell, Jaguar CEO, is retiring after 35 years with the company, a tenure that included both record profits and controversy over a \"woke\" rebrand featuring bright colors and androgynous models. The campaign, criticized by figures like Nigel Farage and…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-jaguar-ceo-adrian-mardell-steps-down-after-controversial-woke-pink-rebrand-why-did-he-quit-after-35-years/articleshow/123099695.cms",
    "timestamp": "2025-08-04T16:07:57Z"
  },
  {
    "title": "“Come and take it”: Texas Democrats brush off threat of arrest",
    "description": "Democratic lawmakers are continuing to defy the Texas governor, despite escalating threats from Republicans",
    "link": "https://www.salon.com/2025/08/04/come-and-take-it-texas-democrats-brush-off-threat-of-arrest/",
    "timestamp": "2025-08-04T16:06:46Z"
  },
  {
    "title": "US to require up to $15,000 bond for some tourists",
    "description": "Pilot programme intended to be a diplomatic deterrent aimed at countries with high rates of overstays.",
    "link": "https://www.aljazeera.com/news/2025/8/4/us-to-require-up-to-15000-bond-for-some-tourists",
    "timestamp": "2025-08-04T16:06:27Z"
  },
  {
    "title": "Cambodian and Thai officials meet in Malaysia to iron out ceasefire details",
    "description": "The July 28 ceasefire followed economic pressure from U.S. President Donald Trump.",
    "link": "https://www.bostonherald.com/2025/08/04/thailand-cambodia-ceasefire-details/",
    "timestamp": "2025-08-04T16:06:02Z"
  },
  {
    "title": "Trump tariffs, tiffs tied to NYC tourism drop are ‘catastrophically’ affecting business",
    "description": "Canadian visitors, irked by talk of \"annexation,\" are staying away from the city and United States altogether. [ more › ]",
    "link": "https://gothamist.com/news/trump-tariffs-tiffs-tied-to-nyc-tourism-drop-are-catastrophically-affecting-business",
    "timestamp": "2025-08-04T16:05:00Z"
  },
  {
    "title": "Republican Senator Tells Trump To ‘Grow Up’ After Furious Reaction to Bad Jobs Numbers",
    "description": "Republican Sens. Thom Tillis and Cynthia Lummis said they were troubled when President Donald Trump fired the nation's chief jobs data official after some bad employment numbers came in.\nThe post Republican Senator Tells Trump To ‘Grow Up’ After Furious React…",
    "link": "https://www.mediaite.com/media/tv/republican-senator-tells-trump-to-grow-up-after-furious-reaction-to-bad-jobs-numbers/",
    "timestamp": "2025-08-04T16:04:50Z"
  },
  {
    "title": "Gold price jumps Rs 1,600 per 10 gm on Trump’s latest tariff threat; YTD gains swell to Rs 24,400",
    "description": "Gold price shot up by nearly Rs 1,600 per 10 gram or 1.6% on Monday in evening trade, much sharper than the international prices, following US President Donald Trump's announcement that he will substantially raise tariffs on India over its purchases of Russia…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-price-jumps-rs-1600-per-10-gm-on-trumps-latest-tariff-threat-ytd-gains-swell-to-rs-24400/articleshow/123099721.cms",
    "timestamp": "2025-08-04T16:04:28Z"
  },
  {
    "title": "Trump credited by Cambodian official with brokering ceasefire with Thailand",
    "description": "Lim Menghour, director general of the Commission on Foreign Affairs and International Cooperation in Cambodia’s National Assembly, credited former U.S...",
    "link": "https://nextshark.com/trump-praise-ceasefire-cambodia-thailand",
    "timestamp": "2025-08-04T16:04:04Z"
  },
  {
    "title": "CoinDesk owner Bullish eyes $4.2B valuation in IPO backed by BlackRock, ARK",
    "description": "The digital exchange operator and media company is eyeing an initial public offering of between $28 and $31 per share, regulatory filings show.",
    "link": "https://cointelegraph.com/news/bullish-ipo-us-crypto-blackrock-ark",
    "timestamp": "2025-08-04T16:03:54Z"
  },
  {
    "title": "‘Punishment Worse Than Death’: Dave Portnoy Says Loser Of Fantasy League Will Be Forced To Read Kamala’s Book",
    "description": "Barstool Sports founder Dave Portnoy said players in the outlet’s fantasy football league will have an extra incentive not to finish last this season.",
    "link": "https://dailycaller.com/2025/08/04/dave-portnoy-loser-fantasy-league-read-kamalas-book/",
    "timestamp": "2025-08-04T16:03:43Z"
  },
  {
    "title": "Trump Rages During Elizabeth Warren’s CNBC Interview: ‘Ask Pocahontas the Real Questions!’",
    "description": "President Donald Trump reacted furiously to Sen. Elizabeth Warren's (D-MA) interview on CNBC Monday morning, firing off a series of posts on his Truth Social account calling her \"Pocahontas.\"\nThe post Trump Rages During Elizabeth Warren’s CNBC Interview: ‘Ask…",
    "link": "https://www.mediaite.com/politics/trump/trump-rages-during-elizabeth-warrens-cnbc-interview-ask-pocahontas-the-real-questions/",
    "timestamp": "2025-08-04T16:02:52Z"
  },
  {
    "title": "Stocks rebound on US rate cut bets",
    "description": "Most stock markets bounced on Monday on hopes of US interest rate cuts after weak jobs figures raised concerns about the world's top economy.Markets reacted ...",
    "link": "https://finance.yahoo.com/news/stocks-rebound-us-rate-cut-140155250.html",
    "timestamp": "2025-08-04T16:02:50Z"
  },
  {
    "title": "Nurse in US for 40 Years Self-Deports—'It's Really Gotten Insane'",
    "description": "\"I've come full circle,\" Matthew Morrison said. \"I came here as an immigrant and I am leaving as an immigrant, despite everything in between.\"",
    "link": "https://www.newsweek.com/immigration-deportation-ice-nurse-irish-army-2108527",
    "timestamp": "2025-08-04T16:01:50Z"
  },
  {
    "title": "New York City REITs Continue to Size Up Mamdani",
    "description": "Local politics does not often seep into quarterly earnings calls, but the unexpected results of New York’s Democratic primary has put many real estate investment trusts on edge. During SL Green Realty’s second-quarter earnings report last month, several analy…",
    "link": "http://commercialobserver.com/2025/08/new-york-city-reits-mamdani/",
    "timestamp": "2025-08-04T16:00:53Z"
  },
  {
    "title": "Charlamagne responds to Trump’s comments on ‘The Breakfast Club'",
    "description": "Trump lashed out at the radio show host after he appeared on his daughter-in-law's Fox News show.",
    "link": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/04/charlamagne-tha-god-responds-trump-the-breakfast-club/85507032007/",
    "timestamp": "2025-08-04T16:00:31Z"
  },
  {
    "title": "Trump Pushes Desperate Defense for Firing BLS Chief Over Jobs Report",
    "description": "The president is stoking conspiracies in the wake of last week’s jobs report, apparently still writhing around in an attempt to find a beneficial angle on the abysmal economic figures.“Last week’s Job’s Report was RIGGED, just like the numbers prior to the Pr…",
    "link": "https://newrepublic.com/post/198774/donald-trump-defense-bureau-labor-statistics-chief-jobs-report",
    "timestamp": "2025-08-04T15:58:44Z"
  },
  {
    "title": "Trump criticized for firing BLS chief after jobs report",
    "description": "What happened\nThe White House Sunday defended President Donald Trump from criticism over his decision Friday to fire Bureau of Labor Statistics chief Erika McEntarfer following a jobs report that showed lower-than-expected hiring in July. But Trump's economic…",
    "link": "https://biztoc.com/x/932b2d72f70b0834",
    "timestamp": "2025-08-04T15:57:47Z"
  },
  {
    "title": "Palantir Earnings On Deck As Trump Tariffs Rattle Nvidia, Broadcom",
    "description": "After the Nasdaq briefly notched an all-time high on July 31, new tariffs from President Donald Trump and a weak jobs report sent the tech-heavy index lower Friday to kick off August. That shook up Nvidia (NVDA), Broadcom (AVGO), Palantir Technologies (PLTR) …",
    "link": "https://biztoc.com/x/11c354c53d1c037f",
    "timestamp": "2025-08-04T15:57:45Z"
  },
  {
    "title": "Rep. Nancy Mace kicks off South Carolina GOP gubernatorial bid. She says she’s ‘Trump in high heels’",
    "description": "Mace enters a GOP primary in which competition for President Donald Trump's endorsement is expected to be fierce.",
    "link": "https://biztoc.com/x/2c43f3a9073c861b",
    "timestamp": "2025-08-04T15:57:42Z"
  },
  {
    "title": "Trump’s deadline for the Kremlin looms but Putin shows no sign of making concessions",
    "description": "U.S. President Donald Trump's special envoy, Steve Witkoff, is expected in Moscow midweek. Trump has set a Friday deadline for Russia to stop its aggression or face severe economic penalties.",
    "link": "https://biztoc.com/x/6be9d5143a05f0ff",
    "timestamp": "2025-08-04T15:57:41Z"
  },
  {
    "title": "Texas Democrats Leave for Chicago to Block Redistricting Plan",
    "description": "Texas Democratic lawmakers said they left the state in an effort to temporarily block Republicans from redrawing its congressional maps — a redistricting initiative pushed by President Donald Trump to help retain GOP control of the US House of Representatives…",
    "link": "https://biztoc.com/x/be200c61569d208c",
    "timestamp": "2025-08-04T15:57:33Z"
  },
  {
    "title": "India’s Pragmatic Pivot Toward China",
    "description": "By improving business ties with Beijing, New Delhi is advancing its economic interests amid uncertainty from Washington.",
    "link": "http://foreignpolicy.com/2025/08/04/india-pivot-china-trump-geopolitics-uncertainty/",
    "timestamp": "2025-08-04T15:56:38Z"
  },
  {
    "title": "Trump Applauds ‘Patriot’ Laura Loomer as Her Loyalty Purge Moves on to Tucker Carlson and the Pentagon",
    "description": "Loomer took aim at ousted Fox News host Carlson, promising to reveal “something that should be the nail in his coffin that makes everyone realize what a fraud he is.”\nThe post Trump Applauds ‘Patriot’ Laura Loomer as Her Loyalty Purge Moves on to Tucker Carls…",
    "link": "https://www.mediaite.com/politics/trump-applauds-patriot-laura-loomer-as-her-loyalty-purge-moves-on-to-tucker-carlson-and-the-pentagon/",
    "timestamp": "2025-08-04T15:56:28Z"
  },
  {
    "title": "A Big Mistake Trump Just Made",
    "description": "Recently US President Donald Trump made a major blunder that affects everyone in the US if not the world. He fired the director of the US Bureau of Labor Statistics because her (or the bureau’s board’s) report on jobs did not satisfy him. He claimed it was “r…",
    "link": "https://www.patheos.com/blogs/rogereolson/2025/08/a-big-mistake-trump-just-made/",
    "timestamp": "2025-08-04T15:56:11Z"
  },
  {
    "title": "Tesla proposes awarding Elon Musk billions to stay as CEO",
    "description": "Tesla has approved a restricted stock award of 96 million shares, worth about US$29 billion (or roughly C$39 billion), to try and persuade the billionaire to stay as the head of the company following a court ruling regarding his original pay package. Accordin…",
    "link": "https://mobilesyrup.com/2025/08/04/tesla-proposes-awarding-elon-musk-billions-to-stay-as-ceo/",
    "timestamp": "2025-08-04T15:56:02Z"
  },
  {
    "title": "The world just lost its health report card. Now what?",
    "description": "When President Donald Trump and Elon Musk fed the US Agency for International Development into the wood chipper earlier this year, one of the lesser-known casualties was the shutdown of an obscure but crucial program that tracked public health information on …",
    "link": "https://www.vox.com/future-perfect/422029/usaid-demographic-health-survey-shutdown-gates",
    "timestamp": "2025-08-04T15:55:30Z"
  },
  {
    "title": "Reality Is Forging a New Europe",
    "description": "Although Europeans should maintain the transatlantic partnership as long as possible, they cannot ignore the fact that the United States is fundamentally unreliable. Threatened by Vladimir Putin and pressured by Donald Trump, there is no choice but to pursue …",
    "link": "https://www.project-syndicate.org/commentary/eu-trump-putin-other-realities-require-joint-defense-economic-revitalization-by-joschka-fischer-2025-08",
    "timestamp": "2025-08-04T15:55:20Z"
  },
  {
    "title": "Trump’s deadline for the Kremlin looms but Putin shows no sign of making concessions",
    "description": "U.S. President Donald Trump's special envoy, Steve Witkoff, is expected in Moscow midweek. Trump has set a Friday deadline for Russia to stop its aggression or face severe economic penalties.",
    "link": "https://www.pbs.org/newshour/politics/trumps-deadline-for-the-kremlin-looms-but-putin-shows-no-sign-of-making-concessions",
    "timestamp": "2025-08-04T15:54:50Z"
  },
  {
    "title": "India's biggest refiner buys US, Middle East crude as Trump slams Russia purchases",
    "description": "Indian Oil Corp (IOC.NS), opens new tab has bought 7 million barrels of crude from the United States, Canada and the Middle East, four trade sources said on Monday, as U.S. President Donald Trump ramped up his criticism of the country over its purchases of Ru…",
    "link": "https://freerepublic.com/focus/f-chat/4332585/posts",
    "timestamp": "2025-08-04T15:54:26Z"
  },
  {
    "title": "Trump criticized for firing BLS chief after jobs report",
    "description": "Bureau of Labor Statistics chief Erika McEntarfer oversaw a July jobs report that the president claims was rigged",
    "link": "https://theweek.com/politics/trump-labor-statistics-chief-fired-unemployment",
    "timestamp": "2025-08-04T15:52:47Z"
  },
  {
    "title": "EU will delay planned U.S. tariffs for six months to allow for trade talks - NewsBreak",
    "description": "The European Union will suspend its planned countermeasures to President Donald Trump’s tariffs, which were set to take effect on Thursday. The suspension",
    "link": "https://www.newsbreak.com/share/4155517486947-eu-will-delay-planned-u-s-tariffs-for-six-months-to-allow-for-trade-talks?s=a2&amp;share_destination_id=MjAxMzI2MDQzLTE3NTQzMjI2MjcwOTc%3D&amp;pd=0Dck6FDg&amp;hl=en_US&amp;send_time=1754322627&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v7%2Cns_foryou_model_exp_25q3-v8%2Cns_foryou_rank_exp_25q3-v4%2Cns_foryou_blend_exp_25q3-v5",
    "timestamp": "2025-08-04T15:51:19Z"
  },
  {
    "title": "Tesla's Brand Loyalty Plummets, Proving Leftists Are the Overwhelming Market for EVs",
    "description": "Tesla, once the automotive industry leader in customer loyalty, has seen its brand loyalty collapse after CEO Elon Musk publicly expressed conservative political values, according to exclusive data from research firm S&P Global Mobility.\nThe post Tesla’s Bran…",
    "link": "https://www.breitbart.com/tech/2025/08/04/teslas-brand-loyalty-plummets-proving-leftists-are-the-overwhelming-market-for-evs/",
    "timestamp": "2025-08-04T15:50:18Z"
  },
  {
    "title": "They Think You're Stupid. Your Sunday Shows Roundup!",
    "description": "We watch so you never have to!",
    "link": "https://www.wonkette.com/p/they-think-youre-stupid-your-sunday",
    "timestamp": "2025-08-04T15:50:07Z"
  },
  {
    "title": "Moscow urges everyone, including Trump, to be 'very, very cautious' with nuclear rhetoric",
    "description": "Moscow downplayed President Trump's announcement that he'd ordered two nuclear submarines to \"the appropriate regions\" after heated Russian rhetoric.",
    "link": "https://www.usatoday.com/story/news/world/2025/08/04/russia-ukraine-trump-nuclear/85506198007/",
    "timestamp": "2025-08-04T15:49:43Z"
  },
  {
    "title": "Tesla’s poor stock performance has slashed Elon Musk’s wealth by $80 billion—another tumble like that could dethrone the world’s richest man",
    "description": "If the Tesla billionaire’s wealth drops by another $60 billion, he will lose his crown as the richest person on the planet to Oracle’s Larry Ellison.",
    "link": "https://fortune.com/2025/08/04/billionaire-elon-musk-wealth-drops-80-billion-tesla-stock-down-bloodbath-still-richest-person-larry-ellison-mark-zuckerberg-behind/",
    "timestamp": "2025-08-04T15:49:05Z"
  },
  {
    "title": "Emerging Markets Trim Gains as US Threatens to Hike India Tariff",
    "description": "(Bloomberg) -- Currencies and stocks in developing economies trimmed gains after US President Donald Trump threatened to hike tariffs on India even above the...",
    "link": "https://finance.yahoo.com/news/emerging-markets-trim-gains-us-154858894.html",
    "timestamp": "2025-08-04T15:48:58Z"
  },
  {
    "title": "Don Jr. And Eric Trump Back New SPAC Targeting American Manufacturing—Here’s How These Deals Have Worked In The Past",
    "description": "New America Acquisition Corp I said it planned to raise $300 million.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2025/08/04/don-jr-and-eric-trump-back-new-spac-targeting-american-manufacturing-heres-how-these-deals-have-worked-in-the-past/",
    "timestamp": "2025-08-04T15:48:31Z"
  },
  {
    "title": "Elizabeth Warren Slugs It Out With CNBC Host in Fiery Debate Over Mamdani: ‘You Worried Billionaires Are Gonna Go Hungry?!’",
    "description": "Sen. Warren (D-MA) got into a fiery battle with a CNBC host, Monday, about the economic proposals of New York City mayoral candidate Zohran Mamdani.\nThe post Elizabeth Warren Slugs It Out With CNBC Host in Fiery Debate Over Mamdani: ‘You Worried Billionaires …",
    "link": "https://www.mediaite.com/media/news/elizabeth-warren-slugs-it-out-with-cnbc-host-in-fiery-debate-over-mamdani-you-worried-billionaires-are-gonna-go-hungry/",
    "timestamp": "2025-08-04T15:48:18Z"
  },
  {
    "title": "What The New Chief of New York City Opera Has Planned For Reviving The Company",
    "description": "Constantine Orbelian, now both Music Director and Executive Director: “The main thing for me at this point is getting a home. … I believe that without a home, it’s hard to put stuff here and there. And once we find it, one of my big focuses will be doing oper…",
    "link": "https://operawire.com/q-a-constantine-orbelian-on-the-new-york-city-opera-dmitri-hvorostovsky-future-albums/",
    "timestamp": "2025-08-04T15:48:00Z"
  },
  {
    "title": "Eric and Trump Jr-backed manufacturing SPAC files for $300 million US IPO",
    "description": "New America Acquisition I Corp, a blank-check firm backed by Eric Trump and Donald Trump Jr., on Monday filed for an initial public offering of up to $300 million in the United States.\nThe move is the latest in a series of ventures by U.S. President Donald Tr…",
    "link": "https://biztoc.com/x/c23d8e2c8dd67906",
    "timestamp": "2025-08-04T15:47:14Z"
  },
  {
    "title": "Trump Sons Launch Fund to Capitalize on U.S. Policy",
    "description": "\"Eric Trump and Donald Trump Jr are backing a new blank check investment vehicle potentially positioned to capitalize on U.S. policy, marking the latest push into public markets by the president’s family,\" the Financial Times",
    "link": "https://politicalwire.com/2025/08/04/trump-sons-launch-fund-to-capitalize-on-u-s-policy/",
    "timestamp": "2025-08-04T15:47:06Z"
  },
  {
    "title": "Rep. Nancy Mace kicks off South Carolina GOP gubernatorial bid. She says she’s ‘Trump in high heels’",
    "description": "Mace enters a GOP primary in which competition for President Donald Trump's endorsement is expected to be fierce.",
    "link": "https://www.pbs.org/newshour/politics/rep-nancy-mace-kicks-off-south-carolina-gop-gubernatorial-bid-she-says-shes-trump-in-high-heels",
    "timestamp": "2025-08-04T15:47:00Z"
  },
  {
    "title": "Trump says he will hit India with higher tariffs for buying Russian oil",
    "description": "U.S. President Donald Trump said on Monday he will substantially raise tariffs on India over its purchases of Russian oil.\n“India is not only buying massive amounts of Russian Oil, they are then, for much of the Oil purchased, selling it on the Open Market fo…",
    "link": "https://biztoc.com/x/55b5116c2cc1991c",
    "timestamp": "2025-08-04T15:46:16Z"
  },
  {
    "title": "Donald Trump Walks Back on Key Campaign Pledge: Report",
    "description": "Last year, Trump made a pledge on the campaign trail to cover in vitro fertilization for all women and couples seeking it.",
    "link": "https://biztoc.com/x/1de1c8f6bc8a9a45",
    "timestamp": "2025-08-04T15:46:16Z"
  },
  {
    "title": "Why Canada's economy is showing resilience in the face of U.S. tariffs",
    "description": "With tariffs piling up over the past few months, economists say Canada's economy is starting to show cracks but there are few signs of collapse. Economists explain why that's the case.",
    "link": "https://www.cbc.ca/news/business/canada-resilience-us-tariffs-1.7600931",
    "timestamp": "2025-08-04T15:45:40Z"
  },
  {
    "title": "Tesla Approves Elon Musk’s $29 Billion Pay Package Despite Political Risks",
    "description": "Amid falling sales, Tesla's board still thinks Musk is worth all the trouble.",
    "link": "https://gizmodo.com/tesla-approves-elon-musks-29-billion-pay-package-despite-political-risks-2000638504",
    "timestamp": "2025-08-04T15:45:09Z"
  },
  {
    "title": "Tesla awards CEO Elon Musk millions in shares valued at about $29 billion",
    "description": "Tesla is awarding CEO Elon Musk 96 million shares of restricted stock valued at approximately $29 billion, just six months after a judge ordered the company to revoke his massive pay package.",
    "link": "https://abc13.com/post/tesla-awards-ceo-elon-musk-millions-shares-valued-29-billion/17429803/",
    "timestamp": "2025-08-04T15:44:47Z"
  },
  {
    "title": "Prince Andrew Had 'Affair' With Ghislaine Maxwell: Book",
    "description": "Prince Andrew and Ghislaine Maxwell were \"occasional lovers,\" a new biography states.",
    "link": "https://www.newsweek.com/prince-andrew-affair-ghislaine-maxwell-jeffrey-epstein-book-2108334",
    "timestamp": "2025-08-04T15:44:38Z"
  },
  {
    "title": "Trump Administration Announces Major Tourist Visa Change",
    "description": "The State department says the measure is intended to ensure the U.S. government does not incur costs if a visitor violates visa terms.",
    "link": "https://www.newsweek.com/trump-admin-visas-tourist-business-major-change-2108642",
    "timestamp": "2025-08-04T15:44:19Z"
  },
  {
    "title": "Netanyahu to instruct military on next steps in Gaza after ceasefire talks collapse",
    "description": "Benjamin Netanyahu has said he will convene his security cabinet to discuss how to instruct Israel's military to proceed in Gaza to meet all of his war goals.",
    "link": "https://news.sky.com/story/netanyahu-to-instruct-israeli-military-on-next-steps-in-gaza-after-ceasefire-talks-collapse-13406943",
    "timestamp": "2025-08-04T15:44:00Z"
  },
  {
    "title": "Damning Book Reveals Trump Talked About “P*ssy” With Epstein Friend",
    "description": "The extent of Donald Trump’s involvement with pedophile financier Jeffrey Epstein’s inner circle continues to deepen: the president reportedly had a vulgar conversation with Prince Andrew in 2000 in which he gave the royal a list of masseuses.According to an …",
    "link": "https://newrepublic.com/post/198773/donald-trump-prince-andrew-epstein-book",
    "timestamp": "2025-08-04T15:42:46Z"
  },
  {
    "title": "Donald Trump Doubles Down on Sydney Sweeney's Controversial Ad, Blasts Taylor Swift",
    "description": "Donald Trump is doubling down on his support for actress Sydney Sweeney amid her controversial American Eagle ad campaign ... taking time out of his busy sched to embrace the clothing brand while taking a dig at Jaguar and Taylor Swift for going…\n Permalink",
    "link": "https://www.tmz.com/2025/08/04/donald-trump-praises-sydney-sweeney-american-eagle-ad-again/",
    "timestamp": "2025-08-04T15:42:35Z"
  },
  {
    "title": "Threat of Nuclear War Is Rising, But Scientists Say the Public Can Change That",
    "description": "Scientists and others are calling on civil society to heed growing nuclear dangers and revive the anti-nuclear movement.",
    "link": "https://truthout.org/articles/threat-of-nuclear-war-is-rising-but-scientists-say-the-public-can-change-that/",
    "timestamp": "2025-08-04T15:41:17Z"
  },
  {
    "title": "Trump says he will 'substantially' raise tariffs on India over Russian oil purchases",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump said on Monday he willsubstantially raise tariffs on India over its purchases of Russian oil. \"India is not only buying massive amounts of Russian Oil, they are then, for much of the Oil purchased, selling it …",
    "link": "https://www.thestar.com.my/news/world/2025/08/04/trump-says-he-will-039substantially039-raise-tariffs-on-india-over-russian-oil-purchases",
    "timestamp": "2025-08-04T15:41:00Z"
  },
  {
    "title": "Kremlin says everyone should be 'careful' after Trump's nuclear sub move",
    "description": "Comments by former Russian president Dmitry Medvedev led Donald Trump to announce he had repositioned two of the US's nuclear submarines.",
    "link": "https://www.abc.net.au/news/2025-08-05/russia-downplays-trump-nuclear-sub-move/105612818",
    "timestamp": "2025-08-04T15:40:17Z"
  },
  {
    "title": "EU to suspend US tariff countermeasures for 6 months",
    "description": "BRUSSELS (Reuters) -The European Union will suspend its two packages of countermeasures to U.S. tariffs for six months following a deal with U.S. President Donald Trump, a Commission spokesperson said on Monday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/04/eu-to-suspend-us-tariff-countermeasures-for-6-months",
    "timestamp": "2025-08-04T15:40:00Z"
  },
  {
    "title": "Showdown in Texas as Abbott threatens Democrats who fled in protest of redistricting",
    "description": "Texas Gov. Greg Abbott said Texas House Democrats have until 3 p.m. local time on Monday to return to the statehouse for the special session or risk losing their jobs.",
    "link": "https://abcnews.go.com/Politics/showdown-texas-abbott-threatens-democrats-fled-protest-redistricting/story?id=124343408",
    "timestamp": "2025-08-04T15:39:52Z"
  },
  {
    "title": "Trump threatens to ramp up tariffs on India for its dealing with 'Russian War Machine'",
    "description": "For now, an existing 10 percent US tariff on Indian products is expected to rise to 25 percent come Thursday.",
    "link": "https://www.thejournal.ie/trump-threatens-to-ramp-up-tariffs-on-india-for-its-dealing-with-russian-war-machine-6782270-Aug2025/",
    "timestamp": "2025-08-04T15:38:46Z"
  },
  {
    "title": "He is a human skeleton, Gaza hostage's brother tells BBC",
    "description": "Families want the Israeli PM to prioritise the hostages' release as reports suggest Benjamin Netanyahu may prefer escalating military action in Gaza.",
    "link": "https://www.bbc.com/news/articles/cewyk4ezeedo",
    "timestamp": "2025-08-04T15:38:17Z"
  },
  {
    "title": "Biden-Appointed Judge Blocks Trump from Quickly Deporting Biden's Parole Migrants",
    "description": "A federal judge, appointed by former President Joe Biden, is blocking President Donald Trump's administration from quickly deporting migrants imported by Biden through a highly publicized parole pipeline. \nThe post Biden-Appointed Judge Blocks Trump from Quic…",
    "link": "https://www.breitbart.com/politics/2025/08/04/biden-appointed-judge-blocks-trump-from-quickly-deporting-bidens-parole-migrants/",
    "timestamp": "2025-08-04T15:38:15Z"
  },
  {
    "title": "Failed personnel from Trump’s first term keeps making comebacks in his second",
    "description": "Some of Donald Trump's most notable personnel failures from his first term keep landing on their feet. Take Andrew Puzder, for example.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/failed-personnel-trumps-first-term-keeps-making-comebacks-second-rcna222891",
    "timestamp": "2025-08-04T15:38:00Z"
  },
  {
    "title": "Hundreds of ex-Israeli security officials urge Trump to help end Gaza war in open letter",
    "description": "Former officials say end to war is only way to save hostages still held by Hamas",
    "link": "https://www.irishtimes.com/wires/guardian/2025/08/04/hundreds-of-ex-israeli-security-officials-urge-trump-to-help-end-gaza-war-in-open-letter/",
    "timestamp": "2025-08-04T15:37:55Z"
  },
  {
    "title": "'President doesn't care': Analyst sees massive Trump lie exposed by fight with Josh Hawley",
    "description": "President Donald Trump is passing on an easy chance to drain the metaphorical swamp he's promised to improve since arriving in Washington, D.C., nearly a decade ago.The president pledged he would \"absolutely\" sign a bill banning members of Congress from tradi…",
    "link": "https://www.rawstory.com/trump-stock-trade-ban/",
    "timestamp": "2025-08-04T15:37:43Z"
  },
  {
    "title": "NEW MAGA HERO",
    "description": "NEW MAGA HERO\r\n\n \n \n \n (Main headline, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:TRUMP'S EUPHORIA!\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "http://www.hollywoodreporter.com/lifestyle/lifestyle-news/trump-sydney-sweeney-republican-american-eagle-1236336749/",
    "timestamp": "2025-08-04T15:37:36Z"
  },
  {
    "title": "Donald Trump Ain’t S***: Administration Blasted For Using Viral ‘Jet2’ Sound To Mock Immigrant Deportations By ICE",
    "description": "The White House uses the viral Jet2 voiceover meme to mock immigrants being deported by ICE under the Donald Trump administration\nThe post Donald Trump Ain’t S***: Administration Blasted For Using Viral ‘Jet2’ Sound To Mock Immigrant Deportations By ICE appea…",
    "link": "https://bossip.com/3696204/white-house-uses-viral-jet2-sound-to-mock-immigrants-deportation/",
    "timestamp": "2025-08-04T15:36:23Z"
  },
  {
    "title": "Charlamagne Tha God Rips President Trump for Lying About U.S. Ecomony",
    "description": "Charlamagne Tha God and Donald Trump are the headliners of the latest big media battle following his interview with Lara Trump ... resulting in the President being slapped with \"Donkey of the Day\" on \"The Breakfast Club!!!\" On Monday, Charlamagne…\n Permalink",
    "link": "https://www.tmz.com/2025/08/04/charlamagne-tha-god-rips-donald-trump/",
    "timestamp": "2025-08-04T15:36:13Z"
  },
  {
    "title": "Donald Trump Tries to Spin and Purge His Way to Declaring Economic Victory",
    "description": "Late last week, Donald Trump realized a dream that he’s had since he was president of the United States the first time: firing the person who informed the world that his economy isn’t as great as he wants to pretend it is.\nIt was a move so comically autocrati…",
    "link": "https://biztoc.com/x/5ce2023d520e5bb4",
    "timestamp": "2025-08-04T15:35:51Z"
  },
  {
    "title": "Trump gushes about ‘HOTTEST’ Sydney Sweeney ad campaign — and says Taylor Swift ‘NO LONGER HOT’ thanks to him",
    "description": "President Trump kept gushing about actress Sydney Sweeney's American Eagle jeans campaign on Monday — while bashing Taylor Swift and companies that went \"woke.\"",
    "link": "https://nypost.com/2025/08/04/us-news/trump-gushes-about-hottest-sydney-sweeney-ad-campaign-and-says-taylor-swift-no-longer-hot-thanks-to-him/",
    "timestamp": "2025-08-04T15:35:28Z"
  },
  {
    "title": "Donald Trump Insults Taylor Swift Again: 'I Can't Stand Her'",
    "description": "Donald Trump has insulted Taylor Swift again, this time writing, \"I can't stand her\" while praising Sydney Sweeney.",
    "link": "http://www.billboard.com/culture/politics/donald-trump-insults-taylor-swift-cant-stand-her-1236036073/",
    "timestamp": "2025-08-04T15:35:23Z"
  },
  {
    "title": "Shares of American Eagle surge after Trump calls Sydney Sweeney campaign 'hottest ad out there'",
    "description": "Shares of American Eagle surged after President Donald Trump called its campaign with Sydney Sweeney the \"hottest ad out there.\"",
    "link": "https://biztoc.com/x/58eefb29d0ec0c01",
    "timestamp": "2025-08-04T15:35:22Z"
  },
  {
    "title": "Donald Trump Walks Back on Key Campaign Pledge: Report",
    "description": "Last year, Trump made a pledge on the campaign trail to cover in vitro fertilization for all women and couples seeking it.",
    "link": "https://www.newsweek.com/donald-trump-ivf-campaign-pledge-2108370",
    "timestamp": "2025-08-04T15:35:06Z"
  },
  {
    "title": "Donald Trump Tries to Spin and Purge His Way to Declaring Economic Victory - Rolling Stone",
    "description": "Donald Trump Tries to Spin and Purge His Way to Declaring Economic VictoryRolling Stone As Trump's tariffs take shape, is America really winning?NPR The Mystery of the Strong Economy Has Finally Been SolvedThe Atlantic It’s Trump’s economy now. The latest fin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178562350",
    "timestamp": "2025-08-04T15:35:01Z"
  },
  {
    "title": "Trump Appoints Convicted S-x Offender to Presidential School Fitness Council—And Critics Are Furious",
    "description": "Tennis legend Martina Navratilova blasts Donald Trump’s controversial decision to appoint former NFL star and registered s-x offender Lawrence Taylor to his revamped Presidential Fitness Council, calling it “tone-deaf” and dangerous.",
    "link": "https://www.inquisitr.com/trump-appoints-convicted-s-x-offender-to-presidential-school-fitness-council-and-critics-are-furious",
    "timestamp": "2025-08-04T15:34:51Z"
  },
  {
    "title": "EU to suspend US countermeasures despite lack of auto tariff relief",
    "description": "The proposed suspension comes amid deep disagreements between Washington and Brussels over the precise details of last month’s trade deal",
    "link": "https://www.euractiv.com/section/economy-jobs/news/eu-to-suspend-us-countermeasures-despite-lack-of-auto-tariff-relief/",
    "timestamp": "2025-08-04T15:34:28Z"
  },
  {
    "title": "Democrat Darling Jasmine Crockett: 'Donald Trump Is a Piece of Sh*t'",
    "description": "Democrat darling Rep. Jasmine Crockett (D-TX) went off on another rant and declared that President Trump is a \"piece of shit.\"\nThe post Democrat Darling Jasmine Crockett: ‘Donald Trump Is a Piece of Sh*t’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/04/democrat-darling-jasmine-crockett-donald-trump-is-piece-sh-t/",
    "timestamp": "2025-08-04T15:34:07Z"
  },
  {
    "title": "Putin Sends Trump a Warning After His Nuke Sub Threat: ‘Be Very, Very Careful’",
    "description": "The Kremlin has urged Donald Trump to be extremely “careful” after the American president said he’d ordered two nuclear submarines to be repositioned in...",
    "link": "https://www.thedailybeast.com/vladimir-putin-sends-donald-trump-a-warning-after-his-nuke-sub-threat-be-very-very-careful/",
    "timestamp": "2025-08-04T15:32:41Z"
  },
  {
    "title": "GOP governor greenlights state troopers to join ICE in immigration crackdown",
    "description": "Wyoming Highway Patrol in Laramie, Carbon, Sweetwater, Campbell and Natrona counties will assist ICE with immigration enforcement under new state agreement.",
    "link": "https://www.foxnews.com/politics/gop-governor-greenlights-state-troopers-join-ice-immigration-crackdown",
    "timestamp": "2025-08-04T15:32:00Z"
  },
  {
    "title": "Shares of American Eagle surge after Trump calls Sydney Sweeney campaign 'hottest ad out there'",
    "description": "Shares of American Eagle surged after President Donald Trump called its campaign with Sydney Sweeney the \"hottest ad out there.\"",
    "link": "https://www.cnbc.com/2025/08/04/american-eagle-aeo-stock-sydney-sweeney-trump.html",
    "timestamp": "2025-08-04T15:30:35Z"
  },
  {
    "title": "Britain planning attack on shadow fleet, Kremlin claims",
    "description": "The Kremlin has accused Britain of preparing “mass raids” to sink ships in the Russian “shadow fleet”.",
    "link": "https://uk.news.yahoo.com/britain-planning-attack-shadow-fleet-153018411.html",
    "timestamp": "2025-08-04T15:30:18Z"
  },
  {
    "title": "‘I hate my party’: Watch Dem C-SPAN callers torch elected Democrats",
    "description": "'This is really terrible. The things that they actually believe in do not really help the people at all'",
    "link": "https://www.wnd.com/2025/08/i-hate-my-party-watch-dem-c-span/",
    "timestamp": "2025-08-04T15:30:09Z"
  },
  {
    "title": "Eric and Trump Jr-backed manufacturing SPAC files for $300 million US IPO",
    "description": "The move is the latest in a series of ventures by U.S. President Donald Trump's family, including a meme coin launched in January and World Liberty Financial...",
    "link": "https://finance.yahoo.com/news/eric-trump-jr-backed-manufacturing-152853627.html",
    "timestamp": "2025-08-04T15:28:53Z"
  },
  {
    "title": "EU will delay planned U.S. tariffs for six months to allow for trade talks",
    "description": "The European Union announced Monday that it will suspend for six months its planned countermeasures against the United States’ tariffs, which which were set to take effect this week. “On 27 July 2025, European Commission President Ursula von der Leyen and US …",
    "link": "https://freerepublic.com/focus/f-news/4332580/posts",
    "timestamp": "2025-08-04T15:28:16Z"
  },
  {
    "title": "Student Loan Update: Millions of Borrowers to See Debt Change This Month",
    "description": "Some 1 million borrowers will enter default this month—meaning they will become subject to federal collections.",
    "link": "https://www.newsweek.com/student-loan-update-borrowers-debt-change-august-2108514",
    "timestamp": "2025-08-04T15:27:38Z"
  },
  {
    "title": "US to install country-specific tariffs",
    "description": "The National Retail Federation said the higher levies “will hurt Americans” and “impact merchandise in the coming weeks” for retailers.",
    "link": "https://www.supplychaindive.com/news/us-install-country-specific-tariffs-aug-7/756535/",
    "timestamp": "2025-08-04T15:27:00Z"
  },
  {
    "title": "Marjorie Taylor Greene threatens dramatic breakup with Trump over a core base frustration that could upend entire Republican Party",
    "description": "Six months into Donald Trump's return to the White House Marjorie Taylor Greene has about had it with the Republican Party. The conservative firebrand who surged onto the political scene in 2021 and has been an ever-present figure in the House GOP and MAGA or…",
    "link": "https://freerepublic.com/focus/f-chat/4332579/posts",
    "timestamp": "2025-08-04T15:24:59Z"
  },
  {
    "title": "Donald Trump Issues New Threat to India",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump issued a new tariff threat to India on Monday morning.\nThe president posted on Truth Social, \"India is not only buying massive amounts of Russian Oil, they are then, for much of the Oil …",
    "link": "https://biztoc.com/x/7b077fbafa2db5a0",
    "timestamp": "2025-08-04T15:24:18Z"
  },
  {
    "title": "RFK Jr announces new plan to share Americans' health data with Big Tech firms despite past comments - NewsBreak",
    "description": "US Health Secretary Robert F Kennedy Jr. has previously opposed sharing data with health tracking apps, but he appears to have changed his mind considerabl",
    "link": "https://www.newsbreak.com/share/4152616972626-rfk-jr-announces-new-plan-to-share-americans-health-data-with-big-tech-firms-despite-past-comments?_f=app_share&amp;pd=0BTCVtjv&amp;lang=en_US&amp;send_time=1754320929&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.30.0.28%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q3-v9%2Cns_foryou_rank_exp_25q3-v7%2Cns_foryou_recall_exp_25q3-v6%2Cns_foryou_blend_exp_25q3-v1&amp;s=i2",
    "timestamp": "2025-08-04T15:24:15Z"
  },
  {
    "title": "Trump’s Mission To Make America’s Kids Fit Again Is Way Overdue",
    "description": "By Jennifer Galardi, The Daily Signal | August 03, 2025\nPoor health and obesity, and the chronic diseases that accompany them, cost this country billions of dollars. President Donald Trump, alongside Health and Human Services Secretary Robert F. Kennedy Jr., …",
    "link": "https://biztoc.com/x/03c6a7bab01a0ddb",
    "timestamp": "2025-08-04T15:24:11Z"
  },
  {
    "title": "What Trump put at risk when he fired the labor statistics chief for telling the truth",
    "description": "One Democrat called Donald Trump's ouster of Erika McEntarfer’s “the stuff of fascist dictatorships.” The consequences of the abuse will linger for a long while",
    "link": "https://biztoc.com/x/093310e16335b0f8",
    "timestamp": "2025-08-04T15:24:10Z"
  },
  {
    "title": "Ghislaine Maxwell not welcome in Texas ‘Club Fed’ prison camp, says inmate: ‘Human trafficking is a violent crime’",
    "description": "Presence of Jeffrey Epstein’s accomplice and former girlfriend has angered fellow inmates at Texas prison camp",
    "link": "https://www.the-independent.com/news/world/americas/crime/ghislaine-maxwell-texas-prison-transfer-epstein-b2801642.html",
    "timestamp": "2025-08-04T15:24:01Z"
  },
  {
    "title": "Drugmakers Tap Telehealth to Sell Directly to Patients",
    "description": "Pharmaceutical companies are increasingly turning to telehealth platforms for direct-to-consumer drug sales.\n \n [contact-form-7]\n \n \nThat’s according to a report Monday (Aug. 4) from Axios, which notes that this effort is happening as President Donald Trump i…",
    "link": "https://biztoc.com/x/0a904222f81db8dc",
    "timestamp": "2025-08-04T15:23:49Z"
  },
  {
    "title": "India is not only buying massive amounts of Russian Oil…",
    "description": "India is not only buying massive amounts of Russian Oil, they are then, for much of the Oil purchased, selling it on the Open Market for big profits. They don’t care how many people in Ukraine are being killed by the Russian War Machine. Because of this, I wi…",
    "link": "https://freerepublic.com/focus/f-chat/4332577/posts",
    "timestamp": "2025-08-04T15:19:34Z"
  },
  {
    "title": "Trump says he will 'substantially' raise tariffs on India over Russian oil purchases",
    "description": "WASHINGTON: United States President Donald Trump said on Monday (Aug 4) he will substantially raise tariffs on India over its purchases of Russian oil. \"India is not only buying massive amounts of Russian Oil,",
    "link": "https://www.channelnewsasia.com/world/trump-raise-tariffs-india-russian-oil-5276456",
    "timestamp": "2025-08-04T15:19:09Z"
  },
  {
    "title": "Trump says he will 'substantially' raise tariffs on India over Russia oil purchases",
    "description": "The US president said last week he would impose a 25 per cent tariff on goods imported from India and that it would also face an unspecified penalty.",
    "link": "https://www.channelnewsasia.com/world/trump-raise-tariffs-india-russia-oil-ukraine-5276456",
    "timestamp": "2025-08-04T15:19:00Z"
  },
  {
    "title": "Trump Praises Sydney Sweeney Amid American Eagle Ad Controversy: ‘Go Get ‘Em Sydney!’",
    "description": "Trump also slammed billionaire singer Taylor Swift, luxury vehicle company Jaguar and beer brand Bud Light, all of which he called “woke.”",
    "link": "https://www.forbes.com/sites/conormurray/2025/08/04/trump-praises-sydney-sweeney-amid-american-eagle-ad-controversy-go-get-em-sydney/",
    "timestamp": "2025-08-04T15:18:05Z"
  }
]