[
  {
    "title": "Starlab developer Voyager seeks $1.6 billion valuation in US IPO",
    "description": "Voyager Technologies said on Monday it was targeting a valuation of $1.6 billion in its U.S. listing, as the defense and space tech company looks to capitalize on a spending boost for the sector under the Trump administration.Companies are finding renewed opp…",
    "link": "https://www.channelnewsasia.com/business/starlab-developer-voyager-seeks-16-billion-valuation-us-ipo-5162811",
    "timestamp": "2025-06-02T10:35:36Z"
  },
  {
    "title": "Trump-backed candidate Karol Nawrocki wins Poland’s presidential election",
    "description": "Conservative Karol Nawrocki won Poland’s weekend presidential runoff election.",
    "link": "https://nypost.com/2025/06/02/world-news/trump-backed-candidate-karol-nawrocki-wins-polands-presidential-election/",
    "timestamp": "2025-06-02T10:34:38Z"
  },
  {
    "title": "Trump-backed nationalist wins Poland election",
    "description": "The News\nA nationalist boxer-turned-historian backed by US President Donald Trump narrowly won Poland’s presidential election.\nKarol Nawrocki’s victory is a blow to Poland’s centrist, pro-Brussels Prime Minister Donald Tusk, who has sought to loosen abortion …",
    "link": "https://biztoc.com/x/7d6cc4c6d010619c",
    "timestamp": "2025-06-02T10:34:28Z"
  },
  {
    "title": "PBS files lawsuit against Donald Trump over executive order to cease federal funding",
    "description": "PBS has filed a lawsuit against US president Donald Trump in a bid to block his executive order to defund the American public broadcaster. In early May, Trump signed the order directing Congress to res...",
    "link": "https://www.c21media.net/news/pbs-files-lawsuit-against-donald-trump-over-executive-order-to-cease-federal-funding/",
    "timestamp": "2025-06-02T10:33:32Z"
  },
  {
    "title": "Salvadoran President Bukele says go ahead and call him ‘dictator’",
    "description": "El Salvador’s President Nayib Bukele said he would rather be branded a “dictator” than allow criminals to run loose, defying critics in a barnstorming speech marking one year since his re-election.  His hardline approach to El Salvador’s powerful gangs has ma…",
    "link": "https://www.digitaljournal.com/world/salvadoran-president-bukele-says-go-ahead-and-call-him-dictator/article",
    "timestamp": "2025-06-02T10:32:20Z"
  },
  {
    "title": "Rupee ends higher boosted by fragile dollar, likely portfolio inflows",
    "description": "The Indian rupee strengthened on Monday, supported by weakness in the U.S. dollar and modest dollar inflows that helped the local currency begin the week on a positive note.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-ends-higher-boosted-by-fragile-dollar-likely-portfolio-inflows/articleshow/121570462.cms",
    "timestamp": "2025-06-02T10:30:43Z"
  },
  {
    "title": "K-pop has been banned in China for almost a decade. Until now, maybe.",
    "description": "K-pop, which has been unofficially banned in China for almost a decade, may be on the verge of being allowed back in.",
    "link": "https://www.nbcnews.com/world/asia/k-pop-banned-china-almost-decade-now-maybe-rcna209901",
    "timestamp": "2025-06-02T10:26:13Z"
  },
  {
    "title": "Senate Begins Putting Its Stamp on Giant Trump Tax, Debt Limit Bill",
    "description": "Significant changes are in store for President Donald Trump’s signature $3.9 trillion tax-cut bill as the Senate begins closed-door talks this week on legislation that squeaked through the House by a single vote.",
    "link": "https://financialpost.com/pmn/business-pmn/senate-begins-putting-its-stamp-on-giant-trump-tax-debt-limit-bill",
    "timestamp": "2025-06-02T10:25:05Z"
  },
  {
    "title": "Huge Road Repair Bill Predicted For Army Anniversary Parade On Trump's Birthday",
    "description": "But the president has defended the spectacle.",
    "link": "https://www.huffpost.com/entry/road-repairs-cost-trump-army-parade_n_683d7252e4b095a13840e070",
    "timestamp": "2025-06-02T10:23:44Z"
  },
  {
    "title": "Market Wrap: D-Street ends flat as IT, metal losses offset GDP optimism; Sensex down 77 pts, Nifty below 24,800",
    "description": "Indian benchmark indices ended flat on Monday, as declines in information technology and metal stocks, driven by uncertainty over U.S. tariffs, offset optimism from stronger-than-expected domestic economic growth.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-street-ends-flat-as-it-metal-losses-offset-gdp-optimism-sensex-down-77-pts-nifty-below-24800/articleshow/121570173.cms",
    "timestamp": "2025-06-02T10:20:20Z"
  },
  {
    "title": "Carney Aims to Thwart Trump’s Tariff Assault by Unlocking Internal Trade",
    "description": "Prime Minister Mark Carney is pushing to offset the economic pain caused by US President Donald Trump’s tariffs by compelling Canadian provinces to liberalize trade with one another.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-aims-to-thwart-trumps-tariff-assault-by-unlocking-internal-trade",
    "timestamp": "2025-06-02T10:19:59Z"
  },
  {
    "title": "People in Burundi struggle amid Lake Tanganyika’s endless flooding",
    "description": "Climate change drives severe flooding, displacing families, spreading disease, and leaving urgent aid gaps.",
    "link": "https://www.aljazeera.com/gallery/2025/6/2/people-in-burundi-struggle-amid-lake-tanganyikas-endless-flooding",
    "timestamp": "2025-06-02T10:18:46Z"
  },
  {
    "title": "ICE targets migrants for arrest at courthouses as Trump administration intensifies deportation push | CNN Politics",
    "description": "Migrants are being detained by immigration agents in courthouse hallways nationwide, sometimes moments after pleading their cases, raising alarm among attorneys and advocates.",
    "link": "https://www.cnn.com/2025/06/02/politics/ice-arrests-migrants-courthouse",
    "timestamp": "2025-06-02T10:14:59Z"
  },
  {
    "title": "Tesla executives question Musk after he denies killing $25,000 EV project: Sources",
    "description": "Elon Musk denied reports Tesla canceled its $25,000 EV, confusing executives who knew it was scrapped. Internally, focus shifted to robotaxis, but investors were misled. The low-cost model, once key to Tesla’s growth, remains unreleased, raising concerns abou…",
    "link": "https://economictimes.indiatimes.com/tech/technology/tesla-executives-question-musk-after-he-denies-killing-25000-ev-project-sources/articleshow/121570027.cms",
    "timestamp": "2025-06-02T10:14:14Z"
  },
  {
    "title": "FBI silent as far-right podcaster demands Trump execution and Kash Patel torture",
    "description": "A far-right Pennsylvania activist and podcaster has suggested Donald Trump should be executed and FBI Director Kash Patel and Deputy Director Dan Bongino tortured, in both cases for failing to provide evidence in support of antisemitic conspiracy theories.“Do…",
    "link": "https://www.rawstory.com/raw-investigates/fbi-silent-over-far-right-podcaster-who-advocated-torture-for-kash-patel/",
    "timestamp": "2025-06-02T10:13:35Z"
  },
  {
    "title": "UK Aims to Slash US Steel Tariffs as Trump Raises Bar to 50%",
    "description": "MOSCOW (Sputnik) - UK Secretary of State for Business and Trade Jonathan Reynolds will ask the US for a quick steel deal next week, the Financial Times reported.",
    "link": "https://sputnikglobe.com/20250602/uk-aims-to-slash-us-steel-tariffs-as-trump-raises-bar-to-50-1122171927.html",
    "timestamp": "2025-06-02T10:12:34Z"
  },
  {
    "title": "Did Elon Musk mislead investors about Tesla's future EV plans? What you need to know",
    "description": "Tesla executives worried about Elon Musk's denial regarding the $25,000 EV cancellation. They feared SEC scrutiny and investor confusion. The company shifted focus to robotaxis. This decision led to internal concerns and market uncertainty. Tesla is facing de…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-elon-musk-mislead-investors-about-teslas-future-ev-plans-what-you-need-to-know/articleshow/121569992.cms",
    "timestamp": "2025-06-02T10:12:23Z"
  },
  {
    "title": "'My Prediction': Michael Cohen Says Things Will Get Ugly Between Trump And Musk",
    "description": "Michael Cohen, former longtime personal attorney to Donald Trump, on Sunday predicted that the president’s relationship with billionaire ally Elon Musk is about to take a turn for the worse.\n“I said from the very start that this bromance was gonna come to an …",
    "link": "https://biztoc.com/x/50ddfb6338129773",
    "timestamp": "2025-06-02T10:12:13Z"
  },
  {
    "title": "Trump just turned on the architect of his biggest first-term victories",
    "description": "Last week, Donald Trump turned his fire on the Federalist Society, a powerful conservative advocacy group, and its co-founder Leonard Leo, a key adviser to Trump on judicial nominations during his first term.",
    "link": "https://biztoc.com/x/5cde3c2d286cbc6a",
    "timestamp": "2025-06-02T10:12:08Z"
  },
  {
    "title": "China Denies Trump Claim, Says It Was US That Broke Trade Deal",
    "description": "China hit back on Monday against US President Donald Trump’s statement that Beijing had violated the trade deal agreed on in Geneva, saying the claim was “groundless.”\nIn a comment issued by China’s Commerce Ministry in response to Trump’s remarks on Friday t…",
    "link": "https://biztoc.com/x/8ecb6f2f1f8e2ad3",
    "timestamp": "2025-06-02T10:11:59Z"
  },
  {
    "title": "Diddy trial live: Ex-assistant ‘Mia’ to be cross examined by Combs’ legal team after witness testimony",
    "description": "Mia, who was given a pseudonym to protect her identity, was aggressively cross-examined by Combs’ lawyers last week",
    "link": "https://www.the-independent.com/news/world/americas/crime/diddy-trial-mia-testimony-50-cent-trump-live-updates-b2761865.html",
    "timestamp": "2025-06-02T10:11:14Z"
  },
  {
    "title": "Russia and Ukraine swap fire as they head to Istanbul peace talks",
    "description": "Kyiv and Moscow will present documents outlining their ideas for a peace settlement during talks in Turkiye.",
    "link": "https://www.aljazeera.com/news/2025/6/2/russia-and-ukraine-swap-fire-as-they-head-to-istanbul-peace-talks",
    "timestamp": "2025-06-02T10:08:52Z"
  },
  {
    "title": "Inaugural SXSW London Opens With Mayor Sadiq Khan Taking Shots at ‘Inward-Looking Mentality’ of U.S. and Trump Tariffs: ‘The U.K. is Tearing Down Barriers to Trade, Not Putting Up Walls’",
    "description": "The inaugural SXSW London has officially been opened by London mayor Sadiq Khan. In a speech at the Truman Brewery in the creative neighborhood of Shoreditch on Monday morning, Khan hailed London as a “creative hotbed,” a “gateway to the world,” and a “hub fo…",
    "link": "https://variety.com/2025/film/global/sxsw-london-opens-sadiq-khan-trump-1236415335/",
    "timestamp": "2025-06-02T10:08:39Z"
  },
  {
    "title": "Exclusive-Tesla executives questioned Musk after he denied killing $25,000 EV project - sources",
    "description": "(Reuters) -Some senior Tesla executives were alarmed last year when Elon Musk denied a Reuters report that the company had killed a planned all-new $25,000 E...",
    "link": "https://www.aol.com/news/exclusive-tesla-executives-questioned-musk-100828974.html",
    "timestamp": "2025-06-02T10:08:28Z"
  },
  {
    "title": "Lizzo’s make powerful display of trans allyship at Pride: ‘We ain’t free til we all free’",
    "description": "Pop icon Lizzo has delivered an impassioned speech supporting trans women while headlining a Pride festival. Proving once again that she’s a true champion of LGBTQ+ rights, Lizzo delivered a powerful speech in support of Black trans women as she headlined OUT…",
    "link": "https://www.thepinknews.com/2025/06/02/lizzos-make-powerful-display-of-trans-allyship-at-pride-we-aint-free-til-we-all-free/",
    "timestamp": "2025-06-02T10:07:59Z"
  },
  {
    "title": "BlackRock’s ‘Widow Maker’ ETF Is Suddenly in High Demand",
    "description": "The iShares 20+ Year Treasury Bond ETF (TLT) took in $1.3 billion in inflows this past week.",
    "link": "https://www.thedailyupside.com/etf/investing-strategies-etf/blackrocks-widow-maker-etf-is-suddenly-in-high-demand/",
    "timestamp": "2025-06-02T10:05:00Z"
  },
  {
    "title": "Murphy Launches Ambitious Anti-Trump PAC",
    "description": "“Sen. Chris Murphy (D-CT) is launching a new PAC aimed at taking on President Donald Trump and Republicans in Congress — the latest sign the Connecticut Democrat is eyeing higher office,” Politico reports.",
    "link": "https://politicalwire.com/2025/06/02/murphy-launches-ambitious-anti-trump-pac/",
    "timestamp": "2025-06-02T10:02:08Z"
  },
  {
    "title": "A film about long healing walk by the sea, the end of a dystopian series and a whimsical comfort watch – what to see, watch, read and listen to this week",
    "description": "Plus a bold debut work from a young Palesthinan writer and a new album from a misunderstood 90s band.",
    "link": "https://theconversation.com/a-film-about-long-healing-walk-by-the-sea-the-end-of-a-dystopian-series-and-a-whimsical-comfort-watch-what-to-see-watch-read-and-listen-to-this-week-257849",
    "timestamp": "2025-06-02T10:00:55Z"
  },
  {
    "title": "A film about a long healing walk by the sea – what to see, watch, read and listen to this week",
    "description": "Plus a bold debut work from a young Palesthinan writer and a new album from a misunderstood 90s band.",
    "link": "https://theconversation.com/a-film-about-a-long-healing-walk-by-the-sea-what-to-see-watch-read-and-listen-to-this-week-257849",
    "timestamp": "2025-06-02T10:00:55Z"
  },
  {
    "title": "90s comedy icon Jamie Kennedy says social media, podcasts have been ‘incredible’ for ‘authentic’ comedy",
    "description": "Comedian Jamie Kennedy shared how podcasting and social media have transformed comedy, allowing for more open discourse and authentic storytelling.",
    "link": "https://www.foxnews.com/media/90s-comedy-icon-jamie-kennedy-social-media-podcasts-been-incredible-authentic-comedy",
    "timestamp": "2025-06-02T10:00:52Z"
  },
  {
    "title": "Trump's 20th week in office to include White House meeting with European leader, expected call with Xi",
    "description": "President Donald Trump's 20th week as commander in chief is set to include a meeting with German Chancellor Friedrich Merz and a call with Chinese President Xi Jinping.",
    "link": "https://www.foxnews.com/politics/trumps-20th-week-office-include-white-house-meeting-european-leader-expected-call-xi",
    "timestamp": "2025-06-02T10:00:41Z"
  },
  {
    "title": "Donald Trump shows cognitive decline, expert says: ‘His brain is not well-disciplined’",
    "description": "Donald Trump shows cognitive decline, expert says: ‘His brain is not well-disciplined’pennlive.com",
    "link": "https://www.pennlive.com/news/2025/06/donald-trump-shows-cognitive-decline-expert-says-his-brain-is-not-well-disciplined.html",
    "timestamp": "2025-06-02T10:00:36Z"
  },
  {
    "title": "Child tax credit debate could get 'really interesting' as Senate weighs Trump's mega-bill, expert says",
    "description": "The child tax credit could change as Senate Republicans debate Trump's mega-bill. Here's what families need to know.",
    "link": "https://www.cnbc.com/2025/06/02/child-tax-credit-change-senate-trump-bill.html",
    "timestamp": "2025-06-02T10:00:01Z"
  },
  {
    "title": "List of Stores Being Boycotted in June",
    "description": "A Black pastor from Atlanta who has galvanized over 200,000 supporters called boycott efforts part of \"the summer of our discontent.\"",
    "link": "https://www.newsweek.com/boycott-economy-target-mcdonalds-walmart-amazon-2078140",
    "timestamp": "2025-06-02T10:00:01Z"
  },
  {
    "title": "Map Shows Where Americans Are Being Detained Overseas",
    "description": "More than 40 U.S. citizens are being held hostage, wrongly detained, or otherwise unable to leave a foreign country.",
    "link": "https://www.newsweek.com/american-citizens-wrongfully-detained-exit-bans-state-department-2079032",
    "timestamp": "2025-06-02T10:00:01Z"
  },
  {
    "title": "US Mayors Are Making Climate Action Personal—and It’s Working",
    "description": "This story was originally published by Grist and is reproduced here as part of the Climate Desk collaboration. In the depths of the COVID-19 pandemic, Justin Bibb was living in a tight, one-bedroom apartment in Cleveland, Ohio. He couldn’t open his windows be…",
    "link": "https://www.motherjones.com/politics/2025/06/mayors-cities-local-climate-action-green-spaces/",
    "timestamp": "2025-06-02T10:00:00Z"
  },
  {
    "title": "Trump’s Out-of-Control Debt Is Not a Bug. To the GOP, It’s a Feature.",
    "description": "Republicans are so gravely\nconcerned about the national debt, right? After all, they’re the party of\nprudence and fiscal responsibility. They’re the grown-ups in the room, the ones\nwho tap the brakes while those crazy, irresponsible Democrats keep pumping the…",
    "link": "https://newrepublic.com/article/195956/trump-debt-gop-tax-cuts",
    "timestamp": "2025-06-02T10:00:00Z"
  },
  {
    "title": "Small Farmers Are Struggling With Trumpian Chaos—and Bracing for More",
    "description": "Fielding phone calls from concerned growers has become a commonplace occurrence for Nick Levendofsky, the executive director of the Kansas Farmers Union. The upheaval in the U.S. Department of Agriculture since President Donald Trump took office in January ha…",
    "link": "https://newrepublic.com/article/195925/small-farmers-trump-budget-cuts",
    "timestamp": "2025-06-02T10:00:00Z"
  },
  {
    "title": "The Real Reason We Want to See MAGA as a Cult",
    "description": "It’s hard to pinpoint exactly when the word cult affixed itself to Donald Trump and his movement. It may have been as early as 2016, when, weeks before the Iowa caucus, Trump declared with god-man-like aplomb that he could shoot someone in Times Square and no…",
    "link": "https://newrepublic.com/article/195876/real-reason-want-see-maga-cult",
    "timestamp": "2025-06-02T10:00:00Z"
  },
  {
    "title": "Curtis Yarvin’s Plot Against America",
    "description": "A Profile of Curtis Yarvin, the right-wing thinker behind the Substack “Gray Mirror,” who has been embraced by J. D. Vance, Marc Andreessen, Peter Thiel, and other supporters of Donald Trump. Ava Kofman reports.",
    "link": "https://www.newyorker.com/magazine/2025/06/09/curtis-yarvin-profile",
    "timestamp": "2025-06-02T10:00:00Z"
  },
  {
    "title": "Republicans face new pressure to extend expiring Obamacare tax credits",
    "description": "WASHINGTON — Kenny Capps is a cancer patient who has been battling multiple myeloma for a decade.",
    "link": "https://www.nbcnews.com/politics/congress/republicans-face-new-pressure-extend-expiring-obamacare-tax-credits-rcna209281",
    "timestamp": "2025-06-02T10:00:00Z"
  },
  {
    "title": "Trump just turned on the architect of his biggest first-term victories",
    "description": "Last week, Donald Trump turned his fire on the Federalist Society, a powerful conservative advocacy group, and its co-founder Leonard Leo, a key adviser to Trump on judicial nominations during his first term.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-judges-federalist-society-leonard-leo-rcna209993",
    "timestamp": "2025-06-02T10:00:00Z"
  },
  {
    "title": "Boulder terror attack latest: Holocaust survivor among injured after pro-Israel rally in Colorado firebombed",
    "description": "Suspect shouting ‘Free Palestine!’ carries out ‘targeted terror attack,’ FBI says",
    "link": "https://www.the-independent.com/news/world/americas/crime/boulder-terror-attack-live-updates-colorado-mohamed-soliman-b2761887.html",
    "timestamp": "2025-06-02T09:57:15Z"
  },
  {
    "title": "Trump’s “gold standard science” rule would let political appointees edit government science and punish scientists, critics say",
    "description": "An executive order by Donald Trump promising to “restore the American people’s faith in the scientific enterprise” would install political appointees at the apex of the scientific process, with a mandate to edit or discard science that did not meet the admini…",
    "link": "https://www.bmj.com/content/389/bmj.r1131",
    "timestamp": "2025-06-02T09:56:09Z"
  },
  {
    "title": "Tesla not interested in manufacturing cars in India, but THESE four companies are — Check details",
    "description": "Elon Musk-led Tesla is not interested in manufacturing cars in India, but is focused on selling its electric vehicles in the nation, Union Heavy Industries' Minister H D Kumaraswamy reveals on 2 June 2025.&nbsp;",
    "link": "https://www.livemint.com/companies/news/tesla-not-interested-in-manufacturing-cars-in-india-h-d-kumaraswamy-ev-mercedes-benz-volkswagen-skoda-hyundai-kia-11748854883950.html",
    "timestamp": "2025-06-02T09:56:07Z"
  },
  {
    "title": "Britain getting a defense boost aimed at sending a message to Moscow, and to Trump",
    "description": "The U.K. will build new nuclear-powered attack submarines and create an army ready to fight a war in Europe as part of a boost to military spending",
    "link": "https://abcnews.go.com/International/wireStory/britain-defense-boost-aimed-sending-message-moscow-trump-122407642",
    "timestamp": "2025-06-02T09:55:11Z"
  },
  {
    "title": "PM says he won't set 'arbitrary date' for spending 3% of GDP on defence",
    "description": "Sir Keir Starmer has refused to say when the government could hit its \"ambition\" to spend 3% of GDP on defence amid questions over where the money will come from.",
    "link": "https://news.sky.com/story/starmer-says-he-wont-set-arbitrary-date-for-spending-3-of-gdp-on-defence-13378107",
    "timestamp": "2025-06-02T09:52:00Z"
  },
  {
    "title": "Let’s Unpack One of the More Disturbing Things Stephen Miller Has Said",
    "description": "Trump officials hinted that they'll target this key safety valve of our democracy. Can they?",
    "link": "https://slate.com/news-and-politics/2025/06/what-is-habeas-corpus-meaning-suspended-kristi-noem-stephen-miller.html",
    "timestamp": "2025-06-02T09:45:00Z"
  },
  {
    "title": "You Might Think Trump Has Destroyed Gay Pride in Conservative America, It’s Quite the Opposite.",
    "description": "Against all odds, small-town Prides are multiplying and thriving—even in the country's most conservative areas.",
    "link": "https://slate.com/life/2025/06/pride-2025-queer-lgbtq-trump-conservative.html",
    "timestamp": "2025-06-02T09:40:00Z"
  },
  {
    "title": "Russia-Ukraine fighting steps up ahead of talks in Turkey",
    "description": "Planned further direct talks in Turkey come after Ukraine targeted Russian long-range bombers with drone attacks",
    "link": "https://www.irishtimes.com/world/europe/2025/06/02/ukraine-russia-war-talks/",
    "timestamp": "2025-06-02T09:34:32Z"
  },
  {
    "title": "Tesla unlikely to make in India, will focus only on imports: All you need to know",
    "description": "The government is gearing up to invite formal applications under its new flagship policy, Scheme to Promote Manufacturing of Electric Passenger Cars in India (SPMEPCI). The scheme promises a reduced import duty of 15% from the current 70% for automakers that …",
    "link": "https://economictimes.indiatimes.com/tech/technology/tesla-unlikely-to-make-in-india-will-focus-only-on-imports-all-you-need-to-know/articleshow/121568729.cms",
    "timestamp": "2025-06-02T09:33:15Z"
  },
  {
    "title": "Barbara Ferris: Coronation Street actor dies, aged 85",
    "description": "‘Unforgettable’ actor was the sister of ‘Call the Midwife’ star Pam Ferris",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/coronation-street-barbara-ferris-death-itv-corrie-b2761860.html",
    "timestamp": "2025-06-02T09:33:12Z"
  },
  {
    "title": "China accuses US of violating trade truce",
    "description": "The accusations came after the US claimed that China violated the deal recently reached in Geneva Read Full Article at RT.com",
    "link": "https://www.rt.com/business/618493-china-us-violating-trade-deal/",
    "timestamp": "2025-06-02T09:32:00Z"
  },
  {
    "title": "Trump’s presidency has only seen federal spending rise so far",
    "description": "The widely publicized cuts of the US Department of Government Efficiency (DOGE) under Elon Musk have failed to prevent more of the same. Volatile federal tax revenue and high social security spending continue.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-federal-revenue-social-security-medicare-medicaid-tax-cuts-federal-debt-income-taxes-tariffs-doge-elon-musk-11748784783036.html",
    "timestamp": "2025-06-02T09:30:02Z"
  },
  {
    "title": "Iran Reviews US Nuclear Deal Offer Amid Rising Tensions",
    "description": "Iran is currently reviewing a formal U.S. nuclear deal proposal as both sides remain deeply divided over uranium enrichment limits and sanctions relief.",
    "link": "https://www.newsweek.com/iran-us-nuclear-deal-proposal-2079659",
    "timestamp": "2025-06-02T09:28:45Z"
  },
  {
    "title": "U.S. Treasury yields: investors monitor international trade relations",
    "description": "U.S. Treasury yields moved higher as investors monitored tariff updates including deteriorating relations with China and a legal battle with a trade court.",
    "link": "https://www.cnbc.com/2025/06/02/us-treasury-yields-investors-monitor-international-trade-relations.html",
    "timestamp": "2025-06-02T09:26:26Z"
  },
  {
    "title": "UK to build attack subs as part of major defence review",
    "description": "Britain announced it will build 12 new attack submarines as it was set to unveil Monday a major defence review to deal with “growing” Russian aggression and the changing nature of warfare. Prime Minister Keir Starmer told BBC radio that “there is greater inst…",
    "link": "https://www.digitaljournal.com/world/uk-to-build-attack-subs-as-part-of-major-defence-review/article",
    "timestamp": "2025-06-02T09:17:20Z"
  },
  {
    "title": "Trump Administration Set To Ease Big Bank Rules In Major Rollback Since 2008 Crisis: Here Are The Stocks And ETFs Investors Could Consider",
    "description": "As Donald Trump‘s administration nears completion of a proposal to ease big bank rules, Wall Street’s megabanks are largely expected to cheer the lower supplementary leverage ratio (SLR), allowing them to hold fewer capital reserves against their assets.\nWhat…",
    "link": "https://biztoc.com/x/74bde24542278265",
    "timestamp": "2025-06-02T09:16:42Z"
  },
  {
    "title": "Asian underdog & global biggies hit accelerator when Musk dodges desi market challenge",
    "description": "Vietnam’s Vingroup is entering India’s growing EV market through its arm VinFast, just as Tesla, after years of delay, prepares for its India launch. VinFast plans to open an assembly plant in India by June, backed by a $2 billion investment in Tamil Nadu. Al…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/vinfast-asian-underdog-global-biggies-byd-china-hit-accelerator-when-musk-tesla-dodges-desi-market-challenge-ahi/articleshow/121567521.cms",
    "timestamp": "2025-06-02T09:16:34Z"
  },
  {
    "title": "UK to build attack subs as part of major defense review",
    "description": "Britain announced it will build 12 new attack submarines as it was set to unveil Monday a major defense review to deal with \"growing\" Russian aggression and the changing nature of warfare.",
    "link": "https://www.hurriyetdailynews.com/uk-to-build-attack-subs-as-part-of-major-defense-review-209848",
    "timestamp": "2025-06-02T09:15:03Z"
  },
  {
    "title": "50 Cent Does Not Want Diddy Pardoned By Donald Trump",
    "description": "50 Cent has made it clear that he does not want Diddy to be pardoned by Donald Trump in case he is found guilty in his sex trafficking trial.",
    "link": "https://hiphopdx.com/news/50-cent-does-not-want-diddy-pardoned-by-donald-trump",
    "timestamp": "2025-06-02T09:14:16Z"
  },
  {
    "title": "John Fetterman Trashed In Home State Newspaper: 'Step Away'",
    "description": "The editorial board of the Philadelphia Inquirer accused the Democratic senator of neglecting his duties.",
    "link": "https://www.newsweek.com/john-fetterman-trashed-home-state-newspaper-2079648",
    "timestamp": "2025-06-02T09:13:14Z"
  },
  {
    "title": "‘Out Of His Mind’: Critics Aghast At Trump's ‘Detached From Reality’ New Message",
    "description": "The president shared a bizarre conspiracy theory about Joe Biden.",
    "link": "https://www.huffpost.com/entry/trump-biden-clone-reaction_n_683d54f9e4b08b77a4608b7c",
    "timestamp": "2025-06-02T09:08:39Z"
  },
  {
    "title": "Lucas: Indifferent to a king",
    "description": "If English King Charles III were a real king, he would have made some news during his two-day visit to Canada last week. We hardly knew he was there. But he was in Canada to give a speech “from the throne” at the opening of the Canadian Parliament. He would h…",
    "link": "https://www.bostonherald.com/2025/06/02/lucas-indifferent-to-a-king/",
    "timestamp": "2025-06-02T09:06:29Z"
  },
  {
    "title": "Trump's $5 million Gold Card offers the rich a fast lane to residency",
    "description": "Foreign nationals with $5 million to spare will soon be able to register for a new \"gold card\" visa program President Trump says would give them the right to live and work permanently in the United States. But key details about the program remain unclear.",
    "link": "https://www.npr.org/2025/06/02/nx-s1-5413517/trump-gold-card-visa-immigration-border-gold-green-card-migration-wealthy-five-million",
    "timestamp": "2025-06-02T09:01:00Z"
  },
  {
    "title": "As US braces for ‘significant' wildfires, Trump's agriculture secretary addresses Forest Service departures",
    "description": "Democrats accused President Trump of decimating the Forest Service ahead of wildfire season, but USDA Secretary Brooke Rollins says the agency is \"lean\" and \"effective.\"",
    "link": "https://www.foxnews.com/media/braces-significant-wildfires-trumps-agriculture-secretary-addresses-forest-service-departures",
    "timestamp": "2025-06-02T09:00:48Z"
  },
  {
    "title": "Eric Adams Urges DA Bragg To Prosecute Columbia Students Arrested for Storming Library",
    "description": "New York City mayor Eric Adams on Friday issued a public call to Manhattan district attorney Alvin Bragg not to drop prosecutions against students arrested at Columbia University after storming the school’s Butler Library earlier in May.\nThe post Eric Adams U…",
    "link": "https://freebeacon.com/campus/eric-adams-urges-da-bragg-to-prosecute-columbia-students-arrested-for-storming-library/",
    "timestamp": "2025-06-02T09:00:21Z"
  },
  {
    "title": "Could You Prove You’re a Citizen?",
    "description": "For Americans wrongfully detained by ICE, it can be nearly impossible to escape. The danger is increasing under the Trump administration.",
    "link": "http://nymag.com/intelligencer/article/trump-ice-detained-citizenship-proof.html",
    "timestamp": "2025-06-02T09:00:16Z"
  },
  {
    "title": "How much energy does AI really use? The answer is surprising - and a little complicated",
    "description": "Does a ChatGPT prompt use a bottle of water? We break down all your AI energy and sustainability questions, complete with tips on how to use AI as responsibly as possible.",
    "link": "https://www.zdnet.com/article/how-much-energy-does-ai-really-use-the-answer-is-surprising-and-a-little-complicated/",
    "timestamp": "2025-06-02T09:00:15Z"
  },
  {
    "title": "Liberal lobbyists line up to influence Holt government",
    "description": "New Brunswick’s registry of lobbyists has seen a wave of new filings from Liberal-connected consultants looking to influence Premier Susan Holt’s Liberal government on behalf of paying clients.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/new-lobbyists-holt-liberal-government-1.7548527",
    "timestamp": "2025-06-02T09:00:00Z"
  },
  {
    "title": "Role Reversal: Millions of Kids Are Caregivers for Elders. Why Their Numbers Might Grow.",
    "description": "As state officials anticipate Medicaid funding cuts that could strip resources for those with disabilities and chronic health conditions, an army of unpaid caregivers waits in the wings: children. At least 5.4 million kids are estimated to be caring for famil…",
    "link": "https://kffhealthnews.org/news/article/child-caregivers-increase-role-reversal-medicaid-cuts-trump-republicans/",
    "timestamp": "2025-06-02T09:00:00Z"
  },
  {
    "title": "Shari Redstone Might Be Headed for Jail",
    "description": "If Paramount's heiress chief settles with Trump, it will be seen as extortion and bribery.\nThe post Shari Redstone Might Be Headed for Jail appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/06/02/shari-redstone-might-be-headed-for-jail/",
    "timestamp": "2025-06-02T09:00:00Z"
  },
  {
    "title": "Ehud Barak: Israel Must Back Donald Trump’s Deal To End the War in Gaza",
    "description": "\"Why is Netanyahu, an intelligent, experienced, savvy politician, failing? The answer isn't simple,\" writes former Israeli Prime Minister Ehud Barak.",
    "link": "https://time.com/7290294/ehud-barak-trump-ceasefire-plan-way-forward-for-israel/",
    "timestamp": "2025-06-02T09:00:00Z"
  },
  {
    "title": "Trump overshadows Supreme Court as ruling season begins",
    "description": "WASHINGTON — The beginning of June marks the start of the traditional monthlong ruling season at the Supreme Court, when the justices hand down decisions in their biggest and most contentious cases.",
    "link": "https://www.nbcnews.com/politics/supreme-court/trump-overshadows-supreme-court-ruling-season-begins-rcna207284",
    "timestamp": "2025-06-02T09:00:00Z"
  },
  {
    "title": "'Without a doubt': Former Biden official says he believes Israel has committed war crimes in Gaza",
    "description": "A senior official in former president Joe Biden's administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza.",
    "link": "https://news.sky.com/story/former-biden-official-matthew-miller-says-he-believes-israel-has-committed-war-crimes-in-gaza-13378081",
    "timestamp": "2025-06-02T08:58:00Z"
  },
  {
    "title": "Stock markets dip as Beijing blasts Trump’s ‘bogus charges’ that it’s violating the Geneva trade agreement",
    "description": "Chinese shares fell Monday after U.S. President Donald Trump reinvigorated trade tensions with China, threatening an unsteady truce since negotiations in Geneva last month. \nHong Kong’s Hang Seng Index, which tracks companies traded in the Chinese city, fell …",
    "link": "https://biztoc.com/x/a18c026ebc26b756",
    "timestamp": "2025-06-02T08:54:24Z"
  },
  {
    "title": "Donald Trump's Net Approval Positive on Only One Key Issue",
    "description": "President Donald Trump's approval rating has fluctuated since he returned to the White House in January.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-poll-latest-2079638",
    "timestamp": "2025-06-02T08:51:09Z"
  },
  {
    "title": "Trump’s move to double aluminium import tariff will hurt Indian exporters, says industry body",
    "description": "The Aluminium Association of India expresses worry over increased US tariffs. These tariffs may negatively impact Indian aluminium manufacturers. They already face pressure from low-cost imports. The association seeks duty guardrails for the aluminium industr…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/metals-mining/trumps-move-to-double-aluminium-import-tariff-will-hurt-indian-exporters-says-industry-body/articleshow/121567717.cms",
    "timestamp": "2025-06-02T08:46:16Z"
  },
  {
    "title": "Factbox-Potential policy flashpoints between Poland's pro-Europe government and new president",
    "description": "WARSAW (Reuters) -Polish nationalist candidate Karol Nawrocki won the second round of the country's presidential election with 50.89% of the votes, the electoral commission said on Monday, in a blow to the reform agenda of the pro-European government. Read fu…",
    "link": "https://www.thestar.com.my/news/world/2025/06/02/factbox-potential-policy-flashpoints-between-poland039s-pro-europe-government-and-new-president",
    "timestamp": "2025-06-02T08:46:00Z"
  },
  {
    "title": "Trump cuts hundreds of EPA grants, leaving cities on the hook for climate resiliency",
    "description": "Critics argue the projects losing funding aren’t \"woke,\" they’re essential.",
    "link": "http://grist.org/cities/trump-cuts-hundreds-of-epa-grants-leaving-cities-on-the-hook-for-climate-resiliency/",
    "timestamp": "2025-06-02T08:45:00Z"
  },
  {
    "title": "Potential policy flashpoints between Poland's pro-Europe government and new president",
    "description": "Karol Nawrocki, a Polish nationalist, has won the presidential election, posing a challenge to Prime Minister Donald Tusk's pro-European government and its reform agenda. Nawrocki is expected to maintain the vetoing of bills, continuing the deadlock on key is…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/potential-policy-flashpoints-between-polands-pro-europe-government-and-new-president/articleshow/121567695.cms",
    "timestamp": "2025-06-02T08:44:40Z"
  },
  {
    "title": "$100K retest vs. highest monthly close ever: 5 Things to know in Bitcoin this week",
    "description": "Bitcoin price expectations are back in flux as a record monthly candle close contrasts with worries over a retest of lower support levels next.",
    "link": "https://cointelegraph.com/news/100k-retest-vs-highest-monthly-close-ever-5-things-bitcoin-this-week",
    "timestamp": "2025-06-02T08:42:33Z"
  },
  {
    "title": "Ukraine says ready for 'necessary steps' at Istanbul talks with Russia",
    "description": "ISTANBUL: Ukraine said Monday (Jun 2) it was ready to take \"necessary steps for peace\" at talks with Russia in Istanbul, where the two sides will exchange plans on how they want to end the three-year war, Europe's largest conflict since World War II. Urged on…",
    "link": "https://www.channelnewsasia.com/world/ukraine-says-ready-necessary-steps-istanbul-talks-russia-5162661",
    "timestamp": "2025-06-02T08:40:00Z"
  },
  {
    "title": "Ukraine-Russia peace talks to resume in Istanbul after surprise drone attack",
    "description": "Ukrainian and Russian delegations are set to meet again in Istanbul, Turkey, on Monday to take part in the next round of U.S.-brokered peace talks.",
    "link": "https://abcnews.go.com/International/ukraine-russia-peace-talks-resume-istanbul-after-surprise/story?id=122407264",
    "timestamp": "2025-06-02T08:39:56Z"
  },
  {
    "title": "GOP bill buries bombshell: only the rich could sue to stop Trump’s abuses",
    "description": "A single paragraph buried deep in a spending bill that passed the GOP-controlled House of Representatives earlier this month is causing growing concern among democracy watchdogs who warn the provision will make it so only the well-to-do would be in a good pos…",
    "link": "https://www.rawstory.com/gop-bill-buries-bombshell-only-the-rich-could-sue-to-stop-trumps-abuses/",
    "timestamp": "2025-06-02T08:38:02Z"
  },
  {
    "title": "US futures drop following steel tariff increase",
    "description": "United States stock futures fell early Monday, following the announcement by US President Donald Trump about a tariff increase on steel imports. Meanwhile, China sharply responded to Trump's accusatio...",
    "link": "https://biztoc.com/x/2e108ffc428415b7",
    "timestamp": "2025-06-02T08:32:35Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Monday",
    "description": "German states see record number of naturalisations, investors pick Germany over the US and other news in our roundup on Monday.",
    "link": "https://www.thelocal.de/20250602/today-in-germany-a-roundup-of-the-latest-news-on-monday-75",
    "timestamp": "2025-06-02T08:32:17Z"
  },
  {
    "title": "Boulder, Colorado attack: What we know, who are the suspect and victims?",
    "description": "Suspect Mohamed Soliman is under arrest after injuring eight people campaigning for the release of captives in Gaza.",
    "link": "https://www.aljazeera.com/news/2025/6/2/boulder-colorado-attack-what-we-know-who-are-the-suspect-and-victims",
    "timestamp": "2025-06-02T08:28:15Z"
  },
  {
    "title": "Crypto Prices Today: Bitcoin tops $105,000 as market eyes Fed signals and institutional flows",
    "description": "Bitcoin topped $105,000 on Monday, rebounding from weekend lows amid institutional buying and macro-driven optimism. Market focus is now on Fed signals and key resistance levels. While Ethereum slipped, altcoins saw modest gains. Experts see Bitcoin consolida…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/crypto-prices-today-bitcoin-tops-105000-as-market-eyes-fed-signals-and-institutional-flows/articleshow/121567288.cms",
    "timestamp": "2025-06-02T08:28:02Z"
  },
  {
    "title": "Britain is getting a defense boost aimed at sending a message to Moscow, and to Trump",
    "description": "LONDON (AP) — The United Kingdom will build new nuclear-powered attack submarines and create an army ready to fight a war in Europe as part of a boost to military spending designed to send a message to Moscow — and Washington. Prime Minister Keir Starmer said…",
    "link": "https://financialpost.com/pmn/britain-is-getting-a-defense-boost-aimed-at-sending-a-message-to-moscow-and-to-trump",
    "timestamp": "2025-06-02T08:27:52Z"
  },
  {
    "title": "Maggie Haberman Reveals Why Trump World Was Secretly Glad To See Musk Go",
    "description": "The tech billionaire was \"mostly\" a source of one thing, said The New York Times journalist.",
    "link": "https://www.huffpost.com/entry/maggie-haberman-trump-world-elon-musk_n_683d5980e4b08b77a4608ddf",
    "timestamp": "2025-06-02T08:27:46Z"
  }
]