[
  {
    "title": "Paramount Is The Latest Studio To Butcher Its Animation Legacy, And You Should Be Infuriated",
    "description": "Paramount has canceled two of its children's cartoon series amid 'restructuring,' in Hollywood's latest blow to the medium of animation.",
    "link": "https://www.slashfilm.com/2026207/paramount-latest-studio-butcher-animation-legacy/",
    "timestamp": "2025-11-15T13:45:00Z"
  },
  {
    "title": "Psaki Hurries to Walk Back Calling Trump a 'Predator' on Live TV",
    "description": "After making the suggestion that Trump is a predator, Psaki noted that there is no evidence that Trump committed any wrongdoing.",
    "link": "https://www.westernjournal.com/psaki-hurries-walk-back-calling-trump-predator-live-tv/",
    "timestamp": "2025-11-15T13:41:34Z"
  },
  {
    "title": "The 'eerily similar' ways how Trump and Biden tried to ease anger about the high cost of living",
    "description": "President Donald Trump’s problems with fixing the high cost of living might be giving voters a feeling of déjà vu.",
    "link": "https://www.click2houston.com/business/2025/11/15/the-eerily-similar-ways-how-trump-and-biden-tried-to-ease-anger-about-the-high-cost-of-living/",
    "timestamp": "2025-11-15T13:25:58Z"
  },
  {
    "title": "Trump Flips Out When Marjorie Taylor Hits Back — Posts Blizzard Of Attacks Amid Epstein Brawl",
    "description": "Trump showed his displeasure after Rep. Marjorie Taylor Greene shot back at him by posting a blizzard of attacks from the comments of her Twitter account.\nThe post Trump Flips Out When Marjorie Taylor Hits Back — Posts Blizzard Of Attacks Amid Epstein Brawl f…",
    "link": "https://www.mediaite.com/media/weird/trump-flips-out-when-marjorie-taylor-hits-back-posts-blizzard-of-attacks-amid-epstein-brawl/",
    "timestamp": "2025-11-15T13:24:00Z"
  },
  {
    "title": "BBC caught in crossfire of polarised political and media landscape",
    "description": "Accused of being biased by some, defended as a champion of impartiality by others, the BBC is once again the subject of a thorny debate about the role of a publicly funded broadcaster in an increasingly polarised landscape. The BBC is regularly used as politi…",
    "link": "https://www.digitaljournal.com/world/bbc-caught-in-crossfire-of-polarised-political-and-media-landscape/article",
    "timestamp": "2025-11-15T13:22:32Z"
  },
  {
    "title": "Trump calls it quits with Marjorie Taylor Greene amid Epstein feud, calling her 'Wacky'",
    "description": "U.S. President Donald Trump has publicly called it quits with one of his most stalwart MAGA-world supporters, referring to Georgia lawmaker Marjorie Taylor Greene as \"Wacky Marjorie\" and saying he would endorse a challenger against her in next year's midterms…",
    "link": "https://www.cbc.ca/news/world/u-s-trump-greene-fallout-9.6980332",
    "timestamp": "2025-11-15T13:22:06Z"
  },
  {
    "title": "The ‘eerily similar’ ways how Trump and Biden tried to ease anger about the high cost of living",
    "description": "WASHINGTON (AP) — President Donald Trump ‘s problems with fixing the high cost of living might be giving voters a feeling of deja vu. Just like the president who came before him, Trump is trying to sell the country on his plans to create factory jobs. The Rep…",
    "link": "https://financialpost.com/pmn/the-eerily-similar-ways-how-trump-and-biden-tried-to-ease-anger-about-the-high-cost-of-living",
    "timestamp": "2025-11-15T13:20:17Z"
  },
  {
    "title": "SA-US Relations | 'Key G20 Absentees should not be taken lightly'",
    "description": "The absence of key players from the G20 Summit should not be taken lightly.",
    "link": "https://www.enca.com/business/sa-us-relations-key-g20-absentees-should-not-be-taken-lightly",
    "timestamp": "2025-11-15T13:17:58Z"
  },
  {
    "title": "Jon Voight Urges Trump to 'Terminate' Zohran Mamdani's Election Victory to Stop NYC from Becoming a 'Socialist Crap City'",
    "description": "Jon Voight is calling on President Donald Trump to \"terminate\" socialist Zohran Mamdani's mayoral win in New York City.\nThe post Jon Voight Urges Trump to ‘Terminate’ Zohran Mamdani’s Election Victory to Stop NYC from Becoming a ‘Socialist Crap City’ appeared…",
    "link": "https://www.breitbart.com/entertainment/2025/11/15/jon-voight-urges-trump-to-terminate-zohran-mamdanis-election-victory-to-stop-nyc-from-becoming-a-socialist-crap-city/",
    "timestamp": "2025-11-15T13:17:41Z"
  },
  {
    "title": "Trump faces voters angry about inflation. Biden had the same problem",
    "description": "President Donald Trump’s problems with fixing the high cost of living might be giving voters a feeling of déjà vu. Just like President Joe Biden, Trump says lower prices are just around the corner. But Biden-era officials say that argument doesn't work with i…",
    "link": "https://apnews.com/article/trump-biden-high-prices-inflation-angry-voters-e6e65165deaf9dfc8dbb986f43b1a61a",
    "timestamp": "2025-11-15T13:15:52Z"
  },
  {
    "title": "‘You don’t care the president might be a pedophile?’: GOP advisor stuns panel with remarks",
    "description": "Republican strategist Angie Wong stunned CNN’s “Table for Five” Saturday after insisting that “real American voters” don’t care about Jeffrey Epstein and his deep connections to powerful figures, including President Donald Trump.President Donald Trump made a …",
    "link": "https://www.rawstory.com/jeffrey-epstein-2674298401/",
    "timestamp": "2025-11-15T13:08:09Z"
  },
  {
    "title": "Upheaval at the BBC: Is it a crisis or a coup?",
    "description": "The BBC reels in the midst of one of its most serious crises - was it manufactured to push it to the brink?",
    "link": "https://www.aljazeera.com/video/the-listening-post/2025/11/15/upheaval-at-the-bbc-is-it-a-crisis-or-a-coup",
    "timestamp": "2025-11-15T13:06:40Z"
  },
  {
    "title": "BBC should pay nothing to Trump, former director general says",
    "description": "Since the corporation's retraction, Trump has indicated he may continue legal action, upping the amount he could sue for to between $1bn (£759m) and $5bn.",
    "link": "https://www.bbc.com/news/articles/cy0yz13057do",
    "timestamp": "2025-11-15T13:05:05Z"
  },
  {
    "title": "FO° Talks: Trump’s 20-Point Peace Deal: Can Israel and Hamas Finally End the War?",
    "description": "Editor-in-Chief Atul Singh and former US Ambassador Gary Grappo, who served as Envoy and Head of Mission of the Office of the Quartet Representative Tony Blair in Jerusalem, discuss US President Donald Trump’s 20-point peace deal. The agreement has halted mor…",
    "link": "https://www.fairobserver.com/video/fo-talks-trumps-20-point-peace-deal-can-israel-and-hamas-finally-end-the-war/",
    "timestamp": "2025-11-15T13:03:15Z"
  },
  {
    "title": "Canadian football fans rally against attempt to adopt US rules",
    "description": "WINNIPEG, MANITOBA :The Canadian Football League is fighting fan unhappiness over upcoming rule changes that traditionalists say betray the Canadian version's proud differences from the better-known U.S. game, ahead of the championship game on Sunday. The CFL…",
    "link": "https://www.channelnewsasia.com/sport/canadian-football-fans-rally-against-attempt-adopt-us-rules-5469556",
    "timestamp": "2025-11-15T13:02:07Z"
  },
  {
    "title": "Judge blocks Trump administration from imposing fine on University of California over discrimination claims",
    "description": "The administration had earlier demanded that the University of California, Los Angeles (UCLA) pay $1.2 billion to restore frozen research funds after accusing the campus of allowing antisemitism.",
    "link": "https://indianexpress.com/article/world/judge-trump-administration-fine-on-university-of-california-discrimination-claims-10367748/",
    "timestamp": "2025-11-15T13:01:00Z"
  },
  {
    "title": "Leading Senate Democrat tells Fox News 'it's time ... for new leadership,' as Schumer faces growing pressure",
    "description": "Cory Booker calls for new Democratic leadership as pressure mounts on Chuck Schumer. The New Jersey senator says it's time for younger generations to step up.",
    "link": "https://www.foxnews.com/politics/eading-senate-democrat-tells-fox-news-its-time-for-new-leadership-schumer-faces-growing-pressure",
    "timestamp": "2025-11-15T13:00:57Z"
  },
  {
    "title": "Colombian president's bold proposal: A merger with Venezuela to counter U.S. aggression",
    "description": "Though unlikely to happen, the proposal underscores the breakdown in relations between Washington and Bogota, historically the White House’s closest ally in the region",
    "link": "https://nationalpost.com/news/world/colombia-president-proposes-merger-with-venezuela",
    "timestamp": "2025-11-15T13:00:33Z"
  },
  {
    "title": "BROADCAST BIAS: BBC caught twisting Trump’s words and US media rush to their defense",
    "description": "PBS and NPR defend BBC against conservative bias allegations while media analyst Brian Stelter dismisses Trump editing controversy as unintentional mistake.",
    "link": "https://www.foxnews.com/opinion/broadcast-bias-bbc-caught-twisting-trumps-words-us-media-rush-defense",
    "timestamp": "2025-11-15T13:00:30Z"
  },
  {
    "title": "Anti-Trump network behind mass protests cracks open war chest against Dems who backed reopening government",
    "description": "A left-wing group behind the massive \"No Kings\" protests targeting President Donald Trump and his administration launched its largest primary undertaking: targeting Senate Democrats who joined Republicans to reopen the government. \"This is no longer about the…",
    "link": "https://freerepublic.com/focus/f-news/4352670/posts",
    "timestamp": "2025-11-15T13:00:20Z"
  },
  {
    "title": "'You won't have a country left': Trump says UK should deport illegal immigrants immediately",
    "description": "US President Donald Trump has said the UK must follow America's hard line on immigration or 'you're not going to have a country left'. He praised his own immigration policies, claiming he had reduced people entering the US illegally to 'zero', adding the UK m…",
    "link": "https://freerepublic.com/focus/f-news/4352669/posts",
    "timestamp": "2025-11-15T13:00:01Z"
  },
  {
    "title": "The government shutdown is over. The air traffic controller shortage is not",
    "description": "Staffing shortages of air traffic controllers forced airlines to chop flights and delay thousands of others that disrupted travel plans of 5 million people.",
    "link": "https://www.cnbc.com/2025/11/15/government-shutdown-air-traffic-controllers.html",
    "timestamp": "2025-11-15T13:00:01Z"
  },
  {
    "title": "Exclusive: Scaramuccis led $220 million investment in crypto mining firm tied to President’s family—‘Bitcoin transcends politics’",
    "description": "Once a member of Trump’s first administration, Anthony Scaramucci has become a vocal critic of the President.",
    "link": "https://fortune.com/2025/11/15/aj-scaramucci-anthony-scaramucci-solari-capital-american-bitcoin-trump-crypto-empire/",
    "timestamp": "2025-11-15T13:00:00Z"
  },
  {
    "title": "Russell Brand Called Me a Nazi at Anti-Vaxxer Prom",
    "description": "My weekend with America’s biggest RFK Jr. fans",
    "link": "https://www.theatlantic.com/health/2025/11/childrens-health-defense-vaccine-kennedy/684938/",
    "timestamp": "2025-11-15T13:00:00Z"
  },
  {
    "title": "Jana Partners push to break up Cooper Cos. could change the stock's outlook",
    "description": "Jana announced a top portfolio position in Cooper and plans to push for strategic alternatives, including a potential combination for its contact lens unit.",
    "link": "https://www.cnbc.com/2025/11/15/jana-partners-push-to-break-up-cooper-cos-could-change-the-stocks-outlook.html",
    "timestamp": "2025-11-15T12:59:16Z"
  },
  {
    "title": "US approves first arms sale to Taiwan under Trump",
    "description": "Beijing has said that the American weapons supplies to the self-governing island violate China’s sovereignty and security interests Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627826-us-taiwan-arms-china/",
    "timestamp": "2025-11-15T12:58:53Z"
  },
  {
    "title": "Tarot Cards Predictions Today, November 16, 2025: The Moon reveals secrets, these zodiac signs will uncover hidden truths",
    "description": "Today's tarot reading offers guidance for Aries through Pisces, emphasizing inner strength, emotional honesty, and mindful decision-making. Each sign receives a specific card and advice, encouraging self-trust, boundary setting, and embracing personal growth.…",
    "link": "https://timesofindia.indiatimes.com/astrology/numerology-tarot/tarot-cards-predictions-today-november-16-2025-the-moon-reveals-secrets-these-zodiac-signs-will-uncover-hidden-truths/articleshow/125348419.cms",
    "timestamp": "2025-11-15T12:58:19Z"
  },
  {
    "title": "Democrats’ ‘Principled Stand’ on the Shutdown Is an Attempt to Pay Back Their Health Insurance Donors",
    "description": "Democrats were repaying their corporate donors by shutting down the government to keep billions of taxpayer money flowing to health insurance companies.\nThe post Democrats’ ‘Principled Stand’ on the Shutdown Is an Attempt to Pay Back Their Health Insurance Do…",
    "link": "https://www.breitbart.com/politics/2025/11/15/democrats-principled-stand-on-the-shutdown-is-an-attempt-to-pay-back-their-health-insurance-donors/",
    "timestamp": "2025-11-15T12:50:49Z"
  },
  {
    "title": "Trump Yanks Support for 'Wacky' Marjorie Taylor Greene",
    "description": "President Trump has publicly called it quits with one of his most stalwart MAGA-world supporters, calling Georgia Rep. Marjorie Taylor Greene \"Wacky Marjorie\" and saying he would endorse a challenger against her in next year's midterms \"if the right person ru…",
    "link": "https://www.newser.com/story/378744/trump-yanks-support-for-wacky-marjorie-taylor-greene.html",
    "timestamp": "2025-11-15T12:50:00Z"
  },
  {
    "title": "'Rattled' Trump taking new approach to keep his base from turning on him: report",
    "description": "Donald Trump is finding out the hard way that anything he says about teen sex abuser Jeffrey Epstein and the notorious files the DOJ is sitting on, which are at the center of a brutal fight in Congress, is not helping his case with his base so he is being for…",
    "link": "https://www.rawstory.com/trump-epstein-reporters/",
    "timestamp": "2025-11-15T12:47:37Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday, November 15, 2025, shabbos for Jewish cats and National Bundt Day, referring to the bundt cake, whose etymology is obscure. But it’s a good (minus the raisins), and here’s one. It would be great for breakfast with coffee: It’s also N…",
    "link": "https://whyevolutionistrue.com/2025/11/15/saturday-hili-dialogue-558/",
    "timestamp": "2025-11-15T12:45:40Z"
  },
  {
    "title": "IRGC says tanker seized near Iran’s waters based on judicial order",
    "description": "The latest vessel confiscation comes as regional tensions remain high, months after the June war with Israel and the US.",
    "link": "https://www.aljazeera.com/news/2025/11/15/irgc-says-tanker-seized-near-irans-waters-based-on-judicial-order",
    "timestamp": "2025-11-15T12:30:01Z"
  },
  {
    "title": "Reagan-appointed judge accuses Supreme Court of undermining rule of law to help Trump",
    "description": "Earlier this week, senior U.S. District judge Mark Wolf (an appointee of former President Ronald Reagan) retired from his post, saying President Donald Trump's \"assault on the rule of law was \"deeply disturbing\" and that he felt \"compelled to speak out.\" And …",
    "link": "https://www.rawstory.com/supreme-court-2674298367/",
    "timestamp": "2025-11-15T12:29:39Z"
  },
  {
    "title": "MAGA Reacts As Donald Trump Cuts Ties WIth Marjorie Taylor Greene",
    "description": "Several famous MAGA-aligned voices backed Trump’s decision on Greene, who has recently become critical of the President.",
    "link": "https://biztoc.com/x/16760830a372c688",
    "timestamp": "2025-11-15T12:27:38Z"
  },
  {
    "title": "From coffee to beef, President Trump rolls back tariffs on dozens of products",
    "description": "President Donald Trump is immediately lifting tariffs on a range of agricultural products, many of which are not widely made in the United States.",
    "link": "https://www.wmur.com/article/from-coffee-to-beef-president-trump-rolls-back-tariffs-on-dozens-of-products/69445033",
    "timestamp": "2025-11-15T12:26:15Z"
  },
  {
    "title": "From coffee to beef, President Trump rolls back tariffs on dozens of products",
    "description": "President Donald Trump is immediately lifting tariffs on a range of agricultural products, many of which are not widely made in the United States.",
    "link": "https://www.wtae.com/article/from-coffee-to-beef-president-trump-rolls-back-tariffs-on-dozens-of-products/69445033",
    "timestamp": "2025-11-15T12:25:52Z"
  },
  {
    "title": "Theresa May shares her diabetes story in Maltese parliament",
    "description": "Former UK prime minister urges MPs to step up access to life-saving technology",
    "link": "https://timesofmalta.com/article/theresa-shares-personal-diabetes-story-maltese-parliament.1119641",
    "timestamp": "2025-11-15T12:25:00Z"
  },
  {
    "title": "Daily Career Horoscope, November 16, 2025: Luck meets hard work, these zodiac signs will make major gains",
    "description": "Harness celestial guidance for daily career and financial advancement. Discover personalized insights to boost productivity, manage finances wisely, and seize opportunities. Follow tailored horoscope advice to navigate your professional and wealth-building jo…",
    "link": "https://timesofindia.indiatimes.com/astrology/horoscope/daily-career-horoscope-november-16-2025-luck-meets-hard-work-these-zodiac-signs-will-make-major-gains/articleshow/125347592.cms",
    "timestamp": "2025-11-15T12:22:02Z"
  },
  {
    "title": "What is Bajre ki Raab? Why this traditional dish is a winter staple",
    "description": "As winter approaches, embrace Bajre ki Raab, a traditional Indian drink from Rajasthan and Gujarat. This nourishing porridge, made with pearl millet, jaggery, ghee, and warming spices, is a time-tested remedy for boosting immunity and sustaining energy during…",
    "link": "https://timesofindia.indiatimes.com/life-style/food-news/what-is-bajre-ki-raab-why-this-traditional-dish-is-a-winter-staple/articleshow/125347320.cms",
    "timestamp": "2025-11-15T12:18:52Z"
  },
  {
    "title": "The US War on China, Venezuela, and the Global Left",
    "description": "Resistance movements against US imperialism have sprouted up all over the world in response to its indiscriminate violence and disregard for human life. Together, they form the living front of the international left, a network of people and organizations that…",
    "link": "https://www.commondreams.org/opinion/us-war-china-venezuela",
    "timestamp": "2025-11-15T12:18:02Z"
  },
  {
    "title": "Jeff Bezos and Lauren Sánchez Bezos are having their most fashionable year yet. Here's what they've worn so far.",
    "description": "Jeff Bezos and Lauren Sánchez Bezos didn't just get married this year. They also reached fashion milestones together at gala events and red carpets.",
    "link": "https://www.businessinsider.com/jeff-bezos-lauren-sanchez-fashionable-year-outfit-photos-2025",
    "timestamp": "2025-11-15T12:18:01Z"
  },
  {
    "title": "IRS Stimulus Check Rumours: What is the truth behind the $1,390 IRS payment rumour — here's the real story behind the $2,000 “tariff dividend” claim",
    "description": "IRS stimulus check November 2025: IRS stimulus rumours claim $1,390 or $2,000 direct deposits are coming this month, but verified data confirms no new federal payments exist. The IRS says Congress has passed no legislation. Reuters reports no stimulus checks …",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-stimulus-check-rumours-what-is-the-truth-behind-the-1390-irs-payment-rumour-heres-the-real-story-behind-the-2000-tariff-dividend-claim/articleshow/125347353.cms",
    "timestamp": "2025-11-15T12:12:25Z"
  },
  {
    "title": "Polls: Unpopular AZ Democrat Governor Katie Hobbs in Reelection Trouble",
    "description": "Biggs, a former chair of the conservative House Freedom Caucus, is the clear GOP favorite to advance to the general election against Hobbs.",
    "link": "https://www.westernjournal.com/polls-unpopular-az-democrat-governor-katie-hobbs-reelection-trouble/",
    "timestamp": "2025-11-15T12:11:42Z"
  },
  {
    "title": "Thailand says US suspending talks on trade framework over Cambodia truce dispute",
    "description": "BANGKOK (Reuters) -Thailand said on Saturday the United States had told Bangkok that it was suspending talks on finalising a reciprocal trade deal until the Thai government reaffirms its commitment to a ceasefire with Cambodia. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/15/thailand-says-us-suspending-talks-on-trade-framework-over-cambodia-truce-dispute",
    "timestamp": "2025-11-15T12:05:00Z"
  },
  {
    "title": "Saturday Morning Open Thread: Hopeful Indicators",
    "description": "this is imo \"there is going to be an extension\" talk [image or embed] — post malone ergo propter malone (@proptermalone.bsky.social) November 14, 2025 at 8:32 AM === This is arguably an exercise in \"what's popular is whatever Republicans approve of that Democ…",
    "link": "https://balloon-juice.com/2025/11/15/saturday-morning-open-thread-hopeful-indicators/",
    "timestamp": "2025-11-15T12:04:57Z"
  },
  {
    "title": "Setting the stage: What the 2025 elections signal for next year's midterm showdowns",
    "description": "Democrats claim economy focus drove 2025 gubernatorial wins in New Jersey and Virginia, setting stage for 2026 midterm elections as affordability remains key voter issue.",
    "link": "https://www.foxnews.com/politics/setting-stage-what-2025-elections-signal-next-years-midterm-showdowns",
    "timestamp": "2025-11-15T12:00:34Z"
  },
  {
    "title": "Why Trump Gets Away With It",
    "description": "The institutional checks that got the country through Watergate are far weaker now.",
    "link": "https://www.theatlantic.com/ideas/2025/11/trump-watergate-checks-balances/684916/",
    "timestamp": "2025-11-15T12:00:00Z"
  },
  {
    "title": "NATO members to pay over €400mn for Ukraine’s US weapons",
    "description": "The €430 million pledge by eight NATO members comes as Kiev grapples with a major graft scandal involving associates of Vladimir Zelensky Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627820-nato-members-pay-400mn-ukraine/",
    "timestamp": "2025-11-15T11:57:39Z"
  },
  {
    "title": "Links 11/15/2025",
    "description": "Our saucy daily links: seal escape, flu vaccine poor expectations, China v. US soyabeans, Berlin v. Huawei, Starmer sinking, Houthi Red Sea escalation, Mark Levin v. Tucker, Ukraine more dire, Trump interview backfire, no THC? Trump cuts some tariffs, datacen…",
    "link": "https://www.nakedcapitalism.com/2025/11/links-11-15-2025.html",
    "timestamp": "2025-11-15T11:55:58Z"
  },
  {
    "title": "Are US elite colleges steering students into finance and consulting?",
    "description": "Elite universities are under scrutiny for career funneling, a practice where students are subtly guided toward finance, consulting, and tech from freshman year onward. While early recruitment can open doors, especially for students from modest backgrounds, cr…",
    "link": "https://timesofindia.indiatimes.com/education/news/are-us-elite-colleges-steering-students-into-finance-and-consulting/articleshow/125346962.cms",
    "timestamp": "2025-11-15T11:52:45Z"
  },
  {
    "title": "Donald Trump’s America First movement seems to be fracturing",
    "description": "Conservative criticism of the president is escalating — in potentially damaging ways",
    "link": "https://www.salon.com/2025/11/15/donald-trumps-america-first-movement-seems-to-be-fracturing/",
    "timestamp": "2025-11-15T11:45:24Z"
  },
  {
    "title": "Trump says he will take legal action against BBC, despite its apology",
    "description": "US president says he will sue the corporation for ‘anywhere between a billion and $5bn’\nDonald Trump has said he still plans to sue the BBC despite receiving the apology he demanded over a misleading edit of one of his speeches.\nThe row, over an episode of Pa…",
    "link": "https://biztoc.com/x/742ecef03230ed02",
    "timestamp": "2025-11-15T11:31:59Z"
  },
  {
    "title": "Will Ecuador allow US troops on its soil?",
    "description": "If successful, Sunday's referendum will change Ecuador's constitution, enabling the return of US forces in a move intended to bolster ties between President Daniel Noboa's government and the Trump Administration.",
    "link": "https://www.dw.com/en/will-ecuador-allow-us-troops-on-its-soil/a-74712635",
    "timestamp": "2025-11-15T11:20:00Z"
  },
  {
    "title": "Analysis-Trump's Teflon tested as Epstein saga looms over 2026 campaign",
    "description": "WASHINGTON (Reuters) -President Donald Trump was eager to claim victory this week after the record-long U.S. government shutdown ended on his terms. But almost immediately, the White House was forced to battle a familiar bogeyman: Jeffrey Epstein. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/11/15/analysis-trump039s-teflon-tested-as-epstein-saga-looms-over-2026-campaign",
    "timestamp": "2025-11-15T11:12:00Z"
  },
  {
    "title": "What next as Donald Trump says he will take legal action against the BBC",
    "description": "Anyone who thought an apology to Donald Trump was going to stop his threat of a lawsuit was deluded, writes Culture and Media Editor Katie Razzall.",
    "link": "https://www.bbc.co.uk/news/articles/cy0yz5r8lypo",
    "timestamp": "2025-11-15T11:07:41Z"
  },
  {
    "title": "Trump's Teflon tested as Epstein saga looms over 2026 campaign",
    "description": "New emails about Jeffrey Epstein have resurfaced, creating a challenge for President Trump.  These messages raise questions about his past ties to the disgraced financier.  Despite White House efforts to dismiss them, the emails could impact Republican suppor…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-teflon-tested-as-epstein-saga-looms-over-2026-campaign/articleshow/125346613.cms",
    "timestamp": "2025-11-15T11:01:51Z"
  },
  {
    "title": "It's official: Members of Congress won't get a pay bump this year",
    "description": "The bill to reopen the government kept lawmakers' salaries frozen at $174,000 a figure that hasn't budged since 2009.",
    "link": "https://www.businessinsider.com/its-official-members-of-congress-wont-get-a-pay-bump-this-year-2025-11",
    "timestamp": "2025-11-15T11:01:01Z"
  },
  {
    "title": "Socialist wave goes coast-to-coast as historic wins shake up the 2025 mayoral elections",
    "description": "The Democratic Socialists of America celebrated their biggest ballot victory yet as Zohran Mamdani won in New York City, while socialist Katie Wilson was elected to lead Seattle.",
    "link": "https://www.foxnews.com/politics/democratic-socialists-win-mayoral-races-new-york-city-seattle-historic-victories",
    "timestamp": "2025-11-15T11:00:47Z"
  },
  {
    "title": "Trump administration stays silent as massive Ukraine corruption scandal rocks Zelenskyy's inner circle",
    "description": "Trump administration stays silent as $100 million Ukraine corruption scandal rocks Zelenskyy's government, prompting senior official resignations.",
    "link": "https://www.foxnews.com/politics/trump-administration-stays-silent-massive-ukraine-corruption-scandal-rocks-zelenskys-inner-circle",
    "timestamp": "2025-11-15T11:00:02Z"
  },
  {
    "title": "Trump's latest Border Patrol deployment will fail for the same reasons",
    "description": "North Carolina Gov. Josh Stein responded after news that Border Patrol agents will be conducting operations in Charlotte.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/charlotte-border-patrol-cbp-ice-immigration-trump-rcna243979",
    "timestamp": "2025-11-15T11:00:00Z"
  },
  {
    "title": "The Mystery of the Political Assassin",
    "description": "Even in cases like Luigi Mangione’s, the intentions of assassins are dwarfed by the meanings we project onto them, Margaret Talbot writes.",
    "link": "https://www.newyorker.com/news/the-weekend-essay/the-mystery-of-the-political-assassin",
    "timestamp": "2025-11-15T11:00:00Z"
  },
  {
    "title": "Nearly 70 Planned Parenthood centers have closed this year, according to abortion giant",
    "description": "null / Credit: Jonathan Weiss/Shutterstock\n\nCNA Staff, Nov 15, 2025 / 06:00 am (CNA).\nHere is a roundup of recent pro-life- and abortion-related news:Nearly 70 Planned Parenthood centers have closed nationwide in 2025Nearly 70 Planned Parenthood centers have …",
    "link": "https://www.catholicnewsagency.com/news/267833/nearly-70-planned-parenthood-centers-have-closed-this-year",
    "timestamp": "2025-11-15T11:00:00Z"
  },
  {
    "title": "Victor Davis Hanson: The ‘Alt-Alt-Right’s’ Numerous Misconceptions About Israel",
    "description": "Editor’s note: This is a lightly edited transcript of today’s edition of “Victor Davis Hanson: In His Own Words” from Daily Signal Senior Contributor Victor... Read More\nThe post Victor Davis Hanson: The ‘Alt-Alt-Right’s’ Numerous Misconceptions About Israel …",
    "link": "https://www.dailysignal.com/2025/11/15/victor-davis-hanson-the-alt-alt-rights-numerous-misconceptions-about-israel/",
    "timestamp": "2025-11-15T11:00:00Z"
  },
  {
    "title": "Marco Rubio Wants to Imprison You on Terror Charges for Supporting Nazi Punchers",
    "description": "The Trump administration moved to designate antifa groups abroad as foreign terrorists — setting up the prosecution of their U.S. allies.\nThe post Marco Rubio Wants to Imprison You on Terror Charges for Supporting Nazi Punchers appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/11/15/antifa-terrorist-rubio-nazi-material-support/",
    "timestamp": "2025-11-15T11:00:00Z"
  },
  {
    "title": "There Are Two U.S. Senates—and Only One Knows How to Get What It Wants",
    "description": "The United States Senate: Can’t live with it, can’t burn it down (or so my lawyers caution me). Recently, I’ve had cause to ruminate on the upper house’s continued existence and the way its workings threaten our own. And then, this week, liberals were given n…",
    "link": "https://newrepublic.com/post/203160/senate-democrats-republicans-shutdown-politics",
    "timestamp": "2025-11-15T11:00:00Z"
  },
  {
    "title": "Belarus Prioritizes Crypto Mining Amid Push to Break Dollar Dominance",
    "description": "Belarusian President Aleksandr Lukashenko has positioned crypto mining as a strategic pathway toward reducing global dollar dependency, announcing aggressive...",
    "link": "https://cryptonews.com/news/belarus-prioritizes-crypto-mining-amid-push-to-break-dollar-dominance/",
    "timestamp": "2025-11-15T10:58:17Z"
  },
  {
    "title": "BBC now faces tough legal battle with world's most powerful man. What happens next?",
    "description": "Anyone who thought an apology to Donald Trump was going to stop his threat of a lawsuit was deluded, writes Culture and Media Editor Katie Razzall.",
    "link": "https://www.bbc.com/news/articles/cy0yz5r8lypo",
    "timestamp": "2025-11-15T10:49:51Z"
  },
  {
    "title": "Trump to sue BBC for $1billiion to $5 billion",
    "description": "London, Nov 15: US President Donald Trump has said he will take legal action against the BBC over how Panorama […]\nThe post Trump to sue BBC for $1billiion to $5 billion appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/11/15/trump-to-sue-bbc-for-1billiion-to-5-billion/",
    "timestamp": "2025-11-15T10:45:00Z"
  },
  {
    "title": "US threatens 107% tariff on Italian pasta, sparking backlash",
    "description": "The U.S. Commerce Department has launched an antidumping review targeting Italian pasta, claiming it’s sold below market prices. This could lead to a 92% duty on top of an existing 15% tariff from the Trump administration. The potential 107% levy has alarmed …",
    "link": "https://apnews.com/article/italy-trump-pasta-prices-tariffs-94032b5c7cf964d9d2369ab2f06fa6ed",
    "timestamp": "2025-11-15T10:44:09Z"
  },
  {
    "title": "Naive Trump triggered this unthinkable horror to save his skin",
    "description": "“Russia unleashed a massive combined attack on Kyiv” last night, The Guardian reports. “Five people were hospitalized, including one man in critical condition and a pregnant woman, after a series of powerful explosions sounded in the city and air defenses wer…",
    "link": "https://www.rawstory.com/raw-investigates/trump-epstein-2674296038/",
    "timestamp": "2025-11-15T10:30:01Z"
  },
  {
    "title": "Timeline: Trump administration responses in Epstein files release saga",
    "description": "The Trump Administration has come under fire for months over its handling of the Jeffrey Epstein investigation.",
    "link": "https://abcnews.go.com/Politics/timeline-trump-administration-responses-epstein-files-release-saga/story?id=127529275",
    "timestamp": "2025-11-15T10:29:25Z"
  },
  {
    "title": "Prison staff fired after leaking Ghislaine Maxwell emails, says lawyer",
    "description": "Prison staff who leaked details about Ghislaine Maxwell's favourable conditions in a minimum-security facility have been sacked, according to a lawyer for the disgraced British socialite.",
    "link": "https://news.sky.com/story/ghislaine-maxwell-prison-staff-fired-after-leaking-her-emails-says-lawyer-13470670",
    "timestamp": "2025-11-15T10:21:00Z"
  },
  {
    "title": "White House memo alleges Alibaba aided Chinese military in targeting the US: Report",
    "description": "Alibaba has rejected the allegations, telling the newspaper: “The claims purportedly based on US intelligence that was leaked by your source are complete nonsense. This is plainly an attempt to manipulate public opinion and malign Alibaba.” The company did no…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-memo-alleges-alibaba-aided-chinese-military-in-targeting-the-us-report/articleshow/125345853.cms",
    "timestamp": "2025-11-15T10:16:37Z"
  },
  {
    "title": "KL Peace Accord: Malaysia welcomes diplomatic commitments from Thailand, Cambodia",
    "description": "KUALA LUMPUR: Malaysia welcomes the commitment and assurances from Thailand and Cambodia to engage in diplomatic efforts to ensure a full and effective implementation of the KL Peace Accord, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/11/15/kl-peace-accord-malaysia-welcomes-diplomatic-commitments-from-thailand-cambodia",
    "timestamp": "2025-11-15T10:15:00Z"
  },
  {
    "title": "Right-wing media shrugs off latest Epstein document release",
    "description": "Right-wing media shrugs off latest Epstein document release\nWhat do thousands of pages of newly released material reveal about the well-documented relationship between convicted sex offender Jeffrey Epstein and President Donald Trump?\nNot much of anything, ac…",
    "link": "https://biztoc.com/x/d85fb649a60379b4",
    "timestamp": "2025-11-15T10:13:49Z"
  },
  {
    "title": "The Evolution of Marjorie Taylor Greene",
    "description": "The Georgia Republican has broken with U.S. President Donald Trump on a number of policy issues in recent months.",
    "link": "https://biztoc.com/x/555deefe8ac614cc",
    "timestamp": "2025-11-15T10:13:44Z"
  },
  {
    "title": "I’m a Celebrity salary ‘leak’ reveals how much stars are getting paid",
    "description": "What this year’s campmates will be taking home following ITV jungle appearance",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/im-a-celebrity-2025-itv-salary-paid-b2865851.html",
    "timestamp": "2025-11-15T10:05:51Z"
  },
  {
    "title": "Ten Days That Shook Trump's Second Term",
    "description": "In the ten days since the 2025 elections, Donald Trump has faced a series of political blows that left his allies rattled, his base divided, and his once-durable administration suddenly strained. A humbling Election Day rout of GOP candidates up and down the …",
    "link": "https://biztoc.com/x/54c834f1f56a2f55",
    "timestamp": "2025-11-15T10:02:41Z"
  },
  {
    "title": "Trump says will sue BBC for billions over video edit",
    "description": "US President Donald Trump said on Friday he would sue the BBC for up to $5 billion, after the British broadcaster apologized but said it would not pay damages for a misleading speech edit.\nThe broadcaster has rejected Trump’s legal defamation claim, but the p…",
    "link": "https://biztoc.com/x/1bef8d329ec9a421",
    "timestamp": "2025-11-15T10:02:18Z"
  },
  {
    "title": "Air traffic controllers didn't get paid during the government shutdown. Here's how much they make normally.",
    "description": "Transportation Secretary Sean Duffy said new air traffic controllers' starting pay is $180,000. It's more like $55,000 — and their mean wage is $137K.",
    "link": "https://www.businessinsider.com/air-traffic-controller-atc-how-much-make-salary-paid-shutdown-2025-11",
    "timestamp": "2025-11-15T10:01:01Z"
  },
  {
    "title": "GOP Can’t Stop Touching Hot Stove of Obamacare Repeal",
    "description": "The GOP can’t stop touching the hot stove of Obamacare repeal. Rather than extending ACA subsidies, Republicans are eyeing another ill-advised push to replace them with Trumpcare.",
    "link": "http://nymag.com/intelligencer/article/gop-cant-stop-touching-hot-stove-of-obamacare-repeal.html",
    "timestamp": "2025-11-15T10:00:18Z"
  },
  {
    "title": "A Tale of Two Terms: How Powerful Figures Were Prosecuted in Trump’s First Term, Then Pardoned in His Second",
    "description": "We found that Donald Trump has granted clemency in at least a dozen criminal cases that originated during his first term. No other president has used clemency to erase his own appointees’ actions on such a scale.",
    "link": "http://www.propublica.org/article/trump-pardons-erased-prosecutions-second-term",
    "timestamp": "2025-11-15T10:00:00Z"
  },
  {
    "title": "Right-wing media shrugs off latest Epstein document release",
    "description": "\"To me, these are nothingburgers. If they're even real,\" said one pro-Trump podcaster, of the thousands of documents that were released this week, including several that named the president.",
    "link": "https://www.npr.org/2025/11/15/nx-s1-5608227/epstein-emails-qanon-influencers",
    "timestamp": "2025-11-15T10:00:00Z"
  },
  {
    "title": "The deal to end the shutdown exposed rifts among Democrats. Just ask Maine",
    "description": "Maine's four-person Congressional delegation is one of the smallest in the country. Yet their mixed votes on the bill to reopen the government reflect the national divide over the fraught issue.",
    "link": "https://www.npr.org/2025/11/15/nx-s1-5607162/maine-government-shutdown-democrats-rift-2026-election",
    "timestamp": "2025-11-15T10:00:00Z"
  },
  {
    "title": "Donald Trump says he will take legal action against the BBC over edited speech",
    "description": "Donald Trump has said he will sue the BBC next week after the corporation apologised but declined to compensate him for its edited version of a 2021 speech broadcast by Panorama.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-says-he-will-take-legal-action-against-the-bbc-over-edited-speech/a1645078216.html",
    "timestamp": "2025-11-15T09:49:33Z"
  },
  {
    "title": "At Trump's urging, Bondi says U.S. will investigate Epstein's ties to political foes",
    "description": "Acceding to President Donald Trump's demands, U.S. Attorney General Pam Bondi said Friday that she has ordered a top federal prosecutor to investigate Jeffrey Epstein's ties to Trump political foes.",
    "link": "https://www.npr.org/2025/11/15/g-s1-97958/bondi-investigate-epstein-ties-to-political-foes",
    "timestamp": "2025-11-15T09:48:07Z"
  },
  {
    "title": "Trump says will sue BBC for billions over video edit",
    "description": "UK's public service broadcaster the latest target of US president's litigation against what he calls \"fake news\" media",
    "link": "https://www.euractiv.com/news/trump-says-will-sue-bbc-for-billions-over-video-edit/",
    "timestamp": "2025-11-15T09:44:52Z"
  },
  {
    "title": "Battenfeld: Massachusetts needs new political movement to save it from Democrats",
    "description": "The state Republican Party can continue to spin its wheels in the next few elections, or can it morph into something new and more formidable – a common sense movement of conservatives and independents who can be a force at the ballot box?",
    "link": "https://www.bostonherald.com/2025/11/15/battenfeld-massachusetts-needs-new-political-movement-to-save-it-from-democrats/",
    "timestamp": "2025-11-15T09:36:24Z"
  },
  {
    "title": "JD Vance: Peace Requires Trump Speaking Directly With Putin",
    "description": "WASHINGTON (Sputnik) - Dialogue between US President Donald Trump and Russian President Vladimir Putin is necessary to resolve the conflict in Ukraine, US Vice President JD Vance said.",
    "link": "https://sputnikglobe.com/20251115/jd-vance-peace-requires-trump-speaking-directly-with-putin-1123117810.html",
    "timestamp": "2025-11-15T09:35:16Z"
  },
  {
    "title": "US-China tech war: Nexperia saga exposes Europe's loosening grip on chip supply chain",
    "description": "The Nexperia factory in Dongguan, in the heart of southern China's Pearl River Delta, has long been a poster child for successful globalisation. Since its...",
    "link": "https://finance.yahoo.com/news/us-china-tech-war-nexperia-093000496.html",
    "timestamp": "2025-11-15T09:30:00Z"
  },
  {
    "title": "Indiana Senate Republicans Block Trump-Backed Redistricting Plan",
    "description": "Despite President Donald Trump‘s pleas, Indiana Senate Republicans will not move redistricting legislation forward after failing to obtain the required number of votes.\nSenate Leadership Cites Vote Shortage\nSenate President Pro Tem Rodric Bray (R-Martinsville…",
    "link": "https://biztoc.com/x/63753f075d3aef18",
    "timestamp": "2025-11-15T09:28:43Z"
  }
]