[
  {
    "title": "Nicolle Wallace Is Blatantly Lying About Democrats’ Assassination Prep",
    "description": "Wallace’s claim that no Democrat has ever suggested Trump is Hitler is demonstrably false.MSNBC’s Nicolle Wallace said Monday that she doesn’t think “any Democrat has” suggested that President Donald Trump is Hitler — but the record shows Democrats and their …",
    "link": "https://freerepublic.com/focus/f-news/4349415/posts",
    "timestamp": "2025-10-29T16:52:09Z"
  },
  {
    "title": "Sam Altman touts trillion-dollar AI vision as OpenAI restructures to chase scale",
    "description": "Altman envisions OpenAI becoming a massive AI infrastructure powerhouse, pursuing trillions in funding, huge compute expansion, and an eventual IPO. Despite bold plans, unclear financing, internal strife, and criticism raise doubts as OpenAI shifts from resea…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/sam-altman-touts-trillion-dollar-ai-vision-as-openai-restructures-to-chase-scale/articleshow/124910944.cms",
    "timestamp": "2025-10-29T16:51:58Z"
  },
  {
    "title": "Exclusive! Palash Muchhal and Smriti Mandhana to tie the knot in November",
    "description": "Music composer Palash Muchhal and cricketer Smriti Mandhana are set to marry this November, with celebrations beginning on the 20th in Smriti's hometown, Sangli, Maharashtra. The couple, reportedly together since 2019, made their relationship official on Inst…",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/palash-muchhal-and-smriti-mandhana-set-to-marry-in-november-2024/articleshow/124877599.cms",
    "timestamp": "2025-10-29T16:51:09Z"
  },
  {
    "title": "AI chip giant Nvidia becomes world’s first $6.5 trillion company",
    "description": "The milestone underscores Nvidia's transformation from niche graphics chip designer. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/nvidia-becomes-first-5-trillion-firm-as-ai-rally-picks-up-steam",
    "timestamp": "2025-10-29T16:50:11Z"
  },
  {
    "title": "Israeli strikes in Gaza kill at least 100, local health officials say",
    "description": "Israeli forces conducted deadly strikes in Gaza, reportedly killing over 100 people. This followed accusations against Hamas for violating a ceasefire. The military stated dozens of Hamas commanders were eliminated. The ceasefire has since resumed. Hospitals …",
    "link": "https://economictimes.indiatimes.com/news/defence/israeli-strikes-in-gaza-kill-at-least-100-local-health-officials-say/articleshow/124910881.cms",
    "timestamp": "2025-10-29T16:49:57Z"
  },
  {
    "title": "Canada isn’t doing its part to stop AI government surveillance, UofT director says",
    "description": "Ronald Deibert says the ability of governments and criminal actors to surveil and target people is growing in scope thanks to AI. Read more.",
    "link": "https://financialpost.com/technology/canada-ai-government-surveillance-uoft-director",
    "timestamp": "2025-10-29T16:49:00Z"
  },
  {
    "title": "Here's How Much Donald Trump Is Earning from Crypto During Presidency",
    "description": "The Trump Organization earned $802 million from crypto during the first half of 2025, according to a Reuters estimate.",
    "link": "https://biztoc.com/x/d0b00b26fd9172b6",
    "timestamp": "2025-10-29T16:48:20Z"
  },
  {
    "title": "Trump on Third Term: 'I Guess I'm Not Allowed to Run'",
    "description": "US President Donald Trump conceded Wednesday that it was “pretty clear” the Constitution didn’t allow him to seek a third term as president, despite frequently floating the idea in recent months.\n“If you read it, it’s pretty clear, I’m not allowed to run,” Tr…",
    "link": "https://biztoc.com/x/6e46896190764c92",
    "timestamp": "2025-10-29T16:48:05Z"
  },
  {
    "title": "Trump-Xi meeting: Fate of global economy hangs in the balance",
    "description": "The fate of the global economy hangs in the balance as President Trump and China's Xi Jinping prepare to meet in South Korea.",
    "link": "https://abcnews.go.com/Politics/trump-xi-meeting-fate-global-economy-hangs-balance/story?id=126978226",
    "timestamp": "2025-10-29T16:47:54Z"
  },
  {
    "title": "CNN’s Scott Jennings Chalks Trump Third Term Talk Up to a ‘Fair Amount of Trolling’",
    "description": "CNN political commentator Scott Jennings chalked the talk about a third term for President Donald Trump up to \"trolling\" on Tuesday evening.\nThe post CNN’s Scott Jennings Chalks Trump Third Term Talk Up to a ‘Fair Amount of Trolling’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/tv/cnns-scott-jennings-chalks-trump-third-term-talk-up-to-a-fair-amount-of-trolling/",
    "timestamp": "2025-10-29T16:47:41Z"
  },
  {
    "title": "Trump Attorney Accidentally Admits He’s In the Role Illegally",
    "description": "It seems that acting U.S. Attorney Bilal “Bill” Essayli couldn’t care less whether he was illegally appointed by President Donald Trump—or maybe he just didn’t read a judge’s order closely enough.   U.S. District Judge J. Michael Seabright ruled Tuesday night…",
    "link": "https://newrepublic.com/post/202426/donald-trump-attorney-los-angeles-admits-role-illegally",
    "timestamp": "2025-10-29T16:44:50Z"
  },
  {
    "title": "Giving Nvidia's Blackwell chip to China would slash US's AI advantage, experts say",
    "description": "By Karen Freifeld (Reuters) -If the Trump administration allows Nvidia to sell a version of its best AI chip to China, as the President opened the door to on...",
    "link": "https://finance.yahoo.com/news/giving-nvidias-blackwell-chip-china-164336175.html",
    "timestamp": "2025-10-29T16:43:36Z"
  },
  {
    "title": "Senate votes to block tariffs on Brazil. It shows some pushback to Trump trade policy",
    "description": "The legislation would terminate the national emergencies that Trump has declared to justify the tariffs. Kaine is planning similar resolutions applying to Trump's tariffs on Canada and other nations.",
    "link": "https://www.pbs.org/newshour/politics/senate-votes-to-block-tariffs-on-brazil-it-shows-some-pushback-to-trump-trade-policy",
    "timestamp": "2025-10-29T16:43:31Z"
  },
  {
    "title": "Nigeria’s Nobel laureate Wole Soyinka says US visa was revoked after Trump criticism",
    "description": "He said he was told to reapply if he wished to enter again.",
    "link": "https://www.bostonherald.com/2025/10/29/nigeria-nobel-laureate-wole-soyinka-visa/",
    "timestamp": "2025-10-29T16:43:14Z"
  },
  {
    "title": "Giving Nvidia's Blackwell chip to China would slash US's AI advantage, experts say",
    "description": "Allowing Nvidia’s downgraded B30A AI chips into China would erode US AI dominance, effectively end export controls, and let China offset limits by buying more chips. Analyses warn US advantages could shrink dramatically or even flip to China by 2026.",
    "link": "https://economictimes.indiatimes.com/tech/technology/giving-nvidias-blackwell-chip-to-china-would-slash-uss-ai-advantage-experts-say/articleshow/124910656.cms",
    "timestamp": "2025-10-29T16:42:34Z"
  },
  {
    "title": "[Eugene Volokh] \"How Unprecedented Are Trump's 'Emergency Tariffs'\"?",
    "description": "My Hoover colleague Philip Zelikow, who is involved in the tariff litigation, passed this blog post along to me, and...",
    "link": "https://reason.com/volokh/2025/10/29/how-unprecedented-are-trumps-emergency-tariffs/",
    "timestamp": "2025-10-29T16:41:19Z"
  },
  {
    "title": "A Nazi tattoo exposes Democrats' greatest weakness",
    "description": "In the midst of a heated campaign, Graham Platner, a Democratic Senate hopeful from Maine, finds himself under fire for a controversial Nazi tattoo and his historical online remarks. Notable figures like Chris Murphy and Bernie Sanders have attempted to mitig…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-nazi-tattoo-exposes-democrats-greatest-weakness/articleshow/124910593.cms",
    "timestamp": "2025-10-29T16:40:52Z"
  },
  {
    "title": "Are Elon Musk’s Politics Driving Away Tesla’s Customers?",
    "description": "Are Elon Musk’s Politics Driving Away Tesla’s Customers?Ben.Mattison\nWed, 10/29/2025 - 12:39\n\n Three Questions\n <li>\n Kenneth Gillingham\n\n\n Professor of Environmental & Energy Economics, Yale School of the Environment\n\r\n\n \r\n\n</li>\n <li>\n Matthew J. Kotchen\n\n\n…",
    "link": "https://insights.som.yale.edu/insights/are-elon-musks-politics-driving-away-teslas-customers",
    "timestamp": "2025-10-29T16:39:50Z"
  },
  {
    "title": "Trump Axes Entire Biden-Appointed Agency That Would Oversee His Ballroom Construction",
    "description": "The White House has fired all six members of the Commission of Fine Arts, and is set to replace them with loyalists.",
    "link": "https://www.huffpost.com/entry/trump-white-house-ballroom-arch-commission-fine-arts_n_69021a5be4b0f553c434d8e3",
    "timestamp": "2025-10-29T16:37:34Z"
  },
  {
    "title": "Senate votes to kill Trump’s Brazil tariff",
    "description": "What happened\nThe Senate voted 52-48 Tuesday to quash President Donald Trump’s punitive 50% tariff on Brazilian imports, terminating the national emergency he declared to trigger the import tax. Five Republicans joined every Democrat in supporting the measure…",
    "link": "https://biztoc.com/x/4dfeb630b826e5a4",
    "timestamp": "2025-10-29T16:37:03Z"
  },
  {
    "title": "Left-Wing Podcaster Laughs As She Heaps Praise On Sick ‘No Kings’ Protester Who Celebrated Charlie Kirk’s Death",
    "description": "Jennifer Welch demanded Democratic elected officials “jump on board” with sentiments expressed by a protestor that celebrated the assassination of Charlie Kirk.",
    "link": "https://dailycaller.com/2025/10/29/left-wing-podcaster-laughs-as-she-heaps-praise-on-sick-no-kings-protester-who-celebrated-charlie-kirks-death/",
    "timestamp": "2025-10-29T16:37:02Z"
  },
  {
    "title": "West a decade behind China on rare earths – Goldman Sachs",
    "description": "It could take Western producers up to ten years to develop rare earth processing and manufacturing capacity, Goldman Sachs has said Read Full Article at RT.com",
    "link": "https://www.rt.com/business/627116-west-behind-china-rare-earths/",
    "timestamp": "2025-10-29T16:34:51Z"
  },
  {
    "title": "MacKenzie Scott’s latest $60 million donation is a sign philanthropists are trying to fill the void from Trump’s cuts to FEMA",
    "description": "Philanthropy “cannot—and should not—replace government and its essential responsibilities,” CDP President and CEO Patricia McIlreacy told Fortune.",
    "link": "https://fortune.com/2025/10/29/mackenzie-scott-60-million-gift-disaster-relief-fema-trump-cuts/",
    "timestamp": "2025-10-29T16:34:37Z"
  },
  {
    "title": "Commerce Minister Goyal meets exporters to discuss growth prospects",
    "description": "Commerce and Industry Minister Piyush Goyal met exporters from various sectors on Wednesday to discuss ways to increase outbound shipments, especially in the light of the global economic turmoil triggered by tariffs imposed by the US",
    "link": "https://www.thehindubusinessline.com/economy/commerce-minister-goyal-meets-exporters-to-discuss-growth-prospects/article70218079.ece",
    "timestamp": "2025-10-29T16:34:22Z"
  },
  {
    "title": "Nvidia hits new milestone as world's first $5tn company",
    "description": "The US chip-maker has rapidly climbed from a niche graphics-chip manufacturer to an AI titan.",
    "link": "https://www.bbc.com/news/articles/cp8e970vn5vo",
    "timestamp": "2025-10-29T16:31:59Z"
  },
  {
    "title": "The U.S. keeps warning about China’s surveillence tech threat—while cashing in on it: ‘I think we’ve been naive or complicit in the extreme’",
    "description": "China is getting around export bans on the sale of powerful American AI chips by renting them through U.S. cloud services instead.",
    "link": "https://fortune.com/2025/10/29/china-buying-american-ai-chips-for-surveillence-billlions-security-drones-threat/",
    "timestamp": "2025-10-29T16:31:26Z"
  },
  {
    "title": "Israel Says Ceasefire With Hamas Back On Despite Major Gaza Airstrikes",
    "description": "'IDF will continue to uphold the ceasefire'",
    "link": "https://dailycaller.com/2025/10/29/israel-says-ceasefire-with-hamas-back-on-despite-major-gaza-airstrikes/",
    "timestamp": "2025-10-29T16:31:13Z"
  },
  {
    "title": "Jake Tapper Called Out Obama, Biden for Free Speech Abuses. He Says Trump Is on a New Level.",
    "description": "\"I have not seen ever before a direct infringement on the right to free speech like that,\" CNN's Jake Tapper says of the Trump administration's actions in the Jimmy Kimmel saga.",
    "link": "https://reason.com/2025/10/29/jake-tapper-called-out-obama-biden-for-free-speech-abuses-he-says-trump-is-on-a-new-level/",
    "timestamp": "2025-10-29T16:30:53Z"
  },
  {
    "title": "McConnell Among GOP Senators Joining Democrats in Vote to Scrap Trump Tariffs on Brazil",
    "description": "The Senate voted on Tuesday to advance a resolution to end President Donald Trump's tariffs on Brazilian imports, marking an unusual bipartisan challenge to the administration's trade policy. Five Republicans — including former Senate GOP leader Mitch McConne…",
    "link": "https://www.ibtimes.com/mcconnell-among-gop-senators-joining-democrats-vote-scrap-trump-tariffs-brazil-3788830",
    "timestamp": "2025-10-29T16:30:45Z"
  },
  {
    "title": "Trump Continues To Attack Biden For All The Stuff Trump Officials Did While Trump Was Still President",
    "description": "If there was anyone with any spine, honesty, or morality in the Trump administration, these astounding gaffes would have been headed off. But there’s no one left with any of these traits in the White House, so we get the sort of thing we’re now seeing with in…",
    "link": "https://www.techdirt.com/2025/10/29/trump-continues-to-attack-biden-for-all-the-stuff-trump-officials-did-while-trump-was-still-president/",
    "timestamp": "2025-10-29T16:28:49Z"
  },
  {
    "title": "South Korea says US will lower tariffs, agreement reached on trade",
    "description": "South Korea says tariffs on automobile exports will be lowered to 15% from 25%.",
    "link": "https://abcnews.go.com/Politics/south-korea-us-lower-tariffs-agreement-reached-trade/story?id=126981383",
    "timestamp": "2025-10-29T16:27:11Z"
  },
  {
    "title": "South Korea Gives Trump A Literal Crown Weeks After ‘No Kings’ Rallies",
    "description": "South Korea gifted President Donald Trump an enormous crown during his visit Wednesday just weeks after the \"No Kings\" protest in the U.S.",
    "link": "https://dailycaller.com/2025/10/29/south-korea-gifts-trump-a-literal-crown-after-no-kings-protest/",
    "timestamp": "2025-10-29T16:26:52Z"
  },
  {
    "title": "Joe Biden Was The Real ‘King,’ Not Trump",
    "description": "By Victor Davis Hanson, The Daily Signal | October 28, 2025\nHello, this is Victor Davis Hanson for The Daily Signal. We’ve been witnessing, supposedly, millions of people nationwide have hit the streets under the banner of “No Kings.”\nI guess that means that …",
    "link": "https://biztoc.com/x/759dda3574dac7af",
    "timestamp": "2025-10-29T16:25:52Z"
  },
  {
    "title": "Nvidia becomes world’s first $5tn company amid stock market and AI boom",
    "description": "Silicon Valley chipmaker hits $5tn valuation just three months after it was first to break through the $4tn barrier",
    "link": "https://www.aol.com/finance/nvidia-becomes-world-first-5tn-141342338.html",
    "timestamp": "2025-10-29T16:25:07Z"
  },
  {
    "title": "Nvidia becomes world's first $5 trillion company amid AI boom",
    "description": "Chipmaker's soaring valuation surpasses major global economies and tech giants, driven by AI dominance, strategic deals, and US-China trade developments.",
    "link": "https://www.israelnationalnews.com/news/417013",
    "timestamp": "2025-10-29T16:22:25Z"
  },
  {
    "title": "The White House ballroom saga could be worse for Trump than he realizes",
    "description": "President Donald Trump’s White House ballroom saga last week followed a familiar Trump-era arc: A bunch of the president’s critics sounded the alarm about...",
    "link": "https://www.cnn.com/2025/10/29/politics/white-house-ballroom-east-wing-trump",
    "timestamp": "2025-10-29T16:22:20Z"
  },
  {
    "title": "Did Wisconsin senators Ron Johnson and Tammy Baldwin vote to end the government shutdown on Oct. 28?",
    "description": "The government shutdown has entered day 29 after a funding bill failed to pass. Here's how Wisconsin senators Ron Johnson and Tammy Baldwin voted.",
    "link": "https://www.jsonline.com/story/news/politics/2025/10/29/how-have-wisconsin-senators-voted-on-ending-2025-government-shutdown/86962810007/",
    "timestamp": "2025-10-29T16:21:57Z"
  },
  {
    "title": "Ford urges U.S. ambassador to ‘bury the hatchet,’ apologize after profane tirade",
    "description": "Premier Doug Ford said the U.S. ambassador's expletive-laced tirade was “absolutely unacceptable” and “unbecoming of an ambassador.\"",
    "link": "https://www.cbc.ca/news/canada/toronto/doug-ford-us-ambassador-apology-ad-9.6958531",
    "timestamp": "2025-10-29T16:21:32Z"
  },
  {
    "title": "Senate votes to kill Trump’s Brazil tariff",
    "description": "Five Senate Republicans joined the Democrats in rebuking Trump’s import tax",
    "link": "https://theweek.com/politics/senate-vote-trump-brazil-tariffs",
    "timestamp": "2025-10-29T16:20:16Z"
  },
  {
    "title": "‘The View’ Hosts Scold Judd Apatow for Writing the Joke That Convinced Trump to Run for President: ‘We Can Blame You for This’",
    "description": "\"Thanks a lot!\" host Joy Behar jokes\nThe post ‘The View’ Hosts Scold Judd Apatow for Writing the Joke That Convinced Trump to Run for President: ‘We Can Blame You for This’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-view-hosts-scold-judd-apatow-obama-roast-joke-about-trump/",
    "timestamp": "2025-10-29T16:20:08Z"
  },
  {
    "title": "Trump Was Concerned About 1 Thing After Assassination Attempt, ABC Reporter Says",
    "description": "ABC News’ Jonathan Karl reconstructed Trump's attempted assassination in his new book, “Retribution: Donald Trump and the Campaign That Changed America.”",
    "link": "https://www.huffpost.com/entry/johnathan-karl-trump-assassination-attempt-hospital-concern_n_690226d1e4b0cb45b16f1387",
    "timestamp": "2025-10-29T16:19:30Z"
  },
  {
    "title": "Days after No Kings protests in America, Trump beams as he is gifted a golden crown in South Korea",
    "description": "President Trump received a golden crown and medal in South Korea amidst swirling rumors of a surprise meeting with Kim Jong-un. Trump announced a trade deal had been reached with South Korea, following a summit with China's Xi Jinping. The gifts were presente…",
    "link": "https://economictimes.indiatimes.com/news/international/us/days-after-no-kings-protests-in-america-trump-beams-as-he-is-gifted-a-golden-crown-in-south-korea/articleshow/124908289.cms",
    "timestamp": "2025-10-29T16:18:07Z"
  },
  {
    "title": "Smart vacuum caught spying? Engineer’s chilling discovery will creep you out",
    "description": "A tech enthusiast discovered his smart vacuum was secretly mapping his home and sending data to the manufacturer. When he attempted to block this data flow, the device stopped working. After multiple repair attempts failed, he found the company had remotely d…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/smart-vacuum-caught-spying-engineers-chilling-discovery-will-creep-you-out/articleshow/124908805.cms",
    "timestamp": "2025-10-29T16:17:09Z"
  },
  {
    "title": "Indian state refinery denies halting Russian oil imports",
    "description": "Indian Oil Corporation has said that it will continue sourcing crude from non-sanctioned suppliers Read Full Article at RT.com",
    "link": "https://www.rt.com/india/627113-ioc-deny-halting-russian-oil/",
    "timestamp": "2025-10-29T16:16:54Z"
  },
  {
    "title": "Venezuela braces for possible US strike amid military decay and internal dissent",
    "description": "Regime forces focus not on defence but on quashing dissent, analysts and opposition figures say",
    "link": "https://www.irishtimes.com/world/americas/2025/10/29/venezuela-braces-for-possible-us-strike-amid-military-decay-and-internal-dissent/",
    "timestamp": "2025-10-29T16:15:57Z"
  },
  {
    "title": "Why is Nvidia CEO Jensen Huang headed to South Korea ahead of Donald Trump-Xi Jinping meeting?",
    "description": "Nvidia CEO Jensen Huang is headed to South Korea amid the ASEAN Summit and US President Donald Trump's upcoming meeting with Chinese President Xi Jinping. Here's why…",
    "link": "https://www.livemint.com/companies/people/nvidia-ceo-jensen-huang-attend-apec-summit-south-korea-donald-trump-xi-jinping-meeting-ai-chips-us-china-trade-deal-news-11761750222655.html",
    "timestamp": "2025-10-29T16:15:56Z"
  },
  {
    "title": "Trump Tells SCOTUS That Ruling Restoring Perlmutter to Copyright Office is ‘Improper Judicial Interference’",
    "description": "The Trump Administration this week asked the Chief Justice of the U.S. Supreme Court to stay an interlocutory injunction issued by the U.S. Court of Appeals for the D.C. Circuit in September that allowed Register of Copyrights Shira Perlmutter to return to he…",
    "link": "https://ipwatchdog.com/2025/10/29/trump-scotus-ruling-perlmutter-copyright-office-improper/",
    "timestamp": "2025-10-29T16:15:10Z"
  },
  {
    "title": "SNAP benefits set for first-ever lapse with Senate set to reject funding patches (Politico)",
    "description": "Politico:\nSNAP benefits set for first-ever lapse with Senate set to reject funding patches … It only takes one senator to object to passing a bill by unanimous consent, as Democrats plan to do in the coming hours.  And short of President Donald Trump unilater…",
    "link": "https://www.memeorandum.com/251029/p71",
    "timestamp": "2025-10-29T16:15:00Z"
  },
  {
    "title": "White House says deal to put TikTok under US ownership could be finalized in South Korea",
    "description": "By BARBARA ORTUTAY, AP Technology Writer\nThe Trump administration has been signaling that it may have finally reached a deal with China to keep TikTok running in the U.S., with the two countries finalizing it as soon as Thursday.\nPresident Donald Trump is vis…",
    "link": "https://biztoc.com/x/45031be4b21d97bd",
    "timestamp": "2025-10-29T16:14:49Z"
  },
  {
    "title": "Oil Rises After Three-Day Drop With Focus on Russia, Stockpiles",
    "description": "Oil increased, on track to snap a three-day losing streak, as investors assessed the impact of Western sanctions against leading Russian crude producers and a large drop in US inventories.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-rises-after-three-day-drop-with-focus-on-russia-stockpiles",
    "timestamp": "2025-10-29T16:14:45Z"
  },
  {
    "title": "Amnesty Says U.S. Strike That Killed Migrants In Yemeni Prison May Be A War Crime",
    "description": "The military's CENTCOM has yet to offer an explanation behind the April strike on a Houthi-run prison that killed more than 60 African detainees.",
    "link": "https://www.huffpost.com/entry/amnesty-us-strike-migrants-yemen-prison-war-crime_n_6902366ce4b0cb45b16f2147",
    "timestamp": "2025-10-29T16:14:36Z"
  },
  {
    "title": "New partnership 'shocks many on the right' — and is dire sign for MAGA: analyst",
    "description": "With Charlie Kirk gone, the battle for the future of the Make America Great Again movement is facing a schism as right-wing influencers who have targeted young conservatives seek to scoop up his mantle and make it their own.With that in mind, Salon political …",
    "link": "https://www.rawstory.com/bad-news-trump-maga/",
    "timestamp": "2025-10-29T16:14:17Z"
  },
  {
    "title": "ICE Buses 100 Illegal Aliens from Indiana to Texas for Deportation Processing",
    "description": "During the Biden-era border crisis, Texas Governor Greg Abbott ordered the busing of illegal aliens to sanctuary cities, including more than 35,000 who were bused to the Chicago area. Now, Immigration and Customs Enforcement officials ordered 100 arrested ill…",
    "link": "https://www.breitbart.com/border/2025/10/29/ice-buses-100-illegal-aliens-from-indiana-to-texas-for-deportation-processing/",
    "timestamp": "2025-10-29T16:11:24Z"
  },
  {
    "title": "Newlyweds Sanchita Banerjee and Ruhaan Sapru to have a delayed honeymoon",
    "description": "After 14 years of togetherness, Bhojpuri actress Sanchita Banerjee and actor Ruhaan Sapru tied the knot in an intimate ceremony at a resort in Raipur. The couple, who first met during a project, describe their wedding as a celebration of love, warmth, and hea…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/newlyweds-sanchita-banerjee-and-ruhaan-sapru-to-have-a-delayed-honeymoon/articleshow/124908791.cms",
    "timestamp": "2025-10-29T16:11:07Z"
  },
  {
    "title": "Aidan Hutchinson makes NFL history with record-breaking Detroit Lions contract, star defensive end gets massive $180M extension",
    "description": "Aidan Hutchinson has inked a massive four-year, $180 million extension with the Detroit Lions, securing the star defensive end through 2030. This landmark deal, featuring $141 million guaranteed, marks the highest for a non-quarterback in NFL history. Hutchin…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/aidan-hutchinson-makes-nfl-history-with-record-breaking-detroit-lions-contract-star-defensive-end-gets-massive-180m-extension/articleshow/124908738.cms",
    "timestamp": "2025-10-29T16:10:59Z"
  },
  {
    "title": "Donald Trump Is the First AI Slop President (Jake Lahut/Wired)",
    "description": "Jake Lahut / Wired:\nDonald Trump Is the First AI Slop President  —  How do AI videos end up on Donald Trump's social media accounts?  WIRED investigates.  —  President Donald Trump, a septuagenarian known for his general avoidance of keyboards and computers, …",
    "link": "https://www.memeorandum.com/251029/p70",
    "timestamp": "2025-10-29T16:10:01Z"
  },
  {
    "title": "Trump Plans to Meet Hungarian Premier Orban on Nov. 8",
    "description": "US President Donald Trump plans to meet Hungarian Prime Minister Viktor Orban on Nov. 8, according to a person familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-plans-to-meet-hungarian-premier-orban-on-nov-8",
    "timestamp": "2025-10-29T16:09:32Z"
  },
  {
    "title": "White House says deal to put TikTok under US ownership could be finalized in South Korea",
    "description": "The Trump administration has been signaling that it may have finally reached a deal with China to keep TikTok running in the U.S., with the two countries finalizing the details as soon as Thursday",
    "link": "https://abcnews.go.com/Technology/wireStory/white-house-deal-put-tiktok-us-ownership-finalized-126982924",
    "timestamp": "2025-10-29T16:06:47Z"
  },
  {
    "title": "Qatari PM blames Hamas for truce breach, calls for calm",
    "description": "Qatar’s Prime Minister says Hamas may relinquish Gaza control as Doha urges disarmament and mediators work to uphold a fragile truce amid renewed violence.",
    "link": "https://www.israelnationalnews.com/news/417011",
    "timestamp": "2025-10-29T16:06:37Z"
  },
  {
    "title": "Letters to Editor",
    "description": "Letters to Editor",
    "link": "https://www.thehindubusinessline.com/opinion/letters-to-editor/article70218246.ece",
    "timestamp": "2025-10-29T16:06:33Z"
  },
  {
    "title": "Letters to the Editor dated October 29, 2025",
    "description": "Letters to Editor",
    "link": "https://www.thehindubusinessline.com/opinion/letters/letters-to-editor/article70218246.ece",
    "timestamp": "2025-10-29T16:06:33Z"
  },
  {
    "title": "White House says deal to put TikTok under US ownership could be finalized in South Korea",
    "description": "The deal would mark the end of months of uncertainty about TikTok's fate.",
    "link": "https://www.bostonherald.com/2025/10/29/tiktok-ownership-deal/",
    "timestamp": "2025-10-29T16:06:20Z"
  },
  {
    "title": "White House says deal to put TikTok under US ownership could be finalized in South Korea",
    "description": "The deal would mark the end of months of uncertainty about TikTok's fate.",
    "link": "https://www.denverpost.com/2025/10/29/tiktok-ownership-deal/",
    "timestamp": "2025-10-29T16:06:20Z"
  },
  {
    "title": "Nvidia storms past $5trn mark",
    "description": "Chipmaker Nvidia has achieved a milestone in market capitalization as the AI rally picks up steam Read Full Article at RT.com",
    "link": "https://www.rt.com/business/627103-nvidia-apple-market-cap/",
    "timestamp": "2025-10-29T16:05:55Z"
  },
  {
    "title": "Without Online Trolls, There Would Be No Donald Trump (Marcy Wheeler/Talking Points Memo)",
    "description": "Marcy Wheeler / Talking Points Memo:\nWithout Online Trolls, There Would Be No Donald Trump  —  On July 8, something happened to Donald Trump that I've not seen happen in the entire decade he has dominated presidential politics.  As his base clamored for more …",
    "link": "https://www.memeorandum.com/251029/p69",
    "timestamp": "2025-10-29T16:05:01Z"
  },
  {
    "title": "Joy Behar Tells ‘The View’ It’s A “Tragedy” That Trump Has Access To Nuclear Codes: “He Cannot Pass A Cognitive Test”",
    "description": "\"That is what frightens me and keeps me up at night.\"",
    "link": "https://decider.com/2025/10/29/the-view-joy-behar-concern-trump-cognitive-abilities/",
    "timestamp": "2025-10-29T16:04:20Z"
  },
  {
    "title": "Trump 'losing' trade war with China going in to Xi meeting, Senate Democrats say in report",
    "description": "President Donald Trump is \"losing a self-inflicted trade war\" with China, leaving the United States with a \"weak hand\" going into his meeting with Chinese President Xi Jinping, Senate Democrats said Wednesday in a new report on the effects of Trump's wide-ran…",
    "link": "https://biztoc.com/x/9ee3b0ada515d5f2",
    "timestamp": "2025-10-29T16:04:09Z"
  },
  {
    "title": "Nvidia becomes first public company worth $5 trillion",
    "description": "The biggest beneficiary of the ongoing AI boom, Nvidia has become the first public company to pass the $5 trillion market cap milestone.\nThe company’s shares rose more than 5.6% on Wednesday to as much as $212.19, on the back of news on Wednesday that U.S. Pr…",
    "link": "https://biztoc.com/x/746edcefcae2c85f",
    "timestamp": "2025-10-29T16:03:50Z"
  },
  {
    "title": "West Virginia Food Banks, DevBlogs, Gulf of Mexico, More: Wednesday ResearchBuzz, October 29, 2025",
    "description": "NEW RESOURCES WOWK: Two West Virginians create a food resource database to assist through SNAP pause. “Cecelia Thompson and Crystal Colyer have teamed up to make a comprehensive, publicly accessible list of […]",
    "link": "https://researchbuzz.me/2025/10/29/west-virginia-food-banks-devblogs-gulf-of-mexico-more-wednesday-researchbuzz-october-29-2025/",
    "timestamp": "2025-10-29T16:03:45Z"
  },
  {
    "title": "Former Microsoft Software Engineer Austin Nasso To Self-Release Debut Comedy Special ‘Impressionable Youth’ In November",
    "description": "EXCLUSIVE: Austin Nasso, a former Microsoft software engineer turned professional stand-up and impressionist, is set to release his debut comedy special, Impressionable Youth, on YouTube on November 6th. With more than two million followers across social medi…",
    "link": "http://deadline.com/2025/10/austin-nasso-special-impressionable-youth-youtube-premiere-date-1236601500/",
    "timestamp": "2025-10-29T16:03:33Z"
  },
  {
    "title": "Nigeria’s Nobel-winning author Wole Soyinka says his U.S. visa was revoked",
    "description": "On Tuesday, he mentioned that he was told to reapply if he wished to enter again. Soyinka, who became the first African to win the Nobel Prize in Literature in 1986, believes this issue is related to U.S. immigration policies rather than him personally.",
    "link": "https://www.pbs.org/newshour/world/nigerias-nobel-winning-author-wole-soyinka-says-his-u-s-visa-was-revoked",
    "timestamp": "2025-10-29T16:02:17Z"
  },
  {
    "title": "Mike Johnson Whines About Trump Being King Instead of Doing His Job",
    "description": "The speaker of the House is apparently in favor of totalitarian rule, so long as Donald Trump is in charge.The government has been shut down for more than 27 days now. But instead of working to bridge the partisan gulf and restore critical social services to …",
    "link": "https://newrepublic.com/post/202425/mike-johnson-donald-trump-king-shutdown",
    "timestamp": "2025-10-29T16:01:56Z"
  },
  {
    "title": "US stock market today surges as Nvidia hits historic $5 trillion milestone — Dow, S&P 500, and Nasdaq hit record highs ahead of Jerome Powell’s Fed rate cut signal and tech earnings storm",
    "description": "US stock market today surges before Fed rate cut. Stocks jumped to fresh highs Wednesday as tech gains powered Wall Street. Nvidia crossed a record $5 trillion valuation, fueling AI optimism. The S&P 500 rose 0.2%, the Nasdaq added 0.6%, and the Dow climbed 2…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-surges-as-nvidia-hits-historic-5-trillion-milestone-dow-sp-500-and-nasdaq-hit-record-highs-ahead-of-jerome-powells-fed-rate-cut-signal-and-tech-earnings-storm/articleshow/124906371.cms",
    "timestamp": "2025-10-29T16:01:49Z"
  },
  {
    "title": "ARREST JACK SMITH NOW! Latest Arctic Frost List Confirms Smith and Democrats Were Aiming to Wipe MAGA Off the Map and Ultimately to Jail All MAGA Leaders — FULL LIST INCLUDED",
    "description": "The Arctic Frost investigation was a codenamed FBI probe launched in April 2022 under the Biden administration. Originally, we were told it was an investigation into the legitimate alternative electors from the 2020 election. On Tuesday, we found out that the…",
    "link": "https://freerepublic.com/focus/f-bloggers/4349404/posts",
    "timestamp": "2025-10-29T16:01:03Z"
  },
  {
    "title": "Masked agents brutally break 67-year-old citizen's ribs in shocking footage...",
    "description": "The man's running club shared in a statement that he faced internal bleeding from the incident",
    "link": "https://www.themirror.com/news/us-news/shocking-footage-show-masked-ice-1473557",
    "timestamp": "2025-10-29T16:00:03Z"
  },
  {
    "title": "Alphabet set to report Q3 earnings after the bell Wednesday",
    "description": "Alphabet is set to report third-quarter earnings after the bell Wednesday.",
    "link": "https://www.cnbc.com/2025/10/29/alphabet-google-q3-earnings.html",
    "timestamp": "2025-10-29T16:00:01Z"
  },
  {
    "title": "‘They’re Not Screwing Around’: Gavin Newsom Shares Dire Warning On Trump",
    "description": "The California governor said he is “deeply concerned” about a plan being floated by the president and his allies.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-shares-dire-warning-on-trump_n_690225e5e4b0cb45b16f1142",
    "timestamp": "2025-10-29T15:59:42Z"
  },
  {
    "title": "Maryland Democrat Refuses To Go Along With Party’s Gerrymandering Push",
    "description": "Maryland Senate President Bill Ferguson blocked his fellow Democrats’ effort to redraw congressional maps, halting plans to target the state’s only Republican.",
    "link": "https://dailycaller.com/2025/10/29/maryland-democrat-refuses-to-go-along-with-partys-gerrymandering-push/",
    "timestamp": "2025-10-29T15:59:11Z"
  },
  {
    "title": "7 endangered turtle species of India and why they need protection",
    "description": "India's unique turtle species face extinction due to pollution, habitat loss, and illegal trade. From the Three-Keeled Land Turtle to the Northern River Terrapin, these ancient creatures are vital for ecosystem health. Urgent conservation efforts, including a…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/7-endangered-turtle-species-of-india-and-why-they-need-protection/articleshow/124906950.cms",
    "timestamp": "2025-10-29T15:58:59Z"
  },
  {
    "title": "Jimmy Kimmel Doubles Down on Offer to Host Televised Trump IQ Test: ‘Show Those Losers What a Winner You Are’ | Video",
    "description": "\"Think of the ratings! They will be huge. They'll be bigger than the night I came back after you tried to have me canceled,\" the ABC late night host promises the president\nThe post Jimmy Kimmel Doubles Down on Offer to Host Televised Trump IQ Test: ‘Show Thos…",
    "link": "https://www.thewrap.com/jimmy-kimmel-offers-trump-iq-test/",
    "timestamp": "2025-10-29T15:58:02Z"
  },
  {
    "title": "Trump 'losing' trade war with China going in to Xi meeting, Senate Democrats say in report",
    "description": "\"Trump needs to change course on his trade war with China now and stop hurting American families, farmers, and businesses,\" Sen. Elizabeth Warren said.",
    "link": "https://www.cnbc.com/2025/10/29/trump-trade-china-warren-democrats-inflation-xi.html",
    "timestamp": "2025-10-29T15:57:30Z"
  },
  {
    "title": "Top DOJ official threatens to punish states that don’t clean up voter rolls, follow law",
    "description": "Though many blue states protest, states are required to submit voter data to the DOJ under federal election laws to enable verification of voter eligibility, prevent non-citizens from voting illegally, and detect duplicate registrations or multiple votes acro…",
    "link": "https://freerepublic.com/focus/f-chat/4349403/posts",
    "timestamp": "2025-10-29T15:56:48Z"
  },
  {
    "title": "Mike Johnson Lies to Reporter’s Face About If He’s Seen Protest Video",
    "description": "House Speaker Mike Johnson is pretending that he’s never even heard about an ICE agent firing at a faith leader’s face—even though he was first asked about it two weeks ago. During a press conference Wednesday, Religion News Service’s Jack Jenkins asked Johns…",
    "link": "https://newrepublic.com/post/202424/mike-johnson-lies-seen-protest-video",
    "timestamp": "2025-10-29T15:56:44Z"
  },
  {
    "title": "Crypto Perps Are Easier to Access Than Ever Before—Is That A Good Thing?",
    "description": "MetaMask, Phantom, and Telegram mini-app Blum now offer perpetual futures trading natively within their crypto apps. What are the risks?",
    "link": "https://decrypt.co/346584/crypto-perps-easier-access-metamask-phantom-blum",
    "timestamp": "2025-10-29T15:55:20Z"
  },
  {
    "title": "Nvidia becomes first public company worth $5 trillion | TechCrunch",
    "description": "With a market cap of $5 trillion, Nvidia is now worth more than the aggregated stock markets of all countries, apart from the United States, China and Japan.",
    "link": "https://techcrunch.com/2025/10/29/nvidia-becomes-first-public-company-worth-5-trillion/",
    "timestamp": "2025-10-29T15:54:04Z"
  },
  {
    "title": "Bigg Boss Telugu 9 Preview: Bharani gets injured in the task",
    "description": "Bigg Boss Telugu 9 promos showcase intense competition as Bharani and Srija battle for survival, with Srija winning the first task. Bharani is medically evacuated after an accident, leaving housemates to enjoy lighthearted moments, including a humorous skit a…",
    "link": "https://timesofindia.indiatimes.com/tv/news/telugu/bigg-boss-telugu-9-preview-bharani-gets-injured-in-the-task/articleshow/124908732.cms",
    "timestamp": "2025-10-29T15:53:38Z"
  },
  {
    "title": "Trump Makes Stunning Claim He Can Send ‘The Navy’ to US Cities: ‘Do Whatever I Want!’",
    "description": "Trump made the stunning claim that he can send any military branch he wants — including \"The Navy\" — to U.S. cities as part of his crackdown.\nThe post Trump Makes Stunning Claim He Can Send ‘The Navy’ to US Cities: ‘Do Whatever I Want!’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/weird/trump-makes-stunning-claim-he-can-send-the-navy-to-us-cities-do-whatever-i-want/",
    "timestamp": "2025-10-29T15:53:17Z"
  },
  {
    "title": "'The Flood Are Evil Space Zombie Parasites and Are Not an Allegory to Any Group of People' — Original Halo Devs Hit Out at Homeland Security ICE Recruitment Ad",
    "description": "Key members of the original Halo development team have hit out at the Department of Homeland Security’s use of Microsoft's first-person shooter to promote ICE, with one saying: “it makes me sick.”",
    "link": "https://www.ign.com/articles/the-flood-are-evil-space-zombie-parasites-and-are-not-an-allegory-to-any-group-of-people-original-halo-devs-hit-out-at-homeland-security-ice-recruitment-ad",
    "timestamp": "2025-10-29T15:52:50Z"
  },
  {
    "title": "North Korea touts missile tests as Trump visits South Korea",
    "description": "GYEONGJU, South Korea (AP) — North Korea said Wednesday that it has conducted successful cruise missile tests, the latest display of its growing military capabilities and one that came a day before U.S. President Donald Trump visited South Korea. Trump has re…",
    "link": "https://biztoc.com/x/7a5474dfe7559f6e",
    "timestamp": "2025-10-29T15:52:49Z"
  },
  {
    "title": "Trump may finally get what he wants from Fed chair. But the economy is still wobbly",
    "description": "President Donald Trump is expected to receive a long-awaited gift from America’s central bank today: lower interest rates for the second consecutive month",
    "link": "https://biztoc.com/x/ee92837c68d7ecfe",
    "timestamp": "2025-10-29T15:52:34Z"
  },
  {
    "title": "There is a silver lining to the ‘jarring’ East Wing demolition. A history buff explains",
    "description": "Stewart McLaurin knew it was coming.An entire wing of the White House, a building he calls “the most special, important building on the planet,” was going to be replaced to make way for a ballroom that President Donald Trump wants to add to the building.But w…",
    "link": "https://newsroom.ap.org/detail/TheEastWingdemolitionwasjarringButaWhiteHousehistorybuffseesasilverlining/f3ca84b49843b3eb3c14ad6d48f117c3/text",
    "timestamp": "2025-10-29T15:52:31Z"
  },
  {
    "title": "Putin says Russia's nuclear-armed underwater drone was tested successfully",
    "description": "Russia has conducted a successful test of a new atomic-powered and nuclear-capable underwater drone, President Vladimir Putin said Wednesday, declaring that the new weapon can't be intercepted.",
    "link": "https://www.independent.ie/world-news/europe/putin-says-russias-nuclear-armed-underwater-drone-was-tested-successfully/a401497402.html",
    "timestamp": "2025-10-29T15:51:56Z"
  },
  {
    "title": "Bigg Boss Telugu 9 Preview: Bharani and Srija form teams and battle to stay in the house; Who wins?",
    "description": "Bigg Boss Telugu 9's latest promos showcase a fierce battle between Bharani and Srija for survival. After a controversial task where referees disagreed, Madhuri declared Srija the winner. However, a shocking turn of events saw Bharani leaving the house due to…",
    "link": "https://timesofindia.indiatimes.com/tv/news/telugu/bigg-boss-telugu-9-preview-bharani-and-srija-form-teams-and-battle-to-stay-in-the-house-who-wins/articleshow/124908584.cms",
    "timestamp": "2025-10-29T15:50:21Z"
  },
  {
    "title": "Dharavi redevpt project appoints SRA as special planning authority for salt pan land in Mulund, Kurla Dairy land in Mumbai",
    "description": "Mumbai: The Dharavi Redevelopment Project (DRP) and the Slum Rehabilitation Authority (SRA) have been appointed as the special planning authority for .",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/dharavi-redevpt-project-appoints-sra-as-special-planning-authority-for-salt-pan-land-in-mulund-kurla-dairy-land-in-mumbai/articleshow/124908530.cms",
    "timestamp": "2025-10-29T15:48:21Z"
  },
  {
    "title": "North Korea touts missile tests as Trump visits South Korea",
    "description": "GYEONGJU, South Korea (AP) — North Korea said Wednesday that it has conducted successful cruise missile tests, the latest display of its growing military capabilities and one that came a day before U.S. President Donald Trump visited South Korea. Trump has re…",
    "link": "https://www.pbs.org/newshour/world/north-korea-touts-missile-tests-as-trump-visits-south-korea",
    "timestamp": "2025-10-29T15:47:17Z"
  },
  {
    "title": "Consumers Expect Inflation To Get Worse, Even As Fed Cuts Rates",
    "description": "Persistently high inflation is still plaguing household budgets, and may not get better anytime soon.",
    "link": "https://www.investopedia.com/consumers-expect-inflation-to-get-worse-11838880",
    "timestamp": "2025-10-29T15:46:29Z"
  },
  {
    "title": "DOJ places on leave 2 prosecutors who said 'mob' of 'rioters' carried out Jan. 6 attack (ABC News)",
    "description": "ABC News:\nDOJ places on leave 2 prosecutors who said ‘mob’ of ‘rioters’ carried out Jan. 6 attack  —  The prosecutors had filed a brief in the case of Taylor Taranto, sources said.  —  Pro-Trump supporters storm the U.S. Capitol following a rally with Preside…",
    "link": "https://www.memeorandum.com/251029/p67",
    "timestamp": "2025-10-29T15:45:00Z"
  },
  {
    "title": "Gaza ceasefire teeters as Netanyahu orders strikes",
    "description": "Israel accused Hamas of firing on Israeli troops",
    "link": "https://theweek.com/world-news/israel-gaza-netanyahu-strikes-hamas",
    "timestamp": "2025-10-29T15:44:31Z"
  }
]