[
  {
    "title": "Michigan dismissal highlights the challenges in prosecuting cases against Trump's 2020 fake electors",
    "description": "The dismissal of fraud charges against 15 Michigan Republicans is the latest and most dramatic setback in the cases against the fake electors who were part of President Donald Trump's attempt to overturn the results of the 2020 election",
    "link": "https://abcnews.go.com/Politics/wireStory/michigan-dismissal-highlights-challenges-prosecuting-cases-trumps-2020-125425094",
    "timestamp": "2025-09-10T04:22:27Z"
  },
  {
    "title": "DeSantis' step toward victory on 'Alligator Alcatraz' sets up a funding dilemma for Florida",
    "description": "Florida Gov. Ron DeSantis is facing a dilemma over the immigration detention center built in the Florida Everglades",
    "link": "https://abcnews.go.com/US/wireStory/desantis-step-victory-alligator-alcatraz-sets-funding-dilemma-125425098",
    "timestamp": "2025-09-10T04:22:20Z"
  },
  {
    "title": "Israel's Qatar Strike Updates: Trump Criticises US Ally's Attack Citing Broader Conflict Risks",
    "description": "Israel's Qatar Strike Updates: Israel’s attack on Hamas in Qatar has drawn public criticism from U.S. President Donald Trump, highlighting the escalating risks of the war in Gaza. Trump, who expressed being “very unhappy about it,” stated he learned of the st…",
    "link": "https://www.ndtvprofit.com/world/israels-qatar-strike-updates-israel-attacks-hamas-in-qatar-escalates-broader-gaza-war-risks",
    "timestamp": "2025-09-10T04:22:12Z"
  },
  {
    "title": "Analysis-Eight days later, questions linger about Venezuela boat strike",
    "description": "WASHINGTON (Reuters) -More than a week after President Donald Trump announced that the U.S. military had blown up a boat off Venezuela, the operation - which killed 11 people - remains a largely mystery to many in Washington. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/10/analysis-eight-days-later-questions-linger-about-venezuela-boat-strike",
    "timestamp": "2025-09-10T04:18:00Z"
  },
  {
    "title": "Chris Hayes Says ‘Donald Trump Has Been Caught Dead to Rights’ by Latest Epstein Reveals | Video",
    "description": "The MSNBC host says Republicans are \"failing miserably\" to make people forget about Trump's ties to the billionaire sex offender\nThe post Chris Hayes Says ‘Donald Trump Has Been Caught Dead to Rights’ by Latest Epstein Reveals | Video appeared first on TheWra…",
    "link": "https://www.thewrap.com/chris-hayes-said-donald-trump-dead-to-rights-epstein/",
    "timestamp": "2025-09-10T04:17:22Z"
  },
  {
    "title": "From slavery to pollution, National Park employees flagged material deemed 'disparaging' to US",
    "description": "Does Florida’s Everglades National Park represent a slight to development in America",
    "link": "https://abcnews.go.com/US/wireStory/slavery-pollution-national-park-employees-flagged-material-deemed-125424552",
    "timestamp": "2025-09-10T04:14:29Z"
  },
  {
    "title": "Asian shares mostly rise, cheered by Wall Street rally to more records",
    "description": "Asian shares are mostly higher, echoing the record rally on Wall Street after the latest update on the job market bolstered hopes the U.S. Federal Reserve will cut interest rates",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-rise-cheered-wall-street-rally-records-125424195",
    "timestamp": "2025-09-10T04:14:16Z"
  },
  {
    "title": "‘That’s Your Guy’: Watters And Tarlov Clash Over ICE Deportations",
    "description": "Chaos erupted between Watters and Tarlov over the deportation of illegal migrants, including Tarlov's previous labeling of Abrego Garcia.",
    "link": "https://dailycaller.com/2025/09/10/jesse-watters-jessica-tarlov-clash-us-immigration-customs-enforcement-deportation/",
    "timestamp": "2025-09-10T04:09:57Z"
  },
  {
    "title": "What Jeffrey Epstein's bank knew",
    "description": "What Jeffrey Epstein's bank knew\nSix years after his death in prison, sex offender Jeffrey Epstein continues to dominate the news.\nA House committee has released a suggestive note sent to Epstein for his 50th birthday that is signed \"Donald J. Trump.\" The Whi…",
    "link": "https://biztoc.com/x/89e43a3b64e25fef",
    "timestamp": "2025-09-10T04:07:24Z"
  },
  {
    "title": "The Trump Administration's Half-Baked Plan To Disarm Transgender People Is Legally Bankrupt",
    "description": "When Justice Department officials anonymously floated the idea of prohibiting gun possession by transgender people last week, they may have hoped to score points with President Donald Trump's base or get a rise out of \"woke\" Democrats. Instead, they elicited …",
    "link": "https://biztoc.com/x/269b3c88d9caa2a9",
    "timestamp": "2025-09-10T04:07:12Z"
  },
  {
    "title": "Avanti Feeds, Apex Frozen, other shrimp stocks zoom up to 17% on European good news",
    "description": "The European Union has approved 102 additional Indian fishery units for exports to its member countries, expanding market access for domestic players. The government said the move is expected to significantly boost seafood shipments, particularly aquaculture …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/avanti-feeds-apex-frozen-other-shrimp-stocks-zoom-up-to-17-on-european-good-news/articleshow/123799340.cms",
    "timestamp": "2025-09-10T04:05:56Z"
  },
  {
    "title": "Is Trump Christian America’s Golden Calf?",
    "description": "( Tomdispatch.com ) - It was a moment somewhat like this, 30 years ago, that turned me into a biblical scholar. In the lead-up to the passage of the 1996 Welfare Reform Act, political and religious leaders quoted scripture to justify shutting down food progra…",
    "link": "https://www.juancole.com/2025/09/christian-americas-golden.html",
    "timestamp": "2025-09-10T04:04:30Z"
  },
  {
    "title": "My Theory Says Sanctions on Russia Won’t Work. So Why Do I Want Them Anyway?",
    "description": "The inventor of the sanctions paradox stress tests it 25 years on.",
    "link": "http://foreignpolicy.com/2025/09/10/sanctions-paradox-russia-united-states/",
    "timestamp": "2025-09-10T04:01:55Z"
  },
  {
    "title": "Polling shows Donald Trump’s ratings are poor – but they could be worse",
    "description": "Compared to other US presidents at the same point in their term, Trump’s ratings are only better than … his own.",
    "link": "https://theconversation.com/polling-shows-donald-trumps-ratings-are-poor-but-they-could-be-worse-263785",
    "timestamp": "2025-09-10T04:01:18Z"
  },
  {
    "title": "Trump DOJ Continues Resisting Epstein Disclosure",
    "description": "There are new reports suggesting that the Trump Justice Department (DOJ) is trying to keep information about Jeffrey Epstein secret. On Friday, the DOJ asked a federal judge to deny a media request for the names of two people who received hundreds of thousand…",
    "link": "https://www.lewrockwell.com/2025/09/no_author/trump-doj-continues-resisting-epstein-disclosure/",
    "timestamp": "2025-09-10T04:01:00Z"
  },
  {
    "title": "Could Trump End Up Triggering the Globalist ‘Great Reset’?",
    "description": "This article was originally published on Birch Gold Group The news feeds were buzzing last week over the recent meeting between Russia, China and India at the Chinese port city of Tianjin. Vladimir Putin, Xi Jinping and Narendra Modi made sure to present a un…",
    "link": "https://www.lewrockwell.com/2025/09/brandon-smith/could-trump-end-up-triggering-the-globalist-great-reset/",
    "timestamp": "2025-09-10T04:01:00Z"
  },
  {
    "title": "Cboe’s Next Big Leap: Bitcoin And Ethereum Continuous Futures Scheduled For Nov. 10",
    "description": "Cboe, one of the world’s leading derivatives exchanges, has announced plans to launch continuous futures for the leading cryptocurrencies, Bitcoin (BTC) and Ethereum (ETH), pending regulatory approval.  In response to growing investor interest in digital asse…",
    "link": "https://bitcoinist.com/cboe-bitcoin-and-ethereum-continuous-futures/",
    "timestamp": "2025-09-10T04:00:17Z"
  },
  {
    "title": "Activists Protest Trump At DC Restaurant, Call Him 'Hitler Of Our Time'",
    "description": "It's the second time this week when he's been openly jeered in a public place.",
    "link": "https://www.huffpost.com/entry/trump-activist-protests-dc-code-pink_n_68c0ec31e4b0f2df4e04dc76",
    "timestamp": "2025-09-10T04:00:08Z"
  },
  {
    "title": "Obamacare destroyed the health insurance market, Trump is rebuilding it",
    "description": "For years, the Democrats have maintained their goal to take away freedom of choice on health care, wanting government health care for all. The misnamed “Affordable Care Act” took away freedom of choice, forcing everyone to buy a Rolls Roy...",
    "link": "https://www.americanthinker.com/blog/2025/09/obamacare_destroyed_the_health_insurance_market_trump_is_rebuilding_it.html",
    "timestamp": "2025-09-10T04:00:00Z"
  },
  {
    "title": "House Republican Refuses To Look at Trump’s Reported Letter to Epstein: ‘I Don’t Wanna See It’",
    "description": "Rep. Eric Burlison refused to look at a birthday message that President Donald Trump allegedly sent to deceased sex trafficker Jeffrey Epstein in 2003.\nThe post House Republican Refuses To Look at Trump’s Reported Letter to Epstein: ‘I Don’t Wanna See It’ fir…",
    "link": "https://www.mediaite.com/media/tv/house-republican-refuses-to-look-at-trumps-reported-letter-to-epstein-i-dont-wanna-see-it/",
    "timestamp": "2025-09-10T03:58:28Z"
  },
  {
    "title": "Sensex jumps over 300 pts, Nifty50 tops 24,950 after Trump revives trade talks with India",
    "description": "Indian stocks began Wednesday on a positive note, as the Nifty extended its winning streak for the fifth consecutive day. Optimism surrounding potential goods and services tax reductions, coupled with the resumption of trade discussions between the United Sta…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-300-pts-nifty50-tops-24950-after-trump-revives-trade-talks-with-india/articleshow/123799024.cms",
    "timestamp": "2025-09-10T03:58:10Z"
  },
  {
    "title": "Trump Handed Legal Loss as Judge Blocks Him From Firing Lisa Cook",
    "description": "Trump is trying to fire Cook as he presses the Fed to lower interest rates.",
    "link": "https://www.newsweek.com/lisa-cook-court-blocks-trump-firing-2127367",
    "timestamp": "2025-09-10T03:57:23Z"
  },
  {
    "title": "France and Germany condemn Israeli airstrike in Doha: Unacceptable",
    "description": "France and Germany condemn Israel’s airstrike in Doha, calling it a violation of Qatar’s sovereignty and a threat to regional stability, despite its targeting of Hamas leadership.",
    "link": "https://www.israelnationalnews.com/news/414679",
    "timestamp": "2025-09-10T03:54:07Z"
  },
  {
    "title": "Court rules Lisa Cook can remain a Fed governor for now while fighting Trump’s attempt to fire her",
    "description": "Court rules Lisa Cook can remain a Fed governor for now while fighting Trump’s attempt to fire herlocal10.com",
    "link": "https://www.local10.com//business/2025/09/09/court-rules-lisa-cook-can-remain-a-fed-governor-for-now-while-fighting-trumps-attempt-to-fire-her/",
    "timestamp": "2025-09-10T03:47:24Z"
  },
  {
    "title": "Protesters disrupt Trump's rare outing to a D.C. restaurant",
    "description": "President Donald Trump’s rare outing to a local restaurant Tuesday night got off to a rocky start when he came face to face with protesters.",
    "link": "https://www.nbcnews.com/politics/donald-trump/protesters-disrupt-trump-dc-restaurant-joes-seafood-code-pink-rcna230245",
    "timestamp": "2025-09-10T03:46:32Z"
  },
  {
    "title": "EU chief to defend Trump trade deal in parliament",
    "description": "Entering year two of her second mandate, von der Leyen's \"State of the Union\" speech will aim to rally parliament behind her agenda.\nThe post EU chief to defend Trump trade deal in parliament appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/eu-chief-to-defend-trump-trade-deal-in-parliament/article",
    "timestamp": "2025-09-10T03:42:32Z"
  },
  {
    "title": "Trump Praises Missouri House for Passing 'Fairer and Improved' Congressional District Lines",
    "description": "President Donald Trump congratulated Missouri state legislators for passing a bill to adopt new district lines that, if signed into law, likely would net House Republicans an additional seat.\nThe post Trump Praises Missouri House for Passing ‘Fairer and Impro…",
    "link": "https://www.breitbart.com/politics/2025/09/09/trump-praises-missouri-house-for-passing-fairer-and-improved-congressional-district-lines/",
    "timestamp": "2025-09-10T03:40:30Z"
  },
  {
    "title": "Seth Meyers Turns This Trump Donation Into Absolutely 'Valuable' Punchline",
    "description": "Seth Meyers Turns This Trump Donation Into Absolutely 'Valuable' Punchlinehuffpost.com",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-donate-bible-museum_n_68c0daebe4b059d8ed365df8",
    "timestamp": "2025-09-10T03:38:50Z"
  },
  {
    "title": "Plane leaves South Korea for US to bring back workers detained in immigration raid, report says",
    "description": "South Korean media reports a charter plane has left for the U.S. to bring back Korean workers detained in an immigration raid in Georgia.",
    "link": "https://www.news4jax.com/news/world/2025/09/10/plane-leaves-south-korea-for-us-to-bring-back-workers-detained-in-immigration-raid-report-says/",
    "timestamp": "2025-09-10T03:37:26Z"
  },
  {
    "title": "Lisa Cook Can't Be Fired - For Now: Judge",
    "description": "Lisa Cook Can't Be Fired - For Now: Judge\n \nFederal Reserve Governor Lisa Cook has been granted a reprieve after her sorority-sister judge, Jia Cobb, temporarily blocked President Donald Trump from firing her - allowing Cook to remain on the job amid allegati…",
    "link": "https://biztoc.com/x/edfcca996c14ad32",
    "timestamp": "2025-09-10T03:34:09Z"
  },
  {
    "title": "Poland shoots down drones in its airspace during Russian attack on Ukraine",
    "description": "Poland said it scrambled its own and NATO air defenses to shoot down drones on Wednesday after a Russian air attack on western Ukraine, the first time in the Ukraine war that Warsaw has engaged assets in its airspace. Poland's military command said Polish air…",
    "link": "https://japantoday.com/category/world/poland-shoots-down-drones-in-its-airspace-during-russian-attack-on-ukraine",
    "timestamp": "2025-09-10T03:33:19Z"
  },
  {
    "title": "Poland Shoots Down Drones In Its Airspace During Russian Attack On Ukraine",
    "description": "Poland's military command said Polish airspace was repeatedly violated by \"drone-type objects\" during the Russian attack across the border in Ukraine.",
    "link": "https://www.huffpost.com/entry/poland-russia-drone-attack_n_68c0f0a1e4b057cde437fcc5",
    "timestamp": "2025-09-10T03:33:11Z"
  },
  {
    "title": "Hamas’s leadership abroad ‘was blocking compromise’",
    "description": "Former Mossad official says Israeli strikes on Hamas leaders in Doha are aimed at breaking the deadlock in hostage negotiations and sending a powerful signal to Qatar.",
    "link": "https://www.israelnationalnews.com/news/414681",
    "timestamp": "2025-09-10T03:30:00Z"
  },
  {
    "title": "Greg Daniels Speculates About How Hank Hill Would Feel About Donald Trump",
    "description": "By\n Carly Tennes\n Published: September 09th, 2025",
    "link": "https://www.cracked.com/article_48245_greg-daniels-speculates-about-how-hank-hill-would-feel-about-donald-trump.html",
    "timestamp": "2025-09-10T03:30:00Z"
  },
  {
    "title": "US Raid Disrupts Construction at Multiple Korean Battery Plants",
    "description": "The immigration raid at an LG Energy Solution Ltd.-owned battery plant in Georgia has disrupted construction at multiple sites across the US, clouding the outlook for billions of dollars of investment by South Korean conglomerates.",
    "link": "https://financialpost.com/pmn/business-pmn/us-raid-disrupts-construction-at-multiple-korean-battery-plants",
    "timestamp": "2025-09-10T03:28:09Z"
  },
  {
    "title": "Trump’s Push To Remove Fed Gov Lisa Cook Hits Legal Roadblock",
    "description": "A federal judge has blocked President Donald Trump’s attempt to remove Federal Reserve Governor Lisa Cook, a Biden appointee. Judge Jia Cobb, appointed by former President Biden, ruled that Cook’s firing likely violated the Federal Reserve Act and her Fifth A…",
    "link": "https://biztoc.com/x/8a768e5103a2b06b",
    "timestamp": "2025-09-10T03:22:57Z"
  },
  {
    "title": "Judge temporarily blocks Trump from firing Fed Governor Cook",
    "description": "Judge temporarily blocks Trump from firing Fed Governor Cook\nA federal judge has temporarily blocked President Donald Trump from sacking Federal Reserve Governor Lisa Cook, who is part of the board responsible for setting US interest rates.\nIt marks an early …",
    "link": "https://biztoc.com/x/5c99c2a4afacbf94",
    "timestamp": "2025-09-10T03:22:48Z"
  },
  {
    "title": "Hillary Clinton Says Trump Administration Is 'Going Great' For The President, Shares Accusations Of Crypto Corruption",
    "description": "Former Secretary of State Hillary Clinton took a dig at President Donald Trump on Tuesday for using his office for personal gain.\nClinton Attacks Trump Administration\nClinton quoted an X post from Rep. Greg Casar (D-Texas), who accused Trump and his family of…",
    "link": "https://biztoc.com/x/2dca8fc89730b273",
    "timestamp": "2025-09-10T03:22:45Z"
  },
  {
    "title": "President Trump Celebrates DC Crime Fighting Success by Going Out for Dinner; Stares Down Hamas Supporting Code Pink Protesters Who Heckled Him Inside Restaurant in Security Breach",
    "description": "President Donald Trump went out for dinner Tuesday night in Washington, D.C.\nThe post President Trump Celebrates DC Crime Fighting Success by Going Out for Dinner; Stares Down Hamas Supporting Code Pink Protesters Who Heckled Him Inside Restaurant in Security…",
    "link": "https://www.thegatewaypundit.com/2025/09/president-trump-celebrates-dc-crime-fighting-success-going/",
    "timestamp": "2025-09-10T03:20:58Z"
  },
  {
    "title": "Asian shares mostly rise, cheered by Wall Street rally to more records",
    "description": "Asian shares mostly rose in early Wednesday trading, echoing record rallies on Wall Street after the latest update  on the job market bolstered hopes the U.S...",
    "link": "https://finance.yahoo.com/news/asian-shares-mostly-rise-cheered-031943918.html",
    "timestamp": "2025-09-10T03:19:43Z"
  },
  {
    "title": "Newsom says Trump has ‘relentless, unhinged’ obsession with California during State of the State address",
    "description": "California Gov. Gavin Newsom on Tuesday argued that President Donald Trump and his administration have a \"relentless, unhinged California obsession.\"",
    "link": "https://www.foxnews.com/politics/newsom-says-trump-has-relentless-unhinged-obsession-california-during-state-state-address",
    "timestamp": "2025-09-10T03:19:29Z"
  },
  {
    "title": "Federal judge temporarily blocks Trump's attempt to fire Lisa Cook",
    "description": "Federal judge blocks Trump's attempt to fire Federal Reserve Governor Lisa Cook.",
    "link": "https://abcnews.go.com/Politics/federal-judge-temporarily-blocks-trumps-attempt-fire-federal/story?id=125423530",
    "timestamp": "2025-09-10T03:19:14Z"
  },
  {
    "title": "Court rules Lisa Cook can remain a Fed governor for now while fighting Trump’s attempt to fire her",
    "description": "WASHINGTON — A federal court ruled Tuesday that embattled Federal Reserve Governor Lisa Cook can remain in her position while she fights President Donald Trump’s efforts to fire her.\nThe ruling, which will almost certainly be appealed, is a blow to the Trump …",
    "link": "https://biztoc.com/x/bf1ade56a6feb89c",
    "timestamp": "2025-09-10T03:11:40Z"
  },
  {
    "title": "Judge temporarily blocks Trump from firing Fed Governor Cook",
    "description": "It's a setback for the White House in an unprecedented legal battle over the central bank's independence.",
    "link": "https://www.bbc.com/news/articles/c740x28v8xno",
    "timestamp": "2025-09-10T03:11:22Z"
  },
  {
    "title": "Asian markets rally as new US jobs data fans rate cut hopes",
    "description": "Asian markets extended gains on Wednesday following a record day across Wall Street as fresh data pointing to a weakening US jobs market ramped up expectations for a series of Federal Reserve rate cuts. Eyes are now on the release of consumer price index (CPI…",
    "link": "https://www.digitaljournal.com/world/asian-markets-rally-as-new-us-jobs-data-fans-rate-cut-hopes/article",
    "timestamp": "2025-09-10T03:07:32Z"
  },
  {
    "title": "RFK Jr.’s latest ‘Make America Healthy Again’ report calls for more scrutiny of vaccines, autism",
    "description": "RFK Jr.’s latest ‘Make America Healthy Again’ report calls for more scrutiny of vaccines, autismalaskasnewssource.com",
    "link": "https://www.alaskasnewssource.com/2025/09/10/rfk-jrs-latest-make-america-healthy-again-report-calls-more-scrutiny-vaccines-autism/",
    "timestamp": "2025-09-10T03:06:35Z"
  },
  {
    "title": "Britain 'out of whack' on free speech, warns Nick Clegg",
    "description": "Speaking to Sky's Wilfred Frost on his The Master Investor Podcast, Nick Clegg said the UK needed to \"think long and hard\" about \"whether we've overdone it\" with freedom of speech laws.",
    "link": "https://news.sky.com/story/britain-out-of-whack-on-free-speech-warns-nick-clegg-13427927",
    "timestamp": "2025-09-10T03:06:00Z"
  },
  {
    "title": "Asian markets rally as new US jobs data fans rate cut hopes",
    "description": "Asian markets extended gains on Wednesday following a record day across Wall Street as fresh data pointing to a weakening US jobs market ramped up...",
    "link": "https://finance.yahoo.com/news/asian-markets-rally-us-jobs-030443325.html",
    "timestamp": "2025-09-10T03:04:43Z"
  },
  {
    "title": "You Really Need to See Epstein’s Birthday Book for Yourself",
    "description": "You Really Need to See Epstein’s Birthday Book for Yourselftheatlantic.com",
    "link": "https://www.theatlantic.com/technology/archive/2025/09/jeffrey-epstein-birthday-book-conspiracy-theories/684157/",
    "timestamp": "2025-09-10T03:04:06Z"
  },
  {
    "title": "Judge pauses California's request to bar Trump administration's ongoing use of National Guard troops",
    "description": "A federal judge who ruled last week that the Trump administration broke federal law by sending National Guard troops to the Los Angeles area said Tuesday he ...",
    "link": "https://www.yahoo.com/news/articles/judge-pauses-californias-request-bar-030237023.html",
    "timestamp": "2025-09-10T03:02:37Z"
  },
  {
    "title": "Court rules Lisa Cook can remain a Fed governor for now while fighting Trump’s attempt to fire her",
    "description": "A federal court has ruled that embattled Federal Reserve Governor Lisa Cook can remain in her position while she fights President Donald Trump’s efforts to fire her.",
    "link": "https://www.news4jax.com/business/2025/09/10/court-rules-lisa-cook-can-remain-a-fed-governor-for-now-while-fighting-trumps-attempt-to-fire-her/",
    "timestamp": "2025-09-10T03:02:18Z"
  },
  {
    "title": "Poland says it shot down Russian drones in its airspace for the first time in Ukraine war",
    "description": "Poland’s military said it scrambled its own and NATO allied air defenses to shoot down Russian drones on Wednesday after they crossed from neighboring Ukraine, the first time in the Ukraine war that Warsaw has engaged Russian assets in its airspace.",
    "link": "https://www.nbcnews.com/world/europe/poland-engages-russian-drones-airspace-first-time-rcna230251",
    "timestamp": "2025-09-10T03:01:31Z"
  },
  {
    "title": "Asia stocks gain, bonds fall as traders consider odds of bigger Fed cut",
    "description": "TOKYO : Asian stocks tracked Wall Street higher on Wednesday and bonds fell as traders firmed up bets that U.S. labour market softness would spur the Federal Reserve to cut rates by at least a quarter point next week.Gold caught its breath after Tuesday's rec…",
    "link": "https://www.channelnewsasia.com/business/asia-stocks-gain-bonds-fall-traders-consider-odds-bigger-fed-cut-5341381",
    "timestamp": "2025-09-10T02:59:47Z"
  },
  {
    "title": "Trump calls on EU to pressure Putin with 100% tariffs on China and India",
    "description": "The US president made the demand during a meeting between US and EU officials on Tuesday, according to a source familiar with the talks.",
    "link": "https://www.bbc.com/news/articles/c80gvz3l7n2o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-10T02:58:47Z"
  },
  {
    "title": "Benchmark indices to open higher amid US trade talk hopes, rate cut bets",
    "description": "Nifty 50 has gained about 1.2% in the last five sessions, and is trading about 5.4% below the record high hit on September 27, 2024",
    "link": "https://www.thehindubusinessline.com/markets/benchmark-indices-to-open-higher-amid-us-trade-talk-hopes-rate-cut-bets/article70032364.ece",
    "timestamp": "2025-09-10T02:57:48Z"
  },
  {
    "title": "Trump is upsetting the US allies needed to counter China",
    "description": "President Trump's trade and immigration policies are straining key alliances meant to counter China, as seen in the detention of South Korean workers in Georgia. These actions, along with tariff disputes with India and strained relations with South Korea, are…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-is-upsetting-the-us-allies-needed-to-counter-china/articleshow/123798456.cms",
    "timestamp": "2025-09-10T02:57:37Z"
  },
  {
    "title": "Business chiefs urge Trump to ease up on immigration crackdown after Hyundai raid",
    "description": "The president's pledge to restore jobs to American workers is running into conflict with other economic goals.",
    "link": "https://www.bbc.com/news/articles/c74955zk35yo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-10T02:55:19Z"
  },
  {
    "title": "Poland first NATO member to fire during Ukraine war",
    "description": "Poland shot down suspected Russian drones in its airspace with the backing of military aircraft from its NATO allies, the first time a member of the Western military alliance is known to have fired shots during Russia's war in Ukraine.",
    "link": "https://www.rte.ie/news/world/2025/0910/1532700-poland-nato-russia/",
    "timestamp": "2025-09-10T02:55:17Z"
  },
  {
    "title": "Poland warns of 'open conflict' risk after drone intrusio",
    "description": "Polish Prime Minister Donald Tusk told parliament it was \"the closest we have been to open conflict since World War Two\", though he also said he had \"no reason to believe we're on the brink of war\".",
    "link": "https://www.rte.ie/news/world/2025/0910/1532700-poland-nato-russia-ukraine/",
    "timestamp": "2025-09-10T02:55:17Z"
  },
  {
    "title": "Watch US Coast Guard Blow Up A ‘Drug Boat’ At Sea",
    "description": "The Department of Homeland Security (DHS) released a video Tuesday on X showing the U.S. Coast Guard capturing a \"drug boat\" before burning and sinking it.",
    "link": "https://dailycaller.com/2025/09/09/watch-us-coast-guard-blow-up-a-drug-boat-at-sea/",
    "timestamp": "2025-09-10T02:55:11Z"
  },
  {
    "title": "Missouri Republicans advance Trump-backed plan to redraw US House districts",
    "description": "Missouri's Republican-led House has passed a plan to redraw the state's congressional districts at the urging of President Donald Trump",
    "link": "https://abcnews.go.com/Politics/wireStory/missouri-republicans-advance-trump-backed-plan-redraw-us-125407277",
    "timestamp": "2025-09-10T02:54:17Z"
  },
  {
    "title": "Missouri Republicans advance Trump-backed plan to redraw US House districts",
    "description": "Missouri's Republican-led House has passed a plan to redraw the state's congressional districts at the urging of President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/missouri-republicans-advance-trump-backed-plan-redraw-us-125407276",
    "timestamp": "2025-09-10T02:54:16Z"
  },
  {
    "title": "MD Gov. Moore: Trump's 'Theatrical' National Guard Deployments 'Beneath the Office that He Holds'",
    "description": "Tuesday on CNN's \"OutFront,\" Gov. Wes Moore (D-MD) claimed President Donald Trump sending the National Guard into cities was \"theatrical,\" and thus \"beneath the office that he holds.\"\nThe post MD Gov. Moore: Trump’s ‘Theatrical’ National Guard Deployments ‘Be…",
    "link": "https://www.breitbart.com/clips/2025/09/09/md-gov-moore-trumps-theatrical-national-guard-deployments-beneath-the-office-that-he-holds/",
    "timestamp": "2025-09-10T02:50:20Z"
  },
  {
    "title": "Protesters Storm Restaurant as Trump Tries To Dine: ‘Free D.C.!’",
    "description": "President Donald Trump and some members of his cabinet went to Joe's Seafood near the White House on Tuesday night, only to be interrupted by protesters.\nThe post Protesters Storm Restaurant as Trump Tries To Dine: ‘Free D.C.!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/protesters-storm-d-c-restaurant-as-trump-tries-to-dine-free-d-c/",
    "timestamp": "2025-09-10T02:50:10Z"
  },
  {
    "title": "Protesters Storm D.C. Restaurant as Trump Tries To Dine: ‘Free D.C.!’",
    "description": "President Donald Trump and some members of his cabinet went to Joe's Seafood near the White House on Tuesday night, only to be interrupted by protesters.\nThe post Protesters Storm D.C. Restaurant as Trump Tries To Dine: ‘Free D.C.!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/protesters-storm-d-c-restaurant-as-trump-tries-to-dine-free-d-c/",
    "timestamp": "2025-09-10T02:50:10Z"
  },
  {
    "title": "Swalwell: Trump, GOP Attempting to 'Normalize Violence'",
    "description": "Tuesday on MSNBC's \"The Weeknight,\" Rep. Eric Swalwell (D-CA) said President Donald Trump and Republican lawmakers are attempting to \"normalize violence\" with the newly formed subcommittee to reinvestigate events surrounding the riot at the Capitol on Jan. 6,…",
    "link": "https://www.breitbart.com/clips/2025/09/09/swalwell-trump-gop-attempting-to-normalize-violence/",
    "timestamp": "2025-09-10T02:48:52Z"
  },
  {
    "title": "Plane to pick up South Korean nationals detained in raid at Hyundai plant on its way to Atlanta",
    "description": "A total of 475 workers, more than 300 of them South Koreans, were rounded up in the Sept. 4 raid at the battery factory.",
    "link": "https://www.wsbtv.com/news/local/atlanta/plane-pick-up-south-korean-nationals-detained-raid-hyundai-plant-its-way-atlanta/GXVH4WK6IFD3NIGSWTTKWXIXAE/",
    "timestamp": "2025-09-10T02:45:43Z"
  },
  {
    "title": "Court rules that Lisa Cook can keep job as Fed governor while fighting Trump’s firing efforts",
    "description": "A federal court ruled Tuesday that embattled Federal Reserve Governor Lisa Cook can remain in her position while she fights President Donald Trump’s efforts to fire her.",
    "link": "https://nypost.com/2025/09/09/us-news/court-rules-that-lisa-cook-can-keep-job-as-fed-governor-while-fighting-trumps-firing-efforts/",
    "timestamp": "2025-09-10T02:45:20Z"
  },
  {
    "title": "Trump Urges EU To Impose 100% Tariffs On China, India To Pressure Putin: Report",
    "description": "US President Donald Trump has called on EU officials to impose tariffs of up to 100% on China and India to pressure Russian President Vladimir Putin, according to a Reuters report. Trump reportedly made this request during a conference call with EU sanctions …",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-urges-eu-to-impose-100-tariffs-on-china-india-to-pressure-putin-report",
    "timestamp": "2025-09-10T02:45:01Z"
  },
  {
    "title": "Rosie O'Donnell Had \"Painful\" Friendship Fallout With Ellen DeGeneres",
    "description": "Rosie O’Donnell is reflecting on difficult moments from her friendship with Ellen DeGeneres.\nThe A League of Their Own actress recalled a heartbreaking moment from the early aughts when she said...",
    "link": "https://www.eonline.com/news/1422296/rosie-odonnell-on-ellen-degeneres-friendship-fallout",
    "timestamp": "2025-09-10T02:44:11Z"
  },
  {
    "title": "Trump Vs Fed: US Judge Blocks Termination Of Governor Lisa Cook Ahead Of FOMC Meeting",
    "description": "A judge temporarily blocked President Donald Trump from removing Federal Reserve Governor Lisa Cook, allowing her to remain on the job as she challenges the president’s efforts to oust her over allegations she committed mortgage fraud. In an early win for the…",
    "link": "https://www.ndtvprofit.com/world/trump-vs-fed-us-judge-blocks-termination-of-governor-lisa-cook-ahead-of-fomc-meeting",
    "timestamp": "2025-09-10T02:44:01Z"
  },
  {
    "title": "Judge blocks Trump from firing Fed Governor Lisa Cook while her laws",
    "description": "A federal judge on Tuesday night blocked President Donald Trump from firing Federal Reserve Governor Lisa Cook as her lawsuit challenging her termination plays out in court. Judge Jia Cobb’s issuance of a temporary restraining order in the case came nearly tw…",
    "link": "https://freerepublic.com/focus/f-news/4339484/posts",
    "timestamp": "2025-09-10T02:43:23Z"
  },
  {
    "title": "Why we joined an international investigation into how big tech lobbying is rewiring the future",
    "description": "The influence of lobbyists on media and tech policy is no secret, but this project gathered reporters from across the world to compare notes on the tactics and talking points of big tech.\nThe post Why we joined an international investigation into how big tech…",
    "link": "http://www.crikey.com.au/2025/09/10/big-techs-invisible-hand-crikey-international-investigation/",
    "timestamp": "2025-09-10T02:41:01Z"
  },
  {
    "title": "Boston Mayor Michelle Wu, target of the Trump administration, will face Josh Kraft in fall election",
    "description": "Boston Mayor Michelle Wu has advanced in Tuesday's preliminary election and will face the son of the Patriots owner in November. Wu is the city’s first Asian and female leader and a frequent target of the Trump administration. She will…",
    "link": "https://apnews.com/article/boston-mayor-michelle-wu-josh-kraft-abfa8f4089af405d288c92e1b4e66a53",
    "timestamp": "2025-09-10T02:40:37Z"
  },
  {
    "title": "Trump calls on EU to pressure Putin with 100% tariffs on China and India",
    "description": "The US president made the demand during a meeting between US and EU officials on Tuesday, according to a source familiar with the talks.",
    "link": "https://www.bbc.com/news/articles/c80gvz3l7n2o",
    "timestamp": "2025-09-10T02:38:42Z"
  },
  {
    "title": "Mexico proposes new import taxes on 1,400 products to boost national production",
    "description": "Mexico's government has submitted a budget proposal to impose new import taxes on over 1,400 products, mainly from Asian countries",
    "link": "https://abcnews.go.com/Business/wireStory/mexico-proposes-new-import-taxes-1400-products-boost-125422963",
    "timestamp": "2025-09-10T02:38:27Z"
  },
  {
    "title": "Trump fails in bid to fire Lisa Cook as Federal Reserve independence clings on",
    "description": "A federal court ruled Tuesday that embattled Federal Reserve Governor Lisa Cook can remain in her position while she fights President Donald Trump’s efforts to fire her.\nThe ruling, which will almost certainly be appealed, is a blow to the Trump administratio…",
    "link": "https://biztoc.com/x/63406d89cb4132a2",
    "timestamp": "2025-09-10T02:38:12Z"
  },
  {
    "title": "'It's not my signature': Trump says about alleged Epstein 'birthday book' letter (ABC News)",
    "description": "ABC News:\n'It's not my signature': Trump says about alleged Epstein ‘birthday book’ letter  —  Trump was asked by ABC News for comment on the alleged note.  —  US President Donald Trump speaks to reporters outside the restaurant Joe's Seafood, Prime Steak & S…",
    "link": "https://www.memeorandum.com/250909/p178",
    "timestamp": "2025-09-10T02:35:00Z"
  },
  {
    "title": "US judge blocks Trump from removing Fed Governor Cook, for now",
    "description": "A federal judge on Tuesday (Sep 9) temporarily blocked United States President Donald Trump from removing Federal Reserve Governor Lisa Cook, an early setback for the White House in an unprecedented legal battle that could upend the US central bank's long-hel…",
    "link": "https://www.channelnewsasia.com/world/us-judge-blocks-trump-removing-fed-governor-lisa-cook-5341326",
    "timestamp": "2025-09-10T02:33:00Z"
  },
  {
    "title": "Six takeaways from book of birthday messages to Epstein",
    "description": "The latest batch of Epstein files released by Congress give an insight into the convicted sex offender's sprawling and elite social circle.",
    "link": "https://www.bbc.com/news/articles/c20vw2de8y0o",
    "timestamp": "2025-09-10T02:32:48Z"
  },
  {
    "title": "Trump fails in bid to fire Lisa Cook as Federal Reserve independence clings on",
    "description": "No president has sought to fire a Fed governor before.",
    "link": "https://fortune.com/2025/09/09/trump-fails-to-fire-lisa-cook-federal-reserve-appeal/",
    "timestamp": "2025-09-10T02:29:40Z"
  },
  {
    "title": "Plane leaves South Korea for US to bring back workers detained in immigration raid, report says",
    "description": "South Korean media reports a charter plane has left for the U.S. to bring back Korean workers detained in an immigration raid in Georgia. A total of 475 workers, more than 300 of them South Koreans, were rounded up in the Sept. 4 raid at the battery factory u…",
    "link": "https://apnews.com/article/south-korea-immigration-raid-georgia-hyundai-trump-69c55c9b9e635d0d5413f972d634a9a1",
    "timestamp": "2025-09-10T02:27:00Z"
  },
  {
    "title": "Judge temporarily blocks Trump from removing Fed Governor Lisa Cook",
    "description": "A federal judge on Tuesday temporarily blocked President Donald Trump from removing Federal Reserve Governor Lisa Cook, an early setback for the White House in an unprecedented legal battle that could upend the U.S. central bank’s long-held independence.\nThe …",
    "link": "https://biztoc.com/x/0c1cc060379f66aa",
    "timestamp": "2025-09-10T02:26:48Z"
  },
  {
    "title": "Trump says signature on birthday note to Jeffrey Epstein is not his",
    "description": "US president's denial comes after White House said it would support a forensic analysis of the signature.",
    "link": "https://www.aljazeera.com/news/2025/9/10/trump-says-signature-on-birthday-note-to-jeffrey-epstein-is-not-his",
    "timestamp": "2025-09-10T02:22:55Z"
  },
  {
    "title": "Trump Unfazed As Free Palestine Protestors Call Him Hitler At Restaurant",
    "description": "President Donald Trump appeared unfazed Tuesday evening while eating out at a Washington, D.C., restaurant as pro-Palestine protesters called him \"Hitler.\"",
    "link": "https://dailycaller.com/2025/09/09/donald-trump-unfazed-free-palestine-protestors-call-him-hitler-washington-dc-restaurant/",
    "timestamp": "2025-09-10T02:21:39Z"
  },
  {
    "title": "Mexico proposes new import taxes on 1,400 products to boost national production",
    "description": "MEXICO CITY (AP) — Mexico’s government submitted a budget proposal Tuesday that would impose new import taxes on more than 1,400 products — many from Asian nations — to strengthen national production at a time when the United States is pressuring its North Am…",
    "link": "https://financialpost.com/pmn/mexico-proposes-new-import-taxes-on-1400-products-to-boost-national-production",
    "timestamp": "2025-09-10T02:20:55Z"
  },
  {
    "title": "America's lack of influence laid bare after Israel's Qatar strike",
    "description": "Israel's actions have completely exposed the lack of influence that the United States now has on developments in the Middle East.",
    "link": "https://www.abc.net.au/news/2025-09-10/israel-hit-on-hamas-in-qatar-and-trump-response/105756948",
    "timestamp": "2025-09-10T02:20:43Z"
  },
  {
    "title": "When the whole world is hacking, how does Britain say stop?",
    "description": "Britain wants to hold back the spyware arms race — but calling out friendly nations who hack is another matter.",
    "link": "https://www.politico.eu/article/when-the-whole-world-is-hacking-how-does-britain-uk-say-stop/",
    "timestamp": "2025-09-10T02:19:00Z"
  },
  {
    "title": "Judge blocks Trump's attempt to fire Lisa Cook from Federal Reserve board, setting up Supreme Court showdown",
    "description": "Federal Reserve Gov. Lisa Cook's legal fight against President Donald Trump is likely to reach the Supreme Court.\nSaul Loebl/AFP/Getty Images; Clive Brunskill/Getty\nLisa Cook can keep her job at the Federal Reserve for now, a federal judge ruled.\nCook sued Tr…",
    "link": "https://biztoc.com/x/9bace8fa093733d4",
    "timestamp": "2025-09-10T02:15:36Z"
  }
]