[
  {
    "title": "Disney representatives, Kimmel searched for way to defuse Kirk anger before program pulled",
    "description": "Walt Disney representatives and talk-show host Jimmy Kimmel raced to find the right words on Wednesday to calm a social media furor that erupted following criticism of his remarks about slain conservative activist Charlie Kirk, a person familiar with the matt…",
    "link": "https://japantoday.com/category/entertainment/disney-representatives-kimmel-searched-for-way-to-defuse-kirk-anger-before-program-pulled",
    "timestamp": "2025-09-19T01:24:15Z"
  },
  {
    "title": "Trump and Xi are set to discuss the TikTok deal and future of US-China relations",
    "description": "U.S. President Donald Trump is expected to talk with Chinese leader Xi Jinping in a push to finalize a deal to allow the popular social media app TikTok to keep operating in the U.S. The call Friday also may offer clues about whether the two leaders might mee…",
    "link": "https://www.seattlepi.com/business/article/trump-and-xi-are-set-to-discuss-the-tiktok-deal-21056071.php",
    "timestamp": "2025-09-19T01:21:21Z"
  },
  {
    "title": "Kirk Killing Sparks Fierce US Free Speech Debate",
    "description": "For Americans, the words are practically sacred: the First Amendment to the US Constitution guarantees freedom of speech.",
    "link": "https://www.ibtimes.com.au/kirk-killing-sparks-fierce-us-free-speech-debate-1860553",
    "timestamp": "2025-09-19T01:21:18Z"
  },
  {
    "title": "‘Jimmy Kimmel Live’ Benching Draws Spirited Protest Outside Late Night Host’s Hollywood Blvd Theater",
    "description": "Picketers calling out the Trump administration and the FCC’s pressure on ABC’s pausing of Jimmy Kimmel Live spilled over from the Disney Burbank HQ over to the front of the late night host’s El Capitan Theatre in a crowd numbering under one hundred. The prote…",
    "link": "http://deadline.com/2025/09/jimmy-kimmel-protest-hollywood-1236548746/",
    "timestamp": "2025-09-19T01:21:17Z"
  },
  {
    "title": "Trump asks US Supreme Court to allow firing of Fed Governor Lisa Cook",
    "description": "Donald Trump's administration approached the Supreme Court. They sought permission to proceed with the dismissal of Federal Reserve Governor, Lisa Cook. This action faces legal challenges. It raises concerns about the central bank's independence. Cook's remov…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-asks-us-supreme-court-to-allow-firing-of-fed-governor-lisa-cook/articleshow/123987677.cms",
    "timestamp": "2025-09-19T01:21:12Z"
  },
  {
    "title": "Kirk Killing Sparks Fierce US Free Speech Debate",
    "description": "For Americans, the words are practically sacred: the First Amendment to the US Constitution guarantees freedom of speech.",
    "link": "https://www.ibtimes.com/kirk-killing-sparks-fierce-us-free-speech-debate-3783870",
    "timestamp": "2025-09-19T01:21:11Z"
  },
  {
    "title": "Young plaintiffs stand tall after taking on Trump climate agenda in court",
    "description": "Young Americans challenging President Donald Trump’s fossil fuel agenda say they were proud to have their day in court -- even if it meant fielding tough...",
    "link": "https://www.yahoo.com/news/articles/young-plaintiffs-stand-tall-taking-012047368.html",
    "timestamp": "2025-09-19T01:20:47Z"
  },
  {
    "title": "Stephen A. Smith Criticizes Kimmel Over Charlie Kirk Comments",
    "description": "Stephen A. Smith Criticizes Kimmel Over Charlie Kirk Commentshuffpost.com",
    "link": "https://www.huffpost.com/entry/stephen-a-smith-jimmy-kimmel-charlie-kirk-comments_n_68cc9a9fe4b0df2833cd9305",
    "timestamp": "2025-09-19T01:19:44Z"
  },
  {
    "title": "Eying Bottom Line, US Media Giants Bow To Trump",
    "description": "The suspension by Disney-owned ABC of talk show host Jimmy Kimmel is the latest surrender by a US media giant to pressure from the Trump administration, putting the bottom line over free speech.",
    "link": "https://www.ibtimes.com/eying-bottom-line-us-media-giants-bow-trump-3783864",
    "timestamp": "2025-09-19T01:18:13Z"
  },
  {
    "title": "In show of force to Trump, Venezuela launches military drills and displays its Russian fighter jets | CNN",
    "description": "Venezuela has launched three days of military exercises and put on display its Russian-built fighter jets in a show of force aimed at the US amid rising tensions over Washington’s deployment of US warships to the Caribbean.",
    "link": "https://www.cnn.com/2025/09/18/americas/venezuela-military-drill-russian-jets-intl-latam",
    "timestamp": "2025-09-19T01:17:34Z"
  },
  {
    "title": "Trump and Melania arrive in US after UK trip",
    "description": "Air Force One landed as United States President Donald Trump and First Lady Melania Trump returned from a state visit to the United Kingdom, where they met with UK's King Charles III and other Bri...",
    "link": "https://biztoc.com/x/2d2af2c418c673e9",
    "timestamp": "2025-09-19T01:17:06Z"
  },
  {
    "title": "Nvidia announces a new partnership with Intel to work on custom data centers and personal computer products",
    "description": "Nvidia announces a new partnership with Intel to work on custom data centers and personal computer productskoat.com",
    "link": "https://www.koat.com/article/nvidia-to-invest-5-billion-intel/67953329",
    "timestamp": "2025-09-19T01:16:51Z"
  },
  {
    "title": "Nvidia announces a new partnership with Intel to work on custom data centers and personal computer products",
    "description": "Nvidia announces a new partnership with Intel to work on custom data centers and personal computer productswlky.com",
    "link": "https://www.wlky.com/article/nvidia-to-invest-5-billion-intel/67953329",
    "timestamp": "2025-09-19T01:14:46Z"
  },
  {
    "title": "'Get yourself a new pollster!' Fed-up Trump bashes Fox News' own surveys during interview",
    "description": "An irritated President Donald Trump lashed out Thursday at Fox News polls during an interview with the network.Trump was interviewed by Martha MacCallum on Fox News' \"The Story.\" The two discussed polling about the economy and concerns about unemployment and …",
    "link": "https://www.rawstory.com/donald-trump-fox-news-2674008561/",
    "timestamp": "2025-09-19T01:14:19Z"
  },
  {
    "title": "Kamala Harris Blasts Trump Admin’s ‘Assault on Free Speech’ After Kimmel Suspension",
    "description": "Kamala Harris denounces the Trump administration’s attack on critics, warning of a dangerous assault on free speech.",
    "link": "http://www.rollingstone.com/politics/politics-news/kamala-harris-slams-trump-assault-free-speech-kimmel-1235430874/",
    "timestamp": "2025-09-19T01:14:18Z"
  },
  {
    "title": "3 members of federal control board in Puerto Rico sue Trump and others for illegal firings",
    "description": "Three members of a federal control board overseeing Puerto Rico’s finances who were recently fired by the administration of U.S. President Donald Trump have filed a lawsuit in U.S. court alleging their firings were illegal",
    "link": "https://abcnews.go.com/Business/wireStory/3-members-federal-control-board-puerto-rico-sue-125720916",
    "timestamp": "2025-09-19T01:10:34Z"
  },
  {
    "title": "CDC Vaccines: Bay Area health experts relieved as West Coast Health Alliance issues independent guidelines",
    "description": "A new law allows California to set its own vaccine schedules based on independent medical organizations and state health experts, rather than the CDC. It also gives the Golden State the power to set its own immunization schedules and requires insurers to pay …",
    "link": "https://abc7news.com/post/cdc-vaccines-bay-area-health-experts-relieved-west-coast-alliance-issues-independent-guidelines/17844448/",
    "timestamp": "2025-09-19T01:08:37Z"
  },
  {
    "title": "Stephen Colbert reacts to ABC ‘indefinitely’ suspending Jimmy Kimmel’s late-night show",
    "description": "The \"Late Show\" host also slammed Donald Trump as \"an autocrat.\"",
    "link": "https://pagesix.com/2025/09/18/entertainment/stephen-colbert-reacts-to-abc-indefinitely-suspending-jimmy-kimmels-late-night-show/",
    "timestamp": "2025-09-19T01:08:15Z"
  },
  {
    "title": "Trump and Xi are set to discuss the TikTok deal and future of US-China relations",
    "description": "U.S. President Donald Trump says he’ll meet Chinese leader Xi Jinping at a regional summit taking place in October in South Korea and will visit China early next year.",
    "link": "https://www.ksat.com/news/politics/2025/09/19/trump-and-xi-are-set-to-discuss-the-tiktok-deal-and-future-of-us-china-relations/",
    "timestamp": "2025-09-19T01:08:14Z"
  },
  {
    "title": "Stephen Colbert Rips ABC Pulling Jimmy Kimmel as ‘Blatant Censorship’ to Appease Trump: ‘With an Autocrat, You Cannot Give an Inch",
    "description": "Stephen Colbert came to the defense of fellow late-night host Jimmy Kimmel on Thursday’s “The Late Show” on CBS, using his monologue to blast ABC executives for indefinitely suspending “Jimmy Kimmel Live!” after Federal Communications Commission chairman Bren…",
    "link": "https://variety.com/2025/tv/news/stephen-colbert-rips-abc-pulling-kimmel-censorship-1236522765/",
    "timestamp": "2025-09-19T01:07:52Z"
  },
  {
    "title": "Trump and Xi are set to discuss the TikTok deal and future of US-China relations",
    "description": "WASHINGTON (AP) — U.S. President Donald Trump is expected to talk with Chinese leader Xi Jinping on Friday in a push to finalize a deal to allow the popular social media app TikTok to keep operating in the United States. The call also may offer clues about wh…",
    "link": "https://financialpost.com/pmn/trump-and-xi-are-set-to-discuss-the-tiktok-deal-and-future-of-us-china-relations",
    "timestamp": "2025-09-19T01:05:47Z"
  },
  {
    "title": "Trump and Xi are set to discuss the TikTok deal and future of US-China relations",
    "description": "U.S. President Donald Trump says he’ll meet Chinese leader Xi Jinping at a regional summit taking place in October in South Korea and will visit China early next year",
    "link": "https://www.wsbradio.com/news/politics/trump-says-he-xi/ATWKWKQD2FDJZMXLAO4K6JZ4MM/",
    "timestamp": "2025-09-19T01:05:43Z"
  },
  {
    "title": "Oil Pares Weekly Gain As Trump Calls For Low Prices To End War",
    "description": "Oil pared a second weekly gain as renewed calls by US President Donald Trump for lower prices to pressure Moscow to end the war in Ukraine weighed against renewed attacks on Russian energy infrastructure.",
    "link": "https://www.ndtvprofit.com/markets/oil-pares-weekly-gain-as-trump-calls-for-low-prices-to-end-war",
    "timestamp": "2025-09-19T01:05:09Z"
  },
  {
    "title": "Stephen Colbert Blasts 'Weak' TV Networks for Bowing to Donald Trump (Michael Boyle/The Daily Beast)",
    "description": "Michael Boyle / The Daily Beast:\nStephen Colbert Blasts ‘Weak’ TV Networks for Bowing to Donald Trump  —  STANDING WITH JIMMY  —  “With an autocrat, you cannot give an inch,” Colbert said.  —  Stephen Colbert has criticized ABC and CBS for their “weak” decisi…",
    "link": "https://www.memeorandum.com/250918/p144",
    "timestamp": "2025-09-19T01:05:00Z"
  },
  {
    "title": "Jimmy Kimmel Seen for 1st Time Since Late Night Show Suspension",
    "description": "Jimmy Kimmel was spotted for the first time following the news of ABC suspending his late night show. Kimmel, 57, was photographed driving in Los Angeles on Thursday, September 18. He was seemingly in good spirits as he was all smiles while navigating a parki…",
    "link": "https://www.usmagazine.com/celebrity-news/news/jimmy-kimmel-seen-for-1st-time-after-abc-suspends-jimmy-kimmel-live/#article",
    "timestamp": "2025-09-19T01:03:25Z"
  },
  {
    "title": "First-Of-Its-Kind Case Could Completely Change The Fight Against Immigration Fraud",
    "description": "An American woman seeking an annulment from her foreign-born husband could end up turbocharging the government’s crackdown on marriage fraud.",
    "link": "https://www.tampafp.com/first-of-its-kind-case-could-completely-change-the-fight-against-immigration-fraud/",
    "timestamp": "2025-09-19T01:03:08Z"
  },
  {
    "title": "Political witch hunts and blacklists: Donald Trump and the new era of McCarthyism",
    "description": "The parallels between McCarthyism and Trumpism are stark and unsettling; in both eras, dissent has been conflated with disloyalty.",
    "link": "https://theconversation.com/political-witch-hunts-and-blacklists-donald-trump-and-the-new-era-of-mccarthyism-265389",
    "timestamp": "2025-09-19T01:00:52Z"
  },
  {
    "title": "Moral Relativism and the Justification of Political Violence",
    "description": "\"The cowardice of local prosecutors and school officials have turned the left into a ticking time bomb.\"\nThe post Moral Relativism and the Justification of Political Violence first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/moral-relativism-and-the-justification-of-political-violence/",
    "timestamp": "2025-09-19T01:00:46Z"
  },
  {
    "title": "Stephen Colbert Stands With Kimmel, Mocks Disney as ‘No. 1 in Streaming’ for ‘Pissing Themselves’ Over Trump | Video",
    "description": "\"You know what my community values are, buster? Freedom of speech!\" the \"Late Show\" host says to cheers from his studio audience\nThe post Stephen Colbert Stands With Kimmel, Mocks Disney as ‘No. 1 in Streaming’ for ‘Pissing Themselves’ Over Trump | Video appe…",
    "link": "https://www.thewrap.com/stephen-colbert-stands-with-kimmel-mocks-disney/",
    "timestamp": "2025-09-19T00:55:52Z"
  },
  {
    "title": "With Jimmy Kimmel suspension, Trump's critics see a campaign to silence them",
    "description": "Already suing newspapers for billions over their reporting, president now cheers removal of late-show hostABC's decision to pull late-show host Jimmy Kimmel off the air marks what observers see as an escalation in a campaign by U.S. President Donald Trump and…",
    "link": "https://freerepublic.com/focus/f-news/4341436/posts",
    "timestamp": "2025-09-19T00:55:09Z"
  },
  {
    "title": "FBI sniper testifies that hiding spot near golf course was ideal place for man to shoot Trump",
    "description": "An FBI sniper testified about the effectiveness of a hiding spot chosen by a man accused of trying to assassinate President Donald Trump at his Florida golf course last year",
    "link": "https://abcnews.go.com/US/wireStory/fbi-sniper-testifies-hiding-spot-golf-ideal-place-125720749",
    "timestamp": "2025-09-19T00:54:30Z"
  },
  {
    "title": "Avoiding sanctions: Takeaways from AP's report on a secret deal between Russia and Vietnam",
    "description": "Russia is a key supplier of military goods to Vietnam, providing it with fighter jets, tanks and ships.  Moscow's ongoing war against Ukraine, however, has...",
    "link": "https://www.yahoo.com/news/articles/avoiding-sanctions-takeaways-aps-report-005339123.html",
    "timestamp": "2025-09-19T00:53:39Z"
  },
  {
    "title": "Oil Pares Weekly Gain as Trump Calls for Low Prices to End War",
    "description": "Oil pared a second weekly gain as renewed calls by US President Donald Trump for lower prices to pressure Moscow to end the war in Ukraine weighed against renewed attacks on Russian energy infrastructure.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-pares-weekly-gain-as-trump-calls-for-low-prices-to-end-war",
    "timestamp": "2025-09-19T00:53:15Z"
  },
  {
    "title": "Stephen Colbert Defends Jimmy Kimmel: “This Is Blatant Censorship” By An “Autocrat”",
    "description": "\"With an autocrat, you cannot give an inch,\" Colbert told his audience.\nStephen Colbert Defends Jimmy Kimmel: “This Is Blatant Censorship” By An “Autocrat”\nScoop Harrison",
    "link": "https://consequence.net/2025/09/colbert-kimmel-censorship/",
    "timestamp": "2025-09-19T00:48:20Z"
  },
  {
    "title": "Why S&P 500 companies may ditch quarterly earnings reports",
    "description": "The S&P 500 just hit new record highs. Will changing reporting requirements impact the market?\nThe post Why S&P 500 companies may ditch quarterly earnings reports appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/09/19/why-sp-500-companies-may-ditch-quarterly-earnings-reports/",
    "timestamp": "2025-09-19T00:47:53Z"
  },
  {
    "title": "One line from 9-0 Supreme Court case reveals Trump attack on Kimmel is 'unconstitutional'",
    "description": "On Wednesday, President Donald Trump's appointed Federal Communications Commission (FCC) chairman issued a threat that preceded ABC's decision to take late-night host Jimmy Kimmel's show off the air. And one legal analyst has found a recent Supreme Court case…",
    "link": "https://www.rawstory.com/supreme-court-trump-2674008554/",
    "timestamp": "2025-09-19T00:44:33Z"
  },
  {
    "title": "Kamala Harris Claims Trump Told Her, ‘You’ve Done a Great Job’ and Said ‘I’m Going to Tone It Down’",
    "description": "Former Vice President Kamala Harris said President Donald Trump complimented her in a phone call last year and pledged to tone down his rhetoric on the campaign trail.\nThe post Kamala Harris Claims Trump Told Her, ‘You’ve Done a Great Job’ and Said ‘I’m Going…",
    "link": "https://www.mediaite.com/politics/kamala-harris-claims-trump-told-her-youve-done-a-great-job-and-said-im-going-to-tone-it-down/",
    "timestamp": "2025-09-19T00:43:18Z"
  },
  {
    "title": "Jimmy Kimmel raged against Trump and his ‘MAGA mouth-breathers’ almost every night for a year before ABC pulled him off air",
    "description": "The Post reviewed his all of Kimmel's monologues for the last 12 months so you don't have to — and the findings were monotonous.",
    "link": "https://nypost.com/2025/09/18/us-news/jimmy-kimmel-raged-against-trump-almost-every-night-for-a-year-before-abc-pulled-him-off-air/",
    "timestamp": "2025-09-19T00:40:36Z"
  },
  {
    "title": "Inside Palantir: Profits, Power and the Kill Machine",
    "description": "We spoke to a former Palantir employee, now turned critic, agitator and educator speaking out against the tech company.",
    "link": "https://citizensreunited.substack.com/p/inside-palantir-profits-power-and",
    "timestamp": "2025-09-19T00:40:04Z"
  },
  {
    "title": "Japan inflation slows in August, rice price surges ease",
    "description": "Inflation in Japan slowed to 2.7 percent in August due partly to government energy subsidies, official data showed Friday, with the cost of rice easing following a huge price spike. Inflation continues to be driven by rice prices, which increased by 68.8 perc…",
    "link": "https://www.digitaljournal.com/world/japan-inflation-slows-in-august-rice-price-surges-ease/article",
    "timestamp": "2025-09-19T00:37:20Z"
  },
  {
    "title": "Japan Inflation Slows In August, Rice Price Surges Ease",
    "description": "Inflation in Japan slowed to 2.7 percent in August due partly to government energy subsidies, official data showed Friday, with the cost of rice easing following a huge price spike.",
    "link": "https://www.ibtimes.com/japan-inflation-slows-august-rice-price-surges-ease-3783860",
    "timestamp": "2025-09-19T00:36:14Z"
  },
  {
    "title": "Democrat-led effort seeks to recognize Palestinian state",
    "description": "Amidst growing pressure on Israel, US senators introduce a resolution to recognize a Palestinian state. The measure, led by Democrats, faces opposition from Republicans and the Trump administration.",
    "link": "https://www.israelnationalnews.com/news/415182",
    "timestamp": "2025-09-19T00:32:41Z"
  },
  {
    "title": "Jimmy Kimmel is only the latest TV host to get into trouble – here's a look at others",
    "description": "<![CDATA[ From romance scandals to racial controversies, prominent TV figures such as Alec Baldwin and Sharon Osbourne have faced severe professional consequences for misconduct. ]]>",
    "link": "https://cnalifestyle.channelnewsasia.com/entertainment/tv-hosts-controversies-jimmy-kimmel-suspension-471321",
    "timestamp": "2025-09-19T00:32:00Z"
  },
  {
    "title": "Trump administration faces hurdles in targeting left-wing groups, experts say",
    "description": "A White House vow to dismantle left-wing organizations may be easier issued than implemented, according to experts.“There’s not a lot of federal law on this,” said Scott Walter, president of the Capital Research Center, a Washington-based nonprofit organizati…",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-administration-faces-hurdles-targeting-left-wing-groups-rcna232204",
    "timestamp": "2025-09-19T00:31:56Z"
  },
  {
    "title": "3 members of federal control board in Puerto Rico sue Trump and others for illegal firings",
    "description": "SAN JUAN, Puerto Rico (AP) — Three members of a federal control board overseeing Puerto Rico’s finances, who were recently fired by the administration of U.S. President Donald Trump, filed a lawsuit in federal court on Thursday alleging their firings were ill…",
    "link": "https://financialpost.com/pmn/3-members-of-federal-control-board-in-puerto-rico-sue-trump-and-others-for-illegal-firings",
    "timestamp": "2025-09-19T00:31:39Z"
  },
  {
    "title": "Trump Says Putin 'Let Me Down' Over War in Ukraine",
    "description": "President Donald Trump said Russian President Vladimir Putin had “really let me down,” but insisted allies must stop purchasing oil from Russia if they want the US to further intervene and pressure the Kremlin to end the war in Ukraine.\n“Very simply, if the p…",
    "link": "https://biztoc.com/x/5114545b6256691e",
    "timestamp": "2025-09-19T00:31:32Z"
  },
  {
    "title": "Golden Trump Bitcoin Statue Appears In DC: 'Statue Of Liberty Walked So Statue Of Gold Trump With BTC Could Run'",
    "description": "Crypto supporters staged a flashy stunt in Washington, D.C., placing a foam-made golden statue of president Donald Trump holding a Bitcoin (CRYPTO: BTC) on...",
    "link": "https://finance.yahoo.com/news/golden-trump-bitcoin-statue-appears-003114113.html",
    "timestamp": "2025-09-19T00:31:14Z"
  },
  {
    "title": "Trump threatens licenses of TV stations that criticize him",
    "description": "Trump’s remarks represent a startling break with the nation’s long-standing traditions of freedom of speech and of the press enshrined in the U.S. Constitution.",
    "link": "https://www.japantimes.co.jp/business/2025/09/19/companies/trump-tv-stations-threat/",
    "timestamp": "2025-09-19T00:31:00Z"
  },
  {
    "title": "Stephen Colbert defends Jimmy Kimmel, calls Trump an 'autocrat' (CNBC)",
    "description": "CNBC:\nStephen Colbert defends Jimmy Kimmel, calls Trump an ‘autocrat’ … Late-night television host Stephen Colbert gave a full-throated defense of Jimmy Kimmel on Thursday night and called President Donald Trump an “autocrat.”  —  “This is blatant censorship,…",
    "link": "https://www.memeorandum.com/250918/p142",
    "timestamp": "2025-09-19T00:25:00Z"
  },
  {
    "title": "Chris Mason: Delight and relief in government after state visit",
    "description": "Trump's disagreements with Sir Keir were somehow channelled past him, rather than at him, writes the BBC's political editor.",
    "link": "https://www.bbc.com/news/articles/cvgn3445655o",
    "timestamp": "2025-09-19T00:24:23Z"
  },
  {
    "title": "The Bob Cesca Podcast: The Lollipop Guild",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: The Lollipop Guild -- Donald Trump censors Jimmy Kimmel. Kimmel wasn't talking about or bashing Charlie Kirk. Donald pledged Jimmy Fallon and Seth Myers are next. Reactions from Barack Obama, …",
    "link": "https://littlegreenfootballs.com/article/54928_The_Bob_Cesca_Podcast-_The_Lol",
    "timestamp": "2025-09-19T00:24:05Z"
  },
  {
    "title": "D.L. Hughley: Kimmel Suspension Was Government-Run 'Cancel Culture'",
    "description": "Thursday on MSNBC's \"The Beat,\" comedian D. L. Hughley said the suspension of Jimmy Kimmel is government-run \"cancel culture.\"\nThe post D.L. Hughley: Kimmel Suspension Was Government-Run ‘Cancel Culture’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/09/18/d-l-hughley-kimmel-suspension-was-government-run-cancel-culture/",
    "timestamp": "2025-09-19T00:22:54Z"
  },
  {
    "title": "Thursday Night Open Thread",
    "description": "We are officially one week away from my wedding so I am busy as all get out. Joelle is arriving on Saturday evening at midnight, so I have about 45 hours to get the house ready and it is nowhere near it. But that is ok because even though I quit drinking coff…",
    "link": "https://balloon-juice.com/2025/09/18/thursday-night-open-thread-89/",
    "timestamp": "2025-09-19T00:20:58Z"
  },
  {
    "title": "Jon Stewart to host special edition of ‘The Daily Show’ one day after Jimmy Kimmel’s suspension",
    "description": "Stewart's featured guest will be Maria Ressa, the journalist and author of “How to Stand Up to a Dictator.”",
    "link": "https://fortune.com/2025/09/18/jon-stewart-to-host-special-edition-of-the-daily-show-one-day-after-jimmy-kimmels-suspension/",
    "timestamp": "2025-09-19T00:17:45Z"
  },
  {
    "title": "Could Trump's visit come back to haunt Britain's establishment?",
    "description": "In all, the British government will take the historic second state visit as a big win. But it could be a big gamble too. Mark Stone breaks down the highs and lows.",
    "link": "https://news.sky.com/story/could-trumps-visit-come-back-to-haunt-britains-establishment-13433738",
    "timestamp": "2025-09-19T00:16:00Z"
  },
  {
    "title": "Trump flattery pays off for Starmer with major pitfalls averted",
    "description": "While the British concluded the trip without any open conflict, they failed to score any obvious diplomatic breakthroughs.",
    "link": "https://www.japantimes.co.jp/news/2025/09/19/world/politics/uk-trump-flattery-pays-off/",
    "timestamp": "2025-09-19T00:15:00Z"
  },
  {
    "title": "Walt Disney Executives To Meet With Jimmy Kimmel, Assess Talk Show Future, Bloomberg News Reports",
    "description": "Walt Disney Executives To Meet With Jimmy Kimmel, Assess Talk Show Future, Bloomberg News Reportshuffpost.com",
    "link": "https://www.huffpost.com/entry/walt-disney-executives-to-meet-with-jimmy-kimmel-assess-talk-show-future-bloomberg-news-reports_n_68cc9cb9e4b0afb4eb4cc601",
    "timestamp": "2025-09-19T00:12:54Z"
  },
  {
    "title": "Jimmy Kimmel spotted in public for first time after his show was pulled from airwaves",
    "description": "Fox News Digital obtained photos of Jimmy Kimmel and footage of moving trucks at the at the studio where his show was filmed.",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-spotted-public-first-time-after-his-show-pulled-from-airwaves",
    "timestamp": "2025-09-19T00:12:16Z"
  },
  {
    "title": "How Britain got Trumped",
    "description": "There must be moments when Keir Starmer and Donald Trump are together, and their eyes lock for a moment in mutually acknowledged bemusement: how could this be my Transatlantic counterpart, my co-custodian of the special relationship?\nYou could see it at Chequ…",
    "link": "https://biztoc.com/x/822da5d3cc76845b",
    "timestamp": "2025-09-19T00:09:31Z"
  },
  {
    "title": "Trump Takes a Swipe At Ilhan Omar in New Attack: 'What Scum'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump blasted Democratic Representative Ilhan Omar of Minnesota on Thursday, ripping her birth country and questioning her citizenship.\nNewsweek reached out to the congresswoman's D.C. office …",
    "link": "https://biztoc.com/x/239f58d8675855d1",
    "timestamp": "2025-09-19T00:09:20Z"
  },
  {
    "title": "Very close to Modi, but put sanctions on India: Trump",
    "description": "US News: LONDON: US President Donald Trump repeated his claim at a presser at Chequers, the UK PM's official country retreat, that his intervention had stopped.",
    "link": "https://timesofindia.indiatimes.com/world/us/very-close-to-modi-but-put-sanctions-on-india-trump/articleshow/123987299.cms",
    "timestamp": "2025-09-19T00:08:21Z"
  },
  {
    "title": "Stephen Colbert Slams Decision to Pull Jimmy Kimmel Off the Air",
    "description": "The late night talk show community is sticking together, with Stephen Colbert publicly expressing support for Jimmy Kimmel after his show Jimmy Kimmel Live! was pulled off the air. “This is blatant censorship,” Colbert, 61, said during the Thursday, September…",
    "link": "https://www.usmagazine.com/celebrity-news/news/stephen-colbert-defends-jimmy-kimmel-after-show-is-pulled/#article",
    "timestamp": "2025-09-19T00:07:10Z"
  },
  {
    "title": "Trump Takes a Swipe At Ilhan Omar in New Attack: 'What Scum'",
    "description": "The post by the president arrives as Representative Omar faced a censure push over alleged comments about the late conservative activist Charlie Kirk.",
    "link": "https://www.newsweek.com/trump-swipe-ilhan-omar-2132221",
    "timestamp": "2025-09-19T00:05:16Z"
  },
  {
    "title": "This New York Ryder Cup will be crazy. Question is, how crazy?",
    "description": "Fans will be charged when the Ryder Cup visits the Black Course at Bethpage State Park next week. But will they be out of control?",
    "link": "https://golf.com/news/bethpage-ryder-cup-destined-craziest-yet/",
    "timestamp": "2025-09-19T00:01:32Z"
  },
  {
    "title": "FTC lawsuit: Federal Trade Commission sues Live Nation and Ticketmaster, saying they force fans to pay more for concerts, events",
    "description": "The Federal Trade Commission and a bipartisan group of state attorneys general sued Ticketmaster and its parent company Thursday, saying they are forcing consumers to pay more to see live events through a variety of illegal tactics.",
    "link": "https://abc7ny.com/post/ftc-lawsuit-federal-trade-commission-sues-live-nation-ticketmaster-saying-forces-fans-pay-more-concerts-events/17844152/",
    "timestamp": "2025-09-19T00:01:11Z"
  },
  {
    "title": "The Department of War Is Back!",
    "description": "Originally appeared at TomDispatch. My fellow Americans, my critical voice has finally been heard inside the Oval Office. No, not my voice against the $1.7 trillion this country is planning to spend on new nuclear weapons. No, not my call to cut the Pentagon …",
    "link": "https://original.antiwar.com/william_astore/2025/09/18/the-department-of-war-is-back/",
    "timestamp": "2025-09-19T00:00:53Z"
  },
  {
    "title": "Warren Calls Out US DOJ Over Binance Settlement And Alleged Trump Ties In New Letter",
    "description": "Senator Elizabeth Warren is intensifying her scrutiny of Binance, the world’s largest cryptocurrency exchange, by demanding clarifications from the US Department of Justice (DOJ) regarding the crypto company’s compliance with a 2023 settlement agreement.  Thi…",
    "link": "http://www.newsbtc.com/binance/warren-calls-out-us-doj-over-binance-settlement-and-alleged-trump-ties-in-new-letter/",
    "timestamp": "2025-09-19T00:00:42Z"
  },
  {
    "title": "What’s The Real Reason Behind OPEC+’s Surprise Oil Production Boost?",
    "description": "OPEC+’s decision last week to increase its collective oil production has surprised many, given the soft outlook for oil prices for the remainder of this year and into next. It is true that the 137,000 barrels per day (bpd) rise from October is much lower than…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Whats-The-Real-Reason-Behind-OPECs-Surprise-Oil-Production-Boost.html",
    "timestamp": "2025-09-19T00:00:00Z"
  },
  {
    "title": "Stephen A. Smith offers no sympathy to Jimmy Kimmel following Charlie Kirk comments",
    "description": "Stephen A. Smith did not hold back his criticism of Jimmy Kimmel after ABC opted to pull his show indefinitely following a controversial monologue regarding the death of the right-",
    "link": "https://www.marca.com/en/lifestyle/tv-shows/2025/09/19/68cc9cb6268e3e9a638b456e.html",
    "timestamp": "2025-09-18T23:59:19Z"
  },
  {
    "title": "Jimmy Kimmel getting pulled off air ‘disturbing’ — but Stephen A. Smith admits comments ‘didn’t appear to be the wisest move’",
    "description": "Stephen A. Smith has weighed in on “Jimmy Kimmel Live!” being taken off the air indefinitely by ABC.",
    "link": "https://nypost.com/2025/09/18/sports/stephen-a-smith-admits-jimmy-kimmel-didnt-make-wisest-move/",
    "timestamp": "2025-09-18T23:55:08Z"
  },
  {
    "title": "What We’ll Be Watching for at UNGA",
    "description": "Trump will be the elephant in the room.",
    "link": "http://foreignpolicy.com/2025/09/18/what-to-watch-unga-united-nations-trump/",
    "timestamp": "2025-09-18T23:54:55Z"
  },
  {
    "title": "CNN's Erin Burnett shreds right-wing hypocrisy with devastating superclip of their remarks",
    "description": "CNN anchor Erin Burnett tore into MAGA hypocrisy Thursday night in the aftermath of Jimmy Kimmel's suspension from ABC by throwing their own remarks back at them. After showing new images of the late-night comedian less than 24 hours after his show was sudden…",
    "link": "https://www.rawstory.com/jimmy-kimmel-2674008412/",
    "timestamp": "2025-09-18T23:52:24Z"
  },
  {
    "title": "GOP splits over FCC Chair Brendan Carr's role in Jimmy Kimmel suspension after Charlie Kirk comments",
    "description": "Republicans divide over FCC Chairman Brendan Carr pressuring ABC to suspend Jimmy Kimmel following Charlie Kirk assassination comments. GOP senators warn against government speech regulation while others support Carr's broadcast licensing actions and Kimmel s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gop-splits-over-fcc-chair-brendan-carrs-role-in-jimmy-kimmel-suspension-after-charlie-kirk-comments/articleshow/123987221.cms",
    "timestamp": "2025-09-18T23:51:06Z"
  },
  {
    "title": "Do Not Underestimate How Dangerous The Jimmy Kimmel Suspension Is (Paul Blumenthal/HuffPost)",
    "description": "Paul Blumenthal / HuffPost:\nDo Not Underestimate How Dangerous The Jimmy Kimmel Suspension Is  —  Trump wants the ability to control what is said and who can say it.  And he's been getting it.  —  President Donald Trump's authoritarian consolidation of govern…",
    "link": "https://www.memeorandum.com/250918/p139",
    "timestamp": "2025-09-18T23:50:01Z"
  },
  {
    "title": "Hamas Official Targeted by Israel Appears in 1st Interview Following Qatar Strike",
    "description": "Senior Hamas official Ghazi Hamad, who was one of the targets of the assassination attempt last week in Doha, Qatar, was interviewed by Al Jazeera on Wednesday evening. Hamad is the second Hamas official to be interviewed since the strike, following a similar…",
    "link": "https://freerepublic.com/focus/f-news/4341431/posts",
    "timestamp": "2025-09-18T23:48:23Z"
  },
  {
    "title": "Trump urges House Republicans to approve funding bill",
    "description": "United States President Donald Trump called on House Republicans to \"UNIFY\" and \"VOTE YES\" on a clean short-term funding bill aimed at preventing a government shutdown, funding it ...",
    "link": "https://biztoc.com/x/dd73cfe03d970242",
    "timestamp": "2025-09-18T23:46:33Z"
  },
  {
    "title": "6 Times Leftists Melting Down Over Jimmy Kimmel Were Happy To Deny Conservatives ‘Free Speech’",
    "description": "The left doesn’t really care about Kimmel or free speech, it’s just about exploiting a convenient storyline to keep their narrative of Trump-is-authoritarian alive.ABC News pulled Jimmy Kimmel off the air on Wednesday. Not for being painfully unfunny, and not…",
    "link": "https://freerepublic.com/focus/f-news/4341430/posts",
    "timestamp": "2025-09-18T23:43:06Z"
  },
  {
    "title": "Hundreds March on Disney for Pulling Jimmy Kimmel: ‘People Cannot Collaborate With Fascism’",
    "description": "The Burbank protest comes one day after \"Jimmy Kimmel Live!\" was indefinitely suspended over the host's Charlie Kirk comments\nThe post Hundreds March on Disney for Pulling Jimmy Kimmel: ‘People Cannot Collaborate With Fascism’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/walt-disney-studios-protests-jimmy-kimmel-suspension-wga/",
    "timestamp": "2025-09-18T23:42:52Z"
  },
  {
    "title": "Japan core inflation rate dips to lowest since November 2024 as expected",
    "description": "The \"core-core\" inflation rate, which strips out prices of both fresh food and energy and is closely monitored by the BOJ, was at 3.3%, down from 3.4% in July.",
    "link": "https://www.cnbc.com/2025/09/19/japan-core-inflation-rate-dips-to-lowest-since-november-2024-as-expected.html",
    "timestamp": "2025-09-18T23:40:17Z"
  },
  {
    "title": "FCC Commissioner Rebukes Agency’s Chair, Says ‘We Don’t Have the Authority’ To Retaliate Against Broadcasters",
    "description": "Commissioner Anna Gomez of the Federal Communications Commission gave an unequivocal rebuke of FCC Chair Brendan Carr. \nThe post FCC Commissioner Rebukes Agency’s Chair, Says ‘We Don’t Have the Authority’ To Retaliate Against Broadcasters first appeared on Me…",
    "link": "https://www.mediaite.com/media/news/fcc-commissioner-rebukes-agencys-chair-says-we-dont-have-the-authority-to-retaliate-against-broadcasters/",
    "timestamp": "2025-09-18T23:39:42Z"
  },
  {
    "title": "Kimmel Was Reportedly About to Give Controversial Monologue When He Was Suspended: ‘He Has To Take Down the Temperature’",
    "description": "Late-night host Jimmy Kimmel was reportedly about to deliver another controversial monologue when his show was suspended by ABC this week.\nThe post Kimmel Was Reportedly About to Give Controversial Monologue When He Was Suspended: ‘He Has To Take Down the Tem…",
    "link": "https://www.mediaite.com/media/tv/kimmel-was-reportedly-about-to-give-controversial-monologue-when-he-was-suspended-he-has-to-take-down-the-temperature/",
    "timestamp": "2025-09-18T23:34:31Z"
  },
  {
    "title": "Charlie Kirk’s Producer Tells Paramount He “Loved” Being Featured On ‘South Park’: “He Would Want The Episode Back Up”",
    "description": "As free speech becomes a hot-button issue in the wake of Charlie Kirk‘s assassination, one of his colleagues and close friends is speaking up for his interests. Andrew Kolvet, executive producer of The Charlie Kirk Show, recently urged Paramount to restore th…",
    "link": "http://deadline.com/2025/09/charlie-kirk-producer-paramount-restore-south-park-episode-1236548818/",
    "timestamp": "2025-09-18T23:33:22Z"
  },
  {
    "title": "Joe Rogan Gets Weirded Out Over Trump’s ‘Very Odd’ Alleged Letter To Epstein",
    "description": "\"What the f***k is wrong with you?,\" Rogan said.",
    "link": "https://www.huffpost.com/entry/joe-rogan-trump-epstein-letter_n_68cc457ce4b0df2833cd5e11",
    "timestamp": "2025-09-18T23:32:10Z"
  },
  {
    "title": "Comedy Fans Are Horrified by the Prospect of Having to Defend Jimmy Fallon",
    "description": "By\n JM McNab\n Published: September 18th, 2025",
    "link": "https://www.cracked.com/article_48409_comedy-fans-are-horrified-by-the-prospect-of-having-to-defend-jimmy-fallon.html",
    "timestamp": "2025-09-18T23:30:00Z"
  },
  {
    "title": "This Republican Attempt to Scuttle Federal Land Plans Could Cause Great Upheaval",
    "description": "This story was originally published by Grist and is reproduced here as part of the Climate Desk collaboration. In the spring of 1996, lawmakers quietly buried a rider in a humdrum bill meant to make life easier for small businesses. That addition, the Congres…",
    "link": "https://www.motherjones.com/politics/2025/09/republican-senate-changes-congressional-review-act-federal-land-use-upheaval/",
    "timestamp": "2025-09-18T23:30:00Z"
  },
  {
    "title": "With Genocide Confirmed and Gaza City a 'Lifeless Wasteland,' US Vetoes Another UN Ceasefire Resolution",
    "description": "Against a backdrop of Israel's genocidal obliteration of Gaza City and a worsening man-made famine throughout the embattled Palestinian exclave, the United States on Thursday cast its sixth United Nations Security Council veto of a resolution calling for an i…",
    "link": "https://www.commondreams.org/news/us-vetoes-another-un-gaza-resolution",
    "timestamp": "2025-09-18T23:28:42Z"
  },
  {
    "title": "Gavin Newsom wages a well-intentioned — but incoherent — fight for manhood",
    "description": "As he races to define American masculinity and set himself apart as an advocate for men, California Gov. Gavin Newsom has announced a new program designed to stem what he called an “epidemic of loneliness” that is “manifesting and metastasizing online.”",
    "link": "https://www.msnbc.com/top-stories/latest/gavin-newsom-young-men-loneliness-charlie-kirk-rcna232253",
    "timestamp": "2025-09-18T23:28:41Z"
  },
  {
    "title": "Pritzker’s office scrubs photo with Chicago 'peacekeeper' later charged in deadly robbery",
    "description": "Illinois Gov. JB Pritzker deleted a photo with a Chicago area anti-violence worker part of the city's \"peacekeeper\" program, after learning they had been charged with murder days later.",
    "link": "https://www.foxnews.com/politics/pritzkers-office-scrubs-photo-chicago-peacekeeper-later-charged-deadly-robbery",
    "timestamp": "2025-09-18T23:28:14Z"
  },
  {
    "title": "Trump on if TikTok's Worth Damage It Does: I Did Well on It, It's Been Mostly Pro-Kirk",
    "description": "During an interview aired on Thursday’s broadcast of the Fox News Channel’s “The Story,” President Donald Trump responded to a question on whether TikTok is worth the damage its done to kids in light of some of the statements made\nThe post Trump on if TikTok’…",
    "link": "https://www.breitbart.com/clips/2025/09/18/trump-on-if-tiktoks-worth-damage-it-does-i-did-well-on-it-its-been-mostly-pro-kirk/",
    "timestamp": "2025-09-18T23:27:14Z"
  },
  {
    "title": "Trump Threatens Licenses of TV Stations That Criticize Him",
    "description": "President Donald Trump said US broadcast networks should face scrutiny over their licenses if they’re too critical of him, in what amounts to his furthest-reaching threat to media freedoms.\n“When you have a network and you have evening shows, and all they do …",
    "link": "https://biztoc.com/x/0200b18e13c99d38",
    "timestamp": "2025-09-18T23:24:22Z"
  },
  {
    "title": "Student’s Charlie Kirk Tribute Trashed By Peer – But He’s The One Suspended",
    "description": "A high school boy has been suspended after a female student took the MAGA hat from his head and threw it in the trash.",
    "link": "https://dailycaller.com/2025/09/18/students-charlie-kirk-tribute-trashed-by-peer-but-hes-the-one-suspended/",
    "timestamp": "2025-09-18T23:23:49Z"
  },
  {
    "title": "Canada, Mexico agree to deepen ties in face of Trump's turbulent 2nd term",
    "description": "Prime Minister Mark Carney and Mexican President Claudia Sheinbaum agreed to deepen ties between their two countries as both grapple with the uncertainty of a second Donald Trump presidency in the U.S.",
    "link": "https://www.cbc.ca/news/politics/canada-mexico-agree-new-partnership-1.7637709",
    "timestamp": "2025-09-18T23:23:08Z"
  },
  {
    "title": "Senate Confirms 48 Trump Nominees 51-47 Under Republican Nuclear Option Rules",
    "description": "Late last week, Senate Republicans invoked the \"nuclear option\" to push through President Trump's nominees, after Senate Democrats dragged their feet on votes. In discussions prior to this, Senate Majority Leader John Thune noted, \"It’s time to take steps to …",
    "link": "https://freerepublic.com/focus/f-news/4341428/posts",
    "timestamp": "2025-09-18T23:23:03Z"
  }
]