[
  {
    "title": "The group chats that changed America | Semafor",
    "description": "A loose private network on Signal and WhatsApp helped usher in the new alliance between Silicon Valley and Donald Trump’s new right.",
    "link": "https://www.semafor.com/article/04/27/2025/the-group-chats-that-changed-america",
    "timestamp": "2025-04-28T05:47:01Z"
  },
  {
    "title": "Nordic AI in Media Summit 2025: Five takeaways from this annual event on the future of news | Reuters Institute for the Study of Journalism",
    "description": "Journalists, academics and media executives gathered this week to discuss AI in a room formerly used to house a printing press. It was the third edition of the Nordic AI in Media Summit, hosted in Copenhagen by the Nordic AI Journalism Network. The initiative…",
    "link": "https://reutersinstitute.politics.ox.ac.uk/news/nordic-ai-media-summit-2025-five-takeaways-annual-event-future-news",
    "timestamp": "2025-04-28T05:47:01Z"
  },
  {
    "title": "Japan’s top gas buyer mulls joining Alaska LNG export project",
    "description": "\"We see Alaska as one of the promising procurement sources,” Naohiro Maekawa, an executive officer at Jera, said at a news conference on Monday.",
    "link": "https://www.japantimes.co.jp/business/2025/04/28/companies/jera-alaska-lng-project/",
    "timestamp": "2025-04-28T05:46:00Z"
  },
  {
    "title": "If the US Nuclear Umbrella Collapses, Will it Trigger a Euro-Bomb?",
    "description": "The Trump administration’s hostile attitude towards Western Europe—and the threat to pullout of the 32-member military alliance, the North Atlantic Treaty Organization (NATO) – signifies the danger of losing the longstanding protection of the US nuclear umbre…",
    "link": "https://www.ipsnews.net/2025/04/us-nuclear-umbrella-collapses-will-trigger-euro-bomb/",
    "timestamp": "2025-04-28T05:36:51Z"
  },
  {
    "title": "Trump’s Now You See Them, Now You Don’t Tariffs",
    "description": "The Trump tariff story keeps getting crazier. It may seem like ancient history now, but it was just over three weeks ago that Donald Trump gave us “Liberation Day,” a set of massive tariffs on imports from almost every country in the world, including the unin…",
    "link": "https://www.counterpunch.org/2025/04/28/trumps-now-you-see-them-now-you-dont-tariffs/",
    "timestamp": "2025-04-28T05:36:18Z"
  },
  {
    "title": "Plans to stockpile critical minerals will help Australia weather global uncertainty – and encourage smaller miners",
    "description": "Australia’s plan to build strategic reserves of critical minerals makes sense as the US and China vie for control of the minerals which will shape the future",
    "link": "https://theconversation.com/plans-to-stockpile-critical-minerals-will-help-australia-weather-global-uncertainty-and-encourage-smaller-miners-255320",
    "timestamp": "2025-04-28T05:33:09Z"
  },
  {
    "title": "Who loves Elon Musk? Tesla founder’s popularity plummets in U.S., poll shows just a third view him favorably",
    "description": "Elon Musk's public image has taken a hit, with favorability dropping from 41% to 33% according to a recent poll. His involvement in government downsizing efforts, particularly through the Department of Government Efficiency, has drawn criticism, with many bel…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/who-loves-elon-musk-tesla-founders-popularity-plummets-in-u-s-poll-shows-just-a-third-view-him-favorably/articleshow/120686182.cms",
    "timestamp": "2025-04-28T05:32:42Z"
  },
  {
    "title": "“It’s the age of unreason… You can tackle it in a Roger Waters style, but you’ll alienate people. Music should bring people together”: How Big Big Train took on modern issues in old ways on Grimspound",
    "description": "Released soon after Folklore, their 10th album merged mythology, astrology and astronomy to deliver Englishness to the world",
    "link": "https://www.loudersound.com/features/big-big-train-grimspound",
    "timestamp": "2025-04-28T05:32:00Z"
  },
  {
    "title": "China-based Huawei to test AI chip aiming to rival Nvidia: Report",
    "description": "Chinese tech giant Huawei has reportedly developed a powerful artificial intelligence chip that could rival high-end processors from US chip maker Nvidia.The Shenzhen-based Huawei is poised to start testing a new AI chip called the Ascend 910D, and has approa…",
    "link": "https://cointelegraph.com/news/china-based-huawei-to-test-ai-chip-aiming-to-rival-nvidia-repor",
    "timestamp": "2025-04-28T05:29:35Z"
  },
  {
    "title": "Trump wants interest rate cuts; be careful what you wish for!",
    "description": "President Donald Trump is pushing hard for interest rate cuts. He should be careful what he wishes for, because he is begging for more inflation. Literally. Trump started badgering Federal Reserve Chairman Jerome Powell about rate cuts even before his inaugur…",
    "link": "https://freerepublic.com/focus/f-news/4313704/posts",
    "timestamp": "2025-04-28T05:28:46Z"
  },
  {
    "title": "US in touch with India and Pakistan; urges work toward 'responsible solution'",
    "description": "In public, the US government has expressed support for India after the attack but has not criticised Pakistan.",
    "link": "https://www.thehindubusinessline.com/news/national/us-in-touch-with-india-and-pakistan-urges-work-toward-responsible-solution/article69500127.ece",
    "timestamp": "2025-04-28T05:27:32Z"
  },
  {
    "title": "Greenland's prime minister says island cannot be bought, US has 'not been respectful'",
    "description": "Greenland's Prime Minister Jens-Frederik Nielsen said comments from U.S. officials including President Donald Trump about the island have been disrespectful.",
    "link": "https://www.foxnews.com/world/greenlands-prime-minister-says-island-cannot-bought-us-has-not-been-respectful",
    "timestamp": "2025-04-28T05:26:37Z"
  },
  {
    "title": "Nobel laureates urge Trump, Putin to meet on denuclearization",
    "description": "Three groups campaigning for the elimination of nuclear weapons, including Japan's Nihon Hidankyo, say the situation has become the most volatile in decades.",
    "link": "https://www.japantimes.co.jp/news/2025/04/28/japan/hidankyo-urges-trump-putin-meeting/",
    "timestamp": "2025-04-28T05:24:00Z"
  },
  {
    "title": "Austrian far right triples its vote in Vienna election",
    "description": "In today’s edition of The Capitals, read about how Germany has become Europe’s top defence spender according to SIPRI arms data, Meloni’s push for a mediator role following the Vatican funeral, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-austrian-far-right-triples-its-vote-in-vienna-election/",
    "timestamp": "2025-04-28T05:22:23Z"
  },
  {
    "title": "With China and the US at intense economic odds, nations are being forced to choose sides",
    "description": "One went to the United States",
    "link": "https://abcnews.go.com/Business/wireStory/china-us-intense-economic-odds-nations-forced-choose-121227643",
    "timestamp": "2025-04-28T05:18:33Z"
  },
  {
    "title": "China shrugs off threat of US tariffs to economy, says it has tools to protect jobs",
    "description": "China's leaders have shrugged off the potential impact from U.S. President Donald Trump's trade war, saying they have the tools needed to protect jobs and limit damage from higher tariffs on Chinese exports",
    "link": "https://abcnews.go.com/Business/wireStory/china-shrugs-off-threat-us-tariffs-economy-tools-121229086",
    "timestamp": "2025-04-28T05:18:31Z"
  },
  {
    "title": "US-Iran nuclear talks progressing well, Trump tells reporters",
    "description": "The third round of US-Iran nuclear talks are progressing well, US President Donald Trump told reporters on Sun",
    "link": "https://www.jpost.com/breaking-news/article-851763",
    "timestamp": "2025-04-28T05:18:15Z"
  },
  {
    "title": "Why stock market is up today? Sensex surges over 800 pts; Nifty above 24,250; 5 factors behind today's rally",
    "description": "Indian markets soared, with Sensex surpassing 80,000, fueled by Reliance Industries' strong earnings and positive Asian market cues. FII buying, a weakening dollar, and lower crude oil prices further boosted investor sentiment. Despite India-Pakistan tensions…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-up-today-sensex-surges-over-800-pts-nifty-above-24250-5-factors-behind-todays-rally/articleshow/120685328.cms",
    "timestamp": "2025-04-28T05:18:10Z"
  },
  {
    "title": "China says on 'right side of history' in trade standoff with US",
    "description": "BEIJING: A top Chinese economic official on Monday (Apr 28) said Beijing was on the \"right side of history\" in its gruelling trade war with the United States. Since returning to the presidency in January, US President Donald Trump has",
    "link": "https://www.channelnewsasia.com/east-asia/china-says-right-side-history-trade-standoff-us-5093856",
    "timestamp": "2025-04-28T05:17:54Z"
  },
  {
    "title": "Trump thinks Zelensky ready to give up Crimea to Russia",
    "description": "U.S. President Donald Trump said he believed Ukrainian President Volodymyr Zelensky was ready to concede Crimea to Russia as part of any ceasefire deal, as talks on a truce entered what Washington called a critical week on Monday.",
    "link": "https://www.hurriyetdailynews.com/trump-thinks-zelensky-ready-to-give-up-crimea-to-russia-208548",
    "timestamp": "2025-04-28T05:16:53Z"
  },
  {
    "title": "Costa: Bulgaria can play a key role in European defence",
    "description": "European Council President was on a three-day visit to Bulgaria while US president’s son Donald Trump Jr. also arrived in Sofia.",
    "link": "https://biztoc.com/x/0ababbd7f92409e8",
    "timestamp": "2025-04-28T05:14:15Z"
  },
  {
    "title": "ECB faces complex meeting in June, Dutch central bank governor Knot says in FD report",
    "description": "AMSTERDAM (Reuters) -The European Central Bank's next policy meeting will be complex, as policymakers need to balance the uncertainty around inflation risks ...",
    "link": "https://finance.yahoo.com/news/ecb-faces-complex-meeting-june-051142779.html",
    "timestamp": "2025-04-28T05:11:42Z"
  },
  {
    "title": "Costa: Bulgaria can play a key role in European defence",
    "description": "European Council President was on a three-day visit to Bulgaria while US president’s son Donald Trump Jr. also arrived in Sofia.",
    "link": "https://www.euractiv.com/section/politics/news/costa-bulgaria-can-play-a-key-role-in-european-defence/",
    "timestamp": "2025-04-28T05:08:20Z"
  },
  {
    "title": "Time to add silver to your portfolio? With silver undervalued, here’s why this is the right time to invest",
    "description": "With rising geopolitical tensions and central banks aggressively accumulating precious metals, sceptics may need to reconsider the role of gold and silver. If the commodity supercycle thesis does play out, both metals could see significant appreciation in the…",
    "link": "https://economictimes.indiatimes.com/wealth/invest/time-to-add-silver-to-your-portfolio-with-silver-undervalued-heres-why-this-is-the-right-time-to-invest/articleshow/120636180.cms",
    "timestamp": "2025-04-28T05:07:17Z"
  },
  {
    "title": "Crude oil futures gain despite US-China trade war uncertainty",
    "description": "Crude oil futures rise amid US-China trade war uncertainty, impacting global commodity prices and market dynamics.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-gain-despite-us-china-trade-war-uncertainty/article69500025.ece",
    "timestamp": "2025-04-28T04:58:37Z"
  },
  {
    "title": "80% of small businesses that buy from China could 'just die' because of Trump's tariffs, says logistics company CEO",
    "description": "Ryan Petersen said a lot of what Americans buy from China is \"discretionary spend\" — optional items that can be replaced if they become expensive.",
    "link": "https://www.businessinsider.com/small-businesses-buying-importing-china-face-bankruptcy-trump-tariff-2025-4",
    "timestamp": "2025-04-28T04:58:35Z"
  },
  {
    "title": "Gay Choreographer Really Pops + Cyndi Lauper Is A Rock Hall Of Fame Inductee + J.B. Pritzker Brings The Heat In N.H. + MORE! — 6-PACK",
    "description": "Gay Choreographer Really Pops + Cyndi Lauper Is A Rock Hall Of Fame Inductee + J.B. Pritzker Brings The Heat In N.H. + MORE! — 6-PACK",
    "link": "https://www.boyculture.com/boy_culture/2025/04/pritzker-cyndi-lauper-gay-indelicato-hacks.html",
    "timestamp": "2025-04-28T04:57:06Z"
  },
  {
    "title": "Trump’s polls decline near 100-day mark, raising tax-plan stakes",
    "description": "Polls show that voters perceive Trump to be falling short on his core campaign promise to strengthen the economy.",
    "link": "https://www.japantimes.co.jp/news/2025/04/28/world/politics/trump-polls-100-day-tax-plan/",
    "timestamp": "2025-04-28T04:55:00Z"
  },
  {
    "title": "Asian markets mixed as investors eye trade talks",
    "description": "HONG KONG: Asian stocks were mixed on Monday (Apr 28) as investors assess how the land lies on the trade war front with countries seeking to temper Donald Trump's eye-watering tariffs. Investors were also keeping tabs on China after President Xi Jinping and o…",
    "link": "https://www.channelnewsasia.com/business/asian-markets-mixed-investors-eye-trade-talks-5093696",
    "timestamp": "2025-04-28T04:53:21Z"
  },
  {
    "title": "Meloni pushes for mediator role after Vatican funeral",
    "description": "After Pope Francis’s funeral Meloni and Ursula von der Leyen spoke Saturday evening to discuss major transatlantic challenges.",
    "link": "https://www.euractiv.com/section/politics/news/meloni-pushes-for-mediator-role-after-vatican-funeral/",
    "timestamp": "2025-04-28T04:52:43Z"
  },
  {
    "title": "Trump, China ramp up Panama Canal pressure with Li deal in limbo",
    "description": "China dialed up scrutiny of Hong Kong billionaire Li Ka-shing’s planned Panama ports sale to a BlackRock Inc.-backed group while Donald Trump sought preferential treatment for U.S. ships in the waterway, adding to uncertainty over whether the blockbuster deal…",
    "link": "https://biztoc.com/x/2dc9e1df859f7c23",
    "timestamp": "2025-04-28T04:51:48Z"
  },
  {
    "title": "North Korea confirms it sent troops to Russia to support its war against Ukraine",
    "description": "The North Korean announcement came two days after Russia said its troops have fully reclaimed the Kursk region. Ukrainian officials denied the claim.",
    "link": "https://www.npr.org/2025/04/28/nx-s1-5379436/north-korea-russia-ukraine-troops-putin-kim",
    "timestamp": "2025-04-28T04:46:16Z"
  },
  {
    "title": "Romanian far-right rides TikTok wave in election re-run",
    "description": "BUCHAREST - With 1.3 million followers, a Donald Trump-supporting far-right candidate is riding a wave of popularity on TikTok ahead of the re-run of Romania's presidential election in which he is expected to win Sunday's first round.",
    "link": "https://www.bangkokpost.com/world/3012890/romanian-far-right-rides-tiktok-wave-in-election-re-run",
    "timestamp": "2025-04-28T04:45:00Z"
  },
  {
    "title": "'Welcome To Thunderdome': Inside 100 Days Of Donald Trump In Office",
    "description": "Trump faces the enormous challenge of implementing the cavalcade of executive orders he has enacted, a task that is likely to be especially daunting when the ranks of staff remain thin at key agencies.",
    "link": "https://www.ndtv.com/world-news/welcome-to-thunderdome-inside-100-days-of-donald-trump-in-office-8274454",
    "timestamp": "2025-04-28T04:44:39Z"
  },
  {
    "title": "BRICS set to meet over Trump trade policies",
    "description": "Senior diplomats from BRICS nations are convening in Brazil to strategize a unified response to escalating trade tensions fueled by US President Donald Trump's protectionist policies. The meeting occurs amidst concerns over the global economic impact of these…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/brics-set-to-meet-over-trump-trade-policies/articleshow/120684148.cms",
    "timestamp": "2025-04-28T04:44:20Z"
  },
  {
    "title": "Taiwan's export momentum at risk of slowing; second half of 2025 will be crucial",
    "description": "According to the Taiwan Institute of Economic Research, since President Donald Trump took office, the US has imposed tariffs on multiple countries and a range of products, with plans to extend these tariffs to sectors like semiconductors, pharmaceuticals, and…",
    "link": "https://www.digitimes.com/news/a20250428PD225/taiwan-exports-semiconductors-ai-2025.html",
    "timestamp": "2025-04-28T04:39:17Z"
  },
  {
    "title": "Chinese firms turn to Indian exporters to help fill US orders",
    "description": "Some China-based firms hit hard by US tariffs are reaching out to Indian exporters to fill orders on their behalf and help them retain their American customers as they navigate a trade war causing seismic shocks in global commerce.",
    "link": "https://www.bangkokpost.com/business/general/3012875/chinese-firms-turn-to-indian-exporters-to-help-fill-us-orders",
    "timestamp": "2025-04-28T04:32:00Z"
  },
  {
    "title": "South Korea presidential candidate Lee Jae-myung pledges chip tax credit",
    "description": "SEOUL: South Korea's Democratic Party presidential candidate Lee Jae-myung pledged in a Facebook post on Monday (Apr 28) to bring in a production tax credit of up to 10 per cent for semiconductors manufactured and sold domestically, if he is elected. Lee is t…",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-presidential-candidate-lee-jae-myung-pledges-chip-tax-credit-5093791",
    "timestamp": "2025-04-28T04:31:03Z"
  },
  {
    "title": "Canada Is Aggressively Attacking U.S. Trade, Farmers And Workers",
    "description": "Canada has one of the most protectionist economies among developed nations. It particularly targets American farmers, media, and manufacturers. That may be why Donald Trump launched his counterattack on trade offenders with a 25% tariff on many imports from C…",
    "link": "https://freerepublic.com/focus/f-news/4313701/posts",
    "timestamp": "2025-04-28T04:30:59Z"
  },
  {
    "title": "India positioned as top EM winner in US trade reset: Ed Yardeni",
    "description": "In the current situation, we have Trump going into the room by himself and coming out every now and then and telling us that things will be okay. So, we have to kind of conclude that it is in both countries interests to come up with some accommodation and so …",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/india-positioned-as-top-em-winner-in-us-trade-reset-ed-yardeni/articleshow/120683740.cms",
    "timestamp": "2025-04-28T04:30:58Z"
  },
  {
    "title": "Trump’s trade war puts Singapore’s economic growth, jobs and wages at risk, says MAS",
    "description": "Inflation which is already down to a four-year low will remain modest amid weakening growth outlook Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/trumps-trade-war-puts-singapores-economic-growth-jobs-and-wages-at-risk-says-mas",
    "timestamp": "2025-04-28T04:23:54Z"
  },
  {
    "title": "More Aussie sheep meat will be sent to China as trade wars continue",
    "description": "China grants access to more Australian lamb and mutton as it looks for other markets during the trade war with US President Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-04-28/more-sheep-and-goat-meat-to-be-sent-to-china-amid-trade-wars/105223046",
    "timestamp": "2025-04-28T04:22:48Z"
  },
  {
    "title": "Canada might be the second election Trump wins in six months",
    "description": "When Canada goes to the polls, it might be the second election Donald Trump wins in six months.",
    "link": "https://news.sky.com/story/canada-might-be-the-second-election-trump-wins-in-six-months-13357362",
    "timestamp": "2025-04-28T04:19:00Z"
  },
  {
    "title": "Singapore negotiating for U.S. concessions on pharmaceuticals, chips",
    "description": "Singapore is negotiating concessions for pharmaceutical exports and ensuring access to high-end AI chips, said Trade and Deputy Prime Minister Gan Kim Yong.",
    "link": "https://www.cnbc.com/2025/04/28/singapore-negotiating-for-us-concessions-on-pharmaceuticals-chips.html",
    "timestamp": "2025-04-28T04:18:13Z"
  },
  {
    "title": "Canada votes in pivotal election transformed by Trump",
    "description": "The US president came to dominate on the campaign trail, with the contest being viewed as a referendum on how Canada should engage with him.",
    "link": "https://www.bbc.com/news/articles/c5ylzkzxkndo",
    "timestamp": "2025-04-28T04:17:52Z"
  },
  {
    "title": "Trump Starts Making Demands After Another Wild GOP Town Hall",
    "description": "Donald Trump thinks it’s time for Republican lawmakers to stop playing nice with town hall disruptors. The president told Republican lawmakers to take a...",
    "link": "https://www.thedailybeast.com/trump-starts-making-demands-after-another-wild-gop-town-hall/",
    "timestamp": "2025-04-28T04:13:24Z"
  },
  {
    "title": "RIL, bank stocks propel Sensex over 700 points higher, Nifty above 24,200",
    "description": "Indian markets saw a positive start on Monday. This was fueled by strong earnings from Reliance Industries. Asian markets also provided a boost. Investors are closely monitoring India-Pakistan tensions after the Pahalgam terror attack. Reliance Industries, Ma…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-bank-stocks-propel-sensex-over-500-points-higher-nifty-above-24150/articleshow/120683088.cms",
    "timestamp": "2025-04-28T04:08:52Z"
  },
  {
    "title": "Music promoters turn to other platforms besides TikTok to invest in as part of a broader creator playbook",
    "description": "With TikTok’s future hanging in the balance, music promoters are widening their focus from TikTok to creators on other short-form video platforms such as Instagram and YouTube.\nAlthough President Donald Trump extended the deadline for the government-mandated …",
    "link": "https://biztoc.com/x/cd3d51e601aa70cd",
    "timestamp": "2025-04-28T04:08:14Z"
  },
  {
    "title": "With China and the US at intense economic odds, nations are being forced to choose sides",
    "description": "WASHINGTON (AP) — One went to the United States. The other went to China. It was a sign of the times. While the Swiss president was in Washington last week to lobby U.S. officials over President Donald Trump’s threatened 31% tariff on Swiss goods, the Swiss f…",
    "link": "https://financialpost.com/pmn/with-china-and-the-us-at-intense-economic-odds-nations-are-being-forced-to-choose-sides",
    "timestamp": "2025-04-28T04:05:48Z"
  },
  {
    "title": "What’s Preventing a United Front against the Trump Regime?",
    "description": "( Tomdispatch.com) - America desperately needs a united front to restrain the wrecking ball of the Trump regime. While outraged opposition has been visible and vocal, it remains a far cry from developing a capacity to protect what’s left of democracy in the U…",
    "link": "https://www.juancole.com/2025/04/preventing-united-against.html",
    "timestamp": "2025-04-28T04:04:10Z"
  },
  {
    "title": "At least 8 killed in latest US air attacks on Yemen’s capital, Saana",
    "description": "Latest US strikes bring the death toll in Yemen since mid-March to more than 220 people.",
    "link": "https://www.aljazeera.com/news/2025/4/28/at-least-8-killed-in-latest-us-air-attacks-on-yemens-capital-saana",
    "timestamp": "2025-04-28T04:03:31Z"
  },
  {
    "title": "On Iran, America’s Tough Talk Masks a More Sensible Approach",
    "description": "President Trump is trying to craft a deal that Tehran can accept. \nThe post On Iran, America’s Tough Talk Masks a More Sensible Approach appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/on-iran-americas-tough-talk-masks-a-more-sensible-approach/",
    "timestamp": "2025-04-28T04:03:00Z"
  },
  {
    "title": "Music promoters turn to other platforms besides TikTok to invest in as part of a broader creator playbook",
    "description": "Music promotion on Instagram Reels and YouTube Shorts is ramping up in the wake of the TikTok ban situation.",
    "link": "http://digiday.com/media/music-promoters-turn-to-other-platforms-besides-tiktok-to-invest-in-as-part-of-a-broader-creator-playbook/",
    "timestamp": "2025-04-28T04:01:00Z"
  },
  {
    "title": "Ukraine’s Worst Day: Zelensky Rejects Trump’s Peace Plan",
    "description": "Ukrainians may remember two days that just passed as two of the worst days in their history. It has been evident since long before Donald Trump and JD Vance were elected that the war in Ukraine would one day end with a diplomatic settlement that was based on,…",
    "link": "https://original.antiwar.com/ted_snider/2025/04/27/ukraines-worst-day-zelensky-rejects-trumps-peace-plan/",
    "timestamp": "2025-04-28T04:00:36Z"
  },
  {
    "title": "Germany is now Europe’s top defence spender, says SIPRI arms data",
    "description": "The deployment of a €100 billion special budget for military gear has propelled Berlin to the top of the table in Europe.",
    "link": "https://www.euractiv.com/section/defence/news/germany-is-now-europes-top-defence-spender-says-sipri-arms-data/",
    "timestamp": "2025-04-28T04:00:29Z"
  },
  {
    "title": "Trump Could Put Hillary Clinton in Charge of Immigration",
    "description": "Watching legacy media might give one the impression that President Donald Trump is cleaning house, deporting the tens of millions of illegal aliens allowed into America during the terms of all recent past presidents.\r\n\r\nAnd that border czar Tom Homan...",
    "link": "https://www.americanthinker.com/articles/2025/04/trump_could_put_hillary_clinton_in_charge_of_immigration.html",
    "timestamp": "2025-04-28T04:00:00Z"
  },
  {
    "title": "Time to post the rest of China’s dirty COVID-19 secret",
    "description": "During a five month period in 1888, Jack the Ripper became infamous for murdering five women in the streets of London. It has taken almost fourteen decades for the DNA from blood found on the shawl of one of the victims for a match to be made with a ...",
    "link": "https://www.americanthinker.com/blog/2025/04/time_to_post_the_rest_of_china_s_dirty_covid_19_secret.html",
    "timestamp": "2025-04-28T04:00:00Z"
  },
  {
    "title": "Démarche to Europe: The Harder You Push Us, the More We Push Back",
    "description": "Newsflash to my European friends -- the more you criticize America and the more you marginalize Americans, the quicker you will push the U.S. away from the global stage and closer towards a new form of isolationism and nationalism.\r\n\r\nOne of the sad ...",
    "link": "https://www.americanthinker.com/articles/2025/04/memo_to_europe_the_harder_you_push_us_the_more_we_push_back.html",
    "timestamp": "2025-04-28T04:00:00Z"
  },
  {
    "title": "Democrats are out of control on terrorism and immigration",
    "description": "The leftists at the Associated Press recently reported on a Jihad attack conducted in the Indian state of Jammu and Kashmir, long a hotbed of Jihadi activity.\r\n\r\nThe AP reported that “assailants indiscriminately fired at tourists visiting a bea...",
    "link": "https://www.americanthinker.com/blog/2025/04/democrats_are_out_of_control_on_terrorism_and_immigration.html",
    "timestamp": "2025-04-28T04:00:00Z"
  },
  {
    "title": "Illinois Governor Pritzker’s not-very-subtle encouragement of political violence",
    "description": "Honest people understand that what happened on January 6, 2021, was not an “insurrection,” but was, instead, a protest that got out of hand (and, perhaps, was helped to get out of hand by shadowy activists whom the FBI never pursued). Now...",
    "link": "https://www.americanthinker.com/blog/2025/04/illinois_governor_pritzker_s_not_very_subtle_encouragement_of_political_violence.html",
    "timestamp": "2025-04-28T04:00:00Z"
  },
  {
    "title": "Asian shares inch higher as uncertainty over US tariffs persists",
    "description": "HONG KONG (AP) — Asian markets inched higher in cautious trading on Monday as investors watched to see what may come of negotiations over U.S. President Donald Trump’s tariffs. U.S. futures fell and oil prices were little changed. Shares in China fell despite…",
    "link": "https://financialpost.com/pmn/asian-shares-inch-higher-as-uncertainty-over-us-tariffs-persists",
    "timestamp": "2025-04-28T03:59:40Z"
  },
  {
    "title": "John Murry on being abused: ‘Those experiences as a teenager made me angry and they made me write. They gave me a lot of rage’",
    "description": "Singular US musician and former resident of Ireland is the subject of a fine documentary, The Graceless Age: The Ballad of John Murry",
    "link": "https://www.irishtimes.com/culture/film/2025/04/28/john-murry-on-being-abused-those-experiences-as-a-teenager-made-me-angry-and-they-made-me-write-they-gave-me-a-lot-of-rage/",
    "timestamp": "2025-04-28T03:59:00Z"
  },
  {
    "title": "We Can Always Count on Canada to Make the Wrong Choice",
    "description": "Our neighbor to the north has a lot going for it. Beautiful scenery, some decent food (if you like poutine), a few decent beers, and great hunting and fishing. But their voting patterns? Hoo boy. Now, after some months where we were hoping the Conservatives m…",
    "link": "https://freerepublic.com/focus/f-news/4313697/posts",
    "timestamp": "2025-04-28T03:54:25Z"
  },
  {
    "title": "Trade tensions take flight: Trump tariffs spark China retaliation against Boeing",
    "description": "Following US President Donald Trump's executive orders implementing reciprocal tariff measures, the China-US trade war has escalated rapidly. China's response now extends beyond traditional trade items to impact the civil aviation industry, showing a more for…",
    "link": "https://www.digitimes.com/news/a20250428PD208/donald-trump-aircraft-war-airbus-comac.html",
    "timestamp": "2025-04-28T03:53:56Z"
  },
  {
    "title": "100 days of DOGE: lots of chaos, not so much efficiency",
    "description": "\"DOGE is not a serious exercise,\" said Jessica Riedl, a fellow at the Manhattan Institute, a fiscally conservative think tank that supports streamlining government.",
    "link": "https://www.japantimes.co.jp/news/2025/04/28/world/politics/100-days-doge-chaos-efficiency/",
    "timestamp": "2025-04-28T03:52:00Z"
  },
  {
    "title": "Bitcoin acts like ‘store of value that it is’ amid Trump policy chaos: NYDIG",
    "description": "Bitcoin is starting to act as a store of value during times of “US-risk-off” sentiment, marking a potential shift in its relationship with traditional assets, according to the New York Digital Investment Group.Bitcoin (BTC) felt “noticeably different” over th…",
    "link": "https://cointelegraph.com/news/bitcoin-acts-store-of-value-amid-trump-policy-chaos-nydig",
    "timestamp": "2025-04-28T03:47:05Z"
  },
  {
    "title": "Greenland strengthens ties with Denmark amid Trump's interest in controlling territory",
    "description": "Greenland's new prime minister visits Denmark following months of tension over the US president's repeated declarations that the territory should become part of the United States.",
    "link": "https://www.abc.net.au/news/2025-04-28/green-and-denmark-affirm-alliance-amid-trumps-interest/105224180",
    "timestamp": "2025-04-28T03:44:55Z"
  },
  {
    "title": "US urges India and Pakistan to work towards a 'responsible solution' as tensions escalate after Pahalgam attack",
    "description": "Following the Pahalgam attack in Kashmir, the U.S. State Department has urged India and Pakistan to seek a responsible resolution, reaffirming its support for India and condemning the terrorist act. Amidst rising tensions and ceasefire violations, the Nationa…",
    "link": "https://economictimes.indiatimes.com/news/india/us-urges-india-and-pakistan-to-work-towards-a-responsible-solution-as-tensions-escalate-after-pahalgam-attack/articleshow/120682785.cms",
    "timestamp": "2025-04-28T03:41:45Z"
  },
  {
    "title": "Sources: leaders at both Paramount and Skydance came to believe the FCC would not bless their merger until CBS had settled its fight with Trump over 60 Minutes (Bloomberg)",
    "description": "Bloomberg:\nSources: leaders at both Paramount and Skydance came to believe the FCC would not bless their merger until CBS had settled its fight with Trump over 60 Minutes  —  Shari Redstone wanted to know what 60 Minutes was going to say next about President …",
    "link": "https://mediagazer.com/250427/p7",
    "timestamp": "2025-04-28T03:38:16Z"
  },
  {
    "title": "European bloc turns to Southeast Asia in bid to hedge protectionism",
    "description": "KUALA LUMPUR -- A European bloc comprising Iceland, Liechtenstein, Norway and Switzerland is doubling down on Malaysia and other Southeast Asian economies as strategic partners, seeking to hedge against resurgent U.S. protectionism under President Donald Trum…",
    "link": "https://biztoc.com/x/4e5451ea299da14a",
    "timestamp": "2025-04-28T03:34:43Z"
  },
  {
    "title": "ETMarkets Smart Talk: Investor bearishness at highest levels since 2009, says Chakri Lokapriya",
    "description": "Fear is the driving force in the market rather than valuations. The 90 day pause on tariffs gives countries to reach bilateral agreements with the US and hence FY26 is likely to be very volatile.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-investor-bearishness-at-highest-levels-since-2009-says-chakri-lokapriya/articleshow/120663224.cms",
    "timestamp": "2025-04-28T03:31:00Z"
  },
  {
    "title": "Westpac’s chief economist tells home ownes to ‘lock in’ interest rate cut in May",
    "description": "Households will get a rate cut in May regardless of April’s inflation reading, one major bank’s chief economist has boldly declared.",
    "link": "https://thenightly.com.au/business/westpacs-chief-economist-tells-home-ownes-to-lock-in-interest-rate-cut-in-may-c-18510263",
    "timestamp": "2025-04-28T03:29:56Z"
  },
  {
    "title": "Over 100 undocumented immigrants detained at 'underground nightclub' in Colorado, DEA says",
    "description": "An estimated 114 undocumented immigrants were detained at an \"underground nightclub\" in Colorado following a U.S. Drug Enforcement raid, officials said.",
    "link": "https://www.nbcnews.com/news/us-news/undocumented-immigrants-detained-underground-nightclub-colorado-rcna203234",
    "timestamp": "2025-04-28T03:28:00Z"
  },
  {
    "title": "Romania far-right rides TikTok wave in election re-run",
    "description": "With 1.3 million followers, a Donald Trump-supporting far-right candidate is riding a wave of popularity on TikTok ahead of the re-run of Romania’s presidential election in which he is expected to win Sunday’s first round. Authorities are keen to avoid a repe…",
    "link": "https://www.digitaljournal.com/social-media/romania-far-right-rides-tiktok-wave-in-election-re-run/article",
    "timestamp": "2025-04-28T03:27:49Z"
  },
  {
    "title": "Romania far-right rides TikTok wave in election re-run",
    "description": "With 1.3 million followers, a Donald Trump-supporting far-right candidate is riding a wave of popularity on TikTok ahead of the re-run of Romania’s presidential election in which he is expected to win Sunday’s first round. Authorities are keen to avoid a repe…",
    "link": "https://www.digitaljournal.com/world/romania-far-right-rides-tiktok-wave-in-election-re-run/article",
    "timestamp": "2025-04-28T03:27:49Z"
  },
  {
    "title": "Romania Far-right Rides TikTok Wave In Election Re-run",
    "description": "With 1.3 million followers, a Donald Trump-supporting far-right candidate is riding a wave of popularity on TikTok ahead of the re-run of Romania's presidential election in which he is expected to win Sunday's first round.",
    "link": "https://www.ibtimes.com/romania-far-right-rides-tiktok-wave-election-re-run-3771590",
    "timestamp": "2025-04-28T03:27:16Z"
  },
  {
    "title": "Romania Far-right Rides TikTok Wave In Election Re-run",
    "description": "With 1.3 million followers, a Donald Trump-supporting far-right candidate is riding a wave of popularity on TikTok ahead of the re-run of Romania's presidential election in which he is expected to win Sunday's first round.",
    "link": "https://www.ibtimes.com.au/romania-far-right-rides-tiktok-wave-election-re-run-1858293",
    "timestamp": "2025-04-28T03:27:12Z"
  },
  {
    "title": "A new atomic arms race is stirring and the world is growing more dangerous",
    "description": "Eighty years after Hiroshima and Nagasaki, a new nuclear arms race is brewing, fueled by Trump's trade war and threats to withdraw US defense commitments. Asian nations, once reliant on US deterrence, are now considering developing their own arsenals, increas…",
    "link": "https://economictimes.indiatimes.com/news/defence/nuclear-weapon-trump-tariff-impact-trade-war-a-new-atomic-arms-race-is-stirring-and-the-world-is-growing-more-dangerous/articleshow/120682617.cms",
    "timestamp": "2025-04-28T03:23:12Z"
  },
  {
    "title": "A new atomic arms race is stirring and the world is growing more dangerous",
    "description": "Eighty years after Hiroshima and Nagasaki, a new nuclear arms race is brewing, fueled by Trump's trade war and threats to withdraw US defense commitments. Asian nations, once reliant on US deterrence, are now considering developing their own arsenals, increas…",
    "link": "https://economictimes.indiatimes.com/news/defence/nuclear-weapon-trump-tariff-impact-trade-war-a-new-atomic-arms-race-is-stirring-and-the-world-is-growing-more-dangerous/articleshow/120682529.cms",
    "timestamp": "2025-04-28T03:23:12Z"
  },
  {
    "title": "‘Calmer’ Zelensky requested ‘more weapons’ in Vatican – Trump",
    "description": "US President Donald Trump said that Vladimir Zelensky behaved “calmer” in Vatican than during their infamous encounter in the Oval Office Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616410-trump-zelensky-vatican-calmer-weapons/",
    "timestamp": "2025-04-28T03:17:57Z"
  },
  {
    "title": "Trump thinks Zelensky ready to give up Crimea to Russia",
    "description": "President Trump believes Zelensky is open to ceding Crimea to Russia for a ceasefire, a claim Ukraine has repeatedly denied. Trump urges Putin to end the war, hinting at a potential deal. However, the White House warns it might withdraw as a broker if progres…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-thinks-zelensky-ready-to-give-up-crimea-to-russia/articleshow/120682505.cms",
    "timestamp": "2025-04-28T03:13:44Z"
  },
  {
    "title": "Last Day Of Canada Election Campaign Jolted By Vancouver Attack",
    "description": "Canadian leaders made their final push for votes Sunday, one day before an election dominated by US President Donald Trump's policies, but rattled in the campaign's final hours by a deadly car-ramming attack in Vancouver.",
    "link": "https://www.ibtimes.com.au/last-day-canada-election-campaign-jolted-vancouver-attack-1858290",
    "timestamp": "2025-04-28T03:12:13Z"
  },
  {
    "title": "Romania Presidential Election Re-run Under Trump Shadow",
    "description": "Five months after the shock scrapping of presidential elections, Romanians go back to the polls on Sunday -- with a key far-right contender excluded and criticism by the US administration looming over the tense vote.",
    "link": "https://www.ibtimes.com/romania-presidential-election-re-run-under-trump-shadow-3771588",
    "timestamp": "2025-04-28T03:06:17Z"
  },
  {
    "title": "Romania Presidential Election Re-run Under Trump Shadow",
    "description": "Five months after the shock scrapping of presidential elections, Romanians go back to the polls on Sunday -- with a key far-right contender excluded and criticism by the US administration looming over the tense vote.",
    "link": "https://www.ibtimes.com.au/romania-presidential-election-re-run-under-trump-shadow-1858287",
    "timestamp": "2025-04-28T03:06:07Z"
  },
  {
    "title": "Pope Francis Funeral: Lip reader reveals what Donald Trump and Volodymyr Zelenskyy discussed",
    "description": "At Pope Francis's funeral, world leaders engaged in significant diplomatic interactions. Donald Trump met with Volodymyr Zelenskyy, their first face-to-face since February, with a lip reader suggesting Trump warned Emmanuel Macron during their exchange. Trump…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/pope-francis-funeral-lip-reader-reveals-what-donald-trump-and-volodymyr-zelenskyy-discussed/articleshow/120682271.cms",
    "timestamp": "2025-04-28T03:05:11Z"
  },
  {
    "title": "Romania presidential election re-run under Trump shadow",
    "description": "Five months after the shock scrapping of presidential elections, Romanians go back to the polls on Sunday — with a key far-right contender excluded and criticism by the US administration looming over the tense vote. Thousands in Romania have protested against…",
    "link": "https://www.digitaljournal.com/world/romania-presidential-election-re-run-under-trump-shadow/article",
    "timestamp": "2025-04-28T03:03:24Z"
  },
  {
    "title": "Romania presidential election re-run under Trump shadow",
    "description": "Five months after the shock scrapping of presidential elections, Romanians go back to the polls on Sunday — with a key far-right contender excluded and criticism by the US administration looming over the tense vote. Thousands in Romania have protested against…",
    "link": "https://www.digitaljournal.com/news/romania-presidential-election-re-run-under-trump-shadow/article",
    "timestamp": "2025-04-28T03:03:24Z"
  },
  {
    "title": "The many possible reasons there are so few U.S. cars in Japan",
    "description": "One reason is size, with American cars tending to be larger and not generally suited for driving in busy cities with many narrow roads, such as Tokyo.",
    "link": "https://www.japantimes.co.jp/business/2025/04/28/economy/few-us-cars-japan/",
    "timestamp": "2025-04-28T03:03:00Z"
  },
  {
    "title": "In Trump’s Naked America-The Tariff Man Is Taking Our Clothes",
    "description": "Apparel and footwear retail stores are in serious trouble as orders cancel or reduce in advance of the all-important fall shopping season. Tariffs are bad for business.",
    "link": "https://www.forbes.com/sites/rickhelfenbein/2025/04/27/in-trumps-naked-america-the-tariff-man-is-taking-our-clothes/",
    "timestamp": "2025-04-28T03:01:11Z"
  },
  {
    "title": "Trump promised a markets boom. 100 days in, stocks have only seen damage",
    "description": "The S&P 500 Index is down about 8% since his inauguration and on track for its worst run during a president’s first 100 days since Gerald Ford.",
    "link": "https://www.japantimes.co.jp/business/2025/04/28/economy/trump-markets-100-days-stocks/",
    "timestamp": "2025-04-28T02:59:00Z"
  },
  {
    "title": "Trump Says Zelensky Asked for More Weapons at Rome Meeting",
    "description": "US president noted that \"he's been saying that for three years\"NEW YORK, April 28. /TASS/. Vladimir Zelensky asked US President Donald Trump to supply more weapons to Ukraine at their April 26 meeting in Rome, the US leader said. \"He told me that he needs mor…",
    "link": "https://freerepublic.com/focus/f-news/4313685/posts",
    "timestamp": "2025-04-28T02:58:43Z"
  },
  {
    "title": "Asian Markets Mixed As Investors Eye Trade Talks",
    "description": "Asian stocks were mixed Monday as investors assess how the land lies on the trade war front with countries seeking to temper Donald Trump's eye-watering tariffs.",
    "link": "https://www.ibtimes.com/asian-markets-mixed-investors-eye-trade-talks-3771586",
    "timestamp": "2025-04-28T02:57:20Z"
  },
  {
    "title": "Asian markets mixed as investors eye trade talks",
    "description": "Asian stocks were mixed Monday as investors assess how the land lies on the trade war front with countries seeking to temper Donald Trump’s eye-watering tariffs. Investors were also keeping tabs on China after President Xi Jinping and other top leaders last w…",
    "link": "https://www.digitaljournal.com/world/asian-markets-mixed-as-investors-eye-trade-talks/article",
    "timestamp": "2025-04-28T02:52:33Z"
  },
  {
    "title": "Russia launches major drone attack on Ukraine despite 'productive' Vatican City Meeting",
    "description": "Washington DC (UPI) Apr 27, 2025 \n\n\n On the heels of a private meeting between President Donald Trump and Ukrainian President Volodymyr Zelensky while attending the funeral for Pope Francis in Vatican City, Moscow attacked Kyiv with 149 drones, Ukraine report…",
    "link": "https://www.spacewar.com/reports/Russia_launches_major_drone_attack_on_Ukraine_despite_productive_Vatican_City_Meeting_999.html",
    "timestamp": "2025-04-28T02:44:34Z"
  },
  {
    "title": "Israel says intercepts missile fired by Yemen's Huthis",
    "description": "Jerusalem (AFP) April 27, 2025\n\n\n The Israeli military said Sunday it intercepted a missile fired from Yemen, where the Huthi rebels claimed responsibility for the launch, saying it targeted an air base in southern Israel. \n\n\"The missile that was launched fro…",
    "link": "https://www.spacewar.com/reports/Israel_says_intercepts_missile_fired_by_Yemens_Huthis_999.html",
    "timestamp": "2025-04-28T02:44:34Z"
  },
  {
    "title": "Israel's Netanyahu calls for 'dismantling' Iran's nuclear infrastructure",
    "description": "Jerusalem (AFP) April 27, 2025\n\n\n Israeli Prime Minister Benjamin Netanyahu called Sunday for the complete dismantling of Iran's nuclear programme, insisting that any deal with Tehran must also address its ballistic missile capabilities. \n\n\"You have to disman…",
    "link": "https://www.spacewar.com/reports/Israels_Netanyahu_calls_for_dismantling_Irans_nuclear_infrastructure_999.html",
    "timestamp": "2025-04-28T02:44:34Z"
  }
]