[
  {
    "title": "From Fauci to His Brother: List of People Joe Biden Pardoned by Autopen",
    "description": "Facing questions about his mental acuity, the former president told The New York Times he made all clemency decisions.",
    "link": "https://www.newsweek.com/biden-pardons-fauci-trump-list-2098567",
    "timestamp": "2025-07-14T13:20:39Z"
  },
  {
    "title": "Trump Praises Bongino After Reports He Might Quit As ‘Epstein Files’ Fallout Continues: A Timeline Of Events",
    "description": "The president asked his supporters to “let Pam Bondi do her job” as she faces scrutiny over handling the release of documents related to the disgraced financier.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/14/trump-praises-bongino-after-reports-he-might-quit-as-epstein-files-fallout-continues-a-timeline-of-events/",
    "timestamp": "2025-07-14T13:19:31Z"
  },
  {
    "title": "Trump to make major announcement on Russia — as Ukraine Envoy Keith Kellogg arrives in Kyiv at height of Putin’s brutality",
    "description": "Trump to announce new decisive steps against Russia as envoy Kellogg arrives in Kyiv.",
    "link": "https://nypost.com/2025/07/14/world-news/trump-to-make-major-announcement-on-russia-as-ukraine-envoy-keith-kellogg-arrives-in-kyiv-at-height-of-putins-brutality/",
    "timestamp": "2025-07-14T13:18:57Z"
  },
  {
    "title": "Trump announces novel plan to send weapons to Ukraine and gives Russia new deadline to make peace | CNN Politics",
    "description": "President Donald Trump on Monday laid out a pair of steps intended to pressure Russia to end its war in Ukraine, including funneling new weapons to Kyiv and threatening economic punishment on Moscow if peace isn’t reached in 50 days, as he grows increasingly …",
    "link": "https://www.cnn.com/2025/07/14/politics/us-ukraine-weapons-trump",
    "timestamp": "2025-07-14T13:18:30Z"
  },
  {
    "title": "‘Little Less Whining’: Obama Says Dem Party Needs To ‘Toughen Up’",
    "description": "Former President Barack Obama said Friday that Democrats need to \"just toughen up,\" CNN first reported on Monday.",
    "link": "https://dailycaller.com/2025/07/14/barack-obama-democratic-party-toughen-up/",
    "timestamp": "2025-07-14T13:18:17Z"
  },
  {
    "title": "UK To Roll Out Red Carpet For Second Trump State Visit",
    "description": "Britain will welcome Donald Trump for an unprecedented second state visit in September, Buckingham Palace confirmed Monday, saying he would stay as the guest of King Charles III at Windsor Castle.",
    "link": "https://www.ibtimes.com/uk-roll-out-red-carpet-second-trump-state-visit-3778422",
    "timestamp": "2025-07-14T13:18:10Z"
  },
  {
    "title": "Trump Says US Is the 'Hottest' Nation Right Now",
    "description": "President Donald Trump visited Texas to see the damage from extreme floods that killed at least 120 people and left scores still missing in the state's Hill Country region. Trump said \"my administration is doing everything in its power to help Texas\" and expr…",
    "link": "https://biztoc.com/x/66c4360d473c029c",
    "timestamp": "2025-07-14T13:18:00Z"
  },
  {
    "title": "How Eurostack could offer Canada a route to digital independence from the United States",
    "description": "Canada needs to consider its digital independence from the domination of the United States. Participating in the Eurostack initiative offers a way to do so.",
    "link": "https://theconversation.com/how-eurostack-could-offer-canada-a-route-to-digital-independence-from-the-united-states-260663",
    "timestamp": "2025-07-14T13:16:03Z"
  },
  {
    "title": "MAGA continues to reel from Trump’s Epstein betrayal",
    "description": "A movement founded on conspiracy theories wonders if the president is leading one of his own",
    "link": "https://www.salon.com/2025/07/14/maga-continues-to-reel-from-trumps-epstein-betrayal/",
    "timestamp": "2025-07-14T13:15:23Z"
  },
  {
    "title": "MAGA media's conspiracy theories put Trump in power — and now they're coming back to bite him (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nMAGA media's conspiracy theories put Trump in power — and now they're coming back to bite him  —  The conspiracy-soaked culture that propelled President Donald Trump to political power is now coming for him.  —  Some of the most influenti…",
    "link": "https://www.memeorandum.com/250714/p33",
    "timestamp": "2025-07-14T13:15:00Z"
  },
  {
    "title": "US weapons supplies to Ukraine never stopped – Kremlin",
    "description": "Dmitry Peskov has said US military aid to Ukraine has never stopped despite discussions over costs and reported halts Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621460-peskov-us-weapons-never-stopped/",
    "timestamp": "2025-07-14T13:13:02Z"
  },
  {
    "title": "Tenacious D Charts A New Album In The Midst Of A Hiatus",
    "description": "Tenacious D lands its fifth top 10 on the Comedy Albums chart, as The Pick of Destiny debuts at No. 8 nearly 20 years after its release.",
    "link": "https://www.forbes.com/sites/hughmcintyre/2025/07/14/tenacious-d-charts-a-new-album-in-the-midst-of-a-hiatus/",
    "timestamp": "2025-07-14T13:11:48Z"
  },
  {
    "title": "Elmo's X account hacked to publish racist and antisemetic posts | TechCrunch",
    "description": "Elmo's X account hacked to publish racist and antisemetic posts | TechCrunchtechcrunch.com",
    "link": "https://techcrunch.com/2025/07/14/sesame-street-elmo-x-account-hacked-racist-antisemetic-posts/",
    "timestamp": "2025-07-14T13:11:33Z"
  },
  {
    "title": "Hacker Gets Access to Elmo’s X Account, Posts Vulgar Messages",
    "description": "Elmo’s X account, which has nearly 650,000 followers, has not posted any new messages since the hacking incident.",
    "link": "https://www.adweek.com/media/hacker-gets-access-to-elmos-x-account-posts-vulgar-messages/",
    "timestamp": "2025-07-14T13:10:30Z"
  },
  {
    "title": "Trump’s big bill calls for much more logging. One provision could cost Oregon counties",
    "description": "Trump’s big bill calls for much more logging. One provision could cost Oregon countiesoregonlive.com",
    "link": "https://www.oregonlive.com/business/2025/07/trumps-big-bill-calls-for-much-more-logging-one-provision-could-cost-oregon-counties.html",
    "timestamp": "2025-07-14T13:08:28Z"
  },
  {
    "title": "Trump Hijacks FIFA Club World Cup Final as He’s Showered in Boos",
    "description": "President Donald Trump forced his way onto Chelsea’s Club World Cup victory celebration on Sunday, much to the chagrin and confusion of everyone involved. He was booed mercilessly. Trump, as the host country representative, was only meant to hand the English …",
    "link": "https://newrepublic.com/post/197910/trump-fifa-club-world-cup-final-boos",
    "timestamp": "2025-07-14T13:08:26Z"
  },
  {
    "title": "On Jeffrey Epstein, Trump rolls out a new conspiracy theory about the conspiracy theory",
    "description": "Donald Trump has come up with a new conspiracy theory about the so-called \"Epstein Files,\" which is a bit like watching a snake eat its own tail.",
    "link": "https://biztoc.com/x/a632d119dfcfbc15",
    "timestamp": "2025-07-14T13:07:07Z"
  },
  {
    "title": "How Dana White plans matchmaking and logistics for UFC White House pay-per-view",
    "description": "Dana White is orchestrating a historic UFC event at the White House in July 2026, commissioned by President Donald Trump to celebrate America's 250th birthday. The event faces logistical challenges, including stringent security measures and limited attendance…",
    "link": "https://timesofindia.indiatimes.com/sports/mma/news/how-dana-white-plans-matchmaking-and-logistics-for-ufc-white-house-pay-per-view/articleshow/122442665.cms",
    "timestamp": "2025-07-14T13:06:33Z"
  },
  {
    "title": "America Can’t Lead in AI by Firing All the Experts",
    "description": "Sacking specialists and cutting federal funding helps U.S. adversaries and competitors.",
    "link": "http://foreignpolicy.com/2025/07/14/artificial-intelligence-ai-race-doge-trump-experts-fired-china-technology/",
    "timestamp": "2025-07-14T13:03:41Z"
  },
  {
    "title": "Reinstatement of compulsory conscription calls for Steinmeier – “A real war is raging in Europe”",
    "description": "Germany must draw its own conclusions from Russia's attack on Ukraine, he said in an interview\nThe post Reinstatement of compulsory conscription calls for Steinmeier – “A real war is raging in Europe” appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/07/14/reinstatement-of-compulsory-conscription-calls-for-steinmeier-a-real-war-is-raging-in-europe/",
    "timestamp": "2025-07-14T13:00:18Z"
  },
  {
    "title": "UVa faculty deliver overwhelming vote of no confidence in board",
    "description": "UVa faculty members have sent a resolution of no confidence to the school's governing Board of Visitors after President Jim Ryan's unprecedented resignation.",
    "link": "https://dailyprogress.com/news/local/education/higher-education/uva/article_59ddbef7-e0d2-47ff-94bf-7720827a45d4.html",
    "timestamp": "2025-07-14T13:00:00Z"
  },
  {
    "title": "GOP Has a New Culture War Target: Superman",
    "description": "Democrats are tied up in knots trying to frame “the right message.” Republicans are focused relentlessly on stupid, misleading culture war issues, invented out of whole cloth. They skillfully maneuver voters into arguing about fake issues, enabling them to si…",
    "link": "https://dianeravitch.net/2025/07/14/gop-has-a-new-culture-war-distraction-superman/",
    "timestamp": "2025-07-14T13:00:00Z"
  },
  {
    "title": "Natural Gas Gets A Political Jolt—But Pipeline Gaps Risk The Payoff",
    "description": "The Mega-Bill, which passed July 4th, boosts gas while paring back support for wind and solar, which complement gas plants. That leaves the grid more exposed, not less.",
    "link": "https://www.forbes.com/sites/kensilverstein/2025/07/14/natural-gas-gets-a-political-jolt-but-pipeline-gaps-risk-the-payoff/",
    "timestamp": "2025-07-14T13:00:00Z"
  },
  {
    "title": "Trump’s New NASA Administrator Is a Bad Sign for America’s Space Program",
    "description": "It appears that Trump is de-prioritizing NASA and America’s overall space mission during his second term—a strange turn of events, considering his mastery of space policy issues during his first.\nThe post Trump’s New NASA Administrator Is a Bad Sign for Ameri…",
    "link": "https://nationalinterest.org/blog/buzz/trumps-nasa-administrator-bad-sign-americas-space-program-bw",
    "timestamp": "2025-07-14T13:00:00Z"
  },
  {
    "title": "‘Superman’ Box Office: DC’s Reboot Is Off to a Stellar Start, With One Lingering Concern",
    "description": "It's a well-liked film that should play for weeks in the U.S., but DC's path back to tentpole powerhouse status will take time\nThe post ‘Superman’ Box Office: DC’s Reboot Is Off to a Stellar Start, With One Lingering Concern appeared first on TheWrap.",
    "link": "https://www.thewrap.com/superman-box-office-analysis/",
    "timestamp": "2025-07-14T13:00:00Z"
  },
  {
    "title": "The BRICS Boom Could End Up Being a Bust",
    "description": "The BRICS has rapidly expanded over the past two years. Judging from this year's summit, the increased membership appears to have hurt its mission. The post ...",
    "link": "https://www.worldpoliticsreview.com/brics-expansion-summit-2025/",
    "timestamp": "2025-07-14T13:00:00Z"
  },
  {
    "title": "Trump, All Humanity Quiver Before Rosie O’Donnell",
    "description": "Oh, and Dear Leader wants to revoke citizenship for the US citizens he doesn’t like.",
    "link": "https://www.wonkette.com/p/trump-all-humanity-quiver-before",
    "timestamp": "2025-07-14T12:55:24Z"
  },
  {
    "title": "Disasters are for the greater glory of Trump (Noah Berlatsky/Public Notice)",
    "description": "Noah Berlatsky / Public Notice:\nDisasters are for the greater glory of Trump  —  He cannot fail.  He can only be failed. …   —  President Donald Trump presents himself as strong, indomitable, and always forceful.  But when disaster strikes — whether hurrica…",
    "link": "https://www.memeorandum.com/250714/p32",
    "timestamp": "2025-07-14T12:55:00Z"
  },
  {
    "title": "Pentagon Strips Metallica Song from Pete Hegseth’s ‘Drone Dominance’ Video After Band’s Copyright Threat",
    "description": "A promotional video released by U.S. Defense Secretary Pete Hegseth forecasting “drone dominance” has been recast after Metallica successfully demanded the removal of one of their songs from the offering.\nThe post Pentagon Strips Metallica Song from Pete Hegs…",
    "link": "https://www.breitbart.com/entertainment/2025/07/14/pentagon-strips-metallica-song-from-pete-hegseths-drone-dominance-video-after-bands-copyright-threat/",
    "timestamp": "2025-07-14T12:51:51Z"
  },
  {
    "title": "Donald Trump threatens to revoke Rosie O’Donnell’s citizenship – is he allowed to?",
    "description": "President Donald Trump has threatened to revoke lesbian comedian Rosie O’Donnell’s US citizenship – but can he do it? Writing on his own social media platform Truth Social on Saturday (12 July), the president said: “Because of the fact that Rosie O’Donnell is…",
    "link": "https://www.thepinknews.com/2025/07/14/can-president-revoke-citizenship-of-a-us-citizen-donald-trump-rosie-o-donnell/",
    "timestamp": "2025-07-14T12:50:57Z"
  },
  {
    "title": "Chelsea put on show in Club World Cup final — only to have Trump steal their moment (Safid Deen/USA Today)",
    "description": "Safid Deen / USA Today:\nChelsea put on show in Club World Cup final — only to have Trump steal their moment  —  EAST RUTHERFORD, N.J. — Chelsea star Cole Palmer was like much of the world wondering why President Donald Trump was obliviously standing in the mi…",
    "link": "https://www.memeorandum.com/250714/p30",
    "timestamp": "2025-07-14T12:50:01Z"
  },
  {
    "title": "'Very disappointed': Trump slams Putin, moves to send Ukraine weapons",
    "description": "“I am very disappointed with President Putin,” Trump said July 13. “I thought he was somebody that meant what he said.\"",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/14/trump-putin-sends-ukraine-weapons-war/85189878007/",
    "timestamp": "2025-07-14T12:46:29Z"
  },
  {
    "title": "This money-making hellhole proves we're ruled by sociopaths",
    "description": "Do you think concentration camps are cool?Does your heart fill with mean-spirited joy at the thought of human beings stuffed into tents and FEMA trailers parked on a disused airstrip in the heart of the Everglades in the middle of a Florida summer?Do you get …",
    "link": "https://www.rawstory.com/this-money-making-hellhole-proves-we-re-ruled-by-sociopaths/",
    "timestamp": "2025-07-14T12:46:24Z"
  },
  {
    "title": "Some right-wing media stars, whose conspiracy theories helped put Trump in power, are rejecting his call to stop wasting \"time and energy on Jeffrey Epstein\" (Brian Stelter/CNN)",
    "description": "Brian Stelter / CNN:\nSome right-wing media stars, whose conspiracy theories helped put Trump in power, are rejecting his call to stop wasting “time and energy on Jeffrey Epstein”  —  The conspiracy-soaked culture that propelled President Donald Trump to polit…",
    "link": "https://mediagazer.com/250714/p6",
    "timestamp": "2025-07-14T12:45:00Z"
  },
  {
    "title": "Boys & Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "EAST PROVIDENCE, R.I. (AP) — After driving through a downpour to take her son to day camp, Darleen Reyes told camp administrators the rain would have kept her away but her son insisted on going. As she marked her son’s name present on a clipboard at the Boys …",
    "link": "https://freerepublic.com/focus/f-news/4328582/posts",
    "timestamp": "2025-07-14T12:42:16Z"
  },
  {
    "title": "Summer Storms",
    "description": "“It’s dark on the Left now. They’ve reached that predictable moment where inflicting pain is all they have left.“ — Sasha Stone",
    "link": "https://www.kunstler.com/p/summer-storms",
    "timestamp": "2025-07-14T12:40:46Z"
  },
  {
    "title": "Conflict between Pam Bondi and Dan Bongino goes public, adding to Team Trump schisms",
    "description": "Donald Trump said his team “gets along with each other” and “loves each other.” There's evidence to the contrary. Take Pam Bondi and Dan Bongino, for example.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/conflict-pam-bondi-dan-bongino-goes-public-adding-team-trump-schisms-rcna218615",
    "timestamp": "2025-07-14T12:40:41Z"
  },
  {
    "title": "Hegseth's Drone Video Edited After Metallica's Cease & Desist Letter",
    "description": "Metallica sent a cease & desist letter to the Pentagon after Sec. of Defense Pete Hegseth's unauthorized use of 'Enter Sandman' in drone promo video.",
    "link": "http://www.billboard.com/music/rock/metallica-cease-desist-hegseth-drone-video-enter-sandman-1236020526/",
    "timestamp": "2025-07-14T12:40:00Z"
  },
  {
    "title": "Work permits and tariffs: What changes in Sweden in August 2025?",
    "description": "A much-awaited list which could change Sweden's work permit salary threshold is set to be published, we'll get a closer look at possible new rules for family reunification, and it's back to work for a lot of people. Here are the main things changing in Sweden…",
    "link": "https://www.thelocal.se/20250714/what-changes-in-sweden-in-august-2025",
    "timestamp": "2025-07-14T12:39:07Z"
  },
  {
    "title": "Wall Street points lower after Trump’s weekend tariff announcement; bank earnings this week",
    "description": "U.S. stock indexes are hanging near their records following Donald Trump’s latest updates to his tariffs.",
    "link": "https://www.denverpost.com/2025/07/14/wall-street-trump-tariff-impact/",
    "timestamp": "2025-07-14T12:37:50Z"
  },
  {
    "title": "Wall Street points lower after Trump’s weekend tariff announcement; bank earnings this week",
    "description": "Wall Street is pointing lower before the opening bell with new tariffs announced for Europe and Mexico.",
    "link": "https://www.bostonherald.com/2025/07/14/wall-street-trump-tariff-impact/",
    "timestamp": "2025-07-14T12:37:50Z"
  },
  {
    "title": "Mark Cuban rips Democrats' constant 'Trump sucks' message, calling it 'not the way to win'",
    "description": "Billionaire Mark Cuban criticized the Democratic Party’s fixation on attacking President Donald Trump rather than providing ideas for helping ordinary people.",
    "link": "https://www.foxnews.com/media/mark-cuban-rips-democrats-constant-trump-sucks-message-calling-not-way-win",
    "timestamp": "2025-07-14T12:36:22Z"
  },
  {
    "title": "S&P, Dow, Nasdaq Futures Tumble After Trump Escalates Trade Fight With Europe",
    "description": "Stocks on Edge: Trump Tariffs Threaten Fresh Inflation Wave",
    "link": "https://finance.yahoo.com/news/p-dow-nasdaq-futures-tumble-123615585.html",
    "timestamp": "2025-07-14T12:36:15Z"
  },
  {
    "title": "Most Pennsylvania voters ignore judicial elections − a political scientist explains why they matter, especially in a battleground state",
    "description": "The outcome of Pennsylvania’s retention elections in November could change the balance of power in Harrisburg.",
    "link": "https://theconversation.com/most-pennsylvania-voters-ignore-judicial-elections-a-political-scientist-explains-why-they-matter-especially-in-a-battleground-state-259775",
    "timestamp": "2025-07-14T12:35:45Z"
  },
  {
    "title": "Trump’s Brazil tariffs point more to his enduring bond with far-right Bolsonaro than economic concerns",
    "description": "US president’s letter to Brazilian counterpart mentioned trade deficit. But don’t be fooled, these tariffs are political rather than economic.",
    "link": "https://theconversation.com/trumps-brazil-tariffs-point-more-to-his-enduring-bond-with-far-right-bolsonaro-than-economic-concerns-260993",
    "timestamp": "2025-07-14T12:35:17Z"
  },
  {
    "title": "Brian Kilmeade’s Got Jokes After Biden Defends Autopen Use to New York Times: ‘I’m Sure He Needed a Nap Right After’",
    "description": "Fox News' Brian Kilmeade quipped that former President Joe Biden \"needed a nap\" as the ex-commander in chief defended his use of autopen to the New York Times.\nThe post Brian Kilmeade’s Got Jokes After Biden Defends Autopen Use to New York Times: ‘I’m Sure He…",
    "link": "https://www.mediaite.com/media/tv/brian-kilmeades-got-jokes-after-biden-defends-autopen-use-to-new-york-times-im-sure-he-needed-a-nap-right-after/",
    "timestamp": "2025-07-14T12:34:53Z"
  },
  {
    "title": "The Latest: Trump promises a 'major statement' on Russia-Ukraine war as he hosts NATO leader",
    "description": "NATO Secretary-General Mark Rutte will be in Washington today and tomorrow for talks with President Donald Trump, Secretary of State Marco Rubio and Defense ...",
    "link": "https://www.yahoo.com/news/latest-trump-promises-major-statement-123417083.html",
    "timestamp": "2025-07-14T12:34:17Z"
  },
  {
    "title": "Obama's blunt message for party: 'Toughen up'...",
    "description": "Former President Barack Obama issued a call to action for Democrats at a private fundraiser in New Jersey on Friday evening, urging those frustrated by the state of the country under President Donald Trump to “stand up for the things that you think are right.”",
    "link": "https://www.cnn.com/2025/07/14/politics/obama-democrats-message",
    "timestamp": "2025-07-14T12:31:37Z"
  },
  {
    "title": "UPDATE: Trump faces revolt over Epstein...",
    "description": "UPDATE: Trump faces revolt over Epstein...\r\n\n \n \n \n (First column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Now Says Obama, Hillary, Biden, Comey 'created files'...\r\nBegs supporters to end obsession...\r\nBongino on Brink...\r\nGhislaine ready to reveal trut…",
    "link": "https://www.cnn.com/2025/07/14/politics/epstein-fallout-trump-maga",
    "timestamp": "2025-07-14T12:31:36Z"
  },
  {
    "title": "Oil hits 3-week high on signs of tighter supply",
    "description": "Oil prices rose today to their highest level in three weeks, as investors eyed further US sanctions on Russia that may affect global supplies, while more oil imports by China also offered support along with signs of tighter supply.",
    "link": "https://www.rte.ie/news/business/2025/0714/1523435-oil-hits-3-week-high-on-signs-of-tighter-supply/",
    "timestamp": "2025-07-14T12:30:51Z"
  },
  {
    "title": "Critics Say AOC Should Be Sued Into Bankruptcy for Her Latest Attack on Trump",
    "description": "(America First Report)—New York Representative Alexandria Ocasio-Cortez is facing accusations of defaming President Donald Trump. She called him a “rapist” on social media during a debate about how the Department of Justice handled the Jeffrey Epstein case. T…",
    "link": "https://freerepublic.com/focus/f-bloggers/4328581/posts",
    "timestamp": "2025-07-14T12:30:44Z"
  },
  {
    "title": "“Just Release the Files as Promised” – Elon Muck Calls on President Trump to Release Epstein Files",
    "description": "In November 2024, after President Trump won the presidential reelection, former Trump administration official Kash Patel announced that under President Donald Trump’s second administration, Americans should brace for unprecedented government transparency.\nThe…",
    "link": "https://www.thegatewaypundit.com/2025/07/just-release-files-as-promised-elon-muck-calls/",
    "timestamp": "2025-07-14T12:30:41Z"
  },
  {
    "title": "'Nightmare': Expert warns GOP crises will make midterms 'killing field'",
    "description": "President Donald Trump's much ballyhooed One Big Beautiful Bill Act could flush out the Republican congressional majorities in next year's midterm elections, according to a political analyst.The sweeping domestic policy legislation was signed into law earlier…",
    "link": "https://www.rawstory.com/trump-big-beautiful-bill/",
    "timestamp": "2025-07-14T12:30:28Z"
  },
  {
    "title": "Trump’s 50% Tariff on COPPER Sends Prices of the Metal Soaring",
    "description": "Copper prices hit historic highs after U.S. President Donald Trump announced a 50 percent tariff on imports, causing a 17 percent spike in futures before a slight retreat. The move aims to boost domestic production but risks disrupting global trade and raisin…",
    "link": "https://www.shtfplan.com/headline-news/trumps-50-tariff-on-copper-sends-prices-of-the-metal-soaring",
    "timestamp": "2025-07-14T12:30:28Z"
  },
  {
    "title": "Logan Paul’s ‘Impaulsive’ Talk Show Is Joining the WWE and Fanatics Podcast Lineup",
    "description": "Logan Paul, the social media star turned WWE wrestler, is bringing his popular interview podcast “Impaulsive” to the WWE and Fanatics podcast network. Paul, who rose to fame on Vine and YouTube, launched “Impaulsive” in November 2018. The show is co-hosted by…",
    "link": "https://variety.com/2025/digital/news/logan-paul-impaulsive-podcast-wwe-fanatics-network-1236453576/",
    "timestamp": "2025-07-14T12:30:00Z"
  },
  {
    "title": "Tesla Goes to Trial Over Fatal Autopilot Crash in Florida",
    "description": "Tesla Inc. will stand trial over claims that the company is partly to blame for a fatal 2019 crash in Florida that occurred when the Autopilot system in a Model S allegedly failed to detect a parked SUV. Family members …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/07/14/831436.htm",
    "timestamp": "2025-07-14T12:25:25Z"
  },
  {
    "title": "‘Liars’: Biden Attacks Trump and Republicans Over Autopen Controversy, Claims He ‘Made Every Decision’",
    "description": "Biden is speaking out — defending his use of autopen to grant pardons and lashing out at Trump and others in the GOP attacking his autopen use as controversial.\nThe post ‘Liars’: Biden Attacks Trump and Republicans Over Autopen Controversy, Claims He ‘Made Ev…",
    "link": "https://www.mediaite.com/media/news/liars-biden-attacks-trump-and-republicans-over-autopen-controversy-claims-he-made-every-decision/",
    "timestamp": "2025-07-14T12:24:28Z"
  },
  {
    "title": "Stock Market Today: Dow Jones Futures Fall On New Trump Tariffs; Tesla Extends Rebound (Live Coverage)",
    "description": "Futures on the Dow Jones Industrial Average and other major indexes traded lower Monday after President Donald Trump announced 30% tariffs on the European Union and Mexico. Meanwhile, Tesla (TSLA) was an early winner on the stock market today. Ahead of the op…",
    "link": "https://biztoc.com/x/39c0f33d607d349c",
    "timestamp": "2025-07-14T12:23:27Z"
  },
  {
    "title": "Trump: America 'ripped off' on trade for decades",
    "description": "United States President Donald Trump criticized on Monday other countries for their conduct toward the US, stating his country \"has been ripped off by friend and foe, alike, for decades.\" In a post on...",
    "link": "https://biztoc.com/x/0c7b488dfe32ef96",
    "timestamp": "2025-07-14T12:22:45Z"
  },
  {
    "title": "California Woman Detained By Border Patrol At Home Depot",
    "description": "Footage obtained by Newsweek shows federal agents leading her away after she was apprehended.",
    "link": "https://www.newsweek.com/california-woman-alejandra-anleu-detained-ice-home-deport-immigration-2098482",
    "timestamp": "2025-07-14T12:21:51Z"
  },
  {
    "title": "Wall Street Journal Issues Scathing Summer Request For Trump: 'For The Good Of The Nation'",
    "description": "The newspaper's conservative editorial board also hit the president with a cold truth about his tariff strategy.",
    "link": "https://www.huffpost.com/entry/wall-street-journal-donald-trump-summer_n_6874d752e4b00af0c5f24a75",
    "timestamp": "2025-07-14T12:20:09Z"
  },
  {
    "title": "DOGE is on the Senate’s agenda, with the future of public broadcasting at stake",
    "description": "Trump has asked lawmakers to rescind nearly $1.1 billion from the Corporation for Public Broadcasting, the full amount it’s due to receive during the next two budget years.",
    "link": "https://fortune.com/2025/07/14/doge-budget-cuts-senate-public-broadcasting-rescissions-pbs/",
    "timestamp": "2025-07-14T12:19:13Z"
  },
  {
    "title": "Forbes Daily: Jeff Bezos Offloads Over $1.5 Billion In Amazon Stock",
    "description": "Today’s Forbes Daily features new E.U. and Mexico tariffs, the latest bitcoin record, Jannik Sinner’s Wimbledon victory, an impressive start for “Superman” and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/07/14/forbes-daily-jeff-bezos-offloads-over-15-billion-in-amazon-stock/",
    "timestamp": "2025-07-14T12:18:35Z"
  },
  {
    "title": "Amazon Prime Day finds success amid tariffs, consumer concerns",
    "description": "Amazon Prime Day sales looked bumpy at first this week, with year-over-year comparisons for the first two days down. But by Friday, early data showed solid sales for the tech giant despite economic uncertainty.",
    "link": "https://techxplore.com/news/2025-07-amazon-prime-day-success-tariffs.html",
    "timestamp": "2025-07-14T12:14:58Z"
  },
  {
    "title": "Transcript: Trump’s Threats to Jail Foes Darken amid Brutal Poll Slide",
    "description": "The following is a lightly edited transcript of the July 14 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.We’re in the …",
    "link": "https://newrepublic.com/article/197906/transcript-trump-threats-jail-foes-darken-amid-brutal-poll-slide",
    "timestamp": "2025-07-14T12:14:12Z"
  },
  {
    "title": "5 things to know before the stock market opens Monday",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/07/14/5-things-to-know-before-the-stock-market-opens-monday-july-14.html",
    "timestamp": "2025-07-14T12:14:11Z"
  },
  {
    "title": "Hackers blamed for antisemitic posts on Elmo's X account",
    "description": "Sesame Street says Elmo's account was hacked and the posts have been removed.",
    "link": "https://www.bbc.com/news/articles/c04d25g9v6zo",
    "timestamp": "2025-07-14T12:12:57Z"
  },
  {
    "title": "Robert Reich Says, 'The U.S. Government Is No Longer Able To Protect Us From Real Hazards, Because It's Shifting Funds To Fake Hazards'",
    "description": "Former U.S. Labor Secretary Robert Reich is sounding the alarm over what he sees as a dangerous shift in federal priorities under President Donald Trump.\nIn a sharply worded opinion piece on AlterNet, Reich said that the government “is no longer able to prote…",
    "link": "https://biztoc.com/x/4899efb676a21c0e",
    "timestamp": "2025-07-14T12:11:43Z"
  },
  {
    "title": "President Trump to meet Sir Keir Starmer on Scotland visit",
    "description": "The US president is expected to arrive at his Aberdeenshire golf resort later this month.",
    "link": "https://www.bbc.com/news/articles/cly8p102n8ro",
    "timestamp": "2025-07-14T12:10:37Z"
  },
  {
    "title": "'Woke, Weak, and Out of Touch': New Poll Shows Democrats Losing Ground With Voters",
    "description": "A new poll reveals a sharp decline in support for the Democratic Party since the 2024 election, as frustrated voters say the party has drifted far from the concerns of everyday Americans. Instead of focusing on inflation, border security, or public safety, De…",
    "link": "https://freerepublic.com/focus/f-chat/4328579/posts",
    "timestamp": "2025-07-14T12:09:33Z"
  },
  {
    "title": "Trump Stays in Team Group Photo After Club World Cup Final",
    "description": "After winning the Club World Cup last night in New Jersey, London-based soccer side Chelsea FC found themselves with an unexpected figure alongside them for their winning photo: President Donald J. Trump.\n[Read More]",
    "link": "https://petapixel.com/2025/07/14/trump-stays-in-team-group-photo-after-club-world-cup-final/",
    "timestamp": "2025-07-14T12:06:20Z"
  },
  {
    "title": "A Senate vote this week will test the popularity of DOGE spending cuts",
    "description": "Senate Republicans are putting the popularity of Department of Government Efficiency spending cuts to the test this week",
    "link": "https://abcnews.go.com/US/wireStory/senate-vote-week-test-popularity-doge-spending-cuts-123732851",
    "timestamp": "2025-07-14T12:05:17Z"
  },
  {
    "title": "Trump Turned His Head and Saved America",
    "description": "Thank God that attempted assassin Thomas Crooks was unable to kill President Donald Trump at his rally in Butler, Pennsylvania (PA). It was a turn of the President’s head to view an immigration chart that saved his life. Of course, believers know that it was …",
    "link": "https://freerepublic.com/focus/f-chat/4328578/posts",
    "timestamp": "2025-07-14T12:04:00Z"
  },
  {
    "title": "Donald Trump’s eventful day at the Club World Cup final: Being booed, celebrating with Chelsea and a winner’s medal",
    "description": "While Chelsea stole the show on the pitch in a masterful showing against Paris Saint-Germain, President Donald Trump was arguably the center of attention at the FIFA Club World Cup final on Sunday.",
    "link": "https://www.cnn.com/2025/07/14/sport/donald-trump-club-world-cup-final-chelsea-psg-spt",
    "timestamp": "2025-07-14T12:03:53Z"
  },
  {
    "title": "Deadlocked Gaza Truce Talks Limp On But US Hopes For Deal",
    "description": "Stuttering Gaza ceasefire talks between Israel and Hamas entered a second week on Monday, with US President Donald Trump still hopeful of a breakthrough and as more than 20 people were killed on the ground.",
    "link": "https://www.ibtimes.com/deadlocked-gaza-truce-talks-limp-us-hopes-deal-3778417",
    "timestamp": "2025-07-14T12:03:26Z"
  },
  {
    "title": "Chelsea captain Reece James reveals what happened when Donald Trump 'gatecrashed' Club World Cup celebration",
    "description": "Chelsea captain Reece James has explained what happened when Donald Trump 'gatecrashed' the team's trophy lifting at the Club World Cup yesterday (13 June).",
    "link": "https://www.ladbible.com/news/sport/donald-trump-club-world-cup-reece-james-reaction-368406-20250714",
    "timestamp": "2025-07-14T12:02:03Z"
  },
  {
    "title": "Yergin: America’s Copper Hunger Increasingly Hard To Feed",
    "description": "Decades-long timelines from discovery to first production are a major roadblock for Trump White House plans to spur U.S. copper mining, says Daniel Yergin.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/07/14/yergin-americas-copper-hunger-increasingly-hard-to-feed/",
    "timestamp": "2025-07-14T12:01:46Z"
  },
  {
    "title": "US stock market future slips as Trump’s 30% tariffs rattle global trade; Dow, S&P 500, Nasdaq dip while Boeing jumps and Apple, Tesla slide ahead of earnings, CPI data",
    "description": "US Stock futures slide as President Donald Trump announces 30% tariffs on the EU and Mexico, set to begin August 1, raising fresh concerns over trade tensions. While markets dipped early, they rebounded slightly as investors hoped the tariffs would be negotia…",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-stock-futures-fall-as-trumps-30-tariffs-rattle-global-trade-dow-sp-500-nasdaq-dip-while-boeing-jumps-and-apple-tesla-slide-ahead-of-earnings-cpi-data/articleshow/122438518.cms",
    "timestamp": "2025-07-14T12:01:12Z"
  },
  {
    "title": "Trump to meet Starmer during private Scotland trip",
    "description": "United States President Donald Trump is expected to meet UK Prime Minister Keir Starmer during a private trip to Scotland later this month, Downing Street confirmed on Monday.\"There will not be a form...",
    "link": "https://biztoc.com/x/de8a1bbc3996ec30",
    "timestamp": "2025-07-14T12:00:38Z"
  },
  {
    "title": "On Jeffrey Epstein, Trump rolls out a new conspiracy theory about the conspiracy theory",
    "description": "Donald Trump has come up with a new conspiracy theory about the so-called \"Epstein Files,\" which is a bit like watching a snake eat its own tail.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jeffrey-epstein-trump-rolls-new-conspiracy-theory-conspiracy-theory-rcna218606",
    "timestamp": "2025-07-14T12:00:30Z"
  },
  {
    "title": "Why Trump’s Fee Hike May Not Solve The Deeper Problems In U.S. National Parks",
    "description": "The White House issued an executive order to raise entrance fees for foreign visitors to U.S. national parks at the same time the U.S. Supreme Court’s decision made park staff once again vulnerable to layoffs.",
    "link": "https://www.forbes.com/sites/emesemaczko/2025/07/14/why-trumps-fee-hike-may-not-solve-the-deeper-problems-in-us-national-parks/",
    "timestamp": "2025-07-14T12:00:20Z"
  },
  {
    "title": "Trump To Meet NATO’s Mark Rutte as Plans Surface To Have Atlantic Alliance Buy US-Made Weapons for Ukraine",
    "description": "As US President Donald J.\nThe post Trump To Meet NATO’s Mark Rutte as Plans Surface To Have Atlantic Alliance Buy US-Made Weapons for Ukraine appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/trump-meet-natos-mark-rutte-as-plans-surface/",
    "timestamp": "2025-07-14T12:00:14Z"
  },
  {
    "title": "Zelensky Talks Air Defence In 'Productive' Meeting With US Envoy",
    "description": "President Volodymyr Zelensky met Monday with US special envoy Keith Kellogg in Kyiv and discussed air defence and sanctions on Russia during a \"productive\" conversation, the Ukrainian leader said.",
    "link": "https://www.ibtimes.com/zelensky-talks-air-defence-productive-meeting-us-envoy-3778416",
    "timestamp": "2025-07-14T12:00:13Z"
  },
  {
    "title": "Live updates: Trump to send Patriot missiles to Ukraine (NBC News)",
    "description": "NBC News:\nLive updates: Trump to send Patriot missiles to Ukraine  —  President Donald Trump's announcement comes ahead of a meeting with NATO secretary general at the White House. … Economic council head says Trump's ability to fire Fed's Powell is ‘being lo…",
    "link": "https://www.memeorandum.com/250714/p21",
    "timestamp": "2025-07-14T12:00:04Z"
  },
  {
    "title": "Ratioed",
    "description": "<ul>\n<li>He Got The Call</li>\n<li>All Bullshit</li>\n<li>The Worst Of The Worst?</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/ratioed",
    "timestamp": "2025-07-14T12:00:00Z"
  },
  {
    "title": "Lest We Forget the Horrors: An Unending Catalog of Trump’s Cruelties, Collusions, Corruptions, and Crimes: June 2025: Atrocities 273-313",
    "description": "Early in President Trump’s first term, McSweeney’s editors began to catalog the head-spinning number of misdeeds coming from his administration. We called this list a collection of Trump’s cruelties, collusions, corruptions, and crimes, and it felt urgent to …",
    "link": "https://www.mcsweeneys.net/articles/june-2025-atrocities-273-313",
    "timestamp": "2025-07-14T12:00:00Z"
  },
  {
    "title": "Tesla almost here in ‘toughest car market’, but not the way India’s policymakers wanted",
    "description": "Tesla is set to inaugurate its first Indian showroom in Mumbai on July 15. A Delhi-NCR location will follow soon. This retail debut comes after years of navigating policy hurdles and strategic considerations. The move reflects a cautious approach amid tariff …",
    "link": "https://economictimes.indiatimes.com/industry/auto/tesla-elon-musk-india-toughest-car-market-model-y-trump-ev-industry/articleshow/122437958.cms",
    "timestamp": "2025-07-14T11:59:23Z"
  },
  {
    "title": "Britain and Europe Are Changing Together",
    "description": "The nuclear pact recently signed by French President Emmanuel Macron and British Prime Minister Kier Starmer reflects how an emerging post-liberal Europe is taking the form of a defense community. Britain can help shape the continent’s new security order, so …",
    "link": "https://www.project-syndicate.org/commentary/macron-visit-london-shows-eu-uk-can-collaborate-on-security-by-mark-leonard-2025-07",
    "timestamp": "2025-07-14T11:57:54Z"
  },
  {
    "title": "‘Pissed’ Trump Plans to Unveil ‘Aggressive’ Ukraine Arms Deal in Swipe at Putin: Report",
    "description": "Trump is reportedly preparing to unveil a major escalation in U.S. support for Ukraine after growing frustrated with Putin’s refusal to entertain a ceasefire.\nThe post ‘Pissed’ Trump Plans to Unveil ‘Aggressive’ Ukraine Arms Deal in Swipe at Putin: Report fir…",
    "link": "https://www.mediaite.com/media/news/pissed-trump-plans-to-unveil-aggressive-ukraine-arms-deal-in-swipe-at-putin-report/",
    "timestamp": "2025-07-14T11:56:37Z"
  },
  {
    "title": "Russophobia by the Collective West Opens the Doors of Cold War 2.0",
    "description": "The 2018 Skripal Attack Case\nThe current orchestrated Western policy of total Russophobia, directed by Collective West, can be recorded to start by the British Cabinet of Theresa May – the focal servant-dog to US global imperialism, followed by the …\nThe post…",
    "link": "https://www.globalresearch.ca/russophobia-west-cold-war-2-0/5894989",
    "timestamp": "2025-07-14T11:56:19Z"
  },
  {
    "title": "Andrew Schulz Regrets Voting for Donald Trump",
    "description": "Comedian Andrew Schulz, who supported Donald Trump during his run for president, says he now regrets his endorsement. “Everything [Donald Trump] campaigned on, I believe he wanted to do, and now he’s doing the exact opposite thing of every single f–king thing…",
    "link": "https://mediatakeout.com/andrew-schulz-regrets-voting-for-donald-trump/",
    "timestamp": "2025-07-14T11:56:04Z"
  },
  {
    "title": "Prince Harry 'Approves' Peace Talks With King Charles — as 'Spoilt' Duke Attempts to Worm His Way Back Into Royal Fold After Feud",
    "description": "Prince Harry has given his blessing to 'peace talks' geared to end the conflict between himself and King Charles, but Duke unlikely to return as working royal.",
    "link": "https://radaronline.com/p/prince-harry-approves-peace-talks-king-charles-worm-way-back-into-royal-fold/",
    "timestamp": "2025-07-14T11:56:01Z"
  },
  {
    "title": "Bitcoin soars past $120,000 ahead of US Congress' 'Crypto week'. What to expect from Genius Act as House plans vote",
    "description": "Bitcoin has surged past $120,000 amidst discussions on virtual asset laws in the U.S. House and significant institutional buying. Lawmakers are set to discuss the Digital Asset Market Clarity Act, the GENIUS Act for stablecoins, and the Anti-CBDC Surveillance…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-bitcoin-soars-past-120000-ahead-of-us-congress-crypto-week-what-to-expect-from-genius-act-as-house-plans-vote/articleshow/122438781.cms",
    "timestamp": "2025-07-14T11:55:41Z"
  },
  {
    "title": "Trump's 30% tariff letter leaves EU scrambling to bring U.S. on side",
    "description": "European Union leaders have said they are still working towards reaching a negotiated solution with the U.S.",
    "link": "https://www.cnbc.com/2025/07/14/trumps-30percent-tariff-letter-leaves-eu-scrambling-to-bring-us-on-side.html",
    "timestamp": "2025-07-14T11:55:25Z"
  },
  {
    "title": "(Progressive) Bonfire of the Vanities, 'Mad-Mani' Style",
    "description": "New York City has met many challenges in its history as the capital of capital.\nThe constant problem that surrounds the city is that with great wealth comes great political profligacy. It is not the...",
    "link": "https://www.realclearpolitics.com/articles/2025/07/14/progressive_bonfire_of_the_vanities_mad-mani_style.html",
    "timestamp": "2025-07-14T11:52:58Z"
  }
]