[
  {
    "title": "Xi says China will stand with Southeast Asian countries in face of economic shocks",
    "description": "Chinese leader Xi Jinping told Malaysia's leader Wednesday that China will be a collaborative partner and stand with its Southeast Asian neighbors in the wake of global economic shocks. “In the face of shocks to global order and economic globalization, China …",
    "link": "https://japantoday.com/category/world/xi-says-china-will-stand-with-southeast-asian-countries-in-face-of-economic-shocks",
    "timestamp": "2025-04-16T21:37:46Z"
  },
  {
    "title": "UK Supreme Court says definition of a woman is based on biological sex and excludes transgender people",
    "description": "The UK Supreme Court ruled Wednesday that a woman is someone born biologically female, excluding transgender people from the legal definition in a long-running dispute between a feminist group and the Scottish government. Several women's groups that supported…",
    "link": "https://japantoday.com/category/world/uk-supreme-court-to-rule-on-landmark-legal-challenge-over-legal-definition-of-a-woman",
    "timestamp": "2025-04-16T21:37:23Z"
  },
  {
    "title": "Judge finds cause to hold Trump administration in criminal contempt for violating deportation order",
    "description": "A federal judge on Wednesday said he has found probable cause to hold the Trump administration in criminal contempt of court and warned he could seek officials' prosecution for violating his orders last month to turn around planes carrying deportees to an El …",
    "link": "https://japantoday.com/category/world/judge-finds-probable-cause-to-hold-trump-administration-in-contempt-for-violating-deportation-order",
    "timestamp": "2025-04-16T21:37:16Z"
  },
  {
    "title": "Observers note loss of 'green conscience' on debate stage",
    "description": "The issue of climate change will be further marginalized this election cycle without the Green Party’s presence at the leadership debates, some political scientists say.",
    "link": "https://www.nationalobserver.com/2025/04/16/news/green-conscience-debate-stage-election",
    "timestamp": "2025-04-16T21:37:03Z"
  },
  {
    "title": "Donald Trump's Approval Rating Shows Worrisome Trend: Poll",
    "description": "In recent weeks, the president's approval rating has slipped, widening the gap between positive and negative results.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-drops-poll-2060733",
    "timestamp": "2025-04-16T21:36:34Z"
  },
  {
    "title": "Tim Dillon says rebranding of core American values as 'right-wing' is the 'craziest thing' he's ever heard",
    "description": "Comedian Tim Dillon opened up on the current state of politics and more in a wide-ranging sit-down interview with Fox News Digital.",
    "link": "https://www.foxnews.com/media/tim-dillon-says-rebranding-core-american-values-right-wing-craziest-thing-hes-ever-heard",
    "timestamp": "2025-04-16T21:35:56Z"
  },
  {
    "title": "Trump's trade war ripples through the business world, hits stocks again",
    "description": "(Reuters) -The ripple effects of Donald Trump's global trade war are increasingly being felt across numerous industries all at once and on Wednesday were...",
    "link": "https://finance.yahoo.com/news/trumps-trade-war-ripples-business-213341155.html",
    "timestamp": "2025-04-16T21:33:41Z"
  },
  {
    "title": "WHO member countries agree on a draft 'pandemic treaty' to try to avoid COVID-19 mistakes",
    "description": "Five years after COVID-19 triggered national lockdowns, economic uncertainty and killed millions, the World Health Organization’s member countries agreed on a draft “pandemic treaty” that sets guidelines for how the international community might confront the …",
    "link": "https://japantoday.com/category/world/who-member-countries-agree-on-a-draft-%27pandemic-treaty%27-to-try-to-avoid-covid-19-mistakes",
    "timestamp": "2025-04-16T21:32:46Z"
  },
  {
    "title": "California Voters Are Straying From Their Dem Leaders, Poll Finds",
    "description": "California voters are straying farther from the Democratic elites in the state and are becoming less interested in \"resisting\" the Trump administration.",
    "link": "https://dailycaller.com/2025/04/16/california-voters-straying-from-dem-leaders-poll-finds/",
    "timestamp": "2025-04-16T21:32:43Z"
  },
  {
    "title": "IRS Making Plans to Rescind Harvard’s Tax-Exempt Status After It Defied Trump — Nearly Half a Billion Dollars at Risk: Report",
    "description": "The White House is moving beyond just cutting off federal funds to Harvard University after it defied President Donald Trump's demands, with the IRS \"making plans to rescind the tax-exempt status\" of the Ivy League university, according to CNN.\nThe post IRS M…",
    "link": "https://www.mediaite.com/news/irs-making-plans-to-rescind-harvards-tax-exempt-status-after-it-defied-trump-nearly-half-a-billion-dollars-at-risk-report/",
    "timestamp": "2025-04-16T21:31:34Z"
  },
  {
    "title": "Gold Hits Record High on Trade Tariffs and Nvidia Warning; Tech Stocks Fall",
    "description": "Gold spot prices reached a record $3,283.63/oz amid trade concerns and Nvidia's export warning.",
    "link": "https://finance.yahoo.com/news/gold-hits-record-high-trade-212850197.html",
    "timestamp": "2025-04-16T21:28:50Z"
  },
  {
    "title": "Trump administration to challenge order for testimony about wrongly deported man",
    "description": "WASHINGTON (Reuters) - President Donald Trump's administration intends to appeal a judge's ruling allowing U.S. officials to face questioning over the steps taken to secure the return of a man wrongly deported to El Salvador, a court filing showed on Wednesda…",
    "link": "https://www.thestar.com.my/news/world/2025/04/17/trump-administration-to-challenge-order-for-testimony-about-wrongly-deported-man",
    "timestamp": "2025-04-16T21:28:00Z"
  },
  {
    "title": "Report: Canada’s Immigration Lawyers ‘Overwhelmed’ with Transgender Asylum Requests from U.S.",
    "description": "Canadian media reported this week that immigration attorneys and LGBTQQIAAP2S+ activists have noticed a significant spike in the number of requests for information from Americans identifying as transgender seeking to move to Canada, claiming persecution under…",
    "link": "https://freerepublic.com/focus/f-chat/4311441/posts",
    "timestamp": "2025-04-16T21:27:39Z"
  },
  {
    "title": "Report: Canada’s Immigration Lawyers ‘Overwhelmed’ with Transgender Asylum Requests from U.S.",
    "description": "Canadian media reported this week that immigration attorneys and LGBTQQIAAP2S+ activists have noticed a significant spike in the number of requests for information from Americans identifying as transgender seeking to move to Canada, claiming persecution under…",
    "link": "https://freerepublic.com/focus/f-news/4311441/posts",
    "timestamp": "2025-04-16T21:27:39Z"
  },
  {
    "title": "FEMA Denies Washington State Disaster Relief From Bomb Cyclone, Governor Says",
    "description": "The Federal Emergency Management Agency has denied Washington state’s request for emergency relief funds to help repair an estimated $34 million in damage from a deadly bomb cyclone storm system in November, according to Gov. Bob Ferguson. Ferguson said in …",
    "link": "https://www.claimsjournal.com/news/national/2025/04/16/330084.htm",
    "timestamp": "2025-04-16T21:26:49Z"
  },
  {
    "title": "Tariffs Are Doing Strange Things to Mortgage Rates. What Homebuyers Need to Know",
    "description": "A realtor explains how Trump's tariff agenda put interest rates on a roller coaster.",
    "link": "https://www.cnet.com/personal-finance/mortgages/tariffs-are-doing-strange-things-to-mortgage-rates-what-homebuyers-need-to-know/",
    "timestamp": "2025-04-16T21:26:32Z"
  },
  {
    "title": "El Salvador rejects US senator's plea to free wrongly deported migrant",
    "description": "SAN SALVADOR: A Democratic senator said Wednesday (Apr 16) that El Salvador had denied his request to release a US resident whose wrongful deportation triggered a political firestorm over President Donald Trump's hard-line immigration policies. Chris Van Holl…",
    "link": "https://www.channelnewsasia.com/world/el-salvador-rejects-us-senators-plea-free-wrongly-deported-migrant-5070606",
    "timestamp": "2025-04-16T21:25:19Z"
  },
  {
    "title": "Rep. Elise Stefanik eyes New York governor seat in 2026, sources say",
    "description": "GOP Rep. Elise Stefanik, an ally of President Donald Trump, is considering a run for governor of New York, a source familiar with her thinking told ABC News.",
    "link": "https://abcnews.go.com/Politics/rep-elise-stefanik-eyes-new-york-governor-seat/story?id=120883614",
    "timestamp": "2025-04-16T21:25:11Z"
  },
  {
    "title": "The courts are essentially telling Donald Trump that they are ordering him, \"do not break this law,\" and Trump is telling the courts, \"I can break any law I want because John Roberts told me I can\" [Obvious]",
    "description": "The courts are essentially telling Donald Trump that they are ordering him, \"do not break this law,\" and Trump is telling the courts, \"I can break any law I want because John Roberts told me I can\"",
    "link": "https://www.fark.com/comments/13637302/The-courts-are-essentially-telling-Donald-Trump-that-they-are-ordering-him-do-not-break-this-law-Trump-is-telling-courts-I-can-break-any-law-I-want-because-John-Roberts-told-me-I-can",
    "timestamp": "2025-04-16T21:22:48Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "Consensus has been reached on a draft pandemic agreement after more than three years of intensive negotiations. By that, Member States of the World Health Organization took a major step forward in efforts to make the world safer from pandemics.",
    "link": "https://press.un.org/en/2025/db250416.doc.htm",
    "timestamp": "2025-04-16T21:22:36Z"
  },
  {
    "title": "California Files Lawsuit Against Trump's Tariffs",
    "description": "Today, the state of California filed a lawsuit challenging Donald Trump's massive new tariffs. The complaint is available here. The arguments California",
    "link": "https://reason.com/volokh/2025/04/16/california-files-lawsuit-against-trumps-tariffs/",
    "timestamp": "2025-04-16T21:21:55Z"
  },
  {
    "title": "Race to Succeed McConnell in Senate Heats Up",
    "description": "After former Senate Majority Leader Mitch McConnell, R-Ky., announced in February his intention to retire at the end of his current term, it set off... Read More\nThe post Race to Succeed McConnell in Senate Heats Up appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/04/16/race-succeed-mitch-mcconnell-senate-heats-up/",
    "timestamp": "2025-04-16T21:14:37Z"
  },
  {
    "title": "Stocking up on shares? Tread carefully as Trump’s tariff pause has yet to settle, experts warn",
    "description": "His 90-day halt on reciprocal tariffs does not mean things are back to square one, they say. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/stocking-up-on-shares-tread-carefully-as-trumps-tariff-pause-yet-to-settle-experts-warn",
    "timestamp": "2025-04-16T21:14:13Z"
  },
  {
    "title": "Top NIH nutrition researcher studying ultraprocessed foods departs, citing censorship under Kennedy | CNN",
    "description": "When President Donald Trump named Robert F. Kennedy Jr. as his choice to lead the US Department of Health and Human Services, one group of health researchers was cautiously optimistic that their cause would finally have a champion at the highest levels of gov…",
    "link": "https://www.cnn.com/2025/04/16/health/nih-nutrition-researcher-departs/index.html",
    "timestamp": "2025-04-16T21:12:37Z"
  },
  {
    "title": "Trump administration plans to ask Congress to defund PBS, NPR",
    "description": "PBS CEO Paula Kerger said that the loss of funding would devastate local stations, \"particularly smaller and rural stations who rely on federal funding for a larger portion of their budgets.”",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-plans-to-ask-congress-to-defund-pbs-npr",
    "timestamp": "2025-04-16T21:12:23Z"
  },
  {
    "title": "Trump’s IRS Pick Had Some Interesting People Pay Off His Personal Debt",
    "description": "Donald Trump’s nominee to run the IRS, Representative Billy Long, just had a six-figure debt paid off by campaign donors, all of whom happen to have tax issues with the IRS.\r\nLong reported in campaign finance disclosures that he loaned $130,000 to his unsucce…",
    "link": "https://newrepublic.com/post/194087/trump-irs-pick-billy-long-personal-debt",
    "timestamp": "2025-04-16T21:12:00Z"
  },
  {
    "title": "SEC's next roundtable to discuss crypto custody with insiders",
    "description": "The US Securities and Exchange Commission (SEC) announced industry insiders from Kraken, Exodus, Anchorage Digital, and others would be participating in its crypto task force’s roundtable discussion on custody.In an April 16 notice, the SEC said commissioners…",
    "link": "https://cointelegraph.com/news/sec-roundtable-crypto-custody",
    "timestamp": "2025-04-16T21:10:42Z"
  },
  {
    "title": "'Disappeared overnight': DOGE quietly deletes $1 billion from its reported savings",
    "description": "The savings that have come from cuts in government staff and funding were being tracked online, but there was a substantial change in the numbers overnight, a new report said. Before President Donald Trump was sworn into office, he and tech billionaire Elon M…",
    "link": "https://www.rawstory.com/doge-2671785111/",
    "timestamp": "2025-04-16T21:08:59Z"
  },
  {
    "title": "Trump is very wrong about how much the US is collecting from tariffs",
    "description": "President Donald Trump has said the US is collecting much more tariff revenue than the data indicates.\nAndrew Thomas/Middle East Images via AFP\nTrump has said the US is collecting $2 billion in daily tariff revenue, but the data shows otherwise.\nUS Customs an…",
    "link": "https://biztoc.com/x/4a664519198b6f21",
    "timestamp": "2025-04-16T21:08:18Z"
  },
  {
    "title": "California’s Newsom Sues Trump Over ‘Toxic Uncertainty’ of Tariffs",
    "description": "California Governor Gavin Newsom sued to halt Donald Trump’s tariffs, setting up a high-stakes legal challenge to the president’s landmark effort to overhaul global trade.\nThe state is challenging Trump’s use of emergency powers to enact broad tariffs against…",
    "link": "https://biztoc.com/x/f63ea28ad864cd21",
    "timestamp": "2025-04-16T21:08:17Z"
  },
  {
    "title": "Ex-CISA chief Chris Krebs leaving SentinelOne following Trump pressure",
    "description": "WASHINGTON : Christopher Krebs, whom President Donald Trump fired as head of the Cybersecurity and Infrastructure Security Agency in 2020, said on Wednesday he is leaving cybersecurity company SentinelOne following pressure from Trump. An email from Krebs, po…",
    "link": "https://www.channelnewsasia.com/business/ex-cisa-chief-chris-krebs-leaving-sentinelone-following-trump-pressure-5070586",
    "timestamp": "2025-04-16T21:08:05Z"
  },
  {
    "title": "Ex-CISA chief Chris Krebs leaving SentinelOne following Trump pressure, sources say",
    "description": "WASHINGTON : Ex-Cybersecurity and Infrastructure Security Agency chief Christopher Krebs is leaving cybersecurity company SentinelOne following pressure from President Donald Trump, according to two sources familiar with the matter.SentinelOne did not immedia…",
    "link": "https://www.channelnewsasia.com/business/ex-cisa-chief-chris-krebs-leaving-sentinelone-following-trump-pressure-sources-say-5070586",
    "timestamp": "2025-04-16T21:08:05Z"
  },
  {
    "title": "Jon Stewart apologized for misjudging Trump. Now his real work begins.",
    "description": "“The Daily Show” host Jon Stewart seemed to concede that he was wrong to not take Trump seriously early on.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/jon-stewart-daily-show-trump-apology-rcna201609",
    "timestamp": "2025-04-16T21:07:44Z"
  },
  {
    "title": "Dutton and Albanese dodge difficult questions in second leaders debate",
    "description": "Last night's debate on the ABC was most notable for the questions that went (repeatedly) unanswered, and it's another day of polling misery for Peter Dutton.\nThe post Dutton and Albanese dodge difficult questions in second leaders debate appeared first on Cri…",
    "link": "http://www.crikey.com.au/2025/04/17/leaders-debate-abc-albanese-dutton-trump/",
    "timestamp": "2025-04-16T21:06:59Z"
  },
  {
    "title": "Trump's tariffs could put the US in a catch-22 between tackling inflation and unemployment",
    "description": "“Tariffs are highly likely to generate at least a temporary rise in inflation,” the head of the US’s Federal Reserve said today.",
    "link": "https://www.thejournal.ie/trumps-tariffs-could-put-the-us-in-a-catch-22-between-tackling-inflation-and-unemployment-6680275-Apr2025/",
    "timestamp": "2025-04-16T21:04:19Z"
  },
  {
    "title": "Belgium eyes welfare cuts to meet NATO target – minister",
    "description": "Belgium has revealed plans to raise debt and cut welfare amid US push for higher NATO spending Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615839-eu-belgium-military-spending-nato/",
    "timestamp": "2025-04-16T21:03:28Z"
  },
  {
    "title": "Trump Family’s Crypto Venture Nets $25 Million Investment From Firm Suspected of Fraud",
    "description": "DWF, a crypto firm that has faced allegations of market manipulation through \"wash trading,\" backed a token from Trump's World Liberty Financial.",
    "link": "http://www.rollingstone.com/culture/culture-features/trump-family-crypto-dwf-1235318209/",
    "timestamp": "2025-04-16T21:02:44Z"
  },
  {
    "title": "UK’s Labour PM Starmer Must Embrace Trump’s Free-Speech Agenda and Repeal Censorship Laws To Secure a Trade Deal: REPORT",
    "description": "As the UK navigates potential trade agreements, Labour leader Keir Starmer faces crucial decisions on free speech and censorship that could shape his party's future and international relations.\nThe post UK’s Labour PM Starmer Must Embrace Trump’s Free-Speech …",
    "link": "https://www.thegatewaypundit.com/2025/04/uks-labour-pm-starmer-must-embrace-trumps-free/",
    "timestamp": "2025-04-16T21:00:38Z"
  },
  {
    "title": "Local Shops in Utah Are Feeling the Sting of Trump’s Tariffs",
    "description": "As the Trump administration moves forward with tariffs on imports from Canada, Mexico and China, local Utah businesses are bracing for potential impacts.  President Donald Trump has been clear about his plans to tackle trade policies since coming into office …",
    "link": "https://dailyutahchronicle.com/2025/04/16/local-shops-in-utah-are-feeling-the-sting-of-trumps-tariffs/",
    "timestamp": "2025-04-16T21:00:19Z"
  },
  {
    "title": "Nvidia and major AI chipmakers slump - after new China rules revealed",
    "description": "Stocks in leading AI chipmakers have slumped after firms said new restrictions on exports to China would cost them billions.",
    "link": "https://news.sky.com/story/nvidia-and-major-chipmakers-slump-on-the-stock-market-after-new-china-restrictions-revealed-13350228",
    "timestamp": "2025-04-16T21:00:00Z"
  },
  {
    "title": "Trump Has No Shortage Of Targets In His War Against Blue State Climate Lawfare",
    "description": "Attorney General Pam Bondi will have 60 days to provide a report to Trump outlining laws, lawsuits and other policies to target with legislation or other actions. The Justice Department declined to comment.",
    "link": "https://wattsupwiththat.com/2025/04/16/trump-has-no-shortage-of-targets-in-his-war-against-blue-state-climate-lawfare/",
    "timestamp": "2025-04-16T21:00:00Z"
  },
  {
    "title": "Prologis Delivers Strong Earnings, Blasts “Instability” of Trump’s Tariff Policy",
    "description": "Even amid the turmoil of tariffs, Prologis still delivered an impressive first quarter for its investors, but that didn’t stop the firm leadership from voicing their concerns with President Donald Trump’s ad hoc tariff policy.  The industrial giant reported t…",
    "link": "http://commercialobserver.com/2025/04/prologis-strong-earnings-trump-tariff-policy/",
    "timestamp": "2025-04-16T20:57:58Z"
  },
  {
    "title": "Air Force Deletes Pages on First Female Thunderbirds Pilot Amid DEI Purge",
    "description": "The U.S. Air Force has taken down content honoring trailblazing female pilots, including the first woman to fly with the elite air squadron.",
    "link": "https://www.newsweek.com/air-force-deletes-pages-first-female-thunderbirds-pilot-amid-dei-purge-2060688",
    "timestamp": "2025-04-16T20:57:49Z"
  },
  {
    "title": "AG Bondi Says Case of Federal Judge Blocking NH Parents from Protesting Trans Athletes Is Under Review",
    "description": "In September, several parents wore pink wristbands with “XX” on them as a sign of protest during a girls’ high school soccer game where trans-identifying male athlete Parker Tirrell, now 16, was playing on the other team.\nThe post AG Bondi Says Case of Federa…",
    "link": "https://www.breitbart.com/politics/2025/04/16/ag-bondi-says-case-of-federal-judge-blocking-nh-parents-from-protesting-trans-athletes-is-under-review/",
    "timestamp": "2025-04-16T20:57:22Z"
  },
  {
    "title": "Barclays Flags Medtronic, J&J as Most at Risk from Looming Pharma Tariffs",
    "description": "Barclays outlines which MedTech stocks could feel the most pressure from Trump's anticipated global pharmaceutical tariffs",
    "link": "https://finance.yahoo.com/news/barclays-flags-medtronic-j-j-205643888.html",
    "timestamp": "2025-04-16T20:56:43Z"
  },
  {
    "title": "Trump is very wrong about how much the US is collecting from tariffs",
    "description": "Trump's claim of $2 billion daily tariff revenue is contradicted by US Customs and Treasury data, which show much lower amounts collected.",
    "link": "https://www.businessinsider.com/trump-says-us-collecting-more-tariff-revenue-than-data-shows-2025-4",
    "timestamp": "2025-04-16T20:56:30Z"
  },
  {
    "title": "European Commission to wean off Russian oil, gas imports after Trump criticism: Trump has said Europe should make up for US trade deficit by purchasing more US fuel supplies",
    "description": "The European Commission is working on a proposal to cut off Russian oil and gas imports after facing criticism for heavy dependence on Russian President Vladimir Putin for energy. A vote on the proposal is expected on May 6, though the exact date may change, …",
    "link": "https://freerepublic.com/focus/f-news/4311435/posts",
    "timestamp": "2025-04-16T20:56:27Z"
  },
  {
    "title": "‘Damaging’: 'Frustration grows' in red states as farmers brace for 'hard hit' from Trump",
    "description": "The international trade war unleashed by Donald Trump’s massive set of tariffs on China is starting to present a growing dilemma for U.S. soybean farmers – and it could come at a political cost to the president.That’s according to a new report in the Atlantic…",
    "link": "https://www.rawstory.com/trump-tariffs-2671785071/",
    "timestamp": "2025-04-16T20:55:25Z"
  },
  {
    "title": "New York Attorney General James is latest target of Trump’s revenge term",
    "description": "The president’s federal housing director suggested the state official who investigated Trump should face prosecution by Trump’s DOJ.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-doj-prosecute-new-york-ag-letitia-james-rcna201554",
    "timestamp": "2025-04-16T20:53:01Z"
  },
  {
    "title": "He saved the Liberal Party from oblivion. But can Mark Carney close the deal?",
    "description": "Many questions remain about the rookie politician with a long resume. “If he gives people a reason not to vote for him, they won’t.\"",
    "link": "https://nationalpost.com/news/politics/who-is-mark-carney-election-profile",
    "timestamp": "2025-04-16T20:50:28Z"
  },
  {
    "title": "Maryland senator meets with El Salvador’s vice president in push for Abrego Garcia’s release",
    "description": "Sen. Chris Van Hollen, D-Md., traveled to El Salvador on Wednesday and met with the country's vice president to push for the release of Kilmar Abrego Garcia, a man who was sent there by the Trump administration in March despite an immigration court order prev…",
    "link": "https://www.pbs.org/newshour/politics/maryland-senator-meets-with-el-salvadors-vice-president-in-push-for-abrego-garcias-release",
    "timestamp": "2025-04-16T20:49:48Z"
  },
  {
    "title": "How the Pandemic Rewired My Sense of Place and Time",
    "description": "In general, I’ve lived a long and happy life. Sure, there have been intervals of hardship — I lost my mother and a sister too […]",
    "link": "https://www.phillymag.com/news/2025/04/16/post-pandemic-disorientation-nostalgia/",
    "timestamp": "2025-04-16T20:49:30Z"
  },
  {
    "title": "Judge Rules Trump Administration Must Unfreeze Climate Funding",
    "description": "A federal judge ruled yesterday that five government agencies must release billions of dollars in funding for climate and infrastructure-related projects that had been paused by the Trump administration. Via the Washington Post:\nU.S. District Judge Mary McElr…",
    "link": "https://crooksandliars.com/2025/04/judge-rules-trump-administration-must",
    "timestamp": "2025-04-16T20:49:08Z"
  },
  {
    "title": "Here’s How Much Money Trump’s Tariffs Are Actually Making",
    "description": "U.S. Customs and Border Protection has revealed how much money has been generated from Donald Trump’s tariffs—and it’s not nearly as much as the president has claimed, NBC News reported Wednesday. \r\n“Since April 5, CBP has collected over $500 million under th…",
    "link": "https://newrepublic.com/post/194081/donald-trump-tariffs-how-much-money",
    "timestamp": "2025-04-16T20:48:05Z"
  },
  {
    "title": "Thailand sets sights on US gas",
    "description": "<p>Thailand plans to buy an additional 1 million tonnes of liquefied natural gas (LNG) worth US$500 million (about 16.6 billion baht) from the United States over the next five years as part of efforts to ease the trade imbalance that led Washington to impose …",
    "link": "https://www.bangkokpost.com/business/general/3004447/thailand-sets-sights-on-us-gas",
    "timestamp": "2025-04-16T20:48:00Z"
  },
  {
    "title": "Govt sets sights on US gas",
    "description": "<p>Thailand plans to buy an additional 1 million tonnes of liquefied natural gas (LNG) worth US$500 million (about 16.6 billion baht) from the United States over the next five years as part of efforts to ease the trade imbalance that led Washington to impose …",
    "link": "https://www.bangkokpost.com/business/general/3004447/govt-sets-sights-on-us-gas",
    "timestamp": "2025-04-16T20:48:00Z"
  },
  {
    "title": "I have $3,000 to invest: Should I go all in on SCHD or mix it with VOO?",
    "description": "The market climate at the time of this writing can be described in a number of ways, but “boring” is certainly not one of them. Ever since President Donald Trump announced his policy of reciprocal tariffs to level the international trade playing field, the st…",
    "link": "https://biztoc.com/x/763c4a5b3efa84fb",
    "timestamp": "2025-04-16T20:46:28Z"
  },
  {
    "title": "A falha tentativa de Meghan Markle de imitar Trump, segundo especialista",
    "description": "Duquesa de Sussex lançou o podcast 'Confessions of a Female Founder'",
    "link": "https://veja.abril.com.br/coluna/veja-gente/a-falha-tentativa-de-meghan-markle-de-imitar-trump-segundo-especialista/",
    "timestamp": "2025-04-16T20:43:27Z"
  },
  {
    "title": "Why a soak-the-rich tax hike is a disaster — for the economy and for Trump",
    "description": "From President Kennedy to President Reagan, the most successful periods of economic expansion in American history followed significant reductions in tax rates.",
    "link": "https://nypost.com/2025/04/16/opinion/soak-the-rich-tax-hike-a-disaster-for-the-economy-and-for-trump/",
    "timestamp": "2025-04-16T20:43:07Z"
  },
  {
    "title": "BREAKING: Obama Judge Chutkan Blocks EPA Chief Lee Zeldin From Clawing Back $20 Billion From Biden EPA Slush Fund – Trump Spox Responds",
    "description": "A federal judge has issued a significant injunction preventing the EPA from reclaiming billions from Citibank, highlighting ongoing tensions between regulatory authority and corporate interests under the current administration.\nThe post BREAKING: Obama Judge …",
    "link": "https://www.thegatewaypundit.com/2025/04/breaking-obama-judge-chutkan-blocks-epa-chief-lee/",
    "timestamp": "2025-04-16T20:40:50Z"
  },
  {
    "title": "James Boasberg: About the Judge Challenging the Trump Administration’s Deportations",
    "description": "Chief Judge of the United States District Court for the District of Columbia, James Boasberg, is holding the Trump administration accountable after deportations occurred without following legal procedures. Learn more about him below.",
    "link": "https://hollywoodlife.com/feature/who-is-james-boasberg-5381063/",
    "timestamp": "2025-04-16T20:39:45Z"
  },
  {
    "title": "Free IRS Direct File service for taxpayers to end, according to reports",
    "description": "IRS Direct File isn't wasn't the only way to file your taxes for free, but it seemed like the easiest.",
    "link": "https://www.zdnet.com/article/free-irs-direct-file-service-for-taxpayers-to-end-according-to-reports/",
    "timestamp": "2025-04-16T20:38:02Z"
  },
  {
    "title": "California sues Trump administration in attempt to block tariffs",
    "description": "California on Wednesday filed a lawsuit seeking to block US President Donald Trump's sweeping tariffs on foreign trading partners, accusing him of abusing his powers and inflicting financial harm on the state and nation.",
    "link": "https://www.independent.ie/world-news/california-sues-trump-administration-in-attempt-to-block-tariffs/a1711489547.html",
    "timestamp": "2025-04-16T20:37:37Z"
  },
  {
    "title": "Are Public Broadcasters About To Lose Their Subsidies?",
    "description": "Will the government cut off its subsidies to public broadcasters this year? The New York Post reports that the White House's \"rescissions\" plan will",
    "link": "https://reason.com/2025/04/16/are-public-broadcasters-about-to-lose-their-subsidies/",
    "timestamp": "2025-04-16T20:36:46Z"
  },
  {
    "title": "Donald Trump’s Approval Is Sliding",
    "description": "Donald Trump remains deeply unpopular. At this point in his term, Trump’s net approval rating is more than 20 points worse than Joe Biden’s—who, until now, held the distinction of being the least popular new",
    "link": "https://politicalwire.com/2025/04/16/donald-trumps-approval-is-sliding/",
    "timestamp": "2025-04-16T20:36:17Z"
  },
  {
    "title": "Stocks sink, bonds climb as ‘Fed put’ hopes dashed",
    "description": "Stocks extended losses, breaking a brief spell of calm, after the Federal Reserve warned trade tensions may undermine stability. Read here",
    "link": "https://financialpost.com/investing/stocks-sink-bonds-climb-as-fed-put-hopes-dashed",
    "timestamp": "2025-04-16T20:35:59Z"
  },
  {
    "title": "‘It’s INSANE!’ Trump-Supporting Comedian Slams President For Arresting Student Over Israel Criticism",
    "description": "Comedian Dave Smith went off on President Donald Trump's administration for the arrest of another Columbia University student involved in protests.\nThe post ‘It’s INSANE!’ Trump-Supporting Comedian Slams President For Arresting Student Over Israel Criticism f…",
    "link": "https://www.mediaite.com/podcasts/its-insane-trump-supporting-comedian-slams-president-for-arresting-student-over-israel-criticism/",
    "timestamp": "2025-04-16T20:35:21Z"
  },
  {
    "title": "Summers slams Trump ‘tyranny’ in escalating attacks on Harvard",
    "description": "Former Harvard University President Larry Summers assailed President Donald Trump over his deepening attacks on the school, slamming a “wildly extralegal” federal funding freeze earlier this week and warning of government “tyranny.” \n“This is not an isolated …",
    "link": "https://biztoc.com/x/7bea68129837cb0f",
    "timestamp": "2025-04-16T20:35:10Z"
  },
  {
    "title": "Trump vs. the racists, an Obama-esque Iran play and other commentary",
    "description": "“The political Right has come to accept that if there must be a civil-rights regime, it should be one of its own making,” observes City Journal’s Christopher F. Rufo.",
    "link": "https://nypost.com/2025/04/16/opinion/trump-vs-the-racists-an-obama-esque-iran-play-and-other-commentary/",
    "timestamp": "2025-04-16T20:33:58Z"
  },
  {
    "title": "IRS making plans to rescind Harvard’s tax-exempt status | CNN Politics",
    "description": "The Internal Revenue Service is making plans to rescind the tax-exempt status of Harvard University, according to two sources familiar with the matter, which would be an extraordinary step of retaliation as the Trump administration seeks to turn up pressure o…",
    "link": "https://www.cnn.com/2025/04/16/politics/irs-harvard-tax-exempt-status/index.html",
    "timestamp": "2025-04-16T20:33:47Z"
  },
  {
    "title": "EXCLUSIVE: TIME Slated Over its 100 Most Influential People List: 'A Bunch of Millionaires, Idiots… and Donald Trump'",
    "description": "Critics warned the outlet would 'lose subscribers' after 'pandering' to billionaires and the Trump administration.",
    "link": "https://radaronline.com/p/time-100-donald-trump-elon-musk-jd-vance-robert-f-kennedy-jr/",
    "timestamp": "2025-04-16T20:33:10Z"
  },
  {
    "title": "What Is DHgate? Trump Tariffs Drive Surge in Downloads for Chinese Apps",
    "description": "The fallout from President Donald Trump's sky-high tariffs on China have consumers looking deeper into Chinese shopping platforms, but they still might not be a way around import taxes.",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177047019",
    "timestamp": "2025-04-16T20:32:59Z"
  },
  {
    "title": "Trump DOJ Announces Legal Action Against State That Refuses to Comply with Transgender Directive",
    "description": "Trump DOJ Announces Legal Action Against State That Refuses to Comply with Transgender Directivewesternjournal.com",
    "link": "https://www.westernjournal.com/trump-doj-announces-legal-action-state-refuses-comply-transgender-directive/",
    "timestamp": "2025-04-16T20:32:56Z"
  },
  {
    "title": "DAVID MARCUS: Americans get it. Trump's moves to clean up Biden's open border chaos will be messy",
    "description": "Americans do not relish the position our feckless leaders have put us in by failing to enforce our nation’s laws. But we simply can't accept the consequences of having no border.",
    "link": "https://www.foxnews.com/opinion/david-marcus-americans-get-it-trumps-moves-clean-up-bidens-open-border-chaos-messy",
    "timestamp": "2025-04-16T20:32:53Z"
  },
  {
    "title": "Trump Is Talking About Finding Ways to Send U.S. Citizens to Salvadoran Prison",
    "description": "The idea once again involves America's new partner in lawless deportations.",
    "link": "https://slate.com/news-and-politics/2025/04/trump-news-immigration-deportation-el-salvador-prison.html",
    "timestamp": "2025-04-16T20:31:33Z"
  },
  {
    "title": "Who will win the US-China trade war?",
    "description": "US-China trade war escalates with huge stakes for the economies of both nations and the rest of the world.",
    "link": "https://www.aljazeera.com/program/counting-the-cost/2025/4/16/who-will-win-the-us-china-trade-war",
    "timestamp": "2025-04-16T20:31:10Z"
  },
  {
    "title": "U.S. senator who travelled to El Salvador says he's been denied access to Kilmar Abrego Garcia",
    "description": "Democratic U.S. Senator Chris Van Hollen said on Wednesday authorities in El Salvador had denied him access to Kilmar Abrego Garcia, the Salvadoran man mistakenly deported and being held in a notorious prison in the country.",
    "link": "https://www.cbc.ca/news/world/us-senator-el-salvador-kilmar-abrego-garcia-1.7512059",
    "timestamp": "2025-04-16T20:30:51Z"
  },
  {
    "title": "Bigger Asean could counter tariffs",
    "description": "<p>When US President Donald Trump finally unleashed his long-threatened tariff blitz, the scale and scope were far worse than most governments expected. It came as no surprise that China would be the hardest hit, but the punishing duties imposed on most Asian…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3004617/bigger-asean-could-counter-tariffs",
    "timestamp": "2025-04-16T20:30:00Z"
  },
  {
    "title": "Backing Trump on tariffs, not on tone",
    "description": "<p>I'm not a Donald Trump supporter. On the contrary, I dislike the US president for his abrasive behaviour. For Mr Trump, everything is nothing but numbers. Compassion has no meaning in his dictionary.</p>",
    "link": "https://www.bangkokpost.com/opinion/opinion/3004472/backing-trump-on-tariffs-not-on-tone",
    "timestamp": "2025-04-16T20:30:00Z"
  },
  {
    "title": "Trump-appointed judge orders Trump admin to 'turn the funding spigots back on' | TechCrunch",
    "description": "U.S. District Judge Mary McElroy said that the administrations actions were “neither reasonable nor reasonably explained.”",
    "link": "https://techcrunch.com/2025/04/16/trump-appointed-judge-orders-trump-admin-to-turn-the-funding-spigots-back-on/",
    "timestamp": "2025-04-16T20:26:33Z"
  },
  {
    "title": "Texas Pacific Land (TPL): Among Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout",
    "description": "We recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look...",
    "link": "https://finance.yahoo.com/news/texas-pacific-land-tpl-among-202549933.html",
    "timestamp": "2025-04-16T20:25:49Z"
  },
  {
    "title": "Donald Trump’s Health Results Just Went Public—And It’s Not What Anyone Expected!",
    "description": "Donald Trump underwent a comprehensive physical last Friday at Walter Reed Medical Center. And the results are an excellent clapback to his critics.",
    "link": "https://www.inquisitr.com/donald-trumps-health-results-just-went-public-and-its-not-what-anyone-expected",
    "timestamp": "2025-04-16T20:24:53Z"
  },
  {
    "title": "Canada, Japan Led Foreign Surge in Treasuries Buying in February",
    "description": "Foreign holdings of US Treasuries surged in February by the most since June 2021, with Canada and Japan among the biggest net buyers during a month that preceded the bond market’s recent turmoil.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-japan-led-foreign-surge-in-treasuries-buying-in-february",
    "timestamp": "2025-04-16T20:24:02Z"
  },
  {
    "title": "What's Going On With Apple Shares Wednesday?",
    "description": "Apple Inc (NASDAQ:APPL) shares moved lower on Wednesday. The stock may have moved lower today on continued weakness as investors continue to weigh the potential impact of tariffs and other policy decisions.\nWhat To Know: Earlier this week, President Donald Tr…",
    "link": "https://biztoc.com/x/eb929c4bd04e3ec1",
    "timestamp": "2025-04-16T20:23:50Z"
  },
  {
    "title": "Rubio Memo: Mohsen Mahdawi’s Presence in US Undermines Gaza “Peace” Prospects",
    "description": "Federal officials are seeking to deport the Columbia pro-Palestine protester to the occupied West Bank.",
    "link": "https://truthout.org/articles/rubio-memo-mohsen-mahdawis-presence-in-us-undermines-gaza-peace-prospects/",
    "timestamp": "2025-04-16T20:23:48Z"
  },
  {
    "title": "Many HBCUs need government funding but some are preparing for a future without it",
    "description": "Colleges across the country are facing battles with the federal government over funding, but similar cuts and the potential elimination of the Education Department may be existential for historically Black colleges and universities, according to at least six …",
    "link": "https://www.nbcnews.com/news/nbcblk/many-hbcus-need-government-funding-are-preparing-future-rcna201380",
    "timestamp": "2025-04-16T20:22:37Z"
  },
  {
    "title": "This ICE-snitching app is actually promoting a meme coin",
    "description": "Right-wing influencers are shilling an app that purportedly lets people earn crypto for reporting sightings of undocumented immigrants. ICERAID, a â\u0080\u009cGovFi protocol that delegates intelligence gathering tasks to citizens,â\u0080\u009d has recently been promoted by the …",
    "link": "https://www.theverge.com/tech/650015/iceraid-app-immigrant-bounty-hunting-crypto",
    "timestamp": "2025-04-16T20:21:30Z"
  },
  {
    "title": "But If Elon Sperms All The Babies, All The Babies Will Look Like Elon :(",
    "description": "Guh-rossest article ever.",
    "link": "https://www.wonkette.com/p/but-if-elon-sperms-all-the-babies",
    "timestamp": "2025-04-16T20:20:13Z"
  },
  {
    "title": "China’s DeepSeek AI Poses ‘Profound Threat’ To National Security, House Report Claims",
    "description": "A bipartisan House committee accused the Chinese AI startup of harvesting American users’ data.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/16/chinas-deepseek-ai-poses-profound-threat-to-national-security-house-report-claims/",
    "timestamp": "2025-04-16T20:20:05Z"
  },
  {
    "title": "California becomes first state to sue over Trump tariffs",
    "description": "The state - the 5th largest world economic power - says it is being disproportionately impacted by the tariffs.",
    "link": "https://www.bbc.com/news/articles/cp8vjer0882o",
    "timestamp": "2025-04-16T20:19:37Z"
  },
  {
    "title": "Trump Agrees To Bring Garcia Home If El Salvador Will Keep Cory Booker",
    "description": "WASHINGTON, D.C. — With controversy ongoing over a judge ordering a deported MS-13 gang member to be returned to the U.S., news broke that President Donald Trump had agreed to bring Kilmar Abrego Garcia home if El Salvador would keep Senator Cory Booker.",
    "link": "https://babylonbee.com/news/trump-agrees-to-bring-garcia-home-if-el-salvador-will-keep-cory-booker",
    "timestamp": "2025-04-16T20:19:37Z"
  },
  {
    "title": "GOP Rep Says Arson On Shapiro's House Should Make Him 'Tone It Down' On Trump",
    "description": "He also compared the attack during Passover to anti-Tesla vandalism.",
    "link": "https://www.huffpost.com/entry/josh-shapiro-dan-meuser-arson_n_67fff3d1e4b0485a7732ab8a",
    "timestamp": "2025-04-16T20:19:20Z"
  },
  {
    "title": "Maternity Hospitals Fear a Medicaid Squeeze",
    "description": "U.S. maternity outcomes are inferior to every other developed country. They could still get worse.",
    "link": "https://www.newsweek.com/maternity-hospitals-fear-medicaid-squeeze-2060679",
    "timestamp": "2025-04-16T20:16:25Z"
  }
]