[
  {
    "title": "Dead Canary In The Zoomer Coal Mine? Disillusion Among Key Trump Backers Spells Danger Ahead",
    "description": "Donald Trump won over the support of several influential comedians and podcasters leading up to the 2024 election, but they are beginning to express remorse.",
    "link": "https://dailycaller.com/2025/10/07/donald-trump-ice-immigration-gen-z-comedians-joe-rogan-theo-von/",
    "timestamp": "2025-10-07T19:15:52Z"
  },
  {
    "title": "Texas Ends ABA’s Accreditation Monopoly in the Lone Star State",
    "description": "In the little over 100 years since its founding, the American Bar Association has transformed from an organization designed to promote best practices in the... Read More\nThe post Texas Ends ABA’s Accreditation Monopoly in the Lone Star State appeared first on…",
    "link": "https://www.dailysignal.com/2025/10/07/texas-ends-abas-accreditation-monopoly-in-lone-star-state/",
    "timestamp": "2025-10-07T19:15:00Z"
  },
  {
    "title": "SCOTUS Created The Trump Dictatorship, Period",
    "description": "Graham G. Dodds, Concordia University\nPresident Donald Trump set the tone for his second term by issuing 26 executive orders, four proclamations and 12 memorandums on his first day back in office. The barrage of unilateral presidential actions has not yet let…",
    "link": "https://crooksandliars.com/2025/10/scotus-created-trump-dictatorship-period",
    "timestamp": "2025-10-07T19:14:01Z"
  },
  {
    "title": "Trump's DHS Releases Zero Migrants into U.S. for Fifth Consecutive Month",
    "description": "For the fifth consecutive month this year, President Donald Trump's Department of Homeland Security (DHS) has released zero migrants into the United States interior.\nThe post Trump’s DHS Releases Zero Migrants into U.S. for Fifth Consecutive Month appeared fi…",
    "link": "https://www.breitbart.com/politics/2025/10/07/trumps-dhs-releases-0-migrants-into-us-for-fifth-consecutive-month/",
    "timestamp": "2025-10-07T19:11:00Z"
  },
  {
    "title": "Expect India-EU trade deal by year-end: Piyush Goyal",
    "description": "India's Unified Payments Interface (UPI) has officially expanded to Qatar, offering a convenient payment solution for the large Indian expatriate community and travelers. This rollout allows UPI payments across all retail shops, not just select duty-free outl…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/expect-india-eu-trade-deal-by-year-end-piyush-goyal/articleshow/124371132.cms",
    "timestamp": "2025-10-07T19:10:47Z"
  },
  {
    "title": "Trump administration threatens no back pay for federal workers in shutdown",
    "description": "President Donald Trump’s administration is warning of no guaranteed back pay for federal workers during a shutdown",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-threatens-back-pay-federal-workers-shutdown-126296200",
    "timestamp": "2025-10-07T19:09:58Z"
  },
  {
    "title": "Victoria’s Secret Is Returning to “Sexy.” You’re Not Going to Like Why.",
    "description": "I hate to be the person who brings up Donald Trump in conversations about thongs, but ...",
    "link": "https://slate.com/life/2025/10/donald-trump-underwear-bras-victorias-secret-show-2025.html",
    "timestamp": "2025-10-07T19:09:11Z"
  },
  {
    "title": "Trump secretary hit with first-ever warning: ‘Cannot be ignored’",
    "description": "It is the first-of-its-kind warning from the former top health officials.",
    "link": "https://www.nj.com/politics/2025/10/trump-secretary-hit-with-first-ever-warning-cannot-be-ignored.html",
    "timestamp": "2025-10-07T19:06:15Z"
  },
  {
    "title": "‘Talk therapy’: Supreme Court hears case of Colorado counselor sanctioned over LGBT ideology",
    "description": "And Sotomayor goes down rabbit trail, demanding to know if licensed professional encourages her clients to vomit or exposes them to electric shock",
    "link": "https://www.wnd.com/2025/10/talk-therapy-supreme-court-hears-case-colorado-counselor/",
    "timestamp": "2025-10-07T19:05:56Z"
  },
  {
    "title": "Marjorie Taylor Greene Slams Bad Bunny's Call To Learn Spanish Ahead Of 'Perverse' Super Bowl Show in Renewed Push to Make English Official U.S. Language",
    "description": "Representative Marjorie Taylor Greene has renewed her push to make English the official language of the United States after Puerto Rican singer Bad Bunny told viewers during his \"Saturday Night Live\" monologue over the weekend that they had \"four months to le…",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-slams-bad-bunnys-call-learn-spanish-ahead-perverse-super-bowl-show-3786047",
    "timestamp": "2025-10-07T19:05:15Z"
  },
  {
    "title": "Today’s AI hype has echoes of a devastating technology boom and bust 100 years ago",
    "description": "AI is showing some of the hallmarks of another technology’s rapid rise and fall back in the 1920s. These are the lessons we could learn.",
    "link": "https://theconversation.com/todays-ai-hype-has-echoes-of-a-devastating-technology-boom-and-bust-100-years-ago-265492",
    "timestamp": "2025-10-07T19:04:48Z"
  },
  {
    "title": "Journey’s Jonathan Cain Honors Charlie Kirk with Tribute Song “No One Else”",
    "description": "The veteran musician says, \"Not since Billy Graham has anybody rocked the world like Charlie.\"\nJourney’s Jonathan Cain Honors Charlie Kirk with Tribute Song “No One Else”\nHeavy Consequence Staff",
    "link": "https://consequence.net/2025/10/journey-jonathan-cain-charlie-kirk-tribute-song/",
    "timestamp": "2025-10-07T19:04:21Z"
  },
  {
    "title": "Donald Trump Brands Bad Bunny's Super Bowl Halftime Show Selection 'Absolutely Ridiculous' In Fresh Attack At Latino Star",
    "description": "Donald Trump has blasted Bad Bunny's controversial selection as the Super Bowl Halftime Show performer — despite claiming he’s never heard of the rapper.",
    "link": "https://radaronline.com/p/donald-trump-brands-bad-bunny-super-bowl-halftime-show-ridiculous/",
    "timestamp": "2025-10-07T19:03:39Z"
  },
  {
    "title": "Donald Trump confirms Sean ‘Diddy’ Combs has asked him for a pardon",
    "description": "The 55-year-old rapper was jailed for four years and two months last month.",
    "link": "https://www.gettyimages.com/search/2/image?agreements=pa%3A214639&amp;family=editorial&amp;page=50&amp;phrase=Diddy&amp;sort=best&amp;phraseprocessing=excludenaturallanguage",
    "timestamp": "2025-10-07T19:02:35Z"
  },
  {
    "title": "Russia Criticizes U.S. Strike On Vessel Off Venezuelan Coast: 'Far-Reaching Consequences For The Region'",
    "description": "Russian Foreign Minister Sergei Lavrov criticized the U.S.'s strike on a vessel off the Venezuelan coast, expressing \"serious concern about Washington's escalating actions in the Caribbean Sea that are fraught with far-reaching consequences for the region\"",
    "link": "https://www.ibtimes.com/russia-criticizes-us-strike-vessel-off-venezuelan-coast-far-reaching-consequences-region-3786036",
    "timestamp": "2025-10-07T19:02:08Z"
  },
  {
    "title": "Democrats could have slight shot at winning House seat in Utah with new congressional map",
    "description": "Utah’s Republican-led Legislature has approved a revised congressional map that could give Democrats an improved chance at flipping a seat as the party fights to topple the GOP’s slim majority in the U.S. House.",
    "link": "https://www.pbs.org/newshour/politics/democrats-could-have-slight-shot-at-winning-house-seat-in-utah-with-new-congressional-map",
    "timestamp": "2025-10-07T19:01:49Z"
  },
  {
    "title": "'Appalling omission' flagged by legal experts in Epstein saga",
    "description": "The Jeffrey Epstein sex trafficking scandal has fallen catastrophically short in the one place above all else where it should matter, legal experts Rachel Foster, Dahlia Lithwick, Mimi Rocah, and Joyce Vance wrote for Slate on Tuesday.\"So far there has been a…",
    "link": "https://www.rawstory.com/epstein-2674161651/",
    "timestamp": "2025-10-07T19:00:07Z"
  },
  {
    "title": "Patel Fires FBI Agents, Ends CR-15 Squad After Learning Jack Smith Tracked GOP Senators",
    "description": "Patel also said the FBI \"initiated an ongoing investigation with more accountability measures ahead.\"\nThe post Patel Fires FBI Agents, Ends CR-15 Squad After Learning Jack Smith Tracked GOP Senators first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/patel-fires-fbi-agents-ends-cr-15-squad-after-learning-jack-smith-tracked-gop-senators/",
    "timestamp": "2025-10-07T19:00:05Z"
  },
  {
    "title": "Jimmy Kimmel Gloats About Beating Donald Trump in Popularity Polls",
    "description": "As Kimmel admitted, his lead should probably be even higher",
    "link": "https://www.cracked.com/article_48666_jimmy-kimmel-gloats-about-beating-donald-trump-in-popularity-polls.html",
    "timestamp": "2025-10-07T19:00:00Z"
  },
  {
    "title": "Ghislaine Maxwell, Jen Shah, Elizabeth Holmes Now at Same Prison: Will They Be Friends?",
    "description": "Reading Time: 4 minutesGhislaine Maxwell, Jen Shah, and Elizabeth Holmes could end up being besties. We previously wrote about how Jen Shah and …\nGhislaine Maxwell, Jen Shah, Elizabeth Holmes Now at Same Prison: Will They Be Friends? was originally published …",
    "link": "http://www.thehollywoodgossip.com/2025/10/ghislaine-maxwell-jen-shah-elizabeth-holmes-same-prison/",
    "timestamp": "2025-10-07T18:59:14Z"
  },
  {
    "title": "Trump to meet former Hamas hostage Edan Alexander on Oct. 7 anniversary",
    "description": "President Donald Trump meets with freed Hamas hostage Edan Alexander at the White House on Tuesday, marking exactly two years since the Oct. 7 attack on Israel.",
    "link": "https://www.foxnews.com/politics/trump-meet-former-hamas-hostage-edan-alexander-oct-7-anniversary",
    "timestamp": "2025-10-07T18:59:11Z"
  },
  {
    "title": "Trump meets former Hamas hostage Edan Alexander on Oct. 7 anniversary",
    "description": "President Donald Trump met with freed Hamas hostage Edan Alexander at the White House on Tuesday, marking exactly two years since the Oct. 7 attack on Israel.",
    "link": "https://www.foxnews.com/politics/trump-meets-former-hamas-hostage-edan-alexander-oct-7-anniversary",
    "timestamp": "2025-10-07T18:59:11Z"
  },
  {
    "title": "Trump to meet ex-Hamas hostage Edan Alexander on Oct. 7 anniversary",
    "description": "President Donald Trump meets with freed Hamas hostage Edan Alexander at the White House on Tuesday, marking exactly two years since the October 7 attack on Israel.",
    "link": "https://www.foxnews.com/politics/trump-meet-ex-hamas-hostage-edan-alexander-oct-7-anniversary",
    "timestamp": "2025-10-07T18:59:11Z"
  },
  {
    "title": "Trump administration threatens no back pay for federal workers in shutdown",
    "description": "President Donald Trump's administration warned Tuesday of no guaranteed back pay for federal workers during a government shutdown.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_d3383a50-bf02-5ba2-a650-9e7ddd83c96c.html",
    "timestamp": "2025-10-07T18:59:00Z"
  },
  {
    "title": "Trump administration threatens no back pay for federal workers in shutdown",
    "description": "President Donald Trump's administration warned Tuesday of no guaranteed back pay for federal workers during a government shutdown.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_97313c97-9b60-548e-83ae-31af50b9e04e.html",
    "timestamp": "2025-10-07T18:59:00Z"
  },
  {
    "title": "Kaitlan Collins Says Karoline Leavitt Did Her A Solid On Recent Trip",
    "description": "The CNN anchor was in a jam and credited the White House press secretary for getting her out of it.",
    "link": "https://www.huffpost.com/entry/kaitlan-collins-karoline-leavitt_n_68e54048e4b0b4dea1b6b59b",
    "timestamp": "2025-10-07T18:55:07Z"
  },
  {
    "title": "The weirdly modern Jane Austen debate we still haven’t figured out",
    "description": "There’s a bizarrely opaque, oddly modern question hovering over the legacy of Jane Austen. And despite centuries of debate, scholars still haven’t been able to figure out how to answer it. Jane Austen lived under the rule of a slave-trading empire. What did s…",
    "link": "https://www.vox.com/culture/463959/mansfield-park-jane-austen-empire-slavery-abolition-edward-said",
    "timestamp": "2025-10-07T18:54:33Z"
  },
  {
    "title": "Trump interrupts Carney to talk 'merger of Canada and the United States'",
    "description": "Prime Minister Mark Carney was listing Trump's achievements during White House visit when the U.S. president cut him off.",
    "link": "https://nationalpost.com/news/trump-interrupts-carney-to-talk-merger-of-canada-and-the-united-states",
    "timestamp": "2025-10-07T18:54:18Z"
  },
  {
    "title": "Hamas wants Trump's guarantees war will end",
    "description": "Hamas wants guarantees from United States President Donald Trump that the war in Gaza \"will end once and for all,\" the militant group's top negotiator Khalil El-Hayya told Al-Qahera News on Tuesday.\"W...",
    "link": "https://biztoc.com/x/21af243c3edf7995",
    "timestamp": "2025-10-07T18:53:45Z"
  },
  {
    "title": "Trump Likens Government Shutdown By Democrats To ‘Kamikaze Attack’",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 07, 2025\nPresident Donald Trump said the Democrats’ shutdown of the federal government is “like a kamikaze attack.”\n“They’re the ones that started it. They’re the ones that have it, and it’s almost li…",
    "link": "https://biztoc.com/x/f052cf9bd2d512b9",
    "timestamp": "2025-10-07T18:53:40Z"
  },
  {
    "title": "Can Trump bully Netanyahu into Gaza peace?",
    "description": "Israeli leader Benjamin Netanyahu shrugged off the world’s criticisms as he prosecuted his country’s war in Gaza. But with a peace deal possibly at hand, it’s clear there is one person he cannot ignore: President Donald Trump.\nNetanyahu was “strong-armed by T…",
    "link": "https://biztoc.com/x/52216d6883bdd0d5",
    "timestamp": "2025-10-07T18:53:27Z"
  },
  {
    "title": "'Don’t believe your lying eyes!' Hawley lashes out at reporter after he's fact-checked",
    "description": "Sen. Josh Hawley (R-MO) lashed out at Politico's Kyle Cheney on Tuesday when the legal reporter fact-checked the Republican about his claim he was \"wiretapped\" by President Joe Biden's administration. Special Counsel Jack Smith's investigative report, listed …",
    "link": "https://www.rawstory.com/josh-hawley-2674162915/",
    "timestamp": "2025-10-07T18:53:03Z"
  },
  {
    "title": "3597 - The Victims of Zionism w/ Avi Shlaim",
    "description": "It's News Day Tuesday on the Majority Report On Today's Show: Senator Sheldon Whitehouse (D-RI) stumps Attorney General Pam Bondi with questions over what became of the $50,000 that was delivered to Border Czar Tom Homan as a part of an FBI sting. Historian a…",
    "link": "https://majorityfm.libsyn.com/3597-the-victims-of-zionism-w-avi-shlaim",
    "timestamp": "2025-10-07T18:52:00Z"
  },
  {
    "title": "CNN Torpedoes ‘Absurd’ Trump Claims Minutes After Wild Oval Office Scrum",
    "description": "CNN reporters torpedoed Trump's \"absurd\" claims minutes after he made them at an Oval Office scrum with reporters as he met with PM Mark Carney.\nThe post CNN Torpedoes ‘Absurd’ Trump Claims Minutes After Wild Oval Office Scrum first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/cnn-torpedoes-absurd-trump-claims-minutes-after-wild-oval-office-scrum/",
    "timestamp": "2025-10-07T18:50:54Z"
  },
  {
    "title": "Gold prices hit record high as anxious investors seek safe haven for money",
    "description": "Gold futures have soared above $4,000 US per troy ounce for the first time, as many investors seek a safe place to park their money as the U.S. government shutdown continues.",
    "link": "https://www.cbc.ca/news/business/gold-prices-record-high-1.7653497",
    "timestamp": "2025-10-07T18:50:35Z"
  },
  {
    "title": "President Donald Trump confirms UFC White House date; Dana White denies Conor McGregor is booked",
    "description": "White denies that McGregor signed for the UFC White House card, set for Trump's 80th birthday",
    "link": "https://www.cbssports.com/mma/news/president-donald-trump-confirms-ufc-white-house-date-dana-white-denies-conor-mcgregor-is-booked/",
    "timestamp": "2025-10-07T18:50:32Z"
  },
  {
    "title": "Malcolm-Jamal Warner remembered by showrunner as ‘magical’ final TV episode airs",
    "description": "The former ‘Cosby Show’ star drowned on vacation in Costa Rica in July at the age of 54",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/malcolm-jamal-warner-murder-small-town-final-appearance-b2841200.html",
    "timestamp": "2025-10-07T18:49:42Z"
  },
  {
    "title": "At the center of shutdown fight, health care is one of the most intractable issues in Congress",
    "description": "With leaders at odds, some rank-and-file senators in both parties have been in private talks to try to find a way out of the shutdown. But health care is one",
    "link": "https://www.wpsdlocal6.com/health/at-the-center-of-shutdown-fight-health-care-is-one-of-the-most-intractable-issues/article_4963bfcb-a67a-4c27-b15a-1a1edce979a3.html",
    "timestamp": "2025-10-07T18:49:28Z"
  },
  {
    "title": "‘They’re all liars’: Gazans react to Trump’s ‘peace’ proposal and potential ceasefire",
    "description": "Many in Gaza believe that Trump's \"peace\" plan is a ploy to get the Israeli captives released and then resume the genocide. But despite the deep skepticism, desperation to end the war is outweighing everything else.",
    "link": "https://mondoweiss.net/2025/10/theyre-all-liars-gazans-react-to-trumps-peace-proposal-and-potential-ceasefire/",
    "timestamp": "2025-10-07T18:49:15Z"
  },
  {
    "title": "Trump Is Destroying One of America’s Oldest Traditions",
    "description": "America has always had a strong aversion to seeing the military on the country’s streets. That is not stopping the current president.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/chicago-portland-national-guard-crime/684477/",
    "timestamp": "2025-10-07T18:48:19Z"
  },
  {
    "title": "Why Democrats are casting the government shutdown as a health care showdown",
    "description": "It’s a chance to talk about a winning issue — and maybe regain support from working-class voters.",
    "link": "https://www.bostonherald.com/2025/10/07/democrats-government-shutdown-health-care/",
    "timestamp": "2025-10-07T18:48:11Z"
  },
  {
    "title": "Americans Want COVID-Era Policies to Sunset, Poll Finds",
    "description": "A week into the federal government shutdown, Senate Democrats are demanding the extension of expiring enhanced health care premium tax credits, claiming the credits, enhanced... Read More\nThe post Americans Want COVID-Era Policies to Sunset, Poll Finds appear…",
    "link": "https://www.dailysignal.com/2025/10/07/new-poll-claims-americans-want-covid-era-policies-sunset/",
    "timestamp": "2025-10-07T18:46:15Z"
  },
  {
    "title": "Pam Bondi Refuses Simple Yes-or-No Question on Damning Tom Homan Tape",
    "description": "Attorney General Pam Bondi sidestepped a series of simple yes-or-no questions at a Senate judiciary hearing on Tuesday about border czar Tom Homan and the $50,000 in cash he allegedly accepted from undercover FBI agents in a paper Cava bag.  “There’s a tape, …",
    "link": "https://newrepublic.com/post/201435/pam-bondi-yes-or-no-question-tom-homan-tape",
    "timestamp": "2025-10-07T18:46:10Z"
  },
  {
    "title": "Wisconsin's Democratic attorney general won't run for governor and will seek reelection instead",
    "description": "Wisconsin's Democratic Attorney General Josh Kaul has decided not to run for governor and will instead seek reelection to a third term",
    "link": "https://abcnews.go.com/Politics/wireStory/wisconsins-democratic-attorney-general-run-governor-seek-reelection-126294052",
    "timestamp": "2025-10-07T18:45:43Z"
  },
  {
    "title": "Watch -- Jerome Hudson Rocks National Federation of Republican Women Convention: 'We Are Winning the Culture War. Keep Kicking Ass'",
    "description": "\"We are winning the culture war. Hollywood has been broken. A new day has finally arrived,\" Breitbart News entertainment editor Jerome Hudson said amid applause from the audience of more than a thousand women at the National Federation of Republican Women's 4…",
    "link": "https://www.breitbart.com/entertainment/2025/10/07/watch-jerome-hudson-rocks-national-federation-of-republican-women-convention-we-are-winning-the-culture-war-keep-kicking-ass/",
    "timestamp": "2025-10-07T18:45:39Z"
  },
  {
    "title": "John Kennedy Urges Pam Bondi To Interview Howard Lutnick After Epstein Blackmailer Claim",
    "description": "John Kennedy urged Pam Bondi to interview Commerce Secretary Howard Lutnick following his claims about Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/10/07/john-kennedy-urges-pam-bondi-interview-howard-lutnick-epstein/",
    "timestamp": "2025-10-07T18:44:16Z"
  },
  {
    "title": "Schiff Lists Every Question Pam Bondi Ignored as She Melts Down",
    "description": "Democratic Senator Adam Schiff of California took Attorney General Pam Bondi to task Tuesday for her incessant deflections and evasions throughout a Senate judiciary hearing.Bondi had verbally attacked Democratic senators throughout the hearing rather than an…",
    "link": "https://newrepublic.com/post/201437/adam-schiff-questions-pam-bondi-ignored",
    "timestamp": "2025-10-07T18:42:13Z"
  },
  {
    "title": "Trump says back pay not guaranteed for federal workers hit by shutdown",
    "description": "WASHINGTON — President Donald Trump’s administration warned on Tuesday of no guaranteed back pay for federal workers during a government shutdown, reversing what has been long-standing policy for some 750,000 furloughed employees, according to a memo being ci…",
    "link": "https://biztoc.com/x/7610a416b2ff14f3",
    "timestamp": "2025-10-07T18:42:02Z"
  },
  {
    "title": "Trump Calls Democrats the Party of “Satan” as Blue States Are Hit With Funding Cuts, National Guard Deployments",
    "description": "Oregon, Illinois, and California are among the targeted states. They all went for Kamala Harris in 2024.",
    "link": "https://www.vanityfair.com/news/story/trump-calls-democrats-the-party-of-satan-as-blue-states-are-hit-with-funding-cuts-national-guard-deployments",
    "timestamp": "2025-10-07T18:41:16Z"
  },
  {
    "title": "The Real Reason You Might Be Unable to Tag Portland on TikTok During Trump’s Invasion",
    "description": "Trump is falsely claiming an \"insurrection\" is underway in the city, so it's understandable that people are on edge.",
    "link": "https://gizmodo.com/the-real-reason-you-might-be-unable-to-tag-portland-on-tiktok-during-trumps-invasion-2000668903",
    "timestamp": "2025-10-07T18:40:48Z"
  },
  {
    "title": "Trump says back pay not guaranteed for federal workers hit by shutdown",
    "description": "President Donald Trump's administration warned on Tuesday of no guaranteed back pay for federal workers during a government shutdown, reversing what has been long-standing policy for some 750,000 furloughed employees, according to a memo being circulated by t…",
    "link": "https://www.bostonherald.com/2025/10/07/trump-says-back-pay-not-guaranteed-for-federal-workers-hit-by-shutdown/",
    "timestamp": "2025-10-07T18:40:26Z"
  },
  {
    "title": "Trump, Brazil’s Lula move to mend fences after trade clash, judicial firestorm with ‘friendly’ call",
    "description": "President Donald Trump calls phone conversation with Brazil's Lula 'very good' as the leaders discuss future meetings after clashing over tariffs and Bolsonaro's treatment.",
    "link": "https://www.foxnews.com/politics/trump-brazils-lula-move-mend-fences-after-trade-clash-judicial-firestorm-friendly-call",
    "timestamp": "2025-10-07T18:38:11Z"
  },
  {
    "title": "Trump says 'substantial' number of jobs will be permanently lost if shutdown persists, Dems 'have no leader'",
    "description": "President Donald Trump accused Democrats of having \"no leader\" as the government shutdown continues, while he warned of a high number of job losses.",
    "link": "https://www.foxnews.com/politics/trump-says-substantial-number-jobs-will-be-permanently-lost-shutdown-persists-dems-have-no-leader",
    "timestamp": "2025-10-07T18:32:15Z"
  },
  {
    "title": "‘We are cleaning up a diseased temple’: FBI fires agents over Jack Smith’s scheme to spy on Republican senators",
    "description": "Patel confirms those 'who acted unethically' have been removed",
    "link": "https://www.wnd.com/2025/10/we-are-cleaning-up-diseased-temple-fbi-fires/",
    "timestamp": "2025-10-07T18:31:07Z"
  },
  {
    "title": "NPR Says Memphis 'Sees Opportunity' In Trump's Fascist Invasion, So It's All Good, We Guess!",
    "description": "Oh for God's sake.",
    "link": "https://www.wonkette.com/p/npr-says-memphis-sees-opportunity",
    "timestamp": "2025-10-07T18:30:21Z"
  },
  {
    "title": "Pam Bondi Fires Back at Illinois Sen. Dick Durbin in Heated Senate Hearing: 'I Wish You Loved Chicago as Much as You Hate President Trump'",
    "description": "Pam Bondi Fires Back at Illinois Sen. Dick Durbin in Heated Senate Hearing: 'I Wish You Loved Chicago as Much as You Hate President Trump'westernjournal.com",
    "link": "https://www.westernjournal.com/pam-bondi-fires-back-illinois-sen-dick-durbin-heated-senate-hearing-wish-loved-chicago-much-hate-president-trump/",
    "timestamp": "2025-10-07T18:30:19Z"
  },
  {
    "title": "The Reset: Time for a Good Scream, Hollywood",
    "description": "Gap CEO Richard Dickson gave corporate America something to think about when he encouraged his workers to speak up in respectful ways in the wake of the Turning Point USA co-founder's murder",
    "link": "https://www.thewrap.com/the-reset-time-for-a-good-scream-hollywood/",
    "timestamp": "2025-10-07T18:30:00Z"
  },
  {
    "title": "Federal worker back pay uncertain during shutdown",
    "description": "President Donald Trump's administration is warning of no guaranteed back pay for federal workers during a shutdown.",
    "link": "https://www.wmur.com/article/trump-shutdown-federal-worker-back-pay/68882005",
    "timestamp": "2025-10-07T18:29:28Z"
  },
  {
    "title": "Wall Street Just Bet $2 Billion on This Crypto Wagering Platform",
    "description": "ICE's blockbuster Polymarket deal could turn prediction markets into Wall Street's next billion-dollar asset class.",
    "link": "https://finance.yahoo.com/news/wall-street-just-bet-2-182857452.html",
    "timestamp": "2025-10-07T18:28:57Z"
  },
  {
    "title": "New York Stock Exchange Owner Bets $2 Billion On Polymarket Comeback",
    "description": "Once fined and barred from the U.S., the crypto-based prediction market is now being embraced by Wall Street.",
    "link": "https://www.forbes.com/sites/martinacastellanos/2025/10/07/new-york-stock-exchange-owner-bets-2-billion-on-polymarket-comeback/",
    "timestamp": "2025-10-07T18:28:09Z"
  },
  {
    "title": "Nvidia to continue sponsoring H-1B visas, Business Insider reports",
    "description": "Chipmaker Nvidia's CEO Jensen Huang said that the company will continue to sponsor H-1B visas and cover all associated costs following U.S. President Donald Trump's executive order last month that imposed a $100,000 fee on each new application, Business Insid…",
    "link": "https://freerepublic.com/focus/f-chat/4344915/posts",
    "timestamp": "2025-10-07T18:26:27Z"
  },
  {
    "title": "Qatari PM, US officials to join Gaza peace talks in Egypt, says Trump",
    "description": "He made the comments while meeting Canadian Prime Minister Mark Carney, and said discussions on Gaza were part of their agenda.",
    "link": "https://indianexpress.com/article/world/qatari-pm-us-officials-to-join-gaza-peace-talks-in-egypt-says-trump-10293738/",
    "timestamp": "2025-10-07T18:25:47Z"
  },
  {
    "title": "'WHAT WERE THEY LOOKING FOR?' Nunes raises questions over Mar-a-Lago raid (PART 2 of MY NOTES on Fox News 14 minute video)",
    "description": "Video is well worth watching. It's 14 minutes in length.Click here to read Part 1 of my notes on the first half of the video which I posted to FR yesterday.Part 2 of my notes on the second half of the video is posted below.'WHAT WERE THEY LOOKING FOR?' Nunes …",
    "link": "https://freerepublic.com/focus/f-chat/4344913/posts",
    "timestamp": "2025-10-07T18:25:21Z"
  },
  {
    "title": "Jon Stewart: ICE Is a 'Well-Funded Paramilitary Group' Attacking Grandmothers and 'Zip-Tying Children'",
    "description": "Jon Stewart smears ICE as a \"well-funded paramilitary group\" that is attacking grandmothers and \"zip-tying American children.\"\nThe post Jon Stewart: ICE Is a ‘Well-Funded Paramilitary Group’ Attacking Grandmothers and ‘Zip-Tying Children’ appeared first on Br…",
    "link": "https://www.breitbart.com/entertainment/2025/10/07/jon-stewart-ice-is-a-well-funded-paramilitary-group-attacking-grandmothers-and-zip-tying-children/",
    "timestamp": "2025-10-07T18:24:03Z"
  },
  {
    "title": "How Trump's Supreme Court lackeys pushed us to the brink of one-man rule",
    "description": "By Graham G. Dodds, Professor of Political Science, Concordia University. President Donald Trump set the tone for his second term by issuing 26 executive orders, four proclamations and 12 memorandums on his first day back in office. The barrage of unilateral …",
    "link": "https://www.rawstory.com/supreme-court-2674162116/",
    "timestamp": "2025-10-07T18:24:03Z"
  },
  {
    "title": "Texas national guard troops head to Illinois after judge declines to block move",
    "description": "Illinois governor says ‘Trump’s invasion’ of state ongoing as government continues military deployment in Chicago",
    "link": "https://www.irishtimes.com/world/us/2025/10/07/texas-national-guard-troops-head-to-illinois-after-judge-declines-to-block-move/",
    "timestamp": "2025-10-07T18:21:02Z"
  },
  {
    "title": "Billionaire Trump Donor Paulson Scores Windfall Thanks To Government’s Investment In Trilogy Metals",
    "description": "The federal government’s $35.6 million investment for a 10% stake in a small Vancouver-based mining business produced a windfall for its investors, one of whom Donald Trump is already very familiar with.\nBillionaire John Paulson owned an 8.7% stake in Trilogy…",
    "link": "https://biztoc.com/x/4b27b0eaa5f2b2b4",
    "timestamp": "2025-10-07T18:20:24Z"
  },
  {
    "title": "Fired Eastern District of Virginia Prosecutor Michael Ben’Ary Denies Alleged Texts Claiming He Dreams of Trump’s Death",
    "description": "The Justice Department last Wednesday fired the top national security prosecutor in the Eastern District of Virginia.\nThe post Fired Eastern District of Virginia Prosecutor Michael Ben’Ary Denies Alleged Texts Claiming He Dreams of Trump’s Death appeared firs…",
    "link": "https://www.thegatewaypundit.com/2025/10/fired-eastern-district-virginia-prosecutor-michael-benary-denies/",
    "timestamp": "2025-10-07T18:20:03Z"
  },
  {
    "title": "Trump Threatens No Back Pay for Shutdown’s Furloughed Workers",
    "description": "President Donald Trump opened the door to blocking back pay for certain federal workers when the government reopens, a move that would heighten legal scrutiny of the administration’s maneuvers during the shutdown.\n“It really depends on who you’re talking abou…",
    "link": "https://biztoc.com/x/176c5f112c109962",
    "timestamp": "2025-10-07T18:19:38Z"
  },
  {
    "title": "Two years after Hamas’ Oct. 7 massacre, 48 hostages — dead and alive — remain in captivity",
    "description": "One the two-year anniversary of the Oct. 7, 2023, massacre, living and deceased hostages, including two Americans, remain held in Hamas captivity in Gaza.",
    "link": "https://www.foxnews.com/world/two-years-after-hamas-oct-7-massacre-48-hostages-dead-alive-remain-captivity",
    "timestamp": "2025-10-07T18:18:38Z"
  },
  {
    "title": "Pakistan’s Balochistan deal marks new strategic tilt toward US, away from China",
    "description": "Pakistan's leadership is reportedly seeking closer ties with the US, offering potential deals including recognition of Israel and a new port in Balochistan. This shift away from China has raised concerns about regional stability and potential backlash from ne…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/pakistans-balochistan-deal-marks-new-strategic-tilt-toward-us-away-from-china/articleshow/124370140.cms",
    "timestamp": "2025-10-07T18:17:11Z"
  },
  {
    "title": "Back Pay At Risk For Federal Workers Amid Shutdown",
    "description": "Plus, a look at September's job market, the best places to retire and the universities hardest hit by Trump's $100K H-1B visa fee in this week's Careers newsletter.",
    "link": "https://www.forbes.com/sites/mariagraciasantillanalinares/2025/10/07/back-pay-at-risk-for-federal-workers-amid-shutdown/",
    "timestamp": "2025-10-07T18:15:21Z"
  },
  {
    "title": "‘Morning Joe’ Shockingly Agrees With Marjorie Taylor Greene: Government Shutdown ‘Isn’t Good’ for Trumpers | Video",
    "description": "\"Talk about an interesting bellwether,\" co-host Willie Geist says of the devout MAGA congresswoman from Georgia\nThe post ‘Morning Joe’ Shockingly Agrees With Marjorie Taylor Greene: Government Shutdown ‘Isn’t Good’ for Trumpers | Video appeared first on TheWr…",
    "link": "https://www.thewrap.com/morning-joe-marjorie-taylor-greene-government-shutdown/",
    "timestamp": "2025-10-07T18:15:04Z"
  },
  {
    "title": "MSNBC's Lawrence O'Donnell Torches CNN For 'New Dark Low' On Trump (Marco Margaritoff/HuffPost)",
    "description": "Marco Margaritoff / HuffPost:\nMSNBC's Lawrence O'Donnell Torches CNN For ‘New Dark Low’ On Trump  —  A weird interview with the president really riled the anchor.  —  MSNBC host Lawrence O'Donnell says CNN plumbed “a new dark low” by interviewing President Do…",
    "link": "https://www.memeorandum.com/251007/p73",
    "timestamp": "2025-10-07T18:15:01Z"
  },
  {
    "title": "Israel marks 2 years since Oct. 7 attack as Gaza war grinds on",
    "description": "Israelis are mourning the dead and fearing for the remaining hostages as they mark two years since Hamas’ Oct. 7 attack plunged the region into a devastating war.",
    "link": "https://www.pbs.org/newshour/world/israel-marks-2-years-since-oct-7-attack-as-gaza-war-grinds-on",
    "timestamp": "2025-10-07T18:11:32Z"
  },
  {
    "title": "The Monroe doctrine is back – dressed up as a war on drugs",
    "description": "The Caribbean deployment is less about cocaine and more about control, reviving America’s oldest imperial playbook Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625996-monroe-doctrine-is-back/",
    "timestamp": "2025-10-07T18:08:04Z"
  },
  {
    "title": "Trump Fired Her From the FTC. Now Her Husband’s Crypto Bill Could Suffer",
    "description": "The intertwined fortunes of Rebecca and Justin Slaughter underscore a key constitutional issue that could derail crypto’s long-desired market structure bill.",
    "link": "https://decrypt.co/343251/trump-fired-ftc-commissioner-crypto-bill",
    "timestamp": "2025-10-07T18:07:00Z"
  },
  {
    "title": "Trump says trade talks 'complicated' but Canada will be 'very happy' with eventual deal",
    "description": "Despite the warm words, Canada remains the only G7 country not to have reached a trade deal with Trump this year.",
    "link": "https://www.bbc.com/news/articles/cj6xje2778go?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-07T18:06:56Z"
  },
  {
    "title": "Danish Prime Minister Warns Trump Will Not Stop Trying to Annex Greenland",
    "description": "MOSCOW (Sputnik) - US President Donald Trump has not abandoned his plans to persuade Greenland to join the United States, Danish Prime Minister Mette Frederiksen said on Tuesday.",
    "link": "https://sputnikglobe.com/20251007/danish-prime-minister-warns-trump-will-not-stop-trying-to-annex-greenland-1122922880.html",
    "timestamp": "2025-10-07T18:06:34Z"
  },
  {
    "title": "Kamala Harris Tells Audience 'These MFs Are Crazy!!!'",
    "description": "F-bombs away! Former Vice President Kamala Harris is going full auntie mode on her book tour ... seeming to give her political opponents a piece of her mind in no uncertain terms! Kamala's been touring, promoting her new book, \"107 Days,\" and…\n Permalink",
    "link": "https://www.tmz.com/2025/10/07/kamala-harris-book-tour-los-angeles/",
    "timestamp": "2025-10-07T18:06:25Z"
  },
  {
    "title": "Bob Ross paintings to be auctioned to raise money for public TV after cuts",
    "description": "Thirty paintings by Bob Ross are set to be auctioned to support public television stations after federal funding cuts.",
    "link": "https://www.cbsnews.com/news/bob-ross-paintings-auction-public-radio-broadcast-npr-pbs/",
    "timestamp": "2025-10-07T18:06:08Z"
  },
  {
    "title": "Diddy wants to serve his sentence at a NJ prison previously home to 'Pharma Bro' Martin Shkreli and mobsters",
    "description": "FCI Fort Dix has what's known as a Residential Drug Abuse Program that Sean \"Diddy\" Combs' lawyer suggested would be beneficial to him.",
    "link": "https://www.businessinsider.com/sean-diddy-combs-fort-dix-prison-new-jersey-martin-shkreli-2025-10",
    "timestamp": "2025-10-07T18:04:48Z"
  },
  {
    "title": "Jon Stewart Roasts ‘Human Flat Tire’ Chuck Schumer Over Flopped Joke",
    "description": "The late night host didn’t hesitate to shred the New York Democrat over the comedic fail.",
    "link": "https://www.huffpost.com/entry/jon-stewart-chuck-schumer-kff-joke_n_68e5303fe4b038265cc81bda",
    "timestamp": "2025-10-07T18:04:13Z"
  },
  {
    "title": "UN Worried About Escalation Between US, Venezuela - Spokesman",
    "description": "UNITED NATIONS (Sputnik) – The United Nations is concerned about growing tensions between Washington and Caracas, spokesman Stephane Dujarric said on Tuesday.",
    "link": "https://sputnikglobe.com/20251007/un-worried-about-escalation-between-us-venezuela---spokesman-1122922761.html",
    "timestamp": "2025-10-07T18:04:12Z"
  },
  {
    "title": "CT spends over $100M on health care for immigrants without legal status as shutdown debate rages - NewsBreak",
    "description": "CT spends over $100M on health care for immigrants without legal status as shutdown debate rages - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4276011366863-ct-spends-over-100m-on-health-care-for-immigrants-without-legal-status-as-shutdown-debate-rages?_f=app_share&amp;pd=0AbaDOHH&amp;lang=en_US&amp;send_time=1759860044&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.40.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-v1%2Csc_play_button_v1-v2&amp;s=i2",
    "timestamp": "2025-10-07T18:01:45Z"
  },
  {
    "title": "US-Pakistan bromance: A Trump phase or a new reality for India and the region?",
    "description": "Donald Trump's focus on Pakistan is reshaping US foreign policy. This shift impacts India's standing and regional stability. Pakistan's army chief is actively seeking to please Trump.",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/us-pakistan-bromance-a-trump-phase-or-a-new-reality-for-india-and-the-region/articleshow/124369863.cms",
    "timestamp": "2025-10-07T18:01:01Z"
  },
  {
    "title": "Watch: Trump Urges ‘Troublemaker’ Greta Thunberg to ‘See a Doctor’ After Israeli Deportation",
    "description": "U.S. President Donald Trump on Monday urged Swedish career protester Greta Thunberg to see a doctor because, “… for a young person, she’s so angry. She’s so crazy.” Trump was speaking after Thunberg was deported from Israel along with 170 other activists who …",
    "link": "https://freerepublic.com/focus/f-chat/4344908/posts",
    "timestamp": "2025-10-07T18:00:40Z"
  },
  {
    "title": "Jay Jones Pummeled in Ad by Opponent in Virginia AG Race",
    "description": "Virginia Attorney General Jason Miyares swiftly launched a new ad showing Virginians the threatening text messages sent by Jay Jones, his Democrat opponent in the... Read More\nThe post Jay Jones Pummeled in Ad by Opponent in Virginia AG Race appeared first on…",
    "link": "https://www.dailysignal.com/2025/10/07/jay-jones-pummeled-ad-opponent-virginia-ag-race/",
    "timestamp": "2025-10-07T18:00:35Z"
  },
  {
    "title": "Portland business owners plead for help as Trump pushes to keep troops in city",
    "description": "Business owners in Portland describe personal experiences with crime, including break-ins and violence, as President Trump faces challenges deploying federal troops.",
    "link": "https://www.foxnews.com/media/portland-business-owners-plead-help-trump-pushes-keep-troops-city",
    "timestamp": "2025-10-07T18:00:19Z"
  }
]