[
  {
    "title": "‘The View’: Marjorie Taylor Greene to Appear as a Guest on Election Day",
    "description": "Marjorie Taylor Greene has been set as a guest of an upcoming episode of “The View.” On Thursday’s episode, co-host Sara Haines mentioned Greene’s name as the hosts discussed the government shutdown. “I’m happy to say that she’s going to be here on Tuesday,” …",
    "link": "https://variety.com/2025/tv/news/the-view-marjorie-taylor-guest-election-day-1236565803/",
    "timestamp": "2025-10-30T16:53:38Z"
  },
  {
    "title": "‘The View’ Sets Marjorie Taylor Greene as Guest After Co-Hosts Call for More Republicans on the Show",
    "description": "“The View” is getting a visit from Republican congresswoman Marjorie Taylor Greene next week. Moderator Whoopi Goldberg revealed the news on Thursday morning, as the ABC hosts discussed the ongoing government shutdown, and how some Republicans are responding.…",
    "link": "https://freerepublic.com/focus/f-chat/4349636/posts",
    "timestamp": "2025-10-30T16:53:10Z"
  },
  {
    "title": "Trump ‘grateful’ for Bill Gates pivot, declares victory over ‘climate change hoax’",
    "description": "Software billionaire now warning about 'doomsday outlook'",
    "link": "https://www.wnd.com/2025/10/trump-grateful-bill-gates-pivot-declares-victory-climate/",
    "timestamp": "2025-10-30T16:53:08Z"
  },
  {
    "title": "Lara Trump's 8-Year-Old Son's Halloween Costume Is Exactly What You'd Expect",
    "description": "The president's grandson's choice is in keeping with the Trump family's priorities.",
    "link": "https://www.huffpost.com/entry/trump-grandson-halloween-costume_n_690378a0e4b0033c52b54aeb",
    "timestamp": "2025-10-30T16:51:16Z"
  },
  {
    "title": "Felony dropped after a man spent a month in a Tennessee jail for a Charlie Kirk post",
    "description": "Free speech advocates said he was targeted for his political views.",
    "link": "https://www.bostonherald.com/2025/10/30/charlie-kirk-post-felony/",
    "timestamp": "2025-10-30T16:50:17Z"
  },
  {
    "title": "Shots Fired: Kamala Harris Admits Joe Biden 'Disappointed and Angered Her' Before Suffering Humiliating Election Loss to Donald Trump",
    "description": "The former vice president recalled a 'disappointing' phone call she received from the ex-president before she debated Donald Trump.",
    "link": "https://radaronline.com/p/kamala-harris-joe-biden-angered-her-before-debate-trump/",
    "timestamp": "2025-10-30T16:50:00Z"
  },
  {
    "title": "Upcoming White House cyber strategy to seek more involvement with private sector",
    "description": "The Trump 2.0 cyber strategy is in development, National Cyber Director Sean Cairncross said, though he did not elaborate on when it would be released.",
    "link": "https://www.nextgov.com/cybersecurity/2025/10/upcoming-white-house-cyber-strategy-seek-more-involvement-private-sector/409180/",
    "timestamp": "2025-10-30T16:50:00Z"
  },
  {
    "title": "'Do you have a kids' menu?' Trump ridiculed for 'embarrassing' food choices on Asia trip",
    "description": "President Donald Trump is returning to the White House after a trip to Asia — and he's facing ridicule over the \"kids' menu\" choices his hosts offered him while visiting.The president's culinary preferences – fast food, well-done steaks and spaghetti – are we…",
    "link": "https://www.rawstory.com/trump-asia-trip/",
    "timestamp": "2025-10-30T16:48:35Z"
  },
  {
    "title": "In These Times, We Need Consciousness Raising — and Radical Unlearning",
    "description": "We must unlearn fear, individualism, and the inability to act in order to confront the threats of this moment.",
    "link": "https://truthout.org/articles/in-these-times-we-need-consciousness-raising-and-radical-unlearning/",
    "timestamp": "2025-10-30T16:48:07Z"
  },
  {
    "title": "‘I had no choice!’ Trump orders Department of War to restart nuclear weapons tests",
    "description": "'That process will begin immediately. Thank you for your attention to this matter!'",
    "link": "https://www.wnd.com/2025/10/i-had-no-choice-trump-orders-department-war/",
    "timestamp": "2025-10-30T16:47:07Z"
  },
  {
    "title": "Donald Trump Cuts China Tariffs as the Country Opens Up to U.S. Agriculture",
    "description": "President Donald Trump is cutting tariffs on China after the country agreed to open up to United States Agriculture, the commander-in-chief detailed in a Truth Social post.\nThe post Donald Trump Cuts China Tariffs as the Country Opens Up to U.S. Agriculture a…",
    "link": "https://www.breitbart.com/politics/2025/10/30/donald-trump-cuts-china-tariffs-as-the-country-opens-up-to-u-s-agriculture/",
    "timestamp": "2025-10-30T16:46:37Z"
  },
  {
    "title": "Trump Take Candy",
    "description": "Halloween candy hauls will shrink as prices soar\nThe post Trump Take Candy appeared first on Kotaku.",
    "link": "https://kotaku.com/halloween-candy-price-inflation-trump-tariff-snap-2000640156",
    "timestamp": "2025-10-30T16:46:35Z"
  },
  {
    "title": "Top Stock Movers Now: Chipotle, Meta, Alphabet, and More",
    "description": "Major U.S. equities indexes were mixed Thursday afternoon as President Donald Trump met with Chinese leader Xi Jinping on trade issues and investors digested...",
    "link": "https://www.investopedia.com/top-stock-movers-now-chipotle-meta-platforms-alphabet-and-more-11840093",
    "timestamp": "2025-10-30T16:45:57Z"
  },
  {
    "title": "NASA’s Supersonic Jet Finally Takes off for Its First Super Fast, Super Quiet Flight",
    "description": "X-59 is designed to usher in a new era of air travel with its quiet supersonic technology.",
    "link": "https://gizmodo.com/nasas-supersonic-jet-finally-takes-off-for-its-first-super-fast-super-quiet-flight-2000679365",
    "timestamp": "2025-10-30T16:45:56Z"
  },
  {
    "title": "President Trump Signs Big Deal with China, Meets Xi Jinping Who Calls Him the “PEACE PRESIDENT”",
    "description": "President Trump meets China President Xi Jinping in South Korea. President Trump arrived for the meeting in The Beast. BREAKING: President Trump just ARRIVED for his meeting with Chinese President Xi Jinping in South Korea, stepping out of The Beast and walki…",
    "link": "https://joehoft.com/president-trump-meets-xi-jinping-in-south-korea/",
    "timestamp": "2025-10-30T16:45:53Z"
  },
  {
    "title": "Felony dropped after a man spent a month in a Tennessee jail for a Charlie Kirk post",
    "description": "Authorities in Tennessee have dropped a felony charge against a man who was jailed for more than a month over a Facebook post he made about the assassination...",
    "link": "https://www.yahoo.com/news/articles/felony-dropped-man-spent-month-164538092.html",
    "timestamp": "2025-10-30T16:45:38Z"
  },
  {
    "title": "Tennessee Drops Charges Against Man Jailed For Posting Charlie Kirk Meme",
    "description": "Larry Bushart lost his job and spent more than a month in jail.",
    "link": "https://www.huffpost.com/entry/larry-bushart-tenn-charlie-kirk-meme-facebook-jail_n_69037869e4b0b0c6441c616b",
    "timestamp": "2025-10-30T16:45:32Z"
  },
  {
    "title": "Trump’s Baffling Call for Resuming U.S. Nuclear Tests",
    "description": "“The only countries that will really learn more if [U.S. nuclear] testing resumes are Russia and, to a much greater extent, China,” says Jeffrey Lewis, an expert on the geopolitics of nuclear weaponry",
    "link": "https://www.scientificamerican.com/article/trumps-baffling-call-for-resuming-u-s-nuclear-tests/",
    "timestamp": "2025-10-30T16:45:00Z"
  },
  {
    "title": "Nuclear Bomb Map Shows Impact of US Weapons on Major Cities",
    "description": "President Donald Trump has announced that the United States will resume nuclear testing programs and Newsweek has mapped out what impact America’s highest-yield warhead deployed on a U.S. missile would have on several major cities.\n“The United States has more…",
    "link": "https://biztoc.com/x/7081780a204bdbaf",
    "timestamp": "2025-10-30T16:44:57Z"
  },
  {
    "title": "US confirms China will buy 12M tons of soy in 2025",
    "description": "United States Secretary of Agriculture Brooke Rollins confirmed on Thursday that following the meeting between US President Donald Trump and his Chinese counterpart Xi Jinping, Beijing agreed to purch...",
    "link": "https://biztoc.com/x/c86f55761b703a67",
    "timestamp": "2025-10-30T16:44:54Z"
  },
  {
    "title": "Trump Voters Are Leaving Curtis Sliwa",
    "description": "Some of President Donald Trump’s voters are leaving Republican New York City mayoral candidate Curtis Sliwa for former Democratic Governor Andrew Cuomo, according to a new poll.\nNewsweek has contacted the Sliwa and Cuomo campaigns for comment via email.\nWhy I…",
    "link": "https://biztoc.com/x/dc6b3d6fee30db8d",
    "timestamp": "2025-10-30T16:44:52Z"
  },
  {
    "title": "Trump sets refugee admissions ceiling at 7,500 for fiscal 2026, lowest cap on record",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump set the refugee admissions ceiling at 7,500 for fiscal year 2026, the lowest cap on record, a White House document published on Thursday said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/31/trump-sets-refugee-admissions-ceiling-at-7500-for-fiscal-2026-lowest-cap-on-record",
    "timestamp": "2025-10-30T16:44:00Z"
  },
  {
    "title": "Trump no-show at big Asian economic forum may risk US reputation in region",
    "description": "Showing up matters in Asian diplomacy.",
    "link": "https://www.bostonherald.com/2025/10/30/trump-apec-no-show/",
    "timestamp": "2025-10-30T16:43:25Z"
  },
  {
    "title": "Louisiana Gov. Says He'd Let Donald Trump Pick Next LSU Coach Before Scott Woodward",
    "description": "Louisiana Governor Jeff Landry has made national news this week by publicly slamming Scott Woodward and going so far as to say he'd let Donald Trump",
    "link": "https://roundtable.io/lsu/news/louisiana-gov-says-he-d-let-donald-trump-pick-next-lsu-coach-before-scott-woodward",
    "timestamp": "2025-10-30T16:41:50Z"
  },
  {
    "title": "‘No Democrat Wants to Hear From You’: James Carville Tells Kamala Harris and Co. to Pipe Down",
    "description": "James Carville is sick and tired of hearing from Democrats who were involved in the 2024 presidential, including former Vice President Kamala Harris.\nThe post ‘No Democrat Wants to Hear From You’: James Carville Tells Kamala Harris and Co. to Pipe Down first …",
    "link": "https://www.mediaite.com/media/podcasts/no-democrat-wants-to-hear-from-you-james-carville-tells-kamala-harris-and-co-to-pipe-down/",
    "timestamp": "2025-10-30T16:41:48Z"
  },
  {
    "title": "Sunny Hostin Calls Out ‘The View’ Co-Hosts For Traumatizing Her",
    "description": "Hostin doesn't appreciate when her co-hosts try to scare her.",
    "link": "https://decider.com/2025/10/30/sunny-hostin-traumatized-the-view/",
    "timestamp": "2025-10-30T16:41:15Z"
  },
  {
    "title": "Meet Timothy Mellon, the reclusive Wyoming billionaire revealed as the $130 million donor funding military pay during the federal shutdown",
    "description": "The great-great-grandson of Mellon Bank’s founder inherited around $23 million from the family business, before making his own fortune in the railroad. Now he’s donating millions of it to the Republican Party.",
    "link": "https://fortune.com/2025/10/30/timothy-mellon-billionaire-wealth-the-reclusive-wyoming-billionaire-revealed-as-the-130-million-donor-funding-military-pay-during-the-federal-shutdown/",
    "timestamp": "2025-10-30T16:40:42Z"
  },
  {
    "title": "CPM cadres hand over body donation affidavits to Coimbatore Medical College Hospital",
    "description": "COIMBATORE: As many as 92 functionaries and cadres of CPM handed over affidavits on body donation to the Coimbatore Medical College Hospital (CMCH) on.",
    "link": "https://timesofindia.indiatimes.com/city/coimbatore/cpm-cadres-hand-over-body-donation-affidavits-to-coimbatore-medical-college-hospital/articleshow/124961579.cms",
    "timestamp": "2025-10-30T16:39:34Z"
  },
  {
    "title": "‘Partisan zealots’: Senator calls for impeachment of anti-Trump judge who schemed to spy on phone records",
    "description": "Boasberg accused of 'a dereliction of duty and a violation of the judicial oath'",
    "link": "https://www.wnd.com/2025/10/partisan-zealots-senator-calls-impeachment-anti-trump-judge/",
    "timestamp": "2025-10-30T16:39:31Z"
  },
  {
    "title": "Last-minute scramble over pay takes a toll on military families during the shutdown",
    "description": "The government shutdown is exacting a heavy mental toll on the nation's military families, leaving them not knowing from week to week whether their paychecks will arrive.",
    "link": "https://www.pbs.org/newshour/politics/last-minute-scramble-over-pay-takes-a-toll-on-military-families-during-the-shutdown",
    "timestamp": "2025-10-30T16:38:43Z"
  },
  {
    "title": "Portland police accuse federal troops of inflaming anti-ICE protests, which city claims have not been violent",
    "description": "Portland police commander testifies that Trump's federal forces escalated protest violence at ICE facility, contradicting administration claims during bench trial.",
    "link": "https://www.foxnews.com/us/portland-police-accuse-federal-troops-inflaming-anti-ice-protests-which-city-claims-have-not-been-violent",
    "timestamp": "2025-10-30T16:38:36Z"
  },
  {
    "title": "Trump sets refugee admissions ceiling at 7,500 for fiscal 2026, lowest cap on record",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump set the refugee admissions ceiling at 7,500 for fiscal year 2026, the lowest cap on record, a White House...",
    "link": "https://www.yahoo.com/news/articles/trump-sets-refugee-admissions-ceiling-163814285.html",
    "timestamp": "2025-10-30T16:38:14Z"
  },
  {
    "title": "Democrat senator urges Europe to resist Trump threats over climate policy",
    "description": "Europe and its climate allies should learn to “stick to their guns” when dealing with Donald Trump",
    "link": "https://www.euractiv.com/news/democrat-senator-urges-europe-to-resist-trump-threats-over-climate-policy/",
    "timestamp": "2025-10-30T16:38:04Z"
  },
  {
    "title": "Donald Trump call for nuclear tests to trigger World War 3? Experts predict shocking consequences",
    "description": "United States already tests its weapons. In September, the United States carried out tests of its nuclear-capable Trident missiles.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-call-for-nuclear-tests-to-trigger-world-war-3-experts-predict-shocking-consequences/articleshow/124961514.cms",
    "timestamp": "2025-10-30T16:37:26Z"
  },
  {
    "title": "Bitcoin Dips Below $108K as Powell Spooks Markets, Trump Sparks Chaos with Surprise China Deal",
    "description": "Crypto stumbles while tech stocks soar, exposing investor jitters after Fed caution and Trump--Xi trade headline whiplash.",
    "link": "https://finance.yahoo.com/news/bitcoin-dips-below-108k-powell-163645306.html",
    "timestamp": "2025-10-30T16:36:45Z"
  },
  {
    "title": "The Left's Secret Repeal of No Taxes on Tips",
    "description": "Progressive cities are scrapping the tipped-wage credit, shifting workers from tax-free tips to taxable wages, and likely leading to lower take-home pay.",
    "link": "https://reason.com/2025/10/30/the-lefts-secret-repeal-of-no-taxes-on-tips/",
    "timestamp": "2025-10-30T16:36:43Z"
  },
  {
    "title": "Melania Trump's Halloween Display Gives Critics The Creeps",
    "description": "Melania Trump's Halloween Display Gives Critics The Creepscafemom.com",
    "link": "https://cafemom.com/entertainment/melania-trump-halloween-display-gives-critics-the-creeps",
    "timestamp": "2025-10-30T16:35:22Z"
  },
  {
    "title": "The moving goalposts",
    "description": "Who knows whether Trump will seek a third term, but the conservatives saying he won't will fall in line if he does.",
    "link": "https://www.ncspin.com/the-moving-goalposts",
    "timestamp": "2025-10-30T16:33:46Z"
  },
  {
    "title": "US politicians call for Trump to act on 'unspeakable atrocities' in Sudan",
    "description": "The UN and others are condemning paramilitary Rapid Support Forces, which reportedly attacked civilians as it moved to seize new territory in the North African country.",
    "link": "https://www.abc.net.au/news/2025-10-31/sudan-violence-calls-for-trump-to-act/105955336",
    "timestamp": "2025-10-30T16:33:33Z"
  },
  {
    "title": "Tennessee man jailed for meme freed after charge dropped",
    "description": "Larry Bushart spent over a month in jail for posting a Trump meme after Charlie Kirk's assassination",
    "link": "https://www.salon.com/2025/10/30/tennessee-man-jailed-for-meme-freed-after-charge-dropped/",
    "timestamp": "2025-10-30T16:33:30Z"
  },
  {
    "title": "Donald Trump Says United States Will Start Testing Nuclear Weapons Again",
    "description": "President Donald Trump must be glowing with excitement right about now ... because he just announced he has authorized the testing of nuclear weapons. Trump revealed the vague plan by posting on Truth Social Wednesday night, hours before his…\n Permalink",
    "link": "https://www.tmz.com/2025/10/30/nuclear-testing-donald-trump/",
    "timestamp": "2025-10-30T16:33:16Z"
  },
  {
    "title": "‘I Wish They’d Let Him Run!’ James Carville Sounds Off on Trump Third Term",
    "description": "Democratic strategist James Carville responded to talk of a President Donald Trump third term by saying he wishes Trump could legally run again.\nThe post ‘I Wish They’d Let Him Run!’ James Carville Sounds Off on Trump Third Term first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/i-wish-theyd-let-him-run-james-carville-sounds-off-on-trump-third-term/",
    "timestamp": "2025-10-30T16:32:41Z"
  },
  {
    "title": "Trump’s shadow looms over Texas race as Hunt accuses Cornyn of betrayal",
    "description": "Rep. Wesley Hunt, R-Texas, and incumbent Sen. John Cornyn, R-Texas, exchanged blows as the primary race for the Senate seat in Texas heats up.",
    "link": "https://www.foxnews.com/politics/trumps-shadow-looms-over-texas-race-hunt-accuses-cornyn-betrayal",
    "timestamp": "2025-10-30T16:31:20Z"
  },
  {
    "title": "Summers Happy the Trump-Xi Summit Didn't 'Spiral Out of Control'",
    "description": "Former Treasury Secretary Lawrence Summers says he's happy the meeting between US President Donald Trump and Chinese ...",
    "link": "https://biztoc.com/x/d70bc57c9dfd05a7",
    "timestamp": "2025-10-30T16:31:19Z"
  },
  {
    "title": "Social Media Uproar Ensues as Footage Emerges Showing Marxist Muslim Candidate for Minneapolis Mayor Pledging Loyalty to Somalia in a Foreign Language While Waving the Nation’s Flag (VIDEO)",
    "description": "One of America’s most iconic cities appears to have fallen to the radical Islamist left thanks to unfettered immigration from hostile foreign nations.\nThe post Social Media Uproar Ensues as Footage Emerges Showing Marxist Muslim Candidate for Minneapolis Mayo…",
    "link": "https://www.thegatewaypundit.com/2025/10/social-media-uproar-ensues-as-footage-emerges-showing/",
    "timestamp": "2025-10-30T16:30:06Z"
  },
  {
    "title": "Our Homeland Security Department Must Think We're All Certified Idiots",
    "description": "Releasing months-old videos from Florida saying they’re from Chicago? Our government used to employ a better class of liar.",
    "link": "https://www.esquire.com/news-politics/politics/a69202990/homeland-security-fake-videos/",
    "timestamp": "2025-10-30T16:30:00Z"
  },
  {
    "title": "What to Make of Trump’s Wild Nuclear Threat",
    "description": "Let's break this down, sentence by sentence.",
    "link": "https://slate.com/news-and-politics/2025/10/trump-nuclear-weapons-testing-china-us.html",
    "timestamp": "2025-10-30T16:29:51Z"
  },
  {
    "title": "Most Americans oppose Trump's East Wing demolition, ballroom plans, poll finds",
    "description": "By a 2-to-1 margin, Americans oppose President Trump's East Wing demolition and plans for a 90,000 square-foot ballroom, according to a new poll.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/30/americans-oppose-trump-east-wing-demolition-ballroom-poll/86985327007/",
    "timestamp": "2025-10-30T16:29:21Z"
  },
  {
    "title": "Trump and Xi Agree to Surprise One-Year Trade Truce in Bid to De-escalate U.S.–China Clash",
    "description": "In a surprise breakthrough, U.S. President Donald Trump and Chinese President Xi Jinping have agreed to a one-year trade truce, easing years of economic confrontation between the world's two largest economies.",
    "link": "https://www.ibtimes.com/trump-xi-agree-surprise-one-year-trade-truce-bid-de-escalate-uschina-clash-3788953",
    "timestamp": "2025-10-30T16:28:28Z"
  },
  {
    "title": "The Trouble with Abundance",
    "description": "In a book released earlier this year, Ezra Klein and Derek Thompson argue essentially for “competent capacity”: a US that can effectively plan, approve, and execute projects. That is a worthy goal, but “abundance” is probably not the clearest way to convey it…",
    "link": "https://www.project-syndicate.org/commentary/democrats-cannot-build-a-political-strategy-on-abundance-by-jeffrey-frankel-2025-10",
    "timestamp": "2025-10-30T16:27:22Z"
  },
  {
    "title": "Bianchi: DeSantis should follow Louisiana governor’s lead and bench Florida’s free-spending ADs",
    "description": "Running off at the typewriter. … Normally, I don’t want politicians anywhere near sports. Most of them can’t even manage a budget, much less a football program. But when it comes to the fiscal lunacy of college coaching contracts — the kind of waste that make…",
    "link": "https://www.orlandosentinel.com/2025/10/30/governor-desantis-gators-fsu-lsu-louisiana-governor-mike-bianchi-commentary/",
    "timestamp": "2025-10-30T16:27:00Z"
  },
  {
    "title": "Man Jailed for Facebook Meme Is Freed in Tennessee",
    "description": "Larry Bushart Jr. spent more than a month in jail after a Tennessee sheriff ordered his arrest for a meme trolling a Charlie Kirk vigil.\nThe post Man Jailed for Facebook Meme Is Freed in Tennessee appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/30/larry-bushart-tennessee-free-speech-charlie-kirk-meme/",
    "timestamp": "2025-10-30T16:26:28Z"
  },
  {
    "title": "I’m a psychologist. Here’s what your signature says about your personality",
    "description": "A long-time social psychologist found that signature size is related to status and one’s sense of self",
    "link": "https://www.the-independent.com/life-style/signature-meaning-trump-narcissist-personality-b2855471.html",
    "timestamp": "2025-10-30T16:26:14Z"
  },
  {
    "title": "Donald Trump Would Rather Starve Children than Lower Health Care Costs - NewsBreak",
    "description": "Well, I am not above dabbling in clickbait from time to time. What’s the point of writing this newsletter several times a week if you never open it? Howeve",
    "link": "https://www.newsbreak.com/share/4322303395349-donald-trump-would-rather-starve-children-than-lower-health-care-costs?s=a2&amp;share_destination_id=MjI0MTEwNzc1LTE3NjE4NDE0NzQzODU%3D&amp;pd=0FALRvVD&amp;hl=en_US&amp;send_time=1761841474&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.43.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-10-30T16:25:11Z"
  },
  {
    "title": "Trump and Xi Step Back From the Brink—for Now",
    "description": "The United States and China have struck a vague and reversible deal.",
    "link": "http://foreignpolicy.com/2025/10/30/trump-xi-meeting-summit-trade-truce-us-china/",
    "timestamp": "2025-10-30T16:25:10Z"
  },
  {
    "title": "Trump's proposed nuclear tests: What you need to know",
    "description": "Donald Trump has called for the US to resume nuclear tests, seemingly reversing a decades-long trend. But will this actually mean nuclear explosions? And are we on the verge of another nuclear arms race? It has been 33 years since an explosive US nuclear weap…",
    "link": "https://www.dw.com/en/trumps-proposed-nuclear-tests-what-you-need-to-know/a-74558882",
    "timestamp": "2025-10-30T16:25:00Z"
  },
  {
    "title": "After Horrific Massacres in Sudan, Lawmakers Call for US to Stop Funding 'Arms Dealers' in UAE",
    "description": "After Sudan's Rapid Support Forces overran the city of el-Fasher this week, committing a series of horrific war crimes, lawmakers are calling for the US to pull its financial support for the United Arab Emirates, which is accused of providing extensive financ…",
    "link": "https://www.commondreams.org/news/sudan-atrocities-us-support-uae",
    "timestamp": "2025-10-30T16:24:11Z"
  },
  {
    "title": "Kamala Harris suggests Biden 'didn't want' debate against Trump, says 'something was a little off'",
    "description": "Former Vice President Kamala Harris revealed on Thursday that former President Joe Biden \"didn't want\" to debate President Donald Trump in 2024 and thought he was \"talked into it.\"",
    "link": "https://www.foxnews.com/media/kamala-harris-suggests-biden-didnt-want-debate-against-trump-says-something-little-off",
    "timestamp": "2025-10-30T16:24:09Z"
  },
  {
    "title": "Gold Pushes Higher as Market Digests Outcome of Xi-Trump Meeting",
    "description": "Gold advanced following a run of losses, as traders digested the outcome of a meeting between US President Donald Trump and Chinese leader Xi Jinping.\nBullion rose as much as 2.2%, after falling almost 5% over the previous four sessions. Trump said it was an …",
    "link": "https://biztoc.com/x/a4a8d7d629fffd99",
    "timestamp": "2025-10-30T16:22:56Z"
  },
  {
    "title": "WATCH LIVE: Trump and first lady host Halloween trick-or-treating at the White House",
    "description": "About two-thirds of U.S. adults will celebrate Halloween in some way this year, with parents of kids under 18 especially likely to have plans, according to a new poll from The Associated Press-NORC Center for Public Affairs Research.",
    "link": "https://www.pbs.org/newshour/nation/watch-live-trump-and-first-lady-host-halloween-trick-or-treating-at-the-white-house",
    "timestamp": "2025-10-30T16:22:56Z"
  },
  {
    "title": "The Trump Administration Is Turning Its Back on More Than 40 Million Hungry Americans",
    "description": "When we turn back the clocks this weekend, the Trump administration will simultaneously turn its back on nearly 42 million people in this country—those who rely on the Supplemental Nutrition Assistance Program (SNAP) to make a warm, healthy meal.\nThe majority…",
    "link": "https://msmagazine.com/2025/10/30/trump-republicans-shutdown-snap-food-stamps-women/",
    "timestamp": "2025-10-30T16:21:56Z"
  },
  {
    "title": "How Americans feel about changing the clocks, according to a new AP-NORC poll",
    "description": "Only 12% of U.S. adults favor the current system of daylight saving time.",
    "link": "https://www.bostonherald.com/2025/10/30/ap-poll-daylight-saving-time/",
    "timestamp": "2025-10-30T16:20:55Z"
  },
  {
    "title": "Elon Musk DOGE Stooge Just Got Control of Billions of Military Dollars",
    "description": "Donald Trump has replaced an experienced admiral with a 33-year-old with no naval experience.",
    "link": "https://newrepublic.com/post/202466/donald-trump-elon-musk-doge-navy",
    "timestamp": "2025-10-30T16:19:30Z"
  },
  {
    "title": "The Last Temptation Of Andrew Cuomo",
    "description": "Spoiler, it's racism!",
    "link": "https://www.wonkette.com/p/the-last-temptation-of-andrew-cuomo",
    "timestamp": "2025-10-30T16:15:26Z"
  },
  {
    "title": "What the Latest Trump-Xi Meeting Means for Luxury’s Recovery in China",
    "description": "With a palpable rebound in energy, Erwan Rambourg of HSBC believes the stalemate over the past 24 months in the luxury sector in China is over.",
    "link": "http://wwd.com/business-news/government-trade/trump-xi-deal-impact-on-luxury-recovery-china-1238327911/",
    "timestamp": "2025-10-30T16:14:44Z"
  },
  {
    "title": "Trump’s Social Security Commissioner Should Resign Immediately",
    "description": "The following is a statement from Nancy Altman, President of Social Security Works: “This week, Fiserv’s stock price plunged by over 40 percent. The current CEO said that the decline happened because of exaggerated projections made by the previous CEO, Frank …",
    "link": "https://www.commondreams.org/newswire/trumps-social-security-commissioner-should-resign-immediately",
    "timestamp": "2025-10-30T16:14:26Z"
  },
  {
    "title": "Video shows Zohran Mamdani fervently shouting about defunding ‘Israeli settler violence’ just months before Oct. 7",
    "description": "Socialist mayoral frontrunner Zohran Mamdani fervently shouted about defunding “Israeli settler violence” at a Big Apple rally — just months before Hamas carried out its deadly Oct. 7, 2023 terror attack, newly surfaced video shows. Mamdani was filmed repeate…",
    "link": "https://freerepublic.com/focus/f-news/4349628/posts",
    "timestamp": "2025-10-30T16:14:09Z"
  },
  {
    "title": "Trump Absolutely Craters With Young Voters in New Poll — Whopping 63-Point Swing i Net Approval",
    "description": "Trump's support among young voters has absolutely cratered in a new poll with a massive 63-point swing in net approval since the beginning of his second term.\nThe post Trump Absolutely Craters With Young Voters in New Poll — Whopping 63-Point Swing i Net Appr…",
    "link": "https://www.mediaite.com/media/news/trump-absolutely-craters-with-young-voters-in-new-poll-whopping-63-point-swing-i-net-approval/",
    "timestamp": "2025-10-30T16:13:46Z"
  },
  {
    "title": "Last-minute scramble over pay takes a toll on military families during the shutdown",
    "description": "Treasury Secretary Bessent said money may be unavailable for the troop's next paycheck.",
    "link": "https://www.bostonherald.com/2025/10/30/military-pay-shutdown/",
    "timestamp": "2025-10-30T16:13:04Z"
  },
  {
    "title": "‘Truly great’: Trump negotiates with China over rare earths, soybeans",
    "description": "'We have a deal. Now every year we’ll renegotiate the deal'",
    "link": "https://www.wnd.com/2025/10/truly-great-trump-negotiates-china-rare-earths-soybeans/",
    "timestamp": "2025-10-30T16:12:59Z"
  },
  {
    "title": "Farage 'sad' as constituency village named most deprived",
    "description": "The Reform MP reacts after the Essex neighbourhood topped the ranking for the most deprived.",
    "link": "https://www.bbc.com/news/articles/cp85jz7xe4mo",
    "timestamp": "2025-10-30T16:12:13Z"
  },
  {
    "title": "DOJ Removes Trump Reference in Jan. 6 Defendant Court Document",
    "description": "The Justice Department has quietly filed a revised sentencing memorandum in the case of Taylor Taranto, a Washington state man convicted of weapons and threat-related offenses after being arrested near former President Barack Obama’s home, removing earlier re…",
    "link": "https://biztoc.com/x/87d2565250b691bd",
    "timestamp": "2025-10-30T16:12:10Z"
  },
  {
    "title": "Full List of Trump Appointees Found to Be Serving Illegally",
    "description": "A federal judge ruled that a prosecutor appointed by President Donald Trump was serving illegally in a ruling filed Tuesday.\nU.S. District Judge J. Michael Seabright of the Central District of California said Bilal A. Essayli “is not lawfully serving” as acti…",
    "link": "https://biztoc.com/x/b533359836d1a576",
    "timestamp": "2025-10-30T16:11:57Z"
  },
  {
    "title": "WATCH LIVE: Senate expected to vote on whether to repeal Trump’s global tariffs",
    "description": "The Senate is taking a series of votes this week to terminate the national emergencies that President Donald Trump has used to impose tariffs. The resolutions won't ultimately take effect.",
    "link": "https://biztoc.com/x/724219797916da20",
    "timestamp": "2025-10-30T16:11:54Z"
  },
  {
    "title": "Massachusetts advancing $4M to help with food aid amid SNAP standoff",
    "description": "Ahead of public food benefits running out for over a million Bay Staters on Saturday, Gov. Maura Healey announced Thursday that the state will advance a scheduled $4 million payment for food pantries — but is not tapping into the state's reserves, despite cal…",
    "link": "https://www.bostonherald.com/2025/10/30/massachusetts-advancing-4m-to-help-with-food-aid-amid-snap-standoff/",
    "timestamp": "2025-10-30T16:11:36Z"
  },
  {
    "title": "These Small Business Owners Explain How Trump's Tariffs Are More of an 'Existential Crisis' Than COVID",
    "description": "President Donald Trump has imposed tariffs on $2.2 trillion worth of imported goods, claiming they protect domestic producers. Ironically, American small businesses are among those bearing the heaviest burden of these taxes. Now, these businesses are telling …",
    "link": "https://biztoc.com/x/cd6d106d87ae4493",
    "timestamp": "2025-10-30T16:11:22Z"
  },
  {
    "title": "The US is unlikely to test nuclear weapons, despite what Trump says",
    "description": "President Donald Trump appears to have ordered a return to nuclear testing after decades of uneasy but effective treaties banning the practice – but will it actually happen?",
    "link": "https://www.newscientist.com/article/2502130-the-us-is-unlikely-to-test-nuclear-weapons-despite-what-trump-says/",
    "timestamp": "2025-10-30T16:10:12Z"
  },
  {
    "title": "Trump's surgeon general pick goes into labour before confirmation hearing",
    "description": "Casey Means, who does not have an active medical license, is known for her scepticism of conventional medicine and elements of childhood vaccination.",
    "link": "https://www.bbc.com/news/articles/c3rjv93vj2do",
    "timestamp": "2025-10-30T16:08:49Z"
  },
  {
    "title": "Trump call for nuclear tests sows confusion",
    "description": "President Donald Trump Thursday sowed confusion among experts with his call for the start of nuclear weapons testing, with some pundits interpreting the announcement as US preparations for a shock resumption of explosive testing after more than 30 years. The …",
    "link": "https://www.digitaljournal.com/world/trump-call-for-nuclear-tests-sows-confusion/article",
    "timestamp": "2025-10-30T16:07:20Z"
  },
  {
    "title": "Bipartisan Senators Bring Forth the ‘No Coffee Tax Act’",
    "description": "Senators Catherine Cortez Masto (D-Nevada) and Rand Paul (R-Kentucky) this week brought forth the “No Coffee Tax Act,” proposing to repeal all Donald Trump-era tariffs on coffee while preventing...",
    "link": "https://dailycoffeenews.com/2025/10/30/bipartisan-senators-bring-forth-the-no-coffee-tax-act/",
    "timestamp": "2025-10-30T16:06:27Z"
  },
  {
    "title": "AI Chip Sales to China: A Risky Gamble?",
    "description": "Republican Leader Equates Selling Nvidia AI Chips to China with Nuclear Proliferation A leading Republican on the US Congress China policy has stated that selling Nvidia’s cutting-edge AI chips to China would be like giving “weapons-grade uranium to Iran.” Ac…",
    "link": "https://nep123.com/ai-chip-sales-to-china-a-risky-gamble/",
    "timestamp": "2025-10-30T16:05:50Z"
  },
  {
    "title": "J.B. Pritzker Wants ICE Operations Halted in Chicago for Halloween: 'Let Children Be Children'",
    "description": "Gov. J.B. Pritzker (D-IL) wants federal officials to halt immigration operations in Chicago over the Halloween weekend, even as residents welcome their presence after enduring years of illegal alien crime.\nThe post J.B. Pritzker Wants ICE Operations Halted in…",
    "link": "https://www.breitbart.com/immigration/2025/10/30/j-b-pritzker-wants-ice-operations-halted-in-chicago-for-halloween-let-children-be-children/",
    "timestamp": "2025-10-30T16:05:44Z"
  },
  {
    "title": "Jasmine Crockett Accepts Trump's Challenge to Take His 'IQ Test,' Then Studies by Identifying Picture of Elephant",
    "description": "\"I know that he can't seem to find himself in the Oval Office to make sure that he can end this shutdown, but he does have time to troll me. So listen, if...",
    "link": "https://people.com/jasmine-crockett-accepts-donald-trump-challenge-to-take-his-iq-test-studies-by-identifying-photo-elephant-11840116",
    "timestamp": "2025-10-30T16:05:36Z"
  },
  {
    "title": "Ukraine Defends U.S. 'Embargo' on Cuba at U.N., Shuts Down Havana Embassy",
    "description": "The government of Ukraine confirmed on Wednesday that it is shutting down its embassy in Havana, Cuba, in response to the Communist Party offering thousands of mercenaries to Russia to participate in the ongoing invasion of its territory.\nThe post Ukraine Def…",
    "link": "https://www.breitbart.com/latin-america/2025/10/30/ukraine-defends-u-s-embargo-on-cuba-at-u-n-shuts-down-havana-embassy/",
    "timestamp": "2025-10-30T16:05:28Z"
  },
  {
    "title": "WATCH LIVE: Senate expected to vote on whether to repeal Trump’s global tariffs",
    "description": "The Senate is taking a series of votes this week to terminate the national emergencies that President Donald Trump has used to impose tariffs. The resolutions won't ultimately take effect.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-expected-to-vote-on-whether-to-repeal-trumps-global-tariffs",
    "timestamp": "2025-10-30T16:04:32Z"
  },
  {
    "title": "Mike Johnson’s House Is Fox News With a Gavel",
    "description": "Chris Lehmann\n\n\n\nThe House Speaker admits that his legislative chamber no longer matters. That’s the outcome of a series of deliberate leadership decisions to ensure its powerlessness.\r\n\n\r\n\n\nThe post Mike Johnson’s House Is Fox News With a Gavel appeared firs…",
    "link": "https://www.thenation.com/article/politics/mike-johnson-house-shutdown/",
    "timestamp": "2025-10-30T16:03:27Z"
  },
  {
    "title": "Democrats hope for a 'shot in the arm' in New Jersey and Virginia after 2024 losses",
    "description": "The Democratic candidates' focus on affordability could provide a future road map for the party, even as they’ve danced around trans rights and immigration.",
    "link": "https://www.nbcnews.com/politics/elections/democrats-hope-shot-arm-new-jersey-virginia-2024-losses-rcna240731",
    "timestamp": "2025-10-30T16:02:46Z"
  },
  {
    "title": "Trump Blames Obamacare for Premium Hikes His Own Policies Created",
    "description": "Trump is calling for a cheaper, more effective health care system. Medicare for All fits both of those criteria.",
    "link": "https://truthout.org/articles/trump-blames-obamacare-for-premium-hikes-his-own-policies-created/",
    "timestamp": "2025-10-30T16:02:33Z"
  },
  {
    "title": "Trump ends Asia trip with Xi meeting, nuke threat",
    "description": "Trump had spent the last six days in Asia",
    "link": "https://theweek.com/politics/trump-asia-xi-nuke",
    "timestamp": "2025-10-30T16:00:44Z"
  },
  {
    "title": "Apple reports fourth quarter earnings after the bell",
    "description": "The fourth quarter, which runs through the end of September, is the first quarter that includes sales from new iPhone 17 models.",
    "link": "https://www.cnbc.com/2025/10/30/apple-aapl-earnings-report-q4-2025.html",
    "timestamp": "2025-10-30T16:00:01Z"
  },
  {
    "title": "The “Betrayal List” trend turns a Kanye West meltdown into group therapy",
    "description": "Social media has found a cathartic new outlet for their daily frustrations: by turning them into a “betrayal list.” The trend, which riffs on a now-deleted Kanye West post listing everyone he believed wronged him (which included Harriet Tubman as well as his …",
    "link": "https://www.dailydot.com/culture/betrayal-list-trend-tiktok/",
    "timestamp": "2025-10-30T16:00:00Z"
  },
  {
    "title": "The left’s new religion has no logic — and AOC is its perfect preacher",
    "description": "As New York City heads into its next mayoral election, Rep. Alexandria Ocasio-Cortez (D-N.Y.) is doing few favors for the campaign of Zohran Mamdani — at least not for those who value coherence. Her remarks at a recent rally could serve as a Logic 101 case st…",
    "link": "https://www.theblaze.com/columns/opinion/the-lefts-new-religion-has-no-logic-and-aoc-is-its-perfect-preacher",
    "timestamp": "2025-10-30T16:00:00Z"
  },
  {
    "title": "Bringing peace to Gaza a top priority, says Anwar",
    "description": "KUALA LUMPUR: Malaysia has been consistent in calling for a comprehensive peace solution for Gaza, including during every engagement with US President Donald Trump during the 47th Asean Summit and Related Summits, says the Prime Minister. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/31/bringing-peace-to-gaza-a-top-priority-says-anwar",
    "timestamp": "2025-10-30T16:00:00Z"
  },
  {
    "title": "U.S. Physical Therapy Clinics Back-Office Software Market Insights and Growth Outlook by Towards Healthcare",
    "description": "This report, published by Towards Healthcare, a sister firm of Precedence Research, provides an insightful overview of the U.S. physical therapy clinics back-office software market. It highlights key trends, growth drivers, and technological innovations shapi…",
    "link": "https://www.globenewswire.com/news-release/2025/10/30/3177714/0/en/U-S-Physical-Therapy-Clinics-Back-Office-Software-Market-Insights-and-Growth-Outlook-by-Towards-Healthcare.html",
    "timestamp": "2025-10-30T16:00:00Z"
  }
]