[
  {
    "title": "US argues Meta built a social media monopoly",
    "description": "The FTC has launched a landmark antitrust trial accusing Meta of illegally monopolizing social media by acquiring Instagram and WhatsApp to stifle competition. The case could lead to divestitures and reshape Big Tech's acquisition playbook, though legal exper…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-argues-meta-built-a-social-media-monopoly/articleshow/120297339.cms",
    "timestamp": "2025-04-15T03:24:17Z"
  },
  {
    "title": "EU officials get spy-proof gear for US visits as Trump-era tensions heat up trasatlantic relations",
    "description": "The European Commission is now providing burner phones and basic laptops to senior officials visiting the U.S., mirroring precautions taken for trips to China and Ukraine. This unprecedented move reflects growing mistrust due to strained transatlantic relatio…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-officials-get-spy-proof-gear-for-us-visits-as-trump-era-tensions-heat-up-trasatlantic-relations/articleshow/120297194.cms",
    "timestamp": "2025-04-15T03:20:57Z"
  },
  {
    "title": "Confusion over chip, smartphone tariffs unfolds in US",
    "description": "After the Trump administration exempted smartphones and semiconductors from tariffs on Friday, the president backtracked and warned no one was \"getting off the hook\".",
    "link": "https://www.abc.net.au/news/2025-04-15/trump-electronics-semiconductor-tariff-exemption-explained/105178380",
    "timestamp": "2025-04-15T03:14:11Z"
  },
  {
    "title": "Auto stocks jump in Asia as Trump considers tariff exemption",
    "description": "TOKYO -- From Japan to South Korea, shares of automakers and auto parts manufacturers jumped Tuesday morning, following U.S. President Donald Trump's suggestion that he is considering temporarily exempting the industry from his previously announced 25% tariff…",
    "link": "https://biztoc.com/x/22dcb1e66397fc12",
    "timestamp": "2025-04-15T03:12:10Z"
  },
  {
    "title": "A Palestinian activist expecting a US citizenship interview is arrested instead by ICE in Vermont",
    "description": "A Palestinian man who led protests against the war in Gaza as a student at Columbia University has been arrested at a Vermont immigration office where he expected to be interviewed about finalizing his U.S. citizenship.",
    "link": "https://apnews.com/article/immigration-palestine-protest-trump-deportation-columbia-fca7e73fe2cbd616c1eacf3bdececdbe",
    "timestamp": "2025-04-15T03:09:00Z"
  },
  {
    "title": "Inside factories in China, a struggle to survive Trump's tariffs",
    "description": "Chinese factories in Guangzhou face challenges as President Trump's tariffs reach 125%, causing order cancellations and uncertainty. Small factories, vital to China's economy, grapple with finding new buyers amid existing overcapacity and frugal domestic cons…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/inside-factories-in-china-a-struggle-to-survive-trumps-tariffs/articleshow/120297021.cms",
    "timestamp": "2025-04-15T03:07:08Z"
  },
  {
    "title": "Witkoff: Trump seeks to limit Iran's uranium enrichment",
    "description": "US President Donald Trump is seeking to limit Iran's uranium enrichment to 3.67%, White House special envoy St",
    "link": "https://www.jpost.com/breaking-news/article-850149",
    "timestamp": "2025-04-15T03:06:48Z"
  },
  {
    "title": "AOC Says Trump ‘Should Look in the Mirror’ When ‘He Talks About Rapists and Criminals’",
    "description": "Rep. Alexandria Ocasio-Cortez (D-NY) told President Donald Trump to \"look in the mirror\" when \"he talks about rapists and criminals\" during a rally.\nThe post AOC Says Trump ‘Should Look in the Mirror’ When ‘He Talks About Rapists and Criminals’ first appeared…",
    "link": "https://www.mediaite.com/politics/aoc-says-trump-should-look-in-the-mirror-when-he-talks-about-rapists-and-criminals/",
    "timestamp": "2025-04-15T03:05:49Z"
  },
  {
    "title": "South Korea unveils $23 billion support package for chips amid US tariff uncertainty",
    "description": "Seoul will also ramp up a financial assistance programme for the chips industry to 20 trillion won, versus the previous 17 trillion won, according to the joint statement from various ministries including the trade ministry.",
    "link": "https://economictimes.indiatimes.com/tech/technology/south-korea-unveils-23-billion-support-package-for-chips-amid-us-tariff-uncertainty/articleshow/120296955.cms",
    "timestamp": "2025-04-15T03:03:51Z"
  },
  {
    "title": "'I Thought This Day Would Never Come': Ex-Prosecutor Reveals Trump's 'Crisis' Moment",
    "description": "Andrew Weissman issued a dire warning if SCOTUS doesn't take \"drastic steps\" in response to Donald Trump's deportations.",
    "link": "https://www.huffpost.com/entry/msnbc-andrew-weissmann-trump-deportations-supreme-court_n_67fd8e79e4b070cabdc3efd1",
    "timestamp": "2025-04-15T03:03:37Z"
  },
  {
    "title": "China's economy likely grew 5.1% in Q1 on export surge: Poll",
    "description": "China's first-quarter growth is projected at around five percent, fueled by exporters anticipating higher US tariffs. Despite this boost, sluggish domestic consumption and a property market crisis continue to weigh on the economy. Analysts anticipate further …",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-economy-likely-grew-5-1-in-q1-on-export-surge-poll/articleshow/120296946.cms",
    "timestamp": "2025-04-15T03:03:35Z"
  },
  {
    "title": "Asian Stocks Mixed As Stability Returns, Autos Lifted By Exemption Hope",
    "description": "Asian stocks were mixed Tuesday as some stability returned to markets after last week's rollercoaster ride, with auto firms boosted by Donald Trump's possible compromise over steep tariffs on the sector.",
    "link": "https://www.ibtimes.com/asian-stocks-mixed-stability-returns-autos-lifted-exemption-hope-3770083",
    "timestamp": "2025-04-15T03:03:16Z"
  },
  {
    "title": "Asian stocks mixed as stability returns, autos lifted by exemption hope",
    "description": "Asian stocks were mixed Tuesday as some stability returned to markets after last week’s rollercoaster ride, with auto firms boosted by Donald Trump’s possible compromise over steep tariffs on the sector. However, the US president’s unorthodox approach to trad…",
    "link": "https://www.digitaljournal.com/world/asian-stocks-mixed-as-stability-returns-autos-lifted-by-exemption-hope/article",
    "timestamp": "2025-04-15T03:02:32Z"
  },
  {
    "title": "Ford, GM, and more auto stocks get a boost as Trump says he wants to 'help some of the car companies'",
    "description": "In This Story\nAuto makers got a boost on Monday as President Donald Trump said he wanted to help car companies during a conversation at the White House.\n“I’m looking at something to help some of the car companies,” Trump said in response to a reporter’s quest…",
    "link": "https://biztoc.com/x/c3f9feba541ee85e",
    "timestamp": "2025-04-15T03:01:21Z"
  },
  {
    "title": "Disarming Lebanon's Hezbollah No Longer Inconceivable: Analysts",
    "description": "The once unthinkable disarmament of Hezbollah could finally be within reach, as the United States pushes Lebanon to act and applies pressure to the group's backer Iran over its nuclear programme, analysts said.",
    "link": "https://www.ibtimes.com/disarming-lebanons-hezbollah-no-longer-inconceivable-analysts-3770081",
    "timestamp": "2025-04-15T02:57:19Z"
  },
  {
    "title": "Disarming Lebanon's Hezbollah No Longer Inconceivable: Analysts",
    "description": "The once unthinkable disarmament of Hezbollah could finally be within reach, as the United States pushes Lebanon to act and applies pressure to the group's backer Iran over its nuclear programme, analysts said.",
    "link": "https://www.ibtimes.com.au/disarming-lebanons-hezbollah-no-longer-inconceivable-analysts-1857875",
    "timestamp": "2025-04-15T02:57:08Z"
  },
  {
    "title": "Visas revoked for 4 recent UAA students, university president says",
    "description": "The federal government revoked the visas of four people affiliated with the University of Alaska Anchorage, according to UA President Pat Pitney.",
    "link": "https://www.alaskasnewssource.com/2025/04/15/visas-revoked-4-recent-uaa-students-university-president-says/",
    "timestamp": "2025-04-15T02:54:26Z"
  },
  {
    "title": "Disarming Lebanon’s Hezbollah no longer inconceivable: analysts",
    "description": "The once unthinkable disarmament of Hezbollah could finally be within reach, as the United States pushes Lebanon to act and applies pressure to the group’s backer Iran over its nuclear programme, analysts said. Hezbollah was left badly weakened by more than a…",
    "link": "https://www.digitaljournal.com/world/disarming-lebanons-hezbollah-no-longer-inconceivable-analysts/article",
    "timestamp": "2025-04-15T02:53:17Z"
  },
  {
    "title": "Pharma stocks in focus as Trump signals tariffs on imported medicines",
    "description": "President Trump announced potential tariffs on imported pharmaceuticals, impacting countries like India, a major supplier to the US drug market. In 2024, US pharmaceutical imports reached $213 billion, with India providing over 45% of generic drugs and 15% of…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-stocks-in-focus-as-trump-signals-tariffs-on-imported-medicines/articleshow/120296665.cms",
    "timestamp": "2025-04-15T02:51:53Z"
  },
  {
    "title": "Asia stocks mixed as tariff concerns resurface",
    "description": "Asian markets were mixed on Tuesday after rising in recent days when the United States halted tariffs on some electronics. A later decision by US President Donald Trump also temporarily excluded items...",
    "link": "https://biztoc.com/x/32d89067cf0f7aec",
    "timestamp": "2025-04-15T02:50:23Z"
  },
  {
    "title": "International students sue Trump administration over sudden visa revocations",
    "description": "The abrupt actions by the Department of Homeland Security have put hundreds of scholars at risk of detention and deportation, affecting students from prestigious universities to small liberal arts colleges",
    "link": "https://www.thehindubusinessline.com/news/education/international-students-sue-trump-administration-over-sudden-visa-revocations/article69451244.ece",
    "timestamp": "2025-04-15T02:46:02Z"
  },
  {
    "title": "Gov. Newsom releases video urging Canadians to visit California",
    "description": "Newsom refers to President Trump as 'You-Know-Who' in state tourism video",
    "link": "https://www.kcra.com/article/newsom-tourism-video-canadians-visit-california/64481445",
    "timestamp": "2025-04-15T02:44:15Z"
  },
  {
    "title": "Bill Maher went to Washington. He got played.",
    "description": "Two weeks ago, the sharp-tongued comedian Bill Maher had dinner with Donald Trump. Maher emerged from the meeting thoroughly charmed. During the opening monologue on his show on Friday, he described Trump as engaged and even likable. Trump made him feel comfo…",
    "link": "https://freerepublic.com/focus/f-news/4311064/posts",
    "timestamp": "2025-04-15T02:43:48Z"
  },
  {
    "title": "Gov. DeSantis signs \"Gulf of America\" bills",
    "description": "One of the bills (HB 575) will change dozens of state laws to reflect the name change, while the other (HB 549) will require state agencies to update \"geographic materials\" to reflect the change.",
    "link": "https://www.cbsnews.com/miami/news/gov-desantis-signs-gulf-of-america-bills/",
    "timestamp": "2025-04-15T02:42:37Z"
  },
  {
    "title": "JPMorgan CEO Jamie Dimon offloads over 130,000 shares worth $31.5 million",
    "description": "Dimon's share sale may signal caution amid market uncertainty, impacting investor confidence and hinting at potential leadership transition.\nThe post JPMorgan CEO Jamie Dimon offloads over 130,000 shares worth $31.5 million appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/jpmorgan-ceo-stock-sale/",
    "timestamp": "2025-04-15T02:39:25Z"
  },
  {
    "title": "Despite a court order, White House bars AP from Oval Office event",
    "description": "The Trump administration has turned a reporter and photographer from The Associated Press away from covering an Oval Office news conference involving President Donald Trump and El Salvador President Nayib Bukele",
    "link": "https://abcnews.go.com/Business/wireStory/despite-court-order-white-house-bars-ap-oval-120798545",
    "timestamp": "2025-04-15T02:38:28Z"
  },
  {
    "title": "Despite a court order, White House bars AP from Oval Office event",
    "description": "The Trump administration has turned a reporter and photographer from The Associated Press away from covering an Oval Office news conference involving President Donald Trump and El Salvador President Nayib Bukele",
    "link": "https://abcnews.go.com/US/wireStory/despite-court-order-white-house-bars-ap-oval-120798543",
    "timestamp": "2025-04-15T02:38:26Z"
  },
  {
    "title": "Mark Zuckerberg defends WhatsApp, Instagram deals as FTC calls out Meta for ‘killer acquisitions' — What did he say?",
    "description": "In a Federal Trade Commission trial, Mark Zuckerberg defended Meta's purchases of Instagram and WhatsApp against monopoly accusations.",
    "link": "https://www.livemint.com/companies/mark-zuckerberg-defends-whatsapp-instagram-deals-as-ftc-calls-out-meta-for-killer-acquisitions-what-did-he-say-11744680904519.html",
    "timestamp": "2025-04-15T02:36:26Z"
  },
  {
    "title": "US opens door to tariffs on pharma, semiconductors",
    "description": "The United States opened the door on Monday to tariffs targeting high-end technology and pharmaceuticals, feeding the uncertainty gripping the global economy...",
    "link": "https://finance.yahoo.com/news/trumps-tariff-exemptions-markets-relief-154047478.html",
    "timestamp": "2025-04-15T02:33:57Z"
  },
  {
    "title": "Circle Jerks Frontman Keith Morris Calls for 'Army of Luigis' in Support of Alleged United Healthcare Assassin",
    "description": "Keith Morris, frontman for the Los Angeles punk band Circle Jerks, has called for an \"Army of Luigis\" in support of the alleged United Healthcare CEO assassin.\nThe post Circle Jerks Frontman Keith Morris Calls for ‘Army of Luigis’ in Support of Alleged United…",
    "link": "https://www.breitbart.com/entertainment/2025/04/14/circle-jerks-frontman-keith-morris-calls-for-army-of-luigis-in-support-of-alleged-united-healthcare-assassin/",
    "timestamp": "2025-04-15T02:33:31Z"
  },
  {
    "title": "Harvard defies Trump demands for policy changes, risking funding",
    "description": "In a letter to students and faculty, Harvard President Alan Garber said the school would not \"negotiate over its independence or its constitutional rights.\"",
    "link": "https://www.japantimes.co.jp/news/2025/04/15/world/politics/harvard-trump-policy-funding/",
    "timestamp": "2025-04-15T02:32:00Z"
  },
  {
    "title": "Trump Tells Iran To Forget The Concept Of Nuclear Weapons Or Else...",
    "description": "US President Donald Trump has warned Tehran against a drive for nuclear weapons, saying he would not shy away from military actions on a Middle Eastern country&#039;s atomic facilities if it desists from its activities.",
    "link": "https://www.ndtv.com/world-news/donald-trump-tells-iran-to-forget-the-concept-of-nuclear-weapons-or-else-8166190",
    "timestamp": "2025-04-15T02:30:59Z"
  },
  {
    "title": "PepsiCo agrees to meet with Al Sharpton over DEI cuts, potential boycott",
    "description": "Food and beverage giant PepsiCo has agreed to meet this week with civil rights advocates from the National Action Network to discuss the company’s recent decision to roll back some of its diversity, equity, and inclusion initiatives.",
    "link": "https://www.news4jax.com/business/2025/04/14/pepsico-agrees-to-meet-with-al-sharpton-over-dei-cuts-potential-boycott/",
    "timestamp": "2025-04-15T02:30:40Z"
  },
  {
    "title": "Trump Admin Handed Legal Loss as Judge Temporarily Blocks Deportation Plan",
    "description": "A Boston judge blocks Trump's termination of the parole program for four countries, preserving legal status for migrants.",
    "link": "https://www.newsweek.com/judge-blocks-trump-admin-parole-program-four-countries-migrants-2059755",
    "timestamp": "2025-04-15T02:28:58Z"
  },
  {
    "title": "US Treasury Bills face sharp decline as trade wars, inflation concerns weigh on markets",
    "description": "Recent turbulence in U.S. Treasury bills, triggered by fiscal policy concerns and complex trading strategies, has shaken the bond market. The unwinding of leveraged \"basis trades,\" reliant on stable bond prices, led to widespread sell-offs. Investors are clos…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/us-treasury-bills-face-sharp-decline-as-trade-wars-inflation-concerns-weigh-on-markets/articleshow/120295868.cms",
    "timestamp": "2025-04-15T02:23:31Z"
  },
  {
    "title": "\"Didn't Want Anyone Else To Get It\": JD Vance As He Breaks Football Trophy",
    "description": "JD Vance was seen with Ohio State College Football&#039;s National Championship trophy during a welcome ceremony at the White House.",
    "link": "https://www.ndtv.com/world-news/jd-vance-drops-ohio-state-football-trophy-at-white-house-didnt-want-anyone-else-to-get-it-8166118",
    "timestamp": "2025-04-15T02:17:19Z"
  },
  {
    "title": "Dollar steady as traders grapple with tariff uncertainty, volatility",
    "description": "The dollar stabilized on Tuesday, hovering near multi-year lows against the euro and yen amid fluctuating U.S. tariff policies. Investor confidence in the greenback remains shaky, fueled by policy confusion and a rotation out of dollar assets. Dovish comments…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-steady-as-traders-grapple-with-tariff-uncertainty-volatility/articleshow/120295725.cms",
    "timestamp": "2025-04-15T02:17:11Z"
  },
  {
    "title": "The 51st State",
    "description": "We all know that President Donald Trump has the capacity to say stupid things every now and then, which is not (by the way) unique to him. Joe Biden took non compos mentis and babbling idiocy to a whole new level, and then of course there was Kamala. But I di…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311061/posts",
    "timestamp": "2025-04-15T02:15:34Z"
  },
  {
    "title": "The Attack on Gov. Shapiro Was an Assault on Democracy (Sen. Dave McCormick/The Free Press)",
    "description": "Sen. Dave McCormick / The Free Press:\nThe Attack on Gov. Shapiro Was an Assault on Democracy  —  Shapiro is a Democrat.  I'm a Republican who supports President Donald Trump.  No side has a monopoly on the political violence rising in our country.  —  When Go…",
    "link": "https://www.memeorandum.com/250414/p129",
    "timestamp": "2025-04-15T02:15:01Z"
  },
  {
    "title": "Breastfeeding ‘not a political issue’, First Nations leaders say, as MAGA comments continue to haunt Coalition",
    "description": "NT Senator Jacinta Nampijinpa Price's claims of government waste have drawn strong reactions.\nThe post Breastfeeding ‘not a political issue’, First Nations leaders say, as MAGA comments continue to haunt Coalition appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/04/15/2025-election-coalition-jacinta-price-breastfeeding-maga/",
    "timestamp": "2025-04-15T02:14:32Z"
  },
  {
    "title": "CATL Sees Little Impact From US Tariffs, Is Confident on Outlook",
    "description": "The world’s biggest battery maker Contemporary Amperex Technology Co. Ltd. sees little impact from US tariffs and remains bullish about the outlook for electric vehicles.",
    "link": "https://financialpost.com/pmn/business-pmn/catl-sees-little-impact-from-us-tariffs-is-confident-on-outlook",
    "timestamp": "2025-04-15T02:13:01Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,146",
    "description": "These are the key events on day 1,146 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/4/15/russia-ukraine-war-list-of-key-events-day-1146",
    "timestamp": "2025-04-15T02:12:28Z"
  },
  {
    "title": "Harvard: Trump administration freezes $2.2 billion in grants",
    "description": "Harvard University has rejected numerous demands from the Trump administration to crack down on campus activism. The United States federal government on Monday announced it is to freeze more than $2.2 billion (€1.94 billion) in grants and $60 million in contr…",
    "link": "https://www.dw.com/en/harvard-trump-administration-freezes-22-billion-in-grants/a-72245511",
    "timestamp": "2025-04-15T02:11:00Z"
  },
  {
    "title": "Fed's Bostic: Bold moves 'in any direction' wouldn't be prudent",
    "description": "Atlanta Federal Reserve President Raphael Bostic stated that economic uncertainty due to the Trump administration's tariff policies has stalled the economy. He suggested the Fed should pause policy adjustments until clarity emerges. Bostic anticipates tariffs…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-bostic-bold-moves-in-any-direction-wouldnt-be-prudent/articleshow/120295545.cms",
    "timestamp": "2025-04-15T02:09:46Z"
  },
  {
    "title": "US dollar keeps falling as its ‘safe haven’ status is questioned",
    "description": "US dollar has fallen by roughly 8 per cent in 2025, trading near a three-year low. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/us-dollar-keeps-falling-as-its-safe-haven-status-is-questioned",
    "timestamp": "2025-04-15T02:08:46Z"
  },
  {
    "title": "AMD CEO says ready to start chip production at TSMC's plant in Arizona",
    "description": "US President Donald Trump said on Sunday he would be announcing the tariff rate on imported semiconductors this week, adding that there would be flexibility with some companies in the sector.",
    "link": "https://economictimes.indiatimes.com/tech/technology/amd-ceo-says-ready-to-start-chip-production-at-tsmcs-plant-in-arizona/articleshow/120295519.cms",
    "timestamp": "2025-04-15T02:08:46Z"
  },
  {
    "title": "Aimee Lou Wood Did Not Appreciate That SNL Skit",
    "description": "Actress Aimee Lou Wood called SNL’s ‘White Lotus’ sketch, which seemingly made fun of her teeth, “mean and unfunny.”",
    "link": "http://www.thecut.com/article/aimee-lou-woods-reaction-to-snl-sketch-explained.html",
    "timestamp": "2025-04-15T02:08:00Z"
  },
  {
    "title": "South Korea government plans US$4.9 billion more help for semiconductors as US tariff risk bites",
    "description": "SEOUL: South Korea on Tuesday (Apr 15) announced plans to invest an additional US$4.9 billion in the country's semiconductor industry, citing \"growing uncertainty\" over US tariffs. \"An aggressive fiscal investment plan has been devised to help local firms nav…",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-government-plans-us49-billion-help-semiconductors-us-tariff-risk-5066181",
    "timestamp": "2025-04-15T02:05:58Z"
  },
  {
    "title": "Dollar steady as traders grapple with tariff uncertainty, volatility",
    "description": "Still, currency markets were a lot calmer in early Asian hours after last week's turmoil that badly bruised the dollar despite a surge in Treasury yields...",
    "link": "https://finance.yahoo.com/news/dollar-steady-traders-grapple-tariff-020551385.html",
    "timestamp": "2025-04-15T02:05:51Z"
  },
  {
    "title": "Trump moves to put tariffs on chips and drugs, floats pause on auto duties",
    "description": "US president says he is looking at offering relief to automakers as they adjust their supply chains.",
    "link": "https://www.aljazeera.com/economy/2025/4/15/trump-moves-to-put-tariffs-on-chips-and-drugs-floats-pause-on-auto-duties",
    "timestamp": "2025-04-15T02:04:39Z"
  },
  {
    "title": "Nvidia plans to manufacture AI chips in the US for the first time",
    "description": "Nvidia's announcement comes as the Trump administration has said that tariff exemptions on electronics like smartphones and laptops are only a temporary reprieve until officials develop a new tariff approach specific to the semiconductor industry.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/nvidia-plans-to-manufacture-ai-chips-in-the-us-for-the-first-time/articleshow/120295297.cms",
    "timestamp": "2025-04-15T02:00:41Z"
  },
  {
    "title": "Trump’s doctor says president in ‘excellent health,’ citing results of physical and ‘frequent victories’ at golf",
    "description": "By Kevin Liptak, CNN West Palm Beach, Florida (CNN) — President Donald Trump is “fully fit” to perform the duties of the presidency, the White House",
    "link": "https://krdo.com/politics/cnn-us-politics/2025/04/14/trumps-physician-says-president-in-excellent-health/",
    "timestamp": "2025-04-15T02:00:32Z"
  },
  {
    "title": "India’s seafood exports are stuck on a raft of uncertainty",
    "description": "Even if Trump’s tariff flip-flops didn’t leave Indian seafood exporters queasy, the resultant decision paralysis has been bad enough. Exporters need a compass. So does US trade policy.",
    "link": "https://www.livemint.com/opinion/online-views/india-seafood-exports-us-india-trade-tariffs-trump-tariff-policy-frozen-shrimp-exports-us-tariff-flip-flop-indian-shrimp-11744648212430.html",
    "timestamp": "2025-04-15T02:00:14Z"
  },
  {
    "title": "What to know about Ecuador's reelected President Noboa and his plans to fight crime",
    "description": "Daniel Noboa stunned voters in 2023 when he won a snap election for a 16-month presidency after only a brief stint as a lawmaker and with no established political machinery",
    "link": "https://abcnews.go.com/International/wireStory/ecuadors-reelected-president-noboa-plans-fight-crime-120777930",
    "timestamp": "2025-04-15T01:58:27Z"
  },
  {
    "title": "Bernie Sanders compares Trump, Musk and other 'oligarchs' to 'heroin addicts,' says drug of choice is 'greed'",
    "description": "Sen. Bernie Sanders, I-Vt., compared billionaire \"oligarchs\" like Elon Musk, Donald Trump, Jeff Bezos, Mark Zuckerberg and others to \"heroin addicts\" during a Monday night rally.",
    "link": "https://www.foxnews.com/politics/bernie-sanders-compares-trump-musk-other-oligarchs-heroin-addicts-says-drug-choice-greed",
    "timestamp": "2025-04-15T01:58:25Z"
  },
  {
    "title": "Oil prices rise on potential US tariff exemptions on cars, pick-up in China crude imports",
    "description": "Oil prices saw a rise on Tuesday. This increase is due to President Trump's tariff exemptions. China's crude oil imports also rebounded. This rise happened as tighter Iranian supply was expected. Trump is considering changes to tariffs on auto imports. OPEC h…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-rise-on-potential-us-tariff-exemptions-on-cars-pick-up-in-china-crude-imports/articleshow/120295227.cms",
    "timestamp": "2025-04-15T01:57:53Z"
  },
  {
    "title": "China's Economy Likely Grew 5.1% In Q1 On Export Surge: AFP Poll",
    "description": "China is expected to post first-quarter growth of around five percent on Wednesday, buoyed by exporters rushing to stave off higher US tariffs but still weighed by sluggish domestic consumption, analysts say.",
    "link": "https://www.ibtimes.com/chinas-economy-likely-grew-51-q1-export-surge-afp-poll-3770068",
    "timestamp": "2025-04-15T01:57:19Z"
  },
  {
    "title": "Trump administration sued over tariffs in US Court of International Trade",
    "description": "The Liberty Justice Center has filed a lawsuit in the U.S. Court of International Trade, challenging President Trump's tariffs on foreign trading partners. Representing five small U.S. businesses, the lawsuit argues that the president overstepped his authorit…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-sued-over-tariffs-in-us-court-of-international-trade/articleshow/120295195.cms",
    "timestamp": "2025-04-15T01:56:13Z"
  },
  {
    "title": "Gold edges higher as markets grapple with tariff uncertainty",
    "description": "Gold prices experienced a slight increase due to ongoing uncertainty surrounding U.S. President Trump's proposed tariffs and their potential impact on the global economy. Market participants remain cautious as Trump plans to announce tariff rates on imported …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-edges-higher-as-markets-grapple-with-tariff-uncertainty/articleshow/120295186.cms",
    "timestamp": "2025-04-15T01:56:00Z"
  },
  {
    "title": "‘No Winners’ From Trade War, Xi Jinping Says During Vietnam Visit",
    "description": "Amid the Trump administration's tariff threats, Hanoi treated the Chinese leader to an unusually warm welcome.",
    "link": "https://thediplomat.com/2025/04/no-winners-from-trade-war-xi-jinping-says-during-vietnam-visit/",
    "timestamp": "2025-04-15T01:55:00Z"
  },
  {
    "title": "Wall Street ends higher with Apple shares as investors assess tariff exemptions",
    "description": "U.S. stocks closed higher on Monday, buoyed by Apple's surge after the White House exempted smartphones and computers from new tariffs. Despite the gains, uncertainty surrounding future tariff rates, particularly on semiconductors, tempered overall market opt…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-with-apple-shares-as-investors-assess-tariff-exemptions/articleshow/120295136.cms",
    "timestamp": "2025-04-15T01:54:10Z"
  },
  {
    "title": "Pro-Immigration Lawyers Try to Block More than 1,000 Student Visa Cancelations",
    "description": "Pro-immigration lawyers are trying to block President Donald Trump's policy of canceling education visas held by more than 1,000 migrants, including many who sign tuition checks to get work permits for the jobs needed by American graduates.\nThe post Pro-Immig…",
    "link": "https://www.breitbart.com/politics/2025/04/14/marco-rubio-canceled-visitor-visas-proimmigration-lawers-try-block/",
    "timestamp": "2025-04-15T01:53:52Z"
  },
  {
    "title": "Tehran says next round of Iran-US nuclear talks talks in Oman after Rome named by officials",
    "description": "Negotiations between Iran and the United States regarding Iran's nuclear program faced uncertainty as the next round's location shifted between Rome and Oman. Despite conflicting reports, Iran insisted on Oman, while the U.S. remained silent.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tehran-says-next-round-of-iran-us-nuclear-talks-talks-in-oman-after-rome-named-by-officials/articleshow/120295124.cms",
    "timestamp": "2025-04-15T01:53:32Z"
  },
  {
    "title": "Taiwan IC packaging firms report strong 1Q25, but US tariff uncertainty casts shadow",
    "description": "Amid US-China trade tensions and the potential for new US semiconductor tariffs under President Donald Trump, Taiwan's IC packaging and testing industry is showing strong first-quarter 2025 results. However, there are growing concerns that these tariffs might…",
    "link": "https://www.digitimes.com/news/a20250415PD205/taiwan-ic-packaging-testing-revenue-semiconductors.html",
    "timestamp": "2025-04-15T01:53:16Z"
  },
  {
    "title": "US-China trade truce amid tariff chaos? Scott Bessent hints at 'big deal to be done' with China 'at some point'",
    "description": "Treasury Secretary Scott Bessent suggested a US-China deal is possible despite tariff threats, acknowledging China as both a competitor and rival. While Trump administration sends mixed signals, Xi Jinping warns against protectionism during a Vietnam visit. T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-trade-truce-amid-tariff-chaos-scott-bessent-hints-at-big-deal-to-be-done-with-china-at-some-point/articleshow/120295116.cms",
    "timestamp": "2025-04-15T01:53:14Z"
  },
  {
    "title": "China’s economy likely grew 5.1% in Q1 on export surge: AFP poll",
    "description": "China is expected to post first-quarter growth of around five percent on Wednesday, buoyed by exporters rushing to stave off higher US tariffs but still weighed by sluggish domestic consumption, analysts say. Beijing and Washington are locked in a fast-moving…",
    "link": "https://www.digitaljournal.com/world/chinas-economy-likely-grew-5-1-in-q1-on-export-surge-afp-poll/article",
    "timestamp": "2025-04-15T01:52:33Z"
  },
  {
    "title": "Toyota and other Asia auto stocks surge after Trump says he is considering a tariff pause",
    "description": "The auto supply chain is vast and spans numerous countries across the world, so any tariffs would have a knock-on impact on production and pricing.",
    "link": "https://markets.businessinsider.com/news/stocks/stock-markets-auto-cars-surge-trump-tariff-exemption-toyota-hyundai-2025-4",
    "timestamp": "2025-04-15T01:52:12Z"
  },
  {
    "title": "Bernie Sanders, Alexandria Ocasio-Cortez to make \"Fighting Oligarchy\" tour stop in Folsom",
    "description": "Sanders and AOC are crisscrossing western states for what they're calling a \"Fighting Oligarchy\" tour.",
    "link": "https://www.cbsnews.com/sacramento/news/bernie-sanders-aoc-fighting-oligarchy-tour-stop-folsom/",
    "timestamp": "2025-04-15T01:47:00Z"
  },
  {
    "title": "Mark Zuckerberg takes stand to defend Meta against antitrust suit",
    "description": "Mark Zuckerberg, who is expected to resume testimony Tuesday, was the first witness in the trial, Federal Trade Commission v. Meta Platforms. Earlier in the day, the FTC opened its first antitrust trial under the Trump administration by arguing that Meta's ac…",
    "link": "https://economictimes.indiatimes.com/tech/technology/mark-zuckerberg-takes-stand-to-defend-meta-against-antitrust-suit/articleshow/120294945.cms",
    "timestamp": "2025-04-15T01:45:32Z"
  },
  {
    "title": "Donald Trump Says “Nobody Is Getting Off The Hook” In His Stupid Trade War",
    "description": "Donald Trump has backtracked on those exemptions, saying \"no one is getting off the hook\" and \"there was no Tariff 'exception\" on his Truth social account. This kills all hope of anyone avoiding the absurd 145 percent tariff he slapped on China.",
    "link": "https://hiphopwired.com/2678042/donald-trump-walks-back-exemptions-tariffs/",
    "timestamp": "2025-04-15T01:45:24Z"
  },
  {
    "title": "‘American Psycho’ Director Mary Harron Reflects On Film’s Relevancy In Trump Era: “Society Is Actually, 25 Years Later, Much Worse”",
    "description": "On the 25th anniversary of American Psycho, director Mary Harron reflected on the darkly satirical film’s legacy in the wake of Donald Trump’s second presidency and how misunderstood the movie remains even amid enduring popularity. The filmmaker sat down with…",
    "link": "http://deadline.com/2025/04/american-psycho-mary-harron-trump-film-legacy-1236368612/",
    "timestamp": "2025-04-15T01:45:12Z"
  },
  {
    "title": "South Korea announces over $23 billion for chip sector as Trump tariffs on semiconductor imports loom",
    "description": "The 33 billion won figure was about a quarter more than the 26 trillion committed last year.",
    "link": "https://www.cnbc.com/2025/04/15/south-korea-announces-over-23-billion-for-chip-sector-as-trump-tariffs-on-semiconductor-imports-loom-.html",
    "timestamp": "2025-04-15T01:45:09Z"
  },
  {
    "title": "Trump might pump the brakes on auto tariffs — ‘I don’t change my mind but I’m flexible,’ president says",
    "description": "President Donald Trump on Monday suggested that he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.\n“I’m looking at something to help some of the car companies w…",
    "link": "https://biztoc.com/x/f1aac7879082cf87",
    "timestamp": "2025-04-15T01:44:30Z"
  },
  {
    "title": "Another Columbia student arrested by US immigration officials",
    "description": "A U.S. judge in Vermont has blocked the Trump administration from deporting Mohsen Mahdawi, a Columbia University student and pro-Palestinian activist, who was arrested while attending a citizenship interview. Mahdawi’s lawyers allege retaliation for his acti…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/another-columbia-student-arrested-by-us-immigration-officials/articleshow/120294884.cms",
    "timestamp": "2025-04-15T01:42:52Z"
  },
  {
    "title": "Vietnam navigates US-China tariff tensions with caution",
    "description": "Vietnam, historically a significant beneficiary of the \"China +1\" strategy, finds itself between pressure from the US and political ties with China. It was the first to engage in reciprocal tariff talks with the US, but was also featured in Chinese President …",
    "link": "https://www.digitimes.com/news/a20250415PD209/vietnam-investment-labor-apple-tariffs.html",
    "timestamp": "2025-04-15T01:42:28Z"
  },
  {
    "title": "White House proposes drastic cuts to State Department and funding for UN, NATO and other groups",
    "description": "The White House’s Office of Management and Budget has proposed gutting the State Department’s budget by almost 50%, closing a number of overseas diplomatic missions, and eliminating funding for nearly all international organizations, including the Unit...",
    "link": "https://abcnews.go.com/US/wireStory/white-house-proposes-drastic-cuts-state-department-funding-120806149",
    "timestamp": "2025-04-15T01:42:24Z"
  },
  {
    "title": "Salvadoran fugitive convicted in deadly attack of Maryland hiker",
    "description": "A fugitive from El Salvador has been convicted in the 2023 slaying of a Maryland woman who was attacked while exercising on a popular hiking trail northeast of Baltimore",
    "link": "https://abcnews.go.com/US/wireStory/salvadoran-fugitive-convicted-deadly-attack-maryland-hiker-120809902",
    "timestamp": "2025-04-15T01:42:23Z"
  },
  {
    "title": "Trump signals possible auto tariff reprieve to help carmakers shift supply chains",
    "description": "While expressing support for increased domestic production, Trump’s fluctuating stance on tariffs has caused uncertainty in financial markets, contributing to concerns about a potential recession.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-signals-possible-auto-tariff-reprieve-to-help-carmakers-shift-supply-chains/article69451241.ece",
    "timestamp": "2025-04-15T01:40:44Z"
  },
  {
    "title": "Trump's Dilemma: A trade war that threatens every other negotiation with China",
    "description": "President Trump's trade war with China jeopardizes potential negotiations on critical issues, including trade disputes, Taiwan, and technology. Internal divisions within the White House contribute to a lack of coherent strategy, as some officials advocate for…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-dilemma-a-trade-war-that-threatens-every-other-negotiation-with-china/articleshow/120294813.cms",
    "timestamp": "2025-04-15T01:39:20Z"
  },
  {
    "title": "White House proposes drastic cuts to State Department and funding for UN, NATO and other groups",
    "description": "The White House proposes drastic cuts to the State Department's budget, potentially slashing it by almost 50%. This includes closing overseas missions, reducing diplomatic staff, and eliminating funding for the UN and NATO. The proposal, facing resistance fro…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-proposes-drastic-cuts-to-state-department-and-funding-for-un-nato-and-other-groups/articleshow/120294798.cms",
    "timestamp": "2025-04-15T01:38:52Z"
  },
  {
    "title": "Trump Sets Stage For New Tariffs With Probe Into Pharma, Chip Imports",
    "description": "Amid US President Donald Trump&#039;s fresh tariff threats, the federal government in America has opened an investigation into the effects of importing certain pharmaceuticals and semiconductors on national security.",
    "link": "https://www.ndtv.com/world-news/trump-sets-stage-for-new-tariffs-with-probe-into-pharmaceuticals-semiconductors-imports-8165982",
    "timestamp": "2025-04-15T01:38:04Z"
  },
  {
    "title": "A top government contracts lawyer at Perkins Coie, a law firm targeted by Trump, switches firms",
    "description": "He said his move to Vinson & Elkins was in the works before President Donald Trump's executive action aimed at Perkins Coie.",
    "link": "https://www.businessinsider.com/top-government-contracts-lawyer-at-perkins-coie-switches-firms-2025-4",
    "timestamp": "2025-04-15T01:37:10Z"
  },
  {
    "title": "WHITE HOUSE DOWN ‘A bad fumble’ – Embarrassing moment JD Vance breaks college football trophy during Ohio State’s White House visit",
    "description": "VICE President JD Vance has fumbled college football's biggest award.",
    "link": "https://freerepublic.com/focus/f-chat/4311052/posts",
    "timestamp": "2025-04-15T01:35:58Z"
  },
  {
    "title": "Moaning federal workers make disgusting discoveries as they return to office after Trump ended WFH",
    "description": "Thousands of federal employees who were forced to return to their offices in recent weeks have made some disgusting discoveries - including a lack of toilet paper and rodents. Donald Trump promptly ended work from home options for federal workers upon taking …",
    "link": "https://freerepublic.com/focus/f-news/4311051/posts",
    "timestamp": "2025-04-15T01:35:40Z"
  },
  {
    "title": "White House proposes deep cuts to State Department, UN and NATO funding",
    "description": "While the proposal is still preliminary and faces possible rejection by Congress, it reflects the Trump administration’s focus on reducing federal spending across multiple agencies.",
    "link": "https://www.thehindubusinessline.com/news/world/white-house-proposes-deep-cuts-to-state-department-un-and-nato-funding/article69451237.ece",
    "timestamp": "2025-04-15T01:34:55Z"
  },
  {
    "title": "'Bad news for the White House': Dems now tied with the GOP on key Trump issue",
    "description": "An April poll shows President Donald Trump is losing his biggest polling advantage over Democrats.“Bad news for the White House per @EchelonInsights,” wrote Snapchat host Peter Hamby. “Dems are now tied with Republicans on the question of who would do a bette…",
    "link": "https://www.rawstory.com/trump-economy-2671768721/",
    "timestamp": "2025-04-15T01:34:28Z"
  },
  {
    "title": "Reliance eyes Flipkart veteran; Small towns seek wealth",
    "description": "Flipkart's former chief product and technology officer is set to join Reliance Retail Ventures as CEO. This and more in today’s",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/reliance-eyes-flipkart-veteran-small-towns-seek-wealth/articleshow/120294329.cms",
    "timestamp": "2025-04-15T01:32:16Z"
  },
  {
    "title": "United States records sharpest drop in Australian visitors since COVID",
    "description": "As the Trump administration continues its crackdown on border security, more Australians appear to be avoiding the US.",
    "link": "https://www.abc.net.au/news/2025-04-15/australians-appear-to-be-avoiding-travel-to-the-us/105124236",
    "timestamp": "2025-04-15T01:31:52Z"
  },
  {
    "title": "Why Xi Jinping's Asian charm offensive is annoying Donald Trump",
    "description": "The timing of his tour through South-East Asia couldn't be better for Xi, who is trying to court as many countries as possible to form a united diplomatic front against Trump's tariffs.",
    "link": "https://www.abc.net.au/news/2025-04-15/xi-diplomacy-tour-through-asia-riles-trump/105177484",
    "timestamp": "2025-04-15T01:31:25Z"
  },
  {
    "title": "Trump Administration Denies State Emergency Relief After Deadly Storm",
    "description": "FEMA told Washington that disaster relief funding is \"not warranted\" as the state continues recovery efforts in the wake of a bomb cyclone.",
    "link": "https://www.newsweek.com/trump-administration-denies-washington-fema-funds-2059732",
    "timestamp": "2025-04-15T01:30:49Z"
  },
  {
    "title": "Unpacking claims that David Letterman once called Donald Trump a 'goon' and said, 'put him in a home'",
    "description": "The longtime late-night comedian allegedly said the quote during an interview with The Associated Press.",
    "link": "https://www.snopes.com//news/2025/04/15/trump-david-letterman-quote/",
    "timestamp": "2025-04-15T01:30:00Z"
  },
  {
    "title": "‘We’d be foolish not to prepare’ – Cabinet to hear plans to protect Ireland against Donald Trump’s tariffs",
    "description": "Tánaiste Simon Harris and Enterprise Minister Peter Burke will bring proposals to the Cabinet today to enhance Ireland’s competitiveness and productivity amid tensions over tariffs.",
    "link": "https://www.independent.ie/irish-news/politics/wed-be-foolish-not-to-prepare-cabinet-to-hear-plans-to-protect-ireland-against-donald-trumps-tariffs/a256373848.html",
    "timestamp": "2025-04-15T01:30:00Z"
  },
  {
    "title": "Letters: First it was the Masters for Rory McIlroy – next might we finally see Mayo lift Sam?",
    "description": "Following on from Rory McIlroy’s great win, can Mayo do it this year?",
    "link": "https://www.independent.ie/opinion/letters/letters-first-it-was-the-masters-for-rory-mcilroy-next-might-we-finally-see-mayo-lift-sam/a1493787516.html",
    "timestamp": "2025-04-15T01:30:00Z"
  },
  {
    "title": "Trump again claims Ukraine started war as world fury grows with Russia over Sumy strike it claims hit military meeting",
    "description": "Donald Trump has once again falsely blamed Volodymyr Zelensky for “starting” the war in Ukraine without acknowledging Vladimir Putin’s military invasion in February 2022.",
    "link": "https://www.independent.ie/world-news/europe/trump-again-claims-ukraine-started-war-as-world-fury-grows-with-russia-over-sumy-strike-it-claims-hit-military-meeting/a489003196.html",
    "timestamp": "2025-04-15T01:30:00Z"
  },
  {
    "title": "‘We’d be foolish not to prepare’ – Cabinet to hear plans to protect Ireland against Donald Trump’s tariffs",
    "description": "Tánaiste Simon Harris and Enterprise Minister Peter Burke will bring proposals to the Cabinet today to enhance Ireland’s competitiveness and productivity amid tensions over tariffs.",
    "link": "https://www.independent.ie/irish-news/wed-be-foolish-not-to-prepare-cabinet-to-hear-plans-to-protect-ireland-against-donald-trumps-tariffs/a256373848.html",
    "timestamp": "2025-04-15T01:30:00Z"
  },
  {
    "title": "UK and France to present Donald Trump with plan to safeguard Ukraine after peace deal with Russia secured",
    "description": "The UK and France are planning to present Donald Trump with a comprehensive plan for a post-war “reassurance force” in Ukraine that they hope will persuade the US president to commit to security guarantees for Kyiv, according to people familiar with the matte…",
    "link": "https://www.independent.ie/world-news/europe/uk-and-france-to-present-donald-trump-with-plan-to-safeguard-ukraine-after-peace-deal-with-russia-secured/a1903811302.html",
    "timestamp": "2025-04-15T01:30:00Z"
  },
  {
    "title": "David W Higgins: Trump’s trade war may make Irish housing more affordable – even if it doesn’t lower prices",
    "description": "Ireland’s housing crisis is a “good problem” to have, US president Donald Trump declared in the White House last month. But not quite.",
    "link": "https://www.independent.ie/opinion/comment/david-w-higgins-trumps-trade-war-may-make-irish-housing-more-affordable-even-if-it-doesnt-lower-prices/a1841582189.html",
    "timestamp": "2025-04-15T01:30:00Z"
  },
  {
    "title": "Irish forecasters losing out on vital weather data due to Donald Trump’s science funding cuts",
    "description": "Cuts by the Donald Trump administration to funding for science has resulted in a loss of critical weather observations normally shared with European counterparts, including Ireland.",
    "link": "https://www.independent.ie/irish-news/irish-forecasters-losing-out-on-vital-weather-data-due-to-donald-trumps-science-funding-cuts/a651966587.html",
    "timestamp": "2025-04-15T01:30:00Z"
  }
]