[
  {
    "title": "El Salvador's Bukele after friendly White House meeting with Trump: 'I miss you already, President T'",
    "description": "El Salvador's President Nayib Bukele tweeted, \"I miss you already, President T.\" The foreign leader met with U.S. President Donald Trump at the White House on Monday.",
    "link": "https://www.foxnews.com/politics/el-salvadors-bukele-after-friendly-white-house-meeting-trump-i-miss-you-already-president-t",
    "timestamp": "2025-04-15T10:11:43Z"
  },
  {
    "title": "Multiple Colleges Join Harvard in Fight Against Trump Admin",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA group of U.S. universities sued the Department of Energy on Monday over cuts to federal research funding, joining Harvard University in fighting President Donald Trump's administration.\nNewsweek has contacte…",
    "link": "https://biztoc.com/x/1efcb50e008ea2e3",
    "timestamp": "2025-04-15T10:09:41Z"
  },
  {
    "title": "Europa tras el fin del orden internacional liberal",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/europe-after-the-liberal-international-order-by-mark-leonard-2025-04/spanish",
    "timestamp": "2025-04-15T10:07:02Z"
  },
  {
    "title": "Europe After the End of the Liberal International Order",
    "description": "As Europeans rearm to confront Russian aggression, they also need to figure out how to survive in the age of \"unpeace\" that Donald Trump and other strongmen are ushering in. The old interdependencies that liberals took for granted no longer ensure peace, pros…",
    "link": "https://www.project-syndicate.org/commentary/europe-after-the-liberal-international-order-by-mark-leonard-2025-04",
    "timestamp": "2025-04-15T10:07:02Z"
  },
  {
    "title": "Trump press secretary Karoline Leavitt's dress made in China? Chinese envoy's claim as trade war intensifies",
    "description": "The US-China trade war has spilled onto social media, with Chinese supporters aiming at the US. The latest target is White House press secretary Karoline Leavitt, who faced backlash after wearing a dress reportedly made in China. The controversy started after…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-press-secretary-karoline-leavitts-dress-made-in-china-chinese-envoys-claim-as-trade-war-intensifies/articleshow/120308110.cms",
    "timestamp": "2025-04-15T10:05:49Z"
  },
  {
    "title": "Feds suing nation's largest private apartment manager over 'deceptive' lease advertising",
    "description": "Greystar, based in South Carolina, disputes the accusations and says tenants never sign without full cost disclosure.",
    "link": "https://www.usatoday.com/story/news/nation/2025/04/15/ftc-sue-greystar-apartment-fees-lawsuit-renters/83084327007/",
    "timestamp": "2025-04-15T10:02:50Z"
  },
  {
    "title": "China halts delivery of Boeing jets — report",
    "description": "Chinese airlines are under instructions not to take delivery of planes from US manufacturer Boeing, according to a Bloomberg report. It comes as trade war between Beijing and Washington continues to gain momentum.",
    "link": "https://www.dw.com/en/china-halts-delivery-of-boeing-jets-report/a-72248102",
    "timestamp": "2025-04-15T10:01:00Z"
  },
  {
    "title": "How DOGE led a ‘hostile takeover’ at the IRS to use taxpayer data for immigration crackdowns | CNN Politics",
    "description": "A group of senior career officials tried but ultimately failed to protect the agency’s highly-sensitive database of taxpayer information.",
    "link": "https://www.cnn.com/2025/04/15/politics/doge-irs-takeover-taxpayer-data-immigration/index.html",
    "timestamp": "2025-04-15T10:00:36Z"
  },
  {
    "title": "Multiple Colleges Join Harvard in Fight Against Trump Admin",
    "description": "A group of universities have sued the Department of Energy over cuts to federal research funding.",
    "link": "https://www.newsweek.com/multiple-colleges-harvard-fight-trump-admin-2059807",
    "timestamp": "2025-04-15T10:00:31Z"
  },
  {
    "title": "Stocks Get a Boost From Reprieve on Auto Tariffs: Markets Wrap",
    "description": "In This Article:\n(Bloomberg) -- Stocks rose as US President Donald Trump floated a potential pause in auto tariffs, providing further relief to the market after he suspended levies on some consumer electronics.\nMost Read from Bloomberg\nEurope’s Stoxx 600 inde…",
    "link": "https://biztoc.com/x/049f2e45bca22958",
    "timestamp": "2025-04-15T10:00:24Z"
  },
  {
    "title": "IRS agreement with ICE to share immigrants' info could lead to billions less in tax revenue",
    "description": "10% fewer undocumented immigrants filing their taxes would mean a decrease of $9.5 billion a year in tax revenue, a tax policy organization found.",
    "link": "https://www.nbcnews.com/news/us-news/immigrants-fear-deportation-filing-taxes-irs-ice-agreement-rcna200822",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "What’s the Matter with Glenn Greenwald and Matt Taibbi?",
    "description": "A few weeks into 2025, Ross Douthat, The New York Times’ idiosyncratically conservative columnist, interviewed Marc Andreessen: Netscape co-founder, venture capitalist, general Silicon Valley gadabout, and, lately, fixture in Trump-adjacent Washington, where …",
    "link": "https://newrepublic.com/article/193531/glenn-greenwald-matt-taibbi-tech-billionaires-journalists",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "Paying Your Taxes Used to Be Patriotic",
    "description": "The 1950s, the wealthy were willing to pay higher taxes for the benefit of all. Here's how America's fiscal patriotism unraveled.",
    "link": "https://time.com/7274242/taxes-fiscal-patriotism/",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "Just How Badly Does Donald Trump Want Access to Critical Minerals?",
    "description": "Nick Niarchos reports on the Democratic Republic of the Congo’s attempts to use its vast mineral resources as leverage in foreign policy amid military threats.",
    "link": "https://www.newyorker.com/news/the-lede/just-how-badly-does-donald-trump-want-access-to-critical-minerals",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "The Plight of the Taxman",
    "description": "E. Tammy Kim on how I.R.S. employees are toiling through tax season while their agency is being by dismantled Donald Trump’s Administration.",
    "link": "https://www.newyorker.com/news/deep-state-diaries/the-plight-of-the-taxman",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "Canada's federal election is less than 2 weeks away — but 2SLGBTQ+ voters say they feel sidelined",
    "description": "With Canada's 45th federal election two weeks away, 2SLGBTQ+ voters, community organizations and experts say tariffs have overshadowed the salient issues against a rising transphobic and anti-queer rhetoric in Canada.",
    "link": "https://www.cbc.ca/news/canada/windsor/2slgtbq-issues-federal-election-1.7507295",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "What If David Mamet Was Always a MAGA Fanboy?",
    "description": "On the evening of March 25, 1984, David Mamet’s play Glengarry Glen Ross premiered on Broadway. His scabrous portrait of a tribe of sleazy real estate salesmen immediately earned the rave reviews that anticipated its Pulitzer Prize for drama. Frank Rich of Th…",
    "link": "https://newrepublic.com/article/193972/david-mamet-always-maga-fanboy",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "Trump's attacks on the IRS will encourage wealthy tax cheats",
    "description": "President Donald Trump's attacks on the IRS will encourage the wealthy to cheat on their taxes.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-irs-attacks-wealthy-tax-cheats-rcna199082",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "Trump's tariff confusion is a bug, not a feature",
    "description": "Trump's off and on tariffs on things like smartphones made in China make it hard to know when to buy a new iPhone or pay less for a new computer",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trumps-tariff-confusion-iphone-electronics-rcna201147",
    "timestamp": "2025-04-15T10:00:00Z"
  },
  {
    "title": "Ramaswamy’s lead in Ohio primary grows",
    "description": "The Scoop\nRepublican Ohio gubernatorial candidate Vivek Ramaswamy holds a solid lead in the primary — one that increased dramatically after President Donald Trump’s endorsement at the end of February, according to new internal polling conducted by longtime Tr…",
    "link": "https://biztoc.com/x/30c4e14b68e09bb4",
    "timestamp": "2025-04-15T09:59:08Z"
  },
  {
    "title": "Here’s What’s In The New Rough Draft U.S.-Iran Nuclear Deal",
    "description": "A purported list of proposed US terms for its negotiations with Iran looks to go well beyond what Iran could accept.",
    "link": "https://www.nakedcapitalism.com/2025/04/heres-whats-in-the-new-rough-draft-u-s-iran-nuclear-deal.html",
    "timestamp": "2025-04-15T09:55:15Z"
  },
  {
    "title": "Trump eyes deportation of ‘homegrown criminals’ to El Salvador",
    "description": "After deporting foreign passport holders to notorious Central American prison, president hints US citizens could follow.",
    "link": "https://www.aljazeera.com/news/2025/4/15/trump-eyes-deportation-of-homegrown-criminals-to-el-salvador",
    "timestamp": "2025-04-15T09:52:32Z"
  },
  {
    "title": "JD Vance: Europe can’t be a ‘permanent security vassal’ of the US",
    "description": "The American vice president concurs with French sentiment that the continent needs to be militarily independent.",
    "link": "https://www.politico.eu/article/jd-vance-europe-permanent-security-vassal-united-states/",
    "timestamp": "2025-04-15T09:52:06Z"
  },
  {
    "title": "Pandemic Treaty Talks Inch Towards Deal",
    "description": "Countries hoping to end more than three years of negotiations on battling future pandemics met for talks on Tuesday, after reaching a preliminary agreement last week.",
    "link": "https://www.ibtimes.com/pandemic-treaty-talks-inch-towards-deal-3770127",
    "timestamp": "2025-04-15T09:51:15Z"
  },
  {
    "title": "India much better placed to deal with Trump tariffs: ITC Chairman Sanjiv Puri",
    "description": "ITC Chairman Sanjiv Puri said India is well-positioned to handle disruptions from US tariffs, anticipating a potential FTA with the US. Discussions are progressing rapidly, alongside potential FTAs with the EU and UK. Despite short-term uncertainties, India's…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-much-better-placed-to-deal-with-trump-tariffs-itc-chairman-sanjiv-puri/articleshow/120307715.cms",
    "timestamp": "2025-04-15T09:51:01Z"
  },
  {
    "title": "A Tesla investor and fund manager explains why the volatility from Trump's tariffs hasn't changed his stock picks",
    "description": "\"I think it's too soon to tell if the tariffs will lead the world into a recession,\" Christopher Tsai said of Trump's reciprocal tariffs.",
    "link": "https://www.businessinsider.com/fund-manager-explains-why-trump-tariffs-not-changed-stock-picks-2025-4",
    "timestamp": "2025-04-15T09:50:18Z"
  },
  {
    "title": "ICE Realize They Arrested Wrong Teen, Say 'Take Him Anyway'",
    "description": "Merwil Gutiérrez, was deported to El Salvador's notorious super prison, despite his family's insistence that he has no gang ties or criminal history.",
    "link": "https://www.newsweek.com/merwil-gutierrez-ice-wrong-teen-el-salvador-2059783",
    "timestamp": "2025-04-15T09:48:44Z"
  },
  {
    "title": "How major US stock indexes fared Monday, 4/14/2025",
    "description": "How major US stock indexes fared Monday, 4/14/2025\nStocks rallied worldwide after President Donald Trump relaxed some of his tariffs and as stress from within the U.S. bond market seemed to ease.\nThe S&P 500 rose 0.8% Monday. The Dow Jones Industrial Average …",
    "link": "https://biztoc.com/x/56cda936473f755b",
    "timestamp": "2025-04-15T09:48:16Z"
  },
  {
    "title": "Jewish, Israeli peers condemn arrest of Palestinian Columbia student over activism",
    "description": "Despite leading the Columbia's Gaza solidarity encampment, Mohsen Mahdawi spent months fostering ties with Israeli and Jewish students, even holding meetings with university administrators to promote dialogue ■ Roni Ziv, an Israeli student who met with Mahdaw…",
    "link": "https://www.haaretz.com/us-news/2025-04-15/ty-article-magazine/.premium/jewish-israeli-peers-condemn-arrest-of-palestinian-columbia-student-over-activism/00000196-3885-dc0f-adb6-bdd5abb80000",
    "timestamp": "2025-04-15T09:46:38Z"
  },
  {
    "title": "Salvadoran fugitive convicted in deadly attack of Maryland hiker",
    "description": "A fugitive from El Salvador was convicted Monday in the 2023 slaying of a Maryland woman who was attacked on a popular hiking trail northeast of Baltimore.",
    "link": "https://www.nbcnews.com/news/us-news/salvadoran-fugitive-convicted-deadly-attack-maryland-hiker-rcna201270",
    "timestamp": "2025-04-15T09:45:45Z"
  },
  {
    "title": "Donald Trump blasted by lawmaker for massive golf tab",
    "description": "Donald Trump blasted by lawmaker for massive golf tabpennlive.com",
    "link": "https://www.pennlive.com/politics/2025/04/trump-slammed-by-lawmaker-for-running-up-massive-golf-tab.html",
    "timestamp": "2025-04-15T09:45:13Z"
  },
  {
    "title": "German Investor Outlook Plunges as US Trade Chaos Takes Toll",
    "description": "Investor confidence in Germany’s economy plummeted as US President Donald Trump’s on-off trade measures threaten to choke off a nascent recovery.",
    "link": "https://financialpost.com/pmn/business-pmn/german-investor-outlook-plunges-as-us-trade-chaos-takes-toll",
    "timestamp": "2025-04-15T09:44:57Z"
  },
  {
    "title": "Pam Bondi Gives Stunning Response When Asked if Trump’s Plan to Jail Americans Abroad Is ‘Legal’",
    "description": "Attorney General Pam Bondi refused to say whether President Donald Trump’s plan to deport American citizens to a Salvadoran prison is legal. During an...",
    "link": "https://www.thedailybeast.com/pam-bondi-gives-stunning-answer-when-asked-if-trumps-plan-to-jail-americans-abroad-is-legal/",
    "timestamp": "2025-04-15T09:44:28Z"
  },
  {
    "title": "AI, sustainability, and structural changes: what’s coming for the oil and gas industry",
    "description": "The industry will likely need to speed up its adoption of new technologies – most of which can be capital-intensive – as the need for hydrocarbons shows no...",
    "link": "https://www.offshore-technology.com/analysis/ai-sustainability-and-structural-changes-whats-coming-for-the-oil-and-gas-industry/",
    "timestamp": "2025-04-15T09:43:47Z"
  },
  {
    "title": "European and Asian shares rise as car tariff change touted",
    "description": "EU seeks deal with US on levies",
    "link": "https://www.irishtimes.com/business/markets/2025/04/15/european-and-asian-shares-rise-as-car-tariff-change-touted/",
    "timestamp": "2025-04-15T09:43:11Z"
  },
  {
    "title": "Harvard loses billions in federal funding after defying Trump orders on DEI and protests",
    "description": "Harvard University has lost billions of dollars of federal funding after defying requests from the Trump administration, including refusing to scrap diversity, equality and inclusion (DEI) policies. Last week, the US government sent the Ivy League university …",
    "link": "https://www.thepinknews.com/2025/04/15/harvard-university-trump-funding-dei-diversity/",
    "timestamp": "2025-04-15T09:42:49Z"
  },
  {
    "title": "Europe ‘Frankly Insane’ To Keep Importing Fossil Fuels, Scientist Says",
    "description": "Experts have blasted both the EU and U.S. governments in response to a new report confirming that Europe is the world's fastest warming continent.",
    "link": "https://www.forbes.com/sites/davidrvetter/2025/04/15/europe-frankly-insane-to-keep-importing-fossil-fuels-scientist-says/",
    "timestamp": "2025-04-15T09:41:17Z"
  },
  {
    "title": "Nissan to cut Japanese production of top-selling US model, source says",
    "description": "STORY: :: NissanNissan will cut Japanese production of its top-selling U.S. model, the Rogue SUV, over May-July.That's according to a person familiar with...",
    "link": "https://finance.yahoo.com/video/nissan-cut-japanese-production-top-094054320.html",
    "timestamp": "2025-04-15T09:40:54Z"
  },
  {
    "title": "US climate cuts hurting global science: Europe's weather agency",
    "description": "Europe's meteorological agency says cuts by US President Donald Trump's administration to a key American science agency had hindered the sharing of crucial observations used around the globe to monitor the climate and forecast weather.",
    "link": "https://phys.org/news/2025-04-climate-global-science-europe-weather.html",
    "timestamp": "2025-04-15T09:39:04Z"
  },
  {
    "title": "Amir Khan: “It’s sad Floyd Mayweather is facing bankruptcy but karma is a b****”",
    "description": "Amir Khan says it’s “sad” Floyd Mayweather could be heading for bankruptcy, but adds “karma is a → read article \nAmir Khan: “It’s sad Floyd Mayweather is facing bankruptcy but karma is a b****” @ Boxing News 24",
    "link": "https://www.boxingnews24.com/2025/04/amir-khan-its-sad-floyd-mayweather-is-facing-bankruptcy-but-karma-is-a-b/",
    "timestamp": "2025-04-15T09:38:11Z"
  },
  {
    "title": "Nissan to cut Japanese production of top-selling US model due to tariffs, source says",
    "description": "Nissan will cut Japanese production of its top-selling US model, the Rogue SUV, over May-July, said a person familiar with the matter, becoming the latest global automaker to alter manufacturing plans in response to new US import tariffs.",
    "link": "https://nypost.com/2025/04/15/business/nissan-to-cut-japanese-production-of-top-selling-us-model-due-to-tariffs-source-says/",
    "timestamp": "2025-04-15T09:38:06Z"
  },
  {
    "title": "Trump grumbles about China’s ‘lovely meeting’ with Vietnam, saying they’re discussing how to ‘screw the United States of America’",
    "description": "China President Xi Jinping is in Vietnam to start off a week-long tour of Southeast Asia—and U.S. President Donald Trump is paying close attention.\nIn comments to reporters on Monday, Trump suggested that Xi’s meeting with Vietnamese officials, including Gene…",
    "link": "https://biztoc.com/x/5e56196dd694261d",
    "timestamp": "2025-04-15T09:38:05Z"
  },
  {
    "title": "Why Progressives Increasingly Support Violence",
    "description": "<p>A new survey finds more than half of left-wing respondents believe assassinating Donald Trump could be justified.</p>",
    "link": "https://www.realclearpolitics.com/2025/04/15/why_progressives_increasingly_support_violence_644845.html",
    "timestamp": "2025-04-15T09:37:06Z"
  },
  {
    "title": "US detains Palestinian student at appointment for citizenship",
    "description": "A Palestinian student who led protests against the war in Gaza as a student at Columbia University has been arrested by US immigration officials, despite being a legal permanent resident.",
    "link": "https://www.dw.com/en/us-detains-palestinian-student-at-appointment-for-citizenship/a-72247882",
    "timestamp": "2025-04-15T09:37:00Z"
  },
  {
    "title": "US detains Palestinian student at citizenship interview",
    "description": "A Palestinian student who led protests against the war in Gaza as a student at Columbia University has been arrested by US immigration officials, despite being a legal permanent resident. US officials detained Mohsen Mahdawi, a Palestinian student at Columbia…",
    "link": "https://www.dw.com/en/us-detains-palestinian-student-at-citizenship-interview/a-72247882",
    "timestamp": "2025-04-15T09:37:00Z"
  },
  {
    "title": "Are Trump's MAGA hats made in China? Viral video claims to reveal the irony behind his tariff war rhetoric",
    "description": "A Chinese factory has been making 'Make America Great Again' merchandise since 2016. This includes hats and banners. The factory produces thousands of banners daily. This revelation is ironic. It contrasts with Donald Trump's 'Buy American' calls. The product…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/are-donald-trumps-maga-hats-made-in-china-viral-video-claims-to-reveal-the-irony-behind-his-tariff-war-rhetoric/articleshow/120306632.cms",
    "timestamp": "2025-04-15T09:36:08Z"
  },
  {
    "title": "US moves ahead on tariffs with investigations into computer chips and pharmaceuticals",
    "description": "The Trump administration has taken its next steps toward imposing more tariffs on key imports, launching investigations into imports of computer chips and products that contain them, chip making equipment and pharmaceuticals.",
    "link": "https://www.clickondetroit.com/business/2025/04/15/us-moves-ahead-on-tariffs-with-investigations-into-computer-chips-and-pharmaceuticals/",
    "timestamp": "2025-04-15T09:35:35Z"
  },
  {
    "title": "Vance urges Europe not to be US ‘vassal’",
    "description": "US Vice President JD Vance hailed his country’s transatlantic alliances, striking a more positive note, but in an interview urged European states to show greater independence. “I love Europe … I love European people,” Vance told news and opinion website UnHer…",
    "link": "https://www.digitaljournal.com/world/vance-urges-europe-not-to-be-us-vassal/article",
    "timestamp": "2025-04-15T09:32:22Z"
  },
  {
    "title": "Xi’s Vietnam trip aiming to ‘screw’ US, says Trump",
    "description": "China’s President Xi Jinping urged Vietnam to join forces in upholding free trade, before wrapping up a visit to Hanoi on Tuesday which President Donald Trump said was aiming to “screw” the United States. Xi visited Vietnam as part of a Southeast Asia tour th…",
    "link": "https://www.digitaljournal.com/world/xis-vietnam-trip-aiming-to-screw-us-says-trump-2/article",
    "timestamp": "2025-04-15T09:32:22Z"
  },
  {
    "title": "Xi makes a case for free trade as he tours Southeast Asia",
    "description": "Xi Jinping is currently touring Southeast Asia, promoting China as a stable force for free trade amidst global economic uncertainty. He visited Vietnam, emphasizing cooperation and opposition to unilateral actions, and is now in Malaysia to discuss trade agre…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/xi-makes-a-case-for-free-trade-as-he-tours-southeast-asia/articleshow/120307236.cms",
    "timestamp": "2025-04-15T09:32:13Z"
  },
  {
    "title": "Trump grumbles about China’s ‘lovely meeting’ with Vietnam, saying they’re discussing how to ‘screw the United States of America’",
    "description": "Vietnam is Xi Jinping's first stop on a 3-nation Southeast Asia tour, as China and the U.S. escalate their trade war.",
    "link": "https://www.yahoo.com/news/trump-grumbles-china-lovely-meeting-093136137.html",
    "timestamp": "2025-04-15T09:31:36Z"
  },
  {
    "title": "Did US courts back Kilmar Abrego Garcia’s El Salvador deportation?",
    "description": "Trump, Bukele reject ruling to return the Salvadoran man who was mistakenly deported by the US.",
    "link": "https://www.aljazeera.com/news/2025/4/15/did-us-courts-back-kilmar-abrego-garcias-el-salvador-deportation",
    "timestamp": "2025-04-15T09:30:39Z"
  },
  {
    "title": "Unsealed Crossfire Hurricane Docs Further Prove Russiagate Was A Hoax All Along",
    "description": "America's intel agencies launched one of the greatest witch hunts in U.S. history to cripple Trump and undermine the will of the American people.",
    "link": "https://thefederalist.com/2025/04/15/unsealed-crossfire-hurricane-docs-further-prove-russiagate-was-a-hoax-all-along/",
    "timestamp": "2025-04-15T09:30:00Z"
  },
  {
    "title": "CASEY: A reader mailbag on Dan's adventures applying for Social Security",
    "description": "Recall Dan's recent experience for Social Security in-person at the agency's office in downtown Roanoke? Many readers weighed in on that, and urged your humble columnist to apply online. Then the agency suggested in writing it would be faster than waiting for…",
    "link": "https://roanoke.com/news/local/government-politics/article_b3d9f772-f6d5-43a7-ac3d-99329964e0f7.html",
    "timestamp": "2025-04-15T09:30:00Z"
  },
  {
    "title": "Why China Laughs at the Idea of Americans Taking Their Manufacturing Jobs",
    "description": "Chinese social media users have shared AI-generated videos portraying what some think it would look like for Americans to work in sweatshop-like factories.",
    "link": "https://time.com/7277920/china-manufacturing-us-trump-factory-workers-ai-videos-social-media/",
    "timestamp": "2025-04-15T09:30:00Z"
  },
  {
    "title": "Trump freezes over $2bn in Harvard funding over ‘incompliance’",
    "description": "The move comes after the university rejected the US administration’s request for policy changes Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615777-harvard-funding-freeze/",
    "timestamp": "2025-04-15T09:28:09Z"
  },
  {
    "title": "The Chinese e-commerce app the US can't get enough of right now",
    "description": "Chinese retailer DHgate, popular for selling dupes of brands like Birkenstock and YSL, became the number two free app on the US App Store on Tuesday.",
    "link": "https://www.businessinsider.com/chinese-ecommerce-app-dhgate-us-cant-get-enough-2025-4",
    "timestamp": "2025-04-15T09:27:48Z"
  },
  {
    "title": "Singapore Announces General Elections On May 3, Dissolves Parliament",
    "description": "Singapore has long been dominated by the PAP, which is expected to remain in power, but opposition gains are closely watched.",
    "link": "https://www.ndtv.com/world-news/singapore-announces-general-elections-on-may-3-dissolves-parliament-8168830",
    "timestamp": "2025-04-15T09:25:53Z"
  },
  {
    "title": "Russia jails soldier for voluntarily surrendering to Ukraine",
    "description": "The former soldier will serve 15 years and it is the first time Russia has prosecuted for the crime since it was introduced in September 2022.",
    "link": "https://www.abc.net.au/news/2025-04-15/russia-jails-soldier-for-surrending-to-ukraine/105180626",
    "timestamp": "2025-04-15T09:23:30Z"
  },
  {
    "title": "Trump blames Zelenskyy for Ukraine war in wake of Russian missile attack",
    "description": "The US president said the Ukrainian leader should share blame with Vladimir Putin for the war and the \"millions of people dead\".",
    "link": "https://www.abc.net.au/news/2025-04-15/trump-blames-zelenskyy-and-biden-for-ukraine-war/105180626",
    "timestamp": "2025-04-15T09:23:30Z"
  },
  {
    "title": "US-China Trade War Escalates, Beijing Suspends Boeing Jet Deliveries",
    "description": "China has told its airlines to stop taking deliveries of jets from American aviation giant Boeing, a report said Tuesday, as a trade war between Beijing and the United States deepens.",
    "link": "https://www.ndtv.com/world-news/us-china-trade-war-escalates-beijing-suspends-boeing-jet-deliveries-8168805",
    "timestamp": "2025-04-15T09:21:18Z"
  },
  {
    "title": "Tesla begins sales in Saudi Arabia",
    "description": "Charging stations to follow sales outlets in major cities.",
    "link": "https://www.just-auto.com/news/tesla-begins-sales-in-saudi-arabia/",
    "timestamp": "2025-04-15T09:21:08Z"
  },
  {
    "title": "Global markets rise along with US futures amid tariff uncertainty",
    "description": "Markets in Asia and Europe ticked higher on Tuesday, as U.S. futures signalled a potentially narrow rise amid uncertainty over President Donald Trump's tariff plan.",
    "link": "https://abcnews.go.com/Business/global-markets-rise-us-futures-amid-tariff-uncertainty/story?id=120816090",
    "timestamp": "2025-04-15T09:20:45Z"
  },
  {
    "title": "Why has the Trump administration frozen $2bn funding for Harvard University? All FAQs answered",
    "description": "The Harvard University has rejected President Donald Trump administration's demands to limit activism on campus. Following this, the administration froze over $2.3 billion in federal funding to Harvard University, citing non-compliance with demands to address…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/why-has-the-trump-administration-frozen-2bn-funding-for-harvard-university-all-faqs-answered/articleshow/120306588.cms",
    "timestamp": "2025-04-15T09:18:40Z"
  },
  {
    "title": "Who is Cody Allen Balmer? Suspect accused of arson attack on Gov. Shapiro's home",
    "description": "The suspect in the attack on Gov. Shapiro's house had problems in his home life as well as issues stemming from covering his home mortgage, according to court records",
    "link": "https://abcnews.go.com/US/cody-allen-balmer-suspect-accused-arson-attack-gov/story?id=120811181",
    "timestamp": "2025-04-15T09:15:54Z"
  },
  {
    "title": "Pentagon Accused Of Turning Blind Eye To Extremism In Ranks As Soldier Revealed To Be Neo-Nazi TikTok Follower",
    "description": "The Pentagon inspector general scrapped plans in February to investigate the military's training for countering extremism by groups like Proud Boys and Oath Keepers in the ranks",
    "link": "https://www.ibtimes.com/pentagon-accused-turning-blind-eye-extremism-ranks-soldier-revealed-neo-nazi-tiktok-follower-3770121",
    "timestamp": "2025-04-15T09:12:09Z"
  },
  {
    "title": "Stocks rise as stability returns, autos lifted by exemption hope",
    "description": "Equities mostly rose Tuesday as some stability returned to markets after last week’s rollercoaster ride. Donald Trump’s possible compromise over steep tariffs on the sector boosted auto firms. However, the US president’s unorthodox approach to trade diplomacy…",
    "link": "https://punchng.com/stocks-rise-as-stability-returns-autos-lifted-by-exemption-hope/",
    "timestamp": "2025-04-15T09:10:08Z"
  },
  {
    "title": "Global Oil Surplus to Persist in 2026 as Demand Sags, IEA Says",
    "description": "The International Energy Agency slashed forecasts for global oil demand this year amid the brewing trade war, and in its first detailed assessment of 2026 predicted a persistent supply surplus.",
    "link": "https://financialpost.com/pmn/business-pmn/global-oil-surplus-to-persist-in-2026-as-demand-sags-iea-says",
    "timestamp": "2025-04-15T09:09:11Z"
  },
  {
    "title": "In Toronto's suburbs, a rising Liberal tide threatens to sink Conservative boats",
    "description": "Some 30 federal ridings are up for grabs in the strategically significant region that mere months ago looked to be firmly in Pierre Poilievre's grasp — before Mark Carney's rise prompted a paradigm shift.",
    "link": "https://www.nationalobserver.com/2025/04/15/news/gta-liberal-tide-federal-election",
    "timestamp": "2025-04-15T09:09:03Z"
  },
  {
    "title": "Karmelo Anthony's Texas Bond Release Sparks MAGA Anger",
    "description": "Anthony was released on Monday after his bond was reduced to $250,000 by a judge.",
    "link": "https://www.newsweek.com/karmelo-anthonys-texas-bond-release-sparks-maga-anger-2059800",
    "timestamp": "2025-04-15T09:08:46Z"
  },
  {
    "title": "Lavrov Praises Trump's Russia Dealings as Vance, Zelensky Trade Barbs",
    "description": "Russia's top diplomat said the Trump Administration \"is trying to delve into the problem\" and \"understand the root cause\".",
    "link": "https://www.newsweek.com/lavrov-trump-russia-dealings-vance-zelensky-2059826",
    "timestamp": "2025-04-15T09:08:20Z"
  },
  {
    "title": "If US and Iran Clash, This Remote Base Could Be First To Fight",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs the United States and Iran navigate new opportunities for diplomacy, they do so against the backdrop of both nations having simultaneously escalated their respective military rhetoric, with President Donald…",
    "link": "https://biztoc.com/x/1d2e3f60f7b81d3f",
    "timestamp": "2025-04-15T09:08:19Z"
  },
  {
    "title": "Nvidia to build $500bn of US AI infrastructure as chip tariff looms",
    "description": "Plan comes after Donald Trump reiterated import threats and chipmaker’s CEO dined at US president’s resort\nThe chip designer Nvidia has said it will build $500bn (£378bn) worth of artificial intelligence infrastructure in the US over the next four years, in a…",
    "link": "https://biztoc.com/x/df2f69bfe06c57ab",
    "timestamp": "2025-04-15T09:07:22Z"
  },
  {
    "title": "Vance Urges Europe Not To Be US 'Vassal'",
    "description": "US Vice President JD Vance hailed his country's transatlantic alliances, striking a more positive note, but in an interview urged European states to show greater independence.",
    "link": "https://www.ibtimes.com/vance-urges-europe-not-us-vassal-3770119",
    "timestamp": "2025-04-15T09:06:08Z"
  },
  {
    "title": "Crypto Firm Bitdeer Prioritizes Mining to Weather Tariff Turmoil",
    "description": "Nasdaq-listed Bitcoin mining firm Bitdeer Technologies Group is doubling down on its self-mining operations while pushing ahead with plans to make machines in the US, as it confronts a cooling crypto market and mounting uncertainty over US trade policy.",
    "link": "https://financialpost.com/pmn/business-pmn/crypto-firm-bitdeer-prioritizes-mining-to-weather-tariff-turmoil",
    "timestamp": "2025-04-15T09:04:06Z"
  },
  {
    "title": "Alice Ekman on France24",
    "description": "Alice Ekman on France24\nfanny.pollet@i…\nTue, 04/15/2025 - 12:02\n\n\n Trade war, Taiwan: The Chinese empire strikes back. How far will it go in response to Donald Trump? Analysis by Alice Ekman for the programme \"Le Monde dans tous ses Etats.\"",
    "link": "https://www.iss.europa.eu/press/alice-ekman-france24-0",
    "timestamp": "2025-04-15T09:02:47Z"
  },
  {
    "title": "Saturday Night Live makes a rare ‘apology’ after making fun of actress Aimee Lou Wood’s teeth in parody",
    "description": "Saturday Night Live makes a rare ‘apology’ after making fun of actress Aimee Lou Wood’s teeth in parody7news.com.au",
    "link": "https://7news.com.au/sunrise/saturday-night-live-makes-a-rare-apology-after-making-fun-of-actress-aimee-lou-woods-teeth-in-parody-c-18380651",
    "timestamp": "2025-04-15T09:01:52Z"
  },
  {
    "title": "Russia’s Putin open to Ukraine peace deal: US envoy",
    "description": "Witkoff says talks with Putin 'compelling'; Lavrov warns agreeing terms 'not easy'; Trump blames Zelenskyy for war.",
    "link": "https://www.aljazeera.com/news/2025/4/15/us-envoy-witkoff-says-putin-open-to-permanent-peace-with-ukraine",
    "timestamp": "2025-04-15T09:01:19Z"
  },
  {
    "title": "MORNING GLORY: How the Senate and House finds two trillion dollars",
    "description": "The government needs to raise money to expand and extend the Trump 2017 tax cuts, and there's a way to do it without raising taxes on anyone.",
    "link": "https://www.foxnews.com/opinion/morning-glory-how-senate-house-finds-two-trillion-dollars",
    "timestamp": "2025-04-15T09:00:57Z"
  },
  {
    "title": "SEN ELIZABETH WARREN: Social Security is under attack. Gutting it is a broken promise",
    "description": "People are struggling with sky-high prices while their retirement savings are evaporating. We need a temporary increase in benefits right now to give people some relief.",
    "link": "https://www.foxnews.com/opinion/sen-elizabeth-warren-social-security-under-attack-gutting-broken-promise",
    "timestamp": "2025-04-15T09:00:47Z"
  },
  {
    "title": "U.S. deportation tracker: Counting arrests, detentions and border crossings",
    "description": "President Donald Trump came into office promising the largest mass deportation in U.S history, targeting the more than 10 million unauthorized migrants living in the United States.",
    "link": "https://www.nbcnews.com/data-graphics/us-immigration-tracker-follow-arrests-detentions-border-crossings-rcna189148",
    "timestamp": "2025-04-15T09:00:42Z"
  },
  {
    "title": "Trump's tariffs are putting the robots to work",
    "description": "Automation company Formic reports a surge in robot usage this year as Trump's tariffs disrupt global supply chains.",
    "link": "https://www.businessinsider.com/robots-boost-productivity-as-trumps-tariffs-disrupt-global-trade-2025-4",
    "timestamp": "2025-04-15T09:00:02Z"
  },
  {
    "title": "Dominance Does Not Equal Competence",
    "description": "Alexis Grenell\n\n\n\nAnd Democrats need to stop buying into that message—it’s how bullies like Trump and Cuomo elbow their way into power.\r\n\n\r\n\n\nThe post Dominance Does Not Equal Competence appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/cuomo-trump-dominance-competence/",
    "timestamp": "2025-04-15T09:00:01Z"
  },
  {
    "title": "Deportation Fears Add to Mental Health Problems Confronting Colorado Resort Town Workers",
    "description": "The Latino communities who make up significant proportions of year-round populations in Colorado’s mountain towns already experience heightened mental health concerns. Now, deportation fears are increasing their stress.",
    "link": "https://kffhealthnews.org/news/article/colorado-ski-resort-mountain-town-latino-hispanic-workers-deportation-nicaraguan/",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "Two Months After Trump’s Funding Cuts, a Nonprofit Struggles to Support Refugees and Itself",
    "description": "by Amy Yurkanin \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.\n\n \n\n \n\n \n \n\n\n\n \nWhen Max Rykov …",
    "link": "https://www.propublica.org/article/refugees-funding-cuts-nashville",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "The man accused in the attempted assassination of Donald Trump to appear in court",
    "description": "Ryan Routh, accused in the golf course attempted assassination of Donald Trump, will appear in a Florida federal courtroom Tuesday for a hearing involving evidence that will be presented in the case.",
    "link": "https://www.npr.org/2025/04/15/nx-s1-5360627/ryan-routh-trump-assassination-attempt-federal-court-hearing",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "Bless This Clinic: How Clergy Are Showing Up for Abortion Clinics",
    "description": "Rev. Katey Zeh, Asha Dahya\n\n\n\nClinic blessings continue a legacy of religious leaders and people of faith championing abortion access.\r\n\n\r\n\n\nThe post Bless This Clinic: How Clergy Are Showing Up for Abortion Clinics appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=551301",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "“Horrifying”: Trump’s Angry New Rants to Media Flout SCOTUS Openly",
    "description": "On Monday, Donald Trump met with El Salvador’s Nayib Bukele—and in an act of true infamy, the two authoritarian leaders collectively agreed that wrongfully deported Kilmar Abrego Garcia will not be returned to the United States. And in a series of angry rants…",
    "link": "https://newrepublic.com/article/193992/horrifying-trump-angry-new-threats-media-openly-flout-scotus",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "Trump admin pushing immigrants to self-deport as its deportation numbers lag",
    "description": "Figures obtained by NBC News show deportations in March below where they were a year ago, and far below what the administration wants",
    "link": "https://www.nbcnews.com/politics/national-security/trump-admin-pushing-immigrants-self-deport-deportation-numbers-lag-rcna201099",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "Meta faces 'one of the biggest antitrust cases' in decades. Here's what to watch",
    "description": "Meta’s (META) monopoly trial kicked off on Monday, throughout which the Federal Trade Commission will argue that the Facebook owner bought Instagram (in 2012) and WhatsApp (2014) to squash emerging competitive threats to Mark Zuckerberg’s social media empire.…",
    "link": "https://qz.com/meta-antitrust-trial-ftc-instagram-facebook-whatsapp-1851776093",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "If US and Iran Clash, This Remote Base Could Be First To Fight",
    "description": "\"It appears President Trump has underestimated Iran's military capabilities,\" an Iranian analyst told Newsweek.",
    "link": "https://www.newsweek.com/if-us-iran-clash-this-remote-base-could-first-fight-2059688",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "Your Favorite Sex Toy Brand Might Go Under",
    "description": "There’s still a 145 percent tariff on China, and sex toys aren’t part of the electronics exemption.",
    "link": "https://www.wired.com/story/your-favorite-sex-toy-brand-might-go-under/",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "Trump’s Great Big Fascist Gaslighting Show",
    "description": "Chris Lehmann\n\n\n\nTrump, his minions, and El Salvador’s president teamed up to tell a string of obscene lies about the innocent man they sent to a gulag.\r\n\n\r\n\n\nThe post Trump’s Great Big Fascist Gaslighting Show appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=551355",
    "timestamp": "2025-04-15T09:00:00Z"
  },
  {
    "title": "Irish students on J1 summer trips to US warned of activism ‘risk’ amid Trump crackdown on dissent",
    "description": "Irish students planning on travelling to the US this summer have been urged to be “cautious and informed about the potential risks involved in activism while on a J1 visa,” including the risk of deportation.",
    "link": "https://www.independent.ie/irish-news/irish-students-on-j1-summer-trips-to-us-warned-of-activism-risk-amid-trump-crackdown-on-dissent/a1898964722.html",
    "timestamp": "2025-04-15T08:59:51Z"
  }
]