[
  {
    "title": "Dem State Rep Urges People To Join ‘Rapid Response’ Network To Hinder ICE",
    "description": "Democratic State Representative Yara Zokaie of Colorado posted a video on social media Sunday urging viewers to support efforts to impede operations by ICE.",
    "link": "https://dailycaller.com/2026/01/26/colorado-state-rep-urges-citizens-to-join-anti-ice-activities/",
    "timestamp": "2026-01-26T15:37:23Z"
  },
  {
    "title": "Trump sends top official to Minneapolis after killing sparks backlash",
    "description": "Amid growing Minneapolis protests over fatal ICE shootings, President Trump sends a top official to the city as political and legal backlash intensifies.\n\nRead More: https://punchng.com/trump-sends-top-official-to-minneapolis-after-killing-sparks-backlash/",
    "link": "https://punchng.com/trump-sends-top-official-to-minneapolis-after-killing-sparks-backlash/",
    "timestamp": "2026-01-26T15:36:16Z"
  },
  {
    "title": "Government by AI? Trump Admin Plans to Write Regulations Using Artificial Intelligence",
    "description": "Cutting out the middle man?",
    "link": "https://gizmodo.com/government-by-ai-trump-admin-plans-to-write-regulations-using-artificial-intelligence-2000713978",
    "timestamp": "2026-01-26T15:35:21Z"
  },
  {
    "title": "Trump 'Defied The Will Of Congress' In Cutting EV Charger Funding: Judge",
    "description": "We're looking at yet another judge telling the Trump administration the limits of executive power and more.",
    "link": "https://www.jalopnik.com/2085034/trump-defied-congress-cutting-ev-charger-funding/",
    "timestamp": "2026-01-26T15:34:49Z"
  },
  {
    "title": "Editor Daily Rundown: Trump Puts Democrats On Notice Over Illegal Immigrants",
    "description": "BREAKING SUNDAY NIGHT ... TRUMP CALLS ON DEMOCRATS TO STOP 'STOK[ING] THE FLAMES OF DIVISION, CHAOS & VIOLENCE' ... DONALD TRUMP: During the four years of Crooked Joe Biden and Democrat failed leadership, Tens of Millions of Illegal Alien Criminals poured int…",
    "link": "https://dailycaller.com/2026/01/26/trump-democrats-illegal-immigrants-sanctuary-policies-tom-homan-minnesota/",
    "timestamp": "2026-01-26T15:33:57Z"
  },
  {
    "title": "Democrats could shut down the government by Friday by withholding funds for Homeland Security after ICE shootings",
    "description": "Hours after the Saturday shooting, Chuck Schumer said Democrats “will not provide the votes\" if DHS funding is included in the next spending bill.",
    "link": "https://fortune.com/2026/01/26/when-could-government-shutdown-happen-minnesota-shooting-chuck-schumer/",
    "timestamp": "2026-01-26T15:33:45Z"
  },
  {
    "title": "The Democrats’ Long-Awaited Spine",
    "description": "The latest ICE murder produces a unified Senate Democratic Caucus blocking funding for the Department of Homeland Security until strict and enforceable limits are set.\nThe post The Democrats’ Long-Awaited Spine appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/01/26/ice-trump-democrats-funding-department-homeland-security-alex-pretty-minnesota/",
    "timestamp": "2026-01-26T15:33:11Z"
  },
  {
    "title": "The Democrats’ Long-Awaited Spine",
    "description": "The latest ICE murder produces a unified Senate Democratic Caucus blocking funding for the Department of Homeland Security until strict and enforceable limits are set.\nThe post The Democrats’ Long-Awaited Spine appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/01/26/ice-trump-democrats-funding-department-homeland-security-alex-pretti-minnesota/",
    "timestamp": "2026-01-26T15:33:11Z"
  },
  {
    "title": "Reform says it would scrap Scottish tax bands and cut rates",
    "description": "The party's Scottish leader says funding would be taken from public bodies and environmental protection.",
    "link": "https://www.bbc.com/news/articles/c0er7ylrqv3o",
    "timestamp": "2026-01-26T15:29:31Z"
  },
  {
    "title": "Republican groundswell for ICE investigation grows after second killing of American citizen in Minnesota",
    "description": "Alex Pretti's killing comes at a sensitive moment for the GOP as the party prepares for a challenging midterm election year.",
    "link": "https://fortune.com/2026/01/26/republican-calls-for-ice-investigation-midterm-elections/",
    "timestamp": "2026-01-26T15:28:03Z"
  },
  {
    "title": "What One Year of Trump’s Second Term Has Cost Women, at Home and Worldwide",
    "description": "Trying to take stock of what’s happened in the year since Donald Trump took office for the second time is a daunting task—from the barrage of executive orders, to the appointment of unqualified Cabinet members, restructuring and elimination of federal agencie…",
    "link": "https://msmagazine.com/2026/01/26/trump-one-year-women-families/",
    "timestamp": "2026-01-26T15:25:57Z"
  },
  {
    "title": "All-new Renault Duster vs old Duster: Changes explained",
    "description": "Renault has unveiled the all-new Duster, marking its return to India's midsize SUV segment. The redesigned Duster boasts a sharper exterior, a modern, layered interior with a larger touchscreen and digital instrument cluster, and updated engine options includ…",
    "link": "https://timesofindia.indiatimes.com/auto/cars/all-new-renault-duster-vs-old-duster-changes-explained/articleshow/127557644.cms",
    "timestamp": "2026-01-26T15:23:55Z"
  },
  {
    "title": "Who is Tom Homan? Trump sends him to Minnesota to manage ICE following Alex Pretti killing",
    "description": "Tom Homan, a 30-year ICE veteran and former acting ICE director, is sent to Minnesota by Trump after Alex Pretti’s death. He will oversee immigration operations and report to Trump directly. Minnesota’s sanctuary policies upset him. DHS’ Operation Metro Surge…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-tom-homan-trump-sends-him-to-minnesota-to-manage-ice-following-alex-pretti-killing/articleshow/127557824.cms",
    "timestamp": "2026-01-26T15:22:14Z"
  },
  {
    "title": "The Logical End Point of Letting Trump Do Anything",
    "description": "Jonathan Chait: “On January 23, 2016, Donald Trump notoriously declared, ‘I could stand in the middle of Fifth Avenue and shoot somebody, and I wouldn’t lose any voters.’ That statement was understood at the time as a metaphorical expression of the depth of R…",
    "link": "https://politicalwire.com/2026/01/26/the-logical-end-point-of-letting-trump-do-anything/",
    "timestamp": "2026-01-26T15:21:38Z"
  },
  {
    "title": "Trump Deploys Border Czar to Minnesota Following Deadly Shooting",
    "description": "President Donald Trump is sending border czar Tom Homan to Minnesota two days after a Border Patrol agent shot and killed an anti-immigration enforcement protester.  Homan “has not been... Read More\nThe post Trump Deploys Border Czar to Minnesota Following De…",
    "link": "https://www.dailysignal.com/2026/01/26/trump-deploys-border-czar-to-minnesota-following-deadly-shooting/",
    "timestamp": "2026-01-26T15:20:34Z"
  },
  {
    "title": "Donald Trump begins 2026 with a blitz of white-collar pardons",
    "description": "Donald Trump has pardoned or reduced the sentences of 10 people since January 15, a dramatic escalation in the pace of pardons. Read here",
    "link": "https://financialpost.com/financial-times/donald-trump-white-collar-pardons",
    "timestamp": "2026-01-26T15:20:16Z"
  },
  {
    "title": "This Is the Perfect Moment for Democrats to Grow a Spine",
    "description": "Chris Lehmann\n\n\n\nAfter the murder of Alex Pretti by federal agents, the least national Democrats can do is dismantle ICE.\r\n\n\r\n\n\nThe post This Is the Perfect Moment for Democrats to Grow a Spine appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/democrats-immigration-policy-ice/",
    "timestamp": "2026-01-26T15:19:45Z"
  },
  {
    "title": "Trump knows who to blame for 2 American citizen deaths in Minnesota: ‘Democrat ensued chaos’",
    "description": "Trump refused to back away from his pledge to carry out the largest deportation program in history.",
    "link": "https://fortune.com/2026/01/26/trump-blames-democrat-ensued-chaos-minnesota-deaths-american-citizens/",
    "timestamp": "2026-01-26T15:19:37Z"
  },
  {
    "title": "Trump Sending Border Czar Tom Homan to Minnesota to Review ICE Operations",
    "description": "President Donald Trump is sending Border Czar Tom Homan to Minnesota amid ongoing Immigration and Customs Enforcement (ICE) operations which are being met by far-left demonstrations.\nThe post Trump Sending Border Czar Tom Homan to Minnesota to Review ICE Oper…",
    "link": "https://www.breitbart.com/politics/2026/01/26/trump-sending-border-czar-tom-homan-to-minnesota-to-review-ice-operations/",
    "timestamp": "2026-01-26T15:16:20Z"
  },
  {
    "title": "Rights group says Iran protest death toll nears 6,000",
    "description": "A US-based rights group has said it had confirmed the deaths of nearly 6,000 people during a wave of protests in Iran suppressed by security forces, as Tehran warned Washington against intervening.",
    "link": "https://www.rte.ie/news/world/2026/0126/1555169-iran-protests-toll/",
    "timestamp": "2026-01-26T15:14:48Z"
  },
  {
    "title": "Israel isn't leaving Gaza. It's rebranding its control of the Strip",
    "description": "President Trump's Board of Peace claims to be limiting Israel's role in Gaza. In reality, the second phase of the cease-fire is designed to transfer the burden of controlling Gaza from Israel to regional powers – all while keeping the instruments of dominance…",
    "link": "https://www.haaretz.com/opinion/2026-01-26/ty-article-opinion/.premium/israel-isnt-leaving-gaza-its-rebranding-its-control-of-the-strip/0000019b-f9df-dab4-abbb-fddf489a0000",
    "timestamp": "2026-01-26T15:14:26Z"
  },
  {
    "title": "Know Your Enemy: The Donroe Doctrine",
    "description": "Matt and Sam discuss Venezuela, Greenland, and the “Donroe Doctrine” with the Progressive International’s David Adler and Matt Kirkegaard.",
    "link": "https://dissentmagazine.org/blog/know-your-enemy-the-donroe-doctrine/",
    "timestamp": "2026-01-26T15:10:51Z"
  },
  {
    "title": "MAGA Is Proving How Little It Actually Cares About Gun Rights",
    "description": "Jeet Heer\n\n\n\nThe ability to kill dissidents at will is more important to Trump and his supporters than the Second Amendment.\r\n\n\r\n\n\nThe post MAGA Is Proving How Little It Actually Cares About Gun Rights appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/alex-pretti-gun-second-amendment-trump/",
    "timestamp": "2026-01-26T15:10:50Z"
  },
  {
    "title": "CNN’s Daniel Dale Goes After Trump Admin’s ‘Torrent of Incendiary Claims’ in Brutal Fact Check of Alex Pretti Shooting",
    "description": "CNN's Daniel Dale on Sunday published a lengthy takedown of the Trump's administrations numerous inaccurate claims about the killing of Alex Pretti.\nThe post CNN’s Daniel Dale Goes After Trump Admin’s ‘Torrent of Incendiary Claims’ in Brutal Fact Check of Ale…",
    "link": "https://www.mediaite.com/media/news/cnns-daniel-dale-goes-after-trump-admins-torrent-of-incendiary-claims-in-brutal-fact-check-of-alex-pretti-shooting/",
    "timestamp": "2026-01-26T15:10:46Z"
  },
  {
    "title": "Trump administration invests in another US rare earth miner to loosen China’s grip on supply",
    "description": "China processes more than 90% of the world’s critical minerals and has used its dominance in the market to gain leverage in the trade war with Washington.",
    "link": "https://www.bostonherald.com/2026/01/26/trump-administration-rare-earth-miner/",
    "timestamp": "2026-01-26T15:10:21Z"
  },
  {
    "title": "Social Security benefits are still taxed in some states. Why there's a push to change that",
    "description": "President Donald Trump has touted \"no tax on Social Security\" with the addition of a new senior deduction. Some states still apply levies to benefit income.",
    "link": "https://www.cnbc.com/2026/01/26/social-security-tax-rate-benefits.html",
    "timestamp": "2026-01-26T15:09:44Z"
  },
  {
    "title": "Lebanon’s Hezbollah chief says group concerned with confronting US threat against Iran",
    "description": "BEIRUT, Jan 26 (Reuters) - The leader of Lebanon’s Iran-aligned Hezbollah movement, Naim Qassem, said on Monday that his group was concerned about confronting Washington’… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/26/lebanon-s-hezbollah-chief-says-group-concerned-with-confronting-us-threat-against-iran",
    "timestamp": "2026-01-26T15:09:43Z"
  },
  {
    "title": "Trump says US used secret weapon to disable Venezuelan equipment in Maduro raid",
    "description": "President Trump says the U.S. used a secret weapon he called \"The Discombobulator\" to disable Venezuelan equipment when the U.S. captured Nicolás Maduro.",
    "link": "https://www.wtae.com/article/trump-venezuela-secret-weapon-discombobulator-maduro/70132298",
    "timestamp": "2026-01-26T15:09:14Z"
  },
  {
    "title": "Trump says US used secret weapon to disable Venezuelan equipment in Maduro raid",
    "description": "President Trump says the U.S. used a secret weapon he called \"The Discombobulator\" to disable Venezuelan equipment when the U.S. captured Nicolás Maduro.",
    "link": "https://www.wmur.com/article/trump-venezuela-secret-weapon-discombobulator-maduro/70132298",
    "timestamp": "2026-01-26T15:08:16Z"
  },
  {
    "title": "Trump says US used secret weapon to disable Venezuelan equipment in Maduro raid",
    "description": "President Trump says the U.S. used a secret weapon he called \"The Discombobulator\" to disable Venezuelan equipment when the U.S. captured Nicolás Maduro.",
    "link": "https://www.kcra.com/article/trump-venezuela-secret-weapon-discombobulator-maduro/70132298",
    "timestamp": "2026-01-26T15:08:04Z"
  },
  {
    "title": "Tim Walz Compares ICE’s Presence In Minnesota To Anne Frank Facing Nazi Occupation",
    "description": "Democratic Minnesota Gov. Tim Walz compared ICE's federal operations to the Nazi occupation during Anne Frank's time during a Sunday news conference.",
    "link": "https://dailycaller.com/2026/01/26/tim-walz-ice-operations-minnesota-anne-frank/",
    "timestamp": "2026-01-26T15:03:35Z"
  },
  {
    "title": "GOP Gov. Stitt Tells Trump to ‘Calm’ Politics by Letting States Import Migrants",
    "description": "President Donald Trump should “calm” the escalating Minneapolis battle over migration by allowing states to import a new sub-citizen category of cheap foreign workers for U.S. jobs, says Oklahoma Republican Gov. Kevin Stitt. “We have to stop politicizing this…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364029/posts",
    "timestamp": "2026-01-26T15:02:46Z"
  },
  {
    "title": "Europe financing 'war' against itself by buying Russian oil products from India: Scott Bessent",
    "description": "US Treasury Secretary Scott Bessent stated that Europe is financing the \"war\" against itself by purchasing refined Russian oil products from India, despite the US imposing 25% tariffs on India for buying Russian oil. He highlighted that Europeans recently sig…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/europe-financing-war-against-itself-by-buying-russian-oil-products-from-india-scott-bessent/articleshow/127558208.cms",
    "timestamp": "2026-01-26T15:02:29Z"
  },
  {
    "title": "Gold hits record $5,000 US an ounce as months-long rally continues amid global turmoil",
    "description": "Gold charged past $5,000 US an ounce for the first time on Monday — while silver jumped to $110 an ounce — as an array of geopolitical tensions pounded the U.S. dollar.",
    "link": "https://www.cbc.ca/news/business/gold-record-global-upheaval-markets-9.7060965",
    "timestamp": "2026-01-26T15:00:44Z"
  },
  {
    "title": "Gold Hits Record $5K While Bitcoin Struggles To Keep Pace",
    "description": "Gold shone brightly today, racing to a new high while crypto took the back seat, and the gap between the two assets opened wide. Related Reading: Money Keeps Leaving: Bitcoin ETFs Shed $1.72 Billion In Just 5 Sessions On Monday, the precious metal moved past …",
    "link": "http://www.newsbtc.com/news/bitcoin/gold-hits-record-5k-while-bitcoin-struggles-to-keep-pace/",
    "timestamp": "2026-01-26T15:00:41Z"
  },
  {
    "title": "Stephen Colbert to Win an Award for Yelling at His Boss",
    "description": "Stephen Colbert is living the dream: getting an award for how eloquently he yelled at his boss. He’ll receive the WGAE’s Walter Bernstein Award after calling out CBS, Paramount, Skydance, and Trump on ‘The Late Show.’",
    "link": "http://www.vulture.com/article/stephen-colbert-wgae-walter-bernstein-award.html",
    "timestamp": "2026-01-26T15:00:33Z"
  },
  {
    "title": "Peace Talks to Resume in Abu Dhabi as Ukraine War Grinds On",
    "description": "Ukraine, Russia, and the United States are set to resume negotiations in Abu Dhabi next week after two days of what officials described as “constructive” peace talks, even as the war shows no signs of easing. On January 23-24, \"the United States coordinated a…",
    "link": "https://oilprice.com/Geopolitics/Europe/Peace-Talks-to-Resume-in-Abu-Dhabi-as-Ukraine-War-Grinds-On.html",
    "timestamp": "2026-01-26T15:00:00Z"
  },
  {
    "title": "Trump gaffe sees him struggle to remember word Alzheimer's: 'What do they call it?'",
    "description": "During a recent interview\r\n with New York Magazine, President Donald Trump had “an unfortunately timed” memory lapse when struggling to remember the name of a disease perhaps best known for memory loss, The Daily Beast reported\r\n Monday.In the interview, Trum…",
    "link": "https://www.rawstory.com/trump-2675033567/",
    "timestamp": "2026-01-26T14:59:18Z"
  },
  {
    "title": "Here's How Trump Reacted to Alex Pretti's Shooting By an ICE Agent",
    "description": "Over the weekend, a 37-year-old ICU nurse named Alex Pretti was recorded on video with ICE Agents on top of him, restraining him, and then firing a weapon. He was killed. Now, Donald Trump is reacting to this horrific event. Keep reading to find out more… He …",
    "link": "https://www.justjared.com/2026/01/26/heres-how-trump-reacted-to-alex-prettis-shooting-by-an-ice-agent/",
    "timestamp": "2026-01-26T14:58:10Z"
  },
  {
    "title": "Israel says it recovered remains of final hostage in Gaza",
    "description": "The remains of the final hostage in Gaza have been recovered, Israel's military said Monday, clearing the way for the next phase of the ceasefire that paused the Israel-Hamas war.",
    "link": "https://www.cbc.ca/news/world/gaza-israel-remains-found-9.7060941",
    "timestamp": "2026-01-26T14:57:07Z"
  },
  {
    "title": "Post-Storm Freeze to Test US Power Grids as Demand Surges",
    "description": "US power grids are expected to grapple with unprecedented seasonal demand and the threat of blackouts after a damaging winter storm coated parts of the South and Mid-Atlantic in ice — leaving brutal cold in its wake. More than 800,000 …",
    "link": "https://www.insurancejournal.com/news/national/2026/01/26/855635.htm",
    "timestamp": "2026-01-26T14:55:45Z"
  },
  {
    "title": "AG Pam Bondi “Enraged” At No Charges For Don Lemon",
    "description": "A federal judge opted not to press charges against journalist and former CNN anchor Don Lemon in connection with a protest at a church in Minneapolis over the past weekend. The decision didn’t sit well with Attorney General Pam Bondi. “The Attorney General is…",
    "link": "https://hiphopwired.com/3013872/ag-pam-bondi-enraged-at-no-charges-for-don-lemon/",
    "timestamp": "2026-01-26T14:55:45Z"
  },
  {
    "title": "National Guard in Minnesota hands out coffee, donuts to anti-ICE protesters",
    "description": "Minnesota National Guard members handed out coffee and donuts to anti-ICE protesters in St. Paul, calling it a \"demonstration of safety and security.\"",
    "link": "https://www.foxnews.com/us/national-guard-minnesota-hands-out-coffee-donuts-anti-ice-protesters",
    "timestamp": "2026-01-26T14:53:51Z"
  },
  {
    "title": "‘Moral and Political Debacle’: The Wall Street Journal Nukes Trump Over Alex Pretti Shooting",
    "description": "The Wall Street Journal took the Trump administration to task in an editorial decrying both the death of Alex Pretti and the reaction to it on Sunday.\nThe post ‘Moral and Political Debacle’: The Wall Street Journal Nukes Trump Over Alex Pretti Shooting first …",
    "link": "https://www.mediaite.com/media/news/moral-and-political-debacle-the-wall-street-journal-nukes-trump-over-alex-pretti-shooting/",
    "timestamp": "2026-01-26T14:53:46Z"
  },
  {
    "title": "Funding deal begins to unravel as Senate Democrats vow to oppose DHS bill over Alex Pretti shooting in Minnesota",
    "description": "If senators fail to act by midnight Friday, funding for Homeland Security and the other agencies covered under the six bills will lapse.",
    "link": "https://www.pbs.org/newshour/politics/funding-deal-begins-to-unravel-as-senate-democrats-vow-to-oppose-dhs-bill-over-alex-pretti-shooting-in-minnesota",
    "timestamp": "2026-01-26T14:53:37Z"
  },
  {
    "title": "Federal and state officials offer starkly different messages on immigration crackdown after shooting",
    "description": "MINNEAPOLIS (AP) — In dueling news conferences, federal and state officials offered starkly different messages Sunday about the immigration crackdown that has swept across Minneapolis and surrounding cities, with both claiming the moral high ground after anot…",
    "link": "https://www.pbs.org/newshour/nation/federal-and-state-officials-offer-starkly-different-messages-on-immigration-crackdown-after-shooting",
    "timestamp": "2026-01-26T14:52:52Z"
  },
  {
    "title": "Third batch of Iranians deported by US to return home, Tasnim reports",
    "description": "DUBAI, Jan 26 (Reuters) - ‌A third group of Iranians deported from ‌the United States is returning home, ‌Iran's semi-official Tasnim news agency reported on Monday, amid heightened tension between Washington and Tehran following Iran's crackdown on ‍nationwi…",
    "link": "https://www.thestar.com.my/news/world/2026/01/26/third-batch-of-iranians-deported-by-us-to-return-home-tasnim-reports",
    "timestamp": "2026-01-26T14:52:00Z"
  },
  {
    "title": "France honors fallen soldiers in Afghanistan after Trump’s false claim about NATO troops",
    "description": "Ninety French soldiers died in the conflict.",
    "link": "https://www.bostonherald.com/2026/01/26/france-honors-fallen-soldiers-trump/",
    "timestamp": "2026-01-26T14:51:07Z"
  },
  {
    "title": "India, EU wrap up talks for landmark trade deal amid strained US ties",
    "description": "By Shivangi AcharyaJan 26 (Reuters) - India and the European Union have concluded negotiations on a long-coveted trade deal that will be announced on Tuesday, the South … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/26/india-eu-wrap-up-talks-for-landmark-trade-deal-amid-strained-us-ties",
    "timestamp": "2026-01-26T14:48:45Z"
  },
  {
    "title": "Why Donald Trump won't attend Super Bowl 60 featuring 'terrible' musical performers",
    "description": "A year after attending Super Bowl 59, president Donald Trump won't be on hand for Super Bowl 60. Here's why.",
    "link": "https://www.sportingnews.com/us/nfl/news/donald-trump-attend-super-bowl-60/7673bdcfeb666c40595e59f7",
    "timestamp": "2026-01-26T14:43:01Z"
  },
  {
    "title": "Top African health chief slams Trump plan for human experiments in Africa - NewsBreak",
    "description": "The clash between African health leaders and the Trump administration over a controversial vaccine study in Guinea-Bissau has quickly become a test of who",
    "link": "https://www.newsbreak.com/share/4459938919309-top-african-health-chief-slams-trump-plan-for-human-experiments-in-africa?s=a2&amp;share_destination_id=MzUxNzMwMDAyLTE3Njk0Mzg0ODg1NDg%3D&amp;pd=0Nnp2Y6h&amp;hl=en_US&amp;send_time=1769438488&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.3.2%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-26T14:41:54Z"
  },
  {
    "title": "Selected Articles: Greenland, Donald Trump, Technocracy and the Globalist New World Order",
    "description": "Greenland, Donald Trump, Technocracy and the Globalist New World Order\nBy David Skripac, January 26, 2026\nAs a pilot who frequently travelled to Greenland while serving in the Canadian Armed Forces, I can say with assurance that Greenland is …\nThe post Select…",
    "link": "https://www.globalresearch.ca/selected-articles-greenland-donald-trump-technocracy-globalist-new-world-order/5913547",
    "timestamp": "2026-01-26T14:41:35Z"
  },
  {
    "title": "Gustavo Petro: Colombia’s former rebel fighter turned president",
    "description": "From urban rebel to senator facing death threats, what drives Petro, 65, the country’s first progressive president?",
    "link": "https://www.aljazeera.com/features/2026/1/26/gustavo-petro-colombias-former-rebel-fighter-turned-president-2",
    "timestamp": "2026-01-26T14:41:12Z"
  },
  {
    "title": "King Charles ‘raised concerns’ to the White House over Trump’s NATO comments",
    "description": "Here are some photos of King Charles on Sunday, attending church at Sandringham alongside Camilla, Princess Anne and Tim Laurence. While Charles and Anne have always been close, it definitely feels like they’ve become each other’s best friends as they’ve gott…",
    "link": "https://www.celebitchy.com/958722/king_charles_raised_concerns_to_the_white_house_over_trumps_nato_comments/",
    "timestamp": "2026-01-26T14:40:46Z"
  },
  {
    "title": "Trump Escalates Feud With Canada, Threatens Full Tariff if China Deal Moves Forward",
    "description": "Trump threatens 100% tariffs on Canada over its China trade deal, escalating tensions with Prime Minister Carney.",
    "link": "https://www.ibtimes.com.au/trump-escalates-feud-canada-threatens-full-tariff-if-china-deal-moves-forward-1861223",
    "timestamp": "2026-01-26T14:38:10Z"
  },
  {
    "title": "Gold Beats Ethereum to $5K Milestone, Hitting Record Above $5,100",
    "description": "Gold smashed past $5,100 as Ethereum falters below $3,000—and prediction market users called it months ago.",
    "link": "https://decrypt.co/355824/gold-beats-ethereum-5k-milestone-record-above-5100",
    "timestamp": "2026-01-26T14:37:20Z"
  },
  {
    "title": "Airbus CEO Warns of New Geopolitical Risks After 'Significant' Trade Damage",
    "description": "Airbus CEO Guillaume Faury warns staff of rising geopolitical risks after trade tensions caused significant logistical and financial damage.",
    "link": "https://www.ibtimes.com.au/airbus-ceo-warns-new-geopolitical-risks-after-significant-trade-damage-1861221",
    "timestamp": "2026-01-26T14:37:11Z"
  },
  {
    "title": "Trump deploys Border Czar Tom Homan to Minnesota as ICE operations face violent chaos",
    "description": "President Donald Trump deployed Border Czar Tom Homan to Minnesota Monday amid widespread unrest in the Twin Cities.",
    "link": "https://www.foxnews.com/politics/trump-deploys-border-czar-tom-homan-minnesota-ice-operations-face-violent-chaos",
    "timestamp": "2026-01-26T14:36:25Z"
  },
  {
    "title": "It’s all lies",
    "description": "It’s hard to get going in the morning, because we’re all just swimming in lies. The administration lies non-stop — they’re repeating obvious lies over and over, despite the fact that we have multiple videos that allow us to see with our own eyes how false the…",
    "link": "https://freethoughtblogs.com/pharyngula/2026/01/26/its-all-lies/",
    "timestamp": "2026-01-26T14:34:32Z"
  },
  {
    "title": "Republican calls are growing for a deeper investigation into fatal Minneapolis shooting of Alex Pretti",
    "description": "Administration officials are firm in their defense of the hard-line immigration enforcement tactics in Minneapolis and they fault Democrats in the state along with local law enforcement for not working with them.",
    "link": "https://www.pbs.org/newshour/nation/republican-calls-are-growing-for-a-deeper-investigation-into-fatal-minneapolis-shooting-of-alex-pretti",
    "timestamp": "2026-01-26T14:34:13Z"
  },
  {
    "title": "Trump sends border czar to Minnesota as judge considers ruling ICE deployment there illegal",
    "description": "Tom Homan is unlikely to bring the temperature down.",
    "link": "https://www.thejournal.ie/trump-sends-border-czar-to-minnesota-as-judge-considers-ruling-ice-deployment-there-illegal-6938638-Jan2026/",
    "timestamp": "2026-01-26T14:33:17Z"
  },
  {
    "title": "Is Alex Pretti shooting a turning point for Trump?",
    "description": "Death of nurse at the hands of Ice officers could be ‘crucial’ moment for America",
    "link": "https://theweek.com/politics/alex-pretti-shooting-turning-point-donald-trump",
    "timestamp": "2026-01-26T14:32:39Z"
  },
  {
    "title": "NPR Claims Trump's ICE Is Detaining American Citizens: Turns Out Its Record Blows Obama's ICE Out of the Water",
    "description": "NPR Claims Trump's ICE Is Detaining American Citizens: Turns Out Its Record Blows Obama's ICE Out of the Waterwesternjournal.com",
    "link": "https://www.westernjournal.com/npr-claims-trumps-ice-detaining-american-citizens-turns-record-blows-obamas-ice-water/",
    "timestamp": "2026-01-26T14:31:42Z"
  },
  {
    "title": "Trump says Justice Department ‘looking at’ Ilhan Omar’s wealth",
    "description": "Donald Trump says he is sending his border czar Tom Homan to Minnesota amid protests against the killing of Alex Pretti.",
    "link": "https://www.aljazeera.com/news/2026/1/26/trump-says-justice-department-looking-at-ilhan-omars-wealth",
    "timestamp": "2026-01-26T14:30:03Z"
  },
  {
    "title": "‘Melania’ Doc Screens at White House After Alex Pretti Was Shot to Death by ICE in Minneapolis",
    "description": "Saturday night's attendees included President Donald Trump, Amazon CEO Andy Jassy, Tim Cook, Mike Tyson, Ellen von Unwerth and disgraced director Brett Ratner\nThe post ‘Melania’ Doc Screens at White House After Alex Pretti Was Shot to Death by ICE in Minneapo…",
    "link": "https://www.thewrap.com/media-platforms/politics/melania-trump-documentary-white-house-premiere-amazon/",
    "timestamp": "2026-01-26T14:29:23Z"
  },
  {
    "title": "Germany demands apology from Trump",
    "description": "German Defense Minister Boris Pistorius has urged US President Donald Trump to apologize for downplaying NATO allies’ role in Afghanistan Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631528-germany-trump-apology-afghanistan/",
    "timestamp": "2026-01-26T14:27:10Z"
  },
  {
    "title": "Trump’s Plan for Greenland: The Expected Economic Impact on the American Middle Class in the Coming Months",
    "description": "Greenland has been on the minds of many consumers in the United States over the past couple of weeks, particularly as President Donald Trump issued threats...",
    "link": "https://finance.yahoo.com/news/trump-plan-greenland-expected-economic-142651255.html",
    "timestamp": "2026-01-26T14:26:51Z"
  },
  {
    "title": "Trump's started tripping over simple words — and it signals 'severe problems': analysis",
    "description": "Donald Trump is showing new signs of cognitive decline, according to health experts who say closer analysis is needed.Speaking to Slate Magazine, Carolyn Aldwin, an aging researcher at Oregon State University, says there are fresh signs of decline from Trump …",
    "link": "https://www.rawstory.com/trump-health-2675024555/",
    "timestamp": "2026-01-26T14:26:33Z"
  },
  {
    "title": "Ireland among North Sea nations to sign wind power pledge to resist Russian energy 'blackmail'",
    "description": "The EU’s Commissioner for Energy and Housing said the agreement was a ‘very clear signal to Russia’.",
    "link": "https://www.thejournal.ie/ireland-north-sea-nations-wind-power-pledge-6938612-Jan2026/",
    "timestamp": "2026-01-26T14:24:10Z"
  },
  {
    "title": "Tinubu urges unity, religious tolerance for peace, security",
    "description": "President Bola Tinubu reiterates the importance of unity, religious tolerance, and peaceful coexistence as essential for Nigeria’s peace and development.\n\nRead More: https://punchng.com/tinubu-urges-unity-religious-tolerance-for-peace-security/",
    "link": "https://punchng.com/tinubu-urges-unity-religious-tolerance-for-peace-security/",
    "timestamp": "2026-01-26T14:23:30Z"
  },
  {
    "title": "Trump Appears to Bench Kristi Noem — Announces He’s Sending Border Czar Tom Homan to Minneapolis: He ‘Will Report Directly to Me’",
    "description": "President Donald Trump has announced he will send Tom Homan to Minneapolis, an apparent benching of DHS honcho Kristi Noem, who has reportedly been at odds with the border czar.\nThe post Trump Appears to Bench Kristi Noem — Announces He’s Sending Border Czar …",
    "link": "https://www.mediaite.com/media/news/trump-appears-to-bench-kristi-noem-announces-hes-sending-border-czar-tom-homan-to-minneapolis-he-will-report-directly-to-me/",
    "timestamp": "2026-01-26T14:22:45Z"
  },
  {
    "title": "“Public Relations War”: Pathological Lying Will Cost Donald Trump the Mid-Term Elections",
    "description": "Trump is losing the PR war. Lying has become the go to for every one of Trump’s hand picked influencers and war hawks in office. Lying is what will ultimately destroy the GOP in midterms.\n“The essence of lying is …\nThe post “Public Relations War”: Pathologica…",
    "link": "https://www.globalresearch.ca/pr-war-lying-cost-trump-midterms/5913495",
    "timestamp": "2026-01-26T14:21:03Z"
  },
  {
    "title": "Trump Just Lost the Minneapolis Narrative—and He Knows It",
    "description": "The Trump administration rushed to label Alex Pretti a terrorist. Video told a different story, and the Minneapolis narrative quickly unraveled.\nThe post Trump Just Lost the Minneapolis Narrative—and He Knows It first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trump-just-lost-the-minneapolis-narrative-and-he-knows-it/",
    "timestamp": "2026-01-26T14:19:31Z"
  },
  {
    "title": "Extreme Heat Disrupts Australia Day Festivities as Nation Faces Fire Risks",
    "description": "Australia's national day celebrations were overshadowed Monday by a severe heatwave sweeping across the country, prompting widespread warnings from meteorological and emergency services and forcing the cancellation of several public events.",
    "link": "https://www.ibtimes.com.au/extreme-heat-disrupts-australia-day-festivities-nation-faces-fire-risks-1861219",
    "timestamp": "2026-01-26T14:18:58Z"
  },
  {
    "title": "Lionsgate Names Former Donald Trump Treasury Secretary Steven Mnuchin To Board",
    "description": "Lionsgate Studios has appointed former United States Secretary of the Treasury Steven T. Mnuchin to its board effective immediately.   Mnuchin served as the 77th Treasury Secretary under Donald Trump from 2017 to 2021 during the president’s first term. He had…",
    "link": "http://deadline.com/2026/01/lionsgate-studios-appoints-steven-mnuchin-board-1236696725/",
    "timestamp": "2026-01-26T14:18:33Z"
  },
  {
    "title": "Kristen Stewart plans dramatic exit from US over Trump's America-first film industry policies",
    "description": "Kristen Stewart is eyeing a move out of the United States due to President Donald Trump. The \"Twilight\" actress revealed in an interview with The Times that she's cultivating her directorial career around being able to create films in Europe because she \"can'…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364025/posts",
    "timestamp": "2026-01-26T14:17:40Z"
  },
  {
    "title": "Greg Bovino: Who is the frontrunner of Trump’s deportation campaign with an SS-like coat and inspiration from Jack Nicholson",
    "description": "His \"turn and burn\" tactics, his justification for the deadly interventions of federal agents and his comfort even with children make the head of ICE the \"Trump man\" in his anti-immigration policy\nThe post Greg Bovino: Who is the frontrunner of Trump’s deport…",
    "link": "https://en.protothema.gr/2026/01/26/greg-bovino-who-is-the-frontrunner-of-trumps-deportation-campaign-with-an-ss-like-coat-and-inspiration-from-jack-nicholson/",
    "timestamp": "2026-01-26T14:17:03Z"
  },
  {
    "title": "France, Germany and Nordic countries back North Sea wind power at summit",
    "description": "Nine European nations including France, Germany, Denmark, Norway and the UK vowed on Monday to build up North Sea offshore wind power with the aim of boosting climate-friendly energy while reducing dependence on foreign powers.",
    "link": "https://www.thelocal.com/20260126/france-germany-and-nordic-countries-back-north-sea-wind-power-at-summit",
    "timestamp": "2026-01-26T14:16:09Z"
  },
  {
    "title": "Christians Beaten, Abducted in Nigeria as Church Service Attacked, Prayer Books Desecrated, and Worship Instruments Broken",
    "description": "Christians are still facing persecution in Nigeria, as 160 people are unaccounted for after an attack Sunday on a branch of the Cherubim and Seraphim Movement Church and two other churches in the village of Kurmin Wali.\nThe post Christians Beaten, Abducted in…",
    "link": "https://www.thegatewaypundit.com/2026/01/christians-beaten-abducted-nigeria-church-service-attacked-prayer/",
    "timestamp": "2026-01-26T14:15:27Z"
  },
  {
    "title": "‘Tough but fair’: Trump sends Tom Homan to Minnesota to ‘report directly’ to president",
    "description": "Commander in chief says welfare fraud 'is at least partially responsible for the violent organized protests going on in the streets'",
    "link": "https://www.wnd.com/2026/01/tough-fair-trump-sends-tom-homan-minnesota-report/",
    "timestamp": "2026-01-26T14:15:12Z"
  },
  {
    "title": "The Media Front: Murdochs Head West",
    "description": "In this edition: An exclusive look at the California Post, Tucker Carlson, Don Lemon, another ICE shooting, Jimmy Kimmel, the Washington Post, Substack, Business Insider and the power of video\nThe post The Media Front: Murdochs Head West appeared first on The…",
    "link": "https://www.thewrap.com/commentary-analysis/columns/the-media-front-murdochs-head-west/",
    "timestamp": "2026-01-26T14:15:00Z"
  },
  {
    "title": "Gold breaks new ground as safe-haven surge continues",
    "description": "Gold prices surged past $5,100 an ounce on Monday as the US dollar weakened amid Japan’s bond market turmoil Read Full Article at RT.com",
    "link": "https://www.rt.com/business/631535-gold-price-breaks-new-record/",
    "timestamp": "2026-01-26T14:14:50Z"
  },
  {
    "title": "Gavin Newsom Eviscerates 2 Republican Bigs In Surgical Posts About Minneapolis",
    "description": "The California governor described one of them as a “heartless fraud.”",
    "link": "https://www.huffpost.com/entry/gavin-newsom-jd-vance-tom-cotton-minneapolis_n_697757c4e4b00e79865d80cd",
    "timestamp": "2026-01-26T14:14:46Z"
  },
  {
    "title": "Stifling the “Spirit of Dialogue” at Davos",
    "description": "The World Economic Forum chose “A Spirit of Dialogue” as the theme for this year’s meeting in Davos. But, to secure US President Donald Trump’s participation, the organization agreed to avoid “woke” topics such as the energy transition, preventing any meaning…",
    "link": "https://www.project-syndicate.org/commentary/world-economic-forum-meeting-davos-appeases-trump-ignores-climate-change-by-hippolyte-fofack-2026-01",
    "timestamp": "2026-01-26T14:14:05Z"
  },
  {
    "title": "Sofocando el \"espíritu de diálogo\" en Davos",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/world-economic-forum-meeting-davos-appeases-trump-ignores-climate-change-by-hippolyte-fofack-2026-01/spanish",
    "timestamp": "2026-01-26T14:14:05Z"
  },
  {
    "title": "Trump 'reviewing everything' as Republicans demand probe into Minneapolis shooting",
    "description": "An American citizen, Alex Pretti, was shot by federal agents during a continuing Trump administration immigration crackdown in the city.",
    "link": "https://www.abc.net.au/news/2026-01-27/republicans-express-shock-over-minneapolis-shooting/106271792",
    "timestamp": "2026-01-26T14:11:52Z"
  },
  {
    "title": "Trump, 79, Makes Awkward Mental Gaffe While Bragging About His Brain",
    "description": "The president needed Karoline Leavitt’s help remembering a word associated with memory loss.",
    "link": "https://www.thedailybeast.com/trump-79-makes-awkward-mental-gaffe-while-bragging-about-his-brain/",
    "timestamp": "2026-01-26T14:08:56Z"
  },
  {
    "title": "Trump Doubling Down on Minneapolis Takeover After Alex Pretti Shooting",
    "description": "Donald Trump is doubling down in Minnesota following the murder of nurse Alex Pretti by Border Patrol agents on Saturday by sending his immigration czar to the state. In a Truth Social post Monday morning, Trump announced that he is sending Tom Homan to the s…",
    "link": "https://newrepublic.com/post/205662/trump-minneapolis-border-czar-alex-pretti-shooting",
    "timestamp": "2026-01-26T14:06:24Z"
  },
  {
    "title": "Forensic expert points out 'strange' moment from Alex Pretti shooting people may have missed",
    "description": "A forensic expert has pointed out a 'strange' moment from the build-up to Alex Pretti's fatal shooting in Minneapolis on Saturday",
    "link": "https://www.ladbible.com/news/us-news/alex-pretti-shooting-minneapolis-donald-trump-forensic-expert-738810-20260126",
    "timestamp": "2026-01-26T14:06:13Z"
  },
  {
    "title": "Ex-ESPN star urges social media followers to 'stand up to fascism'",
    "description": "Former ESPN NBA insider Adrian Wojnarowski urged his followers on Threads to \"stand up to fascism\" as outrage grew over a Border Patrol-involved shooting.",
    "link": "https://www.foxnews.com/sports/ex-espn-star-urges-social-media-followers-stand-up-fascism",
    "timestamp": "2026-01-26T14:05:32Z"
  },
  {
    "title": "Trump sends Tom Homan to Minnesota to manage ICE after Alex Pretti killing",
    "description": null,
    "link": "https://www.cnbc.com/2026/01/26/trump-tom-homan-minnesota-alex-pretti-ice.html",
    "timestamp": "2026-01-26T14:04:49Z"
  },
  {
    "title": "NY Post Calls on Trump to ‘De-Escalate’ in Minneapolis — and Pull Kristi Noem Off of TV — in Stunning Editorial",
    "description": "The New York Post called out the \"alacritous and misleading rhetoric\" coming from Trump's administration in the wake of Saturday's shooting in Minneapolis.\nThe post NY Post Calls on Trump to ‘De-Escalate’ in Minneapolis — and Pull Kristi Noem Off of TV — in S…",
    "link": "https://www.mediaite.com/media/news/ny-post-calls-on-trump-to-de-escalate-in-minneapolis-and-pull-kristi-noem-off-of-tv-in-stunning-editorial/",
    "timestamp": "2026-01-26T14:02:34Z"
  },
  {
    "title": "DHS Is Reviewing Body Cam Footage of Alex Pretti Shooting. If Only We Could Trust That Video.",
    "description": "Just days ago, the Trump administration used AI to doctor an image of a suspect. How can we trust body cam footage in their possession?",
    "link": "https://www.jezebel.com/alex-pretti-shooting-body-camera-footage-ice-border-patrol-dhs-investigation-real-trustworthy-manipulation-ai",
    "timestamp": "2026-01-26T14:01:27Z"
  }
]