[
  {
    "title": "Michelle Obama Sums Up Donald Trump's East Wing Demolition In 6 Words",
    "description": "The former first lady told podcaster Jamie Kern Lima that she felt the loss mostly for America because \"That’s the people’s house.”",
    "link": "https://www.huffpost.com/entry/michelle-obama-melancholy-over-trumps-east-wing-demolition_n_692627b8e4b0632853114751",
    "timestamp": "2025-11-25T23:41:09Z"
  },
  {
    "title": "Asia-Pacific markets set to track Wall Street gains on rising Fed rate-cut expectations",
    "description": "Overnight, the key U.S. indexes rose on growing hopes for a U.S. Federal Reserve rate cut next month.",
    "link": "https://www.cnbc.com/2025/11/26/asia-pacific-markets-live-nikkei-225-hang-seng-csi300-.html",
    "timestamp": "2025-11-25T23:39:50Z"
  },
  {
    "title": "Should Albanese ‘fight Tories’ harder? Or is blandness a safe bet in a fearful, populist world?",
    "description": "Sean Kelly’s Quarterly Essay asking what Labor stands for today focuses excessively on the prime minister, ignoring the wider party.",
    "link": "https://theconversation.com/should-albanese-fight-tories-harder-or-is-blandness-a-safe-bet-in-a-fearful-populist-world-270454",
    "timestamp": "2025-11-25T23:39:45Z"
  },
  {
    "title": "Report: Biden Admin Made Airports Less Safe Using Them to House Migrants",
    "description": "The Biden administration made airports less safe, using some of them to house migrants, a report released by the Senate Commerce Committee revealed.\nThe post Report: Biden Admin Made Airports Less Safe Using Them to House Migrants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/25/report-biden-admin-made-airports-less-safe-using-them-to-house-migrants/",
    "timestamp": "2025-11-25T23:36:08Z"
  },
  {
    "title": "Medicare announces price cuts for 15 prescription drugs, including Ozempic",
    "description": "The Centers for Medicare and Medicaid Services on Tuesday announced lower prices on 15 costly prescription drugs under Medicare, including Ozempic and Wegovy.",
    "link": "https://www.nbcnews.com/health/health-news/medicare-announces-price-cuts-15-prescription-drugs-ozempic-rcna240466",
    "timestamp": "2025-11-25T23:33:55Z"
  },
  {
    "title": "'It's just embarrassing': Analyst stunned as Trump undercuts JD Vance on global stage",
    "description": "Vice President JD Vance appears to be aggressively positioning himself as the heir apparent to the MAGA movement by taking an isolationist stance on Russia's war in Ukraine, a move that President Donald Trump keeps undermining, according to one analyst. The v…",
    "link": "https://www.rawstory.com/it-s-just-embarassing-analyst-stunned-as-trump-undercuts-jd-vance-on-world-s-stage/",
    "timestamp": "2025-11-25T23:33:43Z"
  },
  {
    "title": "Pressure mounts on Gov. Jared Polis to deny Tina Peters prison transfer request: ‘The silence is deafening.’",
    "description": "\"There was a lot of pressure coming from the (Trump) administration and from the right, and the governor was being silent on it,\" the clerks association director said. \"And the silence is deafening.\"",
    "link": "https://www.denverpost.com/2025/11/25/colorado-tina-peters-prison-jared-polis-federal-request/",
    "timestamp": "2025-11-25T23:30:38Z"
  },
  {
    "title": "Will 2025 be the year that MAGA broke apart?",
    "description": "What if Trump rode a wave of populist sentiment, painting himself as an upstart outsider to the political establishment, while covertly working to protect the political elites (and his friends) all along? What if conservatives’ wishful thinking was tied up in…",
    "link": "https://www.shtfplan.com/headline-news/will-2025-be-the-year-that-maga-broke-apart",
    "timestamp": "2025-11-25T23:30:23Z"
  },
  {
    "title": "EXCLUSIVE: How Donald Trump Could Be 'On Verge' of Confirming Existence of Aliens",
    "description": "Donald Trump may be on the verge of confirming the existence of aliens, according to a new report.",
    "link": "https://radaronline.com/p/donald-trump-confirming-alien-existence/",
    "timestamp": "2025-11-25T23:30:00Z"
  },
  {
    "title": "'I Saw It On Tape!' Bill Maher Stunned As Lara Trump Denies Trump Called Woman 'Piggy'",
    "description": "Bill Maher called out Lara Trump after she tried to deny that her father-in-law called a reporter \"piggy.\"\n\n\nDuring his Monday Club Random podcast, Maher told Lara Trump that some of President Donald Trump's rhetoric made it difficult for him to win over oppo…",
    "link": "https://crooksandliars.com/2025/11/i-saw-it-tape-bill-maher-stunned-lara",
    "timestamp": "2025-11-25T23:26:00Z"
  },
  {
    "title": "Trump Cancels Release Of Yet Another Key Economic Report",
    "description": "Donald J. Trump insists that the economy is booming, grocery prices and inflation are down, but everyday Americans are feeling the crunch of Trump's policies, which are driving up costs. Treasury Secretary Scott Bessent wasn't very reassuring when he said he’…",
    "link": "https://crooksandliars.com/2025/11/again-trump-cancels-release-yet-another",
    "timestamp": "2025-11-25T23:25:59Z"
  },
  {
    "title": "Report: Trump-MBS meeting turned tense over Israel normalization",
    "description": "Axios reports that Trump’s meeting with Saudi Crown Prince turned tense over Saudi-Israel normalization, leaving Trump disappointed.",
    "link": "https://www.israelnationalnews.com/news/418366",
    "timestamp": "2025-11-25T23:24:08Z"
  },
  {
    "title": "Democratic Rep. Eric Swalwell sues Trump official over mortgage fraud accusations",
    "description": "Rep. Eric Swalwell is suing Bill Pulte, the head of the Federal Housing Finance Agency, accusing him of abusing his position to “concoct fanciful allegations of mortgage fraud” against Swalwell, a prominent critic of President Donald Trump",
    "link": "https://www.nbcnews.com/politics/congress/eric-swalwell-sues-trump-official-bill-pulte-mortgage-fraud-allegation-rcna245970",
    "timestamp": "2025-11-25T23:23:42Z"
  },
  {
    "title": "Judge gives Justice Department a day to detail Ghislaine Maxwell trial materials to be released",
    "description": "A federal judge in Manhattan is demanding more information from the Justice Department as he weighs its request to unseal records from the sex trafficking...",
    "link": "https://www.yahoo.com/news/articles/judge-gives-justice-department-day-232321696.html",
    "timestamp": "2025-11-25T23:23:21Z"
  },
  {
    "title": "‘Politically motivated influence operation:’ Now FBI begins review of video from ‘Seditious Six’",
    "description": "Nation 'does not need political actors injecting doubt into an already clear chain of command'",
    "link": "https://www.wnd.com/2025/11/politically-motivated-influence-operation-now-fbi-begins-review/",
    "timestamp": "2025-11-25T23:23:17Z"
  },
  {
    "title": "BBC faces UK parliament heat over Trump 'scandal'",
    "description": "UK News: LONDON: The BBC's chairman acknowledged Monday that it was too slow in responding over a misleading edit of a speech by US President Donald Trump but .",
    "link": "https://timesofindia.indiatimes.com/world/uk/bbc-faces-uk-parliament-heat-over-trump-scandal/articleshow/125576687.cms",
    "timestamp": "2025-11-25T23:22:57Z"
  },
  {
    "title": "Trump Says 'Tremendous Progress’ Being Made to Resolve Ukraine War",
    "description": "President Donald Trump announced Tuesday that \"tremendous progress\" has been made in the past week on efforts to wind down the Russia-Ukraine war.\nThe post Trump Says ‘Tremendous Progress’ Being Made to Resolve Ukraine War appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/25/trump-says-tremendous-progress-being-made-to-resolve-ukraine-war/",
    "timestamp": "2025-11-25T23:21:54Z"
  },
  {
    "title": "Trump says envoy Witkoff to meet Putin in Moscow as Ukraine signals ‘understanding’ reached with US on peace plan",
    "description": "The 28-point peace plan proposal was presented to Kyiv by Washington last week, and the American and Ukrainian officials worked on it over the weekend during talks in Geneva.",
    "link": "https://indianexpress.com/article/world/trump-says-envoy-witkoff-meet-putin-in-moscow-ukraine-understanding-reached-peace-plan-10386316/",
    "timestamp": "2025-11-25T23:20:41Z"
  },
  {
    "title": "Ex-BBC board member criticised chair's handling of bias crisis in resignation letter",
    "description": "Shumeet Banerji resigned on Friday citing \"governance issues\" but the full reasons were not known until now.",
    "link": "https://www.bbc.com/news/articles/c5y9rz7eggko",
    "timestamp": "2025-11-25T23:20:09Z"
  },
  {
    "title": "Transcript: Trump Spiral Worsens as Push to Jail Foes Backfires Badly",
    "description": "The following is a lightly edited transcript of the November 25 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. This wee…",
    "link": "https://newrepublic.com/article/203683/transcript-trump-spiral-worsens-push-jail-foes-backfires-badly",
    "timestamp": "2025-11-25T23:19:47Z"
  },
  {
    "title": "Congressional Democrats Say They're Targets Of FBI Probe",
    "description": "Several Democratic members of Congress say they're the targets of an FBI probe following a controversial video they released last week urging military service personnel to be aware of their duty to refuse un-Constitutional and unlawful orders from…\n Permalink",
    "link": "https://www.tmz.com/2025/11/25/democrats-targets-fbi-probe/",
    "timestamp": "2025-11-25T23:17:26Z"
  },
  {
    "title": "Washington DC mayor Muriel Bowser won't seek re-election",
    "description": "The Democrat has led the US capital since 2015, most recently clashing with Trump over the deployment of the National Guard.",
    "link": "https://www.bbc.com/news/articles/cm28zp50dd9o",
    "timestamp": "2025-11-25T23:14:12Z"
  },
  {
    "title": "Medicare for All Backers Argue It's a Better Solution Than Whatever Trump Is Cooking Up",
    "description": "As President Donald Trump postpones unveiling his supposed plan to tackle soaring US healthcare costs—reportedly after pushback from congressional Republicans—Medicare for All advocates have renewed calls for shifting to a single-payer system.\"Republicans hav…",
    "link": "https://www.commondreams.org/news/medicare-for-all-act-2025",
    "timestamp": "2025-11-25T23:13:27Z"
  },
  {
    "title": "FBI seeks interviews with Dems",
    "description": "Democratic lawmakers who appeared in a social media video urging U.S. troops to defy \"illegal orders\" say the FBI has contacted them to begin scheduling interviews, signaling a possible inquiry into the matter.",
    "link": "https://www.bostonherald.com/2025/11/25/fbi-seeks-interviews-with-dems/",
    "timestamp": "2025-11-25T23:13:23Z"
  },
  {
    "title": "Can Canada wait out the trade war with the US?",
    "description": "Canada’s prime minister is weighing a trip to Washington after recently suggesting he is in no rush to reboot derailed trade talks.",
    "link": "https://www.bbc.com/news/articles/c17x025jj21o",
    "timestamp": "2025-11-25T23:12:22Z"
  },
  {
    "title": "After Visiting White House, Ronaldo Gets Suspension Cut By FIFA",
    "description": "About a week after visiting the White House, Cristiano Ronaldo had his FIFA suspension cut by two games. The Portuguese striker will be able to participate in three group stage mathes.",
    "link": "https://www.forbes.com/sites/michaellewis/2025/11/25/after-visiting-white-house-ronaldo-gets-suspension-cut-by-fifa/",
    "timestamp": "2025-11-25T23:11:03Z"
  },
  {
    "title": "Trump hopes to meet Putin and Zelenskyy 'soon' - but only if peace deal struck",
    "description": "A Ukrainian diplomat has warned major sticking points remain in the peace deal being thrashed out - primarily the prospect of territorial concessions. Meanwhile, Moscow has stressed that it will not allow any agreement to stray too far from its own objectives.",
    "link": "https://news.sky.com/story/trump-hopes-to-meet-putin-and-zelenskyy-soon-but-only-if-peace-deal-struck-13475500",
    "timestamp": "2025-11-25T23:10:00Z"
  },
  {
    "title": "Judge throws out Trump media group’s lawsuit against The Guardian",
    "description": "A judge on Monday dismissed a defamation lawsuit filed by Donald Trump’s media organization against The Guardian over reports on its ties to a Russian oligarch. \nThe president’s legal onslaught against the media – launched via personal lawsuits and through hi…",
    "link": "https://biztoc.com/x/b95fe8996ee762ae",
    "timestamp": "2025-11-25T23:07:29Z"
  },
  {
    "title": "Uncommon Knowledge: Thanksgiving 2025 Is Cheaper Than You Think",
    "description": "As two turkeys made the media rounds this week ahead of getting pardoned by President Donald Trump on Tuesday, Americans flocked to the stores to load up on Thanksgiving goodies—filled with anxiety over rising grocery costs and the overall state of the econom…",
    "link": "https://biztoc.com/x/9ec0daaa7bb10a0b",
    "timestamp": "2025-11-25T23:07:09Z"
  },
  {
    "title": "Health care plan circulated by the White House runs into familiar GOP divisions",
    "description": "Health care plan circulated by the White House runs into familiar GOP divisionstwincities.com",
    "link": "https://www.twincities.com/2025/11/25/congress-health-care-gop/",
    "timestamp": "2025-11-25T23:02:50Z"
  },
  {
    "title": "Activist Nicaraguan priest: The Ortega dictatorship ‘can’t take away our faith’",
    "description": "Father Nils de Jesús Hernández speaks out for Nicaragua from exile in the United States. / Credit: “EWTN Noticias”/Screenshot\n\nACI Prensa Staff, Nov 25, 2025 / 18:01 pm (CNA).\nNils de Jesús Hernández, 56, has lived in the United States for 36 years, far from …",
    "link": "https://www.catholicnewsagency.com/news/268089/activist-nicaraguan-priest-the-ortega-dictatorship-can-t-take-away-our-faith",
    "timestamp": "2025-11-25T23:01:00Z"
  },
  {
    "title": "How Immigration Enforcement Works Now",
    "description": "Scrambling to meet high deportation goals, DHS operations are becoming more indiscriminate and more grueling.",
    "link": "https://www.theatlantic.com/newsletters/2025/11/how-immigration-enforcement-works-ice-dhs/685068/",
    "timestamp": "2025-11-25T23:01:00Z"
  },
  {
    "title": "The Vanishing World of Inuit Polar-Bear Hunters",
    "description": "From the daily newsletter: our far-flung correspondent braves the ice.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-vanishing-world-of-inuit-polar-bear-hunters",
    "timestamp": "2025-11-25T23:00:00Z"
  },
  {
    "title": "Trump Reportedly Lobbies Paramount to Distribute ‘Rush Hour 4’: A Glimpse of the Studio’s Ellison-Led Future?",
    "description": "According to several outlets, the president has used his connections at the studio to breathe new life into disgraced director Brett Ratner's long-stalled sequel.",
    "link": "https://www.indiewire.com/news/breaking-news/rush-hour-4-paramount-1235162974/",
    "timestamp": "2025-11-25T23:00:00Z"
  },
  {
    "title": "Anwar coy on Cabinet reshuffle amid vacant key posts",
    "description": "NAIROBI: If there are plans to reshuffle the Cabinet, Datuk Seri Anwar Ibrahim is keeping that decision close to his chest. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/11/26/anwar-coy-on-cabinet-reshuffle-amid-vacant-key-posts",
    "timestamp": "2025-11-25T23:00:00Z"
  },
  {
    "title": "Trump Admin to Begin 'Comprehensive Review' of Every Refugee Admitted to US Under Biden",
    "description": "\"For four straight years, the Biden administration accelerated refugee admissions from terror and gang-prone countries.\"",
    "link": "https://www.westernjournal.com/trump-admin-begin-comprehensive-review-every-refugee-admitted-us-biden/",
    "timestamp": "2025-11-25T22:58:00Z"
  },
  {
    "title": "How Trump Brought Netanyahu to Heel",
    "description": "Across the region, he has made it harder for Israel to act militarily.",
    "link": "http://foreignpolicy.com/2025/11/25/trump-netanyahu-gaza-hamas-hezbollah-israel-qatar/",
    "timestamp": "2025-11-25T22:57:20Z"
  },
  {
    "title": "The US Navy is canceling its future frigates in a blow to its ambitions to grow the fleet",
    "description": "The Constellation-class frigate program has been weighed down by several delays and missteps over the years.",
    "link": "https://www.businessinsider.com/navy-cancels-future-constellation-class-frigates-raising-fleet-size-concerns-2025-11",
    "timestamp": "2025-11-25T22:55:58Z"
  },
  {
    "title": "FACT FOCUS: Trump gets it wrong claiming no murders in DC for the last six months",
    "description": "In addition to pardoning two North Carolina turkeys at the annual White House ceremony, President Donald Trump discussed his crime-fighting efforts in Washington, D.C., claiming that it’s been six months since the city has seen a murder",
    "link": "https://abcnews.go.com/Politics/wireStory/fact-focus-trump-gets-wrong-claiming-murders-dc-127878340",
    "timestamp": "2025-11-25T22:53:49Z"
  },
  {
    "title": "US judge orders Trump administration to provide bond hearings to detained migrants",
    "description": "By Daniel Wiessner -A federal judge on Tuesday ruled that President Donald Trump's administration cannot impose mandatory detention on thousands of migrants ...",
    "link": "https://www.yahoo.com/news/articles/us-judge-orders-trump-administration-225337838.html",
    "timestamp": "2025-11-25T22:53:37Z"
  },
  {
    "title": "Insurrection Chic—Democrats’ Dangerous New Fad",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Insurrection Chic—Democrats’ Dangerous New Fad appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/11/25/insurrection-chic-democrats-dangerous-new-fad/",
    "timestamp": "2025-11-25T22:52:57Z"
  },
  {
    "title": "‘Major Problem’: House Republican Rips Trump Administration’s ‘Secret Meetings’ With Russia",
    "description": "Brian Fitzpatrick warned Trump's administration he has a \"major problem\" after Steve Witkoff reportedly advised on how to \"pitch\" their Ukraine plans to Trump.\nThe post ‘Major Problem’: House Republican Rips Trump Administration’s ‘Secret Meetings’ With Russi…",
    "link": "https://www.mediaite.com/politics/major-problem-house-republican-rips-trump-administrations-secret-meetings-with-russia/",
    "timestamp": "2025-11-25T22:52:36Z"
  },
  {
    "title": "Rush Hour 4 Finally Gets the Official Update Fans Have Been Waiting On For Nearly 20 Years",
    "description": "The Rush Hour series ran strong through the 2000s on the unlikely pairing of comedic actor Chris Tucker (Friday) and martial arts movie superstar Jackie Chan (Drunken Master). The ‘East meets West’ appeal of Rush Hour made it an international hit, with the fi…",
    "link": "http://comicbook.com/movies/news/rush-hour-4-finally-gets-the-official-update-fans-have-been-waiting-on-for-nearly-20-years/",
    "timestamp": "2025-11-25T22:51:29Z"
  },
  {
    "title": "Health care plan circulated by the White House runs into familiar GOP divisions",
    "description": "The proposal has so far been met with a stony silence on Capitol Hill.",
    "link": "https://www.bostonherald.com/2025/11/25/congress-health-care-gop/",
    "timestamp": "2025-11-25T22:49:31Z"
  },
  {
    "title": "Nicolle Wallace shuts down key Trump claim about the economy",
    "description": "President Donald Trump's administration has continued to maintain that the economy during Trump's second term has been strong, even as prices for basic necessities continue to climb.During a Tuesday segment, MS NOW host Nicolle Wallace contrasted the words of…",
    "link": "https://www.rawstory.com/alternet-posts/nicolle-wallace-trump-economy/",
    "timestamp": "2025-11-25T22:47:08Z"
  },
  {
    "title": "Sorting out the Facts on Epstein Claims",
    "description": "The House voted nearly unanimously on Nov. 18 to force the Department of Justice to release “all unclassified records, documents, communications, and investigative materials” related to the investigation and prosecution of Jeffrey Epstein. In the days before …",
    "link": "https://www.factcheck.org/2025/11/sorting-out-the-facts-on-epstein-claims/",
    "timestamp": "2025-11-25T22:46:15Z"
  },
  {
    "title": "Zohran Mamdani and Donald Trump Prove That There Are Two Paths Toward Socialism",
    "description": "As fans of horseshoe theory point out, the political extremes might differ on details, but they have a lot in common.",
    "link": "https://reason.com/2025/11/26/zohran-mamdani-and-donald-trump-prove-that-there-are-two-paths-toward-socialism/",
    "timestamp": "2025-11-25T22:45:53Z"
  },
  {
    "title": "Swalwell claims Pulte abused power to target Trump critics",
    "description": "Representative Eric Swalwell, a California Democrat who has been a frequent critic of Donald Trump, filed a lawsuit on Tuesday claiming Federal Housing Finance Agency Director Bill Pulte abused his power to retaliate against one of the president’s political o…",
    "link": "https://biztoc.com/x/f907227e99ffacd8",
    "timestamp": "2025-11-25T22:45:03Z"
  },
  {
    "title": "Is Donald Trump Losing Republicans? What Polls Show",
    "description": "Trump's public break with Representative Marjorie Taylor Greene may not translate to losses with his base, according to polls.",
    "link": "https://biztoc.com/x/1b266f6a950c726b",
    "timestamp": "2025-11-25T22:44:42Z"
  },
  {
    "title": "White House calls MS NOW story about Trump considering firing Kash Patel 'completely made up'",
    "description": "White House Press Secretary Karoline Leavitt is forcefully pushing back against MS NOW's report that President Donald Trump was mulling the firing of FBI Director Kash Patel.",
    "link": "https://www.foxnews.com/media/white-house-calls-ms-now-story-trump-considering-firing-kash-patel-completely-made-up",
    "timestamp": "2025-11-25T22:44:26Z"
  },
  {
    "title": "Jack Smith’s Team Knew They Might Face Legal Challenges For Secretly Seeking Senators’ Phone Records",
    "description": "Special counsel Jack Smith's team pressed forward with secretly seeking phone records for members of Congress after learning of potential litigation risks.",
    "link": "https://dailycaller.com/2025/11/25/jack-smith-gop-phone-recorrds/",
    "timestamp": "2025-11-25T22:42:00Z"
  },
  {
    "title": "Top U.S. military officials will visit Caribbean leaders as Trump weighs next steps",
    "description": "Defense Secretary Pete Hegseth will travel to Santo Domingo, Dominican Republic, and meet Wednesday with the country’s top leaders, the Pentagon said Tuesday.",
    "link": "https://www.pbs.org/newshour/world/top-u-s-military-officials-will-visit-caribbean-leaders-as-trump-weighs-next-steps",
    "timestamp": "2025-11-25T22:40:38Z"
  },
  {
    "title": "White House responds to report claiming Trump is considering removing Kash Patel",
    "description": "As story broke, president was with FBI director in Oval Office, took photo with him to rebut allegation",
    "link": "https://www.wnd.com/2025/11/white-house-responds-report-claiming-trump-is-considering/",
    "timestamp": "2025-11-25T22:37:35Z"
  },
  {
    "title": "‘Just Staggering’: Trump Aide’s Leaked Phone Call With Putin Advisor Stuns Pundits",
    "description": "“This is a major problem. And one of the many reasons why these ridiculous side shows and secret meetings need to stop.\"\nThe post ‘Just Staggering’: Trump Aide’s Leaked Phone Call With Putin Advisor Stuns Pundits first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/just-staggering-trump-aides-leaked-phone-call-with-putin-advisor-stuns-pundits/",
    "timestamp": "2025-11-25T22:35:37Z"
  },
  {
    "title": "Sean Combs: The Reckoning sets December release on Netflix",
    "description": "Curtis \"50 Cent\" Jackson takes aim at Diddy in Sean Combs: The Reckoning, a four-part doc set for a December release on Netflix.\nThe post Sean Combs: The Reckoning sets December release on Netflix appeared first on JoBlo.",
    "link": "https://www.joblo.com/sean-combs-the-reckoning-release-netflix/",
    "timestamp": "2025-11-25T22:34:46Z"
  },
  {
    "title": "Is making ‘Rush Hour 4’ Trump’s latest executive order? Paramount looks to be onboard",
    "description": "Paramount is reportedly close to a deal to revive the long dormant “Rush Hour” franchise, as the request of President Donald Trump.",
    "link": "https://biztoc.com/x/14ff4230fc33043c",
    "timestamp": "2025-11-25T22:34:10Z"
  },
  {
    "title": "Swalwell’s lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "Rep. Eric Swalwell, who is running for governor of California, served as a House manager in President Donald Trump’s 2021 impeachment trial. His lawsuit claims Federal Housing Finance Agency Director Bill Pulte has played “an integral role in supporting Presi…",
    "link": "https://biztoc.com/x/693e425616600c37",
    "timestamp": "2025-11-25T22:34:02Z"
  },
  {
    "title": "Despite Trump's best efforts to reshore manufacturing, blue-collar employment is plunging for the first time since the pandemic with 59,000 lost jobs",
    "description": "Back in April, President Donald Trump touted his aggressive tariff policy as a catalyst for the reshoring of manufacturing jobs. Eight months later, reshoring progress is nowhere to be seen.\nThe jobs report from the Bureau of Labor Statistics released last we…",
    "link": "https://biztoc.com/x/52c4d7d83ca56903",
    "timestamp": "2025-11-25T22:33:54Z"
  },
  {
    "title": "Trump Comments on His Weight, Says He 'Wants to Lose a Few Pounds' but Not on Thanksgiving",
    "description": "Donald Trump just made another comment about his weight during this week's Turkey Pardon ceremony at the White House.",
    "link": "https://www.ibtimes.com/trump-comments-his-weight-says-he-wants-lose-few-pounds-not-thanksgiving-3791259",
    "timestamp": "2025-11-25T22:32:37Z"
  },
  {
    "title": "Ex-GOP Speaker Says He Wants Nancy Mace ‘To Get The Help She Needs’ In Blistering Takedown",
    "description": "Kevin McCarthy's comments came after Mace and seven other Republicans voted to boot him out as speaker of the House two years ago.",
    "link": "https://www.huffpost.com/entry/kevin-mccarthy-nancy-mace-mental-health-help_n_6925d6f0e4b05f521ddac40d",
    "timestamp": "2025-11-25T22:32:11Z"
  },
  {
    "title": "As Trump Admin Continues Its Immigration Crackdown, Migrants Report Financial Abuse by Attorneys",
    "description": "The high cost of legal representation, combined with the uncertainty created by shifting immigration rules under President Donald Trump, has led fewer migrants to seek help from attorneys.",
    "link": "https://www.ibtimes.com/trump-admin-continues-its-immigration-crackdown-migrants-report-financial-abuse-attorneys-3791262",
    "timestamp": "2025-11-25T22:31:42Z"
  },
  {
    "title": "Swalwell claims Pulte abused power to target Trump critics",
    "description": "The congressman thinks the FHFA director “abused his position” by searching the Fannie and Freddie databases to “concoct\" allegations of mortgage fraud.",
    "link": "https://fortune.com/2025/11/25/swalwell-sues-pulte-fhfa-fannie-freddie-databases-mortgage-fraud/",
    "timestamp": "2025-11-25T22:30:36Z"
  },
  {
    "title": "BBC chair admits broadcaster took too long to address Trump documentary editing scandal",
    "description": "BBC Chair Samir Shah admitted the broadcaster took too long to address the documentary that President Trump has called \"false, defamatory, disparaging and inflammatory.\"",
    "link": "https://www.foxnews.com/media/bbc-chair-admits-broadcaster-took-too-long-address-trump-documentary-editing-scandal",
    "timestamp": "2025-11-25T22:30:35Z"
  },
  {
    "title": "Trump to send top envoy to Russia in push to finalise Ukraine plan",
    "description": "US president sends Steve Witkoff to meet Vladimir Putin to iron out 'a few' differences over plan to end Ukraine war.",
    "link": "https://www.aljazeera.com/news/2025/11/25/trump-says-close-to-ukraine-deal-kyivs-allies-urge-pressure-on-moscow",
    "timestamp": "2025-11-25T22:29:44Z"
  },
  {
    "title": "Russia warns it may reject US-Ukraine peace plan if it fails to uphold Alaska summit 'understandings'",
    "description": "Russia is threatening to reject President Donald Trump's Ukraine peace plan unless \"key understandings\" from his Alaska summit with President Putin are upheld.",
    "link": "https://www.foxnews.com/world/russia-warns-may-reject-us-ukraine-peace-plan-fails-uphold-alaska-summit-understandings",
    "timestamp": "2025-11-25T22:29:10Z"
  },
  {
    "title": "Dartmouth professor grumbles over lack of young people protesting Trump",
    "description": "A Dartmouth government professor warned that youth absence from Trump protests signals the need for new opposition strategies beyond conventional demonstrations.",
    "link": "https://www.foxnews.com/media/dartmouth-professor-grumbles-lack-young-people-protesting-trump",
    "timestamp": "2025-11-25T22:26:54Z"
  },
  {
    "title": "Gemini 3’s Success Means Google Is Back, Baby",
    "description": "Plus: Beware of AI-generated slop recipes this Thanksgiving.",
    "link": "https://www.forbes.com/sites/the-prompt/2025/11/25/gemini-3s-success-means-google-is-back-baby/",
    "timestamp": "2025-11-25T22:24:54Z"
  },
  {
    "title": "Russia Likely To Reject US-Ukraine Peace Plan As War May Last Through Christmas",
    "description": "Russia is said to reject a new peace plan brokered by the US and Ukraine following the controversial 28-point proposal that would see Ukraine making a lot of concessions.",
    "link": "https://www.ibtimes.com/russia-likely-reject-us-ukraine-peace-plan-war-may-last-through-christmas-3791263",
    "timestamp": "2025-11-25T22:24:41Z"
  },
  {
    "title": "Swalwell’s lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "Rep. Eric Swalwell, who is running for governor of California, served as a House manager in President Donald Trump’s 2021 impeachment trial. His lawsuit claims Federal Housing Finance Agency Director Bill Pulte has played “an integral role in supporting Presi…",
    "link": "https://www.pbs.org/newshour/politics/swalwells-lawsuit-claims-trump-housing-official-abused-post-to-target-trump-critics",
    "timestamp": "2025-11-25T22:24:23Z"
  },
  {
    "title": "BBC Rebuked for Censoring Historian Who Called Trump ‘Most Openly Corrupt President in American History’",
    "description": "The BBC is being accused of bending to pressure from the White House once again after it removed a historian's claim that President Donald Trump was “the most openly corrupt president in American history” from one of its broadcasts.Rutger Bregman, a Dutch aut…",
    "link": "https://www.commondreams.org/news/bbc-censors-historian-trump-criticism",
    "timestamp": "2025-11-25T22:24:12Z"
  },
  {
    "title": "Marjorie Taylor Greene's resignation shocked some in Georgia who say she could've won without Trump",
    "description": "",
    "link": "https://biztoc.com/x/80d7404d1be0fea5",
    "timestamp": "2025-11-25T22:22:39Z"
  },
  {
    "title": "Top US military officials are visiting Caribbean leaders as Trump weighs next steps",
    "description": "Top U.S. military officials are meeting leaders of Caribbean nations this week as the Trump administration has escalated its firepower in the region as part of what it calls a campaign against drug trafficking",
    "link": "https://abcnews.go.com/US/wireStory/top-us-military-officials-visiting-caribbean-leaders-trump-127877197",
    "timestamp": "2025-11-25T22:21:58Z"
  },
  {
    "title": "Trump administration to retroactively vet refugees already resettled in US",
    "description": "Immigration rights advocates say the new policy aims to 'bully some of the most vulnerable' people in US society.",
    "link": "https://www.aljazeera.com/news/2025/11/25/trump-administration-to-retroactively-vet-refugees-already-resettled-in-us",
    "timestamp": "2025-11-25T22:21:27Z"
  },
  {
    "title": "The New Yorker's attempt to evoke pity for illegal alien is obliterated by devastating community note",
    "description": "Another attempt to garner sympathy for the plight of a deported illegal immigrant was undone by devastating information provided in a community note on X.The New Yorker report documented the deportation of Jamaican national Orville Etoria to a prison facility…",
    "link": "https://www.theblaze.com/news/new-yorker-illegal-community-note",
    "timestamp": "2025-11-25T22:20:00Z"
  },
  {
    "title": "Pope Leo headed to Turkey and Lebanon for 1st trip abroad as leader of Catholic Church",
    "description": "Pope Leo will embark on his first trip outside Italy as the leader of the Catholic Church on Thursday, traveling to Turkey and Lebanon, where he is expected to make appeals for peace in the region and urge unity among long-divided Christian churches.",
    "link": "https://www.cbc.ca/news/world/pope-leo-turkey-lebanon-9.6992165",
    "timestamp": "2025-11-25T22:15:44Z"
  },
  {
    "title": "Reality Star Savannah Chrisley Teases Run for Political Office",
    "description": "Reality star Savannah Chrisley could end up launching the next American political dynasty ... because she just talked to her dad, Todd, about the possibility of running for office on Tuesday's episode of the \"Unlocked With Savannah Chrisley\"…\n Permalink",
    "link": "https://www.tmz.com/2025/11/25/savannah-chrisley-teases-run-for-office/",
    "timestamp": "2025-11-25T22:15:22Z"
  },
  {
    "title": "Trump allies seek to slip a visa workaround past MAGA hardliners: report",
    "description": "President Donald Trump's allies are seeking to create a seasonal worker visa to get past MAGA followers' firm stance on removing migrants they think are taking jobs away from Americans, according to a new report. A Mar-a-Lago trade group is pushing to expand …",
    "link": "https://www.rawstory.com/donald-trump-2674342209/",
    "timestamp": "2025-11-25T22:15:15Z"
  },
  {
    "title": "RUSH HOUR 4 Officially Coming From Paramount And Warner Bros. After Reported Interest From Donald Trump",
    "description": "Following claims that Donald Trump was interested in a continuation of the Rush Hour franchise, a fourth installment in the series has now been confirmed.",
    "link": "https://comicbookmovie.com/action/rush-hour-4-officially-coming-from-paramount-and-warner-bros-after-reported-interest-from-donald-trump-a225130",
    "timestamp": "2025-11-25T22:15:00Z"
  },
  {
    "title": "Paramount To Distribute “Rush Hour 4”",
    "description": "Yesterday’s report that U.S. President Donald Trump wants Jackie Chan, Chris Tucker and filmmaker Brett Ratner to re-team for another “Rush Hour” movie appears to have been serious. Puck News reports that Paramount is closing in on a deal to distribute a four…",
    "link": "https://www.darkhorizons.com/paramount-to-distribute-rush-hour-4/",
    "timestamp": "2025-11-25T22:14:39Z"
  },
  {
    "title": "Witkoff advised Russia on how to pitch Ukraine plan to Trump",
    "description": "U.S. presidential envoy Steve Witkoff, fresh from the triumph of the Gaza peace deal, held a phone call last month with a senior Kremlin official to suggest they work together on a similar plan for Ukraine — and that Vladimir Putin should raise it with Donald…",
    "link": "https://biztoc.com/x/186ba1b41b95401c",
    "timestamp": "2025-11-25T22:11:12Z"
  },
  {
    "title": "Trump's 'losing streak' is a 'five alarm fire' for Republicans: ex-GOP analyst",
    "description": "President Donald Trump's sinking numbers are a flashing warning sign for Republican prospects in upcoming elections, former GOP strategist Rick Wilson wrote on his Substack on Tuesday.\"Right before Thanksgiving 2025, the supposedly unstoppable MAGA juggernaut…",
    "link": "https://www.rawstory.com/web-push-notification/trump-losing-2674342127/",
    "timestamp": "2025-11-25T22:09:49Z"
  },
  {
    "title": "Can the World Address Climate Change Without the US?",
    "description": "For many environmental advocates, the COP30 climate negotiations ended this weekend in disappointment. The annual United Nations conference, which brought together more than 190 countries in Belém, Brazil, concluded without any firm plans to phase out fossil …",
    "link": "https://www.motherjones.com/environment/2025/11/cop30-brazil-us-climate-warming-trump/",
    "timestamp": "2025-11-25T22:09:10Z"
  },
  {
    "title": "WATCH: Joy Reid pushes possibility JD Vance is ‘throwing his wife under the bus’ for ‘white queen’ Erika Kirk",
    "description": "'You not doing the right thing. You supposed to be a widow. You wearing leather pants! That's not widow-wear'",
    "link": "https://www.wnd.com/2025/11/watch-joy-reid-pushes-possibility-jd-vance-is/",
    "timestamp": "2025-11-25T22:06:46Z"
  },
  {
    "title": "‘Rush Hour 4’: Everything We Know So Far About the Cast, Release Date, Plot & More",
    "description": "'Rush Hour 4' is reportedly in the works at Paramount after Donald Trump allegedly requested it.",
    "link": "https://hollywoodlife.com/feature/rush-hour-4-cast-release-date-plot-5490201/",
    "timestamp": "2025-11-25T22:06:43Z"
  },
  {
    "title": "Trump’s pardon of top allies may inadvertently cover mass voter fraud: legal experts",
    "description": "Legal experts are warning that President Donald Trump may have unintentionally issued a sweeping pardon that could shield not only Rudy Giuliani and other top allies, but any U.S. citizen who committed voter fraud in 2020 – including people who cast multiple …",
    "link": "https://www.rawstory.com/trump-pardons-2020/",
    "timestamp": "2025-11-25T22:05:49Z"
  },
  {
    "title": "Witkoff advised Russia on how to pitch Ukraine plan to Trump",
    "description": "U.S. presidential envoy Steve Witkoff held a phone call last month with a senior Kremlin official to suggest they work together on a plan for Ukraine.",
    "link": "https://fortune.com/2025/11/25/ukraine-peace-plan-witkoff-call-with-russia-kremlin-official/",
    "timestamp": "2025-11-25T22:04:42Z"
  },
  {
    "title": "The Trump Administration Wants To Review Tens Of Thousands Of Refugees Who Entered Under Biden",
    "description": "It's an unprecedented move that could reopen the cases of many who sought U.S. protection.",
    "link": "https://www.huffpost.com/entry/trump-refugees-biden_n_6926204fe4b0774c10d509bc",
    "timestamp": "2025-11-25T22:02:49Z"
  },
  {
    "title": "Jair Bolsonaro begins 27-year prison sentence for Brazilian coup attempt",
    "description": "The far-right leader had been under house arrest since August and was taken to federal police headquarters Saturday after trying to break his ankle monitor.",
    "link": "https://www.pbs.org/newshour/world/jair-bolsonaro-begins-27-year-prison-sentence-for-brazilian-coup-attempt",
    "timestamp": "2025-11-25T22:01:40Z"
  },
  {
    "title": "Donald Trump says Ukraine peace plan is ‘fine-tuned’ and envoys being sent to Putin",
    "description": "US president Donald Trump said his plan to end the war in Ukraine has been “fine-tuned” and that he is sending envoy Steve Witkoff to meet Russian president Vladimir Putin and army secretary Dan Driscoll to meet Ukrainian officials.",
    "link": "https://www.independent.ie/world-news/donald-trump-says-ukraine-peace-plan-is-fine-tuned-and-envoys-being-sent-to-putin/a60835439.html",
    "timestamp": "2025-11-25T22:01:36Z"
  },
  {
    "title": "Maersk to Resume Suez Canal Shipping Operations ‘as Soon as Conditions Allow’",
    "description": "Shipping giant Maersk said on Tuesday that it was close to resuming shipping through the Suez Canal almost two years after terrorist attacks from the Iran-backed Houthi insurgents of Yemen forced many transport companies to avoid the route through the Red Sea…",
    "link": "https://www.breitbart.com/middle-east/2025/11/25/maersk-to-resume-suez-canal-shipping-operations-as-soon-as-conditions-allow/",
    "timestamp": "2025-11-25T22:01:14Z"
  },
  {
    "title": "Strike CEO forced out after JPMorgan raises ‘fraudulent activities’ concern",
    "description": "Senator Lummis warned the banking restriction could push digital asset industry overseas.",
    "link": "https://ambcrypto.com/strike-ceo-forced-out-after-jpmorgan-raises-fraudulent-activities-concern/",
    "timestamp": "2025-11-25T22:00:45Z"
  },
  {
    "title": "Trump library redo: Miami Dade College board to hold new meeting on land giveaway",
    "description": "Miami Dade College’s board of trustees is hitting the reset button on a land giveaway for Donald Trump’s planned $950 million presidential library and high-rise complex next to downtown Miami’s Freedom Tower, bowing to a legal challenge that accused the schoo…",
    "link": "https://therealdeal.com/miami/2025/11/25/miami-dade-college-board-to-hold-new-vote-on-trump-library/",
    "timestamp": "2025-11-25T22:00:00Z"
  },
  {
    "title": "Decoding the Trump-Xi Phone Call",
    "description": "The leaders talked trade, Taiwan, and—likely—Japan.",
    "link": "http://foreignpolicy.com/2025/11/25/trump-xi-china-united-states-call-diplomacy-japan-taiwan-takaichi/",
    "timestamp": "2025-11-25T21:55:48Z"
  },
  {
    "title": "Ukraine Agrees in Principle to Revised U.S. Peace Proposal",
    "description": "But major points of contention remain unresolved, including possible territorial concessions.",
    "link": "http://foreignpolicy.com/2025/11/25/ukraine-agrees-us-peace-deal-russia-talks-zelensky-putin-trump/",
    "timestamp": "2025-11-25T21:55:06Z"
  },
  {
    "title": "Kyiv Agrees in Principle to Revised U.S. Peace Plan",
    "description": "But major points of contention remain unresolved, including possible territorial concessions.",
    "link": "http://foreignpolicy.com/2025/11/25/ukraine-agrees-us-peace-deal-russia-talks/",
    "timestamp": "2025-11-25T21:55:00Z"
  },
  {
    "title": "Judge orders DOJ to expedite processing of records request about Epstein files",
    "description": "The Department of Justice ignored earlier Freedom of Information Act requests regarding their July decision not to release the Epstein files.",
    "link": "https://abcnews.go.com/US/judge-orders-expedited-processing-request-records-related-dojs/story?id=127872573",
    "timestamp": "2025-11-25T21:53:41Z"
  }
]