[
  {
    "title": "Final GOP bill kneecaps renewables and hydrogen but lifts nuclear and geothermal",
    "description": "Republican legislators Thursday passed a reconciliation act that, among other things, unwinds much of the Inflation Reduction Act (IRA). The bill, which passed 218-214 with two Republicans voting no, now awaits President Donald Trump’s signature. Trump is exp…",
    "link": "https://biztoc.com/x/e70c9d4461a407fc",
    "timestamp": "2025-07-04T03:35:33Z"
  },
  {
    "title": "Ukraine says Russia launched a massive overnight attack with 550 drones and missiles, as Trump says Putin won't stop the war. Follow live",
    "description": "Russia launched one of its largest attacks on Ukraine yet as US President Donald Trump says Vladimir Putin is not going to stop the war. Follow DW for more.",
    "link": "https://www.dw.com/en/ukraine-updates-russia-attacks-with-550-drones-missiles/live-73150663",
    "timestamp": "2025-07-04T03:33:00Z"
  },
  {
    "title": "Ukraine says Russia launched massive attack with 550 drones and missiles, as Trump says Putin won't stop the war. Follow live",
    "description": "Russia launched one of its largest attacks on Ukraine yet. US President Donlad Trump said Vladimir Putin would not stop the war. Follow DW for more.",
    "link": "https://www.dw.com/en/ukraine-says-russia-launched-massive-attack-with-550-drones-and-missiles-as-trump-says-putin-wont-stop-the-war-follow-live/live-73150663",
    "timestamp": "2025-07-04T03:33:00Z"
  },
  {
    "title": "Ukraine hit by major attack as Trump says Putin won't 'stop'",
    "description": "Russia attacked Ukraine with 550 drones and missiles, as US President Donald Trump said he was disappointed by his latest call with Vladimir Putin. Follow DW for more.",
    "link": "https://www.dw.com/en/ukraine-hit-by-major-attack-as-trump-says-putin-wont-stop/live-73150663",
    "timestamp": "2025-07-04T03:33:00Z"
  },
  {
    "title": "Ukraine updates: Kyiv targeted in major Russian drone attack",
    "description": "Russia launched new drone strikes on Kyiv, just as President Donald Trump criticized past US military aid to Ukraine. Follow DW for more. Russia attacked the capital of Ukraine with dozens of combat drones on Friday, according to authorities in Kyiv.\n\nThey se…",
    "link": "https://www.dw.com/en/ukraine-updates-kyiv-targeted-in-major-russian-drone-attack/live-73150663",
    "timestamp": "2025-07-04T03:33:00Z"
  },
  {
    "title": "Trump plans UFC fight at White House for US 250th anniversary celebrations",
    "description": "Investing.com-- U.S. President Donald Trump said on Thursday that he is planning to hold an Ultimate Fighting Championship event at the White House in 2026 as part of the celebrations for the 250th anniversary of the formation of the country.",
    "link": "https://sports.yahoo.com/article/trump-plans-ufc-fight-white-033258173.html",
    "timestamp": "2025-07-04T03:32:58Z"
  },
  {
    "title": "CNN panel laughs after GOP strategist fails to define communism",
    "description": "The panel on CNN's \"NewsNight with Abby Phillip\" erupted with laughter after GOP strategist Scott Jennings failed to define communism after claiming New York Democrat Zohran Mamdani is a member of the political party. Jennings' comments come at a time when th…",
    "link": "https://www.rawstory.com/zohran-mamdani-2672600111/",
    "timestamp": "2025-07-04T03:32:35Z"
  },
  {
    "title": "Donald Trump Reveals Plans to Host UFC Match at the White House",
    "description": "Donald Trump has announced a UFC match could very well be held on the grounds of the White House. The 79-year-old President of the United States was speaking at an event on Thursday night (July 3) at the Iowa State Fairgrounds in Des Moines, Iowa, when he rev…",
    "link": "https://www.justjared.com/2025/07/03/donald-trump-reveals-plans-to-host-ufc-match-at-the-white-house/",
    "timestamp": "2025-07-04T03:29:19Z"
  },
  {
    "title": "Trump Proposes UFC Fight On White House Grounds",
    "description": "For the first time in the country’s 250-year history, the White House could host a cage match, serving as the UFC‘s next venue. On Thursday, Donald Trump announced plans to host a mixed martial arts competition on the White House grounds as part of his year-l…",
    "link": "http://deadline.com/2025/07/trump-ufc-fight-white-house-grounds-1236449787/",
    "timestamp": "2025-07-04T03:28:07Z"
  },
  {
    "title": "Suzuki Is becoming a top japan importer with Made-in-India cars",
    "description": "The Japanese carmaker brought 4,780 vehicles into Japan last month, up a dramatic 230-fold from a year earlier, overtaking Germany’s Mercedes-Benz, according to data from the Japan Automobile Importers Association on Friday. Suzuki also clinched the top stop …",
    "link": "https://www.bloomberg.com/news/articles/2025-07-04/suzuki-is-becoming-a-top-japan-importer-with-made-in-india-cars",
    "timestamp": "2025-07-04T03:25:28Z"
  },
  {
    "title": "4 Ways Trump's 'Big Beautiful Bill' Could Impact Your Wallet",
    "description": "The \"Big Beautiful Bill\" is headed to President Donald Trump's desk.\n- It includes a repeal of student loan forgiveness and an increased child tax credit.\n- It also includes new \"Trump accounts\" and changes to Medicaid and SNAP.\nFrom taxes to student loan for…",
    "link": "https://biztoc.com/x/03e7302d24dce7e1",
    "timestamp": "2025-07-04T03:24:37Z"
  },
  {
    "title": "30 seconds of terror: Pakistan PM Shehbaz Sharif's aide reveals what happened after India fired deadly BrahMos",
    "description": "Rana Sanaullah, aide to Pakistan’s Prime Minister, has revealed Pakistan’s military faced only seconds to judge if India’s BrahMos missile in Operation Sindoor was nuclear-armed. The strike on Nur Khan airbase came after terrorists killed 26 tourists in Kashm…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/30-seconds-of-terror-pakistan-pm-shehbaz-sharif-aide-reveals-what-happened-after-india-fired-deadly-brahmos-deadly-during-operation-sindhoor/articleshow/122239453.cms",
    "timestamp": "2025-07-04T03:23:41Z"
  },
  {
    "title": "From India to EU, where do trade talks stand in the rush to avert higher US tariffs?",
    "description": "Trade talks are intensifying as the deadline nears for increased US tariffs. The European Union aims for a deal with Washington. Vietnam has a new trade pact, but uncertainties exist. Japan faces potential tariffs on rice and autos. India hopes to avoid tarif…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/from-india-to-eu-where-do-trade-talks-stand-in-the-rush-to-avert-higher-us-tariffs/articleshow/122239675.cms",
    "timestamp": "2025-07-04T03:16:21Z"
  },
  {
    "title": "Trump says he wants to stage a UFC fight at White House",
    "description": "President Trump said Thursday that he's thinking of staging a UFC match on the White House grounds celebrate 250 years of American independence.",
    "link": "https://www.nbcwashington.com/news/sports/trump-ufc-fight-white-house-independence/3950497/",
    "timestamp": "2025-07-04T03:14:05Z"
  },
  {
    "title": "New bill threatens insurance for thousands in WNY, Jordan Health prepares for challenges",
    "description": "Rochester, N.Y. (WHAM) — A local health care provider is looking toward the future following the passage of President Donald Trump's One Big Beautiful Bill Act.",
    "link": "https://13wham.com/news/local/new-bill-threatens-insurance-for-thousands-in-wny-jordan-health-prepares-for-challenges",
    "timestamp": "2025-07-04T03:11:23Z"
  },
  {
    "title": "‘Uh, stop calling’: Expert warns Putin launches missiles after Trump phones",
    "description": "A national security expert issued a stark warning Thursday night after President Donald Trump’s latest phone call with Russian President Vladimir Putin was followed by a massive Russian missile barrage over Kyiv.Appearing on CNN’s “The Source with Kaitlan Col…",
    "link": "https://www.rawstory.com/trump-putin-2672600105/",
    "timestamp": "2025-07-04T03:10:32Z"
  },
  {
    "title": "El Salvador president denies that Abrego Garcia was tortured in prison",
    "description": "WASHINGTON (Reuters) -El Salvador President Nayib Bukele on Thursday denied accusations that Kilmar Abrego Garcia, the migrant returned to the U.S. in early June after being wrongfully deported to his native El Salvador, was tortured in a Salvadoran prison. R…",
    "link": "https://www.thestar.com.my/news/world/2025/07/04/el-salvador-president-denies-that-abrego-garcia-was-tortured-in-prison",
    "timestamp": "2025-07-04T03:09:00Z"
  },
  {
    "title": "Trump says he plans to host UFC fight at the White House",
    "description": "President Donald Trump on Thursday said he plans to host a UFC fight on White House grounds as he kicked off a series of events meant to mark America’s 250th anniversary next year.",
    "link": "https://www.cnn.com/2025/07/03/politics/trump-ufc-fight-white-house",
    "timestamp": "2025-07-04T03:08:25Z"
  },
  {
    "title": "Trump floats UFC fight at White House for America 250 celebration",
    "description": "President Donald Trump floats a plan to celebrate 250 years of American independence with a UFC match at the White House, along with other events in the year leading up to July 4, 2026.",
    "link": "https://www.wcvb.com/article/trump-wants-ufc-fight-white-house-america-250/65294304",
    "timestamp": "2025-07-04T03:08:07Z"
  },
  {
    "title": "Vietnam tariff deal triggers SEA jitters for Taiwan's PCB supply chain",
    "description": "Less than a week ahead of the tariff truce deadline, US President Donald Trump announced that the Commerce Department had struck a deal with Vietnam. Under the agreement, Vietnamese exports to the US will be subject to tariffs of 20% to 40%, with the highest …",
    "link": "https://www.digitimes.com/news/a20250704PD214/asia-donald-trump-exports-production.html",
    "timestamp": "2025-07-04T03:05:38Z"
  },
  {
    "title": "Trump floats UFC fight at White House for America 250 celebration",
    "description": "President Donald Trump floats a plan to celebrate 250 years of American independence with a UFC match at the White House, along with other events in the year leading up to July 4, 2026.",
    "link": "https://www.koat.com/article/trump-wants-ufc-fight-white-house-america-250/65294304",
    "timestamp": "2025-07-04T03:05:28Z"
  },
  {
    "title": "Trump floats UFC fight at White House for America 250 celebration",
    "description": "President Donald Trump floats a plan to celebrate 250 years of American independence with a UFC match at the White House, along with other events in the year leading up to July 4, 2026.",
    "link": "https://www.koco.com/article/trump-wants-ufc-fight-white-house-america-250/65294304",
    "timestamp": "2025-07-04T03:05:28Z"
  },
  {
    "title": "Trump floats UFC fight at White House for America 250 celebration",
    "description": "President Donald Trump floats a plan to celebrate 250 years of American independence with a UFC match at the White House, along with other events in the year leading up to July 4, 2026.",
    "link": "https://www.kcra.com/article/trump-wants-ufc-fight-white-house-america-250/65294304",
    "timestamp": "2025-07-04T03:05:28Z"
  },
  {
    "title": "Trump floats UFC fight at White House for America 250 celebration",
    "description": "President Donald Trump floats a plan to celebrate 250 years of American independence with a UFC match at the White House, along with other events in the year leading up to July 4, 2026.",
    "link": "https://www.wgal.com/article/trump-wants-ufc-fight-white-house-america-250/65294304",
    "timestamp": "2025-07-04T03:05:28Z"
  },
  {
    "title": "Trump floats UFC fight at White House for America 250 celebration",
    "description": "President Donald Trump floats a plan to celebrate 250 years of American independence with a UFC match at the White House, along with other events in the year leading up to July 4, 2026.",
    "link": "https://www.wtae.com/article/trump-wants-ufc-fight-white-house-america-250/65294304",
    "timestamp": "2025-07-04T03:05:27Z"
  },
  {
    "title": "Ether gains 0.55% as strong US jobs data lifts S&P 500, Nasdaq to records",
    "description": "Ether (ETH) traded steadily around $2,584 (+0.55%) as risk assets rallied on strong US jobs data. US economy added 147,000 jobs in June (beating 110K forecast); S&P 500 and Nasdaq hit new record highs. US Congress passed President Trump’s $4.5 trillion ‘Big B…",
    "link": "https://coinjournal.net/news/ether-gains-0-55-as-strong-us-jobs-data-lifts-sp-500-nasdaq-to-records/",
    "timestamp": "2025-07-04T03:01:50Z"
  },
  {
    "title": "Netanyahu is dragging his feet on a Gaza cease-fire, prolonging the hostages' agony",
    "description": "As he inches his way to a deal, U.S. President Donald Trump has to maneuver between the guarantees Hamas is demanding and ed in Gaza and Netanyahu's constraints ■ The balance of power within Hamas has shifted and now the external leadership has the upper hand…",
    "link": "https://www.haaretz.com/israel-news/2025-07-04/ty-article/.premium/netanyahu-is-dragging-his-feet-on-a-gaza-cease-fire-prolonging-the-hostages-agony/00000197-d1b7-da1d-a5ff-f1b78fd20000",
    "timestamp": "2025-07-04T03:00:24Z"
  },
  {
    "title": "Stars, Stripes, And Subs! Trump Promises UFC Fights At White House For America 250 Celebration",
    "description": "US President Donald Trump is already hyping up next year’s America 250 celebration, which he claims will include UFC fighters competing on the White House lawn.",
    "link": "https://www.mmamania.com/2025/7/3/24461409/president-trump-promises-ufc-championship-fights-white-house-lawn-america-250-celebration-espn",
    "timestamp": "2025-07-04T03:00:00Z"
  },
  {
    "title": "European companies urge EU to delay AI rules",
    "description": "Dozens of Europe's biggest companies urged the EU to hit the pause button on its landmark AI rules on July 3, warning that going too fast could harm the bloc's ability to lead in the global AI race. Read full story",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/07/04/european-companies-urge-eu-to-delay-ai-rules",
    "timestamp": "2025-07-04T03:00:00Z"
  },
  {
    "title": "Trump's 'Big, Beautiful Bill' Could Come Back To Haunt GOP In 2026 Midterm Elections",
    "description": "Democrats view the Trump bill's cuts to Medicaid and food assistance as ready ammunition for their future campaign.",
    "link": "https://www.huffpost.com/entry/republicans-democrats-trump-big-beautiful-bill-2026-midterm-elections_n_68674134e4b0eb2c5aed0d96",
    "timestamp": "2025-07-04T02:58:52Z"
  },
  {
    "title": "Full 'Idiocracy': Trump's Bonkers Plan For White House Event Gets Panned By Critics",
    "description": "The president said up to 25,000 spectators would attend the event on the grounds of the White House.",
    "link": "https://www.huffpost.com/entry/trump-white-house-ufc-fight_n_68672ecae4b0da7d95b961cd",
    "timestamp": "2025-07-04T02:57:45Z"
  },
  {
    "title": "Trump mulls UFC fight on White House grounds",
    "description": "President Trump said Thursday that he's thinking of staging a UFC match on the White House grounds with upward of 20,000 spectators to celebrate 250 years of American independence.",
    "link": "https://www.espn.com/mma/ufc/story/_/id/45663941/president-trump-mulls-ufc-fight-white-house-grounds",
    "timestamp": "2025-07-04T02:53:13Z"
  },
  {
    "title": "As US Stocks Hit Records, Experts See The Dollar Falling Further",
    "description": "While the US stock market has fully recovered from a spring rout, the relentless drop in the dollar is prompting currency experts to warn of greater financial market turmoil ahead.",
    "link": "https://www.ibtimes.com/us-stocks-hit-records-experts-see-dollar-falling-further-3777633",
    "timestamp": "2025-07-04T02:51:17Z"
  },
  {
    "title": "Where Do Trade Talks Stand In The Rush To Avert Higher US Tariffs?",
    "description": "As a Wednesday deadline approaches for steeper US tariffs to hit dozens of economies ranging from the EU to India, trade negotiations with President Donald Trump's administration are coming down to the wire.",
    "link": "https://www.ibtimes.com/where-do-trade-talks-stand-rush-avert-higher-us-tariffs-3777630",
    "timestamp": "2025-07-04T02:51:16Z"
  },
  {
    "title": "Trump just won the fight to remake America in three big ways",
    "description": "Donald Trump's mega-bill blew up his bromance with his biggest billionaire backer and could end up costing him considerable political capital. But it also brings his MAGA priorities to life.",
    "link": "https://www.abc.net.au/news/2025-07-04/donald-trumps-big-beautiful-bill-will-remake-america/105494546",
    "timestamp": "2025-07-04T02:48:58Z"
  },
  {
    "title": "Suzuki is becoming a top Japan importer with made-in-India cars",
    "description": "Suzuki surpassed Mercedes-Benz as Japan's leading car importer in June, driven by the popularity of the Jimny Nomad and Fronx, both assembled in India. The Jimny Nomad's success led to a temporary halt in orders due to overwhelming demand. Honda also experien…",
    "link": "https://economictimes.indiatimes.com/news/international/business/suzuki-is-becoming-a-top-japan-importer-with-made-in-india-cars/articleshow/122239107.cms",
    "timestamp": "2025-07-04T02:48:52Z"
  },
  {
    "title": "Trump to host UFC fight at White House as part of America250 celebration",
    "description": "President Trump stunningly announced that there would be a UFC fight with up to 25,000 spectators at the White House within the next year to celebrate America’s upcoming 250th birthday. “Does anybody watch UFC? The great Dana White? We’re going to have a UFC …",
    "link": "https://freerepublic.com/focus/f-chat/4326811/posts",
    "timestamp": "2025-07-04T02:43:39Z"
  },
  {
    "title": "Trump: \"This Whole Two Weeks Has Been Incredible, Hasn't It?\"",
    "description": "President Donald Trump held a rally in Des Moines, Iowa, on Thursday to celebrate the passage of the \"Big, Beautiful Bill.\" Trump plans to hold an Independence Day signing ceremony with F-22s and B-2 bombers flying overhead.\r\n\r\nPRESIDENT DONALD TRUMP: A lot o…",
    "link": "https://www.realclearpolitics.com/video/2025/07/03/trump_this_whole_two_weeks_has_been_incredible_hasnt_it.html",
    "timestamp": "2025-07-04T02:41:52Z"
  },
  {
    "title": "Trump's Vietnam tariff deal eases some market uncertainty, but 40% transshipment clause raises new risks",
    "description": "President Donald Trump announced that the US has reached a new tariff agreement with Vietnam, lowering tariffs on Vietnamese exports to the US from a previously reciprocal rate of 46% to 20%. While the tech and electronics industries generally welcomed the an…",
    "link": "https://www.digitimes.com/news/a20250704PD210/vietnam-tariffs-electronics-exports-manufacturing-usa.html",
    "timestamp": "2025-07-04T02:41:49Z"
  },
  {
    "title": "Trump May Start Telling Nations New Tariff Rates On Friday",
    "description": "US President Donald Trump said that his administration may begin sending out letters to trading partners as soon as Friday setting unilateral tariff rates ahead of a July 9 deadline for negotiations. “We’re probably going to be sending some letters out, start…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-may-start-telling-nations-new-tariff-rates-on-friday",
    "timestamp": "2025-07-04T02:40:06Z"
  },
  {
    "title": "Trump Administration Cuts Funding For Black Infant Health Research, Labeling It A DEI Initiative - NewsBreak",
    "description": "A study exploring why Black babies in Detroit are disproportionately born prematurely has been abruptly terminated by the NIH.",
    "link": "https://www.newsbreak.com/share/4087820406608-trump-administration-cuts-funding-for-black-infant-health-research-labeling-it-a-dei-initiative?s=a2&amp;share_destination_id=NTY3MjQ2NDUtMTc1MTU5NjQ1OTk1Ng%3D%3D&amp;pd=03q0fdBq&amp;hl=en_US&amp;send_time=1751596459&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v4%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_blend_exp_25q2-v8",
    "timestamp": "2025-07-04T02:34:52Z"
  },
  {
    "title": "Live: Hamas seeks ceasefire guarantees as Israel intensifies Gaza attacks",
    "description": "US President Donald Trump to host Israeli Prime Minister Benjamin Netanyahu next week to push for ceasefire.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/7/4/live-hamas-seeks-ceasefire-guarantees-as-israel-intensifies-gaza-attacks",
    "timestamp": "2025-07-04T02:29:37Z"
  },
  {
    "title": "Lifting of sanctions on Syria implemented in Norwegian Law",
    "description": "Norway has today implemented legal acts to lift sanctions against Syria. Sanctions targeting key individuals in former President Bashar al-Assad's regime will remain in place.",
    "link": "https://www.globalsecurity.org/wmd/library/news/syria/2025/syria-250703-govno01.htm",
    "timestamp": "2025-07-04T02:27:57Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Makes Our National Parks Great Again (The White House)",
    "description": "The White House:\nFact Sheet: President Donald J. Trump Makes Our National Parks Great Again  —  PUTTING AMERICANS FIRST: Today, President Donald J. Trump signed an Executive Order investing in our national treasures by increasing fees for foreign tourists vis…",
    "link": "https://www.memeorandum.com/250703/p140",
    "timestamp": "2025-07-04T02:25:03Z"
  },
  {
    "title": "Donald Trump Autographs Woman's Tank Top During Campaign Trip In Iowa (video only)",
    "description": "Liberal heads and their talking heads in the media are going to explode but how many President's go to a local bar and hang with the people?? This is fantastic!!!",
    "link": "https://freerepublic.com/focus/f-news/4326808/posts",
    "timestamp": "2025-07-04T02:24:18Z"
  },
  {
    "title": "(Poll results) What MAGA means to Americans",
    "description": "A decade ago, Donald Trump descended the golden escalator at Trump Tower in New York City and ignited a political movement that has reshaped American politics. In a memorable turn of phrase, Trump promised supporters of his 2016 presidential campaign that “we…",
    "link": "https://freerepublic.com/focus/f-news/4326806/posts",
    "timestamp": "2025-07-04T02:22:06Z"
  },
  {
    "title": "Trump Takes Lie-Packed Victory Lap On Bill Slashing Medicaid, Food Stamps",
    "description": "Cuts to those programs by his ‘big, beautiful bill’ break campaign promises not to touch them, which many of his followers rely on.",
    "link": "https://www.huffpost.com/entry/trump-tax-cut-lies_n_68673609e4b079fbbcb3c552",
    "timestamp": "2025-07-04T02:22:04Z"
  },
  {
    "title": "Trump wants to celebrate 250 years of independence with UFC fight at White House",
    "description": "President Trump is considering hosting a UFC match on the White House grounds as part of the celebrations for America's 250th birthday in 2026. He envisions a large-scale event with 20,000 to 25,000 spectators. The proposal includes a full fight and is part o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-wants-to-celebrate-250-years-of-independence-with-ufc-fight-at-white-house/articleshow/122238889.cms",
    "timestamp": "2025-07-04T02:21:19Z"
  },
  {
    "title": "World's biggest climate fund ramps up investment plans",
    "description": "LONDON (Reuters) -The world's biggest multilateral climate fund said it will make its largest ever series of investments and speed up dealmaking as it looks ...",
    "link": "https://www.yahoo.com/news/worlds-biggest-climate-fund-ramps-022027748.html",
    "timestamp": "2025-07-04T02:20:27Z"
  },
  {
    "title": "Trump may start telling nations new tariff rates on Friday",
    "description": "President Trump indicated his administration might issue letters to trading partners, outlining unilateral tariff rates before the July 9 deadline. Deals with the UK and Vietnam have been announced, alongside a truce with China involving eased tariffs. While …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-may-start-telling-nations-new-tariff-rates-on-friday/articleshow/122238849.cms",
    "timestamp": "2025-07-04T02:19:57Z"
  },
  {
    "title": "New US-Vietnam tariff pact prompts display makers to double down in Vietnam",
    "description": "On July 2, 2025, US President Donald Trump announced a tariff agreement with Vietnam. This agreement marks the first trade deal between the Trump administration and an Asian country, excluding China, signaling a shift in US trade policy in the region.",
    "link": "https://www.digitimes.com/news/a20250704PD207/donald-trump-display-production-policy-qisda.html",
    "timestamp": "2025-07-04T02:18:23Z"
  },
  {
    "title": "Trump Rails Against 'Shylocks And Bad People' In Iowa Speech (Hunter Walker/Talking Points Memo)",
    "description": "Hunter Walker / Talking Points Memo:\nTrump Rails Against ‘Shylocks And Bad People’ In Iowa Speech  —  President Donald Trump employed a term often used as a slur against Jewish people as he blasted bankers during a speech in Iowa on Thursday evening.  The rem…",
    "link": "https://www.memeorandum.com/250703/p137",
    "timestamp": "2025-07-04T02:15:00Z"
  },
  {
    "title": "For retailers, US-Vietnam trade deal leaves questions - Reuters",
    "description": "For retailers, US-Vietnam trade deal leaves questionsReuters Trump got another trade deal. This one could cost youCNN US Trade Deal Leaves Vietnam With Questions and One Big ChallengeBloomberg.com How to strike a trade deal with Donald TrumpThe Economist What…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178275620",
    "timestamp": "2025-07-04T02:14:35Z"
  },
  {
    "title": "President Trump Announces UFC Fight Will Take Place At White House",
    "description": "We might be getting a UFC event at the White House. On Thursday, Donald Trump held a rally in Iowa and revealed some special plans for America’s 250-year celebration next year on July 4th. According to Trump, he’s working with UFC CEO Dana White to hold a UFC…",
    "link": "https://brobible.com/sports/article/donald-trump-announces-ufc-fight-will-take-place-at-white-house/",
    "timestamp": "2025-07-04T02:12:11Z"
  },
  {
    "title": "Trump says UFC fight will take place on White House grounds",
    "description": "Trump reveals plans for a UFC championship fight at the White House during America's 250th birthday, continuing his close relationship with Dana White.",
    "link": "https://www.foxnews.com/sports/trump-announces-ufc-fight-take-place-white-house-grounds",
    "timestamp": "2025-07-04T02:11:08Z"
  },
  {
    "title": "‘Absolutely wild’: Internet explodes over Trump’s UFC White House pitch",
    "description": "Social media exploded Thursday night after President Donald Trump floated a plan to celebrate America’s 250th anniversary with an Ultimate Fight Championship fight on the White House lawn.Speaking at a rally in Des Moines, Iowa, as he took a victory lap to ce…",
    "link": "https://www.rawstory.com/trump-ufc-2672599435/",
    "timestamp": "2025-07-04T02:10:56Z"
  },
  {
    "title": "As trade deadline approaches, Japan must draw lines",
    "description": "Most worrisome now is a growing sense among the Japanese public that the U.S. is no longer a reliable partner.",
    "link": "https://www.japantimes.co.jp/editorials/2025/07/04/japan-must-draw-trade-deadline/",
    "timestamp": "2025-07-04T02:09:00Z"
  },
  {
    "title": "Trump wants to celebrate 250 years of independence with a UFC fight at the White House",
    "description": "President Donald Trump said Thursday that he's thinking of staging a UFC match on the White House grounds with upwards 20,000 spectators to celebrate 250 years of American independence. “We have a lot of land there,” said Trump, a UFC enthusiast who has atten…",
    "link": "https://sports.yahoo.com/article/trump-wants-celebrate-250-years-020836054.html",
    "timestamp": "2025-07-04T02:08:36Z"
  },
  {
    "title": "Fears in Massachusetts that Trump’s bill could unravel health safety net - Boston News, Weather, Sports | WHDH 7News",
    "description": "BOSTON (AP) — In the state that served as the model for Obamacare, advocates and health care workers fear the Trump administration is dismantling piece-by-piece a<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/fears-in-massachusetts-that-trumps-bill-…",
    "link": "https://whdh.com/news/fears-in-massachusetts-that-trumps-bill-could-unravel-health-safety-net/",
    "timestamp": "2025-07-04T02:07:41Z"
  },
  {
    "title": "Trump takes a megabill victory lap at Iowa rally",
    "description": "President Donald Trump basked in victory Thursday, celebrating the passage of his sweeping domestic policy agenda in a demonstration of his dominance over Republicans in Congress. \nThe president capped what was arguably the most successful week of his second …",
    "link": "https://biztoc.com/x/88f458c6ed9903e8",
    "timestamp": "2025-07-04T02:06:58Z"
  },
  {
    "title": "DOJ lack of TikTok ban enforcement appears to be due to broad Article II interpretation",
    "description": "A FOIA request revealed the letters sent to Apple and big tech over the TikTok ban, and they claim the law wouldn't be enforced due to it interfering with the President's management of foreign affairs.Lack of TikTok ban enforcement due to Article II interpret…",
    "link": "https://appleinsider.com/articles/25/07/04/doj-lack-of-tiktok-ban-enforcement-appears-to-be-due-to-broad-article-ii-interpretation",
    "timestamp": "2025-07-04T02:05:04Z"
  },
  {
    "title": "‘He’s a Little Different, Right?’ Trump Claims RFK Jr. ‘Is Gonna Change’ Autism",
    "description": "President Donald Trump described Secretary of Health Robert F. Kennedy Jr. as \"a little different,\" before claiming Kennedy would \"change\" autism.\nThe post ‘He’s a Little Different, Right?’ Trump Claims RFK Jr. ‘Is Gonna Change’ Autism first appeared on Media…",
    "link": "https://www.mediaite.com/media/tv/hes-a-little-different-right-trump-claims-rfk-jr-is-gonna-change-autism/",
    "timestamp": "2025-07-04T02:04:21Z"
  },
  {
    "title": "Suzuki is becoming a top Japan importer with made-in-India cars",
    "description": "Suzuki beat out Mercedes-Benz to become Japan’s top car importer in June, thanks to the Jimny Nomad and another popular small SUV assembled in India.",
    "link": "https://www.japantimes.co.jp/business/2025/07/04/companies/suzuki-top-importer/",
    "timestamp": "2025-07-04T02:03:00Z"
  },
  {
    "title": "The week that confirmed Europeans are actually quite funny",
    "description": "The monopoly the British believe we hold on humor was loosened this week.",
    "link": "https://www.politico.eu/article/the-week-that-confirmed-europeans-are-actually-quite-funny/",
    "timestamp": "2025-07-04T02:02:00Z"
  },
  {
    "title": "Kiev ablaze after reported overnight missile and drone barrage (VIDEOS)",
    "description": "Ukrainian officials have claimed that the Russian military launched a wave of missile and drone strikes targeting the capital early Friday Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/620968-kiev-missile-drone-strikes-fires/",
    "timestamp": "2025-07-04T02:01:05Z"
  },
  {
    "title": "Byron Donalds Explains How Trump Closed the Deal on the Big Beautiful Bill (VIDEO)",
    "description": "Republican Rep.\nThe post Byron Donalds Explains How Trump Closed the Deal on the Big Beautiful Bill (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/byron-donalds-explains-how-trump-closed-deal-big/",
    "timestamp": "2025-07-04T02:00:58Z"
  },
  {
    "title": "What's in Trump's big bill that passed Congress and will soon become law",
    "description": "Republicans in Congress have muscled President Donald Trump’s tax and spending bill to passage.",
    "link": "https://www.clickondetroit.com/news/politics/2025/07/03/whats-in-trumps-big-bill-that-passed-congress-and-will-soon-become-law/",
    "timestamp": "2025-07-04T02:00:37Z"
  },
  {
    "title": "Dollar holds firm against euro, yen as US trade pressure mounts",
    "description": "The dollar strengthened following President Trump's tax cut bill approval and growing pressure for U.S. trade deals. A robust U.S. jobs report diminished expectations of imminent Federal Reserve rate cuts, boosting the greenback from previous lows against the…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-holds-firm-against-euro-yen-as-us-trade-pressure-mounts/articleshow/122238682.cms",
    "timestamp": "2025-07-04T01:58:33Z"
  },
  {
    "title": "NYC mayoral candidate Zohran Mamdani identified as Black, Asian on Columbia application: report",
    "description": "NYC mayoral candidate Zohran Mamdani listed himself as Black on a Columbia application but later said he wasn’t, according to reporting from the New York Times.",
    "link": "https://www.foxnews.com/politics/nyc-mayoral-candidate-zohran-mamdani-identified-black-asian-columbia-application-report",
    "timestamp": "2025-07-04T01:55:40Z"
  },
  {
    "title": "Sundar Pichai Next? Trump's Next Big Tech Payday Could Be From YouTube After Settling Lawsuits With Meta And X: 'Productive Discussions' Underway",
    "description": "Donald Trump has turned his attention to Alphabet Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL) as settlement talks progress in his lawsuit against YouTube, a subsidiary of Google, following multimillion-dollar payouts from Meta Platforms, Inc. (NASDAQ:META) and X, forme…",
    "link": "https://biztoc.com/x/817711584b3a3588",
    "timestamp": "2025-07-04T01:55:24Z"
  },
  {
    "title": "Oil prices steady on solid job market, tariff uncertainty",
    "description": "Oil prices saw minimal change on Friday. A strong job market in the U.S. supports the Federal Reserve maintaining current interest rates. Investors are awaiting clarity on President Trump's tariff plans. OPEC+ plans to increase oil production. The U.S. impose…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-steady-on-solid-job-market-tariff-uncertainty/articleshow/122238661.cms",
    "timestamp": "2025-07-04T01:54:53Z"
  },
  {
    "title": "Trump Administration Cuts Funding For Black Infant Health Research, Labeling It A DEI Initiative - NewsBreak",
    "description": "A study exploring why Black babies in Detroit are disproportionately born prematurely has been abruptly terminated by the NIH.",
    "link": "https://www.newsbreak.com/share/4087820406608-trump-administration-cuts-funding-for-black-infant-health-research-labeling-it-a-dei-initiative?_f=app_share&amp;pd=0GoYaDl2&amp;lang=en_US&amp;send_time=1751594035&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.26.0.30%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v9%2Cns_foryou_model_exp_25q2_v2-control%2Cns_foryou_rank_exp_25q2-v3%2Cns_foryou_recall_exp_25q3-control&amp;s=i2",
    "timestamp": "2025-07-04T01:54:27Z"
  },
  {
    "title": "Trump: Democrats Hate Trump, \"I Hate Them. I Cannot Stand Them Because I Really Believe They Hate Our Country\"",
    "description": "President Donald Trump spoke in Des Moines, Iowa, on the eve of Independence Day on Thursday.\r\n\r\nPRESIDENT DONALD TRUMP: So just remember, to me, it's so important, and it was mostly important for places like we're at right now. It's really, I'm so proud of i…",
    "link": "https://www.realclearpolitics.com/video/2025/07/03/trump_democrats_hate_trump_i_hate_them_i_cannot_stand_them_because_i_really_believe_they_hate_our_country.html",
    "timestamp": "2025-07-04T01:54:08Z"
  },
  {
    "title": "US stocks set another record and yields leap on signals the US economy is solid",
    "description": "NEW YORK (AP) — U.S. stocks climbed further into record heights on Thursday after a report showed the U.S. job market looks stronger than Wall Street expected.",
    "link": "https://www.wral.com/story/asian-shares-mostly-higher-after-us-stocks-hit-another-record-as-tesla-and-nike-rally/22073524/",
    "timestamp": "2025-07-04T01:52:13Z"
  },
  {
    "title": "Gold heads for weekly gain on US fiscal concerns after tax-cut bill",
    "description": "Gold prices remained stable on Friday, on track for weekly gains as U.S. tax-cut and spending measures raised fiscal concerns. Strong U.S. jobs data, showing 147,000 new positions in June and a 4.1% unemployment rate, tempered gains. Trump announced upcoming …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-heads-for-weekly-gain-on-us-fiscal-concerns-after-tax-cut-bill/articleshow/122238621.cms",
    "timestamp": "2025-07-04T01:52:04Z"
  },
  {
    "title": "Trump signs executive order calling for foreign tourists to pay higher national park fees",
    "description": "In its 2026 fiscal year budget proposal released in May, the Interior Department estimated that such a surcharge would generate more than $90 million annually.",
    "link": "https://www.cbsnews.com/news/trump-signs-executive-order-calling-for-foreign-visitors-to-pay-surcharge-at-national-parks/",
    "timestamp": "2025-07-04T01:45:00Z"
  },
  {
    "title": "Videos Show Trump's Crowd Size at Iowa State Fair",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump headlined the Iowa State Fair on Thursday night, hours after Republicans in Congress shepherded through a massive tax and spending package that provides tax cuts for wealthy Americans la…",
    "link": "https://biztoc.com/x/62431297d6130665",
    "timestamp": "2025-07-04T01:44:23Z"
  },
  {
    "title": "U.S. trade deal leaves Vietnam with questions and one big challenge",
    "description": "With the dust far from having settled on this week’s U.S.-Vietnam trade agreement, one thing is clear: companies operating in what’s become one of the most vibrant Asian economies are on notice to move up the value chain.\nA key element of the deal first unvei…",
    "link": "https://biztoc.com/x/2d7f9c8e90f49bc5",
    "timestamp": "2025-07-04T01:44:13Z"
  },
  {
    "title": "Trump plans UFC fight on White House grounds",
    "description": "United States President Donald Trump spoke at a rally in Iowa, marking an early start to celebrations for the country's 250-year anniversary, which is set for July 4, next year. He told the crowd,...",
    "link": "https://biztoc.com/x/04c48b2ea6cc282e",
    "timestamp": "2025-07-04T01:44:07Z"
  },
  {
    "title": "Experts say Albanese should ‘rethink’ our relationship with Trump’s America: Why start now?",
    "description": "Here's a few times we 'rethought' the US relationship, and many more when we should have.\nThe post Experts say Albanese should ‘rethink’ our relationship with Trump’s America: Why start now? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/07/04/anthony-albanese-donald-trump-usa-president-diplomacy/",
    "timestamp": "2025-07-04T01:41:51Z"
  },
  {
    "title": "Trump: Biden Is the Worst President in U.S. History",
    "description": "President Donald J. Trump has once again captured national and international attention with a series of sharp declarations aimed at three former U.S.",
    "link": "https://gatewayhispanic.com/video/trump-biden-is-worst-president-u-s-history/",
    "timestamp": "2025-07-04T01:40:23Z"
  },
  {
    "title": "Videos Show Trump's Crowd Size at Iowa State Fair",
    "description": "Trump took the stage in the Hawkeye State and championed the GOP-led \"big, beautiful bill\" while attacking Democrats who opposed it.",
    "link": "https://www.newsweek.com/trump-crowd-size-iowa-republicans-big-beautiful-bill-2094539",
    "timestamp": "2025-07-04T01:38:26Z"
  },
  {
    "title": "Boston Red Sox meet President Donald Trump at the White House",
    "description": "The Boston Red Sox paid a visit to the White House, where several players shook hands with President Donald Trump.",
    "link": "https://www.cbsnews.com/boston/news/boston-red-sox-president-donald-trump-white-house/",
    "timestamp": "2025-07-04T01:38:00Z"
  },
  {
    "title": "U.S. trade deal leaves Vietnam with questions and one big challenge",
    "description": "Companies operating in the Southeast Asian hub are on notice to move up the value chain.",
    "link": "https://www.japantimes.co.jp/business/2025/07/04/economy/us-vietnam-trade-deal-questions/",
    "timestamp": "2025-07-04T01:35:00Z"
  },
  {
    "title": "Trump Denounces ‘Shylock’ Bankers and Says of Democrats, ‘I Hate Them’",
    "description": "President Donald Trump turned back the clock and used an old-time slur about Jews before declaring his hatred of congressional Democrats.\nThe post Trump Denounces ‘Shylock’ Bankers and Says of Democrats, ‘I Hate Them’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-denounces-shylock-bankers-and-says-of-democrats-i-hate-them/",
    "timestamp": "2025-07-04T01:33:07Z"
  },
  {
    "title": "Trump Wins Broad Economic Policy Shift as House Passes Tax Bill",
    "description": "President Donald Trump secured a sweeping shift in US domestic policy as the House passed a $3.4 trillion fiscal package that cuts taxes, curtails spending on safety-net programs and reversed much of Joe Biden’s efforts to move the country toward a clean-ener…",
    "link": "https://biztoc.com/x/4655ccf11235aa45",
    "timestamp": "2025-07-04T01:33:07Z"
  },
  {
    "title": "'Deadly Kool-Aid': Insiders warn GOP just signed its own 'death warrant'",
    "description": "Two Democratic political strategists warned the GOP on Wednesday that they were drinking some \"deadly Kool-Aid\" by voting to pass President Donald Trump's massive domestic spending bill. Overall, estimates suggest the bill will add more than $3 trillion to th…",
    "link": "https://www.rawstory.com/james-carville-2672599713/",
    "timestamp": "2025-07-04T01:32:51Z"
  },
  {
    "title": "Australia’s silence on genocide gives Netanyahu a free pass to exterminate Palestinians",
    "description": "The refusal of Australia and other Western countries to talk about Netanyahu's genocide in Gaza is encouraging a more blatant Israeli program of exterminating Palestinians.\nThe post Australia’s silence on genocide gives Netanyahu a free pass to exterminate Pa…",
    "link": "http://www.crikey.com.au/2025/07/04/israel-gaza-palestine-genocide-benjamin-netanyahu/",
    "timestamp": "2025-07-04T01:31:27Z"
  },
  {
    "title": "Mint Quick Edit | Vietnam’s raw trade deal with the US isn’t good news",
    "description": "The US-Vietnam trade deal looks lopsided against the smaller country. This says something about Trump’s approach that should make other US trade partners worry.",
    "link": "https://www.livemint.com/opinion/online-views/vietnam-us-trade-deal-donald-trump-tariffs-export-duty-transshipment-tariff-barrier-asymmetry-protectionism-hanoi-wto-11751555519851.html",
    "timestamp": "2025-07-04T01:30:06Z"
  },
  {
    "title": "Fear of immigration raids cancels Los Angeles Fourth of July events",
    "description": "Immigration raids and enforcement actions have prompted some Southern California communities to cancel their annual Independence Day fireworks displays...",
    "link": "https://www.upi.com/Top_News/US/2025/07/03/immifgration-raids-cancel-4th-of-July-events/4191751591680/",
    "timestamp": "2025-07-04T01:30:00Z"
  },
  {
    "title": "Outrage Erupts After Hacked Data Shows Mamdani Identified as 'Black or African American' on College Application",
    "description": "Outrage Erupts After Hacked Data Shows Mamdani Identified as 'Black or African American' on College Applicationwesternjournal.com",
    "link": "https://www.westernjournal.com/outrage-erupts-hacked-data-shows-mamdani-identified-black-african-american-college-application/",
    "timestamp": "2025-07-04T01:28:54Z"
  },
  {
    "title": "Tiffany Trump shares first photos of her baby boy, Alexander",
    "description": "\"The love of our lives,\" the president's youngest daughter captioned photos of her infant.",
    "link": "https://pagesix.com/2025/07/03/parents/tiffany-trump-shares-first-photos-of-baby-boy-alexander/",
    "timestamp": "2025-07-04T01:27:32Z"
  },
  {
    "title": "Trump to host UFC fight at White House as part of America250 celebration",
    "description": "Trump is a close friend of Dana White, the CEO of UFC, aka the Ultimate Fighting Championship, and attended a fight last month in Newark.",
    "link": "https://nypost.com/2025/07/03/us-news/trump-to-host-ufc-fight-at-white-house-as-part-of-america250-celebration/",
    "timestamp": "2025-07-04T01:26:29Z"
  },
  {
    "title": "Republicans and Democrats look at how to use Trump's tax-cut bill in 2026 elections",
    "description": "Democrats view the cuts to Medicaid and food assistance in U.S. President Donald Trump's bill as ready ammunition for their future campaign.",
    "link": "https://www.japantimes.co.jp/news/2025/07/04/world/politics/republicans-democracts-2026-midterm-elections/",
    "timestamp": "2025-07-04T01:26:00Z"
  },
  {
    "title": "'Devastating': Local Health Care Leaders and Organizations React to the Passage of Trump's Big Bill",
    "description": "With today's narrow passage by the U.S. House of Representatives of H.R. 1, President Donald Trump's multitrillion-dollar package of tax cuts and spending, the president's so-called \"One Big, Beautiful Bill\" awaits only his own signature before becoming law.",
    "link": "https://lostcoastoutpost.com/2025/jul/3/local-reactions-health-care-workers-passage-trump/",
    "timestamp": "2025-07-04T01:24:30Z"
  },
  {
    "title": "Trump kicks off a yearlong celebration of America's 250th anniversary in Iowa",
    "description": "President Trump transformed a festival for the U.S. 250th anniversary into a rally celebrating his accomplishments, including recent tax cuts. He touted the legislation's passage and other achievements while addressing supporters in Iowa. The event, intended …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-kicks-off-a-yearlong-celebration-of-americas-250th-anniversary-in-iowa/articleshow/122238406.cms",
    "timestamp": "2025-07-04T01:23:57Z"
  },
  {
    "title": "Dem Rep. Robert Garcia: Giving More Money to ICE Means 'Just' 'More Terror'",
    "description": "On Thursday’s edition of NBC’s “Meet the Press Now,” Rep. Robert Garcia (D-CA) stated that giving more money to ICE means “more terror in our communities.” Host Gabe Gutierrez asked, “I want to switch now to the topic of immigration.\nThe post Dem Rep. Robert …",
    "link": "https://www.breitbart.com/clips/2025/07/03/dem-rep-robert-garcia-giving-more-money-to-ice-means-just-more-terror/",
    "timestamp": "2025-07-04T01:19:18Z"
  }
]