[
  {
    "title": "US-Japan trade deal guarantees lowest tariff rates for chips, pharma, Japanese official says",
    "description": "TOKYO (Reuters) -Japan's leading trade negotiator said on Tuesday that the trade deal Tokyo agreed with the United States last week guarantees Japan will...",
    "link": "https://tech.yahoo.com/business/articles/us-japan-trade-deal-guarantees-102459647.html",
    "timestamp": "2025-07-29T10:24:59Z"
  },
  {
    "title": "The First US Cable Boat for Offshore Wind Starts Work in Trump’s Shadow",
    "description": "The crew of an American-flagged barge will lay cable to connect the Empire Wind farm to New York City’s grid — a milestone for an embattled sector.",
    "link": "https://financialpost.com/pmn/business-pmn/the-first-us-cable-boat-for-offshore-wind-starts-work-in-trumps-shadow",
    "timestamp": "2025-07-29T10:21:36Z"
  },
  {
    "title": "Donald Trump's tariff blitz brings US levies to highest levels since 1930s (Financial Times)",
    "description": "Financial Times:\nDonald Trump's tariff blitz brings US levies to highest levels since 1930s  —  Washington has locked in tariffs on almost 45% of American imports  —  Donald Trump has pushed US tariffs on foreign goods to the highest level since before the se…",
    "link": "https://www.memeorandum.com/250729/p8",
    "timestamp": "2025-07-29T10:20:00Z"
  },
  {
    "title": "How SpaceX's rocket diplomacy backfired in the Bahamas",
    "description": "SpaceX offered Starlink internet to the Bahamas for rocket landings. Deputy PM Chester Cooper signed the deal. A Starship explosion caused debris on Bahamian islands. This led to a deal suspension. Mexico is also considering action against SpaceX. Starlink is…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/how-spacexs-rocket-diplomacy-backfired-in-the-bahamas/articleshow/122973879.cms",
    "timestamp": "2025-07-29T10:18:00Z"
  },
  {
    "title": "North Korea says US should abandon denuclearization push",
    "description": "US President Donald Trump is seeking fresh talks with North Korea on its nuclear program, returning to the direct engagement seen during his first term. Kim's powerful sister has said denuclearization is off the table.",
    "link": "https://www.dw.com/en/north-korea-says-us-should-abandon-denuclearization-push/a-73445727",
    "timestamp": "2025-07-29T10:17:00Z"
  },
  {
    "title": "China Watchers React As Trump Caves to Beijing on Key Issue",
    "description": "Taiwan's foreign ministry spokesperson told Newsweek there was \"no such thing as a postponement, cancellation, or the U.S. side refusing a transit stop.\"",
    "link": "https://www.newsweek.com/china-watchers-react-trump-caves-beijing-taiwan-president-2105517",
    "timestamp": "2025-07-29T10:15:49Z"
  },
  {
    "title": "Trump wraps up golf-filled Scotland visit by opening new golf course",
    "description": "President Trump opened a new golf course bearing his name in Scotland on Tuesday, capping a five-day foreign trip designed around playing golf and agreeing on a major trade deal framework with the EU.",
    "link": "https://www.cbsnews.com/news/trump-scotland-visit-new-golf-course-balmedie/",
    "timestamp": "2025-07-29T10:15:47Z"
  },
  {
    "title": "Greek government cautious on new EU-US trade deal reached with Trump",
    "description": "Greek finance minister and other trade officials share their thoughts on the tariff agreement reached between US President Donald Trump and European Commission President Ursula von der Leyen.",
    "link": "https://biztoc.com/x/9a12a7d7abb1f907",
    "timestamp": "2025-07-29T10:15:13Z"
  },
  {
    "title": "Chinese, US Officials Meet For 2nd Day Of Trade Talks In Stockholm",
    "description": "Chinese and US delegations met for their second day of trade negotiations in Stockholm, with both sides said to be aiming to extend a truce due to end in two weeks' time.",
    "link": "https://www.ibtimes.com/chinese-us-officials-meet-2nd-day-trade-talks-stockholm-3779701",
    "timestamp": "2025-07-29T10:15:11Z"
  },
  {
    "title": "'We love Scotland': Trump calls first minister a 'special guy' as he opens golf course",
    "description": "Donald Trump described Scotland's first minister as a \"special guy\" as he officially opened his new golf course in Aberdeenshire.",
    "link": "https://news.sky.com/story/us-president-donald-trump-calls-first-minister-john-swinney-a-special-guy-as-he-opens-golf-course-in-aberdeenshire-13403406",
    "timestamp": "2025-07-29T10:15:00Z"
  },
  {
    "title": "Doug Mackey announces civil suit against his tormentors—and he’s retained a legal bulldog who knows where the bodies are buried…",
    "description": "Donald Trump Jr. just broke the news in the Douglass Mackey case, and it’s big. On Donald Trump Jr.’s show, which aired Monday evening on Rumble, Mackey announced that he will be suing the US government for what was done to him. Not only that, but he’s bringi…",
    "link": "https://freerepublic.com/focus/f-news/4331378/posts",
    "timestamp": "2025-07-29T10:12:24Z"
  },
  {
    "title": " Ukraine Under Attack: 20+ DEAD & 40+ Injured in Latest Russian Strikes  #Ukraine #RussiaWar #BreakingNews",
    "description": "Ukraine War Update: Russian Attacks Claim Lives and Wounds Hello everyone, and welcome to today’s crucial update on the ongoing Russia-Ukraine war. The situation remains dire, with devastating consequences unfolding across the country. We’ll be covering the l…",
    "link": "https://nep123.com/ukraine-under-attack-20-dead-40-injured-in-latest-russian-strikes-ukraine-russiawar-breakingnews/",
    "timestamp": "2025-07-29T10:10:51Z"
  },
  {
    "title": "How SpaceX's rocket diplomacy backfired in the Bahamas",
    "description": "NASSAU, Bahamas (Reuters) -When SpaceX was negotiating a deal with the Bahamas last year to allow its Falcon 9 rocket boosters to land within the island...",
    "link": "https://finance.yahoo.com/news/spacexs-rocket-diplomacy-backfired-bahamas-100957825.html",
    "timestamp": "2025-07-29T10:09:57Z"
  },
  {
    "title": "Russia ‘Takes Note’ of Trump’s 10–12 Day Ultimatum on Ukraine Peace Deal",
    "description": "MOSCOW (Sputnik) - Moscow has taken note of the statement made by US President Donald Trump on a new deadline for a ceasefire in Ukraine on July 28, Kremlin spokesman Dmitry Peskov said on Tuesday.",
    "link": "https://sputnikglobe.com/20250729/russia-takes-note-of-trumps-1012-day-ultimatum-on-ukraine-peace-deal-1122508339.html",
    "timestamp": "2025-07-29T10:09:35Z"
  },
  {
    "title": "Kremlin says it 'noted' Trump's statement on shorter deadline for a ceasefire in Ukraine",
    "description": "MOSCOW (Reuters) -The Kremlin said on Tuesday that it had \"taken note\" of a statement by U.S. President Donald Trump that he was shortening his deadline for ...",
    "link": "https://www.yahoo.com/news/articles/kremlin-says-noted-trumps-statement-100855473.html",
    "timestamp": "2025-07-29T10:08:55Z"
  },
  {
    "title": "The 2026 campaign has already kicked off, with ads focused on Medicaid, Trump tax cuts",
    "description": "NEW YORK (Reuters) -Residents of Columbus, Indiana awoke last week to a yellow billboard purchased by the Democratic National Committee blaring: “Under...",
    "link": "https://www.yahoo.com/news/articles/2026-campaign-already-kicked-off-100851498.html",
    "timestamp": "2025-07-29T10:08:51Z"
  },
  {
    "title": "Kremlin says 'committed' to peace in Ukraine after Trump's new deadline",
    "description": "Russia is still committed to achieving peace in Ukraine, the Kremlin said Tuesday, in the first reaction to US President Donald Trump cutting his deadline for Moscow to cease fire in the conflict.",
    "link": "https://www.hurriyetdailynews.com/kremlin-says-committed-to-peace-in-ukraine-after-trumps-new-deadline-211982",
    "timestamp": "2025-07-29T10:08:27Z"
  },
  {
    "title": "Global shares are mostly higher as investors focus on US trade talks with China",
    "description": "Global shares are mostly higher ahead at the outset of a second day of trade talks between Chinese and U.S. officials",
    "link": "https://abcnews.go.com/Business/wireStory/global-shares-higher-investors-focus-us-trade-talks-124159437",
    "timestamp": "2025-07-29T10:06:18Z"
  },
  {
    "title": "Regina Spektor Confronts 'Free Palestine' Heckler: 'You're Just Yelling at a Jew'",
    "description": "Singer-songwriter Regina Spektor confronted hecklers during a show in Portland, Maine, who were shouting \"Free Palestine\" at her, telling them: \"You're just yelling at a Jew.\"\nThe post Regina Spektor Confronts ‘Free Palestine’ Heckler: ‘You’re Just Yelling at…",
    "link": "https://www.breitbart.com/entertainment/2025/07/29/regina-spektor-confronts-free-palestine-heckler-youre-just-yelling-at-jew/",
    "timestamp": "2025-07-29T10:02:10Z"
  },
  {
    "title": "Meet the Republicans Trying to Out-MAGA Trump",
    "description": "Trump is very focused on backing electable Republican candidates in the 2026 midterms. But in South Carolina, Georgia, and Pennsylvania, there are candidates who think they can out-MAGA Trump.",
    "link": "http://nymag.com/intelligencer/article/trump-midterms-republicans-dans-bauer-collins-mastriano.html",
    "timestamp": "2025-07-29T10:00:57Z"
  },
  {
    "title": "The wars Trump promised to end are escalating. Why?",
    "description": "As a candidate, Donald Trump promised to end the Ukraine war on his first day in office and swiftly bring the Gaza war to a close as well. Now more than six months into his presidency, peace on both fronts appears further away than ever.",
    "link": "https://www.cnn.com/2025/07/29/politics/trump-promises-gaza-ukraine-mcgurk-analysis",
    "timestamp": "2025-07-29T10:00:41Z"
  },
  {
    "title": "Columbia settlement puts Ivy League universities in 'survival mode,' Ohio State president claims",
    "description": "Ted Carter says Ohio State won't face issues like Columbia's $221 million settlement with Trump over antisemitism claims that restored federal research funding.",
    "link": "https://www.foxnews.com/media/columbia-settlement-puts-ivy-league-universities-survival-mode-ohio-state-president-claims",
    "timestamp": "2025-07-29T10:00:39Z"
  },
  {
    "title": "Mortgage and refinance interest rates today, July 29, 2025: Rates remain steady ahead of this week's Fed meeting",
    "description": "These are today's mortgage and refinance rates. 30-year and 15-year mortgage rates have both inched upward. Lock in your rate today.",
    "link": "https://finance.yahoo.com/personal-finance/mortgages/article/mortgage-refinance-rates-today-tuesday-july-29-2025-100029360.html",
    "timestamp": "2025-07-29T10:00:29Z"
  },
  {
    "title": "Opinion: Forget the G7. We need an FT8 — a Free Trade Eight",
    "description": "Dump the US from the G7 and add Australia and Korea for starters, and build a new trading group based on postwar liberal principles. Read on",
    "link": "https://financialpost.com/opinion/forget-g7-need-ft8-free-trade-eight",
    "timestamp": "2025-07-29T10:00:27Z"
  },
  {
    "title": "William Watson: Government-managed trade is sure to fail again",
    "description": "Politicians intervening in the intricate details of supply chains will lead to inefficiency and corruption, as it always does. Read more.",
    "link": "https://financialpost.com/opinion/government-managed-trade-sure-fail-again",
    "timestamp": "2025-07-29T10:00:23Z"
  },
  {
    "title": "Epstein Scandal Is Just the Beginning of Government's Failures To Protect Kids | Opinion",
    "description": "Activists demanding answers in the Jeffrey Epstein case must continue to pressure Congress and the executive branch to act to protect children.",
    "link": "https://www.newsweek.com/epstein-scandal-just-beginning-governments-failures-protect-kids-opinion-2103026",
    "timestamp": "2025-07-29T10:00:01Z"
  },
  {
    "title": "USAID Cuts Leave West Bank Water Supply High and Dry",
    "description": "Water shortages are contributing to the largest displacement of Palestinians in the West Bank since 1967.\nThe post USAID Cuts Leave West Bank Water Supply High and Dry appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/07/29/usaid-water-west-bank-israel-palestine/",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "Rooftop Solar Is a Miracle. Why Are We Killing It With Red Tape?",
    "description": "Earlier this summer, Tara McDermott, who’s in charge of policy communications for a New York state solar developer called EmPower Solar, was telling me a woeful tale a lot like others I’d been hearing lately. A customer whom I’ll call Pam had tried to put sol…",
    "link": "https://www.motherjones.com/environment/2025/07/rooftop-solar-grid-power-green-permits/",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "The Houston Superlawyer Who’s Not Afraid to Take On Diddy, Deshaun Watson, and Shannon Sharpe",
    "description": "Tony Buzbee became one of the wealthiest, most feared attorneys in the country by suing big companies. Now the controversial litigator is going after celebrities accused of sexual misconduct. Will his TMZ-friendly style come back to bite him?",
    "link": "https://www.esquire.com/news-politics/a65510777/houston-superlawyer-diddy-deshaun-watson/",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "The Big Ten Rises Up\nAgainst Trump",
    "description": "StakesUniversity politics are so vicious because the stakes are so low. Good old Sayre’s Law, coined in 1973. Funny while it lasted. May it find eternal life in meme heaven.It’s been ages since university politics meant student-faculty sex scandals, petty ten…",
    "link": "https://newrepublic.com/article/198355/big-ten-conference-colleges-trump-fight",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "Judges keep slapping down Trump's birthright citizenship arguments. Something has to give.",
    "description": "Several lower courts have again granted injunctions in cases challenging President Donald Trump’s executive order that purported to end birthright citizenship.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-immigration-birthright-citizenship-supreme-court-rcna220390",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "32% in U.S. Back Israel's Military Action in Gaza, a New Low",
    "description": "Americans' approval of Israel's military action in Gaza has fallen to a new low, along with the worst opinions of Prime Minister Benjamin Netanyahu to date.",
    "link": "https://news.gallup.com/poll/692948/u.s.-back-israel-military-action-gaza-new-low.aspx",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "Trump admitted to going into changing room of beauty pageant contestants",
    "description": "Trump made the comments during a discussion about Miss USA and Miss Universe, not Miss Teen USA.",
    "link": "https://www.snopes.com//news/2025/07/29/trump-beauty-pageant-dressing-rooms/",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "Trump’s Ultimatum To Russia Signals New Approach To War In Ukraine",
    "description": "U.S. President Donald Trump has given Russian President Vladimir Putin a new deadline to end the war in Ukraine.",
    "link": "https://www.forbes.com/sites/marktemnycky/2025/07/29/trumps-new-ultimatum-to-russia-signals-new-approach-to-war-in-ukraine/",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "Trump administration acts to protect religious expression of federal workers",
    "description": "U.S. Office of Personnel Management headquarters building in Washington, D.C. / Credit: Another Believer, CC BY-SA 3.0, via Wikimedia Commons\n\nWashington, D.C. Newsroom, Jul 29, 2025 / 06:00 am (CNA).\nU.S. President Donald Trump’s administration has issued ne…",
    "link": "https://www.catholicnewsagency.com/news/265615/trump-administration-acts-to-protect-religious-expression-of-federal-workers",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "Welcome to the Gerrymandering Wars",
    "description": "President Donald Trump’s push to shore up the GOP’s House majority through gerrymandering ahead of the 2026 elections has sparked a cycle of escalation and potential retaliation across multiple states that could upend next year’s midterms. It is also producin…",
    "link": "https://newrepublic.com/article/198517/democrats-trump-texas-gerrymandering-wars",
    "timestamp": "2025-07-29T10:00:00Z"
  },
  {
    "title": "When Grand Buildings Signal Institutional Decay",
    "description": "In the 1950s, British satirist C. Northcote Parkinson observed that institutions often build extravagant headquarters just as they begin to decline. The US Federal Reserve’s costly renovation, unfolding amid political hostility and fiscal dysfunction, may be …",
    "link": "https://www.project-syndicate.org/commentary/is-us-federal-reserve-falling-for-parkinson-law-of-buildings-by-harold-james-2025-07",
    "timestamp": "2025-07-29T09:58:29Z"
  },
  {
    "title": "Kremlin says it 'noted' Trump's deadline of ‘10 or 12 days’ for deal to end Ukraine war",
    "description": "The Kremlin said on Tuesday it had \"taken note\" of a statement by US president Donald Trump that he was shortening his deadline for Moscow to agree an end to the war in Ukraine or face new sanctions on Russia and buyers of its exports.",
    "link": "https://www.independent.ie/world-news/europe/kremlin-says-it-noted-trumps-deadline-of-10-or-12-days-for-deal-to-end-ukraine-war/a607259827.html",
    "timestamp": "2025-07-29T09:57:09Z"
  },
  {
    "title": "UK equities mixed as investors assess slew of corporate earnings, US-EU trade deal",
    "description": "BRITAIN-STOCKS/:UK equities mixed as investors assess slew of corporate e",
    "link": "https://www.livemint.com/companies/company-results/uk-equities-mixed-as-investors-assess-slew-of-corporate-earnings-us-eu-trade-deal-11753782933594.html",
    "timestamp": "2025-07-29T09:55:33Z"
  },
  {
    "title": "EU-US trade deal gives ‘little reason to celebrate’, Polish PM Tusk says",
    "description": "\"The losses [from the tariffs] will be painful on both sides of the Atlantic, but a difficult trade deal is better than a pointless tariff war between allies,” Tusk said on Tuesday",
    "link": "https://www.euractiv.com/section/politics/news/eu-us-trade-deal-gives-little-reason-to-celebrate-polish-pm-tusk-says/",
    "timestamp": "2025-07-29T09:53:34Z"
  },
  {
    "title": "Wall Street futures rise as focus shifts to major earnings, Fed meeting",
    "description": "At 05:19 a.m. ET, Dow E-minis were up 73 points, or 0.16%, S&P 500 E-minis were up 15.25 points, or 0.24%, and Nasdaq 100 E-minis were up 93.25 points, or...",
    "link": "https://finance.yahoo.com/news/wall-street-futures-rise-focus-095254735.html",
    "timestamp": "2025-07-29T09:52:54Z"
  },
  {
    "title": "Colbert Relentlessly Mocks Parent Company Paramount, Trump, and Its Just-Approved Merger With Slew of Pee Jokes",
    "description": "The Late Show host Stephen Colbert ridiculed the merger deal between his show's parent company Paramount and Skydance with a slew of pee-related jokes.\nThe post Colbert Relentlessly Mocks Parent Company Paramount, Trump, and Its Just-Approved Merger With Slew…",
    "link": "https://www.mediaite.com/media/tv/colbert-relentlessly-mocks-parent-company-paramount-trump-and-its-just-approved-merger-with-slew-of-pee-jokes/",
    "timestamp": "2025-07-29T09:50:05Z"
  },
  {
    "title": "Stop fantasising about Pakistan: Top policy expert Samir Saran explains why India shouldn’t worry about Asim Munir",
    "description": "Samir Saran advises India to prioritize regional stability over Pakistan's internal politics, advocating for a focus on strategic outcomes rather than attempting to reshape Pakistan in India's image. He suggests that India should concentrate on its own intere…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/stop-fantasising-about-pakistan-top-policy-expert-samir-saran-explains-why-india-shouldnt-worry-about-asim-munir/articleshow/122972398.cms",
    "timestamp": "2025-07-29T09:48:53Z"
  },
  {
    "title": "Gate and World Liberty Financial Reach Strategic Milestone: Gate Becomes Second-Largest Holder of USD1 Among Centralized Exchanges",
    "description": "PANAMA CITY, July 29, 2025 (GLOBE NEWSWIRE) -- Gate, a leading global cryptocurrency exchange, and World Liberty Financial (WLFI), the developer of a pioneering DeFi protocol and governance platform inspired by President Donald J. Trump, jointly announced a m…",
    "link": "https://www.globenewswire.com/news-release/2025/07/29/3123053/0/en/Gate-and-World-Liberty-Financial-Reach-Strategic-Milestone-Gate-Becomes-Second-Largest-Holder-of-USD1-Among-Centralized-Exchanges.html",
    "timestamp": "2025-07-29T09:48:00Z"
  },
  {
    "title": "LIVE: Trump Gives Speech at Aberdeenshire Golf Course Opening",
    "description": "Trump is at the golf links in Aberdeenshire to open a new course. John Swinney is also in attendance. Trump is giving a speech…\n\nWatch live as US President Donald Trump gives a speech after opening his new golf course in Aberdeenshirehttps://t.co/DipFRv1Bjz\r\n…",
    "link": "https://order-order.com/2025/07/29/live-trump-gives-speech-at-aberdeenshire-golf-course-opening/",
    "timestamp": "2025-07-29T09:47:17Z"
  },
  {
    "title": "Starmer Outlines Oil Will be Part of UK Mix for 'Very Long Time'",
    "description": "'Oil and gas is going to be with us for a very long time', UK Prime Minister Keir Starmer said.",
    "link": "https://www.rigzone.com/news/starmer_outlines_oil_will_be_part_of_uk_mix_for_very_long_time-29-jul-2025-181298-article/",
    "timestamp": "2025-07-29T09:47:02Z"
  },
  {
    "title": "Report: More than Half of Aid Trucks from Egypt to Gaza Looted Sunday",
    "description": "More than half of the aid trucks that entered the Gaza Strip from Egypt via the Rafah crossing on Sunday, during a surge of aid, were looted, according to a Qatari-funded newspaper quoted by the Times of Israel.\nThe post Report: More than Half of Aid Trucks f…",
    "link": "https://www.breitbart.com/middle-east/2025/07/29/report-more-than-half-of-aid-trucks-from-egypt-to-gaza-looted-sunday/",
    "timestamp": "2025-07-29T09:44:34Z"
  },
  {
    "title": "Former Finnish president: I advised Trump about Putin",
    "description": "\"I told him that Putin is a fighter. You have to oppose him. That's very necessary,\" former president Sauli Niinistö told Deutsche Welle.",
    "link": "https://yle.fi/a/74-20174857",
    "timestamp": "2025-07-29T09:41:50Z"
  },
  {
    "title": "Trump Says Will Set New Deadline of 10-12 Days for Russia to Agree on Peace Deal",
    "description": "US President Donald Trump announced his intention on Monday to establish a new deadline of approximately 10 to 12 days for Russia to reach a peace agreement with Ukraine, significantly shortening the previous timeline of 50 days.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250728-sputnik02.htm",
    "timestamp": "2025-07-29T09:33:04Z"
  },
  {
    "title": "Thailand, Cambodia reach 'unconditional, immediate' ceasefire",
    "description": "Thailand and Cambodia agreed on Monday to an \"immediate and unconditional\" ceasefire to end their border clashes starting midnight on Monday, Malaysian Prime Minister Anwar Ibrahim said, as the leaders of the two countries met in Malaysia after their border c…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-globaltimes03.htm",
    "timestamp": "2025-07-29T09:33:04Z"
  },
  {
    "title": "Pentagon Eyes Ukraine as Drone Testing Ground After Alaska Failures",
    "description": "The US Department of Defense (DOD) views Ukraine to be a potential polygon for drone testing after it ran into difficulties during the June trials in Alaska, Defense News reported, citing sources in Pentagon.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250728-sputnik01.htm",
    "timestamp": "2025-07-29T09:33:04Z"
  },
  {
    "title": "21 Killed by Russian Strikes on Ukrainian Prison, Facilities",
    "description": "Russian glide bombs and missiles struck a Ukrainian prison and a medical facility overnight, killing at least 21 people, officials said.\nThe post 21 Killed by Russian Strikes on Ukrainian Prison, Facilities appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/07/29/21-killed-by-russian-strikes-on-ukrainian-prison-facilities/",
    "timestamp": "2025-07-29T09:33:01Z"
  },
  {
    "title": "Israelis Begin to Question the Morality of Their War in Gaza",
    "description": "The news on Israel’s main TV channel had just finished a segment on how hunger in Gaza is portrayed around the world when the anchor looked up and said: “Maybe it’s finally time to acknowledge that this isn’t a public relations failure, but a moral one.”",
    "link": "https://www.livemint.com/opinion/online-views/israelis-begin-to-question-the-morality-of-their-war-in-gaza-11753781524029.html",
    "timestamp": "2025-07-29T09:32:03Z"
  },
  {
    "title": "Pharma giants push for tariff clarity as ambiguity threatens EU-U.S. deal",
    "description": "The pharma sector remains under a U.S. Section 232 investigation, with the outcome due by August.",
    "link": "https://www.cnbc.com/2025/07/29/pharma-tariffs-firms-urge-for-clarity-under-eu-us-trade-deal.html",
    "timestamp": "2025-07-29T09:31:04Z"
  },
  {
    "title": "Trump's trade deal with the EU: What it means for your wallet",
    "description": "In This Article:\nImported cars, pharmaceuticals, apparel and more could grow more expensive in the months to come as the United States imposes a 15% tariff on most imports from the European Union.\nAnalysts have labeled the agreement, announced July 27, as a w…",
    "link": "https://biztoc.com/x/09da7d577b9392ee",
    "timestamp": "2025-07-29T09:30:59Z"
  },
  {
    "title": "Trump Shortens Cease-Fire Deadline To 10-12 Days For Putin Amid Frustration Over Ukraine",
    "description": "U.S. President Donald Trump says he will shorten the cease-fire deadline given to Russian President Vladimir Putin to 10 to 12 days amid growing frustration over Russia's continue bombardment of Ukraine and lack of progress toward peace.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250728-rferl02.htm",
    "timestamp": "2025-07-29T09:30:21Z"
  },
  {
    "title": "Hamas: Trump repeats Israel narrative, lies and misleads public",
    "description": "A senior Hamas official has condemned US President Donald Trump's remarks about the absence of famine in Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-presstv04.htm",
    "timestamp": "2025-07-29T09:30:21Z"
  },
  {
    "title": "Truce takes effect in Cambodia, Thailand border dispute",
    "description": "A ceasefire between Thailand and Cambodia came into effect early Tuesday, aimed to end five days of fierce fighting in a disputed border area that has killed at least 35 people and displaced more than 200,000 others.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-rfa01.htm",
    "timestamp": "2025-07-29T09:30:21Z"
  },
  {
    "title": "'Capitulation' Or Compromise? EU Faces Backlash Over US Trade Deal",
    "description": "A US-EU trade war appears to have been avoided, the European Union took a real hit, but the transatlantic relationship will remain unpredictable. Those are the main takeaways after Brussels and Washington shook hands on a trade framework agreement in Scotland…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-rferl01.htm",
    "timestamp": "2025-07-29T09:30:21Z"
  },
  {
    "title": "The U.S-Lithuanian relations have never been stronger as joint security projects are discussed in Washington",
    "description": "Minister of National Defence Dovilė Šakalienė with Latvian and Estonian colleagues had a meeting with Secretary of Defense of the United States Pete Hegseth in Washington.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-lithuania-mnd01.htm",
    "timestamp": "2025-07-29T09:30:21Z"
  },
  {
    "title": "US-EU trade war temporarily averted with 15% tariff deal amid 'imbalance' criticism",
    "description": "The United States and the European Union have reached a deal that sets a 15% tariff on most European goods entering the US, temporarily averting a trade war—though the agreement faces sharp criticism in Europe as an 'imbalanced' deal that favors American inte…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-presstv03.htm",
    "timestamp": "2025-07-29T09:30:21Z"
  },
  {
    "title": "Hamas says Trump's remarks \"inconsistent\" with Gaza talks process",
    "description": "A senior Hamas official said Saturday that recent remarks by U.S. President Donald Trump were \"inconsistent\" with the process of the indirect negotiations between Hamas and Israel over Gaza ceasefire and hostage release.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250728-pdo05.htm",
    "timestamp": "2025-07-29T09:30:21Z"
  },
  {
    "title": "David Fickling: India is outpacing America in its transition to clean energy",
    "description": "First China zipped ahead. Now India has. The US is fast becoming a laggard on renewable energy. India’s drive was speeded up by falling solar set-up costs but Trump’s climate-sceptic policies are holding America back from joining Asia’s race for a cleaner pla…",
    "link": "https://www.livemint.com/opinion/online-views/india-renewable-energy-clean-energy-superpower-solar-panel-manufacturing-climate-change-mitigation-non-fossil-target-win-11753723492899.html",
    "timestamp": "2025-07-29T09:30:08Z"
  },
  {
    "title": "While the Fed kept its benchmark unchanged, here's what happened to consumer borrowing rates",
    "description": "Even while the Fed left its benchmark rate unchanged, many consumer rates have fluctuated over the first half of the year.",
    "link": "https://www.cnbc.com/2025/07/29/fed-meeting-borrowing-rates.html",
    "timestamp": "2025-07-29T09:30:01Z"
  },
  {
    "title": "Trump’s Tariff Tsunami: EU Takes a Hit, But What Does It Mean for You?",
    "description": "In yet another dramatic twist to global trade headlines, Donald Trump has pulled off a tariff coup, slapping 15% taxes on European goods—and still walking away with a smile and a $600 billion investment promise from the EU. So, what does this mean for us on t…",
    "link": "https://english.gossiplankanews.com/2025/07/trumps-tariff-tsunami-eu-takes-hit-but.html",
    "timestamp": "2025-07-29T09:30:00Z"
  },
  {
    "title": "Trump Has Found the One Late-Night Host He Likes: Bill Maher",
    "description": "The kind of endorsement no one should desire these days",
    "link": "https://www.cracked.com/article_47610_trump-has-found-the-one-late-night-host-he-likes-bill-maher.html",
    "timestamp": "2025-07-29T09:30:00Z"
  },
  {
    "title": "CNN's Harry Enten Says Dems Are 'Breaking Records in a Way You Don’t Want to Break Records'",
    "description": "Are they that devastated by Donald Trump’s return to the White House? Democrats are hoping history and voter backlash on the GOP agenda will buoy them to electoral success next year. There are many problems, not least being that they have no message, no agend…",
    "link": "https://freerepublic.com/focus/f-news/4331375/posts",
    "timestamp": "2025-07-29T09:28:48Z"
  },
  {
    "title": "UK PM Starmer recalls cabinet to discuss Gaza peace plan",
    "description": "LONDON (Reuters) -British Prime Minister Keir Starmer will hold an emergency cabinet on Tuesday to discuss the situation in Gaza and a  proposed peace plan...",
    "link": "https://www.yahoo.com/news/articles/uk-pm-starmer-recalls-cabinet-092517630.html",
    "timestamp": "2025-07-29T09:25:17Z"
  },
  {
    "title": "With Trump pressure and a 'new Lebanon,' can Hezbollah's shadow economy be dismantled?",
    "description": "\"Hezbollah finds itself in its greatest predicament since its foundation,\" one regional expert told CNBC.",
    "link": "https://www.cnbc.com/2025/07/29/a-new-lebanon-can-hezbollahs-shadow-economy-be-dismantled.html",
    "timestamp": "2025-07-29T09:20:25Z"
  },
  {
    "title": "Trump Administration Sued Over SNAP Benefits Move",
    "description": "States attorneys general involved in the legal challenge say a private data request the USDA made violates federal privacy laws.",
    "link": "https://www.newsweek.com/trump-administration-sued-over-snap-benefits-data-sharing-2105477",
    "timestamp": "2025-07-29T09:19:17Z"
  },
  {
    "title": "Trump ties 'not bad' but U.S. must accept we are a nuclear power, Kim Jong Un's sister says",
    "description": "North Korea said Tuesday that while the relationship between its leader Kim Jong Un and President Donald Trump is “not bad,” the United States must accept the isolated country as a nuclear weapons state",
    "link": "https://www.nbcnews.com/world/north-korea/kim-jong-un-sister-trump-north-korea-nuclear-weapons-rcna221647",
    "timestamp": "2025-07-29T09:14:27Z"
  },
  {
    "title": "BYD overtakes Tesla on Fortune’s Global 500 as once-dominant U.S. companies feel heat from foreign rivals",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/07/29/byd-tesla-fortune-global-500/",
    "timestamp": "2025-07-29T09:09:33Z"
  },
  {
    "title": "Iran Refuses to Blink as Europe Eyes Snapback Sanctions",
    "description": "Europe is allegedly threatening to launch the JCPOA snapback, which would re-institute tougher sanctions on Iran. But is this threat real?",
    "link": "https://www.nakedcapitalism.com/2025/07/iran-refuses-to-blink-as-europe-eyes-snapback-sanctions.html",
    "timestamp": "2025-07-29T09:09:20Z"
  },
  {
    "title": "Canada’s Conservatives can’t quit their grocery price politicking",
    "description": "Climate change is obviously driving up the cost of food. Why can’t Canada’s Conservatives admit it?",
    "link": "https://www.nationalobserver.com/2025/07/29/opinion/canada-conservatives-inflation-climate-change",
    "timestamp": "2025-07-29T09:09:06Z"
  },
  {
    "title": "Trump's trade deal with the EU: What it means for your wallet",
    "description": "Tariffs, including the 15% rate for most imports from the EU, would raise consumer prices by 1.8% in the short run, according to the Yale Budget Lab.",
    "link": "https://www.usatoday.com/story/money/2025/07/29/trump-european-union-trade-deal-price-impact/85411256007/",
    "timestamp": "2025-07-29T09:07:23Z"
  },
  {
    "title": "Inmates, pregnant woman among 22 killed in Russia’s attacks on Ukraine",
    "description": "Ukrainian drone attacks kill at least one person in Russia's southern Rostov region.",
    "link": "https://www.aljazeera.com/news/2025/7/29/ukraine-says-at-least-20-killed-40-injured-in-russian-strikes-on-south",
    "timestamp": "2025-07-29T09:05:15Z"
  },
  {
    "title": "Cboe files to list staked Injective ETF from Canary Capital",
    "description": "The Cboe has filed to list Canary Capital’s staked Injective ETF, potentially making it the third staked crypto ETF following Solana and Ether.",
    "link": "https://cointelegraph.com/news/cboe-staked-inj-etf-of-canary-capital",
    "timestamp": "2025-07-29T09:03:21Z"
  },
  {
    "title": "Foreign Minister Sa'ar: International pressure undermining ceasefire efforts",
    "description": "Top diplomat warns Hamas emboldened by external calls to halt Israel's military campaign.",
    "link": "https://www.israelnationalnews.com/news/412417",
    "timestamp": "2025-07-29T09:01:49Z"
  },
  {
    "title": "LIZ PEEK: Trump's major trade wins could be rocket fuel to US economy",
    "description": "Despite criticism from economists, it's clear that Trump's trade policies challenge conventional wisdom as tariff revenues flow into the Treasury and companies consider US production.",
    "link": "https://www.foxnews.com/opinion/liz-peek-trumps-major-trade-wins-could-rocket-fuel-us-economy",
    "timestamp": "2025-07-29T09:00:40Z"
  },
  {
    "title": "MORNING GLORY: Has President Trump ordered the big re-think?",
    "description": "Modern warfare evolves with Ukraine and Israel launching surprise drone attacks from inside enemy territory, creating new security challenges for open societies like the United States.",
    "link": "https://www.foxnews.com/opinion/morning-glory-has-president-trump-ordered-big-re-think",
    "timestamp": "2025-07-29T09:00:27Z"
  },
  {
    "title": "The Corpse of NPR Pats Itself on the Back",
    "description": "For decades, NPR clung to the fiction that it is committed to serving \"Americans across the political spectrum.\" That’s how CEO Katherine Maher put it during the network's losing battle to hold on to taxpayer funding. \nIt was a tough sell coming from Maher, w…",
    "link": "https://freebeacon.com/media/the-corpse-of-npr-pats-itself-on-the-back/",
    "timestamp": "2025-07-29T09:00:04Z"
  },
  {
    "title": "Map Shows How Donald Trump's Approval Rating Has Changed in States He Won",
    "description": "The president's approval rating fluctuates state by state, including in states he won in the 2024 presidential election.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-states-he-won-2105066",
    "timestamp": "2025-07-29T09:00:01Z"
  },
  {
    "title": "Trump lawsuit against Murdoch and 'Wall Street Journal' turns personal",
    "description": "Trump says he personally told his \"very good friend Rupert Murdoch\" that he had not sent a racy birthday greeting two decades ago to Jeffrey Epstein. Murdoch's Journal reported it anyway.",
    "link": "https://www.npr.org/2025/07/29/nx-s1-5482955/trump-epstein-murdoch-deposition-lawsuit",
    "timestamp": "2025-07-29T09:00:00Z"
  },
  {
    "title": "What you may have missed about Trump’s AI Action Plan",
    "description": "A number of the executive orders and announcements coming from the White House since Donald Trump returned to office have painted an ambitious vision for America’s AI future—crushing competition with China, abolishing “woke” AI models that suppress conservati…",
    "link": "https://www.technologyreview.com/2025/07/29/1120760/what-you-may-have-missed-about-trumps-ai-action-plan/",
    "timestamp": "2025-07-29T09:00:00Z"
  },
  {
    "title": "He Was Asked About His Tattoos and a TikTok Video in Court. Five Days Later, He Was in a Salvadoran Prison.",
    "description": "by Melissa Sanchez \n \n\n \n ProPublica is a nonprofit newsroom that investigates abuses of power. This story was originally published in our Dispatches newsletter; sign up to receive notes from our journalists.\n\n \n\n \n \n \n\n\n\n \nIn the early days of President Dona…",
    "link": "https://www.propublica.org/article/venezuelan-immigrant-cecot-release-story",
    "timestamp": "2025-07-29T09:00:00Z"
  },
  {
    "title": "Lawfully Present Immigrants Help Stabilize ACA Plans. Why Does the GOP Want Them Out?",
    "description": "The GOP’s tax and spending law and a new rule by the Centers for Medicare & Medicaid will make it harder to enroll in Affordable Care Act health plans, will raise consumers’ out-of-pocket costs, and could prompt younger, healthier people, including lawfully p…",
    "link": "https://kffhealthnews.org/news/article/column-covered-california-immigrants-stabilize-aca-marketplace-trump-health-policy/",
    "timestamp": "2025-07-29T09:00:00Z"
  },
  {
    "title": "Textile manufacturer Arvind posts profit jump as brands move away from China",
    "description": "Arvind, which counts Western brands such as Gap and H&M among its clients, posted a consolidated net profit of $6.13 million for the three months ended June 30",
    "link": "https://www.thehindubusinessline.com/companies/textile-manufacturer-arvind-posts-profit-jump-as-brands-move-away-from-china/article69868638.ece",
    "timestamp": "2025-07-29T08:57:52Z"
  },
  {
    "title": "Stephen Colbert Spots Moment Trump Got Played Right To His Face",
    "description": "The \"Late Show\" host said this world leader seems to know exactly how to handle the president.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-europe_n_688863a2e4b0a133962098c4",
    "timestamp": "2025-07-29T08:56:31Z"
  },
  {
    "title": "After firing chaplains for speaking out, Ohio hospital CEO warns others to keep quiet",
    "description": "In the middle of a national firestorm, the top executive of a venerable Ohio hospital last Thursday told employees that “misinformation and lack of context...",
    "link": "https://ohiocapitaljournal.com/2025/07/29/after-firing-chaplains-for-speaking-out-ohio-hospital-ceo-warns-others-to-keep-quiet/",
    "timestamp": "2025-07-29T08:55:17Z"
  },
  {
    "title": "‘Worst-case scenario of famine’ happening in Gaza, experts say",
    "description": "The \"worst-case scenario of famine is currently playing out in the Gaza Strip\", the leading international authority on food crises has said.",
    "link": "https://www.independent.ie/world-news/middle-east/worst-case-scenario-of-famine-happening-in-gaza-experts-say/a1378552048.html",
    "timestamp": "2025-07-29T08:54:47Z"
  },
  {
    "title": "Stephen Colbert mocks Trump’s bizarre Epstein comments",
    "description": "US president said he ‘never had the privilege’ of going to the convicted paedophile’s island",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/stephen-colbert-trump-epstein-b2797892.html",
    "timestamp": "2025-07-29T08:51:00Z"
  }
]