[
  {
    "title": "Trump adds fresh chaos and uncertainty to his flailing tariffs agenda",
    "description": "“I know what the hell I’m doing,” Donald Trump said last week, referring to trade tariffs. There's fresh evidence to the contrary.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/whiplash-trump-adds-fresh-chaos-uncertainty-flailing-tariffs-agenda-rcna201093",
    "timestamp": "2025-04-14T11:51:02Z"
  },
  {
    "title": "Trump Says \"Out Of Control\" CBS' 60 Minutes Should \"Lose License\"",
    "description": "Trump Says \"Out Of Control\" CBS' 60 Minutes Should \"Lose License\"\n \nLate Sunday night, President Donald Trump unleashed a Truth Social bomb, accusing CBS' 60 Minutes of routinely airing \"derogatory and defamatory\" stories about him — but said this weekend's b…",
    "link": "https://biztoc.com/x/491c0d35705394e4",
    "timestamp": "2025-04-14T11:50:32Z"
  },
  {
    "title": "Even as tech bosses swing to the right, almost 7-in-10 people in Silicon Valley vote against Trump",
    "description": "Like many in the tech industry, Jeremy Lyons used to think of himself as a relatively apolitical guy.\nThe only time he had participated in a demonstration before now was in the opening days of Donald Trump’s first presidential term, when he joined fellow Goog…",
    "link": "https://biztoc.com/x/79900ecb6de2c6de",
    "timestamp": "2025-04-14T11:50:30Z"
  },
  {
    "title": "Trans fencer speaks out after opponent refuses to play her: ‘My entire life is political’",
    "description": "A transgender fencer who was thrust into the centre of an anti-trans media storm when her cis opponent refused to compete against her has spoken out about the incident, declaring that there are “more important” things to talk about. Red Sullivan, a dual histo…",
    "link": "https://www.thepinknews.com/2025/04/14/trans-fencer-red-sullivan-stephanie-turner/",
    "timestamp": "2025-04-14T11:50:02Z"
  },
  {
    "title": "South Korea's DN Solutions opens books for $1 billion-plus IPO",
    "description": "SEOUL : South Korean industrial tools maker DN Solutions on Monday opened bookbuilding for an initial public offering of up to 1.6 trillion won ($1.1 billion), according to a filing, which could be the country's biggest listing in more than three years. The f…",
    "link": "https://www.channelnewsasia.com/business/south-koreas-dn-solutions-opens-books-1-billion-plus-ipo-5064771",
    "timestamp": "2025-04-14T11:50:01Z"
  },
  {
    "title": "Plans to celebrate America's 250th anniversary were underway until federal cuts",
    "description": "Leaders of state humanities councils throughout the country say federal funding cuts by President Donald Trump's administration will force them to scale back or eliminate celebrations next year commemorating the nation's 250th anniversary",
    "link": "https://abcnews.go.com/US/wireStory/plans-celebrate-americas-250th-anniversary-underway-federal-funding-120781557",
    "timestamp": "2025-04-14T11:47:46Z"
  },
  {
    "title": "Monday: Hili dialogue",
    "description": "Welcome to the new week: it’s Monday, April 14, 2025, and it’s National Pecan Day, which is exactly what I’ll feed my coterie of gray squirrels at Botany pond.  And the nut makes the world’s best pie: And it’s also World Quantum Day. Google has an animated Do…",
    "link": "https://whyevolutionistrue.com/2025/04/14/monday-hili-dialogue-513/",
    "timestamp": "2025-04-14T11:45:15Z"
  },
  {
    "title": "The White House claims Donald Trump is down to a svelte 224 lbs",
    "description": "During Donald Trump’s first term, his annual physical exams were huge news. To the point where the White House physician Ronny Jackson became a minor MAGA celebrity for lying his ass off about Trump’s weight and physical condition. Well, last Friday, Trump we…",
    "link": "https://www.celebitchy.com/917942/the_white_house_claims_donald_trump_is_down_to_a_svelte_224_lbs/",
    "timestamp": "2025-04-14T11:45:07Z"
  },
  {
    "title": "El Salvador's President Bukele to meet with Trump at White House",
    "description": "President Donald Trump is hosting Nayib Bukele, the president of El Salvador, at the White House on Monday as the small Central American nation becomes a critical lynchpin of the U.S. administration’s mass deportation operation.",
    "link": "https://www.fox5dc.com/news/el-salvador-president-bukele-meet-trump-white-house",
    "timestamp": "2025-04-14T11:44:47Z"
  },
  {
    "title": "5 things to know before the stock market opens Monday",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/04/14/5-things-to-know-before-the-stock-market-opens-monday-april-14.html",
    "timestamp": "2025-04-14T11:42:48Z"
  },
  {
    "title": "Zelenskyy Says JD Vance Is ‘Somehow Justifying’ Putin’s War In Ukraine",
    "description": "The Ukrainian president called on Donald Trump to visit his country before engaging in any further negotiations to end the conflict.",
    "link": "https://www.huffpost.com/entry/volodymyr-zelenskyy-calls-out-vance_n_67fcd5a9e4b0b88ef3cc54e4",
    "timestamp": "2025-04-14T11:41:25Z"
  },
  {
    "title": "Why are anti-Trump groups planning a protest in 50 US states on April 19? 10-point explainer",
    "description": "A massive protest has been planned by anti-Trump groups in all 50 States on April 19. 50501 is again calling for protests in all 50 states against the Trump administration after four days. The group stated that they want 3.5 percent of the U.S. population—mor…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/why-are-anti-trump-groups-planning-a-protest-in-50-us-states-on-april-19-10-point-explainer/articleshow/120279598.cms",
    "timestamp": "2025-04-14T11:40:43Z"
  },
  {
    "title": "Hungary’s Pride ban mocked with ‘Gray Pride’ march: ‘Humour exposes the absurd’",
    "description": "Members of the LGBTQ+ community gathered in Hungary’s capital Budpaest to mock the right-wing government’s recently passed law banning LGBTQ+ Pride marches. For weeks, protesters have staged demonstrations in Budapest against the legislation, with thousands o…",
    "link": "https://www.thepinknews.com/2025/04/14/hungary-budapest-lgbtq/",
    "timestamp": "2025-04-14T11:40:40Z"
  },
  {
    "title": "Kremlin comments on rumored Putin-Trump summit",
    "description": "Russia and the US do not have immediate plans for a leaders’ summit, Kremlin spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615733-peskov-trump-putin-meeting/",
    "timestamp": "2025-04-14T11:39:38Z"
  },
  {
    "title": "Can Mega-Philanthropy Fuel Trump's Efforts to Tackle the Housing Crisis? | Opinion",
    "description": "To what extent President Donald Trump will rally the ultra-wealthy to direct their philanthropy toward housing remains to be seen.",
    "link": "https://biztoc.com/x/a747f965b7f14516",
    "timestamp": "2025-04-14T11:39:14Z"
  },
  {
    "title": "Transcript: Trump Henchwoman Alina Habba’s Vile New Threat is Ominous",
    "description": "The following is a lightly edited transcript of the April 14 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresiden…",
    "link": "https://newrepublic.com/article/193949/transcript-trump-henchwoman-alina-habba-vile-new-threat-ominous",
    "timestamp": "2025-04-14T11:38:44Z"
  },
  {
    "title": "Why Trump's nuclear talks with Iran could be far more successful than Biden's",
    "description": "\"The Iranians are, I think, a little bit more desperate than they were in 2022, and they are faced with a very weak economy,\" one analyst told CNBC.",
    "link": "https://www.cnbc.com/2025/04/14/why-trumps-nuclear-talks-with-iran-could-be-far-more-successful-than-bidens.html",
    "timestamp": "2025-04-14T11:36:38Z"
  },
  {
    "title": "Donald Trump ignored Cheryl Hines as she tried to shake his hand",
    "description": "Richard Nixon and Ronald Reagan were both Californians, and during their presidencies, they maintained “Western White Houses” in California. With Donald Trump, he has a “Florida White House,” aka the Mar-a-Lago compound where all of the MAGAts fall all over t…",
    "link": "https://www.celebitchy.com/917851/donald_trump_ignored_cheryl_hines_as_she_tried_to_shake_his_hand/",
    "timestamp": "2025-04-14T11:35:24Z"
  },
  {
    "title": "South Africa appoints a special US envoy after its ambassador was expelled",
    "description": "South African President Cyril Ramaphosa has appointed a former deputy finance minister as a special envoy to the United States after the ambassador was expelled last month",
    "link": "https://abcnews.go.com/International/wireStory/south-africa-appoints-special-us-envoy-after-ambassador-120781559",
    "timestamp": "2025-04-14T11:34:46Z"
  },
  {
    "title": "El Salvador’s Bukele Meets Trump in D.C.",
    "description": "“President Nayib Bukele of El Salvador is heading to Washington on Monday to meet with US President Donald Trump, solidifying his central role in the U.S. president’s mass deportation efforts,” Semafor reports. “Over the last",
    "link": "https://politicalwire.com/2025/04/14/el-salvadors-bukele-meets-trump-in-d-c/",
    "timestamp": "2025-04-14T11:34:45Z"
  },
  {
    "title": "Majority Leader John Thune's 'old-fashioned' approach to the Senate has kept Trump on board so far",
    "description": "The Senate has produced the quickest top-level Cabinet confirmation process in the last 20 years under new Majority Leader John Thune of South Dakota",
    "link": "https://abcnews.go.com/US/wireStory/majority-leader-john-thunes-fashioned-approach-senate-trump-120780676",
    "timestamp": "2025-04-14T11:34:26Z"
  },
  {
    "title": "Morning Joe’s Jonathan Lemire Slams Trump Envoy for ‘Saluting’ Putin Ahead of Deadly Missile Attack: ‘Putin Is Playing Them!’",
    "description": "Morning Joe host Jonathan Lemire slammed President Donald Trump’s special envoy Steve Witkoff for “saluting” Russian strongman Vladimir Putin in a Friday meeting in Saint Petersburg, just hours before the Kremlin ordered a deadly missile attack on Ukraine – a…",
    "link": "https://www.mediaite.com/tv/morning-joes-jonathan-lemire-slams-trump-envoy-for-saluting-putin-ahead-of-deadly-missile-attack-putin-is-playing-them/",
    "timestamp": "2025-04-14T11:33:58Z"
  },
  {
    "title": "Bill Maher Describes His Dinner With Donald Trump",
    "description": "Maher's meeting with Trump was organized by Kid Rock.",
    "link": "https://www.adweek.com/tvnewser/bill-maher-donald-trump-white-house-visit/",
    "timestamp": "2025-04-14T11:33:54Z"
  },
  {
    "title": "Trump Recognizes Start of Holy Week: 'History Was Forever Changed' By Resurrection of Jesus Christ",
    "description": "President Donald Trump recognized the start of Holy Week and Jesus Christ's Crucifixion and Resurrection, noting \"History was forever changed\" in the moment of Jesus Christ's Resurrection.\nThe post Trump Recognizes Start of Holy Week: ‘History Was Forever Cha…",
    "link": "https://www.breitbart.com/faith/2025/04/14/trump-recognizes-start-of-holy-week-history-was-forever-changed-by-resurrection-of-jesus-christ/",
    "timestamp": "2025-04-14T11:32:17Z"
  },
  {
    "title": "Goldman Sachs' profit jumps as traders deliver gains",
    "description": "Goldman Sachs reported a 15% rise in first-quarter profit as market volatility led to record revenue in equities trading and boosted fixed income results...",
    "link": "https://finance.yahoo.com/news/goldman-sachs-profit-jumps-traders-113137425.html",
    "timestamp": "2025-04-14T11:31:37Z"
  },
  {
    "title": "Trump blinked on smartphones tariffs. Can India still seize the moment?",
    "description": "The US had to take a sharp U-turn on tariffs on technological goods, including smartphones, due to its heavy reliance on China. How will India benefit from the latest move?",
    "link": "https://www.livemint.com/industry/manufacturing/trump-blinked-on-smartphones-tariffs-can-india-still-seize-the-moment-11744627094353.html",
    "timestamp": "2025-04-14T11:31:29Z"
  },
  {
    "title": "Zelenskyy pleads with Trump to visit Ukraine after deadly Russian missile attack",
    "description": "Zelenskyy urged Trump to visit Ukraine to “understand what Putin did,” after a Russian missile attack in the city of Sumy killed 34 people and injured 119.",
    "link": "https://www.nbcnews.com/world/europe/zelenskyy-urges-trump-visit-ukraine-russian-missile-attack-ukrainian-c-rcna201087",
    "timestamp": "2025-04-14T11:30:59Z"
  },
  {
    "title": "Dogecoin Gears Up For A Breakout To $0.29: Can Bulls Hold Key Support?",
    "description": "After enduring weeks of heavy selling pressure and bearish sentiment, Dogecoin is beginning to show signs of stability. The broader crypto market is hinting at a potential recovery, though many analysts argue this could simply be a relief rally within a longe…",
    "link": "http://www.newsbtc.com/news/dogecoin/dogecoin-gears-up-for-a-breakout-to-0-29-can-bulls-hold-key-support/",
    "timestamp": "2025-04-14T11:30:51Z"
  },
  {
    "title": "Suspected US airstrikes kill at least 7 people in Yemen, Houthi rebels say",
    "description": "Recent US airstrikes near Sanaa, Yemen, resulted in casualties. Houthis reported seven deaths and 29 injuries. They also claimed to have shot down another US drone. This is the fourth drone downed in two weeks. The US military has not acknowledged the strikes…",
    "link": "https://economictimes.indiatimes.com/news/defence/suspected-us-airstrikes-kill-at-least-7-people-in-yemen-houthi-rebels-say/articleshow/120279638.cms",
    "timestamp": "2025-04-14T11:30:38Z"
  },
  {
    "title": "World markets advance as tech shares get lift from exemption of US tariffs on electronics",
    "description": "Wall Street was poised to add to last week’s gains when markets open on Monday as investors juggle incoming corporate earnings along with possible tariff updates.",
    "link": "https://www.news4jax.com/business/2025/04/14/asian-markets-rally-after-wall-street-ends-higher-in-the-chaotic-and-historic-week/",
    "timestamp": "2025-04-14T11:30:34Z"
  },
  {
    "title": "On ABC’s ‘This Week,’ a rare honest answer led to more confusion, not less",
    "description": "Sunday morning news shows — CBS’s “Face the Nation,” NBC’s “Meet the Press,” ABC’s “This Week,” CNN’s “State of the Union” and “Fox News Sunday,” to name a few — […]\nThe post On ABC’s ‘This Week,’ a rare honest answer led to more confusion, not less appeared …",
    "link": "https://www.poynter.org/commentary/2025/sunday-shows-trump-tariffs-this-week-lutnick-karl/",
    "timestamp": "2025-04-14T11:30:15Z"
  },
  {
    "title": "Can Mega-Philanthropy Fuel Trump's Efforts to Tackle the Housing Crisis? | Opinion",
    "description": "To what extent President Donald Trump will rally the ultra-wealthy to direct their philanthropy toward housing remains to be seen.",
    "link": "https://www.newsweek.com/can-mega-philanthropy-fuel-trumps-efforts-tackle-housing-crisis-opinion-2058321",
    "timestamp": "2025-04-14T11:30:01Z"
  },
  {
    "title": "Next Round of U.S.-Iran Nuclear Talks Are Set to Continue in Rome",
    "description": "The bilateral talks appeared ready Monday to leave the Middle East, an Italian source said.",
    "link": "https://time.com/7277551/us-iran-nuclear-talks-rome/",
    "timestamp": "2025-04-14T11:29:48Z"
  },
  {
    "title": "How Much Will Rocket Lab Get From the Space Force?",
    "description": "In This Article:\nFrom April 2 to April 8, the S&P 500 index fell by more than 12% in response to President Donald Trump's imposition of steep \"reciprocal tariffs\" on imports from nearly every country around the world. The market surged back by 9.5% after Trum…",
    "link": "https://biztoc.com/x/9ecdb03b8c525382",
    "timestamp": "2025-04-14T11:28:47Z"
  },
  {
    "title": "Trump Says He’s ‘Honored’ to Be Suing ‘60 Minutes’ and CBS in Latest Truth Social Rant, Urges FCC to ‘Impose Maximum Fines and Punishment’",
    "description": "President Donald Trump has once again slammed “60 Minutes” and CBS in a rant on Truth Social amid his $20 billion lawsuit over the news program’s pre-election interview with Kamala Harris. In a post on Sunday night, Trump lashed out about the latest “60 Minut…",
    "link": "https://variety.com/2025/politics/news/trump-honored-sue-60-minutes-cbs-urges-fcc-maximum-fines-1236368760/",
    "timestamp": "2025-04-14T11:26:15Z"
  },
  {
    "title": "'Asleep at the wheel': Michigan city braces for impact of Trump's tariffs",
    "description": "Just north of downtown Flint, Mich., is building known for its rich history here of the American automobile industry. The factory, the birthplace of General Motors, still stands as a beacon of innovation.",
    "link": "https://www.cbc.ca/news/canada/windsor/michigan-city-braces-for-trump-tariff-1.7509450",
    "timestamp": "2025-04-14T11:26:03Z"
  },
  {
    "title": "This Easter, American Christians Should Embrace Persecution",
    "description": "American Christians this Holy Week should expect and embrace persecution as a blessing, accepting martyrdom in its varying forms.",
    "link": "https://thefederalist.com/2025/04/14/this-easter-american-christians-should-embrace-persecution/",
    "timestamp": "2025-04-14T11:26:01Z"
  },
  {
    "title": "SCOTUS’ Timidity Triggers Constitutional Crisis",
    "description": "The Supreme Court’s continuing failure to define lower courts' authority is wreaking havoc on the reputation of the courts — and our constitutional order.",
    "link": "https://thefederalist.com/2025/04/14/scotus-timidity-triggers-constitutional-crisis/",
    "timestamp": "2025-04-14T11:24:41Z"
  },
  {
    "title": "Sony hikes PlayStation 5 price by 25% as Trump tariff war sends jitters: PS5 price in India to change?",
    "description": "According to the press release by the Japanese company, the new Sony PS5 prices will come into effect from April 14, Monday. Sony said that the prices of PS5 have been increased amid a ‘challenging economic environment’, without directly naming Donald Trump's…",
    "link": "https://www.livemint.com/companies/news/sony-hike-playstation-5-price-by-25-per-cent-as-donald-trump-tariff-war-ps5-price-india-change-australia-europe-uk-nz-11744627617022.html",
    "timestamp": "2025-04-14T11:23:05Z"
  },
  {
    "title": "Mike Johnson Weighs in on Tax Change for America's Wealthiest",
    "description": "The House Speaker said he was not in favor of a proposed 39 to 40 percent tax rate that would affect those earning $1 million.",
    "link": "https://www.newsweek.com/mike-johnson-tax-hike-millionaires-trump-agenda-2059355",
    "timestamp": "2025-04-14T11:22:41Z"
  },
  {
    "title": "Maine AG swipes Trump administration over judge's funding-freeze ruling amid trans athlete battle",
    "description": "Maine Attorney General Aaron Frey took a shot at the Trump administration on Friday after a judge granted the state a temporary restraining order on Friday.",
    "link": "https://www.foxnews.com/sports/maine-ag-swipes-trump-administration-over-judges-funding-freeze-ruling-amid-trans-athlete-battle",
    "timestamp": "2025-04-14T11:22:16Z"
  },
  {
    "title": "Trump’s tariffs: A 90-day Golgotha with all scenarios open",
    "description": "Trump's suspension of tariffs gives time for negotiations, but no one is optimistic - Hypersensitive markets move from limit-down to limit-up - The most dangerous game is the US-China clash - What does one country import from the other and which corporate gia…",
    "link": "https://en.protothema.gr/2025/04/14/trumps-tariffs-a-90-day-golgotha-with-all-scenarios-open/",
    "timestamp": "2025-04-14T11:20:03Z"
  },
  {
    "title": "After CBS aired two 60 Minutes segments, Trump calls on CBS to lose its license and asks FCC Chairman Brendan Carr to \"impose the maximum fines and punishment\" (Ted Johnson/Deadline)",
    "description": "Ted Johnson / Deadline:\nAfter CBS aired two 60 Minutes segments, Trump calls on CBS to lose its license and asks FCC Chairman Brendan Carr to “impose the maximum fines and punishment”  —  Donald Trump again lashed out at 60 Minutes, this time angry over two s…",
    "link": "https://mediagazer.com/250414/p3",
    "timestamp": "2025-04-14T11:20:01Z"
  },
  {
    "title": "Indian stock investors lost Rs 11.30 lakh crore since tariff announcement",
    "description": "Investors' wealth eroded by Rs 11.30 lakh crore since early this month, where the BSE benchmark Sensex tumbled nearly 2 per cent, as stock markets experienced turbulence in recent times initially due to US President Donald Trump unveiling a massive tariff pla…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-stock-investors-lost-rs-11-30-lakh-crore-since-tariff-announcement/articleshow/120279235.cms",
    "timestamp": "2025-04-14T11:19:07Z"
  },
  {
    "title": "Treasury yields fall after a wild week as traders assess unexpected U.S. tariff exemptions",
    "description": "U.S. Treasury yields inched lower on Monday as investors weighed a surprise tariff exemption and remained cautious about uncertainty in the bond market.",
    "link": "https://www.cnbc.com/2025/04/14/us-treasury-yields-investors-weigh-unexpected-tariff-exemptions.html",
    "timestamp": "2025-04-14T11:18:07Z"
  },
  {
    "title": "Analysts revisit Apple stock price target as Trump offers tariff relief",
    "description": "Apple shares powered higher in early Monday trading following a weekend move by President Donald Trump to offer tariff temporary tariff relief to the tech sector by limiting duties on China-made components until a broader schedule of levies is fully completed…",
    "link": "https://biztoc.com/x/bd26a722885469c9",
    "timestamp": "2025-04-14T11:17:24Z"
  },
  {
    "title": "'More uncertainty, more mixed messaging': WH can't seem to get story straight on tariffs",
    "description": "President Donald Trump on Sunday said he would be announcing the tariff rate on imported semiconductors over the next week, adding that there would be flexibility with some companies in the sector. The Morning Joe panel discusses the mixed messaging and confu…",
    "link": "https://biztoc.com/x/45a6fc17833a681e",
    "timestamp": "2025-04-14T11:17:19Z"
  },
  {
    "title": "Analysis: Why the Gulf won’t pick a side in the trade war",
    "description": "Omar’s view\nUS President Donald Trump is trying to forge a new economic world order. His attempt to redraw the map of global trade — forcing nations to choose between Washington and Beijing — poses a threat to the Gulf, which is deeply embedded in Asian suppl…",
    "link": "https://biztoc.com/x/c08e67969ab52380",
    "timestamp": "2025-04-14T11:17:10Z"
  },
  {
    "title": "Selected Articles: A Real Economic Solution to the Billionaire-created Economic Crisis",
    "description": "A Real Economic Solution to the Billionaire-created Economic Crisis. Emanuel Pastreich\nBy Emanuel Pastreich, April 13, 2025\nThe puppet-class of politicians cannot come up with a solution to the looming economic crisis that threatens to destroy just about ever…",
    "link": "https://www.globalresearch.ca/selected-articles-real-economic-solution-billionaire-created-economic-crisis/5884385",
    "timestamp": "2025-04-14T11:16:11Z"
  },
  {
    "title": "Gold falls from record high but holds above $3,200 on tariff jitters",
    "description": "Gold prices fell from a record high on Monday after U.S. President Donald Trump excluded smartphones and computers from his reciprocal tariffs, although uncertainty around tariff plans kept prices above the significant $3,200 per ounce level.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-falls-from-record-high-but-holds-above-3200-on-tariff-jitters/articleshow/120279184.cms",
    "timestamp": "2025-04-14T11:15:58Z"
  },
  {
    "title": "Crypto Daybook Americas: A Bizarre $5.4B Loss Has Left Investors Devastated",
    "description": "The day ahead in crypto: April 14, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/04/14/crypto-daybook-americas-a-bizarre-usd5-4b-loss-has-left-investors-devastated",
    "timestamp": "2025-04-14T11:15:50Z"
  },
  {
    "title": "Carney and Poilievre cross paths on popular Quebec talk show",
    "description": "Liberal and Conservative leaders Mark Carney and Pierre Poilievre presented two different characters on Radio-Canada, Sunday.",
    "link": "https://nationalpost.com/news/politics/federal_election/carney-and-poilievre-cross-paths-on-popular-quebec-talk-show",
    "timestamp": "2025-04-14T11:14:29Z"
  },
  {
    "title": "Intolerant Liberals Lose Their Minds Over John Stamos",
    "description": "<p>Actor John Stamos was emcee of a charity event at Mar-a-Lago, which is owned by President Donald Trump. Progressives couldn't handle it.</p>",
    "link": "https://www.realclearpolitics.com/2025/04/14/intolerant_liberals_lose_their_minds_over_john_stamos_644770.html",
    "timestamp": "2025-04-14T11:14:28Z"
  },
  {
    "title": "Dissident pushes for change in Cuba, one ladle at a time",
    "description": "SANTIAGO DE CUBA, Cuba (Reuters) - Jose Daniel Ferrer stepped onto his front porch in Santiago de Cuba on a recent morning, shaking hands and asking after people's health as he greeted a small crowd of the ailing and elderly gathered at his doorstep. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/04/14/dissident-pushes-for-change-in-cuba-one-ladle-at-a-time",
    "timestamp": "2025-04-14T11:14:00Z"
  },
  {
    "title": "Arson at Gov. Josh Shapiro's residence and all-female crew aboard Blue Origin rocket: Morning Rundown",
    "description": "Pace of Trump’s 2nd term causes confusion. Suspect in Pa. Gov. Josh Shapiro’s residence arson is charged. Katy Perry, Gayle King head to space on Blue Origin.",
    "link": "https://www.nbcnews.com/news/us-news/arson-josh-shapiro-residence-female-blue-origin-flight-morning-rundown-rcna201084",
    "timestamp": "2025-04-14T11:12:40Z"
  },
  {
    "title": "\"US Visa Holders Cannot Use The First Amendment...\": Secretary Of State",
    "description": "US Secretary of State Marco Rubio cautioned US visa holders that visiting America is not their entitlement, but a privilege extended by the US government to those who have respect for the law.",
    "link": "https://www.ndtv.com/world-news/us-visa-holders-cannot-use-the-first-amendment-secretary-of-state-marco-rubio-8161733",
    "timestamp": "2025-04-14T11:12:16Z"
  },
  {
    "title": "China’s Xi Jinping Sends Trump a Message as His Trade War Spirals",
    "description": "Xi Jinping has warned there will be “no winners” from Donald Trump’s trade war as the Chinese president embarks on a diplomatic tour of Southeast Asia this...",
    "link": "https://www.thedailybeast.com/chinas-xi-jinping-sends-donald-trump-a-message-as-his-trade-war-spirals/",
    "timestamp": "2025-04-14T11:10:58Z"
  },
  {
    "title": "Zelenskyy claims 'Russian narratives are prevailing' in US during '60 Minutes' interview",
    "description": "Ukrainian President Volodymyr Zelenskyy said Russia’s narrative around its war with Ukraine was \"prevailing\" in the U.S. and the Trump administration during an interview on \"60 Minutes\" Sunday night. Zelenskyy told correspondent Scott Pelley about his thought…",
    "link": "https://freerepublic.com/focus/f-news/4310888/posts",
    "timestamp": "2025-04-14T11:08:23Z"
  },
  {
    "title": "Europe and US divided after Russian strike kills 31 in Ukraine",
    "description": "The News\nA Russian missile attack which killed 31 civilians in the Ukrainian city of Sumy underscored the West’s divisions over the war. \nLeaders of the European Union, France, Germany, and the UK condemned the strike, calling it a “war crime” and “barbaric.”…",
    "link": "https://biztoc.com/x/62402ba730febf08",
    "timestamp": "2025-04-14T11:06:38Z"
  },
  {
    "title": "Zelensky Issues World War 3 Warning to Donald Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nUkrainian President Volodymyr Zelensky on Sunday warned of the risk of World War III as he urged President Donald Trump to visit Ukraine before making any decisions about peace negotiations aimed at ending the…",
    "link": "https://biztoc.com/x/08f1fd8c1a0babc5",
    "timestamp": "2025-04-14T11:06:36Z"
  },
  {
    "title": "Global stocks rise, but Trump tariff reprieve in doubt",
    "description": "The News\nGlobal stocks rose after US President Donald Trump announced many electronics would be exempt from tariffs, but mixed signals on American trade policy suggested the relief may be short-lived. \nUS stock futures also gained after officials said smartph…",
    "link": "https://biztoc.com/x/d69460d97dfbec81",
    "timestamp": "2025-04-14T11:06:17Z"
  },
  {
    "title": "Donald Trump’s 29-year-old crypto guru lays out the president’s plans for regulating crypto and rolling back a Biden-era crackdown",
    "description": "When Donald Trump hosted the first-ever White House crypto summit in March, he was surrounded by some of his top advisors in the elegant State Dining Room. To his right at the cloth-draped table was Treasury Secretary Scott Bessent, and to his left was his cr…",
    "link": "https://biztoc.com/x/963b45bd91b20a81",
    "timestamp": "2025-04-14T11:06:15Z"
  },
  {
    "title": "El Salvador’s Bukele meets Trump in DC",
    "description": "The News\nPresident Nayib Bukele of El Salvador is heading to Washington on Monday to meet with US President Donald Trump, solidifying his central role in the US president’s mass deportation efforts. \nOver the last few months, the Trump administration has sent…",
    "link": "https://biztoc.com/x/d88c6d66df76edee",
    "timestamp": "2025-04-14T11:06:09Z"
  },
  {
    "title": "Crypto 'Bromance' Brewing? Trump To Meet Bitcoin President Nayib Bukele",
    "description": "Trump is set to host El Salvador's Bukele at the White House on Monday, with many crypto users expecting the leaders to discuss Bitcoin at some point in the meeting, given the latter's pro-$BTC stance and the U.S. president's recent embrace of crypto.",
    "link": "https://www.ibtimes.com/crypto-bromance-brewing-trump-meet-bitcoin-president-nayib-bukele-3769956",
    "timestamp": "2025-04-14T11:06:02Z"
  },
  {
    "title": "Trump’s senior crypto advisor donated $1M in campaign advertisements to top Trump Super PAC one week before election",
    "description": "When President Donald Trump announced that he had tapped 29-year-old Bo Hines for a prized role advising his ambitious crypto agenda, the blockchain industry was thrown off guard. Hines, a two-time Republican congressional candidate, had never held a formal b…",
    "link": "https://biztoc.com/x/2ad81cc60b90a88d",
    "timestamp": "2025-04-14T11:05:55Z"
  },
  {
    "title": "Trump Escalates Trade Fight With China, Citing National Security Concerns Over Chips",
    "description": "Trump plans new semiconductor tariffs on China, citing national security and pushing for U.S. chip production.",
    "link": "https://www.ibtimes.com/trump-escalates-trade-fight-china-citing-national-security-concerns-over-chips-3769991",
    "timestamp": "2025-04-14T11:04:14Z"
  },
  {
    "title": "Disappear Here: TABS, Mon., April 14, 2025",
    "description": "Monday morning roundup of news and things to read and watch!",
    "link": "https://www.wonkette.com/p/disappear-here-tabs-mon-april-14",
    "timestamp": "2025-04-14T11:03:00Z"
  },
  {
    "title": "U.S. Tariff Exemption for Tech Sector Is Temporary Reassurance for Apple Investors",
    "description": "Follow the latest news and analysis on President Donald Trump's tariffs.",
    "link": "https://www.barrons.com/livecoverage/trump-tariffs-us-china-news-0414",
    "timestamp": "2025-04-14T11:02:50Z"
  },
  {
    "title": "Zelensky Issues World War 3 Warning to Donald Trump",
    "description": "\"It is not just idle speculation; the threat is real,\" warned Ukrainian President Volodymyr Zelensky.",
    "link": "https://www.newsweek.com/zelensky-world-war-3-donald-trump-2059370",
    "timestamp": "2025-04-14T11:02:41Z"
  },
  {
    "title": "Trump appears to backtrack on US electronics tariff exceptions, but no one seems to know exactly what's going on",
    "description": "US president Donald Trump has effectively backtracked on the tariff exemptions announced last Friday which indicated that some electronics, like PCs, would escape the country's 145 percent levy on Chinese goods.\n Read more",
    "link": "https://www.eurogamer.net/trump-appears-to-backtrack-on-us-electronics-tariff-exceptions-but-no-one-seems-to-know-exactly-whats-going-on",
    "timestamp": "2025-04-14T11:01:53Z"
  },
  {
    "title": "Sanders and AOC Draw Crowd of 20,000+ in Utah—A State Trump Won by Over 20 Points",
    "description": "Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez drew a crowd of more than 20,000 people in Salt Lake City, Utah on Sunday for the latest stop on the progressive duo's \"Fight Oligarchy\" tour, which has attracted \nenergized audiences across the United Sta…",
    "link": "https://www.commondreams.org/news/sanders-ocasio-cortez-utah",
    "timestamp": "2025-04-14T11:01:44Z"
  },
  {
    "title": "NASA Jettisons Ex-DEI Chief After Failing to Rebrand Effort to Evade Trump Order",
    "description": "Meanwhile, the Jet Propulsion Laboratory has some great projects lined up for 2025, which will likely be more successful without DEI interference.\nThe post NASA Jettisons Ex-DEI Chief After Failing to Rebrand Effort to Evade Trump Order first appeared on Le·g…",
    "link": "https://legalinsurrection.com/2025/04/nasa-jettisons-ex-dei-chief-after-failing-to-rebrand-effort-to-evade-trump-order/",
    "timestamp": "2025-04-14T11:00:53Z"
  },
  {
    "title": "First on Fox: Republican launches second straight bid to flip Democrat-held Senate seat in key battleground",
    "description": "Former Rep. Mike Rogers, who was the GOP Senate nominee in Michigan, is launching a second straight Republican run for the Senate in the crucial Great Lakes battleground state.",
    "link": "https://www.foxnews.com/politics/first-fox-republican-launches-second-straight-bid-flip-democrat-held-senate-seat-key-battleground",
    "timestamp": "2025-04-14T11:00:53Z"
  },
  {
    "title": "How to Make Friends and Influence POTUS",
    "description": "MIT SMR | Getty Images It’s not hard to like the president when he’s announcing a $500 billion plan to fund your technology startup. OpenAI CEO Sam Altman, once a critic of President Donald Trump, recently stood side by side with him to announce Project Starg…",
    "link": "https://sloanreview.mit.edu/article/how-to-make-friends-and-influence-potus/",
    "timestamp": "2025-04-14T11:00:52Z"
  },
  {
    "title": "Democrats still haven't learned one important lesson from the 2024 election",
    "description": "Despite losing the 2024 presidential election, Democrats are failing to learn a critical lesson and are continuing to try and strip parents of their rights.",
    "link": "https://www.foxnews.com/opinion/democrats-still-havent-learned-one-important-lesson-from-2024-election",
    "timestamp": "2025-04-14T11:00:42Z"
  },
  {
    "title": "How Laura Kim and Fernando Garcia Stay in Fashion",
    "description": "Designing spacesuits for Lauren Sanchez and gowns inspired by smart toilets are all in a day’s work for the Oscar de la Renta and Monse designers.",
    "link": "http://www.thecut.com/article/how-laura-kim-and-fernando-garcia-stay-in-fashion.html",
    "timestamp": "2025-04-14T11:00:41Z"
  },
  {
    "title": "Intel nears deal to sell Altera chip unit to PE group Silver Lake",
    "description": "Sale is part of plan by the company to divest non-core assets",
    "link": "https://www.irishtimes.com/business/2025/04/14/intel-nears-deal-to-sell-altera-chip-unit-to-pe-group-silver-lake/",
    "timestamp": "2025-04-14T11:00:38Z"
  },
  {
    "title": "These Political Thrillers Are Hitting A Little Too Close To Home",
    "description": "“G20,” “Zero Day” and other recent offerings have depicted aspects of our current administration’s chaos in far too timely ways.",
    "link": "https://www.huffpost.com/entry/political-thrillers-2025-trump-politics_n_67f6d8cee4b01be203959d22",
    "timestamp": "2025-04-14T11:00:30Z"
  },
  {
    "title": "Trump's 13th week in office expected to include tariff negotiation blitz, visit from El Salvador leader",
    "description": "President Donald Trump's 13th week back in the Oval Office is expected to again heavily focus on tariffs after putting a 90-day pause on customized tariffs.",
    "link": "https://www.foxnews.com/politics/trumps-13th-week-office-expected-include-tariff-negotiation-blitz-visit-from-el-salvador-leader",
    "timestamp": "2025-04-14T11:00:11Z"
  },
  {
    "title": "U.S. Aid Cuts Leave Ukraine's Media Defenseless Against Kremlin Lies | Opinion",
    "description": "By pulling media funding, the West is helping the Kremlin.",
    "link": "https://www.newsweek.com/us-aid-cuts-leave-ukraines-media-defenseless-against-kremlin-lies-opinion-2058177",
    "timestamp": "2025-04-14T11:00:01Z"
  },
  {
    "title": "Coachella crowd feels the Bern at Clairo’s set",
    "description": "The Independent Vermont senator took the opportunity to speak to the crowd about the importance of fighting for ‘economic justice, social justice, and racial justice’",
    "link": "https://www.dazeddigital.com/life-culture/article/66588/1/bernie-sanders-introduced-clairo-at-coachella-justice-speech?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=coachella-crowd-feels-the-bern-at-clairo-s-set",
    "timestamp": "2025-04-14T11:00:00Z"
  },
  {
    "title": "GOP former Rep. Mike Rogers launches another Michigan Senate run",
    "description": "Former Rep. Mike Rogers, R-Mich., launched another campaign for Senate on Monday, the first major Republican candidate to jump into the race.",
    "link": "https://www.nbcnews.com/politics/congress/former-gop-rep-mike-rogers-launches-another-michigan-senate-run-rcna201072",
    "timestamp": "2025-04-14T11:00:00Z"
  },
  {
    "title": "‘Turo destroyed a lot of people’: Car dealer walks into Bank of America repo lot. Then he sees a brand-new Chevy Tahoe",
    "description": "Since 2020 the car market has been rocked by one problem after another. First it was a lack of stock, then parts, then supply. All of this causes prices to shoot up. Along with rising prices also came the lack of quality.\n\n\nWith owners complaining about trans…",
    "link": "https://www.dailydot.com/news/bank-of-america-repo-lot/",
    "timestamp": "2025-04-14T11:00:00Z"
  },
  {
    "title": "Meals on Wheels facing uncertain future amid HHS restructure, rumors of Musk cuts",
    "description": "Jenny Young, Meals on Wheels America's chief of staff, said already-stretched local programs would struggle to cope with funding cuts.",
    "link": "https://www.snopes.com//news/2025/04/14/meals-on-wheels-hhs-musk/",
    "timestamp": "2025-04-14T11:00:00Z"
  },
  {
    "title": "St. Louis beer, coffee and whiskey makers prepare for Trump's tariffs. Your tab may rise.",
    "description": "Some St. Louis-area businesses are switching up their plans in response to the tight economy and looming trade wars.",
    "link": "https://www.stltoday.com/news/local/business/article_981577aa-ef9d-49b0-8c2e-c994b654c503.html",
    "timestamp": "2025-04-14T11:00:00Z"
  },
  {
    "title": "Pentagon Considers Cutting Its Sexual Assault Rules",
    "description": "On the chopping block is the Sexual Assault Prevention and Response program, which tracks sexual violence in the military and supports victims.\nThe post Pentagon Considers Cutting Its Sexual Assault Rules appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/14/pentagon-trump-sexual-assault-violence-military/",
    "timestamp": "2025-04-14T11:00:00Z"
  },
  {
    "title": "Calgary Confederation could be bellwether for Liberal fortunes in 2025 election",
    "description": "With the Conservative and Liberal parties introducing new candidates to the riding in the last few weeks, a lot of uncertainty has been added into an area that has typically gone blue in the past.",
    "link": "https://www.cbc.ca/news/canada/calgary/calgary-confederation-could-be-bellwether-for-liberal-fortunes-in-2025-election-1.7509216",
    "timestamp": "2025-04-14T11:00:00Z"
  },
  {
    "title": "Fed Official Confirms Trump Tariff Bailout Is Ready Amid $30 Trillion Market ‘Panic’ Warning",
    "description": "A top Federal Reserve official has said it “would absolutely be prepared\" to step in to rescue markets if Trump’s trade war threatens the financial system...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/04/14/top-fed-official-confirms-the-bank-is-ready-to-bail-out-trump/",
    "timestamp": "2025-04-14T10:59:33Z"
  },
  {
    "title": "Trump statue erected at his golf club (VIDEO)",
    "description": "‘The Defiance Monument’ has been gifted to the US president by a CEO Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615732-trump-monument-golf-florida/",
    "timestamp": "2025-04-14T10:58:40Z"
  },
  {
    "title": "World unites in praise of McIlroy after momentous Masters triumph",
    "description": "Rory McIlroy's triumph at the Masters on Sunday was hailed on both sides of the Atlantic as the 35-year-old Northern Irishman became the first European men's player to complete a career grand slam of golf's majors.McIlroy completed an extraordinary final day …",
    "link": "https://www.channelnewsasia.com/sport/world-unites-praise-mcilroy-after-momentous-masters-triumph-5064701",
    "timestamp": "2025-04-14T10:56:43Z"
  },
  {
    "title": "Links 4/14/2025",
    "description": "More \"Liberation Day\" fallout, AI in a nuclear plant, \"The Joker\" beats the Texas Lottery, and cholera linked to holy water.",
    "link": "https://www.nakedcapitalism.com/2025/04/links-4-14-2025.html",
    "timestamp": "2025-04-14T10:55:26Z"
  },
  {
    "title": "Inside the crypto industry’s Faustian bargain with President Trump",
    "description": "The crypto industry found its champion in Donald Trump. Once a skeptic of blockchain, Trump embraced the sector after companies like Coinbase and Ripple donated tens of millions of dollars to elect pro-crypto candidates during the last election cycle. Trump b…",
    "link": "https://biztoc.com/x/a1e2abfb538c08f7",
    "timestamp": "2025-04-14T10:55:07Z"
  },
  {
    "title": "Trump \"doesn't give a damn\" about anti-semitism",
    "description": "This seems right: “Donald Trump doesn’t give a damn about antisemitism. If he did, he wouldn’t be dining with known antisemites,” Yohnka said. “What Donald Trump cares about is power and nobody criticizing him, and he realizes that academic institutions...",
    "link": "https://leiterreports.typepad.com/blog/2025/04/trump-doesnt-give-a-damn-about-anti-semitism.html",
    "timestamp": "2025-04-14T10:55:00Z"
  },
  {
    "title": "Today’s ‘Death Squad’ Dems Enable the Trump-Backed Slaughter in Yemen, Gaza, and Beyond",
    "description": "On March 15, National Security Adviser Michael Waltz informed fellow Trump Administration officials through their now-infamous Signal chat that a U.S. missile attack had resulted in the collapse of an apartment building filled with Yemeni civilians. Vice Pres…",
    "link": "https://progressive.org/latest/the-silence-of-the-dems-zunes-20250411/",
    "timestamp": "2025-04-14T10:54:02Z"
  }
]