[
  {
    "title": "Amber Ruffin Dropped From Hosting White House Correspondents Dinner After Podcast Appearance",
    "description": "\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work,\" WHCA says after dropping comedian",
    "link": "http://www.rollingstone.com/politics/politics-news/amber-ruffin-dropped-white-house-correspondents-dinner-1235306421/",
    "timestamp": "2025-03-29T19:52:59Z"
  },
  {
    "title": "Maddow: Trump Sows Animosity and Mistrust Abroad, Degrading Americans in the Process: \"This Is Shameful\"",
    "description": "Rufus Gifford, former U.S. ambassador to Denmark, talks with Rachel Maddow about the animosity and mistrust Donald Trump is sowing among even allied nations, and the shock of betrayal people around the world are feeling about Americans they'd previously held …",
    "link": "https://littlegreenfootballs.com/article/54492_Maddow-_Trump_Sows_Animosity_a",
    "timestamp": "2025-03-29T19:50:52Z"
  },
  {
    "title": "'Controversy swirled': NYT spills about 'unhappy' Trump's behind-the-scenes firing dilemma",
    "description": "Donald Trump has insisted he's standing behind his team in the wake of the Signal attack plans scandal, but a new report suggests there's been much more turmoil about it.U.S. National Security Advisor Mike Waltz was put in the hot seat after he added a report…",
    "link": "https://www.rawstory.com/trump-behind-the-scenes-waltz/",
    "timestamp": "2025-03-29T19:50:29Z"
  },
  {
    "title": "White House Correspondents' Dinner scraps Amber Ruffin's comedy routine, bowing to Trump administration",
    "description": "The White House Correspondents’ Association is scrapping the traditional comedy\r\n portion of its annual dinner, marking a striking departure from a decades-long practice of balancing press freedom with political\r\n satire.",
    "link": "https://www.advocate.com/news/amber-ruffin-whca-dinner-canceled",
    "timestamp": "2025-03-29T19:48:06Z"
  },
  {
    "title": "Southwest border mission has cost $330M so far -- with over $40M for Guantanamo Bay alone: Sources",
    "description": "Southwest border mission has cost $330M so far -- with over $40M for Guantanamo Bay alone: Sourcesgo.com",
    "link": "https://abcnews.go.com/Politics/southwest-border-mission-cost-330m-40m-guantanamo-bay/story?id=120298109",
    "timestamp": "2025-03-29T19:39:00Z"
  },
  {
    "title": "Iran warns US against strikes, slams Israel's strikes on Beirut",
    "description": "Iran signals readiness for ‘threats and diplomacy’ as nuclear talks continue.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-848077",
    "timestamp": "2025-03-29T19:38:16Z"
  },
  {
    "title": "Headline: Is Pierre Poilievre too 'in sync' with Donald Trump? Answer: So in sync you can call him Timberlake [Fail]",
    "description": "Headline: Is Pierre Poilievre too 'in sync' with Donald Trump? Answer: So in sync you can call him Timberlake",
    "link": "https://www.fark.com/comments/13615368/Headline-Is-Pierre-Poilievre-too-in-sync-with-Donald-Trump-Answer-So-in-sync-you-can-call-him-Timberlake",
    "timestamp": "2025-03-29T19:35:08Z"
  },
  {
    "title": "Protesters rebelling against Elon Musk’s purge of US government swarm Tesla showrooms",
    "description": "Protesters rebelling against Elon Musk’s purge of US government swarm Tesla showrooms\nProtesters rebelling against Elon Musk’s purge of US government swarm Tesla showrooms\nSAN FRANCISCO (AP) — Crowds protesting billionaire Elon Musk’s purge of the U.S. govern…",
    "link": "https://biztoc.com/x/966b3fafc3880216",
    "timestamp": "2025-03-29T19:34:36Z"
  },
  {
    "title": "Elon Musk has sold X to his own AI company xAI for $33 billion",
    "description": "The tech billionaire and Donald Trump advisor made the announcement on Friday. It's unclear what will change for users of the social media site.\nBillionaire Elon Musk announced on Friday that he has sold social media site X, formerly known as Twitter when he …",
    "link": "https://biztoc.com/x/8e551a0ca2e41ab5",
    "timestamp": "2025-03-29T19:34:11Z"
  },
  {
    "title": "Trump administration cancels clean energy grants as it prioritizes fossil fuels",
    "description": "Trump administration cancels clean energy grants as it prioritizes fossil fuels\nTrump administration cancels clean energy grants as it prioritizes fossil fuels\nPresident Donald Trump’s administration is terminating grants for two clean energy projects and rou…",
    "link": "https://biztoc.com/x/2003c6d357b5b6f6",
    "timestamp": "2025-03-29T19:34:10Z"
  },
  {
    "title": "Big Law’s Big Lawyer to Fight Trump Is a Conservative Superstar",
    "description": "He is, by most accounts, a LeBron James of lawyers – a master who’s handled more Supreme Court cases than just about anyone else in recent history.",
    "link": "https://www.livemint.com/companies/news/big-law-s-big-lawyer-to-fight-trump-is-a-conservative-superstar-11743276787835.html",
    "timestamp": "2025-03-29T19:33:07Z"
  },
  {
    "title": "Ruth Marcus: Signal Leak Is Comparable To Biden's \"Messed Up\" Exit From Afghanistan, Bush Saying \"Heck Of A Job, Brownie\"",
    "description": "PBS NEWSHOUR: New York Times columnist David Brooks and columnist Ruth Marcus join Geoff Bennett to discuss the week in politics, including Trump officials sharing sensitive information on a commercial app, the reaction to the revelation, the state of U.S. fo…",
    "link": "https://www.realclearpolitics.com/video/2025/03/29/ruth_marcus_signal_leak_is_comparable_to_bidens_messed_up_exit_from_afghanistan_bush_saying_heck_of_a_job_brownie.html",
    "timestamp": "2025-03-29T19:32:05Z"
  },
  {
    "title": "Here’s What Triggered The Dogecoin And Shiba Inu Price Crashes",
    "description": "The Dogecoin and Shiba Inu prices have recorded a significant crash in the last 24 hours, a development that has sparked a bearish outlook for the foremost meme coins. This price crash has occurred due to macro events that have created market uncertainty.  Wh…",
    "link": "https://bitcoinist.com/dogecoin-and-shiba-inu-crash-3/",
    "timestamp": "2025-03-29T19:30:59Z"
  },
  {
    "title": "Polls suggest Poilievre is losing edge on affordability",
    "description": "It wasn't too long ago that Conservative Leader Pierre Poilievre shot to the top of the polls promising to make life more affordable for...",
    "link": "https://nationalpost.com/news/politics/federal_election/polls-suggest-poilievre-is-losing-edge-on-affordability",
    "timestamp": "2025-03-29T19:25:58Z"
  },
  {
    "title": "Faye Hall, American detained by Taliban, has been released",
    "description": "Faye Hall, an American woman who had been detained by the Taliban since February, has been freed, a source with knowledge of the release told Fox News Saturday.",
    "link": "https://www.foxnews.com/world/faye-hall-american-detained-taliban-has-been-released",
    "timestamp": "2025-03-29T19:25:56Z"
  },
  {
    "title": "White House Correspondents' Association drops Amber Ruffin from 2025 dinner",
    "description": "The White House Correspondents' Association announced Saturday that its annual dinner will not feature Amber Ruffin or any comedian.",
    "link": "https://abcnews.go.com/Politics/white-house-correspondents-association-drops-amber-ruffin-2025/story?id=120297927",
    "timestamp": "2025-03-29T19:25:03Z"
  },
  {
    "title": "Tesla protests held in Canada as part of 'global day of action' against Elon Musk",
    "description": "Hundreds of protests at Tesla showrooms around the world are expected today, including multiple ones organized across Canada.",
    "link": "https://www.cbc.ca/news/canada/tesla-protest-day-of-action-1.7497131",
    "timestamp": "2025-03-29T19:23:50Z"
  },
  {
    "title": "Trump needs to start fighting hard for his tax cuts, or that Golden Age is a goner",
    "description": "House Speaker Mike Johnson and Senate Majority Leader John Thune are pushing hard to get that “big, beautiful bill” onto President Donald Trump’s desk by the end of April — but they’re going to need him to start leading big-time to get it done.",
    "link": "https://nypost.com/2025/03/29/opinion/trump-needs-to-start-fighting-hard-for-his-tax-cuts-or-that-golden-age-is-a-goner/",
    "timestamp": "2025-03-29T19:23:24Z"
  },
  {
    "title": "Canadian PM Mark Carney Calls First Trump Talk 'Constructive' Amid Looming Tariff Threat",
    "description": "Canadian Prime Minister Mark Carney reportedly described his first conversation with President Donald Trump as “very constructive.”\nBBC reports that the two leaders spoke amid the escalating trade war, particularly over Trump’s proposed 25% tariff on vehicle …",
    "link": "https://biztoc.com/x/ad86879d51f1ca40",
    "timestamp": "2025-03-29T19:23:22Z"
  },
  {
    "title": "Voices from the Arab press: Do most Israelis support Netanyahu?",
    "description": "A weekly selection of opinions and analyses from the Arab media around the world.",
    "link": "https://www.jpost.com/middle-east/article-847997",
    "timestamp": "2025-03-29T19:23:13Z"
  },
  {
    "title": "US recession 40% likely in 2025, what it means for crypto — Analyst",
    "description": "The United States has a 40% chance of a recession in 2025 amid the potential for a protracted trade war and macroeconomic uncertainty, according to market analyst and Coin Bureau founder Nic Puckrin.In an interview with Cointelegraph, the analyst said that wh…",
    "link": "https://cointelegraph.com/news/us-recession-40-likely-2025-what-means-crypto-analyst",
    "timestamp": "2025-03-29T19:22:08Z"
  },
  {
    "title": "Top vaccine official resigns from FDA, criticizes RFK Jr.",
    "description": "The top vaccine official with the Food and Drug Administration has resigned and criticized the nation’s top health official for allowing “misinformation and lies” to guide his thinking behind the safety of vaccinations.",
    "link": "https://nypost.com/2025/03/29/us-news/top-vaccine-official-resigns-from-fda-criticizes-rfk-jr/",
    "timestamp": "2025-03-29T19:21:56Z"
  },
  {
    "title": "Forget two terms, experts say Donald Trump could legally stay president until 2037, thanks to a constitutional loophole; here are more details on it",
    "description": "A constitutional loophole could let Donald Trump serve beyond two terms as president. The 22nd Amendment restricts election to the presidency but does not prevent a twice-elected president from returning through succession. Legal experts argue this method cou…",
    "link": "https://economictimes.indiatimes.com/news/international/us/forget-two-terms-experts-say-donald-trump-could-legally-stay-president-until-2037-thanks-to-a-constitutional-loophole-here-are-more-details-on-it/articleshow/119724134.cms",
    "timestamp": "2025-03-29T19:20:33Z"
  },
  {
    "title": "Week 10",
    "description": "This morning came the announcement that the visas of hundreds of foreign students have been revoked. ICE has demonstrated their willingness to kidnap university students on thin pretexts, sometimes having to do with protests about Palestine. It’s a terror cam…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/week-10",
    "timestamp": "2025-03-29T19:19:44Z"
  },
  {
    "title": "Anna Paulina Luna claims NBC has unseen JFK assassination tape",
    "description": "'It allegedly shows Oswald near the vehicle when the assassination took place, which means that he couldn’t have been the shooter'",
    "link": "https://www.wnd.com/2025/03/5369402/",
    "timestamp": "2025-03-29T19:17:40Z"
  },
  {
    "title": "Bill Maher explains why he’s rejecting calls to join the political right",
    "description": "\"Real Time\" host Bill Maher had a message for his conservative fans who have urged him to join the political right, insisting he won't over their \"deranged\" support for Trump",
    "link": "https://www.foxnews.com/media/bill-maher-explains-why-hes-rejecting-calls-join-political-right",
    "timestamp": "2025-03-29T19:15:30Z"
  },
  {
    "title": "Protesters rebelling against Elon Musk's purge of US government swarm Tesla showrooms",
    "description": "Crowds protesting billionaire Elon Musk’s purge of the U.S. government under President Donald Trump began amassing outside Tesla dealerships throughout the U.S. Saturday in the latest attempt to dent the fortune of the world’s richest man",
    "link": "https://biztoc.com/x/4d92c79b4bf65c85",
    "timestamp": "2025-03-29T19:11:56Z"
  },
  {
    "title": "Tiger Woods' Former Mistress One-Ups the Vanessa Trump News",
    "description": "Rachel Uchitel, known for her affair with Tiger Woods, took to social media just days after Tiger Woods revealed his relationship with Vanessa Trump.",
    "link": "https://www.newsweek.com/sports/golf/tiger-woods-former-mistress-one-vanessa-trump-2052646",
    "timestamp": "2025-03-29T19:10:37Z"
  },
  {
    "title": "Khosla Sees One of Best Opportunities in a Decade",
    "description": "Victor Khosla, the founder of Strategic Value Partners LLC, is looking to hire amid one of the most promising environments for opportunistic credit investors in the last 10 years.",
    "link": "https://financialpost.com/pmn/business-pmn/khosla-sees-one-of-best-opportunities-in-a-decade",
    "timestamp": "2025-03-29T19:09:47Z"
  },
  {
    "title": "Young men flocked right in the US election. Will it happen in Australia?",
    "description": "Young men across the world have been embracing right-wing politics, while young women have moved to the left. Will it happen in the Australian election too?",
    "link": "https://www.abc.net.au/news/2025-03-30/voung-voters-trump-gen-z-millenials-albanese-dutton/105002998",
    "timestamp": "2025-03-29T19:09:07Z"
  },
  {
    "title": "What To Know About Pituffik Space Base As Trump Pushes To Acquire Greenland Decades After U.S. Built Military Site",
    "description": "American forces have been stationed on the Arctic island since World War II.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/03/29/what-to-know-about-pituffik-space-base-as-trump-pushes-to-acquire-greenland-decades-after-us-built-military-site/",
    "timestamp": "2025-03-29T19:03:58Z"
  },
  {
    "title": "US woman released by Taliban in Afghanistan: Former US envoy",
    "description": "American citizen Faye Hall has been released by the Taliban after she was detained earlier this year.",
    "link": "https://www.aljazeera.com/news/2025/3/29/us-woman-released-by-taliban-in-afghanistan-former-us-envoy",
    "timestamp": "2025-03-29T19:02:46Z"
  },
  {
    "title": "Protesters rebelling against Elon Musk's purge of US government swarm Tesla showrooms",
    "description": "Crowds protesting billionaire Elon Musk’s purge of the U.S. government under President Donald Trump began amassing outside Tesla dealerships throughout the U.S. Saturday in the latest attempt to dent the fortune of the world’s richest man",
    "link": "https://abcnews.go.com/Business/wireStory/protesters-rebelling-elon-musks-purge-us-government-swarm-120298292",
    "timestamp": "2025-03-29T19:02:19Z"
  },
  {
    "title": "Was Zelensky’s Oval Office dustup actually a success for him?",
    "description": "Argument with Trump led to European allies stepping up support for Ukraine",
    "link": "https://www.wnd.com/2025/03/was-zelenskys-oval-office-dustup-actually-a-success-for-him/",
    "timestamp": "2025-03-29T19:01:19Z"
  },
  {
    "title": "Wisconsin Judge Won’t Stop Musk’s $1 Million Payments to Voters. Attorney General Appeals",
    "description": "The state Attorney General, who argues that the offer violates the law, immediately appealed the decision.",
    "link": "https://time.com/7272857/wisconsin-judge-wont-stop-elon-musk-voters-payments/",
    "timestamp": "2025-03-29T18:55:13Z"
  },
  {
    "title": "The Trump tariff 'chain reaction': America's car and auto insurance payments could soar by $24 billion",
    "description": "The Trump tariff ‘chain reaction’: America’s car and auto insurance payments could soar by $24 billion\nEven if you're not in the market for a new car, U.S. President Donald Trump's 25% tariffs on auto imports could make owning one more expensive.\nAP Photo/Jae…",
    "link": "https://biztoc.com/x/c90bc430a357f440",
    "timestamp": "2025-03-29T18:50:09Z"
  },
  {
    "title": "Trump pushes aides to go bigger on tariffs as key deadline nears (Washington Post)",
    "description": "Washington Post:\nTrump pushes aides to go bigger on tariffs as key deadline nears  —  The president privately tells advisers that import duties represent a generational opportunity to transform the U.S. economy.  —  Just now  —  President Donald Trump is push…",
    "link": "https://www.memeorandum.com/250329/p46",
    "timestamp": "2025-03-29T18:50:03Z"
  },
  {
    "title": "Top Vaccine Official Resigns From FDA, Criticizes RFK Jr. for Promoting “Misinformation and Lies”",
    "description": "Dr. Peter Marks sent a letter saying that he would resign and retire as director of the Center for Biologics Evaluation and Research.",
    "link": "https://time.com/7272849/vaccine-official-peter-marks-resigns-from-fda-criticizes-rfk-jr/",
    "timestamp": "2025-03-29T18:46:22Z"
  },
  {
    "title": "Top vaccine official resigns from FDA, criticizes RFK Jr. for promoting \"misinformation and lies\"",
    "description": "The top vaccine official with the Food and Drug Administration has resigned and criticized the nation's top health official for allowing “misinformation and lies” to guide his thinking behind the safety of vaccinations.",
    "link": "https://www.wsls.com/health/2025/03/29/top-vaccine-official-resigns-from-fda-criticizes-rfk-jr-for-promoting-misinformation-lies/",
    "timestamp": "2025-03-29T18:45:30Z"
  },
  {
    "title": "‘ASININE’: Sky News TORCHED for Blaming Trump and DOGE for Suffering After Myanmar Quake",
    "description": "Britain’s Sky News was met with swift backlash on Saturday after the outlet connected President Donald Trump and DOGE (Department of Government Efficiency) to suffering in Myanmar after a devastating earthquake killed at least one thousand people on Friday. A…",
    "link": "https://www.mediaite.com/news/asinine-sky-news-torched-for-blaming-trump-and-doge-for-suffering-after-myanmar-quake/",
    "timestamp": "2025-03-29T18:45:13Z"
  },
  {
    "title": "Stephen King Takes Jab at Elon Musk's Efforts in Wisconsin Election",
    "description": "The best-selling author took aim at the billionaire's offer to pay voters signing a petition.",
    "link": "https://www.newsweek.com/stephen-king-takes-jab-elon-musks-efforts-wisconsin-election-2052648",
    "timestamp": "2025-03-29T18:45:03Z"
  },
  {
    "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner | CNN Business",
    "description": "The White House Correspondents’ Association is reversing course and canceling its plans to have comedian Amber Ruffin headline this year’s annual fundraising dinner in Washington, DC.",
    "link": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
    "timestamp": "2025-03-29T18:44:47Z"
  },
  {
    "title": "Protesters Rebelling Against Elon Musk’s Purge of U.S. Government Swarm Tesla Showrooms",
    "description": "Crowds protesting Elon Musk’s purge of the U.S. government under President Donald Trump amassed outside Tesla dealerships.",
    "link": "https://time.com/7272841/elon-musk-tesla-showrooms-protests-doge-trump-administration/",
    "timestamp": "2025-03-29T18:38:19Z"
  },
  {
    "title": "Bitcoin Poised To Hit ‘Numerically Interesting Number’ Before Topping Out, Predicts Arthur Hayes",
    "description": "The price of Bitcoin extended its fall on March 29, falling for a fifth consecutive day to register an intraday low of $81,769.",
    "link": "https://zycrypto.com/bitcoin-poised-to-hit-numerically-interesting-number-before-topping-out-predicts-arthur-hayes/",
    "timestamp": "2025-03-29T18:31:15Z"
  },
  {
    "title": "Ayanna Pressley Calls Trump A 'Dictator' After Feds Grab Tufts Student Off The Street",
    "description": "“It is chilling that people could be disappeared, kidnapped, kidnapped in plain view, simply for dissenting opinion, and that's what a dictator does.\"",
    "link": "https://www.huffpost.com/entry/ayanna-pressley-trump-dictator-tufts_n_67e81b65e4b0f0380605ebc0",
    "timestamp": "2025-03-29T18:28:29Z"
  },
  {
    "title": "India, US To Hold Sector-Specific Talks For Proposed Trade Agreement",
    "description": "India and the US have decided to hold sector-specific talks in the coming weeks to finalise the structure of the proposed bilateral trade agreement (BTA), the government said on Saturday.",
    "link": "https://www.ndtv.com/india-news/india-us-to-hold-sector-specific-talks-for-proposed-bilateral-trade-agreement-8042443",
    "timestamp": "2025-03-29T18:28:22Z"
  },
  {
    "title": "White House Correspondents’ Association Cancels Plans to Feature Comedian Amber Ruffin at Annual Dinner",
    "description": "The White House Correspondents’ Association has canceled plans to have comedian Amber Ruffin perform at its annual dinner on April 26. “The WHCA board has unanimously decided we are no longer featuring a comedic performance this year. At this consequential mo…",
    "link": "https://variety.com/2025/politics/news/whca-drops-amber-ruffin-performance-dinner-1236351795/",
    "timestamp": "2025-03-29T18:27:29Z"
  },
  {
    "title": "Protesters rebelling against Elon Musk's purge of US government swarm Tesla showrooms",
    "description": "Crowds protesting billionaire Elon Musk’s purge of the U.S. government under President Donald Trump began amassing outside Tesla dealerships throughout the U.S. and in some cities in Europe on Saturday.",
    "link": "https://www.clickorlando.com/business/2025/03/29/protesters-rebelling-against-elon-musks-purge-of-us-government-swarm-tesla-showrooms/",
    "timestamp": "2025-03-29T18:27:07Z"
  },
  {
    "title": "Protesters rebelling against Elon Musk's purge of US government swarm Tesla showrooms",
    "description": "Crowds have protested billionaire Elon Musk’s purge of the U.S. government under President Donald Trump outside Tesla dealerships throughout the U.S. and in some cities in Europe.",
    "link": "https://www.clickondetroit.com/business/2025/03/29/protesters-rebelling-against-elon-musks-purge-of-us-government-swarm-tesla-showrooms/",
    "timestamp": "2025-03-29T18:26:26Z"
  },
  {
    "title": "Top US vaccine doctor resigns over RFK Jr.’s ‘misinformation and lies’",
    "description": "Dr. Peter Marks is credited with coining the name and concept for “Operation Warp Speed,” the effort under President Donald Trump to rapidly manufacture vaccines. He was told to resign or be fired by Robert F. Kennedy Jr., an FDA official said.",
    "link": "https://www.oregonlive.com/health/2025/03/top-us-vaccine-doctor-resigns-over-rfk-jrs-misinformation-and-lies.html",
    "timestamp": "2025-03-29T18:26:07Z"
  },
  {
    "title": "Protesters rebelling against Elon Musk's purge of US government swarm Tesla showrooms",
    "description": "Crowds protesting billionaire Elon Musk’s purge of the U.S. government under President Donald Trump began amassing outside Tesla dealerships throughout the U.S. and in some cities in Europe on Saturday.",
    "link": "https://www.local10.com/business/2025/03/29/protesters-rebelling-against-elon-musks-purge-of-us-government-swarm-tesla-showrooms/",
    "timestamp": "2025-03-29T18:26:06Z"
  },
  {
    "title": "‘What is a woman?’: Here's how Donald Trump answered this question amid his contoversial transgender policies",
    "description": "Trump's comments on ‘What is a woman?’ have reignited discussions over transgender rights and gender policies in the US.",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-a-woman-heres-how-donald-trump-answered-this-question-amid-his-contoversial-transgender-policies/articleshow/119722157.cms",
    "timestamp": "2025-03-29T18:21:50Z"
  },
  {
    "title": "WHO Must Cut Budget By Fifth After US Pullout: Email",
    "description": "The World Health Organization has proposed slashing a fifth of its budget following the US decision to withdraw, and must now reduce its reach and workforce, its chief said in an internal email seen by AFP on Saturday.",
    "link": "https://www.ibtimes.com/who-must-cut-budget-fifth-after-us-pullout-email-3768127",
    "timestamp": "2025-03-29T18:21:21Z"
  },
  {
    "title": "Protesters rebelling against Elon Musk’s purge of US government swarm Tesla showrooms",
    "description": "SAN FRANCISCO (AP) — Crowds protesting billionaire Elon Musk’s purge of the U.S. government under President Donald Trump began amassing outside Tesla dealerships throughout the U.S. Saturday in the latest attempt to dent the fortune of the world’s richest man…",
    "link": "https://financialpost.com/pmn/protesters-rebelling-against-elon-musks-purge-of-us-government-swarm-tesla-showrooms",
    "timestamp": "2025-03-29T18:18:07Z"
  },
  {
    "title": "Myanmar Death Count Rises To Over 1,600 As Rescuers Dig For Survivors",
    "description": "The death count from a huge earthquake that hit Myanmar and Thailand passed 1,600 on Saturday, as rescuers dug through the rubble of collapsed buildings in a desperate search for survivors.",
    "link": "https://www.ndtv.com/world-news/myanmar-earthquake-death-count-rises-to-over-1-600-as-rescuers-dig-for-survivors-8042366",
    "timestamp": "2025-03-29T18:14:39Z"
  },
  {
    "title": "Why ‘Snow White’ Producer’s Son Criticized Rachel Zegler Over Social Media Actions",
    "description": "The son of \"Snow White\" producer Marc Platt posted his grievances over star Rachel Zegler’s social media activity during the production of the Disney film, only to soon delete them.",
    "link": "https://www.forbes.com/sites/timlammers/2025/03/29/why-snow-white-producers-son-criticized-rachel-zegler-over-social-media-actions/",
    "timestamp": "2025-03-29T18:10:10Z"
  },
  {
    "title": "'Hold my beer': Pete Hegseth ridiculed by Dem lawmaker over wife report",
    "description": "Reacting to a Wall Street Journal report that Defense Secretary Pete Hegseth has been dragging his third wife along with him to intel briefings, Sen. Chris Coons (D-DE) took a personal jab at the Donald Trump nominee.On Friday, the Journal reported that the e…",
    "link": "https://www.rawstory.com/hegseth-wife-beer/",
    "timestamp": "2025-03-29T18:09:32Z"
  },
  {
    "title": "U.S. Institute of Peace lays off most staff members",
    "description": "All but a small group of U.S. Institute of Peace employees received formal termination notices Friday evening, effective immediately, current and former employees told NBC News.",
    "link": "https://www.nbcnews.com/politics/trump-administration/us-institute-peace-layoff-most-staff-members-rcna198714",
    "timestamp": "2025-03-29T18:08:16Z"
  },
  {
    "title": "U.S. launches new strikes against Houthis in Yemen, apparently killing at least 1 person",
    "description": "Suspected U.S. airstrikes pounded Yemen overnight into Saturday, reportedly killing at least one person as the American military acknowledged earlier bombing a major military site in the heart of Sanaa controlled by the Houthi rebels.",
    "link": "https://www.pbs.org/newshour/world/u-s-launches-new-strikes-against-houthis-in-yemen-apparently-killing-at-least-1-person",
    "timestamp": "2025-03-29T18:08:09Z"
  },
  {
    "title": "Talk it out: ‘Retirement’s made my husband more controlling. It’s a big strain on me’",
    "description": "Sunday Times News: To help readers cope with their anxieties in these stressful times, TOI has launched Talk it Out, a series in which expert counsellors answer your men.",
    "link": "https://timesofindia.indiatimes.com/home/sunday-times/talk-it-out-retirements-made-my-husband-more-controlling-its-a-big-strain-on-me/articleshow/119721466.cms",
    "timestamp": "2025-03-29T18:06:40Z"
  },
  {
    "title": "U.S. Naval Academy ends affirmative action in admissions following Trump order",
    "description": "The U.S. Naval Academy will no longer consider race, ethnicity or sex as a factor for admission to the service institution, a response to an executive order by President Donald Trump, according to federal court documents made public Friday.",
    "link": "https://biztoc.com/x/41a38b1f90b90c72",
    "timestamp": "2025-03-29T18:05:43Z"
  },
  {
    "title": "Governor signs ban on DEI in Ohio public colleges despite opposition by students and teachers",
    "description": "COLUMBUS, Ohio — Republican Gov. Mike DeWine has signed legislation to ban diversity, equity and inclusion programs and make other sweeping changes to public colleges and universities in Ohio.",
    "link": "https://www.nbcnews.com/politics/politics-news/mike-dewine-signs-ban-dei-ohio-public-colleges-rcna198717",
    "timestamp": "2025-03-29T18:04:01Z"
  },
  {
    "title": "Ukraine Learns the Hard Way That US Never Gives Weapons for Free",
    "description": "Donald Trump’s efforts to make Ukraine pay for all the US aid highlights the fact that the United States “doesn't give weapons in an altruistic way,” Dr. Jeremy Kuzmarov, managing editor of CovertAction Magazine, tells Sputnik.",
    "link": "https://sputnikglobe.com/20250329/ukraine-learns-the-hard-way-that-us-never-gives-weapons-for-free-1121710341.html",
    "timestamp": "2025-03-29T18:03:04Z"
  },
  {
    "title": "Trump Tells SCOTUS There’s a “Rigorous Process” for Deporting Venezuelan Migrants. Yeah, Right.",
    "description": "On Friday, the Trump administration asked the Supreme Court to lift a lower court ruling blocking the mass deportation of thousands of detained Venezuelan migrants under the controversial Aliens Enemies Act of 1798, claiming in a filing that it has a “rigorou…",
    "link": "https://www.motherjones.com/politics/2025/03/trump-supreme-court-alien-enemies-act-venezuela-el-salvador-migrants-tattoos/",
    "timestamp": "2025-03-29T18:02:52Z"
  },
  {
    "title": "Tesla Takedown: What to Know as 200 Stores Targeted on Global Day of Action",
    "description": "The protests will take place at around 200 locations around the world as American voters and foreign citizens express displeasure with Elon Musk.",
    "link": "https://www.newsweek.com/tesla-takedown-stores-targeted-global-day-action-elon-musk-2052621",
    "timestamp": "2025-03-29T18:02:07Z"
  },
  {
    "title": "Illegal Immigrant ‘Influencer’ Who Encouraged Freeloading and Squatting Finally Sent Back to Venezuela",
    "description": "\"I have thought about invading a house in the United States. I found out that there is a law that says that if a house is not inhabited, we can seize it.\"\nThe post Illegal Immigrant ‘Influencer’ Who Encouraged Freeloading and Squatting Finally Sent Back to Ve…",
    "link": "https://legalinsurrection.com/2025/03/illegal-immigrant-influencer-who-encouraged-freeloading-and-squatting-finally-sent-back-to-venezuela/",
    "timestamp": "2025-03-29T18:00:50Z"
  },
  {
    "title": "U.S. Naval Academy ends affirmative action in admissions following Trump order",
    "description": "The U.S. Naval Academy will no longer consider race, ethnicity or sex as a factor for admission to the service institution, a response to an executive order by President Donald Trump, according to federal court documents made public Friday.",
    "link": "https://www.pbs.org/newshour/politics/u-s-naval-academy-ends-affirmative-action-in-admissions-following-trump-order",
    "timestamp": "2025-03-29T18:00:28Z"
  },
  {
    "title": "UBS: Auto Tariffs Could Backfire In Ways Industry Isn’t Ready For",
    "description": "“There are still a lot of unknowns, but if this remains in place, there will clearly be some pain for the companies to digest.”",
    "link": "https://www.forbes.com/sites/danrunkevicius/2025/03/29/ubs-auto-tariffs-could-backfire-in-ways-industry-isnt-ready-for/",
    "timestamp": "2025-03-29T18:00:16Z"
  },
  {
    "title": "8,000 Dormant Bitcoin Suddenly Move: What’s Next For The Market?",
    "description": "Popular CryptoQuant analyst Maartunn reports that 8,000 Bitcoin (BTC) which have been dormant for five to seven years have been moved suddenly, adding to current bearish concerns in the crypto. This development comes after a rather adventurous week as BTC pri…",
    "link": "https://bitcoinist.com/8000-dormant-bitcoin-suddenly-moves-whats-next/",
    "timestamp": "2025-03-29T18:00:08Z"
  },
  {
    "title": "FBI and DOJ seize $8.2 Million in romance baiting crypto fraud scheme",
    "description": "The U.S. DOJ seized over $8.2 million in USDT stolen through ‘romance baiting’ scams, where victims are tricked into fake investments promising high returns. On February 27, 2025, the U.S. Attorney’s Office in Ohio filed a civil forfeiture complaint for $8.2M…",
    "link": "https://securityaffairs.com/175990/cyber-crime/fbi-and-doj-seize-8-2-million-in-romance-baiting-crypto-fraud-scheme.html",
    "timestamp": "2025-03-29T17:58:37Z"
  },
  {
    "title": "White House Correspondents’ Association Scraps Plans For Comedian Amber Ruffin At Upcoming Dinner",
    "description": "The White House Correspondents’ Association has dropped plans to feature a comedian at its April 26 dinner. Amber Ruffin had been announced as the featured entertainer. WHCA President Eugene Daniels wrote in a letter to members today that “the WHCA board has …",
    "link": "http://deadline.com/2025/03/white-house-correspondents-dinner-scraps-plans-amber-ruffin-1236354014/",
    "timestamp": "2025-03-29T17:58:07Z"
  },
  {
    "title": "Bollywood’s soft power under-utilised but business-savvy stars took it global: Swapnil Rai",
    "description": "Bollywood's influence as a tool for cultural diplomacy has been significant and largely underutilized by the Indian state. Stars like Raj Kapoor and Aamir Khan have achieved global popularity independently, highlighting cinema's role in fostering internationa…",
    "link": "https://timesofindia.indiatimes.com/home/sunday-times/all-that-matters/bollywoods-soft-power-under-utilised-but-business-savvy-stars-took-it-global-swapnil-rai/articleshow/119721143.cms",
    "timestamp": "2025-03-29T17:54:12Z"
  },
  {
    "title": "The Week in Corruption, Plus Two Cheers for \"Corporate Media\"",
    "description": "Another free speech post, albeit somewhat tangentially so, following on Howard's post below. (Although it's clear to me that we're living in two different bubbles. I don't see a refusal of \"many,\" if that word is to have some value, to recognize this regime's…",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/03/needed-more-corporate-media.html",
    "timestamp": "2025-03-29T17:52:44Z"
  },
  {
    "title": "Why 'Tiger King' Joe Exotic Launched a Solana Meme Coin From Behind Bars",
    "description": "“I’m knee-deep in lawyer bills,” former wildlife park owner Joe Exotic told Decrypt from prison this week.",
    "link": "https://decrypt.co/312192/tiger-king-joe-exotic-solana-meme-coin",
    "timestamp": "2025-03-29T17:51:48Z"
  },
  {
    "title": "Anti-Musk protests gather across St. Louis region. 'I've got family members threatened.'",
    "description": "Three protests against the Trump administration’s cost-cutting campaign lined streets on Saturday, at the Gateway Arch and at Tesla dealerships, in south St. Louis County and, set for the afternoon, in Chesterfield.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_696af6d2-75ed-4bfe-a601-b49354ff593d.html",
    "timestamp": "2025-03-29T17:50:00Z"
  },
  {
    "title": "Model Why: Is Tesla ready for India? And is India ready for Tesla?",
    "description": "Tesla opened bookings in India for its Model 3 in 2016, but the car is still not available. Despite India's significant growth in the EV market, Tesla faces challenges like pricing, local adaptation, and increased competition. Setting up manufacturing could o…",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/model-why-is-tesla-ready-for-india-and-is-india-ready-for-tesla/articleshow/119717565.cms",
    "timestamp": "2025-03-29T17:49:00Z"
  },
  {
    "title": "Elon Musk Will Subject His Notoriously Thin Skin To Restaurant Critics",
    "description": "The Tesla investor is opening a Los Angeles diner—because who'd dare complain about food service?",
    "link": "https://www.vanityfair.com/style/story/elon-musk-opening-los-angeles-restaurant",
    "timestamp": "2025-03-29T17:46:03Z"
  },
  {
    "title": "Why did Donald Trump ask Americans not to rush car purchases amid new auto tariffs?",
    "description": "Under the new policy, a 25% tariff on imported cars and auto parts will take effect on April 2, with additional fees set to be implemented beginning April 3.",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-did-donald-trump-ask-americans-not-to-rush-car-purchases-amid-new-auto-tariffs/articleshow/119720702.cms",
    "timestamp": "2025-03-29T17:44:03Z"
  },
  {
    "title": "Trump endorses Jimmy Patronis in Florida GOP primary",
    "description": "United States Donald Trump endorsed Florida Chief Financial Officer Jimmy Patronis for Congress in a Truth Social post. Patronis, a fourth-generation Floridian and seafood restaurant owner, is running...",
    "link": "https://biztoc.com/x/761692ec5dde5dbe",
    "timestamp": "2025-03-29T17:43:52Z"
  },
  {
    "title": "Trump seeks even more aggressive tariffs to fundamentally transform the US economy and eyes a single universal duty, report says",
    "description": "President Donald Trump is pressing his staff to take a harder stance on tariffs as part of an effort to transform the US economy, sources told the Washington Post. That could include a universal tariff that hits most imports without regard to the country of o…",
    "link": "https://biztoc.com/x/931fa470da7630ea",
    "timestamp": "2025-03-29T17:43:36Z"
  },
  {
    "title": "Bill Maher Issues Warning to Republicans—'This Is the Moment'",
    "description": "Comedian and talk show host Bill Maher warned Republicans on Friday that supporting a third term for President Donald Trump would mark a dangerous break from constitutional norms, telling them that \"this is the moment when Rome stops being a Republic.\"\nNewswe…",
    "link": "https://biztoc.com/x/7730456dd7c4f25e",
    "timestamp": "2025-03-29T17:43:27Z"
  },
  {
    "title": "Trump presses advisers for tariff escalation ahead of April 2, Washington Post reports",
    "description": "President Trump is pushing senior advisers to adopt a more aggressive tariff stance, as the U.S. gears up for a major escalation in its trade war. Trump has revisited the idea of a universal tariff and is keen on implementing sweeping trade actions. He believ…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-presses-advisers-for-tariff-escalation-ahead-of-april-2-washington-post-reports/articleshow/119720619.cms",
    "timestamp": "2025-03-29T17:39:51Z"
  },
  {
    "title": "Bill Maher Issues Warning to Republicans—'This Is the Moment'",
    "description": "The comedian warned that if Republicans continue to follow President Donald Trump, the country will look more and more like North Korea.",
    "link": "https://www.newsweek.com/bill-maher-issues-warning-republicans-this-moment-2052607",
    "timestamp": "2025-03-29T17:35:50Z"
  },
  {
    "title": "Trump seeks even more aggressive tariffs to fundamentally transform the US economy and eyes a single universal duty, report says",
    "description": "Intense discussions are ongoing ahead of April 2, which Trump has billed as \"Liberation Day,\" when his next batch of tariffs will be unveiled.",
    "link": "https://www.yahoo.com/news/trump-seeks-even-more-aggressive-173026720.html",
    "timestamp": "2025-03-29T17:30:26Z"
  },
  {
    "title": "Trump’s EPA Is Giving Power Companies Free Reign to Leave Behind Toxic Coal Ash",
    "description": "Advocates fear the agency will “justify avoiding any enforcement whatsoever” of millions of tons of coal ash nationwide.",
    "link": "https://grist.org/health/coal-ash-epa-lee-zeldin-trump/",
    "timestamp": "2025-03-29T17:30:26Z"
  },
  {
    "title": "Tufts University student can’t be deported to Turkiye without court order",
    "description": "Pro-Palestine student Rumeysa Ozturk was arrested on Tuesday by US immigration authorities in Massachusetts.",
    "link": "https://www.aljazeera.com/news/2025/3/29/tufts-university-student-cant-be-deported-to-turkiye-without-court-order",
    "timestamp": "2025-03-29T17:27:04Z"
  },
  {
    "title": "Trump appoints Sara Carter as next drug czar, says she 'will lead the charge to protect' US",
    "description": "President Donald Trump appointed Sara Carter as drug czar, saying she will \"lead the charge to protect our nation and save our children from the scourge of drugs.\"",
    "link": "https://www.foxnews.com/politics/trump-appoints-sara-carter-next-drug-czar-says-she-will-lead-charge-protect-us",
    "timestamp": "2025-03-29T17:21:54Z"
  },
  {
    "title": "Japan worried as Trump threatens tariffs on auto imports",
    "description": "The Japanese government has expressed its dismay at US President Donald Trump's announcement that all vehicles imported into the US will be subject to a 25% tariff from April 2.\nPrime Minister Shigeru Ishiba has called on Washington to exempt Japanese car mak…",
    "link": "https://biztoc.com/x/d4fa684a0a9f2b55",
    "timestamp": "2025-03-29T17:21:51Z"
  },
  {
    "title": "Death toll in Burma, Thailand earthquake rises to more than 1,600 victims",
    "description": "The death toll from the devastating earthquake that rattled Burma and Thailand on Friday has risen sharply to more than 1,650 victims. Nearly 140 people still missing, Burma's ruling military said Saturday.",
    "link": "https://www.foxnews.com/world/death-toll-burma-thailand-earthquake-rises-more-than-1600-victims",
    "timestamp": "2025-03-29T17:19:59Z"
  },
  {
    "title": "Somaliland rejects Somalia offer of key port to US",
    "description": "The breakaway republic argues Berbera port and airbase are not Somalia's to give away.",
    "link": "https://www.bbc.com/news/articles/c8d4dzq87rpo",
    "timestamp": "2025-03-29T17:19:06Z"
  },
  {
    "title": "‘We Are in an Emergency’: Progressive TikTok Star Launches Bid to Unseat Old-Guard Dem (Former bartender Kat Abughazaleh looks to unseat walking corpse Jan Schakowsky)",
    "description": "Illinois 9th District has only been represented by two people since 1965, and there hasn’t been a competitive primary since the race Democratic Congresswoman Jan Schakowsky, the district’s current representative, won in November 1998. “I wouldn’t be born for …",
    "link": "https://freerepublic.com/focus/f-news/4307559/posts",
    "timestamp": "2025-03-29T17:18:56Z"
  },
  {
    "title": "Greenland rubs Donald Trump the wrong way as leaders push for deep trade cooperation with China in fisheries and sustainable development",
    "description": "Greenland's political leaders aim to strengthen ties with China. Incoming Foreign Minister Vivian Motzfeldt emphasized China’s role as a key seafood market.",
    "link": "https://economictimes.indiatimes.com/news/international/us/greenland-rubs-donald-trump-the-wrong-way-as-leaders-push-for-deep-trade-cooperation-with-china-in-fisheries-and-sustainable-development/articleshow/119719556.cms",
    "timestamp": "2025-03-29T17:17:56Z"
  },
  {
    "title": "Federal Immigration Agents Detain University Of Minnesota Student",
    "description": "The graduate student was scooped up Thursday by ICE, prompting strong reactions from the university president and Minnesota Governor Tim Walz.",
    "link": "https://www.huffpost.com/entry/federal-immigration-agents-detain-university-of-minnesota-student-with-legal-status-in-us_n_67e7f8dae4b03539cbafde5d",
    "timestamp": "2025-03-29T17:17:31Z"
  },
  {
    "title": "Trump releases powerful video highlighting US-Greenland bond after deadly Nazi attack",
    "description": "President Donald Trump posted a powerful video Friday highlighting the strong historical bonds between Greenland and the United States amid ongoing efforts to annex the nation.",
    "link": "https://www.foxnews.com/politics/trump-releases-powerful-video-highlighting-us-greenland-bond-after-deadly-nazi-attack",
    "timestamp": "2025-03-29T17:15:06Z"
  }
]