[
  {
    "title": "Denmark to summon U.S. ambassador as Trump's Greenland special envoy appointment stirs tensions",
    "description": "Denmark pushes back against Trump's appointment of Jeff Landry as U.S. Special Envoy to Greenland.",
    "link": "https://www.cnbc.com/2025/12/22/denamark-to-summon-us-ambassador-over-trumps-greenland-special-envoy.html",
    "timestamp": "2025-12-22T13:44:42Z"
  },
  {
    "title": "CBS and CNN Are Being Sacrificed to Trump",
    "description": "Media conglomerates want the president’s permission for mergers—and control of news outlets is at stake.",
    "link": "https://www.theatlantic.com/ideas/2025/12/trump-paramount-netflix-cnn-cbs/685349/",
    "timestamp": "2025-12-22T13:43:00Z"
  },
  {
    "title": "US officials admit to major violations during 2020 election",
    "description": "Georgia’s Fulton County has admitted to breaking vote certification rules during the 2020 US presidential election Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629880-us-2020-election-violation/",
    "timestamp": "2025-12-22T13:41:50Z"
  },
  {
    "title": "Netflix vs Paramount Skydance for Warner Bros Discovery: Oracle co-founder Larry Ellison offers $40.4 billion guarantee, ORCL share price jumps",
    "description": "Netflix is the biggest of the three companies, with a market capitalization of around $430 billion as of mid-December. Warner Bros. Discovery is about $70 billion, while Paramount Skydance trails at closer to $14 billion, according to reports.",
    "link": "https://economictimes.indiatimes.com/news/international/us/netflix-vs-paramount-skydance-for-warner-bros-discovery-oracle-co-founder-larry-ellison-offers-40-4-billion-guarantee-orcl-share-price-jumps/articleshow/126123244.cms",
    "timestamp": "2025-12-22T13:38:51Z"
  },
  {
    "title": "Paramount Sweetens Its Offer For Warner Bros., Including Massive Guarantee From Larry Ellison",
    "description": "Despite Netflix announcing a deal with Warner Bros. Discovery to acquire the media and entertainment behemoth, Paramount has not given up on its own attempt to acquire the company by going directly to shareholders. Now, Paramount has announced that it has fur…",
    "link": "https://www.gamespot.com/articles/paramount-sweetens-its-offer-for-warner-bros-including-massive-guarantee-from-larry-ellison/1100-6537130/",
    "timestamp": "2025-12-22T13:38:00Z"
  },
  {
    "title": "What are passkeys really? The simple explanation - for anyone tired of passwords",
    "description": "Yes, the technology underlying passkeys is confusing. Here's a plain-English guide that can help you ditch passwords today.",
    "link": "https://www.zdnet.com/article/what-are-passkeys/",
    "timestamp": "2025-12-22T13:36:00Z"
  },
  {
    "title": "Are banks open on Christmas Eve 2025? Confusion grows over U.S. bank hours after Trump’s federal holiday order — here’s what stays open",
    "description": "Are banks open on Christmas Eve 2025? Banks across the United States will generally remain open on Christmas Eve, December 24, 2025. The question has gained attention after President Donald Trump signed an executive order declaring Christmas Eve and December …",
    "link": "https://economictimes.indiatimes.com/news/international/us/are-banks-open-on-christmas-eve-2025-confusion-grows-over-u-s-bank-hours-after-trump-declares-christmas-eve-and-dec-26-federal-holidays-heres-what-stays-open/articleshow/126122792.cms",
    "timestamp": "2025-12-22T13:35:50Z"
  },
  {
    "title": "Clarity Act delays led to $952M in crypto fund outflows: CoinShares",
    "description": "Crypto funds broke three weeks of net positive flows, after US investor sentiment took a hit following delays to the long-awaited CLARITY Act, set to reach the Senate in January 2026.",
    "link": "https://cointelegraph.com/news/clarity-act-delays-950m-crypto-fund-outflows",
    "timestamp": "2025-12-22T13:33:25Z"
  },
  {
    "title": "Rep. Ro Khanna on Venezuela Strikes, Zohran Mamdani, Trump-Kennedy Center & More",
    "description": "Democracy Now! speaks with Democratic Congressmember Ro Khanna on the latest developments in Congress and about escalating U.S. attacks on alleged drug boats off the coast of Venezuela. “Why are we going into a regime change war when the president promised no…",
    "link": "https://www.democracynow.org/2025/12/22/ro_khanna",
    "timestamp": "2025-12-22T13:31:50Z"
  },
  {
    "title": "Pirate Trump",
    "description": "Felipe Galindo\n\nDonald Trump escalates Caribbean tensions with vessel attacks near Venezuela.\nThe post Pirate Trump appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/pirate-trump/",
    "timestamp": "2025-12-22T13:30:05Z"
  },
  {
    "title": "Thailand-Cambodia ceasefire deal 'rushed' for Donald Trump",
    "description": "Bangkok says the two countries will return to the negotiating table this week amid claims the initial peace deal was rushed for Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-12-23/thailand-cambodia-set-to-resume-ceasefire-negotiations/106172396",
    "timestamp": "2025-12-22T13:28:11Z"
  },
  {
    "title": "Binance let suspicious accounts move millions after $4.3B US plea deal: Report",
    "description": "Binance let 13 high‑risk accounts move $1.7 billion in crypto, including $144 million after its 2023 US plea deal, despite red flags and ties to wallets later linked to terror finance, FT finds.",
    "link": "https://cointelegraph.com/news/binance-suspect-accounts-move-millions",
    "timestamp": "2025-12-22T13:27:47Z"
  },
  {
    "title": "Schumer moves to force Senate to take legal action against DOJ, Trump admin over Epstein doc dump",
    "description": "Senate Democrats plan investigations after the Department of Justice released heavily redacted Epstein documents on Friday.",
    "link": "https://www.foxnews.com/politics/schumer-moves-force-senate-take-legal-action-against-doj-trump-admin-over-epstein-doc-dump",
    "timestamp": "2025-12-22T13:25:56Z"
  },
  {
    "title": "Schumer accuses DOJ of breaking the law over redacted Epstein files",
    "description": "Senate Democrats plan investigations after the Department of Justice released heavily redacted Epstein documents on Friday.",
    "link": "https://www.foxnews.com/politics/schumer-accuses-doj-breaking-law-over-redacted-epstein-files",
    "timestamp": "2025-12-22T13:25:56Z"
  },
  {
    "title": "Trump is 'bored, tired and running on fumes' — and he's given up the fight: analyst",
    "description": "A year into his second term, Donald Trump has undergone a major change in “tactics” as he deflects questions about his policies — and it's an indication that he is now “just running on fumes,\" an analyst wrote Monday.Salon’s Amanda Marcotte pointed out that t…",
    "link": "https://www.rawstory.com/trump-bored-2674820811/",
    "timestamp": "2025-12-22T13:22:00Z"
  },
  {
    "title": "US to recall nearly 30 career diplomats, including those in Egypt, Armenia",
    "description": "The Trump administration is recalling nearly 30 career diplomats from ambassadorial and other senior embassy posts as it moves to reshape the U.S. diplomatic posture abroad with personnel deemed fully supportive of President Donald Trump’s “America First” pri…",
    "link": "https://www.hurriyetdailynews.com/us-to-recall-nearly-30-career-diplomats-including-those-in-egypt-armenia-217080",
    "timestamp": "2025-12-22T13:21:58Z"
  },
  {
    "title": "President Trump Is a Warmonger",
    "description": "Earlier this month, the Trump administration released its new National Security Strategy, or NSS. Normally, such documents are poor predictors of what’s likely to happen in the real world. They are more like branding tools that communicate the attitudes of a …",
    "link": "https://www.commondreams.org/opinion/donald-trump-warmonger",
    "timestamp": "2025-12-22T13:20:25Z"
  },
  {
    "title": "Bourbon maker Jim Beam halts production at main distillery for a year",
    "description": "The maker of the popular Jim Beam bourbon whiskey says it will halt production at its main site in Kentucky for all of next year. The distillery will stay closed while the firm takes \"the opportunity to invest in site enhancements,\" it told the BBC in a state…",
    "link": "https://freerepublic.com/focus/f-chat/4358525/posts",
    "timestamp": "2025-12-22T13:19:29Z"
  },
  {
    "title": "Trump’s Christmas gifts",
    "description": "This holiday season, Americans are getting a bad economy, redacted Epstein files and even more war abroad.",
    "link": "https://www.aljazeera.com/opinions/2025/12/22/trumps-christmas-gifts",
    "timestamp": "2025-12-22T13:16:39Z"
  },
  {
    "title": "The Law Bytes Podcast, Episode 254: Looking Back at the Year in Canadian Digital Law and Policy",
    "description": "Canadian digital law and policy in 2025 was marked by the unpredictable with changes in leadership in Canada and the U.S. driving a shift in policy approach. Over the past year, that included a reversal on the digital services tax, the re-introduction of lawf…",
    "link": "https://www.michaelgeist.ca/2025/12/the-law-bytes-podcast-episode-254-looking-back-at-the-year-in-canadian-digital-law-and-policy/",
    "timestamp": "2025-12-22T13:15:49Z"
  },
  {
    "title": "\"Who Are They Protecting?\": Rep. Ro Khanna Urges Contempt Charges over AG Bondi's Epstein Redactions",
    "description": "The Justice Department failed to publish thousands of documents by last Friday’s congressionally imposed deadline to release all of its files related to the serial sex offender Jeffrey Epstein. The delay drew criticism from Epstein’s survivors and members of …",
    "link": "https://www.democracynow.org/2025/12/22/epstein_files",
    "timestamp": "2025-12-22T13:15:40Z"
  },
  {
    "title": "Apple Tells Employees With H-1B Visas to Not Leave the US",
    "description": "Major tech firms, including Apple, Google, and Microsoft have warned their staff to not leave the United States if they need a visa stamp to return to the country.Read More...",
    "link": "https://www.mactrast.com/2025/12/apple-tells-employees-with-h-1b-visas-to-not-leave-the-us/",
    "timestamp": "2025-12-22T13:14:39Z"
  },
  {
    "title": "Gold and silver hit all-time highs as geopolitical tensions rise",
    "description": "Gold and silver soared to all-time highs, as escalating geopolitical tensions and bets on further U.S. rate cuts added momentum. Read more.",
    "link": "https://financialpost.com/investing/gold-silver-hit-all-time-highs-geopolitical-tensions-rise",
    "timestamp": "2025-12-22T13:13:49Z"
  },
  {
    "title": "Holt: Princess Kate’s state banquet looks were ‘a masterclass in sartorial diplomacy’",
    "description": "While the Princess of Wales wasn’t allowed to attend the diplomatic corps reception this year or last year, Kate did make the royalists happy by attending three state banquets, all held at Windsor Castle. They’re trying so hard to make Prince William and Kate…",
    "link": "https://www.celebitchy.com/954863/holt_princess_kates_state_banquet_looks_were_a_masterclass_in_sartorial_diplomacy/",
    "timestamp": "2025-12-22T13:13:07Z"
  },
  {
    "title": "For renewable energy sector, 2025 was a year of records",
    "description": "While the installed solar power capacity crossed the 100-GW mark, wind capacity drove past the 50-GW mark",
    "link": "https://www.thehindubusinessline.com/economy/for-renewable-energysector-2025-was-a-year-of-records/article70426005.ece",
    "timestamp": "2025-12-22T13:09:25Z"
  },
  {
    "title": "For renewable energy sector, 2025 was a year of records",
    "description": "While the installed solar power capacity crossed the 100 GW mark, wind capacity drove past the 50 GW mark",
    "link": "https://www.thehindubusinessline.com/news/for-renewable-energysector-2025-was-a-year-of-records/article70426005.ece",
    "timestamp": "2025-12-22T13:09:25Z"
  },
  {
    "title": "Ellison offers $40.4 billion guarantee to beef up Paramount's Warner Bros bid",
    "description": "Dec 22 : Oracle co-founder ‌Larry Ellison will provide a personal guarantee of $40.4 billion in equity financing to back Paramount Skydance's all-cash $108.4 billion bid for Warner Bros Discovery, a regulatory filing showed on Monday. The guarantee aims to ad…",
    "link": "https://www.channelnewsasia.com/business/ellison-offers-404-billion-guarantee-beef-up-paramounts-warner-bros-bid-5672936",
    "timestamp": "2025-12-22T13:07:18Z"
  },
  {
    "title": "Trump, 79, Makes Up a New Job to Push His Bizarre Takeover Plot",
    "description": "President Donald Trump announced that he’s nominating a MAGA ally to serve as U.S. special envoy to Greenland in a move that drew immediate anger from...",
    "link": "https://www.thedailybeast.com/trump-79-makes-up-a-new-job-to-push-his-bizarre-takeover-plot/",
    "timestamp": "2025-12-22T13:06:06Z"
  },
  {
    "title": "Joe Budden on Adin Ross: I Don’t F*ck With That Little White Boy!",
    "description": "Adin Ross is once again facing intense scrutiny after comments from Joe Budden reignited debate around the streamer’s history of controversies. The latest clash began after Budden addressed Ross on episode 888 of his podcast, following backlash over a livestr…",
    "link": "https://mediatakeout.com/joe-budden-on-adin-ross-i-dont-fck-with-that-little-white-boy/",
    "timestamp": "2025-12-22T13:03:51Z"
  },
  {
    "title": "CECOT CBS 60 Minutes Delay Linked to Trump Deportee Plan — Tax Dollars Down $150K+",
    "description": "CBS's 60 Minutes delays costly CECOT prison investigation after Trump praises network owners, raising questions about media transparency on deportation spending.",
    "link": "https://www.ibtimes.com/cecot-cbs-60-minutes-delay-linked-trump-deportee-plan-tax-dollars-down-150k-3793408",
    "timestamp": "2025-12-22T13:03:25Z"
  },
  {
    "title": "Donald Trump Being Monitored for Dementia, Expert Says",
    "description": "Psychologist Dr. John Gartner said that Trump's claim of passing three cognitive assessments may indicate that he is being monitored for dementia amidst increasing questions of his mental state.",
    "link": "https://www.ibtimes.com/donald-trump-being-monitored-dementia-expert-says-3793419",
    "timestamp": "2025-12-22T13:00:28Z"
  },
  {
    "title": "Posthaste: Two signs foreign investors are making their way back to Canada, just in the nick of time",
    "description": "After a two-quarter hiatus, foreigners snapped up $25 billion of federal government debt",
    "link": "https://financialpost.com/news/two-signs-foreign-investors-returning-canada",
    "timestamp": "2025-12-22T13:00:20Z"
  },
  {
    "title": "Agriculture focuses on SNAP fraud, while experts worry EBT theft will go unabated",
    "description": "“The most damaging form of fraud in SNAP is fraud where the low-income recipients are the victims, not the perpetrators,” a senior analyst at the Center on Budget and Policy Priorities argues.",
    "link": "https://www.nextgov.com/digital-government/2025/12/agriculture-focuses-snap-fraud-while-experts-worry-ebt-theft-will-go-unabated/410280/",
    "timestamp": "2025-12-22T13:00:00Z"
  },
  {
    "title": "Why Trump Should Pardon The Developers of Bitcoins Non Custodial Samourai Wallet",
    "description": "On December 18th, days before Christmas, Keonne Rodriguez, co-founder of the Bitcoin Samourai Wallet, will have to surrender to prison. His crime? Creating a software tool that gave Bitcoin users comparable privacy to that which banks are expected to provide.…",
    "link": "https://www.activistpost.com/why-trump-should-pardon-the-developers-of-bitcoins-non-custodial-samourai-wallet/",
    "timestamp": "2025-12-22T13:00:00Z"
  },
  {
    "title": "'Gotten so many texts': Trump insiders admit panic over rogue MAGA figurehead",
    "description": "Top White House officials are in full-blown panic over a growing “fracture” within the MAGA movement, led in large part by right-wing influencer Candace Owens, according to a senior Trump official who spoke with Zeteo.“I have gotten so many texts asking: what…",
    "link": "https://www.rawstory.com/maga-civil-war-2674820843/",
    "timestamp": "2025-12-22T12:59:54Z"
  },
  {
    "title": "Justice Department Reinstate Photo of Donald Trump Surrounded by Bikini-Clad Girls in Epstein Files After Image Mysteriously Disappeared Amid 'Cover-Up' Claims",
    "description": "The Justice Department make dramatic U-turn by reinstating image of Donald Trump with four bikini-clad women back in Epstein Files, amid cover-up claims.",
    "link": "https://radaronline.com/p/justice-department-reinstate-photo-donald-trump-bikini-clad-girls-epstein-files-cover-up-claims/",
    "timestamp": "2025-12-22T12:58:36Z"
  },
  {
    "title": "Scott Jennings Wants to Rename Epstein Files With 'Clinton Files', Saying It's 'About Democrats'",
    "description": "The release of the Epstein files has put Bill Clinton back in the spotlight, as redacted photos emerged and conservatives argued the documents damage Democrats more than Donald Trump.",
    "link": "https://www.ibtimes.com/scott-jennings-wants-rename-epstein-files-clinton-files-saying-its-about-democrats-3793427",
    "timestamp": "2025-12-22T12:58:12Z"
  },
  {
    "title": "Seeing Is Believing (Not)",
    "description": "\". . . power that goes unpunished only learns one lesson: it can do whatever it wants.\" —Roger Stone",
    "link": "https://www.kunstler.com/p/seeing-is-believing-not",
    "timestamp": "2025-12-22T12:58:05Z"
  },
  {
    "title": "Exclusive-How immigration swallowed up federal gun crime efforts",
    "description": "BALTIMORE, Dec 22 (Reuters) - Detectives in Baltimore watched on security video last summer as an argument inside a convenience store spilled ‌into the parking lot and gunshots erupted at a sedan speeding away. They quickly recognized one of the shooters: He …",
    "link": "https://www.thestar.com.my/news/world/2025/12/22/exclusive-how-immigration-swallowed-up-federal-gun-crime-efforts",
    "timestamp": "2025-12-22T12:57:00Z"
  },
  {
    "title": "Nicki Minaj Faces Backlash after Declaring Support for Trump",
    "description": "Nicki Minaj is at the center of fresh controversy after openly praising President Donald Trump this weekend. The Grammy-nominated rapper’s remarks, delivered at AmFest, marked her clearest show of support yet and prompted swift backlash from fans and critics …",
    "link": "https://mediatakeout.com/nicki-minaj-faces-backlash-after-declaring-support-for-trump/",
    "timestamp": "2025-12-22T12:56:18Z"
  },
  {
    "title": "Treasury Secretary Bessent 'Shamed In Public' While Eating Out For 'Economic Warfare' Sanctions",
    "description": "Treasury Secretary Scott Bessent was publicly heckled at a D.C. restaurant over the Trump administration's sanctions policies, highlighting growing domestic controversy over economic warfare and humanitarian impact.",
    "link": "https://www.ibtimes.com/treasury-secretary-bessent-shamed-public-while-eating-out-economic-warfare-sanctions-3793430",
    "timestamp": "2025-12-22T12:55:19Z"
  },
  {
    "title": "MAGA's Manly Manufacturing Misfire (Paul Krugman)",
    "description": "Paul Krugman:\nMAGA's Manly Manufacturing Misfire  —  According to Navigator Research, a significant number of Americans who voted for Donald Trump in 2024 now regret their choice.  As the word cloud above suggests, this regret is largely driven by Trump's utt…",
    "link": "https://www.memeorandum.com/251222/p17",
    "timestamp": "2025-12-22T12:55:00Z"
  },
  {
    "title": "Trump Claims FBI 'Thugs' Made a 'Mess' of Melania's Panties in Unhinged Rant",
    "description": "Donald Trump fumes at a North Carolina rally, claiming FBI 'thugs' made a 'mess' of Melania's underwear.",
    "link": "https://www.ibtimes.com/trump-claims-fbi-thugs-made-mess-melanias-panties-unhinged-rant-3793431",
    "timestamp": "2025-12-22T12:54:57Z"
  },
  {
    "title": "DOJ Slammed After Failing to Redact 'Jane Doe' Epstein Survivor's Name While Trump Mentions Are Omitted",
    "description": "The US Department of Justice faces bipartisan outrage after the release of heavily redacted Jeffrey Epstein files accidentally left a survivor's name unredacted, while mentions of Trump and related photos were omitted or removed.",
    "link": "https://www.ibtimes.com/doj-slammed-after-failing-redact-jane-doe-epstein-survivors-name-while-trump-mentions-are-3793432",
    "timestamp": "2025-12-22T12:54:54Z"
  },
  {
    "title": "Nikki Minaj MAGA 'heel turn' confronted by CNN expert's theory: 'Something going on'",
    "description": "Panelists on \"CNN This Morning\" speculated on rapper Nicki Minaj's motivations for taking part in this weekend's Turning Point USA’s AmericaFest convention, where she praised President Donald Trump and mocked California Gov. Gavin Newsom as \"New-scum.\"The Gra…",
    "link": "https://www.rawstory.com/nicki-minaj-trump/",
    "timestamp": "2025-12-22T12:54:34Z"
  },
  {
    "title": "Trump Orders Nuclear Reactors in Space: New 'Golden Dome' Shield to Guard America",
    "description": "President Donald Trump signs the 'Ensuring American Space Superiority' order, mandating nuclear reactors in space and a 2030 lunar base to secure US interests.",
    "link": "https://www.ibtimes.com/trump-orders-nuclear-reactors-space-new-golden-dome-shield-guard-america-3793435",
    "timestamp": "2025-12-22T12:54:29Z"
  },
  {
    "title": "Thailand, Cambodia to discuss truce amid fierce fighting",
    "description": "The two Asian nations are aiming to revive a ceasefire as deadly clashes continue along their 817-kilometer (508-mile) border.",
    "link": "https://www.dw.com/en/thailand-cambodia-to-discuss-truce-amid-fierce-fighting/a-75267584",
    "timestamp": "2025-12-22T12:53:00Z"
  },
  {
    "title": "Denmark to summon US ambassador after Trump appoints special envoy to Greenland",
    "description": "Trump has repeatedly stated his ambition to take control of Greenland since returning to the White House last January",
    "link": "https://www.thejournal.ie/denmark-to-summon-us-ambassador-trump-appoints-special-envoy-greenland-6910746-Dec2025/",
    "timestamp": "2025-12-22T12:49:59Z"
  },
  {
    "title": "Disturbing FBI Notes Reveal Jeffrey Epstein's Dislike For Dark, Spanish Girls Older Than Eighteen",
    "description": "Newly released documents from the NBI revealed grueling details about Jeffrey Epstein's horrible past. The late sex offender reportedly favored young and light-skinned girls.",
    "link": "https://www.ibtimes.com/disturbing-fbi-notes-reveal-jeffrey-epsteins-dislike-dark-spanish-girls-older-eighteen-3793449",
    "timestamp": "2025-12-22T12:49:31Z"
  },
  {
    "title": "DOJ's Unsealed Files Show Shirtless Jeffrey Epstein With Young Child",
    "description": "The DOJ published more photos of Epstein, including one controversial image featuring an unidentified kid while he has no shirt on.",
    "link": "https://www.ibtimes.com/dojs-unsealed-files-show-shirtless-jeffrey-epstein-young-child-3793452",
    "timestamp": "2025-12-22T12:48:24Z"
  },
  {
    "title": "Pam Bondi Faces Impeachment Threat After Trump-Free Epstein Files Drop Sparks Fury",
    "description": "AG Pam Bondi faces impeachment after redacted Epstein files spark bipartisan outrage; Reps Ro Khanna and Thomas Massie draft articles, calling the release a \"slap in the face\" to survivors.",
    "link": "https://www.ibtimes.com/pam-bondi-faces-impeachment-threat-after-trump-free-epstein-files-drop-sparks-fury-3793455",
    "timestamp": "2025-12-22T12:48:06Z"
  },
  {
    "title": "Bill Clinton Accuses Trump of Using Him as 'Scapegoat' After Epstein Files Drop",
    "description": "Bill Clinton accused Trump's administration of scapegoating him after Epstein files release, stressing he cut ties before crimes and noting Trump's absence despite their 1990s–2000s friendship.",
    "link": "https://www.ibtimes.com/bill-clinton-accuses-trump-using-him-scapegoat-after-epstein-files-drop-3793456",
    "timestamp": "2025-12-22T12:47:40Z"
  },
  {
    "title": "WATCH: Here’s the Trailer for the 60 Minutes Segment On CECOT Which Bari Weiss Abruptly Yanked",
    "description": "The 60 Minutes segment that was abruptly postponed this weekend was pulled from its slot so close to airing that a trailer for the piece was already posted on– and subsequently yanked off– the official CBS website. The show had planned to air a segment on CEC…",
    "link": "https://www.mediaite.com/media/news/watch-heres-the-trailer-for-the-60-minutes-segment-on-cecot-which-bari-weiss-abruptly-yanked/",
    "timestamp": "2025-12-22T12:47:24Z"
  },
  {
    "title": "CBS Journalist Says Bari Weiss Spiked Segment on Notorious El Salvador Prison for 'Political' Reasons",
    "description": "A CBS News correspondent on Sunday accused Bari Weiss, the outlet's editor-in-chief, of pulling a \"60 Minutes\" segment on El Salvador's notorious CECOT prison for \"political\" reasons, shortly before it was scheduled to air.Late Sunday afternoon, \"60 Minutes\" …",
    "link": "https://www.commondreams.org/news/bari-weiss-cecot-segment",
    "timestamp": "2025-12-22T12:45:55Z"
  },
  {
    "title": "Trump's contempt is confirmed by this rising obscenity",
    "description": "The White House has always mattered because of what it represents. It was never supposed to be a palace; it was meant to be the people’s house, a physical reminder that power in America is borrowed, temporary, and accountable.That’s why the news that Donald T…",
    "link": "https://www.rawstory.com/raw-investigates/2674814485/",
    "timestamp": "2025-12-22T12:45:35Z"
  },
  {
    "title": "Monday: Hili dialogue",
    "description": "Welcome to the last Monday before Christmas and the onset of Koynezaa.  We are now into winter in the Northern Hemisphere: it’s Monday, December 22, 2025, and it’s National Date Nut Bread Day, an okay pastry if it’s slathered with cream cheese, comme ça.  Cha…",
    "link": "https://whyevolutionistrue.com/2025/12/22/monday-hili-dialogue-548/",
    "timestamp": "2025-12-22T12:45:17Z"
  },
  {
    "title": "Denmark and Greenland vow that the US won't take over Greenland after Trump appoints envoy (Geir Moulson/Associated Press)",
    "description": "Geir Moulson / Associated Press:\nDenmark and Greenland vow that the US won't take over Greenland after Trump appoints envoy  —  The leaders of Denmark and Greenland insisted Monday that the U.S. won't take over Greenland and demanded respect for their territo…",
    "link": "https://www.memeorandum.com/251222/p16",
    "timestamp": "2025-12-22T12:45:01Z"
  },
  {
    "title": "Dire warning sounded over Trump’s new 'instrument of corruption'",
    "description": "While overall job creation in 2025 saw a “sharp slowdown\r\n” when compared to the previous year, President Donald Trump did spark a boom in one industry: the pardon lobbying business, which law professor Kim Wehl wrote\r\n was “booming” thanks to the president h…",
    "link": "https://www.rawstory.com/trump-2674820669/",
    "timestamp": "2025-12-22T12:43:48Z"
  },
  {
    "title": "Rosie O'Donnell Melts Down After Trump Adds His Name to the Kennedy Center: ‘It Needs to Be Removed from Office’",
    "description": "Comedian Rosie O’Donnell fled the U.S. and rushed to Ireland as soon as it became clear President Donald Trump would be returning to the White House. She has been shouting trans-Atlantic abuse at him ever since. The leftist stepped up again on the weekend and…",
    "link": "https://www.breitbart.com/entertainment/2025/12/22/rosie-odonnell-melts-down-after-trump-adds-his-name-to-the-kennedy-center-it-needs-to-be-removed-from-office/",
    "timestamp": "2025-12-22T12:41:39Z"
  },
  {
    "title": "War in Ukraine: Whitkov described talks in Miami as “constructive,” but no clear progress was made",
    "description": "Trump’s envoy stated that European officials participated in the talks, but an EU representative denied this – The gap between Kyiv and Moscow remains wide\nThe post War in Ukraine: Whitkov described talks in Miami as “constructive,” but no clear progress was …",
    "link": "https://en.protothema.gr/2025/12/22/war-in-ukraine-whitkov-described-talks-in-miami-as-constructive-but-no-clear-progress-was-made/",
    "timestamp": "2025-12-22T12:39:12Z"
  },
  {
    "title": "Moscow car blast kills Russian general hours after US talks",
    "description": "Sarvarov fought in the Russian army's campaigns in the North Caucasus and commanded Russian forces in Syria",
    "link": "https://www.euractiv.com/news/moscow-car-blast-kills-russian-general-hours-after-us-talks/",
    "timestamp": "2025-12-22T12:38:50Z"
  },
  {
    "title": "Every Celebrity Named in Epstein Files as DOJ Releases Explosive Photos After Congress Intervention",
    "description": "DOJ releases thousands of unseen Epstein files after Congress mandate, exposing ties to Clinton, Michael Jackson, Mick Jagger, and Prince Andrew.",
    "link": "https://www.ibtimes.com/every-celebrity-named-epstein-files-doj-releases-explosive-photos-after-congress-intervention-3793464",
    "timestamp": "2025-12-22T12:38:33Z"
  },
  {
    "title": "Pras Michel faces legal battle over jail bid",
    "description": "Pras Michel, the Fugees rapper, is seeking to delay reporting to prison while appealing his 14-year sentence following convictions for international fraud and acting as an unregistered foreign agent. The case has attracted national attention, raising question…",
    "link": "https://rollingout.com/2025/12/22/pras-michel-legal-battle-over-jail-bid/",
    "timestamp": "2025-12-22T12:37:09Z"
  },
  {
    "title": "Trump is touting a smaller trade deficit. Economists paint a more complicated picture.",
    "description": "Trump is touting tariff revenues and a shrinking trade deficit as his economic accomplishments ahead or midterms, but economists say it's complicated.",
    "link": "https://www.businessinsider.com/economists-paint-a-complicated-picture-of-trumps-economic-outcomes-2025-12",
    "timestamp": "2025-12-22T12:34:01Z"
  },
  {
    "title": "Nvidia aims to begin H200 chip shipments to China by mid-February: Sources",
    "description": "Nvidia has told Chinese clients it aims to start shipping its second-most powerful AI chips to China before the Chinese New Year holiday in mid-February, three people familiar with the ⁠matter told Reuters.The United States chipmaker plans to fulfil initial o…",
    "link": "https://www.channelnewsasia.com/east-asia/nvidia-aim-h200-chip-shipment-china-mid-february-5672831",
    "timestamp": "2025-12-22T12:33:00Z"
  },
  {
    "title": "Justice Department Restores Image of Trump",
    "description": "“The Department of Justice restored online a photo from the Jeffrey Epstein files that contained images showing President Donald Trump after backlash over its removal,” CNBC reports. “Deputy Attorney General Todd Blanche earlier said the DOJ removed several E…",
    "link": "https://politicalwire.com/2025/12/22/justice-department-restores-image-of-trump/",
    "timestamp": "2025-12-22T12:32:55Z"
  },
  {
    "title": "Pelosi says Trump's 'mental incapacity' was on display during address to nation",
    "description": "Former Speaker Nancy Pelosi told ABC News that President Donald Trump's \"mental incapacity\" was on display during his address to the nation.",
    "link": "https://www.foxnews.com/media/pelosi-says-trumps-mental-incapacity-display-during-address-nation",
    "timestamp": "2025-12-22T12:30:04Z"
  },
  {
    "title": "The Unifying Potential of Charlie Kirk’s Last Words",
    "description": "A new book by the right-wing activist, who was murdered in September, has moments of seriousness, beauty, and cross-partisan appeal.",
    "link": "https://www.theatlantic.com/books/2025/12/why-charlie-kirk-loved-jewish-sabbath/685374/",
    "timestamp": "2025-12-22T12:30:00Z"
  },
  {
    "title": "Coast Guard Pursues 3rd Venezuelan Oil Tanker as Tensions Rise",
    "description": "The United States Coast Guard is “in active pursuit” of another sanctioned oil tanker off the Venezuelan coast as President Donald Trump leaves the possibility of war with Venezuela on the table. One official tells NBC News the vessel “is part of Venezuela’s …",
    "link": "https://www.today.com/video/us-coast-guard-in-active-pursuit-of-3rd-venezuelan-oil-tanker-254840389595",
    "timestamp": "2025-12-22T12:27:26Z"
  },
  {
    "title": "Michigan Election Integrity Warriors Stop ‘Disastrous’ Ranked-Choice Voting Drive",
    "description": "'... Our leaders uncovered an army of Michiganders eager to join our opposition once they learned the truth about Ranked Choice Voting,' Patrice Johnson said.",
    "link": "https://thefederalist.com/2025/12/22/michigan-election-integrity-warriors-stop-disastrous-ranked-choice-voting-drive/",
    "timestamp": "2025-12-22T12:26:34Z"
  },
  {
    "title": "Trump names envoy to Greenland, sparking fresh row with Denmark",
    "description": "Denmark warns Washington to respect its sovereignty, while Greenland says it will decide its own future.",
    "link": "https://www.bbc.com/news/articles/ckgmd132ge4o",
    "timestamp": "2025-12-22T12:25:59Z"
  },
  {
    "title": "Denmark and Greenland vow that the US won’t take over Greenland after Trump appoints envoy",
    "description": "Trump’s announcement on Sunday that Louisiana Gov. Jeff Landry would be the U.S. special envoy to Greenland prompted a new flare-up of tensions.",
    "link": "https://www.bostonherald.com/2025/12/22/trump-greenland-envoy-denmark-reaction/",
    "timestamp": "2025-12-22T12:22:50Z"
  },
  {
    "title": "Tech stocks rebound, Google's boomerang strategy, Xbox's slump and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/12/22/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-12-22T12:22:31Z"
  },
  {
    "title": "“Greatest Freudian Slip Of All Time”: Erika Kirk’s Awkward Mistake At TPUSA Event Goes Viral",
    "description": "“This is the greatest Freudian slip of all time.”",
    "link": "https://www.boredpanda.com/erika-kirk-freudian-slip-mistake-turning-point-usa-event/",
    "timestamp": "2025-12-22T12:22:20Z"
  },
  {
    "title": "Redacted Epstein Files on DOJ Website Allegedly Includes POTUS with 'Ivanka Trump,' Sparking Debate on True Identity",
    "description": "Briefly removed Epstein-related files on the DOJ website have ignited online debate after a redacted photo appears to show the US president alongside a blonde woman some claim resembles a young Ivanka Trump.",
    "link": "https://www.ibtimes.com/redacted-epstein-files-doj-website-allegedly-includes-potus-ivanka-trump-sparking-debate-true-3793390",
    "timestamp": "2025-12-22T12:22:04Z"
  },
  {
    "title": "'Chew on that': Morning Joe flags huge admission Todd Blanche made with Trump slip",
    "description": "Donald Trump's former personal lawyer Todd Blanche did the president no favors with his appearance on NBC’s “Meet the Press” on Sunday when he stumbled while trying to describe the women who were seen in a picture with Trump that was in Jeffrey Epstein’s poss…",
    "link": "https://www.rawstory.com/trump-photo-victims/",
    "timestamp": "2025-12-22T12:21:03Z"
  },
  {
    "title": "What Do Nicki Minaj, JD Vance, and Grindr Have in Common?",
    "description": "They were the lowlights of Turning Point USA’s Americafest Convention over the weekend.",
    "link": "https://www.jezebel.com/what-do-nicki-minaj-jd-vance-and-grindr-have-in-common",
    "timestamp": "2025-12-22T12:20:44Z"
  },
  {
    "title": "Charlie Kirk 'Murder Tent' Replica Installed By Turning Point USA For 'Selfies' - The Internet Finds It Weird",
    "description": "Turning Point USA's AmericaFest in Phoenix featured a replica of the tent where Charlie Kirk was killed, sparking viral backlash and criticism online.",
    "link": "https://www.ibtimes.com/charlie-kirk-murder-tent-replica-installed-turning-point-usa-selfies-internet-finds-it-3793401",
    "timestamp": "2025-12-22T12:17:16Z"
  },
  {
    "title": "As winter takes hold, South Florida hotels and businesses hope Canadians come back",
    "description": "South Florida hoteliers hope for an uptick in visits from Canadian snowbirds, many of whom were offended by harsh rhetoric toward their country from Washington.",
    "link": "https://www.sun-sentinel.com/2025/12/22/as-winter-takes-hold-south-florida-hotels-and-businesses-hope-canadians-come-back/",
    "timestamp": "2025-12-22T12:14:26Z"
  },
  {
    "title": "Denmark to summon US ambassador following Greenland envoy appointment",
    "description": "Copenhagen slams Jeff Landry's statement regarding annexation of the territory as 'totally unacceptable'.",
    "link": "https://www.aljazeera.com/news/2025/12/22/denmark-to-summon-us-ambassador-following-greenland-envoy-appointment",
    "timestamp": "2025-12-22T12:14:10Z"
  },
  {
    "title": "NYC Mayor Eric Adams once called himself the 'future of the Democratic Party.' What went wrong?",
    "description": "New York City Mayor Eric Adams was once seen as a rising star in the Democratic Party",
    "link": "https://abcnews.go.com/Politics/wireStory/nyc-mayor-eric-adams-called-future-democratic-party-128613985",
    "timestamp": "2025-12-22T12:13:51Z"
  },
  {
    "title": "Top Economist Warns Unemployment, Not Stock Prices, Is True Measure Of Economic Health: 'Close To Zero Jobs' Created Since Tariffs Were Introduced",
    "description": "Top Economist Warns Unemployment, Not Stock Prices, Is True Measure Of Economic Health: 'Close To Zero Jobs' Created Since Tariffs Were Introducednewsbreak.com",
    "link": "https://www.newsbreak.com/share/4408230894743-top-economist-warns-unemployment-not-stock-prices-is-true-measure-of-economic-health-close-to-zero-jobs-created-since-tariffs-were-introduced?_f=app_share&amp;pd=0DVWQmpv&amp;lang=en_US&amp;send_time=1766405391&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.15.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-12-22T12:11:22Z"
  },
  {
    "title": "Clashes in DR Congo’s Uvira after M23 promised to withdraw",
    "description": "Fresh clashes erupt near Uvira in DR Congo between M23 rebels and pro-government militia, despite M23’s recent promise to withdraw from the strategic city.\n\nRead More: https://punchng.com/clashes-in-dr-congos-uvira-after-m23-promised-to-withdraw/",
    "link": "https://punchng.com/?p=2016667",
    "timestamp": "2025-12-22T12:10:48Z"
  },
  {
    "title": "The ‘Epstein Files’ were released but it’s just page after page of redactions",
    "description": "Embed from Getty Images In retrospect, the House Oversight Committee Democrats’ slow-drip release of the Jeffrey Epstein files has been one of the most effective political plays in recent memory. Each new photo or email became a huge story and dominated the n…",
    "link": "https://www.celebitchy.com/954825/the_epstein_files_were_released_but_its_just_page_after_page_of_redactions/",
    "timestamp": "2025-12-22T12:08:28Z"
  },
  {
    "title": "Most aren't making year-end contributions to charity, poll finds",
    "description": "A new AP-NORC poll finds that most Americans aren’t making end-of-year charitable giving plans, despite the many fundraising appeals made by nonprofits that rely on donation surges in the calendar’s final month to reach next year’s budget targets. The survey …",
    "link": "https://apnews.com/article/poll-giving-charity-givingtuesday-571ae1e6be08bc506cc818956227079d",
    "timestamp": "2025-12-22T12:08:06Z"
  },
  {
    "title": "Four ‘wow’ moments from Nicki Minaj and Erika Kirk’s Turning Point USA Q&A",
    "description": "Rapper Nicki Minaj threw her full support behind Donald Trump and his Republican administration during an appearance at Turning Point USA’s AmericaFest, alongside Charlie Kirk’s widow Erika Kirk. The four-day conservative conference, which took place in Arizo…",
    "link": "https://www.thepinknews.com/2025/12/22/nicki-minaj-erika-kirk-turning-point-usa/",
    "timestamp": "2025-12-22T12:06:49Z"
  },
  {
    "title": "Trump 'Scrubbed' Files: DOJ Caught 'With Hands In Cookie Jar' Over Deleted Epstein Photos",
    "description": "Donald Trump's DOJ faces backlash after 16 photos, including one featuring the president and Jeffrey Epstein, were briefly removed from public files.",
    "link": "https://www.ibtimes.com/trump-scrubbed-files-doj-caught-hands-cookie-jar-over-deleted-epstein-photos-3793368",
    "timestamp": "2025-12-22T12:05:44Z"
  },
  {
    "title": "Trump Stays In Epstein Files — Justice Department Says No Change",
    "description": "DOJ restores Trump photo in Epstein files after review, saying redactions are only those required by law.",
    "link": "https://www.ibtimes.com/trump-stays-epstein-files-justice-department-says-no-change-3793364",
    "timestamp": "2025-12-22T12:04:31Z"
  },
  {
    "title": "Susie Wiles destroys self-made reputation by revealing 'itch': columnist",
    "description": "White House chief of staff Susie Wiles revealed an \"itch\" that makes her no different from the rest of the self-promoters and cranks in President Donald Trump's orbit, a columnist observed.The president's top staffer gave a series of shockingly revealing inte…",
    "link": "https://www.rawstory.com/susie-wiles-interview-2674820484/",
    "timestamp": "2025-12-22T12:04:20Z"
  },
  {
    "title": "Most Damning Epstein Photo Of All: Disinformation On Bill Clinton",
    "description": "Wow, they're really desperate.\nThat a White House press secretary thought it would help Donald Trump bluff his way through the release of the Epstein files by including an unrelated photo of Bill Clinton, Michael Jackson, and Diana Ross AT A DEMOCRATIC FUNDRA…",
    "link": "https://crooksandliars.com/2025/12/most-damning-epstein-photo-all",
    "timestamp": "2025-12-22T12:04:13Z"
  },
  {
    "title": "Rubio and Witkoff clash on diplomacy and U.S. pursues a third vessel off Venezuela: Morning Rundown",
    "description": "How the divide between Secretary of State Marco Rubio and President Donald Trump’s envoy, Steve Witkoff plays out could determine how the war in Ukraine ends and how the U.S. is perceived by its allies and adversaries.",
    "link": "https://www.nbcnews.com/news/us-news/rubio-witkoff-venezuela-morning-rundown-rcna250289",
    "timestamp": "2025-12-22T12:01:15Z"
  },
  {
    "title": "A greater threat to Colorado’s elections than Tina Peters? (Opinion)",
    "description": "The real threat to election integrity got comparatively fewer headlines back in November when one out of three of the Arapahoe County Canvass Board refused to certify the results of the 2025 election.",
    "link": "https://www.denverpost.com/2025/12/22/colorado-elections-canvass-board-refusing-certify/",
    "timestamp": "2025-12-22T12:01:02Z"
  },
  {
    "title": "2025 in review: July to September",
    "description": "In part three of C21's look back at the trends, challenges and shocks of 2025, Donald Trump once again looms large in stories involving South Park and Jimmy Kimmel, while the streamers further increase their dominance of the global content landscape.",
    "link": "https://www.c21media.net/department/news-analysis/2025-in-review-july-to-september/",
    "timestamp": "2025-12-22T12:00:21Z"
  },
  {
    "title": "2025 lookback: Trump yanks federal funding from NPR in move conservative advocates said was long overdue",
    "description": "NPR was long lambasted by President Trump and other Republicans as a left-leaning institution that didn’t deserve taxpayer money, and after years of banter, federal funding was cut in 2025.",
    "link": "https://www.foxnews.com/media/2025-look-back-trump-yanks-federal-funding-from-npr-move-conservative-advocates-said-long-overdue",
    "timestamp": "2025-12-22T12:00:10Z"
  },
  {
    "title": "The Key Foreign-Policy Players of Trump 2.0",
    "description": "As the second Trump administration approaches the one-year mark, here’s who is influencing key policies.",
    "link": "http://foreignpolicy.com/2025/12/22/trump-administration-key-players-witkoff-miller-hegseth-rubio-bessent-vance/",
    "timestamp": "2025-12-22T12:00:04Z"
  }
]