[
  {
    "title": "John Oliver Spends 40 Minutes Defending Trans In Sports: \"There Is No Evidence They Pose Any Threat To Safety Or Fairness\"",
    "description": "HBO: John Oliver discusses why trans athletes seem to be at the center of U.S. politics right now, the nuances around competition and safety, and where the conversation could be headed.\n\nAuthor J.K. Rowling told Oliver to \"read the f*cking room\" in a response…",
    "link": "https://www.realclearpolitics.com/video/2025/04/07/john_oliver_spends_40_minutes_defending_trans_in_sports_there_is_no_evidence_they_pose_any_threat_to_safety_or_fairness.html",
    "timestamp": "2025-04-07T20:55:41Z"
  },
  {
    "title": "'If You Can Keep It': The Federal Health Firings",
    "description": "The nation's health administration is the latest target of the Trump administration's effort to dismantle the federal bureaucracy. That's after Health Secretary Robert F. Kennedy Jr. slashed 10,000 jobs at the Department of Health and Human Services early las…",
    "link": "https://www.npr.org/2025/04/07/1243303432/1a-iyckihhs-04-07-2025",
    "timestamp": "2025-04-07T20:55:39Z"
  },
  {
    "title": "Maine sues the Trump administration over funding freeze after dispute over transgender athletes | CNN",
    "description": "Maine officials sued the administration of President Donald Trump on Monday to try to stop the government from freezing federal money in the wake of a dispute over transgender athletes in sports.",
    "link": "https://www.cnn.com/2025/04/07/us/maine-trump-funding-freeze-transgender-athletes/index.html",
    "timestamp": "2025-04-07T20:55:19Z"
  },
  {
    "title": "Maine Sues Over Funding Freeze Affecting Child Nutrition Program",
    "description": "Maine Attorney General Aaron Frey wrote that the pause is “illegally withholding grant funds that go to keeping children fed.”",
    "link": "https://www.huffpost.com/entry/ap-us-trump-education-maine_n_67f43a88e4b0743a1e466531",
    "timestamp": "2025-04-07T20:55:14Z"
  },
  {
    "title": "World's second largest automaker makes dramatic move as it stops all US car imports (Volkswagon again)",
    "description": "Volkswagen is holding cars at US ports amid tariff turmoil. Audi, the luxury arm of the world's second largest global automaker, has confirmed it's in a high-stakes holding pattern triggered by President Donald Trump's 25 percent tariff on imported vehicles. …",
    "link": "https://freerepublic.com/focus/f-chat/4309525/posts",
    "timestamp": "2025-04-07T20:54:40Z"
  },
  {
    "title": "‘We’ll See What Can Happen’: Trump Teases Upcoming Nuclear Talks With Iran",
    "description": "President Donald Trump revealed Monday that the U.S. would have a high-profile meeting with Iran on Saturday and was in \"direct talks\" with Iran.",
    "link": "https://dailycaller.com/2025/04/07/donald-trump-iran-nuclear-talks/",
    "timestamp": "2025-04-07T20:54:36Z"
  },
  {
    "title": "Levi’s Q1 Brings Strength Into Trump’s Tariff Mayhem",
    "description": "Levi's posts strong Q1 results with 9 percent organic sales growth. CEO Michelle Gass addresses tariff challenges and strategic resilience.",
    "link": "http://wwd.com/business-news/financial/levis-q1-2025-growth-tariffs-challenges-1237076426/",
    "timestamp": "2025-04-07T20:54:23Z"
  },
  {
    "title": "Democrats just had their best week since Election Day",
    "description": "Democrats had their best week since Trump's election, as people across the country hold protests and rebuke the president at the ballot box.",
    "link": "https://www.msnbc.com/top-stories/latest/democrats-best-week-trump-protests-rcna200040",
    "timestamp": "2025-04-07T20:53:50Z"
  },
  {
    "title": "Trump, Netanyahu discuss tariffs, geopolitics in Washington",
    "description": "Israeli Prime Minister Benjamin Netanyahu met with U.S. President Donald Trump in Washington on April 7, becoming the first foreign leader to visit Trump since he unleased tariffs on countries around the world.",
    "link": "https://www.hurriyetdailynews.com/trump-netanyahu-discuss-tariffs-geopolitics-in-washington-207794",
    "timestamp": "2025-04-07T20:53:08Z"
  },
  {
    "title": "Trump vows huge new China tariffs as markets nosedive",
    "description": "US President Donald Trump on Monday threatened fresh tariffs of 50 percent on China and ruled out any pause in his aggressive new global trade policy...",
    "link": "https://www.yahoo.com/news/trump-vows-huge-china-tariffs-165943818.html",
    "timestamp": "2025-04-07T20:52:17Z"
  },
  {
    "title": "NSA firings stoke fears of Trump installing a partisan loyalist to lead spy agency",
    "description": "“We saw it’s possible, without adequate oversight, for our spy agencies to do inappropriate things,” a former senior intelligence official said, referencing the 1970s congressional investigations that revealed many spying abuses against Americans.",
    "link": "https://www.nextgov.com/people/2025/04/nsa-firings-stoke-fears-trump-installing-partisan-loyalist-lead-spy-agency/404361/",
    "timestamp": "2025-04-07T20:52:00Z"
  },
  {
    "title": "‘A Path of Perfect Lawlessness’",
    "description": "The Trump administration’s arguments in a high-profile immigration case have much broader implications.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/deportations-trump-supreme-court/682329/",
    "timestamp": "2025-04-07T20:51:17Z"
  },
  {
    "title": "US Supreme Court pauses order for return of Salvadoran deported in error",
    "description": "The US Supreme Court on Monday paused a lower court order demanding that the Trump administration repatriate a Salvadoran migrant who was wrongfully deported last month. Kilmar Abrego Garcia, 29, who was living in the eastern state of Maryland, was among more…",
    "link": "https://www.digitaljournal.com/world/us-supreme-court-pauses-order-for-return-of-salvadoran-deported-in-error/article",
    "timestamp": "2025-04-07T20:50:09Z"
  },
  {
    "title": "Trump says US and Iran beginning direct talks on Tehran’s nuclear programme",
    "description": "USA-IRAN/TRUMP (UPDATE 2, PIX, TV):UPDATE 2-Trump says US and Iran beginning direct talks on Tehran's nuclear program",
    "link": "https://www.irishtimes.com/world/middle-east/2025/04/07/trump-says-us-and-iran-beginning-direct-talks-on-tehrans-nuclear-programme/",
    "timestamp": "2025-04-07T20:49:46Z"
  },
  {
    "title": "Dem Strategist Admits Biden’s Debate Performance Was ‘Shock To The System’ For Party’s Activists On ‘Front Lines’",
    "description": "A Democratic strategist admitted Joe Biden’s poor performance during a June 27, 2024, debate with Donald Trump “shocked” Democrats on “the front lines.”",
    "link": "https://dailycaller.com/2025/04/07/dem-strategist-admits-bidens-debate-performance-shock-system-partys-activists/",
    "timestamp": "2025-04-07T20:49:23Z"
  },
  {
    "title": "Flexport CEO Ryan Petersen’s high-stakes test amid tariff turmoil: ‘You can’t be freaking out’",
    "description": "At 11 a.m. in California last Thursday, the day after President Donald Trump declared sweeping new tariffs under what he dubbed “Liberation Day,” Ryan Petersen was live on camera, fielding questions from a virtual room packed with more than 2,300 anxious cust…",
    "link": "https://biztoc.com/x/caa800ead760e407",
    "timestamp": "2025-04-07T20:48:58Z"
  },
  {
    "title": "John Rich Told Donald Trump Why He Was Being Booed at His Own Rallies",
    "description": "Country singer John Rich said during a podcast interview released on Monday that he advised Donald Trump to stop talking about the COVID-19 vaccines when the president asked why he was being booed at his own rallies.\nNewsweek has reached out to the White Hous…",
    "link": "https://biztoc.com/x/53e86fc7949018c5",
    "timestamp": "2025-04-07T20:48:53Z"
  },
  {
    "title": "Trump says he is 'not looking' to pause tariffs before this week's rollout despite market uncertainty",
    "description": "President Donald Trump said he is not looking to pause his tariffs before they go into effect on April 9, despite turmoil in the stock market and global economic fears.",
    "link": "https://biztoc.com/x/d218c0d0c4fb5d72",
    "timestamp": "2025-04-07T20:48:51Z"
  },
  {
    "title": "China says Trump tariffs 'economic bullying' as Asia scrambles to cut deals",
    "description": "Beijing says Donald Trump's tariffs will increase the divide between rich and poor nations, as countries across the region grapple with what to do next.",
    "link": "https://www.abc.net.au/news/2025-04-08/china-says-us-tariff-policy-is-economic-bullying/105148726",
    "timestamp": "2025-04-07T20:48:23Z"
  },
  {
    "title": "US Supreme Court Pauses Order For Return Of Salvadoran Deported In Error",
    "description": "The US Supreme Court on Monday paused a lower court order demanding that the Trump administration repatriate a Salvadoran migrant who was wrongfully deported last month.",
    "link": "https://www.ibtimes.com/us-supreme-court-pauses-order-return-salvadoran-deported-error-3769131",
    "timestamp": "2025-04-07T20:48:18Z"
  },
  {
    "title": "'Doesn't make any sense': Expert says Trump official 'misunderstands' how markets work",
    "description": "President Donald Trump's Treasury Secretary Scott Bessent doesn't appear to understand the basics of how the stock market works, analyst Natasha Sarin told CNN's Boris Sanchez and Brianna Keilar on Monday afternoon.Trump's imposition of tariffs on goods purch…",
    "link": "https://www.rawstory.com/trump-markets/",
    "timestamp": "2025-04-07T20:47:47Z"
  },
  {
    "title": "Survey: 55 Percent of Leftists Say Trump Murder Would Be Justified",
    "description": "A majority of self-identified leftists say it would be at least somewhat justified to murder President Donald Trump, according to a new survey. The Network Contagion Research Institute and Rutgers University's Social Perception Lab on Monday released results …",
    "link": "https://freerepublic.com/focus/f-news/4309521/posts",
    "timestamp": "2025-04-07T20:47:24Z"
  },
  {
    "title": "Trump Doubles Down on Trade Plans, Threatening Additional Tariffs Against China",
    "description": "Trump is standing firm in his trade plans and threatened to increase tariffs against China on Monday",
    "link": "https://time.com/7275566/trump-threatens-more-tariffs-china/",
    "timestamp": "2025-04-07T20:47:12Z"
  },
  {
    "title": "All the People and Entities Trump is Seeking to Crush in His Presidential Term of Vengeance",
    "description": "Just so we are clear, President Donald Trump is on a mission of political payback. For the past 1,848 hours -- and yes, we are counting—Trump has made it abundantly clear that he is seeking to dismantle all remnants of Joe Biden and Barack Obama’s administrat…",
    "link": "https://www.theroot.com/all-the-people-and-entities-trump-is-seeking-to-crush-i-1851775158",
    "timestamp": "2025-04-07T20:46:00Z"
  },
  {
    "title": "John Rich Told Donald Trump Why He Was Being Booed at His Own Rallies",
    "description": "The country singer said he advised Trump to stop discussing one of his key accomplishments to avoid being booed by his own supporters.",
    "link": "https://www.newsweek.com/john-rich-donald-trump-operation-warp-speed-2056543",
    "timestamp": "2025-04-07T20:45:58Z"
  },
  {
    "title": "‘The White Lotus’ Season 3 Finale: What Worked, What Didn’t, and What’s Next",
    "description": "The discourse this season went way off the rails, but did it ultimately take \"The White Lotus\" with it? Two IndieWire writers debate the merits of Season 3.",
    "link": "https://www.indiewire.com/features/commentary/the-white-lotus-season-3-finale-what-worked-what-didnt-1235113704/",
    "timestamp": "2025-04-07T20:45:00Z"
  },
  {
    "title": "Stream It Or Skip It: ‘2073’ on Max, a Hybrid Documentary/Sci-fi Story Speculating on Society’s Desmise",
    "description": "Oscar-winning Amy documentary director Asif Kapadia finds no room for hope in this story.",
    "link": "https://decider.com/2025/04/07/2073-hbo-max-movie-review/",
    "timestamp": "2025-04-07T20:45:00Z"
  },
  {
    "title": "Miami-Dade County Commission Votes to Remove Fluoride from Water Supply",
    "description": "Miami-Dade in Florida is the latest county to vote to remove fluoride from the water supply.\nThe post Miami-Dade County Commission Votes to Remove Fluoride from Water Supply appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/07/miami-dade-county-commission-votes-to-remove-fluoride-from-water-supply/",
    "timestamp": "2025-04-07T20:44:59Z"
  },
  {
    "title": "Amid fears of immigration raids, Latino churches rethink how to conduct services",
    "description": "Even in areas where congregations supported President Donald Trump in last year’s election, churches are \"tremendously alarmed,\" the head of a network of Latino pastors said.",
    "link": "https://www.nbcnews.com/news/latino/latino-churches-immigration-raids-fears-deportation-rcna199982",
    "timestamp": "2025-04-07T20:43:22Z"
  },
  {
    "title": "Trump Adviser Releases Insane List of Demands for Tariffed Countries",
    "description": "Donald Trump’s chief economic adviser put out a list of outrageous demands Monday for other countries inflicted by the president’s tariffs to start “burden sharing.”\r\nStephen Miran, chair of the Council of Economic Advisers, delivered a speech at the Hudson I…",
    "link": "https://newrepublic.com/post/193700/donald-trump-economic-adviser-demands-tariffs",
    "timestamp": "2025-04-07T20:43:10Z"
  },
  {
    "title": "Will the tariffs lead to a recession? Here's how to know if we're in one",
    "description": "President Donald Trump’s sharp tariff hikes last week have sent the stock market into a tailspin, raised alarm bells among Wall Street executives, and heightened many economists’ worries that the U.S. could tip into recession",
    "link": "https://abcnews.go.com/US/wireStory/tariffs-lead-recession-120573508",
    "timestamp": "2025-04-07T20:42:37Z"
  },
  {
    "title": "Brussels eyes 25 percent tariffs in response to Trump",
    "description": "EU considers €22 billion hit on American goods in response to Trump's tariffs announced last week.",
    "link": "https://www.politico.eu/article/belgium-brussels-donald-trump-tariffs-metals-exports/",
    "timestamp": "2025-04-07T20:42:14Z"
  },
  {
    "title": "NASA Nominee Plans to Prioritize America First Agenda in Space, Not DEI",
    "description": "The next mission to the moon will advance the “America First” agenda through space exploration, rather than the Biden administration’s diversity, equity, and inclusion goals,... Read More\nThe post NASA Nominee Plans to Prioritize America First Agenda in Space…",
    "link": "https://www.dailysignal.com/2025/04/07/incoming-nasa-director-plans-make-space-great-again-establishing-agency-merit-not-dei/",
    "timestamp": "2025-04-07T20:41:45Z"
  },
  {
    "title": "Brazil to reinstate visas for US, Canadian and Australian citizens",
    "description": "Brazil will reintroduce on Thursday visa requirements for U.S., Canadian and Australian citizens",
    "link": "https://abcnews.go.com/International/wireStory/brazil-reinstate-visas-us-canadian-australian-citizens-120574239",
    "timestamp": "2025-04-07T20:41:41Z"
  },
  {
    "title": "Canada deploying with the Brits instead of U.S. Navy 'just a happy coincidence'",
    "description": "It’s rare that Canadian warships join Royal Navy formations, but \"ship deployments are typically planned long in advance.\"",
    "link": "https://nationalpost.com/news/canada/canadian-navy-ship-deploying-with-british-a-happy-coincidence",
    "timestamp": "2025-04-07T20:41:22Z"
  },
  {
    "title": "Trump claims US has held direct nuclear talks with Iran",
    "description": "US president makes claim in an appearance in front of the press with Israeli PM Netanyahu, but also threatens Tehran.",
    "link": "https://www.aljazeera.com/news/2025/4/7/trump-claims-direct-us-talks-with-iran-on-nuclear-deal-have-begun",
    "timestamp": "2025-04-07T20:41:02Z"
  },
  {
    "title": "As the ‘Special Relationship’ Is Faltering, Can British Spies Work Without US Capabilities and Intel Sharing?",
    "description": "As the foundation of the US-UK alliance shows signs of strain, this analysis delves into the implications for British intelligence operations amid decreasing American support and collaboration.\nThe post As the ‘Special Relationship’ Is Faltering, Can British …",
    "link": "https://www.thegatewaypundit.com/2025/04/as-special-relationship-is-faltering-can-british-spies/",
    "timestamp": "2025-04-07T20:40:23Z"
  },
  {
    "title": "Expanding AI use, White House orders agencies to develop strategies and name leaders",
    "description": "WASHINGTON :The White House said on Monday it is ordering federal agencies to name chief AI officers and develop strategies for an expansion of the government's use of artificial intelligence, rescinding Biden-era orders intended to place safeguards on the te…",
    "link": "https://www.channelnewsasia.com/business/expanding-ai-use-white-house-orders-agencies-develop-strategies-and-name-leaders-5050216",
    "timestamp": "2025-04-07T20:39:51Z"
  },
  {
    "title": "United States Accidentally Places Tariffs On Penguins Unable To Pay",
    "description": "Donald Trump’s sweeping new tariffs didn’t just target America’s major trading partners — they’ve somehow reached a remote, uninhabited island territory populated only by penguins.",
    "link": "https://coed.com/2025/04/07/united-states-accidentally-places-tariffs-on-penguins-unable-to-pay/",
    "timestamp": "2025-04-07T20:39:11Z"
  },
  {
    "title": "Is JFK grandson Jack Schlossberg having a baby with Second Lady Usha Vance? Here’s the complete truth",
    "description": "Jack Schlossberg, grandson of John F Kennedy, joked on social media that he is having a baby with Usha Vance, the Second Lady of the United States. The posts included a Photoshopped image and later a clarification. Schlossberg said the joke was meant to highl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-jfk-grandson-jack-schlossberg-having-a-baby-with-second-lady-usha-vance-heres-the-complete-truth/articleshow/120074907.cms",
    "timestamp": "2025-04-07T20:38:58Z"
  },
  {
    "title": "‘Trans’ inclusion = all-male finals, the hands-off hypocrite left and other commentary",
    "description": "The protesters gathering against Donald Trump and Elon Musk want “the government to keep its hands on — on our throats choking out our freedoms and in our pockets stealing our money,” thunders the Issues & Insights Editorial Board.",
    "link": "https://nypost.com/2025/04/07/opinion/trans-inclusion-all-male-finals-the-hands-off-hypocrite-left-and-other-commentary/",
    "timestamp": "2025-04-07T20:38:21Z"
  },
  {
    "title": "‘This is the Moment!’ Kevin O’Leary Begs Trump to Find an ‘Off Ramp’ Out of Tariff Fiasco On Fox Business",
    "description": "The stock market closed down on Monday, with the Dow losing another 1% as Trump’s tariff continue to rattle investors.\nThe post ‘This is the Moment!’ Kevin O’Leary Begs Trump to Find an ‘Off Ramp’ Out of Tariff Fiasco On Fox Business first appeared on Mediait…",
    "link": "https://www.mediaite.com/tv/this-is-the-moment-kevin-oleary-begs-trump-to-find-an-off-ramp-out-of-tariff-fiasco-on-fox-business/",
    "timestamp": "2025-04-07T20:37:27Z"
  },
  {
    "title": "Trump Tariffs Test Amazon, But Goldman Says E-Commerce Giant Can Roll With It",
    "description": "Amazon.com, Inc. (NASDAQ:AMZN) shares have been down more than 10% since President Donald Trump revealed a tougher-than-expected tariff plan. \nAccording to Goldman Sachs, the Seattle-based e-commerce company could mitigate the impact of these tariffs in sever…",
    "link": "https://biztoc.com/x/9c638025dbc23747",
    "timestamp": "2025-04-07T20:37:23Z"
  },
  {
    "title": "Chief justice pauses deadline for Trump administration to return Maryland man from El Salvador",
    "description": "The temporary order comes hours after a Justice Department emergency appeal to the Supreme Court arguing U.S. District Judge Paula Xinis overstepped her authority when she ordered Kilmar Abrego Garcia returned to the United States.",
    "link": "https://www.pbs.org/newshour/politics/chief-justice-pauses-deadline-for-trump-administration-to-return-maryland-man-from-el-salvador",
    "timestamp": "2025-04-07T20:36:42Z"
  },
  {
    "title": "Laura Loomer’s Trump access reflects the reach of the far-right fringe",
    "description": "It is hardly a secret that both parties have fringes, but only one party offers its fringe access and influence at the highest levels of power.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/laura-loomers-trump-access-reflects-reach-far-right-fringe-rcna200072",
    "timestamp": "2025-04-07T20:36:04Z"
  },
  {
    "title": "S&P 500 ends down after wild session as Trump digs in on tariffs",
    "description": "The S&P 500 closed lower on Monday (Apr 7) after a roller-coaster session, with investors worried about an economic slowdown and rising inflation as US President Donald Trump dug in his heels on tariffs, warn",
    "link": "https://www.channelnewsasia.com/world/sp-500-ends-down-after-wild-session-trump-digs-tariffs-5050196",
    "timestamp": "2025-04-07T20:35:30Z"
  },
  {
    "title": "Vietnam’s bold offer to slash tariffs on U.S. goods to zero rejected by Donald Trump's adviser Peter Navarro, declares trade deficit a national emergency",
    "description": "Piter Navaro, a top trade advisor to US President Donald Trump, declined Vietnam's offer. Vietnam proposed zero tariffs on US imports. This was to postpone Trump's 46% tariff on Vietnam. Vietnam's Deputy Prime Minister, Bui Thanh Son, made the offer. Navaro c…",
    "link": "https://economictimes.indiatimes.com/news/international/us/vietnams-bold-offer-to-slash-tariffs-on-u-s-goods-to-zero-rejected-by-donald-trumps-adviser-peter-navarro-declares-trade-deficit-a-national-emergency/articleshow/120074781.cms",
    "timestamp": "2025-04-07T20:34:13Z"
  },
  {
    "title": "Trump says he is 'not looking' to pause tariffs before this week's rollout despite market uncertainty",
    "description": "President Donald Trump said he is not looking to pause his tariffs before they go into effect on April 9, despite turmoil in the stock market and global economic fears.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-says-not-looking-pause-tariffs-weeks-rollout-market-uncertainty-rcna200014",
    "timestamp": "2025-04-07T20:33:54Z"
  },
  {
    "title": "US stocks dip after careening through a manic day following Trump's latest tariff threat",
    "description": "U.S. stocks experienced a rollercoaster of day after President Trump threatened to raise tariffs, despite Wall Street's desire for a decrease.",
    "link": "https://www.wishtv.com/news/business/us-stocks-tumble-trump-tariffs/",
    "timestamp": "2025-04-07T20:32:39Z"
  },
  {
    "title": "Trump Says War In Gaza Should Stop Soon As He Hosts Israel's Netanyahu",
    "description": "U.S. President Donald Trump said on Monday he would like the war in Gaza to stop, as he hosted Israeli Prime Minister Benjamin Netanyahu at the White House.",
    "link": "https://www.ndtv.com/world-news/donald-trump-hosting-israels-benjamin-netanyahu-says-war-in-gaza-should-stop-soon-8111761",
    "timestamp": "2025-04-07T20:32:13Z"
  },
  {
    "title": "Howard Hughes investor Bill Ackman fears ‘economic nuclear war’ from Trump’s tariffs",
    "description": "Bill Ackman, whose hedge fund has a big ownership stake in Summerlin developer Howard Hughes Holdings, is raising alarms about President Donald Trump’s new tariffs.",
    "link": "https://www.reviewjournal.com/post/3348055",
    "timestamp": "2025-04-07T20:31:25Z"
  },
  {
    "title": "Trump honors 'legendary' Dodgers at White House reception",
    "description": "President Donald Trump paid tribute to the World Series champion Los Angeles Dodgers at the White House on Monday, praising the likes of Shohei Ohtani and Mookie Betts after what he described as a \"legendary\" season.Betts was present on Monday despite declini…",
    "link": "https://sports.yahoo.com/article/trump-honors-legendary-dodgers-white-203118180.html",
    "timestamp": "2025-04-07T20:31:18Z"
  },
  {
    "title": "Trump says Iran would be in ‘great danger’ if direct talks fail",
    "description": "US president says Middle East country ‘cannot have a nuclear weapon’",
    "link": "https://www.irishtimes.com/world/2025/04/07/trump-says-iran-would-be-in-great-danger-if-direct-talks-fail/",
    "timestamp": "2025-04-07T20:30:45Z"
  },
  {
    "title": "Trump fires a top U.S. military official to NATO (Politico)",
    "description": "Politico:\nTrump fires a top U.S. military official to NATO  —  Conservative media has targeted Navy Vice Admiral Shoshana Chatfield for comments she made about diversity.  —  President Donald Trump has fired one of the top U.S. military officers at NATO headq…",
    "link": "https://www.memeorandum.com/250407/p109",
    "timestamp": "2025-04-07T20:30:01Z"
  },
  {
    "title": "Trump smashes trade systems in record time",
    "description": "<p>In ten whirlwind weeks, Donald Trump had already smashed the international system of rules and alliances that more or less kept the peace for the past eighty years, but his bizarre \"tariffs on everybody\" policy has given us a glimpse of what may take its p…",
    "link": "https://www.bangkokpost.com/opinion/opinion/2997954/trump-smashes-trade-systems-in-record-time",
    "timestamp": "2025-04-07T20:30:00Z"
  },
  {
    "title": "Trump should revisit his tariff schemes",
    "description": "<p>President Donald Trump's tariff hikes, marking \"Liberation Day\", hit foes and friends of the US equally. The immediate effect is that Mr Trump has rallied the rest of the world to prepare for a future without US dominance. To put it mildly, they must becom…",
    "link": "https://www.bangkokpost.com/opinion/opinion/2997914/trump-should-revisit-his-tariff-schemes",
    "timestamp": "2025-04-07T20:30:00Z"
  },
  {
    "title": "Reporter's Notebook: Power player on Capitol Hill",
    "description": "While Trump and GOP leaders push their economic agenda, one unelected Senate referee could quietly decide what stays and what gets tossed.",
    "link": "https://www.foxnews.com/politics/reporters-notebook-power-player-capitol-hill",
    "timestamp": "2025-04-07T20:29:45Z"
  },
  {
    "title": "Britain’s Entrepreneurs Fear Uncertainty More Than A 10% Tariff",
    "description": "How will U.S. tariffs affect Britain's innovation economy startups and small goods exporters. The reaction is mixed but unpredictability and chaos are not welcome.",
    "link": "https://www.forbes.com/sites/trevorclawson/2025/04/07/britains-entrepreneurs-fear-uncertainty-more-than-a-10-tariff/",
    "timestamp": "2025-04-07T20:29:21Z"
  },
  {
    "title": "Trump says US will deal 'directly' with Iran in high-level meeting on Saturday",
    "description": "President Trump announced that the U.S. will engage directly with Iran on nuclear negotiations on Saturday though he would not comment on how the talks will differ from JCPOA agreements.",
    "link": "https://www.foxnews.com/world/trump-says-us-deal-directly-iran-high-level-meeting-saturday",
    "timestamp": "2025-04-07T20:28:17Z"
  },
  {
    "title": "Supreme Court Pauses Order for Trump Administration to Return Man Mistakenly Deported to El Salvador",
    "description": "The temporary order pauses a midnight deadline for the Trump administration to return a Maryland man mistakenly deported to  El Salvador.",
    "link": "https://time.com/7275572/abrego-garcia-return-united-states-el-salvador/",
    "timestamp": "2025-04-07T20:26:56Z"
  },
  {
    "title": "EU Commision Komisar Ursula von der Leyen Reacts to U.S. Tariffs and Prepares Countermeasures Against American Interests",
    "description": "President Donald J Trump announcing the end of the 80-year-old Marshall Plan (aka The European Recovery Program) of one-way tariffs against American imports has triggered a very predictable response from the European Union.While saying the EU is prepared to e…",
    "link": "https://freerepublic.com/focus/f-news/4309511/posts",
    "timestamp": "2025-04-07T20:26:41Z"
  },
  {
    "title": "Republicans Ted Cruz, Rand Paul speak out on risks of Trump tariff policy",
    "description": "As fallout continues from President Donald Trump's destabilizing tariff policy on virtually all U.S. trading partners, some Republican senators are warning about the risks for American families. But so far, there are limited signs of any widespread cracks in …",
    "link": "https://freerepublic.com/focus/f-news/4309510/posts",
    "timestamp": "2025-04-07T20:26:38Z"
  },
  {
    "title": "Trump: Palestinians could live in redeveloped Gaza ‘freedom zone’",
    "description": "US President Donald Trump again pitched his idea to redevelop the Gaza Strip into what he termed a “freedom zone.”",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/4/7/trump-palestinians-could-live-in-redeveloped-gaza-freedom",
    "timestamp": "2025-04-07T20:26:34Z"
  },
  {
    "title": "Cognitive Decline? Trump Calls for Open Borders in Rant on Tariffs",
    "description": "Donald Trump responded to a question about confusing tariff language from his administration by adding to the confusion. \r\nDuring a press conference with Israeli Prime Minister Benjamin Netanyahu in the Oval Office Monday, a reporter asked the president about…",
    "link": "https://newrepublic.com/post/193702/trump-open-borders-tariffs",
    "timestamp": "2025-04-07T20:26:17Z"
  },
  {
    "title": "Trump's Tariffs Violate the Constitutional Separation of Powers",
    "description": "The authority to impose tariffs is nowhere to be found in the Constitution, where the limited powers of the president are enumerated.",
    "link": "https://reason.com/2025/04/07/trumps-tariffs-violate-the-constitutional-separation-of-powers/",
    "timestamp": "2025-04-07T20:25:51Z"
  },
  {
    "title": "Stocks end modestly lower after reeling from Trump's latest threats to escalate his tariff fight",
    "description": "Stocks ended another tumultuous day lower as markets reel from President Donald Trump’s latest threats to escalate his tariff fight.",
    "link": "https://richmond.com/news/nation-world/business/article_b4aa3117-cae6-55d1-ae44-417f29ab5c55.html",
    "timestamp": "2025-04-07T20:25:00Z"
  },
  {
    "title": "Stocks end modestly lower after reeling from Trump's latest threats to escalate his tariff fight",
    "description": "Stocks ended another tumultuous day lower as markets reel from President Donald Trump’s latest threats to escalate his tariff fight.",
    "link": "https://roanoke.com/news/nation-world/business/article_1d3aa85b-2fc1-57aa-8389-8af3d1d91b58.html",
    "timestamp": "2025-04-07T20:25:00Z"
  },
  {
    "title": "Could US tariffs cause lasting damage to the global economy?",
    "description": "US President Donald Trump won't relent on tariffs despite global criticism.",
    "link": "https://www.aljazeera.com/program/inside-story/2025/4/7/could-us-tariffs-cause-lasting-damage-to-the-global-economy",
    "timestamp": "2025-04-07T20:24:20Z"
  },
  {
    "title": "Justice Roberts pauses order to return of Maryland man mistakenly deported to El Salvador",
    "description": "Chief Justice John Roberts agreed Monday to pause a midnight deadline for the Trump administration to return a Maryland man mistakenly deported to a notorious prison in El Salvador.",
    "link": "https://www.bostonherald.com/2025/04/07/justice-roberts-pauses-order-to-return-of-maryland-man-mistakenly-deported-to-el-salvador/",
    "timestamp": "2025-04-07T20:23:57Z"
  },
  {
    "title": "Dow and S&P 500 entered correction territory after Trump tariffs. What does that mean?",
    "description": "Markets rise. Markets fall. Corrections happen. What it means when an investment enters correction territory.",
    "link": "https://www.usatoday.com/story/money/2025/04/07/what-is-a-stock-market-correction-dow/82979801007/",
    "timestamp": "2025-04-07T20:23:51Z"
  },
  {
    "title": "Birthday bash with bombast: Donald Trump plots $100 million military parade through Washington DC on his birthday; tanks, troops, and fireworks set to shake the capital in June",
    "description": "Donald Trump is planning a grand military parade in Washington, D.C., on June 14, coinciding with his birthday and the U.S. Army's 250th anniversary. The parade, potentially costing $100 million, will feature tanks, troops, jets, and fireworks, proceeding fro…",
    "link": "https://economictimes.indiatimes.com/news/international/us/birthday-bash-with-bombast-donald-trump-plots-100-million-military-parade-through-washington-dc-on-his-birthday-tanks-troops-and-fireworks-set-to-shake-the-capital-in-june/articleshow/120074756.cms",
    "timestamp": "2025-04-07T20:23:02Z"
  },
  {
    "title": "Who Is Bill Ackman? The £7.2 Billion Investor Urging Trump To Call Off The Economic 'Nuclear Winter'",
    "description": "Billionaire hedge fund manager Bill Ackman, worth £7.2 billion, has issued a stark warning to Donald Trump over tariffs, calling for a pause to avoid an 'economic nuclear winter'.",
    "link": "https://www.ibtimes.com/who-bill-ackman-72-billion-investor-urging-trump-call-off-economic-nuclear-winter-3769129",
    "timestamp": "2025-04-07T20:22:46Z"
  },
  {
    "title": "Tommy Tuberville Pissed Only Trans Folks Allowed To Play Sports Now, Dadgummit!",
    "description": "The man is still a dumbass.",
    "link": "https://www.wonkette.com/p/tommy-tuberville-pissed-only-trans",
    "timestamp": "2025-04-07T20:22:16Z"
  },
  {
    "title": "Supreme Court Freezes Order Asking Trump Administration To Return Deported Maryland Man To U.S.",
    "description": "Kilmar Abrego Garcia was accidentally deported to El Salvador in March without legal basis or justification.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/04/07/supreme-court-freezes-order-asking-trump-administration-to-return-deported-maryland-man-to-us/",
    "timestamp": "2025-04-07T20:22:11Z"
  },
  {
    "title": "Black Leaders Are Finally Speaking Out Against Trump, But Here's What Took So Damn Long",
    "description": "Photo: Win McNamee (Getty Images)\r\nPresident Donald Trump has been in office tearing shit up for three months, and we didn’t hear a thing from Black leaders. Now they are finally speaking out: First there was Cory Booker, challenging all manner of bladder con…",
    "link": "https://www.theroot.com/black-leaders-are-finally-speaking-out-against-trump-b-1851775083",
    "timestamp": "2025-04-07T20:22:00Z"
  },
  {
    "title": "Trump hints he’d back longtime critic Chris Sununu’s bid to flip Dem Senate seat in 2026: ‘I hope he runs’",
    "description": "\"I think he'll win that seat,\" President Donald Trump said.",
    "link": "https://nypost.com/2025/04/07/us-news/trump-hints-hed-back-critic-chris-sununus-2026-bid-to-flip-dem-senate-seat/",
    "timestamp": "2025-04-07T20:21:22Z"
  },
  {
    "title": "Some Analysts Are Advising Investors To 'Think Twice' Before Leaving The Stock Market Despite Trump Tariff Downturn",
    "description": "Trump's \"Liberation Day\" tariffs sent the stock market into a frenzy. But experts are advising investors to not so readily give up on their stocks yet.",
    "link": "https://www.ibtimes.com/some-analysts-are-advising-investors-think-twice-before-leaving-stock-market-despite-trump-3769127",
    "timestamp": "2025-04-07T20:21:01Z"
  },
  {
    "title": "Trump’s Tariffs Are Killing His Plans for Energy Dominance",
    "description": "The new duties have brought down oil prices, but cheap oil is bad for the United States these days.",
    "link": "http://foreignpolicy.com/2025/04/07/trump-tariffs-energy-dominance-trade-war/",
    "timestamp": "2025-04-07T20:20:22Z"
  },
  {
    "title": "Crypto bull market ‘hasn't started yet’ — LONGITUDE panel",
    "description": "Crypto’s worst quarter since the FTX crisis has many investors worried about the end of the bull market, but according to an industry panel, Bitcoin and altcoins’ parabolic moves haven’t even begun yet. In a panel discussion at the LONGITUDE by Cointelegraph …",
    "link": "https://cointelegraph.com/news/crypto-bull-market-hasnt-started-yet-longitude-panel",
    "timestamp": "2025-04-07T20:20:00Z"
  },
  {
    "title": "Trumps says EU will ‘have to buy their energy from us’ and says US won't pause tariffs",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/world-news/north-america/trumps-says-eu-will-have-to-buy-their-energy-from-us-and-says-us-wont-pause-tariffs/a698101359.html",
    "timestamp": "2025-04-07T20:19:27Z"
  },
  {
    "title": "Stock Market Drops for Third Day Amid Trump's Tariff Turbulence",
    "description": "Markets briefly rebounded on rumors that Trump might pause tariffs, but the White House swiftly dismissed the reports as false.",
    "link": "https://www.newsweek.com/stock-market-drops-third-day-amid-trumps-tariff-turbulence-2056536",
    "timestamp": "2025-04-07T20:18:53Z"
  },
  {
    "title": "Game Night Just Got More Expensive",
    "description": "On Saturday, a 34 percent tariff on Chinese products went into effect, bringing the total tax rate on Chinese imports to 54 percent. Yet President Donald",
    "link": "https://reason.com/2025/04/07/game-night-just-got-more-expensive/",
    "timestamp": "2025-04-07T20:18:45Z"
  },
  {
    "title": "Trump Says He's Not Considering Pausing Tariffs, Claims It's An 'Honor' To Impose Them",
    "description": "Donald Trump said he's not considering a pause in tariffs and said it's an \"honor\" to impose them",
    "link": "https://www.ibtimes.com/trump-says-hes-not-considering-pausing-tariffs-claims-its-honor-impose-them-3769126",
    "timestamp": "2025-04-07T20:18:11Z"
  },
  {
    "title": "Taxpayers Submit UN Report Charging US Officials With Genocide in Gaza",
    "description": "In a 57-page report submitted to the United Nations Human Rights Council on Monday, grassroots groups representing thousands of U.S. taxpayers compiled what they said was \"incontrovertible\" evidence that U.S. policymakers are \"directly participating in genoci…",
    "link": "https://www.commondreams.org/news/us-funding-israel",
    "timestamp": "2025-04-07T20:16:58Z"
  },
  {
    "title": "An endless firehose of lies abetted by a compliant media",
    "description": "Hannah Arendt in the year Hitler came to power Attorney General Pam Bondi on “the real constitutional crisis:” “He was overwhelmingly elected by an overwhelming majority of the United States citizens to be our commander in chief and that’s what he’s been doin…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/an-endless-firehose-of-lies-abetted-by-a-compliant-media",
    "timestamp": "2025-04-07T20:16:12Z"
  },
  {
    "title": "Trump: I like Erdogan, he likes me",
    "description": "United States President Donald Trump said on Monday that he \"likes\" his Turkish counterpart Recep Tayyip Erdogan and that \"he likes me,\" underscoring his belief that \"any problem\" Israel has with Anka...",
    "link": "https://biztoc.com/x/7b9d4c03e0ab606b",
    "timestamp": "2025-04-07T20:15:34Z"
  },
  {
    "title": "Trump: Iran in great danger if talks fail",
    "description": "US President Donald Trump warned that Iran faces \"great danger\" if negotiations regarding its nuclear program fail, despite ongoing direct discussions between the countries.\"I think if the talks aren'...",
    "link": "https://biztoc.com/x/542c16095956af01",
    "timestamp": "2025-04-07T20:15:25Z"
  },
  {
    "title": "How Turning Off This iPhone Setting Can Prevent Major Security Failures",
    "description": "The Guardian has new reporting on how the White House accidentally added a journalist to a private chat.",
    "link": "https://www.huffpost.com/entry/ios-setting-waltz-signal-leak_n_67f3ea17e4b04e7e1926658b",
    "timestamp": "2025-04-07T20:15:25Z"
  },
  {
    "title": "U.S. Will Hold Direct Talks With Iran, Trump Says",
    "description": "During a visit Monday by Israel’s President Benjamin Netanyahu, President Donald Trump told reporters that the U.S. and Iran would begin direct negotiations.  “We’re having direct talks with Iran, and they’ve started. It’ll go on Saturday. We have a very big …",
    "link": "https://www.theamericanconservative.com/u-s-will-hold-direct-talks-with-iran-trump-says/",
    "timestamp": "2025-04-07T20:15:16Z"
  },
  {
    "title": "The U.S. will hold direct talks with Iran starting this weekend because Trump insists Tehran can’t get nuclear weapons",
    "description": "President Donald Trump said Monday that the U.S. is holding direct talks with Iran about its nuclear program.\nThe president, in comments to reporters after meeting with Israeli Prime Minister Benjamin Netanyahu, said the talks with Tehran would start Saturday…",
    "link": "https://biztoc.com/x/beda0b1bad80f82b",
    "timestamp": "2025-04-07T20:15:14Z"
  },
  {
    "title": "Trump Confirms Iran Talks for Saturday, Warns of 'Great Danger' if They Fail",
    "description": "Donald Trump has said the U.S. will hold direct talks with Iran this Saturday, and warned Tehran they will be in \"great danger\" if the talks fail.\nThe president, in comments to reporters after meeting with Israeli Prime Minister Benjamin Netanyahu, said the t…",
    "link": "https://biztoc.com/x/3ffae3fe0f268875",
    "timestamp": "2025-04-07T20:15:00Z"
  },
  {
    "title": "Trump Confirms Iran Talks for Saturday, Warns of 'Great Danger' if They Fail",
    "description": "US president warns Tehran they will be in \"great danger\" if the talks over Iran's nuclear capabilities fail.",
    "link": "https://www.newsweek.com/trump-confirms-iran-talks-saturday-warns-great-danger-if-they-fail-2056532",
    "timestamp": "2025-04-07T20:14:40Z"
  },
  {
    "title": "Pregnant Tiffany Trump, Husband Michael Boulos Have Miami Date Night",
    "description": "Tiffany Trump is almost a first-time mom. \nThe only daughter of President Donald Trump and his second wife Marla Maples, who is pregnant with her first baby, recently showed off her bump while on...",
    "link": "https://www.eonline.com/news/1415799/pregnant-tiffany-trump-husband-michael-boulos-miami-date-night",
    "timestamp": "2025-04-07T20:14:04Z"
  },
  {
    "title": "Wall Street could be headed for a bear market. Here’s what that means",
    "description": "The last bear market happened in 2022, but this decline feels more like 2020.",
    "link": "https://www.bostonherald.com/2025/04/07/wall-street-bear-market/",
    "timestamp": "2025-04-07T20:13:37Z"
  },
  {
    "title": "Can Anyone Stop Trump's Tariffs?",
    "description": "In this week's Reason Roundtable, the editors discuss the economic and political fallout from President Donald Trump's new tariffs.",
    "link": "https://reason.com/podcast/2025/04/07/can-anyone-stop-trumps-tariffs/",
    "timestamp": "2025-04-07T20:13:34Z"
  }
]