[
  {
    "title": "Longer-term security guarantees needed to deter Russia, says Zelenskiy",
    "description": "Details emerge from Sunday’s meeting with Trump, which failed to make progress on peace deal",
    "link": "https://www.irishtimes.com/world/europe/2025/12/29/longer-term-security-guarantees-needed-to-deter-russia-says-zelenskiy/",
    "timestamp": "2025-12-29T11:40:05Z"
  },
  {
    "title": "Hyundai not in a position to buy back Russian car factory",
    "description": "South Korean automaker Hyundai is not in a position to repurchase its former manufacturing plant in Russia due to the continuing war in Ukraine, a source familiar with the matter told Reuters, as a buyback option appears set to expire next month.",
    "link": "https://www.rte.ie/news/business/2025/1229/1550805-hyundai-not-in-a-position-to-buy-back-russian-car-factory/",
    "timestamp": "2025-12-29T11:37:40Z"
  },
  {
    "title": "Trump, 79, Sends Jaw-Dropping Message to Families of Fallen U.S. Fighters",
    "description": "President Donald Trump struggled to offer much sympathy for the families of about 100 Americans—many of them U.S. military veterans—who have died fighting in...",
    "link": "https://www.thedailybeast.com/donald-trump-79-sends-stunning-message-to-families-of-fallen-us-fighters/",
    "timestamp": "2025-12-29T11:36:35Z"
  },
  {
    "title": "Trump and Zelenskyy talk plans for peace",
    "description": "President Donald Trump and Ukrainian President Volodymyr Zelenskyy are making apparent progress in peace talks to end the four-year long war in Ukraine. Both leaders say some unresolved issues remain.",
    "link": "https://www.koco.com/article/trump-zelenskyy-peace-talks/69877502",
    "timestamp": "2025-12-29T11:34:51Z"
  },
  {
    "title": "In 2025, Epstein showed MAGA who they really are",
    "description": "Trump is desperate to distract his base",
    "link": "https://www.salon.com/2025/12/29/in-2025-epstein-showed-maga-who-they-really-are/",
    "timestamp": "2025-12-29T11:30:06Z"
  },
  {
    "title": "Russia may gain more than lose from a US intervention in Venezuela",
    "description": "The US escalation against Caracas may be part of a larger realignment for a new world order.",
    "link": "https://www.aljazeera.com/opinions/2025/12/29/russia-may-gain-more-than-lose-from-a-us-intervention-in-venezuela",
    "timestamp": "2025-12-29T11:30:00Z"
  },
  {
    "title": "Zelensky says Russian actions in Ukraine do not match Putin's 'peaceful rhetoric' to Trump",
    "description": "Ukrainian President Volodymyr Zelensky pointed out a contradiction. He said Russian President Vladimir Putin tells US President Donald Trump he wants to end the war. However, Putin's public messages and actions show a desire to continue fighting. Russia conti…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelensky-says-russian-actions-in-ukraine-do-not-match-putins-peaceful-rhetoric-to-trump/articleshow/126231368.cms",
    "timestamp": "2025-12-29T11:26:39Z"
  },
  {
    "title": "The year of sweeping student-loan changes — with more to come",
    "description": "From paused student-loan repayment plans to new debt relief limits, 2026 brought critical changes to borrowers. There's a lot more in store.",
    "link": "https://www.businessinsider.com/student-loan-borrowers-sweeping-debt-relief-changes-more-coming-repayment-2025-12",
    "timestamp": "2025-12-29T11:18:01Z"
  },
  {
    "title": "Oil prices jump 2% as investors eye Ukraine talks",
    "description": "Oil prices rose by more than $1 today as investors weighed talks between the US and Ukrainian presidents on a possible deal to end the war in Ukraine against potential oil supply disruption in the Middle East.",
    "link": "https://www.rte.ie/news/business/2025/1229/1550802-oil-prices-jump-2-as-investors-eye-ukraine-talks/",
    "timestamp": "2025-12-29T11:15:39Z"
  },
  {
    "title": "Iranian traders and shopkeepers protest as currency hits record low",
    "description": "Iranian traders and shopkeepers have staged a second day of protests after the country’s currency plummeted to a new record low against the U.S. dollar",
    "link": "https://abcnews.go.com/Business/wireStory/iranian-traders-shopkeepers-protest-currency-hits-record-low-128745320",
    "timestamp": "2025-12-29T11:01:54Z"
  },
  {
    "title": "From Gaza to Iran: What’s at stake in Trump-Netanyahu Mar-a-Lago talks?",
    "description": "Gaza peace plan and Iran both reportedly on agenda as President Donald Trump is set to meet Israeli Prime Minister Benjamin Netanyahu at Mar-a-Lago on Monday.",
    "link": "https://www.foxnews.com/world/from-gaza-iran-whats-stake-trump-netanyahu-mar-a-lago-talks",
    "timestamp": "2025-12-29T11:00:57Z"
  },
  {
    "title": "Critical Minerals’ Breakout Year",
    "description": "Trump’s quest for China-free supply chains explained much of his foreign policy in 2025.",
    "link": "http://foreignpolicy.com/2025/12/29/critical-minerals-geopolitics-trump-china-supply-chains/",
    "timestamp": "2025-12-29T11:00:55Z"
  },
  {
    "title": "2025 in Review: A tumultuous year for Paramount and CBS News",
    "description": "A look back at the year Paramount and CBS News from the settlement with President Donald Trump to the cancellation of \"The Late Show with Stephen Colbert.\"",
    "link": "https://www.foxnews.com/media/2025-review-tumultuous-year-paramount-cbs-news",
    "timestamp": "2025-12-29T11:00:43Z"
  },
  {
    "title": "26 investing and personal finance thoughts for what’s to come in ’26",
    "description": "Investor returns were very positive in 2025, despite Trump's tariffs. Here are 26 thoughts on what we may see in 2026. Read more.",
    "link": "https://financialpost.com/investing/26-investing-personal-finance-thoughts-2026",
    "timestamp": "2025-12-29T11:00:37Z"
  },
  {
    "title": "A Year-in-Review Miscellany, 12/29/25",
    "description": "Top 10 news stories of 2025.  Top 10 religion stories of 2025.  The funniest news stories of 2025. Top 10 News Stories of 2025 Associated Press and other news organizations used to publish lists of the Top 10 News Stories of the year, but they aren’t really d…",
    "link": "https://www.patheos.com/blogs/geneveith/2025/12/a-year-in-review-miscellany-12-29-25/",
    "timestamp": "2025-12-29T11:00:05Z"
  },
  {
    "title": "What 2025 Revealed About Gaza’s Future",
    "description": "Where does this year’s cease-fire agreement leave Palestinians and Israelis?",
    "link": "http://foreignpolicy.com/2025/12/29/gaza-israel-palestine-hamas-ceasefire-middle-east-peace/",
    "timestamp": "2025-12-29T11:00:05Z"
  },
  {
    "title": "Who thinks Republicans will suffer in the 2026 midterms? Republican members of Congress",
    "description": "Speaker Mike Johnson has to defend a thin majority as he faces a near-record number of retiring Republicans.",
    "link": "https://www.salon.com/2025/12/29/who-thinks-republicans-will-suffer-in-the-2026-midterms-republican-members-of-congress-partner/",
    "timestamp": "2025-12-29T11:00:04Z"
  },
  {
    "title": "Why Russell Vought Is Worse Than Watergate",
    "description": "“We want the bureaucrats to be traumatically affected. When they wake up in the morning, we want them to not want to go to work…. We want to put them in trauma.”\r\n—Russell Vought, May 2023.\r\n“[The Center for Renewing America is] an organization that I helped …",
    "link": "https://newrepublic.com/article/204440/russell-vought-monster-worse-watergate-2025",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "These Apps Let You Bet on Deportations and Famine. Mainstream Media Is Eating It Up.",
    "description": "“The long-term vision is to financialize everything and create a tradable asset out of any difference in opinion.”\nThe post These Apps Let You Bet on Deportations and Famine. Mainstream Media Is Eating It Up. appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/12/29/polymarket-kalshi-betting-prediction-cnn-news-media/",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "A Reckoning for the Stalled Gaza Peace Plan",
    "description": "A meeting between Benjamin Netanyahu and Donald Trump may determine whether the agreement advances—or hardens into a permanent order.",
    "link": "https://www.newyorker.com/news/the-lede/a-reckoning-for-the-stalled-gaza-peace-plan",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "PARSI: Why Trump must reject Netanyahu’s reported new push for war with Iran",
    "description": "‘Don’t be surprised if the New York Times at some point runs an affirmative story on how kitchen knives in Iran are seen as an existential threat by the Israeli security establishment,’ he writes Trita Parsi, the executive vice president of the Quincy Institu…",
    "link": "https://www.activistpost.com/parsi-why-trump-must-reject-netanyahus-reported-new-push-for-war-with-iran/",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "The Department of Justice May Not Survive Pam Bondi",
    "description": "At her confirmation hearing in January, Attorney General Pam Bondi tried to reassure senators about the job she would do as the nation’s top federal law-enforcement officer. Her “overriding objective,” Bondi said, would be to “return the Department of Justice…",
    "link": "https://newrepublic.com/article/204372/pam-bondi-monster-trump-doj-2025",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "How Mary Todd Lincoln Lands Totally Out of Context",
    "description": "The challenge of staging Oh, Mary! for a British audience",
    "link": "https://www.theatlantic.com/ideas/2025/12/oh-mary-theater-trump/685446/",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "The Worst Thing About Elon Musk Is That He Got Away With All of It",
    "description": "The world’s richest man is nowhere near the world’s most generous, or sensible, or kind, or popular, or the most positive of anything. Elon Musk was already a polarizing figure before he decided to endorse Donald Trump for president in July 2024, but that dec…",
    "link": "https://newrepublic.com/article/204558/elon-musk-monster-2025-doge",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "The New Surveillance State Is You",
    "description": "Privacy may be dead, but civilians are turning conventional wisdom on its head by surveilling the cops as much as the cops surveil them.",
    "link": "https://www.wired.com/story/expired-tired-wired-surveillance-state/",
    "timestamp": "2025-12-29T11:00:00Z"
  },
  {
    "title": "Video: Trump and Zelenskyy hail ‘progress’ on Russia-Ukraine peace plan",
    "description": "US President Trump and Ukrainian leader Zelenskyy are talking up prospects of ending the war with Russia.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/29/video-trump-and-zelenskyy-hail-progress-on-russia-ukraine-peace-plan",
    "timestamp": "2025-12-29T10:59:10Z"
  },
  {
    "title": "Netanyahu and Trump to Meet in Florida for Crucial Talks on Gaza, Iran",
    "description": "Israeli Prime Minister Benjamin Netanyahu will sit down with President Donald Trump in Florida on Monday, as the next stage of the fragile Gaza truce plan readies to unfold and Iran issued a dire warning to the U.S., Israel and Europe of war.\nThe post Netanya…",
    "link": "https://www.breitbart.com/middle-east/2025/12/29/netanyahu-and-trump-to-meet-in-florida-for-crucial-talks-on-gaza-iran/",
    "timestamp": "2025-12-29T10:58:29Z"
  },
  {
    "title": "Trump and Netanyahu to meet in Florida for crucial talks on Iran and Gaza",
    "description": "President Donald Trump will meet with Israeli Prime Minister Benjamin Netanyahu in Florida on Monday hoping to push forward the ceasefire that he brokered in Gaza, while the Israeli leader is expected to make the case for new action against Iran",
    "link": "https://www.nbcnews.com/world/middle-east/trump-netanyahu-meet-florida-talks-iran-gaza-ceasefire-hamas-rcna251314",
    "timestamp": "2025-12-29T10:57:53Z"
  },
  {
    "title": "Kremlin agrees with Trump that Ukraine peace talks close to finale",
    "description": "Kremlin agrees with US President Donald Trump’s assessment of the state of the Ukraine peace process Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630188-peskov-ukraine-peace-talks/",
    "timestamp": "2025-12-29T10:51:52Z"
  },
  {
    "title": "Hyundai not in a position to buy back Russian auto factory: Source",
    "description": "Hyundai faces a deadline to buy back its former Russian car plant. The ongoing Ukraine war prevents the automaker from repurchasing the facility. The buyback option expires next month. Hyundai previously sold its St. Petersburg plant for a symbolic amount. Ot…",
    "link": "https://economictimes.indiatimes.com/news/international/business/hyundai-not-in-a-position-to-buy-back-russian-auto-factory-source/articleshow/126230740.cms",
    "timestamp": "2025-12-29T10:50:40Z"
  },
  {
    "title": "I Went to the Site Where Republicans Are Erecting a “Last Line of Defense” Against Zohran Mamdani. What I Saw Was Curious.",
    "description": "Donald Trump has already endorsed those involved.",
    "link": "https://slate.com/news-and-politics/2025/12/donald-trump-new-york-city-long-island-zohran-mamdani.html",
    "timestamp": "2025-12-29T10:50:00Z"
  },
  {
    "title": "Exclusive-Hyundai not in a position to buy back Russian auto factory, source says",
    "description": "SEOUL/MOSCOW, Dec 29 : South Korean automaker Hyundai is not in a position to repurchase its former manufacturing plant in Russia due to the continuing war in Ukraine, a source familiar with the matter told Reuters, as a buyback option appears set to expire n…",
    "link": "https://www.channelnewsasia.com/business/exclusive-hyundai-not-in-position-buy-back-russian-auto-factory-source-says-5753201",
    "timestamp": "2025-12-29T10:49:51Z"
  },
  {
    "title": "Hyundai not in a position to buy back Russian auto factory, source says",
    "description": "SEOUL/MOSCOW, Dec 29 : South Korean automaker Hyundai is not in a position to repurchase its former manufacturing plant in Russia due to the continuing war in Ukraine, a source familiar with the matter told Reuters, as a buyback option appears set to expire n…",
    "link": "https://www.channelnewsasia.com/business/hyundai-not-in-position-buy-back-russian-auto-factory-source-says-5753201",
    "timestamp": "2025-12-29T10:49:51Z"
  },
  {
    "title": "Exclusive-Hyundai not in a position to buy back Russian auto factory, source says",
    "description": "SEOUL/MOSCOW, Dec 29 (Reuters) - South Korean automaker Hyundai is not in a position to repurchase its former manufacturing plant in Russia due to the...",
    "link": "https://finance.yahoo.com/news/exclusive-hyundai-not-position-buy-104951265.html",
    "timestamp": "2025-12-29T10:49:51Z"
  },
  {
    "title": "Trump-linked crypto firm faces auditor scrutiny as financial turmoil deepens",
    "description": "Alt5 Sigma faces scrutiny after missing filings and hiring an auditor whose licence expired earlier this year. Trump-linked crypto deal draws attention as governance gaps and auditor penalties raise oversight concerns. Board exits, audit delays, and legal dis…",
    "link": "https://coinjournal.net/news/trump-linked-crypto-firm-faces-auditor-scrutiny-as-financial-turmoil-deepens/",
    "timestamp": "2025-12-29T10:45:25Z"
  },
  {
    "title": "'Classic Trump hyperbole': Analyst raises concern over president's economic plans",
    "description": "Projected economic plans from Donald Trump are \"classic hyperbole\" from the president, according to an analyst warning of future economic strife. A claim made by the president that the stock market will contribute a massive growth boost to the economy has bee…",
    "link": "https://www.rawstory.com/trump-economy-2674834075/",
    "timestamp": "2025-12-29T10:42:15Z"
  },
  {
    "title": "Washington Post article fretting over Trump officials' religious Christmas messages draws strong pushback",
    "description": "White House spokesperson Abigail Jackson defended Trump officials' explicitly Christian Christmas messages after a Washington Post article criticized them.",
    "link": "https://www.foxnews.com/media/washington-post-article-fretting-over-trump-officials-religious-christmas-messages-draws-strong-pushback",
    "timestamp": "2025-12-29T10:40:18Z"
  },
  {
    "title": "Turkey resumed violations in the Aegean after the security alliance against the “Blue Homeland”",
    "description": "After the success of the Greece-Cyprus-Israel Tripartite, Athens prioritizes managing relations with Ankara – the push to revive the 3+1 framework, Erdoğan-Netanyahu hostility centered on Gaza, and energy corridors\nThe post Turkey resumed violations in the Ae…",
    "link": "https://en.protothema.gr/2025/12/29/turkey-resumed-violations-in-the-aegean-after-the-security-alliance-against-the-blue-homeland/",
    "timestamp": "2025-12-29T10:40:00Z"
  },
  {
    "title": "Possible Zelensky challenger to return to Ukraine – media",
    "description": "Ukraine’s former top general, Valery Zaluzhny, is expected to return to Kiev from London in early January, according to local media Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630183-zaluzhny-return-kiev-media/",
    "timestamp": "2025-12-29T10:39:34Z"
  },
  {
    "title": "Thailand accuses Cambodia of breaking newly signed ceasefire deal",
    "description": "The ceasefire took effect at noon local time (05:00 GMT) on Saturday.",
    "link": "https://www.bbc.com/news/articles/c9w7wgrk01do",
    "timestamp": "2025-12-29T10:38:29Z"
  },
  {
    "title": "US offers Ukraine 15-year security guarantee as part of peace plan, Zelenskyy says",
    "description": "The United States is offering Ukraine security guarantees for a period of 15 years as part of a proposed peace plan, Ukrainian President Volodymyr Zelenskyy ...",
    "link": "https://www.yahoo.com/news/articles/us-offers-ukraine-15-security-103746613.html",
    "timestamp": "2025-12-29T10:37:46Z"
  },
  {
    "title": "Kremlin aide praises Trump's 'peace efforts' after Zelenskyy meeting, Putin call",
    "description": "Kremlin envoy Kirill Dmitriev praised U.S. President Donald Trump's \"peace efforts\" after Ukrainian President Volodymyr Zelenskyy traveled to the White House on Sunday.",
    "link": "https://abcnews.go.com/International/kremlin-aide-praises-trumps-peace-efforts-after-zelenskyy/story?id=128744654",
    "timestamp": "2025-12-29T10:30:40Z"
  },
  {
    "title": "Here's why Trump and the GOP are doomed",
    "description": "On Dec. 22, 1944, on a brutally cold and snowy battlefield in Bastogne, Belgium, Brigadier General Anthony McAuliffe's rough-and-ready 101st Airborne Division was surrounded and outnumbered by German armor units, which had literally come out of nowhere.The fi…",
    "link": "https://www.rawstory.com/raw-investigates/donald-trump-2674833395/",
    "timestamp": "2025-12-29T10:30:01Z"
  },
  {
    "title": "The Most Dangerous People on the Internet in 2025",
    "description": "From Donald Trump to DOGE to Chinese hackers, this year the internet's chaos caused outsized real-world harm.",
    "link": "https://www.wired.com/story/most-dangerous-people-on-the-internet-2025/",
    "timestamp": "2025-12-29T10:30:00Z"
  },
  {
    "title": "Thai army accuses Cambodia of violating truce with over 250 drones",
    "description": "Thailand’s army on Monday accused Cambodia of violating a newly signed ceasefire agreement, reached after weeks of deadly border clashes, by flying more than 250 drones over its territory. Thailand and Cambodia agreed to the “immediate” ceasefire on Saturday,…",
    "link": "https://www.digitaljournal.com/world/thai-army-accuses-cambodia-of-violating-truce-with-over-250-drones/article",
    "timestamp": "2025-12-29T10:27:20Z"
  },
  {
    "title": "Sibanye Stillwater (SBSW) Soars 9.6% on Gold Rush",
    "description": "We recently published Big Winners: 10 Stocks Refusing to take a Holiday. Sibanye Stillwater Limited (NYSE:SBSW) is one of the last week’s best performers...",
    "link": "https://finance.yahoo.com/news/sibanye-stillwater-sbsw-soars-9-102444690.html",
    "timestamp": "2025-12-29T10:24:44Z"
  },
  {
    "title": "Vizsla (VZLA) Climbs 10% on Silver Rush",
    "description": "We recently published Big Winners: 10 Stocks Refusing to take a Holiday. Vizsla Silver Corp. (NYSEAmerican:VZLA) is one of the last week’s best performers...",
    "link": "https://finance.yahoo.com/news/vizsla-vzla-climbs-10-silver-102436530.html",
    "timestamp": "2025-12-29T10:24:36Z"
  },
  {
    "title": "Hycroft (HYMC) Flies 52% on Exploration of ‘Best’ Silver Grades in Nevada Mine",
    "description": "We recently published Big Winners: 10 Stocks Refusing to take a Holiday. Hycroft Mining Holding Corp. (NASDAQ:HYMC) is one of the last week’s best performers...",
    "link": "https://finance.yahoo.com/news/hycroft-hymc-flies-52-exploration-102414802.html",
    "timestamp": "2025-12-29T10:24:14Z"
  },
  {
    "title": "Trump reveals whether he anticipates a trip to Ukraine",
    "description": "US President Donald Trump says he would reluctantly go to Kiev if that helps finalize a Ukrainian peace deal with Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630180-trump-reluctant-trip-ukraine/",
    "timestamp": "2025-12-29T10:20:30Z"
  },
  {
    "title": "Market Wrap: Sensex slides 346 pts, Nifty below 25,950 as year-end lull drags D-St",
    "description": "Indian equities slipped on Monday as thin year-end volumes and continued foreign outflows weighed on sentiment. The Sensex and Nifty extended their losing streak, dragged by weakness in energy, IT and large-cap stocks. Caution prevailed amid global trade worr…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slides-346-pts-nifty-below-26000-as-year-end-lull-drags-d-st/articleshow/126229984.cms",
    "timestamp": "2025-12-29T10:18:00Z"
  },
  {
    "title": "Zelenskyy asks Trump for 50 years of security guarantees, says meeting with Russia possible",
    "description": "Ukraine's President Volodymyr Zelenskyy said Monday that he had asked for security guarantees for up to 50 years for Ukraine.",
    "link": "https://www.cnbc.com/2025/12/29/zelenskyy-asks-trump-for-50-years-of-security-guarantees.html",
    "timestamp": "2025-12-29T10:17:43Z"
  },
  {
    "title": "US Replacing Ineffective UN on Peacemaking - Trump",
    "description": "The United States is replacing the United Nations with settlement efforts, as this organization offers no help in peacemaking, US President Donald Trump said on Sunday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251228-sputnik01.htm",
    "timestamp": "2025-12-29T10:16:43Z"
  },
  {
    "title": "Taiwan welcomes Israel's decision to formally recognize Somaliland",
    "description": "Taiwan has welcomed Israel's decision on Friday to formally recognize Somaliland as a sovereign nation, going against the reaction of Europe, the United States and other countries, which have opted to support Somalian sovereignty.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251228-cna01.htm",
    "timestamp": "2025-12-29T10:13:34Z"
  },
  {
    "title": "GOP Rep to Force Vote on Expelling Ilhan Omar from Congress",
    "description": "Fine said that the potential action would be spurred by Omar purportedly marrying her brother and her \"general embrace of Muslim terror.\"",
    "link": "https://www.westernjournal.com/gop-rep-force-vote-expelling-ilhan-omar-congress/",
    "timestamp": "2025-12-29T10:12:00Z"
  },
  {
    "title": "New Putin-Trump Phone Call to Take Place in Very Near Future - Kremlin",
    "description": "MOSCOW Sputnik - Moscow will receive information about the results of the talks in Florida between Volodymyr Zelensky and US President Donald Trump after a new conversation between Russian President Vladimir Putin and the US leader, Moscow cannot assess them …",
    "link": "https://sputnikglobe.com/20251229/new-putin-trump-phone-call-to-take-place-in-very-near-future---kremlin-1123382007.html",
    "timestamp": "2025-12-29T10:10:41Z"
  },
  {
    "title": "Lucas: Healey needs to meet with Trump",
    "description": "Gov. Maura Healey is better at flying illegal immigrants into Massachusetts than flying them out. One only has to recall the hundreds of illegal immigrant families who were housed at Logan Airport in 2024 after arriving uninvited by planes, trains and automob…",
    "link": "https://www.bostonherald.com/2025/12/29/lucas-healey-needs-to-meet-with-trump/",
    "timestamp": "2025-12-29T10:10:03Z"
  },
  {
    "title": "Tents flooded by heavy rains in Gaza amid calls for Israel to let in aid",
    "description": "Heavy winter rains and strong winds have brought new dangers to displaced Palestinians in a Gaza devastated by Israel.",
    "link": "https://www.aljazeera.com/news/2025/12/29/tents-flooded-by-heavy-rains-in-gaza-amid-calls-for-israel-to-let-in-aid",
    "timestamp": "2025-12-29T10:09:50Z"
  },
  {
    "title": "Kremlin says Ukraine should withdraw troops from Donbas, and a Putin-Trump call expected soon",
    "description": "Russia's Kremlin has demanded Ukraine withdraw its forces from occupied Donbas territories. A phone call between Russian President Vladimir Putin and US President Donald Trump is expected very soon. The leaders spoke on Sunday before Trump's meeting with Ukra…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/kremlin-says-ukraine-should-withdraw-troops-from-donbas-and-a-putin-trump-call-expected-soon/articleshow/126229926.cms",
    "timestamp": "2025-12-29T10:07:08Z"
  },
  {
    "title": "COMEX silver sinks 11%, MCX falls 8% intraday as CME margin hike knocks white metal prices",
    "description": "Silver prices saw a sharp intraday crash after CME Group raised margin requirements, triggering profit booking across global markets. Easing geopolitical risks further dented safe-haven demand, though silver remains sharply higher year-to-date.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/comex-silver-sinks-11-mcx-falls-8-intraday-as-cme-margin-hike-knocks-white-metal-prices/articleshow/126229913.cms",
    "timestamp": "2025-12-29T10:06:32Z"
  },
  {
    "title": "Zelenskyy Vows To Continue Peace Drive After Trump Talks End With No Deal",
    "description": "Ukrainian President Volodymyr Zelenskyy concluded his talks with US President Donald Trump without a peace deal, but he said US and Ukrainian teams will meet again soon and that a gathering of leaders -- including those from Europe - will be held in Washingto…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251229-rferl01.htm",
    "timestamp": "2025-12-29T10:00:56Z"
  },
  {
    "title": "Putin and Trump reject the European-Ukrainian temporary ceasefire idea",
    "description": "Presidents Vladimir Putin of Russia and Donald Trump of the United States have dismissed a European proposal for a temporary ceasefire in Ukraine, urging Kiev to take immediate action to end the conflict.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251229-presstv01.htm",
    "timestamp": "2025-12-29T10:00:38Z"
  },
  {
    "title": "Trump says \"no deadline\" for Ukraine peace deal",
    "description": "U.S. President Donald Trump on Sunday refused to say whether he expects a peace deal over the Ukraine crisis to be reached by the end of 2025.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251229-pdo02.htm",
    "timestamp": "2025-12-29T10:00:36Z"
  },
  {
    "title": "Trump, Zelensky confer on peace deal for Ukraine, breakthrough eludes",
    "description": "U.S. President Donald Trump said Sunday that the two sides are \"getting a lot closer, maybe very close\" to a peace deal to end the Ukraine crisis after meeting with Ukrainian President Volodymyr Zelensky at his Mar-a-Lago resort in Florida.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251229-pdo01.htm",
    "timestamp": "2025-12-29T10:00:35Z"
  },
  {
    "title": "Trump Says He Had Good Phone Call With Putin Before Meeting With Zelensky",
    "description": "US President Donald Trump said that he had held a good and productive phone call with Russian President Vladimir Putin on Sunday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251228-sputnik02.htm",
    "timestamp": "2025-12-29T10:00:30Z"
  },
  {
    "title": "Trump Says Ukraine Peace Talks Moving In 'Right Direction' After Zelenskyy Meeting",
    "description": "Peace talks to end Russia's war on Ukraine were \"moving in the right direction,\" US President Donald Trump asserted, after holding two hours of critical negotiations with his visiting Ukrainian counterpart and a call with European leaders.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251228-rferl02.htm",
    "timestamp": "2025-12-29T10:00:27Z"
  },
  {
    "title": "Russia's Lavrov says EU 'main obstacle' to Ukraine peace",
    "description": "Russia's Foreign Minister Sergey Lavrov has blamed the European Union for being the \"main obstacle\" to peace in Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251228-presstv02.htm",
    "timestamp": "2025-12-29T10:00:23Z"
  },
  {
    "title": "Comment by Aide to the President Yury Ushakov following the telephone conversation between Vladimir Putin and US President Donald Trump",
    "description": "Aide to the President Yury Ushakov: President Vladimir Putin has just finished his telephone conversation with President of the United States Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251228-kremlin01.htm",
    "timestamp": "2025-12-29T10:00:20Z"
  },
  {
    "title": "Our Reporters Reached Out for Comment. They Were Accused of Stalking and Intimidation.",
    "description": "Our journalists reach out to people they’re writing about to ensure fairness. But in this environment, they’ve found their efforts to do so are more likely to be vilified than appreciated.",
    "link": "http://www.propublica.org/article/propublica-reaching-out-reporting-obstacles",
    "timestamp": "2025-12-29T10:00:00Z"
  },
  {
    "title": "What we learned about the state of the Trump coalition in conversations with 50 voters",
    "description": "The voters who put President Donald Trump back in the White House last year still largely support him.",
    "link": "https://www.nbcnews.com/politics/elections/learned-state-trump-coalition-conversations-50-voters-year-rcna248275",
    "timestamp": "2025-12-29T10:00:00Z"
  },
  {
    "title": "In 2025, Censorship and Firings Defined a Fractured Art World",
    "description": "Trump battled the Smithsonian, Europe's ongoing crisis over antisemitism, allegations of censorship, and more defined 2025.",
    "link": "https://www.artnews.com/art-news/news/art-world-censorship-2025-smithsonian-trump-whitney-isp-1234767305/",
    "timestamp": "2025-12-29T10:00:00Z"
  },
  {
    "title": "Israel-Gaza live updates: Netanyahu to meet Trump at Mar-a-Lago on Monday",
    "description": "Sporadic clashes between the Israel Defense Forces and Gaza militants -- plus deadly IDF strikes -- continue despite the Gaza ceasefire.",
    "link": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates/?id=128744658",
    "timestamp": "2025-12-29T09:55:57Z"
  },
  {
    "title": "Bereaved families to Trump: Ensure Hamas' total destruction",
    "description": "Bereaved families pen letter to US President Donald Trump, demanding he not compel Israel to progress second stage of Gaza ceasefire until Hamas is completely destroyed and the last hostage returned.",
    "link": "https://www.israelnationalnews.com/news/420069",
    "timestamp": "2025-12-29T09:47:00Z"
  },
  {
    "title": "FBI chief threatens deportations over alleged $110mn fraud scheme",
    "description": "FBI Director Kash Patel has warned of deportations after new fraud allegations surfaced in Minnesota Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630175-fbi-chief-deportations-minnesota/",
    "timestamp": "2025-12-29T09:46:00Z"
  },
  {
    "title": "Ukraine updates: 'Strong' security guarantees in peace plan",
    "description": "A 15-year guarantee is part of the plan for peace in Ukraine, Zelenskyy said, adding Kyiv would like it to be longer. In Ukraine, a theater previously bombed by Russia was reopened under Russian occupation. DW has more. Zelenskyy says 'strong' security guaran…",
    "link": "https://www.dw.com/en/ukraine-updates-strong-security-guarantees-in-peace-plan/live-75327246",
    "timestamp": "2025-12-29T09:46:00Z"
  },
  {
    "title": "The US immigration crackdown: Donald Trump has lost public support for his agenda by going too far",
    "description": "An excessively harsh crackdown by the Donald Trump administration that invoked the Alien Enemies Act is putting off American citizens. The methods used by ICE agents have appalled many and sent Trump's approval ratings down.",
    "link": "https://www.livemint.com/opinion/columns/donald-trump-us-immigration-public-support-citizens-crackdown-ice-agents-alien-enemies-act-venezuelans-el-salvador-11766724147706.html",
    "timestamp": "2025-12-29T09:30:51Z"
  },
  {
    "title": "Why the feud between Tokyo and Beijing could rage on for a while yet",
    "description": "Nearly two months after Japan's new prime minister enraged Beijing with her remarks on Taiwan, the issue is not going away. Sanae Takaichi set off a...",
    "link": "https://www.yahoo.com/news/articles/why-feud-between-tokyo-beijing-093000905.html",
    "timestamp": "2025-12-29T09:30:00Z"
  },
  {
    "title": "S&P 500 eyes 7,000 mark as investors look for upbeat end",
    "description": "Investors are looking for the US stock market to end 2025 on a high note this week, with equities at record peaks and nearing further bullish milestones to close out another strong year.",
    "link": "https://www.rte.ie/news/business/2025/1229/1550788-sp-500-eyes-7-000-mark-as-investors-look-for-upbeat-end/",
    "timestamp": "2025-12-29T09:26:31Z"
  },
  {
    "title": "The tenuous peace between Trump and the $30 trillion US bond market",
    "description": "The U.S. bond market is showing signs of unease. President Trump's administration is working to keep borrowing costs low. Investors are watching closely as the government manages a large deficit. Recent actions by the Treasury Department aim to stabilize the …",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/the-tenuous-peace-between-trump-and-the-30-trillion-us-bond-market/articleshow/126229140.cms",
    "timestamp": "2025-12-29T09:22:38Z"
  },
  {
    "title": "European shares touch record high as markets resume post-holiday trading",
    "description": "European shares struck a record high on Monday, with basic resources stocks in the lead, as trading resumed following the ‌Christmas and ‌Boxing Day holidays.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-touch-record-high-as-markets-resume-post-holiday-trading/articleshow/126229018.cms",
    "timestamp": "2025-12-29T09:17:23Z"
  },
  {
    "title": "Explained: 6 reasons why silver prices crashed by Rs 21,000 per kg in 1 day",
    "description": "Silver prices tumbled Rs 21,000 per kg on MCX after an overheated rally unravelled, driven by easing geopolitical tensions, extreme deviation from key technical levels, and heavy profit-booking. A margin hike, record weekly gains, and a stronger dollar added …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/explained-6-reasons-why-silver-prices-crashed-by-rs-21000-per-kg-in-1-day/articleshow/126228860.cms",
    "timestamp": "2025-12-29T09:08:47Z"
  },
  {
    "title": "Biggest political break-ups and make-ups of 2025",
    "description": "From Trump and Musk to the UK and the EU, Christmas wouldn’t be Christmas without a round-up of the year’s relationship drama",
    "link": "https://theweek.com/politics/political-break-ups-of-the-year",
    "timestamp": "2025-12-29T09:00:00Z"
  },
  {
    "title": "Former MP Charlie Angus planned a quiet retirement. Now, he'd rather 'kick at the darkness'",
    "description": "Earlier this year, former New Democratic Party MP Charlie Angus was preparing to wrap up a two-decade-long career in the House of Commons, retire and write a book. Then U.S. President Donald Trump was elected and it all changed.",
    "link": "https://www.cbc.ca/news/politics/charlie-angus-trump-resistance-9.7023605",
    "timestamp": "2025-12-29T09:00:00Z"
  },
  {
    "title": "Trump could shake up inner circle by drafting in 'MAGA officials': analysis​",
    "description": "Donald Trump's inner circle could be set for a shake-up, according to political analysts warning \"MAGA officials\" could be the norm next year.CBS chief Washington analyst Robert Costa believes change is on the way, with many MAGA-friendly representatives shor…",
    "link": "https://www.rawstory.com/trump-administration-2674833880/",
    "timestamp": "2025-12-29T08:41:37Z"
  },
  {
    "title": "FULL LIST: The 27 new Swedish words that defined 2025",
    "description": "The list of 27 new Swedish words published on Monday by the Swedish Language Council covers everything from global politics to nonsense words, with loanwords from both English and German.",
    "link": "https://www.thelocal.se/20251229/full-list-the-27-new-swedish-words-that-defined-2025",
    "timestamp": "2025-12-29T08:33:33Z"
  },
  {
    "title": "Trump to Meet Netanyahu Over Phase 2 of Fragile Gaza Ceasefire",
    "description": "US President Donald Trump is expected to \"push for progress\" during Monday's meeting with Israeli Prime Minister Benjamin Netanyahu at Mar-a-Lago as the ceasefire in Gaza is \"stalled,\" Reuters reports. The White House has yet to confirm the details.",
    "link": "https://sputnikglobe.com/20251229/trump-to-meet-netanyahu-over-phase-2-of-fragile-gaza-ceasefire-1123381475.html",
    "timestamp": "2025-12-29T08:33:24Z"
  },
  {
    "title": "Benjamin Netanyahu to meet Donald Trump as differences over Gaza grow - Financial Times",
    "description": "Benjamin Netanyahu to meet Donald Trump as differences over Gaza growFinancial Times Netanyahu to meet Trump in US amid fears of Israeli regional offensivesThe Guardian Why Netanyahu’s visit to Mar-a-Lago is the opening act to Israeli Prime Minister’s reelect…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180473045",
    "timestamp": "2025-12-29T08:32:37Z"
  },
  {
    "title": "US slashes UN humanitarian aid to $2bn, huge cut as Trump demands reforms",
    "description": "The $2bn pool will target specific countries or crises, down from US contributions of up to $17bn in recent years.",
    "link": "https://www.aljazeera.com/news/2025/12/29/us-slashes-un-humanitarian-aid-to-2bn-huge-cut-as-trump-demands-reforms",
    "timestamp": "2025-12-29T08:21:30Z"
  },
  {
    "title": "Morgan Stanley Cuts Target on Diageo (DEO) as Growth Pressures Persist",
    "description": "Diageo plc (NYSE:DEO) is included among the 15 Global Dividend Stocks to Diversify Your Portfolio. On December 18, Morgan Stanley lowered its price target on...",
    "link": "https://finance.yahoo.com/news/morgan-stanley-cuts-target-diageo-081618029.html",
    "timestamp": "2025-12-29T08:16:18Z"
  },
  {
    "title": "Russian negotiator blasts Kiev’s pro-war backers",
    "description": "Russian negotiator Kirill Dmitriev has commented on the Trump-Zelensky meeting in Miami Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630177-dmitriev-trump-zelensky-meeting/",
    "timestamp": "2025-12-29T08:06:29Z"
  },
  {
    "title": "Thailand and Cambodia agree to 'consolidate ceasefire' in China talks",
    "description": "Thailand and Cambodia's top diplomats travelled to the Chinese province of Yunnan for trilateral talks with Chinese Foreign Minister Wang Yi to discuss the border situation.",
    "link": "https://www.channelnewsasia.com/asia/thailand-cambodia-ceasefire-china-trilateral-talks-yunnan-5740926",
    "timestamp": "2025-12-29T08:03:40Z"
  },
  {
    "title": "Ambassador Victor Smith courts diaspora investment in Las Vegas",
    "description": "Ghana’s Ambassador to the United States, Victor Emmanuel Smith, has engaged Ghanaian professionals, community leaders, and association executives in Las Vegas, Nevada, on diaspora-led development and investment opportunities in Ghana.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/Ambassador-Victor-Smith-courts-diaspora-investment-in-Las-Vegas-2015587",
    "timestamp": "2025-12-29T07:57:47Z"
  }
]