[
  {
    "title": "Netanyahu set to give contentious speech at United Nations",
    "description": "Israel's prime minister has vowed to reject calls for a Palestinian state.",
    "link": "https://abcnews.go.com/Politics/netanyahu-set-give-contentious-speech-united-nations/story?id=125937350",
    "timestamp": "2025-09-26T09:23:36Z"
  },
  {
    "title": "Trump spares generic drugs from pharma tariffs, but are they still at risk? Explained",
    "description": "Indian pharmaceutical exports, especially generic drugs, are not expected to be impacted by US tariffs on branded drugs. However, uncertainty remains due to a US investigation into pharmaceutical imports and potential future tariffs that could affect Indian p…",
    "link": "https://www.livemint.com/industry/trump-spares-generic-drugs-from-pharma-tariffs-but-are-they-still-at-risk-explained-11758875731220.html",
    "timestamp": "2025-09-26T09:20:23Z"
  },
  {
    "title": "A Tale of Government Most Fowl",
    "description": "Voters in 2026 are going to be looking for answers to bread-and-butter issues. It will be up to the clean energy and environmental communities to help frame the debate in a manner that resonates with voters, particularly independents and conservative youth an…",
    "link": "https://www.resilience.org/stories/2025-09-26/a-tale-of-government-most-fowl/",
    "timestamp": "2025-09-26T09:18:24Z"
  },
  {
    "title": "Gavin Newsom Toasts Trump Vodka Return With A Bottle Full Of Burn",
    "description": "The California governor raised a mocking glass to the comeback.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-donald-trump-vodka_n_68d64f9fe4b0185d006857f1",
    "timestamp": "2025-09-26T09:18:17Z"
  },
  {
    "title": "Erdogan: Trump and I understand how to achieve a ceasefire and lasting peace in Gaza",
    "description": "Turkish President Recep Tayyip Erdogan addressed the situation in Gaza and said that he is working for a ceasefire together with US President Donald Trump.\"Trump and I understand how to achieve a ceasefire and lasting peace in Gaza. Trump is aware that the si…",
    "link": "https://www.israelnationalnews.com/flashes/667193",
    "timestamp": "2025-09-26T09:15:40Z"
  },
  {
    "title": "Trump says he will not allow Israel to annex the occupied West Bank",
    "description": "US President Donald Trump has publicly stated he will not allow Israel to formally annex the occupied West Bank.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/9/26/trump-says-he-will-not-allow-israel-to-annex-the-occupied-west-bank",
    "timestamp": "2025-09-26T09:15:01Z"
  },
  {
    "title": "American Medical Association urges DHS to exempt physicians from new $100,000 H-1B visa fee",
    "description": "In a letter to the DHS, the groups urged the agency to issue guidance exempting physicians, residents and fellows from the proposed fee, arguing they are essential to sustaining a robust healthcare workforce in the country",
    "link": "https://www.thehindubusinessline.com/news/world/american-medical-association-urges-dhs-to-exempt-physicians-from-new-100000-h-1b-visa-fee/article70097090.ece",
    "timestamp": "2025-09-26T09:14:39Z"
  },
  {
    "title": "Deadly shooting at ICE facility follows trend of sniper-type incidents: Experts",
    "description": "Law enforcement experts said the sniper-type shooting at a Dallas ICE facility is part of a frightening trend.",
    "link": "https://abcnews.go.com/US/deadly-shooting-dallas-ice-facility-trend-sniper-type/story?id=125931318",
    "timestamp": "2025-09-26T09:13:26Z"
  },
  {
    "title": "Turkey's Erdogan says meaningful progress made in Trump talks",
    "description": "ANKARA (Reuters) -Turkish President Tayyip Erdogan said his talks with President Donald Trump on Thursday yielded \"meaningful progress\" in many areas, with...",
    "link": "https://www.yahoo.com/news/articles/turkeys-erdogan-says-meaningful-progress-091311349.html",
    "timestamp": "2025-09-26T09:13:11Z"
  },
  {
    "title": "Meet the judge who will oversee James Comey’s criminal case",
    "description": "The criminal case against former FBI Director James Comey — ordered up by President Donald Trump as he seeks to punish one of his oldest adversaries — will be resolved by the newest judge in the federal court where Comey was charged. U.S. District Judge Micha…",
    "link": "https://freerepublic.com/focus/f-news/4342746/posts",
    "timestamp": "2025-09-26T09:10:44Z"
  },
  {
    "title": "Live updates: Delegates walk out on Netanyahu speech at UN General Assembly | CNN",
    "description": "Israeli Prime Minister Benjamin Netanyahu spoke to the UN General Assembly today ahead of his meeting next week with President Donald Trump, who has vowed to block annexation of the occupied West Bank. Follow for live updates.",
    "link": "https://www.cnn.com/world/live-news/israel-netanyahu-gaza-palestine-09-26-25-intl",
    "timestamp": "2025-09-26T09:09:52Z"
  },
  {
    "title": "European pharma stocks fall after Trump slaps 100% tariffs on medicine imports",
    "description": "Stocks listed in Europe were broadly higher on Friday, as investors assessed the latest trade policy announcements out of the White House.",
    "link": "https://www.cnbc.com/2025/09/26/europe-markets-sept-26-trumps-100percent-pharma-tariffs-ftse-100.html",
    "timestamp": "2025-09-26T09:07:52Z"
  },
  {
    "title": "Ryder Cup 2025: TV channel, streaming, tee times, pairings for Day 1 Friday",
    "description": "The 2025 Ryder Cup tees off Friday at Bethpage Black. Scottie Scheffler headlines Team USA as they take on Europe. Here's how to watch all the action.",
    "link": "https://www.usatoday.com/story/sports/golf/ryder/2025/09/26/2025-ryder-cup-live-updates-scores-results-standings/86329597007/",
    "timestamp": "2025-09-26T09:07:47Z"
  },
  {
    "title": "Trump Tariffs May Not Hurt Indian Companies, Says Morgan Stanley: THIS Pharma Stock An Exception",
    "description": "Morgan Stanley believes the impact could be limited, as far as the Indian market is concerned. However, companies like Sun Pharma could be at risk due to their speciality drug presence in the US.",
    "link": "https://www.ndtvprofit.com/markets/trump-tariffs-may-not-hurt-indian-companies-says-morgan-stanley-sun-pharma-is-an-exception",
    "timestamp": "2025-09-26T09:06:25Z"
  },
  {
    "title": "'Grifter' Melania Trump Ripped For Unveiling Some Very Expensive Christmas Ornaments",
    "description": "The first lady is already cashing in on Christmas.",
    "link": "https://www.huffpost.com/entry/melania-trump-christmas-ornaments_n_68d64630e4b0185d00685012",
    "timestamp": "2025-09-26T09:05:31Z"
  },
  {
    "title": "Silicon Valley's case for Trump's new $100,000 H-1B visa fee",
    "description": "Nvidia CEO Jensen Huang, OpenAI CEO Sam Altman, and Netflix cofounder Reed Hastings have spoken out in favor of President Donald Trump's new H-1B visa fees.\nGetty Images\nPresident Donald Trump rocked the business world when he announced a $100,000 fee for new…",
    "link": "https://biztoc.com/x/29eb65f7e30a15ee",
    "timestamp": "2025-09-26T09:04:47Z"
  },
  {
    "title": "Ukraine's military chief says Russia's 2025 offensives have failed",
    "description": "KYIV (Reuters) -Russia's spring and summer offensives this year have failed to meet their goals, Ukraine's military chief Oleksandr Syrskyi  said, adding...",
    "link": "https://www.yahoo.com/news/articles/ukraines-military-chief-says-russias-090445271.html",
    "timestamp": "2025-09-26T09:04:45Z"
  },
  {
    "title": "Is Donald Trump an isolationist? No, he’s an anti-liberal imperialist",
    "description": "Americans used to be accused of being liberal imperialists, imposing their liberal ideals – all men created equal, inalienable rights, free markets, yada yada – on the rest of the world. \nWhat a long time ago that was.",
    "link": "https://biztoc.com/x/60d67b9ce410a602",
    "timestamp": "2025-09-26T09:04:31Z"
  },
  {
    "title": "Orbán tells Trump dropping Russian energy would bring economy 'to its knees'",
    "description": "Hungarian Prime Minister Viktor Orbán says Hungary will keep buying fossil fuels from Russia despite demands from President Donald Trump",
    "link": "https://biztoc.com/x/970c7522b248ff96",
    "timestamp": "2025-09-26T09:04:14Z"
  },
  {
    "title": "Bear Or Bubble? Why Tech Stocks Remain Expensive Despite Market Downturn",
    "description": "The Nifty IT index has entered a bear market, dropping more than 20% from the peak it touched on Dec. 13, 2024. Yet despite the selloff, most of the companies in the basket continue to command valuations above the sector’s own multiple. Names such as Infosys,…",
    "link": "https://www.ndtvprofit.com/markets/why-tech-stocks-tcs-infosys-coforge-persistent-systems-remain-expensive-despite-market-downturn",
    "timestamp": "2025-09-26T09:03:40Z"
  },
  {
    "title": "US looks for Tony Blair to play key role in Gaza under Donald Trump peace plan",
    "description": "Trump administration wants former British prime minister to be involved in transitional postwar arrangement",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/26/us-looks-for-tony-blair-to-play-key-role-in-gaza-under-donald-trump-peace-plan/",
    "timestamp": "2025-09-26T09:02:53Z"
  },
  {
    "title": "Disengaged voters are the key to winning future elections in the US | CNN Politics",
    "description": "A consensus opinion has emerged about President Donald Trump’s victory in the 2024 election: Disengaged voters were critical.",
    "link": "https://www.cnn.com/2025/09/26/politics/disengaged-voters-us-elections",
    "timestamp": "2025-09-26T09:00:52Z"
  },
  {
    "title": "Video goes viral amid H-1B controversy: Bill Gates reveals how hiring 15 Indians in 1980s helped Microsoft conquer the tech world",
    "description": "Amid the US H-1B visa fee increase, a video of Bill Gates has resurfaced, highlighting Microsoft’s early reliance on Indian engineers. Gates recalled hiring graduates from the IITs in the 1980s, a move initially criticised as a ‘brain drain.’ He emphasised th…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/video-goes-viral-amid-h-1b-controversy-bill-gates-reveals-how-hiring-15-indians-in-1980s-helped-microsoft-conquer-the-tech-world/articleshow/124152992.cms",
    "timestamp": "2025-09-26T09:00:27Z"
  },
  {
    "title": "Political violence on the rise. Is it time for a new domestic terrorism law?",
    "description": "Current federal law prevents domestic terrorism designations, forcing prosecutors to use weak statutes for politically motivated murders like those of Charlie Kirk and Brian Thompson.",
    "link": "https://www.foxnews.com/opinion/political-violence-rise-time-new-domestic-terrorism-law",
    "timestamp": "2025-09-26T09:00:23Z"
  },
  {
    "title": "How US should respond after China rejects Trump nuclear talks, shows off new weapons at parade",
    "description": "China's nuclear arsenal expansion challenges U.S. deterrence capabilities as Beijing builds weapons capable of reaching American ships, bases and allies by 2030.",
    "link": "https://www.foxnews.com/opinion/how-us-should-respond-after-china-rejects-trump-nuclear-talks-shows-off-new-weapons-parade",
    "timestamp": "2025-09-26T09:00:20Z"
  },
  {
    "title": "'My first emotion was fear': Georgetown students react to flyers celebrating Charlie Kirk's murder",
    "description": "The John Brown Gun Club posted flyers at Georgetown University with messages echoing a slogan etched on bullet casings found after Charlie Kirk's assassination.",
    "link": "https://www.foxnews.com/politics/my-first-emotion-fear-georgetown-students-react-flyers-celebrating-charlie-kirks-murder",
    "timestamp": "2025-09-26T09:00:20Z"
  },
  {
    "title": "Trump suggests FIFA World Cup could be moved from unsafe cities",
    "description": "The 2026 edition of the FIFA World Cup is being staged in United States, Canada and Mexico with the final in New Jersey.",
    "link": "https://www.aljazeera.com/sports/2025/9/26/trump-suggests-fifa-world-cup-could-be-moved-from-unsafe-cities",
    "timestamp": "2025-09-26T09:00:05Z"
  },
  {
    "title": "Sam Altman predicts AI will surpass human intelligence by 2030",
    "description": "OpenAI CEO Sam Altman, expects AI will exceed human intelligence by 2030. He emphasized AI's potential in scientific breakthroughs and novel uses.",
    "link": "https://www.businessinsider.com/sam-altman-predicts-ai-agi-surpass-human-intelligence-2030-2025-9",
    "timestamp": "2025-09-26T09:00:02Z"
  },
  {
    "title": "Silicon Valley's case for Trump's new $100,000 H-1B visa fee",
    "description": "Trump's $100K H-1B visa fee won support from tech CEOs like Sam Altman and Jensen Huang for making the visa system a straightforward transaction.",
    "link": "https://www.businessinsider.com/trump-100k-h1b-visa-fee-tech-ceo-support-2025-9",
    "timestamp": "2025-09-26T09:00:02Z"
  },
  {
    "title": "The Democrats’ Shutdown Strategy Is Bad. Trump’s Is Worse",
    "description": "The president’s decision to threaten mass layoffs of federal workers should prompt Democrats to shift course. \nThe post The Democrats’ Shutdown Strategy Is Bad. Trump’s Is Worse  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/09/26/democrats-shutdown-strategy-trump-layoffs/",
    "timestamp": "2025-09-26T09:00:00Z"
  },
  {
    "title": "Trump’s Threat to Justice: Comey and the Politics of Prosecution",
    "description": "As Justice Department attorneys reportedly race to indict the former FBI director, a former federal prosecutor reflects on DOJ’s madness.\nThe post Trump’s Threat to Justice: Comey and the Politics of Prosecution appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/09/26/james-comey-political-prosecution-trumps-threat-to-justice-department/",
    "timestamp": "2025-09-26T09:00:00Z"
  },
  {
    "title": "The Shortest Presidential Campaign",
    "description": "Jeet Heer\n\n\n\nKamala Harris’s 107 Days offers a devastating indictment of Joe Biden. It also documents the limits of her own politics.\r\n\n\r\n\n\nThe post The Shortest Presidential Campaign appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=571665",
    "timestamp": "2025-09-26T09:00:00Z"
  },
  {
    "title": "Current 15pc pharma rates for Ireland holds, says Tánaiste despite Trump’s Truth Social post",
    "description": "Ireland’s existing deal with the US on pharmaceutical tariffs must hold, Tánaiste Simon Harris said this morning in response to US President Trump’s announcement overnight on fresh tariffs.",
    "link": "https://www.independent.ie/world-news/north-america/current-15pc-pharma-rates-for-ireland-holds-says-tanaiste-despite-trumps-truth-social-post/a2017268476.html",
    "timestamp": "2025-09-26T09:00:00Z"
  },
  {
    "title": "Drug Runners on Boats Used to Get a Few Years In Prison. Trump’s Drone Strikes Are Executions Without Trials.",
    "description": "“They are the poorest and weakest link. They are simply pawns in the operation.”\nThe post Drug Runners on Boats Used to Get a Few Years In Prison. Trump’s Drone Strikes Are Executions Without Trials. appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/09/26/trump-venezuela-boat-strike-drugs/",
    "timestamp": "2025-09-26T09:00:00Z"
  },
  {
    "title": "Orbán tells Trump dropping Russian energy would bring economy 'to its knees'",
    "description": "Hungarian Prime Minister Viktor Orbán says Hungary will keep buying fossil fuels from Russia despite demands from President Donald Trump",
    "link": "https://abcnews.go.com/Business/wireStory/hungarys-orbn-tells-trump-dropping-russian-energy-bring-125955930",
    "timestamp": "2025-09-26T08:54:51Z"
  },
  {
    "title": "Trump Imposes 100% Tariff on Imported Drugs Without U.S. Plants",
    "description": "President Donald Trump announced that starting October 1, brand-name or patented pharmaceutical imports will face a 100% tariff unless the manufacturer is actively building a plant in the United States. Trump framed the move as a way to strengthen supply chai…",
    "link": "https://biztoc.com/x/89a83fd1a3ba14ff",
    "timestamp": "2025-09-26T08:53:24Z"
  },
  {
    "title": "How Russ Vought’s ‘trademark chaos’ is shaking up the shutdown fight",
    "description": "Russ Vought careened into the escalating government shutdown fight this week, threatening mass layoffs of federal workers if Democrats don't capitulate to President Donald Trump and fellow Republicans. \nFor those who know the White House budget director's lon…",
    "link": "https://biztoc.com/x/555c278105b73674",
    "timestamp": "2025-09-26T08:53:20Z"
  },
  {
    "title": "US rejects WHO non-communicable diseases declaration: RFK Jr",
    "description": "US Health Secretary Robert F. Kennedy Jr. rejected a United Nations political declaration on non-communicable diseases on Thursday, saying it \"pushes destructive gender ideology\" while ignoring the most pressing health issues. Kennedy said at a high-level mee…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-rejects-who-non-communicable-diseases-declaration-rfk-jr/articleshow/124153433.cms",
    "timestamp": "2025-09-26T08:50:04Z"
  },
  {
    "title": "Hungary’s Orban tells Trump that dropping Russian energy would bring economy ‘to its knees’",
    "description": "BUDAPEST, Hungary (AP) — Hungarian Prime Minister Viktor Orban said Friday that Hungary will continue to source fossil fuels from Russia despite demands from his ally U.S. President Donald Trump, and that he’d informed the president that dropping Russian ener…",
    "link": "https://financialpost.com/pmn/hungarys-orban-tells-trump-that-dropping-russian-energy-would-bring-economy-to-its-knees",
    "timestamp": "2025-09-26T08:45:54Z"
  },
  {
    "title": "Hungary's Orbán tells Trump that dropping Russian energy would bring economy 'to its knees'",
    "description": "Hungarian Prime Minister Viktor Orbán says Hungary will keep buying fossil fuels from Russia despite demands from President Donald Trump",
    "link": "https://www.wftv.com/news/hungarys-orbn-tells/VOKGH7NVHJDRPH7N2E6IGS43ZA/",
    "timestamp": "2025-09-26T08:45:46Z"
  },
  {
    "title": "Trump Defeats Newsom as California Repeals Electric Truck Mandate",
    "description": "President Donald Trump dealt California Governor Gavin Newsom a defeat this week as California regulators voted to repeal a mandate that required trucking fleets to purchase zero-emissions, electric-powered vehicles.\nThe post Trump Defeats Newsom as Californi…",
    "link": "https://www.breitbart.com/politics/2025/09/26/trump-defeats-newsom-as-california-repeals-electric-truck-mandate/",
    "timestamp": "2025-09-26T08:43:56Z"
  },
  {
    "title": "Why stock market is down today? Sensex tumbles over 750 pts, Nifty below 24,650; key reasons behind the slump",
    "description": "Stock Market Crash: Indian stock markets faced a sharp decline on Friday. This occurred after US President Donald Trump declared significant tariffs. These tariffs, reaching up to 100%, will affect branded and patented drug imports. The new tariffs are schedu…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-sensex-is-down-today-sensex-tumbles-over-750-pts-nifty-below-24650-key-reasons-behind-the-slump/articleshow/124152914.cms",
    "timestamp": "2025-09-26T08:43:26Z"
  },
  {
    "title": "Hungary's Orbán tells Trump that dropping Russian energy would bring economy 'to its knees'",
    "description": "Hungarian Prime Minister Viktor Orbán said Friday that Hungary will continue to source fossil fuels from Russia despite demands from his ally U.S. President ...",
    "link": "https://www.yahoo.com/news/articles/hungarys-orb-n-tells-trump-084301824.html",
    "timestamp": "2025-09-26T08:43:01Z"
  },
  {
    "title": "Pokemon pushes back against ICE deportation video - joining list riled by Trump administration",
    "description": "Multiple artists and brands have publicly spoken out after their images, songs and voices were used in government or political videos during Trump's campaign and presidency. Here are some of the most notable cases.",
    "link": "https://news.sky.com/story/pokemon-pushes-back-against-ice-deportation-video-joining-list-riled-by-trump-administration-13438421",
    "timestamp": "2025-09-26T08:43:00Z"
  },
  {
    "title": "Donald Trump threatens to rip up World Cup schedule and strip US cities of hosting rights",
    "description": "Donald Trump's threat is sure to alarm FIFA",
    "link": "https://www.101greatgoals.com/football/internationals/donald-trump-threatens-world-cup-schedule-and-strip-us-cities-of-hosting-rights/",
    "timestamp": "2025-09-26T08:41:51Z"
  },
  {
    "title": "European drugmakers to bear brunt of new U.S. tariffs, India less exposed: GTRI",
    "description": "New US tariffs may heavily impact European pharmaceutical imports. These tariffs target branded and patented drugs. India might be less affected due to its focus on generic medicines. However, the treatment of branded generics remains uncertain. Major pharma …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/european-drugmakers-to-bear-brunt-of-new-u-s-tariffs-india-less-exposed-gtri/articleshow/124153195.cms",
    "timestamp": "2025-09-26T08:41:38Z"
  },
  {
    "title": "Tax on Medicine, Big Trucks & Furniture  – Equity Nepal Explained! ",
    "description": "Trump Revives Global Trade War with New Tariffs Former President Donald Trump has announced a revival of his global trade war, imposing hefty new tariffs on a range of goods including pharmaceuticals, heavy trucks, home renovation materials, and furniture. Th…",
    "link": "https://nep123.com/tax-on-medicine-big-trucks-furniture-%f0%9f%9a%9a%f0%9f%aa%91%f0%9f%92%8a-equity-nepal-explained-%f0%9f%a4%94%f0%9f%87%b3%f0%9f%87%b5/",
    "timestamp": "2025-09-26T08:38:48Z"
  },
  {
    "title": "Answering Trump’s United Nations Challenge",
    "description": "The odds of reforming the multilateral system – which currently serves a few narrow interests – remain slim amid rising geopolitical tensions and growing populist sentiment in rich countries. To make progress on the Sustainable Development Goals, a more diver…",
    "link": "https://www.project-syndicate.org/onpoint/answering-trump-united-nations-challenge-by-sakiko-fukuda-parr-2025-09",
    "timestamp": "2025-09-26T08:36:57Z"
  },
  {
    "title": "Wall Street Journal: Trump’s Latest Power Move Is Simply A ‘Mistake’",
    "description": "The conservative editorial board warned that it could backfire on the president.",
    "link": "https://www.huffpost.com/entry/wall-street-journal-donald-trump-mistake_n_68d64338e4b085d511c5de7c",
    "timestamp": "2025-09-26T08:29:57Z"
  },
  {
    "title": "Fox News’ Howard Kurtz Calls BS on Trump Over James Comey Indictment: ‘Let’s Not Mince Words’",
    "description": "Fox News' Howard Kurtz called out President Donald Trump for orchestrating the indictment of former FBI Director James Comey on Thursday.\nThe post Fox News’ Howard Kurtz Calls BS on Trump Over James Comey Indictment: ‘Let’s Not Mince Words’ first appeared on …",
    "link": "https://www.mediaite.com/media/tv/fox-news-howard-kurtz-calls-bs-on-trump-over-james-comey-indictment-lets-not-mince-words/",
    "timestamp": "2025-09-26T08:29:20Z"
  },
  {
    "title": "Trump threatens to move World Cup games from 'unsafe' host cities",
    "description": "It is unclear whether the US president has the authority to change the venues for the international tournament, run by FIFA.",
    "link": "https://news.sky.com/story/trump-threatens-to-move-world-cup-games-from-unsafe-host-cities-13438416",
    "timestamp": "2025-09-26T08:29:00Z"
  },
  {
    "title": "Do Republicans have ‘room’ for Trump critics? Paul and Massie hope so",
    "description": "MOUNT OLIVET, Ky. — Rand Paul might run for president in 2028. It depends on whether the Republican Party still has space for his fellow Kentuckian who now shares the title of Donald Trump’s biggest conservative troublemaker. “First, we’ve got to see if Thoma…",
    "link": "https://freerepublic.com/focus/f-news/4342745/posts",
    "timestamp": "2025-09-26T08:25:48Z"
  },
  {
    "title": "Trump Says He Will Not Allow Israel to Annex West Bank",
    "description": "U.S. President Donald Trump told reporters yesterday that he would not allow Israel to annex the West Bank, a step that Israeli Prime Minister Benjamin Netanyahu has considered in response to attempts to recognize a Palestinian state.\nThe post Trump Says He W…",
    "link": "https://www.breitbart.com/middle-east/2025/09/26/trump-says-he-will-not-allow-israel-to-annex-west-bank/",
    "timestamp": "2025-09-26T08:25:21Z"
  },
  {
    "title": "Israel is increasingly being treated as a global pariah",
    "description": "Western countries outraged by Israel's Gaza offensive, recognized Palestinian statehood, sparking global backlash and potential sanctions.",
    "link": "https://www.thehindubusinessline.com/news/world/israel-is-increasingly-being-treated-as-a-global-pariah/article70097064.ece",
    "timestamp": "2025-09-26T08:24:08Z"
  },
  {
    "title": "Trump announces new round of drug tariffs, muddying EU-US trade deal",
    "description": "Several major European drugmakers have already announced plans to invest in the US",
    "link": "https://www.euractiv.com/news/trump-announces-new-round-of-drug-tariffs-muddying-eu-us-trade-deal/",
    "timestamp": "2025-09-26T08:24:07Z"
  },
  {
    "title": "Bryson DeChambeau-Donald Trump relationship: Explaining connection between golf star, U.S. president",
    "description": "The pair have developed a friendship over the years.",
    "link": "https://www.sportingnews.com/us/golf/news/bryson-dechambeau-donald-trump-relationship-golf-president/9cdef7bccabfc72ea3496b68",
    "timestamp": "2025-09-26T08:20:01Z"
  },
  {
    "title": "North Korea is close to an ICBM that can hit the U.S. with a nuclear weapon, South Korea says",
    "description": "North Korea is close to developing an intercontinental ballistic missile that could hit the United States with a nuclear weapon, South Korea’s president said Thursday — though he added that it has yet to master the last, crucial step",
    "link": "https://www.nbcnews.com/world/north-korea/north-korea-close-icbm-hit-us-nuclear-weapon-kim-jong-un-unga-rcna233835",
    "timestamp": "2025-09-26T08:18:35Z"
  },
  {
    "title": "Kimmel thanks Trump for his show's near-record viewership",
    "description": "The Tuesday episode of \"Jimmy Kimmel Live!\" was the second-most-watched in the show's history, with 6.26 million viewers on broadcast.",
    "link": "https://www.businessinsider.com/jimmy-kimmel-thanks-trump-near-record-viewership-2025-9",
    "timestamp": "2025-09-26T08:16:28Z"
  },
  {
    "title": "Trump will move World Cup games from 'unsafe' cities",
    "description": "President Donald Trump tells reporters in the Oval Office the US will be \"safe for the World Cup\" next year.",
    "link": "https://www.bbc.com/sport/football/articles/czdjqvyvdd1o",
    "timestamp": "2025-09-26T08:14:33Z"
  },
  {
    "title": "FTSE 100 LIVE: Stocks rise as Starmer set to announce plans for UK digital ID scheme",
    "description": "The UK-wide initiative would enable digital checks on people's right to live and work in the country",
    "link": "https://uk.finance.yahoo.com/news/ftse-100-live-stocks-starmer-uk-digital-id-scheme-081241973.html",
    "timestamp": "2025-09-26T08:12:41Z"
  },
  {
    "title": "Trump's drug tariffs would create 'worst of all worlds': Europe pharma group",
    "description": "A European pharmaceutical group has cautioned against the imposition of tariffs on medicines following President Trump's announcement of steep import duties, including a 100-percent duty on patented pharmaceutical products. Nathalie Moll emphasized that tarif…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trumps-drug-tariffs-would-create-worst-of-all-worlds-europe-pharma-group/articleshow/124152394.cms",
    "timestamp": "2025-09-26T08:11:46Z"
  },
  {
    "title": "Japan might be spared Trump's 100% tariffs on pharmaceuticals",
    "description": "New U.S. tariffs are coming on Oct. 1, U.S. President Donald Trump said in a social media post on Thursday.\n“Starting October 1st, 2025, we will be imposing a 100% Tariff on any branded or patented Pharmaceutical Product, unless a Company IS BUILDING their Ph…",
    "link": "https://biztoc.com/x/7caf178aaee3892f",
    "timestamp": "2025-09-26T08:08:52Z"
  },
  {
    "title": "Big Tech’s flattery of Trump is getting them nowhere",
    "description": "Silicon Valley is caught in a bad bromance with U.S. President Donald Trump.\nMr. Trump came on strong at the start of this year, making tech billionaires, including Tesla Inc. chief executive Elon Musk, honoured guests at his second presidential inauguration …",
    "link": "https://biztoc.com/x/e1a36a82154930c3",
    "timestamp": "2025-09-26T08:08:34Z"
  },
  {
    "title": "Trump allies to control TikTok under new US deal",
    "description": "Donald Trump on Thursday signed an executive order laying out a proposed deal for a US version of TikTok that would put control of the app in the hands of the president’s allies. The deal would see Chinese ownership of TikTok reduced to 20 percent in the Unit…",
    "link": "https://www.digitaljournal.com/world/trump-allies-to-control-tiktok-under-new-us-deal-2/article",
    "timestamp": "2025-09-26T08:07:49Z"
  },
  {
    "title": "Trump says tariff revenue will fund relief for US farmers",
    "description": "“We’re going to take some of that tariff money that we’ve made, we’re going to give it to our farmers, who are — for a little while — going to be hurt until it kicks in, the tariffs kick in to their benefit”",
    "link": "https://www.bloomberg.com/news/articles/2025-09-25/trump-says-tariff-revenue-will-fund-relief-for-us-farmers",
    "timestamp": "2025-09-26T08:07:43Z"
  },
  {
    "title": "Trump says South Korea, Japan will pay billions 'upfront' in investment",
    "description": "SEOUL: US President Donald Trump insisted that South Korea would provide billions of dollars in investments \"upfront\", despite Seoul's contention that it would be plunged into a financial crisis if it met the US demands without safeguards.Trump's remarks cont…",
    "link": "https://www.channelnewsasia.com/east-asia/donald-trump-south-korea-japan-us-billions-upfront-investment-5371266",
    "timestamp": "2025-09-26T08:05:03Z"
  },
  {
    "title": "Tony Blair being lined up to lead temporary Gaza administration - reports",
    "description": "Tony Blair is being lined up to lead a temporary administration in the Gaza Strip to oversee reconstruction after the war, according to reports.",
    "link": "https://news.sky.com/story/tony-blair-being-lined-up-to-lead-temporary-gaza-administration-reports-13438404",
    "timestamp": "2025-09-26T08:05:00Z"
  },
  {
    "title": "India should rid the EU of its delusions",
    "description": "Brussels’ overreach on trade and Russia exposes Europe’s failure to shed its old colonial mindset Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625271-india-europe-trade-pact-russia/",
    "timestamp": "2025-09-26T08:03:43Z"
  },
  {
    "title": "Trump delivers another bitter tariff pill. Who’s set to bite the dust?",
    "description": "A new tariff announced by President Trump will impose a 100% levy on patented pharmaceuticals entering the U.S. from October 1, 2025, unless companies have manufacturing facilities in the country. This policy raises uncertainties about which drugs will be aff…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/trump-pharma-tariff-india-impact-white-house-executive-order-america-medical-bills-nifty-pharma-sun-pharma-cipla-zydus-share-price/articleshow/124143168.cms",
    "timestamp": "2025-09-26T08:02:02Z"
  },
  {
    "title": "Donald Trump-Melana tiff caught on camera! US President points finger at First Lady inside Marine One after she appears to forget to applaud his UN speech",
    "description": "Donald Trump and Melania Trump had a serious discussion. This happened after Marine One landed in Washington, D.C. The couple returned from the United Nations General Assembly in New York. Footage shows Trump gesturing while Melania shakes her head. They late…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-melana-tiff-caught-on-camera-us-president-points-finger-at-first-lady-inside-marine-one-after-she-appears-to-forget-to-applaud-his-un-speech/articleshow/124151945.cms",
    "timestamp": "2025-09-26T08:01:55Z"
  },
  {
    "title": "Donald Trump-Melana tiff caught on camera! US President points finger at First Lady inside Marine One after she appears to forget to applaud his UN speech",
    "description": "Donald Trump and Melania Trump had a serious discussion. This happened after Marine One landed in Washington, D.C. The couple returned from the United Nations General Assembly in New York. Footage shows Trump gesturing while Melania shakes her head. They late…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-melana-heated-exchange-surfaces-as-us-president-waves-finger-at-wife-pair-caught-in-awkward-argument/articleshow/124151945.cms",
    "timestamp": "2025-09-26T08:01:55Z"
  },
  {
    "title": "Woman forced to give up baby an hour after birth wins appeal in Denmark",
    "description": "Ivana Bronlund’s case has become the latest flashpoint between Denmark and Greenland",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/09/22/world/europe/denmark-greenland-baby-reunited.html",
    "timestamp": "2025-09-26T08:01:09Z"
  },
  {
    "title": "Today in History: September 26, Biosphere 2 stay begins in Arizona",
    "description": "Four men and four women began a two-year stay inside a sealed-off structure in Oracle, Arizona, called Biosphere 2.",
    "link": "https://www.bostonherald.com/2025/09/26/today-in-history-september-26-biosphere-2-stay-begins-in-arizona/",
    "timestamp": "2025-09-26T08:00:55Z"
  },
  {
    "title": "Today in History: September 26, Biosphere 2 stay begins in Arizona",
    "description": "Four men and four women began a two-year stay inside a sealed-off structure in Oracle, Arizona, called Biosphere 2.",
    "link": "https://www.denverpost.com/2025/09/26/today-in-history-september-26-biosphere-2-stay-begins-in-arizona/",
    "timestamp": "2025-09-26T08:00:55Z"
  },
  {
    "title": "Trump's Ukraine pivot: Backing away, or backing a winner?",
    "description": "The rationale for U.S. President Donald Trump's whiplash on Ukraine is being hotly debated in Europe and at NATO, where political leaders and experts are asking whether it's personal self-interest or an economical military strategy.",
    "link": "https://www.cbc.ca/news/politics/trump-ukraine-reversal-1.7644226",
    "timestamp": "2025-09-26T08:00:00Z"
  },
  {
    "title": "More than 3 years after relocating to Canada, Ukrainians say their lives remain in limbo",
    "description": "More than three years after fleeing a war zone and planting roots in Canada, some Ukrainians say their future remains uncertain after the federal government's temporary residency program came to an end earlier this year.",
    "link": "https://www.cbc.ca/news/canada/toronto/ukrainians-in-gta-in-limbo-1.7643752",
    "timestamp": "2025-09-26T08:00:00Z"
  },
  {
    "title": "Stephen Colbert Vows To Troll Trump 'Every Night' With 1 Thing",
    "description": "Stephen Colbert Vows To Troll Trump 'Every Night' With 1 Thinghuffpost.com",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-escalator_n_68d62b3ee4b0185d00683f29",
    "timestamp": "2025-09-26T07:57:48Z"
  },
  {
    "title": "Japan might be spared Trump's 100% tariffs on pharmaceuticals",
    "description": "The country has a most-favored-nation agreement with the U.S. that should cover these products.",
    "link": "https://www.japantimes.co.jp/business/2025/09/26/economy/japan-trump-tariffs/",
    "timestamp": "2025-09-26T07:57:00Z"
  },
  {
    "title": "Law & Order: SVU viewers complain after original character is killed off",
    "description": "‘What do you mean we didn’t even get a proper goodbye,’ one fan says",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/law-order-svu-cragen-die-dan-florek-b2834139.html",
    "timestamp": "2025-09-26T07:54:07Z"
  },
  {
    "title": "USA vs. Europe payouts, explained: Why Americans get paid for Ryder Cup but ‘it’s about pride’ for Europeans",
    "description": "2025 marks the first year where players on team USA will receive a stipend for their participation in the Ryder Cup.",
    "link": "https://www.sportingnews.com/us/golf/news/ryder-cup-usa-vs-europe-payouts-explained/9fbf13a85e37d2b87b5611f9",
    "timestamp": "2025-09-26T07:50:01Z"
  },
  {
    "title": "Oracle to be TikTok US gatekeeper",
    "description": "- US President Donald Trump has ‘saved’ TikTok, owned by Chinese digital services giant ByteDance, from being shut down in the US and protected national secur…",
    "link": "https://www.telecomtv.com/content/digital-platforms-services/oracle-to-be-tiktok-us-gatekeeper-53916/",
    "timestamp": "2025-09-26T07:49:54Z"
  },
  {
    "title": "Trump Boasts Right Is ‘Tougher’ As He Warns Left Of Retaliation: 'Bad Things Happen...'",
    "description": "\"I’m the president of all the people,\" Trump boasted amid his menacing comments.",
    "link": "https://www.huffpost.com/entry/donald-trump-right-tougher-left_n_68d631f9e4b0185d00684379",
    "timestamp": "2025-09-26T07:49:02Z"
  },
  {
    "title": "Trump announces ‘national security’ tariffs on drugs, trucks, furniture",
    "description": "The 100% tariff on pharmaceuticals, 25% on trucks, and 30% on furniture will come into effect on October 1.",
    "link": "https://www.aljazeera.com/news/2025/9/26/trump-announces-national-security-tariffs-on-drugs-trucks-furniture",
    "timestamp": "2025-09-26T07:47:50Z"
  },
  {
    "title": "China urges 'open, fair' treatment by US on TikTok issue",
    "description": "China expressed its hope that the United States would ensure equitable treatment for TikTok and other Chinese firms investing within the country, following President Trump's executive order concerning a potential agreement for a US-based version of the app. B…",
    "link": "https://economictimes.indiatimes.com/tech/technology/china-urges-open-fair-treatment-by-us-on-tiktok-issue/articleshow/124151781.cms",
    "timestamp": "2025-09-26T07:46:38Z"
  },
  {
    "title": "Hungary’s Orban Refuses to Budge on Trump Russian Energy Demand",
    "description": "Hungarian Prime Minister Viktor Orban openly pushed back against US President Donald Trump, digging in his heels over purchases of Russian energy.",
    "link": "https://financialpost.com/pmn/business-pmn/hungarys-orban-refuses-to-budge-on-trump-russian-energy-demand",
    "timestamp": "2025-09-26T07:41:42Z"
  },
  {
    "title": "Greta Thunberg Booted Off Her Own Ship As Flotilla Mission Falls Apart!",
    "description": "Greta left ship in Tunisia because \"focus not on Gaza\" and got on a different ship/took a plane (confusion). waaah. Transcript linked below video.",
    "link": "https://freerepublic.com/focus/f-bloggers/4342741/posts",
    "timestamp": "2025-09-26T07:35:33Z"
  },
  {
    "title": "Trump: “I’ve been on the side of Israel really my whole life.”",
    "description": "Trump To Macron: 'I've always been on Israel's side'. Presidents Trump and Macron held a joint press conference where they clashed over the French initiative to declare a Palestinian state. Yoni Kempinski. Sep 25, 2025, 10:24 AM (GMT+3) At a joint press confe…",
    "link": "https://freerepublic.com/focus/f-news/4342739/posts",
    "timestamp": "2025-09-26T07:24:38Z"
  },
  {
    "title": "Did the UN try to trip up Donald Trump and Melania Trump? How a 3-second jolt and Laura Loomer’s explosive claims became an international scandal",
    "description": "A United Nations escalator incident has triggered a political clash. Donald Trump accuses the UN of sabotage after an escalator malfunctioned as he and Melania Trump entered the building. Laura Loomer alleges an assassination attempt, claiming remote control …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/did-the-un-try-to-trip-up-donald-trump-and-melania-trump-how-a-3-second-jolt-and-laura-loomers-explosive-claims-became-an-international-scandal/articleshow/124150374.cms",
    "timestamp": "2025-09-26T07:17:53Z"
  },
  {
    "title": "Trump announces new tariffs on drugs, kitchen cabinets, trucks",
    "description": "President Donald Trump has announced a slew of tariffs to go into effect at the start of next month impacting pharmaceuticals, kitchen cabinets, bathroom...",
    "link": "https://www.upi.com/Top_News/US/2025/09/26/Trump-new-tariffs/3431758867060/",
    "timestamp": "2025-09-26T07:14:05Z"
  },
  {
    "title": "Why ex-FBI Director James Comey has been indicted – what it means",
    "description": "The former director of the US Federal Bureau of Investigations has been accused of lying to Congress.",
    "link": "https://www.aljazeera.com/news/2025/9/26/why-ex-fbi-director-james-comey-has-been-indicted-what-it-means",
    "timestamp": "2025-09-26T07:13:44Z"
  },
  {
    "title": "'I live for this': Europe prepares to take on the home dominance of the US at the Ryder Cup",
    "description": "Gavin Cooney of The 42 previews the 45th Ryder Cup at Bethpage Black, New York.",
    "link": "https://www.the42.ie/ryder-cup-preview-3-6827350-Sep2025/",
    "timestamp": "2025-09-26T07:09:46Z"
  }
]