[
  {
    "title": "What Were the Worst Avoidable Mistakes in America’s COVID Response?",
    "description": "What could have been done differently? With five years of hindsight, what sort of decisions should politicians and public-health officials have made?",
    "link": "http://nymag.com/intelligencer/article/americas-worst-avoidable-mistakes-on-covid-response.html",
    "timestamp": "2025-03-12T09:30:01Z"
  },
  {
    "title": "Why Trump Tariffs Are a Bigger Threat to Jeep Maker Stellantis",
    "description": "Stellantis NV Chairman John Elkann recently told investors that 2025 would be a period of stabilization. For the beleaguered automaker, it’s turning out to be anything but.",
    "link": "https://financialpost.com/pmn/business-pmn/why-trump-tariffs-are-a-bigger-threat-to-jeep-maker-stellantis",
    "timestamp": "2025-03-12T09:26:35Z"
  },
  {
    "title": "Western Media Trying to Explain Ukraine’s Failure in Kursk",
    "description": "Western media seems desperate to explain the failure of the Ukrainian army in Kursk. For months, Western propaganda claimed that the Kursk front was an important Ukrainian military achievement, which was supposedly vital to strengthening Kiev’s position at th…",
    "link": "https://www.globalresearch.ca/western-media-trying-explain-ukraine-failure-kursk/5881853",
    "timestamp": "2025-03-12T09:23:54Z"
  },
  {
    "title": "NASA's chief scientist Katherine Calvin terminated: Who is she? Check details",
    "description": "NASA layoffs: NASA has announced layoffs and its chief scientist Dr Katherine Calvin has also been terminated. The NASA layoffs may signal a shift away from research and toward exploration since both Trump and SpaceX founder Elon Musk support a human mission …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-nasa-layoffs-nasas-chief-scientist-katherine-calvin-terminated-who-is-she-check-details-trump-elon-musk-doge-downsize-federal-workforce/articleshow/118928465.cms",
    "timestamp": "2025-03-12T09:23:16Z"
  },
  {
    "title": "Supporters of detained Columbia student arrested after clash with NYPD as Trump admin seeks his deportation",
    "description": "About a dozen protesters demonstrating in support of former Columbia University student Mahmoud Khalil were arrested on Tuesday as they clashed with police.",
    "link": "https://www.foxnews.com/us/supporters-detained-columbia-student-arrested-after-clash-nypd-trump-admin-seeks-his-deportation",
    "timestamp": "2025-03-12T09:22:31Z"
  },
  {
    "title": "TotalEnergies’ Mozambique LNG Poised for Decision on $4.7 Billion US Loan",
    "description": "TotalEnergies SE’s $20 billion liquefied natural gas facility in Mozambique is poised for a decision on Thursday over key financing by the US Export-Import Bank.",
    "link": "https://financialpost.com/pmn/business-pmn/totalenergies-mozambique-lng-poised-for-decision-on-4-7-billion-us-loan",
    "timestamp": "2025-03-12T09:21:31Z"
  },
  {
    "title": "Perfidious Albion. Scott Ritter",
    "description": "The perfidy of the British is well-known, with the term Perfidious Albion dating back to the decision on the part of England in 1793 to join in with the alliance aligned against the forces of the French revolution. The spirit of that betrayal lives on today, …",
    "link": "https://www.globalresearch.ca/perfidious-albion-scott-ritter/5881851",
    "timestamp": "2025-03-12T09:17:39Z"
  },
  {
    "title": "The stock market's sharp drop might have already priced in a 'shallow' recession",
    "description": "A swift stock market sell off with the S&P 500 nearing a correction has Wall Street strategists debating if enough bad economic news has been priced in to...",
    "link": "https://finance.yahoo.com/news/the-stock-markets-sharp-drop-might-have-already-priced-in-a-shallow-recession-091732303.html",
    "timestamp": "2025-03-12T09:17:32Z"
  },
  {
    "title": "Education Department Cuts 50% Of Workforce, X Users Divided Over 'Unnecessary' Agency",
    "description": "The U.S. Education Department has laid off nearly 50% of its workforce and told employees that its Washington headquarters and regional offices will be closed Wednesday over unspecified \"security reasons.\"",
    "link": "https://www.ibtimes.com/education-department-cuts-50-workforce-x-users-divided-over-unnecessary-agency-3766037",
    "timestamp": "2025-03-12T09:17:18Z"
  },
  {
    "title": "Nasdaq Correction: Why History Says the Sell-Off May Be Nearing Its End",
    "description": "In an atypical move for the market, the Nasdaq-100 index already finds itself in correction territory just 1.5 months into the new administration. Usually, optimism abounds during a president's first year in office. However, this is actually a second Donald T…",
    "link": "https://biztoc.com/x/082d9c671851ea1c",
    "timestamp": "2025-03-12T09:15:10Z"
  },
  {
    "title": "Wisconsin Supreme Court candidates to debate about Trump, Musk and key issues",
    "description": "A closely watched Wisconsin Supreme Court election takes center stage as Republican-backed Brad Schimel and Democratic-backed Susan Crawford are set to debate.",
    "link": "https://abcnews.go.com/Politics/wisconsin-supreme-court-candidates-set-debate-amid-race/story?id=119687380",
    "timestamp": "2025-03-12T09:14:02Z"
  },
  {
    "title": "EU Launches $28 Billion Retaliation to Trump Tariff War",
    "description": "European Commission President Ursula von der Leyen said the EU \"will always remain open to negotiation.\"",
    "link": "https://www.newsweek.com/eu-retaliates-trump-tariff-war-trade-2043338",
    "timestamp": "2025-03-12T09:14:01Z"
  },
  {
    "title": "Donald Trump’s tariffs war offers some global steelmakers a boost - Financial Times",
    "description": "Donald Trump’s tariffs war offers some global steelmakers a boostFinancial Times Trump imposes sweeping 25% tariffs on all steel and aluminum imported into the USCNN Dow Set to Open Up as Trump Tariffs Kick InBarron's Trump Pulls Back Plans to Double Canadian…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176692991",
    "timestamp": "2025-03-12T09:13:21Z"
  },
  {
    "title": "Trump escalates trade war; doubles tariffs on Canada steel, aluminum",
    "description": "U.S. President Donald Trump ramped up his trade war with Canada on Tuesday, doubling the 25% U.S. tariff on its northern neighbor's steel and aluminum exports to 50% after Canada's Ontario provincial leader said he is adding a 25% levy on electricity sold to …",
    "link": "https://www.globalsecurity.org/wmd/library/news/canada/2025/canada-250311-voa01.htm",
    "timestamp": "2025-03-12T09:12:42Z"
  },
  {
    "title": "'Do whatsoever you want': President Pezeshkian rejects talks with US under threats",
    "description": "Iranian President Masoud Pezeshkian has sharply rebuked the Trump administration's maximalist approach toward Iran, declaring that the Islamic Republic is not Ukraine and it will not negotiate with the United States under threats or coercion.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250311-presstv02.htm",
    "timestamp": "2025-03-12T09:12:42Z"
  },
  {
    "title": "Senior official: Iran not to cave in under pressure of sanctions",
    "description": "Iran's deputy foreign minister for legal and international affairs says the Islamic Republic will not cave in to external pressure, adding that the so-called rights advocates are themselves the biggest rights violators for subjecting Iran to the most brutal s…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250311-presstv03.htm",
    "timestamp": "2025-03-12T09:12:42Z"
  },
  {
    "title": "Uh-Oh: Fox News Reporter Called Trump Out 3 Times In Just 1 Day On Live TV",
    "description": "Peter Doocy had some tough talk for the White House as the markets tanked.",
    "link": "https://www.huffpost.com/entry/peter-doocy-trump-markets_n_67d1450be4b0fe02b90870a0",
    "timestamp": "2025-03-12T09:10:26Z"
  },
  {
    "title": "Donald Trump doubles down on his dumb tariffs",
    "description": "If there was a Nobel Prize for dumb ideas, Trump’s trade war would be a lock for it.",
    "link": "https://www.nationalobserver.com/2025/03/11/opinion/donald-trump-dumb-tariffs-ford",
    "timestamp": "2025-03-12T09:09:08Z"
  },
  {
    "title": "Despite withdrawal, U.S. to continue WHA support for Taiwan: MOFA",
    "description": "The United States is expected to maintain its long-term support for Taiwan's efforts to join the World Health Organization (WHO) despite Washington's withdrawal from the international organization, a Taiwanese diplomat said Tuesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250311-cna02.htm",
    "timestamp": "2025-03-12T09:07:17Z"
  },
  {
    "title": "Investors' faith in King Dollar may be wavering",
    "description": "As major international currencies gained against the dollar, some economists and analysts are questioning the dollar's position as a haven currency.",
    "link": "https://markets.businessinsider.com/news/currencies/dedollarization-us-dollar-reserve-haven-currency-trump-trade-euro-yen-2025-3",
    "timestamp": "2025-03-12T09:05:45Z"
  },
  {
    "title": "Tata Harrier EV Teaser Gives Sneak Peek At Interiors For First Time",
    "description": "Tata Harrier EV will come with a layout very similar to its ICE counterpart on sale in India.",
    "link": "https://www.ndtv.com/auto/tata-harrier-ev-teaser-gives-sneak-peek-at-interiors-for-first-time-7906974",
    "timestamp": "2025-03-12T09:05:27Z"
  },
  {
    "title": "From Amazon to Pinterest: The 40 tech companies that file the most H-1B immigrant work visas",
    "description": "President Donald Trump\nWin McNamee/Pool Photo via AP\nTech companies seek to hire thousands of skilled foreign workers through H-1B visas each year.\nPresident Donald Trump's immigration crackdown is raising questions about the future of such visas.\nSee which t…",
    "link": "https://biztoc.com/x/8d1c803089333898",
    "timestamp": "2025-03-12T09:04:02Z"
  },
  {
    "title": "Supply management is the trade barrier Canadian politicians are reticent to tear down",
    "description": "As the United States presses Canada for dairy market access, federal and provincial leaders will have to decide whether it’s worth protecting supply management, a system that’s been an irritant with trading partners and a trade barrier within the country.\nU.S…",
    "link": "https://biztoc.com/x/78f6570c1b64c3e0",
    "timestamp": "2025-03-12T09:04:01Z"
  },
  {
    "title": "Trump’s 25% tariffs on all steel and aluminum imports go into effect",
    "description": "Trump’s 25% tariffs on all steel and aluminum imports go into effect\nTrump’s 25% tariffs on all steel and aluminum imports go into effect\nWASHINGTON (AP) — President Donald Trump officially increased tariffs on all steel and aluminum imports to 25% on Wednesd…",
    "link": "https://biztoc.com/x/f4151590197eb32a",
    "timestamp": "2025-03-12T09:03:49Z"
  },
  {
    "title": "Random Capitalisation and “unnecessary quotes”: how to tweet like Trump",
    "description": "TRUMP’S threats towards Canada and the world are hard to take in without being distracted by his bizarre writing style. Want to emulate it? Here’s how.",
    "link": "https://www.thedailymash.co.uk/news/science-technology/random-capitalisation-and-unnecessary-quotes-how-to-tweet-like-trump-20250312255475",
    "timestamp": "2025-03-12T09:02:49Z"
  },
  {
    "title": "Ceasefire 'in Russia's hands,' Ukraine says after US meeting in Saudi Arabia",
    "description": "The prospects for a ceasefire between Russia and Ukraine \"is in Moscow's hands,\" a top aide to Ukrainian President Volodymyr Zelenskyy said following talks with the U.S.",
    "link": "https://abcnews.go.com/International/ceasefire-russias-hands-ukraine-after-us-meeting-saudi/story?id=119703072",
    "timestamp": "2025-03-12T09:02:36Z"
  },
  {
    "title": "US resumes intelligence sharing, security aid to Ukraine",
    "description": "U.S. President Donald Trump's administration will immediately lift the pause on intelligence sharing and resume security assistance to Ukraine following Tuesday's talks between senior U.S. and Ukrainian officials in Jeddah, Saudi Arabia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250311-voa01.htm",
    "timestamp": "2025-03-12T09:02:36Z"
  },
  {
    "title": "Funding bill heads to U.S. Senate as partial government shutdown looms large",
    "description": "WASHINGTON, March 12 (Xinhua) -- The U.S. House of Representatives passed a bill on Tuesday to avert",
    "link": "http://en.people.cn/n3/2025/0312/c90000-20288603.html",
    "timestamp": "2025-03-12T09:02:09Z"
  },
  {
    "title": "Ball In Russia's Court As Ukraine Agrees To US Cease-Fire Proposal",
    "description": "US President Donald Trump - and the world - are about to find out whether Russia is really interested in ending its more than three-year full-scale invasion of Ukraine or pursuing its maximalist goals of absorbing the country.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250311-rferl04.htm",
    "timestamp": "2025-03-12T09:02:01Z"
  },
  {
    "title": "DOGE’s Private-Equity Playbook",
    "description": "Maureen Tkacik\n\n\n\nElon Musk's rampage through the government is a classic PE takeover, replete with bogus numbers and sociopathic executives.\r\n\n\r\n\n\nThe post DOGE’s Private-Equity Playbook appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/doges-private-equity-playbook/",
    "timestamp": "2025-03-12T09:02:00Z"
  },
  {
    "title": "Ukraine Agrees To US-Brokered Cease-Fire Deal, Unlocking Military Aid And Intelligence Sharing",
    "description": "Ukraine has agreed to a US proposal for a 30-day cease-fire in the war against the Russian invasion, prompting the United States to say it would immediately lift the suspension of military aid, including the sharing of intelligence.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250311-rferl02.htm",
    "timestamp": "2025-03-12T09:01:56Z"
  },
  {
    "title": "Zelensky in Saudi Arabia for support after clash with Trump in US",
    "description": "Ukrainian President Volodymyr Zelensky has sought support in Saudi Arabia after a dispute with his American counterpart Donald Trump during a highly contentious White House meeting late last month.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250311-presstv02.htm",
    "timestamp": "2025-03-12T09:01:55Z"
  },
  {
    "title": "Ukraine says talks with US start 'very constructively' in Jeddah",
    "description": "Senior officials from the United States and Ukraine are meeting in Saudi Arabia for talks aimed at ending the war with Russia, which is now in its fourth year.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250311-presstv01.htm",
    "timestamp": "2025-03-12T09:01:54Z"
  },
  {
    "title": "Ukraine agrees to an immediate 30-day ceasefire after talks with American officials in Saudi Arabia",
    "description": "The United States will immediately lift a pause on intelligence sharing and resume providing security assistance to Ukraine after delegates from Kyiv agreed to accept the Trump administration's proposal for a 30-day interim ceasefire with Russia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250311-irna01.htm",
    "timestamp": "2025-03-12T09:01:49Z"
  },
  {
    "title": "Ukraine agrees to 30-day ceasefire during talks with U.S. in Saudi Arabia",
    "description": "Ukraine on Tuesday signaled its readiness to accept a U.S. proposal for an \"immediate, interim 30-day ceasefire\" following talks with a U.S. delegation in Jeddah, Saudi Arabia, according to a joint statement.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250312-pdo02.htm",
    "timestamp": "2025-03-12T09:01:33Z"
  },
  {
    "title": "US resumes aid to Ukraine as Kyiv endorses 30-day truce",
    "description": "The Donald Trump administration lifted its suspension of military aid and intelligence sharing for Ukraine, after Kyiv endorsed a 30-day cease-fire in the conflict with Russia, pending Moscow's agreement, officials from the United States and Ukraine said on T…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250312-pdo01.htm",
    "timestamp": "2025-03-12T09:01:31Z"
  },
  {
    "title": "China to Host Russia And Iran for Talks on Moribund Nuclear Deal",
    "description": "China said it would hold nuclear talks with Iran and Russia, discussions that come just after the Trump administration urged Tehran to return to negotiate a new deal over its atomic activities.",
    "link": "https://financialpost.com/pmn/business-pmn/china-to-host-russia-and-iran-for-talks-on-moribund-nuclear-deal",
    "timestamp": "2025-03-12T09:01:06Z"
  },
  {
    "title": "Why the Department of Education is going to RIP",
    "description": "In the business world, companies that spend billions without achieving measurable success collapse. In government, there is no accountability for agencies like the Department of Education.",
    "link": "https://www.foxnews.com/opinion/why-the-department-of-education-is-going-to-rip",
    "timestamp": "2025-03-12T09:00:54Z"
  },
  {
    "title": "Speaker Mike Johnson and Republicans are at odds over January 6 investigation | CNN Politics",
    "description": "Republicans are at a standstill over their investigation relitigating the January 6, 2021, attack on the US Capitol, with House Speaker Mike Johnson and the Republican leading the effort disagreeing on how to move forward.",
    "link": "https://www.cnn.com/2025/03/12/politics/johnson-loudermilk-trump-january-6-investigation-cheney/index.html",
    "timestamp": "2025-03-12T09:00:54Z"
  },
  {
    "title": "New CNN poll: Americans are negative on Trump’s handling of economy | CNN Politics",
    "description": "Americans are not impressed with President Donald Trump’s stewardship of the economy, according to a new CNN poll conducted by SSRS, putting him underwater on the nation’s top issue even as he sees ratings among the best of his presidential career on other ke…",
    "link": "https://www.cnn.com/2025/03/12/politics/cnn-poll-trump-economy/index.html",
    "timestamp": "2025-03-12T09:00:52Z"
  },
  {
    "title": "Senator Lummis’ BITCOIN Act proposes BTC Reserve to tackle U.S. debt crisis",
    "description": "The bill proposes purchasing 200,000 BTC annually for five years. What are the potential implications of this on market sentiment and U.S. debt reduction?",
    "link": "https://ambcrypto.com/senator-lummis-bitcoin-act-proposes-btc-reserve-to-tackle-u-s-debt-crisis/",
    "timestamp": "2025-03-12T09:00:40Z"
  },
  {
    "title": "Stranded In Space, NASA Astronauts Close To Return After Next ISS Launch",
    "description": "Crew-10 is expected to dock early Thursday, followed by a brief handover before Crew-9 departs on March 16 for an ocean splashdown off the Florida coast.",
    "link": "https://www.ndtv.com/world-news/stranded-in-space-nasa-astronauts-sunita-williams-butch-wilmore-coming-closer-to-return-after-next-iss-launch-7906927",
    "timestamp": "2025-03-12T09:00:27Z"
  },
  {
    "title": "Trump’s federal layoffs are a betrayal of working Americans",
    "description": "Trump’s priorities couldn’t be clearer – mass layoffs for working people and more money for the wealthiest among us. That’s a betrayal of the very people who make this country work.",
    "link": "https://www.foxnews.com/opinion/trumps-federal-layoffs-betrayal-working-americans",
    "timestamp": "2025-03-12T09:00:23Z"
  },
  {
    "title": "Why Are AOC and Bernie So Much Better at This?",
    "description": "The only signs of life in the Democratic opposition to Donald Trump are coming from the party’s left flank.",
    "link": "http://nymag.com/intelligencer/article/why-are-aoc-and-bernie-so-much-better-at-this.html",
    "timestamp": "2025-03-12T09:00:09Z"
  },
  {
    "title": "From Amazon to Pinterest: The 40 tech companies that file the most H-1B immigrant work visas",
    "description": "President Trump's immigration crackdown is raising questions about visa programs for skilled workers. See which tech companies file the most H-1Bs.",
    "link": "https://www.businessinsider.com/40-tech-companies-sponsor-most-h-1b-immigrant-workers-visas-2025-3",
    "timestamp": "2025-03-12T09:00:02Z"
  },
  {
    "title": "Andrée Blouin’s Revolutionary Lives",
    "description": "Bill Fletcher Jr.\n\n\n\nThe African political leader’s autobiography, My Country, Africa, also offers a larger story of empire, oppression, and resistance on the continent.\r\n\n\r\n\n\nThe post Andrée Blouin’s Revolutionary Lives appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/andree-blouin-my-country-africa-autobiography/",
    "timestamp": "2025-03-12T09:00:01Z"
  },
  {
    "title": "Parts of LA Are Not Going to Be Habitable",
    "description": "Kate Wagner\n\n\n\nInsurers have figured out that risk is too high in parts of California. We need to re-conceive how people are housed, and fast.\r\n\n\r\n\n\nThe post Parts of LA Are Not Going to Be Habitable appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/la-wildfires-insurance-state-intervention-housing/",
    "timestamp": "2025-03-12T09:00:01Z"
  },
  {
    "title": "White Flops Rejoice!",
    "description": "Kali Holloway\n\n\n\nDEI is being snuffed out in DC. Mediocre whiteness reigns. And we’re all going to suffer for it.\r\n\n\r\n\n\nThe post White Flops Rejoice! appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/dei-white-mediocrity-trump/",
    "timestamp": "2025-03-12T09:00:01Z"
  },
  {
    "title": "How Covid Sickened the National Psyche",
    "description": "Jeet Heer\n\n\nWhile the US was a troubled nation long before the coronavirus, our failure to treat the pandemic as an enduring emergency helped birth this nasty moment.\r\n\n\r\n\n\nThe post How Covid Sickened the National Psyche appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/national-long-covid-five-years/",
    "timestamp": "2025-03-12T09:00:01Z"
  },
  {
    "title": "New York tech workers are flocking to a coffee shop across from OpenAI's new office. I checked it out to see why.",
    "description": "The Puck Building is becoming the red-hot center of Manhattan's tech scene. That's led to crowding at the coffee shop across the street.",
    "link": "https://www.businessinsider.com/la-cabra-coffee-shop-review-openai-new-york-office-2025-3",
    "timestamp": "2025-03-12T09:00:01Z"
  },
  {
    "title": "The Agony of JD Vance",
    "description": "Tarence Ray\n\n\n\nThe vice president's main job appears to be to embody the banshee scream of a dying order.\r\n\n\r\n\n\nThe post The Agony of JD Vance appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=545802",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "A Health System Is Fighting Idaho’s Abortion Ban. It’s Not Its First Controversial Stance.",
    "description": "by Audrey Dutton, ProPublica, and Kelcie Moseley-Morris, States Newsroom \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories …",
    "link": "https://www.propublica.org/article/st-lukes-hospital-idaho-abortion-ban",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "Canada's Energy Minister Threatens the U.S. With Oil Export Cuts",
    "description": "Canada’s energy minister has threatened Washington with curbing exports of crude oil in response to the Trump administration’s import tariffs on Canadian goods. Jonathan Wilkinson also suggested export tariffs were among the retaliatory options being consider…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Canadas-Energy-Minister-Threatens-the-US-With-Oil-Export-Cuts.html",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "Hospitals keep dodging price transparency rules, leading Trump to take action — again",
    "description": "Trump signed an executive order on hospital price transparency. Experts say it could help lower health care costs, if hospitals comply.",
    "link": "https://www.nbcnews.com/health/health-news/hospitals-keep-dodging-price-transparency-rules-leading-trump-take-act-rcna195874",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "The key Project 2025 authors now staffing the Trump administration",
    "description": "Trump has invited some of the most prominent contributors to the Project 2025 playbook into his administration.",
    "link": "https://www.nbcnews.com/politics/trump-administration/key-project-2025-authors-now-staffing-trump-administration-rcna195107",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "Europe’s Rude Awakening",
    "description": "Even with the announcement about resuming military aid to Kyiv, Trump's abandonment of Ukraine has Europe vowing strategic autonomy, but ending its military dependence on Washington won't be easy.\nThe post Europe’s Rude Awakening appeared first on Washington …",
    "link": "http://washingtonmonthly.com/2025/03/12/europes-rude-awakening/",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "An Arm and a Leg: Medical-Debt Watchdog Gets Sidelined by the New Administration",
    "description": "The Consumer Financial Protection Bureau is offline — for now. Here’s what that could mean for people with medical debt.",
    "link": "https://kffhealthnews.org/news/podcast/an-arm-and-a-leg-medical-debt-watchdog-cfpb-sidelined-trump-administration/",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "Price growth set to remain stubborn in February — and beyond",
    "description": "Price growth was set to have cooled slightly in February, forecasters said in advance of the latest Consumer Price Index report, but President Donald Trump’s tariff policies are already threatening to derail things.",
    "link": "https://www.nbcnews.com/business/economy/inflation-report-february-2025-what-to-know-about-economy-right-now-rcna195903",
    "timestamp": "2025-03-12T09:00:00Z"
  },
  {
    "title": "EU retaliates against Trump tariffs with $45b in countermeasures",
    "description": "The European Union has retaliated against US President Donald Trump with \"countermeasures\" worth $45 billion after his administration increased tariffs on all steel and aluminium imports to 25 per cent.",
    "link": "https://www.abc.net.au/news/2025-03-12/eu-retaliates-against-trump-tariffs-with-45b-in-countermeasures/105044092",
    "timestamp": "2025-03-12T08:56:34Z"
  },
  {
    "title": "EU responds to Donald Trump's tariffs with duties on $45b of US goods",
    "description": "The European Union is retaliating against US President Donald Trump with \"countermeasures\" on $45 billion of US goods after his administration increased tariffs on all steel and aluminium imports to 25 per cent.",
    "link": "https://www.abc.net.au/news/2025-03-12/eu-retaliates-against-trump-tariffs-with-45b-countermeasures/105044092",
    "timestamp": "2025-03-12T08:56:34Z"
  },
  {
    "title": "Donald Trump Brings Home Tesla Model S: All About The Electric Vehicle",
    "description": "US President Donald Trump on Tuesday bought a red Tesla Model S. The 78-year-old revealed that he purchased the car to show support for Elon Musk&#039;s company.",
    "link": "https://www.ndtv.com/feature/donald-trump-brings-home-tesla-model-s-all-about-the-electric-vehicle-7906281",
    "timestamp": "2025-03-12T08:56:26Z"
  },
  {
    "title": "The culture war on 'wokeness,' from the US to Germany",
    "description": "In the US, Donald Trump has declared war on anything considered \"woke.\" The term is also denigrated by many in Germany. \"Wokeness is trouble, wokeness is bad,\" US President Donald Trump recently ranted in his State of the Union address to Congress.\n\nWokeness,…",
    "link": "https://www.dw.com/en/the-culture-war-on-wokeness-from-the-us-to-germany/a-71892359",
    "timestamp": "2025-03-12T08:54:00Z"
  },
  {
    "title": "The U.S. says Japan has a 700% tariff on American rice. Is that the case?",
    "description": "White House Press Secretary Karoline Leavitt's accusation describes only a small portion of U.S. rice imported by Japan.",
    "link": "https://www.japantimes.co.jp/news/2025/03/12/japan/japan-rice-tariffs/",
    "timestamp": "2025-03-12T08:53:00Z"
  },
  {
    "title": "Scoop: Trump Jr. backs Donalds for Fla. governor in MAGA squeeze play",
    "description": "Donald Trump Jr. is endorsing Rep. Byron Donalds for Florida governor, following in his father's footsteps and cementing Donalds as the frontrunner over possible contender Casey DeSantis, the state's first lady.\nWhy it matters: The move by Trump Jr. — a key p…",
    "link": "https://biztoc.com/x/e48dfe0adf945ad1",
    "timestamp": "2025-03-12T08:52:50Z"
  },
  {
    "title": "Skydance claims rival Paramount bidder trying to ‘hijack’ deal proceedings with late offer",
    "description": "David Ellison’s Skydance Media has written a letter to the Federal Communications Commission (FCC) alleging that investment group Project Rise Partners (PRP) is attempting to “hijack”...",
    "link": "https://www.c21media.net/news/skydance-claims-rival-paramount-bidder-trying-to-hijack-deal-proceedings-with-late-offer/",
    "timestamp": "2025-03-12T08:51:56Z"
  },
  {
    "title": "The European Union retaliates after the U.S. metals tariffs take hold",
    "description": "The European Union on Wednesday announced retaliatory trade action with a series of duties on U.S. products, responding to the Trump administration rise in tariffs on all steel and aluminum imports.",
    "link": "https://www.npr.org/2025/03/12/g-s1-53280/european-union-us-metals-tariffs",
    "timestamp": "2025-03-12T08:51:54Z"
  },
  {
    "title": "Everything bubble is bursting, this crash may be biggest in history: Robert Kiyosaki",
    "description": "Robert Kiyosaki warns of an impending market crash, predicting it could surpass the 1929 Great Depression. As U.S. indices decline, he advises investors to stay calm, wait for opportunities, and buy assets at deep discounts after the dust settles.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/everything-bubble-is-bursting-this-crash-may-be-biggest-in-history-robert-kiyosaki/articleshow/118927428.cms",
    "timestamp": "2025-03-12T08:47:03Z"
  },
  {
    "title": "Today in Sweden: A roundup of the latest news on Wednesday",
    "description": "Northvolt applies for bankruptcy in Sweden, unemployment remains high, and one US dollar cost less than 10 kronor for first time in two years. Here's some of the news from Sweden on Wednesday.",
    "link": "https://www.thelocal.se/20250312/today-in-sweden-a-roundup-of-the-latest-news-on-wednesday-188",
    "timestamp": "2025-03-12T08:45:07Z"
  },
  {
    "title": "How Citibank got caught in a $20 billion climate fight",
    "description": "Trump pushed the bank to freeze a green investment program. Nonprofits are suing to save it.",
    "link": "http://grist.org/politics/trump-zeldin-epa-citi-greenhouse-gas-reduction-fund/",
    "timestamp": "2025-03-12T08:45:00Z"
  },
  {
    "title": "Trump’s Address to Congress, Lame Democrat Proposals, Highlights the Absence of Opposition",
    "description": "On the total flaccidity of what passes for opposition to Trump.",
    "link": "https://www.nakedcapitalism.com/2025/03/trumps-address-to-congress-lame-democrat-proposals-highlights-the-absence-of-opposition.html",
    "timestamp": "2025-03-12T08:44:06Z"
  },
  {
    "title": "Donald Trump rejects Australia's bid for exemption from steel and aluminium tariffs",
    "description": "Australia will not be granted an exemption from US tariffs on aluminium and steel imports, the White House says. US President Donald Trump had previously said he would consider excluding Australia from the 25 per cent tariffs, which take effect on Wednesday. …",
    "link": "https://freerepublic.com/focus/f-news/4303703/posts",
    "timestamp": "2025-03-12T08:42:29Z"
  },
  {
    "title": "Russian spy chief holds phone conversation with CIA boss",
    "description": "Sergey Naryshkin and John Ratcliffe have agreed to maintain regular contact to reduce tensions between the US and Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614064-svr-cia-phone-talk/",
    "timestamp": "2025-03-12T08:42:20Z"
  },
  {
    "title": "Iran says to receive Trump letter 'soon'",
    "description": "Iran's top diplomat said Wednesday an Arab country will soon deliver it a letter from US President Donald Trump, who has called for striking a nuclear deal with the Islamic republic. On Friday, Trump said he wrote a letter to Iran's supreme leader Ayatollah A…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-says-to-receive-trump-letter-soon/articleshow/118927251.cms",
    "timestamp": "2025-03-12T08:42:13Z"
  },
  {
    "title": "US higher in premarket with tariffs, CPI in focus",
    "description": "Equities in the United States traded higher in Wednesday's premarket after President Donald Trump enacted tariffs on steel and aluminum imports and in anticipation of the latest reports on inflation a...",
    "link": "https://biztoc.com/x/677a3fe06908e397",
    "timestamp": "2025-03-12T08:41:34Z"
  },
  {
    "title": "Iran Tells Trump: \"Do Whatever The Hell You Want.\"",
    "description": "President Masoud Pezeshkian says Iran will never accept negotiations with the U.S. unless they are \"based on mutual respect.\"",
    "link": "https://www.newsweek.com/iran-president-rejects-us-threats-tells-trump-do-whatever-hell-you-want-nuclear-2043330",
    "timestamp": "2025-03-12T08:39:56Z"
  },
  {
    "title": "Centre-right party wins Greenland's parliamentary election as Trump seeks control",
    "description": "The centre-right Demokraatit Party has won the most votes in Greenland's parliamentary elections, a surprise result as the territory went to the polls in the shadow of US President Donald Trump's stated goal of taking control of the island one way or another.",
    "link": "https://www.abc.net.au/news/2025-03-12/centre-right-party-wins-most-votes-in-greenland/105044184",
    "timestamp": "2025-03-12T08:39:35Z"
  },
  {
    "title": "Center-right party wins Greenland's parliamentary election as Trump seeks control",
    "description": "The centre-right Demokraatit Party has won the most votes in Greenland's parliamentary elections, a surprise result as the territory went to the polls in the shadow of US President Donald Trump's stated goal of taking control of the island one way or another.",
    "link": "https://www.abc.net.au/news/2025-03-12/center-right-party-wins-most-votes-in-greenland/105044184",
    "timestamp": "2025-03-12T08:39:35Z"
  },
  {
    "title": "Katie Porter is ‘damn sure’ about defending abortion, LGBTQ+, immigrant rights in California gov. bid",
    "description": "Katie Porter has officially entered the race for California governor, and the former Democratic Rep. has said that she is “damn sure” about defending abortion, LGBTQ+ and immigrant rights for Californians.  On Tuesday (11 March), Porter, who previously repres…",
    "link": "https://www.thepinknews.com/2025/03/12/katie-porter-california-governor-race/",
    "timestamp": "2025-03-12T08:37:12Z"
  },
  {
    "title": "Trump revokes security clearance of Biden officials in sweeping vendetta",
    "description": "US President Donald Trump has ordered revocation of security clearances for dozens of officials, including several senior figures, from the country's former administration of Joe Biden in a sweeping move that has reignited debate over potential political purg…",
    "link": "https://www.globalsecurity.org/intell/library/news/2025/intell-250311-presstv01.htm",
    "timestamp": "2025-03-12T08:35:35Z"
  },
  {
    "title": "White House defends Trump's push to deport pro-Palestinian activist",
    "description": "The White House on Tuesday defended President Donald Trump's deportation policy after the weekend arrest of Mahmoud Khalil, a Palestinian activist and U.S. legal permanent resident, who played a prominent role in last year's university protests over the Gaza …",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250311-voa03.htm",
    "timestamp": "2025-03-12T08:35:35Z"
  },
  {
    "title": "Philippine Ex-President Duterte 'Headed To Hague' After Arrest Over Deadly Antidrug Campaign",
    "description": "Former Philippine President Rodrigo Duterte boarded a Europe-bound plane on March 11, local media reported, hours after he was arrested on an International Criminal Court (ICC) warrant linked to his decades-long campaign against drugs that killed thousands of…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250311-rferl03.htm",
    "timestamp": "2025-03-12T08:35:35Z"
  },
  {
    "title": "Irish PM visits White House amid divisions on economy, Ukraine, Gaza",
    "description": "For more than 70 years, Irish leaders have visited the White House for the annual St. Patrick's Day celebration of Irish-America heritage.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250311-voa04.htm",
    "timestamp": "2025-03-12T08:35:35Z"
  },
  {
    "title": "US enacts tariffs on all steel, aluminum imports",
    "description": "The United States enacted new 25% tariffs Wednesday on all steel and aluminum imports, ending previous exemptions that had been in place for a number of U.S. allies.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250312-voa01.htm",
    "timestamp": "2025-03-12T08:35:35Z"
  },
  {
    "title": "U.S. reverses extra 25 pct tariffs on Canadian steel, aluminum",
    "description": "The United States on Tuesday reversed its plan to impose extra 25 percent tariffs on Canadian steel and aluminum, after the Canadian province of Ontario dropped tariffs on electricity exports to three U.S. states.",
    "link": "https://www.globalsecurity.org/wmd/library/news/canada/2025/canada-250312-pdo01.htm",
    "timestamp": "2025-03-12T08:35:35Z"
  },
  {
    "title": "5 takeaways from China's National People's Congress",
    "description": "China's 10-day National People Congress ended in Beijing on Tuesday amid sweeping promises from the country's leaders to boost economic growth, support AI and to take control over democratic Taiwan.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/03/china-250311-rfa01.htm",
    "timestamp": "2025-03-12T08:35:35Z"
  },
  {
    "title": "How Trump could win, and deserve, a Nobel Peace Prize",
    "description": "It’s no secret that Donald Trump is obsessed with winning the Nobel Peace Prize, which is one reason why he’s pushing Ukraine and Russia so hard toward cease-fire negotiations.  The way the US president is going about it won’t earn him any favour in Oslo, tho…",
    "link": "https://www.independent.ie/world-news/how-trump-could-win-and-deserve-a-nobel-peace-prize/a1308494930.html",
    "timestamp": "2025-03-12T08:34:44Z"
  },
  {
    "title": "Russian sources sceptical of US 30-day ceasefire idea for Ukraine",
    "description": "US to resume security support to Ukraine as Russia sees trap in ceasefire proposal",
    "link": "https://www.irishtimes.com/world/europe/2025/03/12/russia-ukraine-ceasefire-united-states-donald-trump-latest/",
    "timestamp": "2025-03-12T08:34:07Z"
  },
  {
    "title": "Ronald Reagan’s Daughter Shreds Donald Trump Over 1 Key Policy: ‘Suddenly, We’re Hated’",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_4ae0d240-3de0-4979-b8b4-a7ce9b8d7405",
    "timestamp": "2025-03-12T08:33:45Z"
  },
  {
    "title": "Reagan’s Daughter Shreds Trump Over 1 Key Policy: ‘Suddenly, We’re Hated’",
    "description": "Patti Davis also predicted how her late father would feel about the current president.",
    "link": "https://www.huffpost.com/entry/patti-davis-donald-trump-policy_n_67d13342e4b02a1e69bdc813",
    "timestamp": "2025-03-12T08:33:45Z"
  },
  {
    "title": "'Completely Crazy': Jimmy Kimmel Has 1 Biting Question For People Who Voted For Trump",
    "description": "The late night host hit Trump's supporters after the president went after Canada yet again.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-canada_n_67d13ba6e4b02a1e69bdcb57",
    "timestamp": "2025-03-12T08:33:43Z"
  },
  {
    "title": "Russian sources sceptical of US 30-day ceasefire idea for Ukraine",
    "description": "MOSCOW (Reuters) -Russian sources on Wednesday reacted warily to a U.S. proposal for a 30-day ceasefire supported by Kyiv, saying that any deal to end to the war in Ukraine would have to take into account the Russian advances and address Moscow's concerns. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/03/12/russian-sources-sceptical-of-us-30-day-ceasefire-idea-for-ukraine",
    "timestamp": "2025-03-12T08:33:00Z"
  },
  {
    "title": "Amid Market Turmoil, Trump Is Haunted By His Past Words",
    "description": "Throughout the 2020 presidential election, Donald Trump repeatedly delivered a scary warning to the electorate: If elected, Joe Biden would cause an economic collapse. The incumbent’s demagoguery wasn’t based on anything real or substantive; he just hoped to …",
    "link": "https://biztoc.com/x/10ce80fc542897fa",
    "timestamp": "2025-03-12T08:30:55Z"
  },
  {
    "title": "How Will the Federal Reserve Operate the Trump Economy?",
    "description": "President Donald Trump has long been jealous of the Federal Reserve's power over the American economy. With stocks falling and tariffs rising under Trump's watch, however, the world's financial experts (and a whole bunch of folks on Wall Street) are looking t…",
    "link": "https://biztoc.com/x/970b3af49aa66a14",
    "timestamp": "2025-03-12T08:30:49Z"
  }
]