[
  {
    "title": "Warren Leads Call for Education Department Watchdog to Probe DOGE 'Infiltration'",
    "description": "U.S. Sen. Elizabeth Warren on Monday urged the Department of Education's Office of Inspector General to investigate an \"infiltration\" by President Donald Trump's government-gutting entity that, until recently, was spearheaded by billionaire Elon Musk.In Febru…",
    "link": "https://www.commondreams.org/news/doge-education",
    "timestamp": "2025-06-09T17:57:55Z"
  },
  {
    "title": "How the News Networks Are Covering the L.A. Immigration Protests",
    "description": "The major news networks have been covering the unrest since the weekend.",
    "link": "https://www.adweek.com/tvnewser/news-networks-los-angeles-immigration-coverage/",
    "timestamp": "2025-06-09T17:57:39Z"
  },
  {
    "title": "Chaos in Los Angeles: Is a 2020 Redux Coming?",
    "description": "Whether it’s George Floyd or ICE raids, the far left always seems to find an excuse for mayhem. The city of Los Angeles is on fire. Once again, the progressive left has resorted to political violence – this time, using mass arrests of illegal aliens by Immigr…",
    "link": "https://freerepublic.com/focus/f-news/4321936/posts",
    "timestamp": "2025-06-09T17:57:06Z"
  },
  {
    "title": "Rachel Maddow sees Americans’ active resistance as key to overcoming Donald Trump’s strongman game",
    "description": "Rachel Maddow doesn’t sugarcoat fascism. As President Donald Trump’s second term barrels forward — defined by secret deportations, domestic military zones, and sweeping data seizures — Maddow is documenting resistance, not just unraveling.",
    "link": "https://www.advocate.com/news/maddow-trump-protests-important",
    "timestamp": "2025-06-09T17:56:38Z"
  },
  {
    "title": "What Side Are the ‘All-In Pod’ Bros On?",
    "description": "The Silicon Valley podcasters are torn between their two favorite fascists.",
    "link": "https://gizmodo.com/what-side-are-the-all-in-pod-bros-on-2000613146",
    "timestamp": "2025-06-09T17:55:43Z"
  },
  {
    "title": "Chinese Exports Bound For US Plunge To 5-Year Low",
    "description": "Chinese exports to the U.S. fell nearly 35% in May compared to a year prior as trade tensions escalate between the two countries.",
    "link": "https://dailycaller.com/2025/06/09/chinese-exports-bound-for-us-plunge-5-year-low/",
    "timestamp": "2025-06-09T17:55:41Z"
  },
  {
    "title": "Trump urges Homan to arrest Newsom: 'I would do it'",
    "description": "The exchange followed Newsom explicitly stating \"Tom, arrest me\" to Homan during a clip on MSNBC. President Donald Trump on Monday urged border czar Tom Homan to arrest Gov. Gavin Newsom, D-Calif., amid ongoing riots in Los Angeles, calling him \"grossly incom…",
    "link": "https://freerepublic.com/focus/f-news/4321935/posts",
    "timestamp": "2025-06-09T17:53:57Z"
  },
  {
    "title": "Elon Musk Warms Back To Trump After LA Unrest",
    "description": "Tesla CEO Elon Musk appeared to rekindle ties with President Donald Trump over the weekend following days of public criticism. The shift came as protests escalated in Los Angeles in response to immigration raids and actions by federal agents. \nMusk deleted se…",
    "link": "https://biztoc.com/x/8fb5e5c0fb29f7c2",
    "timestamp": "2025-06-09T17:53:41Z"
  },
  {
    "title": "Space stocks soar as Elon Musk and Donald Trump argue",
    "description": "Last week, a social media post from Elon Musk caused many people to stop in their tracks. The Tesla (TSLA) CEO had taken his conflict with President Donald Trump in a direction that seemed shocking, even for him. \nIn the now-deleted post, Musk accused Trump o…",
    "link": "https://biztoc.com/x/14c1a50f99562746",
    "timestamp": "2025-06-09T17:53:36Z"
  },
  {
    "title": "‘It’s Right There On the Tape’: MNSBC Reporter Fires Back After Tom Homan Calls Him ‘Dishonest’",
    "description": "The dispute comes amid ongoing unrest in Los Angeles, where federal agents have clashed with protesters for days during mass immigration enforcement operations.\nThe post ‘It’s Right There On the Tape’: MNSBC Reporter Fires Back After Tom Homan Calls Him ‘Dish…",
    "link": "https://www.mediaite.com/media/tv/its-right-there-on-the-tape-mnsbc-reporter-fires-back-after-tom-homan-calls-him-dishonest/",
    "timestamp": "2025-06-09T17:53:23Z"
  },
  {
    "title": "L.A. Burning",
    "description": "The riots of a sanctuary state. “The federal government is moving to take over the California National Guard and deploy 2,000 soldiers,” Gov. Gavin Newsom explained in a June 7 statement.“That move is purposefully inflammatory and will only escalate tensions.…",
    "link": "https://freerepublic.com/focus/f-news/4321933/posts",
    "timestamp": "2025-06-09T17:52:02Z"
  },
  {
    "title": "India always ready to conclude trade pact with low hanging fruits: Piyush Goyal on US trade deal",
    "description": "India is keen to finalize a trade agreement with the US by initially focusing on easily achievable aspects, according to Commerce Minister Piyush Goyal. Discussions are underway in New Delhi, with hopes of an interim deal before July 9. Both nations aim to si…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-always-ready-to-conclude-trade-pact-with-low-hanging-fruits-piyush-goyal-on-us-trade-deal/articleshow/121735144.cms",
    "timestamp": "2025-06-09T17:50:44Z"
  },
  {
    "title": "Louisiana Is The Latest State To Try To Ban Non-Existent Chemtrails",
    "description": "Kind of love how the people who don't believe in actual climate change believe in this nonsense.",
    "link": "https://www.wonkette.com/p/louisiana-is-the-latest-state-to",
    "timestamp": "2025-06-09T17:50:37Z"
  },
  {
    "title": "Newsom promises to sue over federal response to insurrection",
    "description": "'Trump wants the violence to end now as opposed to escalating as it did in the Rodney King riots'",
    "link": "https://www.wnd.com/2025/06/newsom-promises-to-sue-over-federal-response-to-insurrection/",
    "timestamp": "2025-06-09T17:49:50Z"
  },
  {
    "title": "Car Blows Up as Karen Bass Says ‘Things in L.A. are Calm’",
    "description": "Bass also said the city doesn't need the National Guard. Yeah, lady, the riots calmed down after their deployment.\nThe post Car Blows Up as Karen Bass Says ‘Things in L.A. are Calm’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/car-blows-up-as-karen-bass-says-things-in-l-a-are-calm/",
    "timestamp": "2025-06-09T17:49:36Z"
  },
  {
    "title": "India needs a new playbook for Naya America that needs careful handling",
    "description": "Despite recent setbacks with India, Pakistan gains potential leverage through a field marshal, renewed Washington presence, and possible Trump support. India's military success is shadowed by China's active involvement, straining US relations. India navigates…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/india-needs-a-new-playbook-for-naya-america-that-needs-careful-handling/articleshow/121735117.cms",
    "timestamp": "2025-06-09T17:48:55Z"
  },
  {
    "title": "'So afraid': At least 16 Senate Republicans now sweating over Trump budget",
    "description": "The House and Senate Republicans are readying for a fight now that the former has passed President Donald Trump's 2026 budget, which he refers to as his \"big, beautiful bill.\" The Senate is readying to give them a wake-up call. According to Punchbowl News, Se…",
    "link": "https://www.rawstory.com/senate-republicans-budget-reconciliation/",
    "timestamp": "2025-06-09T17:48:45Z"
  },
  {
    "title": "Tesla stock gets a fresh downgrade, with the Musk-Trump fight fueling uncertainty and risk of 'brand damage'",
    "description": "Baird downgraded shares of Tesla from \"Buy\" to \"Neutral,\" saying the Musk-Trump spat has led to more uncertainty and the potential for brand damage.",
    "link": "https://www.businessinsider.com/tesla-stock-downgrade-musk-trump-baird-tsla-brand-damage-2025-6",
    "timestamp": "2025-06-09T17:48:12Z"
  },
  {
    "title": "Georgia’s experience raises red flags for Medicaid work requirement moving through Congress",
    "description": "Advocates say the results so far should serve as a warning.",
    "link": "https://www.bostonherald.com/2025/06/09/medicaid-georgia/",
    "timestamp": "2025-06-09T17:48:12Z"
  },
  {
    "title": "Time Magazine's New Cover Will Make You Sad If You're A Democrat",
    "description": "The magazine found a way to truly make an ass of the beleaguered party.",
    "link": "https://www.huffpost.com/entry/time-magazine-cover-donkey-lost_n_684702ede4b0c1bc4e8070af",
    "timestamp": "2025-06-09T17:45:25Z"
  },
  {
    "title": "What the National Guard Crackdown in LA Made Us See",
    "description": "Protestors in Los Angeles are calling attention to what President Donald Trump doesn't want voters to see, writes Paola Ramos.",
    "link": "https://time.com/7292305/la-protests-national-guard-crackdown-essay/",
    "timestamp": "2025-06-09T17:44:40Z"
  },
  {
    "title": "Trump gives blunt response to Newsom daring Homan to arrest him: 'I would'",
    "description": "Trump supports arresting Gov. Newsom if he obstructs ICE operations, claims Los Angeles protesters are \"professional agitators\" who \"should be in jail.\"",
    "link": "https://www.foxnews.com/politics/trump-gives-blunt-response-newsom-daring-homan-arrest-him-i-would",
    "timestamp": "2025-06-09T17:44:33Z"
  },
  {
    "title": "Sunny Hostin insists its 'not illegal' to be undocumented during immigration discussion on 'The View'",
    "description": "\"The View\" co-host Sunny Hostin argued it wasn't illegal to be undocumented as co-host Sara Haines pointed out U.S. support for deporting illegal immigrants.",
    "link": "https://www.foxnews.com/media/sunny-hostin-insists-its-not-illegal-undocumented-during-immigration-discussion-the-view",
    "timestamp": "2025-06-09T17:44:28Z"
  },
  {
    "title": "Musk row with Trump is ‘damaging’ Tesla, warns Wall Street",
    "description": "In This Article:\nTesla stock has been downgraded by two influential investment researchers in the wake of boss Elon Musk’s feud with Donald Trump.\nShares in the electric car maker dropped by as much as 4.5pc at the opening bell on Wall Street after analysts w…",
    "link": "https://biztoc.com/x/7ed737d78ffb880b",
    "timestamp": "2025-06-09T17:42:40Z"
  },
  {
    "title": "Trump Tariffs Under Legal Fire: What You Need to Know",
    "description": "Are Trump’s Tariffs Even Legal? As a little-known trade court rules against the president, all eyes turn to the Supreme Court and how it will navigate its own Major Questions Doctrine.\nThe post Trump Tariffs Under Legal Fire: What You Need to Know appeared fi…",
    "link": "http://washingtonmonthly.com/2025/06/09/trump-tariffs-headed-to-supreme-court/",
    "timestamp": "2025-06-09T17:40:10Z"
  },
  {
    "title": "Trump allies go down in flames in attempted takeover of the Washington DC Bar",
    "description": "President Donald Trump's allies made a dash to try and take over the Bar Association for Washington, D.C. — but the effort failed badly. In March, NBC News reported that two Trump allies were running for the D.C Bar's leadership. Bradley Bondi, Attorney Gener…",
    "link": "https://www.rawstory.com/bar-association-2672335642/",
    "timestamp": "2025-06-09T17:40:03Z"
  },
  {
    "title": "Explainer-What is the High Seas Treaty to protect world oceans?",
    "description": "LONDON (Reuters) - While many countries have agreed to take steps to protect the vast, ungoverned swathes of the world's oceans, they have yet to see their High Seas Treaty go into effect. This week's U.N. Oceans Conference in the French city of Nice hopes to…",
    "link": "https://www.thestar.com.my/news/world/2025/06/10/explainer-what-is-the-high-seas-treaty-to-protect-world-oceans",
    "timestamp": "2025-06-09T17:40:00Z"
  },
  {
    "title": "Donald Trump Responds To Gavin Newsom’s Dare To Arrest Him, Says He “Would Do It” If He Were The Border Czar",
    "description": "Donald Trump responded to California Governor Gavin Newsom’s dare to administration officials to arrest him, with the president suggesting that he would support such a move by his border czar, Tom Homan. “I would do it if I were Tom. I think it’s great,” Trum…",
    "link": "http://deadline.com/2025/06/trump-gavin-newsom-arrest-ice-raids-1236428228/",
    "timestamp": "2025-06-09T17:39:28Z"
  },
  {
    "title": "Donald Trump Responds To Gavin Newsom’s Dare To Arrest Him, Says He “Would Do It” If He Were The Border Czar",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_2ab5ded1-3ad1-4f05-b25f-b222dc3314d5",
    "timestamp": "2025-06-09T17:39:28Z"
  },
  {
    "title": "Abrego Garcia return to US prompts new questions for other immigrants deported by Trump",
    "description": "President Donald Trump's administration faces legal pushback over migrant deportations to El Salvador, Mexico and South Sudan amid questions over due process.",
    "link": "https://www.foxnews.com/politics/abrego-garcia-return-us-prompts-new-questions-other-immigrants-deported-trump",
    "timestamp": "2025-06-09T17:38:14Z"
  },
  {
    "title": "House Dems try to blame Trump for Los Angeles violence despite months of anti-ICE rhetoric",
    "description": "Democrats are accusing the Trump administration of \"baiting\" violence in Los Angeles despite their own inflammatory anti-ICE rhetoric.",
    "link": "https://www.foxnews.com/politics/house-dems-try-blame-trump-los-angeles-violence-despite-months-anti-ice-rhetoric",
    "timestamp": "2025-06-09T17:37:09Z"
  },
  {
    "title": "CNN's Dana Bash: Trump Was the 'Arsonist' in Los Angeles",
    "description": "Monday on CNN's \"Inside Politics,\" host Dana Bash said President Donald Trump was acting as the \"arsonist\" by sending the National Guard to Los Angeles.\nThe post CNN’s Dana Bash: Trump Was the ‘Arsonist’ in Los Angeles appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/06/09/cnns-dana-bash-trump-was-the-arsonist-in-los-angeles/",
    "timestamp": "2025-06-09T17:35:32Z"
  },
  {
    "title": "James Woods Tells Gavin Newsom to Resign Over L.A. ICE Riots: ‘When You Vote Democrat, You're Voting for This’",
    "description": "Actor James Woods told California Gov. Gavin Newsom (D) to resign over the Los Angeles U.S. Immigration and Customs Enforcement (ICE) riots. \"Our beautiful state burned and destroyed by invaders.\"\nThe post James Woods Tells Gavin Newsom to Resign Over L.A. IC…",
    "link": "https://www.breitbart.com/entertainment/2025/06/09/james-woods-tells-gavin-newsom-to-resign-over-l-a-ice-riots-when-you-vote-democrat-youre-voting-for-this/",
    "timestamp": "2025-06-09T17:34:24Z"
  },
  {
    "title": "Trump travel ban hits immigrant family coming to U.S. amid bloody civil war in Myanmar",
    "description": "A Burmese American woman was eager to bring her siblings over to the U.S. from Myanmar amid a more than 15-year wait for visas.",
    "link": "https://www.nbcnews.com/news/asian-america/trump-travel-ban-myanmar-civil-war-visa-rcna211500",
    "timestamp": "2025-06-09T17:34:23Z"
  },
  {
    "title": "Trump Has Long Floated Using Force Against His Own People — Now He Has the Pretext to Do So",
    "description": "Incidents involving the deployment of the National Guard are rare, though politically cataclysmic.",
    "link": "https://www.yahoo.com/news/trump-long-floated-using-force-173334550.html",
    "timestamp": "2025-06-09T17:33:34Z"
  },
  {
    "title": "Trump Says Tom Homan Should Arrest Gavin Newsom As Riots In LA Rage",
    "description": "President Donald Trump said his border czar Tom Homan should arrest California Gov. Gavin Newsom as the riots in Los Angeles continue.",
    "link": "https://dailycaller.com/2025/06/09/donald-trump-gavin-newsom-tom-homan-arrest-riots-raids-los-angeles/",
    "timestamp": "2025-06-09T17:33:21Z"
  },
  {
    "title": "California governor to sue Trump over deployment of National Guard to protests",
    "description": "California governor Gavin Newsom said he plans to sue US President Donald Trump in response to the administration's extraordinary deployment of the National Guard to confront immigration protesters who took to the streets in Los Angeles.",
    "link": "https://www.independent.ie/world-news/north-america/california-governor-to-sue-trump-over-deployment-of-national-guard-to-protests/a1942225816.html",
    "timestamp": "2025-06-09T17:32:32Z"
  },
  {
    "title": "Trump Uses National Guard to Punish California’s Defiance",
    "description": "Trump is using the National Guard to punish California’s defiance. The Los Angeles protests are not a full-on “rebellion” against the U.S. government — but that’s how Trump views his long battle with Gavin Newsom and other blue state officials.",
    "link": "http://nymag.com/intelligencer/article/trump-uses-national-guard-to-punish-californias-defiance.html",
    "timestamp": "2025-06-09T17:31:27Z"
  },
  {
    "title": "Justice Jackson warns the Supreme Court is manipulating the rules to benefit Trump",
    "description": "On Friday, the Supreme Court handed down a brief order permitting the Department of Government Efficiency, the enigmatic White House entity that billionaire Elon Musk previously ran, to access a wide range of sensitive information kept by the Social Security …",
    "link": "https://www.vox.com/scotus/416073/supreme-court-justice-ketanji-brown-jackson-shadow-docket-trump",
    "timestamp": "2025-06-09T17:31:24Z"
  },
  {
    "title": "US inflation fears eased in May amid Trump tariff walkback",
    "description": "Americans’ worries over inflation tempered in May, according to a New York Federal Reserve survey released Monday, signaling rising consumer optimism following shifts in US President Donald Trump’s tariff policy.\nThe one-year inflation outlook dipped from 3.6…",
    "link": "https://biztoc.com/x/62232f81baafe535",
    "timestamp": "2025-06-09T17:31:06Z"
  },
  {
    "title": "Tesla Stock Gets Analyst Downgrade As ‘Double-Edged Sword’ Of Musk-Trump Relationship Rears Head",
    "description": "Topline\nTesla earned a new analyst downgrade in the wake of last week’s stunning showdown between the formerly close allies in Tesla CEO Elon Musk and President Donald Trump, as the stock continues to face pressure from Musk’s activities outside of his execut…",
    "link": "https://biztoc.com/x/5e046e9ec4652aa4",
    "timestamp": "2025-06-09T17:31:00Z"
  },
  {
    "title": "Scott Pelley and Anderson Cooper Discuss CBS News’ Potential Settlement With Donald Trump",
    "description": "Pelley said that any apology to the Trump administration would be \"damaging\" to CBS News.",
    "link": "https://www.adweek.com/tvnewser/scott-pelley-anderson-cooper-cbs-news-settlement/",
    "timestamp": "2025-06-09T17:30:54Z"
  },
  {
    "title": "Musk Deleted Now Infamous Trump-Epstein Post",
    "description": "One of the most infamous tweets that helped kick off the feud between Elon Musk and Donald Trump has been deleted. Musk appears to be responsible for removing the  X post claiming that United States President Trump’s name was in the sealed Jeffrey Epstein fil…",
    "link": "https://www.shtfplan.com/headline-news/musk-deleted-now-infamous-trump-epstein-post",
    "timestamp": "2025-06-09T17:30:28Z"
  },
  {
    "title": "Trump says California Governor Gavin Newsom should be arrested",
    "description": "US “Border Czar” Tom Homan should act on California Governor Gavin Newsom’s dare to arrest him, Donald Trump said.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/9/trump-says-california-governor-gavin-newsom-should-be-arrested",
    "timestamp": "2025-06-09T17:26:28Z"
  },
  {
    "title": "Here’s What Happens If Trump Invokes The Insurrection Act In Los Angeles",
    "description": "At least 300 National Guard troops have been deployed to Los Angeles, and the president has not ruled out whether he will invoke the Insurrection Act.",
    "link": "https://www.huffpost.com/entry/donald-trump-insurrection-act-los-angeles_n_68012370e4b0f92ccce16100",
    "timestamp": "2025-06-09T17:23:40Z"
  },
  {
    "title": "Ladies of The View Warn of ‘Civil War’ After Trump Sends in National Guard to ‘Attack’ Protesters",
    "description": "The show aired a clip of Los Angeles Mayor Karen Bass accusing Trump of escalating tensions by deploying troops to the city on Sunday before demonstrators clashed with police.\nThe post Ladies of The View Warn of ‘Civil War’ After Trump Sends in National Guard…",
    "link": "https://www.mediaite.com/media/tv/ladies-of-the-view-warn-of-civil-war-after-trump-sends-in-national-guard-to-attack-protesters/",
    "timestamp": "2025-06-09T17:23:28Z"
  },
  {
    "title": "What the Trump-Musk Feud Means for SpaceX and NASA",
    "description": "A clash between two temperamental billionaires could have wide-ranging implications for space exploration.",
    "link": "https://time.com/7292326/trump-musk-feud-spacex-nasa/",
    "timestamp": "2025-06-09T17:22:55Z"
  },
  {
    "title": "What is Palantir? Meet the AI tech titan powering Trump-era surveillance and data operations",
    "description": "Donald Trump initiated a data exchange program among federal agencies. Palantir Technologies, co-founded by Peter Thiel, supports this. Palantir secured a substantial government contract. The firm gathers data for agencies like Homeland Security. This initiat…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-palantir-meet-the-ai-tech-titan-powering-trump-era-surveillance-and-data-operations/articleshow/121733364.cms",
    "timestamp": "2025-06-09T17:22:32Z"
  },
  {
    "title": "Health Insurers Call Out Trump On Promise To Not Cut Seniors’ Medicare",
    "description": "Health insurance companies say legislation in the Republican-controlled Congress would break a promise by President Trump not to cut Medicare benefits for seniors.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/06/09/health-insurers-call-out-trump-on-promise-to-not-cut-seniors-medicare/",
    "timestamp": "2025-06-09T17:21:07Z"
  },
  {
    "title": "CFPB Funding in Crosshairs of Senate Banking Committee’s Megabill Provisions",
    "description": "A so-called megabill grabbing headlines and making its way through Congress is on track to further alter the Consumer Financial Protection Bureau, an agency already in flux during the first few months of the President Donald Trump administration.\n \n [contact-…",
    "link": "https://biztoc.com/x/7fb0f4220b92a7a9",
    "timestamp": "2025-06-09T17:19:59Z"
  },
  {
    "title": "Tesla hit with a pair of downgrades amid fallout from Trump feud",
    "description": "(Bloomberg/Ryan Vlastelica) — Tesla Inc. was hit with a pair of downgrades on Monday, underscoring mounting concerns on Wall Street about the electric-vehicle maker’s outlook following last week’s clash between Chief Executive Elon Musk and President Donald T…",
    "link": "https://biztoc.com/x/c6b788d827d6cfba",
    "timestamp": "2025-06-09T17:19:54Z"
  },
  {
    "title": "How Elon Musk Is Responding to LA Riots During Feud With Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nElon Musk shared comments made by President Donald Trump and Vice President JD Vance related to the Los Angeles riots during his ongoing public feud with Trump over the \"One Big Beautiful Bill\" proposal.\nOn Su…",
    "link": "https://biztoc.com/x/dd416c994bbf8895",
    "timestamp": "2025-06-09T17:19:42Z"
  },
  {
    "title": "Uranium Is Hot: How New Nuclear Policies Could Spark A Market Revival",
    "description": "U.S. energy policy is giving new life to nuclear power—and uranium. Learn why this overlooked commodity may be poised for long-term gains and what investors should watch.",
    "link": "https://www.forbes.com/sites/rrapier/2025/06/09/uranium-is-hot-how-new-nuclear-policies-could-spark-a-market-revival/",
    "timestamp": "2025-06-09T17:18:19Z"
  },
  {
    "title": "US Ambassador Huckabee urges Haredi leaders: 'Preserve government to confront Iran'",
    "description": "US Ambassador to Israel Mike Huckabee has reportedly urged senior Haredi politicians to refrain from supporting the dissolution of the Israeli government, stressing that political stability is vital for confronting the Iranian threat.",
    "link": "https://www.israelnationalnews.com/news/409695",
    "timestamp": "2025-06-09T17:18:10Z"
  },
  {
    "title": "When Families Disagree",
    "description": "I have observed that today's politics causes family divisions and family break-ups. Which side initiates breaking off communication more, the left or the right political position? My opinion is that the left side breaks off communication and shuns the right s…",
    "link": "https://freerepublic.com/focus/f-chat/4321924/posts",
    "timestamp": "2025-06-09T17:17:35Z"
  },
  {
    "title": "BREAKING: Trump Says His Border Czar Should Arrest California Governor Gavin Newsom",
    "description": "“I would do it if I was Tom, I think it's great. Gavin likes the publicity, but I think would be a great thing”\nThe post BREAKING: Trump Says His Border Czar Should Arrest California Governor Gavin Newsom first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/breaking-trump-says-his-border-czar-should-arrest-california-governor-gavin-newsom/",
    "timestamp": "2025-06-09T17:17:11Z"
  },
  {
    "title": "How Elon Musk Is Responding to LA Riots During Feud With Trump",
    "description": "Elon Musk shared comments made by President Donald Trump and Vice President JD Vance regarding the Los Angeles riots.",
    "link": "https://www.newsweek.com/how-elon-musk-responding-la-riots-amid-feud-donald-trump-2082973",
    "timestamp": "2025-06-09T17:16:20Z"
  },
  {
    "title": "Always emerging, never emerged?",
    "description": "BRICS has acquired a reasonable economic heft in relation to G7 and, tellingly, has quite a way to go in reaching the latter's consumption levels. An economic structure that requires EMs to focus on domestic demand also frees up global capital for that specif…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/always-emerging-never-emerged/articleshow/121734316.cms",
    "timestamp": "2025-06-09T17:15:53Z"
  },
  {
    "title": "'I didn’t vote for this': Pro-Trump Appalachians are 'living on the edge'",
    "description": "When Donald Trump narrowly defeated Democratic nominee Kamala Harris in the United States' 2024 election, he did so with a combination of MAGA diehards and independents. There are huge differences between the between the two: While Trump's hardcore MAGA base …",
    "link": "https://www.rawstory.com/i-didnt-vote-for-this-pro-trump-appalachians-are-living-on-the-edge/",
    "timestamp": "2025-06-09T17:14:40Z"
  },
  {
    "title": "Donald Trump says he'd arrest California Gov. Gavin Newsom",
    "description": "The dare and double-dare between Newsom and the Trump administration comes after the president ordered the National Guard into Los Angeles.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/09/trump-arrest-california-governor-newsom/84116920007/",
    "timestamp": "2025-06-09T17:14:37Z"
  },
  {
    "title": "CFPB Funding in Crosshairs of Senate Banking Committee’s Megabill Provisions",
    "description": "A so-called megabill grabbing headlines and making its way through Congress is on track to further alter the Consumer Financial Protection Bureau, an agency already in flux during the first few months of the President Donald Trump administration. [contact-for…",
    "link": "http://www.pymnts.com/news/cfpb/2025/cfpb-funding-crosshairs-senate-banking-committee-megabill-provisions/",
    "timestamp": "2025-06-09T17:14:26Z"
  },
  {
    "title": "Abrego Garcia is back in US, but government is stonewalling merits contempt inquiry, court filing says",
    "description": "Lawyers for a mistakenly deported Maryland immigrant are asking a federal judge to pursue contempt proceedings against the Trump administration for “an elaborate, all-of-government effort to defy court orders” in the case seeking his return—even though the Sa…",
    "link": "https://www.abajournal.com/news/article/even-though-abrego-garcia-is-back-in-us-government-stonewalling-merits-contempt-inquiry-court-filing-says",
    "timestamp": "2025-06-09T17:14:00Z"
  },
  {
    "title": "How the United States Can Win the Global Tech Race",
    "description": "Bans and sanctions aren’t enough to beat China.",
    "link": "http://foreignpolicy.com/2025/06/09/china-tech-deepseek-chips-tech/",
    "timestamp": "2025-06-09T17:13:19Z"
  },
  {
    "title": "'I would': Trump says he'd arrest California Gov Gavin Newsom",
    "description": "President Donald Trump told reporters on Monday afternoon that, if he were Tom Homan, he’d arrest California Gov. Gavin Newsom (D). Homan is the White House Executive Associate Director of Enforcement and Removal Operations (ERO), which Trump refers to as the…",
    "link": "https://www.rawstory.com/gavin-newsom-trump/",
    "timestamp": "2025-06-09T17:11:10Z"
  },
  {
    "title": "US agencies assessed Chinese telecom hackers likely hit data center and residential internet providers",
    "description": "Data center giant Digital Realty and mass media titan Comcast were documented as likely victims of the Salt Typhoon cyberespionage group, people familiar say, marking a potentially major expansion of the group’s initial telecom hacking campaign discovered las…",
    "link": "https://www.nextgov.com/cybersecurity/2025/06/us-agencies-assessed-chinese-telecom-hackers-likely-hit-data-center-and-residential-internet-providers/405920/",
    "timestamp": "2025-06-09T17:11:00Z"
  },
  {
    "title": "Musk And Trump’s Master Class In What CEOs Should Not Do",
    "description": "Also in the Forbes CEO newsletter: Crayola CEO talks about the creative future, CEO confidence plummets, unemployment holds steady and new jobs are down.",
    "link": "https://www.forbes.com/sites/meganpoinski/2025/06/09/musk-and-trumps-master-class-in-what-ceos-should-not-do/",
    "timestamp": "2025-06-09T17:09:41Z"
  },
  {
    "title": "Waymo Halts Service in LA as Vandals Keep Setting Its Robotaxis on Fire",
    "description": "It's Lit Downtown Los Angeles was a riot scene on Sunday as people vandalized and torched several Waymo vehicles while protesting a nation-wide crackdown on immigrants, prompting the robotaxi company to shut service to the area, according to CNBC. Dramatic im…",
    "link": "https://futurism.com/the-byte/waymo-robotaxi-fire-los-angeles",
    "timestamp": "2025-06-09T17:09:33Z"
  },
  {
    "title": "'State of rebellion': Expert weighs in on Newsom challenge to Trump deploying National Guard",
    "description": "President Donald Trump mobilized the National Guard to quell protests and riots in California over the weekend, but he was met with objections from Gov. Gavin Newsom, who vows to sue.",
    "link": "https://www.foxnews.com/politics/state-rebellion-expert-weighs-newsom-challenge-trump-deploying-national-guard",
    "timestamp": "2025-06-09T17:09:02Z"
  },
  {
    "title": "Legal Analysts Weigh in on Trump's National Guard Deployment to California",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nLegal experts weighed in about whether President Donald Trump has the legal authority to deploy the National Guard to Los Angeles as California Governor Gavin Newsom announced a lawsuit challenging the adminis…",
    "link": "https://biztoc.com/x/ea8d53ca45360fdf",
    "timestamp": "2025-06-09T17:08:51Z"
  },
  {
    "title": "Trump Likes to 'Create Chaos' in Cities, Cuomo Says",
    "description": "Former New York Governor Andrew Cuomo talks about the anti-deportation protests going on in Los Angeles and President Donald Trump deploying National Guard troops over the weekend. Cuomo says this is just \"Trump being Trump,\" and normally local government's a…",
    "link": "https://biztoc.com/x/e3292b9e8046e2c9",
    "timestamp": "2025-06-09T17:08:48Z"
  },
  {
    "title": "LA protests inch Elon Musk back to President Trump",
    "description": "",
    "link": "https://biztoc.com/x/b9f43561bed3763d",
    "timestamp": "2025-06-09T17:08:41Z"
  },
  {
    "title": "Musk does immediate 180 on Trump as soon as LA riots rage",
    "description": "While Elon Musk issued harsh words against President Donald Trump just a few days ago, he appeared to endorse the administration's handling of the LA riots.",
    "link": "https://www.foxnews.com/politics/musk-does-immediate-180-trump-soon-la-riots-rage",
    "timestamp": "2025-06-09T17:08:19Z"
  },
  {
    "title": "Kristi Noem Once Called Federal Use of National Guard as 'Attack on States' Rights'. Now She Supports Trump's Use in LA Protests",
    "description": "Kristi Noem, once a vocal defender of states' rights against federal use of the National Guard, now supports Trump's deployment of troops in California.",
    "link": "https://www.ibtimes.com/kristi-noem-once-called-federal-use-national-guard-attack-states-rights-now-she-supports-3775290",
    "timestamp": "2025-06-09T17:08:11Z"
  },
  {
    "title": "Legal Analysts Weigh in on Trump's National Guard Deployment to California",
    "description": "Trump calling the National Guard into Los Angeles should \"give every American chills,\" a former federal prosecutor told Newsweek.",
    "link": "https://www.newsweek.com/donald-trump-national-guard-los-angeles-protests-legal-analysts-2082978",
    "timestamp": "2025-06-09T17:07:49Z"
  },
  {
    "title": "Whoopi Goldberg Calls the Trump-Musk Feud ‘Fake’ and ‘Strategic’: ‘This Is Another Distraction’ and ‘I’m Not Buying It Because They Lie’",
    "description": "Whoopi Goldberg is not buying into the recent feud between Donald Trump and Elon Musk, even going so far as to call it “fake” and “strategic” on a new episode of “The View.” The “Hot Topics” segment of Monday’s show mainly centered on the back-and-forth betwe…",
    "link": "https://variety.com/2025/tv/news/whoopi-goldberg-trump-musk-feud-fake-not-buying-it-1236423599/",
    "timestamp": "2025-06-09T17:07:48Z"
  },
  {
    "title": "LA protests inch Elon Musk back to President Trump | CNN Business",
    "description": "Last week, Elon Musk was calling for President Donald Trump’s impeachment. This week, Musk is back to praising the administration, softening his tone after the two powerful leaders’ very public breakup.",
    "link": "https://www.cnn.com/2025/06/09/media/elon-musk-donald-trump-la-protests",
    "timestamp": "2025-06-09T17:06:51Z"
  },
  {
    "title": "NIH scientists publish letter criticizing Trump’s deep cuts in public health research",
    "description": "The letter addresses the termination of 2,100 research grants valued at more than $12 billion and some of the human costs that have resulted, such as cutting off medication regimens to participants in clinical trials or leaving them with unmonitored device im…",
    "link": "https://www.pbs.org/newshour/nation/nih-scientists-publish-letter-criticizing-trumps-deep-cuts-in-public-health-research",
    "timestamp": "2025-06-09T17:01:36Z"
  },
  {
    "title": "Heather Cox Richardson: Trump Manufactures a Crisis to Distract from Real Problems",
    "description": "Heather Cox Richardson writes today that Trump eagerly overstepped his authority so as to create a crisis in Los Angeles. Local and state authorities responded appropriately to protests against the aggressive actions of ICE. But Trump insisted that there was …",
    "link": "https://dianeravitch.net/2025/06/09/heather-cox-richardson-trump-manufactures-a-crisis-to-distract-from-real-problems/",
    "timestamp": "2025-06-09T17:00:00Z"
  },
  {
    "title": "It’s Not Going Great, but Imagine How Much Worse Things Would Be with a Woman President",
    "description": "A lot has gone wrong under Donald Trump, but at least we narrowly avoided the catastrophe of a female president. Don’t get me wrong, I liked Kamala Harris. But it’s hard to imagine how any woman would have managed the unrelenting cascade of crises that have d…",
    "link": "https://www.mcsweeneys.net/articles/its-not-going-great-but-imagine-how-much-worse-things-would-be-with-a-woman-president",
    "timestamp": "2025-06-09T17:00:00Z"
  },
  {
    "title": "Trump Wildly Claims Los Angeles Would Have Been ‘Completely Obliterated’ If He Hadn’t Sent National Guard",
    "description": "President Donald Trump is touting his “great decision” to federalize and deploy the California National Guard to Los Angeles, claiming the city would have been “completely obliterated” if he hadn’t. Speaking out on his Truth Social platform Monday afternoon, …",
    "link": "https://www.mediaite.com/media/news/trump-wildly-claims-los-angeles-would-have-been-completely-obliterated-if-he-hadnt-sent-national-guard/",
    "timestamp": "2025-06-09T16:59:42Z"
  },
  {
    "title": "Rep. Mary Miller’s complaints about a Sikh guest chaplain reveal a startling ignorance",
    "description": "Sometimes, conservatives suggest their religion should get preferential treatment over other faith traditions. GOP Rep. Mary Miller made this point explicitly.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rep-mary-miller-sikh-chaplain-bias-rcna211861",
    "timestamp": "2025-06-09T16:59:41Z"
  },
  {
    "title": "Finneas describes being tear-gassed at Los Angeles ICE protest",
    "description": "Finneas has shared his experience being teargassed at a recent protest against ICE in Los Angeles.",
    "link": "https://www.thefader.com/2025/06/09/finneas-teargassed-ice-protest",
    "timestamp": "2025-06-09T16:59:07Z"
  },
  {
    "title": "White Men’s Employment Opportunities Decline In Slowing Economy",
    "description": "White men’s unemployment rate has risen faster and their employment rate has fallen more than was the case for their counterparts since January 2025.",
    "link": "https://www.forbes.com/sites/christianweller/2025/06/09/white-mens-employment-opportunities-decline-in-slowing-economy/",
    "timestamp": "2025-06-09T16:58:52Z"
  },
  {
    "title": "California Gov. Newsom plans to sue Trump over National Guard deployment to LA protests",
    "description": "California Gov. Gavin Newsom said Monday that he will sue President Donald Trump for his deployment of the National Guard to deal with protests over federal immigration enforcement actions in Los Angeles.\nTrump \"flamed the fires and illegally acted to federal…",
    "link": "https://biztoc.com/x/aab692b288bbe997",
    "timestamp": "2025-06-09T16:57:12Z"
  },
  {
    "title": "1,800+ 'No Kings' Rallies Planned Across US as Trump Deploys Military to Crush Protests",
    "description": "U.S. President Donald Trump on Saturday ordered the deployment of National Guard troops to quell anti-U.S. Immigration and Customs Enforcement protests in Los Angeles, prompting a response from the coalition behind upcoming nationwide protests planned to coun…",
    "link": "https://www.commondreams.org/news/no-kings-trump-national-guard-los-angeles",
    "timestamp": "2025-06-09T16:56:56Z"
  },
  {
    "title": "'Unacceptable and inhumane': Latinas for Trump founder blasts immigration arrests",
    "description": "Ileana Garcia, who co-founded Latinas for Trump, criticized Donald Trump’s recent immigration enforcement actions as “unacceptable and inhumane.\"",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/09/latinas-for-trump-immigration-arrests/84115411007/",
    "timestamp": "2025-06-09T16:56:43Z"
  },
  {
    "title": "Bannon Calls for a Special Counsel Investigation Into Elon Musk’s Drug Use and Federal Contracts",
    "description": "Bannon has long been a critic of Musk, even going so far as calling him a \"parasitic illegal immigrant” in the past. \nThe post Bannon Calls for a Special Counsel Investigation Into Elon Musk’s Drug Use and Federal Contracts first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/bannon-calls-for-a-special-counsel-investigation-into-elon-musks-drug-use-and-federal-contracts/",
    "timestamp": "2025-06-09T16:56:38Z"
  },
  {
    "title": "‘The View’s Sunny Hostin Warns Of “Fascism” And “Civil War” After Trump Deploys National Guard To Stop Immigration Protests: “It’s Not A Crime To Be Undocumented!”",
    "description": "\"It is a civil infraction, not a criminal.\"",
    "link": "https://decider.com/2025/06/09/the-view-sunny-hostin-warns-fascism-civil-war-trump-deploys-national-guard-stop-immigration-protests/",
    "timestamp": "2025-06-09T16:56:23Z"
  },
  {
    "title": "LA Could Face Losing Millions for Police Using Nonlethal Bullets",
    "description": "If people sue the City of Los Angeles over the LAPD's alleged use of rubber bullets, previous cases indicate it could lose millions.",
    "link": "https://www.newsweek.com/los-angeles-protests-riots-police-rubber-bullets-2082805",
    "timestamp": "2025-06-09T16:55:16Z"
  },
  {
    "title": "Los Angeles Anti-Deportation Protests Are Getting More Violent",
    "description": "Anti-deportation protests in Los Angeles are getting more violent as tensions escalate. President Donald Trump deployed ...",
    "link": "https://biztoc.com/x/392ea98c29a1ec7b",
    "timestamp": "2025-06-09T16:54:59Z"
  },
  {
    "title": "Elon Musk's father says his son and Donald Trump will patch things up after dramatic falling out",
    "description": "Elon Musk's father has said his son and Donald Trump's dramatic falling out was like \"a man and a wife arguing\", but they will patch things up soon.",
    "link": "https://news.sky.com/story/elon-musks-father-says-his-son-and-donald-trump-will-patch-things-up-after-dramatic-falling-out-13381348",
    "timestamp": "2025-06-09T16:53:00Z"
  },
  {
    "title": "The Trash Report: GIRLS (Trump and Elon), GIRLS (J. Lo and Cynthia), GIRLS (Oregonians)!!!",
    "description": "Get your bowls, it's time for a steaming ladle of hot, gossipy garbage.\n \n by Elinor Jones\n \n \n \n Hi babies, and welcome back to the Trash Report! This is the last week of school for families in the area, which means the days of \"I can't wait 'til summer\" wil…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/06/09/47830467/the-trash-report-girls-trump-and-elon-girls-j-lo-and-cynthia-girls-oregonians",
    "timestamp": "2025-06-09T16:53:00Z"
  },
  {
    "title": "Bitcoin, Solana Rise as U.S. and China Agree to Trade Talks Ahead of Key Bond Auction",
    "description": "A poorly received 20-year bond auction caused Bitcoin’s price to suddenly drop last month.",
    "link": "https://decrypt.co/324214/bitcoin-solana-rise-u-s-and-china-agree-talk-trade-ahead-key-bond-auction",
    "timestamp": "2025-06-09T16:51:33Z"
  },
  {
    "title": "California Gov. Newsom plans to sue Trump over National Guard deployment to LA protests",
    "description": "Trump is \"unhinged right now,\" Gov. Gavin Newsom said, accusing the president of making the situation in LA worse by federalizing National Guard troops.",
    "link": "https://www.cnbc.com/2025/06/09/trump-sued-national-guard-la-california-newsom.html",
    "timestamp": "2025-06-09T16:51:00Z"
  },
  {
    "title": "Cable Cut: CNN's Parent Company To Spin Off Struggling Network",
    "description": "CNN parent company Warner Bros. Discovery announced Monday that it will split into two publicly traded companies, cutting CNN off from the more profitable streaming business as the left-leaning network grapples with plummeting ratings.\nThe post Cable Cut: CNN…",
    "link": "https://freebeacon.com/latest-news/cable-cut-cnns-parent-company-to-spin-off-struggling-network/",
    "timestamp": "2025-06-09T16:50:39Z"
  },
  {
    "title": "US State Department orders embassies to resume processing Harvard student visas | CNN Politics",
    "description": "The US State Department ordered diplomatic posts around the world to “resume processing” of Harvard University student and exchange visitor visas on Friday after a judge halted President Donald Trump’s latest attempt to block international students from comin…",
    "link": "https://www.cnn.com/2025/06/09/politics/harvard-student-visas-resume-processing",
    "timestamp": "2025-06-09T16:50:23Z"
  },
  {
    "title": "FINNEAS Tear-Gassed at ICE Protest in Los Angeles",
    "description": "FINNEAS has become one of the most in-demand pop producers of our time, having produced all of his sister Billie Eilish's hits among others",
    "link": "https://exclaim.ca/music/article/finneas-tear-gassed-at-ice-protest-in-los-angeles",
    "timestamp": "2025-06-09T16:49:31Z"
  }
]