[
  {
    "title": "“Bharat Will Not Be Deterred By Nuclear Blackmail,” PM Modi",
    "description": "In a short address to the Nation, Modi said Operation Sindoor marks a “new normal” in India’s fight against terrorism which will breach boundaries and strike at the root of state-sponsored terrorism in Pakistan",
    "link": "https://www.thehindubusinessline.com/news/national/bharat-will-not-be-deterred-by-nuclear-blackmail-modi/article69568493.ece",
    "timestamp": "2025-05-12T15:58:59Z"
  },
  {
    "title": "With Israel ties on the table, UAE offers Saudis an example",
    "description": "President Trump's Gulf tour in May 2025 focuses on persuading Saudi Arabia to recognize Israel, following the UAE's Abraham Accords experience. While the UAE gained economically and strategically from normalizing ties, its regional standing suffered due to th…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/with-israel-ties-on-the-table-uae-offers-saudis-an-example/articleshow/121116642.cms",
    "timestamp": "2025-05-12T15:58:14Z"
  },
  {
    "title": "As Trump embarks on Middle East trip, Israel and Gaza cast a shadow on his real goals",
    "description": "On the way to Saudi Arabia, Qatar and the UAE, U.S. President Donald Trump may be securing deals with the Houthis and Hamas by circumventing Israel, but the Netanyahu government could still stand in the way of his bigger plans",
    "link": "https://www.haaretz.com/us-news/2025-05-12/ty-article/.premium/as-trump-embarks-on-middle-east-trip-israel-and-gaza-cast-a-shadow-on-his-real-goals/00000196-c422-dbce-a7ff-dc3a09da0000",
    "timestamp": "2025-05-12T15:58:07Z"
  },
  {
    "title": "Bretton Woods twins and US control",
    "description": "The US will not withdraw from the IMF and World Bank. Trump only wants them to be reformed in ways favourable to the US",
    "link": "https://www.thehindubusinessline.com/opinion/bretton-woods-twins-and-us-control/article69568538.ece",
    "timestamp": "2025-05-12T15:57:30Z"
  },
  {
    "title": "Trump signs executive order setting 30-day deadline for drugmakers to lower prescription drug costs",
    "description": "President Donald Trump has signed a sweeping executive order setting a 30-day deadline for drugmakers to lower the cost of prescription drugs in the U.S. or face new limits over what the government will pay",
    "link": "https://www.wftv.com/news/trump-sign-executive/SJZD27CFEJCNXDBTK7NB4FS5BI/",
    "timestamp": "2025-05-12T15:57:01Z"
  },
  {
    "title": "Trump's Saudi talks, Houthi ceasefire strain ties with Netanyahu ahead of Middle East trip",
    "description": "President Donald Trump heads to the Middle East for peace deals and business negotiations, even as tensions allegedly rise with Israeli Prime Minister Benjamin Netanyahu.",
    "link": "https://www.foxnews.com/politics/trumps-saudi-talks-houthi-ceasefire-strain-ties-netanyahu-ahead-middle-east-trip",
    "timestamp": "2025-05-12T15:56:28Z"
  },
  {
    "title": "You’ll Pay for the Upgrades to Trump’s Luxury 747 From Qatar",
    "description": "For a billionaire, Donald Trump flies a crappy private jet. That’s the real reason he wants Qatar’s 747, not to upgrade Air Force One.",
    "link": "http://nymag.com/intelligencer/article/trump-boeing-747-8-qatar-air-force-one.html",
    "timestamp": "2025-05-12T15:56:15Z"
  },
  {
    "title": "US copyright verdict offers a glimmer of hope for artists vs AI",
    "description": "Will the conclusions make any difference?",
    "link": "https://www.creativebloq.com/ai/ai-art/us-copyright-verdict-offers-a-glimmer-of-hope-for-artists-vs-ai",
    "timestamp": "2025-05-12T15:54:08Z"
  },
  {
    "title": "Good Morning, News: ODOT Budget Gets Blasted, Measles Vaccinations Declining, and Trump Caves to China",
    "description": "by Wm. Steven Humphrey\n \n \n \n If you’re reading this, you probably know the value of the Mercury’s news reporting, arts and culture coverage, event calendar, and the bevy of events we host throughout the year. The work we do helps our city shine, but we can’t…",
    "link": "https://www.portlandmercury.com/good-morning-news/2025/05/12/47780786/good-morning-news-odot-budget-gets-blasted-measles-vaccinations-declining-and-trump-caves-to-china",
    "timestamp": "2025-05-12T15:54:00Z"
  },
  {
    "title": "US, China agree to lower tariffs for 90 days",
    "description": "US tariffs will fall to 30% from 145%, while China will cut its tax on US imports to 10% from 125%",
    "link": "https://theweek.com/world-news/united-states-china-trade-war-lower-tariffs",
    "timestamp": "2025-05-12T15:54:00Z"
  },
  {
    "title": "President Trump called Apple’s CEO with Good News after the Tariff drop against China was announced",
    "description": "President Donald Trump said Monday that he talked to Apple\r\n CEO Tim Cook",
    "link": "https://www.patentlyapple.com/2025/05/president-trump-called-apples-ceo-with-good-news-after-the-tariff-drop-against-china-was-announced.html",
    "timestamp": "2025-05-12T15:53:14Z"
  },
  {
    "title": "U.S. and China Announce Big Tariff Rollback",
    "description": "In a joint statement, the two sides took a step back from the cliff.",
    "link": "http://foreignpolicy.com/2025/05/12/us-china-tariff-trade-agreement-geneva-meeting/",
    "timestamp": "2025-05-12T15:52:55Z"
  },
  {
    "title": "Lil Wayne accused of abuse and dumping girlfriend via text on Mother’s Day",
    "description": "The couple have been together on-and-off since 2020",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/lil-wayne-girlfriend-denise-bidot-b2749339.html",
    "timestamp": "2025-05-12T15:52:41Z"
  },
  {
    "title": "NBCU Shoots and Scores With Sports-Heavy Upfront Presentation",
    "description": "NBCU emphasized its franchised-focused, multi-platform approach to reaching audiences in upfront.",
    "link": "https://www.adweek.com/convergent-tv/nbcuniversal-upfront-nba-versant-ad-sales/",
    "timestamp": "2025-05-12T15:51:08Z"
  },
  {
    "title": "Todd Blanche, DOJ No. 2, is now acting Library of Congress chief (Josh Gerstein/Politico)",
    "description": "Josh Gerstein / Politico:\nTodd Blanche, DOJ No. 2, is now acting Library of Congress chief  —  The Justice Department's No. 2 official now has a second job: running the Library of Congress.  President Donald Trump has appointed Deputy Attorney General Todd Bl…",
    "link": "https://www.memeorandum.com/250512/p60",
    "timestamp": "2025-05-12T15:50:00Z"
  },
  {
    "title": "Hamas Releases American Hostage Edan Alexander — Family Says 'Greatest Gift Imaginable'",
    "description": "Alexander’s release comes as Trump pushed for the release of all remaining hostages.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/05/12/hamas-releases-american-hostage-edan-alexander---family-says-greatest-gift-imaginable/",
    "timestamp": "2025-05-12T15:49:10Z"
  },
  {
    "title": "Dressed as bleeding effigies of Bibi, Trump, 10,000 pro-Palestine protesters rally in Madrid",
    "description": "This came just two days before the European Jewish Association Annual Conference, which began in Madrid on Monday.",
    "link": "https://www.jpost.com/international/article-853709",
    "timestamp": "2025-05-12T15:48:32Z"
  },
  {
    "title": "Trump visiting Gulf Arab states while crises flare in Gaza and Iran",
    "description": "Trump will visit three energy-rich monarchies home to existing or planned Trump-branded real estate projects.",
    "link": "https://www.bostonherald.com/2025/05/12/trump-mideast-trip/",
    "timestamp": "2025-05-12T15:47:57Z"
  },
  {
    "title": "India, Pakistan DGMOs agree to no cross border firing, troop reduction at LoC",
    "description": "India and Pakistan held high-level military talks on 12 May, reaffirming their commitment not to fire a single shot or initiate hostile actions across the border. The DGMOs also discussed reducing troop presence in forward areas. The dialogue followed a weeke…",
    "link": "https://economictimes.indiatimes.com/news/defence/india-pakistan-dgmos-agree-to-no-cross-border-firing-troop-reduction-at-loc/articleshow/121116207.cms",
    "timestamp": "2025-05-12T15:47:33Z"
  },
  {
    "title": "'You should be embarrassed': Trump shames reporter for asking about $400M Qatar plane",
    "description": "As President Donald Trump signed an executive order to lower drug prices, an ABC reporter questioned the gift of a $400 million plane from Qatar which he is set to receive.“What do you say to people who view that luxury jet as a personal gift to you?” The rep…",
    "link": "https://www.rawstory.com/trump-media-2671937056/",
    "timestamp": "2025-05-12T15:47:05Z"
  },
  {
    "title": "‘Buy America’ sweeps across global markets after trade talks",
    "description": "Wall Street surged Monday with the S&P 500 and Nasdaq 100 rebounding strongly, as a US-China tariff truce soothed recession fears and reignited optimism in tech stocks and broader market sentiment.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-america-sweeps-across-global-markets-after-trade-talks/articleshow/121116419.cms",
    "timestamp": "2025-05-12T15:45:58Z"
  },
  {
    "title": "ScotRail trials wi-fi using satellite technology",
    "description": "The technology being trailed in the north of Scotland is powered by billionaire Elon Musk's company Starlink.",
    "link": "https://www.bbc.com/news/articles/czr8746x8ymo",
    "timestamp": "2025-05-12T15:45:44Z"
  },
  {
    "title": "Republicans Want To Redefine Obscenity",
    "description": "A new bill would ban sharing visual content that might \"arouse\" or \"titillate.\"",
    "link": "https://reason.com/2025/05/12/republicans-want-to-redefine-obscenity/",
    "timestamp": "2025-05-12T15:45:27Z"
  },
  {
    "title": "Iran Celebrates Fourth 'Constructive' Talk with U.S.: Claims Nuclear Enrichment a 'Fundamental Right'",
    "description": "Iranian state media celebrated the conclusion of a fourth round of \"indirect\" talks with President Donald Trump's special envoy, Steve Witkoff, on Monday, citing Iranian officials who called the discussions \"more serious and candid\" without giving specific po…",
    "link": "https://www.breitbart.com/middle-east/2025/05/12/iran-celebrates-fourth-constructive-talk-with-u-s-claims-nuclear-enrichment-a-fundamental-right/",
    "timestamp": "2025-05-12T15:44:59Z"
  },
  {
    "title": "Trump Loses It After ABC’s Rachel Scott Confronts Him on ‘Free’ $400M Jet from Qatar: ‘You Should Be Embarrassed Asking That!’",
    "description": "President Trump lashed out at ABC's Rachel Scott for confronting him about the $400M luxury jet the Defense Department is accepting from Qatar's royal family.\nThe post Trump Loses It After ABC’s Rachel Scott Confronts Him on ‘Free’ $400M Jet from Qatar: ‘You …",
    "link": "https://www.mediaite.com/news/trump-loses-it-after-abcs-rachel-scott-confronts-him-on-free-400m-jet-from-qatar-you-should-be-embarrassed-asking-that/",
    "timestamp": "2025-05-12T15:44:50Z"
  },
  {
    "title": "Republicans unveil Medicaid cuts; Democrats warn millions will be without health care",
    "description": "Central to the savings are changes to Medicaid, which provides almost free health care to more than 70 million Americans, and the Affordable Care Act, which...",
    "link": "https://www.dallasnews.com/news/politics/2025/05/12/republicans-unveil-medicaid-cuts-democrats-warn-millions-will-be-without-health-care/",
    "timestamp": "2025-05-12T15:44:44Z"
  },
  {
    "title": "Kai Trump's viral TikTok draws major backlash: ‘She's just a teen’ or 'crossing the line?'",
    "description": "Kai Trump, granddaughter of Donald Trump, celebrated her 18th birthday with friends in New York City, sharing a viral TikTok video lip-syncing to Nelly Furtado's 'Promiscuous.' The video sparked mixed reactions, with some praising her confidence and others cr…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/kai-trumps-viral-tiktok-draws-major-backlash-shes-just-a-teen-or-crossing-the-line/articleshow/121116430.cms",
    "timestamp": "2025-05-12T15:44:31Z"
  },
  {
    "title": "Eli Lilly stock sinks as pharma misses out on the market rally",
    "description": "In This Article:\nPharma companies were mostly left out of the stock market’s broader rally Monday morning on the news that President Donald Trump would sign an order lowering some drug prices.\nA surprise trade agreement between the U.S. and China on Monday mo…",
    "link": "https://biztoc.com/x/4a9f9b3af44458e0",
    "timestamp": "2025-05-12T15:43:18Z"
  },
  {
    "title": "Trump Says He Could Join Putin and Zelensky for Peace Talks Thursday",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump, set to leave for the Middle East today, told reporters he may travel to Istanbul for peace talks between Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin on T…",
    "link": "https://biztoc.com/x/7240e4a45a47a2e6",
    "timestamp": "2025-05-12T15:43:16Z"
  },
  {
    "title": "How Rich Arab States Became Trump's Best Friends",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs President Donald Trump embarks on his first overseas trip since returning to office, Gulf nations are intensifying their diplomatic engagements, coupling high-level meetings with substantial investment comm…",
    "link": "https://biztoc.com/x/96e5b9fe140bd3da",
    "timestamp": "2025-05-12T15:43:15Z"
  },
  {
    "title": "Qatar luxury jet gift clouds Trump trip to Mideast",
    "description": "What happened\nPresident Donald Trump is leaving Monday for a four-day trip to Saudi Arabia, Qatar and the United Arab Emirates, his first major overseas trip since taking office. Trump Sunday confirmed reports he expects Qatar to donate a 747-8 luxury jetline…",
    "link": "https://biztoc.com/x/bcbb4df0a8dafa7a",
    "timestamp": "2025-05-12T15:43:01Z"
  },
  {
    "title": "WATCH: Asked about Qatar’s gift of luxury 747, Trump says ‘We give free things out, we’ll take one, too’",
    "description": "President Donald Trump on Monday defended Qatar’s gift of a plane as a “gesture of good faith.”",
    "link": "https://biztoc.com/x/60c52b66530f62d8",
    "timestamp": "2025-05-12T15:42:49Z"
  },
  {
    "title": "Iran Lawmaker Urges Nuclear Breakout if US Talks Fail",
    "description": "Nadergholi Ebrahimi has asked Supreme Leader Khamenei to rethink Iran's nuclear policy if negotiations with the U.S. collapse.",
    "link": "https://www.newsweek.com/iran-lawmaker-nuclear-weapon-breakout-us-talks-2070977",
    "timestamp": "2025-05-12T15:42:17Z"
  },
  {
    "title": "Qatar luxury jet gift clouds Trump trip to Mideast",
    "description": "Qatar is said to be presenting Trump with a $400 million plane, which would be among the biggest foreign gifts ever received by the US government",
    "link": "https://theweek.com/politics/trump-quatar-luxury-jet-gift-mideast-trip",
    "timestamp": "2025-05-12T15:40:41Z"
  },
  {
    "title": "Le Pen Blasts Macron for 'Fomenting War' in Ukraine Rather Than Pursuing Peace",
    "description": "Emmanuel Macron and his globalist allies are essentially cosplaying as warriors and risk \"fomenting war\" rather than achieving peace in Ukraine, French opposition leader Marine Le Pen warned over the weekend.\nThe post Le Pen Blasts Macron for ‘Fomenting War’ …",
    "link": "https://www.breitbart.com/europe/2025/05/12/le-pen-blasts-macron-for-fomenting-war-in-ukraine-rather-than-pursuing-peace/",
    "timestamp": "2025-05-12T15:40:11Z"
  },
  {
    "title": "Lil Wayne's GF Says She Got Dumped on Mother's Day",
    "description": "Lil Wayne's longtime girlfriend Denise Bidot is claiming the Young Money rapper kicked her and her daughter out of his house they had been living in ... on Mother's Day!!! Denise took to IG to reveal Wayne broke the bad news -- and didn't have the…",
    "link": "https://www.tmz.com/2025/05/12/lil-wayne-girlfriend-denise-bidot-breakup-kicked-out-house-mothers-day-abuse/",
    "timestamp": "2025-05-12T15:39:45Z"
  },
  {
    "title": "How Rich Arab States Became Trump's Best Friends",
    "description": "Engagement with Trump comes as Gulf states also pursue a more diversified foreign policy",
    "link": "https://www.newsweek.com/how-rich-arab-states-became-trumps-best-friends-2070795",
    "timestamp": "2025-05-12T15:37:57Z"
  },
  {
    "title": "‘You Can’t Expect to Win 100 to 0’: Will Cain On Why He Loves Debating Democrats on Hit Fox News Show",
    "description": "Will Cain joined Mediaite Founding Editor Colby Hall to dive deep into his new Fox News show, explaining why he loves having Democrats on to debate.\nThe post ‘You Can’t Expect to Win 100 to 0’: Will Cain On Why He Loves Debating Democrats on Hit Fox News Show…",
    "link": "https://www.mediaite.com/tv/you-cant-expect-to-win-100-to-0-will-cain-on-why-he-loves-debating-democrats-on-hit-fox-news-show/",
    "timestamp": "2025-05-12T15:37:14Z"
  },
  {
    "title": "Trump Says He Could Join Putin and Zelensky for Peace Talks Thursday",
    "description": "The president said he's optimistic about Thursday's expected talks between Vladimir Putin and Volodymyr Zelensky in Istanbul.",
    "link": "https://www.newsweek.com/trump-putin-zelensky-peace-talks-istanbul-turkey-2071045",
    "timestamp": "2025-05-12T15:37:03Z"
  },
  {
    "title": "DNC vice chair slams Trump as 'punk,' 'would-be dictator' in fiery Pa. town hall",
    "description": "President Donald Trump and Rep. Brian Fitzpatrick were the targets of speakers at a town hall in Levittown, Pennsylvania.",
    "link": "https://www.foxnews.com/politics/dnc-vice-chair-slams-trump-punk-would-be-dictator-fiery-pa-town-hall",
    "timestamp": "2025-05-12T15:36:48Z"
  },
  {
    "title": "Investors cheer US-China tariff truce, but cautious over a final deal",
    "description": "The U.S. and China have agreed to a temporary tariff reduction, boosting global stocks and the dollar. This 90-day pause offers relief but caution remains as a permanent trade deal is still needed. Investors are now shifting focus to potential U.S. tax cuts a…",
    "link": "https://economictimes.indiatimes.com/news/international/business/investors-cheer-us-china-tariff-truce-but-cautious-over-a-final-deal/articleshow/121116354.cms",
    "timestamp": "2025-05-12T15:35:32Z"
  },
  {
    "title": "Donald Trump may increase Americans' take-home pay by up to $5,000, but investors are worried; here's why",
    "description": "Trump tax cuts plan is back in the spotlight as Donald Trump pushes a $6 trillion package he calls a “big, beautiful bill.” With promises to boost workers' income and eliminate taxes on tips, the plan may also raise national debt, shake up markets, and test i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-may-increase-americans-take-home-pay-by-up-to-5000-but-investors-are-worried-heres-why/articleshow/121115976.cms",
    "timestamp": "2025-05-12T15:35:26Z"
  },
  {
    "title": "Dow soars 1,000 points after Trump team and China dramatically lower tariffs (David Goldman/CNN)",
    "description": "David Goldman / CNN:\nDow soars 1,000 points after Trump team and China dramatically lower tariffs  —  New York CNN —  US stocks surged on Monday after President Donald Trump's top trade officials brokered a surprisingly dramatic de-escalation in trade tension…",
    "link": "https://www.memeorandum.com/250512/p55",
    "timestamp": "2025-05-12T15:35:02Z"
  },
  {
    "title": "Cannes Chief Thierry Frémaux Addresses Trump’s Tariffs: “Cinema Always Finds A Way Of Existing & Reinventing Itself”",
    "description": "When it comes to this year’s hot potato topic of Donald Trump’s tariffs on movie imports, Cannes Film Festival director Thierry Fremaux would like to table the discussion. For at least a year. Of Trump’s declarations over the last three months, Fremaux says: …",
    "link": "http://deadline.com/2025/05/cannes-film-festival-2025-thierry-fremaux-1236393569/",
    "timestamp": "2025-05-12T15:33:54Z"
  },
  {
    "title": "'No Firing Or Aggressive Action': India, Pak In First Talks After Ceasefire",
    "description": "India and Pakistan have agreed that both sides will not engage in any aggressive action and no shots will be fired, said the Army after the military operations chiefs of the two countries spoke on a hotline for the first time since the ceasefire.",
    "link": "https://www.ndtv.com/india-news/no-firing-or-aggressive-action-india-pak-in-first-talks-after-ceasefire-8396845",
    "timestamp": "2025-05-12T15:33:28Z"
  },
  {
    "title": "Trump Says He'll Set 30-day Deadline For Drugmakers To Lower The Cost Of Prescription Drugs",
    "description": "President Donald Trump on Monday signed a sweeping executive order setting a 30-day deadline for drugmakers to lower the cost of prescription drugs in the U.S. or face new limits over what the government will pay.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-prescription-drugs-executive-order_n_6822131ae4b09ed5324fefca",
    "timestamp": "2025-05-12T15:33:03Z"
  },
  {
    "title": "Homeland Security subpoenas California for possible cash benefits to illegals",
    "description": "President Donald Trump's administration is investigating California's use of federal funds, particularly whether the Newsom administration has provided federal benefits to illegal immigrants.",
    "link": "https://www.foxnews.com/politics/homeland-security-subpoenas-california-possible-cash-benefits-illegals",
    "timestamp": "2025-05-12T15:32:51Z"
  },
  {
    "title": "WATCH: Asked about Qatar’s gift of luxury 747, Trump says ‘We give free things out, we’ll take one, too’",
    "description": "President Donald Trump on Monday defended Qatar’s gift of a plane as a “gesture of good faith.”",
    "link": "https://www.pbs.org/newshour/politics/watch-asked-about-qatars-gift-of-luxury-747-trump-says-we-give-free-things-out-well-take-one-too",
    "timestamp": "2025-05-12T15:32:51Z"
  },
  {
    "title": "Lil Wayne Accused by Ex-Girlfriend of Abuse, Kicking Her Out",
    "description": "Drama on Mother's Day. Continue reading…",
    "link": "https://www.xxlmag.com/lil-wayne-accused-abuse-ex-girlfriend-kicking-her-out/",
    "timestamp": "2025-05-12T15:32:39Z"
  },
  {
    "title": "Donald Trump Faces Criticism After Taking in White South African Refugees",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nMultiple people, including human rights lawyers, immigration academics, civil rights activists and a Democratic senator, have criticized President Donald Trump for giving white Afrikaans from South Africa refu…",
    "link": "https://biztoc.com/x/a98c5b2ebda0e51c",
    "timestamp": "2025-05-12T15:32:15Z"
  },
  {
    "title": "Deputy attorney general who defended Trump in hush money trial named acting Librarian of Congress",
    "description": "Blanche replaces longtime librarian Carla Hayden.",
    "link": "https://www.bostonherald.com/2025/05/12/librarian-of-congress/",
    "timestamp": "2025-05-12T15:32:10Z"
  },
  {
    "title": "Trump Says Qatar Is Giving Him $400 Million Jet Out of Goodness of Their Heart",
    "description": "The president doesn't seem to understand why everyone is about the administration preparing to accept a lavish gift from the Middle Eastern nation",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-qatar-gift-luxury-jet-gesture-bashes-dems-1235336900/",
    "timestamp": "2025-05-12T15:32:03Z"
  },
  {
    "title": "Trump says he talked to Apple CEO Tim Cook after China tariff rollback",
    "description": "President Donald Trump said Monday that he talked to Apple CEO Tim Cook after the U.S. and China agreed to suspend most tariffs for 90 days.\nWall Street and Apple investors cheered the pause on Chinese tariffs. Apple stock was up 6% in trading on Monday, vers…",
    "link": "https://biztoc.com/x/f7124ff648dc4f9d",
    "timestamp": "2025-05-12T15:31:59Z"
  },
  {
    "title": "Trump says executive order will slash the cost of prescription drugs",
    "description": "President Donald Trump announced action targeting prescription drug costs.\nAnna Moneymaker/Getty Images\nPresident Donald Trump is set to sign an executive order targeting the cost of prescription drugs.\nPrices will be cut by as much as 80%, and some immediate…",
    "link": "https://biztoc.com/x/88dd3788240c437c",
    "timestamp": "2025-05-12T15:31:54Z"
  },
  {
    "title": "Todd Blanche, DOJ No. 2, is now acting Library of Congress chief",
    "description": "The Justice Department’s No. 2 official now has a second job: running the Library of Congress. President Donald Trump has appointed Deputy Attorney General Todd Blanche as the acting librarian, a DOJ official said Monday. \nThe added duties for Blanche come af…",
    "link": "https://biztoc.com/x/b5f5ada014d0cacd",
    "timestamp": "2025-05-12T15:31:46Z"
  },
  {
    "title": "Trump says he may speak to Xi this week after tariffs truce",
    "description": "US President Donald Trump said he would likely speak to Chinese leader Xi Jinping later this week following talks between Washington and Beijing to temporarily lower tariffs and de-escalate the trade war between the world’s two largest economies.\n“I’ll speak …",
    "link": "https://biztoc.com/x/f0efdbe199d332f3",
    "timestamp": "2025-05-12T15:31:32Z"
  },
  {
    "title": "Mexico says US suspension of beef imports because of screwworm is unfair",
    "description": "MEXICO CITY (AP) — Mexican President Claudia Sheinbaum on Monday described as “unfair” the decision by the Trump administration to suspend imports of Mexican beef cattle for 15 days due to the detection of screwworm in shipments. Sheinbaum, who has spent the …",
    "link": "https://financialpost.com/pmn/mexico-says-us-suspension-of-beef-imports-because-of-screwworm-is-unfair",
    "timestamp": "2025-05-12T15:30:45Z"
  },
  {
    "title": "Donald Trump Faces Criticism After Taking in White South African Refugees",
    "description": "The first plane bringing white South Africans to the U.S. as refugees is set to arrive this week.",
    "link": "https://www.newsweek.com/donald-trump-white-refugeees-south-africa-2070997",
    "timestamp": "2025-05-12T15:30:01Z"
  },
  {
    "title": "‘Stop the clownery’ – top Russian MP to Zelensky (VIDEO)",
    "description": "Leonid Slutsky has urged the Ukrainian leadership to rescind a 2022 order banning direct negotiations with Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617426-slutsky-ukraine-negotitaions/",
    "timestamp": "2025-05-12T15:29:32Z"
  },
  {
    "title": "Will Trump again increase tariffs on Chinese goods if US-China fail to make a deal? Check details",
    "description": "After US and China agreed to a deal that will significantly cut the import tariffs, US President Donald Trump expressed confidence and said he doesn't see US tariffs on China imports rising back to 145 percent. He asserted that US and China will reach a deal.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-will-trump-again-increase-tariffs-on-chinese-goods-if-us-china-fail-to-make-a-deal-check-details/articleshow/121116131.cms",
    "timestamp": "2025-05-12T15:29:11Z"
  },
  {
    "title": "Mattel names CFO amid tariff pressure",
    "description": "The leadership change comes as the California-based toymaker lands squarely in the crosshairs of President Donald Trump’s tariff push.",
    "link": "https://www.cfodive.com/news/mattel-taps-kenvues-ruh-cfo-amid-tariff-pressure/747669/",
    "timestamp": "2025-05-12T15:29:00Z"
  },
  {
    "title": "GOP Will Extend Student Loan Forgiveness Tax Relief, But Only Narrowly",
    "description": "Republican House lawmakers unveiled legislation that would narrowly extend student loan forgiveness tax relief for certain borrowers, but not others.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/05/12/gop-will-extend-student-loan-forgiveness-tax-relief-but-only-narrowly/",
    "timestamp": "2025-05-12T15:28:58Z"
  },
  {
    "title": "Watch: Palestinian state? Iran nuclear deal? What will Trump's Middle East visit mean?",
    "description": "On episode five of The Jerusalem Dispatch, Elliot Jager and Calev Ben David discuss the upcoming Middle East conference, the Pulitzer Prize Committee, Pope Leo XIII’s namesake, and more.",
    "link": "https://www.jpost.com/podcast/article-853707",
    "timestamp": "2025-05-12T15:28:15Z"
  },
  {
    "title": "What It Feels Like to Starve",
    "description": "Mohammed R. Mhawish\n\n\n\nWhat we are witnessing now in Gaza is not a famine of nature. It is famine as a weapon of mass destruction.\r\n\n\r\n\n\nThe post What It Feels Like to Starve appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/world-watching-gaza-starve/",
    "timestamp": "2025-05-12T15:27:44Z"
  },
  {
    "title": "American hostage Edan Alexander released by Hamas after more than 580 days in captivity",
    "description": "Edan Alexander, a 21-year-old dual U.S.-Israeli citizen, was released by Hamas on Monday after he spent more than 580 days held captive in Gaza.",
    "link": "https://www.foxnews.com/world/american-hostage-edan-alexander-released-hamas-after-more-than-580-days-captivity",
    "timestamp": "2025-05-12T15:27:24Z"
  },
  {
    "title": "Trump Blames ‘Show Business’ for Hurting Reputations of Dr. Oz and Jeanine Pirro",
    "description": "President Donald Trump may hire only the \"best people\" — but perhaps not the most reputable — and he says TV is to blame.\nThe post Trump Blames ‘Show Business’ for Hurting Reputations of Dr. Oz and Jeanine Pirro first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/trump-blames-show-business-for-hurting-reputations-of-dr-oz-and-jeanine-pirro/",
    "timestamp": "2025-05-12T15:26:03Z"
  },
  {
    "title": "Why did Trump fire the head of the U.S. Copyright Office?",
    "description": "The day after firing the Librarian of Congress, Donald Trump also fired the nation’s top copyright official. It's worth considering why.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-fire-head-us-copyright-office-rcna206263",
    "timestamp": "2025-05-12T15:25:10Z"
  },
  {
    "title": "'Monty Python' Star Sparks MAGA Anger With Stephen Miller Tweet",
    "description": "John Cleese's post in response to Miller's remarks about habeas corpus did not go down well with some online.",
    "link": "https://www.newsweek.com/john-cleese-stephen-miller-habeas-corpus-2070994",
    "timestamp": "2025-05-12T15:24:53Z"
  },
  {
    "title": "Trump says executive order will slash the cost of prescription drugs",
    "description": "President Donald Trump said at a White House press conference that the US would \"no longer tolerate profiteering and price gouging from Big Pharma.\"",
    "link": "https://www.businessinsider.com/trump-prescription-drugs-prices-big-pharma-executive-order-medicines-cost-2025-5",
    "timestamp": "2025-05-12T15:24:42Z"
  },
  {
    "title": "Only 'stupid person' would turn down 'free plane' from Qatar: Trump",
    "description": "President Donald Trump responded to critics who say he should not accept a \"free\" Boeing 747-8 jumbo jet from Qatar to serve as the new Air Force One.During a White House press conference on drug prices, the president was asked if Qatar wanted anything in exc…",
    "link": "https://www.rawstory.com/trump-stupid-person-airplane/",
    "timestamp": "2025-05-12T15:24:15Z"
  },
  {
    "title": "Transgender issues are a strength for Trump, new poll finds",
    "description": "About half of U.S. adults approve of how President Donald Trump is handling transgender issues, according to a new poll — a relative high point for a president who has the approval overall of about 4 in 10 Americans.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/transgender-issues-are-strength-trump-new-poll-finds-rcna206265",
    "timestamp": "2025-05-12T15:23:35Z"
  },
  {
    "title": "US, China agree to reduce tariff rates for 90 days",
    "description": "By Wednesday, the two countries will charge 10% baseline duties and remove certain retaliatory levies that pushed rates over 100%.",
    "link": "https://www.supplychaindive.com/news/us-china-trade-agreement-tariff-pause/747721/",
    "timestamp": "2025-05-12T15:22:00Z"
  },
  {
    "title": "Germany Says Russia Has Hours to Abide by Truce or Face Sanctions",
    "description": "Berlin issued an ultimatum to Moscow to follow a 30-day ceasefire by the end of Monday.",
    "link": "https://www.newsweek.com/germany-russia-ukraine-ceasefire-sanctions-2070993",
    "timestamp": "2025-05-12T15:21:50Z"
  },
  {
    "title": "China Called Trump’s Bluff",
    "description": "There is a lesson here for anyone Trump threatens.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/china-tariffs-trump/682776/",
    "timestamp": "2025-05-12T15:21:00Z"
  },
  {
    "title": "China Called Trump’s Bluff",
    "description": "There is a lesson here for anyone Trump threatens.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/china-tariffs-trump/682776/?utm_source=yahoo",
    "timestamp": "2025-05-12T15:21:00Z"
  },
  {
    "title": "Donald Trump Explains Why He Granted White South Africans Refugee Status",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump was asked on Monday about granting an expedited path to refugee status for white South Africans while not allowing refugees from countries such as Sudan and the Democratic Republic of Co…",
    "link": "https://biztoc.com/x/58253eca75102f05",
    "timestamp": "2025-05-12T15:20:49Z"
  },
  {
    "title": "US, China agree to slash tariffs, continue discussion on trade",
    "description": "US and China agree to reduce tariffs, impacting India's trade strategy and pushing for US-India bilateral trade agreement.",
    "link": "https://www.thehindubusinessline.com/economy/us-china-agree-to-slash-tariffs-continue-discussion-on-trade/article69568379.ece",
    "timestamp": "2025-05-12T15:20:01Z"
  },
  {
    "title": "Trump to Take Action on Medicare if Pharmaceutical Companies Don’t Comply with Order Slashing Drug Prices",
    "description": "President Donald Trump will take action on Medicare if pharmaceutical companies don’t lower prices across markets in response to his Monday executive order to slash... Read More\nThe post Trump to Take Action on Medicare if Pharmaceutical Companies Don’t Compl…",
    "link": "https://www.dailysignal.com/2025/05/12/trump-to-take-action-on-medicare-if-pharmaceutical-companies-dont-comply-with-order-slashing-drug-prices/",
    "timestamp": "2025-05-12T15:19:15Z"
  },
  {
    "title": "MAGA Activist Begs Trump Not to Accept Luxury Plane From Qatar: 'I Have to Call a Spade a Spade'",
    "description": "Laura Loomer expressed disappointment over President Donald Trump's potential acceptance of a $425 million jet from Qatar, despite her strong support for him.",
    "link": "https://www.ibtimes.com/maga-activist-begs-trump-not-accept-luxury-plane-qatar-i-have-call-spade-spade-3773261",
    "timestamp": "2025-05-12T15:19:08Z"
  },
  {
    "title": "Scott Bessent: Chinese Officials Told Us How They Took Advantage of Biden as Soon as He Entered White House",
    "description": "Scott Bessent: Chinese Officials Told Us How They Took Advantage of Biden as Soon as He Entered White Housewesternjournal.com",
    "link": "https://www.westernjournal.com/scott-bessent-chinese-officials-told-us-took-advantage-biden-soon-entered-white-house/",
    "timestamp": "2025-05-12T15:19:00Z"
  },
  {
    "title": "Trump’s Drug Prices Executive Order Is a Big Pile of Nothing",
    "description": "Donald Trump is resurrecting one of his controversial first-term policies to supposedly hack prescription drug prices—but the whole effort is such a nothingburger that he very nearly forgot to sign the executive order enacting it.\r\n“Starting today the United …",
    "link": "https://newrepublic.com/post/195126/donald-trump-drug-prices-executive-order-nothing",
    "timestamp": "2025-05-12T15:18:55Z"
  },
  {
    "title": "Kai Trump posts her ‘last’ TikTok as a 17-year-old ahead of milestone birthday",
    "description": "The granddaughter of President Trump was seen all dressed up with a group of gal pals ahead of her 18th birthday on Monday.",
    "link": "https://pagesix.com/2025/05/12/celebrity-news/kai-trump-posts-her-last-tiktok-as-a-17-year-old-ahead-of-milestone-birthday/",
    "timestamp": "2025-05-12T15:18:48Z"
  },
  {
    "title": "Iowa's lone Democratic statewide officeholder Rob Sand announces 2026 bid for governor",
    "description": "Democrat Rob Sand has announced a bid for the open Iowa governor’s race",
    "link": "https://abcnews.go.com/US/wireStory/iowas-lone-democratic-statewide-officeholder-rob-sand-announces-121716213",
    "timestamp": "2025-05-12T15:18:47Z"
  },
  {
    "title": "House Republicans have unveiled proposed Medicaid cuts. Democrats say millions will lose coverage",
    "description": "Republicans insist they're rooting out \"waste, fraud and abuse\" to generate health care savings.",
    "link": "https://www.pbs.org/newshour/politics/house-republicans-have-unveiled-proposed-medicaid-cuts-democrats-say-millions-will-lose-coverage",
    "timestamp": "2025-05-12T15:18:21Z"
  },
  {
    "title": "Donald Trump Explains Why He Granted White South Africans Refugee Status",
    "description": "A flight carrying white South Africans departed Johannesburg Sunday, marking the first group of Afrikaners granted refugee status.",
    "link": "https://www.newsweek.com/trump-explains-why-he-granted-white-south-africans-refugee-status-2071030",
    "timestamp": "2025-05-12T15:18:17Z"
  },
  {
    "title": "Trump Announces Drug Prices Cut With Swipe At Europe",
    "description": "US President Donald Trump said Monday he would slash drug prices so that they match costs abroad, accusing the \"brutal\" European Union in particular of forcing pharmaceutical firms to lower prices on its turf.",
    "link": "https://www.ibtimes.com/trump-announces-drug-prices-cut-swipe-europe-3773258",
    "timestamp": "2025-05-12T15:18:10Z"
  },
  {
    "title": "US pharma co shares rally after Trump calls for broad drug price cuts",
    "description": "President Trump plans to sign an executive order mandating drugmakers to align U.S. drug prices with those of other countries, setting price targets within 30 days. If companies fail to make significant progress within six months, the government will consider…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-pharma-co-shares-rally-after-trump-calls-for-broad-drug-price-cuts/articleshow/121116144.cms",
    "timestamp": "2025-05-12T15:18:07Z"
  },
  {
    "title": "Saudi Arabia Launches New AI Firm Ahead of Trump’s Visit",
    "description": "Saudi Arabia has launched a new firm to invest across the artificial intelligence value chain, ahead of a visit by US President Donald Trump, where the technology is expected to feature prominently on the agenda.",
    "link": "https://financialpost.com/pmn/business-pmn/saudi-arabia-launches-new-ai-firm-ahead-of-trumps-visit",
    "timestamp": "2025-05-12T15:17:53Z"
  },
  {
    "title": "A landscape transformed: Arts community reels as it responds to federal program cuts",
    "description": "Behind so many award-winning careers, high-profile productions, beloved institutions and in-depth research projects there is often a quieter story of early support from the government",
    "link": "https://abcnews.go.com/Entertainment/wireStory/landscape-transformed-responds-cuts-federal-programs-arts-community-121714191",
    "timestamp": "2025-05-12T15:17:26Z"
  },
  {
    "title": "Cannes’ Thierry Fremaux on Trump’s Tariff Plan, Resilience of American Film Culture: ‘The United States Remains a Great Country for Cinema’",
    "description": "Cannes boss Thierry Fremaux addressed Trump’s proposed tariff of 100% on foreign-produced movies and the resilience of American cinema at his press conference on Monday. U.S. President Donald Trump threw the film industry into despair on the eve of the Cannes…",
    "link": "https://variety.com/2025/film/global/cannes-thierry-fremaux-trump-tariff-plan-resilience-american-film-culture-1236394242/",
    "timestamp": "2025-05-12T15:17:25Z"
  },
  {
    "title": "Trump announces drug prices cut with swipe at Europe",
    "description": "US President Donald Trump said Monday he would slash drug prices so that they match costs abroad, accusing the “brutal” European Union in particular of forcing pharmaceutical firms to lower prices on its turf. Trump claimed as he signed the executive order at…",
    "link": "https://www.digitaljournal.com/world/trump-announces-drug-prices-cut-with-swipe-at-europe/article",
    "timestamp": "2025-05-12T15:17:20Z"
  },
  {
    "title": "Donald Trump Makes Outrageous 'World Class' Claim Over Qatar Jet 'Gift'",
    "description": "A snarling Truth Social response took flight after Trump's murky deal was reported.",
    "link": "https://www.huffpost.com/entry/donald-trump-world-class-losers-qatar-jet_n_6821fdd2e4b01f11850185ea",
    "timestamp": "2025-05-12T15:16:00Z"
  },
  {
    "title": "Russia-Ukraine meeting in Türkiye 'very important': Trump",
    "description": "U.S. President Donald Trump said Monday the upcoming Russia-Ukraine peace talks in Türkiye are \"very important,\" adding that he thinks \"good things can come out of that meeting.\"",
    "link": "https://www.hurriyetdailynews.com/russia-ukraine-meeting-in-turkiye-very-important-trump-209083",
    "timestamp": "2025-05-12T15:15:05Z"
  }
]