[
  {
    "title": "Trump backs ICE raid at Hyundai plant, but says US needs foreign experts to train Americans",
    "description": "President Trump reacted to the ICE raid that nabbed some 475 illegal migrants, mostly from South Korea, that were working at a Hyundai battery plant in Georgia.",
    "link": "https://www.foxnews.com/politics/trump-backs-ice-raid-hyundai-plant-says-us-needs-foreign-experts-train-americans",
    "timestamp": "2025-09-08T01:19:31Z"
  },
  {
    "title": "Trump says he will talk to Putin 'soon' after massive Russian air assault in Ukraine",
    "description": "Trump said he would meet Sept. 8 or Sept. 9 with unspecified European leaders to discuss how to end Russia's war with Ukraine.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/07/donald-trump-ukraine-vladimir-putin-gaza-south-korea/86017925007/",
    "timestamp": "2025-09-08T01:19:09Z"
  },
  {
    "title": "RFK. Jr’s family members say he is a ‘threat’ to Americans’ health, want him to resign - NewsBreak",
    "description": "WASHINGTON (AP) — Members of Robert F. Kennedy Jr.’s family are calling for him to step down as health secretary following a contentious congressional hear",
    "link": "https://www.newsbreak.com/share/4219285475237-rfk-jr-s-family-members-say-he-is-a-threat-to-americans-health-want-him-to-resign?s=a2&amp;share_destination_id=MTMwNDE5NDI4LTE3NTcyOTQxOTYzMDE%3D&amp;pd=08pE3A9B&amp;hl=en_US&amp;send_time=1757294196&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_android_comment_share_v3-v2",
    "timestamp": "2025-09-08T01:14:09Z"
  },
  {
    "title": "‘The Fans Were Great!’ Trump Shakes Off Relentless Booing During Anthem at US Open",
    "description": "President Trump was unfazed by some fans booing him during the National Anthem at the U.S. Open, saying later in the day the \"progressive\" fans were \"great.\"\nThe post ‘The Fans Were Great!’ Trump Shakes Off Relentless Booing During Anthem at US Open first app…",
    "link": "https://www.mediaite.com/media/sports/the-fans-were-great-trump-shakes-off-relentless-booing-during-anthem-at-us-open/",
    "timestamp": "2025-09-08T01:10:36Z"
  },
  {
    "title": "Boos of Donald Trump heard on ABC's broadcast of US Open. Good (Nancy Armour/USA Today)",
    "description": "Nancy Armour / USA Today:\nBoos of Donald Trump heard on ABC's broadcast of US Open.  Good  —  Resistance takes many forms.  —  Sometimes it's people taking to the streets in protest, as they did this weekend in Chicago and its suburbs.  Sometimes it's governo…",
    "link": "https://www.memeorandum.com/250907/p77",
    "timestamp": "2025-09-08T01:10:00Z"
  },
  {
    "title": "Golden age of stagflation beckons: Trump is becoming a job destruction machine",
    "description": "Despite a stagnating jobs market and the raging cost of living, Donald Trump and his apologists still insist he'll still turn the US economy around.\nThe post Golden age of stagflation beckons: Trump is becoming a job destruction machine appeared first on Crik…",
    "link": "http://www.crikey.com.au/2025/09/08/stagflation-unemployment-donald-trump-us-jobs/",
    "timestamp": "2025-09-08T01:09:37Z"
  },
  {
    "title": "Trump says European leaders will visit US this week to discuss Russia-Ukraine war, plans to speak to Putin 'very soon'",
    "description": "Donald Trump announced that some European leaders will visit the United States. They will discuss resolving the Russia-Ukraine war. Trump also mentioned his plans to speak with Vladimir Putin soon. He expressed dissatisfaction with the ongoing conflict. Trump…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-european-leaders-will-visit-us-this-week-to-discuss-russia-ukraine-war-plans-to-speak-to-putin-very-soon/articleshow/123755189.cms",
    "timestamp": "2025-09-08T01:04:02Z"
  },
  {
    "title": "Georgia NAACP urges Emory to reverse decision to close DEI offices",
    "description": "The Georgia NAACP is demanding Emory University reverse its decision to close diversity, equity and inclusion offices, warning it may pursue protests or legal action if the school does not meet with the group by Sept. 30.",
    "link": "https://www.fox5atlanta.com/news/georgia-naacp-urges-emory-reverse-decision-close-dei-offices",
    "timestamp": "2025-09-08T01:01:05Z"
  },
  {
    "title": "Asia could do with a visit from Trump",
    "description": "Speculations over Trump’s proposed trip to Asia has raised expectations. India will be watching the developments keenly",
    "link": "https://www.thehindubusinessline.com/opinion/asia-could-do-with-a-visit-from-trump/article70023027.ece",
    "timestamp": "2025-09-08T01:00:00Z"
  },
  {
    "title": "Golden visas for Indians: Amid changing rules and global uncertainty, golden visa calculations now include risk-hedging, estate planning, taxation",
    "description": "From EB-5 uncertainty to Portugal’s property ban, wealthy Indian families are rethinking their residency strategies as global rules tighten.",
    "link": "https://economictimes.indiatimes.com/wealth/save/golden-visas-for-indians-amid-changing-rules-and-global-uncertainty-golden-visa-calculations-now-include-risk-hedging-estate-planning-taxation/articleshow/123730830.cms",
    "timestamp": "2025-09-08T01:00:00Z"
  },
  {
    "title": "Enough Already",
    "description": "In a piece for TPM’s Backchannel newsletter last week (gift link), Josh Marshall previewed Congressional Democrats’ strategy for the upcoming showdown over the budget. Funds run out at the end of this month, so it’s an urgent question, similar to the one that…",
    "link": "https://balloon-juice.com/2025/09/07/enough-already-3/",
    "timestamp": "2025-09-08T00:59:55Z"
  },
  {
    "title": "Trump issues 'last warning' to Hamas to accept hostage deal",
    "description": "Donald Trump issued a final ultimatum to Hamas, urging them to accept a hostage release deal, claiming Israel has already agreed to his terms. Hamas acknowledged receiving proposals from mediators and is discussing ways to advance them, reiterating its demand…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-issues-last-warning-to-hamas-to-accept-hostage-deal/articleshow/123755155.cms",
    "timestamp": "2025-09-08T00:56:24Z"
  },
  {
    "title": "Who Has Called for Health Secretary Kennedy Jr. to Resign? See the List - NewsBreak",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. sparred with several senators on both sides of the aisle during a committee testimony.",
    "link": "https://www.newsbreak.com/share/4219853671755-who-has-called-for-health-secretary-kennedy-jr-to-resign-see-the-list?s=a2&amp;share_destination_id=MTkzNTk0NzkwLTE3NTcyOTI1NjI5MDY%3D&amp;pd=0D6IqcBP&amp;hl=en_US&amp;send_time=1757292562&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-09-08T00:55:34Z"
  },
  {
    "title": "RFK Jr. Lets Slip His Trump Flattery Was All for Show (Laura Esposito/The Daily Beast)",
    "description": "Laura Esposito / The Daily Beast:\nRFK Jr. Lets Slip His Trump Flattery Was All for Show  —  DOUBLE AGENT  —  The secretary is walking back his praise for Operation Warp Speed just days after declaring President Donald Trump deserves a Nobel Peace Prize for th…",
    "link": "https://www.memeorandum.com/250907/p76",
    "timestamp": "2025-09-08T00:55:01Z"
  },
  {
    "title": "WHITEHEAD: 'Rule of Law' Becomes 'Rule by Gunpoint'...",
    "description": "WHITEHEAD: 'Rule of Law' Becomes 'Rule by Gunpoint'...\r\n\n \n \n \n (First column, 3rd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Military work absences surge amid domestic deployments...\r\nArmed Troops at Washington Monument...\r\nHow conservatives learned to love t…",
    "link": "https://www.rutherford.org/publications_resources/john_whiteheads_commentary/a_police_state_presidency_when_rule_of_law_becomes_rule_by_gunpoint",
    "timestamp": "2025-09-08T00:52:36Z"
  },
  {
    "title": "Trump calls on foreign companies to respect immigration law",
    "description": "United States President Donald Trump called on foreign companies to respect US immigration law following the raid by Immigration and Customs Enforcement (ICE) on the Hyundai Battery plant in Georgia.I...",
    "link": "https://biztoc.com/x/fb3bee9f65dfcbf2",
    "timestamp": "2025-09-08T00:48:56Z"
  },
  {
    "title": "Trump booed at US Open after visit delays final",
    "description": "Watch video: President Donald Trump's attendance at the US Open men's final on Sunday delayed the start of the match, as hordes of tennis fans struggled to get through tightened security checkpoints. \"I don't want myself to be nervous because of it, but I thi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/viral-video-watch-trump-booed-at-us-open-after-visit-delays-final/articleshow/123755110.cms",
    "timestamp": "2025-09-08T00:43:29Z"
  },
  {
    "title": "Carlos Alcaraz outshines rival Jannik Sinner to capture U.S. Open crown",
    "description": "Alcaraz will reclaim the world No. 1 ranking from Sinner, returning to the top spot for the first time since September 2023.",
    "link": "https://www.japantimes.co.jp/sports/2025/09/08/tennis/alcaraz-beats-sinner-us-open-final/",
    "timestamp": "2025-09-08T00:43:00Z"
  },
  {
    "title": "트럼프 이민 정책이 미국 투자 리스크",
    "description": "South Korea has concluded talks with the US to bring back its nationals who were detained while working at a construction site for a Hyundai Motor plant, Yonhap News reported https://t.co/PLRNmsoBBs— Bloomberg (@business) September 7, 2025 미국에 구금된 현대차와 LG에너지솔…",
    "link": "https://ryueyes11.tistory.com/511843",
    "timestamp": "2025-09-08T00:37:41Z"
  },
  {
    "title": "Carlos Alcaraz reclaims World No. 1 as he outshines rival Jannik Sinner to win US Open",
    "description": "Carlos Alcaraz defeated Jannik Sinner in four sets to win the US Open, reclaiming the world number one ranking. The match, attended by Donald Trump, saw Alcaraz avenge his Wimbledon loss and extend his dominance over Sinner. Alcaraz has now won seven of the p…",
    "link": "https://economictimes.indiatimes.com/news/sports/carlos-alcaraz-becomes-world-no-1-as-he-outshines-rival-jannik-sinner-to-win-us-open/articleshow/123755061.cms",
    "timestamp": "2025-09-08T00:37:02Z"
  },
  {
    "title": "Ryan Routh to stand trial for alleged Trump assassination attempt",
    "description": "Routh's trial in Florida begins on Monday, and he has made the unusual choice to represent himself.",
    "link": "https://www.bbc.com/news/articles/c8xre584drdo",
    "timestamp": "2025-09-08T00:35:02Z"
  },
  {
    "title": "Peter Navarro Sues Justice Department Amid Ongoing Dispute",
    "description": "Peter Navarro, a long-time economic advisor for President Donald Trump, maintains he was wrongfully charged with contempt of congress.",
    "link": "https://biztoc.com/x/beca1a9807bdfaa6",
    "timestamp": "2025-09-08T00:26:53Z"
  },
  {
    "title": "Trump Says Georgia Raid Shows Need for Training US Workers",
    "description": "President Donald Trump said he wants to find a way to bring in experts to train US workers following an immigration raid at a South Korean-owned electric vehicle battery factory in Georgia.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-georgia-raid-shows-need-for-training-us-workers",
    "timestamp": "2025-09-08T00:21:04Z"
  },
  {
    "title": "Exclusive: Michigan Senate Candidate Mike Rogers Calls for National Guard to Bust Detroit Crime",
    "description": "Former U.S. Rep. Mike Rogers (R-MI), the Trump-endorsed Republican Senate candidate for Michigan, called for President Donald Trump to deploy the National Guard to Detroit to \"give these neighborhoods back\" to law-abiding citizens in an exclusive interview on…",
    "link": "https://www.breitbart.com/politics/2025/09/07/exclusive-michigan-senate-candidate-mike-rogers-calls-national-guard-bust-detroit-crime/",
    "timestamp": "2025-09-08T00:20:31Z"
  },
  {
    "title": "Peter Navarro Sues Justice Department Amid Ongoing Dispute",
    "description": "Peter Navarro, a long-time economic advisor for President Donald Trump, maintains he was wrongfully charged with contempt of congress.",
    "link": "https://www.newsweek.com/peter-navarro-sues-justice-department-contempt-dispute-2126114",
    "timestamp": "2025-09-08T00:18:47Z"
  },
  {
    "title": "Trump says 'certain' EU leaders coming to discuss Ukraine",
    "description": "United States President Donald Trump said \"certain\" European leaders would be coming over to the US on Monday or Tuesday, \"individually\" to discuss the conflict in Ukraine.\"I think we're going to get ...",
    "link": "https://biztoc.com/x/2ec2b7382b8ae3d3",
    "timestamp": "2025-09-08T00:15:54Z"
  },
  {
    "title": "'Absolutely despicable': Trump ally skewered for shutting down decades-old protest tent",
    "description": "One of President Donald Trump's fiercest allies was roundly criticized on Sunday after he caused a decades-old protest tent outside of the White House to be torn down. Brian Glenn, chief white house correspondent for Real America's Voice, told Trump during a …",
    "link": "https://www.rawstory.com/brian-glenn-2673968780/",
    "timestamp": "2025-09-08T00:13:02Z"
  },
  {
    "title": "India Treads With Caution After Trump Softens His Rhetoric",
    "description": "New Delhi is proceeding with caution after President Donald Trump appeared to soften his tone against India following weeks of tensions between the two nations marked by the US’s 50% tariffs on goods from the South Asian country.",
    "link": "https://financialpost.com/pmn/business-pmn/india-treads-with-caution-after-trump-softens-his-rhetoric",
    "timestamp": "2025-09-08T00:05:40Z"
  },
  {
    "title": "Trump wants to make war on Chicago. He picked the wrong fight (Will Bunch/The Philadelphia Inquirer)",
    "description": "Will Bunch / The Philadelphia Inquirer:\nTrump wants to make war on Chicago.  He picked the wrong fight  —  Donald Trump is starting to remind me of Madonna as her triumphant 1980s morphed into the 1990s and she had to get crazier and crazier to still get peop…",
    "link": "https://www.memeorandum.com/250907/p71",
    "timestamp": "2025-09-08T00:05:00Z"
  },
  {
    "title": "Trump delivers ultimatum to Hamas: Accept deal and release hostages or pay the consequences (Greg Wehner/Fox News)",
    "description": "Greg Wehner / Fox News:\nTrump delivers ultimatum to Hamas: Accept deal and release hostages or pay the consequences  —  Trump says there will not be another warning as 50 hostages remain held with only 20 assessed alive  —  President Donald Trump issued his “…",
    "link": "https://www.memeorandum.com/250907/p72",
    "timestamp": "2025-09-08T00:05:00Z"
  },
  {
    "title": "South Korean worker tells BBC of panic and confusion during Hyundai ICE raid",
    "description": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
    "link": "https://www.bbc.com/news/articles/c5yqg0rln74o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-08T00:03:51Z"
  },
  {
    "title": "Trump says European leaders will visit US this week to discuss Russia-Ukraine war",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump said on Sunday that individual European leaders would visit the United States on Monday or Tuesday to discuss how to resolve the Russian-Ukraine war. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/08/trump-says-european-leaders-will-visit-us-this-week-to-discuss-russia-ukraine-war",
    "timestamp": "2025-09-08T00:03:00Z"
  },
  {
    "title": "A National Asset in Troubled Times",
    "description": "When he was running for president in 2024, Donald Trump promised that he would shut down the Ukraine war shortly after taking office, if not before he moved into the White House. He also promised that he would not start any more wars and would markedly improv…",
    "link": "https://original.antiwar.com/john-mearsheimer/2025/09/07/a-national-asset-in-troubled-times/",
    "timestamp": "2025-09-08T00:00:40Z"
  },
  {
    "title": "The West’s Hypocritical Opposition to Ukraine’s Forced Territorial Concessions",
    "description": "Ukraine President Volodymyr Zelensky has consistently ruled out making any territorial concession as part of a peace accord to end his country’s war with Russia.  NATO’s European members (with the partial exceptions of Hungary and Turkey) continue to support …",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/09/07/the-wests-hypocritical-opposition-to-ukraines-forced-territorial-concessions/",
    "timestamp": "2025-09-08T00:00:31Z"
  },
  {
    "title": "Trump's US Open visit sparks boos and long security lines...",
    "description": null,
    "link": "https://apnews.com/article/trump-us-open-sporting-events-boos-5a80b02c78403f1f2f87a30852ffb0f5",
    "timestamp": "2025-09-08T00:00:04Z"
  },
  {
    "title": "Rebecca Solnit on Trump, Books, and the Reincarnation of King George III",
    "description": "Q&A\n \n \n / \n September 8, 2025\n \r\n\n \nRebecca Solnit on Trump, Books, and the Reincarnation of King George III\r\n\n\n\nA conversation with the writer and activist about living in a nation where those who lead are often disinclined to read—let alone write—meaningfu…",
    "link": "https://www.thenation.com/?post_type=article&p=569194",
    "timestamp": "2025-09-08T00:00:00Z"
  },
  {
    "title": "Differences with US do not justify military conflict: Venezuela's Maduro",
    "description": "Caracas (AFP) Sept 5, 2025\n\n Venezuela's President Nicolas Maduro said Friday that differences with the United States did not justify a military conflict, urging dialogue after counterpart Donald Trump threatened to shoot down Venezuelan jets that threaten US…",
    "link": "https://www.spacewar.com/reports/Differences_with_US_do_not_justify_military_conflict_Venezuelas_Maduro_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "Trump tells Europe to put economic pressure on China over Ukraine",
    "description": "Washington (AFP) Sept 4, 2025\n\n\n US President Donald Trump urged European countries Thursday to put economic pressure China because of its support for Russia's invasion of Ukraine, the White House said. \n\nSpeaking by video conference with European leaders gat…",
    "link": "https://www.spacewar.com/reports/Trump_tells_Europe_to_put_economic_pressure_on_China_over_Ukraine_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "Iran will accept nuclear curbs if sanctions lifted: report",
    "description": "London (AFP) Sept 7, 2025\n\n\n Iran will accept limits on its nuclear programme and restrictions to uranium enrichment if international sanctions are lifted, its foreign minister said in a piece in The Guardian on Sunday. \n\nIran \"is ready to forge a realistic a…",
    "link": "https://www.spacewar.com/reports/Iran_will_accept_nuclear_curbs_if_sanctions_lifted_report_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "US tech titans pay hommage to Trump at White House dinner",
    "description": "Washington (AFP) Sept 5, 2025\n\n\n Tech world executives showered Donald Trump with praise Thursday during a rare dinner that saw the US president host some of the most important players in AI at the White House. \n\n\"This is quite a group to get together,\" said …",
    "link": "https://www.spacewar.com/reports/US_tech_titans_pay_hommage_to_Trump_at_White_House_dinner_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "Trump to blacklist countries for imprisoning Americans",
    "description": "Washington (AFP) Sept 5, 2025\n\n\n US President Donald Trump moved Friday to create a blacklist of countries that Washington says unjustly detain Americans, spelling out harsh punishments including bans on travel. \n\nIn an executive order, Trump said the United …",
    "link": "https://www.spacewar.com/reports/Trump_to_blacklist_countries_for_imprisoning_Americans_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "Pentagon says Venezuelan planes buzzed US ship in 'highly provocative move'",
    "description": "Washington (AFP) Sept 5, 2025\n\n The Pentagon said two Venezuelan military planes flew near a US Navy vessel in international waters Thursday in a \"highly provocative\" move that marked a new escalation in the standoff over Washington's Caribbean deployment. \n\n…",
    "link": "https://www.spacewar.com/reports/Pentagon_says_Venezuelan_planes_buzzed_US_ship_in_highly_provocative_move_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "France bets on 'Nostradamus' radar to spot missiles",
    "description": "Crucey-Villages, France (AFP) Sept 5, 2025\n\n\n France's defence ministry is boosting investment in a 1990s radar system, as part of Paris's push to bolster its early warning defences and curb Europe's reliance on the United States. \n\nIn a Normandy field pocked…",
    "link": "https://www.spacewar.com/reports/France_bets_on_Nostradamus_radar_to_spot_missiles_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "US to cut military aid for Europe: official",
    "description": "Vilnius (AFP) Sept 5, 2025\n\n\n The United States is to end long-running military assistance for European countries close to Russia, as it pushes the continent to play a greater role in its own defence, an official in one of the countries confirmed on Friday. \n…",
    "link": "https://www.spacewar.com/reports/US_to_cut_military_aid_for_Europe_official_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "US Navy SEALs botched secret 2019 mission in North Korea: report",
    "description": "Washington (AFP) Sept 6, 2025\n\n Elite US Navy SEALs launched an audacious operation in 2019 to plant a listening device in North Korea to spy on the country's reclusive leader Kim Jong Un, the New York Times reported Friday, but the mission quickly unraveled …",
    "link": "https://www.spacewar.com/reports/US_Navy_SEALs_botched_secret_2019_mission_in_North_Korea_report_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "Trump hails Department of War rebrand as 'message of victory'",
    "description": "Washington (AFP) Sept 5, 2025\n\n US President Donald Trump signed an order Friday rebranding the Department of Defense as the Department of War, saying it sent a \"message of victory\" to the rest of the world. \n\nFlanked by Pentagon chief Pete Hegseth at a signi…",
    "link": "https://www.spacewar.com/reports/Trump_hails_Department_of_War_rebrand_as_message_of_victory_999.html",
    "timestamp": "2025-09-07T23:54:49Z"
  },
  {
    "title": "Trump says will speak to Putin 'over next couple of days'",
    "description": "United States President Donald Trump announced that he would be speaking to Russian President Vladimir Putin \"very soon, over the next couple of days,\" voicing his confidence in settling the...",
    "link": "https://biztoc.com/x/a957c900910e80ae",
    "timestamp": "2025-09-07T23:53:28Z"
  },
  {
    "title": "Trump Is Repeatedly Booed At The U.S. Open",
    "description": "Multiple broadcasters captured the jeers despite the USTA's reported efforts to silence them.",
    "link": "https://www.huffpost.com/entry/trump-us-open-booed_n_68be01dfe4b00b82060b89d6",
    "timestamp": "2025-09-07T23:49:21Z"
  },
  {
    "title": "Trump: I think we’ll have a Gaza deal very soon",
    "description": "President Trump says a Gaza ceasefire and hostage release deal may be close, expresses hope that all hostages - living and dead - will be returned.",
    "link": "https://www.israelnationalnews.com/news/414545",
    "timestamp": "2025-09-07T23:48:08Z"
  },
  {
    "title": "Gov. Wes Moore says he's not running for president in 2028",
    "description": "During an appearance on NBC News' \"Meet the Press\" on Sunday, Maryland Gov. Wes Moore said he's ruling out running for president in 2028, after months of speculation.",
    "link": "https://www.fox5dc.com/news/maryland-gov-wes-moore-says-hes-not-running-president-2028",
    "timestamp": "2025-09-07T23:45:27Z"
  },
  {
    "title": "South Korea to fly detained workers back as U.S. vows more raids on employers",
    "description": "South Korea is moving to pick up Korean workers following a raid at a Hyundai Motor manufacturing facility in the U.S. state of Georgia last week, a presidential official for Seoul said on Sunday as the Trump administration promised more raids on businesses. …",
    "link": "https://japantoday.com/category/world/south-korea-to-fly-detained-workers-back-as-us-vows-more-raids-on-employers",
    "timestamp": "2025-09-07T23:44:53Z"
  },
  {
    "title": "Trump Makes Historic Trip to U.S. Open, Received with Cheers",
    "description": "President Donald Trump was received with cheers at the U.S. Open final in Queens, New York, on Sunday, becoming just the second sitting president to attend the event. \nThe post Trump Makes Historic Trip to U.S. Open, Received with Cheers appeared first on Bre…",
    "link": "https://www.breitbart.com/politics/2025/09/07/trump-makes-historic-trip-to-u-s-open-received-with-cheers/",
    "timestamp": "2025-09-07T23:44:46Z"
  },
  {
    "title": "Trump says he expects Gaza deal very soon",
    "description": "United States President Donald Trump told reporters that he expects a deal on Gaza to be reached \"real soon,\" after he issued what he called a \"last warning\" to Hamas to agree to a...",
    "link": "https://biztoc.com/x/80be36db08636eef",
    "timestamp": "2025-09-07T23:42:20Z"
  },
  {
    "title": "Trump 'surprised' by Ishiba's resignation",
    "description": "United States President Donald Trump said he was taken aback \"a little bit\" by Japanese Prime Minister Shigeru Ishiba announcing his resignation.\nMore to come......",
    "link": "https://biztoc.com/x/938df91646330602",
    "timestamp": "2025-09-07T23:42:14Z"
  },
  {
    "title": "Trump Issues ‘Last Warning’ From U.S. Open",
    "description": "Donald Trump issued a frantic post on Truth Social in the midst of attending the U.S. Open Men’s Singles Final. The president was met with jeers and cheers...",
    "link": "https://www.thedailybeast.com/donald-trump-issues-last-warning-to-hamas-from-us-open/",
    "timestamp": "2025-09-07T23:42:03Z"
  },
  {
    "title": "In US town hoping for revival, Trump's tariffs put to test",
    "description": "The gulf between Trump's rhetoric and the reality on the ground is starting to show.",
    "link": "https://www.bbc.com/news/articles/c3rvdxz9589o",
    "timestamp": "2025-09-07T23:38:33Z"
  },
  {
    "title": "Trump: I think we will have a deal on Gaza very soon",
    "description": "Real time news brief - Trump: I think we will have a deal on Gaza very soon - Israel National News flashes around the clock are waiting for you on the site",
    "link": "https://www.israelnationalnews.com/flashes/665937",
    "timestamp": "2025-09-07T23:37:00Z"
  },
  {
    "title": "Carlos Alcaraz Beats Rival Jannik Sinner, Wins U.S. Open in Modified Nike Sneakers",
    "description": "Spanish tennis star Carlos Alcaraz defeated rival Jannick Sinner and won the US Open for the second time in a pair of specialized Nike tennis shoes.",
    "link": "http://wwd.com/footwear-news/sneaker-news/carlos-alcaraz-us-open-2025-win-nike-vapor-12-1238121228/",
    "timestamp": "2025-09-07T23:33:37Z"
  },
  {
    "title": "Trump's latest 'ominous' threat shows more 'extreme' actions still to come: Ex-GOP analyst",
    "description": "President Donald Trump's AI-generated post on Truth Social, saying \"Chicago about to find out why it's called the Department of War,\" was an \"ominous\" signal to one analyst. Tim Miller, writer-at-large for the conservative outlet The Bulwark, joined the publi…",
    "link": "https://www.rawstory.com/tim-miller-2673968720/",
    "timestamp": "2025-09-07T23:25:07Z"
  },
  {
    "title": "RFK Jr. sister calls on him to resign telling health secretary 'enough is enough' - NewsBreak",
    "description": "In a statement posted to her social media pages, Kerry Kennedy lambasted her brother for causing the ongoing turmoil within the CDC and. his attempts to re",
    "link": "https://www.newsbreak.com/share/4217162695911-rfk-jr-sister-calls-on-him-to-resign-telling-health-secretary-enough-is-enough?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1757287136&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.36.0.14%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-09-07T23:19:27Z"
  },
  {
    "title": "South Korean worker tells BBC of panic and confusion during Hyundai ICE raid",
    "description": "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
    "link": "https://www.bbc.com/news/articles/c5yqg0rln74o",
    "timestamp": "2025-09-07T23:14:55Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "Americans' views of President Donald Trump's job performance remain negative amid a flurry of activity on tariffs, immigration and public health, according to the latest NBC News Decision Desk Poll.",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-september-7-rcna229191",
    "timestamp": "2025-09-07T23:05:51Z"
  },
  {
    "title": "Chicago churches urge calm resistance to expected federal intervention",
    "description": "Churches citywide are turning up their response from the pulpit.",
    "link": "https://abcnews.go.com/US/wireStory/chicago-churches-urge-calm-resistance-ahead-expected-federal-125342307",
    "timestamp": "2025-09-07T23:04:30Z"
  },
  {
    "title": "Trump and GOP Leadership Move to Crush Massie in Kentucky",
    "description": "“He’s challenged us, and disagreement is not disloyalty. … But at the end of the day, when we decide to call a play, we’ve got to run the play the coach calls.”\nThe post Trump and GOP Leadership Move to Crush Massie in Kentucky first appeared on Le·gal In·sur…",
    "link": "https://legalinsurrection.com/2025/09/trump-and-gop-leadership-move-to-crush-massie-in-kentucky/",
    "timestamp": "2025-09-07T23:00:58Z"
  },
  {
    "title": "Houthi Drone Strikes Israeli Airport In Rare Hit, As IDF Escalates Gaza City Attacks",
    "description": "The attack on Ramon Airport comes as Israeli forces level another high-rise tower that housed hundreds of displaced Palestinians in the dense city.",
    "link": "https://www.huffpost.com/entry/houthi-strikes-israeli-airport-idf-escalates-gaza-city_n_68be0481e4b00b82060b8a7e",
    "timestamp": "2025-09-07T23:00:39Z"
  },
  {
    "title": "Former White House lawyer Ty Cobb on Trump: 'Worse than anyone in our history'",
    "description": "Cobb, who was a White House lawyer during Trump's first term as president, left this comment under an acquaintance's private Facebook post.",
    "link": "https://www.snopes.com//fact-check/ty-cobb-lawyer-trump-quote/",
    "timestamp": "2025-09-07T23:00:00Z"
  },
  {
    "title": "Education Sec. McMahon Defends Trump’s Freeze on Harvard Funds, Cites Title VI Violations",
    "description": "Secretary of Education Linda McMahon joined “Fox News Sunday” where she defended President Donald Trump’s freezing of Harvard’s funding grants and attempted to relieve concerns... Read More\nThe post Education Sec. McMahon Defends Trump’s Freeze on Harvard Fun…",
    "link": "https://www.dailysignal.com/2025/09/07/education-sec-mcmahon-defends-trumps-freeze-on-harvard-funds-cites-title-vi-violations/",
    "timestamp": "2025-09-07T23:00:00Z"
  },
  {
    "title": "Gold Steadies Near Record High After Bets on Fed Rate Cuts Surge",
    "description": "Both gold and silver have more than doubled over the past three years, with mounting risks in geopolitics, the economy and global trade driving haven demand....",
    "link": "https://finance.yahoo.com/news/gold-steadies-near-record-high-225421182.html",
    "timestamp": "2025-09-07T22:54:21Z"
  },
  {
    "title": "Israel intensifies Gaza City destruction, bombs another high-rise tower",
    "description": "Hundreds of families lose their shelters as Israeli attacks kill at least 65 Palestinians across besieged Gaza.",
    "link": "https://www.aljazeera.com/news/2025/9/7/israel-intensifies-gaza-city-destruction-bombs-another-high-rise-tower",
    "timestamp": "2025-09-07T22:49:55Z"
  },
  {
    "title": "Immigration enforcement in Massachusetts doesn't make residents feel safe, rep. says",
    "description": "An immigration enforcement surge is underway in Boston as President Donald Trump continues to threaten federal deployment in several other U.S. cities.",
    "link": "https://www.wcvb.com/article/immigration-enforcement-in-massachusetts-doesnt-make-residents-feel-safe-rep-says/66005303",
    "timestamp": "2025-09-07T22:48:29Z"
  },
  {
    "title": "Jim Cramer: Trump may be exciting, but can listening to him make you money?",
    "description": "The conundrum of President Donald Trump is one I try to stay away from. Not because I don't want to go there, but because it hasn't been all that lucrative to do so. Because of the president's sheer, endless presence in the media, and his love of CEOS — to ha…",
    "link": "https://biztoc.com/x/aecf4562126f0071",
    "timestamp": "2025-09-07T22:46:28Z"
  },
  {
    "title": "Trump walks back Chicago 'war' threat, but vows to 'clean up' cities",
    "description": "Trump posted online that Chicago was \"about to find out why it's called the Department of WAR,\" but later said his administration wouldn't go to war with American cities but rather \"clean them up.\"",
    "link": "https://www.npr.org/2025/09/07/nx-s1-5533191/trump-chicago-threat-baltimore-new-orleans",
    "timestamp": "2025-09-07T22:41:43Z"
  },
  {
    "title": "White House's review of Smithsonian content could reach into classrooms nationwide",
    "description": "Some history teachers are concerned about what may come of a White House review of the Smithsonian's public-facing content",
    "link": "https://www.wsbtv.com/news/politics/white-houses-review/C2FNGPFMH5H3TFUJEPWAO5X4H4/",
    "timestamp": "2025-09-07T22:41:09Z"
  },
  {
    "title": "Nobel economist warns 'sheer ignorance' of Trump's last 'obsession' may hurt the economy​",
    "description": "A Nobel Prize-winning economist warned on Sunday that President Donald Trump's \"obsession\" with assuming control of the Federal Reserve could have significant impacts on the American economy. Paul Krugman, who won a Nobel Prize in 2008, argued in a new Substa…",
    "link": "https://www.rawstory.com/paul-krugman-2673968696/",
    "timestamp": "2025-09-07T22:40:05Z"
  },
  {
    "title": "Carlos Alcaraz beats rival Jannik Sinner at U.S. Open for 6th Grand Slam title",
    "description": "Sunday's showdown was the third Grand Slam tournament in a row where these elite, young rivals met to decide the champion.",
    "link": "https://www.pbs.org/newshour/world/carlos-alcaraz-beats-rival-jannik-sinner-at-u-s-open-for-6th-grand-slam-title",
    "timestamp": "2025-09-07T22:40:03Z"
  },
  {
    "title": "Trump family's wealth grew by $1.3B following ABTC and WLFI debuts: Report",
    "description": "The Trump family saw their collective net worth rise by as much as $1.3 billion this week after American Bitcoin and World Liberty Financial debuted trading.",
    "link": "https://cointelegraph.com/news/trump-family-wealth-grew-1-3b-abtc-wlfi",
    "timestamp": "2025-09-07T22:37:37Z"
  },
  {
    "title": "'Never seen anything like it' — what Trump's favorite phrase says about his presidency",
    "description": "",
    "link": "https://biztoc.com/x/871462b7a169e516",
    "timestamp": "2025-09-07T22:35:01Z"
  },
  {
    "title": "Newsom slams Trump allies for ‘cheersing Diet Cokes’ at Rose Garden as economy sinks",
    "description": "Gavin Newsom wrote on X that while the economy struggles, Republicans are busy 'cheersing Diet Cokes' at Donald Trump’s new Rose Garden Club",
    "link": "https://news.meaww.com/newsom-slams-trump-allies-for-cheersing-diet-cokes-at-rose-garden-as-economy-sinks",
    "timestamp": "2025-09-07T22:33:47Z"
  },
  {
    "title": "Alcaraz beats Sinner to lift US Open 2025 as Trump watches on",
    "description": "Alcaraz returns to number one spot after winning his sixth Grand Slam title and second of 2025 in four sets in New York.",
    "link": "https://www.aljazeera.com/sports/2025/9/7/alcaraz-beats-sinner-to-lift-us-open-2025-as-trump-watches-on",
    "timestamp": "2025-09-07T22:32:35Z"
  },
  {
    "title": "Oil prices climb as OPEC+ agrees to raise output at slower pace from October",
    "description": "TOKYO : Oil prices climbed on Monday in early trade, trimming some of last week's losses, after OPEC+ agreed over the weekend to raise output at a slower pace from October on expectations of weaker global demand. Brent crude gained 34 cents, or 0.5 per cent, …",
    "link": "https://www.channelnewsasia.com/business/oil-prices-climb-opec-agrees-raise-output-slower-pace-october-5337176",
    "timestamp": "2025-09-07T22:31:54Z"
  },
  {
    "title": "Trump's fiercest critics concede spotlight to president at US Open",
    "description": "President Donald Trump was the main attraction in the stands at the U.S. Open in New York City and some of his fiercest critics were also in attendance.",
    "link": "https://www.foxnews.com/sports/trumps-fiercest-critics-concede-spotlight-president-us-open",
    "timestamp": "2025-09-07T22:31:14Z"
  },
  {
    "title": "Trump Is Taking Credit for Infrastructure Projects Funded by Biden Legislation He Opposed (Peter Wade/Rolling Stone)",
    "description": "Peter Wade / Rolling Stone:\nTrump Is Taking Credit for Infrastructure Projects Funded by Biden Legislation He Opposed  —  The administration is putting up signs that say, “President Donald J. Trump” and “Rebuilding America's Infrastructure” at worksites funde…",
    "link": "https://www.memeorandum.com/250907/p68",
    "timestamp": "2025-09-07T22:25:00Z"
  },
  {
    "title": "New Zealand income growth one of the worst in the world",
    "description": "NZ ranks 25th out of 43 for GDP growth over past decade and 37th for the past two years.",
    "link": "https://www.nzherald.co.nz/business/new-zealand-income-growth-one-of-the-worst-in-the-world/KYYPZP4TBZETHBH5UQKGEZ4VLM/",
    "timestamp": "2025-09-07T22:19:51Z"
  },
  {
    "title": "Who’s in attendance for the US Open men’s final? From Trump’s MAGA entourage to Lindsay Lohan and Courteney Cox",
    "description": "Match between World No. 1 Jannik Sinner and Spain’s star player Carlos Alcaraz was delayed due to Trump’s attendance",
    "link": "https://www.the-independent.com/life-style/us-open-final-celebrities-who-attendance-b2821903.html",
    "timestamp": "2025-09-07T22:15:27Z"
  },
  {
    "title": "How vaccines changed the world and the public health challenges that persist",
    "description": "Vaccination campaigns have nearly eradicated some of the most deadly and transmissible diseases. However, against a backdrop of a rising tide of vaccine hesitancy, and U.S. leaders pulling global support, outbreaks are cropping up again.",
    "link": "https://www.cfr.org/backgrounder/how-vaccines-changed-world",
    "timestamp": "2025-09-07T22:12:40Z"
  },
  {
    "title": "Alcaraz beats Sinner in U.S. Open final for 6th Slam title and No. 1 ranking",
    "description": "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 victory Sunday in the U.S. Open final — the third Grand Slam tournament in a row where these elite, young rivals met to decide the champion — for his second trophy at Flush…",
    "link": "https://japantoday.com/category/sports/Alcaraz-beats-Sinner-in-U.S.-Open-final-for-6th-Slam-title-and-No.-1-ranking",
    "timestamp": "2025-09-07T22:12:21Z"
  },
  {
    "title": "Alcaraz Beats Sinner To Win US Open And Reclaim No.1 Ranking",
    "description": "Carlos Alcaraz beat Jannik Sinner in four sets on Sunday to win the US Open as loud boos -- mixed with a smattering of cheers -- greeted President Donald Trump at the final in New York.",
    "link": "https://www.ibtimes.com/alcaraz-beats-sinner-win-us-open-reclaim-no1-ranking-3782761",
    "timestamp": "2025-09-07T22:12:11Z"
  },
  {
    "title": "Trump Pushes US Nuclear Deals in UK Ahead of State Visit",
    "description": "MOSCOW (Sputnik) - Ahead of US President Donald Trump's state visit to the UK, the White House is lobbying for plans for US companies to build nuclear power plants (NPP) and data centers for artificial intelligence (AI) software in the UK, The Telegraph newsp…",
    "link": "https://sputnikglobe.com/20250907/trump-pushes-us-nuclear-deals-in-uk-ahead-of-state-visit-1122745826.html",
    "timestamp": "2025-09-07T22:11:00Z"
  },
  {
    "title": "Carlos Alcaraz beats Jannik Sinner to claim second US Open title",
    "description": "The Spaniard won four sets against Jannik Sinner to win his sixth grand slam title",
    "link": "https://www.irishtimes.com/sport/2025/09/07/carlos-alcaraz-beats-jannik-sinner-to-claim-second-us-open-title/",
    "timestamp": "2025-09-07T22:10:55Z"
  },
  {
    "title": "Alcaraz bests Sinner to win US Open, sixth Slam",
    "description": "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 win Sunday in the US Open final -- the third Grand Slam tournament in a row where these rivals met to decide the champion -- for his second title at Flushing Meadows.",
    "link": "https://www.espn.com/tennis/story/_/id/46190196/carlos-alcaraz-defeats-rival-jannik-sinner-us-open",
    "timestamp": "2025-09-07T22:10:41Z"
  },
  {
    "title": "Amy Coney Barrett Claims There’s Nothing Unprecedented About Trump’s ‘Conflicts’ With The Judiciary",
    "description": "Supreme Court Justice Amy Coney Barrett expressed a lack of concern over President Donald Trump and his combative stance toward the judicial branch.\nThe post Amy Coney Barrett Claims There’s Nothing Unprecedented About Trump’s ‘Conflicts’ With The Judiciary f…",
    "link": "https://www.mediaite.com/politics/amy-coney-barrett-claims-theres-nothing-unprecedented-about-trumps-conflicts-with-the-judiciary/",
    "timestamp": "2025-09-07T22:08:40Z"
  },
  {
    "title": "Trump's US Open visit sparks boos and long security lines",
    "description": "President Donald Trump attended the U.S. Open on Sunday, drawing boos from the crowd",
    "link": "https://abcnews.go.com/US/wireStory/trumps-us-open-visit-sparks-boos-long-security-125336602",
    "timestamp": "2025-09-07T22:08:10Z"
  },
  {
    "title": "WATCH: Scott Jennings says this household name is true leader of the Democrat Party, and is not even a Dem!",
    "description": "'The only thing they know how to do is be against whatever he is for'",
    "link": "https://www.wnd.com/2025/09/watch-scott-jennings-says-this-household-name-is/",
    "timestamp": "2025-09-07T22:06:35Z"
  },
  {
    "title": "Alcaraz beats Sinner to win US Open and reclaim Number 1 ranking",
    "description": "Loud boos — mixed with a smattering of cheers — greeted President Donald Trump at the event.",
    "link": "https://www.the42.ie/alcaraz-beats-sinner-to-win-us-open-and-reclaim-number-1-ranking-6810300-Sep2025/",
    "timestamp": "2025-09-07T22:02:34Z"
  },
  {
    "title": "Awesome Alcaraz sinks Sinner in US Open final",
    "description": "Carlos Alcaraz reclaimed the world number one ranking and supremacy in his rivalry with Jannik Sinner by dethroning the Italian to win a second US Open title.",
    "link": "https://www.rte.ie/sport/tennis/2025/0907/1532311-awesome-alcaraz-sinks-sinner-in-us-open-final/",
    "timestamp": "2025-09-07T22:01:27Z"
  },
  {
    "title": "Trump clashes with reporters after Chicago ‘war’ meme: ‘That’s not war, that’s common sense’",
    "description": "President Donald Trump posted a provocative 'Apocalypse Now; meme about Chicago deportations, sparking outrage from Illinois officials and a tense confrontation with NBC News.",
    "link": "https://www.foxnews.com/media/trump-clashes-reporters-after-chicago-war-meme-thats-not-war-thats-common-sense",
    "timestamp": "2025-09-07T22:00:02Z"
  },
  {
    "title": "Commentary: With global risks rising, Singapore’s government faces a more complex term",
    "description": "Amid global uncertainty, Singapore’s government must also ensure the success and well-being of every citizen, says former NMP Nicholas Fang.",
    "link": "https://www.channelnewsasia.com/commentary/singapore-parliament-president-tharman-government-global-uncertainties-5336741",
    "timestamp": "2025-09-07T22:00:00Z"
  }
]