[
  {
    "title": "Why Trump Thanked John Roberts",
    "description": "The conservative justices are frequently accomplices to Trump’s assault on democracy.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/03/congressional-address-supreme-court/681926/",
    "timestamp": "2025-03-05T15:55:00Z"
  },
  {
    "title": "Germany to ease government debt limits in major step aimed at boosting economy, defense spending",
    "description": "FRANKFURT, Germany (AP) — The two political parties expected to form the next German government have agreed to loosen the country’s constitution restrictions on borrowing, enabling 1 trillion euros ($1.08 trillion) or more in spending on defense and infrastru…",
    "link": "https://financialpost.com/pmn/germany-to-ease-government-debt-limits-in-major-step-aimed-at-boosting-economy-defense-spending",
    "timestamp": "2025-03-05T15:54:39Z"
  },
  {
    "title": "Angry customers begin 40-day boycott of 7th largest retailer in U.S.",
    "description": "The boycott coincides with the start of Lent and urges supporters not to spend any money at the retailer during that time.",
    "link": "https://www.mlive.com/news/2025/03/angry-customers-begin-40-day-boycott-of-7th-largest-retailer-in-us.html",
    "timestamp": "2025-03-05T15:54:30Z"
  },
  {
    "title": "I Learned So Much From President Trump’s Address to Congress",
    "description": "And from the Democrats’ very effective protests.\nThe post I Learned So Much From President Trump’s Address to Congress appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/03/05/i-learned-so-much-from-president-trumps-address-to-congress/",
    "timestamp": "2025-03-05T15:54:05Z"
  },
  {
    "title": "Trump Halts All Aid to the Palestinian Authority Security Forces-And shows up the Biden Administration for what they are",
    "description": "Mahmoud Abbas likes to present himself, as head of the Palestinian Authority (PA), as the “moderate” alternative to Hamas. The idea seems to be that the PA’s largest faction, Fatah, does not engage directly in terrorism, and therefore the PA deserves the vast…",
    "link": "https://freerepublic.com/focus/f-news/4302239/posts",
    "timestamp": "2025-03-05T15:53:38Z"
  },
  {
    "title": "Dollar mauled by Trump trade war; German 'bazooka' blasts bonds - Reuters",
    "description": "Dollar mauled by Trump trade war; German 'bazooka' blasts bondsReuters ‘A really big bazooka’: German defense spending likely to rise after parties agree historic debt changeCNN Germany Shocks Markets by Unleashing BillionsBloomberg Germany's fiscal U-turn co…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176623209",
    "timestamp": "2025-03-05T15:53:37Z"
  },
  {
    "title": "Trump Just Cut Off a Key Tool in Ukraine’s Fight Against Russia",
    "description": "The White House has ordered a pause on intelligence sharing with Kyiv, according to Central Intelligence Agency Director John Ratcliffe. The move is expected to devastate Ukraine’s ability to target Russian forces in its ongoing fight with the dictator-led su…",
    "link": "https://newrepublic.com/post/192349/donald-trump-cut-off-ukraine-intelligence-russia",
    "timestamp": "2025-03-05T15:53:37Z"
  },
  {
    "title": "Supreme Court Rejects Trump Bid to Freeze Billions in Foreign Aid",
    "description": "The Supreme Court declined to overturn a ruling ordering the Trump administration to pay out $2 billion in USAID bills.",
    "link": "http://www.rollingstone.com/politics/politics-news/supreme-court-trump-unfreeze-usaid-payments-1235288893/",
    "timestamp": "2025-03-05T15:53:05Z"
  },
  {
    "title": "Trump Approves Permit Extension for Exxon’s Golden Pass LNG",
    "description": "The Trump administration extended a permit for a major US liquefied natural gas export project Wednesday as the president seeks to follow through on a pledge to supply Asia and other nations with the fuel.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-approves-permit-extension-for-exxons-golden-pass-lng",
    "timestamp": "2025-03-05T15:52:30Z"
  },
  {
    "title": "Crybaby Trump Complains Democrats Didn't Clap For Him",
    "description": "The narcissism of Donald Trump knows no bounds. In a first for any presidential speech to Congress, Trump cried like a baby because Democrats refused to stand and clap for him.\nI kid you not. \nTrump is the most despicable and vile president in history of this…",
    "link": "https://crooksandliars.com/2025/03crybaby-trump-democrats-did-not-clap",
    "timestamp": "2025-03-05T15:52:07Z"
  },
  {
    "title": "Stagflation fears rise as a brutal jobs report follows new tariffs",
    "description": "The odds of the economy slowing while inflation stays fast — stagflation — may be increasing as a new survey showed that U.S. employers drastically curtailed their hiring last month to the slowest pace since July.Read more...",
    "link": "https://qz.com/us-stagflation-jobs-trump-tariffs-economic-slowdown-1851767810",
    "timestamp": "2025-03-05T15:52:00Z"
  },
  {
    "title": "US: Trump delays auto tariffs for a month",
    "description": "The US president revised the 25% tariffs on goods from Canada and Mexico a day after implementing them. Meanwhile, Canada filed a WTO complaint against the new US tariffs. Follow DW for more. White House says autos exempt for one month from Canada, Mexico tar…",
    "link": "https://www.dw.com/en/us-trump-delays-auto-tariffs-for-a-month/live-71837015",
    "timestamp": "2025-03-05T15:51:00Z"
  },
  {
    "title": "US: Supreme Court blocks Trump's freeze of $2 billion in aid",
    "description": "The US Supreme Court denied the administration's request to block payments for the work that foreign organizations have already completed. The dispute is due to continue in lower courts. DW has more. US Supreme Court rejects Trump bid to withold $2 billion in…",
    "link": "https://www.dw.com/en/us-supreme-court-blocks-trumps-freeze-of-2-billion-in-aid/live-71837015",
    "timestamp": "2025-03-05T15:51:00Z"
  },
  {
    "title": "Editorial. Crypto chaos",
    "description": "India should not be thrown off by Trump’s move",
    "link": "https://www.thehindubusinessline.com/opinion/editorial/crypto-chaos/article69294782.ece",
    "timestamp": "2025-03-05T15:50:39Z"
  },
  {
    "title": "Ecology instructor to Congresswoman; all about Melanie Stansbury who held ‘This is Not Normal’ sign during Donald Trump's speech",
    "description": "Donald Trump's address to Congress was met with protests led by Democrat Melanie Stansbury. She held a sign reading 'This is Not Normal,' highlighting opposition to Trump's actions, including ending foreign aid and banning trans athletes. Stansbury, a represe…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/ecology-instructor-to-congresswoman-all-about-melanie-stansbury-who-held-this-is-not-normal-sign-during-donald-trumps-speech/articleshow/118739733.cms",
    "timestamp": "2025-03-05T15:50:36Z"
  },
  {
    "title": "X, Meta and the Great Social Media Meltdown",
    "description": "Social media is unraveling. Brands betting on platforms they own will be the ones left standing.\nContinue reading...",
    "link": "https://www.cmswire.com/digital-marketing/x-meta-and-the-great-social-media-meltdown/",
    "timestamp": "2025-03-05T15:50:09Z"
  },
  {
    "title": "How Trump’s January 6 Pardons Hijacked History",
    "description": "One of President Donald Trump’s first actions in his second term was simple and sweeping: pardoning 1,500 people convicted of offenses related to the January 6, 2021, attack on the US Capitol. That single executive action undid years of work and investigation…",
    "link": "https://www.motherjones.com/politics/2025/03/trump-january-6-riot-investigation-pardons-reveal-audio/",
    "timestamp": "2025-03-05T15:50:04Z"
  },
  {
    "title": "Legal Watchdog: D.C. Police Demand $1.57 Million To Release Jan. 6 Bodycam Footage",
    "description": "The non-profit published a press release outlining the department's demands in response to a Freedom of Information Act (FOIA) lawsuit.",
    "link": "https://thefederalist.com/2025/03/05/legal-watchdog-d-c-police-demand-1-57-million-to-release-jan-6-bodycam-footage/",
    "timestamp": "2025-03-05T15:50:02Z"
  },
  {
    "title": "Academic freedom, excellence, and democracy under siege: how a Nobel peace prize could help defend them",
    "description": "Universities and research are the target of unprecedented attacks in the US, threatening academic freedom. Scientists have created the “Stand up for Science” movement.",
    "link": "https://theconversation.com/academic-freedom-and-democracy-under-siege-how-a-nobel-peace-prize-could-help-defend-them-251494",
    "timestamp": "2025-03-05T15:49:23Z"
  },
  {
    "title": "Howard Lutnick Seems to Walk Back Trump's Hard Stance of Tariffs And Meet Canada, Mexico 'In Middle Some Way'",
    "description": "U.S. Commerce Secretary Howard Lutnick anticipated the possibility that President Donald Trump will announce a reduction of tariffs on Canada and Mexico",
    "link": "https://www.ibtimes.com/howard-lutnick-seems-walk-back-trumps-hard-stance-tariffs-meet-canada-mexico-middle-some-way-3765200",
    "timestamp": "2025-03-05T15:49:20Z"
  },
  {
    "title": "Greenland Maintains It’s ‘Not for Sale’ After Trump Said He Would Get It ‘One Way or the Other’",
    "description": "Greenland's prime minister has issued a harsh rebuke of Donald Trump's desire to acquire Greenland as a US territory after the president said he would get the Denmark-owned land \"one way or the other\" to laughter during Tuesday night's speech to the joint ses…",
    "link": "https://www.mediaite.com/news/greenland-maintains-its-not-for-sale-after-trump-said-he-would-get-it-one-way-or-the-other/",
    "timestamp": "2025-03-05T15:49:16Z"
  },
  {
    "title": "US Supreme Court rejects Trump’s effort to keep US aid frozen",
    "description": "But the US aid tap is not immediately turned back on.",
    "link": "https://www.euractiv.com/section/politics/news/us-supreme-court-rejects-trumps-effort-to-keep-us-aid-frozen/",
    "timestamp": "2025-03-05T15:48:44Z"
  },
  {
    "title": "Schumer: Trump tariff plan 'outrageous policy'",
    "description": "United States Senate Minority Leader Chuck Schumer slammed on Wednesday President Donald Trump's tariff plan, labeling it an \"outrageous policy that hurts the American people.\" Speaking to CNN, Schume...",
    "link": "https://biztoc.com/x/d3e55bec2e4891f3",
    "timestamp": "2025-03-05T15:48:37Z"
  },
  {
    "title": "JD Vance goes on the offensive, and offends, for Trump",
    "description": "Vice-presidents often toil in the shadows. Not so JD Vance, who after just six weeks in the role has managed to rankle politicians from Britain, France, Germany and Romania, as well as officials from the Catholic Church in the U.S.",
    "link": "https://www.cbc.ca/news/world/us-vance-vp-controversies-1.7474214",
    "timestamp": "2025-03-05T15:48:34Z"
  },
  {
    "title": "The Boeing Starliner astronauts are trying to stay out of American politics",
    "description": "Astronauts Barry “Butch” Wilmore and Sunita “Sunny” Williams headed to space on June 5 for an approximately eight-day mission. Now 273 days later, they’re still orbiting around the world on the International Space Station and are ready to return.Read more...",
    "link": "https://qz.com/boeing-starliner-astronauts-musk-trump-spacex-nasa-1851767811",
    "timestamp": "2025-03-05T15:48:29Z"
  },
  {
    "title": "Howard Lutnick Says 'President Definitely Thinks There's A Bitcoin Strategic Reserve'",
    "description": "Commerce Secretary Howard Lutnick has reinforced Donald Trump's pro-crypto stance, hinting at major policy shifts set to be unveiled during Friday's White House crypto summit.\nWhat Happened: In an interview with The Pavlovic Today on Wednesday, Lutnick stated…",
    "link": "https://biztoc.com/x/659c565f6225ac95",
    "timestamp": "2025-03-05T15:48:28Z"
  },
  {
    "title": "Does XRP, SOL or ADA belong in a US crypto reserve?",
    "description": "Bitcoin and Ether were widely expected in a US crypto reserve, but American-made projects like Ripple, Solana and Cardano raise eyebrows.",
    "link": "https://cointelegraph.com/news/xrp-sol-ada-belong-crypto-reserve",
    "timestamp": "2025-03-05T15:48:18Z"
  },
  {
    "title": "China Issues War Warning to US: 'Ready To Fight Till the End'",
    "description": "China has reiterated its readiness to \"fight till the end\" after President Donald Trump's administration escalated its trade war with the country, the U.S.'s third-largest trade partner.\nNewsweek has reached out to the White House with a written request for c…",
    "link": "https://biztoc.com/x/e48bae0c4c5ce1c6",
    "timestamp": "2025-03-05T15:48:06Z"
  },
  {
    "title": "Smotrich arrives in DC for key US-Israel economic talks",
    "description": "Finance Minister Bezalel Smotrich arrived in Washington DC for a meeting at the US Treasury Department on Wedn",
    "link": "https://www.jpost.com/breaking-news/article-844839",
    "timestamp": "2025-03-05T15:47:58Z"
  },
  {
    "title": "Nine things about Lesotho - the country 'nobody has ever heard of'",
    "description": "Lesotho is called the kingdom in the sky - it is the only country entirely above 1,000m.",
    "link": "https://www.bbc.com/news/articles/czdnv6gpezjo",
    "timestamp": "2025-03-05T15:47:56Z"
  },
  {
    "title": "Trump’s message to Congress: This is a presidency by billionaires, for billionaires",
    "description": "Forty-three days after taking office for the second time, President Donald Trump delivered a joint address to Congress on Tuesday, in the same chamber that an angry mob of his supporters ransacked four years earlier in an attempt to overthrow the government. …",
    "link": "https://biztoc.com/x/2d088a82f4d93ea6",
    "timestamp": "2025-03-05T15:47:56Z"
  },
  {
    "title": "Canadians are saying no to American liquor, cancelling USA vacations after Trump said THIS in his speech",
    "description": "Trump's recent comments in his speech to Congress have left Canadians furious. Many have taken to social media to declare they're 'done' with American goods and holidays. Trump's decision to impose tariffs on Canada have deeply strained the relationship betwe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-speech-congress-canadians-are-removing-american-liquor-cancelling-usa-vacations-after-trump-said-this-thing-in-his-speech/articleshow/118739728.cms",
    "timestamp": "2025-03-05T15:47:41Z"
  },
  {
    "title": "US supreme court rules that Trump cannot withhold payment to foreign aid groups",
    "description": "Ruling upholds district judge’s order for administration to release funding from USAID",
    "link": "https://www.irishtimes.com/world/us/2025/03/05/us-supreme-court-rules-that-trump-cannot-withhold-payment-to-foreign-aid-groups/",
    "timestamp": "2025-03-05T15:47:31Z"
  },
  {
    "title": "Canada won't scrap tariffs unless all U.S. levies are lifted, official says",
    "description": "Ottawa is not open to lifting its full package of retaliatory tariffs if the U.S. leaves any tariffs on Canada in place. Find out more.",
    "link": "https://financialpost.com/news/economy/canada-wont-scrap-tariffs-unless-all-us-levies-lifted",
    "timestamp": "2025-03-05T15:47:26Z"
  },
  {
    "title": "Canada Won’t Scrap Tariffs Unless All US Levies Are Lifted, Official Says",
    "description": "Prime Minister Justin Trudeau is not open to lifting Canada’s full package of retaliatory tariffs if US President Donald Trump leaves any tariffs on Canada in place, according to a senior Canadian government official.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-wont-scrap-tariffs-unless-all-us-levies-are-lifted-official-says",
    "timestamp": "2025-03-05T15:47:26Z"
  },
  {
    "title": "Seven ways of looking at Elon Musk",
    "description": "Elon Musk and his Department of Government Efficiency have been rampaging through the federal government. But before he was letting his DOGE team accidentally fire nuclear safety workers and declaring that he loved Donald Trump “as much as a straight man can …",
    "link": "https://www.vox.com/politics/402493/elon-musk-history-trump-politics",
    "timestamp": "2025-03-05T15:47:01Z"
  },
  {
    "title": "Ex-ambassadors warn of sharing intelligence with US",
    "description": "One former diplomat tells a parliamentary committee some in the Trump administration have \"strange track records\".",
    "link": "https://www.bbc.com/news/articles/cvgwnjdzz7eo",
    "timestamp": "2025-03-05T15:46:27Z"
  },
  {
    "title": "'Way, way off': CNN fact checker points to Trump lie that 'stuck out the most' in speech",
    "description": "CNN's Daniel Dale fact-checked president Donald Trump's congressional address, but he said one lie in particular stuck out.The president gloated over the changes he's implemented during his first 43 days in office in a historically long, nearly 100-minute add…",
    "link": "https://www.rawstory.com/donald-trump-social-security-fraud/",
    "timestamp": "2025-03-05T15:46:26Z"
  },
  {
    "title": "The U.S. is appointing an 'affordability czar' — here’s what that means for you",
    "description": "As the federal government vows to to tackle rising prices, there are key steps consumers can take to bring monthly costs down.",
    "link": "https://www.cnbc.com/2025/03/05/the-us-is-getting-an-affordability-czar-what-that-means-for-you.html",
    "timestamp": "2025-03-05T15:45:33Z"
  },
  {
    "title": "U.S. and Israel dismiss $53B plan endorsed by Arab states to rebuild Gaza, prevent mass displacement",
    "description": "The United States and Israel have both rejected an alternative plan to rebuild Gaza after it was adopted by Arab states at a summit on Tuesday.",
    "link": "https://www.cbc.ca/news/world/usa-israel-gaza-cairo-summit-arab-plan-1.7475019",
    "timestamp": "2025-03-05T15:45:06Z"
  },
  {
    "title": "ISIS-K member confessed to scouting Abbey Gate attack route, training Moscow attackers: affidavit",
    "description": "An ISIS-K member arrested following the 2021 Abbey Gate bombing in Afghanistan confessed to scouting the attack route, the Justice Department said.",
    "link": "https://www.foxnews.com/politics/isis-k-member-confessed-scouting-abbey-gate-attack-route-training-moscow-attackers-affidavit",
    "timestamp": "2025-03-05T15:42:00Z"
  },
  {
    "title": "FACT CHECK: Did Zelenskyy Use An Expletive In Reference To Trump Ahead Of Downing Street Meeting?",
    "description": "A viral video shared on X claims Ukrainian President Volodymyr Zelenskyy purportedly used an expletive in reference to President Donald Trump ahead of a recent meeting with U.K. Prime Minister Keir Starmer on Downing Street. Zelensky burning a very big bridge…",
    "link": "https://checkyourfact.com/2025/03/05/fact-check-zelenskyy-expletive-trump-downing-street-meeting/",
    "timestamp": "2025-03-05T15:40:57Z"
  },
  {
    "title": "Trump administration cuts off intelligence sharing with Ukraine",
    "description": "CIA director John Ratcliffe says the move will \"put the world in a better place for these peace negotiations to move forward\", with the move coming amid deteriorating relations between Washington DC and Kyiv.",
    "link": "https://www.abc.net.au/news/2025-03-06/trump-zelenskyy-intelligence-sharing-war-ukraine-putin-russia/105016086",
    "timestamp": "2025-03-05T15:40:04Z"
  },
  {
    "title": "FACT CHECK: No, Trump Did Not Make A Truth Social Post About Cardano Cryptocurrency",
    "description": "A viral image shared on X purports to show a TRUTH Social post from President Donald Trump about Cardano cryptocurrency. NO FREAKING WAY pic.twitter.com/XwGS1B8jMe — TapTools (@TapTools) March 3, 2025 Verdict: False The image was shared by Cardano trading acc…",
    "link": "https://checkyourfact.com/2025/03/05/fact-check-trump-post-cardano-cryptocurrency/",
    "timestamp": "2025-03-05T15:39:12Z"
  },
  {
    "title": "AG Pam Bondi vows to ‘root out’ Trump critics in the Justice Department",
    "description": "The Justice Department has already engaged in partisan purges of law enforcement personnel. The attorney general appears eager to make matters worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ag-pam-bondi-vows-root-trump-critics-justice-department-rcna194877",
    "timestamp": "2025-03-05T15:39:09Z"
  },
  {
    "title": "China Issues War Warning to US: 'Ready To Fight Till the End'",
    "description": "The Trump administration has doubled its blanket tariff on Chinese goods and launched trade wars against Canada and Mexico.",
    "link": "https://www.newsweek.com/china-issues-war-warning-trade-2039821",
    "timestamp": "2025-03-05T15:38:45Z"
  },
  {
    "title": "Palestinians, Israel eye Arab League plan for postwar Gaza",
    "description": "With the current ceasefire and hostage release deal between Israel and Hamas stalled, Arab leaders say they have a plan to rebuild Gaza. The proposal has several built-in challenges, and reactions so far are mixed.",
    "link": "https://www.dw.com/en/palestinians-israel-eye-arab-league-plan-for-postwar-gaza/a-71833142",
    "timestamp": "2025-03-05T15:38:00Z"
  },
  {
    "title": "Zelensky says lasting peace 'achievable'",
    "description": "Ukrainian President Zelensky remains hopeful for a lasting peace despite the recent suspension of US military aid and intelligence sharing. The Kremlin views Kyiv's readiness for talks positively, but doubts linger about possible negotiations with President P…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelensky-says-lasting-peace-achievable/articleshow/118739683.cms",
    "timestamp": "2025-03-05T15:37:55Z"
  },
  {
    "title": "Trump's tariffs drive US physical market aluminium premiums to record high",
    "description": "By Pratima Desai\nLONDON (Reuters) - Price premiums for aluminium on the physical market in the United States have surged to a record high due to the looming threat of tariffs on imports of the metal used in the transport, construction and packaging industries…",
    "link": "https://biztoc.com/x/b4514aa42eb48b54",
    "timestamp": "2025-03-05T15:37:34Z"
  },
  {
    "title": "President Trump is Undoing Biden’s Economic Damage",
    "description": "President Donald J. Trump took office on a promise to lower costs for the American people — and the actions he has taken are already paying off while the work continues to turn back the economic plague unleashed by the Biden Administration.\n- President Trump …",
    "link": "https://biztoc.com/x/09051311ae9ed940",
    "timestamp": "2025-03-05T15:37:07Z"
  },
  {
    "title": "Bitcoin surges back to $88,000 as Trump eyes special status in his strategic crypto reserve",
    "description": "Despite fierce backlash from the cryptocurrency community over hisproposed strategic crypto reserve, President Donald Trump is set to unveil plans for it at the White House Crypto Summit on Friday. Commerce Secretary Howard Lutnick saidBitcoin would receive a…",
    "link": "https://qz.com/bitcoin-price-trump-strategic-cryptocurrency-reserve-1851767813",
    "timestamp": "2025-03-05T15:37:00Z"
  },
  {
    "title": "WATCH LIVE: Mayors testify before Congress on ‘sanctuary cities’",
    "description": "Mayors from Boston, Chicago, Denver and New York will appear Wednesday before the Committee on Oversight and Government Accountability over their cities' policies restricting authorities' cooperation with federal enforcement.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-mayors-testify-before-congress-on-sanctuary-cities",
    "timestamp": "2025-03-05T15:36:23Z"
  },
  {
    "title": "Target hit with 40-day boycott over DEI reversal — despite protests from black business owners",
    "description": "It's a triple whammy for the retailer as it emerges from a brutal year plagued by low spending and prepares for possible cost increases under President Trump’s tariffs.",
    "link": "https://nypost.com/2025/03/05/business/target-faces-40-day-boycott-amid-spending-slump-tariffs/",
    "timestamp": "2025-03-05T15:36:09Z"
  },
  {
    "title": "Decoding Bitcoin sells off as Donald Trump's tariffs take effect",
    "description": "Over $3.50 billion in assets have been withdrawn by investors from the Spot Bitcoin exchange-traded funds (ETF) in the US since February 3. Bitcoin was trading at around $86,400 on early Wednesday, seeing a 15 percent decline since Monday. This follows Donald…",
    "link": "https://economictimes.indiatimes.com/news/international/us/decoding-bitcoin-sells-off-as-donald-trumps-tariffs-take-effect/articleshow/118739650.cms",
    "timestamp": "2025-03-05T15:35:36Z"
  },
  {
    "title": "Europe will need thousands more tanks and troops to mount a credible military defence without the US",
    "description": "Europe depends heavily on US and Nato military support for its defence.",
    "link": "https://theconversation.com/europe-will-need-thousands-more-tanks-and-troops-to-mount-a-credible-military-defence-without-the-us-251499",
    "timestamp": "2025-03-05T15:35:20Z"
  },
  {
    "title": "Hate has no home here – except for antisemitism",
    "description": "Since the beginning of the current war with Hamas, the Progressive Left has harnessed imagery and 'linkage' to foment Jew-hatred at levels not seen since the Holocaust. Opinion.",
    "link": "https://www.israelnationalnews.com/news/404913",
    "timestamp": "2025-03-05T15:34:00Z"
  },
  {
    "title": "Google Begs the Trump DOJ to Not Break It Up: Report",
    "description": "With a judge set to rule on a significant antitrust case, the search giant is seeking favor with the Trump administration.",
    "link": "https://www.vanityfair.com/news/story/google-report-begs-trump-doj-to-not-break-it-up",
    "timestamp": "2025-03-05T15:33:45Z"
  },
  {
    "title": "The billionaire elite who answered Donald Trump’s call on Panama Canal - Financial Times",
    "description": "The billionaire elite who answered Donald Trump’s call on Panama CanalFinancial Times Trump says U.S. is 'reclaiming' Panama Canal after BlackRock strikes deal to buy portsNBC News Hong Kong firms sells major Panama Canal ports to US firm after Trump pressure…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176623075",
    "timestamp": "2025-03-05T15:33:19Z"
  },
  {
    "title": "The Democratic Leader You Did Not Know We Had",
    "description": "Joan Walsh\n\n\n\nOakland’s Lateefah Simon, following in Barbara Lee’s footsteps, “prebutted” Trump’s creepy Tuesday address.\r\n\n\r\n\n\nThe post The Democratic Leader You Did Not Know We Had appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/lateefah-simon-wfp-2025-response/",
    "timestamp": "2025-03-05T15:32:42Z"
  },
  {
    "title": "Cornwall businesses contend with fractured cross-border ties",
    "description": "A day into the Trump administration's sweeping tariffs on Canadian goods, businesses in the city of Cornwall, Ont., are struggling to maintain ties with their cross-border neighbours.",
    "link": "https://www.cbc.ca/news/canada/ottawa/cornwall-businesses-contend-with-fractured-cross-border-ties-1.7474472",
    "timestamp": "2025-03-05T15:31:34Z"
  },
  {
    "title": "Democrat takes shot at Trump after President mentions her name during big speech",
    "description": "Georgia Democrat Stacey Abrams hit back at Donald Trump's accusation that the two-time nominee for governor was a paragon of wasteful government spending.\nDuring Tuesday night's address to Congress, Trump \"rattled off a list of questionable projects that rece…",
    "link": "https://www.rawstory.com/stacey-abrams-on-donald-trump/",
    "timestamp": "2025-03-05T15:30:57Z"
  },
  {
    "title": "Inside The Chamber: As Democrats Get Caustic, Donald Trump Goes For His Greatest Hits",
    "description": "Donald Trump’s address to a joint session of Congress was about what you would expect it to be: full of boasts and grand pronouncements, laced with long-debunked claims and sprinkled with moments for reality TV attention spans. In the chamber, the atmosphere …",
    "link": "http://deadline.com/2025/03/trump-joint-session-of-congress-reaction-1236311485/",
    "timestamp": "2025-03-05T15:30:47Z"
  },
  {
    "title": "Panama president calls Trump’s talk of ‘reclaiming’ the Panama Canal a lie",
    "description": "Panama maintains that it has full control over the canal and that the Hong Kong-based group’s operation of the ports did not amount to Chinese control.",
    "link": "https://www.bostonherald.com/2025/03/05/panama-president-trump-lied-canal/",
    "timestamp": "2025-03-05T15:30:29Z"
  },
  {
    "title": "Florida Opens Criminal Investigation Into Andrew Tate and His Brother",
    "description": "\"These guys have themselves publicly admitted to participating in what very much appears to be soliciting, trafficking, preying upon women around the world.\"",
    "link": "https://gizmodo.com/florida-opens-criminal-investigation-into-andrew-tate-and-his-brother-2000572004",
    "timestamp": "2025-03-05T15:30:22Z"
  },
  {
    "title": "Ethereum 2025 Price Prediction as Trump Announces US Crypto Reserve",
    "description": "Following its inclusion in Donald Trump’s newly announced US Crypto Reserve, Ethereum’s price prediction for 2025 has become one of the hottest topics of debate among crypto enthusiasts and pundits. While a vast majority is expecting $ETH to ride the positive…",
    "link": "http://www.newsbtc.com/news/ethereum-2025-price-prediction-as-trump-announces-us-crypto-reserve/",
    "timestamp": "2025-03-05T15:30:18Z"
  },
  {
    "title": "Supreme Court Rejects Trump on USAID Foreign-Aid Freeze (Greg Stohr/Bloomberg)",
    "description": "Greg Stohr / Bloomberg:\nSupreme Court Rejects Trump on USAID Foreign-Aid Freeze  — Court reinstates order to quickly pay as much as $2 billion  — Roberts and Barrett join liberal justices in 5-4 majority  —  The US Supreme Court dealt a blow to President Dona…",
    "link": "https://www.memeorandum.com/250305/p49",
    "timestamp": "2025-03-05T15:30:01Z"
  },
  {
    "title": "Trump vows to press ahead; LeBron James hits new milestone | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_0d558c8f-bb8b-5581-bbab-6142bb57fe72.html",
    "timestamp": "2025-03-05T15:30:00Z"
  },
  {
    "title": "Trump vows to press ahead; LeBron James hits new milestone | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_7cf25e44-3898-581d-9509-5c84a32ede50.html",
    "timestamp": "2025-03-05T15:30:00Z"
  },
  {
    "title": "Supreme Court Ruling on Foreign Aid Shows 'Trump Cannot Ignore the Law'",
    "description": "The U.S. Supreme Court delivered at least a temporary blow to President Donald Trump on Wednesday by refusing to overrule a lower court order that said approximately $2 billion in U.S. foreign aid funding ordered frozen by the administration should be resumed…",
    "link": "https://www.commondreams.org/news/supreme-court-ruling-on-foreign-aid-shows-trump-cannot-ignore-the-law",
    "timestamp": "2025-03-05T15:29:51Z"
  },
  {
    "title": "Seven People Stand Trial In Paris Over Online Threats & Insults Against Paris Olympics Ceremonies Director Thomas Jolly",
    "description": "Seven people were due to stand trial in Paris on Wednesday on charges of making death threats and cyberbullying against director Thomas Jolly in the wake of his controversial Paris 2024 Olympics opening ceremony last July. French media reported that six men, …",
    "link": "http://deadline.com/2025/03/seven-people-paris-trial-threats-insults-paris-olympics-ceremony-thomas-jolly-1236311525/",
    "timestamp": "2025-03-05T15:28:53Z"
  },
  {
    "title": "Trump’s Speech Was Full of Broken Promises, Lies, and Warnings of More Damage for Women and Families",
    "description": "Trump’s address to Congress was filled with falsehoods, broken promises and attacks on women and families, signaling more harmful policies ahead. He pushed tax cuts for the wealthy at the expense of essential programs like Medicaid and Social Security, ramped…",
    "link": "https://msmagazine.com/2025/03/05/trump-speech-lies-threats-women-families/",
    "timestamp": "2025-03-05T15:28:15Z"
  },
  {
    "title": "‘This you?’: MTG’s old Biden heckling flagged after Al Green kicked out of Trump speech",
    "description": "Democrats online are accusing the GOP of hypocrisy after Rep. Al Green (D-Texas) was removed from President Donald Trump’s speech to Congress last night for interrupting the address—something Reps. Marjorie Taylor Greene (R-Ga.) and Lauren Boebert (R-Colo.) r…",
    "link": "https://www.dailydot.com/debug/al-green-mtg-trump-speech/",
    "timestamp": "2025-03-05T15:28:10Z"
  },
  {
    "title": "US suspends intelligence sharing with Ukraine",
    "description": "CIA Director John Ratcliffe confirms US 'pause' in intelligence sharing with Kyiv amid tensions between allies.",
    "link": "https://www.aljazeera.com/news/2025/3/5/us-suspends-intelligence-sharing-with-ukraine",
    "timestamp": "2025-03-05T15:27:53Z"
  },
  {
    "title": "Zelenskiy Says He's Ready to Work With US to End Ukraine War",
    "description": "President Volodymyr Zelenskiy said that he’s ready to work speedily to end Russia’s war on Ukraine, stressing that his dramatic falling out with US President Donald Trump over the path toward peace was “regrettable.”\n“I would like to reiterate Ukraine’s commi…",
    "link": "https://biztoc.com/x/fadf015aab656b2a",
    "timestamp": "2025-03-05T15:25:53Z"
  },
  {
    "title": "Working-Class Unity Key to Defeating Oligarchy, Says Sanders in Response to Trump SOTU",
    "description": "If working-class people in the United States were wondering why President Donald Trump had \"very little to say about the REAL crises facing the working class of this country\" in his State of the Union address, said U.S. Sen. Bernie Sanders Tuesday night, they…",
    "link": "https://www.commondreams.org/news/is-the-us-an-oligarchy",
    "timestamp": "2025-03-05T15:25:44Z"
  },
  {
    "title": "Donald Trump Suffers Supreme Court Setback On Foreign Aid",
    "description": "The Supreme Court has upheld a federal judge's order requiring Trump's administration to pay foreign aid organizations for work they have already performed.",
    "link": "https://biztoc.com/x/2aa9013bb747913b",
    "timestamp": "2025-03-05T15:25:43Z"
  },
  {
    "title": "Inside ‘Anora’s’ Oscar Victory: How Scrappy Indie Neon Pulled Off Its Second Best Picture Win in 5 Years",
    "description": "In the run-up to the Academy Awards, Neon took a unique approach to scoring the season’s top prize for “Anora.” While other studios spent their money on tried-and-true strategies, from tastemaker screenings to glossy ads, Neon pulled up a tow truck in front o…",
    "link": "https://variety.com/2025/film/news/anora-oscar-win-neon-awards-strategy-sex-worker-screenings-thongs-1236327977/",
    "timestamp": "2025-03-05T15:25:18Z"
  },
  {
    "title": "Trump to Congress: America is back",
    "description": "US President Donald Trump addressed a joint session of Congress six weeks after beginning his second term in office. In addition to listing his achievements while in office, he made a teenager a US Secret Service agent and reaffirmed his desire for Greenland …",
    "link": "https://www.bbc.co.uk/programmes/w172zb9dtwqxhv6",
    "timestamp": "2025-03-05T15:25:00Z"
  },
  {
    "title": "China, reacting to Trump tariffs, promises to 'fight till the end' in trade war 'or any other type of war'",
    "description": "China is warning that it is ready for any \"type\" of war with the U.S. in response to President Donald Trump's tariffs against the communist nation.",
    "link": "https://www.foxnews.com/politics/china-reacting-trump-tariffs-promises-fight-till-end-trade-war-or-any-other-type-war",
    "timestamp": "2025-03-05T15:24:49Z"
  },
  {
    "title": "Democrats mercilessly mocked for protesting Trump speech with paddles: ‘It is giving bingo!’",
    "description": "Democrats have been mercilessly mocked for protesting President Trump’s address to Congress with paddles — with even left-leaning TV hosts among those roasting lawmakers for bringing “Brazilian steak house” and “bingo” vibes. The Democratic lawmakers were tro…",
    "link": "https://freerepublic.com/focus/f-news/4302235/posts",
    "timestamp": "2025-03-05T15:24:47Z"
  },
  {
    "title": "Manitoba Legislature resumes in shadow of U.S. tariff fallout",
    "description": "Politicians are set to return to the Manitoba legislative chamber today amid economic fallout from U.S. tariffs and ongoing challenges in provincial health care.",
    "link": "https://www.cbc.ca/news/canada/manitoba/manitoba-legislature-resumes-tariff-fallout-1.7475035",
    "timestamp": "2025-03-05T15:23:37Z"
  },
  {
    "title": "BlackRock’s $23-billion deal to strengthen US control over Panama Canal Ports, global trade sees rising American presence in other strategic assets",
    "description": "BlackRock-led consortium acquires Panama ports, potentially extending US control over strategic assets on key trade routes.",
    "link": "https://www.thehindubusinessline.com/news/world/blackrocks-23-billion-deal-to-strengthen-us-control-over-panama-canal-ports-global-trade-sees-rising-american-presence-in-other-strategic-assets/article69295138.ece",
    "timestamp": "2025-03-05T15:22:36Z"
  },
  {
    "title": "Trump Advisor Mike Waltz Predicts ‘We’re Going to See Some Movement’ After ‘Good Talks’ With Ukrainian Leader",
    "description": "National Security Advisor Mike Waltz revealed Wednesday that negotiations between the U.S. and Ukraine could resume in the near future.\nThe post Trump Advisor Mike Waltz Predicts ‘We’re Going to See Some Movement’ After ‘Good Talks’ With Ukrainian Leader firs…",
    "link": "https://www.mediaite.com/news/trump-advisor-mike-waltz-predicts-were-going-to-see-some-movement-after-good-talks-with-ukrainian-leader/",
    "timestamp": "2025-03-05T15:22:31Z"
  },
  {
    "title": "NFT ETF 'Unlikely' as Investors Still Think They’re ‘Nonsense’, Experts Say",
    "description": "Experts debunked rumors that an NFT ETF is on the way, explaining that traditional investors think the asset class is “nonsense.”",
    "link": "https://decrypt.co/308714/nft-etf-unlikely-experts",
    "timestamp": "2025-03-05T15:22:17Z"
  },
  {
    "title": "Watch Live: Hearing on Facing Rising Antisemitism in America",
    "description": "The Senate Judiciary Committee holds a hearing on addressing the rise of antisemitism in America on Wednesday, March 5.\nThe post Watch Live: Hearing on Facing Rising Antisemitism in America appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/05/watch-live-hearing-on-facing-rising-antisemitism-in-america/",
    "timestamp": "2025-03-05T15:21:21Z"
  },
  {
    "title": "Zelensky Says Lasting Peace 'Achievable'",
    "description": "Ukrainian President Volodymyr Zelensky said Wednesday that a lasting peace was \"entirely achievable\" as the Kremlin called it \"positive\" that Kyiv was professing its readiness for talks on ending the three-year war.",
    "link": "https://www.ibtimes.com/zelensky-says-lasting-peace-achievable-3765192",
    "timestamp": "2025-03-05T15:21:20Z"
  },
  {
    "title": "Nvidia CEO Jensen Huang has a personal AI tutor with him all the time. Here's why he says everyone should opt for it",
    "description": "Nvidia CEO Jensen Huang revealed that he carries a personal AI tutor with him all the time and said everyone would benefit by opting for it. He uses it daily to learn about a multitude of subjects, including digital biology, he explained. He had earlier said …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-nvidia-ceo-jensen-huang-has-a-personal-ai-tutor-with-him-all-the-time-he-says-everyone-should-opt-for-it/articleshow/118739427.cms",
    "timestamp": "2025-03-05T15:20:50Z"
  },
  {
    "title": "His Hair Is Greasy. His Eyes Are Bulging. I Think I’m in Love.",
    "description": "“Hot” hasn’t historically been how Walton Goggins has been described. Then his brooding, depressive White Lotus character came along.",
    "link": "https://slate.com/life/2025/03/white-lotus-cast-season-3-hbo-walton-goggins-rick-hatchett.html",
    "timestamp": "2025-03-05T15:20:08Z"
  },
  {
    "title": "Trump to Decide on Canada, Mexico Relief Today, Lutnick Says (Bloomberg)",
    "description": "Bloomberg:\nTrump to Decide on Canada, Mexico Relief Today, Lutnick Says  — Commerce Secretary sees relief for USMCA compliant goods  — Trump had slapped 25% tariffs on Mexico, most Canada goods  —  President Donald Trump is set to announce changes to the tari…",
    "link": "https://www.memeorandum.com/250305/p46",
    "timestamp": "2025-03-05T15:20:01Z"
  },
  {
    "title": "Editor Daily Rundown: President Trump Highlights Achievements In Joint Address To Congress",
    "description": "TRUMP ABSOLUTELY CRUSHES IT IN JOINT ADDRESS TO CONGRESS ... DEFEATED DEMS THROW LIMP-WRISTED TANTRUM ... Trump Overpowers Democrat Protests With Verbal Highlight Reel Of First Six Weeks In Office (VIDEOS)\n\nDemocrats protested en masse as President Donald Tru…",
    "link": "https://dailycaller.com/2025/03/05/president-donald-trump-touts-achievements-address-joint-session-congress-democrats-protest/",
    "timestamp": "2025-03-05T15:19:20Z"
  },
  {
    "title": "Trump’s budget balancing plan: A mixed bag for India, say economists",
    "description": "US efforts to balance the budget could slow US economic growth, potentially dampening demand for Indian exports; it could however spur services with US focused on improving its onshore manufacturing share",
    "link": "https://www.thehindubusinessline.com/economy/trumps-budget-balancing-plan-a-mixed-bag-for-india-say-economists/article69295308.ece",
    "timestamp": "2025-03-05T15:19:14Z"
  },
  {
    "title": "Hunters International gang claims the theft of 1.4 TB of data allegedly stolen from Tata Technologies",
    "description": "Ransomware group Hunters International claims to have hacked Tata Technologies, threatening to leak 1.4 TB of stolen data. The Hunters International ransomware group claimed to have breached the Indian multinational technology company Tata Technologies, a Tat…",
    "link": "https://securityaffairs.com/174953/data-breach/ransomware-group-hunters-international-claims-to-have-hacked-tata-technologies.html",
    "timestamp": "2025-03-05T15:18:40Z"
  },
  {
    "title": "Zelensky says lasting peace ‘achievable’",
    "description": "Ukrainian President Volodymyr Zelensky said Wednesday that a lasting peace was “entirely achievable” as the Kremlin called it “positive” that Kyiv was professing its readiness for talks on ending the three-year war. Zelensky has been scrambling to contain the…",
    "link": "https://www.digitaljournal.com/world/zelensky-says-lasting-peace-achievable/article",
    "timestamp": "2025-03-05T15:18:26Z"
  },
  {
    "title": "MAGA Loses It Over Democratic Protests During Trump’s Speech",
    "description": "The MAGA faithful were not happy with how Democrats in Congress reacted to Donald Trump’s speech Tuesday night.\r\nDemocrats protested Trump in different ways, whether it was Representative Melanie Stansbury holding up a protest sign as Trump walked into the ch…",
    "link": "https://newrepublic.com/post/192343/maga-reaction-democrat-protests-trump-speech-congress",
    "timestamp": "2025-03-05T15:17:51Z"
  }
]