[
  {
    "title": "Japan's smaller firms say they are ready to adapt to Trump tariffs",
    "description": "Millions of small- and medium-sized firms that make up 99.7% of Japan's companies are world-class in their specialist niche, giving rise to confidence about weathering tariffs.",
    "link": "https://www.japantimes.co.jp/business/2025/07/18/companies/japan-smes-trump-tariffs/",
    "timestamp": "2025-07-18T06:15:00Z"
  },
  {
    "title": "Epstein files are a new crisis for Donald Trump, as supporters blowtorch their Maga caps",
    "description": "Many in the Maga movement are furious over Trump’s failure to release the Epstein files. Now he may be relenting",
    "link": "https://www.irishtimes.com/world/us/2025/07/18/epstein-files-are-a-new-crisis-for-donald-trump-as-supporters-blowtorch-their-maga-caps/",
    "timestamp": "2025-07-18T06:09:56Z"
  },
  {
    "title": "Trump threatens to sue WSJ, Murdoch over story on alleged 2003 letter to Epstein",
    "description": "U.S. President Donald Trump threatened to sue The Wall Street Journal and owner Rupert Murdoch Thursday over a story about an alleged off-color letter he wrote to Jeffrey Epstein, amid lingering political fallout over his administration's handling of the late…",
    "link": "https://www.hurriyetdailynews.com/trump-threatens-to-sue-wsj-murdoch-over-story-on-alleged-2003-letter-to-epstein-211598",
    "timestamp": "2025-07-18T06:04:05Z"
  },
  {
    "title": "Mexico or Vietnam? TV industry weighs costs as Trump revamps tariffs",
    "description": "As part of a dramatic realignment in trade policy, US President Donald Trump has imposed a 30% tariff on goods imported from Mexico while reducing tariffs on Vietnamese exports to the US from 46% to 20%. The move is part of a newly announced \"tariff framework…",
    "link": "https://www.digitimes.com/news/a20250718PD210/mexico-tv-policy-donald-trump-asia.html",
    "timestamp": "2025-07-18T06:00:39Z"
  },
  {
    "title": "Trump directs DOJ to unseal the secret Epstein files; names, flight logs, and jury bombshells could explode into public view",
    "description": "Amidst growing pressure, President Trump has instructed the Justice Department to release pertinent grand jury testimony related to Jeffrey Epstein, a move that follows public criticism and demands for transparency. This directive comes amidst Trump's denial …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-directs-doj-to-unseal-the-secret-epstein-files-names-flight-logs-and-jury-bombshells-could-explode-into-public-view/articleshow/122735331.cms",
    "timestamp": "2025-07-18T06:00:38Z"
  },
  {
    "title": "US Congress approves $9 bln in Trump cuts to foreign aid, public media",
    "description": "U.S. Republicans early Friday approved President Donald Trump's plan to cancel $9 billion in funding for foreign aid and public broadcasting, vowing it was just the start of broader efforts by Congress to slash the federal budget.",
    "link": "https://www.hurriyetdailynews.com/us-congress-approves-9-bln-in-trump-cuts-to-foreign-aid-public-media-211597",
    "timestamp": "2025-07-18T06:00:25Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s $1 trillion AI data center boom strains Texas grid â\u0080\u0094 nuclear power eyed as solution",
    "description": "Texas Power Grid Under Strain: Trump’s $1 trillion AI data center push risks overwhelming Texas’ grid, already strained by extreme weather and rising demand; ERCOT warns of insufficient capacity for high-intensity computing facilities. AI Energy Demands Outpa…",
    "link": "https://www.naturalnews.com/2025-07-18-trumps-trillion-ai-data-center-strains-texas-grid.html",
    "timestamp": "2025-07-18T06:00:00Z"
  },
  {
    "title": "Trump threatens 100% “secondary tariffs” on Russia if Ukraine deal is not reached in 50 days",
    "description": "President Donald Trump has threatened to impose secondary tariffs of up to 100 percent on countries such as China, India, Brazil, Turkey and Germany if they continue buying Russian oil and no Ukraine peace deal is reached within 50 days. Trump expressed disap…",
    "link": "https://www.naturalnews.com/2025-07-18-trump-threatens-aggressive-secondary-tariffs-on-russia.html",
    "timestamp": "2025-07-18T06:00:00Z"
  },
  {
    "title": "Major U.S. banks eye stablecoin experiment as crypto regulations shift",
    "description": "Bank of America, Citigroup, Morgan Stanley and JPMorgan Chase are exploring stablecoin launches amid regulatory changes. President Trump’s crypto-friendly policies and pending legislation aim to clarify rules for digital assets. Legal uncertainty and low curr…",
    "link": "https://www.naturalnews.com/2025-07-18-us-banks-eye-stablecoin-experiment-crypto-regulations-shift.html",
    "timestamp": "2025-07-18T06:00:00Z"
  },
  {
    "title": "Global divide over Gaza escalates as U.S., BRICS clash on Israelâ\u0080\u0099s plans",
    "description": "U.S.-Israel talks intensify as Netanyahu presents Gaza depopulation plan, facing global condemnation. BRICS nations denounce U.S.-backed military actions, aligning with Global South against Western hegemony. Human rights groups condemn Gaza proposals as “ethn…",
    "link": "https://www.naturalnews.com/2025-07-18-global-divide-over-gaza-escalates-as-u-s-brics-clash-on-israels-plans.html",
    "timestamp": "2025-07-18T06:00:00Z"
  },
  {
    "title": "Mike Adams and Alex Jones: WOKEISM has crippled U.S. AI development, giving China the lead",
    "description": "Mike Adams criticized OpenAI as monopolistic and “closed,” contrary to its name, supporting Elon Musk’s critiques of its lack of transparency. China’s release of the DeepSeek AI model as open-source democratizes AI technology, fostering global innovation and …",
    "link": "https://www.naturalnews.com/2025-07-18-adams-jones-wokeism-crippled-us-ai-development.html",
    "timestamp": "2025-07-18T06:00:00Z"
  },
  {
    "title": "GOP lawmakers slam rising CRIME and DECAY in the District of Columbia",
    "description": "Republican lawmakers, including Reps. Brandon Gill (TX) and Tim Burchett (TN), describe Washington, D.C., as a “Third World hellhole,” citing rampant crime, homelessness and neglect near the Capitol that endanger residents, officials and tourists. Burchett wa…",
    "link": "https://www.naturalnews.com/2025-07-18-gop-lawmakers-slam-rising-crime-decay-dc.html",
    "timestamp": "2025-07-18T06:00:00Z"
  },
  {
    "title": "U.S. election security stalls as experts demand long-unaddressed cryptographic fixes",
    "description": "Voting systems remain vulnerable due to unresolved 2006 security flaws, including a lack of cryptographic safeguards. A former auditor reveals how outdated machines enable vote duplication and ballot tampering. A 2020 Michigan voting error highlighted how tec…",
    "link": "https://www.naturalnews.com/2025-07-18-us-election-security-stalls-experts-demand-cryptographic-fixes.html",
    "timestamp": "2025-07-18T06:00:00Z"
  },
  {
    "title": "Israeli strike on Gaza's only Catholic church kills three",
    "description": "An Israeli strike on Gaza's only Catholic church killed three people on Thursday, the Latin Patriarchate of Jerusalem said, as Israel said it \"never targets\" religious sites and regretted any harm to civilians.",
    "link": "https://www.hurriyetdailynews.com/israeli-strike-on-gazas-only-catholic-church-kills-three-211596",
    "timestamp": "2025-07-18T05:55:33Z"
  },
  {
    "title": "Until We Raise the Minimum Wage…Tip!",
    "description": "Our nation’s paltry federal minimum wage of just $7.25 hourly is rightly criticized as far too little to sustain a worker, let alone a family, in 2025. That’s bad enough, but did you know that there’s an even lower floor for workers who receive tips on the jo…",
    "link": "https://www.counterpunch.org/2025/07/18/until-we-raise-the-minimum-wagetip/",
    "timestamp": "2025-07-18T05:53:53Z"
  },
  {
    "title": "Undocumented Farm Workers Pose a Conundrum for Trump’s Mass Deportation Campaign",
    "description": "The nation’s 2.6 million-plus farm workers – an estimated 1 million of them foreign-born– are a natural target of Donald Trump’s ever-escalating mass deportation campaign. About 45% of the total workforce is estimated to be in the country illegally, and their…",
    "link": "https://www.counterpunch.org/2025/07/18/undocumented-farm-workers-pose-a-conundrum-for-trumps-mass-deportation-campaign/",
    "timestamp": "2025-07-18T05:53:10Z"
  },
  {
    "title": "Nvidia CEO Huang Emerges as Reluctant Emissary in US-China Clash",
    "description": "Days after a White House meeting with President Donald Trump, Jensen Huang was being hailed by an audience on a stage in Beijing.",
    "link": "https://www.livemint.com/companies/news/nvidia-ceo-huang-emerges-as-reluctant-emissary-in-us-china-clash-11752817961889.html",
    "timestamp": "2025-07-18T05:52:41Z"
  },
  {
    "title": "Trump’s tariff pressure pushes Asia toward American LNG, but at the cost of climate goals",
    "description": "Asian countries are offering to buy more U.S. liquefied natural gas to ease trade tensions with the Trump administration",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-tariff-pressure-pushes-asia-american-lng-cost-123855056",
    "timestamp": "2025-07-18T05:50:27Z"
  },
  {
    "title": "Civil rights work is slowing as Trump dismantles the Education Department, agency data shows",
    "description": "Data from the Education Department shows the pace at which it resolves civil rights complaints has slowed as the Trump administration dismantles the agency",
    "link": "https://abcnews.go.com/Politics/wireStory/civil-rights-work-slowing-trump-dismantles-education-department-123854597",
    "timestamp": "2025-07-18T05:50:27Z"
  },
  {
    "title": "Asian shares mostly advance after Wall Street cruises to more records",
    "description": "Asian shares are mostly higher after Wall Street rose to records following better-than-expected updates on the economy and a mixed set of profit reports from big U.S. companies",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-advance-after-wall-street-cruises-records-123854769",
    "timestamp": "2025-07-18T05:50:23Z"
  },
  {
    "title": "Stalinist Echoes in Tbilisi",
    "description": "This is the twenty-fourth part in a series about riding night trains across Europe, Turkey, and the Near East to Georgia and Armenia—to spend time in worlds beyond the pathological obsessions of Donald Trump. (Trump devoted this week to denying that there was…",
    "link": "https://www.counterpunch.org/2025/07/18/stalinist-echoes-in-tbilisi/",
    "timestamp": "2025-07-18T05:50:11Z"
  },
  {
    "title": "Trump Threatens To Sue WSJ, Murdoch Over Story On Alleged 2003 Letter To Epstein",
    "description": "US President Donald Trump threatened to sue The Wall Street Journal and owner Rupert Murdoch Thursday over a story about an alleged off-color letter he wrote to Jeffrey Epstein, amid lingering political fallout over his administration's handling of the late f…",
    "link": "https://www.ibtimes.com.au/trump-threatens-sue-wsj-murdoch-over-story-alleged-2003-letter-epstein-1859707",
    "timestamp": "2025-07-18T05:48:13Z"
  },
  {
    "title": "The police militarization debate is over - by Radley Balko",
    "description": "Trump is now in the process of making that a reality. He is obliterating the safeguards in place to keep both the police and the military from turning on the public. He is taking personnel, tactics, and weapons from both institutions to create something utter…",
    "link": "https://radleybalko.substack.com/p/the-police-militarization-debate",
    "timestamp": "2025-07-18T05:47:01Z"
  },
  {
    "title": "Dem Rep. Garcia: 'Informants Coming Forward' on Epstein Files",
    "description": "Thursday on CNN's \"The Source,\" Rep. Robert Garcia (D-CA) claimed \"informants\" were coming forward to give Congress information on the Jeffrey Epstein files.\nThe post Dem Rep. Garcia: ‘Informants Coming Forward’ on Epstein Files appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/07/17/dem-rep-garcia-informants-coming-forward-on-epstein-files/",
    "timestamp": "2025-07-18T05:45:51Z"
  },
  {
    "title": "Trump: House passing spending-cut bill big news",
    "description": "United States President Donald Trump hailed the fact that the House of Representatives passed the spending-cut bill he advocated for, which stipulates reducing spending by $9 billion, mostly in the pu...",
    "link": "https://biztoc.com/x/aae589f6408b46c9",
    "timestamp": "2025-07-18T05:41:51Z"
  },
  {
    "title": "Trump Tells Bondi to Release Epstein Grand Jury Testimony",
    "description": "As President Trump asked Attorney General Pam Bondi to release grand jury testimony related to Jeffrey Epstein, House Republicans were grasping late Thursday to formulate a response to the Trump administration's handling of records in the sex trafficking case…",
    "link": "https://www.newser.com/story/372089/trump-tells-bondi-to-release-epstein-grand-jury-testimony.html",
    "timestamp": "2025-07-18T05:40:14Z"
  },
  {
    "title": "China mulls economy-boosting measures to counter 'severe situation'",
    "description": "BEIJING: China is prepared to take measures and has a \"plentiful\" toolbox to avoid an economic slump in the second half of the year, its commerce minister said on Friday (Jul 18) as he admitted it faced a \"very severe and complex situation\".",
    "link": "https://www.channelnewsasia.com/east-asia/china-economy-growth-us-tariffs-domestic-consumption-5245296",
    "timestamp": "2025-07-18T05:40:00Z"
  },
  {
    "title": "Chief of the Air Staff speech at Global Air & Space Chiefs' Conference 2025",
    "description": "Chief of the Air Staff, Air Chief Marshal Sir Rich Knighton's speech at the Global Air & Space Chiefs' Conference 17 July 2025",
    "link": "https://www.globalsecurity.org/wmd/library/news/uk/2025/uk-250717-ukmod01.htm",
    "timestamp": "2025-07-18T05:35:09Z"
  },
  {
    "title": "US-China spy wars intensify under Trump 2.0 as tech competition heats up",
    "description": "Both sides boosting espionage and counter-espionage efforts, increasingly publicise spy arrests and covert operations Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/18/us-china-spy-wars-intensify-under-trump-20-as-tech-competition-heats-up",
    "timestamp": "2025-07-18T05:35:00Z"
  },
  {
    "title": "Trump directs Pam Bondi to release grand jury transcripts in Jeffrey Epstein case",
    "description": "President Donald Trump on Thursday said that he has directed Attorney General Pam Bondi to release relevant grand jury testimony related to the disgraced, late financier Jeffrey Epstein.",
    "link": "https://freerepublic.com/focus/f-news/4329311/posts",
    "timestamp": "2025-07-18T05:34:56Z"
  },
  {
    "title": "The next generation of Republicans is turning away from Israel",
    "description": "Netanyahu spent years undermining Israel's ties with the Democrats. Now he appears to have sparked a seismic shift among Republicans too",
    "link": "https://www.haaretz.com/israel-news/2025-07-18/ty-article-magazine/.premium/the-next-generation-of-republicans-is-turning-away-from-israel/00000198-13a7-d13e-adfb-13e7ef150000",
    "timestamp": "2025-07-18T05:30:27Z"
  },
  {
    "title": "DANIEL MCCARTHY: What Trump Knows About Superman",
    "description": "The new “Superman” movie isn’t an attack on Donald Trump’s immigration policies, but it shows how alienated from America many liberals in Hollywood and politics now feel. Every kid used to know Superman fights for “truth, justice, and the American way.” That …",
    "link": "https://dailycaller.com/2025/07/18/opinion-what-trump-knows-about-superman-daniel-mccarthy/",
    "timestamp": "2025-07-18T05:30:18Z"
  },
  {
    "title": "Stephen Colbert Hits Trump's Sorest Spots In 1st Show Since Cancellation",
    "description": "The \"Late Show\" host called attention to some issues the president doesn't like to talk about.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-sore-spots_n_6879cb03e4b00f995df4d326",
    "timestamp": "2025-07-18T05:30:04Z"
  },
  {
    "title": "Tesla finally parks in India. But can it survive?",
    "description": "Elon Musk's EV giant has launched its Model Y in Mumbai, but its $70,000 price tag may be its biggest speed bump.",
    "link": "https://www.aljazeera.com/news/2025/7/18/tesla-finally-parks-in-india-but-can-it-survive",
    "timestamp": "2025-07-18T05:27:38Z"
  },
  {
    "title": "Trump’s tariff pressure pushes Asia toward American LNG, but at the cost of climate goals",
    "description": "Asian countries are offering to buy more U.S. liquefied natural gas in negotiations with the Trump administration as a way to alleviate tensions over U.S...",
    "link": "https://finance.yahoo.com/news/trump-tariff-pressure-pushes-asia-052734763.html",
    "timestamp": "2025-07-18T05:27:34Z"
  },
  {
    "title": "US Congress Approves $9 Bn In Trump Cuts To Foreign Aid, Public Media",
    "description": "US Republicans early Friday approved President Donald Trump's plan to cancel $9 billion in funding for foreign aid and public broadcasting, vowing it was just the start of broader efforts by Congress to slash the federal budget.",
    "link": "https://www.ibtimes.com/us-congress-approves-9-bn-trump-cuts-foreign-aid-public-media-3778844",
    "timestamp": "2025-07-18T05:27:20Z"
  },
  {
    "title": "GENIUS Act heads to Trump’s desk: Here’s what will change",
    "description": "The stablecoin-regulating GENIUS Act is headed to Donald Trump’s desk, which is expected to shake up how stablecoins operate in the US and abroad.",
    "link": "https://cointelegraph.com/news/genius-act-heads-donald-trump-signing-what-will-change",
    "timestamp": "2025-07-18T05:26:54Z"
  },
  {
    "title": "Adam Schiff Talks Of Donald Trump’s “Climate Of Fear” In ‘Late Show’ Guest Appearance; California Senator Later Addresses CBS Cancellation",
    "description": "The Late Show with Stephen Colbert started out on Thursday with the host making the bombshell announcement that CBS was canceling the show, effective next May. That wasn’t addressed in his interview with Sen. Adam Schiff (D-CA), even though the Trump nemesis …",
    "link": "http://deadline.com/2025/07/adam-schiff-stephen-colbert-late-show-cancellation-cbs-1236461952/",
    "timestamp": "2025-07-18T05:22:37Z"
  },
  {
    "title": "US Congress approves $9 bn in Trump cuts to foreign aid, public media",
    "description": "US Republicans early Friday approved President Donald Trump’s plan to cancel $9 billion in funding for foreign aid and public broadcasting, vowing it was just the start of broader efforts by Congress to slash the federal budget. The cuts achieve only a tiny f…",
    "link": "https://www.digitaljournal.com/world/us-congress-approves-9-bn-in-trump-cuts-to-foreign-aid-public-media/article",
    "timestamp": "2025-07-18T05:22:20Z"
  },
  {
    "title": "US Congress approves $9 bn in Trump cuts to foreign aid, public media",
    "description": "US Republicans early Friday approved President Donald Trump's plan to cancel $9 billion in funding for foreign aid and public broadcasting, vowing it was...",
    "link": "https://www.yahoo.com/news/us-congress-approves-9-bn-052110983.html",
    "timestamp": "2025-07-18T05:21:10Z"
  },
  {
    "title": "Worry for Ireland EU prepares tariffs on US services and what next for RTÉ",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/07/18/worry-for-ireland-eu-prepares-tariffs-on-us-services-and-what-next-for-rte/",
    "timestamp": "2025-07-18T05:18:57Z"
  },
  {
    "title": "The Indo Daily: Trump’s broken promises: Why the Epstein files are causing a MAGA meltdown",
    "description": "Six years ago, notorious paedophile Jeffrey Epstein was found dead in his New York City prison cell.",
    "link": "https://www.independent.ie/podcasts/the-indo-daily/the-indo-daily-trumps-broken-promises-why-the-epstein-files-are-causing-a-maga-meltdown/a628169790.html",
    "timestamp": "2025-07-18T05:15:20Z"
  },
  {
    "title": "Trump has ‘chronic venous insufficiency’. Is it dangerous? Can it be treated?",
    "description": "Chronic venous insufficiency is a disease of the veins, where blood doesn’t flow as well as it should from the legs up to the heart.",
    "link": "https://theconversation.com/trump-has-chronic-venous-insufficiency-is-it-dangerous-can-it-be-treated-261460",
    "timestamp": "2025-07-18T05:12:03Z"
  },
  {
    "title": "Searching for pennies: With the cut in federal funding public broadcasters are looking to cope",
    "description": "In Alaska, a public radio station general manager took a moment from a busy day warning her community about a possible tsunami for a special task — sending a text message to Sen. Lisa Murkowski urging her to vote against a measure to strip federal fund...",
    "link": "https://abcnews.go.com/Entertainment/wireStory/searching-pennies-cut-federal-funding-public-broadcasters-cope-123849686",
    "timestamp": "2025-07-18T05:10:20Z"
  },
  {
    "title": "US Congress approves $9bn cuts to foreign aid, public media",
    "description": "The House of Representatives has passed Donald Trump's $9 billion funding cuts to public broadcasting and foreign aid, sending it to the White House to be signed into law. The Republican-controlled US House of Representatives passed President Donald Trump's p…",
    "link": "https://www.dw.com/en/us-congress-approves-9bn-cuts-to-foreign-aid-public-media/a-73318776",
    "timestamp": "2025-07-18T05:10:00Z"
  },
  {
    "title": "'Daily Show' Shreds Trump's Biden Claim Using A Simply Unforgettable Clip",
    "description": "'Daily Show' Shreds Trump's Biden Claim Using A Simply Unforgettable Cliphuffpost.com",
    "link": "https://www.huffpost.com/entry/daily-show-jordan-klepper-trump-jerome-powell-biden_n_6879c1e3e4b007ebff4780b0",
    "timestamp": "2025-07-18T05:05:01Z"
  },
  {
    "title": "Asian shares mostly advance after Wall Street cruises to more records",
    "description": "MANILA, Philippines (AP) — Asian shares were mostly higher on Friday after Wall Street rose to records following better-than-expected updates on the economy and a mixed set of profit reports from big U.S. companies. Japan’s Nikkei 225 edged 0.1% lower to 39,8…",
    "link": "https://financialpost.com/pmn/asian-shares-mostly-advance-after-wall-street-cruises-to-more-records",
    "timestamp": "2025-07-18T05:02:26Z"
  },
  {
    "title": "Billionaire-Backed California City Pitches Plans for Factory Hub",
    "description": "California Forever, the proposed futuristic community backed by billionaire venture capitalists, is now billing itself as a manufacturing center a year after local opposition forced it to withdraw plans to incorporate a new city. The project’s organizers said…",
    "link": "https://www.insurancejournal.com/news/west/2025/07/18/832182.htm",
    "timestamp": "2025-07-18T05:00:52Z"
  },
  {
    "title": "Digicel eyes €2bn refinancing as junk bond yields slide",
    "description": "Denis O’Brien-founded firm has hired JP Morgan to organise measure",
    "link": "https://www.irishtimes.com/business/2025/07/18/digicel-eyes-2bn-refinancing-as-junk-bond-yields-slide/",
    "timestamp": "2025-07-18T05:00:01Z"
  },
  {
    "title": "Coca-Cola defends corn syrup after Trump claims he struck cane sugar deal",
    "description": "Soft drink company offers no confirmation of recipe change, saying corn syrup is safe and widely used in US drinks",
    "link": "https://www.irishtimes.com/world/us/2025/07/18/coca-cola-defends-corn-syrup-after-trump-claims-he-struck-cane-sugar-deal/",
    "timestamp": "2025-07-18T05:00:01Z"
  },
  {
    "title": "Occupied Territories Bill: Poll finds many voters now want economic implications examined",
    "description": "Proposed legislation has started to command significant international attention",
    "link": "https://www.irishtimes.com/politics/2025/07/18/occupied-territories-bill-poll-finds-many-voters-now-want-economics-of-bill-examined/",
    "timestamp": "2025-07-18T05:00:01Z"
  },
  {
    "title": "Donald Trump’s tariffs list returns, Taco or not",
    "description": "Trump’s focus on the goods of the past is ridiculous. What matters is competitiveness in the future",
    "link": "https://www.irishtimes.com/business/economy/2025/07/18/donald-trumps-tariffs-list-returns-taco-or-not/",
    "timestamp": "2025-07-18T05:00:01Z"
  },
  {
    "title": "A conversation between Ezra Klein and Kyla Scanlon on how the attention economy is devouring us.",
    "description": "Again, I archive for myself and also pass on to readers a ChatGPT4o summary of a NYT Opinion article by Ezra Klein, this time on his interview of the remarkable Kyla Scanlon:\n\n\n\n\n\n\n\n\n\n\nHere’s a summary of the central ideas from Ezra Klein’s interview with Kyl…",
    "link": "https://mindblog.dericbownds.net/2025/07/a-conversation-between-ezra-klein-and.html",
    "timestamp": "2025-07-18T05:00:00Z"
  },
  {
    "title": "Stephen Colbert's 'Late Show' canceled by CBS, ends May 2026",
    "description": "CBS is canceling “The Late Show With Stephen Colbert” next May, shuttering a decades-old TV institution in a changing media landscape and removing from air one of President Donald Trump’s most prominent and persistent late-night critics. Thursday's announceme…",
    "link": "https://japantoday.com/category/entertainment/stephen-colbert%27s-%27late-show%27-canceled-by-cbs-ends-may-2026",
    "timestamp": "2025-07-18T04:57:37Z"
  },
  {
    "title": "Trump Plans Executive Order To Add Crypto To 401(k) Menus—$8.7 Trillion Retirement Market Poised For Bitcoin, Ethereum And Takeover Funds: Report",
    "description": "President Donald Trump is planning to issue an executive order that will allow cryptocurrencies to be included in U.S. retirement plans, according to a report published Thursday.\nWhat Happened: The executive order is expected to be signed this week, the Finan…",
    "link": "https://biztoc.com/x/7a4641c2b7e7135f",
    "timestamp": "2025-07-18T04:57:22Z"
  },
  {
    "title": "US Congress approves $9 bn in Trump cuts to foreign aid, public media",
    "description": "US Republicans early Friday approved President Donald Trump's plan to cancel $9 billion in funding for foreign aid and public broadcasting, vowing it was just the start of broader efforts by Congress to slash the federal budget. Conservatives say the funding-…",
    "link": "https://timesofindia.indiatimes.com/world/us/us-congress-approves-9-bn-in-trump-cuts-to-foreign-aid-public-media/articleshow/122727993.cms",
    "timestamp": "2025-07-18T04:53:39Z"
  },
  {
    "title": "Crude oil prices rise after drone attacks on Iraqi oilfields",
    "description": "According to a report, oil output in the Kurdistan region has been slashed by between 140,000 and 150,000 barrels per day -- more than half the region’s normal output of 280,000 barrels per day",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-prices-rise-after-drone-attacks-on-iraqi-oilfields/article69826206.ece",
    "timestamp": "2025-07-18T04:51:38Z"
  },
  {
    "title": "Trump-Epstein joke roundup",
    "description": "do you want it done fast or do you want it done right[image or embed]\r\n— Lloyd’s Soil (@toil.bsky.social) July 17, 2025 at 6:02 PM\n\n\n\nWould swamp tomorrow's roundup otherwise:\n\n\n\n\n\n\n\n\n\n\n\n\nTrump every day of his entire life.[image or embed]\r\n— Cody (@codyjohns…",
    "link": "https://www.superpunch.net/2025/07/trump-epstein-joke-roundup.html",
    "timestamp": "2025-07-18T04:50:00Z"
  },
  {
    "title": "Crypto’s Wild West Era Is Over",
    "description": "The GENIUS Act brings crypto out of the shadows and into the American financial system.",
    "link": "https://gizmodo.com/cryptos-wild-west-era-is-over-2000631148",
    "timestamp": "2025-07-18T04:49:25Z"
  },
  {
    "title": "News Summary-Intelligence Report 7/17/2025*Newsdump Thursday*Trump Drama Accompanies Tucker Carlson Epstein Video*Netanyahu Gov't Set To Fire Israel's Attorney General*NASDAQ Closes At Record High*Israel Apologizes \"Deep Sorrow\" After Gaza Church Attack*",
    "description": "President Donald Trump calling Israeli Prime Minister...Israel's deadly bombing... Tucker Carlson with a special release tonight discussing the Jeffrey Epstein... The \"Wall Street Journal\" out with a story...Trump saying the story is falsified... Later this e…",
    "link": "https://freerepublic.com/focus/f-bloggers/4329309/posts",
    "timestamp": "2025-07-18T04:48:51Z"
  },
  {
    "title": "The 'Trump Doctrine' is wishful thinking",
    "description": "The Donald Trump-ordered strikes on Iran, claimed to prove a unique “Trump Doctrine,” ignore decades of failed U.S. attempts to force adversaries to back down.",
    "link": "https://www.japantimes.co.jp/commentary/2025/07/18/world/trump-doctrine-is-wishful-thinking/",
    "timestamp": "2025-07-18T04:45:00Z"
  },
  {
    "title": "How Public Media Lost The Federal Funding Battle, And What Happens Next To Stations, NPR And PBS",
    "description": "Now that Congress has zeroed out federal funding for the Corporation for Public Broadcasting, PBS, NPR and stations across the country will be scrambling to come up with plans for what to do next. Paula Kerger, the president and CEO of PBS, has warned that ev…",
    "link": "http://deadline.com/2025/07/pbs-npr-funding-cut-explained-whats-next-1236461136/",
    "timestamp": "2025-07-18T04:40:38Z"
  },
  {
    "title": "'If it flies it dies': Why America's ever-evolving Patriot missiles are so popular",
    "description": "Donald Trump—never one to shy away from controversy—has done another dramatic U-turn. After flatly refusing to send any more ...",
    "link": "https://biztoc.com/x/c8b7b5010370d49c",
    "timestamp": "2025-07-18T04:40:13Z"
  },
  {
    "title": "'Another wonderful secret' EXPOSED: Trump squirms at drip, drip, drip of Epstein details",
    "description": "Rep. Jamie Raskin points out the irony of Donald Trump's reported wish Jeffrey Epstein that \"every day be another wonderful ...",
    "link": "https://biztoc.com/x/f82836afb8cd8d4b",
    "timestamp": "2025-07-18T04:40:09Z"
  },
  {
    "title": "‘Gutfeld!’ Gangs Up on CBS Reporter for ‘PTSD’ Diagnosis From Trump Rally Shooting: ‘Main Character Syndrome’ | Video",
    "description": "CBS correspondent Scott MacFarlane said he was \"diagnosed with PTSD in 48 hours\" following his experience covering the Butler, Pennsylvania, rally where Donald Trump was nearly assassinated because his supporters turned on members of the press – and the \"Gutf…",
    "link": "https://www.thewrap.com/gutfeld-cbs-reporter-scott-macfarlane-ptsd-diagnosis-trump-rally-shooting/",
    "timestamp": "2025-07-18T04:39:00Z"
  },
  {
    "title": "China Mulls Economy-boosting Measures To Counter 'Severe Situation'",
    "description": "China is prepared to take measures and has a \"plentiful\" toolbox to avoid an economic slump in the second half of the year, its commerce minister said Friday as he admitted it faced a \"very severe and complex situation\".",
    "link": "https://www.ibtimes.com/china-mulls-economy-boosting-measures-counter-severe-situation-3778840",
    "timestamp": "2025-07-18T04:36:09Z"
  },
  {
    "title": "US Congress passes Genius Act to regulate stable coins amid Trump ties and market surge",
    "description": "The United States has approved the Genius Act, its first major crypto legislation. The bill regulates stablecoins and requires full reserves. It delegates power to federal regulators. Supporters say it will boost innovation. Critics warn of risks to the banki…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-congress-passes-genius-act-to-regulate-stable-coins-amid-trump-ties-and-market-surge/articleshow/122727073.cms",
    "timestamp": "2025-07-18T04:35:10Z"
  },
  {
    "title": "Why the U.S. might finally start calling soccer 'football'",
    "description": "It is the world's most popular sport and yet there is still debate over what it should actually be called. Is it football or soccer? U.S. President Donald Trump waded into the topic while at the Club World Cup final in New Jersey last Sunday. He joked that he…",
    "link": "https://japantoday.com/category/sports/why-the-us-might-finally-start-calling-soccer-%27football%27",
    "timestamp": "2025-07-18T04:35:04Z"
  },
  {
    "title": "China mulls economy-boosting measures to counter ‘severe situation’",
    "description": "China is prepared to take measures and has a “plentiful” toolbox to avoid an economic slump in the second half of the year, its commerce minister said Friday as he admitted it faced a “very severe and complex situation”. Growth hit 5.2 percent in the second q…",
    "link": "https://www.digitaljournal.com/world/china-mulls-economy-boosting-measures-to-counter-severe-situation/article",
    "timestamp": "2025-07-18T04:32:32Z"
  },
  {
    "title": "Pahalgam terror attack: US designates Lashkar's proxy TRF as 'Foreign Terrorist Organisation'",
    "description": "Earlier on Tuesday, External Affairs Minister S Jaishankar stressed the importance of taking an uncompromising stance against terrorism, citing the recent Pahalgam terrorist attack in India, which was condemned by the UN Security Council",
    "link": "https://www.thehindubusinessline.com/news/pahalgam-terror-attack-us-designates-lashkars-proxy-trf-as-foreign-terrorist-organisation/article69826181.ece",
    "timestamp": "2025-07-18T04:31:44Z"
  },
  {
    "title": "China mulls economy-boosting measures to counter 'severe situation'",
    "description": "China is prepared to take measures and has a \"plentiful\" toolbox to avoid an economic slump in the second half of the year, its commerce minister said Friday...",
    "link": "https://finance.yahoo.com/news/china-mulls-economy-boosting-measures-043054537.html",
    "timestamp": "2025-07-18T04:30:54Z"
  },
  {
    "title": "The Irish Independent’s View: TDs take a break but big challenges await when they return to Dáil",
    "description": "Any break in the working schedule was begrudged by Winston Churchill. ­Holidays, he believed, were “enforced interruptions in an absorbing vocation”.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-tds-take-a-break-but-big-challenges-await-when-they-return-to-dail/a45717271.html",
    "timestamp": "2025-07-18T04:30:00Z"
  },
  {
    "title": "Russia says Donald Trump gave Ukraine signal to ‘continue slaughter’",
    "description": "US president Donald Trump’s decision to ramp up arms shipments to Ukraine is a signal to Kyiv to abandon peace efforts, Russia said yesterday, vowing it would not accept the “blackmail” of Washington’s new sanctions ultimatum.",
    "link": "https://www.independent.ie/world-news/russia-says-donald-trump-gave-ukraine-signal-to-continue-slaughter/a41067729.html",
    "timestamp": "2025-07-18T04:30:00Z"
  },
  {
    "title": "Seven in 10 Americans think government is hiding Epstein details",
    "description": "Most Americans think president Donald Trump’s administration is hiding information about accused sex-trafficker Jeffrey Epstein and give it poor marks on the issue after pledging to make public documents in the case, a Reuters/Ipsos poll found.",
    "link": "https://www.independent.ie/world-news/north-america/seven-in-10-americans-think-government-is-hiding-epstein-details/a1742079093.html",
    "timestamp": "2025-07-18T04:30:00Z"
  },
  {
    "title": "UK and Germany sign treaty to deepen defence alliance",
    "description": "UK prime minister Keir Starmer and German chancellor Friedrich Merz hailed a major treaty to deepen ties in areas ranging from defence to immigration yesterday, the latest step in the UK’s push to reset relations with the European Union.",
    "link": "https://www.independent.ie/world-news/britain/uk-and-germany-sign-treaty-to-deepen-defence-alliance/a1975635560.html",
    "timestamp": "2025-07-18T04:30:00Z"
  },
  {
    "title": "Donal Fallon: Why Donald Trump may be a bigger threat to Irish whiskey than a teetotalling 19th-century priest",
    "description": "Irish whiskey is no stranger to economic turbulence through its history, but recent months have been difficult by any standard. Once the epicentre of Irish distilling, the Liberties area of the capital had witnessed an extraordinary revival in recent years, t…",
    "link": "https://www.independent.ie/opinion/comment/donal-fallon-why-donald-trump-may-be-a-bigger-threat-to-irish-whiskey-than-a-teetotalling-19th-century-priest/a1877450382.html",
    "timestamp": "2025-07-18T04:30:00Z"
  },
  {
    "title": "Tariffs ‘won’t threaten’ Ireland’s pole position in jet-leasing sector, says Avia boss",
    "description": "Ireland’s position as the top global centre for aircraft leasing is unlikely to be impacted by the trade war between the United States and the rest of the world, according to Gediminas Ziemelis, executive chairman and founder of Dublin-­headquartered Avia Sol…",
    "link": "https://www.independent.ie/business/tariffs-wont-threaten-irelands-pole-position-in-jet-leasing-sector-says-avia-boss/a1820411835.html",
    "timestamp": "2025-07-18T04:30:00Z"
  },
  {
    "title": "Travelers to the US must pay a new $250 'visa integrity fee' — What to know",
    "description": "Travelers to the U.S. must pay a new \"visa integrity fee\" to visit, but questions remain as to how and when it will be implemented. Here's what we know so far.",
    "link": "https://www.cnbc.com/2025/07/18/visa-integrity-fee-what-to-know-about-new-travel-fee-to-enter-the-us-.html",
    "timestamp": "2025-07-18T04:27:30Z"
  },
  {
    "title": "The Late Show with Stephen Colbert to end in 2026 after 30 years",
    "description": "Host Stephen Colbert told viewers he had only found out \"last night\".",
    "link": "https://www.nzherald.co.nz/entertainment/the-late-show-with-stephen-colbert-to-end-in-2026-after-30-years/JZNH7PJF2RH5FPQ5GG3SNSECRU/",
    "timestamp": "2025-07-18T04:25:48Z"
  },
  {
    "title": "Trump orders AG Pam Bondi to seek release of Epstein grand jury records",
    "description": "What to know today\n- EPSTEIN CASE: President Donald Trump said he was directing Attorney General Pam Bondi to seek the release of “pertinent” grand jury testimony from the Jeffrey Epstein case after he denied reporting from The Wall Street Journal that said h…",
    "link": "https://biztoc.com/x/6048faf80509cb83",
    "timestamp": "2025-07-18T04:23:54Z"
  },
  {
    "title": "Trump Directs Bondi To Release Some Epstein Case Documents As He Threatens To Sue WSJ And Murdoch",
    "description": "The president said a Wall Street Journal report alleging that a racy letter sent to Epstein on his 50th Birthday in 2003 bore his name and signature was “FAKE NEWS.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/07/18/trump-directs-bondi-to-release-some-epstein-case-documents-as-he-threatens-to-sue-wsj-and-murdoch/",
    "timestamp": "2025-07-18T04:22:33Z"
  },
  {
    "title": "New: Trump Blasts WSJ Epstein 'Scoop,' Lawsuit Incoming",
    "description": "Late Thursday afternoon, the Wall Street Journal published an \"exclusive\" involving President Donald Trump and Jeffrey Epstein. That \"scoop,\" as our Joe Cunningham notes, amounts to a \"bawdy\" birthday card purportedly sent by Trump to Epstein for his 50th bir…",
    "link": "https://freerepublic.com/focus/f-news/4329301/posts",
    "timestamp": "2025-07-18T04:21:48Z"
  },
  {
    "title": "‘Blood Rushing Back’ Into Crypto as XRP, Dogecoin Soar",
    "description": "A wave of U.S. crypto policies and an influx of institutional capital are driving up crypto prices, including those of XRP and Dogecoin.",
    "link": "https://decrypt.co/330761/blood-rushing-back-into-crypto-as-xrp-dogecoin-soar",
    "timestamp": "2025-07-18T04:20:28Z"
  },
  {
    "title": "US solar makers seek tariffs against India, Indonesia, Laos",
    "description": "US solar manufacturers file trade petitions against India, Indonesia, and Laos, alleging illegal practices by Chinese-owned companies.",
    "link": "https://www.bloomberg.com/news/articles/2025-07-17/us-solar-makers-file-trade-petition-against-india-indonesia",
    "timestamp": "2025-07-18T04:18:59Z"
  },
  {
    "title": "Rupee rises 6 paise to 86.06 against US dollar in early trade",
    "description": "At the interbank foreign exchange, the rupee opened at 85.99 before dropping to 86.06 against the US dollar, up 6 paise from its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-rises-6-paise-to-8606-against-us-dollar-in-early-trade/article69826162.ece",
    "timestamp": "2025-07-18T04:18:28Z"
  },
  {
    "title": "House gives final approval to Trump's $9 billion cut to public broadcasting and foreign aid",
    "description": "The House approved President Trump's $9 billion rescissions package, targeting public broadcasting and foreign aid, marking a rare victory for presidential spending cuts. Republicans, despite some reservations, largely supported the measure, while Democrats c…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/house-gives-final-approval-to-trumps-9-billion-cut-to-public-broadcasting-and-foreign-aid/articleshow/122725392.cms",
    "timestamp": "2025-07-18T04:17:52Z"
  },
  {
    "title": "The Late Show with Stephen Colbert will end next year",
    "description": "CBS has said it will retire the ‘Late Show’ franchise, citing a ‘financial decision’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/stephen-colbert-late-show-cbs-ending-canceled-b2791384.html",
    "timestamp": "2025-07-18T04:17:06Z"
  },
  {
    "title": "'The Late Show with Stephen Colbert' to end in May 2026",
    "description": "'The Late Show with Stephen Colbert,' the most-watched late-night programme on US broadcast television and a frequent platform of satire aimed at US President Donald Trump, will end its 10-year run on CBS in May 2026, the network said.",
    "link": "https://www.rte.ie/news/us/2025/0718/1524090-the-late-show-cancellation/",
    "timestamp": "2025-07-18T04:12:56Z"
  },
  {
    "title": "'The Late Show with Stephen Colbert' to end in May 2026",
    "description": "'The Late Show with Stephen Colbert,' the most-watched late-night programme on US broadcast television and a frequent platform of satire aimed at President Donald Trump, will end its 10-year run on CBS in May 2026, the network said.",
    "link": "https://www.rte.ie/news/us/2025/0718/1524090-the-late-show-us/",
    "timestamp": "2025-07-18T04:12:56Z"
  },
  {
    "title": "Trump threatens to sue The Wall Street Journal over article about his Epstein ties - NPR",
    "description": "Trump threatens to sue The Wall Street Journal over article about his Epstein tiesNPR Exclusive | Jeffrey Epstein’s Friends Sent Him Bawdy Letters for a 50th Birthday Album. One Was From Donald Trump.The Wall Street Journal Wall Street Journal: Birthday lette…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178407206",
    "timestamp": "2025-07-18T04:12:50Z"
  }
]