[
  {
    "title": "Standard Chartered Predicts Massive Bitcoin Eruption To $500,000 Before President Trump Leaves White House",
    "description": "Standard Chartered now projects a staggering $500,000 price target for Bitcoin (BTC) within the next three years. The British multinational bank attributes BTC’s potential extraordinary price surge to two key factors. Standard Chartered Sets Bold $500K Target…",
    "link": "https://zycrypto.com/standard-chartered-predicts-massive-bitcoin-eruption-to-500000-before-president-trump-leaves-white-house/",
    "timestamp": "2025-02-06T11:05:36Z"
  },
  {
    "title": "The case for a comprehensive federal law to oversee AI",
    "description": "Congress considered 158 bills that mention artificial intelligence over the past two years, according to a count by the Brennan Center for Justice. But zero comprehensive AI laws have been passed. There has been movement by states, however. In Tennessee, for …",
    "link": "https://www.marketplace.org/shows/marketplace-tech/the-case-for-a-comprehensive-federal-law-to-oversee-ai/",
    "timestamp": "2025-02-06T11:05:09Z"
  },
  {
    "title": "Tesla sales plummet across Europe",
    "description": "Registrations in Germany fall 59% amid consumer backlash against Elon Musk’s political activism",
    "link": "https://www.irishtimes.com/business/2025/02/06/tesla-sales-plummet-across-europe/",
    "timestamp": "2025-02-06T11:03:18Z"
  },
  {
    "title": "Kanye West cashing in on Bianca Censori with new book after shocking Grammys stunt? What we know",
    "description": "After Kanye West and his wife Bianca Censori sparked buzz online due to shocking stunt at the 67th Grammy Awards, the US rapper is reportedly looking to enter the publishing world with a book about his wife. Kanye West is reportedly seeking rights to the titl…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-kanye-west-bianca-censori-grammys-outfit-wife-by-husband-kanye-west-cashing-in-on-bianca-censori-with-new-book-after-shocking-grammys-stunt-what-we-know/articleshow/117981610.cms",
    "timestamp": "2025-02-06T11:02:53Z"
  },
  {
    "title": "Trump Administration Taking U-Turn On Gaza Plan? Here's What White House Said",
    "description": "US President Donald Trump&#039;s administration seems to have walked back on his proposal to resettle Gaza&#039;s population, with Secretary of State Marco Rubio clarifying that action in the Palestinian territory would be temporary.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-administration-taking-u-turn-on-gaza-plan-heres-what-white-house-said-7648410",
    "timestamp": "2025-02-06T11:02:48Z"
  },
  {
    "title": "Gucci ousts chief designer De Sarno after sales slump",
    "description": "Luxury giant Gucci announced Thursday it was parting ways with its chief designer Sabato De Sarno following a sales slump, in the latest shakeup at a major European label. De Sarno was appointed to the job in January 2023, bringing in a more minimalist style …",
    "link": "https://www.digitaljournal.com/world/gucci-ousts-chief-designer-de-sarno-after-sales-slump/article",
    "timestamp": "2025-02-06T11:02:35Z"
  },
  {
    "title": "The future of vaccines is needle-free",
    "description": "This story was originally published in The Highlight, Vox’s member-exclusive magazine. To get early access to member-exclusive stories every month, join the Vox Membership program today. The winter and post-holiday season is when Covid and flu cases usually s…",
    "link": "https://www.vox.com/future-perfect/392145/nasal-vaccines-covid-flu-needles-public-health",
    "timestamp": "2025-02-06T11:02:01Z"
  },
  {
    "title": "US judge temporarily blocks Trump buyout offer for government workers",
    "description": "(Reuters) -A U.S. judge on Thursday temporarily blocked the Trump administration's proposed buyout for federal workers until at least Monday, giving an initial win to labor unions that sued to stop it. The ruling by U.S. District Judge George O'Toole in Bosto…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_28241eda-dfbe-4339-959d-02bee878c29d",
    "timestamp": "2025-02-06T11:01:41Z"
  },
  {
    "title": "Alleged USAID Probe Into Starlink Raises Elon Musk Conflict Concerns",
    "description": "In 2022, USAID and Starlink collaborated to provide 5,000 Starlink terminals to Ukraine amid its ongoing war against Russia.",
    "link": "https://www.newsweek.com/usaid-elon-musk-starlink-probe-ukraine-2027054",
    "timestamp": "2025-02-06T11:01:34Z"
  },
  {
    "title": "The Crypto Industry Expects Regulatory Clarity From The Trump Administration",
    "description": "The President has set the “tone at the top” to drive the the crypto and AI industry by supercharging investment, confidence, and adoption. Industry has high expectations.",
    "link": "https://www.forbes.com/sites/lawrencewintermeyer/2025/02/06/the-crypto-industry-expects-regulatory-clarity-from-the-trump-administration/",
    "timestamp": "2025-02-06T11:00:52Z"
  },
  {
    "title": "Poll: ICE Agency Gets 2:1 Public Support",
    "description": "President Donald Trump's Immigration and Customs Enforcement (ICE) agency is favored by 53 percent of American voters — and 50 percent of Latinos — according to a poll for The Economist magazine.\nThe post Poll: ICE Agency Gets 2:1 Public Support appeared firs…",
    "link": "https://www.breitbart.com/immigration/2025/02/06/poll-ice-gets-21-public-support/",
    "timestamp": "2025-02-06T11:00:44Z"
  },
  {
    "title": "Michael Taube: Ford shows Conservatives can stick to their principles and win union support",
    "description": "Free markets and trade liberalization can co-exist with economic security and workers' rights",
    "link": "https://nationalpost.com/opinion/ford-shows-conservatives-can-stick-to-their-principles-and-win-union-support",
    "timestamp": "2025-02-06T11:00:42Z"
  },
  {
    "title": "US Bitcoin Reserve Will Lead To ‘Pain In Under 2 Years,’ Warns Arthur Hayes",
    "description": "In his latest essay entitled “The Genie,” crypto entrepreneur and former BitMEX CEO Arthur Hayes denounced calls for a United States Bitcoin Strategic Reserve (BSR), warning that such a program would create “unnecessary pain in under two years” and transform …",
    "link": "http://www.newsbtc.com/news/bitcoin/us-strategic-bitcoin-reserve-terrible-idea-arthur-hayes/",
    "timestamp": "2025-02-06T11:00:41Z"
  },
  {
    "title": "Canadian politicians are literally praying in Washington as they try to stop a trade war",
    "description": "A delegation of Canadians is attending the annual National Prayer Breakfast with Donald Trump and influential Republican power brokers.",
    "link": "https://nationalpost.com/news/politics/canadian-politicians-are-literally-praying-in-washington-as-they-try-to-stop-a-trade-war",
    "timestamp": "2025-02-06T11:00:38Z"
  },
  {
    "title": "Joe Oliver: Where do we go from here in the Trump tariff drama?",
    "description": "Joe Oliver: Let's clear away trade irritants, the border, defence, supply management,  that are own-goals on ourselves. Read here for more",
    "link": "https://financialpost.com/opinion/joe-oliver-where-do-we-go-from-here-in-the-trump-tariff-drama",
    "timestamp": "2025-02-06T11:00:24Z"
  },
  {
    "title": "CIA Analyst Martin Gurri on Trump, Chaos, and Optimism",
    "description": "Martin Gurri is a former CIA analyst and author of The Revolt of the Public and the Crisis of Authority in…\nThe post CIA Analyst Martin Gurri on Trump, Chaos, and Optimism appeared first on Reason.com.",
    "link": "https://reason.com/2025/02/06/martin-gurri-on-donald-trump/",
    "timestamp": "2025-02-06T11:00:24Z"
  },
  {
    "title": "First on Fox: Pro-Democrat outside group targets Republican lawmakers with 'Hands off Medicaid' blitz",
    "description": "A nonprofit public advocacy group that focuses on healthcare and aligns with Democrats targets House Republicans as part of its $10 million \"Hands Off Medicaid\" campaign.",
    "link": "https://www.foxnews.com/politics/first-fox-pro-democrat-outside-group-targets-republican-lawmakers-hands-off-medicaid-blitz",
    "timestamp": "2025-02-06T11:00:08Z"
  },
  {
    "title": "The facts behind videos of people in FL, NC supposedly regretting Trump votes",
    "description": "Two videos showing a woman speaking in front of a brick wall and flowers authentically depict Florida and North Carolina voters regretting voting for U.S. President Donald Trump.",
    "link": "https://www.snopes.com//fact-check/trump-florida-north-carolina-voters/",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Will Trump's tariff threat finally spur action on dropping inter-provincial barriers?",
    "description": "Canada’s premiers have talked about the need to break down inter-provincial trade barriers for years but the trade tariff threat from U.S. President Donald Trump may prompt them to finally take action.",
    "link": "https://www.cbc.ca/news/canada/edmonton/will-trump-s-tariff-threat-finally-spur-action-on-dropping-inter-provincial-barriers-1.7451824",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Trump’s Gaza ‘takeover’ comments are meant to shatter the Overton Window",
    "description": "At a press conference Tuesday with Israeli Prime Minister Benjamin Netanyahu, President Trump floated an idea that the U.S. could \"take over\" the Gaza Strip.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-gaza-takeover-window-overton-window-rcna190895",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Trump Is Undermining U.S. Soft Power at a Delicate Time",
    "description": "President Donald Trump’s recent actions on foreign policy—from his efforts to gut a key international aid organization to his threats to impose tariffs on critical allies, to the allocation of power to a billionaire adviser—could result in a decline in the gl…",
    "link": "https://newrepublic.com/article/191174/trump-undermining-soft-power-consequences",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Dana White Pulls No Punches: A No-Holds-Barred Interview",
    "description": "UFC’s ultimate broligarch on why he’ll always be in Donald Trump’s corner, his passion for high-stakes risk-taking and how he’s already building America’s next great combat sport.",
    "link": "https://www.forbes.com/sites/mattcraig/2025/02/05/dana-white-interview-ufc-net-worth-donald-trump-power-slap/",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Backstage with Diplo, $1M to party with Shaq: How the rich do the Super Bowl",
    "description": "Some of the Super Bowl's wealthiest guests have a second agenda: \"It's no longer just about watching the game — it's about being in the orbit of power players who are also attending,\" said a source.",
    "link": "https://nypost.com/2025/02/06/entertainment/1m-to-party-with-shaq-how-the-rich-do-the-super-bowl/",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "How to Make Eggs Affordable Again",
    "description": "Free imprisoned Capitol insurrectionists. Someone’s gotta replace all the deported farmworkers.",
    "link": "https://www.newyorker.com/humor/shouts-murmurs/how-to-make-eggs-affordable-again",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "How ‘The Wolf of Wall Street’ helps explain Trump’s terrible sovereign wealth fund idea",
    "description": "President Donald Trump's latest idea is a sovereign wealth fund that could be used to invest taxpayer money in dodgy enterprises.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-sovereign-wealth-fund-executive-order-rcna190787",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Democrats will not let Trump go unchallenged. Here's how we plan to fight back.",
    "description": "Donald Trump is flooding the zone with one outrageous Project 25 plan after another. But we will not let these attacks on our democracy go unchallenged.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-project-2025-democrats-fight-rcna190846",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "I Visited Dozens of\nCivics Classrooms. The Right’s Attacks Are Wrong.",
    "description": "Whoever actually wrote President Donald Trump’s recent executive order on education, “Ending Radical Indoctrination in K-12 Schooling,” holds an apocalyptic view of the American classroom. The order claims that teachers are “imprinting anti-American, subversi…",
    "link": "https://newrepublic.com/article/191160/civics-education-trump-executive-order",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Tariffs paused, but manufacturer that employs 700 in Steinbach now struggles with uncertainty",
    "description": "A 30-day pause on threatened U.S. tariffs might be a welcome reprieve for Manitoba's manufacturers, but uncertainty lingers about the potential impacts if they are implemented.",
    "link": "https://www.cbc.ca/news/canada/manitoba/loewen-windows-steinbach-tariffs-1.7451699",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Memory-Holing Jan. 6: What Happens When You Try to Make History Vanish?",
    "description": "by Alec MacGillis \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nOn Jan. 10, the U.S. Department of Justice released a 123-page report on the …",
    "link": "https://www.propublica.org/article/january-6-erasure-doj-database-trump-history",
    "timestamp": "2025-02-06T11:00:00Z"
  },
  {
    "title": "Sean Duffy tells Hillary Clinton to 'sit this one out' after she chimes in on his DOGE announcement",
    "description": "Transportation Sec. Sean Duffy told former Secretary of State Hillary Clinton to 'sit this one out' after she weighed in on his DOGE-related announcement.",
    "link": "https://www.foxnews.com/politics/sean-duffy-tells-hillary-clinton-sit-one-out-after-she-chimes-his-doge-announcement",
    "timestamp": "2025-02-06T10:58:13Z"
  },
  {
    "title": "Mexico Deploy First of 10,000 National Guard Troops to U.S. Border After Trump’s Tariff Threat",
    "description": "A line of Mexican National Guard and Army trucks rumbled along the border separating Ciudad Juárez and El Paso, Texas, on Wednesday.",
    "link": "https://time.com/7213280/mexico-deploys-national-guard-troops-us-border-trump-tariff-threat/",
    "timestamp": "2025-02-06T10:53:57Z"
  },
  {
    "title": "Trump meets with Newsom, Abbott - The Hill",
    "description": "Trump meets with Newsom, AbbottThe Hill California governor meets with Trump at White House to seek wildfire aidThe Guardian US Newsom to Meet With Trump as He Seeks Federal Aid for Fire ReliefThe New York Times Seeking LA fire aid, Gavin Newsom is set to mee…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176139539",
    "timestamp": "2025-02-06T10:53:00Z"
  },
  {
    "title": "The MAGA Strip / Donald Trump's Gaza Strip Plan",
    "description": "The MAGA Strip, also known as Riviera of the Middle East Plan or Donald Trump's Gaza Strip Plan, is a controversial proposal announced by United States President Donald Trump in early February 2025 to relocate nearly 2 million Palestinians from Gaza to create…",
    "link": "https://knowyourmeme.com/memes/events/the-maga-strip-donald-trumps-gaza-strip-plan",
    "timestamp": "2025-02-06T10:51:44Z"
  },
  {
    "title": "Gucci Ousts Chief Designer De Sarno After Sales Slump",
    "description": "Luxury giant Gucci announced Thursday it was parting ways with its chief designer Sabato De Sarno following a sales slump, in the latest shakeup at a major European label.",
    "link": "https://www.ibtimes.com/gucci-ousts-chief-designer-de-sarno-after-sales-slump-3762581",
    "timestamp": "2025-02-06T10:51:20Z"
  },
  {
    "title": "UN points out flaw in Israel’s latest move",
    "description": "The Jewish state has said it will follow US President Donald Trump’s lead and also quit the UN Human Rights Council Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612258-israel-un-human-rights/",
    "timestamp": "2025-02-06T10:49:54Z"
  },
  {
    "title": "In Gaza, We Thanked Trump for the Ceasefire. Now We Know How He Really Sees Us.",
    "description": "His “plan” is an insult to everyone here—and to our ancestors.",
    "link": "https://slate.com/news-and-politics/2025/02/trump-gaza-strip-takeover-riviera-displace-palestinians.html",
    "timestamp": "2025-02-06T10:45:07Z"
  },
  {
    "title": "An Israeli nuclear attack in Syria? What's behind the baseless Iranian reports",
    "description": "The West believes that Tehran seeks an alibi in case it assembles a nuclear bomb. At this point, Trump doesn't seem willing to talk about a military strike against Iran",
    "link": "https://www.haaretz.com/israel-news/2025-02-06/ty-article/.premium/an-israeli-nuclear-attack-in-syria-whats-behind-the-baseless-iranian-reports/00000194-d759-ddbc-a1dd-d7dfa7760000",
    "timestamp": "2025-02-06T10:43:27Z"
  },
  {
    "title": "Prince Harry's Redacted Visa Files May Be Released, Judge Hints",
    "description": "Judge Carl Nichols said he wants \"maximum disclosure\" without violating Prince Harry's privacy, in a major U-turn.",
    "link": "https://www.newsweek.com/prince-harry-redacted-visa-released-judge-2027055",
    "timestamp": "2025-02-06T10:41:46Z"
  },
  {
    "title": "Trump Wants to Leave Schools to the States. That Has Never Been the American Way.",
    "description": "From the very start, the founders and Congress knew that schools were federal business.",
    "link": "https://slate.com/news-and-politics/2025/02/department-of-education-trump-abolish-eliminate.html",
    "timestamp": "2025-02-06T10:40:00Z"
  },
  {
    "title": "What to Know About the Court Cases Over Trump’s Birthright Citizenship Order",
    "description": "A federal judge is set to hear arguments Thursday over a longer-term pause of Trump's directive.",
    "link": "https://time.com/7213270/what-to-know-about-the-court-cases-over-trump-birthright-citizenship-order/",
    "timestamp": "2025-02-06T10:37:41Z"
  },
  {
    "title": "US VP Vance to attend security meet in Munich",
    "description": "Berlin (AFP) Feb 5, 2025\n\n\n US Vice President JD Vance will travel to Germany for a high-level security forum in Munich next week, Berlin said Wednesday. \n\n\"The American vice president is expected in Germany for the Munich Security Conference\" held on Februar…",
    "link": "https://www.spacewar.com/reports/US_VP_Vance_to_attend_security_meet_in_Munich_999.html",
    "timestamp": "2025-02-06T10:37:02Z"
  },
  {
    "title": "Japan's 'geeky' PM Ishiba to navigate Trump relations",
    "description": "Tokyo (AFP) Feb 6, 2025\n\n\n Days after Donald Trump's 2016 election victory, Japan's then-prime minister Shinzo Abe rushed to deliver him a gold-plated golf club, becoming the first leader to visit and setting the tone for a relationship both men said was clos…",
    "link": "https://www.spacewar.com/reports/Japans_geeky_PM_Ishiba_to_navigate_Trump_relations_999.html",
    "timestamp": "2025-02-06T10:37:02Z"
  },
  {
    "title": "Trump calls for work on new Iran nuclear deal to begin 'immediately'",
    "description": "Washington (AFP) Feb 5, 2025\n\n\n US President Donald Trump called Wednesday for a \"verified nuclear peace agreement\" with Iran, after withdrawing from a similar deal in his first term and instituting a so-called \"maximum pressure\" policy. \n\nOn Tuesday, ahead o…",
    "link": "https://www.spacewar.com/reports/Trump_calls_for_work_on_new_Iran_nuclear_deal_to_begin_immediately_999.html",
    "timestamp": "2025-02-06T10:37:02Z"
  },
  {
    "title": "Israel defence minister orders army to plan for 'voluntary' departures from Gaza",
    "description": "Jerusalem (AFP) Feb 6, 2025\n\n\n Israeli Defence Minister Israel Katz said Thursday that he had ordered the army to formulate a plan to allow Palestinians to leave Gaza. \n\n\"I have instructed the IDF (military) to prepare a plan to enable voluntary departure for…",
    "link": "https://www.terradaily.com/reports/Israel_defence_minister_orders_army_to_plan_for_voluntary_departures_from_Gaza_999.html",
    "timestamp": "2025-02-06T10:37:02Z"
  },
  {
    "title": "US Marine vet acquitted in NY subway death joins tech firm",
    "description": "Washington (AFP) Feb 5, 2025\n\n\n A US Marine veteran who was acquitted in the chokehold death of a homeless man on the New York subway - a high-profile case highlighting the divisive issue of race in America - has been hired by a major Silicon Valley firm alli…",
    "link": "https://www.spacewar.com/reports/US_Marine_vet_acquitted_in_NY_subway_death_joins_tech_firm_999.html",
    "timestamp": "2025-02-06T10:37:02Z"
  },
  {
    "title": "US-Japan summit: what to expect",
    "description": "Tokyo (AFP) Feb 6, 2025\n\n\n Japan's Prime Minister Shigeru Ishiba travels to the United States on Thursday, aiming to agree with President Donald Trump on steps to strengthen the two countries' alliance. \n\nHere are some issues that the leaders could discuss at…",
    "link": "https://www.spacewar.com/reports/US-Japan_summit_what_to_expect_999.html",
    "timestamp": "2025-02-06T10:37:02Z"
  },
  {
    "title": "Google targets enterprise adoption with low-cost AI model",
    "description": "The tech giant is becoming more assertive with its AI releases by introducing new experimental versions of Gemini and a low-end model.",
    "link": "https://www.techtarget.com/searchenterpriseai/news/366618784/Google-targets-enterprise-adoption-with-low-cost-AI-model",
    "timestamp": "2025-02-06T10:37:00Z"
  },
  {
    "title": "Netanyahu calls Trump's plan to transfer Gazans 'remarkable' and 'first good idea I've heard'",
    "description": "Prime Minister Netanyahu told Fox News that the plan to transfer Gaza's residents will 'create a different future for everyone.' When asked about the return of all hostages, he said 'We intend to commit to do that, I won't talk about how'",
    "link": "https://www.haaretz.com/israel-news/2025-02-06/ty-article/netanyahu-calls-trumps-plan-to-transfer-gazans-remarkable-first-good-idea-ive-heard/00000194-da35-df08-a3bc-de3d685c0000",
    "timestamp": "2025-02-06T10:35:59Z"
  },
  {
    "title": "North Koreans ‘disappear’ amid heavy Russian casualties in Ukraine war",
    "description": "South Korea's assessment comes as Ukraine’s stout defence takes a growing toll for every square kilometre Russia seizes.",
    "link": "https://www.aljazeera.com/news/2025/2/6/north-koreans-disappear-amid-heavy-russian-casualties-in-ukraine-war",
    "timestamp": "2025-02-06T10:34:32Z"
  },
  {
    "title": "Colombia’s president: Legalize cocaine, it’s no worse than whiskey",
    "description": "Global drug trafficking could be \"easily dismantled\" if coke was \"sold like wine,\" according to the Latin American leader.",
    "link": "https://www.politico.eu/article/colombia-president-gustavo-petro-legalize-cocaine-no-worse-than-whiskey-latin-america/",
    "timestamp": "2025-02-06T10:34:26Z"
  },
  {
    "title": "Wall St set for muted open after big corporate results; Honeywell dips",
    "description": "(Reuters) -Wall Street was on track for a flat opening on Thursday as investors evaluated earnings from companies including Honeywell and markets awaited U.S...",
    "link": "https://finance.yahoo.com/news/futures-tick-higher-run-big-103419434.html",
    "timestamp": "2025-02-06T10:34:19Z"
  },
  {
    "title": "Washington priest attacked by ‘disturbed gentleman’ as prayer service collapsed into chaos",
    "description": "Footage of the church's live stream captured the suspect jumping out of his seat in the first row pew and running towards the altar where the celebrants were kneeling.",
    "link": "https://nypost.com/2025/02/06/us-news/washington-priest-david-gaines-attacked-during-prayer-service-at-spokane-cathedral/",
    "timestamp": "2025-02-06T10:30:22Z"
  },
  {
    "title": "Trump administration expected to put EPA environmental justice and civil rights workers on administrative leave | CNN Politics",
    "description": "Environmental Protection Agency employees who work in the environmental justice and civil rights office expect a new round of paid leave notices that will impact even more federal workers, four sources familiar with the matter told CNN.",
    "link": "https://www.cnn.com/2025/02/06/politics/epa-workers-administrative-leave/index.html",
    "timestamp": "2025-02-06T10:30:08Z"
  },
  {
    "title": "'A clear overreaction': BMO's top strategist says investors shouldn't fear Trump's tariffs — and shares the best opportunities in North American markets",
    "description": "Investors are overreacting to tariff and trade drama, BMO Capital Markets says. Here's where to invest while the long-term market rally continues.",
    "link": "https://www.businessinsider.com/stock-market-outlook-trump-tariffs-us-canada-investing-strategy-bmo-2025-2",
    "timestamp": "2025-02-06T10:30:02Z"
  },
  {
    "title": "The wealthiest 0.01% are firing active managers and indexing or making contrarian bets, $500B Neuberger Berman says. Here's what they're buying.",
    "description": "The idea that ultra-high-net-worth individuals are more concerned with wealth preservation than alpha generation  isn't necessarily true.",
    "link": "https://www.businessinsider.com/how-wealthiest-investing-in-the-stock-market-2025-2025-2",
    "timestamp": "2025-02-06T10:30:02Z"
  },
  {
    "title": "EU vs. US or People vs. Billionaires?",
    "description": "Nick Shaxson\n\n\n\nTrump’s latest geopolitical moves are scary. But Americans and Europeans share a common foe.\r\n\n\r\n\n\nThe post EU vs. US or People vs. Billionaires? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/tech-silicon-valley-trump-data-oligarchs/",
    "timestamp": "2025-02-06T10:30:00Z"
  },
  {
    "title": "As the Super Bowl nears, New Orleans grapples with how safe is safe enough",
    "description": "A terrorist attack in New Orleans on New Year's Day that killed 14 people rattled the city. Some worry it remains vulnerable.",
    "link": "https://abcnews.go.com/US/super-bowl-nears-new-orleans-grapples-safe-safe/story?id=118451603",
    "timestamp": "2025-02-06T10:28:47Z"
  },
  {
    "title": "Bank of Korea Rate Cut Not a Done Deal This Month, Rhee Warns",
    "description": "Bank of Korea Governor Rhee Chang-yong pushed back against mounting speculation of an interest-rate cut later this month as he called for swift fiscal stimulus to shore up a sputtering economy further threatened by Donald Trump’s tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/bank-of-korea-rate-cut-not-a-done-deal-this-month-rhee-warns",
    "timestamp": "2025-02-06T10:27:41Z"
  },
  {
    "title": "Zimbabwe reacts to US removal of illegal immigrants",
    "description": "About 545 non-detained people from the southern African state are said to be on the American expulsion list Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/612261-zimbabwe-comments-us-deportation-illegal-migrants/",
    "timestamp": "2025-02-06T10:26:55Z"
  },
  {
    "title": "Technofeudalism Is War’s Handmaiden",
    "description": "War is in the air more than peace these days. This reflects not only the salience of well-known strategic traps, but also the rapid emergence of cloud capital, which is in steering the world into these traps in four distinct ways.",
    "link": "https://www.project-syndicate.org/commentary/rise-of-cloud-capital-makes-war-more-likely-by-yanis-varoufakis-2025-02",
    "timestamp": "2025-02-06T10:26:34Z"
  },
  {
    "title": "El tecno-feudalismo es el siervo de la guerra",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/rise-of-cloud-capital-makes-war-more-likely-by-yanis-varoufakis-2025-02/spanish",
    "timestamp": "2025-02-06T10:26:34Z"
  },
  {
    "title": "Market Wrap: D-Street ends lower ahead of RBI rate decision; Sensex sheds 213 points, Nifty below 23,650",
    "description": "Stock Market Highlights: Indian benchmark indices ended in the red on Thursday, paring early gains, driven by losses in heavyweight consumer stocks, as caution prevailed in the market ahead of Reserve Bank of India's monetary policy decision later this week a…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-street-ends-lower-ahead-of-rbi-rate-decision-sensex-sheds-213-points-nifty-below-23650/articleshow/117980207.cms",
    "timestamp": "2025-02-06T10:26:03Z"
  },
  {
    "title": "Trump's embrace of the world's biggest tech CEOs reorients the 'attention economy'",
    "description": "When President Donald Trump was flanked at his inauguration by tech titans Mark Zuckerberg, Jeff Bezos, Elon Musk and Sundar Pichai, with the CEOs of Apple and TikTok nearby, he was surrounded not just by a handful of the wealthiest men on the planet — but by…",
    "link": "https://biztoc.com/x/d9ffe22a267c077f",
    "timestamp": "2025-02-06T10:25:03Z"
  },
  {
    "title": "Changing the Game director: ‘Trans kid playing sports have to be activists – that’s not fair’",
    "description": "“Donald Trump was picking on kids for no reason other than it rallied his base. It worked,” says Michael Barnett, the director of Emmy Award-nominated documentary film Changing the Game, which follows the stories of three transgender high school athletes play…",
    "link": "https://www.thepinknews.com/2025/02/06/changing-the-game-michael-barnett-trans-sports-ban/",
    "timestamp": "2025-02-06T10:25:02Z"
  },
  {
    "title": "Bitcoin Worth $1.6B Leave Exchanges in Biggest Bullish Outflow Since April: Research Analyst",
    "description": "Coinbase alone registered a net outflow of over 15,000 BTC Wednesday, hinting at a major institutional purchases of coins.",
    "link": "https://www.coindesk.com/markets/2025/02/06/bitcoin-worth-usd1-6b-leave-exchanges-in-biggest-bullish-outflow-since-april-research-analyst",
    "timestamp": "2025-02-06T10:24:48Z"
  },
  {
    "title": "Israel's defence minister orders army to prepare for Gaza residents' departure",
    "description": "Israel's defence minister ordered the army on Thursday to prepare a plan to allow the \"voluntary departure\" of residents from Gaza, Israeli media said, after President Trump drew widespread condemnation over U.S. plans to take over the strip.",
    "link": "https://www.cbc.ca/news/world/israel-gaza-trump-1.7451944",
    "timestamp": "2025-02-06T10:22:47Z"
  },
  {
    "title": "Israel Begins Preparations for Gaza Exodus as Egypt Lobbies Against Trump Plan",
    "description": "Israel has begun preparations for the departure of large numbers of Palestinians from the Gaza Strip in line with Trump's plan.",
    "link": "https://time.com/7213262/israel-begins-preparations-gaza-exodus-egypt-lobbies-against-trump-plan/",
    "timestamp": "2025-02-06T10:20:10Z"
  },
  {
    "title": "US set to unveil Trump plan to end 3-year war in Ukraine",
    "description": "<p>US allies expect President <strong>Donald Trump</strong>&rsquo;s administration to present a long-awaited plan to <strong>end Russia&rsquo;s war on Ukraine</strong> at the Munich Security Conference in Germany next week, according to people familiar with t…",
    "link": "https://www.bangkokpost.com/world/2955585/us-set-to-unveil-trump-plan-to-end-3-year-war-in-ukraine",
    "timestamp": "2025-02-06T10:19:00Z"
  },
  {
    "title": "Mexican troops begin arriving at US-Mexico border following deal made to pause Trump-approved tariffs",
    "description": "Mexico has started deploying soldiers to its northern border in accordance with the 10,000 troops it promised to send to the border under a deal made with President Trump.",
    "link": "https://www.foxnews.com/us/mexican-troops-arriving-us-mexico-border-following-deal-made-pause-trump-approved-tariffs",
    "timestamp": "2025-02-06T10:18:04Z"
  },
  {
    "title": "Uganda's LGBTQ community faces anxiety and uncertainty after U.S. aid freeze",
    "description": "A non-profit organization supporting LGBTQ people in Uganda says its work is being threatened by U.S. President Donald Trump’s suspension of foreign aid. Pius Kennedy, a program officer with the Kampala-based nonprofit Africa Queer Network, said USAID had bee…",
    "link": "https://www.seattlepi.com/news/world/article/uganda-s-lgbtq-community-faces-anxiety-and-20150748.php",
    "timestamp": "2025-02-06T10:16:30Z"
  },
  {
    "title": "Google is eliminating its diversity hiring targets, joining other companies in scaling back DEI efforts",
    "description": "\"In 2020, we set aspirational hiring goals and focused on growing our offices outside California and New York to improve representation,\" Fiona Cicconi, Alphabet's chief people officer, said in an email to staff (via Reuters). \"...but in the future we will no…",
    "link": "https://www.techspot.com/news/106667-google-eliminating-diversity-hiring-targets-joining-other-companies.html",
    "timestamp": "2025-02-06T10:16:00Z"
  },
  {
    "title": "Shein and Temu adjust as Trump uncertainty enshrouds e-tailers",
    "description": "HONG KONG -- Chinese e-commerce platforms like Temu, Shein and Alibaba's AliExpress are racing into the unknown as U.S. President Donald Trump puts his stamp on trade and customs policy.\nTrump's new additional 10% tariff on Chinese imports took effect Monday,…",
    "link": "https://biztoc.com/x/707678287006000a",
    "timestamp": "2025-02-06T10:13:49Z"
  },
  {
    "title": "With Trump’s ideas, tone down the excitement-avoid disappointment",
    "description": "While Trump’s plan for Gaza is great, there is a long way to go before it can be implemented, so let us not get our hopes too high. Opinion.",
    "link": "https://www.israelnationalnews.com/news/403506",
    "timestamp": "2025-02-06T10:12:03Z"
  },
  {
    "title": "Donald Trump shuts down Afghan journalist on Taliban question, says 'beautiful voice but can't understand...'",
    "description": "Donald Trump’s response to a question by an Afghanistani reporter was widely shared on social media. The reporter asked the US President about the country’s ongoing struggles and the role of the Taliban in the same. But Donald Trump said that he could not und…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-shuts-down-afghan-journalist-on-taliban-question-says-beautiful-voice-but-cant-understand-a-word/articleshow/117978764.cms",
    "timestamp": "2025-02-06T10:11:30Z"
  },
  {
    "title": "Best Presales to Buy as Bitcoin Aims for $200K in 2025: Can Corporate Hype Push a Bull Run?",
    "description": "Standard Chartered envisions a $200K target for Bitcoin by the year’s end. Their analysis suggests that $BTC’s volatility is going to reduce massively now that the US ETF market matures and turns one year old. Another reason the banking group is bullish on Bi…",
    "link": "http://www.newsbtc.com/news/best-presales-to-buy-as-bitcoin-aims-for-200k-in-2025-can-corporate-hype-push-a-bull-run/",
    "timestamp": "2025-02-06T10:11:19Z"
  },
  {
    "title": "Shekel maintains strong rebound against US dollar",
    "description": "On Wednesday, the Bank of Israel set the representative shekel-dollar rate down 0.859% from Monday.",
    "link": "https://www.jpost.com/israel-news/article-840937",
    "timestamp": "2025-02-06T10:09:27Z"
  },
  {
    "title": "\"No Idea How She Reached US\": Questions Await Deported Indians Back Home",
    "description": "Of the 33 migrants who will reach their hometowns in Gujarat on Thursday after deportation from the US, many will come home to families that are clueless about how they reached the foreign country or why they have been deported.",
    "link": "https://www.ndtv.com/india-news/no-idea-how-she-reached-us-questions-await-deported-indians-back-home-7647910",
    "timestamp": "2025-02-06T10:04:36Z"
  },
  {
    "title": "‘Dude’ and other terms women use to keep men at non-romantic distance",
    "description": "WOMEN have a vast array of words at their disposal to keep men in the friend zone. Here are some that strongly suggest you've got no chance.",
    "link": "https://www.thedailymash.co.uk/news/relationships/dude-and-other-terms-women-use-to-keep-men-at-non-romantic-distance-20250206254597",
    "timestamp": "2025-02-06T10:04:02Z"
  },
  {
    "title": "Russia Ready To Play 'Hard Bargain' With Trump Over Ukraine",
    "description": "Russia is prepared to play a \"hard bargain\" with President Donald Trump over Ukraine, deputy foreign minister Sergei Ryabkov said on Wednesday.\nThe senior diplomat addressed the possibility of Trump brokering peace talks between Russia and Ukraine in remarks …",
    "link": "https://biztoc.com/x/0a0d8f2da0142242",
    "timestamp": "2025-02-06T10:03:21Z"
  },
  {
    "title": "Black National Anthem to Be Performed in Front of Trump at Super Bowl",
    "description": "President Donald Trump is set to attend the Super Bowl in New Orleans on Sunday, which means he will watch a rendition of the Black national anthem.\nNewsweek reached out to the White House and the NFL outside of regular working hours via email for comment.\nWh…",
    "link": "https://biztoc.com/x/0d40fef69ae5a40a",
    "timestamp": "2025-02-06T10:03:18Z"
  },
  {
    "title": "Map Reveals Donald Trump's Favorability Rating by State",
    "description": "Donald Trump has a positive favorability rating, meaning more people have a positive view of him than a negative one, in half of the U.S. states, according to new data.\nThe Context\nIt is common for a president's favorability rating to improve at the start of …",
    "link": "https://biztoc.com/x/c39256f998fd4cc4",
    "timestamp": "2025-02-06T10:02:53Z"
  },
  {
    "title": "DOGE Access to Treasury Records Restricted by Justice Department",
    "description": "A lawsuit accused the Treasury Department of allowing Elon Musk's team \"unlawful access\" to federal employees' private information.",
    "link": "https://www.newsweek.com/doge-access-treasury-records-restricted-justice-department-2027046",
    "timestamp": "2025-02-06T10:02:34Z"
  },
  {
    "title": "Russia Ready To Play 'Hard Bargain' With Trump Over Ukraine",
    "description": "\"It is up to [Donald] Trump and his team to make a decision,\" said Russia's deputy foreign minister Sergei Ryabkov.",
    "link": "https://www.newsweek.com/russia-ukraine-trump-ukraine-peace-talks-2027074",
    "timestamp": "2025-02-06T10:01:40Z"
  },
  {
    "title": "Israeli defense minister orders IDF to plan for Gazans to leave in line with Trump's controversial proposal",
    "description": "Defense Minister Israel Katz on Thursday ordered the IDF to prepare a plan for residents of Gaza who wish to leave and applauded President Donald Trumps \"bold plan.\"",
    "link": "https://www.foxnews.com/politics/israeli-defense-minister-orders-idf-plan-gazans-leave-line-trumps-controversial-proposal",
    "timestamp": "2025-02-06T10:01:04Z"
  },
  {
    "title": "Congress must confront the national security threat posed by sanctuary cities",
    "description": "I introduced the No Congressional Funds for Sanctuary Cities Act. It will prevent funding from being allocated to sanctuary cities that hinder immigration enforcement efforts.",
    "link": "https://www.foxnews.com/opinion/congress-must-confront-national-security-threat-posed-sanctuary-cities",
    "timestamp": "2025-02-06T10:00:52Z"
  },
  {
    "title": "Left-Wing Militant Group Pushing Anti-ICE Protests in LA Teaches ‘Self-Defense’ Classes To Fend Off Deportation Raids",
    "description": "A radical left-wing group, Unión del Barrio (UdB), is offering \"self-defense\" training to combat Immigration and Customs Enforcement raids. The Latino-focused organization, which models itself on militant groups like the Black Panthers, is also trying to recr…",
    "link": "https://freebeacon.com/crime/left-wing-militant-group-pushing-anti-ice-protests-in-la-teaches-self-defense-classes-to-fend-off-deportation-raids/",
    "timestamp": "2025-02-06T10:00:50Z"
  },
  {
    "title": "Morning Glory: Trump Derangement Syndrome was real. So is 'Long TDS'",
    "description": "Trump Derangement Syndrome is back with a vengeance. Three weeks into the president's second term and those 'neutral' journalists can't help themselves. They are on the attack.",
    "link": "https://www.foxnews.com/opinion/morning-glory-trump-derangement-syndrome-real-so-long-tds",
    "timestamp": "2025-02-06T10:00:08Z"
  },
  {
    "title": "Resistance Media Lives!",
    "description": "The Bulwark is exploding in popularity, expanding its audience beyond anti-Trump Republicans to include swaths of people who are dismayed by the way traditional news outlets are covering Donald Trump.",
    "link": "http://nymag.com/intelligencer/article/the-bulwark-is-leading-the-anti-trump-resistance.html",
    "timestamp": "2025-02-06T10:00:02Z"
  },
  {
    "title": "Map Reveals Donald Trump's Favorability Rating by State",
    "description": "The Republican president has a positive favorability rating in half of the U.S. states, according to new data.",
    "link": "https://www.newsweek.com/donald-trump-favorability-rating-state-2026539",
    "timestamp": "2025-02-06T10:00:01Z"
  },
  {
    "title": "Trump’s Imperialism Puts Americans Last",
    "description": "The president demands more territory from Greenland to Gaza as if America were a real estate holding company. But most Americans won’t get a penny. \nThe post Trump’s Imperialism Puts Americans Last appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/02/06/trumps-imperialism-puts-americans-last/",
    "timestamp": "2025-02-06T10:00:00Z"
  },
  {
    "title": "On Reagan’s birthday, how he and Trump helped Make America Great Again",
    "description": "It's President Reagan's birthday. He's one of two US leaders who worked to Make America Great Again. President Trump shares that role, along with a devotion to the nation and its people.",
    "link": "https://www.foxnews.com/opinion/reagans-birthday-how-trump-helped-make-america-great-again",
    "timestamp": "2025-02-06T10:00:00Z"
  },
  {
    "title": "“We Feel Terrorized”: What EPA Employees Say About the Decision to Stay or Go Under Trump",
    "description": "by Sharon Lerner and Pratheek Rebala \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nIn the face of the Trump administration’s aggressive effor…",
    "link": "https://www.propublica.org/article/epa-workers-resign-trump",
    "timestamp": "2025-02-06T10:00:00Z"
  }
]