[
  {
    "title": "The left-behind men who crave pride, battle shame – and voted for Trump",
    "description": "What is the gut-level appeal that saw Trump win two elections? One progressive researcher spent six years in America’s whitest, second-poorest district to find out.",
    "link": "https://theconversation.com/the-left-behind-men-who-crave-pride-battle-shame-and-voted-for-trump-247126",
    "timestamp": "2025-04-07T20:10:26Z"
  },
  {
    "title": "Trump says Iran would be in 'great danger' if direct talks fail",
    "description": "President Donald Trump said on Monday that Iran would be in \"great danger\" if ongoing direct talks between the US and the Middle East country fail.\"I think if the talks aren't successful with Iran, I think Iran's going to be in great danger,\" Trump said. \"Ira…",
    "link": "https://www.jpost.com/breaking-news/article-849270",
    "timestamp": "2025-04-07T20:09:56Z"
  },
  {
    "title": "“I appreciate what the President is doing on tariffs...Australia has sold $29 billion worth of beef in the United States, and we haven't been able to sell one hamburger in Australia because of barriers…you look at these numbers, and the ranchers...\"",
    "description": "“I appreciate what the President is doing on tariffs...Australia has sold $29 billion worth of beef in the United States, and we haven't been able to sell one hamburger in Australia because of barriers…you look at these numbers, and the ranchers of Wyoming ar…",
    "link": "https://freerepublic.com/focus/f-news/4309507/posts",
    "timestamp": "2025-04-07T20:09:46Z"
  },
  {
    "title": "Does a Bear Market Mean a Recession is Coming? What We Know",
    "description": "Stocks have approached bear market levels as President Donald Trump's new tariffs have sparked concerns of a recession.",
    "link": "https://www.newsweek.com/bear-market-stock-market-recession-donald-trump-tariffs-2056499",
    "timestamp": "2025-04-07T20:09:42Z"
  },
  {
    "title": "US stocks sink again as tariff war heats up",
    "description": "The Wall Street slide has continued as the White House doubled down on tariffs against Beijing Read Full Article at RT.com",
    "link": "https://www.rt.com/business/615365-us-stocks-down-tariffs/",
    "timestamp": "2025-04-07T20:09:18Z"
  },
  {
    "title": "The trouble with Labor in Victoria - and what reckoning there might be at the federal election",
    "description": "We’ve been here before - a state Labor government on the nose, a federal election looming, and federal Labor desperate to minimise the damage in Victoria.",
    "link": "https://theconversation.com/the-trouble-with-labor-in-victoria-and-what-reckoning-there-might-be-at-the-federal-election-248118",
    "timestamp": "2025-04-07T20:08:55Z"
  },
  {
    "title": "Nine die in Mexico drug rehab clinic attack",
    "description": "Gunmen shot up a drug rehab clinic in Mexico’s troubled Sinaloa state om Monday, killing nine people and injuring several more in the seventh such attack in months, the local government said. Officials believe cartels are targeting addiction treatment centers…",
    "link": "https://punchng.com/nine-die-in-mexico-drug-rehab-clinic-attack/",
    "timestamp": "2025-04-07T20:08:47Z"
  },
  {
    "title": "Donald Trump has gatecrashed the federal election. It’s creating huge challenges for Australia’s next government",
    "description": "The US alliance will endure despite Trump’s efforts to upend the global order. But whoever wins the May 3 election must boost engagement with regional partners.",
    "link": "https://theconversation.com/donald-trump-has-gatecrashed-the-federal-election-its-creating-huge-challenges-for-australias-next-government-251912",
    "timestamp": "2025-04-07T20:08:42Z"
  },
  {
    "title": "Ted Cruz Urges Trump to Listen to ‘Angel’ Elon Musk on Trade",
    "description": "Senator Ted Cruz extended his critique of President Donald Trump’s tariffs and said there are “angels and demons” vying for influence as the White House plans to impose the steepest US trade duties in more than a century.",
    "link": "https://financialpost.com/pmn/business-pmn/ted-cruz-urges-trump-to-listen-to-angel-elon-musk-on-trade",
    "timestamp": "2025-04-07T20:08:39Z"
  },
  {
    "title": "Livestream: Israel's systematic murder of children",
    "description": "We talked about the new documentary “Kids Under Fire,” heard from a nurse on the horrific conditions in Gaza, discussed the latest on Mahmoud Khalil’s court cases and much more.",
    "link": "https://electronicintifada.net/blogs/eli-gerzon/livestream-israels-systematic-murder-children",
    "timestamp": "2025-04-07T20:08:10Z"
  },
  {
    "title": "Samsung Q1 profit to drop on weak AI chip sales",
    "description": "Amid fall in demand among Chinese customers.",
    "link": "https://www.itnews.com.au/news/samsung-q1-profit-to-drop-on-weak-ai-chip-sales-616358?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+",
    "timestamp": "2025-04-07T20:08:00Z"
  },
  {
    "title": "Samsung Q1 profit to drop 21% on weak AI chip sales, foundry losses",
    "description": "Amid fall in demand among Chinese customers.",
    "link": "https://www.itnews.com.au/news/samsung-q1-profit-to-drop-21-on-weak-ai-chip-sales-foundry-losses-616358?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2025-04-07T20:08:00Z"
  },
  {
    "title": "Samsung Q1 profit to drop on weak AI chip sales",
    "description": "Amid fall in demand among Chinese customers.",
    "link": "https://www.itnews.com.au/news/samsung-q1-profit-to-drop-on-weak-ai-chip-sales-616358?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Technology+feed",
    "timestamp": "2025-04-07T20:08:00Z"
  },
  {
    "title": "Samsung Q1 profit to drop on weak AI chip sales",
    "description": "Amid fall in demand among Chinese customers.",
    "link": "https://www.itnews.com.au/news/samsung-q1-profit-to-drop-on-weak-ai-chip-sales-616358?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2025-04-07T20:08:00Z"
  },
  {
    "title": "Trump dubs tariff naysayers in MAGA part of new ‘weak, stupid’ Panican party",
    "description": "Having already coined “covfefe” and “bigly,” President Donald Trump now added another word to the English language: “Panican.”\n\n\nTrump told Americans in a post to Truth Social that they must remain “Strong, Courageous, and Patient” as the results of his newly…",
    "link": "https://www.dailydot.com/debug/trump-panican-party-tariffs/",
    "timestamp": "2025-04-07T20:07:38Z"
  },
  {
    "title": "Larry Fink says we are 'probably' in a recession, but don't sell your stocks just yet",
    "description": "Larry Fink of BlackRock says that most of the CEOs he has been talking to \"would say we are probably in a recession right now.\"",
    "link": "https://www.businessinsider.com/larry-fink-blackrock-recession-buying-opportunities-2025-4",
    "timestamp": "2025-04-07T20:07:10Z"
  },
  {
    "title": "US 'controlling and owning' Gaza would be good, Trump says again",
    "description": "Trump added that he was confused as to “why Israel ever gave (Gaza) up,\" adding that it was \"a great location that nobody wants to live in.”",
    "link": "https://www.jpost.com/breaking-news/article-849269",
    "timestamp": "2025-04-07T20:05:54Z"
  },
  {
    "title": "Maine sues Trump admin over funding freeze for refusal to keep trans athletes out of women's sports",
    "description": "Maine filed a lawsuit against the U.S. Department of Agriculture over a funding freeze the agency levied on the state for its refusal to alter its participation policy in sports.",
    "link": "https://www.foxnews.com/sports/maine-sues-trump-admin-over-funding-freeze-refusal-keep-trans-athletes-out-womens-sports",
    "timestamp": "2025-04-07T20:05:41Z"
  },
  {
    "title": "Miami Multifamily and Mixed-Use Up Against Changes in 2025: Forum",
    "description": "Tariff was the word of the day at Commercial Observer’s Miami Multifamily & Mixed-Use Forum held April 3 at the Wynwood Plaza. The day before, President Donald Trump had announced broad tariffs on virtually all foreign countries except Russia and Belarus. Dur…",
    "link": "http://commercialobserver.com/2025/04/miami-multifamily-mixed-use-forum/",
    "timestamp": "2025-04-07T20:05:36Z"
  },
  {
    "title": "3 strategies to keep your money safe amid market volatility",
    "description": "Many investors are wondering how to keep their money safe. Financial advisors suggest strategies to manage through the market volatility.",
    "link": "https://www.cnbc.com/2025/04/07/strategies-to-keep-your-money-safe-amid-market-volatility.html",
    "timestamp": "2025-04-07T20:05:18Z"
  },
  {
    "title": "Rumble & Rebel News sue MP Saks & others for conspiring to violate free speech rights",
    "description": "TORONTO, April 07, 2025 (GLOBE NEWSWIRE) -- Rumble Canada, (NASDAQ: RUM), the high-growth video platform and cloud services provider, has joined Rebel News Network and its founder, Ezra Levant, in suing the government of Canada, Member of Canadian Parliament …",
    "link": "https://www.globenewswire.com/news-release/2025/04/07/3057202/0/en/Rumble-Rebel-News-sue-MP-Saks-others-for-conspiring-to-violate-free-speech-rights.html",
    "timestamp": "2025-04-07T20:05:00Z"
  },
  {
    "title": "Trump on Ukraine war: Not happy about 'crazy' bombing",
    "description": "United States President Donald Trump expressed on Monday his dissatisfaction with the \"crazy\" bombing happening in Eastern Europe.\"We are meeting with Russia. We are meeting with Ukraine. We are getti...",
    "link": "https://biztoc.com/x/8c3da2a2d0d02819",
    "timestamp": "2025-04-07T20:04:00Z"
  },
  {
    "title": "Wall Street edges up in choppy trade as Trump digs in on tariffs",
    "description": "Early on Monday, all three major U.S. indexes touched their lowest levels in more than a year, and the CBOE Volatility index breached 60 points, which was its highest level since August 2024. In the afternoon, the volatility index, seen as Wall Street's fear …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-edges-up-in-choppy-trade-as-trump-digs-in-on-tariffs/articleshow/120074785.cms",
    "timestamp": "2025-04-07T20:03:52Z"
  },
  {
    "title": "What Trump and his administration have said about the tariffs policy currently roiling global markets",
    "description": "President Donald Trump has proposed sweeping tariffs targeting U.S. trading partners, including a 10% across-the-board baseline tariff that went into effect Saturday.",
    "link": "https://biztoc.com/x/c58299232d628607",
    "timestamp": "2025-04-07T20:03:52Z"
  },
  {
    "title": "US closes mixed after tariff confusion",
    "description": "Major stock market indexes in the United States closed mixed on Monday after President Donald Trump confirmed he would not implement a 90-day suspension on his most recent tariffs, denying a previous ...",
    "link": "https://biztoc.com/x/e4a999d8708355f5",
    "timestamp": "2025-04-07T20:03:52Z"
  },
  {
    "title": "China Can't Win a Trade War Against the U.S. for One Simple Reason | Opinion",
    "description": "Today, President Donald Trump threatened an additional 50 percent tariff on Chinese goods if Beijing did not rescind by tomorrow its retaliatory 34 percent tariff imposed Friday.\nThe Chinese rate is the same as that Trump slapped on Chinese products on April …",
    "link": "https://biztoc.com/x/9e8e3ac3c77c897c",
    "timestamp": "2025-04-07T20:03:40Z"
  },
  {
    "title": "EU Prepares Two Rounds of Tariffs in Response to US Moves",
    "description": "The European Union reportedly hopes to reach a deal with the U.S. to remove and prevent the country’s new tariffs, but is ready to start implementing countermeasures. The EU is set to approve one set of tariffs targeting the U.S. on April 15 and plans to impl…",
    "link": "https://www.pymnts.com/economy/2025/eu-prepares-two-rounds-of-tariffs-in-response-to-us-moves/",
    "timestamp": "2025-04-07T20:03:37Z"
  },
  {
    "title": "US tariffs cause share value decline for Japanese game companies",
    "description": "Summary: The share value decreased this morning for several Japanese game companies due to US tariffs. Companies impacted by the tariffs include Sony,",
    "link": "https://www.androidheadlines.com/2025/04/us-tariffs-cause-share-value-decline-for-japanese-game-companies.html",
    "timestamp": "2025-04-07T20:03:36Z"
  },
  {
    "title": "Trump Says US In \"Direct Talks\" With Iran Over Nuclear Program",
    "description": "US President Donald Trump said Monday that he has begun &quot;direct talks&quot; with Iran &quot;at almost the highest level&quot; over its nuclear program.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-us-in-direct-talks-with-iran-over-nuclear-program-8111644",
    "timestamp": "2025-04-07T20:03:25Z"
  },
  {
    "title": "Trump uses child abuse proclamation to attack transgender people",
    "description": "President Donald Trump used two national awareness proclamations last week—intended to spotlight child abuse and sexual assault prevention—as vehicles to attack transgender people and undocumented immigrants. The proclamations, released on back-to-back days, …",
    "link": "https://www.advocate.com/politics/trump-transgender-child-abuse-proclamation",
    "timestamp": "2025-04-07T20:02:23Z"
  },
  {
    "title": "Trump Reveals the U.S. Is Negotiating Directly With Iran at a ‘Very High Level’ on a Nuclear Deal",
    "description": "President Donald Trump revealed on Monday that the United States will engage in direct, high level negotiations with Iran on a potential nuclear deal.\nThe post Trump Reveals the U.S. Is Negotiating Directly With Iran at a ‘Very High Level’ on a Nuclear Deal f…",
    "link": "https://www.mediaite.com/news/trump-reveals-the-u-s-is-negotiating-directly-with-iran-at-a-very-high-level-on-a-nuclear-deal/",
    "timestamp": "2025-04-07T20:01:51Z"
  },
  {
    "title": "Trump's 'Dictator' Style Birthday Parade Will Cost Taxpayers Millions: Report",
    "description": "President Donald Trump is pushing ahead with a massive, taxpayer-funded military parade on his birthday that will cost millions.",
    "link": "https://www.ibtimes.com/trumps-dictator-style-birthday-parade-will-cost-taxpayers-millions-report-3769121",
    "timestamp": "2025-04-07T20:01:47Z"
  },
  {
    "title": "Letters: No study of Peña Blvd needed. Just widen the route to the airport route",
    "description": "How about we save the $15 million and get started now on what’s obviously needed -- expansion of Peña Boulevard. No study necessary. -- Larry Harmsen, Englewood",
    "link": "https://www.denverpost.com/2025/04/07/airport-traffic-pena-blvd-widen-study/",
    "timestamp": "2025-04-07T20:01:29Z"
  },
  {
    "title": "President Trump orders review of review of U.S. Steel acquisition by Nippon Steel",
    "description": "President Donald Trump has ordered the Committee on Foreign Investment to review the potential acquisition of U.S. Steel by Nippon Steel.",
    "link": "https://www.wpxi.com/news/local/president-trump-orders-review-review-us-steel-acquisition-by-nippon-steel/QXYMP7D7YVEPNMEK7VXHR7QEYA/",
    "timestamp": "2025-04-07T20:00:35Z"
  },
  {
    "title": "Bridal Companies Appeal to President Trump About Tariffs",
    "description": "More than 2,300 representatives from the bridal industry have signed a petition seeking an exemption from the reciprocal tariffs.",
    "link": "http://wwd.com/business-news/business-features/bridal-trump-tariffs-wedding-gown-1237076744/",
    "timestamp": "2025-04-07T20:00:29Z"
  },
  {
    "title": "Trump Is Back. So Are Millions of Protesters",
    "description": "Nationwide demonstrations prove the president’s chaos agenda is finally breaking through to the broader public.",
    "link": "https://www.vanityfair.com/news/story/trump-protesters-democrats-liberals-maga",
    "timestamp": "2025-04-07T20:00:07Z"
  },
  {
    "title": "Shell Cuts Gas Output Guidance on Unplanned Maintenance",
    "description": "Shell Plc sees lower natural gas production and LNG volumes in the first quarter of 2025 than previously expected.",
    "link": "https://www.rigzone.com/news/wire/shell_cuts_gas_output_guidance_on_unplanned_maintenance-07-apr-2025-180161-article/",
    "timestamp": "2025-04-07T20:00:01Z"
  },
  {
    "title": "Maryland lawmakers closer to passing roadblock to ICE deportation effort",
    "description": "Maryland's House of Delegates passed a new bill that would ban agents from the U.S. Immigration and Customs Enforcement (ICE) from entering sensitive places.",
    "link": "https://www.foxnews.com/politics/maryland-lawmakers-closer-passing-roadblock-ice-deportation-effort",
    "timestamp": "2025-04-07T19:59:05Z"
  },
  {
    "title": "Trump threatens China with extra 50% tariff",
    "description": "President Donald Trump has threatened China with an additional 50% tariff if Beijing does not rescind its retaliatory levies on US goods Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615364-trump-threatens-china-tariff/",
    "timestamp": "2025-04-07T19:58:36Z"
  },
  {
    "title": "Jamie Dimon warns on trade war after Wall Street CEOs met Howard Lutnick on tariffs",
    "description": "The meeting, hosted by the Financial Services Forum, an industry lobby group, took place on Thursday in Washington a day after the tariffs were announced, according to a source familiar with the meeting. Lutnick discussed President Donald Trump's strategy and…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jamie-dimon-warns-on-trade-war-after-wall-street-ceos-met-howard-lutnick-on-tariffs/articleshow/120074773.cms",
    "timestamp": "2025-04-07T19:57:33Z"
  },
  {
    "title": "Warren Buffett's $334 billion cash pile proves a masterstroke; here's why every investor should study his strategy closely",
    "description": "Warren Buffett's Berkshire Hathaway held a massive $334 billion in cash. This strategy proved beneficial amidst economic uncertainty. Buffett emphasized the importance of deploying capital wisely for economic growth. He critiqued policies like tariffs, highli…",
    "link": "https://economictimes.indiatimes.com/news/international/us/warren-buffetts-334-billion-cash-pile-proves-a-masterstroke-heres-why-every-investor-should-study-his-strategy-closely/articleshow/120074029.cms",
    "timestamp": "2025-04-07T19:57:23Z"
  },
  {
    "title": "Trump says US engaged in 'direct talks' with Iran over nuclear weapons",
    "description": "Trump says US engaged in 'direct talks' with Iran over nuclear weaponsgo.com",
    "link": "https://abcnews.go.com/Politics/trump-us-engage-direct-talks-iran/story?id=120571653",
    "timestamp": "2025-04-07T19:56:07Z"
  },
  {
    "title": "Trump Says \"Not Looking\" At Pause In Tariffs",
    "description": "U.S. President Donald Trump said on Monday he was not looking at a pause on tariffs to allow for negotiations with trading partners but said he would talk to China, Japan and other countries about the duties.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-not-looking-at-pause-in-tariffs-8111616",
    "timestamp": "2025-04-07T19:55:29Z"
  },
  {
    "title": "U.S. tariffs turmoil weighs down European stocks",
    "description": "BRUSSELS, April 7 (Xinhua) -- European stocks plunged on Monday, falling by an average of around 5 percent, as mounting concerns over U.S. tariffs continued to rattle global markets. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/08/us-tariffs-turmoil-weighs-down-european-stocks",
    "timestamp": "2025-04-07T19:55:00Z"
  },
  {
    "title": "Trump’s tariff war breaks the rules – and dares the world to stop him",
    "description": "Washington rewrites trade law by ignoring it Read Full Article at RT.com",
    "link": "https://www.rt.com/business/615361-trumps-tariff-war-breaks-rules/",
    "timestamp": "2025-04-07T19:54:01Z"
  },
  {
    "title": "China Can't Win a Trade War Against the U.S. for One Simple Reason | Opinion",
    "description": "The trade war is on. Who backs down? It isn't going to be the U.S., and for good reason.",
    "link": "https://www.newsweek.com/china-cant-win-trade-war-against-us-one-simple-reason-opinion-2056525",
    "timestamp": "2025-04-07T19:53:28Z"
  },
  {
    "title": "US 'turns a blind eye', says American-Palestinian after son killed by Israel",
    "description": "by Louis Baudoin-LaarmanAmerican-Palestinian Muhammad Rabee feels abandoned by the United States, he told AFP on Monday, a day after Israeli forces killed his 14-year-old son during a family visit in the occupied West Bank.Rabee's family live in New Jersey, a…",
    "link": "https://www.rawstory.com/palestine/",
    "timestamp": "2025-04-07T19:53:08Z"
  },
  {
    "title": "Trump: Rates are coming down",
    "description": "United States President Donald Trump stressed on Monday while speaking to journalists at the Oval Office that interest rates are \"coming down.\"\"Energy is down. Interest rates are down. Food is down. E...",
    "link": "https://biztoc.com/x/74b498a5da477c59",
    "timestamp": "2025-04-07T19:52:55Z"
  },
  {
    "title": "Trump not looking at pausing tariffs",
    "description": "US President Donald Trump said he's \"not looking at that\" when asked about a potential pause on tariffs.\"We are not looking at that. We have many many countries that are coming to negotiate deals with...",
    "link": "https://biztoc.com/x/b660b6ab61934de6",
    "timestamp": "2025-04-07T19:52:40Z"
  },
  {
    "title": "Harris team crafted federal judge 'death-pool roster' to swear her in should Biden die as president, book says",
    "description": "A new book claims that Harris’ White House communications director Jamal Simmons crafted an entire communications strategy to employ in the event of Biden’s death.",
    "link": "https://www.foxnews.com/politics/harris-team-crafted-federal-judge-death-pool-roster-swear-her-should-biden-die-president-book-says",
    "timestamp": "2025-04-07T19:51:41Z"
  },
  {
    "title": "Pro-Palestinian Students Fearing Deportation Scramble To Erase Opinions From Newspaper Articles",
    "description": "Foreign students are reportedly asking campus newspapers to scrub their comments as the Trump administration deports alleged terrorism supporters.",
    "link": "https://dailycaller.com/2025/04/07/pro-palestinian-students-fearing-deportation-scramble-to-erase-opinions-from-newspaper-articles/",
    "timestamp": "2025-04-07T19:51:11Z"
  },
  {
    "title": "Trump orders new review of U.S. Steel acquisition by Japan's Nippon Steel",
    "description": "President Donald Trump on Monday ordered the proposed acquisition of U.S. Steel by Japan's Nippon Steel to undergo a new review after the deal was blocked by President Joe Biden. Trump directed the Committee on Foreign Investment in the United States to revie…",
    "link": "https://freerepublic.com/focus/f-news/4309505/posts",
    "timestamp": "2025-04-07T19:50:40Z"
  },
  {
    "title": "Ohtani, Betts and World Series champion Dodgers visit Trump at the White House",
    "description": "Trump singled out several Dodgers for their achievements last season.",
    "link": "https://www.bostonherald.com/2025/04/07/trump-dodgers/",
    "timestamp": "2025-04-07T19:50:32Z"
  },
  {
    "title": "Painter of the 'worst' Trump portrait denies it was done with 'purposeful distortion' or bias",
    "description": "Sarah A. Boardman says that in the six years since she painted the portrait, she has 'received overwhelmingly positive feedback,' but since Trump’s comments 'that has changed'",
    "link": "https://nationalpost.com/news/worst-trump-portrait-painter-interview",
    "timestamp": "2025-04-07T19:50:28Z"
  },
  {
    "title": "Donald Trump gives Shohei Ohtani star treatment during Dodgers Oval Office visit",
    "description": "The Los Angeles Dodgers are basking in the glow of a triumphant 2024 season, their first with Shohei Ohtani on the roster, and it couldn&apos;t have gone much better. They racked u",
    "link": "https://www.marca.com/en/mlb/los-angeles-dodgers/2025/04/07/67f41ad4ca4741836d8b45b9.html",
    "timestamp": "2025-04-07T19:50:13Z"
  },
  {
    "title": "Oil Futures Continue Slide",
    "description": "Crude's rapid decline has triggered bearish trading, profit warnings, and growing expectations for Federal Reserve rate cuts.",
    "link": "https://www.rigzone.com/news/wire/oil_futures_continue_slide-07-apr-2025-180162-article/",
    "timestamp": "2025-04-07T19:50:02Z"
  },
  {
    "title": "This is the reason why US President Donald Trump has imposed tariffs on even uninhabited islands",
    "description": "Commerce Secretary Howard Lutnick defended tariffs on remote islands populated only by penguins. He said no country or territory is exempt, to prevent trade circumvention. The move follows concerns that countries reroute goods to bypass tariffs. Australia cri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/this-is-the-reason-why-us-president-donald-trump-has-imposed-tariffs-on-even-uninhabited-islands/articleshow/120074696.cms",
    "timestamp": "2025-04-07T19:49:43Z"
  },
  {
    "title": "What Trump and his administration have said about the tariffs policy currently roiling global markets",
    "description": "President Donald Trump has proposed sweeping tariffs targeting U.S. trading partners, including a 10% across-the-board baseline tariff that went into effect Saturday.",
    "link": "https://www.nbcnews.com/business/economy/what-trump-administration-said-about-tariffs-rcna199281",
    "timestamp": "2025-04-07T19:49:34Z"
  },
  {
    "title": "Trump Confronted on ‘Mixed Messages’ From Administration About Whether Tariffs Are Permanent",
    "description": "President Donald Trump was confronted over mixed messaging on his tariffs by different members of his administration on Monday while fielding questions from reporters alongside Israeli Prime Minister Benjamin Netanyahu. Sunday, Trump surrogates discussed the …",
    "link": "https://www.mediaite.com/tv/trump-confronted-on-mixed-messages-from-administration-about-whether-tariffs-are-permanent/",
    "timestamp": "2025-04-07T19:49:15Z"
  },
  {
    "title": "Remaining Afghanistan, Yemen aid hit by new Trump administration cuts, sources say",
    "description": "WASHINGTON (Reuters) - President Donald Trump's administration is ending most if not all of remaining U.S. aid for Afghanistan and Yemen, according to nine sources, including six U.S. officials familiar with the matter, a move expected to drive the countries …",
    "link": "https://www.thestar.com.my/news/world/2025/04/08/remaining-afghanistan-yemen-aid-hit-by-new-trump-administration-cuts-sources-say",
    "timestamp": "2025-04-07T19:47:00Z"
  },
  {
    "title": "Trump says not looking at tariff pause, will talk to China",
    "description": "U.S. President Donald Trump said on Monday he was not looking at a pause on tariffs to allow for negotiations with trading partners but said he would talk to...",
    "link": "https://www.yahoo.com/news/trump-says-not-looking-tariff-194621105.html",
    "timestamp": "2025-04-07T19:46:21Z"
  },
  {
    "title": "House Speaker Mike Johnson Says House Will Give Trump Space On Tariffs",
    "description": "House Speaker Mike Johnson said the House would give President Donald Trump space to try to fix the economy, despite frustration around tariffs growing among other Republicans.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/04/07/house-speaker-mike-johnson-says-house-will-give-trump-space-on-tariffs/",
    "timestamp": "2025-04-07T19:46:11Z"
  },
  {
    "title": "Will Trump Negotiate Tariffs? President Orders Talks With Japan And Says He Wants ‘Fair Deals’ With Other Countries",
    "description": "Trump has expressed openness to reaching a deal with countries, even as other officials in his administration have insisted his tariffs aren’t a negotiation.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/04/07/will-trump-negotiate-tariffs-president-orders-talks-with-japan-and-says-he-wants-fair-deals-with-other-countries/",
    "timestamp": "2025-04-07T19:46:03Z"
  },
  {
    "title": "'Serious crisis': Analyst warns even Trump's 'die-hard MAGA' fans may soon jump ship",
    "description": "Even the staunchest MAGA Republicans who vehemently argue in favor of President Donald Trump's tariffs could jump ship in the case of a full-blown recession, a new opinion piece in Salon posited.Columnist Heather Digby Parton wrote in Monday's column that the…",
    "link": "https://www.rawstory.com/trump-recession-2671687093/",
    "timestamp": "2025-04-07T19:45:43Z"
  },
  {
    "title": "Appeals court restores DOGE access to sensitive information at US agencies",
    "description": "It's a win for the Trump administration as the underlying lawsuit plays out.",
    "link": "https://www.bostonherald.com/2025/04/07/doge-access-ruling/",
    "timestamp": "2025-04-07T19:45:23Z"
  },
  {
    "title": "Susan Collins breaks with Republican Party again, this time opposing Medicaid cuts",
    "description": "Maine's Republican senator has twice voted against members of her party in recent days, including a vote against a budget resolution over the weekend.",
    "link": "https://www.pressherald.com/2025/04/07/susan-collins-breaks-with-party-again-this-time-opposing-medicaid-cuts/",
    "timestamp": "2025-04-07T19:44:55Z"
  },
  {
    "title": "More than a department store: The long, complicated legacy behind Hudson’s Bay Company",
    "description": "Like the beaver it nearly wiped out, HBC made Canada into its home by fundamentally transforming its environment, and no bankruptcy court will liquidate that legacy.",
    "link": "https://theconversation.com/more-than-a-department-store-the-long-complicated-legacy-behind-hudsons-bay-company-253818",
    "timestamp": "2025-04-07T19:43:07Z"
  },
  {
    "title": "Palestinians In West Bank Strike To Demand End To Gaza War",
    "description": "Shuttered storefronts lined empty streets in Israeli-annexed east Jerusalem and the occupied West Bank on Monday during a general strike by Palestinians demanding an end to the Gaza war.",
    "link": "https://www.ibtimes.com/palestinians-west-bank-strike-demand-end-gaza-war-3769123",
    "timestamp": "2025-04-07T19:42:17Z"
  },
  {
    "title": "Is Macron striving for a new leadership role for Europe?",
    "description": "Emmanuel Macron is Europe's \"point man,\" and in the absence of a formal German government, he is driving France's vision of Europe amid war to its east and incoming tariffs across the Atlantic. For years, Germany had been seen as the leading light of Europe —…",
    "link": "https://www.dw.com/en/is-macron-striving-for-a-new-leadership-role-for-europe/a-72167507",
    "timestamp": "2025-04-07T19:42:00Z"
  },
  {
    "title": "Could France's Macron be the new leader of Europe?",
    "description": "Emmanuel Macron is Europe's \"point man,\" and in the absence of a formal German government, he is driving France's vision of Europe amid war to its east and incoming tariffs across the Atlantic. For years, Germany had been seen as the leading light of Europe —…",
    "link": "https://www.dw.com/en/france-emmanuel-macron-eu-germany-trump-tariffs/a-72167507",
    "timestamp": "2025-04-07T19:42:00Z"
  },
  {
    "title": "Trump orders new review of U.S. Steel acquisition by Japan's Nippon Steel",
    "description": "President Donald Trump on Monday ordered the proposed acquisition of U.S. Steel by Japan's Nippon Steel to undergo a new review after the deal was blocked by President Joe Biden.\nTrump directed the Committee on Foreign Investment in the United States to revie…",
    "link": "https://biztoc.com/x/8a8246d9bdccf61b",
    "timestamp": "2025-04-07T19:41:49Z"
  },
  {
    "title": "Apple to Lessen Tariff Impact by Shipping More iPhones From India",
    "description": "To lessen the impact from the tariffs that U.S. President Donald Trump is putting in place this month, Apple will import more iPhones to the U.S. from India, reports The Wall Street Journal.\n\n\n\n\n\nThe 26 percent tariff on goods imported from India will be less…",
    "link": "https://www.macrumors.com/2025/04/07/apple-iphone-tariffs-india/",
    "timestamp": "2025-04-07T19:41:40Z"
  },
  {
    "title": "Trump: EU will have to buy energy from us",
    "description": "United States President Donald Trump stressed on Monday that the European Union has no choice but to \"buy energy from us\" despite being \"tough\" and \"very bad to us\" concerning trade with the North Ame...",
    "link": "https://biztoc.com/x/0d5f515b67b86827",
    "timestamp": "2025-04-07T19:41:31Z"
  },
  {
    "title": "Trump: US, Iran to have direct talks on nuclear deal",
    "description": "United States President Donald Trump stated on Monday that Washington will have direct discussions with Iran on the nuclear agreement.\"[The talks] will go on Saturday at almost the highest level. We h...",
    "link": "https://biztoc.com/x/75a9eaf2ba1b2cdd",
    "timestamp": "2025-04-07T19:41:16Z"
  },
  {
    "title": "Netanyahu Makes Vow to Trump Over Tariffs on Israel",
    "description": "During a meeting in the Oval Office, Netanyahu said Israel would move swiftly to close the trade gap and reduce trade barriers.",
    "link": "https://www.newsweek.com/netanyahu-makes-vow-trump-over-tariffs-israel-2056521",
    "timestamp": "2025-04-07T19:40:27Z"
  },
  {
    "title": "US Discusses Tariffs, Critical Minerals,Immigration With Pakistan",
    "description": "U.S. Secretary of State Marco Rubio spoke to Pakistani Foreign Minister Ishaq Dar on Monday about tariffs, trade relations, immigration and prospects for engagement on critical minerals, the State Department and Pakistan&#039;s foreign ministry said.",
    "link": "https://www.ndtv.com/world-news/us-discusses-tariffs-critical-minerals-immigration-with-pakistan-8111561",
    "timestamp": "2025-04-07T19:40:11Z"
  },
  {
    "title": "U.S. CISA adds Ivanti Connect Secure, Policy Secure and ZTA Gateways flaw to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Ivanti Connect Secure, Policy Secure and ZTA Gateways flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added an Apache Tomca…",
    "link": "https://securityaffairs.com/176332/security/u-s-cisa-adds-ivanti-connect-secure-policy-secure-and-zta-gateways-flaw-to-its-known-exploited-vulnerabilities-catalog-2.html",
    "timestamp": "2025-04-07T19:39:30Z"
  },
  {
    "title": "Tariff Uncertainty Hurts Economy, Investors. History May Provide Clues",
    "description": "When the U.S. passed tariffs in 1930, at least 10 of our trading partners raised tariffs on America. Global trade fell 66% from 1929 to 1934. Will history repeat itself?",
    "link": "https://www.forbes.com/sites/mikepatton/2025/04/07/tariff-uncertainty-hurts-economy-investors-history-may-provide-clues/",
    "timestamp": "2025-04-07T19:38:56Z"
  },
  {
    "title": "Bitcoin, showing 'signs of resilience', beats stocks, gold as equities fold — Binance",
    "description": "Bitcoin (BTC) is showing “signs of resilience” even as stocks and the broader cryptocurrency market plunge amid a global market sell-off after US President Donald Trump imposed sweeping tariffs on US imports last week, Binance Research said. As of mid-day tra…",
    "link": "https://cointelegraph.com/news/bitcoin-shows-signs-of-reslience-outperforms-stocks-gold-amid-global-market-selloff",
    "timestamp": "2025-04-07T19:38:54Z"
  },
  {
    "title": "Palestinians in West Bank strike to demand end to Gaza war",
    "description": "Shuttered storefronts lined empty streets in Israeli-annexed east Jerusalem and the occupied West Bank on Monday during a general strike by Palestinians demanding an end to the Gaza war. “I walked through the city today and couldn’t find a single place that w…",
    "link": "https://www.digitaljournal.com/world/palestinians-in-west-bank-strike-to-demand-end-to-gaza-war/article",
    "timestamp": "2025-04-07T19:37:33Z"
  },
  {
    "title": "Bitcoin Giant Strategy Records $6 Billion Loss On Holdings As Market Rout Pauses BTC Buys",
    "description": "Michael Saylor’s Strategy (previously known as MicroStrategy) disclosed a nearly $6 billion loss on its BTC stash.",
    "link": "https://zycrypto.com/bitcoin-giant-strategy-records-6-billion-loss-on-holdings-as-market-rout-pauses-btc-buys/",
    "timestamp": "2025-04-07T19:37:16Z"
  },
  {
    "title": "Trump defends tariffs on Nigeria, China, others",
    "description": "President Donald Trump has defended his administration’s sweeping tariff increases on multiple countries, including Nigeria and China, insisting the United States is finally reclaiming its economic power after years of being taken advantage of. The new tariff…",
    "link": "https://punchng.com/trump-defends-tariffs-on-nigeria-china-others/",
    "timestamp": "2025-04-07T19:37:01Z"
  },
  {
    "title": "Living Nostradamus' shocking prediction: Could China use 'Invisible war tool' for a massive cyber attack in response to trade war with US?",
    "description": "The US-China trade conflict has intensified after President Donald Trump announced significant tariff hikes on Chinese goods. In response, China imposed a 34% tariff on US imports, which led to Trump threatening further economic retaliation.",
    "link": "https://economictimes.indiatimes.com/news/international/us/living-nostradamus-shocking-prediction-could-china-use-invisible-war-tool-for-a-massive-cyber-attack-in-response-to-trade-war-with-us/articleshow/120074301.cms",
    "timestamp": "2025-04-07T19:36:22Z"
  },
  {
    "title": "US and Iran in direct talks over nuclear program, Trump says",
    "description": "WASHINGTON (Reuters) - President Donald Trump said on Monday that the U.S. and Iran are participating in direct talks over the Middle Eastern country's nuclear program. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/08/us-and-iran-in-direct-talks-over-nuclear-program-trump-says",
    "timestamp": "2025-04-07T19:36:00Z"
  },
  {
    "title": "Trump Pushes Tariffs by Claiming Prices Are Down and “NO INFLATION” Will Happen",
    "description": "An analysis of Trump's tariffs shows they will cost the typical US family around $3,800 in extra spending per year.",
    "link": "https://truthout.org/articles/trump-pushes-tariffs-by-claiming-prices-are-down-and-no-inflation-will-happen/",
    "timestamp": "2025-04-07T19:35:07Z"
  },
  {
    "title": "April 7, 2000, In Labor History: College Students Fight Back Against Sweatshops!",
    "description": "Yes, those are still a thing.",
    "link": "https://www.wonkette.com/p/april-7-2000-in-labor-history-college",
    "timestamp": "2025-04-07T19:34:10Z"
  },
  {
    "title": "EXCLUSIVE: Trump tax cuts ‘top priority’ for Congress, says top House GOP leader",
    "description": "Following President Trump’s tariff announcements, a top House GOP leader is pushing for Congress to extend the president’s 2017 tax cuts, which he says is the next “top priority\" for Republicans.",
    "link": "https://www.foxnews.com/politics/exclusive-trump-tax-cuts-top-priority-congress-says-top-house-gop-leader",
    "timestamp": "2025-04-07T19:33:04Z"
  },
  {
    "title": "Europe has a 'real opportunity' to take in Americans fleeing Trump. Is it ready for a 'brain drain'?",
    "description": "Financial experts are seeing a spike in affluent working Americans looking to resettle in Europe. They say it's time for Europe to prepare for their arrival. Russian-American *Julia had wanted to leave the United States for a couple of years, but the start of…",
    "link": "https://freerepublic.com/focus/f-news/4309500/posts",
    "timestamp": "2025-04-07T19:32:57Z"
  },
  {
    "title": "‘Chaos and chainsaws’: Mass. Democrats link GOP gubernatorial candidate Mike Kennealy to Donald Trump",
    "description": "The Massachusetts Democratic Party slammed Republican gubernatorial candidate Mike Kennealy Monday and immediately linked the former Baker administration official to President Donald Trump and other national conservatives.",
    "link": "https://www.bostonherald.com/2025/04/07/chaos-and-chainsaws-mass-democrats-link-gop-gubernatorial-candidate-mike-kennealy-to-donald-trump/",
    "timestamp": "2025-04-07T19:32:17Z"
  },
  {
    "title": "Amid Trump Tariffs, S Jaishankar, US Counterpart Push For \"Early Trade Deal\"",
    "description": "External Affairs Minister S Jaishankar and US Secretary of State Marco Rubio spoke over a phone call on Monday. Both leaders agreed that an &quot;early conclusion&quot; of the bilateral trade agreement will benefit both nations.",
    "link": "https://www.ndtv.com/world-news/amid-trump-tariffs-s-jaishankar-us-counterpart-push-for-early-trade-deal-8111548",
    "timestamp": "2025-04-07T19:31:45Z"
  },
  {
    "title": "How to Ruin a Country",
    "description": "A step-by-step guide to Donald Trump’s destruction of U.S. foreign policy.",
    "link": "http://foreignpolicy.com/2025/04/07/trump-ruin-us-foreign-policy-country/",
    "timestamp": "2025-04-07T19:31:17Z"
  },
  {
    "title": "GameStop CEO cries about Trump’s tariffs after blaming DEI for poor business",
    "description": "GameStop CEO Ryan Cohen is, as the kids say, “going through it.” Last week, the Montreal-born executive took to X (Twitter) to lament U.S. President Donald Trump’s sweeping worldwide tariffs. “These tariffs are turning me into a dem,” he posted with a pride f…",
    "link": "https://mobilesyrup.com/2025/04/07/gamestop-ceo-trump-tariffs-dei-poor-business/",
    "timestamp": "2025-04-07T19:31:06Z"
  }
]