[
  {
    "title": "US senator wants to fine and jail those who use DeepSeek and other Chinese AIs",
    "description": "The Chinese AI chatbot “DeepSeek” has caused a lot of controversy in recent weeks. Although DeepSeek was launched in 2023, it became popular after the introduction of the “R1” model, which performs just as well as its competitors while using fewer resources. …",
    "link": "https://9to5mac.com/2025/02/06/us-senator-wants-to-fine-and-jail-those-who-use-deepseek-and-other-chinese-ais/",
    "timestamp": "2025-02-07T01:16:21Z"
  },
  {
    "title": "Pelosi: Trump Not Sophisticated Enough to Understand What Is Happening",
    "description": "On Thursday on MSNBC’s “Andrea Mitchell Reports,” Rep. Nancy Pelosi (D-CA) said President Donald Trump is not sophisticated enough in terms of the intelligence community to understand what is happening when they comply with his executive orders. Pelosi said, …",
    "link": "https://freerepublic.com/focus/f-news/4295616/posts",
    "timestamp": "2025-02-07T01:16:20Z"
  },
  {
    "title": "President Trump: “Billions Have Been Stolen at USAID and Other Agencies – This Could be the Biggest Scandal of Them All – Democrats Can’t Hide”",
    "description": "US President Donald Trump confirmed on Thursday that “billions of dollars have been stolen at USAID and other agencies.” Trump added, “This could be the biggest scandal of them all, perhaps the biggest in history. Democrats can’t hide from this one. Too big, …",
    "link": "https://freerepublic.com/focus/f-news/4295615/posts",
    "timestamp": "2025-02-07T01:15:33Z"
  },
  {
    "title": "Share Market Highlights 7 February 2025: Sensex, Nifty settle lower after RBI cuts repo rate to 6.25%; FIIs continue selling spree",
    "description": "Sensex, Nifty updates on 7 February 2025: Equity markets closed lower on Wednesday despite the Reserve Bank of India’s first rate cut since May 2020, as investors remained concerned about global trade tensions and continued foreign institutional investor (FII…",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-updates-february-7-2025/article69188765.ece",
    "timestamp": "2025-02-07T01:15:20Z"
  },
  {
    "title": "Trump faces pressure from US industry over China tariff on medicines",
    "description": "U.S. hospitals and generic drugmakers are urging President Trump to exempt medical goods from new tariffs on Chinese imports, warning of potential medicine shortages and higher costs. Nearly 30% of critical drug ingredients are sourced from China, making tari…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-faces-pressure-from-us-industry-over-china-tariff-on-medicines/articleshow/117997351.cms",
    "timestamp": "2025-02-07T01:13:03Z"
  },
  {
    "title": "Trump reveals slew of picks for big jobs, including friend of Mike Pence, billionaire's wife",
    "description": "President Trump revealed picks for big jobs, including ambassadors to the Czech Republic, Poland, Costa Rica and Norway and his pick for director of the U.S. Marshals Service.",
    "link": "https://www.foxnews.com/politics/trump-reveals-slew-picks-big-jobs-including-friend-mike-pence-billionaires-wife",
    "timestamp": "2025-02-07T01:11:40Z"
  },
  {
    "title": "Trump calls USAID a 'tremendous fraud.' His wife and daughter promoted its work",
    "description": "President Donald Trump has denigrated the aid agency as a \"tremendous fraud.\"",
    "link": "https://abcnews.go.com/Politics/trump-calls-usaid-tremendous-fraud-wife-daughter-promoted/story?id=118547473",
    "timestamp": "2025-02-07T01:09:36Z"
  },
  {
    "title": "CNBC Daily Open: Global central banks are cutting rates — the Fed might not be as inclined",
    "description": "Many economies seem to be settling into a lower-rate environment. That’s in stark contrast with the Federal Reserve, which has to deal with volatile policies.",
    "link": "https://www.cnbc.com/2025/02/07/cnbc-daily-open-global-central-banks-are-cutting-rates-the-fed-might-not-be-as-inclined.html",
    "timestamp": "2025-02-07T01:08:42Z"
  },
  {
    "title": "Are government-paid media subscriptions a 'scandal'? That's what Donald Trump is now asserting",
    "description": "Federal government payments to news outlets like Politico, The New York Times and The Associated Press for subscriptions or to license content are in the crosshairs of Trump administration spending hawks, with the president on Thursday calling it potentially …",
    "link": "https://biztoc.com/x/6b32987458d9d6d4",
    "timestamp": "2025-02-07T01:08:14Z"
  },
  {
    "title": "Oil Set for Weekly Drop as Trump Tariffs Outweigh Iran Sanctions",
    "description": "Oil headed for a third weekly decline as worries that President Donald Trump’s tariffs on China will sap demand outweighed the new US administration’s first round of sanctions against Iran.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-set-for-weekly-drop-as-trump-tariffs-outweigh-iran-sanctions",
    "timestamp": "2025-02-07T01:07:55Z"
  },
  {
    "title": "Are government-paid media subscriptions a 'scandal'? That's what Donald Trump is now asserting",
    "description": "Federal government payments for subscriptions to media outlets have become the latest target of President Donald Trump's spending hawks. A day after his press secretary cited some $8 million in spending for Politico subscriptions, Trump dubbed it a “scandal” …",
    "link": "https://www.seattlepi.com/entertainment/article/are-government-paid-media-subscriptions-a-20152460.php",
    "timestamp": "2025-02-07T01:06:26Z"
  },
  {
    "title": "Senate GOP Steamrolls 30 Hours Of Dem Obstruction To Confirm Trump’s 13th Nominee",
    "description": "Senate Republicans voted to confirm former White House Office of Management and Budget director Russell Vought to helm the office Thursday evening.",
    "link": "https://dailycaller.com/2025/02/06/senate-gop-steamrolls-30-hours-of-dem-obstruction-to-confirm-trumps-13th-nominee/",
    "timestamp": "2025-02-07T01:05:37Z"
  },
  {
    "title": "NCAA Bans Transgender Athletes (Biological Men) From Women’s Sports One Day After Trump Signs EO – Trump Responds",
    "description": "nother HUGE win! The NCAA on Thursday banned transgender athletes (biological men) from participating in women’s sports just one day after Trump signed an Executive Order to protect girls’ sports. Fox News reported: The NCAA has officially changed its gender …",
    "link": "https://freerepublic.com/focus/f-news/4295613/posts",
    "timestamp": "2025-02-07T01:04:36Z"
  },
  {
    "title": "Asian stocks decline, Yen climbs ahead of US jobs data",
    "description": "Shares in Japan, Australia and South Korea opened lower, while equity futures for Hong Kong also fell. Declines in Tokyo partly reflected a stronger yen, which extended gains against the dollar into a fifth day Friday to trade around the highest level since e…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-decline-yen-climbs-ahead-of-us-jobs-data/articleshow/117997293.cms",
    "timestamp": "2025-02-07T01:04:13Z"
  },
  {
    "title": "E.l.f. Beauty CEO explains softer sales trends in January",
    "description": "E.l.f. Beauty CEO Tarang Amin told CNBC's Jim Cramer why the company saw lighter business in January.",
    "link": "https://www.cnbc.com/2025/02/06/elf-beauty-ceo-explains-softer-sales-trends-in-january.html",
    "timestamp": "2025-02-07T01:04:09Z"
  },
  {
    "title": "Apple’s China focus thrusts it into center of geopolitical fight",
    "description": "It counts China as its biggest manufacturing hub and the U.S. as its largest market, putting it at the center of an escalating geopolitical fight.",
    "link": "https://www.japantimes.co.jp/business/2025/02/07/companies/apple-china-geopolitics/",
    "timestamp": "2025-02-07T01:04:00Z"
  },
  {
    "title": "LeBlanc Says Canada Should Spend Less, Review Government Size",
    "description": "Canada’s finance minister says he needs to take a hard look at the size of government as the country prepares for major new defense spending and a potential economic disruption from its largest trading partner.",
    "link": "https://financialpost.com/pmn/business-pmn/leblanc-says-canada-should-spend-less-review-government-size",
    "timestamp": "2025-02-07T01:02:51Z"
  },
  {
    "title": "Trump Slaps Sanctions Back on International Criminal Court",
    "description": "President Donald Trump signed an executive order Thursday restoring sanctions against the International Criminal Court (ICC), punishing that international body and its senior officials if they try to pursue Americans or U.S. allies.\nThe post Trump Slaps Sanct…",
    "link": "https://www.breitbart.com/politics/2025/02/06/trump-slaps-sanctions-back-on-international-criminal-court/",
    "timestamp": "2025-02-07T01:02:16Z"
  },
  {
    "title": "Tesla sales slump off the back of Musk's alienating political views",
    "description": "Tesla sales have declined globally, including a 30 per cent drop in Australia this January. Experts say it's partly due to Elon Musk's political views and high-profile actions deterring buyers.",
    "link": "https://www.abc.net.au/news/2025-02-07/tesla-sales-slump-off-back-of-elon-musks-allegiances-with-trump/104905068",
    "timestamp": "2025-02-07T01:01:34Z"
  },
  {
    "title": "Out of power: Democrats disoriented in fight against Trump agenda",
    "description": "A new Congress and a new presidential administration places both parties back at square one – and Republicans have an abundantly clear upper hand.",
    "link": "https://www.foxnews.com/politics/out-power-democrats-disoriented-fight-against-trump-agenda",
    "timestamp": "2025-02-07T01:01:30Z"
  },
  {
    "title": "The Bob Cesca Podcast: A Little Bit of Pixie Dust",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: A Little Bit of Pixie Dust -- Donald Trump's Gaza nightmare. You Were Warned: Arab Americans for Trump, Mitch McConnell, egg prices at Waffle House. The Donald Trump Kleptocracy is here. How D…",
    "link": "https://littlegreenfootballs.com/article/54374_The_Bob_Cesca_Podcast-_A_Littl",
    "timestamp": "2025-02-07T01:00:49Z"
  },
  {
    "title": "Boston University staff member made social media post saying DOGE employees are wanted 'dead or alive'",
    "description": "An employee of Boston University posted a graphic of DOGE team members, which is headed by Elon Musk, that read \"Wanted for treason, dead or alive.\"",
    "link": "https://www.foxnews.com/media/boston-university-staff-member-made-social-media-post-saying-doge-employees-wanted-dead-alive",
    "timestamp": "2025-02-07T01:00:41Z"
  },
  {
    "title": "Breitbart Business Digest: The Establishment's Last Stand Against Trump’s Tariffs",
    "description": "The Peterson Institute’s analysis is not a serious indictment of tariffs—it’s an unintentional case for their effectiveness.\nThe post Breitbart Business Digest: The Establishment’s Last Stand Against Trump’s Tariffs appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/02/06/breitbart-business-digest-the-establishments-last-stand-against-trumps-tariffs/",
    "timestamp": "2025-02-07T01:00:38Z"
  },
  {
    "title": "Elon Musk’s Revolutionary Terror",
    "description": "The evisceration of U.S.A.I.D. isn’t a policy fight—it’s an execution designed to strike fear in our own government.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/elon-musks-revolutionary-terror",
    "timestamp": "2025-02-07T01:00:00Z"
  },
  {
    "title": "A New Oil Cycle Begins And Sanctions, Shale, and OPEC Set the Stage",
    "description": "When President Donald Trump came into office, oil prices jumped. The immediate reason was simple enough: Trump likes a hardline approach to countries he sees as enemies, and that means Iran and sanctions on its oil exports. But there’s another factor at play,…",
    "link": "https://oilprice.com/Energy/Oil-Prices/A-New-Oil-Cycle-Begins-And-Sanctions-Shale-and-OPEC-Set-the-Stage.html",
    "timestamp": "2025-02-07T01:00:00Z"
  },
  {
    "title": "Trump sanctions International Criminal Court officials, families … even properties",
    "description": "Organization 'has engaged in illegitimate and baseless actions targeting America and our close ally Israel'",
    "link": "https://www.wnd.com/2025/02/trump-sanctions-international-criminal-court-officials-families-even-properties/",
    "timestamp": "2025-02-07T00:59:29Z"
  },
  {
    "title": "Are government-paid media subscriptions a 'scandal'? That's what Donald Trump is now asserting",
    "description": "Federal government payments for subscriptions to media outlets have become the latest target of President Donald Trump's spending hawks.",
    "link": "https://www.clickondetroit.com/news/politics/2025/02/07/are-government-paid-media-subscriptions-a-scandal-thats-what-donald-trump-is-now-asserting/",
    "timestamp": "2025-02-07T00:57:06Z"
  },
  {
    "title": "Are government-paid media subscriptions a 'scandal'? That's what Donald Trump is now asserting",
    "description": "Federal government payments to news outlets like Politico, The New York Times and The Associated Press for subscriptions or to license content are in the crosshairs of Trump administration spending hawks, with the president on Thursday calling it potentially …",
    "link": "https://biztoc.com/x/2fc43cdf2ff1b9e8",
    "timestamp": "2025-02-07T00:57:01Z"
  },
  {
    "title": "Apple Kills AR Glasses, Hello Alexa AI, Reality Labs’ Reality, More Cinematic AI",
    "description": "Apple halts AR glasses, prioritizing Vision Pro. Amazon upgrades Alexa with AI. Meta’s MR struggles despite smart glasses success. Google offers buyouts amid AI shift.",
    "link": "https://www.forbes.com/sites/charliefink/2025/02/06/apple-kills-ar-glasses-hello-alexa-ai-reality-labs-reality-more-cinematic-ai/",
    "timestamp": "2025-02-07T00:56:47Z"
  },
  {
    "title": "People Are Impersonating ICE Agents To Harass Immigrants And Commit Crimes, Police Say",
    "description": "Advocates told HuffPost the incidents show the dangerous environment immigrants are facing under President Donald Trump.",
    "link": "https://www.huffpost.com/entry/ice-impersonators-harassing-immigrants_n_67a54752e4b0d1a51c6312a6",
    "timestamp": "2025-02-07T00:56:31Z"
  },
  {
    "title": "Russ Vought Survives Democrats’ Protests, Confirmed to Lead Budget Office",
    "description": "Russell Vought, President Donald Trump’s nominee to lead the Office of Management and Budget, was confirmed by the Senate Thursday night on party lines by... Read More\nThe post Russ Vought Survives Democrats’ Protests, Confirmed to Lead Budget Office appeared…",
    "link": "https://www.dailysignal.com/2025/02/06/russell-vought/",
    "timestamp": "2025-02-07T00:56:17Z"
  },
  {
    "title": "Citi's 2025 gold price forecast could mean new record highs for ASX 200 gold stocks",
    "description": "The gold price has soared 40% in a year. How high will it go in 2025?\nThe post Citi's 2025 gold price forecast could mean new record highs for ASX 200 gold stocks appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/02/07/citis-2025-gold-price-forecast-could-mean-new-record-highs-for-asx-200-gold-stocks/",
    "timestamp": "2025-02-07T00:55:07Z"
  },
  {
    "title": "U.S. cannot withdraw from a body it no longer belongs: UNHRC",
    "description": "Delegates attend a meeting of the 56th session of the UN Human Rights Council in Geneva, Switzerlan",
    "link": "http://en.people.cn/n3/2025/0207/c90000-20273399.html",
    "timestamp": "2025-02-07T00:55:00Z"
  },
  {
    "title": "MSHSL will follow MN law on transgender athletes in sports, not Pres. Trump's order",
    "description": "The Minnesota State High School League (MSHSL) that transgender student-athletes' eligibility to participate in sports is determined by state law, not President Donald Trump's recent Executive Order banning transgender athletes from women's or girl's sports.",
    "link": "https://www.fox9.com/news/mshsl-mn-state-law-transgender-athletes-trump",
    "timestamp": "2025-02-07T00:54:44Z"
  },
  {
    "title": "Trump congratulates Mahomes family on newborn daughter ahead of Super Bowl LIX: ‘A baby with great genes’",
    "description": "President Donald Trump gave his congratulations to Patrick Mahomes and wife Brittany on the birth of their third child, daughter Golden Raye.",
    "link": "https://nypost.com/2025/02/06/us-news/trump-congratulates-mahomes-family-on-newborn-daughter-ahead-of-super-bowl-lix-a-baby-with-great-genes/",
    "timestamp": "2025-02-07T00:53:35Z"
  },
  {
    "title": "Italian politicians allege Donald Trump Jr.'s hunting party killed a protected duck - NPR",
    "description": "Italian politicians allege Donald Trump Jr.'s hunting party killed a protected duckNPR Donald Trump Jr accused of killing protected bird in Venice lagoonThe Guardian ‘A rather uncommon duck’: Donald Trump Jr. accused of shooting rare Italian duckCNN A Trump. …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176146435",
    "timestamp": "2025-02-07T00:53:03Z"
  },
  {
    "title": "Legal scholar shares 'doomsday scenario' with Trump that has lawyers 'worried'",
    "description": "A legal scholar minced no words Thursday evening on CNN, flagging what he called a \"doomsday scenario\" that may come to pass if part of President Donald Trump's agenda is dealt a fatal blow by the courts.\n\nAnchor Erin Burnett asked panelists including former …",
    "link": "https://www.rawstory.com/trump-court-2671111831/",
    "timestamp": "2025-02-07T00:51:08Z"
  },
  {
    "title": "US judge blocks Trump buyout program as 60,000 sign up to quit",
    "description": "A U.S. judge halted the Trump administration's federal employee buyout plan temporarily, siding with labor unions challenging the proposal. Over 60,000 federal employees have accepted the buyout offer despite uncertainties around continued pay and potential j…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-judge-blocks-trump-buyout-program-as-60000-sign-up-to-quit/articleshow/117997185.cms",
    "timestamp": "2025-02-07T00:50:09Z"
  },
  {
    "title": "Project 2025 Author Russell Vought Confirmed By Senate: Here Are All The Trump Officials With Ties To Policy Agenda",
    "description": "Trump has named several people tied to Project 2025 to his administration, even after he disavowed the extreme policy agenda.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/06/project-2025-author-russell-vought-confirmed-by-senate-here-are-all-the-trump-officials-with-ties-to-policy-agenda/",
    "timestamp": "2025-02-07T00:50:02Z"
  },
  {
    "title": "Senate confirms Project 2025 architect Russell Vought to lead White House budget office",
    "description": "Vought was confirmed on a party-line vote of 53-47 after Democrats warned he was Trump's \"most dangerous nominee.\"",
    "link": "https://richmond.com/news/nation-world/government-politics/project-2025-congress-politics-trump/article_490f75fc-c69d-52a3-8962-0b2312eabd6d.html",
    "timestamp": "2025-02-07T00:50:00Z"
  },
  {
    "title": "Senate confirms Project 2025 architect Russell Vought to lead White House budget office",
    "description": "Vought was confirmed on a party-line vote of 53-47 after Democrats warned he was Trump's \"most dangerous nominee.\"",
    "link": "https://roanoke.com/news/nation-world/government-politics/project-2025-congress-politics-trump/article_b1944aa5-223b-5193-9440-e1e176fc3c7b.html",
    "timestamp": "2025-02-07T00:50:00Z"
  },
  {
    "title": "Labor groups sue to halt Trump admin’s dismantling of USAID as workforce is expected to be slashed to under 300",
    "description": "A pair of labor groups representing employees at the US Agency for International Development (USAID) sued President Donald Trump on Thursday over his efforts to dismantle the decades-old agency as multiple sources told CNN that fewer than 300 employees are ex…",
    "link": "https://www.cnn.com/2025/02/06/politics/labor-groups-sue-trump-usaid/index.html",
    "timestamp": "2025-02-07T00:48:57Z"
  },
  {
    "title": "Is Dutton blowing his chance as he flip-flops on key policies?",
    "description": "Peter Dutton poses as a strong man, but is strangely flexible when it comes to his own key policies. Are voters starting to notice?\nThe post Is Dutton blowing his chance as he flip-flops on key policies? appeared first on Crikey.",
    "link": "https://www.crikey.com.au/2025/02/07/peter-dutton-flip-flop-policies/",
    "timestamp": "2025-02-07T00:47:25Z"
  },
  {
    "title": "Ahead of PM Modi- Donald Trump meet, India, US eye 'ambitious' defence ties",
    "description": "India News: NEW DELHI: Ahead of PM Narendra Modi's summit with President Donald Trump next week, India and the US on Thursday agreed to chart out an \"ambitious\" d.",
    "link": "https://timesofindia.indiatimes.com/india/ahead-of-pm-modi-trump-meet-india-us-eye-ambitious-defence-ties/articleshow/117996892.cms",
    "timestamp": "2025-02-07T00:47:04Z"
  },
  {
    "title": "JK Rowling Mocks the Left After Trump Signs ‘No Men in Women’s Sports’ Executive Order",
    "description": "“Harry Potter” creator J.K. Rowling posted a backhanded “thank you” message to the left, on X, after President Donald Trump signed the “No Men in Women’s Sports” executive order on Wednesday. Trump signed the executive order on National Girls and Women in Spo…",
    "link": "https://freerepublic.com/focus/f-news/4295607/posts",
    "timestamp": "2025-02-07T00:46:51Z"
  },
  {
    "title": "‘The DNA Of Our Foreign Policy’: How USAID Hid Behind Humanitarianism To Export Radical Left-Wing Priorities Abroad",
    "description": "USAID has funneled billions of taxpayer dollars into combatting hunger, disease and illiteracy around the world — and also pro-abortion, LGBT and DEI programs.",
    "link": "https://dailycaller.com/2025/02/06/elon-musk-doge-usaid-state-department-dei-lgbt-left-wing-agenda/",
    "timestamp": "2025-02-07T00:46:38Z"
  },
  {
    "title": "Trump Administration To Fire Nearly All Of USAID Staff Amid Row: Report",
    "description": "President Donald Trump&#039;s administration plans to keep fewer than 300 staff at the U.S. Agency for International Development out of the agency&#039;s worldwide total of more than 10,000, four sources told Reuters on Thursday.",
    "link": "https://www.ndtv.com/world-news/trump-administration-to-fire-nearly-all-of-usaid-staff-amid-row-report-7652890",
    "timestamp": "2025-02-07T00:46:29Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures waver after monthly jobs report",
    "description": "Investors took in Amazon earnings, with the all-important jobs report on deck.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-edge-higher-after-monthly-jobs-report-004556873.html",
    "timestamp": "2025-02-07T00:45:56Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures stall as Amazon disappoints, jobs report looms",
    "description": "Investors took in Amazon earnings, with the all-important jobs report on deck.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-stall-as-amazon-disappoints-jobs-report-looms-004556865.html",
    "timestamp": "2025-02-07T00:45:56Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures tip lower after cool jobs report",
    "description": "Investors took in Amazon earnings, with the all-important jobs report on deck.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-tip-lower-after-monthly-jobs-report-004556479.html",
    "timestamp": "2025-02-07T00:45:56Z"
  },
  {
    "title": "USDA inspector general didn't order 'mass extermination' of birds to drive up cost of poultry, eggs",
    "description": "USDA Inspector General Phyllis Fong ordered the mass extermination of healthy poultry in 2024, citing \"mutating bird flu,\" in order to artificially inflate poultry and egg prices in the U.S.",
    "link": "https://www.snopes.com//fact-check/usda-inspector-poultry-extermination/",
    "timestamp": "2025-02-07T00:44:00Z"
  },
  {
    "title": "Trump meets U.S. Steel CEO as Nippon Steel hopes to save deal",
    "description": "The meeting took place one day before Trump is due to meet with Prime Minister Shigeru Ishiba.",
    "link": "https://www.japantimes.co.jp/business/2025/02/07/companies/trump-meets-us-steel-ceo/",
    "timestamp": "2025-02-07T00:43:00Z"
  },
  {
    "title": "Pam Bondi Ends Task Force On Russian Oligarchs To Focus On Cartels",
    "description": "The U.S. attorney general has disbanded an anti-Russian oligarch sanctions task force to shift resources to anti-cartel activities.",
    "link": "https://www.newsweek.com/pam-bondi-ends-task-force-russian-oligarchs-focus-cartels-2027638",
    "timestamp": "2025-02-07T00:42:23Z"
  },
  {
    "title": "J6 Convict Pardoned By Trump Arrested for ‘Solicitation of a Minor’",
    "description": "A Jan. 6 convict pardoned by President Donald Trump for his role in the 2021 Capitol riots was arrested on Thursday for solicitation of a minor.\nThe post J6 Convict Pardoned By Trump Arrested for ‘Solicitation of a Minor’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/lawcrime/j6-convict-pardoned-by-trump-arrested-for-solicitation-of-a-minor/",
    "timestamp": "2025-02-07T00:40:55Z"
  },
  {
    "title": "Ukraine keeps its Kursk bargaining chip for any Russia talks",
    "description": "Russian forces have, so far, reclaimed only about half of the area that Ukraine took last year.",
    "link": "https://www.japantimes.co.jp/news/2025/02/07/world/politics/ukraine-russia-bargaining-chip/",
    "timestamp": "2025-02-07T00:40:00Z"
  },
  {
    "title": "Senate confirms Russell Vought as Trump’s next OMB director",
    "description": "The Senate on Thursday voted to confirm Russell Vought as the director of the White House Office of Management and Budget.",
    "link": "https://www.msnbc.com/top-stories/latest/senate-confirms-russell-vought-omb-director-rcna191060",
    "timestamp": "2025-02-07T00:39:50Z"
  },
  {
    "title": "Senate Confirms Project 2025 Architect As Trump's Budget Director",
    "description": "Vought was confirmed on a party-line vote of 53-47, putting him into one of the most influential positions in the federal government.",
    "link": "https://www.huffpost.com/entry/russell-vought-confirmed-omb-project-2025_n_67a555a5e4b02fdb057673b2",
    "timestamp": "2025-02-07T00:39:34Z"
  },
  {
    "title": "What transgender troops are saying about a looming ban under Trump",
    "description": "Trump's order targeted \"radical gender ideology\" in the US military. Advocates and troops are bracing for a harsh ban without regard to readiness.",
    "link": "https://www.businessinsider.com/transgender-troops-fear-ban-following-trumps-executive-order-2025-2",
    "timestamp": "2025-02-07T00:39:02Z"
  },
  {
    "title": "Who Is Russell Vought? Senate Confirms Trump’s Controversial OMB Director Pick—As Dems Protest",
    "description": "Democrats protested Vought’s nomination overnight Wednesday on the Senate floor, with several referring to him as Trump’s “most dangerous nominee.”",
    "link": "https://www.forbes.com/sites/saradorn/2025/02/06/who-is-russell-vought-senate-confirms-trumps-controversial-omb-director-pick-as-dems-protest/",
    "timestamp": "2025-02-07T00:38:28Z"
  },
  {
    "title": "Russell Vought confirmed to head government's leading budget office after Dems hold 30-hour protest",
    "description": "Russell Vought previously served as the director of the Office of Management and Budget during President Donald Trump's first administration.",
    "link": "https://www.foxnews.com/politics/russell-vought-confirmed-to-head-governments-leading-budget-office-after-dems-hold-30-hour-protest",
    "timestamp": "2025-02-07T00:35:17Z"
  },
  {
    "title": "Trump’s “Puppet Master,” Russ Vought, Confirmed to Lead OMB",
    "description": "On Thursday evening, the US Senate voted to confirm Russell Vought to lead the Office of Management and Budget (OMB), a key arm of the executive branch in charge of the federal budget and agency regulations. Vought will officially return to his old job, which…",
    "link": "https://www.motherjones.com/politics/2025/02/russell-vought-confirmed-senate-omb-project-2025-christian-nationalism/",
    "timestamp": "2025-02-07T00:35:15Z"
  },
  {
    "title": "US updates: Trump orders ICC sanctions over Israel probe",
    "description": "Donald Trump has signed an executive order imposing sanctions on the International Criminal Court over its investigations of Israel. Last year, the ICC issued an arrest warrant for Benjamin Netanyahu. DW has more. President Donald Trump has signed an executiv…",
    "link": "https://www.dw.com/en/us-updates-trump-orders-icc-sanctions-over-israel-probe/live-71534014",
    "timestamp": "2025-02-07T00:35:00Z"
  },
  {
    "title": "US updates: Trump orders ICC sanctions over Israel probe",
    "description": "Donald Trump has signed an executive order imposing sanctions on the International Criminal Court over its investigations of Israel. Last year, the ICC issued an arrest warrant for Benjamin Netanyahu. DW has more.",
    "link": "https://www.dw.com/en/us-updates-trump-orders-icc-sanctions-over-israel-probe/live-71534014",
    "timestamp": "2025-02-07T00:35:00Z"
  },
  {
    "title": "Trump’s Riviera would tear the Middle East apart",
    "description": "tOnly Donald Trump can unselfconsciously talk about one of the world’s most obstinate political and humanitarian crises in terms of its real estate opportunities. Only Trump could be taken seriously while doing so. And so here we are.\n“We’re going to develop …",
    "link": "https://biztoc.com/x/d4e85ef83bfc1fd6",
    "timestamp": "2025-02-07T00:34:47Z"
  },
  {
    "title": "Nippon Steel says U.S. Steel deal more crucial amid uncertain tariffs",
    "description": "TOKYO -- Nippon Steel sees the acquisition of U.S. Steel -- a deal that was blocked last month by former President Joe Biden -- as a key option for countering the impact of tariffs planned by new President Donald Trump, an executive of the Japanese company sa…",
    "link": "https://biztoc.com/x/1108aba395c42cd5",
    "timestamp": "2025-02-07T00:34:43Z"
  },
  {
    "title": "OVERRIDE - INSIDE THE REVOLUTION REWIRING AMERICAN POWER",
    "description": "The clock struck 2 AM on Jan 21, 2025. In Treasury's basement, fluorescent lights hummed above four young coders. Their screens cast blue light across government-issue desks, illuminating energy drink cans and agency badges. As their algorithms crawled throug…",
    "link": "https://freerepublic.com/focus/f-chat/4295605/posts",
    "timestamp": "2025-02-07T00:34:37Z"
  },
  {
    "title": "Trump call for Gazan exit echoes in destroyed homes",
    "description": "The war has stopped after 16 months, but the destruction left in its wake leaves Palestinians in a daily battle of trying to decide whether to stay or go.",
    "link": "https://www.japantimes.co.jp/news/2025/02/07/world/society/gaza-exit-reality-echos/",
    "timestamp": "2025-02-07T00:32:00Z"
  },
  {
    "title": "Democrats Must Fight Back Against the Scourge of Elon Musk’s DOGE",
    "description": "The billionaire’s minions have taken control of the government’s most sensitive computer systems. Senate Democrats must halt the chamber’s business until they stop. \nThe post Democrats Must Fight Back Against the Scourge of Elon Musk’s DOGE appeared first on …",
    "link": "http://washingtonmonthly.com/2025/02/06/democrats-must-fight-back-against-the-scourge-of-elon-musks-doge/",
    "timestamp": "2025-02-07T00:31:51Z"
  },
  {
    "title": "Trump to keep only 294 USAID staff out of over 10,000 globally",
    "description": "Washington's primary humanitarian aid agency has been a target of a government reorganization program spearheaded by businessman Elon Musk",
    "link": "https://www.japantimes.co.jp/news/2025/02/07/world/trump-usaid-staff/",
    "timestamp": "2025-02-07T00:31:00Z"
  },
  {
    "title": "Pittsburgh organization working with refugees impacted by President Trump’s executive orders",
    "description": "Refugees are immigrants invited to this country by the United States government, but recent executive orders have banned them from entering the country and completely gutted funding for those already here.",
    "link": "https://www.wpxi.com/news/local/pittsburgh-organization-working-with-refugees-impacted-by-president-trumps-executive-orders/77JSI6AP6RBJZIE3EH7ZF6V2UE/",
    "timestamp": "2025-02-07T00:30:34Z"
  },
  {
    "title": "Sources: DOGE targeted Treasury money to USAID",
    "description": "Officials working with Elon Musk sought access to the U.S. Department of Treasury payment system to stop money from flowing to USAID, according to two sources.",
    "link": "https://richmond.com/news/nation-world/government-politics/sources-doge-targeted-treasury-money-to-usaid/article_ff1fe25d-132e-5d22-94aa-380f32173b58.html",
    "timestamp": "2025-02-07T00:30:00Z"
  },
  {
    "title": "Trump meets with congressional Republicans as GOP allies argue over tax and spending cuts",
    "description": "President Donald Trump met privately with congressional Republicans at the White House on Thursday as his allies argued over the size, scope and details of a bill to cut taxes, regulations and spending.",
    "link": "https://richmond.com/news/nation-world/government-politics/trump-republicans-federal-budget-spending-cuts/article_a8fdc076-6f19-5f73-8d30-0ee0157f5e77.html",
    "timestamp": "2025-02-07T00:30:00Z"
  },
  {
    "title": "Trump meets with congressional Republicans as GOP allies argue over tax and spending cuts",
    "description": "President Donald Trump met privately with congressional Republicans at the White House on Thursday as his allies argued over the size, scope and details of a bill to cut taxes, regulations and spending.",
    "link": "https://roanoke.com/news/nation-world/government-politics/trump-republicans-federal-budget-spending-cuts/article_fe80f29a-a894-52a8-aa17-e8d65e89eca5.html",
    "timestamp": "2025-02-07T00:30:00Z"
  },
  {
    "title": "Sources: DOGE targeted Treasury money to USAID",
    "description": "Officials working with Elon Musk sought access to the U.S. Department of Treasury payment system to stop money from flowing to USAID, according to two sources.",
    "link": "https://roanoke.com/news/nation-world/government-politics/sources-doge-targeted-treasury-money-to-usaid/article_962c0943-c9cf-5bbb-89c5-50b00c8dda13.html",
    "timestamp": "2025-02-07T00:30:00Z"
  },
  {
    "title": "Wired Establishes Itself as the Digital Thorn in Elon Musk’s Side",
    "description": "The tech site kick-started a week of media and political arguments by breaking the news of Musk's young team of DOGE engineers \nThe post Wired Establishes Itself as the Digital Thorn in Elon Musk’s Side appeared first on TheWrap.",
    "link": "https://www.thewrap.com/wired-elon-musk-engineers-breaking-news/",
    "timestamp": "2025-02-07T00:27:48Z"
  },
  {
    "title": "US Federal Election Commission commissioner and chair says Trump removed her from office",
    "description": "WASHINGTON, Feb 6 (Reuters) - U.S. Federal Election Commission Commissioner and Chair Ellen Weintraub said she received a letter from President Donald Trump on Thursday removing her from office. \"There's a legal way to replace FEC commissioners-this isn't it,…",
    "link": "https://freerepublic.com/focus/f-news/4295602/posts",
    "timestamp": "2025-02-07T00:27:18Z"
  },
  {
    "title": "Democratic Lawmakers Demand Release of Frozen EPA Funds",
    "description": "Senator Ed Markey and other Democrats called for the agency to release grants halted by the Trump administration, following court orders to end the freeze.",
    "link": "https://financialpost.com/pmn/business-pmn/democratic-lawmakers-demand-release-of-frozen-epa-funds",
    "timestamp": "2025-02-07T00:27:15Z"
  },
  {
    "title": "Why Trump is on the warpath in Somalia",
    "description": "Militants in the mountains of north-eastern Somalia have become the beating heart of Islamic State in Africa.",
    "link": "https://www.bbc.com/news/articles/cyv4270gljpo",
    "timestamp": "2025-02-07T00:26:38Z"
  },
  {
    "title": "Trump’s Gaza gambit and the art of the ultimate deal",
    "description": "'There are real reasons for skepticism – but there are also real reasons for hope'",
    "link": "https://www.wnd.com/2025/02/trumps-gaza-gambit-and-the-art-of-the-ultimate-deal/",
    "timestamp": "2025-02-07T00:26:04Z"
  },
  {
    "title": "Trump's Ukraine, Russia envoy meets Ukrainian ambassador",
    "description": "(Reuters) - U.S. President Donald Trump's special envoy for Ukraine and Russia, Keith Kellogg, had a \"thorough discussion\" with Ukraine's ambassador to Washington in their first official meeting on Thursday, the ambassador said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/07/trump039s-ukraine-russia-envoy-meets-ukrainian-ambassador",
    "timestamp": "2025-02-07T00:25:00Z"
  },
  {
    "title": "Ondo Finance Reveals Chain Launch Plans as Trump-Linked Project Buys a Bundle of Tokens",
    "description": "Ondo Finance revealed plans to launch a chain for tokenizing real-world assets, with Donald Trump Jr. appearing at its Thursday event.",
    "link": "https://decrypt.co/304826/ondo-finance-chain-launch-trump-tokens",
    "timestamp": "2025-02-07T00:24:31Z"
  },
  {
    "title": "Manitoba's $140K 'Buy Local' ad campaign includes spending on social media like Facebook, Instagram",
    "description": "The Manitoba government's new advertising campaign encouraging people to spend their dollars in Manitoba and support local businesses is being questioned because some of the government money is being spent on international social media sites.",
    "link": "https://www.cbc.ca/news/canada/manitoba/manitoba-buy-local-campaign-under-fire-1.7452896",
    "timestamp": "2025-02-07T00:22:40Z"
  },
  {
    "title": "Is another holocaust of Jews possible?",
    "description": "'Never Again' is an abstraction that rarely reaches 'top of mind' or motivates us to action",
    "link": "https://www.wnd.com/2025/02/is-another-holocaust-of-jews-possible/",
    "timestamp": "2025-02-07T00:20:59Z"
  },
  {
    "title": "NCAA Bans Transgender Athletes (Biological Men) From Women’s Sports One Day After Trump Signs EO – Trump Responds",
    "description": "The NCAA's recent ban on transgender athletes from women's sports follows President Trump's executive order aimed at protecting female athletes. This pivotal moment raises significant questions about the future of gender and sports in America.\nThe post NCAA B…",
    "link": "https://www.thegatewaypundit.com/2025/02/ncaa-bans-transgender-athletes-biological-men-womens-sports/",
    "timestamp": "2025-02-07T00:20:56Z"
  },
  {
    "title": "Trump's Ukraine, Russia envoy meets Ukrainian ambassador",
    "description": "Ambassador Oksana Markarova, writing on Facebook, said this was her first meeting with Kellogg since his appointment, though the two had met before.  \"We...",
    "link": "https://www.yahoo.com/news/trumps-ukraine-russia-envoy-meets-001938618.html",
    "timestamp": "2025-02-07T00:19:38Z"
  },
  {
    "title": "What Elon Musk and DOGE Are Doing to the Federal Government",
    "description": "Elon Musk and his DOGE cronies continue to move fast and break  things in Washington, D.C. Here are their boldest attacks on the federal government thus far.",
    "link": "http://nymag.com/intelligencer/article/elon-musk-doge-doing-what-federal-government.html",
    "timestamp": "2025-02-07T00:18:39Z"
  },
  {
    "title": "Ivanka Trump Suits Up With Sharp Celine Sunglasses, Jared Kushner Favors Omega Speedmaster Snoopy Watch in Miami Beach",
    "description": "Ivanka Trump wore a double breasted green fitted suit while in Miami while with her husband Jared Kushner who was wearing an Omega watch.",
    "link": "http://wwd.com/pop-culture/celebrity-news/ivanka-trump-green-suit-celine-sunglasses-jared-kushner-1236910028/",
    "timestamp": "2025-02-07T00:18:38Z"
  },
  {
    "title": "If you really support immigration, stop excusing chaos",
    "description": "'Decrying mass criminality and anarchy is the way to go'",
    "link": "https://www.wnd.com/2025/02/if-you-really-support-immigration-stop-excusing-chaos/",
    "timestamp": "2025-02-07T00:18:32Z"
  },
  {
    "title": "Trump Administration Plans To Slash All But A Fraction Of USAID Jobs",
    "description": "The plan would leave fewer than 300 workers out of thousands.",
    "link": "https://www.huffpost.com/entry/trump-usaid-job-cuts_n_67a5509fe4b0d1a51c631388",
    "timestamp": "2025-02-07T00:18:03Z"
  },
  {
    "title": "How USAID and NGOs destroy economies of poor nations",
    "description": "'Poverty' has become big business, with hundreds of billions of dollars involved",
    "link": "https://www.wnd.com/2025/02/how-usaid-and-ngos-destroy-economies-of-poor-nations/",
    "timestamp": "2025-02-07T00:16:28Z"
  },
  {
    "title": "Commissioner for Patents Takes ‘Fork in the Road’ and Resigns from USPTO",
    "description": "IPWatchdog has learned that Commissioner for Patents Vaishali Udupa has notified the United States Patent and Trademark Office that she is resigning effective immediately. Udupa has submitted her resignation in order to take advantage of the deferred resignat…",
    "link": "https://ipwatchdog.com/2025/02/06/commissioner-for-patents-takes-fork-in-the-road-and-resigns-from-uspto/id=185752/",
    "timestamp": "2025-02-07T00:15:08Z"
  },
  {
    "title": "Democrat congressman already submitting articles of impeachment against Trump. Again.",
    "description": "A Democratic congressman has submitted new articles of impeachment against President Donald Trump only 16 days into his second term.\n\nRep. Al Green of Texas claimed that Trump advocated for the ethnic cleansing of Palestinians from the Gaza Strip when he offe…",
    "link": "https://www.theblaze.com/news/al-green-impeach-trump-gaza",
    "timestamp": "2025-02-07T00:13:48Z"
  },
  {
    "title": "Orgs demand action to mitigate AI's environmental harm | TechCrunch",
    "description": "A group of more than 100 organizations has published an open letter calling on the AI industry and regulators to mitigate the tech's harmful environmental",
    "link": "https://techcrunch.com/2025/02/06/orgs-demand-action-to-mitigate-ais-environmental-harm/",
    "timestamp": "2025-02-07T00:13:42Z"
  },
  {
    "title": "Democrats Give Trump Huge Media Win on Transgender Dispute",
    "description": "Democrats are giving President Donald Trump a huge media win on the transgender debate. \"Congratulations to every single person on the left who's been campaigning to destroy women’s and girls’ rights,\" author J.K. Rowling quipped.\nThe post Democrats Give Trum…",
    "link": "https://www.breitbart.com/politics/2025/02/06/democrats-give-trump-huge-media-win-on-transgender-dispute/",
    "timestamp": "2025-02-07T00:12:39Z"
  },
  {
    "title": "Mike Johnson Gives Update on Budget Talks After Long Meeting with Trump",
    "description": "House Speaker Mike Johnson along with Republican lawmakers held an hours-long meeting with President Donald Trump on Thursday about budgets and a future spending bill.\nWhy It Matters\nA spending bill, or \"reconciliation\" bill, has historically divided House Re…",
    "link": "https://biztoc.com/x/abd0444e2b0c4dc5",
    "timestamp": "2025-02-07T00:12:36Z"
  },
  {
    "title": "'Danger': WSJ editorial board once again bashes Trump over plan that 'deserves to die'",
    "description": "President Donald Trump's latest proposal earned derision even from the conservative Wall Street Journal editorial board on Thursday afternoon.The Journal opened with a rhetorical question about Trump's proposal this week to \"leverage federal assets to create …",
    "link": "https://www.rawstory.com/trump-sovereign-wealth-fund-2671111730/",
    "timestamp": "2025-02-07T00:12:35Z"
  },
  {
    "title": "Chicago Auto Show goes electric with 2 EV tracks, dozens of models and first appearance by Rivian",
    "description": "The atmosphere is electric at this year’s Chicago Auto Show, with two indoor EV test tracks, dozens of models and several high-profile debuts, including the first appearance by homegrown Rivian.\nBut with EV sales growth slowing and threats by President Donald…",
    "link": "https://biztoc.com/x/1af09f5e88d73b32",
    "timestamp": "2025-02-07T00:12:24Z"
  }
]