[
  {
    "title": "EU trade chief says bloc will respond swiftly to US tariffs",
    "description": "The European Union will respond \"firmly and swiftly\" to protect its interests if Washington imposes tariffs on the bloc's goods, its trade chief said Wednesday, rejecting President Donald Trump's claim that U.S.-EU trade ties are unfair.",
    "link": "https://www.hurriyetdailynews.com/eu-trade-chief-says-bloc-will-respond-swiftly-to-us-tariffs-206032",
    "timestamp": "2025-02-20T05:43:15Z"
  },
  {
    "title": "Trump throws support behind federal government taking over DC",
    "description": "President Donald Trump said he supports putting Washington, D.C., back under direct federal control while complaining to reporters about crime and homelessness in the nation's capital.",
    "link": "https://www.foxnews.com/politics/trump-throws-support-behind-federal-government-taking-over-dc",
    "timestamp": "2025-02-20T05:42:00Z"
  },
  {
    "title": "Battling Catholic bishops sue the Trump administration for 'their' migrant millions",
    "description": "The U.S. Catholic bishops have lawyered up. And they're out to claw back \"their\" money -- at last count $65 million in taxpayer cash -- which they use to advance the entry of millions of illegal migrants into the U.S. and leave the taxpayers with the bill for…",
    "link": "https://freerepublic.com/focus/f-news/4298998/posts",
    "timestamp": "2025-02-20T05:41:38Z"
  },
  {
    "title": "Fico’s meeting with Rutte called off unexpectedly",
    "description": "The Slovak PM was also booked to travel to the US to speak at conservative conference.",
    "link": "https://www.euractiv.com/section/politics/news/ficos-meeting-with-rutte-called-off-unexpectedly/",
    "timestamp": "2025-02-20T05:40:44Z"
  },
  {
    "title": "The mystery of Fort Knox: Is America’s $425 billion in gold really there, and why are Trump and Musk worried?",
    "description": "Billionaire Elon Musk has reignited the long-standing mystery surrounding Fort Knox, questioning whether America’s gold reserves are truly intact. His call for transparency—suggesting a live-streamed audit—has drawn support from figures like Senator Mike Lee …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-mystery-of-fort-knox-is-americas-425-billion-in-gold-really-there-and-why-are-trump-and-musk-worried/articleshow/118405044.cms",
    "timestamp": "2025-02-20T05:40:00Z"
  },
  {
    "title": "DOF: Economy ready for Trump 2.0, thanks to IRR of CREATE MORE law",
    "description": "The IRR tasks the Fiscal Incentives Review Board to conduct evaluations that will guide the President when granting fiscal incentives for 'highly desirable projects'",
    "link": "https://www.rappler.com/business/philippine-economy-ready-donald-trump-irr-create-more-law/",
    "timestamp": "2025-02-20T05:39:14Z"
  },
  {
    "title": "Conservative Merz leads Germany's turbulent election race",
    "description": "When Germans vote on Sunday, conservative Friedrich Merz is the strong favourite to become the next chancellor after a bitterly fought campaign roiled by the rise of the AfD, a far-right party vocally backed by Team Trump.",
    "link": "https://www.hurriyetdailynews.com/conservative-merz-leads-germanys-turbulent-election-race-206031",
    "timestamp": "2025-02-20T05:38:37Z"
  },
  {
    "title": "Trump to abolish IRS, shift tax burden to outsiders — US official",
    "description": "United States Commerce Secretary, Howard Lutnick, has said President Donald Trump’s goal is to ‘abolish’ the Internal Revenue Service. Lutnick, who disclosed this to Fox News on Wednesday, said Trump wants all outsiders to pay. His remarks comes as the IRS is…",
    "link": "https://punchng.com/trump-to-abolish-irs-shift-tax-burden-to-outsiders-us-official/",
    "timestamp": "2025-02-20T05:36:28Z"
  },
  {
    "title": "Report: Trump Suggests Federal Government 'Take Over,' 'Govern' D.C.",
    "description": "President Donald Trump suggested that the federal government \"should take over Washington, D.C.\" and govern it, citing how there was \"too much crime, too much graffiti\" and too many homeless encampments, according to several reports.\nThe post Report: Trump Su…",
    "link": "https://www.breitbart.com/politics/2025/02/19/report-trump-suggests-federal-government-take-govern-washington-d-c/",
    "timestamp": "2025-02-20T05:36:14Z"
  },
  {
    "title": "Trump turns against Zelensky -- and towards Russia",
    "description": "Donald Trump has escalated tensions with Ukrainian President Volodymyr Zelensky, branding him a \"dictator\" and adopting Russian narratives about the war. His decision to engage Moscow while sidelining Kyiv has raised concerns about U.S. support for Ukraine.",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-turns-against-zelensky-and-towards-russia/articleshow/118407117.cms",
    "timestamp": "2025-02-20T05:34:50Z"
  },
  {
    "title": "As Ukraine war reaches 3-year mark, Russia seems to have time on its side",
    "description": "Russian President Vladimir Putin's invasion of Ukraine three years ago has turned into Europe’s largest conflict since World War II",
    "link": "https://abcnews.go.com/International/wireStory/ukraine-war-reaches-3-year-mark-russia-time-118995084",
    "timestamp": "2025-02-20T05:31:41Z"
  },
  {
    "title": "$XRP Surges After US President Posts Article About 'Trump Effect' On Ripple",
    "description": "$XRP was up over 7% in the day after U.S. President Donald Trump posted an article on Truth Social that some $XRP Army members deemed was an \"endorsement\" of Ripple and the $XRP token.",
    "link": "https://www.ibtimes.com/xrp-surges-after-us-president-posts-article-about-trump-effect-ripple-3764365",
    "timestamp": "2025-02-20T05:31:10Z"
  },
  {
    "title": "Donald Trump’s Ripple Mentions Shake Up Crypto: Details",
    "description": "United States President Donald J. Trump shared two articles about Ripple on his Truth Social platform, igniting speculation over the potential implications for both Ripple and its native token, XRP. The posts—apparently referencing a so-called “Trump effect” …",
    "link": "https://bitcoinist.com/donald-trump-ripple-mentions-shake-up-crypto/",
    "timestamp": "2025-02-20T05:30:26Z"
  },
  {
    "title": "Zero Day review: Robert De Niro in his element as grouchy US president in fun Netflix technothriller",
    "description": "Television: The idea of a cyberattack reducing civilisation to ruins is outlandish. Or is it?",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/02/20/zero-day-review-robert-de-niro-in-his-element-as-grouchy-us-president-in-fun-netflix-technothriller/",
    "timestamp": "2025-02-20T05:30:00Z"
  },
  {
    "title": "Between a tariff and a hard place: How India can find the sweet trade spot in Trump era",
    "description": "President Trump’s threat to impose reciprocal tariffs on India mirrors a complex strategy to address perceived high tariffs on US goods. The approach raises questions about compliance with WTO rules and the potential for a broader trade dispute. The US-India …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/between-a-tariff-and-a-hard-place-how-india-can-find-the-sweet-trade-spot-in-trump-era/articleshow/118406683.cms",
    "timestamp": "2025-02-20T05:28:47Z"
  },
  {
    "title": "Trump tells BBC that Russia 'have the cards' in peace negotiations",
    "description": "Donald Trump says he believes Russia \"have the cards\" in any peace talks to end the war in Ukraine because they have \"taken a lot of territory\". The US president told the BBC he trusted that Moscow wants to see an end to the war, which Russia started when it …",
    "link": "https://freerepublic.com/focus/f-news/4298994/posts",
    "timestamp": "2025-02-20T05:28:13Z"
  },
  {
    "title": "Here’s What Trump Has to Say About the ‘DOGE Dividend' Proposed by Elon Musk",
    "description": "On Tuesday, Elon Musk responded to a proposal from James Fishback, CEO of Azoria, regarding a unique idea: the “DOGE Dividend.” This initiative aims to issue a $5,000 tax refund check to approximately 79 million American families, funded by a projected total …",
    "link": "https://freerepublic.com/focus/f-news/4298993/posts",
    "timestamp": "2025-02-20T05:24:54Z"
  },
  {
    "title": "Trump says he has not seen the Egyptian counter to his plan for Gaza",
    "description": "WASHINGTON — U.S. President Donald Trump said Wednesday evening he has not seen the proposal being discussed by Arab leaders as an alternative to his plan to take over Gaza once the war between Hamas and Israel ends.\n\n\n“I haven’t seen it,” Trump said in respo…",
    "link": "https://www.voanews.com/a/trump-says-he-has-not-seen-the-egyptian-counter-to-his-plan-for-gaza/7981543.html",
    "timestamp": "2025-02-20T05:23:41Z"
  },
  {
    "title": "Arab leaders meet to counter Trump's Gaza plan",
    "description": "Arab leaders will gather in Saudi Arabia on Friday to counter President Donald Trump's plan for U.S. control of Gaza and the expulsion of its inhabitants, diplomatic and government sources said.",
    "link": "https://www.hurriyetdailynews.com/arab-leaders-meet-to-counter-trumps-gaza-plan-206029",
    "timestamp": "2025-02-20T05:22:30Z"
  },
  {
    "title": "HHS issues new definitions of terms like ‘sex,’ ‘man’ and ‘woman’ that critics say ignore science | CNN",
    "description": "In one of Robert F. Kennedy Jr.’s first moves as secretary of the US Department of Health and Human Services, the agency released guidance Wednesday for the US government, external partners and the public that offers a narrower definition of sex than the ones…",
    "link": "https://www.cnn.com/2025/02/19/health/hhs-sex-man-woman-definitions/index.html",
    "timestamp": "2025-02-20T05:20:31Z"
  },
  {
    "title": "Trump's freeze on foreign aid could give China an opening on the world stage",
    "description": "President Trump's restrictions on foreign aid and targeting of the U.S. Agency for International Development may be providing an opportunity for China to increase its global influence. Lawmakers and experts are concerned about the potential impact on American…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-freeze-on-foreign-aid-could-give-china-an-opening-on-the-world-stage/articleshow/118406635.cms",
    "timestamp": "2025-02-20T05:17:25Z"
  },
  {
    "title": "Trump says Russia has 'the cards' in Ukraine talks",
    "description": "U.S. President Donald Trump said Wednesday that the Russians \"have the cards\" in any negotiation to end the war in Ukraine, after branding Ukrainian President Volodymyr Zelensky a \"dictator\" who refuses to hold elections.",
    "link": "https://www.hurriyetdailynews.com/trump-says-russia-has-the-cards-in-ukraine-talks-206028",
    "timestamp": "2025-02-20T05:15:49Z"
  },
  {
    "title": "Trump slams foreign election spending: “Why $21 million for India?”",
    "description": "Trump questions $21 million for voter turnout in India, criticizes Zelenskyy's governance in Ukraine, and highlights economic disparities.",
    "link": "https://www.thehindubusinessline.com/news/world/donald-trump-questions-21-million-fund-for-india-voter-turnout-says-guess-they-were-trying-to-get-somebody-else-elected/article69241345.ece",
    "timestamp": "2025-02-20T05:14:49Z"
  },
  {
    "title": "Why are MAGA followers claiming Google is exposing crimes by the DC elite?",
    "description": "Trump supporters are seizing on Google searches to claim Washington elites are fearful of being exposed for crimes.",
    "link": "https://www.aljazeera.com/news/2025/2/20/why-are-trump-supporters-claiming-google-search-is-revealing-dc-corruption",
    "timestamp": "2025-02-20T05:10:11Z"
  },
  {
    "title": "How Elbridge Colby Can Vanquish America-Lasters",
    "description": "A battle for the country’s foreign policy future is heating up. \nThe post How Elbridge Colby Can Vanquish America-Lasters appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/how-elbridge-colby-can-vanquish-america-lasters/",
    "timestamp": "2025-02-20T05:05:00Z"
  },
  {
    "title": "Anthony Edwards demands some respect from Barack Obama, viral video reveals: ‘I’m the truth!’",
    "description": "Anthony Edwards wasn't going to let former president Barack Obama go without giving him the respect he believed he deserved.",
    "link": "https://nypost.com/2025/02/20/sports/anthony-edwards-demands-some-respect-from-barack-obama/",
    "timestamp": "2025-02-20T05:04:51Z"
  },
  {
    "title": "Making America Sick Again: How Trump’s Drastic Layoffs at the Centers for Disease Control cripple our Response to Norovirus, Measles Outbreaks",
    "description": "By Jordan Miller, Arizona State University (The Conversation) - In just a few short weeks, the Trump administration has brought drastic changes to the Centers for Disease Control and Prevention and public health. Beginning with the removal of websites and key…",
    "link": "https://www.juancole.com/2025/02/response-norovirus-outbreaks.html",
    "timestamp": "2025-02-20T05:04:42Z"
  },
  {
    "title": "Brazil: Jair Bolsonaro deplores Lula coup plot charges",
    "description": "The far-right former president is accused of being part of a plot to kill current President Lula and other officials. Bolsonaro said \"vague accusations\" are being fabricated against him to \"silence dissenting voices.\"",
    "link": "https://www.dw.com/en/brazil-jair-bolsonaro-deplores-lula-coup-plot-charges/a-71678588",
    "timestamp": "2025-02-20T05:04:00Z"
  },
  {
    "title": "Trump Should Cut Off Europe’s Defense Welfare Queens",
    "description": "However, the president shouldn’t dictate to European allies how they should handle their own security. \nThe post Trump Should Cut Off Europe’s Defense Welfare Queens appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-should-cut-off-europes-defense-welfare-queens/",
    "timestamp": "2025-02-20T05:03:00Z"
  },
  {
    "title": "Hegseth directs Pentagon to find $50 billion in cuts this year to fund Trump military priorities",
    "description": "Defense Secretary Pete Hegseth has directed the military services to identify $50 billion in programs that could be cut next year in order to redirect those savings to fund President Donald Trump’s priorities",
    "link": "https://abcnews.go.com/Politics/wireStory/hegseth-directs-pentagon-find-50-billion-cuts-year-118988679",
    "timestamp": "2025-02-20T05:02:20Z"
  },
  {
    "title": "Reciprocal tariffs really mean chaos for global trade",
    "description": "America has tried reciprocity before, and discovered its flaws",
    "link": "https://www.livemint.com/opinion/online-views/reciprocal-tariffs-really-mean-chaos-for-global-trade-11740025653035.html",
    "timestamp": "2025-02-20T05:01:26Z"
  },
  {
    "title": "Media Briefing: Podcasters test different types of paywalls for subscriptions",
    "description": "Podcasters discuss testing out different podcast subscriptions, and how to grow them as a complement (or alternative) to advertising revenue at this year's On Air Fest event.",
    "link": "http://digiday.com/media/media-briefing-podcasters-test-different-types-of-paywalls-for-subscriptions/",
    "timestamp": "2025-02-20T05:01:00Z"
  },
  {
    "title": "Where Trump’s Punishment of Europe Should Lead To",
    "description": "On February 28 2022, five days after the operation to disarm Ukraine had started, I offered a prediction where it might lead to: The U.S. and its proxies in the EU and elsewhere have put up very harsh sanctions on Russia to damage its economy. The final inten…",
    "link": "https://www.lewrockwell.com/2025/02/no_author/where-trumps-punishment-of-europe-should-lead-to/",
    "timestamp": "2025-02-20T05:01:00Z"
  },
  {
    "title": "Where Did All of That Money Go?",
    "description": "Apparently our government cannot explain how 4.7 trillion dollars was spent.  Are you kidding me?  A stack of 4.7 trillion one dollar bills would reach all the way to the Moon and part of the way back.  This is yet another example of why we desperately need t…",
    "link": "https://www.lewrockwell.com/2025/02/michael-snyder/where-did-all-of-that-money-go/",
    "timestamp": "2025-02-20T05:01:00Z"
  },
  {
    "title": "Let the New Great Game Begin",
    "description": "This was never meant to be Yalta. Although Yalta 2.0 may eventually happen. This was never meant to be Yalta. Although Yalta 2.0 may eventually happen. On the Victory Day parade in Moscow next May 9, celebrating 80 years of the end of the Great Patriotic War …",
    "link": "https://www.lewrockwell.com/2025/02/no_author/let-the-new-great-game-begin/",
    "timestamp": "2025-02-20T05:01:00Z"
  },
  {
    "title": "Why It’s Crucial To Expose US Provocations in Ukraine",
    "description": "If you believe that Vladimir Putin’s invasion of Ukraine was unprovoked, you will likely compare Putin to Hitler and will likely oppose President Trump’s peace negotiations with Russia. After all, if Putin’s invasion was unprovoked, a settlement would reward …",
    "link": "https://original.antiwar.com/donald_smith/2025/02/19/why-its-crucial-to-expose-us-provocations-in-ukraine/",
    "timestamp": "2025-02-20T05:00:35Z"
  },
  {
    "title": "Trump Blames Ukraine: What The New York Times Gets Right and What The New York Times Gets Wrong",
    "description": "On February 18, for the first time since the war in Ukraine began, high ranking U.S. and Russian officials met to begin talks on ending the war. The U.S. delegation included Secretary of State Marco Rubio, Trump’s envoy to the Middle East and a favorite negot…",
    "link": "https://original.antiwar.com/ted_snider/2025/02/19/trump-blames-ukraine-what-the-new-york-times-gets-right-and-what-the-new-york-times-gets-wrong/",
    "timestamp": "2025-02-20T05:00:16Z"
  },
  {
    "title": "Trump’s executive orders and the fight against climate change",
    "description": "President Trump’s orders to leave the Paris Agreement and “terminate the Green New Deal” will have far-reaching consequences in the United States and globally. Ensuing geopolitical shifts and power gaps are likely to benefit China. Timo Leiter writes about th…",
    "link": "https://blogs.lse.ac.uk/businessreview/2025/02/20/trumps-executive-orders-and-the-fight-against-climate-change/",
    "timestamp": "2025-02-20T05:00:12Z"
  },
  {
    "title": "Greenlandic Grievances With Denmark and Trump’s Annexation Plan",
    "description": "One of my favorite places on Earth, Greenland, has suddenly become the center of worldwide attention as US President Donald Trump reiterated his 2019 proposal that the US should do whatever it takes to acquire Greenland from Denmark.  Trump’s interest stems f…",
    "link": "https://original.antiwar.com/joseph_terwilliger/2025/02/19/greenlandic-grievances-with-denmark-and-trump-annexation-plan/",
    "timestamp": "2025-02-20T05:00:08Z"
  },
  {
    "title": "The Soul of the Democrats",
    "description": "As Japan’s defeat during World War II became obvious, many of its soldiers performed harakiri -- a ritual suicide by disembowelment using a sword -- as an honorable alternative to surrendering. Perhaps one of the most notable moments of a U.S. ...",
    "link": "https://www.americanthinker.com/articles/2025/02/the_soul_of_the_democrats.html",
    "timestamp": "2025-02-20T05:00:00Z"
  },
  {
    "title": "The True Story Behind Why Atlanta Hasn't Had a White Mayor Since 1974",
    "description": "Atlanta mayors (L-R) Keisha Lance Bottoms, Maynard Jackson, and Kasim Reed \r\nPhoto: Marcus Ingram, Rick Friedman, Paras Griffin (Getty Images)\r\nThey don’t call Atlanta the Black Mecca for no reason. Nestled in the middle of the red state of Georgia, Atlanta i…",
    "link": "https://www.theroot.com/the-true-story-behind-why-atlanta-hasnt-had-a-white-may-1851765492",
    "timestamp": "2025-02-20T05:00:00Z"
  },
  {
    "title": "Never Again?",
    "description": "As memories fade and antisemitism rises, the promise of “Never Again” appears increasingly doubtful.\r\n\r\nTen thousand antisemitic incidents have occurred in America since October 2023, a thought that horrified me when I began writing this ...",
    "link": "https://www.americanthinker.com/articles/2025/02/never_again.html",
    "timestamp": "2025-02-20T05:00:00Z"
  },
  {
    "title": "Trump Said He Likes Musk’s Idea of Giving Americans a Dividend of DOGE’s Savings",
    "description": "The administration is considering a concept in which 20% of the savings produced by DOGE’s cost-cutting efforts goes to American citizens.",
    "link": "https://time.com/7259686/trump-musk-doge-dividend-savings-payments/",
    "timestamp": "2025-02-20T05:00:00Z"
  },
  {
    "title": "Trump Says the Federal Government Should ‘Take Over’ Washington, D.C.",
    "description": "The President threw his support behind Republican congressional efforts for a federal takeover of the nation’s capital, which he said has “too much crime.”",
    "link": "https://time.com/7259679/trump-washington-dc-federal-control-government/",
    "timestamp": "2025-02-20T05:00:00Z"
  },
  {
    "title": "Kash Patel: Poised to Lead the FBI Into a New Era",
    "description": "Photo Credit:Image: Kash Patel.  Credit: Gage Skidmore via Flickr, CC BY-SA 2.0.\r\n\n\n \n Gage SkidmoreKash Patel is poised for a Senate confirmation vote to become the director of the Federal Bureau of Investigations, marking a dramatic shift in the agency’s le…",
    "link": "https://www.americanthinker.com/articles/2025/02/kash_patel_poised_to_lead_the_fbi_into_a_new_era.html",
    "timestamp": "2025-02-20T05:00:00Z"
  },
  {
    "title": "Europe is dealing with Trump all wrong, according to his former national security adviser",
    "description": "President Donald Trump’s quick-fire approach to ending Russia’s war against Ukraine has left European allies worried they are being sidelined by the United States administration, as Washington and Moscow conduct direct negotiations. It has also caused a crisi…",
    "link": "https://www.politico.eu/podcast/power-play/europe-is-dealing-with-trump-all-wrong-according-to-his-former-national-security-adviser/",
    "timestamp": "2025-02-20T05:00:00Z"
  },
  {
    "title": "Most US manufacturers forecast layoffs at Vietnam operations with Trump tariffs, survey shows",
    "description": "HANOI: Most US manufacturers surveyed by the American Chamber of Commerce in Vietnam said they would be likely forced to lay off workers if the Trump administration imposed tariffs on the export-reliant Southeast Asian country. The survey was conducted from F…",
    "link": "https://www.channelnewsasia.com/business/most-us-manufacturers-forecast-layoffs-vietnam-operations-trump-tariffs-survey-shows-4948956",
    "timestamp": "2025-02-20T04:58:17Z"
  },
  {
    "title": "Record US LNG Exports May Give Relief to Buyers in Europe, Asia",
    "description": "US liquefied natural gas exports have extended a record-breaking run as new projects increased production, a trend that could help to ease high prices in Europe and Asia.",
    "link": "https://financialpost.com/pmn/business-pmn/record-us-lng-exports-may-give-relief-to-buyers-in-europe-asia",
    "timestamp": "2025-02-20T04:56:10Z"
  },
  {
    "title": "Elon Musk Tesla Factory in India, Trump New Tariffs, US Live News: Trump backs idea to share DOGE savings with American citizens",
    "description": "Tesla Car Factory In India, Trump New Tariffs with India, US News Live Updates: President Donald Trump said Wednesday that he likes the idea of giving some of the savings from Elon Musk’s Department of Government Efficiency back to US citizens as a kind of di…",
    "link": "https://www.thehindubusinessline.com/news/donald-trump-tariffs-elon-musk-telsa-factory-in-india-us-live-news-updates/article69241334.ece",
    "timestamp": "2025-02-20T04:54:41Z"
  },
  {
    "title": "Ukraine responds to Trump’s ‘Zelensky dictator’ claims",
    "description": "Ukrainian officials have rejected US President Donald Trump’s scathing attacks on Vladimir Zelensky Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/613040-ukraine-defends-zelensky-from-trump/",
    "timestamp": "2025-02-20T04:52:46Z"
  },
  {
    "title": "Trump's proposed 25% tariffs on automotive and chip imports have caused 'chaos' among industry leaders",
    "description": "US President Donald Trump announced plans to impose 25% tariffs on auto imports, semiconductors, and pharmaceuticals starting as early as April 2, with potential increases over time. This follows his recent 10% tariff on Chinese goods and 25% tariffs on steel…",
    "link": "https://www.digitimes.com/news/a20250219VL205/donald-trump-tariff-automotive-mexico-canada-tsmc.html",
    "timestamp": "2025-02-20T04:51:33Z"
  },
  {
    "title": "India Drug, Auto Exporters See Limited Impact of US Tariffs",
    "description": "Indian exporters don’t anticipate a major hit from US President Donald Trump’s latest threat to impose higher tariffs on automobile and pharmaceutical imports.",
    "link": "https://www.livemint.com/companies/news/india-drug-auto-exporters-see-limited-impact-of-us-tariffs-11740026975785.html",
    "timestamp": "2025-02-20T04:49:35Z"
  },
  {
    "title": "Trump says federal government should 'take over' DC, backing congressional GOP push",
    "description": "President Donald Trump is throwing his support behind congressional efforts for a federal takeover of the nation’s capital, saying he approves putting the District of Columbia back under direct federal control",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-federal-government-dc-backing-congressional-gop-push-118991448",
    "timestamp": "2025-02-20T04:46:28Z"
  },
  {
    "title": "Trump attacks Zelensky, says US wasted $350bn on Russian war",
    "description": "United States President Donald Trump has called Ukrainian President Volodymyr Zelensky a “dictator.” In a post on his Truth Social platform on Wednesday, Trump criticised Zelensky for his failure to hold elections, noting that the Ukrainian leader’s five-year…",
    "link": "https://punchng.com/trump-attacks-zelensky-says-us-wasted-350bn-on-russian-war/",
    "timestamp": "2025-02-20T04:36:03Z"
  },
  {
    "title": "Trump says trade deal with China is 'possible'",
    "description": "President Donald Trump on Wednesday suggested a trade deal was \"possible\" with China -- a key target in the US leader's tariffs policy. In 2020, the United States had already agreed to \"a great trade deal with China\" and a new deal was \"possible,\" Trump told …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-trade-deal-with-china-is-possible/articleshow/118405233.cms",
    "timestamp": "2025-02-20T04:26:38Z"
  },
  {
    "title": "Trump says Russians 'have the cards' in peace talks",
    "description": "The US leader tells the BBC he trusts that Moscow wants to see an end to the war in Ukraine.",
    "link": "https://www.bbc.com/news/articles/cvgwddmjyvzo",
    "timestamp": "2025-02-20T04:25:11Z"
  },
  {
    "title": "South Korea’s President Yoon in court for preliminary ‘rebellion’ hearing",
    "description": "Lawyers defending Yoon, who stands charged with trying to incite a rebellion, called for his release from custody.",
    "link": "https://www.aljazeera.com/news/2025/2/20/south-koreas-president-yoon-in-court-for-preliminary-rebellion-hearing",
    "timestamp": "2025-02-20T04:25:08Z"
  },
  {
    "title": "US Coast Guard expands border patrol efforts to combat illegal immigration",
    "description": "Although illegal crossings along the southwest border have fallen to their lowest levels in decades the U.S. Coast Guard is still increasing its presence alongside Border Patrol.",
    "link": "https://www.foxnews.com/politics/us-coast-guard-expands-border-patrol-efforts-combat-illegal-immigration",
    "timestamp": "2025-02-20T04:23:36Z"
  },
  {
    "title": "After Diversity Initiative Rollbacks, Meta & Google Aren’t Renewing Their Mardi Gras Contracts",
    "description": "This year, Meta and Google have not renewed their partnerships with Sydney’s Gay and Lesbian Mardi Gras Parade. The two tech companies have recently made enormous changes and removals to ...\nThe post After Diversity Initiative Rollbacks, Meta & Google Aren’t …",
    "link": "https://www.starobserver.com.au/news/national-news/after-diversity-initiative-rollbacks-meta-google-arent-renewing-their-mardi-gras-partnerships/235559",
    "timestamp": "2025-02-20T04:22:12Z"
  },
  {
    "title": "What's going on with the Kennedy Center under Donald Trump?",
    "description": "In Trump’s second term, he has restructured the Kennedy Center, replacing its leadership with his supporters and taking control of the board. This move has caused a backlash, with several artists resigning and cancelling performances, and the future direction…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/whats-going-on-with-the-kennedy-center-under-donald-trump/articleshow/118405068.cms",
    "timestamp": "2025-02-20T04:20:46Z"
  },
  {
    "title": "Trump says Russia has 'the cards' in Ukraine talks",
    "description": "US President Donald Trump said Wednesday that the Russians \"have the cards\" in any negotiation to end the war in Ukraine, after branding Ukrainian President Volodymyr Zelensky a \"dictator\" who refuses to hold elections. Trump savaged Zelensky, saying \"he refu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-russia-has-the-cards-in-ukraine-talks/articleshow/118404958.cms",
    "timestamp": "2025-02-20T04:17:03Z"
  },
  {
    "title": "G20 Foreign Ministers Meet In South Africa Without US On Board",
    "description": "Top diplomats from the Group of 20 major economies will convene in South Africa on Thursday for a meeting dominated by a packed global agenda but overshadowed by a snub by the top US envoy.",
    "link": "https://www.ibtimes.com/g20-foreign-ministers-meet-south-africa-without-us-board-3764383",
    "timestamp": "2025-02-20T04:15:13Z"
  },
  {
    "title": "Stock market today: Asian shares mostly dip despite S&P 500 adding to its record on Wall Street",
    "description": "Asian shares are trading mostly lower after a quiet day on Wall Street, where the S&P 500 added to its record. Benchmarks fell in Japan, South Korea and Australia in Thursday morning trading. In China, shares declined after China left is benchmark interest ra…",
    "link": "https://www.seattlepi.com/news/world/article/stock-market-today-asian-shares-mostly-dip-20176734.php",
    "timestamp": "2025-02-20T04:15:11Z"
  },
  {
    "title": "Trump backs idea to send some DOGE savings to American citizens",
    "description": "President Donald Trump says he likes the idea to give some of the savings from Elon Musk’s Department of Government Efficiency back to U.S. citizens as a kind of dividend. He expressed support twice Wednesday, first at an investment conference in Miami and la…",
    "link": "https://www.seattlepi.com/news/politics/article/trump-backs-idea-to-send-some-doge-savings-to-20176751.php",
    "timestamp": "2025-02-20T04:15:11Z"
  },
  {
    "title": "Howard Lutnick Shares Trump’s Plan To Ax IRS And Shift Tax Burden To ‘Outsiders’",
    "description": "Secretary of Commerce Howard Lutnick revealed President Donald Trump’s plan to dismantle the Internal Revenue Service (IRS), as a step toward tax reductions.",
    "link": "https://dailycaller.com/2025/02/19/howard-lutnick-irs-trump-tax-burden/",
    "timestamp": "2025-02-20T04:14:05Z"
  },
  {
    "title": "DOGE Dividend: Donald Trump plans to share $55 billion with direct payments of $5,000 to every taxpayer",
    "description": "DOGE Dividend: President Donald Trump is weighing a proposal that could see tax-paying Americans receive a one-time $5,000 payout from savings identified by Elon Musk’s Department of Government Efficiency (DOGE). The idea, championed by businessman James Fish…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/doge-dividend-donald-trump-plans-to-share-55-billion-with-direct-payments-of-5000-to-every-taxpayer/articleshow/118404448.cms",
    "timestamp": "2025-02-20T04:10:15Z"
  },
  {
    "title": "Steve Bannon Warns Republicans the ‘Oligarchs’ Will Abandon Them: ‘They’re With Us – But Only Temporarily’",
    "description": "Steve Bannon struck a word caution for Republicans who have fully embraced tech \"oligarchs.\"\nThe post Steve Bannon Warns Republicans the ‘Oligarchs’ Will Abandon Them: ‘They’re With Us – But Only Temporarily’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/steve-bannon-warns-republicans-the-oligarchs-will-abandon-them-theyre-with-us-but-only-temporarily/",
    "timestamp": "2025-02-20T04:04:43Z"
  },
  {
    "title": "Sensex falls over 300 pts, Nifty below 22,900; auto, bank stocks tumble",
    "description": "Indian benchmark indices began Thursday's trading session with losses, reflecting weakness in other Asian markets. Investor sentiment was dampened by uncertainty over US tariff measures and concerns about their impact on inflation. Major stocks such as Mahind…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-300-pts-nifty-below-22900-auto-bank-stocks-tumble/articleshow/118404582.cms",
    "timestamp": "2025-02-20T04:00:07Z"
  },
  {
    "title": "What the Founding Fathers Said About Kings",
    "description": "Trump declared himself “the king.” It’s what the crafters of the U.S. Constitution feared.",
    "link": "https://time.com/7259662/king-trump-founding-fathers-constitution-monarchy-democracy-republic/",
    "timestamp": "2025-02-20T04:00:00Z"
  },
  {
    "title": "Corporate executives wary of tariffs complicating investment decisions, says Deutsche Bank's Matthiessen",
    "description": "Regulatory changes are among the top concerns for CEOs and CFOs, and we help clients navigate these challenges to maintain resilience and profitability, says Deutsche Bank's Ole Matthiessen",
    "link": "https://www.livemint.com/companies/corporate-executives-wary-of-tariffs-complicating-investment-decisions-11739873188446.html",
    "timestamp": "2025-02-20T03:59:36Z"
  },
  {
    "title": "Trump Says Federal Government Should 'Take Over' D.C., Backing Congressional GOP Push",
    "description": "President Donald Trump is throwing his support behind congressional efforts for a federal takeover of the nation’s capital.",
    "link": "https://www.huffpost.com/entry/trump-washington-dc-take-over_n_67b6a683e4b050f805a0f3d6",
    "timestamp": "2025-02-20T03:55:14Z"
  },
  {
    "title": "Map Shows Trajectory of US Nuclear-Capable Missile Test",
    "description": "The test \"is not a response to current world events,\" U.S. Air Force Global Strike Command said.",
    "link": "https://www.newsweek.com/us-news-test-minuteman-iii-icbm-vandenberg-marshall-islands-pacific-2033529",
    "timestamp": "2025-02-20T03:54:29Z"
  },
  {
    "title": "Inside the week that upended U.S.-Ukraine relations",
    "description": "Tensions between the Trump administration and the Ukrainian government had been escalating behind the scenes for the past week.",
    "link": "https://www.nbcnews.com/politics/national-security/week-upended-us-ukraine-relations-rcna192407",
    "timestamp": "2025-02-20T03:54:26Z"
  },
  {
    "title": "Trump’s Energy Agenda: A Restoration of Balance",
    "description": "On Day One back in office, President Donald Trump began dismantling the Biden administration’s costly energy agenda and replacing it with practical and sustainable energy... Read More\nThe post Trump’s Energy Agenda: A Restoration of Balance appeared first on …",
    "link": "https://www.dailysignal.com/2025/02/19/trumps-energy-agenda-restoration-balance/",
    "timestamp": "2025-02-20T03:54:04Z"
  },
  {
    "title": "Trump Says Russia Has 'The Cards' In Ukraine Talks",
    "description": "US President Donald Trump said Wednesday that the Russians \"have the cards\" in any negotiation to end the war in Ukraine, after branding Ukrainian President Volodymyr Zelensky a \"dictator\" who refuses to hold elections.",
    "link": "https://www.ibtimes.com/trump-says-russia-has-cards-ukraine-talks-3764376",
    "timestamp": "2025-02-20T03:51:20Z"
  },
  {
    "title": "Trump Says Russia Has 'The Cards' In Ukraine Talks",
    "description": "US President Donald Trump said Wednesday that the Russians \"have the cards\" in any negotiation to end the war in Ukraine, after branding Ukrainian President Volodymyr Zelensky a \"dictator\" who refuses to hold elections.",
    "link": "https://www.ibtimes.com.au/trump-says-russia-has-cards-ukraine-talks-1856363",
    "timestamp": "2025-02-20T03:51:11Z"
  },
  {
    "title": "Trump’s Canada Tariffs ‘Make No Sense’, Says Trade Minister Ng",
    "description": "President Donald Trump’s tariffs only make goods more expensive for Americans, said Canada’s Trade Minister Mary Ng, reiterating a vow to retaliate if the country’s largest trading partner goes forward with import duties.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-canada-tariffs-make-no-sense-says-trade-minister-ng",
    "timestamp": "2025-02-20T03:50:11Z"
  },
  {
    "title": "Trump says he's considering buying used planes to serve as Air Force One amid Boeing delays",
    "description": "President Donald Trump says he is considering buying used Boeing aircraft — perhaps from an overseas seller — to use as Air Force One when he’s aboard, as he fumes over the U.S. plane-maker’s delays in producing two specially modified ones for presidential us…",
    "link": "https://www.seattlepi.com/business/article/trump-says-he-s-considering-buying-used-planes-to-20176711.php",
    "timestamp": "2025-02-20T03:47:32Z"
  },
  {
    "title": "Trump floats giving 20% of DOGE savings to American citizens",
    "description": "The amount of any payments -- an idea that Trump said was still under consideration -- would depend on figures from DOGE, which has had some of its savings claims debunked.",
    "link": "https://www.nbcnews.com/politics/doge/trump-floats-giving-20-doge-savings-american-citizens-rcna192931",
    "timestamp": "2025-02-20T03:40:57Z"
  },
  {
    "title": "Trump says he's considering buying used planes to serve as Air Force One amid Boeing delays",
    "description": "President Donald Trump is considering buying second-hand Boeing aircraft to use as Air Force One due to delays in Boeing's production of new models. He emphasized that the modifications for presidential suitability and security have added to the delays, with …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-hes-considering-buying-used-planes-to-serve-as-air-force-one-amid-boeing-delays/articleshow/118404200.cms",
    "timestamp": "2025-02-20T03:39:21Z"
  },
  {
    "title": "Trump, Musk emphasize the importance of 'full transparency' in DOGE efforts",
    "description": "President Donald Trump and Elon Musk discuss transparency at DOGE and economic pressures facing Americans in an exclusive interview on 'Hannity.'",
    "link": "https://www.foxnews.com/media/trump-musk-emphasize-importance-full-transparency-doge-efforts",
    "timestamp": "2025-02-20T03:39:15Z"
  },
  {
    "title": "중국 파고들고 러시아 웃는 트럼프 MAGA 정치...미국 넘어 동맹까지 분열 중",
    "description": "Federal Reserve officials in January expressed their readiness to hold interest rates steady amid stubborn inflation and economic policy uncertainty. https://t.co/AYr1ZZhVTU— Bloomberg Economics (@economics) February 19, 2025 The busiest trade hub in the US m…",
    "link": "https://ryueyes11.tistory.com/511492",
    "timestamp": "2025-02-20T03:37:52Z"
  },
  {
    "title": "Kevin McCarthy Says Dems’ Losing Streak Will Continue ‘The More’ They Fight Trump, Mocks Home State Of New DNC Leader",
    "description": "Former House Speaker Kevin McCarthy said Dems will continue to lose the more they fight against Trump, mocking the party's new leadership choice.",
    "link": "https://dailycaller.com/2025/02/19/kevin-mccarthy-democrat-party-donald-trump/",
    "timestamp": "2025-02-20T03:36:36Z"
  },
  {
    "title": "Trump signs orders curbing funding for migrants, eliminating regulations",
    "description": "President Donald Trump signed executive orders aimed at stopping federal funds from supporting illegal immigration and cutting regulations. The orders include prohibiting federal money for sanctuary cities and initiating a review of all existing regulations. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-orders-curbing-funding-for-migrants-eliminating-regulations/articleshow/118404123.cms",
    "timestamp": "2025-02-20T03:34:40Z"
  },
  {
    "title": "CDC layoffs strike deeply at its ability to respond to current outbreaks",
    "description": "In just a few short weeks, the Trump administration has brought drastic changes to the Centers for Disease Control and Prevention and public health. Beginning with the removal of websites and key public health datasets in January 2025, the Trump administratio…",
    "link": "https://www.rawstory.com/cdc-layoffs/",
    "timestamp": "2025-02-20T03:28:49Z"
  },
  {
    "title": "Hegseth Faces Backlash After Proposing Pentagon Cuts To Fund Trump's Agenda",
    "description": "Hegseth directed the Pentagon to find $50 billion in cuts for the next fiscal year so the money can be spent on Trump's policy priorities.",
    "link": "https://www.newsweek.com/pete-hegseth-faces-backlash-pentagon-budget-2033550",
    "timestamp": "2025-02-20T03:28:43Z"
  }
]