[
  {
    "title": "Trump says he’ll meet Putin next Friday in Alaska to discuss Ukraine war’s end and predicts ‘some swapping of territories’",
    "description": "Prior to his announcing the meeting with Putin, Trump’s efforts to pressure Russia into stopping the fighting have so far delivered no progress.",
    "link": "https://fortune.com/2025/08/08/trump-putin-meeting-alaska-ukraine-war-ceasefire-territory-swap/",
    "timestamp": "2025-08-08T22:38:40Z"
  },
  {
    "title": "Hamas’ harrowing hostage video: Letters to the Editor — Aug. 9, 2025",
    "description": "NY Post readers discuss a video of emaciated Israeli hostage Evyatar David digging his grave.",
    "link": "https://nypost.com/2025/08/08/opinion/hamas-harrowing-hostage-video-letters/",
    "timestamp": "2025-08-08T22:36:56Z"
  },
  {
    "title": "Trump to meet Putin to discuss Ukraine war next week in Alaska",
    "description": "The Aug. 15 summit will mark the first time the U.S. and Russia leaders will be together in person during President Trump's second term.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/08/trump-putin-summit-to-take-placed-in-alaska/85583893007/",
    "timestamp": "2025-08-08T22:36:16Z"
  },
  {
    "title": "Trump Demands $1bn From University Of California Over UCLA Protests",
    "description": "President Donald Trump demanded a massive $1 billion fine from the prestigious University of California system on Friday as the administration pushed its claims of antisemitism in UCLA's response to 2024 student protests related to Gaza.",
    "link": "https://www.ibtimes.com/trump-demands-1bn-university-california-over-ucla-protests-3780560",
    "timestamp": "2025-08-08T22:36:16Z"
  },
  {
    "title": "Team Trump mustn’t let slippery Putin squirm out of a real cease-fire",
    "description": "As President Trump's deadline for a cease-fire looms, expect Vladimir Putin to do the bare minimum to get the United States off his back without making any true effort toward peace at all.",
    "link": "https://nypost.com/2025/08/08/opinion/team-trump-cant-let-slippery-putin-squirm-out-of-a-real-cease-fire/",
    "timestamp": "2025-08-08T22:36:11Z"
  },
  {
    "title": "Trump to meet Putin on Aug. 15 in Alaska with aim of halting Ukraine war",
    "description": "U.S. and Russian officials are working toward an agreement on territories for the two leaders' meeting, sources said. It is unclear if they can get Kyiv and Brussels' buy-in.",
    "link": "https://www.japantimes.co.jp/news/2025/08/09/world/politics/russia-us-trump-putin-alaska/",
    "timestamp": "2025-08-08T22:34:00Z"
  },
  {
    "title": "Trump demands $1bn from University of California over UCLA protests",
    "description": "President Donald Trump demanded a massive $1 billion fine from the prestigious University of California system on Friday as the administration pushed its...",
    "link": "https://www.yahoo.com/news/articles/trump-demands-1bn-university-california-223340627.html",
    "timestamp": "2025-08-08T22:33:40Z"
  },
  {
    "title": "Trump announces August 15 meet-up with Putin in Alaska, warns of land swap",
    "description": "The announcement comes as Trump's deadline for Russia to agree to a Ukraine ceasefire passed without any new action.",
    "link": "https://www.aljazeera.com/news/2025/8/8/trump-announces-august-15-meet-up-with-putin-in-alaska-warns-of-land-swap",
    "timestamp": "2025-08-08T22:32:46Z"
  },
  {
    "title": "Trump is right: US census is a disgrace — but rushing a new one is worse",
    "description": "The census is a core function of the federal government — indeed, mandated by the Constitution — and it's an outrage that the last one missed so badly.",
    "link": "https://nypost.com/2025/08/08/opinion/trumps-right-about-the-census-but-rushing-one-is-worse/",
    "timestamp": "2025-08-08T22:31:45Z"
  },
  {
    "title": "Trump reveals time and place of Putin summit",
    "description": "The two leaders will meet in Alaska next week, the US president has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622684-trump-time-place-putin-summit/",
    "timestamp": "2025-08-08T22:31:14Z"
  },
  {
    "title": "Trump hits pause on trade talks with India, plays up tariff issue",
    "description": "Donald Trump has refused trade talks with India until tariff issues are settled. This follows the US raising tariffs on Indian imports to 50%. The US trade negotiators are still expected to visit New Delhi later this month for trade agreement talks. An Indian…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-hits-pause-on-trade-talks-with-india-plays-up-tariff-issue/articleshow/123195851.cms",
    "timestamp": "2025-08-08T22:30:00Z"
  },
  {
    "title": "Trump hits pause on trade talks with India, plays up tariff issue",
    "description": "Donald Trump has refused trade talks with India until tariff issues are settled. This follows the US raising tariffs on Indian imports to 50%. The US trade negotiators are still expected to visit New Delhi later this month for trade agreement talks. An Indian…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-hits-pause-on-trade-talks-with-india-plays-up-tariff-issue/articleshow/123199509.cms",
    "timestamp": "2025-08-08T22:30:00Z"
  },
  {
    "title": "Trump says he'll meet Putin on Aug 15 in Alaska",
    "description": "WASHINGTON: Donald Trump said Friday (Aug 8) he would meet with Russian counterpart Vladimir Putin on Aug 15 in Alaska, as the US president hopes to help mediate an end to the war in Ukraine. \"The highly anticipated meeting between myself, as President of the…",
    "link": "https://www.channelnewsasia.com/world/trump-says-hell-meet-putin-aug-15-in-alaska-5285966",
    "timestamp": "2025-08-08T22:29:42Z"
  },
  {
    "title": "Texas gov hit with major court action as Dems fire back over ouster bid",
    "description": "Texas Democrats who left the state to deny Republicans a quorum in the state legislature are firing back after Gov. Greg Abbott's novel legal salvo.The legislators made the move to obstruct any debate or passage of a new gerrymandered congressional map that s…",
    "link": "https://www.rawstory.com/texas-democrats-2673871083/",
    "timestamp": "2025-08-08T22:29:36Z"
  },
  {
    "title": "Trump says he'll meet Putin on Aug 15 in Alaska",
    "description": "WASHINGTON: US President Donald Trump will meet with Russian President Vladimir Putin to negotiate an end of the war in Ukraine on Aug 15 in Alaska, Trump said on Friday (Aug 8). Trump made the announcement on social media after he said that the parties, incl…",
    "link": "https://www.channelnewsasia.com/world/trump-putin-alaska-meeting-aug-15-united-states-russia-ukraine-5285966",
    "timestamp": "2025-08-08T22:29:00Z"
  },
  {
    "title": "‘Highly anticipated’: Trump announces meeting with Putin set for Aug. 15",
    "description": "Posts that sit-down will take place 'in the Great State of Alaska'",
    "link": "https://www.wnd.com/2025/08/highly-anticipated-trump-announces-meeting-putin-set-aug/",
    "timestamp": "2025-08-08T22:27:48Z"
  },
  {
    "title": "Trump to meet Putin next Friday in Alaska",
    "description": "US President Donald Trump announced that he will meet Russian President Vladimir Putin next Friday.\"The highly anticipated meeting between myself, as President of the United States of America, and President Vladimir Putin, of Russia, will take place next Frid…",
    "link": "https://www.israelnationalnews.com/flashes/663926",
    "timestamp": "2025-08-08T22:26:01Z"
  },
  {
    "title": "Report: CIA Officials Attempted to Redact Gabbard's Declassification of Russia Hoax Files",
    "description": "Director of National Intelligence (DNI) Tulsi Gabbard overrode officials from the CIA and other intelligence agencies to release a \"minimally redacted\" version of declassified documents that shed light on the Obama administration's fabricated Trump-Russia col…",
    "link": "https://www.breitbart.com/politics/2025/08/08/report-cia-officials-attempted-to-redact-gabbards-declassification-of-russia-hoax-files/",
    "timestamp": "2025-08-08T22:25:59Z"
  },
  {
    "title": "Donald Trump Reveals Location of Summit With Vladimir Putin",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced Friday that he and Russian President Vladimir Putin will meet in Alaska for a high-stakes summit over the Ukraine war, after saying earlier in the day that it \"will be a popula…",
    "link": "https://biztoc.com/x/c102f2ebba2b5945",
    "timestamp": "2025-08-08T22:25:33Z"
  },
  {
    "title": "Armenian and Azerbaijan presidents sign historic peace deal at White House",
    "description": "President Donald Trump answers questions during a signing ceremony with Azerbaijani President Ilham Aliyev (left) and Armenian Prime Minister Nikol Pashinyan (right) in the State Dining Room of the White House on Aug. 8, 2025, in Washington, D.C. The agreemen…",
    "link": "https://www.catholicnewsagency.com/news/265879/armenian-and-azerbaijan-presidents-sign-historic-peace-deal-at-white-house",
    "timestamp": "2025-08-08T22:23:00Z"
  },
  {
    "title": "America’s openness leaves Mahmoud Khalil free — to abuse our freedoms",
    "description": "Nothing in the Constitution or embedded in our longstanding American values compels this country to admit hateful ideologues.",
    "link": "https://nypost.com/2025/08/08/opinion/americas-openness-frees-mahmoud-khalil-to-abuse-our-freedoms/",
    "timestamp": "2025-08-08T22:20:51Z"
  },
  {
    "title": "Truth Social's New AI Chatbot Is Donald Trump's Media Diet Incarnate",
    "description": "Truth Search AI appears to rely heavily on conservative outlet Fox News to answer even the most basic questions.",
    "link": "https://www.wired.com/story/i-fear-truth-search-ai-might-be-biased-but-it-says-it-isnt/",
    "timestamp": "2025-08-08T22:20:48Z"
  },
  {
    "title": "Donald Trump Reveals Location of Summit With Vladimir Putin",
    "description": "President Trump revealed the location where he and Russian President Vladimir Putin will meet for a high-stakes summit over Ukraine.",
    "link": "https://www.newsweek.com/trump-reveals-putin-summit-location-ukraine-2111108",
    "timestamp": "2025-08-08T22:19:11Z"
  },
  {
    "title": "Armenia, Azerbaijan Sign Historic Deal to Help Settle Nagorno-Karabakh Feud",
    "description": "By establishing U.S. oversight of the Zangezur corridor, the White House bolsters its influence in the region.",
    "link": "http://foreignpolicy.com/2025/08/08/armenia-azerbaijan-war-peace-deal-trump-white-house-tripp-zangezur-corridor/",
    "timestamp": "2025-08-08T22:16:35Z"
  },
  {
    "title": "‘Cheap and tacky’: Design expert trashes Trump’s gold-soaked Oval Office makeover",
    "description": "President Donald Trump's Oval Office makeover didn't pass muster for one interior designer, who said the facelift looks \"cheap\" and \"tacky.\"The White House now prominently includes extensive gold embellishments on the walls, ceiling trim, and fireplace mantle…",
    "link": "https://www.rawstory.com/oval-office/",
    "timestamp": "2025-08-08T22:16:32Z"
  },
  {
    "title": "Trump says his meeting with Putin to take place in Alaska on August 15",
    "description": "(Reuters) -U.S. President Donald Trump said on Friday that his meeting with Russian President Vladimir Putin will take place on August 15 in Alaska. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/09/trump-says-his-meeting-with-putin-to-take-place-in-alaska-on-august-15",
    "timestamp": "2025-08-08T22:15:00Z"
  },
  {
    "title": "‘Kids Are Kids’: DC Attorney General Promoted Kid Gloves For Minors Before ‘Big Balls’ Attack",
    "description": "Washington, DC's Attorney General Brian Schwalb has faced criticism following his response to the Sunday night attack on DOGE's Edward \"Big Balls\" Coristine.",
    "link": "https://dailycaller.com/2025/08/08/kids-dc-attorney-generals-juvenile-crime-big-balls-attack-brian-schwalb/",
    "timestamp": "2025-08-08T22:14:35Z"
  },
  {
    "title": "Trump, Putin will hold first in-person meeting since Ukraine invasion next week in Alaska",
    "description": "Trump and Putin plan bilateral meeting next Friday in Alaska.",
    "link": "https://www.foxnews.com/world/trump-putin-hold-first-in-person-meeting-since-ukraine-invasion-next-week-alaska",
    "timestamp": "2025-08-08T22:14:14Z"
  },
  {
    "title": "Air Force revokes approved retirement for trans service members: 'Complete and utter betrayal'",
    "description": "Alyx, a transgender woman who has served in the Air Force for 15 years, was approved in May for early retirement due to the Trump administration’s policy prohibiting trans people from serving and enlisting in the military.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/air-force-revokes-approved-retirement-trans-service-members-complete-u-rcna223876",
    "timestamp": "2025-08-08T22:14:13Z"
  },
  {
    "title": "Ukraine: Putin, Trump to meet in Alaska over ceasefire",
    "description": "The war in Ukraine could be resolved \"very soon,\" US President Trump said, adding that he will meet Russia's Vladimir Putin next Friday in Alaska. Trump said a ceasefire would include some \"swapping\" of territory.",
    "link": "https://www.dw.com/en/ukraine-putin-trump-to-meet-in-alaska-over-ceasefire/a-73577396",
    "timestamp": "2025-08-08T22:13:00Z"
  },
  {
    "title": "U.S. Tariff Rate Soars To Levels Last Seen In The 1940s",
    "description": "The average U.S. tariff rate is estimated to rise to 11.4% in 2025 in the light of much of the Trump administration’s reciprocal tariffs reinstated since this week.",
    "link": "https://www.forbes.com/sites/katharinabuchholz/2025/08/08/us-tariff-rate-soars-to-levels-last-seen-in-the-1940s/",
    "timestamp": "2025-08-08T22:11:44Z"
  },
  {
    "title": "New York Times Rebukes Netanyahu Legal Threat With Strong Statement",
    "description": "The Israeli Prime Minister, who was accused last year of crimes against humanity, threatened on Fox News this week to sue the Times over its reporting on Gaza.",
    "link": "https://www.huffpost.com/entry/new-york-times-addresses-netanyahu-legal-threat-statement_n_68965435e4b087d455c2e150",
    "timestamp": "2025-08-08T22:09:34Z"
  },
  {
    "title": "Amber Duke Grills Texas Democrat On Funding Behind Redistricting Stunt",
    "description": "Texas State Rep. John Bryant says it’s legal to use campaign funds to cover the expenses of Democrats who fled the state.",
    "link": "https://dailycaller.com/2025/08/08/john-bryant-john-cornyn-amber-duke-texas-redistricting-funding/",
    "timestamp": "2025-08-08T22:09:32Z"
  },
  {
    "title": "Trump reveals when - and where - he will meet Putin for Ukraine talks",
    "description": "Donald Trump has announced his \"highly anticipated\" meeting with Vladimir Putin will take place next Friday in the US state of Alaska.",
    "link": "https://news.sky.com/story/donald-trump-reveals-when-and-where-he-will-meet-putin-for-ukraine-talks-13408879",
    "timestamp": "2025-08-08T22:05:00Z"
  },
  {
    "title": "‘Disgraced’: Secret Service stops renewal of former director’s security clearance",
    "description": "'Following the security debacle in Butler, the former director of USSS made the right decision to resign. I see no reason for her security clearance to be reinstated'",
    "link": "https://www.wnd.com/2025/08/disgraced-secret-service-stops-renewal-former-directors-security/",
    "timestamp": "2025-08-08T22:02:56Z"
  },
  {
    "title": "‘People Are Pissed’: FBI Employees Reportedly Give ‘Drizz’ a Hero’s Sendoff After Being Fired by Kash Patel",
    "description": "Former Acting Director of the FBI Brian Driscoll was reportedly \"clapped out of an FBI facility in Virginia as more than 200 people paid tribute.\"\nThe post ‘People Are Pissed’: FBI Employees Reportedly Give ‘Drizz’ a Hero’s Sendoff After Being Fired by Kash P…",
    "link": "https://www.mediaite.com/media/news/people-are-pissed-fbi-employees-reportedly-give-drizz-a-heros-sendoff-after-being-fired-by-kash-patel/",
    "timestamp": "2025-08-08T22:01:43Z"
  },
  {
    "title": "Former IRA member self-deports from US over fears of detention under Trump administration",
    "description": "Former IRA member Matthew Morrison flew to Dublin last month after 40 years in the US.",
    "link": "https://www.thejournal.ie/former-ira-deport-us-immigration-6786444-Aug2025/",
    "timestamp": "2025-08-08T22:00:21Z"
  },
  {
    "title": "Sydney Sweeney's brother makes cheeky 'good jeans' joke after his Air Force promotion",
    "description": "Sydney Sweeney's brother Trent celebrated his Air Force promotion to staff sergeant with a playful reference to the denim controversy surrounding his famous sister.",
    "link": "https://www.foxnews.com/entertainment/sydney-sweeneys-brother-makes-cheeky-good-jeans-joke-following-his-air-force-promotion",
    "timestamp": "2025-08-08T22:00:05Z"
  },
  {
    "title": "Trump Rattles Latin America by Weighing Using Military Force (Bloomberg)",
    "description": "Bloomberg:\nTrump Rattles Latin America by Weighing Using Military Force  —  Takeaways by Bloomberg AI  —  Hide … Tell us how AI is shaping your news experience.  Share your feedback  —  The US under President Donald Trump is crafting a confrontational approac…",
    "link": "https://www.memeorandum.com/250808/p116",
    "timestamp": "2025-08-08T22:00:00Z"
  },
  {
    "title": "The New Leader of Comedy Central Can’t Commit to Jon Stewart’s Television Future",
    "description": "A new interview with Paramount executive George Cheeks doesn’t seem promising",
    "link": "https://www.cracked.com/article_47798_the-new-leader-of-comedy-central-cant-commit-to-jon-stewarts-television-future.html",
    "timestamp": "2025-08-08T22:00:00Z"
  },
  {
    "title": "Trump offers UCLA $1bn settlement amid pro-Palestine protest standoff",
    "description": "The proposed settlement is the highest yet, as Trump continues pressure universities to submit to wide-ranging demands.",
    "link": "https://www.aljazeera.com/news/2025/8/8/trump-offers-ucla-1bn-settlement-amid-pro-palestine-protest-standoff",
    "timestamp": "2025-08-08T21:57:22Z"
  },
  {
    "title": "Greg Abbott Blasted by Major Texas Newspaper—'Corruption'",
    "description": "The newspaper criticized Abbott for his response to Democratic lawmakers fleeing the state in protest of the legislature's push for GOP-backed redistricting maps.",
    "link": "https://www.newsweek.com/greg-abbott-blasted-major-texas-newspaper-2111099",
    "timestamp": "2025-08-08T21:54:54Z"
  },
  {
    "title": "Armenia, Azerbaijan sign historic US-brokered peace deal",
    "description": "Armenia and Azerbaijan have signed a peace agreement in front of US President Donald Trump, ending decades of conflict. Armenia's Prime Minister Nikol Pashinyan and Azerbaijan President Ilham Aliyev signed a historic peace deal on Friday at the White House in…",
    "link": "https://www.dw.com/en/armenia-azerbaijan-sign-historic-us-brokered-peace-deal/a-73567746",
    "timestamp": "2025-08-08T21:54:00Z"
  },
  {
    "title": "Will Trump's axing of labor statistics chief taint jobs data?",
    "description": "Trump's replacement of labor statistics head after bad report shouldn't hurt integrity of jobs numbers. But there may still be reason to worry.",
    "link": "https://www.usatoday.com/story/money/2025/08/08/trump-firing-statistics-chief-jobs-labor-data/85568642007/",
    "timestamp": "2025-08-08T21:53:51Z"
  },
  {
    "title": "William Webster, former head of FBI and CIA, dies | CNN Politics",
    "description": "William Webster, the only person to lead both the FBI and CIA, has died.  He was 101.",
    "link": "https://www.cnn.com/2025/08/08/politics/william-webster-former-head-of-fbi-and-cia-dies",
    "timestamp": "2025-08-08T21:50:09Z"
  },
  {
    "title": "Are Tariffs the American Brexit?",
    "description": "How Trump’s trade policy will harm the U.S. economy.",
    "link": "http://foreignpolicy.com/2025/08/08/trump-united-states-trade-tariff-brexit-britain/",
    "timestamp": "2025-08-08T21:48:00Z"
  },
  {
    "title": "'Mind games': Putin sends sinister message with award for grieving CIA official’s family",
    "description": "Russian President Vladimir Putin sent a sinister message to a CIA official as President Donald Trump's negotiating envoy disbanded after negotiations for a ceasefire between Russia and Ukraine. The ceasefire isn't likely to move forward as Putin continues to …",
    "link": "https://www.rawstory.com/trump-putin-2673871075/",
    "timestamp": "2025-08-08T21:47:53Z"
  },
  {
    "title": "Azerbaijan, Armenia sign U.S.-brokered peace deal at White House",
    "description": "Azerbaijan and Armenia signed a U.S.-brokered peace agreement on Friday during a meeting with U.S. President Donald Trump that would boost bilateral economic ties after decades of conflict.",
    "link": "https://www.cbc.ca/news/world/trump-azerbaijan-armenia-peace-agreement-1.7604843",
    "timestamp": "2025-08-08T21:46:42Z"
  },
  {
    "title": "Azerbaijan and Armenia sign peace accord overseen by Trump at the White House",
    "description": "United States President Donald Trump has hosted his Azerbaijani counterpart Ilham Aliyev and Armenian Prime Minister Nikol Pashinyan at the White House for the signing of a peace treaty between the two longtime rivals. The US president said during a ceremony …",
    "link": "https://freerepublic.com/focus/f-news/4333504/posts",
    "timestamp": "2025-08-08T21:45:52Z"
  },
  {
    "title": "Trump executive order gives politicians control over all federal grants, alarming researchers",
    "description": "The Trump administration said these changes are part of an effort to streamline grantmaking.",
    "link": "https://www.bostonherald.com/2025/08/08/trump-research-funding/",
    "timestamp": "2025-08-08T21:44:45Z"
  },
  {
    "title": "WATCH: GOP senators divided over whether Epstein documents are a distraction or a needed reckoning",
    "description": "Republican senators offered a mixed bag of responses when asked about the Trump administration's handling of the Epstein files controversy.",
    "link": "https://www.foxnews.com/politics/watch-gop-senators-divided-over-whether-epstein-docs-distraction-needed-reckoning",
    "timestamp": "2025-08-08T21:43:55Z"
  },
  {
    "title": "Trump mulls territory swap between Russia and Ukraine",
    "description": "The potential peace deal between Moscow and Kiev would involve an exchange of territories, US President Donald Trump claims Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622683-trump-russia-ukraine-swap/",
    "timestamp": "2025-08-08T21:42:08Z"
  },
  {
    "title": "Trump says Ukraine and Russia will swap territory in possible peace deal",
    "description": "Donald Trump says a prospective peace deal between Russia and Ukraine will likely include \"some swapping of territories to the betterment of both\", as he confirms he plans to meet Vladimir Putin \"very shortly\".",
    "link": "https://www.abc.net.au/news/2025-08-09/russia-ukraine-us-donald-trump-vladimir-putin-deadline/105631862",
    "timestamp": "2025-08-08T21:42:01Z"
  },
  {
    "title": "Wall Street clocks another winning week",
    "description": "Stocks rose on Wall Street, marking their third winning week in the last four.",
    "link": "https://www.pressdemocrat.com/article/news/wall-street/",
    "timestamp": "2025-08-08T21:39:29Z"
  },
  {
    "title": "Laura Loomer Tears Into Taylor Greene Over AIPAC Attack: ‘Just Angry She Was Iced Out by the White House’",
    "description": "\"MTG is just angry she was iced out by the White House so she wants to create drama for the Trump admin. They really don’t want much to do with her.\"\nThe post Laura Loomer Tears Into Taylor Greene Over AIPAC Attack: ‘Just Angry She Was Iced Out by the White H…",
    "link": "https://www.mediaite.com/politics/laura-loomer-tears-into-taylor-greene-over-aipac-attack-just-angry-she-was-iced-out-by-the-white-house/",
    "timestamp": "2025-08-08T21:38:13Z"
  },
  {
    "title": "Exclusive-Harvard patents targeted by Trump administration",
    "description": "The Trump administration on Friday ordered a comprehensive review of Harvard University's federally funded research programs, and threatened to take title to...",
    "link": "https://www.yahoo.com/news/articles/exclusive-harvard-patents-targeted-trump-213704040.html",
    "timestamp": "2025-08-08T21:37:04Z"
  },
  {
    "title": "Trump Oversees Signing of Historic Azerbaijan-Armenia Peace Agreement",
    "description": "President Donald Trump announced Friday that the leaders of Armenia and Azerbaijan officially signed a peace agreement he oversaw in the Oval Office, marking the seventh global conflict he has settled in as many months.\nThe post Trump Oversees Signing of Hist…",
    "link": "https://www.breitbart.com/politics/2025/08/08/trump-oversees-signing-of-historic-azerbaijan-armenia-peace-agreement/",
    "timestamp": "2025-08-08T21:35:15Z"
  },
  {
    "title": "No trade talks till tariff issue resolved: Trump",
    "description": "India News:  There was suspense over the fate of the India-US trade negotiations after American President Donald Trump said that there would be no talks till the .",
    "link": "https://timesofindia.indiatimes.com/india/no-trade-talks-till-tariff-issue-resolved-trump/articleshow/123196616.cms",
    "timestamp": "2025-08-08T21:33:13Z"
  },
  {
    "title": "Trump says deal to halt Russia's war on Ukraine could include 'swapping' of territories",
    "description": "A peace deal to end Russia's invasion of Ukraine could include an exchange of territories, President Donald Trump said.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/08/trump-putin-zelenskyy-summit-russia-ukraine-us/85578588007/",
    "timestamp": "2025-08-08T21:32:57Z"
  },
  {
    "title": "Trump says will meet with Putin 'very shortly'",
    "description": "US President Donald Trump said Friday he would meet \"very shortly\" with his Russian counterpart Vladimir Putin, and suggested that a deal between Moscow and ...",
    "link": "https://www.yahoo.com/news/articles/putin-taps-key-allies-ahead-144800633.html",
    "timestamp": "2025-08-08T21:30:25Z"
  },
  {
    "title": "Republican Lawmakers Speaking Out Against Redistricting Battle",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs the redistricting arms race heats up, a handful of Republican lawmakers have been critical of the Texas GOP's effort to redraw its state's congressional boundaries.\nWhy It Matters\nTexas, with the support of…",
    "link": "https://biztoc.com/x/1d050d022e4ace9e",
    "timestamp": "2025-08-08T21:30:03Z"
  },
  {
    "title": "What’s Really Driving Netanyahu’s Decisions",
    "description": "A conversation with Yair Rosenberg about the hard-line Israeli faction that has long wanted to resettle Gaza",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/netanyahus-decisions-rosenberg/683808/",
    "timestamp": "2025-08-08T21:30:00Z"
  },
  {
    "title": "Trump Is Trying To Fast-Track Deportations for People Who Came Here Legally To Flee Socialism and Communism",
    "description": "President Donald Trump is rarely shy. One topic he has been consistently and especially vocal about during his time in American politics—a high bar to meet—is his opposition to socialism and communism.\n\"Under my administration, we have taken decisive action t…",
    "link": "https://biztoc.com/x/25d693b22c72016b",
    "timestamp": "2025-08-08T21:29:38Z"
  },
  {
    "title": "Trump removes Billy Long as IRS commissioner 2 months after confirmation",
    "description": "US President Donald Trump removed Internal Revenue Service Commissioner Billy Long from his position leading the bureau Friday, two months after his confirmation.\nTrump will appoint Treasury Secretary Scott Bessent to lead in an acting capacity, while Long sa…",
    "link": "https://biztoc.com/x/df4c576b9730fdd7",
    "timestamp": "2025-08-08T21:29:30Z"
  },
  {
    "title": "Trump Tariffs on Russia’s Oil Buyers Bring Economic, Political Risks",
    "description": "From punishing Brazil to trying to curb imports of fentanyl, U.S. President Donald Trump has wielded the threat of tariffs as an all-purpose foreign policy weapon.",
    "link": "https://gcaptain.com/trump-tariffs-on-russias-oil-buyers-bring-economic-political-risks-2/",
    "timestamp": "2025-08-08T21:29:12Z"
  },
  {
    "title": "How Trump Broke the DEI Machine",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post How Trump Broke the DEI Machine appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/08/how-trump-broke-the-dei-machine/",
    "timestamp": "2025-08-08T21:28:05Z"
  },
  {
    "title": "Trump executive order gives politicians control over all federal grants, alarming researchers",
    "description": "An executive order signed by President Donald Trump aims to give political appointees power over the billions of dollars of grants that are awarded by federal agencies",
    "link": "https://abcnews.go.com/US/wireStory/trump-executive-order-politicians-control-federal-grants-alarming-124495915",
    "timestamp": "2025-08-08T21:26:30Z"
  },
  {
    "title": "Trump announces historic Azerbaijan Armenia peace deal through “Trump Route” corridor — is this the breakthrough to end 35 years of conflict in the South Caucasus?",
    "description": "Trump announces historic Azerbaijan Armenia peace deal at White House, ending decades of conflict over Nagorno-Karabakh. This landmark agreement promises lasting peace, reopening borders, and boosting trade between the two nations. The deal includes a new tra…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-announces-historic-azerbaijan-armenia-peace-deal-through-trump-route-corridor-is-this-the-breakthrough-to-end-35-years-of-conflict-in-the-south-caucasus/articleshow/123196600.cms",
    "timestamp": "2025-08-08T21:26:01Z"
  },
  {
    "title": "NYT Jumps The Gun In Desperate Attempt To Fight Trump’s Battle Against Bogus Admissions",
    "description": "The New York Times (NYT) has drummed up a fresh protest against President Donald Trump’s education reforms, complaining about standardized testing",
    "link": "https://dailycaller.com/2025/08/08/donald-trump-elite-universities-sat-act-nyt-racism-wealth/",
    "timestamp": "2025-08-08T21:25:18Z"
  },
  {
    "title": "Mike Bianchi: Move over Tiger, Shaq, Arnie and Annika, Marta is the GOAT of Orlando sports",
    "description": "ORLANDO, Fla. — I got to thinking about this the other day and I wanted to present the question to you: Who do you think is the greatest professional athlete in Orlando sports history? Before you answer, here are the ground rules: The athlete has to have spen…",
    "link": "https://www.orlandosentinel.com/2025/08/07/marta-shaq-tiger-woods-orlando-pride-orlando-magic-kaka-mike-bianchi-commentary/",
    "timestamp": "2025-08-08T21:25:00Z"
  },
  {
    "title": "Republican Lawmakers Speaking Out Against Redistricting Battle",
    "description": "Some GOP lawmakers have criticized the mid-decade effort by Texas Republicans to redraw the state's congressional boundaries.",
    "link": "https://www.newsweek.com/republican-lawmakers-speaking-out-redistricting-battle-2111089",
    "timestamp": "2025-08-08T21:24:39Z"
  },
  {
    "title": "Green Card Applicants' Kids May Lose Legal Status After Trump Admin Move",
    "description": "The Department of Homeland Security said it was reversing a Biden-era extension of protections.",
    "link": "https://www.newsweek.com/h1b-green-card-applicants-children-protections-change-trump-administration-2111075",
    "timestamp": "2025-08-08T21:24:20Z"
  },
  {
    "title": "A fight over a school board member’s Instagram ‘likes’ escalates into Nazi name-calling",
    "description": "A school board meeting in Redlands, California, devolved into name-calling and Nazi comparisons this week amid a heated argument over a board member’s social media activity.",
    "link": "https://www.nbcnews.com/news/education/california-school-board-instagram-likes-nazi-name-calling-redlands-rcna223472",
    "timestamp": "2025-08-08T21:23:41Z"
  },
  {
    "title": "Aluminum Producer to Invest $50M in American Jobs as 'Direct Result' of Trump Tariffs",
    "description": "The largest producer of primary aluminum in the United States is set to invest $50 million to bring back its partially idled South Carolina plant in a \"direct\" response to President Donald Trump's tariffs, company officials announced this week.\nThe post Alumi…",
    "link": "https://www.breitbart.com/economy/2025/08/08/aluminum-producer-to-invest-50m-in-american-jobs-as-direct-resul/",
    "timestamp": "2025-08-08T21:23:34Z"
  },
  {
    "title": "“Ask her if she cares”: President Donald Trump’s controversial rant about Taylor Swift sparks outrage as she and Travis Kelce stay silent",
    "description": "Donald Trump reignited his feud with Taylor Swift by criticizing her on Truth Social, praising Sydney Sweeney instead. He claimed Swift was \"booed\" and \"no longer hot\" after he criticized her previously. Despite Trump's remarks, Swift and her boyfriend, Travi…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/ask-her-if-she-cares-president-donald-trumps-controversial-rant-about-taylor-swift-sparks-outrage-as-she-and-travis-kelce-stay-silent/articleshow/123196578.cms",
    "timestamp": "2025-08-08T21:23:25Z"
  },
  {
    "title": "Intel CEO responds to Trump resignation call with letter to employees",
    "description": "Yesterday, President Donald Trump publicly called for Intel CEO Lip-Bu Tan’s resignation, over accusations of “deeply conflicted” ties to China. Now, he is speaking out and making it clear he has no plans to step aside.\n\n\n\n more…",
    "link": "https://9to5mac.com/2025/08/08/intel-ceo-responds-to-trump-resignation-call-with-letter-to-employees/",
    "timestamp": "2025-08-08T21:21:59Z"
  },
  {
    "title": "Paxton Sues Beto O'Rourke, Democratic Lawmakers In Escalation Over Texas Legislature Walkout",
    "description": "The Texas House of Representatives has failed to meet a quorum for the third time this week as Democratic lawmakers continue their walkout to block a vote on congressional voting maps sought by President Donald Trump.",
    "link": "https://www.huffpost.com/entry/ap-us-election-2026-redistricting_n_6896685ae4b01cb42fec6c37",
    "timestamp": "2025-08-08T21:21:28Z"
  },
  {
    "title": "White House Hype Reel On Trump's 'Wins' Has 1 Really Ironic Twist",
    "description": "Even Trump’s critics showed up — just not how he thinks.",
    "link": "https://www.huffpost.com/entry/donald-trump-white-house-will-ferrell_n_68964916e4b06469a29548af",
    "timestamp": "2025-08-08T21:21:15Z"
  },
  {
    "title": "Trump Is Trying To Fast-Track Deportations for People Who Came Here Legally To Flee Socialism and Communism",
    "description": "For years, the president has rightly railed against those oppressive regimes. So why is his administration targeting their victims?",
    "link": "https://reason.com/2025/08/08/they-fled-socialism-and-came-to-the-u-s-legally-now-the-trump-administration-is-trying-to-deport-them/",
    "timestamp": "2025-08-08T21:19:00Z"
  },
  {
    "title": "President Trump Loses Bid to Have U.S. Substituted in His Place in Carroll v. Trump Libel Case",
    "description": "From Carroll v. Trump, handed down today by Judges Denny Chin, Sarah Merriam, and Maria Araújo Kahn:\nOn April 11, 2025, after this appeal was fully briefed, defendant-appellant President Donald J. Trump and the government (\"the Movants\") jointly moved to subs…",
    "link": "https://biztoc.com/x/f7c61319565f4fe1",
    "timestamp": "2025-08-08T21:18:47Z"
  },
  {
    "title": "Donald Trump pushes ahead with plans to take Fannie and Freddie public",
    "description": "A required part of this site couldn’t load. This may be due to a browser\nextension, network issues, or browser settings. Please check your\nconnection, disable any ad blockers, or try using a different browser.",
    "link": "https://biztoc.com/x/9ea91a6e77ea3894",
    "timestamp": "2025-08-08T21:18:31Z"
  },
  {
    "title": "Trump Announces He Plans to Meet With Putin ‘Very Shortly’",
    "description": "Donald Trump announced that he plans to meet “very shortly” with Russian President Vladimir Putin, as the US president looks to broker a ceasefire agreement in hopes of bringing an end to the war in Ukraine.\n----------\nLike this video? Subscribe https://www.y…",
    "link": "https://biztoc.com/x/7b67cf638d728399",
    "timestamp": "2025-08-08T21:18:25Z"
  },
  {
    "title": "Trump says plans for Putin meeting to be announced soon",
    "description": "Trump says details of meeting due to be announced soon",
    "link": "https://www.irishtimes.com/world/europe/2025/08/08/trump-says-plans-for-putin-meeting-to-be-announced-soon/",
    "timestamp": "2025-08-08T21:18:18Z"
  },
  {
    "title": "President Trump Loses Bid to Have U.S. Substituted in His Place in Carroll v. Trump Libel Case",
    "description": "From Carroll v. Trump, handed down today by Judges Denny Chin, Sarah Merriam, and Maria Araújo Kahn: On April 11, 2025,…\nThe post President Trump Loses Bid to Have U.S. Substituted in His Place in Carroll v. Trump Libel Case appeared first on Reason.com.",
    "link": "https://reason.com/volokh/2025/08/08/president-trump-loses-bid-to-have-u-s-substituted-in-his-place-in-carroll-v-trump-libel-case/",
    "timestamp": "2025-08-08T21:16:36Z"
  },
  {
    "title": "Trump executive order gives politicians control over all federal grants, alarming researchers",
    "description": "An executive order signed by President Donald Trump aims to give political appointees power over the billions of dollars of grants that are awarded by federal agencies.",
    "link": "https://www.clickondetroit.com/health/2025/08/08/trump-executive-order-gives-politicians-control-over-all-federal-grants-alarming-researchers/",
    "timestamp": "2025-08-08T21:15:07Z"
  },
  {
    "title": "Trump says he will meet with Putin ‘very shortly’ to discuss the war in Ukraine",
    "description": "Trump has said that Putin wants to meet as soon as possible.",
    "link": "https://www.thejournal.ie/trump-putin-meeting-ukraine-war-6786422-Aug2025/",
    "timestamp": "2025-08-08T21:14:28Z"
  },
  {
    "title": "Amy Acton's Chances of Beating Vivek Ramaswamy in Ohio—Polls",
    "description": "Ramaswamy has raised millions more than Acton in the first half of their Ohio gubernatorial campaigns.",
    "link": "https://www.newsweek.com/amy-acton-vivek-ramaswamy-ohio-governor-election-polls-2111046",
    "timestamp": "2025-08-08T21:12:11Z"
  },
  {
    "title": "Trump hosts Armenia and Azerbaijan for peace talks",
    "description": "US President Donald Trump is hosting the leaders of Armenia and Azerbaijan at the White House. In 2023 Azerbaijan took full control of the contested area of Nagorno-Karabakh - so what's in a peace deal for both sides, and for the US? \n\nAlso on the programme: …",
    "link": "https://www.bbc.co.uk/programmes/w172zss6c83v0ss",
    "timestamp": "2025-08-08T21:12:00Z"
  },
  {
    "title": "Georgia convicted felon accused of making death threats against President Trump arrested",
    "description": "According to the U.S. Department of Justice, Jauan Porter is accused of knowingly and willfully making threats against the president.",
    "link": "https://www.wsbradio.com/news/crime-and-law/georgia-convicted-felon-accused-making-death-threats-against-president-trump-arrested/ZAXT35DSUFF6PBHOOMCOZEX4NA/",
    "timestamp": "2025-08-08T21:11:49Z"
  },
  {
    "title": "Battenfeld: Another powerful Democrat nabbed by U.S. Attorney Leah Foley",
    "description": "U.S. Attorney Leah Foley has become the Massachusetts Democratic Party’s worst nightmare.",
    "link": "https://www.bostonherald.com/2025/08/08/battenfeld-another-powerful-democrat-nabbed-by-u-s-attorney-leah-foley/",
    "timestamp": "2025-08-08T21:11:05Z"
  },
  {
    "title": "Trump removes IRS boss, Treasury Secretary Bessent takes over on acting basis (NBC News)",
    "description": "NBC News:\nTrump removes IRS boss, Treasury Secretary Bessent takes over on acting basis  —  Billy Long, who was sworn in just over a month ago, was already the sixth person to hold the job this year.  —  President Donald Trump on Friday removed Internal Reven…",
    "link": "https://www.memeorandum.com/250808/p111",
    "timestamp": "2025-08-08T21:10:00Z"
  },
  {
    "title": "Democrats Warn New Trump Census Could Negate All The Illegal Alien Votes Biden Brought In",
    "description": "https://babylonbee.com/news/democrats-warn-new-trump-census-could-negate-all-the-illegal-alien-votes-biden-brought-inWASHINGTON, D.C. — After President Donald Trump ordered census takers to only include U.S. citizens in their counts, Democrats warned the coun…",
    "link": "https://freerepublic.com/focus/f-chat/4333501/posts",
    "timestamp": "2025-08-08T21:09:14Z"
  },
  {
    "title": "Apple has its best week since July 2020 after White House visit",
    "description": "Apple shares rose 13% this week, its largest weekly gain in more than five years, after CEO Tim Cook appeared with President Donald Trump in the White House on Wednesday.\nShares of the iPhone maker rose 4% to close at $229.35 per share on Friday for the compa…",
    "link": "https://biztoc.com/x/00d9ef70025dfbe0",
    "timestamp": "2025-08-08T21:07:33Z"
  },
  {
    "title": "WATCH: Trump suggests ‘swapping’ Ukraine and Russia territories ahead of meeting with Putin",
    "description": "President Donald Trump said Friday that he will meet “very shortly” with Russian President Vladimir Putin to discuss the war in Ukraine and that he will announce the location soon.",
    "link": "https://biztoc.com/x/52831525f083425c",
    "timestamp": "2025-08-08T21:07:29Z"
  }
]