[
  {
    "title": "S Jaishankar, Marco Rubio Hold Talks On Bilateral Trade Agreement",
    "description": "External Affairs Minister S Jaishankar and US Secretary of State Marco Rubio on Monday agreed on the need for early conclusion of the proposed India-US bilateral trade deal.",
    "link": "https://www.ndtv.com/world-news/s-jaishankar-marco-rubio-hold-talks-on-bilateral-trade-agreement-amid-trump-tariffs-8111515",
    "timestamp": "2025-04-07T19:26:18Z"
  },
  {
    "title": "Israeli forces seen building positions in Gaza as they take more ground",
    "description": "Evacuation warnings issued to hundreds of thousands of Palestinians in renewed offensive",
    "link": "https://www.irishtimes.com/world/middle-east/2025/04/07/israeli-forces-seen-building-positions-in-gaza-as-they-take-more-ground/",
    "timestamp": "2025-04-07T19:25:33Z"
  },
  {
    "title": "Ex-MI6 chief says Britain may need new conscription method if WW3 means UK ever has to bring it back",
    "description": "The former head of MI6 has issued a WW3 warning to the UK",
    "link": "https://www.ladbible.com/news/uk-news/uk-conscription-ww3-vladimir-putin-russia-328454-20250407",
    "timestamp": "2025-04-07T19:25:18Z"
  },
  {
    "title": "US having direct talks with Iran over its nuclear programme",
    "description": "Donald Trump has said the US is having direct talks with Iran over its nuclear programme.",
    "link": "https://news.sky.com/story/us-having-direct-talks-with-iran-as-trump-insists-tehran-cannot-get-nuclear-weapons-13344111",
    "timestamp": "2025-04-07T19:24:00Z"
  },
  {
    "title": "Ohtani, Betts, Dodgers visit Trump at White House",
    "description": "President Donald Trump welcomed Shohei Ohtani, Mookie Betts and the reigning champion Dodgers to the White House to congratulate them for winning the World Series.",
    "link": "https://www.espn.com/mlb/story/_/id/44575910/ohtani-betts-dodgers-visit-president-trump-white-house",
    "timestamp": "2025-04-07T19:23:41Z"
  },
  {
    "title": "EU trade ministers near agreement on first round of retaliatory tariffs against US",
    "description": "Trade ministers meeting in Luxembourg on Monday neared agreement on a list of US goods to target in response to the recent US decision to impose tariffs on steel and aluminium. But a second round designed to reply to the blanket 20% tariff on other imports fr…",
    "link": "https://freerepublic.com/focus/f-news/4309493/posts",
    "timestamp": "2025-04-07T19:23:23Z"
  },
  {
    "title": "EU agonizes over using its trade ‘bazooka’ to hit back at Trump’s mega tariff",
    "description": "The bloc has an olive branch in one hand and its Anti-Coercion Instrument in the other as it prepares for a tough encounter with U.S. President Donald Trump.",
    "link": "https://www.politico.eu/article/eu-trade-bazooka-anti-coercion-instrument-donald-trump-tariffs/",
    "timestamp": "2025-04-07T19:22:53Z"
  },
  {
    "title": "Immigration crackdowns disrupt the caregiving industry. Families pay the price",
    "description": "Americans depend on many foreign-born workers to help care for family members.",
    "link": "https://www.bostonherald.com/2025/04/07/immigration-caregiving-industry/",
    "timestamp": "2025-04-07T19:21:30Z"
  },
  {
    "title": "Trump and Netanyahu hold White House talks on tariffs, the war in Gaza and more",
    "description": "President Donald Trump says the U.S. is holding direct talks with Iran about its nuclear program.",
    "link": "https://www.news4jax.com/business/2025/04/07/trump-and-netanyahu-will-meet-on-tariffs-the-war-in-gaza-and-more/",
    "timestamp": "2025-04-07T19:20:42Z"
  },
  {
    "title": "Family Detained in Immigration Raid in Tom Homan’s Hometown Is Released",
    "description": "Residents of Sackets Harbor, New York, protested the detention of a mother and her three school-aged children. \nThe post Family Detained in Immigration Raid in Tom Homan’s Hometown Is Released appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/07/tom-homan-ice-sackets-harbor-deport/",
    "timestamp": "2025-04-07T19:20:06Z"
  },
  {
    "title": "Top federal labor officials reinstated by full DC federal appeals court | CNN Politics",
    "description": "Two former top federal labor protection officials were reinstated to their posts Monday by the full DC Circuit Court of Appeals – at least for now – amid a lengthy legal dispute over President Donald Trump’s ability to fire leaders from independent government…",
    "link": "https://www.cnn.com/2025/04/07/politics/federal-labor-officials-reinstated-appeals-court/index.html",
    "timestamp": "2025-04-07T19:19:55Z"
  },
  {
    "title": "Global Conservatives Get Second Wind from Trump Victory",
    "description": "Conservative parties from Germany and Poland to Australia and Canada are seeking to mimic the “America First” approach that fueled President Donald Trump’s stunning political comeback in 2024. That slogan, once ridiculed by global elites, has now become a ral…",
    "link": "https://freerepublic.com/focus/f-chat/4309491/posts",
    "timestamp": "2025-04-07T19:19:36Z"
  },
  {
    "title": "Technology, Communications Services Stocks Are Outpacing Broader Markets Monday: What's Going On?",
    "description": "Technology and Communications Services stocks are outpacing the broader market on Monday amid a volatile session for U.S. equities related to tariff headlines.\nWhat Happened: The SPDR S&P 500 (NYSE:SPY) continues to trade with high levels of volatility after …",
    "link": "https://biztoc.com/x/e6a02d989a0c11c5",
    "timestamp": "2025-04-07T19:19:06Z"
  },
  {
    "title": "Bogus report on tariff pause briefly lifted markets before White House denied it",
    "description": "A bogus rumor that President Donald Trump was considering a pause in tariffs briefly lifted markets Monday before the White House shot down the unfounded reports.\nThe confusion — which was amplified on social media and by some traditional media outlets — last…",
    "link": "https://biztoc.com/x/4ce878fb897de74f",
    "timestamp": "2025-04-07T19:19:03Z"
  },
  {
    "title": "Apple plans to get more iPhones to US from India to offset China tariffs: Report",
    "description": "Apple is planning iPhone shipments from India to the US as a short-term measure to soften the blow of new Trump-era tariffs on Chinese imports. With China facing a 54% tariff and India 26%, Apple could save up to $300 per device by shifting supply.",
    "link": "https://www.livemint.com/news/us-news/apple-plans-to-reroute-iphone-shipments-to-us-from-india-to-offset-china-tariffs-report-11744052403906.html",
    "timestamp": "2025-04-07T19:17:29Z"
  },
  {
    "title": "US govt. sets AI policies across agencies",
    "description": "The US Office of Management and Budget (OMB) issued two directives specifying policies and deadlines for deploying AI tools that enhance public services, providing a roadmap for implementing US President Donald Trump’s executive order advance US “dominance” i…",
    "link": "https://cointelegraph.com/news/white-house-memos-agencies-lean-forward-towards-ai",
    "timestamp": "2025-04-07T19:17:14Z"
  },
  {
    "title": "CNBC And Reuters Fuel Market Chaos With Inaccurate Reporting — Then Point Fingers After the Mistake",
    "description": "The misquote created a sharp turnaround, however brief, as the market cratered as a result of Trump's ongoing global trade war.\nThe post CNBC And Reuters Fuel Market Chaos With Inaccurate Reporting — Then Point Fingers After the Mistake first appeared on Medi…",
    "link": "https://www.mediaite.com/news/cnbc-and-reuters-fuel-market-chaos-with-inaccurate-reporting-then-point-fingers-after-the-mistake/",
    "timestamp": "2025-04-07T19:17:03Z"
  },
  {
    "title": "Watch: Donald Trump Speaks with Benjamin Netanyahu in Oval Office",
    "description": "President Donald Trump speaks with Israeli Prime Minister Benjamin Netanyahu in the Oval Office on Monday, April 7.\nThe post Watch: Donald Trump Speaks with Benjamin Netanyahu in Oval Office appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/04/07/watch-donald-trump-speaks-with-benjamin-netanyahu-in-oval-office/",
    "timestamp": "2025-04-07T19:16:49Z"
  },
  {
    "title": "USA to Allow Scotch Whisky Back in Without Additional Tariffs",
    "description": "ONE quickish concession following the election of Joe Biden as US President has seen a four-month suspension of the 25 per cent tariffs imposed by Donald Trump on the import of Scotch Whisky. Amongst other exports also now allowed into the US tariff free are …",
    "link": "https://freerepublic.com/focus/f-news/4309489/posts",
    "timestamp": "2025-04-07T19:16:10Z"
  },
  {
    "title": "European Union Slaps 25% Tariffs On United States In Retaliation (Aaron Parnas/MeidasTouch News)",
    "description": "Aaron Parnas / MeidasTouch News:\nEuropean Union Slaps 25% Tariffs On United States In Retaliation  —  Only Zimbabwe and Penguin Island are willing to negotiate with Trump  —  The European Commission has announced a new wave of counter-tariffs in retaliation t…",
    "link": "https://www.memeorandum.com/250407/p102",
    "timestamp": "2025-04-07T19:15:01Z"
  },
  {
    "title": "Rand Paul Is Right to Oppose Trump’s Tariffs",
    "description": "The cold, hard truth is that tariffs are bad for the GOP and even worse for America. As he pursues his trade war, Donald Trump is threatening to go for the nuclear option. On Monday morning, he vowed to impose an additional 50 percent in tariffs on China in a…",
    "link": "https://nationalinterest.org/blog/jacob-heilbrunn/rand-paul-is-right-to-oppose-trumps-tariffs",
    "timestamp": "2025-04-07T19:14:34Z"
  },
  {
    "title": "'Economic nuclear war': Some billionaires criticize Trump's tariffs",
    "description": "President Donald Trump's tariffs have stoked fears of a wider global trade war.",
    "link": "https://abcnews.go.com/Business/economic-nuclear-war-billionaires-criticize-trumps-tariffs/story?id=120570107",
    "timestamp": "2025-04-07T19:14:00Z"
  },
  {
    "title": "The Worry Isn’t The Stock Market On Monday, It’s The Economy Afterward",
    "description": "Equities markets swing with the emotions of the investors. But entire economies tend to move more slowly and, when they do, they can take a long time to return to normal.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/04/07/the-worry-isnt-the-stock-market-on-monday-its-the-economy-afterward/",
    "timestamp": "2025-04-07T19:13:53Z"
  },
  {
    "title": "Trump digs in his heels as global markets keep dropping over tariffs",
    "description": "Amidst plunging global markets following his tariff announcement, President Trump remains defiant, blaming past leaders for trade imbalances. He insists tariffs are necessary to rebuild domestic manufacturing, singling out China. Federal Reserve Chair Jerome …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-digs-in-his-heels-as-global-markets-keep-dropping-over-tariffs/articleshow/120074302.cms",
    "timestamp": "2025-04-07T19:12:54Z"
  },
  {
    "title": "What Is The 'Nick Castellanos Bad Timing' Home Runs Meme? The Viral Jokes About The MLB Player's Big Hits Explained",
    "description": "Nick Castellanos of the Philadelphia Phillies has been inspiring memes for years thanks to the strange timing of his homeruns. Here's why.",
    "link": "https://knowyourmeme.com/editorials/guides/what-is-the-nick-castellanos-bad-timing-home-runs-meme-the-viral-jokes-about-the-mlb-players-big-hits-explained",
    "timestamp": "2025-04-07T19:11:32Z"
  },
  {
    "title": "What Is The 'Nick Castellanos Bad Timing' Home Runs Meme? The Viral Jokes About The MLB Player's Big Hits Explained",
    "description": "Nick Castellanos of the Philadelphia Phillies has been inspiring memes for years thanks to the strange timing of his home runs. Here's why.",
    "link": "https://knowyourmeme.com/editorials/guides/what-is-the-nick-castellanos-bad-timing-home-runs-meme-the-viral-jokes-and-theory-about-the-mlb-players-big-hits-explained",
    "timestamp": "2025-04-07T19:11:32Z"
  },
  {
    "title": "‘It’s Called Baseball!’ Trump Delivers Bizarre, Rambling Recap of the LA Dodgers World Series Victory During White House Ceremony",
    "description": "President Donald Trump on Monday went on a bizarre tangent about the Los Angeles Dodgers' injuries during the team's White House visit.\nThe post ‘It’s Called Baseball!’ Trump Delivers Bizarre, Rambling Recap of the LA Dodgers World Series Victory During White…",
    "link": "https://www.mediaite.com/sports/its-called-baseball-trump-delivers-bizarre-rambling-recap-of-the-la-dodgers-world-series-victory-during-white-house-ceremony/",
    "timestamp": "2025-04-07T19:09:04Z"
  },
  {
    "title": "UK house prices see biggest drop in a year amid changes in stamp duty rules",
    "description": "UK house prices fell 0.5 per cent in March—marking the sharpest monthly decline in a year—as the market cooled following a rush to beat stamp duty changes in England and Northern Ireland. Despite this dip, experts expect moderate growth in 2025, supported by …",
    "link": "https://economictimes.indiatimes.com/news/international/uk/uk-house-prices-see-biggest-drop-in-a-year-amid-changes-in-stamp-duty-rules/articleshow/120074066.cms",
    "timestamp": "2025-04-07T19:08:58Z"
  },
  {
    "title": "‘That’s F*cking Bullsh*t!’ Dave Portnoy Rips Fox’s Will Cain and Outkick’s Clay Travis for Downplaying Wall Street Chaos",
    "description": "Dave Portnoy took exception to Will Cain and Clay Travis telling the American public not to worry about the market's reaction to Donald Trump's tariffs.\nThe post ‘That’s F*cking Bullsh*t!’ Dave Portnoy Rips Fox’s Will Cain and Outkick’s Clay Travis for Downpl…",
    "link": "https://www.mediaite.com/news/thats-fcking-bullsht-dave-portnoy-rips-foxs-will-cain-and-outkicks-clay-travis-for-downplaying-wall-street-chaos/",
    "timestamp": "2025-04-07T19:08:38Z"
  },
  {
    "title": "Mobile Home Park Residents At Forefront Of Battle Over Affordable Housing",
    "description": "Here are the morning's top stories on Monday, April 7, 2025… A Fresno mobile home park has become ground zero in a fight to save one of the last bastions of affordable housing in California. But residents there are facing an uncertain future as they wait for …",
    "link": "https://www.kqed.org/news/12034694/mobile-home-park-residents-at-forefront-of-battle-over-affordable-housing",
    "timestamp": "2025-04-07T19:08:12Z"
  },
  {
    "title": "The 'Trump recession': Most CEOs are expecting a downturn, survey says",
    "description": "An alarming 69% of CEOs said they anticipate that the U.S. will fall into a recession — and they’re placing the blame squarely on President Donald Trump and his tariffs. Read more...",
    "link": "https://qz.com/the-trump-recession-ceos-expect-downturn-inflation-1851775112",
    "timestamp": "2025-04-07T19:08:00Z"
  },
  {
    "title": "US Stocks Swing Wildly With Trump Tariffs Sparking Volatility",
    "description": "US stocks swung violently, wiping out a 4% plunge to rise more than 3% before turning negative again investors reacted to a swirl of headlines related to President Donald Trump’s trade policies. #markets #stocks #finance #investing #money #economy\nThe S&P 500…",
    "link": "https://biztoc.com/x/c947c8af615a80c6",
    "timestamp": "2025-04-07T19:07:59Z"
  },
  {
    "title": "Trump Tariffs To Hurt Nike, Under Armour, VF: Are Ralph Lauren, Foot Locker Safer Bets?",
    "description": "Brands that rely on the Asia-Pacific region to produce apparel goods are likely trying to find ways to mitigate the impact of President Donald Trump‘s reciprocal tariff plan,\nThe average pre-mitigation headwinds to gross margin and EPS are 670bps and 65%, res…",
    "link": "https://biztoc.com/x/26aa756461b708cc",
    "timestamp": "2025-04-07T19:07:59Z"
  },
  {
    "title": "US commerce chamber may sue Trump over tariffs",
    "description": "The United States Chamber of Commerce (USCC) is considering suing President Donald Trump's administration to stop the head of state's new tariffs on other countries' exports from coming to force on We...",
    "link": "https://biztoc.com/x/f16df66c53fd805b",
    "timestamp": "2025-04-07T19:07:55Z"
  },
  {
    "title": "Bogus report on tariff pause briefly lifted markets before White House denied it",
    "description": "The confusion was amplified on social media and by some traditional media outlets.",
    "link": "https://www.bostonherald.com/2025/04/07/trump-tariff-pause-misinformation/",
    "timestamp": "2025-04-07T19:06:58Z"
  },
  {
    "title": "Free Speech Thrives Online: Welcome to ‘Era of Rumble’",
    "description": "Rumble is experiencing record revenues, revealing more content creators, and consumers are turning to the platform that upholds free speech in America and around the world.... Read More\nThe post Free Speech Thrives Online: Welcome to ‘Era of Rumble’ appeared …",
    "link": "https://www.dailysignal.com/2025/04/07/free-speech-lives-online-welcome-era-rumble/",
    "timestamp": "2025-04-07T19:06:36Z"
  },
  {
    "title": "Donald Trump’s sharemarket bloodbath hits Australians’ superannuation savings",
    "description": "Retirement savings are taking a beating, and economists predict equity prices will fall further.",
    "link": "https://www.smh.com.au/business/the-economy/donald-trump-s-sharemarket-bloodbath-hits-australians-savings-20250407-p5lpua.html",
    "timestamp": "2025-04-07T19:05:57Z"
  },
  {
    "title": "'Crisis In Masculinity': Fox News Pundit Claims Trump's Tariffs Will Make Men More Manly",
    "description": "Batya Ungar-Sargon, a journalist describing herself as a \"MAGA lefty,\" told Fox News that President Donald Trump's tariffs would help bring manly jobs back to America's working class that is facing a \"crisis in masculinity.\"\n\n\n\"It's not just the destruction o…",
    "link": "https://crooksandliars.com/2025/04/crisis-masculinity-fox-news-pundit-claims",
    "timestamp": "2025-04-07T19:05:35Z"
  },
  {
    "title": "A major economic shock is happening thanks to Trump - and the UK can do little to stop it",
    "description": "A major global economic shock is taking place; it's duration unknown, it's severity anyone's guess, and no one has a surefire way of stopping it because it's all based on the proclivities of one man who is supposed to be our ally.",
    "link": "https://news.sky.com/story/a-major-economic-shock-is-happening-thanks-to-trump-and-the-uk-can-do-little-to-stop-it-13344098",
    "timestamp": "2025-04-07T19:05:00Z"
  },
  {
    "title": "Chile's Codelco boosts copper output, chairman bullish despite trade war",
    "description": "Codelco, Chile's state-owned copper producer, boosted production in the first three months of 2025 and was still bullish about long-term prospects for global...",
    "link": "https://finance.yahoo.com/news/chiles-codelco-boosts-copper-output-190321413.html",
    "timestamp": "2025-04-07T19:03:21Z"
  },
  {
    "title": "Ben Shapiro Backs ‘100% Right’ Elon Musk Over Criticism of Trump Tariffs",
    "description": "The Daily Wire's Ben Shapiro backed Elon Musk over his criticism of the Trump administration's sweeping imposition of tariffs.\nThe post Ben Shapiro Backs ‘100% Right’ Elon Musk Over Criticism of Trump Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/ben-shapiro-backs-100-right-elon-musk-over-criticism-of-trump-tariffs/",
    "timestamp": "2025-04-07T19:02:53Z"
  },
  {
    "title": "Trump gushes over Shohei Ohtani as president welcomes Dodgers to White House",
    "description": "Los Angeles Dodgers star Shohei Ohtani was the talk of the East Room of the White House as President Donald Trump touted the star player's accomplishments.",
    "link": "https://www.foxnews.com/sports/trump-gushes-over-shohei-ohtani-president-welcomes-dodgers-white-house",
    "timestamp": "2025-04-07T19:02:50Z"
  },
  {
    "title": "French-British firm admits it can’t compete with Musk’s Starlink",
    "description": "Kiev’s backers reportedly fear Elon Musk will shut down a vital communications service used by the Ukrainian military Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615346-starlink-musk-eu-alternatives-ukraine/",
    "timestamp": "2025-04-07T19:00:53Z"
  },
  {
    "title": "Bill Maher Heaps PRAISE on Trump — As President is Savaged by Billionaire Backer Bill Ackman For Putting U.S. On Course For 'Economic Nuclear Winter' Amid Global Stock Market Meltdown",
    "description": "Bill Maher has praised Donald Trump after one of the president's billionaire supporters, Bill Ackman, flipped on him following sweeping global tariffs.",
    "link": "https://radaronline.com/p/bill-maher-donald-trump-praise-bill-ackman-warns-tariffs-economic-nuclear-war/",
    "timestamp": "2025-04-07T19:00:00Z"
  },
  {
    "title": "Apocalyptic forecast: Japan warns of impending megaquake that could kill 300,000 and unleash 100-foot tsunamis in worst natural disaster yet",
    "description": "Japan is bracing for a potential megaquake in the Nankai Trough, with experts warning of catastrophic tsunamis reaching over 100 feet. The impending disaster could result in 300,000 fatalities, displace millions, and destroy countless buildings. The governmen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/apocalyptic-forecast-japan-warns-of-impending-megaquake-that-could-kill-300000-and-unleash-100-foot-tsunamis-in-worst-natural-disaster-yet/articleshow/120074063.cms",
    "timestamp": "2025-04-07T18:59:23Z"
  },
  {
    "title": "‘I’m Not On The Left’: Jake Tapper Clashes With Brooke Rollins Over Trump’s Tariffs",
    "description": "CNN’s Jake Tapper denied Sunday that he is “on the left” after Agriculture Secretary Brooke Rollins called out his “side” for “freaking out” over tariffs.... Read More\nThe post ‘I’m Not On The Left’: Jake Tapper Clashes With Brooke Rollins Over Trump’s Tariff…",
    "link": "https://www.dailysignal.com/2025/04/07/im-not-on-the-left-jake-tapper-clashes-with-brooke-rollins-over-trumps-tariffs/",
    "timestamp": "2025-04-07T18:58:57Z"
  },
  {
    "title": "How actual ‘fake news’ caused a market whiplash",
    "description": "An errant post on X may have just shaken the stock market, showing how influential — and irresponsible — the social media platform can be.",
    "link": "https://www.cnn.com/2025/04/07/media/fake-news-x-post-caused-market-whiplash/index.html",
    "timestamp": "2025-04-07T18:58:33Z"
  },
  {
    "title": "Is the tide turning against Trump’s tariffs?",
    "description": "Global markets are reeling after President Trump’s latest tariff announcement last week, prompting business executives like JP Morgan CEO Jamie Dimon to speak out against Trump’s trade agenda. This comes just a few months after Dimon previously said to “get o…",
    "link": "https://www.marketplace.org/episode/2025/04/07/is-the-tide-turning-against-trumps-tariffs",
    "timestamp": "2025-04-07T18:58:06Z"
  },
  {
    "title": "Ohtani, Betts and World Series champion Dodgers visit Trump at the White House",
    "description": "President Donald Trump welcomed Shohei Ohtani, Mookie Betts and the reigning champion Los Angeles Dodgers to the White House on Monday to congratulate them for winning the World Series last season. Trump complimented “the very talented people” who beat the Ne…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_343b6641-fd87-4599-8226-f83a92d6e3c5",
    "timestamp": "2025-04-07T18:57:52Z"
  },
  {
    "title": "Trump Threatens to Block Congress From Taking Control of Tariffs",
    "description": "President Donald Trump threatened to veto proposed bipartisan legislation that would seek to limit his tariff authority.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-veto-tariffs-bill-congress-1235311966/",
    "timestamp": "2025-04-07T18:56:12Z"
  },
  {
    "title": "US Stock Market Is Plummeting Amid Tariff Mania. Should You 'Buy the Dip' or Stay the Course?",
    "description": "New tariff policies have prompted a huge sell-off in the US stock markets and caused uncertainty for investors.",
    "link": "https://www.cnet.com/personal-finance/investing/us-stock-market-is-plummeting-amid-tariff-mania-should-you-buy-the-dip-or-stay-the-course/",
    "timestamp": "2025-04-07T18:56:00Z"
  },
  {
    "title": "J.P. Morgan Chase CEO Has Grim Warning About Trump’s Tariffs",
    "description": "“America First is fine, as long as it doesn’t end up being America alone,” Jamie Dimon told shareholders.",
    "link": "https://www.huffpost.com/entry/jpmorgan-chase-jamie-dimon-trump-tariffs_n_67f3fdb0e4b0596ecd2e3e76",
    "timestamp": "2025-04-07T18:54:10Z"
  },
  {
    "title": "Stagflation is America's most 'optimistic scenario' at this point, former Fed president says",
    "description": "The US economy could be stuck in a tug-of-war that offers no good solutions for the Fed, as low growth and rising prices result in an era of stagflation.",
    "link": "https://www.businessinsider.com/stagflation-outlook-economy-recession-interest-rates-trump-tariffs-trade-war-2025-4",
    "timestamp": "2025-04-07T18:53:04Z"
  },
  {
    "title": "Mia Love, first Black Republican woman in Congress, honored after her death from brain cancer",
    "description": "Family and friends of former U.S. Rep. Mia Love gathered in Salt Lake City to honor her life and legacy after she died of brain cancer in March at age 49.",
    "link": "https://www.pbs.org/newshour/politics/mia-love-first-black-republican-woman-in-congress-honored-after-her-death-from-brain-cancer",
    "timestamp": "2025-04-07T18:52:51Z"
  },
  {
    "title": "Reuters Retracts Bogus Report That Trump Was Considering Tariffs Pause",
    "description": "CNBC was also fooled by a viral X post that mischaracterized what a White House advisor told Fox News\nThe post Reuters Retracts Bogus Report That Trump Was Considering Tariffs Pause appeared first on TheWrap.",
    "link": "https://www.thewrap.com/reuters-retracts-report-trump-tariff-90-day-pause/",
    "timestamp": "2025-04-07T18:52:41Z"
  },
  {
    "title": "Trump threatens further 50% tariffs on China",
    "description": "US President Donald Trump threatens steep additional tariffs on Chinese imports if Beijing does not drop its retaliation plans, adding that Washington is open to negotiations with other countries. “If China does not withdraw its 34 percent increase on top of …",
    "link": "https://punchng.com/trump-threatens-further-50-tariffs-on-china/",
    "timestamp": "2025-04-07T18:51:48Z"
  },
  {
    "title": "Economists reveal major Math blunder in Donald Trump's tariff formula that inflates impact by 400%, could spark global trade chaos",
    "description": "Economists found a major error in the tariff formula used by the Trump administration. The formula overestimates the impact of tariffs by a factor of four. This mistake led to significantly higher tariff rates than intended. Experts question the accuracy and …",
    "link": "https://economictimes.indiatimes.com/news/international/us/economists-reveal-major-math-blunder-in-donald-trumps-tariff-formula-that-inflates-impact-by-400-could-spark-global-trade-chaos/articleshow/120073134.cms",
    "timestamp": "2025-04-07T18:51:27Z"
  },
  {
    "title": "Amber Ruffin, cut from White House correspondents dinner, will host PEN America gala",
    "description": "Comic Amber Ruffin has a new spring gig",
    "link": "https://abcnews.go.com/Entertainment/wireStory/amber-ruffin-cut-white-house-correspondents-dinner-host-120569790",
    "timestamp": "2025-04-07T18:50:46Z"
  },
  {
    "title": "Schumer warns Trump’s tariffs will destroy NYC’s economy, drive recession: ‘What you’re doing is ugly’",
    "description": "Senate Minority Leader Chuck Schumer on Monday warned President Trump’s tariffs will destroy New York City’s economy and likely plunge it right into a recession — as he urged the commander in chief to “back off.” The New York Democrat claimed Trump’s “pinball…",
    "link": "https://freerepublic.com/focus/f-news/4309483/posts",
    "timestamp": "2025-04-07T18:48:24Z"
  },
  {
    "title": "Campus activists push for anti-Trump 'mutual defense compact' of major universities",
    "description": "Big Ten universities, led by Rutgers, could form a \"Mutual Defense Compact' to oppose President Donald Trump's executive order, if campus activists have their way.",
    "link": "https://www.foxnews.com/politics/campus-activists-push-anti-trump-mutual-defense-compact-major-universities",
    "timestamp": "2025-04-07T18:47:23Z"
  },
  {
    "title": "German car giant to suspend deliveries to US",
    "description": "Audi has reportedly instructed dealers to hold back all vehicles that arrived in the US after April 2 to avoid tariffs Read Full Article at RT.com",
    "link": "https://www.rt.com/business/615354-germany-audi-supply-suspension-us/",
    "timestamp": "2025-04-07T18:47:11Z"
  },
  {
    "title": "Why America will be the biggest loser in Trump's tariff war",
    "description": "It may be the world's largest economy, the global military superpower. But America is beset with problems.",
    "link": "https://www.abc.net.au/news/2025-04-08/why-america-will-be-the-biggest-loser-in-trump-s-tariff-war/105148340",
    "timestamp": "2025-04-07T18:47:05Z"
  },
  {
    "title": "In nod to Trump, Netanyahu pledges to eliminate Israel's trade surplus with US",
    "description": "WASHINGTON: Israeli Prime Minister Benjamin Netanyahu promised on Monday (Apr 7) to eliminate Israel's trade surplus with the United States, a move likely to be closely watched by world leaders as President Donald Trump's tariff policy",
    "link": "https://www.channelnewsasia.com/world/nod-trump-netanyahu-pledges-eliminate-israels-trade-surplus-us-5049601",
    "timestamp": "2025-04-07T18:47:00Z"
  },
  {
    "title": "Netanyahu to seek tariff relief in talks with Trump",
    "description": "WASHINGTON: Israeli Prime Minister Benjamin Netanyahu will seek to limit the sting of tariffs imposed on his country at a meeting with US President Donald Trump on Monday (Apr 7), a visit likely to be closely watched by world leaders as",
    "link": "https://www.channelnewsasia.com/world/netanyahu-seek-tariff-relief-talks-trump-5049601",
    "timestamp": "2025-04-07T18:47:00Z"
  },
  {
    "title": "'China's GDP faces risk of falling by 2-2.5 percentage points'",
    "description": "A top Chinese economist warned that Trump's 34% tariffs on Chinese exports could significantly impact China's GDP, potentially lowering it by 2-2.5 percentage points. This will add to existing economic challenges of the nation, including stagnating domestic c…",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-gdp-faces-risk-of-falling-by-2-2-5-percentage-points/articleshow/120073845.cms",
    "timestamp": "2025-04-07T18:46:24Z"
  },
  {
    "title": "Carney lays out plan to help economy along amid Trump-induced market chaos",
    "description": "Liberal Leader Mark Carney said Monday he has a plan to prop up the Canadian economy as the U.S. careens toward a recession resulting from President Donald Trump's aggressive tariff actions.",
    "link": "https://www.cbc.ca/news/politics/carney-plan-economy-1.7503904",
    "timestamp": "2025-04-07T18:45:49Z"
  },
  {
    "title": "Trump is exploiting discord among U.S.’s biggest trading partners. A united tariff counterwar might get him to back off",
    "description": "Cracks are forming in Trumpland.\nTexas Republican Ted Cruz warned that the GOP risked a “bloodbath” in the 2026 midterm elections if Donald Trump’s “Liberation Day” tariffs push the economy into recession, a scenario that looks increasingly likely as trillion…",
    "link": "https://biztoc.com/x/fafefa3b6a196f43",
    "timestamp": "2025-04-07T18:45:16Z"
  },
  {
    "title": "White House Calls Report Of Trump 90-Day Tariff Pause ‘Fake News’",
    "description": "Topline\nA misquoted claim that President Donald Trump is considering a 90-day pause on his far-reaching reciprocal tariffs is “fake news,” the White House said Monday, as Trump champions his levies while U.S. markets face historic selloffs.\nKey Facts\nThe Whit…",
    "link": "https://biztoc.com/x/8fda1179340ba1e9",
    "timestamp": "2025-04-07T18:45:11Z"
  },
  {
    "title": "Former clerk for judge who tossed Trump's classified docs case now in senior DOJ position (ABC News)",
    "description": "ABC News:\nFormer clerk for judge who tossed Trump's classified docs case now in senior DOJ position  —  A former law clerk to Judge Aileen Cannon is now with the Justice Department.  —  President Donald Trump crosses the South Lawn after exiting Marine One at…",
    "link": "https://www.memeorandum.com/250407/p94",
    "timestamp": "2025-04-07T18:45:00Z"
  },
  {
    "title": "Wall Street could be headed for a bear market. Here's what that means",
    "description": "From why it's called a bear market to how long it lasts, here are some commonly asked questions and answers.",
    "link": "https://abc13.com/post/wall-street-could-headed-bear-market-heres-what-means/16140332/",
    "timestamp": "2025-04-07T18:45:00Z"
  },
  {
    "title": "Netanyahu meets Trump for tariff and Gaza talks",
    "description": "<p>WASHINGTON - Israeli Prime Minister Benjamin Netanyahu met Donald Trump at the White House on Monday, becoming the first foreign leader to personally plead for a reprieve from stinging US tariffs that have shaken the world.</p>",
    "link": "https://www.bangkokpost.com/world/2997697/netanyahu-meets-trump-for-tariff-and-gaza-talks",
    "timestamp": "2025-04-07T18:45:00Z"
  },
  {
    "title": "Yesterday, China issued Retaliatory Tariffs of 34%, on top of their already record setting Tariffs, Non-Monetary Tariffs, Illegal Subsidization of companies, and massive long term Currency Manipulation, despite my warning that any country that...",
    "description": "Yesterday, China issued Retaliatory Tariffs of 34%, on top of their already record setting Tariffs, Non-Monetary Tariffs, Illegal Subsidization of companies, and massive long term Currency Manipulation, despite my warning that any country that Retaliates agai…",
    "link": "https://freerepublic.com/focus/f-news/4309480/posts",
    "timestamp": "2025-04-07T18:43:18Z"
  },
  {
    "title": "Jair Bolsonaro's Message to Donald Trump: Thank God You Were Reelected",
    "description": "Conservative former President of Brazil Jair Bolsonaro thanked God for the election of President Donald Trump in a rally speech on Sunday.\nThe post Jair Bolsonaro’s Message to Donald Trump: Thank God You Were Reelected appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/04/07/jair-bolsonaros-message-trump-thank-god-you-were-reelected/",
    "timestamp": "2025-04-07T18:42:57Z"
  },
  {
    "title": "Trump, interrupted: Cory Booker’s 25-hour Senate speech calls for collective action",
    "description": "Last week’s record-breaking marathon speech by United States Sen. Cory Booker is important not just for what was said, but also for the way it was delivered.",
    "link": "https://theconversation.com/trump-interrupted-cory-bookers-25-hour-senate-speech-calls-for-collective-action-253819",
    "timestamp": "2025-04-07T18:42:50Z"
  },
  {
    "title": "Russia poses 'questions' on Ukraine truce plan",
    "description": "The Kremlin expressed support for a Ukraine truce but raised concerns about its implementation, countering US and European claims of stalling. Despite Trump's frustration with the ongoing conflict and bombings, Putin has insisted that key questions remain una…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-poses-questions-on-ukraine-truce-plan/articleshow/120073795.cms",
    "timestamp": "2025-04-07T18:42:24Z"
  },
  {
    "title": "Tariffs to drive more aggressive interest rate cuts in Australia",
    "description": "The new US tariffs have wreaked havoc on global markets but there could be a silver lining for Australian homeowners, with the big four banks changing their bets on when the RBA could deliver the next rate cut.",
    "link": "https://www.abc.net.au/news/2025-04-08/what-do-tariffs-and-the-market-turmoil-mean-for-interest-rates-/105147592",
    "timestamp": "2025-04-07T18:42:08Z"
  },
  {
    "title": "Beer exec wants Canadians to understand what ‘Brewed in Canada’ means amid U.S. brand confusions",
    "description": "The head of Molson Coors Beverage Company is hoping consumers understand what it means for a drink to be \"brewed in Canada\". Find out more",
    "link": "https://financialpost.com/news/retail-marketing/beer-exec-wants-canadians-understand-what-brewed-in-canada-means",
    "timestamp": "2025-04-07T18:42:00Z"
  },
  {
    "title": "Kiev should give up territory – Ukrainian-born US lawmaker",
    "description": "Kiev should drop its territorial claims and engage in talks with Russia, a Ukrainian-born US congresswoman, Victoria Spartz, has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615362-kiev-give-up-territory-spartz/",
    "timestamp": "2025-04-07T18:41:50Z"
  },
  {
    "title": "Crypto Trader Facing $340,000,000 Liquidation Makes Emergency Stablecoin Deposit As Ethereum Crashes: Lookonchain",
    "description": "A crypto whale with a $340 million position in Ethereum is making quick moves to prevent a liquidation as ETH plummets in value. According to on-chain data tracker Lookonchain, a deep-pocketed whale with a 220,000 ETH long position on the decentralized financ…",
    "link": "https://dailyhodl.com/2025/04/07/crypto-trader-facing-340000000-liquidation-makes-emergency-stablecoin-deposit-as-ethereum-crashes-lookonchain/",
    "timestamp": "2025-04-07T18:41:47Z"
  },
  {
    "title": "Trump tariffs are all about Taiwan",
    "description": "Tariffs are an attempt by Donald Trump to reorder the global economy away from Chinese manufacturing. Taiwan is at the heart of the current system.",
    "link": "https://www.businessinsider.com/trump-tariffs-taiwan-china-invasion-explained-2025-4",
    "timestamp": "2025-04-07T18:39:19Z"
  },
  {
    "title": "‘I F*cking LOVE That!’ Bill Maher Gushes About Trump ‘Moments’ That ‘No Other Politician Can Do’",
    "description": "Bill Maher told NewsNation host Chris Cuomo that while there's plenty about President Donald Trump that he \"hates,\" there are moments that he \"fucking loves!\"\nThe post ‘I F*cking LOVE That!’ Bill Maher Gushes About Trump ‘Moments’ That ‘No Other Politician Ca…",
    "link": "https://www.mediaite.com/news/i-fking-love-that-bill-maher-gushes-about-trump-moments-that-no-other-politician-can-do/",
    "timestamp": "2025-04-07T18:38:42Z"
  },
  {
    "title": "EU chief offers US 'zero-for-zero' pact",
    "description": "The European Union will impose retaliatory duties on select US imports starting next week, responding to tariffs imposed by the Trump administration on steel and aluminum. While EU trade ministers prioritize negotiations to remove the tariffs, they are prepar…",
    "link": "https://economictimes.indiatimes.com/news/international/business/eu-chief-offers-us-zero-for-zero-pact/articleshow/120073634.cms",
    "timestamp": "2025-04-07T18:38:21Z"
  },
  {
    "title": "What's on TV: 'Hacks,' 'Doctor Who' and a final season for 'The Handmaid's Tale'",
    "description": "The sixth and final season of The Handmaid's Tale, which debuts Tuesday, explores questions of trauma and revenge. Also this week: Hacks returns and Jon Hamm stars in a layered whodunit.",
    "link": "https://www.npr.org/2025/04/07/nx-s1-5354915/the-handmaids-tale-hacks-doctor-who-your-friends-and-neighbors",
    "timestamp": "2025-04-07T18:37:44Z"
  },
  {
    "title": "Trump threatens new 50% tariffs on China",
    "description": "Donald Trump has threatened China with an extra tariff of 50% on goods imported into the US if it does not withdraw a countermeasure it announced on Friday.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/Trump-threatens-new-50-tariffs-on-China-1978888",
    "timestamp": "2025-04-07T18:36:53Z"
  },
  {
    "title": "Canada initiates WTO dispute over US imposing 25% duties on cars",
    "description": "Canada has initiated a complaint with the World Trade Organization over President Donald Trump imposing 25% duties on car imports from the neighboring country.\nThe global trade body said that Canada requested consultations on Thursday as the first step in lau…",
    "link": "https://biztoc.com/x/43ad3ad93aa87743",
    "timestamp": "2025-04-07T18:34:18Z"
  },
  {
    "title": "China's Ready for a Trade War. The U.S. Isn't. Here's Why | Opinion",
    "description": "President Donald Trump has announced tariffs reaching up to 54 percent on Chinese imports, continuing his trade war with China from his first time in office. But this time, the stakes are different, and Beijing's response has caught Washington off guard.\nInst…",
    "link": "https://biztoc.com/x/83de92c71acc1a51",
    "timestamp": "2025-04-07T18:34:06Z"
  },
  {
    "title": "Trump doubles down, vows to make Chinese imports even more expensive for Americans",
    "description": "Trump doubles down, vows to make Chinese imports even more expensive for Americans\nWorld War Fee: President to up tariffs on Middle Kingdom goods to 104% from 54%\nPresident Donald Trump has threatened to increase tariffs on Chinese goods by a further 50 perce…",
    "link": "https://biztoc.com/x/a26829604eecf3ed",
    "timestamp": "2025-04-07T18:33:46Z"
  },
  {
    "title": "Why Health Care Select Sector SPDR Fund (XLV) Is Moving",
    "description": "Shares of the Health Care Select Sector SPDR Fund (NASDAQ:XLV) are trading lower by 8.6% to $132.86 over the past week as tariff announcements from President Donald Trump last week spooked investors and dragged major sectors of the market lower. \nWhile health…",
    "link": "https://biztoc.com/x/5cf44ed265962e61",
    "timestamp": "2025-04-07T18:33:40Z"
  },
  {
    "title": "Schumer warns Trump’s tariffs will destroy NYC’s economy, drive recession: ‘What you’re doing is ugly’",
    "description": "The Democratic senator ripped Trump's levy war as a \"pinball tariff strategy\" that could result in a nearly $20 billion direct hit to New York City and threaten hundreds of thousands of jobs.",
    "link": "https://nypost.com/2025/04/07/us-news/schumer-warns-trumps-tariffs-will-destroy-nycs-economy-drive-recession/",
    "timestamp": "2025-04-07T18:32:12Z"
  },
  {
    "title": "The Commission’s plan for countermeasures to Trump’s tariffs – 25% on certain products, bourbon off the list",
    "description": "Reuters reveals a European Commission document proposing a European response to the trade war launched by the US president\nThe post The Commission’s plan for countermeasures to Trump’s tariffs – 25% on certain products, bourbon off the list appeared first on …",
    "link": "https://en.protothema.gr/2025/04/07/the-commissions-plan-for-countermeasures-to-trumps-tariffs-25-on-certain-products-bourbon-off-the-list/",
    "timestamp": "2025-04-07T18:32:09Z"
  },
  {
    "title": "Apple's Stock Had a Wild Morning",
    "description": "It was a volatile morning for Apple's stock, which quickly had a $17 swing during intraday trading.\n\n\n\n\n\nApple shares opened at $177.24 today, as the company's stock price has continued to drop since U.S. President Donald Trump last week announced steep new t…",
    "link": "https://www.macrumors.com/2025/04/07/apple-stock-wild-morning/",
    "timestamp": "2025-04-07T18:29:29Z"
  },
  {
    "title": "Ukrainian-born US lawmaker says Ukraine should cede land to Russia, demand Zelensky's resignation",
    "description": "Ukrainian-born U.S. lawmaker Victoria Spartz has said Ukraine should cede land to Russia, and its people should demand the resignation of President Volodymyr Zelensky. In an interview with the Telegraph published on April 7, Spartz said Ukraine is not in a po…",
    "link": "https://freerepublic.com/focus/f-news/4309476/posts",
    "timestamp": "2025-04-07T18:29:23Z"
  },
  {
    "title": "'The View' co-host asks Sen. Cory Booker if he should replace Schumer as Democratic leader",
    "description": "\"The View\" co-host Sunny Hostin asked Sen. Cory Booker on Monday if he should be the next Democratic leader as Sen. Chuck Schumer has faced calls to step down.",
    "link": "https://www.foxnews.com/media/the-view-co-host-asks-sen-cory-booker-he-should-replace-schumer-democratic-leader",
    "timestamp": "2025-04-07T18:29:20Z"
  },
  {
    "title": "Kremlin cheers as reciprocal tariffs tank global markets: Russia will rise as a superpower, and Donald Trump’s just the person to make it happen",
    "description": "Trump tariffs 2025 have sent shockwaves through the global economy, but Russia isn’t worried — in fact, it's watching with quiet satisfaction. While most nations scramble to respond to Donald Trump’s sweeping import taxes, Russia sees a golden opportunity to …",
    "link": "https://economictimes.indiatimes.com/news/international/us/kremlin-cheers-as-reciprocal-tariffs-tank-global-markets-russia-will-rise-as-a-superpower-and-donald-trumps-just-the-person-to-make-it-happen/articleshow/120072422.cms",
    "timestamp": "2025-04-07T18:28:42Z"
  },
  {
    "title": "China's Ready for a Trade War. The U.S. Isn't. Here's Why | Opinion",
    "description": "This time, the stakes are different, and Beijing's response has caught Washington off guard.",
    "link": "https://www.newsweek.com/chinas-ready-trade-war-us-isnt-heres-why-opinion-2056479",
    "timestamp": "2025-04-07T18:27:27Z"
  }
]