[
  {
    "title": "No Deal With Iran! An Apocalyptic “Regime Change War” Appears To Be Imminent",
    "description": "It appears that an apocalyptic war is about to begin in the Middle East, and yet most people living in the Western world don’t seem alarmed by this at all.  But they should be, because once the missiles start flying, the death and destruction that we will wit…",
    "link": "https://www.shtfplan.com/headline-news/no-deal-with-iran-an-apocalyptic-regime-change-war-appears-to-be-imminent",
    "timestamp": "2026-01-31T18:00:17Z"
  },
  {
    "title": "Donald Trump, 79, Confuses Reporters by Mistakenly Declaring Sitting Senator 'No Longer' in Office in Rambling Fed Fight",
    "description": "Donald Trump incorrectly said that Thom Tillis was 'no longer a senator' after Tillis opposed one of Trump's nominees.",
    "link": "https://radaronline.com/p/donald-trump-mistakenly-declaring-sitting-senator-no-longer-in-office/",
    "timestamp": "2026-01-31T18:00:00Z"
  },
  {
    "title": "Putin envoy hails ‘constructive’ talks with US delegation",
    "description": "Russia’s chief Ukraine negotiator has flown to Florida for a last-minute meeting with US officials ahead of peace talks in Abu Dhabi Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/631802-dmitriev-miami-ukraine-talks/",
    "timestamp": "2026-01-31T17:55:11Z"
  },
  {
    "title": "Melania box office results revealed as divisive documentary defies predictions",
    "description": "Brett Ratner’s film about the first lady performed better than expected on its opening day",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/melania-movie-box-office-results-b2911500.html",
    "timestamp": "2026-01-31T17:51:56Z"
  },
  {
    "title": "Judge Won’t Evict ICE From Minnesota",
    "description": "The decision is a major blow to state and city officials, who say the Trump administration’s surge of immigration agents has terrorized residents.",
    "link": "https://www.huffpost.com/entry/ice-agents-to-stay-minnesota-judge_n_697b96e4e4b0b14e6786b8f9",
    "timestamp": "2026-01-31T17:47:59Z"
  },
  {
    "title": "Nationwide anger forces Trump to back down",
    "description": "The strong nationwide reaction to the assault on communities and the murder of Renee Good and Alex Pretti by the ICE goons has clearly put the Trump gang on the negative. After starting with their usual lies that the two victims were domestic terrorists who w…",
    "link": "https://freethoughtblogs.com/singham/2026/01/31/nationwide-anger-forces-trump-to-back-down/",
    "timestamp": "2026-01-31T17:46:38Z"
  },
  {
    "title": "US military warns Iran it will not tolerate any 'unsafe' actions ahead of live-fire drills in Strait of Hormuz",
    "description": "U.S. Central Command warned Iran it will not tolerate \"Any unsafe and unprofessional behavior\" near American forces ahead of live-fire naval drills.",
    "link": "https://www.foxnews.com/us/us-military-warns-iran-not-tolerate-any-unsafe-actions-ahead-live-fire-drills-strait-hormuz",
    "timestamp": "2026-01-31T17:45:56Z"
  },
  {
    "title": "You Will Laugh Out Loud When You Hear What the Tech Industry Is Spending a Swimming Pool’s Worth of Money to Convince the Public",
    "description": "Who's buying this?\nThe post You Will Laugh Out Loud When You Hear What the Tech Industry Is Spending a Swimming Pool’s Worth of Money to Convince the Public appeared first on Futurism.",
    "link": "http://futurism.com/artificial-intelligence/ai-tech-industry-ads-data-center",
    "timestamp": "2026-01-31T17:45:00Z"
  },
  {
    "title": "US federal judge declines to halt Donald Trump’s Minnesota ICE surge",
    "description": "According to the Trump administration, the operation was aimed at enforcing federal immigration laws.",
    "link": "https://indianexpress.com/article/world/us-news/us-federal-judge-declines-to-halt-donald-trumps-minnesota-ice-surge-10506040/",
    "timestamp": "2026-01-31T17:44:37Z"
  },
  {
    "title": "Dem Candidate Promises to Kill Trump [semi-satire]",
    "description": "State Rep. Elliot Forhan (D-Cleveland) and candidate for Ohio Attorney General, promised that \"if I'm elected I will prosecute, convict, and execute Donald Trump for his crimes against humanity.\" This promise contradicts his earlier expressed opposition to im…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364871/posts",
    "timestamp": "2026-01-31T17:42:27Z"
  },
  {
    "title": "(VIDEO) “This is Straight BS What He’s Going Through” – Stephen A. Smith Gives Pathetic Defense of Don Lemon, Cries About the First Amendment",
    "description": "Liberal ESPN host Stephen A.\nThe post (VIDEO) “This is Straight BS What He’s Going Through” – Stephen A. Smith Gives Pathetic Defense of Don Lemon, Cries About the First Amendment appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/01/video-this-is-straight-bs-what-hes-going/",
    "timestamp": "2026-01-31T17:40:21Z"
  },
  {
    "title": "Senate approves funding package following White House-Schumer deal",
    "description": "Separate stopgap measure temporarily funds Department of Homeland Security",
    "link": "https://www.wnd.com/2026/01/senate-approves-funding-package-following-white-house-schumer/",
    "timestamp": "2026-01-31T17:37:24Z"
  },
  {
    "title": "Justice Department releases largest batch of Epstein documents, totaling 3 million pages",
    "description": "The Justice Department on Friday released many more records from its investigative files on Jeffrey Epstein, resuming disclosures under the Epstein Files Transparency Act.",
    "link": "https://www.pbs.org/newshour/nation/justice-department-releases-largest-batch-of-epstein-documents-totaling-3-million-pages",
    "timestamp": "2026-01-31T17:30:50Z"
  },
  {
    "title": "The latest Epstein files release includes famous names and new details about an earlier investigation",
    "description": "The documents released Friday include Epstein's communications with former White House advisers, an NFL team co-owner and billionaires including Bill Gates and Elon Musk.",
    "link": "https://www.pbs.org/newshour/nation/the-latest-epstein-files-release-includes-famous-names-and-new-details-about-an-earlier-investigation",
    "timestamp": "2026-01-31T17:30:50Z"
  },
  {
    "title": "Musk, Gates, Trump All Appear in Latest Epstein Files Dump",
    "description": "Elon Musk's past efforts to distance himself from Jeffrey Epstein are taking a hit from newly released government documents. A fresh batch of DOJ files tied to the Epstein investigation includes a series of emails showing Musk not only in regular contact with…",
    "link": "https://www.newser.com/story/382900/musk-gates-trump-all-appear-in-latest-epstein-files-dump.html",
    "timestamp": "2026-01-31T17:30:00Z"
  },
  {
    "title": "Explosion in Iran’s Bandar Abbas caused by gas leak, official says",
    "description": "Local fire official says gas leak likely caused blast that ripped through residential building in Iranian port city.",
    "link": "https://www.aljazeera.com/news/2026/1/31/explosion-in-irans-bandar-abbas-caused-by-gas-leak-official-says",
    "timestamp": "2026-01-31T17:26:52Z"
  },
  {
    "title": "Venezuela’s ‘Helicoide’ prison synonymous with torture of dissenters",
    "description": "Venezuela’s “El Helicoide” was built back in the days of seemingly endless oil wealth and meant to be a flashy, space-age-looking shopping center. But this structure shaped like a three-sided pyramid with a domed top never opened and instead became a prison s…",
    "link": "https://www.digitaljournal.com/world/venezuelas-helicoide-prison-synonymous-with-torture-of-dissenters/article",
    "timestamp": "2026-01-31T17:12:20Z"
  },
  {
    "title": "Week 54",
    "description": "It’s hard to believe that it’s only a week since CBP killed Alex Pretti. Around Wednesday, I became confused whether it had been last Saturday or a week earlier. Donald Trump is throwing a lot of stuff against the wall. Trump withdrew Nazi cosplayer Greg Bovi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/week-54",
    "timestamp": "2026-01-31T17:11:38Z"
  },
  {
    "title": "New Alligator Alcatraz Court Filings Allege Trump Admin Withheld Evidence",
    "description": "The filings undermine DHS claims the facility was solely a state project, potentially reviving a court-ordered shutdown.",
    "link": "https://prismreports.org/2026/01/27/alligator-alcatraz-federal-funding-miccosukee/",
    "timestamp": "2026-01-31T17:11:19Z"
  },
  {
    "title": "Epstein dump puts US elites on edge as sordid saga makes wild claims about Gates, Trump",
    "description": "US News: TOI correspondent from Washington: In a long-anticipated disclosure that has reignited scrutiny of the late paedophile-financier Jeffrey Epstein and h.",
    "link": "https://timesofindia.indiatimes.com/world/us/epstein-dump-puts-us-elites-on-edge-as-sordid-saga-makes-wild-claims-about-gates-trump/articleshow/127824120.cms",
    "timestamp": "2026-01-31T17:11:09Z"
  },
  {
    "title": "Trump’s Relationship With the Media",
    "description": "Panelists joined to discuss the arrest of former CNN anchor Don Lemon, and more.",
    "link": "https://www.theatlantic.com/national/2026/01/don-lemon-arrest-washington-week/685847/",
    "timestamp": "2026-01-31T17:10:27Z"
  },
  {
    "title": "Protesters in Copenhagen rally for Danish veterans after Trump remarks",
    "description": "By Soren Jeppesen and Tom LittleCOPENHAGEN, Jan 31 (Reuters) - Hundreds of Danes gathered outside the U.S. Embassy in Copenhagen on Saturday in support of veterans who s… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/31/protesters-in-copenhagen-rally-for-danish-veterans-after-trump-remarks",
    "timestamp": "2026-01-31T17:09:32Z"
  },
  {
    "title": "WWE Royal Rumble Preview: Special Early Start Time, Don't Miss It",
    "description": "Auughh man! So unfair!  The Chadster can barely contain his excitement as he sits here in his abandoned Blockbuster headquarters, surrounded by his loyal raccoon family, preparing for what will undoubtedly be the greatest wrestling event in human histor…",
    "link": "https://bleedingcool.com/tv/wwe-royal-rumble-preview-special-early-start-time-dont-miss-it/",
    "timestamp": "2026-01-31T17:07:07Z"
  },
  {
    "title": "Trump Claims Critics Are Attacking Kristi Noem 'Because She's A Woman' In Friday Night Rant",
    "description": "The president defended the Homeland Security secretary and offered a curious theory about why she's been getting so much backlash.",
    "link": "https://www.huffpost.com/entry/trump-kristi-noem-misogyny_n_697ce179e4b0ead3cf96aa5f",
    "timestamp": "2026-01-31T17:06:42Z"
  },
  {
    "title": "Chamath Palihapitiya: I Was \"Red-Pilled\" When Media Lied About Charlottesville",
    "description": "Venture capitalist Chamath Palihapitiya told the \"Katie Miller Podcast\" that his journey from Democratic Party mega-donor to Trump-supporting podcaster began after the \"fine people hoax\" where mainstream media cast President Trump's response to the 2017 Charl…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364860/posts",
    "timestamp": "2026-01-31T17:06:12Z"
  },
  {
    "title": "This superb film deserves its awards but in Trump's America it must be a cautionary tale",
    "description": "After sweeping the Golden Globes and other awards, Paul Thomas Anderson's film One Battle After Another has 13 Oscar nominations. Given the film’s clear relevance, if it does end up a winner, those who created it will probably do more than thank their agents,…",
    "link": "https://www.rawstory.com/raw-investigates/2675061417/",
    "timestamp": "2026-01-31T17:03:25Z"
  },
  {
    "title": "Lady Gaga faces backlash after anti-ICE rant during Tokyo concert",
    "description": "Lady Gaga received mixed reactions after pausing her Tokyo concert to condemn ICE operations in Minnesota, sparking a heated social media debate among fans.",
    "link": "https://www.foxnews.com/entertainment/lady-gaga-faces-backlash-after-anti-ice-rant-during-tokyo-concert",
    "timestamp": "2026-01-31T17:02:35Z"
  },
  {
    "title": "'World does not understand how dumb he is'...",
    "description": "Jeffrey Epstein and Larry Summers, a former US Treasury Secretary and president of Harvard University, are shown chatting about President Donald Trump during his first term in office in a number of emails",
    "link": "https://www.themirror.com/news/us-news/epstein-said-world-not-understand-1653558",
    "timestamp": "2026-01-31T17:00:12Z"
  },
  {
    "title": "Running Into the ‘Fire’: How One Man Brings Hope to Persecuted Christians in Nigeria",
    "description": "Alex Barbir arrived to smoke rising from burned homes in the Nigerian village of Zike. More than 50 Christians were killed in an attack on... Read More\nThe post Running Into the ‘Fire’: How One Man Brings Hope to Persecuted Christians in Nigeria appeared firs…",
    "link": "https://www.dailysignal.com/2026/01/31/running-into-the-fire-how-one-man-brings-hope-to-persecuted-christians-in-nigeria/",
    "timestamp": "2026-01-31T17:00:00Z"
  },
  {
    "title": "‘Melania’ Isn’t Even Good Propaganda",
    "description": "Amazon's new Melania Trump documentary directed by Brett Ratner, \"Melania: Twenty Days to History,\" fails on virtually every level.",
    "link": "http://www.rollingstone.com/politics/politics-features/melania-trump-documentary-propaganda-1235508634/",
    "timestamp": "2026-01-31T17:00:00Z"
  },
  {
    "title": "Fighting Back: Utilities Challenge Coal Emergency Order",
    "description": "Two major utilities are protesting a federal order requiring them to operate the Craig Unit 1 coal power plant in Colorado, originally scheduled to retire on December 31 of 2025.\nThe post Fighting Back: Utilities Challenge Coal Emergency Order appeared first …",
    "link": "https://cleantechnica.com/2026/01/31/fighting-back-utilities-challenge-coal-emergency-order/",
    "timestamp": "2026-01-31T16:59:33Z"
  },
  {
    "title": "Health workers stage silent protest over boundary wall dispute at Dhanbad Sadar Hospital",
    "description": "In a gripping display of solidarity, medical personnel at Dhanbad Sadar Hospital held a peaceful protest, raising alarm over plans to tear down a boundary wall for lawyer access. They expressed fears for patient safety and the integrity of emergency services,…",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/health-workers-stage-silent-protest-over-boundary-wall-dispute-at-dhanbad-sadar-hospital/articleshow/127824343.cms",
    "timestamp": "2026-01-31T16:57:42Z"
  },
  {
    "title": "'ICE out!' Tens of thousands take to the streets nationwide to push back on Trump admin",
    "description": "Popular outrage over President Donald Trump’s deadly campaign targeting immigrants and their defenders sparked a National Shutdown day of protests across the United States on Friday, as people from coast to coast took to the streets demanding an end to US Imm…",
    "link": "https://www.rawstory.com/ice-2675065368/",
    "timestamp": "2026-01-31T16:57:15Z"
  },
  {
    "title": "Will support maximum party cadres for civic polls: BJP",
    "description": "In a strategic assembly, key figures from the Jharkhand BJP, including former Chief Ministers and Union ministers, gathered under the leadership of Party President Aditya Sahu. Their discussions were centered on gear up for the forthcoming civic body election…",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/will-support-maximum-party-cadres-for-civic-polls-bjp/articleshow/127824301.cms",
    "timestamp": "2026-01-31T16:54:31Z"
  },
  {
    "title": "Pakur’s minor sisters found in Andhra Pradesh",
    "description": "In a surprising turn of events, two young sisters aged 17 and 13, who went missing from Pakur, Jharkhand since Tuesday, were located at Nellore Railway Station in Andhra Pradesh. The police, after an extensive search, discovered that the girls had set out on …",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/pakurs-minor-sisters-found-in-andhra-pradesh/articleshow/127824257.cms",
    "timestamp": "2026-01-31T16:51:54Z"
  },
  {
    "title": "Senthil Balaji takes a dig at Vijay",
    "description": "COIMBATORE: Taking a dig at actor and TVK leader Vijay, former DMK minister V Senthil Balaji on Saturday said the media should not waste time by askin.",
    "link": "https://timesofindia.indiatimes.com/city/coimbatore/senthil-balaji-takes-a-dig-at-vijay/articleshow/127824252.cms",
    "timestamp": "2026-01-31T16:51:21Z"
  },
  {
    "title": "Ukraine races to bolster air defenses as Putin’s strike pause nears end",
    "description": "Ukraine is racing to reinforce its air defenses as a brief pause in Russian strikes on Kyiv and other cities approaches its expiration, and military and diplomatic experts warn the move may do little to change conditions on the battlefield and could strengthe…",
    "link": "https://freerepublic.com/focus/f-news/4364857/posts",
    "timestamp": "2026-01-31T16:49:31Z"
  },
  {
    "title": "$6 trillion lost in 30 minutes, world stunned",
    "description": "High-flying gold and silver took a staggering hit in overnight trading with the precious metals losing roughly $6 trillion in just 30 minutes — as oil prices surge over fears over Iran. Gold tumbled back after hitting a new record at $5,595.47 an ounce as inv…",
    "link": "https://freerepublic.com/focus/f-news/4364856/posts",
    "timestamp": "2026-01-31T16:44:12Z"
  },
  {
    "title": "Nolte: Rotten Tomatoes -- Audiences Rave for 'Melania' with 98% Rating While Bitter Critics Try to Destroy It",
    "description": "Audiences are raving for \"Melania\" giving it a 98% \"fresh\" rating on Rotten Tomatoes. Meanwhile, CinemaScore has given \"Melania\" an A rating.",
    "link": "https://www.breitbart.com/entertainment/2026/01/31/nolte-rotten-tomatoes-audiences-rave-for-melania-with-98-rating-while-bitter-critics-try-to-destroy-it/",
    "timestamp": "2026-01-31T16:44:03Z"
  },
  {
    "title": "Versova police registered FIR against BMC contractor for RMC plant in protected mangroves forest",
    "description": "Mumbai: Versova police registered an FIR against a BMC-appointed contractor under the Environment Protection Act for putting up a Ready Mix Concrete (.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/versova-police-registered-fir-against-bmc-contractor-for-rmc-plant-in-protected-mangroves-forest/articleshow/127824117.cms",
    "timestamp": "2026-01-31T16:42:00Z"
  },
  {
    "title": "Box Office: ‘Iron Lung’ Sinks the Competition With $8.9 Million; ‘Send Help’ Survives in Second Place",
    "description": "A flurry of newcomers from familiar faces (Sam Raimi and Jason Statham) and unexpected places (Melania Trump and Mark “Markiplier” Fischbach) hit the box office on Friday, but Fischbach’s indie horror “The Iron Lung” came out on top. “Iron Lung” pulled in an …",
    "link": "https://variety.com/2026/film/box-office/box-office-iron-lung-send-help-melania-1236644154/",
    "timestamp": "2026-01-31T16:41:26Z"
  },
  {
    "title": "Goa's citizens want honest, people-centric politics, AAP will work to fulfil their hope: Kejriwal",
    "description": "Aam Aadmi Party convener Arvind Kejriwal asserted Goans desire honest, people-centric politics, pledging his party will fulfill these aspirations. During a Goa visit, Kejriwal met local leaders to bolster the party's base, emphasizing grassroots connections a…",
    "link": "https://timesofindia.indiatimes.com/india/goas-citizens-want-honest-people-centric-politics-aap-will-work-to-fulfil-their-hope-kejriwal/articleshow/127824074.cms",
    "timestamp": "2026-01-31T16:41:14Z"
  },
  {
    "title": "The Affordability Crisis Is Real. Only Worker Organizing Can Offer Solutions.",
    "description": "A nation that can feed its billionaires but not its children has an economic system built to protect cruelty.",
    "link": "https://truthout.org/articles/the-affordability-crisis-is-real-only-worker-organizing-can-offer-solutions/",
    "timestamp": "2026-01-31T16:40:32Z"
  },
  {
    "title": "Zero MoU at Davos, but Karnataka ministerreturns with big investment hopes",
    "description": "Bengaluru: Industries minister MB Patil Saturday said he had bilateral engagements with 46 global and Indian companies, investors and country leaders .",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/zero-mou-at-davos-but-karnataka-ministerreturns-with-big-investment-hopes/articleshow/127824095.cms",
    "timestamp": "2026-01-31T16:40:00Z"
  },
  {
    "title": "Trump bypasses Congress to force arms sale in ‘yet another repudiation’: Top Dem lawmaker",
    "description": "The top Democratic lawmaker on the House Foreign Affairs Committee hammered President Donald Trump Saturday after his administration “bypassed” a “longstanding practice” to force through an arms sale for Israel and Saudi Arabia, The Wall Street Journal report…",
    "link": "https://www.rawstory.com/trump-2675065361/",
    "timestamp": "2026-01-31T16:37:14Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Reveals Stunning Detail About Trump Rape Claim In New Epstein Files Dump",
    "description": "Kaitlan Collins highlighted a stunning and disturbing detail from the newest Epstein Files dump in an FBI form documenting a rape claim about Trump.\nThe post CNN’s Kaitlan Collins Reveals Stunning Detail About Trump Rape Claim In New Epstein Files Dump first …",
    "link": "https://www.mediaite.com/media/news/cnns-kaitlan-collins-reveals-stunning-detail-about-trump-rape-claim-in-new-epstein-files-dump/",
    "timestamp": "2026-01-31T16:36:07Z"
  },
  {
    "title": "Expect Union Budget to give fresh momentum to Delhi's development: CM Rekha Gupta",
    "description": "Delhi chief minister Rekha Gupta anticipates the upcoming Union Budget will significantly boost the city's development, particularly in achieving a 'developed Delhi'. She highlighted ongoing central support for crucial projects like Yamuna cleaning, sewage tr…",
    "link": "https://timesofindia.indiatimes.com/india/expect-union-budget-to-give-fresh-momentum-to-delhis-development-cm-rekha-gupta/articleshow/127824013.cms",
    "timestamp": "2026-01-31T16:35:24Z"
  },
  {
    "title": "Trump’s Endless Corruption: Suing IRS For $10 Billion Edition",
    "description": "Despite the fact that Donald Trump called The New York Times exposé of his tax returns “totally fake news” that was “made up,” President P**sy Grabber now claims he was damaged to the tune of $10 billion by the leak from the IRS, as per NBC News. It seems as …",
    "link": "https://crooksandliars.com/2026/01/trump-s-endless-corruption-suing-irs-10",
    "timestamp": "2026-01-31T16:26:30Z"
  },
  {
    "title": "New Pictures Appear to Show Andrew in Epstein Files",
    "description": "Photos appearing to show Andrew on all fours over female included in new Epstein files.",
    "link": "https://www.bbc.co.uk/sounds/play/p0mybpzh",
    "timestamp": "2026-01-31T16:26:00Z"
  },
  {
    "title": "Letitia James Blasts Trump for Pushing ‘Violence’ and ‘Terror’ with Election Office Raid",
    "description": "NY Attorney General Letitia James accused President Donald Trump of using \"violence\" and \"terror\" as a means to keep Republicans in power after the midterms.\nThe post Letitia James Blasts Trump for Pushing ‘Violence’ and ‘Terror’ with Election Office Raid fir…",
    "link": "https://www.mediaite.com/media/tv/letitia-james-blasts-trump-for-pushing-violence-and-terror-with-election-office-raid/",
    "timestamp": "2026-01-31T16:25:11Z"
  },
  {
    "title": "Trump: Minnesota Fraud Tops $19 Billion",
    "description": "President Donald Trump wrote on Truth Social on Saturday that “the theft and fraud in Minnesota is far greater than the $19 billion originally projected.” The post came as House Oversight Chair Rep. James Comer, R-Ky., said Minnesota Gov. Tim Walz and Attorne…",
    "link": "https://freerepublic.com/focus/f-bloggers/4364854/posts",
    "timestamp": "2026-01-31T16:24:46Z"
  },
  {
    "title": "'Scowling Void of Pure Nothingness': Critics Destroy $75 Million Melania Trump Documentary",
    "description": "Critics have weighed in on Amazon MGM Studios' documentary about first lady Melania Trump, and their verdicts are overwhelmingly negative.According to review aggregation website Metacritic, Melania—which Amazon paid $40 million to acquire and $35 million to m…",
    "link": "https://www.commondreams.org/news/melania-trump-movie-reviews",
    "timestamp": "2026-01-31T16:24:25Z"
  },
  {
    "title": "'Melania' Movie Reviews Are In...And They Are Not Good",
    "description": "The eagerly awaited movie documenting the 20 days leading up to the inauguration of \"Donald Trump 2.0, The Nightmare Returns...Angrier and Crazier Than Before\" are coming in fast and furious, and, as expected. reviewers are not holding back.\nMelania, the movi…",
    "link": "https://crooksandliars.com/2026/01/melania-movie-reviews-are-inand-they-are",
    "timestamp": "2026-01-31T16:21:31Z"
  },
  {
    "title": "What to know about the Strait of Hormuz as Iran-U.S. tensions rise",
    "description": "The Strait of Hormuz, the narrow mouth of the Persian Gulf, again has become a focus of tensions as Iran prepares to launch a military drill that could see fire into a lane crucial for global shipping.",
    "link": "https://www.cbc.ca/news/world/strait-hormuz-iran-us-tension-9.7069586",
    "timestamp": "2026-01-31T16:20:46Z"
  },
  {
    "title": "Campus Radicals: Dems target military school, Chicago teachers wreak havoc, college nurse's viral scandal",
    "description": "Melinda Cook was fired as a nurser from VCU Health while Democrats targeted a Virginia military college over DEI concerns and Chicago teachers continued their anti-ICE campaign.",
    "link": "https://www.foxnews.com/us/campus-radicals-dems-target-military-school-chicago-teachers-wreak-havoc-college-nurses-viral-scandal",
    "timestamp": "2026-01-31T16:17:26Z"
  },
  {
    "title": "Ukraine sees mass power outages from ‘technical malfunction’",
    "description": "Ukraine’s power grid experienced mass outages for several hours on Saturday after a “technical malfunction” caused electrical lines between Moldova, Romania and Ukraine to fail, Ukraine’s energy minister said. Authorities restored power to most critical infra…",
    "link": "https://www.digitaljournal.com/world/ukraine-sees-mass-power-outages-from-technical-malfunction/article",
    "timestamp": "2026-01-31T16:17:20Z"
  },
  {
    "title": "‘Send Help’ Duels ‘Iron Lung’ at Box Office With $18M Opening, ‘Melania’ Beats Projections With $8M Start",
    "description": "Brett Ratner's First Lady profile earns the highest opening weekend for a non-concert film documentary in the past decade\nThe post ‘Send Help’ Duels ‘Iron Lung’ at Box Office With $18M Opening, ‘Melania’ Beats Projections With $8M Start appeared first on TheW…",
    "link": "https://www.thewrap.com/creative-content/movies/send-help-iron-lung-melania-box-office/",
    "timestamp": "2026-01-31T16:12:38Z"
  },
  {
    "title": "Pierre Poilievre sails through leadership review as Conservatives deliver a strong endorsement",
    "description": "Conservative Leader Pierre Poilievre pulled in an overwhelming share of the vote in his leadership review held Friday, a sign that the vast majority of party members are united behind his leadership.",
    "link": "https://www.cbc.ca/news/politics/conservative-poilievre-leadership-review-9.7069573",
    "timestamp": "2026-01-31T16:12:05Z"
  },
  {
    "title": "'Melania' film leaves premiere audience 'inspired' as producer slams media for years of unfair treatment",
    "description": "Melania Trump's new documentary offers unprecedented access to her life before the 2025 inauguration, as producer Mark Beckman says audiences left feeling \"inspired.\"",
    "link": "https://www.foxnews.com/media/melania-film-leaves-premiere-audience-inspired-producer-slams-media-years-unfair-treatment",
    "timestamp": "2026-01-31T16:10:27Z"
  },
  {
    "title": "Politico Finally Gives Up on Attempting Epstein-Trump Connection",
    "description": "\"Trump, like Clinton, has not been implicated of wrongdoing, and the president has said he had a falling out with Epstein years ago.\"And with that brief observation by Politico on Friday by Hailey Fuchs in \"DOJ announces full release of Epstein files,\" all th…",
    "link": "https://freerepublic.com/focus/f-chat/4364850/posts",
    "timestamp": "2026-01-31T16:09:59Z"
  },
  {
    "title": "Atlanta FBI boss reportedly ousted after questioning DoJ’s renewed interest in 2020 election",
    "description": "The special agent in charge of the FBI’s Atlanta field office was reportedly removed from his post after questioning the Trump administration’s renewed interest in investigating the role of Fulton county, Georgia, in the 2020 election. The agent, Paul W Brown…",
    "link": "https://freerepublic.com/focus/f-news/4364849/posts",
    "timestamp": "2026-01-31T16:07:38Z"
  },
  {
    "title": "Hospitals on alert as Egypt readies for opening of Rafah crossing to Gaza's wounded",
    "description": "A key border crossing between the Gaza Strip and Egypt is expected to partially open on Sunday morning, with Egyptian officials readying help for sick and injured Palestinians",
    "link": "https://www.nbcnews.com/world/gaza/hospitals-alert-egypt-readies-opening-rafah-crossing-gazas-wounded-rcna256831",
    "timestamp": "2026-01-31T16:05:54Z"
  },
  {
    "title": "From empty theaters to packed houses, response to Melania Trump documentary reflects America’s political division",
    "description": "Marla Ailor attended President Donald Trump’s inauguration last year with her family, and remembered thinking it was a long day. So she breathed a sigh of relief on Friday as she watched Melania Trump’s documentary and saw that — after a day that included thr…",
    "link": "https://freerepublic.com/focus/f-chat/4364848/posts",
    "timestamp": "2026-01-31T16:00:53Z"
  },
  {
    "title": "Trump Sues IRS For $10 Billion For All Those Taxes He Never Paid",
    "description": "Gosh, wonder whether the IRS will settle?",
    "link": "https://www.wonkette.com/p/trump-sues-irs-for-10-billion-for",
    "timestamp": "2026-01-31T16:00:40Z"
  },
  {
    "title": "\"The real ideological Nazis began coming out of the closet and attacked our shows.\" How pockets of mindless violence inspired the most important 63 seconds of punk you'll ever hear",
    "description": "Even 45 years after its release, this 1981 single remains depressingly relevant today",
    "link": "https://www.loudersound.com/bands-artists/dead-kennedys-nazi-punks-story-behind-the-song",
    "timestamp": "2026-01-31T16:00:00Z"
  },
  {
    "title": "Ford CEO has 5,000 open mechanic jobs with up to 6-figure salaries from the shortage of manually skilled workers: ‘We are in trouble in our country’",
    "description": "“We do not have trade schools. We are not investing in educating a next generation of people,” Jim Farley said.",
    "link": "https://fortune.com/article/ford-ceo-jim-farley-automakers-future-of-work-six-figure-salaries-5000-open-mechanic-jobs-do-people-want-them/",
    "timestamp": "2026-01-31T15:53:56Z"
  },
  {
    "title": "Top Trump lawyer accused of 'glaring conflict' as president pardons criminals",
    "description": "Six senators accused Deputy Attorney General Todd Blanche this week of having a conflict of interest when he shut down investigations into crypto companies, dealers and exchanges and eliminated an enforcement team dedicated to looking for crypto-related fraud…",
    "link": "https://www.rawstory.com/top-trump-lawyer-accused-of-glaring-conflict-as-president-pardons-criminals/",
    "timestamp": "2026-01-31T15:51:55Z"
  },
  {
    "title": "Denmark: Thousands take part in veteran anti-Trump protest",
    "description": "The silent march to the US embassy in Copenhagen came after Donald Trump belittled NATO's role in the Afghanistan war. Tensions remain high between the two NATO allies amid Trump's push to acquire Greenland.",
    "link": "https://www.dw.com/en/denmark-thousands-take-part-in-veteran-anti-trump-protest/a-75742882",
    "timestamp": "2026-01-31T15:50:00Z"
  },
  {
    "title": "Why MAGA won’t rally for “Melania” documentary",
    "description": "Jeff Bezos' big gamble to impress Trump isn't paying off with fans",
    "link": "https://www.salon.com/2026/01/31/why-maga-wont-rally-for-melania-documentary/",
    "timestamp": "2026-01-31T15:45:00Z"
  },
  {
    "title": "트럼프가 지명한 새로운 연준 의장 후보 이해하기",
    "description": "Mojtaba Khamenei has amassed sprawling international investments, while economic hardship at home has sparked Iran's deadliest protests in decades. Read the Big Take: https://t.co/525FrI3p6U️: Rouzbeh Fouladi/ZUMA Wire/Shutterstock pic.twitter.com/AY1Dn2F1r…",
    "link": "https://ryueyes11.tistory.com/512075",
    "timestamp": "2026-01-31T15:44:56Z"
  },
  {
    "title": "King Charles Reacts to Prince Harry’s Public Attacks on Trump",
    "description": "King Charles Reacts to Prince Harry’s Public Attacks on Trumpcafemom.com",
    "link": "https://cafemom.com/entertainment/king-charles-uncomfortable-prince-harry-attacks-trump",
    "timestamp": "2026-01-31T15:44:39Z"
  },
  {
    "title": "Melania Trump Documentary Fiercely Divides Critics & Audiences On Rotten Tomatoes",
    "description": "Critics and audiences are in complete disagreement about Melania Trump's new documentary, leading to a sharp divide on Rotten Tomatoes.",
    "link": "https://screenrant.com/melania-documentary-rotten-tomatoes-critics-audience-scores-comparison/",
    "timestamp": "2026-01-31T15:41:47Z"
  },
  {
    "title": "Kevin Warsh’s Fed nod sends gold plunging and chops 31.4% off silver as dollar strengthens in Friday trading",
    "description": "A fear in financial markets has been that the Fed will lose some of its independence, helping catapult the price of gold and weaken the dollar.",
    "link": "https://fortune.com/2026/01/31/what-happened-gold-silver-dollar-markets-kevin-warsh-fed-reaction/",
    "timestamp": "2026-01-31T15:35:25Z"
  },
  {
    "title": "The same dark figure lurks behind everything Donald Trump does",
    "description": "When I think of America’s so-called president and the way he goes about his job, the same phrase pops into my head: “Nice little country you got there. It’d be a shame if something were to happen to it.”Trump speaks the language of mobsters. He threatens, bul…",
    "link": "https://www.rawstory.com/raw-investigates/this-dark-figure-lurks-behind-everything-donald-trump-does/",
    "timestamp": "2026-01-31T15:33:51Z"
  },
  {
    "title": "Trump Rages At Ilhan Omar In Early Morning Rant Days After Attack — Demands Sending Her To Jail Or ‘Back’ To Africa",
    "description": "Trump attacked Rep. Ilhan Omar (D-MN) in an early morning rant suggesting she be jailed or \"sent back\" to Africa just days after she was attacked onstage.\nThe post Trump Rages At Ilhan Omar In Early Morning Rant Days After Attack — Demands Sending Her To Jail…",
    "link": "https://www.mediaite.com/online/trump-rages-at-ilhan-omar-in-early-morning-rant-days-after-attack-demands-sending-her-to-jail-or-back-to-africa/",
    "timestamp": "2026-01-31T15:33:28Z"
  },
  {
    "title": "Newly released Jeffrey Epstein files show paedophile introduced ‘The Duke’ to Russian woman",
    "description": "Emails between paedophile Jeffrey Epstein and an account named “The Duke” suggest that Epstein wanted to introduce “A” to a 26-year-old Russian woman, whom Epstein suggests he “might enjoy having dinner with”.",
    "link": "https://www.independent.ie/world-news/north-america/newly-released-jeffrey-epstein-files-show-paedophile-introduced-the-duke-to-russian-woman/a1238218618.html",
    "timestamp": "2026-01-31T15:30:00Z"
  },
  {
    "title": "Melania Trump Documentary Set for $8M in Opening Weekend",
    "description": "The documentary on First Lady Melania Trump is on track for a better-than-expected $8 million opening weekend, according to early box office returns. The film titled “Melania” premiered in Washington, D.C. on Thursday and chronicles the days leading up to Pre…",
    "link": "https://www.today.com/video/melania-trump-documentary-set-for-8m-in-opening-weekend-256949829884",
    "timestamp": "2026-01-31T15:27:52Z"
  },
  {
    "title": "Blackouts in Ukraine and Moldova as power lines fail amid sub-zero temperatures",
    "description": "The outages come as people in both countries face severe winter weather, with temperatures in Kyiv forecast to fall to -11C (12F) on Saturday, before plunging as low as -17C (1F) before Wednesday, according to the UK Met Office.",
    "link": "https://news.sky.com/story/blackouts-in-ukraine-and-moldova-as-power-lines-fail-amid-sub-zero-temperatures-13501424",
    "timestamp": "2026-01-31T15:25:00Z"
  },
  {
    "title": "Gold-silver ratio and the biggest daily rise in the last 50 years",
    "description": "On January 30, 2026, the gold-silver ratio surged 23.69% as silver fell far more than gold. We explain the trigger, the mechanics behind the spike, and how past stress episodes in 1979–80, 2006 and 2020 help investors read this ratio as a liquidity and positi…",
    "link": "https://www.thehindubusinessline.com/portfolio/personal-finance/decoding-biggest-daily-rise-gold-silver-ratio-50-years-jan-30-2026/article70574214.ece",
    "timestamp": "2026-01-31T15:23:19Z"
  },
  {
    "title": "US approves new multi-billion military sale to Israel",
    "description": "The US has approved more than $6.5 billion in new potential military sales to Israel amid a stand-off with Iran Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631805-us-approves-military-sales-israel/",
    "timestamp": "2026-01-31T15:22:09Z"
  },
  {
    "title": "‘That’s exactly what a sock puppet does’: Elizabeth Warren accuses Kevin Warsh of softening his rate stance for Trump",
    "description": "\"If Donald Trump says it, then Kevin Warsh echoes it, even though it contradicts everything he had done for years.\"",
    "link": "https://fortune.com/2026/01/31/elizabeth-warren-kevin-warsh-rate-cuts-donald-trump-sock-puppet/",
    "timestamp": "2026-01-31T15:21:37Z"
  },
  {
    "title": "Top liberals anticipate prosecution, humiliation of Trump and his MAGA allies when Dems regain power",
    "description": "Influential liberals ranging from politicians to podcasters called to punish anyone who associated with President Donald Trump as if they were Nazis or Nazi collaborators.",
    "link": "https://www.foxnews.com/media/top-liberals-anticipate-prosecution-humiliation-trump-maga-allies-when-dems-regain-power",
    "timestamp": "2026-01-31T15:16:26Z"
  },
  {
    "title": "Nicki Minaj Attends MELANIA Movie Red Carpet Premiere … Looks GREAT!",
    "description": "We Don’t Love Nicki Minaj’s Politics — But She Absolutely Ate at the Melania Premiere Let’s get this out of the way first: we are not fans of Nicki Minaj’s sudden and confusing political pivot. Her recent public support for Donald Trump and her embrace of MAG…",
    "link": "https://mediatakeout.com/nicki-minaj-attends-melania-movie-red-carpet-premiere-looks-great/",
    "timestamp": "2026-01-31T15:15:19Z"
  },
  {
    "title": "German football federation rules out World Cup boycott to oppose Trump",
    "description": "German football federation confirms it met to discuss a boycott of the FIFA 2026 World Cup, which is co-hosted by US.",
    "link": "https://www.aljazeera.com/sports/2026/1/31/german-football-federation-rules-out-world-cup-boycott-to-oppose-trump",
    "timestamp": "2026-01-31T15:13:35Z"
  },
  {
    "title": "Canada’s opposition Conservative Party votes to keep leader Poilievre",
    "description": "By Maria Cheng and Promit MukherjeeOTTAWA, Jan 31 (Reuters) - Canada’s opposition Conservative Party has voted overwhelmingly to retain Pierre Poilievre as its leader af… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/31/canada-s-opposition-conservative-party-votes-to-keep-leader-poilievre",
    "timestamp": "2026-01-31T15:08:18Z"
  },
  {
    "title": "Trump Signs Executive Order for IndyCar Race on Streets of DC",
    "description": "President Donald Trump signed an executive order on Friday instructing federal agencies to plan an IndyCar race on the streets of Washington, D.C. this summer. The order says the American 250 Grand Prix will take place in late August as part of the country’s …",
    "link": "https://www.today.com/video/trump-announces-indycar-race-in-dc-for-us-250th-celebration-256949829763",
    "timestamp": "2026-01-31T15:05:41Z"
  },
  {
    "title": "DAVID MARCUS: Don Lemon's 'other' unforgivable crime was against his old profession",
    "description": "Don Lemon faces federal charges after allegedly participating in Minnesota church disruption while livestreaming, raising journalism ethics questions.",
    "link": "https://www.foxnews.com/opinion/david-marcus-don-lemons-other-unforgivable-crime-against-his-old-profession",
    "timestamp": "2026-01-31T15:05:28Z"
  },
  {
    "title": "Donald and Melania Trump, Queen Elizabeth and Elon Musk – what we have learned from the Epstein Files",
    "description": "The US Justice Department has published a new and final cache of millions of documents related to the late convicted sex offender Jeffrey Epstein, under a law passed in November that required the release of all Epstein-related records.",
    "link": "https://www.independent.ie/world-news/north-america/donald-and-melania-trump-queen-elizabeth-and-elon-musk-what-we-have-learned-from-the-epstein-files/a1104332874.html",
    "timestamp": "2026-01-31T15:00:48Z"
  },
  {
    "title": "Vanity Fair declares ‘Woke 2’ is back in the form of protests as abolish ICE slogans return",
    "description": "Vanity Fair declares \"Woke 2,\" saying a new phase of progressive activism is moving from social media to confident street protests against Trump's return.",
    "link": "https://www.foxnews.com/media/vanity-fair-declares-woke-2-back-protests-abolish-ice-slogans-return",
    "timestamp": "2026-01-31T15:00:39Z"
  },
  {
    "title": "‘Melania’ Movie Humiliates Critics and Media Naysayers with Historic Box Office",
    "description": "The legacy media must be devastated. Melania just had a huge box-office opening for a documentary, despite all the efforts...",
    "link": "https://pjmedia.com/matt-margolis/2026/01/31/melania-movie-humiliates-critics-and-media-naysayers-with-historic-box-office-n4948955",
    "timestamp": "2026-01-31T14:58:47Z"
  },
  {
    "title": "Trump Moved Fast To Cut A Funding Deal. It's A Striking Change From The Last Shutdown Fight",
    "description": "Some Republicans are frustrated with the deal, raising the possibility of a prolonged shutdown fight when the House returns Monday.",
    "link": "https://www.huffpost.com/entry/congress-budget-republicans-trump-swift_n_697e1696e4b0b1de95c51a4c",
    "timestamp": "2026-01-31T14:52:54Z"
  },
  {
    "title": "Dr Oz hit by humiliating putdown as he tries to shame LA",
    "description": "Dr. Mehmet Oz, President Donald Trump's head of the Centers for Medicare and Medicaid Services, is conducting a public campaign to expose what he claims is Medicaid fraud in Los Angeles and across California.But his presence is not being taken seriously by th…",
    "link": "https://www.rawstory.com/dr-oz-trump-2675065145/",
    "timestamp": "2026-01-31T14:51:06Z"
  }
]