[
  {
    "title": "‘She’s Getting Beat Up!’: Barron Trump Reportedly Saved Woman’s Life No Thanks To Emergency Operator",
    "description": "The emergency operated reportedly asked Barron Trump to 'stop being so rude' and 'actually answer my questions.'",
    "link": "https://dailycaller.com/2026/01/22/barron-trump-london-united-kingdom-abuse-attack-victim-emergency-operator/",
    "timestamp": "2026-01-22T16:39:08Z"
  },
  {
    "title": "Barron Trump Called Police After Witnessing Friend Being Assaulted on FaceTime, Court Hears",
    "description": "Barron Trump‘s distress call regarding a “very close” friend is getting attention. The 19-year-old son of Donald Trump told police in Britain that he saw the friend getting assaulted by a man on a FaceTime call. Keep reading to find out more… Barron was repor…",
    "link": "https://www.justjared.com/2026/01/22/barron-trump-called-police-after-witnessing-friend-being-assaulted-on-facetime-court-hears/",
    "timestamp": "2026-01-22T16:38:15Z"
  },
  {
    "title": "Trump unveils so-called “Board of Peace”",
    "description": "On Thursday, Donald Trump formally announced his so-called “Board of Peace” during the World Economic Forum in Davos, Switzerland. The body has been widely criticized as an attempt by Trump to undermine the UN and 'takeover the world order.'",
    "link": "https://mondoweiss.net/2026/01/trump-unveils-so-called-board-of-peace/",
    "timestamp": "2026-01-22T16:38:05Z"
  },
  {
    "title": "NATO chief Mark Rutte shows he's a 'Trump whisperer' with Greenland diplomacy",
    "description": "Mark Rutte, NATO chief, has skillfully navigated a standoff between Europe and the United States over Greenland.  He reportedly persuaded President Donald Trump to drop threats of tariffs.  Rutte's ability to engage with Trump has earned him the nickname 'Tru…",
    "link": "https://economictimes.indiatimes.com/news/defence/nato-chief-mark-rutte-shows-hes-a-trump-whisperer-with-greenland-diplomacy/articleshow/127175459.cms",
    "timestamp": "2026-01-22T16:37:22Z"
  },
  {
    "title": "NATO chief Mark Rutte shows he’s a ‘Trump whisperer’ with Greenland diplomacy",
    "description": "NATO Secretary-General Mark Rutte may have been instrumental in persuading Donald Trump to scrap his threat of tariffs over Greenland.",
    "link": "https://www.bostonherald.com/2026/01/22/nato-chief-rutte-trump-whisperer/",
    "timestamp": "2026-01-22T16:36:23Z"
  },
  {
    "title": "Ontario Teachers’ reroutes some cash into public markets",
    "description": "Ontario Teachers’ Pension Plan chief executive Jo Taylor said that the pension is “warehousing” capital in public markets. Find out more",
    "link": "https://financialpost.com/fp-finance/ontario-teachers-reroutes-cash-into-public-markets",
    "timestamp": "2026-01-22T16:34:50Z"
  },
  {
    "title": "Trump Criticizes His Own Press Team",
    "description": "Um, there might be a few other reasons why people aren't impressed by him...",
    "link": "https://littlethings.com/entertainment/trump-blames-press-team",
    "timestamp": "2026-01-22T16:34:28Z"
  },
  {
    "title": "Barron Trump called London police after witnessing a woman 'getting beat up,' according to transcript released at a trial",
    "description": "President Donald Trump’s son Barron called London police last year to urge them to respond to a woman who he said he had witnessed \"getting beat up,\" according to a call transcript released during a trial.",
    "link": "https://www.nbcnews.com/politics/politics-news/barron-trump-called-london-police-witnessing-woman-getting-beat-accord-rcna255371",
    "timestamp": "2026-01-22T16:33:54Z"
  },
  {
    "title": "American tennis star Madison Keys takes swipe at Trump admin at Australian Open",
    "description": "American tennis star Madison Keys took a swipe at President Donald Trump when asked about how she felt about the state of the U.S. at the Australian Open.",
    "link": "https://www.foxnews.com/sports/american-tennis-star-madison-keys-takes-swipe-trump-admin-australian-open",
    "timestamp": "2026-01-22T16:32:43Z"
  },
  {
    "title": "Trump’s Diverse Coalition of Voters Is Dead—and It’s All His Fault",
    "description": "Donald Trump’s support has plummeted, with a new poll showing that he is underwater with all of the groups responsible for his 2024 election victory. The poll from The New York Times and Siena University has Trump with a 56 percent disapproval rating, and whe…",
    "link": "https://newrepublic.com/post/205553/trump-diverse-coalition-voters-dead-approval-rating-poll",
    "timestamp": "2026-01-22T16:31:38Z"
  },
  {
    "title": "Jamie Dimon Warns Trump’s Credit Cap Would Lead To ‘Economic Disaster’",
    "description": "Jamie Dimon warned that President Donald Trump's proposed interest cap on credit card rates would lead to \"economic disaster\" for everyday Americans.\nThe post Jamie Dimon Warns Trump’s Credit Cap Would Lead To ‘Economic Disaster’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/jamie-dimon-warns-trumps-credit-cap-would-lead-to-economic-disaster/",
    "timestamp": "2026-01-22T16:30:50Z"
  },
  {
    "title": "Zelenskiy tells Europe: have courage to finally ‘act now’",
    "description": "KYIV, Jan 22 (Reuters) - President Volodymyr Zelenskiy criticised Europe on Thursday as a “fragmented kaleidoscope of small and middle powers” lacking courage to act deci… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/22/zelenskiy-tells-europe-have-courage-to-finally-act-now",
    "timestamp": "2026-01-22T16:30:30Z"
  },
  {
    "title": "U.S. Establishes Fund to Control All Venezuelan Oil Revenue",
    "description": "U.S. President Donald Trump supervises the release of funds from sales of Venezuela’s oil, an official at the U.S. Administration told Semafor on Thursday.   Following the capture of Venezuelan leader Nicolas Maduro early this month, President Trump moved to …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Establishes-Fund-to-Control-All-Venezuelan-Oil-Revenue.html",
    "timestamp": "2026-01-22T16:30:00Z"
  },
  {
    "title": "The List of Impeachable Offenses Keeps Growing",
    "description": "A version of the below article first appeared in David Corn’s newsletter, Our Land. The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture. Subscribing costs just $5 a mo…",
    "link": "https://www.motherjones.com/politics/2026/01/donald-trump-impeach-abuse-power-richard-nixon/",
    "timestamp": "2026-01-22T16:28:11Z"
  },
  {
    "title": "Trump Admin Looking to Oust the Cuban Regime By the End of the Year: Report",
    "description": "The Wall Street Journal reported on Wednesday that President Donald Trump and his administration are actively working to topple the Cuban government by the end of the year\nThe post Trump Admin Looking to Oust the Cuban Regime By the End of the Year: Report fi…",
    "link": "https://www.mediaite.com/media/news/trump-admin-looking-to-oust-the-cuban-regime-by-the-end-of-the-year-report/",
    "timestamp": "2026-01-22T16:26:26Z"
  },
  {
    "title": "Trump launches 'Board of Peace'",
    "description": "US president Donald Trump has launched his Board of Peace - promising a new era of peace for the Middle East and beyond.\n\nThe board is part of Trump's 20-point plan to end the Israel-Hamas war. The UK says will not yet be signing up the board over concerns ab…",
    "link": "https://www.bbc.co.uk/programmes/w172zssjx15169v",
    "timestamp": "2026-01-22T16:24:00Z"
  },
  {
    "title": "The Supreme Court Shows It’s Willing to Thwart Trump—When Money Is on the Line",
    "description": "The Supreme Court Shows It’s Willing to Thwart Trump—When Money Is on the Line\n\n\n\nThe court’s conservatives appear likely to block trump from firing Lisa Cook—not because they care about principle but because they care about the Fed. \r\n\n\r\n\n\nThe post The Supre…",
    "link": "https://www.thenation.com/article/politics/supreme-court-trump-v-cook/",
    "timestamp": "2026-01-22T16:23:44Z"
  },
  {
    "title": "Good Morning, News: Portland Restaurants in the James Beard Semifinals, Higher Court Allows Feds to Tear Gas Protesters in Minnesota, and No Metal Detectors at Downtown Library",
    "description": "by Suzette Smith\n \n \n \n If you appreciate the Mercury's interesting and useful news & culture reporting, consider making a small monthly contribution to support our editorial team. Your donation is tax-deductible. You can also subscribe and have our papers de…",
    "link": "https://www.portlandmercury.com/good-morning-news/2026/01/22/48267216/good-morning-news-portland-restaurants-in-the-james-beard-semifinals-higher-court-allows-feds-to-tear-gas-protesters-in-minnesota-and-no-m",
    "timestamp": "2026-01-22T16:22:00Z"
  },
  {
    "title": "Musk Makes Surprise Appearance At Davos — Here’s What He Said About Greenland And Venezuela",
    "description": "The Tesla billionaire focused on his vision for interplanetary life and a society serviced by humanoid robots",
    "link": "https://www.forbes.com/sites/martinadilicosa/2026/01/22/musk-makes-surprise-appearance-at-davos---heres-what-he-said-about-greenland-and-venezuela/",
    "timestamp": "2026-01-22T16:21:39Z"
  },
  {
    "title": "Tiger Woods Under ‘Pressure to Propose’ to Vanessa Trump: She Wants ‘a Ring On Her Finger’ (Exclusive)",
    "description": "Putt a ring on it! Less than a year after going public with their relationship, Tiger Woods’ girlfriend Vanessa Trump is ready to make things official. “It’s no secret she wants to take things up a notch and have a ring on her finger,” a source tells the Nati…",
    "link": "https://nationalenquirer.com/tiger-woods-under-pressure-to-propose-to-vanessa-trump-she-wants-a-ring-on-her-finger-exclusive/",
    "timestamp": "2026-01-22T16:20:59Z"
  },
  {
    "title": "Bizarre 'New Gaza' plan unveiled by Trump - featuring luxury apartments and data centres",
    "description": "CGI renderings of the plan appear to show skyscrapers, data centres and seaside resorts in the planned redevelopment of the region.",
    "link": "https://www.thejournal.ie/new-gaza-plan-trump-apartments-tourism-data-centres-6935390-Jan2026/",
    "timestamp": "2026-01-22T16:20:31Z"
  },
  {
    "title": "Albania, Bulgaria to join Trump’s ‘Board of Peace’",
    "description": "TIRANA, Jan 22 (Reuters) - Albanian lawmakers on Thursday approved a government decision to join the “Board of Peace” initiative launched by U.S. President Donald Trump t… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/22/albania-bulgaria-to-join-trump-s-board-of-peace",
    "timestamp": "2026-01-22T16:20:25Z"
  },
  {
    "title": "Sean O'Malley: 'I apologize if I offended anybody' with mask during faceoff",
    "description": "Sean O'Malley received backlash for wearing a medical mask during his first faceoff with Song Yadong and says his \"intentions were never harmful.\"",
    "link": "https://mmajunkie.usatoday.com/story/sports/ufc/2026/01/22/ufc-324-sean-omalley-apologizes-mask-song-yadong-faceoff/88296348007/",
    "timestamp": "2026-01-22T16:20:14Z"
  },
  {
    "title": "Infantino: \"Soccer is the most democratic sport and the World Cup wants to unite the world\"",
    "description": "\"We need occasions to bring people together, we saw it in Qatar in 2022. There was a lot of criticism beforehand and it was a wonderful World Cup,\" said the FIFA president during his speech at the Davos economic forum  Leer",
    "link": "https://www.marca.com/en/world-cup/2026/01/22/697249c1268e3ef0158b45d6.html",
    "timestamp": "2026-01-22T16:19:58Z"
  },
  {
    "title": "Crow: All Options to Remove Trump 'On the Table,' from Impeachment to 25th Amendment",
    "description": "Wednesday on MS NOW’s “Deadline,” Rep. Jason Crow (D-CO) said all option to remove President Donald Trump from office are on the table. Crow said, “This president is unstable. He is corrupt. He’s interested only in his own power. He\nThe post Crow: All Options…",
    "link": "https://www.breitbart.com/clips/2026/01/22/crow-all-options-to-remove-trump-on-the-table-from-impeachment-to-25th-amendment/",
    "timestamp": "2026-01-22T16:19:31Z"
  },
  {
    "title": "Fact check: Are fans cancelling World Cup 2026 tickets over US immigration fears?",
    "description": "Fears over US immigration policies are fueling viral claims that thousands are canceling World Cup 2026 tickets. Are fans really backing out—and could ICE target visitors?",
    "link": "https://www.dw.com/en/fact-check-are-fans-cancelling-world-cup-2026-tickets-over-us-immigration-fears/a-75562821",
    "timestamp": "2026-01-22T16:17:00Z"
  },
  {
    "title": "Fact check: Fans canceling World Cup tickets over ICE fears?",
    "description": "Amid a violent crackdown on migrants in the US, claims have been emerging online that thousands are canceling their tickets to the 2026 World Cup. Are fans backing out? And would immigration officers target visitors?",
    "link": "https://www.dw.com/en/fact-check-fans-canceling-world-cup-tickets-over-ice-fears/a-75562821",
    "timestamp": "2026-01-22T16:17:00Z"
  },
  {
    "title": "Mark Carney to deliver remarks on Canada’s ‘choices’ and ‘values’ in Quebec City",
    "description": "The prime minister will not be taking questions from reporters after his address, according to his office.",
    "link": "https://nationalpost.com/news/mark-carney-speech-in-quebec-city",
    "timestamp": "2026-01-22T16:13:42Z"
  },
  {
    "title": "Zack Polanski to hand in NHS contract termination notice to Palantir",
    "description": "Zack Polanski is telling defence surveillance corporation Palantir to 'pack its bags and get the hell out of the NHS'.",
    "link": "https://www.thecanary.co/uk/news/2026/01/22/zack-polanski-to-hand-in-nhs-contract-termination-notice-to-palantir/",
    "timestamp": "2026-01-22T16:13:16Z"
  },
  {
    "title": "WATCH: 'I stand by my decision' to prosecute Trump, Jack Smith says in House testimony",
    "description": "\"If asked whether to prosecute a former president based on the same facts today, I would do so regardless of whether that president was a Democrat or Republican,\" Smith said.",
    "link": "https://www.pbs.org/newshour/politics/watch-i-stand-by-my-decision-to-prosecute-trump-jack-smith-says-in-house-testimony",
    "timestamp": "2026-01-22T16:12:48Z"
  },
  {
    "title": "Trump says Ukraine deal 'coming soon' during Board of Peace ceremony",
    "description": "President Donald Trump joined world leaders for a signing ceremony in Switzerland on Jan. 22 for his \"Board of Peace.\" Trump suggested during the presentation that a peace settlement connected to Russia's war in Ukraine was \"coming very soon.\" Ukrainian offic…",
    "link": "https://freerepublic.com/focus/f-news/4363423/posts",
    "timestamp": "2026-01-22T16:12:10Z"
  },
  {
    "title": "'Hoax!' Trump responds to Jack Smith hearing with unhinged rant from Stephen Miller",
    "description": "President Donald Trump responded to former special counsel Jack Smith's first public testimony by sharing a video of aide Stephen Miller shouting about \"the Russiagate hoax.\"As cable news stations fixated on Smith, Trump responded with a post on Truth Social.…",
    "link": "https://www.rawstory.com/trump-smith-miller/",
    "timestamp": "2026-01-22T16:10:51Z"
  },
  {
    "title": "Stephen A Smith shreds Newsom for violating 'America First' with disparagement of Trump in a foreign country",
    "description": "On Wednesday's episode of \"Straight Shooter,\" host Stephen A. Smith blasted Gov. Gavin Newsom for disparaging President Donald Trump in Davos, Switzerland this week.",
    "link": "https://www.foxnews.com/media/stephen-smith-shreds-newsom-violating-america-first-disparagement-trump-foreign-country",
    "timestamp": "2026-01-22T16:10:34Z"
  },
  {
    "title": "Trump’s Golden Dome Is No Silver Bullet",
    "description": "Nearly one year on, one of the biggest U.S. defense proposals remains little more than a concept.",
    "link": "http://foreignpolicy.com/2026/01/22/golden-dome-trump-missile-defense-explained-greenland/",
    "timestamp": "2026-01-22T16:09:21Z"
  },
  {
    "title": "US envoy calls for Syria truce to be upheld",
    "description": "DAMASCUS, Jan 22 (Reuters) - A U.S. envoy called for ‌a truce between the Syrian government and Kurdish-led forces to be upheld, urging steps to build trust after Damascus captured swathes ‌of the northeast in a push to reassert central authority. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2026/01/23/us-envoy-calls-for-syria-truce-to-be-upheld",
    "timestamp": "2026-01-22T16:09:00Z"
  },
  {
    "title": "Trump Claims He's A Dictator",
    "description": "Addressing leaders at the World Economic Forum, Donald Trump veered off into La-la land when he proclaimed himself dictator.\nTrump rambled about Larry, and then he bragged about getting great reviews on his speech -- (Karoline Leavitt must have told him how m…",
    "link": "https://crooksandliars.com/2026/01/trump-claims-hes-dicator",
    "timestamp": "2026-01-22T16:08:22Z"
  },
  {
    "title": "‘No One Should Be Above the Law’: Jack Smith Torches Trump in Blistering Opening Statement",
    "description": "Jack Smith excoriated President Donald Trump in a blistering opening statement delivered before the House Judiciary Committee on Thursday.\nThe post ‘No One Should Be Above the Law’: Jack Smith Torches Trump in Blistering Opening Statement first appeared on Me…",
    "link": "https://www.mediaite.com/media/news/no-one-should-be-above-the-law-jack-smith-torches-trump-in-blistering-opening-statement/",
    "timestamp": "2026-01-22T16:07:17Z"
  },
  {
    "title": "Healey promises temporary reduction in utility bills ahead of speech",
    "description": "Gov. Maura Healey says she will be detailing initiatives to “immediately” reduce heating and electricity bills with $180 million in existing funds and rate deferrals, but that money will be recovered by utility companies from ratepayers later this year.",
    "link": "https://www.bostonherald.com/2026/01/22/healey-promises-temporary-reduction-in-utility-bills-ahead-of-speech/",
    "timestamp": "2026-01-22T16:07:04Z"
  },
  {
    "title": "Vance says he'll try to calm tensions in Minneapolis — while still criticizing officials and protesters there",
    "description": "Vice President JD Vance, previewing a trip to Minneapolis to meet with ICE officers and community members, said he will aim to \"turn down the chaos.\"",
    "link": "https://www.nbcnews.com/politics/jd-vance/vance-calm-tensions-minneapolis-criticizing-protests-rcna255237",
    "timestamp": "2026-01-22T16:06:38Z"
  },
  {
    "title": "The leverage that Europe has over the US economy",
    "description": "Following recent transatlantic turmoil, European officials are exploring economic leverage against the U.S.  They are considering actions like selling U.S. bonds and targeting the services trade, though the effectiveness of these threats remains a key questio…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-leverage-that-europe-has-over-the-us-economy/articleshow/127172802.cms",
    "timestamp": "2026-01-22T16:06:08Z"
  },
  {
    "title": "Bengaluru court hands life terms to 5 in 2011 murder case",
    "description": "Bengaluru: A city court has sentenced five men to life imprisonment for publicly hacking a man to death and injuring two others in Channakeshavanagar,.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/bengaluru-court-hands-life-terms-to-5-in-2011-murder-case/articleshow/127172720.cms",
    "timestamp": "2026-01-22T16:05:08Z"
  },
  {
    "title": "Bank of America’s Brian Moynihan left off invite list for Trump reception at Davos",
    "description": "The snub is the second time the CEO has been excluded from an event with the president and hints at a deeper rift. Find out more here",
    "link": "https://financialpost.com/financial-times/bank-of-america-brian-moynihan-trump-reception-davos",
    "timestamp": "2026-01-22T16:03:20Z"
  },
  {
    "title": "AOC accuses Trump of engaging in 'increasingly erratic' behavior",
    "description": "Democratic Rep. Alexandria Ocasio-Cortez of New York claimed that President Donald Trump has been engaged in \"increasingly erratic\" behavior.",
    "link": "https://www.foxnews.com/politics/aoc-accuses-trump-engaging-increasingly-erratic-behavior",
    "timestamp": "2026-01-22T16:02:56Z"
  },
  {
    "title": "ICE Turns Lawyers Away at Minneapolis Detention Facility",
    "description": "As arrests surge under “Operation Metro Surge,” attorneys say the Trump administration is again denying detainees meaningful access to counsel.",
    "link": "https://reason.com/2026/01/22/ice-turns-lawyers-away-at-minneapolis-detention-facility/",
    "timestamp": "2026-01-22T16:01:53Z"
  },
  {
    "title": "No written document memorializes the future deal framework for Greenland, sources say | CNN Politics",
    "description": "President Donald Trump and NATO Secretary General Mark Rutte reached a verbal understanding about Greenland during their meeting on Wednesday, but no document has been produced yet memorializing a future deal, people familiar with their discussion told CNN.",
    "link": "https://www.cnn.com/2026/01/22/politics/future-deal-framework-greenland",
    "timestamp": "2026-01-22T16:01:28Z"
  },
  {
    "title": "Europe Clutches Its Pearls Over Trump’s Newly Minted Board Of Peace",
    "description": "President Donald Trump unveiled his new “Board of Peace” at Davos on Thursday, but its debut was marked by the conspicuous absence of some of America’s allies.",
    "link": "https://dailycaller.com/2026/01/22/europe-clutches-its-pearls-over-trumps-newly-minted-board-of-peace/",
    "timestamp": "2026-01-22T16:01:00Z"
  },
  {
    "title": "Trump on Greenland Deal: ‘It’s Essentially Total Access’",
    "description": "\"We're going to have total access to Greenland. We're going to have all military access that we want.\"\nThe post Trump on Greenland Deal: ‘It’s Essentially Total Access’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/trump-on-greenland-deal-its-essentially-total-access/",
    "timestamp": "2026-01-22T16:00:26Z"
  },
  {
    "title": "U.S. Is Plotting A Regime Change In Cuba",
    "description": "After the successful removal of Nicolas Maduro from power in Venezuela, the United States now seek a regime change in Cuba. Originally declaring that the operation was over \"narco terrorism,\" it was quickly revealed that the U.S. simply wanted control of Vene…",
    "link": "https://www.shtfplan.com/member-exclusive/u-s-is-plotting-a-regime-change-in-cuba",
    "timestamp": "2026-01-22T16:00:04Z"
  },
  {
    "title": "Trump Claims Greenland ‘Framework’ With NATO, Suspends European Tariffs",
    "description": "State of the Union: The president says the deal would give U.S. access to mineral rights and link Greenland to “the Golden Dome.”\nThe post Trump Claims Greenland ‘Framework’ With NATO, Suspends European Tariffs appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-claims-greenland-framework-with-nato-suspends-european-tariffs/",
    "timestamp": "2026-01-22T16:00:00Z"
  },
  {
    "title": "Greenland’s only Catholic priest: ‘We’re not just minerals or a military position’",
    "description": "Father Tomaž Majcen celebrates daily Mass at Christ the King Church in Nuuk, Greenland, and he frequently travels to other towns to minister to the faithful scattered across the territory. | Credit: Photo courtesy of Father Tomaž Majcen\n\nJan 22, 2026 / 11:00 …",
    "link": "https://www.ewtnnews.com/world/europe/greenlands-only-catholic-priest-we-re-not-just-minerals-or-a-military-position",
    "timestamp": "2026-01-22T16:00:00Z"
  },
  {
    "title": "Who is Simran Bala? Meet the first woman to lead an all-male CRPF contingent on Republic Day 2026",
    "description": "A 26-year-old woman officer, Simran Bala from Jammu and Kashmir, is set to make history by leading an all-male CRPF contingent at the Republic Day parade. Hailing from a small town, her journey from clearing the CAPF exam to facing challenging postings has ho…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/who-is-simran-bala-meet-the-first-woman-to-lead-an-all-male-crpf-contingent-on-republic-day-2026/articleshow/127171715.cms",
    "timestamp": "2026-01-22T15:59:29Z"
  },
  {
    "title": "Is JD Vance Running for President in 2028?",
    "description": "Clarence Lusane\n\n\n\nIf so, Vance’s message is clear: Every imaginable far-right extremist, from white supremacists and technofascists to offensive fabulists, will be welcome in his campaign.\r\n\n\r\n\n\nThe post Is JD Vance Running for President in 2028? appeared fi…",
    "link": "https://www.thenation.com/article/politics/jd-vance-election-2028/",
    "timestamp": "2026-01-22T15:59:03Z"
  },
  {
    "title": "Ukraine's Zelenskyy criticizes Putin, but also European inaction in impassioned Davos speech",
    "description": "Ukrainian President Volodymyr Zelenskyy criticized Europe's response ​to the Greenland dispute with the U.S., saying that the ​continent needed to show more courage ⁠and describing it ‍as ⁠a \"fragmented ​kaleidoscope\" of small and middle powers.",
    "link": "https://www.cbc.ca/news/world/davos-address-ukraine-zelenskyy-9.7055841",
    "timestamp": "2026-01-22T15:53:04Z"
  },
  {
    "title": "Zelenskyy Slams European inaction over Russian aggression after meeting Trump",
    "description": "In a change of tone for the Ukrainian leader, he lamented Europe’s lack of ‘political will’ in dealing with Russian President Vladimir Putin.",
    "link": "https://www.thejournal.ie/zelenskyy-slams-european-inaction-over-russian-aggression-after-meeting-trump-6935338-Jan2026/",
    "timestamp": "2026-01-22T15:52:26Z"
  },
  {
    "title": "Appeasing Trump Only Invites Betrayal - as Europe’s Far Right Just Learned",
    "description": "With Donald Trump laying claim to Greenland, Europeans have finally realized who they are dealing with. The US president is animated less by the prospect of deal-making than by the need for domination, less by the spirit of exchange than by the perverse pleas…",
    "link": "https://www.project-syndicate.org/commentary/trump-greenland-shows-that-only-interest-is-in-domination-and-others-self-abasement-by-stephen-holmes-2026-01",
    "timestamp": "2026-01-22T15:52:12Z"
  },
  {
    "title": "What Is the Scale of the Resistance in Minnesota?",
    "description": "A must-read thread from Margaret Killjoy (Skywriter thread) on what’s going on in Minnesota.\n\nI came to Minneapolis to repor",
    "link": "https://kottke.org/26/01/what-is-the-scale-of-the-resistance-in-minnesota",
    "timestamp": "2026-01-22T15:51:14Z"
  },
  {
    "title": "Trump’s ‘Irreversible’ American Carnage in Greenland",
    "description": "The president’s madcap quest to take over the territory is yet another blow to the post-World War II global order that brought America prosperity",
    "link": "http://www.rollingstone.com/politics/political-commentary/trumps-irreversible-american-carnage-greenland-1235503365/",
    "timestamp": "2026-01-22T15:50:29Z"
  },
  {
    "title": "Exclusive - Karan Kundrra on finding love Tejasswi Prakash on a reality show: I was lucky to meet someone I truly connected with and the bond we share is strong",
    "description": "Karan Kundrra, the charismatic host of Splitsvilla X6, offered a glimpse into the journey of finding true love within the realm of reality television. Reflecting on his transformative experience in Bigg Boss, he articulated how it led him to profound self-awa…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/exclusive-karan-kundrra-on-finding-love-tejasswi-prakash-on-a-reality-show-i-was-lucky-to-meet-someone-i-truly-connected-with-and-the-bond-we-share-is-strong/articleshow/127170304.cms",
    "timestamp": "2026-01-22T15:48:25Z"
  },
  {
    "title": "EU/US relationship on agenda as EU leaders hold summit",
    "description": "EU leaders will meet in Brussels this evening following US President Donald Trump's dramatic U-turn on Greenland and tariffs.",
    "link": "https://www.rte.ie/news/2026/0122/1554554-eu-leaders-summit/",
    "timestamp": "2026-01-22T15:47:16Z"
  },
  {
    "title": "Carney's Davos speech was 'very good,' Sheinbaum says. 'I don't know if you heard it'",
    "description": "President Claudia Sheinbaum spoke in support of the Canadian prime minister on Wednesday morning during a press conference.",
    "link": "https://nationalpost.com/news/canada/carney-davos-speech-sheinbaum",
    "timestamp": "2026-01-22T15:46:01Z"
  },
  {
    "title": "The Justices Undermined the Federal Reserve’s Independence. Now They Want Backsies.",
    "description": "On Wednesday, the Supreme Court sat for oral arguments over whether the all-powerful president the justices have created in recent years can control the Federal Reserve. The end of Federal Reserve independence would reset the global financial order, tank reti…",
    "link": "https://www.motherjones.com/politics/2026/01/supreme-court-donald-trump-lisa-cook-federal-reserve-independence/",
    "timestamp": "2026-01-22T15:45:51Z"
  },
  {
    "title": "Renee Good’s autopsy details revealed; Minnesota mother was shot in the 'side of the head' by ICE agent",
    "description": "US News: An independent autopsy into the death of Renee Nicole Good, the 37-year-old woman shot by federal immigration agent Jonathan Ross in Minneapolis, has .",
    "link": "https://timesofindia.indiatimes.com/world/us/renee-goods-autopsy-details-revealed-minnesota-mother-was-shot-three-times-by-ice-agent/articleshow/127165320.cms",
    "timestamp": "2026-01-22T15:45:05Z"
  },
  {
    "title": "James Woods Rips Into ‘Buffoon’ Don Lemon with Megyn Kelly Over Church Protest: ‘Dingleberry Hanging on the A** of American Journalism’",
    "description": "James Woods held nothing back when blasting Don Lemon over his coverage of a church protest, calling him a \"dingleberry hanging on the a** of\" journalism.\nThe post James Woods Rips Into ‘Buffoon’ Don Lemon with Megyn Kelly Over Church Protest: ‘Dingleberry Ha…",
    "link": "https://www.mediaite.com/media/podcasts/dingleberry-hanging-on-the-a-of-american-journalism-james-woods-rips-into-buffoon-don-lemon-with-megyn-kelly-over-church-protest/",
    "timestamp": "2026-01-22T15:44:55Z"
  },
  {
    "title": "Indian gold, silver ETFs plunge as investors unwind positions",
    "description": "Net asset value of precious metals still intact, says IBJA President Prithviraj Kothari; Delhi-based industry body calls for probe into ‘unusually large positions’",
    "link": "https://www.thehindubusinessline.com/markets/gold/indian-gold-silver-etfs-plunge-as-investors-unwind-positions/article70539067.ece",
    "timestamp": "2026-01-22T15:43:32Z"
  },
  {
    "title": "Vance tells Minneapolis to ‘stop fighting’ ICE as White House doubles down on crackdown",
    "description": "JD Vance visits Minnesota amid growing protests over Trump's immigration crackdown and controversial ICE raids that have sparked intense national debate.",
    "link": "https://www.foxnews.com/politics/vance-tells-minneapolis-stop-fighting-ice-white-house-doubles-down-crackdown",
    "timestamp": "2026-01-22T15:42:43Z"
  },
  {
    "title": "This 'catastrophic' outcome will force the Supreme Court to rule against Trump: expert",
    "description": "The Supreme Court's power could slip even further should it not rein in Donald Trump now they have the chance, a political analyst has shared.In a conversation hosted by the New York Times, Kate Shaw suggested the court could be in pole position to pull Trump…",
    "link": "https://www.rawstory.com/supreme-court-trump-2675004797/",
    "timestamp": "2026-01-22T15:40:45Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
    "description": "Domestic markets rebounded on global cues after positive Trump remarks, but caution persisted amid rupee weakness and FII outflows. Nifty consolidated above the 200-day average, faced resistance, volatility stayed elevated, while investors await earnings, US …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/127170450.cms",
    "timestamp": "2026-01-22T15:40:34Z"
  },
  {
    "title": "US now focused on controlling Greenland military bases instead of entire island",
    "description": "Any possible deal struck by the US and Denmark would be modelled on British bases in Cyprus",
    "link": "https://www.irishtimes.com/world/europe/2026/01/22/us-now-focused-on-controlling-greenland-military-bases-instead-of-entire-island/",
    "timestamp": "2026-01-22T15:39:24Z"
  },
  {
    "title": "Zelenskyy lays into 'lost' Europe for trying to 'change' Trump and not dealing with global threats",
    "description": "Ukraine's President Volodymyr Zelenskyy has attacked Europe as weak in the face of the U.S. and President Donald Trump.",
    "link": "https://www.cnbc.com/2026/01/22/zelenskyy-davos-speech-trump-europe-ukraine-russia.html",
    "timestamp": "2026-01-22T15:36:53Z"
  },
  {
    "title": "America Will Have 'Sovereign' Control Over Areas of Greenland in Deal Reached by Trump: Report",
    "description": "A new report says the proposed deal on Greenland will give the U.S. what amounts to total control over some parts of the island.",
    "link": "https://www.westernjournal.com/america-will-sovereign-control-areas-greenland-deal-reached-trump-report/",
    "timestamp": "2026-01-22T15:35:00Z"
  },
  {
    "title": "Trump backs off Greenland threats, declares ‘deal’",
    "description": "Trump and NATO have ‘formed the framework for a future deal,’ the president claimed",
    "link": "https://theweek.com/world-news/trump-backs-off-greenland-threats-deal",
    "timestamp": "2026-01-22T15:34:34Z"
  },
  {
    "title": "BREAKING: Ringleader of Anti-ICE Church Invasion Arrested",
    "description": "Attorney General Pam Bondi announced Thursday that law enforcement had arrested Nekima Levy Armstrong, a leader of the agitators who invaded a church service in... Read More\nThe post BREAKING: Ringleader of Anti-ICE Church Invasion Arrested appeared first on …",
    "link": "https://www.dailysignal.com/2026/01/22/breaking-ringleader-anti-ice-church-invasion-arrested/",
    "timestamp": "2026-01-22T15:31:16Z"
  },
  {
    "title": "India's dilemma over Trump's Gaza 'Board of Peace'",
    "description": "Trump's 'Board of Peace' is testing India's long held balancing act between Israel and the Palestinians, raising questions about costs, strategy, and global leadership.",
    "link": "https://www.dw.com/en/indias-dilemma-over-trumps-gaza-board-of-peace/a-75607689",
    "timestamp": "2026-01-22T15:30:00Z"
  },
  {
    "title": "India torn over Trump's Gaza 'Board of Peace'",
    "description": "Trump's 'Board of Peace' is testing India's long-held balancing act between Israel and the Palestinians with issues on costs, strategy, and global leadership.",
    "link": "https://www.dw.com/en/donald-trump-gaza-board-of-peace-india-israel-relations-palestine-diplomatic-dilemma/a-75607689",
    "timestamp": "2026-01-22T15:30:00Z"
  },
  {
    "title": "US fintech stocks could gain as Trump pushes affordability agenda, Citi says",
    "description": "U.S. fintech stocks could gain an ‍edge as Washington leans into a more ​populist, affordability-driven agenda ahead of the November 2026 midterm elections, ⁠analysts at Citigroup said in a note.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-fintech-stocks-could-gain-as-trump-pushes-affordability-agenda-citi-says/articleshow/127169507.cms",
    "timestamp": "2026-01-22T15:29:35Z"
  },
  {
    "title": "State Dept moves to expand Mexico City Policy, targeting abortion, DEI and gender ideology in foreign aid",
    "description": "Mexico City Policy expansion will block U.S. foreign aid from supporting gender ideology and DEI programs plus abortion, according to State Department rules.",
    "link": "https://www.foxnews.com/politics/state-dept-moves-expand-mexico-city-policy-targeting-abortion-dei-gender-ideology-foreign-aid",
    "timestamp": "2026-01-22T15:29:20Z"
  },
  {
    "title": "Hedge fund titan Ken Griffin says Japan's bond-market rebellion is a warning sign that the US needs to shape up its finances",
    "description": "The rise in Japanese bond yields is an \"explicit warning\" that the US could see its own bond market revolt, Ken Griffin said.",
    "link": "https://www.businessinsider.com/japan-bond-selloff-ken-griffin-vigilantes-us-debt-fiscal-policy-2026-1",
    "timestamp": "2026-01-22T15:29:19Z"
  },
  {
    "title": "Lazard CEO Peter Orszag predicts ‘something big’ that ‘happens in Iran over next few days’",
    "description": "Lazard CEO Peter Orszag predicted on Wednesday that “something big” was imminent in Iran as American aircraft carriers quietly moved into position. Orszag, a former senior Obama administration official, said it is “very likely that over the next few days, the…",
    "link": "https://nypost.com/2026/01/22/business/lazard-ceo-peter-orszag-predicts-something-big-that-happens-in-iran/",
    "timestamp": "2026-01-22T15:28:40Z"
  },
  {
    "title": "‘Why detain a 5-year-old?’: Outrage in Minneapolis as US school district claims ICE is targeting students in Trump’s latest crackdown",
    "description": "\"Why detain a 5-year-old?\" Columbia Heights Public Schools Superintendent Zena Stenvik said at a news conference. \"You cannot tell me that this child is going to be classified as a violent criminal.\"",
    "link": "https://indianexpress.com/article/world/outrage-in-minneapolis-as-us-school-district-claims-ice-is-targeting-students-in-trumps-crackdown-10489362/",
    "timestamp": "2026-01-22T15:28:17Z"
  },
  {
    "title": "'The View' Co-Host Joy Behar: 'I Want My Legacy to Be That I Helped Get Trump Out of Office'",
    "description": "ABC's \"The View\" co-host Joy Behar says she hopes her \"legacy\" will be the removal of Donald J. Trump from the office of the president.\nThe post ‘The View’ Co-Host Joy Behar: ‘I Want My Legacy to Be That I Helped Get Trump Out of Office’ appeared first on Bre…",
    "link": "https://www.breitbart.com/entertainment/2026/01/22/the-view-co-host-joy-behar-i-want-my-legacy-to-be-that-i-helped-get-trump-out-of-office/",
    "timestamp": "2026-01-22T15:27:54Z"
  },
  {
    "title": "ICE Is Telling Agents to Break Into Homes Without a Warrant",
    "description": "ICE reportedly gave itself permission to violate the Fourth Amendment in order to accelerate President Donald Trump’s sweeping deportation campaign, according to a new whistleblower disclosure.In a secret memo distributed in May 2025, ICE Director Todd Lyons …",
    "link": "https://newrepublic.com/post/205545/ice-agents-break-into-homes-without-warrant",
    "timestamp": "2026-01-22T15:27:43Z"
  },
  {
    "title": "Kevin Hassett says new Fed chair should be 'an independent person' who respects mandates",
    "description": "White House adviser ‍Kevin Hassett, one of ​the candidates in the running to ⁠replace Federal Reserve Chair Jerome Powell, told CNBC in an interview on Thursday that the central bank's new chair should be \"an ‌independent person who ‌respects the mandates\".",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/kevin-hassett-says-new-fed-chair-should-be-an-independent-person-who-respects-mandates/articleshow/127169081.cms",
    "timestamp": "2026-01-22T15:25:01Z"
  },
  {
    "title": "How Greenland could hit the Israeli pocketbook",
    "description": "The fight over Greenlandthe frozen island is indicative of how Trump views the world and the world economy. It's bad news for an Israel, that has benefited so much from globalization",
    "link": "https://www.haaretz.com/israel-news/2026-01-22/ty-article/.premium/how-greenland-could-hit-the-israeli-pocketbook/0000019b-e62c-d1e6-a99b-e6ad4d970000",
    "timestamp": "2026-01-22T15:25:01Z"
  },
  {
    "title": "Mayamayooram fame Vedhika is all excited after sharing the screen with Mammootty in 'Chatha Pacha'",
    "description": "From the little screens of Malayalam TV to the expansive realm of cinema, Vedhika Sreekumar has made waves with her debut in 'Chatha Pacha,' where she stars opposite the iconic Mammootty. A finalist from 'Drama Juniors,' Vedhika couldn’t contain her elation a…",
    "link": "https://timesofindia.indiatimes.com/tv/news/malayalam/mayamayooram-fame-vedhika-is-all-excited-after-sharing-the-screen-with-mammootty-in-chatha-pacha/articleshow/127168858.cms",
    "timestamp": "2026-01-22T15:22:21Z"
  },
  {
    "title": "Boris Kodjoe Calls Trump 'Embarrassing for Humanity' After Dictator Speech",
    "description": "President Donald Trump is damaging the United States in the eyes of the international community, but it goes so much deeper than that ... so says actor Boris Kodjoe. We caught up with the star at LAX Wednesday ... and we asked him what he thinks of…\n Permalink",
    "link": "https://www.tmz.com/2026/01/22/boris-kodjoe-trump-embarrassing-for-humanity/",
    "timestamp": "2026-01-22T15:21:16Z"
  },
  {
    "title": "Former special counsel Jack Smith testifies in front of House Judiciary Committee",
    "description": "Former special counsel Jack Smith who charged Trump with crimes in Florida and D.C. is testifying in public before the House Judiciary Committee on Thursday.",
    "link": "https://abcnews.go.com/Politics/former-special-counsel-jack-smith-testify-front-house/story?id=129420778",
    "timestamp": "2026-01-22T15:20:55Z"
  },
  {
    "title": "Face Of Chaotic Antisemitic Columbia Protests Gets Deportation Destination",
    "description": "The Trump administration indicated that it has picked a county to send one of the most well-known foreign student agitators accused of Hamas sympathies.",
    "link": "https://dailycaller.com/2026/01/22/dhs-preparing-to-deport-khalil-to-algeria/",
    "timestamp": "2026-01-22T15:20:34Z"
  },
  {
    "title": "Trump says rare earths are part of his Greenland deal. It's 'completely bonkers' (Matt Egan/CNN)",
    "description": "Matt Egan / CNN:\nTrump says rare earths are part of his Greenland deal.  It's ‘completely bonkers’  —  President Donald Trump on Wednesday said he reached a framework for a deal with NATO over the future of Greenland that will include rights to rare-earth min…",
    "link": "https://www.memeorandum.com/260122/p42",
    "timestamp": "2026-01-22T15:20:00Z"
  },
  {
    "title": "Fox News Host’s Take On Europe’s Reaction To Trump At Davos Is Just Bonkers",
    "description": "The conservative anchor spewed the stunning take right from the start.",
    "link": "https://www.huffpost.com/entry/laura-ingraham-temper-tantrum-europe-donald-trump-greenland_n_69722375e4b0dfed7798b538",
    "timestamp": "2026-01-22T15:19:14Z"
  },
  {
    "title": "Jasmine Crockett Dares Democrats to Rethink Electability",
    "description": "Washington Post: “The controversy is part of a larger Democratic disagreement about what makes a candidate ‘electable,’ a term many party leaders have used in recent years to describe scripted, vetted, broadly acceptable contenders poised to capitalize on cen…",
    "link": "https://politicalwire.com/2026/01/22/jasmine-crockett-is-daring-democrats-to-rethink-electability/",
    "timestamp": "2026-01-22T15:18:43Z"
  },
  {
    "title": "ICE War on Rights and Safety Continues With Policy of Illegal, Fourth Amendment-Violating Home Break-Ins, Detainee Homicide, and Detention and Transport of Children",
    "description": "ICE lawlessness is only getting worse.",
    "link": "https://www.nakedcapitalism.com/2026/01/ice-war-on-rights-and-safety-continues-with-policy-of-illegal-fourth-amendment-violating-home-break-ins-detainee-homicide-and-detention-and-transport-of-children.html",
    "timestamp": "2026-01-22T15:18:38Z"
  },
  {
    "title": "Flipping Trump voters unite as they tell NY Times why they're abandoning GOP",
    "description": "Voters who flipped at the last election to vote for Donald Trump and the Republican Party believe one issue is dragging his administration down. Despite action in Greenland and Venezuela, the ongoing release of Jeffrey Epstein's files, and a narrowly avoided …",
    "link": "https://www.rawstory.com/trump-economy-2675004247/",
    "timestamp": "2026-01-22T15:18:37Z"
  },
  {
    "title": "Could escalating Greenland annexation issue impact Las Vegas tourism? | Tourism",
    "description": "Visitation from Canada fell dramatically over tariffs and Trump remarks. Could the same thing happen with European travelers with the Greenland annexation issue?",
    "link": "https://www.reviewjournal.com/post/3610544",
    "timestamp": "2026-01-22T15:18:27Z"
  }
]