[
  {
    "title": "Dan Andrews's red carpet walk in Beijing put Albanese on the spot",
    "description": "Despite being in an overwhelmingly dominant position politically, Anthony Albanese sounded quite tetchy this week.",
    "link": "https://www.abc.net.au/news/2025-09-05/anthony-albanese-dan-andrews-sam-rae-aged-care/105720260",
    "timestamp": "2025-09-04T18:57:34Z"
  },
  {
    "title": "RFK Jr. defends firing spree at CDC, vows ‘new blood’ at agency",
    "description": "Health secretary Robert F. Kennedy Jr. defends CDC firings during Senate hearing, citing poor COVID-19 response and promising new leadership at the agency.",
    "link": "https://www.foxnews.com/politics/rfk-jr-defends-firing-spree-cdc-vows-new-blood-agency",
    "timestamp": "2025-09-04T18:56:10Z"
  },
  {
    "title": "Sydney Sweeney Says She Won't Talk About American Eagle Controversy As New Movie Premieres This Weekend",
    "description": "Sweeney’s new movie “Christy” premieres at the Toronto International Film Festival this weekend, but she’s refusing to talk about her controversial American Eagle jeans ad.",
    "link": "https://www.forbes.com/sites/conormurray/2025/09/04/sydney-sweeney-says-she-wont-talk-about-american-eagle-controversy-as-new-movie-premieres-this-weekend/",
    "timestamp": "2025-09-04T18:56:04Z"
  },
  {
    "title": "Justin Sun’s WLFI wallet blacklisted after $9M token transfer",
    "description": "Justin Sun’s WLFI token address was reportedly blacklisted from transferring $9 million, fueling speculation amid a sharp price drop in early trading.",
    "link": "https://cointelegraph.com/news/justin-sun-wlfi-address-blacklisted",
    "timestamp": "2025-09-04T18:55:00Z"
  },
  {
    "title": "Missouri Republicans begin redistricting to erase one Democratic seat in US House | CNN Politics",
    "description": "The Republican-controlled Missouri legislature began redrawing its congressional map Thursday to target one Democratic-held seat in the US House, responding to demands by President Donald Trump and his allies to help the GOP eke out more seats in next year’s …",
    "link": "https://www.cnn.com/2025/09/04/politics/missouri-redistricting-republicans",
    "timestamp": "2025-09-04T18:53:50Z"
  },
  {
    "title": "Wall Street’s Bet Against the Trump Tariffs - The New York Times",
    "description": "Wall Street’s Bet Against the Trump TariffsThe New York Times With court's tariff ruling, businesses could soon be owed refunds. Here's what to know.CBS News What is American Workers Rebate Act of 2025 status? Who qualifies for Trump stimulus checkErie Times-…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179008746",
    "timestamp": "2025-09-04T18:53:08Z"
  },
  {
    "title": "Brett Favre Says ‘Common Sense’ Drove His Support For Trump",
    "description": "Brett Favre explained why he chose to publicly back President Donald Trump ahead of the November election.",
    "link": "https://dailycaller.com/2025/09/04/brett-favre-says-common-sense-helped-him-support-trump/",
    "timestamp": "2025-09-04T18:50:14Z"
  },
  {
    "title": "If Trump’s tariffs are thrown out, companies could be refunded billions",
    "description": "President Donald Trump likes to boast about how much money the U.S. Treasury is raking in from the massive taxes—tariffs—he’s slapped this year on imports from almost every country in the world.\n“We have trillions of dollars coming into our country,” Trump sa…",
    "link": "https://biztoc.com/x/aedf5398dc8c6704",
    "timestamp": "2025-09-04T18:50:13Z"
  },
  {
    "title": "The Media Don’t Want To Revisit Their Russiagate Frenzy",
    "description": "By Tim Graham via The Daily Signal | September 04, 2025\nThere’s something darkly funny about liberal journalists insisting any new focus on the Russiagate frenzy of 2017-19 is a “distraction” from their current obsession over President Donald Trump and Jeffre…",
    "link": "https://biztoc.com/x/8a69d9d7ec57c4f5",
    "timestamp": "2025-09-04T18:49:54Z"
  },
  {
    "title": "Robert F Kennedy hearing turns rancorous as Democrats press him on Covid vaccine changes",
    "description": "US health secretary Robert F Kennedy Jr came under pointed bipartisan questioning at a rancorous three-hour senate committee hearing on Thursday, about - among other things - turmoil at federal health agencies and efforts to pull back recommendations for Covi…",
    "link": "https://www.independent.ie/world-news/north-america/robert-f-kennedy-hearing-turns-rancorous-as-democrats-press-him-on-covid-vaccine-changes/a765894819.html",
    "timestamp": "2025-09-04T18:49:51Z"
  },
  {
    "title": "Vile Grifters Are Taking Over Establishment Media",
    "description": "Jack Mirkinson\n\n\n\nParamount is reportedly set to pay between $100 million and $200 million for The Free Press and will install Bari Weiss at the top of CBS News.\r\n\n\r\n\n\nThe post Vile Grifters Are Taking Over Establishment Media appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/bari-weiss-free-press-cbs-news-paramount/",
    "timestamp": "2025-09-04T18:48:08Z"
  },
  {
    "title": "If you bought a gold bar at Costco last year, here is what it's worth now",
    "description": "Gold hit a record $3,578 per ounce before declining Thursday, driven by weak jobs data and investor concerns about tariffs and Federal Reserve policy changes...",
    "link": "https://www.foxbusiness.com/economy/you-bought-gold-bar-costco-last-year-here-what-its-worth-now",
    "timestamp": "2025-09-04T18:46:56Z"
  },
  {
    "title": "Northwestern University president announces resignation following federal funding cuts by Trump administration",
    "description": "During the wave of pro-Palestinian protests Northwestern drew ire from conservatives over an agreement it struck with demonstrators to take down their encampment.",
    "link": "https://indianexpress.com/article/world/northwestern-university-president-michael-schill-announces-resignation-10230877/",
    "timestamp": "2025-09-04T18:46:49Z"
  },
  {
    "title": "Rubio says Trump 'wants to wage war' on Venezuelan drug traffickers: 'Blow them up if that's what it takes'",
    "description": "Secretary of State Marco Rubio emphasized the importance of designating Ecuadorian gangs as terror groups while declaring war on drug traffickers.",
    "link": "https://www.foxnews.com/world/rubio-says-trump-wants-wage-war-venezuelan-drug-traffickers-blow-them-up-thats-what-takes",
    "timestamp": "2025-09-04T18:46:31Z"
  },
  {
    "title": "WATCH: Sen. Cassidy asks RFK Jr. how he can support Nobel for Trump COVID program but not back the vaccines",
    "description": "Cassidy said it surprised him that Kennedy would think so highly of Operation Warp Speed when the health secretary has attempted to restrict access to the vaccines and cancelled funding for mRNA vaccine research that was critical to the initiative's mission.",
    "link": "https://www.pbs.org/newshour/politics/watch-sen-cassidy-asks-rfk-jr-how-he-can-support-nobel-for-trump-covid-program-but-not-back-the-vaccines",
    "timestamp": "2025-09-04T18:45:53Z"
  },
  {
    "title": "Trump pushes Europe to stop purchasing Russian oil and up pressure on China in latest effort to end Ukraine war",
    "description": "Now almost three weeks after his high-stakes Alaskan summit with Russian President Vladimir Putin, Trump is growing increasingly frustrated with the lack of progress on peace.",
    "link": "https://www.cnn.com/2025/09/04/politics/ukraine-war-trump-security-guarantees",
    "timestamp": "2025-09-04T18:45:35Z"
  },
  {
    "title": "Hunger grows in Nigeria as aid cuts reduce food supplies",
    "description": "DIKWA, Nigeria (Reuters) -Destitute families displaced by conflict in northeastern Nigeria are finding nutrition centres closed or running low on food as a result of a collapse in aid funding from the United States and other Western countries. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/05/hunger-grows-in-nigeria-as-aid-cuts-reduce-food-supplies",
    "timestamp": "2025-09-04T18:44:00Z"
  },
  {
    "title": "DOJ does damage control as staffer admits Republicans will be redacted from Epstein files",
    "description": "The Department of Justice attempted to do damage control after conservative political activist James O'Keefe released a video of a staffer claiming the government would \"redact every Republican\" from files about sex offender Jeffrey Epstein.In a Thursday post…",
    "link": "https://www.rawstory.com/doj-epstein-redact-republicans/",
    "timestamp": "2025-09-04T18:42:50Z"
  },
  {
    "title": "Trump Touts Strengthening of Social Security Administration",
    "description": "President Donald Trump is touting a range of the Social Security Administration's (SSA) accomplishments that have strengthened the SSA as a whole since his return to office.\nThe post Trump Touts Strengthening of Social Security Administration appeared first o…",
    "link": "https://www.breitbart.com/politics/2025/09/04/trump-touts-strengthening-of-social-security-administration/",
    "timestamp": "2025-09-04T18:41:05Z"
  },
  {
    "title": "Washington DC sues Trump administration over National Guard deployment",
    "description": "WASHINGTON: Washington, DC sued US President Donald Trump's administration on Thursday (Sep 4) over his deployment of National Guard troops in the capital city, a move likely to heighten tensions betwee",
    "link": "https://www.channelnewsasia.com/asia/washington-dc-sues-trump-administration-over-national-guard-deployment-5333231",
    "timestamp": "2025-09-04T18:38:25Z"
  },
  {
    "title": "Washington DC sues Trump administration over National Guard deployment",
    "description": "WASHINGTON: Washington, DC sued US President Donald Trump's administration on Thursday (Sep 4) over his deployment of National Guard troops in the capital city, a move likely to heighten tensions betwee",
    "link": "https://www.channelnewsasia.com/world/washington-dc-sues-trump-administration-over-national-guard-deployment-5333231",
    "timestamp": "2025-09-04T18:38:00Z"
  },
  {
    "title": "Washington DC sues Trump administration over National Guard deployment",
    "description": "WASHINGTON: Washington DC sued US President Donald Trump's administration on Thursday (Sep 4) over his deployment of National Guard troops in the capital city, a move likely to heighten tensions between",
    "link": "https://www.channelnewsasia.com/world/washington-sues-trump-administration-national-guard-5333231",
    "timestamp": "2025-09-04T18:38:00Z"
  },
  {
    "title": "Senate clashes with RFK Jr over vaccine policies and CDC firings",
    "description": "RFK Jr faces bipartisan criticism for allegedly undermining vaccine trust and reshaping public health leadership.",
    "link": "https://www.aljazeera.com/news/2025/9/4/senate-clashes-with-rfk-jr-over-vaccine-policies-and-cdc-firings",
    "timestamp": "2025-09-04T18:37:11Z"
  },
  {
    "title": "‘You’re Full of Sh*t’: JD Vance Rages At Democrats’ Rough Questioning of RFK Jr.",
    "description": "J.D. Vance came to the defense of RFK Jr. as the HHS secretary underwent a beating before the Senate Finance Committee over his recent changes at the CDC.\nThe post ‘You’re Full of Sh*t’: JD Vance Rages At Democrats’ Rough Questioning of RFK Jr. first appeared…",
    "link": "https://www.mediaite.com/media/news/youre-full-of-sht-jd-vance-rages-at-democrats-rough-questioning-of-rfk-jr/",
    "timestamp": "2025-09-04T18:36:27Z"
  },
  {
    "title": "RFK Jr. Calls Out CDC’s ‘Disastrous’ Failures, Defends Cleaning House In Heated Hearing",
    "description": "Robert F. Kennedy Jr. challenged the record of the CDC on the COVID-19 pandemic and the precipitous rise in chronic disease in the U.S. as he defended his reforms Thursday.",
    "link": "https://dailycaller.com/2025/09/04/rfk-jr-cdc-failures-senate-hearing/",
    "timestamp": "2025-09-04T18:36:17Z"
  },
  {
    "title": "Northwestern University president to resign following tenure marked by tension",
    "description": "Northwestern University President Michael Schill announced Thursday that he will resign, ending a three-year tenure marked by the freeze of hundreds of millions of dollars in federal funding by the Trump administration and heated criticism from House R...",
    "link": "https://abcnews.go.com/Politics/wireStory/northwestern-university-president-resign-tenure-marked-white-house-125266540",
    "timestamp": "2025-09-04T18:33:53Z"
  },
  {
    "title": "Raskin: Trump Trying to Take 'Stalinist Style Control' of Colleges and Universities",
    "description": "Thursday on MSNBC's \"Morning Joe,\" Rep. Jamie Raskin (D-MD) accused President Donald Trump of trying to exercise \"Stalinist-style control\" over colleges and universities across the country.\nThe post Raskin: Trump Trying to Take ‘Stalinist Style Control’ of Co…",
    "link": "https://www.breitbart.com/clips/2025/09/04/raskin-trump-trying-to-take-stalinist-style-control-of-colleges-and-universities/",
    "timestamp": "2025-09-04T18:33:45Z"
  },
  {
    "title": "BLM co-founder debuts homeless youth documentary as Trump sweeps encampments in DC",
    "description": "The film is screening through Sept. 7 on the Seattle Film Festival's online platform.",
    "link": "https://www.bostonherald.com/2025/09/04/patrisse-cullors-homeless-youth-film/",
    "timestamp": "2025-09-04T18:32:25Z"
  },
  {
    "title": "Pro-MAGA Activist Publishes Clip of Trump DOJ Official Saying Ghislaine Maxwell Was Moved to ‘Keep Her Quiet’",
    "description": "James O’Keefe published a clip on Thursday of a Trump Justice Department official claiming that Ghislaine Maxwell was moved to prison “to keep her quiet.”\nThe post Pro-MAGA Activist Publishes Clip of Trump DOJ Official Saying Ghislaine Maxwell Was Moved to ‘K…",
    "link": "https://www.mediaite.com/politics/pro-maga-activist-publishes-clip-of-trump-doj-official-saying-ghislaine-maxwell-was-moved-to-keep-her-quiet/",
    "timestamp": "2025-09-04T18:31:26Z"
  },
  {
    "title": "Senators tear into RFK Jr. over vaccine restrictions in explosive hearing",
    "description": "Robert F. Kennedy Jr. struggled Thursday to defend himself before Congress against calls for his resignation.",
    "link": "https://www.msnbc.com/msnbc/news/rfk-jr-senate-hearing-testimony-covid-vaccine-restrictions-rcna229123",
    "timestamp": "2025-09-04T18:30:41Z"
  },
  {
    "title": "What’s in a Hand?",
    "description": "The White House press corps gets credit for not falling for misinformation about Trump’s health. But is it missing the story again?",
    "link": "https://www.cjr.org/analysis/trump-health-misinformation-hand-social-media.php",
    "timestamp": "2025-09-04T18:29:18Z"
  },
  {
    "title": "‘Something That’s Worth Fighting For’: Jim Banks Stresses Need To Preserve American Dream Despite ‘Sad Reality’",
    "description": "WASHINGTON — Indiana Sen. Jim Banks said Thursday that Republicans need to fight to ensure that the American dream becomes more easily attainable for Americans.",
    "link": "https://dailycaller.com/2025/09/04/jim-banks-american-dream-worth-fighting-for/",
    "timestamp": "2025-09-04T18:29:16Z"
  },
  {
    "title": "Top Trump aide chosen for Federal Reserve Board on track to win approval as questions swirl about bank independence",
    "description": "President Donald Trump’s effort to remake the board of the Federal Reserve and push the central bank to cut interest rates gained momentum after a top White House adviser appeared to win the endorsement of Republican senators.",
    "link": "https://biztoc.com/x/1d2736ead8f95778",
    "timestamp": "2025-09-04T18:28:21Z"
  },
  {
    "title": "Navy reverses demotion of Rep. Ronny Jackson, Trump’s former White House doctor",
    "description": "In light of the details and context, it's tough to see the Navy's decision to reverse Rep. Ronny Jackson's demotion as anything but overtly political.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/navy-reverses-demotion-rep-ronny-jackson-trumps-former-white-house-doc-rcna229137",
    "timestamp": "2025-09-04T18:28:17Z"
  },
  {
    "title": "Why are there so few affordable EVs in Canada?",
    "description": "In this issue of our environmental newsletter, we look at the more affordable EV models available in Canada — and why there are fewer here compared to other countries; see how plug-in solar panels for balconies work; and find out how beavers can fight wildfir…",
    "link": "https://www.cbc.ca/news/science/what-on-earth-cheap-evs-1.7624821",
    "timestamp": "2025-09-04T18:27:41Z"
  },
  {
    "title": "‘Strapped’ former BigLaw associate is arrested for alleged confrontation with National Guard members",
    "description": "A fired Covington & Burling associate was arrested last week for allegedly thrusting his shoulder into a member of the National Guard and making threatening statements to other National Guard members patrolling Washington, D.C.",
    "link": "https://www.abajournal.com/news/article/strapped-former-biglaw-associate-is-arrested-and-accused-of-throwing-his-shoulder-into-national-guardsman-in-dc",
    "timestamp": "2025-09-04T18:27:00Z"
  },
  {
    "title": "Microsoft set to dodge EU fine with offer to unbundle teams",
    "description": "Microsoft will avoid a major EU antitrust fine after regulators accepted its offer to unbundle Teams from Office packages. The move, prompted by Slack’s 2019 complaint, follows no objections in a market test.",
    "link": "https://economictimes.indiatimes.com/tech/technology/microsoft-set-to-dodge-eu-fine-with-offer-to-unbundle-teams/articleshow/123705096.cms",
    "timestamp": "2025-09-04T18:26:18Z"
  },
  {
    "title": "U.S. stocks drop as new economic data and court ruling on Trump tariffs unsettle markets",
    "description": "U.S. stocks tumbled Tuesday as investors digested new economic data and a recent court ruling that most of President Donald Trump’s tariffs could be potentially blocked. Why it matters: The sell-off raised concerns about the potential that more than $120 bill…",
    "link": "https://techpinions.com/u-s-stocks-drop-as-new-economic-data-and-court-ruling-on-trump-tariffs-unsettle-markets/",
    "timestamp": "2025-09-04T18:26:00Z"
  },
  {
    "title": "Pentagon Halts Military Support Programs for European Countries Bordering Russia",
    "description": "MOSCOW (Sputnik) - The United States will curtail hundreds of millions of dollars in security support programs for European countries bordering Russia, the Financial Times reported on Thursday, citing sources familiar with the matter.",
    "link": "https://sputnikglobe.com/20250904/pentagon-halts-military-support-programs-for-european-countries-bordering-russia-1122728204.html",
    "timestamp": "2025-09-04T18:25:58Z"
  },
  {
    "title": "Alan Dershowitz predicts Supreme Court’s ruling on deporting illegal alien criminals",
    "description": "Gang members exploited Joe Biden's program for parole for undocumented immigrants",
    "link": "https://www.wnd.com/2025/09/alan-dershowitz-predicts-supreme-courts-ruling-deporting-illegal/",
    "timestamp": "2025-09-04T18:24:29Z"
  },
  {
    "title": "Pritzker urged to avoid playing politics on crime issue by former Obama advisor",
    "description": "CNN political commentator David Axelrod urged Gov. J.B. Pritzker against playing 2028 politics on the crime issue as he tried to counter President Donald Trump's efforts.",
    "link": "https://www.foxnews.com/media/axelrod-warns-gov-pritzker-against-playing-2028-politics-crime-issue-urges-him-work-trump",
    "timestamp": "2025-09-04T18:24:14Z"
  },
  {
    "title": "Debt at World War II levels? Ray Dalio warns US economy echoes 1930s chaos as America stays silent",
    "description": "US national debt crisis 2025: Ray Dalio of Bridgewater Associates sees US economy mirroring the 1930s. He cites rising debt and political unrest. Dalio fears government control and silenced voices. He predicts a debt crisis within three years. America's debt …",
    "link": "https://economictimes.indiatimes.com/news/international/us/debt-at-world-war-ii-levels-ray-dalio-warns-us-economy-echoes-1930s-chaos-as-america-stays-silent/articleshow/123703583.cms",
    "timestamp": "2025-09-04T18:23:57Z"
  },
  {
    "title": "US Congress releases missing Epstein jail footage (VIDEO)",
    "description": "The previously released recording on the night of the sex offender’s death jumped by one minute to midnight Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624129-congress-missing-epstein-video/",
    "timestamp": "2025-09-04T18:23:24Z"
  },
  {
    "title": "Publisher agrees to changes in Virginia Giuffre’s memoir after family objections",
    "description": "The book is set to be released on October 21.",
    "link": "https://www.bostonherald.com/2025/09/04/virginia-giuffre-memoir/",
    "timestamp": "2025-09-04T18:22:23Z"
  },
  {
    "title": "Republicans Launch Yet Another Jan. 6 Committee",
    "description": "This may be the Republican Party’s biggest whitewash of them all.",
    "link": "https://www.huffpost.com/entry/republicans-launch-yet-another-jan-6-committee_n_68b9c1dde4b041ed82bdb964",
    "timestamp": "2025-09-04T18:21:39Z"
  },
  {
    "title": "Trump put pressure on European leaders over Russian oil purchases, White House official says",
    "description": "U.S. President Donald Trump told European leaders on Thursday that Europe must stop purchasing Russian oil that he said is helping Moscow fund its war against Ukraine, a White House official said. Trump joined a call of the \"Coalition of the Willing\" countrie…",
    "link": "https://freerepublic.com/focus/f-chat/4338617/posts",
    "timestamp": "2025-09-04T18:21:01Z"
  },
  {
    "title": "Former Russian president warns Moscow may seize 'valuables of the British Crown'",
    "description": "Dmitry Medvedev has warned Moscow may seize \"valuables of the British Crown\" in revenge for the UK using frozen Russian assets to fund military support for Ukraine.",
    "link": "https://news.sky.com/story/former-russian-president-warns-moscow-may-seize-valuables-of-the-british-crown-13425103",
    "timestamp": "2025-09-04T18:20:00Z"
  },
  {
    "title": "Trump's Fed pick says he will keep White House job",
    "description": "Democrats say the arrangement indicates Stephen Miran would be Trump's \"puppet\" at the central bank.",
    "link": "https://www.bbc.com/news/articles/c5yq3z2xd01o",
    "timestamp": "2025-09-04T18:19:18Z"
  },
  {
    "title": "Trump Insults Reporter With A Snide Suggestion In Yet Another Press Clash",
    "description": "The president issued a cranky comeback to a reporter because he didn't like the question.",
    "link": "https://www.huffpost.com/entry/donald-trump-reporter-get-yourself-a-new-job_n_68b9ac25e4b041ed82bd96fb",
    "timestamp": "2025-09-04T18:17:28Z"
  },
  {
    "title": "Top tech CEOs to meet with President Trump at White House",
    "description": "CNBC's Kristina Partsinevelos reports on the upcoming meeting between President Donald Trump and major tech company ...",
    "link": "https://biztoc.com/x/b9ed8065187770bd",
    "timestamp": "2025-09-04T18:14:33Z"
  },
  {
    "title": "Tom Homan: Trump Brought Illegal Immigration Down 96 Percent",
    "description": "Trump Border Czar Tom Homan during a speech on Wednesday outlined President Donald Trump's victories in curbing illegal immigration.\nThe post Tom Homan: Trump Brought Illegal Immigration Down 96 Percent appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/04/tom-homan-trump-brought-illegal-immigration-down-96-percent/",
    "timestamp": "2025-09-04T18:13:04Z"
  },
  {
    "title": "Chris Matthews Blasts Trump’s Epstein Excuses: ‘Nobody Wants Any More Pages, They Want the Names!’ | Video",
    "description": "\"How do you deny to the right wing what they believe intuitively? They believe you guys, rich guys, are covering up this crime,\" the retired MSNBC anchor says\nThe post Chris Matthews Blasts Trump’s Epstein Excuses: ‘Nobody Wants Any More Pages, They Want the …",
    "link": "https://www.thewrap.com/chris-matthews-trump-epstein-files-names-morning-joe-video/",
    "timestamp": "2025-09-04T18:12:21Z"
  },
  {
    "title": "Debate Over Key Climate Change Program Continues In Sacramento",
    "description": "Lawmakers are debating how to extend the state's cap and trade program amid rising energy costs.",
    "link": "https://www.kqed.org/news/12054597/debate-over-key-climate-change-program-continues-in-sacramento",
    "timestamp": "2025-09-04T18:11:44Z"
  },
  {
    "title": "Macron says 26 countries pledge troops for Ukraine when fighting over",
    "description": "KYIV: French President Emmanuel Macron said Thursday (Sep 4) that 26 of Ukraine’s allies have pledged to deploy troops as a “reassurance force” for the war-torn country on",
    "link": "https://www.channelnewsasia.com/world/macron-says-26-countries-pledge-troops-ukraine-when-fighting-over-5333216",
    "timestamp": "2025-09-04T18:11:17Z"
  },
  {
    "title": "Despite Trump’s best efforts to squash the scandal, Epstein’s survivors aren’t letting up",
    "description": "Chris Hayes praises Epstein survivors for speaking out on Capitol Hill, and says the scandal isn't going anywhere, no matter how badly Trump may want it to.",
    "link": "https://www.msnbc.com/top-stories/latest/jeffrey-epstein-survivors-trump-maga-scandal-rcna229083",
    "timestamp": "2025-09-04T18:11:13Z"
  },
  {
    "title": "Two Hampton Roads wind energy grants were canceled. But $20M was already spent.",
    "description": "A Norfolk maritime facility tied to the region’s nascent offshore wind industry plans to shift part of its operational plans after President Donald Trump’s administration killed a $39 million grant. U.S. Transportation Secretary Sean Duffy announced last week…",
    "link": "https://www.pilotonline.com/2025/09/04/hampton-roads-wind-energy-grants-canceled/",
    "timestamp": "2025-09-04T18:10:00Z"
  },
  {
    "title": "New York AG Letitia James to appeal decision that tossed Trump's $454M civil fraud judgment",
    "description": "New York AG Letitia James to appeal decision that tossed Trump's $454M civil fraud judgmentgo.com",
    "link": "https://abcnews.go.com/US/new-york-ag-letitia-james-appeal-decision-tossed/story?id=125265159",
    "timestamp": "2025-09-04T18:08:20Z"
  },
  {
    "title": "Rosie O’Donnell on life in Ireland: ‘I felt very taken care of and understood and appreciated in this country’",
    "description": "The Women’s Podcast with Róisín Ingle",
    "link": "https://www.irishtimes.com/podcasts/the-womens-podcast/rosie-odonnell-on-life-in-ireland-i-felt-very-taken-care-of-and-understood-and-appreciated-in-this-country/",
    "timestamp": "2025-09-04T18:07:32Z"
  },
  {
    "title": "U.S. trade deficit widens more than expected in July",
    "description": "NEW YORK, Sept. 4 (Xinhua) -- The U.S. Commerce Department released a report on Thursday showing that the U.S. trade deficit enlarged to 78.3 billion U.S. dollars in July, up from the revised 59.1 billion dollars in June, and higher than economists' forecast …",
    "link": "https://www.thestar.com.my/news/world/2025/09/05/us-trade-deficit-widens-more-than-expected-in-july",
    "timestamp": "2025-09-04T18:06:00Z"
  },
  {
    "title": "New York AG appeals reversal of Trump's $500 million fraud penalty",
    "description": "New York Attorney General Letitia James on Thursday appealed a court's decision to toss out a $500 million penalty on President Donald Trump and his company in connection with business fraud.\nThe appeal comes two weeks after that punishment imposed by a Manha…",
    "link": "https://biztoc.com/x/fa3cf0ff0548e51a",
    "timestamp": "2025-09-04T18:05:33Z"
  },
  {
    "title": "Trump nominee plans to keep White House job if he's confirmed for Fed post",
    "description": "President Donald Trump's nominee to fill a vacancy on the Federal Reserve board said at his confirmation hearing that he does not plan to leave his position as chair of the White House Council of Economic Advisers if he's confirmed",
    "link": "https://biztoc.com/x/db67b6deb2220dfc",
    "timestamp": "2025-09-04T18:05:24Z"
  },
  {
    "title": "Trump Tells Supreme Court He Will Appeal In E. Jean Carroll Case",
    "description": "Trump Tells Supreme Court He Will Appeal In E. Jean Carroll Case\n \nAuthored by Matthew Vadum via The Epoch Times,\nPresident Donald Trump plans to ask the Supreme Court this fall to overturn a civil jury verdict that found he sexually abused writer E. Jean Car…",
    "link": "https://biztoc.com/x/1ac1cdb09aafd70c",
    "timestamp": "2025-09-04T18:05:12Z"
  },
  {
    "title": "Trump vowed to halve electricity prices. But they’re rising twice as fast as inflation",
    "description": "On the campaign trail last summer, President Donald Trump promised to swiftly cut electricity and energy prices in half if voters returned him to the White House.\n“We intend to slash prices by half within 12 months, maximum of 18 months,” Trump said during a …",
    "link": "https://biztoc.com/x/e3583cc5781b3aea",
    "timestamp": "2025-09-04T18:05:10Z"
  },
  {
    "title": "Donald Trump Risks Finding Himself on Wrong Side of One '80/20' Issue",
    "description": "The White House revels in being on the side of the majority of public opinion when it comes to hot-button cultural debates.",
    "link": "https://biztoc.com/x/fd00c4b259ee1f7d",
    "timestamp": "2025-09-04T18:05:07Z"
  },
  {
    "title": "Trump won't get to heaven if he keeps murdering people on boats (Will Bunch/The Philadelphia Inquirer)",
    "description": "Will Bunch / The Philadelphia Inquirer:\nTrump won't get to heaven if he keeps murdering people on boats  —  If Donald Trump is serious about wanting to get to heaven, he has a very odd strategy.This was the stark subject line on an email the 47th president se…",
    "link": "https://www.memeorandum.com/250904/p79",
    "timestamp": "2025-09-04T18:05:00Z"
  },
  {
    "title": "Conservative ‘South Park’ Fans Demand That the Show Stop Mocking Trump and Go After Joe Biden",
    "description": "The two, six-episode ‘South Park’ seasons released under Biden weren’t nearly this biting",
    "link": "https://www.cracked.com/article_48178_conservative-south-park-fans-demand-that-the-show-stop-mocking-trump-and-go-after-joe-biden.html",
    "timestamp": "2025-09-04T18:05:00Z"
  },
  {
    "title": "'South Park' Features Donald Trump Impregnating Satan in Tariff and Labubu Lampooning Episode",
    "description": "The latest \"South Park\" episode, titled, “Wok is Dead,” depicts President Donald Trump cheating on First Lady Melania Trump with satan, which is then revealed by Fox News.\nThe post ‘South Park’ Features Donald Trump Impregnating Satan in Tariff and Labubu Lam…",
    "link": "https://www.breitbart.com/entertainment/2025/09/04/south-park-features-donald-trump-impregnating-satan-in-tariff-and-labubu-lampooning-episode/",
    "timestamp": "2025-09-04T18:04:16Z"
  },
  {
    "title": "Senators grill Trump's nominee for Fed amid alarms over central bank independence",
    "description": "White House economist Stephen Miran was quizzed by senators about whether he could make decisions independently of President Trump, if he's confirmed to a seat on the Federal Reserve's governing board.",
    "link": "https://www.npr.org/2025/09/04/nx-s1-5526956/senate-federal-reserve-trump-stephen-miran",
    "timestamp": "2025-09-04T18:03:09Z"
  },
  {
    "title": "Missourians won’t let Trump and the GOP gerrymander the state without a fight",
    "description": "Claire McCaskill on how Missouri Republicans are helping Trump carry out his redistricting push and drown out the voices of Democratic voters in Kansas City.",
    "link": "https://www.msnbc.com/top-stories/latest/missouri-trump-redistricting-push-republicans-rcna229072",
    "timestamp": "2025-09-04T18:02:20Z"
  },
  {
    "title": "How Trump is transforming the way corporations do business in the U.S.",
    "description": "President Trump demanded cuts from private businesses. Blacklisted major law firms. And threatened companies to invest more in America. The uncertain legal landscape for U.S. businesses today.",
    "link": "https://www.wbur.org/onpoint/2025/09/04/trump-business-operate-corporations-cuts",
    "timestamp": "2025-09-04T18:00:00Z"
  },
  {
    "title": "The Mass Shooters Are Performing for One Another",
    "description": "The goal of these attacks is to join a lineage of infamous killers.",
    "link": "https://www.theatlantic.com/technology/archive/2025/09/minneapolis-church-shooting-influencers/684083/",
    "timestamp": "2025-09-04T17:58:46Z"
  },
  {
    "title": "Trump threatens to revoke Rosie O'Donnell's citizenship (again) instead of addressing Epstein",
    "description": "Donald Trump has once again threatened to revoke Rosie O'Donnell's U.S. citizenship — something she believes is an attempt to distract from his connection to Jeffrey Epstein.",
    "link": "https://www.advocate.com/news/donald-trump-rosie-odonnell-citizenship",
    "timestamp": "2025-09-04T17:58:34Z"
  },
  {
    "title": "List reveals items FBI seized from John Bolton's home during raid",
    "description": "Court documents reveal the FBI seized multiple devices and Trump-related documents from former national security adviser John Bolton's home last month.",
    "link": "https://www.foxnews.com/politics/list-reveals-which-items-fbi-seized-from-john-boltons-home-during-raid",
    "timestamp": "2025-09-04T17:57:47Z"
  },
  {
    "title": "Trump’s Unsupported Death Penalty Claim",
    "description": "At a Cabinet meeting on Aug. 26, President Donald Trump proposed seeking the death penalty for anyone convicted of murder in Washington, D.C., claiming the death penalty is \"a very strong preventative.\" But the research, which has been difficult to conduct, i…",
    "link": "https://www.factcheck.org/2025/09/trumps-unsupported-death-penalty-claim/",
    "timestamp": "2025-09-04T17:57:29Z"
  },
  {
    "title": "Donald Trump Risks Finding Himself on Wrong Side of One '80/20' Issue",
    "description": "The White House revels in being on the side of the majority of public opinion when it comes to hot-button cultural debates.",
    "link": "https://www.newsweek.com/donald-trump-risks-finding-himself-wrong-side-one-80-20-issue-2124725",
    "timestamp": "2025-09-04T17:56:00Z"
  },
  {
    "title": "Amy Sherald’s Canceled Smithsonian Show Heads to Baltimore Museum of Art",
    "description": "The Baltimore Museum of Art announcement follows Sherald's decision to cancel the Smithsonian iteration in July amid censorship concerns.",
    "link": "https://www.artnews.com/art-news/news/amy-sherald-american-sublime-the-baltimore-museum-of-art-1234750817/",
    "timestamp": "2025-09-04T17:55:10Z"
  },
  {
    "title": "Is a Congressional Stock Trading Ban Even Possible?",
    "description": "There is a growing movement to ban stock trading by members of Congress, but it is altogether unclear whether the two parties will be able... Read More\nThe post Is a Congressional Stock Trading Ban Even Possible? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/04/is-congressional-stock-trading-ban-even-possible/",
    "timestamp": "2025-09-04T17:55:00Z"
  },
  {
    "title": "Lose-lose: Even if the Supreme Court strikes down Trump’s tariffs, consumers likely wouldn’t see a dime from refunds",
    "description": "President Donald Trump likes to boast about how much money the U.S. Treasury is raking in from the massive taxes—tariffs—he’s slapped this year on imports from almost every country in the world.\n“We have trillions of dollars coming into our country,” Trump sa…",
    "link": "https://biztoc.com/x/4c5dfc7185423a52",
    "timestamp": "2025-09-04T17:54:05Z"
  },
  {
    "title": "New York AG appeals reversal of Trump's $500 million fraud penalty",
    "description": null,
    "link": "https://www.cnbc.com/2025/09/04/trump-new-york-appeal-james-fraud.html",
    "timestamp": "2025-09-04T17:52:14Z"
  },
  {
    "title": "Is there anyone left to say, \"NO?\"",
    "description": "We thought someone would put the stop on the worst impulses of Trump, but the courts, the congress, the justice department, and the Maga voters are giving the “all systems go” nod.",
    "link": "https://www.ncspin.com/is-there-anyone-left-to-say-no",
    "timestamp": "2025-09-04T17:51:47Z"
  },
  {
    "title": "Trump nominee plans to keep White House job if he's confirmed for Fed post",
    "description": "President Donald Trump's nominee to fill a vacancy on the Federal Reserve board said at his confirmation hearing that he does not plan to leave his position as chair of the White House Council of Economic Advisers if he's confirmed",
    "link": "https://www.nbcnews.com/politics/white-house/trump-stephen-miran-federal-reserve-senate-hearing-resign-white-house-rcna229099",
    "timestamp": "2025-09-04T17:51:17Z"
  },
  {
    "title": "USA Today Publishes Op-Ed Slamming ‘Trump Haters’ For Resenting ‘Model First Lady’ Melania",
    "description": "USA Today published an op-ed on Tuesday that criticized \"haters\" for being harshly begrudging first lady Melania Trump.",
    "link": "https://dailycaller.com/2025/09/04/usa-today-op-ed-melania-trump/",
    "timestamp": "2025-09-04T17:51:07Z"
  },
  {
    "title": "RFK Jr. mentions DeKalb Officer David Rose, criticizes CDC during testimony",
    "description": "HHS Secretary Robert F. Kennedy Jr. defended his “Make America Healthy Again\" agenda, calling it a shift toward preventing chronic disease.",
    "link": "https://www.fox5atlanta.com/news/rfk-jr-mentions-dekalb-officer-david-rose-criticizes-cdc-during-testimony",
    "timestamp": "2025-09-04T17:50:52Z"
  },
  {
    "title": "Albanese and Trump about critical minerals and security",
    "description": "SYDNEY: Australian Prime Minister Anthony Albanese discussed opportunities for Australia and the United States to cooperate on critical minerals in a phone call with President Donald Trump",
    "link": "https://www.channelnewsasia.com/world/albanese-and-trump-about-critical-minerals-and-security-5333076",
    "timestamp": "2025-09-04T17:50:29Z"
  },
  {
    "title": "The Winklevoss Twins Are Behind Crypto's Next High-Profile IPO. What You Need to Know.",
    "description": "Crypto's next big initial public offering, the exchange Gemini, involves twins credited with being the world's first bitcoin billionaires: brothers Cameron...",
    "link": "https://www.investopedia.com/the-winklevoss-twins-are-behind-crypto-s-next-big-ipo-here-s-what-you-need-to-know-gemini-11803355",
    "timestamp": "2025-09-04T17:50:05Z"
  },
  {
    "title": "Robert F Kennedy Jr's hearing turns rancorous as Democrats press him on COVID vaccine changes",
    "description": "Health Secretary Robert F. Kennedy Jr. faced intense bipartisan scrutiny during a Senate hearing regarding turmoil at federal health agencies and controversial changes to COVID-19 vaccination policies. Contentious exchanges with senators from both parties hig…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/robert-f-kennedy-jrs-hearing-turns-rancorous-as-democrats-press-him-on-covid-vaccine-changes/articleshow/123704303.cms",
    "timestamp": "2025-09-04T17:50:03Z"
  },
  {
    "title": "Top 5 Most Stunning Moments From RFK Jr.’s Bombastic Senate Hearing: ‘Killing Millions!’",
    "description": "A Senate Finance Committee hearing with Robert F. Kennedy Jr. was filled with tense exchanges and heated incidents from almost the moment it started.\nThe post Top 5 Most Stunning Moments From RFK Jr.’s Bombastic Senate Hearing: ‘Killing Millions!’ first appea…",
    "link": "https://www.mediaite.com/media/news/top-5-most-stunning-moments-from-rfk-jr-s-bombastic-senate-hearing-killing-millions/",
    "timestamp": "2025-09-04T17:49:32Z"
  },
  {
    "title": "D.C. attorney general files suit over National Guard deployment",
    "description": "The District of Columbia has filed a lawsuit against President Donald Trump for bringing in National Guard soldiers to police its streets.",
    "link": "https://www.upi.com/Top_News/US/2025/09/04/Washington-DC-Attorney-General-Schwalb-lawsuit-National-Guard-police-Trump/2561757005443/",
    "timestamp": "2025-09-04T17:49:02Z"
  },
  {
    "title": "VIDEO -- 'What Is Enough?': Woman Punched by Career Criminal in Chicago Speaks Out",
    "description": "A man with a lengthy criminal history is accused of punching a woman in downtown Chicago on August 19, the news coming as President Donald Trump plans to crack down on the Democrat-run city's ongoing crime problem.\nThe post VIDEO — ‘What Is Enough?’: Woman Pu…",
    "link": "https://www.breitbart.com/crime/2025/09/04/video-what-is-enough-woman-punched-by-career-criminal-in-chicago-speaks-out/",
    "timestamp": "2025-09-04T17:48:24Z"
  },
  {
    "title": "Canada, US Holding ‘Technical’ Talks on Sectoral Tariffs, Minister Says",
    "description": "Canada and the US agreed to hold technical talks on sectoral tariffs after officials met with Commerce Secretary Howard Lutnick last week, said Canadian cabinet minister Dominic LeBlanc.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-us-holding-technical-talks-on-sectoral-tariffs-minister-says",
    "timestamp": "2025-09-04T17:48:24Z"
  },
  {
    "title": "Here’s what FBI agents took from John Bolton’s house in raid — and what charges he could face",
    "description": "Agents also confiscated two USB drives, a hard drive, four boxes of \"printed daily activities,\" and \"typed documents in folders labeled 'Trump I - IV'\"",
    "link": "https://nypost.com/2025/09/04/us-news/heres-what-fbi-agents-took-from-john-boltons-house-in-raid-and-what-charges-he-could-face/",
    "timestamp": "2025-09-04T17:47:46Z"
  },
  {
    "title": "Trump’s Latest Crypto Play Is His Biggest and Most Corrupt Yet",
    "description": "His family just made as much as $5 billion on a single token launch—while reshaping U.S. policy to keep the industry on their side.",
    "link": "https://slate.com/technology/2025/09/donald-trump-cryptocurrency-bitcoin-world-liberty-financial-wlfi.html",
    "timestamp": "2025-09-04T17:44:53Z"
  },
  {
    "title": "‘Somebody is going to die’: Judges whine, anonymously, that Supreme Court doesn’t ‘have our backs’",
    "description": "Complain that their decisions in their fight against the Trump agenda are being overturned",
    "link": "https://www.wnd.com/2025/09/somebody-is-going-die-judges-whine-anonymously-that/",
    "timestamp": "2025-09-04T17:43:52Z"
  },
  {
    "title": "Trump Expands His Wars — at Home and Abroad",
    "description": "The president is actively threatening to invade Chicago, and bombed a purported drug boat from Venezuela in international waters",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-expands-wars-venezuela-chicago-new-orleans-baltimore-1235421666/",
    "timestamp": "2025-09-04T17:43:38Z"
  },
  {
    "title": "Tariff instability and a break with China is hitting American companies hard, and homegrown manufacturer John Deere is no exception",
    "description": "President Donald Trump has claimed to support domestic manufacturing, but his tariff policies have already hit farmers—and by extension homegrown manufacturer John Deere. An economic battle with China has hit farmers’ pockets as soybean exports to a large buy…",
    "link": "https://biztoc.com/x/c435271e53b6ee92",
    "timestamp": "2025-09-04T17:43:19Z"
  },
  {
    "title": "As Trump pushes Supreme Court to uphold his tariffs, he signals trade deals will be defunct if he loses the case: ‘I guess we’d have to unwind them’",
    "description": "As President Donald Trump faces the potential for his tariffs to be struck down, he hinted the trade deals he had in place with partners such as South Korea and the European Union would unravel. He told reporters at the Oval Office on Wednesday the U.S. could…",
    "link": "https://biztoc.com/x/89dffad01047bcd5",
    "timestamp": "2025-09-04T17:43:02Z"
  }
]