[
  {
    "title": "These immigrants are in the US legally. Now they’re living in fear as Trump changes the rules",
    "description": "New Trump administration policies are creating fear and uncertainty for many immigrants who’ve been living legally in the US.",
    "link": "https://www.cnn.com/2025/02/14/us/immigration-refugees-trump-fears-cec/index.html",
    "timestamp": "2025-02-14T12:55:56Z"
  },
  {
    "title": "Trump, Harris, and the Art of the Interview",
    "description": "The ethics of the CBS interview furor.",
    "link": "https://www.cjr.org/the_media_today/trump_fcc_cbs_lawsuit_harris_60_minutes_ethics.php",
    "timestamp": "2025-02-14T12:55:00Z"
  },
  {
    "title": "Trump’s State Department to Designate Specific Cartels as Foreign Terrorist Groups",
    "description": "Trump administration is preparing to designate a series of Mexican drug cartels and two from Central and South America as foreign terrorist organizations. The move comes as Mexico continues to experience unprecedented levels of violence, including the widespr…",
    "link": "https://freerepublic.com/focus/f-news/4297537/posts",
    "timestamp": "2025-02-14T12:54:50Z"
  },
  {
    "title": "McConnell tests the strengths and limits of his power opposing a trio of Trump's Cabinet nominees",
    "description": "No longer in charge, Sen. Mitch McConnell has been speaking his mind",
    "link": "https://abcnews.go.com/Politics/wireStory/mcconnell-tests-strengths-limits-power-opposing-trio-trumps-118818641",
    "timestamp": "2025-02-14T12:54:27Z"
  },
  {
    "title": "McConnell tests the strengths and limits of his power opposing a trio of Trump's Cabinet nominees",
    "description": "No longer in charge, Sen. Mitch McConnell has been speaking his mind",
    "link": "https://abcnews.go.com/US/wireStory/mcconnell-tests-strengths-limits-power-opposing-trio-trumps-118818640",
    "timestamp": "2025-02-14T12:54:26Z"
  },
  {
    "title": "US aid cuts risk riots, breakouts at Islamic State-linked camps in Syria",
    "description": "(Reuters) - Moves by President Donald Trump's administration to cut U.S. foreign aid funding risk destabilising two camps in northeastern Syria holding tens of thousands of people accused of affiliation with the Islamic State, aid officials, local authorities…",
    "link": "https://www.thestar.com.my/news/world/2025/02/14/us-aid-cuts-risk-riots-breakouts-at-islamic-state-linked-camps-in-syria",
    "timestamp": "2025-02-14T12:54:00Z"
  },
  {
    "title": "Engadget Podcast: What's up, DOGE? Diving into Elon Musk's hack on America",
    "description": "We joked about \"President Musk\" shortly after Donald Trump took office, but it turns out that wasn't far from the truth. Over the past few weeks, Elon Musk and his DOGE team wasted no time in trying to dismantle the American administrative state. They've ille…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176244935",
    "timestamp": "2025-02-14T12:52:40Z"
  },
  {
    "title": "Vance compares EU politicians to Soviet leaders",
    "description": "The US vice president has argued censorship disguised as a fight against disinfo is not a solution for shifting public sentiment Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612706-vance-eu-soviet-censorship/",
    "timestamp": "2025-02-14T12:52:34Z"
  },
  {
    "title": "Goldman Sachs Is Quietly Betting Billions On Bitcoin—Is Ripple’s XRP Next As Its Price Surges?",
    "description": "Wall Street giant Goldman Sachs has quietly confirmed its bought around $2 billion of bitcoin...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/02/14/goldman-sachs-is-quietly-betting-billions-on-bitcoin-and-ethereum-amid-price-swings/",
    "timestamp": "2025-02-14T12:52:24Z"
  },
  {
    "title": "Will Donald Trump deport Prince Harry back to England? Insiders claim, 'president would relish an opportunity'",
    "description": "Prince Harry could face deportation due to possible false information on his visa application. President Trump, reportedly holding a grudge against the royals, might seize the opportunity if Harry's past drug admissions affect his visa status. The Heritage Fo…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/will-donald-trump-deport-prince-harry-back-to-england-insiders-claim-president-would-relish-an-opportunity/articleshow/118249475.cms",
    "timestamp": "2025-02-14T12:51:25Z"
  },
  {
    "title": "As Elon Musk Meets PM Modi, 3 Things On His Wishlist From India",
    "description": "During Mr Modi&#039;s visit to the U.S. to meet President Donald Trump, the two men met to discuss various issues, including space, mobility, technology, and innovation.",
    "link": "https://www.ndtv.com/world-news/as-elon-musk-meets-pm-narendra-modi-3-things-on-his-wishlist-from-india-7710762",
    "timestamp": "2025-02-14T12:51:06Z"
  },
  {
    "title": "Steve Bannon Issues Medicaid Warning to Elon Musk",
    "description": "Musk has suggested he could cut \"at least $2 trillion\" from U.S. government spending by eradicating \"waste.\"",
    "link": "https://www.newsweek.com/steve-bannon-medicaid-warning-elon-musk-doge-2031120",
    "timestamp": "2025-02-14T12:50:36Z"
  },
  {
    "title": "Europe can’t assume US troop presence ‘will last forever’: Hegseth",
    "description": "US Defense Secretary Pete Hegseth on Friday warned NATO allies in Europe against assuming that the American troop presence on the continent would “last forever”, as he urged them to spend more on defence. “Now is the time to invest because you can’t make an a…",
    "link": "https://www.digitaljournal.com/world/europe-cant-assume-us-troop-presence-will-last-forever-hegseth/article",
    "timestamp": "2025-02-14T12:50:18Z"
  },
  {
    "title": "Sources: Mark Zuckerberg's overtures to President Trump have unsettled employees and are part of an effort to shift antitrust scrutiny off Meta and onto Apple",
    "description": "Mark Zuckerberg kicked off 2025 with an Instagram video that outlined his vision for what he called restoring \"free expression\" to Meta's platforms and for working with President Donald Trump to push back on governments Zuckerberg said have gone after America…",
    "link": "https://biztoc.com/x/2168a4514986543a",
    "timestamp": "2025-02-14T12:48:39Z"
  },
  {
    "title": "Hamas confirms to free three Israeli hostages in total Saturday",
    "description": "Hamas's armed wing confirmed on Friday that it would release three Israeli hostages from the Gaza Strip on Saturday, including one that has been held by militant Palestinian group Islamic Jihad.",
    "link": "https://www.hurriyetdailynews.com/hamas-confirms-to-free-three-israeli-hostages-in-total-saturday-205829",
    "timestamp": "2025-02-14T12:48:28Z"
  },
  {
    "title": "U.S. Anthem Booed Before Americans' 4 Nations Face-Off Game In Montreal",
    "description": "Fans across Canada have booed the anthem at NHL and NBA games after Donald Trump threatened tariffs against the country.",
    "link": "https://www.huffpost.com/entry/us-anthem-booed-montreal_n_67af3965e4b014c4688d73e0",
    "timestamp": "2025-02-14T12:48:18Z"
  },
  {
    "title": "Trump's apparent concessions on Ukraine NATO ties, territory 'a mistake', German defence minister says",
    "description": "Germany's defence minister said it was a mistake for U.S. President Donald Trump to take the bargaining chips of Ukrainian NATO membership and territorial...",
    "link": "https://www.yahoo.com/news/trumps-apparent-concessions-ukraine-nato-124702886.html",
    "timestamp": "2025-02-14T12:47:02Z"
  },
  {
    "title": "Where US adults think the government is spending too much, according to AP-NORC polling",
    "description": "Many U.S. adults believe the federal government is overspending",
    "link": "https://abcnews.go.com/US/wireStory/us-adults-government-spending-ap-norc-polling-118817706",
    "timestamp": "2025-02-14T12:46:31Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to the tail end of the week and, at sundown, the beginning of Cat Sabbath. It’s Friday, February 14, and VALENTINE’S DAY. Be sure to smooch and give gifts to your special someone.  Here’s Simon’s Cat trying to get a valentine (we haven’t had Simon’s C…",
    "link": "https://whyevolutionistrue.com/2025/02/14/friday-hili-dialogue-513/",
    "timestamp": "2025-02-14T12:45:49Z"
  },
  {
    "title": "Europe must respond to Trump 'electroshock', says Macron (Financial Times)",
    "description": "Financial Times:\nEurope must respond to Trump ‘electroshock’, says Macron  —  French president tells Financial Times that continent should ‘muscle up’ and secure its own future  —  Emmanuel Macron has described Donald Trump's return as an “electroshock” that …",
    "link": "https://www.memeorandum.com/250214/p16",
    "timestamp": "2025-02-14T12:45:04Z"
  },
  {
    "title": "Serbia is facing its largest-ever protest movement – why is Europe looking away?",
    "description": "The EU has mostly stayed silent since the protests began.",
    "link": "https://theconversation.com/serbia-is-facing-its-largest-ever-protest-movement-why-is-europe-looking-away-249388",
    "timestamp": "2025-02-14T12:44:25Z"
  },
  {
    "title": "Are Veterans' Benefits Being Cut? Trump's VA Cuts Explained",
    "description": "Staffing reductions in the Department of Veterans Affairs have prompted concerns that veterans' benefits may be cut.",
    "link": "https://www.newsweek.com/are-veterans-benefits-being-cut-trump-va-cuts-explained-2031047",
    "timestamp": "2025-02-14T12:44:14Z"
  },
  {
    "title": "Ready To Talk To Russia After Reaching 'Common Position' With US: Zelensky",
    "description": "Ukrainian President Volodymyr Zelensky said Friday he was ready for direct talks with Russia once Kyiv reached a common position with the United States and Europe on how to end the three-year war.",
    "link": "https://www.ndtv.com/world-news/ready-to-talk-to-russia-after-reaching-common-position-with-us-europe-zelensky-7710679",
    "timestamp": "2025-02-14T12:42:48Z"
  },
  {
    "title": "Judge Amir Ali, One of Biden's Final Appointments, Thwarts Donald Trump",
    "description": "One of President Joe Biden's final judicial nominees has put a temporary injunction on Donald Trump's attempts to dismantle the United States Agency for International Development (USAID).\nNewsweek sought email comment from USAID and Secretary of State Marco R…",
    "link": "https://biztoc.com/x/5ae99d7a7af40a74",
    "timestamp": "2025-02-14T12:42:38Z"
  },
  {
    "title": "Judge Amir Ali, One of Biden's Final Appointments, Thwarts Donald Trump",
    "description": "Ali has placed a temporary injunction on President Donald Trump's order to defund USAID.",
    "link": "https://www.newsweek.com/donald-trump-usaid-defunding-president-order-federal-court-challenge-aids-coalition-2031066",
    "timestamp": "2025-02-14T12:42:15Z"
  },
  {
    "title": "Erdoğan says US 'on wrong track' in Gaza",
    "description": "President Recep Tayyip Erdoğan has criticized the U.S. stance on Gaza, accusing it of being \"on the wrong track\" that could exacerbate tensions in the Middle East.",
    "link": "https://www.hurriyetdailynews.com/erdogan-says-us-on-wrong-track-in-gaza-205828",
    "timestamp": "2025-02-14T12:42:03Z"
  },
  {
    "title": "A Dangerous Bromance Is Back - It's already a win-win for the Russian president (Dan Rather/Steady)",
    "description": "Dan Rather / Steady:\nA Dangerous Bromance Is Back  —  It's already a win-win for the Russian president  —  The blitzkrieg of orders and directives coming from the White House is head-spinning.  It is meant to stun us into stupefaction and distract us from all…",
    "link": "https://www.memeorandum.com/250214/p14",
    "timestamp": "2025-02-14T12:40:00Z"
  },
  {
    "title": "Ukraine and Russia Exchange Claims on Chernobyl Sarcophagus Drone Strike",
    "description": "Drone with a high-explosive warhead hit the protective containment shell of the Chernobyl Nuclear Power Plant overnight, Kyiv says.\nThe post Ukraine and Russia Exchange Claims on Chernobyl Sarcophagus Drone Strike appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/02/14/ukraine-and-russia-exchange-claims-on-chernobyl-sarcophagus-drone-strike/",
    "timestamp": "2025-02-14T12:38:06Z"
  },
  {
    "title": "Trump Tramples Over Ideological Soulmate Milei",
    "description": "“Argentine President Javier Milei’s bromance with Donald Trump is hitting a rough patch,” Bloomberg reports. “Argentina has some of the highest levies in the world on US goods, which means it risks becoming one of",
    "link": "https://politicalwire.com/2025/02/14/trump-tramples-over-ideological-soulmate-milei/",
    "timestamp": "2025-02-14T12:38:00Z"
  },
  {
    "title": "Federal employee layoffs begin after Trump and Musk order cuts",
    "description": "The United States government is beginning a new wave of mass firings following President Donald Trump and Elon Musk’s order for sweeping cuts. It comes as the Trump administration advised all federal agencies to fire probationary employees, workers who have b…",
    "link": "https://www.today.com/video/us-government-begins-mass-firings-after-trump-musk-orders-231970373536",
    "timestamp": "2025-02-14T12:37:02Z"
  },
  {
    "title": "India cuts customs duty on bourbon whiskey to 50%",
    "description": "India has reduced import duty on bourbon whiskey to 50 per cent as part of its efforts to negotiate a major trade deal with the US. The reduction came just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump, aiming to increase bilate…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/liquor/india-cuts-customs-duty-on-bourbon-whiskey-to-50/articleshow/118249204.cms",
    "timestamp": "2025-02-14T12:37:01Z"
  },
  {
    "title": "US Judge Temporarily Lifts Funding Freeze On Aid Programs Ordered By Trump",
    "description": "A federal judge has ordered a temporary lift on a freeze on funding to US aid and development programs ordered by President Donald Trump&#039;s administration, court documents seen by AFP on Friday showed.",
    "link": "https://www.ndtv.com/world-news/us-judge-temporarily-lifts-funding-freeze-on-aid-programs-ordered-by-trump-7710625",
    "timestamp": "2025-02-14T12:36:27Z"
  },
  {
    "title": "Eden: King Charles ‘is in no rush’ for the Sussexes ‘to return to his kingdom’",
    "description": "Last weekend, the NY Post published an exclusive with Donald Trump in which he discussed the Heritage Foundation’s two-year-long attempt to get their hands on Prince Harry’s visa records. Heritage is partly running this Trump administration, and I was surpris…",
    "link": "https://www.celebitchy.com/909275/eden_king_charles_is_in_no_rush_for_the_sussexes_to_return_to_his_kingdom/",
    "timestamp": "2025-02-14T12:35:40Z"
  },
  {
    "title": "Microsoft Follows Google on a Controversial Decision",
    "description": "Microsoft has updated its Bing Maps service to rename the \"Gulf of Mexico\" to the \"Gulf of America\" for users in the United States. This change aligns Bing Maps with recent updates […]\nThank you for being a Ghacks reader. The post Microsoft Follows Google on …",
    "link": "https://www.ghacks.net/2025/02/14/microsoft-follows-google-on-a-controversial-decision/",
    "timestamp": "2025-02-14T12:34:43Z"
  },
  {
    "title": "Canadian hockey fans boo Team USA players, national anthem at 4 Nations tournament in Montreal",
    "description": "Canadian hockey fans booed members of Team USA and the \"Star-Spangled Banner\" during the team's first game of the 4 Nations Face-Off on Thursday in Montreal.",
    "link": "https://www.foxnews.com/sports/canadian-hockey-fans-boo-team-usa-players-national-anthem-4-nations-tournament-montreal",
    "timestamp": "2025-02-14T12:33:57Z"
  },
  {
    "title": "Some DEI programs aren’t worth defending",
    "description": "Donald Trump speaks to reporters about diversity, equity, and inclusion policies on January 30. | Hu Yousong/Xinhua via Getty Images\nDonald Trump did not campaign on a promise to end the Pentagon’s celebration of Black History Month. Nor did the Republican ai…",
    "link": "https://biztoc.com/x/f7bf6b5094307466",
    "timestamp": "2025-02-14T12:32:36Z"
  },
  {
    "title": "Canada’s digital services tax emerges as major thorn in tariff battle",
    "description": "As U.S. President Donald Trump signed an executive order for reciprocal tariffs, he took aim at Canada's digital services tax. Read more.",
    "link": "https://financialpost.com/news/economy/canada-trump-not-good-place",
    "timestamp": "2025-02-14T12:31:31Z"
  },
  {
    "title": "AI could be used for terrorist attacks, former Google CEO warns",
    "description": "Former Google CEO Eric Schmidt has expressed fears about AI being used to carry out terrorist attacks. More details here.",
    "link": "https://www.androidheadlines.com/2025/02/ai-could-be-used-for-terrorist-attacks-former-google-ceo-warns.html",
    "timestamp": "2025-02-14T12:30:54Z"
  },
  {
    "title": "History sort of repeats itself with White House media ban",
    "description": "In the wake of the alarming story of The Associated Press being banned from news events inside the Oval Office because President Donald Trump is throwing a hissy fit over […]\nThe post History sort of repeats itself with White House media ban appeared first on…",
    "link": "https://www.poynter.org/commentary/2025/history-sort-of-repeats-itself-with-white-house-media-ban/",
    "timestamp": "2025-02-14T12:30:50Z"
  },
  {
    "title": "Alternatives to Trump’s Russia Appeasement",
    "description": "By adopting a strategy toward Russia that is ominously reminiscent of British and French appeasement of Nazi Germany in 1938, US President Donald Trump has all but assured that Europe will not achieve peace for our time. This time, however, France and Britain…",
    "link": "https://www.project-syndicate.org/commentary/trump-russia-appeasement-in-ukraine-france-britain-still-have-options-by-harold-james-2025-02",
    "timestamp": "2025-02-14T12:30:21Z"
  },
  {
    "title": "EXCLUSIVE: Prince Harry 'Still Teetering on Edge of Exile' Under Donald Trump — As President 'Secretly Holds Grudge Against ALL Royals'",
    "description": "Prince Harry is said to be facing possible exile under Donald Trump as his visa drugs scandal controversy keeps escalating.",
    "link": "https://radaronline.com/p/prince-harry-facing-exile-trump-visa-drugs-scandal/",
    "timestamp": "2025-02-14T12:30:00Z"
  },
  {
    "title": "Trump thinks antagonising China will help save the US economy. He couldn’t be more wrong | Melanie Brusseler",
    "description": "Politicians believe tariffs will revive a lost era of American manufacturing. But they won’t improve people’s everyday lives\nDonald Trump appears to be testing the boundaries of the power he can accumulate and then exert upon his allies, with a singular ambit…",
    "link": "https://biztoc.com/x/b502590c70ce2017",
    "timestamp": "2025-02-14T12:28:21Z"
  },
  {
    "title": "Trump tariff VAT threat raises fears of hit to UK",
    "description": "Trump tariff VAT threat raises fears of hit to UK\nConcerns are growing the UK could be hit with higher US trade taxes after President Donald Trump announced he would target VAT in his latest move.\nTrump has instructed his staff to develop custom \"reciprocal t…",
    "link": "https://biztoc.com/x/953780157dc57bf0",
    "timestamp": "2025-02-14T12:28:20Z"
  },
  {
    "title": "UK Sanctions Russian Officials In Latest Kremlin Crackdown",
    "description": "Britain unveiled Friday sanctions against four Russian officials and two subsidiaries of Russia&#039;s state-owned civil nuclear energy company, in the &quot;latest crackdown on the Kremlin&quot; following its full-scale invasion of Ukraine.",
    "link": "https://www.ndtv.com/world-news/uk-sanctions-russian-officials-in-latest-kremlin-crackdown-7710551",
    "timestamp": "2025-02-14T12:27:51Z"
  },
  {
    "title": "Trump administration begins sweeping layoffs with probationary workers, warns of larger cuts to come",
    "description": "The Office of Personnel Management told agencies on Thursday to lay off all probationary employees.",
    "link": "https://www.bostonherald.com/2025/02/14/trump-administration-federal-workers-layoffs/",
    "timestamp": "2025-02-14T12:27:03Z"
  },
  {
    "title": "Trump administration begins sweeping layoffs with probationary workers, warns of larger cuts to come",
    "description": "The Office of Personnel Management told agencies on Thursday to lay off all probationary employees.",
    "link": "https://www.denverpost.com/2025/02/14/trump-administration-federal-workers-layoffs/",
    "timestamp": "2025-02-14T12:27:03Z"
  },
  {
    "title": "Seth Meyers Skewers Trump’s Rambling Speech With A Perfect Pop Culture Burn",
    "description": "Seth Meyers Skewers Trump’s Rambling Speech With A Perfect Pop Culture Burnhuffpost.com",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-question_n_67af2ac1e4b0513a8d76cb8a",
    "timestamp": "2025-02-14T12:24:00Z"
  },
  {
    "title": "Trump’s Next Order Should Undo Biden’s Politicization Of ‘Science’-Based Agencies",
    "description": "President Trump is off to a great start in undoing the harms of the last administration. Undoing Biden’s 'scientific integrity' amendments should be one of his next priorities.",
    "link": "https://thefederalist.com/2025/02/14/trumps-next-order-should-undo-bidens-politicization-of-science-based-agencies/",
    "timestamp": "2025-02-14T12:23:06Z"
  },
  {
    "title": "Donald Trump Hangs Mugshot Outside Oval Office",
    "description": "President Donald Trump's mugshot, one of the most infamous photos of the president which became a symbol of defiance for Trump and his supporters, now proudly hangs in the hallway outside the Oval Office.\nThe new addition was first spotted during Trump's meet…",
    "link": "https://biztoc.com/x/247f253853b34d35",
    "timestamp": "2025-02-14T12:22:00Z"
  },
  {
    "title": "Trump tariff VAT threat raises fears of hit to UK",
    "description": "The surprise inclusion of VAT to calculate tariffs prompts questions over the impact on British businesses.",
    "link": "https://www.bbc.com/news/articles/c863zd9zz42o",
    "timestamp": "2025-02-14T12:20:22Z"
  },
  {
    "title": "Canada’s TC Energy tops quarterly profit estimates on Mexico pipeline strength",
    "description": "Canadian pipeline operator TC Energy TRP-T beat estimates for fourth-quarter profit on Friday, helped by strength in Mexican operations.\nThe results come amid an uncertain future for the country’s energy sector that faces the threat of steep U.S. tariffs. Pre…",
    "link": "https://biztoc.com/x/5b4a379a278656b5",
    "timestamp": "2025-02-14T12:18:19Z"
  },
  {
    "title": "Trump’s FBI Reforms Need To Include Ending Its Data Distortions On Crime",
    "description": "The FBI doesn't just have a transparency problem. They're actually distorting data to skew important crime statistics.",
    "link": "https://thefederalist.com/2025/02/14/trumps-fbi-reforms-need-to-include-ending-its-data-distortions-on-crime/",
    "timestamp": "2025-02-14T12:17:28Z"
  },
  {
    "title": "Hamas names hostages to be released on Saturday",
    "description": "Palestinian militant groups in Gaza said they would release hostages Iair Horn, US-Israeli Sagui Dekel-Chen and Russian-Israeli Alexandre Sasha Troufanov on Saturday, in accordance with the terms of the ceasefire with Israel.",
    "link": "https://www.independent.ie/world-news/middle-east/hamas-names-hostages-to-be-released-on-saturday/a586879656.html",
    "timestamp": "2025-02-14T12:15:58Z"
  },
  {
    "title": "It Took Trump Only Twenty-four Days to Sell Out Ukraine (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nIt Took Trump Only Twenty-four Days to Sell Out Ukraine  —  Amid the chaos in Washington, the President's phone call with Putin has Moscow filled with glee.  —  Has Vladimir Putin ever had a better few days in Washington?  Donal…",
    "link": "https://www.memeorandum.com/250214/p13",
    "timestamp": "2025-02-14T12:15:01Z"
  },
  {
    "title": "Donald Trump Hangs Mugshot Outside Oval Office",
    "description": "The framed mugshot was seen hanging in the hallway outside the Oval Office during the president's meeting with Indian Prime Minister Narendra Modi.",
    "link": "https://www.newsweek.com/donald-trump-hangs-mugshot-oval-office-2031129",
    "timestamp": "2025-02-14T12:14:58Z"
  },
  {
    "title": "5 Things RFK Can Do To Make America Healthy Again",
    "description": "President Donald Trump's new secretary of HHS offers Americans a generational opportunity to reinvigorate the nation's health.",
    "link": "https://thefederalist.com/2025/02/14/5-things-rfk-can-do-to-make-america-healthy-again/",
    "timestamp": "2025-02-14T12:14:03Z"
  },
  {
    "title": "Encyclopedia Britannica refuses to rename the Gulf of Mexico, and the reason it cited is going viral",
    "description": "The changing of the name of the Gulf of Mexico to the 'Gulf of America' has been a hot topic for the last month after Donald Trump became the US President. Now, an interesting incident has occurred where Encyclopedia Britannica is refusing to alter the name a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/encyclopedia-britannica-refuses-to-rename-the-gulf-of-mexico-and-the-reason-it-cited-is-going-viral/articleshow/118248526.cms",
    "timestamp": "2025-02-14T12:13:33Z"
  },
  {
    "title": "Tariffs can be useful, harmful, and as we may all soon learn, catastrophic",
    "description": "MIDDLE ISRAEL: One of Trump’s most promising election vows was to “end wars.” Well, a tariff rampage is no way to end wars. It is, however, a way to start them.",
    "link": "https://www.jpost.com/international/article-842090",
    "timestamp": "2025-02-14T12:13:11Z"
  },
  {
    "title": "Hamas names three Israeli hostages to be released on Saturday",
    "description": "The three hostages due to be released by Hamas on Saturday as part of its ceasefire deal with Israel have been named.",
    "link": "https://news.sky.com/story/hamas-names-three-israeli-hostages-to-be-released-on-saturday-13309173",
    "timestamp": "2025-02-14T12:13:00Z"
  },
  {
    "title": "Connect the Dots: Trump, Public Health, and the Third World ⋆ Brownstone Institute",
    "description": "Despite the fact that Trump’s funding freeze could negatively impact PEPFAR, I don’t believe that he is going to let this program languish.",
    "link": "https://brownstone.org/articles/connect-the-dots-trump-public-health-and-the-third-world/",
    "timestamp": "2025-02-14T12:12:52Z"
  },
  {
    "title": "Defence Minister: Nato troops will be stationed in Rovaniemi, Sodankylä",
    "description": "Finland's presence in Nato is progressing well, according to Defence Minister Antti Häkkänen (NCP).",
    "link": "https://yle.fi/a/74-20143793",
    "timestamp": "2025-02-14T12:12:12Z"
  },
  {
    "title": "China Reacts to Trump and Putin's Ukraine War Talks",
    "description": "China said it welcomes increased U.S.-Russia dialogue following President Donald Trump's conversation with Russian counterpart Vladimir Putin on ending Moscow's war in Ukraine.\nNewsweek reached out to the White House and Russian Foreign Ministry with written …",
    "link": "https://biztoc.com/x/2c49a117d4fe8c8d",
    "timestamp": "2025-02-14T12:11:58Z"
  },
  {
    "title": "What are reciprocal tariffs? Trump's trade agenda explained",
    "description": "On Thursday, US President Donald Trump ordered his officials to develop reciprocal tariffs on imports to the United States, keeping to an \"eye for an eye\" election campaign promise in world trade.\n\"I have decided for purposes of fairness, that I will charge a…",
    "link": "https://biztoc.com/x/65aff9ae55ec9bdd",
    "timestamp": "2025-02-14T12:11:41Z"
  },
  {
    "title": "Fans in Montreal boo U.S. anthem ahead of 4 Nations Face-Off game",
    "description": "Fans in Montreal booed the U.S. national anthem prior to the Americans’ first game of the 4 Nations Face-Off against Finland. Forward Matthew Tkachuk had a simple reaction. \"I didn’t like it, and that’s all I got,\" Tkachuk said.",
    "link": "https://www.cbc.ca/news/canada/montreal/montreal-bell-centre-us-finland-1.7459171",
    "timestamp": "2025-02-14T12:11:20Z"
  },
  {
    "title": "As Target and other retailers drop DEI programs, Black founders could face tougher battle to get and stay on shelves",
    "description": "Some retailers have walked back supplier programs intended to address the additional hurdles that Black and minority founders face, including funding.",
    "link": "https://www.cnbc.com/2025/02/14/target-walmart-dei-decisions-could-hurt-black-founders.html",
    "timestamp": "2025-02-14T12:10:58Z"
  },
  {
    "title": "American-Israeli Among Hostages to Be Released Saturday, Hamas Says",
    "description": "US-Israeli Sagui Dekel-Chen among three hostages to be released on Saturday, Hamas has announced.",
    "link": "https://www.newsweek.com/american-israeli-among-hostages-released-saturday-hamas-says-2031132",
    "timestamp": "2025-02-14T12:09:51Z"
  },
  {
    "title": "Hamas: Sagui Dekel-Chen, Sasha Troufanov, and Yair Horn to be released",
    "description": "Despite Israel's threat earlier in the week calling for the release of all hostages by Saturday at noon, Israel accepted Hamas's notification that it will release only three hostages, among them, US and Russian citizens.",
    "link": "https://www.israelnationalnews.com/news/403935",
    "timestamp": "2025-02-14T12:09:12Z"
  },
  {
    "title": "Zuckerberg's rightward policy shift puts Meta staffers on edge, targets Apple",
    "description": "Mark Zuckerberg kicked off 2025 with an Instagram video that outlined his vision for what he called restoring \"free expression\" to Meta's platforms and for working with President Donald Trump to push back on governments Zuckerberg said have gone after America…",
    "link": "https://biztoc.com/x/e4ea27c1f59a3f20",
    "timestamp": "2025-02-14T12:08:07Z"
  },
  {
    "title": "Trump May Have To Grapple with Returning Inflation",
    "description": "More than one issue boosted Donald Trump ahead of main rival Kamala Harris and back into the White House, but inflation was key among them. A federal spending spree diminished the purchasing power of the dollar and sent prices higher, inducing sticker shock a…",
    "link": "https://biztoc.com/x/53024fd9edf1f640",
    "timestamp": "2025-02-14T12:07:52Z"
  },
  {
    "title": "Trump, pensions, health care among pressure points as Gov. JB Pritzker crafts state budget",
    "description": "Uncertainty in federal funding under President Donald Trump's administration has made a tough state budget season even more difficult for Gov. JB Pritzker and Illinois Democrats who control Springfield.",
    "link": "https://chicago.suntimes.com/springfield/2025/02/14/jb-pritzker-budget-proposal-donald-trump",
    "timestamp": "2025-02-14T12:07:50Z"
  },
  {
    "title": "Trump orders mass firings and grocery stores limit egg purchases: Morning Rundown",
    "description": "Mass firings of probationary federal workers begins, affecting potentially hundreds of thousands of people.",
    "link": "https://www.nbcnews.com/news/trump-mass-firings-grocery-limit-egg-morning-rundown-rcna192177",
    "timestamp": "2025-02-14T12:07:25Z"
  },
  {
    "title": "Prime Minister Modi invites US universities to open campus in India during Trump meeting",
    "description": "India and the US strengthen higher education collaborations, increase study abroad opportunities, and explore premier American college campuses in India.",
    "link": "https://www.thehindubusinessline.com/news/education/prime-minister-modi-invites-us-universities-to-open-campus-in-india-during-trump-meeting/article69219305.ece",
    "timestamp": "2025-02-14T12:06:45Z"
  },
  {
    "title": "14 States Sue Trump And Musk, Challenge Constitutionality Of DOGE",
    "description": "The lawsuit, led by the Democratic attorneys general from Arizona, Michigan, California, Connecticut, Hawaii, Maryland, Massachusetts, Minnesota, Nevada, Oregon, Rhode Island, Vermont, Washington, and New Mexico, argue that Trump violated the Appointments Cla…",
    "link": "https://www.ibtimes.com/14-states-sue-trump-musk-challenge-constitutionality-doge-3763707",
    "timestamp": "2025-02-14T12:06:01Z"
  },
  {
    "title": "TikTok is back on the App Store and Google Play Store – here’s what could happen next",
    "description": "TikTok has reappeared on the iOS App Store and Google Play Store following its banning – but the platform might not stick around for too long",
    "link": "https://www.techradar.com/computing/social-media/tiktok-is-back-on-the-app-store-and-google-play-store-heres-what-could-happen-next",
    "timestamp": "2025-02-14T12:06:01Z"
  },
  {
    "title": "Abolish property taxes? DeSantis endorses the idea and explains how it could be done in Florida",
    "description": "Florida Gov. Ron DeSantis endorsed the idea of abolishing property taxes in Florida, noting that it could be accomplished via a constitutional amendment.",
    "link": "https://www.foxnews.com/politics/abolish-property-taxes-desantis-endorses-idea-explains-how-could-done-florida",
    "timestamp": "2025-02-14T12:05:28Z"
  },
  {
    "title": "China Reacts to Trump and Putin's Ukraine War Talks",
    "description": "China has offered to host a summit between the two leaders—without the participation of Ukraine—the WSJ reported.",
    "link": "https://www.newsweek.com/china-reacts-trump-putin-us-russia-ukraine-war-peace-talks-zelensky-2031001",
    "timestamp": "2025-02-14T12:05:22Z"
  },
  {
    "title": "Vance says 'military tools' could be used to force Russia to agree a Ukraine deal",
    "description": "Vice President JD Vance has warned that Russia could face more sanctions and even \"military tools\" if it refuses to agree a deal ensuring Ukraine's long-term independence.",
    "link": "https://www.nbcnews.com/news/world/vance-ukraine-russia-deal-trump-military-tools-rcna192182",
    "timestamp": "2025-02-14T12:05:17Z"
  },
  {
    "title": "How a Chesterfield man launched a meme coin worth millions on a ‘crazy’ crypto ride",
    "description": "Ron Branstetter created the “Unicorn Fart Dust” meme coin to prove a point. What happened next surprised him.",
    "link": "https://www.stltoday.com/news/local/metro/how-a-chesterfield-man-launched-a-meme-coin-worth-millions-on-a-crazy-crypto-ride/article_53d5c0f0-e828-11ef-b9f9-1f8aa9e2decc.html",
    "timestamp": "2025-02-14T12:05:00Z"
  },
  {
    "title": "Trump-Backed WLFI Spends Millions In $USDC To Buy $wBTC, $MOVE, Taps Into Staking",
    "description": "WLFI moved some of its crypto holdings for staking and lending, and swapped $USDC for $wBTC and $MOVE – actions in line with its recent announcement regarding a digital asset reserve that includes various cryptocurrencies.",
    "link": "https://www.ibtimes.com/trump-backed-wlfi-spends-millions-usdc-buy-wbtc-move-taps-staking-3763710",
    "timestamp": "2025-02-14T12:03:01Z"
  },
  {
    "title": "Ukraine conflict and NATO challenges: Munich Security Conference kicks off: LIVE UPDATES",
    "description": "The Munich Security Conference 2025 has commenced, with global leaders focusing on the Ukraine conflict and other key security challenges Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612705-munich-security-conference-kicks-off/",
    "timestamp": "2025-02-14T12:02:47Z"
  },
  {
    "title": "WSJ Mischaracterizes Vance Comments on Russia Ahead of Munich Security Conference",
    "description": "Trump looking forward to fundamentally productive negotiation with Russia, JD Vance said, in comments mischaracterised as a threat of war.\nThe post WSJ Mischaracterizes Vance Comments on Russia Ahead of Munich Security Conference appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/02/14/wsj-mischaracterizes-vance-comments-on-russia-ahead-of-munich/",
    "timestamp": "2025-02-14T12:02:46Z"
  },
  {
    "title": "Inheritance tax hits chopping block as more than 200 Republicans push for repeal",
    "description": "FIRST ON FOX: Republican lawmakers are mounting a massive effort to repeal the federal inheritance tax, colloquially known as the \"death tax.\" Rep. Randy Feenstra, R-Iowa, is leading more than 170 House Republicans on the \"Death Tax Repeal Act,\" which is also…",
    "link": "https://freerepublic.com/focus/f-chat/4297529/posts",
    "timestamp": "2025-02-14T12:02:35Z"
  },
  {
    "title": "The key question for Democrats hoping to take down Trump",
    "description": "Sen. Elizabeth Warren speaks during a protest against President Donald Trump and DOGE’s Elon Musk’s anticipated plan to close the Consumer Financial Protection Bureau in front of the CFPB headquarters in Washington on February 10, 2025. | Saul Loeb/AFP via Ge…",
    "link": "https://biztoc.com/x/2737fe05a204e49d",
    "timestamp": "2025-02-14T12:02:01Z"
  },
  {
    "title": "JPMorgan Chase CEO calls for Washington to rethink financial regulations",
    "description": "During a meeting with Republican lawmakers and other top bank CEOs on whether big lenders are ‘debanking’ certain customers, JPMorgan Chase CEO Jamie Dimon emphasised the need to step back and reassess the financial regulations governing the banking industry.",
    "link": "https://www.finextra.com/newsarticle/45511/jpmorgan-chase-ceo-calls-for-washington-to-rethink-financial-regulations",
    "timestamp": "2025-02-14T12:01:00Z"
  },
  {
    "title": "Coca-Cola, PepsiCo Planning to Comply With Trump’s DEI Policy",
    "description": "Coca-Cola Co. and PepsiCo Inc., both government contractors, are preparing to comply with President Donald Trump’s executive order banning diversity, equity and inclusion programs, according to people familiar with the matter. Coca-Cola, which provides bevera…",
    "link": "https://www.insurancejournal.com/news/national/2025/02/14/812033.htm",
    "timestamp": "2025-02-14T12:00:42Z"
  },
  {
    "title": "The REAL ID Deadline is Coming Up: What to Know Before May 7",
    "description": "In less than 3 months, any traveler 18 or older boarding a domestic flight will need to present either a REAL ID driver’s license, state ID card, passport or other federally-approved document.",
    "link": "https://www.kqed.org/news/12027050/apply-for-real-id-deadline-may-7-can-i-fly-without",
    "timestamp": "2025-02-14T12:00:38Z"
  },
  {
    "title": "On YouTube, Living Vicariously Through Pregnancy Announcements",
    "description": "American women are having fewer and fewer children. But on social media, a baby boom reigns.",
    "link": "https://www.newsweek.com/youtube-pregnancy-child-fertility-rate-social-media-2029649",
    "timestamp": "2025-02-14T12:00:30Z"
  },
  {
    "title": "State department removes word ‘Tesla’ from $400m US armoured vehicles list",
    "description": "The US Department of State has removed the name “Tesla” from a list of planned purchases, after an earlier version of the list said it would spend $400m buying new electric armoured vehicles, even as the carmaker’s boss, Elon Musk, leads efforts to slash gove…",
    "link": "https://freerepublic.com/focus/f-news/4297527/posts",
    "timestamp": "2025-02-14T12:00:28Z"
  },
  {
    "title": "Jon Lovitz says Trump will keep Israel safe, ‘going to be hell to pay' if hostages aren't returned",
    "description": "Legendary comedian Jon Lovitz praised President Trump for being a strong defender of Israel, and called out antisemitic bullies in a new exclusive interview with Fox News Digital.",
    "link": "https://www.foxnews.com/media/jon-lovitz-says-trump-keep-israel-safe-going-hell-pay-hostages-arent-returned",
    "timestamp": "2025-02-14T12:00:21Z"
  },
  {
    "title": "First astronaut with disability cleared for space station mission",
    "description": "The first-ever astronaut with a physical disability has been cleared for a mission onboard the International Space Station, the European Space Agency announced on Friday. John McFall, a 43-year-old British surgeon and former Paralympian who lost a leg in a mo…",
    "link": "https://punchng.com/first-astronaut-with-disability-cleared-for-space-station-mission/",
    "timestamp": "2025-02-14T12:00:19Z"
  },
  {
    "title": "Insane in the lib brain",
    "description": "Happy Valentine's Day to all the lovers out there, and to the haters and losers as well. May you all, if you haven't already, find that special someone who looks at you the way Melania looks at Donald Trump—a loving (and stunningly attractive) spouse who alwa…",
    "link": "https://freebeacon.com/newsletters/insane-in-the-lib-brain/",
    "timestamp": "2025-02-14T12:00:19Z"
  },
  {
    "title": "Zuckerberg's rightward policy shift puts Meta staffers on edge, targets Apple",
    "description": "Meta CEO Mark Zuckerberg's actions to curry favor with the president have rattled employees, but people familiar with his efforts say there's a clear strategy.",
    "link": "https://www.cnbc.com/2025/02/14/zuckerbergs-rightward-policy-shift-hits-meta-staffers-targets-apple.html",
    "timestamp": "2025-02-14T12:00:01Z"
  },
  {
    "title": "A brief history of artistic censorship in the US",
    "description": "From the anti-communist paranoia of the 50s to the latest stranglehold by Trump, we look back on some of the worst examples of censorship in recent history",
    "link": "https://www.dazeddigital.com/art-photography/article/66107/1/america-artistic-censorship-us-donald-trump-communism-nan-goldin-right?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=a-brief-history-of-artistic-censorship-in-the-us",
    "timestamp": "2025-02-14T12:00:00Z"
  },
  {
    "title": "Adams case and other Trump moves threaten to open corruption floodgates, experts say",
    "description": "The leader of one watchdog group called the moves \"the equivalent of putting up a neon sign telling foreign actors 'we are open for corruption.'\"",
    "link": "https://www.nbcnews.com/politics/national-security/adams-case-trump-moves-threaten-open-corruption-floodgates-experts-say-rcna191451",
    "timestamp": "2025-02-14T12:00:00Z"
  },
  {
    "title": "How Mexican cartels and Chinese criminal networks are moving 'cocaine of the sea' through Canadian ports",
    "description": "Chinese crime networks and Mexican cartels are using Canadian ports to trade highly lucrative fish bladders for the precursor chemicals needed to produce fentanyl.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/fish-bladders-traded-for-fentanyl-precursors-1.7458395",
    "timestamp": "2025-02-14T12:00:00Z"
  },
  {
    "title": "The Trump World Order",
    "description": "If the president gets his way, the strong, not international lawyers, will write the rules.",
    "link": "https://www.theatlantic.com/international/archive/2025/02/trump-new-world-order/681683/",
    "timestamp": "2025-02-14T12:00:00Z"
  }
]