[
  {
    "title": "Trump Says Ukraine Peace Deal Talks 'Moving Rapidly'",
    "description": "British Prime Minister Keir Starmer on Thursday applauded President Donald Trump’s push to end Russia's invasion of Ukraine but said that \"it can’t be peace that rewards the aggressor.\"\n“History must be on the side of the peacemaker, not the invader,” Starmer…",
    "link": "https://biztoc.com/x/bc63d587dfd54d3a",
    "timestamp": "2025-02-28T16:12:53Z"
  },
  {
    "title": "Trump: Biden blames Obama, Pelosi for dropping bid",
    "description": "United States President Donald Trump shared in an interview on Friday that his predecessor Joe Biden blamed former President Barack Obama and Representative Nancy Pelosi for his exit as the Democratic...",
    "link": "https://biztoc.com/x/4ccaaffd89f94abf",
    "timestamp": "2025-02-28T16:12:39Z"
  },
  {
    "title": "Health experts warn of as many as 500,000 deaths over 10 years from Trump's cuts - NewsBreak",
    "description": "President Donald Trump's cuts to USAID could mean as many as 500,000 people die over the next 10 years, one expert predicted. Al Jazeera cited health exper",
    "link": "https://www.newsbreak.com/share/3834088294827-health-experts-warn-of-as-many-as-500-000-deaths-over-10-years-from-trump-s-cuts?_f=app_share&pd=00UhHWCu&lang=en_US&send_time=1740798613&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v2%2Cns_local_strategy_25q1_exp-v3%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v1&s=i2",
    "timestamp": "2025-02-28T16:12:29Z"
  },
  {
    "title": "Health experts warn of as many as 500,000 deaths over 10 years from Trump's cuts - NewsBreak",
    "description": "President Donald Trump's cuts to USAID could mean as many as 500,000 people die over the next 10 years, one expert predicted. Al Jazeera cited health exper",
    "link": "https://www.newsbreak.com/share/3834088294827-health-experts-warn-of-as-many-as-500-000-deaths-over-10-years-from-trump-s-cuts?s=a2&share_destination_id=MTE0MDgxODU0LTE3NDA3OTI4OTc2MjQ%3D&pd=07iftuIN&hl=en_US&send_time=1740792897&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.8.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_push_exp_rt_bucketv12-v2%2Cns_local_strategy_25q1_exp-v3%2Cns_foryou_blend_exp_25q1-v5%2Cns_foryou_model_exp_25q1-v4%2Cns_foryou_rank_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v1",
    "timestamp": "2025-02-28T16:12:29Z"
  },
  {
    "title": "Planetary parade 2025: Best places to watch in US, handy apps and all your FAQs answered",
    "description": "Planetary Parade 2025: The planets are aligning this week for a celestial event that will be seen around the globe. Seven planets will line up for a so-called \"planet parade\" on Friday, Feb. 28, as Mercury lines up with Mars, Jupiter, Uranus, Neptune, Venus a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/planetary-parade-2025-best-places-to-watch-in-us-handy-apps-and-all-your-faqs-answered/articleshow/118633343.cms",
    "timestamp": "2025-02-28T16:06:44Z"
  },
  {
    "title": "Dangerous Crossroads: Will Trump Succumb to European Political Pressure to Declare War on Russia?",
    "description": "The EU/NATO’s desperation to keep pushing with its crawling aggression against Russia is slowly turning into the rather pathetic “begmanding” we usually see from the Neo-Nazi junta and its frontman Volodymyr Zelensky. This gives even more credence to the …\nTh…",
    "link": "https://www.globalresearch.ca/european-pressure-msm-launches-north-korea-fake/5881138",
    "timestamp": "2025-02-28T16:05:46Z"
  },
  {
    "title": "Here's Doug Ford's Ontario election victory speech and plans for his third term",
    "description": "Doug Ford was re-elected for his third term as Premier of Ontario on Thursday night, evoking mixed reactions across the province.\r\nThe Progressive Conservative (PC) party's third consecutive majority victory is certainly a rare one — a feat not seen since 195…",
    "link": "https://www.blogto.com/city/2025/02/doug-ford-ontario-election-victory-speech-plans/",
    "timestamp": "2025-02-28T16:05:44Z"
  },
  {
    "title": "Karine Jean-Pierre compares Democrats calling for Biden to be kicked off 2024 election ticket to a ‘firing squad’",
    "description": "Former White House press secretary Karine Jean-Pierre spoke about how \"shocking\" it was to see Democratic Party leaders criticize then-President Joe Biden to the point where he had to leave the race.",
    "link": "https://nypost.com/2025/02/28/media/karine-jean-pierre-speaks-out-against-democrats-who-pushed-biden-off-2024-election-ticket/",
    "timestamp": "2025-02-28T16:05:36Z"
  },
  {
    "title": "Tesla Owners Now Disgusted By Elon Musk",
    "description": "Elon Musk has long been the linchpin of Tesla's appeal, commanding unbelievable hype that has elevated the automaker to a stellar stock position while giving it cultural staying power. But the marriage is getting ugly. As Musk unravels amidst his active role …",
    "link": "https://futurism.com/tesla-buyer-disgusted-elon-musk",
    "timestamp": "2025-02-28T16:03:48Z"
  },
  {
    "title": "Ukraine's Zelenskyy is keeping an ace up his sleeve in his negotiations with Trump: report",
    "description": "Volodymyr Zelenskyy is meeting with Donald Trump at the White House Friday where the U.S. president is expected to claim victory for a rare minerals deal that will serve as \"payback\" for U.S. assistance to the war-torn nation. Trump has long sought to be reim…",
    "link": "https://www.rawstory.com/zelensky-trump-2671240599/",
    "timestamp": "2025-02-28T16:02:54Z"
  },
  {
    "title": "From power player to pariah? It's just been over 5 weeks and Donald Trump seems to be losing support from U.S business leaders; here's why",
    "description": "President Trump faces growing discontent in corporate America due to his trade tariffs and regulatory policies. CEOs are concerned about the business climate, and proposed tariffs have added uncertainty. The stock market is lagging, and M&A activities are sta…",
    "link": "https://economictimes.indiatimes.com/news/international/us/from-power-player-to-pariah-its-just-been-over-5-weeks-and-donald-trump-seems-to-be-losing-support-from-u-s-business-leaders-heres-why/articleshow/118632274.cms",
    "timestamp": "2025-02-28T16:01:53Z"
  },
  {
    "title": "Donald Trump's NOAA Purge Sparks Alarm Before Hurricane Season",
    "description": "The National Oceanic and Atmospheric Administration (NOAA) was hit with significant layoffs this week, with hundreds of employees terminated in another round of job cuts spearheaded by the Department of Government Efficiency (DOGE) under the Trump administrat…",
    "link": "https://biztoc.com/x/72da53e173877171",
    "timestamp": "2025-02-28T16:01:40Z"
  },
  {
    "title": "Bitcoin has bled 25% in a month despite Trump. How low can it go?",
    "description": "Bitcoin continued its downward slide, falling below $80,000 on Thursday night. The leading crypto is 25% down from its all-time high that was reached just a month ago during Donald Trump’s inauguration.Read more...",
    "link": "https://qz.com/bitcoin-bleeding-despite-trump-bitcoin-etf-sec-coinbase-1851767007",
    "timestamp": "2025-02-28T16:01:00Z"
  },
  {
    "title": "EPA’s Climate Cultists and Their Budget Are About To Get Culled",
    "description": "The new EPA Administrator, Lee Zeldin. plans to cut approximately 65% of the agency's budget.\nThe post EPA’s Climate Cultists and Their Budget Are About To Get Culled first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/epas-climate-cultists-and-their-budget-are-about-to-get-culled/",
    "timestamp": "2025-02-28T16:00:53Z"
  },
  {
    "title": "Ethereum falls below $2,200: Assessing ETH’s odds of recovery",
    "description": "Ethereum faces mixed signals with whale accumulation rising despite a 22% price drop. Will it rebound?",
    "link": "https://ambcrypto.com/ethereum-falls-below-2200-assessing-eths-odds-of-recovery/",
    "timestamp": "2025-02-28T16:00:09Z"
  },
  {
    "title": "How Elon Musk Executed His Takeover of the Federal Bureaucracy",
    "description": "This is excellent reporting by the Times (although at times it makes Musk’s actions sound heroic rather than unconstitutiona",
    "link": "https://kottke.org/25/02/how-elon-musk-executed-his-takeover-of-the-federal-bureaucracy",
    "timestamp": "2025-02-28T16:00:07Z"
  },
  {
    "title": "Solar and Wind Energy Are Surging But CO2 Is Still Climbing Because of Natural Gas Use",
    "description": "Renewable energy broke records last year, but so did gas generation. That's a climate problem",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/02/28/wind-and-solar-surpassed-coal-but-co2-is-still-climbing-heres-why-00206582",
    "timestamp": "2025-02-28T16:00:00Z"
  },
  {
    "title": "Five ways the world has changed under Donald Trump - Fran O’Sullivan",
    "description": "OPINION: Fossil fuel investment, diversity and transgender soldiers are all facing change.",
    "link": "https://www.nzherald.co.nz/business/economy/five-ways-the-world-has-changed-under-donald-trump-fran-osullivan/XWJC4K7WDRCM5I3C5JQ6HEQM6Y/",
    "timestamp": "2025-02-28T16:00:00Z"
  },
  {
    "title": "USAID contracts cancelled: Donald Trump administration cuts funding for polio, HIV, malaria programmes",
    "description": "The United States Agency for International Development (USAID) primarily funds humanitarian initiatives worldwide, supporting healthcare, education and scientific programmes. But the Trump administration has abruptly terminated thousands of these projects, in…",
    "link": "https://economictimes.indiatimes.com/news/international/us/usaid-contracts-cancelled-donald-trump-administration-cuts-funding-for-polio-hiv-malaria-programmes/articleshow/118633381.cms",
    "timestamp": "2025-02-28T15:59:30Z"
  },
  {
    "title": "EU fueling turmoil as its influence wanes – Belgrade",
    "description": "Sidelined from the Ukraine talks, the EU seeks to maintain influence by fostering regional instability, the Serbian deputy PM told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613436-eu-fading-global-influence/",
    "timestamp": "2025-02-28T15:59:16Z"
  },
  {
    "title": "FBI Director Kash Patel reportedly wants UFC trainers to beef up federal agents: report",
    "description": "Patel floated the idea during his first meeting with the FBI's 55 field office supervisors on Wednesday, multiple people who were on the call said.",
    "link": "https://nypost.com/2025/02/28/us-news/fbi-director-kash-patel-wants-the-ufc-to-train-federal-agents-report/",
    "timestamp": "2025-02-28T15:58:42Z"
  },
  {
    "title": "Shoppers begin major boycott of stores that have backtracked on diversity initiatives",
    "description": "Today (February 28) shoppers have decided to initiate a 24-hour boycott on stores that have rolled back their diversity, equity, and inclusion (DEI) programmes. The economic blackout which began today is just one of several boycotts planned by consumers and a…",
    "link": "https://www.thepinknews.com/2025/02/28/dei-boycott-target/",
    "timestamp": "2025-02-28T15:58:15Z"
  },
  {
    "title": "US consumer spending falls in January; monthly inflation rises",
    "description": "U.S. consumer spending unexpectedly decreased by 0.2% in January, following an upwardly revised 0.8% rise in December. Factors such as fading pre-emptive buying, adverse weather, and Trump's tariffs contributed to the drop. Meanwhile, inflation rose, potentia…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-consumer-spending-falls-in-january-monthly-inflation-rises/articleshow/118633387.cms",
    "timestamp": "2025-02-28T15:58:13Z"
  },
  {
    "title": "Trump administration probes suspected fraud in Biden’s climate fund – WaPo",
    "description": "The US Justice Department and FBI are reportedly investigating alleged fraud in ex-President Joe Biden’s environmental grant program Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613443-us-biden-climate-fraud-probe/",
    "timestamp": "2025-02-28T15:57:12Z"
  },
  {
    "title": "Trump to sign order Friday designating English as the official language of the US",
    "description": "The executive order will rescind a mandate from former President Clinton that required the government and organizations that received federal funding to provide language assistance to non-English speakers.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_298afb04-f086-52cb-bed6-1f8138d90b1e.html",
    "timestamp": "2025-02-28T15:57:00Z"
  },
  {
    "title": "Americans expect corporations, the wealthy, White people and other groups to gain influence under Trump",
    "description": "Overwhelming majorities expect transgender people (84%) and gay and lesbian people (76%) to lose influence under Trump.\nThe post Americans expect corporations, the wealthy, White people and other groups to gain influence under Trump appeared first on Pew Rese…",
    "link": "http://www.pewresearch.org/short-reads/2025/02/28/americans-expect-corporations-the-wealthy-white-people-and-other-groups-to-gain-influence-under-trump/",
    "timestamp": "2025-02-28T15:52:21Z"
  },
  {
    "title": "What Are Days of Action Supposed to Accomplish?",
    "description": "So today you aren’t supposed to shop or something. The question is why? What is this going to do? This is the question everyone should be asking. Not because engaging in such an action is wrong. But organizing needs to have a point? What is the ask? What come…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/what-are-days-of-action-supposed-to-accomplish",
    "timestamp": "2025-02-28T15:51:00Z"
  },
  {
    "title": "Trump says he dined with Jeff Bezos the same day as the Washington Post opinion section shake-up",
    "description": "Bezos announced Wednesday that the Post's opinion section would focus on \"personal liberties and free markets.\" Trump says they had dinner that night.",
    "link": "https://www.businessinsider.com/donald-trump-jeff-bezos-dinner-washington-post-opinion-2025-2",
    "timestamp": "2025-02-28T15:47:13Z"
  },
  {
    "title": "As the economy shows signs of cooling, many executives sour on Trump",
    "description": "For a while, corporate leaders largely avoided criticizing Donald Trump and his plans. As key economic indicators start to lag, that’s changing in a hurry.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/economy-shows-signs-cooling-many-executives-sour-trump-rcna194208",
    "timestamp": "2025-02-28T15:43:08Z"
  },
  {
    "title": "Migratory birds mainly responsible for bird flu outbreak, experts tell Pa. lawmakers",
    "description": "People’s risk of getting bird flu is currently low, but avian flu experts told Pennsylvania lawmakers it is critical to continue tracking the spread of the virus and how it mutates in order to keep animals and humans safe.",
    "link": "https://lancasteronline.com/news/local/migratory-birds-mainly-responsible-for-bird-flu-outbreak-experts-tell-pa-lawmakers/article_b7c8e612-f5ea-11ef-8c35-9f319acc62d0.html",
    "timestamp": "2025-02-28T15:43:00Z"
  },
  {
    "title": "Trump To Sign Order Designating English As Official Language Of The U.S.",
    "description": "For decades, lawmakers in Congress have introduced legislation to designate English as the official language of the U.S., but those efforts have not succeeded.",
    "link": "https://www.huffpost.com/entry/trump-sign-order-designating-english-as-the-official-language-united-states_n_67c1d720e4b069a7dd543112",
    "timestamp": "2025-02-28T15:42:50Z"
  },
  {
    "title": "GOP May Try to Pay for Tax Cuts With Unpopular Tariffs",
    "description": "Republicans may try to pay for Trump tax cuts with tariffs. The fiscal arithmetic of the Trump agenda isn’t adding up. Offsetting unpopular reductions in taxes for wealthy people with unpopular regressive tariffs won’t help.",
    "link": "http://nymag.com/intelligencer/article/gop-pay-for-tax-cuts-unpopular-tariffs.html",
    "timestamp": "2025-02-28T15:42:08Z"
  },
  {
    "title": "President Trump to sign order Friday designating English as the official language of the US",
    "description": "President Donald Trump is expected to sign an executive order on Friday designating English as the official language of the United States, according to the White House.",
    "link": "https://www.wpxi.com/news/local/president-trump-sign-order-friday-designating-english-official-language-us/RT27NODHDNAIDG7YVKUVH7ZZTQ/",
    "timestamp": "2025-02-28T15:41:16Z"
  },
  {
    "title": "Trump to sign order Friday designating English as the official language of the US",
    "description": "The executive will rescind a mandate that required government and organizations that received federal funding to provide language assistance to non-English speakers.",
    "link": "https://www.bostonherald.com/2025/02/28/trump-english-official-language-usa/",
    "timestamp": "2025-02-28T15:40:21Z"
  },
  {
    "title": "How the Supreme Court Paved the Way for DOGE",
    "description": "Through a series of decisions, the Republican Justices laid the groundwork for much of the chaos of the Trump Administration",
    "link": "https://time.com/7262781/supreme-court-doge-musk-trump/",
    "timestamp": "2025-02-28T15:35:57Z"
  },
  {
    "title": "Meet The People’s Union USA, the Movement Behind Today’s ‘Economic Blackout’",
    "description": "Here's what you need to know about the movement behind the boycott making headlines.",
    "link": "https://time.com/7262796/the-people-union-usa-movement-behind-economic-blackout-consumers/",
    "timestamp": "2025-02-28T15:35:46Z"
  },
  {
    "title": "BREAKING: USAID Granted $1M to Soros’s Radical Global University",
    "description": "The scandal surrounding the U.S. Agency for International Development (USAID) and its abuse of taxpayer dollars to support causes backed by leftist billionaire George Soros continues to get worse.",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/02/28/breaking-usaid-granted-1m-tax-dollars-george-soross-university",
    "timestamp": "2025-02-28T15:35:30Z"
  },
  {
    "title": "Donald Trump to order that English be the official language of US for first time in its history",
    "description": "There’s never been a common language in the 249-year history of the country.",
    "link": "https://www.thejournal.ie/trump-english-language-6636132-Feb2025/",
    "timestamp": "2025-02-28T15:34:48Z"
  },
  {
    "title": "The Coming Showdown in Trumpworld",
    "description": "With Trump’s elite supporters prioritizing their own narrow agendas over democratic principles, the risk of a slide toward authoritarianism should be obvious. Fortunately, it is even more likely that competing agendas will trigger open conflict, causing the T…",
    "link": "https://www.project-syndicate.org/commentary/trump-enablers-nationalists-tech-elites-have-conflicting-goals-by-dani-rodrik-2025-02",
    "timestamp": "2025-02-28T15:34:45Z"
  },
  {
    "title": "JD Vance Tells Catholics That Trump Administration Has Already Taken Ax To Biden’s Anti-Christian Policies",
    "description": "Vice President J.D. Vance assured Catholics that President Donald Trump's administration has already erased the Biden-era's anti-Christian policies.",
    "link": "https://dailycaller.com/2025/02/28/jd-vance-catholics-trump-biden-anti-christian-policies/",
    "timestamp": "2025-02-28T15:33:39Z"
  },
  {
    "title": "Trump’s CFPB Drops Cases Against Companies Accused of Cheating Consumers",
    "description": "The companies are accused of ripping off savings account holders, illegally collecting on student loans, and more.",
    "link": "https://www.commondreams.org/news/cfpb-director-trump",
    "timestamp": "2025-02-28T15:32:57Z"
  },
  {
    "title": "Trump to sign order Friday designating English as the official language of the US",
    "description": "President Donald Trump is expected to sign an executive order on Friday designating English as the official language of the United States",
    "link": "https://www.wftv.com/news/politics/trump-sign-order/GYKCBBOP4VEBBAGZLPHCRZ55BM/",
    "timestamp": "2025-02-28T15:32:54Z"
  },
  {
    "title": "AI security Is key to U.S. dominance in the AI arms race",
    "description": "DeepSeek and security breaches threaten America's AI dominance. Here's how we take it back.",
    "link": "https://www.techradar.com/pro/ai-security-is-key-to-u-s-dominance-in-the-ai-arms-race",
    "timestamp": "2025-02-28T15:32:10Z"
  },
  {
    "title": "Outrage after Pete Hegseth’s Pentagon tries to quietly move to kick out transgender troops",
    "description": "The Pentagon has quietly issued new guidance ordering United States military\r\n branches to identify and discharge transgender\r\n service members diagnosed with or treated for gender dysphoria within 60 days, a move that has sparked fierce backlash. The directi…",
    "link": "https://www.advocate.com/news/pentagon-quietly-pushes-transgender-ban",
    "timestamp": "2025-02-28T15:32:03Z"
  },
  {
    "title": "Reject the Linguistic Coup: Speak Up for Trans People",
    "description": "Willow Schenwar\n\n\n\nThe Trump administration is trying to shape public perception on transness by manipulating language and symbols—don’t let it.\r\n\n\r\n\n\nThe post Reject the Linguistic Coup: Speak Up for Trans People appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/reject-linguistic-coup-speak-up/",
    "timestamp": "2025-02-28T15:30:00Z"
  },
  {
    "title": "Micheál Martin should follow Macron’s playbook for handling Trump",
    "description": "The French president recognised the need to stroke Trump’s ego even as he confidently reasserted Europe’s position on several issues",
    "link": "https://www.irishtimes.com/opinion/2025/02/28/micheal-martin-should-follow-macrons-playbook-for-handling-trump/",
    "timestamp": "2025-02-28T15:30:00Z"
  },
  {
    "title": "Trump, Zelensky to meet; Chiefs' Kelce returning next season | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_307ba8d8-a6ab-5500-bac3-d73b53bbd000.html",
    "timestamp": "2025-02-28T15:30:00Z"
  },
  {
    "title": "What's Happening With The Epstein Files Release? The DOJ 'Jeffrey Epstein Phase 1 Files' Explained",
    "description": "Here's what you need to know about the Department of Justice's public release of \"Phase 1\" of the highly publicized \"Epstein Files,\" as well as how people are reacting to it online.",
    "link": "https://knowyourmeme.com/editorials/guides/whats-happening-with-the-epstein-files-release-the-doj-jeffrey-epstein-phase-1-files-explained",
    "timestamp": "2025-02-28T15:28:26Z"
  },
  {
    "title": "Japan and South Korea in the Age of ‘America First’",
    "description": "Japan and South Korea are at their most fragile political states in decades – just as Trump’s return to the White House disrupts an already-changing global order.",
    "link": "https://thediplomat.com/2025/03/japan-and-south-korea-in-the-age-of-america-first/",
    "timestamp": "2025-02-28T15:27:59Z"
  },
  {
    "title": "Trump's proposed auto tariffs seen hitting demand for platinum group metals",
    "description": "By Ashitha Shivaprasad and Shivansh Tiwary\n(Reuters) - Demand for industrial precious metals platinum and palladium will likely fall if tariffs proposed by President Donald Trump on U.S. auto imports dampen vehicle sales, analysts said.\nEarlier this month, Tr…",
    "link": "https://biztoc.com/x/a384f221ff2178af",
    "timestamp": "2025-02-28T15:27:44Z"
  },
  {
    "title": "US HIV funding cut is 'wake-up call' for S Africa",
    "description": "The US government axes vital HIV/Aids funding, with warnings it could lead to half a million deaths.",
    "link": "https://www.bbc.com/news/articles/c77887npl2mo",
    "timestamp": "2025-02-28T15:27:00Z"
  },
  {
    "title": "Doug Ford's win is Ontario's loss",
    "description": "Because politics is politics, as cynical as predictable, each party and leader will claim victory after last night, but this was an election that everybody lost, not least of whom include the people of Ontario.",
    "link": "https://www.nationalobserver.com/2025/02/28/opinion/win-doug-ford-win-ontario-loss",
    "timestamp": "2025-02-28T15:26:00Z"
  },
  {
    "title": "North Korea’s US$1.5 billion heist puts crypto on notice",
    "description": "Following a hack on Bybit, cybersecurity researchers concluded the era of digital-asset heists had entered a new phase. Read more here",
    "link": "https://financialpost.com/cybersecurity/north-korea-heist-puts-crypto-on-notice",
    "timestamp": "2025-02-28T15:23:44Z"
  },
  {
    "title": "UK firms cautiously optimistic on U.S. trade deal prospects",
    "description": "Hopes of a trade deal between Britain and the United States, reignited by President Donald Trump's positive comments after meeting Prime Minister Keir Starmer this week, prompted cautious optimism Friday from a UK business sector keen to avoid tariffs. After …",
    "link": "https://www.rawstory.com/uk-firms-cautiously-optimistic-on-u-s-trade-deal-prospects/",
    "timestamp": "2025-02-28T15:23:31Z"
  },
  {
    "title": "Enhanced capabilities sustain the rapid growth of Vo1d botnet",
    "description": "Operators behind the Vo1d botnet have enhanced its capabilities, enabling rapid growth in recent months. In September 2024, Doctor Web researchers uncovered a malware, tracked as Vo1d, that infected nearly 1.3 million Android-based TV boxes belonging to users…",
    "link": "https://securityaffairs.com/174762/malware/enhanced-capabilities-sustain-the-rapid-growth-of-vo1d-botnet.html",
    "timestamp": "2025-02-28T15:20:35Z"
  },
  {
    "title": "Perspectives, challenges of Ukraine’s next election",
    "description": "WASHINGTON — The issue of Ukraine’s next presidential election has emerged as a possible element in the peace deal between Russia and Ukraine that the United States is negotiating.\n\n\nUkrainian leaders and elections experts argue, however, that holding electio…",
    "link": "https://www.voanews.com/a/perspectives-challenges-of-ukraine-s-next-election/7991546.html",
    "timestamp": "2025-02-28T15:18:42Z"
  },
  {
    "title": "Is DC's housing market going to collapse? Here's what's really going on.",
    "description": "Agents and an economist said the president's efficiency efforts haven't yet deflated the Washington, DC, housing market, but they could down the line.",
    "link": "https://www.businessinsider.com/washington-dc-housing-market-affected-by-doge-cutting-federal-workers-2025-2",
    "timestamp": "2025-02-28T15:18:38Z"
  },
  {
    "title": "US: Trump Administration Guts Foreign Aid",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n A sign with the names of US government agencies housed at the Ronald Reagan Building in Washington, DC, with the USAID headquarters taped over, February 7, 2025.\n © 2025 Manuel Balce Ceneta/AP Photo \n \n \n\n\n \n(Washing…",
    "link": "https://www.hrw.org/news/2025/02/28/us-trump-administration-guts-foreign-aid",
    "timestamp": "2025-02-28T15:17:45Z"
  },
  {
    "title": "India, EU, pledge to push free trade agreement, elevate strategic ties",
    "description": "New Delhi  — India and the European Union agreed to wrap up a free trade deal by the end of this year, the two sides announced Friday following talks in the Indian capital between Prime Minister Narendra Modi and European Commission President Ursula Von der L…",
    "link": "https://www.voanews.com/a/india-eu-pledge-to-push-free-trade-agreement-elevate-strategic-ties-/7991547.html",
    "timestamp": "2025-02-28T15:16:50Z"
  },
  {
    "title": "WATCH LIVE: Trump and Ukraine’s Zelenskyy hold news conference at the White House",
    "description": "Ukraine's leader will meet with President Donald Trump in Washington on Friday at a pivotal moment for his country, one that hinges on whether he can persuade Trump to provide some form of U.S. backing for Ukraine's security against any future Russian aggress…",
    "link": "https://biztoc.com/x/a9ecfbcc747ee673",
    "timestamp": "2025-02-28T15:16:26Z"
  },
  {
    "title": "Putin Says He’s Hopeful About Renewed US, Russia Engagement",
    "description": "Russian President Vladimir Putin praised early efforts by his US counterpart Donald Trump to ease years of strained ties as officials held talks to restore staffing at diplomatic missions in their countries.\n“The first contacts with the new American administr…",
    "link": "https://biztoc.com/x/97ab0e8eb2dc5189",
    "timestamp": "2025-02-28T15:16:19Z"
  },
  {
    "title": "Trump to make English official US language, White House official says",
    "description": "The United States has never had an official language at the federal level but some US states designate English as their official language.",
    "link": "https://www.jpost.com/breaking-news/article-844159",
    "timestamp": "2025-02-28T15:13:04Z"
  },
  {
    "title": "WATCH LIVE: Trump and Ukraine’s Zelenskyy hold news conference at the White House",
    "description": "Ukraine's leader will meet with President Donald Trump in Washington on Friday at a pivotal moment for his country, one that hinges on whether he can persuade Trump to provide some form of U.S. backing for Ukraine's security against any future Russian aggress…",
    "link": "https://www.pbs.org/newshour/world/watch-live-trump-and-ukraines-zelenskyy-hold-news-conference-at-the-white-house",
    "timestamp": "2025-02-28T15:12:40Z"
  },
  {
    "title": "Tesla Applies For Not-So-Robo Taxi Service In California, And Trump Tariffs Loom",
    "description": "Tesla self-driving cars with human drivers, Trump tariffs getting yet another launch date, and expensive execs in today's The Morning Shift",
    "link": "https://www.jalopnik.com/1801361/tesla-applies-human-driver-ride-service-california-uber/",
    "timestamp": "2025-02-28T15:11:57Z"
  },
  {
    "title": "Florida ups the stakes for crimes by immigrants in the US illegally",
    "description": "New laws in Florida mandate stiffer criminal penalties for immigrants in the U.S. illegally.",
    "link": "https://www.bostonherald.com/2025/02/28/florida-ups-the-stakes-for-crimes-by-immigrants-in-the-us-illegally/",
    "timestamp": "2025-02-28T15:09:22Z"
  },
  {
    "title": "How should Micheál Martin approach his White House visit?",
    "description": "Inside Politics podcast with Hugh Linehan",
    "link": "https://www.irishtimes.com/podcasts/inside-politics/how-should-micheal-martin-approach-his-white-house-visit/",
    "timestamp": "2025-02-28T15:07:05Z"
  },
  {
    "title": "Indo-Pacific Allies May Rethink US Intelligence Sharing After Gabbard, Patel Appointments",
    "description": "Faced with mounting doubts over Washington’s reliability, U.S. allies in the Indo-Pacific may start charting their own course.",
    "link": "https://thediplomat.com/2025/03/indo-pacific-allies-may-rethink-us-intelligence-sharing-after-gabbard-patel-appointments/",
    "timestamp": "2025-02-28T15:07:00Z"
  },
  {
    "title": "MAGA Influencers Spark Civil War Over Epstein Files",
    "description": "The White House’s “Epstein files” stunt is causing a rift in the MAGA movement.\r\nOne of the far-right influencers who received a binder from the Trump administration—conspiracy and mommy blogger Jessica Reed Kraus—attacked Laura Loomer Thursday, accusing the …",
    "link": "https://newrepublic.com/post/192134/maga-influencers-donald-trump-epstein-files",
    "timestamp": "2025-02-28T15:06:57Z"
  },
  {
    "title": "Canada's economy better than expected in last quarter of 2024, new numbers show",
    "description": "The Canadian economy outpaced expectations in the final quarter of the year, Statistics Canada said Friday, thanks largely to a surge in household spending. Real gross domestic product rose 2.6 per cent on an annualized basis in the fourth quarter, the agency…",
    "link": "https://www.cbc.ca/news/canada/canada-q4-economy-1.7471221",
    "timestamp": "2025-02-28T15:05:30Z"
  },
  {
    "title": "Bad Peace Is Better Than Good War",
    "description": "President Trump is shining a light into darkness and part of this darkness is the truth about the Ukraine conflict. It must end. There must be compromise. The death toll is catastrophic.  I would go one step further and say that the academics, journalists, an…",
    "link": "https://www.activistpost.com/ukraine-war-addressing-the-lies-and-consequences/",
    "timestamp": "2025-02-28T15:03:00Z"
  },
  {
    "title": "Mass Firings Aren't Meritocracy",
    "description": "Plus: Epstein files, Taibbi interview, and more...",
    "link": "https://reason.com/2025/02/28/mass-firings-arent-meritocracy/",
    "timestamp": "2025-02-28T15:02:38Z"
  },
  {
    "title": "On a pause from genocide, Israel turns its focus to ethnic cleansing",
    "description": "After slaughtering tens of thousands in Gaza, Israel has embarked on a forced displacement campaign in the West Bank.",
    "link": "https://www.aljazeera.com/opinions/2025/2/28/on-a-pause-from-genocide-israel-turns-its-focus-to-ethnic-cleansing",
    "timestamp": "2025-02-28T15:02:00Z"
  },
  {
    "title": "Oscars 2025: Two Queers Discuss the Straightest Academy Awards in Years",
    "description": "\"I am so sorry I made a wish on a monkey’s paw for a trans lesbian musical to get an Oscar nomination and it resulted in us all having to suffer through Emilia Pérez.\"\nThe post Oscars 2025: Two Queers Discuss the Straightest Academy Awards in Years appeared f…",
    "link": "http://www.autostraddle.com/oscars-2025-two-queers-discuss-the-97th-academy-awards/",
    "timestamp": "2025-02-28T15:00:49Z"
  },
  {
    "title": "Andrew & Tristan Tate were allowed to fly from Romania to Florida",
    "description": "Andrew Tate and his brother Tristan Tate are the worst of the toxic-bro culture that dominates the internet, and the Tates are all about being as violent, toxic and abusive to girls and women as possible. While they are dual British-American citizens, they op…",
    "link": "https://www.celebitchy.com/911416/andrew_tristan_tate_were_allowed_to_fly_from_romania_to_florida/",
    "timestamp": "2025-02-28T15:00:32Z"
  },
  {
    "title": "Lies, Cuts, Closures: Trump and Musk Ravage Social Security Administration",
    "description": "First, the Trump administration closed field offices, then they fired online help workers. How will Americans access their benefits?",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-musk-social-security-administration-lies-cuts-closures-1235283161/",
    "timestamp": "2025-02-28T15:00:00Z"
  },
  {
    "title": "The Prospect of Rising Supply Puts Oil Prices Under Pressure",
    "description": "Oil prices remained under pressure on Friday morning, with markets focused on the potential of new supply coming online. Friday, February 28, 2025 Following extremely rangebound trading throughout most of mid-February, oil prices are set to post their largest…",
    "link": "https://oilprice.com/Energy/Energy-General/The-Prospect-of-Rising-Supply-Puts-Oil-Prices-Under-Pressure.html",
    "timestamp": "2025-02-28T15:00:00Z"
  },
  {
    "title": "AI Update, February 28, 2025: AI News and Views From the Past Week",
    "description": "Catch up on select AI news and developments from the past week or so. Stay in the know. Read the full article at MarketingProfs",
    "link": "https://www.marketingprofs.com/opinions/2025/52799/ai-update-february-28-2025-ai-news-and-views-from-the-past-week",
    "timestamp": "2025-02-28T15:00:00Z"
  },
  {
    "title": "Google removing 'state' designation from Canadian government buildings. No word from Microsoft",
    "description": "Canadians filed widespread complaints after noticing the designation amid 51st state rhetoric. Google has already started updating parks and says it will also be turning its attention to buildings.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/google-maps-state-buildings-1.7470788",
    "timestamp": "2025-02-28T15:00:00Z"
  },
  {
    "title": "Trump says a minerals deal with Ukraine is worth billions. It might not be as valuable as he hopes",
    "description": "Analysts questions the size of Ukraine's natural resources deposits, how accessible they are and easy to extract, and the ultimate value of a potential deal.",
    "link": "https://www.cnbc.com/2025/02/28/trump-says-minerals-deal-with-ukraine-is-worth-billions-is-it.html",
    "timestamp": "2025-02-28T14:57:59Z"
  },
  {
    "title": "Wall Street eases toward the end of its dreary February",
    "description": "A rebound for Nvidia following its sharp drop the day before helped steady the market, and the majority of stocks rose.",
    "link": "https://www.bostonherald.com/2025/02/28/financial-markets-discouraging-trends/",
    "timestamp": "2025-02-28T14:55:34Z"
  },
  {
    "title": "MAGA Influencers Brag About Getting 'Epstein Files,' But Much Is Not New",
    "description": "Some of the influencers later downplayed the value of what they had been given at the White House.",
    "link": "https://www.huffpost.com/entry/maga-influencers-brag-about-getting-epstein-files-but-much-has-already-been-released_n_67c0d0fce4b070266329623c",
    "timestamp": "2025-02-28T14:55:26Z"
  },
  {
    "title": "Trump to sign order making English the official U.S. language",
    "description": "President Donald Trump plans to sign an executive order making English the official language of the United States.",
    "link": "https://www.cnbc.com/2025/02/28/trump-english-official-language-order.html",
    "timestamp": "2025-02-28T14:54:52Z"
  },
  {
    "title": "Russia's War Hawks Fume over Putin's 'Dirty Little Deal' With Trump",
    "description": "Some of Moscow's military bloggers have criticized Russian President Vladimir Putin's \"dirty little deal\" with President Donald Trump over Ukraine, amid reports that the Kremlin has given state-controlled media outlets instructions on how to paint a positive …",
    "link": "https://biztoc.com/x/75141692fa5dd2b1",
    "timestamp": "2025-02-28T14:54:28Z"
  },
  {
    "title": "How Trump's Federal Government Cuts Compare to Clinton's",
    "description": "As Donald Trump pushes for sweeping federal government cuts in his second term, comparisons are emerging with Bill Clinton's efforts to shrink the government in the 1990s.\nWhy It Matters\nSince beginning his second term, Trump has implemented a series of spend…",
    "link": "https://biztoc.com/x/e1c3dfc404e01eb2",
    "timestamp": "2025-02-28T14:54:28Z"
  },
  {
    "title": "Why there were so many apologies in the lead-up to the 2025 Oscars",
    "description": "This year’s Oscars race has been a historic one. But amid a history-making season, there’s been an equal amount of controversies surrounding some of the nominees.",
    "link": "https://www.today.com/popculture/awards/oscars-2025-controversies-explained-rcna193158",
    "timestamp": "2025-02-28T14:54:08Z"
  },
  {
    "title": "Bitcoin nears $80,000 level in worst month since 2022",
    "description": "Bitcoin (BTC-USD) fell nearly 5% early Friday to just above $82,000 — the cryptocurrency’s lowest level since early November.\nThe drop puts bitcoin down nearly 20% over the past month — its worst performance over a month since June 2022.\nFriday's decline come…",
    "link": "https://biztoc.com/x/48f7ee1b086d59d4",
    "timestamp": "2025-02-28T14:54:04Z"
  },
  {
    "title": "GOP lawmakers privately saying Trump has 'gone too far': Dem senator",
    "description": "Sen. Jeanne Shaheen (D-NH) on Friday revealed to CNN's Sara Sidner that some of her Republican colleagues are privately getting squeamish about President Donald Trump's actions.During the CNN interview, Shaheen discussed Trump's declaration that he \"trusts\" R…",
    "link": "https://www.rawstory.com/trump-ukraine-2671239973/",
    "timestamp": "2025-02-28T14:53:58Z"
  },
  {
    "title": "Trump to sign order making English the official U.S. language",
    "description": "President Donald Trump plans to sign an executive order making English the official language of the United States.",
    "link": "https://biztoc.com/x/6da0885c632d4344",
    "timestamp": "2025-02-28T14:53:43Z"
  },
  {
    "title": "China’s Navy Drills Near US Allies Seen as Test for Trump",
    "description": "A spate of drills by China’s military in the Indo-Pacific is testing the Trump administration’s commitment to regional security soon after its actions raised doubts about its alliances with European nations.",
    "link": "https://gcaptain.com/chinas-navy-drills-near-us-allies-seen-as-test-for-trump/",
    "timestamp": "2025-02-28T14:52:00Z"
  },
  {
    "title": "Trump’s Self-Fulfilling Crisis",
    "description": "Donald Trump began his second term with a solemn promise to usher in “the golden age of America.” But, by increasing consumer prices, fueling financial-market froth, and contributing to a sharp dollar correction, his initial policy frenzy could create the eco…",
    "link": "https://www.project-syndicate.org/commentary/trump-false-claims-of-disastrous-us-economy-could-create-crisis-by-stephen-s-roach-2025-02",
    "timestamp": "2025-02-28T14:51:51Z"
  },
  {
    "title": "India, EU agree to conclude free trade pact in 2025",
    "description": "PM Modi and EU President Von der Leyen push a deadline on trade pact stuck over demands for tariff cuts on auto and wines & spirits from Europe and demands for easier work visas and greater market access for textiles and leather from India",
    "link": "https://www.thehindubusinessline.com/economy/india-eu-agree-to-conclude-free-trade-pact-in-2025/article69275590.ece",
    "timestamp": "2025-02-28T14:49:50Z"
  },
  {
    "title": "President Donald Trump to make English official language of US in executive order",
    "description": "President Donald Trump is expected to sign an executive order making English the nation's official language, Fox News Digital confirmed.",
    "link": "https://www.foxnews.com/politics/trump-make-english-official-language-us-new-executive-order",
    "timestamp": "2025-02-28T14:49:15Z"
  },
  {
    "title": "Wayne Gretzky’s wife Janet speaks out over Canadian criticism that’s ‘broken his heart’",
    "description": "The mounting criticism over Wayne Gretzky and his ties to President Donald Trump amid political tension between the U.S. and Gretzky’s native Canada has “broken” The Great One’s heart.",
    "link": "https://nypost.com/2025/02/28/sports/wayne-gretzkys-wife-says-criticism-by-canadians-over-donald-trump-ties-has-taken-toll/",
    "timestamp": "2025-02-28T14:48:42Z"
  },
  {
    "title": "Why has Mexico handed over drug cartel leaders to US? Who are they?",
    "description": "Mexico's largest handover in years comes days before Trump imposes tariffs on Mexican imports.",
    "link": "https://www.aljazeera.com/news/2025/2/28/why-has-mexico-handed-over-drug-cartel-leaders-to-us-who-are-they",
    "timestamp": "2025-02-28T14:47:27Z"
  },
  {
    "title": "Danish supermarkets help customers buy European",
    "description": "\"Our job is to deliver what our customers want,\" Salling Group's head of press told Euractiv.",
    "link": "https://www.euractiv.com/section/politics/news/danish-supermarkets-help-customers-buy-european/",
    "timestamp": "2025-02-28T14:46:01Z"
  },
  {
    "title": "Speaker Mike Johnson Is Living in a D.C. House That Is the Center of a Pastor’s Secretive Influence Campaign",
    "description": "by Joshua Kaplan, Justin Elliott and Alex Mierjeski \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nIn 2021, Steve Berger, an evangelical pasto…",
    "link": "https://www.propublica.org/article/mike-johnson-evangelical-pastor-steve-berger-roommates",
    "timestamp": "2025-02-28T14:45:00Z"
  },
  {
    "title": "Inside the rush to respond to Musk’s ‘What did you do last week?’",
    "description": "Cabinet secretaries in the US struggle to respond to a directive from President Donald Trump’s most powerful adviser",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/02/27/us/politics/elon-musk-email-doge-federal-workers-trump.html",
    "timestamp": "2025-02-28T14:43:16Z"
  },
  {
    "title": "Elon enters the circus",
    "description": "The shadow president paced around the stage after his speech, sunglasses on, mouth frozen in a grin, raising a chainsaw overhead to the delight of an adoring crowd as a large rectangular canvas made its way from the back of the audience toward him. He grabbed…",
    "link": "https://www.theverge.com/policy/620892/cpac-elon-musk-chainsaw-trump-steve-bannon",
    "timestamp": "2025-02-28T14:41:51Z"
  }
]