[
  {
    "title": "I'm a first-generation American who moved to the UK. I don't plan on going back.",
    "description": "Born in the US to two immigrant parents, Kasia Kovacs moved to Europe in her 20s and doesn't plan on going back to the States.",
    "link": "https://www.businessinsider.com/first-generation-american-moved-europe-london-2025-4",
    "timestamp": "2025-04-13T09:59:01Z"
  },
  {
    "title": "Ukraine Says Russian Missile Attack Kills More Than 20 in Sumy",
    "description": "Ukraine said many people were killed and injured after Russian missiles struck the city of Sumy, days after US envoy Steve Witkoff met with Russian President Vladimir Putin to discuss ending the war.",
    "link": "https://financialpost.com/pmn/business-pmn/ukraine-says-russian-missile-attack-kills-more-than-20-in-sumy",
    "timestamp": "2025-04-13T09:59:00Z"
  },
  {
    "title": "Trump receives a standing ovation as he enters a UFC event in Miami",
    "description": "President Donald Trump entered to a standing ovation and cheers from a crowd of thousands attending a UFC event on Saturday night, shaking hands with supporters against a backdrop",
    "link": "https://www.marca.com/en/ufc/2025/04/13/67fb8a8346163fec888b457a.html",
    "timestamp": "2025-04-13T09:58:28Z"
  },
  {
    "title": "Head of Smithsonian's Black Museum resigns amid Trump's attacks (The Chicago Crusader)",
    "description": "The Chicago Crusader:\nHead of Smithsonian's Black Museum resigns amid Trump's attacks  —  Kevin Young, the director of the National Museum of African American History and Culture (NMAAHC) in Washington, D.C., resigned as President Donald Trump stepped up atta…",
    "link": "https://www.memeorandum.com/250413/p2",
    "timestamp": "2025-04-13T09:55:00Z"
  },
  {
    "title": "Tinubu, Trump’s Africa adviser discussed deeper US, Nigeria partnership in Paris – Presidency",
    "description": "President Bola Tinubu on Thursday met with a Senior Advisor for Africa to United States President Donald Trump, Massad Boulos, in Paris to explore deeper economic and security partnerships between Nigeria and the United States. The meeting, according to a sta…",
    "link": "https://punchng.com/tinubu-trumps-africa-adviser-discussed-deeper-us-nigeria-partnership-in-paris-presidency/",
    "timestamp": "2025-04-13T09:54:47Z"
  },
  {
    "title": "China's Xi courts Southeast Asia as Trump tariffs bite",
    "description": "BEIJING: Chinese President Xi Jinping will kick off a five-day, three-nation Southeast Asia tour on Monday (Apr 14) as Beijing seeks to tighten regional trade ties and offset the impact of huge tariffs unleashed by his US counterpart Donald Trump. Xi will",
    "link": "https://www.channelnewsasia.com/east-asia/china-xi-jinping-asean-trump-tariffs-5062956",
    "timestamp": "2025-04-13T09:54:00Z"
  },
  {
    "title": "Kremlin: Putin to meet Trump at appropriate time",
    "description": "Kremlin spokesperson Dmitry Peskov said on Sunday that Russian President Vladimir Putin will definitely meet in person with his American counterpart Donald Trump at an \"appropriate time.\"\"This meeting...",
    "link": "https://biztoc.com/x/bdfcfefccf1a2e92",
    "timestamp": "2025-04-13T09:51:45Z"
  },
  {
    "title": "Australian political leaders launch election campaigns focused on first-time homeowners",
    "description": "Australia’s rival political leaders offered competing policies to help Australians buy a home ahead of the nation’s first federal election in which younger voters will outnumber the long-dominant baby boomer generation",
    "link": "https://abcnews.go.com/International/wireStory/australian-political-leaders-launch-election-campaigns-focused-time-120759417",
    "timestamp": "2025-04-13T09:50:31Z"
  },
  {
    "title": "China's trade hubs show strain as tariff war with US escalates",
    "description": "Major export provinces and shipping ports, including Shanghai and Guangdong, have seen a sharp decline in activity, with cargo traffic to the United States coming to a near halt",
    "link": "https://www.thehindubusinessline.com/economy/logistics/chinas-trade-hubs-show-strain-as-tariff-war-with-us-escalates/article69445744.ece",
    "timestamp": "2025-04-13T09:46:10Z"
  },
  {
    "title": "Bernie Sanders Claims His Supporters Making Trump and Musk 'Very Nervous'",
    "description": "Sen. Bernie Sanders (I-VT)  assured attendees at one of his \"Fighting Oligarchy\" rallies Saturday they are \"making Donald Trump and Elon Musk very nervous\" as he laid out a string of grievances with the current Washington administration.\nThe post Bernie Sande…",
    "link": "https://www.breitbart.com/politics/2025/04/13/bernie-sanders-claims-his-supporters-making-trump-and-musk-very-nervous/",
    "timestamp": "2025-04-13T09:45:29Z"
  },
  {
    "title": "China's Xi courts Southeast Asia as Trump tariffs bite",
    "description": "China's Xi courts Southeast Asia as Trump tariffs biteenca.com",
    "link": "https://www.enca.com/business/chinas-xi-courts-southeast-asia-trump-tariffs-bite",
    "timestamp": "2025-04-13T09:41:47Z"
  },
  {
    "title": "Donald Trump Booed at Coachella During Bernie Sanders Speech",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSenator Bernie Sanders made a surprise appearance at the Coachella festival in California on Saturday night. When the Vermont independent mentioned President Donald Trump, the crowd booed, and he quickly told …",
    "link": "https://biztoc.com/x/2df8a4ffc6a84141",
    "timestamp": "2025-04-13T09:41:04Z"
  },
  {
    "title": "Volkanovski claims featherweight belt at UFC 314 with unanimous decision over Lopes",
    "description": "Title fights are nothing new to Alexander Volkanovski.\n\nHis featherweight bout early Sunday morning against Diego Lopes was his 10th championship fight in a row, but Volkanovski ha",
    "link": "https://www.marca.com/en/ufc/2025/04/13/67fb85a746163fa42e8b459d.html",
    "timestamp": "2025-04-13T09:37:18Z"
  },
  {
    "title": "India's iPhone, smartphone exports to US have 20% tariff edge over China after exemption: Industry",
    "description": "Apple's iPhone ecosystem in India has become the largest job creator in India and is one of the top exported items from the country. According to ICEA, mobile phone exports from India have crossed an all-time high of Rs 2 lakh crore in 2024-25, registering a …",
    "link": "https://economictimes.indiatimes.com/tech/technology/indias-iphone-smartphone-exports-to-us-have-20-tariff-edge-over-china-after-exemption-industry/articleshow/120252696.cms",
    "timestamp": "2025-04-13T09:33:33Z"
  },
  {
    "title": "China's Xi Courts Southeast Asia As Trump Tariffs Bite",
    "description": "Chinese President Xi Jinping will kick off a five-day, three-nation Southeast Asia tour on Monday as Beijing seeks to tighten regional trade ties and offset the impact of huge tariffs unleashed by his US counterpart Donald Trump.",
    "link": "https://www.ibtimes.com/chinas-xi-courts-southeast-asia-trump-tariffs-bite-3769877",
    "timestamp": "2025-04-13T09:33:13Z"
  },
  {
    "title": "Trump's signature dance at UFC event garners attention, netizens say 'no one can match his vibe'",
    "description": "At the UFC event, Donald Trump is seen grooving to rap rock music \"American Bad Ass\" by Kid Rock as he raises his hands to the cheering crowd. Trump was flanked by his close aides, including Elon Musk, Senator Ted Cruz, FBI director Kash Patel, Secretary of S…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-signature-dance-at-ufc-event-garners-attention-netizens-say-no-one-can-match-his-vibe/articleshow/120252664.cms",
    "timestamp": "2025-04-13T09:32:32Z"
  },
  {
    "title": "Inside Donald Trump’s relationship with God, in his own words: 'I was saved'",
    "description": "As Holy Week begins, President Trump invokes divine purpose — linking faith, survival, and destiny in a presidency shaped by a missed bullet.",
    "link": "https://www.foxnews.com/lifestyle/inside-donald-trumps-relationship-god-his-own-words",
    "timestamp": "2025-04-13T09:30:55Z"
  },
  {
    "title": "Donald Trump Booed at Coachella During Bernie Sanders Speech",
    "description": "\"I agree,\" the Vermont senator said in response to the loud boos from the crowd at the music festival in California.",
    "link": "https://www.newsweek.com/donald-trump-booed-coachella-bernie-sanders-clairo-2059128",
    "timestamp": "2025-04-13T09:30:28Z"
  },
  {
    "title": "China’s Xi courts Southeast Asia as Trump tariffs bite",
    "description": "Chinese President Xi Jinping will kick off a five-day, three-nation Southeast Asia tour on Monday as Beijing seeks to tighten regional trade ties and offset the impact of huge tariffs unleashed by his US counterpart Donald Trump. Xi will visit Vietnam, Malays…",
    "link": "https://www.digitaljournal.com/world/chinas-xi-courts-southeast-asia-as-trump-tariffs-bite/article",
    "timestamp": "2025-04-13T09:30:21Z"
  },
  {
    "title": "Accord reached 'in principle' over tackling future pandemics",
    "description": "World Health Organization (WHO) members on April 12 reached agreement over how to tackle future pandemics after three years of discussions, the co-chair of the negotiating body told AFP.",
    "link": "https://www.hurriyetdailynews.com/accord-reached-in-principle-over-tackling-future-pandemics-208003",
    "timestamp": "2025-04-13T09:29:25Z"
  },
  {
    "title": "US tariff impact on India's GDP just 0.1%, says PHDCCI",
    "description": "PHDCCI confident in India's GDP resilience against US tariffs, emphasizing price competitiveness, government support, and strategic policies.",
    "link": "https://www.thehindubusinessline.com/economy/us-tariff-impact-on-indias-gdp-just-01-says-phdcci/article69445711.ece",
    "timestamp": "2025-04-13T09:29:07Z"
  },
  {
    "title": "Trump tariffs ‘increase risk’ of financial crisis, Germany’s Merz warns",
    "description": "Germany's incoming Chancellor wants zero tariffs on transatlantic trade.",
    "link": "https://www.politico.eu/article/donald-trump-policies-financial-crisis-friedrich-merz-tariffs/",
    "timestamp": "2025-04-13T09:28:40Z"
  },
  {
    "title": "US accused of ‘colonial shakedown’ as it ‘demands control’ from Ukraine of key pipeline carrying Russian gas",
    "description": "Kremlin says relations with the United States are ‘moving ahead very well’",
    "link": "https://www.irishtimes.com/world/europe/2025/04/13/us-accused-of-colonial-shakedown-as-it-demands-control-from-ukraine-of-key-pipeline-carrying-russian-gas/",
    "timestamp": "2025-04-13T09:27:56Z"
  },
  {
    "title": "'SNL' Mocks Donald Trump' Tariffs Policy in Easter Sketch: Watch",
    "description": "President Donald Trump’s tariff plans were repeatedly mocked on the April 12 episode of ‘Saturday Night Live.’ During the Cold Open, Trump, played by James Austin Johnson, poked fun at the economy in an Easter sketch that saw him compare himself to Jesus.",
    "link": "https://people.com/snl-cold-open-trump-tariffs-easter-11714328",
    "timestamp": "2025-04-13T09:27:13Z"
  },
  {
    "title": "\"Tax On Americans\": China's Message To US Citizens Amid Trump's Tariff War",
    "description": "Amid the escalating trade war between the United States and China, Beijing seems to have altered its strategy of dealing with Washington by aiming its message directly at the American public instead of the Trump administration.",
    "link": "https://www.ndtv.com/world-news/chinas-message-to-us-citizens-amid-donald-trumps-tariff-war-tax-on-americans-8154104",
    "timestamp": "2025-04-13T09:21:20Z"
  },
  {
    "title": "‘Dozens dead and wounded’ in Russian attack on Ukraine’s Sumy: Zelenskyy",
    "description": "Ukrainian president condemns 'terrible' missile strike days after Trump envoy Steve Witkoff met Russian President Putin.",
    "link": "https://www.aljazeera.com/news/2025/4/13/dozens-of-dead-and-wounded-in-russian-strike-on-ukraines-sumy-zelenskyy",
    "timestamp": "2025-04-13T09:20:55Z"
  },
  {
    "title": "Kenyan Shillings Hit in Global Shakeup as US Dollar Weakens",
    "description": "The weakening of the US dollar, now trading at a three-year low against the euro, is raising concerns among global fund managers impacting Kenyan shillings.",
    "link": "https://thekenyatimes.com/business/kenyan-shilling-affected-in-global-shakeup-as-us-dollar-weakens/",
    "timestamp": "2025-04-13T09:18:02Z"
  },
  {
    "title": "Pols & Politics: Gov. Maura Healey ceding reelection messaging to MassDems — for now",
    "description": "Massachusetts Democrats are making their playbook for countering Republican candidates for governor clear.",
    "link": "https://www.bostonherald.com/2025/04/13/pols-politics-gov-maura-healey-ceding-reelection-messaging-to-massdems-for-now/",
    "timestamp": "2025-04-13T09:16:30Z"
  },
  {
    "title": "Bernie Sanders Crashes Coachella, Hits Crowd With Anti-Trump Screed: 'Turn Away at Your Own Peril'",
    "description": "US senator Bernie Sanders became one of Coachella’s top cameos so far, drawing a massive crowd on Saturday as he made a pitstop at the premier music festival.\nThe post Bernie Sanders Crashes Coachella, Hits Crowd With Anti-Trump Screed: ‘Turn Away at Your Own…",
    "link": "https://www.breitbart.com/entertainment/2025/04/13/bernie-sanders-crashes-coachella-hits-crowd-with-anti-trump-screed-turn-away-at-your-own-peril/",
    "timestamp": "2025-04-13T09:15:19Z"
  },
  {
    "title": "Donald Trump Arrives At UFC to Cheers, 'USA' Chants",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump received a standing ovation as he attended a UFC event in Miami on Saturday night alongside several top members of his administration, arriving to chants of \"U-S-A\" and greeting fel…",
    "link": "https://biztoc.com/x/39e3af35bb3920df",
    "timestamp": "2025-04-13T09:07:53Z"
  },
  {
    "title": "Dozens dead in Ukraine's Sumy after Russian strike, acting mayor says",
    "description": "Acting mayor Artem Kobzar said more than 20 civilians were dead \"as a result of a missile strike\".",
    "link": "https://www.abc.net.au/news/2025-04-13/dozens-dead-in-ukraine-sumy-region-from-russian-strike/105172014",
    "timestamp": "2025-04-13T09:04:00Z"
  },
  {
    "title": "G-7 central banks prepare first responses to US tariff chaos",
    "description": "<p>The first Group of Seven monetary policy decisions since President Donald Trump&rsquo;s trade war unleashed global market turmoil may prompt diverging responses from either side of the Atlantic.</p>",
    "link": "https://www.bangkokpost.com/business/general/3002294/g-7-central-banks-prepare-first-responses-to-us-tariff-chaos",
    "timestamp": "2025-04-13T09:01:00Z"
  },
  {
    "title": "Hong Kong prepares for the worst as city’s three trade offices in US may close",
    "description": "'We will work harder to extend our international trade network, sign more trade deals with different economies and deepen our e-commerce development,' commerce chief says Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/04/13/hong-kong-prepares-for-the-worst-as-citys-three-trade-offices-in-us-may-close",
    "timestamp": "2025-04-13T09:01:00Z"
  },
  {
    "title": "Meta Wants to Tilt Its AI to the Right",
    "description": "Are Mark Zuckerberg and Meta’s attempts to counteract liberal bias in the company’s AI model just a way to dodge a fight with Trump, or will they end up promoting his biases and agenda, too?",
    "link": "http://nymag.com/intelligencer/article/meta-mark-zuckerberg-llama-ai-model-liberal-bias-donald-trump.html",
    "timestamp": "2025-04-13T09:00:40Z"
  },
  {
    "title": "Donald Trump Arrives At UFC to Cheers, 'USA' Chants",
    "description": "\"The crowd will erupt in applause as he makes his signature walkout,\" a White House aide said ahead of Trump's appearance in Miami.",
    "link": "https://www.newsweek.com/donald-trump-ufc-miami-elon-musk-dana-white-2059118",
    "timestamp": "2025-04-13T09:00:14Z"
  },
  {
    "title": "Netflix, Goldman Sachs, Citigroup, and more stocks to watch this week",
    "description": "Markets have been on a rollercoaster ever since President Donald Trump declared “Liberation Day,” unleashing a blur of tariff impositions, reversals, reimpositions, retaliatory blows, and exemptions.Read more...",
    "link": "https://qz.com/netflix-goldman-sachs-citi-bank-america-earnings-stocks-1851775909",
    "timestamp": "2025-04-13T09:00:00Z"
  },
  {
    "title": "The battle for the Senate takes shape, with both parties waiting on governors to boost their chances",
    "description": "The fight for the Senate in 2026 is beginning to take shape, with more candidates launching campaigns in recent days and additional announcements expected in the coming weeks.",
    "link": "https://www.nbcnews.com/politics/2026-election/battle-senate-takes-shape-both-parties-waiting-governors-boost-chances-rcna200618",
    "timestamp": "2025-04-13T09:00:00Z"
  },
  {
    "title": "US companies are demanding price cuts from Chinese suppliers to mitigate tariffs— but there's nothing left to squeeze",
    "description": "US firms are trying to get price cuts from Chinese suppliers to mitigate tariffs, but supply chain experts say there are no margins left.",
    "link": "https://www.businessinsider.com/us-companies-china-suppliers-cut-prices-trump-tariff-war-2025-4",
    "timestamp": "2025-04-13T08:58:01Z"
  },
  {
    "title": "How Trump’s trade war with China might hurt the American farmers who voted him in | CNN Business",
    "description": "Which nation might blink first in the escalating China-US trade war? CNN examined China’s largest import from the United States – soybeans – to see how that demand could be met elsewhere and what US farmers stand to lose.",
    "link": "https://www.cnn.com/2025/04/13/business/american-farmer-china-trade-trump-intl-hnk-dg/index.html",
    "timestamp": "2025-04-13T08:57:07Z"
  },
  {
    "title": "US: Bernie Sanders' rally draws record crowd in LA",
    "description": "A \"Fighting Oligarchy\" rally in Los Angeles has drawn a big crowd as opposition grows to Donald Trump's policies. Left-wing Senator Bernie Sanders and Democrat Alexandria Ocasio-Cortez have become vocal protest figures.",
    "link": "https://www.dw.com/en/us-bernie-sanders-rally-draws-record-crowd-in-la/a-72231033",
    "timestamp": "2025-04-13T08:55:00Z"
  },
  {
    "title": "What baby boomers learned from weathering the Great Recession — and what they regret",
    "description": "Three Americans in or near retirement told BI how they navigated the 2008 Great Recession — and their top ways to cope with uncertainty.",
    "link": "https://www.businessinsider.com/baby-boomers-great-recession-retirement-investment-lessons-2025-4",
    "timestamp": "2025-04-13T08:49:01Z"
  },
  {
    "title": "Reducing U.S. troops in South Korea would be 'problematic,' top commander warns",
    "description": "Washington DC (UPI) Apr 11, 2025 \n\n\n As North Korea continues to develop its weapons programs and strengthens military ties with Russia, a reduction of U.S. troops based in South Korea would be \"problematic,\" the commander of U.S. Forces Korea said. \n Army Ge…",
    "link": "https://www.spacewar.com/reports/Reducing_US_troops_in_South_Korea_would_be_problematic_top_commander_warns_999.html",
    "timestamp": "2025-04-13T08:48:26Z"
  },
  {
    "title": "U.S., Iran conduct 'indirect' nuclear talks in Oman, plan more negotiations",
    "description": "Washington DC (UPI) Apr 12, 2025 \n\n\n The United States and Iran on Saturday began \"indirect\" negotiations on a new nuclear deal in the Gulf Arab nation of Oman and plan to meet again in seven days. \n Before the talks, both sides' leaders issued warnings. U.S.…",
    "link": "https://www.spacewar.com/reports/US_Iran_conduct_indirect_nuclear_talks_in_Oman_plan_more_negotiations_999.html",
    "timestamp": "2025-04-13T08:48:26Z"
  },
  {
    "title": "Hegseth cuts $5.1B in spending on 'wasteful' Pentagon consulting contracts",
    "description": "Washington DC (UPI) Apr 12, 2025 \n\n\n Defense Secretary Pete Hegseth this week signed a memorandum cutting $5.1 billion in consulting contracts at the Pentagon, calling them \"wasteful.\" \n The memo's subject line Thursday was \"Continuing Elimination of Wasteful…",
    "link": "https://www.spacewar.com/reports/Hegseth_cuts_51B_in_spending_on_wasteful_Pentagon_consulting_contracts_999.html",
    "timestamp": "2025-04-13T08:48:26Z"
  },
  {
    "title": "Jasmine Crockett says it’s ‘beyond wild’ that nobody is questioning Trump’s mental fitness - NewsBreak",
    "description": "It’s “beyond wild” that people are not questioning Donald Trump ’s mental fitness amid his ongoing onslaught of tariffs against U.S. trading partners, Jas",
    "link": "https://www.newsbreak.com/share/3960381876146-jasmine-crockett-says-it-s-beyond-wild-that-nobody-is-questioning-trump-s-mental-fitness?s=a2&share_destination_id=Mzk0NzE1NjEtMTc0NDUzNDAyODc0MQ%3D%3D&pd=02fcM5wL&hl=en_US&send_time=1744534028&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.15.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-v6%2Cns_push_exp_rt_bucketv12-v9%2Cns_local_strategy_25q1_exp-v2%2Cns_foryou_model_exp_25q1-v6%2Cns_foryou_blend_exp_25q1-v2",
    "timestamp": "2025-04-13T08:47:54Z"
  },
  {
    "title": "Trump's 'Made in USA' dream could ‘TRIPLE’ iPhone prices: Here's where it costs the least",
    "description": "iPhone: If Donald Trump's ‘Made in USA’ iPhone dream turns into a reality, its prices are likely to triple. Here's where it costs the least",
    "link": "https://www.livemint.com/companies/trumps-made-in-usa-dream-could-triple-iphone-prices-heres-where-it-costs-the-least-11744526210556.html",
    "timestamp": "2025-04-13T08:43:37Z"
  },
  {
    "title": "Trump says ‘legendary’ crowd reaction at UFC 314 shows the administration is ‘doing a good job’",
    "description": "President Donald Trump called it a \"great honor\" after fans at UFC 314 on Saturday greeted him with what he says was a \"legendary\" reaction.",
    "link": "https://www.foxnews.com/sports/trump-says-legendary-crowd-reaction-ufc-314-shows-administration-doing-good-job",
    "timestamp": "2025-04-13T08:40:49Z"
  },
  {
    "title": "'SNL' Casts Trump Family in 'The White Potus' Sketch",
    "description": "The \"Saturday Night Live\" cast checked into\" The White Lotus\" for their latest political skit.",
    "link": "https://www.newsweek.com/snl-white-lotus-trump-family-skit-2059121",
    "timestamp": "2025-04-13T08:39:13Z"
  },
  {
    "title": "'Most irritating person': Trump officials raise alarm over Elon Musk behaviour amid claims he is 'high'",
    "description": "Some officials in the White House have raised alarm over DOGE chief Elon Musk's behaviour. An official even described him as the 'most irritating person' and someone who always tries to be funny. Elon Musk's presence in Trump's administration is reportedly un…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-behaviour-white-house-most-irritating-person-trump-officials-raise-alarm-over-elon-musk-behaviour-amid-claims-he-is-high/articleshow/120251555.cms",
    "timestamp": "2025-04-13T08:37:22Z"
  },
  {
    "title": "How Trump’s trade war with China will hurt the American farmers who voted him in",
    "description": "US President Donald Trump has imposed an additional 145% tariffs on all Chinese imports despite pausing his “reciprocal” levies on all other countries in a stunning reversal last week.\nBut China is not backing down, saying it will “fight to the end” if Trump …",
    "link": "https://biztoc.com/x/8c2570d0e5310d96",
    "timestamp": "2025-04-13T08:35:30Z"
  },
  {
    "title": "Manu Joseph: India has a tariff on America’s huge cultural surplus",
    "description": "We are more interested in US culture than America cares about ours, as seen in fields ranging from cinema to literature, but we may already have a remedy in place. It’s unconscious rather than official, but there’s evidence that a cultural tariff exists.",
    "link": "https://www.livemint.com/opinion/online-views/america-cultural-dominance-us-trade-imbalance-india-us-relations-cultural-deficit-soft-power-hollywood-cinema-trump-11744369408511.html",
    "timestamp": "2025-04-13T08:30:08Z"
  },
  {
    "title": "Watch: Donald Trump's Dance Moves At UFC Event In Miami",
    "description": "US President Donald Trump&rsquo;s appearance at the UFC event in Miami drew massive attention",
    "link": "https://www.ndtv.com/world-news/watch-donald-trumps-dance-moves-at-ufc-event-in-miami-8153781",
    "timestamp": "2025-04-13T08:27:19Z"
  },
  {
    "title": "Social Security Announces Major Change to Filing Claims",
    "description": "The SSA said that with \"enhanced technology,\" it can now detect suspicious activity in telephone claims.",
    "link": "https://www.newsweek.com/social-security-major-change-filing-claims-fraud-2059113",
    "timestamp": "2025-04-13T08:25:44Z"
  },
  {
    "title": "환율전쟁과 선거",
    "description": "미국 자영업·소상공인 카드론도 못 쓴다 Morgan Stanley’s willingness to stick it out with Elon Musk is giving its first-quarter results a healthy boost https://t.co/SEGeK4gXO6— Bloomberg (@business) April 11, 2025 Private equity firm GTCR is said to be near a deal to buy OSTTR…",
    "link": "https://ryueyes11.tistory.com/511561",
    "timestamp": "2025-04-13T08:23:20Z"
  },
  {
    "title": "17-year-old in Wisconsin allegedly killed his parents as part of a plot to assassinate Trump, FBI says",
    "description": "A Wisconsin teenager allegedly killed his parents in February as part of a plot to assassinate President Donald Trump, federal authorities said in newly unsealed court documents.",
    "link": "https://www.cnn.com/2025/04/12/us/wisconsin-teen-plot-assassinate-trump/index.html",
    "timestamp": "2025-04-13T08:21:18Z"
  },
  {
    "title": "17-year-old in Wisconsin allegedly killed his parents as part of a plot to assassinate Trump, FBI says",
    "description": "A Wisconsin teenager allegedly killed his parents in February as part of a plot to assassinate President Donald Trump, federal authorities said in newly unsealed court documents.",
    "link": "https://www.cnn.com/2025/04/13/us/wisconsin-teen-plot-assassinate-trump/index.html",
    "timestamp": "2025-04-13T08:21:18Z"
  },
  {
    "title": "Trump replaces Obama portrait with painting of assassination attempt",
    "description": "Trump replaced Obama's portrait with one of himself surviving an assassination attempt in Pennsylvania, while Obama's portrait was relocated.",
    "link": "https://www.jpost.com/international/article-849965",
    "timestamp": "2025-04-13T08:20:39Z"
  },
  {
    "title": "Kilmar Abrego Garcia ‘alive, secure’ in El Salvador: Trump administration",
    "description": "Trump administration tells court Kilmar Abrego Garcia is confined in a notorious prison but keeps mum on his return.",
    "link": "https://www.aljazeera.com/news/2025/4/13/trump-admin-says-wrongly-deported-man-is-alive-and-secure-in-el-salvador",
    "timestamp": "2025-04-13T08:16:51Z"
  },
  {
    "title": "Why a top strategist is sticking with his call for stocks to surge 22% even as the trade war roils markets",
    "description": "\"When people are vomiting up stocks, you gotta be in there cleaning it up,\" Craig Johnson told Business Insider.",
    "link": "https://www.businessinsider.com/stock-market-outlook-fresh-record-highs-soon-despite-trump-tariffs-2025-4",
    "timestamp": "2025-04-13T08:15:01Z"
  },
  {
    "title": "\"Leave Now...\": A 30-Day Warning For Foreign Nationals Staying In US",
    "description": "Foreign nationals who stay in the US longer than 30 days must register with the government and a failure to comply can lead to fines and imprisonment, the Department of Homeland Security under the Donald Trump administration has said.",
    "link": "https://www.ndtv.com/world-news/us-homeland-security-donald-trump-leave-now-a-30-day-warning-for-foreign-nationals-staying-in-us-8153704",
    "timestamp": "2025-04-13T08:11:24Z"
  },
  {
    "title": "Uncertainty over tariffs fuels recession concerns in Maine, beyond",
    "description": "Economists say Maine is likely to fare similarly to the rest of the country, or perhaps marginally better, during a possible economic downturn.",
    "link": "https://www.pressherald.com/2025/04/13/uncertainty-over-tariffs-fuels-recession-concerns-in-maine-beyond/",
    "timestamp": "2025-04-13T08:08:38Z"
  },
  {
    "title": "Michigan Gov. Gretchen Whitmer mocked for hiding face from cameras in Oval Office before Trump meeting",
    "description": "Michigan Gov. Gretchen Whitmer was mocked after she was captured hiding her face behind a stack of binders to avoid being seen standing in the Oval Office when President Donald Trump spoke to the press. The 53-year-old Democrat was flanked by two White House …",
    "link": "https://freerepublic.com/focus/f-chat/4310714/posts",
    "timestamp": "2025-04-13T08:02:26Z"
  },
  {
    "title": "Viral CIA file about aliens attacking soldiers takes off with UFO intrigue",
    "description": "A Soviet-era document published on the CIA's website describes a retaliatory attack by aliens after soldiers shot down a UFO nearly 30 years ago.",
    "link": "https://www.foxnews.com/us/viral-cia-file-about-aliens-attacking-soldiers-takes-off-ufo-intrigue",
    "timestamp": "2025-04-13T08:00:56Z"
  },
  {
    "title": "Week in review: Microsoft patches exploited Windows CLFS 0-day, WinRAR MotW bypass flaw fixed",
    "description": "Here’s an overview of some of last week’s most interesting news, articles, interviews and videos: Microsoft fixes actively exploited Windows CLFS zero-day (CVE-2025-29824) April 2025 Patch Tuesday is here, and Microsoft has delivered fixes for 120+ vulnerabil…",
    "link": "https://www.helpnetsecurity.com/2025/04/13/week-in-review-microsoft-patches-exploited-windows-clfs-0-day-winrar-motw-bypass-flaw-fixed/",
    "timestamp": "2025-04-13T08:00:52Z"
  },
  {
    "title": "Election Diary: Liberal and Labor launches focus on housing, but who thinks either side can fix that crisis any time soon?",
    "description": "Both major parties were spending big at their campaign launches, with housing as the centrepiece.",
    "link": "https://theconversation.com/election-diary-liberal-and-labor-launches-focus-on-housing-but-who-thinks-either-side-can-fix-that-crisis-any-time-soon-254206",
    "timestamp": "2025-04-13T08:00:33Z"
  },
  {
    "title": "This Bloc challenger lost by 12 votes last time. He's back to take on a Liberal star candidate",
    "description": "CBC's The House profiles the Quebec riding of Châteauguay-Les Jardins-de-Napierville, where Bloc challenger Patrick O'Hara, who lost by 12 votes last election, is back to take on Liberal star candidate Nathalie Provost.",
    "link": "https://www.cbc.ca/news/politics/this-bloc-challenger-lost-by-12-votes-last-time-he-s-back-to-take-on-a-liberal-star-candidate-1.7508436",
    "timestamp": "2025-04-13T08:00:00Z"
  },
  {
    "title": "China admitted its role in Volt Typhoon cyberattacks on U.S. infrastructure",
    "description": "China admitted in a secret meeting with U.S. officials that it conducted Volt Typhoon cyberattacks on U.S. infrastructure, WSJ reports. China reportedly admitted in a secret meeting with U.S. officials that it carried out cyberattacks on U.S. infrastructure, …",
    "link": "https://securityaffairs.com/176485/apt/china-admitted-its-role-in-volt-typhoon-cyberattacks-on-u-s-infrastructure.html",
    "timestamp": "2025-04-13T07:57:27Z"
  },
  {
    "title": "President Trump confidently praises his own health, gives three-word update after undergoing check-up",
    "description": "A confident Donald Trump extolled the virtues of his own health today after undergoing his annual physical assessment. Trump praised his own health even though official medical reports are yet to be published for public scrutiny over the weekend. Trump devote…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/president-trump-confidently-praises-his-own-health-gives-three-word-update-after-undergoing-check-up/articleshow/120250625.cms",
    "timestamp": "2025-04-13T07:56:24Z"
  },
  {
    "title": "Malaysia should see how it can capitalise on US tariffs",
    "description": "KOTA KINABALU: Malaysia should seize the opportunity to maintain the 10% tariff imposed by the United States on imported goods, said National Consumer Foundation (NCF) Sabah Chapter chairman David Chan. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/13/malaysia-should-see-how-it-can-capitalise-on-us-tariffs",
    "timestamp": "2025-04-13T07:52:00Z"
  },
  {
    "title": "Indonesian govt urged to engage both China and US on tariff policy",
    "description": "The Indonesian government should also negotiate with China in response to the tariff policy imposed by US President Donald Trump, said Mari Elka Pangestu, ...",
    "link": "https://en.antaranews.com/news/351561/indonesian-govt-urged-to-engage-both-china-and-us-on-tariff-policy",
    "timestamp": "2025-04-13T07:51:56Z"
  },
  {
    "title": "China's Xi vows to Indonesia's Prabowo to deepen partnership: Xinhua",
    "description": "<p>SHANGHAI - Chinese President Xi Jinping vowed to deepen his country's strategic partnership with Indonesia in a call with President Prabowo Subianto on Sunday, China's official Xinhua News Agency reported.</p>",
    "link": "https://www.bangkokpost.com/world/3002281/chinas-xi-vows-to-indonesias-prabowo-to-deepen-partnership-xinhua",
    "timestamp": "2025-04-13T07:51:00Z"
  },
  {
    "title": "Trump tells reporters Iran nuclear talks are ‘going okay’",
    "description": "US President Donald Trump says nuclear negotiations with Iran are ‘going okay’, after delegates met in Oman.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/4/13/trump-tells-reporters-iran-nuclear-talks-are-going",
    "timestamp": "2025-04-13T07:48:37Z"
  },
  {
    "title": "'The biggest focus was on China...': Expert breaks down Trump tariffs, effect",
    "description": "The US-China trade war is brewing as President Trump threatens tariffs over 100%, potentially leading to significant economic disruption across the world.",
    "link": "https://www.businesstoday.in/latest/economy/story/the-biggest-focus-was-on-china-expert-breaks-down-trump-tariffs-effect-471851-2025-04-13",
    "timestamp": "2025-04-13T07:37:57Z"
  },
  {
    "title": "Ethereum Stays Below Realized Price: Once-In-A-Cycle Opportunity?",
    "description": "Ethereum surprised the market with a powerful bounce on Wednesday, surging more than 21% from its recent low of $1,380. The move came shortly after US President Donald Trump announced a 90-day pause on reciprocal tariffs for all countries except China, which …",
    "link": "http://www.newsbtc.com/news/ethereum/ethereum-stays-below-realized-price-once-in-a-cycle-opportunity/",
    "timestamp": "2025-04-13T07:30:09Z"
  },
  {
    "title": "Trump tariffs: The global bond market achieved what diplomacy couldn’t",
    "description": "It was ultimately a sharp sell-off of Treasury bonds that made the US pull back from its ‘reciprocal tariff’ misadventure. It has revealed a limit to how far Trump can push his trade agenda.",
    "link": "https://www.livemint.com/opinion/online-views/trump-tariffs-us-bond-market-india-fiscal-deficit-global-trade-war-us-treasury-yields-china-us-trade-tensions-currency-11744369651805.html",
    "timestamp": "2025-04-13T07:30:07Z"
  },
  {
    "title": "Why US Wants Ukraine To Give It Control Of Key Pipeline Carrying Russian Gas",
    "description": "The Trump administration has a new demand-- US control over a crucial pipeline passing through Ukraine that&#039;s used to send Russian gas to Europe.",
    "link": "https://www.ndtv.com/world-news/us-ukraine-mineral-deal-why-trump-wants-kyiv-to-handover-key-pipeline-carrying-russian-gas-8153454",
    "timestamp": "2025-04-13T07:25:36Z"
  },
  {
    "title": "US tariffs on low value Chinese e-commerce shipments opens doors for Indian exporters: GTRI",
    "description": "A US crackdown on low-value Chinese e-commerce shipments presents a significant opportunity for Indian exporters, particularly in customized goods. However, realizing this potential requires urgent reforms to India's trade system, which currently favors large…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-tariffs-on-low-value-chinese-e-commerce-shipments-opens-doors-for-indian-exporters-gtri/articleshow/120250036.cms",
    "timestamp": "2025-04-13T07:24:01Z"
  },
  {
    "title": "Tariff tensions threaten China–US supply chains, stir uncertainty among businesses, market: Report",
    "description": "Donald Trump's escalating trade war imposes high tariffs, disrupting US-China trade ties and challenging global market stability.",
    "link": "https://www.businesstoday.in/latest/economy/story/us-china-trade-war-impact-of-retaliatory-tariffs-on-global-markets-471849-2025-04-13",
    "timestamp": "2025-04-13T07:21:23Z"
  },
  {
    "title": "Russia and Ukraine accuse each other of failing to pause strikes after U.S. envoy leaves Moscow",
    "description": "Russia and Ukraine’s top diplomats on Saturday used a high-level conference in Turkey to once again trade accusations of violating a tentative U.S.-brokered deal to pause strikes on energy infrastructure, underscoring the challenges of negotiating an end to t…",
    "link": "https://www.nbcnews.com/news/world/russia-ukraine-accuse-pause-strikes-us-envoy-leaves-moscow-rcna201027",
    "timestamp": "2025-04-13T07:16:02Z"
  },
  {
    "title": "Trade tariffs could lead to a rise in cyber threats: Cybersecurity experts",
    "description": "The manufacturing sector, navigating operational challenges due to tariffs, should also prioritise cybersecurity to safeguard against disruptions and intellectual property (IP)  theft",
    "link": "https://www.thehindubusinessline.com/info-tech/trade-tariffs-could-lead-to-a-rise-in-cyber-threats-cybersecurity-experts/article69445467.ece",
    "timestamp": "2025-04-13T07:15:45Z"
  },
  {
    "title": "Elon Musk's days in Trump administration could end in less than 50 days? Lawmakers' big move against DOGE chief",
    "description": "Is Elon Musk's DOGE nearing an end? Will he be forced to move out of the Trump administration in less than 50 days? A group of 77 Democratic lawmakers has called on the White House to commit to a May 30 deadline for the billionaire to complete his role within…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musks-days-in-trump-administration-could-end-in-less-than-50-days-lawmakers-big-move-against-doge-chief/articleshow/120249934.cms",
    "timestamp": "2025-04-13T07:12:01Z"
  },
  {
    "title": "Japan official wants stronger yen, says Tokyo shouldn't sell Treasurys",
    "description": "Japan should not intentionally sell its U.S. Treasury holdings in retaliation against tariffs levied by President Donald Trump, official says.",
    "link": "https://www.cnbc.com/2025/04/13/japan-official-wants-stronger-yen-says-tokyo-shouldnt-sell-treasurys.html",
    "timestamp": "2025-04-13T07:07:57Z"
  },
  {
    "title": "Map Shows How Trump, Putin and Xi Could Carve Up the Globe",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump's outreach to Russian President Vladimir Putin to try to end the war with Ukraine comes amid jockeying among leaders for spheres of influence while China seeks to exert its clout. A…",
    "link": "https://biztoc.com/x/6120e6c164782180",
    "timestamp": "2025-04-13T07:06:59Z"
  },
  {
    "title": "Bernie Sanders fights apathy on American left",
    "description": "The 83-year-old senator is drawing tens of thousands of people to his \"fighting oligarchy\" rallies around the country.",
    "link": "https://www.japantimes.co.jp/news/2025/04/13/world/politics/bernie-sanders-apathy-left/",
    "timestamp": "2025-04-13T07:05:00Z"
  },
  {
    "title": "Saturday Night Live Has a Winner Spoof with The White Potus",
    "description": "Host Jon Hamm is an unhinged RFK Jr.; musical guest Lizzo is “Tariffied”",
    "link": "https://www.vanityfair.com/hollywood/story/saturday-night-live-jon-hamm-the-white-potus",
    "timestamp": "2025-04-13T07:03:12Z"
  },
  {
    "title": "Maureen Dowd: So much about Donald Trump just does not add up",
    "description": "With his miscalculations on trade tariffs, tax cuts and more, the future of the US is at stake",
    "link": "https://www.irishtimes.com/world/us/2025/04/13/maureen-dowd-so-much-about-donald-trump-just-does-not-add-up/",
    "timestamp": "2025-04-13T07:02:23Z"
  },
  {
    "title": "Bitcoin: Experts split on BTC’s long-term outlook- Here’s why",
    "description": "BTC struggles with volatility; optimistic on-chain metrics hint at potential breakout above $94,500.",
    "link": "https://ambcrypto.com/bitcoin-experts-split-on-btcs-long-term-outlook-heres-why/",
    "timestamp": "2025-04-13T07:00:20Z"
  },
  {
    "title": "Map Shows How Trump, Putin and Xi Could Carve Up the Globe",
    "description": "The consequences of a deal between Trump and Putin on Ukraine could resonate well beyond Europe's borders.",
    "link": "https://www.newsweek.com/trump-putin-map-china-xi-2058157",
    "timestamp": "2025-04-13T07:00:01Z"
  },
  {
    "title": "Michigan Gov. Gretchen Whitmer mocked for hiding face from cameras in Oval Office before Trump meeting",
    "description": "Michigan Gov. Gretchen Whitmer is being panned for hiding her face behind a stack of binders so as not to be seen standing in the Oval Office when President Donald Trump spoke to the press.",
    "link": "https://nypost.com/2025/04/13/us-news/michigan-gov-gretchen-whitmer-hid-face-behind-binders-during-trump-oval-office-press-conference/",
    "timestamp": "2025-04-13T06:49:38Z"
  },
  {
    "title": "The U.S. and Russia are negotiating in bad faith",
    "description": "For now, Trump says he is “pissed off” at Putin for not being more amenable to his administration’s ceasefire proposals and he is threatening to impose yet more sanctions.",
    "link": "https://www.japantimes.co.jp/commentary/2025/04/13/world/us-russia-baid-faith-negotiations/",
    "timestamp": "2025-04-13T06:43:00Z"
  },
  {
    "title": "Photo Shows Musk's \"Top Secret\" Notepad At Trump's Cabinet Meet, He Reacts",
    "description": "A photo of Elon Musk&#039;s notepad from a cabinet meeting with Donald Trump sparked buzz online after the words Top Secret were seen scribbled across the page.",
    "link": "https://www.ndtv.com/world-news/elon-musks-top-secret-notepad-at-donald-trumps-cabinet-meet-goes-viral-he-responds-with-emoji-8153210",
    "timestamp": "2025-04-13T06:35:54Z"
  },
  {
    "title": "Xi's Southeast Asia tour, Singapore monetary policy, TSMC earnings",
    "description": "Welcome to Your Week in Asia.\nChinese President Xi Jinping heads to Southeast Asia for a three-nation tour, just as the region begins to grapple with the fallout from sweeping trade tariffs introduced by U.S. leader Donald Trump.\nInvestors are looking out for…",
    "link": "https://biztoc.com/x/a27abe635676bd84",
    "timestamp": "2025-04-13T06:34:13Z"
  },
  {
    "title": "How The Trump Family Is Going All-In On Crypto Projects",
    "description": "Donald Trump is already the richest person to have ever become US president, and his non-crypto holdings include significant investments in real estate.",
    "link": "https://www.ndtv.com/world-news/how-the-trump-family-is-going-all-in-on-crypto-projects-8153196",
    "timestamp": "2025-04-13T06:34:08Z"
  },
  {
    "title": "Trump’s tariffs: What the exemption of smartphones and computers means for the market – New announcements tomorrow",
    "description": "The US president said that on Monday he will give \"very specific answers\" about this decision and the plans for semiconductors\nThe post Trump’s tariffs: What the exemption of smartphones and computers means for the market – New announcements tomorrow appeared…",
    "link": "https://en.protothema.gr/2025/04/13/trumps-tariffs-what-the-exemption-of-smartphones-and-computers-means-for-the-market-new-announcements-tomorrow/",
    "timestamp": "2025-04-13T06:32:45Z"
  },
  {
    "title": "From viral videos to AI giant: How ByteDance built a tech empire",
    "description": "ByteDance is also using the data as the linchpin of a growing business in artificial intelligence. The company has invested billions of dollars in the infrastructure needed to power AI systems, building vast data centers in China and Southeast Asia and buying…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/from-viral-videos-to-ai-giant-how-bytedance-built-a-tech-empire/articleshow/120249640.cms",
    "timestamp": "2025-04-13T06:31:52Z"
  },
  {
    "title": "US trade uncertainties to undermine biz confidence, adversely impact growth in Asian region: Moody's",
    "description": "US-China tariff tensions pose downside risks to Asian growth; India may benefit from investment shifts over time.",
    "link": "https://www.thehindubusinessline.com/economy/us-trade-uncertainties-to-undermine-biz-confidence-adversely-impact-growth-in-asian-region-moodys/article69445502.ece",
    "timestamp": "2025-04-13T06:29:06Z"
  },
  {
    "title": "Protect Indonesia's economy amid Trump policies: DEN member",
    "description": "Member of the National Economic Council (DEN), Chatib Basri, emphasized the importance of protecting the domestic economy to ensure Indonesia remains ...",
    "link": "https://en.antaranews.com/news/351537/protect-indonesias-economy-amid-trump-policies-den-member",
    "timestamp": "2025-04-13T06:21:34Z"
  }
]