[
  {
    "title": "Splinter at the Munich Security Conference: America, The Toxic Ex",
    "description": "Rubio made the MAGA nativism sound nicer, and Democrats promised a post-Trump restoration, but the damage to the Transatlantic relationship has been done.",
    "link": "https://www.jezebel.com/splinter-munich-security-conference",
    "timestamp": "2026-02-16T17:16:02Z"
  },
  {
    "title": "Ahead of Hungary's elections, Rubio says Trump is committed to PM Orban's success",
    "description": "BUDAPEST, Feb 16 (Reuters) - U.S. President ⁠Donald Trump is committed to the success of Hungarian Prime Minister Viktor Orban because his leadership and rapport with Trump are crucial to U.S. interests, ⁠U.S. Secretary of State Marco Rubio said on Monday, of…",
    "link": "https://www.thestar.com.my/news/world/2026/02/17/ahead-of-hungary039s-elections-rubio-says-trump-is-committed-to-pm-orban039s-success",
    "timestamp": "2026-02-16T17:15:00Z"
  },
  {
    "title": "Tom Homan Gets Big Mad On The Sunday Shows",
    "description": "We watch so you never have to!",
    "link": "https://www.wonkette.com/p/tom-homan-gets-big-mad-on-the-sunday",
    "timestamp": "2026-02-16T17:10:28Z"
  },
  {
    "title": "Crown Prince Pahlavi: The regime is stalling for time",
    "description": "In a Fox News interview, Reza Pahlavi urged President Trump and the international community to increase pressure on Iran’s regime and support anti-government protesters.",
    "link": "https://www.israelnationalnews.com/news/422516",
    "timestamp": "2026-02-16T17:09:38Z"
  },
  {
    "title": "How Vaccines Boost Our Immune System",
    "description": "Natural Resources Committee Democrats Respond to Trump’s Advancement of the Keystone and Dakota Access Pipelines\n\n This is a press release from the Natural Resources Committee Democrats, US House of Representatives concerning President Trump's decision and ac…",
    "link": "https://scienceblogs.com/sb-admin/2026/02/16/how-vaccines-boost-our-immune-system-151471",
    "timestamp": "2026-02-16T17:09:13Z"
  },
  {
    "title": "Will Capping Credit-Card Interest Rates Help Ordinary Americans?",
    "description": "The federal cap on credit-card interest rates that US President Donald Trump has proposed would, in theory, prevent issuers from gouging customers. But not everyone agrees that this would be good for Americans, especially lower-income households that are ofte…",
    "link": "https://www.project-syndicate.org/commentary/will-trump-cap-on-credit-card-interest-rates-benefit-americans-by-jeffrey-frankel-2026-02",
    "timestamp": "2026-02-16T17:07:47Z"
  },
  {
    "title": "Netanyahu reiterates Israel’s stance in advance of US-Iran nuclear talks",
    "description": "Tehran considers zero enrichment a violation of country’s rights under nuclear non-proliferation pact",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/16/netanyahu-reiterates-israels-stance-in-advance-of-us-iran-nuclear-talks/",
    "timestamp": "2026-02-16T17:05:42Z"
  },
  {
    "title": "Coco Gauff on situation in US: \"I don't think people should die in the streets just for existing\"",
    "description": "Since the beginning of Donald Trump&apos;s crusade against immigration in Minnesota and the controversial raids by the Immigration and Customs Enforcement Service (ICE), American a",
    "link": "https://www.marca.com/en/tennis/2026/02/16/69934c9f268e3e87148b4587.html",
    "timestamp": "2026-02-16T17:03:59Z"
  },
  {
    "title": "Homan: ‘Small Force’ to Remain in Minnesota After Ending ICE Surge",
    "description": "\"...there will be a small force, a security force, what we call RFQs, that will be our security forces, that will respond to when our agents are out.\"\nThe post Homan: ‘Small Force’ to Remain in Minnesota After Ending ICE Surge first appeared on Le·gal In·sur·…",
    "link": "https://legalinsurrection.com/2026/02/homan-says-a-small-force-to-remain-in-minnesota-after-ending-ice-surge/",
    "timestamp": "2026-02-16T17:00:23Z"
  },
  {
    "title": "Obama clarifies comments on aliens being real, says he saw 'no evidence' they've made contact",
    "description": "Former U.S. president Barack Obama took to Instagram on Sunday to clarify comments he'd made on a podcast about aliens being real, saying he did not see evidence that aliens have made contact with us.",
    "link": "https://www.cbc.ca/news/world/obama-aliens-real-clarification-9.7092280",
    "timestamp": "2026-02-16T16:57:58Z"
  },
  {
    "title": "Bill Maher calls viewers who stopped watching after his Trump dinner 'idiots' in heated defense",
    "description": "Bill Maher defended his April 2025 dinner with Donald Trump in an interview posted Saturday, calling critics who stopped watching his show because of it \"idiots.\"",
    "link": "https://www.foxnews.com/media/bill-maher-calls-viewers-who-stopped-watching-after-his-trump-dinner-idiots-heated-defense",
    "timestamp": "2026-02-16T16:53:29Z"
  },
  {
    "title": "Trump’s 2025 tariffs didn’t hit China or other nations — they cost American consumers more, report finds",
    "description": "Trump tariffs 2025 impact Americans: A new study from the Federal Reserve Bank of New York reveals that Trump's 2025 tariffs have significantly impacted American consumers, with the costs primarily falling on US businesses and households rather than foreign n…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-2025-tariffs-didnt-hit-china-or-other-nations-they-cost-american-consumers-more-report-finds/articleshow/128430608.cms",
    "timestamp": "2026-02-16T16:50:00Z"
  },
  {
    "title": "Crypto company Nexo returns to US three years after clash with regulators",
    "description": "Crypto company Nexo has relaunched ​in the United States, it said on Monday, three years after leaving the country and paying a $45 million fine following clashes with regulators.",
    "link": "https://economictimes.indiatimes.com/tech/technology/crypto-company-nexo-returns-to-us-three-years-after-clash-with-regulators/articleshow/128431068.cms",
    "timestamp": "2026-02-16T16:48:51Z"
  },
  {
    "title": "Is A MAGA Family In TX Helping Cover Up Epstein Crimes In NM?",
    "description": "Don Huffines is a former Texas state senator who is currently running to become the state comptroller. His son, Colin Huffines works in the Trump White House.\nDon Huffines' family anonymously bought Jeffrey Epstein’s Zorro ranch in August 2023, four years aft…",
    "link": "https://crooksandliars.com/2026/02/maga-family-tx-helping-cover-epstein",
    "timestamp": "2026-02-16T16:48:26Z"
  },
  {
    "title": "Montana governor launches sanctuary crackdown, probes capital city over ICE limits",
    "description": "Montana governor launches investigation into Helena for allegedly violating statewide sanctuary city ban, promising penalties for violations of state law.",
    "link": "https://www.foxnews.com/politics/montana-governor-launches-sanctuary-crackdown-probes-capital-city-ice-limits",
    "timestamp": "2026-02-16T16:48:14Z"
  },
  {
    "title": "US should benefit financially for any deal to last – Iran",
    "description": "The US should reap economic benefits from any potential agreement with Iran for it to be enduring, Iranian Deputy FM Hamid Ghanbari has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632620-iran-deputy-fm-accord-us-economic-incentives/",
    "timestamp": "2026-02-16T16:47:42Z"
  },
  {
    "title": "Trump Blasts Miliband’s “Inappropriate” Net Zero Deal with California",
    "description": "Donald Trump has shared a few delicate thoughts on Ed Miliband’s net zero deal with California Governor Gavin Newsom. He told POLITICO today: “The UK’s got enough trouble without getting involved with Gavin Newscum… Gavin is a loser. Everything he’s touched t…",
    "link": "https://order-order.com/2026/02/16/trump-blasts-milibands-inappropriate-net-zero-deal-with-california/",
    "timestamp": "2026-02-16T16:47:32Z"
  },
  {
    "title": "Marjorie Taylor Greene Warns MAGA Is Losing Women Over Jeffrey Epstein",
    "description": "Former Representative Marjorie Taylor Greene is blasting the MAGA right for alienating women from the Republican Party.The MAGA loyalist turned Trump critic called out influencers on the right on Sunday for “mocking the seriousness of women who were trafficke…",
    "link": "https://newrepublic.com/post/206613/marjorie-taylor-greene-maga-losing-women-jeffrey-epstein",
    "timestamp": "2026-02-16T16:45:48Z"
  },
  {
    "title": "‘At some point, you age out’: Obama urges Democrats to pass torch to younger candidates",
    "description": "Obama calls for younger Democratic candidates to win 2026 midterms, warning older politicians can \"age out\" and lose connection to younger voters.",
    "link": "https://www.foxnews.com/politics/at-some-point-you-age-out-obama-urges-democrats-pass-torch-younger-candidates",
    "timestamp": "2026-02-16T16:45:23Z"
  },
  {
    "title": "Schumer pushes bill to give Pride flag same status as US, military flags",
    "description": "The Trump administration removed the Pride flag the at Stonewall National Monument earlier this month following an internal memo at the Department of Interior.",
    "link": "https://www.foxnews.com/politics/schumer-pushes-bill-give-pride-flag-same-status-us-military-flags",
    "timestamp": "2026-02-16T16:44:42Z"
  },
  {
    "title": "Obama Just Dropped a Truth Bomb About Aliens",
    "description": "According to former president Barack Obama, the answer to whether aliens exist or not is pretty clear-cut.",
    "link": "http://futurism.com/space/obama-aliens",
    "timestamp": "2026-02-16T16:44:27Z"
  },
  {
    "title": "Kim Dotcom wild claims about Palantir",
    "description": "Breaking Palantir was allegedly hacked. An AI agent was used to gain super-user access and here”s what the hackers allegedly found: Peter Thiel and Alex Karp commit mass surveillance of world leaders and titans of industry on a massive scale. They have thousa…",
    "link": "https://freerepublic.com/focus/f-bloggers/4367065/posts",
    "timestamp": "2026-02-16T16:43:12Z"
  },
  {
    "title": "Where do the US and Israel differ on Iran strategy?",
    "description": "Amid new talks on Iran's nuclear program, Israeli Prime Minister Benjamin Netanyahu has signaled skepticism on Tehran honoring a deal with Donald Trump.",
    "link": "https://www.dw.com/en/where-do-the-us-and-israel-differ-on-iran-strategy/a-75993517",
    "timestamp": "2026-02-16T16:41:00Z"
  },
  {
    "title": "Racist presidential humor, then and now",
    "description": "Racist humor among presidents is not a new phenomenon; it dates back to at least a century ago. So what changed? Opinion.",
    "link": "https://www.israelnationalnews.com/news/422513",
    "timestamp": "2026-02-16T16:39:10Z"
  },
  {
    "title": "Newsom signs California-UK clean energy pact (Charlie Cooper/Politico)",
    "description": "Charlie Cooper / Politico:\nNewsom signs California-UK clean energy pact  —  The deal includes greater collaboration on offshore windfarms — a great bugbear of Donald Trump.  —  LONDON — California will carry on making the case for “climate action” on the glob…",
    "link": "https://www.memeorandum.com/260216/p39",
    "timestamp": "2026-02-16T16:35:01Z"
  },
  {
    "title": "'An alarm bell': Los Alamos Visiting Nurse Service shutters amid turmoil for home health care",
    "description": "The closure should serve as a warning for the industry and policymakers, said the leader of a home and hospice care association.",
    "link": "https://www.santafenewmexican.com/news/local_news/an-alarm-bell-los-alamos-visiting-nurse-service-shutters-amid-turmoil-for-home-health-care/article_0e1e1648-7bfb-465a-b1d6-5c01d68d7c25.html",
    "timestamp": "2026-02-16T16:30:54Z"
  },
  {
    "title": "Republicans Are Suddenly Very, Very Worried About Holding the Senate",
    "description": "With midterms on the horizon, Republicans fear their party is heading toward disaster—in the Senate as well as the House of Representatives.Some Senate Republicans are sounding the alarm that the caucus is not addressing critical issues ahead of the 2026 elec…",
    "link": "https://newrepublic.com/post/206614/republicans-suddenly-very-worried-holding-senate-thune-midterms-gop",
    "timestamp": "2026-02-16T16:30:20Z"
  },
  {
    "title": "Kremlin rejects claim it poisoned Putin critic Alexei Navalny with dart frog toxin",
    "description": "‘Main issues’ of territory, nuclear plant control and postwar plans to be discussed in latest Ukraine conflict talks",
    "link": "https://www.irishtimes.com/world/europe/2026/02/16/kremlin-rejects-claim-it-poisoned-putin-critic-alexei-navalny-with-dart-frog-toxin/",
    "timestamp": "2026-02-16T16:25:30Z"
  },
  {
    "title": "‘Bigger and Better Man’: Trump Alum Praises Obama Over Response to Ape Video",
    "description": "Ex-deputy press secretary Sarah Matthews argued ex-President Barack Obama is a \"better man\" than Donald Trump because of his response to the ape video\nThe post ‘Bigger and Better Man’: Trump Alum Praises Obama Over Response to Ape Video first appeared on Medi…",
    "link": "https://www.mediaite.com/media/bigger-and-better-man-trump-alum-praises-obama-over-response-to-ape-video/",
    "timestamp": "2026-02-16T16:25:28Z"
  },
  {
    "title": "Trump is on a losing streak and taking it out on Colorado (Opinion)",
    "description": "“You can indict a ham sandwich,” former New York Court of Appeals Judge Sol Wachtler once remarked.",
    "link": "https://www.denverpost.com/2026/02/16/trump-colorado-indictment-jason-crow-failed/",
    "timestamp": "2026-02-16T16:20:19Z"
  },
  {
    "title": "NAACP asks judge to protect against 'misuse' after FBI seized of voter data in Fulton County",
    "description": "Georgia residents entrusted the state with their \"sensitive personal information\" when they registered to vote, and the Jan. 28 seizure of ballots and other election documents from the Fulton County elections hub \"breached that guarantee, infringed constituti…",
    "link": "https://www.pbs.org/newshour/politics/naacp-asks-judge-to-protect-against-misuse-after-fbi-seized-of-voter-data-in-fulton-county",
    "timestamp": "2026-02-16T16:18:29Z"
  },
  {
    "title": "Bold new US trio eyes Olympic figure skating gold while serving as role models for a new generation",
    "description": "The women targeting Olympic figure skating gold are not the dainty ice princesses of yesteryear.",
    "link": "https://www.bostonherald.com/2026/02/16/amber-glenn-alysa-liu-isabeau-levito-olympics/",
    "timestamp": "2026-02-16T16:15:12Z"
  },
  {
    "title": "Barack Obama Says Aliens Are Real, Promptly Retracts Statement",
    "description": "Reading Time: 2 minutesBarack Obama made some surprising remarks about aliens this week.\nBarack Obama Says Aliens Are Real, Promptly Retracts Statement was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/02/barack-obama-says-aliens-are-real-promptly-retracts-statement/",
    "timestamp": "2026-02-16T16:13:26Z"
  },
  {
    "title": "State fires a shot against ‘blacklisting’ conservative media",
    "description": "Plan excludes from government contracts those organizations using 'bias-rating' sources",
    "link": "https://www.wnd.com/2026/02/state-fires-shot-against-blacklisting-conservative-media/",
    "timestamp": "2026-02-16T16:12:27Z"
  },
  {
    "title": "Deaf spiral: Highlights and low-points from the Munich Security Conference",
    "description": "The US is reshaping the world as the Europeans insist on defending the ‘rules-based international order’ Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632621-munich-security-conference-recap/",
    "timestamp": "2026-02-16T16:10:27Z"
  },
  {
    "title": "Trump donor who criticized offshoring to close Ohio plant and move work to China (Michael Sainato/The Guardian)",
    "description": "Michael Sainato / The Guardian:\nTrump donor who criticized offshoring to close Ohio plant and move work to China  —  Workers decried John Paulson's plan after billionaire painted himself as advocate for domestic manufacturing  —  John Paulson, a hedge fund bi…",
    "link": "https://www.memeorandum.com/260216/p36",
    "timestamp": "2026-02-16T16:10:00Z"
  },
  {
    "title": "‘It’s F*cking Wrong’: Hollywood Star Apologizes to Transgender People for Playing ‘F*cked Up’ Crossdressing Serial Killer in ‘Silence of the Lambs’",
    "description": "Hollywood star Ted Levine has expressed regret over playing a \"f*cked up\" crossdressing serial killer in Silence of the Lambs.\nThe post ‘It’s F*cking Wrong’: Hollywood Star Apologizes to Transgender People for Playing ‘F*cked Up’ Crossdressing Serial Killer i…",
    "link": "https://www.mediaite.com/media/entertainment/its-fcking-wrong-hollywood-star-apologizes-to-transgender-people-for-playing-fcked-up-crossdressing-serial-killer-in-silence-of-the-lambs/",
    "timestamp": "2026-02-16T16:06:17Z"
  },
  {
    "title": "NZ International Convention Centre raises bar for big national, international events; clash over Christchurch pool name - Property Insider",
    "description": "The 88,000sq m NZICC can host more than 4000 people across vast event spaces.",
    "link": "https://www.nzherald.co.nz/property/property-insider-nzicc-raises-the-bar-for-big-national-international-events-seamless-operations/premium/X6Q4IZKOIVFDVM2TC73Q5KVV64/",
    "timestamp": "2026-02-16T16:00:00Z"
  },
  {
    "title": "Trump unveils maritime action plan as China dominates global shipbuilding",
    "description": "Trump administration unveils plan to reclaim U.S. maritime dominance as China controls global ship production and 99% of trade moves on foreign ships.",
    "link": "https://www.foxnews.com/politics/trump-unveils-maritime-action-plan-china-dominates-global-shipbuilding",
    "timestamp": "2026-02-16T15:53:50Z"
  },
  {
    "title": "Marco Rubio says Viktor Orbán's leadership is 'essential' to US interests (Financial Times)",
    "description": "Financial Times:\nMarco Rubio says Viktor Orbán's leadership is ‘essential’ to US interests  —  US secretary of state hails ‘golden era’ in relations with Hungary and its pro-Russian premier  —  Marco Rubio has praised Viktor Orbán's leadership as “essential” …",
    "link": "https://www.memeorandum.com/260216/p35",
    "timestamp": "2026-02-16T15:50:00Z"
  },
  {
    "title": "Trump’s new ambassador Bozell arrives in South Africa amid strained ties",
    "description": "By Nellie PeytonJOHANNESBURG, Feb 16 (Reuters) - U.S. President Donald Trump’s pick for ambassador to South Africa, conservative activist and writer Leo Brent Bozell III,… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/16/trump-s-new-ambassador-bozell-arrives-in-south-africa-amid-strained-ties",
    "timestamp": "2026-02-16T15:46:56Z"
  },
  {
    "title": "Ford is asking the Trump Administration to allow Chinese EV tech in the US",
    "description": "In what would be a “watershed moment,” Ford’s CEO, Jim Farley, reportedly spoke with the Trump Administration about partnering with Chinese EV makers in the US.\n\n\n\n more…",
    "link": "http://electrek.co/2026/02/16/ford-asks-trump-administration-allow-chinese-ev-tech-in-the-us/",
    "timestamp": "2026-02-16T15:45:40Z"
  },
  {
    "title": "Country Announces 8,000-Troop Commitment For Trump Project In Middle East",
    "description": "Indonesia plans to deploy 8,000 troops to Gaza to support a U.S.-led peacekeeping effort, becoming the first country to commit forces under the Board of Peace.",
    "link": "https://dailycaller.com/2026/02/16/country-announces-8000-troop-commitment-for-trump-project-in-middle-east/",
    "timestamp": "2026-02-16T15:45:01Z"
  },
  {
    "title": "Karoline Leavitt Says White House Has No Social Media Problem",
    "description": "Karoline Leavitt Says White House Has No Social Media Problemlittlethings.com",
    "link": "https://littlethings.com/entertainment/karoline-leavitt-social-media-problem",
    "timestamp": "2026-02-16T15:44:01Z"
  },
  {
    "title": "Russia and Ukraine head to latest U.S.-brokered talks with low expectations",
    "description": "There was no anticipation of any significant progress on ending the war at the Tuesday-Wednesday meeting in Switzerland as both sides appear to be sticking to their negotiating positions on key issues.",
    "link": "https://www.pbs.org/newshour/world/russia-and-ukraine-head-to-latest-u-s-brokered-talks-with-low-expectations",
    "timestamp": "2026-02-16T15:43:42Z"
  },
  {
    "title": "Abduction of Mexican mine workers raises doubts over touted security improvements",
    "description": "Authorities have identified five bodies and are working to identify five more.",
    "link": "https://www.bostonherald.com/2026/02/16/mexican-mine-workers-abduction/",
    "timestamp": "2026-02-16T15:42:08Z"
  },
  {
    "title": "Steve Bannon Told Jeffrey Epstein Trump Should Be Removed Via 25th Amendment During First Term",
    "description": "Steve Bannon told Jeffrey Epstein that President Donald Trump should be removed from office via the 25th Amendment back in 2019.\nThe post Steve Bannon Told Jeffrey Epstein Trump Should Be Removed Via 25th Amendment During First Term first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/steve-bannon-told-jeffrey-epstein-trump-should-be-removed-via-25th-amendment-during-first-term/",
    "timestamp": "2026-02-16T15:40:53Z"
  },
  {
    "title": "Marco Rubio's Imperialist Munich Speech Seen as 'Cause for Worry, Not Applause'",
    "description": "US Secretary of State Marco Rubio's defense of Western colonialism and imperial power at the Munich Security Conference and the applause his remarks received from attendees were seen as deeply unsettling in the context of the Trump administration's brazen tra…",
    "link": "https://www.commondreams.org/news/marco-rubio-munich",
    "timestamp": "2026-02-16T15:38:04Z"
  },
  {
    "title": "Trump’s legacy reflected in war over his portrait",
    "description": "A battle over brushstrokes and biography puts Trump’s legacy and national museums back in the spotlight",
    "link": "https://www.salon.com/2026/02/16/trumps-legacy-reflected-in-war-over-his-portrait/",
    "timestamp": "2026-02-16T15:33:07Z"
  },
  {
    "title": "FCC Finishes Copy/Pasting Bad Bunny Lyrics Into Google Translate, Says No Violation",
    "description": "Pathetic.",
    "link": "https://www.wonkette.com/p/fcc-finishes-copypasting-bad-bunny",
    "timestamp": "2026-02-16T15:32:43Z"
  },
  {
    "title": "The Guardian view on Donald Trump and the climate crisis: the US is in reverse while China ploughs ahead (The Guardian)",
    "description": "The Guardian:\nThe Guardian view on Donald Trump and the climate crisis: the US is in reverse while China ploughs ahead  —  The president's destructive policies enrich fossil fuel billionaires, while Beijing has bet big on the green transition  —  Devastating …",
    "link": "https://www.memeorandum.com/260216/p31",
    "timestamp": "2026-02-16T15:30:00Z"
  },
  {
    "title": "DNC Chair Ken Martin boasts ‘win after win,’ shrugs off massive Trump, Republican money lead",
    "description": "Democrats tout \"positive momentum\" with recent victories as they eye midterm elections, hoping to replicate their 2018 success in winning back Congress.",
    "link": "https://www.foxnews.com/politics/dnc-chair-ken-martin-boasts-win-after-win-shrugs-off-massive-trump-republican-money-lead",
    "timestamp": "2026-02-16T15:29:22Z"
  },
  {
    "title": "Sinn Féin will not attend St Patrick’s Day White House events, party confirms",
    "description": "Trump’s backing of Israel in war in Gaza cited by Mary Lou McDonald and Michelle O’Neill as reason for boycott",
    "link": "https://www.irishtimes.com/politics/2026/02/16/sinn-fein-will-not-attend-st-patricks-day-white-house-events-party-confirms/",
    "timestamp": "2026-02-16T15:25:40Z"
  },
  {
    "title": "In pictures: Germany's Carnival floats take swipes at Putin, Trump, Epstein",
    "description": "From Donald Trump to Vladimir Putin, no-one is safe when Germans celebrate carnival with floats that satirise politicians.",
    "link": "https://www.thelocal.de/20260216/in-pictures-germanys-carnival-floats-take-swipes-at-putin-trump-epstein",
    "timestamp": "2026-02-16T15:19:54Z"
  },
  {
    "title": "‘I’m sorry that it makes you nervous’: Watch Czech leader clash with Hillary Clinton over number of genders",
    "description": "'I think there is male and female and the rest, probably, is a social construct. This is something that went too far'",
    "link": "https://www.wnd.com/2026/02/im-sorry-that-it-makes-you-nervous-watch/",
    "timestamp": "2026-02-16T15:17:33Z"
  },
  {
    "title": "Rubio boosts Orbán's bid for another term during Budapest visit",
    "description": "Secretary of State Marco Rubio on Monday enthusiastically endorsed Hungarian Prime Minister Viktor Orbán's bid to serve a fifth straight term after upcoming elections in April.",
    "link": "https://www.pbs.org/newshour/world/rubio-boosts-orbans-bid-for-another-term-during-budapest-visit",
    "timestamp": "2026-02-16T15:17:21Z"
  },
  {
    "title": "New documents reveal secret campaign to expand ICE across US",
    "description": "New documents have revealed a secret campaign to expand ICE to further locations across the US",
    "link": "https://www.ladbible.com/news/us-news/secret-campaign-ice-us-locations-new-documents-907543-20260216",
    "timestamp": "2026-02-16T15:17:10Z"
  },
  {
    "title": "The EU will take part in Trump's Board of Peace meeting but is 'not becoming a member'",
    "description": "The European Commissioner for the Mediterranean, Dubravka Suica, will head to Washington to represent the EU at the meeting Thursday.",
    "link": "https://www.thejournal.ie/eu-board-of-peace-trump-gaza-6958719-Feb2026/",
    "timestamp": "2026-02-16T15:09:24Z"
  },
  {
    "title": "NAACP asks judge to protect against ‘misuse’ of voter data seized by FBI in Georgia’s Fulton County",
    "description": "The motion asks the judge to “order reasonable limits on the government’s use of the seized data.”",
    "link": "https://www.denverpost.com/2026/02/16/naacp-judge-voter-data-fulton-county/",
    "timestamp": "2026-02-16T15:08:36Z"
  },
  {
    "title": "NAACP asks judge to protect against ‘misuse’ of voter data seized by FBI in Georgia’s Fulton County",
    "description": "The motion asks the judge to “order reasonable limits on the government’s use of the seized data.”",
    "link": "https://www.bostonherald.com/2026/02/16/naacp-judge-voter-data-fulton-county/",
    "timestamp": "2026-02-16T15:08:36Z"
  },
  {
    "title": "John Oliver Praises AEW, Pans ICE & Gets In a Dig at Warner Bros",
    "description": "John Oliver and HBO's Last Week Tonight had a ton of ground to cover with its season premiere on Sunday night, with Donald Trump and his Department of Homeland Security's ICE goon squad getting (and rightly so) the majority of the focus. If you've been follow…",
    "link": "https://bleedingcool.com/tv/john-oliver-praises-aew-pans-ice-gets-in-a-dig-at-warner-bros/",
    "timestamp": "2026-02-16T15:07:11Z"
  },
  {
    "title": "Canada's Carney to visit India in early March, Ontario minister says",
    "description": "NEW DELHI, Feb 16 (Reuters) - ⁠Canadian Prime Minister Mark Carney will visit New ⁠Delhi in early March to work with Prime ‌Minister Narendra Modi on the framework for a comprehensive economic partnership agreement, Canadian official Victor Fedeli said on Mon…",
    "link": "https://www.thestar.com.my/news/world/2026/02/16/canada039s-carney-to-visit-india-in-early-march-ontario-minister-says",
    "timestamp": "2026-02-16T15:07:00Z"
  },
  {
    "title": "FBI Told Minnesota It Will Share Zero Evidence on Alex Pretti Shooting, Even as ICE Admits its Lies",
    "description": "Even as the FBI continues to refuse to share evidence, the DOJ is investigating two ICE agents in Minnesota for lying.",
    "link": "https://www.jezebel.com/fbi-alex-pretti-shooting-death-evidence-wont-share-minnesota-law-enforcement-investigations-doj",
    "timestamp": "2026-02-16T15:06:14Z"
  },
  {
    "title": "Crypto company Nexo returns to US three years after clash with regulators",
    "description": "PARIS, Feb 16 : Crypto company Nexo has relaunched in the United States, it said on Monday, three years after leaving the country and paying a $45 million fine following clashes with regulators.Co-founded by former Bulgarian lawmaker Antoni Trenchev, Nexo pai…",
    "link": "https://www.channelnewsasia.com/business/crypto-company-nexo-returns-us-three-years-after-clash-regulators-5934546",
    "timestamp": "2026-02-16T15:06:10Z"
  },
  {
    "title": "Nexo Taps Bakkt For US Return Three Years After SEC Settlement Over Lending Product",
    "description": "Its lending product faced scrutiny under former SEC Chair Gary Gensler",
    "link": "https://decrypt.co/358078/nexo-us-return-after-sec-settlement",
    "timestamp": "2026-02-16T15:01:02Z"
  },
  {
    "title": "What Happens When Democrats in San Francisco Call Up Republicans in Texas? It’s Pretty Cordial",
    "description": "Over the past month, a social experiment seeking to bridge political divides has connected callers in San Francisco and Abilene, Texas.",
    "link": "https://www.kqed.org/news/12073446/what-happens-when-democrats-in-san-francisco-call-up-republicans-in-texas-its-pretty-cordial",
    "timestamp": "2026-02-16T15:00:25Z"
  },
  {
    "title": "IRS Tax Refund: Income Tax Return projected higher, key forms, deductions, tax credits - how to avail these",
    "description": "IRS Tax Refund: Among them are no tax on tips, no tax on overtime, deductions for car loan interest, and deductions for people who were 65 or older by December 31.",
    "link": "https://economictimes.indiatimes.com/news/international/us/irs-tax-refund-income-tax-return-projected-higher-key-forms-deductions-tax-credits-how-to-avail-these/articleshow/128427978.cms",
    "timestamp": "2026-02-16T15:00:23Z"
  },
  {
    "title": "WLFI plunges 25% as $500mln foreign deal sparks U.S. probe – What’s at stake?",
    "description": "March 5 looms...will pressure ease or deepen for WLFI?",
    "link": "https://ambcrypto.com/wlfi-plunges-25-as-500mln-foreign-deal-sparks-u-s-probe-whats-at-stake/",
    "timestamp": "2026-02-16T15:00:18Z"
  },
  {
    "title": "These 5 Industries Are Booming in the Trump Economy — Could Your Next Job Be in One of Them?",
    "description": "Here are the fields that career experts say are excelling during President Trump's second term.",
    "link": "https://finance.yahoo.com/news/5-industries-booming-trump-economy-150006764.html",
    "timestamp": "2026-02-16T15:00:06Z"
  },
  {
    "title": "544 Mentions, Zero Accountability: The Dark Ties Between Tom Barrack and Jeffrey Epstein",
    "description": "What does it mean when a man entrusted to represent the United States abroad appears 544 times in the files of the most notorious child sex trafficker of the modern era? What does it say about American power when a sitting U.S. ambassador and presidential env…",
    "link": "https://www.activistpost.com/544-mentions-zero-accountability-the-dark-ties-between-tom-barrack-and-jeffrey-epstein/",
    "timestamp": "2026-02-16T15:00:00Z"
  },
  {
    "title": "Jeffrey Epstein’s Ranch in New Mexico Was Bought by Trump Ally",
    "description": "A blogger who calls himself “This Will Hold” wrote a startling post about Jeffrey Epstein’s Zorro Ranch in New Mexico. The sprawling ranch was bought by a Trump ally. Unlike Epstein’s other properties, Zorro Ranch was never searched by the FBI. Why not? The b…",
    "link": "https://dianeravitch.net/2026/02/16/why-didnt-fbi-search-jeffrey-epsteins-ranch-in-new-mexico/",
    "timestamp": "2026-02-16T15:00:00Z"
  },
  {
    "title": "U.S. and Iran Signal Willingness to Negotiate Ahead of Geneva Talks",
    "description": "US Secretary of State Marco Rubio has emphasized a diplomatic approach to Iran, saying he wasn't going to speak about a military attack and that President Donald Trump \"has made it clear he prefers diplomacy.\" Speaking at a joint press conference in Bratislav…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/US-and-Iran-Signal-Willingness-to-Negotiate-Ahead-of-Geneva-Talks.html",
    "timestamp": "2026-02-16T15:00:00Z"
  },
  {
    "title": "Canada’s Carney to visit India in early March, Ontario minister says",
    "description": "NEW DELHI, Feb 16 (Reuters) - Canadian Prime Minister Mark Carney will visit New Delhi in early March to work with Prime Minister Narendra Modi on the framework for a com… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/16/canada-s-carney-to-visit-india-in-early-march-ontario-minister-says",
    "timestamp": "2026-02-16T14:57:16Z"
  },
  {
    "title": "John Fetterman Bends Reality in Desperate Attempt to Defend Trump",
    "description": "Pennsylvania Senator John Fetterman, a Democrat turned Donald Trump sympathizer, falsely claimed that the president has never violated a court order.Speaking to Dasha Burns on Politico’s The Conversation, Fetterman launched into a fantastical defense of Trump…",
    "link": "https://newrepublic.com/post/206597/john-fetterman-defend-trump-court-orders",
    "timestamp": "2026-02-16T14:55:33Z"
  },
  {
    "title": "Gov. Beshear doubles down on not attending White House dinner",
    "description": "Gov. Beshear doubles down on not attending White House dinnerwlky.com",
    "link": "https://www.wlky.com/article/gov-andy-beshear-white-house-dinner-president-trump/70365509",
    "timestamp": "2026-02-16T14:53:53Z"
  },
  {
    "title": "Iranian Crown Prince makes new appeal to Trump to weaken ayatollah's regime as killing continues",
    "description": "Exiled Iranian Crown Prince Reza Pahlavi appeals to Trump for \"humanitarian intervention\" in Iran, calling for urgent international action against the regime.",
    "link": "https://www.foxnews.com/media/iranian-crown-prince-makes-new-appeal-trump-weaken-ayatollahs-regime-killing-continues",
    "timestamp": "2026-02-16T14:53:10Z"
  },
  {
    "title": "Peter Thiel Is Unleashing a Neocolonial Billionaire Fantasy in Honduras",
    "description": "Tech billionaires want to create their own city-states. Hondurans pay the price.",
    "link": "https://truthout.org/articles/peter-thiel-is-unleashing-a-neocolonial-billionaire-fantasy-in-honduras/",
    "timestamp": "2026-02-16T14:52:00Z"
  },
  {
    "title": "Survey: More Americans Believe Bad Bunny “Better Represents” U.S. Than Trump",
    "description": "42% of surveyed adults chose the Puerto Rican musician, compared to 39% who picked Trump.\nSurvey: More Americans Believe Bad Bunny “Better Represents” U.S. Than Trump\nScoop Harrison",
    "link": "https://consequence.net/2026/02/bad-bunny-trump-america-poll/",
    "timestamp": "2026-02-16T14:51:57Z"
  },
  {
    "title": "New Evidence Torpedoes Pam Bondi’s Claim About Trump and Epstein",
    "description": "Newly uncovered details in the Epstein files reveal that the FBI spoke with a victim that accused Donald Trump of sexual assault, despite Attorney General Pam Bondi’s vehement denial that the Justice Department had any evidence of such as of last week.Agents …",
    "link": "https://newrepublic.com/post/206599/evidence-trump-epstein-pam-bondi",
    "timestamp": "2026-02-16T14:50:29Z"
  },
  {
    "title": "Marjorie Taylor Greene Says Epstein Files Broke MAGA",
    "description": "Marjorie Taylor Greene Says Epstein Files Broke MAGAlittlethings.com",
    "link": "https://littlethings.com/entertainment/marjorie-taylor-green-epstein-case-broke-maga",
    "timestamp": "2026-02-16T14:44:05Z"
  },
  {
    "title": "Euro-Area Finance Chiefs Push for Bigger Role of Single Currency",
    "description": "Euro-area finance chiefs are pushing to expand the single currency’s global role, as US President Donald Trump roils markets and the US dollar weakens.",
    "link": "https://financialpost.com/pmn/business-pmn/euro-area-finance-chiefs-push-for-bigger-role-of-single-currency",
    "timestamp": "2026-02-16T14:41:40Z"
  },
  {
    "title": "‘I’m Not Sure There Is a Floor!’ CNN Data Guru Reveals Trump Has Sunk to New Low in 4 Different Polls",
    "description": "CNN's Harry Enten revealed on Monday that President Donald Trump's approval rating has sunk to a new low in four different polls.\nThe post ‘I’m Not Sure There Is a Floor!’ CNN Data Guru Reveals Trump Has Sunk to New Low in 4 Different Polls first appeared on …",
    "link": "https://www.mediaite.com/media/news/im-not-sure-there-is-a-floor-cnn-data-guru-reveals-trump-has-sunk-to-new-low-in-4-different-polls/",
    "timestamp": "2026-02-16T14:39:56Z"
  },
  {
    "title": "Crypto services platform Nexo relaunches in the United States",
    "description": "Nexo, a crypto platform that exited the United States market in 2022, relaunched services for US clients on Monday, a company spokesperson confirmed.",
    "link": "https://cointelegraph.com/news/nexo-relaunch-united-states",
    "timestamp": "2026-02-16T14:37:41Z"
  },
  {
    "title": "‘Sorry It Makes You Nervous’: Hillary Clinton Gets Into Testy Exchange With Czech Deputy PM Slamming ‘Woke Revolution’",
    "description": "Hillary Clinton got into a heated exchange with Czech Deputy PM Petr Macinka at Munich Security Conference after he slammed woke revolution and gender ideology.",
    "link": "https://dailycaller.com/2026/02/16/hillary-clinton-czech-petr-macinka-woke-munich-security-conference-west-divide-panel-values/",
    "timestamp": "2026-02-16T14:35:07Z"
  },
  {
    "title": "FAFO! Founder Of 'Latinas For Trump' Upset Her Son Is In ICE Detention",
    "description": "Ángela Vergara, Congresswoman of Colombia, and founder of the organization \"Latinas for Trump\" is finding out that the policies she supports actually apply to her - and now she is mad mad. Her son is currently detainted by ICE \"in inhumane conditions.\" Until …",
    "link": "https://crooksandliars.com/2026/02/fafo-founder-latinos-trump-son-ice",
    "timestamp": "2026-02-16T14:34:33Z"
  },
  {
    "title": "Parents with student loans have a short window to secure affordable repayment and forgiveness",
    "description": "Parents with student debt may be excluded from affordable repayment plans and loan forgiveness in the coming months if they don't take certain steps soon.",
    "link": "https://www.cnbc.com/2026/02/16/student-loan-parent-plus-forgiveness.html",
    "timestamp": "2026-02-16T14:30:01Z"
  },
  {
    "title": "How Tucker Carlson cosied up to Donald Trump and became Hated by All The Right People",
    "description": "A quick look at the website of Tucker Carlson – one of right-wing America’s most influential personalities – shows his current preoccupations: criticising protesters in Minneapolis, selling baseball caps with insulting slogans and encouraging his fans and fol…",
    "link": "https://www.independent.ie/entertainment/books/book-reviews/how-tucker-carlson-cosied-up-to-donald-trump-and-became-hated-by-all-the-right-people/a929274771.html",
    "timestamp": "2026-02-16T14:30:00Z"
  },
  {
    "title": "The Media Front: Zuckerberg Takes the Stand",
    "description": "In this edition: CBS News layoffs loom, new Washington Post CEO speaks and breaking down the latest AI panic\nThe post The Media Front: Zuckerberg Takes the Stand appeared first on TheWrap.",
    "link": "https://www.thewrap.com/industry-news/business/mark-zuckerberg-social-media-trial/",
    "timestamp": "2026-02-16T14:21:46Z"
  },
  {
    "title": "Anti-system voters are turning on Trump over Epstein (Christian Paz/Vox)",
    "description": "Christian Paz / Vox:\nAnti-system voters are turning on Trump over Epstein  —  And young Republicans are particularly enraged. … If Joe Rogan is any indication, February 2026 may go down as the month that the Epstein files saga cemented itself as a lasting pol…",
    "link": "https://www.memeorandum.com/260216/p18",
    "timestamp": "2026-02-16T14:20:03Z"
  },
  {
    "title": "Agreements that allow local police to work with ICE skyrocket",
    "description": "Agreements between Immigration and Customs Enforcement and local law enforcement that allow officers to make federal immigration arrests have increased by 950% in the first year of President Donald Trump’s second term, according to a new analysis of ICE data.…",
    "link": "https://freerepublic.com/focus/f-news/4367051/posts",
    "timestamp": "2026-02-16T14:19:52Z"
  }
]