[
  {
    "title": "Man Stopped By Border Patrol Voices Guilt About Voting For Trump, Joins Lawsuit",
    "description": "\"I believe I was attacked because I was walking while brown,” the ex-Trump supporter said.",
    "link": "https://www.huffpost.com/entry/jason-brian-gavidia-trump-vote-immigration_n_689cc45ce4b09184403fce82",
    "timestamp": "2025-08-13T19:49:59Z"
  },
  {
    "title": "Report finds over 400 cases of vandalism, other ‘hostile’ acts against churches in 2024",
    "description": "A vandalized statue of Mary, the Mother of God, at St. Leo Parish in Hartford, Arkansas, in July 2024. / Credit: Father Joseph Chan\n\nWashington, D.C. Newsroom, Aug 13, 2025 / 15:49 pm (CNA).\nA report published by the Family Research Council (FRC) documented m…",
    "link": "https://www.catholicnewsagency.com/news/265937/report-finds-over-400-cases-of-vandalism-other-hostile-acts-against-churches-in-2024",
    "timestamp": "2025-08-13T19:49:00Z"
  },
  {
    "title": "We’re Starting to See the Fallout From the Supreme Court’s Big Anti-Trans Ruling",
    "description": "On Tuesday, we saw some of the earliest fallout from the Supreme Court's decision earlier this summer in United States v. Skrmetti.",
    "link": "https://slate.com/news-and-politics/2025/08/supreme-court-fallout-anti-trans-ruling-skrmetti.html",
    "timestamp": "2025-08-13T19:48:50Z"
  },
  {
    "title": "Exclusive-US pharma tariffs likely weeks away as Trump plans for Alaska, sources say",
    "description": "WASHINGTON (Reuters) -The announcement by President Donald Trump's administration of the results of a probe into pharmaceutical imports and new sector...",
    "link": "https://finance.yahoo.com/news/exclusive-us-pharma-tariffs-likely-194825041.html",
    "timestamp": "2025-08-13T19:48:25Z"
  },
  {
    "title": "Trump’s Soviet slip revives concerns about his mental acuity",
    "description": "The president's mental state is in the spotlight once again.",
    "link": "https://www.salon.com/2025/08/13/trumps-soviet-slip-revives-concerns-about-his-mental-acuity/",
    "timestamp": "2025-08-13T19:46:22Z"
  },
  {
    "title": "Pam Bondi accused of possible witness tampering with Ghislaine Maxwell's prison transfer",
    "description": "Democrats on the House Judiciary Committee, including ranking member Jamie Raskin (D-MD), demanded answers from Attorney General Pam Bondi after Jeffrey Epstein's accomplice, Ghislaine Maxwell, was transferred to a \"relatively luxurious minimum-security priso…",
    "link": "https://www.rawstory.com/pam-bondi-ghislaine-maxwell-tampering/",
    "timestamp": "2025-08-13T19:46:20Z"
  },
  {
    "title": "Apple iPhone 17 price may jump $100, but you will get more storage for your money",
    "description": "Apple may increase iPhone 17 Pro prices by up to $100. This marks the first price hike since 2017. Global tariffs and design improvements contribute to this change. The base model might offer 256GB storage, doubling the current 128GB. This adjustment could of…",
    "link": "https://economictimes.indiatimes.com/news/international/us/apple-iphone-17-price-may-jump-100-but-you-will-get-more-storage-for-your-money/articleshow/123289095.cms",
    "timestamp": "2025-08-13T19:45:16Z"
  },
  {
    "title": "‘I Told You So’ Starts Here: Criminal Investigations Into High School-Assisted Abortions, Jan. 6 Truth, and More",
    "description": "Over the first 200 days of the second Trump administration, many details have come to light that have confirmed things that the legacy media and... Read More\nThe post ‘I Told You So’ Starts Here: Criminal Investigations Into High School-Assisted Abortions, Ja…",
    "link": "https://www.dailysignal.com/2025/08/13/told-starts-here-criminal-investigations-high-school-assisted-abortions-6-truth-more/",
    "timestamp": "2025-08-13T19:45:00Z"
  },
  {
    "title": "Trump Invites Media to Ride Along with D.C. Police: ‘We’re Going to Be Very Open About What We’re Doing’",
    "description": "WASHINGTON–President Donald Trump on Wednesday invited members of the media to ride along with the D.C. Metropolitan Police, saying, in response to a question from Breitbart News, that his administration is going to “be very open about” the federalization of …",
    "link": "https://www.breitbart.com/politics/2025/08/13/trump-invites-media-to-ride-along-with-d-c-police/",
    "timestamp": "2025-08-13T19:44:54Z"
  },
  {
    "title": "Trump-Putin Meeting Looms: Here's How Oil Markets Could React",
    "description": "With President Donald Trump set to meet Russian President Vladimir Putin in Alaska on Friday, global oil markets are on edge, weighing the possibility of peace, pressure, or a fresh wave of economic retaliation with the risks of major energy consequences.\nThe…",
    "link": "https://biztoc.com/x/c7faae40da136288",
    "timestamp": "2025-08-13T19:44:38Z"
  },
  {
    "title": "Newsom Launches Counterattack to Trump’s Texas Power Grab",
    "description": "Gavin Newsom launches counterattack to Trump’s Texas power grab. In a taunting Trump-style tweet, the governor announced California Democrats are moving ahead with their retaliatory redistricting plan.",
    "link": "http://nymag.com/intelligencer/article/newsom-launches-counterattack-to-trumps-texas-power-grab.html",
    "timestamp": "2025-08-13T19:44:07Z"
  },
  {
    "title": "Liberal comic who helped popularize podcasting explains why he turned down Hillary Clinton interview",
    "description": "\"WTF\" podcast host Marc Maron explained his decision to reject an interview with Hillary Clinton in 2017 during an interview with The Hollywood Reporter on Wednesday.",
    "link": "https://www.foxnews.com/media/liberal-comic-who-helped-popularize-podcasting-explains-why-he-turned-down-hillary-clinton-interview",
    "timestamp": "2025-08-13T19:43:44Z"
  },
  {
    "title": "Trump Says He Was Almost Completely ‘Involved’ In Choosing Kennedy Center Nominees",
    "description": "President Donald Trump said that he was almost entirely \"involved\" in the selection process of the Kennedy Center Honors recipients.",
    "link": "https://dailycaller.com/2025/08/13/trump-kennedy-center-nominees/",
    "timestamp": "2025-08-13T19:42:58Z"
  },
  {
    "title": "Ukraine’s Alaska agenda: Kiev wants a lasting ceasefire, NATO-backed security, reparations, and sustained sanctions on Russia",
    "description": "As Trump and Putin prepare to meet in Alaska, Ukraine seeks assurances that its interests won't be sacrificed. Kyiv insists on a durable ceasefire, Russian reparations for war damages estimated up to $1 trillion, and binding security guarantees via NATO and t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ukraines-alaska-agenda-kiev-wants-a-lasting-ceasefire-nato-backed-security-reparations-and-sustained-sanctions-on-russia/articleshow/123289597.cms",
    "timestamp": "2025-08-13T19:42:25Z"
  },
  {
    "title": "Wild Elephant Tramples Tourist, Stripping Off Their Pants, After Ignorant Selfie Attempt",
    "description": "A tourist who attempted to snap a photo with an elephant was subsequently severely injured after being trampled and stripped — revealing his bare behind for all manner of beasts to bear witness. Authorities are calling it a reckless and dangerous stunt. The s…",
    "link": "https://freerepublic.com/focus/f-chat/4334417/posts",
    "timestamp": "2025-08-13T19:41:55Z"
  },
  {
    "title": "‘Bring it on’: Republican senator fires warning shot ahead of big 2026 announcement",
    "description": "Sen. Joni Ernst says Democrats can ‘bring it on’ in 2026 electionby Robin Opsahl, Iowa Capital Dispatch August 13, 2025U.S. Sen. Joni Ernst has not officially said if she plans to run for reelection in 2026 — but she told a GOP audience Wednesday that Democra…",
    "link": "https://www.rawstory.com/joni-ernst-2673882489/",
    "timestamp": "2025-08-13T19:37:57Z"
  },
  {
    "title": "I’m a Columbia Student Journalist. I Watched Censorship Unfold on My Own Campus.",
    "description": "Editor’s Note: The ACLU is committed to fighting for all reporters’, including the student press’, right to hold those in power accountable. Through “Press in Peril,” our ongoing series, we’re highlighting the challenges facing the press in a democracy under …",
    "link": "https://www.aclu.org/news/free-speech/im-a-columbia-student-journalist-i-watched-censorship-unfold-on-my-own-campus",
    "timestamp": "2025-08-13T19:35:02Z"
  },
  {
    "title": "The Push To Exclude Noncitizens From The 2030 Census",
    "description": "<p dir=\"ltr\" style=\"line-height:1.38;background-color:#ffffff;margin-top:0pt;margin-bottom:0pt;padding:0pt 0pt 8pt 0pt;\">The U.S. undertakes the <a href=\"https://www.census.gov/about/what.html\"target=\"_blank\"   >census every 10 years</a>. Hundreds of thousand…",
    "link": "https://www.npr.org/2025/08/13/nx-s1-5501508/the-push-to-exclude-noncitizens-from-the-2030-census",
    "timestamp": "2025-08-13T19:33:57Z"
  },
  {
    "title": "Israeli military approves plan for new Gaza offensive",
    "description": "The news comes as Hamas condemned what it called “aggressive” Israeli ground incursions in Gaza City.",
    "link": "https://www.thejournal.ie/israeli-military-approves-plan-for-new-gaza-offensive-6789743-Aug2025/",
    "timestamp": "2025-08-13T19:32:43Z"
  },
  {
    "title": "Trump Will Host the Kennedy Center Honors",
    "description": "Donald Trump announced that Sylvester Stallone, KISS, Gloria Gaynor, George Strait, and Michael Crawford would be celebrated at the Kennedy Center Honors this year. He also announced that he would be taking over as host.",
    "link": "http://www.thecut.com/article/donald-trump-picks-host-kennedy-center-honors.html",
    "timestamp": "2025-08-13T19:32:36Z"
  },
  {
    "title": "Here's What Happened Today: Wednesday",
    "description": "Protest in wake of attacks on Indian community, President Higgins backs Mary Robinson’s comments on Gaza, and Trump prepares for Putin meeting",
    "link": "https://www.thejournal.ie/news-fix-wednesday-august-6789687-Aug2025/",
    "timestamp": "2025-08-13T19:32:31Z"
  },
  {
    "title": "Soros-linked DA warns Trump after DC crime crackdown: ‘Better not try it in Philly’",
    "description": "DA Larry Krasner challenges Trump's federal law enforcement control after DC takeover, as retired judge switches parties to run against him in November election",
    "link": "https://www.foxnews.com/politics/soros-linked-da-warns-trump-after-dc-crime-crackdown-better-not-try-philly",
    "timestamp": "2025-08-13T19:32:14Z"
  },
  {
    "title": "Chris Matthews says Democrats 'falling into a trap of defending what’s indefensible' on crime",
    "description": "Ex-MSNBC host Chris Matthews called out Democrats for their response to President Trump's crime plan, suggesting they were defending the indefensible.",
    "link": "https://www.foxnews.com/media/chris-matthews-says-democrats-falling-trap-defending-whats-indefensible-crime",
    "timestamp": "2025-08-13T19:30:42Z"
  },
  {
    "title": "Trump announces slate of 5 Kennedy Center honorees",
    "description": "President Donald Trump visited the Kennedy Center on Wednesday to unveil the next recipients of its hallmark honors — and announce that he would personally host the institution's awards show",
    "link": "https://www.abc12.com/news/entertainment/trump-announces-slate-of-5-kennedy-center-honorees/article_64553f64-f675-5acf-b6ed-8e73511c244d.html",
    "timestamp": "2025-08-13T19:30:40Z"
  },
  {
    "title": "EXCLUSIVE: Trump to Sign Order Elevating Office of Space Commerce",
    "description": "FIRST ON THE DAILY SIGNAL—President Donald Trump is expected to sign an executive order elevating the Office of Space Commerce, The Daily Signal has learned.... Read More\nThe post EXCLUSIVE: Trump to Sign Order Elevating Office of Space Commerce appeared firs…",
    "link": "https://www.dailysignal.com/2025/08/13/exclusive-trump-sign-order-elevating-space-commerce-office/",
    "timestamp": "2025-08-13T19:30:00Z"
  },
  {
    "title": "'Don't have a good poker face': Judge 'skeptical' of Trump admin's 'extraordinary' order",
    "description": "President Donald Trump's attempt to sue federal judges for not ruling in his favor isn't going well for him, reported The New York Times on Wednesday.A federal judge hearing the case, Thomas Cullen, already seemed to be against the idea out of the gate, repor…",
    "link": "https://www.rawstory.com/trump-judges-2673882022/",
    "timestamp": "2025-08-13T19:29:11Z"
  },
  {
    "title": "Bukele Critics Face Long Exile From El Salvador Homeland",
    "description": "El Salvador's President Nayib Bukele has tightened his grip on power and made life ever-more difficult for critics -- now a growing number face the prospect of a long and painful exile.",
    "link": "https://www.ibtimes.com.au/bukele-critics-face-long-exile-el-salvador-homeland-1860109",
    "timestamp": "2025-08-13T19:27:10Z"
  },
  {
    "title": "Bukele Critics Face Long Exile From El Salvador Homeland",
    "description": "El Salvador's President Nayib Bukele has tightened his grip on power and made life ever-more difficult for critics -- now a growing number face the prospect of a long and painful exile.",
    "link": "https://www.ibtimes.com/bukele-critics-face-long-exile-el-salvador-homeland-3780837",
    "timestamp": "2025-08-13T19:27:09Z"
  },
  {
    "title": "Trump names Sylvester Stallone, Gloria Gaynor and Michael Crawford among Kennedy Centre Honours nominees",
    "description": "US President Donald Trump has named Rocky actor Sylvester Stallone, singer Gloria Gaynor, British actor-singer Michael Crawford, the rock band Kiss and country music star George Strait among the first batch of Kennedy Centre Honours nominees in his new role a…",
    "link": "https://www.independent.ie/world-news/north-america/trump-names-sylvester-stallone-gloria-gaynor-and-michael-crawford-among-kennedy-centre-honours-nominees/a2028787030.html",
    "timestamp": "2025-08-13T19:24:54Z"
  },
  {
    "title": "Collusion in Kentucky: Mitch McConnell’s Allies Plot to Take Out Trump-Aligned Trash Man Nate Morris",
    "description": "Allies of longtime former Senate Majority Leader and outgoing Sen. Mitch McConnell (R-KY) have been caught colluding in a nefarious plot to take down businessman Nate Morris, the U.S. Senate candidate most aligned with President Donald Trump, in next year's G…",
    "link": "https://www.breitbart.com/politics/2025/08/13/collusion-in-kentucky-mitch-mcconnells-allies-plot-to-take-out-trump-aligned-trash-man-nate-morris/",
    "timestamp": "2025-08-13T19:24:50Z"
  },
  {
    "title": "How DC’s unique status let Trump take control of police, deploy National Guard",
    "description": "President Donald Trump directly controls DC's police and National Guard because of the federal enclave's unique status, experts say.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/13/trump-dc-police-national-guard/85622174007/",
    "timestamp": "2025-08-13T19:24:20Z"
  },
  {
    "title": "Kiev ‘ready’ to discuss territory with Moscow – Merz",
    "description": "The current line of contact should be the starting point in talks between Moscow and Kiev over territory, Friedrich Merz has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622860-kiev-ready-discuss-territory-merz/",
    "timestamp": "2025-08-13T19:23:59Z"
  },
  {
    "title": "Boston Celtics Daily Links 8/13/25",
    "description": "All the Celtics news you need in one convenient place.",
    "link": "https://www.celticsblog.com/boston-celtics-daily-links/120548/boston-celtics-daily-links-8-13-25",
    "timestamp": "2025-08-13T19:23:57Z"
  },
  {
    "title": "BoC officials considered whether interest rate already low enough to weather tariffs",
    "description": "Newly released documents show some members of the Bank of Canada were wondering last month whether the central bank's benchmark interest rate is already low enough to support the Canadian economy through U.S. tariffs.",
    "link": "https://www.cbc.ca/news/business/boc-officials-summary-of-deliberations-aug-2025-1.7608128",
    "timestamp": "2025-08-13T19:23:54Z"
  },
  {
    "title": "Texas Democrats who fled could face felony bribery charges, governor says",
    "description": "Texas Democrats who fled the state to break quorum and disrupt redistricting efforts could face felony bribery charges, Republican Governor Greg Abbott suggested in an interview with Fox News Digital.",
    "link": "https://www.foxnews.com/politics/texas-democrats-who-fled-could-face-felony-bribery-charges-governor-says",
    "timestamp": "2025-08-13T19:23:52Z"
  },
  {
    "title": "Oil Drops on Stockpile Rise",
    "description": "US crude inventories rose sharply, pushing WTI under $63 a barrel.",
    "link": "https://www.rigzone.com/news/wire/oil_drops_on_stockpile_rise-13-aug-2025-181463-article/",
    "timestamp": "2025-08-13T19:23:12Z"
  },
  {
    "title": "Trump floats ‘quick’ Putin-Zelensky meeting",
    "description": "A new round of talks could follow on the heels of the Alaska summit, according to the US president Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622858-trump-putin-zelensky-meeting/",
    "timestamp": "2025-08-13T19:22:25Z"
  },
  {
    "title": "GE Appliances shifts more production to US as part of a $3 billion investment",
    "description": "LOUISVILLE, Ky. (AP) — GE Appliances plans to shift production of refrigerators, gas ranges and water heaters out of China and Mexico as part of a more than $3 billion investment to expand its U.S. operations in Kentucky, Georgia, Alabama, Tennessee and South…",
    "link": "https://financialpost.com/pmn/ge-appliances-shifts-more-production-to-us-as-part-of-a-3-billion-investment",
    "timestamp": "2025-08-13T19:22:20Z"
  },
  {
    "title": "Exclusive — Former Capitol Police Chief Steven Sund: Bigger Picture Shows D.C. Crime Is on the Rise",
    "description": "The bigger picture shows D.C. crime is on the rise, former Capitol Police Chief Steven Sund said during an appearance on Breitbart News Daily, days after President Donald Trump announced he is placing the D.C. Metropolitan Police Department under direct feder…",
    "link": "https://freerepublic.com/focus/f-news/4334412/posts",
    "timestamp": "2025-08-13T19:21:01Z"
  },
  {
    "title": "Ivanka Trump Is Back — And Helping Plan This Unconventional Event At The White House",
    "description": "The first daughter, who served as a senior adviser during her father’s first term, hasn’t been as vocal during his second — but that is reportedly changing.",
    "link": "https://www.huffpost.com/entry/ivanka-trump-ufc-fight_n_689cc010e4b0196f49c5e4f4",
    "timestamp": "2025-08-13T19:19:59Z"
  },
  {
    "title": "Dollar slips further as anticipation mounts of Fed interest rate cut",
    "description": "NEW YORK :The dollar slipped for a second straight session on Wednesday, a day after a U.S. inflation reading increased expectations of a Federal Reserve rate cut next month and renewed pressure from President Donald Trump for lower rates added to the sell-of…",
    "link": "https://www.channelnewsasia.com/business/dollar-slips-further-anticipation-mounts-fed-interest-rate-cut-5291786",
    "timestamp": "2025-08-13T19:19:14Z"
  },
  {
    "title": "'Mean streets!' Feds in bulletproof vests mocked for patrolling posh DC neighborhood",
    "description": "Federal officers were ridiculed online Wednesday after videos and photos showed them patrolling the streets of the safest neighborhood in Washington, D.C.One D.C. native posted photos of men wearing bulletproof vests and camo reading FBI on the back as they m…",
    "link": "https://www.rawstory.com/trump-washington-dc-2673882102/",
    "timestamp": "2025-08-13T19:19:03Z"
  },
  {
    "title": "As Trump berates Goldman, other economists agree that higher tariff inflation is coming",
    "description": "Goldman Sachs is taking the heat for its call, but it's far from alone in that view among its Wall Street brethren.",
    "link": "https://www.cnbc.com/2025/08/13/as-trump-berates-goldman-other-economists-agree-that-higher-tariff-inflation-is-coming.html",
    "timestamp": "2025-08-13T19:18:13Z"
  },
  {
    "title": "Chris Matthews Warns Dems ‘Falling Into The Trap’ By Opposing Trump’s DC Crackdown",
    "description": "Former MSNBC host Chris Matthews said Wednesday President Donald Trump was goading Democrats into a “trap” over crime in Washington, D.C.",
    "link": "https://dailycaller.com/2025/08/13/chris-matthews-warns-dems-falling-into-the-trap-by-opposing-dc-crackdown/",
    "timestamp": "2025-08-13T19:17:32Z"
  },
  {
    "title": "Fed can wait to adjust policy because job market is near full employment, Bostic says",
    "description": "The Fed should avoid policy volatility that can be troublesome to the public, Bostic said at an event in Alabama, adding that his \"predisposition is to try...",
    "link": "https://finance.yahoo.com/news/fed-wait-adjust-policy-because-191706320.html",
    "timestamp": "2025-08-13T19:17:06Z"
  },
  {
    "title": "Trump greenlights 14.5 million-ton coal expansion in Wyoming",
    "description": "One of Wyoming’s largest coal mines just unlocked more than 14 million tons of federal coal in the Powder River Basin, a little more than half the volume the mine",
    "link": "https://trib.com/news/state-regional/business/article_1bc7dde3-b97f-4d10-a56a-7195120bdad8.html",
    "timestamp": "2025-08-13T19:16:23Z"
  },
  {
    "title": "Why Arab rulers aren't more vocal about Gaza as global outcry grows",
    "description": "Arab governments that have been advocates for the Palestinian cause are now facing criticism for their response to the suffering in Gaza caused by Israel's war.",
    "link": "https://www.nbcnews.com/world/middle-east/israel-gaza-arab-rulers-nations-criticism-palestinians-starvation-rcna224586",
    "timestamp": "2025-08-13T19:16:12Z"
  },
  {
    "title": "Trump Signals He'll Announce Fed Chair Pick 'A Little Bit Early' (Josh Wingrove/Bloomberg)",
    "description": "Josh Wingrove / Bloomberg:\nTrump Signals He'll Announce Fed Chair Pick ‘A Little Bit Early’  —  President Donald Trump said he may name the next Federal Reserve chair “a little bit early” and added that he was down to three or four potential candidates as he …",
    "link": "https://www.memeorandum.com/250813/p69",
    "timestamp": "2025-08-13T19:15:01Z"
  },
  {
    "title": "Trump wants to get Putin, Zelenskyy together 'immediately' after Alaska",
    "description": "The US president says he wants to meet Vladimir Putin again \"almost immediately\" if this week's landmark summit in Alaska goes well, and for Ukrainian leader Volodymyr Zelenskyy to attend.",
    "link": "https://www.abc.net.au/news/2025-08-14/trump-wants-putin-and-zelenskyy-to-meet-if-alaska-goes-well/105650280",
    "timestamp": "2025-08-13T19:14:20Z"
  },
  {
    "title": "8 celebrities who left the US or are considering moving for political reasons",
    "description": "Celebrities like Ellen DeGeneres, Portia de Rossi, and Rosie O'Donnell are among the stars who have left America and moved elsewhere due to politics.",
    "link": "https://www.businessinsider.com/celebrities-who-left-usa-political-reasons",
    "timestamp": "2025-08-13T19:14:12Z"
  },
  {
    "title": "Trump Admits One Thing He Won’t Ask Putin During Ukraine Meeting",
    "description": "For all his talk about Hillary Clinton and the Russia investigation, Donald Trump doesn’t seem to care that Russians hacked into sensitive government databases this year.Answering questions outside the Kennedy Center Wednesday, the U.S. president appeared rem…",
    "link": "https://newrepublic.com/post/199068/donald-trump-vladimir-putin-russia-ukraine-courts-hack",
    "timestamp": "2025-08-13T19:13:25Z"
  },
  {
    "title": "Trump’s Trade Tactics Come for Chip Controls",
    "description": "With tariffs on one side and shakedowns on the other, the U.S. president is upending years of China consensus.",
    "link": "http://foreignpolicy.com/2025/08/13/trump-nvidia-amd-chip-semiconductor-tariffs/",
    "timestamp": "2025-08-13T19:11:54Z"
  },
  {
    "title": "EXCLUSIVE: Tom Emmer Warns Of Midwest Mamdani’s ‘Pro-Illegal Alien, Communist Chaos’",
    "description": "House Majority Whip Tom Emmer blasted Minneapolis mayoral hopeful Omar Fateh and called on voters to reject the avowed socialist at the ballot box in November.",
    "link": "https://dailycaller.com/2025/08/13/tom-emmer-omar-fateh-illegal-immigrants/",
    "timestamp": "2025-08-13T19:11:33Z"
  },
  {
    "title": "Trump exerts control over Kennedy Center Honors, vetoes prospective ‘wokester’ honorees",
    "description": "Donald Trump found time to lead the Kennedy Center, scrutinize honorees, agree to host its awards ceremony and approve an honor for one of his pals.",
    "link": "https://biztoc.com/x/86869291f1c95c24",
    "timestamp": "2025-08-13T19:10:48Z"
  },
  {
    "title": "Brazil’s Lula announces $5.5 billion in credits for exporters hit by US tariffs",
    "description": "SAO PAULO (AP) — The Brazilian government on Wednesday unveiled a plan to support local exporters affected by a 50% tariff imposed by U.S. President Donald Trump on several products from the South American nation. Dubbed “Sovereign Brazil,” the plan provides …",
    "link": "https://financialpost.com/pmn/brazils-lula-announces-5-5-billion-in-credits-for-exporters-hit-by-us-tariffs",
    "timestamp": "2025-08-13T19:10:06Z"
  },
  {
    "title": "Dem Mayor Of Crime-Ridden City Actually Thinks Trump Is ‘Intimidated’ By His ‘Intellectual Prowess’",
    "description": "Democrat Chicago Mayor Brandon Johnson stated that President Donald Trump is \"intimidated\" by the \"intellectual prowess of black men.\"",
    "link": "https://dailycaller.com/2025/08/13/dem-mayor-brandon-johnson-chicago-crime-trump/",
    "timestamp": "2025-08-13T19:08:01Z"
  },
  {
    "title": "Brazil's Lula announces $5.5 billion in credits for exporters hit by US tariffs",
    "description": "The Brazilian government on Wednesday unveiled a plan to support local exporters affected by a 50% tariff imposed by U.S. President Donald Trump on several...",
    "link": "https://finance.yahoo.com/news/brazils-lula-announces-5-5-190639401.html",
    "timestamp": "2025-08-13T19:06:39Z"
  },
  {
    "title": "Trump threatens 'very severe' consequences if Russia doesn't agree to end Ukraine war",
    "description": "President Donald Trump threatened \"very severe consequences\" for Russia if President Vladimir Putin doesn’t agree to end the war in Ukraine after their meeting in Alaska on Friday. -snip- Trump later appeared to cast doubt on whether he could convince Putin t…",
    "link": "https://freerepublic.com/focus/f-chat/4334408/posts",
    "timestamp": "2025-08-13T19:06:11Z"
  },
  {
    "title": "Trouble brews as Elon Musk’s restaurant Tesla Diner shrinks menu just weeks after inauguration",
    "description": "Tesla's retro-futuristic diner, initially celebrated for its extensive menu and round-the-clock service, has undergone significant changes shortly after its grand opening. Faced with \"unprecedented demand,\" the diner has reduced its menu, eliminating popular …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trouble-brews-as-elon-musks-restaurant-tesla-diner-shrinks-menu-just-weeks-after-inauguration/articleshow/123287989.cms",
    "timestamp": "2025-08-13T19:05:03Z"
  },
  {
    "title": "DC police support Trump's federal takeover — are Dems and the media clueless on crime? (Robby Soave/The Hill)",
    "description": "Robby Soave / The Hill:\nDC police support Trump's federal takeover — are Dems and the media clueless on crime?  —  National Democratic politicians and mainstream media commentators have spent the last 24 hours blasting President Donald Trump for announcing a …",
    "link": "https://www.memeorandum.com/250813/p68",
    "timestamp": "2025-08-13T19:05:01Z"
  },
  {
    "title": "MS-13 Gang Member Serving Time for Murder Suing Trump to Be ‘Recognized’ as Female",
    "description": "An MS-13 gang member serving time in prison for murder is suing President Donald Trump to be “recognized” as a woman. A report found that Oscar Contreras Aguilar, who was sentenced to serve 21 years in prison for kidnapping and the murder of a 14 year old, fi…",
    "link": "https://freerepublic.com/focus/f-backroom/4334407/posts",
    "timestamp": "2025-08-13T19:04:27Z"
  },
  {
    "title": "MSNBC contributor voices alarm on DC crime, says issue is 'personal' and many are frustrated",
    "description": "MSNBC contributor discussed D.C. crime frustrations after President Trump announced National Guard deployments in the nation's capital and a federal takeover of the local police.",
    "link": "https://www.foxnews.com/media/msnbc-contributor-voices-alarm-dc-crime-issue-personal-many-frustrated",
    "timestamp": "2025-08-13T19:02:32Z"
  },
  {
    "title": "Watch: Trump to Host Kennedy Center Honors as He Announces Honorees Sylvester Stallone, Kiss, Gloria Gaynor",
    "description": "President Donald Trump on Wednesday announced the next class of Kennedy Center Honors recipients, which includes country legend George Strait, Hollywood megastar Sylvester Stallone, actor Michael Crawford, disco icon Gloria Gaynor, and rock royalty Kiss.\nThe …",
    "link": "https://www.breitbart.com/entertainment/2025/08/13/watch-trump-announces-sylvester-stallone-kiss-gloria-gaynor-among-kennedy-center-honorees/",
    "timestamp": "2025-08-13T19:02:30Z"
  },
  {
    "title": "Global Trade Is Booming--Just Without America",
    "description": "As Trump raises tariffs, China and emerging markets quietly rewrite the rules of globalization.",
    "link": "https://finance.yahoo.com/news/global-trade-booming-just-without-190142000.html",
    "timestamp": "2025-08-13T19:01:42Z"
  },
  {
    "title": "Trump and Putin will meet at an Alaska military base long used to counter Russia",
    "description": "The meeting is scheduled to take place Friday at Joint Base Elmendorf-Richardson in Anchorage.",
    "link": "https://www.bostonherald.com/2025/08/13/trump-and-putin-meeting-alaska-base/",
    "timestamp": "2025-08-13T19:01:41Z"
  },
  {
    "title": "NBA YoungBoy Says He’s Expecting His 13th Child",
    "description": "'Gotta make her get rid of it.'\nThe post NBA YoungBoy Says He’s Expecting His 13th Child appeared first on HipHopDX.",
    "link": "http://hiphopdx.com/news/nba-youngboy-says-hes-expecting-his-13th-child/",
    "timestamp": "2025-08-13T19:00:46Z"
  },
  {
    "title": "Trump Removal of BLS Commissioner Prompts Questions About Accuracy of Economic Stats",
    "description": "Donald Trump's dismissal two weeks ago Bureau of Labor Statistics Commissioner Erika McEntarfer and nomination of EJ Antoni as her replacement is generating plenty of \"inside baseball\" chatter among the political class.\nBut did the president — as uncouth and …",
    "link": "https://biztoc.com/x/ce41968ae00d98cc",
    "timestamp": "2025-08-13T19:00:09Z"
  },
  {
    "title": "Palestinian statehood question makes plain partisan split on United States",
    "description": "The partisan divide in Australia over how closely to align with the US has been steadily building since Donald Trump's return to the White House.",
    "link": "https://www.abc.net.au/news/2025-08-14/labor-coalition-united-states-palestine-donald-trump/105639366",
    "timestamp": "2025-08-13T19:00:00Z"
  },
  {
    "title": "“We need more of this from Democrats in general”: Gavin Newsom attempts to troll Donald Trump by tweeting in the same style, but not everyone’s a fan of the approach",
    "description": "California Governor Gavin Newsom uses President Donald Trump's own social media strategy to clap back at recent Republican gerrymandering attempts in Texas. \n\n\nAnd the internet can't help but applaud the strategy.\n\n\nSo how is Newsom \"tweeting\" like Trump?\n\n\nB…",
    "link": "https://www.dailydot.com/viral-politics/gavin-newsom-trump-tweeting/",
    "timestamp": "2025-08-13T19:00:00Z"
  },
  {
    "title": "Talk show host Jimmy Kimmel has Italian citizenship",
    "description": "Host of Jimmy Kimmel Live! was speaking on Sarah Silverman's podcast when he revealed the news.",
    "link": "https://nationalpost.com/news/talk-show-host-jimmy-kimmel-has-italian-citizenship",
    "timestamp": "2025-08-13T18:59:50Z"
  },
  {
    "title": "Trump DHS Gives Absolutely Stunning Clap-Back To John Oliver On Bizarre Darth Vader Video",
    "description": "Trump's DHS gave an absolutely stunning response when HBO host John Oliver asked them about a bizarre Darth Vader-themed social media video.\nThe post Trump DHS Gives Absolutely Stunning Clap-Back To John Oliver On Bizarre Darth Vader Video first appeared on M…",
    "link": "https://www.mediaite.com/media/entertainment/trump-dhs-gives-absolutely-stunning-clap-back-to-john-oliver-on-bizarre-darth-vader-video/",
    "timestamp": "2025-08-13T18:59:41Z"
  },
  {
    "title": "Why do Dana White and Donald Trump keep pushing for a White House UFC match?",
    "description": "Taking a page from Imperial Rome's tradition of bread and circuses to entertain and mollify the populace, President Donald Trump and Ultimate Fighting Championship President and CEO Dana White are moving ahead with a proposed UFC match on the White House grou…",
    "link": "https://biztoc.com/x/83e891a21d52128d",
    "timestamp": "2025-08-13T18:59:33Z"
  },
  {
    "title": "Trump’s hand-picked Kennedy Center honorees include Stallone, KISS",
    "description": "The president said he avoided \"wokesters\" in picking his first batch of honorees as Kennedy Center chairman.",
    "link": "https://www.salon.com/2025/08/13/trumps-hand-picked-kennedy-center-honorees-include-stallone-kiss/",
    "timestamp": "2025-08-13T18:59:18Z"
  },
  {
    "title": "How people in 24 countries view India",
    "description": "A median of 47% across the 24 countries have a favorable opinion of India, while a median of 38% have an unfavorable view.\nThe post How people in 24 countries view India appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2025/08/13/how-people-in-24-countries-view-india/",
    "timestamp": "2025-08-13T18:58:21Z"
  },
  {
    "title": "Beneath Trump’s China truce, a race to find pressure points in high stakes game of ‘3D chess’ | CNN Business",
    "description": "Beneath Trump’s China truce, a race to find pressure points in high stakes game of ‘3D chess’ | CNN Businesscnn.com",
    "link": "https://www.cnn.com/2025/08/13/business/china-trump-policy-trade",
    "timestamp": "2025-08-13T18:58:07Z"
  },
  {
    "title": "Crypto exchange Bullish is the latest IPO to explode higher in its trading debut",
    "description": "Bullish is the latest stock to surge in its market debut, joining others like Figma and CoreWeave, which saw stunning day-one rallies following IPOs.",
    "link": "https://www.businessinsider.com/bullish-ipo-blsh-stock-price-crypto-peter-thiel-nyse-2025-8",
    "timestamp": "2025-08-13T18:57:30Z"
  },
  {
    "title": "The Sudden Panic That SCOTUS Might Overturn Marriage Equality Misses the Real Threat",
    "description": "Kim Davis’ case will not be the vehicle the court uses to eradicate the equal dignity of same-sex couples.",
    "link": "https://slate.com/news-and-politics/2025/08/supreme-court-analysis-panic-gay-marriage-equality.html",
    "timestamp": "2025-08-13T18:56:49Z"
  },
  {
    "title": "The Return of the Frank Rizzo Statue",
    "description": "Check phillymag.com each morning Monday through Thursday for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly […]",
    "link": "https://www.phillymag.com/news/2025/08/13/frank-rizzo-statue-philadelphia/",
    "timestamp": "2025-08-13T18:56:02Z"
  },
  {
    "title": "Maxine Waters Says Trump Leading U.S. into 'Civil War' for Cracking Down on Illegal Immigration",
    "description": "Rep. Maxine Waters (D-CA) apparently believes that President Donald Trump is leading the U.S. into \"civil war\" for delivering on his promises — namely, cracking down on illegal immigration.\nThe post Maxine Waters Says Trump Leading U.S. into ‘Civil War’ for C…",
    "link": "https://www.breitbart.com/politics/2025/08/13/maxine-waters-says-trump-leading-us-into-civil-war-for-cracking-down-on-illegal-immigration/",
    "timestamp": "2025-08-13T18:55:57Z"
  },
  {
    "title": "Federal agents will be out 24/7 on patrol in Washington, the White House says",
    "description": "WASHINGTON (AP) — As a wary Washington waited, the White House promised a ramp-up of National Guard troops and federal officers on the streets of the nation’s<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/federal-agents-will-be-out-24-7-on-patrol-in…",
    "link": "https://whdh.com/news/federal-agents-will-be-out-24-7-on-patrol-in-washington-the-white-house-says/",
    "timestamp": "2025-08-13T18:55:53Z"
  },
  {
    "title": "DAVID MARCUS: Trump understands that safety is for every citizen, not just the lucky few",
    "description": "Trump announced his plans for a federal takeover of the Washington, D.C. police department on Monday following a spate of recent violent crimes in the capital.",
    "link": "https://www.foxnews.com/opinion/david-marcus-trump-understands-safety-every-citizen-not-just-lucky-few",
    "timestamp": "2025-08-13T18:54:40Z"
  },
  {
    "title": "Why do Dana White and Donald Trump keep pushing for a White House UFC match?",
    "description": "The president and the sports mogul each have their own reasons for wanting a White House spectacle",
    "link": "https://theweek.com/politics/trump-white-whitehouse-ufc-ppv-paramount",
    "timestamp": "2025-08-13T18:54:12Z"
  },
  {
    "title": "Desperate and hungry, Muhannad ran to airdropped aid. Minutes later, he was dead",
    "description": "The parents of the 14-year-old boy killed during an airdrop of humanitarian aid in Gaza earlier this week say they are distraught.",
    "link": "https://www.abc.net.au/news/2025-08-14/deaths-in-gaza-from-aid-airdrops/105650308",
    "timestamp": "2025-08-13T18:52:11Z"
  },
  {
    "title": "Abigail Spanberger Wins Backing of Group That Endorsed Glenn Youngkin",
    "description": "Spanberger, a Democrat, won the support of a police organization on Wednesday.",
    "link": "https://www.newsweek.com/abigail-spanberger-police-endorsement-2113091",
    "timestamp": "2025-08-13T18:51:38Z"
  },
  {
    "title": "US car sales slow after tariff-driven buying surge ends",
    "description": "Major car makers including Ford, GM and Volvo took hits because of tariff associated costs.",
    "link": "https://www.aljazeera.com/economy/2025/8/13/automakers-brace-for-profit-hits-as-tariffs-trigger-price-hikes",
    "timestamp": "2025-08-13T18:50:18Z"
  },
  {
    "title": "Murphy Recycles Declaration of Democracy in Danger",
    "description": "Sen. Chris Murphy, D-Conn., is recycling the “democracy in danger” declaration as he opposes Senate Republican appropriations efforts.  Murphy, who is the Democratic Deputy Conference... Read More\nThe post Murphy Recycles Declaration of Democracy in Danger  a…",
    "link": "https://www.dailysignal.com/2025/08/13/murphy-recycles-declaration-democracy-danger/",
    "timestamp": "2025-08-13T18:49:26Z"
  },
  {
    "title": "Trump Not Surprised By Russian Hack Of US Courts: 'They Hack In, That's What They Do'",
    "description": "President Donald Trump on Wednesday brushed aside a question about a fresh report indicating that Russia played a role in breaching the electronic system that handles U.S. federal court case documents. \nTrump Was Not Surprised\nTrump responded to a reporter’s …",
    "link": "https://biztoc.com/x/b0e0af8565e8676d",
    "timestamp": "2025-08-13T18:48:59Z"
  },
  {
    "title": "Angelina Jolie could be the latest celebrity to quit the US. Here is who else has left over Trump’s agenda",
    "description": "The Maleficent star is looking to sell her 1913 Los Angeles mansion that once belonged to Hollywood filmmaker Cecil B. DeMille",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/trump-celebrities-left-usa-angelina-jolie-b2807096.html",
    "timestamp": "2025-08-13T18:48:15Z"
  },
  {
    "title": "Trump tells Putin: Agree ceasefire on Friday or face severe consequences",
    "description": "Donald Trump has warned Vladimir Putin there would be “severe consequences” if he did not agree to end his war on Ukraine at their summit in Alaska on Friday...",
    "link": "https://uk.news.yahoo.com/trump-tells-putin-agree-ceasefire-184332894.html",
    "timestamp": "2025-08-13T18:43:32Z"
  },
  {
    "title": "Trump Removal of BLS Commissioner Prompts Questions About Accuracy of Economic Stats",
    "description": "Ray Dalio said he likely would have fired the BLS head as well.",
    "link": "https://www.coindesk.com/markets/2025/08/13/trump-removal-of-bls-commissioner-prompts-questions-about-accuracy-of-economic-stats",
    "timestamp": "2025-08-13T18:40:30Z"
  },
  {
    "title": "Live updates: Trump warns of 'very severe consequences' if Putin continues Ukraine war (Meg Kinnard/Associated Press)",
    "description": "Meg Kinnard / Associated Press:\nLive updates: Trump warns of ‘very severe consequences’ if Putin continues Ukraine war  —  President Donald Trump says there will be “very severe consequences” if Russia doesn't agree to stop the Ukraine war after Friday's summ…",
    "link": "https://www.memeorandum.com/250813/p65",
    "timestamp": "2025-08-13T18:40:01Z"
  },
  {
    "title": "France, Germany and UK call on Iran to resume nuclear discussions with US",
    "description": "Three countries say Iran must resume negotiations with US over nuclear programme",
    "link": "https://www.irishtimes.com/world/middle-east/2025/08/13/france-germany-and-uk-call-on-iran-to-resume-nuclear-discussions-with-us/",
    "timestamp": "2025-08-13T18:39:46Z"
  },
  {
    "title": "Is the Trump-Putin meeting a 'listening exercise' or an attempt to secure an immediate ceasefire?",
    "description": "The US president has been fluid on what the meeting in Alaska on Friday can really achieve.",
    "link": "https://news.sky.com/story/is-the-trump-putin-meeting-a-listening-exercise-or-an-attempt-to-secure-an-immediate-ceasefire-13411293",
    "timestamp": "2025-08-13T18:39:00Z"
  }
]