[
  {
    "title": "De Blasio Says Mayor Mamdani ‘Will Keep People Safe’ Despite Past Rhetoric",
    "description": "De Blasio said socialist Democrat NYC mayoral nominee Zohran Mamdani will be able to keep city residents \"safe\" despite past rhetoric of defunding the police.",
    "link": "https://dailycaller.com/2025/08/27/bill-de-blasio-zohran-mamdani-new-york-city-keep-safe-past-rhetoric-defunding-police/",
    "timestamp": "2025-08-27T04:50:58Z"
  },
  {
    "title": "U.S. tariffs on Indian goods are now 50%, a level analysts warn is akin to a trade embargo",
    "description": "The United States was India's top export destination in 2024, with shipments worth $87.3 billion.",
    "link": "https://fortune.com/asia/2025/08/27/us-tariffs-india-trump-trade-modi/",
    "timestamp": "2025-08-27T04:48:20Z"
  },
  {
    "title": "North Korea blasts South Korea’s Lee as ‘confrontation maniac’",
    "description": "State media hits out at South Korean leader following speech on nuclear disarmament and security alliance with US.",
    "link": "https://www.aljazeera.com/news/2025/8/27/north-korea-blasts-south-koreas-lee-as-confrontation-maniac",
    "timestamp": "2025-08-27T04:48:11Z"
  },
  {
    "title": "Morning Bid: Deja vu as France back in crisis",
    "description": "Markets have decided to nervously look away from the brewing Trump v Fed saga for now, putting the spotlight on the political crisis gripping France that has...",
    "link": "https://finance.yahoo.com/news/morning-bid-deja-vu-france-043722956.html",
    "timestamp": "2025-08-27T04:37:22Z"
  },
  {
    "title": "1 in 4 UK adults open to investing in crypto for retirement: Survey",
    "description": "Around a quarter of surveyed UK adults said they’d add crypto in their retirement portfolio, potentially opening more capital flows into the country’s $5.12 trillion pension market.",
    "link": "https://cointelegraph.com/news/quarter-uk-open-to-crypto-in-retirement-funds",
    "timestamp": "2025-08-27T04:36:39Z"
  },
  {
    "title": "Oil holds decline as higher US tariff on India kick in",
    "description": "Brent was near $67 a barrel after falling more than 2 per cent in the previous session",
    "link": "https://www.bloomberg.com/news/articles/2025-08-26/latest-oil-market-news-and-analysis-for-august-27",
    "timestamp": "2025-08-27T04:36:10Z"
  },
  {
    "title": "Commentary: Trump eyes TSMC’s Arizona fab as leverage to lift Intel and ‘Made in America’ drive",
    "description": "Since August 11, 2025, when Intel CEO Lip-Bu Tan met with US President Donald Trump at the White House, and following the White House confirmation on August 22 that it would subsidize Intel through the CHIPS and Science Act in exchange for about a 10% equity …",
    "link": "https://www.digitimes.com/news/a20250826PD224/intel-tsmc-ceo-2025-manufacturing.html",
    "timestamp": "2025-08-27T04:35:21Z"
  },
  {
    "title": "US doubles India tariff to 50% over Russian oil purchases",
    "description": "US tariffs of 50% took effect on many Indian products, doubling an existing duty as President Donald Trump sought to punish India for buying Russian oil.",
    "link": "https://www.rte.ie/news/world/2025/0827/1530345-us-india-tariff/",
    "timestamp": "2025-08-27T04:32:49Z"
  },
  {
    "title": "US doubles India tariff to 50% over Russian oil purchases",
    "description": "US tariffs of 50% have taken effect on many Indian products, doubling an existing duty as President Donald Trump sought to punish India for buying Russian oil.",
    "link": "https://www.rte.ie/news/world/2025/0827/1530345-us-tariffs/",
    "timestamp": "2025-08-27T04:32:49Z"
  },
  {
    "title": "Donald Trump: PM Modi says make and spend in India as 50% tariffs kick in - BBC",
    "description": "Donald Trump: PM Modi says make and spend in India as 50% tariffs kick inBBC Trump Raises Tariffs on India to 50% Over Russian OilThe New York Times India Braces for 50% Tariffs as Trump Upends Ties With ModiBloomberg.com Jobs, Exports, Growth At Risk: How US…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178890654",
    "timestamp": "2025-08-27T04:32:39Z"
  },
  {
    "title": "Trump vs. The Fed: The Battle Over Central Bank Independence",
    "description": "U.S. President Donald Trump has launched unprecedented attacks on the Federal Reserve. He has threatened to fire Fed governor Lisa Cook over alleged mortgage improprieties and has continued to pressure Fed Chair Jerome Powell to cut interest rates. These move…",
    "link": "https://m.economictimes.com/markets/stocks/news/trump-vs-the-fed-the-battle-over-central-bank-independence/the-flashpoint/slideshow/123538426.cms",
    "timestamp": "2025-08-27T04:32:07Z"
  },
  {
    "title": "Letters: Simply sitting and getting through the Leaving Cert exams is an achievement",
    "description": "Regarding your article ‘I flushed my Leaving Cert results down the toilet – entrepreneur Karl Fitzpatrick on his unconventional path to success’ (­August 22), I write as someone who has completed three separate Leaving Certs.",
    "link": "https://www.independent.ie/opinion/letters/letters-simply-sitting-and-getting-through-the-leaving-cert-exams-is-an-achievement/a1050804884.html",
    "timestamp": "2025-08-27T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: World leaders are speaking out against Israel, but where are the actions to support their words?",
    "description": "The smallest deed is said to be better than the mightiest of intentions. The truth of this is seen every day in the deepening torment of Gaza. The deaths multiply and lives are shattered as the war is stepped up.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-world-leaders-are-speaking-out-against-israel-but-where-are-the-actions-to-support-their-words/a1228491173.html",
    "timestamp": "2025-08-27T04:30:00Z"
  },
  {
    "title": "Peace settlement between Ukraine and Russia ‘a work in progress’, says US special envoy Keith Kellogg",
    "description": "US president Donald Trump’s special envoy for Ukraine and Russia, Keith Kellogg, said officials are “working very, very hard” on efforts to end the three-year war between Russia and Ukraine, as a lack of progress fuels doubts about whether a peace settlement …",
    "link": "https://www.independent.ie/world-news/europe/peace-settlement-between-ukraine-and-russia-a-work-in-progress-says-us-special-envoy-keith-kellogg/a1803507355.html",
    "timestamp": "2025-08-27T04:30:00Z"
  },
  {
    "title": "‘Substantial tariffs’ – how Irish watchdogs could be target of Trump over EU's digital act",
    "description": "Irish regulators that fine US tech firms could be targeted with visa restrictions, according to reports about US president Donald Trump’s latest trade threats.",
    "link": "https://www.independent.ie/business/technology/substantial-tariffs-how-irish-watchdogs-could-be-target-of-trump-over-eus-digital-act/a1437370419.html",
    "timestamp": "2025-08-27T04:30:00Z"
  },
  {
    "title": "Donald Trump warns Irish digital watchdogs to back off US tech giants as he threatens ‘substantial tariffs’",
    "description": "Irish regulators that fine US tech firms could be targeted with visa restrictions, according to reports about US president Donald Trump’s latest trade threats.",
    "link": "https://www.independent.ie/business/technology/donald-trump-warns-irish-digital-watchdogs-to-back-off-us-tech-giants-as-he-threatens-substantial-tariffs/a1437370419.html",
    "timestamp": "2025-08-27T04:30:00Z"
  },
  {
    "title": "Donald Trump’s bid to oust Fed governor Lisa Cook sets scene for legal showdown",
    "description": "Donald Trump has moved to oust Federal Reserve governor Lisa Cook, a dramatic escalation in the American president’s battle for more control over the US central bank that has unnerved investors.",
    "link": "https://www.independent.ie/business/world/donald-trumps-bid-to-oust-fed-governor-lisa-cook-sets-scene-for-legal-showdown/a1832301513.html",
    "timestamp": "2025-08-27T04:30:00Z"
  },
  {
    "title": "World’s No.3 Miner Zijin Warns of Scramble for Critical Minerals",
    "description": "China’s Zijin Mining Group Co., the world’s third-biggest metals miner by market value, warned that growing geopolitical competition presents a challenge as nations vie to secure supplies of strategic commodities.",
    "link": "https://financialpost.com/pmn/business-pmn/worlds-no-3-miner-zijin-warns-of-scramble-for-critical-minerals",
    "timestamp": "2025-08-27T04:27:55Z"
  },
  {
    "title": "Meta's Hyperion data center investment reaches US$50 billion, far surpassing initial estimates",
    "description": "According to Bloomberg and Reuters, US President Donald Trump disclosed that Meta Platforms Inc.'s Hyperion data center under construction in Louisiana involves a total investment of approximately US$50 billion, significantly exceeding the previously announce…",
    "link": "https://www.digitimes.com/news/a20250827PD232/meta-data-center-investment-usa-donald-trump.html",
    "timestamp": "2025-08-27T04:22:52Z"
  },
  {
    "title": "Trump administration is investing in US rare earths in a push to break China's grip",
    "description": "The U.S. is ramping up efforts to boost production of crucial components used in electric vehicles, smartphones and fighter jets",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-investing-us-rare-earths-push-break-125010879",
    "timestamp": "2025-08-27T04:22:15Z"
  },
  {
    "title": "\"PM Modi, Trump have close partnership, hopeful will find a way of concluding FTA with US,\" says former FS Harsh Shringla as 50% tariff kicks in",
    "description": "Harsh Vardhan Shringla expresses optimism about a mutually beneficial FTA with the US, highlighting the strong relationship between PM Modi and former President Trump. Despite new 50% tariffs on Indian goods, Shringla emphasizes minimizing impact through alte…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/pm-modi-trump-have-close-partnership-hopeful-will-find-a-way-of-concluding-fta-with-us-says-former-fs-harsh-shringla-as-50-tariff-kicks-in/articleshow/123537954.cms",
    "timestamp": "2025-08-27T04:20:17Z"
  },
  {
    "title": "'OMG!': White House Reporter Freaks Out On Camera Over Taylor Swift Engagement",
    "description": "Olivia Rinaldi couldn't keep her joy under wraps as she learned of the \"exciting\" news.",
    "link": "https://www.huffpost.com/entry/cbs-news-olivia-rinaldi-taylor-swift-travis-kelce-engagement_n_68ae5d8be4b0ba4856d3ab71",
    "timestamp": "2025-08-27T04:17:54Z"
  },
  {
    "title": "India braces for export shock as US tariffs take effect",
    "description": "NEW DELHI (AP) — India is bracing for a sharp blow to its overseas trade as steep U.S. tariffs take effect on a range of Indian products Wednesday — a move that threatens over half of India’s exports to its largest market and highlights the fragile trade ties…",
    "link": "https://financialpost.com/pmn/india-braces-for-export-shock-as-us-tariffs-take-effect",
    "timestamp": "2025-08-27T04:15:52Z"
  },
  {
    "title": "Additional 25% tariff imposed by US President Trump comes into effect",
    "description": "The increased levies would hit Indian products that are “entered for consumption, or withdrawn from warehouse for consumption, on or after 12:01 am eastern daylight time on August 27, 2025”.",
    "link": "https://www.thehindubusinessline.com/economy/additional-25-tariff-imposed-by-us-president-trump-comes-into-effect/article69981958.ece",
    "timestamp": "2025-08-27T04:13:35Z"
  },
  {
    "title": "Somebody is not very happy with you: Fiji PM Sitiveni Rabuka to PM Modi amid US tariff row",
    "description": "Fijian Prime Minister Sitiveni Rabuka, during his India visit, addressed concerns about US tariffs on Indian goods, telling Prime Minister Modi that \"somebody is not very happy with you.\" Despite this, Rabuka expressed confidence in Modi's ability to manage t…",
    "link": "https://economictimes.indiatimes.com/news/india/somebody-is-not-very-happy-with-you-fiji-pm-rabuka-to-pm-modi-amid-us-tariff-row/articleshow/123537840.cms",
    "timestamp": "2025-08-27T04:13:10Z"
  },
  {
    "title": "Now is the time to fight fire with fire.",
    "description": "Jews are hated- the world has made that clear - so let them hate us even more, if that’s possible. Opinion.",
    "link": "https://www.israelnationalnews.com/news/413935",
    "timestamp": "2025-08-27T04:10:04Z"
  },
  {
    "title": "Donald Trump does a U-turn on Taylor Swift, wishes her ‘a lot of luck’ with Travis Kelce",
    "description": "Taylor Swift and Travis Kelce’s engagement has sparked global headlines, and even US President Donald Trump has weighed in. Known for his long history of criticising the singer, Trump shifted his tone this week, calling Swift a “terrific person” and Kelce “a …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-does-a-u-turn-on-taylor-swift-wishes-her-a-lot-of-luck-with-travis-kelce/articleshow/123537557.cms",
    "timestamp": "2025-08-27T04:07:09Z"
  },
  {
    "title": "Trump's 50% Tariffs On Indian Goods Come Into Force Upending Relations",
    "description": "US President Donald Trump's unilateral 50% tariff on Indian goods has come into effect at 9:30 a.m. local time on Wednesday. The tariff includes 25% punitive levy for India's oil purchases from Russia, which New Delhi has called \"unjustified\".",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-50-tariffs-on-indian-goods-come-into-force-upending-relations",
    "timestamp": "2025-08-27T04:06:53Z"
  },
  {
    "title": "Thugs R Us: How MAGA Uses Violence to Consolidate Power",
    "description": "( Tomdispatch.com ) - President Trump, his cabinet, and those who have profited from his rise seem to revel in public displays of cruelty. Take former Department of Government Efficiency (DOGE) head Elon Musk, holding a chainsaw at a televised event to celebr…",
    "link": "https://www.juancole.com/2025/08/thugs-violence-consolidate.html",
    "timestamp": "2025-08-27T04:06:41Z"
  },
  {
    "title": "Trump again claims he stopped India-Pakistan war from ‘going nuclear’",
    "description": "Trump claims to have stopped India-Pakistan war by using tariffs, trade threats, and mediation, sparking controversy and skepticism.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-again-claims-he-stopped-india-pakistan-war-from-going-nuclear/article69981942.ece",
    "timestamp": "2025-08-27T04:05:25Z"
  },
  {
    "title": "Trump administration is investing in US rare earths in a push to break China's grip",
    "description": "The U.S. government is investing heavily in domestic critical mineral production to reduce reliance on China. This initiative includes funding for American companies, setting minimum prices for U.S.-produced minerals, and investigating foreign supplies. These…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-is-investing-in-us-rare-earths-in-a-push-to-break-chinas-grip/articleshow/123537724.cms",
    "timestamp": "2025-08-27T04:04:26Z"
  },
  {
    "title": "Karen Bass Says ‘Grants For Violence Prevention’ Fight Big City Crime Better Than National Guard Troops",
    "description": "Bass said she would have preferred \"grants for violence prevention\" during the city's anti-ICE riots and protests over the NG troops deployed by Trump.",
    "link": "https://dailycaller.com/2025/08/27/karen-bass-grants-violences-prevention-crime-national-guard-los-angeles-riots/",
    "timestamp": "2025-08-27T04:03:12Z"
  },
  {
    "title": "Trump hits India with punishing 50% tariff, among the highest the US charges | CNN Business",
    "description": "President Donald Trump made good on his threat to double tariffs charged on goods from India to 50%, a move that could endanger relations with one of America’s most important trading partners and send shockwaves to consumers.",
    "link": "https://www.cnn.com/2025/08/27/economy/trump-india-tariff",
    "timestamp": "2025-08-27T04:03:06Z"
  },
  {
    "title": "Checking In on the Peace Administration",
    "description": "Mr. Peace is almost as delusional as Mr. War.\nThe post Checking In on the Peace Administration appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/checking-in-on-the-peace-administration/",
    "timestamp": "2025-08-27T04:03:00Z"
  },
  {
    "title": "Cracker Barrel Returning to Old Logo After Backlash from Trump",
    "description": "Cracker Barrel will ditch its new logo for the classic one after President Donald Trump advised the restaurant chain to reverse the controversial rebranding, company officials announced Tuesday.\nThe post Cracker Barrel Returning to Old Logo After Backlash fro…",
    "link": "https://www.breitbart.com/politics/2025/08/26/cracker-barrel-return-old-logo-backlash-trump/",
    "timestamp": "2025-08-27T04:02:10Z"
  },
  {
    "title": "Remembering Hurricane Katrina and Its Political Aftermath",
    "description": "How George W. Bush's response swept away compassionate conservatism.",
    "link": "http://foreignpolicy.com/2025/08/27/hurricane-katrina-george-w-bush-political-aftermath/",
    "timestamp": "2025-08-27T04:01:45Z"
  },
  {
    "title": "Oil Prices Hold Decline As Higher US Tariff On India Set To Kick In",
    "description": "Oil held a steep drop as investors counted down to the imposition of higher US tariffs on India over imports of Russian crude, with no signs of a major shift in local refiners’ purchasing patterns. Brent was near $67 a barrel after falling more than 2% in the…",
    "link": "https://www.ndtvprofit.com/markets/crude-oil-market-news-august-27-check-brent-wti-prices",
    "timestamp": "2025-08-27T04:01:41Z"
  },
  {
    "title": "Trump’s pressure on Fed sparks bond market jitters",
    "description": "US President Donald Trump has launched an unprecedented bid to fire Federal Reserve Governor Lisa Cook over questions about mortgages she took before joining the central bank. The move, part of his broader campaign to push the Fed into lowering interest rates…",
    "link": "https://m.economictimes.com/markets/stocks/news/trumps-pressure-on-fed-sparks-bond-market-jitters/trumps-bold-move/slideshow/123537925.cms",
    "timestamp": "2025-08-27T04:01:37Z"
  },
  {
    "title": "China and India May Be Moving Toward a More Coordinated Foreign Policy",
    "description": "What to watch for during Modi’s first trip to China since 2018.",
    "link": "http://foreignpolicy.com/2025/08/27/sco-summit-china-india-relationship/",
    "timestamp": "2025-08-27T04:01:14Z"
  },
  {
    "title": "Trump’s Contronymal ‘Peace’ With Russia",
    "description": "“They didn’t act like people and they didn’t act like actors.  It’s hard to explain.” –  J.D. Salinger, The Catcher in the Rye With all the hullabaloo about President Donald Trump’s “peace” gestures toward Russia over Ukraine and the resetting of U.S.-Russia …",
    "link": "https://www.lewrockwell.com/2025/08/edward-curtin/trumps-contronymal-peace-with-russia/",
    "timestamp": "2025-08-27T04:01:00Z"
  },
  {
    "title": "‘Hard to negotiate in good faith if your cities are being hit with missiles’ – Kyiv’s deputy foreign minister",
    "description": "Sergiy Kyslytsya on Moscow’s deceit, progress on peace and why Ireland and Ukraine have a similar history",
    "link": "https://www.irishtimes.com/world/2025/08/27/hard-to-negotiate-in-good-faith-if-your-cities-are-being-hit-with-missiles-kyivs-deputy-foreign-minister/",
    "timestamp": "2025-08-27T04:00:00Z"
  },
  {
    "title": "That's why they call it 'karma'",
    "description": "The “norms and traditions” crowd who tried to bankrupt and imprison Trump using “novel” legal theories and nebulous “facts” is barefoot in the china shop where they broke everything and complaining that their feet ...",
    "link": "https://www.americanthinker.com/blog/2025/08/that_s_why_the_call_it_karma.html",
    "timestamp": "2025-08-27T04:00:00Z"
  },
  {
    "title": "The Bolton raid: what's 'a predication'?",
    "description": "The recent service of search warrants on the home and office of former Trump advisor and current Trump hater John Bolton have provoked cries of “political retribution!” from the usual suspects. Though I have no access to the FBI’s c...",
    "link": "https://www.americanthinker.com/blog/2025/08/the_bolton_raid_what_s_predication.html",
    "timestamp": "2025-08-27T04:00:00Z"
  },
  {
    "title": "Suddenly, Kilmar didn't think being shipped to Costa Rica was such a bad thing after all",
    "description": "Funny how 'Uganda' has a way of concentrating an illegal alien's mind.\r\n\r\nAnd activating a new round of NGO legal challenges. The cash for lawyers must be rolling.\r\n\r\n Which is what we see with the world's most undesirable illega...",
    "link": "https://www.americanthinker.com/blog/2025/08/suddenly_kilmar_didn_t_think_being_shipped_to_costa_rica_was_such_a_bad_thing_after_all.html",
    "timestamp": "2025-08-27T04:00:00Z"
  },
  {
    "title": "Trump has broken the Democrat party",
    "description": "Trump has well and truly broken the Democrat party.\r\n\r\n \r\n\r\nHow do we know the Democrat party is broken?\r\n\r\n \r\n\r\nBecause Trump has them defending the indefensible, all manner of criminals – rapists, child molesters, murderers as well ...",
    "link": "https://www.americanthinker.com/blog/2025/08/trump_has_broken_the_democrat_party.html",
    "timestamp": "2025-08-27T04:00:00Z"
  },
  {
    "title": "US sending more ships to Caribbean to counter drug cartels",
    "description": "Washington (AFP) Aug 26, 2025\n\n \nUS President Donald Trump is dispatching two more ships to the Caribbean to crack down on drug cartels, a US source said Tuesday, a week after sending warships towards Venezuela. \n\nA guided missile crusier, the USS Erie, and a…",
    "link": "https://www.spacewar.com/reports/US_sending_more_ships_to_Caribbean_to_counter_drug_cartels_999.html",
    "timestamp": "2025-08-27T03:56:20Z"
  },
  {
    "title": "Xi says China, Russia ties 'most stable' in turbulent world",
    "description": "Beijing (AFP) Aug 26, 2025\n\n\n \nPresident Xi Jinping said on Tuesday that China's ties with Russia are the \"most stable, mature and strategically significant\" among major world powers, state media reported. \n\nDuring a meeting with Vyacheslav Volodin, chairman …",
    "link": "https://www.spacewar.com/reports/Xi_says_China_Russia_ties_most_stable_in_turbulent_world_999.html",
    "timestamp": "2025-08-27T03:56:20Z"
  },
  {
    "title": "Iran urges Europeans to 'make the right choice' on sanctions snapback",
    "description": "Tehran (AFP) Aug 26, 2025\n\n \nIran held talks on Tuesday with European powers, seeking to avert a sanctions snapback which they have threatened to impose under the moribund 2015 nuclear deal. \n\nKazem Gharibabadi, an Iranian deputy foreign minister who attended…",
    "link": "https://www.spacewar.com/reports/Iran_urges_Europeans_to_make_the_right_choice_on_sanctions_snapback_999.html",
    "timestamp": "2025-08-27T03:56:20Z"
  },
  {
    "title": "Trump Warns Of 'Economic War' If Putin Doesn't Pursue Peace",
    "description": "US President Donald Trump warned of “an economic war” if he cannot get Russia’s Vladimir Putin and Ukraine’s Volodymyr Zelenskiy to end their conflict, saying he had “very serious” consequences in mind if the fighting continues.",
    "link": "https://www.ndtvprofit.com/world/trump-warns-of-economic-war-if-putin-doesnt-pursue-peace",
    "timestamp": "2025-08-27T03:54:27Z"
  },
  {
    "title": "Cracker Barrel rolls back to old 'Uncle Herschel' logo, scraps new one after social media backlash; company stocks rise after initial decline",
    "description": "Cracker Barrel faced criticism for its new logo. The restaurant chain decided to revert to its old logo. This decision followed social media backlash and remarks from Donald Trump. Shares initially dropped but later increased after the announcement. The compa…",
    "link": "https://economictimes.indiatimes.com/news/international/us/cracker-barrel-rolls-back-to-old-uncle-herschel-logo-scraps-new-one-after-social-media-backlash-company-stocks-rise-after-initial-decline/articleshow/123537433.cms",
    "timestamp": "2025-08-27T03:54:16Z"
  },
  {
    "title": "Right-wing pundit Charlie Kirk claims Taylor Swift’s engagement to Travis Kelce is a sign she’ll become ‘conservative’",
    "description": "MAGA mouthpiece Charlie Kirk offered a somewhat disingenuous congratulations to the pop megastar – who he has regularly criticized for being ‘woke’ – following the announcement",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/charlie-kirk-taylor-swift-travis-kelce-engagement-b2814724.html",
    "timestamp": "2025-08-27T03:53:50Z"
  },
  {
    "title": "Gates met with Trump to talk global health",
    "description": "Microsoft Corp. co-founder and philanthropist Bill Gates met with United States President Donald Trump at the White House on Tuesday to discuss health initiatives, NBC News reported, citing a senior o...",
    "link": "https://biztoc.com/x/2ecd995e6de3413b",
    "timestamp": "2025-08-27T03:48:54Z"
  },
  {
    "title": "Meta to launch California super PAC backing pro-AI candidates",
    "description": "Meta will launch a California-focused political action committee to support candidates favouring lighter AI regulation. Aiming to influence state policy ahead of the 2026 governor race, the PAC reflects Meta’s push to protect innovation and business interests…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/meta-to-launch-california-super-pac-backing-pro-ai-candidates/articleshow/123537396.cms",
    "timestamp": "2025-08-27T03:43:56Z"
  },
  {
    "title": "West Discussing Sending 4-5 Brigades to Ensure Security in Ukraine - Yermak",
    "description": "Western states are discussing a possibility of sending 4-5 brigades by the group of countries supporting Ukraine - the so-called \"coalition of the willing\" - to ensure security in Ukraine along with \"strategic enablers\" from the US, the Financial Times newspa…",
    "link": "https://sputnikglobe.com/20250827/west-discussing-sending-4-5-brigades-to-ensure-security-in-ukraine---yermak-1122677085.html",
    "timestamp": "2025-08-27T03:39:00Z"
  },
  {
    "title": "Trump needs to deploy the National Guard to Chicago immediately!",
    "description": "On Monday, President Trump signed an executive order ending cashless bail nationwide and creating rapid-response National Guard units that can be deployed to any city in need.",
    "link": "https://nypost.com/2025/08/26/opinion/trump-needs-to-deploy-the-national-guard-to-chicago-immediately/",
    "timestamp": "2025-08-27T03:36:55Z"
  },
  {
    "title": "'Crazy for all kinds of reasons': Conservatives shred defense of Trump's tariffs",
    "description": "MAGA world's claim that President Donald Trump's tariffs have been good for the American economy is not based in reality, according to two conservative analysts. During a cabinet meeting on Tuesday, Trump said the U.S. has \"a lot of money coming in\" from tari…",
    "link": "https://www.rawstory.com/tariffs-2673923961/",
    "timestamp": "2025-08-27T03:32:51Z"
  },
  {
    "title": "Tether CEO Paolo Ardoino And Advisor Bo Hines Discuss U.S. Stablecoins",
    "description": "aolo Ardoino, CEO of Tether, and Bo Hines, former White House Crypto Council Executive Director and Tether’s new Strategic Advisor discussed U.S. stablecoin strategy.",
    "link": "https://www.forbes.com/sites/jasonbrett/2025/08/26/tether-ceo-paolo-ardoino-and-advisor-bo-hines-discuss-us-stablecoins/",
    "timestamp": "2025-08-27T03:28:16Z"
  },
  {
    "title": "Trump, a vocal Taylor Swift critic, reacts to her engagement with Travis Kelce",
    "description": "Trump was in a cabinet meeting when engagement was announced",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/trump-taylor-swift-travis-kelce-engagment-b2814715.html",
    "timestamp": "2025-08-27T03:26:56Z"
  },
  {
    "title": "Armenia-Azerbaijan Agreement—A Victory Of The America First Vision",
    "description": "By Giorgi Labadze, The Daily Signal | August 26, 2025\nAs a foreigner and political activist, I am often criticized for supporting President Donald Trump, with many questioning both my motivations and what potential benefits my country could possibly gain from…",
    "link": "https://biztoc.com/x/196f6b0b1f5ef454",
    "timestamp": "2025-08-27T03:26:33Z"
  },
  {
    "title": "Gavin Newsom Turns Full-Time Troll. Meanwhile, California Is Burning",
    "description": "By Jarrett Stepman, The Daily Signal | August 26, 2025\nGavin Newsom has memes and dunks, but does he have anything else? The California governor has received a lot of attention lately for adopting a new persona as the most prominent troll of President Donald …",
    "link": "https://biztoc.com/x/4d43c48e86542e0d",
    "timestamp": "2025-08-27T03:26:07Z"
  },
  {
    "title": "Indian goods to face 50 per cent US tariff from today",
    "description": "Relations between Washington and New Delhi have soured over India's reliance on Russian oil, with a trade deal yet to be agreed to despite five rounds of talks between the allies.",
    "link": "https://www.abc.net.au/news/2025-08-27/indian-goods-face-50-per-cent-us-tariff-from-today/105701206",
    "timestamp": "2025-08-27T03:24:18Z"
  },
  {
    "title": "Democrats break GOP supermajority in Iowa Senate by flipping Republican seat in special election",
    "description": "Catelin Drey's win gives her party an additional seat, bringing the number of Democrats serving in the upper chamber to 17 and breaking Republicans' two-thirds supermajority.",
    "link": "https://www.nbcnews.com/politics/elections/democrats-break-gop-supermajority-iowa-senate-catelin-drey-rcna227419",
    "timestamp": "2025-08-27T03:23:30Z"
  },
  {
    "title": "PM Modi's Diwali sparkle faces tough test amid Trump’s tariff sting",
    "description": "PM Modi plans to lower consumption taxes for Diwali. This aims to counter potential tariff hikes from Donald Trump. Amazon and Flipkart's sales may suffer if buyers delay purchases. The auto industry wants faster tax cuts. States need clarity on revenue shari…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/pm-modis-diwali-sparkle-faces-tough-test-amid-trumps-tariff-sting/articleshow/123537073.cms",
    "timestamp": "2025-08-27T03:22:18Z"
  },
  {
    "title": "CFTC’s Johnson confirms she will depart regulator next week",
    "description": "CFTC Commissioner Kristin Johnson will officially step down on Sept. 3, leaving only one member on the typically five-person Commission.",
    "link": "https://cointelegraph.com/news/cftc-commissioner-kristin-johnson-departure-crypto-regulation",
    "timestamp": "2025-08-27T03:20:47Z"
  },
  {
    "title": "India braces for 50% tariff shock as Trump’s levies set to land",
    "description": "After years of nurturing closer economic and security links, India and the U.S. are at odds over Trump’s trade war.",
    "link": "https://www.japantimes.co.jp/business/2025/08/27/economy/india-tariff-shock-trump/",
    "timestamp": "2025-08-27T03:17:00Z"
  },
  {
    "title": "Trump suddenly wants to allow a record 600,000 Chinese students into American universities, because if he doesn't, the bottom-level colleges will close or something. Some in his base have a problem with this [Unlikely]",
    "description": "Trump suddenly wants to allow a record 600,000 Chinese students into American universities, because if he doesn't, the bottom-level colleges will close or something. Some in his base have a problem with this",
    "link": "https://www.fark.com/comments/13790678/Trump-suddenly-wants-to-allow-a-record-600000-Chinese-students-into-American-universities-because-if-he-doesnt-bottom-level-colleges-will-close-something-Some-in-his-base-have-a-problem-with-this",
    "timestamp": "2025-08-27T03:16:57Z"
  },
  {
    "title": "WRAPUP 2-US business spending on equipment resilient; labor market confidence weakening | Business",
    "description": "New orders for key US-manufactured capital goods increased more than expected in July suggesting business spending on equipment got off to a strong start in the third quarter but consumers deteriorating assessment of the labor market cast a pall over the econ…",
    "link": "https://www.devdiscourse.com/article/business/3604429-wrapup-2-us-business-spending-on-equipment-resilient-labor-market-confidence-weakening",
    "timestamp": "2025-08-27T03:15:59Z"
  },
  {
    "title": "Trump Moves To Fire Federal Reserve Governor, But She Says He Can’t",
    "description": "By George Caldwell, The Daily Signal | August 26, 2025\nPresident Donald Trump claims to have fired Federal Reserve Gov. Lisa Cook, but she begs to differ.\n“President Trump purported to fire me ‘for cause’ when no cause exists under the law, and he has no auth…",
    "link": "https://biztoc.com/x/e16a72fbf7b31706",
    "timestamp": "2025-08-27T03:15:00Z"
  },
  {
    "title": "ETF analyst questions how Canary’s TRUMP fund ‘gets through’",
    "description": "Analyst Eric Balchunas says exchange-traded funds must have a futures product live for at least six months, which Canary doesn't have for its TRUMP fund.",
    "link": "https://cointelegraph.com/news/canary-capital-trump-coin-etf-us-sec",
    "timestamp": "2025-08-27T03:09:15Z"
  },
  {
    "title": "Cracker Barrel revives old logo after backlash stoked by Trump",
    "description": "US restaurant chain abandons rebrand after new logo prompts firestorm of criticism online.",
    "link": "https://www.aljazeera.com/economy/2025/8/27/cracker-barrel-revives-old-logo-after-backlash-stoked-by-trump",
    "timestamp": "2025-08-27T03:06:25Z"
  },
  {
    "title": "Trump Posts Cracker Barrel Meme of Him Posing as Uncle Herschel",
    "description": "President Donald Trump posted a meme of the Cracker Barrel logo, which showed him posing as Uncle Herschel, who was the uncle of Cracker Barrel's founder, Dan Evins.\nThe post Trump Posts Cracker Barrel Meme of Him Posing as Uncle Herschel appeared first on Br…",
    "link": "https://www.breitbart.com/politics/2025/08/26/trump-posts-cracker-barrel-meme-posing-uncle-herschel/",
    "timestamp": "2025-08-27T03:05:27Z"
  },
  {
    "title": "RFK Jr. Vowed To Find The Environmental Causes Of Autism. Then He Shut Down Research Trying To Do Just That.",
    "description": "This story was originally published by ProPublica. Republished under a CC BY-NC-ND 3.0 license. Erin McCanlies was listening to the radio one morning in April when she heard Robert F. Kennedy Jr. promising to find the cause of autism by September. The secreta…",
    "link": "https://www.techdirt.com/2025/08/26/rfk-jr-vowed-to-find-the-environmental-causes-of-autism-then-he-shut-down-research-trying-to-do-just-that/",
    "timestamp": "2025-08-27T03:04:35Z"
  },
  {
    "title": "Waiting for Trump to realize that the plan to conquer Gaza is just another Netanyahu spin",
    "description": "All actors in the Middle East are waiting for Trump to realize that the Israeli plan to conquer Gaza City is just more spin, one which will only lead to more destruction, ruin and death – and won't convince Hamas to surrender under Netanyahu's terms",
    "link": "https://www.haaretz.com/israel-news/2025-08-27/ty-article/.premium/waiting-for-trump-to-realize-that-the-plan-to-conquer-gaza-is-just-another-netanyahu-spin/00000198-e7ed-d8de-a3bb-e7efeeed0000",
    "timestamp": "2025-08-27T03:01:49Z"
  },
  {
    "title": "DC launches ‘We the People’ campaign while National Guard patrols streets, picks up trash",
    "description": "National Guard troops picked up trash under Trump’s DC takeover while tourism officials promoted record visitation and a new “We the People DC\" campaign.",
    "link": "https://www.foxnews.com/politics/dc-launches-we-people-campaign-while-national-guard-patrols-streets-picks-up-trash",
    "timestamp": "2025-08-27T03:01:24Z"
  },
  {
    "title": "Late Night Open Thread: Blue Roses",
    "description": "Dem messaging nerds: Messages about Donald Trump’s “rising authoritarianism” are “unconvincing” Trump: www.rollingstone.com/politics/pol… [image or embed] — Andrew Perez (@andrewperez.bsky.social) August 26, 2025 at 3:54 PM I have never been a David Shor fan …",
    "link": "https://balloon-juice.com/2025/08/26/late-night-open-thread-blue-roses/",
    "timestamp": "2025-08-27T03:01:19Z"
  },
  {
    "title": "Breitbart Business Digest: Why Lisa Cook’s Lawsuit to Keep Her Job Is Likely to Lose",
    "description": "Federal Reserve Governor Lisa Cook’s attempt to overturn her removal faces long odds.\nThe post Breitbart Business Digest: Why Lisa Cook’s Lawsuit to Keep Her Job Is Likely to Lose appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/08/26/breitbart-business-digest-why-lisa-cooks-lawsuit-to-keep-her-job-is-likely-to-lose/",
    "timestamp": "2025-08-27T03:00:15Z"
  },
  {
    "title": "Chris Hayes Calls Trump the Most ‘Pro-Criminal, Pro-Crime President of My Lifetime’ | Video",
    "description": "The list of people the president has pardoned or helped is \"wild\" and \"unlike any list I've ever seen or ever covered,\" he adds\nThe post Chris Hayes Calls Trump the Most ‘Pro-Criminal, Pro-Crime President of My Lifetime’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/chris-hayes-trump-the-most-pro-criminal-pro-crime-president-msnbc/",
    "timestamp": "2025-08-27T03:00:03Z"
  },
  {
    "title": "Trump Media And Partners Raise $6 Billion For The First CRO Treasury",
    "description": "The Trump Media & Technology Group (TMTG) announced on Tuesday that it has partnered with the digital asset platform Crypto.com and the special-purpose acquisition company Yorkville to create the first Cronos (CRO) treasury. New CRO Treasury Project The annou…",
    "link": "http://www.newsbtc.com/news/trump-media-and-partners-raise-6-billion-for-the-first-cro-treasury/",
    "timestamp": "2025-08-27T03:00:00Z"
  },
  {
    "title": "Travis Kelce's Dad Reveals Details on His Son's Engagement to Swift",
    "description": "The couple announced their engagement in a joint Instagram post Tuesday afternoon, sending social media into a frenzy.",
    "link": "https://www.newsweek.com/travis-kelce-dad-reveals-details-engagement-taylor-swift-2119867",
    "timestamp": "2025-08-27T02:57:55Z"
  },
  {
    "title": "In India's diamond hub, looming U.S. tariffs cut into growing trade ambitions",
    "description": "Trump's levies threaten to sever India's access to its largest diamond market, which accounts for nearly a third of its $28.5 billion annual shipments of gems and jewelry.",
    "link": "https://www.japantimes.co.jp/business/2025/08/27/markets/india-diamond-hub-us-tariffs/",
    "timestamp": "2025-08-27T02:54:00Z"
  },
  {
    "title": "Asian markets diverge with eyes on Nvidia earnings",
    "description": "Asian markets diverged Wednesday morning following broad losses the previous day, as attention turns from political pressure on the US central bank to a key earnings report by AI giant Nvidia. Tuesday’s declines in Tokyo, Hong Kong, Seoul and across the conti…",
    "link": "https://www.digitaljournal.com/world/asian-markets-diverge-with-eyes-on-nvidia-earnings/article",
    "timestamp": "2025-08-27T02:52:32Z"
  },
  {
    "title": "Asian Markets Diverge With Eyes On Nvidia Earnings",
    "description": "Asian markets diverged Wednesday morning following broad losses the previous day, as attention turns from political pressure on the US central bank to a key earnings report by AI giant Nvidia.",
    "link": "https://www.ibtimes.com/asian-markets-diverge-eyes-nvidia-earnings-3781725",
    "timestamp": "2025-08-27T02:51:12Z"
  },
  {
    "title": "‘They’re All Dead!’: Watters Slams ‘White Dudes For Harris’ Guest After He Says National Guard’s Not Needed In Chicago",
    "description": "Watters halted former Harris' Senior Adviser Mike Nellis after he claimed that the National Guard would not be needed in Chicago to halt the crime.",
    "link": "https://dailycaller.com/2025/08/26/jesse-watters-slams-mike-nellis-national-guard-chicago-crime-donald-trump/",
    "timestamp": "2025-08-27T02:47:33Z"
  },
  {
    "title": "Democrats Flip State Seat in District Trump Won by Double Digits",
    "description": "Democrat Catelin Drey beat Republican Christopher Prosch in a district Donald Trump won by double digits in 2024.",
    "link": "https://www.newsweek.com/democrat-flips-iowa-state-senate-seat-trump-district-2119871",
    "timestamp": "2025-08-27T02:46:00Z"
  },
  {
    "title": "Meta's planned Louisiana AI data centre to cost $50 billion: Donald Trump",
    "description": "Meta is building a $50 billion AI data centre in Louisiana, its largest yet, to support advanced digital infrastructure. Financed partly by PIMCO and Blue Owl Capital, the project reflects CEO Mark Zuckerberg’s major AI push through Superintelligence Labs, de…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/metas-planned-louisiana-ai-data-centre-to-cost-50-billion-donald-trump/articleshow/123536596.cms",
    "timestamp": "2025-08-27T02:44:57Z"
  },
  {
    "title": "China’s Soy Crushers May Be Facing a Winter Without US Beans",
    "description": "Just days before the start of the US export season for soybeans, the world’s top importer doesn’t appear to have bought a single American cargo for the coming year.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-soy-crushers-may-be-facing-a-winter-without-us-beans",
    "timestamp": "2025-08-27T02:36:15Z"
  },
  {
    "title": "The private, sentimental location of Taylor Swift and Travis Kelce’s engagement revealed",
    "description": "Page Six exclusively confirmed where the NFL star's romantic garden proposal took place.",
    "link": "https://pagesix.com/2025/08/26/celebrity-news/the-sentimental-location-of-taylor-swift-and-travis-kelces-engagement-revealed/",
    "timestamp": "2025-08-27T02:33:08Z"
  },
  {
    "title": "Trump to chair Gaza meeting in Washington, top US and Israeli diplomats to also meet",
    "description": "U.S. special envoy Steve Witkoff announced that President Trump will chair a White House meeting on Gaza, aiming to resolve the conflict by year's end. Secretary of State Marco Rubio is also scheduled to meet with Israeli Foreign Minister Gideon Saar. The U.S.",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-to-chair-gaza-meeting-in-washington-top-us-and-israeli-diplomats-to-also-meet/articleshow/123536462.cms",
    "timestamp": "2025-08-27T02:33:04Z"
  },
  {
    "title": "Mike Pence Slams Trump's Intel Investment As Abandonment Of Free Markets, Draws Parallels With China, Russia And Iran",
    "description": "Former Vice President Mike Pence has endorsed Republican strategist Marc Short's criticism of the Donald Trump-led administration’s stake in Intel Corporation (NASDAQ:INTC) worth $11 billion, warning that the plan betrays the GOP's free-market principles.\nMar…",
    "link": "https://biztoc.com/x/5b9c4abbe55eb8e2",
    "timestamp": "2025-08-27T02:30:13Z"
  },
  {
    "title": "Trump Nobel Peace Prize Campaign May Be in its 'Last Throes': John Bolton",
    "description": "Bolton said Trump's Ukraine peace effort was \"collapsing.\"",
    "link": "https://www.newsweek.com/trump-nobel-peace-prize-john-bolton-last-throes-2119862",
    "timestamp": "2025-08-27T02:26:30Z"
  },
  {
    "title": "Why White House Wants Everyone to Stop Talking About Trump’s Health: Author",
    "description": "Why White House Wants Everyone to Stop Talking About Trump’s Health: Authorthedailybeast.com",
    "link": "https://www.thedailybeast.com/why-white-house-wants-everyone-to-stop-talking-about-trumps-health-author/",
    "timestamp": "2025-08-27T02:26:03Z"
  },
  {
    "title": "Trump signs proclamation commemorating Abbey Gate attack anniversary with Gold Star families (Louis Casiano/Fox News)",
    "description": "Louis Casiano / Fox News:\nTrump signs proclamation commemorating Abbey Gate attack anniversary with Gold Star families  —  Trump was surrounded by Gold Star families during the White House ceremony honoring 13 fallen service members  —  President Donald Trump…",
    "link": "https://www.memeorandum.com/250826/p166",
    "timestamp": "2025-08-27T02:25:00Z"
  },
  {
    "title": "Venezuela deploys warships, drones to coast as US naval squadron nears",
    "description": "Venezuelan Defence Ministry orders naval patrols as US warships sent to waters off coast to tackle drug cartels.",
    "link": "https://www.aljazeera.com/news/2025/8/27/venezuela-deploys-warships-drones-to-coast-as-us-naval-squadron-nears",
    "timestamp": "2025-08-27T02:24:58Z"
  }
]