[
  {
    "title": "He Fired Crucial 'Ninth Shot' Against Trump Gunman",
    "description": "It appears that a shot fired by a local law enforcement officer is the one that stopped the would-be assassin of Donald Trump in Butler, Pennsylvania, last year. Now, the Washington Post is out with the first extensive interview given by Aaron Zaliponi about …",
    "link": "https://www.newser.com/story/371729/he-fired-crucial-ninth-shot-against-trump-gunman.html",
    "timestamp": "2025-07-11T12:27:00Z"
  },
  {
    "title": "State Department is firing over 1,300 employees under Trump administration plan",
    "description": "he State Department is firing more than 1,300 employees on Friday in line with a dramatic reorganization plan initiated by the Trump administration earlier this year.",
    "link": "https://www.wxyz.com/news/state-department-is-firing-over-1-300-employees-under-trump-administration-plan",
    "timestamp": "2025-07-11T12:25:51Z"
  },
  {
    "title": "XRP price prediction: XRP jumps 6% to $2.57 on Trump’s ETF inclusion — is XRP the next 10x crypto to grab now?",
    "description": "XRP price prediction is back in the spotlight as XRP surges 6% to $2.57 after being included in Donald Trump’s new “Crypto Blue‑Chip ETF.” This massive boost has reignited interest among investors wondering if XRP is the next 10x crypto to watch. With legal c…",
    "link": "https://economictimes.indiatimes.com/news/international/us/xrp-price-prediction-xrp-jumps-6-to-2-57-on-trumps-etf-inclusion-is-xrp-the-next-10x-crypto-to-grab-now/articleshow/122388181.cms",
    "timestamp": "2025-07-11T12:23:17Z"
  },
  {
    "title": "Peter Schiff says sell Bitcoin for silver as BTC smashes new highs",
    "description": "Bitcoin’s new all-time high near $118,000 has sparked mixed reactions, with gold bug Peter Schiff urging a switch to silver, while others are more bullish than ever.",
    "link": "https://cointelegraph.com/news/bitcoin-hits-new-high-schiff-silver-call",
    "timestamp": "2025-07-11T12:23:14Z"
  },
  {
    "title": "Biblical betrayal? Ken Paxton’s wife drops divorce bombshell ahead of explosive US Senate showdown",
    "description": "Angela Paxton, a current Texas state senator, took to social media on Thursday to announce the end of her 38-year marriage — a relationship long intertwined with the landscape of Texas politics.",
    "link": "https://economictimes.indiatimes.com/news/international/us/biblical-betrayal-ken-paxtons-wife-drops-divorce-bombshell-ahead-of-explosive-us-senate-showdown/articleshow/122388885.cms",
    "timestamp": "2025-07-11T12:22:31Z"
  },
  {
    "title": "In a post, Donald Trump says he will withhold support and endorsements for any Republican who votes against his bill to claw back CPB funding (Ted Johnson/Deadline)",
    "description": "Ted Johnson / Deadline:\nIn a post, Donald Trump says he will withhold support and endorsements for any Republican who votes against his bill to claw back CPB funding  —  The Senate next week is expected to consider a package to rescind $9.4 billion in funding…",
    "link": "https://mediagazer.com/250711/p2",
    "timestamp": "2025-07-11T12:20:01Z"
  },
  {
    "title": "US stock futures hit lower circuit as Trump hits Canada with tariffs",
    "description": "U.S. stock index futures fell on Friday, as President Donald Trump amplified his tariff offensive against Canada, adding another layer of uncertainty around Washington's trade policies.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-futures-hit-lower-circuit-as-trump-hits-canada-with-tariffs/articleshow/122388831.cms",
    "timestamp": "2025-07-11T12:17:37Z"
  },
  {
    "title": "EXCLUSIVE: Pentagon Ditches Admiral Who Allowed Drag Queen Performances On Aircraft Carrier",
    "description": "The Defense Department is withdrawing the nomination of Rear Adm. Michael “Buzz” Donnelly, The Daily Wire can first report, under whose command drag performances took place on board the USS Ronald Reagan. Donnelly served as commanding officer of the aircraft …",
    "link": "https://freerepublic.com/focus/f-bloggers/4328063/posts",
    "timestamp": "2025-07-11T12:16:57Z"
  },
  {
    "title": "JPMorgan’s Dimon warns markets are complacent on tariffs",
    "description": "Markets are complacent on tariffs planned by U.S. President Donald Trump, JPMorgan Chase CEO Jamie Dimon has warned. Find out more.",
    "link": "https://financialpost.com/investing/jpmorgan-dimon-markets-complacent-tariffs",
    "timestamp": "2025-07-11T12:16:42Z"
  },
  {
    "title": "Rubio says Xi-Trump summit looking likely",
    "description": "The U.S. envoy said he had a \"very constructive and positive” sit-down with Wang Yi on Friday, building on recent momentum in bilateral ties.",
    "link": "https://www.japantimes.co.jp/news/2025/07/11/world/politics/xi-trump-summit-likely/",
    "timestamp": "2025-07-11T12:14:00Z"
  },
  {
    "title": "Trump Threatens 200% Pharma Tariffs, But Analyst Says This Stock Is Immune And Expected To 'Benefit' From Levies",
    "description": "While President Donald Trump's proposed 200% tariffs on pharmaceutical imports could potentially squeeze the profit margins, this stock is poised to “benefit” from the levies. \nWhat Happened: Trump announced on Tuesday that the pharma tariffs, part of a Secti…",
    "link": "https://biztoc.com/x/dc35f84a335b5f05",
    "timestamp": "2025-07-11T12:13:28Z"
  },
  {
    "title": "Why Isn't the Fed Cutting Interest Rates? What To Know",
    "description": "The central bank remains cautious, even as calls for rate cuts grow louder from the White House and other policymakers.",
    "link": "https://www.newsweek.com/what-know-federal-reserve-rate-cuts-2097726",
    "timestamp": "2025-07-11T12:13:17Z"
  },
  {
    "title": "Marco Rubio: Strong US-China will for Trump’s meeting with Xi",
    "description": "The US Secretary of State met his Chinese counterpart in Malaysia\nThe post Marco Rubio: Strong US-China will for Trump’s meeting with Xi appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/07/11/marco-rubio-strong-us-china-will-for-trumps-meeting-with-xi/",
    "timestamp": "2025-07-11T12:13:13Z"
  },
  {
    "title": "Days after Supreme Court go-ahead, State Department fires over 1,300 employees",
    "description": "While lauded by President Donald Trump, Secretary of State Marco Rubio and their Republican allies, the cuts have been roundly criticized by current and former diplomats.",
    "link": "https://fortune.com/2025/07/11/state-firing-over-1300-rubio-modern-diplomacy-bloated-bureaucracy/",
    "timestamp": "2025-07-11T12:13:01Z"
  },
  {
    "title": "Bitcoin ETFs Post Second-Biggest Day Ever: Why It Matters",
    "description": "BlackRock’s IBIT led Thursday’s ETF inflows with $448.5 million, as capital consolidated into top issuers despite outflows from GBTC.",
    "link": "https://decrypt.co/329677/bitcoin-etfs-post-second-biggest-day-ever-why-it-matters",
    "timestamp": "2025-07-11T12:12:35Z"
  },
  {
    "title": "Monty Python star says he’d be in ‘select company’ if thrown out of Trump’s America",
    "description": "‘It’s very scary now because they’re stopping comedians at the border,’ said the star",
    "link": "https://www.the-independent.com/arts-entertainment/comedy/news/eric-idle-trump-monty-python-b2787248.html",
    "timestamp": "2025-07-11T12:12:18Z"
  },
  {
    "title": "Democracy Experts Scorned by Trump Are Plotting to Sabotage Democracy",
    "description": "I have just come across the most remarkable story in the news outlet NOTUS. Its headline is, “Trump Fired Them. Now They’re Plotting to Stop Him,” and yet, despite its explosive subject matter, it is written in the sort of dry, matter-of-fact tone that one wo…",
    "link": "https://freerepublic.com/focus/f-news/4328062/posts",
    "timestamp": "2025-07-11T12:12:08Z"
  },
  {
    "title": "Forbes Daily: The Snack Wrap Is Back, And Wall Street Is Lovin’ It",
    "description": "Today’s Forbes Daily features new Canada tariffs, Ferrero’s $3.1 billion Kellogg deal, bitcoin's all-time high, Grok is coming to Tesla vehicles and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/07/11/forbes-daily-the-snack-wrap-is-back-and-wall-street-is-lovin-it/",
    "timestamp": "2025-07-11T12:09:02Z"
  },
  {
    "title": "Trump Admin Purges 1,300 State Department Jobs in Monumental Shake-Up",
    "description": "More than 1,300 State Department employees are being laid off Friday as part of a sweeping Trump administration plan to overhaul American diplomacy.\nThe post Trump Admin Purges 1,300 State Department Jobs in Monumental Shake-Up first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-admin-purges-1300-state-department-jobs-in-monumental-shake-up/",
    "timestamp": "2025-07-11T12:09:00Z"
  },
  {
    "title": "State Department is firing over 1,300 employees under Trump administration plan",
    "description": "The State Department is firing over 1,300 employees in line with a dramatic reorganization plan initiated by the Trump administration earlier this year",
    "link": "https://www.wsbtv.com/news/politics/state-department-is/NHV5OMCQOJCQLNX6HSTG7LBJHU/",
    "timestamp": "2025-07-11T12:08:45Z"
  },
  {
    "title": "US stock market future today: Dow, S&P 500, Nasdaq futures drop as Trump slaps 35% tariff on Canada; Nvidia hits $4T, AMD surges, CoreWeave crashes",
    "description": "US stock market futures fell after President Donald Trump announced a 35% tariff on Canada, starting August 1, intensifying global trade concerns. Despite positive earnings from companies like Delta and Levi Strauss, investor sentiment weakened as Trump warne…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-future-today-dow-sp-500-nasdaq-futures-drop-as-trump-slaps-35-tariff-on-canada-nvidia-hits-4t-amd-surges-coreweave-crashes/articleshow/122388349.cms",
    "timestamp": "2025-07-11T12:06:03Z"
  },
  {
    "title": "NATO needs more long-range missiles to deter Russia, US general says",
    "description": "BERLIN (Reuters) -NATO will need more long-range missiles in its arsenal to deter Russia from attacking Europe because Moscow is expected to increase production of long-range weapons, a U.S. Army general told Reuters. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/11/nato-needs-more-long-range-missiles-to-deter-russia-us-general-says",
    "timestamp": "2025-07-11T12:06:00Z"
  },
  {
    "title": "Some of Iran’s enriched uranium survived attacks, Israeli official says",
    "description": "Official said any attempts by Iran to recover it would almost certainly be detected",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/07/10/us/politics/iran-attacks-damage.html",
    "timestamp": "2025-07-11T12:03:38Z"
  },
  {
    "title": "'Mysterious order' could give Clarence Thomas an excuse to undo voting rights",
    "description": "U.S. Supreme Court justice Clarence Thomas has long telegraphed his desire to gut crucial portions of the Voting Rights Act, and he might finally get a chance to undermine protections ensuring equal rights for Black and Hispanic voters.Thomas first laid out h…",
    "link": "https://www.rawstory.com/clarence-thomas-voting-rights-mystery/",
    "timestamp": "2025-07-11T12:03:26Z"
  },
  {
    "title": "NATO needs more long-range missiles to deter Russia, US general says",
    "description": "NATO needs more long-range missiles to keep Russia away. A US Army General says Russia is making more long-range weapons. Europe depends on the US for these missiles. Germany and the US had a deal to put US missiles in Germany. Some European countries are wor…",
    "link": "https://economictimes.indiatimes.com/news/defence/nato-needs-more-long-range-missiles-to-deter-russia-us-general-says/articleshow/122388574.cms",
    "timestamp": "2025-07-11T12:02:32Z"
  },
  {
    "title": "US State Department is laying off more than 1,300 staffers",
    "description": "The State Department is firing over 1,300 career diplomats and civil servants in line with a dramatic reorganization plan initiated by the Trump administration earlier this year.",
    "link": "https://www.hurriyetdailynews.com/us-state-department-is-laying-off-more-than-1-300-staffers-211375",
    "timestamp": "2025-07-11T12:02:03Z"
  },
  {
    "title": "5,000 Colorado Medicaid patients who used Planned Parenthood must find new doctors",
    "description": "H.R. 1 prohibits Medicaid payments for one year to nonprofit organizations that provide abortions and also received at least $800,000 in federal funding in 2023.",
    "link": "https://www.denverpost.com/2025/07/11/colorado-medicaid-planned-parenthood-trump-tax-law/",
    "timestamp": "2025-07-11T12:00:31Z"
  },
  {
    "title": "Washington Post staff 'shellshocked' by constant blows to morale as bosses seek buyouts, insider says",
    "description": "The latest effort by The Washington Post to reduce headcount is hitting a wall according to one insider at the paper, as low morale continues to plague the newsroom.",
    "link": "https://www.foxnews.com/media/washington-post-staff-shellshocked-constant-blows-morale-bosses-seek-buyouts-insider-says",
    "timestamp": "2025-07-11T12:00:22Z"
  },
  {
    "title": "Trump Drops New Bombshell Threat On Largest U.S. Trade Customer — Coming Aug. 1",
    "description": "Trump dropped a new tariff threat on Canada, promising an additional 35% import tax on all goods from the largest U.S. trade customer — starting Aug. 1.\nThe post Trump Drops New Bombshell Threat On Largest U.S. Trade Customer — Coming Aug. 1 first appeared on…",
    "link": "https://www.mediaite.com/media/news/trump-drops-new-bombshell-threat-on-largest-u-s-trade-customer-coming-aug-1/",
    "timestamp": "2025-07-11T12:00:20Z"
  },
  {
    "title": "Racial Profiling",
    "description": "<ul>\n<li>Weaponizing Disaster Recovery</li>\n<li>Trolling Democracy</li>\n<li>A Sap</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/racial-profiling",
    "timestamp": "2025-07-11T12:00:00Z"
  },
  {
    "title": "‘The Feminist Agenda Is Wildly Popular’: Celinda Lake on the Political Power of Feminist Voters",
    "description": "Pollster and leading Democratic strategist Celinda Lake has been examining the data on women and feminist voters for decades. I talked to her about what Americans really want. (Spoiler alert: It’s not Project 2025.)\n\"People think that feminism is a dirty word…",
    "link": "https://msmagazine.com/2025/07/11/celinda-lake-democrat-women-feminist-voters-polling-2024-election/",
    "timestamp": "2025-07-11T12:00:00Z"
  },
  {
    "title": "In Texas, the Cost of Early Warnings Was Paid in Death",
    "description": "In the early morning of July 4, a flash flood emergency was issued for Austin and San Antonio by the National Weather Service in Texas.... Read More\nThe post In Texas, the Cost of Early Warnings Was Paid in Death appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/11/texas-the-cost-of-flash-flood-early-warnings-was-paid-in-death/",
    "timestamp": "2025-07-11T12:00:00Z"
  },
  {
    "title": "Day 1,234 of WW3. Germany plans to buy Patriot systems for Ukraine. Orc oafishals are spooked by former minister's \"suicide\", and lack of battlefield progress forces russia to increase drone and missile attacks. This is your Friday Ukraine War thread [News]",
    "description": "Day 1,234 of WW3. Germany plans to buy Patriot systems for Ukraine. Orc oafishals are spooked by former minister's \"suicide\", and lack of battlefield progress forces russia to increase drone and missile attacks. This is your Friday Ukraine War thread",
    "link": "https://www.fark.com/comments/13737432/Day-1234-of-WW3-Germany-plans-to-buy-Patriot-systems-for-Ukraine-Orc-oafishals-are-spooked-by-former-ministers-suicide-lack-of-battlefield-progress-forces-russia-to-increase-drone-missile-attacks-This-is-your-Friday-Ukraine-War-thread",
    "timestamp": "2025-07-11T12:00:00Z"
  },
  {
    "title": "Birthright Citizenship Faces Supreme Court Climax",
    "description": "A judge has blocked President Donald Trump's order restricting birthright citizenship from taking effect anywhere in the United States.",
    "link": "https://www.newsweek.com/birthright-citizenship-faces-supreme-court-climax-2097721",
    "timestamp": "2025-07-11T11:59:26Z"
  },
  {
    "title": "PM promises Ottawa will defend workers and businesses following latest US trade threats",
    "description": "Prime Minister Mark Carney says the Canadian government will \"steadfastly\" defend workers and businesses following the latest trade threats by US President Donald Trump.",
    "link": "https://www.nationalobserver.com/2025/07/11/news/pm-promises-ottawa-will-defend-workers-businesses-following-latest-us-trade-threats",
    "timestamp": "2025-07-11T11:58:12Z"
  },
  {
    "title": "Trump’s African summit was a masterclass in modern colonial theatre",
    "description": "To dodge Trump’s tariffs and wrath, five African presidents played colonial subject, and left their dignity behind.",
    "link": "https://www.aljazeera.com/opinions/2025/7/11/trumps-african-summit-was-a-masterclass-in-modern-colonial-theatre",
    "timestamp": "2025-07-11T11:56:52Z"
  },
  {
    "title": "State Department is firing over 1,300 employees under Trump administration plan",
    "description": "The department is sending layoff notices to 1,107 civil servants and 246 foreign service officers.",
    "link": "https://www.denverpost.com/2025/07/11/us-state-department-cuts-2/",
    "timestamp": "2025-07-11T11:56:17Z"
  },
  {
    "title": "State Department is firing over 1,300 employees under Trump administration plan",
    "description": "The department is sending layoff notices to 1,107 civil servants and 246 foreign service officers.",
    "link": "https://www.bostonherald.com/2025/07/11/us-state-department-cuts-2/",
    "timestamp": "2025-07-11T11:56:17Z"
  },
  {
    "title": "Trump threatens Canada with 35 per cent tariffs on Aug. 1 in letter posted online",
    "description": "US President Donald Trump threatened to impose 35 per cent tariffs on Canadian imports on Aug. 1 in a letter to Prime Minister Mark Carney posted on social media on Thursday night, evidently setting a new date for bilateral negotiations between the two countr…",
    "link": "https://www.nationalobserver.com/2025/07/11/news/trump-threatens-canada-35-cent-tariffs-aug-1-letter-posted-online",
    "timestamp": "2025-07-11T11:54:00Z"
  },
  {
    "title": "Russian drones strike Ukraine's 2nd-largest city, damaging maternity hospital",
    "description": "A Russian drone attack in Kharkiv injured nine and damaged a maternity hospital, prompting evacuations. Intensified Russian strikes across Ukraine have caused a surge in civilian casualties. President Zelenskyy is urgently requesting more air defense systems …",
    "link": "https://economictimes.indiatimes.com/news/defence/russian-drones-strike-ukraines-2nd-largest-city-damaging-maternity-hospital/articleshow/122388396.cms",
    "timestamp": "2025-07-11T11:53:57Z"
  },
  {
    "title": "Donald Trump family now earns whopping $500 million from cryptocurrency business. Who are paying them?",
    "description": "Trump family members have now earned around $500 million from World Liberty since the crypto platform was launched last fall, Reuters calculations show.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-family-now-earns-whopping-500-million-from-cryptocurrency-business-who-are-paying-them/articleshow/122388227.cms",
    "timestamp": "2025-07-11T11:53:49Z"
  },
  {
    "title": "Share of U.S. adults saying immigration is a ‘good thing’ has jumped from 64% to 79% with Trump back in office",
    "description": "Just months after President Donald Trump returned to office vowing mass deportations, the share of U.S. adults saying immigration is a “good thing” for the country has jumped substantially — including among Republicans, according to new Gallup polling.\nAbout …",
    "link": "https://biztoc.com/x/81ea00efca5230b4",
    "timestamp": "2025-07-11T11:53:04Z"
  },
  {
    "title": "Eric Idle Was Asked What's Funny About Trump And His Answer Was No Laughing Matter",
    "description": "Eric Idle Was Asked What's Funny About Trump And His Answer Was No Laughing Matterhuffpost.com",
    "link": "https://www.huffpost.com/entry/eric-idle-donald-trump-rfk-jr_n_6870e4b1e4b00de383c0b4cd",
    "timestamp": "2025-07-11T11:52:37Z"
  },
  {
    "title": "Ukraine to receive US air defence systems, says Trump",
    "description": "The US president said he will send weapons to Nato, which he said would pay and then give the weapons to Ukraine.",
    "link": "https://www.bbc.com/news/articles/crl04200dp4o",
    "timestamp": "2025-07-11T11:48:37Z"
  },
  {
    "title": "Trump plans to tour Texas flood damage as the scope of the disaster tests his pledge to shutter FEMA",
    "description": "Trump plans to tour affected areas by air, meet first responders and speak with victims' families.",
    "link": "https://www.denverpost.com/2025/07/11/trump-visits-texas-flood-damage/",
    "timestamp": "2025-07-11T11:48:04Z"
  },
  {
    "title": "Trump plans to tour Texas flood damage as the scope of the disaster tests his pledge to shutter FEMA",
    "description": "Trump plans to tour affected areas by air, meet first responders and speak with victims' families.",
    "link": "https://www.bostonherald.com/2025/07/11/trump-visits-texas-flood-damage/",
    "timestamp": "2025-07-11T11:48:04Z"
  },
  {
    "title": "The Fight For The Fate Of The Intelligence Community Is On",
    "description": "Stay with me on this. It gets a bit complicated. Roughly nine years ago, a bunch of senior intelligence and law enforcement officials, retired senior intelligence and law enforcement officials, members of Hillary Clinton’s Presidential campaign, and miscellan…",
    "link": "https://freerepublic.com/focus/f-chat/4328056/posts",
    "timestamp": "2025-07-11T11:44:27Z"
  },
  {
    "title": "Why the US is losing manufacturing jobs amid Trump’s shock-and-awe tariffs | CNN Business",
    "description": "President Donald Trump’s shock-and-awe tariff campaign is off to a slow start when it comes to reviving American manufacturing jobs.",
    "link": "https://www.cnn.com/2025/07/11/business/jobs-trump-tariffs-manufacturing",
    "timestamp": "2025-07-11T11:44:15Z"
  },
  {
    "title": "Trump wants mass deportations, but US views of immigration are more positive since he took office",
    "description": "A Gallup poll shows a substantial jump in the share of Americans who view immigration as positive for the U.S. since President Donald Trump took office",
    "link": "https://abcnews.go.com/US/wireStory/trump-mass-deportations-us-views-immigration-positive-office-123671207",
    "timestamp": "2025-07-11T11:42:26Z"
  },
  {
    "title": "FDA Offers to Trade Faster Drug Reviews for Lower US Prices",
    "description": "Food and Drug Administration Commissioner Marty Makary said his agency may fast-track new drugs from pharmaceutical companies that “equalize” the cost of their medicines between the US and other countries, an unusual proposition from the regulator that’s long…",
    "link": "https://www.livemint.com/companies/news/fda-offers-to-trade-faster-drug-reviews-for-lower-us-prices-11752234070645.html",
    "timestamp": "2025-07-11T11:41:10Z"
  },
  {
    "title": "Share of U.S. adults saying immigration is a ‘good thing’ has jumped from 64% to 79% with Trump back in office",
    "description": "Americans' more positive view on immigration is driven primarily by a shift among Republicans and independents.",
    "link": "https://fortune.com/2025/07/11/us-adults-immigration-good-thing-jumped-64-to-79-trump-back-gallup/",
    "timestamp": "2025-07-11T11:40:43Z"
  },
  {
    "title": "Trump to Make 'Major Statement' on Russia Monday",
    "description": "President Donald Trump said he plans to make a “major statement” on Russia on Monday. The US is preparing to send more ...",
    "link": "https://biztoc.com/x/eac0a646e851d057",
    "timestamp": "2025-07-11T11:38:03Z"
  },
  {
    "title": "Iran Says Over 90% of Missiles Hit Targets in Retaliatory Strikes on Israel",
    "description": "TEHRAN (Sputnik) - More than 90% of Iranian missiles hit their targets during Iran's retaliatory strikes against Israel in the final days of the 12-day war, Iranian Parliament Speaker Mohammad Bagher Ghalibaf said.",
    "link": "https://sputnikglobe.com/20250711/iran-says-over-90-of-missiles-hit-targets-in-retaliatory-strikes-on-israel-1122427745.html",
    "timestamp": "2025-07-11T11:37:45Z"
  },
  {
    "title": "Furor Over Los Angeles’s MacArthur Park Illustrates Democrats’ Total Departure From Reality",
    "description": "People who live by the empty deployment of performative symbols have no place to stand to criticize raids in MacArthur Park.",
    "link": "https://thefederalist.com/2025/07/11/furor-over-los-angeless-macarthur-park-illustrates-democrats-total-departure-from-reality/",
    "timestamp": "2025-07-11T11:37:25Z"
  },
  {
    "title": "State Department Is Laying Off Over 1,300 Staffers Under Trump Administration Plan",
    "description": "The cuts have been roundly criticized by current and former diplomats who say they will weaken U.S. influence and its ability to counter threats abroad.",
    "link": "https://www.huffpost.com/entry/us-state-department-cuts_n_6870f5fbe4b09b00d72bf8b7",
    "timestamp": "2025-07-11T11:35:54Z"
  },
  {
    "title": "Did Trump Really Just Break Up with Putin? (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nDid Trump Really Just Break Up with Putin?  —  It's never easy to tell which flip or flop the flip-flopper in the White House means.  —  Donald Trump finally called “bullshit” on Vladimir Putin this week, though nobody seems to …",
    "link": "https://www.memeorandum.com/250711/p10",
    "timestamp": "2025-07-11T11:35:00Z"
  },
  {
    "title": "Trump Set to Survey Aftermath of Devastating Texas Floods",
    "description": "Seven days after the flood waters left devastation in parts of Texas, President Donald Trump and first lady Melania Trump are set to survey the aftermath and meet with first responders and families. It comes as stories of survival and heroism continue to emer…",
    "link": "https://biztoc.com/x/7f5fea2b09276b28",
    "timestamp": "2025-07-11T11:34:18Z"
  },
  {
    "title": "Trump Threatens Canada With 35% Tariffs Amid Trade Talks",
    "description": "President Donald Trump threatens Canada with a 35% tariff, further disrupting the economic relationship with one of the United States’ closest allies and biggest trading partners. He told Meet the Press moderator Kristen Welker that he plans to set a blanket …",
    "link": "https://www.today.com/video/trump-says-he-plans-to-set-15-20-tariff-on-most-countries-243063365747",
    "timestamp": "2025-07-11T11:33:49Z"
  },
  {
    "title": "Trump’s tariff threat to Brazil is a gift to Lula",
    "description": "By attacking Brazil’s sovereignty, Trump may have handed the leftist president a political and diplomatic opportunity.",
    "link": "https://www.aljazeera.com/opinions/2025/7/11/trumps-tariff-threat-to-brazil-is-a-gift-to-lula",
    "timestamp": "2025-07-11T11:31:42Z"
  },
  {
    "title": "The Trump assassination attempt — one year later",
    "description": "It was one year ago Sunday that there was an assassination attempt on Donald Trump near Butler, Pa. Trump at the time was the former president of the United States […]\nThe post The Trump assassination attempt — one year later appeared first on Poynter.",
    "link": "https://www.poynter.org/commentary/2025/trump-assassination-attempt-one-year-later/",
    "timestamp": "2025-07-11T11:30:33Z"
  },
  {
    "title": "IRS to Combine Church and State",
    "description": "The Internal Revenue Service has deemed it legal for tax-exempt places of worship to back political candidates. The Trump Administration pushed for this measure, repealing a 70-year tax code enacted in 1954 by then-Senator Lyndon Johnson known as the “Johnson…",
    "link": "https://freerepublic.com/focus/f-chat/4328053/posts",
    "timestamp": "2025-07-11T11:25:44Z"
  },
  {
    "title": "Russian drones strike Ukraine's 2nd-largest city, damaging a maternity hospital",
    "description": "Officials say a Russian drone barrage has targeted the center of Kharkiv, injuring nine people and damaging a maternity hospital in Ukraine’s second-largest city",
    "link": "https://abcnews.go.com/International/wireStory/russian-drones-strike-ukraines-2nd-largest-city-damaging-123671083",
    "timestamp": "2025-07-11T11:25:10Z"
  },
  {
    "title": "Why Trump blames decisions on others – a psychologist explains",
    "description": "The US president blamed his defense secretary for pausing weapons to Ukraine – but why did he not take responsibility?",
    "link": "https://theconversation.com/why-trump-blames-decisions-on-others-a-psychologist-explains-260877",
    "timestamp": "2025-07-11T11:23:44Z"
  },
  {
    "title": "Putin mouthpiece threatens USA with radioactive tsunami...",
    "description": "PUTIN’S chief propagandist has warned Russia could wipe out both coasts of the US with its Poseidon torpedoes. Vladimir Solovyov said on state TV that launching the nuclear-powered drones \b…",
    "link": "https://www.the-sun.com/news/14679489/putin-mouthpiece-threatens-radioactive-tsunami/",
    "timestamp": "2025-07-11T11:22:37Z"
  },
  {
    "title": "Kristi Noem to be investigated over her FEMA's response to devastating Texas floods? Why Trump aide is facing backlash",
    "description": "President Donald Trump's ally and DHS Secretary Kristi Noem is facing intense criticism over her handling of deadly Texas flood that has killed over 100 people. Initially, Noem said there was a need to eliminate FEMA. Kristi Noem noted that the agency had pro…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-kristi-noem-to-be-investigated-over-her-femas-response-to-devastating-texas-floods-why-trump-aide-is-facing-backlash/articleshow/122387530.cms",
    "timestamp": "2025-07-11T11:21:03Z"
  },
  {
    "title": "Bitcoin flies to new all-time highs, topping $118,000 as institutions pile into ETFs",
    "description": "Bitcoin and ether ETFs saw their second biggest day of inflows ever as investors built on this week's rally and pushed prices to new records overnight.",
    "link": "https://www.cnbc.com/2025/07/11/crypto-market-today.html",
    "timestamp": "2025-07-11T11:19:15Z"
  },
  {
    "title": "ICE, National Guard Raid California Cannabis Nurseries",
    "description": "ICE and National Guard raid California pot farms, detain workers, sparking protests and concerns over deportation policy. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/immigration-trump-ice-green-card-visa-protest-live-updates-2097751",
    "timestamp": "2025-07-11T11:19:10Z"
  },
  {
    "title": "Germany updates: Interior minister downplays coalition spat",
    "description": "Interior Minister Alexander Dobrindt described the postponement of judicial appointments as normal, saying he cannot understand accusations of damage being done to Germany's top court. German Interior Minister Alexander Dobrindt on Saturday described a postpo…",
    "link": "https://www.dw.com/en/germany-updates-interior-minister-downplays-coalition-spat/live-73236265",
    "timestamp": "2025-07-11T11:19:00Z"
  },
  {
    "title": "Gold rate prediction: Gold price rises, bullion experts predict what to expect in next three months",
    "description": "Gold price rose on Friday and analysts have predicted that gold rate will continue to go up.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-rate-prediction-gold-price-rises-bullion-experts-predict-what-to-expect-in-next-three-months/articleshow/122387592.cms",
    "timestamp": "2025-07-11T11:18:46Z"
  },
  {
    "title": "Morning Bid: Canada back in tariff crosshairs",
    "description": "Although markets are trying to shrug off the week's U.S. tariff threats as yet another negotiation tactic, there's growing unease at the daily barrage, the...",
    "link": "https://finance.yahoo.com/news/morning-bid-canada-back-tariff-111828297.html",
    "timestamp": "2025-07-11T11:18:28Z"
  },
  {
    "title": "Trump unleashes more tariff threats and four big U.S. storms in less than a week: Morning Rundown",
    "description": "Donald Trump ramped up the U.S. trade war with Canada and threatened blanket tariffs on other countries.",
    "link": "https://www.nbcnews.com/news/us-news/trump-tariff-threats-us-storms-texas-morning-rundown-rcna218200",
    "timestamp": "2025-07-11T11:17:08Z"
  },
  {
    "title": "Mass layoffs expected today at the State Department",
    "description": "Live updates and the latest news as President Donald Trump and first lady Melania Trump tour the Texas flood devastation and the U.S. prepares to impose blanket tariffs on trading partners.",
    "link": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-texas-floods-tariffs-canada-immigration-doge-live-updates-rcna217076",
    "timestamp": "2025-07-11T11:16:28Z"
  },
  {
    "title": "Three reasons the Fed will stand pat on interest rates",
    "description": "Amidst Trump's calls for lower interest rates, the Federal Reserve is expected to maintain its current monetary policy due to tariff uncertainty, unclear impacts on labor and inflation, and the absence of significant economic restraint. Differing views on tra…",
    "link": "https://economictimes.indiatimes.com/news/international/business/three-reasons-the-fed-will-stand-pat-on-interest-rates/articleshow/122387485.cms",
    "timestamp": "2025-07-11T11:15:51Z"
  },
  {
    "title": "Legal win for birthright citizenship after Supreme Court setback",
    "description": "A federal judge has temporarily blocked President Trump's executive order ending birthright citizenship. The ruling is in response to a lawsuit aimed at getting around a recent Supreme Court ruling limiting nationwide injunctions.",
    "link": "https://www.wlwt.com/article/legal-win-birthright-citizenship-supreme-court-setback/65378904",
    "timestamp": "2025-07-11T11:15:28Z"
  },
  {
    "title": "Golfer Struck by Lightning, Airlifted to Hospital from Iron Man Event",
    "description": "A 28-year-old golfer was struck by lightning during New Jersey's Iron Man tournament, prompting a dramatic rescue and airlift amid a fast-moving storm.",
    "link": "https://www.newsweek.com/sports/golf/golfer-struck-lightning-iron-man-airlifted-hospital-2097621",
    "timestamp": "2025-07-11T11:15:01Z"
  },
  {
    "title": "Former Superman star Dean Cain moans about new Superman film being too ‘woke’",
    "description": "Former Superman actor Dean Cain has hit out at James Gunn, the director of the new Superman movie, after he likened the story to one of an “immigrant” coming to America. Cain, who played Clark Kent and his lycra-clad alter ego Superman in Lois & Clark: The Ne…",
    "link": "https://www.thepinknews.com/2025/07/11/james-gunn-superman-movie-dean-cain-woke/",
    "timestamp": "2025-07-11T11:14:51Z"
  },
  {
    "title": "Singapore stocks notch fifth day of gains; STI up 0.3 per cent",
    "description": "The blue-chip Straits Times Index (STI) closed 0.3 per cent or 12.11 points higher at 4,087.81 on July 11.  Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/singapore-stocks-notch-fifth-day-of-gains-sti-up-0-3-per-cent",
    "timestamp": "2025-07-11T11:13:49Z"
  },
  {
    "title": "Copper’s positive, long-term trajectory unchanged despite fallout from U.S. tariff, Barrick CEO says",
    "description": "Copper miners remain bullish on the metal’s future prospects even as a looming 50 per cent U.S. tariff creates short-term price volatility, Barrick Mining Corp ABX-T CEO Mark Bristow said in Zambia, where the company is expanding its operations.\nU.S. Presiden…",
    "link": "https://biztoc.com/x/f860e4aa6e2ae72e",
    "timestamp": "2025-07-11T11:12:05Z"
  },
  {
    "title": "Trump's $100 million crypto mystery man",
    "description": "A venture calling itself Aqua 1 Foundation and saying it is based in the United Arab Emirates announced in late June it had bought $100 million worth of World Liberty's crypto tokens, becoming the largest publicly known investor in the business. Yet a review …",
    "link": "https://economictimes.indiatimes.com/tech/technology/trumps-100-million-crypto-mystery-man/articleshow/122387494.cms",
    "timestamp": "2025-07-11T11:12:00Z"
  },
  {
    "title": "Trump Set to Survey Aftermath of Devastating Texas Floods",
    "description": "Seven days after the flood waters left devastation in parts of Texas, President Donald Trump and first lady Melania Trump are set to survey the aftermath and meet with first responders and families. It comes as stories of survival and heroism continue to emer…",
    "link": "https://www.today.com/video/trump-set-to-survey-aftermath-of-devastating-texas-floods-243062341825",
    "timestamp": "2025-07-11T11:08:40Z"
  },
  {
    "title": "Trump to visit Texas flood site amid questions about disaster response",
    "description": "Local and federal officials have faced scrutiny over response, including questions over warning about flood",
    "link": "https://www.irishtimes.com/world/us/2025/07/11/trump-to-visit-texas-flood-site-amid-questions-about-disaster-response/",
    "timestamp": "2025-07-11T11:08:25Z"
  },
  {
    "title": "‘Alpha male’ Nick Adams nominated as US ambassador to Malaysia amid controversy",
    "description": "40-year-old Adams is a right-wing commentator who rallied for US President Donald Trump for the 2024 election and faced criticism for reportedly misogynistic remarks.",
    "link": "https://www.channelnewsasia.com/asia/trump-nominee-malaysia-ambassador-alpha-male-nick-adams-5233466",
    "timestamp": "2025-07-11T11:07:44Z"
  },
  {
    "title": "Rupee slips 7 paise to end at 85.77 against US dollar",
    "description": "Rupee weakens against US dollar due to trade tariff uncertainty, global market sentiments, and domestic market weakness.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-slips-7-paise-to-end-at-8577-against-us-dollar/article69800059.ece",
    "timestamp": "2025-07-11T11:03:14Z"
  },
  {
    "title": "NOT A CRAB. Tabs, Fri., July 11, 2025",
    "description": "Morning news roundup and things to read!",
    "link": "https://www.wonkette.com/p/not-a-crab-tabs-fri-july-11-2025",
    "timestamp": "2025-07-11T11:02:42Z"
  },
  {
    "title": "I’m troubled by the CU regents investigation of Wanda James (Letters)",
    "description": "To those who voted for this censorship: I urge you to address the real challenges facing our $7.1B institution and the external threats to our education system with the same energy you directed at James for expressing her truth.",
    "link": "https://www.denverpost.com/2025/07/11/wanda-james-cu-regents-investigation/",
    "timestamp": "2025-07-11T11:01:11Z"
  },
  {
    "title": "Israel is taking its old Gaza model abroad",
    "description": "Israeli troops gather at a point in Mevo Hama, southern Golan Heights, on June 25, 2025.﻿ | Michael Gilad/Middle East Images/AFP via Getty Images \nDuring an Oval Office meeting on Monday, Israeli Prime Minister Benjamin Netanyahu announced that he had nominat…",
    "link": "https://biztoc.com/x/d2e214d5adc3a514",
    "timestamp": "2025-07-11T11:00:39Z"
  },
  {
    "title": "Make America Beautiful Again: Let’s restore our natural legacy from sea to shining sea",
    "description": "A new bipartisan commission aims to restore America's conservation legacy by uniting leaders to protect natural beauty and expand outdoor heritage",
    "link": "https://www.foxnews.com/opinion/make-america-beautiful-again-lets-restore-our-natural-legacy-from-sea-shining-sea",
    "timestamp": "2025-07-11T11:00:08Z"
  },
  {
    "title": "Oil Swings With Focus on Trump’s Plan for Russia, Saudi Output",
    "description": "Oil swung as traders await US President Donald Trump’s announcement on Russia and weigh surging supplies from Saudi Arabia.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-swings-with-focus-on-trumps-plan-for-russia-saudi-output",
    "timestamp": "2025-07-11T11:00:05Z"
  },
  {
    "title": "How 'Hell Bent' Evangelical Theology Fuels America's Cruel Politics | Opinion",
    "description": "Many of my secular friends are confounded. How could Jesus-loving people support a bill so harsh and regressive? \"What exactly is Christian about this?\" they ask.",
    "link": "https://www.newsweek.com/how-hell-bent-evangelical-theology-fuels-americas-cruel-politics-opinion-2096962",
    "timestamp": "2025-07-11T11:00:01Z"
  },
  {
    "title": "‘The Tariffs Are Going to Be the Tariffs’",
    "description": "Consumers are about to start paying for Trump’s chaos.",
    "link": "https://www.theatlantic.com/economy/archive/2025/07/trump-tariffs-trade-war-ongoing/683476/",
    "timestamp": "2025-07-11T11:00:00Z"
  },
  {
    "title": "With expired work permits, couple who fled Haiti leans on Texas church that brought them here",
    "description": "An immigrant couple whose employment authorization recently expired is relying on members of the Texas church that helped them flee Haiti to stay afloat while they fight deportation.",
    "link": "https://www.nbcnews.com/news/nbcblk/expired-work-permits-couple-fled-haiti-leans-texas-church-brought-rcna218027",
    "timestamp": "2025-07-11T11:00:00Z"
  },
  {
    "title": "Tesla’s feckless board needs to rein in Elon Musk before it’s too late",
    "description": "Since the beginning of the year, shares are down around 20%; the S&P is up about 7%,  All of which is putting pressure on Tesla's board to intervene.",
    "link": "https://nypost.com/2025/07/11/business/teslas-feckless-board-needs-to-rein-in-elon-musk-before-its-too-late/",
    "timestamp": "2025-07-11T11:00:00Z"
  },
  {
    "title": "Unpacking rumors of incinerators at 'Alligator Alcatraz' detention center",
    "description": "Karoline Leavitt called the detention center \"an efficient and low-cost way\" to carry out the Trump administration's mass deportation campaign.",
    "link": "https://www.snopes.com//news/2025/07/11/alligator-alcatraz-officials-incinerators/",
    "timestamp": "2025-07-11T11:00:00Z"
  },
  {
    "title": "‘Take a Page Out of Their Playbook:’ How Riley Gaines Suggests the Right Can Beat the Left at Its Own Game",
    "description": "Riley Gaines suggests conservatives can learn a few lessons from the Left. “They continue pushing forward with full steam ahead, heads rearing, teeth gnashing, and... Read More\nThe post ‘Take a Page Out of Their Playbook:’ How Riley Gaines Suggests the Right …",
    "link": "https://www.dailysignal.com/2025/07/11/take-page-their-playbook-how-riley-gaines-suggests-right-can-beat-left-own-game/",
    "timestamp": "2025-07-11T11:00:00Z"
  },
  {
    "title": "'Completely choked': Analyst singles out Trump's stunning and 'revealing moment'",
    "description": "Donald Trump's brittle complaint on Tuesday when reporters pressed his attorney general on a report on alleged pedophile Jeffrey Epstein exposed a chink in his armor that he and his administration have no idea how to handle the blowback, according to a new re…",
    "link": "https://www.rawstory.com/trump-epstein-2673091456/",
    "timestamp": "2025-07-11T10:59:31Z"
  }
]