[
  {
    "title": "Federal Judge Tosses Defamation Lawsuit Against NewsGuard",
    "description": "This week, a federal judge dismissed a lawsuit brought against the U.S. government and an internet watchdog organization. NewsGuard was founded by Gordon",
    "link": "https://reason.com/2025/03/27/federal-judge-tosses-defamation-lawsuit-against-newsguard/",
    "timestamp": "2025-03-27T19:52:39Z"
  },
  {
    "title": "Basic Reforms to New York’s Legal Code Are At Risk as Democrats Lurch Rightward",
    "description": "In 2019, New York made it easier for defendants to learn about information used against them. That could now be revoked.",
    "link": "https://truthout.org/articles/basic-reforms-to-new-yorks-legal-code-are-at-risk-as-democrats-lurch-rightward/",
    "timestamp": "2025-03-27T19:52:16Z"
  },
  {
    "title": "Why is the US bombing Yemen in the first place?",
    "description": "Washington has been convulsed over the past week by the question of how a prominent journalist was invited into a private Signal chat between senior Trump administration officials over an impending military action and why that conversation was happening on Si…",
    "link": "https://www.vox.com/politics/406123/houthis-yemen-trump-bombing",
    "timestamp": "2025-03-27T19:50:46Z"
  },
  {
    "title": "Era of close ties with US 'is over': Canada PM Carney",
    "description": "<p>OTTAWA - The era of deep economic, security and military ties between Canada and the United States \"is over,\" Prime Minister Mark Carney said Thursday, after President Donald Trump announced steep auto tariffs.</p>",
    "link": "https://www.bangkokpost.com/world/2989694/era-of-close-ties-with-us-is-over-canada-pm-carney",
    "timestamp": "2025-03-27T19:50:00Z"
  },
  {
    "title": "Everyone Is Focused On What Trump Is Doing to Columbia University. The Real Consequences Are Starting to Play Out Elsewhere.",
    "description": "Most students go to regional public universities. Here’s why people at mine are so worried.",
    "link": "https://slate.com/life/2025/03/trump-universities-dei-columbia-funding-grants.html",
    "timestamp": "2025-03-27T19:47:48Z"
  },
  {
    "title": "Elise Stefanik Out as Trump's UN Ambassador Nominee—Who Could Replace Her?",
    "description": "President Donald Trump pulled Representative Elise Stefanik's nomination to become United Nations ambassador on Thursday amid concerns about how her confirmation would affect Republicans' slim majority in the House. It is unclear who will replace her.\nNewswee…",
    "link": "https://biztoc.com/x/c881ee5ff88f92e4",
    "timestamp": "2025-03-27T19:47:44Z"
  },
  {
    "title": "Utah Becomes First State To Phase Out Universal Vote-By-Mail",
    "description": "\"Voters, especially those in rural areas, will bear the brunt of this restrictive move,\" one opponent of the law said.",
    "link": "https://www.huffpost.com/entry/utah-mail-in-voting_n_67e58759e4b0455df70b2249",
    "timestamp": "2025-03-27T19:47:35Z"
  },
  {
    "title": "Trump's new auto tariffs will likely drive up car prices by thousands of dollars",
    "description": "President Donald Trump's steep new tariffs on imported cars will likely jack up prices for U.S. buyers of both foreign and locally made vehicles, according to Wall Street analysts.\nTrump on Wednesday said he will slap 25% tariffs on imported passenger vehicle…",
    "link": "https://biztoc.com/x/59d91e34309dbecd",
    "timestamp": "2025-03-27T19:47:35Z"
  },
  {
    "title": "Premier Susan Holt says U.S. auto tariffs will affect New Brunswick businesses",
    "description": "Ontario is the home of Canada’s automobile industry, but a new tariff on auto imports announced by U.S. President Donald Trump would have a spillover effect for businesses in New Brunswick, Premier Susan Holt cautioned Thursday.\nDuring her weekly update on ta…",
    "link": "https://biztoc.com/x/ce79ef2003a12865",
    "timestamp": "2025-03-27T19:47:16Z"
  },
  {
    "title": "Trump is talking about 'compensation' for Jan. 6 rioters",
    "description": "In response to a question about whether he was considering compensation for Jan. 6, 2021, rioters, U.S. President Donald Trump said, \"There's a lot of talk about that […] a lot of people in government really liked that group of people. They were patriots as f…",
    "link": "https://www.snopes.com//fact-check/trump-jan-6-compensation/",
    "timestamp": "2025-03-27T19:47:00Z"
  },
  {
    "title": "Elise Stefanik Out as Trump's UN Ambassador Nominee—Who Could Replace Her?",
    "description": "Trump announced the withdrawal of Stefanik's nomination on Thursday amid concerns about the GOP's slim House majority.",
    "link": "https://www.newsweek.com/elise-stefanik-ambassador-withdrawn-trump-administration-2051708",
    "timestamp": "2025-03-27T19:46:51Z"
  },
  {
    "title": "'Rightfully furious': Critics slam Trump as Social Security cuts hit by delay",
    "description": "Defenders of the Social Security Administration this week welcomed the delay and rollback of some policy changes at the federal agency while also reiterating the threat posed by U.S. President Donald Trump and the billionaire leader of his Department of Gover…",
    "link": "https://www.rawstory.com/rightfully-furious-critics-slam-trump-as-social-security/",
    "timestamp": "2025-03-27T19:46:37Z"
  },
  {
    "title": "SmartBiz Is First Fintech to Become Bank Since Trump Elected",
    "description": "SmartBiz became the first financial-technology firm to receive regulatory approval to be a bank since President Donald Trump took office in January, a regulatory signal that other fintechs could also get the green light to cement their footholds in the financ…",
    "link": "https://www.livemint.com/companies/news/smartbiz-is-first-fintech-to-become-bank-since-trump-elected-11743104751012.html",
    "timestamp": "2025-03-27T19:45:50Z"
  },
  {
    "title": "Robert F. Kennedy Jr. to Slash 10,000 HHS Jobs in MAHA Overhaul",
    "description": "The Department of Health and Human Services (HHS) is slashing 10,000 full-time employees as part of its effort to trim fat and reorient the department around Secretary Robert F. Kennedy Jr.'s \"Make America Health Again\" (MAHA) agenda.\nThe post Robert F. Kenne…",
    "link": "https://www.breitbart.com/pre-viral/2025/03/27/robert-f-kennedy-jr-to-slash-10000-hhs-jobs-in-maha-overhaul/",
    "timestamp": "2025-03-27T19:45:13Z"
  },
  {
    "title": "'Something stinks': Elon Musk, congressional Republicans target Democrats' main fundraising machine (Fredreka Schouten/CNN)",
    "description": "Fredreka Schouten / CNN:\n‘Something stinks’: Elon Musk, congressional Republicans target Democrats' main fundraising machine  —  ActBlue, a fundraising juggernaut for liberal candidates and causes, is facing stepped-up scrutiny and criticism from Republicans …",
    "link": "https://www.memeorandum.com/250327/p102",
    "timestamp": "2025-03-27T19:45:06Z"
  },
  {
    "title": "Greenland ‘agrees to form broad government’ in shadow of Trump pressure",
    "description": "US vice-president JD Vance’s visit to island set to coincide with announcement of new coalition",
    "link": "https://www.irishtimes.com/world/us/2025/03/27/greenland-agrees-to-form-broad-government-in-shadow-of-trump-pressure/",
    "timestamp": "2025-03-27T19:43:07Z"
  },
  {
    "title": "Trump Always Treats His Underlings Right",
    "description": "Trump leaving Elise Stefanik without a UN position or a leadership position in the House is pretty LOL: The White House on Thursday pulled Rep. Elise Stefanik’s nomination to be US ambassador to the United Nations amid concerns over slim margins in the US Hou…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/trump-always-treats-his-underlings-right",
    "timestamp": "2025-03-27T19:42:52Z"
  },
  {
    "title": "Venezuela Gangsters \"Worse Than Al Qaeda\", Says Marco Rubio",
    "description": "US Secretary of State Marco Rubio on Thursday described some  members as being worse than Al Qaeda, while promising to double down on controversial forced deportations.",
    "link": "https://www.ndtv.com/world-news/venezuela-gangsters-worse-than-al-qaeda-says-marco-rubio-8027485",
    "timestamp": "2025-03-27T19:42:44Z"
  },
  {
    "title": "The Senate Wives Club and Carter’s ERA Extension: Four Decades Later, ‘Equality of Rights Under the Law’ Has Yet to Be Guaranteed",
    "description": "This Women’s History Month, we remember President Jimmy Carter’s role in establishing this official observance of women’s achievements, his related support for the Equal Rights Amendment, and some unsung heroes in the Senate Wives Club who were instrumental i…",
    "link": "https://msmagazine.com/2025/03/27/senate-wives-club-jimmy-carter-era-extension/",
    "timestamp": "2025-03-27T19:42:00Z"
  },
  {
    "title": "Congressman: Trump Is Helping U.S. Retake Control of Its Own Tax Policy | Opinion",
    "description": "President Trump and congressional Republicans will do whatever it takes to protect tax sovereignty here in the U.S. and across the globe.",
    "link": "https://www.newsweek.com/congressman-trump-helping-us-retake-control-its-own-tax-policy-opinion-2050945",
    "timestamp": "2025-03-27T19:41:59Z"
  },
  {
    "title": "Trump Says Government Likely Won’t Be Using Signal After The Atlantic Fallout",
    "description": "President Donald Trump said on March 25 that government officials likely will not be using the Signal messaging app after The Atlantic magazine’s editor-in-chief was inadvertently included in a group chat with Secretary of Defense Pete Hegseth and national se…",
    "link": "https://freerepublic.com/focus/f-news/4307133/posts",
    "timestamp": "2025-03-27T19:41:04Z"
  },
  {
    "title": "Canada to Unveil Response to US Tariffs Next Week, Carney Says",
    "description": "Prime Minister Mark Carney says Canada will fight back against President Donald Trump’s trade war and his tariffs on the auto sector, but he did not outline any new retaliatory measures against the US on Thursday.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-to-unveil-response-to-us-tariffs-next-week-carney-says",
    "timestamp": "2025-03-27T19:40:25Z"
  },
  {
    "title": "World Series champion Los Angeles Dodgers say they’ll visit White House on April 7",
    "description": "Manager Dave Roberts called it a huge honor that each World Series champion gets to experience. Roberts said deciding to go to the White House was not a formal conversation he and players had.",
    "link": "https://www.nbcsports.com/mlb/news/world-series-champion-los-angeles-dodgers-say-theyll-visit-white-house-on-april-7",
    "timestamp": "2025-03-27T19:39:13Z"
  },
  {
    "title": "'Americans Are Rightfully Furious': Social Security Defenders Not Falling for Partial Trump Walk-Back",
    "description": "Defenders of the Social Security Administration this week welcomed the delay and rollback of some policy changes at the federal agency while also reiterating the threat posed by U.S. President Donald Trump and the billionaire leader of his Department of Gover…",
    "link": "https://www.commondreams.org/news/my-social-security",
    "timestamp": "2025-03-27T19:36:58Z"
  },
  {
    "title": "Stefanik will rejoin House GOP leadership, Johnson confirms",
    "description": "New York Rep. Elise Stefanik will return to House Republican leadership after President Donald Trump withdrew her nomination to be U.S. ambassador to the United Nations, Speaker Mike Johnson confirmed Thursday. \n“I will invite her to return to the leadership …",
    "link": "https://biztoc.com/x/ade060567ffd0a5c",
    "timestamp": "2025-03-27T19:36:24Z"
  },
  {
    "title": "Pete Hegseth Says the Signal Chat Had 'No Classified Information.' How Is That Possible?",
    "description": "The U.S. has a real problem with overclassification. But the assertion that details about impending air strikes would not be classified strains credulity.",
    "link": "https://reason.com/2025/03/27/pete-hegseth-says-the-signal-chat-had-no-classified-information-how-is-that-possible/",
    "timestamp": "2025-03-27T19:36:06Z"
  },
  {
    "title": "Ireland ‘highly likely’ to face ‘economic turbulence’, Simon Harris says as Donald Trump takes aim at pharma companies next",
    "description": "Tánaiste Simon Harris has said it is \"highly likely\" that Ireland will enter a period of \"economic uncertainty and turbulence\".",
    "link": "https://www.independent.ie/world-news/ireland-highly-likely-to-face-economic-turbulence-simon-harris-says-as-donald-trump-takes-aim-at-pharma-companies-next/a1356588531.html",
    "timestamp": "2025-03-27T19:34:43Z"
  },
  {
    "title": "Trump Administration Issues Visa Update as ICE Detains University Students",
    "description": "A State Department official said 20 people have had their visas revoked and Marco Rubio said the number could be \"more than 300.\"",
    "link": "https://www.newsweek.com/trump-administration-visa-update-ice-detentions-2051679",
    "timestamp": "2025-03-27T19:34:00Z"
  },
  {
    "title": "Putin says US 'serious' about Greenland at Arctic conference",
    "description": "Russian President Vladimir Putin has said US President Donald Trump's plans to take control of Greenland are \"serious.\" He also said Russia will increase troop numbers in the region.",
    "link": "https://www.dw.com/en/putin-says-us-serious-about-greenland-at-arctic-conference/a-72064324",
    "timestamp": "2025-03-27T19:32:00Z"
  },
  {
    "title": "'This is good stuff!' Critics pile on as Elise Stefanik's promotion gets yanked",
    "description": "President Donald Trump officially announced Thursday that he was withdrawing Rep. Elise Stefanik's (R-NY) nomination to the United Nations — and critics chimed in that this is about much more than the House Republicans' razor-thin majority.\nAaron Fritschner, …",
    "link": "https://www.rawstory.com/elise-stefanik-2671616732/",
    "timestamp": "2025-03-27T19:31:50Z"
  },
  {
    "title": "A Reminder Amid Group Chat Outrage: US Strikes on Yemen Are Unconstitutional",
    "description": "The leaked messages among top Trump administration officials about U.S. strikes in Yemen earlier this month, which were held via a private sector messaging app in breach of national security protocol and inadvertently included a journalist, sparked considerab…",
    "link": "https://www.commondreams.org/news/us-strikes-in-yemen",
    "timestamp": "2025-03-27T19:31:49Z"
  },
  {
    "title": "Required Reading",
    "description": "This week: The forgotten Bloomsbury artist, Margo Jefferson’s incisive criticism, Elon Musk’s daughter speaks out, the benefits of thinking about aliens, mental health coffees, and more.",
    "link": "http://hyperallergic.com/999067/required-reading-726/",
    "timestamp": "2025-03-27T19:31:29Z"
  },
  {
    "title": "Forced to Carry a Dying Baby, This Texas Mother of Four Says She Didn’t Think It Could Happen to Her",
    "description": "Samantha Casiano, an east Texas mother of four, tells her story of life and loss:\n\"I found out that my baby daughter had no chance of being able to live outside my womb at my 20-week ultrasound. ... I felt that what happened to us should be everybody’s busine…",
    "link": "https://msmagazine.com/2025/03/27/forced-pregnancy-texas-abortion-ban-samantha-casiano-story/",
    "timestamp": "2025-03-27T19:30:43Z"
  },
  {
    "title": "Chicago mayor fires back at border czar’s ‘reprehensible’ threats to prosecute him over ICE raids",
    "description": "Democratic Chicago Mayor Brandon Johnson ripped border czar Tom Homan after the Trump official threatened to prosecute him if he impeded ICE's efforts to deport illegal immigrants.",
    "link": "https://www.foxnews.com/media/far-left-chicago-mayor-fires-back-border-czars-reprehensible-threats-prosecute-ice-raids",
    "timestamp": "2025-03-27T19:30:05Z"
  },
  {
    "title": "Trump Yanks Hawk Stefanik’s UN Ambassador Nomination",
    "description": "State of the Union: The president cited the narrowness of Republicans’ House majority in the announcement.\nThe post Trump Yanks Hawk Stefanik’s UN Ambassador Nomination appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-yanks-hawk-stefaniks-un-ambassador-nomination/",
    "timestamp": "2025-03-27T19:30:00Z"
  },
  {
    "title": "Democrats’ winning streak is worrying Republicans ahead of key elections next week",
    "description": "Rachel Maddow explains why Republicans are growing concerned ahead of important elections next week after Democrats picked up two major wins in Pennsylvania.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/special-election-democrats-win-republicans-worried-rcna198347",
    "timestamp": "2025-03-27T19:29:34Z"
  },
  {
    "title": "Justice Department Totally Caves to Trump Over War Plans Group Chat",
    "description": "The Trump administration has decided that it will not investigate itself, even though the reckless actions of some of its key officials purportedly endangered the lives of American soldiers.\r\nAttorney General Pam Bondi indicated Thursday that the Justice Depa…",
    "link": "https://newrepublic.com/post/193274/donald-trump-justice-department-group-chat-investigation",
    "timestamp": "2025-03-27T19:29:02Z"
  },
  {
    "title": "#RecessionIndicator: Young Americans are losing confidence in the economy — and it shows online",
    "description": "Gen Z is spotting warnings of an economic slowdown in everything from \"The White Lotus\" to brown clothes: \"The vibes are off.\"",
    "link": "https://www.nbcnews.com/business/economy/young-americans-are-losing-confidence-economy-rcna198451",
    "timestamp": "2025-03-27T19:28:23Z"
  },
  {
    "title": "Trump withdraws Elise Stefanik’s UN Ambassador nomination, cites GOP majority concerns",
    "description": "President Donald Trump has pulled Rep. Elise Stefanik’s nomination for U.S. Ambassador to the United Nations. Citing the tight GOP majority in the House of Representatives, Trump emphasized the need to maintain Stefanik's position in Congress, which is vital …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-withdraws-elise-stefaniks-un-ambassador-nomination-cites-gop-majority-concerns/articleshow/119613265.cms",
    "timestamp": "2025-03-27T19:28:18Z"
  },
  {
    "title": "Defense Appropriators Propose Budget Cuts to F-47 NGAD, CCAs, and B-21 Raider",
    "description": "Defense appropriators have recommended significant cuts to certain aircraft and weapons systems, while increasing funding for others, allowing for greater acquisition than originally planned. As the U.S. government officially announced the award of the contra…",
    "link": "https://theaviationist.com/2025/03/27/defense-appropriators-propose-budget-cuts/",
    "timestamp": "2025-03-27T19:28:17Z"
  },
  {
    "title": "Marco Rubio Fails to Answer Simple Question on Tufts Student’s Arrest",
    "description": "At a press conference Thursday, Secretary of State Marco Rubio refused to give a specific justification for the arrest and detention of Rumeysa Ozturk, a doctoral student at Tufts University in Massachusetts, by masked immigration authorities on Tuesday.\r\n“A …",
    "link": "https://newrepublic.com/post/193269/marco-rubio-tufts-university-student-arrest-rumeysa-ozturk",
    "timestamp": "2025-03-27T19:27:12Z"
  },
  {
    "title": "Why Trump’s 25% tariffs on autos could backfire | Steven Greenhouse",
    "description": "Nearly half of the cars sold in the US are imported and Trump’s 25% tariff will add at least $6,000 to the sticker price of the average car, industry experts say\nAfter two months of flip-flopping on tariffs, imposing them one day and often suspending them the…",
    "link": "https://biztoc.com/x/9dbc384d4fbab29c",
    "timestamp": "2025-03-27T19:25:01Z"
  },
  {
    "title": "National Institutes of Health STILL funding banished DEI agenda",
    "description": "Work includes race-based hiring schemes, 'anti-racist' training and diversity-first faculty pipelines",
    "link": "https://www.wnd.com/2025/03/national-institutes-of-health-still-funding-banished-dei-agenda/",
    "timestamp": "2025-03-27T19:23:54Z"
  },
  {
    "title": "‘We Expect More’: Tom Homan Says Admin Is ‘Reassigning Assets’ To Crackdown On Illegal Migration At Northern Border",
    "description": "Border czar Tom Homan said that President Donald Trump's administration plans on \"reassigning assets\" to crackdown on illegal immigration.",
    "link": "https://dailycaller.com/2025/03/27/tom-homan-illegal-migration-northern-border/",
    "timestamp": "2025-03-27T19:23:46Z"
  },
  {
    "title": "Florida 6th District election: President Trump will join Randy Fine during 'tele-rally'",
    "description": "President Donald Trump will join one of Florida's 6th Congressional District candidates on a phone rally, as his rival meets with Stetson Democrats.",
    "link": "https://www.news-journalonline.com/story/news/politics/elections/2025/03/27/president-trump-to-urge-support-for-florida-6th-candidate-randy-fine/82690365007/",
    "timestamp": "2025-03-27T19:22:54Z"
  },
  {
    "title": "Oklahoma State wrestler Wyatt Hendrickson talks what Trump's appearance at NCAA championships means for sport",
    "description": "Oklahoma State wrestler Wyatt Hendrickson on what President Donald Trump's appearance at the NCAA championships meant for the sport.",
    "link": "https://www.foxnews.com/sports/oklahoma-state-wrestler-wyatt-hendrickson-talks-what-trumps-appearance-ncaa-championships-means-sport",
    "timestamp": "2025-03-27T19:22:30Z"
  },
  {
    "title": "USAGM Reverses Course on RFE/RL and OTF Grant Terminations",
    "description": "A day after RFE/RL won a temporary restraining order against USAGM’s freezing of its funding, the agency has backed off. But it may be, at best, a temporary reprieve.",
    "link": "https://thediplomat.com/2025/03/usagm-reverses-course-on-rfe-rl-and-otf-grant-terminations/",
    "timestamp": "2025-03-27T19:22:00Z"
  },
  {
    "title": "WestJet now powers flight Wi-Fi with Starlink amid Musk controversy",
    "description": "WestJet launched onboard Wi-Fi services powered by Starlink, the satellite internet platform operated by Elon Musk’s SpaceX. Per a Canadian Press (via Financial Post) report, WestJet says 16 of almost 140 plans now offer free, faster Wi-Fi after receiving fed…",
    "link": "https://mobilesyrup.com/2025/03/27/westjet-powers-flight-wi-fi-starlink-musk-controversy/",
    "timestamp": "2025-03-27T19:21:51Z"
  },
  {
    "title": "The shipbuilding industrial base is warning that the US Navy's aircraft carrier delay could be a disaster",
    "description": "Without a start date for CVN 82, the USS William J. Clinton, thousands of supplies are worried their production lines will go cold.",
    "link": "https://www.businessinsider.com/delays-for-us-aircraft-carrier-problem-for-industrial-base-workers-2025-3",
    "timestamp": "2025-03-27T19:19:49Z"
  },
  {
    "title": "Does This Shocking Revelation Prove a Conspiracy in 'Signalgate' Controversy? VIDEO",
    "description": "Something smells fishy about the latest developments in the ongoing 'Signalgate' situation, and it's not just The Atlantic's Jeffrey Goldberg's questionable ethics in lurking in private government communications. A deeper dive into Signal reveals connections …",
    "link": "https://freerepublic.com/focus/f-news/4307125/posts",
    "timestamp": "2025-03-27T19:17:50Z"
  },
  {
    "title": "Colombia and the US agree to collect and share biometric data for migrants",
    "description": "Homeland Security Secretary Kristi Noem touted the memorandum as a step towards cracking down on undocumented migration.",
    "link": "https://www.aljazeera.com/news/2025/3/27/colombia-and-the-us-agree-to-collect-and-share-biometric-data-for-migrants",
    "timestamp": "2025-03-27T19:17:36Z"
  },
  {
    "title": "It Really Sucks to Be Elise Stefanik Right Now",
    "description": "Trump yanked Elise Stefanik’s nomination to be ambassador to the U.N. because Republicans need her measly vote to rubber-stamp his legislative agenda. Right now, it sucks to be this particular ‘rising star.’",
    "link": "http://nymag.com/intelligencer/article/elise-stefanik-nomination-un-pulled.html",
    "timestamp": "2025-03-27T19:16:51Z"
  },
  {
    "title": "Another Ridiculous Kamala Harris Crack Comes Back to Bite Her as Trump Secures Border in First Month in Office! (Video)",
    "description": "Kamala Harris's lighthearted jab at Donald Trump resurfaces, revealing the stark contrast between her rhetoric and the reality of border policy. This incident raises critical questions about her leadership and credibility.\nThe post Another Ridiculous Kamala H…",
    "link": "https://www.thegatewaypundit.com/2025/03/another-ridiculous-kamala-harris-crack-comes-back-bite/",
    "timestamp": "2025-03-27T19:15:24Z"
  },
  {
    "title": "'We can't be left out:' Indigenous leaders want action, inclusion as election heats up",
    "description": "Indigenous leaders are demanding action as Canada's federal election heats up, hoping their peoples' past sacrifices to secure and defend this country aren't forgotten in the trade and affordability focused campaign.",
    "link": "https://www.cbc.ca/news/indigenous/indigenous-leaders-priorities-elxn-1.7495273",
    "timestamp": "2025-03-27T19:13:26Z"
  },
  {
    "title": "GOP lawmaker credits Trump for relieving his constituents on key issue after being 'demonized'",
    "description": "Rep. August Pfluger, R-Texas, said that his constituents are feeling optimistic once again about the future of the oil and gas industry in his district and beyond.",
    "link": "https://www.foxnews.com/politics/gop-lawmaker-credits-trump-relieving-constitutents-key-issue-after-being-demonized",
    "timestamp": "2025-03-27T19:12:43Z"
  },
  {
    "title": "Friday essay: from Watergate to Zippergate to Pussygate – how a shameless Trump has reshaped the US presidential sex scandal",
    "description": "In 1976, America’s white evangelical Christians were shocked a candidate had lust in his heart. In 2024, around 80% of them voted for a serial sexual predator.",
    "link": "https://theconversation.com/friday-essay-from-watergate-to-zippergate-to-pussygate-how-a-shameless-trump-has-reshaped-the-us-presidential-sex-scandal-253019",
    "timestamp": "2025-03-27T19:12:00Z"
  },
  {
    "title": "Left-wing spending fueled ‘explosive growth’ in Education Department",
    "description": "Just as student scores have plunged and children 'have rapidly fallen behind'",
    "link": "https://www.wnd.com/2025/03/left-wing-spending-fueled-explosive-growth-in-education-department/",
    "timestamp": "2025-03-27T19:11:46Z"
  },
  {
    "title": "American Universities Need Wartime Leaders",
    "description": "These next months will be telling. Either American colleges and universities believe in their mission or they don’t. Either they fight for academic freedom or they don’t, writes Ross Barkan.",
    "link": "http://nymag.com/intelligencer/article/how-columbia-failed-the-donald-trump-test.html",
    "timestamp": "2025-03-27T19:10:44Z"
  },
  {
    "title": "A North Carolina president?",
    "description": "If Democrats are looking for a southern moderate candidate in 2028, Donald Trump and Rachel Maddow may have pointed one out.",
    "link": "https://www.ncspin.com/a-north-carolina-president",
    "timestamp": "2025-03-27T19:10:25Z"
  },
  {
    "title": "Resolution to Repeal Overdraft Fee Rule Passes Senate, Awaits House Vote",
    "description": "The U.S. Senate voted Thursday (March 27) to repeal the Consumer Financial Protection Bureau’s final rule capping overdraft fees. By a 52-48 vote, the Senate passed the joint resolution introduced by Senate Banking Committee Chairman Tim Scott of South Caroli…",
    "link": "https://www.pymnts.com/news/regulation/2025/resolution-repeal-overdraft-fee-rule-passes-senate-awaits-house-vote/",
    "timestamp": "2025-03-27T19:08:21Z"
  },
  {
    "title": "How a caretaker government functions in the middle of a trade war",
    "description": "If there’s one thing the former head of Canada’s public service wants Canadians to know right now, it's that their country still has a government. “Whether during prorogation, during dissolution, there’s always a functional government with its powers and its …",
    "link": "https://www.cbc.ca/news/politics/caretaker-convention-parliament-dissolved-1.7495137",
    "timestamp": "2025-03-27T19:08:18Z"
  },
  {
    "title": "John Yoo Predicts ACLU Will ‘Lose’ Fight Against Trump’s Order Requiring Proof Of Citizenship To Vote",
    "description": "John Yoo forecast that the American Civil Liberties Union will be unsuccessful in its challenge against Donald Trump's executive order.",
    "link": "https://dailycaller.com/2025/03/27/john-yoo-predicts-aclu-will-lose-fight-against-trumps-proof-of-citizenship-order/",
    "timestamp": "2025-03-27T19:07:15Z"
  },
  {
    "title": "Ford says Lutnick indicated Canada will see lower automobile tariffs",
    "description": "Ontario Premier Doug Ford said Thursday he was told by U.S. Secretary of Commerce Howard Lutnick this week that Canadian-made vehicles with 50 per cent or more American parts will not face the tariffs set to hit all imports into the United States next week. U…",
    "link": "https://financialpost.com/pmn/ford-says-lutnick-indicated-canada-will-see-lower-automobile-tariffs",
    "timestamp": "2025-03-27T19:06:28Z"
  },
  {
    "title": "With Trump in Office, How Much Will TV Networks Self-Censor?",
    "description": "Mark Hertsgaard\n\n\n\nUS broadcasters’ cowardice around the “Gulf of America” throws into question their future coverage of climate change.\r\n\n\r\n\n\nThe post With Trump in Office, How Much Will TV Networks Self-Censor? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/environment/trump-broadcasters-gulf-of-america/",
    "timestamp": "2025-03-27T19:06:14Z"
  },
  {
    "title": "Trump’s Secret Police Are Now Disappearing Students For Their Op-Eds",
    "description": "For years, we’ve been hearing breathless warnings about a “campus free speech crisis” from self-proclaimed free speech warriors. Their evidence? College students doing what college students have done for generations: protesting speakers they disagree with, ch…",
    "link": "https://www.techdirt.com/2025/03/27/trumps-secret-police-are-now-disappearing-students-for-their-op-eds/",
    "timestamp": "2025-03-27T19:05:45Z"
  },
  {
    "title": "Stocks decline, gold touches record after Trump's latest tariff shot",
    "description": "NEW YORK : Global stocks dipped and gold hit a record high on Thursday in the wake of the latest tariffs from U.S. President Donald Trump's administration that expanded the trade war to auto imports.Trump late on Wednesday announced 25 per cent tariffs on all…",
    "link": "https://www.channelnewsasia.com/business/stocks-decline-gold-touches-record-after-trumps-latest-tariff-shot-5026686",
    "timestamp": "2025-03-27T19:05:30Z"
  },
  {
    "title": "Stocks down, gold hits record after Trump's latest tariff volley",
    "description": "NEW YORK :Global stocks fell for a second straight session and gold hit a record high on Thursday after the latest tariffs from U.S. President Donald Trump's administration that expanded the trade war to autos.Trump on Wednesday announced 25 per cent tariffs …",
    "link": "https://www.channelnewsasia.com/business/stocks-down-gold-hits-record-after-trumps-latest-tariff-volley-5026686",
    "timestamp": "2025-03-27T19:05:30Z"
  },
  {
    "title": "RFK Jr. and Trump Administration Cut 10K Jobs from Federal Health Agencies",
    "description": "Secretary of Health and Human Services Robert F. Kennedy Jr. announced major layoffs to federal health agencies. The plan is to cut around 10,000 jobs in total.",
    "link": "https://people.com/rfk-jr-and-trump-administration-cut-10k-jobs-from-federal-health-agencies-11704483",
    "timestamp": "2025-03-27T19:05:26Z"
  },
  {
    "title": "Sheriff rejects requests to use Las Vegas officers for immigration enforcement",
    "description": "Sheriff Kevin McMahill said Wednesday that he has turned down numerous requests from “various different federal agencies” to use the Metropolitan Police Department for immigration enforcement outside the agency’s limited role at the Clark County jail. “And I …",
    "link": "https://freerepublic.com/focus/f-news/4307121/posts",
    "timestamp": "2025-03-27T19:05:25Z"
  },
  {
    "title": "Usually-Vocal Democrats Suddenly Silent About Palestinian Protests When They’re Against Hamas",
    "description": "Democrats who have a history of speaking out about Hamas' war with Israel are now silent when it comes to the anti-Hamas protests in the Gaza Strip.",
    "link": "https://dailycaller.com/2025/03/27/usually-vocal-democrats-now-silent-about-palestinian-protests/",
    "timestamp": "2025-03-27T19:05:25Z"
  },
  {
    "title": "How Donald Trump Throttled Big Law",
    "description": "The President has two goals: to seek revenge and to intimidate lawyers challenging his agenda. Is a top firm’s deal with him a necessary act of survival or a damaging blow to the entire profession?",
    "link": "https://www.newyorker.com/news/the-lede/how-donald-trump-throttled-big-law",
    "timestamp": "2025-03-27T19:05:09Z"
  },
  {
    "title": "This Is the Land of Wolves Now — Masked agents snatching people off the street. (Jonathan V. Last/The Bulwark)",
    "description": "Jonathan V. Last / The Bulwark:\nThis Is the Land of Wolves Now  —  Masked agents snatching people off the street.  Government officials using caged prisoners for propaganda videos.  We are the villains.  —  1. POWs  —  Two weeks ago Donald Trump invoked the A…",
    "link": "https://www.memeorandum.com/250327/p100",
    "timestamp": "2025-03-27T19:05:00Z"
  },
  {
    "title": "Iran's foreign minister says Tehran sent response to Trump's letter through Oman, IRNA says",
    "description": "Tehran reiterated its stance on not negotiating directly while under pressure, but is open to indirect talks, Araghchi was reported as saying.",
    "link": "https://www.jpost.com/breaking-news/article-847914",
    "timestamp": "2025-03-27T19:04:49Z"
  },
  {
    "title": "US plan to take over Greenland 'serious', says Vladimir Putin",
    "description": "The Russian president says he worries NATO countries could use the Far North as a \"springboard for future conflicts\".",
    "link": "https://www.abc.net.au/news/2025-03-28/trump-serious-greenland-takeover-putin/105106424",
    "timestamp": "2025-03-27T19:04:45Z"
  },
  {
    "title": "85% of Canadian business leaders concerned Canada’s economy could slide into a recession: Léger poll",
    "description": "A rising number of Canadian business leaders fear an recession is looming and as they look elsewhere to offset the impact. Read more.",
    "link": "https://financialpost.com/news/economy/canadian-business-leaders-economy-recession-leger",
    "timestamp": "2025-03-27T19:04:06Z"
  },
  {
    "title": "President Donald Trump Named Himself “Fertilization President,” X Recoils In Disgust",
    "description": "In a recent White House event for Women's History Month, President Donald Trump framed himself as the \"fertilization president.\"",
    "link": "https://hiphopwired.com/playlist/president-donald-trump-fertilization-president-reactions/",
    "timestamp": "2025-03-27T19:03:47Z"
  },
  {
    "title": "Trump's tariffs may cause toilet paper supply to unroll, Bloomberg reports",
    "description": "The U.S. supply of toilet paper may come unspooled. President Donald Trump’s increased tariffs on Canadian softwood lumber could have the unintended effect of disrupting production of the bathroom essential, Bloomberg News reports.Read more...",
    "link": "https://qz.com/trump-tariffs-canada-tp-paper-towels-toilet-pulp-trade-1851772813",
    "timestamp": "2025-03-27T19:03:00Z"
  },
  {
    "title": "Vivian Wilson Hilariously Contradicts Her Dad Elon Musk’s Latest Attack On Her",
    "description": "The tech billionaire’s estranged daughter expertly called out her “pathetic man-child” father.",
    "link": "https://www.huffpost.com/entry/vivian-wilson-hilariously-contradicts-her-dad-elon-musks-latest-attack-on-her_n_67e569c3e4b09441a9cc391d",
    "timestamp": "2025-03-27T19:02:53Z"
  },
  {
    "title": "DOGE cuts have arrived at a federal weather agency. Air travel forecasts and hurricane alerts are at risk",
    "description": "Getty; Rebecca Zisser/BI\nNOAA, the agency that tracks extreme weather, has lost more than 1,000 employees since Donald Trump took office.\nCurrent and former employees worried about less accurate forecasts and aviation issues.\nAgency changes, like stricter rul…",
    "link": "https://biztoc.com/x/08e7440095517bd6",
    "timestamp": "2025-03-27T19:02:24Z"
  },
  {
    "title": "Latest U.S. auto tariffs a recipe for higher prices, layoffs across North America",
    "description": "TORONTO AND OSHAWA, ONT. — The auto industry is sounding the alarm about U.S. President Donald Trump’s latest tariff announcement, which could weigh on companies, raise consumer prices and result in job losses. Trump announced Wednesday he would impose 25 per…",
    "link": "https://financialpost.com/pmn/latest-u-s-auto-tariffs-a-recipe-for-higher-prices-layoffs-across-north-america",
    "timestamp": "2025-03-27T19:02:12Z"
  },
  {
    "title": "Freshman Rep. Brandon Gill Exposes NPR CEO’s Hypocrisy in Explosive Hearing",
    "description": "\"Do you think that white people should pay reparations?\" \"I have never said that, sir.\" \"Yes, you did.\"\nThe post Freshman Rep. Brandon Gill Exposes NPR CEO’s Hypocrisy in Explosive Hearing first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/03/freshman-rep-brandon-gill-exposes-npr-ceos-hypocrisy-in-explosive-hearing/",
    "timestamp": "2025-03-27T19:00:50Z"
  },
  {
    "title": "Macklemore-produced Columbia protest film debuts amid ICE controversy over narrator Mahmoud Khalil",
    "description": "A documentary, produced by Macklemore, about the 2024 Columbia University protests debuts in New York despite narrator Mahmoud Khalil's detainment by ICE officials.",
    "link": "https://www.foxnews.com/media/macklemore-produced-columbia-protest-film-debuts-amid-ice-controversy-over-narrator-mahmoud-khalil",
    "timestamp": "2025-03-27T19:00:39Z"
  },
  {
    "title": "What do we know about Trump's tariffs that are hitting Ireland and the EU next week?",
    "description": "New tariffs are due to come in on 2 April.",
    "link": "https://www.thejournal.ie/what-do-we-know-about-trumps-tariffs-that-are-hitting-ireland-and-the-eu-next-week-6659960-Mar2025/",
    "timestamp": "2025-03-27T19:00:19Z"
  },
  {
    "title": "Arrest made in ‘targeted attack’ on Las Vegas Tesla dealership",
    "description": "Charges include arson, destruction of property, possession of a flammable device",
    "link": "https://www.wnd.com/2025/03/arrest-made-in-targeted-attack-on-las-vegas-tesla-dealership/",
    "timestamp": "2025-03-27T19:00:12Z"
  },
  {
    "title": "Could Supply Small Nuclear Power Plant For Musk's Mars Mission: Russian Envoy",
    "description": "Russia could supply a small nuclear power plant for a mission to Mars planned by billionaire entrepreneur and SpaceX CEO Elon Musk, President Vladimir Putin&#039;s international cooperation envoy said on Thursday.",
    "link": "https://www.ndtv.com/world-news/elon-musk-putin-donald-trump-russia-could-supply-small-nuclear-power-plant-for-musks-mars-mission-putin-envoy-8027302",
    "timestamp": "2025-03-27T18:59:36Z"
  },
  {
    "title": "Man arrested in connection to arson attack on Tesla location in Las Vegas",
    "description": "Police arrested a 36-year -old Las Vegas cinematographer and accused of him throwing Molotov cocktails and opening fire on Teslas earlier this month, officials said Thursday.",
    "link": "https://www.nbcnews.com/news/us-news/man-arrested-connection-arson-attack-tesla-location-las-vegas-rcna198393",
    "timestamp": "2025-03-27T18:58:59Z"
  },
  {
    "title": "Trump withdraws UN envoy pick amid Congress majority fears",
    "description": "President Donald Trump withdrew right-wing firebrand Elise Stefanik as his nominee for US ambassador to the United Nations Thursday, as Republican concerns mount about holding their narrow majority in Congress. The New York congresswoman is just the second Tr…",
    "link": "https://www.digitaljournal.com/world/trump-withdraws-un-envoy-pick-amid-congress-majority-fears/article",
    "timestamp": "2025-03-27T18:57:20Z"
  },
  {
    "title": "Trump Withdraws UN Envoy Pick Amid Congress Majority Fears",
    "description": "President Donald Trump withdrew right-wing firebrand Elise Stefanik as his nominee for US ambassador to the United Nations Thursday, as Republican concerns mount about holding their narrow majority in Congress.",
    "link": "https://www.ibtimes.com/trump-withdraws-un-envoy-pick-amid-congress-majority-fears-3767917",
    "timestamp": "2025-03-27T18:57:09Z"
  },
  {
    "title": "What the federal workforce could look like with AI government employees",
    "description": "Planning will determine how effectively AI agents are incorporated to streamline agency processes and systems, government technology experts argued.",
    "link": "https://www.govexec.com/technology/2025/03/what-federal-workforce-could-look-ai-government-employees/404070/",
    "timestamp": "2025-03-27T18:57:00Z"
  },
  {
    "title": "Furniture Group MillerKnoll to Offset Tariff Impact With Strategic Pricing, Supply Chain Adjustments",
    "description": "The Zeeland, Mich.-based firm whose brand portfolio includes Knoll and Herman Miller said it's taking proactive steps to safeguard profitability amid uncertainty around tariffs and the global supply chain.",
    "link": "http://wwd.com/home-design/furniture/millerknoll-combats-tariff-impact-strategic-pricing-1237064268/",
    "timestamp": "2025-03-27T18:56:43Z"
  },
  {
    "title": "Scene set for tight race to May 3 federal election",
    "description": "Prime Minister Anthony Albanese is expected to meet with the governor-general this morning, marking the official start of a five-week race to the federal election on May 3.",
    "link": "https://www.abc.net.au/news/2025-03-28/federal-election-2025-campaign-may-3/104750332",
    "timestamp": "2025-03-27T18:55:04Z"
  },
  {
    "title": "Rubio says stripped US visas from 300 'lunatics' over university protests against Gaza war",
    "description": "Georgetown, GUYANA: US Secretary of State Marco Rubio said Thursday (Mar 27) he has canceled the visas of more than 300 \"lunatics\" in a growing crackdown against anti-Israel activism on American university campuses. Asked to confirm reports of 300 visas strip…",
    "link": "https://www.channelnewsasia.com/world/rubio-says-stripped-us-visas-300-lunatics-over-university-protests-against-gaza-war-5028791",
    "timestamp": "2025-03-27T18:53:39Z"
  },
  {
    "title": "Who Is Jonah Platt? 5 Things About the Actor & Marc Platt’s Son",
    "description": "In March 2025, Jonah made headlines over his public comment about Rachel Zegler and 'Snow White's box office performance. Learn more about him and his entertainment career here.",
    "link": "https://hollywoodlife.com/feature/who-is-jonah-platt-5376857/",
    "timestamp": "2025-03-27T18:53:28Z"
  },
  {
    "title": "Justice Department eyes combining ATF and DEA as part of broad restructuring",
    "description": "The plan also calls for combining policy offices and eliminating Justice field offices.",
    "link": "https://www.bostonherald.com/2025/03/27/us-justice-department-cuts/",
    "timestamp": "2025-03-27T18:53:12Z"
  },
  {
    "title": "CNN’s Harry Enten Blames ‘Pretty Big Dip’ in Trump’s Approval Rating on Tariffs",
    "description": "CNN's Harry Enten pinned much of the blame for the \"pretty big dip\" in President Donald Trump's approval rating on tariffs.\nThe post CNN’s Harry Enten Blames ‘Pretty Big Dip’ in Trump’s Approval Rating on Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/cnns-harry-enten-blames-pretty-big-dip-in-trumps-approval-rating-on-tariffs/",
    "timestamp": "2025-03-27T18:52:34Z"
  },
  {
    "title": "Trump Withdraws Elise Stefanik's Nomination For UN Envoy",
    "description": "President Donald Trump on Thursday withdrew his nominee for US ambassador to the United Nations, citing concerns about the narrow Republican majority in Congress if Elise Stefanik gives up her place.",
    "link": "https://www.ndtv.com/world-news/donald-trump-withdraws-elise-stefaniks-nomination-for-un-envoy-8027293",
    "timestamp": "2025-03-27T18:52:10Z"
  },
  {
    "title": "Ferrari says it will raise prices by 10% on some models to offset auto tariffs",
    "description": "Ferrari said Thursday it will raise prices by 10% on certain models after April 1 in response to new U.S. auto tariffs, adding up to $50,000 to the price of a typical Ferrari.",
    "link": "https://www.nbcnews.com/business/autos/ferrari-says-will-raise-prices-10-models-offset-auto-tariffs-rcna198426",
    "timestamp": "2025-03-27T18:51:57Z"
  },
  {
    "title": "US To Give $73 Million To Aid Rohingya Refugees: State Department",
    "description": "The Trump administration said on Thursday it will provide $73 million in new financial aid to Rohingya refugees through the UN World Food Programme.",
    "link": "https://www.ndtv.com/world-news/us-to-give-73-million-to-aid-rohingya-refugees-state-department-8027292",
    "timestamp": "2025-03-27T18:51:49Z"
  },
  {
    "title": "Why Gen Z Is Embracing Trump",
    "description": "Last week, progressive data guru David Shor gave the Democratic Party a major wakeup call. In an interview with The New York Times' Ezra Klein, he carefully explained that the Republican Party under President Donald Trump has benefitted from a massive shift o…",
    "link": "https://biztoc.com/x/0fa924d751f02c24",
    "timestamp": "2025-03-27T18:51:39Z"
  }
]