[
  {
    "title": "Donald Trump Calls Conor McGregor His Favorite Irishman",
    "description": "Conor McGregor can be quite the polarizing figure, but he's good in Donald Trump's eyes ... 'cause POTUS just called Notorious one of his favorite Irishmen!! No. 47 gushed over the UFC superstar with Ireland's Prime Minister Micheal Martin at the…\n Permalink",
    "link": "https://www.tmz.com/2025/03/12/conor-mcgregor-donald-trump-favorite-irishman/",
    "timestamp": "2025-03-12T19:27:41Z"
  },
  {
    "title": "The Department of Education Was Slashed in Half. What Does That Mean for Student Loans?",
    "description": "Experts warn borrowers should expect long waits, especially those with questions or disputes over their student loans.",
    "link": "https://www.cnet.com/personal-finance/loans/the-department-of-education-was-slashed-in-half-what-does-that-mean-for-student-loans/",
    "timestamp": "2025-03-12T19:26:00Z"
  },
  {
    "title": "10 celebrities who left the US or are considering moving for political reasons",
    "description": "Celebrities like Ellen DeGeneres, Portia de Rossi, and Rosie O'Donnell are among the stars who have left America and moved elsewhere due to politics.",
    "link": "https://www.businessinsider.com/celebrities-who-left-usa-political-reasons-2025-3",
    "timestamp": "2025-03-12T19:25:58Z"
  },
  {
    "title": "Trump insults Ireland as Irish PM Michael Martin sits just feet away from him. Is there any meeting he can't screw up? [Dumbass]",
    "description": "Trump insults Ireland as Irish PM Michael Martin sits just feet away from him. Is there any meeting he can't screw up?",
    "link": "https://www.fark.com/comments/13594210/Trump-insults-Ireland-as-Irish-PM-Michael-Martin-sits-just-feet-away-from-him-Is-there-any-meeting-he-cant-screw-up",
    "timestamp": "2025-03-12T19:25:33Z"
  },
  {
    "title": "EPA terminates Biden-era climate grants worth $20 billion",
    "description": "The Environmental Protection Agency said it has terminated grant agreements worth $20 billion issued by the Biden administration under a so-called green bank to finance climate-friendly projects.",
    "link": "https://www.wsls.com/news/politics/2025/03/12/epa-terminates-biden-era-climate-grants-worth-20-billion/",
    "timestamp": "2025-03-12T19:24:22Z"
  },
  {
    "title": "4.5 Million Drones Is A Lot Of Drones. It’s Ukraine’s New Production Target For 2025.",
    "description": "The Russian production goal is slightly lower.",
    "link": "https://www.forbes.com/sites/davidaxe/2025/03/12/45-million-drones-is-a-lot-of-drones-its-ukraines-new-production-target-for-2025/",
    "timestamp": "2025-03-12T19:23:28Z"
  },
  {
    "title": "Trump’s steel and aluminum tariffs meet swift retaliation from Canada and the EU",
    "description": "Major trade partners swiftly hit back at President Donald Trump’s increased tariffs on aluminum and steel imports, imposing stiff new taxes on U.S products from textiles and water heaters to beef and bourbon.",
    "link": "https://www.pbs.org/newshour/world/trumps-steel-and-aluminum-tariffs-meet-swift-retaliation-from-canada-and-the-eu",
    "timestamp": "2025-03-12T19:23:26Z"
  },
  {
    "title": "‘American Oligarchs!’ MSNBC’s Stephanie Ruhle Clashes With John Fetterman On Trump Helping Rich Allies",
    "description": "Sen. John Fetterman (D-PA) pushed back as MSNBC's Stephanie Ruhle pressed him to criticize President Donald Trump's relationship to billionaires like Elon Musk.\nThe post ‘American Oligarchs!’ MSNBC’s Stephanie Ruhle Clashes With John Fetterman On Trump Helpin…",
    "link": "https://www.mediaite.com/tv/american-oligarchs-msnbcs-stephanie-ruhle-clashes-with-john-fetterman-on-trump-helping-rich-allies/",
    "timestamp": "2025-03-12T19:23:19Z"
  },
  {
    "title": "Elon Musk’s private companies SpaceX, xAI see values soar since election: report",
    "description": "Artificial intelligence startup xAI has been the biggest driver of these gains, with its share price surging 110% since Nov. 5, according to Caplight.",
    "link": "https://nypost.com/2025/03/12/business/elon-musks-private-companies-xai-spacex-see-values-soar/",
    "timestamp": "2025-03-12T19:22:36Z"
  },
  {
    "title": "EU hits back at tariffs and warns against trade war",
    "description": "For consumers, higher prices loom on supermarket shelves, but for businesses and industry the risks are higher.",
    "link": "https://www.bbc.com/news/articles/cm2y8222ye4o",
    "timestamp": "2025-03-12T19:22:03Z"
  },
  {
    "title": "‘Snow White’ star Gal Gadot urges fans to see movie as controversy spikes: ‘It’s a great film’",
    "description": "Gal Gadot is still supporting the film amid the backlash — and hopes moviegoers will too!",
    "link": "https://nypost.com/2025/03/12/entertainment/gal-gadot-urges-fans-to-see-snow-white-amid-controversy/",
    "timestamp": "2025-03-12T19:21:49Z"
  },
  {
    "title": "International Push for Consumer Boycott of US Grows",
    "description": "With declining consumer interest in Tesla vehicles sending CEO and Trump administration ally Elon Musk into an apparent panic over the electric automaker's plummeting stock—spurring an impromptu car show on the White House lawn Tuesday with President Donald T…",
    "link": "https://www.commondreams.org/news/boycott-trump",
    "timestamp": "2025-03-12T19:21:13Z"
  },
  {
    "title": "Trump Says Top Negotiator Headed To Russia 'Right Now'",
    "description": "US President Donald Trump said Wednesday that his top negotiator was headed to Russia \"right now\" for talks on a possible ceasefire with Ukraine, after Kyiv agreed to a 30-day truce.",
    "link": "https://www.ibtimes.com/trump-says-top-negotiator-headed-russia-right-now-3766076",
    "timestamp": "2025-03-12T19:21:09Z"
  },
  {
    "title": "Ford talks to Carney, premiers ahead of trade meeting in Washington",
    "description": "TORONTO — Ontario Premier Doug Ford and federal Finance Minister Dominic LeBlanc suggested Wednesday they want to come out of a meeting with a top U.S. official with a “coherent plan” for the tariff road ahead. The pair, along with Kirsten Hillman, Canada’s a…",
    "link": "https://financialpost.com/pmn/ford-talks-to-carney-premiers-ahead-of-trade-meeting-in-washington-2",
    "timestamp": "2025-03-12T19:21:05Z"
  },
  {
    "title": "World Bank bureaucrats accused of ‘hypocrisy’ over jet flights to UN climate confab",
    "description": "The Post has obtained leaked photos that show World Bank president Ajay Banga and his team living it up on a private jet.",
    "link": "https://nypost.com/2025/03/12/business/world-bank-bureaucrats-accused-of-hypocrisy-over-jet-flights-to-un-climate-confab/",
    "timestamp": "2025-03-12T19:20:38Z"
  },
  {
    "title": "France’s Growth Outlook Fades as Trump’s Trade War Weighs",
    "description": "France’s economic outlook has deteriorated as the anticipated impact of a global trade war compounds an already slow start to the year, the country’s central bank said.",
    "link": "https://financialpost.com/pmn/business-pmn/frances-growth-outlook-fades-as-trumps-trade-war-weighs",
    "timestamp": "2025-03-12T19:20:33Z"
  },
  {
    "title": "Maxine Waters Urges Democrats To 'Hit the Streets' and 'Fight Back' Against Trump",
    "description": "Rep. Maxine Waters (D., Calif.) is calling on fellow Democrats to \"hit the streets\" to \"influence the courts\" in the party's fight against President Donald Trump.\nThe post Maxine Waters Urges Democrats To 'Hit the Streets' and 'Fight Back' Against Trump appea…",
    "link": "https://freebeacon.com/latest-news/maxine-waters-urges-democrats-to-hit-the-streets-and-fight-back-against-trump/",
    "timestamp": "2025-03-12T19:20:32Z"
  },
  {
    "title": "Is a Ukraine-Russia ceasefire close? Here's what we know",
    "description": "While both countries claim they want peace, there's previously been significant differences between what Kyiv and Moscow have said they'd be prepared to agree to, and there's still plenty that needs to happen before fighting stops.",
    "link": "https://www.abc.net.au/news/2025-03-13/ukraine-ceasefire-deal-with-russia-situation-explained/105044656",
    "timestamp": "2025-03-12T19:20:14Z"
  },
  {
    "title": "SEC postpones ruling on Fidelity Ether ETF options",
    "description": "The US Securities and Exchange Commission has postponed ruling on whether or not to permit Cboe BZX Exchange to list options tied to asset manager Fidelity’s Ether (ETH) exchange-traded fund (ETFs). The agency has given itself until May 14 to approve or disap…",
    "link": "https://cointelegraph.com/news/sec-delays-decision-on-fidelity-eth-etf-options",
    "timestamp": "2025-03-12T19:20:00Z"
  },
  {
    "title": "The tariff lobby: America’s trade hawks fear the gaps in Trump’s tariff wall",
    "description": "America’s trade hawks fear the gaps in Trump’s tariff wall\nEven as markets reel, some firms want the president to get tough on enforcing duties\nAS DONALD TRUMP ramps up tariffs, he is causing turmoil in financial markets. But for a motley group of American ma…",
    "link": "https://biztoc.com/x/9caa2f41922a5bac",
    "timestamp": "2025-03-12T19:19:18Z"
  },
  {
    "title": "U.S. CISA adds six Microsoft Windows flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds six Microsoft Windows flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the following vulnerabilities to its Known Exp…",
    "link": "https://securityaffairs.com/175298/hacking/u-s-cisa-adds-six-microsoft-windows-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-03-12T19:18:15Z"
  },
  {
    "title": "Trump’s Tesla infomercial was meant to be a bailout for Elon Musk. Here’s why it won’t work",
    "description": "A splashy White House event was aimed at boosting the EV maker. It’s more likely to fan the flames of Tesla’s backlash than put out the fire.\n\nShiny golden shoes that retail for $300. Branded bibles. Combat-themed cologne. By now, the sight of Donald Trump sh…",
    "link": "https://www.fastcompany.com/91296319/trump-infomercial-for-tesla-wont-stop-elon-musk-backlash",
    "timestamp": "2025-03-12T19:17:00Z"
  },
  {
    "title": "Elbows up, Canada: Musical responses to Trump’s Canada threats",
    "description": "Pro-Canada songs spreading across social media, including some by Canadian celebrities, reveal a range of reactions to Donald Trump’s tariffs and annexation threats.",
    "link": "https://theconversation.com/elbows-up-canada-musical-responses-to-trumps-canada-threats-251582",
    "timestamp": "2025-03-12T19:16:59Z"
  },
  {
    "title": "'Schumer used to be Jewish, now he's Palestinian,' Trump says in meeting with Irish PM",
    "description": "\"Schumer is a Palestinian as far as I'm concerned. He's become a Palestinian,\" Trump said during his meeting with Irish Prime Minister  Micheál Martin.",
    "link": "https://www.jpost.com/international/article-845801",
    "timestamp": "2025-03-12T19:15:54Z"
  },
  {
    "title": "The Ukrainian Designers Running Fashion Brands During A War",
    "description": "It's been 3 years since Russia invaded Ukraine. With a potential ceasefire looming, read how these Ukrainian designers are running their fashion brands.",
    "link": "https://www.forbes.com/sites/gemmawilliams/2025/03/12/the-ukrainian-designers-running-fashion-brands-during-a-war/",
    "timestamp": "2025-03-12T19:15:12Z"
  },
  {
    "title": "Trade Wars Won't Make American Farming Great Again (Javier Blas/Bloomberg)",
    "description": "Javier Blas / Bloomberg:\nTrade Wars Won't Make American Farming Great Again  —  The US trade war will hurt food exports and increase the agricultural trade deficit.  —  Across the US grain belt, the vast majority voted for President Donald Trump last year, em…",
    "link": "https://www.memeorandum.com/250312/p100",
    "timestamp": "2025-03-12T19:15:03Z"
  },
  {
    "title": "Trump’s EPA to roll back landmark Biden-era environmental regulations",
    "description": "The EPA’s changes will revoke rules on pollution from coal-fired power plants, climate change, and electric vehicles.\n\nIn what he called the “most consequential day of deregulation in American history,” the head of the Environmental Protection Agency announce…",
    "link": "https://www.fastcompany.com/91296814/trumps-epa-rolls-back-major-biden-era-environmental-regulations-climate-change",
    "timestamp": "2025-03-12T19:15:00Z"
  },
  {
    "title": "Republicans Aren’t Taking Up Trump On Buying A Tesla",
    "description": "“I prefer vehicles with internal combustion engines that burn fuels that we have in the United States,\" Sen. Josh Hawley (R-Mo.) said.",
    "link": "https://www.huffpost.com/entry/donald-trump-musk-tesla_n_67d1c9bde4b0668b4e9d4236",
    "timestamp": "2025-03-12T19:14:57Z"
  },
  {
    "title": "Inflation Cools Slightly But Don’t Take A One-Month Change As A Trend",
    "description": "There are many things happening at the moment and the immediate future is uncertain. Worrying won’t help, but some immediate prudence can be useful.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/03/12/inflation-cools-slightly-but-dont-take-a-one-month-change-as-a-trend/",
    "timestamp": "2025-03-12T19:14:21Z"
  },
  {
    "title": "Stephen Moore to Newsmax: 'Rough Sledding' With Tariffs Will Bring 'Freer and Fairer Trade'",
    "description": "Former Trump Senior Economic Adviser Stephen Moore told Newsmax on Wednesday that the United States might be in for \"a little rough sledding\" over the next few weeks, when it comes to President Donald Trump's tariffs, but they will ultimately bring about \"fre…",
    "link": "https://freerepublic.com/focus/f-news/4303826/posts",
    "timestamp": "2025-03-12T19:14:00Z"
  },
  {
    "title": "Big Banks Are Warning About An Economic Slowdown For Good Reason",
    "description": "Bank executives are warning about an economic downturn and have the data and facts to back this up. Everyone should be listening to them.",
    "link": "https://www.forbes.com/sites/mayrarodriguezvalladares/2025/03/12/big-banks-are-warning-about-an-economic-slowdown-for-good-reason/",
    "timestamp": "2025-03-12T19:13:51Z"
  },
  {
    "title": "Musk pushing Social Security to end phone service — forcing seniors to go online for help - NewsBreak",
    "description": "The Social Security Administration may drastically cut back the phone service relied on by 73 million retired and disabled Americans under pressure from El",
    "link": "https://www.newsbreak.com/share/3852814627244-musk-pushing-social-security-to-end-phone-service-forcing-seniors-to-go-online-for-help?s=a2&share_destination_id=MjY4ODQ5OTA4LTE3NDE4MDY3NzU3MTA%3D&pd=0IC48qQn&hl=en_US&send_time=1741806775&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_push_exp_rt_bucketv12-control%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v4%2Cns_local_strategy_25q1_exp-v14",
    "timestamp": "2025-03-12T19:13:41Z"
  },
  {
    "title": "Hundreds rally outside New York court to demand release of Mahmoud Khalil",
    "description": "Columbia University student's lawyers ask judge to order his return to New York from immigration detention in Louisiana.",
    "link": "https://www.aljazeera.com/news/2025/3/12/hundreds-rally-outside-new-york-court-to-demand-release-of-mahmoud-khalil",
    "timestamp": "2025-03-12T19:13:04Z"
  },
  {
    "title": "Tesla's Being Accused of Something Unbelievably Sketchy in Canada",
    "description": "Over 200 Canadian car dealers are crying foul after Elon Musk's Tesla claimed tens of millions of dollars worth of rebates mere days before the government shut down a subsidy program in January. As the Toronto Star reported last week, the dealers are now an e…",
    "link": "https://futurism.com/tesla-sales-numbers-canada",
    "timestamp": "2025-03-12T19:12:17Z"
  },
  {
    "title": "'God used Donald Trump to save me' — ex-Tenn. senator gets pardon 15 days after entering prison",
    "description": "The pardon by Trump came after the top pardon attorney at the DOJ said she had been fired after restoring the gun rights of actor Mel Gibson.",
    "link": "https://www.cnbc.com/2025/03/12/trump-pardon-tennessee-brian-kelsey-prison-campaign-doj.html",
    "timestamp": "2025-03-12T19:12:03Z"
  },
  {
    "title": "'A beautiful thing': Trump brags egg prices have 'come down a lot' — despite them soaring",
    "description": "As President Donald Trump showcased Tesla electric vehicles on the South Lawn of the White House on Tuesday, he faced questions about the timing of what is being called a “car commercial.” With stock markets tumbling—taking retirement accounts with them—and s…",
    "link": "https://www.rawstory.com/a-beautiful-thing-trump-brags-egg-prices/",
    "timestamp": "2025-03-12T19:11:45Z"
  },
  {
    "title": "Amy Coney Barrett’s Week in Liberal Wonderland",
    "description": "The editors are joined by VF legal affairs contributor Cristian Farias to divine why the Supreme Court justice has bucked the MAGA-verse in recent rulings—and unpack the right’s long-standing legal crusade to defang the press.",
    "link": "https://www.vanityfair.com/news/story/amy-coney-barretts-week-in-liberal-wonderland",
    "timestamp": "2025-03-12T19:10:26Z"
  },
  {
    "title": "The Jumbo Envy Fueling Donald Trump’s Rage at Boeing",
    "description": "The president wants a brand-new Air Force One immediately, and he’s called in Elon Musk to make sure Boeing delivers it. All the while, Xi Jinping circles the earth in a larger and sleeker aircraft.",
    "link": "https://www.vanityfair.com/news/story/trump-boeing-elon-musk-air-force-one",
    "timestamp": "2025-03-12T19:09:43Z"
  },
  {
    "title": "Canada's privacy watchdog is investigating Elon Musk's X. Here's what you need to know",
    "description": "In recent weeks, Canadian drivers have been pawning off their Teslas while provincial officials have been rethinking their Starlink contracts, highlighting the deepening Canadian opposition to Elon Musk and his companies over the billionaire’s support of U.S.…",
    "link": "https://biztoc.com/x/f9e10098687af35d",
    "timestamp": "2025-03-12T19:09:40Z"
  },
  {
    "title": "Canada surrenders to Donald Trump’s pressure, reverses electricity tariffs to avoid historic financial price",
    "description": "Canada rescinded its 25% electricity tariff on the US following threats from President Trump. Trump warned of severe financial repercussions and proposed increasing tariffs on Canadian steel and aluminum. The US president also suggested Canada should become t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/canada-surrenders-to-donald-trumps-pressure-reverses-electricity-tariffs-to-avoid-historic-financial-price/articleshow/118947030.cms",
    "timestamp": "2025-03-12T19:09:34Z"
  },
  {
    "title": "South Africa plans to spend more on health and defense after US cuts aid",
    "description": "Lawmakers in South Africa have laid out plans to shore up the budgets for health and defense but also put up value added tax by 0.5%, a move that will raise the cost of living",
    "link": "https://abcnews.go.com/International/wireStory/south-africa-plans-spend-health-defense-after-us-119726240",
    "timestamp": "2025-03-12T19:07:38Z"
  },
  {
    "title": "Tesla Owners Are Desperately Trying to Disguise Their Cars",
    "description": "Tesla owners are 'rebadging' their cars, removing the brand emblem and replacing it with other logos, out of embarrassment over Elon Musk and Trump.",
    "link": "http://www.rollingstone.com/culture/culture-features/tesla-elon-musk-embarassed-disguise-car-1235294522/",
    "timestamp": "2025-03-12T19:07:26Z"
  },
  {
    "title": "South Africa plans to spend more on health and defense after the US cuts aid",
    "description": "Lawmakers in South Africa have laid out plans to shore up the budgets for health and defense but also put up value added tax by 0.5%, a move that will raise the cost of living. South Africa’s health system, which cares for the world’s largest HIV population a…",
    "link": "https://www.seattlepi.com/news/world/article/south-africa-plans-to-spend-more-on-health-and-20217820.php",
    "timestamp": "2025-03-12T19:06:18Z"
  },
  {
    "title": "Donald Trump Shares His Opinion On Conor McGregor, His Tattoos & More",
    "description": "President Donald Trump met with Taoiseach Micheál Martin on Wednesday and somehow, Conor McGregor came up as a topic of conversation. Here's what Trump had to say.",
    "link": "https://www.forbes.com/sites/brianmazique/2025/03/12/donald-trump-shares-his-opinion-on-conor-mcgregor-his-tattoos--more/",
    "timestamp": "2025-03-12T19:06:08Z"
  },
  {
    "title": "Is the U.S. Facing a Debt Crisis?",
    "description": "Trump policies expected to push soaring debt even higher.",
    "link": "http://foreignpolicy.com/2025/03/12/us-budget-deficit-debt-crisis-trump/",
    "timestamp": "2025-03-12T19:06:04Z"
  },
  {
    "title": "Trump vows to take back 'stolen' wealth as tariffs on steel and aluminum imports go into effect",
    "description": "President Donald Trump is openly challenging U.S. allies by increasing tariffs on all steel and aluminum imports to 25% as he vows to take back wealth he says was “stolen” by other countries, drawing quick retaliation from Europe and Canada",
    "link": "https://www.wsbtv.com/news/trump-vows-take-back/K6RVWSCZMND3FCQU6NFWFFWGPE/",
    "timestamp": "2025-03-12T19:04:16Z"
  },
  {
    "title": "US envoy heads to Moscow on Ukraine ceasefire mission: Trump",
    "description": "A US envoy headed for Moscow on Wednesday and President Donald expressed optimism for a 30-day ceasefire in the Ukraine war but officials said the United States wants Russia to agree an unconditional halt to the conflict. The Kremlin said it was awaiting deta…",
    "link": "https://www.digitaljournal.com/world/us-envoy-heads-to-moscow-on-ukraine-ceasefire-mission-trump/article",
    "timestamp": "2025-03-12T19:03:25Z"
  },
  {
    "title": "SEC’s enforcement case against Ripple may be wrapping up",
    "description": "The US Securities and Exchange Commission may be preparing to end its enforcement action against Ripple Labs after more than four years.According to a March 12 X post from Fox Business reporter Eleanor Terrett, the SEC’s case against Ripple was “in the proces…",
    "link": "https://cointelegraph.com/news/sec-enforcement-case-ripple-labs-ending",
    "timestamp": "2025-03-12T19:03:17Z"
  },
  {
    "title": "Maine judges refuse to take Rep Laurel Libby's court case on censure for trans athlete post",
    "description": "All of Maine's federal judges have recused themselves from the case involving Rep. Laurel Libby suing the state's speaker of the house over her recent censure.",
    "link": "https://www.foxnews.com/sports/maine-judges-refuse-take-rep-laurel-libbys-court-case-censure-trans-athlete-post",
    "timestamp": "2025-03-12T19:02:31Z"
  },
  {
    "title": "Really, New York City, You Might Want Andrew Cuomo Back Again?",
    "description": "Ugh, thought we were rid of him!",
    "link": "https://www.wonkette.com/p/really-new-york-city-you-might-want",
    "timestamp": "2025-03-12T19:01:56Z"
  },
  {
    "title": "Mass layoffs at Education Department signal Trump’s plan to gut the agency",
    "description": "The president’s apparent strategy is attempting to eliminate the agency on his own authority, while asking Congress to finish the job, an education expert writes.",
    "link": "https://theconversation.com/mass-layoffs-at-education-department-signal-trumps-plan-to-gut-the-agency-251674",
    "timestamp": "2025-03-12T19:01:31Z"
  },
  {
    "title": "South Africa plans to spend more on health and defense after the US cuts aid",
    "description": "JOHANNESBURG (AP) — Lawmakers in South Africa laid out plans to shore up the budgets for health and defense but also put up value added tax by 0.5%, a move that will raise the cost of living as consumers pay more for goods, including food, and services. An ad…",
    "link": "https://financialpost.com/pmn/south-africa-plans-to-spend-more-on-health-and-defense-after-the-us-cuts-aid",
    "timestamp": "2025-03-12T19:00:40Z"
  },
  {
    "title": "Maybe Trump Wants to Help Ukraine After All",
    "description": "Tuesday’s meeting in Jeddah put Moscow in a tight spot.",
    "link": "https://slate.com/news-and-politics/2025/03/trump-russia-ukraine-news-zelensky-putin.html",
    "timestamp": "2025-03-12T19:00:07Z"
  },
  {
    "title": "Trump Media & Technology Stock Drops 50% Since Inauguration Day",
    "description": "Trump Media & Technology Group Corp. (NASDAQ:DJT) shares have now shed half of their value since the day President Donald Trump returned to the White House. \nWhat To Know: Before the election, Trump Media's stock behaved as a sentiment indicator toward the pr…",
    "link": "https://biztoc.com/x/f7a0fb63735a4487",
    "timestamp": "2025-03-12T19:00:03Z"
  },
  {
    "title": "Government May Still Enter Shutdown Soon: Will You Still Have to Pay Taxes?",
    "description": "A measure to keep the government funded and avert a shutdown has passed in the House, but has only a few days to pass in the Senate and prevent widespread pains for taxpayers.",
    "link": "https://www.cnet.com/personal-finance/taxes/government-may-still-enter-shutdown-soon-will-you-still-have-to-pay-taxes/",
    "timestamp": "2025-03-12T19:00:00Z"
  },
  {
    "title": "Government Could Enter Shutdown Soon: Will You Still Have to Pay Taxes?",
    "description": "A measure to keep the government funded and avert a shutdown has passed in the House, but has only a few days to pass in the Senate and prevent widespread pains for taxpayers.",
    "link": "https://www.cnet.com/personal-finance/taxes/government-could-enter-shutdown-soon-will-you-still-have-to-pay-taxes/",
    "timestamp": "2025-03-12T19:00:00Z"
  },
  {
    "title": "'He was kidding!' Steve Bannon scrambles to protect Trump from Gavin Newsom revelation",
    "description": "MAGA influencer Steve Bannon scrambled to defend President Donald Trump after California Gov. Gavin Newsom (D) revealed how the president dismissed deficit spending in his first term.During an interview on Newsom's podcast this week, Bannon argued that \"both …",
    "link": "https://www.rawstory.com/gavin-newsom-steve-bannon-trump/",
    "timestamp": "2025-03-12T18:59:13Z"
  },
  {
    "title": "Canada's privacy watchdog is investigating Elon Musk's X. Here's what you need to know",
    "description": "Elon Musk is in the middle of another Canadian-led protest as Canada’s privacy commissioner has opened an investigation into X. Read more.",
    "link": "https://financialpost.com/technology/canadas-privacy-watchdog-elon-musks-x-what-need-know",
    "timestamp": "2025-03-12T18:58:27Z"
  },
  {
    "title": "Democrats Can’t Count on Republicans Sabotaging Themselves",
    "description": "While Democrats have long hoped Trump-era Republicans would beat themselves, two key House votes show that even Mike Johnson has the juice to enact Trump’s smash-and-grab agenda, at least for the time being.",
    "link": "http://nymag.com/intelligencer/article/democrats-cant-count-on-republicans-sabotaging-themselves.html",
    "timestamp": "2025-03-12T18:58:25Z"
  },
  {
    "title": "Richest Black Man On Why Folks Shouldn't Be Scared Of Trump's Banning of DEI",
    "description": "In 2024, Smith was named the second richest man in the U.S. after years of holding the no. 1 spot on Forbes’ Richest Black People list. You don’t get to be one of the richest men in the country without learning a thing or two about hiring practices. So in lig…",
    "link": "https://www.theroot.com/richest-black-man-on-why-folks-shouldnt-be-scared-of-tr-1851769416",
    "timestamp": "2025-03-12T18:58:00Z"
  },
  {
    "title": "LCBO denies viral photos of hilarious Wayne Gretzky wine labels in Toronto",
    "description": "Pictures allegedly taken at a downtown Toronto LCBO are going absolutely viral on social media this week in light of how hilarious — and timely, given current events — they are.\r\nA shopper perusing the offerings at the Manulife Centre location of the Crown re…",
    "link": "https://www.blogto.com/eat_drink/2025/03/lcbo-denies-viral-wayne-gretzky-wine-labels-toronto/",
    "timestamp": "2025-03-12T18:56:28Z"
  },
  {
    "title": "EPA Head Says He'll Roll Back Dozens Of Environmental Regulations",
    "description": "In all, Lee Zeldin said he is rolling back 31 environmental rules, including a scientific finding that has long been the central basis for U.S. action against climate change.",
    "link": "https://www.huffpost.com/entry/epa-head-roll-back-dozens-environmental-regulations_n_67d1d70ee4b0668b4e9d4605",
    "timestamp": "2025-03-12T18:55:33Z"
  },
  {
    "title": "Elon Musk fights to save Tesla payday",
    "description": "The world’s richest person is trying to recover the largest pay package ever awarded to a US executive.",
    "link": "https://www.smh.com.au/business/companies/pain-elon-musk-steps-up-fight-to-save-100-billion-tesla-payday-20250313-p5lj6e.html",
    "timestamp": "2025-03-12T18:53:31Z"
  },
  {
    "title": "Canada calls for unity, pushes back on U.S. tariffs as G7 ministers gather in Quebec",
    "description": "Foreign Affairs Minister Mélanie Joly is welcoming her counterparts from some of the world's most powerful countries to Quebec this week as Ottawa works to maintain unity between Washington and its G7 partners and pushes back on U.S. tariffs.",
    "link": "https://www.cbc.ca/news/politics/g7-foreign-ministers-charlevoic-1.7481746",
    "timestamp": "2025-03-12T18:53:26Z"
  },
  {
    "title": "10 things we learned from the Taoiseach's 50-minute tête-à-tête with Donald Trump",
    "description": "Ireland’s housing crisis, big pharma, Conor McGregor and Rosie O’Donnell raised in Oval Office chats with Micheál Martin.",
    "link": "https://www.thejournal.ie/oval-office-trump-taoiseach-6647332-Mar2025/",
    "timestamp": "2025-03-12T18:50:59Z"
  },
  {
    "title": "The World We Owe Gaza",
    "description": "Trump’s aggressive attack on free speech could devastate the movement for Palestine. What’s next for activists?",
    "link": "https://www.yesmagazine.org/political-power/2025/03/12/free-palestine-movement-mahmoud-khalil",
    "timestamp": "2025-03-12T18:50:57Z"
  },
  {
    "title": "Microsoft Patch Tuesday security updates for March 2025 fix six actively exploited zero-days",
    "description": "Microsoft Patch Tuesday security updates for March 2025 address 56 security vulnerabilities in its products, including six actively exploited zero-days. Microsoft Patch Tuesday security updates for March 2025 addressed 56 vulnerabilities in Windows and Window…",
    "link": "https://securityaffairs.com/175289/hacking/microsoft-patch-tuesday-security-updates-for-march-2025.html",
    "timestamp": "2025-03-12T18:50:50Z"
  },
  {
    "title": "US lawmakers welcome Ukraine's agreement to 30-day ceasefire",
    "description": "U.S. lawmakers welcomed Tuesday’s announcement that Ukraine had agreed to a 30-day ceasefire as a step toward peace in Europe.\n“I'm very encouraged the parties have reached an agreement. I think the president now has decided to lift the freeze on intelligence…",
    "link": "https://www.voanews.com/a/us-lawmakers-welcome-ukraine-s-agreement-to-30-day-ceasefire/8008456.html",
    "timestamp": "2025-03-12T18:49:57Z"
  },
  {
    "title": "'Nobody is expelling any Palestinians': Trump",
    "description": "U.S. President Donald Trump said Wednesday that no Palestinians will be expelled from the besieged Gaza Strip even as he continues to pursue his plan to take over the coastal enclave.",
    "link": "https://www.hurriyetdailynews.com/nobody-is-expelling-any-palestinians-trump-206822",
    "timestamp": "2025-03-12T18:49:06Z"
  },
  {
    "title": "HUD Secretary Turner: We Will Do 'Everything We Can' to Rebuild L.A. After Wildfires",
    "description": "Secretary of Housing and Urban Development (HUD) Scott Turner posted a moving video on Tuesday about his visit last week to the Pacific Palisades and Altadena, two communities that were devastated by the recent L.A. fires.\nThe post HUD Secretary Turner: We Wi…",
    "link": "https://www.breitbart.com/politics/2025/03/12/hud-secretary-turner-we-will-do-everything-we-can-to-rebuild-l-a-after-wildfires/",
    "timestamp": "2025-03-12T18:48:45Z"
  },
  {
    "title": "Trump Calls Chuck Schumer a ‘Palestinian’",
    "description": "\"President Donald Trump on Wednesday called Senate Minority Leader Chuck Schumer a 'Palestinian' as he defended the GOP’s government spending bill and his policies on corporate taxes and rising grocery prices,\" Politico reports. Said Trump:",
    "link": "https://politicalwire.com/2025/03/12/trump-calls-chuck-schumer-a-palestinian/",
    "timestamp": "2025-03-12T18:48:44Z"
  },
  {
    "title": "These Afghans trusted the US, but now they say it's handed them 'a death sentence'",
    "description": "Afghans who fled after the Taliban takeover were all set for new lives in the United States until Donald Trump signed an executive order pausing the refugee program, leaving people with approved visas and booked flights dreading a return to Taliban rule.",
    "link": "https://www.abc.net.au/news/2025-03-13/trump-executive-order-death-sentence-say-afghan-refugees/105040856",
    "timestamp": "2025-03-12T18:46:59Z"
  },
  {
    "title": "Anti-Trump Channel Tops YouTube Charts",
    "description": "MeidasTouch, a progressive media network that is highly critical of President Donald Trump, has been named YouTube's most popular news and politics channel over the past three days, just ahead of Fox News. On Sunday, MeidasTouch accumulated more than 9.6 mill…",
    "link": "https://freerepublic.com/focus/f-chat/4303822/posts",
    "timestamp": "2025-03-12T18:45:56Z"
  },
  {
    "title": "Disgraced Sam Bankman-Fried Seeking Pardon From President Trump Amid Republican Rebrand: Report",
    "description": "Imprisoned FTX founder Sam Bankman-Fried is reportedly hoping to secure a pardon from President Donald Trump. The New York Times, citing “six people with knowledge of the matter,” reports that Bankman-Fried has talked to a lawyer affiliated with Trump, reache…",
    "link": "https://dailyhodl.com/2025/03/12/disgraced-sam-bankman-fried-seeking-pardon-from-president-trump-amid-republican-rebrand-report/",
    "timestamp": "2025-03-12T18:45:05Z"
  },
  {
    "title": "Education Department layoffs gut its civil rights office, leaving discrimination cases in limbo",
    "description": "Seven of the civil rights agency’s 12 regional offices were entirely laid off.",
    "link": "https://www.bostonherald.com/2025/03/12/education-civil-rights-office-gutted/",
    "timestamp": "2025-03-12T18:44:45Z"
  },
  {
    "title": "Trump takes an ax to more than a dozen pollution rules in rapid-fire deregulation | CNN",
    "description": "The Trump administration is rolling back several major climate policies, including two rules that target planet-warming pollution from vehicles and power plants, in a major blow to America’s progress on climate action.",
    "link": "https://www.cnn.com/2025/03/12/climate/trump-ev-power-plant-rollbacks/index.html",
    "timestamp": "2025-03-12T18:43:49Z"
  },
  {
    "title": "Musk-led cuts drive US consumer protection agency to ask for Amazon trial delay",
    "description": "The FTC requested a trial delay in its Amazon Prime lawsuit, citing severe resource shortages due to Trump-era cuts. Amazon denies wrongdoing. The judge asked for a written request by Friday.",
    "link": "https://economictimes.indiatimes.com/tech/technology/musk-led-cuts-drive-us-consumer-protection-agency-to-ask-for-amazon-trial-delay/articleshow/118947131.cms",
    "timestamp": "2025-03-12T18:43:46Z"
  },
  {
    "title": "EPA head says he'll roll back dozens of environmental regulations, including rules on climate change",
    "description": "The head of the Environmental Protection Agency has announced a series of actions to roll back landmark environmental regulations, including rules on pollution from coal-fired power plants, climate change and electric vehicles",
    "link": "https://abcnews.go.com/US/wireStory/epa-head-hell-roll-back-dozens-environmental-regulations-119724879",
    "timestamp": "2025-03-12T18:43:39Z"
  },
  {
    "title": "EPA head says he’ll roll back dozens of environmental regulations, including rules on climate change",
    "description": "The environmental regulations include rules on pollution from coal-fired power plants and climate change.",
    "link": "https://www.denverpost.com/2025/03/12/epa-rollback-environmental-regulations/",
    "timestamp": "2025-03-12T18:43:36Z"
  },
  {
    "title": "EPA head says he’ll roll back dozens of environmental regulations, including rules on climate change",
    "description": "The environmental regulations include rules on pollution from coal-fired power plants and climate change.",
    "link": "https://www.bostonherald.com/2025/03/12/epa-rollback-environmental-regulations/",
    "timestamp": "2025-03-12T18:43:36Z"
  },
  {
    "title": "Rosie O'Donnell Leaves The United States",
    "description": "Fans called Rosie 'blessed' and 'one of the lucky ones' because she was able to leave.",
    "link": "https://littlethings.com/entertainment/rosie-odonnell-united-states-ireland-move",
    "timestamp": "2025-03-12T18:43:34Z"
  },
  {
    "title": "Trump vows to take back 'stolen' wealth as tariffs on steel and aluminum imports go into effect",
    "description": "WASHINGTON (AP) — President Donald Trump openly challenged U.S. allies on Wednesday by increasing tariffs on all steel and aluminum imports to 25% as he vowed to take back wealth “stolen” by other countries, drawing quick retaliation from Europe and…",
    "link": "https://www.thesunchronicle.com/news/nation_world/trump-vows-to-take-back-stolen-wealth-as-tariffs-on-steel-and-aluminum-imports-go/article_f1c13636-ff71-11ef-8afb-7ba66b6af15a.html",
    "timestamp": "2025-03-12T18:43:00Z"
  },
  {
    "title": "Albanese invokes 'Team Australia' in pitch to buy local after Trump tariffs",
    "description": "The PM suggests Australians should by local goods instead of American ones ahead of a federal budget expected to have an \"Australian-made\" theme.",
    "link": "https://www.abc.net.au/news/2025-03-13/albanese-urges-buy-australian-after-trump-tariffs/105044144",
    "timestamp": "2025-03-12T18:42:55Z"
  },
  {
    "title": "Trump Hopeful to Get Ceasefire Deal From Russia",
    "description": "President Donald Trump told reporters in the Oval Office Wednesday that he hoped it wouldn't be necessary to pressure Russian ...",
    "link": "https://biztoc.com/x/ff2b3804448342ec",
    "timestamp": "2025-03-12T18:42:49Z"
  },
  {
    "title": "Trouble is brewing for local beer companies as Trump slaps tariffs on aluminum",
    "description": "The math is tight for Thom Cheston.",
    "link": "https://www.nbcnews.com/business/business-news/small-craft-beer-brewers-tariffs-aluminum-rcna196095",
    "timestamp": "2025-03-12T18:42:21Z"
  },
  {
    "title": "Canada Tariffs on US Goods: 2024 and 2025 Compared",
    "description": "Canada on Wednesday announced a set of retaliatory tariffs against the United States, raising economic tensions between the two nations in response to newly imposed U.S. tariffs on Canadian goods.\nThe initial tariffs introduced by President Donald Trump inclu…",
    "link": "https://biztoc.com/x/8c18fbf19e283bc4",
    "timestamp": "2025-03-12T18:40:11Z"
  },
  {
    "title": "Trump Played an Even Bigger Role in the Government Funding Bill Than Lawmakers Knew (Reese Gorman/NOTUS)",
    "description": "Reese Gorman / NOTUS:\nTrump Played an Even Bigger Role in the Government Funding Bill Than Lawmakers Knew  —  “He is the difference maker,” Rep. Eric Burlison said of the president.  “I would never support this language, but I do trust Donald Trump.”  — Copy …",
    "link": "https://www.memeorandum.com/250312/p94",
    "timestamp": "2025-03-12T18:40:00Z"
  },
  {
    "title": "'Corruption in broad daylight': Dems outraged by Trump 'playing car salesman' for Tesla",
    "description": "President Donald Trump took the driver's seat to support Elon Musk on Tuesday following a steep decline in Tesla's stock amid ongoing protests at Tesla showrooms across the country.",
    "link": "https://www.foxnews.com/politics/corruption-broad-daylight-dems-outraged-rump-playing-car-salesman-tesla",
    "timestamp": "2025-03-12T18:39:29Z"
  },
  {
    "title": "EPA head says he’ll roll back dozens of environmental regulations, including rules on climate change",
    "description": "WASHINGTON (AP) — In what he called the “most consequential day of deregulation in American history,” the head of the Environmental Protection Agency announced a series of actions Wednesday to roll back landmark environmental regulations, including rules on p…",
    "link": "https://financialpost.com/pmn/epa-head-says-hell-roll-back-dozens-of-environmental-regulations-including-rules-on-climate-change",
    "timestamp": "2025-03-12T18:38:50Z"
  },
  {
    "title": "Cboe BZX files Solana ETF application on behalf of Franklin Templeton",
    "description": "The Chicago Board Options BZX Exchange (Cboe) has submitted an application on behalf of asset manager Franklin Templeton to list a Solana (SOL) exchange-traded fund (ETF) in the United States.According to the March 12 filing, Franklin Templeton’s proposed ETF…",
    "link": "https://cointelegraph.com/news/cboe-files-solana-etf-application-behalf-franklin-templeton",
    "timestamp": "2025-03-12T18:36:05Z"
  },
  {
    "title": "Ford talks to Carney, premiers ahead of trade meeting in Washington",
    "description": "TORONTO — Ontario Premier Doug Ford and federal Finance Minister Dominic LeBlanc suggested Wednesday they want to come out of a meeting with a top U.S. official with a “coherent plan” for the tariff road ahead. The pair, along with Kirsten Hillman, Canada’s a…",
    "link": "https://financialpost.com/pmn/ford-talks-to-carney-premiers-ahead-of-trade-meeting-in-washington",
    "timestamp": "2025-03-12T18:35:40Z"
  },
  {
    "title": "After PM Modi's Visit, US Vice-President, Top Officials To Be In India",
    "description": "US Vice President JD Vance will visit India this month as well as his two top officials -- National Intelligence Director Tulsi Gabbard and National Security Advisor Mike Waltz.",
    "link": "https://www.ndtv.com/india-news/after-pm-narendra-modis-visit-us-vice-president-jd-vance-tulsi-gabbard-mike-waltz-to-be-in-india-7911073",
    "timestamp": "2025-03-12T18:35:26Z"
  },
  {
    "title": "PEACE DEAL: Can Trump pull it off?",
    "description": "Well, Freepers? Can he get Putin to accept this deal? This is the most IMPORTANT peace deal I can remember in YEARS. Donald Trump is taking a huge risk and can succeed. I believe it!",
    "link": "https://freerepublic.com/focus/f-chat/4303817/posts",
    "timestamp": "2025-03-12T18:34:52Z"
  }
]