[
  {
    "title": "Why aren’t Democrats investigating Biden health officials for dishonesty on COVID-19 vaccine risks? - NewsBreak",
    "description": "Amid the COVID-19 pandemic, Democrats championed themselves as agents of truth. In a world of uncertainty, with information changing by the day, if not mor",
    "link": "https://www.newsbreak.com/share/4020933563389-why-aren-t-democrats-investigating-biden-health-officials-for-dishonesty-on-covid-19-vaccine-risks?s=a2&amp;share_destination_id=MjEwNjI5MjE3LTE3NDgyNDE1MDQ0NDY%3D&amp;pd=0EFmHRyY&amp;hl=en_US&amp;send_time=1748241504&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v5%2Cns_foryou_recall_exp_25q2-v2%2Cns_foryou_blend_exp_25q2-v4",
    "timestamp": "2025-05-26T06:40:48Z"
  },
  {
    "title": "Trump extends deadline for tariffs on goods from Germany to July 9th",
    "description": "US President Donald Trump said Sunday that he would pause his threatened 50 percent tariffs on the European Union until July 9, after a 'very nice call' with EU chief Ursula von der Leyen.",
    "link": "https://www.thelocal.de/20250526/trump-extends-deadline-for-tariffs-on-goods-from-germany-to-july-9th",
    "timestamp": "2025-05-26T06:40:42Z"
  },
  {
    "title": "Trump pauses threatened EU tariffs as new report warns tariffs are biggest threat to Irish economy",
    "description": "On Friday, US President Donald Trump threatened the EU with a 50% tariff from 1 June, casting further uncertainty over the fate of Ireland’s economy.",
    "link": "https://www.thejournal.ie/trump-tariffs-threat-paused-irish-economy-report-6714624-May2025/",
    "timestamp": "2025-05-26T06:37:00Z"
  },
  {
    "title": "Bitcoin Regains $110K After Weekend Sell-Off; ADA, DOGE Lead Uptick in Crypto Majors",
    "description": "Traders eye renewed upside as President Donald Trump delayed a decision on EU tariffs, with sentiment recovering and options positioning turning bullish again.",
    "link": "https://www.coindesk.com/markets/2025/05/26/bitcoin-regains-usd110k-after-weekend-sell-off-ada-doge-lead-uptick-in-crypto-majors",
    "timestamp": "2025-05-26T06:34:40Z"
  },
  {
    "title": "Donald Trump slams 'absolutely crazy' Putin in furious warning following deadly attack on Ukraine",
    "description": "Donald Trump has hit out at Russian leader Vladimir Putin following a massive aerial attack against Ukraine over the weekend, which killed at least 13.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-vladimir-putin-ukraine-attack-319610-20250526",
    "timestamp": "2025-05-26T06:34:14Z"
  },
  {
    "title": "Trump threatens to add formal Apple Tax on top of the 'Apple tax'",
    "description": "But pauses tech-adjacent threat to slap all Euro-imports with 50 percent duties World War Fee  US president Donald Trump has threatened a tariff that would apply only to Apple, and appears to have referred to the European Union’s treatment of American tech co…",
    "link": "https://www.theregister.com/2025/05/26/us_apple_eu_tariffs/",
    "timestamp": "2025-05-26T06:33:09Z"
  },
  {
    "title": "Maduro triumphs in Venezuelan election boycotted by opposition",
    "description": "Governing party celebrates big win as just 42 percent of voters take part in legislative and governors vote.",
    "link": "https://www.aljazeera.com/news/2025/5/26/maduro-triumphs-in-venezuelan-election-boycotted-by-opposition",
    "timestamp": "2025-05-26T06:31:25Z"
  },
  {
    "title": "CNBC Daily Open: Trump's proposed EU tariffs didn't seem to worry investors much",
    "description": "The danger of tariffs is still present, but other risks could cast a longer shadow over markets.",
    "link": "https://www.cnbc.com/2025/05/26/cnbc-daily-open-trumps-eu-tariffs-didnt-seem-to-faze-investors-much.html",
    "timestamp": "2025-05-26T06:30:02Z"
  },
  {
    "title": "Japan Touts Ships Expertise, LNG Project as Tariff Talks Key",
    "description": "Japan may offer financial and technical contributions ranging from investment in an Alaskan LNG pipeline project to shipbuilding expertise as it seeks to smooth the path toward a tariff deal with the US by mid-June.",
    "link": "https://www.rigzone.com/news/wire/japan_touts_ships_expertise_lng_project_as_tariff_talks_key-26-may-2025-180629-article/",
    "timestamp": "2025-05-26T06:30:00Z"
  },
  {
    "title": "Trump calls Putin 'absolutely crazy' after major Russian attack on Ukraine",
    "description": "‘I don’t know what the hell happened to Putin,’ Trump told reporters yesterday following a third day of Russian attacks.",
    "link": "https://www.thejournal.ie/trump-putin-crazy-russia-atttack-ukraine-6714636-May2025/",
    "timestamp": "2025-05-26T06:25:24Z"
  },
  {
    "title": "Trump Says Putin Has ‘Gone Absolutely Crazy’ As He Weighs Sanctions On Russia",
    "description": "Trump also attacked Ukrainian President Volodymyr Zelensky, saying he was doing his country “no favors by talking the way he does.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/05/26/trump-says-putin-has-gone-absolutely-crazy-as-he-weighs-sanctions-on-russia/",
    "timestamp": "2025-05-26T06:20:35Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Monday",
    "description": "Germany's Interior Minister is set to bring forward new migration laws that will limit family reunification and end 'turbo naturalisations', the Finance Minister calls for a 'serious talks' with the US on tariffs and more news on Monday, May 26th.",
    "link": "https://www.thelocal.de/20250526/today-in-germany-a-roundup-of-the-latest-news-on-monday-74",
    "timestamp": "2025-05-26T06:19:29Z"
  },
  {
    "title": "OPEC+ expected to open taps more despite price slump",
    "description": "Despite oil trading low at $60, OPEC+ this week is expected to continue to further open the taps.",
    "link": "https://www.hurriyetdailynews.com/opec-expected-to-open-taps-more-despite-price-slump-209589",
    "timestamp": "2025-05-26T06:19:25Z"
  },
  {
    "title": "King Charles heads to Canada in show of support for realm eyed by Trump",
    "description": "LONDON/OTTAWA (Reuters) -King Charles flies to Canada on Monday for a highly symbolic visit showing support for the nation that recognises him as its sovereign but is coveted by U.S. President Donald Trump as a 51st U.S. state. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/26/king-charles-heads-to-canada-in-show-of-support-for-realm-eyed-by-trump",
    "timestamp": "2025-05-26T06:11:00Z"
  },
  {
    "title": "Trump crypto dinner guest describes ‘worst food’ ever and ‘bullshit’ speech",
    "description": "A TikTok prankster who attended Donald Trump’s dinner for the US president’s top memecoin holders said the three-course meal served was some of the “worst food” he’s eaten and that Trump’s speech at the event was “pretty much like bullshit.”“It was the worst …",
    "link": "https://cointelegraph.com/news/trump-crypto-dinner-guests-say-food-was-worst-ever",
    "timestamp": "2025-05-26T06:09:41Z"
  },
  {
    "title": "Commodity Radar: Gold consolidates amid an upward bias. 5 technical insights before making a trade",
    "description": "Gold prices dipped amid easing US-EU tariff tensions, but technical indicators suggest an upward bias. Key support lies at Rs 95,200 with resistance near Rs 96,700. Analysts advise a buy-on-dips strategy as volatility compresses, awaiting cues from US macro d…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/commodity-radar-gold-consolidates-amid-an-upward-bias-5-technical-insights-before-making-a-trade/articleshow/121405936.cms",
    "timestamp": "2025-05-26T06:08:33Z"
  },
  {
    "title": "Trump State Department staff meet with UK pro-lifers arrested for silent prayer",
    "description": "A delegation from the State Department under President Donald Trump met with pro-life activists who had been arrested for silently praying outside abortion clinics.",
    "link": "https://www.christianpost.com/news/trump-officials-meet-uk-pro-lifers-arrested-for-silent-prayer.html",
    "timestamp": "2025-05-26T06:05:00Z"
  },
  {
    "title": "Trump says Putin ‘has gone absolutely crazy, needlessly killing a lot of people’",
    "description": "US president warns that if Russian leader aims to conquer all of Ukraine, it will ‘lead to the downfall of Russia!’",
    "link": "https://www.irishtimes.com/world/europe/2025/05/26/trump-says-putin-has-gone-absolutely-crazy-needlessly-killing-a-lot-of-people/",
    "timestamp": "2025-05-26T06:04:13Z"
  },
  {
    "title": "Rich Dad Poor Dad Author Can't Believe People Aren’t Buying Bitcoin",
    "description": "Kiyosaki says even 0.01 BTC could make you rich in two years, calling Bitcoin the “easiest” path to wealth.",
    "link": "https://decrypt.co/322058/rich-dad-poor-dad-author-people-buying-bitcoin",
    "timestamp": "2025-05-26T06:03:40Z"
  },
  {
    "title": "U.S.-German citizen is charged with trying to attack the U.S. Embassy in Tel Aviv",
    "description": "A dual U.S.-German citizen has been arrested on charges that he traveled to Israel and attempted to firebomb the branch office of the U.S. Embassy in Tel Aviv, officials said Sunday.",
    "link": "https://www.npr.org/2025/05/26/nx-s1-5412254/joseph-neumeyer-charged-us-embassy-tel-aviv",
    "timestamp": "2025-05-26T06:02:14Z"
  },
  {
    "title": "Trump's tariffs are the biggest threat to Ireland's economy, says forecast report",
    "description": "On Friday, US President Donald Trump threatened the EU with a 50% tariff from 1 June, casting further uncertainty over the fate of Ireland’s economy.",
    "link": "https://www.thejournal.ie/trump-tariffs-threaten-irish-economy-6714624-May2025/",
    "timestamp": "2025-05-26T06:00:56Z"
  },
  {
    "title": "'Duck Dynasty' star Phil Robertson remembered for 'extraordinary legacy' after his death: 'He will be missed'",
    "description": "Tributes poured in on Sunday following the passing of \"Duck Dynasty\" star Phil Robertson at the age of 79, including from his family and politicians.",
    "link": "https://www.foxnews.com/entertainment/duck-dynasty-star-phil-robertson-remembered-extraordinary-legacy-after-his-death-he-missed",
    "timestamp": "2025-05-26T06:00:04Z"
  },
  {
    "title": "DOJ escalates legal battle against illegal immigration with new lawsuit against 4 NJ sanctuary cities",
    "description": "The Department of Justice (DOJ) filed a lawsuit against four New Jersey cities (Newark, Jersey City, Paterson, Hoboken) for obstructing federal immigration enforcement, accusing them of violating the Constitution’s supremacy clause. Acting Assistant AG Yaakov…",
    "link": "https://www.naturalnews.com/2025-05-26-doj-sues-4-new-jersey-sanctuary-cities.html",
    "timestamp": "2025-05-26T06:00:00Z"
  },
  {
    "title": "Elon Musk exits government role, refocuses on Tesla and X after data center failure",
    "description": "Elon Musk has resigned as head of the Department of Government Efficiency (DOGE) to refocus on his private ventures, including X, Tesla, and SpaceX, citing urgent operational challenges. A data center fire at X exposed critical infrastructure failures, prompt…",
    "link": "https://www.naturalnews.com/2025-05-26-musk-exits-government-role-refocuses-tesla-x.html",
    "timestamp": "2025-05-26T06:00:00Z"
  },
  {
    "title": "Trump threatens 50% TARIFF on EU imports â\u0080\u0093 but delays it after talks with Brussels",
    "description": "President Donald Trump proposed a sweeping 50 percent tax on all EU goods starting June 1, accusing the bloc of exploiting the U.S. and flooding markets with cars and agricultural products. The threat follows earlier tariffs (20 percent on EU goods, 25 percen…",
    "link": "https://www.naturalnews.com/2025-05-26-trump-threatens-50-percent-tariffs-eu-imports.html",
    "timestamp": "2025-05-26T06:00:00Z"
  },
  {
    "title": "Fifth round of Washington-Tehran nuclear talks make progress, but report no breakthrough",
    "description": "The fifth round of U.S.-Iran nuclear negotiations in Rome, mediated by Oman, saw “some but not conclusive progress.” Key disagreements persist, particularly over Iran’s demand for domestic uranium enrichment, a red line for the United States. Omani Foreign Mi…",
    "link": "https://www.naturalnews.com/2025-05-26-us-iran-talks-make-progress-no-breakthrough.html",
    "timestamp": "2025-05-26T06:00:00Z"
  },
  {
    "title": "Russia's former president wants to seize a 'buffer zone' in Ukraine. It would take 91 years at Moscow's rate of advance.",
    "description": "Based on current figures, Dmitry Medvedev's proposed buffer zone would need 91 years and 50 million casualties, ISW analysts wrote on Sunday.",
    "link": "https://www.businessinsider.com/russia-buffer-zone-medvedev-century-seize-ukraine-war-2025-5",
    "timestamp": "2025-05-26T05:59:50Z"
  },
  {
    "title": "Tariffs, Schmariffs! An iPhone 17 Price Hike Is Overdue, Regardless of Trump's Threats",
    "description": "US President Donald Trump wants Apple to manufacture the iPhone, its best-selling product, in the US. And on Friday, he threatened to place a 25% tariff on the phone if the company doesn't make that happen.\n\"I have long ago informed Tim Cook of Apple that I e…",
    "link": "https://biztoc.com/x/50c5895b3ab1d0e9",
    "timestamp": "2025-05-26T05:59:05Z"
  },
  {
    "title": "10-Year Yield Tops 4.55% Despite Trump's EU Tariff Delay As Bond Market Signals Fiscal Concerns",
    "description": "The 10-year Treasury yield climbed above 4.55% on Monday as bond markets remained under pressure despite President Donald Trump‘s decision to delay 50% European Union tariffs until July 9.\nWhat Happened: Trump announced Sunday on Truth Social that European Co…",
    "link": "https://biztoc.com/x/4e1c309d60ac2158",
    "timestamp": "2025-05-26T05:58:53Z"
  },
  {
    "title": "Tariff Threat: Trump–EU trade tensions ease, for now",
    "description": "On Friday, President Donald Trump announced plans to impose 50% tariffs on imports from the European Union, warning that the new taxes would take effect on June 1. The move was a response to his growing frustration with the slow pace of trade negotiations bet…",
    "link": "https://m.economictimes.com/markets/stocks/news/tariff-threat-trumpeu-trade-tensions-ease-for-now/initial-threat/slideshow/121406044.cms",
    "timestamp": "2025-05-26T05:58:26Z"
  },
  {
    "title": "‘American jobs come first’: Trump renews tariff threat over Apple’s India plans",
    "description": "Although Apple was initially the focus of Trump’s comments, the president widened the scope of the tariff warning to include other smartphone makers. “It would be anybody that makes that product, otherwise it wouldn't be fair,” he said, naming South Korea’s S…",
    "link": "https://economictimes.indiatimes.com/tech/technology/american-jobs-come-first-trump-throws-cold-water-over-apples-make-in-india-plans/articleshow/121405877.cms",
    "timestamp": "2025-05-26T05:58:15Z"
  },
  {
    "title": "King Charles III to visit Canada in show of Ottawa's sovereignty to Trump",
    "description": "King Charles III's visit to Ottawa, prompted by US President Trump's annexation suggestion, aims to reinforce Canada's sovereignty. Prime Minister Carney invited Charles to deliver the speech from the throne, outlining the government's agenda amidst global tr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/king-charles-iii-to-visit-canada-in-show-of-ottawas-sovereignty-to-trump/articleshow/121405916.cms",
    "timestamp": "2025-05-26T05:57:02Z"
  },
  {
    "title": "The Middle East, US-China, and the quest for a ‘Greater Israel’",
    "description": "Over the last few weeks, much has been made about the supposed split between Netanyahu and Trump.  Like much else about the operation of both regimes, it’s hard to say how much is serious and how much is political theater, but as always, the real decisions ar…",
    "link": "https://www.counterpunch.org/2025/05/26/the-middle-east-us-china-and-the-quest-for-a-greater-israel/",
    "timestamp": "2025-05-26T05:54:08Z"
  },
  {
    "title": "Trump extends deadline for tariffs on EU goods after ‘nice call’ with Von der Leyen",
    "description": "US president has said he wants to use tariffs to encourage companies to build plants in the US rather than overseas",
    "link": "https://www.irishtimes.com/business/2025/05/26/trump-extends-deadline-for-tariffs-on-eu-goods-after-nice-call-with-von-der-leyen/",
    "timestamp": "2025-05-26T05:51:36Z"
  },
  {
    "title": "Trump’s War on Universities Increases the Trade Deficit",
    "description": "Donald Trump seems to have even more trouble staying focused these days than usual. People may recall back to April 2 — which Trump declared as “Liberation Day” — when he imposed massive tariffs that were supposedly going to keep other countries from ripping …",
    "link": "https://www.counterpunch.org/2025/05/26/trumps-war-on-universities-increases-the-trade-deficit/",
    "timestamp": "2025-05-26T05:48:40Z"
  },
  {
    "title": "Gold prices pull back as Trump postpones EU tariffs",
    "description": "Investing.com-- Gold prices fell slightly in Asian trade on Monday, giving back some of last week’s gains after U.S. President Donald Trump over the weekend ...",
    "link": "https://finance.yahoo.com/news/gold-prices-pull-back-trump-054744686.html",
    "timestamp": "2025-05-26T05:47:44Z"
  },
  {
    "title": "Claude 4 prompt",
    "description": "Anthropic publish most of the system prompts for their chat models as part of their release notes. They recently shared the new prompts for both Claude Opus 4 and Claude …",
    "link": "https://simonwillison.net/2025/May/25/claude-4-system-prompt/",
    "timestamp": "2025-05-26T05:47:01Z"
  },
  {
    "title": "Restoring Gold Standard Science",
    "description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United",
    "link": "https://www.whitehouse.gov/presidential-actions/2025/05/restoring-gold-standard-science/",
    "timestamp": "2025-05-26T05:47:01Z"
  },
  {
    "title": "Trump calls Putin “CRAZY”, predicts Russia's downfall due to the Ukraine war",
    "description": "Donald Trump criticised Vladimir Putin after Russia's extensive aerial attack on Ukraine. The attack involved drones and missiles, causing casualties and damage. Trump warned that Putin's ambition could lead to Russia's downfall. He also criticised Volodymyr …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-calls-putin-crazy-predicts-russias-downfall-due-to-the-ukraine-war/articleshow/121405561.cms",
    "timestamp": "2025-05-26T05:42:58Z"
  },
  {
    "title": "Russia, Ukraine swap hundreds of prisoners hours after Moscow launches massive aerial assault",
    "description": "Russia and Ukraine swapped hundreds of prisoners Sunday just hours after Moscow launched one of the largest aerial assaults on Ukraine in the ongoing war.",
    "link": "https://www.foxnews.com/world/russia-ukraine-swap-hundreds-prisoners-hours-after-moscow-launches-massive-aerial-assault",
    "timestamp": "2025-05-26T05:41:42Z"
  },
  {
    "title": "King Charles to open Canada parliament tasked with countering Trump",
    "description": "King Charles III was set to land in Ottawa Monday for a historic visit to open Canada’s parliament, a brief trip seen as part of the pushback against US President Donald Trump’s annexation threats.  The 76-year-old monarch, who is also Canada’s head of state …",
    "link": "https://www.digitaljournal.com/world/king-charles-to-open-canada-parliament-tasked-with-countering-trump/article",
    "timestamp": "2025-05-26T05:37:20Z"
  },
  {
    "title": "Trump says US wants to make tanks, not T-shirts",
    "description": "President Donald Trump said on Sunday his tariff policy was aimed at promoting the domestic manufacturing of tanks and technology products, not sneakers and T-shirts.",
    "link": "https://nypost.com/2025/05/26/business/trump-says-us-wants-to-make-tanks-not-t-shirts/",
    "timestamp": "2025-05-26T05:37:06Z"
  },
  {
    "title": "Trump said to unveil Gaza ceasefire 'within days'",
    "description": "US President Donald Trump is set to declare a ceasefire in Gaza \"within the next few days\" as part of an agreement involving the liberation of Israeli hostages, Sky News Arabia reported on Monday, cit...",
    "link": "https://biztoc.com/x/321e2390c9cf8850",
    "timestamp": "2025-05-26T05:36:58Z"
  },
  {
    "title": "Malaysia's Anwar writes to Trump seeking summit with ASEAN leaders",
    "description": "KUALA LUMPUR -- Malaysian Prime Minister Anwar Ibrahim said on Monday he had written to Donald Trump proposing a meeting between the U.S. President and Southeast Asian leaders in a bid to alleviate the fallout from Washington's sweeping new tariffs.\nAnwar, wh…",
    "link": "https://biztoc.com/x/5ca63fa04cdc9e75",
    "timestamp": "2025-05-26T05:36:52Z"
  },
  {
    "title": "King Charles To Open Canada Parliament Tasked With Countering Trump",
    "description": "King Charles III was set to land in Ottawa Monday for a historic visit to open Canada's parliament, a brief trip seen as part of the pushback against US President Donald Trump's annexation threats.",
    "link": "https://www.ibtimes.com/king-charles-open-canada-parliament-tasked-countering-trump-3774486",
    "timestamp": "2025-05-26T05:36:28Z"
  },
  {
    "title": "Venezuela's Maduro wins landslide in election boycotted by opposition",
    "description": "Venezuelan President Nicolas Maduro's party on Sunday swept the board in parliamentary and regional elections that were boycotted by the opposition in protest over his disputed re-election last year.",
    "link": "https://www.hurriyetdailynews.com/venezuelas-maduro-wins-landslide-in-election-boycotted-by-opposition-209586",
    "timestamp": "2025-05-26T05:29:29Z"
  },
  {
    "title": "The OPEC+ Dilemma: Balancing Production and Market Stability",
    "description": "Despite oil prices hovering around $60 per barrel, OPEC+ is expected to increase production further. This move follows mounting pressure from U.S. President Donald Trump and Saudi Arabia’s efforts to penalize member countries that have violated agreed product…",
    "link": "https://m.economictimes.com/markets/stocks/news/the-opec-dilemma-balancing-production-and-market-stability/oil-prices-drop-yet-taps-open/slideshow/121405840.cms",
    "timestamp": "2025-05-26T05:28:00Z"
  },
  {
    "title": "Have gas prices ‘collapsed’ under Donald Trump? | Fact check",
    "description": "During an interview on NBC’s “Meet the Press,” moderator Kristen Welker asked Treasury Secretary Scott Bessent about the possibility of retailers such as Walmart raising prices because of the Trump administration’s tariffs.\nBessent on May 18 recalled a recent…",
    "link": "https://biztoc.com/x/4faaa1306486797a",
    "timestamp": "2025-05-26T05:26:11Z"
  },
  {
    "title": "Trump extends EU tariff deadline until July 9",
    "description": "U.S. President Donald Trump said Sunday that he would pause his threatened 50 percent tariffs on the European Union until July 9, after a \"very nice call\" with EU chief Ursula von der Leyen.",
    "link": "https://www.hurriyetdailynews.com/trump-extends-eu-tariff-deadline-until-july-9-209585",
    "timestamp": "2025-05-26T05:26:00Z"
  },
  {
    "title": "Trump slams 'crazy' Putin as Russia pummels Ukraine with massive drone attack",
    "description": "WASHINGTON: US President Donald Trump called his Russian counterpart Vladimir Putin \"crazy\" on Sunday (May 25) after Moscow launched a deadly barrage of drones against Ukraine, even as the warring countries",
    "link": "https://www.channelnewsasia.com/world/ukraine-invasion-trump-crazy-putin-russia-drone-attack-5153226",
    "timestamp": "2025-05-26T05:25:49Z"
  },
  {
    "title": "AIB to sell off more bad loans",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/05/26/aib-to-sell-off-more-bad-loans-and-the-us-ai-group-that-moved-to-ireland/",
    "timestamp": "2025-05-26T05:23:53Z"
  },
  {
    "title": "Israel strike on school-turned-shelter kills dozens in Gaza",
    "description": "Rescuers said at least 20 people were killed, mostly children, and more than 60 wounded in an Israeli strike on a school sheltering displaced people in Gaza City on Monday.",
    "link": "https://www.hurriyetdailynews.com/israel-strike-on-school-turned-shelter-kills-dozens-in-gaza-209584",
    "timestamp": "2025-05-26T05:23:30Z"
  },
  {
    "title": "Venezuela's Nicolas Maduro wins landslide in election boycotted by opposition",
    "description": "Nicolas Maduro's party dominated Venezuelan elections amid an opposition boycott protesting his disputed re-election. The ruling party secured a majority of governorships and a significant percentage of National Assembly votes, while turnout was notably low.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/venezuelas-nicolas-maduro-wins-landslide-in-election-boycotted-by-opposition/articleshow/121405222.cms",
    "timestamp": "2025-05-26T05:22:06Z"
  },
  {
    "title": "Trump expected to announce Gaza ceasefire deal tied to hostage release",
    "description": "US President Donald Trump expected to announce Gaza ceasefire within days as part of a deal to release Israeli hostages and return of bodies, reports say.",
    "link": "https://www.israelnationalnews.com/news/408969",
    "timestamp": "2025-05-26T05:21:32Z"
  },
  {
    "title": "Donald Trump says Vladimir Putin ‘has gone absolutely crazy’ after Russia launches largest aerial attack on Ukraine",
    "description": "US president Donald Trump made it clear he is losing patience with Vladimir Putin, levelling some of his sharpest criticism at the Russian leader as Moscow pounded Kyiv and other Ukrainian cities with drones and missiles for a third-straight night.",
    "link": "https://www.independent.ie/world-news/europe/donald-trump-says-vladimir-putin-has-gone-absolutely-crazy-after-russia-launches-largest-aerial-attack-on-ukraine/a1191701583.html",
    "timestamp": "2025-05-26T05:20:32Z"
  },
  {
    "title": "Trump slams 'crazy' Putin as Russia pummels Ukraine with massive drone attack",
    "description": "U.S. President Donald Trump called his Russian counterpart Vladimir Putin \"crazy\" on Sunday after Moscow launched a deadly barrage of drones against Ukraine, even as the warring countries completed a large-scale prisoner exchange.",
    "link": "https://www.hurriyetdailynews.com/trump-slams-crazy-putin-as-russia-pummels-ukraine-with-massive-drone-attack-209583",
    "timestamp": "2025-05-26T05:18:59Z"
  },
  {
    "title": "ASEAN nations decry Trump tariffs at summit and seek to diversify trade",
    "description": "Malaysian Prime Minister Anwar Ibrahim opened talks by saying that he had written to President Donald Trump seeking a U.S.-ASEAN meeting on the topic.",
    "link": "https://www.japantimes.co.jp/news/2025/05/26/asia-pacific/politics/asean-summit-trade-tariffs/",
    "timestamp": "2025-05-26T05:16:00Z"
  },
  {
    "title": "US, Türkiye, Gulf, Europe 'shoulder-to-shoulder' with Syria: US envoy",
    "description": "The U.S. Ambassador to Türkiye and Special Envoy for Syria, Tom Barrack, said on Sunday that America stands with partners in supporting Syrian reconstruction.",
    "link": "https://www.hurriyetdailynews.com/us-turkiye-gulf-europe-shoulder-to-shoulder-with-syria-us-envoy-209582",
    "timestamp": "2025-05-26T05:14:18Z"
  },
  {
    "title": "Oil edges up after Trump extends EU trade talks deadline to July",
    "description": "BEIJING :Oil prices recorded limited gains on Monday after U.S. President Donald Trump extended a deadline for trade talks with the European Union, easing concerns about U.S. tariffs on the bloc that could hurt the global economy.Brent crude futures rose 18 c…",
    "link": "https://www.channelnewsasia.com/business/oil-edges-up-after-trump-extends-eu-trade-talks-deadline-july-5152891",
    "timestamp": "2025-05-26T05:06:09Z"
  },
  {
    "title": "Oil climbs after Trump extends EU trade talks deadline to July",
    "description": "BEIJING :Oil prices gained on Monday after U.S. President Donald Trump extended a deadline for trade talks with the European Union, easing concerns about U.S. tariffs on the bloc that could hurt the global economy and fuel demand.Brent crude futures rose 26 c…",
    "link": "https://www.channelnewsasia.com/business/oil-climbs-after-trump-extends-eu-trade-talks-deadline-july-5152891",
    "timestamp": "2025-05-26T05:06:09Z"
  },
  {
    "title": "Businesses are finding a workaround for tariffs — and it's entirely legal",
    "description": "The \"first sale rule\" is a concept in U.S. customs law that allows importers to use the lowest cost of a good to calculate duties.",
    "link": "https://www.cnbc.com/2025/05/26/businesses-are-finding-a-tariff-workaround-the-first-sale-rule.html",
    "timestamp": "2025-05-26T05:04:41Z"
  },
  {
    "title": "Chinese tech giants reveal how they're dealing with U.S. chip curbs to stay in the AI race",
    "description": "Tencent and Baidu said stockpiling chips, optimizing AI models and using home-grown semiconductors have helped them progress with the tech.",
    "link": "https://www.cnbc.com/2025/05/26/tencent-baidu-reveal-how-theyre-dealing-with-us-ai-chip-curbs.html",
    "timestamp": "2025-05-26T05:03:53Z"
  },
  {
    "title": "Steady in the Storm: Jerome Powell’s message on leadership and policy",
    "description": "Jerome Powell returned to his alma mater, Princeton University, to deliver a heartfelt speech 50 years after his graduation. He spoke during the university’s baccalaureate service, addressing students and faculty at a time of continued scrutiny of the Federal…",
    "link": "https://m.economictimes.com/markets/stocks/news/steady-in-the-storm-jerome-powells-message-on-leadership-and-policy/setting-the-stage/slideshow/121405151.cms",
    "timestamp": "2025-05-26T05:03:26Z"
  },
  {
    "title": "Schloss Bangalore (Leela Hotels), Aegis Vopak Terminals, Prostarm Info Systems, ASTONEA LABS IPO Live Today: Aegis Vopak booked 26% & Schloss Bangalore 6% on Day 1, Prostarm Info Systems & ASTONEA LABS open for public subscription today",
    "description": "IPO News Live Today, Schloss Bangalore IPO/ Leela Hotels IPO, Aegis Vopak Terminals IPO, Prostarm Info Systems IPO, ASTONEA LABS IPO GMP Live Updates Today: Key highlights | Track live updates on four IPOs here  Brookfield Asset Management-backed Schloss Bang…",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/leela-palaces-hotels-ipo-schloss-bangalore-ipo-aegis-vopak-terminals-ipo-prostarm-info-systems-ipo-astonea-labs-ipo-live-updates/article69619990.ece",
    "timestamp": "2025-05-26T05:01:19Z"
  },
  {
    "title": "Turkish Guns Are Taking Over the U.S. Market",
    "description": "They’re cheap, popular, and spreading beyond borders.",
    "link": "http://foreignpolicy.com/2025/05/26/turkey-gun-firearms-united-states-import-export-sales-canik-sys/",
    "timestamp": "2025-05-26T05:00:50Z"
  },
  {
    "title": "Venezuela's Maduro Wins Landslide In Election Boycotted By Opposition",
    "description": "Venezuelan President Nicolas Maduro's party on Sunday swept the board in parliamentary and regional elections that were boycotted by the opposition in protest over his disputed re-election last year.",
    "link": "https://www.ibtimes.com.au/venezuelas-maduro-wins-landslide-election-boycotted-opposition-1859073",
    "timestamp": "2025-05-26T04:57:18Z"
  },
  {
    "title": "European stock markets set to rebound as Trump delays 50% tariffs on the EU to 9 July",
    "description": "Stock futures surged after US President Donald Trump agreed to postpone the planned 50% tariffs on the European Union, but the US dollar remained under pressure amid waning investor confidence in US assets, pushing the euro to a one-month high.",
    "link": "https://biztoc.com/x/94143a47da4242c9",
    "timestamp": "2025-05-26T04:52:34Z"
  },
  {
    "title": "Crude oil futures gain as Trump delays EU tariff deadline",
    "description": "August Brent oil futures were at $64.44, up by 0.36%, and July crude oil futures on WTI were at $61.79, up by 0.42%",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-gain-as-trump-delays-eu-tariff-deadline/article69619921.ece",
    "timestamp": "2025-05-26T04:50:30Z"
  },
  {
    "title": "OPEC+ expected to open taps more despite price slump",
    "description": "LONDON - Despite oil trading low at $60, OPEC+ this week is expected to continue to further open the taps.",
    "link": "https://www.bangkokpost.com/business/general/3034597/opec-expected-to-open-taps-more-despite-price-slump",
    "timestamp": "2025-05-26T04:45:00Z"
  },
  {
    "title": "Southeast Asian nations want to discuss tariffs with Trump as a unified bloc, Malaysia PM says",
    "description": "Malaysian Prime Minister Anwar Ibrahim says Southeast Asian nations will forge a common front to face challenges including economic headwinds from U.S. tariffs and the four-year deadly civil war in Myanmar",
    "link": "https://abcnews.go.com/Business/wireStory/southeast-asian-nations-discuss-tariffs-trump-unified-bloc-122187745",
    "timestamp": "2025-05-26T04:38:26Z"
  },
  {
    "title": "Trump lashes out at ‘crazy’ Putin after deadly Russian air raids on Ukraine",
    "description": "US president also hints of possible new sanctions after Russia launches its largest aerial attack on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/26/trump-lashes-out-at-crazy-putin-after-deadly-russian-air-raids-on-ukraine",
    "timestamp": "2025-05-26T04:31:23Z"
  },
  {
    "title": "King Charles III visit to Canada underscores Canada's sovereignty to Trump",
    "description": "King Charles III arrives in Ottawa on Monday to underscore Canada’s sovereignty to U.S. President Donald Trump",
    "link": "https://abcnews.go.com/Entertainment/wireStory/king-charles-iii-visit-canada-underscores-canadas-sovereignty-122187743",
    "timestamp": "2025-05-26T04:30:24Z"
  },
  {
    "title": "Russia launches largest airstrike of war on Ukraine, killing at least 12",
    "description": "In the war’s biggest air assault yet, Russia launched 367 drones and missiles on Ukrainian cities overnight, killing at least 12, as Trump declared: Putin “has gone absolutely CRAZY!\"",
    "link": "https://www.euractiv.com/section/politics/news/russia-launches-largest-airstrike-of-war-on-ukraine-killing-at-least-12/",
    "timestamp": "2025-05-26T04:28:13Z"
  },
  {
    "title": "Russia launches largest airstrike of war on Ukraine, killing at least 12",
    "description": "In the war’s biggest air assault yet, Russia launched 367 drones and missiles on Ukrainian cities overnight, killing at least 12, as Trump declared: Putin “has gone absolutely CRAZY!\"",
    "link": "https://www.euractiv.com/section/global-europe/news/russia-launches-largest-airstrike-of-war-on-ukraine-killing-at-least-12/",
    "timestamp": "2025-05-26T04:28:13Z"
  },
  {
    "title": "OPEC+ expected to open taps more despite price slump",
    "description": "OPEC+ may increase oil production despite low prices. This follows pressure from US President Donald Trump. Saudi Arabia aims to penalize quota violators. The 'V8' nations might raise output significantly. This could further depress prices. Internal disagreem…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/opec-expected-to-open-taps-more-despite-price-slump/articleshow/121404115.cms",
    "timestamp": "2025-05-26T04:25:13Z"
  },
  {
    "title": "Cathie Wood Calls Trump Policy 'Reaganomics On Steroids' As Treasury Secretary Says US Can Grow Its Way Out Of Debt",
    "description": "ARK Invest founder Cathie Wood endorsed the President Donald Trump administration’s economic policies Sunday, comparing them to “Reaganomics on steroids” as Treasury Secretary Scott Bessent defended the government’s ability to outgrow mounting debt obligation…",
    "link": "https://biztoc.com/x/af5f93988c48c279",
    "timestamp": "2025-05-26T04:19:13Z"
  },
  {
    "title": "Southeast Asian nations want to discuss tariffs with Trump as a unified bloc, Malaysia PM says",
    "description": "KUALA LUMPUR, Malaysia (AP) — Southeast Asian nations will forge a common front to face challenges including economic headwinds from U.S. tariffs and a four-year civil war in Myanmar, Malaysian Prime Minister Anwar Ibrahim said Monday. Opening an annual summi…",
    "link": "https://financialpost.com/pmn/southeast-asian-nations-want-to-discuss-tariffs-with-trump-as-a-unified-bloc-malaysia-pm-says",
    "timestamp": "2025-05-26T04:13:44Z"
  },
  {
    "title": "Southeast Asian nations want to discuss tariffs with Trump as a unified bloc, Malaysia PM says",
    "description": "Southeast Asian nations will forge a common front to face challenges including economic headwinds from U.S. tariffs and a four-year civil war in Myanmar...",
    "link": "https://www.yahoo.com/news/southeast-asian-nations-want-discuss-040709097.html",
    "timestamp": "2025-05-26T04:07:09Z"
  },
  {
    "title": "Siege Politics: Netanyahu’s Crisis-Driven Grip on Power",
    "description": "Even mild criticism produces splenetic reactions from the Israeli leader. By Imran Khalid | ( Foreign Policy in Focus ) - By now, it should surprise no one that Benjamin Netanyahu prefers the echo chamber of his own making to the international chorus demandin…",
    "link": "https://www.juancole.com/2025/05/politics-netanyahus-crisis.html",
    "timestamp": "2025-05-26T04:06:22Z"
  },
  {
    "title": "US futures jump while Asian shares slip after Trump delays tariffs on the EU",
    "description": "HONG KONG (AP) — U.S. futures jumped Monday and Asian shares mostly fell after U.S. President Donald Trump said he would delay a threatened 50% tariff on goods from the European Union to July 9 from June 1. Trump announced the decision after a call Sunday wit…",
    "link": "https://financialpost.com/pmn/us-futures-jump-while-asian-shares-slip-after-trump-delays-tariffs-on-the-eu",
    "timestamp": "2025-05-26T04:06:04Z"
  },
  {
    "title": "Starving Babies: The Self-Liquidation of U.S. Global Soft Power",
    "description": "( Tomdispatch.com ) - With the Oval Office looking more like a middle school classroom every day, let’s recall the way, once upon a time, we responded to childhood taunts from a playground bully. You remember how it goes. Your nemesis says mockingly that you’…",
    "link": "https://www.juancole.com/2025/05/starving-babies-liquidation.html",
    "timestamp": "2025-05-26T04:04:16Z"
  },
  {
    "title": "US futures jump while Asian shares slip after Trump delays tariffs on the EU",
    "description": "U.S. futures jumped Monday and Asian shares mostly fell after U.S. President Donald Trump said he would delay a threatened 50% tariff on goods from the...",
    "link": "https://finance.yahoo.com/news/us-futures-jump-while-asian-040236314.html",
    "timestamp": "2025-05-26T04:02:36Z"
  },
  {
    "title": "US futures jump while Asian shares slip after Trump delays tariffs on the EU",
    "description": "U.S. futures jumped Monday and Asian shares mostly fell after U.S. President Donald Trump said he would delay a threatened 50% tariff on goods from the...",
    "link": "https://finance.yahoo.com/news/us-futures-jump-while-asian-040236976.html",
    "timestamp": "2025-05-26T04:02:36Z"
  },
  {
    "title": "Top US politician shrugs off Trump crypto dinner concerns amid calls for probe",
    "description": "US House Speaker Mike Johnson has brushed off corruption concerns surrounding President Donald Trump’s dinner for the top holders of his memecoin and dodged answering whether the list of attendees should be released in the interest of transparency.Johnson tol…",
    "link": "https://cointelegraph.com/news/us-speaker-shrugs-off-trump-crypto-dinner-as-democrats-demand-answers",
    "timestamp": "2025-05-26T04:01:39Z"
  },
  {
    "title": "When the Supreme Court Stood Firm on Habeas Corpus",
    "description": "Stephen Miller’s recent remarks about suspending the writ echo attempts at presidential overreach after 9/11.",
    "link": "http://foreignpolicy.com/2025/05/26/supreme-court-habeas-corpus-miller-bush/",
    "timestamp": "2025-05-26T04:01:10Z"
  },
  {
    "title": "Trump’s Break with Israel: Genuine Shift or Political Theater?",
    "description": "When Donald Trump was re-elected president in November 2024, expectations were widespread that Israel’s assault on Gaza would intensify, and that the incoming administration would take a much more active role in neutralizing Tel Aviv’s regional adversaries. T…",
    "link": "https://www.lewrockwell.com/2025/05/no_author/trumps-break-with-israel-genuine-shift-or-political-theater/",
    "timestamp": "2025-05-26T04:01:00Z"
  },
  {
    "title": "Trump’s 50% tariff threat bodes ill for EU-China ties",
    "description": "Friday’s announcement was a decisive slap down of European media and policymakers’ belief that EU-US trade talks were progressing.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/trumps-50-tariff-threat-bodes-ill-for-eu-china-ties/",
    "timestamp": "2025-05-26T04:00:57Z"
  },
  {
    "title": "At NASCAR, a military ad welcoming men and their natural virtues and instincts",
    "description": "A devastatingly sad new poll came out saying that one-quarter of young men ages 18-34 report feeling lonely, compared to only 18% of women having the same feeling. I’m not at all surprised. Young men live in a world in which they’re demea...",
    "link": "https://www.americanthinker.com/blog/2025/05/at_nascar_a_military_ad_welcoming_men_and_their_natural_virtues_and_instincts.html",
    "timestamp": "2025-05-26T04:00:00Z"
  },
  {
    "title": "Asian markets mixed as Trump dials down after EU tariff threat",
    "description": "HONG KONG: Asian stocks were mixed Monday (May 26) after Donald Trump thrust his trade war back into the spotlight by threatening the European Union with huge tariffs before extending a deadline for their implementation. Just as markets were showing signs of …",
    "link": "https://www.channelnewsasia.com/business/asian-markets-mixed-trump-dials-down-after-eu-tariff-threat-5153101",
    "timestamp": "2025-05-26T03:58:25Z"
  },
  {
    "title": "Asian markets mixed as Trump delays 50% EU tariffs",
    "description": "HONG KONG: Asian markets were mixed and European equities rallied on Monday (May 26) after Donald Trump dialled back on his threat to hit the European Union with 50 per cent tariffs by delaying their implementation to July. Just as markets were showing signs …",
    "link": "https://www.channelnewsasia.com/business/asian-markets-mixed-trump-delays-50-eu-tariffs-5153101",
    "timestamp": "2025-05-26T03:58:00Z"
  },
  {
    "title": "US Futures Rise After Trump Delays EU Tariff Deadline To July 9: Asia-Pacific Markets Trade Mixed Amid Memorial Day Holiday",
    "description": "U.S. stock futures climbed in early Asia trading on Monday as investors digested President Donald Trump‘s decision to extend the deadline for imposing 50% tariffs on the European Union imports until July 9.\nWhat Happened: Dow Jones Industrial Average futures …",
    "link": "https://biztoc.com/x/a4aa92e1030f8203",
    "timestamp": "2025-05-26T03:57:05Z"
  },
  {
    "title": "Phil Robertson, ‘Duck Dynasty’ Star, Dies at 79",
    "description": "The family patriarch had previously been diagnosed with Alzheimer's disease\nThe post Phil Robertson, ‘Duck Dynasty’ Star, Dies at 79 appeared first on TheWrap.",
    "link": "https://www.thewrap.com/phil-robertson-dead/",
    "timestamp": "2025-05-26T03:56:36Z"
  },
  {
    "title": "Sensex surges 600 points, Nifty tops 25K on global cues; Bank, auto stocks rise",
    "description": "Indian stock markets surged on Monday, with Sensex and Nifty50 opening higher, fueled by gains in banking and auto sectors. This positive momentum followed U.S. President Trump's decision to extend trade talks with the European Union, alleviating immediate tr…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-surges-600-points-nifty-tops-25k-on-global-cues-it-bank-stocks-rise/articleshow/121403514.cms",
    "timestamp": "2025-05-26T03:56:12Z"
  },
  {
    "title": "Trump says US will control US Steel as part of Nippon deal",
    "description": "As part of the deal announced on Friday, Nippon Steel plans to invest $14 billion into US Steel's operations, including up to $4 billion in a new steel mill; Trump said on Friday the merger would create 70,000 jobs",
    "link": "https://www.thehindubusinessline.com/news/world/trump-says-us-will-control-us-steel-as-part-of-nippon-deal/article69619816.ece",
    "timestamp": "2025-05-26T03:55:38Z"
  },
  {
    "title": "Trump Has 'Very Nice Call' With EU Commission President, Changes Tactics on 50 Percent Tariff",
    "description": "Donald Trump said Sunday that he had a “very nice call” with European Commission President Ursula von der Leyen, and he has agreed to delay his threatened 50 percent tariff until July 9 at her request. The EU wants to negotiate, Trump said:That agreement came…",
    "link": "https://freerepublic.com/focus/f-bloggers/4319098/posts",
    "timestamp": "2025-05-26T03:54:51Z"
  }
]