[
  {
    "title": "Another vocal Trump critic hit with criminal fraud probe referral to DOJ",
    "description": "A Trump administration top housing official has referred a fourth Democratic official and \"vocal critic\" of President Donald Trump to the Justice Department over allegations of mortgage and tax fraud, according to reports Thursday. Rep. Eric Swalwell (D-CA) —…",
    "link": "https://www.rawstory.com/eric-swalwell-trump-2674293302/",
    "timestamp": "2025-11-13T19:37:20Z"
  },
  {
    "title": "Strategy Plunges to Weakest in 13 Months, but Still Trades at Premium to Bitcoin Holdings",
    "description": "Alongside bitcoin's tumble back to $98,000, MSTR is lower by another 6.6% on Thursday, bringing its year-to-date decline to 30%.",
    "link": "https://www.coindesk.com/markets/2025/11/13/strategy-plunges-to-weakest-in-13-months-but-still-trades-at-premium-to-bitcoin-holdings",
    "timestamp": "2025-11-13T19:34:10Z"
  },
  {
    "title": "Pointed questions and gasps in courtroom: Takeaways from hearing on fate of Trump’s handpicked prosecutor Lindsey Halligan",
    "description": "Attorneys for former FBI Director James Comey and New York Attorney General Letitia James battled the Justice Department in court Thursday over whether...",
    "link": "https://www.cnn.com/2025/11/13/politics/takeaways-lindsey-halligan-comey-james-hearing",
    "timestamp": "2025-11-13T19:33:59Z"
  },
  {
    "title": "President Trump’s granddaughter, Kai Trump, officially becomes part of Miami golf recruiting class",
    "description": "Kai Trump committed to Miami to play golf for the Hurricanes.",
    "link": "https://www.bostonherald.com/2025/11/13/trump-granddaughter-kai-golf/",
    "timestamp": "2025-11-13T19:33:29Z"
  },
  {
    "title": "James Fishback roils the Florida governor's race with his expected pro-Ron DeSantis bid",
    "description": "Fishback, an investment firm CEO and political newcomer, is publicly feuding with Trump advisers, and there are questions about his ties to Gov. Ron DeSantis' team.",
    "link": "https://www.nbcnews.com/politics/2026-election/james-fishback-florida-governors-race-ron-desantis-bid-rcna243376",
    "timestamp": "2025-11-13T19:33:26Z"
  },
  {
    "title": "Paralympic bosses prepare ground for potential ban on trans women competing in women's sports",
    "description": "The Paralympics is preparing the ground for a potential ban on transgender women competing in women's sports, with science to guide their decision, and plans to take the lead from the Olympic movement.",
    "link": "https://news.sky.com/story/paralympic-bosses-prepare-ground-for-potential-ban-on-transgender-women-competing-in-womens-sports-13469898",
    "timestamp": "2025-11-13T19:33:00Z"
  },
  {
    "title": "Epstein Trump Email Release Makes Congress, Public Spiral",
    "description": "The recent release of emails related to the Jeffrey Epstein files shone a harsh light on President Donald Trump has caused considerable alarm among congresspeople & observers in their reactions.",
    "link": "https://hiphopwired.com/2906712/epstein-trump-email-release-makes-congress-public-spiral/",
    "timestamp": "2025-11-13T19:31:47Z"
  },
  {
    "title": "Tennessee will have flyover at Neyland Stadium for NMSU game after government shutdown ends",
    "description": "Tennessee football will have a flyover at Neyland Stadium before it faces New Mexico State on Nov. 15 after the government shutdown ended on Nov. 12.",
    "link": "https://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2025/11/13/tennessee-football-flyover-neyland-stadium-government-shutdown-new-mexico-state/87252553007/",
    "timestamp": "2025-11-13T19:31:17Z"
  },
  {
    "title": "Trump said to plan attending Davos meeting in 2026",
    "description": "United States President Donald Trump is planning to go to Switzerland in January to attend the annual World Economic Forum (WEF) meeting in Davos.Trump is set to travel with a \"large entourage,\" sourc...",
    "link": "https://biztoc.com/x/9331eec193d92eab",
    "timestamp": "2025-11-13T19:30:37Z"
  },
  {
    "title": "“Gonna vote for it”: Republicans break ranks to vote on Epstein files bill",
    "description": "Republican defectors accuse President Donald Trump of pressuring them to \"vote the wrong way.\"",
    "link": "https://www.salon.com/2025/11/13/gonna-vote-for-it-republicans-break-ranks-to-vote-on-epstein-files-bill/",
    "timestamp": "2025-11-13T19:29:00Z"
  },
  {
    "title": "Pentagon top brass offer Trump new military options for Venezuela – CBS",
    "description": "The US is now considering conducting strikes on targets in Venezuela, CBS News has reported, citing sources Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627766-us-venezuela-land-strikes/",
    "timestamp": "2025-11-13T19:27:53Z"
  },
  {
    "title": "DOJ sues to block California congressional map",
    "description": "The Justice Department has sued to block new congressional district boundaries approved by California voters, joining a legal battle that could determine which party wins control of the U.S. House in 2026.",
    "link": "https://www.kcra.com/article/doj-sues-block-california-prop-50-map/69427374",
    "timestamp": "2025-11-13T19:26:08Z"
  },
  {
    "title": "Nvidia drags Wall Street toward its worst day in a month as AI superstars keep weakening",
    "description": "Nvidia was the heaviest weight on the market after the chip company lost 4.7%.",
    "link": "https://fortune.com/2025/11/13/wall-street-stocks-sink-investors-artifcial-intelligence-stocks-tariffs-president-trump/",
    "timestamp": "2025-11-13T19:23:16Z"
  },
  {
    "title": "Trump administration designates 4 left-wing European networks as terrorist organizations",
    "description": "President Donald Trump's administration on Thursday designated four European left-wing groups as terrorist organizations, following through on his vow to...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-designates-4-left-192249749.html",
    "timestamp": "2025-11-13T19:22:49Z"
  },
  {
    "title": "Megyn Kelly Bemoans Epstein Email Leak Is a ‘Self-Inflicted Wound'",
    "description": "On Wednesday’s episode of “The Megyn Kelly Show,” the host bemoaned the release of new emails from Jeffrey Epstein to associate Ghislaine Maxwell and author Michael Wolff, which claim that Donald Trump knew about Epstein’s conduct — including “about the girls…",
    "link": "https://freerepublic.com/focus/f-chat/4352348/posts",
    "timestamp": "2025-11-13T19:20:03Z"
  },
  {
    "title": "Trump’s White House renovation ambitions take a weird turn",
    "description": "Donald Trump too often seems less like a president and more like someone who’s stumbled upon a “Sim City: White House Edition” video game that he can’t put down",
    "link": "https://biztoc.com/x/353417d3675da4c1",
    "timestamp": "2025-11-13T19:19:37Z"
  },
  {
    "title": "China’s U.S. Soybean Purchases Stall Despite Trump’s Trade Truce",
    "description": "China’s purchases of American soybeans appear to have stalled, less than two weeks after the US touted a wide-ranging trade truce that signaled thawing relations between the world’s two biggest economies.",
    "link": "https://gcaptain.com/chinas-u-s-soybean-purchases-stall-despite-trumps-trade-truce/",
    "timestamp": "2025-11-13T19:19:11Z"
  },
  {
    "title": "BNY launches money market fund to hold reserves for US stablecoin issuers",
    "description": "BNY has introduced a regulated money market fund to hold reserves for US stablecoin issuers under the GENIUS Act, with Anchorage Digital making the first investment.",
    "link": "https://cointelegraph.com/news/bny-stablecoin-reserves-fund-to-support-regulated-us-issuers",
    "timestamp": "2025-11-13T19:18:26Z"
  },
  {
    "title": "McIver’s vindictive prosecution motion loss shows how Comey and James could win theirs",
    "description": "The claims raised by James Comey and Letitia James are stronger than the ones rejected in the New Jersey congresswoman’s case on Thursday.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/mciver-vindictive-prosecution-motion-comey-james-trump-rcna243713",
    "timestamp": "2025-11-13T19:17:02Z"
  },
  {
    "title": "Authorities Seeking Man Who Tried To Confront US Attorney Alina Habba and ‘Destroyed’ Office",
    "description": "Attorney General Pam Bondi said authorities are seeking a man who attempted to confront Alina Habba and \"destroyed property\" in her office before fleeing.\nThe post Authorities Seeking Man Who Tried To Confront US Attorney Alina Habba and ‘Destroyed’ Office fi…",
    "link": "https://www.mediaite.com/media/news/authorities-seeking-man-who-tried-to-confront-us-attorney-alina-habba-and-destroyed-office/",
    "timestamp": "2025-11-13T19:17:00Z"
  },
  {
    "title": "Colombia's president calls Trump a 'barbarian' in rift over drug vessel strikes: report",
    "description": "White House responds after Colombian President Gustavo Petro reportedly called President Donald Trump a \"barbarian\" in dispute over drug vessel strikes.",
    "link": "https://www.foxnews.com/politics/colombias-president-calls-trump-barbarian-rift-over-drug-vessel-strikes-report",
    "timestamp": "2025-11-13T19:15:40Z"
  },
  {
    "title": "BBC looking into allegations over another Trump speech edit",
    "description": "LONDON (Reuters) -Britain's BBC said on Thursday it was looking into fresh allegations, published in The Telegraph newspaper, over the editing by another of its programmes of a speech by U.S. President Donald Trump. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/14/bbc-looking-into-allegations-over-another-trump-speech-edit",
    "timestamp": "2025-11-13T19:15:00Z"
  },
  {
    "title": "Keeping Score: Democrats Dominate Key Elections; Federal Government Reopens After 43 Days; ICE Targets Childcare Centers",
    "description": "In every issue of Ms., we track research on our progress in the fight for equality, catalogue can’t-miss quotes from feminist voices and keep tabs on the feminist movement’s many milestones. We’re Keeping Score online, too—in this biweekly roundup.\nThis week:…",
    "link": "https://msmagazine.com/2025/11/13/keeping-score-democrats-elections-government-reopens-ice/",
    "timestamp": "2025-11-13T19:14:01Z"
  },
  {
    "title": "Republican Senator Has a Plan to Stop Foreigners from Abusing Surrogacy for US Citizenship Purposes",
    "description": "China and other foreign adversaries are abusing American birthright citizenship to have American children through surrogacy. But one Republican Senator has a plan to criminalize the growing surrogacy industry... Read More\nThe post Republican Senator Has a Pla…",
    "link": "https://www.dailysignal.com/2025/11/13/republican-senator-plan-stop-foreigners-abusing-surrogacy-citizenship/",
    "timestamp": "2025-11-13T19:11:29Z"
  },
  {
    "title": "Democrats Are Beating Trump on Affordability. Will He Keep Pretending Otherwise?",
    "description": "Affordability issues that dominated the 2024 election remain central. But President Donald Trump insists there's no problem.",
    "link": "https://reason.com/2025/11/13/democrats-are-beating-trump-on-affordability-will-he-keep-pretending-otherwise/",
    "timestamp": "2025-11-13T19:11:17Z"
  },
  {
    "title": "Colbert: \"Of Course [Trump] Knew About The Girls\" | Probably Illegal $1 Coin | The Ghost Of Abraham Lincoln",
    "description": "Damning emails from Jeffrey Epstein to journalist Michael Wolff indicate that Donald Trump knew of his pal's conduct with underage girls, the president wants to put his face on a new $1 coin, and a former White House usher claims the Lincoln Bedroom is haunte…",
    "link": "https://littlegreenfootballs.com/article/55059_Colbert-_Of_Course_[Trump]_Kne",
    "timestamp": "2025-11-13T19:11:01Z"
  },
  {
    "title": "Alabama Public Television considers cutting ties with PBS",
    "description": "The commission that governs Alabama Public Television is considering whether to end its partnership with PBS",
    "link": "https://abcnews.go.com/US/wireStory/alabama-public-television-considers-cutting-ties-pbs-127498697",
    "timestamp": "2025-11-13T19:10:50Z"
  },
  {
    "title": "Republicans promised health care negotiations after the shutdown, but Democrats are wary",
    "description": "Now that the government shutdown is over, House and Senate Republicans say they'll negotiate with Democrats on whether to extend COVID-era tax credits that help tens of millions of Americans afford their health care premiums",
    "link": "https://abcnews.go.com/US/wireStory/republicans-promised-health-care-negotiations-after-shutdown-democrats-127498676",
    "timestamp": "2025-11-13T19:10:45Z"
  },
  {
    "title": "DOJ sues to block California map that could tip control of Congress to Dems",
    "description": "The Justice Department has sued to block new congressional district boundaries approved by California voters, joining a legal battle that could determine which party wins control of the U.S. House in 2026.",
    "link": "https://www.pbs.org/newshour/politics/doj-sues-to-block-california-map-that-could-tip-control-of-congress-to-dems",
    "timestamp": "2025-11-13T19:10:05Z"
  },
  {
    "title": "Justice Department sues to block California US House map in clash that could tip control of Congress",
    "description": "The Justice Department has sued to block new congressional district boundaries approved by California voters, joining a legal battle that could determine which party wins control of the U.S. House in 2026",
    "link": "https://abcnews.go.com/Politics/wireStory/justice-department-sues-block-california-us-house-map-127498185",
    "timestamp": "2025-11-13T19:09:56Z"
  },
  {
    "title": "The quiet victories keeping American democracy alive",
    "description": "President Donald Trump wants to gerrymander the House of Representatives to Republican rule, but his effort has lost in three key states.",
    "link": "https://biztoc.com/x/7974ebba119238ba",
    "timestamp": "2025-11-13T19:08:43Z"
  },
  {
    "title": "White House official says October jobs and inflation data are likely to never be released",
    "description": "The government is beginning to reopen after President Donald Trump signed a House-passed funding package on Wednesday night, ending the record 43-day shutdown. But the White House has suggested the inflation and jobs data skipped during the shutdown may be pe…",
    "link": "https://biztoc.com/x/34460614a3bf6c33",
    "timestamp": "2025-11-13T19:08:42Z"
  },
  {
    "title": "What Trump Is Doing To End The Slaughter Of Christians In Nigeria",
    "description": "By Bradley Devlin, The Daily Signal | November 12, 2025\nThe horrific slaughter of Christians in Nigeria has caught the attention of President Donald Trump and the United States government.\n“If the Nigerian Government continues to allow the killing of Christia…",
    "link": "https://biztoc.com/x/9b0ff27c629aaffd",
    "timestamp": "2025-11-13T19:08:31Z"
  },
  {
    "title": "Trump Official Taunts Lawmaker As 'Dummy' After She Questions President's Epstein Ties",
    "description": "Trump's White House communications director also said the rep \"may be the stupidest member of Congress.\"",
    "link": "https://www.huffpost.com/entry/trump-official-dummy-alert_n_6915fc72e4b0295c356aeb2d",
    "timestamp": "2025-11-13T19:07:51Z"
  },
  {
    "title": "2026 FIFA World Cup organizers feel the pressure to deliver epic event in USA",
    "description": "Cities across USA are primed to host World Cup games next summer.",
    "link": "https://www.usatoday.com/story/sports/soccer/2025/11/13/2026-fifa-world-cup-organizers-usa/87252577007/",
    "timestamp": "2025-11-13T19:07:21Z"
  },
  {
    "title": "Labor’s news bargaining incentive looks a lot like a digital services tax. Will Trump notice?",
    "description": "If Washington decides this proposal is a digital services tax in disguise, Australia could face renewed diplomatic friction with the Trump administration.",
    "link": "https://theconversation.com/labors-news-bargaining-incentive-looks-a-lot-like-a-digital-services-tax-will-trump-notice-269703",
    "timestamp": "2025-11-13T19:07:20Z"
  },
  {
    "title": "'South Park' Skewers OpenAI's Sora 2, Shows Graphic Trump-Vance White House Sex Scene",
    "description": "Comedy Central’s \"South Park\" took on OpenAI’s artificial intelligence-powered video maker Sora 2, showcased an X-rated deep fake revenge porn tit for tat between South Park Elementary students, and featured a graphic sex scene between President Donald Trump …",
    "link": "https://www.breitbart.com/entertainment/2025/11/13/south-park-skewers-openais-sora-2-shows-graphic-trump-vance-white-house-sex-scene/",
    "timestamp": "2025-11-13T19:07:16Z"
  },
  {
    "title": "Donald Trump praises ‘unique’ Ozzy Osbourne in voicemail for widow Sharon",
    "description": "The president said he met his fellow reality TV star ‘a few times’",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/donald-trump-ozzy-osbourne-sharon-voicemail-b2864846.html",
    "timestamp": "2025-11-13T19:07:08Z"
  },
  {
    "title": "Lauren Boebert sends cryptic message over White House pressure on Epstein vote",
    "description": "Rep. Lauren Boebert (R-CO) is reportedly sending mixed messages over pressures from the White House and President Donald Trump to drop her support of the discharge petition to prompt the Department of Justice to release the Jeffrey Epstein files.Trump apparen…",
    "link": "https://www.rawstory.com/lauren-boebert-epstein-files/",
    "timestamp": "2025-11-13T19:07:02Z"
  },
  {
    "title": "Treasury yields rise as investors cheer end of government shutdown",
    "description": "U.S. Treasury yields held steady on Thursday as investors welcomed the end of the longest government shutdown in U.S. history.",
    "link": "https://www.cnbc.com/2025/11/13/us-treasury-yields-investors-cheer-end-of-government-shutdown-.html",
    "timestamp": "2025-11-13T19:06:57Z"
  },
  {
    "title": "MSNBC’s name is being replaced, but its leaders insist that its mission will remain the same",
    "description": "The new company, Versant, is choosing to embrace the ethos of a startup.",
    "link": "https://www.bostonherald.com/2025/11/13/media-ms-nows-debut/",
    "timestamp": "2025-11-13T19:05:49Z"
  },
  {
    "title": "Jasmine Crockett: ‘Crooked’ Trump blocking Epstein files",
    "description": "Rep. Jasmine Crockett (D-Houston) turned up the heat on President Donald Trump after new documents allegedly linking him to Jeffrey Epstein were released for public consumption this week. Crockett accuses Trump of blocking the Esptein investigation In a blist…",
    "link": "https://rollingout.com/2025/11/13/jasmine-crockett-crooked-trump-blocking-epstein-files/",
    "timestamp": "2025-11-13T19:04:24Z"
  },
  {
    "title": "The left tries to meme, comparing Trump to Duterte of the Philippines, and fails miserably",
    "description": "(A popular left-wing Internet meme, unknown creator. Screenshot by author.)A popular left-wing meme (unknown author) compares Rodrigo Duterte, former president of the Philippines who was often called the “Donald Trump of Asia” for his fiery speaking style and…",
    "link": "https://freerepublic.com/focus/f-news/4352346/posts",
    "timestamp": "2025-11-13T19:03:38Z"
  },
  {
    "title": "Justice Department Sues To Block California U.S. House Map In Clash That Could Tip Control Of Congress",
    "description": "The Justice Department has sued to block new congressional district boundaries approved by California voters, joining a legal battle that could determine which party wins control of the U.S. House in 2026.",
    "link": "https://www.huffpost.com/entry/ap-us-justice-department-california-redistricting-gavin-newsom_n_69162ab0e4b0295c356b4d8f",
    "timestamp": "2025-11-13T19:03:33Z"
  },
  {
    "title": "Democrats Keep Waiting For Trump Bombshell In Epstein Files. We’re Getting Other Golden Nuggets Instead",
    "description": "Democrats have mined the emails for evidence proving Trump conspired with Jeffrey Epstein. They’ve had to resort to grasping at straws.",
    "link": "https://dailycaller.com/2025/11/13/virginia-giuffre-jeffrey-epstein-donald-trump-files-emails-ghislaine-maxwell-democrats-redacted-oversight/",
    "timestamp": "2025-11-13T19:01:35Z"
  },
  {
    "title": "EU regulators probe Google’s ranking of news under policy supposed to stop scammers",
    "description": "EU regulators said that they’re investigating whether Google is unfairly demoting some content from media publishers in search results under a policy the company says is aimed at combating scammers.",
    "link": "https://www.independent.ie/business/technology/eu-regulators-probe-googles-ranking-of-news-under-policy-supposed-to-stop-scammers/a1605351695.html",
    "timestamp": "2025-11-13T19:01:31Z"
  },
  {
    "title": "Despite Trump's Denials, Climate Change Still Every Bit As Real As Epstein Files",
    "description": "USA skips UN climate summit, but Gavin Newsom's there.",
    "link": "https://www.wonkette.com/p/despite-trumps-denials-climate-change",
    "timestamp": "2025-11-13T19:01:18Z"
  },
  {
    "title": "Dem senators take umbrage with new China tech trade",
    "description": "A letter sent to President Trump asks for the reinstatement of export controls on China, focusing on sensitive chip technologies.",
    "link": "https://www.nextgov.com/artificial-intelligence/2025/11/dem-senators-take-umbrage-new-china-tech-trade/409502/",
    "timestamp": "2025-11-13T19:01:00Z"
  },
  {
    "title": "Colorado launches rebates for electric kitchen ranges, other appliances",
    "description": "Colorado will distribute $54 million to fund rebates over the next few years as part of the 2022 Inflation Reduction Act, which was passed by Congress and signed by then-President Joe Biden.",
    "link": "https://www.denverpost.com/2025/11/13/colorado-electric-kitchen-appliance-rebates/",
    "timestamp": "2025-11-13T19:00:31Z"
  },
  {
    "title": "‘Daily Show’ Declares the ‘Trump Train Has Crashed’ After Epstein Email Bombshell | Video",
    "description": "\"This isn't just not a good look. It's one of the worst looks I've ever seen,\" host Josh Johnson says\nThe post ‘Daily Show’ Declares the ‘Trump Train Has Crashed’ After Epstein Email Bombshell | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/daily-show-trump-epstein-emails-ghislaine-maxwell-prison-transfer-video/",
    "timestamp": "2025-11-13T18:59:02Z"
  },
  {
    "title": "Justice Department sues to block California US House map in clash that could tip control of Congress",
    "description": "California voters overwhelmingly approved Proposition 50 last week.",
    "link": "https://www.bostonherald.com/2025/11/13/justice-department-california-redistricting/",
    "timestamp": "2025-11-13T18:58:46Z"
  },
  {
    "title": "Justice Department sues to block California US House map in clash that could tip control of Congress",
    "description": "California voters overwhelmingly approved Proposition 50 last week.",
    "link": "https://www.denverpost.com/2025/11/13/justice-department-california-redistricting/",
    "timestamp": "2025-11-13T18:58:46Z"
  },
  {
    "title": "Panama denies US military exercises on its soil aimed at Venezuela",
    "description": "The president of Panama denied Thursday that US military exercises on its soil were in any way a \"hostile act against Venezuela.\"Panama's President Jose Raul...",
    "link": "https://www.yahoo.com/news/articles/panama-denies-us-military-exercises-185840528.html",
    "timestamp": "2025-11-13T18:58:40Z"
  },
  {
    "title": "The subtle art of indifference. Roger Goodell and the NFL have applied to Donald Trump and his bravado",
    "description": "Donald Trump loves to boast about everything he does, and now he&apos;s taken that same strategy from his political speeches into the NFL arena, but without the expected results. F",
    "link": "https://www.marca.com/en/nfl/2025/11/13/69162a32ca4741b6628b45d2.html",
    "timestamp": "2025-11-13T18:58:12Z"
  },
  {
    "title": "Supreme Court Considers Whether The First Step Act Allows Reduction in Criminal Sentences",
    "description": "By Fred Lucas, The Daily Signal | November 12, 2025\nThe Supreme Court heard arguments Wednesday on whether convicted felons can petition for reduced sentencing under the First Step Act, a criminal justice reform law that President Donald Trump signed during h…",
    "link": "https://biztoc.com/x/d81a5e7137afe53a",
    "timestamp": "2025-11-13T18:57:50Z"
  },
  {
    "title": "Government Shutdown Ends With Trump’s Signature Hours After House Passes Funding Bill",
    "description": "By Bradley Devlin, Jacob Adams & George Caldwell, The Daily Signal | November 12, 2025\nThe longest government shutdown in history is over after President Donald Trump signed a bill to fund the government into law on Wednesday night, just hours after the House…",
    "link": "https://biztoc.com/x/27116629e63eeb3e",
    "timestamp": "2025-11-13T18:57:31Z"
  },
  {
    "title": "Trump Administration Redoubles Efforts to Make Air Travel Safe Post Government Shutdown",
    "description": "As the United States approaches some of its busiest travel days, the Trump administration is redoubling its efforts to improve the quality and safety of... Read More\nThe post Trump Administration Redoubles Efforts to Make Air Travel Safe Post Government Shutd…",
    "link": "https://www.dailysignal.com/2025/11/13/trump-administration-redoubles-efforts-to-make-air-travel-safe-post-government-shutdown/",
    "timestamp": "2025-11-13T18:57:16Z"
  },
  {
    "title": "WATCH LIVE: Trump signs executive order on foster care with first lady Melania Trump",
    "description": "President Donald Trump is expected to sign a foster care system executive order on Thursday.",
    "link": "https://biztoc.com/x/886cd6556a8907c0",
    "timestamp": "2025-11-13T18:57:11Z"
  },
  {
    "title": "The Fight Against Authoritarian Creep Gets Great News From an Unlikely State",
    "description": "On Wednesday, the Marion County Record received a $3 million payout, topped with a written apology admitting local officials’ wrongdoing.",
    "link": "https://slate.com/news-and-politics/2025/11/trump-authoritarian-creep-marion-county-kansas-free-speech.html",
    "timestamp": "2025-11-13T18:55:42Z"
  },
  {
    "title": "Jeffries: Trump Jamming 'Unprecedented Extremism' down American's Throats",
    "description": "Thursday on MSNBC's \"Way Too Early,\" House Minority Leader Hakeem Jeffries (D-NY) claimed President Donald Trump was jamming \"unprecedented extremism\" down the throats of Americans.\nThe post Jeffries: Trump Jamming ‘Unprecedented Extremism’ down American’s Th…",
    "link": "https://www.breitbart.com/clips/2025/11/13/jeffries-trump-jamming-unprecedented-extremism-down-americans-throats/",
    "timestamp": "2025-11-13T18:54:57Z"
  },
  {
    "title": "Forget Schumer and Pelosi. Zohran Mamdani is Republicans' new foil.",
    "description": "The National Republican Congressional Committee plans to \"Make Mamdani and his policies the face of the Democratic Party,\" in the 2026 elections.",
    "link": "https://www.usatoday.com/story/news/politics/2025/11/13/schumer-pelosi-zohran-mamdani-nyc-mayor-republicans/87250813007/",
    "timestamp": "2025-11-13T18:54:19Z"
  },
  {
    "title": "Justice Department sues to block California US House map in clash that could tip control of Congress",
    "description": "The Justice Department on Thursday sued to block new congressional district boundaries approved by California voters last week, joining a court battle that...",
    "link": "https://www.yahoo.com/news/articles/justice-department-sues-block-california-185414672.html",
    "timestamp": "2025-11-13T18:54:14Z"
  },
  {
    "title": "As shutdown ends, states scramble to send SNAP benefits to millions",
    "description": "State officials are working to restore full SNAP benefits to millions of people after the long U.S. government shutdown has finally ended.",
    "link": "https://www.pbs.org/newshour/nation/as-shutdown-ends-states-scramble-to-send-snap-benefits-to-millions",
    "timestamp": "2025-11-13T18:52:55Z"
  },
  {
    "title": "How Venezuela Fits Into Trump’s Strategy for Latin America",
    "description": "And how the region is navigating a changed United States.",
    "link": "http://foreignpolicy.com/2025/11/13/trump-strategy-latin-america-venezuela/",
    "timestamp": "2025-11-13T18:52:42Z"
  },
  {
    "title": "Trump official refers Rep. Eric Swalwell for a federal criminal probe over alleged mortgage fraud",
    "description": "The Trump administration has referred Rep. Eric Swalwell, D-Calif., to the Justice Department for federal criminal prosecution, based on tax and mortgage fraud allegations.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-administration-eric-swalwell-federal-criminal-probe-mortgage-rcna243518",
    "timestamp": "2025-11-13T18:52:21Z"
  },
  {
    "title": "White House official says October jobs and inflation data are likely to never be released",
    "description": "It’s the first time monthly data on the economic indicators is missed since the Bureau of Labor Statistics officially started the reports.",
    "link": "https://fortune.com/2025/11/13/october-2025-jobs-inflation-data-release-government-shutdown/",
    "timestamp": "2025-11-13T18:51:52Z"
  },
  {
    "title": "Who Is Michael Wolff? All About the Author Involved in the Trump-Epstein Emails",
    "description": "Wolff's name resurfaced in a huge way when emails between him and Jeffrey Epstein emerged in November 2025.",
    "link": "https://hollywoodlife.com/feature/who-is-michael-wolff-5488369/",
    "timestamp": "2025-11-13T18:51:22Z"
  },
  {
    "title": "Trump has floated the idea of a 50-year mortgage. Here's how it could work — or not",
    "description": "The average first-time home buyer in the US is older than ever, but a new proposal could leave them paying off a mortgage until old age.",
    "link": "https://www.abc.net.au/news/2025-11-14/trump-administration-floats-50-year-mortgage/106000080",
    "timestamp": "2025-11-13T18:50:48Z"
  },
  {
    "title": "Donald Trump Is Awful. The BBC Is Great. And Yet, It Blew This One.",
    "description": "The Beeb has a history of making stupid mistakes. It survives them and always will. But why does it always seem to be caught flat-footed by them?",
    "link": "https://newrepublic.com/article/203070/donald-trump-bbc-bias-blew-it",
    "timestamp": "2025-11-13T18:49:19Z"
  },
  {
    "title": "Sharon Osbourne Breaks Down in Tears Listening to the Voicemail Donald Trump Left for Her After Ozzy's Death",
    "description": "In an emotional new podcast episode of the family’s show, The Osbournes, Sharon played a recording of a voicemail left for her by President Donald Trump in the wake of the Black Sabbath singer’s death. “Hi, Sharon. It's Donald Trump, and I just wanted to wish…",
    "link": "https://freerepublic.com/focus/f-chat/4352341/posts",
    "timestamp": "2025-11-13T18:48:21Z"
  },
  {
    "title": "'McCarthy moment coming' for Trump as he 'may not outlast' Epstein files: expert",
    "description": "Donald Trump's \"McCarthy moment\" could be coming, according to a law expert who says he might not outlast the Jeffrey Epstein files. 20,000 new documents were released by the Republican-led panel, with several emails further tying Trump to Epstein. The ex-US …",
    "link": "https://www.rawstory.com/donald-trump-epstein-2674292832/",
    "timestamp": "2025-11-13T18:47:58Z"
  },
  {
    "title": "From gowns to pantsuits, Michelle Obama explains her iconic fashion picks in a new book, ‘The Look’",
    "description": "She wanted her clothes to be welcoming as well as versatile.",
    "link": "https://www.bostonherald.com/2025/11/13/michelle-obama-fashion-book/",
    "timestamp": "2025-11-13T18:47:42Z"
  },
  {
    "title": "‘The business ultimately has a customer base to answer to’",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-restaurant-bbc-chile-police",
    "timestamp": "2025-11-13T18:47:23Z"
  },
  {
    "title": "Takeaways from the newly released Epstein documents",
    "description": "",
    "link": "https://biztoc.com/x/095365a45149f2a6",
    "timestamp": "2025-11-13T18:46:24Z"
  },
  {
    "title": "What’s next for Congress in the push to release more Epstein files",
    "description": "The bill would force the Justice Department to release all Epstein-related files, with some redactions.",
    "link": "https://www.pbs.org/newshour/nation/whats-next-for-congress-in-the-push-to-release-more-epstein-files",
    "timestamp": "2025-11-13T18:46:05Z"
  },
  {
    "title": "What the Health? From KFF Health News: The Government Is Open",
    "description": "The record-long federal shutdown is over after a small group of Democrats agreed to a deal with most Republicans that funds the government through January — but, notably, does not extend more generous Affordable Care Act tax credits. Plus, new details are eme…",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-422-government-shutdown-aca-tax-credits-november-13-2025/",
    "timestamp": "2025-11-13T18:45:44Z"
  },
  {
    "title": "Report: Russian Oil Export Revenue Down $13 Billion Since Trump Sanctions",
    "description": "The International Energy Agency (IEA) documented a drop in Russian oil export revenue of over $13 billion between October and November in a report published on Thursday, a potential signal that President Donald Trump's sanctions on Russia's oil industry impos…",
    "link": "https://www.breitbart.com/economy/2025/11/13/report-russian-oil-export-revenue-down-13-billion-since-trump-sanctions/",
    "timestamp": "2025-11-13T18:45:28Z"
  },
  {
    "title": "WATCH LIVE: Trump signs executive order on foster care with first lady Melania Trump",
    "description": "President Donald Trump is expected to sign a foster care system executive order on Thursday.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-signs-executive-order-on-foster-care-with-first-lady-melania-trump",
    "timestamp": "2025-11-13T18:45:07Z"
  },
  {
    "title": "Jen Psaki labels Karine Jean-Pierre's book 'outdated,' says it's 'misread' of current Democratic Party",
    "description": "MSNBC host Jen Psaki called former White House press secretary Karine Jean-Pierre's book about becoming an independent \"outdated\" during a conversation at Harvard University.",
    "link": "https://www.foxnews.com/media/jen-psaki-labels-karine-jean-pierres-book-outdated-says-its-misread-current-democratic-party",
    "timestamp": "2025-11-13T18:44:33Z"
  },
  {
    "title": "Trump Reportedly Presented Updated List Of Targets In Venezuela With Aircraft Carrier Already In The Caribbean",
    "description": "President Donald Trump was reportedly presented with an updated list of targets to strike Venezuela if he were to give the order, according to a new report.",
    "link": "https://www.ibtimes.com/trump-reportedly-presented-updated-list-targets-venezuela-aircraft-carrier-already-caribbean-3790290",
    "timestamp": "2025-11-13T18:43:34Z"
  },
  {
    "title": "‘South Park’ Doubles Down On Ridiculing Trump In Latest Episode With Uncomfortably Long Sex Scene Between Trump And J.D. Vance In A Thong",
    "description": "\"But boss, what about Satan?\" Vance asks as they kick off their passionate affair.",
    "link": "https://decider.com/2025/11/13/south-park-ridiculing-trump-sex-trump-jd-vance/",
    "timestamp": "2025-11-13T18:41:23Z"
  },
  {
    "title": "Trump-Appointed U.S. Attorney Lindsey Halligan's Appointment Challenged in Court",
    "description": "Lindsey Halligan could end up having a bit more free time on her hands in the near future ... because her appointment as an acting U.S. attorney is being challenged in court. FYI ... Halligan was appointed interim U.S. Attorney for the Eastern…\n Permalink",
    "link": "https://www.tmz.com/2025/11/13/trump-attorney-lindsey-halligan/",
    "timestamp": "2025-11-13T18:41:15Z"
  },
  {
    "title": "Trump Plans Lavish Dinner for Saudi Crown Prince Investing in Kushner",
    "description": "Mohammed bin Salman isn’t the head of Saudi Arabia, but Donald Trump is pulling out all the stops for him anyway.",
    "link": "https://newrepublic.com/post/203154/trump-dinner-saudi-crown-prince-mbs",
    "timestamp": "2025-11-13T18:39:12Z"
  },
  {
    "title": "Conservative influencers defend Trump as House prepares to vote on releasing Epstein files",
    "description": "WASHINGTON (Reuters) -Some prominent conservative influencers sought to downplay newly released emails from Jeffrey Epstein in which the convicted sex offender wrote that Donald Trump \"knew about the girls,\" arguing the messages were part of a broader Democra…",
    "link": "https://www.thestar.com.my/news/world/2025/11/14/conservative-influencers-defend-trump-as-house-prepares-to-vote-on-releasing-epstein-files",
    "timestamp": "2025-11-13T18:39:00Z"
  },
  {
    "title": "Kai Trump makes her LPGA debut at Pelican: live updates from The Annika",
    "description": "Follow along for updates from Thursday at The Annika.",
    "link": "https://golfweek.usatoday.com/story/sports/golf/lpga/2025/11/13/the-annika-2025-lpga-leaderboard-live-updates-from-kai-trump-debut/87252010007/",
    "timestamp": "2025-11-13T18:38:51Z"
  },
  {
    "title": "Daily Caller WH Correspondent Reports Admin ‘Revolting’ Against Official Who Pushed 50-Year Mortgage",
    "description": "Daily Caller's Reagan Reese reported that Trump \"allies\" are \"revolting\" over Trump being talked into a 50-year mortgage plan that wasn't properly \"vetted.\"\nThe post Daily Caller WH Correspondent Reports Admin ‘Revolting’ Against Official Who Pushed 50-Year M…",
    "link": "https://www.mediaite.com/media/news/daily-caller-wh-correspondent-reports-admin-revolting-against-official-who-pushed-50-year-mortgage/",
    "timestamp": "2025-11-13T18:37:48Z"
  },
  {
    "title": "BBC rocked by Jan. 6 edit scandal as British journalist calls out network’s ‘remarkably brazen’ move",
    "description": "Sun editor Harry Cole slammed the BBC’s ‘brazen’ edit of Trump’s January 6 remarks, saying the network is ‘reaping what it sowed’ as top executives step down.",
    "link": "https://www.foxnews.com/media/bbc-rocked-trump-edit-scandal-sun-editor-calls-out-networks-remarkably-brazen-move",
    "timestamp": "2025-11-13T18:37:31Z"
  },
  {
    "title": "Cash-strapped Kennedy Center letting FIFA use facilities rent-free for weeks: report",
    "description": "The John F. Kennedy Memorial Center for the Performing Arts will be postponing previously booked events so the Donald Trump administration can let FIFA, the cash-rich governing body of international soccer, use the facilities for free in late November into ea…",
    "link": "https://www.rawstory.com/trump-fifa-kennedy-center/",
    "timestamp": "2025-11-13T18:36:59Z"
  },
  {
    "title": "The quiet victories keeping American democracy alive",
    "description": "President Donald Trump wants to gerrymander the House of Representatives to Republican rule, but his effort has lost in three key states.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-redistricting-utah-california-indiana-rcna243572",
    "timestamp": "2025-11-13T18:35:34Z"
  },
  {
    "title": "MSNBC’s Lawrence O’Donnell Hits Trump With ‘R’-Word Over Epstein Blockbuster — Could ‘Crush’ Trump’s Career",
    "description": "Lawrence O’Donnell said the Jeffrey Epstein email dump directly citing Trump could \"crush\" Trump's political career — and even lead to the big \"R\"-word.\nThe post MSNBC’s Lawrence O’Donnell Hits Trump With ‘R’-Word Over Epstein Blockbuster — Could ‘Crush’ Trum…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-lawrence-odonnell-hits-trump-with-r-word-over-epstein-blockbuster-could-crush-trumps-career/",
    "timestamp": "2025-11-13T18:35:19Z"
  },
  {
    "title": "Do the new Epstein emails implicate Trump?",
    "description": "Protesters hold up signs of Jeffrey Epstein and President Donald Trump in front of the New York City federal courthouse in 2019. | Stephanie Keith/Getty Images \nKey takeaways\nDemocrats released an email in which Jeffrey Epstein said Donald Trump had spent hou…",
    "link": "https://biztoc.com/x/a00fd9dfee83560d",
    "timestamp": "2025-11-13T18:34:55Z"
  },
  {
    "title": "Yamal up for Puskas Award as best men's goal. Marta on list for award FIFA named after her",
    "description": "Lamine Yamal was nominated Thursday for the FIFA Puskas Award as the best men’s goal of last season, with Brazil great Marta shortlisted for the FIFA Marta Award, the women's award named after her. Barcelona teenager Yamal’s goal was scored against Espanyol i…",
    "link": "https://sports.yahoo.com/article/yamal-puskas-award-best-mens-183332337.html",
    "timestamp": "2025-11-13T18:33:32Z"
  },
  {
    "title": "Trump-obsessed writer Michael Wolff encouraged Jeffrey Epstein to blackmail then-presidential candidate Donald, emails reveal",
    "description": "In A Nutshell Winter weight gain is biological, not just behavioral – Dropping temperatures trigger hormonal changes that increase hunger (ghrelin rises) while decreasing fullness signals (leptin drops), making people feel less satisfied after eating. Reduced…",
    "link": "https://freerepublic.com/focus/f-chat/4352336/posts",
    "timestamp": "2025-11-13T18:33:01Z"
  },
  {
    "title": "George Conway Reportedly Nears Run For Congress Weeks After Coming Out As ‘Antifa’",
    "description": "Anti-Trump lawyer George Conway is currently eyeing a bid for Congress in New York, CNN reported on Thursday.",
    "link": "https://dailycaller.com/2025/11/13/george-conway-congress-new-york-democrat/",
    "timestamp": "2025-11-13T18:30:05Z"
  }
]