[
  {
    "title": "Why Trump’s pledge to defend Qatar is so extraordinary",
    "description": "President Donald Trump has bestowed upon the nation of Qatar a remarkable security guarantee that could include coming to its defense militarily. In an executive order dated earlier this week, Trump declared that the United States will regard any attack on Qa…",
    "link": "https://freerepublic.com/focus/f-news/4343857/posts",
    "timestamp": "2025-10-02T05:23:35Z"
  },
  {
    "title": "New footage shows House Speaker Mike Johnson's response to Rep. Dean's comments on Trump",
    "description": "Additional footage emerged showing House Speaker Mike Johnson's interaction with Representative Madeleine Dean during a Capitol Hill confrontation where Dean called President Donald Trump \"unhinged\" and \"unwell.\" The exchange occurred Tuesday, September 30, f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/new-footage-shows-house-speaker-mike-johnsons-response-to-rep-deans-comments-on-trump/articleshow/124269626.cms",
    "timestamp": "2025-10-02T05:20:08Z"
  },
  {
    "title": "G7 ministers to target those increasing Russia oil purchases",
    "description": "G7 finance ministers pledged Wednesday to take aim at those who are continuing to step up purchases of Russian oil, since Moscow's invasion of Ukraine more than three years ago.",
    "link": "https://www.hurriyetdailynews.com/g7-ministers-to-target-those-increasing-russia-oil-purchases-214213",
    "timestamp": "2025-10-02T05:17:00Z"
  },
  {
    "title": "Trump uses government shutdown to dole out firings and political punishment",
    "description": "President Donald Trump has seized on the government shutdown as an opportunity to reshape the federal workforce and punish detractors",
    "link": "https://abcnews.go.com/US/wireStory/trump-government-shutdown-dole-firings-political-punishment-126141242",
    "timestamp": "2025-10-02T05:10:20Z"
  },
  {
    "title": "In Black columnist's firing, advocates fear decreasing diversity, vital perspectives in news media",
    "description": "Karen Attiah, a former opinion columnist at The Washington Post, says she was fired after social media posts expressing concerns about gun violence and rhetoric against Black women",
    "link": "https://abcnews.go.com/US/wireStory/black-columnists-firing-advocates-fear-decreasing-diversity-vital-126141425",
    "timestamp": "2025-10-02T05:10:19Z"
  },
  {
    "title": "U.S. targets Iran's nuclear program, weapons procurement",
    "description": "The United States is blacklisting 44 individuals and firms accused of being involved in Iran's nuclear program and weapons procurement network.",
    "link": "https://www.upi.com/Top_News/US/2025/10/02/Iran-sanctions/4581759379261/",
    "timestamp": "2025-10-02T05:10:09Z"
  },
  {
    "title": "The clean energy revolution – a reason to be hopeful – podcast",
    "description": "Why might authoritarians fear the rise of solar energy? With Bill McKibben\nLast week Donald Trump let the UN general assembly know exactly what he thought about renewable energy sources. “I’ve been right about everything and I’m telling you that if you don’t …",
    "link": "https://biztoc.com/x/008bc21d3d60e8aa",
    "timestamp": "2025-10-02T05:07:06Z"
  },
  {
    "title": "European markets set to open higher, building on positive momentum",
    "description": "European stocks are expected to open higher on Thursday, building on positive momentum in the previous session.",
    "link": "https://www.cnbc.com/2025/10/02/european-markets-on-oct-2-stoxx-600-ftse-dax-cac.html",
    "timestamp": "2025-10-02T05:03:10Z"
  },
  {
    "title": "Today I will discuss House of Beamish. I think I remember the plot from history class, but we were all quite drunk",
    "description": "Much like Downton Abbey, House of Guinness is best treated as a delightful hallucinatory cheese dream",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/10/02/today-i-will-be-discussing-house-of-beamish-i-think-i-remember-the-plot-from-history-class-but-we-were-all-quite-drunk-at-school/",
    "timestamp": "2025-10-02T05:00:01Z"
  },
  {
    "title": "Jimmy Kimmel Takes Aim at FCC Amid Government Shutdown: ‘We Can Now Say Whatever We Want’ | Video",
    "description": "\"There is some silver lining to the shutdown,\" the \"Jimmy Kimmel Live!\" host adds\nThe post Jimmy Kimmel Takes Aim at FCC Amid Government Shutdown: ‘We Can Now Say Whatever We Want’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-fcc-joke-government-shut-down-opening-monologue/",
    "timestamp": "2025-10-02T04:57:20Z"
  },
  {
    "title": "Supreme Court allows the Fed's Lisa Cook to stay in office for now as Trump pushes to fire her",
    "description": "WASHINGTON — The Supreme Court on Wednesday deferred action on whether President Donald Trump can immediately fire Federal Reserve board member Lisa Cook, instead agreeing to hear oral arguments in the case early next year.\nThe move means that Cook can remain…",
    "link": "https://biztoc.com/x/6e03406fbe18e433",
    "timestamp": "2025-10-02T04:56:03Z"
  },
  {
    "title": "Report: Musk becomes first person to be worth $500 billion",
    "description": "Elon Musk has become the first person estimated to reach a net worth of $500 billion, according to US magazine Forbes, largely held in shares of electric...",
    "link": "https://dpa-international.com/economics/urn:newsml:dpa.com:20090101:251002-99-211868/",
    "timestamp": "2025-10-02T04:54:26Z"
  },
  {
    "title": "Drones, frozen billions and a Hungarian villain: Copenhagen’s Scandi-noir summit",
    "description": "Reality rivals fiction as Denmark hosts EU leaders amid drone chaos and a €185bn Russian asset heist. Even Birgitte Nyborg would struggle to keep up",
    "link": "https://www.irishtimes.com/world/europe/2025/10/02/drones-frozen-billions-and-a-hungarian-villain-copenhagens-scandi-noir-summit/",
    "timestamp": "2025-10-02T04:45:00Z"
  },
  {
    "title": "Taiwan rejects U.S. proposal of '50-50' chip production, says trade talks focused on tariffs",
    "description": "Vice Premier Cheng Li-chiun said the arrangement was \"not discussed,\" as she returned from trade talks in the U.S., according to Taiwan's Central News Agency.",
    "link": "https://www.cnbc.com/2025/10/02/taiwan-us-chip-production-tsmc-trade-tariffs.html",
    "timestamp": "2025-10-02T04:38:39Z"
  },
  {
    "title": "Belarus opposition leader vanishes after refusing deportation in a US-brokered prisoner release",
    "description": "Veteran Belarus opposition leader Mikalai Statkevich has vanished after refusing to leave the country in a U.S.-negotiated prisoner release in September, and human rights activists are demanding the government reveal his whereabouts",
    "link": "https://abcnews.go.com/International/wireStory/belarus-opposition-leader-vanishes-after-refusing-deportation-us-126141694",
    "timestamp": "2025-10-02T04:38:27Z"
  },
  {
    "title": "Federal government shutdown sparks blame game in crucial race for governor",
    "description": "New Jersey gubernatorial candidates Jack Ciattarelli and Rep. Mikie Sherrill clash over government shutdown blame in the high profile showdown, one of only two 2025 elections for governor",
    "link": "https://www.foxnews.com/politics/federal-government-shutdown-impacts-crucial-race-governor",
    "timestamp": "2025-10-02T04:37:22Z"
  },
  {
    "title": "Todd Chrisley Was 'Not in Favor' of Savannah Airing Their Family Drama",
    "description": "Todd Chrisley has admitted he was not a fan of daughter Savannah airing their family’s dirty laundry on TV. Speaking on the Wednesday, October 1 episode of the “Chrisley Confessions 2.0.” podcast, Todd said he would have preferred the drama between Savannah h…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisley-reacts-to-savannah-exposing-family-drama-on-tv/#article",
    "timestamp": "2025-10-02T04:30:30Z"
  },
  {
    "title": "Hollywood horror sequence: What looks like protection could lead to dejection in America’s film industry",
    "description": "As globalized filmmaking lets US studios shave millions off budgets and helps keep blockbusters profitable, Trump’s new 100% film tariff is likely to hit American movies the hardest. Plus, anyone brave enough to accept the task of ensuring compliance will fac…",
    "link": "https://www.livemint.com/opinion/online-views/us-film-tariff-trump-indian-vfx-industry-impact-bollywood-box-office-digital-content-hollywood-production-costs-avengers-11759313958071.html",
    "timestamp": "2025-10-02T04:30:06Z"
  },
  {
    "title": "Ali Sawafta: Donald Trump’s Gaza peace plan sets very tough path for Palestinian Authority",
    "description": "Driven out of Gaza two decades ago by Hamas, strapped for cash and headquartered in the Israeli-occupied West Bank, the Palestinian Authority’s (PA) hopes of running a future Palestinian state have long seemed bleak.",
    "link": "https://www.independent.ie/opinion/analysis/ali-sawafta-donald-trumps-gaza-peace-plan-sets-very-tough-path-for-palestinian-authority/a2087510602.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "US vote to end government shutdown fails as Democrats stand by demands",
    "description": "A vote to end the US government shutdown hours after it began failed yesterday, as Democrats in the Senate held firm to the party’s demands to fund healthcare subsidies that American president Donald Trump and Republicans are refusing to provide.",
    "link": "https://www.independent.ie/world-news/north-america/us-vote-to-end-government-shutdown-fails-as-democrats-stand-by-demands/a1651051016.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: As brazen Putin pushes boundaries, EU must stand up",
    "description": "In the Cold War it was considered delusional not to be paranoid. Fears were so stoked that real ­dangers could not be differentiated from the imaginary. But there was nothing histrionic or hyperbolic in Denmark’s prime minister ­warning that Europe is facing …",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-as-brazen-putin-pushes-boundaries-eu-must-stand-up/a1235667778.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "EU leaders discuss plan for ‘drone wall’ to protect eastern flank from Russians",
    "description": "EU leaders, including Taoiseach Micheál Martin, yesterday discussed plans to bolster the bloc’s eastern defences against Russian drones, but some said the focus should be broader.",
    "link": "https://www.independent.ie/world-news/europe/eu-leaders-discuss-plan-for-drone-wall-to-protect-eastern-flank-from-russians/a1427063840.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "Both parties blame each other on first day of US government shutdown as tourist sites close",
    "description": "Republicans and Democrats are locked in a blame game over the federal government shutdown, which has closed iconic sites nationwide. The Trump administration falsely claims Democrats want to fund healthcare for undocumented immigrants, while Democrats accuse …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/both-parties-blame-each-other-on-first-day-of-us-government-shutdown-as-tourist-sites-close/articleshow/124269095.cms",
    "timestamp": "2025-10-02T04:13:42Z"
  },
  {
    "title": "The Government Shutdown Is a Distraction—From Our $37 Trillion Debt",
    "description": "The federal government just accumulated an additional $2 trillion in debt over the last 12 months. That's the kind of…",
    "link": "https://reason.com/2025/10/02/the-government-shutdown-is-a-distraction-from-our-37-trillion-debt/",
    "timestamp": "2025-10-02T04:09:02Z"
  },
  {
    "title": "Deepfake political scam ads surge on Meta platforms, watchdog says",
    "description": "Scammers spent $49 million on Meta ads using AI deepfakes of US politicians, including Trump, to push fake benefits targeting seniors, a watchdog found. Despite removals, many accounts kept running ads.",
    "link": "https://economictimes.indiatimes.com/tech/technology/deepfake-political-scam-ads-surge-on-meta-platforms-watchdog-says/articleshow/124269021.cms",
    "timestamp": "2025-10-02T04:05:08Z"
  },
  {
    "title": "Where does the Arab and Muslim world stand on Trump’s Gaza peace plan? Expert Q&A",
    "description": "By Scott Lucas, University College Dublin The US president, Donald Trump, unveiled a 20-point proposal to end the war in Gaza on September 29. The plan proposes an immediate end to the fighting and the release of all Israeli hostages held by Hamas in exchange…",
    "link": "https://www.juancole.com/2025/10/muslim-trumps-expert.html",
    "timestamp": "2025-10-02T04:04:43Z"
  },
  {
    "title": "Seth Meyers Roasts Trump For Being Totally 'Obsessed' With This Weird Strategy",
    "description": "Seth Meyers Roasts Trump For Being Totally 'Obsessed' With This Weird Strategyhuffpost.com",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-shutdown-negotiations_n_68dde7bfe4b028d81f3059a8",
    "timestamp": "2025-10-02T04:03:23Z"
  },
  {
    "title": "Dogecoin Mining Gets $2.5M Boost From Trump-Linked Thumzup Media",
    "description": "According to multiple reports, Thumzup Media Corporation has provided a $2.5 million loan to DogeHash Technologies to help expand Dogecoin mining operations. Related Reading: Chinese National At Center Of Historic $6.7B Crypto Bust Pleads Guilty The cash is t…",
    "link": "https://bitcoinist.com/dogecoin-mining-gets-2-5m-boost-from-trump-linked-thumzup-media/",
    "timestamp": "2025-10-02T04:00:53Z"
  },
  {
    "title": "Where is Europe’s economic drone wall?",
    "description": "Europe needs the economic equivalent of a drone wall to preserve its security and sovereignty. But that would require member states to hand new powers and funding to Brussels",
    "link": "https://www.euractiv.com/opinion/where-is-europes-economic-drone-wall/",
    "timestamp": "2025-10-02T04:00:48Z"
  },
  {
    "title": "Imagine You’re Woke…",
    "description": "Having watched Secretary of War Pete Hegseth’s speech to the military brass this week, I allowed myself to wonder what it is like for the woke in this country. It isn’t out of concern for them as much as it is understanding your foes in t...",
    "link": "https://www.americanthinker.com/articles/2025/10/imagine_you_re_woke.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "The Antifa War Instigators",
    "description": "Some things never change. Last Saturday, Ron Wyden, Oregon’s senior Democrat U.S. senator, made a ballsy -- if unintended -- declaration in a X post. Wyden proclaimed: “My message to Donald Trump is this: we don’t need you here. Sta...",
    "link": "https://www.americanthinker.com/articles/2025/10/the_antifa_war_instigators.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Revenge, lawfare, and justice",
    "description": "President Trump has been accused by Democrats and many pens and voices in the liberal American media of mere revenge-seeking in his insistence that AG Pam Bondi and the FBI thoroughly investigate James Comey, former FBI director, and John Brennan, fo...",
    "link": "https://www.americanthinker.com/blog/2025/10/revenge_lawfare_and_justice.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Will Trump bunker-bust the Marxist administrative state?",
    "description": "Can anyone dismantle the administrative state?\r\n\r\nOnly one president has had both the desire and opportunity to crush and disable the administrative state, but more importantly, end the Marxist dialectic that has infected and subsumed this nation and...",
    "link": "https://www.americanthinker.com/blog/2025/10/will_trump_bunker_bust_the_marxist_administrative_state.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Why climate models fail",
    "description": "Mainstream climatology models are fundamentally flawed because they ignore a now established physical reality: gravity — not radiative forcing — governs the temperature gradient in the troposphere.  This gradient arises from gra...",
    "link": "https://www.americanthinker.com/blog/2025/10/why_climate_models_fail.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Attention Department of War: Lessons Israel Learned from the Yom Kippur War … The Hard Way",
    "description": "Although the United States is widely acknowledged as the most powerful military force on earth, we haven’t decisively won a war since the hawkish-sounding Department of War became the peaceful-sounding Department of Defense, way back in 1947.&n...",
    "link": "https://www.americanthinker.com/articles/2025/10/attention_department_of_war_lessons_israel_learned_in_the_yom_kippur_war_the_hard_way.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Sarah Paulson, Glenn Close and Caitlyn Jenner appear in The Kardashians season seven teaser",
    "description": "The first trailer for The Kardashians season seven has teased appearances from Sarah Paulson, Niecy Nash, Glenn Close and Caitlyn Jenner. The Kardashian clan – all of them – are back for the seventh season of The Kardashians on Hulu, with a first look at the …",
    "link": "https://www.thepinknews.com/2025/10/02/the-kardashians-season-seven-sarah-paulson-caitlyn-jenner/",
    "timestamp": "2025-10-02T03:59:34Z"
  },
  {
    "title": "Here’s how an ancient Indian craft is suffering under Trump’s tariffs",
    "description": "Country‘s traditional craftmanship, from brassworks to textiles, jewelry and pashmina is under threat as US hikes import duties to 50% Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625644-our-livelihood-is-at-stake/",
    "timestamp": "2025-10-02T03:58:55Z"
  },
  {
    "title": "Trump jeopardizing U.S. role as scientific leader: Nobel officials",
    "description": "Donald Trump's assault on science could threaten the United States' position as the world's leading research nation and have knock-on effects worldwide, Nobel Prize officials in Sweden told AFP. Since taking office in January, the U.S. president has cut billi…",
    "link": "https://japantoday.com/category/world/trump-jeopardising-us-role-as-scientific-leader-nobel-officials",
    "timestamp": "2025-10-02T03:58:09Z"
  },
  {
    "title": "Trump Set to Discuss Soybean Purchases With China's Xi",
    "description": "US President Donald Trump says he will press Chinese President Xi Jinping to restart purchases of soybeans when the two meet ...",
    "link": "https://biztoc.com/x/537322aa290d3bb6",
    "timestamp": "2025-10-02T03:56:55Z"
  },
  {
    "title": "Trump 2.0 tariff tracker - Trade Compliance Resource Hub",
    "description": "Trump 2.0 tariff trackerTrade Compliance Resource Hub Wall Street, Republicans and some courts have tried to stop Trump’s tariffs. Here’s why they’re still in placeCNN The industries hit hardest by Donald Trump's sweeping tariffsAustralian Broadcasting Corpor…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179623266",
    "timestamp": "2025-10-02T03:52:40Z"
  },
  {
    "title": "Isuzu to build first independent U.S. plant",
    "description": "The Japanese commercial vehicle maker aims to ease the impact of high U.S. tariffs by expanding local production.",
    "link": "https://www.japantimes.co.jp/business/2025/10/02/companies/isuzu-first-us-plant/",
    "timestamp": "2025-10-02T03:51:00Z"
  },
  {
    "title": "‘Comey’s Home Free’: George Conway Argues Former FBI Director Is Off the Hook Thanks To ‘Invalid’ Indictment",
    "description": "Conservative attorney George Conway said former FBI Director James Comey is \"home free\" after being indicted by the Department of Justice.\nThe post ‘Comey’s Home Free’: George Conway Argues Former FBI Director Is Off the Hook Thanks To ‘Invalid’ Indictment fi…",
    "link": "https://www.mediaite.com/media/tv/comeys-home-free-george-conway-argues-former-fbi-director-is-off-the-hook-thanks-to-invalid-indictment/",
    "timestamp": "2025-10-02T03:50:41Z"
  },
  {
    "title": "Newly elected Arizona lawmaker has yet to be sworn into office, as House Democrats welcome her",
    "description": "A week after her decisive win in an Arizona special election for the U.S. House, Democrat Adelita Grijalva has yet to take office",
    "link": "https://abcnews.go.com/Politics/wireStory/newly-elected-arizona-lawmaker-sworn-office-house-democrats-126137030",
    "timestamp": "2025-10-02T03:50:27Z"
  },
  {
    "title": "Chevrolet EV Sales Grew 86% in 3rd Quarter",
    "description": "As we expected, automakers had a strong quarter of EV sales in the 3rd quarter in the USA, and that includes Chevrolet. GM’s mass-market brand scored 37,114 EV sales last quarter, up 86.2% from 19,933 sales in the 3rd quarter of 2024. However, it’s not just a…",
    "link": "https://cleantechnica.com/2025/10/01/chevrolet-ev-sales-grew-86-in-3rd-quarter/",
    "timestamp": "2025-10-02T03:50:26Z"
  },
  {
    "title": "Gold Prices Hold Five-Day Rally On Fed Cut Bets, US Shutdown Concerns",
    "description": "Gold steadied — following a five-day rally that saw it reach successive records — as the US government shutdown began and traders added to bets on Federal Reserve interest-rate cuts following weak private payrolls data.",
    "link": "https://www.ndtvprofit.com/markets/gold-prices-hold-five-day-rally-on-fed-cut-bets-us-shutdown-concerns",
    "timestamp": "2025-10-02T03:49:03Z"
  },
  {
    "title": "Democrats voted for a shutdown. Now they have to find a way out",
    "description": "Senate Democrats kept their promise to reject any Republican spending bill that didn’t extend or restore health care benefits, choosing instead to force a government shutdown",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-voted-shutdown-now-find-126135933",
    "timestamp": "2025-10-02T03:42:29Z"
  },
  {
    "title": "Democrats voted for a shutdown. Now they have to find a way out",
    "description": "Senate Democrats kept their promise to reject any Republican spending bill that didn’t extend or restore health care benefits, choosing instead to force a government shutdown",
    "link": "https://abcnews.go.com/Health/wireStory/democrats-voted-shutdown-now-find-126135932",
    "timestamp": "2025-10-02T03:42:28Z"
  },
  {
    "title": "US to Provide Ukraine With Intelligence for Strikes Deep Into Russia - Reports",
    "description": "US President Donald Trump has allowed intelligence agencies and the Pentagon to provide Ukraine with intelligence for strikes deep into Russia against energy infrastructure facilities, The Wall Street Journal newspaper reported, citing US officials.",
    "link": "https://sputnikglobe.com/20251002/us-to-provide-ukraine-with-intelligence-for-strikes-deep-into-russia---reports-1122896149.html",
    "timestamp": "2025-10-02T03:42:00Z"
  },
  {
    "title": "50 years later, 'Thrilla in Manila' remains greatest boxing match of all time",
    "description": "Muhammad Ali and Joe Frazier fought the \"Thrilla in Manila\" 50 years ago. It's still viewed as the greatest and most brutal boxing match ever.",
    "link": "https://sports.yahoo.com/article/50-years-later-thrilla-manila-034134192.html",
    "timestamp": "2025-10-02T03:41:34Z"
  },
  {
    "title": "Race to Replace Gavin Newsom Continues Thin as Longtime Calif. Legislator Exits",
    "description": "Race to replace Gavin Newsom continues to thin as longtime Calif. legislator exitsThe California governor’s race is continuing to slim down. Toni Atkins, the first openly gay president pro tempore of the California State Senate, and a longtime legislator, bec…",
    "link": "https://freerepublic.com/focus/f-news/4343851/posts",
    "timestamp": "2025-10-02T03:38:39Z"
  },
  {
    "title": "Ted Cruz Edits Sombreros Onto 44 Senate Democrats: ‘Will Continue Until They Re-Open Our Government’",
    "description": "Sen. Ted Cruz (R-TX) edited sombreros and moustaches onto 44 Senate Democrats, threatening to \"continue until they re-open our government.\"\nThe post Ted Cruz Edits Sombreros Onto 44 Senate Democrats: ‘Will Continue Until They Re-Open Our Government’ first app…",
    "link": "https://www.mediaite.com/politics/ted-cruz-edits-sombreros-onto-44-senate-democrats-will-continue-until-they-re-open-our-government/",
    "timestamp": "2025-10-02T03:37:03Z"
  },
  {
    "title": "Poll: Winsome Earle-Sears Surges Within Margin of Error Against Abigail Spanberger in Virginia Governor’s Race",
    "description": "An A2 Insights poll shows Republican Lt. Gov. Winsome Earle-Sears narrowing the gap against Democrat Abigail Spanberger in Virginia’s gubernatorial contest, placing the race within the margin of error as voters head into the final stretch before November’s el…",
    "link": "https://www.breitbart.com/politics/2025/10/01/poll-winsome-earle-sears-surges-margin-error-abigail-spanberger-virginia/",
    "timestamp": "2025-10-02T03:35:07Z"
  },
  {
    "title": "FBI cuts ties with Anti-Defamation League amid conservative backlash",
    "description": "FBI Director Kash Patel announces break with anti-Semitism watchdog amid outrage over description of Charlie Kirk.",
    "link": "https://www.aljazeera.com/news/2025/10/2/fbi-cuts-ties-with-anti-defamation-league-amid-conservative-backlash",
    "timestamp": "2025-10-02T03:30:19Z"
  },
  {
    "title": "Deepfake political scam ads surge on Meta platforms, watchdog says",
    "description": "Scammers are among the top political ad spenders on Meta's platforms, using deepfake videos of American politicians including President Donald Trump to promote fake government benefits, a watchdog group said Wednesday. One advertiser identified by TTP called …",
    "link": "https://timesofindia.indiatimes.com/world/us/deepfake-political-scam-ads-surge-on-meta-platforms-watchdog-says/articleshow/124268531.cms",
    "timestamp": "2025-10-02T03:27:53Z"
  },
  {
    "title": "Trump Jeopardising US Role As Scientific Leader: Nobel Officials",
    "description": "Donald Trump's assault on science could threaten the United States' position as the world's leading research nation and have knock-on effects worldwide, Nobel Prize officials in Sweden told AFP.\nSince taking office in January, the US president has cut billion…",
    "link": "https://www.ibtimes.com/trump-jeopardising-us-role-scientific-leader-nobel-officials-3785182",
    "timestamp": "2025-10-02T03:27:19Z"
  },
  {
    "title": "Dem gubernatorial candidate slammed as the 'Kamala Harris of New Jersey' as election slides into home stretch",
    "description": "New Jersey Democratic gubernatorial candidate Rep. Mikie Sherrill is facing criticisms that she is the \"Kamala Harris of New Jersey\" as the Garden State enters its final leg of an election cycle that will either flip it red or elect a likely next star for the…",
    "link": "https://freerepublic.com/focus/f-news/4343850/posts",
    "timestamp": "2025-10-02T03:24:58Z"
  },
  {
    "title": "Leaked document sheds light on possible future Gaza governance",
    "description": "A leaked document reveals details on how the authority charged with governing and rebuilding the Gaza Strip could operate, and how it could be structured.",
    "link": "https://www.abc.net.au/news/2025-10-02/leaked-document-reveals-details-of-trump-peace-plan/105839640",
    "timestamp": "2025-10-02T03:23:38Z"
  },
  {
    "title": "Trump jeopardising US role as scientific leader: Nobel officials",
    "description": "Donald Trump’s assault on science could threaten the United States’ position as the world’s leading research nation and have knock-on effects worldwide, Nobel Prize officials in Sweden told AFP. Since taking office in January, the US president has cut billion…",
    "link": "https://www.digitaljournal.com/world/trump-jeopardising-us-role-as-scientific-leader-nobel-officials/article",
    "timestamp": "2025-10-02T03:23:25Z"
  },
  {
    "title": "Deepfake political scam ads surge on Meta platforms, watchdog says",
    "description": "The ads have reached tens of thousands of the platforms' users.",
    "link": "https://www.japantimes.co.jp/news/2025/10/02/world/politics/us-deepfake-political-ads-meta/",
    "timestamp": "2025-10-02T03:12:00Z"
  },
  {
    "title": "DHS Adviser Warns ICE Agents Will Target Bad Bunny’s Super Bowl Halftime Show: ‘We Will Deport You’",
    "description": "\"We’re going to do enforcement everywhere. We are going to make Americans safe,\" the political commentator adds\nThe post DHS Adviser Warns ICE Agents Will Target Bad Bunny’s Super Bowl Halftime Show: ‘We Will Deport You’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bad-bunny-super-bowl-show-ice-target-dhs-adviser-says/",
    "timestamp": "2025-10-02T03:11:40Z"
  },
  {
    "title": "Billionaire populist eyes power in Czech vote but may need help from extremes",
    "description": "Andrej Babis has been taking notes from the US Maga movement but he may need to partner with ultra-nationalists.",
    "link": "https://www.bbc.com/news/articles/cly1pr8298vo",
    "timestamp": "2025-10-02T03:09:54Z"
  },
  {
    "title": "Wall Street closes higher, boosted by healthcare as investors shrug off jobs data, US shutdown",
    "description": "Wall Street indexes closed higher Wednesday, primarily boosted by the healthcare sector following Pfizer's drug price agreement with President Trump. Investors largely overlooked weaker private payrolls data and the ongoing U.S. government shutdown, demonstra…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-higher-boosted-by-healthcare-as-investors-shrug-off-jobs-data-us-shutdown/articleshow/124268479.cms",
    "timestamp": "2025-10-02T03:06:41Z"
  },
  {
    "title": "Trump Wants Nobel But 'Forgotten' Peacemakers More Likely, Experts Say",
    "description": "US President Donald Trump has made it clear he wants the Nobel Peace Prize when it is announced next week but experts predict he has little chance against those toiling on forgotten causes outside the limelight.",
    "link": "https://www.ibtimes.com/trump-wants-nobel-forgotten-peacemakers-more-likely-experts-say-3785181",
    "timestamp": "2025-10-02T03:06:15Z"
  },
  {
    "title": "Trump Wants Nobel But 'Forgotten' Peacemakers More Likely, Experts Say",
    "description": "US President Donald Trump has made it clear he wants the Nobel Peace Prize when it is announced next week but experts predict he has little chance against those toiling on forgotten causes outside the limelight.",
    "link": "https://www.ibtimes.com.au/trump-wants-nobel-forgotten-peacemakers-more-likely-experts-say-1860679",
    "timestamp": "2025-10-02T03:06:09Z"
  },
  {
    "title": "Kroger Recall Update—Health Hazard Warning Issued For Products in 17 States - NewsBreak",
    "description": "Kroger Recall Update—Health Hazard Warning Issued For Products in 17 States - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4266830998565-kroger-recall-update-health-hazard-warning-issued-for-products-in-17-states?s=a2&amp;share_destination_id=MjEwNDc4MjM2LTE3NTkzNzQxMDAzNDk%3D&amp;pd=0EF90GEx&amp;hl=en_US&amp;send_time=1759374100&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.38.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-02T03:04:21Z"
  },
  {
    "title": "Jane Fonda relaunches free speech committee founded by her father after Jimmy Kimmel suspension",
    "description": "Fonda’s initiative has already garnered support from more than 550 celebrities, including Pedro Pascal, Whoopi Goldberg, and Billie Eilish",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/jane-fonda-committee-first-amendment-mccarthyism-jimmy-kimmel-b2837731.html",
    "timestamp": "2025-10-02T03:03:55Z"
  },
  {
    "title": "Mike Johnson Caught on Camera Admitting Trump Is ‘Unwell’",
    "description": "New footage has emerged of Democratic Rep. Madeleine Dean’s Capitol Hill confrontation with Mike Johnson that shows the House Speaker seemingly agreeing that...",
    "link": "https://www.thedailybeast.com/mike-johnson-caught-on-camera-admitting-trump-is-unwell/",
    "timestamp": "2025-10-02T03:03:18Z"
  },
  {
    "title": "Trump wants Nobel but ‘forgotten’ peacemakers more likely, experts say",
    "description": "US President Donald Trump has made it clear he wants the Nobel Peace Prize when it is announced next week but experts predict he has little chance against those toiling on forgotten causes outside the limelight. The prestigious prize will be announced on Frid…",
    "link": "https://www.digitaljournal.com/world/trump-wants-nobel-but-forgotten-peacemakers-more-likely-experts-say/article",
    "timestamp": "2025-10-02T03:02:20Z"
  },
  {
    "title": "Trump Is Surging Federal Law Enforcement To Memphis As He Expands Deployments In More Cities",
    "description": "It adds to his efforts to send troops to Portland and Washington D.C.",
    "link": "https://www.huffpost.com/entry/ap-us-federal-crackdown_n_68dde78be4b028d81f305996",
    "timestamp": "2025-10-02T03:01:48Z"
  },
  {
    "title": "World Liberty Financial’s (WLFI) Roadmap: A Debit Card And Tokenized Assets On The Horizon",
    "description": "The Trump family’s decentralized finance (DeFi) platform, World Liberty Financial (WLFI), is poised to introduce two new products aimed at investors, capitalizing on the fast-growing sector of tokenization and a new debit card solution.  World Liberty Financi…",
    "link": "https://bitcoinist.com/world-liberty-financial-debit-card-tokenized-assets/",
    "timestamp": "2025-10-02T03:00:02Z"
  },
  {
    "title": "Bitcoin Weak-Hand Selling Slows: STH-SOPR Reset Hints At Potential Rally Setup",
    "description": "Bitcoin (BTC) witnessed a slight surge earlier today, climbing from $113,000 to around $117,000 at the time of writing, in contrast to expectations of several crypto analysts who were predicting a decline in risk-on assets due to the US government shutdown. B…",
    "link": "http://www.newsbtc.com/bitcoin-news/bitcoin-weak-hand-selling-slows-sth-sopr-reset-hints-at-potential-rally-setup/",
    "timestamp": "2025-10-02T03:00:00Z"
  },
  {
    "title": "Trump signs an executive order vowing to defend Qatar in the wake of Israel’s strike",
    "description": "DUBAI, United Arab Emirates (AP) — U.S. President Donald Trump has signed an executive order vowing to use all measures including U.S. military action to defend the energy-rich nation of Qatar — though it remains unclear just what weight the pledge will carry…",
    "link": "https://freerepublic.com/focus/f-news/4343844/posts",
    "timestamp": "2025-10-02T02:58:22Z"
  },
  {
    "title": "Deepfake political scam ads surge on Meta platforms, watchdog says",
    "description": "Scammers are among the top political ad spenders on Meta’s platforms, using deepfake videos of American politicians — including President Donald Trump — to promote fake government benefits, a watchdog group said Wednesday. The nonprofit Tech Transparency Proj…",
    "link": "https://www.digitaljournal.com/world/deepfake-political-scam-ads-surge-on-meta-platforms-watchdog-says/article",
    "timestamp": "2025-10-02T02:57:49Z"
  },
  {
    "title": "White House freezes funds for Democratic states in shutdown slap",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump's administration on Wednesday froze $26 billion for Democratic-leaning states, following through on a...",
    "link": "https://www.yahoo.com/news/articles/white-house-freezes-funds-democratic-025723802.html",
    "timestamp": "2025-10-02T02:57:23Z"
  },
  {
    "title": "Deepfake Political Scam Ads Surge On Meta Platforms, Watchdog Says",
    "description": "Scammers are among the top political ad spenders on Meta's platforms, using deepfake videos of American politicians -- including President Donald Trump -- to promote fake government benefits, a watchdog group said Wednesday.",
    "link": "https://www.ibtimes.com/deepfake-political-scam-ads-surge-meta-platforms-watchdog-says-3785176",
    "timestamp": "2025-10-02T02:57:15Z"
  },
  {
    "title": "Deepfake political scam ads surge on Meta platforms, watchdog says",
    "description": "Scammers are among the top political ad spenders on Meta's platforms, using deepfake videos of American politicians -- including President Donald Trump -- to...",
    "link": "https://www.yahoo.com/news/articles/deepfake-political-scam-ads-surge-025241482.html",
    "timestamp": "2025-10-02T02:52:41Z"
  },
  {
    "title": "Hydroxychloroquine and medbeds",
    "description": "Trump has found a brand new way to discourage his fans, particularly elderly ones, to seek out actual healthcare while also giving them false hope: “I know in my heart that med beds [sic] are real,” a woman named Pam wrote recently on Truth Social, the social…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/hydroxychloroquine-and-medbeds",
    "timestamp": "2025-10-02T02:52:08Z"
  },
  {
    "title": "Umno leaders condemn Israel’s interception of Global Sumud Flotilla",
    "description": "PETALING JAYA: The interception of the Gaza-bound Global Sumud Flotilla aid mission is an inhumane act, says Datuk Seri Dr Ahmad Zahid Hamidi. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/02/umno-leaders-condemn-israels-interception-of-global-sumud-flotilla",
    "timestamp": "2025-10-02T02:50:00Z"
  },
  {
    "title": "What Is The Real Reason? Why Have Hundreds Of Generals And Admirals Suddenly Been Summoned For A Mysterious Meeting In Virginia?",
    "description": "An “unprecedented” gathering of generals and admirals will be happening in Virginia next week, and the purpose of the meeting is a huge mystery.  This has sparked a frenzy of speculation on social media, but we still aren’t getting any answers.  Hopefully we …",
    "link": "https://www.activistpost.com/what-is-the-real-reason-why-have-hundreds-of-generals-and-admirals-suddenly-been-summoned-for-a-mysterious-meeting-in-virginia/",
    "timestamp": "2025-10-02T02:49:00Z"
  },
  {
    "title": "Gov. Moore calls on President Trump to end government shutdown",
    "description": "Governor Wes Moore delivered a gubernatorial address Wednesday night as we near the end of day one of the government shutdown",
    "link": "https://www.wbaltv.com/article/gov-moore-calls-on-president-trump-end-government-shutdown/68162232",
    "timestamp": "2025-10-02T02:45:20Z"
  },
  {
    "title": "Retired 4-Star General Shreds Trump For Wanting To Misuse This 'National Treasure'",
    "description": "Barry McCaffrey took on the president for entertaining an idea that's \"against American values.\"",
    "link": "https://www.huffpost.com/entry/barry-mccaffrey-trump-deploy-federal-troops-cities_n_68ddc9e7e4b0c450ba651030",
    "timestamp": "2025-10-02T02:44:55Z"
  },
  {
    "title": "Randi Weingarten prioritizes far-left politics — and selling books — over students’ tests scores",
    "description": "Randi Weingarten has taken to wearing a paper clip on her lapel as a ­bizarre symbol of her ­crusade against “fascism,” aka Donald Trump.",
    "link": "https://nypost.com/2025/10/01/opinion/randi-weingarten-prioritizes-far-left-politics-over-students-tests-scores/",
    "timestamp": "2025-10-02T02:43:45Z"
  },
  {
    "title": "White House sets hiring, foreign enrolment terms for colleges to get funding advantage: Report",
    "description": "Trump administration asked US colleges to sign a deal. This accord offers federal funds for specific terms. Nine schools received initial requests. Terms include banning race or sex in hiring and admissions. Tuition freeze for five years is also required. Int…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-sets-hiring-foreign-enrolment-terms-for-colleges-to-get-funding-advantage-report/articleshow/124268312.cms",
    "timestamp": "2025-10-02T02:43:36Z"
  },
  {
    "title": "Supreme Court rules Lisa Cook can stay in Federal Reserve role for now",
    "description": "Supreme Court lets Lisa Cook stay at Federal Reserve for now\nThe US Supreme Court has ruled Lisa Cook can stay on as a Federal Reserve governor for now, a setback for President Donald Trump in his fight with the central bank.\nIn an unsigned order, the court t…",
    "link": "https://biztoc.com/x/24de34ea10052f25",
    "timestamp": "2025-10-02T02:43:04Z"
  },
  {
    "title": "Albanese’s long and winding road to backing Trump and Blair on Gaza",
    "description": "Albanese and Blair were on opposite sides of the Iraq War debate, while Trump supported the invasion. This week, they landed on the same page. \nThe post Albanese’s long and winding road to backing Trump and Blair on Gaza appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/10/02/albaneses-backing-trump-blair-gaza-history/",
    "timestamp": "2025-10-02T02:41:51Z"
  },
  {
    "title": "U.S. to give Ukraine intelligence on long-range energy targets in Russia",
    "description": "The U.S. is also asking NATO allies to provide similar support.",
    "link": "https://www.japantimes.co.jp/news/2025/10/02/world/us-intelligence-russia-targets-ukraine/",
    "timestamp": "2025-10-02T02:31:00Z"
  },
  {
    "title": "The Michigan church shooting sits within a long history of hatred against Mormons in America",
    "description": "Sunday’s attack on worshippers at an LDS church exposes, once more, the lingering animosity Mormons receive from both sides of the political spectrum.",
    "link": "https://theconversation.com/the-michigan-church-shooting-sits-within-a-long-history-of-hatred-against-mormons-in-america-266481",
    "timestamp": "2025-10-02T02:29:49Z"
  },
  {
    "title": "US to give Ukraine intelligence on long-range energy targets in Russia",
    "description": "WASHINGTON (Reuters) -The United States will provide Ukraine with intelligence on long-range energy infrastructure targets within Russia, two officials told ...",
    "link": "https://www.yahoo.com/news/articles/us-ukraine-intelligence-long-range-022644545.html",
    "timestamp": "2025-10-02T02:26:44Z"
  },
  {
    "title": "US to provide Ukraine with intelligence for long-range strikes in Russia, WSJ reports",
    "description": "The U.S. will provide Ukraine with intelligence for long-range missile strikes on Russia's energy infrastructure, aiming to deprive the Kremlin of revenue. This development coincides with U.S. consideration of sending Tomahawk missiles and ongoing pressure on…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-to-provide-ukraine-with-intelligence-for-long-range-strikes-in-russia-wsj-reports/articleshow/124268136.cms",
    "timestamp": "2025-10-02T02:18:39Z"
  },
  {
    "title": "White House sets hiring, foreign enrolment terms for colleges to get funding advantage: Report",
    "description": "WASHINGTON: President Donald Trump's administration has asked US colleges to sign a deal on certain terms to get preferential access to federal funds, the Wall Street Journal reported late on Wednesday (Oct 1), citing a 10-point memo.An initial round of nine …",
    "link": "https://www.channelnewsasia.com/world/white-house-sets-hiring-foreign-enrolment-terms-colleges-get-funding-advantage-report-5381031",
    "timestamp": "2025-10-02T02:09:25Z"
  },
  {
    "title": "US shutdown: Donald Trump is the danger man during the shutdown",
    "description": "Past US shutdowns have been brief and had only minor impacts on the economy and markets. This time could be very different.",
    "link": "https://www.smh.com.au/business/markets/trump-is-the-dangerous-wildcard-in-america-s-shutdown-20251002-p5mzh6.html",
    "timestamp": "2025-10-02T02:04:13Z"
  },
  {
    "title": "Federal judge criticizes Donald Trump over free speech in landmark student protester ruling",
    "description": "US District Judge William Young ruled that foreign students targeted for pro-Palestinian activism are protected under the First Amendment. The decision criticized high-level Trump administration officials for orchestrating actions to intimidate and deport stu…",
    "link": "https://timesofindia.indiatimes.com/education/news/federal-judge-criticizes-donald-trump-over-free-speech-in-landmark-student-protester-ruling/articleshow/124268024.cms",
    "timestamp": "2025-10-02T02:00:21Z"
  },
  {
    "title": "Deep Breath! Trump Bails Out Coal Industry",
    "description": "On the heels of reporting that the US Department of Energy banned staff from using \"climate change\" and related terms, the DOE on Monday announced a $625 million investment \"to expand and reinvigorate America's coal industry,\" which was swiftly panned by clim…",
    "link": "https://crooksandliars.com/2025/10/deep-breath-trump-bails-out-coal-industry",
    "timestamp": "2025-10-02T02:00:01Z"
  }
]