[
  {
    "title": "Ripple, SEC File to Suspend Appeals Pending ‘Negotiated Resolution’ of Case",
    "description": "News of the case's pending resolution may be priced in, with the price of XRP holding steady following the agreement-in-principle.",
    "link": "https://decrypt.co/314482/ripple-sec-file-to-suspend-appeals-pending-negotiated-resolution-of-case",
    "timestamp": "2025-04-11T10:12:29Z"
  },
  {
    "title": "Trump envoy Witkoff in Russia on third visit: state media",
    "description": "US envoy Steve Witkoff was in Russia on Friday, the Kremlin said, his third visit to the country as Washington pushes for a ceasefire in Ukraine. US leader Donald Trump is pressing Moscow and Kyiv to end the more than three-year-long conflict, but has express…",
    "link": "https://www.digitaljournal.com/world/trump-envoy-witkoff-in-russia-on-third-visit-state-media/article",
    "timestamp": "2025-04-11T10:12:20Z"
  },
  {
    "title": "Trump Envoy Witkoff In Russia On Third Visit: State Media",
    "description": "US envoy Steve Witkoff was in Russia on Friday, the Kremlin said, his third visit to the country as Washington pushes for a ceasefire in Ukraine.",
    "link": "https://www.ibtimes.com/trump-envoy-witkoff-russia-third-visit-state-media-3769727",
    "timestamp": "2025-04-11T10:12:12Z"
  },
  {
    "title": "How TikTok's parent, ByteDance, became an AI powerhouse",
    "description": "ByteDance is also using the data as the linchpin of a growing business in artificial intelligence. The company has invested billions of dollars in the infrastructure needed to power AI systems, building vast data centers in China and Southeast Asia and buying…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/how-tiktoks-parent-bytedance-became-an-ai-powerhouse/articleshow/120203738.cms",
    "timestamp": "2025-04-11T10:10:59Z"
  },
  {
    "title": "US fires Greenland military base chief for 'undermining' JD Vance",
    "description": "The US military said it had lost confidence in Colonel Susannah Meyers' ability to lead.",
    "link": "https://www.bbc.co.uk/news/articles/creq99l218do",
    "timestamp": "2025-04-11T10:08:38Z"
  },
  {
    "title": "Space startups face uncertainty as US cuts federal spending, report says",
    "description": "U.S. federal budget cuts have started to have some early impact on space startups after funding for such companies dropped 12.5 per cent in the first quarter, according to investment firm Seraphim Space.Elon Musk-led Department of Government Efficiency and th…",
    "link": "https://www.channelnewsasia.com/business/space-startups-face-uncertainty-us-cuts-federal-spending-report-says-5059746",
    "timestamp": "2025-04-11T10:07:34Z"
  },
  {
    "title": "Blue State Blues: The Case for a ‘Christmas Truce’ in China Trade War",
    "description": "A “Christmas truce” — extending the 90-day pause to tariffs on China, to fill Christmas orders — could be a timely, essential respite.\nThe post Blue State Blues: The Case for a ‘Christmas Truce’ in China Trade War appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/04/11/blue-state-blues-the-case-for-a-christmas-truce-in-china-trade-war/",
    "timestamp": "2025-04-11T10:07:07Z"
  },
  {
    "title": "OPEC output hikes, trade wars have US oil producers wary of 'drill baby drill'",
    "description": "President Donald Trump moved on his first day in office to increase U.S. oil and gas production, but the country's oil industry is actually starting to think...",
    "link": "https://finance.yahoo.com/news/opec-output-hikes-trade-wars-100529051.html",
    "timestamp": "2025-04-11T10:05:29Z"
  },
  {
    "title": "Desperate China Pleads with E.U. to 'Jointly Resist Unilateral Bullying' of Trump Tariffs",
    "description": "An increasingly desperate China on Friday pleaded with European Union (E.U.) members to join with Beijing in resisting \"unilateral bullying\" posed by punitive tariffs introduced by U.S. President Donald Trump.\nThe post Desperate China Pleads with E.U. to ‘Joi…",
    "link": "https://www.breitbart.com/europe/2025/04/11/desperate-china-pleads-with-e-u-to-jointly-resist-unilateral-bullying-of-trump-tariffs/",
    "timestamp": "2025-04-11T10:05:17Z"
  },
  {
    "title": "Talent and data hold possibilities for India in global tech landscape: External Affairs Minister S. Jaishankar",
    "description": "External Affairs Minister S. Jaishankar said at the Global Technology Summit that talent and data hold possibilities for India in the global tech landscape.\nThe post Talent and data hold possibilities for India in global tech landscape: External Affairs Minis…",
    "link": "https://www.medianama.com/2025/04/223-talent-data-possibilities-india-external-affairs-minister-s-jaishankar/",
    "timestamp": "2025-04-11T10:04:48Z"
  },
  {
    "title": "Trump's Life's Work Culminates in Confronting Communist China | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn Wednesday, President Donald Trump abruptly announced a 90-day pause on most of his planned country-specific \"reciprocal\" tariffs—with the notable exception of the People's Republic of China. In so strikingl…",
    "link": "https://biztoc.com/x/01febe3324ea94c5",
    "timestamp": "2025-04-11T10:04:20Z"
  },
  {
    "title": "Trump Floats Plan for Undocumented to Work Legally",
    "description": "“President Donald Trump suggested at a Cabinet meeting Thursday that undocumented people working on farms and in hotels would be allowed to leave the country and return as legal workers if their employers vouched for",
    "link": "https://politicalwire.com/2025/04/11/trump-floats-plan-for-undocumented-to-work-legally/",
    "timestamp": "2025-04-11T10:03:34Z"
  },
  {
    "title": "Terence Corcoran: Mark Carney’s plan for ‘superpower’ Canada tricks voters",
    "description": "Terence Corcoran: What pollsters don't ask is whether Canadians have any clue about energy and environment policies. Find out more",
    "link": "https://financialpost.com/opinion/terence-corcoran-mark-carneys-plan-for-superpower-canada-tricks-voters",
    "timestamp": "2025-04-11T10:00:59Z"
  },
  {
    "title": "Trump brags in Oval Office that his billionaire pals made a killing in stocks after he pulled the plug on tariffs (Mary Papenfuss/The Independent)",
    "description": "Mary Papenfuss / The Independent:\nTrump brags in Oval Office that his billionaire pals made a killing in stocks after he pulled the plug on tariffs  —  President Donald Trump gleefully recounted how much money his billionaire pals made on the stock market aft…",
    "link": "https://www.memeorandum.com/250411/p9",
    "timestamp": "2025-04-11T10:00:57Z"
  },
  {
    "title": "Trump's got Iran cornered by following Reagan's doctrine",
    "description": "Trump’s Iran policy has mirrored Reagan’s doctrine in countering the Soviets. Like the former president, Trump has consistently increased his leverage against Tehran.",
    "link": "https://www.foxnews.com/opinion/trumps-got-iran-cornered-following-reagans-doctrine",
    "timestamp": "2025-04-11T10:00:52Z"
  },
  {
    "title": "Opinion: What to do if Trump doesn’t back off on Canada tariffs",
    "description": "There’s a chance Trump may eventually backtrack on all this, but we need to plan on the assumption he doesn’t. Read more",
    "link": "https://financialpost.com/opinion/opinion-what-to-do-if-trump-doesnt-back-off-on-canada-tariffs",
    "timestamp": "2025-04-11T10:00:43Z"
  },
  {
    "title": "The response to Trump's tariffs sends a clear warning to his party",
    "description": "President Donald Trump hoped to use tariffs to reset the global economy, but instead he just showed why the current system works.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-trade-economy-stock-market-rcna200416",
    "timestamp": "2025-04-11T10:00:40Z"
  },
  {
    "title": "Trump Threatens to Imprison Critics — and Bondi Might Do It",
    "description": "Now that Trump has called for criminal investigations into his critics Chris Krebs and Miles Taylor, will Pam Bondi cross the line that even Bill Barr, her crooked predecessor, would not?",
    "link": "http://nymag.com/intelligencer/article/trump-pam-bondi-doj-criminal-investigation-chris-krebs-miles-taylor.html",
    "timestamp": "2025-04-11T10:00:08Z"
  },
  {
    "title": "Trump's Life's Work Culminates in Confronting Communist China | Opinion",
    "description": "For far too long, elites have led America to disaster when it comes to trade with China.",
    "link": "https://www.newsweek.com/trumps-lifes-work-culminates-confronting-communist-china-opinion-2058351",
    "timestamp": "2025-04-11T10:00:03Z"
  },
  {
    "title": "Trump's tariffs still include 10% duty on imports from uninhabited, penguin-filled islands",
    "description": "Even though no humans live on the Heard and McDonalds islands, the region faces 10% tariffs on foreign imports to the U.S. under Trump's plan.",
    "link": "https://www.snopes.com//fact-check/trump-tariffs-islands-penguins/",
    "timestamp": "2025-04-11T10:00:00Z"
  },
  {
    "title": "America's other checks and balances are still working on Trump",
    "description": "Bond traders managed to get the Trump administration to back down from a disastrous set of tariffs this week.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-pause-bond-market-rcna200659",
    "timestamp": "2025-04-11T10:00:00Z"
  },
  {
    "title": "Trump Is Already Undermining the Next Election",
    "description": "And the one after that, and the one after that.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/trump-election-rules-changes/682394/",
    "timestamp": "2025-04-11T10:00:00Z"
  },
  {
    "title": "The Mystery of ICE’s Unidentifiable Arrests",
    "description": "In early March, ICE announced that it had arrested forty-eight people in New Mexico—a month later, their identities and whereabouts remain unknown, writes Jonathan Blitzer.",
    "link": "https://www.newyorker.com/news/the-lede/the-mystery-of-ices-unidentifiable-arrests",
    "timestamp": "2025-04-11T10:00:00Z"
  },
  {
    "title": "Elizabeth Warren Is Trying to Stop “The Dumbest Financial Crisis Ever”",
    "description": "John Cassidy on the Massachusetts senator Elizabeth Warren’s steadfast resistance to the Trump Administration’s efforts to levy tariffs and to decimate the federal workforce without input from Congress.",
    "link": "https://www.newyorker.com/news/the-financial-page/elizabeth-warren-is-trying-to-stop-the-dumbest-financial-crisis-ever",
    "timestamp": "2025-04-11T10:00:00Z"
  },
  {
    "title": "“The Handmaid’s Tale” Reflects the Exhaustion of Liberal Feminism",
    "description": "Moira Donegan reviews the sixth and final season of Hulu’s “The Handmaid’s Tale,” starring Elisabeth Moss and based on the novel by Margaret Atwood.",
    "link": "https://www.newyorker.com/culture/on-television/the-handmaids-tale-reflects-the-exhaustion-of-liberal-feminism",
    "timestamp": "2025-04-11T10:00:00Z"
  },
  {
    "title": "Democrats Are Embracing AI for the Dumbest Possible Reason",
    "description": "Donald Trump wants to save the coal industry. Earlier this week, he signed a rash of executive orders to reopen shuttered coal plants, subsidize unprofitable ones, and—through legally dubious means—tear up regulations that “discriminate” against coal at every…",
    "link": "https://newrepublic.com/article/193870/democrats-ai-china-data-centers",
    "timestamp": "2025-04-11T10:00:00Z"
  },
  {
    "title": "China issued defiant statement to Donald Trump after US raised tariffs to 145%",
    "description": "Chinese officials have issued a defiant statement to Donald Trump amid the ongoing trade war between China and the USA.",
    "link": "https://www.ladbible.com/news/world-news/trump-china-145-tariff-latest-917307-20250411",
    "timestamp": "2025-04-11T09:58:48Z"
  },
  {
    "title": "Real Wolf of Wall Street Jordan Belfort defends Donald Trump over 'get rich warning' he sent out to Americans",
    "description": "Financial criminal and former stockbroker Jordan Belfort has said there's nothing 'overly suspicious' about what Donald Trump said.",
    "link": "https://www.ladbible.com/news/us-news/jordan-belfort-donald-trump-tariff-get-rich-stock-441673-20250411",
    "timestamp": "2025-04-11T09:58:38Z"
  },
  {
    "title": "Trump picks friend and Miami businessman as antisemitism envoy",
    "description": "The announcement on Truth Social Thursday night elicited a wave of antisemitic comments",
    "link": "https://www.jewishnews.co.uk/trump-picks-friend-and-miami-businessman-as-antisemitism-envoy/",
    "timestamp": "2025-04-11T09:58:02Z"
  },
  {
    "title": "Trans fencer no longer on college team after cis opponent refused to play her",
    "description": "A transgender fencer was thrust into the public eye after a cis opponent refused to play a match against her is no longer on Wagner College’s women’s team. Wagner College has confirmed to Fox News Digital that Redmond Sullivan is no longer part of the team, a…",
    "link": "https://www.thepinknews.com/2025/04/11/trans-fencer-redmond-sullivan-wagner-college/",
    "timestamp": "2025-04-11T09:56:28Z"
  },
  {
    "title": "More Trump Punishment of the Poors: HHS Eliminates Office That Sets Poverty Levels Tied to Benefits for 80 Million People",
    "description": "Yet another Trump gutting of a whole swathe of programs, here by eliminating the experts who knew how to determine poverty thresholds.",
    "link": "https://www.nakedcapitalism.com/2025/04/more-trump-punishment-of-the-poors-hhs-eliminates-office-that-sets-poverty-levels-tied-to-benefits-for-80-million-people.html",
    "timestamp": "2025-04-11T09:55:28Z"
  },
  {
    "title": "The consumer tariff tax is here. Coffee shops are starting to raise prices.",
    "description": "The coffee industry is reeling from Trump's tariffs, and some cafes and importers are already starting to bump up their beans' pricetags.",
    "link": "https://www.businessinsider.com/coffee-shops-raise-prices-trump-tariffs-2025-4",
    "timestamp": "2025-04-11T09:55:02Z"
  },
  {
    "title": "Think You’re Smarter Than a Slate Senior Editor? Find Out With This Week’s News Quiz.",
    "description": "Test your knowledge of this week’s big stories.",
    "link": "https://slate.com/news-and-politics/2025/04/slate-news-quiz-tariffs-migrants-ncaa-tournament.html",
    "timestamp": "2025-04-11T09:55:00Z"
  },
  {
    "title": "Coal: What's the big deal?",
    "description": "Coal has fueled industrialization — and climate change. Some countries are well into phasing it out, but US President Donald Trump wants to boost production. Why this is not a good idea.",
    "link": "https://www.dw.com/en/coal-whats-the-big-deal/a-72199625",
    "timestamp": "2025-04-11T09:55:00Z"
  },
  {
    "title": "Trump Envoy Witkoff Again Flies to Russia For Putin Meeting, Rapprochement Talks",
    "description": "A new round of U.S.-Russia talks reportedly starting on Friday with an in-person discussion with President Vladimir Putin.\nThe post Trump Envoy Witkoff Again Flies to Russia For Putin Meeting, Rapprochement Talks appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/04/11/trump-envoy-witkoff-again-flies-to-russia-for-putin-meeting/",
    "timestamp": "2025-04-11T09:54:00Z"
  },
  {
    "title": "Trump's 25% Tariffs Could Cost Auto Companies $108 Billion: Report",
    "description": "The Trump administration announced a 90-day halt on most tariffs, sending global stocks on the rise after a period of uncertainty. However, U.S. President Donald Trump has refused to implement a halt on the 25% Tariffs on the automotive sector, much to the cr…",
    "link": "https://biztoc.com/x/cadd452ad1db6b9a",
    "timestamp": "2025-04-11T09:52:56Z"
  },
  {
    "title": "Hollywood's Box Office Blow: China Plans To \"Moderately Reduce\" US Film Releases",
    "description": "Hollywood's Box Office Blow: China Plans To \"Moderately Reduce\" US Film Releases\n \nPresident Donald Trump announced an increase in tariffs on Chinese goods to 125% on Wednesday, shortly after Beijing retaliated by raising tariffs on U.S. goods to 84%. As of T…",
    "link": "https://biztoc.com/x/eb5e866d0a6da44f",
    "timestamp": "2025-04-11T09:52:52Z"
  },
  {
    "title": "Xi wants EU-China tag team to resist Trump’s trade onslaught",
    "description": "Chinese leader met Spanish PM Pedro Sánchez, who also promoted closer ties with Beijing.",
    "link": "https://www.politico.eu/article/spain-pedro-sanchez-champions-china-key-eu-partner-amid-donald-trump-trade-war/",
    "timestamp": "2025-04-11T09:50:47Z"
  },
  {
    "title": "Bitcoin was born out of the 2008 financial crisis, will die in the 2025 crisis, says Peter Schiff",
    "description": "Peter Schiff reignites debate over Bitcoin's future, claiming the 2025 financial crisis may end what the 2008 crisis began. Amid rising tariffs and market volatility, Bitcoin fell 27% from its peak, even as gold prices held firm. Schiff criticized the U.S. St…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/bitcoin-was-born-out-of-the-2008-financial-crisis-will-die-in-the-2025-crisis-says-peter-schiff/articleshow/120202715.cms",
    "timestamp": "2025-04-11T09:50:38Z"
  },
  {
    "title": "Tulsi Gabbard's Intelligence Task Force Accused Of \"Witch Hunt\"",
    "description": "The top Democrat on the U.S. Senate&#039;s intelligence committee on Thursday said he suspected a task force formed by Director of National Intelligence Tulsi Gabbard was pursuing a &quot;witch hunt&quot; for intelligence officers it deems disloyal to Donald …",
    "link": "https://www.ndtv.com/world-news/tulsi-gabbards-intelligence-task-force-accused-of-witch-hunt-8139478",
    "timestamp": "2025-04-11T09:49:38Z"
  },
  {
    "title": "Tariff pause: A chance for the EU to come back stronger and more united",
    "description": "The reality that the US is no longer a trustworthy ally has sunk in, bringing members of the European Union closer. It may be tempting to align with China, but the EU should invest in its own security and industry. It’s also time to issue joint debt.",
    "link": "https://www.livemint.com/opinion/online-views/trump-tariffs-2025-us-eu-trade-war-china-eu-trade-tensions-trump-economic-policy-nato-spending-trump-eu-joint-debt-plan-11744364052737.html",
    "timestamp": "2025-04-11T09:49:03Z"
  },
  {
    "title": "Raoul Peck on His Cannes-Bound George Orwell Documentary and the Threat of Dictatorship: ‘Terror Comes Slowly’",
    "description": "Raoul Peck, who will be at the Cannes Film Festival next month with his George Orwell documentary, “Orwell: 2+2=5,” delivered a blistering warning about the global rise of autocracy this week at documentary festival Visions du Réel, where he is guest of honor…",
    "link": "https://variety.com/2025/film/global/raoul-peck-cannes-george-orwell-orwell-doc-threat-dictatorship-1236366913/",
    "timestamp": "2025-04-11T09:45:22Z"
  },
  {
    "title": "China retaliates by raising tariffs on US goods to 125%",
    "description": "China has announced countermeasures by raising tariffs on U.S. goods from 84% to 125% starting Saturday.",
    "link": "https://www.wcvb.com/article/china-raises-us-tariffs-trade-war/64453547",
    "timestamp": "2025-04-11T09:44:14Z"
  },
  {
    "title": "Senate confirms Trump nominee for chairman of Joint Chiefs of Staff in overnight vote",
    "description": "The Senate confirmed retired Air Force Lt. Gen. Dan “Razin” Caine to become the next chairman of the Joint Chiefs of Staff on Friday, filling the position almost two months after President Donald Trump fired his predecessor.",
    "link": "https://nypost.com/2025/04/11/us-news/senate-confirms-lt-gen-dan-caine-as-chairman-of-the-joint-chiefs-of-staff-in-late-night-vote/",
    "timestamp": "2025-04-11T09:43:37Z"
  },
  {
    "title": "Trump Becomes First President to Sign Crypto Bill Into Law, Ending Anti-DeFi IRS Rule",
    "description": "President Donald Trump signed his first crypto-related bill into law Thursday, formally eliminating a Biden-era IRS rule that would have required decentralized finance platforms to collect and report the same taxpayer information as traditional brokers.\nThe b…",
    "link": "https://biztoc.com/x/f3719cd3d4aaf849",
    "timestamp": "2025-04-11T09:42:11Z"
  },
  {
    "title": "AGOA: US-Africa Trade Accord Hangs In The Balance",
    "description": "The African Growth and Opportunity Act (AGOA), whose future is in doubt since Donald Trump returned to the White House, provides duty-free access to the United States for certain African products.",
    "link": "https://www.ibtimes.com/agoa-us-africa-trade-accord-hangs-balance-3769720",
    "timestamp": "2025-04-11T09:42:09Z"
  },
  {
    "title": "Trump threatens tariffs and sanctions on Mexico for ‘stealing’ water from Texas farmers",
    "description": "President Donald Trump threatened to impose tariffs, and possibly sanctions against Mexico, if it continues to rob South Texas farmers of Rio Grande water promised under a decades-old treaty. In a post on Truth Social on Thursday, Trump proclaimed that Mexico…",
    "link": "https://freerepublic.com/focus/f-chat/4310331/posts",
    "timestamp": "2025-04-11T09:39:52Z"
  },
  {
    "title": "Thailand vows crackdown on false caims of origin in US exports",
    "description": "Thailand will step up a crackdown on the practice of foreign companies circumventing high US tariffs by claiming false certificates of origin as it prepares for negotiations with the Trump administration to secure relief from a 36% tariff hit. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/04/11/thailand-vows-crackdown-on-false-caims-of-origin-in-us-exports",
    "timestamp": "2025-04-11T09:39:00Z"
  },
  {
    "title": "Panama deal allows US to deploy troops to canal",
    "description": "Panama City (AFP) April 11, 2025\n\n US troops will be able to deploy to a string of bases along the Panama Canal under a joint deal seen by AFP Thursday, a major concession to President Donald Trump as he seeks to reestablish influence over the vital waterway.…",
    "link": "https://www.spacewar.com/reports/Panama_deal_allows_US_to_deploy_troops_to_canal_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "Second US aircraft carrier has reached Middle East",
    "description": "Washington (AFP) April 10, 2025\n\n\n A second American aircraft carrier has reached the Middle East, where Washington's forces are carrying out near-daily air strikes against Yemen's Huthi rebels, the US military said on Thursday. \n\nThe USS Carl Vinson - which …",
    "link": "https://www.spacewar.com/reports/Second_US_aircraft_carrier_has_reached_Middle_East_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "Khamenei aide says Iran could expel UN nuclear inspectors ahead of US talks",
    "description": "Tehran (AFP) April 10, 2025\n\n\n A senior adviser to supreme leader Ayatollah Ali Khamenei warned Thursday that Iran could expel inspectors of the UN nuclear watchdog as \"threats\" multiply ahead of key talks with the United States. \n\nThe comments from Rear Admi…",
    "link": "https://www.spacewar.com/reports/Khamenei_aide_says_Iran_could_expel_UN_nuclear_inspectors_ahead_of_US_talks_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "Witkoff and Araghchi: the men leading US-Iran nuclear talks",
    "description": "Dubai (AFP) April 10, 2025\n\n\n US special envoy Steve Witkoff and Iran's Foreign Minister Abbas Araghchi will be in Oman for breakthrough talks on Tehran's nuclear programme this weekend. \n\nHere are short profiles of the two negotiators: \n\n- Witkoff: real esta…",
    "link": "https://www.spacewar.com/reports/Witkoff_and_Araghchi_the_men_leading_US-Iran_nuclear_talks_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "Europe holds fresh 'coalition of willing' talks on Ukraine",
    "description": "Brussels, Belgium (AFP) April 10, 2025\n\n\n European defence ministers held fresh talks Thursday on the potential deployment of troops to secure any Ukraine ceasefire, but there were more questions than answers as US peace efforts with Russia stall. \n\nBritain a…",
    "link": "https://www.spacewar.com/reports/Europe_holds_fresh_coalition_of_willing_talks_on_Ukraine_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "Iran says giving diplomacy 'genuine chance' in Oman talks with US",
    "description": "Tehran (AFP) April 11, 2025\n\n\n Iran said Friday it was giving diplomacy a \"genuine\" chance in nuclear talks with the United States despite mounting pressure from Washington, setting the stage for a showdown in Oman this weekend. \n\nLongtime adversaries Iran an…",
    "link": "https://www.spacewar.com/reports/Iran_says_giving_diplomacy_genuine_chance_in_Oman_talks_with_US_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "US Senate approves Trump's nominee for top military officer",
    "description": "Washington (AFP) April 11, 2025\n\n\n The US Senate approved Donald Trump's nominee to be the nation's top military officer on Friday after the president abruptly fired the previous chairman of the Joint Chiefs of Staff this year. \n\nLawmakers signed off on Dan C…",
    "link": "https://www.spacewar.com/reports/US_Senate_approves_Trumps_nominee_for_top_military_officer_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "Iran, US raise stakes ahead of key talks in Oman",
    "description": "Tehran (AFP) April 10, 2025\n\n\n Washington and Tehran waged a war of words Thursday ahead of key talks in Oman after US President Donald Trump said military action was \"absolutely\" possible if the talks fail. \n\nA senior adviser to supreme leader Ayatollah Ali …",
    "link": "https://www.spacewar.com/reports/Iran_US_raise_stakes_ahead_of_key_talks_in_Oman_999.html",
    "timestamp": "2025-04-11T09:38:03Z"
  },
  {
    "title": "China to raise tariffs on U.S. goods to 125% Saturday",
    "description": "China said Friday it would raise tariffs on US goods to 125 per cent but would ignore further levies by President Donald Trump because it no longer makes economic sense for importers to buy from America. After a week of market mayhem as the world’s two larges…",
    "link": "https://punchng.com/china-to-raise-tariffs-on-u-s-goods-to-125-saturday/",
    "timestamp": "2025-04-11T09:37:46Z"
  },
  {
    "title": "UK’s unexpected economic rebound boosts govt amid Trump tariffs",
    "description": "Britain’s economy grew far more than expected in February, official data showed Friday, in a rare piece of good news for the Labour government as it grapples with unpredictable US tariffs. Gross domestic product rose 0.5 percent in the month, rebounding from …",
    "link": "https://www.digitaljournal.com/world/uks-unexpected-economic-rebound-boosts-govt-amid-trump-tariffs/article",
    "timestamp": "2025-04-11T09:37:33Z"
  },
  {
    "title": "AGOA: US-Africa trade accord hangs in the balance",
    "description": "The African Growth and Opportunity Act (AGOA), whose future is in doubt since Donald Trump returned to the White House, provides duty-free access to the United States for certain African products. The accord is up for review in September and its disappearance…",
    "link": "https://www.digitaljournal.com/world/agoa-us-africa-trade-accord-hangs-in-the-balance/article",
    "timestamp": "2025-04-11T09:37:32Z"
  },
  {
    "title": "Greenpeace activists arrested after blood-red dye poured into US embassy pond",
    "description": "Twelve activists used disguised delivery bikes to tip 300 litres of red dye into the embassy pond in protest",
    "link": "https://www.jewishnews.co.uk/greenpeace-activists-arrested-after-blood-red-dye-poured-into-us-embassy-pond/",
    "timestamp": "2025-04-11T09:36:42Z"
  },
  {
    "title": "Susan Sontag and the US under Trump",
    "description": "Donald Trump's culture war has only just begun. What would American icon, Susan Sontag, have said about this? The thinker, who died in 2004, always intervened in political debates with a sharp tongue.",
    "link": "https://www.dw.com/en/susan-sontag-and-the-us-under-trump/a-72196637",
    "timestamp": "2025-04-11T09:35:00Z"
  },
  {
    "title": "Why Trump's War With China is Much Bigger Than Trade",
    "description": "The U.S.-China confrontation is about a global struggle for power and not only about trade.",
    "link": "https://www.newsweek.com/china-us-trade-tariffs-war-nuclear-trump-2058433",
    "timestamp": "2025-04-11T09:34:47Z"
  },
  {
    "title": "China hits back by raising tariffs on US goods from 84% to 125%",
    "description": "China announced countermeasures on Friday, raising tariffs on US goods from 84% to 125% starting Saturday.",
    "link": "https://nypost.com/2025/04/11/us-news/china-announces-countermeasures-by-raising-tariffs-on-us-goods-from-84-to-125-from-saturday/",
    "timestamp": "2025-04-11T09:33:30Z"
  },
  {
    "title": "\"Protecting Own Interests\": Trump Aide Hits Out At Elon Musk Over Tariffs",
    "description": "Not all&#039;s well at the White House after President Donald Trump announced reciprocal tariffs on almost all countries last week.",
    "link": "https://www.ndtv.com/world-news/protecting-own-interests-donald-trump-aide-hits-out-at-elon-musk-over-tariffs-8107146",
    "timestamp": "2025-04-11T09:33:12Z"
  },
  {
    "title": "Xi Jinping to visit South-East Asia as tariff war spurs China to strengthen ties",
    "description": "Foreign ministry confirms the Chinese leader will tour Vietnam, Malaysia and Cambodia in what will be his first foreign visits of the year Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/04/11/xi-jinping-to-visit-south-east-asia-as-tariff-war-spurs-china-to-strengthen-ties",
    "timestamp": "2025-04-11T09:33:00Z"
  },
  {
    "title": "SCOTUS Tells Trump: Bring MD Man Home From El Salvador Prison",
    "description": "The Supreme Court yesterday upheld a lower court order that the Trump administration must “facilitate” the return of Kilmar Abrego Garcia, the Maryland man who was forcibly and wrongly deported to El Salvador, where he is in a \"torture\" prison. The decision a…",
    "link": "https://crooksandliars.com/2025/04/scotus-trump-bring-maryland-man-home-el",
    "timestamp": "2025-04-11T09:32:55Z"
  },
  {
    "title": "Trump Deputies Cancel Illegal Migrants' Social Security Numbers",
    "description": "President Donald Trump's deputies are wiping up the Social Security Numbers that were given to illegal migrants by prior administrations. \nThe post Trump Deputies Cancel Illegal Migrants’ Social Security Numbers appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/04/11/trump-deputies-cancel-illegal-migrants-social-security-numbers/",
    "timestamp": "2025-04-11T09:32:10Z"
  },
  {
    "title": "US fires Greenland military base chief for 'undermining' Vance",
    "description": "The US military said it had lost confidence in Colonel Susannah Meyers' ability to lead.",
    "link": "https://www.bbc.com/news/articles/creq99l218do",
    "timestamp": "2025-04-11T09:31:58Z"
  },
  {
    "title": "No, Gas Prices Are Not Falling Under Donald Trump. They Are Actually Rising",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe White House has celebrated the recent sharp drop in gas prices across the country as a victory for the Trump administration, but American drivers are actually facing much higher prices at the pump now than…",
    "link": "https://biztoc.com/x/f12d61ff5bbd3742",
    "timestamp": "2025-04-11T09:31:13Z"
  },
  {
    "title": "Analyst Compares Trump’s Market Impact to Obama Era as Bitcoin Sees Momentum",
    "description": "Bitcoin is currently trading just above $80,000, following a brief rally to $83,000 yesterday that sparked renewed investor optimism. Despite the 4.1% gain over the past day, the asset remains more than 25% below its all-time high of over $109,000 set in Janu…",
    "link": "http://www.newsbtc.com/bitcoin-news/analyst-compares-trumps-market-impact-to-obama-era-as-bitcoin-sees-momentum/",
    "timestamp": "2025-04-11T09:30:34Z"
  },
  {
    "title": "Over 85% Of Bitcoin Holders Still In Profit Despite Tariff-Driven Correction – Resilience On Display",
    "description": "Yesterday, Bitcoin and the broader crypto market experienced a sharp bounce from recent lows after US President Donald Trump announced a 90-day pause on reciprocal tariffs for all countries except China, which remains under a steep 125% tariff. The news broug…",
    "link": "https://bitcoinist.com/over-85-of-bitcoin-holders-still-in-profit-despite-tariff-driven-correction-resilience-on-display/",
    "timestamp": "2025-04-11T09:30:22Z"
  },
  {
    "title": "Will JB Hunt's Earnings Drive Its Stock Up Or Down?",
    "description": "This compares to earnings of $1.22 per share on revenue of $2.94 billion in the same quarter last year.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/04/11/will-jb-hunts-earnings-drive-its-stock-up-or-down/",
    "timestamp": "2025-04-11T09:30:00Z"
  },
  {
    "title": "9 Ways You Can Save the Internet Right Now",
    "description": "Maria Bustillos\n\n\n\nBecause the danger to cultural preservation has never been greater.\r\n\n\r\n\n\nThe post 9 Ways You Can Save the Internet Right Now appeared first on The Nation.",
    "link": "https://www.thenation.com/article/culture/preserving-digital-culture-internet-archive/",
    "timestamp": "2025-04-11T09:30:00Z"
  },
  {
    "title": "Trump Tariffs Hit Mushroom Kingdom",
    "description": "A global giant like Nintendo can weather the worst of it. What about everyone else?",
    "link": "https://slate.com/podcasts/what-next-tbd/2025/04/the-nintendo-switch-2-launch-is-just-the-beginning",
    "timestamp": "2025-04-11T09:30:00Z"
  },
  {
    "title": "Treasuries Are Trading Like Risky Assets in Warning to Trump",
    "description": "(Bloomberg) -- Billed on Wall Street as so rock-solid safe they’re risk-free, US Treasury bonds have long served as first port of call for investors during...",
    "link": "https://finance.yahoo.com/news/treasuries-trading-risky-assets-warning-092955293.html",
    "timestamp": "2025-04-11T09:29:55Z"
  },
  {
    "title": "No, Gas Prices Are Not Falling Under Donald Trump. They Are Actually Rising",
    "description": "Yes, gas prices are now cheaper than they were in the last 3 years. But they are also up from where they were 3 months ago.",
    "link": "https://www.newsweek.com/gas-prices-not-falling-donald-trump-rising-2058407",
    "timestamp": "2025-04-11T09:26:37Z"
  },
  {
    "title": "EU, Beijing set to hold summit in China in July",
    "description": "BRUSSELS: Top EU officials and Chinese leaders are due to hold their next summit marking 50 years of ties in China in July, a spokesperson for the European Council said on Friday (Apr 11). The European Union had announced plans for a summit in January, before…",
    "link": "https://www.channelnewsasia.com/world/european-union-china-summit-july-2025-5059691",
    "timestamp": "2025-04-11T09:26:28Z"
  },
  {
    "title": "Howard Marks says Trump tariffs echo Brexit’s fallout, warns of recession risk",
    "description": "Howard Marks: Goldman Sachs now estimates a 45% chance of a U.S. recession, citing growing concerns over a potential full-scale trade war that has triggered a widespread selloff in equities and Treasuries. On Thursday, the S&P 500 dropped 3.5%, pulling the in…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/howard-marks-says-trump-tariffs-echo-brexits-fallout-warns-of-recession-risk/articleshow/120201946.cms",
    "timestamp": "2025-04-11T09:25:02Z"
  },
  {
    "title": "Conor McGregor’s REAL memecoin: Everything you need to know",
    "description": "What Is REAL? Conor McGregor’s staking-enabled memecoin explained \r\nConor McGregor, also known as “Notorious,” is an Irish mixed martial artist born in Dublin on July 14, 1988. He is renowned for his achievements in the Ultimate Fighting Championship (UFC), w…",
    "link": "https://cointelegraph.com/explained/conor-mcgregors-real-memecoin-everything-you-need-to-know",
    "timestamp": "2025-04-11T09:25:00Z"
  },
  {
    "title": "Gretchen Whitmer angers Dems with Trump meeting at White House: ‘F—ing disaster’",
    "description": "Michigan Gov. Gretchen Whitmer is under fire from fellow Democrats after appearing alongside President Donald Trump during a White House signing ceremony, sparking accusations that she was used as a political “prop.” “Just a f—ing disaster,” said one Democrat…",
    "link": "https://freerepublic.com/focus/f-chat/4310330/posts",
    "timestamp": "2025-04-11T09:24:14Z"
  },
  {
    "title": "China hits back at Trump's tariff hike with 125% duties on U.S. goods",
    "description": "Beijing on Friday increased its tariffs on U.S. imports to 125 per cent, hitting back against U.S. President Donald Trump's decision to hike duties on Chinese goods to 145 per cent, raising the stakes in a trade war that threatens to upend global supply chain…",
    "link": "https://www.cbc.ca/news/world/china-tariffs-us-trump-1.7507719",
    "timestamp": "2025-04-11T09:20:32Z"
  },
  {
    "title": "Trump signs resolution killing IRS DeFi broker rule",
    "description": "Update April 11, 1:46 am: This article has been updated to include more information and background on the resolution.\nUS President Donald Trump has signed a joint congressional resolution overturning a Biden administration-era rule that would have required de…",
    "link": "https://biztoc.com/x/09b53058b1d29402",
    "timestamp": "2025-04-11T09:20:13Z"
  },
  {
    "title": "JPMorgan analyst says he now tempers public comments on US tariffs",
    "description": "A JPMorgan Asset Management strategist, Michael Cembalest, revealed he's been cautious in his public statements about U.S. tariffs due to potential repercussions for his colleagues and the bank. He expressed concerns about the impact of fully expressing his v…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jpmorgan-analyst-says-he-now-tempers-public-comments-on-us-tariffs/articleshow/120201840.cms",
    "timestamp": "2025-04-11T09:20:12Z"
  },
  {
    "title": "Hollywood Becomes Collateral Damage In Trump Tariff War As China Slashes Film Imports, Says US Actions Will Inevitably Reduce 'Favorability' Towards American Films",
    "description": "China announced on Thursday it would immediately restrict Hollywood film imports in retaliation for President Donald Trump‘s tariff increases on Chinese goods, targeting a high-profile American export as trade tensions intensify.\nWhat Happened: A spokesperson…",
    "link": "https://biztoc.com/x/7c612deeb9febd7e",
    "timestamp": "2025-04-11T09:20:03Z"
  },
  {
    "title": "Ukraine updates: US envoy Witkoff arrives in Russia",
    "description": "US special envoy Steve Witkoff has arrived in Russia, where he is expected to meet with President Putin. Meanwhile, European defense ministers are meeting in Brussels at NATO headquarters. DW has more. US President Donald Trump's special envoy Steve Witkoff a…",
    "link": "https://www.dw.com/en/ukraine-updates-us-envoy-witkoff-arrives-in-russia/live-72212628",
    "timestamp": "2025-04-11T09:20:00Z"
  },
  {
    "title": "Pam Bondi Teases 'Huge Arrest' Over Tesla Attacks",
    "description": "The attorney general said anti-Elon Musk Tesla protesters would get 20-year jail sentences and that another arrest was on the way.",
    "link": "https://www.newsweek.com/pam-bondi-tesla-protest-arrest-elon-musk-2058422",
    "timestamp": "2025-04-11T09:19:50Z"
  },
  {
    "title": "Letitia James Hits Donald Trump With New Lawsuit",
    "description": "James aims to block the Trump administration from cutting funds that addressed the effects of the COVID-19 pandemic on students.",
    "link": "https://biztoc.com/x/0366efd109fe5965",
    "timestamp": "2025-04-11T09:19:48Z"
  },
  {
    "title": "EU, Beijing set to hold summit in China in July",
    "description": "Top EU officials and Chinese leaders are set to convene in China this July for a summit marking 50 years of diplomatic ties. Amidst global trade tensions and tariffs imposed by the US, Chinese President Xi Jinping has urged the EU to collaborate with Beijing …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-beijing-set-to-hold-summit-in-china-in-july/articleshow/120201817.cms",
    "timestamp": "2025-04-11T09:19:26Z"
  }
]