[
  {
    "title": "ICE is now the highest-funded law enforcement agency. That’s bad news for our democracy.",
    "description": "Ali Velshi explains how ICE’s boost in funding is transforming the agency into an alternative police force, loyal only to Trump and shielded from accountability.",
    "link": "https://www.msnbc.com/top-stories/latest/ice-recruitment-trump-police-force-rcna224319",
    "timestamp": "2025-08-11T19:50:54Z"
  },
  {
    "title": "EU hits back at Trump, Zelenskyy comments, no concessions in Ukraine before Putin ceasefire agreement",
    "description": "Trump and Putin set to meet Friday as European leaders stress Ukraine's territorial sovereignty must be respected in any peace negotiations.",
    "link": "https://www.foxnews.com/world/eu-hits-back-trump-zelenskyy-comments-no-concessions-ukraine-before-putin-ceasefire-agreement",
    "timestamp": "2025-08-11T19:49:35Z"
  },
  {
    "title": "After Ellen DeGeneres and Richard Gere, now Jimmy Kimmel could be next star to ditch US over Trump’s administration",
    "description": "Many Hollywood celebrities, including Ellen DeGeneres, Richard Gere, and Jimmy Kimmel, have expressed their dissatisfaction with the political climate under President Donald Trump. Some have even hinted at leaving the United States due to their concerns. Thes…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-ellen-degeneres-and-richard-gere-now-jimmy-kimmel-could-be-next-star-to-ditch-us-over-trumps-administration/articleshow/123244213.cms",
    "timestamp": "2025-08-11T19:48:58Z"
  },
  {
    "title": "Trump defends taking 15% cut of Nvidia, AMD chip sales to China",
    "description": "\"No, this is an old chip that China already has,\" Trump said of Nvidia's H-20 processor, adding that \"China already has it in a different form...\"",
    "link": "https://nypost.com/2025/08/11/business/trump-defends-taking-15-cut-of-nvidia-amd-chip-sales-to-china/",
    "timestamp": "2025-08-11T19:48:54Z"
  },
  {
    "title": "Trump calls for legislation to end no-cash bail in US cities as part of crime crackdown",
    "description": "SummaryTrump urges Congress to end no-cash bail policies US attorney for District of Columbia advocates charging more juveniles as adults Critics say cash bail reinforces racial and economic disparities and creates a two-tiered justice system WASHINGTON, Aug …",
    "link": "https://freerepublic.com/focus/f-news/4334007/posts",
    "timestamp": "2025-08-11T19:48:40Z"
  },
  {
    "title": "Smithsonian puts Trump's name back in museum's impeachment display - with changes",
    "description": "The National Museum of American History removed references to Donald Trump from an impeachment display in July. He has since been re-added, with some changes...",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/11/smithsonian-trump-impeachment-display-changes/85611633007/",
    "timestamp": "2025-08-11T19:48:15Z"
  },
  {
    "title": "Commentary: Trump is reviving crony capitalism",
    "description": "Nvidia, AMD, and other businesses seeking an edge are learning to do it Trump's way.",
    "link": "https://finance.yahoo.com/news/commentary-trump-is-reviving-crony-capitalism-194752762.html",
    "timestamp": "2025-08-11T19:47:52Z"
  },
  {
    "title": "D.C. Police Union Backs Trump's Move to Federalize City's Police",
    "description": "The Washington, DC, Police Union is backing President Donald Trump's call to take federal control of Washington, DC, due to rampant crime.\nThe post D.C. Police Union Backs Trump’s Move to Federalize City’s Police appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/11/d-c-police-union-backs-trumps-move-federalize-citys-police/",
    "timestamp": "2025-08-11T19:44:37Z"
  },
  {
    "title": "Tariff Rebate Checks Are a Bad, Inflationary Idea",
    "description": "President Donald Trump and his allies have spent months promising that higher tariffs will usher in a \"golden age\" of wealth and prosperity for America.\nNow, the administration and one of its biggest allies in Congress are pushing for a new round of stimulus …",
    "link": "https://biztoc.com/x/555f2d0e1bb401fd",
    "timestamp": "2025-08-11T19:42:06Z"
  },
  {
    "title": "Trump extends China tariff deadline by another 90 days",
    "description": "U.S. President Donald Trump has signed an executive order extending a tariff truce with China by another 90 days, a White House official said on Monday with only hours to go before U.S. tariffs on Chinese goods were due to snap back to triple-digit rates.\nThe…",
    "link": "https://biztoc.com/x/3dc385243e29a379",
    "timestamp": "2025-08-11T19:42:05Z"
  },
  {
    "title": "‘Gold will not be Tariffed!’ Trump says after prices spiked amid confusion over duties",
    "description": "US President Donald Trump said Monday that gold imports will not face additional tariffs, days after confusion flared on whether recent hikes applied to certain gold bars — threatening to upend global trade of the precious metal.\nTrump’s comments came after U…",
    "link": "https://biztoc.com/x/64f98f419f8941d2",
    "timestamp": "2025-08-11T19:42:01Z"
  },
  {
    "title": "‘We Stand With The President’: DC Police Union Backs Trump’s Capital City Crime Crackdown",
    "description": "The DC Police Union announced on Monday that it is backing President Donald Trump’s efforts to combat crime in Washington, D.C. The union in a statement to Fox5 said it “acknowledges and supports the President’s announcement … to assume temporary control of t…",
    "link": "https://dailycaller.com/2025/08/11/dc-police-union-trump-crime-crackdown/",
    "timestamp": "2025-08-11T19:41:43Z"
  },
  {
    "title": "Shouting match erupts between Trump and Netanyahu over Gaza starvation pics - here's what actually happened",
    "description": "Trump Netanyahu shouting match: A heated phone call erupted between President Trump and Prime Minister Netanyahu over the dire situation in Gaza. Trump challenged Netanyahu's denial of starvation, citing credible evidence of starving children. The disagreemen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/shouting-match-erupts-between-trump-and-netanyahu-over-gaza-starvation-pics-heres-what-actually-happened/articleshow/123244181.cms",
    "timestamp": "2025-08-11T19:41:08Z"
  },
  {
    "title": "Media Tells You To Stop Trusting Your Lying Eyes, But I Still Need To Wipe Blood Off",
    "description": "Those adamantly opposed to President Donald Trump’s plans for Washington, D.C. will cite statistics. It's no comfort to people who live in the city.",
    "link": "https://dailycaller.com/2025/08/11/donald-trump-washington-dc-crime-statistics-data-new-york-times-media-misleading/",
    "timestamp": "2025-08-11T19:40:38Z"
  },
  {
    "title": "Sh*tty Sidewalks, Broken Windows And Useless Cops: Three Stories That Sum Up DC’s Gnarly Crime Problem",
    "description": "In the wake of the savage attack on former DOGE staffer Edward Coristine, President Donald Trump announced Monday that he is deploying the National Guard.",
    "link": "https://dailycaller.com/2025/08/11/washington-dc-crime-carjackings-trump-federal-takeover-police-public-urinating-stories/",
    "timestamp": "2025-08-11T19:39:42Z"
  },
  {
    "title": "DC Mayor Fires Back at Trump Sending In Troops: ‘We’re at a 30-Year Violent Crime Low’",
    "description": "\"We have been able to reverse that 2023 crime spike. This year, crime isn't just down from 2023. It's also down from 2019, before the pandemic.\"\nThe post DC Mayor Fires Back at Trump Sending In Troops: ‘We’re at a 30-Year Violent Crime Low’ first appeared on …",
    "link": "https://www.mediaite.com/media/news/dc-mayor-fires-back-at-trump-sending-in-troops-were-at-a-30-year-violent-crime-low/",
    "timestamp": "2025-08-11T19:37:26Z"
  },
  {
    "title": "Disney adds to sports streaming war chest with ESPN/Fox bundle priced at $39.99 per month",
    "description": "You can save $10 a month by signing up to this bundle, instead of ESPN and Fox's separate standalone services, debuting in August.",
    "link": "https://fortune.com/2025/08/11/espn-fox-sports-streaming-bundle-disney-price/",
    "timestamp": "2025-08-11T19:36:21Z"
  },
  {
    "title": "Jonathan Turley Explains Why Trump’s DC Crackdown Can’t Be Stopped",
    "description": "GWU law professor Jonathan Turley said President Donald Trump’s crackdown on crime in D.C. couldn’t be stopped due to the status of the nation’s capital.",
    "link": "https://dailycaller.com/2025/08/11/jonathan-turley-trumps-dc-crackdown-cant-be-stopped/",
    "timestamp": "2025-08-11T19:35:44Z"
  },
  {
    "title": "Trump extends China's 125pc tariff deadline for 90 days",
    "description": "The new 90-day pause on sky-high tariffs extends the deal to delay the reintroduction of triple-digit levies.",
    "link": "https://www.abc.net.au/news/2025-08-12/donald-trump-extends-tariff-truce-with-china/105640320",
    "timestamp": "2025-08-11T19:34:59Z"
  },
  {
    "title": "Tariff Rebate Checks Are a Bad, Inflationary Idea",
    "description": "If Sen. Josh Hawley and the Trump administration want to spare Americans the pain from tariffs, there is a far simpler solution.",
    "link": "https://reason.com/2025/08/11/tariff-rebate-checks-are-a-bad-inflationary-idea/",
    "timestamp": "2025-08-11T19:34:12Z"
  },
  {
    "title": "Zohran Mamdani launches door-to-door campaigning as he blasts ex-Governor Andrew Cuomo, Mayor Eric Adams for having ties with Donald Trump",
    "description": "Mamdani has argued that his three main challengers -- Andrew Cuomo, Mayor Eric Adams and Curtis Sliwa, the Republican nominee -- all have ties to the president.",
    "link": "https://economictimes.indiatimes.com/news/international/us/zohran-mamdani-launches-door-to-door-campaigning-as-he-blasts-ex-governor-andrew-cuomo-mayor-eric-adams-for-having-ties-with-donald-trump/articleshow/123244528.cms",
    "timestamp": "2025-08-11T19:33:52Z"
  },
  {
    "title": "Trump extends China tariff deadline for 90 days just hours before truce was set to expire: official",
    "description": "WASHINGTON — U.S. President Donald Trump has signed an executive order extending a tariff truce with China by another 90 days, a White House official said on Monday with only hours to go before U.S. tariffs on Chinese goods were due to snap back to triple-dig…",
    "link": "https://nypost.com/2025/08/11/world-news/trump-extends-china-tariff-deadline-for-90-days-official/",
    "timestamp": "2025-08-11T19:33:26Z"
  },
  {
    "title": "Trump's second term has been great for China",
    "description": "In this file photo taken on June 28, 2019, China's President Xi Jinping (R) shakes hands with US President Donald Trump before a bilateral meeting on the sidelines of the G20 Summit in Osaka.",
    "link": "https://biztoc.com/x/839c7372115e7d45",
    "timestamp": "2025-08-11T19:30:59Z"
  },
  {
    "title": "Dana White, TKO tease that UFC events, including potential White House special, could air live on CBS in 2026",
    "description": "Paramount inked a massive seven-year deal to secure UFC media rights",
    "link": "https://www.cbssports.com/mma/news/dana-white-tko-tease-that-ufc-events-including-potential-white-house-special-could-air-live-on-cbs-in-2026/",
    "timestamp": "2025-08-11T19:28:58Z"
  },
  {
    "title": "Factbox-Trump's tariffs: What's in effect and what could be in store?",
    "description": "U.S. President Donald Trump has launched a global trade war with an array of tariffs that target individual products and countries. Trump has set a baseline ...",
    "link": "https://finance.yahoo.com/news/factbox-trumps-tariffs-whats-effect-192708367.html",
    "timestamp": "2025-08-11T19:27:08Z"
  },
  {
    "title": "Dozens of feds swarm minor DC fender-bender as Trump’s militarized crackdown creates chaos",
    "description": "Dozens of federal officers came running when a moped and a car were in a minor traffic accident on Sunday night in Washington, D.C. President Donald Trump deployed federal agents and National Guard soldiers to Washington to fix what he claims is a crime wave …",
    "link": "https://www.rawstory.com/trump-washington-dc-2673875744/",
    "timestamp": "2025-08-11T19:24:03Z"
  },
  {
    "title": "Levy on India's Russian oil imports a 'big blow' to Moscow, says Trump",
    "description": "Donald Trump stated that US tariffs on India's Russian oil purchases have significantly impacted Russia's economy. He mentioned India as a major oil buyer from Russia. Trump claimed Russia's economy is struggling due to global pressures and US tariffs. He sug…",
    "link": "https://economictimes.indiatimes.com/news/india/levy-on-indias-russian-oil-imports-a-big-blow-to-moscow-says-trump/articleshow/123244417.cms",
    "timestamp": "2025-08-11T19:23:22Z"
  },
  {
    "title": "Trump's second term has been great for China",
    "description": "President Trump's policies have caused China's exports to surge, and his surrender of America's soft power handed an advantage to the Chinese Communist Party.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-china-laughing-tariffs-chinese-communist-party-rcna223690",
    "timestamp": "2025-08-11T19:21:37Z"
  },
  {
    "title": "Ahead of DC deployment, who are the National Guard?",
    "description": "Donald Trump has ordered the mobilisation of hundreds of troops for deployment in Washington, DC. What exactly is the National Guard?",
    "link": "https://www.rte.ie/news/2025/0811/1527980-ahead-of-dc-deployment-who-are-the-national-guard/",
    "timestamp": "2025-08-11T19:21:37Z"
  },
  {
    "title": "Trump Thought Alaska Was Russia, And The Internet Is Having An Absolute Field Day With It",
    "description": "\"This doddering old man has no idea where he is or what he’s talking about,\" one congressman said.",
    "link": "https://www.buzzfeed.com/davidmoye/social-media-roasts-trump-for-confusing-russia-with-alaska",
    "timestamp": "2025-08-11T19:21:34Z"
  },
  {
    "title": "Washington D.C. Crime Offenses Drop Across the Board in 2025",
    "description": "Eight hundred National Guard troops will be assigned to Washington, D.C. as part of a crackdown on crime and homelessness, U.S. President Donald Trump said during a White House press briefing on Monday. He did not rule out the possibility of carrying out the …",
    "link": "https://biztoc.com/x/55bb38553a73e354",
    "timestamp": "2025-08-11T19:19:57Z"
  },
  {
    "title": "Intel Shares Are Moving Higher Monday: What's Going On?",
    "description": "Intel Corporation (NASDAQ:INTC) shares are trading higher Monday amid reports indicating CEO Lip-Bu Tan will meet with President Donald Trump.\nWhat To Know: According to Bloomberg, the meeting is expected to take place Monday at the White House. It comes four…",
    "link": "https://biztoc.com/x/7d24ee0978e4fa0e",
    "timestamp": "2025-08-11T19:19:51Z"
  },
  {
    "title": "Bill Maher says ‘The View’ co-hosts are not ‘the best advertisement for women’ in blunt criticism",
    "description": "HBO host Bill Maher had some harsh words for the co-hosts of “The View” on Monday. While interviewing actress and talk show host Drew Barrymore on his “Club Random” podcast, Maher admitted he doesn’t think that the five women who host the ABC show are the bes…",
    "link": "https://freerepublic.com/focus/f-news/4334000/posts",
    "timestamp": "2025-08-11T19:19:42Z"
  },
  {
    "title": "John Fogerty on Creedence: ‘I Did What the Beatles Did, All By Myself’",
    "description": "The legendary songwriter talks about loving Bruce Springsteen's anti-Trump protest and hating AI music in our new interview",
    "link": "http://www.rollingstone.com/music/music-features/john-fogerty-creedence-interview-1235405254/",
    "timestamp": "2025-08-11T19:15:23Z"
  },
  {
    "title": "Trump extends US-China tariff relief for 90 days",
    "description": "Investing.com -- President Donald Trump has signed an executive order extending the pause on U.S. tariffs on Chinese goods for another 90 days, a White House...",
    "link": "https://finance.yahoo.com/news/trump-extends-us-china-tariff-191517535.html",
    "timestamp": "2025-08-11T19:15:17Z"
  },
  {
    "title": "‘She’s on Her Knees’ But ‘Not for Praying’: Laura Loomer Takes Feud With Marjorie Taylor Greene to the Next Level",
    "description": "Far-right commentator Laura Loomer took the ongoing feud between herself and Rep. Marjorie Taylor Greene (R-GA) to the next level on Monday.\nThe post ‘She’s on Her Knees’ But ‘Not for Praying’: Laura Loomer Takes Feud With Marjorie Taylor Greene to the Next L…",
    "link": "https://www.mediaite.com/media/news/shes-on-her-knees-but-not-for-praying-laura-loomer-takes-feud-with-marjorie-taylor-greene-to-the-next-level/",
    "timestamp": "2025-08-11T19:15:04Z"
  },
  {
    "title": "Former DHS Adviser Warns Cartels Their Days Operating In The Open Are Numbered Thanks To Trump’s Military Strategy",
    "description": "Chuck Marino warned that Donald Trump reportedly ordering U.S. troops to use military force against drug cartels would be effective at stopping their business.",
    "link": "https://dailycaller.com/2025/08/11/former-dhs-adviser-warns-cartels-their-days-operating-in-the-open-are-numbered-thanks-to-trumps-military-strategy/",
    "timestamp": "2025-08-11T19:15:03Z"
  },
  {
    "title": "Trump Tax Law Squeezes Poor, Boosts Income for Wealthy, CBO Says",
    "description": "President Donald Trump’s tax and spending law will deal a financial blow to the poorest Americans while boosting the income of wealthier households, according to a new analysis from the Congressional Budget Office.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tax-law-squeezes-poor-boosts-income-for-wealthy-cbo-says",
    "timestamp": "2025-08-11T19:14:28Z"
  },
  {
    "title": "Trump Pauses China Tariffs Another 90 Days",
    "description": "Steep tariffs against Chinese imports to the U.S. were expected to rise Tuesday when a 90-day pause expired.",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/11/trump-pauses-china-tariffs-another-90-days/",
    "timestamp": "2025-08-11T19:13:58Z"
  },
  {
    "title": "Pressure mounts on Texas Democrats as walkout stretches into a second week",
    "description": "The redistricting standoff in Texas is stretching into its second week with increased threats between red and blue states, and fresh doubts about what will end an impasse that will shape which party controls Congress after next year’s midterm elections. The f…",
    "link": "https://freerepublic.com/focus/f-news/4333996/posts",
    "timestamp": "2025-08-11T19:11:45Z"
  },
  {
    "title": "Trump announces another 90-day pause on China tariffs",
    "description": "The tariff truce began in May after talks in Geneva, where both sides agreed to a 90-day pause to allow further negotiations.",
    "link": "https://indianexpress.com/article/world/trump-signs-order-extending-china-tariff-deadline-for-90-days-official-says-10183578/",
    "timestamp": "2025-08-11T19:11:27Z"
  },
  {
    "title": "Trump pushes Ukraine to agree to 'land swap' with Russia ahead of Putin summit",
    "description": "Trump said he was bothered by Volodymyr Zelenskyy's response that it would violate Ukraine's constitution to cede territory to Russia in a land swap.",
    "link": "https://www.usatoday.com/story/news/world/2025/08/11/trump-zelenskyy-putin-land-swap-russia-ukraine/85610950007/",
    "timestamp": "2025-08-11T19:10:57Z"
  },
  {
    "title": "Sen. RAND PAUL rails against tariffs: Conservatives have to decide if they like taxes because they're Donald Trump's taxes",
    "description": "@RandPaul The true cost of the tariffs ",
    "link": "https://freerepublic.com/focus/f-chat/4333995/posts",
    "timestamp": "2025-08-11T19:10:56Z"
  },
  {
    "title": "Carney and Zelenskyy speak ahead of Trump-Putin summit in Alaska",
    "description": "Prime Minister Mark Carney and Ukrainian President Volodymyr Zelenskyy spoke by phone Monday, reaffirming their agreement that Ukraine must be a party to any discussions about a possible end to the war in that country.",
    "link": "https://www.cbc.ca/news/politics/carney-zelenskyy-talk-before-trump-meets-putin-1.7606064",
    "timestamp": "2025-08-11T19:09:15Z"
  },
  {
    "title": "3557 - Dispatch from Gaza's Nasser Hospital w/ Dr. Tarek Loubani",
    "description": "It's a Monday Fun Day on the Majority Report where the fun is rare, but you can't deny it is Monday.  We open with a good news - bad news situation. The good news is violent crime in Washington DC has a hit a 30-year low. Bad news is Trump is declaring DC und…",
    "link": "https://majorityfm.libsyn.com/3557-dispatch-from-gazas-nasser-hospital-w-dr-tarek-loubani",
    "timestamp": "2025-08-11T19:09:00Z"
  },
  {
    "title": "Trump says tariffs will not be placed on gold, bringing relief to bullion markets",
    "description": "U.S. President Donald Trump on Monday said he would not impose tariffs on gold, a move welcomed by global bullion markets and which ended days of speculation that the yellow metal could be caught up in the ongoing global trade spat.\n“Gold will not be Tariffed…",
    "link": "https://biztoc.com/x/f0286f15ec83b192",
    "timestamp": "2025-08-11T19:08:41Z"
  },
  {
    "title": "Google’s AI, Gemini, Is Literally Depressed: ‘I Am A Failure’",
    "description": "Google’s generative AI chatbot Gemini has been producing troubling, self-loathing statements, prompting user concern and a response from the company. Google says it’s a bug, but the strange outputs have left many uneasy about AI behavior. Key Facts: Users hav…",
    "link": "https://freerepublic.com/focus/f-chat/4333994/posts",
    "timestamp": "2025-08-11T19:08:36Z"
  },
  {
    "title": "Donald Trump Gives Major China Tariff Update",
    "description": "President Donald Trump has reportedly signed an executive order granting a 90-day extension to the China tariff deadline.",
    "link": "https://biztoc.com/x/54a7dcf27e863e6d",
    "timestamp": "2025-08-11T19:08:31Z"
  },
  {
    "title": "Democrats Try to Troll Trump on D.C. Crime and Fail Miserably",
    "description": "Democrats attempted to troll President Donald Trump on Monday after he announced major steps to combat rising crime in Washington, DC.\nThe post Democrats Try to Troll Trump on D.C. Crime and Fail Miserably appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/08/11/democrats-try-troll-trump-dc-crime-fail-miserably/",
    "timestamp": "2025-08-11T19:07:36Z"
  },
  {
    "title": "President Trump extends China tariff deadline by 90 days",
    "description": "President Donald Trump has signed an executive order extending the suspension of high U.S. tariffs on Chinese goods for an additional 90…\nThe post President Trump extends China tariff deadline by 90 days appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/08/11/president-trump-extends-china-tariff-deadline-by-90-days/",
    "timestamp": "2025-08-11T19:06:19Z"
  },
  {
    "title": "Top US Democrat signals fight over crypto market structure",
    "description": "In a Sunday interview, Massachusetts Senator Elizabeth Warren signaled that she planned to double down on her opposition to Republicans’ efforts to pass crypto market structure.",
    "link": "https://cointelegraph.com/news/senator-warren-clarity-act-congress-september",
    "timestamp": "2025-08-11T19:05:57Z"
  },
  {
    "title": "Prosecution Had It In The Bag, Failed Miserably In Their Ambitious Case Against Sean ‘Diddy’ Comb",
    "description": "In a high-stakes federal trial, prosecutors sought to portray Sean 'Diddy' Combs as the head of a criminal enterprise - and failed.",
    "link": "https://dailycaller.com/2025/08/11/government-case-prosecutors-sean-diddy-combs-failure-conviction-mann-act-racketeering-sex-trafficking-cassie-ventura/",
    "timestamp": "2025-08-11T19:05:33Z"
  },
  {
    "title": "Gold Imports Won't Face US Tariffs, Trump Says",
    "description": "President Donald Trump said Monday imports of gold will not face US tariffs, weighing in after a federal ruling caused chaos and ...",
    "link": "https://biztoc.com/x/6174e3c38904bfa2",
    "timestamp": "2025-08-11T19:04:58Z"
  },
  {
    "title": "Carney’s $1.2 billion in lumber aid inflames subsidy allegations, U.S. industry says",
    "description": "New financial support pledged by Canada risks deepening the neighbours’ long-running trade dispute, and may result in yet more import taxes",
    "link": "https://financialpost.com/pmn/business-pmn/carney-lumber-aid-inflames-subsidy-allegations",
    "timestamp": "2025-08-11T19:04:19Z"
  },
  {
    "title": "Canada Lumber Aid Inflames US Subsidy Allegations, Industry Says",
    "description": "The US lumber industry says new financial support pledged by Canada to domestic forestry companies risks deepening the neighbors’ long-running trade dispute, and may result in yet more import taxes.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-lumber-aid-inflames-us-subsidy-allegations-industry-says",
    "timestamp": "2025-08-11T19:04:19Z"
  },
  {
    "title": "“I’m Trying to Hold My Temper”: MSNBC Contributor Expresses His Impotent Rage Over Trump’s D.C. Crime Crackdown",
    "description": "(DCNF)—Immediately after President Donald Trump announced his administration’s plans to combat violent crime in Washington, D.C. on Monday, MSNBC contributor Eddie Glaude said he was refraining from losing his “temper.” Trump announced that he was taking meas…",
    "link": "https://freerepublic.com/focus/f-news/4333991/posts",
    "timestamp": "2025-08-11T19:03:33Z"
  },
  {
    "title": "The Frustrations and Perils of Navigating Blind to Rocks",
    "description": "Published on August 11, 2025 7:03 PM GMTOver the course of this sequence I've been building up to the non-obvious idea that when you know[1] the truth you can basically just point at it and people will believe you -- even if they think they \"can't\" because \"i…",
    "link": "https://www.lesswrong.com/posts/BLNgYghHLhBLqGvCE/the-frustrations-and-perils-of-navigating-blind-to-rocks",
    "timestamp": "2025-08-11T19:03:12Z"
  },
  {
    "title": "Trump Extends China Tariff Truce For 90 Days, CNBC Says",
    "description": "President Donald Trump is extending a tariff truce with China for another 90 days, stabilizing trade ties between the world’s two largest economies.\n Trump signed an order extending the truce, CNBC reported on Monday, citing a White House official. The truce,…",
    "link": "https://www.ndtvprofit.com/world/trump-extends-china-tariff-truce-for-90-days-cnbc-says",
    "timestamp": "2025-08-11T19:01:57Z"
  },
  {
    "title": "Trump’s new AI chatbot keeps fact-checking him",
    "description": "Truth Search AI feature promises to deliver users ‘direct, reliable answers’",
    "link": "https://www.the-independent.com/tech/trump-ai-chatbot-truth-search-perplexity-b2805404.html",
    "timestamp": "2025-08-11T19:01:44Z"
  },
  {
    "title": "Trump Puts DC Police Under Direct Federal Control Over Crime Surge in Dem-Run City",
    "description": "“I’m announcing a historic action to rescue our nation’s capital from crime, bloodshed, bedlam, and squalor, and worse.\"",
    "link": "https://www.westernjournal.com/trump-puts-dc-police-direct-federal-control-crime-surge-dem-run-city/",
    "timestamp": "2025-08-11T19:01:20Z"
  },
  {
    "title": "“Trump proud s*xual assaulter”: Martina Navratilova calls out Donald Trump after Mike Tyson comment resurfaces",
    "description": "Martina Navratilova has strongly criticized Donald Trump over his past defense of Mike Tyson's rape conviction, reigniting the controversy surrounding Trump's views on sexual assault allegations. This condemnation comes amid renewed scrutiny of Trump's connec…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/trump-proud-sxual-assaulter-martina-navratilova-calls-out-donald-trump-after-mike-tyson-comment-resurfaces/articleshow/123244105.cms",
    "timestamp": "2025-08-11T19:00:05Z"
  },
  {
    "title": "Trump Hints He Will Reward Putin's Invasion By Demanding Ukraine Give Up Land",
    "description": "He once again blamed Ukraine for getting invaded and also twice confusingly referred to Alaska as part of Russia.",
    "link": "https://www.huffpost.com/entry/trump-ukraine-russia-alaska_n_689a3318e4b0be3f5edc513f",
    "timestamp": "2025-08-11T19:00:04Z"
  },
  {
    "title": "Big Oil's \"Managed Decline\" Strategy Masks An Expansion Push",
    "description": "For years, the talk in boardrooms and investor presentations has been about “discipline” and “capital efficiency.” These are the code words for a strategy that keeps production largely flat, trims high-risk exploration budgets, and returns more cash to shareh…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Big-Oils-Managed-Decline-Strategy-Masks-An-Expansion-Push.html",
    "timestamp": "2025-08-11T19:00:00Z"
  },
  {
    "title": "Trump deploys National Guard to Washington DC and pledges crime crackdown",
    "description": "The president also takes control of the city's police force, as the mayor rejects his claims of a crime wave.",
    "link": "https://www.bbc.com/news/articles/cm2110me5g4o",
    "timestamp": "2025-08-11T18:57:51Z"
  },
  {
    "title": "Trump Says He's Going to 'Russia' to Meet Putin Friday",
    "description": "Donald Trump plans to meet Russian President Vladimir Putin in Alaska as the US president looks to broker an agreement that will bring an end to the war in Ukraine.\n“The highly anticipated meeting between myself, as President of the United States of America, …",
    "link": "https://biztoc.com/x/34f49fcb3c9b33c9",
    "timestamp": "2025-08-11T18:57:38Z"
  },
  {
    "title": "Trump may have delayed China tariff deadline by 90 days",
    "description": "United States President Donald Trump has signed an executive order extending the China tariffs by 90 days, CNBC reported on Monday, citing a White House official.The tariffs on Chinese imports were se...",
    "link": "https://biztoc.com/x/7bb731e6988af210",
    "timestamp": "2025-08-11T18:57:37Z"
  },
  {
    "title": "Ahead of Putin sitdown, Trump says he hopes to get 'prime territory' back for Ukraine",
    "description": "WASHINGTON — President Donald Trump said Monday that he would try to return territory to Ukraine as he prepares to meet with Russian President Vladimir Putin and lay the groundwork for a deal to bring an end to the grinding multiyear war between Ukraine and R…",
    "link": "https://www.nbcnews.com/politics/donald-trump/ahead-putin-sitdown-trump-says-hopes-get-prime-territory-back-ukraine-rcna224351",
    "timestamp": "2025-08-11T18:57:18Z"
  },
  {
    "title": "'Playing With Fire': Gavin Newsom Warns Trump He Will Wipe California GOP Off the Map",
    "description": "Democratic California Gov. Gavin Newsom on Monday put U.S. President Donald Trump on notice that he is not messing around when it comes to plans to ruthlessly redraw his state's congressional districts.In a letter sent to Trump, Newsom warned that he is ready…",
    "link": "https://www.commondreams.org/news/gavin-newsom-trump-threat",
    "timestamp": "2025-08-11T18:57:08Z"
  },
  {
    "title": "This Trump scheme ‘eerily reminiscent’ of 2008 financial collapse: expert",
    "description": "Over his nearly seven months as president, the administration of President Donald Trump has taken a sledgehammer to regulations on cryptocurrency. A new report sheds further light on the reasons why.The president may be profiting far more from his \"rapidly-gr…",
    "link": "https://www.rawstory.com/trump-crypto-2673875769/",
    "timestamp": "2025-08-11T18:55:06Z"
  },
  {
    "title": "RBA rate cuts ahead and not before time",
    "description": "Having dashed hopes for some much-needed respite from cost-of-living pressures three weeks ago, it would be a brave RBA that again denies households a rate cut today.",
    "link": "https://www.abc.net.au/news/2025-08-12/rba-hold-or-cut-official-interest-rate-decision-today/105636830",
    "timestamp": "2025-08-11T18:54:54Z"
  },
  {
    "title": "Mamdani Campaigns Linking Cuomo to Trump",
    "description": "\"Zohran Mamdani, the Democratic nominee for New York City mayor, launched a tour Monday of the city’s five boroughs with a central message linking former Gov. Andrew Cuomo to President Donald Trump,\" CNN reports.",
    "link": "https://politicalwire.com/2025/08/11/mamdani-campaigns-linking-cuomo-to-trump/",
    "timestamp": "2025-08-11T18:53:33Z"
  },
  {
    "title": "Bernie Sanders Admits He's Getting Too Old to Run for President in 2028",
    "description": "Sen. Bernie Sanders (I-VT) was asked on Sunday whether he is considering running for president again in 2028, but pointed to the fact he will soon turn 84 years old.\nThe post Bernie Sanders Admits He’s Getting Too Old to Run for President in 2028 appeared fir…",
    "link": "https://www.breitbart.com/politics/2025/08/11/bernie-sanders-admits-hes-getting-too-old-to-run-for-president-in-2028/",
    "timestamp": "2025-08-11T18:53:27Z"
  },
  {
    "title": "Laura Loomer bashed by vets after Medal of Honor rant",
    "description": "Laura Loomer criticized Medal of Honor recipient Florent Groberg after an Army post noted the day he tackled a suicide bomber to the ground.",
    "link": "https://taskandpurpose.com/culture/groberg-loomer-speak-out/",
    "timestamp": "2025-08-11T18:47:28Z"
  },
  {
    "title": "Trump extends China tariff deadline by 90 days",
    "description": "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
    "link": "https://biztoc.com/x/a55b8c3a2f17e198",
    "timestamp": "2025-08-11T18:46:34Z"
  },
  {
    "title": "Trump said to delay China tariff deadline by 90 days",
    "description": "United States President Donald Trump has signed an executive order extending the China tariffs by 90 days, CNBC reported on Monday, citing a White House official.The new deadline is now Sunday, Novemb...",
    "link": "https://biztoc.com/x/483d6386fc1a9014",
    "timestamp": "2025-08-11T18:46:29Z"
  },
  {
    "title": "Trump puts Washington, DC, police under federal control, deploys National Guard",
    "description": "Key Points President Donald Trump placed the Washington, D.C., police department under federal control. Trump also deployed 800 National Guard troops to the capital city. The president cited what he claims is an out-of-control crime problem in the District of…",
    "link": "https://freerepublic.com/focus/f-news/4333988/posts",
    "timestamp": "2025-08-11T18:43:33Z"
  },
  {
    "title": "Trump says both sides in Ukraine war will need to cede territory",
    "description": "WASHINGTON/KYIV/BRUSSELS (Reuters) -U.S. President Donald Trump said on Monday that Kyiv and Moscow will both have to cede land to end the war in Ukraine and...",
    "link": "https://www.yahoo.com/news/articles/trump-says-both-sides-ukraine-184246186.html",
    "timestamp": "2025-08-11T18:42:46Z"
  },
  {
    "title": "WATCH: Looks like Europe is already trying to complicate Trump-Putin summit",
    "description": "'We're going to have a meeting with Vladimir Putin and ... probably in the first two minutes, I'll know exactly whether or not a deal can be made. Because that's what I do. I make deals'",
    "link": "https://www.wnd.com/2025/08/watch-looks-like-europe-is-already-trying-complicate/",
    "timestamp": "2025-08-11T18:42:36Z"
  },
  {
    "title": "Researchers detail new ‘gray zone conflict’ in AI-driven Chinese propaganda",
    "description": "Documents from Chinese firm GoLaxy detail influence operations aligned with Beijing that run at unprecedented speed and precision. National security experts at Vanderbilt say these developments may forever redefine information warfare.",
    "link": "https://www.nextgov.com/cybersecurity/2025/08/researchers-detail-new-gray-zone-conflict-ai-driven-chinese-propaganda/407358/",
    "timestamp": "2025-08-11T18:41:00Z"
  },
  {
    "title": "Trump is promising to slash drug prices by 1,500% | Here's what's really happening",
    "description": "Trump has unveiled a number of moves aimed at cutting drug prices in recent months, but he has yet to move the needle on reducing costs - much less slashing them by 1,500%, which is mathematically impossible, experts say.",
    "link": "https://abc30.com/post/trump-is-promising-slash-drug-prices-1500-heres-whats-happening/17503418/",
    "timestamp": "2025-08-11T18:40:35Z"
  },
  {
    "title": "Here's why Trump and Putin picked Alaska for their first meeting in years",
    "description": "This week marks the first time Russian President Vladimir Putin has set foot on American soil in almost a decade — but the place he's meeting Donald Trump once belonged to Russia.",
    "link": "https://www.abc.net.au/news/2025-08-12/russia-alaska-putin-trump-meeting/105636688",
    "timestamp": "2025-08-11T18:39:34Z"
  },
  {
    "title": "Trump places DC police under federal control, deploys National Guard",
    "description": "The president spoke of a city overrun by violent youth while announcing a takeover of the capital's police.",
    "link": "https://www.salon.com/2025/08/11/trump-places-dc-police-under-federal-control-deploys-national-guard/",
    "timestamp": "2025-08-11T18:38:59Z"
  },
  {
    "title": "Trump extends China tariff deadline by 90 days",
    "description": "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
    "link": "https://www.cnbc.com/2025/08/11/trump-china-tariffs-deadline-extended.html",
    "timestamp": "2025-08-11T18:37:35Z"
  },
  {
    "title": "US Justice Dept loses bid to unseal Epstein partner Ghislaine Maxwell’s grand jury records",
    "description": "No ‘client’ or meaningful new information identified in records, judge says",
    "link": "https://www.irishtimes.com/world/us/2025/08/11/us-justice-dept-loses-bid-to-unseal-epstein-partner-ghislaine-maxwells-grand-jury-records/",
    "timestamp": "2025-08-11T18:36:33Z"
  },
  {
    "title": "Surreal incompetence: the story of Republican economic policy",
    "description": "And another thing: Donald Trump is not mad. Please dont put in the newspaper that he got mad: This is why Patrick Healy had to push Krugman out of the Times before convening his “why is Donald Trump so overwhelmingly popular” emergency panels — he just didn’t…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/surreal-incompetence-the-story-of-republican-economic-policy",
    "timestamp": "2025-08-11T18:35:48Z"
  },
  {
    "title": "Jump in unemployment dismissed as ‘statistical noise’ by Davy",
    "description": "Stockbroker plays down mini spike in jobless rate an says softer-than-expected tax receipts reflect ‘slowing wage growth in high-earning sectors’",
    "link": "https://www.irishtimes.com/business/2025/08/11/jump-in-unemployment-dismissed-as-statistical-noise-by-davy/",
    "timestamp": "2025-08-11T18:35:40Z"
  },
  {
    "title": "Trump said to extend China tariff deadline by 90 days",
    "description": "United States President Donald Trump has signed an executive order extending the China tariffs by 90 days, CNBC reported on Monday. More to come......",
    "link": "https://biztoc.com/x/88f5c1fd9329fde2",
    "timestamp": "2025-08-11T18:35:32Z"
  },
  {
    "title": "Donald Trump Gives Update on Gold Tariffs After Market Turmoil",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced Monday that he will not impose tariffs on gold, easing days of market speculation and calming global bullion markets.\n\"Gold will not be Tariffed!\" Trump said in a statement pos…",
    "link": "https://biztoc.com/x/974fa0cf9b0faa7c",
    "timestamp": "2025-08-11T18:35:25Z"
  },
  {
    "title": "Europe said to seek Ukraine talks with Trump",
    "description": "The leaders of the countries comprising the European Union and the North Atlantic Treaty Organization (NATO) are trying to schedule a meeting with United States President Donald Trump ahead of his enc...",
    "link": "https://biztoc.com/x/04750da71b6a729d",
    "timestamp": "2025-08-11T18:35:23Z"
  },
  {
    "title": "Trump Tempers Expectations Ahead Of Alaska \"Feel-Out Meeting\" With Putin",
    "description": "Trump Tempers Expectations Ahead Of Alaska \"Feel-Out Meeting\" With Putin\n \nDuring President Donald Trump's wide-raning news conference held at the White House on Monday, he was asked about the much anticipated Alaska summit with Russian President Vladimir Put…",
    "link": "https://biztoc.com/x/49633e8c0f7b1a89",
    "timestamp": "2025-08-11T18:35:12Z"
  },
  {
    "title": "Why is Trump attacking Intel's CEO?",
    "description": "The chip-making industry is at the heart of America's rivalry with China. That may be why President Donald Trump last week called on Intel CEO Lip-Bu Tan to resign from his position.\nTrump's decision to put Tan in the spotlight came after Sen. Tom Cotton (R-A…",
    "link": "https://biztoc.com/x/5d8319b92dd96ed5",
    "timestamp": "2025-08-11T18:35:08Z"
  },
  {
    "title": "Who Deserves Credit for the Armenia-Azerbaijan Peace Deal? (Mark Hertling/The Bulwark)",
    "description": "Mark Hertling / The Bulwark:\nWho Deserves Credit for the Armenia-Azerbaijan Peace Deal?  —  Conflicts end because of patience, persistence, and luck—not one man's showmanship.  —  PRESIDENT DONALD TRUMP HOSTED Armenian President Nikol Pashinyan and Azerbaijan…",
    "link": "https://www.memeorandum.com/250811/p79",
    "timestamp": "2025-08-11T18:35:00Z"
  },
  {
    "title": "D.C. Police Put Under Federal Control, Are Now 'Allowed to Do Whatever the Hell They Want' (Tessa Stuart/Rolling Stone)",
    "description": "Tessa Stuart / Rolling Stone:\nD.C. Police Put Under Federal Control, Are Now ‘Allowed to Do Whatever the Hell They Want’  —  Feds will take control of the Police, National Guard deployed after “Big Balls” car jacking  —  President Donald Trump announced Monda…",
    "link": "https://www.memeorandum.com/250811/p78",
    "timestamp": "2025-08-11T18:35:00Z"
  },
  {
    "title": "McCabe: Trump's D.C. Crackdown Will Have Negative Impacts on the Safety of This Country",
    "description": "Monday on CNN's \"News Central,\" former Deputy Director of the FBI Andrew McCabe claimed that President Donald Trump taking federal control of the police department in Washington, D.C., will cause \"major impacts on the safety and security of this country.\"\nThe…",
    "link": "https://www.breitbart.com/clips/2025/08/11/mccabe-trumps-d-c-crackdown-will-have-negative-impacts-on-the-safety-of-this-country/",
    "timestamp": "2025-08-11T18:33:24Z"
  },
  {
    "title": "‘Playing with fire’: Newsom urges Trump to abandon partisan redistricting fight",
    "description": "Texas Republicans are trying to reconvene the state Legislature to vote on redrawing congressional maps in their party's favor.",
    "link": "https://www.pbs.org/newshour/politics/playing-with-fire-newsom-urges-trump-to-abandon-partisan-redistricting-fight",
    "timestamp": "2025-08-11T18:33:24Z"
  },
  {
    "title": "Donald Trump Gives Update on Gold Tariffs After Market Turmoil",
    "description": "The White House said last week it was preparing an executive order to \"clarify misinformation\" regarding tariffs on gold bars.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-announcement-gold-stock-market-trade-2111957",
    "timestamp": "2025-08-11T18:33:09Z"
  },
  {
    "title": "Nolte: CNN Admits Epstein ‘Scandal’ a ‘Political Dud & Nothingburger’",
    "description": "The regime media and Democrats have failed miserably to turn the Jeffrey Epstein “scandal” into anything Normal People care about. | Politics The regime media and Democrats have failed miserably to turn the Jeffrey Epstein “scandal” into anything Normal Peopl…",
    "link": "https://www.breitbart.com/politics/2025/08/11/nolte-cnn-admits-epstein-scandal-a-political-dud-nothingburger/",
    "timestamp": "2025-08-11T18:32:19Z"
  },
  {
    "title": "Trump says he hopes to get 'prime territory' back for Ukraine as he prepares for Putin summit",
    "description": "Donald Trump has said he would try to return territory to Ukraine as he prepares to meet Vladimir Putin and lay the groundwork for a deal to bring an end to the war.",
    "link": "https://news.sky.com/story/trump-says-he-hopes-to-get-prime-territory-back-for-ukraine-as-he-prepares-for-putin-summit-13410320",
    "timestamp": "2025-08-11T18:32:00Z"
  }
]