[
  {
    "title": "Far-right Romanian candidate appeals presidential vote ban",
    "description": "Romanian far-right politician Calin Georgescu on Monday appealed a decision barring him from standing in a presidential vote re-run, which has sparked violent clashes and plunged the EU and NATO member bordering war-torn Ukraine into deeper uncertainty.   Rom…",
    "link": "https://www.digitaljournal.com/world/far-right-romanian-candidate-appeals-presidential-vote-ban/article",
    "timestamp": "2025-03-10T17:17:21Z"
  },
  {
    "title": "‘Elbows up!’ – the hockey tactic inspiring Canada’s anti-Trump fight",
    "description": "A legendary Canadian ice hockey player renowned for his aggressive play has inspired the country’s emerging rallying cry of “Elbows up!” in its battle against US President Donald Trump. Throwing an elbow — in your opponent’s face or ribs — is hardly rare in h…",
    "link": "https://www.digitaljournal.com/world/elbows-up-the-hockey-tactic-inspiring-canadas-anti-trump-fight/article",
    "timestamp": "2025-03-10T17:17:20Z"
  },
  {
    "title": "REX-Osprey files for MOVE ETF",
    "description": "Asset manager REX-Osprey is seeking to launch an exchange-traded fund (ETF) designed to hold the Movement Network’s native token, MOVE, according to a March 10 announcement. The filing comes as Movement, a layer-2 (L2) blockchain network, launches its public …",
    "link": "https://cointelegraph.com/news/rex-osprey-files-for-move-etf",
    "timestamp": "2025-03-10T17:16:47Z"
  },
  {
    "title": "'Elbows Up!' - The Hockey Tactic Inspiring Canada's Anti-Trump Fight",
    "description": "A legendary Canadian ice hockey player renowned for his aggressive play has inspired the country's emerging rallying cry of \"Elbows up!\"",
    "link": "https://www.ibtimes.com/elbows-hockey-tactic-inspiring-canadas-anti-trump-fight-3765812",
    "timestamp": "2025-03-10T17:15:20Z"
  },
  {
    "title": "Canada Slaps 25% Tariff on Electricity to Americans in Three States",
    "description": "\"If the United States escalates, I will not hesitate to shut the electricity off completely,\" Doug Ford said Monday.",
    "link": "https://gizmodo.com/canada-slaps-25-tariff-on-electricity-to-americans-in-three-states-2000573857",
    "timestamp": "2025-03-10T17:15:05Z"
  },
  {
    "title": "Trump’s Tariffs Are Not a Negotiating Tactic",
    "description": "Donald Trump’s immediate, aggressive use of import tariffs has revealed a fundamental difference between his first and second term. Far from a mere negotiating strategy, the goal this time is to replace a global rules-based system of managed economic integrat…",
    "link": "https://www.project-syndicate.org/commentary/trump-tariff-wall-aims-to-dismantle-postwar-economic-order-by-ian-bremmer-2025-03",
    "timestamp": "2025-03-10T17:15:01Z"
  },
  {
    "title": "Melania Trump ditched dresses for tuxedos: A bold fashion shift or political statement?",
    "description": "Between a camel-colored Ralph Lauren suit and a Dolce & Gabbana tuxedo, Melania Trump has been sporting a lot of menswear recently. Kaleigh Werner explores what she might be trying to tell us",
    "link": "https://www.the-independent.com/life-style/fashion/melania-trump-fashion-menswear-donald-b2712397.html",
    "timestamp": "2025-03-10T17:14:02Z"
  },
  {
    "title": "US added to international watchlist for rapid decline in civic freedoms - NewsBreak",
    "description": "Civicus, an international non-profit, puts country alongside Democratic Republic of Congo, Italy, Pakistan and Serbia",
    "link": "https://www.newsbreak.com/share/3848325297451-us-added-to-international-watchlist-for-rapid-decline-in-civic-freedoms?s=a2&amp;share_destination_id=MTI1MTM2ODk4LTE3NDE2MjY2ODE3Mjk%3D&amp;pd=08T3p47f&amp;hl=en_US&amp;send_time=1741626681&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v6%2Cns_foryou_model_exp_25q1-v5%2Cns_local_strategy_25q1_exp-v1%2Cns_foryou_recall_exp_25q1-v6%2Cns_foryou_rank_exp_25q1-v1",
    "timestamp": "2025-03-10T17:13:29Z"
  },
  {
    "title": "Leader of student protests at Columbia facing deportation after arrest by immigration officials",
    "description": "His lawyer says the agents claimed the government was revoking his green card.",
    "link": "https://www.bostonherald.com/2025/03/10/student-protests-immigration-arrest/",
    "timestamp": "2025-03-10T17:13:19Z"
  },
  {
    "title": "Rubio won't 'set any conditions' on Ukraine as Zelenskyy arrives in Saudi Arabia for summit",
    "description": "Ukrainian President Volodymyr Zelenskyy arrived Monday in Saudi Arabia for a visit with its powerful crown prince ahead of his team's meeting with America's top diplomat.",
    "link": "https://www.cbc.ca/news/world/ukraine-summit-jeddah-1.7479430",
    "timestamp": "2025-03-10T17:12:00Z"
  },
  {
    "title": "Trump Relaunches Biden's CBP One App as Self-Deportation Tool",
    "description": "The Trump administration relaunched the Biden administration’s smartphone application used by nearly one million migrants to enter the United States as a self-deportation tool dubbed \"CBP Home.\" The new application will offer several features, including allow…",
    "link": "https://www.breitbart.com/border/2025/03/10/trump-relaunches-bidens-cbp-one-app-as-self-deportation-tool/",
    "timestamp": "2025-03-10T17:10:48Z"
  },
  {
    "title": "Cuba-born rep says emotional 1st return in 64 years with Gitmo CODEL left him 'amped-up' to see it liberated",
    "description": "Rep. Carlos A. Gimenez, who represents the district closest to Cuba, returned to the island nation for the first time since his family fled Communist oppression in 1960.",
    "link": "https://www.foxnews.com/politics/cuba-born-rep-emotional-return-64-years-gitmo-codel",
    "timestamp": "2025-03-10T17:10:34Z"
  },
  {
    "title": "Musk and Trump Bash Immigrants While Destroying Programs to Stabilize Their Home Countries",
    "description": "Two days before staffers at the US African Development Foundation (USADF) refused to let DOGE staffers enter the door to their offices, Donald Trump stood before Congress and mocked what he described as “appalling waste” in foreign aid. “Eight million to prom…",
    "link": "https://www.motherjones.com/politics/2025/03/usadf-iaf-doge-migrants-terrorism/",
    "timestamp": "2025-03-10T17:10:14Z"
  },
  {
    "title": "Trump loves the Gilded Age and its tariffs. It was a great time for the rich but not for the many (Will Weissert/Associated Press)",
    "description": "Will Weissert / Associated Press:\nTrump loves the Gilded Age and its tariffs.  It was a great time for the rich but not for the many  —  In President Donald Trump's idealized framing, the United States was at its zenith in the 1890s, when top hats and shirtwa…",
    "link": "https://www.memeorandum.com/250310/p73",
    "timestamp": "2025-03-10T17:10:00Z"
  },
  {
    "title": "Report: Majority of Biden Documents Signed by 'Autopen Signature,' Raising Eyebrows",
    "description": "The Heritage Foundation released a report last week which found that the majority of official documents signed by President Joe Biden were by autopen signature, raising questions over if he \"actually ordered the signature of relevant legal documents.\"\nThe pos…",
    "link": "https://www.breitbart.com/politics/2025/03/10/report-majority-of-biden-documents-signed-by-autopen-signature-raises-eyebrows/",
    "timestamp": "2025-03-10T17:09:14Z"
  },
  {
    "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
    "description": "China is retaliating against President Donald Trump’s tariffs on China by imposing additional 15% taxes on key American farm products, including chicken, pork, soybeans and beef.",
    "link": "https://www.clickorlando.com/business/2025/03/10/china-strikes-back-at-trump-tariffs-with-15-levies-targeting-us-farmers/",
    "timestamp": "2025-03-10T17:09:13Z"
  },
  {
    "title": "Mahmoud Khalil Is Not a Threat; the Trump Administration Is",
    "description": "The evening of the 8th of March, which coincides with the Holy month of Ramadan celebrated by almost 2 billion Muslims worldwide, took an expected turn for Mahmoud Khalil and his wife. Khalil just returned home from iftar—the evening meal Muslims eat to break…",
    "link": "https://www.commondreams.org/opinion/mahmoud-khalil-trump",
    "timestamp": "2025-03-10T17:09:05Z"
  },
  {
    "title": "Ontario premier threatens to ‘shut off electricity completely’ for US if trade war escalates | CNN Business",
    "description": "President Donald Trump may have delayed most – though not all – of the tariffs he had imposed on Canada and Mexico, but that hasn’t stopped America’s northern neighbors from responding forcefully in retaliation.",
    "link": "https://www.cnn.com/2025/03/10/business/canada-electricity-us-tariffs-doug-ford/index.html",
    "timestamp": "2025-03-10T17:09:03Z"
  },
  {
    "title": "Stocks slump after Trump declines to rule out recession",
    "description": "Stocks slump after Trump declines to rule out recession\nThe major stock indexes tumbled in early trading on Monday.\nU.S. stocks plunged on Monday, suffering widespread losses a day after President Donald Trump declined to rule out the possibility of a recessi…",
    "link": "https://biztoc.com/x/b5c104f471d0c89d",
    "timestamp": "2025-03-10T17:09:02Z"
  },
  {
    "title": "US stock market tumbles after Trump stokes recession fears",
    "description": "The News\nStock markets fell Monday after US President Donald Trump declined to rule out the potential for a recession this year and China’s retaliatory tariffs on US imports took effect. As of midday, the S&P 500 was down more than 2%, while the Nasdaq 100 wa…",
    "link": "https://biztoc.com/x/9a5961d3f729bf8e",
    "timestamp": "2025-03-10T17:08:19Z"
  },
  {
    "title": "Commerce Secretary Says Trump Will Not Ease Up On Fentanyl-Related Tariffs",
    "description": "Commerce Secretary Says Trump Will Not Ease Up On Fentanyl-Related Tariffs\n \nAuthored by Jacob Burg via The Epoch Times (emphasis ours),\nCommerce Secretary Howard Lutnick said on March 9 that President Donald Trump is likely to maintain his tariff pressure on…",
    "link": "https://biztoc.com/x/08eb5d8f2ce1508e",
    "timestamp": "2025-03-10T17:08:17Z"
  },
  {
    "title": "‘The Apprentice,’ Starring Donald Trump, Begins Streaming on Amazon",
    "description": "The company said it would release several seasons of the reality show showcasing Donald J. Trump before he turned to politics.",
    "link": "https://biztoc.com/x/8e187fd667863e42",
    "timestamp": "2025-03-10T17:08:13Z"
  },
  {
    "title": "We Went to War, Came Home, and Achieved the American Dream. Billionaires Are Stealing It",
    "description": "Donald Trump and Elon Musk are stealing the American Dream from veterans who have dedicated their lives to the United States.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-musk-stealing-american-dream-veterans-1235292821/",
    "timestamp": "2025-03-10T17:07:10Z"
  },
  {
    "title": "Zelenskyy arrives in Saudi Arabia ahead of US-Ukraine meeting",
    "description": "Ukraine's President Volodymyr Zelenskyy has arrived in Saudi Arabia ahead of his team having talks with America's top diplomat.",
    "link": "https://news.sky.com/story/volodymyr-zelenskyy-arrives-in-saudi-arabia-ahead-of-us-ukraine-meeting-13325920",
    "timestamp": "2025-03-10T17:07:00Z"
  },
  {
    "title": "How the US has tried to annex Canada before – and why some Canadians wanted to become American",
    "description": "Donald Trump might want Canada as a 51st state, but in times past some Canadians wanted to be part of the US.",
    "link": "https://theconversation.com/how-the-us-has-tried-to-annex-canada-before-and-why-some-canadians-wanted-to-become-american-251200",
    "timestamp": "2025-03-10T17:06:00Z"
  },
  {
    "title": "How A Columbia Protest Leader ‘Aligned To Hamas’ Came Into ICE’s Crosshairs",
    "description": "President Donald Trump's directives on antisemitism have brought a Syrian-born leader of a violent pro-Hamas protest into custody, stripped of his residency.",
    "link": "https://dailycaller.com/2025/03/10/how-a-columbia-protest-leader-aligned-to-hamas-came-into-ices-crosshairs/",
    "timestamp": "2025-03-10T17:05:56Z"
  },
  {
    "title": "What does Egypt’s plan to rebuild Gaza involve and what challenges does it face?",
    "description": "Egypt’s plan to reconstruct Gaza has been endorsed by Europe and the Arab world and, but rejected by Israel and the US.",
    "link": "https://theconversation.com/what-does-egypts-plan-to-rebuild-gaza-involve-and-what-challenges-does-it-face-251567",
    "timestamp": "2025-03-10T17:05:56Z"
  },
  {
    "title": "What’s so special about Ukraine’s minerals? A geologist explains",
    "description": "The US has many of the same minerals Ukraine does – but prefers to import them.",
    "link": "https://theconversation.com/whats-so-special-about-ukraines-minerals-a-geologist-explains-251551",
    "timestamp": "2025-03-10T17:05:32Z"
  },
  {
    "title": "CDC to Re-Investigate Vaccines and Autism, Despite Decades of Evidence Showing No Link",
    "description": "Under the new leadership of Robert F. Kennedy Jr., the CDC is expected to look into a long-debunked connection between vaccination and autism.",
    "link": "https://gizmodo.com/cdc-to-re-investigate-vaccines-and-autism-despite-decades-of-evidence-showing-no-link-2000573773",
    "timestamp": "2025-03-10T17:05:30Z"
  },
  {
    "title": "Donald Trump's 'The Apprentice' Stream: How to Watch Every Season of the Reality TV Show",
    "description": "The Apprentice is now streaming! President Donald Trump‘s long-running reality TV series has arrived on Prime Video on Monday (March 10). Season 1 of the series, which debuted in 2004, is now available, and the upcoming seasons will drop one per week on Monda…",
    "link": "https://www.justjared.com/2025/03/10/donald-trumps-the-apprentice-stream-how-to-watch-every-season-of-the-reality-tv-show/",
    "timestamp": "2025-03-10T17:05:25Z"
  },
  {
    "title": "Electricity to get costlier in New York, Michigan, Minnesota? Canadian province Ontario imposes 25% surcharge on exports to protest Trump tariffs",
    "description": "Canadian province of Ontario has taken a stern measure to protest against tariffs imposed by US President Donald Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/us/electricity-to-get-costlier-in-new-york-michigan-minnesota-canadian-province-ontario-imposes-25-surcharge-on-exports-to-protest-trump-tariffs/articleshow/118854526.cms",
    "timestamp": "2025-03-10T17:04:31Z"
  },
  {
    "title": "ICE (Surprise!) Finds No Murderers or Rapists at Philly Market",
    "description": "Check phillymag.com each morning Monday through Thursday for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly […]",
    "link": "https://www.phillymag.com/news/2025/03/10/ice-arrests-philadelphia/",
    "timestamp": "2025-03-10T17:04:02Z"
  },
  {
    "title": "Whistleblower reveals Facebook censorship system created to enter China",
    "description": "Last April, Sarah Wynn-Williams, a former Facebook global policy director who was fired in 2017, revealed in a complaint filed with the SEC that Facebook sought a foothold in the Chinese social media market. It hoped to achieve this by creating a version of i…",
    "link": "https://www.techspot.com/news/107084-whistleblower-reveals-details-censorship-system-facebook-built-chinese.html",
    "timestamp": "2025-03-10T17:04:00Z"
  },
  {
    "title": "Marco Rubio Gives Update on Ukraine Weapons, Intelligence Ban",
    "description": "Trump's Secretary of State emphasized that the White House must first assess what concessions Kyiv is willing to make.",
    "link": "https://www.newsweek.com/marco-rubio-gives-update-ukraine-weapons-intelligence-ban-2042355",
    "timestamp": "2025-03-10T17:03:56Z"
  },
  {
    "title": "US still sharing defensive intel with Ukraine despite aid pause, Witkoff says",
    "description": "In the same interview, Witkoff emphasized that the US and Israel needed a deadline on the release of the remaining hostages in Gaza.",
    "link": "https://www.jpost.com/international/article-845494",
    "timestamp": "2025-03-10T17:02:47Z"
  },
  {
    "title": "AOC 'going on the offense' to rally red-district voters against Trump: report",
    "description": "Progressive Rep. Alexandria Ocasio-Cortez is reportedly planning to hold rallies against President Donald Trump in New York and Pennsylvania.",
    "link": "https://www.foxnews.com/politics/aoc-going-offense-rally-red-district-voters-against-trump-report",
    "timestamp": "2025-03-10T17:02:37Z"
  },
  {
    "title": "HBO’s ‘The White Lotus’ mocks ‘gender goblins’ on the left on heels of viral Trump supporter scene",
    "description": "\"The White Lotus,\" a dark comedy drama about a group of vacationers at a high-end resort in Thailand, regularly touches on cultural and class issues.",
    "link": "https://www.foxnews.com/media/hbos-the-white-lotus-mocks-gender-goblins-left-heels-viral-trump-supporter-scene",
    "timestamp": "2025-03-10T17:00:56Z"
  },
  {
    "title": "Trump Nixes Waiver Giving Iraq Permission to Buy Iranian Electricity",
    "description": "\"...encouraged the Iraqi government to welcome more western and U.S. energy companies into Iraq’s oil and gas sectors.\"\nThe post Trump Nixes Waiver Giving Iraq Permission to Buy Iranian Electricity first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/03/trump-nixes-waiver-giving-iraq-permission-to-buy-iranian-electricity/",
    "timestamp": "2025-03-10T17:00:52Z"
  },
  {
    "title": "Bitcoin crash deepens as recession fear grips market – What now?",
    "description": "Bitcoin, Ether, and XRP plunge over 6%, dragging the total crypto market cap to $2.71T.",
    "link": "https://ambcrypto.com/bitcoin-crash-deepens-as-recession-fear-grips-market-what-now/",
    "timestamp": "2025-03-10T17:00:29Z"
  },
  {
    "title": "How data accuracy failures are costing lives and money in health care",
    "description": "Data fidelity refers to the accuracy with which information—“data”—qualifies and demonstrates the characteristics of the origin—“source.” The emergence of artificial intelligence in data monitoring has necessitated an elevated level of accuracy. We are discus…",
    "link": "https://kevinmd.com/2025/03/how-data-accuracy-failures-are-costing-lives-and-money-in-health-care.html",
    "timestamp": "2025-03-10T17:00:20Z"
  },
  {
    "title": "REPORT: Married Senator Literally Cozies Up To Media While On Date",
    "description": "Sen. Chris Murphy reportedly cozied up to Courier Newsroom CEO Tara McGowan at a restaurant in Washington, D.C. recently after he separated from his wife.",
    "link": "https://dailycaller.com/2025/03/10/report-married-senator-chris-murphy-tara-mcgowan/",
    "timestamp": "2025-03-10T17:00:19Z"
  },
  {
    "title": "Trump Dishes Word Salad: He's Tough On Russia Because Of Hunter Biden's Laptop",
    "description": "Donald Trump issued a word salad answer after Maria Bartiromo asked if he's been tough on Russia.\nThe Ignoramus-in-chief claimed he's been tougher on Russia than anybody. He gave no information on how he's been tough. Let's ask Ukrainian people if that's true…",
    "link": "https://crooksandliars.com/2025/03/trump-says-hes-tough-russia-because-hunter",
    "timestamp": "2025-03-10T17:00:01Z"
  },
  {
    "title": "A Diplomatic Rollercoaster for Ukraine",
    "description": "In Ukrainian and Russian, the term for rollercoaster is \"American hills.\" That's an apt description of the whiplash diplomacy this past week over Russia's war against Ukraine, particularly when it comes to the rocky relations between Washington and Kyiv. A Wh…",
    "link": "https://oilprice.com/Geopolitics/Europe/A-Diplomatic-Rollercoaster-for-Ukraine.html",
    "timestamp": "2025-03-10T17:00:00Z"
  },
  {
    "title": "What Canada’s new Liberal PM Mark Carney means for crypto",
    "description": "Mark Carney, a Canadian economist and now Prime Minister-designate, is already under the microscope for his previous remarks regarding cryptocurrency. Carney, who replaced former Prime Minister Justin Trudeau, took a measured and critical approach to cryptocu…",
    "link": "https://cointelegraph.com/news/canada-liberal-pm-mark-carney-crypto",
    "timestamp": "2025-03-10T17:00:00Z"
  },
  {
    "title": "The Supreme Court Is Going to Rule on the Legality of ‘Conversion Therapy’",
    "description": "The Supreme Court has decided to hear a case challenging the legality of a Colorado law banning so-called conversion therapy.",
    "link": "http://www.rollingstone.com/politics/politics-news/conversion-therapy-legality-supreme-court-1235292818/",
    "timestamp": "2025-03-10T16:59:14Z"
  },
  {
    "title": "Donald Trump’s ‘The Apprentice’ Becomes Available To Stream For The Very First Time",
    "description": "Contestants competed for the chance to work for Trump in the NBC reality show.",
    "link": "https://decider.com/2025/03/10/donald-trump-the-apprentice-available-stream-first-time/",
    "timestamp": "2025-03-10T16:59:05Z"
  },
  {
    "title": "Jim Cantore's Warning About DOGE Weather Forecasting Cuts",
    "description": "Meteorologist Jim Cantore warned that the quality of forecasts may suffer under the cuts to the NOAA.",
    "link": "https://www.newsweek.com/jim-cantore-warning-doge-weather-forecasting-cuts-2042306",
    "timestamp": "2025-03-10T16:58:58Z"
  },
  {
    "title": "CNN Anchor Drills Down When Ilhan Omar Calls Trump Fans ‘Racist and Xenophobic’: Not ‘All Of His Base, Right?’",
    "description": "CNN anchor Pamela Brown pressed Rep. Ilhan Omar (D-MN) when she called pro-Trump Congressman Brandon Gill’s (R-TX) base “xenophobic and racist,” asking her to clarify “not all of” his base was included in that description. Gill — an intensely pro-MAGA lawmake…",
    "link": "https://www.mediaite.com/news/cnn-anchor-drills-down-when-ilhan-omar-calls-trump-fans-racist-and-xenophobic-not-all-of-his-base-right/",
    "timestamp": "2025-03-10T16:58:15Z"
  },
  {
    "title": "MAGA spins Dominion-style conspiracy in Canada prime minister vote—before the actual election",
    "description": "Mark Carney, a well-known banker, won a key leadership race in Canada on Sunday to succeed Prime Minister Justin Trudeau as head of the Liberal Party of Canada. \n\n\nIn January, Trudeau announced his intention to step down once a new ruling party leader was cho…",
    "link": "https://www.dailydot.com/debug/mark-carney-canada-dominion-voter-fraud/",
    "timestamp": "2025-03-10T16:58:10Z"
  },
  {
    "title": "Stock market sell-off worsens as Wall Street wonders how much pain Trump will endure for the economy",
    "description": "The U.S. stock market's sell-off is worsening Monday as Wall Street questions how much pain President Donald Trump is willing for the economy to endure in order to get what he wants.",
    "link": "https://biztoc.com/x/a454f00e970709c4",
    "timestamp": "2025-03-10T16:57:23Z"
  },
  {
    "title": "US 'officially cancelling 83%' of USAID programs, Rubio says",
    "description": "The cuts come as the Trump administration seeks to reorient its approach to foreign policy and government spending. A freeze on foreign aid funds has already left groups around the world at a critical point.",
    "link": "https://www.dw.com/en/us-officially-cancelling-83-of-usaid-programs-rubio-says/a-71879861",
    "timestamp": "2025-03-10T16:57:00Z"
  },
  {
    "title": "NEA Retreats on ‘Gender Ideology’ Pledge for Grant Applications, But Restrictions Remain",
    "description": "\"This new prohibition runs directly counter to the point of the NEA, and to the point of art in general, which is to explore ideas, explore the diversity of human experience.\"",
    "link": "https://www.artnews.com/art-news/news/nea-gender-ideology-pledge-retreat-1234735108/",
    "timestamp": "2025-03-10T16:55:49Z"
  },
  {
    "title": "Crypto Czar David Sacks Says US Government May Accumulate More Bitcoin To Add to Strategic BTC Reserve",
    "description": "The Trump Administration’s Crypto Czar says the US could gobble up more Bitcoin (BTC) to add to its upcoming strategic reserve. In a new interview on the All-In Podcast, renowned venture capitalist and Crypto Czar David Sacks says that the government would be…",
    "link": "https://dailyhodl.com/2025/03/10/crypto-czar-david-sacks-says-us-government-may-accumulate-more-bitcoin-to-add-to-strategic-btc-reserve/",
    "timestamp": "2025-03-10T16:55:35Z"
  },
  {
    "title": "Read and watch Mark Carney's full victory speech after winning Liberal leadership",
    "description": "Read the full speech by prime minister-designate Mark Carney at the Liberal leadership convention in Ottawa.",
    "link": "https://www.cbc.ca/news/politics/mark-carney-full-speech-1.7479282",
    "timestamp": "2025-03-10T16:55:34Z"
  },
  {
    "title": "Elon Musk Sparks Outrage in Italy Over Potential $1.6 Billion Starlink Deal Amid Cozy Rapport With Prime Minister Giorgia Meloni",
    "description": "Negotiations between Italian Prime Minister Giorgia Meloni’s right-wing government and Elon Musk’s SpaceX over a Starlink deal reportedly worth $1.6 billion are sparking outrage in Italy’s parliament. On Saturday, the spat prompted Musk to ask to meet persona…",
    "link": "https://variety.com/2025/digital/global/elon-musk-outrage-italy-starlink-deal-1236333151/",
    "timestamp": "2025-03-10T16:54:50Z"
  },
  {
    "title": "Rubio announces 83 percent of USAID contracts cancelled under Trump",
    "description": "The Trump administration has targeted USAID as part of his efforts to trim government spending and reduce 'waste'.",
    "link": "https://www.aljazeera.com/news/2025/3/10/rubio-announces-83-percent-of-usaid-contracts-cancelled-under-trump",
    "timestamp": "2025-03-10T16:53:51Z"
  },
  {
    "title": "Canada markets airports to investors in push to attract capital",
    "description": "Canada encouraged private investors to help speed up the development of its airports amid a push to boost domestic investment. Read more.",
    "link": "https://financialpost.com/investing/canada-markets-airports-investors-attract-capital",
    "timestamp": "2025-03-10T16:53:48Z"
  },
  {
    "title": "As Starliner astronauts prepare for return, look back at the mission's biggest moments",
    "description": "With the astronauts who crewed the Boeing Starliner due home in the days ahead, here's a recap of their time at the International Space Station.",
    "link": "https://www.usatoday.com/story/news/nation/2025/03/10/starliner-crew-return-iss-space-station/81950078007/",
    "timestamp": "2025-03-10T16:53:30Z"
  },
  {
    "title": "Trump’s Offshore Wind Review to Consider Status of Projects",
    "description": "The Trump administration’s ongoing review of offshore wind projects will feature different treatment for projects actively under development versus those that have merely been proposed, Interior Secretary Doug Burgum said Thursday.",
    "link": "https://gcaptain.com/trumps-offshore-wind-review-to-consider-status-of-projects/",
    "timestamp": "2025-03-10T16:53:16Z"
  },
  {
    "title": "Russia Is Only Winning Inside Trump’s Head",
    "description": "As Russians will tell you, the reality on the ground looks very, very different.",
    "link": "http://foreignpolicy.com/2025/03/10/trump-putin-russia-war-ukraine-victory-peace-ceasefire/",
    "timestamp": "2025-03-10T16:53:09Z"
  },
  {
    "title": "Proposed bill would keep Trump from funding military invasion of Canada",
    "description": "A new U.S. Congress bill would withhold funding for any American invasion of Canada, Panama or Greenland without Congressional approval.",
    "link": "https://nationalpost.com/news/canada/no-invading-allies-act",
    "timestamp": "2025-03-10T16:52:55Z"
  },
  {
    "title": "Stocks tank as Trump declines to dismiss recession risk",
    "description": "Major stock indexes tanked Monday, continuing a sell-off that gathered steam last week as rattled investors began zeroing in on the prospect of a significant fall-off in U.S. growth amid persistent inflation and a wobbling job market.",
    "link": "https://www.nbcnews.com/business/markets/stocks-tank-trump-declines-dismiss-recession-risk-rcna195653",
    "timestamp": "2025-03-10T16:51:19Z"
  },
  {
    "title": "Far-right Romanian Candidate Appeals Presidential Vote Ban",
    "description": "Romanian far-right politician Calin Georgescu on Monday appealed a decision barring him from standing in a presidential vote re-run, which has sparked violent clashes and plunged the EU and NATO member bordering war-torn Ukraine into deeper uncertainty.",
    "link": "https://www.ibtimes.com/far-right-romanian-candidate-appeals-presidential-vote-ban-3765811",
    "timestamp": "2025-03-10T16:51:09Z"
  },
  {
    "title": "Voting opens in election for World Zionist Congress, with future of Israel at stake",
    "description": "Any Jewish adult living in the United States can vote between March 10 and May 4 as long as they accept a set of Zionist principles and pay a $5 registration fee.",
    "link": "https://www.jpost.com/diaspora/article-845495",
    "timestamp": "2025-03-10T16:50:18Z"
  },
  {
    "title": "Ab ki baar, no pyaar, only maar, maar? Trump’s trade war with India and the world",
    "description": "Donald Trump’s second administration is marked by unpredictability and frequent policy changes, affecting global and domestic politics. His aggressive trade stance, particularly towards India, and evolving China policy are central to current US foreign relati…",
    "link": "https://m.economictimes.com/opinion/et-commentary/ab-ki-baar-no-pyaar-only-maar-maar-trumps-trade-war-with-india-and-the-world/articleshow/118854315.cms",
    "timestamp": "2025-03-10T16:50:15Z"
  },
  {
    "title": "Another US Funding Cut Threatens Human Rights in North Korea",
    "description": "The halt to funding for the NED threatens to shut down groups documenting and helping to stop human rights abuses in North Korea.",
    "link": "https://thediplomat.com/2025/03/another-us-funding-cut-threatens-human-rights-in-north-korea/",
    "timestamp": "2025-03-10T16:49:00Z"
  },
  {
    "title": "Trump shares message to millions struggling to buy groceries ‘Shut up about egg prices’",
    "description": "Trump campaigned on a promise of lowering the cost of groceries, but so far, has been unable to lower prices.",
    "link": "https://www.mlive.com/news/2025/03/trump-shares-message-to-millions-struggling-to-buy-groceries-shut-up-about-egg-prices.html",
    "timestamp": "2025-03-10T16:47:00Z"
  },
  {
    "title": "How Trans Coming-of-Age Comedy ‘She’s the He’ Plays on Locker Room Hysteria to Tackle the ‘Fear Around Every Corner’ of the Trump Era",
    "description": "In the indie comedy “She’s the He,” which premiered at SXSW on Sunday, high school seniors Alex and Ethan decide during the last week of school to pretend they’re trans so they can sneak into the women’s locker room. If that sounds like a premise lifted right…",
    "link": "https://variety.com/2025/film/news/shes-the-he-trans-movie-trump-sxsw-1236333234/",
    "timestamp": "2025-03-10T16:46:55Z"
  },
  {
    "title": "Lauren Boebert’s ‘Pimp Cane’ Insult Of Black Lawmaker Sparks Backlash",
    "description": "Rep. Lauren Boebert (R-Colo.) was slammed on social media and accused of hypocrisy over the way she criticized Rep. Al Green (D-Texas) for heckling and pointing his cane toward Donald Trump during the president’s speech to a joint session of Congress last wee…",
    "link": "https://freerepublic.com/focus/f-chat/4303342/posts",
    "timestamp": "2025-03-10T16:46:28Z"
  },
  {
    "title": "South Dakota Law Raises Questions About Future of Massive Midwest Pipeline",
    "description": "A new law in South Dakota prohibiting the use of eminent domain to acquire land for carbon capture pipelines raises questions about the viability of a proposed 2,500 mile (4,023-kilometer) project snaking through five Midwest states. Summit Carbon Solutions, …",
    "link": "https://www.insurancejournal.com/news/midwest/2025/03/10/815011.htm",
    "timestamp": "2025-03-10T16:46:22Z"
  },
  {
    "title": "Health and Human Services Offers Employees $25,000 Buyout",
    "description": "The Health and Human Services Department (HHS) has more than 80,000 federal workers responsible for researching diseases, inspecting food.",
    "link": "https://www.blackenterprise.com/health-and-human-services-offers-employees-25000-buyout/",
    "timestamp": "2025-03-10T16:46:22Z"
  },
  {
    "title": "‘Takedown Tesla’ protest: Hundreds gather in Chicago to criticize spending cuts by Elon Musk and Donald Trump",
    "description": "Hundreds of people gathered downtown Saturday afternoon to protest President Donald Trump and Elon Musk’s government spending cuts, carrying signs that read “Launch Musk to Mars” and “Democracy Dies with DOGE.”\nProtesters marched down Michigan Avenue and past…",
    "link": "https://biztoc.com/x/89acac29931bc530",
    "timestamp": "2025-03-10T16:45:53Z"
  },
  {
    "title": "20 states sue President Trump’s administration over mass firings of probationary federal workers",
    "description": "By BRIAN WITTE | Associated Press\nANNAPOLIS, Md. — Maryland and 19 other states are suing multiple federal agencies, contending President Donald Trump’s administration has illegally fired thousands of federal probationary workers.\nRELATED: California is No. 1…",
    "link": "https://biztoc.com/x/f410171cf2ed73f0",
    "timestamp": "2025-03-10T16:45:51Z"
  },
  {
    "title": "Trump 2.0 and the Indo-Pacific: Navigating stormy waters or charting a new course?",
    "description": "Discussion at the CUTS International’s webinar focused on the Indo-Pacific region's geopolitics, trade, and security under Trump's second term. Experts highlighted the region's vulnerability to U.S.-China competition and the need for collective security and a…",
    "link": "https://economictimes.indiatimes.com/news/india/trump-2-0-and-the-indo-pacific-navigating-stormy-waters-or-charting-a-new-course/articleshow/118854182.cms",
    "timestamp": "2025-03-10T16:45:35Z"
  },
  {
    "title": "This Isn't Four-Dimensional Chess. Trump's Helping Russia. (William Kristol/The Bulwark)",
    "description": "William Kristol / The Bulwark:\nThis Isn't Four-Dimensional Chess.  Trump's Helping Russia.  —  Great things are ahead, Donald Trump is pretty sure!  Although, look, he's not going to promise us the moon, by—for example—guaranteeing there won't be a recession …",
    "link": "https://www.memeorandum.com/250310/p63",
    "timestamp": "2025-03-10T16:45:01Z"
  },
  {
    "title": "Saudi Arabia tries to shed 'pariah status,' remaking itself as a key middleman in global conflicts",
    "description": "Saudi Arabia will host a key summit Tuesday between Secretary of State Marco Rubio and Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.nbcnews.com/news/world/saudia-arabia-talks-ukraine-russia-marco-rubio-zelenskyy-bin-salman-rcna195277",
    "timestamp": "2025-03-10T16:45:00Z"
  },
  {
    "title": "'Trump Will Have a Big Smile on His Face': Canada's Conservatives Launch Campaign Against Trudeau Successor Mark Carney",
    "description": "Canadian Conservative Party Leader Pierre Poilievre began his campaign against Liberal Party leader Mark Carney before he was elected.\nThe post ‘Trump Will Have a Big Smile on His Face’: Canada’s Conservatives Launch Campaign Against Trudeau Successor Mark Ca…",
    "link": "https://www.breitbart.com/politics/2025/03/10/trump-will-have-big-smile-his-face-canadas-conservatives-launch-campaign-against-trudeau-successor-mark-carney/",
    "timestamp": "2025-03-10T16:44:32Z"
  },
  {
    "title": "Canadian Province Slaps 25% Tax Increase On Electricity Exports To U.S.",
    "description": "1.5 million Americans are now paying around $70 more a month for electricity because of Trump’s tariffs.",
    "link": "https://www.huffpost.com/entry/ap-cn-canada-us-tariffs_n_67cf13bce4b0c23ef0b8175c",
    "timestamp": "2025-03-10T16:44:10Z"
  },
  {
    "title": "Ontario says it will slap a 25% surcharge on US-bound electricity",
    "description": "The move is in retaliation to Trump's tariff threats on Canada, and is expected to raise energy costs for 1.5 million US homes.",
    "link": "https://www.bbc.com/news/articles/c5yrpnr6kr2o",
    "timestamp": "2025-03-10T16:43:42Z"
  },
  {
    "title": "Men's concerns are real but backlash is not inevitable—the new rules guiding feminism",
    "description": "It's a difficult period for the feminist movement. Space has opened up in public life for people who argue, very loudly, that efforts to level the playing field for women have come at the expense of men.",
    "link": "https://phys.org/news/2025-03-men-real-backlash-inevitable-feminism.html",
    "timestamp": "2025-03-10T16:43:04Z"
  },
  {
    "title": "Trump pushing US into 'totally unnecessary' recession and he 'will own it': Dem operative",
    "description": "Rahm Emanuel, former ambassador to Japan, said on CNN Monday that Trump's disastrous lack of diplomacy with Canada is plunging the U.S. toward a \"totally unnecessary\" recession, while stoking anti-American sentiment around the world.The Situation Room's Wolf …",
    "link": "https://www.rawstory.com/trump-recession-2671299468/",
    "timestamp": "2025-03-10T16:42:53Z"
  },
  {
    "title": "The GOP’s Budget Proposal Would Cut Medicaid. Most Oppose That Idea, Poll Finds.",
    "description": "More than 8 in 10 Americans want Medicaid spending kept the same or increased, a recent KFF poll shows.",
    "link": "https://truthout.org/articles/the-gops-budget-proposal-would-cut-medicaid-most-oppose-that-idea-poll-finds/",
    "timestamp": "2025-03-10T16:42:41Z"
  },
  {
    "title": "Stock market sell-off worsens as Wall Street wonders how much pain Trump will endure for the economy",
    "description": "The U.S. stock market's sell-off is worsening Monday as Wall Street questions how much pain President Donald Trump is willing for the economy to endure in order to get what he wants.",
    "link": "https://www.pbs.org/newshour/economy/stock-market-sell-off-worsens-as-wall-street-wonders-how-much-pain-trump-will-endure-for-the-economy",
    "timestamp": "2025-03-10T16:42:00Z"
  },
  {
    "title": "CNN’s Fareed Zakaria Warns Trump Leaving the U.S. ‘More Isolated, Mistrusted, and Insecure’ In a ‘Post-America World’",
    "description": "\"As this world unravels, America's privileged position will also decline, creating a more dangerous and impoverished world and a more isolated, mistrusted, and insecure America.\"\nThe post CNN’s Fareed Zakaria Warns Trump Leaving the U.S. ‘More Isolated, Mistr…",
    "link": "https://www.mediaite.com/politics/cnns-fareed-zakaria-warns-trump-leaving-the-u-s-more-isolated-mistrusted-and-insecure-in-a-post-america-world/",
    "timestamp": "2025-03-10T16:41:30Z"
  },
  {
    "title": "The Tesla protests are getting bigger — and rowdier",
    "description": "This weekend, protests escalated at Tesla showrooms across the nation. Hundreds of people gathered to boycott Elon Musk and his involvement in the Trump administration as the head of the Department of Government Efficiency (DOGE), which is overseeing a massiv…",
    "link": "https://www.theverge.com/news/626851/tesla-takedown-protests-elon-musk",
    "timestamp": "2025-03-10T16:41:01Z"
  },
  {
    "title": "Carney Gets to Work in Ottawa as Election Drumbeat Grows Louder",
    "description": "Mark Carney began laying the groundwork to take over quickly as Canada’s prime minister, with lawmakers and cabinet ministers holding key meetings Monday after Liberal Party members chose him as their new leader.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-gets-to-work-in-ottawa-as-election-drumbeat-grows-louder",
    "timestamp": "2025-03-10T16:39:28Z"
  },
  {
    "title": "Levin Rips Dems for Trump Speech Response: 'What a Bunch of Children, What a Bunch of Immature Individuals'",
    "description": "During the opening monologue of his Sunday \"Life, Liberty & Levin\" broadcast, FNC host Mark Levin criticized congressional Democrats for their response to President Donald Trump's address to a joint session of Congress last week.\nThe post Levin Rips Dems for …",
    "link": "https://www.breitbart.com/clips/2025/03/10/levin-rips-dems-for-trump-speech-response-what-a-bunch-of-children-what-a-bunch-of-immature-individuals/",
    "timestamp": "2025-03-10T16:39:16Z"
  },
  {
    "title": "'The Postal Service has bound our nation together'",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-postal-service-photos-trump-china",
    "timestamp": "2025-03-10T16:39:04Z"
  },
  {
    "title": "Alyssa Farah Griffin Slams “Sickening” Tate Brothers On ‘The View’: “I Loathe These Guys So Much”",
    "description": "\"They’re being looked into for allegations of human trafficking.\"",
    "link": "https://decider.com/2025/03/10/alyssa-farah-griffin-slams-sickening-tate-brothers-view/",
    "timestamp": "2025-03-10T16:35:57Z"
  },
  {
    "title": "Public service student-loan forgiveness 'is not changing today' while Trump works to redefine who is eligible, Education Department says",
    "description": "President Donald Trump's recent executive order is aimed at limiting the Public Service Loan Forgiveness program.\nJIM WATSON/POOL/AFP via Getty Images\nTrump signed an executive order seeking to limit Public Service Loan Forgiveness eligibility.\nThe Education …",
    "link": "https://biztoc.com/x/1e87eadeac627493",
    "timestamp": "2025-03-10T16:35:05Z"
  }
]