[
  {
    "title": "Why Is a House Democrat Making Nice With El Salvador’s President?",
    "description": "Donald Trump is a big fan of El Salvador’s President Nayib Bukele and turns a blind eye to his administration’s myriad human rights violations and increasing authoritarianism, in exchange for El Salvador’s accepting deportees of any nationality. \r\nBut why doe…",
    "link": "https://newrepublic.com/post/195864/house-democrat-making-nice-el-salvador-president",
    "timestamp": "2025-05-29T19:25:47Z"
  },
  {
    "title": "'Insane radical leftists' are gone: Zuckerberg and Palmer Luckey reunite for US military project",
    "description": "Billionaire entrepreneur Palmer Luckey says Meta is a very different company than it used to be, and he's ready to work with Mark Zuckerberg again after being fired from Facebook in 2017.Luckey, the creator of virtual reality goggles called Oculus Rift, was f…",
    "link": "https://www.theblaze.com/news/zuckerberg-wins-back-palmer-luckey",
    "timestamp": "2025-05-29T19:25:00Z"
  },
  {
    "title": "YB Is Free: Trump Pardons NBA Youngboy, Social Media Reacts",
    "description": "NBA YoungBoy, received a presidential pardon from Donald Trump on Wednesday",
    "link": "https://hiphopwired.com/playlist/yb-is-free-trump-pardons-nba-youngboy-social-media-reacts/",
    "timestamp": "2025-05-29T19:24:59Z"
  },
  {
    "title": "Q&A: Why the US and Israel are not on the same page over how to deal with Iran",
    "description": "The US president, Donald Trump, claimed on May 28 to have personally stopped Israel from attacking Iran's nuclear facilities. When asked if he'd intervened during a phone call with the Israeli prime minister, Benjamin Netanyahu, Trump replied: \"Well, I'd like…",
    "link": "https://phys.org/news/2025-05-qa-israel-page-iran.html",
    "timestamp": "2025-05-29T19:24:04Z"
  },
  {
    "title": "Trump tariffs reinstated by appeals court for now",
    "description": "A federal appeals court granted the Trump administration's request to temporarily pause a lower-court ruling that struck down most of Trump's tariffs.",
    "link": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
    "timestamp": "2025-05-29T19:22:45Z"
  },
  {
    "title": "Exclusive -- Manufacturer Who Won 2nd Tariff Case: Trump Should 'Rally Around Small Businesses Like Ours'",
    "description": "Rick Woldenberg, the CEO of Learning Resources Inc., which defeated President Donald Trump's tariffs in a D.C. federal court Thursday, said that he hopes the case spurs the president to rally around small business.\nThe post Exclusive — Manufacturer Who Won 2n…",
    "link": "https://www.breitbart.com/politics/2025/05/29/exclusive-rick-woldenberg-manufacturer-who-won-2nd-tariff-case-trump-should-rally-around-small-businesses-like-ours/",
    "timestamp": "2025-05-29T19:22:39Z"
  },
  {
    "title": "Trump and DOJ threaten California over trans athlete's participation in women's sports",
    "description": "Despite what you may hear from the White House, it’s Donald Trump's attacks on the Department of Education, not transgender athletes, that are the real threat to women's sports.",
    "link": "https://biztoc.com/x/5826c4ff26d4b1bc",
    "timestamp": "2025-05-29T19:21:56Z"
  },
  {
    "title": "Supreme Court Reins in Judges A little Bit in Latest Ruling",
    "description": "The US Supreme Court on Thursday in an 8-0 ruling reined in judges just a little bit as rogue judges wage a war on the Trump Administration.\nThe post Supreme Court Reins in Judges A little Bit in Latest Ruling appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/supreme-court-reins-judges-little-bit-latest-ruling/",
    "timestamp": "2025-05-29T19:20:50Z"
  },
  {
    "title": "Musk says no deal signed with Telegram despite Grok integration announcement",
    "description": "Elon Musk stated on May 28 that xAI had not signed an agreement with Telegram to distribute the Grok large language model, despite Telegram founder Pavel Duvov’s announcement earlier on the same day. Durov wrote that he and Musk “agreed to a one-year partners…",
    "link": "https://cryptoslate.com/musk-says-no-deal-signed-with-telegram-despite-grok-integration-announcement/",
    "timestamp": "2025-05-29T19:20:49Z"
  },
  {
    "title": "What is the Court of International Trade? And why can it strike down Trump’s tariffs?",
    "description": "A little-known federal court threw a giant monkey wrench into a foundational part of President Donald Trump’s economic agenda by striking down most of the sweeping tariffs he has imposed since taking office.",
    "link": "https://www.click2houston.com/business/2025/05/29/what-is-the-court-of-international-trade-and-why-can-it-strike-down-trumps-tariffs/",
    "timestamp": "2025-05-29T19:20:25Z"
  },
  {
    "title": "Hemingway Presses White House: What Are You Actually Doing To Stop Ongoing Judicial Coup?",
    "description": "Federalist Editor-In-Chief Mollie Hemingway used her opportunity as the new media journalist in Thursday’s White House press briefing to question whether the Trump administration plans to take any action to stop an ongoing effort by lower courts to impede Pre…",
    "link": "https://freerepublic.com/focus/f-news/4319836/posts",
    "timestamp": "2025-05-29T19:19:42Z"
  },
  {
    "title": "Trump Admin Misleads the Supreme Court About Its South Sudan Deportations",
    "description": "The Justice Department argued that a federal judge forced the Trump admin to detain migrants in Djibouti, but the timeline tells a different story.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-supreme-court-south-sudan-deportations-mislead-1235350607/",
    "timestamp": "2025-05-29T19:18:43Z"
  },
  {
    "title": "Trump Family Says Harvard Grudge Has Zero To Do With Barron’s College Decision",
    "description": "A spokesperson for first lady Melania Trump set the record straight in a statement to E! News.",
    "link": "https://www.huffpost.com/entry/barron-trump-not-rejected-harvard-never-applied_n_683887e9e4b06ff5140d45b5",
    "timestamp": "2025-05-29T19:18:14Z"
  },
  {
    "title": "Gov. Gretchen Whitmer ‘Disappointed’ as Trump Considers Pardoning Men Who Plotted to Kidnap Her",
    "description": "\"We have to condemn political violence, no matter where it comes from, no matter who it's aimed at,\" said Whitmer.",
    "link": "https://time.com/7289704/governor-gretchen-whitmer-response-trump-considers-pardoning-kidnap-plot-men/",
    "timestamp": "2025-05-29T19:17:46Z"
  },
  {
    "title": "Prime Minister Mark Carney welcomes US court ruling striking down Trump’s tariffs, calls it a “vindication” of Canada’s trade position",
    "description": "Mark Carney hails US court's decision against Donald Trump's tariffs on Canada. The court deemed the tariffs unlawful. Carney notes the ruling supports Canada's stance. He cautions that trade relations face ongoing threats from other US protectionist measures…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/prime-minister-mark-carney-welcomes-us-court-ruling-striking-down-trumps-tariffs-calls-it-a-vindication-of-canadas-trade-position/articleshow/121498247.cms",
    "timestamp": "2025-05-29T19:17:11Z"
  },
  {
    "title": "What To Expect Now That Trump Has Scrapped Biden's Crippling AI Regulations",
    "description": "President Donald Trump pledged to remove barriers to American leadership in AI in January. The president recently made good on this promise by directing",
    "link": "https://reason.com/2025/05/29/what-to-expect-now-that-trump-has-scrapped-bidens-crippling-ai-regulations/",
    "timestamp": "2025-05-29T19:16:48Z"
  },
  {
    "title": "India may float paper on crypto assets norms in June",
    "description": "India is preparing to release a discussion paper on crypto assets, influenced by the IMF and FSB, amid growing global acceptance spurred by the US's evolving stance. This comes as the nation considers regulatory frameworks and stakeholder input, with no rush …",
    "link": "https://economictimes.indiatimes.com/news/economy/finance/india-may-float-paper-on-crypto-assets-norms-in-june/articleshow/121498215.cms",
    "timestamp": "2025-05-29T19:15:16Z"
  },
  {
    "title": "Oil Declines as OPEC+ Supply Concerns Overshadow Tariff Relief",
    "description": "Oil declined as soft US economic data and concerns about rising supplies eroded the risk-on sentiment from a court ruling that blocked a swath of the Trump administration’s tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-declines-as-opec-supply-concerns-overshadow-tariff-relief",
    "timestamp": "2025-05-29T19:15:09Z"
  },
  {
    "title": "Social Media Brutally Mocks Elon Musk's Goodbye Note To DOGE",
    "description": "The Tesla mogul's inability to find a fraction of the fraud he originally promised made his thank-you to Trump a ripe target for internet snark.",
    "link": "https://www.huffpost.com/entry/social-media-brutally-mocks-elon-musks-goodbye-note-to-doge_n_68389a6ae4b06202aa9183d6",
    "timestamp": "2025-05-29T19:13:21Z"
  },
  {
    "title": "Why is Donald Trump cracking down on international students?",
    "description": "US administration said it will revoke the visas of Chinese students.",
    "link": "https://www.aljazeera.com/program/inside-story/2025/5/29/why-is-donald-trump-cracking-down-on-international-students",
    "timestamp": "2025-05-29T19:12:46Z"
  },
  {
    "title": "Harvard’s bogus ‘free speech’ claim — 1st Amendment doesn’t make taxpayers cough up cash",
    "description": "Harvard is howling after President Trump turned off its federal money spigot — but giving the university $3 billion was an executive-branch choice.",
    "link": "https://nypost.com/2025/05/29/opinion/sorry-harvard-free-speech-doesnt-mean-taxpayer-cash/",
    "timestamp": "2025-05-29T19:11:48Z"
  },
  {
    "title": "David Stockman: Trump Is a 'Faker' on the Debt",
    "description": "How will we ever get the national debt under control? Just asking questions. \nThe U.S. national debt stands at a staggering $36 trillion. And while President Donald Trump assures us he's a \"fiscal hawk,\" the GOP's latest fiscal plan, dubbed the One Big Beauti…",
    "link": "https://biztoc.com/x/26eef28b1dca973a",
    "timestamp": "2025-05-29T19:10:55Z"
  },
  {
    "title": "Court's tariffs ruling offers US businesses a reprieve but they aren't ready to celebrate",
    "description": "Businesses that have been unsettled by President Donald Trump’s on again, off again tariffs don't know how much faith to put in the reprieve from a federal court that halted most of the taxes on foreign imports",
    "link": "https://abcnews.go.com/Business/wireStory/courts-tariffs-ruling-offers-us-businesses-reprieve-ready-122323032",
    "timestamp": "2025-05-29T19:10:42Z"
  },
  {
    "title": "Megyn Kelly: Secret Service Suspends Agents After Brawl Outside Obama Home",
    "description": "Megyn Kelly commented on reporting from RCP's Susan Crabtree about two female Secret Service agents suspended after a physical brawl outside of former President Obama's house.\r\n\r\n#BREAKING AND EXCLUSIVE: @RCPolitics has obtained video of the fight between…",
    "link": "https://www.realclearpolitics.com/video/2025/05/29/megyn_kelly_secret_service_suspends_agents_after_brawl_outside_obama_home.html",
    "timestamp": "2025-05-29T19:09:50Z"
  },
  {
    "title": "Court’s tariffs ruling offers US businesses a reprieve but they aren’t ready to celebrate",
    "description": "NEW YORK (AP) — Businesses that have been unsettled by President Donald Trump’s on again, off again tariffs grappled Thursday with how much faith to put in the latest reprieve, which came from a federal court that halted most of the taxes on foreign imports. …",
    "link": "https://financialpost.com/pmn/courts-tariffs-ruling-offers-us-businesses-a-reprieve-but-they-arent-ready-to-celebrate",
    "timestamp": "2025-05-29T19:08:36Z"
  },
  {
    "title": "The Trump Administration Is Trapping Migrant Kids In Shelters",
    "description": "In recent years, kids stayed in Office of Refugee Resettlement shelters for about a month. By April, that had climbed to 217 days, with many kids stranded indefinitely.",
    "link": "https://www.huffpost.com/entry/trump-administration-trapping-migrant-kids-in-shelters_n_6838881ce4b06202aa9172a6",
    "timestamp": "2025-05-29T19:08:35Z"
  },
  {
    "title": "‘Instead of Steps towards Peace, We Have Witnessed a Brutal Surge in Large-Scale Russian Attacks Across’ Ukraine, Under-Secretary-General Tells Security Council",
    "description": "Rather than progress towards peace following direct negotiations between the Russian Federation and Ukraine in Istanbul earlier in May, the Security Council heard today that the month’s closing days have instead witnessed Moscow intensify attacks on its neigh…",
    "link": "https://press.un.org/en/2025/16073.doc.htm",
    "timestamp": "2025-05-29T19:06:37Z"
  },
  {
    "title": "‘Instead of Steps towards Peace, We Have Witnessed a Brutal Surge in Large-Scale Russian Attacks Across’ Ukraine, Under-Secretary-General Tells Security Council",
    "description": "Rather than progress towards peace following direct negotiations between the Russian Federation and Ukraine in Istanbul earlier in May, the Security Council heard today that the month’s closing days have instead witnessed Moscow intensify attacks on its neigh…",
    "link": "https://press.un.org/en/2025/sc16073.doc.htm",
    "timestamp": "2025-05-29T19:06:37Z"
  },
  {
    "title": "OpenSea Relaunches Trading Platform With Rewards Ahead of SEA Token Debut",
    "description": "NFT marketplace OpenSea has fully launched \"OS2\" with fungible token trading and user rewards, ahead of the expected SEA token launch.",
    "link": "https://decrypt.co/322825/opensea-relaunches-platform-rewards-sea-token",
    "timestamp": "2025-05-29T19:06:27Z"
  },
  {
    "title": "Trump, tariffs and the Middle East are looming challenges for Albanese",
    "description": "The prime minister is heading to the G7 meeting in Canada, where he's expected to hold his first face-to-face meeting with US President Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-05-30/trump-tariffs-middle-east-looming-challenges-for-albanese/105355240",
    "timestamp": "2025-05-29T19:04:46Z"
  },
  {
    "title": "Mahmoud Khalil Demands Info on Trump Administration Collusion with Anti-Palestinian Doxxing Groups",
    "description": "Lawyers for Mahmoud Khalil today submitted a Freedom of Information Act (FOIA) request seeking records of the Trump administration’s communications with the anti-Palestinian organizations that targeted him prior to his arrest. Mr. Khalil remains detained in L…",
    "link": "https://www.commondreams.org/newswire/mahmoud-khalil-demands-info-on-trump-administration-collusion-with-anti-palestinian-doxxing-groups",
    "timestamp": "2025-05-29T19:03:12Z"
  },
  {
    "title": "Trump and DOJ threaten California over trans athlete's participation in women's sports",
    "description": "Despite what you may hear from the White House, it’s Donald Trump's attacks on the Department of Education, not transgender athletes, that are the real threat to women's sports.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-doj-california-trans-athlete-womens-sports-rcna209753",
    "timestamp": "2025-05-29T19:02:46Z"
  },
  {
    "title": "NPR CEO rips Trump order to defund as ‘retaliation,’ insists media outlet is 'non-partisan'",
    "description": "NPR CEO Katherine Maher argued against President Donald Trump's order to cut NPR funding, citing it as \"retaliation\" for editorial content he doesn't like.",
    "link": "https://www.foxnews.com/media/npr-ceo-rips-trump-order-defund-retaliation-insists-media-outlet-non-partisan",
    "timestamp": "2025-05-29T19:01:38Z"
  },
  {
    "title": "Trump Administration Expedites Approval for New Uranium Mine in Utah",
    "description": "The reopening of this mine aligns with Trump administration push to expedite the development of U.S. nuclear energy capacity.\nThe post Trump Administration Expedites Approval for New Uranium Mine in Utah first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-administration-expedites-approval-for-new-uranium-mine-in-utah/",
    "timestamp": "2025-05-29T19:00:49Z"
  },
  {
    "title": "Judge Rules Pulitzer Board Can’t Tell Trump How To Manage Schedule",
    "description": "A Florida appeals court on Wednesday rejected the Pulitzer Prize Board’s argument that President Donald Trump's defamation lawsuit against the board should be delayed until after Trump leaves office in order to avoid distracting him from his presidential duti…",
    "link": "https://freebeacon.com/media/judge-rules-pulitzer-board-cant-tell-trump-how-to-manage-schedule/",
    "timestamp": "2025-05-29T19:00:45Z"
  },
  {
    "title": "SA Chief Rabbi: President Ramaphosa “cursed” for ICJ case against Israel",
    "description": "Rabbi Warren Goldstein says South Africa's leader cursed Israel and now faces global humiliation, failure to condemn 'Kill the Boer' chant, and rising violence marks ANC's moral collapse.",
    "link": "https://www.israelnationalnews.com/news/409205",
    "timestamp": "2025-05-29T19:00:06Z"
  },
  {
    "title": "Trump meets with the Federal Reserve chairman he has repeatedly scorned",
    "description": "President Donald Trump met with Federal Reserve Chair Jerome Powell and the two discussed the economy but not Powell’s outlook for interest rates, the Fed said",
    "link": "https://biztoc.com/x/97a06bc72bb46b41",
    "timestamp": "2025-05-29T19:00:05Z"
  },
  {
    "title": "AI-generated videos spurred rumor that Barron Trump debated Jasmine Crockett on live TV",
    "description": "In May 2025, Barron Trump, the son of U.S. President Donald Trump, debated Rep. Jasmine Crockett on live TV.",
    "link": "https://www.snopes.com//fact-check/barron-trump-jasmine-crockett-debate/",
    "timestamp": "2025-05-29T19:00:00Z"
  },
  {
    "title": "Uncertainty Surrounds Future of Iran Nuclear Agreement",
    "description": "As the fifth round of nuclear talks between Iran and the United States wrapped up in Rome earlier this month, the public saw little sign of breakthrough. But there have been reports about proposals to break the deadlock as Washington is insisting Iran give up…",
    "link": "https://oilprice.com/Geopolitics/International/Uncertainty-Surrounds-Future-of-Iran-Nuclear-Agreement.html",
    "timestamp": "2025-05-29T19:00:00Z"
  },
  {
    "title": "White House slams court decision to block Trump tariffs as 'blatantly wrong'",
    "description": "Stocks worldwide began to rise following the court’s decision.",
    "link": "https://www.thejournal.ie/white-house-court-trump-tariffs-6718875-May2025/",
    "timestamp": "2025-05-29T18:59:05Z"
  },
  {
    "title": "David Stockman: Trump Is a 'Faker' on the Debt",
    "description": "Reagan's budget chief warns that the One Big Beautiful Bill Act could balloon the national debt to $60 trillion, risking a catastrophic bond market crisis.",
    "link": "https://reason.com/podcast/2025/05/29/david-stockman-trump-is-a-faker-on-the-debt/",
    "timestamp": "2025-05-29T18:57:10Z"
  },
  {
    "title": "Zelenskiy accuses Russia of 'another deception' by holding back peace memorandum",
    "description": "KYIV (Reuters) -Ukrainian President Volodymyr Zelenskiy said on Thursday that Russia was engaging in \"yet another deception\" by failing to hand over its peace settlement proposal ahead of a potential meeting between Moscow and Kyiv. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/30/zelenskiy-accuses-russia-of-039another-deception039-by-holding-back-peace-memorandum",
    "timestamp": "2025-05-29T18:57:00Z"
  },
  {
    "title": "From Harvard to Wichita State, colleges cancel special ceremonies for graduates from marginalized backgrounds",
    "description": "Graduating students of color at Harvard University and other colleges across the country would end their semester by attending affinity graduation ceremonies — but this year, they had to organize these celebrations without the school’s financial backing.",
    "link": "https://www.nbcnews.com/news/nbcblk/dei-black-lgbtq-affinity-ceremonies-harvard-rcna209587",
    "timestamp": "2025-05-29T18:56:13Z"
  },
  {
    "title": "Jeffco Public Schools’ teachers union votes ‘no confidence’ in Superintendent Tracy Dorland",
    "description": "Jefferson County Education Association President Brooke Williams said the union is supportive of the school board replacing Superintendent Tracy Dorland.",
    "link": "https://www.denverpost.com/2025/05/29/jeffco-public-schools-union-no-confidence-superintendent-tracy-dorland/",
    "timestamp": "2025-05-29T18:56:02Z"
  },
  {
    "title": "Trump issues series of pardons for politicians, a union leader and a rapper (Will Weissert/Associated Press)",
    "description": "Will Weissert / Associated Press:\nTrump issues series of pardons for politicians, a union leader and a rapper  —  President Donald Trump issued a series of pardons on Wednesday, awarding them to a former New York congressman, a Connecticut governor, a rapper …",
    "link": "https://www.memeorandum.com/250529/p83",
    "timestamp": "2025-05-29T18:55:01Z"
  },
  {
    "title": "Did Michelle Obama hint that Donald Trump's youngest son, Barron, has autism?",
    "description": "Michelle Obama's recent podcast episode sparked controversy with comments about aging sperm and potential birth defects, leading to speculation about a veiled reference to Donald Trump and his youngest son, Barron. While discussing women's health, Obama remar…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-michelle-obama-hint-that-donald-trumps-youngest-son-barron-has-autism-donald-trump-news/articleshow/121497463.cms",
    "timestamp": "2025-05-29T18:54:55Z"
  },
  {
    "title": "Gay People Have More in Common With Straight People Than Trans People: Poll",
    "description": "Gay and bisexual individuals have made societal strides in the past two decades, but transgender people have some ground to make up in the public.",
    "link": "https://www.newsweek.com/transgender-gay-lgbtq-pew-poll-2078622",
    "timestamp": "2025-05-29T18:53:55Z"
  },
  {
    "title": "Not so fast: Trump can still impose tariffs despite court ruling — here’s how",
    "description": "Despite a recent court setback limiting Trump's tariff powers under IEEPA, he retains multiple legal avenues to impose new taxes on foreign imports. Options include Section 122 for quick, short-term tariffs, Section 232 based on national security, Section 301…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/not-so-fast-trump-can-still-impose-tariffs-despite-court-ruling-heres-how/articleshow/121498053.cms",
    "timestamp": "2025-05-29T18:53:41Z"
  },
  {
    "title": "Supreme Court ruling scales back environmental law and backs Utah oil railroad expansion",
    "description": "The Supreme Court has backed a multibillion-dollar oil railroad expansion in Utah in a ruling that scales back a key environmental law.",
    "link": "https://www.pbs.org/newshour/nation/supreme-court-ruling-scales-back-environmental-law-and-backs-utah-oil-railroad-expansion",
    "timestamp": "2025-05-29T18:53:33Z"
  },
  {
    "title": "Trump tariffs blocked by court — but the US President can still reimpose them with these 2 laws",
    "description": "A federal court struck down President Trump's tariffs, citing overreach. But the White House plans to appeal and reassert duties using alternative laws from 1962 and 1974, signaling no retreat in Trump's “America First” trade agenda.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-tariffs-blocked-by-court-but-the-us-president-can-still-reimpose-them-with-these-2-laws/articleshow/121498041.cms",
    "timestamp": "2025-05-29T18:53:25Z"
  },
  {
    "title": "Trump tariffs case could head to Supreme Court as soon as Friday",
    "description": "The White House appeal comes as a second court declares many of Trump's tariffs unlawful.",
    "link": "https://www.bbc.com/news/articles/c93ywvl7yy5o",
    "timestamp": "2025-05-29T18:52:39Z"
  },
  {
    "title": "Trump tariffs decision rests on arguments conservatives repeatedly used against Biden | CNN Politics",
    "description": "The blockbuster federal court ruling that halts President Donald Trump from imposing some of his most sweeping tariffs rests in part on a legal theory that conservative groups repeatedly used at the Supreme Court to block former President Joe Biden’s agenda.",
    "link": "https://www.cnn.com/2025/05/29/politics/tariffs-major-questions-doctrine-supreme-court",
    "timestamp": "2025-05-29T18:51:58Z"
  },
  {
    "title": "Jasmine Crockett Insists Republicans Actually Like Her and Tell Her So All the Time Despite Trump’s ‘Low IQ’ Digs",
    "description": "Rep. Jasmine Crockett (D-TX) insisted that Republicans like her and tell her so all the time and that's the reason President Donald Trump targets her.\nThe post Jasmine Crockett Insists Republicans Actually Like Her and Tell Her So All the Time Despite Trump’s…",
    "link": "https://www.mediaite.com/media/podcasts/jasmine-crockett-insists-republicans-actually-like-her-and-tell-her-so-all-the-time-despite-trumps-low-iq-digs/",
    "timestamp": "2025-05-29T18:50:24Z"
  },
  {
    "title": "A federal court ruled Trump’s tariffs are illegal. Here’s what happens now",
    "description": "Donald Trump’s trade war got a lot more complicated Wednesday evening as a little-known, but powerful, federal court, ruled that Trump had exceeded his authority in imposing tariffs and labeled those “Liberation Day” duties illegal.\nThat, effectively, will pu…",
    "link": "https://biztoc.com/x/393c4fb16245882e",
    "timestamp": "2025-05-29T18:48:42Z"
  },
  {
    "title": "All the celebrities Trump has pardoned, from reality stars to rappers",
    "description": "President Donald Trump added to his list of pardoned celebrities this week, including reality TV stars Todd and Julie Chrisley and rapper NBA Young Boy.",
    "link": "https://biztoc.com/x/ac4d125e67c23cd0",
    "timestamp": "2025-05-29T18:48:26Z"
  },
  {
    "title": "All the celebrities Trump has pardoned, from reality stars to rappers",
    "description": "President Donald Trump added to his list of pardoned celebrities this week, including reality TV stars Todd and Julie Chrisley and rapper NBA Young Boy.",
    "link": "https://biztoc.com/x/ac4d125e67c23cd0",
    "timestamp": "2025-05-29T18:48:26Z"
  },
  {
    "title": "Todd and Julie Chrisley reunite for first time in over 2 years after pardons",
    "description": "The couple haven't seen one another since surrendering to prison in Jan. 2023.",
    "link": "https://nypost.com/2025/05/29/entertainment/todd-julie-chrisley-reunite-for-first-time-in-over-2-years-after-pardons/",
    "timestamp": "2025-05-29T18:48:07Z"
  },
  {
    "title": "Republican threatens to kill DC transit funding unless it names trains for Trump",
    "description": "A Florida Republican is demanding that Washington, D.C., name subway trains in its transit system after President Donald Trump and, If it doesn't, he says Congress will cut funding to the public system shared by the district as well as the states of Maryland …",
    "link": "https://www.rawstory.com/congress-2672231066/",
    "timestamp": "2025-05-29T18:47:16Z"
  },
  {
    "title": "The Headlines Are Evil, and They're Bringing Us Down",
    "description": "Article URL: https://writing.kemitchell.com/2025/05/29/Trump-Tariffs-Decision-Headlines\nComments URL: https://news.ycombinator.com/item?id=44128971\nPoints: 6\n# Comments: 2",
    "link": "https://writing.kemitchell.com/2025/05/29/Trump-Tariffs-Decision-Headlines",
    "timestamp": "2025-05-29T18:46:31Z"
  },
  {
    "title": "Nvidia rallies as the rest of Wall Street drifts after a US court blocks many of Trump's tariffs",
    "description": "A big rally for stocks that began in Asia is easing off the accelerator amid uncertainty about what will happen next after a U.S. court blocked many of President Donald Trump’s sweeping tariffs",
    "link": "https://abcnews.go.com/US/wireStory/nvidia-rallies-rest-wall-street-drifts-after-us-122294350",
    "timestamp": "2025-05-29T18:46:17Z"
  },
  {
    "title": "Israel signs off on Gaza truce proposal, says White House",
    "description": "Trump ‘has presented proposal to Hamas’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/29/israel-signs-off-on-gaza-truce-proposal-says-white-house/",
    "timestamp": "2025-05-29T18:46:02Z"
  },
  {
    "title": "What is the Court of International Trade? And why can it strike down Trump's tariffs?",
    "description": "A little-known federal court threw a giant monkey wrench into a foundational part of President Donald Trump’s economic agenda by striking down most of the sweeping tariffs he has imposed since taking office",
    "link": "https://abcnews.go.com/US/wireStory/court-international-trade-strike-trumps-tariffs-122321935",
    "timestamp": "2025-05-29T18:46:00Z"
  },
  {
    "title": "Judge to extend block on Trump move to revoke Harvard’s ability to enrol international students",
    "description": "Judge signals broad injunction after Trump administration plans longer process to block enrolment of international students",
    "link": "https://www.irishtimes.com/world/us/2025/05/29/judge-to-extend-block-on-trump-move-to-revoke-harvards-ability-to-enrol-international-students/",
    "timestamp": "2025-05-29T18:44:01Z"
  },
  {
    "title": "What is the Court of International Trade? And why can it strike down Trump’s tariffs?",
    "description": "WASHINGTON (AP) — A little-known federal court threw a giant monkey wrench into a foundational part of President Donald Trump’s economic agenda by striking down most of the sweeping tariffs he has imposed since taking office. The Court of International Trade,…",
    "link": "https://financialpost.com/pmn/what-is-the-court-of-international-trade-and-why-can-it-strike-down-trumps-tariffs",
    "timestamp": "2025-05-29T18:43:33Z"
  },
  {
    "title": "Trump Wants ABC’s Broadcast License Revoked. That’s Ironic.",
    "description": "After the ex-president’s terrible debate performance, conservatives claim the network is biased. If anything, it aided their rise.",
    "link": "https://www.livemint.com/opinion/online-views/trump-wants-abc-s-broadcast-license-revoked-that-s-ironic-11748544114134.html",
    "timestamp": "2025-05-29T18:41:53Z"
  },
  {
    "title": "Nolte: Business Insider CEO Announces Far-Left News Outlet Laying Off 21% of Staff, Embracing AI",
    "description": "After already laying off eight percent of its staff in January 2024, the far-left Business Insider has announced it’s axing an additional 21 percent of its remaining staff.\nThe post Nolte: Business Insider CEO Announces Far-Left News Outlet Laying Off 21% of …",
    "link": "https://www.breitbart.com/the-media/2025/05/29/nolte-business-insider-ceo-announces-far-left-news-outlet-laying-off-21-of-staff-embracing-ai/",
    "timestamp": "2025-05-29T18:41:03Z"
  },
  {
    "title": "John Deere to Invest $20 Billion in America – New Assembly Lines, Factories, and US Steel",
    "description": "A major announcement from John Deere is giving more hope for a future with a prosperous economy.\nThe post John Deere to Invest $20 Billion in America – New Assembly Lines, Factories, and US Steel appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/john-deere-invest-20-billion-america-new-assembly/",
    "timestamp": "2025-05-29T18:40:35Z"
  },
  {
    "title": "$14 billion in clean energy projects have been canceled in the US this year, analysis says",
    "description": "A new analysis finds that more than $14 billion in clean energy projects in the U.S. have been canceled this year",
    "link": "https://abcnews.go.com/Business/wireStory/14-billion-clean-energy-projects-canceled-us-year-122300680",
    "timestamp": "2025-05-29T18:38:15Z"
  },
  {
    "title": "Powell goes to the White House — and tells Trump the Fed will do its own thing on interest rates",
    "description": "Federal Reserve Chair Jerome Powell met with U.S. President Donald Trump today at the White House to discuss the state of the economy.Read more...",
    "link": "https://qz.com/jermone-powell-trump-fed-interest-rates-white-house-1851782974",
    "timestamp": "2025-05-29T18:38:00Z"
  },
  {
    "title": "Fed Chair Powell told Trump in Thursday meeting that rate decisions would be based on 'non-political' analysis",
    "description": "President Donald Trump met Thursday with Federal Reserve Chair Jerome Powell amid the president badgering the central bank for lower interest rates.\nThe central bank confirmed in a release that the meeting occurred, stressing that the future path of monetary …",
    "link": "https://biztoc.com/x/03191ae4782380b0",
    "timestamp": "2025-05-29T18:37:49Z"
  },
  {
    "title": "GOP Lawmaker Says Trump Should Get A 3rd Term To 'Reset' The Courts",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA House Republican lawmaker renewed his calls on Thursday for President Donald Trump to serve a third term in office so he can \"reset\" the courts.\nThe Context\nRepublican Representative Andy Ogles of Tennessee …",
    "link": "https://biztoc.com/x/622883db0c04b45c",
    "timestamp": "2025-05-29T18:37:30Z"
  },
  {
    "title": "Fed Governor Kugler monitoring markets amid trade shifts, dollar concerns",
    "description": "Investing.com -- Federal Reserve Governor Adriana Kugler expressed concern on Thursday about the impact of changing trade policies and a potential decrease...",
    "link": "https://finance.yahoo.com/news/fed-governor-kugler-monitoring-markets-183610611.html",
    "timestamp": "2025-05-29T18:36:10Z"
  },
  {
    "title": "Fired Up Dan Bongino Puts James Comey on Notice: 'We Found Stuff' Hidden at FBI HQ",
    "description": "Deputy FBI Director Dan Bongino says Americans are going to be \"stunned\" by the materials found from Jim Comey's tenure as FBI director.",
    "link": "https://www.westernjournal.com/fired-dan-bongino-puts-james-comey-notice-found-stuff-hidden-fbi-hq/",
    "timestamp": "2025-05-29T18:35:58Z"
  },
  {
    "title": "Todd and Julie Chrisley Reunite for 1st Time After Prison Release",
    "description": "Todd Chrisley and wife Julie Chrisley have reunited after they were each released from prison. Todd, 56, and Julie, 52, were seemingly spotted catching up in a Thursday, May 29, Instagram Story post shared by their daughter Savannah. The upload featured a sti…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-and-julie-chrisley-reunite-after-prison-release/#article",
    "timestamp": "2025-05-29T18:35:52Z"
  },
  {
    "title": "Peter Doocy Asks Karoline Leavitt If Trump Thinks Jill Biden Should Testify About Biden’s Decline",
    "description": "Fox News White House correspondent Peter Doocy asked press secretary Karoline Leavitt on Thursday if former first lady Jill Biden should be called to testify.",
    "link": "https://dailycaller.com/2025/05/29/doocy-karoline-leavitt-jill-biden-testify-coverup/",
    "timestamp": "2025-05-29T18:34:17Z"
  },
  {
    "title": "'Too hard for him': Analyst claims Musk 'caved' before DOGE could make progress",
    "description": "Panelists on CNN's Inside Politics gave their theories Thursday on the reasons why Elon Musk has completely eschewed Washington now that his allotted time overseeing the Department of Government Efficiency is up.\n\n\"It was too hard for him,\" correspondent Jeff…",
    "link": "https://www.rawstory.com/musk-doge-2672230846/",
    "timestamp": "2025-05-29T18:33:51Z"
  },
  {
    "title": "Pakistan To Launch Strategic Bitcoin Reserve Amid Global Race For Digital Gold",
    "description": "In a landmark announcement on May 28, a crypto advisor to Pakistan revealed that the government is planning to launch a strategic Bitcoin reserve. Pakistan’s move reflects the wider trend of nation-states embracing pro-crypto policies following the regulatory…",
    "link": "https://zycrypto.com/pakistan-to-launch-strategic-bitcoin-reserve-amid-global-race-for-digital-gold/",
    "timestamp": "2025-05-29T18:32:49Z"
  },
  {
    "title": "Oxfam Warns Israel's 'Annihilation Campaign' Is 'Entirely Erasing Gaza'",
    "description": "Israel's U.S.-backed mass displacement of Palestinians in the Gaza Strip \"is entirely erasing Gaza,\" a leading international charity said Thursday as the United Nations' Middle East peace envoy warned that ongoing airstrikes, forced starvation, and general de…",
    "link": "https://www.commondreams.org/news/erase-gaza",
    "timestamp": "2025-05-29T18:32:17Z"
  },
  {
    "title": "Trump meets with Jerome Powell, the Fed chairman he has repeatedly scorned",
    "description": "President Trump met with Federal Reserve Chair Jerome Powell and the two discussed the economy but not Powell’s outlook for interest rates, the Fed said.",
    "link": "https://www.pbs.org/newshour/nation/trump-meets-with-jerome-powell-the-fed-chairman-he-has-repeatedly-scorned",
    "timestamp": "2025-05-29T18:31:40Z"
  },
  {
    "title": "Iran says a US nuclear deal isn't imminent and that its enrichment program must continue",
    "description": "Senior Iranian officials on Thursday dismissed speculation about an imminent nuclear deal with the United States, emphasizing that any agreement must fully lift sanctions and allow the country’s nuclear program to continue",
    "link": "https://abcnews.go.com/International/wireStory/iran-us-nuclear-deal-imminent-enrichment-program-continue-122321344",
    "timestamp": "2025-05-29T18:30:40Z"
  },
  {
    "title": "GOP Lawmaker Says Trump Should Get A 3rd Term To 'Reset' The Courts",
    "description": "Rep. Andy Ogles railed against what he characterized as \"judicial overreach\" and said Trump should get to serve a third term.",
    "link": "https://www.newsweek.com/andy-ogles-trump-third-term-reset-courts-tariffs-2078645",
    "timestamp": "2025-05-29T18:30:26Z"
  },
  {
    "title": "CNET's Daily Tariff Price Tracker: I'm Following 11 Key Products as Trump's Plans Hit a Wall",
    "description": "A trade court has ruled Trump's tariff barrage illegal, but the possibility that they will raise prices remains very real.",
    "link": "https://www.cnet.com/tech/cnets-daily-tariff-price-tracker-im-following-11-key-products-as-trumps-plans-hit-a-wall/",
    "timestamp": "2025-05-29T18:30:00Z"
  },
  {
    "title": "'Just as it should be': What Harvard president Alan Garber and others said at Commencement ceremony",
    "description": "Harvard University's commencement unfolded amidst political tensions and global uncertainties, with speakers championing resilience and diversity. The ceremony highlighted Harvard's defense of its values against the Trump administration's threats, as speakers…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/just-as-it-should-be-what-harvard-president-alan-garber-and-others-said-at-commencement-ceremony/articleshow/121497511.cms",
    "timestamp": "2025-05-29T18:29:11Z"
  },
  {
    "title": "CNN Guest Describes Trump’s Whole Personality In Just 3 Words",
    "description": "“He’s the president of the United States. You’re defending that?” podcaster Jennifer Welch said on the panel.",
    "link": "https://www.huffpost.com/entry/cnn-guest-describes-trumps-whole-personality-in-just-3-words_n_68388304e4b06202aa916913",
    "timestamp": "2025-05-29T18:29:06Z"
  },
  {
    "title": "RFK Jr.’s MAHA Report Cites Research Studies That Don’t Exist",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr.'s MAHA Report featured several seemingly fake studies and incorrect attributions.",
    "link": "http://www.rollingstone.com/politics/politics-news/rfk-jr-maha-report-fake-research-studies-1235350468/",
    "timestamp": "2025-05-29T18:26:52Z"
  },
  {
    "title": "Donald Trump Taking DOGE Lead After Elon Musk Exit",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump will lead the Department of Government Efficiency (DOGE) following Elon Musk's departure as his Special Government Employee status ends.\nTrump will also farm out the tasks of cutting \"wa…",
    "link": "https://biztoc.com/x/b1faeabeb056eb09",
    "timestamp": "2025-05-29T18:26:38Z"
  },
  {
    "title": "Donald Trump meets with Jerome Powell, the Federal Reserve chairman he has repeatedly scorned",
    "description": "U.S. President Donald Trump met with Federal Reserve Chair Jerome Powell on Thursday and the two discussed the economy but not Powell’s outlook for interest rates, the Fed said.\nPowell told Trump that the central bank would make decisions about the short-term…",
    "link": "https://biztoc.com/x/5ea9851d34598023",
    "timestamp": "2025-05-29T18:26:07Z"
  },
  {
    "title": "Donald Trump Taking DOGE Lead After Elon Musk Exit",
    "description": "Elon Musk has ended his tenure as the head of DOGE as his special government employee status lapses following months of turmoil.",
    "link": "https://www.newsweek.com/donald-trump-taking-doge-lead-elon-musk-exit-2078647",
    "timestamp": "2025-05-29T18:24:11Z"
  },
  {
    "title": "MAGA senator fact-checked over 'baffling' list of false Trump accomplishments",
    "description": "Sen. Bernie Moreno (R-OH) went to X to post some of the triumphs that President Donald Trump had accomplished in just a few short months in office — the only problem is, almost none of what he advertised was actually true.\n\"Scorecard under @realDonaldTrump: ✅…",
    "link": "https://www.rawstory.com/bernie-moreno-2672225616/",
    "timestamp": "2025-05-29T18:23:38Z"
  },
  {
    "title": "Trump steps up call for US rate cuts in talks with Fed chief",
    "description": "US President Donald Trump on Thursday stepped up the pressure on Federal Reserve chair Jerome Powell to cut interest rates, in their first sit-down since the Republican returned to the White House in January. Trump has in recent months trained his fire on the…",
    "link": "https://www.digitaljournal.com/world/trump-steps-up-call-for-us-rate-cuts-in-talks-with-fed-chief/article",
    "timestamp": "2025-05-29T18:22:33Z"
  },
  {
    "title": "Video: Trump and Kash Patel Desperately Trying to Cover Up Connections to Jeffrey Epstein",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump FBI Director Kash Patel failing to cover up for Donald Trump’s despicable past.",
    "link": "https://littlegreenfootballs.com/article/54641_Video-_Trump_and_Kash_Patel_De",
    "timestamp": "2025-05-29T18:22:11Z"
  },
  {
    "title": "Trump officials downplay court ruling that blocked sweeping tariffs",
    "description": "SummaryTrump administration has said it will appeal court ruling Second federal court blocks some levies Markets see modest gains in response Analysts say even a pause provides valuable time May 29 (Reuters) - Senior Trump administration officials on Thursday…",
    "link": "https://freerepublic.com/focus/f-news/4319816/posts",
    "timestamp": "2025-05-29T18:21:17Z"
  },
  {
    "title": "Trump tariffs aren't dead yet: 4 experts explain what could derail a stock market just 4% from record highs",
    "description": "Trump can still keep his trade war going and send market volatility soaring despite a court order blocking tariffs, market experts said.",
    "link": "https://www.businessinsider.com/stock-market-outlook-trump-tariffs-blocked-taco-sp500-2025-5",
    "timestamp": "2025-05-29T18:21:00Z"
  },
  {
    "title": "All the celebrities Trump has pardoned, from reality stars to rappers",
    "description": "President Donald Trump added to his list of pardoned celebrities this week, including reality TV stars Todd and Julie Chrisley and rapper NBA Young Boy.",
    "link": "https://www.nbcnews.com/news/us-news/are-celebrities-trump-pardoned-far-rcna209736",
    "timestamp": "2025-05-29T18:20:53Z"
  }
]