[
  {
    "title": "Transcript: Humiliated Trump’s Anger at Putin Grows as GOP Angst Rises",
    "description": "The following is a lightly edited transcript of the May 28 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresident …",
    "link": "https://newrepublic.com/article/195767/transcript-humiliated-trump-anger-putin-grows-gop-angst-rises",
    "timestamp": "2025-05-28T10:40:52Z"
  },
  {
    "title": "Who Are The Afrikaners Seeking Refuge In US?",
    "description": "By Jacob Adams, The Daily Signal | May 24, 2025\nPresident Donald Trump raised the issue of the killings of white South Africans in that country during an Oval Office visit by its president this week.\nIt came as the Trump administration expedited the refugee c…",
    "link": "https://biztoc.com/x/a18b1a8e661fb2af",
    "timestamp": "2025-05-28T10:40:18Z"
  },
  {
    "title": "The Librarian Of Congress Should Support The Founders’ Goal Of Protecting American Creators",
    "description": "By Adam Mossoff, The Daily Signal | May 24, 2025\nPresident Donald Trump fired Librarian of Congress Carla Hayden on May 9. Since then, he’s announced that Deputy Attorney General Todd Blanche will assume the role of acting librarian of Congress.\nTrump’s ultim…",
    "link": "https://biztoc.com/x/5eac7221f2dbe423",
    "timestamp": "2025-05-28T10:40:12Z"
  },
  {
    "title": "Apple and US tariffs: The future of iPhone production",
    "description": "President Trump threatened a hefty 25% tariff against Apple unless they manufacture phones sold in the U.S. stateside.",
    "link": "https://www.ketv.com/article/iphone-production-us-tariffs-apple-decision/64901332",
    "timestamp": "2025-05-28T10:39:28Z"
  },
  {
    "title": "Nvidia to have final say on strong earnings season for Big Tech",
    "description": "Nvidia faces a crucial earnings test after a significant rally fueled by strong AI spending commitments from major customers and new demand from the Middle East. Investors are closely watching the supply of Blackwell chips, profit margins, and the impact of U…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-to-have-final-say-on-strong-earnings-season-for-big-tech/articleshow/121463373.cms",
    "timestamp": "2025-05-28T10:38:36Z"
  },
  {
    "title": "Pardoned Todd Chrisley's Son Kyle Hopes for Reconciliation With Family",
    "description": "Todd Chrisley’s son Kyle is hoping for a family reconciliation following President Donald Trump’s decision to pardon his dad and stepmom, Julie. “I’m ecstatic. Truly. I just found out a little bit ago and I still just can’t believe it,” Kyle, 33, told E! News…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisleys-pardon-kyle-hopes-for-family-reconciliation-page/#article",
    "timestamp": "2025-05-28T10:37:29Z"
  },
  {
    "title": "Kremlin Rebuffs Zelensky's Call For Three-way Meeting With Trump, Putin",
    "description": "The Kremlin on Wednesday rebuffed a call by Ukrainian President Volodymyr Zelensky for a three-way summit with Donald Trump and Vladimir Putin as Kyiv seeks to force Moscow to halt its three-year-long invasion.",
    "link": "https://www.ibtimes.com.au/kremlin-rebuffs-zelenskys-call-three-way-meeting-trump-putin-1859122",
    "timestamp": "2025-05-28T10:33:10Z"
  },
  {
    "title": "South Africa's president pushes back on Trump's demand to arrest politician who chanted 'kill the farmer'",
    "description": "South African President Cyril Ramaphosa says he will not have Julius Malema, who repeatedly chants “Kill the farmer,\" arrested despite a demand from President Donald Trump.",
    "link": "https://www.foxnews.com/world/south-africas-president-pushes-back-trumps-demand-arrest-politician-who-chanted-kill-farmer",
    "timestamp": "2025-05-28T10:32:54Z"
  },
  {
    "title": "‘TACO’: Wall Street Mocks Trump With 4-Letter Code to Call Bets Against Him",
    "description": "Wall Street traders have developed a biting new acronym for a strategy that’s become surprisingly lucrative for Trump’s whiplash-inducing trade policy.\nThe post ‘TACO’: Wall Street Mocks Trump With 4-Letter Code to Call Bets Against Him first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/taco-wall-street-mocks-trump-with-4-letter-code-to-call-bets-against-him/",
    "timestamp": "2025-05-28T10:30:38Z"
  },
  {
    "title": "Donald Trump ripped by another rock icon: ‘We are staring down a dark channel’",
    "description": "Donald Trump ripped by another rock icon: ‘We are staring down a dark channel’pennlive.com",
    "link": "https://www.pennlive.com/entertainment/2025/05/donald-trump-ripped-by-another-rock-icon-we-are-staring-down-a-dark-channel.html",
    "timestamp": "2025-05-28T10:30:38Z"
  },
  {
    "title": "Upgraded Very Large Array Telescope Will Spot Baby Solar Systems—If It’s Funded",
    "description": "A new telescope project called the Next-Generation Very Large Array will revolutionize radio astronomy if it gets the funding it needs",
    "link": "https://www.scientificamerican.com/article/upgraded-very-large-array-telescope-will-spot-baby-solar-systems-if-its/",
    "timestamp": "2025-05-28T10:30:00Z"
  },
  {
    "title": "Kayleigh McEnany Makes Chilling Demand For ‘60 Minutes’ Reporter Over Anti-Trump Speech",
    "description": "The Trump White House press secretary-turned-Fox News host railed over Scott Pelley’s now-viral address at Wake Forest University.",
    "link": "https://www.huffpost.com/entry/kayleigh-mcenany-scott-pelley-fox-news-trump-speech_n_6836db0fe4b09d67a28cc9d6",
    "timestamp": "2025-05-28T10:29:47Z"
  },
  {
    "title": "Regime Uncertainty And The Trump New Deal",
    "description": "By William L. Anderson, Mises Wire | May 22, 2025\nAs we moved through the fourth month of the Donald Trump presidency, chaos seems to be the situation for the economy. The recent announcement that the GDP had shrunk slightly has spooked the markets, as the up…",
    "link": "https://biztoc.com/x/f7c4f37d5aaa1430",
    "timestamp": "2025-05-28T10:28:52Z"
  },
  {
    "title": "Japan urges universities to accept students hit by US block",
    "description": "The Japanese government has asked local universities to consider accepting students at US universities as President Donald Trump seeks to force Harvard to submit to unprecedented oversight. Japanese Education Minister Toshiko Abe said on Tuesday that her mini…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/japan-urges-universities-to-accept-students-hit-by-us-block/articleshow/121462836.cms",
    "timestamp": "2025-05-28T10:27:41Z"
  },
  {
    "title": "Why Apple doesn’t make iPhones in America – and probably won’t | CNN Business",
    "description": "In 2011, then-President Barack Obama pressed Apple CEO Steve Jobs on what it would take to bring iPhone production to the United States, according to The New York Times.",
    "link": "https://www.cnn.com/2025/05/28/tech/apple-iphone-trump-america-china",
    "timestamp": "2025-05-28T10:27:07Z"
  },
  {
    "title": "Trump lawyer in Harvard battle says DOJ intends to sue UC over antisemitism allegations",
    "description": "A Justice Department official leading President Donald Trump's battle against Harvard says the administration intends to take the University of California to court over alleged antisemitism.",
    "link": "https://www.jpost.com/international/article-855745",
    "timestamp": "2025-05-28T10:25:49Z"
  },
  {
    "title": "20 EU countries call for action over Hungary’s Pride ban",
    "description": "20 EU countries have called for a response to Hungary’s law banning LGBTQ+ Pride marches. The law was signed into effect by prime minister Viktor Orbán in March, after it was submitted to parliament by his ruling Fidesz party. It set fines of up to 200,000 fo…",
    "link": "https://www.thepinknews.com/2025/05/28/20-eu-countries-call-for-action-over-hungarys-pride-ban/",
    "timestamp": "2025-05-28T10:25:02Z"
  },
  {
    "title": "Trump Bitcoin Company to Go Public",
    "description": "“American Bitcoin, a new bitcoin miner backed by U.S. President Donald Trump's two eldest sons, said on Monday it will list on the Nasdaq via an all-stock merger with Gryphon Digital Mining,” Reuters reports.",
    "link": "https://politicalwire.com/2025/05/28/trump-bitcoin-company-to-go-public/",
    "timestamp": "2025-05-28T10:23:00Z"
  },
  {
    "title": "Centrica Expands to New York With Build-Out of Gas Trading Unit",
    "description": "Centrica Plc is opening a trading office in New York that will underpin its growth in natural gas.",
    "link": "https://financialpost.com/pmn/business-pmn/centrica-expands-to-new-york-with-build-out-of-gas-trading-unit",
    "timestamp": "2025-05-28T10:22:23Z"
  },
  {
    "title": "US scolds Russia for stoking World War Three fears",
    "description": "US President Donald Trump’s envoy, Keith Kellogg, on Wednesday scolded a top Russian official for stoking fears of World War Three after Trump warned President Vladimir Putin was “playing with fire” over Ukraine. -snip- US envoy Kellogg quoted Medvedev’s post…",
    "link": "https://freerepublic.com/focus/f-chat/4319501/posts",
    "timestamp": "2025-05-28T10:21:04Z"
  },
  {
    "title": "Weather researchers kick off 100-hour livestream as data-driven protest against Trump's science cuts",
    "description": "In response to US President Trump's science funding cuts, climate and weather scientists are hosting a 100-hour livestream. The event showcases the importance of their work, from hurricane prediction to climate patterns, emphasizing the threat these cuts pose…",
    "link": "https://economictimes.indiatimes.com/news/international/us/weather-researchers-kick-off-100-hour-livestream-as-data-driven-protest-against-trumps-science-cuts/articleshow/121462977.cms",
    "timestamp": "2025-05-28T10:18:58Z"
  },
  {
    "title": "Kremlin on Trump's 'playing with fire' comments: National interests paramount for Putin",
    "description": "MOSCOW (Reuters) -Kremlin spokesman Dmitry Peskov, in comments about U.S. President Donald Trump's remark that Vladimir Putin was \"playing with fire\" by refusing to engage in ceasefire talks with Kyiv, said the national interest was paramount for the Russian …",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/kremlin-on-trump039s-039playing-with-fire039-comments-national-interests-paramount-for-putin",
    "timestamp": "2025-05-28T10:18:00Z"
  },
  {
    "title": "Peskov: Trump wants speedy settlement in Ukraine",
    "description": "Kremlin spokesperson Dmitry Peskov said on Wednesday that United States President Donald Trump wants a \"speedy\" settlement to the conflict in Ukraine after being asked about Trump's comments that Russ...",
    "link": "https://biztoc.com/x/e3eb7d37b7418cf4",
    "timestamp": "2025-05-28T10:18:00Z"
  },
  {
    "title": "Why Two Republicans Voted Against Trump’s ‘Big, Beautiful’ Bill",
    "description": "By Adam Pack via Daily Caller News Foundation | April 21, 2025\nTwo Republican fiscal hawks voted against the “one big, beautiful bill” despite overwhelming pressure from House GOP leadership and President Donald Trump to support the legislation.\nRepublican Re…",
    "link": "https://biztoc.com/x/0eed12c10e1410a5",
    "timestamp": "2025-05-28T10:17:37Z"
  },
  {
    "title": "Donald Trump Jr. Reveals How Getting 'De-Banked,' 'De-Insured' Led Him And Eric Trump To 'Orange Pill' Their Father On Crypto",
    "description": "Donald Trump Jr., the eldest son of U.S. President Donald Trump, disclosed how he and his brother, Eric Trump, influenced their father’s views on Bitcoin (CRYPTO: BTC) and cryptocurrency.\nWhat Happened: Speaking at the Bitcoin 2025 conference in Las Vegas on …",
    "link": "https://biztoc.com/x/df1e56974d35ea3d",
    "timestamp": "2025-05-28T10:17:37Z"
  },
  {
    "title": "Elon Musk says Trump tax bill weakens Doge cost-cutting efforts",
    "description": "Remarks may widen rift between US president and Tesla boss as Musk appears to criticise Trump’s One Beautiful Bill Act\nElon Musk has publicly criticised Donald Trump’s tax bill, saying the US president’s spending plan undermines cost-cutting efforts that the …",
    "link": "https://biztoc.com/x/baea2e4d3cb4969d",
    "timestamp": "2025-05-28T10:17:35Z"
  },
  {
    "title": "Zelensky meets Merz in Germany for talks on Ukraine war",
    "description": "Ukrainian President Volodymyr Zelensky visited Germany on Wednesday to meet Chancellor Friedrich Merz, who has pledged muscular backing for Kyiv in its fight against Russia.",
    "link": "https://www.thelocal.de/20250528/zelensky-meets-merz-in-germany-for-talks-on-ukraine-war",
    "timestamp": "2025-05-28T10:17:05Z"
  },
  {
    "title": "'Still don't believe it's real': Savannah Chrisley reacts to Trump pardoning parents",
    "description": "After hearing the news that President Donald Trump will pardon reality TV stars Todd and Julie Chrisley, Savannah Chrisley,celebrated the news on Instagram.",
    "link": "https://abcnews.go.com/US/real-savannah-chrisley-reacts-parents-pardoned-trump/story?id=122258896",
    "timestamp": "2025-05-28T10:16:51Z"
  },
  {
    "title": "U.S. Responds to Gaza Aid Mission's Chaotic Start",
    "description": "Food was distributed to Palestinians in a scramble that was also marked by Israeli gunfire",
    "link": "https://www.newsweek.com/us-responds-gaza-aid-missions-chaotic-start-2077788",
    "timestamp": "2025-05-28T10:16:35Z"
  },
  {
    "title": "Musk ‘disappointed’ by Trump’s ‘Big Beautiful Bill’",
    "description": "The billionaire has said the tax bill “undermines” cost-cutting efforts by his efficiency agency Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618250-musk-tax-bill-criticism/",
    "timestamp": "2025-05-28T10:14:38Z"
  },
  {
    "title": "Texas Senate passes bill to define the difference between man and woman based on reproductive organs. Check details",
    "description": "The Texas Senate has passed a bill to define who a woman is. House Bill 229 strictly defines men and women based on the reproductive organs they were born with, and orders state records to reflect this binary. The bill passed on second reading 86-36 after an …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-texas-senate-passes-bill-to-define-the-difference-between-man-and-woman-based-on-reproductive-organs-check-details/articleshow/121462639.cms",
    "timestamp": "2025-05-28T10:13:32Z"
  },
  {
    "title": "What is a stablecoin and what could it mean for your finances?",
    "description": "The crypto tokens could change everyday payments. But they pose risks.",
    "link": "https://abcnews.go.com/Business/stablecoin-finances/story?id=122108448",
    "timestamp": "2025-05-28T10:09:00Z"
  },
  {
    "title": "US banks tiptoe toward crypto, awaiting more green light from regulators",
    "description": "US banks are cautiously exploring cryptocurrency expansion amid regulatory easing, focusing on pilot projects and partnerships. While JPMorgan remains sceptical, others like Charles Schwab and Bank of America plan crypto offerings. Banks seek clearer guidelin…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-banks-tiptoe-toward-crypto-awaiting-more-green-light-from-regulators/articleshow/121462761.cms",
    "timestamp": "2025-05-28T10:08:22Z"
  },
  {
    "title": "Kremlin on Trump's 'playing with fire' comments: National interests paramount for Putin",
    "description": "Kremlin spokesman Dmitry Peskov, in comments about U.S. President Donald Trump's remark that Vladimir Putin was \"playing with fire\" by refusing to engage in ...",
    "link": "https://www.yahoo.com/news/kremlin-trumps-playing-fire-comments-100821841.html",
    "timestamp": "2025-05-28T10:08:21Z"
  },
  {
    "title": "Iran might accept US IAEA inspectors if nuclear deal reached",
    "description": "DUBAI: Iran might allow the UN atomic watchdog to send US inspectors to Iranian sites if Tehran's talks with Washington succeed, Iran's nuclear chief Mohammad Eslami said on Wednesday (May 28). Tehran and Washington are expected to hold a sixth round of talks…",
    "link": "https://www.channelnewsasia.com/world/iran-might-accept-us-iaea-inspectors-if-nuclear-deal-reached-5156756",
    "timestamp": "2025-05-28T10:08:06Z"
  },
  {
    "title": "Any US-Iran deal should include 'robust' IAEA inspections, Grossi says",
    "description": "VIENNA: Any deal between Iran and the US that would impose fresh nuclear curbs on Iran should include \"very robust\" inspections by the UN nuclear watchdog, International Atomic Energy Agency chief Rafael Grossi said on Wednesday (May 28). The two countries ar…",
    "link": "https://www.channelnewsasia.com/world/any-us-iran-deal-should-include-robust-iaea-inspections-grossi-says-5156756",
    "timestamp": "2025-05-28T10:08:00Z"
  },
  {
    "title": "Nearly Half of Americans Say Trump Not Being Transparent About Health",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nNearly half of Americans believe President Donald Trump is not being transparent about his health, according to a new poll.\nThe latest YouGov/Economist poll, conducted between May 23 and 26 among 1,660 adults,…",
    "link": "https://biztoc.com/x/3663df963ebef3f2",
    "timestamp": "2025-05-28T10:06:41Z"
  },
  {
    "title": "Trump Was Right To Shame South African President",
    "description": "By Jarrett Stepman, The Daily Signal | May 22, 2025\nIn one of the most incredible scenes in American diplomatic history, President Donald Trump halted his meeting with the South African president Wednesday to show him a video montage of threats made to white …",
    "link": "https://biztoc.com/x/72751a8416472ace",
    "timestamp": "2025-05-28T10:06:12Z"
  },
  {
    "title": "US banks tiptoe toward crypto, awaiting more green light from regulators",
    "description": "NEW YORK :Big U.S. banks are holding internal discussions about expanding into cryptocurrencies as they get stronger endorsements from regulators, but initial steps will be tentative, centering on pilot programs, partnerships or limited crypto trading, accord…",
    "link": "https://www.channelnewsasia.com/business/us-banks-tiptoe-toward-crypto-awaiting-more-green-lights-regulators-5156976",
    "timestamp": "2025-05-28T10:05:51Z"
  },
  {
    "title": "US banks tiptoe toward crypto, awaiting more green light from regulators",
    "description": "NEW YORK :Big U.S. banks are holding internal discussions about expanding into cryptocurrencies as they get stronger endorsements from regulators, but initial steps will be tentative, centering on pilot programs, partnerships or limited crypto trading, accord…",
    "link": "https://www.channelnewsasia.com/business/us-banks-tiptoe-toward-crypto-awaiting-more-green-light-regulators-5156976",
    "timestamp": "2025-05-28T10:05:51Z"
  },
  {
    "title": "Trump has not ‘cancelled’ Pride month – it’s a deepfake video",
    "description": "President Donald Trump hasn’t used a video announcement to cancel Pride month. Althoughthe US president has been criticised for his anti-LGBTQ+ executive orders and making bizarre claims about transgender mice, and for sharing Nazi-era insignia online, he has…",
    "link": "https://www.thepinknews.com/2025/05/28/trump-pride-month-video-deepfake/",
    "timestamp": "2025-05-28T10:05:50Z"
  },
  {
    "title": "Nearly Half of Americans Say Trump Not Being Transparent About Health",
    "description": "The White House physician has said the president is in excellent physical health, but some voters say Trump is not being transparent.",
    "link": "https://www.newsweek.com/nearly-half-americans-say-trump-not-being-transparent-about-health-2077825",
    "timestamp": "2025-05-28T10:04:24Z"
  },
  {
    "title": "Trump Admin Fast-Tracks Approval of Utah Uranium Mine in Mere Weeks",
    "description": "A rapid 14-day environmental review has seen a new uranium mine approved in Utah. The endorsement is part of a refreshed Trump administration process to fast-track permissions for energy and mining projects.\nThe post Trump Admin Fast-Tracks Approval of Utah U…",
    "link": "https://www.breitbart.com/politics/2025/05/28/new-utah-uranium-mine-approved-as-trump-delivers-again-on-promise-to-fast-track-energy-projects/",
    "timestamp": "2025-05-28T10:03:46Z"
  },
  {
    "title": "China and tariffs have wiped off $130 billion from critical chip firm ASML since peak value",
    "description": "ASML, like many chip firms, has been hit by restrictions on exports to China and U.S. tariff uncertainty.",
    "link": "https://www.cnbc.com/2025/05/28/asml-shares-china-and-tariffs-have-wiped-off-130-billion-of-value.html",
    "timestamp": "2025-05-28T10:02:07Z"
  },
  {
    "title": "Atlantic editor doesn't 'understand' the narrative that media covered for Biden's health",
    "description": "Atlantic's Jeffrey Goldberg and CNN's Jake Tapper explore media narratives on Biden's health, referencing the book 'Original Sin' and its investigative findings.",
    "link": "https://www.foxnews.com/media/atlantic-editor-doesnt-understand-narrative-media-covered-bidens-health",
    "timestamp": "2025-05-28T10:00:47Z"
  },
  {
    "title": "Do You Hear What I Hear? Audio Illusions and Misinformation",
    "description": "Are you old enough to remember the “Magic Eye” optical illusion mania that gripped the nation in the 90’s—random patterns that you had to squint at just right for the 3D image to pop out?  It turns out it's not just our eyes that can be fooled. Our ears can p…",
    "link": "https://www.kqed.org/news/12041731/do-you-hear-what-i-hear-audio-illusions-and-misinformation",
    "timestamp": "2025-05-28T10:00:45Z"
  },
  {
    "title": "JD Vance speaking at Bitcoin event today, as Trump's crypto ties grow",
    "description": "The vice president owned over $250,000 worth of Bitcoin as of last year.",
    "link": "https://www.cbsnews.com/news/jd-vance-bitcoin-event-today-trump-administration-crypto-ties-grow/",
    "timestamp": "2025-05-28T10:00:19Z"
  },
  {
    "title": "Democrats Demand Salary Details For Trump’s Political Appointees",
    "description": "Senators want the Trump administration to explain why it's paying \"political cronies\" as much as $195,200 amid its mass firings of civil servants.",
    "link": "https://www.huffpost.com/entry/democrats-trump-political-appointees-salaries_n_68364717e4b09d67a28c7e87",
    "timestamp": "2025-05-28T10:00:06Z"
  },
  {
    "title": "When push comes to shove, Brigitte Macron’s swat was more a mirror than a meme",
    "description": "It came in a blur of cameras and confusion: French President Emmanuel Macron, jaw tense and posture assertive, caught a shove to the face \r\nfrom someone far closer than any protester. The hand belonged to his wife, Brigitte.",
    "link": "https://www.advocate.com/voices/brigitte-emmanuel-macron-shove",
    "timestamp": "2025-05-28T10:00:04Z"
  },
  {
    "title": "Loudmouth Trump just met his match — and it's about damn time",
    "description": "The tide is turning in this fight against Republican fascism, and if you listen you can hear it. And when you hear it, you can feel it. And by God, if you can feel it, well then let it move you to take action.After catching punch after punch from the most ant…",
    "link": "https://www.rawstory.com/raw-investigates/bruce-springsteen-trump/",
    "timestamp": "2025-05-28T10:00:03Z"
  },
  {
    "title": "Trump's Greenland Bid Poses Global Dangers, Says the Woman Facing Him Down",
    "description": "Danish Prime Minister Mette Frederiksen told Newsweek in an interview that Greenland must decide its own fate.",
    "link": "https://www.newsweek.com/trump-greenland-denmark-mette-frederiksen-nato-russia-china-2077596",
    "timestamp": "2025-05-28T10:00:01Z"
  },
  {
    "title": "The Senate's version of Trump's megabill could wind up more harmful than expected",
    "description": "Senate Republicans working on the One Big Beautiful Bill Act recently weakened the filibuster which could help their budget bill past the parliamentarian",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/senate-gop-trump-megabill-rcna209345",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Yaron Lischinsky and Sarah Milgrim Wanted Peace, Not More Hatred",
    "description": "Before one writes\ncritically about the murders\nof Yaron Lischinsky and Sarah Milgrim in Washington by 31-year-old pro-Palestinian Chicago resident Elias Rodriguez, one must first offer a\nfew obvious though necessary qualifications. First, the killing of these…",
    "link": "https://newrepublic.com/article/195705/lischinsky-milgrim-antisemitic-shooting-embassy",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Trump’s Fury at Harvard Gets More Deranged—and Exposes a Big MAGA Scam",
    "description": "President Donald Trump has mostly justified his lawless attempt to restrict international students from attending Harvard University by pretending it’s designed to root out the antisemites, woke radicals, and dangerous terrorists supposedly nesting in their r…",
    "link": "https://newrepublic.com/article/195766/trump-fury-harvard-maga-scam",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Harvard faces war of attrition against Trump administration on multiple fronts",
    "description": "The Trump administration's actions against Harvard, including threats to tax-exempt status and foreign student policies, could reshape higher education dynamics.",
    "link": "https://www.foxnews.com/opinion/harvard-faces-war-attrition-against-trump-administration-multiple-fronts",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "The Supreme Court Wants to Crush Regulation—But Not the Fed",
    "description": "When my daughter Alice was six, she looked down at a roasted half-chicken on her plate, visualized it for the first time as the body of a once-living creature, and announced that she would henceforth be a vegetarian—“except for bacon.” I thought of Alice last…",
    "link": "https://newrepublic.com/article/195765/supreme-court-trump-federal-reserve",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "The two strongest points in NPR’s lawsuit against the Trump administration",
    "description": "A lawsuit from NPR makes a strong case that President Trump lacks the power to block NPR's funding and that his efforts violate the First Amendment.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/npr-lawsuit-trump-executive-order-rcna209323",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Rage and Resentment Are Killing the Great American Road Trip",
    "description": "A record 45 million Americans were expected to travel this Memorial Day weekend, long considered the unofficial kickoff to summer. And most of them were hitting the road. Sarah Kendzior is no stranger to the family road trip. Her family, in fact, has visited …",
    "link": "https://www.motherjones.com/politics/2025/05/trump-national-parks-summer-road-trips-sarah-kendzior/",
    "timestamp": "2025-05-28T10:00:00Z"
  },
  {
    "title": "Fungible cryptos in secondary sales are not securities, Ripple tells SEC",
    "description": "Ripple, the blockchain company behind XRP, argued that fungible cryptocurrencies are not securities when transferred in secondary transactions in a recent letter sent to the US Securities and Exchange Commission (SEC).In its May 27 letter, Ripple cited US att…",
    "link": "https://cointelegraph.com/news/ripple-sec-letter-crypto-not-securities",
    "timestamp": "2025-05-28T09:59:06Z"
  },
  {
    "title": "Nicușor Dan confirmed the conversation with Donald Trump: „thanks for the warm congratulations”",
    "description": "Mediafax\nRomanian President Nicușor Dan confirmed the conversation he had with US President Donald Trump. \"Thanks for the warm congratulations\", Dan sent.\nArticolul Nicușor Dan confirmed the conversation with Donald Trump: „thanks for the warm congratulations…",
    "link": "https://www.mediafax.ro/english/nicusor-dan-confirmed-the-conversation-with-donald-trump-thanks-for-the-warm-congratulations-23558970",
    "timestamp": "2025-05-28T09:57:58Z"
  },
  {
    "title": "ICE Conducts Migrant Raids 20 Minutes From Obama's House",
    "description": "Martha's Vineyard Regional High School, located in Oak Bluffs, is about 8 to 10 miles from the Obamas' residence in Edgartown.",
    "link": "https://www.newsweek.com/ice-raids-martha-vineyard-obama-immigration-2077836",
    "timestamp": "2025-05-28T09:57:33Z"
  },
  {
    "title": "Rob Urie: Why the US Must Officially End the Ukraine War for It to Stop",
    "description": "A hard look at the inertial forces that will keep the Ukraine conflict going unless the US shuts it down.",
    "link": "https://www.nakedcapitalism.com/2025/05/rob-urie-why-the-us-must-officially-end-the-ukraine-war-for-it-to-stop.html",
    "timestamp": "2025-05-28T09:55:34Z"
  },
  {
    "title": "China Responds to Trump Freeze on Student Visa Interviews",
    "description": "The Trump Administration is pausing student visa interviews at U.S. embassies and consulates.",
    "link": "https://www.newsweek.com/china-responds-trump-freeze-student-visa-interviews-2077871",
    "timestamp": "2025-05-28T09:51:46Z"
  },
  {
    "title": "James Galbraith: Wage Stagnation and Populism – A Comment on David Brooks and Noah Smith",
    "description": "David Brooks and Noah Smith defend neoliberal globalization by trying to 'splain decades of worker wage stagnation.",
    "link": "https://www.nakedcapitalism.com/2025/05/james-galbraith-wage-stagnation-and-populism-a-comment-on-david-brooks-and-noah-smith.html",
    "timestamp": "2025-05-28T09:48:19Z"
  },
  {
    "title": "Donald Trump makes chilling WW3 ultimatum as he pushes for Canada to become '51st state'",
    "description": "Donald Trump is continuing his efforts to make Canada the 51st state and he's presented a compelling offer to PM Mark Carney about the nation's protection.",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-ww3-ultimatum-golden-dome-canada-51st-state-737042-20250528",
    "timestamp": "2025-05-28T09:44:38Z"
  },
  {
    "title": "Former Russian president raises specter of World War III as rhetoric ramps up over Ukraine",
    "description": "Ex-Russian president Dmitry Medvedev raised the specter of World War III as the rhetoric between the White House and the Kremlin ramped up over the Ukraine war.",
    "link": "https://www.nbcnews.com/world/russia/russia-ukraine-war-trump-putin-medvedev-world-war-iii-ceasefire-talks-rcna209380",
    "timestamp": "2025-05-28T09:44:21Z"
  },
  {
    "title": "Trump Blocked From Shifting Student Loan Oversight From Education Department To Small Business Administration: Report",
    "description": "A federal judge temporarily blocked President Donald Trump's attempt to reassign more than $1.6 trillion in federal student debt from the Department of Education to the Small Business Administration (SBA) on Thursday.\nWhat Happened: Judge Myong J. Joun of the…",
    "link": "https://biztoc.com/x/08e6b61e9050b59e",
    "timestamp": "2025-05-28T09:43:58Z"
  },
  {
    "title": "World shares are mixed after a Japanese government bond auction falls flat",
    "description": "World shares are mixed after a closely watched auction of 40-year Japanese government bonds fell flat as worries mount over growing levels of debt",
    "link": "https://abcnews.go.com/Business/wireStory/world-shares-mixed-after-japanese-government-bond-auction-122255075",
    "timestamp": "2025-05-28T09:42:27Z"
  },
  {
    "title": "Musk 'Disappointed' in Trump Tax Bill; Nvidia Earnings On Tap",
    "description": "On today's podcast:  1) Elon Musk expressed dissatisfaction with President Donald Trump’s giant tax bill, saying it undercut his efforts to slash government spending. 2) SpaceX’s colossal Starship rocket suffered a leak, tumbled out of control in space and di…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/musk-disappointed-in-trump-tax-bill-nvidia-earnings-on-tap",
    "timestamp": "2025-05-28T09:38:50Z"
  },
  {
    "title": "Pope Leo appeals for Gaza ceasefire, laments deaths of children",
    "description": "VATICAN CITY &mdash; Pope Leo appealed on Wednesday for a ceasefire in Gaza and called on Israel and Hamas militants to \"completely respect\" international humanitarian law.",
    "link": "https://www.bangkokpost.com/world/3036606/pope-leo-appeals-for-gaza-ceasefire-laments-deaths-of-children",
    "timestamp": "2025-05-28T09:38:00Z"
  },
  {
    "title": "Todd Chrisley’s Net Worth: How Much Money He Has After Jail Time",
    "description": "Todd was sentenced to serve 12 years in prison for committing tax evasion and bank fraud in 2022. Now, it looks like he'll be released soon. So, where does that leave his net worth?",
    "link": "https://hollywoodlife.com/feature/todd-chrisley-net-worth-5420275/",
    "timestamp": "2025-05-28T09:35:30Z"
  },
  {
    "title": "Andy Mukherjee: Watch out for food and fuel volatility in India-US trade talks",
    "description": "New Delhi might resist opening up its biofuel market to US corn-ethanol imports to protect restive domestic farmers, but could consider yielding on genetically modified (GM) crops. Opening its market up to GM seeds beyond cotton would work out in India’s inte…",
    "link": "https://www.livemint.com/opinion/online-views/india-us-trade-ethanol-narendra-modi-donald-trump-tesla-apple-amazon-walmart-biofuel-gm-genetically-modified-food-import-11748404587863.html",
    "timestamp": "2025-05-28T09:30:18Z"
  },
  {
    "title": "Why the Trump Administration Is Pausing New Student Visa Interviews at Embassies Across the World",
    "description": "Embassies were directed to temporarily stop scheduling new student visa interviews while the Trump Administration considers increased vetting of applicants’ social media.",
    "link": "https://time.com/7289060/us-student-visa-interviews-paused-embassies-trump-social-media-vetting/",
    "timestamp": "2025-05-28T09:30:00Z"
  },
  {
    "title": "McCarthyism 2.0: Reflections on Testifying in the House Antisemitism Hearings",
    "description": "David Cole\n\n\n\nI soon realized that neither the law nor the facts matter to the Committee on Education’s Republican inquisitors.\r\n\n\r\n\n\nThe post McCarthyism 2.0: Reflections on Testifying in the House Antisemitism Hearings appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/mccarthyism-house-antisemitism-hearings/",
    "timestamp": "2025-05-28T09:30:00Z"
  },
  {
    "title": "Trump’s Nippon Steel Bid Support Boosts Japan’s Trade Talk Hopes",
    "description": "President Donald Trump’s pivot to champion Nippon Steel Corp.’s bid to buy US Steel Corp. raises the prospect of fresh positive momentum for Japan’s sluggish negotiations with the US over tariff relief.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-nippon-steel-bid-support-boosts-japans-trade-talk-hopes",
    "timestamp": "2025-05-28T09:26:11Z"
  },
  {
    "title": "Trump’s Nippon Steel Bid Support Boosts Japan’s Trade Talk Hopes",
    "description": "President Donald Trump’s pivot to champion Nippon Steel Corp.’s bid to buy US Steel Corp. raises the prospect of fresh positive momentum for Japan’s sluggish negotiations with the US over tariff relief.",
    "link": "https://www.livemint.com/companies/news/trumps-nippon-steel-bid-support-boosts-japan-s-trade-talk-hopes-11748424245948.html",
    "timestamp": "2025-05-28T09:24:05Z"
  },
  {
    "title": "Israel Prepares for Strikes While Trump Teases Iran Deal",
    "description": "While US President Donald Trump is eager to strike a nuclear deal with Iran, Israel's Prime Minister Benjamin Netanyahu has insisted that the only “good deal” would be one that dismantled “all of the infrastructure” of Iran’s nuclear facilities.",
    "link": "https://sputnikglobe.com/20250528/israel-prepares-for-strikes-while-trump-teases-iran-deal-1122142933.html",
    "timestamp": "2025-05-28T09:24:00Z"
  },
  {
    "title": "US-German citizen charged for allegedly trying to firebomb US embassy in Tel Aviv",
    "description": "“Join me as I burn down the embassy in Tel Aviv. Death to America, death to Americans, and f–ck the west,” read a Facebook post allegedly written by the suspect",
    "link": "https://www.jewishnews.co.uk/us-german-citizen-charged-for-allegedly-trying-to-firebomb-us-embassy-in-tel-aviv/",
    "timestamp": "2025-05-28T09:22:31Z"
  },
  {
    "title": "Ukraine launches massive drone attack on Russia",
    "description": "Ukraine launched a major drone attack on Russia overnight, hitting a key microelectronics plant and forcing multiple Moscow airports to close.",
    "link": "https://uk.news.yahoo.com/ukraine-launches-massive-drone-attack-092125560.html",
    "timestamp": "2025-05-28T09:21:25Z"
  },
  {
    "title": "Sales, China and US tariffs: challenges for new Stellantis boss",
    "description": "STELLANTIS-CEO/CHALLENGES (FACTBOX):FACTBOX-Sales, China and US tariffs: challenges for new Stellantis boss",
    "link": "https://www.livemint.com/companies/news/sales-china-and-us-tariffs-challenges-for-new-stellantis-boss-11748423458951.html",
    "timestamp": "2025-05-28T09:10:58Z"
  },
  {
    "title": "Factbox-Sales, China and US tariffs: challenges for new Stellantis boss",
    "description": "MILAN (Reuters) -Antonio Filosa was appointed chief executive of automaker Stellantis on Wednesday, following the departure of Carlos Tavares in December...",
    "link": "https://finance.yahoo.com/news/factbox-sales-china-us-tariffs-091056021.html",
    "timestamp": "2025-05-28T09:10:56Z"
  },
  {
    "title": "Israel Plans Iran Attack Even if Trump Reaches Nuclear Deal: Report",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nIsraeli Prime Minister Benjamin Netanyahu is threatening to launch a strike on Iran's nuclear sites even if the United States secures a diplomatic agreement with Tehran—escalating fears inside President Donald…",
    "link": "https://biztoc.com/x/d262e6deef5678fb",
    "timestamp": "2025-05-28T09:10:45Z"
  },
  {
    "title": "Many Ukrainians baulk at conceding land to Russia, entangling nascent peace process",
    "description": "KYIV/DNIPRO, Ukraine (Reuters) -Mariupol natives Oleksandr and Liudmyla Lytvyn fled home three years ago during Russia's 86-day siege of the port city in southern Ukraine. Now they are following peace talks between the warring countries anxiously, fearing the…",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/many-ukrainians-baulk-at-conceding-land-to-russia-entangling-nascent-peace-process",
    "timestamp": "2025-05-28T09:10:00Z"
  },
  {
    "title": "Power, patriarchy and petroleum: Why imagining a world beyond fossil fuels is so damn hard",
    "description": "The Trump administration's goal isn’t energy security or economic freedom. It’s control. Over land. Over people. Over the future.",
    "link": "https://www.nationalobserver.com/2025/05/28/opinion/power-patriarchy-petroleum-trump-world-beyond-fossil-fuels",
    "timestamp": "2025-05-28T09:09:03Z"
  },
  {
    "title": "Putin Makes Major Demand To End Ukraine War, Sources Say",
    "description": "Russia says it is currently drafting its version a memorandum that would establish the contours of a peace accord and cannot estimate how long that will take.",
    "link": "https://www.huffpost.com/entry/putin-conditions-for-ending-ukraine-war_n_6836cecbe4b06d006f7cb0e9",
    "timestamp": "2025-05-28T09:06:48Z"
  },
  {
    "title": "Israel Plans Iran Attack Even if Trump Reaches Nuclear Deal: Report",
    "description": "U.S. fears Israel will attack Iran nuclear sites without advance notice or coordination, risking ongoing diplomatic talks.",
    "link": "https://www.newsweek.com/isreal-attack-iran-us-nuclear-deal-trump-2077804",
    "timestamp": "2025-05-28T09:06:33Z"
  },
  {
    "title": "Lockheed to Boeing: How India’s Operation Sindoor may loosen the grip of US defence giants",
    "description": "India’s recent military advances and cost-effective innovations expose critical weaknesses in the US defence system. As Washington clings to outdated Cold War models and monopolistic defence contractors, it risks falling behind rivals like India and China. Ex…",
    "link": "https://economictimes.indiatimes.com/news/defence/lockheed-to-boeing-how-indias-operation-sindoor-may-loosen-the-grip-of-us-defence-giants/articleshow/121459511.cms",
    "timestamp": "2025-05-28T09:05:34Z"
  },
  {
    "title": "Zelenskyy proposes three-way meeting with Trump, Putin",
    "description": "KYIV: Ukrainian President Volodymyr Zelenskyy has called for a three-way summit with Donald Trump and Vladimir Putin as he seeks to force Moscow to halt its three-year-long invasion. Russian President Putin",
    "link": "https://www.channelnewsasia.com/world/russia-ukraine-war-zelenskyy-proposes-three-way-meeting-trump-putin-5156801",
    "timestamp": "2025-05-28T09:04:44Z"
  },
  {
    "title": "Elon Musk-Trump bromance over? Tesla CEO's first major public disagreement with President sparks buzz",
    "description": "Has Elon Musk and President Donald Trump's bromance come to end? In his first remarks which indicates disagreement with Trump, Tesla CEO said in an interview that he's “disappointed” by the cost of Donald Trump’s much-ballyhooed sweeping tax bill passed by th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-disappointed-big-beautiful-bill-trump-bromance-over-tesla-ceos-first-major-public-disagreement-with-president-sparks-buzz/articleshow/121461156.cms",
    "timestamp": "2025-05-28T09:04:31Z"
  },
  {
    "title": "Crooks use a fake antivirus site to spread Venom RAT and a mix of malware",
    "description": "Researchers found a fake Bitdefender site spreading the Venom RAT by tricking users into downloading it as antivirus software. DomainTools Intelligence (DTI) researchers warn of a malicious campaign using a fake website (“bitdefender-download[.]com”) spoofing…",
    "link": "https://securityaffairs.com/178366/malware/fake-antivirus-spreads-venom-rat.html",
    "timestamp": "2025-05-28T09:02:46Z"
  }
]