[
  {
    "title": "China is turning up pressure on Walmart. That could mean higher prices for US customers | CNN Business",
    "description": "Walmart thought it could use its immense power as America’s biggest retailer to make Chinese suppliers eat the cost of President Donald Trump’s tariffs. But Walmart got a response it’s not accustomed to hearing: No.",
    "link": "https://www.cnn.com/2025/03/24/business/walmart-china-tariffs/index.html",
    "timestamp": "2025-03-24T09:47:24Z"
  },
  {
    "title": "Rosie O’Donnell calls for Trump, Musk to be investigated over 2024 election",
    "description": "There is no evidence that Trump or Elon Musk were involved in wrogndoing during the election.",
    "link": "https://www.pennlive.com/entertainment/2025/03/rosie-odonnell-calls-for-trump-musk-to-be-investigated-over-2024-election.html",
    "timestamp": "2025-03-24T09:45:31Z"
  },
  {
    "title": "Canadian Prime Minister Calls Out Trump As Election Campaign Kicks Off",
    "description": "Mark Carney announced a snap general election will take place on April 28.",
    "link": "https://www.huffpost.com/entry/canada-snap-election-carney-criticizes-trump_n_67e126f2e4b0806f890ed4ac",
    "timestamp": "2025-03-24T09:45:30Z"
  },
  {
    "title": "Donald Trump reveals who he thinks killed JFK after releasing 80,000 declassified CIA files",
    "description": "President Donald Trump has shared his thoughts on who he thinks killed John F Kennedy after declassing 80,000 documents about the assassination.",
    "link": "https://www.ladbible.com/news/us-news/who-donald-trump-thinks-killed-jfk-declassified-files-492444-20250324",
    "timestamp": "2025-03-24T09:42:01Z"
  },
  {
    "title": "How to survive and prosper in the Trump tariff era",
    "description": "The first few months of President Donald Trump 2.0 have drawn comparisons to the deregulation era of Ronald Reagan, the industrial policy of Alexander Hamilton, the roaring ebullience of the 1920s, the fervid patriotism of the 1950s, and the harsh cultural di…",
    "link": "https://biztoc.com/x/f695e8ff0cc05e0d",
    "timestamp": "2025-03-24T09:38:42Z"
  },
  {
    "title": "Canada’s snap election is all about Trump and his ‘unjustified trade actions and his threats to our sovereignty’",
    "description": "New Canadian Prime Minister Mark Carney and his Conservative opponent said U.S. President Donald Trump must respect Canada’s sovereignty as they kicked off their election campaigns Sunday against the backdrop of a trade war and Trump's annexation threats.\nCar…",
    "link": "https://biztoc.com/x/5c9af67ee2d40509",
    "timestamp": "2025-03-24T09:38:42Z"
  },
  {
    "title": "Hopes rise for limited Trump trade war escalation",
    "description": "Global financial markets are giving a cautious welcome to reports the Trump administration is to row back on elements of its threatened trade war escalation.",
    "link": "https://news.sky.com/story/trump-trade-war-hopes-rise-for-limited-escalation-13334872",
    "timestamp": "2025-03-24T09:37:00Z"
  },
  {
    "title": "Lucas: JFK assassination still shrouded in mystery",
    "description": "We don’t know everything about the 1963 assassination of President John F. Kennedy and, despite the release of a ton of new documents, we never will.",
    "link": "https://www.bostonherald.com/2025/03/24/lucas-jfk-assassination-still-shrouded-in-mystery/",
    "timestamp": "2025-03-24T09:32:43Z"
  },
  {
    "title": "Crypto Watchlist: Key Coins And Catalysts To Watch This Week",
    "description": "As the crypto market enters the final stretch of March, several pivotal events and developments loom large. From macroeconomic indicators to significant protocol upgrades and regulatory deadlines, here are the key points to watch in the week ahead. #1 Crypto …",
    "link": "https://bitcoinist.com/crypto-watchlist-coins-catalysts-this-week/",
    "timestamp": "2025-03-24T09:30:38Z"
  },
  {
    "title": "Watch out! The US Fed seems to be driving blindfolded",
    "description": "Federal Reserve chair Jerome Powell needs to avert another ‘transitory inflation’ mishap. Do growth risks really outweigh price risks? Either way, unfortunately, by the time the Fed swings into action, it may be too late.",
    "link": "https://www.livemint.com/opinion/online-views/trump-jerome-powell-federal-reserve-bank-of-minneapolis-university-of-wisconsin-madison-david-wilcox-bloomberg-economics-11742553577267.html",
    "timestamp": "2025-03-24T09:30:19Z"
  },
  {
    "title": "Tiger Woods Confirms Vanessa Trump Suspicions with Glaring Contradiction",
    "description": "Woods posted a romantic photo with Vanessa Trump for millions to see, but had a rather curious caption included with the social media post.",
    "link": "https://www.newsweek.com/sports/golf/tiger-woods-confirms-vanessa-trump-suspicions-2049371",
    "timestamp": "2025-03-24T09:30:01Z"
  },
  {
    "title": "Brooklyn Dodger 1, Draft Dodger 0",
    "description": "Peter Dreier\n\n\n\nDonald Trump picked on the wrong athlete. Even though Jackie Robinson died in 1972, last week he bested Trump in a contest about the role of racism and the civil rights movement.\r\n\n\r\n\n\nThe post Brooklyn Dodger 1, Draft Dodger 0 appeared first …",
    "link": "https://www.thenation.com/article/culture/dodgers-robinson-trump-hegseth-dei/",
    "timestamp": "2025-03-24T09:30:00Z"
  },
  {
    "title": "Time for a Progressive Rethink",
    "description": "Jeff Faux\n\n\n\nAnger at the Democratic Party’s inept leadership and subservience to Big Money has been rising since the election. But the left also must examine our own role in enabling Trump.\r\n\n\r\n\n\nThe post Time for a Progressive Rethink appeared first on The …",
    "link": "https://www.thenation.com/article/archive/democrats-progressives-left-self-criticism/",
    "timestamp": "2025-03-24T09:30:00Z"
  },
  {
    "title": "Futures higher, Trump tariff report in focus, PMIs ahead - what's moving markets",
    "description": "Investing.com - U.S. stock futures climb on Monday, with reports suggesting that a key upcoming tariff announcement from President Donald Trump will be less ...",
    "link": "https://finance.yahoo.com/news/futures-higher-trump-tariff-report-092254494.html",
    "timestamp": "2025-03-24T09:22:54Z"
  },
  {
    "title": "Protests Break Out Across US Over Plans to Change Postal Service",
    "description": "The National Association of Letter Carriers organized rallies nationwide to protest plans to restructure or privatize the United States Postal Service.",
    "link": "https://www.newsweek.com/protests-plans-change-postal-service-2049406",
    "timestamp": "2025-03-24T09:22:53Z"
  },
  {
    "title": "Senior US trade official on crucial visit to India this week to discuss trade and tariff issues",
    "description": "Brendan Lynch, the US Assistant Trade Representative for South and Central Asia, is visiting India from March 25-29 to discuss trade and tariff issues ahead of reciprocal tariffs set to take effect on April 2. Lynch will meet with Commerce Minister Piyush Goy…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/senior-us-trade-official-on-crucial-visit-to-india-this-week/articleshow/119418377.cms",
    "timestamp": "2025-03-24T09:22:40Z"
  },
  {
    "title": "What are the issues in US talks with Ukraine and Russia?",
    "description": "U.S. and Russian officials are in talks to secure a broad ceasefire in Ukraine, focusing on a Black Sea maritime ceasefire and other key issues like ending attacks on energy infrastructure and prisoner exchanges. Discussions also cover NATO membership, post-w…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-are-the-issues-in-us-talks-with-ukraine-and-russia/articleshow/119418306.cms",
    "timestamp": "2025-03-24T09:20:47Z"
  },
  {
    "title": "Screens and adolescents: How phones broke children’s brains",
    "description": "As evidence mounts that devices are sparking a mental health crisis in young people, ‘Adolescence’ writer Jack Thorne says he thinks smartphone sales should be banned for under 16s. Helen Coffey asks whether social media and tech are really to blame – and wha…",
    "link": "https://www.the-independent.com/life-style/smartphones-children-adolescence-mental-health-social-media-b2720374.html",
    "timestamp": "2025-03-24T09:19:42Z"
  },
  {
    "title": "Tariff Pain Brings Hope of Eventual Gain for Canada’s Green Sectors",
    "description": "Supply Lines is a daily newsletter that tracks global trade.           Sign up here        .",
    "link": "https://financialpost.com/pmn/business-pmn/tariff-pain-brings-hope-of-eventual-gain-for-canadas-green-sectors",
    "timestamp": "2025-03-24T09:18:58Z"
  },
  {
    "title": "US Visit Shows Lack of Respect, Greenland Election Winner Says",
    "description": "A planned trip by US administration representatives to Greenland this week shows “a lack of respect for the Greenlandic people” given government negotiations are still ongoing, according to the territory’s election winner, Jens-Frederik Nielsen.",
    "link": "https://financialpost.com/pmn/business-pmn/us-visit-shows-lack-of-respect-greenland-election-winner-says",
    "timestamp": "2025-03-24T09:18:46Z"
  },
  {
    "title": "‘Nationalist Narratives’ Seen as Risk to Luxury Goods",
    "description": "\"The rise of nationalist narratives everywhere – including in China – is making life tougher for global brands,\" equity analysts at Bernstein warn.",
    "link": "http://wwd.com/business-news/financial/luxury-goods-outlook-q1-tariffs-1237059743/",
    "timestamp": "2025-03-24T09:18:08Z"
  },
  {
    "title": "Stock Futures Rise as Investors Bet Trump Will Scale Back Tariffs",
    "description": "Updated 35 min ago\nStock Futures Rise as Investors Bet Trump Will Scale Back Tariffs\nU.S. stocks looked set to rise again on Monday, with investors hopeful President Donald Trump’s “Liberation Day” tariffs won’t be as harsh as he’s previously signaled.\nThe Wh…",
    "link": "https://biztoc.com/x/4a46eaac53fec832",
    "timestamp": "2025-03-24T09:17:34Z"
  },
  {
    "title": "National Park Service worker fired by DOGE says he felt 'frozen' until he was finally told he'd be rehired",
    "description": "A federal worker spent weeks in limbo after being fired amid DOGE's federal worker reduction effort. He's finally been rehired.",
    "link": "https://www.businessinsider.com/doge-fired-national-park-service-employee-rehired-2025-3",
    "timestamp": "2025-03-24T09:17:01Z"
  },
  {
    "title": "Editor’s Picks: Why Putin’s promises of de-escalation are a ruse",
    "description": "A handpicked article read aloud from the latest issue of The Economist. Donald Trump is keen to broker a deal with Russia to end the war in Ukraine. In doing so he would be playing straight into Vladimir Putin’s hands.\nListen on: Apple Podcasts | Spotify\nChec…",
    "link": "https://biztoc.com/x/e78241a9ca2b3b79",
    "timestamp": "2025-03-24T09:16:44Z"
  },
  {
    "title": "Can President Sheinbaum Defeat Mexico’s Drug Cartels?",
    "description": "Unless she is willing to take on political allies who are accused of colluding with drug cartels, Sheinbaum will struggle to meaningfully improve security in Mexico.",
    "link": "https://www.forbes.com/sites/nathanielparishflannery/2025/03/24/can-president-sheinbaum-defeat-mexicos-drug-cartels/",
    "timestamp": "2025-03-24T09:15:00Z"
  },
  {
    "title": "Australia to Speed Up $1 billion in Defense Spending, Including AUKUS Submarine Base and Frigates",
    "description": "Australia will bring forward A$1 billion in defence spending in Tuesday's federal budget to boost its military capability, including guided weapons manufacture, an AUKUS submarine base and a frigate program, Defence Minister Richard Marles said on Monday.",
    "link": "https://gcaptain.com/australia-to-speed-up-1-billion-in-defense-spending-including-aukus-submarine-base-and-frigates/",
    "timestamp": "2025-03-24T09:11:38Z"
  },
  {
    "title": "Our next PM must find a way to break free from the U.S.",
    "description": "With the U.S. no longer a reliable trading partner, Canada may be awakening to its foreign policy dilemma – and a new way of doing business",
    "link": "https://www.nationalobserver.com/2025/03/24/opinion/prime-minister-trade-foreign-policy-us",
    "timestamp": "2025-03-24T09:09:07Z"
  },
  {
    "title": "Trump can’t really stop Biden’s climate legacy",
    "description": "Environmental lawyer Michael Gerrard explains Trump’s pro-pollution crusade—and its limits.",
    "link": "https://www.nationalobserver.com/2025/03/24/news/trump-cant-really-stop-bidens-climate-legacy",
    "timestamp": "2025-03-24T09:09:06Z"
  },
  {
    "title": "Asian markets fluctuate before US tariff announcement",
    "description": "Asian markets were mixed on Monday as the White House prepared to impose tariffs on key trading partners next week. Many feared this would be a painful blow to the global economy. A report saying US President Donald Trump was considering a more targeted appro…",
    "link": "https://punchng.com/asian-markets-fluctuate-before-us-tariff-announcement/",
    "timestamp": "2025-03-24T09:08:00Z"
  },
  {
    "title": "Iranian Oil Tankers Using Forged Iraqi Documents, Iraqi Oil Minister Says",
    "description": "Iraq's oil minister Hayan Abdel-Ghani has said Iranian oil tankers seized by U.S. forces in the Gulf were using forged Iraqi documents.",
    "link": "https://gcaptain.com/iranian-oil-tankers-using-forged-iraqi-documents-iraqi-oil-minister-says/",
    "timestamp": "2025-03-24T09:07:10Z"
  },
  {
    "title": "TRUMP Memecoin Pumps After U.S. President Calls It The ‘Greatest Of Them All’",
    "description": "The rare direct reference to the meme coin by the sitting President sent the token’s price soaring upward before quickly retreating.",
    "link": "https://zycrypto.com/trump-memecoin-pumps-after-u-s-president-calls-it-the-greatest-of-them-all/",
    "timestamp": "2025-03-24T09:05:17Z"
  },
  {
    "title": "Russian official arrested for leaking to Kiev – FSB",
    "description": "Russia’s Federal Security Service has reported the arrest of an official who is accused of leaking classified information to Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614686-fsb-ukrainian-informant-arrested/",
    "timestamp": "2025-03-24T09:04:38Z"
  },
  {
    "title": "FBI issues alert after ‘arson, gunfire, and vandalism’ target Tesla dealerships, owners",
    "description": "Federal law enforcement has issued a warning to the public following a string of incidents involving Tesla brand cars and dealerships.",
    "link": "https://www.bostonherald.com/2025/03/24/fbi-issues-alert-after-arson-gunfire-and-vandalism-target-tesla-dealerships-owners/",
    "timestamp": "2025-03-24T09:03:31Z"
  },
  {
    "title": "US retailers haggle with suppliers after Trump tariffs",
    "description": "U.S. retailers Walmart and Target are bickering behind the scenes with their suppliers over proposed price hikes on everything from cake pans, tote bags and ...",
    "link": "https://finance.yahoo.com/news/us-retailers-haggle-suppliers-trump-090313227.html",
    "timestamp": "2025-03-24T09:03:13Z"
  },
  {
    "title": "Would You Buy a Fighter Jet From Donald Trump?",
    "description": "The Lockheed Martin F-35 is the most popular fighter jet the United States produces. Under Donald Trump, U.S. allies are having buyer’s remorse.",
    "link": "http://nymag.com/intelligencer/article/trump-f-35-fighter-jet-allies.html",
    "timestamp": "2025-03-24T09:00:43Z"
  },
  {
    "title": "Media, Dems celebrate Tesla woes as anger over Elon Musk's role in Trump admin continues",
    "description": "Elon Musk continues to face attacks from the left over his role in Trump administration, with Democrats and liberal pundits targeting his companies.",
    "link": "https://www.foxnews.com/media/media-dems-celebrate-tesla-stocks-woes-anger-over-elon-musks-role-trump-admin-continues",
    "timestamp": "2025-03-24T09:00:31Z"
  },
  {
    "title": "Words Matter: The Dangerous Impact of Restricted Words on Women’s Health Research",
    "description": "In 1967, two women illegally ran the Boston Marathon. At the time, women were barred from participating in marathons. In fact, it wasn’t until 1960 that women were even allowed to compete in the Olympic 800m (½-mile) event—from which women had been banned sin…",
    "link": "https://fitbottomedgirls.com/2025/03/restricted-words-womens-health-research/",
    "timestamp": "2025-03-24T09:00:22Z"
  },
  {
    "title": "From Feeding the Kids to Fleecing the Government: Inside the Country's Largest COVID Fraud",
    "description": "What happens when you cross a Third-World tribal culture with an urban Democratic establishment? You can probably guess the outcome, but in Minnesota we don’t have to guess. We have seen it on display in the sprawling Feeding Our Future case that represents t…",
    "link": "https://freebeacon.com/democrats/from-feeding-the-kids-to-fleecing-the-government-inside-the-countrys-largest-covid-fraud/",
    "timestamp": "2025-03-24T09:00:15Z"
  },
  {
    "title": "SEN SHELDON WHITEHOUSE: The EPA's environmental regulation rollback puts Americans last",
    "description": "President Donald Trump's Environmental Protection Agency is rolling back regulations that helped protect Americans.",
    "link": "https://www.foxnews.com/opinion/sen-sheldon-whitehouse-epas-environmental-regulation-rollback-puts-americans-last",
    "timestamp": "2025-03-24T09:00:07Z"
  },
  {
    "title": "Lower gas prices aren’t luck. Trump’s energy policies are fueling American independence",
    "description": "Biden canceled the XL pipeline in his war against the energy industry. That was part of an environmental agenda Americans paid for at the pump. Trump brought gas prices back down.",
    "link": "https://www.foxnews.com/opinion/lower-gas-prices-arent-luck-trumps-energy-policies-fueling-american-independence",
    "timestamp": "2025-03-24T09:00:07Z"
  },
  {
    "title": "Polls suggest NDP faces potential annihilation in Manitoba as federal election kicks off",
    "description": "With the federal election underway, polls suggest the NDP could be wiped off Manitoba's electoral map, while the Liberals would likely hold existing Winnipeg seats and the Conservatives would face no rural challenges.",
    "link": "https://www.cbc.ca/news/canada/manitoba/polling-election-winnipeg-manitoba-2025-1.7490592",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "Four hurdles facing Republicans as they shift focus to a bill to pass Trump's agenda",
    "description": "Medicaid cuts, a potential $4.6 trillion asterisk, a House-Senate divide, and a major debt ceiling question loom over Speaker Johnson's push to pass the massive bill by Easter.",
    "link": "https://www.nbcnews.com/politics/congress/four-hurdles-republicans-shift-focus-bill-pass-trump-agenda-rcna197047",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "Weekly Climate and Energy News Roundup #636",
    "description": "“We absolutely must leave room for doubt or there is no progress and no learning ... People search for certainty. But there is no certainty.” – Richard Feynman, \"What is and What Should be the Role of Scientific Culture in Modern Society\" – lecture given at t…",
    "link": "https://wattsupwiththat.com/2025/03/24/weekly-climate-and-energy-news-roundup-63g/",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "The 5 best places in America to buy a house right now",
    "description": "Buying a home is often the culmination of years of hard work and sacrifice. For many Americans, home ownership can provide long-term stability – but a shifting economy means that would-be homeowners have new obstacles to navigate.Read more...",
    "link": "https://qz.com/best-place-buy-house-us-2025-1851771672",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "'Twain hated bullies.' Conan O'Brien receives Mark Twain Prize at the Kennedy Center.",
    "description": "Comedian Conan O'Brien received the Mark Twain Prize at the Kennedy Center on Sunday night, which David Letterman called \"the most entertaining gathering of the resistance ever.\"",
    "link": "https://www.npr.org/2025/03/24/nx-s1-5336358/conan-obrien-mark-twain-prize-kennedy-center",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "Trump’s Most Dangerous Enabler Is Not Who You Think It Is",
    "description": "Who is President Donald Trump’s most dangerous enabler? As his second term got underway, it initially appeared that this coveted title might fall to FBI director Kash Patel, who’d vowed to investigate Trump’s enemies. Or maybe it would be Attorney General Pam…",
    "link": "https://newrepublic.com/article/193064/trump-dangerous-enabler-marco-rubio",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "We Need to Reengage My Generation In Art Appreciation",
    "description": "Allegra Devine Lief\n\n\n\nArt History, once a staple in every college humanities curriculum, is now seen as elitist and futile. With Donald Trump back in the White House, the arts are more at risk than ever.\r\n\n\r\n\n\nThe post We Need to Reengage My Generation In Ar…",
    "link": "https://www.thenation.com/?post_type=article&p=547272",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "Reading “King Lear” at Columbia in the Wake of Mahmoud Khalil’s Kidnapping",
    "description": "Joseph A. Howley\n\n\n\nTrump’s war on my colleagues and students helped me understand the play’s political caution, which is not just about bad actors but those who fail to stop them.\r\n\n\r\n\n\nThe post Reading “King Lear” at Columbia in the Wake of Mahmoud Khalil’s…",
    "link": "https://www.thenation.com/?post_type=article&p=547696",
    "timestamp": "2025-03-24T09:00:00Z"
  },
  {
    "title": "‘Historical loss’: Alleged gang leader evades US justice with deportation to El Salvador | CNN Politics",
    "description": "As part of the deportation flights of alleged terrorists at the center of a legal and political storm, the US quietly dropped charges against a key alleged MS-13 leader and returned him to the pro-Trump leader of El Salvador.",
    "link": "https://www.cnn.com/2025/03/24/politics/ms-13-leader-deported-el-salvador-boasberg-order/index.html",
    "timestamp": "2025-03-24T08:59:03Z"
  },
  {
    "title": "US and Philippines launch joint army drills with 5,000 soldiers",
    "description": "MANILA: Soldiers from the Philippine and the US armies began three weeks of joint military exercises on Monday (Mar 24), with drills focused on territorial defence and commanding large-scale deployments of forces, the Philippine Army said. Around 5,000 soldie…",
    "link": "https://www.channelnewsasia.com/asia/us-phillipines-launch-joint-army-drills-5000-soldiers-5020251",
    "timestamp": "2025-03-24T08:57:33Z"
  },
  {
    "title": "Donald Trump Jokes About March Madness Bracket Strategy — And It’s Not Exactly Honest",
    "description": "The president's tactic falls short of fair play.",
    "link": "https://www.huffpost.com/entry/donald-trump-march-madness_n_67e11345e4b0866f0f088e07",
    "timestamp": "2025-03-24T08:56:21Z"
  },
  {
    "title": "Greenland PM Mute Egede denounces US 'foreign interference' ahead of visit",
    "description": "Greenland's Prime Minister Mute Egede accused the U.S. of political interference after an American delegation visited the Arctic island, once coveted by former President Donald Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/greenland-pm-mute-egede-denounces-us-foreign-interference-ahead-of-visit/articleshow/119417237.cms",
    "timestamp": "2025-03-24T08:54:19Z"
  },
  {
    "title": "Trump Throws A Fit At 'Failed' George Clooney In Bonkers New Sunday Night Rant",
    "description": "The president didn't seem to like what was on TV on Sunday night.",
    "link": "https://www.huffpost.com/entry/donald-trump-george-clooney-60-minutes_n_67e102bae4b0866f0f087f20",
    "timestamp": "2025-03-24T08:51:16Z"
  },
  {
    "title": "US planning to exclude sector-specific tariffs on April 2, Bloomberg News, WSJ report",
    "description": "(Reuters) - U.S. President Donald Trump's administration is likely to exclude a set of sector-specific tariffs while applying reciprocal levies on April 2, Bloomberg News and the Wall Street Journal reported, citing officials. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/24/us-planning-to-exclude-sector-specific-tariffs-on-april-2-bloomberg-news-wsj-report",
    "timestamp": "2025-03-24T08:51:00Z"
  },
  {
    "title": "US Threatens 'All Options on the Table' for Iran",
    "description": "Special Envoy Steve Witkoff wants diplomacy with Iran but National Security Adviser Mike Waltz doesn't rule out military action.",
    "link": "https://www.newsweek.com/trump-witkoff-iran-nuclear-waltz-2049388",
    "timestamp": "2025-03-24T08:50:20Z"
  },
  {
    "title": "US and Philippines launch joint army drills with 5,000 soldiers",
    "description": "<p>MANILA - Soldiers from the Philippine and the US armies began three weeks of joint military exercises on Monday, with drills focused on territorial defence and commanding large-scale deployments of forces, the Philippine Army said.</p>",
    "link": "https://www.bangkokpost.com/world/2986406/us-and-philippines-launch-joint-army-drills-with-5-000-soldiers",
    "timestamp": "2025-03-24T08:47:00Z"
  },
  {
    "title": "Power companies would rather not clean their toxic messes. Trump’s EPA is granting their wish.",
    "description": "Advocates fear the agency will “justify avoiding any enforcement whatsoever” of millions of tons of coal ash nationwide.",
    "link": "http://grist.org/health/coal-ash-epa-lee-zeldin-trump/",
    "timestamp": "2025-03-24T08:45:00Z"
  },
  {
    "title": "China just told execs from Apple, Citadel, and Qualcomm that Beijing is still down to do business even with 'unexpected shocks' to trade",
    "description": "China's Premier Li Qiang said with rising \"instability and uncertainty,\" it was important for countries to open their markets more.",
    "link": "https://www.businessinsider.com/china-apple-citadel-qualcomm-beijing-do-business-with-unexpected-shocks-2025-3",
    "timestamp": "2025-03-24T08:41:45Z"
  },
  {
    "title": "Greenland leaders criticise US delegation trip as Trump talks of takeover",
    "description": "Greenlandic leaders criticised an upcoming trip by a high-profile American delegation to the semi-autonomous Danish territory that President Donald Trump has suggested the U.S. should annex.",
    "link": "https://www.independent.ie/world-news/north-america/greenland-leaders-criticise-us-delegation-trip-as-trump-talks-of-takeover/a1494239593.html",
    "timestamp": "2025-03-24T08:41:03Z"
  },
  {
    "title": "Trump demands removal of his portrait in Colorado's state capitol",
    "description": "Trump took to Truth Social to call for the removal of his 'purposefully distorted' portrait.",
    "link": "https://www.abc.net.au/news/2025-03-24/trump-demands-removal-of-portrait-in-colorado-state-capitol/105090216",
    "timestamp": "2025-03-24T08:35:57Z"
  },
  {
    "title": "Greenland PM denounces ‘aggressive pressure’ by US",
    "description": "A planned cultural trip to Greenland by US officials is viewed as “aggressive pressure,” the Danish island’s prime minister has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614685-greenland-visit-second-lady/",
    "timestamp": "2025-03-24T08:32:06Z"
  },
  {
    "title": "The manager of a $41 billion BlackRock bond fund yielding 6.4% shares where investors can get max returns for the least risk",
    "description": "With stocks down to start 2025, the strong returns you can find in the fixed-income market may look attractive right about now.",
    "link": "https://www.businessinsider.com/bond-market-trade-offers-max-returns-for-least-risk-blackrock-2025-3",
    "timestamp": "2025-03-24T08:30:01Z"
  },
  {
    "title": "N.L. Tesla owners say their choice of car doesn't reflect their politics",
    "description": "A St. John’s Tesla owner says she feels caught up in the backlash against the Elon Musk-owned vehicle manufacturer — even though her choice of car doesn’t reflect her politics.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/nl-tesla-owners-1.7490225",
    "timestamp": "2025-03-24T08:30:00Z"
  },
  {
    "title": "US planning to exclude sector-specific tariffs on April 2: Reports",
    "description": "U.S. President Trump's administration is set to exclude sector-specific tariffs on auto, semiconductors, and pharmaceuticals, initially planned for April 2, after a delay pushed by automakers. While sector-specific tariffs will be excluded, reciprocal tariff …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-planning-to-exclude-sector-specific-tariffs-on-april-2-reports/articleshow/119416219.cms",
    "timestamp": "2025-03-24T08:28:35Z"
  },
  {
    "title": "Japan's Nikkei dips as looming US tariff deadline spurs caution",
    "description": "Japan's Nikkei share average declined for a third straight session on Monday as uncertainty ahead of a looming deadline for implementing additional U.S. tariffs sapped investor appetite for riskier assets.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-dips-as-looming-us-tariff-deadline-spurs-caution/articleshow/119415752.cms",
    "timestamp": "2025-03-24T08:17:05Z"
  },
  {
    "title": "All eyes are on Egypt for Gaza relocation plans",
    "description": "Egypt is one place where Gazans can move on land. Not only is there a border between Egypt and Gaza, but Egypt controlled Gaza from 1948 to 1967 and thus has a historic role in Gaza.",
    "link": "https://www.jpost.com/middle-east/article-847349",
    "timestamp": "2025-03-24T08:16:36Z"
  },
  {
    "title": "Selected Articles: Iran in the Crosshairs. Mike Whitney",
    "description": "Iran in the Crosshairs. Mike Whitney\nBy Mike Whitney, March 23, 2025\nTrump’s push for a ceasefire in Ukraine has less to do with Ukraine than it does with Israel. In other words, Trump’s hasty negotiations with Putin are …\nThe post Selected Articles: Iran in …",
    "link": "https://www.globalresearch.ca/selected-articles-iran-crosshairs-mike-whitney/5882625",
    "timestamp": "2025-03-24T08:16:25Z"
  },
  {
    "title": "Ukraine updates: Russia and US discuss ceasefire",
    "description": "Talks are taking place in Saudi Arabia aimed at pausing the fighting in Ukraine, with Russia's team set to speak to US representatives. Ukraine's president has accused Moscow of prolonging the war. Representatives from Moscow and Washington are meeting in the…",
    "link": "https://www.dw.com/en/ukraine-updates-russia-and-us-discuss-ceasefire/live-72014901",
    "timestamp": "2025-03-24T08:16:00Z"
  },
  {
    "title": "FBI warns of malicious free online document converters spreading malware",
    "description": "The FBI warns of a significant increase in scams involving free online document converters to infect users with malware. The FBI warns that threat actors use malicious online document converters to steal users’ sensitive information and infect their systems w…",
    "link": "https://securityaffairs.com/175764/cyber-crime/malicious-free-online-document-converters.html",
    "timestamp": "2025-03-24T08:14:48Z"
  },
  {
    "title": "$5 billion in a day? Trump’s ‘Gold Card’ sells 1,000 units in 24 hours, claims aide Lutnick",
    "description": "The Gold Card, designed to replace the existing EB-5 investor visa, eliminates the job creation requirement and offers a fast-track residency process",
    "link": "https://www.businesstoday.in/latest/world/story/5-billion-in-a-day-trumps-gold-card-sells-1000-units-in-24-hours-claims-aide-lutnick-469105-2025-03-24",
    "timestamp": "2025-03-24T08:14:16Z"
  },
  {
    "title": "2 top stock recommendations from Aditya Arora",
    "description": "​Currently, Bank Nifty is trading at 51,600. In some time, we could see Nifty reaching levels of 54,000 in about one month, so we maintain positive bias with stop loss of 49,000.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/2-top-stock-recommendations-from-aditya-arora/articleshow/119415369.cms",
    "timestamp": "2025-03-24T08:11:24Z"
  },
  {
    "title": "Musk, Bezos, and Zuck are going full alpha male. America's girlbosses are fed up",
    "description": "Can you smell the testosterone? Suddenly, America's top CEOs seem to be taking their cues from Logan Roy, Rambo, and, most conspicuously, Donald Trump.\nJiujitsu-fighting, MAGA-fied Mark Zuckerberg went on Joe Rogan's podcast to bemoan corporate culture for be…",
    "link": "https://biztoc.com/x/a239117d99549a90",
    "timestamp": "2025-03-24T08:09:56Z"
  },
  {
    "title": "Stock Market Today: Dow, S&P 500, Nasdaq Set to Open Up; Trump Tariff Hope; Nvidia, Tesla, FedEx, Micron, More Movers",
    "description": "LIVE UPDATES\nDow Set to Open Up Amid Hope for Trump Tariffs\nS&P 500 and Nasdaq 100 futures are also rising in premarket trading\nLast Updated:\nMarch 24, 2025 at 4:08 AM EDT\nKey Events\nPinned Post\nU.S. stocks looked set to rise again on Monday, with investors h…",
    "link": "https://biztoc.com/x/c4d340eda8514476",
    "timestamp": "2025-03-24T08:09:54Z"
  },
  {
    "title": "Stock Futures Rise as Investors Bet Trump Will Scale Back Tariffs",
    "description": "18 min ago\nStock Futures Rise as Investors Bet Trump Will Scale Back Tariffs\nU.S. stocks looked set to rise again on Monday, with investors hopeful President Donald Trump’s “Liberation Day” tariffs won’t be as harsh as he’s previously signaled.\nThe White Hous…",
    "link": "https://biztoc.com/x/3dbcc0e9577632e6",
    "timestamp": "2025-03-24T08:09:37Z"
  },
  {
    "title": "Statue Of Trump Pal Wayne Gretzky Hit By Dirty, Stinky Protest",
    "description": "Critics make a foul-smelling statement on the sculpture outside Rogers Place, the home of the Edmonton Oilers.",
    "link": "https://www.huffpost.com/entry/wayne-gretzky-statue-trump-ties_n_67e106b0e4b0806f890ebd6a",
    "timestamp": "2025-03-24T08:05:30Z"
  },
  {
    "title": "Putin wants US ‘recognition’ of Russian gains in Ukraine: Historian",
    "description": "Russian-British historian Sergey Radchenko talks to Al Jazeera about Moscow's desire for status on the world stage.",
    "link": "https://www.aljazeera.com/news/2025/3/24/putin-wants-us-recognition-of-russian-gains-in-ukraine-as-legitimate",
    "timestamp": "2025-03-24T08:05:26Z"
  },
  {
    "title": "Musk, Bezos, and Zuck are going full alpha male. America's girlbosses are fed up.",
    "description": "As alpha male energy takes over the workplace, women are leaning out.",
    "link": "https://www.businessinsider.com/america-girl-boss-women-musk-zuckerberg-dimon-alpha-male-backlash-2025-3",
    "timestamp": "2025-03-24T08:03:01Z"
  },
  {
    "title": "National defence is often an afterthought in Canadian elections. Not this time",
    "description": "Issues of sovereignty, national security and defence — often footnotes, or even ignored outright in federal election campaigns — are likely to dominate the political landscape over the next five weeks as Canadians march toward the April 28 vote.",
    "link": "https://www.cbc.ca/news/politics/national-defence-canada-election-1.7490509",
    "timestamp": "2025-03-24T08:01:00Z"
  },
  {
    "title": "‘Quiet Panic’ as National Rental Assistance Program Set to Run Out of Cash",
    "description": "More \"unsolvable\" homelessness: A COVID-era emergency housing voucher is running out of cash — and there's no plan to save it.",
    "link": "https://www.nakedcapitalism.com/2025/03/quiet-panic-as-national-rental-assistance-program-set-to-run-out-of-cash.html",
    "timestamp": "2025-03-24T08:00:40Z"
  },
  {
    "title": "Ukraine peace talks between US and Russia have started. What’s happening today?",
    "description": "Saudi Arabia meeting follows US-Ukraine talks on Sunday, with the US reportedly seeking a broad ceasefire by April 20th",
    "link": "https://www.irishtimes.com/world/europe/2025/03/24/russia-ukraine-war-peace-talks-latest-news/",
    "timestamp": "2025-03-24T07:58:03Z"
  },
  {
    "title": "US and Russia begin talks in Riyadh on possible ceasefire in three-year Ukraine war",
    "description": "The meetings begin after US officials held talks with a team from Kyiv yesterday.",
    "link": "https://www.thejournal.ie/saudi-us-russia-talks-6657479-Mar2025/",
    "timestamp": "2025-03-24T07:52:44Z"
  },
  {
    "title": "Russia and US Teams Meet After Ukraine Holds ‘Productive’ Talks",
    "description": "US and Russian officials were meeting in Saudi Arabia a day after American and Ukrainian teams held talks, as President Donald Trump pushes for progress in achieving a ceasefire in the war.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-and-us-teams-meet-after-ukraine-holds-productive-talks",
    "timestamp": "2025-03-24T07:52:22Z"
  },
  {
    "title": "Tiger Woods confirms relationship with Vanessa Trump on social media",
    "description": "The 15-time major golf winner announced on his X account that he was dating Donald Trump’s former daughter-in-law.",
    "link": "https://www.aljazeera.com/sports/2025/3/24/tiger-woods-confirms-relationship-with-vanessa-trump-on-social-media",
    "timestamp": "2025-03-24T07:52:20Z"
  },
  {
    "title": "US-Russia talks to resume in Saudi Arabia as Zelenskyy calls for pressure on Putin",
    "description": "American and Russian negotiators are set to meet again in Saudi Arabia on Monday as the White House continues its push for a ceasefire and eventual peace deal in Ukraine.",
    "link": "https://abcnews.go.com/International/us-russia-talks-resume-saudi-arabia-zelenskyy-calls/story?id=120087635",
    "timestamp": "2025-03-24T07:51:16Z"
  },
  {
    "title": "What to Know About Russia-US Talks on Ukraine Settlement in Saudi Arabia",
    "description": "The talks at the Ritz-Carlton Hotel in the Saudi capital follow a phone conversation between Russian President Vladimir Putin and his US counterpart Donald Trump on March 18.",
    "link": "https://sputnikglobe.com/20250324/what-to-know-about-russia-us-talks-on-ukraine-settlement-in-saudi-arabia---1121677509.html",
    "timestamp": "2025-03-24T07:50:01Z"
  },
  {
    "title": "Iran's Khamenei says US threats 'will get them nowhere'",
    "description": "Tehran (AFP) Mar 21, 2025\n\n\n Iran's supreme leader said on Friday that US threats against his country \"will get them nowhere\", after President Donald Trump warned of possible military action against the Islamic republic. \n\n\"The Americans should know threats w…",
    "link": "https://www.spacewar.com/reports/Irans_Khamenei_says_US_threats_will_get_them_nowhere_999.html",
    "timestamp": "2025-03-24T07:48:43Z"
  },
  {
    "title": "France's Dassault says upping Rafale warplane output",
    "description": "Paris (AFP) Mar 23, 2025\n\n\n France's Dassault Aviation is looking to ramp up production of its Rafale combat planes, its CEO said on Sunday, after President Emmanuel Macron said the country would increase orders. \n\nEuropean countries including France have bee…",
    "link": "https://www.spacedaily.com/reports/Frances_Dassault_says_upping_Rafale_warplane_output_999.html",
    "timestamp": "2025-03-24T07:48:43Z"
  },
  {
    "title": "Germany says it's committed to order of US F-35 fighter jets",
    "description": "Berlin (AFP) Mar 21, 2025\n\n\n Germany said on Friday it was committed to buying F-35 fighter jets despite reports that it was reconsidering due to worries about an over-reliance on American defence supplies. \n\nCountries across Europe have been alarmed by US Pr…",
    "link": "https://www.spacedaily.com/reports/Germany_says_its_committed_to_order_of_US_F-35_fighter_jets_999.html",
    "timestamp": "2025-03-24T07:48:43Z"
  },
  {
    "title": "Pentagon may use polygraph tests to investigate leaks involving national security",
    "description": "Washington DC (UPI) Mar 22, 2025 \n\n\n The Pentagon is investigating leaks of national security information, including using polygraph tests, one day after media reports about an upcoming briefing with White House senior adviser Elon Musk. \n Joe Kasper, the Def…",
    "link": "https://www.spacewar.com/reports/Pentagon_may_use_polygraph_tests_to_investigate_leaks_involving_national_security_999.html",
    "timestamp": "2025-03-24T07:48:43Z"
  },
  {
    "title": "ReArm Europe? EU re-thinks name after objections; Germany approves 3 bn euros in new Ukraine military aid",
    "description": "Brussels, Belgium (AFP) Mar 21, 2025\n\n The EU may be scrambling to boost its defences in the face of Russia and unpredictable US President Donald Trump - but low-spending Spain and Italy insist Brussels avoids saying \"rearm\". \n\nEarlier this month European Com…",
    "link": "https://www.spacewar.com/reports/ReArm_Europe_EU_re-thinks_name_after_objections_999.html",
    "timestamp": "2025-03-24T07:48:43Z"
  },
  {
    "title": "Trump admits Musk 'susceptible' on China",
    "description": "Washington (AFP) Mar 21, 2025\n\n\n President Donald Trump said Friday that Elon Musk should not be allowed to see top secret US plans for any war with China, in a rare admission that his billionaire ally's business links raised potential conflicts of interest. …",
    "link": "https://www.spacedaily.com/reports/Trump_admits_Musk_susceptible_on_China_999.html",
    "timestamp": "2025-03-24T07:48:43Z"
  },
  {
    "title": "Iran unveils missile systems on strategic Gulf islands",
    "description": "Tehran (AFP) Mar 22, 2025\n\n\n Iran's Revolutionary Guards have unveiled new missile systems on three strategic islands in the Gulf, saying they can target nearby \"enemy bases, vessels, and assets\", state media reported Saturday. \n\nThe weapons were deployed on …",
    "link": "https://www.spacewar.com/reports/Iran_unveils_missile_systems_on_strategic_Gulf_islands_999.html",
    "timestamp": "2025-03-24T07:48:43Z"
  }
]