[
  {
    "title": "PGA Tour to hire NFL executive Brian Rolapp as CEO of business enterprise, AP source says",
    "description": "The PGA Tour is hiring longtime NFL executive Brian Rolapp as the first CEO of its new commercial division, created two years ago when tour reached a tentative agreement with the Saudi backers of LIV Golf, The Associated Press confirmed Thursday. Jay Monahan,…",
    "link": "https://sports.yahoo.com/article/pga-tour-hire-nfl-executive-225742554.html",
    "timestamp": "2025-06-12T22:57:42Z"
  },
  {
    "title": "Amid L.A. Protests, Trump Mobilizes Troops And Rolls Back The 2035 Gasoline Car Ban",
    "description": "Newsom sues federal government, contending that the move unlawfully revokes a nearly fifty-year legacy of California's authority under the Clean Air Act to set stricter emissions standards.",
    "link": "https://www.ibtimes.com/amid-l-protests-trump-mobilizes-troops-rolls-back-2035-gasoline-car-ban-3775482",
    "timestamp": "2025-06-12T22:57:12Z"
  },
  {
    "title": "Fran Drescher’s tax talks with President Trump not sitting well with indie producer",
    "description": "The indie film community claim Drescher and SAG-AFTRA have not consulted them on talks with the pres.",
    "link": "https://pagesix.com/2025/06/12/entertainment/indie-film-producer-against-fran-dreschers-trump-talks/",
    "timestamp": "2025-06-12T22:56:53Z"
  },
  {
    "title": "Trump Calls Fed Chair Powell A ‘Numbskull’ In Latest Attack Over Interest Rate Cuts",
    "description": "Topline\nPresident Donald Trump name called Federal Reserve Chairman Jerome Powell for declining to lower interest rates, as Trump has continuously demanded, in the latest White House criticism of the historically operationally independent central bank and its…",
    "link": "https://biztoc.com/x/27a47f5256812ba1",
    "timestamp": "2025-06-12T22:55:56Z"
  },
  {
    "title": "Declassified CIA Files Reveal RFK Sr, Was a 'Voluntary Informant'",
    "description": "Newly-declassified files revealed that Robert F. Kennedy Sr. served as a \"voluntary informant\" to the Central Intelligence Agency (CIA) before his 1968 assassination.\nThe post Declassified CIA Files Reveal RFK Sr, Was a ‘Voluntary Informant’ appeared first on…",
    "link": "https://www.breitbart.com/law-and-order/2025/06/12/declassified-cia-files-reveal-rfk-sr-was-a-voluntary-informant/",
    "timestamp": "2025-06-12T22:55:35Z"
  },
  {
    "title": "US Army’s image of power and flag-waving rings false to gen Z weary of gun violence — and long-term recruitment numbers show it",
    "description": "The US military has consistently missed its recruitment goals, with millennials and gen Z turning away from active service due to their experiences with everyday gun violence.\nThe post US Army’s image of power and flag-waving rings false to gen Z weary of gun…",
    "link": "http://www.crikey.com.au/2025/06/13/us-army-recruitment-gun-violence-gen-z/",
    "timestamp": "2025-06-12T22:51:27Z"
  },
  {
    "title": "Gavin Newsom Brutally Mocks Trump’s ‘This Is Not Good’ Understatement",
    "description": "After the president admitted his current immigration policy is hurting American businesses, the California governor had a fiery response.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-taunts-trump-immigration_n_684b3534e4b07750fb81b5b5",
    "timestamp": "2025-06-12T22:50:51Z"
  },
  {
    "title": "Arnold Schwarzenegger Condemns Media Depicting LA As “Warzone” Amid ICE Protests: “Isn’t Really The Case”",
    "description": "With protests in resistance to ICE raids pop up around Los Angeles, Arnold Schwarzenegger is pushing back against media disinformation. The former governor of California recently commented on the ongoing demonstrations and media rhetoric that “the whole of Lo…",
    "link": "http://deadline.com/2025/06/arnold-schwarzenegger-media-la-war-zone-ice-protests-1236432510/",
    "timestamp": "2025-06-12T22:50:34Z"
  },
  {
    "title": "Judge Slams Trump Admin in California National Guard Case (Jacob Knutson/Democracy Docket)",
    "description": "Jacob Knutson / Democracy Docket:\nJudge Slams Trump Admin in California National Guard Case  —  A federal judge in a hearing Thursday appeared deeply skeptical of the Department of Justice's (DOJ) legal defense of President Donald Trump federalizing the Calif…",
    "link": "https://www.memeorandum.com/250612/p128",
    "timestamp": "2025-06-12T22:50:01Z"
  },
  {
    "title": "Americans split on Trump's use of military in immigration protests, Reuters/Ipsos poll finds",
    "description": "WASHINGTON (Reuters) -Americans are divided over President Donald Trump's decision to activate the military to respond to protests against his crackdown on migrants, with about half supportive of the move, according to a Reuters/Ipsos poll that closed on Thur…",
    "link": "https://www.thestar.com.my/news/world/2025/06/13/americans-split-on-trump039s-use-of-military-in-immigration-protests-reutersipsos-poll-finds",
    "timestamp": "2025-06-12T22:49:00Z"
  },
  {
    "title": "Donald Trump’s Dictator Cosplay",
    "description": "Susan B. Glasser on President Donald Trump’s upcoming military parade, in Washington, D.C., and his armed crackdown in Los Angeles against protests over immigration raids.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/donald-trumps-dictator-cosplay",
    "timestamp": "2025-06-12T22:48:52Z"
  },
  {
    "title": "RH Continues to Mitigate Tariff Pressure; Says Revenues Will Take Short-term Hit in Q2",
    "description": "In the company's first-quarter earnings report, RH CEO Gary Friedman said the company is sticking with its full-year guidance, expressing enthusiasm over upcoming Paris Gallery opening in September.",
    "link": "http://wwd.com/home-design/furniture/rh-tariff-impact-global-expansion-economic-growth-q1-2025-1237915781/",
    "timestamp": "2025-06-12T22:48:42Z"
  },
  {
    "title": "Trump Family Undertakes New Cryptocurrency Projects",
    "description": "In the early months of his second term, President Donald Trump and his family embarked on several cryptocurrency projects, including a decentralized finance company and an exclusive dinner for investors in an official Trump memecoin. Since then, the Trump fam…",
    "link": "https://biztoc.com/x/f79b68758ba7cbb4",
    "timestamp": "2025-06-12T22:44:39Z"
  },
  {
    "title": "Trump thanked California National Guard before it arrived in L.A.",
    "description": "At 2 a.m. Sunday, U.S. President Donald Trump posted to social media congratulating the work of California's National Guard in response to immigration raid protests in Los Angeles. In fact, the guards only arrived in the city later that morning, according to …",
    "link": "https://www.cbc.ca/news/world/trump-national-guard-truth-social-1.7559743",
    "timestamp": "2025-06-12T22:41:18Z"
  },
  {
    "title": "Trump Says Iran Must 'Give Up Things They Don't Want To Give Up' To Reach a Nuclear Deal—Then Says He's 'Fairly Close to an Agreement'",
    "description": "President Donald Trump told reporters that Iran must offer more concessions than it appears willing to make to reach a nuclear deal, then said the two sides are close to an agreement. He also said an Israeli strike on the Islamic Republic’s nuclear facilities…",
    "link": "https://freebeacon.com/israel/trump-says-iran-must-give-up-things-they-dont-want-to-give-up-to-reach-a-nuclear-deal-then-says-hes-fairly-close-to-an-agreement/",
    "timestamp": "2025-06-12T22:40:50Z"
  },
  {
    "title": "‘Graveyard dead’: Sheriff warns ‘No Kings’ protesters to behave",
    "description": "Throw a brick or aim a gun at a deputy, and 'we will be notifying your family where to collect your remains'",
    "link": "https://www.wnd.com/2025/06/graveyard-dead-sheriff-warns-no-kings-protesters-to-behave/",
    "timestamp": "2025-06-12T22:40:28Z"
  },
  {
    "title": "Coinbase hires top political strategist as crypto industry flexes its newfound political might",
    "description": "The crypto industry was among the largest spenders in the 2024 election.",
    "link": "https://www.bostonherald.com/2025/06/12/coinbase-david-plouffe/",
    "timestamp": "2025-06-12T22:40:27Z"
  },
  {
    "title": "Kristi Noem Declares, ‘We Are Here To Liberate’ Los Angeles From ‘Burdensome Leadership’",
    "description": "Homeland Security Secretary Kristi Noem said the Trump administration will \"liberate this city\" from its democratically elected leaders.\nThe post Kristi Noem Declares, ‘We Are Here To Liberate’ Los Angeles From ‘Burdensome Leadership’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/kristi-noem-declares-we-are-here-to-liberate-los-angeles-from-burdensome-leadership/",
    "timestamp": "2025-06-12T22:38:35Z"
  },
  {
    "title": "Oklahoma Republicans Want to Crack Down on Voter Fraud. Except, Well, There Is No Voter Fraud in Oklahoma.",
    "description": "“There is no question in everything this president does, he tries to inject chaos,” said Pennsylvania Governor Josh Shapiro.",
    "link": "https://www.esquire.com/news-politics/politics/a65048982/oklahoma-republicans-ron-desantis-los-angeles-protests/",
    "timestamp": "2025-06-12T22:35:00Z"
  },
  {
    "title": "Democratic senator Alex Padilla forcibly removed from homeland security press conference",
    "description": "California senator handcuffed after attempting to ask Kristi Noem a question",
    "link": "https://www.irishtimes.com/world/us/2025/06/12/democratic-senator-alex-padilla-forcibly-removed-from-homeland-security-press-conference/",
    "timestamp": "2025-06-12T22:31:35Z"
  },
  {
    "title": "U.S. Begins Evacuating Personnel From Middle East Amid Fears of Israeli Attack on Iran",
    "description": "The U.S. is partially evacuating personnel from Middle East bases amid rising tensions over fears of an unauthorized Israeli strike on Iran’s nuclear facilities.",
    "link": "https://www.shtfplan.com/headline-news/u-s-begins-evacuating-personnel-from-middle-east-amid-fears-of-israeli-attack-on-iran",
    "timestamp": "2025-06-12T22:30:56Z"
  },
  {
    "title": "House Passes $9.4 Billion Rescissions Package to Codify DOGE Cuts to PBS, NPR, USAID",
    "description": "The House of Representatives voted to pass a $9.4 billion rescissions package that would codify Department of Government Efficiency (DOGE) cuts to the U.S. Agency for International Development (USAID), and to the Corporation for Public Broadcasting (CPB).\nThe…",
    "link": "https://www.breitbart.com/politics/2025/06/12/house-passes-9-4-billion-rescissions-package-to-codify-doge-cuts-to-pbs-npr-usaid/",
    "timestamp": "2025-06-12T22:30:06Z"
  },
  {
    "title": "Prices for common baby items are rising due to Trump's tariffs, congressional analysis says",
    "description": "The cost of some baby gear has risen in recent weeks due to President Donald Trump’s tariff policies, according to a new congressional report",
    "link": "https://www.nbcnews.com/business/consumer/prices-common-baby-items-are-rising-due-trumps-tariffs-congressional-a-rcna212753",
    "timestamp": "2025-06-12T22:27:41Z"
  },
  {
    "title": "AOC Gets GOP Lawmaker to Walk Back His Words After Questioning If He Used 'Intimidation' Against Democratic Governors",
    "description": "Rep. Alexandria Ocasio-Cortez (D-NY) accused Rep. Gary Palmer (R-AL) of witness intimidation during a tense hearing on Capitol Hill Thursday.",
    "link": "https://www.ibtimes.com/aoc-gets-gop-lawmaker-walk-back-his-words-after-questioning-if-he-used-intimidation-against-3775479",
    "timestamp": "2025-06-12T22:27:16Z"
  },
  {
    "title": "US braces for potential Israeli strike on Iran even as Trump pursues nuclear deal",
    "description": "An attack on Iran \"could very well happen,\" President Trump said.",
    "link": "https://abcnews.go.com/Politics/us-braces-potential-israeli-strike-iran-trump-pursues/story?id=122793206",
    "timestamp": "2025-06-12T22:25:05Z"
  },
  {
    "title": "Jon Stewart slams ABC for firing Terry Moran after Trump criticism",
    "description": "Jon Stewart says ABC News 'shouldn’t have fired' Terry Moran after he criticized Donald Trump and his deputy chief of staff, Stephen Miller: 'They’re a f---ing joke.'",
    "link": "https://ew.com/jon-stewart-slams-abc-for-firing-terry-moran-over-trump-criticism-11753891",
    "timestamp": "2025-06-12T22:24:56Z"
  },
  {
    "title": "Trump’s DOJ cleans house of ‘weaponized prosecutors,’ including one who concocted Civil War-era charge against J6ers",
    "description": "Justice is coming to the DOJ under Attorney General Pam Bondi as prosecutors involved in the Biden administration's lawfare against Donald Trump and his supporters are gradually rooted out.",
    "link": "https://nypost.com/2025/06/12/opinion/trumps-doj-cleans-house-of-weaponized-prosecutors-including-one-who-concocted-civil-war-era-charge-against-j6ers/",
    "timestamp": "2025-06-12T22:24:56Z"
  },
  {
    "title": "DHS defends social media post calling for public to help ICE locate ‘all foreign invaders’ | CNN Politics",
    "description": "On Wednesday, the Department of Homeland Security posted a striking graphic on its official X account. Uncle Sam, a symbol of American patriotism, is depicted nailing a poster to a wall that reads, “Help your country… and yourself.” Written underneath the pos…",
    "link": "https://www.cnn.com/2025/06/12/politics/dhs-social-media-post-ice-deportations-criticisms",
    "timestamp": "2025-06-12T22:23:33Z"
  },
  {
    "title": "'Wave of panic': Businesses are in crosshairs of Trump immigration crackdown",
    "description": "From farms to construction sites, workplace raids have alarmed businesses that suddenly find themselves in the Trump administration's crosshairs.",
    "link": "https://www.usatoday.com/story/money/2025/06/12/trump-immigration-crackdown-rattles-businesses/84175142007/",
    "timestamp": "2025-06-12T22:23:31Z"
  },
  {
    "title": "Yellen expects Trump's tariffs will hike inflation to 3% year over year",
    "description": "Former Treasury Secretary Janet Yellen predicts President Donald Trump’s tariffs will cause prices to rise and average household income to fall, despite a slowing trend in the U.S. inflation rate.“I would expect inflation, on a year-over-year basis of this ye…",
    "link": "https://www.nbcnews.com/business/economy/yellen-expects-trumps-tariffs-will-hike-inflation-3-year-over-year-rcna212754",
    "timestamp": "2025-06-12T22:22:33Z"
  },
  {
    "title": "50501 Protest Group: Book Trump Military Parade Tickets, Then Don't Show",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCelebration and protest are expected to collide on Saturday as President Donald Trump's 79th birthday, the U.S. Army's 250th anniversary and hundreds of \"No Kings\" demonstrations converge across the country.\nT…",
    "link": "https://biztoc.com/x/b3a6b9bf0d90d2bf",
    "timestamp": "2025-06-12T22:22:27Z"
  },
  {
    "title": "'Spectacle of himself': Senate Republicans blast Alex Padilla after his forcible removal from DHS presser",
    "description": "Sen. Alex Padilla's detention by law enforcement at a DHS press conference sparked divided reactions, with most Republicans condemning his behavior.",
    "link": "https://www.foxnews.com/politics/spectacle-himself-senate-republicans-blast-alex-padilla-after-forcible-removal-from-dhs-presser",
    "timestamp": "2025-06-12T22:22:22Z"
  },
  {
    "title": "EXCLUSIVE: House Conservatives Urge Senate To Keep ‘Pay-For’ In Trump Bill",
    "description": "Rep. Josh Brecheen will send a letter Thursday urging the upper chamber to preserve a provision in Trump's \"big, beautiful\" bill.",
    "link": "https://dailycaller.com/2025/06/12/exclusive-house-conservatives-urge-senate-to-keep-pay-for-in-trump-bill/",
    "timestamp": "2025-06-12T22:16:47Z"
  },
  {
    "title": "50501 Protest Group: Book Trump Military Parade Tickets, Then Don't Show",
    "description": "A protest group has encouraged demonstrators to book up tickets to the military parade this weekend, in an effort to leave seats empty.",
    "link": "https://www.newsweek.com/50501-protest-trump-parade-tickets-no-show-2084869",
    "timestamp": "2025-06-12T22:13:02Z"
  },
  {
    "title": "Trump Says Israel 'Could Very Well' Strike Iran",
    "description": "President Donald Trump said Israel “could very well” strike Iran but that he had advised against an attack while negotiations were ongoing, as the departure of US staff from the region fans concerns about a coming assault.\n“I don’t want to say imminent, but i…",
    "link": "https://biztoc.com/x/8b7094873d667394",
    "timestamp": "2025-06-12T22:11:40Z"
  },
  {
    "title": "Trump troop deployment to California faces court scrutiny",
    "description": "A federal judge is considering California Gov. Gavin Newsom’s lawsuit attempting to block US President Donald Trump’s decision to deploy the National Guard to quell immigration protests that the Justice Department described as “ris[ing] to the level of rebell…",
    "link": "https://biztoc.com/x/ce12396dde11e07a",
    "timestamp": "2025-06-12T22:11:24Z"
  },
  {
    "title": "US reportedly won't aid in Israeli strikes on Iran",
    "description": "The administration of United States President Donald Trump has reportedly told the Israeli government that the US wouldn't be directly involved in any Israeli military strike against Iran's nuclear fa...",
    "link": "https://biztoc.com/x/23bba5b2ea69957e",
    "timestamp": "2025-06-12T22:11:23Z"
  },
  {
    "title": "Is Trump Politicizing the Military?",
    "description": "Critics say Trump’s military parade falls into a dangerous pattern.",
    "link": "http://foreignpolicy.com/2025/06/12/trump-politicizing-military-national-guard-parade-los-angeles/",
    "timestamp": "2025-06-12T22:10:47Z"
  },
  {
    "title": "Israeli attack on Iran could 'blow' nuclear deal hopes, Trump says",
    "description": "The US President called on ally Israel not to attack Iran amid rising tensions over a nuclear weapons production deal.",
    "link": "https://www.thejournal.ie/israel-attack-on-iran-could-blow-nuceal-deal-6731946-Jun2025/",
    "timestamp": "2025-06-12T22:10:05Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The major averages posted modest gains on Thursday, placing them on track for a winning week. Softer-than-anticipated inflation reports helped lift stocks.",
    "link": "https://www.cnbc.com/2025/06/12/stock-market-today-live-updates.html",
    "timestamp": "2025-06-12T22:08:26Z"
  },
  {
    "title": "Parents’ group urges federal investigation of YMCA over men in girls’ locker rooms",
    "description": "A parental rights group sent a letter to several federal agencies asking them to investigate the YMCA’s alleged violation of Title IX policies on June 10, 2025. / Credit: Ronnie Chua/Shutterstock\n\nWashington, D.C. Newsroom, Jun 12, 2025 / 18:08 pm (CNA).\nA pa…",
    "link": "https://www.catholicnewsagency.com/news/264725/parents-group-urges-federal-investigation-of-ymca-over-men-in-girls-locker-rooms",
    "timestamp": "2025-06-12T22:08:00Z"
  },
  {
    "title": "Don't fall for video of Trump saying he's banning Tesla production in the US",
    "description": "In June 2025, a video circulating online authentically showed U.S. President Donald Trump announcing a ban on the production of Tesla electric cars in the U.S.",
    "link": "https://www.snopes.com//fact-check/trump-banning-us-tesla-production/",
    "timestamp": "2025-06-12T22:08:00Z"
  },
  {
    "title": "'No Kings' demonstrations planned Saturday in New Hampshire",
    "description": "On Saturday, while President Donald Trump hosts a parade for the Army's anniversary, protests against his administration are planned across the country, including nearly 30 in New Hampshire.",
    "link": "https://www.wmur.com/article/no-kings-protest-trump-new-hampshire-61225/65050523",
    "timestamp": "2025-06-12T22:07:40Z"
  },
  {
    "title": "Protesters in National City condemn Trump’s immigration crackdown",
    "description": "The demonstration in front of the Panda Express on Highland Avenue between East Plaza Boulevard and East 12th Street was organic, with no one group organizing it. Instead, the call was spread through social media.",
    "link": "https://www.kpbs.org/news/politics/2025/06/12/protesters-in-national-city-condemn-trumps-immigration-crackdown",
    "timestamp": "2025-06-12T22:06:46Z"
  },
  {
    "title": "Two-state solution in the Middle East has been a core US policy for 25 years – is the Trump administration eyeing a change?",
    "description": "US Ambassador to Israel Mike Huckabee suggested that a Palestinian state was not on the table anytime soon.",
    "link": "https://theconversation.com/two-state-solution-in-the-middle-east-has-been-a-core-us-policy-for-25-years-is-the-trump-administration-eyeing-a-change-258753",
    "timestamp": "2025-06-12T22:04:15Z"
  },
  {
    "title": "ABC: Trump Administration Fails To Rescind Biden’s Anti-Merit Labor Mandate",
    "description": "WASHINGTON, June 12, 2025 (GLOBE NEWSWIRE) -- Associated Builders and Contractors today responded to the announcement from the Office of Management and Budget that President Donald Trump’s administration will continue to enforce former President Joe Biden’s a…",
    "link": "https://www.globenewswire.com/news-release/2025/06/12/3098779/0/en/ABC-Trump-Administration-Fails-To-Rescind-Biden-s-Anti-Merit-Labor-Mandate.html",
    "timestamp": "2025-06-12T22:04:00Z"
  },
  {
    "title": "Trump Issues Executive Order to Mitigate Wildfires by Clearing Fuel",
    "description": "President Donald Trump signed an executive order Thursday to help prevent and mitigate wildfires through better forest management, and through improving cooperation between relevant government departments.\nThe post Trump Issues Executive Order to Mitigate Wil…",
    "link": "https://www.breitbart.com/environment/2025/06/12/trump-issues-executive-order-to-mitigate-wildfires-by-clearing-fuel/",
    "timestamp": "2025-06-12T22:03:09Z"
  },
  {
    "title": "Video: Feds Ram Car in L.A. to Capture Rioter Accused of Punching CBP Officer",
    "description": "Video shows federal agents ramming a car in Los Angeles to catch a rioter accused of punching a U.S. border agent.\nThe post Video: Feds Ram Car in L.A. to Capture Rioter Accused of Punching CBP Officer appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/06/12/video-feds-ram-car-l-a-to-capture-rioter-accused-punching-cbp-officer/",
    "timestamp": "2025-06-12T22:02:00Z"
  },
  {
    "title": "‘A big mess’: With prior authorizations and insurance denials, some patients run out of time",
    "description": "Health insurers issue millions of prior authorization denials every year, leaving many patients stuck in a convoluted appeals process.",
    "link": "https://www.nbcnews.com/health/health-care/prior-authorization-insurance-denials-patients-treatment-rcna212068",
    "timestamp": "2025-06-12T22:01:58Z"
  },
  {
    "title": "Live: Head of Iran’s Revolutionary Guard reportedly killed in Israel attack",
    "description": "A U.S. official tells NewsNation that there was \"no U.S. involvement or U.S. assistance.\"",
    "link": "https://www.newsnationnow.com/world/israel-preparing-strike-iran/",
    "timestamp": "2025-06-12T22:01:36Z"
  },
  {
    "title": "Wall Street drifts as Oracle rallies and Boeing sags",
    "description": "U.S. stocks are drifting following another encouraging update on inflation. The S&P 500 added 0.3% and is sitting less than 2% below its record.",
    "link": "https://www.wishtv.com/news/business/wall-street-drifts-as-oracle-rallies-and-boeing-sags/",
    "timestamp": "2025-06-12T22:00:30Z"
  },
  {
    "title": "LA Mayor Bass Demands that Trump Stop the Immigration Raids Now",
    "description": "\"The individuals that are here with me today are all leaders in their areas and we all stand in support and solidarity and call for the raids to end.\"\nThe post LA Mayor Bass Demands that Trump Stop the Immigration Raids Now first appeared on Le·gal In·sur·rec…",
    "link": "https://legalinsurrection.com/2025/06/la-mayor-bass-demands-that-trump-stop-the-immigration-raids-now/",
    "timestamp": "2025-06-12T22:00:02Z"
  },
  {
    "title": "Commentary: How China beat Trump before the trade battle even started",
    "description": "Beijing has used rare earth controls to win the first skirmishes in the war over commerce, says Alan Beattie for the Financial Times.",
    "link": "https://www.channelnewsasia.com/commentary/trump-xi-talk-tariffs-china-rare-earths-trade-war-5177106",
    "timestamp": "2025-06-12T22:00:00Z"
  },
  {
    "title": "Workforce cuts could complicate IRS goal to modernize in the next two years",
    "description": "Agency leaders say they want to complete the “vast majority” of its modernization efforts within the next couple of years.",
    "link": "https://www.nextgov.com/modernization/2025/06/workforce-cuts-could-complicate-irs-goal-modernize-next-two-years/406048/",
    "timestamp": "2025-06-12T22:00:00Z"
  },
  {
    "title": "'One Big Beautiful Bill' boosts highest earners most, Congressional Budget Office says",
    "description": "The Congressional Budget Office says highest earners will benefit most from the so-called \"One Big Beautiful Bill.\" Here's how and by how much.",
    "link": "https://www.usatoday.com/story/money/personalfinance/2025/06/12/winners-losers-trump-tax-bill/84170894007/",
    "timestamp": "2025-06-12T21:58:05Z"
  },
  {
    "title": "‘Which One Of These Convicted Child Molesters…Would You Like To Stay?’: DHS Assistant Secretary Confronts Celebrity",
    "description": "A top Department of Homeland Security official called out Kim Kardashian Wednesday, after the reality television star called ICE raids \"inhumane.\"",
    "link": "https://dailycaller.com/2025/06/12/illegal-aliens-ice-raids-dhs-tricia-mclaughlin-kim-kardashian/",
    "timestamp": "2025-06-12T21:57:56Z"
  },
  {
    "title": "Trump administration tells 500,000 immigrants to 'self-deport' after revoking protections",
    "description": "President Donald Trump eliminated a temporary protected status program even as he bemoaned a shortage of undocumented immigrants in farm and hotel industries.",
    "link": "https://www.cnbc.com/2025/06/12/trump-immigrants-venezeula-cuba-dhs.html",
    "timestamp": "2025-06-12T21:56:20Z"
  },
  {
    "title": "Marines to begin operations in Los Angeles Friday, ahead of nationwide anti-Trump protests",
    "description": "Marines transition from training to operational support in Los Angeles despite legal challenges from Governor Gavin Newsom, as officials defend deployment to protect law enforcement during protests.",
    "link": "https://www.foxnews.com/us/marines-begin-operations-los-angeles-friday-ahead-nationwide-anti-trump-protests",
    "timestamp": "2025-06-12T21:51:59Z"
  },
  {
    "title": "Trump’s protest threats raise surveillance alarms around his military parade",
    "description": "President Donald Trump's warning that protesters of Saturday's US military parade in Washington, DC, will be met with \"very heavy force\" threatens to chill speech and underscores the need for protesters to take precautions around digital surveillance, privacy…",
    "link": "https://www.theverge.com/politics/686492/trump-military-parade-surveillance-protests-free-speech",
    "timestamp": "2025-06-12T21:50:24Z"
  },
  {
    "title": "The Left Is Selling Chaos. America Isn’t Buying.",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post The Left Is Selling Chaos. America Isn’t Buying. appeared first on The …",
    "link": "https://www.dailysignal.com/2025/06/12/the-left-is-selling-chaos-america-isnt-buying/",
    "timestamp": "2025-06-12T21:49:11Z"
  },
  {
    "title": "Online Posts Make Baseless Claim Linking Protesters to Craigslist Ad",
    "description": "Q: Is there an ad in Craigslist to hire people to riot in L.A.?\nA: No, there has been no such ad on Craigslist. Some social media posts cited a Craigslist ad to falsely claim it showed that people protesting the immigration raids in Los Angeles were being pai…",
    "link": "https://www.factcheck.org/2025/06/online-posts-make-baseless-claim-linking-protesters-to-craigslist-ad/",
    "timestamp": "2025-06-12T21:48:40Z"
  },
  {
    "title": "Josh Hawley Blames Nonprofits for “Bankrolling Civil Unrest” in LA Without Evidence",
    "description": "The Republican senator accused groups supporting immigrant communities of planning “astroturf” protests.\nThe post Josh Hawley Blames Nonprofits for “Bankrolling Civil Unrest” in LA Without Evidence appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/12/josh-hawley-la-protests-ice-nonprofits/",
    "timestamp": "2025-06-12T21:47:42Z"
  },
  {
    "title": "Trump ‘Doesn’t Speak With Precision,’ Justice Department Tells Judge",
    "description": "The Justice Department argued that Trump’s public statements about the Kilmar Abrego Garcia case didn’t reflect the government’s actual position.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-abrego-garcia-speak-with-precision-doj-judge-1235363600/",
    "timestamp": "2025-06-12T21:47:07Z"
  },
  {
    "title": "Lawrence O’Donnell Says Elon Musk Walking Back His Trump Tweets Proves He’s a ‘Pathological Liar’ | Video",
    "description": "The \"Last Word\" host says the Tesla CEO's recanted statements either show \"he can't be trusted\" or that he is willing to cover up the truth for the president\nThe post Lawrence O’Donnell Says Elon Musk Walking Back His Trump Tweets Proves He’s a ‘Pathological …",
    "link": "https://www.thewrap.com/lawrence-odonnell-elon-musk-donald-trump-pathological-liar-apology-video/",
    "timestamp": "2025-06-12T21:47:03Z"
  },
  {
    "title": "GOP tax bill would cost poor Americans $1,600 a year and boost highest earners by $12,000, CBO says",
    "description": "The Republican tax bill approved by the House would cost the poorest Americans roughly $1,600 a year while increasing the income of the wealthiest households by an average of $12,000 annually.",
    "link": "https://www.news4jax.com/news/politics/2025/06/12/gop-tax-bill-would-cost-poor-americans-1600-a-year-and-boost-highest-earners-by-12000-cbo-says/",
    "timestamp": "2025-06-12T21:45:31Z"
  },
  {
    "title": "'Be very careful': Republican Senators get stern warning from one of their own",
    "description": "A longtime Republican political strategist and publisher of The Bulwark is issuing a warning to the senators in her party that they need to be careful where they stand on their colleague, Sen. Alex Padilla (D-CA), being manhandled and handcuffed at a news con…",
    "link": "https://www.rawstory.com/republican-senators/",
    "timestamp": "2025-06-12T21:45:28Z"
  },
  {
    "title": "The old “religious right” is dead. The new one is stranger — and harder to fight.",
    "description": "For over six decades, the “religious right” in America was boomer “Christian nationalism,” straight out of The Handmaid’s Tale. It was about “keeping God in the schools” and the National Prayer Breakfast. It was traditionalist, mindful of theology, and, well,…",
    "link": "https://www.vox.com/politics/416042/religion-politics-trump-christian-nationalism-liberty-maga",
    "timestamp": "2025-06-12T21:43:46Z"
  },
  {
    "title": "A new front opens in the immigration battle: From the Politics Desk",
    "description": "The episode between Sen. Alex Padilla and the Department of Homeland Security further escalates the immigration showdown between Trump and the Democrats.",
    "link": "https://www.nbcnews.com/politics/politics-news/new-front-opens-immigration-battle-politics-desk-rcna212744",
    "timestamp": "2025-06-12T21:42:37Z"
  },
  {
    "title": "Trump moves to block California electric cars program",
    "description": "US President Donald Trump on Thursday signed resolutions blocking California’s landmark efforts to phase out gas-powered cars in favor of electric vehicles, a move the state immediately contested in court. Trump’s action, a rebuke of Democratic climate change…",
    "link": "https://www.digitaljournal.com/world/trump-moves-to-block-california-electric-cars-program/article",
    "timestamp": "2025-06-12T21:42:33Z"
  },
  {
    "title": "Victor Davis Hanson: The Left is Selling Chaos. America Isn’t Buying.",
    "description": "While Los Angeles erupts in chaos, California leaders like Gov. Gavin Newsom and Mayor Karen Bass seem more interested in defending violent protesters than upholding federal immigration law. Despite relentless media attacks on Donald Trump—especially on the e…",
    "link": "https://freerepublic.com/focus/f-news/4322703/posts",
    "timestamp": "2025-06-12T21:41:01Z"
  },
  {
    "title": "U.S., European Officials Warn of a Potential Israeli Attack on Tehran",
    "description": "Military action could trigger a counterstrike that derails ongoing nuclear talks with Iran.",
    "link": "http://foreignpolicy.com/2025/06/12/israel-attack-iran-nuclear-weapons-enriched-uranium-trump-iraq-embassy/",
    "timestamp": "2025-06-12T21:40:11Z"
  },
  {
    "title": "Usha Vance’s Stylist Bought New York-made Shoshanna Dress for Kennedy Center Event",
    "description": "JD Vance's wife has purchased multiple dresses and items from a New Jersey boutique.",
    "link": "http://wwd.com/fashion-news/fashion-scoops/usha-vance-stylist-kennedy-center-shoshanna-new-york-1237915979/",
    "timestamp": "2025-06-12T21:39:23Z"
  },
  {
    "title": "Trump says U.S. Steel controlled by him with 'golden share'",
    "description": "The United States has a &quot;golden share&quot; in United States Steel Corp, President Donald Trump said Thursday, adding it will be controlled by him after Nippon Steel Corp's massive investment in the iconic American producer. &quot;We have a golden share,…",
    "link": "https://japantoday.com/category/business/trump-says-u.s.-steel-controlled-by-him-with-golden-share",
    "timestamp": "2025-06-12T21:39:16Z"
  },
  {
    "title": "Was Senator Alex Padilla Arrested? Reason Senator Was Handcuffed",
    "description": "Padilla was suddenly removed by multiple men when he tried asking a question at Kristi Noem's press conference in Los Angeles.",
    "link": "https://hollywoodlife.com/2025/06/12/why-was-alex-padilla-arrested/",
    "timestamp": "2025-06-12T21:38:29Z"
  },
  {
    "title": "Air India crash refuels Boeing and airline’s problems",
    "description": "Fatal crash raises new concerns for both firms as they try to revamp after years of problems that marred reputations.",
    "link": "https://www.aljazeera.com/economy/2025/6/12/air-india-crash-refuels-boeing-and-airlines-problems",
    "timestamp": "2025-06-12T21:38:16Z"
  },
  {
    "title": "Live: Wall Street closes higher, as Trump urges 'numbskull' US Fed chief to cut rates",
    "description": "Australian markets are expected to follow Wall Street this morning. Markets are digesting inflation data and the US-China trade talks. Follow the day's events and insights as they happen with our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2025-06-13/asx-markets-business-live-news-june-13-2025/105412180",
    "timestamp": "2025-06-12T21:37:49Z"
  },
  {
    "title": "Shares of RH jump as luxury retailer takes steps to blunt tariff impact",
    "description": "Luxury retailer RH is contending with a tough housing market and higher tariffs, even as it opens new stores.",
    "link": "https://www.cnbc.com/2025/06/12/rh-rh-q1-2025-earnings.html",
    "timestamp": "2025-06-12T21:37:38Z"
  },
  {
    "title": "LA’s ICE Raids Are Impacting Domestic Violence Shelters",
    "description": "On Monday, as ICE swept Los Angeles with raids in President Donald Trump’s escalating drive for mass deportations of undocumented immigrants, a client of the Survivor Justice Center had an appointment for a court hearing.  The purpose was to secure a permanen…",
    "link": "https://www.motherjones.com/politics/2025/06/la-ice-raids-domestic-violence-shelters/",
    "timestamp": "2025-06-12T21:36:54Z"
  },
  {
    "title": "Trump clarifies: We remain committed to a diplomatic resolution to the Iran nuclear issue",
    "description": "Amid escalating tensions and reports of an impending Israeli strike, US President Trump reaffirms commitment to a diplomatic resolution for the Iran nuclear issue.",
    "link": "https://www.israelnationalnews.com/news/409900",
    "timestamp": "2025-06-12T21:36:54Z"
  },
  {
    "title": "Full List of Republicans Who Voted Against Donald Trump's DOGE Cuts",
    "description": "The House narrowly passed a rescissions bill cutting $9.4 billion, including $1.1 billion from public broadcasting.",
    "link": "https://www.newsweek.com/list-republicans-voted-against-doge-cuts-2084838",
    "timestamp": "2025-06-12T21:36:46Z"
  },
  {
    "title": "Trump signs executive order on wildfire prevention",
    "description": "President Donald Trump signed an executive order on Thursday that directed the top officials of the Interior and Agriculture Departments to consolidate their...",
    "link": "https://www.yahoo.com/news/trump-signs-executive-order-wildfire-213623266.html",
    "timestamp": "2025-06-12T21:36:23Z"
  },
  {
    "title": "Live: PM heads to G7 summit in Canada amid speculation about Trump meeting",
    "description": "Prime Minister Anthony Albanese is jetting off to Canada for the G7 summit, where Australian officials hope he'll secure a meeting with US President Donald Trump. Follow live.",
    "link": "https://www.abc.net.au/news/2025-06-13/federal-politics-live-june-13/105410464",
    "timestamp": "2025-06-12T21:36:01Z"
  },
  {
    "title": "'Fully justified': Graham plows ahead with Trump border funding despite Paul's objections",
    "description": "Senate Republicans clash over border security spending as Budget Committee Chair Lindsey Graham supports $150 billion border plan while Homeland Security Chair Rand Paul questions cost.",
    "link": "https://www.foxnews.com/politics/fully-justified-graham-plows-ahead-trump-border-funding-despite-pauls-objections",
    "timestamp": "2025-06-12T21:35:19Z"
  },
  {
    "title": "Democrats slam military parade as Trump's multimillion-dollar 'birthday party'",
    "description": "As Washington prepares to celebrate the 250th birthday of the Army on Saturday, lawmakers are speaking out on what could be an astronomical cost for the parade.",
    "link": "https://abcnews.go.com/Politics/lawmakers-slam-military-parade-trumps-multimillion-dollar-birthday/story?id=122791267",
    "timestamp": "2025-06-12T21:34:34Z"
  },
  {
    "title": "Sole survivor of Air India crash",
    "description": "Air India has confirmed that only one of the 242 people on board its flight that crashed into a doctors' hostel in Ahmedabad has survived.\n\nAlso in the programme: Donald Trump has urged Israel not to launch an attack on Iran's nuclear facilities - we hear fro…",
    "link": "https://www.bbc.co.uk/programmes/w172zss3g3lhy0z",
    "timestamp": "2025-06-12T21:34:00Z"
  },
  {
    "title": "R. Kelly Seeks Trump Pardon, Attorney Says Singer Has Been ‘Punished’ to Solitary Confinement and ‘Has Spiders Crawling All Over Him’",
    "description": "After R. Kelly filed an emergency motion seeking home confinement for fears for his safety in prison earlier this week, the singer’s lawyer is claiming that he is now currently being “punished” with solitary confinement for taking the action. Attorney Beau Br…",
    "link": "https://variety.com/2025/music/news/r-kelly-seeks-trump-pardon-spiders-1236429885/",
    "timestamp": "2025-06-12T21:32:44Z"
  },
  {
    "title": "Sen. John Fetterman spotted dining with Steve Bannon at MAGA hotspot in DC on wedding anniversary",
    "description": "Fetterman was seen dining with Breitbart's Matt Boyle and Steve Bannon at MAGA hotspot Butterworth's on Monday.",
    "link": "https://nypost.com/2025/06/12/us-news/sen-john-fetterman-dined-with-steve-bannon-at-maga-hotspot-in-dc/",
    "timestamp": "2025-06-12T21:31:43Z"
  },
  {
    "title": "U.S. governors divided along party lines about military troops deployed to protests",
    "description": "California Democratic Gov Gavin Newsom is calling President Donald Trump's military intervention at protests over federal immigration policy in Los Angeles an assault on democracy and has sued to try to stop it. Meanwhile, Texas Republican Gov. Greg Abbott is…",
    "link": "https://japantoday.com/category/features/opinions/us-governors-are-divided-along-party-lines-about-military-troops-deployed-to-protests",
    "timestamp": "2025-06-12T21:30:11Z"
  },
  {
    "title": "Trump says Israeli strike on Iran could happen but wants to avoid conflict",
    "description": "U.S. President Donald Trump said on Thursday that an Israeli strike on Iran &quot;could very well happen&quot; but he would not call it imminent and prefers to avoid conflict with Tehran and reach a peaceful solution over its nuclear program. Trump's comments…",
    "link": "https://japantoday.com/category/world/trump-says-israeli-strike-on-iran-could-happen-but-wants-to-avoid-conflict1",
    "timestamp": "2025-06-12T21:28:54Z"
  },
  {
    "title": "House Republican Throws Down With Tim Walz Over Him Calling ICE Agents ‘Modern-Day Gestapo’",
    "description": "\"I said President Trump was using them as his modern-day Gestapo, not identifying who you are, coming up in unmarked vans, taking people away–”\nThe post House Republican Throws Down With Tim Walz Over Him Calling ICE Agents ‘Modern-Day Gestapo’ first appeared…",
    "link": "https://www.mediaite.com/media/news/house-republican-throws-down-with-tim-walz-over-him-calling-ice-agents-modern-day-gestapo/",
    "timestamp": "2025-06-12T21:28:41Z"
  },
  {
    "title": "Home appliances swept up in expansion of Trump steel tariffs",
    "description": "The tariffs, which are currently at 50% for most countries, would take effect on an additional range of \"steel derivative products\" on June 23, the Commerce ...",
    "link": "https://finance.yahoo.com/news/home-appliances-swept-expansion-trump-212840539.html",
    "timestamp": "2025-06-12T21:28:40Z"
  },
  {
    "title": "Protests over immigration raids continue across U.S. with more planned",
    "description": "Protests over federal immigration enforcement raids are flaring up around the country, as officials in cities from coast to coast get ready for major demonstrations against President Donald Trump over the weekend. While many demonstrations against the Immigra…",
    "link": "https://japantoday.com/category/world/protests-over-immigration-raids-continue-across-the-us-with-more-planned",
    "timestamp": "2025-06-12T21:28:32Z"
  },
  {
    "title": "Hegseth says the Pentagon has contingency plans to invade Greenland, Panama if necessary",
    "description": "U.S. Defense Secretary Pete Hegseth appeared to acknowledge that the Pentagon has developed plans to take over Greenland and Panama by force if necessary but refused to answer repeated questions at a hotly combative congressional hearing Thursday about his us…",
    "link": "https://japantoday.com/category/world/hegseth-says-the-pentagon-has-contingency-plans-to-invade-greenland-if-necessary",
    "timestamp": "2025-06-12T21:28:22Z"
  },
  {
    "title": "Trump officials vow to step up LA crackdown; Democratic senator dragged away in protest",
    "description": "U.S. Department of Homeland Security Secretary Kristi Noem pledged to &quot;liberate&quot; Los Angeles on Thursday at a press conference that was dramatically interrupted when federal agents dragged a Democratic U.S. senator out of the room, forced him to the…",
    "link": "https://japantoday.com/category/world/trump-officials-vow-to-step-up-la-crackdown-democratic-us-senator-dragged-away-in-protest",
    "timestamp": "2025-06-12T21:28:10Z"
  },
  {
    "title": "Trump: US remains committed to 'diplomatic resolution' with Iran",
    "description": "United States President Donald Trump affirmed his commitment to a \"diplomatic resolution\" with Iran on the \"nuclear issue.\"In a post on Truth Social, Trump stated that his entire administration \"has b...",
    "link": "https://biztoc.com/x/66e4606cffa5a633",
    "timestamp": "2025-06-12T21:27:04Z"
  }
]