[
  {
    "title": "US military on American soil: Trump’s threats are getting more real",
    "description": "It’s been evident for a long time that President Donald Trump is quite fond of the idea of dispatching the US military on domestic soil. It’s one of the outcomes that those who are wary of Trump’s more authoritarian tendencies fear most, because of the Pandor…",
    "link": "https://www.cnn.com/2025/08/07/politics/us-military-trump",
    "timestamp": "2025-08-07T17:52:04Z"
  },
  {
    "title": "Trump will only meet with Putin if Russian president also meets with Volodymyr Zelensky",
    "description": "President Trump will only meet with Russian President Vladimir Putin if the dictator also meets with Ukrainian President Volodymyr Zelensky, The Post can exclusively reveal. “Putin must meet with Zelensky for the meeting to occur,” a White House official told…",
    "link": "https://freerepublic.com/focus/f-news/4333256/posts",
    "timestamp": "2025-08-07T17:51:07Z"
  },
  {
    "title": "Armenia, Azerbaijan and Turkiye Would Lose From US Zangezur Plan",
    "description": "The transfer of control over the Zangezur corridor to the US is a betrayal toward both Russia and Armenian people by Prime Minister Nikol Pashinyan, Yevgeny Mikhailov, Director of the Center for Strategic Studies of the South Caucasus Countries, tells Sputnik.",
    "link": "https://sputnikglobe.com/20250807/armenia-azerbaijan-and-turkiye-would-lose-from-us-zangezur-plan-1122573320.html",
    "timestamp": "2025-08-07T17:50:48Z"
  },
  {
    "title": "Can Trump Admin’s New Probe Take Down Jack Smith?",
    "description": "DAILY CALLER NEWS FOUNDATION—Former special counsel Jack Smith is finally facing a federal probe over his conduct while prosecuting President Donald Trump, though its impact... Read More\nThe post Can Trump Admin’s New Probe Take Down Jack Smith? appeared firs…",
    "link": "https://www.dailysignal.com/2025/08/07/can-trump-admins-new-probe-take-down-jack-smith/",
    "timestamp": "2025-08-07T17:49:29Z"
  },
  {
    "title": "Fox News Files to Dismiss Gavin Newsom’s $787 Million Defamation Lawsuit Against Jesse Watters",
    "description": "The news organization calls the governor's effort a \"political stunt\" that should be dropped \nThe post Fox News Files to Dismiss Gavin Newsom’s $787 Million Defamation Lawsuit Against Jesse Watters appeared first on TheWrap.",
    "link": "https://www.thewrap.com/fox-news-files-to-dismiss-gavin-newsoms-defamation-lawsuit-jesse-watters/",
    "timestamp": "2025-08-07T17:48:21Z"
  },
  {
    "title": "Nevada governor raises concern about Nevada solar industry in letter to Burgum | Nevada",
    "description": "Nevada governor raises concern about Nevada solar industry in letter to Burgum | Nevadareviewjournal.com",
    "link": "https://www.reviewjournal.com/post/3410747",
    "timestamp": "2025-08-07T17:48:02Z"
  },
  {
    "title": "The White House has a preferred alternative to PBS. It may already be in countless classrooms.",
    "description": "The Corporation for Public Broadcasting announced last week that it would shut down after Congress voted to claw back over $500 million of federal funding from the organization. The announcement imperils local PBS and NPR stations around the country that have…",
    "link": "https://www.vox.com/today-explained-podcast/422812/prageru-education-pbs-npr-cpb-defunding",
    "timestamp": "2025-08-07T17:47:53Z"
  },
  {
    "title": "Karl Rove Warns of ‘Consequences for Both Parties’ in Texas Redistricting Spat",
    "description": "Republican strategist Karl Rove has warned of \"consequences\" for both Republicans and Democrats in a monumental redistricting fight out of Texas.\nThe post Karl Rove Warns of ‘Consequences for Both Parties’ in Texas Redistricting Spat first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/tv/karl-rove-warns-of-consequences-for-both-parties-in-texas-redistricting-spat/",
    "timestamp": "2025-08-07T17:47:10Z"
  },
  {
    "title": "Trump to meet Putin and Zelensky 'next week' & declares Russia 'extraordinary threat to US'",
    "description": "Day 1261. Today, with 24 hours to go until Donald Trump's ceasefire deadline passes, we assess reports that he intends to meet ...",
    "link": "https://biztoc.com/x/f4603c45b78c1f4e",
    "timestamp": "2025-08-07T17:46:53Z"
  },
  {
    "title": "More than 60 countries scramble to respond to Trump’s latest tariffs",
    "description": "Industry representatives warn of job losses and say decision could be ‘nail in the coffin’ for those exporting to the US\nSee the full list of Trump tariff rates\nMore than 60 countries around the world are scrambling to respond to the latest wave of US tariffs…",
    "link": "https://biztoc.com/x/c18372c4509335a8",
    "timestamp": "2025-08-07T17:46:35Z"
  },
  {
    "title": "Europe to Escape New Trump Pharmaceutical Tariffs",
    "description": "In a recent interview with CNBC, President Donald Trump threatened to place a 250 percent tariff on all pharmaceutical imports.",
    "link": "https://biztoc.com/x/e8f8344bb651f611",
    "timestamp": "2025-08-07T17:46:29Z"
  },
  {
    "title": "Trump wanted a US-made iPhone. Apple gave him a gold statue",
    "description": "It's now clear that Apple plans to survive Donald Trump's trade war by playing to the president's ego.\nOn Wednesday, Trump announced that Apple would be exempt from a threatened 100 percent tariff on semiconductors that could have driven up the cost of iPhone…",
    "link": "https://biztoc.com/x/bdc7736487731dcf",
    "timestamp": "2025-08-07T17:46:21Z"
  },
  {
    "title": "Vance visiting Indiana as Trump urges GOP-led states to redistrict",
    "description": "As President Donald Trump pressures Republican states to reopen the process of redistricting mid cycle, Vice President JD Vance is set to meet with GOP leaders in Indiana.",
    "link": "https://biztoc.com/x/6c229471f868f1fe",
    "timestamp": "2025-08-07T17:46:09Z"
  },
  {
    "title": "Trump's War on Economic Data Is a Dangerous Move for MAGA's Own Agenda",
    "description": "The Trump administration stands on the cusp of something potentially transformative. If President Donald Trump succeeds in unleashing a new era of energy abundance and securing America's leadership in artificial intelligence, the economic gains will be profou…",
    "link": "https://biztoc.com/x/a2a2d4b13c88e6e8",
    "timestamp": "2025-08-07T17:45:58Z"
  },
  {
    "title": "Should You Invest Your Retirement In Private Equity Funds?",
    "description": "President Trump is set to sign an executive order that would potentially allow Americans to invest their retirement funds in private equity funds - should you?",
    "link": "https://www.forbes.com/sites/jimwang/2025/08/07/should-you-invest-your-retirement-in-private-equity-funds/",
    "timestamp": "2025-08-07T17:45:38Z"
  },
  {
    "title": "United States expects monthly tariff revenue to rise to $50bn",
    "description": "US Commerce Secretary Lutnick forecasts the increase as Trump announces levies on pharma and semiconductor chips.",
    "link": "https://www.aljazeera.com/economy/2025/8/7/united-states-expects-monthly-tariff-revenue-to-rise-to-50bn",
    "timestamp": "2025-08-07T17:44:43Z"
  },
  {
    "title": "‘There’s No One Even Close!’ CNN’s Harry Enten Reveals Favorite to Win 2028 GOP Presidential Nomination",
    "description": "CNN's Harry Enten provided a definitive answer as to who is the favorite to win the Republican presidential nomination in 2028 on Thursday.\nThe post ‘There’s No One Even Close!’ CNN’s Harry Enten Reveals Favorite to Win 2028 GOP Presidential Nomination first …",
    "link": "https://www.mediaite.com/media/tv/theres-no-one-even-close-cnns-harry-enten-reveals-favorite-to-win-2028-gop-presidential-nomination/",
    "timestamp": "2025-08-07T17:42:32Z"
  },
  {
    "title": "Europe to Escape New Trump Pharmaceutical Tariffs",
    "description": "In a recent interview with CNBC, President Donald Trump threatened to place a 250 percent tariff on all pharmaceutical imports.",
    "link": "https://www.newsweek.com/europe-escapes-new-trump-pharmaceutical-tariffs-2110352",
    "timestamp": "2025-08-07T17:42:25Z"
  },
  {
    "title": "Trump’s Census Bombshell Could Upend 2026 Midterms",
    "description": "President Donald Trump has directed the U.S. Department of Commerce to immediately begin work on updating the 2020 U.S. Census.",
    "link": "https://dailycaller.com/2025/08/07/trumps-census-illegal-immigrants-2026-midterms-democrats-republicans/",
    "timestamp": "2025-08-07T17:41:40Z"
  },
  {
    "title": "Trump poised to meet Putin to discuss Ukraine – but Zelensky set to be left on the sidelines",
    "description": "But Zelensky may have bargaining chips that would play to Ukraine’s advantage.",
    "link": "https://theconversation.com/trump-poised-to-meet-putin-to-discuss-ukraine-but-zelensky-set-to-be-left-on-the-sidelines-262836",
    "timestamp": "2025-08-07T17:41:24Z"
  },
  {
    "title": "JD Vance Pretends 'South Park' Jokes About Him Are Compliments — And Gets Big Reality Check",
    "description": "\"That's a pretty sad attempt at cope,\" one social media user snarked at the vice president.",
    "link": "https://www.huffpost.com/entry/jd-vance-mocked-for-acting-like-south-park-dig-is-a-compliment_n_6894c90ee4b067651d49225d",
    "timestamp": "2025-08-07T17:41:10Z"
  },
  {
    "title": "Things Aren’t Going Donald Trump’s Way",
    "description": "He hasn’t ended the wars in Ukraine and Gaza. His economy looks shaky. And then there’s Jeffrey Epstein.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/trump-ukraine-gaza-economy/683786/?utm_source=yahoo-news",
    "timestamp": "2025-08-07T17:40:52Z"
  },
  {
    "title": "Things Aren’t Going Donald Trump’s Way",
    "description": "He hasn’t ended the wars in Ukraine and Gaza. His economy looks shaky. And then there’s Jeffrey Epstein.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/trump-ukraine-gaza-economy/683786/",
    "timestamp": "2025-08-07T17:40:52Z"
  },
  {
    "title": "KFF Health News' 'What the Health?': Kennedy Cancels Vaccine Funding",
    "description": "The Health and Human Services secretary is winding down nearly $500 million in mRNA research funding, citing false claims that the technology is ineffective against respiratory illnesses — and notching a victory for critics of the covid vaccines. And Presiden…",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-409-rfk-jr-mrna-vaccine-funding-august-7-2025/",
    "timestamp": "2025-08-07T17:40:00Z"
  },
  {
    "title": "Steelers OT Calvin Anderson nearly died from malaria — he’s now advocating to save others",
    "description": "WASHINGTON — As Calvin Anderson walked the long, narrow hallways of the Longworth House Office Building, it didn’t take much for him to stand out. The Pittsburgh Steelers’ backup offensive tackle is 6-foot-5 and more than 300 pounds, towering over U.S. House …",
    "link": "https://andscape.com/features/calvin-anderson-malaria-treatment-foreign-aid-pittsburgh-steelers-nearly-died-from-malaria-hes-now-advocating-to-save-others/",
    "timestamp": "2025-08-07T17:39:58Z"
  },
  {
    "title": "Vance visiting Indiana as Trump urges GOP-led states to redistrict",
    "description": "As President Donald Trump pressures Republican states to reopen the process of redistricting mid cycle, Vice President JD Vance is set to meet with GOP leaders in Indiana.",
    "link": "https://www.pbs.org/newshour/politics/vance-visiting-indiana-as-trump-urges-gop-led-states-to-redistrict",
    "timestamp": "2025-08-07T17:39:03Z"
  },
  {
    "title": "Tennessee Sen. Marsha Blackburn is running for governor",
    "description": "Tennessee Sen. Marsha Blackburn launched her long-awaited campaign for governor Wednesday, becoming the second Republican from the state’s congressional delegation to enter the race to succeed term-limited GOP Gov. Bill Lee. Blackburn, who hopes to become the…",
    "link": "https://freerepublic.com/focus/f-news/4333254/posts",
    "timestamp": "2025-08-07T17:38:56Z"
  },
  {
    "title": "‘The best is yet to come’: White House celebrates 200 days of Trump 2.0",
    "description": "Articulates multiple 'promises made, promises kept' since retaking office Jan. 20",
    "link": "https://www.wnd.com/2025/08/best-is-yet-come-white-house-celebrates-200/",
    "timestamp": "2025-08-07T17:37:36Z"
  },
  {
    "title": "Kremlin confirms Trump-Putin summit plans as Zelenskiy pushes for European role",
    "description": "MOSCOW: Russian President Vladimir Putin and US President Donald Trump will meet “in the coming days,” the Kremlin said on Thursday (August 7), as Trump seeks a breakthrough to end the war in Ukraine after voicing fr",
    "link": "https://www.channelnewsasia.com/world/kremlin-confirms-trump-putin-summit-plans-zelenskiy-pushes-european-role-5283646",
    "timestamp": "2025-08-07T17:37:00Z"
  },
  {
    "title": "Judge Denies Trump Request as Newsom National Guard Case Is Set To Start",
    "description": "The trial is set to begin August 11 with Newsom challenging Trump's use of the California National Guard.",
    "link": "https://www.newsweek.com/judge-denies-trump-request-newsom-national-guard-case-set-start-2110313",
    "timestamp": "2025-08-07T17:35:59Z"
  },
  {
    "title": "‘No Other Solution’: Trump Demands Intel CEO Resign Over China Ties",
    "description": "President Donald Trump demanded on Thursday that Intel CEO Lip-Bu Tan resign from his position over his alleged ties to Communist China.",
    "link": "https://dailycaller.com/2025/08/07/trump-intel-ceo-lip-bu-tan-resign/",
    "timestamp": "2025-08-07T17:35:43Z"
  },
  {
    "title": "Debunking Democrats’ Lies About Medicaid",
    "description": "By Sen. John Barrasso, The Daily Signal | August 04, 2025\nDemocrats and the media are doing everything they can to slow the momentum of President Donald Trump by attacking the “One Big, Beautiful” law’s Medicaid provisions.\nWhile Democrats want to weaken Medi…",
    "link": "https://biztoc.com/x/67423d9d35f818c5",
    "timestamp": "2025-08-07T17:35:19Z"
  },
  {
    "title": "US treasury secretary praises ‘manufacturing renaissance’ as Trump tariffs snap into effect – live updates",
    "description": "",
    "link": "https://biztoc.com/x/55b239ece3645f43",
    "timestamp": "2025-08-07T17:34:55Z"
  },
  {
    "title": "Five important cases the Supreme Court is set to decide this coming term",
    "description": "A view of the US Supreme Court on July 1, 2024, in Washington, DC. Donald Trump on Monday hailed a \"big win\" for democracy after the US Supreme Court ruled that presidents have presumptive immunity for official acts -- a decision set to delay his trial for co…",
    "link": "https://biztoc.com/x/4b06b35d1fc634d6",
    "timestamp": "2025-08-07T17:34:51Z"
  },
  {
    "title": "Socialist Zohran Mamdani has blistering response to Andrew Cuomo’s alleged phone call with Trump: ‘Disqualifying’",
    "description": "Democratic socialist Zohran Mamdani quickly seized Thursday on a report that Andrew Cuomo and President Trump had a call in recent weeks — blasting such alleged coordination as “disqualifying” for a prospective Big Apple mayor. Mamdani contended that New York…",
    "link": "https://nypost.com/2025/08/07/us-news/socialist-zohran-mamdani-has-blistering-response-to-andrew-cuomos-alleged-phone-call-with-trump-disqualifying/",
    "timestamp": "2025-08-07T17:34:12Z"
  },
  {
    "title": "CNN Breaks Down the Estimated Cost of Trump’s Tariffs on the Average American Family",
    "description": "\"Obviously, that is significant, as Americans we know are worried about these tariffs, worried about their finances, worried about inflation.\"\nThe post CNN Breaks Down the Estimated Cost of Trump’s Tariffs on the Average American Family first appeared on Medi…",
    "link": "https://www.mediaite.com/politics/trump/cnn-breaks-down-the-estimated-cost-of-trumps-tariffs-on-the-average-american-family/",
    "timestamp": "2025-08-07T17:33:37Z"
  },
  {
    "title": "Tim Cook Slammed For 'Disgusting' Gift-Giving Meeting With Trump",
    "description": "The Apple CEO presented the president with a “unique” piece of glass held by 24-karat gold during a celebratory event Wednesday in the Oval Office.",
    "link": "https://www.huffpost.com/entry/tim-cook-gift-giving-meeting-with-trump_n_6894a18ae4b0b5385d5f56db",
    "timestamp": "2025-08-07T17:33:20Z"
  },
  {
    "title": "International Poll Shows Strong Support for Arms, Energy Embargo on Israel",
    "description": "Large percentages of people in five nations want arms, fuel, and machinery embargoes on Israel in response to its obliteration and starvation of Gaza, a poll published Thursday revealed.The survey—which was conducted last month by Pollfish for the Global Ener…",
    "link": "https://www.commondreams.org/news/international-survey-gaza",
    "timestamp": "2025-08-07T17:31:55Z"
  },
  {
    "title": "Trump's War on Economic Data Is a Dangerous Move for MAGA's Own Agenda",
    "description": "The Bureau of Labor Statistics, the CBO, and the Fed are far from perfect. But the U.S. needs a statistical system that is modern, agile, and protected from political interference.",
    "link": "https://reason.com/2025/08/07/trumps-war-on-economic-data-is-a-dangerous-move-for-magas-own-agenda/",
    "timestamp": "2025-08-07T17:31:49Z"
  },
  {
    "title": "Trump’s FBI Reportedly Begins Purging Deep Staters From Its Ranks",
    "description": "Three senior FBI officials, including at least one involved with Trump investigations, are being fired, according to multiple reports.",
    "link": "https://dailycaller.com/2025/08/07/trumps-fbi-reportedly-begins-purging-deep-staters-from-its-ranks/",
    "timestamp": "2025-08-07T17:31:49Z"
  },
  {
    "title": "Lawmakers under fire for sharing ICE raid info, warning locals of immigration enforcement operations",
    "description": "Democratic lawmakers including Alexandria Ocasio-Cortez face criticism for advising constituents on avoiding ICE operations as Trump administration ramps up immigration enforcement",
    "link": "https://www.foxnews.com/politics/lawmakers-under-fire-sharing-ice-raid-info-warning-locals-immigration-enforcement-operations",
    "timestamp": "2025-08-07T17:31:31Z"
  },
  {
    "title": "Europe Stocks Rally on Hopes of Russia-Ukraine Truce; Novo Jumps",
    "description": "European stocks gained during one of the last busy days of the earnings season as optimism over a potential ceasefire in Ukraine rose, fueled by news that Vladimir Putin and Donald Trump will meet in the next few days.",
    "link": "https://financialpost.com/pmn/business-pmn/europe-stocks-rally-on-hopes-of-russia-ukraine-truce-novo-jumps",
    "timestamp": "2025-08-07T17:31:09Z"
  },
  {
    "title": "Former Superman actor Dean Cain says he’s joining ICE",
    "description": "In an interview with Fox News, Dean Cain revealed that he decided to join the agency after sharing one of ICE’s recruitment videos on social media the day before.",
    "link": "https://richmond.com/news/nation-world/article_e33bb09c-c8da-5243-a31b-33a3ea6a81fc.html",
    "timestamp": "2025-08-07T17:30:00Z"
  },
  {
    "title": "Former Superman actor Dean Cain joins ICE to back Trump's mass deportations policy",
    "description": "Cain has said he will “be sworn in as an ICE agent” soon.",
    "link": "https://www.thejournal.ie/former-superman-actor-dean-cain-joins-ice-6785196-Aug2025/",
    "timestamp": "2025-08-07T17:28:30Z"
  },
  {
    "title": "Congress Took Over DC In The 90s — And It Worked",
    "description": "Trump's proposal to \"federalize\" Washington, D.C. over crime would not be the first time that the district's problems prompted aggressive federal action.",
    "link": "https://dailycaller.com/2025/08/07/congress-took-over-dc-90s-it-worked-marion-barry-crime-trump/",
    "timestamp": "2025-08-07T17:28:01Z"
  },
  {
    "title": "Mamdani Calls Out “Betrayal” of Cuomo Conspiring With Trump",
    "description": "New York City Democratic mayoral nominee Zohran Mamdani excoriated Andrew Cuomo’s recent call with President Donald Trump as a “betrayal” to the entire city.“It is at this very site that we understand the cost of this news, that former Governor Cuomo has been…",
    "link": "https://newrepublic.com/post/198904/mamdani-reaction-cuomo-trump-phone-call",
    "timestamp": "2025-08-07T17:27:59Z"
  },
  {
    "title": "Barron Trump to marry Sydney Sweeney after President's praise for actor? Fox News host's bold remark raises eyebrows",
    "description": "Jesse Watters has a bizarre suggestion for Sydney Sweeney’s next move: marrying Barron Trump. The Fox News host made the eyebrow-raising comment during a segment on his show as he leapt to Sweeney’s defence amid backlash over her new denim ad campaign with Am…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-barron-trump-to-marry-sydney-sweeney-after-presidents-praise-for-actor-american-eagle-ad-fox-news-hosts-remark-raises-eyebrows/articleshow/123171408.cms",
    "timestamp": "2025-08-07T17:27:49Z"
  },
  {
    "title": "Trump tariffs wipe out $12 billion from global carmakers – WSJ",
    "description": "US President Donald Trump’s tariffs have cost 14 global automakers nearly $12 billion Read Full Article at RT.com",
    "link": "https://www.rt.com/business/622635-car-manufacturers-tariff-losses/",
    "timestamp": "2025-08-07T17:27:33Z"
  },
  {
    "title": "What’s Next for the Once-‘Glorified,’ Now Desperate Intel? Trump’s Opposition, Sluggish Business, and TSMC Acquisition Rumors Make a Comeback Much Harder, But Not Impossible",
    "description": "Intel is witnessing a series of events that are pushing the company back in terms of business and sustainability, and with the US administration opposing the top leadership, it seems like things are getting pretty harder for Team Blue. President Trump's Oppos…",
    "link": "https://wccftech.com/whats-next-for-the-once-glorified-now-desperate-intel/",
    "timestamp": "2025-08-07T17:27:29Z"
  },
  {
    "title": "Coastal city greenlights new visitor tax amid widespread overtourism trend",
    "description": "Aberdeen, Scotland, will implement a 7% visitor tax starting in April 2027, adding approximately $6 to average hotel stays to generate over $7 million annually.",
    "link": "https://www.foxnews.com/travel/coastal-city-greenlights-new-visitor-tax-amid-widespread-overtourism-trend",
    "timestamp": "2025-08-07T17:27:11Z"
  },
  {
    "title": "Trump slashed Medicaid — now he’s got another health care crisis looming - NewsBreak",
    "description": "President Donald Trump and congressional Republicans are trying to sell the American public on their “ One Big, Beautiful Bill ” despite the fact many Amer",
    "link": "https://www.newsbreak.com/share/4160324298365-trump-slashed-medicaid-now-he-s-got-another-health-care-crisis-looming?s=a2&amp;share_destination_id=MTg1NDMxNjAyLTE3NTQ1ODc1NzY4ODc%3D&amp;pd=0CY3EI2n&amp;hl=en_US&amp;send_time=1754587576&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.31.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q3-v5%2Cns_foryou_blend_exp_25q3-v2%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_rank_exp_25q3-v2",
    "timestamp": "2025-08-07T17:26:49Z"
  },
  {
    "title": "Video Shows DOJ Senior Adviser Urging Fellow Jan. 6 Rioters to Attack Cops: ‘F*ck Them! Yeah! Kill’Em! Yeah!’",
    "description": "A January 6 rioter who was captured on police body cam video yelling for police officers to be attacked and killed now has a top job at the Department of Justice.\nThe post Video Shows DOJ Senior Adviser Urging Fellow Jan. 6 Rioters to Attack Cops: ‘F*ck Them!…",
    "link": "https://www.mediaite.com/crime/video-shows-doj-senior-adviser-urging-fellow-jan-6-rioters-to-attack-cops-fck-them-yeah-killem-yeah/",
    "timestamp": "2025-08-07T17:25:56Z"
  },
  {
    "title": "Trump And Cuomo Definitely Not Best Friends Plotting To Take Down Zohran Mamdani, For Sure!",
    "description": "Little bit of a Cuomo roundup.",
    "link": "https://www.wonkette.com/p/trump-and-cuomo-definitely-not-best",
    "timestamp": "2025-08-07T17:25:53Z"
  },
  {
    "title": "Donald Trump sends chilling warning to late night TV hosts Jimmy Fallon and Kimmel",
    "description": "US President Donald Trump branded Jimmy Fallon and Jimmy Kimmel 'talentless' and suggested they don't have long left in their late night slots.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-warning-tv-hosts-jimmy-fallon-kimmel-stephen-colbert-019818-20250807",
    "timestamp": "2025-08-07T17:25:11Z"
  },
  {
    "title": "Islamic State Beheads Christians, Burns Churches in Mozambique Rampage",
    "description": "The Middle East Media Research Institute (MEMRI) is warning of a “silent genocide” in Mozambique, where Islamic State jihadis are destroying churches, burning down villages, and beheading Christians--and then posting triumphant photos and videos of their atro…",
    "link": "https://www.breitbart.com/africa/2025/08/07/islamic-state-beheads-christians-burns-churches-mozambique-rampage/",
    "timestamp": "2025-08-07T17:24:08Z"
  },
  {
    "title": "How Elizabeth Warren triggered Donald Trump",
    "description": "After a rough July jobs report, Trump promptly fired the head of the Bureau of Labor Statistics, claiming without evidence that the data was “rigged” to hurt him.",
    "link": "https://biztoc.com/x/2b7aa0847d524bed",
    "timestamp": "2025-08-07T17:23:35Z"
  },
  {
    "title": "Texas Democrats plead for donations to extend their walkout and block Trump’s redistricting plan",
    "description": "The walkout could last weeks — if not months.",
    "link": "https://www.bostonherald.com/2025/08/07/redistricting-texas-walkout/",
    "timestamp": "2025-08-07T17:21:16Z"
  },
  {
    "title": "Poilievre calls on Carney to get 'shovels in the ground' on two pipelines by next March",
    "description": "Pierre Poilievre is calling on Mark Carney to get \"shovels in the ground\" on at least two pipelines within one year of him assuming office.",
    "link": "https://nationalpost.com/news/politics/poilievre-calls-on-carney-to-get-shovels-in-the-ground-on-two-pipelines-by-next-march",
    "timestamp": "2025-08-07T17:21:16Z"
  },
  {
    "title": "David Ellison, Jeff Shell & Paramount Team Queried On Trump, Tech, Possible Layoffs, Cable, Late Night & More At Debut Press Conference",
    "description": "Arrayed casually on a line of stools on a low stage at Paramount Global’s Times Square headquarters, new leadership of post-merger Paramount greeted a few dozen journalists and opened the floor, immediately bombarded with questions about Donald Trump’s PSAs (…",
    "link": "http://deadline.com/2025/08/david-ellison-paramount-team-press-conference-1236481331/",
    "timestamp": "2025-08-07T17:20:59Z"
  },
  {
    "title": "CIA Deep Staters Reportedly Tried To Stop Tulsi Gabbard From Revealing Truth About Russiagate",
    "description": "'John Brennan and James Clapper, as leaders in the intelligence community, they have their own disciples'",
    "link": "https://dailycaller.com/2025/08/07/cia-deep-staters-tulsi-gabbard-russiagate-report/",
    "timestamp": "2025-08-07T17:20:59Z"
  },
  {
    "title": "Mounjaro and Zepbound fuel strong Q2 growth for Eli Lilly",
    "description": "Eli Lilly reported $15.56bn in revenue, driven by its weight loss and diabetes drugs, intensifying pressure on rival Novo Nordisk.",
    "link": "https://www.pharmaceutical-technology.com/news/mounjaro-and-zepbound-fuel-strong-q2-growth-for-eli-lilly/",
    "timestamp": "2025-08-07T17:20:42Z"
  },
  {
    "title": "James Carville Takes Down Epstein Episode After Letter From Melania Trump’s Attorney",
    "description": "James Carville announced that his team had deleted a video referencing alleged ties between Jeffrey Epstein, Donald Trump and Melania Trump.",
    "link": "https://dailycaller.com/2025/08/07/james-carville-removes-episode-about-epstein-after-melania-trump-attorney-sends-letter/",
    "timestamp": "2025-08-07T17:20:02Z"
  },
  {
    "title": "South Africa optimistic of deal with U.S. as tariff deadline nears",
    "description": "JOHANNESBURG, Aug. 7 (Xinhua) -- Following a recent telephone call between South African President Cyril Ramaphosa and U.S. President Donald Trump, South African Minister in the Presidency Khumbudzo Ntshavheni on Thursday expressed hope for an agreement betwe…",
    "link": "https://www.thestar.com.my/news/world/2025/08/08/south-africa-optimistic-of-deal-with-us-as-tariff-deadline-nears",
    "timestamp": "2025-08-07T17:20:00Z"
  },
  {
    "title": "Sounds Like Diddy Is Already Planning His Comeback",
    "description": "A month after Sean “Diddy” Combs received a mixed verdict, his lead attorney, Marc Agnifilo, suggested on CBS that his client’s comeback is already on track.",
    "link": "http://www.thecut.com/article/diddy-lawyer-comeback-madison-square-garden.html",
    "timestamp": "2025-08-07T17:18:22Z"
  },
  {
    "title": "Trump again seeks to omit undocumented immigrants from the census, contrary to the Constitution",
    "description": "President Donald Trump said Thursday that he has instructed the Commerce Department to start a new U.S. census that will be \"based on modern day facts and figures\" and won't include undocumented immigrants.\"I have instructed our Department of Commerce to imme…",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-seeks-omit-undocumented-immigrants-census-contrary-constitution-rcna223649",
    "timestamp": "2025-08-07T17:16:57Z"
  },
  {
    "title": "India must rethink self-reliance strategy amid global shifts",
    "description": "As global powers, especially the US, turn inward with protectionist policies, India finds itself under greater tariff pressure—facing a higher average US tariff than even China. While self-reliance has long shaped India’s economic thinking, the current scenar…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/india-must-rethink-self-reliance-strategy-amid-global-shifts/articleshow/123171346.cms",
    "timestamp": "2025-08-07T17:16:48Z"
  },
  {
    "title": "Trump to sign executive order punishing financial institutions for 'debanking': Report",
    "description": "President Trump is set to sign an executive order on Thursday penalizing financial institutions that engaged in 'debanking,' which reportedly affected crypto companies.",
    "link": "https://cointelegraph.com/news/trump-sign-eo-financial-institutions-debanking-report",
    "timestamp": "2025-08-07T17:16:06Z"
  },
  {
    "title": "Trump-Putin summit boosts global stocks amid hopes of Ukraine ceasefire",
    "description": "Dublin’s Iseq moves 1% higher as banks and food stocks gain momentum",
    "link": "https://www.irishtimes.com/business/2025/08/07/trump-putin-summit-boosts-global-stocks-amid-hopes-of-ukraine-ceasefire/",
    "timestamp": "2025-08-07T17:15:43Z"
  },
  {
    "title": "Writing a Defense Strategy That Sticks",
    "description": "Defense strategy language is important both in terms of the specific words chosen, and how they are used. As the Pentagon gears up to develop its defense strategy, it should focus on clear, specific priorities and SMART objectives, ensuring guidance is action…",
    "link": "https://www.rand.org/pubs/commentary/2025/08/writing-a-defense-strategy-that-sticks.html",
    "timestamp": "2025-08-07T17:15:00Z"
  },
  {
    "title": "GOP Woman Running for Office Said She Didn't Know If She'd Vote for a Woman",
    "description": "\"I don't know if I would vote for any female,\" said Mylie Biggs, daughter of Republican Representative Andy Biggs, in a podcast interview last year.",
    "link": "https://www.newsweek.com/mylie-biggs-gop-running-office-vote-women-2110249",
    "timestamp": "2025-08-07T17:14:55Z"
  },
  {
    "title": "Trump's approval rating still negative while the public sours further on Democrats, CNBC survey shows",
    "description": "Trump's overall and economic ratings remain negative despite a slight improvement in the CNBC All-America Economic Survey.",
    "link": "https://www.cnbc.com/2025/08/07/trumps-approval-rating-still-negative-while-the-public-sours-further-on-democrats-cnbc-survey-shows.html",
    "timestamp": "2025-08-07T17:14:19Z"
  },
  {
    "title": "AIPAC slams Trump ally Marjorie Taylor Greene over Gaza genocide remark",
    "description": "Pro-Israel lobby group says the Republican congresswoman’s criticism of Israel is ‘a betrayal of American values’.",
    "link": "https://www.aljazeera.com/news/2025/8/7/aipac-slams-trump-ally-marjorie-taylor-greene-over-gaza-genocide-remark",
    "timestamp": "2025-08-07T17:13:39Z"
  },
  {
    "title": "Fans Point Out The Irony In Former Superman Actor Dean Cain Joining ICE",
    "description": "“This country was built on patriots stepping up, whether it was popular or not, and doing the right thing,\" the actor said to justify his decision.",
    "link": "https://www.huffpost.com/entry/dean-cain-superman-ice_n_6894c6c5e4b0da3ab57f59d9",
    "timestamp": "2025-08-07T17:13:33Z"
  },
  {
    "title": "How India ended up facing steep US tariffs despite its strategic partnership",
    "description": "The combined tariffs imposed by the U.S. on its ally is 50%.",
    "link": "https://www.bostonherald.com/2025/08/07/india-us-tariffs-explained/",
    "timestamp": "2025-08-07T17:12:12Z"
  },
  {
    "title": "EXCLUSIVE: Mike Collins Takes Early Lead In Georgia Senate Showdown — But Plurality Of Voters Are Undecided",
    "description": "Republican Georgia Rep. Mike Collins is taking an early lead in the Georgia Republican Senate primary contest, according to recent polling. Collins, a two-term lawmaker, leads a hypothetical field with 27% of Republican midterm voters — followed by Republican…",
    "link": "https://dailycaller.com/2025/08/07/mike-collins-georgia-senate-poll/",
    "timestamp": "2025-08-07T17:12:10Z"
  },
  {
    "title": "Thailand and Cambodia to deploy ceasefire monitors despite deadlock over captured soldiers",
    "description": "The ceasefire followed a land mine explosion that wounded five Thai soldiers.",
    "link": "https://www.bostonherald.com/2025/08/07/thailand-cambodia-ceasefire-monitors/",
    "timestamp": "2025-08-07T17:10:27Z"
  },
  {
    "title": "Trump actually is 'canceling' the 2026 midterms, starting in Texas (Will Bunch/The Philadelphia Inquirer)",
    "description": "Will Bunch / The Philadelphia Inquirer:\nTrump actually is ‘canceling’ the 2026 midterms, starting in Texas  —  The irony was almost unbearable when reporters in the Oval Office asked Donald Trump what he thought about a proposal to use the FBI to round up Tex…",
    "link": "https://www.memeorandum.com/250807/p79",
    "timestamp": "2025-08-07T17:10:01Z"
  },
  {
    "title": "Chinese ICE Detainee Dies by Suicide at Pennsylvania Detention Center",
    "description": "The death, the first in the Northeast in ICE custody this year, came at the largest immigration jail in the region.\nThe post Chinese ICE Detainee Dies by Suicide at Pennsylvania Detention Center appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/08/07/ice-detained-suicide-pennsylvania-geo-group/",
    "timestamp": "2025-08-07T17:09:45Z"
  },
  {
    "title": "Spain is passing on the F-35, looking instead at European fighters as anxiety over Trump has had US allies rethinking the jet",
    "description": "Spain said it would not go with the US-made F-35 and would instead look at options like Europe's Eurofighter and FCAS.",
    "link": "https://www.businessinsider.com/spain-rejects-f-35-for-european-alternative-continent-anxious-us-2025-8",
    "timestamp": "2025-08-07T17:09:25Z"
  },
  {
    "title": "Trump calls on Intel CEO to resign",
    "description": "Trump claimed without evidence that the CEO of Intel is \"highly CONFLICTED.\"",
    "link": "https://abcnews.go.com/Business/trump-calls-intel-ceo-resign/story?id=124452763",
    "timestamp": "2025-08-07T17:07:41Z"
  },
  {
    "title": "Will President Trump Pardon Diddy After Partial Conviction? What to Know",
    "description": "Before Sean “Diddy” Combs’ trial had even ended, observers began speculating about whether President Donald Trump would pardon him. The chatter increased in the spring after the president pardoned reality stars Todd and Julie Chrisley, who were convicted of b…",
    "link": "https://www.usmagazine.com/celebrity-news/news/will-donald-trump-pardon-diddy-after-conviction-what-to-know/#article",
    "timestamp": "2025-08-07T17:06:28Z"
  },
  {
    "title": "Toyota expects to lose billions as Trump tariffs weigh on auto sector",
    "description": "The world’s top-selling carmaker joins a growing list of companies reporting profit hits because of US tariffs.",
    "link": "https://www.aljazeera.com/economy/2025/8/7/toyota-expects-to-lose-billions-as-trump-tariffs-weigh-on-auto-sector",
    "timestamp": "2025-08-07T17:05:40Z"
  },
  {
    "title": "Russian drones test NATO's Article 5 defense guarantee ahead of Friday sanctions deadline",
    "description": "NATO faces growing hybrid warfare threats as Russian drone incursions into Lithuania and strikes near Romania's border raise questions about alliance unity and response.",
    "link": "https://www.foxnews.com/politics/russian-drones-test-natos-article-5-defense-guarantee-ahead-friday-sanctions-deadline",
    "timestamp": "2025-08-07T17:04:14Z"
  },
  {
    "title": "How Elizabeth Warren triggered Donald Trump",
    "description": "After a rough July jobs report, Trump promptly fired the head of the Bureau of Labor Statistics, claiming without evidence that the data was “rigged” to hurt him.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/elizabeth-warren-donald-trump-economy-jobs-inflation-rcna223000",
    "timestamp": "2025-08-07T17:03:59Z"
  },
  {
    "title": "Rep. Nancy Mace says she'll 'debate anyone' at a town hall where opponents were asked to leave",
    "description": "Rep. Nancy Mace, a Republican candidate for South Carolina governor, said she’ll “debate anyone” at a townhall where dissenters were asked to leave.",
    "link": "https://www.nbcnews.com/politics/2026-election/rep-nancy-mace-says-debate-anyone-town-hall-opponents-asked-leave-rcna223496",
    "timestamp": "2025-08-07T17:03:34Z"
  },
  {
    "title": "David Ellison Says Skydance Was ‘Not Involved’ in Trump-Paramount Settlement, Deflects When Asked About PSAs",
    "description": "“We are not going to politicize anything today,\" the new Paramount CEO says\nThe post David Ellison Says Skydance Was ‘Not Involved’ in Trump-Paramount Settlement, Deflects When Asked About PSAs appeared first on TheWrap.",
    "link": "https://www.thewrap.com/david-ellison-skydance-not-involved-trump-paramount-settlement-psas/",
    "timestamp": "2025-08-07T17:03:17Z"
  },
  {
    "title": "Reporter Confronts Trump on Vaccine Bombshell in Oval Office — Gets Head-Scratching Response",
    "description": "Trump delivered a head-scratching response when a reporter confronted him in the Oval Office about the bombshell news that HHS is torpedoing vaccine research.\nThe post Reporter Confronts Trump on Vaccine Bombshell in Oval Office — Gets Head-Scratching Respons…",
    "link": "https://www.mediaite.com/media/weird/reporter-confronts-trump-on-vaccine-bombshell-in-oval-office-gets-head-scratching-response/",
    "timestamp": "2025-08-07T17:03:13Z"
  },
  {
    "title": "MAGA Rep Shares Bizarre AI Sydney Sweeney–esque Ad",
    "description": "Unlike Sydney Sweeney, MAGA Representative Mike Collins of Georgia needed AI to generate his great jeans. Collins shared a cringey AI-generated video on X Wednesday, as a nod to the controversial American Eagle denim campaign that is being fiercely defended b…",
    "link": "https://newrepublic.com/post/198903/maga-representative-mike-collins-ai-sydney-sweeney-ad",
    "timestamp": "2025-08-07T17:02:28Z"
  },
  {
    "title": "Trump meeting Putin only if he also meets Zelensky",
    "description": "US President Donald Trump will only meet with Russian President Vladimir Putin if the latter also agrees to meet with Ukrainian President Volodymyr Zelensky to negotiate an end to the war in Ukraine, ...",
    "link": "https://biztoc.com/x/68275577865438bf",
    "timestamp": "2025-08-07T17:01:45Z"
  },
  {
    "title": "Donald Trump’s Six Biggest Wins at 200 Days in Office",
    "description": "President Donald Trump has racked up myriad wins thus far in his administration, with Thursday marking the 200th day since he was once again sworn in as president of the United States. \nThe post Donald Trump’s Six Biggest Wins at 200 Days in Office appeared f…",
    "link": "https://www.breitbart.com/politics/2025/08/07/donald-trumps-six-biggest-wins-200-days-office/",
    "timestamp": "2025-08-07T17:01:44Z"
  },
  {
    "title": "Energy Fuels (UUUU) Starts Rare Earth Production at White Mesa Mill Project",
    "description": "Energy Fuels Inc. (NYSE:UUUU) is one of the best rare earth stocks to buy now. On July 17, the company announced it had started producing rare earth element ...",
    "link": "https://finance.yahoo.com/news/energy-fuels-uuuu-starts-rare-170130643.html",
    "timestamp": "2025-08-07T17:01:30Z"
  },
  {
    "title": "Israel does not want to occupy or annex Gaza: PM Netanyahu",
    "description": "Israeli Prime Minister Benjamin Netanyahu stated Israel's aim is to destroy Hamas, secure the release of hostages, and transition Gaza to a temporary government, not to occupy or annex it. He emphasized Israel's intention to maintain security control post-war…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israel-does-not-want-to-occupy-or-annex-gaza-pm-netanyahu/articleshow/123171039.cms",
    "timestamp": "2025-08-07T17:01:20Z"
  },
  {
    "title": "Who is Anita Dunn? The Biden confidante who clashed with Hunter grilled in House autopen probe",
    "description": "Anita Dunn is a longtime Democratic operative who is appearing before the House Oversight Committee on Thursday.",
    "link": "https://www.foxnews.com/politics/who-anita-dunn-biden-confidante-who-clashed-hunter-grilled-house-autopen-probe",
    "timestamp": "2025-08-07T17:00:50Z"
  },
  {
    "title": "Former ‘Superman’ Actor Dean Cain Says He’s Joining ICE: “This Is the Right Thing”",
    "description": "\"I've spoken with some officials over at ICE, and I will be sworn in as an ICE agent, ASAP,\" the actor says.Dean Cain says he’s going to be “sworn in as an ICE agent, ASAP.” The actor, who starred as Clark Kent/Superman in the 1990s TV series Lois & Clark: Th…",
    "link": "https://freerepublic.com/focus/f-news/4333249/posts",
    "timestamp": "2025-08-07T17:00:38Z"
  },
  {
    "title": "Howard Stern Show May be Next Media Dinosaur to Fall",
    "description": "\"Sirius and Stern are never going to meet on the money he is going to want. It's no longer worth the investment.\"\nThe post Howard Stern Show May be Next Media Dinosaur to Fall first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/howard-stern-show-may-be-next-media-dinosaur-to-fall/",
    "timestamp": "2025-08-07T17:00:07Z"
  },
  {
    "title": "Trump Calls For New Census To Exclude Undocumented Immigrants",
    "description": "The president's attempt to inject his politics into a head count that determines political power has been called a “half-baked idea” by one expert.",
    "link": "https://www.huffpost.com/entry/trump-census_n_6894d2a3e4b067651d492995",
    "timestamp": "2025-08-07T16:59:46Z"
  }
]