[
  {
    "title": "Jon Stewart rocks Asbury Park after Trump takedown, Daily Show",
    "description": "Jon Stewart's band, Church and State TM, played Georgies Bar in Asbury Park on April 28.",
    "link": "https://www.app.com/story/entertainment/music/2025/04/29/jon-stewart-asbury-park-donald-trump-daily-show/83351988007/",
    "timestamp": "2025-04-29T21:16:53Z"
  },
  {
    "title": "House GOP wants to pump billions into Trump's deportations and detentions as part of tax bill",
    "description": "Republicans in Congress are working to pump billions of dollars into President Donald Trump’s mass deportation and border security program.",
    "link": "https://www.news4jax.com/news/politics/2025/04/29/house-gop-wants-to-pump-billions-into-trumps-deportations-and-detentions-as-part-of-tax-bill/",
    "timestamp": "2025-04-29T21:16:52Z"
  },
  {
    "title": "Donald Trump's Approval Rating With Republican College Students Plummets",
    "description": "Thirty percent of College Republicans say they now support Trump less than in January, a Newsweek/CollegePulse poll found.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-college-students-plummets-2065728",
    "timestamp": "2025-04-29T21:15:08Z"
  },
  {
    "title": "What Time Is Trump on TV Tonight? How To Watch ‘President Trump The First 100 Days’",
    "description": "The primetime special comes just as President Trump received the lowest 100-day approval rating of any president in the last 80 years",
    "link": "https://decider.com/2025/04/29/president-trump-first-100-days-abc-hulu/",
    "timestamp": "2025-04-29T21:15:00Z"
  },
  {
    "title": "Trump Leaves Washington for 100 Days Rally in Michigan",
    "description": "President Donald Trump is holding a rally in Michigan on Tuesday to mark the first 100 days of his second term, staging his largest political event since returning to the White House in a state that has been especially rocked by his steep trade tariffs and co…",
    "link": "https://biztoc.com/x/c1c5aa69e96a3288",
    "timestamp": "2025-04-29T21:14:58Z"
  },
  {
    "title": "First Accuser Takes The Witness Stand At Harvey Weinstein’s #MeToo Retrial",
    "description": "The first of three women expected to testify at Harvey Weinstein’s rape retrial told jurors she refused Weinstein's advances when they met to discuss potential jobs.",
    "link": "https://www.huffpost.com/entry/ap-us-sexual-misconduct-weinstein_n_68113d07e4b00bb8ae4b9a48",
    "timestamp": "2025-04-29T21:14:12Z"
  },
  {
    "title": "The pointy end: Inflation data, renters and One Nation’s chances",
    "description": "New RBA inflation data will be one of the last big bits of news before Australia votes on Saturday, and One Nation's chances are getting a lot of last-minute attention.\nThe post The pointy end: Inflation data, renters and One Nation’s chances appeared first o…",
    "link": "http://www.crikey.com.au/2025/04/30/2025-federal-election-inflation-renters-one-nation/",
    "timestamp": "2025-04-29T21:14:11Z"
  },
  {
    "title": "John Bolton Tells CNN Pete Hegseth Should ‘Resign For His Own Safety’s Sake’",
    "description": "John Bolton has long faced threats from foreign countries, including a recent plot against him by Iran.\nThe post John Bolton Tells CNN Pete Hegseth Should ‘Resign For His Own Safety’s Sake’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/john-bolton-tells-cnn-pete-hegseth-should-resign-for-his-own-safetys-sake/",
    "timestamp": "2025-04-29T21:14:09Z"
  },
  {
    "title": "Trump Catches Whitmer off Guard Again by Inviting Her on Stage: ‘I Hadn’t Planned to Speak’",
    "description": "President Donald Trump once again caught Michigan Governor Gretchen Whitmer off guard at an event – this time by inviting her to speak on stage.\nThe post Trump Catches Whitmer off Guard Again by Inviting Her on Stage: ‘I Hadn’t Planned to Speak’ first appeare…",
    "link": "https://www.mediaite.com/tv/trump-catches-whitmer-off-guard-again-by-inviting-her-on-stage-i-hadnt-planned-to-speak/",
    "timestamp": "2025-04-29T21:12:46Z"
  },
  {
    "title": "House GOP wants to pump billions into Trump’s deportations and detentions as part of tax bill",
    "description": "The U.S. under the legislation would impose a $1,000 fee on migrants seeking asylum — something the nation has never done.",
    "link": "https://www.bostonherald.com/2025/04/29/house-gop-tax-bill/",
    "timestamp": "2025-04-29T21:12:40Z"
  },
  {
    "title": "No Talk, but Some Action on U.S.-China Tariffs",
    "description": "Beijing refutes Trump’s claims about ongoing trade negotiations between the two countries.",
    "link": "http://foreignpolicy.com/2025/04/29/china-tariff-trade-economy-trump-united-states-negotiations/",
    "timestamp": "2025-04-29T21:11:33Z"
  },
  {
    "title": "AmeriCorps cuts prompt Colorado and other Democratic-led states to sue Trump administration",
    "description": "In Colorado, Gov. Jared Polis said in a statement, AmeriCorps members help support wildfire mitigation, students in schools and expanded mental health access.",
    "link": "https://www.denverpost.com/2025/04/29/americorps-cuts-colorado-lawsuit-trump/",
    "timestamp": "2025-04-29T21:11:24Z"
  },
  {
    "title": "Think Trump’s Unpopular Now? Just Wait.",
    "description": "Just over a month ago, President Donald Trump was more popular than he was at any point in his first term. This was especially troubling because his administration was proving to be even more incompetent, corrupt, and authoritarian this time around. He was bu…",
    "link": "https://newrepublic.com/article/194577/trump-unpopular-100-days-approval-ratings-falling",
    "timestamp": "2025-04-29T21:09:37Z"
  },
  {
    "title": "Bitcoin Mixer Founders May Get Reprieve as DOJ Weighs Dropping Case",
    "description": "Will U.S. authorities continue pressing ahead with the controversial coin mixing case?",
    "link": "https://decrypt.co/316925/bitcoin-mixer-founders-may-get-reprieve-as-doj-weighs-dropping-case",
    "timestamp": "2025-04-29T21:08:33Z"
  },
  {
    "title": "Former White House Photographer Pete Souza Says Trump Photostream a ‘Reality TV Show’",
    "description": "Pete Souza, former Chief Official White House Photographer for Presidents Ronald Reagan and Barack Obama, describes President Trump's presidential photo stream as \"an Oval Office reality show\" in a new article on Vanity Fair.\n[Read More]",
    "link": "https://petapixel.com/2025/04/29/former-white-house-photographer-pete-souza-says-trump-photostream-a-reality-tv-show/",
    "timestamp": "2025-04-29T21:08:04Z"
  },
  {
    "title": "We’re about to glimpse the future of all conservative parties",
    "description": "The upcoming Australian election will illustrate how most Western elections will play out in the near future Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616499-conservative-parties-future-australia/",
    "timestamp": "2025-04-29T21:07:55Z"
  },
  {
    "title": "Russia and US were on brink of WWIII – Oliver Stone",
    "description": "Russia and the US came close to nuclear war during the three years of the Ukraine conflict, Oliver Stone has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616519-brink-wwiii-oliver-stone/",
    "timestamp": "2025-04-29T21:07:50Z"
  },
  {
    "title": "WATCH: Piers Morgan tells Dem candidate he’d take her ‘a lot more seriously’ if she acknowledged recent Trump success",
    "description": "'No one can even bring it upon themselves to give him credit for an obvious win for America'",
    "link": "https://www.wnd.com/2025/04/watch-piers-morgan-tells-dem-candidate-hed-take-her-a-lot-more-seriously-if-she-acknowledged-recent-trump-success/",
    "timestamp": "2025-04-29T21:07:27Z"
  },
  {
    "title": "Trump Hands Gretchen Whitmer Rare Praise Amid Military Announcement",
    "description": "Trump delivered the news at Selfridge Air National Guard Base, just after landing for a rally celebrating his 100th day in office.",
    "link": "https://www.newsweek.com/trump-hands-gretchen-whitmer-rare-praise-amid-military-announcement-2065869",
    "timestamp": "2025-04-29T21:07:17Z"
  },
  {
    "title": "Elizabeth Warren Marks 100 Days Of Trump By Reading Aloud 100 Reports Of His Corruption",
    "description": "The Massachusetts senator plans to read into the congressional record dozens of cases of Trump using the presidency to benefit himself personally.",
    "link": "https://www.huffpost.com/entry/elizabeth-warren-donald-trump-100-days-corrupt_n_68111f2be4b0cbf3b6c1ddaa",
    "timestamp": "2025-04-29T21:06:57Z"
  },
  {
    "title": "Tribes and environmental groups brace as Trump officials consider scaling back Chuckwalla Monument",
    "description": "The Trump administration is reportedly looking at changing the boundaries of the Southern California monument and others to open up land for mining and oil production.",
    "link": "https://www.kpbs.org/news/environment/2025/04/29/tribes-and-environmental-groups-brace-as-trump-officials-consider-scaling-back-chuckwalla-monument",
    "timestamp": "2025-04-29T21:06:31Z"
  },
  {
    "title": "100 Days, 200 Lawsuits: Donald Trump Completes Turbulent 3 Months In Office",
    "description": "Donald Trump said on Tuesday that he has had &quot;a lot of fun&quot; in his first hundred days in office during his second term as President. However, much of his agenda in these three months have met considerable resistance in court from federal judges.",
    "link": "https://www.ndtv.com/world-news/100-days-200-lawsuits-donald-trump-completes-turbulent-3-months-in-office-8290466",
    "timestamp": "2025-04-29T21:05:27Z"
  },
  {
    "title": "Tariffs Win as Walmart Announces Major Investment in American Products and Small Businesses",
    "description": "PULSE POINTS:❓What Happened: Walmart has announced new programs, including “Grow with US” and the 2025 Open Call, to expand support for American-made products and American small businesses, as President Donald J. Trump pursues a policy of supporting American …",
    "link": "https://freerepublic.com/focus/f-news/4314051/posts",
    "timestamp": "2025-04-29T21:04:55Z"
  },
  {
    "title": "Trump Is Repeating Biden's AI Mistakes",
    "description": "President Donald Trump pledged to remove \"barriers to American leadership in artificial intelligence\" in a January executive order by reversing the Biden administration's precautionary approach to AI. Despite this order, the Trump administration is repeating …",
    "link": "https://biztoc.com/x/6e233a06ebd40e50",
    "timestamp": "2025-04-29T21:03:56Z"
  },
  {
    "title": "‘Tearing down’: What drives Trump’s foreign policy?",
    "description": "Motivated by grievances against allies and foes, US president is 'tearing down' the modern global order, analysts say.",
    "link": "https://www.aljazeera.com/news/2025/4/29/tearing-down-what-drives-trumps-foreign-policy",
    "timestamp": "2025-04-29T21:03:53Z"
  },
  {
    "title": "Take It Down Act, addressing nonconsensual deepfakes and ‘revenge porn,’ passes. What is it?",
    "description": "Congress approved legislation to enact stricter penalties for distribution of non-consensual intimate imagery.",
    "link": "https://www.bostonherald.com/2025/04/29/take-it-down-act-deepfakes-revenge-porn/",
    "timestamp": "2025-04-29T21:03:43Z"
  },
  {
    "title": "Report: State Department Revokes 4K Foreign Students’ Visas in First 100 Days of Trump’s Second Term, Most with Criminal Records",
    "description": "In the first 100 days of President Donald Trump's second term, the State Department revoked the visas of 4,000 foreign students, 90 percent of whom have criminal records.\nThe post Report: State Department Revokes 4K Foreign Students’ Visas in First 100 Days o…",
    "link": "https://www.breitbart.com/pre-viral/2025/04/29/report-state-department-revokes-4k-foreign-students-visas-in-first-100-days-of-trumps-second-term-most-with-criminal-records/",
    "timestamp": "2025-04-29T21:02:58Z"
  },
  {
    "title": "Former Social Security head calls out Trump's 'big lies' about fraud, waste and abuse",
    "description": "Former Social Security Commissioner Martin O’Malley is touring the country to push back against what he calls the Trump administration’s “big lies” and misinformation undermining the earned benefits program.",
    "link": "https://www.msnbc.com/top-stories/latest/martin-omalley-musk-social-security-trump-newsletter-rcna203567",
    "timestamp": "2025-04-29T21:01:28Z"
  },
  {
    "title": "Prime Minister Carney speaks with President of the United States Donald J. Trump (Prime Minister of Canada)",
    "description": "Prime Minister of Canada:\nPrime Minister Carney speaks with President of the United States Donald J. Trump  — Prime Minister Carney speaks with President of the United States Donald J. Trump  —  Today, the Prime Minister, Mark Carney, spoke with the President…",
    "link": "https://www.memeorandum.com/250429/p119",
    "timestamp": "2025-04-29T21:00:31Z"
  },
  {
    "title": "Save the Dates: Wild Cards Finale Delayed, Las Culturistas Culture Awards on Bravo and More",
    "description": "Wild Cards is shifting its Season 2 finale. The episode, which was originally slated for this week, will now air next Wednesday, May 7 at 8/7c on The CW. As a result, Sullivan’s Crossing Season 3 will now premiere Wednesday, May 14 at 8 pm. In lieu of Wild Ca…",
    "link": "https://tvline.com/news/wild-cards-season-2-finale-air-date-delayed-the-cw-1235441100/",
    "timestamp": "2025-04-29T21:00:19Z"
  },
  {
    "title": "The Trump administration’s push to privatize US public lands",
    "description": "In its first 100 days, Trump 2.0 has waged war on the lands, waters, and wildlife we all own.",
    "link": "http://grist.org/climate/the-trump-administrations-push-to-privatize-us-public-lands/",
    "timestamp": "2025-04-29T21:00:15Z"
  },
  {
    "title": "Vitol Steps Up Venezuela Oil Buying Before USA License Lapses",
    "description": "Vitol is set to load at least 2.5 million barrels of Venezuelan oil this month, according to documents seen by Bloomberg.",
    "link": "https://www.rigzone.com/news/wire/vitol_steps_up_venezuela_oil_buying_before_usa_license_lapses-29-apr-2025-180376-article/",
    "timestamp": "2025-04-29T21:00:01Z"
  },
  {
    "title": "Trump's Kennedy Center Canceling Pride Events Has Left LGBTQQIAAP2S+ Groups in Mourning",
    "description": "A series of gay pride concerts and stage events have been canceled at the John F. Kennedy Center for the Performing Arts in Washington D.C.\nThe post Trump’s Kennedy Center Canceling Pride Events Has Left LGBTQQIAAP2S+ Groups in Mourning appeared first on Brei…",
    "link": "https://www.breitbart.com/entertainment/2025/04/29/trumps-kennedy-center-canceling-pride-events-has-left-lgbtqqiaap2s-groups-in-mourning/",
    "timestamp": "2025-04-29T21:00:00Z"
  },
  {
    "title": "Inside Economics: Why the Kiwi is so strong against the Aussie dollar, the big Budget squeeze ... and asset recycling",
    "description": "OPINION: Liam Dann takes a deep dive into the week's economic news.",
    "link": "https://www.nzherald.co.nz/business/economy/inside-economics-why-the-kiwi-is-so-strong-against-the-aussie-dollar-the-big-budget-squeezeand-asset-recycling/BVICMPUV75CWNA6LZXAS7RJ3XI/",
    "timestamp": "2025-04-29T21:00:00Z"
  },
  {
    "title": "Trump’s stunning first 100 days: The highs, the lows and the road ahead",
    "description": "When Donald Trump headed back to the White House on Jan. 20, most folks knew him fairly well.",
    "link": "https://nypost.com/2025/04/29/opinion/trumps-stunning-first-100-days-the-highs-the-lows-and-the-road-ahead/",
    "timestamp": "2025-04-29T20:57:51Z"
  },
  {
    "title": "Trump announces new 'serious power' fighter jets for Michigan Guard base to replace aging A-10s",
    "description": "Trump shared details of the new fighter jet mission during a speech to National Guardsmen at the Michigan base for an event commemorating his 100th day in office.",
    "link": "https://www.foxnews.com/politics/trump-announces-new-serious-power-fighter-jets-michigan-guard-base-replace-aging-a-10s",
    "timestamp": "2025-04-29T20:57:40Z"
  },
  {
    "title": "Harvard antisemitism and Islamophobia task forces find widespread fear, bigotry",
    "description": "The reports were the result of two task forces set up in January 2024, once on combating antisemitism and anti-Israel bias, and other on combating anti-Arab bias.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-852030",
    "timestamp": "2025-04-29T20:57:24Z"
  },
  {
    "title": "Justice Department Introduces “America First Antitrust” Policy",
    "description": "New Justice Department Antitrust Chief introduces \"America First Antitrust Policy,\" featuring (1) individual liberty, (2) the rule of law, and (3) regulatory reform.",
    "link": "https://www.forbes.com/sites/aldenabbott/2025/04/29/justice-department-introduces-america-first-antitrust-policy/",
    "timestamp": "2025-04-29T20:56:38Z"
  },
  {
    "title": "House GOP wants to pump billions into Trump's deportations and detentions as part of tax bill",
    "description": "As part of their big tax bill, Republicans in Congress are pumping billions of dollars into President Donald Trump's mass deportation and border security...",
    "link": "https://www.yahoo.com/news/house-gop-wants-pump-billions-205615197.html",
    "timestamp": "2025-04-29T20:56:15Z"
  },
  {
    "title": "Gov. Hochul says NY budget will create $50M rental aid program championed by tenant groups",
    "description": "Gov. Kathy Hochul announces the budget on April 28.\n \n\nTenant activists and landlords alike had pushed for the program for years. Hochul ultimately agreed to about a fifth of the funding its legislative sponsors originally sought [ more › ]",
    "link": "https://gothamist.com/news/gov-hochul-says-ny-budget-will-create-50m-rental-aid-program-championed-by-tenant-groups",
    "timestamp": "2025-04-29T20:56:00Z"
  },
  {
    "title": "Mark Carney won: Here are the key economic priorities for his new government",
    "description": "In the face of U.S. tariffs, the new Canadian government should take prudent, urgent and bold steps to strengthen the nation’s economy.",
    "link": "https://theconversation.com/mark-carney-won-here-are-the-key-economic-priorities-for-his-new-government-255477",
    "timestamp": "2025-04-29T20:55:50Z"
  },
  {
    "title": "Trump Is Repeating Biden's AI Mistakes",
    "description": "President Donald Trump pledged to remove \"barriers to American leadership in artificial intelligence\" in a January executive order by reversing the Biden",
    "link": "https://reason.com/2025/04/29/trump-is-repeating-bidens-ai-mistakes/",
    "timestamp": "2025-04-29T20:55:07Z"
  },
  {
    "title": "A 'p*ssed' Trump called Jeff Bezos after learning Amazon considered breaking out a tariff charge (CNN)",
    "description": "CNN:\nA ‘p*ssed’ Trump called Jeff Bezos after learning Amazon considered breaking out a tariff charge  —  New York CNN —  The White House took aggressive aim at Amazon, with President Donald Trump putting in a call to Amazon founder Jeff Bezos Tuesday morning…",
    "link": "https://www.memeorandum.com/250429/p118",
    "timestamp": "2025-04-29T20:55:00Z"
  },
  {
    "title": "Arizona legislature pushes for a state bitcoin reserve",
    "description": "The Arizona state legislature approved a pair of bills on Monday that could pave the way for the creation of the country’s first-ever state Bitcoin reserve.",
    "link": "https://www.nbcnews.com/politics/economics/arizona-legislature-pushes-state-bitcoin-reserve-rcna203612",
    "timestamp": "2025-04-29T20:53:43Z"
  },
  {
    "title": "Major brands pulling back from LGBTQ parades – WSJ",
    "description": "Companies have reportedly scaled down NYC Pride sponsorships over political pressure and economic concerns Read Full Article at RT.com",
    "link": "https://www.rt.com/business/616517-lgbtq-companies-cut-sponsorship/",
    "timestamp": "2025-04-29T20:53:37Z"
  },
  {
    "title": "Trump Applauds Bezos After Amazon Refutes Claim It Planned To Display Tariff Costs",
    "description": "Topline\nThe White House took aim at Amazon on Tuesday after the e-commerce giant reportedly prepared to directly display to consumers the price increases associated with President Donald Trump’s tariffs—with Trump calling Amazon founder Jeff Bezos personally …",
    "link": "https://biztoc.com/x/604100d3f6fbbd7a",
    "timestamp": "2025-04-29T20:53:15Z"
  },
  {
    "title": "Trump: Selfridge to play 'vital' role in US defense",
    "description": "United States President Donald Trump underlined on Tuesday that Selfridge will play a \"vital role\" in the country's national defense.\"I am proud to announce that very soon we will replace the retiring...",
    "link": "https://biztoc.com/x/783b56c099f49923",
    "timestamp": "2025-04-29T20:53:01Z"
  },
  {
    "title": "Trump Org to build golf course in Qatar as White House announces official visit to region",
    "description": "Qatari developers Qatari Diar and Dar Global are expected to announce the building of a Trump International Golf Course and Trump Villas in the country, according to a Reuters report\r\n.The move comes as the White House announced President Donald Trump will ma…",
    "link": "https://www.rawstory.com/2671864439/",
    "timestamp": "2025-04-29T20:52:56Z"
  },
  {
    "title": "Trump dismisses Biden nominees to US Holocaust Memorial Council, including Doug Emhoff",
    "description": "Trump has moved to fire many Biden appointees across government — including ostensibly apolitical roles.",
    "link": "https://www.bostonherald.com/2025/04/29/trump-holocaust-museum-board/",
    "timestamp": "2025-04-29T20:52:48Z"
  },
  {
    "title": "House Democratic Leader Hakeem Jeffries Questions Whether Trump is Cognitively ‘Fit’ to Be President",
    "description": "House Minority Leader Hakeem Jeffries believes President Donald Trump's mental fitness should be under the same scrutiny as former President Joe Biden's was.\nThe post House Democratic Leader Hakeem Jeffries Questions Whether Trump is Cognitively ‘Fit’ to Be P…",
    "link": "https://www.mediaite.com/podcasts/house-democratic-leader-hakeem-jeffries-questions-whether-trump-is-cognitively-fit-to-be-president/",
    "timestamp": "2025-04-29T20:52:14Z"
  },
  {
    "title": "Trump Announces New Boeing F-15EX Unit and KC-46 Squadron for Selfridge ANGB",
    "description": "“Very soon we will replace the A-10 with 21 new F-15EX Eagle II fighter jets, the best in world,” President Trump announced during visit to Selfridge ANGB in Michigan. U.S. President Donald Trump has announced that Selfridge Air National Guard Base in Mt. Cle…",
    "link": "https://theaviationist.com/2025/04/29/selfridge-angb-to-get-new-f-15ex-unit/",
    "timestamp": "2025-04-29T20:52:06Z"
  },
  {
    "title": "Mark Carney's Liberals fall short of majority in Canadian election",
    "description": "Canadian Prime Minister Mark Carney's Liberals will form government with a minority, according to Canadian public broadcaster CBC.",
    "link": "https://www.abc.net.au/news/2025-04-30/mark-carneys-liberals-fall-short-of-canada-majority-government/105231990",
    "timestamp": "2025-04-29T20:51:42Z"
  },
  {
    "title": "SEC punts decisions on XRP, DOGE ETFs",
    "description": "The US Securities and Exchange Commission (SEC) has postponed deciding on whether to greenlight two proposed cryptocurrency exchange-traded funds (ETFs) holding Dogecoin and XRP, filings show. The US regulator has delayed its deadline for ruling on the propos…",
    "link": "https://cointelegraph.com/news/sec-punts-decision-on-bitwise-xrp-doge-etfs",
    "timestamp": "2025-04-29T20:51:38Z"
  },
  {
    "title": "Mark Carney’s Liberals Win in Canada on Anti-Trump Platform",
    "description": "The victory over the Conservatives reflects widespread public outrage with the Trump administration’s threats.",
    "link": "http://foreignpolicy.com/2025/04/29/canada-election-mark-carney-trump-liberals-victory-conservatives/",
    "timestamp": "2025-04-29T20:50:32Z"
  },
  {
    "title": "Trump’s first 100 days by the numbers: How he compares to recent presidents",
    "description": "The first 100 days of Donald Trump’s second presidency truly have been the best and worst of times, depending entirely on who is providing the perspective or the metric used.",
    "link": "https://www.bostonherald.com/2025/04/29/trumps-first-100-days-by-the-numbers-how-he-compares-to-recent-presidents/",
    "timestamp": "2025-04-29T20:49:50Z"
  },
  {
    "title": "Canadian Conservative Poilievre to lose seat in parliament in stunning fall",
    "description": "Canadian Conservative Leader Pierre Poilievre is projected to lose the parliamentary seat he has held for more than 20 years in a stunning defeat to Liberal candidate Bruce Fanjoy. The Canadian Broadcasting Corporation (CBC), a state-owned outlet, projected t…",
    "link": "https://freerepublic.com/focus/f-news/4314049/posts",
    "timestamp": "2025-04-29T20:48:49Z"
  },
  {
    "title": "The EPA says it still cares about forever chemicals, but health advocates are wary",
    "description": "The Environmental Protection Agency (EPA) has a new plan to address “forever chemicals” once widely used in non-stick and water-proof products that have since been linked to cancer, reproductive health issues, and liver damage. The vague details the EPA has s…",
    "link": "https://www.theverge.com/news/658244/forever-chemicals-pfas-drinking-water-standards-epa-trump",
    "timestamp": "2025-04-29T20:47:18Z"
  },
  {
    "title": "Republicans Say Medicaid ‘Work Requirements’ Don’t Count As Cuts",
    "description": "Medicaid coverage for unemployed adults is on the line to help pay for President Donald Trump’s tax cut bill.",
    "link": "https://www.huffpost.com/entry/medicaid-work-requirement-republican-bill_n_6811214fe4b0d4c3d8e31c0a",
    "timestamp": "2025-04-29T20:46:13Z"
  },
  {
    "title": "Mark Hamill Apologizes for 'Man-Baby-in-Chief' Trump Trolling Canada After Carney's Liberals Dominate Elections",
    "description": "Disney's \"Star Wars\" star Mark Hamill has amped up his scoffing and scorn of President Donald Trump, this time apologizing to Canada just as that country's election saw Prime Minister Mark Carney’s Liberal Party claim a massive federal election victory on Mon…",
    "link": "https://www.breitbart.com/entertainment/2025/04/29/mark-hamill-apologizes-for-man-baby-in-chief-trump-trolling-canada-after-carneys-liberals-dominate-elections/",
    "timestamp": "2025-04-29T20:45:10Z"
  },
  {
    "title": "US threatens to quit Russia-Ukraine effort unless 'concrete proposals'",
    "description": "WASHINGTON - Secretary of State Marco Rubio warned Tuesday that the United States would end mediation unless Russia and Ukraine come up with \"concrete proposals,\" as US patience wanes on an early priority for President Donald Trump.",
    "link": "https://www.bangkokpost.com/world/3014535/us-threatens-to-quit-russia-ukraine-effort-unless-concrete-proposals",
    "timestamp": "2025-04-29T20:45:00Z"
  },
  {
    "title": "Global Birth Rates Hit Historic Lows As Elon Musk Busy With DOGE",
    "description": "CAMBRIDGE, MA — A group of prominent sociologists sounded an alarm this week, citing new data that indicated global fertility rates had hit historic lows while Elon Musk was busy with DOGE.",
    "link": "https://babylonbee.com/news/global-fertility-rates-hit-historic-lows-as-elon-musk-busy-with-doge",
    "timestamp": "2025-04-29T20:44:55Z"
  },
  {
    "title": "WATCH: Trump doubles down on China tariffs: 'They deserve it'",
    "description": "President Donald Trump told ABC News’ Terry Moran in an exclusive interview that China is “ripping us off like nobody's ever ripped us off.\"",
    "link": "https://abcnews.go.com/Politics/video/trump-doubles-china-tariffs-deserve-121291296",
    "timestamp": "2025-04-29T20:44:28Z"
  },
  {
    "title": "House Democrats jockey behind the scenes to become party's top investigator of Trump administration",
    "description": "Rep. Gerry Connolly's decision to step down from the Oversight Committee could spark a battle between old-guard Democrats and younger progressives.",
    "link": "https://www.nbcnews.com/politics/congress/house-democrats-jockey-partys-top-investigator-trump-administration-rcna203477",
    "timestamp": "2025-04-29T20:43:24Z"
  },
  {
    "title": "Trump softens auto tariffs as US carmakers brace for turmoil",
    "description": "The News\nUS President Donald Trump signed an executive order Tuesday aimed to provide some relief to the country’s beleaguered auto industry.\nThe measure exempts American automakers from stacked duties — so car parts would not also face steel and aluminum tar…",
    "link": "https://biztoc.com/x/97a28c663d5ef5b5",
    "timestamp": "2025-04-29T20:42:24Z"
  },
  {
    "title": "What members of the Trump family have worn to the Met Gala through the years",
    "description": "Ivanka Trump, Donald Trump, and Melania Trump at the Met Gala.\nEvan Agostini/Getty Images\nDonald Trump was a regular guest at the Met Gala beginning in the 1980s.\nMelania Trump wore looks from designers who would go on to dress her as first lady.\nIvanka Trump…",
    "link": "https://biztoc.com/x/d386cfecb42684c6",
    "timestamp": "2025-04-29T20:42:20Z"
  },
  {
    "title": "Trump's First 100 Days In Charts",
    "description": "Trump's First 100 Days In Charts\n \nUpon returning to the White House, President Donald Trump unleashed a wave of executive orders and aggressive policy shifts, making his first 100 days of his second term one of the most impactful starts to a presidency in re…",
    "link": "https://biztoc.com/x/0e8425889d576a95",
    "timestamp": "2025-04-29T20:42:15Z"
  },
  {
    "title": "Trump: Selfridge to play 'vital' role in US national defense",
    "description": "United States President Donald Trump underlined on Tuesday that Selfridge will play a \"vital role\" in the country's national defense.More to come......",
    "link": "https://biztoc.com/x/c2d5c2cc743d2cac",
    "timestamp": "2025-04-29T20:42:11Z"
  },
  {
    "title": "Trump, Carney agree to meet in person in 'near future'",
    "description": "Canadian Prime Minister Mark Carney spoke with United States President Donald Trump on Tuesday, and the two leaders agreed to meet in person in the \"near future,\" Carney's office revealed in a stateme...",
    "link": "https://biztoc.com/x/bc86f3f3519435e3",
    "timestamp": "2025-04-29T20:42:08Z"
  },
  {
    "title": "Michelle Obama blasts Trump's immigration crackdown: 'It keeps me up at night'",
    "description": "Michelle Obama is calling out Trump over his aggressive immigration crackdown and the “fear” she says his policies strike into people of color in America.",
    "link": "https://www.msnbc.com/top-stories/latest/michelle-obama-trump-deportation-fear-rcna203571",
    "timestamp": "2025-04-29T20:41:06Z"
  },
  {
    "title": "Dems Collide As Sen. Brian Schatz Joins Whip Race",
    "description": "Democratic Hawaii Sen. Brian Schatz announced his campaign to succeed retiring Illinois Sen. Dick Durbin to be the the No. 2 Senate Democrat.",
    "link": "https://dailycaller.com/2025/04/29/dems-collide-as-sen-brian-schatz-joins-whip-race/",
    "timestamp": "2025-04-29T20:41:02Z"
  },
  {
    "title": "EU engaging in ‘perversion of history’ – Oliver Stone",
    "description": "Western elites have perverted the lessons of World War II in their “futile” anti-Russian campaign, Oliver Stone has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616510-eu-perversion-history-oliver-stone/",
    "timestamp": "2025-04-29T20:40:22Z"
  },
  {
    "title": "Your questions on tariffs, annexation and immigration after Trump's first 100 days",
    "description": "Here is a selection of those answered by our staff writers and correspondents.",
    "link": "https://www.bbc.com/news/articles/cd02xg8xv8vo",
    "timestamp": "2025-04-29T20:39:57Z"
  },
  {
    "title": "Trump Dismisses Biden Nominees To US Holocaust Memorial Council, Including Doug Emhoff",
    "description": "Trump has dismissed many of Biden’s nominees to the U.S. Holocaust Memorial Council, including Doug Emhoff.",
    "link": "https://www.huffpost.com/entry/trump-holocaust-museum-board-dismiss-emhoff_n_681138b9e4b0e23f577599c8",
    "timestamp": "2025-04-29T20:39:41Z"
  },
  {
    "title": "How Trump’s 100 Days Built Off the Far Right Blueprint of Project 2025",
    "description": "Project 2025 offered a chilling vision of executive power. The agenda Trump is implementing is even more disturbing.",
    "link": "https://truthout.org/articles/how-trumps-100-days-built-off-the-far-right-blueprint-of-project-2025/",
    "timestamp": "2025-04-29T20:37:42Z"
  },
  {
    "title": "Trump Called Bezos After Amazon Reportedly Planned to Display Tariff Costs on Merchandise",
    "description": "A report that Amazon would display price increases due to tariffs on its goods — which the company has since denied — landed CEO Jeff Bezos a phone call from President Donald Trump on Tuesday, Breitbart News can confirm. CNN White House reporter Alayna Treene…",
    "link": "https://freerepublic.com/focus/f-news/4314046/posts",
    "timestamp": "2025-04-29T20:36:50Z"
  },
  {
    "title": "What members of the Trump family have worn to the Met Gala through the years",
    "description": "Donald Trump, Melania Trump, and Ivanka Trump were all fixtures of the Met Gala until their involvement in politics.",
    "link": "https://www.businessinsider.com/donald-melania-ivanka-trump-met-gala",
    "timestamp": "2025-04-29T20:36:38Z"
  },
  {
    "title": "US Threatens To Quit Russia-Ukraine Effort Unless 'Concrete Proposals'",
    "description": "Secretary of State Marco Rubio warned Tuesday that the United States would end mediation unless Russia and Ukraine come up with \"concrete proposals,\" as US patience wanes on an early priority for President Donald Trump.",
    "link": "https://www.ibtimes.com/us-threatens-quit-russia-ukraine-effort-unless-concrete-proposals-3771856",
    "timestamp": "2025-04-29T20:36:06Z"
  },
  {
    "title": "AmeriCorps cuts prompt two dozen states led by Democrats to sue Trump administration",
    "description": "AmeriCorps is the 30-year-old federal agency for volunteer service.",
    "link": "https://www.bostonherald.com/2025/04/29/trump-doge-americorps/",
    "timestamp": "2025-04-29T20:35:44Z"
  },
  {
    "title": "Trump pushes back against economic anxieties in ABC interview",
    "description": "President Trump stood by his controversial trade policies in an exclusive Oval Office interview Tuesday with ABC News' Terry Moran.",
    "link": "https://abcnews.go.com/US/trump-pushes-back-economic-anxieties-abc-interview-china/story?id=121278001",
    "timestamp": "2025-04-29T20:35:42Z"
  },
  {
    "title": "Live: Nationals senator 'can't comment' on whether One Nation is Islamophobic",
    "description": "Nationals senator Bridget Mackenzie has defended the Coalition's decision to accept One Nation preferences. Follow live.",
    "link": "https://www.abc.net.au/news/2025-04-30/federal-election-2025-live-albanese-dutton-campaign/105231912",
    "timestamp": "2025-04-29T20:34:38Z"
  },
  {
    "title": "NPR poll: Many voters give Trump a failing grade",
    "description": "As Donald Trump approaches the 100th day of his second term, most voters are not impressed. Majorities disapprove of his performance on key issues, like immigration and the economy, and almost half give his overall performance an F on an A through F scale. On…",
    "link": "https://www.npr.org/2025/04/29/1247777233/podcast-poll-trump",
    "timestamp": "2025-04-29T20:34:07Z"
  },
  {
    "title": "House Republicans block vote to probe Hegseth’s Signal use | CNN Politics",
    "description": "House Republicans have thwarted Democratic efforts to probe Defense Secretary Pete Hegseth’s controversial use of Signal, using their power to stop the minority party from forcing a vote that could embarrass the Trump administration.",
    "link": "https://www.cnn.com/2025/04/29/politics/house-republicans-rules-block-hegseth-probe/index.html",
    "timestamp": "2025-04-29T20:34:05Z"
  },
  {
    "title": "Mixed status LA couple self-deports, fearing husband's detention",
    "description": "The American wife of Alfredo Linares, who came to the U.S. from Mexico when he was a teen and is undocumented, said she didn't want to risk her husband being sent away.",
    "link": "https://www.nbcnews.com/news/latino/mixed-status-couple-self-deports-mexico-rcna203481",
    "timestamp": "2025-04-29T20:34:01Z"
  },
  {
    "title": "Donald Trump calls Jeff Bezos 'a good guy' after Amazon cancels tariff display '",
    "description": "US President Donald Trump praised Amazon founder Jeff Bezos on April 29 for halting a plan to show consumers how tariffs were increasing product prices. Trump confirmed he personally called Bezos, describing him as “very nice” and “terrific.”",
    "link": "https://www.livemint.com/companies/news/donald-trump-calls-jeff-bezos-a-good-guy-after-amazon-cancels-tariff-display-11745957808961.html",
    "timestamp": "2025-04-29T20:33:48Z"
  },
  {
    "title": "Backbench Democrat Uses Taxpayer Funds To Promote Trump Impeachment Billboards",
    "description": "Democratic Michigan Rep. Shri Thanedar's office is using taxpayer dollars to put up billboards in his district highlighting his effort to impeach the president.",
    "link": "https://dailycaller.com/2025/04/29/thanedar-taxpayer-funds-trump-impeachment-billboards/",
    "timestamp": "2025-04-29T20:33:15Z"
  },
  {
    "title": "Watch Live: Donald Trump Addresses Michigan National Guard",
    "description": "President Donald Trump speaks to members of the Michigan National Guard on Tuesday, April 29.\nThe post Watch Live: Donald Trump Addresses Michigan National Guard appeared first on Breitbart.",
    "link": "https://www.breitbart.com/national-security/2025/04/29/watch-live-donald-trump-addresses-michigan-national-guard/",
    "timestamp": "2025-04-29T20:32:50Z"
  },
  {
    "title": "Chief of major US port shares grim warning about Chinese shipments due to Trump tariffs",
    "description": "Shipments from China to the West Coast are poised to plunge by as much as 35% as President Donald Trump’s newly imposed tariffs prompt major American retailers to slash import orders, the executive director of the Port of Los Angeles said Tuesday.\nGene Seroka…",
    "link": "https://biztoc.com/x/29375308839284f6",
    "timestamp": "2025-04-29T20:31:04Z"
  },
  {
    "title": "DOJ Deportation Memo Pretends The Fourth Amendment Doesn’t Exist",
    "description": "USA Today has secured the DOJ’s official rules of engagement for mass deportations under the Alien Enemies Act. (Better yet, it has shared it with everyone, rather than keep it to itself!) Trump’s resurrection of a law no one thought the Land of the Free woul…",
    "link": "https://www.techdirt.com/2025/04/29/doj-deportation-memo-pretends-the-fourth-amendment-doesnt-exist/",
    "timestamp": "2025-04-29T20:30:24Z"
  },
  {
    "title": "Trump’s First 100 Days: Higher Ed Trying To ‘Rope-a-Dope’ Crackdown On Civil Rights Violations And DEI",
    "description": "\"The DEI Industrial Complex are like survivors clinging to a lifeboat. And their lifeboat right now is the federal judiciary. Their hope is not that they'll defeat the Trump administration ultimately, but they can delay things long enough for a rescue and the…",
    "link": "https://legalinsurrection.com/2025/04/trumps-first-100-days-higher-ed-trying-to-rope-a-dope-crackdown-on-civil-rights-violations-and-dei/",
    "timestamp": "2025-04-29T20:30:21Z"
  },
  {
    "title": "Trump to offer automakers some relief on his 25% tariffs",
    "description": "President Donald Trump was scheduled to sign an executive order Tuesday to relax some of his 25% tariffs on autos and auto parts, the White House said.",
    "link": "https://richmond.com/news/nation-world/business/economy/article_bd87e79c-da5b-5db9-b57d-f1a1f8334975.html",
    "timestamp": "2025-04-29T20:30:00Z"
  },
  {
    "title": "IMF exit would be true dollar shock",
    "description": "The US dollar has suffered its worst start to any year since 1989 as the Trump administration has put forward once unthinkable economic policies, unnerving global investors.",
    "link": "https://www.bangkokpost.com/opinion/opinion/3014347/imf-exit-would-be-true-dollar-shock",
    "timestamp": "2025-04-29T20:30:00Z"
  },
  {
    "title": "Melania-Pushed Bill Overwhelmingly Passes, Now Just Needs President's Signature",
    "description": "First lady Melania Trump has chalked up a major legislative victory as a bill she supported clears the House of Representatives.",
    "link": "https://www.westernjournal.com/melania-pushed-bill-overwhelmingly-passes-now-just-needs-presidents-signature/",
    "timestamp": "2025-04-29T20:29:56Z"
  },
  {
    "title": "Oddity Tech soars 15% after it raises outlook despite tariff threat",
    "description": "Il Makiage owner Oddity Tech saw another quarter of outsized growth, leading it to raise its guidance even as the threat of tariffs swirl.",
    "link": "https://www.cnbc.com/2025/04/29/oddity-tech-odd-earnings-q1-2025.html",
    "timestamp": "2025-04-29T20:28:57Z"
  }
]