[
  {
    "title": "Nvidia just dropped a game-changer — CEO Jensen Huang calls it a miracle for AI supercomputing",
    "description": "Nvidia's CEO Jensen Huang introduced the GB200 Grace Blackwell superchip at VivaTech 2025, calling it a technological miracle. This superchip combines two Blackwell B200 GPUs and a Grace CPU, designed for both training and inference of large language models. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/nvidia-just-dropped-a-game-changer-ceo-jensen-huang-calls-it-a-miracle-for-ai-supercomputing-nvidia-latest-news/articleshow/122255975.cms",
    "timestamp": "2025-07-04T18:57:43Z"
  },
  {
    "title": "‘YES!’: Republican Celebrates Americans Losing Health Care in Deleted Post - NewsBreak",
    "description": "As millions of low-income and disabled Americans are at risk of losing their health insurance thanks to the passing of Donald Trump and the GOP’s so-called",
    "link": "https://www.newsbreak.com/share/4088211425076-yes-republican-celebrates-americans-losing-health-care-in-deleted-post?_f=app_share&amp;pd=0KBEjijd&amp;lang=en_US&amp;send_time=1751655433&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.18.0.43%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v5%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v9%2Cns_foryou_rank_exp_25q2-v7&amp;s=i2",
    "timestamp": "2025-07-04T18:57:40Z"
  },
  {
    "title": "Dems’ ‘Project 2029’ May Not Actually Bode Well For Party’s Future",
    "description": "Democrats' latest attempt to develop a winning political agenda central to their efforts to retake the White House could be destined for failure.",
    "link": "https://dailycaller.com/2025/07/04/dems-project-2029-may-not-actually-bode-well-for-partys-future/",
    "timestamp": "2025-07-04T18:57:23Z"
  },
  {
    "title": "See How Your After-Tax Income Rises With Trump’s Big Beautiful Bill",
    "description": "The Tax Policy Center finds that 85% of households will get a tax cut. Here’s how much your after-tax income will increase: for low, middle and high-income earners.",
    "link": "https://www.forbes.com/sites/terinaallen/2025/07/04/see-how-your-after-tax-income-rises-with-trumps-big-beautiful-bill/",
    "timestamp": "2025-07-04T18:55:23Z"
  },
  {
    "title": "Trump Voter's Wife Detained By ICE During Green Card Interview",
    "description": "She and her husband both supported President Donald Trump's plans to conduct mass deportations.",
    "link": "https://www.newsweek.com/trump-voter-ice-green-card-interview-2094808",
    "timestamp": "2025-07-04T18:52:08Z"
  },
  {
    "title": "Donald Trump’s Tax Bill: Who won and who lost",
    "description": "Larger standard deduction for seniors; tips and overtime pay exempted from income taxes. Provisions include limits to shrink cost and expire after 2028. Clean energy industries hit; a tax credit for solar panels and wind systems is quickly phased out; efficie…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-tax-bill-who-won-and-who-lost/articleshow/122256466.cms",
    "timestamp": "2025-07-04T18:49:59Z"
  },
  {
    "title": "Harvard’s battle with the Trump administration may break it",
    "description": "Institute with many billions in endowment cash could end up with billion-dollar budget hole if it fails to reach an agreement with federal government and earn back federal cash handouts",
    "link": "https://www.wnd.com/2025/07/harvards-battle-trump-administration-may-break-it/",
    "timestamp": "2025-07-04T18:47:01Z"
  },
  {
    "title": "US Dollar Primed To Weaken Further Amid the Worst First-Half-Year Performance Since 1973: S&P Global",
    "description": "The US dollar just had the worst first-half-year performance in over 50 years and is likely to weaken even more, according to the financial data and analytics firm S&P Global. In a new report, S&P Global says the US dollar is rapidly weakening due to tariffs,…",
    "link": "https://dailyhodl.com/2025/07/04/us-dollar-primed-to-weaken-further-amid-the-worst-first-half-year-performance-since-1973-sp-global/",
    "timestamp": "2025-07-04T18:45:05Z"
  },
  {
    "title": "Unlock the White House Watch newsletter for free (Chloe Cornish/Financial Times)",
    "description": "Chloe Cornish / Financial Times:\nUnlock the White House Watch newsletter for free  —  Your guide to what Trump's second term means for Washington, business and the world  —  Since their war in Iran, Benjamin Netanyahu and Donald Trump have repeatedly floated …",
    "link": "https://www.memeorandum.com/250704/p50",
    "timestamp": "2025-07-04T18:45:02Z"
  },
  {
    "title": "Elon Musk Rekindles Trump Criticism, Attacks ‘Big, Beautiful Bill’",
    "description": "He's mad about adding to the debt but seems fine with kicking people off of healthcare.",
    "link": "https://gizmodo.com/elon-musk-rekindles-trump-criticism-attacks-big-beautiful-bill-2000624326",
    "timestamp": "2025-07-04T18:43:16Z"
  },
  {
    "title": "Bannon Savages Elon Musk For Wanting to Start ‘America Party’: ‘No, Brother, You’re Not an American’",
    "description": "\"No, brother, you're not an American. You're a South African. We take enough time and prove the facts of that, you should be deported\"\nThe post Bannon Savages Elon Musk For Wanting to Start ‘America Party’: ‘No, Brother, You’re Not an American’ first appeared…",
    "link": "https://www.mediaite.com/media/podcasts/bannon-savages-elon-musk-for-wanting-to-start-america-party-no-brother-youre-not-an-american/",
    "timestamp": "2025-07-04T18:42:06Z"
  },
  {
    "title": "India says ready to make deal with US but national interest to be ‘supreme’",
    "description": "Trade Minister Piyush Goyal’s remarks come before the deadline set by the White House for July 9 for trade deals.",
    "link": "https://www.aljazeera.com/economy/2025/7/4/india-says-ready-to-make-deal-with-us-but-national-interest-to-be-supreme",
    "timestamp": "2025-07-04T18:40:12Z"
  },
  {
    "title": "US plans massive Arctic investment",
    "description": "Trump’s budget bill allocates billions for ice-capable vessels as Washington plays catch-up with Moscow in the region Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621014-us-icebreaker-investment-arctic/",
    "timestamp": "2025-07-04T18:37:59Z"
  },
  {
    "title": "A Warning: What South Africa Can Teach Americans About Preserving Their Freedom",
    "description": "Many South Africans told The Daily Caller that their problems are less isolated crises and more a preview of what’s coming to the United States.",
    "link": "https://dailycaller.com/2025/07/04/south-africa-race-violence-united-states-warning-farm-killings/",
    "timestamp": "2025-07-04T18:36:25Z"
  },
  {
    "title": "Big Beautiful Bill immediately hits the campaign trail in battle for Congress",
    "description": "The political battle over Trump's Big, Beautiful Bill hits the campaign trail, as candidates for an open Senate seat in battleground New Hampshire trade fire over the measure.",
    "link": "https://www.foxnews.com/politics/big-beautiful-bill-immediately-hits-campaign-trail-battle-congress",
    "timestamp": "2025-07-04T18:32:08Z"
  },
  {
    "title": "Trump expected to sign his huge bill of tax and spending cuts at July 4 picnic",
    "description": "President Donald Trump was expected to sign his package of tax breaks and spending cuts into law Friday at the annual White House Fourth of July picnic.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_3ba3e0a4-3300-5652-ae2f-bdacea87d425.html",
    "timestamp": "2025-07-04T18:30:00Z"
  },
  {
    "title": "Steen Defense utvecklar svenska automatkarbiner",
    "description": "Är ensamma om det i Sverige\n\n\n\n\n\n\n\n\n\n\n\n\nDet svenska startupföretaget Steen Defense har utvecklat två modeller av automatkarbiner, något som de mig veterligen är ensamma om i Sverige. \n\nFöretaget drog igång sin verksamhet 2022 och har utvecklat två olika model…",
    "link": "https://feber.se/samhalle/steen-defense-utvecklar-svenska-automatkarbiner/481332/",
    "timestamp": "2025-07-04T18:30:00Z"
  },
  {
    "title": "Trump expected to sign his huge bill of tax and spending cuts at July 4 picnic",
    "description": "President Donald Trump was expected to sign his package of tax breaks and spending cuts into law Friday at the annual White House Fourth of July picnic.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_5d495644-ca2e-5d0e-9d2f-d82a2018d458.html",
    "timestamp": "2025-07-04T18:30:00Z"
  },
  {
    "title": "Donald Trump says he wants to stage UFC fight on White House grounds",
    "description": "President Trump has announced that an Ultimate Fighting Championship bout will be held on the grounds of the White House next year, one of many events to be held to celebrate America's 250th birthday.",
    "link": "https://www.npr.org/2025/07/04/nx-s1-5456844/trump-ufc-fight-white-house",
    "timestamp": "2025-07-04T18:29:49Z"
  },
  {
    "title": "Patel and Ratcliffe try to bolster claims that FBI and CIA conspired against Trump",
    "description": "President Trump’s appointees at the FBI and CIA are using their power to try to prop up the president’s claims that both agencies conspired against him.",
    "link": "https://www.nbcnews.com/politics/national-security/patel-ratcliffe-try-bolster-claims-fbi-cia-conspired-trump-rcna216848",
    "timestamp": "2025-07-04T18:28:29Z"
  },
  {
    "title": "Tiger Woods and Vanessa Trump’s romance heating up: They’re ‘wedding bells serious’",
    "description": "\"She has found happiness for the first time in her life,\" a source exclusively told Page Six of the socialite's growing bond with the pro golfer.",
    "link": "https://pagesix.com/2025/07/04/celebrity-news/tiger-woods-vanessa-trump-are-wedding-bells-serious/",
    "timestamp": "2025-07-04T18:27:55Z"
  },
  {
    "title": "Trump, Zelenskyy discuss weapons and escalating Russian strikes",
    "description": "Ukraine has been asking Washington to sell it more Patriot missiles and systems that it sees as key to defending its cities from intensifying Russian attacks. A decision by Washington to halt some shipments of weapons to Ukraine prompted warnings by Kyiv that…",
    "link": "https://www.channelnewsasia.com/world/trump-zelenskyy-discuss-weapons-and-escalating-russian-strikes-5221081",
    "timestamp": "2025-07-04T18:27:13Z"
  },
  {
    "title": "Trump says US to start notifying trade partners of tariffs as high as 70%",
    "description": "“We’re going to start sending letters out to various countries starting tomorrow,” Trump told reporters late Thursday.",
    "link": "https://nypost.com/2025/07/04/business/trump-says-us-to-start-notifying-trade-partners-of-tariffs-as-high-as-70/",
    "timestamp": "2025-07-04T18:26:37Z"
  },
  {
    "title": "Inside The New Group Remaking The Trump-Rubio State Department",
    "description": "Benjamin Franklin Fellowship fellows hold leadership posts in the State Department, including half of the leading posts in the Bureau of Consular Affairs.",
    "link": "https://dailycaller.com/2025/07/04/benjamin-franklin-fellowship-state-department-bureau-consular-affairs-trump/",
    "timestamp": "2025-07-04T18:26:00Z"
  },
  {
    "title": "Mexican Boxer Who Was Arrested for Alleged Cartel Ties Follows the Entire Trump Family on Social Media",
    "description": "Mexican boxer Julio Cesar Chavez Jr. appears to be a big fan of the administration that recently arrested him and plans to deport him. On Thursday, the Department of Homeland Security announced it had detained Chavez Jr. due to suspected ties to the Sinaloa C…",
    "link": "https://www.mediaite.com/media/sports/mexican-boxer-who-was-arrested-for-alleged-cartel-ties-follows-the-entire-trump-family-on-social-media/",
    "timestamp": "2025-07-04T18:25:30Z"
  },
  {
    "title": "Canadians must now pay more to visit U.S. national parks",
    "description": "Visitors from Canada hoping to explore national parks in the U.S. will soon have to pay more than the standard entry fee.On July 3, the White House announced that U.S. President Donald Trump signed an executive order to increase fees for all foreign tourists …",
    "link": "https://dailyhive.com/canada/canada-us-national-parks-fee-increase",
    "timestamp": "2025-07-04T18:25:02Z"
  },
  {
    "title": "U.S. tariff receipts surge in Donald Trump's trade war",
    "description": "United States \n \n \n \n \n \n \n \n \n \n tariff revenues\n \n \n \n \n \n \n \n \n \n surged almost fourfold from a year earlier to a record US$24.2 billion in May, the first full month in which President \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n ‘s 10 per cent glob…",
    "link": "https://biztoc.com/x/eaf90327437d2b41",
    "timestamp": "2025-07-04T18:24:07Z"
  },
  {
    "title": "Israeli military kills 15 in Gaza as Trump awaits Hamas reply to peace proposal",
    "description": "Health officials at the Nasser Hospital in Khan Younis, southern Gaza, said the Israeli military had carried out an airstrike on a tent encampment west of the city around 2 a.m., killing 15 Palestinians displaced by nearly two years of war. The Israeli milita…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/israeli-military-kills-15-in-gaza-as-trump-awaits-hamas-reply-to-peace-proposal/articleshow/122255995.cms",
    "timestamp": "2025-07-04T18:17:16Z"
  },
  {
    "title": "Trump megabill gives the oil industry everything it wants and ends key support for solar and wind (Spencer Kimball/NBC News)",
    "description": "Spencer Kimball / NBC News:\nTrump megabill gives the oil industry everything it wants and ends key support for solar and wind  —  The president's embrace of fossil fuels and hostility to renewable energy are reflected in his signature domestic policy law.  — …",
    "link": "https://www.memeorandum.com/250704/p48",
    "timestamp": "2025-07-04T18:15:00Z"
  },
  {
    "title": "Elon Musk flip-flops? Slams Trump’s Big Beautiful Bill, then praises him as a peacemaker — what’s going on?",
    "description": "Elon Musk praises Donald Trump's international diplomacy. This comes after Musk's earlier criticism of Trump's economic policies. Trump's administration has brokered a Gaza ceasefire deal. He also seeks peace in the Russia-Ukraine war. Efforts are underway to…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-flip-flops-slams-trumps-big-beautiful-bill-then-praises-him-as-a-peacemaker-whats-going-on-elon-musk-donald-trump-latest-news/articleshow/122255347.cms",
    "timestamp": "2025-07-04T18:12:29Z"
  },
  {
    "title": "Major Quebec aluminum smelter announces $1.5-billion investment with new electricity deal",
    "description": "Major Quebec aluminum smelter announces $1.5-billion investment with new electricity dealtheglobeandmail.com",
    "link": "https://www.theglobeandmail.com/business/article-ottawa-in-talks-with-rio-tinto-about-financial-assistance-amid-tariffs/",
    "timestamp": "2025-07-04T18:12:08Z"
  },
  {
    "title": "Our Noble Declaration of Independence",
    "description": "Independence Day makes Progressives squirm. They despise the principles of the American Revolution. If they could, their scotus judges would gut the Declaration as thoroughly as they have the Constitution. To them, our Noble Declaration, this expression of Go…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326897/posts",
    "timestamp": "2025-07-04T18:07:54Z"
  },
  {
    "title": "‘I’ve never heard that’: Trump denies knowingly using anti-Semitic term",
    "description": "The US president used a term some consider a slur while speaking at a rally in Iowa for his America250 celebration.",
    "link": "https://www.aljazeera.com/news/2025/7/4/ive-never-heard-that-trump-denies-knowingly-using-anti-semitic-term",
    "timestamp": "2025-07-04T18:07:35Z"
  },
  {
    "title": "One big slow descent to the foggy bottom",
    "description": "Donald Trump's One Big Beautiful Bill Act is poised to trigger a US debt spiral, impacting emerging economies and global inflation management. US fiscal policies, coupled with tariffs, are creating worldwide economic shocks. Foreign creditors face constraints…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/one-big-slow-descent-to-the-foggy-bottom/articleshow/122255798.cms",
    "timestamp": "2025-07-04T18:05:02Z"
  },
  {
    "title": "US Plans AI Chip Curbs On Malaysia, Thailand Over China Concerns",
    "description": "President Donald Trump’s administration plans to restrict shipments of AI chips from the likes of Nvidia Corp. to Malaysia and Thailand, part of an effort to crack down on suspected semiconductor smuggling into China.",
    "link": "https://www.ndtvprofit.com/business/us-plans-ai-chip-curbs-on-malaysia-thailand-over-china-concerns",
    "timestamp": "2025-07-04T18:03:48Z"
  },
  {
    "title": "Markets forge ahead on holiday-shortened week that saw Trump's policy bill approved",
    "description": "Aside from the fact that Trump's so-called \"beautiful\" bill will increase the U.S. debt load by $3 trillion to $5 trillion over time, it will once again be an exercise",
    "link": "https://www.berkshireeagle.com/business/columnist/markets-forge-ahead-trump-policy-bill/article_89a39d01-3be2-4dee-9988-2e4a47a23e48.html",
    "timestamp": "2025-07-04T18:02:51Z"
  },
  {
    "title": "EU-US Trade Talks Focus On Tariff Offset For Automakers",
    "description": "Some European Union carmakers and capitals are pushing for an agreement with President Donald Trump that would allow for tariff relief in return for increasing investments in the US, according to people familiar with the matter.Member states were briefed on t…",
    "link": "https://www.ndtvprofit.com/global-economics/eu-us-trade-talks-focus-on-tariff-offset-for-automakers",
    "timestamp": "2025-07-04T18:01:41Z"
  },
  {
    "title": "Biden Claims European Leaders Are Reaching Out, Asking Him to ‘Engage’",
    "description": "“Many of the things I worked so damn hard [on], that I thought I changed in the country, are changing so rapidly.”\nThe post Biden Claims European Leaders Are Reaching Out, Asking Him to ‘Engage’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/biden-im-getting-calls-from-a-number-of-european-leaders-asking-me-to-get-engaged/",
    "timestamp": "2025-07-04T18:00:17Z"
  },
  {
    "title": "Left-leaning actress Natasha Lyonne leading efforts to lobby Trump admin on AI regulation",
    "description": "Anti-Trump Hollywood stars like Natasha Lyonne are petitioning the administration to address AI copyright protections against the wishes of big tech companies.",
    "link": "https://www.foxnews.com/media/left-leaning-actress-natasha-lyonne-leading-efforts-lobby-trump-admin-ai-regulation",
    "timestamp": "2025-07-04T18:00:14Z"
  },
  {
    "title": "Patriotism? Trump doesn't know what it means",
    "description": "Today I want to talk about the real meaning of patriotism.It’s the exact opposite of the version peddled by Donald Trump and his white Christian nationalists — that the nation is losing its whiteness or its dominant religion, that too many foreigners are cros…",
    "link": "https://www.rawstory.com/trump-july-4-2672646772/",
    "timestamp": "2025-07-04T18:00:02Z"
  },
  {
    "title": "Democrats react with fury as Trump’s Bill passes",
    "description": "Critics on the left and the right have taken issue with the effects the Bill will have on the US’s already considerable national debt",
    "link": "https://www.irishtimes.com/world/us/2025/07/04/democrats-react-with-fury-as-trumps-bill-passes/",
    "timestamp": "2025-07-04T18:00:01Z"
  },
  {
    "title": "Social Security Administration praises Trump’s agenda bill in widely sent out statement",
    "description": "Analysts said the move strayed from the agency’s typically apolitical nature.",
    "link": "https://www.cnn.com/2025/07/04/politics/social-security-administration-trump-bill-email",
    "timestamp": "2025-07-04T17:57:32Z"
  },
  {
    "title": "Wall Street was expecting a TACO Tuesday. But Dow futures fall 250 points after Trump says he will set tariffs as high as 70%",
    "description": "While U.S. markets were closed for the July 4 holiday, stock futures sank on Friday after President Donald Trump said he will start sending out letters informing countries of what tariffs they will face. The rates, which could reach as high as 70%, would beco…",
    "link": "https://biztoc.com/x/e09d971de477480c",
    "timestamp": "2025-07-04T17:50:37Z"
  },
  {
    "title": "‘Humiliating’: Putin Launches One of His Worst Attacks Yet On Ukraine, After Speaking to Trump",
    "description": "Ukraine’s air force said Russia launched over 550 drones and missiles at Ukrainian cities overnight. The drones were primarily Iranian-made Shahed drones.\nThe post ‘Humiliating’: Putin Launches One of His Worst Attacks Yet On Ukraine, After Speaking to Trump …",
    "link": "https://www.mediaite.com/politics/humiliating-putin-launches-one-his-worst-attacks-yet-on-ukraine-after-speaking-to-trump/",
    "timestamp": "2025-07-04T17:47:00Z"
  },
  {
    "title": "Trump defends slur, pitches UFC at White House for 250th Anniversary",
    "description": "Critics blasted Trump for invoking a Jewish stereotype while promoting a White House UFC event for America’s 250th",
    "link": "https://www.salon.com/2025/07/04/trump-defends-slur-pitches-ufc-at-white-house-for-250th/",
    "timestamp": "2025-07-04T17:45:32Z"
  },
  {
    "title": "Trump proposes UFC fight on White House grounds for America250 celebration",
    "description": "The president gave vague details about the proposed event.",
    "link": "https://abcnews.go.com/Politics/trump-proposes-ufc-fight-white-house-grounds-us/story?id=123481028",
    "timestamp": "2025-07-04T17:45:00Z"
  },
  {
    "title": "Wall Street was expecting a TACO Tuesday. But Dow futures fall 250 points after Trump says he will set tariffs as high as 70%",
    "description": "Trump said that about “10 or 12” tariff letters would go out Friday, with additional letters coming “over the next few days.”",
    "link": "https://fortune.com/2025/07/04/stock-market-today-dow-futures-trump-tariffs-deadline-70-percent-letters/",
    "timestamp": "2025-07-04T17:44:15Z"
  },
  {
    "title": "Exclusive-China signals investment in Brazil-led global forest fund, sources say",
    "description": "RIO DE JANEIRO (Reuters) -China has signaled to the Brazilian government that it will invest in the Tropical Forests Forever Facility, a multilateral...",
    "link": "https://ca.news.yahoo.com/exclusive-china-signals-investment-brazil-174101245.html",
    "timestamp": "2025-07-04T17:41:01Z"
  },
  {
    "title": "SCOTT BESSENT: President Trump's 'big, beautiful bill' will unleash parallel prosperity",
    "description": "Kicking off America’s 250th birthday celebration, President Donald Trump’s \"big beautiful bill\" is unleashing growth and prosperity for both Main Street and Wall Street alike.",
    "link": "https://www.foxnews.com/opinion/president-trumps-big-beautiful-bill-unleash-parallel-prosperity",
    "timestamp": "2025-07-04T17:40:42Z"
  },
  {
    "title": "Shocking tariff list: Trump to hit these countries with 70% duties — even longtime US allies aren’t spared",
    "description": "US President Donald Trump is set to impose steep tariffs, potentially up to 70%, on several major trade partners. Letters outlining the new tariff rates will be sent to about a dozen countries, with most taking effect on August 1. While the specific nations r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/shocking-tariff-list-trump-to-hit-these-countries-with-70-duties-even-longtime-us-allies-arent-spared-trump-tariffs-news/articleshow/122254590.cms",
    "timestamp": "2025-07-04T17:36:47Z"
  },
  {
    "title": "Bad Bunny Uses a Recording Mimicking Trump’s Voice to Deliver a Pro-Immigrant Message in ‘Nuevayol’ Video",
    "description": "Bad Bunny shared the 'Nuevayol' music video from his career-defining album 'Debi Tirar Mas Fotos'",
    "link": "http://www.rollingstone.com/music/music-news/bad-bunny-nuevayol-video-1235379098/",
    "timestamp": "2025-07-04T17:35:25Z"
  },
  {
    "title": "US defense secretary personally halted weapons to Ukraine – NBC",
    "description": "Pete Hegseth suspended military aid to Kiev without informing the State Department or allies, the outlet claims Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621011-hegseth-us-ukraine-weapons/",
    "timestamp": "2025-07-04T17:35:10Z"
  },
  {
    "title": "'This is not an accident': Jewish leaders condemn Trump's use of antisemitic slur",
    "description": "The Anti-Defamation League and the CEO of the Jewish Council for Public Affairs criticized President Donald Trump's usage of “Shylocks” in a Thursday speech.",
    "link": "https://www.msnbc.com/top-stories/latest/jewish-leaders-decry-president-trumps-use-shylocks-describe-money-lend-rcna216950",
    "timestamp": "2025-07-04T17:35:09Z"
  },
  {
    "title": "Zohran Mamdani’s win challenges CEO-style governance, urging empathy over metrics in leadership",
    "description": "Zohran Mamdani's unexpected victory in NYC's Democratic mayoral primary sparks debate on leadership age. A study suggests older leadership correlates with lower firm vitality, but there is another argument which is against applying corporate models to governm…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/zohran-mamdanis-win-challenges-ceo-style-governance-urging-empathy-over-metrics-in-leadership/articleshow/122255276.cms",
    "timestamp": "2025-07-04T17:35:05Z"
  },
  {
    "title": "Could Children Be Detained At 'Alligator Alcatraz'? What We Know",
    "description": "Florida lawmakers have voiced their concern over the possibility, and five were recently denied entry into the facility.",
    "link": "https://www.newsweek.com/could-children-detained-alligator-alcatraz-2094810",
    "timestamp": "2025-07-04T17:29:21Z"
  },
  {
    "title": "Donald Trump Promises Big Beautiful UFC Fight To Celebrate America's 250th Anniversary",
    "description": "President Donald Trump passes over American pastimes like baseball, basketball, and football for the foreign-born discipline of mixed martial arts.",
    "link": "https://www.vanityfair.com/style/story/donald-trump-white-house-ufc-match",
    "timestamp": "2025-07-04T17:28:52Z"
  },
  {
    "title": "Newlywed Detained by ICE for 140 Days Says She Was Treated 'Like Cattle'",
    "description": "\"I was handcuffed for 16 hours without any water or food on the bus,\" Ward Sakeik said at a press conference after her release from ICE detention.",
    "link": "https://www.newsweek.com/newlywed-detained-ice-140-days-says-she-was-treated-like-cattle-2094747",
    "timestamp": "2025-07-04T17:28:01Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to sign tax and spending megabill Friday",
    "description": "At nearly 900 pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-expected-to-sign-tax-and-spending-megabill-friday",
    "timestamp": "2025-07-04T17:27:51Z"
  },
  {
    "title": "World Liberty Financial publishes proposal to make token transferable",
    "description": "Decentralized finance platform World Liberty Financial (WLFI) has initiated a community vote to open up its governance token to secondary market trading.",
    "link": "https://cointelegraph.com/news/world-liberty-financial-vote-wlfl-token-tradable-live",
    "timestamp": "2025-07-04T17:27:00Z"
  },
  {
    "title": "Flailing Iran launches attacks on citizens, now confiscating cell phones",
    "description": "'The regime's three pillars — militias, ballistic missiles, and its nuclear program — have all been decapitated or severely degraded. That leaves only asymmetric warfare: soft-target terrorism with plausible deniability'",
    "link": "https://www.wnd.com/2025/07/flailing-iran-launches-attacks-citizens-now-confiscating-cell/",
    "timestamp": "2025-07-04T17:26:19Z"
  },
  {
    "title": "World shares are mostly down as Trump’s tariff deadline looms, while U.S. stocks set records",
    "description": "Many of Trump’s stiff proposed taxes on imports are currently on pause, but they’re scheduled to kick in next week unless Trump reaches deals with other countries to lower them.",
    "link": "https://www.pbs.org/newshour/world/world-shares-are-mostly-down-as-trumps-tariff-deadline-looms-while-u-s-stocks-set-records",
    "timestamp": "2025-07-04T17:25:00Z"
  },
  {
    "title": "Trump: I’ll spare undocumented farm workers if bosses can vouch for them",
    "description": "Donald Trump said he will spare undocumented farm workers from deportation if their bosses can vouch for them.",
    "link": "https://uk.news.yahoo.com/trump-ll-spare-undocumented-farm-171142437.html",
    "timestamp": "2025-07-04T17:11:42Z"
  },
  {
    "title": "Catholic Bishops Trash Trump's Big Beautiful Bill Passing",
    "description": "The bill contains cuts to welfare programs \"that protect God's creation,\" says the head of the U.S. bishops' conference.",
    "link": "https://www.newsweek.com/catholic-bishops-trash-trump-big-beautiful-bill-passing-2094831",
    "timestamp": "2025-07-04T17:08:18Z"
  },
  {
    "title": "Trump Says the White House May Host UFC Fight for America’s 250th Birthday",
    "description": "\"All of our national park battlefields and historic sites are going to have special events\" in 2026, Trump says on Thursday\nThe post Trump Says the White House May Host UFC Fight for America’s 250th Birthday appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-ufc-fight-white-house/",
    "timestamp": "2025-07-04T17:06:24Z"
  },
  {
    "title": "European shares dip ahead of US tariffs",
    "description": "Irish index closes week marginally lower",
    "link": "https://www.irishtimes.com/business/2025/07/04/european-shares-dip-ahead-of-us-tariffs/",
    "timestamp": "2025-07-04T17:05:52Z"
  },
  {
    "title": "Rwanda president unsure if DRC peace deal will hold, warns against ‘tricks’",
    "description": "Paul Kagame gives cautious welcome to US-brokered agreement, but says success depends on goodwill from warring parties.",
    "link": "https://www.aljazeera.com/news/2025/7/4/rwanda-president-unsure-if-drc-peace-deal-will-hold-warns-against-tricks",
    "timestamp": "2025-07-04T17:03:56Z"
  },
  {
    "title": "Blueberry U.S. recall elevated to highest level due to serious health risk - NewsBreak",
    "description": "The US Food and Drug Administration has issued a blueberry recall at the highest possible level after the fruit was found to contain listeria, a disease-ca",
    "link": "https://www.newsbreak.com/share/4087524355647-blueberry-u-s-recall-elevated-to-highest-level-due-to-serious-health-risk?s=a2&amp;share_destination_id=MjE4OTk3MDExLTE3NTE2NDg1Mzk1MTA%3D&amp;pd=0Eot7rKF&amp;hl=en_US&amp;send_time=1751648539&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-control%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v9%2Cns_foryou_recall_exp_25q3-control",
    "timestamp": "2025-07-04T17:03:49Z"
  },
  {
    "title": "Elon Musk Shares More Details About His Plan to Create New Political Party and Become ‘Deciding Vote on Contentious Laws’",
    "description": "Tech billionaire Elon Musk spent his Independence Day doubling down on his threat to form a new political party, dubbed the “America Party.” The Tesla and SpaceX CEO, who picked a fight with President Donald Trump over the One Big Beautiful Bill, is claiming …",
    "link": "https://www.thegatewaypundit.com/2025/07/elon-musk-shares-more-details-about-his-plan/",
    "timestamp": "2025-07-04T17:00:46Z"
  },
  {
    "title": "New week, Trump and Netanyahu will meet at the White House to plan their ‘New Middle East’",
    "description": "On Monday, Donald Trump and Benjamin Netanyahu will meet to discuss the next steps in their plan to reshape the Middle East. Their vision includes expanding normalization, disarming adversaries, and ending any Palestinian aspirations for freedom.",
    "link": "https://mondoweiss.net/2025/07/new-week-trump-and-netanyahu-will-meet-at-the-white-house-to-plan-their-new-middle-east/",
    "timestamp": "2025-07-04T17:00:12Z"
  },
  {
    "title": "Trump to sign sweeping tax and spending bill into law",
    "description": "A signing ceremony at the White House on Friday afternoon will kick off celebrations for 4 July.",
    "link": "https://www.bbc.com/news/articles/cpvjlj3n1vmo",
    "timestamp": "2025-07-04T16:59:09Z"
  },
  {
    "title": "Judge Rejects ‘Curious’ Argument from Trump DOJ in Denying Jan. 6 Rioter’s Motion to Get Restitution Fees Refunded",
    "description": "U.S. District Court Judge for the District of Columbia Tanya Chutkan bluntly rejected a January 6th defendant's argument that President Donald Trump's pardon should not only wipe out his conviction but also entitle him to a refund of his court-ordered restitu…",
    "link": "https://www.mediaite.com/crime/judge-rejects-curious-argument-from-trump-doj-in-denying-jan-6-rioters-motion-to-get-restitution-fees-refunded/",
    "timestamp": "2025-07-04T16:58:00Z"
  },
  {
    "title": "Trump says he didn't know an offensive term he used in a speech is considered antisemitic (Michelle L. Price/Associated Press)",
    "description": "Michelle L. Price / Associated Press:\nTrump says he didn't know an offensive term he used in a speech is considered antisemitic  —  President Donald Trump says he didn't know the term “shylock” is considered antisemitic when he used it in a speech to describe…",
    "link": "https://www.memeorandum.com/250704/p37",
    "timestamp": "2025-07-04T16:55:00Z"
  },
  {
    "title": "'Highly Inspiring' Court Ruling Affirms Nations' Legal Duty to Combat Climate Emergency",
    "description": "In a landmark advisory opinion published Thursday, the Inter-American Court of Human Rights—of which the United States, the world's second-biggest carbon polluter, is not a member—affirmed the right to a stable climate and underscored nations' duty to act to …",
    "link": "https://www.commondreams.org/news/iacthr-advisory-opinion-climate",
    "timestamp": "2025-07-04T16:52:37Z"
  },
  {
    "title": "Putin is ‘mocking’ Trump – Poland",
    "description": "Polish Foreign Minister Radoslaw Sikorski has called on US President Donald Trump to resume weapons shipments to Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620997-sikorski-kiev-weapons-trump/",
    "timestamp": "2025-07-04T16:51:30Z"
  },
  {
    "title": "Trump inaugural impersonators scammed donors out of crypto, feds say",
    "description": "Scammers impersonating the Trump-Vance Inaugural Committee fraudulently stole hundreds of thousands of dollars in cryptocurrency, according to a filing.",
    "link": "https://www.cnbc.com/2025/07/04/trump-cryptocurrency-ethereum-tokens.html",
    "timestamp": "2025-07-04T16:50:52Z"
  },
  {
    "title": "Trump considering UFC fight on White House grounds to mark nation’s 250th anniversary",
    "description": "President Donald Trump, a big fan of mixed martial arts, said on Thursday that he is considering staging a UFC match on the grounds of the White House next year.",
    "link": "https://www.wsbtv.com/news/trending/trump-considering-ufc-fight-white-house-grounds-mark-nations-250th-anniversary/ETFW33QZNZENVKUNJCRLJ2DACI/",
    "timestamp": "2025-07-04T16:50:16Z"
  },
  {
    "title": "Trump is expected to sign his huge bill of tax and spending cuts at the White House July 4 picnic",
    "description": "President Donald Trump is expected to sign his signature bill of tax and spending cuts at the White House Fourth of July picnic",
    "link": "https://www.wsbtv.com/news/politics/trump-is-expected/AXTFW72OZ5DWRGZKKG6OTA2YFM/",
    "timestamp": "2025-07-04T16:50:16Z"
  },
  {
    "title": "Passage of Trump’s “Big, Beautiful Bill” Approves Reversals in Climate Policy",
    "description": "To pay for the tax breaks, the bill sunsets clean energy tax credits put in place by the Inflation Reduction Act.",
    "link": "https://grist.org/politics/a-self-inflicted-tragedy-congress-approves-reversal-of-us-climate-policy/",
    "timestamp": "2025-07-04T16:44:35Z"
  },
  {
    "title": "Political commenator says US is the ‘bad guy on world stage,’ should face international sanctions",
    "description": "Elie Mystal urges international sanctions on the US, calling it a 'rogue state.'",
    "link": "https://nypost.com/2025/07/04/media/political-commenator-says-us-is-the-bad-guy-on-world-stage-should-face-international-sanctions/",
    "timestamp": "2025-07-04T16:42:58Z"
  },
  {
    "title": "Elon Musk says he may launch his own party: but US history tells us that’s not a recipe for success",
    "description": "Just having plenty of money does not guarantee success fo an insurgent political movement in the US.",
    "link": "https://theconversation.com/elon-musk-says-he-may-launch-his-own-party-but-us-history-tells-us-thats-not-a-recipe-for-success-260480",
    "timestamp": "2025-07-04T16:41:40Z"
  },
  {
    "title": "Friday, July 4. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,227.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/07/04/friday-july-4-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-07-04T16:41:34Z"
  },
  {
    "title": "Trump Talks Up Farmers in Iowa",
    "description": "President Donald Trump celebrated the passage of his One Big Beautiful Bill and touted his plans for the 250th anniversary of our nation’s founding next year with an address at the Iowa State Fairgrounds focused on farmers. “This bill rescues over two million…",
    "link": "https://agwired.com/2025/07/04/trump-talks-up-farmers-in-iowa/",
    "timestamp": "2025-07-04T16:41:18Z"
  },
  {
    "title": "Donald Trump criticised for using antisemitic slur to describe money lenders",
    "description": "President Donald Trump has claimed he did not know the term “shylock” is considered antisemitic when he used it in a speech to describe unscrupulous money lenders.",
    "link": "https://www.independent.ie/world-news/donald-trump-criticised-for-using-antisemitic-slur-to-describe-money-lenders/a1491995300.html",
    "timestamp": "2025-07-04T16:41:10Z"
  },
  {
    "title": "Elon Musk Touts 'Laser-Focus' Plan for How New Party Can Control Congress",
    "description": "Musk floated a strategy for how the \"America Party\" can have influence in Congress.",
    "link": "https://www.newsweek.com/elon-musk-touts-laser-focus-plan-new-party-2094822",
    "timestamp": "2025-07-04T16:40:11Z"
  },
  {
    "title": "How Donald Trump’s economic policies, including uncertainty around tariffs, are damaging the US economy",
    "description": "Borrowing is more expensive. Investors are holding back.",
    "link": "https://theconversation.com/how-donald-trumps-economic-policies-including-uncertainty-around-tariffs-are-damaging-the-us-economy-259809",
    "timestamp": "2025-07-04T16:35:51Z"
  },
  {
    "title": "Zelensky Says He Discusses Air Defense, Situation on Front Line with Trump",
    "description": "Zelensky described the conversation with the US leader as \"very important and useful\"MOSCOW, July 4. /TASS/. Ukraine’s Vladimir Zelensky discussed air defense and the situation on the front line with US President Donald Trump amid reports about a pause in Was…",
    "link": "https://freerepublic.com/focus/f-news/4326887/posts",
    "timestamp": "2025-07-04T16:34:26Z"
  },
  {
    "title": "Trump criticized for using antisemitic slur in Iowa speech",
    "description": "Jewish advocacy groups slammed President Donald Trump after he used an antisemitic trope to praise the passage of his spending bill.",
    "link": "https://abcnews.go.com/Politics/trump-criticized-antisemitic-slur-iowa-speech/story?id=123481024",
    "timestamp": "2025-07-04T16:33:48Z"
  },
  {
    "title": "Donald Trump caught in new dementia moment sparking major health fears as he misremembers major date - NewsBreak",
    "description": "Donald Trump caught in new dementia moment sparking major health fears as he misremembers major date - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4089190847770-donald-trump-caught-in-new-dementia-moment-sparking-major-health-fears-as-he-misremembers-major-date?s=a2&amp;share_destination_id=MTY2MjgyNjMxLTE3NTE2NDY2Mzc2NzM%3D&amp;pd=0BFhhvIM&amp;hl=en_US&amp;send_time=1751646637&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-control%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_recall_exp_25q3-v1%2Cns_foryou_blend_exp_25q2-v3",
    "timestamp": "2025-07-04T16:32:21Z"
  },
  {
    "title": "Bettors sound alarm over $1.1B tax hike in Trump’s Big Beautiful Bill: ‘This will kill professional gambling’",
    "description": "Trump's “Big Beautiful Bill” includes a provision that will limit deductions for gambling losses to 90% of winnings, starting in the 2026 tax year.",
    "link": "https://nypost.com/2025/07/04/business/gamblers-sound-alarm-over-1-1b-tax-hike-in-trumps-big-beautiful-bill/",
    "timestamp": "2025-07-04T16:30:45Z"
  },
  {
    "title": "From ‘Paradise’ To ‘Zero Day,’ Conspiracy Thrillers Are Dominating TV Again As Government Distrust Swells In America — Is That A Good Thing?",
    "description": "If you turned on the television earlier this year, you may have tuned in to watch Sterling K. Brown fighting to save what he thought was left of his country from the selfish interests of a power hungry billionaire in Hulu’s Paradise. Perhaps, before today’s I…",
    "link": "http://deadline.com/2025/07/conspiracy-thrillers-dominate-tv-paradise-zero-day-american-political-skepticism-1236448404/",
    "timestamp": "2025-07-04T16:30:00Z"
  },
  {
    "title": "Bessent says next project for Treasury is … student loans",
    "description": "Biden's plan of mass forgiveness, in violation of Supreme Court ruling, confirmed as 'unacceptable'",
    "link": "https://www.wnd.com/2025/07/bessent-says-next-project-treasury-is-student-loans/",
    "timestamp": "2025-07-04T16:29:09Z"
  },
  {
    "title": "Conor McGregor Wants To Fight On Trump’s White House UFC Card",
    "description": "Conor McGregor appears interested in fighting in Donald Trump’s White House UFC card. On Thursday night, Trump announced that he and Dana White are planning on holding a UFC event on the White House grounds for next year’s 250th anniversary celebration on the…",
    "link": "https://brobible.com/sports/article/conor-mcgregor-wants-to-fight-on-trumps-white-house-ufc-card/",
    "timestamp": "2025-07-04T16:29:05Z"
  },
  {
    "title": "Trump pitches plan allowing farmers to vouch for illegal immigrant workers facing deportation",
    "description": "After the president first brought up the proposal earlier this week, critics have already started sounding off.",
    "link": "https://nypost.com/2025/07/04/us-news/trump-pitches-plan-allowing-farmers-to-vouch-for-illegal-immigrant-workers-facing-deportation/",
    "timestamp": "2025-07-04T16:28:19Z"
  },
  {
    "title": "‘Dumbest Congresswoman Ever’: Tom Homan Hasn’t Held Back — Here’s Five Times He Torched Dems As Border Czar",
    "description": "Tom Homan has wasted no time reigniting the administration’s immigration crackdown while taking swings at Democrats and the legacy media outlets along the way.",
    "link": "https://dailycaller.com/2025/07/04/tom-homan-border-czar-democrats-illegal-migrants-deportations/",
    "timestamp": "2025-07-04T16:25:41Z"
  },
  {
    "title": "Trump's FBI Deputy Director Is A Podcaster Who Thinks The Election Was Stolen (Lydia O'Connor/HuffPost)",
    "description": "Lydia O'Connor / HuffPost:\nTrump's FBI Deputy Director Is A Podcaster Who Thinks The Election Was Stolen  —  “Folks, the FBI is at it again.  I don't trust these people at all,” the conspiracy theorist once wrote on social media.  —  President Donald Trump ta…",
    "link": "https://www.memeorandum.com/250704/p33",
    "timestamp": "2025-07-04T16:25:01Z"
  },
  {
    "title": "From “Million Bazillion”: What are tariffs?",
    "description": "Since President Trump began imposing on-and-off tariffs earlier this year, “tariff” has become a buzzword. And you might have a kid in your life who’s asked what the deal with tariffs is all about. So today, we’re sharing an episode from the latest season of …",
    "link": "https://www.marketplace.org/episode/2025/07/04/from-million-bazillion-what-are-tariffs",
    "timestamp": "2025-07-04T16:24:06Z"
  },
  {
    "title": "What are the 'Patriot Games'? Trump's New Televised Sporting Competition",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced the launch of the \"Patriot Games,\" a national sporting competition for top high school athletes from all 50 states, as part of the kick-off celebration for the United States' 2…",
    "link": "https://biztoc.com/x/2299408abcf450ce",
    "timestamp": "2025-07-04T16:21:48Z"
  },
  {
    "title": "Donald Trump's team sound alarm over president's health after 6 worrying signs - NewsBreak",
    "description": "Members of Donald Trump's inner circle have said they 'don’t think he’s in good physical health' as several White House insiders have pointed to key behavi",
    "link": "https://www.newsbreak.com/share/4088939814186-donald-trump-s-team-sound-alarm-over-president-s-health-after-6-worrying-signs?s=a2&amp;share_destination_id=MTM1ODcyNzIyLTE3NTE2NDU5ODM0ODA%3D&amp;pd=09C6hWpd&amp;hl=en_US&amp;send_time=1751645983&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v6%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v6",
    "timestamp": "2025-07-04T16:20:08Z"
  }
]