[
  {
    "title": "US Not Planning to Conduct Large-Scale Detonations During Nuclear Testing – Senator Cotton",
    "description": "WASHINGTON (Sputnik) - US Senator Tom Cotton stated on Thursday that following President Donald Trump’s decision to resume nuclear testing, the United States does not intend to carry out large-scale detonations, but will focus on smaller, potentially undergro…",
    "link": "https://sputnikglobe.com/20251031/us-not-planning-to-conduct-large-scale-detonations-during-nuclear-testing--senator-cotton-1123041402.html",
    "timestamp": "2025-10-31T04:50:53Z"
  },
  {
    "title": "Trump urges GOP to 'end the shutdown' by going nuclear on Senate filibuster (Landon Mion/Fox News)",
    "description": "Landon Mion / Fox News:\nTrump urges GOP to ‘end the shutdown’ by going nuclear on Senate filibuster  —  ‘Get rid of the Filibuster, and get rid of it, NOW!’  President Donald Trump said  —  President Donald Trump on Thursday urged Republicans to end the filib…",
    "link": "https://www.memeorandum.com/251031/p2",
    "timestamp": "2025-10-31T04:50:00Z"
  },
  {
    "title": "Lawmakers Move to Impeach Judge Boasberg for Rubber-Stamping Jack Smith's Partisan Surveillance",
    "description": "Newly released FBI files made public by Sen. Chuck Grassley (R-IA) reveal that former Special Counsel Jack Smith issued nearly 200 subpoenas targeting Republican organizations, officials, and donors as part of a Justice Department investigation launched under…",
    "link": "https://www.breitbart.com/politics/2025/10/30/fbi-files-show-jack-smith-issued-hundreds-of-subpoenas-to-gop-groups-as-lawmakers-move-to-impeach-judge-boasberg/",
    "timestamp": "2025-10-31T04:44:41Z"
  },
  {
    "title": "Kareena Kapoor, Rishab Shetty and others praises team India for reaching the Women's World Cup final",
    "description": "Several big names from B-town lauded team India as they reached the Women's World Cup finals after a historic win against the defending champions Australia.",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/kareena-kapoor-rishab-shetty-and-others-praises-team-india-for-reaching-the-womens-world-cup-final/articleshow/124983509.cms",
    "timestamp": "2025-10-31T04:39:03Z"
  },
  {
    "title": "Ohio commission and Virginia lawmakers consider moves toward mid-decade congressional redistricting",
    "description": "Mid-cycle congressional redistricting efforts could move forward Friday in two more states amid maneuvering to influence which party will control the U.S. House after next year’s midterm elections",
    "link": "https://abcnews.go.com/Politics/wireStory/ohio-commission-virginia-lawmakers-moves-mid-decade-congressional-127047510",
    "timestamp": "2025-10-31T04:37:46Z"
  },
  {
    "title": "Iran condemns Trump’s call to resume US nuclear testing",
    "description": "Tehran rebukes US plans for nuclear tests, citing hypocrisy over peaceful nuclear programme accusations.",
    "link": "https://www.aljazeera.com/news/2025/10/31/iran-condemns-trumps-call-to-resume-us-nuclear-testing",
    "timestamp": "2025-10-31T04:34:58Z"
  },
  {
    "title": "Sanjana Sanghi: My humanitarian work has helped me feel rooted",
    "description": "Discover Sanjana Sanghi's inspiring journey with the United Nations, advocating for youth-led innovation and social impact that connects her deeply to her roots and purpose.",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sanjana-sanghi-empowering-change-through-humanitarian-work-with-the-un/articleshow/124984113.cms",
    "timestamp": "2025-10-31T04:32:16Z"
  },
  {
    "title": "Trump calls on Senate to end the filibuster",
    "description": "United States President Donald Trump called on Senate Republicans to eliminate the filibuster in order to end the government shutdown.In a post on Truth Social, Trump wrote that \"it is now time for th...",
    "link": "https://biztoc.com/x/6b7904c098beb933",
    "timestamp": "2025-10-31T04:31:47Z"
  },
  {
    "title": "Bigg Boss 19: Armaan Malik bashes a troll calling Amaal Mallik jealous of ‘brother’s success’; says, “He’s the most selfless person I know”",
    "description": "Armaan Malik defended his brother Amaal Mallik against accusations of jealousy, calling him the most selfless person he knows. Armaan revealed Amaal made sacrifices for his success, urging fans not to spread false narratives. The brothers' strong bond garnere…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-19-armaan-malik-bashes-a-troll-calling-amaal-mallik-jealous-of-brothers-success-says-hes-the-most-selfless-person-i-know/articleshow/124984007.cms",
    "timestamp": "2025-10-31T04:28:51Z"
  },
  {
    "title": "Xi says China, U.S. should be 'partners and friends,' not rivals",
    "description": "Chinese President Xi Jinping said here Thursday that he is ready to continue working with U.S. President Donald Trump to build a solid foundation for ...",
    "link": "https://en.antaranews.com/news/389129/xi-says-china-us-should-be-partners-and-friends-not-rivals",
    "timestamp": "2025-10-31T04:27:45Z"
  },
  {
    "title": "China's factory activity shrank in October under pressure from tariffs and weak demand",
    "description": "China has reported its factory activity contracted for a seventh straight month in October, reflecting pressure from higher U.S. tariffs and sluggish domestic demand. The National Bureau of Statistics said Friday that its official purchasing managers index, o…",
    "link": "https://apnews.com/article/china-factory-economy-us-trade-2181298f18f96fa90dc6790b909f06c1",
    "timestamp": "2025-10-31T04:27:40Z"
  },
  {
    "title": "'Within hours, she stopped breathing': Madhya Pradesh infant dies after taking ayurvedic cough syrup; shop sealed",
    "description": "A heartbreaking incident unfolds in Chhindwara as a five-month-old baby tragically passes away after reportedly ingesting a contaminated ayurvedic cough syrup. This grim event adds to the distressing tally of over 24 child fatalities linked to a dangerous cou…",
    "link": "https://timesofindia.indiatimes.com/city/bhopal/within-hours-she-stopped-breathing-madhya-pradesh-infant-dies-after-taking-ayurvedic-cough-syrup-shop-sealed/articleshow/124983734.cms",
    "timestamp": "2025-10-31T04:26:42Z"
  },
  {
    "title": "China's Xi urges Asian nations to keep supply chains stable, work together during ‘turbulent’ times",
    "description": "Chinese President Xi Jinping played up how Beijing is a proponent of stable supply chains and free trade in a speech Friday.",
    "link": "https://www.cnbc.com/2025/10/31/chinas-xi-urges-asian-nations-to-keep-supply-chains-stable-work-together-during-turbulent-times.html",
    "timestamp": "2025-10-31T04:24:36Z"
  },
  {
    "title": "Nvidia is now worth $5 trillion as it consolidates power in AI boom",
    "description": "Nvidia's market value surged past $5 trillion, driven by the AI boom ignited by ChatGPT. The chip giant's essential components are now a linchpin of global economic growth and U.S. foreign policy, with President Trump leveraging its strategic importance in tr…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-is-now-worth-5-trillion-as-it-consolidates-power-in-ai-boom/articleshow/124983812.cms",
    "timestamp": "2025-10-31T04:23:58Z"
  },
  {
    "title": "China factory activity stumbles as export orders dry up",
    "description": "BEIJING (Reuters) -China's factory activity shrank for a seventh month in October, dragged by a drop in new export orders as the boost from months of front...",
    "link": "https://finance.yahoo.com/news/china-factory-activity-stumbles-export-042001674.html",
    "timestamp": "2025-10-31T04:20:01Z"
  },
  {
    "title": "Rage Against the ICE Machine",
    "description": "Anti-ICE protestors are showing signs of developing effective strategies and tactics.",
    "link": "https://www.nakedcapitalism.com/2025/10/rage-against-the-ice-machine.html",
    "timestamp": "2025-10-31T04:19:59Z"
  },
  {
    "title": "Bigg Boss Malayalam 7 preview: Aneesh proposes to Anumol; Is love finally blooming inside the house?",
    "description": "Bigg Boss Malayalam Season 7 sees a surprising proposal. Contestant Aneesh has asked fellow housemate Anumol to marry him. Their bond has grown over weeks, leading to speculation about its authenticity. Viewers are divided on whether the proposal is genuine o…",
    "link": "https://timesofindia.indiatimes.com/tv/news/malayalam/bigg-boss-malayalam-7-preview-aneesh-proposes-to-anumol-is-love-finally-blooming-inside-the-house/articleshow/124983596.cms",
    "timestamp": "2025-10-31T04:17:43Z"
  },
  {
    "title": "Government shutdown offers schools a glimpse of life without an Education Department",
    "description": "The government shutdown has been a source of anxiety for educators, wondering how long grant money will last and who can help them interpret federal laws",
    "link": "https://abcnews.go.com/Health/wireStory/government-shutdown-offers-schools-glimpse-life-education-department-127046857",
    "timestamp": "2025-10-31T04:15:04Z"
  },
  {
    "title": "Trump Calls on Republicans to End Filibuster: 'Initiate the Nuclear Option'",
    "description": "President Donald Trump called on Senate Republicans to \"initiate the nuclear option\" and end the filibuster as the government shutdown continues with no end in sight.\nThe post Trump Calls on Republicans to End Filibuster: ‘Initiate the Nuclear Option’ appeare…",
    "link": "https://www.breitbart.com/politics/2025/10/30/trump-calls-republicans-end-filibuster-initiate-nuclear-option/",
    "timestamp": "2025-10-31T04:14:32Z"
  },
  {
    "title": "Trump Nemesis Trolls President by Giving Him New Address",
    "description": "Donald Trump’s nemesis congressman slipped in a trolling dig in a scathing letter to the president condemning his White House teardown. Democratic Maryland...",
    "link": "https://www.thedailybeast.com/trump-nemesis-jamie-raskin-trolls-president-by-giving-him-new-address/",
    "timestamp": "2025-10-31T04:12:08Z"
  },
  {
    "title": "Exclusive -- Ernst: Military Would Not Be Receiving Pay If Trump Had Not Got Donations",
    "description": "On Thursday’s “Alex Marlow Show,” Sen. Joni Ernst (R-IA) talked about the government shutdown. Ernst said, “My daughter is an active-duty servicemember, her husband is also an active-duty servicemember. So, there’s a two-member family that would not be receiv…",
    "link": "https://www.breitbart.com/clips/2025/10/30/exclusive-ernst-military-would-not-be-receiving-pay-if-trump-had-not-got-donations/",
    "timestamp": "2025-10-31T04:09:14Z"
  },
  {
    "title": "Daily Egyptian Horoscope for October 31, 2025: A sudden shift in relationships could shock these zodiac signs",
    "description": "Ancient Egyptian astrology connects daily life to divine forces, offering guidance for clarity, strength, and love. Each zodiac sign receives personalized advice, encouraging self-trust, embracing ease, and prioritizing inner peace. The horoscopes emphasize m…",
    "link": "https://timesofindia.indiatimes.com/astrology/horoscope/daily-egyptian-horoscope-for-october-31-2025-a-sudden-shift-in-relationships-could-shock-these-zodiac-signs/articleshow/124911570.cms",
    "timestamp": "2025-10-31T04:07:59Z"
  },
  {
    "title": "Bride’s father at Kerala wedding straps QR code on his attire to receive gifts, social media calls it,\" Digital India level: Shaadi edition\"",
    "description": "A Kerala wedding saw the bride's father sporting a QR code on his shirt, allowing guests to send digital gifts. This innovative approach to wedding 'nek' has sparked widespread discussion, hailed by many as a symbol of 'Digital India' and modern convenience.",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/brides-father-at-kerala-wedding-straps-qr-code-on-his-attire-to-receive-gifts-social-media-calls-it-digital-india-level-shaadi-edition/articleshow/124983026.cms",
    "timestamp": "2025-10-31T04:07:01Z"
  },
  {
    "title": "China's factory activity contracts for 7th month, reflecting tariffs pressure on trade",
    "description": "China has reported its factory activity contracted for a seventh straight month in October, reflecting pressure from higher U.S. tariffs and sluggish domestic demand",
    "link": "https://abcnews.go.com/Business/wireStory/chinas-factory-activity-contracts-7th-month-reflecting-tariffs-127046399",
    "timestamp": "2025-10-31T04:06:25Z"
  },
  {
    "title": "Who is Mark Walter’s wife, Kimbra Walter? Exploring the personal life of the Los Angeles Lakers’ owner",
    "description": "Mark and Kimbra Walter, owners of the Los Angeles Lakers, are prominent philanthropists. The couple co-leads TWF Causes, focusing on equity and conservation. Their dedication extends to sports, notably founding the Professional Women's Hockey League, with its…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/who-is-mark-walters-wife-kimbra-walter-exploring-the-personal-life-of-the-los-angeles-lakers-owner/articleshow/124982778.cms",
    "timestamp": "2025-10-31T04:06:11Z"
  },
  {
    "title": "House Republican Tells Food Stamp Recipients, ‘Stop Smoking Crack’",
    "description": "Rep. Clay Higgins has little sympathy for millions of Americans whose food assistance benefits are set to expire on Nov. 1.\nThe post House Republican Tells Food Stamp Recipients, ‘Stop Smoking Crack’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/house-republican-tells-food-stamp-recipients-stop-smoking-crack/",
    "timestamp": "2025-10-31T04:06:09Z"
  },
  {
    "title": "A 3rd teenager is indicted for the killing of a congressional intern in Washington",
    "description": "A third teenager has been arrested and charged for the killing of a congressional intern in the nation’s capital, a crime that President Donald Trump cited when he announced a law enforcement surge in Washington",
    "link": "https://abcnews.go.com/US/wireStory/3rd-teenager-indicted-killing-congressional-intern-washington-127044905",
    "timestamp": "2025-10-31T04:05:36Z"
  },
  {
    "title": "Socialism or Barbarism: Reviving the History of the American Left",
    "description": "By Eric Ross | - ( Tomdispatch.com ) - More than a century ago, from a Berlin prison cell where she was confined for her uncompromising opposition to the slaughter of the First World War, Rosa Luxemburg warned, “Bourgeois society stands at the crossroads, eit…",
    "link": "https://www.juancole.com/2025/10/socialism-barbarism-reviving.html",
    "timestamp": "2025-10-31T04:04:54Z"
  },
  {
    "title": "The Middle East’s Axis of Rape and Pillage",
    "description": "The new post-ideological order in the Middle East and North Africa is built on nihilistic looting.\nThe post The Middle East’s Axis of Rape and Pillage appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/the-middle-easts-axis-of-rape-and-pillage/",
    "timestamp": "2025-10-31T04:03:00Z"
  },
  {
    "title": "Karnataka caste survey: 1.4 crore households covered; Bengaluru lags at 42%",
    "description": "As Karnataka's comprehensive caste survey wraps up, Bengaluru finds itself trailing with only 42.3% participation. Minister Shivaraj Tangadagi highlights that many residents are registering from their hometowns and the challenge posed by multiple electricity …",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/karnataka-caste-survey-1-4-crore-households-covered-bengaluru-lags-at-42/articleshow/124982884.cms",
    "timestamp": "2025-10-31T04:02:56Z"
  },
  {
    "title": "Teller Tells All",
    "description": "Juergen Teller’s “you are invited” exhibition is a soul-baring, midcareer survey, and the inaugural show at Onassis Ready, a creative space in the industrial suburbs of Athens.",
    "link": "http://wwd.com/eye/people/juergen-teller-opens-onassis-ready-athens-soul-baring-show-1238329684/",
    "timestamp": "2025-10-31T04:01:00Z"
  },
  {
    "title": "Future of Marketing Briefing: AI didn’t break agencies – the talent drain did",
    "description": "It’s not about chasing AI breakthroughs or assembling yet another full-stack planning and buying setup. It's something more fundamental – and harder to fix.",
    "link": "http://digiday.com/marketing/future-of-marketing-briefing-ai-didnt-break-agencies-the-talent-drain-did/",
    "timestamp": "2025-10-31T04:01:00Z"
  },
  {
    "title": "Friend-Enemy Distinction: the Question of the Palestinian and Jewish Diaspora",
    "description": "Introduction Since October 7th, and especially during the last year since Trump’s election, the question of Israeli power, Jewish influence, and the American mythos has come into question. Online rhetoric is rife with Israeli and Palestinian talking points; l…",
    "link": "https://www.lewrockwell.com/2025/10/no_author/friend-enemy-distinction-the-question-of-the-palestinian-and-jewish-diaspora/",
    "timestamp": "2025-10-31T04:01:00Z"
  },
  {
    "title": "China’s factory activity contracts for 7th month, reflecting tariffs pressure on trade",
    "description": "HONG KONG (AP) — China’s factory activity contracted for the seventh consecutive month in October, the government said Friday, as a newly announced truce in the trade war between the U.S. and China offers some hope for a stronger recovery in exports. The offi…",
    "link": "https://financialpost.com/pmn/chinas-factory-activity-contracts-for-7th-month-reflecting-tariffs-pressure-on-trade",
    "timestamp": "2025-10-31T04:00:44Z"
  },
  {
    "title": "SBF’s X Account Says FTX Was Never Insolvent—And FTT Would be $22 Billion Today",
    "description": "A document posted to the disgraced crypto mogul’s X account has reprised arguments from his trial, arguing FTX was never insolvent.",
    "link": "https://decrypt.co/346911/sbfs-x-account-says-ftx-was-never-insolvent-and-ftt-would-be-32-billion-today",
    "timestamp": "2025-10-31T04:00:16Z"
  },
  {
    "title": "Show of strength: Trump concludes Asia trip",
    "description": "President Donald Trump has concluded his week-long trip to Asia. Air Force One returned carrying another peace treaty, trade deals, and a one-year ceasefire with China on rare earths.\r\n\r\nThe contrast could hardly be sharper. On one side: yet another ...",
    "link": "https://www.americanthinker.com/blog/2025/10/show_of_strength_trump_concludes_asia_trip.html",
    "timestamp": "2025-10-31T04:00:00Z"
  },
  {
    "title": "Today's Democrats are as dangerous as 1861's Copperhead Democrats",
    "description": "Truth is the biggest threat to the Democrat party.\r\n\r\nAnd that makes the Democrat party the biggest threat to the United States today.\r\n\r\nWhich shouldn't be surprising, as it was also the biggest threat to the United States yesterday, particularl...",
    "link": "https://www.americanthinker.com/blog/2025/10/today_s_democrats_are_as_dangerous_as_1861_s_copperhead_democrats.html",
    "timestamp": "2025-10-31T04:00:00Z"
  },
  {
    "title": "Hangin’ With the Worst of the Worst",
    "description": "Every single illegal alien (the legal term) must leave our country. Yes, we need to reform our immigration laws to encourage and support legal immigration that reflects our country’s economic needs and values, while rejecting any notion that Am...",
    "link": "https://www.americanthinker.com/articles/2025/10/hangin_with_the_worst_of_the_worst.html",
    "timestamp": "2025-10-31T04:00:00Z"
  },
  {
    "title": "Arctic Frost: Inside the FBI’s MAGA dragnet to destroy Trump",
    "description": "Americans have been told that post-2020 Biden-era federal investigations were “narrowly targeted” to uncover crimes committed by the Trump campaign.  However, the newly released FBI case file published by House Judiciary Republi...",
    "link": "https://www.americanthinker.com/blog/2025/10/arctic_frost_inside_the_fbi_s_maga_dragnet_to_destroy_trump.html",
    "timestamp": "2025-10-31T04:00:00Z"
  },
  {
    "title": "MAHA’s shadow falls on the big food companies",
    "description": "Over the past few months, the food industry has sent a clear message.  Healthier, simpler, and more nutritious products are no longer niche — they’re the future, and they’re smart business.\r\n\r\nWith the arrival of new Healt...",
    "link": "https://www.americanthinker.com/blog/2025/10/maha_s_shadow_falls_on_the_big_food_companies.html",
    "timestamp": "2025-10-31T04:00:00Z"
  },
  {
    "title": "President Trump Will Arm South Korea With A Nuclear Submarine",
    "description": "Hopefully this doesn’t backfire. President Trump on Wednesday announced the United States will share “nuclear propulsion technologies” with South Korea. The move by Trump is quite historic considering the United States has only shared the technology with the …",
    "link": "https://freerepublic.com/focus/f-news/4349756/posts",
    "timestamp": "2025-10-31T03:59:52Z"
  },
  {
    "title": "Amazon Rivian Electric Delivery Vans Arrive in Canada",
    "description": "Amazon has deployed Rivian’s electric delivery vans in Canada for the first time, the companies announced this week. Deployed in the Vancouver area, there are now 50 Rivian EDVs roaming the streets in their Amazon wrapping. As someone living in Florida who ha…",
    "link": "https://cleantechnica.com/2025/10/30/rivian-electric-delivery-vans-arrive-in-canada/",
    "timestamp": "2025-10-31T03:59:10Z"
  },
  {
    "title": "China's factory activity contracts for 7th month, reflecting tariffs pressure on trade",
    "description": "China’s factory activity contracted for the seventh consecutive month in October, the government said Friday, as a newly announced truce in the trade war...",
    "link": "https://finance.yahoo.com/news/chinas-factory-activity-contracts-7th-035739984.html",
    "timestamp": "2025-10-31T03:57:39Z"
  },
  {
    "title": "'Pathetic': Critics Clown Trump After His 'Absolutely Embarrassing' New Nobel Boast",
    "description": "The president seemed to claim credit for the Nobel Prize — in physics?!?",
    "link": "https://www.huffpost.com/entry/trump-nobel-physics_n_69041bb7e4b00c26f070fa48",
    "timestamp": "2025-10-31T03:57:18Z"
  },
  {
    "title": "Ford to revive Chennai manufacturing plant with ₹3,250 crore investment",
    "description": "Sources in the know said that the company representatives are set to meet Tamil Nadu CM MK Stalin and State Industries Minister TRB Rajaa ⁠to sign a ₹3,250-crore MoU for powertrain manufacturing at its Chennai plant",
    "link": "https://www.thehindubusinessline.com/companies/ford-to-revive-chennai-manufacturing-plant-with-3250-crore-investment/article70224175.ece",
    "timestamp": "2025-10-31T03:48:47Z"
  },
  {
    "title": "Halloween Exclusive! Dino Morea: I have thrown crazy Halloween parties in Mumbai",
    "description": "Actor Dino Morea reminisces about his grand Halloween parties in Mumbai, sharing memories from his childhood in Bengaluru and insights into his fear of failure, as well as his favorite horror movies.",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/dino-moreas-spooktacular-halloween-parties-in-mumbai-a-nostalgic-journey/articleshow/124982300.cms",
    "timestamp": "2025-10-31T03:47:41Z"
  },
  {
    "title": "Trump-Xi Busan deal pauses G2 trade war, but doubts linger",
    "description": "In April 2025, US President Donald Trump escalated the trade conflict with China by threatening tariffs as high as 145%, prompting a fierce response from Beijing, vowing to fight to the end. Following a rare direct meeting in Busan, South Korea, the two leade…",
    "link": "https://www.digitimes.com/news/a20251031PD213/2025-us-china-trade-war-donald-trump-beijing.html",
    "timestamp": "2025-10-31T03:47:15Z"
  },
  {
    "title": "Standard Chartered Jumps as Profit Smashes Forecasts, Beats 2026 Goal a Year Early",
    "description": "This article first appeared on GuruFocus.  Standard Chartered (SCBFY) just delivered the kind of quarter investors pay attention to.  Adjusted pretax profit ...",
    "link": "https://finance.yahoo.com/news/standard-chartered-jumps-profit-smashes-034628015.html",
    "timestamp": "2025-10-31T03:46:28Z"
  },
  {
    "title": "Gold slips as Fed rate caution boosts dollar, set for 3rd monthly rise",
    "description": "Gold prices dip as a stronger dollar and Fed rate uncertainty impact markets, but remain on track for a monthly gain.",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-slips-as-fed-rate-caution-boosts-dollar-set-for-3rd-monthly-rise/article70224168.ece",
    "timestamp": "2025-10-31T03:44:47Z"
  },
  {
    "title": "'Non-interventionist' Trump flexes muscles in Latin America",
    "description": "Trump has been meddling in ways harkening back to an earlier era in U.S. history.",
    "link": "https://www.japantimes.co.jp/news/2025/10/31/world/trump-latin-america-interventionist/",
    "timestamp": "2025-10-31T03:34:00Z"
  },
  {
    "title": "Sen. Warner blasts Trump admin for excluding Democrats from briefings on boat strikes: 'Deeply troubling'",
    "description": "Sen. Mark Warner, D-Va., slammed the Trump administration for excluding Democrats from briefings on strikes targeting alleged drug boats, calling the move \"dangerous.\"",
    "link": "https://www.foxnews.com/politics/sen-warner-blasts-trump-admin-excluding-democrats-from-briefings-boat-strikes-deeply-troubling",
    "timestamp": "2025-10-31T03:29:27Z"
  },
  {
    "title": "Commentary: Trump-Xi meeting leaves core tech conflicts unresolved",
    "description": "After months of speculation, US President Donald Trump and Chinese President Xi Jinping met on October 30, 2025, at South Korea's Gimhae Air Base in Busan. As many analysts predicted, the two leaders steered clear of the Taiwan question and instead focused on…",
    "link": "https://www.digitimes.com/news/a20251031PD200/donald-trump-exports-nvidia-taiwan-shipments.html",
    "timestamp": "2025-10-31T03:22:03Z"
  },
  {
    "title": "YouTube TV to Drop ABC, ESPN and More After Failing to Reach New Carriage Agreement With Disney",
    "description": "\"We know this is a frustrating and disappointing outcome for our subscribers,\" a YouTube spokesperson says\nThe post YouTube TV to Drop ABC, ESPN and More After Failing to Reach New Carriage Agreement With Disney appeared first on TheWrap.",
    "link": "https://www.thewrap.com/youtube-tv-disney-blackout-carriage-dispute-abc-espn/",
    "timestamp": "2025-10-31T03:21:06Z"
  },
  {
    "title": "Trump calls for US Senate to scrap filibuster rule",
    "description": "President Donald Trump has urged Republicans to eliminate the Senate filibuster rule. This move aims to overcome Democratic opposition and end the ongoing government shutdown. The shutdown, now in its 30th day, is impacting federal workers and the economy. Re…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-calls-for-us-senate-to-scrap-filibuster-rule/articleshow/124981830.cms",
    "timestamp": "2025-10-31T03:17:57Z"
  },
  {
    "title": "NASA Refutes Kim Kardashian’s Conspiracy Theory: ‘Yes, We’ve Been to the Moon Before’",
    "description": "During the last episode of Hulu’s 'The Kardashians,' Kim Kardashian professed her belief that the 1969 moon landing never happened.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/nasa-kim-kardashian-moon-conspiracy-theory-1235457461/",
    "timestamp": "2025-10-31T03:14:27Z"
  },
  {
    "title": "China's Xi to meet Canadian, Japanese leaders after Trump trade truce",
    "description": "Chinese President Xi Jinping will hold his first talks with Japan's newly elected leader Sanae Takaichi.",
    "link": "https://www.channelnewsasia.com/east-asia/china-xi-jinping-meet-canada-japan-leaders-after-trump-trade-truce-apec-summit-5436881",
    "timestamp": "2025-10-31T03:14:00Z"
  },
  {
    "title": "Radio Free Asia says halting news operations due to Trump admin cuts",
    "description": "Announcing the move, staff at the outlet said 'authoritarian regimes are already celebrating' its potential demise.",
    "link": "https://www.aljazeera.com/news/2025/10/31/radio-free-asia-says-halting-news-operations-due-to-trump-admin-cuts",
    "timestamp": "2025-10-31T03:11:00Z"
  },
  {
    "title": "Trump Demands Senate Republicans Use the ‘NUCLEAR OPTION’ and ‘GET RID OF THE FILIBUSTER’",
    "description": "President Donald Trump called on Senate Republicans to eliminate the filibuster amid the ongoing government shutdown.\nThe post Trump Demands Senate Republicans Use the ‘NUCLEAR OPTION’ and ‘GET RID OF THE FILIBUSTER’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-demands-senate-republicans-use-the-nuclear-option-and-get-rid-of-the-filibuster/",
    "timestamp": "2025-10-31T03:10:43Z"
  },
  {
    "title": "Yes, There Are Some National Guard Willing To Do The Right Thing",
    "description": "As of this moment, the National Guard is indefinitely prevented from deploying within the Chicagoland area. The court order was issued pending the Supreme Court’s decision to rule on the matter. And because this administration is a walking, talking clown show…",
    "link": "https://www.techdirt.com/2025/10/30/yes-there-are-some-national-guard-willing-to-do-the-right-thing/",
    "timestamp": "2025-10-31T03:07:28Z"
  },
  {
    "title": "Trump urges GOP to ‘end the shutdown’ by going nuclear on Senate filibuster",
    "description": "President Donald Trump on Thursday called for Republicans to eliminate the filibuster in order to end the month-long government shutdown.",
    "link": "https://www.foxnews.com/politics/trump-urges-gop-end-shutdown-going-nuclear-senate-filibuster",
    "timestamp": "2025-10-31T03:06:00Z"
  },
  {
    "title": "On the rise in Germany, far-right AfD deepens ties to Trump administration",
    "description": "The party has held meetings with senior U.S. State Department officials in recent months.",
    "link": "https://www.japantimes.co.jp/news/2025/10/31/world/politics/far-right-afd-trump-ties/",
    "timestamp": "2025-10-31T03:06:00Z"
  },
  {
    "title": "Giorgia Meloni and the strongman who came to dinner",
    "description": "The adult in the room among Europe’s populists, the Italian prime had her work cut out for her with Orbán in town.",
    "link": "https://www.politico.eu/article/giorgia-meloni-strongman-viktor-orban-rome-visit-pope-leo/",
    "timestamp": "2025-10-31T03:02:00Z"
  },
  {
    "title": "'Completes the corruption': Trump DOJ's 'utterly appalling' move stuns legal expert",
    "description": "Legal expert and MSNBC contributor Joyce Vance penned a searing essay on Thursday, accusing the Department of Justice of becoming completely corrupted by President Donald Trump's attempts to rewrite history. On Wednesday, the Department of Justice fired two p…",
    "link": "https://www.rawstory.com/trump-doj-2674252623/",
    "timestamp": "2025-10-31T02:56:58Z"
  },
  {
    "title": "Trump says it is time to get rid of US Senate's filibuster custom",
    "description": "By Kanishka Singh WASHINGTON (Reuters) -Republican U.S.",
    "link": "https://www.yahoo.com/news/articles/trump-says-time-rid-us-025602571.html",
    "timestamp": "2025-10-31T02:56:02Z"
  },
  {
    "title": "Takaichi shines on the diplomatic stage",
    "description": "Takaichi got especially high marks for her masterful handling of U.S. President Donald Trump. Channeling her mentor, former Prime Minister Shinzo Abe.",
    "link": "https://www.japantimes.co.jp/editorials/2025/10/31/takaichi-shines-on-dilomatic-stage/",
    "timestamp": "2025-10-31T02:55:00Z"
  },
  {
    "title": "Trump Voters Are Leaving Curtis Sliwa",
    "description": "Some of President Donald Trump’s voters are leaving Republican New York City mayoral candidate Curtis Sliwa for former Democratic Governor Andrew Cuomo, according to a new poll.",
    "link": "https://freerepublic.com/focus/f-news/4349751/posts",
    "timestamp": "2025-10-31T02:54:53Z"
  },
  {
    "title": "Okay, Doomers: MSNBC Prophesizes Trump Economy Heading for Great 1929 Crash",
    "description": "Despite all the media pseudo savants’s end-of-the-world predictions about the Trump economy falling flat on their faces, MSNBC is still out there banging pots and pans over an incoming Great Depression-era crash. MSNBC The 11th Hour host and economic dunce St…",
    "link": "https://freerepublic.com/focus/f-bloggers/4349750/posts",
    "timestamp": "2025-10-31T02:54:25Z"
  },
  {
    "title": "Halloween at White House: Mini Trump, Melania and party pooper steal the spotlight as President hosts trick-or-treaters",
    "description": "Halloween event at White House: President Donald Trump and First Lady Melania Trump hosted a vibrant Halloween event at the White House, welcoming dozens of children in costumes for trick-or-treating. The couple distributed hundreds of chocolates to young gue…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-halloween-at-white-house-mini-trump-melania-and-party-pooper-steal-the-spotlight-as-president-hosts-trick-or-treaters/articleshow/124980974.cms",
    "timestamp": "2025-10-31T02:52:21Z"
  },
  {
    "title": "Stocks Regain Momentum as Amazon, Apple Lift Mood: Markets Wrap",
    "description": "Asian equities climbed close to their record and US equity-index futures advanced as strong earnings from Amazon.com Inc. and Apple Inc. lifted sentiment after a brief pause in the global stock rally.",
    "link": "https://www.ndtvprofit.com/markets/stocks-regain-momentum-as-amazon-apple-lift-mood-markets-wrap",
    "timestamp": "2025-10-31T02:50:45Z"
  },
  {
    "title": "Trump administration narrows public service loan forgiveness scope, bars groups with ‘substantial illegal purpose’",
    "description": "The US Department of Education has finalized a major overhaul of the Public Service Loan Forgiveness (PSLF) programme, narrowing eligibility to exclude organizations involved in unlawful activities such as aiding illegal immigration or supporting terrorism. R…",
    "link": "https://timesofindia.indiatimes.com/education/news/trump-administration-narrows-public-service-loan-forgiveness-scope-bars-groups-with-substantial-illegal-purpose/articleshow/124980471.cms",
    "timestamp": "2025-10-31T02:45:08Z"
  },
  {
    "title": "China's factory activity shrinks for seventh straight month",
    "description": "BEIJING: China's factory activity shrank for a seventh straight month in October, official data showed on Friday (Oct 31), as trade uncertainty ahead of talks between President Xi Jinping and US leader Donald Trump",
    "link": "https://www.channelnewsasia.com/east-asia/china-factory-activity-shrinks-seventh-straight-month-5436951",
    "timestamp": "2025-10-31T02:38:00Z"
  },
  {
    "title": "China factory activity shrinks for seventh month, PMI shows",
    "description": "BEIJING: China's factory activity shrank for a seventh month in October, an official survey showed on Friday (Oct 31), keeping alive calls for further stimulus to boost domestic demand, with efforts to ship goods abroad merely exporting price wars.The officia…",
    "link": "https://www.channelnewsasia.com/business/china-factory-activity-shrinks-seventh-month-pmi-shows-5436951",
    "timestamp": "2025-10-31T02:38:00Z"
  },
  {
    "title": "US immigration raid on Hyundai plant exposes visa gaps, raises investment concerns",
    "description": "<![CDATA[ The fallout from the raid at the plant in Georgia on Sep 4 has been far-reaching, straining diplomatic ties between Washington and Seoul. ]]>",
    "link": "https://www.channelnewsasia.com/world/united-states-immigration-raid-hyundai-plant-south-korean-visa-investments-5436966",
    "timestamp": "2025-10-31T02:32:40Z"
  },
  {
    "title": "Xi to meet Canadian, Japanese leaders after Trump trade truce",
    "description": "Xi Jinping takes center stage at APEC, meeting Canadian, Japanese, and Thai leaders following a trade truce with the US. Discussions focus on bolstering global supply chains amidst deepening economic uncertainty. Japan's new hawkish leader, Sanae Takaichi, is…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/xi-to-meet-canadian-japanese-leaders-after-trump-trade-truce/articleshow/124980428.cms",
    "timestamp": "2025-10-31T02:30:25Z"
  },
  {
    "title": "Hamas hands over 2 more bodies, says its committed to cease-fire",
    "description": "Washington DC (UPI) Oct 30, 2025 \n\n\n Hamas on Thursday handed over the remains of two more bodies it says are former hostages to Israel via the Red Cross, the Israeli prime minister's office said. \n The bodies will be taken to Israel's National Centre of Fore…",
    "link": "https://www.spacewar.com/reports/Hamas_hands_over_2_more_bodies_says_its_committed_to_cease-fire_999.html",
    "timestamp": "2025-10-31T02:25:19Z"
  },
  {
    "title": "Trump, Xi agree to pause dueling port fees that disrupted trade",
    "description": "America and China have agreed to halt escalating fees on each other's ships. This pause lasts for one year and impacts billions in annual fees. The move eases trade tensions between the two economic giants. Ship operators expect reduced costs and improved fin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-xi-agree-to-pause-dueling-port-fees-that-disrupted-trade/articleshow/124980210.cms",
    "timestamp": "2025-10-31T02:23:20Z"
  },
  {
    "title": "These 2 Supreme Court Cases May Affect Future Elections",
    "description": "The country is gearing up for the 2026 midterms, and the stakes are especially high for both allies and opponents of President Donald Trump’s administration.In October, the Supreme Court heard two cases that may impact upcoming elections: one dealing with rac…",
    "link": "https://freerepublic.com/focus/f-news/4349744/posts",
    "timestamp": "2025-10-31T02:22:40Z"
  },
  {
    "title": "Trump administration says members of the military will get paid Friday despite the government shutdown",
    "description": "If the paychecks are delivered, it would be the second time the White House has avoided missing a pay period for troops during the shutdown, now in its 30th day.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-administration-military-members-will-get-paid-friday-shutdown-rcna241031",
    "timestamp": "2025-10-31T02:22:11Z"
  },
  {
    "title": "Van Hollen Claims Trump 'Enjoying the Pain' Imposed on Americans",
    "description": "Thursday on MSNBC's \"All In,\" Sen. Chris Van Hollen (D-MD) claimed President Donald Trump is enjoying withholding SNAP benefits from Americans during the government shutdown.\nThe post Van Hollen Claims Trump ‘Enjoying the Pain’ Imposed on Americans appeared f…",
    "link": "https://www.breitbart.com/clips/2025/10/30/van-hollen-claims-trump-enjoying-the-pain-imposed-on-americans/",
    "timestamp": "2025-10-31T02:20:49Z"
  },
  {
    "title": "China's rare earth export delay offers US chance to weaken Beijing's grip on market",
    "description": "China's pause on new rare earth export curbs provides a year for the US and its allies. This allows them to strengthen their own production and processing. Investments are being made in domestic rare earth industries. Efforts are underway to diversify supply …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/chinas-rare-earth-export-delay-offers-us-chance-to-weaken-beijings-grip-on-market/articleshow/124980133.cms",
    "timestamp": "2025-10-31T02:20:30Z"
  },
  {
    "title": "McFaul: Trump 'Confused' on Difference Between Nuclear Warheads, Delivery Systems",
    "description": "Thursday on CNN's \"The Lead,\" former Obama administration U.S. Ambassador to Russia Michael McFaul called President Donald Trump \"confused\" during a discussion about Trump instructing the Department of War to start testing nuclear weapons.\nThe post McFaul: Tr…",
    "link": "https://www.breitbart.com/clips/2025/10/30/mcfaul-trump-confused-on-difference-between-nuclear-warheads-delivery-systems/",
    "timestamp": "2025-10-31T02:18:09Z"
  },
  {
    "title": "3 ASX 200 stocks storming higher in this week's falling market",
    "description": "Investors sent these three ASX 200 stocks racing higher this week. But why?\nThe post 3 ASX 200 stocks storming higher in this week's falling market appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/10/31/3-asx-200-stocks-storming-higher-in-this-weeks-falling-market/",
    "timestamp": "2025-10-31T02:17:22Z"
  },
  {
    "title": "'They deserve a bright future,' Poilievre says of young Canadians in rebuttal to Carney's pre-budget speech",
    "description": "‘Mr. Carney, the young people in this room and across this country have already sacrificed enough. They have worked hard. They've done everything right,’ the Conservative leader said",
    "link": "https://nationalpost.com/news/politics/they-deserve-a-bright-future-poilievre-says-of-young-canadians-in-rebuttal-to-carneys-pre-budget-speech",
    "timestamp": "2025-10-31T02:15:47Z"
  },
  {
    "title": "Gold rises on bargain hunting and US rate cut, set for monthly gain",
    "description": "Gold prices climbed Friday, nearing a third consecutive monthly gain, driven by bargain hunting and a Federal Reserve rate cut. Investors are processing a tentative U.S.-China trade deal, while global gold demand reached a record high in the third quarter. Th…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-rises-on-bargain-hunting-and-us-rate-cut-set-for-monthly-gain/articleshow/124979983.cms",
    "timestamp": "2025-10-31T02:15:16Z"
  },
  {
    "title": "Illinois State University Teaching Assistant Arrested for Threatening to Kill President Trump",
    "description": "His name is Derek Lopez and he's a 27-year-old teaching assistant at Illinois State University. Ten days ago we had him in our headlines after he was arrested for making an ass of himself by flipping a TPUSA table on campus.WATCH: A teacher assistant at Illin…",
    "link": "https://freerepublic.com/focus/f-news/4349742/posts",
    "timestamp": "2025-10-31T02:13:25Z"
  },
  {
    "title": "South Korea's Lee says global trade order at critical inflection point",
    "description": "GYEONGJU, South Korea (Reuters) -South Korean President Lee Jae Myung said on Friday the Asia-Pacific region was at a critical inflection point with a rapidly changing global economic order, as he chaired a leaders' summit in the city of Gyeongju. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/10/31/south-korea039s-lee-says-global-trade-order-at-critical-inflection-point",
    "timestamp": "2025-10-31T02:13:00Z"
  },
  {
    "title": "Oil heads for third monthly decline as strong dollar, ample supply weigh",
    "description": "Oil prices are falling for the third month. A stronger US dollar is impacting commodity gains. Increased supply from major producers is also a factor. Western sanctions on Russian oil exports are being offset. OPEC+ is considering a modest output boost. Saudi…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-heads-for-third-monthly-decline-as-strong-dollar-ample-supply-weigh/articleshow/124979881.cms",
    "timestamp": "2025-10-31T02:11:41Z"
  },
  {
    "title": "Trump and Xi ease off the trade war, but new nuclear threat brings a chill",
    "description": "President Trump and Xi Jinping reached a yearlong trade truce, de-escalating tariffs and rare earth metal restrictions. However, the meeting was overshadowed by Trump's announcement to restart nuclear weapons testing, amid Russia's own missile and drone tests…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-and-xi-ease-off-the-trade-war-but-new-nuclear-threat-brings-a-chill/articleshow/124979775.cms",
    "timestamp": "2025-10-31T02:09:41Z"
  },
  {
    "title": "Trump pushes for a US-led digital economy that’s free of tariffs",
    "description": "President Trump's trade deals with Asian nations secure assurances against digital services taxes and discrimination against US e-commerce providers. This push aims to maintain America's services surplus by keeping digital trade free of tariffs, contrasting w…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-pushes-for-a-us-led-digital-economy-thats-free-of-tariffs/articleshow/124979529.cms",
    "timestamp": "2025-10-31T02:08:37Z"
  },
  {
    "title": "Prince Andrew stripped of all titles after Virginia Giuffre’s memoir. Her family declares ‘victory’",
    "description": "Nobody’s Girl is Virginia Giuffre’s inside account of the two years she spent as a ‘sex slave’ working for Jeffrey Epstein and co-conspirator Ghislaine Maxwell.",
    "link": "https://theconversation.com/prince-andrew-stripped-of-all-titles-after-virginia-giuffres-memoir-her-family-declares-victory-267751",
    "timestamp": "2025-10-31T02:05:48Z"
  },
  {
    "title": "Wall Street indexes fall as Meta, Microsoft drag, along with Fed rate concerns",
    "description": "Indian markets saw a dip as global cues turned negative. Major US indexes like Nasdaq and S&P 500 declined. Meta and Microsoft shares dropped significantly due to increased artificial intelligence spending. The US Federal Reserve's hawkish tone also impacted …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-fall-as-meta-microsoft-drag-along-with-fed-rate-concerns/articleshow/124979653.cms",
    "timestamp": "2025-10-31T02:05:29Z"
  },
  {
    "title": "Spiraling effects of the shutdown leave lawmakers grasping for ways to end it",
    "description": "America is currently facing a significant government shutdown, leading to severe challenges for everyday citizens. Food supplies are dwindling, and healthcare costs are climbing, placing immense pressure on families. The ripple effect is evident in the travel…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/spiraling-effects-of-the-shutdown-leave-lawmakers-grasping-for-ways-to-end-it/articleshow/124979642.cms",
    "timestamp": "2025-10-31T02:05:17Z"
  },
  {
    "title": "Nuclear curveball: Trump's testing plan raises fears, confusion in Washington",
    "description": "Such a move, if implemented, could end up benefiting adversaries.",
    "link": "https://www.japantimes.co.jp/news/2025/10/31/world/trump-nuclear-testing-curveball/",
    "timestamp": "2025-10-31T02:05:00Z"
  }
]