[
  {
    "title": "Japan’s new PM Takaichi targets 2% military spend by March",
    "description": "Japan''s new Prime Minister Sanae Takaichi pledges to boost military spending and deepen US ties amid rising regional tensions.",
    "link": "https://www.dw.com/en/japans-new-pm-takaichi-targets-2-military-spend-by-march/a-74481595",
    "timestamp": "2025-10-24T09:33:00Z"
  },
  {
    "title": "Premier Li Qiang to visit Singapore as China looks to shore up ties",
    "description": "Premier Li Qiang will arrive in Singapore on Saturday for a two-day visit that the Chinese foreign ministry said aimed to deepen cooperation and reaffirm a...",
    "link": "https://www.yahoo.com/news/articles/premier-li-qiang-visit-singapore-093000628.html",
    "timestamp": "2025-10-24T09:30:00Z"
  },
  {
    "title": "Goodbye, White House. Hello, Trump House.",
    "description": "It turns out that the notion of American exceptionalism actually makes the country more vulnerable to an authoritarian takeover. But it’s not too late to stop Trump’s attempt to consolidate a dictatorship.\nThe post Goodbye, White House. Hello, Trump House. ap…",
    "link": "http://prospect.org/2025/10/24/goodbye-white-house-hello-trump-house/",
    "timestamp": "2025-10-24T09:30:00Z"
  },
  {
    "title": "BCA says U.S.–China trade hopes fade amid new Russia sanctions",
    "description": "Investing.com - U.S. sanctions on Russian energy firms present a headwind for a possible trade agreement between President Donald Trump and Chinese counterpart Xi Jinping later this month, according to BCA Research.\nEarlier this week, Trump announced sanction…",
    "link": "https://biztoc.com/x/30174080e336e426",
    "timestamp": "2025-10-24T09:29:22Z"
  },
  {
    "title": "Binance founder CZ’s presidential pardon is not an acquittal",
    "description": "Binance co-founder Changpeng Zhao's presidential pardon cements criminal conviction without overturning guilt, opening civil liability floodgates while foreclosing appeal options permanently.",
    "link": "https://cointelegraph.com/news/cz-pardon-not-acquittal",
    "timestamp": "2025-10-24T09:25:45Z"
  },
  {
    "title": "Trump heads to Asia to talk trade deal with China's Xi",
    "description": "He's threatened to increase tariffs on Chinese imports 100% if no agreement.",
    "link": "https://abcnews.go.com/Politics/trump-heads-asia-talk-trade-deal-chinas-xi/story?id=126800165",
    "timestamp": "2025-10-24T09:25:08Z"
  },
  {
    "title": "U.S. Military Flew Supersonic B-1 Bombers Up To The Coast Of Venezuela",
    "description": "The move is adding to speculation that President Donald Trump could try to topple Venezuelan President Nicolás Maduro.",
    "link": "https://www.huffpost.com/entry/us-military-b-1-bombers-venezuela_n_68fb4365e4b0bc7dc61f9272",
    "timestamp": "2025-10-24T09:25:01Z"
  },
  {
    "title": "Russia's Oil Giants Get Sanctioned By The US. Will It Hurt The Kremlin's War On Ukraine? (For Now, No)",
    "description": "The war economy that has fueled Russia's all-out assault on Ukraine for 45 months has been funded by Moscow's exports of oil and gas and, critics say, the West's unwillingness - as well as China and India's disinterest - to fully turn off the spigot.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251023-rferl02.htm",
    "timestamp": "2025-10-24T09:24:44Z"
  },
  {
    "title": "Far-right Israeli minister rejects Saudi normalization terms, mocks kingdom to 'keep riding camels'",
    "description": "Far-right Israeli finance minister Bezalel Smotrich has dismissed Saudi Arabia's demand that Tel Aviv must first recognize a Palestinian state as a precondition for normalization, mocking the Arab kingdom by saying they should \"keep riding camels in the deser…",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/10/israel-251023-presstv01.htm",
    "timestamp": "2025-10-24T09:24:44Z"
  },
  {
    "title": "Iran warns IAEA chief: Failed threats will bring nothing but another defeat",
    "description": "Iran's Foreign Minister Abbas Araghchi has warned the head of the UN nuclear agency, Rafael Grossi, against making \"failed threats\" toward Tehran, saying such remarks would bring \"nothing but another defeat.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/10/iran-251023-presstv02.htm",
    "timestamp": "2025-10-24T09:24:44Z"
  },
  {
    "title": "Europe faces pressure to curb surge in cheap Chinese imports",
    "description": "European industries face a challenge from cheap Chinese imports. A German tyre firm highlights the issue, stating Chinese products are often cheaper than local retreads. Businesses and governments, led by France and Italy, urge the European Union to protect l…",
    "link": "https://economictimes.indiatimes.com/news/international/business/europe-faces-pressure-to-curb-surge-in-cheap-chinese-imports/articleshow/124781945.cms",
    "timestamp": "2025-10-24T09:23:12Z"
  },
  {
    "title": "Trump Calls Off San Francisco 'Surge' After Mayor Asks Him 'Very Nicely'",
    "description": "President Donald Trump announced Thursday that he was calling off a surge of federal law enforcement to San Francisco after Mayor Daniel Lurie spoke to him and assured him that \"the future of San Francisco is great.\"\nThe post Trump Calls Off San Francisco ‘Su…",
    "link": "https://www.breitbart.com/politics/2025/10/24/trump-calls-off-san-francisco-surge-after-mayor-asks-him-very-nicely/",
    "timestamp": "2025-10-24T09:20:19Z"
  },
  {
    "title": "Senators eye sanctions vote after Trump targets Russian oil (Politico)",
    "description": "Politico:\nSenators eye sanctions vote after Trump targets Russian oil  —  The bipartisan authors of sweeping Russia sanctions legislation are hoping the Senate is finally ready to consider their bill after President Donald Trump hit Moscow's energy sector wit…",
    "link": "https://www.memeorandum.com/251024/p12",
    "timestamp": "2025-10-24T09:20:01Z"
  },
  {
    "title": "Trump Ripped For 'Snide' Comment To Foreign Reporter He Didn't Understand",
    "description": "The president has done the same before.",
    "link": "https://www.huffpost.com/entry/donald-trump-french-reporter_n_68fb3a8ee4b0bc7dc61f8e8c",
    "timestamp": "2025-10-24T09:19:11Z"
  },
  {
    "title": "Secretary General in Washington highlights support for Ukraine",
    "description": "On 21-22 October 2025, NATO Secretary General Mark Rutte visited Washington D.C. where he met with the President of the United States, Mr Donald J Trump to discuss NATO's support for securing an end to the war against Ukraine and a just and lasting peace.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251023-nato01.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "Security Council Speakers Call for Swift Action to Secure Fragile Peace in Gaza, as Deputy Special Representative Says 'Momentous' Opportunity Must Not Be Lost",
    "description": "\"Don't let the opportunity for Middle East peace slip through our fingers.\" This was the overarching message conveyed by the Security Council today, as delegates discussed the latest developments following the 9 October agreement — based on United States Pres…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251023-unsc01.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "US irked by ICJ ruling demanding Israel facilitate UNRWA aid to Gaza",
    "description": "The US has rebuked a recent ruling by the International Court of Justice (ICJ) obliging Israel to facilitate the entry of aid into the Gaza Strip.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251023-presstv04.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "Hungarians March In Budapest At Rival Political Rallies On Anniversary Of 1956 Revolt",
    "description": "Tens of thousands of people marched in Budapest on October 23 in rival political rallies to mark the anniversary of the 1956 uprising against the communist government that was violently put down by Soviet troops.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251023-rferl01.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "EU Fails To Reach Deal To Use Frozen Russian Assets For Ukraine As Belgium Balks",
    "description": "European Union leaders have stopped short of a deal to use frozen Russian state assets to fund Ukraine, after Belgium - where most of the money is held -- raised legal and technical concerns about the proposal. raised legal and technical concerns about the pr…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251024-rferl01.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "US, EU Ramp Up Sanctions On Key Russian Oil Firms As Trump Cancels Putin Summit",
    "description": "Western countries have ratcheted up pressure on Moscow with sanctions announcements in Washington and Brussels targeting the oil and gas sectors that are key to financing Russia's nearly four-year long full-scale invasion of Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251023-rferl01.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "Indian PM Modi ditches Trump, prepares for ASEAN summit",
    "description": "Indian Prime Minister Narendra Modi has announced that he will virtually attend the Association of Southeast Asian Nations (ASEAN) summit in Kuala Lumpur later this week, ending speculation of a meeting with US President Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-251023-presstv01.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "Trump calls off sending National Guard to U.S. San Francisco",
    "description": "U.S. President Donald Trump on Thursday called off the deployment of the National Guard to San Francisco, the U.S. state of California, in a reversal from his previous remarks.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/10/sec-251024-pdo01.htm",
    "timestamp": "2025-10-24T09:18:31Z"
  },
  {
    "title": "Carville: Trump ‘Collaborators’ Should Be Shaved, Paraded Down PA Ave in Orange Pajamas, Spat on by Public After 2028",
    "description": "Veteran Democrat strategist James Carville spelled out his “fantasy dream” for punishing Trump “collaborators” after the president leaves office in 2029 — he said their heads should be shaved, they should be clad in orange jumpsuits, and then marched down Pen…",
    "link": "https://www.breitbart.com/politics/2025/10/24/carville-trump-collaborators-should-be-shaved-paraded-down-pa-ave-in-orange-pajamas-spat-on-by-public-after-2028/",
    "timestamp": "2025-10-24T09:17:32Z"
  },
  {
    "title": "New York AG Letitia James set to be arraigned on mortgage fraud charges",
    "description": "New York Attorney General Letitia James is scheduled to appear in federal court in Norfolk, Virginia, Friday to be arraigned on charges of alleged mortgage fraud.",
    "link": "https://abcnews.go.com/US/new-york-ag-letitia-james-set-arraigned-mortgage/story?id=126813113",
    "timestamp": "2025-10-24T09:14:46Z"
  },
  {
    "title": "Reagan 1987 address was defence of free but fair trade",
    "description": "(Reuters) -The 1987 radio address by the late former U.S. President Ronald Reagan at the centre of a new U.S.-Canada row was a defence of free but fair trade in which he explained his decision to put duties on Japanese goods in a trade dispute. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/24/reagan-1987-address-was-defence-of-free-but-fair-trade",
    "timestamp": "2025-10-24T09:13:00Z"
  },
  {
    "title": "Air traffic controllers have become reluctant bargaining chips in the government shutdown. They just want to get paid.",
    "description": "America's 13,000 air traffic controllers will soon receive their first $0 paycheck. They hold a delicate power in Washington's government shutdown.",
    "link": "https://www.businessinsider.com/air-traffic-controllers-government-shutdown-bargaining-chips-2025-10",
    "timestamp": "2025-10-24T09:12:01Z"
  },
  {
    "title": "Oh for f**k’s sake, we would never have hyped a Caerphilly by-election if Reform weren’t going to win it",
    "description": "ARE you taking the f**king piss, Wales? You think we’d have bothered covering a by-election in bloody Caerphilly if Reform weren’t going to win?",
    "link": "https://www.thedailymash.co.uk/politics/oh-for-fks-sake-we-would-never-have-hyped-a-caerphilly-by-election-if-reform-werent-going-to-win-it-20251024261406",
    "timestamp": "2025-10-24T09:08:23Z"
  },
  {
    "title": "Trump Reveals First Question He'll Ask Xi Jinping In South Korea Next Week",
    "description": "President Donald Trump is expected to meet with Chinese President Xi Jinping in South Korea next week, White House Press Secretary Karoline Leavitt confirmed on Thursday. \nThis will be the first in-person meeting between the two leaders since Trump’s return t…",
    "link": "https://biztoc.com/x/afb140ff9b9dfe89",
    "timestamp": "2025-10-24T09:06:59Z"
  },
  {
    "title": "Trump likely gets his friend PM Modi a new union with Canada",
    "description": "Canada and India are moving towards improved relations, driven by economic pragmatism and strategic foresight, with Donald Trump's return to the international stage adding urgency. This thaw follows a period of severe diplomatic strain after the killing of Ha…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/canada-india-relations-pm-modi-mark-carney-donald-trump-us-tariffs-international-trade/articleshow/124781418.cms",
    "timestamp": "2025-10-24T09:02:19Z"
  },
  {
    "title": "Binance, CZ Respond To Trump’s Pardon: Expert Calls It The ‘Clearest Case Of Pay-For-Crime’",
    "description": "On Thursday, President Donald Trump granted a pardon to former Binance CEO and co-founder Changpeng Zhao (CZ), following months of speculation and anticipation surrounding this decision.  White House Press Secretary Karoline Leavitt announced the pardon, stat…",
    "link": "https://bitcoinist.com/binance-cz-respond-to-trumps-pardon/",
    "timestamp": "2025-10-24T09:00:55Z"
  },
  {
    "title": "America’s allies are finally paying their fair share for defense. Now they must pay their bills",
    "description": "Foreign governments owe American companies billions in unpaid bills while violating trade agreements, prompting congressional calls for diplomatic action and accountability.",
    "link": "https://www.foxnews.com/opinion/americas-allies-finally-paying-fair-share-defense-now-must-pay-bills",
    "timestamp": "2025-10-24T09:00:51Z"
  },
  {
    "title": "Rob Urie: Democrats Who Created the Bad Status Quo Won’t Become Saviors",
    "description": "The Democrats as a and even the reason US policies are so contrary to the interests of most of the public.",
    "link": "https://www.nakedcapitalism.com/2025/10/rob-urie-democrats-who-created-the-bad-status-quo-wont-become-saviors.html",
    "timestamp": "2025-10-24T09:00:15Z"
  },
  {
    "title": "SEN DICK DURBIN: Democrats fighting to protect healthcare while Trump, Republicans play shutdown games",
    "description": "Healthcare premiums set to skyrocket for millions as ACA tax credits expire, with some Americans facing $600 monthly increases and tough coverage choices.",
    "link": "https://www.foxnews.com/opinion/sen-dick-durbin-democrats-fighting-protect-healthcare-while-trump-republicans-play-shutdown-games",
    "timestamp": "2025-10-24T09:00:11Z"
  },
  {
    "title": "Once roommates, now candidates for governor: Abigail Spanberger and Mikie Sherrill try to lead a Democratic revival | CNN Politics",
    "description": "They were faces of the Democratic resistance, a winning piece of the blue wave, when the party swept control of the House of Representatives in 2018 as a fierce reaction to President Donald Trump’s first two years in office.",
    "link": "https://www.cnn.com/2025/10/24/politics/spanberger-sherrill-virginia-new-jersey-governor-races",
    "timestamp": "2025-10-24T09:00:01Z"
  },
  {
    "title": "Meet RFK’s Corporate Underlings",
    "description": "The administration’s rhetoric about breaking corporate power in health care rings hollow, as several top officials in the Department of Health and Human Services worked for the very corporate interests their boss claims to oppose.\nThe post Meet RFK’s Corporat…",
    "link": "http://prospect.org/2025/10/24/meet-rfks-corporate-underlings/",
    "timestamp": "2025-10-24T09:00:00Z"
  },
  {
    "title": "The GOP expected Democrats to relent on the shutdown by now. That isn't happening.",
    "description": "WASHINGTON — For the 12th time, Senate Democrats blocked the Republican Party's government funding legislation this week without a single senator switching his or her vote",
    "link": "https://www.nbcnews.com/politics/congress/republicans-expected-democrats-cave-shutdown-not-happening-rcna239457",
    "timestamp": "2025-10-24T09:00:00Z"
  },
  {
    "title": "What Happened to America First?",
    "description": "Donald Trump has turned his back on nationalism, but not in favor of internationalism.\nThe post What Happened to America First?  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/10/24/what-happened-to-america-first-trump/",
    "timestamp": "2025-10-24T09:00:00Z"
  },
  {
    "title": "New York Attorney General Letitia James set for arraignment in federal bank fraud case",
    "description": "A grand jury indicted James this month after President Donald Trump called for her to be prosecuted.",
    "link": "https://www.nbcnews.com/politics/justice-department/ny-ag-letitia-james-arraigned-federal-bank-fraud-case-rcna239346",
    "timestamp": "2025-10-24T09:00:00Z"
  },
  {
    "title": "The Gay Conversion Therapy Case and Its Discontents",
    "description": "If the oral arguments earlier this month offer any indication, the Supreme Court will uphold the banned practice—and then some. \nThe post The Gay Conversion Therapy Case and Its Discontents  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/10/24/conversion-therapy-case-supreme-court/",
    "timestamp": "2025-10-24T09:00:00Z"
  },
  {
    "title": "Campaign 2026: As Maine Goes…",
    "description": "The tattooed Graham Platner and a challenger to moderate Jared Golden are roiling their races. How Maine’s unique political tradition shapes these pivotal contests. \nThe post Campaign 2026: As Maine Goes… appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/10/24/graham-platner-jared-golden-maine-political-tradition/",
    "timestamp": "2025-10-24T09:00:00Z"
  },
  {
    "title": "How Giorgia Meloni became Trump's best friend in Europe",
    "description": "A populist whose party has roots in Italian fascism, Italy's leader is trusted by Trump.",
    "link": "https://www.bbc.co.uk/sounds/play/w3ct714t",
    "timestamp": "2025-10-24T09:00:00Z"
  },
  {
    "title": "Why Trump's 'Groundbreaking' Russia Sanctions May Not Deliver Knockout Blow",
    "description": "Donald Trump “is seriously breaking the ice with these measures,” ex-Russian deputy energy minister Vladimir Milov told Newsweek.",
    "link": "https://biztoc.com/x/7c9635520e74a8e2",
    "timestamp": "2025-10-24T08:55:53Z"
  },
  {
    "title": "Canada, let’s stop doubling down on bad bets",
    "description": "Expanding fossil fuel exports won’t secure Canada’s future — it will strand it.",
    "link": "https://www.nationalobserver.com/2025/10/24/opinion/fossil-fuels-economic-future",
    "timestamp": "2025-10-24T08:55:19Z"
  },
  {
    "title": "Who is Merrick Garland? Former US Attorney General who led the DOJ, oversaw high-profile investigations, and signed off on the ‘Arctic Frost’ probe",
    "description": "A Justice Department memo has surfaced, revealing that former Attorney General Merrick Garland and then-FBI Director Christopher Wray personally authorized an FBI probe. This investigation focused on claims that Trump campaign associates attempted to hinder C…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-merrick-garland-former-us-attorney-general-who-led-the-doj-oversaw-high-profile-investigations-and-signed-off-on-the-arctic-frost-probe/articleshow/124781148.cms",
    "timestamp": "2025-10-24T08:50:24Z"
  },
  {
    "title": "Blue State Blues: In Israel, Trump Shows That a Border Works Both Ways",
    "description": "Trump helped Israel defend its boundaries from terror -- but he is also reminding Israel that boundaries set limits to those within, too.\nThe post Blue State Blues: In Israel, Trump Shows That a Border Works Both Ways appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/10/24/blue-state-blues-in-israel-trump-shows-that-a-border-works-both-ways/",
    "timestamp": "2025-10-24T08:47:53Z"
  },
  {
    "title": "Trump Pardons Binance Founder Zhao",
    "description": "Breaking News: Trump Pardons Binance Founder Changpeng Zhao! In a shocking turn of events, former U.S. President Donald Trump has issued a pardon to Changpeng Zhao, the founder of the world’s largest cryptocurrency exchange, Binance. Zhao, also known as “CZ” …",
    "link": "https://nep123.com/trump-pardons-binance-founder-zhao/",
    "timestamp": "2025-10-24T08:47:23Z"
  },
  {
    "title": "WGA warns of Paramount-WBD merger ‘disaster,’ vows to fight any deal",
    "description": "The Writers Guild of America (WGA) has said a merger of Paramount and Warner Bros Discovery (WBD) would be a “disaster” and vowed to work with regulators to prevent any such deal coming to ...",
    "link": "https://www.c21media.net/news/wga-warns-of-paramount-wbd-merger-disaster-vows-to-fight-any-deal/",
    "timestamp": "2025-10-24T08:46:22Z"
  },
  {
    "title": "Trump’s tariffs threatened to destroy the global world order—So why is it still standing?",
    "description": "Trump’s ‘Liberation Day’ tariffs were meant to upend global trade and punish America’s partners. Half a year later, the promised economic turmoil is yet to materialize. Could the White House’s protectionist revolution turn out to be more bluster than a real b…",
    "link": "https://www.livemint.com/opinion/online-views/us-tariffs-global-impact-donald-trump-protectionism-analysis-us-china-trade-war-future-world-trade-organization-imports-11761293144131.html",
    "timestamp": "2025-10-24T08:44:10Z"
  },
  {
    "title": "European shares gain on US-China trade optimism, upbeat earnings",
    "description": "European shares climbed on Friday, as signs of easing U.S.-China trade conflicts and a raft of positive corporate earnings boosted investor sentiment.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-gain-on-us-china-trade-optimism-upbeat-earnings/articleshow/124781181.cms",
    "timestamp": "2025-10-24T08:41:57Z"
  },
  {
    "title": "New Japan PM vows to take US ties to 'new heights' with Trump",
    "description": "TOKYO: Japan's new Prime Minister Sanae Takaichi said on Friday (Oct 24) she will bring United States ties to \"new heights\" in talks with President Donald Trump, while taking a swipe at China and vowi",
    "link": "https://www.channelnewsasia.com/east-asia/japan-pm-sanae-takaichi-us-relations-donald-trump-5422681",
    "timestamp": "2025-10-24T08:36:12Z"
  },
  {
    "title": "Bitcoin Rises on Confirmation of Trump-Xi Meeting",
    "description": "7 min ago\nBitcoin Rises on Confirmation of Trump-Xi Meeting\nBitcoin was rising after the White House confirmed President Donald Trump would meet with China's leader Xi Jinping next week in South Korea.\nThe two leaders will meet on October 30 on the sidelines …",
    "link": "https://biztoc.com/x/a55ca95d623d15f8",
    "timestamp": "2025-10-24T08:33:50Z"
  },
  {
    "title": "Trump says he's terminating all trade negotiations with Canada over an ad featuring Ronald Reagan",
    "description": "President Donald Trump said in a Truth Social post on Thursday night that he was ending trade negotiations with Canada.\nAnna Moneymaker via Getty Images\nPresident Donald Trump said he's halting all trade negotiations with Canada immediately.\nThis was after th…",
    "link": "https://biztoc.com/x/c26adfb5bd0394e3",
    "timestamp": "2025-10-24T08:33:37Z"
  },
  {
    "title": "Trump Admits ‘We’re Just Going To Kill People’ Smuggling Drugs Into America",
    "description": "\"OK? We’re going to kill them, you know, they’re going to be, like, dead. OK.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-vow-killing-people_n_68fb2fcbe4b0bc7dc61f89e9",
    "timestamp": "2025-10-24T08:30:55Z"
  },
  {
    "title": "Dollar steady as traders brace for long-awaited US inflation data",
    "description": "LONDON :The U.S. dollar was steady on Friday, but still on course for a modest weekly gain against major rivals, as investors braced for delayed inflation data that is unlikely to deter the Federal Reserve from lowering interest rates next week.Trade war worr…",
    "link": "https://www.channelnewsasia.com/business/dollar-steady-traders-brace-long-awaited-us-inflation-data-5421991",
    "timestamp": "2025-10-24T08:26:48Z"
  },
  {
    "title": "Trump heads to Asia and high-stakes meeting with Xi",
    "description": "U.S. President Donald Trump embarks on a major trip to Asia this week with all eyes on a meeting with Chinese leader Xi Jinping that has huge implications for the global economy.",
    "link": "https://www.hurriyetdailynews.com/trump-heads-to-asia-and-high-stakes-meeting-with-xi-214982",
    "timestamp": "2025-10-24T08:25:51Z"
  },
  {
    "title": "New Japanese PM promises to increase defence spending as tensions rise with neighbours",
    "description": "Japanese Prime Minister Sanae Takaichi has said in her first speech that defence is a priority for her country as the region experiences uncertainty with Russia, China and North Korea.",
    "link": "https://news.sky.com/story/new-japanese-prime-minister-sanae-takaichi-vows-to-bolsters-defence-spending-13456394",
    "timestamp": "2025-10-24T08:24:00Z"
  },
  {
    "title": "Palestinian teen killed in Israeli raid on West Bank as settlers rampage",
    "description": "Israeli forces kill youth in Nablus in the occupied territory, as settlers destroy property near Ramallah.",
    "link": "https://www.aljazeera.com/news/2025/10/24/palestinian-child-killed-in-israeli-raid-on-west-bank-as-settlers-rampage",
    "timestamp": "2025-10-24T08:23:07Z"
  },
  {
    "title": "Trump says he's terminating all trade negotiations with Canada over an ad featuring Ronald Reagan",
    "description": "\"They only did this to interfere with the decision of the US Supreme Court, and other courts,\" Trump said of the Ontario government's ad.",
    "link": "https://www.businessinsider.com/trump-terminating-trade-talks-canada-over-reagan-ad-2025-10",
    "timestamp": "2025-10-24T08:22:43Z"
  },
  {
    "title": "Trump pardons Binance founder",
    "description": "US President Donald Trump has pardoned Binance founder Changpeng Zhao, who pleaded guilty to money laundering at the crypto exchange in 2023 Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626895-trump-pardon-binance-founder/",
    "timestamp": "2025-10-24T08:22:11Z"
  },
  {
    "title": "Trump, Xi To Meet; US Warns Against West Bank Annexation | Horizons Middle East & Africa 10/24/2025",
    "description": "The White House confirms Donald Trump and Xi Jinping are set to meet on the sidelines of the APEC summit. Also on the show: ...",
    "link": "https://biztoc.com/x/8ba6a6e443b29c65",
    "timestamp": "2025-10-24T08:16:43Z"
  },
  {
    "title": "Polls close after Ireland votes to choose next president",
    "description": "Irish voters headed to the polls to decide who will succeed President Michael D. Higgins after 14 years in office. The contest has narrowed to two women offering sharply different visions. Polling stations across the Republic of Ireland closed on Friday as mo…",
    "link": "https://www.dw.com/en/polls-close-after-ireland-votes-to-choose-next-president/a-74481313",
    "timestamp": "2025-10-24T08:13:00Z"
  },
  {
    "title": "Ireland votes to choose next president",
    "description": "Irish voters have been heading to the polls to decide who will succeed President Michael D. Higgins after 14 years in office. The contest has narrowed to two women offering sharply different visions.",
    "link": "https://www.dw.com/en/ireland-votes-to-choose-next-president/a-74481313",
    "timestamp": "2025-10-24T08:13:00Z"
  },
  {
    "title": "Trump’s Russia sanctions could backfire – former Biden adviser",
    "description": "New US sanctions on Russian oil companies could backfire, according to a former Biden administration energy adviser Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626900-russia-oil-sanctions-backfire/",
    "timestamp": "2025-10-24T08:10:33Z"
  },
  {
    "title": "Here's The Canadian Viral Video That Triggered Trump Into A Full-Blown Meltdown",
    "description": "The president cut off trade talks because of this video.",
    "link": "https://www.huffpost.com/entry/trump-canada-reagan-video_n_68fb2227e4b004dff450aacd",
    "timestamp": "2025-10-24T08:05:48Z"
  },
  {
    "title": "Ley lashed for opposition to environmental reforms by key report author",
    "description": "The man, the opposition leader tasked with reviewing Australia's environment laws back when she was minister, says he is \"bitterly disappointed\" she is pushing back on the reforms.",
    "link": "https://www.abc.net.au/news/2025-10-24/sussan-ley-graeme-samuel-environment-reforms/105932422",
    "timestamp": "2025-10-24T08:02:04Z"
  },
  {
    "title": "Trump’s CZ pardon draws fury from Maxine Waters over ‘pay-to-play’ crypto ties",
    "description": "Representative Maxine Waters sharply criticized President Donald Trump for pardoning Binance co-founder Changpeng Zhao, accusing him of protecting a “crypto criminal” for political gain.",
    "link": "https://cointelegraph.com/news/trump-accused-of-rewarding-crypto-criminals-after-pardoning-binance-s-cz",
    "timestamp": "2025-10-24T08:01:30Z"
  },
  {
    "title": "BNB Reclaims $1,100 As Binance Founder Receives Presidential Pardon – New Rally Coming?",
    "description": "BNB has seen a 5.5% price jump following the White House announcement that Binance co-founder has been pardoned by US President Donald Trump, leading some analysts to suggest that a new leg up might be around the corner. Related Reading: Crypto Market Records…",
    "link": "http://www.newsbtc.com/news/bnb-reclaims-1100-binance-founder-presidential-pardon/",
    "timestamp": "2025-10-24T08:00:38Z"
  },
  {
    "title": "Carney faced with balancing relations with China, U.S. as he departs for summits",
    "description": "Prime Minister Mark Carney is expected to walk an international tightrope over the next week as he departs Friday for a set of Indo-Pacific Summit meetings, one of which involves both the United States and China.",
    "link": "https://www.cbc.ca/news/politics/carney-departs-indo-pacific-summits-9.6951021",
    "timestamp": "2025-10-24T08:00:00Z"
  },
  {
    "title": "The real desecration isn’t in the White House — it’s in America’s newsrooms",
    "description": "Every time a president so much as changes the color of the White House drapes, the press clutches its pearls. Unless the name on the stationery is Barack Obama’s, even routine restoration becomes a national outrage.President Donald Trump’s decision to private…",
    "link": "https://www.theblaze.com/columns/opinion/the-real-desecration-isnt-in-the-white-house-its-in-americas-newsrooms",
    "timestamp": "2025-10-24T08:00:00Z"
  },
  {
    "title": "Can you identify the actual issue Trump is talking about from his ramblings?",
    "description": "DECIPHERING Donald Trump’s stream of consciousness ramblings is increasingly difficult. Can you work out what these statements are actually referring to?",
    "link": "https://www.thedailymash.co.uk/news/international/can-you-identify-the-actual-issue-trump-is-talking-about-from-his-ramblings-20251024261395",
    "timestamp": "2025-10-24T07:59:57Z"
  },
  {
    "title": "What would a Mayor Mamdani mean for American Jews?",
    "description": "If efforts to unite opponents against an antisemitic Democratic Socialist fail, what will be the consequences for Jewish life in New York City or the rest of the country? Opinion.",
    "link": "https://www.israelnationalnews.com/news/416758",
    "timestamp": "2025-10-24T07:57:14Z"
  },
  {
    "title": "Trump tells cattle ranchers to lower prices amid Argentina beef import plan, sparks industry backlash",
    "description": "President Donald Trump urged US cattle ranchers to reduce prices on Truth Social after announcing plans to import more beef from Argentina. The move drew criticism from cattle industry groups and Republican lawmakers concerned about impacts on American ranche…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/trump-tells-cattle-ranchers-to-lower-prices-amid-argentina-beef-import-plan-sparks-industry-backlash/articleshow/124780292.cms",
    "timestamp": "2025-10-24T07:56:03Z"
  },
  {
    "title": "Trump, Anwar scheduled to have bilateral meeting during Asean Summit",
    "description": "KUALA LUMPUR: US President Donald Trump is scheduled to hold an expanded bilateral meeting and signing ceremony with Prime Minister Datuk Seri Anwar Ibrahim during the 47th Asean Summit and Related Summits here on Sunday (Oct 26). Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/24/trump-anwar-scheduled-to-have-bilateral-meeting-during-asean-summit",
    "timestamp": "2025-10-24T07:56:00Z"
  },
  {
    "title": "Timor-Leste PM eager for ‘big announcement’ at 47th Asean summit",
    "description": "SEPANG: Timor-Leste's Prime Minister Kay Rala Xanana Gusmão could barely hide his excitement upon his arrival in Malaysia this afternoon ahead of the much-anticipated 47th Asean Summit. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/24/timor-leste-pm-eager-for-big-announcement-at-47th-asean-summit",
    "timestamp": "2025-10-24T07:52:00Z"
  },
  {
    "title": "Hungary working on how to circumvent U.S. sanctions on Russian oil companies -PM Orban",
    "description": "BUDAPEST (Reuters) -Hungary is working on finding a way to circumvent U.S. sanctions on Russian oil companies, Prime Minister Viktor Orban said on Friday, without giving details but giving no indication that he planned to defy the restrictions. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/24/hungary-working-on-how-to-circumvent-us-sanctions-on-russian-oil-companies--pm-orban",
    "timestamp": "2025-10-24T07:50:00Z"
  },
  {
    "title": "'HEREBY TERMINATED': Trump Scraps All Trade Talks With Canada Over Reagan Ad Criticizing Tariffs",
    "description": "President Donald Trump has decided to terminate all ongoing trade discussions with Canada over an advertisement critical of the tariffs he has imposed on the nation.\nTrade Talks ‘HEREBY TERMINATED’, Says Trump\nThe ad, sponsored by the government of Canada’s p…",
    "link": "https://biztoc.com/x/2c47a1297610f58e",
    "timestamp": "2025-10-24T07:49:09Z"
  },
  {
    "title": "Trump denies allowing Ukraine to launch long-range strikes into Russia",
    "description": "The report by the Wall Street Journal is “FAKE NEWS,” US President Donald Trump has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626898-trump-us-ukraine-tomahawk/",
    "timestamp": "2025-10-24T07:47:58Z"
  },
  {
    "title": "‘Shaved, Pajamaed And Spit On’: Carville Unveils Wild Revenge 'Fantasy' For Trump Collaborators",
    "description": "The Democratic strategist urged making an example of those who have \"bent a knee\" to the president to “discourage future collaborators.\"",
    "link": "https://www.huffpost.com/entry/james-carville-trump-fantasy_n_68fb23efe4b0bc7dc61f8211",
    "timestamp": "2025-10-24T07:47:40Z"
  },
  {
    "title": "Asian shares rise after White House confirms plans for Trump to meet with Chinese leader Xi",
    "description": "Asian shares were mostly higher Friday after the White House confirmed plans for President Donald Trump to meet with Chinese leader Xi Jinping next week. The confirmation reduced some of the uncertainty surrounding trade tensions between the two biggest econo…",
    "link": "https://japantoday.com/category/business/asian-shares-rise-after-white-house-confirms-plans-for-trump-to-meet-with-chinese-leader-xi",
    "timestamp": "2025-10-24T07:45:12Z"
  },
  {
    "title": "Stocks, US Futures Rise Ahead of Inflation Reading: Markets Wrap",
    "description": "European stocks hit a fresh record and US equity futures gained as trade tensions eased ahead of a key inflation reading, while positive earnings continued to support the equity market.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-us-futures-rise-ahead-of-inflation-reading-markets-wrap",
    "timestamp": "2025-10-24T07:41:37Z"
  },
  {
    "title": "Bitcoin, European Stocks Buoyant as Trump-Xi Meeting Confirmed",
    "description": "The impending meeting comes amid escalating trade tensions, with President Trump threatening to impose additional tariffs on China.",
    "link": "https://www.coindesk.com/markets/2025/10/24/bitcoin-buoyant-as-trump-xi-meeting-confirmed",
    "timestamp": "2025-10-24T07:40:00Z"
  },
  {
    "title": "India can switch from Russian crude, but at a cost: Analysts",
    "description": "Indian oil refiners can shift away from Russian crude after US President Donald Trump imposed sanctions on Moscow's two largest oil companies -- but the move will come at a cost, analysts said Friday. Since sanctions were imposed, the company did not comment …",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/india-can-switch-from-russian-crude-but-at-a-cost-analysts/articleshow/124779917.cms",
    "timestamp": "2025-10-24T07:35:49Z"
  },
  {
    "title": "Man wielding knife arrested near U.S. embassy in Tokyo: report",
    "description": "A man wielding a knife was arrested near the U.S. embassy in Tokyo, TBS news reported on Friday. A riot policeman was injured but the extent of his injuries is unknown, the report said, citing police sources. The motive behind the attack was not immediately k…",
    "link": "https://japantoday.com/category/crime/man-wielding-knife-arrested-near-us-embassy-in-tokyo-tbs-news-reports",
    "timestamp": "2025-10-24T07:34:33Z"
  },
  {
    "title": "In Japan and South Korea, Trump will promote big investments, but details still not clear",
    "description": "President Donald Trump is going to Japan and South Korea next week to promote an epic financial windfall — at least $900 billion in investments for U.S. factories, a natural gas pipeline and other projects. Japan and South Korea made those financial commitmen…",
    "link": "https://japantoday.com/category/politics/in-japan-and-south-korea-trump-will-promote-big-investments.-but-the-details-are-still-not-clear",
    "timestamp": "2025-10-24T07:34:24Z"
  },
  {
    "title": "Takaichi, in first policy speech, vows to further bolster defense buildup",
    "description": "Japanese Prime Minister Sanae Takaichi, in her first major policy speech on Friday, pledged to further accelerate Japan’s military buildup and spending and complete an early upgrade of the country's security strategy as tensions rise with China, North Korea a…",
    "link": "https://japantoday.com/category/politics/takaichi-in-first-policy-speech-vows-to-further-bolster-defense-buildup",
    "timestamp": "2025-10-24T07:34:14Z"
  },
  {
    "title": "Trump pardons Binance founder Changpeng Zhao",
    "description": "Zhao was sentenced to four months in prison in 2024 after pleading guilty to violating money laundering laws.",
    "link": "https://www.bbc.com/news/articles/cly1qrl9l1qo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-24T07:32:54Z"
  },
  {
    "title": "China, US 'Can Find Ways To Resolve Concerns' As Negotiators Set To Meet",
    "description": "Beijing and Washington \"can totally find ways to resolve each other's concerns\", China's commerce minister said Friday, as officials from both sides were set to meet in Malaysia for trade talks.",
    "link": "https://www.ibtimes.com/china-us-can-find-ways-resolve-concerns-negotiators-set-meet-3788297",
    "timestamp": "2025-10-24T07:30:14Z"
  },
  {
    "title": "European stocks open higher as earnings buoy sentiment; NatWest shares up 3%",
    "description": "With earnings season well underway, investors will be monitoring a swathe of reports today, including from Natwest, Saab, truckmaker Volvo Group and Porsche.",
    "link": "https://www.cnbc.com/2025/10/24/european-stocks-to-open-higher-as-earnings-buoy-sentiment-.html",
    "timestamp": "2025-10-24T07:28:27Z"
  },
  {
    "title": "Trump says US will expand strikes on ‘narco-terrorists’ to land",
    "description": "President Donald Trump said attacks on alleged ‘narco-terrorists’ do not need a declaration of war or Congress approval.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/10/24/trump-says-us-will-expand-strikes-on-narco-terrorists-to-land",
    "timestamp": "2025-10-24T07:28:26Z"
  },
  {
    "title": "China, US 'can find ways to resolve concerns' as negotiators set to meet",
    "description": "Beijing and Washington \"can totally find ways to resolve each other's concerns\", China's commerce minister said Friday, as officials from both sides were set...",
    "link": "https://www.yahoo.com/news/articles/china-us-ways-resolve-concerns-072703752.html",
    "timestamp": "2025-10-24T07:27:03Z"
  },
  {
    "title": "KL Convention Centre chefs on culinary marathon to feed over 5,000 Asean Summit delegates",
    "description": "KUALA LUMPUR: As regional heavyweights and some of the world's most recognisable leaders, including US President Donald Trump, converge here for the 47th Asean Summit and Related Summits, another equally dedicated team is working tirelessly behind the scenes …",
    "link": "https://www.thestar.com.my/news/nation/2025/10/24/kl-convention-centre-chefs-on-culinary-marathon-to-feed-over-5000-asean-summit-delegates",
    "timestamp": "2025-10-24T07:26:00Z"
  },
  {
    "title": "Crypto M&A surges 30-fold as niche firms shift to mainstream",
    "description": "Crypto M&A skyrockets to over $10 billion, highlighting a shift as niche firms merge into mainstream finance for competitive edge.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-23/crypto-m-a-surges-30-fold-as-niche-firms-shift-to-mainstream",
    "timestamp": "2025-10-24T07:22:12Z"
  },
  {
    "title": "Trump administration to open up Alaska wildlife refuge to drilling",
    "description": "It said the 'sweeping package' would 'boost energy development, modernise land and resource management' in Alaska.",
    "link": "https://www.aljazeera.com/news/2025/10/24/trump-administration-to-open-up-alaska-wildlife-refuge-to-drilling",
    "timestamp": "2025-10-24T07:20:04Z"
  },
  {
    "title": "Gold, silver slip in early trade on profit booking; Yellow metal below Rs 1.24 lakh. Should you buy the dip?",
    "description": "Gold and silver prices declined on Friday amid profit booking and mixed global cues, with MCX gold slipping 0.43% and silver down 0.93%. Despite gains in international markets due to geopolitical tensions and US monetary policy uncertainty, bullion is on trac…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-silver-slip-in-early-trade-on-profit-booking-yellow-metal-below-rs-1-24-lakh-should-you-buy-the-dip/articleshow/124779652.cms",
    "timestamp": "2025-10-24T07:18:29Z"
  },
  {
    "title": "India’s Rise as a Mature Regional Power",
    "description": "India today stands out in South Asia as a model of strategic maturity, a democracy able to handle economic turbulence and regional insecurity without losing focus or direction. In an increasingly polarized world, India is proving that a rising power can balan…",
    "link": "https://english.khabarhub.com/2025/24/502610/",
    "timestamp": "2025-10-24T07:15:49Z"
  },
  {
    "title": "Japan inflation rises as new PM eyes economic package",
    "description": "Japanese inflation accelerated last month, official data showed today, ahead of a maiden policy speech by new Prime Minister Sakae Takaichi who has promised to ease pressure on households.",
    "link": "https://www.rte.ie/news/business/2025/1024/1540331-japanese-inflation-figures/",
    "timestamp": "2025-10-24T07:13:42Z"
  }
]