[
  {
    "title": "Letitia James Indicted On Trump Lackeys' Bullshit Fraud Charges",
    "description": "Even the New York Times seems to have figured out that, oh, I dunno, maybe there's a pattern to these indictments. Via the Times: \nFrom the moment Donald J. Trump began his campaign to return to the White House, he has expressed a clear desire to seek vengean…",
    "link": "https://crooksandliars.com/2025/10/letitia-james-indicted-trump-lackeys",
    "timestamp": "2025-10-10T10:28:17Z"
  },
  {
    "title": "House GOP Finally Feeling The Pressure",
    "description": "The Republican Party has devolved into a circular firing squad as its government shutdown enters its second week, with GOP leaders struggling to stay on message to avoid blame.\nAs Democrats remain unified and steadfast in their assertion that Republicans need…",
    "link": "https://crooksandliars.com/2025/10/house-gop-finally-feeling-pressure",
    "timestamp": "2025-10-10T10:27:37Z"
  },
  {
    "title": "FAFO: Rural Kansas Is Losing A Hospital Due To Trump's Big Ugly Bill",
    "description": "Red states continue to suffer due to Trump's \"Big Ugly Bill\". This time heavily Republican Kansas is losing a much needed rural hospital - and the company that backed out is placing the blame solely on Donald Trump and his nasty ugly bill.\nKOAM News is report…",
    "link": "https://crooksandliars.com/2025/10/fafo-rural-kansas-losing-hospital-due",
    "timestamp": "2025-10-10T10:25:25Z"
  },
  {
    "title": "Blue State Blues: The Nobel Peace Prize Has Been Trash for Decades",
    "description": "The Nobel Peace Prize did not go to President Donald Trump on Friday. That is because he actually worked hard to achieve peace.\nThe post Blue State Blues: The Nobel Peace Prize Has Been Trash for Decades appeared first on Breitbart.",
    "link": "https://www.breitbart.com/national-security/2025/10/10/blue-state-blues-the-nobel-peace-prize-has-been-trash-for-decades/",
    "timestamp": "2025-10-10T10:23:55Z"
  },
  {
    "title": "Nobel peace prize 2025 win for Venezuela's Maria Corina Machado is a big victory for Donald Trump. Here's why",
    "description": "U.S President Donald Trump on Friday missed out Nobel peace prize 2025 as predicted by experts but the win for Venezuelan opposition leader Maria Corina Machado might not disappoint the Republican leader.",
    "link": "https://economictimes.indiatimes.com/news/international/us/nobel-peace-prize-2025-win-for-venezuelas-maria-corina-machado-is-a-big-victory-for-donald-trump-heres-why/articleshow/124451276.cms",
    "timestamp": "2025-10-10T10:23:38Z"
  },
  {
    "title": "Venezuela’s María Corina Machado wins Nobel Peace Prize",
    "description": "VENEZUELA: Venezuelan democracy activist María Corina Machado has been awarded this year’s Nobel Peace Prize. Machado, a prominent opposition leader in Venezuela, has spent much of the time since last year’s presidential election in hiding. This profile by ou…",
    "link": "https://english.khabarhub.com/2025/10/500810/",
    "timestamp": "2025-10-10T10:23:27Z"
  },
  {
    "title": "A World Awaits Blowback as the Nobel Slips From Trump’s Hands",
    "description": "To Donald Trump, the announcement that the Nobel Peace Prize has once again been awarded to someone else risks registering as the latest ignominy in a...",
    "link": "https://finance.yahoo.com/news/world-awaits-blowback-nobel-slips-102201988.html",
    "timestamp": "2025-10-10T10:22:01Z"
  },
  {
    "title": "Qualcomm shares fall after China opens antitrust probe into the U.S. chip giant",
    "description": "Qualcomm has a big business in China selling its smartphone chips to some of the biggest players in the country such as Xiaomi.",
    "link": "https://www.cnbc.com/2025/10/10/qualcomm-shares-today-after-china-opens-antitrust-probe.html",
    "timestamp": "2025-10-10T10:21:41Z"
  },
  {
    "title": "Israel Begins Gaza Pullback As Thousands Head Home",
    "description": "Israeli forces declared a ceasefire and withdrew from some positions in Gaza on Friday, as thousands of displaced Palestinians began to trek home and the families of October 7 hostages awaited news.",
    "link": "https://www.ibtimes.com/israel-begins-gaza-pullback-thousands-head-home-3786456",
    "timestamp": "2025-10-10T10:21:17Z"
  },
  {
    "title": "Shutdown pain ripples through US economy with no deal in sight",
    "description": "As a government shutdown enters its second week, real-world impacts are escalating. Air travel faces significant delays due to staffing shortages, while over a quarter-million federal employees missed paychecks. Food programs and national parks are also feeli…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/shutdown-pain-ripples-through-us-economy-with-no-deal-in-sight/articleshow/124450618.cms",
    "timestamp": "2025-10-10T10:19:52Z"
  },
  {
    "title": "Israel Says Ceasefire Now in Place, Palestinians Return to Gaza",
    "description": "A ceasefire between Israel and Hamas took effect at noon local time Friday (5 a.m. ET).\nThe Israeli military said its troops were withdrawing to pre-agreed positions inside the Gaza Strip.\nThe move followed the Israeli Cabinet’s overnight approval of a U.S.-b…",
    "link": "https://biztoc.com/x/e7c0489029b7934b",
    "timestamp": "2025-10-10T10:19:36Z"
  },
  {
    "title": "IDF Confirms Gaza Ceasefire Is Now In Effect After Withdrawing Troops to Trump Line",
    "description": "Trump-brokered Gaza ceasefire is now in effect, the IDF announced, confirming they'd withdrawn their troops to the initial agreed line.\nThe post IDF Confirms Gaza Ceasefire Is Now In Effect After Withdrawing Troops to Trump Line appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/10/10/idf-confirms-gaza-ceasefire-is-now-in-effect-after-withdrawing-troops/",
    "timestamp": "2025-10-10T10:18:42Z"
  },
  {
    "title": "Netanyahu Tells Israel Ceasefire Vindicates Dual Military, Diplomatic Strategy",
    "description": "Netanyahu, speaking in Hebrew, took the opportunity to claim success for his strategy, against media critics and political opponents\nThe post Netanyahu Tells Israel Ceasefire Vindicates Dual Military, Diplomatic Strategy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/10/10/netanyahu-tells-israel-ceasefire-vindicates-dual-military-diplomatic-strategy/",
    "timestamp": "2025-10-10T10:18:19Z"
  },
  {
    "title": "Marc Spector: Moon Knight in The Daily LITG, 10th of October 2025",
    "description": "A new Moon Knight Series for 2026 was the most-read story on Bleeding Cool yesterday, again, as Marvel is yet to run the PR on that. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Fo…",
    "link": "https://bleedingcool.com/comics/marc-spector-moon-knight-in-the-daily-litg-10th-of-october-2025/",
    "timestamp": "2025-10-10T10:18:04Z"
  },
  {
    "title": "‘Dugna tariff dena hoga’: Memeverse explodes as Donald Trump misses Nobel Peace Prize despite ‘stopping’ wars",
    "description": "Donald Trump's claims of ending wars were met with online mockery after he was overlooked for the 2025 Nobel Peace Prize. The award went to Venezuelan activist Maria Corina Machado, sparking a wave of memes and jokes about Trump's unmet aspirations for the pr…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/dugna-tariff-dena-hoga-memeverse-explodes-as-donald-trump-misses-nobel-peace-prize-despite-stopping-wars/articleshow/124451048.cms",
    "timestamp": "2025-10-10T10:16:51Z"
  },
  {
    "title": "Did Trump pressure the Nobel Peace Committee in his quest for the prestigious prize? Here’s what committee’s chairman Frydnes said on US president",
    "description": "Trump failed to bag the Nobel Peace Prize despite jockeying from his fellow Republicans, various world leaders, and most vocally himself. Opposition activist María Corina Machado of Venezuela was awarded the prize. The Norwegian Nobel Committee said it was ho…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-donald-trump-pressurize-the-nobel-peace-committee-in-his-quest-for-the-prestigious-prize-heres-what-committees-chairman-frydnes-said-on-us-president/articleshow/124450996.cms",
    "timestamp": "2025-10-10T10:14:55Z"
  },
  {
    "title": "EU questions four US platforms over child protection",
    "description": "Amid allegations of insufficient child protection, the European Commission is demanding information from four US platforms. The platforms in question include Apple, Snapchat, Google, and YouTube. Vice-President of the European Commission Henna Virkkunen said …",
    "link": "https://www.dw.com/en/eu-questions-four-us-platforms-over-child-protection/a-74303353",
    "timestamp": "2025-10-10T10:14:00Z"
  },
  {
    "title": "How Canada got immigration right for so long – and then got it very, very wrong",
    "description": "Canadian immigration was stable, popular and uncontroversial. But a series of changes after 2015 broke the national consensus, and the system",
    "link": "https://www.theglobeandmail.com/business/article-how-canada-got-immigration-right-and-then-very-wrong/",
    "timestamp": "2025-10-10T10:13:25Z"
  },
  {
    "title": "Venezuela Opposition Leader Maria Corina Machado Wins Nobel Peace Prize",
    "description": "The Nobel Peace Prize was on Friday awarded to Venezuela's opposition leader and democracy activist Maria Corina Machado, forced to live in hiding in what has become a \"brutal\" state, the Nobel jury said.",
    "link": "https://www.ibtimes.com/venezuela-opposition-leader-maria-corina-machado-wins-nobel-peace-prize-3786451",
    "timestamp": "2025-10-10T10:12:13Z"
  },
  {
    "title": "Trump Gives Update on Possible ‘Peace’ With Iran",
    "description": "President Donald Trump said Thursday that Iran has expressed willingness to participate in wider Middle East peace talks following its support for his ceasefire plan in Gaza.\nCalling the moment a regional breakthrough, Trump declared, “We’ll work with Iran,” …",
    "link": "https://biztoc.com/x/1840769c28b64a5e",
    "timestamp": "2025-10-10T10:08:39Z"
  },
  {
    "title": "MAGA Rages Over Donald Trump Missing Out on Nobel Peace Prize",
    "description": "President Donald Trump's defeat in this year's Nobel Peace Prize has sparked anger within the Make America Great Again (MAGA) movement.\nInstead, Venezuela's opposition leader Maria Corina Machado won on Friday with the committee citing her fight for democracy…",
    "link": "https://biztoc.com/x/5aca0796d56dc898",
    "timestamp": "2025-10-10T10:08:29Z"
  },
  {
    "title": "China opens antitrust probe into Qualcomm over its Autotalks deal",
    "description": "BEIJING (Reuters) -China has launched an antitrust investigation into U.S. semiconductor manufacturer Qualcomm over its acquisition of Israel's Autotalks...",
    "link": "https://ca.news.yahoo.com/china-opens-antitrust-probe-qualcomm-100735174.html",
    "timestamp": "2025-10-10T10:07:35Z"
  },
  {
    "title": "Trump’s crackdown on EVs hits home in the Battery Belt",
    "description": "STANTON, Tenn :Stanton, Tennessee - population 450 - welcomed a massive new neighbor a few years ago: a Ford electric-truck and joint venture battery plant slated to employ 6,000 workers.Ford’s 2022 groundbreaking triggered an influx of construction activity …",
    "link": "https://www.channelnewsasia.com/business/trumps-crackdown-evs-hits-home-in-battery-belt-5394506",
    "timestamp": "2025-10-10T10:06:52Z"
  },
  {
    "title": "Trump's call to prosecute Comey could bolster former FBI director's defense",
    "description": "Former FBI Director James Comey faces charges of false statements and obstruction, pleading not guilty. His defense plans to argue \"vindictive prosecution,\" citing President Trump's public calls for Comey's indictment. This move could set a precedent for othe…",
    "link": "https://economictimes.indiatimes.com/news/defence/trumps-call-to-prosecute-comey-could-bolster-former-fbi-directors-defense/articleshow/124450813.cms",
    "timestamp": "2025-10-10T10:03:26Z"
  },
  {
    "title": "Jimmy Kimmel makes transparently desperate plea to Trump to save his tanking show after audiences vanish",
    "description": "Outspoken Donald Trump critic Jimmy Kimmel said he would 'love' to have the President on his show amid his tumbling ratings. The late night host was discussing his return to the screen after his show was temporarily axed over his comments about the assassinat…",
    "link": "https://freerepublic.com/focus/f-chat/4345424/posts",
    "timestamp": "2025-10-10T10:02:29Z"
  },
  {
    "title": "James Comey’s indictment is a trademark tactic of authoritarians",
    "description": "Authoritarian regimes in history frequently used the courts against their political enemies.",
    "link": "https://www.salon.com/2025/10/10/james-comeys-indictment-is-a-trademark-tactic-of-authoritarians_partner/",
    "timestamp": "2025-10-10T10:00:50Z"
  },
  {
    "title": "Zach Bryan faces country music backlash over 'Bad News' song targeting Trump's ICE operations",
    "description": "Singer Zach Bryan faces backlash from the country music scene after releasing \"Bad News,\" a controversial song criticizing ICE under President Donald Trump's administration.",
    "link": "https://www.foxnews.com/media/zach-bryan-faces-country-music-backlash-over-bad-news-song-targeting-trumps-ice-operations",
    "timestamp": "2025-10-10T10:00:42Z"
  },
  {
    "title": "Crime and immigration divide New Jersey voters after explosive Ciattarelli-Sherrill debate",
    "description": "New Jersey voters are split after the gubernatorial debate between Jack Ciattarelli and Mikie Sherrill, clashing over immigration, sanctuary cities and public safety.",
    "link": "https://www.foxnews.com/media/crime-immigration-divide-new-jersey-voters-after-explosive-ciattarelli-sherrill-debate",
    "timestamp": "2025-10-10T10:00:31Z"
  },
  {
    "title": "Trump Might Get to Send the National Guard Anywhere He Wants",
    "description": "Federal judges have slowed President Trump’s attempts to deploy the National Guard in places like Chicago and Portland. But when the Supreme Court weighs in, there’s a good chance they’ll hand Trump another big win.",
    "link": "http://nymag.com/intelligencer/article/trump-national-guard-portland-chicago-supreme-court.html",
    "timestamp": "2025-10-10T10:00:27Z"
  },
  {
    "title": "US turns to Finland to close Arctic ‘icebreaker gap’ as Russia, China expand polar presence",
    "description": "Finland will provide four new icebreakers to America under a $6.1 billion agreement as the U.S. seeks to strengthen Arctic defense against Russia and China.",
    "link": "https://www.foxnews.com/politics/us-turns-finland-close-arctic-icebreaker-gap-russia-china-expand-polar-presence",
    "timestamp": "2025-10-10T10:00:22Z"
  },
  {
    "title": "Terence Corcoran: Oil man Carney? Let’s not get too captured just yet",
    "description": "Beware the carbon capture 'boondoggle'. Read more from Terence Corcoran",
    "link": "https://financialpost.com/opinion/terence-corcoran-oil-man-carney-lets-not-get-too-captured-just-yet",
    "timestamp": "2025-10-10T10:00:17Z"
  },
  {
    "title": "Venezuela's opposition leader Machado wins Nobel Peace Prize",
    "description": "Venezuelan opposition leader Maria Corina Machado won the Nobel Peace Prize on Friday for promoting democratic rights and fighting dictatorship, receiving the award despite U.S. President Donald Trump's repeated statements he deserved it. Machado, a 58-year-o…",
    "link": "https://japantoday.com/category/world/venezuela%27s-opposition-leader-machado-wins-nobel-peace-prize",
    "timestamp": "2025-10-10T10:00:06Z"
  },
  {
    "title": "Why I created National PrEP Day",
    "description": "October 10 marks the first National PrEP Day, a holiday I created to celebrate something simple and powerful: Prevention works when people can access it. We have the science, the medicine, and the technology to end all new HIV transmissions in the United Stat…",
    "link": "https://www.out.com/voices/national-prep-day-tristan-schukraft",
    "timestamp": "2025-10-10T10:00:04Z"
  },
  {
    "title": "Trump's war on 'antifa' is both buffoonish and sinister",
    "description": "At a bizarre gathering in the White House on Wednesday, President Donald Trump and many of his top aides discussed the alleged horrors of antifa.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-war-antifa-portland-rcna236670",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "License to Kill: Trump’s Extrajudicial Executions",
    "description": "Akela Lacy, Radley Balko, and Nick Turse discuss the administration’s rhetoric and rationale to justify extrajudicial killings abroad — and possibly at home.\nThe post License to Kill: Trump’s Extrajudicial Executions appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/10/10/briefing-podcast-trump-venezuela-boat-strikes/",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "Hold that Nobel Prize: This Peace Plan Will Die, and Bibi Will Kill It",
    "description": "“For years, Netanyahu manipulated\nAmerican Presidents. He tricked Bill Clinton; he swindled Obama; he took Biden\nfor a ride. Now he is trying to con you on Gaza, President Trump.”This is not the opening paragraph of\nthis article, although it very well could b…",
    "link": "https://newrepublic.com/article/201578/israel-hamas-gaza-peace-plan-trump-nobel-prize",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "The Top 5 Longreads of the Week",
    "description": "This week we are featuring stories from Robert Sanchez, Amos Barshad, Mark Dent, Zoya Teirstein, and Caity Weaver.",
    "link": "http://longreads.com/2025/10/10/the-top-5-longreads-of-the-week-582/",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "Don't be lured by image showing Portland protesters 'ICE fishing'",
    "description": "An image authentically showed protesters in Portland, Oregon, dangling donuts on strings in front of Immigration and Customs Enforcement (ICE) officers.",
    "link": "https://www.snopes.com//fact-check/ice-fishing-portland/",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "Beware: A New Creeping Socialism In Government Is Growing",
    "description": "Washington is ominously encroaching more and more on the private sector.",
    "link": "https://www.forbes.com/sites/steveforbes/2025/10/10/beware-a-new-creeping-socialism-in-government-is-growing/",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "Who Gets Away With Crimes Against Humanity?",
    "description": "From Nuremberg to The Hague, the postwar order promised a universal standard of justice. In practice, it has delivered something else: a system that shields the powerful and their allies, and reserves prosecution for poorer, weaker countries. The same states …",
    "link": "https://newrepublic.com/article/201116/crimes-humanity-dictators-nazis-international-justice",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "Trump Is Following in the Footsteps of a Failed English King",
    "description": "The federal government is currently shut down because Congress and President Donald Trump couldn’t agree on a funding measure. Earlier this week, the Trump administration claimed that it would keep funding WIC, a federal nutrition program for low-income famil…",
    "link": "https://newrepublic.com/article/201603/trump-constitution-charles-king-tariffs",
    "timestamp": "2025-10-10T10:00:00Z"
  },
  {
    "title": "US to send 200 troops to Israel to monitor Gaza ceasefire",
    "description": "The US will establish a multinational force in Israel, likely to include troops from Egypt, Qatar, Turkey and the UAE, officials say.",
    "link": "https://www.bbc.com/news/articles/cpvl97r4e8jo",
    "timestamp": "2025-10-10T09:58:12Z"
  },
  {
    "title": "Israeli forces start pulling back from parts of Gaza under cease-fire deal",
    "description": "Israeli troops began pulling back from some parts of Gaza on Friday under a ceasefire deal with Hamas, and some residents returned to shattered neighborhoods amid confusion over when hostilities will be suspended after two years of warfare.",
    "link": "https://nypost.com/2025/10/10/world-news/israeli-forces-start-pulling-back-from-parts-of-gaza-under-ceasefire-deal/",
    "timestamp": "2025-10-10T09:57:29Z"
  },
  {
    "title": "María Corina Machado wins 2025 Nobel Peace Prize",
    "description": "María Corina Machado, a Venezuelan pro-democracy politician, has won the 2025 Nobel Peace Prize, the committee announced Friday. Donald Trump did not win.",
    "link": "https://biztoc.com/x/fcc3fea36a4e3670",
    "timestamp": "2025-10-10T09:57:28Z"
  },
  {
    "title": "DISCUSS: Where Trump Disagrees with Charlie Kirk",
    "description": "An article entitled \"Three Ideas About Forgiveness\" contrasted Erika Kirk's Christian forgiveness of her husband's killer, Donald Trump's rejection of that in favor of the \"pagan ethos of vengeance,\" and the Jewish notion that one must earn forgiveness.  Disc…",
    "link": "https://www.patheos.com/blogs/geneveith/2025/10/discuss-where-trump-disagrees-with-charlie-kirk/",
    "timestamp": "2025-10-10T09:55:54Z"
  },
  {
    "title": "Trump says 'stepping up pressure' to end Ukraine war",
    "description": "President Trump stated that the US and NATO allies are intensifying efforts to end the war in Ukraine, following unsuccessful outreach to Russian President Putin. Despite brokering a Gaza peace deal, Trump acknowledged the Ukraine conflict's greater difficult…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-stepping-up-pressure-to-end-ukraine-war/articleshow/124450566.cms",
    "timestamp": "2025-10-10T09:55:45Z"
  },
  {
    "title": "How Trump's historic Gaza peace deal was brokered at 'command center' inside unlikely million-dollar mansion in Miami...with his son-in-law starring as architect",
    "description": "President Donald Trump's historic peace deal between Israel and Hamas was brokered in a Miami mansion 1,000 miles from the halls of power in Washington D.C. Trump's son-in-law Jared Kushner was in his $32.2million home on Miami's Indian Creek, often referred …",
    "link": "https://freerepublic.com/focus/f-news/4345422/posts",
    "timestamp": "2025-10-10T09:53:44Z"
  },
  {
    "title": "Nobel Chair Defends Decision as He’s Grilled About Trump’s Campaign for Peace Prize",
    "description": "Frydnes pushed back against suggestions that Trump’s public campaign for the Nobel Peace Prize influenced this year’s decision.\nThe post Nobel Chair Defends Decision as He’s Grilled About Trump’s Campaign for Peace Prize first appeared on Mediaite.",
    "link": "https://www.mediaite.com/online/nobel-chair-defends-decision-as-hes-grilled-about-trumps-campaign-for-peace-prize/",
    "timestamp": "2025-10-10T09:53:01Z"
  },
  {
    "title": "Bigg Boss Telugu 9: First evictee Shrasti Verma’s remuneration details spark buzz",
    "description": "Bigg Boss Telugu 9 kicked off with a dual-house setup and an owners vs. tenants theme. Comedian Emmanuel impressed, while Rithu and Demon's romance sparked online. Choreographer Shrasti Verma became the first to be evicted, reportedly earning Rs. 2 lakhs week…",
    "link": "https://timesofindia.indiatimes.com/tv/news/telugu/bigg-boss-telugu-9-first-evictee-shrasti-vermas-remuneration-details-spark-buzz/articleshow/124450417.cms",
    "timestamp": "2025-10-10T09:50:28Z"
  },
  {
    "title": "What the Founders Would Say Now",
    "description": "They might be surprised that the republic exists at all.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/11/founding-fathers-declaration-of-independence-legacy/684329/",
    "timestamp": "2025-10-10T09:50:00Z"
  },
  {
    "title": "Amazon Offers Sneakiest Of Peeks At Its Controversial New 'Melania' Documentary",
    "description": "The film about first lady Melania Trump captures \"critical meetings, private conversations, and never-before-seen environments,\" per the promo blurb.",
    "link": "https://www.huffpost.com/entry/melania-documentary-amazon_n_68e8c823e4b0a9f46d0d1236",
    "timestamp": "2025-10-10T09:49:56Z"
  },
  {
    "title": "Bigg Boss 19: Farhana Bhatt calls Malti Chahar wrong choice for wild card amid major fight",
    "description": "Wild card entry Malti Chahar and Farhana Bhatt engaged in a heated argument after Farhana woke Malti up. The fight escalated with personal insults, leading Malti to request Farhana's eviction. This is not their first clash, as they previously exchanged insult…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-19-farhana-bhatt-calls-malti-chahar-wrong-choice-for-wild-card-amid-major-fight/articleshow/124447407.cms",
    "timestamp": "2025-10-10T09:49:18Z"
  },
  {
    "title": "Debatable: Ousting Maduro",
    "description": "what’s at stake\nThe Trump administration’s military strikes on alleged drug boats off the coast of Venezuela are sparking questions about whether its ultimate goal is regime change, or otherwise nudging new leadership into power in Caracas.\nPresident Donald T…",
    "link": "https://biztoc.com/x/bbfa15ee953db81a",
    "timestamp": "2025-10-10T09:46:36Z"
  },
  {
    "title": "Donald's dream dumped: Trump overlooked for 2025 Nobel Peace Prize, but why?",
    "description": "Donald Trump was not awarded the 2025 Nobel Peace Prize, despite his claims of merit. The award went to Venezuelan activist María Corina Machado for her democratic advocacy. Many of Trump's nominations arrived after the deadline, and his foreign policy achiev…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donalds-dream-dumped-trump-overlooked-for-2025-nobel-peace-prize-but-why/articleshow/124450001.cms",
    "timestamp": "2025-10-10T09:46:18Z"
  },
  {
    "title": "Israeli cabinet approves 'outline' of Trump's Gaza peace plan",
    "description": "US President Donald Trump is one step closer to securing a major diplomatic win in the Middle East, after Israel’s cabinet on Thursday evening approved the “outline” of the deal surrounding the release of hostages held by Hamas.\nUS officials recognize that th…",
    "link": "https://biztoc.com/x/a9fc0a09345277d3",
    "timestamp": "2025-10-10T09:45:58Z"
  },
  {
    "title": "The Case for a 2026 Trump Nobel Peace Prize",
    "description": "Former U.S., Israeli and Palestinian officials tell Newsweek how President Donald Trump may win his long-sought prize.",
    "link": "https://biztoc.com/x/07d58f5464568abe",
    "timestamp": "2025-10-10T09:45:58Z"
  },
  {
    "title": "María Corina Machado wins 2025 Nobel Peace Prize",
    "description": "María Corina Machado, a Venezuelan pro-democracy politician, has won the 2025 Nobel Peace Prize, the committee announced Friday. Donald Trump did not win.",
    "link": "https://www.msnbc.com/top-stories/latest/nobel-peace-prize-2025-winner-machado-trump-rcna236645",
    "timestamp": "2025-10-10T09:45:36Z"
  },
  {
    "title": "Joe Biden Was Always Doomed",
    "description": "The forces that brought him to the brink of contentment were always going to drive him deep into despair.",
    "link": "https://slate.com/news-and-politics/2025/10/joe-biden-kamala-harris-book-trump-legacy.html",
    "timestamp": "2025-10-10T09:45:00Z"
  },
  {
    "title": "Shanghai Masters: Unseeded Arthur Rinderknech ousts Felix Auger-Aliassime to reach semifinals",
    "description": "Arthur Rinderknech, ranked 54th, continued his impressive Shanghai Masters run by defeating seed Felix Auger-Aliassime 6-3, 6-4. He will face either Daniil Medvedev or Alex de Minaur in the semi-finals, following his cousin Valentin Vacherot into the last fou…",
    "link": "https://timesofindia.indiatimes.com/sports/tennis/top-stories/shanghai-masters-unseeded-arthur-rinderknech-ousts-felix-auger-aliassime-to-reach-semifinals/articleshow/124450120.cms",
    "timestamp": "2025-10-10T09:42:41Z"
  },
  {
    "title": "Judge orders restrictions on federal tactics against ICE protesters after Chicago-area pastor shot with pepper balls | CNN",
    "description": "A judge in Illinois has temporarily blocked federal agents from using certain types of force and crowd-control measures against protesters, after video of a pastor being repeatedly shot by pepper balls during a demonstration outside at an ICE facility near Ch…",
    "link": "https://www.cnn.com/2025/10/10/us/illinois-judge-ruling-ice-protests-pastor-chicago-hnk",
    "timestamp": "2025-10-10T09:41:45Z"
  },
  {
    "title": "It’s the Place for Immigrants Who Do Things “the Right Way.” ICE Has Turned It Into Hell.",
    "description": "Immigrants come to court-mandated appointments in search of citizenship. They find masked, armed agents instead.",
    "link": "https://slate.com/news-and-politics/2025/10/ice-deportations-immigration-trump-new-york-city.html",
    "timestamp": "2025-10-10T09:40:00Z"
  },
  {
    "title": "China Opens Antitrust Probe of Qualcomm’s Autotalks Deal",
    "description": "The  State Administration for Market Regulation has opened an antitrust investigation into the takeover of connected-vehicle technology provider Autotalks, a...",
    "link": "https://finance.yahoo.com/news/china-opens-antitrust-probe-qualcomm-093947002.html",
    "timestamp": "2025-10-10T09:39:47Z"
  },
  {
    "title": "Donald Trump had 'no chance' at winning Nobel Peace Prize",
    "description": "Donald Trump has not been awarded the Nobel Peace Prize, and, despite his persistent claim that he \"deserves the prize\", experts are not at all surprised he didn't win.",
    "link": "https://www.abc.net.au/news/2025-10-10/donald-trump-no-chance-at-winning-peace-prize/105878636",
    "timestamp": "2025-10-10T09:39:07Z"
  },
  {
    "title": "Jimmy Kimmel Says He Didn’t See Any ‘Problem’ With Words About Charlie Kirk Murder, Blames ‘Right-Wing Media Networks’ for Backlash",
    "description": "Kimmel complained that the remarks he made regarding the murder of Charlie Kirk had been \"maliciously mischaracterized\" by \"right-wing media networks.\"\nThe post Jimmy Kimmel Says He Didn’t See Any ‘Problem’ With Words About Charlie Kirk Murder, Blames ‘Right-…",
    "link": "https://www.mediaite.com/media/tv/jimmy-kimmel-says-he-didnt-see-any-problem-with-words-about-charlie-kirk-murder-blames-right-wing-media-networks-for-backlash/",
    "timestamp": "2025-10-10T09:38:31Z"
  },
  {
    "title": "US Amb-Designate Sergio Gor to meet government officials, discuss bilateral issues during visit to India",
    "description": "Sergio Gor to travel to India from October 9-14 and meet Indian government counterparts to discuss the wide gamut of India-US ties",
    "link": "https://www.thehindubusinessline.com/news/us-amb-designate-sergio-gor-to-meet-government-officials-discuss-bilateral-issues-during-visit-to-india/article70147413.ece",
    "timestamp": "2025-10-10T09:37:53Z"
  },
  {
    "title": "Breaking: Israel says ceasefire in Gaza has begun",
    "description": "The Israel Defense Forces (IDF) has announced a ceasefire in Gaza has come into force, as of midday local time (8pm AEDT).",
    "link": "https://www.abc.net.au/news/2025-10-10/ceasefire-in-gaza-starts/105879726",
    "timestamp": "2025-10-10T09:36:36Z"
  },
  {
    "title": "Nobel Peace Prize Goes to María Corina Machado, Despite Trump’s Campaign",
    "description": "The Nobel Peace Prize was awards to Venezuelan opposition leader María Corina Machado despite Donald Trump's best efforts to receive it himself.",
    "link": "http://www.rollingstone.com/politics/politics-news/nobel-peace-prize-maria-corina-machado-donald-trump-1235444313/",
    "timestamp": "2025-10-10T09:35:12Z"
  },
  {
    "title": "Nobel Peace Prize awarded to Venezuelan opposition leader María Corina Machado",
    "description": "Win dashes hopes of Donald Trump after US president repeatedly claimed he should be awarded prize",
    "link": "https://biztoc.com/x/5b5a86cc142559ad",
    "timestamp": "2025-10-10T09:35:12Z"
  },
  {
    "title": "Gaza ceasefire agreement ‘now in effect’; UNICEF urgently calls for aid to enter Strip",
    "description": "The Israeli military said on Friday that the Gaza ceasefire agreement went into effect at midday local time (9am GMT).",
    "link": "https://www.independent.ie/world-news/middle-east/gaza-ceasefire-agreement-now-in-effect-unicef-urgently-calls-for-aid-to-enter-strip/a846528435.html",
    "timestamp": "2025-10-10T09:30:00Z"
  },
  {
    "title": "VPA, VLNP voter guide: Democratic nominee for attorney general Jay Jones",
    "description": "The attorney general of Virginia is the state’s chief legal officer, responsible for providing legal advice to the governor and executive agencies, representing the state in court and defending the constitutionality of state laws.",
    "link": "https://richmond.com/news/state-regional/government-politics/elections/article_c0c9727e-6f45-44ae-ba80-f003d8677084.html",
    "timestamp": "2025-10-10T09:30:00Z"
  },
  {
    "title": "Gaza ceasefire agreement ‘now in effect’ as Unicef urgently calls for aid to enter Strip",
    "description": "The Israeli military said on Friday that the Gaza ceasefire agreement went into effect at midday local time (9am GMT).",
    "link": "https://www.independent.ie/world-news/middle-east/gaza-ceasefire-agreement-now-in-effect-as-unicef-urgently-calls-for-aid-to-enter-strip/a846528435.html",
    "timestamp": "2025-10-10T09:30:00Z"
  },
  {
    "title": "How to find and defeat Mother of Thorns in Fortnite",
    "description": "Fortnitemares brings Doja Cat as the formidable Mother of Thorns boss. Players can find her at Freaky Fields, Gourdy Gate, or Supernova Academy, marked by a skull icon. Defeating her yields the Mythic Thorn Ripper and makes her a temporary ally. This mini-bos…",
    "link": "https://timesofindia.indiatimes.com/sports/esports/fortnite/how-to-find-and-defeat-mother-of-thorns-in-fortnite/articleshow/124449311.cms",
    "timestamp": "2025-10-10T09:27:09Z"
  },
  {
    "title": "How to enjoy crackers safely this Diwali without accidents",
    "description": "Diwali's dazzling fireworks bring joy but demand caution. Prioritize safety by buying from reputable sources, using open spaces, and keeping water handy. Protect yourself with non-flammable clothing and goggles. Secure your home by clearing flammable material…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/how-to-enjoy-crackers-safely-this-diwali-without-accidents/articleshow/124449770.cms",
    "timestamp": "2025-10-10T09:26:40Z"
  },
  {
    "title": "Who Is María Corina Machado? Venezuelan Leader Beats Trump to Nobel Peace Prize",
    "description": "Venezuela opposition leader María Corina Machado wins 2025 Nobel Peace Prize, beating Donald Trump.",
    "link": "https://biztoc.com/x/6d817ac994ad4e17",
    "timestamp": "2025-10-10T09:24:00Z"
  },
  {
    "title": "Meet Maria Corina Machado, the Latin American who beat Trump to win the 2025 Nobel Peace Prize",
    "description": "Maria Corina Machado receives the 2025 Nobel Peace Prize. She is honored for her fight for democracy in Venezuela. Machado has long advocated for peaceful change from dictatorship. Her efforts inspired many citizens to monitor elections. The award highlights …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/meet-maria-corina-machado-the-latin-american-who-beat-trump-to-win-the-2025-nobel-peace-prize/articleshow/124449442.cms",
    "timestamp": "2025-10-10T09:22:46Z"
  },
  {
    "title": "Indore: Lokayukta traps Janpad Panchayat CEO; accepts Rs 20,000 bribe",
    "description": "The Ujjain Lokayukta team apprehended Rajesh Soni, the Janpad Panchayat CEO of Tonk Khurd, for accepting a bribe of Rs 20,000. Soni was caught red-handed while receiving the payment from a Rojgar Sahayak who alleged the bribe was demanded for a transfer. The …",
    "link": "https://timesofindia.indiatimes.com/city/indore/indore-lokayukta-traps-janpad-panchayat-ceo-accepts-rs-20000-bribe/articleshow/124449616.cms",
    "timestamp": "2025-10-10T09:21:06Z"
  },
  {
    "title": "Gaza civil defence says Israeli forces pulling back from several areas",
    "description": "Among the districts were Tel al-Hawa and Al-Shati camp, both of which had seen intense Israeli air and ground operations in recent weeks",
    "link": "https://www.euractiv.com/news/gaza-civil-defence-says-israeli-forces-pulling-back-from-several-areas/",
    "timestamp": "2025-10-10T09:20:18Z"
  },
  {
    "title": "US finalises $20 billion economic lifeline for Argentina",
    "description": "US Treasury Secretary Scott Bessent said today that Washington had bought Argentine pesos and finalised a $20 billion economic support programme to help prop up the South American nation's faltering finances.",
    "link": "https://www.rte.ie/news/business/2025/1010/1537860-us-finalises-20-billion-economic-lifeline-for-argentina/",
    "timestamp": "2025-10-10T09:20:09Z"
  },
  {
    "title": "Nobel Snubs Trump After Year of Peacemaking; Award Goes to Venezuelan Opposition Leader",
    "description": "The Nobel Committee announced Friday morning that Venezuelan Opposition Leader Maria Corina Machado is this year’s Nobel Peace Prize winner.\nThe post Nobel Snubs Trump After Year of Peacemaking; Award Goes to Venezuelan Opposition Leader appeared first on Bre…",
    "link": "https://www.breitbart.com/europe/2025/10/10/nobel-snubs-trump-after-year-of-peacemaking-award-goes-to-venezuelan-opposition-leader/",
    "timestamp": "2025-10-10T09:19:55Z"
  },
  {
    "title": "No, Trump Did Not Win the Nobel Peace Prize — Here’s Who Did",
    "description": "The Norwegian Nobel Committee dealt a symbolic rebuke to those who backed President Donald Trump’s late push for the accolade.\nThe post No, Trump Did Not Win the Nobel Peace Prize — Here’s Who Did first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/no-trump-did-not-win-the-nobel-peace-prize-heres-who-did/",
    "timestamp": "2025-10-10T09:16:52Z"
  },
  {
    "title": "North Korea parade: Is Kim Jong Un stronger than ever?",
    "description": "As North Korea celebrates the 80th anniversary of its ruling Workers' Party, Kim's strategy of securing his power with massive nuclear and missile armament seems to have paid off. North Korea is celebrating the 80th anniversary of its ruling Workers' Party on…",
    "link": "https://www.dw.com/en/north-korea-parade-is-kim-jong-un-stronger-than-ever/a-74302970",
    "timestamp": "2025-10-10T09:16:00Z"
  },
  {
    "title": "‘Too big to remain in limbo’: Democrats unveil crypto oversight plan",
    "description": "Will true bipartisan collaboration ever happen, or is crypto regulation caught in a political tug-of-war?",
    "link": "https://ambcrypto.com/too-big-to-remain-in-limbo-democrats-unveil-crypto-oversight-plan/",
    "timestamp": "2025-10-10T09:15:05Z"
  },
  {
    "title": "Nobel Peace Prize not awarded to Trump",
    "description": "Venezuelan opposition leader María Corina Machada awarded the 2025 Nobel Peace Prize, beating out the US President who brokered this weak's ceasefire and hostage deal with Hamas.",
    "link": "https://www.israelnationalnews.com/news/416077",
    "timestamp": "2025-10-10T09:14:00Z"
  },
  {
    "title": "How a family-owned costume shop is keeping tariffs from making Halloween a nightmare",
    "description": "Chicago Costume is adapting to President Trump's tariffs on Chinese imports by repurposing unsold inventory and vintage items. Owner Courtland Hickey ordered fewer new costumes due to increased costs, leading to higher prices for some items and a focus on cre…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-a-family-owned-costume-shop-is-keeping-tariffs-from-making-halloween-a-nightmare/articleshow/124449576.cms",
    "timestamp": "2025-10-10T09:13:59Z"
  },
  {
    "title": "Venezuela opposition leader Maria Corina Machado wins Nobel Peace Prize",
    "description": "The Nobel Peace Prize was on Friday awarded to Venezuela's opposition leader and democracy activist Maria Corina Machado, the Norwegian Nobel Committee said.",
    "link": "https://www.hurriyetdailynews.com/venezuela-opposition-leader-maria-corina-machado-wins-nobel-peace-prize-214532",
    "timestamp": "2025-10-10T09:13:49Z"
  },
  {
    "title": "This is Armenia’s Moment to Build Peace and Prosperity | Opinion",
    "description": "History rarely grants small nations the opportunity to shape not just their own destiny but that of an entire region. For the first time in decades, Armenia has that chance.\nOn August 8, at the White House, Armenia and Azerbaijan signed a joint declaration al…",
    "link": "https://biztoc.com/x/d64e10808be2e72e",
    "timestamp": "2025-10-10T09:13:20Z"
  },
  {
    "title": "Trump, Xi maneuver for leverage as talks, truce expiry loom",
    "description": "Presidents Donald Trump and Xi Jinping are maneuvering for leverage ahead of their upcoming meeting and the expiration of a U.S.-China trade truce, even at the risk of escalating tensions between the world’s two biggest economies.\nChina this week unveiled swe…",
    "link": "https://biztoc.com/x/927242ea73da125b",
    "timestamp": "2025-10-10T09:13:02Z"
  },
  {
    "title": "Venezuela's María Corina Machado wins Nobel Peace Prize",
    "description": "OSLO, NORWAY (AP): Opposition activist María Corina Machado of Venezuela has won the Nobel Peace Prize on Firday (Oct 10). Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/10/venezuela039s-mara-corina-machado-wins-nobel-peace-prize",
    "timestamp": "2025-10-10T09:13:00Z"
  },
  {
    "title": "Ten contenders for the Nobel Peace Prize who are not Donald Trump - France 24",
    "description": "Ten contenders for the Nobel Peace Prize who are not Donald TrumpFrance 24 Norway braces for Trump’s reaction if he does not win Nobel peace prizeThe Guardian The 11th-Hour Campaign to Land Trump a Nobel Peace PrizeThe Wall Street Journal A Trump Nobel Prize?…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179741162",
    "timestamp": "2025-10-10T09:12:52Z"
  },
  {
    "title": "Washington buying stakes in Canadian miners creates national-security dilemma for Ottawa",
    "description": "U.S. President Donald Trump is pursuing annexation by stealth.\nHis government’s decision to take strategic stakes in two Canadian mining companies is about more than Washington securing access to critical minerals. It is also a novel way for Mr. Trump to ratc…",
    "link": "https://biztoc.com/x/b832ca59e450e981",
    "timestamp": "2025-10-10T09:12:48Z"
  }
]