[
  {
    "title": "Pam Bondi hearing devolves into shouting matches with Democrats over Epstein and DOJ prosecutions",
    "description": "Attorney General Pam Bondi lashed out at judges and lawmakers at a contentious House Judiciary Committee hearing on Wednesday that followed reports of President Donald Trump's gripes with her tenure.",
    "link": "https://www.nbcnews.com/politics/justice-department/pam-bondi-hearing-jeffrey-epstein-trump-rcna258522",
    "timestamp": "2026-02-11T17:09:09Z"
  },
  {
    "title": "Trump's Kryptonite just got even more dangerous to handle",
    "description": "This is what we in the business of journalism call a news story.Last week, the Justice Department released a document showing that Mark Epstein submitted a 2023 tip to the FBI stating that he believed President Donald Trump authorized his brother Jeffrey’s mu…",
    "link": "https://www.rawstory.com/raw-investigates/trump-epstein-2675255281/",
    "timestamp": "2026-02-11T17:08:33Z"
  },
  {
    "title": "BREAKING: U.S. Religious Liberty commissioner booted from post",
    "description": "Former Miss California Carrie Prejean Boller has been removed from President Trump’s Religious Liberty Commission.",
    "link": "https://www.ewtnnews.com/world/us/breaking-u-s-religious-liberty-commissioner-booted-from-post",
    "timestamp": "2026-02-11T17:06:52Z"
  },
  {
    "title": "Watch: AG Bondi touts Dow records as furious Dems grill her over Epstein and Trump",
    "description": "Bondi's sworn testimony came after Rep. Jerrold Nadler, D-N.Y., slammed the DOJ for so far failing to indict any Jeffrey Epstein co-conspirators.",
    "link": "https://www.cnbc.com/2026/02/11/trump-pam-bondi-hearing-stock-epstein-judiciary-dow.html",
    "timestamp": "2026-02-11T17:02:16Z"
  },
  {
    "title": "Enes Kanter Freedom Trashes 'Traitor' Eileen Gu: 'Global PR Asset' for China",
    "description": "Blacklisted basketball star Enes Kanter Freedom trashed Olympic skier Eileen Gu as a “traitor” for switching her allegiance to China.\nThe post Enes Kanter Freedom Trashes ‘Traitor’ Eileen Gu: ‘Global PR Asset’ for China appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/02/11/enes-kanter-freedom-trashes-traitor-eileen-gu-global-pr-asset-china/",
    "timestamp": "2026-02-11T17:01:03Z"
  },
  {
    "title": "Good Morning, News: Leach Botanical Garden at Risk, Dems Dodge Indictment, and New Yorkers Defy Trump's Order to Remove Pride Flag From Stonewall Inn",
    "description": "by Courtney Vaughn\n \n \n \n The Mercury provides news and fun every single day—but your help is essential. If you believe Portland benefits from smart, local journalism and arts coverage, please consider making a small monthly contribution, because without you,…",
    "link": "https://www.portlandmercury.com/good-morning-news/2026/02/11/48308195/good-morning-news-leach-botanical-garden-at-risk-dems-dodge-indictment-and-new-yorkers-defy-trumps-order-to-remove-pride-flag-from-stonew",
    "timestamp": "2026-02-11T17:00:00Z"
  },
  {
    "title": "Bondi explodes at Dems on House Judiciary panel in fiery clash: ‘Washed up, loser lawyer’",
    "description": "Attorney General Pam Bondi ripped House Judiciary Committee Ranking Member Jamie Raskin (D-Md.) as a \"washed-up, loser lawyer.\"",
    "link": "https://nypost.com/2026/02/11/us-news/bondi-tears-into-dems-on-house-judiciary-panel-in-fiery-clash-washed-up-loser-lawyer/",
    "timestamp": "2026-02-11T16:59:45Z"
  },
  {
    "title": "Dem lawmaker flags ‘ties’ between Trump and recipient of Epstein ‘torture’ email",
    "description": "Rep. Pramila Jayapal (D-WA) hit Attorney General Pam Bondi hard Wednesday over her agency’s redactions of “powerful predators” in its release of files on Jeffrey Epstein, including one now-infamous email\r\n about a supposed “torture video,” the recipient of wh…",
    "link": "https://www.rawstory.com/trump-2675259474/",
    "timestamp": "2026-02-11T16:59:39Z"
  },
  {
    "title": "Why Joe Exotic’s Post About Epstein Files Is Breaking The Internet",
    "description": "After being sentenced to 20 years in prison, the Tiger King has a loud and clear message for US authorities regarding Epstein's crimes.",
    "link": "https://www.boredpanda.com/why-joe-exotics-post-about-epstein-files-is-breaking-the-internet/",
    "timestamp": "2026-02-11T16:59:07Z"
  },
  {
    "title": "Hailed as a pioneer, Swedish transgender skier at Winter Olympics just wants to focus on sport",
    "description": "Some saw it as a ground-breaking moment for transgender athletes when freestyle skier Elis Lundholm competed at the Winter Olympics. Outsports, an LGBTQ+ sports website, reported before the competition started that Lundholm would become the first openly trans…",
    "link": "https://sports.yahoo.com/articles/hailed-pioneer-swedish-transgender-skier-165823826.html",
    "timestamp": "2026-02-11T16:58:23Z"
  },
  {
    "title": "Comedian Mike Epps Apologizes For Crude Joke About Nicki Minaj & Trump",
    "description": "Comedian Mike Epps issued an Instagram apology to Nicki Minaj after making a crude, sexualized joke about the rapper and Donald Trump last week.",
    "link": "http://www.billboard.com/music/rb-hip-hop/comedian-mike-epps-apologizes-sexual-joke-nicki-minaj-trump-1236178030/",
    "timestamp": "2026-02-11T16:57:53Z"
  },
  {
    "title": "Pam Bondi hearing Epstein files: End of the road for Donald Trump loyalist Attorney General?",
    "description": "Epstein files Pam Bondi hearing: The last time Attorney General Pam Bondi appeared before a congressional panel was in October.",
    "link": "https://economictimes.indiatimes.com/news/international/us/pam-bondi-hearing-epstein-files-end-of-the-road-for-donald-trump-loyalist-attorney-general/articleshow/128217364.cms",
    "timestamp": "2026-02-11T16:56:29Z"
  },
  {
    "title": "Trump, 79, Secretly Asking Aides Why He Can’t Destroy Deal He Negotiated",
    "description": "President Donald Trump has privately asked aides why he shouldn’t withdraw from the USMCA trade pact he negotiated, as the agreement faces a review this...",
    "link": "https://www.thedailybeast.com/trump-79-secretly-asking-aides-why-he-cant-destroy-deal-he-negotiated/",
    "timestamp": "2026-02-11T16:55:41Z"
  },
  {
    "title": "War or Peace? Germany’s Decision-Makers Can’t Decide.",
    "description": "A new podcast features a war game with painful lessons for everyone—except Russia.",
    "link": "http://foreignpolicy.com/2026/02/11/ernstfall-podcast-review-russian-attack-nato-germany-lithuania-baltics-die-welt/",
    "timestamp": "2026-02-11T16:55:17Z"
  },
  {
    "title": "Sparks Fly When Democrat Rep Pramila Jayapal Shouts At Pam Bondi About Epstein Files For 3 Minutes Straight",
    "description": "A hearing descended into chaos on Wednesday while Democratic Washington Rep. Pramila Jayapal shouted at Attorney General Pam Bondi about the Epstein files.",
    "link": "https://dailycaller.com/2026/02/11/rep-jayapal-pam-bondi-epstein-files/",
    "timestamp": "2026-02-11T16:54:52Z"
  },
  {
    "title": "Zelenskiy planning elections in Ukraine and vote on peace deal",
    "description": "Trump administration has pressured Ukrainian leader to hold both votes by May 15 or risk losing security guarantees",
    "link": "https://www.irishtimes.com/world/europe/2026/02/11/zelenskiy-planning-elections-in-ukraine-and-vote-on-peace-deal/",
    "timestamp": "2026-02-11T16:53:27Z"
  },
  {
    "title": "'The View' fans brace themselves for return of guest conservative host Elisabeth Hasselbeck",
    "description": "\"The View\" co-host Joy Behar addresseed backlash and reaction from fans about Elisabeth Hasselbeck returning to \"The View\" as a guest host, and said she was a \"good kid.\"",
    "link": "https://www.foxnews.com/media/the-view-fans-brace-themselves-return-guest-conservative-host-elisabeth-hasselbeck",
    "timestamp": "2026-02-11T16:52:51Z"
  },
  {
    "title": "Trump Tanked Job Growth in 2025 to Basically Nothing",
    "description": "It’s official: the jobless boom of Donald Trump’s first year back in office was even worse than we originally thought. A jobs report published Wednesday by the Bureau of Labor Statistics contained significant downward revisions for the already weak job growth…",
    "link": "https://newrepublic.com/post/206460/donald-trump-job-growth-2025",
    "timestamp": "2026-02-11T16:45:35Z"
  },
  {
    "title": "Indiana quietly bans trans residents from changing gender markers on IDs",
    "description": "The Indiana Bureau of Motor Vehicles has quietly banned residents from changing their gender markers on state identification documents.",
    "link": "https://www.advocate.com/politics/indiana-gender-marker-change-ban",
    "timestamp": "2026-02-11T16:44:35Z"
  },
  {
    "title": "Ilhan Omar suggests Trump should be 'executed' after he says he will pursue Somali fraud cases in Minnesota",
    "description": "Minnesota Rep. Ilhan Omar posted on X to suggest that President Donald Trump should be executed. She shared a clip of an interview with Trump on Fox News with the caption \"The leader of the Pedophile Protection Party is trying to deflect attention from his na…",
    "link": "https://freerepublic.com/focus/f-bloggers/4366434/posts",
    "timestamp": "2026-02-11T16:41:09Z"
  },
  {
    "title": "Woman had argued with father in Texas over Trump before deadly shooting: UK investigation",
    "description": "Lucy Harrison, 23, was allegedly shot dead by father in Texas after President Donald Trump argument. Grand jury declined to indict, but the U.K. inquest is ongoing.",
    "link": "https://www.foxnews.com/us/woman-had-argued-father-texas-over-trump-before-deadly-shooting-uk-investigation",
    "timestamp": "2026-02-11T16:40:53Z"
  },
  {
    "title": "Grand Jury Refuses To Indict ‘Seditious Six’ Democrats Over ‘Illegal Orders’ Video",
    "description": "A DC grand jury declined to indict six Democratic lawmakers over a video urging military and intelligence officials to reject unlawful orders.",
    "link": "https://dailycaller.com/2026/02/11/jeanine-pirro-mark-kelly-sedition-military-illegal-orders-video-grand-jury/",
    "timestamp": "2026-02-11T16:40:04Z"
  },
  {
    "title": "‘Nobody’s Gonna Rain on My Parade!’ CNBC’s Rick Santelli Laughs at Trump ‘Naysayers’ After Big Jobs Report",
    "description": "Rick Santelli busted out an umbrella and a custom designed hat to celebrate Trump's economy following a much stronger-than-expected jobs report.\nThe post ‘Nobody’s Gonna Rain on My Parade!’ CNBC’s Rick Santelli Laughs at Trump ‘Naysayers’ After Big Jobs Repor…",
    "link": "https://www.mediaite.com/media/nobodys-gonna-rain-on-my-parade-cnbcs-rick-santelli-laughs-at-trump-naysayers-after-big-jobs-report/",
    "timestamp": "2026-02-11T16:39:41Z"
  },
  {
    "title": "Don Lemon hires surprising attorney, an ex-Trump appointee prosecutor who exposed massive Minnesota fraud case",
    "description": "Joe Thompson, who was the lead prosecutor that helped uncover the massive $250 million fraud case tied to the state's Somali community, joins Don Lemon’s legal team.",
    "link": "https://www.foxnews.com/media/don-lemon-hires-surprising-attorney-ex-trump-appointee-prosecutor-who-exposed-massive-minnesota-fraud-case",
    "timestamp": "2026-02-11T16:39:09Z"
  },
  {
    "title": "US Energy Secretary Chris Wright visits Venezuela to assess oil industry overhaul",
    "description": "The U.S. government steps deeper into Venezuela’s oil overhaul as Energy Secretary Chris Wright visits to assess the industry",
    "link": "https://abcnews.com/US/wireStory/us-energy-secretary-chris-wright-visits-venezuela-assess-130064825",
    "timestamp": "2026-02-11T16:37:46Z"
  },
  {
    "title": "214 House Republicans Just Tried to Give 'Mad King' Trump Even More Tariff Powers",
    "description": "Republicans in the US House on Tuesday tried—and narrowly failed—to advance a measure containing language that would have temporarily blocked votes on resolutions disapproving of President Donald Trump’s tariffs.Democrats voted unanimously to defeat the measu…",
    "link": "https://www.commondreams.org/news/trump-tariffs-house-vote",
    "timestamp": "2026-02-11T16:36:21Z"
  },
  {
    "title": "‘FAR GREATER THAN EXPECTED!’ Trump Takes Victory Lap After Jobs Report Shows Hiring Jump",
    "description": "TRUMP hailed the numbers as “FAR GREATER THAN EXPECTED” as he declared that “the Golden Age of America is upon us!!!”\nThe post ‘FAR GREATER THAN EXPECTED!’ Trump Takes Victory Lap After Jobs Report Shows Hiring Jump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/far-greater-than-expected-trump-takes-victory-lap-after-jobs-report-shows-hiring-jump/",
    "timestamp": "2026-02-11T16:36:17Z"
  },
  {
    "title": "“The Tide Is Turning”: Democratic Military Vets Respond to Trump’s Failure to Indict Them",
    "description": "In a humiliating loss for the Justice Department, a federal grand jury on Tuesday refused to indict Democratic lawmakers who made a video reminding members of the military and intelligence community that they can refuse to carry out illegal orders. The six De…",
    "link": "https://www.motherjones.com/politics/2026/02/doj-pirro-trump-kelly-slotkin-crow-military/",
    "timestamp": "2026-02-11T16:35:57Z"
  },
  {
    "title": "Trump administration withholding public health funding for Illinois and other Democratic-led states",
    "description": "President Donald Trump's administration plans to withhold public health and transportation funds from several Democratic-led states, including Illinois.",
    "link": "https://www.cbsnews.com/chicago/news/trump-public-health-funding-illinois-democratic-states/",
    "timestamp": "2026-02-11T16:34:59Z"
  },
  {
    "title": "Rahul Gandhi slams Indo-US trade deal, FM Sitharaman rebuts sharply",
    "description": "Rahul Gandhi alleges India 'surrendered' in US trade pact; Centre rejects charge, says no one can sell or buy the country",
    "link": "https://www.business-standard.com/india-news/rahul-gandhi-slams-indo-us-trade-deal-fm-sitharaman-rebuts-sharply-126021101743_1.html",
    "timestamp": "2026-02-11T16:34:06Z"
  },
  {
    "title": "Twilio co-founder’s fusion power startup raises $450M from Bessemer and Alphabet’s GV | TechCrunch",
    "description": "Inertia Enterprises will use the Series A investment to build one of the world's most powerful lasers, a key part of its power plant design.",
    "link": "https://techcrunch.com/2026/02/11/twilio-co-founders-fusion-power-startup-raises-450m-from-bessemer-and-alphabets-gv/",
    "timestamp": "2026-02-11T16:34:04Z"
  },
  {
    "title": "NATO launches new 'Arctic Sentry' mission",
    "description": "NATO has set sail on a fresh mission aimed at reinforcing security protocols in the Arctic, a region of great strategic significance. With fears surrounding Russia’s military presence and China’s expanding ambitions, this initiative amplifies the alliance’s p…",
    "link": "https://economictimes.indiatimes.com/news/defence/nato-launches-new-arctic-sentry-mission/articleshow/128216459.cms",
    "timestamp": "2026-02-11T16:33:28Z"
  },
  {
    "title": "How Social Security Fairness Act payments may affect beneficiaries this tax season",
    "description": "The Social Security Fairness Act provided more than 2.8 million beneficiaries with higher payments. Here's what to know about reporting that income to the IRS.",
    "link": "https://www.cnbc.com/2026/02/11/social-security-fairness-act-taxes.html",
    "timestamp": "2026-02-11T16:32:08Z"
  },
  {
    "title": "Larry Donnelly: The hard edge of Trump’s immigration policy now tests Irish America",
    "description": "As deportations loom and enforcement intensifies, Irish America faces a defining question — what happens when one of its own is swept up?",
    "link": "https://www.thejournal.ie/readme/seamus-culleton-6953710-Feb2026/",
    "timestamp": "2026-02-11T16:31:33Z"
  },
  {
    "title": "‘I’m Not Going to Get in the Gutter With This Woman!’ Pam Bondi and Democrat Throw Down Over Epstein",
    "description": "Attorney General Pam Bondi declared she was not going to \"get in gutter\" with Pramila Jayapal during a heated exchange on Jeffrey Epstein.\nThe post ‘I’m Not Going to Get in the Gutter With This Woman!’ Pam Bondi and Democrat Throw Down Over Epstein first appe…",
    "link": "https://www.mediaite.com/media/tv/im-not-going-to-get-in-the-gutter-with-this-woman-pam-bondi-and-democrat-throw-down-over-epstein/",
    "timestamp": "2026-02-11T16:30:54Z"
  },
  {
    "title": "Week of Feb. 2 Evening News Ratings: World News Tonight Leads",
    "description": "NBC's Nightly News was the only broadcast with viewership gains in both measured categories.",
    "link": "https://www.adweek.com/tvnewser/week-of-feb-2-2026-evening-news-ratings/",
    "timestamp": "2026-02-11T16:30:52Z"
  },
  {
    "title": "WATCH LIVE: Slotkin, Kelly speak after grand jury refuses to charge them over 'illegal orders' video",
    "description": "A grand jury in Washington refused Tuesday to indict Democratic lawmakers in connection with a video in which they urged U.S. military members to resist \"illegal orders,\" according to a person familiar with the matter.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-slotkin-kelly-speak-after-grand-jury-refuses-to-charge-them-over-illegal-orders-video",
    "timestamp": "2026-02-11T16:30:30Z"
  },
  {
    "title": "National Guard troops were quietly withdrawn from some U.S. cities (Washington Post)",
    "description": "Washington Post:\nNational Guard troops were quietly withdrawn from some U.S. cities  —  The deployments encountered repeated legal setbacks that stymied President Donald Trump's show of force in Los Angeles, Chicago and Portland, Oregon.  —  The Trump adminis…",
    "link": "https://www.memeorandum.com/260211/p59",
    "timestamp": "2026-02-11T16:30:01Z"
  },
  {
    "title": "'Seditious' Democrats react to grand jury indictment decision",
    "description": "Months after President Trump called for the arrest of the \"seditious\" Democrats who called on military and intelligence personnel to \"refuse illegal orders\" from the administration, federal prosecution efforts led by D.C. U.S. Attorney Jeanine Pirro have hit …",
    "link": "https://www.theblaze.com/news/seditious-democrats-react-to-grand-jury-indictment-decision",
    "timestamp": "2026-02-11T16:30:00Z"
  },
  {
    "title": "When will Bitcoin start a new bull cycle toward $150K? Look for these signs",
    "description": "Bitcoin price could still reach $150,000 by year-end, but several things must happen for BTC price to find its technical footing and spark a new bull run.",
    "link": "https://cointelegraph.com/news/when-will-bitcoin-start-a-new-bull-cycle-toward-150k-look-for-these-signs",
    "timestamp": "2026-02-11T16:30:00Z"
  },
  {
    "title": "Indian Refiners Urged to Buy More U.S. and Venezuela Oil",
    "description": "India’s government has asked refiners to consider buying more crude cargoes from the U.S. and Venezuela on the spot market as Indian oil purchases are under scrutiny following the trade deal with the United States.  Indian refiners are steering clear of Russi…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Indian-Refiners-Urged-to-Buy-More-US-and-Venezuela-Oil.html",
    "timestamp": "2026-02-11T16:30:00Z"
  },
  {
    "title": "Lawmaker rips Pam Bondi in scathing opening: 'You're running a massive Epstein cover-up'",
    "description": "Rep. Jamie Raskin (D-MD) Wednesday delivered a scathing opening statement and directly criticized Attorney General Pam Bondi, accusing her of deliberately blocking the investigation into late financier and convicted child sex offender Jeffrey Epstein. Raskin,…",
    "link": "https://www.rawstory.com/lawmaker-rips-pam-bondi-in-scathing-opening-you-re-running-a-massive-epstein-cover-up/",
    "timestamp": "2026-02-11T16:26:07Z"
  },
  {
    "title": "Novo Nordisk CEO sees 15 million-patient opportunity in Medicare coverage for obesity drugs",
    "description": "Doustdar said Medicare coverage and the launch of Novo's new obesity pill should help gradually boost prescription volumes and offset lower prices in the U.S.",
    "link": "https://www.cnbc.com/2026/02/11/novo-nordisk-ceo-medicare-coverage-opens-15-million-patient-opportunity.html",
    "timestamp": "2026-02-11T16:25:09Z"
  },
  {
    "title": "'B---h, Are You High?': Joe Rogan Blasts Former Podcast Guest Who Tried Introducing Him to Vile Pedo Jeffrey Epstein",
    "description": "Joe Rogan blasted a former podcast guest who tried introducing him to Jeffrey Epstein asking if they were 'high.'",
    "link": "https://radaronline.com/p/joe-rogan-jeffrey-epstein-podcast-guest-who-tried-introducing-them-blasted/",
    "timestamp": "2026-02-11T16:24:57Z"
  },
  {
    "title": "Nancy Guthrie Case New Note Demands 1 Bitcoin to Rat Out Suspect",
    "description": "There's a new note in the Nancy Guthrie case, but this one doesn't seem to be from the kidnapper ... instead, it's from someone offering to give up information on the kidnapper. TMZ received the note just before 5 AM PT, and the sender claims they've tried un…",
    "link": "https://freerepublic.com/focus/f-chat/4366432/posts",
    "timestamp": "2026-02-11T16:23:54Z"
  },
  {
    "title": "‘Ouch!’: Chris Cillizza Breaks Down Brutal New Poll For Trump",
    "description": "Chris Cillizza said a poll by Rasmussen Reports comparing Donald Trump's presidency to Joe Biden's would likely upset him.",
    "link": "https://dailycaller.com/2026/02/11/ouch-chris-cillizza-breaks-down-brutal-new-poll-for-trump/",
    "timestamp": "2026-02-11T16:22:28Z"
  },
  {
    "title": "House to vote on Trump bid for tough voter-ID SAVE Act",
    "description": "The SAVE America Act's GOP supporters say it would secure elections and prevent fraud. Democrats say it could disenfranchise millions.",
    "link": "https://www.cnbc.com/2026/02/11/trump-save-act-house-voter-id.html",
    "timestamp": "2026-02-11T16:22:03Z"
  },
  {
    "title": "New TVA board under Trump eliminates DEI, renewable energy from utility goals | Chattanooga Times Free Press",
    "description": "A new era began for the Tennessee Valley Authority on Wednesday as a board with members chosen by President Donald Trump in his second term rapidly reversed goals set under the former Biden administration.",
    "link": "https://www.timesfreepress.com/news/2026/feb/11/new-tva-board-under-trump-eliminates-dei/",
    "timestamp": "2026-02-11T16:21:58Z"
  },
  {
    "title": "Kid Rock fires back at 'haters and fake news' over lip-sync claims from Turning Point halftime performance",
    "description": "Kid Rock addresses production glitch that made his performance appear out of sync at Turning Point USA event, calling out \"fake news\" spreading online.",
    "link": "https://www.foxnews.com/entertainment/kid-rock-fires-back-haters-fake-news-over-lip-sync-claims-from-turning-point-halftime-performance",
    "timestamp": "2026-02-11T16:21:57Z"
  },
  {
    "title": "Tillis rips 'political lawfare' and praises grand jury after Dems avoid charges in ‘illegal orders’ case",
    "description": "Sen. Thom Tillis, R-N.C., again broke with the Trump administration and praised a grand jury's decision against indicting six congressional Democrats.",
    "link": "https://www.foxnews.com/politics/tillis-rips-political-lawfare-praises-grand-jury-after-dems-avoid-charges-illegal-orders-case",
    "timestamp": "2026-02-11T16:21:23Z"
  },
  {
    "title": "Ukraine official denies any plans to announce elections as war rages",
    "description": "An adviser to Ukraine's leader says there's been \"no change in the negotiations\" that would lead to an announcement of elections in the coming weeks.",
    "link": "https://www.cbsnews.com/news/ukraine-russia-war-zelenskyy-no-plan-for-elections-despite-trump-pressure/",
    "timestamp": "2026-02-11T16:19:05Z"
  },
  {
    "title": "Be Evil!",
    "description": "Google continues to hold up to its initial slogan of “Don’t Be Evil”: Google fulfilled an Immigration and Customs Enforcement subpoena that demanded a wide array of personal data on a student activist and journalist, including his credit card and bank account…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/be-evil",
    "timestamp": "2026-02-11T16:17:00Z"
  },
  {
    "title": "'Terrifying' actions of ICE agents must be raised by Martin with Trump, MEP Maria Walsh says",
    "description": "Walsh said Micheál Martin has to ‘absolutely’ raise the case of Kilkenny man Seamus Culleton next month.",
    "link": "https://www.thejournal.ie/trump-seamus-culleton-6953409-Feb2026/",
    "timestamp": "2026-02-11T16:15:36Z"
  },
  {
    "title": "NATO begins 'Arctic Sentry' mission to secure region",
    "description": "Through the \"Arctic Sentry\" mission, NATO is bolstering its military presence in the Arctic in an effort to de-escalate the conflict over Greenland.",
    "link": "https://www.dw.com/en/nato-begins-arctic-sentry-mission-to-secure-region/a-75912376",
    "timestamp": "2026-02-11T16:15:00Z"
  },
  {
    "title": "Trump excludes gay and Black governors from White House dinner",
    "description": "President Donald Trump decided earlier this month that invitations to a traditional dinner at the White House during the National Governors Association winter gathering, scheduled to take place in D.C. from Feb 19 – 21, would only go to Republicans – excludin…",
    "link": "https://www.thepinknews.com/2026/02/11/trump-excludes-gay-and-black-governors-from-white-house-dinner/",
    "timestamp": "2026-02-11T16:12:24Z"
  },
  {
    "title": "Live: Netanyahu meets Trump at the White House",
    "description": "Prime Minister Benjamin Netanyahu meets at the White House with US President Donald Trump for the seventh time since the president was inaugurated. At the center of the discussions: Iran.",
    "link": "https://www.israelnationalnews.com/news/422286",
    "timestamp": "2026-02-11T16:06:00Z"
  },
  {
    "title": "Israel reviewing options for disarming Hamas by FORCE",
    "description": "'Should hostilities renew, fighting is liable to be more intense and more widespread than previous rounds, as Israeli forces will no longer constrained by the presence of hostages on Gazan soil'",
    "link": "https://www.wnd.com/2026/02/israel-reviewing-options-disarming-hamas-force/",
    "timestamp": "2026-02-11T16:04:48Z"
  },
  {
    "title": "'Disgusting behavior': JD Vance responds to calls for Howard Lutnick to resign",
    "description": "Vice President JD Vance responded to calls for Commerce Secretary Howard Lutnick to resign by observing that powerful people were guilty of \"disgusting behavior\" related to their relationships with sex offender Jeffrey Epstein.After Lutnick admitted that he d…",
    "link": "https://www.rawstory.com/vance-lutnick-epstein/",
    "timestamp": "2026-02-11T16:02:58Z"
  },
  {
    "title": "MICHAEL GREIBROK And SOFIA DE VITO: Ending The Welfare Welcome Mat In Immigration",
    "description": "America used to be a magnet for the world’s entrepreneurs and innovators. But today, American immigration is better known for record illegal border crossings",
    "link": "https://dailycaller.com/2026/02/11/opinion-ending-the-welfare-welcome-mat-in-immigration-michael-greibrok-and-sofia-de-vito/",
    "timestamp": "2026-02-11T16:01:05Z"
  },
  {
    "title": "Economy Adds 130,000 in January, Most Since December 2024",
    "description": "However, the report shows the U.S. only added 181,000 jobs in 2025.\nThe post Economy Adds 130,000 in January, Most Since December 2024 first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/economy-adds-130000-in-january-most-since-december-2024/",
    "timestamp": "2026-02-11T16:00:35Z"
  },
  {
    "title": "China Warns Taiwan Of “Annihilation” If ATACMS Are Deployed",
    "description": "China has warned Taiwan that it will be annihilated if the United States supplies ATACMS (Army Tactical Missile System) is deployed for use. Beijing warned Taiwan specifically against using HIMARS (High Mobility Artillery Rocket System) launchers armed with A…",
    "link": "https://www.shtfplan.com/war/china-warns-taiwan-of-annihilation-if-atacms-are-deployed",
    "timestamp": "2026-02-11T16:00:22Z"
  },
  {
    "title": "Tom Ultican: Leave Trans Kids Alone!",
    "description": "Tom Ultican, retired teacher of advanced mathematics and physics, insisted that the war on trans athletes should stop. In his view, the widely publicized debate about letting them participate on high school and college teams is a bogus issue. He writes: With …",
    "link": "https://dianeravitch.net/2026/02/11/tom-ultican-leave-trans-kids-alone/",
    "timestamp": "2026-02-11T16:00:00Z"
  },
  {
    "title": "Pelosi endorses JFK's grandson in Democratic House primary",
    "description": "Former House Speaker Nancy Pelosi endorsed the grandson of the late President John F. Kennedy, Jack Schlossberg, who is running for a House seat.",
    "link": "https://www.foxnews.com/politics/pelosi-endorses-jfks-grandson-democratic-house-primary",
    "timestamp": "2026-02-11T15:59:04Z"
  },
  {
    "title": "‘How SICK Is That!?’ Jamie Raskin EXPLODES on Pam Bondi Over ‘Epstein Cover-Up’ and More in Scorching Opening Statement",
    "description": "Rep. Jamie Raskin went absolutely nuts on Pam Bondi for \"ignoring\" victims of Jeffrey Epstein and leading a \"massive Epstein cover-up\"\nThe post ‘How SICK Is That!?’ Jamie Raskin EXPLODES on Pam Bondi Over ‘Epstein Cover-Up’ and More in Scorching Opening State…",
    "link": "https://www.mediaite.com/politics/how-sick-is-that-jamie-raskin-explodes-on-pam-bondi-over-epstein-cover-up-and-more-in-scorching-opening-statement/",
    "timestamp": "2026-02-11T15:58:00Z"
  },
  {
    "title": "Despite Birth Rate Concerns, GOP Stays Laser-Focused On Helping Men Become More Repulsive To Women",
    "description": "And in so many ways!",
    "link": "https://www.wonkette.com/p/despite-birth-rate-concerns-gop-stays",
    "timestamp": "2026-02-11T15:57:14Z"
  },
  {
    "title": "US lawmakers grill attorney general over Epstein file release",
    "description": "\"You're running a massive Epstein cover-up right out of the Department of Justice,\" said Jamie Raskin, the ranking Democrat on the House Judiciary Committee.\n\n\"You've been ordered by subpoena and by Congress to turn over six million documents, photographs and…",
    "link": "https://www.france24.com/en/live-news/20260211-us-lawmakers-grill-attorney-general-over-epstein-file-release",
    "timestamp": "2026-02-11T15:55:14Z"
  },
  {
    "title": "What’s Next In The Battle Over The Epstein Files Cover-Up",
    "description": "The Justice Department faces a deadline for explaining why it censored so many documents released from its investigative material on Jeffrey Epstein.",
    "link": "https://www.huffpost.com/entry/epstein-files-coverup-khanna-massie_n_698c9bfae4b080ae0a80cb57",
    "timestamp": "2026-02-11T15:53:52Z"
  },
  {
    "title": "Investigation of Fulton County’s election to determine if ‘improprieties’ were intentional, and therefore criminal",
    "description": "FBI raid confiscated hundreds of boxes of 2020 count records",
    "link": "https://www.wnd.com/2026/02/investigation-fulton-countys-election-determine-if-improprieties-were/",
    "timestamp": "2026-02-11T15:51:53Z"
  },
  {
    "title": "EU leaders push to make Europe less dependent on Trump — live updates",
    "description": "Leaders of EU countries try to get on the same page as they attempt to distance themselves from the U.S.",
    "link": "https://www.politico.eu/article/eu-leaders-push-to-make-europe-less-dependent-on-trump-live-updates/",
    "timestamp": "2026-02-11T15:49:47Z"
  },
  {
    "title": "Russian drone attack kills a father and 3 children in Ukraine while pregnant mother survives",
    "description": "A Russian drone has struck a home in Ukraine's Kharkiv region in an attack that killed a father and his three small children",
    "link": "https://abcnews.com/Business/wireStory/russian-drone-attack-kills-father-3-children-ukraine-130063383",
    "timestamp": "2026-02-11T15:47:44Z"
  },
  {
    "title": "Children at Dilley ICE Jail in Texas Describe Their Anguish and Fear",
    "description": "“I feel like I’ll never get out of here. I just ask that you don’t forget about us,” said a 13-year-old.",
    "link": "https://www.propublica.org/article/life-inside-ice-dilley-children",
    "timestamp": "2026-02-11T15:46:08Z"
  },
  {
    "title": "Binance founder Changpeng Zhao says he sold his Shanghai home to buy Bitcoin at $600 while job hunting",
    "description": "Changpeng Zhao, founder of Binance, sold his apartment to buy Bitcoin early in his career while unemployed. He later founded the crypto platform and became a billionaire.&nbsp;",
    "link": "https://www.livemint.com/companies/people/binance-founder-changpeng-zhao-says-he-sold-his-shanghai-home-to-buy-bitcoin-at-600-while-job-hunting-11770819390340.html",
    "timestamp": "2026-02-11T15:46:00Z"
  },
  {
    "title": "US budget deficit to grow to $1.853 trillion in FY2026, CBO says",
    "description": "The CBO said that the deficit for fiscal 2026 will be about 5.8% of GDP, about where it was in fiscal 2025, ‌with a ⁠deficit of $1.775 trillion.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-budget-deficit-to-grow-to-1-853-trillion-in-fy2026-cbo-says/articleshow/128214709.cms",
    "timestamp": "2026-02-11T15:45:15Z"
  },
  {
    "title": "Trump gives Joe Biden the legacy he deserves",
    "description": "Sandwiched between Trump portraits, he is described as \"Sleepy Joe Biden... by far, the worst President in American History\" on two newly placed bronze plaques under his autopen portrait.",
    "link": "https://nypost.com/2026/02/11/opinion/trump-gives-joe-biden-the-legacy-he-deserves/",
    "timestamp": "2026-02-11T15:44:57Z"
  },
  {
    "title": "Show HN: AI Agent Built From Scratch (No Frameworks)",
    "description": "Article URL: https://medium.com/@kamil.tustanowski/ai-agents-101-from-concept-to-code-no-frameworks-required-2dfdaf66b6c1\nComments URL: https://news.ycombinator.com/item?id=46976265\nPoints: 1\n# Comments: 0",
    "link": "https://medium.com/@kamil.tustanowski/ai-agents-101-from-concept-to-code-no-frameworks-required-2dfdaf66b6c1",
    "timestamp": "2026-02-11T15:36:56Z"
  },
  {
    "title": "WATCH: Rand Paul fires back at Katie Couric for downplaying ICE arrests of violent criminals",
    "description": "'If your daughter gets raped by the guy that gets back out and he's one of the 14%, I don't think you're going to quibble about whether it's 14 or 64 ... if you're not going to turn over anybody, then that's 0%'",
    "link": "https://www.wnd.com/2026/02/watch-rand-paul-fires-back-katie-couric-downplaying/",
    "timestamp": "2026-02-11T15:36:34Z"
  },
  {
    "title": "Monthly News – January 2026",
    "description": "Hi everyone, Before we start with the news, I’d like to thank you for your donations and for your support! We received donations from more than a thousand people in December! I know I talked about this before, but I’ll do it again because this number of donor…",
    "link": "https://blog.linuxmint.com/?p=4991",
    "timestamp": "2026-02-11T15:36:15Z"
  },
  {
    "title": "US debt forecast to hit $64T in a decade as Trump policies widen deficit",
    "description": "Congress’ nonpartisan scorekeeper predicts that the annual deficit will grow to $3.1 trillion by 2036.",
    "link": "https://www.politico.eu/article/us-debt-forecast-to-hit-64t-in-a-decade-as-trump-policies-widen-deficit/",
    "timestamp": "2026-02-11T15:36:03Z"
  },
  {
    "title": "Congressman thanks God for sending Trump to protect America from ‘homosexuality’",
    "description": "Republican United States Representative Brian Babin thanked God for sending Donald Trump to stop children from being taken “down the path of homosexuality and perversion” at a DC event on 4 February. Babin, who is a Texas native and the Chair of the House Sci…",
    "link": "https://www.thepinknews.com/2026/02/11/congressman-thanks-god-for-sending-trump-to-protect-america-from-homosexuality/",
    "timestamp": "2026-02-11T15:35:57Z"
  },
  {
    "title": "What would the Founding Fathers think of TikTok?",
    "description": "Experts weigh national security concerns against free speech in discussion of video app’s future.",
    "link": "https://news.harvard.edu/gazette/story/2026/02/what-would-the-founding-fathers-think-of-tiktok/",
    "timestamp": "2026-02-11T15:33:41Z"
  },
  {
    "title": "UFC White House Event Faces Capacity Limits As Trump, Fighters Clash Over Card",
    "description": "New details emerge about the UFC White House event, including South Lawn capacity limits, fight card size, and disputes involving Jon Jones, Conor McGregor, and Dana White.",
    "link": "https://dallasexpress.com/sports/ufc-white-house-event-faces-capacity-limits-as-trump-fighters-clash-over-card/",
    "timestamp": "2026-02-11T15:30:38Z"
  },
  {
    "title": "CBO: Federal deficits and debt to worsen over next decade",
    "description": "Worsening federal deficits are driven by increased spending on Social Security, Medicare, and debt service payments.",
    "link": "https://www.bostonherald.com/2026/02/11/federal-deficits-to-worsen-cbo/",
    "timestamp": "2026-02-11T15:27:08Z"
  },
  {
    "title": "CBO: Federal deficits and debt to worsen over next decade",
    "description": "The Congressional Budget Office projects worsening federal deficits and rising debt over the next decade, driven by increased spending on Social Security, Medicare, and debt service payments",
    "link": "https://abcnews.com/US/wireStory/cbo-federal-deficits-debt-worsen-decade-130061302",
    "timestamp": "2026-02-11T15:25:42Z"
  },
  {
    "title": "Trump to Kudlow: ‘This country should have the lowest interest rates in the world’",
    "description": "President Donald Trump said the U.S. should have the \"lowest interest rates in the world\" and argued that rate cuts would significantly reduce federal borrowing costs during an interview Tuesday on FOX Business’ \"Kudlow.\" \"This country should have the lowest …",
    "link": "https://freerepublic.com/focus/f-chat/4366424/posts",
    "timestamp": "2026-02-11T15:25:12Z"
  },
  {
    "title": "Trump official allies with Europe's far right in attacks on migration and hate speech policies (Jason Wilson/The Guardian)",
    "description": "Jason Wilson / The Guardian:\nTrump official allies with Europe's far right in attacks on migration and hate speech policies  —  US state department's Sarah B Rogers has become face of White House's hostility to European liberal democracies  —  As Donald Trump…",
    "link": "https://www.memeorandum.com/260211/p42",
    "timestamp": "2026-02-11T15:25:01Z"
  },
  {
    "title": "3 GOPers Break Ranks to Challenge Tariffs as Trump Drops Bombshell",
    "description": "At the eleventh hour, a trio of Republicans decided the president’s tariff program is worth questioning.Representatives Thomas Massie, Kevin Kiley, and Don Bacon voted alongside Democrats late Tuesday, rejecting a rule that would have blocked future efforts b…",
    "link": "https://newrepublic.com/post/206453/3-republicans-break-ranks-challenge-tariffs-donald-trump",
    "timestamp": "2026-02-11T15:22:03Z"
  },
  {
    "title": "Bondi faces lawmaker grilling over Epstein files, targeting of Trump foes",
    "description": "In a rare appearance on Capitol Hill, Attorney General Pam Bondi testifies Wednesday amid multiple controversies before the House Judiciary Committee.",
    "link": "https://abcnews.com/Politics/bondi-faces-lawmaker-grilling-epstein-files-targeting-trump/story?id=130037804",
    "timestamp": "2026-02-11T15:21:33Z"
  },
  {
    "title": "Don’t Let Trump Fool You. The Economy Is Bad, and He Is to Blame.",
    "description": "Chris Lehmann\n\n\n\nThe Trump administration’s efforts to distract from the bad economy just divert attention from one dumpster fire to another.\r\n\n\r\n\n\nThe post Don’t Let Trump Fool You. The Economy Is Bad, and He Is to Blame. appeared first on The Nation.",
    "link": "https://www.thenation.com/article/economy/trump-economy-jobs-report/",
    "timestamp": "2026-02-11T15:19:44Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Refutes White House Complaints Over Epstein Coverage",
    "description": "CNN anchor Kaitlan Collins pushed back on the White House’s frustration over media coverage of Commerce Secretary Howard Lutnick’s ties to Jeffrey Epstein, reminding viewers of “The Source” that the story remained relevant because of the ongoing revelations f…",
    "link": "https://www.thewrap.com/media-platforms/journalism/kaitlan-collins-trump-epstein-files-coverage-white-house/",
    "timestamp": "2026-02-11T15:19:40Z"
  },
  {
    "title": "‘The fiscal trajectory is not sustainable’: CBO warns about the highest debt in U.S. history as Trump adds $1.4 trillion to 10-year deficit",
    "description": "The national debt is set to surpass the historical high of 106% of GDP that it reached in 1946 by 2030, according to the CBO.",
    "link": "https://fortune.com/2026/02/11/38-trillion-national-debt-fiscal-trajectory-not-sustainable-cbo-trump-deficit/",
    "timestamp": "2026-02-11T15:18:44Z"
  },
  {
    "title": "House GOP Members Revolt Against Trump’s Tariffs",
    "description": "Defecting Republicans tanked a leadership-backed measure on Tuesday night that would have blocked future attempts to restrict President Donald Trump’s tariff authority. The vote’s failure... Read More\nThe post House GOP Members Revolt Against Trump’s Tariffs …",
    "link": "https://www.dailysignal.com/2026/02/11/house-gop-members-revolt-against-trumps-tariffs/",
    "timestamp": "2026-02-11T15:17:05Z"
  },
  {
    "title": "Investigators searching a location in Arizona in disappearance of Nancy Guthrie",
    "description": "A person was detained for questioning Tuesday in the kidnapping of Nancy Guthrie, hours after the FBI released surveillance videos of a masked person wearing a handgun holster outside Guthrie's front door the night she vanished from her Arizona home.",
    "link": "https://www.pbs.org/newshour/nation/investigators-searching-a-location-in-arizona-in-disappearance-of-nancy-guthrie",
    "timestamp": "2026-02-11T15:16:44Z"
  },
  {
    "title": "The House Just Reclaimed Its Tariff Power From Trump. Now Congress Can Try To Strike Down His Canada Tariffs.",
    "description": "Three Republicans defected to vote down an arcane procedural rule that would have made it impossible for the House to vote on Trump’s tariffs until August.",
    "link": "https://reason.com/2026/02/11/the-house-just-reclaimed-its-tariff-power-from-trump-now-congress-can-try-to-strike-down-his-canada-tariffs/",
    "timestamp": "2026-02-11T15:15:10Z"
  }
]