[
  {
    "title": "FIFA World Cup 2026: All you need to know – qualifying teams, format, draw",
    "description": "Al Jazeera answers all the key questions around the 2026 World Cup in the United States, Canada and Mexico.",
    "link": "https://www.aljazeera.com/sports/2025/11/20/fifa-world-cup-2026-all-you-need-to-know-qualifying-teams-format-draw",
    "timestamp": "2025-11-20T09:30:35Z"
  },
  {
    "title": "From coffee to tomatoes: How Trump’s tariff U-turn is an admission that his trade strategy backfired",
    "description": "Tariffs on everything from coffee to tomatoes were supposed to make America stronger. Instead, they’ve fuelled inflation, angered voters and pushed Trump into an awkward U-turn. His latest rollback hints at a larger reckoning with a trade strategy that was fl…",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-tariff-u-turn-rollback-trade-strategy-backfired-us-inflation-grocery-american-economy-11763540716263.html",
    "timestamp": "2025-11-20T09:30:01Z"
  },
  {
    "title": "Two Miss Universe judges step down amid allegations of rigging",
    "description": "Two judges have resigned from the Miss Universe international beauty pageant, with one making accusations of rigging and mulling a lawsuit as the annual competition nears its end in Bangkok",
    "link": "https://www.nbcnews.com/world/asia/two-miss-universe-judges-resign-allegations-rigging-rcna244913",
    "timestamp": "2025-11-20T09:21:18Z"
  },
  {
    "title": "Jim Brown’s battle in Washington to free his Irish wife from Ice detention",
    "description": "Jim Brown tells representatives about the plight of his wife, Donna Hughes-Brown, held in an Ice facility since returning from Ireland in late July",
    "link": "https://www.irishtimes.com/crime-law/2025/11/20/jim-browns-battle-in-washington-to-free-his-irish-wife-from-ice-detention/",
    "timestamp": "2025-11-20T09:21:04Z"
  },
  {
    "title": "Trump’s six-word jab at Musk keeps rivalry alive as billionaire responds with public thanks",
    "description": "Mid-speech, Trump paused theatrically and asked the room, “Has he ever thanked me for that properly?” He then went on to defend tax incentives for electric vehicle buyers, insisting that the benefits were aimed at middle-income Americans. “Even people that go…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-six-word-jab-at-musk-keeps-rivalry-alive-as-billionaire-responds-with-public-thanks/articleshow/125458633.cms",
    "timestamp": "2025-11-20T09:20:18Z"
  },
  {
    "title": "'Each Of Us Has Something...': Cristiano Ronaldo's Message To Donald Trump After White House Visit",
    "description": "Cristiano Ronaldo has thanked US President Donald Trump after receiving a personal invitation to the White House, where he was presented with the symbolic golden key during a high-profile dinner that also involved Saudi crown price Mohammed Bin Salman. Ronald…",
    "link": "https://www.ndtvprofit.com/sports/each-of-us-has-something-cristiano-ronaldos-message-to-donald-trump-after-white-house-visit",
    "timestamp": "2025-11-20T09:16:02Z"
  },
  {
    "title": "'Get the bum off the air': Trump rages at 'no talent' talk show host",
    "description": "Donald Trump has raged at \"no talent\" talk show host Jimmy Kimmel in a post to Truth Social. The president has made few allies in the late-night television sphere, previously posting about Stephen Colbert, whose Late Show will end next season. Trump has now t…",
    "link": "https://www.rawstory.com/donald-trump-jimmy-kimmel-2674312068/",
    "timestamp": "2025-11-20T09:04:03Z"
  },
  {
    "title": "Consumers Lose Ground in Holiday Shopping Season Even as Paycheck Stress Briefly Eases",
    "description": "As the annual holiday shopping ritual ramps up, consumers’ finances are less robust than they might appear. Last month, PYMNTS Intelligence surveyed more than 2,100 U.S. adult consumers for the most recent installment of the New Reality Check: The Paycheck-to…",
    "link": "https://www.pymnts.com/consumer-insights/2025/consumers-lose-ground-holiday-shopping-season-paycheck-stress-briefly-eases/",
    "timestamp": "2025-11-20T09:00:09Z"
  },
  {
    "title": "Why the U.S. Justice Department and Congress may battle over redaction of Epstein files",
    "description": "When it comes to the Epstein files, there are solid reasons to withold certain information from the public, experts say. However, there are also grey areas that could cause disputes between lawmakers and the U.S. Department of Justice, and which could frustra…",
    "link": "https://www.cbc.ca/news/world/epstein-redaction-files-justice-department-9.6985429",
    "timestamp": "2025-11-20T09:00:00Z"
  },
  {
    "title": "Threatened India, Pak with 350% tariffs if they didn't end conflict; Modi, Sharif called me: Trump",
    "description": "Claiming that both India and Pakistan told him not to do it, Trump said that he told them, “I'm going to do it. Come back to me and I'll take it down. But I'm not going to have you guys shooting nuclear weapons at each other, killing millions of people and ha…",
    "link": "https://www.thehindubusinessline.com/news/world/threatened-india-pak-with-350-tariffs-if-they-didnt-end-conflict-modi-sharif-called-me-trump/article70302372.ece",
    "timestamp": "2025-11-20T08:52:49Z"
  },
  {
    "title": "New Trump Push to End Russia's Ukraine War Blindsides Allies: Live Updates",
    "description": "President Donald Trump is developing a new multi-point peace plan for Russia-Ukraine. Follow Newsweek's live coverage.",
    "link": "https://biztoc.com/x/59721e9be6769672",
    "timestamp": "2025-11-20T08:49:36Z"
  },
  {
    "title": "Economist Warns Trump's America In 'Early Stages' Of Very Worrying Trend",
    "description": "\"You've all felt\" it, said Justin Wolfers.",
    "link": "https://www.huffpost.com/entry/justin-wolfers-donald-trump-economy-trend_n_691ec255e4b0d33fcd9890b9",
    "timestamp": "2025-11-20T08:43:22Z"
  },
  {
    "title": "Resilient domestic economy gives India space to negotiate U.S. trade deal, sources say",
    "description": "India's economy is robust, and U.S. tariffs have impacted exports less than feared. This gives New Delhi more negotiation power with Washington. Indian officials are not rushing a trade deal, prepared to wait for favorable terms. The government is also helpin…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/resilient-domestic-economy-gives-india-space-to-negotiate-u-s-trade-deal-sources-say/articleshow/125457951.cms",
    "timestamp": "2025-11-20T08:39:30Z"
  },
  {
    "title": "Trump Administration Projects 'Record-Breaking' Tax Refunds For 2026 —Tax Payers Can Expect 'Extra $1,000 Bump'",
    "description": "American taxpayers might be looking at a windfall next year, with the Donald Trump administration projecting that the 2026 tax filing season will deliver the largest average refunds on record.\nTax Filers To See $191 Billion Relief In 2026\nAccording to a White…",
    "link": "https://biztoc.com/x/970160e11eb2892f",
    "timestamp": "2025-11-20T08:38:24Z"
  },
  {
    "title": "Trump blasts Jimmy Kimmel, ABC after late-night host claims president is ‘bracing for Hurricane Epstein’",
    "description": "President Trump blasted Jimmy Kimmel and ABC following the late-night host's show Wednesday, where the liberal comedian alleged the commander in chief was \"bracing for Hurricane Epstein.\"",
    "link": "https://nypost.com/2025/11/20/us-news/trump-blasts-jimmy-kimmel-abc-after-late-night-host-claims-president-is-bracing-for-hurricane-epstein/",
    "timestamp": "2025-11-20T08:37:42Z"
  },
  {
    "title": "EU moves to ease AI, privacy rules amid pressure from Big Tech, Trump",
    "description": "Bloc proposes delaying strict rules for 'high-risk' AI until 2027 in bid to address concerns about lagging innovation.",
    "link": "https://www.aljazeera.com/economy/2025/11/20/eu-moves-to-ease-ai-privacy-rules-amid-pressure-from-big-tech-trump",
    "timestamp": "2025-11-20T08:33:57Z"
  },
  {
    "title": "Lucas: Trying to make cents of the penny’s demise",
    "description": "Once a proud coin of the realm, the penny has become a pest. It gets no respect.",
    "link": "https://www.bostonherald.com/2025/11/20/lucas-trying-to-make-cents-of-the-pennys-demise/",
    "timestamp": "2025-11-20T08:19:20Z"
  },
  {
    "title": "Trump to meet Mamdani at White House on Friday",
    "description": "US president has repeatedly attacked New York’s mayor-elect",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/11/19/nyregion/trump-mamdani-white-house-meeting.html",
    "timestamp": "2025-11-20T08:15:48Z"
  },
  {
    "title": "Report: Bush Family Plotting Comeback to Retake GOP from Trump",
    "description": "Former President George W. Bush and his family are reportedly planning to retake the Republican Party from President Donald Trump once he is out of office, according to a recent report. There are allegedly “rumors” stirring that there is a “plot to end the so…",
    "link": "https://freerepublic.com/focus/f-backroom/4353534/posts",
    "timestamp": "2025-11-20T08:08:16Z"
  },
  {
    "title": "China jumps US to return as Germany's top trade partner",
    "description": "China has reclaimed its title as Germany's top trading partner, dethroning the United States after President Donald Trump launched his tariff onslaught, official data showed Wednesday.",
    "link": "https://www.thelocal.de/20251120/china-jumps-us-to-return-as-germanys-top-trade-partner",
    "timestamp": "2025-11-20T08:02:59Z"
  },
  {
    "title": "'Fractured moment': Trump's MAGA under threat as GOP infighting continues: expert",
    "description": "Donald Trump is still facing down a fractured GOP, with infighting threatening stability in the party, according to a political expert.Will Sommer believes the fallout between Trump and former MAGA personalities like Marjorie Taylor Greene is only adding to t…",
    "link": "https://www.rawstory.com/msn/donald-trump-maga/",
    "timestamp": "2025-11-20T08:00:23Z"
  },
  {
    "title": "Trump Has Midnight Meltdown Over 'No Talent' TV Host: 'Get The Bum Off The Air!!!'",
    "description": "The president railed against Jimmy Kimmel in a middle-of-the-night post on social media.",
    "link": "https://www.huffpost.com/entry/donald-trump-jimmy-kimmel-attack_n_691eb3f8e4b0d33fcd9886ec",
    "timestamp": "2025-11-20T07:56:50Z"
  },
  {
    "title": "US Ally Warns Trump as Russia-Ukraine Peace Plan Takes Shape",
    "description": "The European Union's (EU) top diplomat warned President Donald Trump that Europe and Ukraine need to support a peace deal with Russia for it to work, as a new U.S. plan begins to take shape, one that may require Kyiv to concede swathes of the Donbas region—it…",
    "link": "https://biztoc.com/x/615b00c087278ecc",
    "timestamp": "2025-11-20T07:54:18Z"
  },
  {
    "title": "'Commie' v 'Donnie' — Trump to meet Mamdani on Friday at White House",
    "description": "US News: TOI Correspondent from Washington: A frisson of excitement is coursing through Washington DC and New York City after President Donald Trump announced .",
    "link": "https://timesofindia.indiatimes.com/world/us/commie-v-donnie-trump-to-meet-mamdani-on-friday-at-white-house/articleshow/125453346.cms",
    "timestamp": "2025-11-20T07:48:12Z"
  },
  {
    "title": "The 8 at 8: Thursday",
    "description": "Garda arrested, frosty weather in northern counties, and Epstein files to be released.",
    "link": "https://www.thejournal.ie/the-8-at-8-thursday-57-6880368-Nov2025/",
    "timestamp": "2025-11-20T07:45:05Z"
  },
  {
    "title": "China’s EVs dominate the world — why not in the US and Canada?",
    "description": "China makes more than 70 percent of the world's electric cars. But it's hard to find those vehicles in North America.",
    "link": "https://www.aljazeera.com/news/2025/11/20/chinas-evs-dominate-the-world-why-not-in-the-us-and",
    "timestamp": "2025-11-20T07:38:38Z"
  },
  {
    "title": "Haiti: fans could miss the 2026 World Cup",
    "description": "Haiti: fans could miss the 2026 World CupHaitian supporters may not be able to cheer on their team at the 2026 World Cup. According to The Athletic, a U.S. political decision is dashing all hopes.Hait...",
    "link": "https://foot-africa.com/en/news/haiti-fans-could-miss-the-2026-world-cup-968564/",
    "timestamp": "2025-11-20T07:30:00Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Thursday",
    "description": "Bundeswehr soldiers storm a Berlin U-bahn station, the Stuttgart 21 station is hit with further delays, an official New Year's Eve street party is to be held at Brandenburger Tor and more news on Thursday, November 20th.",
    "link": "https://www.thelocal.de/20251120/today-in-germany-a-roundup-of-the-latest-news-on-thursday-96",
    "timestamp": "2025-11-20T07:29:18Z"
  },
  {
    "title": "Fraudster Whose Sentence Was Commuted By Trump Gets New Decades-Long Jailtime",
    "description": "The New Jersey man, whose prison time was commuted by the president in 2021, is headed back to federal prison",
    "link": "https://www.huffpost.com/entry/convicted-fraudster-new-charges-trump_n_691ebdfde4b0d33fcd988de9",
    "timestamp": "2025-11-20T07:21:25Z"
  },
  {
    "title": "Trump 'threatening to play games' after 'change of heart' on Epstein files",
    "description": "Donald Trump is \"threatening to play games\" with the release of Jeffrey Epstein's files, DNC Chair Ken Martin has said. In a statement released by the Democratic Party, Martin suggested there is a long-term plan in place from the president to avoid releasing …",
    "link": "https://www.rawstory.com/donald-trump-epstein-files/",
    "timestamp": "2025-11-20T07:21:02Z"
  },
  {
    "title": "South Africa beefs up security on streets, bracing for G20 summit protests",
    "description": "More than 3,500 police officers deployed as South Africa braces for protests during the G20 summit this weekend.",
    "link": "https://www.aljazeera.com/news/2025/11/20/south-africa-beefs-up-security-on-streets-bracing-for-g20-summit-protests",
    "timestamp": "2025-11-20T07:12:35Z"
  },
  {
    "title": "Ex-US Treasury chief quits OpenAI board over Epstein ties",
    "description": "Former US Treasury Secretary Larry Summers resigns from the OpenAI board following the release of emails linking him to sex offender Jeffrey Epstein.\n\nRead More: https://punchng.com/ex-us-treasury-chief-quits-openai-board-over-epstein-ties/",
    "link": "https://punchng.com/ex-us-treasury-chief-quits-openai-board-over-epstein-ties/",
    "timestamp": "2025-11-20T07:03:20Z"
  },
  {
    "title": "Texas Hemp Regulation Proceeds Despite Federal Restriction",
    "description": "The Texas Alcoholic Beverage Commission moved forward on Tuesday with its efforts to regulate the sale of consumable hemp products as questions swirled around the future of the industry due to federal restrictions on the products approved by Congress last …",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/11/20/848387.htm",
    "timestamp": "2025-11-20T07:00:10Z"
  },
  {
    "title": "“Things Happen”: Murder According to Trump",
    "description": "Jamal Khashoggi, a Washington Post columnist, was murdered inside the Saudi consulate in Istanbul in October 2018. Seven years later, Donald Trump received Crown Prince Mohammed bin Salman—the man U.S. intelligence concluded ordered Khashoggi’s killing—with o…",
    "link": "https://www.counterpunch.org/2025/11/20/things-happen-murder-according-to-trump/",
    "timestamp": "2025-11-20T06:59:53Z"
  },
  {
    "title": "Trump administration’s semiconductor tariff plan likely delayed, officials say",
    "description": "U.S. officials are privately saying that they might not levy long-promised semiconductor tariffs soon, potentially delaying a centerpiece of President Donald Trump’s economic agenda.\nOfficials relayed these messages over the last several days to stakeholders …",
    "link": "https://biztoc.com/x/62508aca404691a9",
    "timestamp": "2025-11-20T06:58:24Z"
  },
  {
    "title": "'So Sad!': Stephen Colbert Brutally Trolls MAGA Rep With A Scathing Invitation",
    "description": "The \"Late Show\" host mocked Rep. Nancy Mace over comments she made on a right-wing network.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-nancy-mace_n_691ea136e4b0b763ab8ddbf3",
    "timestamp": "2025-11-20T06:55:11Z"
  },
  {
    "title": "Trump peace plan blindsides allies",
    "description": "Reported proposal appears to be a settlement mostly on Moscow’s terms",
    "link": "https://www.irishtimes.com/world/2025/11/20/its-about-ukraine-accepting-latest-trump-peace-plan-blindsides-european-allies/",
    "timestamp": "2025-11-20T06:52:41Z"
  },
  {
    "title": "Epstein Files Decoded: The People, The Papers, And The Questions They Raise",
    "description": "US President Donald Trump announced on social media on Nov. 19 that he had signed the Epstein Files Transparency Act, directing the Justice Department to release all documents linked to late sex crime offender Jeffrey Epstein within 30 days, reported The New …",
    "link": "https://www.ndtvprofit.com/world/epstein-files-decoded-the-people-the-papers-and-the-questions-they-raise",
    "timestamp": "2025-11-20T06:49:30Z"
  },
  {
    "title": "Trump and Mamdani Set for Dramatic Oval Office Meeting On Friday With NYC Affordability Crisis In Focus",
    "description": "President Donald Trump is set to meet with New York City’s mayor-elect, Zohran Mamdani, in the Oval Office this Friday. This will be the first in-person meeting between the two since Mamdani’s election earlier this month.\nTrump Calls Mamdani ‘Communist Mayor’…",
    "link": "https://biztoc.com/x/dfac0afb60c831c7",
    "timestamp": "2025-11-20T06:47:01Z"
  },
  {
    "title": "Border Patrol is monitoring US drivers and detaining those with 'suspicious' patterns",
    "description": "The U.S. Border Patrol is monitoring millions of American drivers nationwide in a secretive program to identify and detain people whose travel patterns it deems suspicious",
    "link": "https://abcnews.go.com/Technology/wireStory/border-patrol-monitoring-us-drivers-detaining-suspicious-travel-127699704",
    "timestamp": "2025-11-20T06:44:48Z"
  },
  {
    "title": "Detente? Trump says Mamdani will visit White House on Friday",
    "description": "After months of trading public barbs, the US president and New York City mayor-elect are set to meet in person.",
    "link": "https://www.aljazeera.com/news/2025/11/20/detente-trump-says-mamdani-will-visit-white-house-on-friday",
    "timestamp": "2025-11-20T06:44:23Z"
  },
  {
    "title": "Trump signs Bill to compel release of more Epstein documents",
    "description": "Signature mark a sharp reversal for US president,  who had authority to release the files himself, but chose not to",
    "link": "https://www.irishtimes.com/world/us/2025/11/20/trump-signs-bill-to-compel-release-of-more-epstein-documents/",
    "timestamp": "2025-11-20T06:39:54Z"
  },
  {
    "title": "Trump signs bill ordering release of Epstein files - here's what happens next",
    "description": "Insiders warn that even with the president’s signature, his administration could use redactions, procedural delays or lingering federal investigations to hide details.",
    "link": "https://www.thejournal.ie/trump-signs-bill-to-release-epstein-files-6880346-Nov2025/",
    "timestamp": "2025-11-20T06:37:23Z"
  },
  {
    "title": "Trump and New York’s Mayor Mamdani to Meet",
    "description": "Trump Agrees to Meet with Newly Elected NYC Mayor It’s happening! American President Donald Trump has agreed to meet with New York City’s newly elected Mayor, Zohran Mamdani. This comes after some heated exchanges during the mayoral election campaign. Trump t…",
    "link": "https://nep123.com/trump-and-new-yorks-mayor-mamdani-to-meet/",
    "timestamp": "2025-11-20T06:37:09Z"
  },
  {
    "title": "SEAN SPICER: CNN’s Fate Is About To Be Decided — And Conservatives Should Pay Attention",
    "description": "Recently, CNN anchor Abby Philip accused MAGA Republicans of being stuck in “information silos.”",
    "link": "https://dailycaller.com/2025/11/20/opinion-cnns-fate-is-about-to-be-decided-and-conservatives-should-pay-attention-sean-spicer/",
    "timestamp": "2025-11-20T06:31:22Z"
  },
  {
    "title": "Trump's semiconductor tariff plan likely delayed, officials say",
    "description": "Trump administration is considering postponing the implementation of semiconductor tariffs to prevent escalating tensions with China and ensure steady access to essential rare earth minerals, despite the administration's promise to bolster domestic production.",
    "link": "https://economictimes.indiatimes.com/tech/technology/trumps-semiconductor-tariff-plan-likely-delayed-officials-say/articleshow/125455339.cms",
    "timestamp": "2025-11-20T06:30:38Z"
  },
  {
    "title": "Trump to meet New York mayor-elect Friday",
    "description": "President Donald Trump will host New York mayor-elect Zohran Mamdani for a meeting on Friday, despite previously attacking the Democratic Socialist.\n\nRead More: https://punchng.com/trump-to-meet-new-york-mayor-elect-friday/",
    "link": "https://punchng.com/trump-to-meet-new-york-mayor-elect-friday/",
    "timestamp": "2025-11-20T06:27:51Z"
  },
  {
    "title": "Trump has approved the release of the Epstein files - what happens now?",
    "description": "Some wealthy and powerful figures including Andrew Mountbatten-Windsor and Peter Mandelson have already suffered reputational damage. Under immense pressure, Donald Trump is backing the disclosure of many more Epstein files, a move that risks exposing more we…",
    "link": "https://news.sky.com/story/donald-trump-has-approved-the-release-of-the-epstein-files-what-happens-now-13472992",
    "timestamp": "2025-11-20T06:25:00Z"
  },
  {
    "title": "Jimmy Kimmel Rips Into Trump and His Guests for Saudi Prince Dinner: ‘This Group Is So Cartoonishly Evil’ | Video",
    "description": "\"It was like an alumni dinner for the Legion of Doom,\" the late night host adds\nThe post Jimmy Kimmel Rips Into Trump and His Guests for Saudi Prince Dinner: ‘This Group Is So Cartoonishly Evil’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-trump-saudi-prince-dinner-reaction-video/",
    "timestamp": "2025-11-20T06:24:05Z"
  },
  {
    "title": "Asian shares surge as Nvidia's strong quarterly earnings lift sentiments",
    "description": "NEW YORK (AP) — Jarring swings keep rocking Wall Street, and U.S. stocks erased a big morning gain to drop on Thursday as the market remains skittish following weeks of doubts and erratic moves.",
    "link": "https://www.wral.com/story/asian-shares-surge-as-nvidias-strong-quarterly-earnings-lift-sentiments/22254090/",
    "timestamp": "2025-11-20T06:22:53Z"
  },
  {
    "title": "Trump faces moment of truth on explosive Epstein files",
    "description": "Donald Trump signed into law on Wednesday legislation requiring the release of government records on convicted sex offender Jeffrey Epstein, spurring a showdown over whether the U.S. president will allow full disclosure — or return to trying to bury the case.",
    "link": "https://www.hurriyetdailynews.com/trump-faces-moment-of-truth-on-explosive-epstein-files-215936",
    "timestamp": "2025-11-20T06:21:24Z"
  },
  {
    "title": "Late Night Open Thread: Little Man Greg Bovino Flourishes His Mighty Weapon",
    "description": "Border Patrol’s Gregory Bovino has brought his hype videoing to Charlotte. With the surely unlicensed use of the song Raise Up by Petey Pablo. [image or embed] — Trump Watch (@trumpwat.ch) November 17, 2025 at 12:27 PM At the 10second mark in the video, you c…",
    "link": "https://balloon-juice.com/2025/11/20/late-night-open-thread-little-man-greg-bovino-waves-his-mighty-weapon/",
    "timestamp": "2025-11-20T06:18:40Z"
  },
  {
    "title": "Karoline Leavitt admits 32-year age gap with husband Nicholas Riccio is ‘very unusual’",
    "description": "White House press secretary said telling her parents about her relationship was a ‘challenging conversation’",
    "link": "https://www.the-independent.com/life-style/karoline-leavitt-husband-nicholas-riccio-marriage-age-gap-b2868805.html",
    "timestamp": "2025-11-20T06:18:01Z"
  },
  {
    "title": "The Indo Daily: The Epstein files are coming: What will we see and will they damage Donald Trump?",
    "description": "This episode of The Indo Daily contains references to sexual assault, so please take care while listening.  The vote has taken place and the Epstein files will now be made public. After months of delay, political pressure and partisan division, Congress has b…",
    "link": "https://www.independent.ie/podcasts/the-indo-daily/the-indo-daily-the-epstein-files-are-coming-what-will-we-see-and-will-they-damage-donald-trump/a1524711944.html",
    "timestamp": "2025-11-20T06:16:34Z"
  },
  {
    "title": "Asian shares surge on Nvidia's upbeat earnings report",
    "description": "Big swings keep rocking Wall Street. The S&P 500 fell 1.6% Thursday after erasing an early surge that initially had it on track for its best day since May. The Dow Jones Industrial Average dropped 0.8%, and the Nasdaq composite sank 2.2%. The sharpest losses …",
    "link": "https://apnews.com/article/asia-nvidia-earnings-us-stocks-71372f3476dd13c33d316819bf902b17",
    "timestamp": "2025-11-20T06:13:26Z"
  },
  {
    "title": "A cold gold rush? The race for the Arctic's critical minerals is heating up",
    "description": "Countries are increasingly turning to the thawing and sparsely populated northern polar region as part of a push to break China's mineral dominance.",
    "link": "https://www.cnbc.com/2025/11/20/rare-earths-the-race-for-the-arctics-critical-minerals-is-heating-up.html",
    "timestamp": "2025-11-20T06:11:22Z"
  },
  {
    "title": "Trump’s plan to end the war in Ukraine: “Ready for peace, not for surrender,” Zelensky says",
    "description": "The Trump administration is promoting a 28-point plan to end the war in Ukraine, which includes significant territorial concessions to the Kremlin and limits on the Ukrainian military\nThe post Trump’s plan to end the war in Ukraine: “Ready for peace, not for …",
    "link": "https://en.protothema.gr/2025/11/20/trumps-plan-to-end-the-war-in-ukraine-ready-for-peace-not-for-surrender-zelensky-says/",
    "timestamp": "2025-11-20T06:10:57Z"
  },
  {
    "title": "How politicians could combat doubts about Epstein files release",
    "description": "As a 30-day timer begins for the US Department of Justice to release its Epstein files, questions remain around whether this will be the definitive release.",
    "link": "https://www.abc.net.au/news/2025-11-20/epstein-files-release-redaction-doubts/106033524",
    "timestamp": "2025-11-20T06:10:16Z"
  },
  {
    "title": "Trump Urges Congress to Block State-Level AI Regulation",
    "description": "President Donald Trump called on Congress to pass a federal standard governing oversight of artificial intelligence and warned that varied regulation at the state level risked slowing the development of an emerging technology that’s critical to the US economy…",
    "link": "https://www.insurancejournal.com/news/national/2025/11/20/848395.htm",
    "timestamp": "2025-11-20T06:08:18Z"
  },
  {
    "title": "Trump signs bill to release Epstein files",
    "description": "President Donald Trump signed legislation on Wednesday ordering the Justice Department to release documents from its long-running investigation into sex offender Jeffrey Epstein — files eagerly sought by both his political opponents and members of his own bas…",
    "link": "https://www.independent.ie/world-news/north-america/trump-signs-bill-to-release-epstein-files/a228995275.html",
    "timestamp": "2025-11-20T06:03:28Z"
  },
  {
    "title": "Trump's Canada envoy sees trade talks resuming after sudden halt",
    "description": "The U.S. ambassador in Ottawa said Canada and the U.S. can still reach an agreement to reduce tariffs despite last month’s blowup. Read on.",
    "link": "https://financialpost.com/news/trump-canada-envoy-trade-talks-sudden-halt",
    "timestamp": "2025-11-20T06:00:55Z"
  },
  {
    "title": "Trump’s Canada Envoy Sees Trade Talks Resuming After Sudden Halt",
    "description": "The US ambassador in Ottawa said Canada and the US have a chance to reach an agreement to reduce tariffs despite last month’s diplomatic blowup when President Donald Trump angrily halted negotiations.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-canada-envoy-sees-trade-talks-resuming-after-sudden-halt",
    "timestamp": "2025-11-20T06:00:55Z"
  },
  {
    "title": "World Cup 2026 European playoffs teams, schedule, bracket for UEFA nations chasing final four spots",
    "description": "All you need to know on the UEFA World Cup playoff round, the draw for which is held on November 20.",
    "link": "https://www.sportingnews.com/us/soccer/news/world-cup-2026-uefa-playoffs-schedule-bracket-teams-fifa/fce10704ee4ab858c64b9148",
    "timestamp": "2025-11-20T06:00:02Z"
  },
  {
    "title": "Trump Admin To Turn On Three Mile Island Reactor (Not That One)",
    "description": "The Department of Energy (DOE) announced Tuesday that it will loan Constellation Energy around $1 billion to restart one of Three Mile Island’s reactors in Pennsylvania.",
    "link": "https://wattsupwiththat.com/2025/11/19/trump-admin-to-turn-on-three-mile-island-reactor-not-that-one/",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "Trump forces South Korea to end decade-long crackdown on American tech giants",
    "description": "South Korea’s Fair Trade Commission aggressively fined U.S. tech firms like Google and Apple under protectionist policies for years. Trump’s pressure forced Seoul to end unfair regulatory practices and align economically with the U.S. for security and trade. …",
    "link": "https://www.naturalnews.com/2025-11-20-trump-south-korea-crackdown-american-tech-giants.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "Soros-funded NGO exposed in campaign to censor conservatives and “kill Muskâ\u0080\u0099s Twitter”",
    "description": "The Open Society Foundations (OSF), backed by George Soros, funneled $250,000to the U.K.-based Center for Countering Digital Hate (CCDH). The funds were labeled for “general support” but align with CCDH’s campaigns to pressure advertisers, lobby policymakers …",
    "link": "https://www.naturalnews.com/2025-11-20-soros-ngo-censor-conservatives-kill-musk-twitter.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "A trillion-dollar handshake: U.S. and Saudi Arabia forge new economic and security pact",
    "description": "Saudi Arabia pledges a monumental $1 trillion in new U.S. investments, focusing on AI, infrastructure and advanced materials. The commitment coincides with President Trump’s announcement to sell F-35 stealth fighter jets to the kingdom, deepening defense ties…",
    "link": "https://www.naturalnews.com/2025-11-20-us-saudi-arabia-forge-new-economic-security-pact.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "Operation Sovereign Shield: The military move that’s actually beating the cartels",
    "description": "U.S. Border Patrol reports significant disruption to Mexican cartel smuggling operations following a military reinforcement order. The deployment, Operation Sovereign Shield, combines National Guard units, surveillance drones and mobile checkpoints. Data show…",
    "link": "https://www.naturalnews.com/2025-11-20-the-military-move-thats-actually-beating-the-cartels.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "The Zionist takeover of American Christianity: How pastors betray Christ for Israel",
    "description": "Prominent pastors like Greg Locke, John Hagee and Mike Montgomery prioritize allegiance to Israel over biblical Christianity, promoting Talmudic Judaism and funding Zionist agendas while denying Jesus as Messiah. Hagee explicitly rejects Jesus’ messianic role…",
    "link": "https://www.naturalnews.com/2025-11-20-zionist-takeover-american-christianity-pastors-betray-christ.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "Trump and Mamdani to meet at the White House, discuss NYC’s affordability crisis",
    "description": "President Trump will meet NYC Mayor-elect Zohran Mamdani in the Oval Office on Nov. 21, marking a rare moment of cooperation despite their previous clashes. The discussion will center on lowering living costs in NYC, a key issue in Mamdani’s campaign, includi…",
    "link": "https://www.naturalnews.com/2025-11-20-trump-mamdani-to-meet-at-white-house.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "U.S. peace plan demands Ukraine cede territory, slash military in exchange for ceasefire",
    "description": "A U.S.-proposed peace plan would require Ukraine to surrender occupied territories, including Donbas and Crimea, and officially recognize them as Russian. Military forces would be reduced from over 1 million to 400,000 troops, with restrictions on long-range …",
    "link": "https://www.naturalnews.com/2025-11-20-us-peace-plan-ukraine-territory-military-ceasefire.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "Congress forces release of Epstein files in landmark vote",
    "description": "The U.S. House (427-1) and Senate (unanimous) voted overwhelmingly to compel the DOJ to release all unclassified Epstein documents within 30 days. The legislation mandates disclosure of flight logs, client lists and communications, with redactions allowed onl…",
    "link": "https://www.naturalnews.com/2025-11-20-congress-forces-release-epstein-files-landmark-vote.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "The end of green fantasies? Landmark U.S.-Japan deal pivots to “pragmatic energy realism” for defense",
    "description": "The U.S. and Japan have forged a massive strategic pact to counter China’s dominance in critical minerals and energy supplies. The agreement unlocks hundreds of billions in Japanese investment in U.S. nuclear energy, data centers and critical minerals process…",
    "link": "https://www.naturalnews.com/2025-11-20-us-japan-deal-pivots-to-pragmatic-energy-realism.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "A new equation for American schools: enforcement and enrollment",
    "description": "President Trump’s immigration enforcement policies are leading to a sharp, nationwide decline in the enrollment of immigrant children in public schools. Major school districts in deep-blue cities like Miami, Denver, and Chicago are reporting some of the most …",
    "link": "https://www.naturalnews.com/2025-11-20-a-new-equation-for-american-schools-enforcement-and-enrollment.html",
    "timestamp": "2025-11-20T06:00:00Z"
  },
  {
    "title": "'An incredibly big shift.' Trump says he signed bill to release Epstein files",
    "description": "President Donald Trump announced Wednesday that he signed the Epstein transparency bill, giving the Justice Department the ...",
    "link": "https://biztoc.com/x/04afc70188439db9",
    "timestamp": "2025-11-20T05:54:58Z"
  },
  {
    "title": "Trump considering executive order to preempt state AI laws",
    "description": "U.S. President Donald Trump is considering an executive order that would seek to preempt state laws on artificial intelligence through lawsuits and by withholding federal funding, according to a draft of the order seen by Reuters on Wednesday. The move, which…",
    "link": "https://freerepublic.com/focus/f-news/4353530/posts",
    "timestamp": "2025-11-20T05:50:04Z"
  },
  {
    "title": "Solar power rises above policy, weather headwinds in the US and UK",
    "description": "Growing energy demand and falling technology costs are fuelling a boom in the solar power industry on both sides of the Atlantic.",
    "link": "https://www.channelnewsasia.com/world/solar-power-energy-sun-uk-usa-growing-demand-headwinds-5479116",
    "timestamp": "2025-11-20T05:49:01Z"
  },
  {
    "title": "Nancy Pelosi Doubles Down On Stinging Trump Description: 'I Could've Done Much Worse'",
    "description": "The former House speaker called Trump a \"vile creature\" earlier this month.",
    "link": "https://www.huffpost.com/entry/nancy-pelosi-trump-description_n_691e9043e4b0b763ab8dd370",
    "timestamp": "2025-11-20T05:47:29Z"
  },
  {
    "title": "JD Vance: U.S. Families Gain from Automation, Not Migration",
    "description": "The government should favor automation over migration because robots can help Americans get higher wages, says Vice President JD Vance.\nThe post JD Vance: U.S. Families Gain from Automation, Not Migration appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/19/jd-vance-u-s-workers-gain-automation-not-migration/",
    "timestamp": "2025-11-20T05:44:01Z"
  },
  {
    "title": "Trump Eyes Executive Order to Rein In Patchwork State AI Policies",
    "description": "The White House is pushing for a federal framework as Hill Republicans explore attaching a moratorium to the defense bill.",
    "link": "https://decrypt.co/349339/trump-executive-order-rein-in-patchwork-state-ai-policies",
    "timestamp": "2025-11-20T05:41:12Z"
  },
  {
    "title": "God’s Opinion on Israel: The defining issue of our time",
    "description": "How a Christian Zionist looks at America's relations with the State of Israel in our turbulent times.",
    "link": "https://www.israelnationalnews.com/news/418070",
    "timestamp": "2025-11-20T05:36:43Z"
  },
  {
    "title": "Border Patrol monitors US drivers and detains Americans for ‘suspicious’ travel",
    "description": "The U.S. Border Patrol is monitoring millions of American drivers nationwide in a secretive program to identify and detain people whose travel patterns it deems suspicious. The Associated Press has found that the predictive intelligence program has resulted i…",
    "link": "https://apnews.com/article/immigration-border-patrol-surveillance-drivers-ice-trump-9f5d05469ce8c629d6fecf32d32098cd",
    "timestamp": "2025-11-20T05:36:41Z"
  },
  {
    "title": "DAVID BLACKMON: Will GOP Infighting Hamstring Trump’s Energy Agenda?",
    "description": "The Republican Party has never been able to tolerate prosperity without finding ways to mess it all up.",
    "link": "https://dailycaller.com/2025/11/20/opinion-will-gop-infighting-hamstring-trumps-energy-agenda-david-blackmon-2/",
    "timestamp": "2025-11-20T05:32:38Z"
  },
  {
    "title": "Tanya Sweeney: Just when you think the US President can scrape no lower, he manages to do just that with ‘quiet, piggy’ jibe",
    "description": "When it comes to the public utterances of Donald Trump, the outrageous, barely believable moments come thick and fast. And just when you think the US President can scrape no lower, he manages to do just that.",
    "link": "https://www.independent.ie/opinion/tanya-sweeney-just-when-you-think-the-us-president-can-scrape-no-lower-he-manages-to-do-just-that-with-quiet-piggy-jibe/a1838648831.html",
    "timestamp": "2025-11-20T05:30:00Z"
  },
  {
    "title": "Donald Trump’s ‘Quiet, piggy’ jibe – ‘Just when you think the US President can scrape no lower, he manages to do just that’",
    "description": "When it comes to the public utterances of Donald Trump, the outrageous, barely believable moments come thick and fast. And just when you think the US President can scrape no lower, he manages to do just that.",
    "link": "https://www.independent.ie/life/donald-trumps-quiet-piggy-jibe-just-when-you-think-the-us-president-can-scrape-no-lower-he-manages-to-do-just-that/a1838648831.html",
    "timestamp": "2025-11-20T05:30:00Z"
  },
  {
    "title": "Tanya Sweeney: Just when you think Donald Trump can scrape no lower, he manages to do just that with ‘quiet, piggy’ jibe",
    "description": "When it comes to the public utterances of Donald Trump, the outrageous, barely believable moments come thick and fast. And just when you think the US President can scrape no lower, he manages to do just that.",
    "link": "https://www.independent.ie/opinion/tanya-sweeney-just-when-you-think-donald-trump-can-scrape-no-lower-he-manages-to-do-just-that-with-quiet-piggy-jibe/a1838648831.html",
    "timestamp": "2025-11-20T05:30:00Z"
  },
  {
    "title": "Ukraine must give up land and weapons and cut army numbers under draft US peace plan, sources say",
    "description": "The US has signalled to President Volodymyr Zelensky that Ukraine must accept a US-drafted framework to end the war with Russia that proposes Kyiv giving up territory and some weapons, two people familiar with the matter said yesterday.",
    "link": "https://www.independent.ie/world-news/europe/ukraine-must-give-up-land-and-weapons-and-cut-army-numbers-under-draft-us-peace-plan-sources-say/a996439695.html",
    "timestamp": "2025-11-20T05:30:00Z"
  },
  {
    "title": "Garda leave and rest days cancelled ahead of Volodymyr Zelensky’s visit to Ireland as major security operation planned",
    "description": "Garda bosses have cancelled all leave and rest days in Dublin for the visit of Volodymyr Zelensky, with a major security operation planned for his arrival in two weeks.",
    "link": "https://www.independent.ie/irish-news/garda-leave-and-rest-days-cancelled-ahead-of-volodymyr-zelenskys-visit-to-ireland-as-major-security-operation-planned/a2001850151.html",
    "timestamp": "2025-11-20T05:30:00Z"
  },
  {
    "title": "Letters: In Government’s game of bingo, there’s a Simon of all trades, master of none",
    "description": "The recent reshuffle by the Government seems to resemble a ministerial bingo card.",
    "link": "https://www.independent.ie/opinion/letters/letters-in-governments-game-of-bingo-theres-a-simon-of-all-trades-master-of-none/a1451480892.html",
    "timestamp": "2025-11-20T05:30:00Z"
  },
  {
    "title": "Trump and Vance not invited to Dick Cheney’s funeral, but all four living former vice presidents attending",
    "description": "Past presidents and politicians of both parties will gather Thursday in Washington, DC, for former Vice President Dick Cheney’s funeral — sending off a key...",
    "link": "https://www.cnn.com/2025/11/20/politics/dick-cheney-funeral-washington",
    "timestamp": "2025-11-20T05:24:25Z"
  },
  {
    "title": "The Musk-Trump feud is thawing, again",
    "description": "The Trump-Musk feud seems to be thawing.\nKevin Dietsch/Getty Images\nElon Musk and Donald Trump are extending olive branches to each other.\nMusk was at Trump's CEO-studded White House dinner on Tuesday.\nHe later thanked Trump on X for \"all he has done for Amer…",
    "link": "https://biztoc.com/x/562e7a93b4a73374",
    "timestamp": "2025-11-20T05:17:28Z"
  },
  {
    "title": "Border Patrol is monitoring US drivers and detaining those with 'suspicious' travel patterns",
    "description": "The U.S. Border Patrol is monitoring millions of American drivers nationwide in a secretive program to identify and detain people whose travel patterns it...",
    "link": "https://www.yahoo.com/news/articles/border-patrol-monitoring-us-drivers-051408389.html",
    "timestamp": "2025-11-20T05:14:08Z"
  },
  {
    "title": "Zelensky receives Ukraine peace plan, will speak to Trump",
    "description": "Ukraine's President Volodymyr Zelensky has received the draft of a new US-backed plan to end Russia's war in his country, according to his office.",
    "link": "https://www.rte.ie/news/ukraine/2025/1120/1544898-ukraine-russia/",
    "timestamp": "2025-11-20T05:13:27Z"
  },
  {
    "title": "Zelensky meeting US Army officials in Kyiv",
    "description": "The US has signalled to President Volodymyr Zelensky that Ukraine must accept a US-drafted framework to end the war with Russia that proposes Kyiv giving up territory and some weapons, two people familiar with the matter said.",
    "link": "https://www.rte.ie/news/world/2025/1120/1544898-ukraine-russia/",
    "timestamp": "2025-11-20T05:13:27Z"
  },
  {
    "title": "Trump Signs Bill Ordering DOJ To Release Epstein Files—Attacks Democrats",
    "description": "After dismissing the Epstein files issue as a Democratic \"hoax\" earlier, the president signed the bill a day after the Senate and the House passed it nearly unanimously.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/11/20/trump-signs-bill-ordering-doj-to-release-epstein-files-attacks-democrats/",
    "timestamp": "2025-11-20T05:12:51Z"
  }
]