[
  {
    "title": "New York backs casinos near Mets stadium and a Trump-linked golf course",
    "description": "New York City is set to get its first Vegas-style casinos, with one near the New York Mets' stadium and another potentially seeing a windfall for President Donald Trump. A state panel approved three casino proposals for gambling licenses on Monday. Manhattan …",
    "link": "https://apnews.com/article/casino-nyc-trump-ballys-mets-citifield-1f8f5a3039b573d7f7acacc9fa8d1ac9",
    "timestamp": "2025-12-01T19:27:42Z"
  },
  {
    "title": "Nine Indiana Republicans Targeted in Swatting Attacks",
    "description": "“At least nine elected Republicans in Indiana have been the target of swatting attacks in the weeks since President Donald Trump publicly pressured state lawmakers to pass new congressional maps that would benefit Republicans,” NBC News reports.",
    "link": "https://politicalwire.com/2025/12/01/nine-indiana-republicans-targeted-in-swatting-attacks/",
    "timestamp": "2025-12-01T19:26:34Z"
  },
  {
    "title": "Abigail Spanberger Pledges ‘Pragmatism’ — And Felon Voting Rights",
    "description": "Abigail Spanberger says she'll govern as a moderate — while pursuing a $15 minimum wage, protections for same-sex marriage and voting rights for felons.",
    "link": "https://dailycaller.com/2025/12/01/abigail-spanberger-virginia-moderate-policies-felon-voting-rights/",
    "timestamp": "2025-12-01T19:26:18Z"
  },
  {
    "title": "Tough issues still unresolved after Florida talks: Zelenskyy",
    "description": "Diplomatic efforts to end the war in Ukraine intensify. Talks in Florida between US and Ukrainian officials concluded with unresolved issues. Ukrainian President Volodymyr Zelenskyy is now touring European capitals to rally allies. Meanwhile, a representative…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/tough-issues-still-unresolved-after-florida-talks-zelenskyy/articleshow/125703039.cms",
    "timestamp": "2025-12-01T19:26:14Z"
  },
  {
    "title": "Meidas: Trump Beats the War Drums As His Administration Continues to Collapse",
    "description": "MeidasTouch host Ben Meiselas reports on Donald Trump spiraling out of control on Monday and calling in his war cabinet to potentially launch a war against Venezuela to distract from his collapsing administration.",
    "link": "https://littlegreenfootballs.com/article/55104_Meidas-_Trump_Beats_the_War_Dr",
    "timestamp": "2025-12-01T19:23:40Z"
  },
  {
    "title": "Trump MRI results drop as White House confronts mounting questions over president’s health",
    "description": "President Donald Trump's October MRI scan found no cardiovascular abnormalities and confirmed excellent overall health, White House press secretary Karoline Leavitt announced.",
    "link": "https://www.foxnews.com/politics/trump-mri-results-drop-white-house-confronts-mounting-questions-over-presidents-health",
    "timestamp": "2025-12-01T19:23:29Z"
  },
  {
    "title": "National Guard member shot in DC has shown positive signs, West Virginia governor says",
    "description": "'Andrew is still fighting for his life,' Gov. Patrick Morrisey said.",
    "link": "https://www.bostonherald.com/2025/12/01/national-guard-dc-shooting/",
    "timestamp": "2025-12-01T19:23:10Z"
  },
  {
    "title": "New York City backs casinos in Queens and the Bronx that would benefit billionaire Steve Cohen and maybe even Donald Trump",
    "description": "New York City is poised to get its first Vegas-style casinos, including one next to the home stadium of baseball’s New York Mets.",
    "link": "https://fortune.com/2025/12/01/new-york-city-casinos-queens-bronx-trump-cohen/",
    "timestamp": "2025-12-01T19:22:02Z"
  },
  {
    "title": "EXCLUSIVE: The Donald Trump Fake News Move That Has Voters Up in Arms — 'Does He Really Have Nothing Better To Do?'",
    "description": "Donald Trump appears to be focusing more on tackling 'fake news' than doing positive things for those who voted for him.",
    "link": "https://radaronline.com/p/trump-fake-news-move-media-offender-nothing-better-to-do/",
    "timestamp": "2025-12-01T19:20:00Z"
  },
  {
    "title": "‘They Must Go Back’: Leavitt Says National Guard Shooting Shows Trump’s Mass Deportations Must Continue",
    "description": "\"In the wake of last week's atrocity, it is more important than ever to finish carrying out the president's mass deportation operation.\"\nThe post ‘They Must Go Back’: Leavitt Says National Guard Shooting Shows Trump’s Mass Deportations Must Continue first app…",
    "link": "https://www.mediaite.com/media/news/they-must-go-back-leavitt-says-national-guard-shooting-shows-trumps-mass-deportations-must-continue/",
    "timestamp": "2025-12-01T19:20:00Z"
  },
  {
    "title": "Only One President Was Less Popular Than Trump Is Right Now: Poll",
    "description": "A recent series of polls are signaling disaster for President Donald Trump’s hopes of carrying the Republican Party through the 2026 midterm elections. CNN’s chief data analyst Harry Enten on Monday discussed several different polls that found that Trump had …",
    "link": "https://newrepublic.com/post/203799/donald-trump-popular-poll-richard-nixon",
    "timestamp": "2025-12-01T19:17:45Z"
  },
  {
    "title": "Zelenskyy eyes talks with Trump on 'key issues' as Witkoff heads to Moscow",
    "description": "The Ukrainian president meets French President Emmanuel Macron in Paris as he sounds out European allies on Washington's blueprint to end Russia's war.",
    "link": "https://www.abc.net.au/news/2025-12-02/zelenskyy-eyes-trump-talks-witkoff-heads-to-moscow/106081316",
    "timestamp": "2025-12-01T19:17:34Z"
  },
  {
    "title": "Trump, Macron discuss situation in Ukraine",
    "description": "United States President Donald Trump and French President Emmanuel Macron discussed the situation in Ukraine earlier today during a phone call, the French presidency announced on Monday.Following Macr...",
    "link": "https://biztoc.com/x/1e91b1107dd18e16",
    "timestamp": "2025-12-01T19:15:18Z"
  },
  {
    "title": "Trump to meet national security team on Venezuela",
    "description": "White House Press Secretary Karoline Leavitt confirmed on Monday that President Donald Trump will meet with his national security team to discuss the situation in Venezuela. The meeting should take pl...",
    "link": "https://biztoc.com/x/e0751fba5647fc61",
    "timestamp": "2025-12-01T19:14:46Z"
  },
  {
    "title": "Americanswers… On 5 Live! Why has the US been accused of war crimes off the Venezuelan coast?",
    "description": "Secretary of War Pete Hegseth has called the claims “fake news”",
    "link": "https://www.bbc.co.uk/sounds/play/p0mkwyjd",
    "timestamp": "2025-12-01T19:12:00Z"
  },
  {
    "title": "The View hosts accuse Trump of ‘normalizing’ ableist slur: ‘Shame on him for picking on the most vulnerable’",
    "description": "President directed the derogatory slur at Minnesota Governor Tim Walz over the state’s Somali refugees",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/the-view-trump-tim-walz-slur-b2875819.html",
    "timestamp": "2025-12-01T19:11:53Z"
  },
  {
    "title": "‘Home Is Where the Heart Is’: Melania Trump decorates the White House, except for the demolished East Wing",
    "description": "The official White House Christmas tree had to move because the covered walkway, or colonnade, connecting it to the East Wing no longer exists.",
    "link": "https://fortune.com/2025/12/01/melania-trump-christmas-decorations-demolished-east-wing-home-where-heart-is/",
    "timestamp": "2025-12-01T19:09:52Z"
  },
  {
    "title": "American-Led Regime Change Is Usually Disastrous",
    "description": "The arrogance that led to Iraq now threatens catastrophe in Venezuela.",
    "link": "http://foreignpolicy.com/2025/12/01/venezuela-iraq-regime-change-trump/",
    "timestamp": "2025-12-01T19:09:12Z"
  },
  {
    "title": "Trump administration discusses Venezuela amid military build-up concerns",
    "description": "US military build-up near Venezuela raises fearof invasion; White House defends kill order of alleged drug smugglers.",
    "link": "https://www.aljazeera.com/news/2025/12/1/trump-administration-discusses-venezuela-amid-military-build-up-concerns",
    "timestamp": "2025-12-01T19:06:58Z"
  },
  {
    "title": "Soros-Backed DA Ditches Death Penalty Against Machete-Wielding Illegal Immigrant In Beheading Case",
    "description": "Democratic District Attorney John Creuzot of Dallas County is not seeking the death penalty against an illegal immigrant charged with beheading a motel manager.",
    "link": "https://dailycaller.com/2025/12/01/soros-backed-da-ditches-death-penalty-against-machete-wielding-illegal-immigrant-in-beheading-case/",
    "timestamp": "2025-12-01T19:04:15Z"
  },
  {
    "title": "‘Betrayal!’ Karoline Leavitt Blames Joe Biden’s ‘Horrific Leadership’ for DC National Guard Shooting",
    "description": "Karoline Leavitt slammed Joe Biden for the \"debacle\" of allowing Afghans into the U.S., saying he had \"no regard for the disorder and violence\" this would cause\nThe post ‘Betrayal!’ Karoline Leavitt Blames Joe Biden’s ‘Horrific Leadership’ for DC National Gua…",
    "link": "https://www.mediaite.com/media/betrayal-karoline-leavitt-blames-joe-bidens-horrific-leadership-for-dc-national-guard-shooting/",
    "timestamp": "2025-12-01T19:03:49Z"
  },
  {
    "title": "Trump Says Pause On Asylum Decisions Will Be In Place For 'A Long Time'",
    "description": "Trump Says Pause On Asylum Decisions Will Be In Place For 'A Long Time'\n \nAuthored by Aldgra Fredly via The Epoch Times (emphasis ours),\nPresident Donald Trump said on Nov. 30 that the freeze on asylum decisions, which was imposed following the shooting of tw…",
    "link": "https://biztoc.com/x/c5c6041773cc5888",
    "timestamp": "2025-12-01T19:03:47Z"
  },
  {
    "title": "Venezuelan parliament suspends session on US attacks investigation",
    "description": "At least 83 people have been killed by US troops off Venezuela's coast.",
    "link": "https://www.channelnewsasia.com/world/venezuela-trump-us-attack-boats-meeting-5520986",
    "timestamp": "2025-12-01T19:03:36Z"
  },
  {
    "title": "WH confirms Trump to meet security team on Venezuela",
    "description": "White House Press Secretary Karoline Leavitt confirmed on Monday that President Donald Trump will meet with his National Security Team to discuss the situation in Venezuela. The meeting should take pl...",
    "link": "https://biztoc.com/x/9bd7229184a2323e",
    "timestamp": "2025-12-01T19:03:31Z"
  },
  {
    "title": "Conservatives ahead of governing party in Honduras presidential vote, as Trump effect debated",
    "description": "With votes from about 56% of polling places counted in Honduras, preliminary and partial results showed conservative candidates Nasry Asfura and Salvador Nasralla leading the presidential contest early Monday and the governing party trailing",
    "link": "https://abcnews.go.com/International/wireStory/conservatives-ahead-governing-party-honduras-presidential-vote-trump-127991981",
    "timestamp": "2025-12-01T19:01:33Z"
  },
  {
    "title": "OUTRAGE ON CAPITOL HILL: Rogue Judges Boasberg and Boardman Now Refuse to Testify Before the Senate",
    "description": "Two activist judges with a track record of sabotaging President Trump’s America First agenda have just ghosted a critical Senate hearing aimed at exposing judicial overreach. U.S. District Judge James Boasberg and U.S. District Judge Deborah Boardman have bot…",
    "link": "https://freerepublic.com/focus/f-news/4355476/posts",
    "timestamp": "2025-12-01T18:59:32Z"
  },
  {
    "title": "As Russia and Ukraine mull Trump’s peace proposal, land and security seen as main sticking points",
    "description": "Diplomats face an uphill battle to reconcile Russia’s and Ukraine’s “red lines” as a U.S.-led push to end the war gathers steam.",
    "link": "https://www.pbs.org/newshour/world/as-russia-and-ukraine-mull-trumps-peace-proposal-land-and-security-seen-as-main-sticking-points",
    "timestamp": "2025-12-01T18:53:58Z"
  },
  {
    "title": "Trump, Speaker Johnson, AOC blitz campaign trail on eve of crucial congressional showdown",
    "description": "Trump and House Speaker Johnson rally Tennessee Republicans as GOP fights to hold House seat in special election. Matt Van Epps faces Democrat Aftyn Behn in closely watched race.",
    "link": "https://www.foxnews.com/politics/trump-speaker-johnson-aoc-blitz-campaign-trail-eve-crucial-congressional-showdown",
    "timestamp": "2025-12-01T18:53:08Z"
  },
  {
    "title": "Kash Patel Busted Playing Dress-Up Like A Real FBI Agent",
    "description": "The image-obsessed weirdo strikes again.",
    "link": "https://www.wonkette.com/p/kash-patel-busted-playing-dress-up",
    "timestamp": "2025-12-01T18:52:54Z"
  },
  {
    "title": "Melania Trump unveils grand White House Christmas decorations with tree-lined hallways and Lego Trump portrait",
    "description": "The first lady has previously been criticized for her decorations during Donald Trump’s first term",
    "link": "https://www.the-independent.com/life-style/melania-trump-white-house-christmas-decor-b2875939.html",
    "timestamp": "2025-12-01T18:50:55Z"
  },
  {
    "title": "Podcast: Zelensky's Irish visit as peace talks continue",
    "description": "Ahead of President Zelensky's first visit to Ireland, Political Coverage Editor Joe Mag Raollaigh outlines the schedule for him and First Lady Olena Zelenska, and the large security operation that has swung into place.",
    "link": "https://www.rte.ie/news/2025/1201/1546760-podcast-zelenskys-irish-visit-as-peace-talks-continue/",
    "timestamp": "2025-12-01T18:48:52Z"
  },
  {
    "title": "Mexican Military Kills Alleged Fentanyl Trafficker Wanted By US",
    "description": "An alleged fentanyl trafficker was killed Sunday during an anti-drug operation led by the Mexican military, according to officials.",
    "link": "https://dailycaller.com/2025/12/01/pedro-inzunza-coronel-pichon-fentanyl-trafficker-dead-mexico-military/",
    "timestamp": "2025-12-01T18:48:18Z"
  },
  {
    "title": "Trump's Unhinged Rant: The Don Posts and Quickly Deletes Typo-Filled Late-Night Message as Dementia Concerns Ramp Up",
    "description": "Donald Trump went on a wild, typo-filled rant to close out Thanksgiving weekend amid dementia concerns.",
    "link": "https://radaronline.com/p/trump-truth-social-rant-deleted-typos-dementia-concerns/",
    "timestamp": "2025-12-01T18:47:03Z"
  },
  {
    "title": "Joe Rogan Blames Alcohol Lobbyists for Federal Hemp Ban — But the Truth Is a Little More Complicated",
    "description": "Read the rest of this entry »\nThe post Joe Rogan Blames Alcohol Lobbyists for Federal Hemp Ban — But the Truth Is a Little More Complicated first appeared on Mediaite.",
    "link": "https://thedailypour.com/no-low-alcohol/cannabis-infused-drinks/joe-rogan-alcohol-federal-hemp-ban/",
    "timestamp": "2025-12-01T18:46:56Z"
  },
  {
    "title": "What is Alina Habba's net worth? Ex-Trump Lawyer barred from serving as acting US attorney in New Jersey",
    "description": "Alina Habba's financial standing is under scrutiny. Her net worth is estimated between one million and five million dollars. This comes as a federal court blocked her from leading the US attorney's office in New Jersey. The court cited federal vacancy rules. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/alina-habbas-net-worth-lawyer-blocked-from-serving-as-acting-us-attorney-in-new-jersey/articleshow/125701892.cms",
    "timestamp": "2025-12-01T18:46:28Z"
  },
  {
    "title": "White House Media Attack Falls Apart After It Mistakenly Calls Fox ‘Woke’",
    "description": "Fox News said its inclusion on a White House webpage of \"Media Offenders\" was a case of mistaken identity.",
    "link": "https://www.huffpost.com/entry/white-house-media-hall-of-shame-fox-woke_n_692db994e4b0c8c3c7ce6e19",
    "timestamp": "2025-12-01T18:46:11Z"
  },
  {
    "title": "At least 9 Indiana Republicans were swatting targets amid redistricting pressure from Trump",
    "description": "At least nine elected Republicans in Indiana have been the target of swatting attacks in the weeks since President Donald Trump publicly pressured state lawmakers to pass new congressional maps that would benefit Republicans",
    "link": "https://www.nbcnews.com/politics/2026-election/indiana-republicans-swatting-attacks-redistricting-rcna246689",
    "timestamp": "2025-12-01T18:44:04Z"
  },
  {
    "title": "Trump was right to snub Johannesburg’s G20 summit: South Africa’s corruption and human rights abuses are deplorable",
    "description": "The rule of the African National Congress (ANC) in South Africa since 1994 has been marked by a widening chasm between poor black people, the majority and a tiny black elite, who get richer and richer. A quarter of our children are so badly malnourished that …",
    "link": "https://freerepublic.com/focus/f-news/4355473/posts",
    "timestamp": "2025-12-01T18:44:01Z"
  },
  {
    "title": "Bitcoin slinks to shadows as crypto bros turn to new kid on the blockchain",
    "description": "It remains a useful tool for some nefarious operators, including global crime gangs and questionable governments, but Bitcoin's role has been usurped by stablecoins — one in particular.",
    "link": "https://www.abc.net.au/news/2025-12-02/bitcoin-losing-to-tether-as-money-launderers-currency-of-choice/106086594",
    "timestamp": "2025-12-01T18:41:28Z"
  },
  {
    "title": "Trump Downplays Venezuelan Airspace Threat",
    "description": "President Donald Trump said people shouldn’t read much into a social media post where he said Venezuelan airspace should be considered closed.\nThe US is enacting a widening campaign in the Caribbean, including deploying additional Navy ships to the region, ad…",
    "link": "https://biztoc.com/x/9478d808a19bce77",
    "timestamp": "2025-12-01T18:40:53Z"
  },
  {
    "title": "The Ukraine regions Vladimir Putin does not hold, but wants anyway",
    "description": "Donald Trump is expected to send his special envoy Steven Witkoff to Moscow this week to talk about a revised proposal for peace in Ukraine. There are five regions central to negotiations and Vladimir Putin wants them all.",
    "link": "https://www.abc.net.au/news/2025-12-02/trump-concept-for-ukraine-in-maps-as-putin-negotiations-continue/106046750",
    "timestamp": "2025-12-01T18:38:48Z"
  },
  {
    "title": "Lawmakers from both parties have launched congressional reviews of U.S. military strikes against vessels suspected of smuggling drugs",
    "description": "Lawmakers from both parties have launched congressional reviews of U.S. military strikes against vessels suspected of smuggling drugswmur.com",
    "link": "https://www.wmur.com/article/lawmakers-urge-review-trump-military-strikes-boats/69592649",
    "timestamp": "2025-12-01T18:35:32Z"
  },
  {
    "title": "Melania Trump Makes Christmas Spooky Again",
    "description": "Melania Trump Makes Christmas Spooky Again. The First Lady’s all-black outfit and the president’s glowering, bloody portraits are giving the 2025 White House Christmas decorations an ominous vibe, just like in the first Trump administration.",
    "link": "http://nymag.com/intelligencer/article/melania-trump-makes-christmas-spooky-again.html",
    "timestamp": "2025-12-01T18:31:20Z"
  },
  {
    "title": "Polymarket war bets collide with the maps civilians use to survive",
    "description": "The first thing many Ukrainians check in the morning is not Instagram or email, it is a war map. DeepStateMap.Live, a volunteer-built OSINT project, shows which villages are under occupation, where Ukrainian advances hold, and where the front looks fragile. I…",
    "link": "https://cryptoslate.com/polymarket-war-bets-collide-with-the-maps-civilians-use-to-survive/",
    "timestamp": "2025-12-01T18:30:59Z"
  },
  {
    "title": "Crypto downturn wipes out nearly US$1 billion in levered bets",
    "description": "Nearly US$1 billion of leveraged crypto positions were liquidated during another sharp drop in prices on Monday. Find out more here",
    "link": "https://financialpost.com/fp-finance/cryptocurrency/crypto-downturn-wipes-out-levered-bets",
    "timestamp": "2025-12-01T18:30:27Z"
  },
  {
    "title": "Honduras votes amid Trump push, pardon vow",
    "description": "What happened\nHonduran presidential candidate Nasry “Tito” Asfura of the conservative National Party took a narrow early lead in Sunday’s national elections, days after President Donald Trump endorsed him and criticized his two main rivals. On Friday, Trump s…",
    "link": "https://biztoc.com/x/e25c5dea489ac633",
    "timestamp": "2025-12-01T18:30:03Z"
  },
  {
    "title": "As regime change looms at the Fed, one candidate emerges as frontrunner for chair",
    "description": "President Donald Trump knows who he's going to select as the next Federal Reserve chair but isn't saying yet.",
    "link": "https://biztoc.com/x/c40dd4f12fd1f10a",
    "timestamp": "2025-12-01T18:29:51Z"
  },
  {
    "title": "Nvidia’s $2 Billion Synopsys Investment Makes 2025’s Top AI Deals (Full List, Ranked)",
    "description": "Spending on AI has accelerated in recent months, as Wall Street anticipates global expenditures nearing half a trillion dollars by 2026.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/12/01/nvidias-2-billion-synopsys-investment-makes-2025s-top-ai-deals-full-list-ranked/",
    "timestamp": "2025-12-01T18:29:50Z"
  },
  {
    "title": "Mike Johnson, Al Gore stump in high-stakes TN congressional race",
    "description": "As Democrat Aftyn Behn closes the gap in a historically GOP district, Speaker Mike Johnson seeks to defend Republicans' razor-thin House majority.",
    "link": "https://www.tennessean.com/story/news/politics/2025/12/01/mike-johnson-al-gore-matt-van-epps-aftyn-behn/87550678007/",
    "timestamp": "2025-12-01T18:28:26Z"
  },
  {
    "title": "Lawmakers from both parties have launched congressional reviews of U.S. military strikes against vessels suspected of smuggling drugs",
    "description": "Lawmakers from both parties have launched congressional reviews of U.S. military strikes against vessels suspected of smuggling drugswcvb.com",
    "link": "https://www.wcvb.com/article/lawmakers-urge-review-trump-military-strikes-boats/69592649",
    "timestamp": "2025-12-01T18:26:19Z"
  },
  {
    "title": "Zelenskyy says Trump’s peace plan ‘looks better' with revisions ahead of his trip to Dublin",
    "description": "Zelensky was speaking in Paris after meeting Emmanuel Macron in the latest discussions aimed at brokering the terms for a potential ceasefire.",
    "link": "https://www.thejournal.ie/zelenskyy-says-trumps-peace-plan-looks-better-ahead-of-dublin-trip-6890471-Dec2025/",
    "timestamp": "2025-12-01T18:25:07Z"
  },
  {
    "title": "Lawmakers skeptical of alleged Hegseth kill orders in Venezuela — but issue stark warning",
    "description": "Congress launches bipartisan probe into the Trump administration's controversial Caribbean drug strikes after reports allege Pete Hegseth ordered killing survivors.",
    "link": "https://www.foxnews.com/politics/lawmakers-skeptical-alleged-hegseth-kill-orders-venezuela-issue-stark-warning",
    "timestamp": "2025-12-01T18:24:25Z"
  },
  {
    "title": "‘The choice isn’t between domestic and foreign talent; the nation was built on both’",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-science-pharmacies-europe-netanyahu",
    "timestamp": "2025-12-01T18:23:27Z"
  },
  {
    "title": "Zelenskiy says US peace plan ‘looks better’ with revisions but work continues",
    "description": "Putin to meet US special envoy Steve Witkoff on Tuesday",
    "link": "https://www.irishtimes.com/world/europe/2025/12/01/zelenskiy-says-us-peace-plan-looks-better-with-revisions-but-work-continues/",
    "timestamp": "2025-12-01T18:22:50Z"
  },
  {
    "title": "TSA Breaks Screening Record over Thanksgiving Weekend",
    "description": "The Transportation Security Administration (TSA) broke a record in screening the highest number of individuals ever on Sunday, November 30, the federal agency revealed on Monday. “BREAKING NEWS: Yesterday, TSA screened about 3,133,924 individuals, the highest…",
    "link": "https://www.breitbart.com/politics/2025/12/01/tsa-breaks-screening-record-over-thanksgiving-weekend-highest-number-ever-in-tsas-history/",
    "timestamp": "2025-12-01T18:22:28Z"
  },
  {
    "title": "Land and security are the main sticking points as Russia and Ukraine mull Trump's peace proposal",
    "description": "Diplomats are working to end the Russia-Ukraine war. The US is leading new peace talks. Ukrainian and Russian officials are meeting with US representatives. Key issues like land cession and Ukraine's security remain unresolved. President Putin demands Ukraini…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/land-and-security-are-the-main-sticking-points-as-russia-and-ukraine-mull-trumps-peace-proposal/articleshow/125701263.cms",
    "timestamp": "2025-12-01T18:20:54Z"
  },
  {
    "title": "As regime change looms at the Fed, one candidate emerges as frontrunner for chair",
    "description": "President Donald Trump knows who he's going to select as the next Federal Reserve chair but isn't saying yet.",
    "link": "https://www.cnbc.com/2025/12/01/as-regime-change-looms-at-the-fed-one-candidate-emerges-as-frontrunner-for-chair.html",
    "timestamp": "2025-12-01T18:18:01Z"
  },
  {
    "title": "Trump Says He Has No Idea What The MRI Was For",
    "description": "Donald Trump, in a nasty fashion, told reporters on Air Force One over the weekend that he would release his MRI results, but had no idea what part of the body the test was done on, except that he aced the cognitive test.\nGov. Walz certainly got under Trump's…",
    "link": "https://crooksandliars.com/2025/12/trump-no-idea-MRI",
    "timestamp": "2025-12-01T18:15:42Z"
  },
  {
    "title": "Trump Warns Israel Not to ‘Interfere’ in ‘Syria’s Evolution’ After Military Clash",
    "description": "\"It is very important that Israel maintain a strong and true dialogue with Syria, and that nothing takes place that will interfere with Syria’s evolution\"\nThe post Trump Warns Israel Not to ‘Interfere’ in ‘Syria’s Evolution’ After Military Clash first appeare…",
    "link": "https://www.mediaite.com/media/news/trump-warns-israel-not-to-interfere-in-syrias-evolution-after-military-clash/",
    "timestamp": "2025-12-01T18:15:40Z"
  },
  {
    "title": "'Kids Know Better': Walz Hits Trump For Slur Tossed During Unhinged Thanksgiving Rant",
    "description": "Gov. Tim Walz whacked Trump for normalizing the sort of behavior we saw from him during his unhinged rant on Thanksgiving, where the narcissist did his best to ruin the holiday for everyone and called Walz \"retarded.\"\nMeet the Press host Kristen Welker asked …",
    "link": "https://crooksandliars.com/2025/11/kids-know-better-walz-hits-trump-slur",
    "timestamp": "2025-12-01T18:15:35Z"
  },
  {
    "title": "Honduras: Results Unclear in Razor-Thin Presidential Race -- But Ruling Socialists Out",
    "description": "Preliminary results from Honduran authorities indicate that conservative candidate Nasry Asfura is narrowly leading the presidential election.\nThe post Honduras: Results Unclear in Razor-Thin Presidential Race — But Ruling Socialists Out appeared first on Bre…",
    "link": "https://www.breitbart.com/national-security/2025/12/01/honduras-results-unclear-razor-thin-presidential-race-ruling-socialists-out/",
    "timestamp": "2025-12-01T18:09:17Z"
  },
  {
    "title": "Trump says Israel must seek ‘strong and true dialogue’ with Syria",
    "description": "Donald Trump warns against actions that could 'interfere with Syria’s evolution' amid new Israeli incursion, strikes.",
    "link": "https://www.aljazeera.com/news/2025/12/1/trump-says-israel-must-seek-strong-and-true-dialogue-with-syria",
    "timestamp": "2025-12-01T18:09:08Z"
  },
  {
    "title": "‘Why Would We Pardon This Guy?’ GOP Senator Trashes Trump’s Pardon of Former Honduran President",
    "description": "A GOP senator questioned why Donald Trump pardoned former Honduran president Juan Orlando Hernandez, who was serving 45 years for drug trafficking.\nThe post ‘Why Would We Pardon This Guy?’ GOP Senator Trashes Trump’s Pardon of Former Honduran President first …",
    "link": "https://www.mediaite.com/media/news/why-would-we-pardon-this-guy-gop-senator-trashes-trumps-pardon-of-former-honduran-president/",
    "timestamp": "2025-12-01T18:08:48Z"
  },
  {
    "title": "Trump Pressures Republicans as Indiana Mulls Redistricting",
    "description": "The Indiana State House is set to convene this afternoon to discuss a redistricting effort to boost Republicans chances in the 2026 midterms. President Donald... Read More\nThe post Trump Pressures Republicans as Indiana Mulls Redistricting appeared first on T…",
    "link": "https://www.dailysignal.com/2025/12/01/trump-pressures-republicans-as-indiana-mulls-redistricting/",
    "timestamp": "2025-12-01T18:08:01Z"
  },
  {
    "title": "Why Trump’s 'very evident' decline is so 'devastating' for MAGA: analysis",
    "description": "During former President Joe Biden's four years in the White House, Donald Trump repeatedly attacked \"Sleepy Joe\" as being in both physical and mental decline. But now that the 79-year-old President Trump is back in the White House, he becomes furious when sim…",
    "link": "https://www.rawstory.com/alternet-posts/trump-lurie-mental-decline/",
    "timestamp": "2025-12-01T18:08:00Z"
  },
  {
    "title": "Following National Guard shooting, Trump vows to ‘denaturalize migrants’",
    "description": "Donald Trump has seized on the shooting of two National Guard members in Washington, D.C., in ways that are consistent with the president’s anti-immigrant vision. Almost immediately in the wake of Wednesday’s deadly violence, for example, the Republican said …",
    "link": "https://biztoc.com/x/8cae95684319118d",
    "timestamp": "2025-12-01T18:07:29Z"
  },
  {
    "title": "Western senators cannot support this Trump nominee who wants to liquidate public lands (Opinion)",
    "description": "Trump's BLM nominee Steve Pearce’s vision for our public lands is not conservation or even balanced management -- it’s liquidation.",
    "link": "https://www.denverpost.com/2025/12/01/steve-pearce-trump-blm-public-lands/",
    "timestamp": "2025-12-01T18:05:13Z"
  },
  {
    "title": "Is Trump’s $2,000 tariff dividend coming in December 2025? IRS stimulus updates and who may qualify",
    "description": "IRS stimulus check: Trump’s $2,000 tariff dividend: Trump’s proposed $2,000 tariff dividend is driving new questions as December 2025 begins. Many want to know what the IRS is preparing, what Congress may allow, and who might qualify if any payment moves forw…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-trumps-2000-tariff-dividend-coming-in-december-2025-irs-stimulus-updates-and-who-may-qualify/articleshow/125699513.cms",
    "timestamp": "2025-12-01T18:04:02Z"
  },
  {
    "title": "Trump says asylum suspension may be indefinite: “We don’t want these people”",
    "description": "The US president called several countries \"unfriendly\", left open the possibility of stripping citizens of their citizenship and attacked a Democratic Muslim congresswoman\nThe post Trump says asylum suspension may be indefinite: “We don’t want these people” a…",
    "link": "https://en.protothema.gr/2025/12/01/trump-says-asylum-suspension-may-be-indefinite-we-dont-want-these-people/",
    "timestamp": "2025-12-01T18:03:23Z"
  },
  {
    "title": "Ex-Secretary of Defense Declares There’s No Question a ‘War Crime’ Was Committed if Hegseth Attacked Drug Boat Survivors",
    "description": "Former Defense Secretary Leon Panetta said there is no doubt Pete Hegseth committed a \"war crime,\" if a recent WaPo story on a second drug boat strike is true\nThe post Ex-Secretary of Defense Declares There’s No Question a ‘War Crime’ Was Committed if Hegseth…",
    "link": "https://www.mediaite.com/politics/ex-secretary-of-defense-declares-theres-no-question-a-war-crime-was-committed-if-hegseth-attacked-drug-boat-survivors/",
    "timestamp": "2025-12-01T18:02:08Z"
  },
  {
    "title": "State panel recommends 3 casino gambling projects in Bronx, Queens",
    "description": "An artist rendering of the proposed Metropolitan Park in Queens.\n \n\nThe board is advancing the Bally’s Bronx, Hard Rock Metropolitan Park and Resorts World New York City proposals. [ more › ]",
    "link": "https://gothamist.com/news/state-panel-recommends-3-casino-gambling-projects-in-bronx-queens",
    "timestamp": "2025-12-01T18:02:00Z"
  },
  {
    "title": "Trump’s Latest Exploitation of a Killing Will Also Fail",
    "description": "Ross Barkan writes that Trump’s effort to whip up anti-immigrant backlash after the National Guard shooting is reminiscent of the post-Charlie Kirk censorship push and will end just as futilely.",
    "link": "http://nymag.com/intelligencer/article/trumps-exploitation-of-national-guard-shooting-will-fail.html",
    "timestamp": "2025-12-01T18:01:14Z"
  },
  {
    "title": "Climate Crisis? The French are Uprooting Vines to Reduce Production",
    "description": "Remember all those times you've been told wine is facing a climate crisis?",
    "link": "https://wattsupwiththat.com/2025/12/01/climate-crisis-the-french-are-uprooting-vines-to-reduce-production/",
    "timestamp": "2025-12-01T18:00:00Z"
  },
  {
    "title": "US appeals court disqualifies Trump ally as US Attorney",
    "description": "Alina Habba has been unlawfully serving as top federal prosecutor for New Jersey",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/12/01/nyregion/alina-habba-unlawful.html",
    "timestamp": "2025-12-01T17:59:24Z"
  },
  {
    "title": "To the Socialists of All Parties",
    "description": "Friedrich Hayek's most popular work was dedicated to \"the socialists of all parties.\" That phrase perfectly captures politics in 2025.",
    "link": "https://reason.com/2025/12/01/to-the-socialists-of-all-parties/",
    "timestamp": "2025-12-01T17:57:00Z"
  },
  {
    "title": "As Trump envoy heads to Moscow, Russian Nobel winner says prisoners' lives are at stake",
    "description": "LONDON, Dec 1 (Reuters) - As a U.S. envoy heads to Moscow to negotiate over a complex blueprint for peace in Ukraine, Russian Nobel Peace Prize winner Dmitry Muratov says a vital element is missing from the agenda. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/02/as-trump-envoy-heads-to-moscow-russian-nobel-winner-says-prisoners039-lives-are-at-stake",
    "timestamp": "2025-12-01T17:56:00Z"
  },
  {
    "title": "Trump Claims $300M White House Ballroom Only Uses Private Donations, Funding as Construction Nears Completion",
    "description": "US President Donald Trump announced that the White House ballroom is almost done. And he claimed not using any money from taxpayers.",
    "link": "https://www.ibtimes.com/trump-claims-300m-white-house-ballroom-only-uses-private-donations-funding-construction-nears-3791722",
    "timestamp": "2025-12-01T17:55:27Z"
  },
  {
    "title": "See photos of Melania Trump’s White House Christmas decorations, including a LEGO Trump",
    "description": "In a change this year after the East Wing was torn down, the official White House Christmas tree in the Blue Room also honors Gold Star families that lost a member during active-duty military service.",
    "link": "https://www.pbs.org/newshour/politics/see-photos-of-melania-trumps-white-house-christmas-decorations-including-a-lego-trump",
    "timestamp": "2025-12-01T17:53:21Z"
  },
  {
    "title": "Kumbaya, Nose-In-The-Air Europeans Mulling Over Same Move As Trump",
    "description": "French lawmakers are considering whether to exclude foreigners from publicly funded health care, a policy similar to one championed by President Donald Trump.",
    "link": "https://dailycaller.com/2025/12/01/france-free-healthcare-long-term-visas-non-eu-foreigners-francois-gernigon/",
    "timestamp": "2025-12-01T17:53:03Z"
  },
  {
    "title": "Scott Jennings Excoriates ‘Total Clown’ Gavin Newsom’s Presidential Prospects",
    "description": "Scott Jennings said he was completely unconcerned about Democratic California Gov. Gavin Newsom's presidential viability.",
    "link": "https://dailycaller.com/2025/12/01/scott-jennings-excoriates-clown-gavin-newsoms-presidential-prospects/",
    "timestamp": "2025-12-01T17:52:39Z"
  },
  {
    "title": "Gas Prices Fall To Lowest In Four Years",
    "description": "Americans are finally seeing relief at the gas pump. Gasoline prices across the U.S. fell to the lowest national average since May of 2021, according to the American Automobile Association. The driver’s club says that on Monday, the national average\nThe post …",
    "link": "https://www.breitbart.com/economy/2025/12/01/gas-prices-fall-to-lowest-in-four-years/",
    "timestamp": "2025-12-01T17:51:55Z"
  },
  {
    "title": "Russia should shed the Soviet lens on India, and embrace its growth story",
    "description": "India and Russia's strategic partnership requires an economic reset.  Bilateral trade has surged due to oil imports, creating a significant deficit for India.  Russia needs to diversify its economic ties beyond China.  India can offer alternatives in sectors …",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/russia-should-shed-the-soviet-lens-on-india-and-embrace-its-growth-story/articleshow/125700384.cms",
    "timestamp": "2025-12-01T17:51:10Z"
  },
  {
    "title": "ICE Barbie Makes U-Turn After Caving to Staff Who Trashed Her Leadership",
    "description": "The Federal Emergency Management Agency has reversed course after reportedly caving to pressure from its own staff, ordering them back to work after they...",
    "link": "https://www.thedailybeast.com/ice-barbie-quietly-caves-in-standoff-with-staff-who-trashed-her-leadership/",
    "timestamp": "2025-12-01T17:46:12Z"
  },
  {
    "title": "FBI Still Reeks Of Trump Derangement Syndrome Months Into Second Admin, Report Finds",
    "description": "Nearly a year into President Donald Trump’s second term, deep resistance to his agenda persists inside the FBI, according to an explosive new report.",
    "link": "https://dailycaller.com/2025/12/01/fbi-tds-report-kash-patel-ice/",
    "timestamp": "2025-12-01T17:45:40Z"
  },
  {
    "title": "Trump, Netanyahu discuss Gaza in phone call",
    "description": "United States President Donald Trump spoke with Israeli Prime Minister Benjamin Netanyahu on the phone on Monday to discuss the situation in Gaza, the prime minister's office announced.The two leaders...",
    "link": "https://biztoc.com/x/ac2312899b26efd7",
    "timestamp": "2025-12-01T17:45:22Z"
  },
  {
    "title": "AI becomes a political wedge issue, creating odd bedfellows across parties",
    "description": "Artificial intelligence is increasingly emerging as a key wedge issue — not between the major political parties, but within them.",
    "link": "https://www.nbcnews.com/politics/elections/ai-wedge-issue-midterms-2028-bedfellows-rcna244811",
    "timestamp": "2025-12-01T17:43:32Z"
  },
  {
    "title": "Trump warns Israel not to 'interfere' in Syria",
    "description": "U.S. President Donald Trump warned Israel on Dec. 1 against destabilizing Syria and its new leadership, days after a deadly operation by Israeli forces in the south of the country.",
    "link": "https://www.hurriyetdailynews.com/trump-warns-israel-not-to-interfere-in-syria-216349",
    "timestamp": "2025-12-01T17:43:04Z"
  },
  {
    "title": "Ghosted on Capitol Hill: Rogue anti-Trump judges now refuse to testify before U.S. Senate",
    "description": "'I can promise you that the last thing in the world they would want to do ... is answering questions under oath from United States senators'",
    "link": "https://www.wnd.com/2025/12/ghosted-capitol-hill-rogue-anti-trump-judges-now/",
    "timestamp": "2025-12-01T17:38:00Z"
  },
  {
    "title": "‘There Is No Greater Genius’: Josh Brolin Praises Donald Trump",
    "description": "Hollywood actor Josh Brolin praised President Donald Trump's marketing instincts in a Saturday interview with The Independent.",
    "link": "https://dailycaller.com/2025/12/01/josh-brolin-donald-trump-marketing-skills-praise-actor/",
    "timestamp": "2025-12-01T17:36:35Z"
  },
  {
    "title": "Minnesota judge under fire for tossing $7.2M taxpayer-fraud conviction tied to alleged ‘lavish lifestyle’",
    "description": "Minnesota judge Sarah West sparks controversy after overturning jury's guilty verdict in $7.2 million Medicaid fraud case, citing insufficient evidence.",
    "link": "https://www.foxnews.com/us/minnesota-judge-under-fire-tossing-7-2m-taxpayer-fraud-conviction-tied-alleged-lavish-lifestyle",
    "timestamp": "2025-12-01T17:36:30Z"
  },
  {
    "title": "US accused of killing Venezuelan drug boat survivors – Trump’s military agenda is based on impunity",
    "description": "The Trump administration’s military strategy in Latin America breaches long-established legal rules and norms in three key ways.",
    "link": "https://theconversation.com/us-accused-of-killing-venezuelan-drug-boat-survivors-trumps-military-agenda-is-based-on-impunity-270891",
    "timestamp": "2025-12-01T17:36:20Z"
  },
  {
    "title": "The Defense Department is investigating Kelly over the ‘illegal orders’ video. Experts doubt they can actually prosecute him",
    "description": "President Donald Trump has accused Kelly and the five other Democratic lawmakers in the video of sedition \"punishable by DEATH.\"",
    "link": "https://biztoc.com/x/bfb1dc86465762c1",
    "timestamp": "2025-12-01T17:34:22Z"
  }
]