[
  {
    "title": "Trump suggests 'maybe' pulling licences from TV networks critical of him after Kimmel suspension",
    "description": "ABC suspended Jimmy Kimmel’s talk show after the host mocked Trump’s response to Charlie Kirk’s killing.",
    "link": "https://www.thejournal.ie/trump-pulling-tv-networks-criticism-kimmel-6821057-Sep2025/",
    "timestamp": "2025-09-19T06:42:39Z"
  },
  {
    "title": "‘Blatant Censorship’: Late Night Hosts React To Kimmel Being Taken Off Air",
    "description": "Stephen Colbert referred to Trump as an “autocrat” and the FCC’s actions as “blatant censorship”, while Jon Stewart hosted a parody “government-approved” version of his show.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/09/19/blatant-censorship-late-night-hosts-react-to-kimmel-being-taken-off-air/",
    "timestamp": "2025-09-19T06:42:14Z"
  },
  {
    "title": "Jon Stewart’s gold-encrusted, Trump-praising take on Jimmy Kimmel: ‘Free speech means speech that supports the president’",
    "description": "Jon Stewart’s gold-encrusted, Trump-praising take on Jimmy Kimmel: ‘Free speech means speech that supports the president’nj.com",
    "link": "https://www.nj.com/entertainment/2025/09/jon-stewarts-has-gold-encrusted-trump-praising-take-on-jimmy-kimmel-free-speech-means-speech-that-supports-the-president.html",
    "timestamp": "2025-09-19T06:36:44Z"
  },
  {
    "title": "What Jimmy Kimmel said about Charlie Kirk shooting that got his late-night show axed",
    "description": "ABC has pulled host’s series from TV schedules ‘indefinitely’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-charlie-kirk-trump-b2829609.html",
    "timestamp": "2025-09-19T06:36:03Z"
  },
  {
    "title": "US late-night comedians criticise Kimmell censorship",
    "description": "Following the suspension of Jimmy Kimmel, fellow.US late-night comedians used their Thursday programmes to criticise government censorship.",
    "link": "https://www.rte.ie/entertainment/2025/0919/1534256-us-late-night-comedians-criticise-kimmell-censorship/",
    "timestamp": "2025-09-19T06:24:49Z"
  },
  {
    "title": "Kirk killing sparks fierce US free speech debate",
    "description": "For Americans, the words are practically sacred: the First Amendment to the U.S. Constitution guarantees freedom of speech.",
    "link": "https://www.hurriyetdailynews.com/kirk-killing-sparks-fierce-us-free-speech-debate-213775",
    "timestamp": "2025-09-19T06:24:23Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Friday",
    "description": "German minister calls for Google to be broken up, controls on external borders 'becoming unsustainable', evacuations in Berlin and more news from around Germany on Friday, September 19th.",
    "link": "https://www.thelocal.de/20250919/today-in-germany-a-roundup-of-the-latest-news-on-friday-93",
    "timestamp": "2025-09-19T06:23:33Z"
  },
  {
    "title": "Senate Democrats introduce bill for U.S. recognition of Palestine",
    "description": "Democrats have introduced a first-of-its kind bill into the U.S. Senate to call on President Donald Trump to recognize a Palestinian state.",
    "link": "https://www.upi.com/Top_News/US/2025/09/19/Jeff-Merkley-Palestine-State/7751758260160/",
    "timestamp": "2025-09-19T06:23:26Z"
  },
  {
    "title": "South African minister meets USTR Greer for trade talks",
    "description": "JOHANNESBURG (Reuters) -South Africa's Trade Minister Parks Tau met U.S. Trade Representative Jamieson Greer for talks, Tau's office said on Friday, as Africa's biggest economy tries to agree a deal to roll back steep U.S. tariffs. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/19/south-african-minister-meets-ustr-greer-for-trade-talks",
    "timestamp": "2025-09-19T06:16:00Z"
  },
  {
    "title": "Trump hopes to settle TikTok's fate on Xi call",
    "description": "WASHINGTON: President Donald Trump, who recently accused Xi Jinping of working to \"conspire\" against the United States, hopes to finalise the fate of video-sharing app TikTok and make progress on trade talks",
    "link": "https://www.channelnewsasia.com/world/donald-trump-hopes-settle-tiktok-xi-jinping-call-5357741",
    "timestamp": "2025-09-19T06:13:00Z"
  },
  {
    "title": "Jimmy Fallon speaks out on Jimmy Kimmel suspension for first time as he reveals how it will affect his show",
    "description": "Jimmy Fallon has spoken out on the suspension of Jimmy Kimmel for the first time and has revealed how it could impact his own show",
    "link": "https://www.ladbible.com/news/us-news/jimmy-fallon-jimmy-kimmel-suspension-donald-trump-us-017000-20250919",
    "timestamp": "2025-09-19T06:09:19Z"
  },
  {
    "title": "US Senate approves 48 Trump nominees in a single vote",
    "description": "Mass approval of nominees follows rules change that make it easier to approve lower-level Trump nominations.",
    "link": "https://www.aljazeera.com/news/2025/9/19/us-senate-approves-48-trump-nominees-in-a-single-vote",
    "timestamp": "2025-09-19T06:08:44Z"
  },
  {
    "title": "Putin has let me down, says Trump at end of UK state visit",
    "description": "Donald Trump warned that Russian President Vladimir Putin had \"really let me down\" after he met Prime Minister Keir Starmer on Thursday, the final day of the U.S. president's historic U.K. state visit.",
    "link": "https://www.hurriyetdailynews.com/putin-has-let-me-down-says-trump-at-end-of-uk-state-visit-213773",
    "timestamp": "2025-09-19T06:06:38Z"
  },
  {
    "title": "US TV networks grapple with potential future implications of Jimmy Kimmel suspension",
    "description": "Under Trump, TV network’s grapple with potential future implications of host being placed in cold storage",
    "link": "https://www.irishtimes.com/world/us/2025/09/19/us-tv-networks-grapple-with-potential-future-implications-of-jimmy-kimmel-suspension/",
    "timestamp": "2025-09-19T06:05:58Z"
  },
  {
    "title": "Eleven Democratic politicians arrested at ICE jail in Manhattan",
    "description": "About a dozen New York state and local elected officials were arrested on Thursday during protests at a Manhattan building where US Immigration and Customs Enforcement agents operate holding cells cited by a federal judge for inhumane conditions.",
    "link": "https://www.independent.ie/world-news/eleven-democratic-politicians-arrested-at-ice-jail-in-manhattan/a1425963267.html",
    "timestamp": "2025-09-19T06:03:08Z"
  },
  {
    "title": "Israeli forces intensify Gaza City assault as US vetoes UN ceasefire bid",
    "description": "Israeli tanks and jets hammered Gaza City on Friday, advancing deeper into the enclave's largest urban center in a major ground offensive that has forced thousands of Palestinians to flee south amid relentless bombardments and a telecommunications blackout, w…",
    "link": "https://www.hurriyetdailynews.com/israeli-forces-intensify-gaza-city-assault-as-us-vetoes-un-ceasefire-bid-213772",
    "timestamp": "2025-09-19T06:02:31Z"
  },
  {
    "title": "It’s official: Trump designates Antifa as TERRORIST organization",
    "description": "President Donald Trump officially declared Antifa a terrorist organization via Truth Social, calling it a “sick, dangerous, radical left disaster” and pledging legal action against its financiers and operatives. The move follows the fatal shooting of conserva…",
    "link": "https://www.naturalnews.com/2025-09-19-president-trump-designates-antifa-as-terrorist-organization.html",
    "timestamp": "2025-09-19T06:00:00Z"
  },
  {
    "title": "Trump defends decision to designate Antifa as domestic TERRORIST organization",
    "description": "President Donald Trump has officially designated Antifa as a domestic terrorist organization, a decision he defended as long overdue due to the group’s “horrible” incitement and actions. The declaration follows the assassination of conservative commentator Ch…",
    "link": "https://www.naturalnews.com/2025-09-19-trump-defends-decision-designate-antifa-domestic-terrorists.html",
    "timestamp": "2025-09-19T06:00:00Z"
  },
  {
    "title": "The UN Turns 80, a Critical Age for People and the UN’s Relevance",
    "description": "Amid the brouhaha over Charlie Kirk’s assassination, Russia’s threatening drones in Poland, Israel’s now confirmed genocide in Gaza and aggression against its neighbors, is it worth talking about the United Nations’ 80th anniversary? Counterintuitively, now i…",
    "link": "https://www.counterpunch.org/2025/09/19/the-un-turns-80-a-critical-age-for-people-and-the-uns-relevance/",
    "timestamp": "2025-09-19T05:58:15Z"
  },
  {
    "title": "The Roading of the Last Wild Places",
    "description": "The Trump administration is plotting to undo a quarter-century of policy for the protection of national forests against new road building. This is a terrible turn for our public lands and needs to be stopped. When I lived in the little town of Moab, Utah, my …",
    "link": "https://www.counterpunch.org/2025/09/19/the-roading-of-the-last-wild-places/",
    "timestamp": "2025-09-19T05:55:53Z"
  },
  {
    "title": "Trump and Xi are set to discuss the TikTok deal and future of US-China relations",
    "description": "Trump, who has credited the app with helping him win another term, has extended a deadline several times for the app to be spun off from its Chinese parent company ByteDance",
    "link": "https://www.thehindubusinessline.com/news/world/trump-and-xi-are-set-to-discuss-the-tiktok-deal-and-future-of-us-china-relations/article70068832.ece",
    "timestamp": "2025-09-19T05:55:32Z"
  },
  {
    "title": "Jimmy Fallon, Stephen Colbert and Seth Meyers unite in Jimmy Kimmel’s support, question ABC and Donald Trump: ‘Blatant censorship’",
    "description": "Following Jimmy Kimmel Live being taken off air, other talk shows hosts like Jimmy Fallon, Seth Myers and Stephen Colbert spoke up against the administration and their decision to curb free speech.",
    "link": "https://indianexpress.com/article/entertainment/hollywood/jimmy-fallon-stephen-colbert-and-seth-meyers-unite-in-jimmy-kimmels-support-question-abc-and-donald-trump-blatant-censorship-10258691/",
    "timestamp": "2025-09-19T05:55:14Z"
  },
  {
    "title": "Late-night hosts reacted to Jimmy Kimmel's suspension with the sharpest tools in their kit: comedy and defiance",
    "description": "Stephen Colbert, Jon Stewart, Seth Meyers, and Jimmy Fallon weighed in on Kimmel's suspension, making jokes about Trump while they were at it.",
    "link": "https://www.businessinsider.com/jon-stewart-stephen-colbert-jimmy-fallon-react-jimmy-kimmel-suspension-2025-9",
    "timestamp": "2025-09-19T05:54:22Z"
  },
  {
    "title": "Seth Meyers Makes Defiant Vow Amid Kimmel Removal Uproar",
    "description": "Seth Meyers Makes Defiant Vow Amid Kimmel Removal Uproarhuffpost.com",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-jimmy-kimmel_n_68cce676e4b01c2e8cb5acf7",
    "timestamp": "2025-09-19T05:54:10Z"
  },
  {
    "title": "Charley Hull gets Trump golf invite at state banquet",
    "description": "The English golfer says the US president is a \"lovely man\" after their conversation.",
    "link": "https://www.bbc.com/news/articles/c62z8kpgxgwo",
    "timestamp": "2025-09-19T05:53:59Z"
  },
  {
    "title": "Seth Meyers calls Trump a ‘visionary, innovator, great president, even better golfer’ in joke following ABC’s indefinite suspension of Kimmel",
    "description": "\"I've always believed he was a visionary, an innovator, a great president, an even better golfer, and if you've ever seen me say anything negative about him, that's just AI,\" Meyers sarcastically quipped.",
    "link": "https://nypost.com/2025/09/19/entertainment/seth-meyers-slams-trump-crackdown-on-free-speech-day-after-abc-axing-of-friend-jimmy-kimmel/",
    "timestamp": "2025-09-19T05:52:01Z"
  },
  {
    "title": "Trump’s Campaign Against Lisa Cook",
    "description": "On Monday, a federal appeals court denied Donald Trump’s attempt to fire Federal Reserve Board Governor Lisa Cook. It remains to be seen what the White House will try to do next, but in the meantime it is valuable to see how we got here in the first place. A …",
    "link": "https://www.counterpunch.org/2025/09/19/trumps-campaign-against-lisa-cook/",
    "timestamp": "2025-09-19T05:50:47Z"
  },
  {
    "title": "Latinos, ex-military, retirees — ICE hopefuls answer Uncle Sam’s call",
    "description": "There is a mixed crowd lining up outside the ICE recruitment fair in Utah, where hundreds of people are eager to join US President Donald Trump’s vast deportation effort. John Wolworth drove eight hours from neighboring Colorado, and was desperate to sign up …",
    "link": "https://www.digitaljournal.com/world/latinos-ex-military-retirees-ice-hopefuls-answer-uncle-sams-call/article",
    "timestamp": "2025-09-19T05:47:20Z"
  },
  {
    "title": "Latinos, Ex-military, Retirees -- ICE Hopefuls Answer Uncle Sam's Call",
    "description": "There is a mixed crowd lining up outside the ICE recruitment fair in Utah, where hundreds of people are eager to join US President Donald Trump's vast deportation effort.",
    "link": "https://www.ibtimes.com/latinos-ex-military-retirees-ice-hopefuls-answer-uncle-sams-call-3783895",
    "timestamp": "2025-09-19T05:45:38Z"
  },
  {
    "title": "Trump suggests punishing TV networks for ‘negative’ coverage – video",
    "description": "US president Donald Trump suggested that TV networks which cover him 'negatively' could be punished by the government, after celebrating ABC suspending late-night host Jimmy Kimmel. Speaking to reporters on his flight back to the US from his state visit to th…",
    "link": "https://biztoc.com/x/c5c8d0e1a45554ed",
    "timestamp": "2025-09-19T05:45:15Z"
  },
  {
    "title": "How, after many postponements, we arrived at the Mitsotakis–Erdogan meeting in New York",
    "description": "Both Athens and Ankara want to send the message that the rapprochement process is alive, something that helps maintain the \"calm waters\"\nThe post How, after many postponements, we arrived at the Mitsotakis–Erdogan meeting in New York appeared first on ProtoTh…",
    "link": "https://en.protothema.gr/2025/09/19/how-after-many-postponements-we-arrived-at-the-mitsotakis-erdogan-meeting-in-new-york/",
    "timestamp": "2025-09-19T05:44:56Z"
  },
  {
    "title": "Donald Trump hopes to settle TikTok's fate on Xi call",
    "description": "President Trump plans to speak with China’s Xi Jinping on Friday about TikTok and trade. He said they’re close to reaching agreement and described their relationship as positive. This will be their second call since Trump’s return to office in January, and th…",
    "link": "https://economictimes.indiatimes.com/tech/technology/donald-trump-hopes-to-settle-tiktoks-fate-on-xi-call/articleshow/123990943.cms",
    "timestamp": "2025-09-19T05:44:17Z"
  },
  {
    "title": "Asian shares retreat after Intel helped drive Wall Street to more records",
    "description": "Asian shares mostly retreat after a rally of technology stocks led by Nvidia and Intel pushed Wall Street to more records",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-retreat-after-intel-helped-drive-wall-125725243",
    "timestamp": "2025-09-19T05:42:27Z"
  },
  {
    "title": "Trump hopes to settle TikTok’s fate on Xi call",
    "description": "President Donald Trump, who recently accused Xi Jinping of working to “conspire” against the United States, hopes to finalize the fate of video-sharing app TikTok and make progress on trade talks in a phone call with the Chinese leader on Friday. “I’m speakin…",
    "link": "https://www.digitaljournal.com/social-media/trump-hopes-to-settle-tiktoks-fate-on-xi-call/article",
    "timestamp": "2025-09-19T05:42:20Z"
  },
  {
    "title": "Trump Hopes To Settle TikTok's Fate On Xi Call",
    "description": "President Donald Trump, who recently accused Xi Jinping of working to \"conspire\" against the United States, hopes to finalize the fate of video-sharing app TikTok and make progress on trade talks in a phone call with the Chinese leader on Friday.",
    "link": "https://www.ibtimes.com/trump-hopes-settle-tiktoks-fate-xi-call-3783892",
    "timestamp": "2025-09-19T05:42:11Z"
  },
  {
    "title": "Šefčovič vs. the nostalgia bloc",
    "description": "In today’s edition: EU ambassadors meet on the bloc’s 19th package of sanctions against Russia, protesters clash with police in France during nationwide anti-austerity strikes with 181 arrested, and EU countries tentatively agree to a vague 2035 climate pledg…",
    "link": "https://www.euractiv.com/news/rapporteur-sefcovic-vs-the-nostalgia-bloc/",
    "timestamp": "2025-09-19T05:41:13Z"
  },
  {
    "title": "화웨이 어센드 AI 칩 공개와 인텔 주주 엔비디아",
    "description": "Business leaders like Nvidia's Jensen Huang, Google's Ruth Porat, BlackRock's Larry Fink and top lawmakers Scott Bessent, Rachel Reeves and Marco Rubio, are among the people attending the business roundtable event at Chequers https://t.co/aJX1I5vidb pic.twitt…",
    "link": "https://ryueyes11.tistory.com/511876",
    "timestamp": "2025-09-19T05:41:02Z"
  },
  {
    "title": "Corrupt “Democracy” Makes Fascism Inevitable",
    "description": "I’ve never been much of an opportunist when it comes to America because quite frankly, there is really very little to be optimistic about. A cursory glance at this nation’s history should be more than enough to prove that. The arch of history may or may not b…",
    "link": "https://www.counterpunch.org/2025/09/19/corrupt-democracy-makes-fascism-inevitable/",
    "timestamp": "2025-09-19T05:38:42Z"
  },
  {
    "title": "Türkiye hails Syria's 'remarkable progress' despite challenges",
    "description": "Türkiye's U.N. envoy Ahmet Yıldız on Thursday commended Syria's \"remarkable progress\" since December, while stressing that Israeli policies are driving regional instability.",
    "link": "https://www.hurriyetdailynews.com/turkiye-hails-syrias-remarkable-progress-despite-challenges-213769",
    "timestamp": "2025-09-19T05:37:51Z"
  },
  {
    "title": "Oil Prices Set for Second Week of Gains",
    "description": "Crude oil prices were on course to close a second week of gains in a row despite declines earlier in the week on persistent worry about oversupply, despite the continued drone attacks of Ukrainian forces on Russian refineries. At the time of writing, Brent cr…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Set-for-Second-Week-of-Gains.html",
    "timestamp": "2025-09-19T05:35:45Z"
  },
  {
    "title": "'Scientific' evidence will seek to prove the French president's wife is a woman. Here's what to know",
    "description": "Emmanuel Macron and his wife, Brigitte Macron, have said they intend to provide evidence in court to disprove a right-wing influencer's claims the French first lady is transgender.",
    "link": "https://www.abc.net.au/news/2025-09-19/what-to-know-about-macrons-defamation-suit-against-candace-owens/105794900",
    "timestamp": "2025-09-19T05:35:13Z"
  },
  {
    "title": "Jon Stewart Mocks Trump in Song to the ‘Dear Leader’ After Kimmel Suspension",
    "description": "Jon Stewart stepped behind the Daily Show desk on Thursday, breaking with the show's usual schedule after Jimmy Kimmel's show suspension.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jon-stewart-jimmy-kimmel-suspension-trump-daily-show-1235430894/",
    "timestamp": "2025-09-19T05:33:10Z"
  },
  {
    "title": "Asian shares retreat after Intel helped drive Wall Street to more records",
    "description": "Asian shares mostly retreat after a rally of technology stocks led by Nvidia and Intel pushed Wall Street to more records. The Nikkei 225 was down Friday after the Bank of Japan kept interest rates unchanged and a report showed inflation slowed in August. Chi…",
    "link": "https://www.seattlepi.com/news/world/article/asian-shares-retreat-after-intel-helped-drive-21056373.php",
    "timestamp": "2025-09-19T05:23:40Z"
  },
  {
    "title": "Jimmy Fallon jokes about dad’s concern ‘The Tonight Show’ was cancelled in wake of Kimmel ousting",
    "description": "\"Well, guys, the big story is that Jimmy Kimmel was suspended by ABC after pressure from the FCC, leaving everyone thinking, 'WTF?'\" Fallon joked.",
    "link": "https://nypost.com/2025/09/19/media/jimmy-fallon-jokes-about-dads-concern-the-tonight-show-was-cancelled-in-wake-of-kimmel-ousting/",
    "timestamp": "2025-09-19T05:23:34Z"
  },
  {
    "title": "Is America entering a new era of McCarthyism?",
    "description": "Since January, Donald Trump has used tactics reminiscent of the 1950s to stifle critical voices. Over the last week, the threats have intensified",
    "link": "https://biztoc.com/x/40a26eb0caad9e4e",
    "timestamp": "2025-09-19T05:23:15Z"
  },
  {
    "title": "Jon Stewart and Stephen Colbert: Late night hosts defend Jimmy Kimmel and free speech",
    "description": "Stephen Colbert and Jon Stewart defended Jimmy Kimmel and free speech during their Thursday night shows, after ABC indefinitely suspended his popular late-night show on Wednesday amid a controversy over recent comments made by the longtime host about the inve…",
    "link": "https://www.cnn.com/2025/09/19/entertainment/jon-stewart-stephen-colbert-kimmel-reaction-intl-hnk",
    "timestamp": "2025-09-19T05:20:01Z"
  },
  {
    "title": "US influence on Israel may be weaker than assumed, says Fidan",
    "description": "Recent developments in Israel's war on Gaza suggest the United States wields less control over Israeli policies than often perceived—and the dynamic may run the other way— Foreign Minister Hakan Fidan said Thursday.",
    "link": "https://www.hurriyetdailynews.com/us-influence-on-israel-may-be-weaker-than-assumed-says-fidan-213768",
    "timestamp": "2025-09-19T05:18:50Z"
  },
  {
    "title": "Jimmy Kimmel backed by cancelled Stephen Colbert after suspension over Charlie Kirk comments: Live updates",
    "description": "Kimmel said Monday conservatives were trying to ‘score political points’ from the fatal shooting of Kirk",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/jimmy-kimmel-charlie-kirk-stephen-colbert-cancelled-abc-live-updates-b2829575.html",
    "timestamp": "2025-09-19T05:18:30Z"
  },
  {
    "title": "LG Energy was using U.S. visa workarounds before Trump, documents show",
    "description": "South Korean companies say they face long-running problems in getting short-term visas for specialists they need for their high-tech plants in the U.S.",
    "link": "https://www.japantimes.co.jp/business/2025/09/19/companies/south-korea-lg-visa-workarounds/",
    "timestamp": "2025-09-19T05:18:00Z"
  },
  {
    "title": "‘We all see where this is going’ – Late-night hosts call out ‘blatant assault’ on free speech amid Jimmy Kimmel row",
    "description": "US late-night comedians used their Thursday programmes to criticise government censorship following the suspension of their peer Jimmy Kimmel.",
    "link": "https://www.independent.ie/entertainment/we-all-see-where-this-is-going-late-night-hosts-call-out-blatant-assault-on-free-speech-amid-jimmy-kimmel-row/a1859542026.html",
    "timestamp": "2025-09-19T05:17:52Z"
  },
  {
    "title": "Global economy takes Trump shocks in stride, for now",
    "description": "Despite initial fears of economic disruption under President Trump, the global economy shows resilience. Deals with Europe and Asia are in place. Central banks are cautiously optimistic. Growth forecasts are raised for the Euro zone and Spain. Germany plans s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/global-economy-takes-trump-shocks-in-stride-for-now/articleshow/123990474.cms",
    "timestamp": "2025-09-19T05:17:04Z"
  },
  {
    "title": "Analysis-Global economy takes Trump shocks in stride, for now",
    "description": "Bank of Japan keeps interest rates unchanged; outlines ETF sale plans\nBy Howard Schneider and Mark John\nWASHINGTON/LONDON (Reuters) -Threats to the global economic order have come at a furious pace during President Donald Trump’s first eight months in office …",
    "link": "https://biztoc.com/x/dad70dc4d152959e",
    "timestamp": "2025-09-19T05:14:19Z"
  },
  {
    "title": "China’s Huawei hypes up chip and computing power plans in fresh challenge to Nvidia",
    "description": "Huawei launched its latest AI chip, the Ascend 910C, in the first quarter of this year. Its successor, the Ascend 950 will be launched next year and will come in two variants,",
    "link": "https://indianexpress.com/article/technology/tech-news-technology/chinas-huawei-hypes-up-chip-and-computing-power-plans-in-fresh-challenge-to-nvidia-10258762/",
    "timestamp": "2025-09-19T05:12:51Z"
  },
  {
    "title": "Seth Meyers says Jimmy Kimmel's suspension is a 'big moment' for democracy",
    "description": "\"Trump promised to end government censorship and bring back free speech, and he's doing the opposite,\" Meyers said on his late-night show.",
    "link": "https://www.businessinsider.com/seth-meyers-jimmy-kimmel-suspension-big-moment-for-democracy-2025-9",
    "timestamp": "2025-09-19T05:11:52Z"
  },
  {
    "title": "Trump’s call after assassination attempt, gay running mate dilemma, and future plans: What Kamala Harris reveals in book '107 Days'",
    "description": "Kamala Harris's upcoming memoir, '107 Days,' unveils her experiences during the 2024 presidential campaign. She recounts the emotional aftermath of losing to Donald Trump, her concerns about President Biden's campaign strategy, and surprising private conversa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-call-after-assassination-attempt-gay-running-mate-dilemma-and-future-plans-what-kamala-harris-reveals-in-book-107-days/articleshow/123990262.cms",
    "timestamp": "2025-09-19T05:11:26Z"
  },
  {
    "title": "Trump Erupts In Gloating New Kimmel Post, But Cuts Line That Made Him Squirm",
    "description": "The clip cut out at the most convenient time for the president.",
    "link": "https://www.huffpost.com/entry/donald-trump-attempted-troll-jimmy-kimmel_n_68ccdfade4b01c2e8cb5aa49",
    "timestamp": "2025-09-19T05:10:51Z"
  },
  {
    "title": "In conversation with Lib Dem leader Ed Davey",
    "description": "Liberal Democrats leader Ed Davey speaks to the BBC ahead of this autumn's party conferences.",
    "link": "https://www.bbc.com/news/articles/cwynqvkg403o",
    "timestamp": "2025-09-19T05:10:08Z"
  },
  {
    "title": "Under pressure to police comments on Kirk, colleges walk a tightrope on free speech",
    "description": "Colleges around the country are under intense pressure to police insensitive comments about the assassination of Charlie Kirk, which leaves them with no easy choices",
    "link": "https://abcnews.go.com/Politics/wireStory/pressure-police-comments-kirk-colleges-walk-tightrope-free-125724701",
    "timestamp": "2025-09-19T05:09:59Z"
  },
  {
    "title": "Charlie Kirk legacy grows: U.S. military may start recruitment campaign to honor him as Donald Trump set to award Presidential Medal of Freedom",
    "description": "Charlie Kirk, a staunch ally of President Donald Trump, helped build the Republican Party's support among younger voters. U.S. President Donald Trump said he would award Kirk the Presidential Medal of Freedom, the nation's highest civilian honor.",
    "link": "https://economictimes.indiatimes.com/news/international/us/charlie-kirk-legacy-grows-u-s-military-may-start-recruitment-campaign-to-honor-him-as-donald-trump-set-to-award-presidential-medal-of-freedom/articleshow/123990186.cms",
    "timestamp": "2025-09-19T05:06:01Z"
  },
  {
    "title": "Analysis-Global economy takes Trump shocks in stride, for now",
    "description": "WASHINGTON/LONDON (Reuters) -Threats to the global economic order have come at a furious pace during President Donald Trump's first eight months in office - ...",
    "link": "https://finance.yahoo.com/news/analysis-global-economy-takes-trump-050527210.html",
    "timestamp": "2025-09-19T05:05:27Z"
  },
  {
    "title": "Lost Creator Damon Lindelof Threatens To Cut Ties With Disney Over Jimmy Kimmel's Suspension",
    "description": "Damon Lindelof has warned he will not work with Disney unless ABC lifts Jimmy Kimmel's suspension, calling the move \"shocking\" and \"infuriating.\"",
    "link": "https://www.ndtvprofit.com/trending/charlie-kirk-assassination-lost-creator-damon-lindelof-threatens-to-cut-ties-with-disney-over-jimmy-kimmels-suspension",
    "timestamp": "2025-09-19T05:03:57Z"
  },
  {
    "title": "Department of Energy Launches Effort to Speed Power Grid Projects for AI",
    "description": "The Trump administration on Thursday launched an effort to speed development of power plants and transmission lines as artificial intelligence boosts demand, even as it orders fossil fuel plants set to shut for good to keep operating. The Department of …",
    "link": "https://www.insurancejournal.com/news/national/2025/09/19/839736.htm",
    "timestamp": "2025-09-19T05:02:08Z"
  },
  {
    "title": "Australian prime minister heads to New York, may meet Trump for first time",
    "description": "SYDNEY (Reuters) -Australia's Prime Minister Anthony Albanese departs for the U.S. this week, raising expectations of a first meeting with President Donald...",
    "link": "https://www.yahoo.com/news/articles/australian-prime-minister-heads-york-050001971.html",
    "timestamp": "2025-09-19T05:00:01Z"
  },
  {
    "title": "Asian shares retreat after Intel helped drive Wall Street to more records",
    "description": "Asian shares mostly retreated Friday after a rally of technology stocks led by Nvidia and Intel pushed Wall Street to more records.  Japan's Nikkei 225...",
    "link": "https://finance.yahoo.com/news/asian-shares-retreat-intel-helped-045935206.html",
    "timestamp": "2025-09-19T04:59:35Z"
  },
  {
    "title": "Trump calls Ilhan Omar ‘terrible,’ repeats marriage allegation; demands impeachment after House votes down censure",
    "description": "Donald Trump has escalated his attacks on Representative Ilhan Omar after a House resolution to censure her failed. Trump called Omar \"terrible\" and suggested impeachment. He questioned her background, criticizing Somalia's governance and repeating debunked a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-calls-ilhan-omar-terrible-repeats-marriage-allegation-demands-impeachment-after-house-votes-down-censure/articleshow/123990090.cms",
    "timestamp": "2025-09-19T04:57:30Z"
  },
  {
    "title": "Late-night hosts call out 'unitary intimidation' in aftermath of Kimmel axing",
    "description": "Jimmy Kimmel's fellow late-night stars accuse the Trump administration of overriding free speech with the indefinite axing of the ABC America host, as parent company, Walt Disney, faces growing protests.",
    "link": "https://www.abc.net.au/news/2025-09-19/stephen-colbert-seth-meyers-jon-stewart-back-jimmy-kimmel/105794466",
    "timestamp": "2025-09-19T04:57:03Z"
  },
  {
    "title": "Political parties trade blame for potential shutdown",
    "description": "Republicans and Democratic lawmakers show no signs of budging as the House takes up a bill to avert a partial government shutdown in less than two weeks",
    "link": "https://abcnews.go.com/Politics/wireStory/house-voting-funding-patch-parties-trade-blame-potential-125724671",
    "timestamp": "2025-09-19T04:54:57Z"
  },
  {
    "title": "Jon Stewart delivered a stinging, sarcasm-laden defense of Jimmy Kimmel",
    "description": "In full satire mode, Stewart laid into Trump, calling him America's \"great leader\" and criticizing his administration's stance on free speech.",
    "link": "https://www.businessinsider.com/jon-stewart-delivers-sarcasm-laden-defense-of-jimmy-kimmel-2025-9",
    "timestamp": "2025-09-19T04:53:45Z"
  },
  {
    "title": "Tsakos welcomes President Trump’s proposal to end quarterly earnings report",
    "description": "President Donald Trump’s proposal to reduce the frequency that US-listed companies report financial information was welcomed by Tsakos Energy Navigation CEO Dr. Nikos Tsakos.\nThe US president advocated that companies…\nTsakos welcomes President Trump’s proposa…",
    "link": "https://www.naftemporiki.gr/english/2007968/tsakos-welcomes-president-trumps-proposal-to-end-quarterly-earnings-report/",
    "timestamp": "2025-09-19T04:51:26Z"
  },
  {
    "title": "‘The Media’s Trying to Make Jimmy Kimmel Their Charlie Kirk,’ According to Greg Gutfeld",
    "description": "By\n Tara Ariano\n Published: September 18th, 2025",
    "link": "https://www.cracked.com/article_48424_the-medias-trying-to-make-jimmy-kimmel-their-charlie-kirk-according-to-greg-gutfeld.html",
    "timestamp": "2025-09-19T04:50:00Z"
  },
  {
    "title": "Another U.S. University faces controversy as Texas Varsity President is stepping down over gender issue",
    "description": "Texas A&M Board of Regents said it would appoint an interim president \"to ensure a seamless transition\" and initiate a national search for a permanent president.",
    "link": "https://economictimes.indiatimes.com/news/international/us/another-u-s-university-faces-controversy-as-texas-varsity-president-is-stepping-down-over-gender-issue/articleshow/123989916.cms",
    "timestamp": "2025-09-19T04:49:01Z"
  },
  {
    "title": "Trump suggests US troops could return to base in Afghanistan, citing its proximity to rival China",
    "description": "Donald Trump has suggested reestablishing a U.S. presence at Bagram Air Base in Afghanistan, four years after the chaotic withdrawal. Trump tied the idea to countering China and criticized Biden's handling of the withdrawal. While the Taliban dismissed the id…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-suggests-us-troops-could-return-to-base-in-afghanistan-citing-its-proximity-to-rival-china/articleshow/123989925.cms",
    "timestamp": "2025-09-19T04:45:57Z"
  },
  {
    "title": "Jon Stewart Claps Back at Trump On The Today Show",
    "description": "Jon Stewart covers Jimmy Kimmel's suspension and pokes fun at Trump's policies on The Daily Show.",
    "link": "https://screenrant.com/jon-stewart-response-trump-jimmy-kimmel-suspension/",
    "timestamp": "2025-09-19T04:41:52Z"
  },
  {
    "title": "Trump reveals UK PM felt ’embarrassed’ over NATO and EU buying Russian oil; claims Starmer agreed to sanctions",
    "description": "Returning from a UK state visit, Trump says Putin “let him down” on Ukraine, urges Europe to stop buying Russian oil.",
    "link": "https://indianexpress.com/article/world/trump-reveals-uk-pm-felt-embarrassed-over-nato-and-eu-buying-russian-oil-10258676/",
    "timestamp": "2025-09-19T04:40:24Z"
  },
  {
    "title": "Comedy hosts including Jon Stewart, Stephen Colbert criticize Kimmel's suspension",
    "description": "Late-night comedy hosts reacted with mockery of the Trump administration a day after Jimmy Kimmel’s show was yanked from the air following his comments about the assassination of Charlie Kirk.",
    "link": "https://www.nbcnews.com/news/us-news/comedy-hosts-jon-stewart-stephen-colbert-criticize-kimmel-suspension-rcna232332",
    "timestamp": "2025-09-19T04:39:54Z"
  },
  {
    "title": "Jon Stewart Responds To Kimmel Suspension In The Most Brutally Sarcastic Way",
    "description": "The comedian delivered a very different version of \"The Daily Show.\"",
    "link": "https://www.huffpost.com/entry/jon-stewart-jimmy-kimmel-donald-trump_n_68ccd69be4b0afb4eb4ccfe4",
    "timestamp": "2025-09-19T04:38:52Z"
  },
  {
    "title": "Canada, Mexico to work together in face of Trump’s US tariff threats",
    "description": "Canadian and Mexican leaders pledge closer coordination on trade amid US President Donald Trump's trade war.",
    "link": "https://www.aljazeera.com/news/2025/9/19/canada-mexico-to-work-together-in-face-of-trumps-us-tariff-threats",
    "timestamp": "2025-09-19T04:34:54Z"
  },
  {
    "title": "California congressional Democrats speak out after ABC pulls Jimmy Kimmel off air",
    "description": "California Democrats in Congress are calling out the decision by ABC to take Jimmy Kimmel off the air​ as censorship.",
    "link": "https://www.cbsnews.com/sacramento/news/california-congressional-democrats-speak-out-abc-pulls-jimmy-kimmel-off-air/",
    "timestamp": "2025-09-19T04:33:00Z"
  },
  {
    "title": "The new owner of Kenmare's Park Hotel: ‘I’d love this to be where someone like my mum could feel welcome’",
    "description": "Bryan Meehan wants sustainability and community to be at the heart of his five-star Park Hotel in Kenmare",
    "link": "https://www.irishtimes.com/business/2025/09/19/id-love-this-to-be-a-hotel-where-someone-like-my-mum-could-come-in-and-feel-welcome/",
    "timestamp": "2025-09-19T04:33:00Z"
  },
  {
    "title": "EU looks to ban Russian LNG in next round of sanctions",
    "description": "The European Commission is discussing a proposal to bring forward a ban on Russian liquefied natural gas in a new package of sanctions against Moscow over its invasion of Ukraine, an EU official said.",
    "link": "https://www.independent.ie/business/world/eu-looks-to-ban-russian-lng-in-next-round-of-sanctions/a381453318.html",
    "timestamp": "2025-09-19T04:30:00Z"
  },
  {
    "title": "Pope Leo vows to uphold gay-friendly policy of pope Francis and continue work on women’s ordination",
    "description": "Pope Leo will keep pope Francis’ signature policies to welcome gay Catholics and discuss women’s ordination and give China input on bishop appointments, he said in his first interview, released yesterday.",
    "link": "https://www.independent.ie/world-news/pope-leo-vows-to-uphold-gay-friendly-policy-of-pope-francis-and-continue-work-on-womens-ordination/a1392790680.html",
    "timestamp": "2025-09-19T04:30:00Z"
  },
  {
    "title": "Jon Stewart Delivers Thursday Night ‘Daily Show’ Monologue From Golden Trump-Esque Set",
    "description": "By\n Opheli Garcia Lawler\n Published: September 18th, 2025",
    "link": "https://www.cracked.com/article_48422_jon-stewart-delivers-thursday-night-daily-show-monologue-from-golden-trump-esque-set.html",
    "timestamp": "2025-09-19T04:30:00Z"
  },
  {
    "title": "‘Shock and bewilderment’ after suspension of Jimmy Kimmel’s popular chat show",
    "description": "ABC’s suspension of Jimmy Kimmel’s show following comments he made about the killing of Charlie Kirk drew reactions from across the entertainment and political worlds, including from US President Donald Trump.",
    "link": "https://www.independent.ie/world-news/north-america/shock-and-bewilderment-after-suspension-of-jimmy-kimmels-popular-chat-show/a1655404214.html",
    "timestamp": "2025-09-19T04:30:00Z"
  },
  {
    "title": "Jimmy Fallon Shows Kimmel Solidarity With Fake Censorship of Jokes About Trump | Video",
    "description": "Kimmel \"is a decent, funny and loving guy,\" the NBC host says\nThe post Jimmy Fallon Shows Kimmel Solidarity With Fake Censorship of Jokes About Trump | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-fallon-responds-to-kimmel-suspension-nbc/",
    "timestamp": "2025-09-19T04:26:16Z"
  },
  {
    "title": "Colbert laments 'tonight we are all Jimmy Kimmel' as outgoing CBS host pays tribute to fallen ABC colleague",
    "description": "\"Late Show\" host Stephen Colbert went to bat for his ABC colleague Jimmy Kimmel after the Disney network pulled his show off air, calling it \"blatant censorship.\"",
    "link": "https://www.foxnews.com/media/colbert-laments-tonight-we-all-jimmy-kimmel-outgoing-cbs-host-pays-tribute-fallen-abc-colleague",
    "timestamp": "2025-09-19T04:26:02Z"
  },
  {
    "title": "Abraham Accords at five: A reality check",
    "description": "The Abraham Accords, signed five years ago, aimed to normalize relations between Israel and Arab nations. However, the Gaza war and recent Israeli actions have undermined the accords. Normalization efforts are stalled. The accords bypassed the core issue of t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/abraham-accords-at-five-a-reality-check/articleshow/123989399.cms",
    "timestamp": "2025-09-19T04:24:56Z"
  },
  {
    "title": "Harris stops biting her tongue in '107 Days,' her book about last year's campaign against Trump",
    "description": "Kamala Harris shares her candid reflections in her new book, \"107 Days,\" about her 2024 presidential campaign against Donald Trump",
    "link": "https://abcnews.go.com/Entertainment/wireStory/harris-stops-biting-tongue-107-days-book-years-125723608",
    "timestamp": "2025-09-19T04:22:29Z"
  },
  {
    "title": "Trump repeats claim of settling India-Pakistan conflict during UK visit",
    "description": "India has consistently denied any third-party intervention, maintaining that the understanding on cessation of hostilities with Pakistan was reached following direct talks between the Directors General of Military Operations of the two militaries",
    "link": "https://www.thehindubusinessline.com/news/world/trump-repeats-claim-of-settling-india-pakistan-conflict-during-uk-visit/article70068581.ece",
    "timestamp": "2025-09-19T04:20:46Z"
  },
  {
    "title": "The Daily Show: Jon Stewart Responds to ABC Suspending Jimmy Kimmel",
    "description": "ABC announced that it had \"pre-empted indefinitely\" Jimmy Kimmel on Wednesday evening, a move that came at the end of a day that began with Federal Communications Commission chair Brendan Carr urging local network affiliates to remove Jimmy Kimmel Live! from …",
    "link": "https://bleedingcool.com/tv/the-daily-show-jon-stewart-responds-to-abc-suspending-jimmy-kimmel/",
    "timestamp": "2025-09-19T04:18:03Z"
  },
  {
    "title": "‘The Daily Show’s Jon Stewart Plays Montage of Conservatives Lying on TV to Prove That It’s Not Illegal",
    "description": "The FOX News studios would need to be in Rikers Island for that to be the case",
    "link": "https://www.cracked.com/article_48421_the-daily-shows-jon-stewart-plays-montage-of-conservatives-lying-on-tv-to-prove-that-its-not-illegal.html",
    "timestamp": "2025-09-19T04:18:00Z"
  }
]