[
  {
    "title": "Trump administration faces Epstein document deadline",
    "description": "The deadline for Trump’s government to release the Epstein files is 11.59 p.m. US eastern time tonight. The justice department has left the decision to the last minute after Trump signed a bill from Congress on November 20 demanding the release of all the Eps…",
    "link": "https://rollingout.com/2025/12/19/trump-administration-epstein-deadline/",
    "timestamp": "2025-12-19T14:49:16Z"
  },
  {
    "title": "Putin Calls Out European Interference in US Elections",
    "description": "The Russian leader explained that the relationship between Donald Trump and European elites backing Democrats was not surprisingMOSCOW, December 19. /TASS/. European political elites aligned with Democrats directly meddled in the US elections, Russian Preside…",
    "link": "https://freerepublic.com/focus/f-news/4358140/posts",
    "timestamp": "2025-12-19T14:48:56Z"
  },
  {
    "title": "Trump 'tantrums' and 'impulsiveness' has delayed White House ballroom by 'years': analysis",
    "description": "Constant delays to the White House ballroom are being caused by Donald Trump's \"tantrums\" and \"impulsiveness\", a political commentator has claimed. The president made his plans for the $200million turned $400million ballroom project known in July this year, b…",
    "link": "https://www.rawstory.com/trump-ballroom-2674813949/",
    "timestamp": "2025-12-19T14:48:09Z"
  },
  {
    "title": "Canada and the US will review their free trade agreement starting mid-January",
    "description": "Canada and the U.S. will start formal discussions on their free trade agreement in mid-January",
    "link": "https://www.wsbtv.com/news/business/canada-us-launch/MR36XTVILE2NRH5YV5GAPJJTZY/",
    "timestamp": "2025-12-19T14:44:35Z"
  },
  {
    "title": "Canada and the US will review their free trade agreement starting mid-January",
    "description": "Canadian Prime Minister Mark Carney’s office says Canada and the U.S. will launch formal discussions to review the free trade agreement in mid-January",
    "link": "https://www.wftv.com/news/business/canada-us-launch/MR36XTVILE2NRH5YV5GAPJJTZY/",
    "timestamp": "2025-12-19T14:44:35Z"
  },
  {
    "title": "Trump just legalized marijuana nationwide — here’s why potheads are rejoicing",
    "description": "As On The Money has been reporting since April, our famously drug-and-drink-averse president has been inching ever closer to making marijuana significantly less criminal in the eyes of the federal government.",
    "link": "https://nypost.com/2025/12/19/business/trump-just-legalized-marijuana-nationwide-heres-why-potheads-are-rejoicing/",
    "timestamp": "2025-12-19T14:44:18Z"
  },
  {
    "title": "The Epstein files are set to come out today. Here's what could be inside.",
    "description": "The deadline for the Epstein files is here. The DOJ is obligated to make public its reams of information about Jeffrey Epstein and Ghislaine Maxwell.",
    "link": "https://www.businessinsider.com/jeffrey-epstein-files-justice-department-doj-documents-released-2025-12",
    "timestamp": "2025-12-19T14:43:16Z"
  },
  {
    "title": "Democrats' last-minute move to block GOP funding plan sends lawmakers home early",
    "description": "Senate Majority Leader John Thune, R-S.D., expressed hope Democrats would support government funding when Congress returns after Democratic opposition derailed Thursday's vote.",
    "link": "https://www.foxnews.com/politics/democrats-last-minute-move-block-gop-funding-plan-sends-lawmakers-home-early",
    "timestamp": "2025-12-19T14:42:41Z"
  },
  {
    "title": "Why did Trump get 18 minutes of prime-time television for a totally partisan, largely inaccurate monologue?",
    "description": "It's not clear when — or if — the White House shared the substance of Trump's remarks with network leaders.",
    "link": "https://fortune.com/2025/12/19/why-did-trump-get-18-minutes-prime-time-network-airtime-partisan-economy-affordability/",
    "timestamp": "2025-12-19T14:41:19Z"
  },
  {
    "title": "MAGA’s Immigration and Pronatalist Goals Are at Odds",
    "description": "When deportations increase, the child-care workforce tends to decrease—which puts pressure on working families.",
    "link": "https://www.theatlantic.com/family/2025/12/immigration-pronatalism-trump-vance/685275/",
    "timestamp": "2025-12-19T14:40:00Z"
  },
  {
    "title": "Wisconsin judge convicted of obstructing immigration arrest",
    "description": "A jury found a Wisconsin judge guilty of obstruction Thursday for helping an undocumented immigrant dodge federal authorities, marking a victory for President Donald Trump as he continues his sweeping immigration crackdown across the country. Milwaukee County…",
    "link": "https://rollingout.com/2025/12/19/judge-dugan-immigrant/",
    "timestamp": "2025-12-19T14:38:32Z"
  },
  {
    "title": "‘I was like, ‘Wow, if Erika can do it, I can do it”: TikTok and Turning Point draw in conservative Gen Z women",
    "description": "Erika Kirk, a former beauty pageant winner who has worked as a model and actress, often appeared alongside with her husband at Turning Point events.",
    "link": "https://fortune.com/2025/12/19/i-was-like-wow-if-erika-can-do-it-i-can-do-it-tiktok-and-turning-point-draw-in-conservative-gen-z-women/",
    "timestamp": "2025-12-19T14:36:40Z"
  },
  {
    "title": "Tens of thousands flee DR Congo to Burundi amid rebel takeover of key city",
    "description": "UN refugee agency says women and children arriving 'exhausted and severely traumatised' after fleeing eastern DRC.",
    "link": "https://www.aljazeera.com/news/2025/12/19/tens-of-thousands-flee-dr-congo-to-burundi-after-rebel-takeover-of-key-city",
    "timestamp": "2025-12-19T14:35:00Z"
  },
  {
    "title": "Rogue tankers in Singapore: What are shadow fleets and who uses them?",
    "description": "Ageing ships flying false flags are used to avoid Western sanctions on Russian, Iranian and Venezuelan oil.",
    "link": "https://www.aljazeera.com/news/2025/12/19/rogue-tankers-in-singapore-what-are-shadow-fleets-and-who-uses-them",
    "timestamp": "2025-12-19T14:34:34Z"
  },
  {
    "title": "Trump's 'greatest hit of crazy' needs to be sanity alarm call for staffers: economist",
    "description": "President Trump praised the state of the U.S. economy in a primetime address Wednesday evening, even though new government statistics show the nation’s unemployment rate is at a new four-year high of 4.6%. Dean Baker, senior economist at the Center for Econom…",
    "link": "https://www.rawstory.com/trump-s-greatest-hit-of-crazy-needs-to-be-sanity-alarm-call-for-staffers-economist/",
    "timestamp": "2025-12-19T14:33:18Z"
  },
  {
    "title": "Jimmy Kimmel Cries While Thanking Audience for Helping Him Get Through a Hard Year | Video",
    "description": "\"This year, you literally pulled us out of a hole and we cannot thank you enough, personally,\" the ABC host says in his final monologue of 2025\nThe post Jimmy Kimmel Cries While Thanking Audience for Helping Him Get Through a Hard Year | Video appeared first …",
    "link": "https://www.thewrap.com/culture-lifestyle/culture/jimmy-kimmel-final-monologue-of-2025-cries-hard-year/",
    "timestamp": "2025-12-19T14:31:26Z"
  },
  {
    "title": "Save the Dividend, Warriors. You May Lose Your Health Care",
    "description": "Donald Trump announced that the government is giving service members a \"warrior dividend\" of $1,776. It doesn't make up for cuts to Veterans Affairs.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-warrior-dividend-cuts-veterans-affairs-1235487118/",
    "timestamp": "2025-12-19T14:30:00Z"
  },
  {
    "title": "What’s Next for MTG’s Bill Ending Trans Surgeries for Minors?",
    "description": "The House of Representatives passed a bill to make it a felony to facilitate transgender procedures on minors Wednesday, but does it have any shot... Read More\nThe post What’s Next for MTG’s Bill Ending Trans Surgeries for Minors? appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/12/19/whats-next-for-mtgs-bill-ending-trans-surgeries-for-minors/",
    "timestamp": "2025-12-19T14:30:00Z"
  },
  {
    "title": "EU and NATO Block Ukraine Peace to Protect Their Fading Relevance - Ex-Pentagon Analyst",
    "description": "Russian President Vladimir Putin credited his US counterpart Donald Trump with making \"serious and genuine efforts\" to end the Ukraine conflict, but what's blocking a diplomatic breakthrough?",
    "link": "https://sputnikglobe.com/20251219/eu-and-nato-block-ukraine-peace-to-protect-their-fading-relevance---ex-pentagon-analyst---1123332599.html",
    "timestamp": "2025-12-19T14:29:40Z"
  },
  {
    "title": "Trump Tells NBC News He's Not Ruling Out War With Venezuela",
    "description": "President Donald Trump said Thursday that he is leaving the possibility of war with Venezuela on the table. \"I don't rule it out, no,\" he told NBC News' Kristen Welker in a phone interview. It comes after the president ordered a \"blockade\" of sanctioned oil t…",
    "link": "https://www.today.com/video/trump-tells-nbc-news-he-s-not-ruling-out-war-with-venezuela-254736965674",
    "timestamp": "2025-12-19T14:29:40Z"
  },
  {
    "title": "MAGA Civil War grips Turning Point conference as Ben Shapiro, Tucker Carlson clash over mainstreaming of anti-semitism",
    "description": "The raw bitterness on the opening night reflected deep divisions over the meaning of “America First” and next steps for “Make America Great Again.\"",
    "link": "https://fortune.com/2025/12/19/maga-civil-war-turning-point-conference-shapiro-carlson-antisemitism/",
    "timestamp": "2025-12-19T14:27:06Z"
  },
  {
    "title": "'Sickened': Trump's 'unhinged' style said to be turning away right-wing allies",
    "description": "Donald Trump's \"professional-wrestling style of leadership\" during his second term as president has become even more bombastic, combative and self-centered in recent weeks — and according to a new analysis from New York Times chief White House reporter Peter …",
    "link": "https://www.rawstory.com/alternet-posts/trump-allies-sickened/",
    "timestamp": "2025-12-19T14:24:02Z"
  },
  {
    "title": "‘This heinous individual should never have been allowed in our country’: Trump seizes on Brown University shooting to suspend green card program",
    "description": "The shooter had studied at Brown on a student visa, per an affidavit from a Providence police detective. In 2017, he got a diversity immigrant visa.",
    "link": "https://fortune.com/2025/12/19/brown-university-green-card-lottery-program-suspended/",
    "timestamp": "2025-12-19T14:21:57Z"
  },
  {
    "title": "Trump is delivering the goods — but needs to stop promising the Moon",
    "description": "A Trump speech wouldn’t be a Trump speech if it wasn’t festooned with a few questionable claims painted in Day-Glo.",
    "link": "https://nypost.com/2025/12/19/opinion/trump-delivering-the-goods-needs-to-stop-promising-the-moon/",
    "timestamp": "2025-12-19T14:20:49Z"
  },
  {
    "title": "YouTuber's livestream appears on White House website",
    "description": "A YouTube content creator whose livestream talking about investments mysteriously appeared to take over a White House website says he has no idea how it happened",
    "link": "https://www.wsbtv.com/news/business/mystery-youtube/VHEKQ2RFTM4ZFM5PGI7SLWJJZI/",
    "timestamp": "2025-12-19T14:20:46Z"
  },
  {
    "title": "US reviews Nvidia chip sales as Trump reverses policy",
    "description": "The Trump administration has quietly initiated a review process that could greenlight sales of some of Nvidia’s most powerful artificial intelligence chips to China, according to five people familiar with the matter. The move fulfills a promise President Dona…",
    "link": "https://rollingout.com/2025/12/19/us-reviews-nvidia-chip-sales/",
    "timestamp": "2025-12-19T14:20:24Z"
  },
  {
    "title": "Taylor Swift breaks her silence on politics, brief but buzzworthy moment in Eras Tour docuseries on Disney Plus",
    "description": "Taylor Swift’s Disney+ docuseries The End of an Era offers a closer look at the final U.S. leg of her Eras Tour, combining performances, backstage glimpses, and personal insights. Episode 4 emphasizes Swift's intent on providing fans a sanctuary during the po…",
    "link": "https://economictimes.indiatimes.com/news/international/us/taylor-swift-breaks-her-silence-on-politics-brief-but-buzzworthy-moment-in-eras-tour-docuseries-on-disney-plus/articleshow/126079057.cms",
    "timestamp": "2025-12-19T14:17:56Z"
  },
  {
    "title": "Bought Some Bitcoin Last Week? Here’s How Much It’s Worth Today",
    "description": "Bitcoin’s price swings are intense, but long‑term trends may tell a different story. Discover what a bitcoin investment made last week is worth today.",
    "link": "https://finance.yahoo.com/news/bought-bitcoin-last-week-much-141633328.html",
    "timestamp": "2025-12-19T14:16:33Z"
  },
  {
    "title": "Chile at the Crossroads",
    "description": "Peter Kornbluh\n\n\n\nA dramatic shift to the extreme right threatens the future—and past—for human rights and accountability.\r\n\n\r\n\n\nThe post Chile at the Crossroads appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/human-rights-chile-dictatorship-trump/",
    "timestamp": "2025-12-19T14:15:52Z"
  },
  {
    "title": "'Never been this blatant': Trump's picks mocked behind the scenes as 'MAGA disciples'",
    "description": "President Donald Trump’s hand-picked U.S. ambassadors to European countries are being openly mocked by some European leaders, The Guardian reported\r\n Friday, with one leader labeling them as nothing more than the president’s gang of “MAGA disciples.”“[They ar…",
    "link": "https://www.rawstory.com/europe-trump-picks-maga/",
    "timestamp": "2025-12-19T14:14:50Z"
  },
  {
    "title": "Iran’s regime panics",
    "description": "As Argentina files charges, Iran’s regime panics at home. Opinion.",
    "link": "https://www.israelnationalnews.com/news/419620",
    "timestamp": "2025-12-19T14:12:51Z"
  },
  {
    "title": "‘War on terror’ defence of Trump boat strikes doesn’t hold water: Experts",
    "description": "Trump allies liken the bombing of alleged drug vessels in the Caribbean and Pacific to Obama's drone killing campaign.",
    "link": "https://www.aljazeera.com/news/2025/12/19/war-on-terror-defence-of-trump-boat-strikes-doesnt-hold-water-experts",
    "timestamp": "2025-12-19T14:12:46Z"
  },
  {
    "title": "Hacks, thefts and disruption: The worst data breaches of 2025 | TechCrunch",
    "description": "TechCrunch looks back at the biggest data breaches, disruptive cyberattacks, and damaging hacks of 2025, from the raiding of U.S. government databases to a hack every month in South Korea.",
    "link": "https://techcrunch.com/2025/12/19/hacks-thefts-and-disruption-the-worst-data-breaches-of-2025/",
    "timestamp": "2025-12-19T14:12:24Z"
  },
  {
    "title": "He's Serving 5 Years in Prison for Bitcoin Privacy Software",
    "description": "Keonne Rodriguez explains why he built a bitcoin privacy tool, discusses the federal charges that sent him to prison this week, and warns that his case could redefine the legal boundaries of financial privacy.",
    "link": "https://reason.com/podcast/2025/12/19/hes-serving-5-years-in-prison-for-bitcoin-privacy-software/",
    "timestamp": "2025-12-19T14:11:57Z"
  },
  {
    "title": "Jimmy Kimmel chokes up as he thanks viewers for support after 'hard year'",
    "description": "Late-night host Jimmy Kimmel grew emotional Thursday as he delivered an end-of-year thank-you to viewers during this year's final episode of \"Jimmy Kimmel Live!\"",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-chokes-up-he-thanks-viewers-support-after-hard-year",
    "timestamp": "2025-12-19T14:10:28Z"
  },
  {
    "title": "NYT: Donald Trump & Jeffrey Epstein were ‘best friends’ for two decades",
    "description": "Embed from Getty Images Today is the deadline for the release of the Jeffrey Epstein files. As of this writing, the Epstein files have not been released, although for months, the congressional oversight committee has been steadily releasing photos and emails …",
    "link": "https://www.celebitchy.com/954702/nyt_donald_trump_jeffrey_epstein_were_best_friends_for_two_decades/",
    "timestamp": "2025-12-19T14:10:23Z"
  },
  {
    "title": "Oracle stock jumps 5% as cloud provider joins investor group to run TikTok's U.S. business",
    "description": "The new joint venture will prevent TikTok from shutting down in the U.S. due to national security concerns.",
    "link": "https://www.cnbc.com/2025/12/19/oracle-stock-tiktok-us-trump-china.html",
    "timestamp": "2025-12-19T14:07:45Z"
  },
  {
    "title": "Shocker: Despite Trump's Own Order, the DOJ Says It Won't Release All the Epstein Files Today",
    "description": "In a move that no one could possibly have seen coming, the Trump DOJ says it won't release all of the Epstein Files today as required by law.",
    "link": "https://www.jezebel.com/epstein-files-release-date-due-dec-19-doj-wont-release-redactions-trump-law-reactions",
    "timestamp": "2025-12-19T14:05:58Z"
  },
  {
    "title": "What Time Are Epstein Files Being Released? What We Know About Today's Deadline",
    "description": "On November 19, 2025, Donald Trump signed the Epstein Files Transparency Act, requiring the release of the infamous files related to dead disgraced financier Jeffrey Epstein‘s case. As part of the Transparency Act, Congress gave the Department of Justice a 30…",
    "link": "https://www.justjared.com/2025/12/19/what-time-are-epstein-files-being-released-what-we-know-about-todays-deadline/",
    "timestamp": "2025-12-19T14:04:25Z"
  },
  {
    "title": "TikTok U.S. Sale to Oracle-Led Group Set to Close in January",
    "description": "The deal that sees TikTok's US operations being sold to an investment group that includes Oracle, Silver Lake, and UAE-based company MGX is set to close early next year.Read More...",
    "link": "https://www.mactrast.com/2025/12/tiktok-u-s-sale-to-oracle-led-group-set-to-close-in-january/",
    "timestamp": "2025-12-19T14:04:02Z"
  },
  {
    "title": "Jimmy Kimmel Fights Tears on Last Show of 2025 as He Thanks Fans for ‘Pulling Us Out of a Hole’ During This ‘Hard Year’: ‘I’m Crying Already. I’m Sorry’",
    "description": "Jimmy Kimmel fought back tears during his final monologue of 2025 as he thanked fans for helping him get through a tumultuous year, one that started with the L.A. fires and continued through Kimmel’s ongoing feud with Donald Trump. Of course the low point of …",
    "link": "https://variety.com/2025/tv/news/jimmy-kimmel-cries-last-show-thanks-fans-suspension-1236612583/",
    "timestamp": "2025-12-19T14:03:57Z"
  },
  {
    "title": "Judge tosses Trump-linked lawsuit targeting Chief Justice Roberts, dealing setback to Trump allies",
    "description": "The lawsuit, filed earlier this year, comes a top Trump officials have railed against 'activist judges' they sa have unduly restricted executive powers.",
    "link": "https://www.foxnews.com/politics/judge-tosses-trump-linked-lawsuit-targeting-chief-justice-roberts-dealing-setback-trump-allies",
    "timestamp": "2025-12-19T14:03:22Z"
  },
  {
    "title": "Sheriff Puzzled by UFOs Hovering Over Power Station",
    "description": "A sheriff in Sweetwater County, Wyoming still has no answers as unexplained drone sightings drag on into their 13th month.",
    "link": "http://futurism.com/future-society/ufos-wyoming-sheriff-energy",
    "timestamp": "2025-12-19T14:02:04Z"
  },
  {
    "title": "Trump live: US Justice Department faces deadline to release Epstein files",
    "description": "Trump's administration prepares to release a cache of records tied to convicted sex offender Jeffery Epstein.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/12/19/trump-live-us-justice-department-faces-deadline-to-release-epstein-files",
    "timestamp": "2025-12-19T14:00:55Z"
  },
  {
    "title": "134 House Republicans demand 'assurances' as US eases Syria sanctions",
    "description": "More than 100 House Republicans demand oversight of Syria as U.S. prepares to repeal sanctions, warning of potential reversal if progress falters.",
    "link": "https://www.foxnews.com/politics/130-house-republicans-demand-assurances-us-eases-syria-sanctions",
    "timestamp": "2025-12-19T14:00:08Z"
  },
  {
    "title": "134 House Republicans demand 'assurances' before US eases Syria sanctions",
    "description": "More than 100 House Republicans demand oversight of Syria as U.S. prepares to repeal sanctions, warning of potential reversal if progress falters.",
    "link": "https://www.foxnews.com/politics/130-house-republicans-demand-assurances-before-us-eases-syria-sanctions",
    "timestamp": "2025-12-19T14:00:08Z"
  },
  {
    "title": "Trump’s speech was his Joe Biden moment",
    "description": "The president's nationally televised address will haunt him like Biden's debate performance",
    "link": "https://www.salon.com/2025/12/19/trumps-speech-was-his-joe-biden-moment/",
    "timestamp": "2025-12-19T14:00:03Z"
  },
  {
    "title": "Hollywood’s AI Hype Hit Reality in 2025. Next Year, It All Moves Faster",
    "description": "Despite some hiccups this year, AI adoption will continue to grow, even as the prospect of legal battles loom\nThe post Hollywood’s AI Hype Hit Reality in 2025. Next Year, It All Moves Faster appeared first on TheWrap.",
    "link": "https://www.thewrap.com/industry-news/tech/hollywoods-ai-hype-hit-reality-in-2025-next-year-it-all-moves-faster/",
    "timestamp": "2025-12-19T14:00:00Z"
  },
  {
    "title": "Egomania Prevails: Board of Kennedy Center Renames It for Trump",
    "description": "Trump’s hand-picked board of the John F. Kennedy Center for the Performing Arts in the nation’s Capitol has voted to rename it. It is now the Trump-Kennedy Center for the Performing Arts. Early in his term, Trump fired Biden’s appointees to the Kennedy Center…",
    "link": "https://dianeravitch.net/2025/12/19/egomania-prevails-board-of-kennedy-center-renames-it/",
    "timestamp": "2025-12-19T14:00:00Z"
  },
  {
    "title": "More US Beef Plants May Close as Cattle Herds Keep Tightening",
    "description": "American beef plants are under threat as the number of cattle destined for their facilities stays far below historical levels, reflecting the smallest herd in more than half a century. Cattle placed in US feedlots, where animals are fed until …",
    "link": "https://www.insurancejournal.com/news/midwest/2025/12/19/851767.htm",
    "timestamp": "2025-12-19T13:59:47Z"
  },
  {
    "title": "Ben & Jerry’s Board Says More Directors Face Removal",
    "description": "Ben & Jerry’s independent board late on Wednesday said in a filing that its new corporate parent, the Magnum Ice Cream Company, is forcing three more directors to complete training and other requirements or face removal. Ben & Jerry’s, newly …",
    "link": "https://www.insurancejournal.com/news/east/2025/12/19/851762.htm",
    "timestamp": "2025-12-19T13:57:41Z"
  },
  {
    "title": "Manhunt in Massachusetts ends after mass shooter, MIT murderer found dead inside storage facility",
    "description": "Claudio Neves Valente, 48, a former Brown student and Portuguese national, was found dead Thursday night from a self-inflicted gunshot wound.",
    "link": "https://fortune.com/2025/12/19/mit-brown-university-mass-shooter-dead-new-hampshire-storage-facility/",
    "timestamp": "2025-12-19T13:55:52Z"
  },
  {
    "title": "Trump's Handpicked Fluffers Surprise Trump By Fluffing His Name Onto Kennedy Center",
    "description": "(They actually cannot do that.)",
    "link": "https://www.wonkette.com/p/trumps-handpicked-fluffers-surprise",
    "timestamp": "2025-12-19T13:55:25Z"
  },
  {
    "title": "Putin taunts NATO’s Rutte: You know the US doesn’t see Russia as an enemy",
    "description": "\"Can you even read?\" Russian president fumes, as he directs military alliance chief toward Donald Trump's new National Security Strategy.",
    "link": "https://www.politico.eu/article/putin-taunts-nato-chief-rutte-us-doesnt-see-russia-enemy-national-security-strategy/",
    "timestamp": "2025-12-19T13:55:01Z"
  },
  {
    "title": "Jeffries Mocks Administration: 'The Ship Be Sinking, It's Over'",
    "description": "I do like this version of Hakeem Jeffries. Publicly ridicule Trump, every chance you get! I'm tired of seeing this brain-addled old man treated as a credible leader of the country. Via Mediaite:\nHouse Minority Leader Hakeem Jeffries (D-NY) went off on the Tru…",
    "link": "https://crooksandliars.com/2025/12/jeffries-mocks-administration-ship-be",
    "timestamp": "2025-12-19T13:48:49Z"
  },
  {
    "title": "Trump Is Running Out of Time to Remake the Economy Before the Midterms (NOTUS)",
    "description": "NOTUS:\nTrump Is Running Out of Time to Remake the Economy Before the Midterms  —  “Everyone would love immediate gratification, but that's just not how it works,” a senior White House official told NOTUS.  — Copy  —  When pressed on affordability, President D…",
    "link": "https://www.memeorandum.com/251219/p23",
    "timestamp": "2025-12-19T13:45:00Z"
  },
  {
    "title": "Historic U.S. Cannabis Rescheduling Unlocks Potential Growth Opportunities for MediPharm Labs, Backed by the Company's Suite of Licenses and Proven U.S. Clinical Trial Supply Experience",
    "description": "Historic U.S. Cannabis Rescheduling Unlocks Potential Growth Opportunities for MediPharm Labs...",
    "link": "https://www.globenewswire.com/news-release/2025/12/19/3208493/0/en/Historic-U-S-Cannabis-Rescheduling-Unlocks-Potential-Growth-Opportunities-for-MediPharm-Labs-Backed-by-the-Company-s-Suite-of-Licenses-and-Proven-U-S-Clinical-Trial-Supply-Experien.html",
    "timestamp": "2025-12-19T13:45:00Z"
  },
  {
    "title": "US military says 2 strikes on alleged drug boats kill 5 in eastern Pacific",
    "description": "US military says 2 strikes on alleged drug boats kill 5 in eastern Pacificwgal.com",
    "link": "https://www.wgal.com/article/us-military-strikes-two-drug-smuggling-boats-eastern-pacific/69818952",
    "timestamp": "2025-12-19T13:44:24Z"
  },
  {
    "title": "Karoline Leavitt buried for 'new level of absurdity' as Trump's 'minions' do his bidding",
    "description": "White House Press Secretary Karoline Leavitt was raked over the coals on MS NOW on Friday morning over her braying announcement that Donald Trump’s name was being added to the John F. Kennedy Center for the Performing Arts.Thursday afternoon, Leavitt took to …",
    "link": "https://www.rawstory.com/leavitt-kennedy-center-absurdity/",
    "timestamp": "2025-12-19T13:41:08Z"
  },
  {
    "title": "Krafton’s Rs 6,000 crore fund; India turns AI hotspot",
    "description": "Krafton is planning to double down on India with its new fund. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/kraftons-rs-6000-crore-fund-india-turns-ai-hotspot/articleshow/126078443.cms",
    "timestamp": "2025-12-19T13:40:22Z"
  },
  {
    "title": "Milei’s Midterm Victory: Endorsing Austerity, Eroding Democracy?",
    "description": "In October, Argentine President Javier Milei and his party, La Libertad Avanza (LLA), achieved a crucial victory in the midterm elections, which renewed one-third of the seats in Congress. Milei, who took office in 2023, saw his party win nearly 41% of the vo…",
    "link": "https://www.fairobserver.com/economics/mileis-midterm-victory-endorsing-austerity-eroding-democracy/",
    "timestamp": "2025-12-19T13:39:22Z"
  },
  {
    "title": "TikTok agrees U.S. joint venture deal with Oracle, Silver Lake and MGX",
    "description": "U.S. user data will be stored locally in a system run by Oracle, whose shares jumped 5% on the announcement.",
    "link": "https://fortune.com/2025/12/19/tiktok-agrees-u-s-joint-venture-deal-with-oracle-silver-lake-and-mgx/",
    "timestamp": "2025-12-19T13:38:13Z"
  },
  {
    "title": "Trump declares federal holiday on December 24 and 26",
    "description": "On Thursday, President Donald Trump signed an executive order to give federal workers off on December 24 and December 26 this year, creating a five-day holiday break.",
    "link": "https://www.fox5dc.com/news/trump-gives-fed-workers-off-christmas-eve-december-26",
    "timestamp": "2025-12-19T13:35:10Z"
  },
  {
    "title": "JFK's Family Reacts to 'Trump-Kennedy Center' Renaming Plan",
    "description": "President Donald Trump's hand-picked board at The Kennedy Center for the Performing Arts has voted to rename the iconic institution to the \"Trump-Kennedy Center.\" The move is raising serious legal questions and intense backlash from members of the Kennedy fam…",
    "link": "https://www.today.com/video/jfk-s-family-reacts-to-trump-kennedy-center-renaming-plan-254731333509",
    "timestamp": "2025-12-19T13:33:54Z"
  },
  {
    "title": "We Cannot Build an Economy on Lies",
    "description": "In a recent issue, Time Magazine boldly declared, “The Free Market Is Dead,” and then added: “What Will Replace It?” Of course, one can always expect Time to be disingenuous at best and dishonest at worst, and as an academic economist, I have come to realize …",
    "link": "https://www.shtfplan.com/headline-news/we-cannot-build-an-economy-on-lies",
    "timestamp": "2025-12-19T13:30:59Z"
  },
  {
    "title": "Florida GOP Rep. Reportedly Considering Forcing Vote To Expel Ilhan Omar From Congress",
    "description": "Republican congressman Randy Fine, from Florida, is considering forcing a vote to expel Democratic counterpart Ilhan Omar from Congress, according to a new report.",
    "link": "https://www.ibtimes.com/florida-gop-rep-reportedly-considering-forcing-vote-expel-ilhan-omar-congress-3793218",
    "timestamp": "2025-12-19T13:25:14Z"
  },
  {
    "title": "TikTok Deal Done And It’s Somehow The Shittiest Possible Outcome, Making Everything Worse",
    "description": "There were rumblings about this for a while, but it looks like the Trump TikTok deal is done, and it’s somehow the worst of all possible outcomes, amazingly making all of the biggest criticisms about TikTok significantly worse. Quite an accomplishment. The Ch…",
    "link": "https://www.techdirt.com/2025/12/19/tiktok-deal-done-and-its-somehow-the-shittiest-possible-outcome-making-everything-worse/",
    "timestamp": "2025-12-19T13:24:23Z"
  },
  {
    "title": "The Real Reason Behind Trump Media's $6 Billion Nuclear Fusion Merger",
    "description": "Donald Trump's associated media firm makes a shock move into nuclear fusion with a £4.5 billion merger, raising questions about power, politics and the future of clean energy in America.",
    "link": "https://www.ibtimes.com/real-reason-behind-trump-medias-6-billion-nuclear-fusion-merger-3793212",
    "timestamp": "2025-12-19T13:24:17Z"
  },
  {
    "title": "DHS rips Dem-run county after illegal immigrant murderer released: 'Blood on their hands'",
    "description": "An illegal immigrant from El Salvador with a lengthy criminal record was freed after Fairfax prosecutors dropped charges, then he allegedly killed a man in his Northern Virginia home the very next day.",
    "link": "https://www.foxnews.com/politics/dhs-rips-dem-run-county-after-illegal-immigrant-murderer-released-blood-hands",
    "timestamp": "2025-12-19T13:22:34Z"
  },
  {
    "title": "Why are some Black conservatives drawn to Nick Fuentes?",
    "description": "Black Americans and white nationalists have joined forces in the past. And a number of cultural and political shifts have broadened Fuentes’ appeal to Americans of all races.",
    "link": "https://theconversation.com/why-are-some-black-conservatives-drawn-to-nick-fuentes-270437",
    "timestamp": "2025-12-19T13:22:23Z"
  },
  {
    "title": "Board member angrily slams attempted renaming of Kennedy Center by Trump: ‘This is censorship’",
    "description": "The White House has claimed that the Kennedy Center‘s board “unanimously” voted to rename the performing arts centre to honour US President Donald Trump. However, the that statement has been challenged by one board member. White House Press Secretary Karoline…",
    "link": "https://www.thepinknews.com/2025/12/19/trump-kennedy-center-joyce-beatty/",
    "timestamp": "2025-12-19T13:21:39Z"
  },
  {
    "title": "3 Nuclear Power Stocks Set to Flourish in 2026 on AI Data Center Boom",
    "description": "CEG, TLN and D stand to benefit as AI data centers drive soaring power demand, pushing nuclear energy into the spotlight for long-term growth.",
    "link": "https://finance.yahoo.com/news/3-nuclear-power-stocks-set-132100209.html",
    "timestamp": "2025-12-19T13:21:00Z"
  },
  {
    "title": "Oil prices stable after Trump says he won't rule out war with Venezuela",
    "description": "Trump declined to say whether overthrowing Venezuelan President Nicolas Maduro is his ultimate goal.",
    "link": "https://www.cnbc.com/2025/12/19/crude-oil-prices-today-trump-venezuela.html",
    "timestamp": "2025-12-19T13:20:29Z"
  },
  {
    "title": "'Volunteer your child!' Conservative challenged after he praises Trump's 'hunger games'",
    "description": "CNN's Audie Cornish challenged a conservative panelist after he praised an athletic competition announced by President Donald Trump that has sparked comparisons to the dystopian \"Hunger Games\" novels and films.The 79-year-old president announced the White Hou…",
    "link": "https://www.rawstory.com/trump-hunger-games-cnn/",
    "timestamp": "2025-12-19T13:18:50Z"
  },
  {
    "title": "As millions of Americans face a steep rise in health insurance costs, lawmakers continue a century-long battle over who should pay for health care",
    "description": "US health care policy will remain fractured until lawmakers address the core question of who is responsible for health care costs.",
    "link": "https://theconversation.com/as-millions-of-americans-face-a-steep-rise-in-health-insurance-costs-lawmakers-continue-a-century-long-battle-over-who-should-pay-for-health-care-271901",
    "timestamp": "2025-12-19T13:17:45Z"
  },
  {
    "title": "No Best-Case Scenario: The Likely Outcomes of War in Venezuela",
    "description": "In a sordid slime harmonious Greed was born in yonder ditch, With a longing in his bosom – and for others’ goods an itch. As Christ died to make men holy, let men die to make us rich – Our god is marching on. The Battle Hymn of the Republic, Updated ~ Mark Tw…",
    "link": "https://www.antiwar.com/blog/2025/12/19/no-best-case-scenario-the-likely-outcomes-of-war-in-venezuela/",
    "timestamp": "2025-12-19T13:16:19Z"
  },
  {
    "title": "Wisconsin judge convicted of obstruction after shielding unauthorized immigrant from federal agents",
    "description": "A jury has found a Wisconsin judge accused of helping a Mexican immigrant dodge federal authorities guilty of obstruction, marking a victory for U.S. President Donald Trump as he continues his sweeping immigration crackdown across the country.",
    "link": "https://www.cbc.ca/news/world/us-wisconsin-judge-duggan-verdict-9.7022357",
    "timestamp": "2025-12-19T13:10:18Z"
  },
  {
    "title": "BBC overhauls editorial committee after Trump speech row",
    "description": "The committee will take a \"robust and transparent approach\" to tackling editorial concerns, a report says.",
    "link": "https://www.bbc.com/news/articles/cj9yp7v37jyo",
    "timestamp": "2025-12-19T13:09:57Z"
  },
  {
    "title": "Colombian President Petro Taunts Trump, Proposes U.S. Gives Texas And California In Exchange For Oil",
    "description": "Colombian President Gustavo Petro taunted U.S. counterpart Donald Trump over recent comments about the justification of the country's blockade of sanctioned Venezuelan tankers.",
    "link": "https://www.ibtimes.com/colombian-president-petro-taunts-trump-proposes-us-gives-texas-california-exchange-oil-3793209",
    "timestamp": "2025-12-19T13:02:26Z"
  },
  {
    "title": "Happy Epstein Files Release Day To All Who Celebrate!",
    "description": "The rest of the Epstein photographs are expected to be released today. O happy day! People will be posting the pictures on social media, as is traditional for the holiday. Via NBC News:\nOn Thursday, Democrats on that committee released 68 photos from the esta…",
    "link": "https://crooksandliars.com/2025/12/happy-epstein-files-release-day-all-who",
    "timestamp": "2025-12-19T13:00:42Z"
  },
  {
    "title": "Holiday Tradition: Say 'F*ck Trump' - Donate To C&L",
    "description": "In an era of media consolidation and corporate-controlled narratives, Crooks and Liars stands as a critical beacon of independent progressive journalism. We've been your trusted source for unfiltered news, cutting-edge analysis, and comprehensive political co…",
    "link": "https://crooksandliars.com/2025/12/holiday-tradition-say-fck-trump-donate-cl",
    "timestamp": "2025-12-19T13:00:25Z"
  },
  {
    "title": "Inside Intel’s new Arizona fab, where the chipmaker’s fate hangs in the balance",
    "description": "At Intel’s new fab in Arizona, 18A is in high-volume production. With no major outside customers and a 10% government stake, is it enough to save the chipmaker?",
    "link": "https://www.cnbc.com/2025/12/19/intel-aims-to-find-clients-and-catch-tsmc-with-new-chip-fab-in-arizona.html",
    "timestamp": "2025-12-19T13:00:01Z"
  },
  {
    "title": "International Insider: CAA Sizes Up UK; Prime Video Webnovel Love-In; Netflix’s French Connection",
    "description": "Giddy up, jingle-horse, pick up your feet… because the holiday season Insider is here. Jesse Whittock with you as we head nearer the festive period. This will be the last Insider of the year, but we’ll be back on Friday, January 9, 2026. For the final time th…",
    "link": "http://deadline.com/2025/12/international-insider-caa-prime-video-webnovel-netflix-1236652412/",
    "timestamp": "2025-12-19T13:00:00Z"
  },
  {
    "title": "Trump Reveals “Phase Two” of the Gaza Ceasefire",
    "description": "Donald Trump has revealed phase two of the Gaza ceasefire agreement, which has already been violated. Trump’s goal is to announce the plans he’s concocted before Christmas. One of the proposals will be the creation of an international “Board of Peace,” and in…",
    "link": "https://www.activistpost.com/trump-reveals-phase-two-of-the-gaza-ceasefire/",
    "timestamp": "2025-12-19T13:00:00Z"
  },
  {
    "title": "Washington accuses South Africa of ‘intimidating’ US officials",
    "description": "Washington has warned of severe consequences in response to the alleged detention and harassment of US officials in South Africa Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/629758-washington-accuses-south-africa-intimidating-us-officials/",
    "timestamp": "2025-12-19T12:58:38Z"
  },
  {
    "title": "Stephen A. Smith argues with Rep. Clyburn, says gender is not the reason people refused to support Harris",
    "description": "Sports commentator Stephen A. Smith disputes Rep. James Clyburn's claim that gender bias caused Kamala Harris's election loss to President Donald Trump.",
    "link": "https://www.foxnews.com/media/stephen-a-smith-argues-rep-clyburn-says-gender-not-reason-people-refused-support-harris",
    "timestamp": "2025-12-19T12:54:52Z"
  },
  {
    "title": "Flawed inflation data dashes Donald Trump’s hopes of a quick affordability victory",
    "description": "Donald Trump was feeling vindicated after November's inflation data, but Wall Street met the figures with a skeptical shrug. Read more.",
    "link": "https://financialpost.com/financial-times/flawed-inflation-data-donald-trumps-quick-affordability-victory",
    "timestamp": "2025-12-19T12:50:30Z"
  },
  {
    "title": "Viral Tweets That Were Completely Fake in 2025",
    "description": "Fake tweets from Rob Reiner, Elon Musk, and Donald Trump all made the rounds this year.",
    "link": "https://gizmodo.com/viral-tweets-that-were-completely-fake-in-2025-2000695941",
    "timestamp": "2025-12-19T12:50:30Z"
  }
]