[
  {
    "title": "40 million new roles but only 30% in services: How India’s services sector boom hides a looming jobs crisis",
    "description": "India's booming services sector, contributing over half of national output, faces a reality check. Despite job growth, employment remains largely informal and low-paying, creating a paradox of strong output without quality jobs. Regional and gender disparitie…",
    "link": "https://timesofindia.indiatimes.com/education/news/40-million-new-roles-but-only-30-in-services-how-indias-services-sector-boom-hides-a-looming-jobs-crisis/articleshow/124894335.cms",
    "timestamp": "2025-10-29T08:22:52Z"
  },
  {
    "title": "5 people who could become the next Federal Reserve chair: Trump administration picks short list to replace Jerome Powell",
    "description": "On October 27, Treasury Secretary Scott Bessent said that President Donald Trump has narrowed down his search to replace Federal Reserve chair Jerome Powell, whose term does not end until May 2026.\nPowell, who has butted heads with Trump over lowering interes…",
    "link": "https://biztoc.com/x/a33dd4d18bf395a3",
    "timestamp": "2025-10-29T08:22:17Z"
  },
  {
    "title": "South Korea Gifts Trump Replica of Ancient Gold Crown",
    "description": "“To new trust and companionship between Korea and the United States.\"\nSouth Korean President Lee Jae Myung presents US President Donald Trump with a replica of a gold crown from the ancient Silla era as the pair meet on the sidelines of the APEC summit.\nRead …",
    "link": "https://biztoc.com/x/d936b606d5d8769f",
    "timestamp": "2025-10-29T08:22:15Z"
  },
  {
    "title": "Trump Threatened 250% Tariffs on India, Pakistan",
    "description": "US President Donald Trump says he threatened India and Pakistan with 250% tariffs to help spur the resolution of their conflict ...",
    "link": "https://biztoc.com/x/7a725fe6c3a4837e",
    "timestamp": "2025-10-29T08:16:40Z"
  },
  {
    "title": "Mercedes-Benz profit plunges as German market sees weakened exports",
    "description": "German premium carmaker Mercedes-Benz reported plunging third-quarter profit Wednesday, hit by weak sales in China as well as US tariffs.",
    "link": "https://www.thelocal.de/20251029/mercedes-benz-profit-plunges-as-german-market-sees-weakened-exports",
    "timestamp": "2025-10-29T08:16:35Z"
  },
  {
    "title": "Maharashtra farm loan waiver row: Devendra Fadnavis rules out immediate relief; CM says govt open for talks with Bacchu Kadu",
    "description": "Maharashtra Chief Minister Devendra Fadnavis stated that a farm loan waiver will not happen immediately. The government's priority is to provide compensation to farmers who suffered crop losses due to heavy rains. Fadnavis invited MLA Bacchu Kadu for discussi…",
    "link": "https://timesofindia.indiatimes.com/city/nagpur/maharashtra-farm-loan-waiver-row-devendra-fadnavis-rules-out-immediate-relief-cm-says-govt-open-for-talks-with-bacchu-kadu/articleshow/124894126.cms",
    "timestamp": "2025-10-29T08:15:02Z"
  },
  {
    "title": "Ex-Official Flags ‘Throwaway’ Trump Line That’s Way More ‘Ominous’ Than It Sounds",
    "description": "The “blink-and-you'll-miss-it” remark is \"an obvious signal\" to the president's friends and supporters, said Miles Taylor.",
    "link": "https://www.huffpost.com/entry/miles-taylor-donald-trump-ominous-line_n_6901c009e4b0522875e898fd",
    "timestamp": "2025-10-29T08:14:18Z"
  },
  {
    "title": "RBSE date sheet 2026: Half-yearly exam schedule for Classes 9-12 released; check direct link to download here",
    "description": "Rajasthan Board has announced half-yearly exam schedules for Classes 9-12, commencing November 20 to December 1, 2025. Exams will be held offline across Rajasthan in two shifts daily. Students can access the detailed class-wise timetable on the Directorate of…",
    "link": "https://timesofindia.indiatimes.com/education/news/rbse-date-sheet-2026-half-yearly-exam-schedule-for-classes-9-12-released-check-direct-link-to-download-here/articleshow/124893741.cms",
    "timestamp": "2025-10-29T08:14:03Z"
  },
  {
    "title": "Monarch-loving Trump gifted replica of golden crown once worn by South Korean kings",
    "description": "GYEONGJU: President Donald Trump may be facing protests back home calling for \"no kings\" in the United States, but in South Korea, officials had the perfect gift for the monarch-loving magnate - a replica golden crown.Trump",
    "link": "https://www.channelnewsasia.com/world/trump-crown-gift-south-korea-king-5432101",
    "timestamp": "2025-10-29T08:13:00Z"
  },
  {
    "title": "Trump says he will cut fentanyl tariff on Chinese goods and expects ‘good deal’ with Xi – business live",
    "description": "Many Asian stock markets rally on trade deal optimism, ahead of expected US interest rate cut\nGood morning, and welcome to our rolling coverage of business, the financial markets and the world economy.\nDonald Trump has said he will cut fentanyl-linked US tari…",
    "link": "https://biztoc.com/x/b88e7fe1f5a75dde",
    "timestamp": "2025-10-29T08:10:55Z"
  },
  {
    "title": "China says Xi, Trump to have 'in depth' talks on 'major issues'",
    "description": "Beijing (AFP) Oct 29, 2025\n\n\n China said that leader Xi Jinping and US President Donald Trump will have \"in depth\" talks on \"major issues\" Thursday, as expectations grew for their high-stakes talks in South Korea. \n\nTrump has said he expected their first face…",
    "link": "https://www.spacewar.com/reports/China_says_Xi_Trump_to_have_in_depth_talks_on_major_issues_999.html",
    "timestamp": "2025-10-29T08:04:42Z"
  },
  {
    "title": "Gaza's civil defence says at least 50 killed in Israeli strikes",
    "description": "Gaza City, Palestinian Territories (AFP) Oct 29, 2025\n\n\n Gaza's civil defence agency said Wednesday that overnight air strikes killed at least 50 people in the Palestinian territory, as the Israeli military hit a string of targets after an attack that left a …",
    "link": "https://www.spacewar.com/reports/Gazas_civil_defence_says_at_least_50_killed_in_Israeli_strikes_999.html",
    "timestamp": "2025-10-29T08:04:42Z"
  },
  {
    "title": "Japan-US ties key to deterring China 'aggression': Pentagon",
    "description": "Tokyo (AFP) Oct 29, 2025\n\n\n Pentagon chief Pete Hegseth said Wednesday the Japan-US alliance was \"critical to deterring Chinese military aggression\", as his Japanese counterpart confirmed plans to accelerate a defence spending target. \n\nThe comments came in t…",
    "link": "https://www.spacewar.com/reports/Japan-US_ties_key_to_deterring_China_aggression_Pentagon_999.html",
    "timestamp": "2025-10-29T08:04:42Z"
  },
  {
    "title": "North Korea announces missile test hours before Trump due in South",
    "description": "Seoul (AFP) Oct 29, 2025\n\n\n North Korea test-fired cruise missiles off its western coast in a message to Pyongyang \"enemies\", state media announced Wednesday just hours before US President Donald Trump begins a visit to South Korea. \n\nThe sea-to-surface missi…",
    "link": "https://www.spacewar.com/reports/North_Korea_announces_missile_test_hours_before_Trump_due_in_South_999.html",
    "timestamp": "2025-10-29T08:04:42Z"
  },
  {
    "title": "Trump says 'timing' didn't work out to meet N. Korea's Kim",
    "description": "Gyeongju, South Korea (AFP) Oct 29, 2025\n\n\n Donald Trump said on Wednesday he was not able to arrange a meeting with North Korean leader Kim Jong Un during the US president's visit to the South, ending fierce speculation over a possible summit. \n\nTrump had sa…",
    "link": "https://www.spacewar.com/reports/Trump_says_timing_didnt_work_out_to_meet_N_Koreas_Kim_999.html",
    "timestamp": "2025-10-29T08:04:42Z"
  },
  {
    "title": "Trump throws China assumptions in air as he meets 'brilliant' Xi",
    "description": "Washington (AFP) Oct 28, 2025\n\n\n For years few issues drew more unanimity in the polarized United States than China - it was the arch-adversary, which Washington was destined to confront. \n\nPresident Donald Trump, as he has on so many topics, has scrambled ma…",
    "link": "https://www.spacewar.com/reports/Trump_throws_China_assumptions_in_air_as_he_meets_brilliant_Xi_999.html",
    "timestamp": "2025-10-29T08:04:42Z"
  },
  {
    "title": "'Stronger India-Japan ties vital for global peace, stability and prosperity': PM Modi speaks to Japanese PM Takaichi",
    "description": "Prime Minister Narendra Modi spoke to Japanese PM Sanae Takaichi on Wednesday and congratulated her on assuming office. He discussed the shared vision of advancing the partnership between the two countries and the leaders underscored that stronger India-Japan…",
    "link": "https://timesofindia.indiatimes.com/india/stronger-india-japan-ties-vital-for-global-peace-stability-and-prosperity-pm-modi-speaks-to-japanese-pm-takaichi/articleshow/124893993.cms",
    "timestamp": "2025-10-29T08:03:50Z"
  },
  {
    "title": "How do Carney's special agencies work? Governing documents are out of public view",
    "description": "Prime Minister Mark Carney's government has created three special operating agencies to review major projects, build homes and speed defence spending. However, the government refuses to reveal the framework agreements that outline some of the rules the new ag…",
    "link": "https://www.cbc.ca/news/politics/carney-special-operating-agencies-9.6957353",
    "timestamp": "2025-10-29T08:00:55Z"
  },
  {
    "title": "EXCLUSIVE: Federal budget to include plan for businesses to write off capital costs more aggressively: sources",
    "description": "The upcoming federal budget will feature a broad new strategy to boost the performance of Canadian business.",
    "link": "https://nationalpost.com/news/canada/exclusive-federal-budget-to-include-plan-for-businesses-to-write-off-capital-costs-more-aggressively-sources",
    "timestamp": "2025-10-29T08:00:24Z"
  },
  {
    "title": "Igniting the American Quantum Economy",
    "description": "Editor’s Note: This is the third article in a four-part series. The first article, “America’s Quantum Moment,” was published on Oct. 13, 2025, and the second, “The Supply Chain Chokepoints in Quantum,” was published on Oct. 20, 2025. Policy interventions are …",
    "link": "https://warontherocks.com/2025/10/igniting-the-american-quantum-economy/",
    "timestamp": "2025-10-29T08:00:23Z"
  },
  {
    "title": "Copper Rallies to Record on US-China Hopes and Supply Setbacks",
    "description": "Copper rose to a record high, with the US and China on the cusp of a sweeping deal to dial down trade tensions, while a series of supply setbacks at leading mines have tightened the global market.",
    "link": "https://financialpost.com/pmn/business-pmn/copper-rallies-to-record-on-us-china-hopes-and-supply-setbacks",
    "timestamp": "2025-10-29T08:00:11Z"
  },
  {
    "title": "No projects finalized under Japan's $550 billion investment pledge",
    "description": "No projects were finalized under Japan’s $550 billion investment pledge while U.S. President Donald Trump was in the country for a three-day visit heavy on sentiment but light on substance.\nInstead, two documents were issued that named companies, concepts and…",
    "link": "https://biztoc.com/x/491977f344c5b882",
    "timestamp": "2025-10-29T08:00:07Z"
  },
  {
    "title": "China may be rehearsing for an invasion of Taiwan — but on the potential front lines there's little panic",
    "description": "CBC News visited Taiwan’s Kinmen islands, which are just a few kilometres across the bay from the Chinese city of Xiamen. The islands have been on the frontline of hostilities between China and Taiwan for more than seven decades. Many Kinmen locals say they d…",
    "link": "https://www.cbc.ca/news/world/taiwan-kinmen-china-invasion-trump-xi-apec-summit-9.6954064",
    "timestamp": "2025-10-29T08:00:00Z"
  },
  {
    "title": "US, Japan Sign Framework Deal to Secure Supply of Critical Minerals, Rare Earths",
    "description": "US President Donald Trump and Japanese Prime Minister Sanae Takaichi signed on Tuesday a framework agreement aimed at ensuring a stable supply of critical minerals and rare earth elements.",
    "link": "https://www.globalsecurity.org/wmd/library/news/japan/2025/japan-251028-sputnik01.htm",
    "timestamp": "2025-10-29T07:59:53Z"
  },
  {
    "title": "China, ASEAN ink enhanced free trade pact to fight off Trump's tariffs",
    "description": "China and the Association of Southeast Asian Nations (ASEAN) have signed an upgraded version of their free trade pact as part of concerted efforts to confront US tariffs.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/10/china-251028-presstv01.htm",
    "timestamp": "2025-10-29T07:59:53Z"
  },
  {
    "title": "Wang Yi Has a Phone Call with U.S. Secretary of State Marco Rubio",
    "description": "On October 27, 2025, Member of the Political Bureau of the CPC Central Committee and Foreign Minister Wang Yi had a phone call with U.S. Secretary of State Marco Rubio.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/10/china-251027-prc-mofa01.htm",
    "timestamp": "2025-10-29T07:59:53Z"
  },
  {
    "title": "Russia Awaits Positive US Response to Putin's New START Proposal - Lavrov",
    "description": "Russia expects to receive a positive response from the United States to Russian President Vladimir Putin's proposal on the New START (New Strategic Arms Reduction Treaty), Russian Foreign Minister Sergey Lavrov said on Tuesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251028-sputnik01.htm",
    "timestamp": "2025-10-29T07:59:53Z"
  },
  {
    "title": "Trump says ‘it’s too bad’ he can’t run for a third term",
    "description": "President Donald Trump mused about a third term, stating it is \"too bad\" he cannot run again. House Speaker Mike Johnson confirmed the constitutional barrier to a third term. Trump acknowledged the 22nd Amendment's restrictions. He also dismissed ideas like r…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-its-too-bad-he-cant-run-for-a-third-term/articleshow/124893860.cms",
    "timestamp": "2025-10-29T07:56:51Z"
  },
  {
    "title": "'It's a yoga pose': MP teacher suspended for making students perform 'namaz-like postures'",
    "description": "A government school teacher in Burhanpur district has been suspended for allegedly making students perform Namaz-like postures before Surya Namaskar at Government Hindi Middle School, Devhari.\n\nAccording to officials, the complaint reached District Education …",
    "link": "https://timesofindia.indiatimes.com/city/indore/its-a-yoga-pose-called-shashankasana-mp-teacher-suspended-for-making-students-perform-namaz-like-postures/articleshow/124893676.cms",
    "timestamp": "2025-10-29T07:56:47Z"
  },
  {
    "title": "Hamas denounces Israel's 'blatant' ceasefire violation, rejects Tel Aviv's accusations of breach",
    "description": "Hamas has denounced the Israeli regime's \"blatant violation\" of a ceasefire agreement with the resistance movement on multiple occasions, besides categorically rejecting Tel Aviv's allegations of the group's breaching the deal.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251028-presstv01.htm",
    "timestamp": "2025-10-29T07:56:27Z"
  },
  {
    "title": "Zelenskyy Urges Trump to Pressure Xi Over China's Support For Russia In Ukraine War",
    "description": "President Volodymyr Zelenskyy has urged Donald Trump to press China to end its support for Russia in its war against Ukraine when the US President meets his Chinese counterpart, Xi Jinping, during a tour of Asia this week.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251028-rferl03.htm",
    "timestamp": "2025-10-29T07:56:27Z"
  },
  {
    "title": "Palestinians in Gaza face 'slow genocide' as Israel continues blockade: Media office",
    "description": "The Gaza Government Media Office has warned that while direct Israeli bombardments have largely paused, Palestinians in the besieged territory continue to face \"slow genocide,\" driven by the ongoing blockade and severe restrictions on humanitarian aid.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251028-presstv05.htm",
    "timestamp": "2025-10-29T07:56:27Z"
  },
  {
    "title": "No projects finalized under Japan's $550 billion investment pledge",
    "description": "Fact sheets issued during the recent Japan-U.S. summit offered little insight into any progress made.",
    "link": "https://www.japantimes.co.jp/business/2025/10/29/economy/japan-us-investment-no-deals/",
    "timestamp": "2025-10-29T07:56:00Z"
  },
  {
    "title": "Trump says he may speak to China's Xi about Nvidia's 'super-duper' Blackwell chip",
    "description": "Beijing has long been irked by Washington's export controls\nthat ban Nvidia from selling its most advanced AI chips to\nChina.",
    "link": "https://www.thehindubusinessline.com/info-tech/trump-says-he-may-speak-to-chinas-xi-about-nvidias-super-duper-blackwell-chip/article70215966.ece",
    "timestamp": "2025-10-29T07:54:03Z"
  },
  {
    "title": "GATE application correction window 2026 opens at gate2026.iitg.ac.in: Check key details and direct link here",
    "description": "The Indian Institute of Technology (IIT) Guwahati has opened the correction window for GATE 2026 applications, allowing candidates to rectify errors in details such as name, date of birth, exam city, paper choice, and category until November 3, 2025. Applican…",
    "link": "https://timesofindia.indiatimes.com/education/news/gate-application-correction-window-2026-opens-at-gate2026-iitg-ac-in-check-key-details-and-direct-link-here/articleshow/124893757.cms",
    "timestamp": "2025-10-29T07:53:36Z"
  },
  {
    "title": "Trump says he's 'not allowed to run' for another term but will 'see what happens'",
    "description": "The US Constitution limits presidents to two terms.",
    "link": "https://www.thejournal.ie/donald-trump-president-constitution-three-terms-6858819-Oct2025/",
    "timestamp": "2025-10-29T07:53:01Z"
  },
  {
    "title": "Donald Trump Says SNAP Benefits Will Be Solved For November",
    "description": "President Donald Trump has said \"we’re going to get it done\" regarding funding SNAP benefits during the government shutdown.",
    "link": "https://biztoc.com/x/b33832c56f860cef",
    "timestamp": "2025-10-29T07:48:59Z"
  },
  {
    "title": "China says Xi, Trump to meet in South Korea tomorrow",
    "description": "Chinese President Xi Jinping will meet with his US counterpart Donald Trump in South Korea tomorrow, China's foreign ministry has announced.",
    "link": "https://www.rte.ie/news/2025/1029/1541062-trump-south-korea/",
    "timestamp": "2025-10-29T07:47:59Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Readers tell us why they spoiled their vote, at least 50 killed in Israeli strikes on Gaza and Hurricane Melissa nears Cuba.",
    "link": "https://www.thejournal.ie/8-at-8-wednesday-121-6858800-Oct2025/",
    "timestamp": "2025-10-29T07:45:03Z"
  },
  {
    "title": "Zvi Yehezkeli: Israel undermining itself in responses to Hamas' ceasefire violations",
    "description": "Analyst Zvi Yehezkeli urges Israel to shift from limited responses to broader action against Hamas, including halting aid and resuming targeted strikes. 'We must respond from a place of strength, not just to each violation.'",
    "link": "https://www.israelnationalnews.com/news/416987",
    "timestamp": "2025-10-29T07:42:00Z"
  },
  {
    "title": "Έρχεται «συμφωνία Τραμπ» για το Κυπριακό; Δεν ήταν τυχαία τελικά η πρόσκληση Χριστοδουλίδη - Μητσοτάκη στη διάσκεψη για τη Γάζα!",
    "description": "«Μια συμφωνία Τραμπ» για το Κυπριακό;Δήμητρα Κυρανούδη, ΒερολίνοΟ γερμανικός Τύπος για τις πιθανές εξελίξεις στο Κυπριακό και τον ρόλο του Τραμπ. Επίσης, ρεπορτάζ για απελάσεις γυναικών-αναγνωρισμένων προσφύγων από τη Γερμανία στην Ελλάδα.«Μιλήσαμε κυρίως για…",
    "link": "https://i-epikaira.blogspot.com/2025/10/rnd.html",
    "timestamp": "2025-10-29T07:40:00Z"
  },
  {
    "title": "Grew in confidence after close semis bout: Sujeet Kalkal",
    "description": "Despite battling shoulder and back injuries, Sujeet Kalkal secured the U23 World wrestling crown in the men's 65kg category. Kalkal's determination shone through as he overcame tough opponents, including a close semifinal win, to claim the gold medal. He now …",
    "link": "https://timesofindia.indiatimes.com/sports/more-sports/wrestling/grew-in-confidence-after-close-semis-bout-sujeet-kalkal/articleshow/124893305.cms",
    "timestamp": "2025-10-29T07:39:18Z"
  },
  {
    "title": "Gold jumps 1% ahead of Trump-Xi summit in Asia",
    "description": "Precious metals rose on Wednesday, with gold gaining over 1% as markets turned their attention to US President Donald Trump's Asia tour and his upcoming meeting with Chinese President Xi Jinping.At 8:...",
    "link": "https://biztoc.com/x/7b4fe4ac0cbc5e42",
    "timestamp": "2025-10-29T07:38:01Z"
  },
  {
    "title": "Trump’s charm offensive in Asia sends Nikkei 225 to record heights",
    "description": "Shares were mostly higher Wednesday in Asia as Japan’s benchmark Nikkei 225 index surged more than 2% to another record.  U.S. futures were mixed and oil prices were little changed. U.S. President Donald Trump has been touring Asia and his upbeat comments on …",
    "link": "https://japantoday.com/category/business/trump%E2%80%99s-charm-offensive-in-asia-sends-nikkei-225-to-record-heights",
    "timestamp": "2025-10-29T07:37:39Z"
  },
  {
    "title": "U.S. to press Takaichi to up defense spending after cordial first meeting with Trump",
    "description": "Prime Minister Sanae Takaichi and U.S. President Donald Trump refrained from engaging in detailed discussions about Japan's defense spending during their first summit on Tuesday, but Washington is expected to press Tokyo to shoulder more of the burden in the …",
    "link": "https://japantoday.com/category/politics/U.S.-to-press-Takaichi-to-up-defense-spending-after-cordial-first-meeting-with-Trump",
    "timestamp": "2025-10-29T07:37:21Z"
  },
  {
    "title": "Punjab NEET PG counselling 2025: Round 1 schedule out at bfuhs.ac.in, check key dates and other details here",
    "description": "Baba Farid University of Health Sciences has commenced registration for Punjab NEET PG counselling 2025 for MD, MS, PG Diploma, and DNB seats. The process, including admission to PG Diploma in Sports Medicine, is underway with a registration deadline of Novem…",
    "link": "https://timesofindia.indiatimes.com/education/news/punjab-neet-pg-counselling-2025-round-1-schedule-out-at-bfuhs-ac-in-check-key-dates-and-other-details-here/articleshow/124893046.cms",
    "timestamp": "2025-10-29T07:36:40Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Wednesday",
    "description": "SPD figures resist Bürgergeld reforms, Ministry of Defence halts property sell-off, Lufthansa cuts domestic flights and more news on Wednesday, October 29th.",
    "link": "https://www.thelocal.de/20251029/today-in-germany-a-roundup-of-the-latest-news-on-wednesday-92",
    "timestamp": "2025-10-29T07:35:05Z"
  },
  {
    "title": "Trump says he may speak to China's Xi about Nvidia's 'super-duper' Blackwell chip",
    "description": "By Trevor Hunnicutt and Eduardo Baptista AIR FORCE ONE/GYEONGJU, South Korea (Reuters) -U.S.",
    "link": "https://www.yahoo.com/news/articles/trump-says-may-speak-chinas-073432698.html",
    "timestamp": "2025-10-29T07:34:32Z"
  },
  {
    "title": "Trump says India trade deal ‘soon’; no word on penal tariffs",
    "description": "Trump signals India-US trade pact near conclusion but Russian oil tariffs and pending US consent delay final agreement",
    "link": "https://www.thehindubusinessline.com/economy/trump-says-india-trade-deal-soon-no-word-on-penal-tariffs/article70215902.ece",
    "timestamp": "2025-10-29T07:32:51Z"
  },
  {
    "title": "Hurricane Melissa approaches Cuba with winds of 210 km/h – Jamaica assesses the damage, (video)",
    "description": "Jamaica has been declared a disaster zone, and the damage assessment has begun – The U.S. says it is ready to help – At least seven deaths have been reported so far\nThe post Hurricane Melissa approaches Cuba with winds of 210 km/h – Jamaica assesses the damag…",
    "link": "https://en.protothema.gr/2025/10/29/hurricane-melissa-approaches-cuba-with-winds-of-210-km-h-jamaica-assesses-the-damage-video/",
    "timestamp": "2025-10-29T07:31:19Z"
  },
  {
    "title": "CNBC Daily Open: Rallies and tech 'revolution' — all powered by AI",
    "description": "Investors can't get enough of AI, despite worries over high valuations — and tech companies can't get enough of each other, either.",
    "link": "https://www.cnbc.com/2025/10/29/cnbc-daily-open-rallies-and-tech-revolution-all-powered-by-ai.html",
    "timestamp": "2025-10-29T07:30:01Z"
  },
  {
    "title": "South Korea’s Lee Asks Trump to Revise Decades-Old Nuclear Pact",
    "description": "South Korean President Lee Jae Myung asked US President Donald Trump to allow Seoul to get supplies of nuclear fuel for submarines and to revise a decades-old nuclear energy agreement as the two leaders met Wednesday in Gyeongju.",
    "link": "https://financialpost.com/pmn/business-pmn/south-koreas-lee-asks-trump-to-revise-decades-old-nuclear-pact",
    "timestamp": "2025-10-29T07:29:29Z"
  },
  {
    "title": "Kyiv ready for peace talks but will not withdraw troops first, says Zelenskiy",
    "description": "Ukrainian and European officials to meet to discuss details of a ceasefire plan",
    "link": "https://www.irishtimes.com/world/europe/2025/10/29/kyiv-ready-for-peace-talks-but-not-withdraw-troops-first-says-zelenskiy/",
    "timestamp": "2025-10-29T07:27:02Z"
  },
  {
    "title": "View from The Hill: pressure on embattled Ley to do a deal on EPBC reform",
    "description": "Sussan Ley is set to survive “the killing season” but the task ahead is only going to get harder.",
    "link": "https://theconversation.com/view-from-the-hill-pressure-on-embattled-ley-to-do-a-deal-on-epbc-reform-268102",
    "timestamp": "2025-10-29T07:27:01Z"
  },
  {
    "title": "Trump-linked World Liberty to airdrop $1.2M of WLFI tokens to early USD1 users",
    "description": "World Liberty Financial, the Trump-affiliated crypto venture, will airdrop 8.4 million WLFI tokens to reward early USD1 users as part of its stablecoin loyalty program.",
    "link": "https://cointelegraph.com/news/trump-world-liberty-wlfi-airdrop-usd1-stablecoin",
    "timestamp": "2025-10-29T07:26:44Z"
  },
  {
    "title": "NBA makes tentative return to China as Trump and Xi meet",
    "description": "In 2019, the NBA was frozen out of its biggest overseas market. The relationship is now improving but there are no guarantees, especially with Beijing and Washington engaged in a trade war.",
    "link": "https://www.dw.com/en/nba-makes-tentative-return-to-china-as-trump-and-xi-meet/a-74519848",
    "timestamp": "2025-10-29T07:26:00Z"
  },
  {
    "title": "South Korea awards Trump its highest medal, gifts him a golden crown",
    "description": "South Korea welcomed U.S. President Donald Trump on Wednesday with a replica gold crown and awarded him with the “Grand Order of Mugunghwa”, the country’s highest decoration, the presidential office said.",
    "link": "https://www.thehindubusinessline.com/news/world/south-korea-awards-trump-its-highest-medal-gifts-him-a-golden-crown/article70215841.ece",
    "timestamp": "2025-10-29T07:25:37Z"
  },
  {
    "title": "Trump visits South Korea as he attempts to secure billions in investment",
    "description": "President Trump met South Korean leader Lee Jae Myung in Gyeongju, discussing partnerships during the Asia-Pacific Economic Cooperation summit.",
    "link": "https://www.foxnews.com/world/trump-visits-south-korea-he-attempts-secure-billions-investment",
    "timestamp": "2025-10-29T07:25:20Z"
  },
  {
    "title": "Trump tariffs to raise costs, delay oil and gas projects in 2026, report says",
    "description": "Deloitte report reveals US tariffs will increase costs and delay oil and gas projects, reshaping the industry's future by 2026.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-tariffs-to-raise-costs-delay-oil-and-gas-projects-in-2026-report-says/article70215384.ece",
    "timestamp": "2025-10-29T07:24:12Z"
  },
  {
    "title": "Trekking vs Hiking: Which zodiac signs prefer the rough trails and which enjoy the scenic routes?",
    "description": "Discover how your zodiac sign influences your approach to nature's adventures. Some signs crave the challenge of demanding treks, pushing their limits on rugged trails. Others find solace and beauty in gentle hikes, appreciating the calm rhythm of scenic path…",
    "link": "https://timesofindia.indiatimes.com/astrology/zodiacs-astrology/trekking-vs-hiking-which-zodiac-signs-prefer-the-rough-trails-and-which-enjoy-the-scenic-routes/articleshow/124892684.cms",
    "timestamp": "2025-10-29T07:21:02Z"
  },
  {
    "title": "Japan's Nikkei crosses 51,000 on Tokyo-Washington trade optimism, Fed rate cut hopes",
    "description": "Japan's Nikkei 225 jumped more than 2% to hit a record high above 51,000 for the first time Wednesday, lifted by renewed optimism over U.S.-Japan trade ties and expectations of another Federal Reserve rate cut.\nThe gains came after U.S. President Donald Trump…",
    "link": "https://biztoc.com/x/3f9d79b5e862863e",
    "timestamp": "2025-10-29T07:16:19Z"
  },
  {
    "title": "4 Zodiac Signs that are Best at Manifesting",
    "description": "Manifestation is a creative technique aligning inner energy with the cosmos. Certain zodiac signs excel at this. Sagittarians, ruled by Jupiter, are adventurous and disciplined. Taureans, guided by Venus, are patient and consistent. Capricorns, under Saturn, …",
    "link": "https://timesofindia.indiatimes.com/astrology/zodiacs-astrology/4-zodiac-signs-that-are-best-at-manifesting/articleshow/124890877.cms",
    "timestamp": "2025-10-29T07:14:34Z"
  },
  {
    "title": "Balancing motherhood & PhD, discus thrower Seema dreaming of LA glory",
    "description": "Discus thrower Seema Kaliramna is diligently training for the Los Angeles 2028 Olympics, aiming for multiple gold medals. Despite a disappointing season failing to breach the 60m mark, she's focused on future success at the Asian and Commonwealth Games. Suppo…",
    "link": "https://timesofindia.indiatimes.com/sports/more-sports/balancing-motherhood-phd-discus-thrower-seema-dreaming-of-la-glory/articleshow/124892451.cms",
    "timestamp": "2025-10-29T07:13:41Z"
  },
  {
    "title": "Women's World Cup: Can South Africa women overcome frailty against spin in crucial semifinal?",
    "description": "South Africa and England clash in the World Cup semi-final, a rematch of their opening game. South Africa seeks redemption after a shaky start, particularly their batting struggles against spin. England, despite potential bowler concerns, appears better equip…",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/icc-womens-world-cup-2025/womens-world-cup-can-south-africa-women-overcome-frailty-against-spin-in-crucial-semifinal/articleshow/124892431.cms",
    "timestamp": "2025-10-29T07:13:18Z"
  },
  {
    "title": "Jagadhatri Pujo honors Bengal’s forgotten rebels with Banglar Dakat",
    "description": "The 13th Santoshpally Jagadhatri Pujo celebrated Bengal's unsung heroes with the theme Banglar Dakat, redefining bandits as symbols of resistance against British oppression. The grand event, featuring actor Srabanti, also included significant social initiativ…",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/jagadhatri-pujo-honors-bengals-forgotten-rebels-with-banglar-dakat/articleshow/124892393.cms",
    "timestamp": "2025-10-29T07:11:52Z"
  },
  {
    "title": "Gold falls for 4th straight day ahead of Fed rate decision",
    "description": "Gold futures decline for the fourth consecutive day, falling to ₹1,19,470 amid cautious investor sentiment before the Fed's rate decision.",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-falls-for-4th-straight-day-ahead-of-fed-rate-decision/article70215805.ece",
    "timestamp": "2025-10-29T07:07:22Z"
  },
  {
    "title": "Tripura CM introduces WiFi facility in 11 government degree colleges",
    "description": "Tripura Chief Minister Manik Saha launched WiFi in 11 government colleges. This initiative now provides internet access to all general degree colleges in the state. Plans are in motion to extend this facility to polytechnic institutes. The government is also …",
    "link": "https://timesofindia.indiatimes.com/education/news/tripura-cm-introduces-wifi-facility-in-11-government-degree-colleges/articleshow/124892236.cms",
    "timestamp": "2025-10-29T07:07:16Z"
  },
  {
    "title": "Best Crypto to Buy as DeepSeek Bitcoin Price Prediction Reveals $190K Target",
    "description": "Quick Facts: 1️⃣ Bitcoin has found strong support at a major upward-sloping trendline that has sustained its rally since November 2022. 2️⃣ According to DeepSeek’s latest Bitcoin price prediction, the pattern mirrors past rallies and could propel $BTC toward …",
    "link": "https://bitcoinist.com/best-crypto-to-buy-as-deepseek-bitcoin-price-prediction-reveals-190k-target/",
    "timestamp": "2025-10-29T07:07:05Z"
  },
  {
    "title": "Trump gifted golden crown once worn by South Korean kings",
    "description": "US President Donald Trump may be facing protests back home calling for \"no kings\" in the United States, but in South Korea officials had the perfect gift for the monarch-loving magnate - a replica golden crown.",
    "link": "https://www.rte.ie/news/newslens/2025/1029/1541058-donald-trump-south-korea/",
    "timestamp": "2025-10-29T07:06:38Z"
  },
  {
    "title": "Fourteen years of us: Gautam and Natasha Gambhir celebrate a journey of love, laughter, and growth",
    "description": "Gautam Gambhir and Natasha are celebrating fourteen years of marriage, a journey marked by deep love and unwavering companionship. Natasha reflects on this milestone as a testament to their strong bond, shared laughter, and overcome challenges. Their enduring…",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/fourteen-years-of-us-gautam-and-natasha-gambhir-celebrate-a-journey-of-love-laughter-and-growth/articleshow/124892312.cms",
    "timestamp": "2025-10-29T07:06:00Z"
  },
  {
    "title": "Malaysia shines as diplomatic powerhouse with successful Asean Summit, says Fahmi",
    "description": "PUTRAJAYA: The successful hosting of the 47th Asean Summit and Related Summits has highlighted Malaysia as a major power in world diplomacy, with the attendance of world leaders from the United States, BRICS, the International Monetary Fund and the United Nat…",
    "link": "https://www.thestar.com.my/news/nation/2025/10/29/malaysia-shines-as-diplomatic-powerhouse-with-successful-asean-summit-says-fahmi",
    "timestamp": "2025-10-29T07:02:00Z"
  },
  {
    "title": "French Lawmakers Propose National Bitcoin Reserve Bill To Hold 2% Of BTC’s Supply",
    "description": "Lawmakers have reportedly introduced a comprehensive crypto bill proposal in the French Parliament that could establish a national Bitcoin (BTC) reserve and boost the industry’s adoption in the country. Related Reading: Bank Of Korea Calls For Bank-Issued Sta…",
    "link": "https://bitcoinist.com/french-lawmakers-bitcoin-reserve-bill-2-btc-supply/",
    "timestamp": "2025-10-29T07:00:47Z"
  },
  {
    "title": "Opinion: We need a lower speed limit now to make our towns safer for everyone",
    "description": "The government is dragging its feet on reducing the default speed limit in urban areas to 30 km/h, writes Councillor Feljin Jose.",
    "link": "https://www.thejournal.ie/readme/opinion-30kmh-speed-limit-ireland-urban-towns-6858037-Oct2025/",
    "timestamp": "2025-10-29T07:00:32Z"
  },
  {
    "title": "From demanding indictments to demolishing the East Wing, Trump is a TV producer",
    "description": "Inside Trump's communication playbook: from Truth Social posts to strategic news timing, how he floods the zone with storylines that keep media scrambling.",
    "link": "https://www.foxnews.com/media/demanding-indictments-demolishing-east-wing-trump-tv-producer",
    "timestamp": "2025-10-29T07:00:18Z"
  },
  {
    "title": "CNBC's The China Connection newsletter: Five things Beijing wants from a Trump-Xi meeting",
    "description": "What China asks of the U.S. this week can reveal the extent to which Beijing has assessed the transformation of its global clout.",
    "link": "https://www.cnbc.com/2025/10/29/china-connection-newsletter-what-beijing-wants-trump-xi-meeting-south-korea-apec-summit-gyeongju.html",
    "timestamp": "2025-10-29T07:00:01Z"
  },
  {
    "title": "Nigerian Nobel laureate Wole Soyinka says his US visa revoked",
    "description": "The 91-year-old Nobel laureate in literature has been a critic of Trump's immigration policy.",
    "link": "https://www.bbc.co.uk/news/articles/c24lzd32yjeo",
    "timestamp": "2025-10-29T06:58:14Z"
  },
  {
    "title": "Nigerian Nobel laureate Wole Soyinka says US revoked his visa",
    "description": "The 91-year-old Nobel laureate in literature has been a critic of Trump's immigration policy.",
    "link": "https://www.bbc.com/news/articles/c24lzd32yjeo",
    "timestamp": "2025-10-29T06:58:14Z"
  },
  {
    "title": "Nick Fuentes calls MAGA figures Marjorie Taylor Greene and Joe Kent ‘fake America First’ in Tucker Carlson YouTube interview",
    "description": "In a recent interview on Tucker Carlson’s YouTube channel, far-right activist Nick Fuentes criticized MAGA figures Marjorie Taylor Greene and Joe Kent as “fake America First.” Fuentes accused both of abandoning the nationalist foundation of President Donald T…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nick-fuentes-calls-maga-figures-marjorie-taylor-greene-and-joe-kent-fake-america-first-in-tucker-carlson-youtube-interview/articleshow/124892127.cms",
    "timestamp": "2025-10-29T06:57:26Z"
  },
  {
    "title": "Trump says he threatened 250% tariffs on ‘killer’ Modi, Pakistan",
    "description": "Trump has repeatedly referenced his role in the India-Pakistan conflict during his three-nation tour of Asia, adding additional flourishes with each retelling",
    "link": "https://www.bloomberg.com/news/articles/2025-10-29/trump-says-he-threatened-250-tariffs-on-killer-modi-pakistan",
    "timestamp": "2025-10-29T06:55:29Z"
  },
  {
    "title": "China Reportedly Resumes US Soybean Purchases Ahead Of Trump-Xi Meeting",
    "description": "China has reportedly made its first purchase of U.S. soybeans from this year’s harvest, ending a long-standing boycott ahead of the highly anticipated summit between President Donald Trump and Chinese President Xi Jinping.\nSoybean Prices At 15-Year High Amid …",
    "link": "https://biztoc.com/x/80fd60bab9dc0200",
    "timestamp": "2025-10-29T06:53:36Z"
  },
  {
    "title": "Trump says he threatened India and Pakistan with 250% tariffs",
    "description": "US President Donald Trump said he threatened India and Pakistan with a 250% tariff on trade to push them toward resolving their conflict earlier this year, Bloomberg reported. Speaking at the APEC summit in Gyeongju, Trump claimed he told both leaders that th…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-says-he-threatened-india-and-pakistan-with-250-tariffs/articleshow/124891990.cms",
    "timestamp": "2025-10-29T06:53:18Z"
  },
  {
    "title": "At least 50 killed in Israeli strikes on Gaza as Trump says 'nothing' will jeopardise ceasefire",
    "description": "The US President defended Benjamin Netanyahu’s ordered strikes, saying Israel “should hit back” after an Israeli soldier was killed.",
    "link": "https://www.thejournal.ie/gaza-at-least-50-killed-israeli-strikes-trump-ceasefire-6858790-Oct2025/",
    "timestamp": "2025-10-29T06:53:08Z"
  },
  {
    "title": "Trump says 'timing' didn't work out to meet North Korea's Kim",
    "description": "GYEONGJU: Donald Trump said on Wednesday (Oct 29) he was not able to arrange a meeting with North Korean leader Kim Jong Un during the US president's visit to the South, ending fierce spec",
    "link": "https://www.channelnewsasia.com/east-asia/trump-says-timing-didnt-work-out-meet-north-koreas-kim-5432086",
    "timestamp": "2025-10-29T06:51:00Z"
  },
  {
    "title": "Yamaha unveils Proto BEV e-superbike at Japan Mobility Show ‘25: Details",
    "description": "Yamaha has unveiled the Proto BEV, an all-electric sportbike concept, at the 2025 Japan Mobility Show. Drawing inspiration from its R-series, the track-focused design features sharp bodywork and aerodynamic fairings. While performance figures remain undisclos…",
    "link": "https://timesofindia.indiatimes.com/auto/electric-bikes/yamaha-unveils-proto-bev-e-superbike-at-japan-mobility-show-25-details/articleshow/124891933.cms",
    "timestamp": "2025-10-29T06:50:25Z"
  },
  {
    "title": "Trump touts South Korea, China deals on last Asia tour stop",
    "description": "GYEONGJU, South Korea (Reuters) -U. President Donald Trump began the final leg of his Asia trip in South Korea on Wednesday, optimistic about advancing an...",
    "link": "https://www.yahoo.com/news/articles/trump-touts-south-korea-china-065015321.html",
    "timestamp": "2025-10-29T06:50:15Z"
  },
  {
    "title": "IISc’s 80-hour rule sparks campus unrest: Students decry ‘oppressive’ policy; India’s work culture faces fresh scrutiny",
    "description": "A fierce debate has erupted at the Indian Institute of Science (IISc), Bengaluru, after its Department of Electronic Systems Engineering introduced a strict attendance and parking policy. According to media speculations, the rules mandate up to 80-hour workwe…",
    "link": "https://timesofindia.indiatimes.com/education/news/iiscs-80-hour-rule-sparks-campus-unrest-students-decry-oppressive-policy-indias-work-culture-faces-fresh-scrutiny/articleshow/124891773.cms",
    "timestamp": "2025-10-29T06:48:15Z"
  },
  {
    "title": "Israeli strikes kill 26 people in Gaza as Trump says ceasefire is not at risk",
    "description": "Binyamin Netanyahu ordered immediate ‘powerful attacks’ following killing of Israeli soldier",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/29/israeli-strikes-kill-26-people-in-gaza-as-trump-says-ceasefire-is-not-at-risk/",
    "timestamp": "2025-10-29T06:46:49Z"
  },
  {
    "title": "Trump’s charm offensive in Asia sends Nikkei 225 to record heights",
    "description": "Shares are mostly higher in Asia and Japan's benchmark Nikkei 225 index has surged more than 2% to another record",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-charm-offensive-asia-sends-nikkei-225-record-126966019",
    "timestamp": "2025-10-29T06:45:52Z"
  },
  {
    "title": "Carbon tax concessions for global oil giants spark environmentalist concerns",
    "description": "Environmentalists fear carbon tax concessions to global oil giants may undermine efforts to shift to cleaner energy. Conservation groups in Singapore are pushing for more transparency on the discounts given to polluters. Singapore is the only Southeast Asian …",
    "link": "https://apnews.com/article/singapore-carbon-tax-climate-emissions-30b307539062bd9f53a0a02ef6a3fddb",
    "timestamp": "2025-10-29T06:45:31Z"
  },
  {
    "title": "Why squirrels hide their food: The science behind their caching instinct",
    "description": "Autumn's arrival sees squirrels engaging in 'caching,' a sophisticated survival strategy. They meticulously hide thousands of nuts, seeds, and fungi in scattered stashes to ensure sustenance through winter's scarcity. This instinctive behaviour, driven by env…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/why-squirrels-hide-their-food-the-science-behind-their-caching-instinct/articleshow/124891650.cms",
    "timestamp": "2025-10-29T06:45:30Z"
  },
  {
    "title": "TN TRB Assistant Professor admit card 2025 released at trb.tn.gov.in: Direct link to download hall ticket here",
    "description": "The Tamil Nadu Teachers Recruitment Board (TN TRB) has released the Assistant Professor Hall Ticket 2025 under Advertisement No. 01/2025 at trb.tn.gov.in. The exam for 132 vacancies will be held from November 19 to 24, 2025, in Chennai. Candidates must downlo…",
    "link": "https://timesofindia.indiatimes.com/education/news/tn-trb-assistant-professor-admit-card-2025-released-at-trb-tn-gov-in-direct-link-to-download-hall-ticket-here/articleshow/124891729.cms",
    "timestamp": "2025-10-29T06:44:41Z"
  },
  {
    "title": "Trump Hints At Cutting Fentanyl Tariffs, Discussing 'Farmers' Ahead Of High-Stakes Xi Jinping Meeting",
    "description": "President Donald Trump signaled on Wednesday that he expects to lower fentanyl-linked tariffs on China, a potential major concession ahead of a high-stakes meeting with Chinese President Xi Jinping in South Korea this week.\nFentanyl Flow And Farmers On Agenda…",
    "link": "https://biztoc.com/x/53791fdcc131dc58",
    "timestamp": "2025-10-29T06:42:50Z"
  },
  {
    "title": "Judge intensifies oversight of agents in Trump's Chicago immigration crackdown",
    "description": "CHICAGO (Reuters) -A U.S. judge on Tuesday intensified her monitoring of President Donald Trump's immigration crackdown in Chicago, requiring a top official to appear daily in court and ordering his agency to detail the use of force by its agents including fi…",
    "link": "https://www.thestar.com.my/news/world/2025/10/29/judge-intensifies-oversight-of-agents-in-trump039s-chicago-immigration-crackdown",
    "timestamp": "2025-10-29T06:37:00Z"
  },
  {
    "title": "Trump lands in South Korea amid deadlocked trade talks over $350bn deal on tariffs",
    "description": "US president to be presented with replica royal gold crown before meeting his South Korean counterpart, Lee Jae Myung, but expectations of a breakthrough on tariffs are low\nDonald Trump landed in South Korea on Wednesday to meet President Lee Jae Myung, with …",
    "link": "https://biztoc.com/x/8bca48412afe2c95",
    "timestamp": "2025-10-29T06:31:54Z"
  },
  {
    "title": "Trump says he expects ‘great deal’ with China at summit with Xi",
    "description": "US and Chinese leaders are expected to sign a trade deal in their first meeting since 2019.",
    "link": "https://www.aljazeera.com/economy/2025/10/29/trump-says-he-expects-great-deal-with-china-at-summit-with-xi",
    "timestamp": "2025-10-29T06:31:44Z"
  },
  {
    "title": "Golden State Warriors vs Los Angeles Clippers (28/10/25) - Key moments, highlights more",
    "description": "The Golden State Warriors showcased a powerful performance against the Los Angeles Clippers. A strong defensive effort in the second half stifled the Clippers' offense. Stephen Curry orchestrated plays while Jimmy Butler made a significant impact. The Warrior…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/golden-state-warriors-vs-los-angeles-clippers-28/10/25-key-moments-highlights-more/articleshow/124891471.cms",
    "timestamp": "2025-10-29T06:30:24Z"
  },
  {
    "title": "Bigg Boss Kannada 12: Has Mallamma quit the reality show?",
    "description": "Bigg Boss Kannada Season 12 is abuzz with speculation. Contestant Mallamma may have left the house midway. Unconfirmed reports suggest a family emergency prompted her departure. No official statement has been released. Mallamma, known for her simplicity, repr…",
    "link": "https://timesofindia.indiatimes.com/tv/news/kannada/bigg-boss-kannada-12-has-mallamma-quit-the-reality-show/articleshow/124891379.cms",
    "timestamp": "2025-10-29T06:29:11Z"
  },
  {
    "title": "Mysterious object spotted during Trump’s Japan visit? Viral clip brings speculation and debate over UFO, drones and airplanes",
    "description": "A strange object with flashing lights was reportedly captured on a FOX News live broadcast as Donald Trump arrived in Tokyo. The footage, shared online, sparked speculation of UFOs. Some viewers suggested it was a plane or building lights. No official confirm…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-tokyo-arrival-footage-prompts-social-media-speculation-over-strange-lights/articleshow/124891225.cms",
    "timestamp": "2025-10-29T06:28:33Z"
  }
]