[
  {
    "title": "Tim Ryan: Kathy Hochul's Balanced and All of the Above Energy Approach Can Be a Blueprint for Democrats | Opinion",
    "description": "By continuing to move toward a balanced energy policy that includes natural gas, Governor Kathy Hochul can define what Democratic leadership looks like in a second Trump term.",
    "link": "https://www.newsweek.com/tim-ryan-kathy-hochuls-balanced-all-above-energy-approach-can-blueprint-democrats-opinion-2093240",
    "timestamp": "2025-07-03T10:00:01Z"
  },
  {
    "title": "“You are not allowed to come to my shows”: Band says anyone who voted for Trump not welcome at their concerts—then immediately backtracks",
    "description": "President Donald Trump may have notched a popular vote win, but he’s getting zero love from The Red Jumpsuit Apparatus.\n\n\nLead singer Ronnie Winter ignited controversy after posting a fiery video to Instagram on June 14, directly calling out Trump supporters—…",
    "link": "https://www.dailydot.com/viral-politics/red-jumpsuit-apparatus-trump-supporters/",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "The megabill's war on the poor is built on a decades-old lie",
    "description": "Ronald Reagan convinced Republican voters that the \"welfare queen\" was ripping them off. Now they are going to pay the price.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/republican-megabill-social-programs-cuts-rcna216560",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "The Senate's megabill has these House Republicans ready to revolt",
    "description": "House Republicans delayed voting on HR 566, aka Trump's big beautiful bill, in part because of conservatives mad  the cost and that Medicaid isn't cut more",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/house-big-beautiful-bill-vote-freedom-caucus-rcna215966",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "Trump's children will not be affected by his birthright citizenship executive order",
    "description": "U.S. President Donald Trump's proposal to end birthright citizenship for children born to immigrants in the country illegally and people on temporary status would have resulted in four of his five children being deported, as they were born to immigrant mother…",
    "link": "https://www.snopes.com//fact-check/trump-birthright-citizenship-order-children/",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "Has MAGA Killed Satire?",
    "description": "In June, Florida Governor Ron DeSantis announced plans to build an immigrant detention center on an unused airstrip in the Everglades. “There’s not much waiting for them except alligators and pythons,” Florida Attorney General James Uthmeier said in a video o…",
    "link": "https://www.motherjones.com/politics/2025/07/carl-hiaasen-fever-beach-has-maga-killed-satire/",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "Antitrust enforcer Gail Slater on American innovation: ‘We can win the AI race against the Chinese without becoming like China’",
    "description": "“It's about enforcing antitrust robustly in a way that works for all Americans … that’s my starting point,” the head of the Department of Justice Antitrust Division told NYNext.",
    "link": "https://nypost.com/2025/07/03/business/doj-antitrust-chief-is-betting-american-tech-will-beat-china/",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "The Oligarchs’ Big Prize in Trump’s Budget-Busting Bill",
    "description": "If America is a ruled by a billionaire oligarchy, as I argued in a recent New Republic feature story (“How the Billionaires Took Over”), what will our billionaire overlords get out of the “big, beautiful” budget reconciliation bill that narrowly cleared the S…",
    "link": "https://newrepublic.com/article/197563/trump-budget-bill-big-prize-rich-oligarchs",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "Fact Check: Trump's children will not be affected by his birthright citizenship executive order",
    "description": "Four of the U.S. president's five children were born to immigrant mothers.",
    "link": "https://www.snopes.com/fact-check/trump-birthright-citizenship-order-children/",
    "timestamp": "2025-07-03T10:00:00Z"
  },
  {
    "title": "Kilmar Abrego Garcia says he was beaten, subjected to psychological torture",
    "description": "Kilmar Abrego Garcia said he suffered severe beatings, severe sleep deprivation and psychological torture in the notorious El Salvador prison.",
    "link": "https://www.newschannel5.com/news/kilmar-abrego-garcia-says-he-was-beaten-and-subjected-to-psychological-torture-in-el-salvador-jail",
    "timestamp": "2025-07-03T09:55:42Z"
  },
  {
    "title": "Trump's big spending bill heads to final vote in US House - BBC",
    "description": "Trump's big spending bill heads to final vote in US HouseBBC House advances Trump's \"big, beautiful bill\" for debate before final voteCBS News Trump’s megabill advances in the House after GOP divisions nearly derail itCNBC Republican voters on Trump’s sweepin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178268806",
    "timestamp": "2025-07-03T09:55:23Z"
  },
  {
    "title": "How Europe dropped the ball on its own defence and was left fawning over Donald Trump – podcast",
    "description": "The Conversation Weekly podcast explores what options the EU has now to bolster its defence capabilities.",
    "link": "https://theconversation.com/how-europe-dropped-the-ball-on-its-own-defence-and-was-left-fawning-over-donald-trump-podcast-260152",
    "timestamp": "2025-07-03T09:50:18Z"
  },
  {
    "title": "Vast majority of large U.S. fentanyl seizures happen along Mexican border, report finds",
    "description": "Almost all large seizures of illicit fentanyl in the United States occur along the southern border with Mexico, according to a new report that casts more doubt on the White House’s claim that the drug is “pouring” into the U.S. from Canada.\nU.S. President Don…",
    "link": "https://biztoc.com/x/01f372522ac2092d",
    "timestamp": "2025-07-03T09:47:19Z"
  },
  {
    "title": "Fact-checking three key claims about Trump's mega-bill",
    "description": "Trump insists that the new bill will save the US billions, but it has been criticised by his old ally Elon Musk.",
    "link": "https://www.bbc.com/news/articles/c20r6vm0xl3o",
    "timestamp": "2025-07-03T09:45:36Z"
  },
  {
    "title": "Ukraine Claims All US Weapon Supplies Halted - Reports",
    "description": "MOSCOW (Sputnik) - Ukraine has stopped receiving any military supplies from the US, including shells and spare parts, the Economist has reported, citing Ukrainian officials.",
    "link": "https://sputnikglobe.com/20250703/ukraine-claims-all-us-weapon-supplies-halted---reports-1122388535.html",
    "timestamp": "2025-07-03T09:40:47Z"
  },
  {
    "title": "I Attended the Show Where People Reenact Jan. 6. It Played Out Very Differently.",
    "description": "At the beginning, players were laughing. I was asked to chug a beer. Then the mood turned.",
    "link": "https://slate.com/culture/2025/07/trump-jan-6-capitol-insurrection-play-game-london.html",
    "timestamp": "2025-07-03T09:40:00Z"
  },
  {
    "title": "Meta boss Mark Zuckerberg ‘asked to leave’ Oval Office meeting? Know what was Trump discussing with officials",
    "description": "Was Meta boss Mark Zuckerberg asked to leave Oval Office meeting when he went to meet US President Donald Trump? According to reports, military leaders were shocked when Zuckerberg crashed into the Oval Office during a discussion on the Air Force's next-gener…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-meta-boss-mark-zuckerberg-asked-to-leave-oval-office-meeting-know-what-was-trump-discussing-with-officials/articleshow/122224897.cms",
    "timestamp": "2025-07-03T09:39:48Z"
  },
  {
    "title": "Supreme Court could release more on high-profile cases from its 'cleanup conference'",
    "description": "There could be more news out of the Supreme Court on Thursday when the justices release orders and dispositions from its last in-person gathering before summer recess.",
    "link": "https://abcnews.go.com/Politics/supreme-court-release-high-profile-cases-cleanup-conference/story?id=123429019",
    "timestamp": "2025-07-03T09:38:17Z"
  },
  {
    "title": "Live updates: Trump’s ‘big, beautiful bill’ awaits House vote | CNN Politics",
    "description": "The deeply divided House is moving to take up President Donald Trump’s sweeping tax and spending cuts package after a group of Republican holdouts reversed course and agreed to allow the bill to come to the floor, putting it on track for final passage. Follow…",
    "link": "https://www.cnn.com/politics/live-news/trump-big-beautiful-bill-house-vote-07-03-25",
    "timestamp": "2025-07-03T09:33:46Z"
  },
  {
    "title": "Here’s who stands to gain from the ‘big, beautiful bill.’ And who may struggle | CNN Business",
    "description": "President Donald Trump has promised that the “big, beautiful bill” passed by the Senate and being considered by the House of Representatives will be one of the most successful pieces of legislation in American history.",
    "link": "https://www.cnn.com/2025/07/03/business/trump-big-beautiful-bill-business-economy",
    "timestamp": "2025-07-03T09:30:24Z"
  },
  {
    "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
    "description": "House Republicans are ready to finish up President Donald Trump's $4.5 trillion tax breaks bill now that the House Democratic leader Hakeem Jeffries is wrapping up his marathon speech.",
    "link": "https://www.news4jax.com/news/politics/2025/07/03/house-gop-clears-key-hurdle-on-trumps-big-bill-pushing-it-closer-to-vote/",
    "timestamp": "2025-07-03T09:29:19Z"
  },
  {
    "title": "Hiring expected to have slowed in June amid Trump's tariffs",
    "description": "The economy has remained sturdy in recent months, defying fears of a downturn.",
    "link": "https://abcnews.go.com/Business/hiring-expected-slowed-june-amid-trumps-tariffs/story?id=123407305",
    "timestamp": "2025-07-03T09:25:59Z"
  },
  {
    "title": "Denmark launches its EU presidency facing war in Ukraine and Trump tariff chaos",
    "description": "Denmark is launching its presidency of the European Union with a ceremony on Thursday in the western city of Aarhus",
    "link": "https://abcnews.go.com/International/wireStory/denmark-launches-eu-presidency-facing-war-ukraine-trump-123440546",
    "timestamp": "2025-07-03T09:25:46Z"
  },
  {
    "title": "Capitol agenda: Mike Johnson on the cusp of megabill victory",
    "description": "Speaker Mike Johnson is potentially just a couple of hours away from sending Donald Trump his “big, beautiful bill,” defying expectations that he could meet the president’s arbitrary but unwavering deadline. \nAfter it appeared to be derailed late Wednesday by…",
    "link": "https://biztoc.com/x/3656d7c1b42a0a76",
    "timestamp": "2025-07-03T09:25:42Z"
  },
  {
    "title": "Trump administration says some of the $6 billion education grants it withheld were funding ‘a radical leftwing agenda’",
    "description": "The freeze sent schools and summer camp providers scrambling to determine whether they can still provide programs like day camps this summer or after-hours child care this fall.",
    "link": "https://fortune.com/2025/07/03/trump-6-billion-education-grants-withheld-radical-leftwing-agenda/",
    "timestamp": "2025-07-03T09:21:28Z"
  },
  {
    "title": "Republicans advance Trump tax-cut Bill, opening way for debate",
    "description": "Legislation’s deep healthcare cuts and implications for national debt has worried members of US president’s party",
    "link": "https://www.irishtimes.com/world/us/2025/07/03/republicans-advance-trump-tax-cut-bill-opening-way-for-debate/",
    "timestamp": "2025-07-03T09:20:22Z"
  },
  {
    "title": "'Dangerous' US Halt to Ukraine Aid Could See Russian Battlefield Gains",
    "description": "The White House said the decision to halt some weapons deliveries to Kyiv was made \"to put America's interests first.\"",
    "link": "https://www.newsweek.com/russia-ukraine-2094046",
    "timestamp": "2025-07-03T09:18:01Z"
  },
  {
    "title": "Japan plans 'world first' deep-sea mineral extraction",
    "description": "Japan will initiate a deep-sea trial in January to extract rare earth minerals from the ocean floor at a depth of 5,500 meters, marking the world's deepest attempt. This move aligns with Japan's efforts to secure a stable supply of critical minerals, amid con…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/japan-plans-world-first-deep-sea-mineral-extraction/articleshow/122224458.cms",
    "timestamp": "2025-07-03T09:16:04Z"
  },
  {
    "title": "Trump calls on Fed chair Powell quit ‘immediately’",
    "description": "Donald Trump said late on July 2 that Federal Reserve Chairman Jerome Powell “should resign immediately.”",
    "link": "https://www.hurriyetdailynews.com/trump-calls-on-fed-chair-powell-quit-immediately-211034",
    "timestamp": "2025-07-03T09:12:29Z"
  },
  {
    "title": "Indonesia Says $34 Billion in Trade, Investment MOU With US in Pipeline",
    "description": "The US and Indonesia will sign trade and investment pacts worth $34 billion as part of efforts to secure a deal on tariffs ahead of a July 9 deadline.",
    "link": "https://financialpost.com/pmn/business-pmn/indonesia-says-34-billion-in-trade-investment-mou-with-us-in-pipeline",
    "timestamp": "2025-07-03T09:12:18Z"
  },
  {
    "title": "US bill would let Trump send B‑2 bombers and bunker busters to Israel if Iran's nuclear threat persists",
    "description": "A bipartisan bill would authorize President Donald Trump to transfer US B‑2 stealth bombers and 30,000‑pound bunker‑buster bombs to Israel if Iran continues nuclear development. The move comes amid IAEA warnings of possible uranium enrichment resurgence, foll…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-bill-would-let-trump-send-b2-bombers-and-bunker-busters-to-israel-if-irans-nuclear-threat-persists/articleshow/122224301.cms",
    "timestamp": "2025-07-03T09:08:14Z"
  },
  {
    "title": "‘MAHA Report’ calls for fighting chronic disease, but Trump and Kennedy have yanked funding",
    "description": "There are many disconnects between what the Trump administration says about health and what it’s actually doing, scientists and public health advocates say.",
    "link": "https://www.inquirer.com/health/maha-report-chronic-disease-funding-20250703.html",
    "timestamp": "2025-07-03T09:06:12Z"
  },
  {
    "title": "Japan Plans 'World First' Deep-sea Mineral Extraction",
    "description": "Japan will from January attempt to extract rare earth minerals from the ocean floor in the deepest trial of its kind, the director of a government innovation programme said Thursday.",
    "link": "https://www.ibtimes.com/japan-plans-world-first-deep-sea-mineral-extraction-3777537",
    "timestamp": "2025-07-03T09:06:06Z"
  },
  {
    "title": "Trump says Federal Reserve chair Jerome Powell should ‘resign immediately’",
    "description": "President has repeatedly called for interest rate cuts which Fed has resisted",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/07/02/us/politics/trump-jerome-powell-fed.html",
    "timestamp": "2025-07-03T09:05:04Z"
  },
  {
    "title": "Trump's 'big beautiful bill' and other cuts put 139,000 Pa. jobs at risk",
    "description": "Workers have been grappling with uncertainty since President Donald Trump took office. Here's how potential cuts to SNAP, Medicaid, and other programs could impact Pennsylvania's workforce.",
    "link": "https://www.inquirer.com/business/a/big-beautiful-bill-spending-pennsylvania-job-cut-20250703.html",
    "timestamp": "2025-07-03T09:04:42Z"
  },
  {
    "title": "Is Today’s Market Exuberance Rational?",
    "description": "With the United States ushering in a new era of zero-sum trade warfare, the broader world economy is being reshaped before our eyes. Yet despite obvious risks to growth and price stability, US stock indices are behaving as if everything was just fine.",
    "link": "https://www.project-syndicate.org/commentary/us-stock-markets-ignoring-financial-economic-trade-risks-by-herve-goulletquer-2-2025-07",
    "timestamp": "2025-07-03T09:04:19Z"
  },
  {
    "title": "Donald Trump's Approval Rating Surges Among Black Voters",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is seeing a notable surge in support among Black voters, according to a new poll.\nThe latest Quantus Insights poll, conducted June 23-25 among 1,000 registered voters, shows Trump's appr…",
    "link": "https://biztoc.com/x/a775d6c8e4e0a586",
    "timestamp": "2025-07-03T09:03:17Z"
  },
  {
    "title": "The curious case of iPhones: Why a small gadget in your pocket is making the US and China uneasy about India",
    "description": "Apple’s expanding iPhone production in India is making bigger economies uneasy. China sees its decades-long grip on high-tech manufacturing slipping, while the US worries about losing leverage to bring jobs home. As Foxconn's earlier plans to build a $1.5 bil…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/the-curious-case-of-iphones-why-a-small-gadget-in-your-pocket-is-making-us-china-insecure-about-india/articleshow/122223086.cms",
    "timestamp": "2025-07-03T09:02:00Z"
  },
  {
    "title": "MORNING GLORY: Will the House Freedom Caucus desert President Trump and trigger a massive tax hike?",
    "description": "The fate of Trump's economic agenda hangs on the 'One Big Beautiful Bill' vote, as Republican opposition could trigger massive tax hikes in 2026 and undermine military readiness.",
    "link": "https://www.foxnews.com/opinion/morning-glory-house-freedom-caucus-desert-president-trump-trigger-massive-tax-hike",
    "timestamp": "2025-07-03T09:00:51Z"
  },
  {
    "title": "Elon Musk’s Third Party Is Pure Fantasy",
    "description": "Musk’s latest political idea has little chance of success. But fringe figures from Andrew Yang to the Libertarians are eager to take his money.",
    "link": "http://nymag.com/intelligencer/article/elon-musks-third-party-is-pure-fantasy.html",
    "timestamp": "2025-07-03T09:00:39Z"
  },
  {
    "title": "The US economy added a stronger-than-expected 147,000 jobs in June and the unemployment rate fell to 4.1% | CNN Business",
    "description": "The US job market continues to chug along, despite heightened uncertainty about the economy and how President Donald Trump’s tariffs could shake out.",
    "link": "https://www.cnn.com/2025/07/03/economy/us-jobs-report-june-final",
    "timestamp": "2025-07-03T09:00:26Z"
  },
  {
    "title": "Province touts positive fiscal numbers for N.B., but economist urges caution",
    "description": "While a report on the New Brunswick economy is showing largely positive numbers, one economist warns the financial winds may have already shifted.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/province-positive-numbers-economy-2024-1.7575620",
    "timestamp": "2025-07-03T09:00:24Z"
  },
  {
    "title": "CBS staffers revolt over Paramount's 'shameful' Trump settlement, 'betrayal' to the network's journalists",
    "description": "CBS News staffers are outraged by parent company Paramount's decision this week to settle President Donald Trump's lawsuit which they thought was meritless.",
    "link": "https://www.foxnews.com/media/cbs-staffers-revolt-over-paramounts-shameful-trump-settlement-betrayal-networks-journalists",
    "timestamp": "2025-07-03T09:00:16Z"
  },
  {
    "title": "Deja Foxx: We're Not Supposed to Win. That's Why We Have To | Opinion",
    "description": "Whether the establishment is ready or not, we're here. And we're proving a different way of doing politics isn't just possible—it's necessary.",
    "link": "https://www.newsweek.com/deja-foxx-were-not-supposed-win-thats-why-we-have-opinion-2093814",
    "timestamp": "2025-07-03T09:00:02Z"
  },
  {
    "title": "The Teen Mom is Dying Out",
    "description": "Teen births have declined dramatically over the past several decades.",
    "link": "https://www.newsweek.com/teen-mom-dying-out-birth-rate-decline-2091816",
    "timestamp": "2025-07-03T09:00:01Z"
  },
  {
    "title": "Is Trump's America Living up to Its Founding Ideals? Newsweek Contributors Debate",
    "description": "On Friday, July 4, the United States celebrates Independence Day, the 249th anniversary of the signing of the Declaration of Independence.",
    "link": "https://www.newsweek.com/trumps-america-living-its-founding-ideals-newsweek-contributors-debate-2093304",
    "timestamp": "2025-07-03T09:00:01Z"
  },
  {
    "title": "Donald Trump's Approval Rating Surges Among Black Voters",
    "description": "Trump's approval ratings are trending down, with several recent polls showing the president's approval rating at an all-time low.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-black-voters-2091710",
    "timestamp": "2025-07-03T09:00:01Z"
  },
  {
    "title": "GOP governors stay silent amid plans to slash Medicaid spending in their states",
    "description": "In 2017, when President Trump tried to repeal Obamacare and roll back Medicaid coverage, Republican governors rallied against it. Now, as Trump tries again to scale back Medicaid, they've gone quiet.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/07/03/nx-s1-5455058/gop-governors-medicaid-cuts-trump-tax-bill",
    "timestamp": "2025-07-03T09:00:00Z"
  },
  {
    "title": "Trump’s Threat to Jail Foes Darkens, Prompting Epic Retort from Zohran",
    "description": "This week, President Donald Trump issued many angry threats against Zohran Mamdani, the underdog winner of New York Democratic mayoral primary. Trump has been attacking Mamdani, a state assemblyman, as a “Communist,”  threatening to arrest him along with othe…",
    "link": "https://newrepublic.com/article/197565/trump-threat-jail-foes-darkens-prompting-epic-retort-zohran",
    "timestamp": "2025-07-03T09:00:00Z"
  },
  {
    "title": "Trump’s Bombing Iran and Its Nuclear Sites: The Continued Constitutional Fallout",
    "description": "The lack of political resistance to Trump’s unilateral move against Iranian targets underscores the weakness of the Constitution’s checks and balances concerning war. \nThe post Trump’s Bombing Iran and Its Nuclear Sites: The Continued Constitutional Fallout a…",
    "link": "http://washingtonmonthly.com/2025/07/03/trumps-bombing-iran-and-its-nuclear-sites-the-continued-constitutional-fallout/",
    "timestamp": "2025-07-03T09:00:00Z"
  },
  {
    "title": "U.S. job growth expected to have slowed in June as economy sends mixed signals",
    "description": "The U.S. economy continues to send mixed signals.",
    "link": "https://www.nbcnews.com/business/economy/june-2025-jobs-report-what-to-know-unemployment-rate-economy-right-now-rcna216599",
    "timestamp": "2025-07-03T09:00:00Z"
  },
  {
    "title": "GOP Governors Mum as Congress Prepares To Slash Medicaid Spending for Their States",
    "description": "In 2017, when President Donald Trump tried to repeal Obamacare and roll back Medicaid coverage, Republican governors helped turn Congress against it. Now, as Trump tries again to scale back Medicaid, Republican governors — whose constituents stand to lose fed…",
    "link": "https://kffhealthnews.org/news/article/big-beautiful-bill-trump-medicaid-affordable-care-act-cuts-republican-gop-governors/",
    "timestamp": "2025-07-03T09:00:00Z"
  },
  {
    "title": "Trump's Tariffs Explained as the 90-Day Pause Set to End Next Week",
    "description": "Trump has suggested that there won't be another delay in the heaviest of his tariffs once the 90-day pause ends on July 9.",
    "link": "https://www.cnet.com/personal-finance/trumps-tariffs-explained-as-the-90-day-pause-set-to-end-next-week/",
    "timestamp": "2025-07-03T09:00:00Z"
  },
  {
    "title": "Trump administration funding freeze could impact Roanoke region's after-school programs",
    "description": "The Trump administration is withholding more than $6 billion in federal education grants, which could have impacts on local programs.",
    "link": "https://roanoke.com/news/local/education/k-12/article_0520ce18-47a7-4d2d-ae52-1d4a8c761fde.html",
    "timestamp": "2025-07-03T09:00:00Z"
  },
  {
    "title": "5 Book Reviews You Need to Read This Week",
    "description": "Our grab bag of gorgeous reviews this week includes Robert Rubsam on Donald Niedekker’s Strange and Perfect Account From the Permafrost, Nina Allan on Catherine Lacey’s The Möbius Book, Carolina A. Miranda on Greg Grandin’s America, América, Crispin Long on A…",
    "link": "https://lithub.com/5-book-reviews-you-need-to-read-this-week-7-3-2025/",
    "timestamp": "2025-07-03T08:58:36Z"
  },
  {
    "title": "US-Vietnam Trade Deal for 20 Percent Tariff Raises Some Big Questions - WWD",
    "description": "US-Vietnam Trade Deal for 20 Percent Tariff Raises Some Big QuestionsWWD Trump says U.S. struck trade deal with Vietnam that imposes 20% tariff on its importsCNBC China hits out at Donald Trump’s trade deal with VietnamFinancial Times Stock market today: S&P …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178268486",
    "timestamp": "2025-07-03T08:54:30Z"
  },
  {
    "title": "Vietnam steals a march and leaves Japan in a tough spot on U.S. tariffs",
    "description": "A tariff deal negotiated between the United States and Vietnam has set a high bar for Japan, which has made no concrete progress over 11 weeks of intense trade talks with Washington and has earned itself the ire of U.S. President Donald Trump in the process.\n…",
    "link": "https://biztoc.com/x/47ff7db7f5472420",
    "timestamp": "2025-07-03T08:52:15Z"
  },
  {
    "title": "Vietnam steals a march and leaves Japan in a tough spot on U.S. tariffs",
    "description": "The deal sets a high bar for Japan and other countries still negotiating with the United States.",
    "link": "https://www.japantimes.co.jp/business/2025/07/03/economy/vietnam-japan-tariff/",
    "timestamp": "2025-07-03T08:48:00Z"
  },
  {
    "title": "US Aid cuts could cause over 14 million deaths by 2030, study warns",
    "description": "NEW YORK: More than 14 million lives, including over 4.5 million children, could be lost by 2030 due to sweeping US foreign aid cuts under President Donald Trump, according to a new study published in The Lancet. The research, conducted by an international te…",
    "link": "https://english.khabarhub.com/2025/03/482721/",
    "timestamp": "2025-07-03T08:45:42Z"
  },
  {
    "title": "Trump’s tax bill could be a major win for Big Ag. Everyone else? Not so much.",
    "description": "The bill is a bailout for commodity growers and leaves small farmers — and US consumers — out to dry.",
    "link": "http://grist.org/food-and-agriculture/trump-tax-bill-win-for-big-ag-everyone-else-not-so-much/",
    "timestamp": "2025-07-03T08:45:00Z"
  },
  {
    "title": "Hiroshima mayor scolds Trump",
    "description": "Hiroshima Mayor Kazumi Matsui has criticized President Donald Trump’s comments likening strikes on Iran to the 1945 atomic bombing of Japan Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620923-hiroshima-mayor-trump-remarks/",
    "timestamp": "2025-07-03T08:40:58Z"
  },
  {
    "title": "Robust Nuclear Earth Penetrator: Will Trump revive America's Armageddon program to target Iran's Fordow, Natanz facilities again?",
    "description": "With Iran's nuclear facilities proving resilient despite conventional bunker buster attacks, the US might consider reviving the Robust Nuclear Earth Penetrator (RNEP) project. This controversial option, designed to destroy deeply buried targets, faces signifi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/robust-nuclear-earth-penetrator-will-trump-revive-americas-armageddon-program-to-target-irans-fordow-natanz-facilities-again/articleshow/122223275.cms",
    "timestamp": "2025-07-03T08:39:57Z"
  },
  {
    "title": "TikTok layoffs: TikTok Shop, the video app's US e-commerce division, has cut jobs for third time since April",
    "description": "TikTok is laying off more employees from its US e-commerce division, TikTok Shop, marking the third round of cuts since April. The company is adjusting its team to align with strategic priorities amid challenges in meeting sales targets, it said.",
    "link": "https://www.livemint.com/companies/news/tiktok-layoff-tiktok-shop-video-app-us-e-commerce-division-has-cut-more-jobs-third-time-since-april-bytedance-china-news-11751516272405.html",
    "timestamp": "2025-07-03T08:37:10Z"
  },
  {
    "title": "China warns against trade deals that 'hurt' others after Vietnam-US pact",
    "description": "BEIJING: China warned on Thursday (Jul 3) against trade deals that \"hurt third parties\" after US President Donald Trump said he had struck an agreement with Vietnam. \"China has always advocated that all parties resolve economic and trade differences through e…",
    "link": "https://www.channelnewsasia.com/east-asia/china-warns-trade-deals-hurt-others-vietnam-us-trump-tariff-5218221",
    "timestamp": "2025-07-03T08:36:12Z"
  },
  {
    "title": "Democrats should ‘break up’ with Randi Weingarten, ex-Harris campaign aide argues",
    "description": "The Democratic Party should \"break-up\" with American Federation of Teachers (AFT) president Randi Weingarten, ex-Kamala Harris campaign aide Ben Austin wrote in an opinion piece on Monday.",
    "link": "https://nypost.com/2025/07/03/us-news/democrats-should-break-up-with-teacher-union-president-randi-weingarten-ex-harris-aide-argues/",
    "timestamp": "2025-07-03T08:34:05Z"
  },
  {
    "title": "Biden Casually Drops Bombshell About Who’s Still Seeking His Advice, And Trump Will Hate It",
    "description": "The former president’s claim will more than likely irk current President Donald Trump.",
    "link": "https://www.huffpost.com/entry/joe-biden-advice-after-office_n_686631dde4b0d0f8dccc7e7d",
    "timestamp": "2025-07-03T08:32:56Z"
  },
  {
    "title": "DOJ recovers $40K crypto from Trump-Vance inaugural scam, credits Tether",
    "description": "Federal prosecutors have traced and seized $40,000 in crypto from scammers posing as Trump-Vance Inaugural Committee officials.",
    "link": "https://cointelegraph.com/news/doj-recovers-40k-crypto-trump-vance-inaugural-scam-tether",
    "timestamp": "2025-07-03T08:31:21Z"
  },
  {
    "title": "How Trump wants to narrow a major student-loan forgiveness program that millions of borrowers rely on",
    "description": "President Donald Trump's administration is seeking to narrow the Public Service Loan Forgiveness program.\nJoe Raedle/Getty Images\nTrump proposed changes to the popular Public Service Loan Forgiveness program.\nNegotiators met to discuss the proposal for new li…",
    "link": "https://biztoc.com/x/ce8df8af8f9b7d3a",
    "timestamp": "2025-07-03T08:29:26Z"
  },
  {
    "title": "House GOP can’t pass Trump’s tax bill as holdouts on center and far-right push back in late-night session",
    "description": "The idea of quickly convening to for a vote on the more than 800-page bill was a risky gambit, one designed to meet Trump's demand for a holiday finish.",
    "link": "https://fortune.com/2025/07/03/house-gop-no-pass-trump-tax-bill-holdouts-center-far-right-push-back/",
    "timestamp": "2025-07-03T08:28:33Z"
  },
  {
    "title": "How Trump wants to narrow a major student-loan forgiveness program that millions of borrowers rely on",
    "description": "The Department of Education completed negotiation sessions with stakeholders on carrying out Trump's order to limit Public Service Loan Forgiveness.",
    "link": "https://www.businessinsider.com/trump-changes-pslf-student-loan-forgiveness-employer-eligibility-2025-7",
    "timestamp": "2025-07-03T08:26:01Z"
  },
  {
    "title": "Details of the US-China trade agreement remain unclear, with no consensus on rare earths and chip controls",
    "description": "On June 26, 2025, US President Donald Trump announced that the US had signed a trade agreement with China on June 25, which was also confirmed by China's Ministry of Commerce. From the talks in Geneva on May 11 to negotiations in London on June 10, followed b…",
    "link": "https://www.digitimes.com/news/a20250701PD208/us-china-trade-war-donald-trump-rare-earth-tariffs-2025.html",
    "timestamp": "2025-07-03T08:25:54Z"
  },
  {
    "title": "Dr. Phil’s year-old cable network files for bankruptcy, accusing broadcast partner of reneging on obligations",
    "description": "The lawsuit, filed by Fort Worth-based Merit Street with the US Bankruptcy Court in the Northern District of Texas, claims that TBN, the network’s broadcast partner, backed out of its",
    "link": "https://www.kake.com/news/entertainment/dr-phil-s-year-old-cable-network-files-for-bankruptcy-accusing-broadcast-partner-of-reneging/article_6fa7a4f1-8563-5b6f-a01a-9e1b004a87db.html",
    "timestamp": "2025-07-03T08:18:59Z"
  },
  {
    "title": "Jan 6 defendant sentenced to life in prison for plotting to kill FBI special agents who investigated him",
    "description": "Edward Kelley, a former U.S. Marine who was pardoned by President Trump, created a ‘kill list’ including 36 federal agents, prosecutors say",
    "link": "https://www.the-independent.com/news/world/americas/crime/jan-6-prison-sentence-fbi-plot-trump-b2781706.html",
    "timestamp": "2025-07-03T08:17:48Z"
  },
  {
    "title": "Donald Trump's Approval Rating Underwater Across Multiple Polls",
    "description": "Newsweek's tracking poll shows his net approval at –6 points, with 45 percent approving and 51 percent disapproving.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2094028",
    "timestamp": "2025-07-03T08:16:05Z"
  },
  {
    "title": "How the U.S.-China trade war could leave skies dark on the Fourth of July",
    "description": "LIUYANG, China — There are few sights more dazzling than fireworks on the Fourth of July.",
    "link": "https://www.nbcnews.com/world/china/us-china-trade-war-leave-skies-dark-fourth-july-rcna214437",
    "timestamp": "2025-07-03T08:14:33Z"
  },
  {
    "title": "Afghan refugees stuck in Pakistan as Germany halts entry programme",
    "description": "BERLIN/ISLAMABAD (Reuters) -In a cramped guesthouse in Pakistan's capital, 25-year-old Kimia spends her days sketching women — dancing, playing, resisting —in a notebook that holds what's left of her hopes. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/03/afghan-refugees-stuck-in-pakistan-as-germany-halts-entry-programme",
    "timestamp": "2025-07-03T08:12:00Z"
  },
  {
    "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
    "description": "House Republicans have propelled President Donald Trump’s multitrillion-dollar tax breaks and spending cuts bill to final congressional passage.",
    "link": "https://www.ksat.com/news/politics/2025/07/03/house-gop-clears-key-hurdle-on-trumps-big-bill-pushing-it-closer-to-vote/",
    "timestamp": "2025-07-03T08:08:25Z"
  },
  {
    "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
    "description": "House Republicans have propelled President Donald Trump’s multitrillion-dollar tax breaks and spending cuts bill to final congressional passage.",
    "link": "https://www.local10.com/news/politics/2025/07/03/house-gop-clears-key-hurdle-on-trumps-big-bill-pushing-it-closer-to-vote/",
    "timestamp": "2025-07-03T08:08:17Z"
  },
  {
    "title": "How a GOP rift over tech regulation doomed a ban on state AI laws in Trump's tax bill",
    "description": "Conservatives passionate about getting rid of the provision had spent weeks fighting others in the party who favored the legislative moratorium because they saw it as essential for the country to compete against China in the race for AI dominance. The schism …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/how-a-gop-rift-over-tech-regulation-doomed-a-ban-on-state-ai-laws-in-trumps-tax-bill/articleshow/122223139.cms",
    "timestamp": "2025-07-03T08:07:55Z"
  },
  {
    "title": "Trump Tax Bill Clears House Procedural Vote",
    "description": "US President Donald Trump's massive tax and spending package has passed a procedural vote in the House of Representatives.",
    "link": "https://biztoc.com/x/d7ea86d719baa67c",
    "timestamp": "2025-07-03T08:07:42Z"
  },
  {
    "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
    "description": "Up all night, House Republicans voted pre-dawn to advance President Donald Trump’s tax and spending cuts package. The House is now starting a round of debates ahead of a final vote expected later Thursday morning. GOP leaders worked almost around the clock tr…",
    "link": "https://www.seattlepi.com/news/politics/article/house-gop-clears-key-hurdle-on-trump-s-big-bill-20420141.php",
    "timestamp": "2025-07-03T08:06:52Z"
  },
  {
    "title": "US House Sets Make-or-break Final Vote On Trump Tax Bill",
    "description": "US lawmakers teed up a final vote on Donald Trump's marquee tax and spending bill for early Thursday after a bruising day of Republican infighting that threatened to derail the centerpiece of the president's domestic agenda.",
    "link": "https://www.ibtimes.com/us-house-sets-make-break-final-vote-trump-tax-bill-3777536",
    "timestamp": "2025-07-03T08:06:06Z"
  },
  {
    "title": "House Republicans advance Trump’s ‘Big Beautiful Bill’ to a final vote",
    "description": "The House voted 219-213 to move forward.",
    "link": "https://nypost.com/2025/07/03/us-news/house-republicans-advance-trumps-big-beautiful-bill-to-a-final-vote/",
    "timestamp": "2025-07-03T08:06:02Z"
  },
  {
    "title": "House GOP clears key hurdle on Trump's big bill, pushing it closer to vote",
    "description": "House Republicans are ready to vote on President Donald Trump’s $4.5 trillion tax breaks and spending cuts bill early Thursday.",
    "link": "https://www.clickondetroit.com/news/politics/2025/07/03/house-gop-clears-key-hurdle-on-trumps-big-bill-pushing-it-closer-to-vote/",
    "timestamp": "2025-07-03T08:04:31Z"
  },
  {
    "title": "Japan's Nikkei ekes out gain despite trade uncertainty; steelmakers jump",
    "description": "Japan's Nikkei edged higher amid U.S. trade deal uncertainty and tariff threats, snapping a two-day decline. Investors are cautious ahead of U.S. employment data and the Independence Day holiday. JFE Holdings and Renesas led gains, while NH Foods and Konami G…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ekes-out-gain-despite-trade-uncertainty-steelmakers-jump/articleshow/122223025.cms",
    "timestamp": "2025-07-03T08:01:55Z"
  },
  {
    "title": "Dina Nayeri on Iranian Life Under Attack",
    "description": "Prize-winning Iranian American author Dina Nayeri joins co-hosts Whitney Terrell and V.V. Ganeshananthan to discuss the complicated reality of survival on the ground during Israel’s recent bombing of Iran. Nayeri talks about the destruction leveled on Ardesto…",
    "link": "https://lithub.com/dina-nayeri-on-iranian-life-under-attack/",
    "timestamp": "2025-07-03T08:00:43Z"
  },
  {
    "title": "It's not 'elbows up' approach as RCMP renews contracts for American helicopters, industry association says",
    "description": "The RCMP renewed the contracts for Black Hawk helicopters, despite accusations by the industry it's the opposite of “elbows up” approach.",
    "link": "https://nationalpost.com/news/canada/industry-association-says-its-not-elbows-up-approach-as-rcmp-renews-contracts-for-american-helicopters",
    "timestamp": "2025-07-03T08:00:38Z"
  },
  {
    "title": "BYD's Mexico factory on hold due to trade uncertainty and geopolitical concerns",
    "description": "Facing rising geopolitical tensions and uncertainty surrounding US trade policy under President Donald J. Trump, Chinese EV maker BYD has put plans for a large-scale factory in Mexico on hold.",
    "link": "https://www.digitimes.com/news/a20250703PD232/byd-mexico-policy-plant-technology.html",
    "timestamp": "2025-07-03T08:00:28Z"
  }
]