[
  {
    "title": "President Trump touts major win for America with EU trade deal",
    "description": "The United States has clinched a significant trade deal with the European Union, widely hailed as a major win for President Trump…\nThe post President Trump touts major win for America with EU trade deal appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/07/28/president-trump-touts-major-win-for-america-with-eu-trade-deal/",
    "timestamp": "2025-07-28T15:45:02Z"
  },
  {
    "title": "Judge blocks Trump administration’s efforts to defund Planned Parenthood - Boston News, Weather, Sports | WHDH 7News",
    "description": "A federal judge on Monday ruled Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding as the nation’s largest abortion provider fights<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/judge-blocks-trump-administratio…",
    "link": "https://whdh.com/news/judge-blocks-trump-administrations-efforts-to-defund-planned-parenthood/",
    "timestamp": "2025-07-28T15:44:26Z"
  },
  {
    "title": "Trump adds Kamala Harris, Beyoncé and Oprah to the list of those he wants prosecuted",
    "description": "Donald Trump's growing prosecution list now includes Kamala Harris, Beyoncé, and Oprah Winfrey, based on entirely false claims.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-adds-kamala-harris-beyonce-oprah-list-wants-prosecuted-rcna221482",
    "timestamp": "2025-07-28T15:44:15Z"
  },
  {
    "title": "What the world got wrong about tariffs",
    "description": "At the beginning of the year, the world was in striking agreement on one point: if \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n went ahead with \n \n \n \n \n \n \n \n \n \n tariffs\n \n \n \n \n \n \n \n \n \n , it would strengthen the \n \n \n \n \n \n \n \n \n \n dollar\n \n \n \n \n…",
    "link": "https://biztoc.com/x/b89c84a13eec49e6",
    "timestamp": "2025-07-28T15:43:50Z"
  },
  {
    "title": "EU and US automakers both lose big in latest tariff deal",
    "description": "Is it possible for both sides to lose a trade war?\nThe question is worth asking on Monday after President Donald Trump announced that the U.S. has reached a trade deal with the European Union.\nThe good news is that after six months of uncertainty, car manufac…",
    "link": "https://biztoc.com/x/650752259049cb79",
    "timestamp": "2025-07-28T15:43:44Z"
  },
  {
    "title": "DAX closes 1% down as US-EU trade optimism dims",
    "description": "European markets ended lower on Monday after rising earlier, as investor confidence faded following fresh tariff threats from US President Donald Trump. The president said global tariffs could reach 1...",
    "link": "https://biztoc.com/x/d5305b0e61882cfb",
    "timestamp": "2025-07-28T15:43:33Z"
  },
  {
    "title": "Avian Flu Wiped Out Poultry. Now the Screwworm Is Coming for Beef.",
    "description": "Avian Flu Wiped Out Poultry. Now the Screwworm Is Coming for Beef.First came bird flu, which led to the culling of large swaths of the nation’s poultry flocks and the soaring egg prices that helped undermine President Joseph R. Biden Jr.’s re-election. Now, r…",
    "link": "https://freerepublic.com/focus/f-chat/4331221/posts",
    "timestamp": "2025-07-28T15:41:56Z"
  },
  {
    "title": "US and EU reach trade deal",
    "description": "Trump's meeting with European Commission President Ursula von der Leyen resulted in a tariff agreement that will avert a transatlantic trade war",
    "link": "https://theweek.com/world-news/trump-eu-tariff-deal-trade-war",
    "timestamp": "2025-07-28T15:41:04Z"
  },
  {
    "title": "Netanyahu's brother-in-law: 'President Trump has a messianic mission'",
    "description": "Dr. Hagi Ben Artzi likens President Trump to biblical King Cyrus and urges Netanyahu to seize this divinely-ordained chance to reshape Israel’s future.",
    "link": "https://www.israelnationalnews.com/news/412370",
    "timestamp": "2025-07-28T15:41:00Z"
  },
  {
    "title": "How Much Slavery Is in Cali? GOP Probe Aims to Find Out After ICE Raid Uncovers Child Labor Abuse",
    "description": "Republican leaders in the House are investigating an Immigration and Customs Enforcement raid on two California cannabis farms from earlier this month after unaccompanied minors were discovered working as laborers there by federal agents. The joint operation …",
    "link": "https://freerepublic.com/focus/f-news/4331220/posts",
    "timestamp": "2025-07-28T15:40:28Z"
  },
  {
    "title": "Trump says ‘nobody’s approached me’ about Ghislaine Maxwell pardon, he ‘turned down’ trip to Jeffrey Epstein’s ‘Pedophile Island’",
    "description": "WASHINGTON — President Trump claimed Monday he has not been asked to pardon Jeffrey Epstein accomplice Ghislaine Maxwell — and revealed that he rejected an offer to visit the notorious pedophile’s private island. Maxwell, 63, sat for two days of questioning w…",
    "link": "https://nypost.com/2025/07/28/us-news/trump-says-nobodys-approached-me-about-ghislaine-maxwell-pardon-he-turned-down-trip-to-jeffrey-epsteins-pedophile-island/",
    "timestamp": "2025-07-28T15:40:06Z"
  },
  {
    "title": "Judge blocks Trump administration's efforts to defund Planned Parenthood (Associated Press)",
    "description": "Associated Press:\nJudge blocks Trump administration's efforts to defund Planned Parenthood  —  A federal judge on Monday ruled Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding as the nation's largest abortion provider …",
    "link": "https://www.memeorandum.com/250728/p48",
    "timestamp": "2025-07-28T15:40:00Z"
  },
  {
    "title": "Trump Isn’t Ruling Out a Pardon for Convicted Sex Trafficker Ghislaine Maxwell",
    "description": "Donald Trump didn't rule out pardoning Jeffrey Epstein accomplice and convicted sex trafficker Ghislaine while speaking with reporters on Monday.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-allowed-pardon-ghislaine-maxwell-1235395065/",
    "timestamp": "2025-07-28T15:39:41Z"
  },
  {
    "title": "BREAKING: Project 2025's creator will run against Lindsey Graham for South Carolina Senate",
    "description": "The creator of Project 2025 is expected to launch a primary campaign for one of South Carolina's U.S. Senate seats in an effort to oust Lindsey Graham.",
    "link": "https://www.advocate.com/politics/project-2025-lindsey-graham-senate",
    "timestamp": "2025-07-28T15:39:34Z"
  },
  {
    "title": "Trump asks for swift deposition of Murdoch in Epstein defamation case",
    "description": "NEW YORK (Reuters) -Donald Trump on Monday asked a U.S. judge to order a swift deposition for billionaire Rupert Murdoch in the U.S. president's defamation lawsuit against the Wall Street Journal over its July 17 article about Trump's relationship with the la…",
    "link": "https://www.thestar.com.my/news/world/2025/07/28/trump-asks-for-swift-deposition-of-murdoch-in-epstein-defamation-case",
    "timestamp": "2025-07-28T15:39:00Z"
  },
  {
    "title": "Trump reiterates that he has the authority to pardon Ghislaine Maxwell",
    "description": "“I'm allowed to give her a pardon,” he said.",
    "link": "https://www.politico.com/news/2025/07/28/trump-ghislaine-maxwell-pardon-jeffrey-epstein-00479862",
    "timestamp": "2025-07-28T15:38:52Z"
  },
  {
    "title": "French PM slams EU trade deal ‘submission’",
    "description": "The newly signed agreement represents a “dark day” for Europe, Francois Bayrou has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622106-french-pm-eu-deal-submission/",
    "timestamp": "2025-07-28T15:37:43Z"
  },
  {
    "title": "US Reportedly Burned Through Quarter Of Critical Missile Interceptors In Israel Defense",
    "description": "The U.S. reportedly burned through nearly a quarter of its supply of a critical missile defense system in defending Israel from Iranian strikes in June.",
    "link": "https://dailycaller.com/2025/07/28/us-burned-through-quarter-critical-missile-interceptors-israel-defense-iran-war/",
    "timestamp": "2025-07-28T15:37:40Z"
  },
  {
    "title": "Trump’s demand for Washington NFL team name change ignores years of psychological data, experts say",
    "description": "President Donald Trump is threatening to hold up a new stadium deal if Washington’s NFL team did not restore its name to a racial slur, despite decades of psychological research showing the negative mental health impacts of Native American mascots. The presid…",
    "link": "https://freerepublic.com/focus/f-news/4331219/posts",
    "timestamp": "2025-07-28T15:36:13Z"
  },
  {
    "title": "Morgan Stanley sees a 'rolling recovery' underway that's set to drive the stock market up 12% by mid-2026",
    "description": "Earnings are in the midst of a \"rolling recovery\" that'll boost the S&P 500. AI, fiscal policy, and rate cuts will help the rally, Morgan Stanley said.",
    "link": "https://www.businessinsider.com/stock-market-outlook-rolling-recovery-sp500-target-earnings-ai-rates-2025-7",
    "timestamp": "2025-07-28T15:35:37Z"
  },
  {
    "title": "What's in Trump's trade agreement with the European Union?",
    "description": "The 27-nation bloc averts a 30% tariff that would have taken effect Aug. 1.",
    "link": "https://abcnews.go.com/Business/trumps-trade-agreement-european-union/story?id=124131754",
    "timestamp": "2025-07-28T15:35:16Z"
  },
  {
    "title": "Trump on Gaza humanitarian crisis",
    "description": "President Donald Trump, asked about the humanitarian crisis in Gaza on Monday, said that he and U.K. Prime Minister Keir ...",
    "link": "https://biztoc.com/x/730b5c664aed15de",
    "timestamp": "2025-07-28T15:35:10Z"
  },
  {
    "title": "'Nothing to hide': JD Vance confronted over 'protecting pedophiles' accusation",
    "description": "Vice President JD Vance faced questions about \"protecting pedophiles\" after President Donald Trump's administration refused to release a list of Jeffrey Epstein's associates.Following a speech in Ohio on Monday, Vance took a question from Associated Press rep…",
    "link": "https://www.rawstory.com/jd-vance-trump-protecting-epstein/",
    "timestamp": "2025-07-28T15:34:33Z"
  },
  {
    "title": "Baby dies from malnutrition as Trump warns of ‘real starvation’ in Gaza",
    "description": "Infant is among at least 14 people who died from malnutrition in 24 hours across Gaza, hospital source tells Al Jazeera.",
    "link": "https://www.aljazeera.com/news/2025/7/28/palestinian-baby-among-14-who-died-from-hunger-in-gaza-in-last-24-hours",
    "timestamp": "2025-07-28T15:33:29Z"
  },
  {
    "title": "H-1B Visa Crackdown Proposed Under Republican Bill: What to Know",
    "description": "If enacted, all prospective foreign hires, including administrators and professors, would be required to compete under the standard 65,000 visa cap.",
    "link": "https://www.newsweek.com/h-1b-visa-higher-education-republican-bill-2105149",
    "timestamp": "2025-07-28T15:33:25Z"
  },
  {
    "title": "Who Benefits From Tax Changes in Trump’s ‘Big Beautiful Bill’?",
    "description": "President Donald Trump signed the One Big Beautiful Bill Act into law, marking the largest tax package in recent American history. The legislation promises sweeping changes across the tax landscape, extending previous cuts while introducing new provisions tha…",
    "link": "https://biztoc.com/x/9a4a7c6167b1dcf6",
    "timestamp": "2025-07-28T15:33:23Z"
  },
  {
    "title": "Trump Says He Will Give Putin New 10-12 Day Truce Deadline",
    "description": "US President Donald Trump said he would impose a new deadline of 10-12 days for Russian leader Vladimir Putin to reach a truce with Ukraine, ramping up pressures on Moscow to bring the fighting to a halt.\n“I’m going to make a new deadline of about 10 — 10 or …",
    "link": "https://biztoc.com/x/bcf148197502cc6f",
    "timestamp": "2025-07-28T15:32:23Z"
  },
  {
    "title": "The details of Trump’s trade deal with the EU",
    "description": "U.S. President Donald Trump and European Commission President Ursula von der Leyen have announced a sweeping trade deal that imposes 15-per-cent tariffs on most European goods, warding off Trump’s threat of a 30-per-cent rate if no deal had been reached by Au…",
    "link": "https://biztoc.com/x/b25af6f7b9e5b381",
    "timestamp": "2025-07-28T15:32:14Z"
  },
  {
    "title": "ECB Adviser: US Stablecoin Efforts Could Hurt Europe",
    "description": "The dominance of the U.S. dollar-based stablecoin could be a threat to Europe, Jürgen Schaaf, an adviser for the European Central Bank (ECB), wrote in a Monday (July 28) blog post. [contact-form-7] After growing in popularity over the last few years, stableco…",
    "link": "http://www.pymnts.com/cryptocurrency/2025/european-central-bank-adviser-united-states-stablecoin-efforts-could-hurt-europe/",
    "timestamp": "2025-07-28T15:31:27Z"
  },
  {
    "title": "Every Time",
    "description": "Never surprising.An investigation is underway in Oklahoma after a television screen in the MAGA state school superintendent’s office reportedly showed a video of nude women during an executive session of the State Board of Education on Thursday. \n\nThe images …",
    "link": "https://www.eschatonblog.com/2025/07/every-time.html",
    "timestamp": "2025-07-28T15:30:00Z"
  },
  {
    "title": "Judge blocks Trump administration's efforts to defund Planned Parenthood",
    "description": "A federal judge says Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding.",
    "link": "https://www.wmur.com/article/federal-judge-medicaid-funding-planned-parenthood/65528760",
    "timestamp": "2025-07-28T15:29:36Z"
  },
  {
    "title": "Britain’s Starmer presses Trump on ‘desperate’ food crisis in Gaza during meeting in Scotland",
    "description": "Starmer is using Monday's closed-door discussions to urge Trump to help address the food crisis in Gaza amid the ongoing conflict there between Israel and Hamas.",
    "link": "https://www.pbs.org/newshour/politics/britains-starmer-presses-trump-on-desperate-food-crisis-in-gaza-during-meeting-in-scotland",
    "timestamp": "2025-07-28T15:28:49Z"
  },
  {
    "title": "Tariffs threaten Asian beauty product boom in US",
    "description": "Donald Trump's tariffs could put a damper on the booming business of Asian skin care products.",
    "link": "https://www.bostonherald.com/2025/07/28/asian-beauty-products-us-tariffs/",
    "timestamp": "2025-07-28T15:28:35Z"
  },
  {
    "title": "Project 2025 Architect Paul Dans Challenging Lindsey Graham In South Carolina",
    "description": "Graham has contorted himself as much as anyone to remain in MAGA’s good graces, and yet.",
    "link": "https://www.huffpost.com/entry/lindsey-graham-paul-dans-primary_n_688791e8e4b067dd81475040",
    "timestamp": "2025-07-28T15:28:33Z"
  },
  {
    "title": "Trump Warns UK's Starmer Not to Make 'Mistake' of Censoring Truth Social",
    "description": "U.S. President Donald Trump warned UK Prime Minister Sir Keir Starmer that it would be a \"mistake\" for the British government to censor his Truth Social platform under the recently enacted Online Safety Act.\nThe post Trump Warns UK’s Starmer Not to Make ‘Mist…",
    "link": "https://www.breitbart.com/europe/2025/07/28/trump-warns-uks-starmer-not-to-make-mistake-of-censoring-truth-social/",
    "timestamp": "2025-07-28T15:28:18Z"
  },
  {
    "title": "Angry France slams US trade pact 'submission' as EU peers breathe sigh of relief",
    "description": "Summary15% tariff on EU goods, less than feared, but higher than hoped French PM savages agreement, no comment from Macron Deal brings relief but leaves unresolved questions European stocks rise BRUSSELS, July 28 (Reuters) - France denounced the trade agreeme…",
    "link": "https://freerepublic.com/focus/f-news/4331216/posts",
    "timestamp": "2025-07-28T15:28:07Z"
  },
  {
    "title": "Uncertainty is far from over, says Belgium’s pharma sector",
    "description": "Belgium’s pharma sector and political leaders warn that the new EU–US trade deal leaves key questions unanswered and risks undermining Europe’s strategic autonomy.",
    "link": "https://www.euractiv.com/section/health-consumers/news/uncertainty-is-far-from-over-says-belgiums-pharma-sector/",
    "timestamp": "2025-07-28T15:27:31Z"
  },
  {
    "title": "Judge blocks Trump admin's efforts to defund Planned Parenthood",
    "description": "The nation’s largest abortion provider is fighting Trump over efforts to defund the organization.",
    "link": "https://www.twincities.com/2025/07/28/planned-parenthood-funding-cuts-blocked/",
    "timestamp": "2025-07-28T15:25:54Z"
  },
  {
    "title": "Judge Blocks Trump Administration's Efforts To Defund Planned Parenthood",
    "description": "A federal judge says Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding.",
    "link": "https://www.huffpost.com/entry/ap-us-planned-parenthood-funding-cuts-judge_n_688795d2e4b067dd814752b7",
    "timestamp": "2025-07-28T15:24:40Z"
  },
  {
    "title": "Hegseth’s Allies Beg Him to Get His Act Together",
    "description": "Pete Hegseth may have Trump’s “full confidence,” but he apparently doesn’t have the trust of those at the Pentagon.",
    "link": "http://nymag.com/intelligencer/article/pete-hegseths-allies-beg-him-to-get-his-act-together.html",
    "timestamp": "2025-07-28T15:23:53Z"
  },
  {
    "title": "What the world got wrong about tariffs",
    "description": "Economists predicted stagflation but no economy rises or falls for just one reason, even a shock as big as Trump's tariffs. Read more here.",
    "link": "https://financialpost.com/financial-times/what-the-world-got-wrong-about-tariffs",
    "timestamp": "2025-07-28T15:23:49Z"
  },
  {
    "title": "Is Project 2025 Coming To The Senate? Ex-Director Challenges Lindsey Graham In South Carolina",
    "description": "Paul Dans told the Associated Press he wants to bring Project 2025’s ideas to the Senate.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/28/is-project-2025-coming-to-the-senate-ex-director-challenges-lindsey-graham-in-south-carolina/",
    "timestamp": "2025-07-28T15:23:49Z"
  },
  {
    "title": "Bad Brand: Democrats plunge to new lows in another national poll",
    "description": "Democratic Party favorability has plunged to 33% in a Wall Street Journal poll, marking a 35-year low as the party struggles to regain credibility with voters.",
    "link": "https://www.foxnews.com/politics/bad-brand-democrats-plunge-new-lows-another-national-poll",
    "timestamp": "2025-07-28T15:23:45Z"
  },
  {
    "title": "Fact check: Viral Durban video misrepresents post-apartheid South Africa",
    "description": "A viral video claims to show lootings in Durban as a direct result of the end of apartheid and supposed NGO influence. But the footage is from 2021 and the narrative it promotes echoes racist and conspiratorial theories.",
    "link": "https://www.dw.com/en/fact-check-viral-durban-video-misrepresents-post-apartheid-south-africa/a-73418612",
    "timestamp": "2025-07-28T15:23:00Z"
  },
  {
    "title": "Thai PM: US, Thailand to renew trade talks",
    "description": "Thailand's acting Prime Minister Phumtham Wechayachai announced on Monday that he held a phone conversation with US President Donald Trump following a ceasefire agreement with neighboring Cambodia.Wec...",
    "link": "https://biztoc.com/x/ab5ffce1b25ca5b2",
    "timestamp": "2025-07-28T15:21:18Z"
  },
  {
    "title": "Judge blocks Trump administration’s efforts to defund Planned Parenthood",
    "description": "The nation’s largest abortion provider is fighting Trump over efforts to defund the organization.",
    "link": "https://www.bostonherald.com/2025/07/28/planned-parenthood-funding-cuts-blocked/",
    "timestamp": "2025-07-28T15:20:56Z"
  },
  {
    "title": "Trump says he wants Netanyahu to ‘make sure they get the food’ in Gaza amid humanitarian crisis",
    "description": "His remarks mark a shift from his earlier stance on the ongoing Israel-Hamas conflict.",
    "link": "https://www.bostonherald.com/2025/07/28/trump-gaza-food/",
    "timestamp": "2025-07-28T15:20:08Z"
  },
  {
    "title": "Tennis Icon Martina Navratilova Rips Donald Trump After Viral Golf Cheating Clip Surfaces",
    "description": "Tennis legend Martina Navratilova recently criticized Donald Trump after a video surfaced appearing to show him cheating at golf in Scotland. Navratilova didn't hold back, questioning Trump's integrity on X. This isn't the first time she has publicly called o…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/tennis-icon-martina-navratilova-rips-donald-trump-after-viral-golf-cheating-clip-surfaces/articleshow/122956929.cms",
    "timestamp": "2025-07-28T15:19:30Z"
  },
  {
    "title": "‘The Fix Is In’: Scott Galloway Predicts Ghislaine Maxwell Will Publicly Exonerate Trump in Exchange for a Pardon",
    "description": "\"The fix is in. She's going to be pardoned 30 to 60 days before the end of his term,\" Scott Galloway predicted about Ghislaine Maxwell.\nThe post ‘The Fix Is In’: Scott Galloway Predicts Ghislaine Maxwell Will Publicly Exonerate Trump in Exchange for a Pardon …",
    "link": "https://www.mediaite.com/media/podcasts/the-fix-is-in-scott-galloway-predicts-ghislaine-maxwell-will-publicly-exonerate-trump-in-exchange-for-a-pardon/",
    "timestamp": "2025-07-28T15:19:20Z"
  },
  {
    "title": "Canada-U.S. trade negotiations at 'intense phase,' Carney says as deadline looms",
    "description": "Prime Minister Mark Carney said Monday trade negotiations with the U.S. are at an \"intense phase\" ahead of Friday's deadline to reach an agreement.",
    "link": "https://www.cbc.ca/news/politics/carney-trade-negotiations-intense-1.7595401",
    "timestamp": "2025-07-28T15:18:29Z"
  },
  {
    "title": "‘One Less MAGA’: Florida School Board Chair Apologizes For Comments Made About Hulk Hogan’s Death",
    "description": "A Florida county school board chair apologized Saturday for comments she made reacting to Hulk Hogan's death, according to Fox News.",
    "link": "https://dailycaller.com/2025/07/28/sarah-rockwell-alachua-county-public-schools-florida-hulk-hogan-comments-maga/",
    "timestamp": "2025-07-28T15:17:28Z"
  },
  {
    "title": "Obama Official Files Bombshell Demand for Epstein Files and Secret Trump Messages",
    "description": "One of President Donald Trump’s most persistent legal foes is going after the Epstein files. Norm Eisen—the former White House ethics chief under former...",
    "link": "https://www.thedailybeast.com/obama-official-files-bombshell-demand-for-the-epstein-files-and-secret-trump-messages/",
    "timestamp": "2025-07-28T15:17:23Z"
  },
  {
    "title": "Despite Trump Pressure, No July Rate Cut Expected From Fed",
    "description": "Fixed income markets view a July interest rate cut as highly unlikely, at the conclusion of the Fed's meeting on July 30, but cuts are probable at subsequent meetings in 2025.",
    "link": "https://www.forbes.com/sites/simonmoore/2025/07/28/despite-trump-pressure-no-july-rate-cut-expected-from-fed/",
    "timestamp": "2025-07-28T15:17:21Z"
  },
  {
    "title": "A pardon isn't the only legal help the Trump admin could possibly give Ghislaine Maxwell",
    "description": "The DOJ is allowed to seek sentencing reductions after sentences are handed down, but it might have a hard time in the case of Jeffrey Epstein's co-conspirator.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/ghislaine-maxwell-trump-pardon-sentencing-doj-rcna221449",
    "timestamp": "2025-07-28T15:16:13Z"
  },
  {
    "title": "Microsoft has to hit its earnings out of the park: Opening Bid top takeaway",
    "description": "Can Microsoft deliver the goods come earnings day?",
    "link": "https://finance.yahoo.com/news/microsoft-has-to-hit-its-earnings-out-of-the-park-opening-bid-top-takeaway-151556520.html",
    "timestamp": "2025-07-28T15:15:56Z"
  },
  {
    "title": "Coffee Shop Adding 'Tariff Adjustment' to Bill Sparks Debate",
    "description": "A senator posting a receipt with a 10 percent tariff markup has sparked a debate over trade policy and potential price gouging.",
    "link": "https://www.newsweek.com/coffee-shop-surcharge-donald-trump-tariffs-2105144",
    "timestamp": "2025-07-28T15:15:33Z"
  },
  {
    "title": "White House Erupts Into 'Full-Bore Panic Mode' as Epstein Scandal Refuses to Die: Prez Privately 'Fumes' as 'Distraction Methods Fall Flat' — and His Scandal-Scarred Dept. Of Justice and FBI 'Break at the Seams'",
    "description": "The White House and President Donald Trump's administration has erupted into full-bore panic mode' as the Jeffrey Epstein scandal refuses to die.",
    "link": "https://radaronline.com/p/white-house-trump-panic-epstein-scandal-distraction-methods-fail/",
    "timestamp": "2025-07-28T15:15:22Z"
  },
  {
    "title": "President Trump Announces Ceasefire Between Cambodia and Thailand",
    "description": "President Trump on Monday morning announced he helped broker yet another ceasefire deal.\nThe post President Trump Announces Ceasefire Between Cambodia and Thailand appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/president-trump-announces-ceasefire-between-cambodia-thailand/",
    "timestamp": "2025-07-28T15:15:10Z"
  },
  {
    "title": "Donald Trump says Russia has 10 to 12 days to agree ceasefire in Ukraine - Financial Times",
    "description": "Donald Trump says Russia has 10 to 12 days to agree ceasefire in UkraineFinancial Times Trump 'disappointed' in Putin, says he'll reduce 50-day deadlineFox News Trump Gives Russia Less Than Two Weeks to End Its War in UkraineThe New York Times Trump says he's…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178491550",
    "timestamp": "2025-07-28T15:15:01Z"
  },
  {
    "title": "Trump's 'Gonna Get Slammed Eventually' —Morning Joe Hopes Tariffs Will Raise Prices",
    "description": "On today's Morning Joe, the panelists expressed the fond desire, cloaked in analysis, that prices would eventually rise—to Trump's detriment. MSNBC's Ali Vitali nudged Franklin Foer of The Atlantic to echo the show's prevailing sentiment: \"We've yet to see th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4331208/posts",
    "timestamp": "2025-07-28T15:14:10Z"
  },
  {
    "title": "President Trump Welcomes British Prime Minister Keir Starmer to Turnberry, Scotland",
    "description": "Earlier this morning President Donald Trump welcomed British Prime Minister Keir Starmer to Turnberry, Scotland where the two leaders will hold bilateral discussions on trade and foreign affairs.The video is prompted to 16:20. The bagpipes stop eventually in …",
    "link": "https://freerepublic.com/focus/f-bloggers/4331207/posts",
    "timestamp": "2025-07-28T15:14:09Z"
  },
  {
    "title": "Putin must agree Ukraine ceasefire in 10 or 12 days, says Trump",
    "description": "The US president says there is \"no reason\" for waiting amid little sign of progress towards peace.",
    "link": "https://www.bbc.com/news/articles/c707zrrd7xqo",
    "timestamp": "2025-07-28T15:12:56Z"
  },
  {
    "title": "Donald Trump: Vladimir Putin must agree Ukraine ceasefire in days",
    "description": "The US president says there is \"no reason\" for waiting amid little sign of progress towards peace.",
    "link": "https://www.bbc.co.uk/news/articles/c707zrrd7xqo",
    "timestamp": "2025-07-28T15:12:56Z"
  },
  {
    "title": "‘He Did Something That Was Inappropriate’: Trump Reveals Real Reason He Fell Out With Epstein",
    "description": "The reasons behind the Trump-Epstein falling out have long been talked about. But on Monday, explained why he booted the disgraced financier from Mar-a-Lago.\nThe post ‘He Did Something That Was Inappropriate’: Trump Reveals Real Reason He Fell Out With Epstei…",
    "link": "https://www.mediaite.com/media/news/he-did-something-that-was-inappropriate-trump-reveals-real-reason-he-fell-out-with-epstein/",
    "timestamp": "2025-07-28T15:12:49Z"
  },
  {
    "title": "Gaza experiencing 'real starvation', Trump says",
    "description": "The US president's comments come after Israel's prime minister claims of hunger were a \"lie\".",
    "link": "https://www.bbc.com/news/articles/c62nr9rglm9o",
    "timestamp": "2025-07-28T15:12:46Z"
  },
  {
    "title": "Judge blocks Trump administration's efforts to defund Planned Parenthood",
    "description": "A federal judge on Monday ruled Planned Parenthood clinics nationwide must continue to be reimbursed for Medicaid funding as the nation’s largest abortion...",
    "link": "https://www.yahoo.com/news/articles/judge-blocks-trump-administrations-efforts-151225028.html",
    "timestamp": "2025-07-28T15:12:25Z"
  },
  {
    "title": "Trump talks Russia, Gaza and Epstein island in wild press conference with Starmer",
    "description": "US President Donald Trump made many remarks during a press conference with Keir Starmer.",
    "link": "https://www.thejournal.ie/trump-russia-ceasefire-and-gaza-6776046-Jul2025/",
    "timestamp": "2025-07-28T15:12:24Z"
  },
  {
    "title": "Hope Hicks To Join Megyn Kelly’s Media Company As COO",
    "description": "Hope Hicks, who served as Donald Trump’s communications director in his first term, is joining Megyn Kelly’s company Devil May Care Media as chief operating officer. Hicks will lead business development and manage day to day operations at the company, which i…",
    "link": "http://deadline.com/2025/07/hope-hicks-megyn-kelly-coo-1236472126/",
    "timestamp": "2025-07-28T15:11:34Z"
  },
  {
    "title": "Donald Trump Says His Name May Have Been Planted in Jeffrey Epstein Files",
    "description": "The president has faced pressure from his supporters to release the files about Epstein, which they believe will reveal a cover-up.",
    "link": "https://biztoc.com/x/e6cd3110df0f9798",
    "timestamp": "2025-07-28T15:10:14Z"
  },
  {
    "title": "Trump: Thailand, Cambodia reached peace",
    "description": "United States President Donald Trump announced on Monday that Thailand and Cambodia \"have reached a ceasefire and peace,\" due to his efforts to end the conflict between the two nations in southeast As...",
    "link": "https://biztoc.com/x/2d6024e9180c258d",
    "timestamp": "2025-07-28T15:10:08Z"
  },
  {
    "title": "Full List of GOP Bills to Put Trump's Name or Face on Things",
    "description": "Republican lawmakers have spent the past six months introducing a steady stream of bills designed to honor Donald Trump—and, in some cases, his family.",
    "link": "https://biztoc.com/x/fd53c113e5d1d79b",
    "timestamp": "2025-07-28T15:09:58Z"
  },
  {
    "title": "8 major student loan changes from Trump’s budget bill: Next steps for borrowers",
    "description": "Student loan borrowers face a new status quo after Congress and President Donald Trump signed off on a massive budget reconciliation agreement earlier this month — the so-called “one big, beautiful bill”.\nThe changes are significant, but not immediate. Most w…",
    "link": "https://biztoc.com/x/78396e02c236d82c",
    "timestamp": "2025-07-28T15:09:47Z"
  },
  {
    "title": "Jill On Money: What Trump vs. Powell means for you",
    "description": "Anyone who has gone through a construction project knows the perils of project creep and cost overruns. For Federal Reserve Chair Jerome Powell, the experience might lead to a more difficult end to his tenure as Fed Chair or potentially lead to his removal.\nF…",
    "link": "https://biztoc.com/x/c29339bd905ea1ff",
    "timestamp": "2025-07-28T15:09:45Z"
  },
  {
    "title": "How the US-EU trade deal wards off more escalation but will raise prices and slow growth",
    "description": "President Trump and European Commission President von der Leyen announced a trade deal imposing 15% tariffs on most European goods, averting higher rates. The agreement includes zero tariffs on strategic goods and increased European purchases of U.S. energy. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-the-us-eu-trade-deal-wards-off-more-escalation-but-will-raise-prices-and-slow-growth/articleshow/122956832.cms",
    "timestamp": "2025-07-28T15:09:30Z"
  },
  {
    "title": "EU’s $750 Billion Energy Deal With Trump Looks Hard to Reach",
    "description": "The European Union’s promise to buy $750 billion of American energy imports over three years was pivotal to securing a trade deal with President Donald Trump, but it’s a pledge it will struggle to keep.",
    "link": "https://gcaptain.com/eus-750-billion-energy-deal-with-trump-looks-hard-to-reach/",
    "timestamp": "2025-07-28T15:08:45Z"
  },
  {
    "title": "Trump Tells UK’s Starmer to Cut Taxes, Migration to Beat Farage",
    "description": "President Donald Trump suggested Prime Minister Keir Starmer needed to lower taxes, cut immigration and stop crime in the UK if he wants to beat populist Nigel Farage at the next general election.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tells-uks-starmer-to-cut-taxes-migration-to-beat-farage",
    "timestamp": "2025-07-28T15:08:33Z"
  },
  {
    "title": "Trump shortens the 50-day deadline for Russia to end the war in Ukraine",
    "description": "“No reason in waiting,” President Trump said. “We just don’t see any progress being made.”",
    "link": "https://www.wcvb.com/article/trump-shortens-putin-deadline-ukraine-war/65528290",
    "timestamp": "2025-07-28T15:07:59Z"
  },
  {
    "title": "US stock market rallies as US–EU trade deal, Nvidia and Tesla gains lift S&P 500, Nasdaq to new highs while Dow lags",
    "description": "US stock market eyes pivotal breakout as a new U.S.–EU trade deal eases tariff tensions and lifts investor confidence at the start of a packed week. The S&P 500 and Nasdaq reached fresh highs, fueled by rising tech and energy stocks like Nvidia, Tesla, and Ch…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-rallies-as-useu-trade-deal-nvidia-and-tesla-gains-lift-sp-500-nasdaq-to-new-highs-while-dow-lags/articleshow/122956467.cms",
    "timestamp": "2025-07-28T15:07:05Z"
  },
  {
    "title": "Commerce Secretary Howard Lutnick confirms tariffs deadline will not be extended",
    "description": "'It's possible that we get near a trillion dollars of revenue that will come into the United States of America, reducing our deficit'",
    "link": "https://www.wnd.com/2025/07/commerce-secretary-howard-lutnick-confirms-tariffs-deadline-will/",
    "timestamp": "2025-07-28T15:06:20Z"
  },
  {
    "title": "Donald Trump Says His Name May Have Been Planted in Jeffrey Epstein Files",
    "description": "The president has faced pressure from his supporters to release the files about Epstein, which they believe will reveal a cover-up.",
    "link": "https://www.newsweek.com/donald-trump-name-planted-epstein-files-relationship-conspiracy-2105171",
    "timestamp": "2025-07-28T15:05:14Z"
  },
  {
    "title": "Trump gives Russia 10 or 12 days to end war on Ukraine",
    "description": "US president says he is disappointed in Russia’s Putin as he shortens a 50-day deadline he set this month.",
    "link": "https://www.aljazeera.com/news/2025/7/28/trump-gives-russia-10-or-12-days-to-end-war-on-ukraine",
    "timestamp": "2025-07-28T15:03:48Z"
  },
  {
    "title": "Trump: ‘Some of those kids, that’s real starvation’",
    "description": "US President Donald Trump said images of hungry children in Gaza show “real starvation” that one can’t “fake”.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/7/28/trump-some-of-those-kids-thats-real",
    "timestamp": "2025-07-28T15:03:32Z"
  },
  {
    "title": "‘You Must Be Kidding’: Media Matters, Collapsing Under Siege from Elon Musk, Fumes at Massive Legal Bills From Marc Elias Firm",
    "description": "When Elon Musk sued Media Matters in 2023, the law firm of Democratic super-lawyer Marc Elias swooped in to represent the liberal media group. It made little headway against the lawsuit before submitting millions of dollars in legal bills, prompting Media Mat…",
    "link": "https://freerepublic.com/focus/f-news/4331203/posts",
    "timestamp": "2025-07-28T15:03:18Z"
  },
  {
    "title": "Trump Confesses to Doodling Buildings, But Not Nudes for Epstein: ‘I Don’t Do Drawings of Women’",
    "description": "President Donald Trump confessed to the occasional doodle of a building, but insisted he has never drawn the image of a nude woman on Monday\nThe post Trump Confesses to Doodling Buildings, But Not Nudes for Epstein: ‘I Don’t Do Drawings of Women’ first appear…",
    "link": "https://www.mediaite.com/politics/trump/trump-confesses-to-doodling-buildings-but-not-nudes-for-epstein-i-dont-do-drawings-of-women/",
    "timestamp": "2025-07-28T15:03:15Z"
  },
  {
    "title": "Are Superhero Movies Actually Good Again?",
    "description": "With Superman and The Fantastic Four having a moment this summer, it turns out that fans weren’t exhausted by superhero films. They were just tired of watching bad ones.",
    "link": "https://www.esquire.com/entertainment/tv/a65527918/superhero-movies-superman-fantastic-four-box-office-success/",
    "timestamp": "2025-07-28T15:03:00Z"
  },
  {
    "title": "Operation Sindoor: Amit Shah interrupts EAM Jaishankar's address in Lok Sabha to slam Oppn, says ‘why believe foreigners over your own minister?’",
    "description": "Tensions ran high in Lok Sabha as Home Minister Amit Shah fiercely criticised the Opposition for disrupting External Affairs Minister S Jaishankar’s statement on Operation Sindoor. Jaishankar refuted US mediation claims and detailed India’s military response …",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/operation-sindoor-amit-shah-interrupts-eam-jaishankars-address-in-lok-sabha-to-slam-oppn-says-why-believe-foreigners-over-your-own-minister/articleshow/122956563.cms",
    "timestamp": "2025-07-28T15:02:22Z"
  },
  {
    "title": "Full List of GOP Bills to Put Trump's Name or Face on Things",
    "description": "Republican lawmakers have spent the past six months introducing a steady stream of bills designed to honor Donald Trump—and, in some cases, his family.",
    "link": "https://www.newsweek.com/full-list-gop-efforts-put-trumps-name-face-things-2105146",
    "timestamp": "2025-07-28T15:01:53Z"
  },
  {
    "title": "The Age-Gated Internet Is Here",
    "description": "Goodbye, online anonymity.",
    "link": "https://reason.com/2025/07/28/the-age-gated-internet-is-here/",
    "timestamp": "2025-07-28T15:01:16Z"
  },
  {
    "title": "'Very Disappointed' Trump Issues New, Shorter Ultimatum to Putin to Reach Ceasefire With Ukraine",
    "description": "Donald Trump has issued a new, shorter ultimatum for Vladimir Putin to reach a ceasefire with Ukraine, facing pressure to do so in a matter of days.",
    "link": "https://www.ibtimes.com/very-disappointed-trump-issues-new-shorter-ultimatum-putin-reach-ceasefire-ukraine-3779633",
    "timestamp": "2025-07-28T15:01:14Z"
  },
  {
    "title": "Trump Says 15-20% Baseline Tariff Likely For Countries Without Trade Deals",
    "description": "President Donald Trump on Monday indicated that he will likely impose a blanket tariff between 15% and 20% on imports from countries that haven't signed separate trade agreements with the United States.",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-floats-baseline-15-per-cent-to-20-per-cent-tariffs-for-countries-without-trade-deals",
    "timestamp": "2025-07-28T15:01:04Z"
  },
  {
    "title": "Trump Says There's 'Real Starvation' In Gaza: 'You Can't Fake That'",
    "description": "The president rejected Israeli Prime Minister Benjamin Netanyahu's claim that there’s \"no starvation\" in Gaza.",
    "link": "https://www.huffpost.com/entry/trump-gaza-netanyahu-starvation_n_68877207e4b0b5f7e90805c7",
    "timestamp": "2025-07-28T15:01:01Z"
  }
]