[
  {
    "title": "Kennedy Center cancels LGBTQ+ Pride events to align with new priorities after Trump fired center's leadership",
    "description": "The Kennedy Center has canceled events celebrating LGBTQ+ people for the World Pride festival in Washington, D.C., after President Donald Trump's takeover.",
    "link": "https://www.foxnews.com/politics/kennedy-center-cancels-lgbtq-pride-events-align-new-priorities-after-trump-fired-centers-leadership",
    "timestamp": "2025-04-26T04:57:21Z"
  },
  {
    "title": "Trump will pay his respects to a pope who publicly and pointedly disagreed with him on some issues",
    "description": "President Donald Trump will be among more than 50 heads of state and other dignitaries attending the funeral for Pope Francis in Vatican City on Saturday",
    "link": "https://abcnews.go.com/International/wireStory/trump-pay-respects-pope-publicly-pointedly-disagreed-issues-121183820",
    "timestamp": "2025-04-26T04:54:32Z"
  },
  {
    "title": "Shedeur Sanders' NFL Draft slide: How the sports world is reacting",
    "description": "Shedeur Sanders is still waiting after three rounds of the NFL Draft, a stunning outcome for a quarterback who was projected to be a first-round pick.",
    "link": "https://www.foxsports.com/stories/nfl/shedeur-sanders-falls-day-3-nfl-draft-reactions-deion",
    "timestamp": "2025-04-26T04:48:46Z"
  },
  {
    "title": "Stocks rise with tech-related shares, notch weekly gains; dollar up",
    "description": "Wall Street saw gains on Friday, driven by tech stocks. Investors are watching for signs of easing US-China trade tensions. Alphabet's strong earnings boosted the market. Trade war uncertainty continues to influence corporate outlooks. Trump claims trade talk…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-rise-with-tech-related-shares-notch-weekly-gains-dollar-up/articleshow/120637157.cms",
    "timestamp": "2025-04-26T04:47:33Z"
  },
  {
    "title": "Harvard researcher held in Louisiana awaits judge's decision on deportation to Russia",
    "description": "Russian-born scientist Kseniia Petrova has been detained by U.S. Immigrations and Customs Enforcement since February when she failed to declare frog embryo samples at Boston's Logan Airport",
    "link": "https://abcnews.go.com/US/wireStory/harvard-researcher-held-louisiana-awaits-judges-decision-deportation-121184269",
    "timestamp": "2025-04-26T04:46:27Z"
  },
  {
    "title": "Pope Francis' funeral is set to begin, in a ceremony he helped reimagine",
    "description": "Pope Francis is being laid to rest in ceremony reflecting his priorities as pope and wishes as pastor",
    "link": "https://abcnews.go.com/International/wireStory/pope-francis-funeral-set-begin-ceremony-helped-reimagine-121184272",
    "timestamp": "2025-04-26T04:46:23Z"
  },
  {
    "title": "StormBreaker Advanced Glide Bomb Lands In Yemen Largely Intact",
    "description": "Cutting-edge StormBreaker was only recently confirmed as being used in combat and could be of major intelligence value to an adversary. By signing up you agree to our Terms of Service and Privacy Policy. The wreckage of a GBU-53/B StormBreaker glide bomb, als…",
    "link": "https://freerepublic.com/focus/f-bloggers/4313347/posts",
    "timestamp": "2025-04-26T04:40:30Z"
  },
  {
    "title": "Pope Francis’ funeral is set to begin, in a ceremony he helped reimagine",
    "description": "As many as 200,000 people are expected to attend the funeral, which Francis choreographed himself.",
    "link": "https://www.bostonherald.com/2025/04/26/pope-francis-funeral/",
    "timestamp": "2025-04-26T04:38:40Z"
  },
  {
    "title": "Pope Francis’ funeral is set to begin, in a ceremony he helped reimagine",
    "description": "As many as 200,000 people are expected to attend the funeral, which Francis choreographed himself.",
    "link": "https://www.denverpost.com/2025/04/25/pope-francis-funeral/",
    "timestamp": "2025-04-26T04:38:40Z"
  },
  {
    "title": "Trump's Deportation Policies Could Worsen Social Security's Funding Shortfall by 11%, Warns New Report",
    "description": "The Trump administration's immigration policies could weaken Social Security's financial health without changing any laws, threatening a program that millions of Americans rely on for retirement security.",
    "link": "https://www.benzinga.com/news/25/04/45025822/trumps-deportation-policies-could-worsen-social-securitys-funding-shortfall-by-11-warns-new-report",
    "timestamp": "2025-04-26T04:37:45Z"
  },
  {
    "title": "Wall Street Week Ahead: Big tech earnings, US jobs data highlight busy week for markets",
    "description": "The US stock market is set for a crucial week. Corporate results from Apple and Microsoft are awaited. Global trade developments could bring volatility. US employment report and economic growth data are also due. Investors are assessing if the recent market s…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-big-tech-earnings-us-jobs-data-highlight-busy-week-for-markets/articleshow/120636880.cms",
    "timestamp": "2025-04-26T04:31:45Z"
  },
  {
    "title": "Live: Rome prepares for Pope Francis's funeral",
    "description": "Hundreds of thousands have gathered to mourn Pope Francis — a liberal reformer who rattled the Catholic Church's conservatives — on the day of his funeral in Rome. Follow live.",
    "link": "https://www.abc.net.au/news/2025-04-26/pope-francis-funeral-live-updates/105216862",
    "timestamp": "2025-04-26T04:30:11Z"
  },
  {
    "title": "Trump Has Now Deported Multiple U.S. Citizen Children With Cancer",
    "description": "Two families — among them three U.S. citizens aged two, four, and seven — were abruptly deported under \"troubling circumstances,\" says the ACLU",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-deport-child-cancer-us-citizen-1235325778/",
    "timestamp": "2025-04-26T04:26:11Z"
  },
  {
    "title": "Francis' Funeral Today To Be Grand Farewell To 'Pope Of The Poor'",
    "description": "The funeral sets off the first of nine days of official Vatican mourning for Francis, who took over following the resignation of Pope Benedict XVI in 2013.",
    "link": "https://www.ndtv.com/world-news/pope-francis-funeral-today-to-be-grand-farewell-to-pope-of-the-poor-8259869",
    "timestamp": "2025-04-26T04:22:59Z"
  },
  {
    "title": "China insists no trade talks with US, despite Trump claim",
    "description": "China refuted claims of trade discussions with the United States. This came after President Trump suggested a conversation with Xi Jinping. China's commerce ministry previously denied any economic negotiations. Beijing reiterated that no tariff consultations …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-insists-no-trade-talks-with-us-despite-trump-claim/articleshow/120636742.cms",
    "timestamp": "2025-04-26T04:21:02Z"
  },
  {
    "title": "\"Worsening Climate Of Fear\" For Pak Minorities: US Religious Freedom Body",
    "description": "Finding &quot;a worsening religious and political climate of fear, intolerance, and violence&quot; for minorities in Pakistan, US Commission on International Religious Freedom has asked Trump&#039;s administration to take strong measures against Islamic Repub…",
    "link": "https://www.ndtv.com/world-news/worsening-climate-of-fear-for-pak-minorities-us-religious-freedom-body-uscirf-8259864",
    "timestamp": "2025-04-26T04:20:56Z"
  },
  {
    "title": "Bill Maher Jokes Pope Francis Survived a 38-Day Hospital Stay Only to Be ‘Keeled Right Over’ by JD Vance",
    "description": "The “Real Time” host also says that Donald Trump’s first 100 days proves “time flies when you’re in the fetal position”\nThe post Bill Maher Jokes Pope Francis Survived a 38-Day Hospital Stay Only to Be ‘Keeled Right Over’ by JD Vance appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bill-maher-pope-francis-monologue-real-time-hbo/",
    "timestamp": "2025-04-26T04:16:14Z"
  },
  {
    "title": "Iran, US to resume talks in Oman to narrow gaps over new nuclear deal",
    "description": "These talks come a week after a second round of negotiations in Rome, which both sides described as constructive.",
    "link": "https://www.jpost.com/breaking-news/article-851562",
    "timestamp": "2025-04-26T04:14:15Z"
  },
  {
    "title": "Pete Hegseth Fired Up After Learning Obesity Rate Among Reserve Troops: ‘FIT, not FAT’",
    "description": "President Donald Trump’s administration has declared war on those who declared war on American citizens. After all, among other things, the Trump administration values freedom, security, merit, and health. And those who declared war on American citizens did s…",
    "link": "https://freerepublic.com/focus/f-news/4313344/posts",
    "timestamp": "2025-04-26T04:11:01Z"
  },
  {
    "title": "Big Tech's soaring energy demands are making coal-fired power plant sites attractive",
    "description": "Coal-fired power plants, long a money-losing proposition in the U.S., are becoming more valuable now.",
    "link": "https://www.clickorlando.com/news/politics/2025/04/26/big-techs-soaring-energy-demands-are-making-coal-fired-power-plant-sites-attractive/",
    "timestamp": "2025-04-26T04:09:14Z"
  },
  {
    "title": "Jeffrey Epstein accuser Virginia Giuffre dies by suicide, her family says",
    "description": "(Reuters) -Virginia Giuffre, one of the late sex offender Jeffrey Epstein's most prominent accusers, has committed suicide, her family said on Friday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/26/jeffrey-epstein-accuser-virginia-giuffre-dies-by-suicide-her-family-says",
    "timestamp": "2025-04-26T04:09:00Z"
  },
  {
    "title": "Iran, US to resume talks in Oman to narrow gaps over new nuclear deal",
    "description": "MUSCAT (Reuters) - Top Iranian and U.S. negotiators will meet again on Saturday to hammer out a new deal curbing Tehran's advancing nuclear programme, while U.S. President Donald Trump signalled confidence in clinching a new pact that would block Iran's path …",
    "link": "https://www.thestar.com.my/news/world/2025/04/26/iran-us-to-resume-talks-in-oman-to-narrow-gaps-over-new-nuclear-deal",
    "timestamp": "2025-04-26T04:08:00Z"
  },
  {
    "title": "Big Techs soaring energy demands are making coal-fired power plant sites attractive",
    "description": "Big Tech's soaring energy demands are making coal-fired power plant sites attractive",
    "link": "https://www.livemint.com/industry/big-techs-soaring-energy-demands-are-making-coal-fired-power-plant-sites-attractive-11745640446982.html",
    "timestamp": "2025-04-26T04:07:26Z"
  },
  {
    "title": "Indian army says new exchange of gunfire with Pakistan",
    "description": "Indian and Pakistani troops exchanged gunfire overnight in contested Kashmir for a second day running, the Indian army said Saturday, following a deadly shooting that New Delhi blames its arch-rival. Relations have plunged to their lowest level in years, with…",
    "link": "https://www.digitaljournal.com/world/indian-army-says-new-exchange-of-gunfire-with-pakistan/article",
    "timestamp": "2025-04-26T04:07:20Z"
  },
  {
    "title": "Indian Army Says New Exchange Of Gunfire With Pakistan",
    "description": "Indian and Pakistani troops exchanged gunfire overnight in contested Kashmir for a second day running, the Indian army said Saturday, following a deadly shooting that New Delhi blames its arch-rival.",
    "link": "https://www.ibtimes.com/indian-army-says-new-exchange-gunfire-pakistan-3771484",
    "timestamp": "2025-04-26T04:06:11Z"
  },
  {
    "title": "Pope Francis funeral: Mass underway in Vatican City",
    "description": "Pope Francis died on April 21, 2025. Many world leaders are expected to attend his funeral in Vatican City, including President Donald Trump, Prince William, and President Volodymyr Zelensky.",
    "link": "https://www.foxnews.com/live-news/pope-francis-funeral-vatican-city",
    "timestamp": "2025-04-26T04:05:50Z"
  },
  {
    "title": "Trump’s Fourth Greatest Betrayal so Far — And Pete Hegseth",
    "description": "The title of this column on April 3 was Trump’s Three Greatest Betrayals So Far.  Today, I’m highlighting Trump’s fourth greatest betrayal so far. And, given the fact that we are only three months into Trump’s second term, there are doubtless many more betray…",
    "link": "https://www.lewrockwell.com/2025/04/chuck-baldwin/trumps-fourth-greatest-betrayal-so-far-and-pete-hegseth/",
    "timestamp": "2025-04-26T04:01:00Z"
  },
  {
    "title": "HHS – a Billy Club Enforcing Allegiance to the Israel Government",
    "description": "Supporters of liberty had much reason for hope due to Robert F. Kennedy, Jr. becoming secretary of the Department of Health and Human Services (HHS). This man’s tenacity and eloquence in challenging the coronavirus crackdowns suggested great potential accompl…",
    "link": "https://www.lewrockwell.com/2025/04/no_author/hhs-a-billy-club-enforcing-allegiance-to-the-israel-government/",
    "timestamp": "2025-04-26T04:01:00Z"
  },
  {
    "title": "Meloni basks in glow of Francis’ funeral",
    "description": "A quiet word with a president, or even the opportunity to broker a first encounter between Trump and von der Leyen, could offer Meloni exactly what she’s seeking: recognition as a mediator within the West.",
    "link": "https://www.euractiv.com/section/politics/news/melonis-hosting-skills-test-outside-st-peters-basilica/",
    "timestamp": "2025-04-26T04:00:20Z"
  },
  {
    "title": "Maybe woke has been \"berry berry bad\" to me?",
    "description": "Watch the Democrats trying to clean up what took years to mess up.",
    "link": "https://www.americanthinker.com/blog/2025/04/maybe_woke_has_been_berry_berry_bad_to_me.html",
    "timestamp": "2025-04-26T04:00:00Z"
  },
  {
    "title": "‘Harvard people’ squaring up for battle royale with White House over politics, power and privilege",
    "description": "Trump is threatening to withdraw billions in funding from the ivy league college, but can Harvard withstand this attack on its status?",
    "link": "https://www.irishtimes.com/world/us/2025/04/26/harvard-people-squaring-up-for-battle-royale-with-white-house-over-politics-power-and-privilege/",
    "timestamp": "2025-04-26T04:00:00Z"
  },
  {
    "title": "Trump’s First 100 Days: A Scorecard of Wins, Waits, and Wobbles",
    "description": "As President Donald Trump’s second term barrels past the 100-day mark (April 30th, 2025), conservatives across America are taking stock of a presidency that’s hit the ground running with bold moves, yet left some promises on the sidelines...",
    "link": "https://www.americanthinker.com/articles/2025/04/trump_s_first_100_days_a_scorecard_of_wins_waits_and_wobbles.html",
    "timestamp": "2025-04-26T04:00:00Z"
  },
  {
    "title": "There’s been an official ‘War on Whiteness’ by groups such as HHS and others",
    "description": "The Washington Free Beacon has a story titled “Top Corporations Fund Former Obama Official Calling To ‘Wage War on Whiteness.” It reminds us that DEI won’t go down without a fight, but go down it will, eventually. It is very m...",
    "link": "https://www.americanthinker.com/blog/2025/04/there_s_been_an_official_war_on_whiteness_by_groups_such_as_hhs_and_others.html",
    "timestamp": "2025-04-26T04:00:00Z"
  },
  {
    "title": "Ugly details rolling out on just what the Milwaukee judge did hands hyperventilating Democrats another losing cause",
    "description": "Democrats and their media allies have been having a royal cow over the arrest of a circuit judge in Milwaukee, allegedly for helping an illegal alien escape deportation from her courtroom.\r\n\r\nAccording to CNBC:\r\n\r\n\r\nThe actions against judges mark a ...",
    "link": "https://www.americanthinker.com/blog/2025/04/ugly_details_rolling_out_on_just_what_the_milwaukee_judge_did_hands_hyperventilating_democrats_another_losing_cause.html",
    "timestamp": "2025-04-26T04:00:00Z"
  },
  {
    "title": "'We Are Really Polite People' - Russian Lavrov",
    "description": "Russian Foreign Minister Sergey Lavrov said Russia does not plan to make public the details of the talks with the United States on the Ukrainian settlement until their official completion.",
    "link": "https://sputnikglobe.com/20250426/we-are-really-polite-people---russian-lavrov-1121933305.html",
    "timestamp": "2025-04-26T03:59:00Z"
  },
  {
    "title": "Sen. Jon Ossoff signals support for Trump impeachment",
    "description": "Sen. Jon Ossoff, D-Ga., signaled support for impeaching President Donald Trump during a town hall he hosted near Atlanta on Friday, telling attendees that the president's conduct \"has already exceeded any prior standard for impeachment.\"",
    "link": "https://www.nbcnews.com/politics/congress/sen-jon-ossoff-signals-support-trump-impeachment-rcna203126",
    "timestamp": "2025-04-26T03:58:56Z"
  },
  {
    "title": "Pope Francis' Funeral Today, What Happens When",
    "description": "Pope Francis&#039;s wooden and zinc coffin, sealed on Friday evening, will be placed in front of the basilica before a temporary raised altar.",
    "link": "https://www.ndtv.com/world-news/pope-francis-funeral-in-vatican-today-to-be-buried-in-santa-maria-maggiore-basilica-what-happens-when-8259728",
    "timestamp": "2025-04-26T03:56:09Z"
  },
  {
    "title": "Trump's meme coin dinner contest earns insiders $900,000 in two days",
    "description": "WASHINGTON — President Donald Trump and his allies have raked in nearly $900,000 in trading fees over the past two days from the president’s $TRUMP cryptocurrency token, according to Chainalysis, a blockchain data company.\nThe surge came after a Wednesday ann…",
    "link": "https://biztoc.com/x/d8f67c7ce5790b62",
    "timestamp": "2025-04-26T03:55:06Z"
  },
  {
    "title": "Two-Year-Old U.S. Citizen Appears To Have Been Deported 'With No Meaningful Process'",
    "description": "The Trump administration appeared to have deported a 2-year-old U.S. citizen \"with no meaningful process,\" a federal judge said on Friday.",
    "link": "https://www.huffpost.com/entry/two-year-old-us-citizen-deported_n_680c5751e4b04560cabe7801",
    "timestamp": "2025-04-26T03:54:57Z"
  },
  {
    "title": "Two-year-old US citizen appears to have been deported 'with no meaningful process'",
    "description": "A US court is hearing the case of a two-year-old American citizen. The Trump administration allegedly deported the child to Honduras with her mother. The father claims the deportation was illegal. Prosecutors argue the mother wanted to retain custody. The ACL…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/two-year-old-us-citizen-appears-to-have-been-deported-with-no-meaningful-process/articleshow/120636379.cms",
    "timestamp": "2025-04-26T03:51:55Z"
  },
  {
    "title": "Elon Musk Is $122 Billion Poorer In 2025, And Still Richer Than Bezos, Huang, Cuban Combined",
    "description": "Tesla Inc (NASDAQ:TSLA) stock ended 2024 on a high note with shares hitting all-time highs in December, helping boost the wealth of CEO Elon Musk. The start ...",
    "link": "https://finance.yahoo.com/news/elon-musk-122-billion-poorer-034625403.html",
    "timestamp": "2025-04-26T03:46:25Z"
  },
  {
    "title": "\"Busy\" Trump Treats Melania To Birthday Dinner Aboard Air Force One",
    "description": "US President Donald Trump said he has been too busy to buy First Lady Melania a present for her 55th birthday on Saturday, so he is treating her to a romantic dinner on Air Force One instead.",
    "link": "https://www.ndtv.com/world-news/donald-trump-is-busy-treats-melania-trump-to-birthday-dinner-aboard-air-force-one-8259675",
    "timestamp": "2025-04-26T03:42:54Z"
  },
  {
    "title": "Two-year-old US citizen appears to have been deported 'with no meaningful process'",
    "description": "WASHINGTON (Reuters) - The Trump administration appeared to have deported a 2-year-old U.S. citizen \"with no meaningful process,\" a federal judge said on Friday, as the child's father sought to have her returned to the United States. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/26/two-year-old-us-citizen-appears-to-have-been-deported-039with-no-meaningful-process039",
    "timestamp": "2025-04-26T03:42:00Z"
  },
  {
    "title": "Donald Trump's heartwarming gesture to young boy on his birthday",
    "description": "Former US President Donald Trump has been praised online for a heartwarming gesture to a young boy. On Thursday, a video of a boy named Liam was posted to X, which featured the child receiving a birthday letter from Trump. According to the X account user who …",
    "link": "https://freerepublic.com/focus/f-chat/4313337/posts",
    "timestamp": "2025-04-26T03:40:47Z"
  },
  {
    "title": "Deported 2-Year-Old May Not Have Had 'Meaningful' Legal Process: Judge",
    "description": "District Judge Terry Doughty, a Trump appointee, ordered a follow-up hearing, saying the court is suspicious the government deported a U.S. citizen.",
    "link": "https://www.newsweek.com/deported-2-year-old-may-not-have-had-meaningful-legal-process-judge-2064479",
    "timestamp": "2025-04-26T03:38:33Z"
  },
  {
    "title": "Apple flees China, eyes India for US iPhone assembly",
    "description": "According to the FT, the US accounted for 28 per cent of Job\u0092s Mob\u0092s 232.1 million global iPhone shipments in 2024. But Donald Trump\u0092s \u0093reciprocal\u0094 tariffs\u0097some topping 100 per cent\u0097have already wiped $700 billion off Apple\u0092s market value, prompting a hasty r…",
    "link": "http://www.madshrimps.be/news/item/238875",
    "timestamp": "2025-04-26T03:35:37Z"
  },
  {
    "title": "Jeffrey Epstein accuser Virginia Giuffre dies by 'suicide'",
    "description": "WESTERN AUSTRALIA - Virginia Giuffre, one of the late sex offender Jeffrey Epstein's most prominent accusers, has committed suicide, her family said on Friday.",
    "link": "https://www.bangkokpost.com/world/3011760/jeffrey-epstein-accuser-virginia-giuffre-dies-by-suicide-her-family-says",
    "timestamp": "2025-04-26T03:33:00Z"
  },
  {
    "title": "‘Real Time’: Bill Maher Continues Denouncing Nazi Comparisons: “A Hard Word To Use With Nuance”",
    "description": "Bill Maher is standing his ground over dining with Donald Trump after recent Nazi comparisons. On Friday’s episode of Real Time, the comedian went on a tangent about taking “some shit from the ‘looney left'” over his dinner with Trump, referencing Larry David…",
    "link": "http://deadline.com/2025/04/real-time-bill-maher-denouncing-nazi-comparisons-1236377586/",
    "timestamp": "2025-04-26T03:28:49Z"
  },
  {
    "title": "Patrick Mahomes Sends One-Word Message as Shedeur Sanders Continues to Fall in NFL Draft",
    "description": "Patrick Mahomes appeared to react to Shedeur Sanders slipping in the NFL Draft.",
    "link": "https://www.newsweek.com/sports/nfl/patrick-mahomes-sends-one-word-message-shedeur-sanders-continues-fall-nfl-draft-2064490",
    "timestamp": "2025-04-26T03:28:42Z"
  },
  {
    "title": "US State Department appoints new top official for Europe",
    "description": "Brendan Hanrahan — who comes with private sector experience — has replaced senior foreign service member Louis Bono as the head of the US State Department's Europe bureau.",
    "link": "https://www.dw.com/en/us-state-department-appoints-new-top-official-for-europe/a-72358689",
    "timestamp": "2025-04-26T03:27:00Z"
  },
  {
    "title": "Shedeur Sanders goes undrafted through first three rounds of NFL Draft in historically shocking slide",
    "description": "Shedeur Sanders was passed on by all 32 NFL teams in the first three rounds of the Draft, marking one of the most shocking slides in league history",
    "link": "https://www.foxnews.com/sports/shedeur-sanders-goes-undrafted-through-first-three-rounds-nfl-draft-historically-shocking-slide",
    "timestamp": "2025-04-26T03:23:27Z"
  },
  {
    "title": "2-year-old U.S. citizen apparently deported 'with no meaningful process,' judge says",
    "description": "A federal judge in Louisiana on Friday said that a 2-year-old U.S. citizen appears to have been deported with her mother to Honduras with no meaningful due process.",
    "link": "https://www.nbcnews.com/news/us-news/2-year-old-us-citizen-apparently-deported-no-meaningful-process-judge-rcna203124",
    "timestamp": "2025-04-26T03:21:47Z"
  },
  {
    "title": "Jeffrey Epstein accuser Virginia Giuffre dies by suicide, her family says",
    "description": "Giuffre, 41, died on Friday in Western Australia state, where she had been living for several years, the family said in an emailed statement.",
    "link": "https://www.jpost.com/breaking-news/article-851560",
    "timestamp": "2025-04-26T03:19:46Z"
  },
  {
    "title": "Trump Says 'Most Major Point' on Ukraine Agreed",
    "description": "US President Donald Trump has called on Russia and Ukraine to hold high-level talks to conclude a peace deal, with \"major points\" already agreed to.",
    "link": "https://sputnikglobe.com/20250426/trump-says-most-major-point-on-ukraine-agreed-1121933019.html",
    "timestamp": "2025-04-26T03:19:00Z"
  },
  {
    "title": "Trump says Russia and Ukraine are ‘very close to a deal’",
    "description": "WASHINGTON DC: US President Donald Trump has stated that Russia and Ukraine are “very close to a deal,” following talks between his envoy Steve Witkoff and Russian President Vladimir Putin in Moscow. Trump described the day as “good” for negotiations, while t…",
    "link": "https://english.khabarhub.com/2025/26/461484/",
    "timestamp": "2025-04-26T03:15:00Z"
  },
  {
    "title": "'We have more in common with America than the rest of Canada'",
    "description": "In Alberta, many voters feel alienated by the country’s elite - some are even tempted by Trump’s call to join the US.",
    "link": "https://www.bbc.com/news/articles/cgkg8r85n1eo",
    "timestamp": "2025-04-26T03:08:50Z"
  },
  {
    "title": "Every Quarterback Taken Ahead of Shedeur Sanders in 2025 NFL Draft",
    "description": "Shedeur Sanders has shockingly slid way down the draft boards.",
    "link": "https://www.newsweek.com/sports/nfl/every-quarterback-taken-ahead-shedeur-sanders-2025-nfl-draft-2064486",
    "timestamp": "2025-04-26T03:07:35Z"
  },
  {
    "title": "North Korean leader Kim touts new naval destroyer, blames US for tensions",
    "description": "North Korean leader Kim Jong Un has unveiled a new naval destroyer, claiming it as a significant advancement towards his goal of expanding the operational range and preemptive strike capabilities of his nuclear-armed military",
    "link": "https://abcnews.go.com/International/wireStory/north-korean-leader-kim-touts-new-naval-destroyer-121182708",
    "timestamp": "2025-04-26T03:02:35Z"
  },
  {
    "title": "Shedeur Sanders Speaks Out After Plummeting in 3rd Round of 2025 NFL Draft",
    "description": "Colorado Buffaloes quarterback Shedeur Sanders has spoken out after plummeting in the third round of the 2025 NFL Draft.",
    "link": "https://www.newsweek.com/sports/nfl/shedeur-sanders-speaks-out-after-plummeting-3rd-round-2025-nfl-draft-2064484",
    "timestamp": "2025-04-26T03:00:09Z"
  },
  {
    "title": "Pope Francis's coffin brought to final resting place",
    "description": "Francis is being laid to rest in the St. Mary Major Basilica in Rome. Security has been tightened in Rome as world leaders attend the funeral ceremonies. DW has the latest. Hundreds of thousands of people flocked to St. Peter's Square for the funeral and buri…",
    "link": "https://www.dw.com/en/pope-francis-coffin-brought-to-final-resting-place/live-72358639",
    "timestamp": "2025-04-26T03:00:00Z"
  },
  {
    "title": "Pope Francis: Funeral for late pontiff begins in Vatican",
    "description": "A heavy security presence grips Rome, as funeral services for Pope Francis get underway. Follow DW. Hundreds of thousands of people flocked to St. Peter's Square for the funeral mass for Pope Francis, that has begun with a choir singing introductory rites.\n\nS…",
    "link": "https://www.dw.com/en/pope-francis-funeral-for-late-pontiff-begins-in-vatican/live-72358639",
    "timestamp": "2025-04-26T03:00:00Z"
  },
  {
    "title": "Trump Admin Scraps Plan to Limit Salmonella in Poultry",
    "description": "The Trump admin is rolling back a proposal that would have required poultry companies to limit salmonella bacteria to prevent food poisoning.",
    "link": "http://www.rollingstone.com/politics/politics-news/usda-salmonella-poultry-withdraw-biden-plan-1235325722/",
    "timestamp": "2025-04-26T02:58:13Z"
  },
  {
    "title": "Trump Can't Stop Contradicting Himself On His Own Tariff Plans",
    "description": "President Donald Trump can’t stop contradicting himself on his own tariff plans.",
    "link": "https://www.huffpost.com/entry/us-trump-tariffs_n_680c4978e4b0bc195799d597",
    "timestamp": "2025-04-26T02:56:46Z"
  },
  {
    "title": "‘Who Killed What?’ Trump Appears Unaware That Senior Russian General Was Killed in Car Bombing",
    "description": "President Donald Trump seemed not to know that a senior Russian general had been killed in a car bombing in Moscow several hours earlier.\nThe post ‘Who Killed What?’ Trump Appears Unaware That Senior Russian General Was Killed in Car Bombing first appeared on…",
    "link": "https://www.mediaite.com/trump/who-killed-what-trump-appears-unaware-that-senior-russian-general-was-killed-in-car-bombing/",
    "timestamp": "2025-04-26T02:49:43Z"
  },
  {
    "title": "Keeler: Shedeur Sanders’ NFL draft slide proves there’s one game Deion Sanders can’t change: The NFL",
    "description": "Donald Trump is angry. Buffs fans are confused. The Browns passed on drafting CU Buffs star Shedeur Sanders four times. What happened?",
    "link": "https://www.denverpost.com/2025/04/25/shedeur-sanders-nfl-draft-slide-day-2/",
    "timestamp": "2025-04-26T02:48:20Z"
  },
  {
    "title": "Francis’s funeral to be grand farewell to ‘pope of the poor’",
    "description": "Pope Francis, champion of the poor and the Church’s first Latin American leader, will be honoured Saturday with a funeral attended by world leaders and tens of thousands of Catholic faithful. The Argentine pontiff, who died on Monday aged 88, sought to create…",
    "link": "https://www.digitaljournal.com/world/franciss-funeral-to-be-grand-farewell-to-pope-of-the-poor/article",
    "timestamp": "2025-04-26T02:42:20Z"
  },
  {
    "title": "Trump's Deportation Policies Could Worsen Social Security's Funding Shortfall by 11%, Warns New Report",
    "description": "President Donald Trump‘s immigration policies could worsen Social Security’s existing funding shortfall by approximately 11%, according to a new report from ...",
    "link": "https://finance.yahoo.com/news/trumps-deportation-policies-could-worsen-023745915.html",
    "timestamp": "2025-04-26T02:37:45Z"
  },
  {
    "title": "North Korean leader Kim Jong Un touts new naval destroyer, blames US for tensions",
    "description": "North Korean leader Kim Jong Un showed a new warship. He said it improves his military's attack range. The ship launch happened at Nampo port. Kim sees this as a response to US and South Korean military drills. He plans to build a nuclear submarine next. The …",
    "link": "https://economictimes.indiatimes.com/news/defence/north-korean-leader-kim-jong-un-touts-new-naval-destroyer-blames-us-for-tensions/articleshow/120635747.cms",
    "timestamp": "2025-04-26T02:36:37Z"
  },
  {
    "title": "Trump says if the US still has high tariffs a year from now, it would be a 'total victory'",
    "description": "President Donald Trump said high tariffs a year from now would be a \"total victory\" because it would incentivize companies to produce in US.",
    "link": "https://www.businessinsider.com/trump-high-tariffs-year-from-now-would-be-total-victory-2025-4",
    "timestamp": "2025-04-26T02:34:05Z"
  },
  {
    "title": "‘Pulled The Trigger Too Fast’: Turley Says One Case Shows How Far Judges Will Go To Undermine Trump’s Authority",
    "description": "Turley said a federal judge temporarily blocking one of Trump’s eo on federal funds is one of the most \"problematic\" cases challenging his authority.",
    "link": "https://dailycaller.com/2025/04/25/jonathan-turley-cases-deportation-illegal-migrants-judges/",
    "timestamp": "2025-04-26T02:33:47Z"
  },
  {
    "title": "Shedeur Sanders prank-called during NFL Draft slide by imposter: 'Have to wait a little longer'",
    "description": "Shedeur Sanders fell victim to an ill-timed prank call during his dramatic fall in the NFL Draft, and the world watched while he livestreamed the whole thing.",
    "link": "https://www.foxnews.com/sports/shedeur-sanders-prank-called-during-nfl-draft-slide-imposter-have-wait-little-longer",
    "timestamp": "2025-04-26T02:33:19Z"
  },
  {
    "title": "Japan to resist Trump efforts to form trade bloc against China",
    "description": "Any demands from Washington on Tokyo to downgrade its economic relationship with China would potentially deal Japan a major economic blow.",
    "link": "https://www.japantimes.co.jp/business/2025/04/26/economy/japan-china-trade-ties-us/",
    "timestamp": "2025-04-26T02:30:00Z"
  },
  {
    "title": "Japan to resist Trump efforts to form trade bloc against China",
    "description": "Any demands from Washington on Tokyo to downgrade its economic relationship with China would potentially deal Japan a major economic blow.",
    "link": "https://www.japantimes.co.jp/news/2025/04/26/japan/politics/japan-china-trade-ties-us/",
    "timestamp": "2025-04-26T02:30:00Z"
  },
  {
    "title": "Francis's Funeral To Be Grand Farewell To 'Pope Of The Poor'",
    "description": "Pope Francis, champion of the poor and the Church's first Latin American leader, will be honoured Saturday with a funeral attended by world leaders and tens of thousands of Catholic faithful.",
    "link": "https://www.ibtimes.com/franciss-funeral-grand-farewell-pope-poor-3771479",
    "timestamp": "2025-04-26T02:27:24Z"
  },
  {
    "title": "Francis's Funeral To Be Grand Farewell To 'Pope Of The Poor'",
    "description": "Pope Francis, champion of the poor and the Church's first Latin American leader, will be honoured Saturday with a funeral attended by world leaders and tens of thousands of Catholic faithful.",
    "link": "https://www.ibtimes.com.au/franciss-funeral-grand-farewell-pope-poor-1858263",
    "timestamp": "2025-04-26T02:27:23Z"
  },
  {
    "title": "In reversal, US Justice Department says media records can be seized in leak probes (Reuters)",
    "description": "Reuters:\nIn reversal, US Justice Department says media records can be seized in leak probes  —  The U.S. Justice Department under President Donald Trump made it easier for prosecutors investigating leaks to the news media to subpoena records and testimony fro…",
    "link": "https://www.memeorandum.com/250425/p160",
    "timestamp": "2025-04-26T02:20:03Z"
  },
  {
    "title": "Economic Digest: Nepal’s Business News in a Snap",
    "description": "KATHMANDU: Economic Digest offers a concise yet comprehensive overview of significant business happenings in Nepal, presented in easily digestible summaries. The compiled reports reflect a broad spectrum of Nepal’s economic and governance dynamics, highlighti…",
    "link": "https://english.khabarhub.com/2025/26/461412/",
    "timestamp": "2025-04-26T02:15:42Z"
  },
  {
    "title": "Over 1,000 attend Chesterfield town hall led by prominent Democrat in Ann Wagner’s district",
    "description": "A Democrat-organized town hall in Chesterfield featured U.S. Chris Murphy of Connecticut, a leading critic of the Trump administration.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_d7a248de-6c75-4002-ac91-58b01ec128a6.html",
    "timestamp": "2025-04-26T02:15:00Z"
  },
  {
    "title": "Live Updates: Donald Trump Says Pahalgam Attack \"Was A Bad One\"",
    "description": "Pahalgam terror attack updates: Tensions between India and Pakistan have soared after a terror attack in Jammu and Kashmir left 26 people dead this week.",
    "link": "https://www.ndtv.com/india-news/pahalgam-terrorist-attack-live-updates-baisaran-pm-narendra-modi-jammu-and-kashmir-india-pakistan-tensions-donald-trump-8259292",
    "timestamp": "2025-04-26T02:14:20Z"
  },
  {
    "title": "President Trump Angry Shedeur Sanders Keeps Sliding In The NFL Draft",
    "description": "President Trump is not happy Shedeur Sanders keeps falling in the NFL draft. On Thursday night, Sanders was not selected in the first round of the NFL draft, which came as a surprise to him. “We all didn’t expect this, of course, but I feel like with God, any…",
    "link": "https://brobible.com/sports/article/president-trump-angry-shedeur-sanders-keeps-sliding-in-the-nfl-draft/",
    "timestamp": "2025-04-26T02:11:59Z"
  },
  {
    "title": "Judge temporarily blocks Trump order ending collective bargaining rights for most federal workers",
    "description": "A Trump administration executive order that would strip most federal workers of union protections was temporarily blocked a federal judge on Friday.",
    "link": "https://www.foxnews.com/politics/judge-temporarily-blocks-trump-order-ending-collective-bargaining-rights-most-federal-workers",
    "timestamp": "2025-04-26T02:11:28Z"
  },
  {
    "title": "Iran, US to hold new round of high-level nuclear talks",
    "description": "The United States and Iran were to hold a fresh round of technical and high-level nuclear negotiations in Oman on Saturday, after both sides reported progress in previous meetings. Iran’s Foreign Minister Abbas Araghchi, leading Tehran’s delegation, arrived i…",
    "link": "https://www.digitaljournal.com/world/iran-us-to-hold-new-round-of-high-level-nuclear-talks/article",
    "timestamp": "2025-04-26T02:07:20Z"
  },
  {
    "title": "Iran, US To Hold New Round Of High-level Nuclear Talks",
    "description": "The United States and Iran were to hold a fresh round of technical and high-level nuclear negotiations in Oman on Saturday, after both sides reported progress in previous meetings.",
    "link": "https://www.ibtimes.com.au/iran-us-hold-new-round-high-level-nuclear-talks-1858261",
    "timestamp": "2025-04-26T02:06:18Z"
  },
  {
    "title": "Pahalgam Terror Attack: Pakistan violates ceasefire along LoC in Kashmir, Indian army responds appropriately",
    "description": "Tensions have spiked between India and Pakistan following a deadly terrorist attack in Pahalgam, Kashmir, that killed 26 people. As New Delhi blames terrorists for the assault, the two nuclear-armed nations have exchanged small-arms fire along the Line of Con…",
    "link": "https://economictimes.indiatimes.com/news/defence/pahalgam-terror-attack-pakistan-violates-ceasefire-along-loc-in-kashmir-indian-army-responds-appropriately/articleshow/120634683.cms",
    "timestamp": "2025-04-26T02:06:17Z"
  },
  {
    "title": "Elon Musk’s XAI Holdings is in discussions to raise $20 billion",
    "description": "Announced in March, XAI Holdings was created from the combination of X, formerly Twitter, and Musk’s AI venture, xAI. The new funding could be used to pay down some of the debt that Musk took on when he converted Twitter into a private company, later renaming…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/elon-musks-xai-holdings-is-in-discussions-to-raise-20-billion/articleshow/120634989.cms",
    "timestamp": "2025-04-26T02:06:15Z"
  },
  {
    "title": "Iran, US To Hold New Round Of High-level Nuclear Talks",
    "description": "The United States and Iran were to hold a fresh round of technical and high-level nuclear negotiations in Oman on Saturday, after both sides reported progress in previous meetings.",
    "link": "https://www.ibtimes.com/iran-us-hold-new-round-high-level-nuclear-talks-3771476",
    "timestamp": "2025-04-26T02:06:12Z"
  },
  {
    "title": "Trump Says Kilmar Garcia Returning to US Courtroom 'Wouldn't Bother Me'",
    "description": "Trump says that his administration is not defying a Supreme Court order requiring they \"facilitate\" Abrego Garcia's return.",
    "link": "https://www.newsweek.com/trump-says-kilmar-garcia-returning-us-courtroom-wouldnt-bother-me-2064475",
    "timestamp": "2025-04-26T02:05:30Z"
  },
  {
    "title": "Ferrari, Rolls-Royce, And Bentley Prices Are About To Soar As 25% Tariff Sends Shockwaves Through U.S. Luxury Car Market",
    "description": "",
    "link": "https://www.benzinga.com/personal-finance/25/04/45024801/ferrari-rolls-royce-and-bentley-prices-are-about-to-soar-as-25-tariff-sends-shockwaves-through-u-s-luxury-car-market",
    "timestamp": "2025-04-26T02:04:30Z"
  },
  {
    "title": "John Kerry bristles as MSNBC host points out Russia took Crimea on his watch under Obama",
    "description": "MSNBC's Chris Jansing spoke with Kerry from inside the Vatican on Friday ahead of Pope Francis' Saturday funeral.",
    "link": "https://nypost.com/2025/04/25/us-news/john-kerry-bristles-as-msnbc-host-points-out-russia-took-crimea-on-his-watch-under-obama/",
    "timestamp": "2025-04-26T02:03:24Z"
  },
  {
    "title": "NO ONE IS ABOVE THE LAW: Democrats Haunted by Their Own Words as They Freak Out About Arrest of Activist Judges",
    "description": "Democrats are grappling with the implications of their own rhetoric as they react to the arrest of two activist judges. This situation raises critical questions about the consistency of their stance on the rule of law.\nThe post NO ONE IS ABOVE THE LAW: Democr…",
    "link": "https://www.thegatewaypundit.com/2025/04/no-one-is-above-law-democrats-haunted-their/",
    "timestamp": "2025-04-26T02:00:44Z"
  },
  {
    "title": "Donald Trump blasts ‘stupid’ NFL owners for passing on Shedeur Sanders",
    "description": "Mel Kiper is hardly the biggest name in Shedeur Sanders’ corner. Donald Trump himself blasted teams for passing on Sanders in the first round of the 2025 NFL Draft in a Truth Social post on Friday in which the Commander-in-Chief praised his father, football g…",
    "link": "https://freerepublic.com/focus/f-chat/4313326/posts",
    "timestamp": "2025-04-26T02:00:17Z"
  }
]