[
  {
    "title": "Oil climbs as tensions flare in Europe, Middle East",
    "description": "Oil prices gained today supported by geopolitical tensions in Europe and the Middle East, although the prospect of more oil supply and concerns about the impact of trade tariffs on global fuel demand weighed.",
    "link": "https://www.rte.ie/news/business/2025/0922/1534678-world-oil-prices/",
    "timestamp": "2025-09-22T09:18:42Z"
  },
  {
    "title": "Could Jimmy Kimmel Sue Donald Trump After Being 'Canceled'? What To Know",
    "description": "Kimmel's suspension raises First Amendment stakes over the president's role in pressuring media voices.",
    "link": "https://biztoc.com/x/f7c51067f1904ea6",
    "timestamp": "2025-09-22T09:17:09Z"
  },
  {
    "title": "Trump’s Show of Force",
    "description": "The deployment of federal troops to US cities is the political equivalent of a lit fuse, increasing the likelihood of an incident – a service member’s suicide, a friendly-fire incident, the shooting of a protester – that can be used to manufacture some greate…",
    "link": "https://www.project-syndicate.org/commentary/trump-military-deployments-in-us-cities-by-timothy-snyder-2025-09",
    "timestamp": "2025-09-22T09:15:37Z"
  },
  {
    "title": "John Oliver says ‘history will remember the cowards’ as he slams Disney CEO over Kimmel suspension",
    "description": "‘Last Week Tonight’ host said ‘at some point you’re going to have to draw a line’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/john-oliver-bob-iger-jimmy-kimmel-b2831074.html",
    "timestamp": "2025-09-22T09:12:24Z"
  },
  {
    "title": "JPMorgan sees D-Street building on record levels of IPO activity",
    "description": "The volume of Indian initial public offerings is poised to grow as companies and private equity firms monetize their investments, according Anu Aiyengar, global head of advisory and M&A at JPMorgan Chase & Co.",
    "link": "https://economictimes.indiatimes.com/markets/ipos/fpos/jpmorgan-sees-d-street-building-on-record-levels-of-ipo-activity/articleshow/124043359.cms",
    "timestamp": "2025-09-22T09:09:07Z"
  },
  {
    "title": "Could Jimmy Kimmel Sue Donald Trump After Being 'Canceled'? What To Know",
    "description": "Kimmel's suspension raises First Amendment stakes over the president's role in pressuring media voices.",
    "link": "https://www.newsweek.com/could-jimmy-kimmel-sue-donald-trump-canceled-what-know-2133521",
    "timestamp": "2025-09-22T09:08:32Z"
  },
  {
    "title": "Trump’s plan to charge $100,000 for new H-1B visas is met with dismay by CEOs who want the world’s top talent",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/09/22/trump-plan-100000-h-1b-visas-ceos/",
    "timestamp": "2025-09-22T09:06:57Z"
  },
  {
    "title": "Qatar to Discuss 'New Threat Perception' of Israel with Trump: PM Adviser",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA senior Qatari official has told Newsweek that the nation and its fellow Gulf Cooperation Council (GCC) partners were planning to convey to President Donald Trump a drastic change in regional views toward Isr…",
    "link": "https://biztoc.com/x/5379c2d9e42d2e1d",
    "timestamp": "2025-09-22T09:06:14Z"
  },
  {
    "title": "Trump White House’s UFC Fight Picture Preview Gets A Pounding From Critics",
    "description": "\"Thank god they are focused on the priorities of all Americans,\" California governor Gavin Newsom snarked at the renderings.",
    "link": "https://www.huffpost.com/entry/white-house-ufc_n_68d10692e4b00815ca13039f",
    "timestamp": "2025-09-22T09:05:01Z"
  },
  {
    "title": "Preachers, politicians hail Charlie Kirk’s legacy at Buck Motorsports vigil",
    "description": "About 1,500 people attended a vigil for slain conservative political activist Charlie Kirk at the Buck Motorsports Complex in Providence Township on Sunday night, focused on celebrating Kirk’s Christian faith and how it influenced his work as a political orga…",
    "link": "https://lancasteronline.com/news/local/preachers-politicians-hail-charlie-kirk-s-legacy-at-buck-motorsports-vigil/article_2af61308-a1aa-465b-9951-b279c7d479a2.html",
    "timestamp": "2025-09-22T09:05:00Z"
  },
  {
    "title": "Euro's 'global moment' risks slipping away amid political division",
    "description": "FRANKFURT/BRUSSELS/LONDON (Reuters) - -As alarm over Donald Trump's trade policy was pushing the dollar toward multi-year lows, European Central Bank chief...",
    "link": "https://finance.yahoo.com/news/euros-global-moment-risks-slipping-090343053.html",
    "timestamp": "2025-09-22T09:03:43Z"
  },
  {
    "title": "Southern California high school student suspended after MAGA hat sparks dispute",
    "description": "Orange County high school student fighting suspension after wearing MAGA hat and getting into political dispute with classmate who threw his hat in trash.",
    "link": "https://www.foxnews.com/media/southern-california-high-school-student-suspended-after-maga-hat-sparks-dispute",
    "timestamp": "2025-09-22T09:00:43Z"
  },
  {
    "title": "Who Really Runs DHS?",
    "description": "With the help of her righthand man Corey Lewandowski, Kristi Noem has turned DHS into Trump’s most devastating weapon against the right’s enemies.",
    "link": "http://nymag.com/intelligencer/article/kristi-noem-corey-lewandowski-dhs-fema-trump-enforcers.html",
    "timestamp": "2025-09-22T09:00:37Z"
  },
  {
    "title": "Harris is speaking. This time, she isn’t bending to Biden’s bullies",
    "description": "Biden/Harris adviser details how White House bullies targeted critics and dragged down both Biden and Kamala Harris during 2024 campaign struggles.",
    "link": "https://www.foxnews.com/opinion/harris-speaking-time-she-isnt-bending-bidens-bullies",
    "timestamp": "2025-09-22T09:00:29Z"
  },
  {
    "title": "I’m the son of a Mexican immigrant. Democrats hate the America she loves",
    "description": "Democrat Party's approach to law enforcement and immigration are profoundly un-American, exactly the opposite of what my Mexican immigrant mother taught me.",
    "link": "https://www.foxnews.com/opinion/im-son-mexican-immigrant-democrats-hate-america-she-loves",
    "timestamp": "2025-09-22T09:00:28Z"
  },
  {
    "title": "Qatar to Discuss 'New Threat Perception' of Israel with Trump: PM Adviser",
    "description": "Senior Qatari official Majed al-Ansari told Newsweek Israel's attack on Doha \"has changed the region forever.\"",
    "link": "https://www.newsweek.com/qatar-discuss-new-threat-perception-israel-trump-pm-adviser-2133455",
    "timestamp": "2025-09-22T09:00:02Z"
  },
  {
    "title": "America's High Mortgage Rates Aren't Deterring Foreign Buyers",
    "description": "Foreign buyers are flocking to the U.S. housing market while Americans are retreating.",
    "link": "https://www.newsweek.com/america-high-mortgage-rates-not-deterring-foreign-buyers-2131118",
    "timestamp": "2025-09-22T09:00:01Z"
  },
  {
    "title": "Trump Dials Up the Authoritarianism to 11",
    "description": "Sasha Abramsky\n\n\n\nWhen Trump asked Attorney General Pam Bondi to prosecute his enemies and she didn’t resign, it was a sign that we’ve already passed into strongman rule.\r\n\n\r\n\n\nThe post Trump Dials Up the Authoritarianism to 11 appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=571191",
    "timestamp": "2025-09-22T09:00:00Z"
  },
  {
    "title": "White House bullish after a long string of Supreme Court victories",
    "description": "Trump administration officials are on a winning streak at the Supreme Court.",
    "link": "https://www.nbcnews.com/politics/supreme-court/white-house-long-string-supreme-court-victories-rcna230870",
    "timestamp": "2025-09-22T09:00:00Z"
  },
  {
    "title": "Psychiatric Hospitals Turn Away Patients Who Need Urgent Care. The Facilities Face Few Consequences.",
    "description": "by Eli Cahan for ProPublica \n \n\n \n This article describes attempted suicide.\n\n \n\n \n\n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nLate one Satur…",
    "link": "https://www.propublica.org/article/psychiatric-hospitals-emtala-violations-mental-health",
    "timestamp": "2025-09-22T09:00:00Z"
  },
  {
    "title": "States Are Cutting Medicaid Provider Payments Long Before Trump Cuts Hit",
    "description": "North Carolina and Idaho are cutting their Medicaid programs to bridge budget gaps, raising fears that providers will stop taking patients and that hospitals will close even before the brunt of a new federal tax-and-budget law takes effect.",
    "link": "https://kffhealthnews.org/news/article/state-medicaid-cuts-reimbursement-big-bill-north-carolina-idaho-budgets/",
    "timestamp": "2025-09-22T09:00:00Z"
  },
  {
    "title": "\"When people watch us, it's like somebody checks a box that says ‘anything is permissible’. We've had limbs thrown on stage, wheelchairs…\" Five hilarious minutes with Gwar front-thing, Blöthar The Berserker",
    "description": "Blöthar on the alarming return of Gwar's adopted dinosaur, Trump props and when things have gone too far, even for them",
    "link": "https://www.loudersound.com/bands-artists/5-mins-with-blothar-gwar",
    "timestamp": "2025-09-22T08:59:11Z"
  },
  {
    "title": "Trump To Meet Arab Leaders Before Netanyahu Amid Israel Strikes, Western Nations Recognizing Palestinian State: Report",
    "description": "President Donald Trump will meet with a select group of Arab and Muslim leaders to discuss potential strategies for resolving the Gaza conflict. \nTrump to Meet Arab Leaders on Gaza, West Bank Annexation\nThe meeting is scheduled to take place ahead of Israeli …",
    "link": "https://biztoc.com/x/1f0b3888cecc8932",
    "timestamp": "2025-09-22T08:54:28Z"
  },
  {
    "title": "Trump and Musk's 'little conversation' at Charlie Kirk memorial after bitter bust-up",
    "description": "Donald Trump and Elon Musk had a spectacular public fallout earlier this year, with the US president even threatening to \"take a look\" at deporting the tech billionaire.",
    "link": "https://news.sky.com/story/trump-and-musks-little-conversation-at-charlie-kirk-memorial-after-bitter-bust-up-13436156",
    "timestamp": "2025-09-22T08:54:00Z"
  },
  {
    "title": "Murdochs could take over US arm of TikTok – Trump",
    "description": "Larry Ellison and Michael Dell are also expected to join the board of the popular Chinese app Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625030-murdochs-could-take-over-us/",
    "timestamp": "2025-09-22T08:52:31Z"
  },
  {
    "title": "'No amnesty!' Brazilians protest against bid to pardon Bolsonaro",
    "description": "Brazilians protested against lawmakers seeking amnesty for Jair Bolsonaro. The amnesty bill and another bill shielding lawmakers from charges sparked outrage. Luiz Inacio Lula da Silva supported the protests. Musicians performed resistance songs. Protesters d…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/no-amnesty-brazilians-protest-against-bid-to-pardon-bolsonaro/articleshow/124042863.cms",
    "timestamp": "2025-09-22T08:48:53Z"
  },
  {
    "title": "U.S. lawmakers call for more military dialogue with China as premier Li Qiang welcomes ‘icebreaking trip’",
    "description": "\"I’m deeply concerned that our two militaries don’t communicate more,\" said Rep. Adam Smith, who led the Congressional delegation to China.",
    "link": "https://fortune.com/asia/2025/09/22/us-delegation-china-li-qiang-military-dialogue/",
    "timestamp": "2025-09-22T08:48:13Z"
  },
  {
    "title": "Sudden $200 Billion Crypto Sell-Off Sparks Fresh Bitcoin Price Crash Fears",
    "description": "The SEC has approved a major rule change that could mean the bitcoin and crypto ETF  “floodgates” open...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/09/22/open-up-the-floodgates-a-blackrock-price-bombshell-is-suddenly-hurtling-toward-bitcoin-and-crypto/",
    "timestamp": "2025-09-22T08:45:36Z"
  },
  {
    "title": "Charlie Kirk Funeral: Everything From the Mourners to Trump’s Eulogy",
    "description": "Let’s be honest — the Charlie Kirk funeral was not your average goodbye. It was loud, intense, political, emotional, and unforgettable. You could feel it in the air — this wasn’t just about saying farewell. It was a national moment, a cultural flashpoint. Fro…",
    "link": "https://www.dumblittleman.com/charlie-kirk-funeral/",
    "timestamp": "2025-09-22T08:45:28Z"
  },
  {
    "title": "How To Avoid These 5 Mistakes Healthcare Startups Make",
    "description": "Most healthcare startups fail. Learn five key ways to avoid common mistakes and improve your chances of success in medicine’s complex landscape.",
    "link": "https://www.forbes.com/sites/robertpearl/2025/09/22/how-to-avoid-these-5-mistakes-healthcare-startups-make/",
    "timestamp": "2025-09-22T08:45:00Z"
  },
  {
    "title": "How To Avoid The 5 Deadly Mistakes Healthcare Startups Make",
    "description": "Most healthcare startups fail. Learn five key ways to avoid common mistakes and improve your chances of success in medicine’s complex landscape.",
    "link": "https://www.forbes.com/sites/robertpearl/2025/09/22/how-to-avoid-the-5-deadly-mistakes-healthcare-startups-make/",
    "timestamp": "2025-09-22T08:45:00Z"
  },
  {
    "title": "JPMorgan sees India building on record levels of IPO activity",
    "description": "Investors are betting that India will build on last year’s record, when nearly $21 billion was raised in IPOs",
    "link": "https://www.moneycontrol.com/news/business/ipo/jpmorgan-sees-india-building-on-record-levels-of-ipo-activity-2-13566284.html",
    "timestamp": "2025-09-22T08:42:30Z"
  },
  {
    "title": "Indian ministers visit US amid tariff, H-1B visa uncertainty",
    "description": "Amid recently strained ties, Indian Foreign Minister S. Jaishankar is set to meet with US Secretary of State Marco Rubio. Meanwhile, Prime Minister Narendra Modi has urged people to avoid foreign-made goods.",
    "link": "https://www.dw.com/en/indian-ministers-visit-us-amid-tariff-h-1b-visa-uncertainty/a-74087672",
    "timestamp": "2025-09-22T08:36:00Z"
  },
  {
    "title": "Trump’s $100,000 visa targets a $280 billion India success story",
    "description": "Trump's order—which requires a $100,000 fee for H-1B applications—will force a rethink at Indian outsourcers led by Tata Consultancy Services and Infosys.",
    "link": "https://fortune.com/asia/2025/09/22/trump-h1b-visa-india-tata-consultancy-services-infosys/",
    "timestamp": "2025-09-22T08:35:31Z"
  },
  {
    "title": "Swedish government cuts tax by 50 billion kronor in bumper 2026 budget",
    "description": "Sweden’s government has unveiled a 2026 budget with 46 billion kronor in tax cuts on jobs, pensions and food, aiming both to revive the economy and to woo voters ahead of next year’s election.",
    "link": "https://www.thelocal.se/20250922/swedish-government-cuts-tax-by-50-billion-kronor-in-bumper-2026-budget",
    "timestamp": "2025-09-22T08:32:49Z"
  },
  {
    "title": "Mikie Sherrill and Jack Ciattarelli had their first NJ governor debate. What they said",
    "description": "New Jersey's gubernatorial candidates Jack Ciattarelli and Mikie Sherrill met for their first debate Sept. 21. Here's what they said on key topics.",
    "link": "https://www.northjersey.com/story/news/politics/elections/2025/09/22/nj-governor-debate-2025-sherrill-ciattarelli-what-they-said/86285014007/",
    "timestamp": "2025-09-22T08:32:32Z"
  },
  {
    "title": "Dollar Rises in Wake of Fed Decision, U.S.-China Talks",
    "description": "11 min ago\nDollar Rises in Wake of Fed Decision, U.S.-China Talks\nThe dollar was edging higher in the wake of the Federal Reserve's latest policy decision and after President Donald Trump said he held a productive call with his Chinese counterpart Xi Jinping.…",
    "link": "https://biztoc.com/x/bdc39990de7688e0",
    "timestamp": "2025-09-22T08:32:24Z"
  },
  {
    "title": "India Responds to Trump's H-1B Visa Hike",
    "description": "Government officials and private companies have hit out at the plan to require a $100,000 payment for H-1B visas.",
    "link": "https://www.newsweek.com/india-responds-trump-h1b-visa-hike-2133543",
    "timestamp": "2025-09-22T08:20:37Z"
  },
  {
    "title": "ABC’s Jonathan Karl Pushes Back On MAGA Outrage Over His Charlie Kirk Segment",
    "description": "“Here’s what I actually said,\" the journalist captioned his post.",
    "link": "https://www.huffpost.com/entry/jonathan-karl-comments-shared_n_68d0fac3e4b03c190c210430",
    "timestamp": "2025-09-22T08:16:13Z"
  },
  {
    "title": "Strategic Analysis of Trump 2.0 Policies on the Global & US Auto Industry: Cost Pressures Expected in the Medium Term as Potential Disruptions to Established Supply Networks Prompt OEMs to Recalibrate",
    "description": "Tariffs and policy changes under Trump 2.0 offer market opportunities in regionalized auto production to minimize costs and maintain competitiveness. Automakers are re-evaluating sourcing and supply chains, while the rollback of EV incentives may slow EV grow…",
    "link": "https://www.globenewswire.com/news-release/2025/09/22/3153680/28124/en/Strategic-Analysis-of-Trump-2-0-Policies-on-the-Global-US-Auto-Industry-Cost-Pressures-Expected-in-the-Medium-Term-as-Potential-Disruptions-to-Established-Supply-Networks-Prompt-OE.html",
    "timestamp": "2025-09-22T08:07:00Z"
  },
  {
    "title": "Malaysia says RCEP bloc to consider adding new members, improve trade deal",
    "description": "KUALA LUMPUR: The China-backed Regional Comprehensive Economic Partnership (RCEP) will consider adding new members and discuss ways to improve trade flows when its leaders meet for the first time in five years in October, Malaysia's trade minister said on Mon…",
    "link": "https://www.channelnewsasia.com/asia/malaysia-rcep-bloc-new-members-improve-trade-tengku-zafrul-aziz-5361641",
    "timestamp": "2025-09-22T08:04:39Z"
  },
  {
    "title": "The US economy has a new problem: Democracy is under siege | CNN Business",
    "description": "Some political scientists see a pattern that suggests American democracy is being undermined in real time. The stakes are massive for the US economy and the business world.",
    "link": "https://www.cnn.com/2025/09/22/business/trump-economy-democracy",
    "timestamp": "2025-09-22T08:00:07Z"
  },
  {
    "title": "Surrendering to MAGA Isn’t Just a Broadcast Media Problem",
    "description": "Capitulation is everywhere.\nThe post Surrendering to MAGA Isn’t Just a Broadcast Media Problem appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/09/22/paramount-cbs-and-disney-abc-cave-to-trump/",
    "timestamp": "2025-09-22T08:00:00Z"
  },
  {
    "title": "China Responds to Donald Trump's $100K H-1B Visa Move",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Chinese foreign ministry said it would not comment on U.S. visa policies after President Donald Trump added a $100,000 fee to H-1B visas for specialist foreign workers, but noted that China \"welcomes outst…",
    "link": "https://biztoc.com/x/019c64933a54b841",
    "timestamp": "2025-09-22T07:59:09Z"
  },
  {
    "title": "Chuck Schumer, Hakeem Jeffries Demand Direct Meeting With Trump As 'Painful' Shutdown Looms: 'Now Your Obligation To...'",
    "description": "As the deadline for a potential government shutdown approaches, top Democrats have requested a meeting with President Donald Trump to discuss a way forward.\nSchumer, Jeffries Urge Trump to Negotiate Shutdown\nSenate Minority Leader Chuck Schumer (D-N.Y.) and H…",
    "link": "https://biztoc.com/x/f1f193d59c02e1ca",
    "timestamp": "2025-09-22T07:58:44Z"
  },
  {
    "title": "China Responds to Donald Trump's $100K H-1B Visa Move",
    "description": "H-1B visas are often used by tech companies to bring in foreign talent with particular skills they need.",
    "link": "https://www.newsweek.com/china-h-1b-visa-donald-trump-100k-2133530",
    "timestamp": "2025-09-22T07:57:59Z"
  },
  {
    "title": "Trump issues new pledge to Poland and the Baltics",
    "description": "US President Donald Trump has promised help in case of Russian aggression, though Moscow has denied that it poses a threat to NATO members Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625031-trump-pledge-poland-baltic/",
    "timestamp": "2025-09-22T07:57:27Z"
  },
  {
    "title": "Celebrating 20 Years of Critical Mass: Louie Palu (2005) and Lynn Saville (2006)",
    "description": "Photolucida is a Portland-based nonprofit dedicated to providing platforms that expand, inspire, educate, and connect the national and international photography community. Critical Mass, Photolucida’s annual online program, is designed to foster meaningful co…",
    "link": "http://lenscratch.com/2025/09/celebrating-20-years-of-critical-mass-louie-palu-2005-and-lynn-saville-2006/",
    "timestamp": "2025-09-22T07:55:41Z"
  },
  {
    "title": "President al-Sharaa is first Syrian leader to visit UNGA in six decades",
    "description": "The last Syrian president to address the UN General Assembly spoke at the gathering in 1967.",
    "link": "https://www.aljazeera.com/news/2025/9/22/president-al-sharaa-is-first-syrian-leader-to-visit-unga-in-six-decades",
    "timestamp": "2025-09-22T07:51:29Z"
  },
  {
    "title": "Trump blasted for ruthless jab at Jimmy Kimmel show during Charlie Kirk memorial speech",
    "description": "Donald Trump hit out at Jimmy Kimmel during his Charlie Kirk memorial speech",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-charlie-kirk-memorial-speech-jimmy-kimmel-533493-20250922",
    "timestamp": "2025-09-22T07:41:27Z"
  },
  {
    "title": "How India will feel the sting of Trump's H-1B visa fee hike",
    "description": "Investors shed shares of IT outsourcing firms of all sizes, including Infosys, Tech Mahindra, Wipro, HCL Technologies and Tata Consultancy Services.",
    "link": "https://www.cnbc.com/2025/09/22/how-india-will-feel-the-sting-of-trumps-h-1b-visa-fee-hike.html",
    "timestamp": "2025-09-22T07:36:54Z"
  },
  {
    "title": "Dominican Republic says it seized 377 packages of cocaine on speedboat destroyed by US Navy",
    "description": "The Dominican Republic’s National Directorate for Drug Control said it recovered 377 packages of cocaine from the boat which was allegedly carrying 1,000 kilograms of the drug.",
    "link": "https://nypost.com/2025/09/22/world-news/dominican-republic-says-it-seized-377-packages-of-cocaine-on-speedboat-destroyed-by-us-navy/",
    "timestamp": "2025-09-22T07:36:43Z"
  },
  {
    "title": "Netherlands, Hungary Push To Designate Antifa As Terrorist Organization",
    "description": "Netherlands, Hungary Push To Designate Antifa As Terrorist Organization\n \nAuthored by Naveen Athrappully via The Epoch Times (emphasis ours),\nPolitical leaders in the Netherlands and Hungary are backing proposals to designate Antifa as a terrorist group after…",
    "link": "https://biztoc.com/x/f5ed8aa957af4003",
    "timestamp": "2025-09-22T07:36:34Z"
  },
  {
    "title": "H-1B visa hike has sparked panic in India which sends more skilled workers to the US than any other country",
    "description": "A wave of panic and confusion has spread through Indian communities and the global tech industry, following US President Donald Trump’s surprise order imposing a $100,000 fee for the H-1B visa, impacting the largest group of beneficiaries of the skilled-worke…",
    "link": "https://www.cnn.com/2025/09/22/india/india-h1b-visa-confusion-intl-hnk",
    "timestamp": "2025-09-22T07:33:53Z"
  },
  {
    "title": "LDP leadership race kicks off with 5 candidates",
    "description": "Outgoing Japanese Prime Minister Shigeru Ishiba ’s ruling party opened official campaigning Monday to find his replacement who can restore political stability and voter support for the beleaguered Liberal Democrats. Five candidates are vying for the Liberal D…",
    "link": "https://japantoday.com/category/politics/ldp-leadership-race-kicks-off-with-5-candidates",
    "timestamp": "2025-09-22T07:33:11Z"
  },
  {
    "title": "Modi calls for Indians to buy ‘local’ amid US tariffs",
    "description": "The Indian PM has made a pitch for national self-sufficiency, calling on citizens to buy domestically made goods Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625033-modi-calls-for-indians-to/",
    "timestamp": "2025-09-22T07:32:07Z"
  },
  {
    "title": "Trump’s H-1B visa fee to hit employers with $14bn annual bill",
    "description": "Lawyers anticipate the scale of the surprise move could face a court challenge as employers investigate other visa options",
    "link": "https://www.irishtimes.com/business/work/2025/09/22/trumps-h-1b-visa-fee-to-hit-employers-with-14bn-annual-bill/",
    "timestamp": "2025-09-22T07:32:03Z"
  },
  {
    "title": "Murdochs, Ellisons likely to be involved in US TikTok deal, says Donald Trump",
    "description": "US president Donald Trump says Rupert and Lachlan Murdoch and Larry Ellison are likely to be part of an investor group that will acquire the US portion of TikTok. Trump made the remarks during a Fox Ne...",
    "link": "https://www.c21media.net/news/murdochs-ellisons-likely-to-be-involved-in-us-tiktok-deal-says-donald-trump/",
    "timestamp": "2025-09-22T07:27:23Z"
  },
  {
    "title": "Trump Names Lachlan Murdoch, Larry Ellison And Michael Dell As Key Investors In TikTok Deal, Praises Group As 'American Patriots'",
    "description": "On Sunday, President Donald Trump said media mogul Lachlan Murdoch and tech leaders Oracle Corp (NYSE:ORCL) Larry Ellison and Dell Technologies Inc. (NYSE:DELL) CEO Michael Dell will take part as investors in a proposed deal to transfer TikTok's U.S. operatio…",
    "link": "https://biztoc.com/x/6096b33b0d2eebf2",
    "timestamp": "2025-09-22T07:25:28Z"
  },
  {
    "title": "Trump ramps up retribution campaign with push for Bondi to pursue cases against his foes",
    "description": "Eight months into his second term, President Donald Trump’s long-standing pledge to take on those he perceives as his political enemies has prompted debates over free speech, media censorship and political prosecutions",
    "link": "https://biztoc.com/x/494280961ac7de4f",
    "timestamp": "2025-09-22T07:25:27Z"
  },
  {
    "title": "Trump ramps up retribution campaign with push for Bondi to pursue cases against his foes",
    "description": "Eight months into his second term, President Donald Trump’s long-standing pledge to take on those he perceives as his political enemies has prompted debates over free speech, media censorship and political prosecutions",
    "link": "https://abcnews.go.com/Business/wireStory/trump-ramps-retribution-campaign-push-bondi-pursue-cases-125791820",
    "timestamp": "2025-09-22T07:20:55Z"
  },
  {
    "title": "After messy split, Trump and Musk share handshake at Kirk tribute in Arizona",
    "description": "Donald Trump sat side-by-side with billionaire Elon Musk, a once trusted advisor with whom the US president had a spectacular public falling out, at a memorial event for right-wing leader Charlie Kirk on Sunday. Musk on his X account posted an image of him an…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/after-messy-split-donald-trump-and-elon-musk-share-handshake-at-charlie-kirk-tribute-in-arizona/articleshow/124040673.cms",
    "timestamp": "2025-09-22T07:20:42Z"
  },
  {
    "title": "Japan's governing party opens race to choose Ishiba's successor",
    "description": "Japan's governing Liberal Democratic Party has opened the official campaign to replace its leader, outgoing Prime Minister Shigeru Ishiba",
    "link": "https://abcnews.go.com/International/wireStory/japans-governing-party-opens-race-choose-ishibas-successor-125805158",
    "timestamp": "2025-09-22T07:18:26Z"
  },
  {
    "title": "PM Modi makes impossible possible: VP Radhakrishnan",
    "description": "Vice President C. P. Radhakrishnan lauded Prime Minister Narendra Modi's ability to achieve the seemingly impossible, highlighting his strong relationships with global leaders like Donald Trump, Vladimir Putin, and Xi Jinping. Despite trade differences, Trump…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/pm-modi-makes-impossible-possible-vp-radhakrishnan/articleshow/124040503.cms",
    "timestamp": "2025-09-22T07:15:35Z"
  },
  {
    "title": "Only one CM opposed GST: Jairam Ramesh takes dig at PM Modi",
    "description": "\"From 2006-2014, for eight years, only one CM opposed the GST, and that CM became the Prime Minister in 2014 and took a U-turn and emerged as a messiah of GST in 2017,\" Ramesh, General Secretary incharge of communications in Congress, told ANI.",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/only-one-cm-opposed-gst-jairam-ramesh-takes-dig-at-pm-modi/articleshow/124040481.cms",
    "timestamp": "2025-09-22T07:14:33Z"
  },
  {
    "title": "Zelensky Issues Tragic Update After Latest Russia Strike",
    "description": "The strike comes as Ukraine's president is headed to the United Nations in New York City.",
    "link": "https://www.newsweek.com/zelensky-russia-ukraine-war-strike-putin-trump-un-2133516",
    "timestamp": "2025-09-22T07:14:12Z"
  },
  {
    "title": "Lipreader 'reveals' secret vow made between Trump and Elon Musk at Charlie Kirk's funeral",
    "description": "Donald Trump and Elon Musk appeared to put their differences aside at Charlie Kirk's memorial service, as the pair shook hands and exchanged pleasantries.",
    "link": "https://www.ladbible.com/news/us-news/trump-elon-musk-charlie-kirk-funeral-what-did-they-say-lip-reader-031909-20250922",
    "timestamp": "2025-09-22T07:12:04Z"
  },
  {
    "title": "Brazilians protest against a bill that could lead to a pardon for Bolsonaro and allies",
    "description": "Thousands of Brazilians have protested against a possible pardon for former President Jair Bolsonaro and his allies, who were convicted of attempting a coup",
    "link": "https://abcnews.go.com/International/wireStory/brazilians-protest-bill-lead-pardon-bolsonaro-allies-125791016",
    "timestamp": "2025-09-22T07:10:28Z"
  },
  {
    "title": "Cold Grey Dawn Open Thread: ‘Mourning’ Charlie Kirk",
    "description": "26,000 YouTube views for Sinclair’s Charlie Kirk tribute special. Just for comparison, Jimmy Kimmel’s monologue on any average Wednesday will get between two and four MILLION YouTube views. Right wing culture is fringe stuff. It is not American culture by any…",
    "link": "https://balloon-juice.com/2025/09/22/cold-grey-dawn-open-thread-mourning-charlie-kirk/",
    "timestamp": "2025-09-22T07:05:18Z"
  },
  {
    "title": "America’s friends will never trust the U.S. again",
    "description": "A group of U.S. foreign policy veterans has warned Congress that Donald Trump’s erratic and hostile approach to allies is eroding America’s global credibility.",
    "link": "https://www.japantimes.co.jp/commentary/2025/09/22/world/allies-no-longer-trust-the-us/",
    "timestamp": "2025-09-22T07:05:00Z"
  },
  {
    "title": "Jolie says she does not 'recognise' her country",
    "description": "Angelina Jolie has said she loves her country but does not \"recognise it\", as she said we are living through \"very heavy times\".",
    "link": "https://www.rte.ie/entertainment/2025/0922/1534650-angelina-jolie/",
    "timestamp": "2025-09-22T07:02:14Z"
  },
  {
    "title": "The 8 at 8: Monday",
    "description": "Harris to push for EU sanctions against Israel, deadly overnight strikes in Ukraine, and Trump leads tributes to Charlie Kirk",
    "link": "https://www.thejournal.ie/morning-news-rundown-monday-september-6823228-Sep2025/",
    "timestamp": "2025-09-22T07:00:51Z"
  },
  {
    "title": "Donald Trump to Rebecca Dunn: Who said what at Charlie Kirk’s memorial?",
    "description": "Speakers compared the right-wing influencer to Jesus, Moses, George Washington and Martin Luther King Jr.",
    "link": "https://www.aljazeera.com/news/2025/9/22/donald-trump-to-rebecca-dunn-who-said-what-at-charlie-kirks-memorial",
    "timestamp": "2025-09-22T06:59:37Z"
  },
  {
    "title": "Trump previews ‘amazing’ autism announcement Monday that’s expected to focus on pain reliever, vitamin deficiency",
    "description": "(CNN) — President Donald Trump’s speech at Charlie Kirk’s memorial service on Sunday took a detour into previewing an announcement he plans to make from the Oval Office on Monday",
    "link": "https://www.news8000.com/lifestyle/health/trump-previews-amazing-autism-announcement-monday-that-s-expected-to-focus-on-pain-reliever-vitamin/article_81b3807d-b26b-5bf3-a621-95dea937121e.html",
    "timestamp": "2025-09-22T06:58:34Z"
  },
  {
    "title": "JPMorgan calls India a ‘bright spot’ even as tariffs and $100,000 H-1B fee bite",
    "description": "JPMorgan Chase views India as a promising economy despite global challenges, citing strong domestic growth. While acknowledging concerns like tariffs and H1B visa issues, the bank remains optimistic about India's ability to navigate these hurdles. JPMorgan is…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/jpmorgan-calls-india-a-bright-spot-even-as-tariffs-and-100000-h-1b-fee-bite/articleshow/124039852.cms",
    "timestamp": "2025-09-22T06:58:28Z"
  },
  {
    "title": "H-1B visa workers abroad race to US after Trump order",
    "description": "Panic, confusion and anger reigned as workers on H-1B visas from India and China were forced to abandon travel plans and rush back to the US after President Donald Trump imposed new visa fees, in line with his wide-ranging immigration crackdown.",
    "link": "https://www.rte.ie/news/business/2025/0922/1534649-h-1b-visa-workers-abroad-race-to-us-after-trump-order/",
    "timestamp": "2025-09-22T06:56:25Z"
  },
  {
    "title": "H-1B Visa Fee Shock:Temporary Setback Or Turning Point For Indian IT? Former Zensar CEO Weighs In",
    "description": "Former Zensar Technologies Chief Executive and IT industry veteran Ganesh Natarajan believes Indian companies will face the short-term impact of the US government's mandate to charge a one-time fee of $100,000 to new H-1B visa applicants, but stressed that re…",
    "link": "https://www.ndtvprofit.com/business/h-1b-visa-fee-shocktemporary-setback-or-turning-point-for-indian-it-former-zensar-ceo-ganesh-natarajan-weighs-in",
    "timestamp": "2025-09-22T06:54:34Z"
  },
  {
    "title": "Charlie Kirk's widow forgives his killers at funeral attended by thousands",
    "description": "Erika Kirk, the widow of slain Christian conservative influencer Charlie Kirk, forgave his killer as she delivered an address to tens of thousands of people gathered at a memorial service in his honour.",
    "link": "https://www.christianpost.com/news/erika-kirk-forgives-her-husbands-killer-what-charlie-would-do.html",
    "timestamp": "2025-09-22T06:54:00Z"
  },
  {
    "title": "Kim Jong-Un Says He Has ‘Fond Memories’ Of Trump And Is Open To Talks With U.S.",
    "description": "The North Korean leader, however, insisted the U.S. must abandon its push to denuclearize his country for there to be any chance of dialogue.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/09/22/kim-jong-un-says-he-has-fond-memories-of-trump-and-is-open-to-talks-with-us/",
    "timestamp": "2025-09-22T06:51:02Z"
  },
  {
    "title": "Macron Says Europe’s Russian Energy Imports Are ‘Marginal’ Issue",
    "description": "French President Emmanuel Macron called the European Union’s remaining energy imports from Russia “very marginal,” challenging Donald Trump’s calls for the bloc to reduce its dependence if it wants the US to step up pressure on Moscow to end the war in Ukrain…",
    "link": "https://gcaptain.com/macron-says-europes-russian-energy-imports-are-marginal-issue/",
    "timestamp": "2025-09-22T06:50:47Z"
  },
  {
    "title": "John Oliver Defends Jimmy Kimmel, Tells Bob Iger to Stop ‘Rolling Over’",
    "description": "\"Giving the bully your lunch money doesn't make him go away—it just makes him come back hungrier each time\"",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/john-oliver-jimmy-kimmel-last-week-tonight-charlie-kirk-1235432104/",
    "timestamp": "2025-09-22T06:43:54Z"
  },
  {
    "title": "Singapore to Sanction ‘Radical’ West Bank Settlers Over Violence",
    "description": "Singapore plans to impose sanctions against leaders of Israeli settler groups or organizations responsible for acts of violence against Palestinians in the West Bank.",
    "link": "https://financialpost.com/pmn/business-pmn/singapore-to-sanction-radical-west-bank-settlers-over-violence",
    "timestamp": "2025-09-22T06:41:36Z"
  },
  {
    "title": "Republicans DESTROY Liberal Media Anchors CRYING Over Trump 'Cancelling' Jimmy Kimmel's Free Speech",
    "description": "Oklahoma Sen. Markwayne Mullin (R) denied that President Donald Trump attacked free speech rights in a recent Oval Office question and answer session when he complained to the press about negative news stories.CNN's Dana Bash played video of Trump saying Frid…",
    "link": "https://freerepublic.com/focus/f-news/4341990/posts",
    "timestamp": "2025-09-22T06:35:33Z"
  },
  {
    "title": "Republicans DESTROY Liberal Media Anchors CRYING Over Trump 'Cancelling' Jimmy Kimmel's Free Speech",
    "description": "Oklahoma Sen. Markwayne Mullin (R) denied that President Donald Trump attacked free speech rights in a recent Oval Office question and answer session when he complained to the press about negative news stories.CNN's Dana Bash played video of Trump saying Frid…",
    "link": "https://freerepublic.com/focus/f-bloggers/4341990/posts",
    "timestamp": "2025-09-22T06:35:33Z"
  },
  {
    "title": "Big Tech stocks hold steady after Trump visa fees crackdown",
    "description": "Shares in \"Magnificent 7\" tech companies were steady on Monday after President Trump introduced new visa fees affecting employees.",
    "link": "https://finance.yahoo.com/news/big-tech-shares-steady-trump-063324397.html",
    "timestamp": "2025-09-22T06:33:24Z"
  },
  {
    "title": "US tech shares fall as Trump slaps steep new fees on H-1B visas",
    "description": "Shares of U.S. technology companies slipped on Monday after President Donald Trump unveiled steep new visa fees as part of his immigration crackdown, raising concerns over higher labor costs and tighter access to skilled workers.The Trump administration said …",
    "link": "https://www.channelnewsasia.com/business/us-tech-shares-fall-trump-slaps-steep-new-fees-h-1b-visas-5361546",
    "timestamp": "2025-09-22T06:33:24Z"
  },
  {
    "title": "Big Tech shares steady after Trump visa fees crackdown",
    "description": "LONDON :Shares in large-cap U.S. technology companies were steady in Frankfurt trading on Monday after U.S. President Donald Trump introduced new visa fees as part of his crackdown on immigration. The Trump administration said on Friday it would ask companies…",
    "link": "https://www.channelnewsasia.com/business/big-tech-shares-steady-after-trump-visa-fees-crackdown-5361546",
    "timestamp": "2025-09-22T06:33:24Z"
  },
  {
    "title": "Charlie Kirk memorial: Half of US is in raptures, the other indifferent",
    "description": "Revivalist gathering attended by tens of thousands drew the Maga movement closer together than ever before",
    "link": "https://www.irishtimes.com/world/us/2025/09/22/charlie-kirk-memorial-half-of-us-is-in-raptures-the-other-indifferent/",
    "timestamp": "2025-09-22T06:31:55Z"
  },
  {
    "title": "Trump’s $100,000 visa targets a $280 billion India success story",
    "description": "The move to curtail H-1B visas threatens to rewrite the rules for a decades-old model that underpins much of the technology behind the world’s largest corporations.",
    "link": "https://www.japantimes.co.jp/business/2025/09/22/companies/trump-visa-india-success-story/",
    "timestamp": "2025-09-22T06:31:00Z"
  },
  {
    "title": "Trump slaps a price tag on tech visas",
    "description": "US King Donald Trump has decided that if foreigners want to work in the US, they had better be rich. And if tech companies want skilled labour, they can pay through the nose for them. https://fudzilla.com/news/61744-trump-slaps-a-price-tag-on-tech-visas",
    "link": "https://www.madshrimps.be/news/trump-slaps-a-price-tag-on-tech-visas/",
    "timestamp": "2025-09-22T06:30:01Z"
  },
  {
    "title": "President Prabowo to speak at UN General Assembly on Tuesday",
    "description": "President Prabowo Subianto is scheduled to deliver a speech during the General Debate of the 80th Session of the United Nations General Assembly in New York, ...",
    "link": "https://en.antaranews.com/news/381428/president-prabowo-to-speak-at-un-general-assembly-on-tuesday",
    "timestamp": "2025-09-22T06:29:08Z"
  },
  {
    "title": "‘Insane’: woman on holiday left behind in Rome after boyfriend rushes to US as Donald Trump hikes H-1B visa fee",
    "description": "The incident unfolded after a newly signed executive order imposed a $100,000 fee for certain H-1B visa petitions in the US, sparking panic among visa holders.",
    "link": "https://indianexpress.com/article/trending/trending-globally/woman-on-holiday-left-behind-in-rome-after-boyfriend-rushes-to-us-as-donald-trump-hikes-h-1b-visa-fee-10264102/",
    "timestamp": "2025-09-22T06:22:31Z"
  }
]