[
  {
    "title": "Pope Leo shared content critical of Trump, Vance's immigration policies in social media posts",
    "description": "Pope Leo shared content critical of Trump, Vance's immigration policies in social media postsgo.com",
    "link": "https://abcnews.go.com/International/pope-leo-shared-content-critical-trump-vances-immigration/story?id=121619905",
    "timestamp": "2025-05-09T03:26:04Z"
  },
  {
    "title": "Consumer watchdog halts Biden-era Google Payment supervision",
    "description": "The US Consumer Financial Protection Bureau (CFPB) has dropped its bid to supervise Google Payment Corp, prompting Google to withdraw its related lawsuit. The CFPB's Trump-appointed director called the oversight unnecessary. Google argued the regulator target…",
    "link": "https://economictimes.indiatimes.com/tech/technology/consumer-watchdog-halts-biden-era-google-payment-supervision-google-spokesperson/articleshow/121016214.cms",
    "timestamp": "2025-05-09T03:25:21Z"
  },
  {
    "title": "AG Letitia James heckled over mortgage fraud case at town hall: ‘Apologize to Donald Trump’",
    "description": "“Apologize to Donald Trump for wasting millions of dollars in the state of New York,” the MAGA booster shouted from the audience.",
    "link": "https://nypost.com/2025/05/08/us-news/ag-tish-james-heckled-over-mortgage-fraud-case-at-town-hall-apologize-to-donald-trump/",
    "timestamp": "2025-05-09T03:25:08Z"
  },
  {
    "title": "US Senate Blocks Stablecoin Legislation Over Trump Memecoin Controversy",
    "description": "A bill to promote stablecoins was blocked in the U.S. Senate on Thursday (May 8) over political disagreements and controversy surrounding President Donald Trump’s crypto ventures, according to reporting from Bloomberg.\nThe bill only garnered 48 votes, falling…",
    "link": "https://biztoc.com/x/355d6d17c2ae46a9",
    "timestamp": "2025-05-09T03:24:01Z"
  },
  {
    "title": "\"Likely to generate inflation\": Fed Chair Powell paints bleak picture of US under Trump tariffs",
    "description": "Jerome Powell hasn't offered Donald Trump any slack during his second term, but he's certainly giving the president enough rope.\nThe Federal Reserve chair once again refused to lower key interest rates as economic uncertainty around Trump's tariff scheme has …",
    "link": "https://biztoc.com/x/441f2a9b45e37bc0",
    "timestamp": "2025-05-09T03:23:49Z"
  },
  {
    "title": "China can play hardball at looming trade talks with US: analysts",
    "description": "A formidable set of cards that includes granting access to its vast market and an ability to withstand economic pain will allow Beijing to play hardball in upcoming trade talks with the United States in Geneva, analysts say. Trade between the world’s two larg…",
    "link": "https://www.digitaljournal.com/world/china-can-play-hardball-at-looming-trade-talks-with-us-analysts/article",
    "timestamp": "2025-05-09T03:22:20Z"
  },
  {
    "title": "China can play hardball at looming trade talks with US: analysts",
    "description": "A formidable set of cards that includes granting access to its vast market and an ability to withstand economic pain will allow Beijing to play hardball in...",
    "link": "https://www.yahoo.com/news/china-play-hardball-looming-trade-032041326.html",
    "timestamp": "2025-05-09T03:20:41Z"
  },
  {
    "title": "Leo XIV, First US Pope, To Celebrate First Mass As Pontiff",
    "description": "Pope Leo XIV will celebrate mass Friday, the day after becoming the first US head of the Catholic Church, with the world watching for signs of what kind of pope he will be.",
    "link": "https://www.ibtimes.com/leo-xiv-first-us-pope-celebrate-first-mass-pontiff-3773010",
    "timestamp": "2025-05-09T03:18:20Z"
  },
  {
    "title": "Nearing 100, Malaysian Ex-PM Mahathir Blasts 'Old World' Trump",
    "description": "Former Malaysian prime minister Mahathir Mohamad is giving President Donald Trump three months before his fellow Americans force him to rethink his stringent global tariff strategy, accusing the US leader of \"living in an old world\".",
    "link": "https://www.ibtimes.com/nearing-100-malaysian-ex-pm-mahathir-blasts-old-world-trump-3773007",
    "timestamp": "2025-05-09T03:18:17Z"
  },
  {
    "title": "What will the Antichrist look like? According to Western thought, an authoritarian king – or the pope",
    "description": "In casting himself as supreme leader and pope, Donald Trump inadvertently invoked the Christian understanding of the Antichrist.",
    "link": "https://theconversation.com/what-will-the-antichrist-look-like-according-to-western-thought-an-authoritarian-king-or-the-pope-256205",
    "timestamp": "2025-05-09T03:17:47Z"
  },
  {
    "title": "Nearing 100, Malaysian ex-PM Mahathir blasts ‘old world’ Trump",
    "description": "Former Malaysian prime minister Mahathir Mohamad is giving President Donald Trump three months before his fellow Americans force him to rethink his stringent global tariff strategy, accusing the US leader of “living in an old world”. Speaking to AFP in an int…",
    "link": "https://www.digitaljournal.com/world/nearing-100-malaysian-ex-pm-mahathir-blasts-old-world-trump/article",
    "timestamp": "2025-05-09T03:17:20Z"
  },
  {
    "title": "Leo XIV, first US pope, to celebrate first mass as pontiff",
    "description": "Pope Leo XIV will celebrate mass Friday, the day after becoming the first US head of the Catholic Church, with the world watching for signs of what kind of pope he will be. Chicago-born Robert Francis Prevost was on Thursday elected by fellow cardinals to lea…",
    "link": "https://www.digitaljournal.com/world/leo-xiv-first-us-pope-to-celebrate-first-mass-as-pontiff/article",
    "timestamp": "2025-05-09T03:17:20Z"
  },
  {
    "title": "China’s April exports jump 8.1% to beat estimates despite U.S. tariffs; import decline slows",
    "description": "The prohibitive levels of duties would have halted all trade flows between the world's two largest economies.",
    "link": "https://www.cnbc.com/2025/05/09/chinas-exports-jump-us-tariffs-imports-tumble.html",
    "timestamp": "2025-05-09T03:16:49Z"
  },
  {
    "title": "Chris Hayes Says Health News in the Trump Era ‘Feels Like a Dark Joke’ After New Surgeon General Pick | Video",
    "description": "The MSNBC host talks to Kathleen Sebelius about \"wellness\" influencer Casey Means \nThe post Chris Hayes Says Health News in the Trump Era ‘Feels Like a Dark Joke’ After New Surgeon General Pick | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/chris-hayes-casey-means-surgeon-general-dark-joke-msnbc/",
    "timestamp": "2025-05-09T03:15:53Z"
  },
  {
    "title": "Kaine: GOP Senators Saying We Need to Be a Check Against Trump's Overreach",
    "description": "Senator Tim Kaine (D-VA) claimed Thursday on CNN's \"The Source\" that \"some Republicans have stood up\" to say Congress needed to be a check against President Donald Trump's executive overreach.\nThe post Kaine: GOP Senators Saying We Need to Be a Check Against …",
    "link": "https://www.breitbart.com/clips/2025/05/08/kaine-gop-senators-saying-we-need-to-be-a-check-against-trumps-overreach/",
    "timestamp": "2025-05-09T03:15:01Z"
  },
  {
    "title": "MAGA CNN Guest Told ‘No’ After Demanding Trump Get ‘Credit’ for Congratulating New Pope",
    "description": "Conservative radio host Ben Ferguson insisted that President Donald Trump should be praised for the way he reacted to the ascension of the first American pope.\nThe post MAGA CNN Guest Told ‘No’ After Demanding Trump Get ‘Credit’ for Congratulating New Pope fi…",
    "link": "https://www.mediaite.com/tv/maga-cnn-guest-told-no-after-demanding-trump-get-credit-for-congratulating-new-pope/",
    "timestamp": "2025-05-09T03:13:19Z"
  },
  {
    "title": "In President Trump's Middle East show, Israelis are part of a captive audience",
    "description": "It's important to cast a sober gaze at reality. The IDF doesn't have sufficient forces to realize the right-wing fantasies about maintaining a military government across most of the Gaza Strip, over time",
    "link": "https://www.haaretz.com/middle-east-news/2025-05-09/ty-article/.premium/in-president-trumps-middle-east-show-israelis-are-part-of-a-captive-audience/00000196-b12d-d9bf-a1b6-f9ad7b090000",
    "timestamp": "2025-05-09T03:12:10Z"
  },
  {
    "title": "Trump abruptly fires Librarian of Congress",
    "description": "WASHINGTON—President Donald Trump fired the Librarian of Congress, Carla Hayden, on Thursday, according to a copy of her termination email obtained by NBC News.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-abruptly-fires-librarian-congress-rcna205749",
    "timestamp": "2025-05-09T03:11:06Z"
  },
  {
    "title": "Why am I internet-stalking the pope?",
    "description": "The moment the white smoke appeared above the Sistine Chapel, I immediately turned on my television, because I wanted to see who the new pope would be, and then hopped on social media, because I knew that the internet could tell me more about the new pope fas…",
    "link": "https://www.theverge.com/politics/663974/pope-leo-xiv-prevost-social-media-tweets",
    "timestamp": "2025-05-09T03:10:37Z"
  },
  {
    "title": "President Trump Slams Fed Chair Jerome Powell After Fed Rejects Rate Cut",
    "description": "President Donald Trump is continuing his broadside against Jerome Powell, criticizing the Federal Reserve chair for not slashing interest rates. On Thursday, Trump took to his social media platform, Truth Social, to call Powell “a fool” who “doesn’t have a cl…",
    "link": "https://dailyhodl.com/2025/05/08/us-president-donald-trump-continues-broadside-against-federal-reserve-chair-jerome-powell-as-fed-committee-rules-out-rate-cut/",
    "timestamp": "2025-05-09T03:09:20Z"
  },
  {
    "title": "Asian Stocks Lifted By Hopes For US-China Talks After UK Deal",
    "description": "Most Asian equities rose Friday on growing optimism that the worst of Donald Trump's trade war is past after he reached a deal with Britain and suggested he could lower tariffs on China as officials prepare for high-stakes talks this weekend.",
    "link": "https://www.ibtimes.com/asian-stocks-lifted-hopes-us-china-talks-after-uk-deal-3773003",
    "timestamp": "2025-05-09T03:06:14Z"
  },
  {
    "title": "What Pope Leo XIV Has Said About Climate Change",
    "description": "Robert Prevost, newly named Pope Leo XIV, has previously voiced his stance on the hot-button environmental issue.",
    "link": "https://www.newsweek.com/what-pope-leo-xiv-has-said-about-climate-change-2069973",
    "timestamp": "2025-05-09T03:03:04Z"
  },
  {
    "title": "Asian stocks lifted by hopes for US-China talks after UK deal",
    "description": "Most Asian equities rose Friday on growing optimism that the worst of Donald Trump’s trade war is past after he reached a deal with Britain and suggested he could lower tariffs on China as officials prepare for high-stakes talks this weekend. The mood among i…",
    "link": "https://www.digitaljournal.com/world/asian-stocks-lifted-by-hopes-for-us-china-talks-after-uk-deal/article",
    "timestamp": "2025-05-09T03:02:33Z"
  },
  {
    "title": "Trump meets Netanyahu aide ahead of Mideast trip",
    "description": "United States President Donald Trump held a private meeting Thursday at the White House with Israeli Strategic Affairs Minister Ron Dermer (pictured right), a top adviser to Prime Minister Benjamin Ne...",
    "link": "https://biztoc.com/x/662479128e9b8b14",
    "timestamp": "2025-05-09T03:01:38Z"
  },
  {
    "title": "Lutnick warns no ‘fast deals’ for Japan and South Korea",
    "description": "Commerce Secretary Howard Lutnick said that trade deals with South Korea and Japan could take significantly more time to complete than the framework agreement President Donald Trump announced Thursday with the UK, in a signal that some Asian partners may have…",
    "link": "https://biztoc.com/x/63da73d33d8e6089",
    "timestamp": "2025-05-09T03:01:25Z"
  },
  {
    "title": "Bitcoin To Be Global Reserve ‘Sooner Than Most Expect,’ Says Trump Adviser",
    "description": "In a conversation on The Scoop, David Bailey, chief executive of Bitcoin Inc. and confidant of US President Trump, mapped out a trajectory that he believes will carry the world’s first cryptocurrency from insurgent technology to primary reserve asset “much so…",
    "link": "https://bitcoinist.com/bitcoin-global-reserve-sooner-than-most-expect/",
    "timestamp": "2025-05-09T03:00:38Z"
  },
  {
    "title": "US must acknowledge Iran’s true nature before striking nuclear deal",
    "description": "This is not just “a very important time for Iran,” as the president states. On these talks could rest the future of peace in the region, and the diminishing of Iran’s nuclear capabilities.",
    "link": "https://www.jpost.com/opinion/article-853259",
    "timestamp": "2025-05-09T02:59:19Z"
  },
  {
    "title": "Via email, Trump fires head of world's largest library: The Library of Congress",
    "description": "Hayden is a professional librarian nominated to the post by then-President Barack Obama in 2016.",
    "link": "https://www.usatoday.com/story/news/nation/2025/05/08/trump-fires-head-of-the-library-of-congress-carla-hayden/83526572007/",
    "timestamp": "2025-05-09T02:58:40Z"
  },
  {
    "title": "Justice Sonia Sotomayor urges lawyers to 'stand up' amid Trump tumult",
    "description": "The liberal justice spoke at an event hosted by the American Bar Association, a legal group that has been targeted by the Trump administration.",
    "link": "https://www.nbcnews.com/politics/supreme-court/justice-sonia-sotomayor-urges-lawyers-stand-trump-tumult-rcna205720",
    "timestamp": "2025-05-09T02:58:38Z"
  },
  {
    "title": "Massachusetts man charged in attempt to assassinate a member of Trump's Cabinet",
    "description": "A Massachusetts man on Thursday was charged with attempting to assassinate a member of President Donald Trump's Cabinet, after he brought Molotov cocktails to the Capitol in January. Ryan English, who turned himself into Capitol Police over the incident, alle…",
    "link": "https://freerepublic.com/focus/f-news/4315868/posts",
    "timestamp": "2025-05-09T02:57:44Z"
  },
  {
    "title": "President Trump fires Librarian of Congress",
    "description": "President Donald Trump has abruptly fired Librarian of Congress Carla Hayden as the White House continues to purge the federal government of those perceived to oppose the president and his agenda",
    "link": "https://www.wcvb.com/article/trump-fires-librarian-of-congress-carla-hayden/64720555",
    "timestamp": "2025-05-09T02:54:02Z"
  },
  {
    "title": "Trump's failed nomination of 'unqualified bumbler' shows his 'power is waning': analyst",
    "description": "President Donald Trump’s failed push to install Ed Martin as U.S. Attorney for the District of Columbia is a telling sign that his second-term power streak on Capitol Hill is beginning to slip, Mother Jones’ Dan Friedman wrote Thursday.Martin’s nomination col…",
    "link": "https://www.rawstory.com/ed-martin-2671921836/",
    "timestamp": "2025-05-09T02:52:22Z"
  },
  {
    "title": "American Robert Prevost Becomes Pope Leo XIV",
    "description": "The new Pope is Robert Prevost, who will be known as Pope Leo XIV - the first American pontiff to be elected leader of the Catholic Church.Prevost, 69, is greeted with huge cheers from thousands gathered in St Peter's Square\"May peace be with all of you,\" he …",
    "link": "https://english.gossiplankanews.com/2025/05/american-robert-prevost-becomes-pope.html",
    "timestamp": "2025-05-09T02:49:00Z"
  },
  {
    "title": "SEC Commissioner Crenshaw Slams Ripple Deal, Agency Direction Under Trump",
    "description": "Commissioner Caroline Crenshaw criticized the agency’s settlement with Ripple, calling it a blow to investor protections and rule of law.",
    "link": "https://decrypt.co/318689/sec-commissioner-crenshaw-slams-ripple-deal-agency-direction-trump",
    "timestamp": "2025-05-09T02:47:11Z"
  },
  {
    "title": "'A monumental day': Catholics in Washington embrace the first US-born pope",
    "description": "Catholics in the nation's capital are rejoicing at the news of the first U.S.-born pope.",
    "link": "https://www.usatoday.com/story/news/nation/2025/05/08/catholics-washington-celebrate-pope/83525271007/",
    "timestamp": "2025-05-09T02:46:00Z"
  },
  {
    "title": "America ‘Dangerously Close’ to ‘Rolling Blackouts & Grid Failure’ Like ‘We Just Saw in Spain,’ Trump’s Interior Secretary Warns",
    "description": "President Donald Trump’s Interior Secretary Doug Burgum is warning that the United States is at risk of major widespread blackouts similar to the power cuts that recently shut down most of Spain and Portugal.. Burgum said the blackouts in Europe were caused b…",
    "link": "https://freerepublic.com/focus/f-news/4315865/posts",
    "timestamp": "2025-05-09T02:44:36Z"
  },
  {
    "title": "Elise Stefanik threatens Haverford College president at latest hearing on campus antisemitism",
    "description": "During the hearing, Republican representatives accused the schools of failing to address antisemitism on their campuses.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-853312",
    "timestamp": "2025-05-09T02:42:09Z"
  },
  {
    "title": "Dr. Oz Warns Of Another Major Challenge Coming To US Health Care",
    "description": "CMS Administrator Dr. Mehmet Oz said the department's challenge remains in spending money efficiently to address chronic illnesses in the U.S.",
    "link": "https://dailycaller.com/2025/05/08/dr-oz-warning-efficient-spending-chronic-illness-united-states/",
    "timestamp": "2025-05-09T02:42:06Z"
  },
  {
    "title": "Trump Abruptly Fires Librarian of Congress",
    "description": "President Donald Trump has fired Carla Hayden, the longtime head of the Library of Congress, in a move that Democratic lawmakers panned as “callous” and “ignorant,” Roll Call reports.",
    "link": "https://politicalwire.com/2025/05/08/trump-abruptly-fires-librarian-of-congress/",
    "timestamp": "2025-05-09T02:41:16Z"
  },
  {
    "title": "India’s macro tailwinds offer relative strength amid global uncertainties: Jyotivardhan Jaipuria",
    "description": "​Our view is that probably the worst of the tariffs we saw on April 2nd and from here tariffs are going to get a little more sane. We will see a lot of deals happening and so maybe four months later we will find that the tariff is not as bothersome, but in sp…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/indias-macro-tailwinds-offer-relative-strength-amid-global-uncertainties-jyotivardhan-jaipuria/articleshow/120997635.cms",
    "timestamp": "2025-05-09T02:41:00Z"
  },
  {
    "title": "Pope Leo to lead first mass in Sistine Chapel after paying surprise visit",
    "description": "Pope Leo will lead his first holy mass as pontiff this morning - after already paying a surprise visit to see staff at his former residence.",
    "link": "https://news.sky.com/story/pope-leo-to-lead-first-holy-mass-in-sistine-chapel-after-paying-surprise-visit-13364207",
    "timestamp": "2025-05-09T02:41:00Z"
  },
  {
    "title": "Hong Kong stocks extend longest winning streak in over a year on hopes of tariff cuts",
    "description": "Hong Kong stocks extend longest winning streak in over a year on hopes of tariff cuts\nUS President Donald Trump says trade talks in Switzerland could yield ‘substantive’ tariff cuts\nHong Kong stocks rose for the seventh straight trading day on Friday, their l…",
    "link": "https://biztoc.com/x/bfbe5291998417e0",
    "timestamp": "2025-05-09T02:39:26Z"
  },
  {
    "title": "Biden Family Desperate for a New Source of Income After ‘the Spigot Is Turned Off’: Report",
    "description": "With former President Joe Biden emerging from a the darkness after the Democratic defeat in November, Americans might have to get used to seeing the octogenarian meandering out in public for a while yet to come. Now getting media advice from a high-powered fo…",
    "link": "https://freerepublic.com/focus/f-news/4315863/posts",
    "timestamp": "2025-05-09T02:37:55Z"
  },
  {
    "title": "Oil prices little changed ahead of Sino-US trade meeting",
    "description": "Oil prices remained steady on Friday after a previous surge, buoyed by easing U.S.-China trade tensions and a new U.S.-Britain trade agreement. Brent crude is at $62.91 a barrel, while WTI is at $59.98. U.S. and China will meet to resolve trade disputes, whil…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-little-changed-ahead-of-sino-us-trade-meeting/articleshow/121014975.cms",
    "timestamp": "2025-05-09T02:36:30Z"
  },
  {
    "title": "Trump taps Fox News' Judge Jeanine Pirro as interim US Attorney in DC, 'The Five' co-host exits network",
    "description": "President Donald Trump has tapped \"The Five\" co-host Judge Jeanine Pirro to be the interim U.S. Attorney for Washington, D.C. \"I am pleased to announce that Judge Jeanine Pirro will be appointed interim United States Attorney for the District of Columbia,\" Tr…",
    "link": "https://freerepublic.com/focus/f-news/4315860/posts",
    "timestamp": "2025-05-09T02:32:59Z"
  },
  {
    "title": "Death penalty for undocumented murderers possible in all 50 states under proposed Texas GOP act",
    "description": "A new act is aiming for the federal government to pursue the death penalty in all 50 states, even where it's banned, for undocumented murderers.",
    "link": "https://www.fox26houston.com/news/death-penalty-undocumented-murderers-possible-all-50-states-under-proposed-texas-gop-act",
    "timestamp": "2025-05-09T02:30:33Z"
  },
  {
    "title": "Trump once called it his favorite word. Now, the Japanese version is all over the news.",
    "description": "Learning how to talk about tariffs, imports and exports is becoming increasingly necessary in everyday conversation.",
    "link": "https://www.japantimes.co.jp/life/2025/05/09/language/japanese-tariff-vocabulary-business/",
    "timestamp": "2025-05-09T02:30:00Z"
  },
  {
    "title": "US Senate Blocks Stablecoin Legislation Over Trump Memecoin Controversy",
    "description": "A bill to promote stablecoins was blocked in the U.S. Senate on Thursday (May 8) over political disagreements and controversy surrounding President Donald Trump’s crypto ventures, according to reporting from Bloomberg. The bill only garnered 48 votes, falling…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/us-senate-blocks-stablecoin-legislation-over-trump-memecoin-controversy/",
    "timestamp": "2025-05-09T02:29:45Z"
  },
  {
    "title": "President Trump fires Librarian of Congress Carla Hayden",
    "description": "President Donald Trump has abruptly fired Librarian of Congress Carla Hayden as the White House continues to purge the federal government of those perceived to oppose the president and his agenda",
    "link": "https://abcnews.go.com/Politics/wireStory/president-trump-fires-librarian-congress-carla-hayden-121625211",
    "timestamp": "2025-05-09T02:29:20Z"
  },
  {
    "title": "JD Vance Defends Trump's Doll Talk — And It's Even Wilder Than You Think",
    "description": "The vice president backed up his boss' call for \"bringing self-reliance back\" to the economy with a bizarre example.",
    "link": "https://www.huffpost.com/entry/jd-vance-trump-dolls-barbies-fox-news_n_681d4e26e4b0a178bc0012d6",
    "timestamp": "2025-05-09T02:28:35Z"
  },
  {
    "title": "Letitia James town hall derailed by Trump supporter’s question: ‘Will you apologize?’",
    "description": "A town hall being held by New York Attorney General Letitia James on Thursday night was disrupted when an apparent Trump supporter stood up to challenge her to apologize to the president.",
    "link": "https://www.foxnews.com/politics/letitia-james-town-hall-derailed-trump-supporters-question-will-you-apologize",
    "timestamp": "2025-05-09T02:27:43Z"
  },
  {
    "title": "First Afrikaners granted refugee status due to arrive in U.S.",
    "description": "Three months ago, President Trump signed an executive order telling white Afrikaans South Africans they could apply for refugee status in the U.S. The first group has been swiftly processed and is set to arrive on U.S. soil Monday",
    "link": "https://www.npr.org/2025/05/09/nx-s1-5391815/first-afrikaners-granted-refugee-status-due-to-arrive-in-u-s",
    "timestamp": "2025-05-09T02:22:22Z"
  },
  {
    "title": "JUST IN: President Trump Abruptly Fires Obama-Appointed Librarian of Congress Who Pushed ‘Sexual Identity’ on Children",
    "description": "President Trump abruptly fired the Democrat Librarian of Congress on Thursday.\nThe post JUST IN: President Trump Abruptly Fires Obama-Appointed Librarian of Congress Who Pushed ‘Sexual Identity’ on Children appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/just-president-trump-abruptly-fires-obama-appointed-librarian/",
    "timestamp": "2025-05-09T02:20:18Z"
  },
  {
    "title": "Chinese companies bought up European ports — and now Brussels is starting to worry",
    "description": "Chinese companies own stakes in about 30 European ports, and that's raising security concerns.",
    "link": "https://www.politico.eu/article/chinese-companies-bought-up-european-ports-and-now-brussels-is-starting-to-worry/",
    "timestamp": "2025-05-09T02:19:00Z"
  },
  {
    "title": "Trump met Israeli Strategic Affairs Minister Dermer on Thursday",
    "description": "US President Donald Trump met Israeli Strategic Affairs Minister Ron Dermer on Thursday and discussed the nucl",
    "link": "https://www.jpost.com/breaking-news/article-853309",
    "timestamp": "2025-05-09T02:18:51Z"
  },
  {
    "title": "Asia’s superrich rapidly scale back U.S. exposure amid trade war",
    "description": "The pullback marks a rapid change from just a few months ago, when many in the region’s business elite cheered the election win of U.S. President Donald Trump.",
    "link": "https://biztoc.com/x/90c2ab9eba77253d",
    "timestamp": "2025-05-09T02:17:07Z"
  },
  {
    "title": "What Pope Leo XIV has said on social media about politics, Trump administration",
    "description": "Hints as to what postures Pope Leo XIV, formerly Cardinal Robert Prevost, might take on some of the most controversial issues roiling the U.S. may come from his recent activity on social media​.",
    "link": "https://www.cbsnews.com/news/pope-leo-xiv-social-media-account-trump-vance-criticism/",
    "timestamp": "2025-05-09T02:16:32Z"
  },
  {
    "title": "Diddy sex trafficking trial closes in on jury selection",
    "description": "Plus Usher announces an Australian tour, the Producer Screen Awards announce their 2025 winners, Death Stranding 2 reveals Australian setting and more.",
    "link": "https://www.abc.net.au/news/2025-05-09/diddy-jury-selection-usher-tour-death-stranding-2/105264414",
    "timestamp": "2025-05-09T02:12:02Z"
  },
  {
    "title": "Asia’s superrich rapidly scale back U.S. exposure amid trade war",
    "description": "The pullback marks a rapid change from just a few months ago, when many in the region’s business elite cheered the election win of U.S. President Donald Trump.",
    "link": "https://www.japantimes.co.jp/business/2025/05/09/economy/asia-rich-cut-us-trade-war/",
    "timestamp": "2025-05-09T02:11:00Z"
  },
  {
    "title": "China can play hardball at looming trade talks with U.S., analysts say",
    "description": "After weeks of tit-for-tat escalation that sent global markets into a tailspin, the two powers will meet this weekend for a chance to break the ice.",
    "link": "https://www.japantimes.co.jp/news/2025/05/09/world/politics/trump-china-weekend-tariff-talks/",
    "timestamp": "2025-05-09T02:11:00Z"
  },
  {
    "title": "Fox News Pundit Names 1 Holy Reason For New Pope's 'Potshots' At Trump Administration",
    "description": "Raymond Arroyo reminded Fox News' Will Cain what comes \"with the job\" after Pope Leo XIV was selected to lead the Roman Catholic Church.",
    "link": "https://www.huffpost.com/entry/fox-news-raymond-arroyo-pope-leo-xiv-immigration_n_681d3795e4b02fbba8e7bdfa",
    "timestamp": "2025-05-09T02:08:22Z"
  },
  {
    "title": "DOGE-led software revamp to speed US job cuts even as Elon Musk steps back",
    "description": "The U.S. government is set to deploy new software, developed under Elon Musk’s DOGE initiative, to accelerate mass layoffs across federal agencies. Known as the “Workforce Reshaping Tool,” it updates an old Pentagon program, automating dismissals amid a broad…",
    "link": "https://economictimes.indiatimes.com/tech/technology/doge-led-software-revamp-to-speed-us-job-cuts-even-as-elon-musk-steps-back/articleshow/121014587.cms",
    "timestamp": "2025-05-09T02:07:10Z"
  },
  {
    "title": "Justice Dept. investigating N.Y. attorney general who has targeted Trump",
    "description": "Letitia James’s lawyer dismissed the allegations as the Trump administration’s “latest act of improper political retribution.\"NEW YORK — The Justice Department has opened a criminal investigation into real estate transactions involving New York Attorney Gener…",
    "link": "https://freerepublic.com/focus/f-news/4315855/posts",
    "timestamp": "2025-05-09T02:07:05Z"
  },
  {
    "title": "5 worrying things you need to know about Leo XIV",
    "description": "Prevost is a vocal critic of U.S. President Donald Trump’s administration and has consistently used his X account to promote material hostile to Trump’s immigration policies. In one instance from February 3, Prevost reposted an article by NCROnline titled “JD…",
    "link": "https://freerepublic.com/focus/f-religion/4315854/posts",
    "timestamp": "2025-05-09T02:06:54Z"
  },
  {
    "title": "In a bid for survival, businesses are labeling tariff costs on receipts to explain price hikes and retain customer trust",
    "description": "Businesses, large and small, are hoping to retain consumer trust by showing how much tariffs imposed on countries by President Donald Trump increase prices.\nDado Ruvic/REUTERS\nA business owner is labeling tariff costs as a separate line on the price tag of hi…",
    "link": "https://biztoc.com/x/d03ec69889bdabf5",
    "timestamp": "2025-05-09T02:06:00Z"
  },
  {
    "title": "Trump names Fox News host as top Washington prosecutor",
    "description": "Donald Trump on Thursday appointed TV personality and former judge Jeanine Pirro to a key post in the US judiciary, the president's latest nomination of a...",
    "link": "https://www.yahoo.com/news/trump-names-fox-news-host-020415975.html",
    "timestamp": "2025-05-09T02:04:15Z"
  },
  {
    "title": "Attorney General Pam Bondi Was Secretly Recorded in Attempted Gotcha Meeting Arranged by James O’Keefe",
    "description": "U.S. Attorney General Pam Bondi was secretly recorded discussing the FBI's files on Jeffrey Epstein during a sting conducted by James O'Keefe.\nThe post Attorney General Pam Bondi Was Secretly Recorded in Attempted Gotcha Meeting Arranged by James O’Keefe firs…",
    "link": "https://www.mediaite.com/politics/attorney-general-pam-bondi-was-secretly-recorded-in-attempted-gotcha-meeting-arranged-by-james-okeefe/",
    "timestamp": "2025-05-09T02:01:23Z"
  },
  {
    "title": "Trump fires longtime Librarian of Congress Carla Hayden",
    "description": "Carla Hayden has been the Librarian of Congress since 2016. She was the first woman and African American to hold the position.",
    "link": "https://www.cbsnews.com/news/trump-fires-longtime-librarian-of-congress-carla-hayden/",
    "timestamp": "2025-05-09T02:01:07Z"
  },
  {
    "title": "Biden Family Desperate for a New Source of Income After ‘the Spigot Is Turned Off’: Report",
    "description": "With former President Joe Biden emerging from a the darkness after the Democratic defeat in November, Americans might have to get used to seeing the octogenarian meandering out in public for a while yet to come.\nThe post Biden Family Desperate for a New Sourc…",
    "link": "https://www.thegatewaypundit.com/2025/05/biden-family-desperate-new-source-income-spigot-turned/",
    "timestamp": "2025-05-09T02:00:28Z"
  },
  {
    "title": "May 1, 2025",
    "description": "Dear friends, Welcome to May, […]",
    "link": "https://www.mutualfundobserver.com/2025/05/may-1-2025/",
    "timestamp": "2025-05-09T02:00:12Z"
  },
  {
    "title": "Trump’s election maestro works to topple Albanian prime minister",
    "description": "Albania’s embattled opposition party is mounting a dramatic election push after years sidelined by Edi Rama’s ruling Socialists.",
    "link": "https://www.politico.eu/article/chris-lacivita-donald-trump-election-fixer-sali-berisha-topple-albania-prime-minister-edi-rama/",
    "timestamp": "2025-05-09T02:00:00Z"
  },
  {
    "title": "In a bid for survival, businesses are labeling tariff costs on receipts to explain price hikes and retain customer trust",
    "description": "Businesses are starting to label tariff costs on labels, receipts, and websites in order to retain trust and explain price hikes.",
    "link": "https://www.businessinsider.com/businesses-are-labeling-tariff-costs-on-receipts-bid-for-survival-2025-5",
    "timestamp": "2025-05-09T01:58:43Z"
  },
  {
    "title": "A moment of hope for U.S-China trade frictions",
    "description": "The U.S. and China will meet in Switzerland to discuss trade tensions, but deep mistrust and structural issues are hurdles they will have to overcome to make progress.",
    "link": "https://www.japantimes.co.jp/editorials/2025/05/09/us-china-trade-frictions/",
    "timestamp": "2025-05-09T01:56:00Z"
  },
  {
    "title": "How good is the UK trade pact for America?",
    "description": "How good is the UK trade pact for America?\nWhen President Donald Trump unveiled sweeping taxes on imports from around the world last month, he said the measures aimed to right America's trade relationships.\nIn his new pact with the UK, we got a glimpse of the…",
    "link": "https://biztoc.com/x/10a6e1cc89bcee71",
    "timestamp": "2025-05-09T01:54:57Z"
  },
  {
    "title": "Trump’s tariffs have launched global trade wars. Here’s a timeline of how we got here",
    "description": "Trump’s tariffs have launched global trade wars. Here’s a timeline of how we got here\nTrump’s tariffs have launched global trade wars. Here’s a timeline of how we got here\nNEW YORK (AP) —\nLong-threatened tariffs from U.S. President Donald Trump have plunged t…",
    "link": "https://biztoc.com/x/4d78dcb64b1179da",
    "timestamp": "2025-05-09T01:54:50Z"
  },
  {
    "title": "Gold firms on dip buying; US-China trade talks in focus",
    "description": "Gold prices edged higher on Friday as investors sought refuge in the precious metal following a previous session dip, awaiting U.S.-China trade discussions this weekend. The market is also digesting the recent U.S.-UK trade agreement and anticipating insights…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-firms-on-dip-buying-us-china-trade-talks-in-focus/articleshow/121014421.cms",
    "timestamp": "2025-05-09T01:53:55Z"
  },
  {
    "title": "Wall Street gains as first trade deal reached",
    "description": "American stock markets saw gains on Thursday. Investors reacted positively to the new trade deal between the U.S. and Britain. The agreement involves lowered tariffs and increased access for U.S. goods. Airline stocks, especially Delta Air Lines, experienced …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-gains-as-first-trade-deal-reached/articleshow/121014416.cms",
    "timestamp": "2025-05-09T01:52:02Z"
  },
  {
    "title": "President Donald Trump fires Librarian of Congress Carla Hayden (Associated Press)",
    "description": "Associated Press:\nPresident Donald Trump fires Librarian of Congress Carla Hayden  —  President Donald Trump abruptly fired Librarian of Congress Carla Hayden on Thursday as the White House continues to purge the federal government of those perceived to oppos…",
    "link": "https://www.memeorandum.com/250508/p157",
    "timestamp": "2025-05-09T01:50:01Z"
  },
  {
    "title": "Trump names Fox News host as top Washington DC prosecutor",
    "description": "Jeanine Pirro replaces Trump's previous pick, who lost Republicans support over the US Capitol riot.",
    "link": "https://www.bbc.com/news/articles/cx2jnl79mejo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-09T01:47:50Z"
  },
  {
    "title": "Trump names Fox News host as top Washington DC prosecutor",
    "description": "Jeanine Pirro replaces Trump's previous pick, who lost Republicans support over the US Capitol riot.",
    "link": "https://www.bbc.com/news/articles/cx2jnl79mejo",
    "timestamp": "2025-05-09T01:47:45Z"
  },
  {
    "title": "Taiwan's chip industry faces string of crises, but China steps in as surprising lifeline",
    "description": "Taiwan's semiconductor equipment supply chain is navigating a period of unprecedented turbulence, battered by a confluence of global tariff escalations, tighter AI chip export restrictions, and a rapidly strengthening New Taiwan dollar. The specter of further…",
    "link": "https://www.digitimes.com/news/a20250507PD229/taiwan-ict-manufacturing-equipment-ai-chip-supply-chain.html",
    "timestamp": "2025-05-09T01:47:21Z"
  },
  {
    "title": "Librarian of Congress Carla Hayden is fired by Trump",
    "description": "President Donald Trump fired Librarian of Congress Carla Hayden Thursday, according to a library spokesperson and an email obtained by POLITICO. \n“Carla, On behalf of President Donald J. Trump, I am writing to inform you that your position as the Librarian of…",
    "link": "https://biztoc.com/x/5c232826e8322174",
    "timestamp": "2025-05-09T01:43:54Z"
  },
  {
    "title": "World's second largest carmaker to move manufacturing of luxury brand to US",
    "description": "The second largest carmaker in the world will be relocating the manufacturing of its luxury brand to the United States after President Donald Trump has been encouraging car companies to do business in the US. Volkswagen Group, which is the second largest car …",
    "link": "https://freerepublic.com/focus/f-news/4315850/posts",
    "timestamp": "2025-05-09T01:43:47Z"
  },
  {
    "title": "Robert Prevost's Posts on Social Media Questioned Trump's Immigration Policy",
    "description": "Social media posts from Robert Prevost, newly named Pope Leo XIV, show recent criticism of the Trump administration's immigration policies. Why It Matters President Donald Trump's push for mass deportations has been getting held up in courts nationwide. Withi…",
    "link": "https://freerepublic.com/focus/f-news/4315849/posts",
    "timestamp": "2025-05-09T01:43:20Z"
  },
  {
    "title": "Trump Abruptly Fires Librarian Of Congress Carla Hayden",
    "description": "Trump has abruptly fired Librarian of Congress Carla Hayden as the White House continues to purge the federal government of those perceived to oppose the president.",
    "link": "https://www.huffpost.com/entry/trump-fires-librarian-of-congress-carla-hayden_n_681d5cdee4b0a178bc00183f",
    "timestamp": "2025-05-09T01:42:24Z"
  },
  {
    "title": "Up to 1,000 transgender troops are being moved out of the military in new Pentagon order (Associated Press)",
    "description": "Associated Press:\nUp to 1,000 transgender troops are being moved out of the military in new Pentagon order  —  The Supreme Court this week allowed President Donald Trump to implement his ban on transgender people serving in the military while a legal challeng…",
    "link": "https://www.memeorandum.com/250508/p156",
    "timestamp": "2025-05-09T01:40:02Z"
  },
  {
    "title": "FEMA’s acting administrator is replaced a day after congressional testimony",
    "description": "WASHINGTON (AP) — The Federal Emergency Management Agency faced fresh upheaval Thursday just weeks before the start of hurricane season when the acting administrator was pushed out and replaced by another official from the Department of Homeland Security.The …",
    "link": "https://freerepublic.com/focus/f-news/4315848/posts",
    "timestamp": "2025-05-09T01:39:43Z"
  },
  {
    "title": "OpenAI CEO Sam Altman and other US tech leaders testify to Congress on AI competition with China",
    "description": "OpenAI CEO Sam Altman and tech leaders from Microsoft, AMD, and CoreWeave told US lawmakers that AI could surpass the internet in societal impact, urging unified regulation and major infrastructure investment. They warned that fragmented rules and restrictive…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openai-ceo-sam-altman-and-other-us-tech-leaders-testify-to-congress-on-ai-competition-with-china/articleshow/121014299.cms",
    "timestamp": "2025-05-09T01:38:45Z"
  },
  {
    "title": "‘It’s Good TV’: Chris Hayes Marvels at Jeanine Pirro’s Most Unhinged Moments After Trump Appoints Her as U.S. Attorney",
    "description": "\"I'm just gonna say this straight up. Game recognize game.\"\nThe post ‘It’s Good TV’: Chris Hayes Marvels at Jeanine Pirro’s Most Unhinged Moments After Trump Appoints Her as U.S. Attorney first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/its-good-tv-chris-hayes-marvels-at-jeanine-pirros-most-unhinged-moments-after-trump-appoints-her-as-u-s-attorney/",
    "timestamp": "2025-05-09T01:30:04Z"
  },
  {
    "title": "Bristow received €2.5m for Irish rescue service as handover delays persist",
    "description": "US firm Bristow, which is taking over the operation of Ireland’s airborne coastguard search-and-rescue service, received $2.8m (€2.5m) from the Government in the first quarter of this year under its contract.",
    "link": "https://www.independent.ie/business/bristow-received-25m-for-irish-rescue-service-as-handover-delays-persist/a947704717.html",
    "timestamp": "2025-05-09T01:30:00Z"
  },
  {
    "title": "President Donald Trump fires Librarian of Congress Carla Hayden",
    "description": "President Trump has fired Librarian of Congress Carla Hayden, sparking outrage from House Democrats. Representative Rosa DeLauro condemned the dismissal as a callous act and an attack on the independence of the Library of Congress. Hayden's tenure was praised…",
    "link": "https://timesofindia.indiatimes.com/world/us/president-donald-trump-fires-librarian-of-congress-carla-hayden/articleshow/121014195.cms",
    "timestamp": "2025-05-09T01:28:15Z"
  },
  {
    "title": "'There is no truce': Ukraine's soldiers and civilians on Russia's ceasefire",
    "description": "The BBC's Yogita Limaye went to the Donetsk region of Ukraine to speak to soldiers about life on the frontline.",
    "link": "https://www.bbc.com/news/articles/c5y63dvj5dqo",
    "timestamp": "2025-05-09T01:25:39Z"
  },
  {
    "title": "Pam Bondi Holds Key Meeting In Trump Push To Reinstate Death Sentences",
    "description": "The Trump administration’s longshot campaign to bring state death sentences against people who will already die in prison “purely political,” one expert said.",
    "link": "https://www.huffpost.com/entry/pam-bondi-meet-victim-family-member-new-death-sentences_n_681d411ee4b02fbba8e7c258",
    "timestamp": "2025-05-09T01:24:41Z"
  },
  {
    "title": "US VP Vance says war between India and Pakistan will be 'none of our business'",
    "description": "U.S. Vice President JD Vance said on Thursday that India and Pakistan should de-escalate tensions, but he added that the U.S. cannot control the nuclear...",
    "link": "https://www.yahoo.com/news/us-vp-vance-says-war-012351989.html",
    "timestamp": "2025-05-09T01:23:51Z"
  },
  {
    "title": "Taylor and Price’s far-right putsch in the Liberals would create the parliamentary wing of Sky News",
    "description": "The Liberal leadership contest between Sussan Ley and Angus Taylor could start an ongoing battle between moderates and the right. And that's good news only for Labor.\nThe post Taylor and Price’s far-right putsch in the Liberals would create the parliamentary …",
    "link": "http://www.crikey.com.au/2025/05/09/liberal-leadership-angus-taylor-jacinta-nampijinpa-price-sussan-ley/",
    "timestamp": "2025-05-09T01:23:07Z"
  },
  {
    "title": "It's no joke",
    "description": "These troubling times call for national leadership that has all of its marbles. Donald Trump does not!",
    "link": "https://www.ncspin.com/its-no-joke",
    "timestamp": "2025-05-09T01:22:05Z"
  }
]