[
  {
    "title": "Scott Jennings: ‘The Plight of American Hero Big Balls Has Set Off a Firestorm’ in the GOP",
    "description": "CNN senior political commentator Scott Jennings declared on Wednesday that \"the plight of American hero Big Balls\" had \"set off a firestorm.\"\nThe post Scott Jennings: ‘The Plight of American Hero Big Balls Has Set Off a Firestorm’ in the GOP first appeared on…",
    "link": "https://www.mediaite.com/media/tv/scott-jennings-the-plight-of-american-hero-big-balls-has-set-off-a-firestorm-in-the-gop/",
    "timestamp": "2025-08-07T04:10:10Z"
  },
  {
    "title": "Trump moves to shut down NASA missions that measure carbon dioxide and plant health",
    "description": "The Trump administration is moving to shut down two NASA missions that monitor a potent greenhouse gas and plant health, potentially shutting off an important s",
    "link": "https://katu.com/news/nation-world/trump-moves-to-shut-down-nasa-missions-that-measure-carbon-dioxide-and-plant-health",
    "timestamp": "2025-08-07T04:08:04Z"
  },
  {
    "title": "Higher US Tariffs Take Effect On Dozens Of Economies",
    "description": "Higher US tariffs came into effect for dozens of economies Thursday, drastically raising the stakes in President Donald Trump's wide-ranging efforts to reshape global trade.",
    "link": "https://www.ibtimes.com/higher-us-tariffs-take-effect-dozens-economies-3780386",
    "timestamp": "2025-08-07T04:06:06Z"
  },
  {
    "title": "Trump's new tariffs take effect in trade war escalation",
    "description": "The US revised tariffs for much of the world and extended the deadline to strike deals by Thursday.",
    "link": "https://www.bbc.com/news/articles/cx23jmvn5yzo",
    "timestamp": "2025-08-07T04:05:25Z"
  },
  {
    "title": "'They Are Next': Trump Sends Chilling Warning To Jimmy Kimmel, Other Hosts",
    "description": "The president tore into the late night hosts who mock him.",
    "link": "https://www.huffpost.com/entry/trump-late-night-threat-kimmel_n_68940f03e4b0a1fdf7a9ddc6",
    "timestamp": "2025-08-07T04:04:28Z"
  },
  {
    "title": "Trump’s historic new tariffs are now in effect. Here’s what you need to know | CNN Business",
    "description": "President Donald Trump just enacted a new wave of tariffs on dozens of America’s trading partners, marking a substantial escalation in ongoing trade tensions that could constitute the biggest change to the global economy in nearly a century.",
    "link": "https://www.cnn.com/2025/08/06/business/trump-tariffs-in-effect",
    "timestamp": "2025-08-07T04:01:02Z"
  },
  {
    "title": "Soko Glam to Launch K-beauty Shops-in-shop at Space NK",
    "description": "Soko Glam is launching K-beauty shop-in-shops at Space NK, which was acquired by Ulta in July. Brands will include Some By Mi, Skin 1004 and more.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/k-beauty-space-nk-soko-glam-retail-launch-1238030012/",
    "timestamp": "2025-08-07T04:01:00Z"
  },
  {
    "title": "New tariffs snap into effect, raising import taxes to highest level since Great Depression",
    "description": "After months of delays and extensions, President Donald Trump’s comprehensive and sweeping tariffs slate took effect Thursday just after midnight, shifting his global trade reset into high gear",
    "link": "https://www.nbcnews.com/business/business-news/trump-tariffs-latest-round-takes-effect-thursday-august-7-2025-rcna223461",
    "timestamp": "2025-08-07T04:01:00Z"
  },
  {
    "title": "Why marketers aren’t panicking in face of the latest tariff pressures (yet)",
    "description": "There's reasons to be cheerful (well, cautiously optimistic) about the ad economy. Because the gloom expected earlier in the year hasn't really materialized.",
    "link": "http://digiday.com/marketing/the-rundown-why-marketers-arent-panicking-in-face-of-the-latest-tariff-pressures-yet/",
    "timestamp": "2025-08-07T04:01:00Z"
  },
  {
    "title": "Lockheed Gets THAAD Modification Contract | Israel Completed David’s Sling Update Tests | India Not Considering Boramae",
    "description": "Americas Huntington Ingalls won a $20 million cost-plus-incentive-fee modification to previously awarded contract N00024-23-C-2324 for work associated with the DDG 1000 modernization period execution. Work will be performed in Pascagoula, Mississippi (95%); a…",
    "link": "https://www.defenseindustrydaily.com/lockheed-gets-thaad-modification-contract-israel-completed-davids-sling-update-tests-india-not-considering-boramae-0243323/",
    "timestamp": "2025-08-07T04:00:45Z"
  },
  {
    "title": "Wall Street Journal Convenes a Clinic in Media Bias",
    "description": "Early this week the Wall Street Journal sent out a Politics and Policy email blast concerning an upcoming story:\r\n\r\n\r\nWSJ News Exclusive\r\n\r\nThe Justice Department tapped a grand jury to re-investigate the 2016 Trump-Russia probe.\r\n\r\nTh...",
    "link": "https://www.americanthinker.com/articles/2025/08/wall_street_journal_provides_clinic_in_media_bias.html",
    "timestamp": "2025-08-07T04:00:00Z"
  },
  {
    "title": "Get woke, go broke: Howard Stern’s $500M fall from relevance",
    "description": "Howard Stern didn’t just have a radio show. He had a revolution. He was brash, vulgar, and fearless. He gave voice to the silenced, told dirty jokes with conviction, and turned a microphone into a battering ram against establishment sanctimony....",
    "link": "https://www.americanthinker.com/blog/2025/08/get_woke_go_broke_howard_stern_s_500m_fall_from_relevance.html",
    "timestamp": "2025-08-07T04:00:00Z"
  },
  {
    "title": "The ‘Ghastly’ Gamble: How the Clinton–Obama Intelligence Op Risked War to Take Down Trump",
    "description": "They knew it could spark a geopolitical catastrophe. They did it anyway.\r\n\r\nLet’s dispense with illusions: Vladimir Putin is not misunderstood. He is an autocrat. He lies, he invades, he suppresses dissent, and he trades ruthlessly in realpolit...",
    "link": "https://www.americanthinker.com/articles/2025/08/the_ghastly_gamble_how_the_clinton_obama_intelligence_op_risked_war_to_take_down_trump.html",
    "timestamp": "2025-08-07T04:00:00Z"
  },
  {
    "title": "One of the media’s favorite economists is at it again",
    "description": "For four years the media and other Democrats gaslighted the public about how great the Biden economic policies were. But six months into Trump’s term, the media is trashing Trump’s policies in order to influence, not inform, the voters. A...",
    "link": "https://www.americanthinker.com/blog/2025/08/one_of_the_media_s_favorite_economists_is_at_it_again.html",
    "timestamp": "2025-08-07T04:00:00Z"
  },
  {
    "title": "Former 'Superman' Actor Dean Cain Says He's Signed Up for ICE",
    "description": "\"I've spoken with some officials over at ICE, and I will be sworn in as an ICE agent, ASAP,\" the actor says.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/superman-actor-dean-cain-joins-ice-1236339156/",
    "timestamp": "2025-08-07T03:58:50Z"
  },
  {
    "title": "‘South Park’ Exposes Charlie Kirk for Stealing Cartman’s Shtick",
    "description": "Cartman was the first unlovable troll to masterdebate to college girls while living in his mom’s house",
    "link": "https://www.cracked.com/article_47764_south-park-exposes-charlie-kirk-for-stealing-cartmans-shtick.html",
    "timestamp": "2025-08-07T03:55:00Z"
  },
  {
    "title": "Apple's $600 billion US manufacturing commitment: 10 key things that change from iPhones to iPads and Watch",
    "description": "Apple on August 6 announced its American Manufacturing Program, with an expanded $600 billion of total commitment in the United States. Here's what changes for its products from iPhones to iPad and Watch.",
    "link": "https://www.livemint.com/companies/news/apple-american-manufacturing-program-600bn-us-commitment-10-key-change-domestic-glass-chips-jobs-iphone-ipad-watch-video-11754528232932.html",
    "timestamp": "2025-08-07T03:49:54Z"
  },
  {
    "title": "Trump hikes tariffs on India to 50%, scrambling the country’s plans to be an alternative to China",
    "description": "President Donald Trump signed an executive order Wednesday to place an additional 25% tariff on India for its purchases of Russian oil, bringing the combined tariffs imposed by the United States on its ally to 50%.\nThe tariffs would go into effect 21 days aft…",
    "link": "https://biztoc.com/x/a0726b2bec6786ed",
    "timestamp": "2025-08-07T03:49:37Z"
  },
  {
    "title": "Trump's ‘100% chip tariffs’ hit Japan's giants, but Samsung and TSMC rise on U.S. bets",
    "description": "Asia semiconductor-related stocks traded mixed Thursday after U.S. President Donald Trump announced he would impose a 100% tariff on chip imports, with an exemption for companies that are \"building in the United States.\"\nDetails on how much domestic manufactu…",
    "link": "https://biztoc.com/x/743c5678889784f3",
    "timestamp": "2025-08-07T03:49:22Z"
  },
  {
    "title": "Leather, textiles, gems, jewellery, shrimp exports to hit hard from 50% US tariff",
    "description": "The 25 per cent duty, announced on July 31, will come into force from August 7 (9.30 am IST) and the additional 25% will come into effect from August 27",
    "link": "https://www.thehindubusinessline.com/economy/leather-textiles-gems-jewellery-shrimp-exports-to-hit-hard-from-50-us-tariff/article69904011.ece",
    "timestamp": "2025-08-07T03:46:42Z"
  },
  {
    "title": "Trump indicates China could face secondary sanctions for Russian Oil purchase",
    "description": "The EU was also the largest buyer of Russia's pipeline gas, purchasing 37% of it, followed by China (30%) and Turkiye (27%). Neither China nor Turkey are facing additional US tariffs specifically tied to Russian Oil or Oil Product imports",
    "link": "https://www.thehindubusinessline.com/news/world/trump-indicates-china-could-face-secondary-sanctions-for-russian-oil-purchase/article69904007.ece",
    "timestamp": "2025-08-07T03:41:29Z"
  },
  {
    "title": "Trump Vowed 'A Lot More' Secondary Sanctions",
    "description": "US President Donald Trump said on Wednesday that there will soon be “a lot more” secondary sanctions over the situation in Ukraine.",
    "link": "https://sputnikglobe.com/20250807/trump-vowed-a-lot-more-secondary-sanctions-1122564976.html",
    "timestamp": "2025-08-07T03:39:00Z"
  },
  {
    "title": "TSMC's exemption gamble: four critical unknowns in Trump's chip tariff war",
    "description": "US President Donald Trump has revived his \"America First\" stance, proposing a 100% tariff on imported semiconductor products. This has put global technology industries, especially major semiconductor hubs like Taiwan, South Korea, and Japan, on high alert.",
    "link": "https://www.digitimes.com/news/a20250807PD221/donald-trump-taiwan-policy-supply-chain-investment.html",
    "timestamp": "2025-08-07T03:38:29Z"
  },
  {
    "title": "Japan's Topix hits record high on Wall Street rally, solid earnings",
    "description": "Japan's Topix index soared to a record high, mirroring Wall Street's overnight gains and fueled by strong corporate earnings, reinforcing wage growth expectations. The Nikkei also climbed, continuing a three-day rally after Monday's sharp decline. Market conf…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-topix-hits-record-high-on-wall-street-rally-solid-earnings/articleshow/123155177.cms",
    "timestamp": "2025-08-07T03:38:00Z"
  },
  {
    "title": "Gokaldas Exports, KPR Mill, other textile stocks in focus after Trump hikes tariff on India to 50%",
    "description": "Indian textile stocks like Gokaldas Exports and KPR Mill may face pressure after US President Trump doubled tariffs on Indian goods to 50%. The hike, citing national security concerns over Russian oil imports, impacts textiles, gems, seafood, and more—excludi…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/gokaldas-exports-kpr-mill-other-textile-stocks-in-focus-after-trump-hikes-tariff-on-india-to-50/articleshow/123155131.cms",
    "timestamp": "2025-08-07T03:33:45Z"
  },
  {
    "title": "'If that's how y'all roll!': Panel erupts at GOP strategist over Trump's D.C. 'fantasy'",
    "description": "The panel on CNN's \"NewsNight with Abby Phillip\" melted down on Wednesday after a GOP strategist backed up one of the president's assertions about crime.GOP strategist Scott Jennings said President Donald Trump was right to threaten to federalize the District…",
    "link": "https://www.rawstory.com/district-of-columbia/",
    "timestamp": "2025-08-07T03:30:51Z"
  },
  {
    "title": "Former Labor Secretary Calls Absolute 'Bulls**t' On Trump's Jobs Report Claims",
    "description": "Robert Reich slammed Trump and his \"lackeys\" for pushing a \"big crock of lies.\"",
    "link": "https://www.huffpost.com/entry/former-labor-secretary-robert-reich-trump-firing-jobs-report_n_6893fcfde4b00cfa12730b14",
    "timestamp": "2025-08-07T03:28:32Z"
  },
  {
    "title": "Two bills benefiting Alaska Native populations signed into law",
    "description": "Two bills benefiting Alaska Native populations signed into lawalaskasnewssource.com",
    "link": "https://www.alaskasnewssource.com/2025/08/07/two-bills-benefiting-alaska-native-populations-signed-into-law/",
    "timestamp": "2025-08-07T03:26:26Z"
  },
  {
    "title": "Markets rise as Trump chip exemptions boost tech giants",
    "description": "Asian equities rose as chip stocks surged following Donald Trump's pledge to exempt US-based semiconductor investments from a planned 100% tariff. TSMC, Samsung, and Apple-linked firms led gains. Markets were also buoyed by Fed rate cut hopes and eased concer…",
    "link": "https://economictimes.indiatimes.com/tech/technology/markets-rise-as-trump-chip-exemptions-boost-tech-giants/articleshow/123155001.cms",
    "timestamp": "2025-08-07T03:24:52Z"
  },
  {
    "title": "White House: Apple to Boost US Production With $100 Billion Plan",
    "description": "President Donald Trump is set to announce that Apple will invest another $100 billion in US manufacturing. The move aims to protect the company from new tariffs and increase domestic production. With this pledge, Apple’s total US investment will reach $600 bi…",
    "link": "https://www.macobserver.com/news/white-house-apple-to-boost-domestic-production-with-100-billion-plan/",
    "timestamp": "2025-08-07T03:24:19Z"
  },
  {
    "title": "CNN Host Asks Scott Jennings, ‘Why Is JD Vance So Concerned With Bullsh*t?’",
    "description": "CNN's John Berman used President Donald Trump's own words against Vice President JD Vance regarding the Jeffrey Epstein files. \nThe post CNN Host Asks Scott Jennings, ‘Why Is JD Vance So Concerned With Bullsh*t?’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/cnn-host-asks-scott-jennings-why-is-jd-vance-so-concerned-with-bullsht/",
    "timestamp": "2025-08-07T03:22:34Z"
  },
  {
    "title": "'Good Chance of Meeting' with Putin, Zelensky - Trump",
    "description": "US President Donald Trump told reporters that there is a good chance he will very soon meet with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky.",
    "link": "https://sputnikglobe.com/20250807/good-chance-of-meeting-with-putin-zelensky---trump-1122564682.html",
    "timestamp": "2025-08-07T03:19:00Z"
  },
  {
    "title": "Donald Trump Sex Traffics Dora The Explorer in Tonight’s New ‘South Park’",
    "description": "By\n Keegan Kelly\n Published: August 06th, 2025",
    "link": "https://www.cracked.com/article_47761_donald-trump-sex-traffics-dora-the-explorer-in-tonights-new-south-park.html",
    "timestamp": "2025-08-07T03:18:00Z"
  },
  {
    "title": "Malaysia’s semiconductor exports still exempted from retaliatory tariffs, says Tengku Zafrul",
    "description": "KUALA LUMPUR: Malaysia's semiconductor exports to the United States remain exempt from retaliatory tariffs for now, says Tengku Datuk Seri Zafrul Abdul Aziz. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/08/07/malaysias-semiconductor-exports-still-exempted-from-retaliatory-tariffs-says-tengku-zafrul",
    "timestamp": "2025-08-07T03:18:00Z"
  },
  {
    "title": "Dem Rep. Doggett: States Like Maryland Should Gerrymander to Counter GOP",
    "description": "On Wednesday’s broadcast of MSNBC’s “The Weeknight,” Rep. Lloyd Doggett (D-TX) said that in states where Democrats have some degree of control of the state government, like in Maryland, Democrats should look at redrawing their congressional maps in response t…",
    "link": "https://www.breitbart.com/clips/2025/08/06/dem-rep-doggett-states-like-maryland-should-gerrymander-to-counter-gop/",
    "timestamp": "2025-08-07T03:16:50Z"
  },
  {
    "title": "South Park Imagines Mar-A-Lago as Trump Fantasy Island with Mini J.D. Vance Handing Out Baby Oil",
    "description": "The episode also included multiple instances of Kristi Noem killing dogs.\nSouth Park Imagines Mar-A-Lago as Trump Fantasy Island with Mini J.D. Vance Handing Out Baby Oil\nAlex Young",
    "link": "https://consequence.net/2025/08/south-park-season-27-epiosode-2-mar-a-lago-fantasy-island-mini-jd-vance/",
    "timestamp": "2025-08-07T03:15:56Z"
  },
  {
    "title": "Trump Says U.S.-Made Semiconductors Will Go Untouched But Foreign Ones Hit With 100% Tariff",
    "description": "Trump said chips and semiconductors made overseas will face an estimated 100% tariff, while U.S.-made chips will face none.",
    "link": "https://dailycaller.com/2025/08/06/donald-trump-semiconductors-american-foreign-tariff-apple/",
    "timestamp": "2025-08-07T03:13:03Z"
  },
  {
    "title": "US to Scale Back Human Rights Accusations Against 3 Countries: Report",
    "description": "The Washington Post said the three drafts it reviewed omit any mention of violence against LGBTQ+ people.",
    "link": "https://www.newsweek.com/us-human-rights-reports-state-department-scale-back-2110002",
    "timestamp": "2025-08-07T03:11:18Z"
  },
  {
    "title": "Trump announces 100 percent tariff on semiconductor imports",
    "description": "US President Donald Trump said the tariff will not impact companies if they have already invested in US facilities.",
    "link": "https://www.aljazeera.com/news/2025/8/7/trump-announces-100-percent-tariff-on-semiconductor-imports",
    "timestamp": "2025-08-07T03:10:49Z"
  },
  {
    "title": "‘South Park’ Lets Loose With A Trump, Satan & JD Vance Ménage À Trois, ICE Raiding Heaven, & Shooting Krypto The Superdog",
    "description": "In a nod and head butt to Donald Trump and masked ICE abductions of undocumented immigrants and U.S. citizens, South Park was very relevant tonight. Just ask Vice President JD Vance and Homeland Security Secretary Kristi Noem “A few years ago I had to put my …",
    "link": "http://deadline.com/2025/08/south-park-trump-kristi-noem-ice-taunting-1236480470/",
    "timestamp": "2025-08-07T03:08:00Z"
  },
  {
    "title": "UCLA says Trump administration froze $584 million of its federal funding",
    "description": "The government alleges universities, including UCLA, allowed antisemitism during the protests. Large demonstrations took place at UCLA last year.",
    "link": "https://indianexpress.com/article/world/ucla-says-trump-administration-froze-584-million-federal-funding-10174672/",
    "timestamp": "2025-08-07T03:06:30Z"
  },
  {
    "title": "Trump Floats Possible Tariffs on China for Buying Russian Oil",
    "description": "President Donald Trump said he could punish China with additional tariffs over its purchases of Russian oil, though one of his top advisers played down the likelihood.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-floats-possible-tariffs-on-china-for-buying-russian-oil",
    "timestamp": "2025-08-07T03:05:42Z"
  },
  {
    "title": "Samsung, SK Hynix not subject to 100% U.S. chip tariffs, South Korean envoy says",
    "description": "Trade envoy Yeo Han-koo said that South Korea will face the most favorable U.S. tariff rates on chips under the trade deal between Washington and Seoul.",
    "link": "https://www.japantimes.co.jp/business/2025/08/07/tech/south-korea-samsung-sk-hynix-tariffs/",
    "timestamp": "2025-08-07T03:03:00Z"
  },
  {
    "title": "Markets Rise As Trump Chip Exemptions Boost Tech Giants",
    "description": "Asian equities rose Thursday, with big-name chip firms making big gains after Donald Trump said those investing in the United States would be exempted from a threatened 100-percent tariff on semiconductors.",
    "link": "https://www.ibtimes.com/markets-rise-trump-chip-exemptions-boost-tech-giants-3780378",
    "timestamp": "2025-08-07T03:00:36Z"
  },
  {
    "title": "Markets Rise As Trump Chip Exemptions Boost Tech Giants",
    "description": "Asian equities rose Thursday, with big-name chip firms making big gains after Donald Trump said those investing in the United States would be exempted from a threatened 100-percent tariff on semiconductors.",
    "link": "https://www.ibtimes.com.au/markets-rise-trump-chip-exemptions-boost-tech-giants-1860014",
    "timestamp": "2025-08-07T03:00:28Z"
  },
  {
    "title": "Asian stocks climb, dollar droops on Fed easing bets",
    "description": "TOKYO :Asian equities rose on Thursday, with Japanese shares hitting a record high, as tech-led gains on Wall Street, upbeat earnings and growing expectations for U.S. rate cuts boosted sentiment.The prospect of a meeting between U.S. President Donald Trump a…",
    "link": "https://www.channelnewsasia.com/business/asian-stocks-climb-dollar-droops-fed-easing-bets-5281936",
    "timestamp": "2025-08-07T02:59:56Z"
  },
  {
    "title": "Trump's additional 25% tariffs may dent India’s FY26 growth by 0.4%",
    "description": "US President Trump's 25% tariff hike on Indian imports, totaling 50%, threatens India's FY26 GDP growth by up to 0.4%. Experts warn of a major blow to exporters, particularly MSMEs in sectors like garments and electronics, potentially halting shipments and im…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/trumps-additional-25-tariffs-may-dent-indias-fy26-growth-by-0-4/articleshow/123154658.cms",
    "timestamp": "2025-08-07T02:58:51Z"
  },
  {
    "title": "Markets rise as Trump chip exemptions boost tech giants",
    "description": "Asian equities rose Thursday, with big-name chip firms making big gains after Donald Trump said those investing in the United States would be exempted from a...",
    "link": "https://finance.yahoo.com/news/markets-rise-trump-chip-exemptions-025739234.html",
    "timestamp": "2025-08-07T02:57:39Z"
  },
  {
    "title": "Why Trump’s secondary tariffs on Russia could bite the US, its allies too",
    "description": "China and India would be hit hardest. But Europe would be affected, and the US would face risks as well.",
    "link": "https://www.aljazeera.com/news/2025/8/7/why-trumps-secondary-tariffs-on-russia-could-bite-the-us-its-allies-too",
    "timestamp": "2025-08-07T02:55:53Z"
  },
  {
    "title": "Gold Gains as Trump’s Tariff Agenda Adds to Market Uncertainty",
    "description": "Gold gained as traders weighed uncertainty created by President Donald Trump’s latest trade moves, including threatening a 100% tariff on chip imports.",
    "link": "https://financialpost.com/pmn/business-pmn/gold-gains-as-trumps-tariff-agenda-adds-to-market-uncertainty",
    "timestamp": "2025-08-07T02:55:41Z"
  },
  {
    "title": "Trump chip tariff sends South Korean chip giants scrambling",
    "description": "US President Donald Trump's declaration of 100% tariffs on all chip imports has sent shockwaves through South Korean semiconductor firms Samsung Electronics Co. and SK Hynix Inc.",
    "link": "https://www.digitimes.com/news/a20250807PD219/donald-trump-semiconductors-chips-samsung-texas.html",
    "timestamp": "2025-08-07T02:55:04Z"
  },
  {
    "title": "South Park Savages ICE and Kristi Noem, Sends Trump to Mar-a-Lago — Read Recap",
    "description": "Did you think South Park would take it easy on Donald Trump this week? Yeah, we didn’t, either. In Wednesday’s episode, Cartman is enraged when he sees Clyde start a debate podcast where he says terrible things about women and Jews. Hey, that’s Cartman’s thin…",
    "link": "https://tvline.com/recaps/south-park-trump-episode-2-recap-ice-kristi-noem-1235486086/",
    "timestamp": "2025-08-07T02:54:46Z"
  },
  {
    "title": "‘South Park’ Mocks a Puppy-Shooting Kristi Noem and JD Vance Offers to Rub Baby Oil on Satan In Wild New Episode",
    "description": "In the second episode of “South Park” Season 27, United States Secretary of Homeland Security Kristi Noem leads ICE in a raid on the local production of “Dora the Explorer Live!” After losing his job as counselor of South Park Elementary, Mr. Mackey is out of…",
    "link": "https://variety.com/2025/tv/news/south-park-puppy-shooting-kristi-noem-jd-vance-baby-oil-ice-1236479302/",
    "timestamp": "2025-08-07T02:53:37Z"
  },
  {
    "title": "Apple bets bigger on US with $100 billion pledge amid tariff pressure",
    "description": "Apple pledges $100 bn more for US manufacturing; total now $600 bn. Trump hails move as a major win. Cook eyes supply chain expansion, stock jumps 5%.",
    "link": "https://www.thehindubusinessline.com/info-tech/apple-bets-bigger-on-us-with-100-billion-pledge-amid-tariff-pressure/article69903935.ece",
    "timestamp": "2025-08-07T02:53:23Z"
  },
  {
    "title": "Trump slashed Medicaid — now he’s got another health care crisis looming - NewsBreak",
    "description": "President Donald Trump and congressional Republicans are trying to sell the American public on their “ One Big, Beautiful Bill ” despite the fact many Amer",
    "link": "https://www.newsbreak.com/share/4160324298365-trump-slashed-medicaid-now-he-s-got-another-health-care-crisis-looming?s=a2&amp;share_destination_id=MTkyNDQwOTQxLTE3NTQ1MzQ5MzczMDE%3D&amp;pd=0D1Sg9DS&amp;hl=en_US&amp;send_time=1754534937&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.31.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q3-v7%2Cns_foryou_model_exp_25q3-v9%2Cns_foryou_blend_exp_25q3-v9%2Cns_foryou_recall_exp_25q3-control",
    "timestamp": "2025-08-07T02:51:29Z"
  },
  {
    "title": "Trump's tariff gamble puts America's ties with India at risk",
    "description": "President Trump has threatened India with 50% tariffs for continuing to purchase Russian oil, aiming to pressure Russia to end the war in Ukraine. This move jeopardizes the strategic partnership between the U.S. and India, potentially pushing India closer to …",
    "link": "https://economictimes.indiatimes.com/news/india/trumps-tariff-gamble-puts-americas-ties-with-india-at-risk/articleshow/123154558.cms",
    "timestamp": "2025-08-07T02:50:48Z"
  },
  {
    "title": "Analysis: TSMC gains breathing room as US chip tariff exempts domestic production",
    "description": "US President Donald Trump and Apple CEO Tim Cook held a press conference to announce upcoming semiconductor tariffs and Apple's new US$100 billion investment in the US, increasing their total investment to US$600 billion.",
    "link": "https://www.digitimes.com/news/a20250807PD217/tsmc-apple-donald-trump-chips-tariffs.html",
    "timestamp": "2025-08-07T02:45:42Z"
  },
  {
    "title": "Executive order by US administration excludes Pharma sector from immediate tariff imposition: Indian Pharmaceutical Alliance",
    "description": "The Indian pharmaceutical sector has been excluded from immediate US tariff hikes due to the importance of generic medicines for affordable healthcare in the United States. This follows President Trump's imposition of a 25% tariff on India over Russian oil pu…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/executive-order-by-us-administration-excludes-pharma-sector-from-immediate-tariff-imposition-indian-pharmaceutical-alliance/articleshow/123154421.cms",
    "timestamp": "2025-08-07T02:42:35Z"
  },
  {
    "title": "Trump's '100% chip tariffs' hit Japan's giants, but Samsung and TSMC rise on U.S. bets",
    "description": "Asia chip stocks fell on Thursday after U.S. President Donald Trump announced he will impose a 100% tariff on imports of semiconductors and chips.",
    "link": "https://biztoc.com/x/08cc5f50f6e302c7",
    "timestamp": "2025-08-07T02:42:22Z"
  },
  {
    "title": "Trump's '100% chip tariffs' hit Japan's giants, but Samsung and TSMC rise on U.S. bets",
    "description": "Asia chip stocks fell on Thursday after U.S. President Donald Trump announced he will impose a 100% tariff on imports of semiconductors and chips.",
    "link": "https://www.cnbc.com/2025/08/07/asia-chipmakers-wobble-after-trumps-100percent-tariffs-on-semiconductors.html",
    "timestamp": "2025-08-07T02:41:40Z"
  },
  {
    "title": "Lula sees no point in talking tariffs with Trump",
    "description": "\"I won't humiliate myself,\" the Brazilian president says as 50% U.S. tariffs on goods from the Latin American country kicked in.",
    "link": "https://www.japantimes.co.jp/news/2025/08/07/world/politics/brazil-president-tariff-trump/",
    "timestamp": "2025-08-07T02:41:00Z"
  },
  {
    "title": "U.S. Attorney Jeanine Pirro Details Problem of Youth Violence in Washington, DC: ‘It’s Time to End it’ (VIDEO)",
    "description": "U.S.\nThe post U.S. Attorney Jeanine Pirro Details Problem of Youth Violence in Washington, DC: ‘It’s Time to End it’ (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/08/u-s-attorney-jeanine-pirro-details-problem-youth/",
    "timestamp": "2025-08-07T02:40:32Z"
  },
  {
    "title": "Trump’s endless freefall in the gap between what is and what ought to be",
    "description": "There's a connection between the Jeffrey Epstein scandal and Trump's firing of the head of a key economic statistics department — and it goes well beyond the president's need for distractions.\nThe post Trump’s endless freefall in the gap between what is and w…",
    "link": "http://www.crikey.com.au/2025/08/07/donald-trump-reality/",
    "timestamp": "2025-08-07T02:39:38Z"
  },
  {
    "title": "Dolphins QB Tua Tagovailoa 'not too sure' how he landed on President Donald Trump's sports council",
    "description": "Tagovailoa said he's honored to be included even if he's not quite sure how it came to be",
    "link": "https://www.cbssports.com/nfl/news/dolphins-qb-tua-tagovailoa-not-too-sure-how-he-landed-on-president-donald-trumps-sports-council/",
    "timestamp": "2025-08-07T02:36:42Z"
  },
  {
    "title": "Trump repeats claim Kimmel, Fallon are 'next' after Stephen Colbert cancellation",
    "description": "President Donald Trump repeated his claim that late-night hosts Jimmy Fallon and Jimmy Kimmel will follow Stephen Colbert and have their shows canceled.",
    "link": "https://www.foxnews.com/media/trump-repeats-claim-kimmel-fallon-next-after-stephen-colbert-cancellation",
    "timestamp": "2025-08-07T02:35:56Z"
  },
  {
    "title": "U.S. to ease criticism of El Salvador, Israel and Russia, says report",
    "description": "The Trump administration has increasingly moved away from the traditional promotion of democracy and human rights.",
    "link": "https://www.japantimes.co.jp/news/2025/08/07/world/politics/us-human-rights-el-salvador-israel-russia/",
    "timestamp": "2025-08-07T02:33:00Z"
  },
  {
    "title": "Asia trades mixed after Trump's tariff announcement",
    "description": "Asia-Pacific markets traded mixed on Thursday after United States President Donald Trump stated that he will impose an approximately 100% tariff on all imported chips and semiconductors.Additionally, ...",
    "link": "https://biztoc.com/x/3d634588373dd678",
    "timestamp": "2025-08-07T02:31:39Z"
  },
  {
    "title": "Trump hits India with additional 25% tariff",
    "description": "Washington, Aug 7: US President Donald Trump has issued an executive order hitting India with an additional 25% tariff over […]\nThe post Trump hits India with additional 25% tariff appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/07/trump-hits-india-with-additional-25-tariff/",
    "timestamp": "2025-08-07T02:30:00Z"
  },
  {
    "title": "Trump eyes Putin meeting to broker peace; sanctions, tariff threats loom",
    "description": "Trump may meet Putin next week to push Ukraine ceasefire. Sanctions and tariffs loom. Witkoff meets Putin, Zelenskyy confirms call with Trump post-talks.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-eyes-putin-meeting-to-broker-peace-sanctions-tariff-threats-loom/article69903938.ece",
    "timestamp": "2025-08-07T02:27:35Z"
  },
  {
    "title": "Suspect in murder of Israel embassy staffers in US indicted for hate crime",
    "description": "Authorities charged the defendant with carrying out a hate crime, with the murders described as calculated and planned.",
    "link": "https://www.aljazeera.com/news/2025/8/7/suspect-in-murder-of-israel-embassy-staffers-in-us-indicted-for-hate-crime",
    "timestamp": "2025-08-07T02:27:09Z"
  },
  {
    "title": "NASA to fast-track plan to put nuclear reactor on the Moon by 2030",
    "description": "It comes just three months after China and Russia announced they were considering a joint effort to also put a nuclear power station on the Moon in a new race for space dominance.",
    "link": "https://www.abc.net.au/news/2025-08-07/nasa-to-fast-track-efforts-to-put-nuclear-reactor-on-the-moon/105616682",
    "timestamp": "2025-08-07T02:26:50Z"
  },
  {
    "title": "Trump plans 100% tariff on computer chips, unless companies build in US",
    "description": "President Donald Trump says he's imposing a 100% tariff on computer chips— a move that raises the specter of higher prices for electronics, autos, household appliances and other essential goods that depend on the processors.",
    "link": "https://www.wcvb.com/article/trump-100-percent-chip-tariff/65619586",
    "timestamp": "2025-08-07T02:26:50Z"
  },
  {
    "title": "Apple pledges to invest $100B more in US manufacturing but doesn’t promise a 100% American-made iPhone",
    "description": "Apple Inc. Chief Executive Tim Cook stood alongside President Donald Trump at the White House today to announce his company will invest an additional $100 billion in its efforts to boost manufacturing in the U.S. The investment, which brings Apple’s total com…",
    "link": "https://siliconangle.com/2025/08/06/apple-pledges-invest-another-100b-u-s-manufacturing-stops-short-promising-100-american-made-iphone/",
    "timestamp": "2025-08-07T02:25:52Z"
  },
  {
    "title": "The Great Indian Kapil Show 3: Krushna Abhishek and Kiku Sharda take a dig at American President Donald Trump; Kiku says 'Yehi iska main kaam hai pehle jhagda karata hai phir sulah...'",
    "description": "The Great Indian Kapil Show's recent episode featured Parineeti Chopra and Raghav Chadha, filled with laughter and revelations. Krushna Abhishek and Kiku Sharda's satire as Donald Trump and Kim Jong-Un stole the show, leaving the couple and audience in splits…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/the-great-indian-kapil-show-3-krushna-abhishek-and-kiku-sharda-take-a-dig-at-american-president-donald-trump-kiku-says-yehi-iska-main-kaam-hai-pehle-jhagda-karata-hai-phir-sulah-/articleshow/123154176.cms",
    "timestamp": "2025-08-07T02:24:28Z"
  },
  {
    "title": "Trump plans 100% tariff on computer chips, unless companies build in US",
    "description": "President Donald Trump says he's imposing a 100% tariff on computer chips— a move that raises the specter of higher prices for electronics, autos, household appliances and other essential goods that depend on the processors.",
    "link": "https://www.koco.com/article/trump-100-percent-chip-tariff/65619586",
    "timestamp": "2025-08-07T02:24:05Z"
  },
  {
    "title": "JB Pritzker Reacts to Possibility of FBI Arresting Texas Democrats",
    "description": "\"They're grandstanding,\" Pritzker said, brushing off President Trump's threats. \"There literally is no federal law applicable to this situation.\"",
    "link": "https://www.newsweek.com/illinois-jb-pritzker-texas-democrats-fbi-trump-2109980",
    "timestamp": "2025-08-07T02:23:12Z"
  },
  {
    "title": "How do scientists estimate crowd sizes at public events – and why are they often disputed?",
    "description": "Crowd size estimates are part science, part art. When numbers differ, it’s not necessarily because someone is being dishonest.",
    "link": "https://theconversation.com/how-do-scientists-estimate-crowd-sizes-at-public-events-and-why-are-they-often-disputed-262695",
    "timestamp": "2025-08-07T02:22:15Z"
  },
  {
    "title": "Brazil’s Lula plans new ‘national sovereignty’ policy for strategic minerals amid Bolsonaro trial and US tensions",
    "description": "Brazilian President Luiz Inacio Lula da Silva announced plans for a new mineral policy. The policy will treat strategic minerals as a matter of national sovereignty. Brazil aims to add value locally instead of exporting raw minerals. This move comes amid trad…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/brazils-lula-plans-new-national-sovereignty-policy-for-strategic-minerals-amid-bolsonaro-trial-and-us-tensions/articleshow/123154208.cms",
    "timestamp": "2025-08-07T02:21:27Z"
  },
  {
    "title": "Will Trump Pardon George Santos?",
    "description": "By George Caldwell, The Daily Signal | August 05, 2025\nAs former New York Republican Rep. George Santos begins his more than seven-year sentence in prison after pleading guilty to wire fraud and aggravated identity theft, it remains to be seen whether Preside…",
    "link": "https://biztoc.com/x/39ab8ea72a519579",
    "timestamp": "2025-08-07T02:20:16Z"
  },
  {
    "title": "Trump pushes ‘Make in America’ with 100% tariff threat on computer chips",
    "description": "The announcement, made alongside Apple CEO Tim Cook, signals a major shift from the Biden-era CHIPS Act, favouring tariffs over subsidies to spur domestic manufacturing.",
    "link": "https://www.thehindubusinessline.com/info-tech/trump-pushes-make-in-america-with-100-tariff-threat-on-computer-chips/article69903934.ece",
    "timestamp": "2025-08-07T02:18:12Z"
  },
  {
    "title": "Apple Seeks Pivot on AI as It Pours Additional $100B Into US",
    "description": "Apple pledged an extra $100 billion to U.S. manufacturing as Trump threatens tariffs on foreign-made chips.",
    "link": "https://decrypt.co/333898/apple-ai-pours-additional-100b-into-us",
    "timestamp": "2025-08-07T02:17:55Z"
  },
  {
    "title": "Trump Tariff Impact: Brokerages Warn Of Export Risks, Growth Hit, And Strategic Fallout",
    "description": "The US President Donald Trump imposed an additional 25% tariff on Indian goods, citing India's purchase of Russian crude oil. This has raised the total tariff burden on the nation up to 50%, placing the country just next to Brazil in terms of the highest US t…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-tariff-impact-brokerages-warn-of-export-risks-growth-hit-and-strategic-fallout",
    "timestamp": "2025-08-07T02:17:36Z"
  },
  {
    "title": "Trump moves to shut down NASA missions that measure carbon dioxide and plant health",
    "description": "The Trump administration is seeking to terminate two NASA missions crucial for monitoring carbon dioxide emissions, plant health, and predicting food shortages. These missions, including a satellite and an instrument on the International Space Station, provid…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-moves-to-shut-down-nasa-missions-that-measure-carbon-dioxide-and-plant-health/articleshow/123154171.cms",
    "timestamp": "2025-08-07T02:16:50Z"
  },
  {
    "title": "India-US spat over trade and oil threatens wider fallout",
    "description": "President Trump's trade actions against India, stemming from trade imbalances and Russian oil purchases, threaten to undermine decades of diplomatic progress. These measures, including tariffs and criticism, have strained relations, pushing India to reassess …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-spat-over-trade-and-oil-threatens-wider-fallout/articleshow/123154170.cms",
    "timestamp": "2025-08-07T02:16:48Z"
  },
  {
    "title": "Ex-Trump Investigator Robert Mueller Discovered in Memory-care Facility as Republicans Demand His Epstein Testimony",
    "description": "Former FBI Director Robert Mueller, the man who led the Russia investigation into President Donald Trump, has reportedly lived in a memory-care facility for years. Muller, 80, served as the sixth director of the FBI from 2001 until 2013 and the special counse…",
    "link": "https://freerepublic.com/focus/f-news/4333140/posts",
    "timestamp": "2025-08-07T02:11:33Z"
  },
  {
    "title": "US-India relations at their ‘worst’ as Trump slaps 50 percent tariff",
    "description": "India is part of a small group of major economies without a deal. And it now faces the highest tariff rate globally.",
    "link": "https://www.aljazeera.com/news/2025/8/7/us-india-relations-at-their-worst-as-trump-slaps-50-percent-tariff",
    "timestamp": "2025-08-07T02:10:42Z"
  },
  {
    "title": "Democrats Compose Letter To Trump Calling For US To Recognize Palestinian Statehood",
    "description": "By Virginia Allen, The Daily Signal | August 05, 2025\nMore than a dozen Democrat lawmakers have signed onto a letter to President Donald Trump asking him to recognize Palestinian statehood.\nRep. Ro Khanna, D-Calif., is leading the effort among his fellow Hous…",
    "link": "https://biztoc.com/x/51ee1dfd84410c70",
    "timestamp": "2025-08-07T02:09:38Z"
  },
  {
    "title": "Report: Trump considers intervening in New York’s Mayor race to stop Mamdani",
    "description": "President Trump reportedly considering stepping into New York’s mayoral race to prevent left-wing frontrunner Zohran Mamdani from winning.",
    "link": "https://www.israelnationalnews.com/news/412880",
    "timestamp": "2025-08-07T02:09:33Z"
  },
  {
    "title": "Trump To Announce Tariffs On Pharmaceuticals",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | August 05, 2025\nPresident Donald Trump will soon announce tariffs on pharmaceuticals, he told CNBC in a Tuesday morning interview.\n“Within the next week or so, we’re going to be announcing tariffs on pharmace…",
    "link": "https://biztoc.com/x/f80f77f3f2b5e7f6",
    "timestamp": "2025-08-07T02:09:26Z"
  },
  {
    "title": "Chip-related stocks fall after US tariff announcement",
    "description": "TOKYO: Chip-related shares were down in early Asian trade on Thursday (Aug 7), after US President Donald Trump said he planned to impose a 100 per cent tariff on imported semiconductors.",
    "link": "https://www.channelnewsasia.com/business/chip-stocks-fall-us-trump-tariff-100-cent-5281821",
    "timestamp": "2025-08-07T02:05:00Z"
  },
  {
    "title": "Trump says he will pick a 'temp' replacement for Fed's Kugler in days",
    "description": "President Trump announced he would nominate a temporary replacement for the vacant Federal Reserve Board seat within days, with a permanent selection to follow. Treasury Secretary Bessent, Commerce Secretary Lutnick, and Vice President Vance are involved in t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-he-will-pick-a-temp-replacement-for-feds-kugler-in-days/articleshow/123154038.cms",
    "timestamp": "2025-08-07T02:04:06Z"
  },
  {
    "title": "Report: Israeli Cabinet to Consider Plan to Occupy Gaza City",
    "description": "The Israeli cabinet will consider a plan to reoccupy the Gaza Strip, starting with Gaza City, on Thursday, according to reports in the Israeli media.\nThe post Report: Israeli Cabinet to Consider Plan to Occupy Gaza City appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/08/06/report-israeli-cabinet-to-consider-plan-to-occupy-gaza-city/",
    "timestamp": "2025-08-07T02:03:04Z"
  },
  {
    "title": "Trump gets a home in Bihar? Fake residential certificate from Samastipur goes viral, Congress slams Election Commission",
    "description": "A fake residence certificate in Donald Trump's name surfaced in Samastipur, Bihar. Authorities are investigating the forgery. This incident follows similar cases, including one involving a dog. Congress leader Randeep Singh Surjewala criticised Bihar's voter …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/trump-gets-a-home-in-bihar-fake-residential-certificate-from-samastipur-goes-viral-congress-slams-election-commission/articleshow/123154024.cms",
    "timestamp": "2025-08-07T02:02:12Z"
  },
  {
    "title": "President Trump: Fort Stewart Shooter 'Will Be Prosecuted to the Fullest Extent of the Law'",
    "description": "During Wednesday afternoon comments, President Donald Trump made clear the Fort Stewart shooter \"will be prosecuted to the fullest extent of the law.\"\nThe post President Trump: Fort Stewart Shooter ‘Will Be Prosecuted to the Fullest Extent of the Law’ appeare…",
    "link": "https://www.breitbart.com/2nd-amendment/2025/08/06/president-trump-fort-stewart-shooter-will-be-prosecuted-to-the-fullest-extent-of-the-law/",
    "timestamp": "2025-08-07T02:01:06Z"
  },
  {
    "title": "World trade war: Why hasn’t this risk raised an alarm so far?",
    "description": "This century’s tariff turmoil isn’t proving quite as alarming as the barrier-raising outbreak of the 1930s. Geopolitics and economics point to why we’ve seen so few knock-on tariff hikes in the wake of Trump’s trade policy aggression.",
    "link": "https://www.livemint.com/opinion/online-views/world-trade-war-why-hasn-t-this-raised-an-alarm-so-far-trump-tariffs-globalization-trade-barriers-economic-integration-11754410696495.html",
    "timestamp": "2025-08-07T02:00:15Z"
  }
]