[
  {
    "title": "Venezuela's President Nicholas Maduro captured by US forces: Where has he been taken? What we know so far",
    "description": "Venezuela's President Nicholas Maduro captured by US forces has triggered global attention. US officials say the arrest followed criminal charges. Lawmakers cite constitutional authority. Venezuela disputes the action and seeks UN intervention as questions ri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/venezuelas-president-nicholas-maduro-captured-by-us-forces-where-has-he-been-taken-what-we-know-so-far-caracas/articleshow/126321249.cms",
    "timestamp": "2026-01-03T11:24:27Z"
  },
  {
    "title": "Bombs away for Trump, self-proclaimed peace president",
    "description": "Donald Trump returned to office vowing to be the peace president. Nearly a year later, he is embracing war on multiple fronts. Trump on Saturday ordered large-scale military strikes in Venezuela and announced that leftist leader Nicolas Maduro had been captur…",
    "link": "https://www.digitaljournal.com/world/bombs-away-for-trump-self-proclaimed-peace-president/article",
    "timestamp": "2026-01-03T11:23:27Z"
  },
  {
    "title": "Trump announces military strike on Venezuela, capture of President Nicolás Maduro",
    "description": "President Donald Trump announced on Saturday morning that the United States had carried out a “large-scale strike” against Venezuela, capturing President Nicolás Maduro and his wife, who Trump said were then flown out of the South American nation.\nTrump made …",
    "link": "https://biztoc.com/x/37efe6fa1db3d528",
    "timestamp": "2026-01-03T11:20:14Z"
  },
  {
    "title": "Goldberg: An anti-AI movement is coming. Which party will lead it?",
    "description": "Progenitors saw the technology’s destructive potential from the start but felt desperate to beat competitors to the punch",
    "link": "https://www.mercurynews.com/2026/01/03/goldberg-an-anti-ai-movement-is-coming-which-party-will-lead-it/",
    "timestamp": "2026-01-03T11:19:30Z"
  },
  {
    "title": "Russia condemns US ‘aggression’ against Venezuela",
    "description": "The US president has claimed that Venezuelan leader Nicolas Maduro has been captured and flown out of the country Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630369-moscow-condemns-us-aggression-venezuela/",
    "timestamp": "2026-01-03T11:16:29Z"
  },
  {
    "title": "Why Does Trump Want Venezuela? Global Backlash Exposes Risks of POTUS' Gamble",
    "description": "Trump hails 'brilliant' Delta Force capture of Maduro after Venezuela strikes. Caracas burns as Russia condemns aggression. Oil, drugs, migration at stake.",
    "link": "https://www.ibtimes.com/why-does-trump-want-venezuela-global-backlash-exposes-risks-potus-gamble-3794245",
    "timestamp": "2026-01-03T11:16:13Z"
  },
  {
    "title": "ICE At-Large Arrests Has More Than Doubled as Enforcement Shifts to Communities: Report",
    "description": "ICE more than doubled its number of at-large arrests this fall as the Trump administration shifted enforcement away from local jails and toward tracking immigrants in communities",
    "link": "https://www.ibtimes.com/ice-large-arrests-has-more-doubled-enforcement-shifts-communities-report-3794246",
    "timestamp": "2026-01-03T11:15:52Z"
  },
  {
    "title": "Explosions, fear and panic in Caracas after U.S. strike on Venezuela – watch videos and photos",
    "description": "The situation remains fluid, with international reactions and calls for calm, as residents of the capital face moments of intense uncertainty and fear\nThe post Explosions, fear and panic in Caracas after U.S. strike on Venezuela – watch videos and photos appe…",
    "link": "https://en.protothema.gr/2026/01/03/explosions-fear-and-panic-in-caracas-after-u-s-strike-on-venezuela-watch-videos-and-photos/",
    "timestamp": "2026-01-03T11:15:37Z"
  },
  {
    "title": "Explosions Rock Caracas Venezuela Tonight as Government Blames US Military Action",
    "description": "Tonight in Caracas, Venezuela's capital, residents reported a series of loud explosions and sightings of low-flying aircraft around 2 a.m. local time, triggering power outages and smoke rising over key military installations such as La Carlota Air Base and th…",
    "link": "https://www.ibtimes.com/explosions-rock-caracas-venezuela-tonight-government-blames-us-military-action-3794251",
    "timestamp": "2026-01-03T11:15:16Z"
  },
  {
    "title": "Did the United States capture Nicolás Maduro? This is what Trump said after the attack on Venezuela",
    "description": "International tensions escalated this Saturday, January 3, after U.S. President Donald Trump claimed that his government carried out a large-scale military attack against Venezuela and that Venezuelan President Nicolás Maduro was captured along with his wife,…",
    "link": "https://www.merca20.com/did-the-united-states-capture-nicolas-maduro-this-is-what-trump-said-after-the-attack-on-venezuela/",
    "timestamp": "2026-01-03T11:15:07Z"
  },
  {
    "title": "Iran's leader says rioters 'must be put in their place' as protest death toll reaches at least 10",
    "description": "Iran's supreme leader has called for protesters to be dealt with firmly.  Demonstrations over the country's struggling economy have intensified.  Violence has claimed at least ten lives.  US President Donald Trump has warned Iran against harming peaceful prot…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/irans-leader-says-rioters-must-be-put-in-their-place-as-protest-death-toll-reaches-at-least-10/articleshow/126321145.cms",
    "timestamp": "2026-01-03T11:12:52Z"
  },
  {
    "title": "US Carries Out Strikes in Venezuela; Trump Says Maduro Captured",
    "description": "Trump said the operation involved US forces on the ground and from the air and described it as successful. He did not provide details on where Maduro was taken or the legal basis for his detention.",
    "link": "https://www.ibtimes.com/us-carries-out-strikes-venezuela-trump-says-maduro-captured-3794244",
    "timestamp": "2026-01-03T11:11:24Z"
  },
  {
    "title": "US says it has hit Caracas, unseating Maduro",
    "description": "The US captured Venezuelan President Nicolas Maduro and flew him out of the country after carrying out a major strike on its capital, Caracas, US President Donald Trump announced.\nThe shocking move — unseating a sitting head of state and ferrying him away — c…",
    "link": "https://biztoc.com/x/e2078fb83e64a452",
    "timestamp": "2026-01-03T11:09:20Z"
  },
  {
    "title": "Here's when clocks 'spring forward' for daylight saving time 2026",
    "description": "Here's when clocks 'spring forward' for daylight saving time 2026pennlive.com",
    "link": "https://www.pennlive.com/life/2026/01/daylight-saving-time-2026-heres-when-clocks-spring-forward.html",
    "timestamp": "2026-01-03T11:07:39Z"
  },
  {
    "title": "US bombs Venezuela capital, captures leader Maduro — Trump",
    "description": "President Trump announces US forces have bombed Venezuela’s capital, Caracas, and captured President Nicolas Maduro in a large-scale military strike.\n\nRead More: https://punchng.com/us-bombs-venezuela-capital-captures-leader-maduro-trump/",
    "link": "https://punchng.com/us-bombs-venezuela-capital-captures-leader-maduro-trump/",
    "timestamp": "2026-01-03T11:05:04Z"
  },
  {
    "title": "What we know about US strikes on Venezuela",
    "description": "Explosions have rocked capital Caracas as the US says it captured Venezuela's President Nicola Maduro.",
    "link": "https://www.bbc.com/news/articles/crmlz7r0zrxo",
    "timestamp": "2026-01-03T11:03:46Z"
  },
  {
    "title": "Inside the ‘industrial-scale’ Trump pardon machine",
    "description": "Seeking a pardon under Trump has become \"a rational thing\" for convicted criminals and those fighting charges, one lawyer said. Read here",
    "link": "https://financialpost.com/financial-times/inside-industrial-scale-trump-pardon-machine",
    "timestamp": "2026-01-03T11:00:57Z"
  },
  {
    "title": "Bitfinex Hack Mastermind Released Early From Prison, Credits 2018 Trump Law – Details",
    "description": "The mastermind behind the Bitfinex hack, one of the most prominent cases in crypto security history, has been released early from prison after serving 14 months, under a 2018 law signed by US President Donald Trump. Related Reading: US Banks’ Push To Ban Stab…",
    "link": "https://bitcoinist.com/bitfinex-mastermind-released-early-trump-law/",
    "timestamp": "2026-01-03T11:00:36Z"
  },
  {
    "title": "U.S. Strikes Venezuela And Says Its Leader, Maduro, Has Been Captured And Flown Out Of The Country",
    "description": "The Venezuelan government called it an “imperialist attack” and urged citizens to take to the streets.",
    "link": "https://www.huffpost.com/entry/nicolas-maduro-captured-venezuela_n_6958f542e4b048f68c302c3c",
    "timestamp": "2026-01-03T11:00:35Z"
  },
  {
    "title": "Kate Middleton’s cancer diagnosis ‘rekindled’ her marriage to Prince William: expert",
    "description": "Prince William and Kate Middleton's marriage reportedly emerges stronger after her cancer battle, with royal experts noting their renewed closeness and unity.",
    "link": "https://www.foxnews.com/entertainment/kate-middletons-cancer-diagnosis-rekindled-her-marriage-prince-william-expert",
    "timestamp": "2026-01-03T11:00:28Z"
  },
  {
    "title": "US carries out ‘large scale’ attack on Venezuela and captures president Maduro - Trump",
    "description": "Venezuela’s government said the United States attacked its civilian and military installations in multiple states",
    "link": "https://www.irishtimes.com/world/2026/01/03/us-carries-out-large-scale-attack-on-venezuela-and-captures-president-maduro-trump/",
    "timestamp": "2026-01-03T11:00:27Z"
  },
  {
    "title": "List of Sites Targeted By US In Venezuela: What We Know",
    "description": "CBS News reported that President Donald Trump has ordered multiple strikes on the South American country.",
    "link": "https://biztoc.com/x/ddaa9bb3a03a50c5",
    "timestamp": "2026-01-03T10:58:47Z"
  },
  {
    "title": "US says it has captured Venezuelan President Maduro",
    "description": "Trump says the US carried out strikes on Venezuela and captured its leader, in a breach of international law.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/3/us-says-it-has-captured-venezuelan-president-maduro",
    "timestamp": "2026-01-03T10:58:23Z"
  },
  {
    "title": "Trump statement on ‘Maduro capture’ during US attack on Venezuela",
    "description": "US President Donald Trump says that Venezuelan President Nicolas Maduro has been captured.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/3/trump-statement-on-maduro-capture-during-us-attack-on-venezuela",
    "timestamp": "2026-01-03T10:57:01Z"
  },
  {
    "title": "Trump Says U.S. Forces Have Captured Venezuela’s Maduro",
    "description": "The operation followed hours of military strikes and a monthslong U.S. pressure campaign.",
    "link": "http://foreignpolicy.com/2026/01/03/venezuela-maduro-capture-trump-strikes/",
    "timestamp": "2026-01-03T10:55:25Z"
  },
  {
    "title": "Trump says Venezuela’s Maduro captured in ‘large scale’ US strike",
    "description": "President Donald Trump said Saturday that US forces had captured Venezuelan leader Nicolas Maduro after launching a “large scale strike” on the South American country. Trump’s stunning announcement follows months of steadily mounting US military and economic …",
    "link": "https://www.digitaljournal.com/world/trump-says-venezuelas-maduro-captured-in-large-scale-us-strike/article",
    "timestamp": "2026-01-03T10:52:20Z"
  },
  {
    "title": "Russia condemns US military action in Venezuela",
    "description": "Russia condemned the US military action in Venezuela on Saturday, saying there was no tenable justification for the attack and that \"ideological hostility\" had prevailed over diplomacy. Ideological hostility has triumphed over businesslike pragmatism,\" it add…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-condemns-us-military-action-in-venezuela/articleshow/126320861.cms",
    "timestamp": "2026-01-03T10:51:13Z"
  },
  {
    "title": "I Came to See Mamdani’s First Big Speech as Mayor. I Found Something Else Entirely.",
    "description": "New York City is working through its feelings in real time.",
    "link": "https://slate.com/news-and-politics/2026/01/zohran-mamdani-new-york-mayor-first-big-speech.html",
    "timestamp": "2026-01-03T10:50:00Z"
  },
  {
    "title": "Trump says US has ‘captured’ President Maduro following Caracas strikes",
    "description": "Maduro was arrested along with his wife by commandos of the elite Delta Force unit, following U.S. military raids in Caracas – He had been wanted since 2020 for the large-scale trafficking of drugs into the United States\nThe post Trump says US has ‘captured’ …",
    "link": "https://en.protothema.gr/2026/01/03/trump-says-us-has-captured-president-maduro-following-caracas-strikes/",
    "timestamp": "2026-01-03T10:49:04Z"
  },
  {
    "title": "The United States has captured Venezuela’s dictator, Nicolás Maduro",
    "description": "The United States has captured Venezuela’s dictator, Nicolás Maduro\nAfter months of military build up, an overnight bombing campaign and helicopter raid has deposed Venezuela’s strongman\nON JANUARY 3RD, hours after explosions were heard in Caracas, the capita…",
    "link": "https://biztoc.com/x/66da2e31b8ca4d9d",
    "timestamp": "2026-01-03T10:48:01Z"
  },
  {
    "title": "Videos Show Explosions Rocking Venezuela As Maduro Is Captured",
    "description": "Videos on social media appear to show the moment Venezuela's capital was rocked by airstrikes ordered by President Donald Trump's administration.\nTrump wrote on Truth Social on Saturday: \"The United States of America has successfully carried out a large scale…",
    "link": "https://biztoc.com/x/5dcb7d5d0f7bbe20",
    "timestamp": "2026-01-03T10:47:32Z"
  },
  {
    "title": "This Is the Nastiest Opinion by a Supreme Court Justice in 2025",
    "description": "It was the perfect shadow-docket sandwich.",
    "link": "https://slate.com/news-and-politics/2026/01/supreme-court-2025-neil-gorsuch-brett-kavanaugh.html",
    "timestamp": "2026-01-03T10:45:00Z"
  },
  {
    "title": "Trump announces US strikes on Venezuela, says Maduro 'captured' | Live Updates from Fox News Digital",
    "description": "President Donald Trump announced that the U.S. military carried out a \"large-scale strike\" in Venezuela early Saturday morning and took Venezuelan President Nicolás Maduro and his wife into custody.",
    "link": "https://www.foxnews.com/live-news/us-strikes-venezuela-maduro-captured-january-3-2026",
    "timestamp": "2026-01-03T10:38:06Z"
  },
  {
    "title": "Cuba and Colombia respond to US strikes on Venezuela",
    "description": "Cuba and Colombia have sounded the alarm over apparent US strikes on Venezuela Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630389-cuba-colombia-respond-us-strikes-venezuela/",
    "timestamp": "2026-01-03T10:36:57Z"
  },
  {
    "title": "US Forces Strike Venezuela, Trump Reveals Maduro Has Been \"Captured\"",
    "description": "US Forces Strike Venezuela, Trump Reveals Maduro Has Been \"Captured\"\n \nPresident Donald Trump announced on Truth Social that U.S. forces \"successfully carried out a large-scale strike\" against Venezuela and captured President Nicolás Maduro and his wife.\n\"The…",
    "link": "https://biztoc.com/x/b12c77709d25947b",
    "timestamp": "2026-01-03T10:36:33Z"
  },
  {
    "title": "Trump claims Venezuelan president Maduro captured following ‘large scale’ US attack",
    "description": "Venezuela’s government said the United States attacked its civilian and military installations in multiple states.",
    "link": "https://www.irishtimes.com/world/2026/01/03/trump-claims-venezuelan-president-maduro-captured-following-large-scale-us-attack/",
    "timestamp": "2026-01-03T10:32:39Z"
  },
  {
    "title": "Don’t Cry for Me Argentina",
    "description": "Marianela D’Aprile\n\n\n\nThe truth is I had to leave you.\r\n\n\r\n\n\nThe post Don’t Cry for Me Argentina appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/immigration-argentina-trump/",
    "timestamp": "2026-01-03T10:30:00Z"
  },
  {
    "title": "Trump-aligned super PAC enters 2026 midterms with nearly $300M war chest",
    "description": "The Trump-aligned super PAC reported nearly $300 million in cash on hand in a new FEC filing as Republicans gear up for the 2026 midterm elections.",
    "link": "https://www.foxnews.com/politics/trump-aligned-super-pac-enters-2026-midterms-nearly-300m-war-chest",
    "timestamp": "2026-01-03T10:28:47Z"
  },
  {
    "title": "President Trump: Nicolas Maduro 'Captured and Flown Out Of' Venezuela",
    "description": "President Donald Trump announced that Nicolás Maduro and his wife Cilia Flores have been “captured and flown out of the country”\nThe post President Trump: Nicolás Maduro ‘Captured and Flown Out Of’ Venezuela appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/01/03/president-trump-nicolas-maduro-captured-and-flown-out-of-venezuela/",
    "timestamp": "2026-01-03T10:28:27Z"
  },
  {
    "title": "H-1B visa delay: Amazon allows stuck Indian employees to work remotely, says report — What you need to know",
    "description": "H-1B visa delay: Amazon is reportedly allowing its Indian employees who are stranded due to the H-1B visa delay issue to work remotely from their home country until early March 2026. Here's what you need to know about the restrictions.&nbsp;",
    "link": "https://www.livemint.com/companies/news/h1b-visa-delay-amazon-allows-stuck-indian-employees-to-work-remotely-says-report-what-you-need-to-know-11767431772130.html",
    "timestamp": "2026-01-03T10:27:52Z"
  },
  {
    "title": "Why did US attack Venezuela and capture President Nicolás Maduro? What we know so far",
    "description": "US attacks Venezuela: US President Donald Trump announced the operation on Truth Social, hours after explosions and low-flying aircraft were reported over Caracas.",
    "link": "https://indianexpress.com/article/world/why-did-us-attack-venezuela-and-capture-president-nicolas-maduro-10453399/",
    "timestamp": "2026-01-03T10:26:19Z"
  },
  {
    "title": "Where Is Nicolás Maduro? Venezuelan President Captured and Flown Out",
    "description": "Venezuela's President Nicolás Maduro has been captured and flown out of Venezuela following a U.S. military operation, President Donald Trump announced.\nWriting on Truth Social on Saturday morning, Trump said: \"The United States of America has successfully ca…",
    "link": "https://biztoc.com/x/6c8bb4616b178de2",
    "timestamp": "2026-01-03T10:25:32Z"
  },
  {
    "title": "The Latest: Trump says US will run Venezuela at least temporarily after military option",
    "description": "The United States hit Venezuela with a “large-scale strike” early Saturday and said President Nicolás Maduro and his wife were captured and flown out of the country. Here's the latest ...",
    "link": "https://www.bostonherald.com/2026/01/03/the-latest-trump-says-us-will-run-venezuela-at-least-temporarily-after-military-option/",
    "timestamp": "2026-01-03T10:24:43Z"
  },
  {
    "title": "The Latest: US strikes Venezuela, captures Maduro and his wife",
    "description": "The United States hit Venezuela with a “large-scale strike” early Saturday and said President Nicolás Maduro and his wife were captured and flown out of the ...",
    "link": "https://www.yahoo.com/news/articles/latest-us-strikes-venezuela-captures-102443011.html",
    "timestamp": "2026-01-03T10:24:43Z"
  },
  {
    "title": "The Latest: US strikes Venezuela, captures Maduro and his wife",
    "description": "The Associated Press The United States hit Venezuela with a “large-scale strike” early Saturday and said President Nicolás Maduro and his wife were captured and flown out of the country after months of stepped-up pressure by Washington — an extraordinary nigh…",
    "link": "https://www.bostonherald.com/2026/01/03/the-latest-us-strikes-venezuela-captures-maduro-and-his-wife/",
    "timestamp": "2026-01-03T10:24:43Z"
  },
  {
    "title": "President Trump Announces Capture Of Nicolás Maduro During Early ‘Large Scale Attack Against Venezuela’",
    "description": "President Donald Trump took to Truth Social early Saturday morning to announce the capture and removal of Venezuelan President Nicolás Maduro during \"a large scale strike against Venezuela and its leader\" by U.S. forces.",
    "link": "https://dailycaller.com/2026/01/03/donald-trump-announces-capture-nicolas-maduro-venezuela-attack-truth-social/",
    "timestamp": "2026-01-03T10:23:07Z"
  },
  {
    "title": "US strikes Venezuela; Trump claims Maduro captured and flown out",
    "description": "Explosions hit Caracas after the US launched strikes on Venezuela. Donald Trump claimed President Nicolás Maduro was captured, while Caracas denied the claim.",
    "link": "https://www.thehindubusinessline.com/news/world/us-strikes-venezuela-trump-claims-maduro-captured-and-flown-out/article70467168.ece",
    "timestamp": "2026-01-03T10:19:16Z"
  },
  {
    "title": "Venezuela declares state of emergency after US strikes against civilian, military targets",
    "description": "At least seven explosions have shaken Caracas, the capital of Venezuela, as low-flying aircraft have been detected in the skies above the city, in what the Venezuelan government said were coordinated US strikes.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260103-presstv01.htm",
    "timestamp": "2026-01-03T10:17:33Z"
  },
  {
    "title": "Bitcoin price $90K breakout hangs in balance as US storms Venezuela",
    "description": "Bitcoin halted a breakout to new 2026 highs near $91,000 as BTC price action dealt with \"geopolitical tension\" while TradFi markets were closed.",
    "link": "https://cointelegraph.com/news/bitcoin-price-90k-breakout-hangs-in-balance-us-storms-venezuela",
    "timestamp": "2026-01-03T10:17:03Z"
  },
  {
    "title": "Venezuela Ready to Discuss Anti-Drug Agreement With US - Maduro",
    "description": "Venezuela is ready to discuss an agreement with the United States to combat drug trafficking, but it must be a serious discussion, President Nicolas Maduro said.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260102-sputnik01.htm",
    "timestamp": "2026-01-03T10:16:30Z"
  },
  {
    "title": "Tension in Venezuela: explosions and military planes reported in Caracas amid showdown with US",
    "description": "In the early hours of Saturday, January 3, 2026, several detonations and explosions were observed in Venezuela, produced by military aircraft flying over Caracas and other parts of",
    "link": "https://www.marca.com/en/lifestyle/world-news/2026/01/03/6958eb7bca474110678b4574.html",
    "timestamp": "2026-01-03T10:15:01Z"
  },
  {
    "title": "Russia asks US to stop chasing Venezuela-linked oil tanker",
    "description": "Russia has formally asked the United States stop chasing an oil tanker that had been sailing for Venezuela to pick up oil, a report says.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/01/mil-260102-presstv02.htm",
    "timestamp": "2026-01-03T10:14:39Z"
  },
  {
    "title": "US strikes Venezuela, says leader Maduro has been captured, flown out of country",
    "description": "CARACAS, Venezuela (AP) — The United States hit Venezuela with a “large-scale strike” early Saturday and said its president, Nicolás Maduro, had been captured and flown out of the country after months of stepped-up pressure by Washington — an extraordinary ni…",
    "link": "https://slashdot.org/submission/17343737/us-strikes-venezuela-says-leader-maduro-has-been-captured-flown-out-of-country",
    "timestamp": "2026-01-03T10:13:07Z"
  },
  {
    "title": "Trump Tells Iranian Protesters US Supports Them As Death Toll, Arrests Rise",
    "description": "US President Donald Trump has voiced support for demonstrators braving brutal suppression from security forces in Iran amid protests over the country's economic woes - one of the biggest challenges to the Islamic republic's leadership in years - that have res…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-rferl02.htm",
    "timestamp": "2026-01-03T10:12:17Z"
  },
  {
    "title": "Iran vows 'swift, decisive, comprehensive' response to any aggression after Trump threat",
    "description": "Iran has warned the United States against any interference in its internal affairs, vowing a \"swift, decisive, and comprehensive\" response to any act of aggression following threatening remarks by US President Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-presstv01.htm",
    "timestamp": "2026-01-03T10:11:11Z"
  },
  {
    "title": "Araghchi says Iran's armed forces ready to respond, following Trump's 'reckless' threat",
    "description": "Foreign Minister Abbas Araghchi has warned US President Donald Trump against meddling in Iran's internal affairs, slamming his latest remarks as \"reckless and dangerous,\" and stressing that Iran's armed forces are fully prepared to defend the country's sovere…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-presstv02.htm",
    "timestamp": "2026-01-03T10:11:08Z"
  },
  {
    "title": "No bomb, talks, assassination can destroy Iran's missile power: Defense chief",
    "description": "Iranian Defense Minister Brigadier General Aziz Nasirzadeh says the country's missile power cannot be destroyed by bombs, negotiations, or the cowardly assassination of scientists and commanders.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-presstv03.htm",
    "timestamp": "2026-01-03T10:11:04Z"
  },
  {
    "title": "Iran warns Trump against intervention as top MP says US forces 'legitimate targets'",
    "description": "Iran on Friday warned US President Donald Trump against interfering in its internal affairs, with a Foreign Ministry spokesman rejecting any foreign meddling and a senior lawmaker saying US forces in the region would become \"legitimate targets\" in the event o…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-presstv04.htm",
    "timestamp": "2026-01-03T10:10:59Z"
  },
  {
    "title": "'Be mindful of your soldiers,' Larijani warns US after Trump's meddlesome post",
    "description": "Iran's top national security official has warned US President Donald Trump that any American interference in Iran's internal affairs would destroy US interests in the region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-presstv05.htm",
    "timestamp": "2026-01-03T10:10:54Z"
  },
  {
    "title": "Baqaei to Trump: Iranians will not allow foreign interference",
    "description": "The spokesperson for the Ministry of Foreign Affairs has emphasized that in their dialogue and efforts to resolve domestic issues, Iranians will not permit any form of foreign interference.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-irna04.htm",
    "timestamp": "2026-01-03T10:10:48Z"
  },
  {
    "title": "Ghalibaf: Iranian people have disappointed enemies far more experienced than Trump",
    "description": "The speaker of the Iranian Parliament says that the Iranian people have disappointed enemies far more experienced than US President Donald Trump.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-irna02.htm",
    "timestamp": "2026-01-03T10:10:34Z"
  },
  {
    "title": "Araghchi: Iran's Armed Forces on standby",
    "description": "Foreign Minister Abbas Araghchi has stressed that the Iranian Armed Forces are on standby and know exactly where to aim in the event of any infringement of Iranian sovereignty.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260102-irna01.htm",
    "timestamp": "2026-01-03T10:10:30Z"
  },
  {
    "title": "Several Protesters Reported Dead In Iran As Anger Builds Over Dismal Economy",
    "description": "Several people have died during a fifth day of protests across Iran, state-affiliated media and rights groups said, as anger builds over the country's economic woes despite pledges from the Islamic republic's clerical leaders to take \"new decisions\" to improv…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260101-rferl02.htm",
    "timestamp": "2026-01-03T10:10:06Z"
  },
  {
    "title": "U.S. strikes Venezuela and says its leader, Nicolas Maduro, has been captured and flown out of the country",
    "description": "The United States hit Venezuela with a “large-scale strike” early Saturday and said its president, Nicolás Maduro, had been captured and flown out of the country after months of stepped-up pressure by Washington — an extraordinary nighttime operation announce…",
    "link": "https://japantoday.com/category/world/trump-says-venezuela%27s-maduro-has-been-captured-after-the-us-conducted-a-%27large-scale-strike%27-on-country",
    "timestamp": "2026-01-03T10:05:47Z"
  },
  {
    "title": "BREAKING: White House Confirms U.S. Attack on Venezuela Captured Maduro",
    "description": "“The Bolivarian Government calls on all social and political forces in the country to activate mobilization plans...\"",
    "link": "https://www.westernjournal.com/breaking-white-house-confirms-u-s-attack-venezuela-captured-maduro/",
    "timestamp": "2026-01-03T10:02:36Z"
  },
  {
    "title": "Ukraine's Enigmatic Military Intelligence Chief To Become Zelenskyy's Top Adviser",
    "description": "The chief of Ukraine's military intelligence agency will be Volodymyr Zelenskyy's new top political adviser, the Ukrainian president announced, elevating a shadowy figure who is credited with some of the country's more audacious wartime endeavors.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/01/ukraine-260102-rferl01.htm",
    "timestamp": "2026-01-03T10:02:20Z"
  },
  {
    "title": "Key takeaways from Jack Smith's testimony to House Judiciary Committee",
    "description": "Smith, a former career federal prosecutor who led the special counsel probe into Trump prior to his reelection, testified last month for eight hours.",
    "link": "https://www.foxnews.com/politics/key-takeaways-from-jack-smiths-testimony-house-judiciary-committee",
    "timestamp": "2026-01-03T10:00:32Z"
  },
  {
    "title": "Update: Venezuelan President arrested after attack launched - Trump's statement",
    "description": "American President Donald Trump has announced that after launching a large-scale attack against Venezuela, the country's President Nicolas Maduro and his wife were arrested and taken out of the country. Issuing a special statement via his Truth Social media a…",
    "link": "https://english.gossiplankanews.com/2026/01/update-venezuelan-president-arrested.html",
    "timestamp": "2026-01-03T10:00:24Z"
  },
  {
    "title": "Supreme Court tariffs case, Fed chair pick loom as twin tests for Trump’s economic agenda in 2026",
    "description": "Supreme Court weighs Trump tariff authority while White House prepares to name next Fed chair, with both decisions carrying major economic implications.",
    "link": "https://www.foxnews.com/politics/supreme-court-tariffs-case-fed-chair-pick-loom-twin-tests-trumps-economic-agenda-2026",
    "timestamp": "2026-01-03T10:00:04Z"
  },
  {
    "title": "Blackwater Successor Hunts Immigrants for ICE",
    "description": "Constellis Holdings, which traces its roots to Erik Prince’s mercenary firm Blackwater, landed an ICE contract as a bounty hunter.\nThe post Blackwater Successor Hunts Immigrants for ICE appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/01/03/blackwater-successor-constellis-omniplex-hunts-immigrants-for-ice/",
    "timestamp": "2026-01-03T10:00:00Z"
  },
  {
    "title": "The Supreme Court has delayed direct conflict with Trump. Here's why that could soon change.",
    "description": "President Donald Trump's love affair with the Supreme Court could turn sour in the new year.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-new-term-trump-tariffs-birthright-citizenship-fed-rcna249340",
    "timestamp": "2026-01-03T10:00:00Z"
  },
  {
    "title": "What we know about US strikes on Venezuela as Maduro 'captured'",
    "description": "Since the early hours of Saturday, a series of strikes have hit Venezuela and the country's president has been \"captured\" and flown out of the country. In a fast-developing situation, here's everything we know so far.",
    "link": "https://news.sky.com/story/what-we-know-about-us-strikes-on-venezuela-as-maduro-captured-13489880",
    "timestamp": "2026-01-03T09:57:00Z"
  },
  {
    "title": "U.S. Launches Military Operations in Venezuela, Maduro ‘Captured’",
    "description": "Airstrikes and helicopter raids have been seen inside Venezuelan territory as President Trump confirms attacks, stating that President Nicolás Maduro has been captured by U.S. forces. After a huge buildup of military assets, unparalleled to anything seen befo…",
    "link": "https://theaviationist.com/2026/01/03/us-military-strikes-venezuela/",
    "timestamp": "2026-01-03T09:54:43Z"
  },
  {
    "title": "Trump says Venezuela's Maduro has been captured after US strike",
    "description": "Venezuelan President Nicolás Maduro and his wife, Cilia Flores, will face charges after an indictment in New York, U.S. Attorney General Pam Bondi said.",
    "link": "https://www.koco.com/article/venezuela-explosions-maduro/69907023",
    "timestamp": "2026-01-03T09:53:30Z"
  },
  {
    "title": "Maduro combined swaggering incompetence with ruthless repression",
    "description": "Nicolas Maduro's misrule was so chronically disastrous, seven million Venezuelans fled - but as the economy failed and the US Navy advanced, he danced, celebrated and compared himself to Taylor Swift.",
    "link": "https://news.sky.com/story/venezuelan-president-maduro-combined-swaggering-incompetence-with-ruthless-repression-13489875",
    "timestamp": "2026-01-03T09:51:00Z"
  },
  {
    "title": "Crypto markets steady as Trump claims US has captured Venezuela’s president",
    "description": "The stability of major cryptocurrencies amid geopolitical tensions suggests resilience and potential decoupling from traditional market reactions.\nThe post Crypto markets steady as Trump claims US has captured Venezuela’s president appeared first on Crypto Br…",
    "link": "https://cryptobriefing.com/bitcoin-ether-xrp-steady-trump-strike-venezuela/",
    "timestamp": "2026-01-03T09:50:37Z"
  },
  {
    "title": "Trump announces the arrest of Maduro and his wife: says US has captured them",
    "description": "US President Donald Trump claims that Venezuelan President Nicolas Maduro and his wife have been captured by the US. This information was confirmed along with the authorship of the",
    "link": "https://www.marca.com/en/lifestyle/us-news/2026/01/03/6958e48e22601d99438b458d.html",
    "timestamp": "2026-01-03T09:50:35Z"
  },
  {
    "title": "Trump claims Venezuelan President Maduro detained, taken out of country",
    "description": "WASHINGTON: US President Donald Trump has claimed that Venezuelan President Nicolas Maduro has been detained and taken out of the country, along with his wife. Posting on his social media platform Truth Social, President Trump said Maduro and his wife were ta…",
    "link": "https://english.khabarhub.com/2026/03/514296/",
    "timestamp": "2026-01-03T09:47:18Z"
  },
  {
    "title": "Trump says Venezuela's Maduro has been captured after US strike",
    "description": "Trump said the Venezuelan president and his wife were \"captured and flown out of the Country\" to the U.S. following multiple explosions in Venezuela's capital.",
    "link": "https://www.wcvb.com/article/venezuela-explosions-maduro/69907023",
    "timestamp": "2026-01-03T09:45:17Z"
  },
  {
    "title": "Trump says Venezuela's Maduro has been captured after US strike",
    "description": "Trump said the Venezuelan president and his wife were \"captured and flown out of the Country\" to the U.S. following multiple explosions in Venezuela's capital.",
    "link": "https://www.wgal.com/article/venezuela-explosions-maduro/69907023",
    "timestamp": "2026-01-03T09:44:40Z"
  },
  {
    "title": "Trump says Venezuela's Maduro has been captured after US strike",
    "description": "Venezuelan President Nicolás Maduro and his wife, Cilia Flores, will face charges after an indictment in New York, U.S. Attorney General Pam Bondi said.",
    "link": "https://www.wlky.com/article/venezuela-explosions-maduro/69907023",
    "timestamp": "2026-01-03T09:43:32Z"
  },
  {
    "title": "The US has followed through on its Venezuela threats - how did we get here?",
    "description": "The US strikes on Venezuela follow a lengthy period of extreme friction between the two countries. Here, we look at how things escalated to this point.",
    "link": "https://news.sky.com/story/us-strikes-on-venezuela-how-did-we-get-here-13489872",
    "timestamp": "2026-01-03T09:43:00Z"
  },
  {
    "title": "Death toll rises to at least 10 in Iran protests",
    "description": "Violence surrounding protests in Iran sparked by the Islamic Republic's ailing economy killed two more people, authorities said on Saturday, raising the death toll in the demonstrations to at least 10 as they showed no signs of stopping.",
    "link": "https://www.independent.ie/world-news/middle-east/death-toll-rises-to-at-least-10-in-iran-protests/a376189272.html",
    "timestamp": "2026-01-03T09:42:26Z"
  },
  {
    "title": "Trump orders Chinese-controlled firm to unwind chip asset deal, citing national security risks",
    "description": "A company controlled by a Chinese national was ordered by U.S. President Donald Trump on Friday to unwind a $2.9 million acquisition of chip assets from a U.S. manufacturer, citing national security concerns.\nThe White House said in an executive order that Hi…",
    "link": "https://biztoc.com/x/f71c57dec9119616",
    "timestamp": "2026-01-03T09:42:02Z"
  },
  {
    "title": "Trump says U.S. operation captured Venezuela’s president Nicolas Maduro",
    "description": "U.S. President Donald Trump said Saturday the United States conducted a large-scale strike in Venezuela that resulted in the capture and removal of Venezuelan President Nicolas Maduro.\nMaduro and his wife were captured and removed from the country following t…",
    "link": "https://biztoc.com/x/a5b59d7300cca7c2",
    "timestamp": "2026-01-03T09:42:00Z"
  },
  {
    "title": "Trump: Maduro captured in large-scale strike on Venezuela",
    "description": "US President Donald Trump announced Saturday that the United States had executed a \"large-scale\" military operation against Venezuela, claiming that Venezuelan President Nicolas Maduro and his wife ha...",
    "link": "https://biztoc.com/x/95d7dc5bc713e5a1",
    "timestamp": "2026-01-03T09:41:49Z"
  },
  {
    "title": "Venezuela defense minister says will resist presence of foreign troops",
    "description": "Jan ‌3 (Reuters) - Venezuela will ‌resist the presence ‌of foreign troops, Defense Minister Vladimir ‍Padrino said in ‍a ‌video early on Saturday, ‍as ​U.S. President Donald ⁠Trump said Venezuelan President Nicolas ‌Maduro had been ⁠captured ‍and was being re…",
    "link": "https://www.thestar.com.my/news/world/2026/01/03/venezuela-defense-minister-says-will-resist-presence-of-foreign-troops",
    "timestamp": "2026-01-03T09:41:00Z"
  },
  {
    "title": "Trump says U.S. operation captured Venezuela’s president Nicolas Maduro",
    "description": "Maduro and his wife were captured and removed from the country following the operation, Trump said in a statement on Truth Social.",
    "link": "https://www.cnbc.com/2026/01/03/trump-us-operation-captured-venezuela-president-nicolas-maduro.html",
    "timestamp": "2026-01-03T09:40:32Z"
  },
  {
    "title": "Trump claims US has captured Venezuelan dictator and wife",
    "description": "US president says on social media that operation to capture Nicolás Maduro carried out with US law enforcement",
    "link": "https://uk.news.yahoo.com/explosions-reported-venezuelan-capital-caracas-071013381.html",
    "timestamp": "2026-01-03T09:39:36Z"
  },
  {
    "title": "Venezuela President Maduro 'captured' after explosions, Trump says",
    "description": "President Donald Trump announced on Truth Social that the United States has captured Venezuelan President Nicolas Maduro and his wife.  He stated they have been flown out of the country following a large-scale strike against Venezuela. The operation was descr…",
    "link": "https://economictimes.indiatimes.com/news/defence/venezuela-president-maduro-captured-after-explosions-trump-says/articleshow/126320000.cms",
    "timestamp": "2026-01-03T09:38:32Z"
  },
  {
    "title": "Death toll rises to at least 10 in violence around Iran protests",
    "description": "Authorities in Iran report that violence surrounding protests over the country's struggling economy has killed two more people, raising the death toll to at least 10",
    "link": "https://abcnews.go.com/International/wireStory/death-toll-rises-10-violence-iran-protests-128861935",
    "timestamp": "2026-01-03T09:33:41Z"
  }
]