[
  {
    "title": "EU agrees weakened climate target in final-hour deal as COP30 summit looms",
    "description": "European Union climate ministers have agreed on a 2040 emissions reduction target. The goal is to cut emissions by 90 percent from 1990 levels. This target includes flexibility for countries to use foreign carbon credits. This decision comes ahead of the COP3…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-agrees-weakened-climate-target-in-final-hour-deal-as-cop30-summit-looms/articleshow/125105385.cms",
    "timestamp": "2025-11-05T08:54:26Z"
  },
  {
    "title": "Champagne and cheers across New York as Mamdani soars to victory",
    "description": "Donald Trump had decisively won the US presidential election last November and very few people outside New York’s leftist circles knew Zohran Mamdani, who had just declared his longshot mayoral candidacy. What a difference a year can make. Crowds across the c…",
    "link": "https://www.digitaljournal.com/world/champagne-and-cheers-across-new-york-as-mamdani-soars-to-victory/article",
    "timestamp": "2025-11-05T08:52:20Z"
  },
  {
    "title": "Big wins for Democrats across US as California votes to redraw districts to counter Republicans",
    "description": "Democrats won major races across Virginia, New Jersey and New York yesterday.",
    "link": "https://www.thejournal.ie/democrats-us-elections-california-districts-governors-6865068-Nov2025/",
    "timestamp": "2025-11-05T08:50:08Z"
  },
  {
    "title": "Ryabkov: No conditions for Putin-Trump meeting",
    "description": "Russian Deputy Foreign Minister Sergey Ryabkov said on Wednesday that the conditions for a meeting between Russian President Vladimir Putin and United States President Donald Trump currently do not ex...",
    "link": "https://biztoc.com/x/c37aaa66f18865ed",
    "timestamp": "2025-11-05T08:48:38Z"
  },
  {
    "title": "Editorial: Federal bureaucrats scoff at ‘arbitrary’ regulations",
    "description": "The Army Corps of Engineers has continued to harass landowners by employing an expansive reading of “wetlands” to stop them from making use of their own property.",
    "link": "https://www.bostonherald.com/2025/11/05/editorial-federal-bureaucrats-scoff-at-arbitrary-regulations/",
    "timestamp": "2025-11-05T08:44:06Z"
  },
  {
    "title": "Israel says returned hostage remains are those of soldier",
    "description": "Israel has confirmed that the remains handed over by Hamas the day before belonged to Israeli-American soldier Itay Chen, who was seized by Palestinian militants during the October 2023 attacks that sparked the Gaza war.",
    "link": "https://www.rte.ie/news/middle-east/2025/1105/1542258-israel-gaza/",
    "timestamp": "2025-11-05T08:42:29Z"
  },
  {
    "title": "China lifts some tariffs on US farm goods but soybeans remain costly",
    "description": "China has ended retaliatory tariffs on a range of US agricultural products but will maintain 10 per cent tariffs on all US goods in response to President Donald Trump's \"Liberation Day\" duties.",
    "link": "https://www.abc.net.au/news/2025-11-05/china-suspends-us-tariffs/105976254",
    "timestamp": "2025-11-05T08:41:27Z"
  },
  {
    "title": "Fox News Poll: How Spanberger won Virginia governor",
    "description": "Democrat Abigail Spanberger defeated Republican Winsome Earle-Sears to become Virginia's next governor, capitalizing on President Donald Trump's unpopularity.",
    "link": "https://www.foxnews.com/politics/fox-news-poll-how-spanberger-won-virginia-governor",
    "timestamp": "2025-11-05T08:41:16Z"
  },
  {
    "title": "Zohran Mamdani’s New York election win fires up the European left wing",
    "description": "\"Hope won,\" declares London Mayor Sadiq Khan after socialist candidate triumphs in America's largest city.",
    "link": "https://www.politico.eu/article/europe-left-wing-top-politicians-cheer-on-nycs-new-socialist-mayor-zohran-mamdani/",
    "timestamp": "2025-11-05T08:41:02Z"
  },
  {
    "title": "Israeli army, settlers strike 2,350 times in West Bank last month: Report",
    "description": "‘Cycle of terror’ spikes as Higher Planning Council set to advance plans to build 1985 new settlement units.",
    "link": "https://www.aljazeera.com/news/2025/11/5/israeli-army-settlers-struck-2350-times-in-west-bank-last-month-report",
    "timestamp": "2025-11-05T08:38:49Z"
  },
  {
    "title": "How to beat Trump? Three Democratic wins show the blueprint",
    "description": "Democrats secured significant victories in key US local elections, boosting party morale. Victories in New York, Virginia, and California highlighted a focus on economic issues and a rejection of President Trump's policies. While diverse in approach, the wins…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-to-beat-trump-three-democratic-wins-including-zohran-mamdani-just-showed-the-blueprint/articleshow/125105005.cms",
    "timestamp": "2025-11-05T08:37:26Z"
  },
  {
    "title": "Zohran Mamdani : La classe ouvrière new-yorkaise élit un maire engagé dans une lutte sociale (Anglais)",
    "description": "Zohran Kwame Mamdani, a Democratic Socialist and the Democratic nominee, will be New York City’s next mayor, after trouncing former Governor Andrew Cuomo in a primary and general election double whammy. “The working people of New York have been told by the we…",
    "link": "https://www.labornotes.org/2025/11/zohran-mamdani-new-yorks-working-class-elects-movement-mayor",
    "timestamp": "2025-11-05T08:34:30Z"
  },
  {
    "title": "Seth Meyers fires back after Donald Trump calls him ‘deranged lunatic’",
    "description": "TV host hits back and jokes the President is the one obsessed with aircraft catapults.",
    "link": "https://www.nzherald.co.nz/entertainment/seth-meyers-fires-back-after-donald-trump-calls-him-deranged-lunatic/ESODMBGG3FDWNOL2LWHYGXXO2M/",
    "timestamp": "2025-11-05T08:33:14Z"
  },
  {
    "title": "Trump renominates billionaire Musk ally to lead NASA",
    "description": "The private astronaut, who has twice been to space in commercially funded missions with SpaceX, was nominated by the US president in the spring, but the rug was pulled at the last minute over his previous donations to Democrats.",
    "link": "https://news.sky.com/story/trump-renominates-billionaire-musk-ally-jared-isaacman-to-lead-nasa-13464219",
    "timestamp": "2025-11-05T08:29:00Z"
  },
  {
    "title": "Paul Krugman Unpacks Real Reason Behind Trump’s ‘Grotesque’ Halloween Party",
    "description": "The \"unspeakably vulgar\" bash was held for one reason, argued the famed economist.",
    "link": "https://www.huffpost.com/entry/paul-krugman-donald-trump-halloween-party_n_690af89be4b09953a605cbff",
    "timestamp": "2025-11-05T08:28:12Z"
  },
  {
    "title": "Japan's Toyota, hurt by President Trump's tariffs, reports a drop in profit",
    "description": "Toyota has reported its net profit fell 7% from a year earlier in April-September as President Donald Trump’s tariffs slammed Japanese automakers",
    "link": "https://abcnews.go.com/Business/wireStory/japans-toyota-hurt-president-trumps-tariffs-reports-drop-127208294",
    "timestamp": "2025-11-05T08:25:59Z"
  },
  {
    "title": "China extends suspension of extra tariffs on US goods",
    "description": "China said Wednesday it would extend a suspension of additional tariffs on U.S. goods for one year, making official an agreement reached in talks between presidents Xi Jinping and Donald Trump last week.",
    "link": "https://www.hurriyetdailynews.com/china-extends-suspension-of-extra-tariffs-on-us-goods-215393",
    "timestamp": "2025-11-05T08:22:36Z"
  },
  {
    "title": "BMW boosts profitability despite China, tariff woes",
    "description": "German carmaker BMW on Wednesday reported a rise in profitability in the last quarter despite facing challenges from slowing Chinese sales and tariffs. The premium manufacturer posted an operating profit margin in its auto unit, closely watched by investors, …",
    "link": "https://www.digitaljournal.com/world/bmw-boosts-profitability-despite-china-tariff-woes/article",
    "timestamp": "2025-11-05T08:22:32Z"
  },
  {
    "title": "Trump pauses China port fees but leaves room to negotiate",
    "description": "Since beginning his second term, US President Donald Trump has repeatedly used tough rhetoric in both domestic and foreign policy, signing numerous controversial executive orders. Following a meeting with Chinese President Xi Jinping at the APEC summit, Trump…",
    "link": "https://www.digitimes.com/news/a20251104PD236/donald-trump-policy-apec.html",
    "timestamp": "2025-11-05T08:20:08Z"
  },
  {
    "title": "Japan’s Toyota, hurt by President Trump’s tariffs, reports a drop in profit",
    "description": "TOKYO (AP) — Toyota reported a 7% year-on-year drop in its profit for April-September on Wednesday, as President Donald Trump’s tariffs slammed Japanese automakers, but it raised its forecast for the full fiscal year. Net profit for the April-September period…",
    "link": "https://financialpost.com/pmn/japans-toyota-hurt-by-president-trumps-tariffs-reports-a-drop-in-profit",
    "timestamp": "2025-11-05T08:17:43Z"
  },
  {
    "title": "‘The backlash has arrived’: Six takeaways from a good night for Democrats",
    "description": "In Virginia, New Jersey and beyond, Democratic voters powered their candidates to victory and sent a warning sign to Donald Trump",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/11/05/us/politics/election-takeaways-democrats.html",
    "timestamp": "2025-11-05T08:16:47Z"
  },
  {
    "title": "Trump once again nominates tech space traveler Jared Isaacman to serve as NASA administrator",
    "description": "President Donald Trump announced Tuesday he has decided to nominate Jared Isaacman to serve as his NASA administrator, months after withdrawing the tech billionaire's nomination because of concerns about his political leanings.",
    "link": "https://www.npr.org/2025/11/05/nx-s1-5599010/trump-nominates-tech-space-jared-isaacman-nasa-administrator",
    "timestamp": "2025-11-05T08:13:56Z"
  },
  {
    "title": "Seattle Mayoral Election: Incumbent Democratic Mayor Bruce Harrell gets tough challenge from activist Katie Wilson as the poll race heats up; who has the edge and when will the results be declared; all you need to know",
    "description": "Seattle's mayoral race is tightening as incumbent Bruce Harrell faces a strong challenge from progressive activist Katie Wilson. Early results show Harrell leading, but Wilson has gained momentum with grassroots support. Final results are expected after sever…",
    "link": "https://economictimes.indiatimes.com/news/international/us/seattle-mayoral-election-incumbent-democratic-mayor-bruce-harrell-gets-tough-challenge-from-activist-katie-wilson-as-the-poll-race-heats-up-who-has-the-edge-and-when-will-the-results-be-declared-all-you-need-to-know/articleshow/125104684.cms",
    "timestamp": "2025-11-05T08:10:05Z"
  },
  {
    "title": "China bans foreign AI chips from state-funded data centres",
    "description": "China has ordered state-funded data centres to use only locally made AI chips, forcing those under 30% complete to remove foreign processors like Nvidia’s. The move boosts domestic firms such as Huawei but threatens foreign chipmakers’ revenues, underscoring …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/china-bans-foreign-ai-chips-from-state-funded-data-centres/articleshow/125104760.cms",
    "timestamp": "2025-11-05T08:09:21Z"
  },
  {
    "title": "ChatGPT nickname and Trump tariffs nominated for Japan’s buzzword of 2025",
    "description": "Words and phrases related to the election of Japan’s first female prime minister and the country’s bear problem also made the list of nominations.",
    "link": "https://www.japantimes.co.jp/news/2025/11/05/japan/society/buzzword-nominees/",
    "timestamp": "2025-11-05T08:09:00Z"
  },
  {
    "title": "Exclusive-China bans foreign AI chips from state-funded data centres, sources say",
    "description": "(Reuters) -The Chinese government has issued guidance requiring new data centre projects that have received any state funds to only use domestically-made...",
    "link": "https://ca.news.yahoo.com/exclusive-china-bans-foreign-ai-080808534.html",
    "timestamp": "2025-11-05T08:08:08Z"
  },
  {
    "title": "China bans foreign AI chips from state-funded data centers, sources say",
    "description": "The latest move by Beijing would dash Nvidia's hopes of regaining Chinese market share.",
    "link": "https://finance.yahoo.com/news/exclusive-china-bans-foreign-ai-080808297.html",
    "timestamp": "2025-11-05T08:08:08Z"
  },
  {
    "title": "California votes to redraw election boundaries to counter Trump",
    "description": "LOS ANGELES: California voted overwhelmingly to redraw its electoral districts on Tuesday (Nov 4), in a poll Democrats called to counter efforts by US President Donald Trump to gerrymander in Republican states.Early results showed a large majority in the trad…",
    "link": "https://www.channelnewsasia.com/world/california-votes-redraw-election-boundaries-counter-trump-5447256",
    "timestamp": "2025-11-05T08:08:00Z"
  },
  {
    "title": "Zohran Mamdani's Victory Speech in Full",
    "description": "Democratic socialist Zohran Mamdani won the New York election after the highest turnout for a mayoral contest in more than 50 years.\nHe used his first speech to take a shot at U.S. President Donald Trump and celebrated \"toppling a political dynasty\" - here is…",
    "link": "https://biztoc.com/x/c7d2a85360a15fce",
    "timestamp": "2025-11-05T08:04:50Z"
  },
  {
    "title": "China ends tariffs on US imports including farm goods but soy bean levies remain; M&S profits hammered by cyber-attack – business live",
    "description": "Asian stock markets fall after Wall Street tumble on tech valuation fears\nGood morning, and welcome to our rolling coverage of business, the financial markets and the world economy.\nChina will suspend retaliatory tariffs on US imports following last week’s hi…",
    "link": "https://biztoc.com/x/eb7b296093dc02e0",
    "timestamp": "2025-11-05T08:04:47Z"
  },
  {
    "title": "Trump Demands Voting Changes Hours After Major Democrat Wins",
    "description": "Donald Trump is calling for sweeping election reform, hours after Democrats notched a series of victories in statewide elections.",
    "link": "https://biztoc.com/x/6af10cbceeab284d",
    "timestamp": "2025-11-05T08:04:37Z"
  },
  {
    "title": "Socialist Zohran Mamdani Elected Mayor of New York",
    "description": "Socialist Democrat Zohran Mamdani is elected Mayor of New York. CBS News projected that the 34-year-old won 50.4% of the vote, compared to independent Andrew Cuomo’s 41.6% and Republican Curtis Sliwa’s 7%. More than 2 million people voted… Mamdani – who descr…",
    "link": "https://order-order.com/2025/11/05/socialist-zohran-mamdani-elected-mayor-of-new-york/",
    "timestamp": "2025-11-05T08:01:36Z"
  },
  {
    "title": "2028 already? Off-year elections provide crucial test for Trump and the Democrats",
    "description": "Trump remains absent from Virginia and New Jersey campaigns while speculation grows about JD Vance and Marco Rubio's roles in the 2028 presidential race.",
    "link": "https://www.foxnews.com/media/2028-already-off-year-elections-provide-crucial-test-trump-democrats",
    "timestamp": "2025-11-05T08:00:42Z"
  },
  {
    "title": "Government shutdown becomes longest in US history as impact felt nationwide",
    "description": "As the shutdown enters its 36th day, Democrats and Republicans remain unwavering over healthcare spending.",
    "link": "https://www.aljazeera.com/news/2025/11/5/government-shutdown-becomes-longest-in-us-history-as-impact-felt-nationwide",
    "timestamp": "2025-11-05T07:59:07Z"
  },
  {
    "title": "US government shutdown now longest ever",
    "description": "The government standstill entered its 36th day, making it the longest closure on record. Congress has failed to approve funding for the new fiscal year that began on October 1.",
    "link": "https://www.dw.com/en/us-government-shutdown-now-longest-ever/a-74621074",
    "timestamp": "2025-11-05T07:57:00Z"
  },
  {
    "title": "Trump administration announces 16th deadly strike on an alleged drug boat",
    "description": "The attack Tuesday killed two people aboard the vessel, Hegseth said, bringing the death toll from the Trump administration's campaign in South American waters up to at least 66 people.",
    "link": "https://www.npr.org/2025/11/05/nx-s1-5599008/trump-administration-16th-strike-drug-boat",
    "timestamp": "2025-11-05T07:56:52Z"
  },
  {
    "title": "Maryland’s Governor Makes Moves Toward A Redistricting Push",
    "description": "Democratic Gov. Wes Moore announced a commission on the subject on Tuesday.",
    "link": "https://www.huffpost.com/entry/wes-moore-maryland-redistricting_n_690ae5e1e4b0ccb451d79e42",
    "timestamp": "2025-11-05T07:54:21Z"
  },
  {
    "title": "McGrath calls for greater co-operation from China on product safety",
    "description": "Commissioner says 12 million small parcels enter the European Union every day, 90 per cent of them from China",
    "link": "https://www.irishtimes.com/business/2025/11/05/mcgrath-calls-for-greater-co-operation-from-china-on-product-safety/",
    "timestamp": "2025-11-05T07:50:35Z"
  },
  {
    "title": "Joy precedes scrutiny: Inside Mamdani's victory party",
    "description": "BBC News correspondent Nada Tawfik reports from inside the Zohran Mamdani's mayoral victory party.",
    "link": "https://www.bbc.com/news/videos/cj97rprxllmo",
    "timestamp": "2025-11-05T07:50:24Z"
  },
  {
    "title": "LIZ PEEK: Democrats cheer Mamdani's win — they'll be crying soon enough",
    "description": "Here's why Zohran Mamdani's win as New York City's Democratic Socialist mayor spells trouble for moderate Democrats in future elections across America.",
    "link": "https://www.foxnews.com/opinion/liz-peek-democrats-cheer-mamdanis-win-theyll-crying-soon-enough",
    "timestamp": "2025-11-05T07:49:04Z"
  },
  {
    "title": "Russian crude oil flows uninterrupted to India, for now",
    "description": "Even as Russian shipments fell by 8% on an annual basis, analysts, refiners and traders indicated that the development is more about diversification rather than enforcement",
    "link": "https://www.thehindubusinessline.com/markets/commodities/russian-crude-oil-flows-uninterrupted-to-india-for-now/article70243405.ece",
    "timestamp": "2025-11-05T07:48:13Z"
  },
  {
    "title": "AOC says Trump stopped MTG's potential Senate run, sparking her 'revenge tour' against GOP",
    "description": "Rep. Alexandria Ocasio-Cortez said President Donald Trump blocked Rep. Marjorie Taylor Greene's Senate run, sparking her recent \"revenge tour.\"",
    "link": "https://www.foxnews.com/politics/aoc-says-trump-stopped-mtgs-potential-senate-run-sparking-her-revenge-tour-against-gop",
    "timestamp": "2025-11-05T07:46:06Z"
  },
  {
    "title": "Zohran Mamdani: Who is the new mayor of New York City?",
    "description": "New Yorkers have chosen Zohran Mamdani as their next mayor. The 34-year-old's immigrant background and socialist principles appeal to many of them, but not to Donald Trump.",
    "link": "https://www.dw.com/en/zohran-mamdani-who-is-the-new-mayor-of-new-york-city/a-74572160",
    "timestamp": "2025-11-05T07:44:00Z"
  },
  {
    "title": "‘Trump Wasn’t On The Ballot’: President Reacts As Democrats Sweep Major Races",
    "description": "The president appeared to blame the GOP’s poor performance on election night on his name not being on the ballot, despite losses for candidates endorsed by him.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/11/05/trump-wasnt-on-the-ballot-president-reacts-as-democrats-sweep-major-races/",
    "timestamp": "2025-11-05T07:36:21Z"
  },
  {
    "title": "Trump tariffs face Supreme Court test in trillion-dollar test of executive power",
    "description": "Multiple lawsuits have been filed over the tariffs, and the court will hear suits filed by Democratic-leaning states and small businesses focused on everything from plumbing supplies to women’s cycling apparel",
    "link": "https://www.thehindubusinessline.com/news/world/trump-tariffs-face-supreme-court-test-in-trillion-dollar-test-of-executive-power/article70243449.ece",
    "timestamp": "2025-11-05T07:35:27Z"
  },
  {
    "title": "Jimmy Kimmel Goes Off On Trump's 'Cruel' Move",
    "description": "The late night host tore into the president's attempt to cut SNAP benefits.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-snap_n_690aed29e4b0ccb451d79f84",
    "timestamp": "2025-11-05T07:33:25Z"
  },
  {
    "title": "Mamdani vs. Vance’s Fixed Prizefight Ushers in 2027 Blue/Red Civil War",
    "description": "…\nThe post Mamdani vs. Vance’s Fixed Prizefight Ushers in 2027 Blue/Red Civil War appeared first on Global Research.",
    "link": "https://leftonleft.substack.com/p/mamdani-vs-vances-fixed-prizefight",
    "timestamp": "2025-11-05T07:32:26Z"
  },
  {
    "title": "Americast",
    "description": "And the Democrats have also won governor races in Virginia and New Jersey",
    "link": "https://www.bbc.co.uk/sounds/play/p0mdvjlt",
    "timestamp": "2025-11-05T07:32:00Z"
  },
  {
    "title": "Trump administration nears deals with pharmaceutical companies to offer obesity drugs for $149 a month",
    "description": "(CNN) — The Trump administration is nearing deals with drugmakers Eli Lilly and Novo Nordisk to offer some of their obesity drugs to consumers for as low as $149 per",
    "link": "https://www.wsiltv.com/news/national/trump-administration-nears-deals-with-pharmaceutical-companies-to-offer-obesity-drugs-for-149-a-month/article_655d5624-d6d4-5834-84c9-4d8b99ad64c7.html",
    "timestamp": "2025-11-05T07:26:59Z"
  },
  {
    "title": "Trump’s Aussie billionaire ally wins big in a ‘rare’ global battle",
    "description": "Australian mining magnate Gina Rinehart is capitalizing on the global push to reduce reliance on China's rare-earth supply chain. She has built the largest rare-earth portfolio outside China, with her investments in four companies alone valued at $1.8 billion.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/gina-rinehart-donald-trump-rare-earths-battle-united-states-australia-china-critical-minerals/articleshow/125103866.cms",
    "timestamp": "2025-11-05T07:26:30Z"
  },
  {
    "title": "Zohran Mamdani's win in New York suggests some of Trump's voters have deserted him",
    "description": "Mamdani's victory feels big - for him and his political movement. His left-wing politics and promises on affordability chimed with a body of people who feel disenfranchised from politics, whatever the party.",
    "link": "https://news.sky.com/story/zohran-mamdanis-win-in-new-york-suggests-some-of-donald-trumps-voters-have-deserted-him-13464187",
    "timestamp": "2025-11-05T07:21:00Z"
  },
  {
    "title": "What Zohran Mamdani's win means for Trump",
    "description": "Mamdani's victory feels big - for him and his political movement. His left-wing politics and promises on affordability chimed with a body of people who feel disenfranchised from politics, whatever the party.",
    "link": "https://news.sky.com/story/zohran-mamdanis-win-in-new-york-suggests-he-hit-on-a-formula-that-worked-for-trump-13464187",
    "timestamp": "2025-11-05T07:21:00Z"
  },
  {
    "title": "US supreme court to hear oral arguments on legality of Trump imposing tariffs",
    "description": "President’s tariffs to be scrutinized in crucial legal test of his strategy to impose tariffs on nearly every US trading partner\nDonald Trump’s sweeping tariffs on the world will be scrutinized by the US supreme court today, a crucial legal test of the presid…",
    "link": "https://biztoc.com/x/e9aa034f293faf32",
    "timestamp": "2025-11-05T07:20:56Z"
  },
  {
    "title": "What to know about Mamdani and what he wants to do in NYC",
    "description": "The 34-year-old state assemblyman from Queens has risen from obscurity to national prominence with a bold, left-wing platform.",
    "link": "https://www.bbc.com/news/articles/cew44175vklo",
    "timestamp": "2025-11-05T07:20:51Z"
  },
  {
    "title": "Election results 2025: Mamdani wins New York mayor race",
    "description": "Zohran Mamdani has won the New York mayoral race, defeating former Governor Andrew Cuomo and Republican Curtis Sliwa. The 34-year-old democratic socialist has drawn the ire of President Donald Trump. DW has more.",
    "link": "https://www.dw.com/en/election-results-2025-mamdani-wins-new-york-mayor-race/live-74608059",
    "timestamp": "2025-11-05T07:20:00Z"
  },
  {
    "title": "Pope Leo Rebukes Trump With Christ's 'End Of The World' Warning",
    "description": "The pontiff quoted Jesus’ words about Judgment Day.",
    "link": "https://www.huffpost.com/entry/pope-leo-donald-trump-treatment-immigrants_n_690af435e4b09953a605ca6e",
    "timestamp": "2025-11-05T07:16:28Z"
  },
  {
    "title": "Gavin Newsom takes on Trump as Democrats sweep New Jersey, New York, and Virginia, is he the next Democratic presidential face?",
    "description": "California Governor Gavin Newsom declared a night of Democratic gains a  victory for democracy  and a rebuke of Donald Trump.  The results, bolstered by wins in New York, New Jersey, and Virginia, signal a strong Democratic resurgence and bolster Newsom's nat…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gavin-newsom-takes-on-trump-as-democrats-sweep-new-jersey-new-york-and-virginia-is-he-the-next-democratic-presidential-face/articleshow/125103911.cms",
    "timestamp": "2025-11-05T07:15:29Z"
  },
  {
    "title": "China Eases US Tariffs, Scraps Farm Levies As Trump Cuts Fentanyl Duties In Fresh Trade Truce",
    "description": "China has rolled back 24% additional tariffs on U.S. goods for a year, but the 10% levies introduced in response to President Donald Trump‘s ‘Liberation Day‘ duties will remain in effect, the country’s cabinet confirmed on Wednesday. \nMeanwhile, Trump signed …",
    "link": "https://biztoc.com/x/165906b424749653",
    "timestamp": "2025-11-05T07:09:48Z"
  },
  {
    "title": "Brussels dreams of Norway saving Ukraine",
    "description": "In today’s edition: Norway could unlock the EU’s frozen-assets loan to Ukraine by tapping its sovereign wealth fund, Parliament threatens to torpedo the Commission’s €2 trillion budget proposal, and ex-Justice Commissioner Didier Reynders faces money launderi…",
    "link": "https://www.euractiv.com/news/rapporteur-brussels-dreams-of-norway-saving-ukraine/",
    "timestamp": "2025-11-05T07:09:34Z"
  },
  {
    "title": "How Zohran Mamdani beat back New York’s elite and was elected mayor",
    "description": "A young democratic socialist, Mamdani had just toppled former Gov. Andrew Cuomo, upending New York’s power structure in an upset so stunning and so swift that even he had not fully seen it coming.",
    "link": "https://indianexpress.com/article/world/how-zohran-mamdani-beat-back-new-yorks-elite-and-was-elected-mayor-10347110/",
    "timestamp": "2025-11-05T07:04:29Z"
  },
  {
    "title": "Muslims Gloat over Zohran Mamdani's Election Victory: 'America's Mayor'",
    "description": "Islamic advocates are gloating over the election of a Muslim immigrant to the mayoralty of New York City.\nThe post Muslims Gloat over Zohran Mamdani’s Election Victory: ‘America’s Mayor’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/11/04/muslims-gloat-mamdami-win-americas-mayor/",
    "timestamp": "2025-11-05T07:01:30Z"
  },
  {
    "title": "U-Turn By FTX: Withdraws Proposal Potentially Impacting Customer Claims Worldwide",
    "description": "The bankruptcy estate of the now-defunct cryptocurrency exchange FTX has decided to withdraw its motion aimed at limiting creditor distributions to certain “potentially restricted foreign jurisdictions.” This decision follows substantial pushback from credito…",
    "link": "https://bitcoinist.com/ftx-withdraws-proposal-impacting-customer-claims/",
    "timestamp": "2025-11-05T07:00:41Z"
  },
  {
    "title": "SBF Seeks New Trial: Lawyers Argue FTX’s Founder Was ‘Blocked’ From Fair Defense",
    "description": "Ahead of his Tuesday appeal hearing, Sam Bankman-Fried’s lawyers have claimed that the FTX co-founder was unfairly convicted and was not allowed to tell his full story during his 2023 trial. Related Reading: Elon Musk Rekindles Dogecoin Hype: ‘It’s Time’ FTX …",
    "link": "https://bitcoinist.com/sbf-lawyers-ftx-founder-blocked-fair-defense/",
    "timestamp": "2025-11-05T07:00:16Z"
  },
  {
    "title": "Caribbean Catastrophes: The Hurricane We See and the War We Don’t",
    "description": "On September 23, in a thuggish address to the United Nations Donald Trump explicitly threatened to blow “Venezuelan terrorist drug smugglers” “out of existence” in blatant disregard of international law or due process. Sure enough, as of the end of October, U…",
    "link": "https://www.counterpunch.org/2025/11/05/caribbean-catastrophes-the-hurricane-we-see-and-the-war-we-dont/",
    "timestamp": "2025-11-05T07:00:00Z"
  },
  {
    "title": "Socialist Zohran Mamdani elected as New York’s youngest mayor in over a century",
    "description": "The 34-year-old garnered over a million votes in the mayoral race.",
    "link": "https://www.thejournal.ie/zohran-mamdani-new-york-mayor-6865041-Nov2025/",
    "timestamp": "2025-11-05T06:58:12Z"
  },
  {
    "title": "Mamdani elected New York City mayor: What are his duties, challenges?",
    "description": "The mayor of the City of New York is the chief executive of the city. His office, located in New York City Hall, enjoys jurisdiction over all five city boroughs — Manhattan, Brooklyn, the Bronx, Queens and Staten Island",
    "link": "https://indianexpress.com/article/explained/explained-global/zohran-mamdani-new-york-city-mayor-duties-challenges-10347080/",
    "timestamp": "2025-11-05T06:56:53Z"
  },
  {
    "title": "EU leaders skipping Latin America summit to avoid upsetting Trump – FT",
    "description": "European leaders are reportedly skipping the EU-CELAC summit to avoid annoying US President Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627349-eu-leaders-skipping-latin-america-summit-not-to-upset-trump/",
    "timestamp": "2025-11-05T06:53:45Z"
  },
  {
    "title": "Zohran Mamdani wins New York as Democratic electoral sweep deals blow to Donald Trump - Financial Times",
    "description": "Zohran Mamdani wins New York as Democratic electoral sweep deals blow to Donald TrumpFinancial Times Mamdani takes reins of a NYC beset by challengesPolitico Celebrating diversity, Mamdani's election night party showcases a new coalitionUSA Today Election res…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179969458",
    "timestamp": "2025-11-05T06:53:16Z"
  },
  {
    "title": "Trump tariffs face Supreme Court test in trillion-dollar test of executive power",
    "description": "President Donald Trump’s power to unilaterally impose far-reaching tariffs is coming before the Supreme Court on Wednesday in a pivotal test of executive power with trillion-dollar implications for the global economy",
    "link": "https://biztoc.com/x/3b834ccae6f4f046",
    "timestamp": "2025-11-05T06:48:02Z"
  },
  {
    "title": "Trump heads to Miami to speak about his economic agenda on the anniversary of his election win",
    "description": "Trump heads to Miami to speak about his economic agenda on the anniversary of his election win\nPresident Donald Trump is heading to Miami, speaking on the anniversary of his reelection to a second term\nWASHINGTON -- President Donald Trump is heading to Miami …",
    "link": "https://biztoc.com/x/f04e8ac3845ede1e",
    "timestamp": "2025-11-05T06:47:39Z"
  },
  {
    "title": "Economic policy is one thing Nigel Farage can’t crib from the Donald Trump playbook | Rafael Behr",
    "description": "The Maga model, based on the US’s exorbitant market privileges, can’t be imported to Britain. That’s going to be a problem for Reform UK\nNigel Farage loves a gamble. In his 2015 memoir, The Purple Revolution, a whole chapter is dedicated to the then Ukip lead…",
    "link": "https://biztoc.com/x/77ee5232931ca077",
    "timestamp": "2025-11-05T06:47:23Z"
  },
  {
    "title": "Trump turnabout sees him re-nominate amateur astronaut Jared Isaacman to run NASA",
    "description": "Ruled him out just six months ago due to Musky connections\nUS president Donald Trump on Tuesday decided who he wants to lead NASA, despite having ruled out the same person six months ago.…",
    "link": "https://biztoc.com/x/b2e1ce53b309b7d1",
    "timestamp": "2025-11-05T06:47:17Z"
  },
  {
    "title": "Texas race to replace deceased Democrat advances to runoff",
    "description": "The race to replace the late Democratic Rep. Sylvester Turner in Texas’ 18th Congressional District advanced to a runoff election between Democrats Christian Menefee and Amanda Edwards.",
    "link": "https://www.foxnews.com/politics/texas-race-replace-deceased-democrat-advances-runoff",
    "timestamp": "2025-11-05T06:46:11Z"
  },
  {
    "title": "Democrats sweep first major elections of second Trump term",
    "description": "Democrats swept a trio of races on Tuesday in the first major elections since Donald Trump regained the presidency, elevating a new generation of leaders and giving the beleaguered party a shot of momentum ahead of next year's congressional elections.",
    "link": "https://www.independent.ie/world-news/north-america/democrats-sweep-first-major-elections-of-second-trump-term/a1335716590.html",
    "timestamp": "2025-11-05T06:45:21Z"
  },
  {
    "title": "MARK PENN: Democrats win the moment, but left-wing tilt threatens their future",
    "description": "Democratic party rebounds in 2025 elections with moderate female candidates winning key races, but socialist influence grows as Zohran Mamdani captures New York City mayor's seat.",
    "link": "https://www.foxnews.com/opinion/mark-penn-democrats-win-moment-left-wing-tilt-threatens-future",
    "timestamp": "2025-11-05T06:43:52Z"
  },
  {
    "title": "Zohran Mamdani becomes the first Muslim mayor of New York – His victory changes the political map of the US",
    "description": "A shocking development 24 years after September 11 - The 34-year-old Democrat, who called himself “Trump’s worst nightmare”, prevailed over Andrew Cuomo and Republican Curtis Sliwa\nThe post Zohran Mamdani becomes the first Muslim mayor of New York – His victo…",
    "link": "https://en.protothema.gr/2025/11/05/zohran-mamdani-becomes-the-first-muslim-mayor-of-new-york-his-victory-changes-the-political-map-of-the-us/",
    "timestamp": "2025-11-05T06:42:23Z"
  },
  {
    "title": "Zohran Mamdani elected New York mayor – vows to serve all communities",
    "description": "Zohran Mamdani has been elected as New York City’s first Muslim mayor.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/5/zohran-mamdani-elected-new-york-mayor-vows-to-serve-all-communities",
    "timestamp": "2025-11-05T06:40:57Z"
  },
  {
    "title": "Trump turnabout sees him re-nominate amateur astronaut Jared Isaacman to run NASA",
    "description": "Ruled him out just six months ago due to Musky connections US president Donald Trump on Tuesday decided who he wants to lead NASA, despite having ruled out the same person six months ago.…",
    "link": "https://www.theregister.com/2025/11/05/jared_isaacman_nasa_administrator_again/",
    "timestamp": "2025-11-05T06:40:54Z"
  },
  {
    "title": "New York mayor-elect Zohran Mamdani issues challenge to Donald Trump after stunning win",
    "description": "Democratic Socialist (34) achieves ‘one of the great US political upsets’, as Democrats post governor wins in New Jersey and Virginia",
    "link": "https://www.irishtimes.com/world/us/2025/11/05/new-york-mayor-elect-zohran-mamdani-issues-challenge-to-donald-trump-after-stunning-win/",
    "timestamp": "2025-11-05T06:40:51Z"
  },
  {
    "title": "California voters approve new US House map to boost Democrats in 2026",
    "description": "California voters have approved a plan to overhaul the state’s congressional district boundaries, giving Democrats a boost in their bid to win the U.S. House majority next year",
    "link": "https://abcnews.go.com/US/wireStory/california-voters-approve-new-us-house-map-boost-127159671",
    "timestamp": "2025-11-05T06:37:32Z"
  },
  {
    "title": "Democrats sweep the night's biggest elections: From the Politics Desk",
    "description": "Democrats scored a series of victories across the country Tuesday on the first major Election Day of President Donald Trump’s second term.",
    "link": "https://www.nbcnews.com/politics/politics-news/democrats-sweep-first-major-elections-trumps-second-term-politics-desk-rcna242043",
    "timestamp": "2025-11-05T06:36:41Z"
  },
  {
    "title": "Democrat Zohran Mamdani wins New York mayoral race and tells Trump: ‘Turn the volume up on your TV’",
    "description": "New York City Mayor-elect Zohran Mamdani wasted no time calling out President Donald Trump, formally kicking off the battle that will likely define relations between the 34-year-old mayor and the president whose celebrity is tied to the city.",
    "link": "https://www.independent.ie/world-news/north-america/democrat-zohran-mamdani-wins-new-york-mayoral-race-and-tells-trump-turn-the-volume-up-on-your-tv/a783548089.html",
    "timestamp": "2025-11-05T06:35:27Z"
  },
  {
    "title": "Democrat Zohran Mamdani wins New York mayoral race, and tells Trump: ‘Turn the volume up’",
    "description": "New York City Mayor-elect Zohran Mamdani wasted no time calling out President Donald Trump, formally kicking off the battle that will likely define relations between the 34-year-old mayor and the president whose celebrity is tied to the city.",
    "link": "https://www.independent.ie/world-news/north-america/democrat-zohran-mamdani-wins-new-york-mayoral-race-and-tells-trump-turn-the-volume-up/a783548089.html",
    "timestamp": "2025-11-05T06:35:26Z"
  },
  {
    "title": "Six takeaways from Canada's federal budget - BBC",
    "description": "Six takeaways from Canada's federal budgetBBC Carney plans billions in new spending in response to US tariff shocksBBC Canada budget adds tens of billions to deficit as Carney spends to dampen Trump tariffs effectThe Guardian Canada, in push away from US, aim…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179969276",
    "timestamp": "2025-11-05T06:32:39Z"
  },
  {
    "title": "'A new day' - Democrat Mikie Sherrill wins New Jersey governor race - BBC",
    "description": "'A new day' - Democrat Mikie Sherrill wins New Jersey governor raceBBC 6 Takeaways From Democrat Mikie Sherrill’s Victory in New JerseyThe New York Times Live election results for New Jersey governor, Philadelphia DA and more 2025 racesCBS News New Jersey 202…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179969274",
    "timestamp": "2025-11-05T06:32:29Z"
  },
  {
    "title": "What Chinese leaders really think of Trump",
    "description": "The Chinese view is that we are entering a prolonged phase of counter-globalization.",
    "link": "https://www.japantimes.co.jp/commentary/2025/11/05/world/what-chinese-leaders-think-of-trump/",
    "timestamp": "2025-11-05T06:30:00Z"
  },
  {
    "title": "World on track to dangerous warming as emissions hit record high: UN",
    "description": "National commitments to slash heat-trapping pollution would limit global warming up to 2.5C this century -- nowhere near enough to avoid devastating climate impacts despite a sweep of new pledges, the UN warned Tuesday. Big polluters most responsible for the …",
    "link": "https://economictimes.indiatimes.com/news/environment/global-warming/world-on-track-to-dangerous-warming-as-emissions-hit-record-high-un/articleshow/125103038.cms",
    "timestamp": "2025-11-05T06:29:41Z"
  },
  {
    "title": "How Zohran Mamdani beat back New York's elite and was elected Mayor",
    "description": "Zohran Mamdani achieved a stunning primary victory, surprising many.  He then engaged in a crucial backroom campaign.  Mamdani charmed powerful business leaders and politicians.  This effort helped him overcome opposition and secure the mayoralty.  His rise m…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-muslim-zohran-mamdani-beat-back-new-yorks-elite-and-was-elected-mayor-donald-trump/articleshow/125103000.cms",
    "timestamp": "2025-11-05T06:28:12Z"
  },
  {
    "title": "After confirming possible White House run, California's Newsom scores a win in fight for US House",
    "description": "California Governor Gavin Newsom secured a victory with Proposition 50, which redraws U.S. House maps to favor Democrats. This move, framed as a direct response to President Trump's redistricting efforts, bolsters Newsom's national profile as a leading Democr…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/after-confirming-possible-white-house-run-californias-newsom-scores-a-win-in-fight-for-us-house/articleshow/125102996.cms",
    "timestamp": "2025-11-05T06:28:07Z"
  },
  {
    "title": "Election 2025 key takeaways: Democrats score historic big wins leading into midterms",
    "description": "Election 2025 key takeaways: Democrats score historic big wins leading into midtermsgo.com",
    "link": "https://abcnews.go.com/Politics/election-2025-key-takeaways-democrats-score-historic-big/story?id=127196303",
    "timestamp": "2025-11-05T06:27:15Z"
  },
  {
    "title": "Republicans look for lessons in an election dominated by Democratic wins",
    "description": "No one thought Tuesday was going to be Donald Trump’s election night, but there were even fewer silver linings than many Republicans had hoped.",
    "link": "https://www.nbcnews.com/politics/elections/republicans-lessons-election-dominated-democratic-wins-rcna242032",
    "timestamp": "2025-11-05T06:25:35Z"
  },
  {
    "title": "Texas Democrats Menefee and Edwards advance to runoff for vacant US House seat",
    "description": "A Houston official and a former City Council member are headed to a runoff for the vacant U.S. House seat in a heavily Democratic district",
    "link": "https://abcnews.go.com/Politics/wireStory/texas-democrats-menefee-edwards-advance-runoff-vacant-us-127207266",
    "timestamp": "2025-11-05T06:21:48Z"
  },
  {
    "title": "Seattle Mayor Bruce Harrell faces a hard reelection fight against progressive activist Katie Wilson",
    "description": "Democratic Seattle Mayor Bruce Harrell faces a tough reelection fight against progressive activist Katie Wilson as voters in the liberal city question whether he’s done enough in his first term to address public safety, homelessness and affordability",
    "link": "https://abcnews.go.com/Politics/wireStory/seattle-mayor-bruce-harrell-faces-hard-reelection-fight-127195275",
    "timestamp": "2025-11-05T06:21:27Z"
  },
  {
    "title": "A senior Russian lawmaker says Moscow just delivered new air defense systems to Venezuela",
    "description": "Alexei Zhuravlev also said Russia isn't restricted from sending offensive weapons, such as the Oreshnik ballistic missile, to Venezuela.",
    "link": "https://www.businessinsider.com/russian-lawmaker-send-pantsir-buk-venezuela-air-defenses-ilyushin-2025-11",
    "timestamp": "2025-11-05T06:16:49Z"
  },
  {
    "title": "California’s Proposition 50 on redistricting to pass in blow to Trump",
    "description": "Major victory for California Governor Gavin Newsom could tip congressional balance of power in Democrats' favour.",
    "link": "https://www.aljazeera.com/news/2025/11/5/california-proposition-50-on-redistricting-set-to-pass-in-blow-to-trump",
    "timestamp": "2025-11-05T06:16:11Z"
  },
  {
    "title": "Who were the winners of the November 4 US elections?",
    "description": "Millions of Americans have flocked to polling booths around the US, casting their votes for governors, mayors and ballot measures.",
    "link": "https://www.abc.net.au/news/2025-11-05/us-2025-election-winners-governors-mayors-ballot-measures/105975214",
    "timestamp": "2025-11-05T06:14:33Z"
  },
  {
    "title": "Maps show election results for NYC mayor and New Jersey, Virginia governor's races - CBS News",
    "description": "Maps show election results for NYC mayor and New Jersey, Virginia governor's racesCBS News Democrats sweep the first major elections of Trump’s second termCNN 'Repudiation': Democrats deliver warning to Trump as big midterm test approachesUSA Today 2025 Elect…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179969076",
    "timestamp": "2025-11-05T06:13:26Z"
  },
  {
    "title": "Zohran Mamdani: meteoric rise of New York’s visionary new mayor - The Guardian",
    "description": "Zohran Mamdani: meteoric rise of New York’s visionary new mayorThe Guardian NYC Mayoral Election Live Updates: Mamdani, Cuomo and Sliwa Put Their Fates in Voters' HandsThe New York Times Zohran Mamdani promises city will lead the way opposing TrumpNBC News Ma…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179969074",
    "timestamp": "2025-11-05T06:13:15Z"
  }
]