[
  {
    "title": "So what is the big deal with Greenland anyway?",
    "description": "Greenland has a population not much larger than Chapel Hill spread across a vast and often cold and desolate landscape. Greenland may be one of those important hinge points in history people need to take seriously",
    "link": "https://www.ncspin.com/so-what-is-the-big-deal-with-greenland-anyway",
    "timestamp": "2026-01-29T17:02:33Z"
  },
  {
    "title": "Trump admin joins lawsuit against UCLA medical school over ‘racist’ admissions process that hurts white students",
    "description": "The Trump administration is accusing California’s top public medical school of racial discrimination against white and Asian students in its admissions process, announcing plans to join a federal lawsuit.",
    "link": "https://nypost.com/2026/01/29/us-news/trump-joins-lawsuit-against-ucla-medical-school-over-racial-discrimination/",
    "timestamp": "2026-01-29T17:02:24Z"
  },
  {
    "title": "SEC CHAIR ATKINS, CFTC CHAIR SELIG : Team Trump readies crypto plan so Americans can count on their future",
    "description": "SEC and CFTC relaunch Project Crypto initiative to modernize digital asset regulation and blockchain oversight for financial markets and investors.",
    "link": "https://www.foxnews.com/opinion/sec-chair-atkins-cftc-chair-selig-team-trump-readies-crypto-plan-so-americans-can-count-future",
    "timestamp": "2026-01-29T17:00:49Z"
  },
  {
    "title": "Rand Paul Heads to Newsmax to Call Out Trump Administration’s ‘Obviously Not True’ Rhetoric On Shooting of Alex Pretti",
    "description": "Rand Paul said his fellow Republicans claiming the death of Minneapolis man Alex Pretti was a \"good shooting\" clearly aren't watching the video available.\nThe post Rand Paul Heads to Newsmax to Call Out Trump Administration’s ‘Obviously Not True’ Rhetoric On …",
    "link": "https://www.mediaite.com/media/tv/rand-paul-heads-to-newsmax-to-call-out-trump-administrations-obviously-not-true-rhetoric-on-shooting-of-alex-pretti/",
    "timestamp": "2026-01-29T17:00:31Z"
  },
  {
    "title": "Senate Democrats Say They Want a Crypto Bill—But Republicans Tanked Negotiations",
    "description": "Zero Senate Agriculture Democrats voted for a crypto market structure bill Thursday, which squeaked by a markup on party lines.",
    "link": "https://decrypt.co/356334/senate-democrats-want-crypto-bill-republicans-tanked-negotiations",
    "timestamp": "2026-01-29T17:00:27Z"
  },
  {
    "title": "Momentum Builds in Europe for Boycott of U.S.-Hosted World Cup Games",
    "description": "Some Europeans have cited Trump’s violent immigration crackdown and threats to annex Greenland as reasons for a boycott.",
    "link": "https://truthout.org/articles/momentum-builds-in-europe-for-boycott-of-u-s-hosted-world-cup-games/",
    "timestamp": "2026-01-29T16:58:48Z"
  },
  {
    "title": "Trump says he’s instructed US officials to reopen Venezuelan airspace for commercial travel",
    "description": "Americans will soon be able to visit, the president said.",
    "link": "https://www.bostonherald.com/2026/01/29/venezuela-air-space/",
    "timestamp": "2026-01-29T16:58:01Z"
  },
  {
    "title": "China And UK Forge Long Term Strategic Partnership Amid Global Uncertainty",
    "description": "In an apparent reference to Trump&#039;s military action against Venezuela and threats to take over Greenland, which is opposed by Britain, Xi said China will never pose a threat to other countries, no matter how it grows and develops.",
    "link": "https://www.ndtvprofit.com/world/xi-starmer-agree-to-develop-long-term-comprehensive-strategic-partnership-as-trump-shadow-looms-10909660",
    "timestamp": "2026-01-29T16:57:34Z"
  },
  {
    "title": "Video: Lady Gaga Pauses Tokyo Concert to Smear and Lie About ICE",
    "description": "Pop star Lady Gaga halted her concert in Tokyo, Japan, this week to bash the United States and reel off false claims about the actions of Immigration and Customs Enforcement (ICE) back in the states.\nThe post Video: Lady Gaga Pauses Tokyo Concert to Smear and…",
    "link": "https://www.breitbart.com/entertainment/2026/01/29/video-lady-gaga-pauses-tokyo-concert-to-smear-and-lie-about-ice/",
    "timestamp": "2026-01-29T16:55:30Z"
  },
  {
    "title": "Nicki Minaj shows off her Trump gold card designed to fast-track a path to legal residency",
    "description": "Trinidadian-born rapper said she was gifted the card ‘free of charge’",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/nicki-minaj-trump-gold-card-b2910265.html",
    "timestamp": "2026-01-29T16:54:08Z"
  },
  {
    "title": "Trump’s NSA pick endorses post-9/11 surveillance powers, stays vague on warrants",
    "description": "By Raphael SatterWASHINGTON, Jan 29 (Reuters) - U.S. Army Lieutenant General Joshua Rudd, President Donald Trump’s pick to head the National Security Agency, said on Thur… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/trump-s-nsa-pick-endorses-post-9-11-surveillance-powers-stays-vague-on-warrants",
    "timestamp": "2026-01-29T16:53:25Z"
  },
  {
    "title": "Good Morning, News: Federal Agents Who Shot at Alex Pretti Placed on Leave, Sen. Klobuchar Runs for Governor, and More About the January 30 National General Strike",
    "description": "Absolutely no vagueposting allowed\n \n by Suzette Smith\n \n \n \n If you appreciate the Mercury's interesting and useful news & culture reporting, consider making a small monthly contribution to support our editorial team. Your donation is tax-deductible. You can…",
    "link": "https://www.portlandmercury.com/good-morning-news/2026/01/29/48281484/good-morning-news-federal-agents-who-shot-at-alex-pretti-placed-on-leave-sen-klobuchar-runs-for-governor-and-more-about-the-january-30-na",
    "timestamp": "2026-01-29T16:53:00Z"
  },
  {
    "title": "Pusha T Slams ICE on Red Carpet at Billboard Power 100: Video",
    "description": "Pusha T slammed ICE on the red carpet at the Billboard Power 100 in a moment captured on video.",
    "link": "http://www.billboard.com/music/rb-hip-hop/pusha-t-slams-ice-red-carpet-billboard-power-100-video-1236166529/",
    "timestamp": "2026-01-29T16:52:19Z"
  },
  {
    "title": "Blackstone Earnings Continue to Grow With $2.2B in Q4 2025",
    "description": "Despite geopolitical uncertainty, Blackstone saw strong growth in the fourth quarter of 2025 — and the entire year — recording earnings of $2.2 billion in the last three months of the year, according to its fourth-quarter earnings report released Thursday. Wh…",
    "link": "http://commercialobserver.com/2026/01/blackstone-earnings-q4-2025/",
    "timestamp": "2026-01-29T16:52:01Z"
  },
  {
    "title": "Banned to back again: A timeline of TikTok's rise, fall and rebirth",
    "description": "TikTok evolved from a teen dance app into a dominant US platform shaping culture, commerce and politics.",
    "link": "https://economictimes.indiatimes.com/tech/technology/banned-to-back-again-a-timeline-of-tiktoks-rise-fall-and-rebirth/articleshow/127781641.cms",
    "timestamp": "2026-01-29T16:49:18Z"
  },
  {
    "title": "Sheinbaum Says She and Trump Talked Trade, But Not Cuba, in Call",
    "description": "Mexican President Claudia Sheinbaum said she had a “cordial” conversation with Donald Trump on Thursday, discussing trade and security issues ahead of the review of the North American free trade deal.",
    "link": "https://financialpost.com/pmn/business-pmn/sheinbaum-says-she-and-trump-talked-trade-but-not-cuba-in-call",
    "timestamp": "2026-01-29T16:49:15Z"
  },
  {
    "title": "Joe Scarborough Tells Jimmy Kimmel About the Last Time He Called Trump | Video",
    "description": "\"What's been different this year is everybody's bowed down to him,\" the \"Morning Joe\" host explains\nThe post Joe Scarborough Tells Jimmy Kimmel About the Last Time He Called Trump | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/joe-scarborough-jimmy-kimmel-live-trump-phone-call-minneapolis/",
    "timestamp": "2026-01-29T16:49:03Z"
  },
  {
    "title": "Tech Lords Show Their True Colors: OpenAI's Sam Altman and Apple's Tim Cook Criticize ICE Enforcement Actions",
    "description": "OpenAI CEO Sam Altman and Apple CEO Tim Cook have joined a growing number of corporate executives expressing concern over immigration enforcement activities. Altman stated in an internal email that ICE is \"going too far\" while Cook expressed that he is \"heart…",
    "link": "https://www.breitbart.com/tech/2026/01/29/tech-lords-show-their-true-colors-openais-sam-altman-and-apples-tim-cook-criticize-ice-enforcement-actions/",
    "timestamp": "2026-01-29T16:47:45Z"
  },
  {
    "title": "Watch Live: Donald Trump Holds a Cabinet Meeting",
    "description": "President Donald Trump holds a meeting with members of his cabinet at the White House on Thursday, January 29.\nThe post Watch Live: Donald Trump Holds a Cabinet Meeting appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/29/watch-live-donald-trump-holds-a-cabinet-meeting-6/",
    "timestamp": "2026-01-29T16:41:50Z"
  },
  {
    "title": "Crypto bill clears U.S. Senate milestone as effort advanced through first committee",
    "description": "The market structure legislation for the first time advanced beyond a committee, setting up the next steps that could end with a vote of the overall chamber.",
    "link": "https://www.coindesk.com/policy/2026/01/29/crypto-bill-clears-u-s-senate-milestone-as-effort-advanced-through-first-committee",
    "timestamp": "2026-01-29T16:41:49Z"
  },
  {
    "title": "Trump eyes basing his new Board of Peace at a Washington building in legal limbo",
    "description": "The building formerly housed the U.S. Institute of Peace.",
    "link": "https://www.bostonherald.com/2026/01/29/trump-board-of-peace-building/",
    "timestamp": "2026-01-29T16:40:26Z"
  },
  {
    "title": "Trump’s Board of Peace: Foxes Manage the Chicken Coop",
    "description": "Trump's peace council represents a revolution from above. Trump rules like a king, mixing politics and private business. The whole world accepts this without complaint.\nThe post Trump’s Board of Peace: Foxes Manage the Chicken Coop appeared first on Global Re…",
    "link": "https://www.globalresearch.ca/trump-board-peace-foxes-manage-chicken-coop/5914060",
    "timestamp": "2026-01-29T16:38:50Z"
  },
  {
    "title": "Melania Trump’s documentary premieres at the Kennedy Center ahead of global release",
    "description": "The Trumps are expected to walk the red carpet at the premiere.",
    "link": "https://www.bostonherald.com/2026/01/29/melania-trump-documentary/",
    "timestamp": "2026-01-29T16:38:06Z"
  },
  {
    "title": "Traders placing record bets on dollar collapse – Bloomberg",
    "description": "Traders are betting big that the US dollar will keep falling, Bloomberg reports Read Full Article at RT.com",
    "link": "https://www.rt.com/business/631712-traders-bet-dollar-collapse/",
    "timestamp": "2026-01-29T16:37:29Z"
  },
  {
    "title": "Trump accused of piracy as pair 'abducted from Scotland in middle of the night'",
    "description": "A Scottish lawmaker railed against US President Donald Trump\r\n on Wednesday over the American military’s seizure of an oil\r\n tanker and detention of its two top officers earlier this month in waters between Iceland and Scotland.Ross Greer, a member of the Sco…",
    "link": "https://www.rawstory.com/trump-accused-of-piracy-as-pair-abducted-from-scotland-in-middle-of-the-night/",
    "timestamp": "2026-01-29T16:35:39Z"
  },
  {
    "title": "'We can do better': Trump's tsar promises 'safer' Minnesota operation",
    "description": "Tom Homan says he is working on a plan to pull federal agents out of Minnesota as part of a major shift in strategy in the controversial local immigration crackdown.",
    "link": "https://www.abc.net.au/news/2026-01-30/border-tsar-tom-homan-speaks-in-minneapolis-minnesota/106285350",
    "timestamp": "2026-01-29T16:35:35Z"
  },
  {
    "title": "Gold price plunges 5% after rallying to record highs; silver drops 8%",
    "description": "The price of gold tumbled more than five percent Thursday as traders reassessed the market after recent record highs for the precious metal seen as a safe-haven investment.  Silver plunged more than eight percent, while copper and nickel prices also fell.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-price-plunges-5-after-rallying-to-record-highs-silver-drops-8/articleshow/127781469.cms",
    "timestamp": "2026-01-29T16:35:23Z"
  },
  {
    "title": "Starmer and Xi call for deeper UK-China ties as Trump shakes up global relations",
    "description": "The disruption to global trade under Trump has made expanding trade imperative for many governments.",
    "link": "https://www.bostonherald.com/2026/01/29/china-britain-relations/",
    "timestamp": "2026-01-29T16:33:07Z"
  },
  {
    "title": "ANAL TRUMP Returns To Pay Tribute To Our Glorious, Brilliant American President",
    "description": "100% of all proceeds — both digital and physical — will be donated to the Immigrant Defense Project and the National Immigration Law Center.\nThe post ANAL TRUMP Returns To Pay Tribute To Our Glorious, Brilliant American President appeared first on Metal Injec…",
    "link": "https://metalinjection.net/av/full-album-stream/anal-trump-returns-to-pay-tribute-to-our-glorious-brilliant-american-president",
    "timestamp": "2026-01-29T16:32:43Z"
  },
  {
    "title": "The Donald Show: Is Trump pulling back at home and abroad – or no?",
    "description": "Larry Donnelly asks if we can take much more of Trump’s chaotic behaviour.",
    "link": "https://www.thejournal.ie/readme/trump-minnesota-iran-venezuela-6941093-Jan2026/",
    "timestamp": "2026-01-29T16:32:03Z"
  },
  {
    "title": "Iran seeks to avert US military attack with mediation talks",
    "description": "Turkey hosts Iran’s foreign minister as Trump’s threats mount and Tehran weighs compromises to avoid conflict",
    "link": "https://www.irishtimes.com/world/middle-east/2026/01/29/iran-seeks-to-avert-us-military-attack-with-mediation-talks/",
    "timestamp": "2026-01-29T16:31:29Z"
  },
  {
    "title": "New Video Shows Another Alex Pretti Incident With Feds",
    "description": "Alex Pretti was forcefully taken to the ground by federal immigration agents after kicking out the taillight of their vehicle during a Minneapolis protest 11 days before he was shot and killed by Border Patrol and Customs and Border Protection officers, video…",
    "link": "https://www.newser.com/story/382813/new-footage-shows-alex-pretti-in-previous-scuffle-with-agents.html",
    "timestamp": "2026-01-29T16:30:20Z"
  },
  {
    "title": "【1月30日】看軍聞學英語",
    "description": "■林國賓 原文： In a head-spinning series of social media posts on Wednesday, President Donald Trump demanded a $500 billion increase in annual defense spending but threatened to cut out some of the companies poised to profit the most from the boost. The apparently …",
    "link": "https://tw.news.yahoo.com/1%E6%9C%8830%E6%97%A5-%E7%9C%8B%E8%BB%8D%E8%81%9E%E5%AD%B8%E8%8B%B1%E8%AA%9E-163000560.html",
    "timestamp": "2026-01-29T16:30:00Z"
  },
  {
    "title": "Pete Buttigieg Nails 2 ‘Very Rare’ Signs That Trump Administration Is ‘On The Back Foot’",
    "description": "The former Transportation Secretary highlighted some “telling” reasons involving President Donald Trump and Vice President JD Vance.",
    "link": "https://www.huffpost.com/entry/pete-buttigieg-signs-trump-admin-on-the-back-foot_n_697b3fcae4b00b1deb8f7e31",
    "timestamp": "2026-01-29T16:29:49Z"
  },
  {
    "title": "Melania Trump documentary not being shown in South African cinemas",
    "description": "No reason has been given but the decision follows a huge fall-out between South Africa and the US.",
    "link": "https://www.bbc.co.uk/news/articles/c89q287qxelo",
    "timestamp": "2026-01-29T16:29:28Z"
  },
  {
    "title": "Who is Matt Mahan, the Democrat who wants to replace Calif. Governor Gavin Newsom",
    "description": "San Jose Mayor Matt Mahan, a 43-year-old Democrat with deep Silicon Valley roots, announced Thursday that he is entering the crowded race to replace Gavin Newsom as California governor.",
    "link": "https://nypost.com/2026/01/29/us-news/who-is-california-gubernatorial-candidate-matt-mahan/",
    "timestamp": "2026-01-29T16:29:24Z"
  },
  {
    "title": "Merz says Germany exploring shared nuclear umbrella with European allies",
    "description": "BERLIN, Jan 29 (Reuters) - European nations are ‌starting to discuss ideas around a shared nuclear umbrella to complement existing security ‌arrangements with the U.S., German Chancellor Friedrich Merz said, amid growing talk ‌in Germany of developing its own…",
    "link": "https://www.thestar.com.my/news/world/2026/01/30/merz-says-germany-exploring-shared-nuclear-umbrella-with-european-allies",
    "timestamp": "2026-01-29T16:29:00Z"
  },
  {
    "title": "Trump: Jerome 'Too Late' Powell Refuses to Cut Rates, Costing U.S. Hundreds of Billions in Interest",
    "description": "President Donald Trump on Thursday wrote that Federal Reserve Chairman Jerome Powell has refused to cut interest rates, which is hurting the American economy and costing the country hundreds of billions of dollars in interest expense.\nThe post Trump: Jerome ‘…",
    "link": "https://www.breitbart.com/politics/2026/01/29/trump-jerome-too-late-powell-refuses-to-cut-rates-costing-u-s-hundreds-of-billions-in-interest/",
    "timestamp": "2026-01-29T16:28:38Z"
  },
  {
    "title": "Trump’s Too Dumb to Know It, but Philip Glass’s Opera Is About Him",
    "description": "Donald Trump responded to Philip Glass’s withdrawal of his Lincoln symphony from the Kennedy Center the way he usually does when confronted by someone of real stature: with a sour-grapes, self-aggrandizing rant. The tirade was petty, frivolous, and quickly fo…",
    "link": "https://newrepublic.com/article/205873/philip-glass-trump-kennedy-center",
    "timestamp": "2026-01-29T16:28:20Z"
  },
  {
    "title": "‘Serious Breach of Trust’: Lawmakers Question Trump Spy Chief Lurking at FBI Raid On Georgia Election Office",
    "description": "Lawmakers are questioning why Donald Trump's director of National Intelligence was spotted lurking around Wednesday's FBI raid on a Georgia election office.\nThe post ‘Serious Breach of Trust’: Lawmakers Question Trump Spy Chief Lurking at FBI Raid On Georgia …",
    "link": "https://www.mediaite.com/media/news/serious-breach-of-trust-lawmakers-question-trump-spy-chief-lurking-at-fbi-raid-on-georgia-election-office/",
    "timestamp": "2026-01-29T16:28:19Z"
  },
  {
    "title": "American Airlines plans to resume US flights to Venezuela pending government approval",
    "description": "WASHINGTON, Jan 29 (Reuters) - American Airlines said Thursday the U.S. carrier plans to resume daily service to Venezuela pending government approval and subject to secu… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/american-airlines-plans-to-resume-us-flights-to-venezuela-pending-government-approval",
    "timestamp": "2026-01-29T16:27:56Z"
  },
  {
    "title": "David Brooks Joins The Atlantic After 22 Years at The New York Times",
    "description": "The full-time staff writer will also launch a video podcast with the magazine later this spring\nThe post David Brooks Joins The Atlantic After 22 Years at The New York Times appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/journalism/david-brooks-joins-the-atlantic-leaves-new-york-times/",
    "timestamp": "2026-01-29T16:27:40Z"
  },
  {
    "title": "Israeli army accepts Palestinian health ministry death toll of 71,000 dead in Gaza",
    "description": "Despite years of denials, Haaretz said the Israeli army had accepted the accuracy of the Gaza death count",
    "link": "https://www.middleeasteye.net/news/israeli-army-accepts-palestinian-health-ministry-death-toll-71000-dead-gaza",
    "timestamp": "2026-01-29T16:27:32Z"
  },
  {
    "title": "Trump says Putin agreed to not fire on Kyiv for a week during cold",
    "description": "WASHINGTON, Jan 29 (Reuters) - U.S. President Donald Trump said on Thursday that Russian President Vladimir Putin agreed to not fire on Kyiv for a week due to cold weathe… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/trump-says-putin-agreed-to-not-fire-on-kyiv-for-a-week-during-cold",
    "timestamp": "2026-01-29T16:24:40Z"
  },
  {
    "title": "Melania Trump Documentary Crew Ask For Their Names to Be Removed From Credits Following …",
    "description": "Reading Time: 3 minutesMore bad news for the Melania Trump documentary.\nMelania Trump Documentary Crew Ask For Their Names to Be Removed From Credits Following … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/01/melania-trump-documentary-crew-ask-for-their-names-to-be-removed-from-credits-following-chaotic-production/",
    "timestamp": "2026-01-29T16:23:43Z"
  },
  {
    "title": "Will killings by immigration agents cause another US government shutdown?",
    "description": "The death of Alex Pretti has prompted a shift among Democratic senators, who are willing to risk a shutdown for reforms.",
    "link": "https://www.aljazeera.com/news/2026/1/29/will-killings-by-immigration-agents-cause-another-us-government-shutdown",
    "timestamp": "2026-01-29T16:22:50Z"
  },
  {
    "title": "Minnesota cops beg Walz, pols to let them work with ICE, say they could have prevented shootings",
    "description": "MINNEAPOLIS — The head of a major Twin Cities police union slammed local officials for blocking cooperation between local cops and ICE and Border Patrol agents – saying if they had been involved, “there would be no loss of life.”It comes as Minnesota Gov. Tim…",
    "link": "https://freerepublic.com/focus/f-news/4364539/posts",
    "timestamp": "2026-01-29T16:21:56Z"
  },
  {
    "title": "Trade balance soared 94% in November and was higher than a year ago, despite tariff efforts",
    "description": "Following a month where the trade deficit hit its lowest level since early 2009, it shot up to $56.8 billion, an increase of 94.6% from October...On a year-over-year basis, the deficit through November stood at $839.5 billion, or about 4% higher than the same…",
    "link": "https://freerepublic.com/focus/f-news/4364537/posts",
    "timestamp": "2026-01-29T16:21:16Z"
  },
  {
    "title": "BTC USD crash today: Why is crypto down today? Bitcoin price slips as Fed holds rates and geopolitics heat up — here’s Bitcoin technical outlook",
    "description": "BTC USD crash today: Why is crypto down today? Bitcoin price slips as Fed holds rates and geopolitics heat up. Bitcoin slid sharply as data turned risk-off. BTC dropped over 5% to $84,623, breaking below the 50-day and 100-day EMAs. Market cap fell 1.7% to $3…",
    "link": "https://economictimes.indiatimes.com/news/international/us/btc-usd-crash-today-why-is-crypto-down-today-bitcoin-price-slips-as-fed-holds-rates-and-geopolitics-heat-up-heres-bitcoin-technical-outlook/articleshow/127780941.cms",
    "timestamp": "2026-01-29T16:21:03Z"
  },
  {
    "title": "Kennedy Center’s head of artistic programming steps down 2 weeks after taking the job",
    "description": "The exit comes as the Kennedy Center navigates a wave of artists canceling their performances.",
    "link": "https://www.bostonherald.com/2026/01/29/kennedy-center-head-of-artistic-programming/",
    "timestamp": "2026-01-29T16:19:13Z"
  },
  {
    "title": "Kennedy Center’s head of artistic programming steps down 2 weeks after taking the job",
    "description": "The exit comes as the Kennedy Center navigates a wave of artists canceling their performances.",
    "link": "https://www.denverpost.com/2026/01/29/kennedy-center-head-of-artistic-programming/",
    "timestamp": "2026-01-29T16:19:13Z"
  },
  {
    "title": "Lady Gaga Slams ICE, Shares Support for Minnesota During Show",
    "description": "Lady Gaga slammed ICE and shared her support for Minnesota at her Tokyo show, saying, \"Lives are being destroyed.\"",
    "link": "http://www.billboard.com/music/music-news/lady-gaga-slams-ice-support-minnesota-during-show-1236166457/",
    "timestamp": "2026-01-29T16:18:38Z"
  },
  {
    "title": "“I think we’re headed to some really ugly terrain”: Ice-T explains why he changed lyrics from Body Count’s Cop Killer to ‘ICE Killer’ last year, as government agency faces heightened backlash for 2026 killings",
    "description": "United States Immigration And Custom Enforcement agents have fatally shot two people on the streets of Minneapolis this month",
    "link": "https://www.loudersound.com/news/ice-t-explains-why-body-count-cop-killer-lyrics-changed-ice-killer-2026",
    "timestamp": "2026-01-29T16:17:57Z"
  },
  {
    "title": "Democrat Proves What Trump’s Been Saying All Along About Midterm Stakes",
    "description": "Democratic Rep. Bonnie Watson Coleman of New Jersey said Democrats would impeach President Donald Trump if they took the House of Representatives and Senate.",
    "link": "https://dailycaller.com/2026/01/29/democrat-proves-what-trumps-been-saying-all-along-about-midterm-stakes/",
    "timestamp": "2026-01-29T16:17:07Z"
  },
  {
    "title": "From Ghostbusters to Spider-Man: 3 iconic movies filmed in New York City",
    "description": "From Ghostbusters to Spider-Man: 3 iconic movies filmed in New York Cityhowtogeek.com",
    "link": "https://www.howtogeek.com/iconic-movies-filmed-in-new-york-city/",
    "timestamp": "2026-01-29T16:14:30Z"
  },
  {
    "title": "Trump Team Secretly Met With Group That Wants to Separate From Canada",
    "description": "Senior Trump administration officials have held meetings with the Alberta Prosperity Project, a fringe separatist group that seeks to split the province away from Canada. The Financial Times reports that State Department officials have met representatives fro…",
    "link": "https://newrepublic.com/post/205868/trump-team-secretly-met-canada-separatists-group",
    "timestamp": "2026-01-29T16:14:01Z"
  },
  {
    "title": "House Republicans propose stricter voting requirements as Trump administration eyes the midterms",
    "description": "House Republicans are proposing sweeping changes to the nation’s voting laws",
    "link": "https://abcnews.go.com/US/wireStory/house-republicans-propose-stricter-voting-requirements-trump-administration-129672021",
    "timestamp": "2026-01-29T16:14:00Z"
  },
  {
    "title": "US cybersecurity chief leaked sensitive government files to ChatGPT: Report",
    "description": "The acting head of the US government’s top cybersecurity agency reportedly uploaded sensitive government files into a public version of ChatGPT.",
    "link": "https://www.dexerto.com/entertainment/us-cybersecurity-chief-leaked-sensitive-government-files-to-chatgpt-report-3311462/",
    "timestamp": "2026-01-29T16:12:19Z"
  },
  {
    "title": "Low audience interest in the film about Melania Trump",
    "description": "The latest documentary film centered around Melania Trump, wife of American President Donald Trump, has faced extreme failure in Britain. Tim Richards, CEO of Vue Cinema, a major cinema chain in Britain, stated that there is no audience interest in this film,…",
    "link": "https://english.gossiplankanews.com/2026/01/low-audience-interest-in-film-about.html",
    "timestamp": "2026-01-29T16:10:22Z"
  },
  {
    "title": "Did the US ever ‘give back’ Greenland to Denmark, as Trump claims?",
    "description": "Donald Trump’s claim rests on a selective reading of wartime history.",
    "link": "https://theconversation.com/did-the-us-ever-give-back-greenland-to-denmark-as-trump-claims-274335",
    "timestamp": "2026-01-29T16:10:06Z"
  },
  {
    "title": "Minneapolis mayor to visit DC to push for end of 'unlawful ICE operations' after Trump's blunt warning",
    "description": "Minneapolis Mayor Jacob Frey, who has spoken out against U.S. Immigration and Customs Enforcement activity in Minnesota, is heading to Washington, D.C.",
    "link": "https://www.foxnews.com/politics/minneapolis-mayor-visit-dc-push-end-unlawful-ice-operations-trumps-blunt-warning",
    "timestamp": "2026-01-29T16:09:53Z"
  },
  {
    "title": "UN chief Guterres: global problems will not be solved by one power ‘calling the shots’",
    "description": "UNITED NATIONS, Jan 29 (Reuters) - Global problems will not be solved by one power “calling the shots,” United Nations Secretary-General Antonio Guterres said on Thursday… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/un-chief-guterres-global-problems-will-not-be-solved-by-one-power-calling-the-shots",
    "timestamp": "2026-01-29T16:09:20Z"
  },
  {
    "title": "Bannon warns Trump Dems are 'going on offense' with 'catchy' new Springsteen anti-ICE song",
    "description": "MAGA influencer Steve Bannon warned that Bruce Springsteen's new song protesting against President Donald Trump's immigration policies could embolden the resistance.In his song \"Streets of Minneapolis,\" released this week, Springsteen laments the deaths of Re…",
    "link": "https://www.rawstory.com/steve-bannon-bruce-springsteen/",
    "timestamp": "2026-01-29T16:08:24Z"
  },
  {
    "title": "Trump says U.S. to open Venezuela airspace after talk with acting president",
    "description": "WASHINGTON, Jan 29 (Reuters) - President Donald Trump said on Thursday that he planned on opening up Venezuela’s air space after a discussion on Thursday with the country… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/trump-says-u-s-to-open-venezuela-airspace-after-talk-with-acting-president",
    "timestamp": "2026-01-29T16:07:59Z"
  },
  {
    "title": "Fed Chair Powell sends frustrating message on future interest-rate cuts",
    "description": "Federal Reserve Chair Jerome Powell offered an upbeat report on the U.S. economy after the Fed’s first policymaking meeting of 2026. “Essentially, the...",
    "link": "https://www.thestreet.com/fed/fed-chair-powell-sends-frustrating-message-on-future-interest-rate-cuts",
    "timestamp": "2026-01-29T16:07:00Z"
  },
  {
    "title": "Bad Bunny's at the Super Bowl Halftime Show tops Kendrick Lamar and Rihanna even before it starts",
    "description": "Bad Bunny has already topped the likes of Kendrick Lamar and Rihanna at the Super Bowl - and he hasn&apos;t even taken the stage yet. Weeks before his scheduled halftime performanc",
    "link": "https://www.marca.com/en/nfl/2026/01/29/697b7b3de2704e4c0f8b45cc.html",
    "timestamp": "2026-01-29T16:06:14Z"
  },
  {
    "title": "When is the Senate vote today? Shutdown deadline nears as lawmakers clash over ICE funding",
    "description": "The Senate returns today, January 29, 2026, facing a potential government shutdown on January 31. Democrats are opposing Department of Homeland Security funding, demanding reforms to ICE and Border Patrol following the death of Alex Pretti. A Senate vote is p…",
    "link": "https://economictimes.indiatimes.com/news/international/us/when-is-the-senate-vote-today-shutdown-deadline-nears-as-lawmakers-clash-over-ice-funding/articleshow/127780241.cms",
    "timestamp": "2026-01-29T16:03:17Z"
  },
  {
    "title": "Dan McQuade Got Philly Like No One Else",
    "description": "Nobody understood Philadelphia, and Philadelphians, like Dan McQuade, who died yesterday at 43. I had the pleasure and indeed the honor of being Dan’s primary […]",
    "link": "https://www.phillymag.com/news/2026/01/29/dan-mcquade-died-obituary/",
    "timestamp": "2026-01-29T16:03:01Z"
  },
  {
    "title": "Mexico's Sheinbaum says she had productive call with Trump on trade",
    "description": "MEXICO CITY, Jan ‌29 (Reuters) - Mexican President Claudia Sheinbaum said ‌on Thursday she had a \"productive and cordial\" ‌conversation with her U.S. counterpart Donald Trump.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/30/mexico039s-sheinbaum-says-she-had-productive-call-with-trump-on-trade",
    "timestamp": "2026-01-29T16:02:00Z"
  },
  {
    "title": "Ukraine: Trump says Putin agreed not to hit Kyiv for 1 week",
    "description": "President Donald Trump told a Cabinet meeting that Russia's Vladimir Putin \"agreed\" not to strike the capital for a week with a harsh cold snap forecast. Russia routinely targets Ukraine's electricity supply. Follow DW.",
    "link": "https://www.dw.com/en/ukraine-trump-says-putin-agreed-not-to-hit-kyiv-for-1-week/live-75709229",
    "timestamp": "2026-01-29T16:01:00Z"
  },
  {
    "title": "District 49 repeals controversial policy separating bathrooms, locker rooms by biological sex",
    "description": "COLORADO SPRINGS, Colo. (KRDO) – Just four months after board members at School District 49 (D49) in Colorado Springs passed a policy requiring students",
    "link": "https://krdo.com/news/2026/01/29/district-49-repeals-controversial-policy-separating-bathrooms-locker-rooms-by-biological-sex/",
    "timestamp": "2026-01-29T16:00:50Z"
  },
  {
    "title": "Trump Denied Airspace For His “Beautiful Armada” By Key Allies",
    "description": "The United Arab Emirates and Saudi Arabia have denied United States President Donald Trump the airspace needed for his \"beautiful armada.\" Trump sent the ships toward Iran as a show of force, or as what many have said was the first step in an imminent attack.",
    "link": "https://www.shtfplan.com/member-exclusive/trump-denied-airspace-for-his-beautiful-armada-by-key-allies",
    "timestamp": "2026-01-29T16:00:36Z"
  },
  {
    "title": "Watch live: Trump holds Cabinet meeting at White House",
    "description": "President Donald Trump's Cabinet meeting comes as administration officials seek to de-escalate tensions over immigration enforcement activities in Minnesota.",
    "link": "https://www.cnbc.com/2026/01/29/watch-live-trump-cabinet-meeting-white-house.html",
    "timestamp": "2026-01-29T16:00:14Z"
  },
  {
    "title": "EU lists Revolutionary Guard as terrorist organization...",
    "description": "The European Union has listed Iran’s paramilitary Revolutionary Guard as a terrorist organization in the aftermath of Tehran’s bloody crackdown on nationwide protests. Kaja Kallas, the EU’s foreign policy chief, said Thursday that the bloc's foreign ministers…",
    "link": "https://apnews.com/article/european-union-iran-revolutionary-guard-terrorist-f7d9d64b1302cfc2d9311417b2dfeaf6",
    "timestamp": "2026-01-29T16:00:14Z"
  },
  {
    "title": "More than $360m is staked over US political or government actions on prediction markets",
    "description": "It is raising concerns about insider trading from officials in the know.",
    "link": "https://syndication.washingtonpost.com/nss/stories/7JZHXFGGPZHEJIKA2PEXT7RMGU",
    "timestamp": "2026-01-29T16:00:00Z"
  },
  {
    "title": "Minneapolis: Judge Orders ICE to Leave Lawful Immigrants Alone; Miller Pouts",
    "description": "A federal judge ordered the Trump administration to stop harassing and detaining immigrants who were in this country lawfully. Trump’s deputy policy director, Stephen Miller, was outraged by the decision. Jan Wolfe of Reuters reported: WASHINGTON, Jan 28 (Reu…",
    "link": "https://dianeravitch.net/2026/01/29/minneapolis-judge-orders-ice-to-leave-lawful-immigrants-alone-miller-pouts/",
    "timestamp": "2026-01-29T16:00:00Z"
  },
  {
    "title": "Willis moves early to brace voters for pre-election rate rises – Matthew Hooton",
    "description": "OPINION: Rising rates and flat house prices risk eroding support for Christopher Luxon.",
    "link": "https://www.nzherald.co.nz/business/economy/inflation/willis-moves-early-to-brace-voters-for-pre-election-rate-rises-matthew-hooton/premium/HBLA7LDURNGLBEHXPMN35S3XMQ/",
    "timestamp": "2026-01-29T16:00:00Z"
  },
  {
    "title": "Did Trump compare EU-India trade deal to 'high school science project'?",
    "description": "U.S. President Donald Trump compared the historic trade agreement reached between the European Union and India on Jan. 27, 2026, to a “high school science project.\"",
    "link": "https://www.snopes.com//fact-check/trump-india-eu-deal/",
    "timestamp": "2026-01-29T16:00:00Z"
  },
  {
    "title": "Nicki Minaj Granted CITIZENSHIP w. New Trump Gold Card … Is This Really LEGAL? (Analysis)",
    "description": "The post Nicki Minaj Granted CITIZENSHIP w. New Trump Gold Card … Is This Really LEGAL? (Analysis) appeared first on Media Take Out.",
    "link": "https://www.cheatsheet.com/news/nicki-minajs-free-of-charge-citizenship-claims-raise-questions-where-was-she-born.html/#article",
    "timestamp": "2026-01-29T15:58:14Z"
  },
  {
    "title": "B.C. premier says Alberta separatists seeking assistance from U.S. is 'treason'",
    "description": "British Columbia Premier David Eby says Alberta separatists meeting with the Donald Trump's administration for financial backing is an act of “treason\" and an issue he'll raise as the premiers gather with the prime minister in Ottawa today.",
    "link": "https://www.cbc.ca/news/politics/eby-alberta-separatism-9.7066320",
    "timestamp": "2026-01-29T15:57:55Z"
  },
  {
    "title": "WATCH LIVE: Trump holds Cabinet meeting as government shutdown deadline looms",
    "description": "President Donald Trump is holding a Cabinet meeting Thursday, his first of the new year.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-holds-cabinet-meeting-as-government-shutdown-deadline-looms",
    "timestamp": "2026-01-29T15:57:52Z"
  },
  {
    "title": "Trump’s Aspirin Use and Doctors’ Recommendations",
    "description": "President Donald Trump has said on multiple occasions in recent months that he takes a “large” dose of aspirin to prevent cardiovascular disease. His comments could perpetuate a common misperception, so we wanted to clarify the current science and what the re…",
    "link": "https://www.factcheck.org/2026/01/trumps-aspirin-use-and-doctors-recommendations/",
    "timestamp": "2026-01-29T15:57:33Z"
  },
  {
    "title": "Nick Minaj Gloats About Trump Gold Card, Impending Citizenship",
    "description": "Reading Time: 3 minutesFollowing her recent fawning displays, Nicki Minaj has gotten her reward -- a Trump Gold Card.\nNick Minaj Gloats About Trump Gold Card, Impending Citizenship was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/01/nicki-minaj-trump-gold-card/",
    "timestamp": "2026-01-29T15:57:31Z"
  },
  {
    "title": "'Beginning of the Chaos': FBI Raid in Georgia Seen as Ominous Sign of Trump Plans for 2026 Midterms",
    "description": "The FBI's Wednesday raid on an elections center in Fulton County, Georgia is raising alarms about President Donald Trump's plans to disrupt the 2026 midterm elections.Shortly after FBI agents executed a search warrant at the Fulton County Election Hub and Ope…",
    "link": "https://www.commondreams.org/news/trump-fbi-fulton-county",
    "timestamp": "2026-01-29T15:56:33Z"
  },
  {
    "title": "FBI executes search warrant at Fulton County election facility",
    "description": "FBI agents executed a court-authorized search warrant on Wednesday at a Fulton County, Georgia, election facility, investigating a state that was at the center of voter fraud complaints and election litigation following the 2020 presidential election. Agents …",
    "link": "https://freerepublic.com/focus/f-news/4364528/posts",
    "timestamp": "2026-01-29T15:54:50Z"
  },
  {
    "title": "Operating profits at Trump’s Doonbeg golf course rise 9% to €2.23m",
    "description": "Revenue at resort increases to €17.3m",
    "link": "https://www.irishtimes.com/business/2026/01/29/operating-profits-at-trumps-doonbeg-golf-course-rise-9-to-223m/",
    "timestamp": "2026-01-29T15:54:22Z"
  },
  {
    "title": "LIVE: Senate Agriculture Committee debates crypto market structure bill",
    "description": "The Senate Agriculture Committee is holding a markup hearing on crypto market structure legislation.",
    "link": "https://www.coindesk.com/policy/2026/01/29/live-crypto-bill-reaches-u-s-senate-milestone-as-lawmakers-mull-changes-on-way-to-vote",
    "timestamp": "2026-01-29T15:53:07Z"
  },
  {
    "title": "EU lists Iran's Revolutionary Guard as 'terrorist organization'",
    "description": "The European Union has listed Iran's Revolutionary Guard Corps (IRGC) as a \"terrorist organization\" in the aftermath of Tehran’s crackdown on nationwide protests, the bloc’s top diplomat said in a post on X on Thursday.",
    "link": "https://www.hurriyetdailynews.com/eu-lists-irans-paramilitary-revolutionary-guard-as-terrorist-organization-218384",
    "timestamp": "2026-01-29T15:53:00Z"
  },
  {
    "title": "Denmark lauds constructive talks with U.S. over Greenland: ‘Now we are back on track’ - CNBC",
    "description": "Denmark lauds constructive talks with U.S. over Greenland: ‘Now we are back on track’CNBC The Woman Who Stands Between Donald Trump and GreenlandThe New York Times Greenland minister: Trump push to acquire bases as sovereign US territory a ‘red line’The Hill …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180686962",
    "timestamp": "2026-01-29T15:52:56Z"
  },
  {
    "title": "Trump’s Trade Barbs Won’t Push EU Closer to China, Hoekstra Says",
    "description": "The European Union must resist China’s pull in clean technologies, even as it confronts the reality that deteriorating relations with the US may be “permanent,” according to the bloc’s climate chief.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-trade-barbs-wont-push-eu-closer-to-china-hoekstra-says",
    "timestamp": "2026-01-29T15:52:49Z"
  },
  {
    "title": "Brent Crude Hits $71 A Barrel As Trump Ramps Up Iran Threats",
    "description": "The commodity rallied even higher after the Associated Press reported that Iran issued a warning to ships at sea that it planned to run a drill next week that would include live firing in the Strait of Hormuz, citing two Pakistani security officials and the E…",
    "link": "https://www.ndtvprofit.com/markets/brent-crude-hits-71-a-barrel-as-trump-ramps-up-iran-threats-10909231",
    "timestamp": "2026-01-29T15:50:33Z"
  },
  {
    "title": "Iran responds to Trump pressure with warning of retaliation: 'Fingers on the trigger'",
    "description": "President Donald Trump warned Iran \"time is running out\" on a nuclear deal, and Iran's foreign minister threatened retaliation against \"aggression.\"",
    "link": "https://www.foxnews.com/world/iran-responds-trump-pressure-warning-retaliation-fingers-trigger",
    "timestamp": "2026-01-29T15:50:19Z"
  },
  {
    "title": "Trump eyes basing his new Board of Peace at a Washington building in legal limbo",
    "description": "The Trump administration is looking at basing the new Board of Peace in the Washington building that formerly housed the U.S. Institute of Peace",
    "link": "https://abcnews.go.com/US/wireStory/trump-eyes-basing-new-board-peace-washington-building-129670667",
    "timestamp": "2026-01-29T15:49:48Z"
  },
  {
    "title": "Biden chiefs of staff told Joe Scarborough 'be nice to the president,' MS NOW host says",
    "description": "Joe Scarborough revealed Wednesday that former President Joe Biden's staffers told him to \"be nice\" when covering the then-president, saying criticism would \"screw up our day.\"",
    "link": "https://www.foxnews.com/media/biden-chiefs-staff-told-joe-scarborough-be-nice-president-ms-now-host-says",
    "timestamp": "2026-01-29T15:48:58Z"
  },
  {
    "title": "Rep. Ilhan Omar Issues Biting Response After Trump Implies She Faked Town Hall Attack. See What She Recommended",
    "description": "Ilhan Omar had a very direct response to Donald Trump and a recommendation about how to proceed after the president’s callous reaction to an attack on her that occurred while she hosted a town hall. The 43-year-old Democrat was sprayed with an unknown substan…",
    "link": "https://www.justjared.com/2026/01/29/rep-ilhan-omar-responds-to-trump-saying-she-faked-town-hall-attack-calls-for-25th-amendment/",
    "timestamp": "2026-01-29T15:48:32Z"
  },
  {
    "title": "Ten US Navy Ships Located in Middle East Right Now - Reports",
    "description": "WASHINGTON (Sputnik) - Ten US Navy ships are currently in the Middle East, media reported on Thursday, citing a defense official.",
    "link": "https://sputnikglobe.com/20260129/ten-us-navy-ships-located-in-middle-east-right-now---reports-1123548755.html",
    "timestamp": "2026-01-29T15:48:23Z"
  }
]