[
  {
    "title": "Franklin Templeton seeks SEC approval to launch new crypto index ETF",
    "description": "Franklin Templeton Investments is seeking regulatory approval to launch a new crypto index exchange-traded fund, the firm said on Thursday, as asset managers hope to cash in on the crypto wave amid Donald Trump's victory in U.S. presidential elections.\nTrump …",
    "link": "https://biztoc.com/x/7898896e87516be4",
    "timestamp": "2025-02-06T22:43:21Z"
  },
  {
    "title": "Harvard Law library is saving data that the Trump administration is removing",
    "description": "The Harvard Law School Library says it is releasing an archive of more than 300,000 government data sets, aiming to protect vital public information at a time when President Donald Trump’s administration is wiping it from the web.\nThe initiative, announced Th…",
    "link": "https://biztoc.com/x/15e7f6dc9d39708f",
    "timestamp": "2025-02-06T22:43:14Z"
  },
  {
    "title": "Trump's Tariffs Require Customs Agents To Check All Mail from China",
    "description": "President Donald Trump announced his promised tariffs on Saturday and paused those levied against Mexico and Canada on Monday for 30 days. In addition to threatening to impose double-digit duties on all products imported from Canada, Mexico, and China (whose …",
    "link": "https://biztoc.com/x/5a8e3228981606b2",
    "timestamp": "2025-02-06T22:43:13Z"
  },
  {
    "title": "Trump signs order sanctioning ICC",
    "description": "United States President Donald Trump has signed an executive order imposing sanctions on the International Criminal Court (ICC) due to the court having engaged in \"illegitimate and baseless actio...",
    "link": "https://biztoc.com/x/2acfeea43587509d",
    "timestamp": "2025-02-06T22:43:04Z"
  },
  {
    "title": "What Would Happen if Donald Trump Is Impeached Again?",
    "description": "Texas congressman Al Green has filed articles of impeachment against President Donald Trump. Here's what happens if they stick.",
    "link": "https://biztoc.com/x/679f159fe6e28b44",
    "timestamp": "2025-02-06T22:42:57Z"
  },
  {
    "title": "Trump imposes sanctions on International Criminal Court",
    "description": "Donald Trump said the ICC abused its power by issuing \"baseless arrest warrants\" targeting Netanyahu and former Defense Minister Yoav Gallant.",
    "link": "https://www.jpost.com/breaking-news/article-841072",
    "timestamp": "2025-02-06T22:42:15Z"
  },
  {
    "title": "Even Some Republicans Are A Little Worried About DOGE",
    "description": "Two key senators said this week Elon Musk’s crusade against the federal bureaucracy has gone too far.",
    "link": "https://www.huffpost.com/entry/elon-musk-doge-congress_n_67a5336be4b02fdb05766ee2",
    "timestamp": "2025-02-06T22:41:14Z"
  },
  {
    "title": "Breitbart News Dominates on Facebook, Besting Establishment Media in Trump's First Two Weeks",
    "description": "Breitbart News dominated the establishment media on Facebook in the first two weeks of President Donald Trump's second term, according to data from the analytics giant NewsWhip.\nThe post Breitbart News Dominates on Facebook, Besting Establishment Media in Tru…",
    "link": "https://www.breitbart.com/politics/2025/02/06/breitbart-news-dominates-facebook-besting-establishment-media-trumps-first-two-weeks/",
    "timestamp": "2025-02-06T22:41:14Z"
  },
  {
    "title": "Donald Trump Faces First Articles Of Impeachment In Second Term - NewsBreak",
    "description": "Donald Trump has been hit with the first threat of impeachment during his contentious second term . C-Span reports that Texas representative Al Green has",
    "link": "https://www.newsbreak.com/share/3792721399540-donald-trump-faces-first-articles-of-impeachment-in-second-term?_f=app_share&amp;pd=0KjZjUL0&amp;lang=en_US&amp;send_time=1738881564&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.4.0.27%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v4&amp;s=i2",
    "timestamp": "2025-02-06T22:40:12Z"
  },
  {
    "title": "Trump's battle for America's attention: From the Politics Desk",
    "description": "President Donald Trump is looking to reshape the GOP’s relationship with the tech industry amid his battle for Americans’ attention.",
    "link": "https://www.nbcnews.com/politics/trumps-battle-americas-attention-politics-desk-rcna191103",
    "timestamp": "2025-02-06T22:39:08Z"
  },
  {
    "title": "Trump, Again, Complaining About China While Dismantling American ‘Soft Power’",
    "description": "In 2017, it was withdrawing from the Trans-Pacific Partnership. Today, it’s gutting America’s main foreign aid agency.",
    "link": "https://www.huffpost.com/entry/trump-musk-usaid-soft-power_n_67a52ef7e4b0d1a51c630d52",
    "timestamp": "2025-02-06T22:38:47Z"
  },
  {
    "title": "Trump Sanctions on ICC Decried as 'Lawless Israel First' Policy",
    "description": "Amid global outrage over U.S. President Donald Trump's plan to take over the war-torn Gaza Strip, the Republican also faced criticism on Thursday for his executive order sanctioning the International Criminal Court.\n\n\"Bullying the International Criminal Court…",
    "link": "https://www.commondreams.org/news/trump-icc",
    "timestamp": "2025-02-06T22:38:37Z"
  },
  {
    "title": "House lawmakers push to ban AI app DeepSeek from US government devices",
    "description": "It's similar to the policy already in place for the popular social media platform TikTok.",
    "link": "https://www.bostonglobe.com/2025/02/06/business/house-lawmakers-ban-ai-deepseek-us-government-devices/",
    "timestamp": "2025-02-06T22:38:26Z"
  },
  {
    "title": "Pelosi: Trump Not Sophisticated Enough to Understand What Is Happening",
    "description": "On Thursday on MSNBC's \"Andrea Mitchell Reports,\" Rep. Nancy Pelosi (D-CA) said President Donald Trump is not sophisticated enough in terms of the intelligence community to understand what is happening when they comply with his executive orders.\nThe post Pelo…",
    "link": "https://www.breitbart.com/clips/2025/02/06/pelosi-trump-not-sophisticated-enough-to-understand-what-is-happening/",
    "timestamp": "2025-02-06T22:37:48Z"
  },
  {
    "title": "U.S. CISA adds Microsoft Outlook, Sophos XG Firewall, and other flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Microsoft Outlook, Sophos XG Firewall, and other flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the following vulne…",
    "link": "https://securityaffairs.com/173949/hacking/u-s-cisa-adds-microsoft-outlook-sophos-xg-firewall-and-other-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-02-06T22:36:30Z"
  },
  {
    "title": "NCAA changes transgender participation policy in response to executive order",
    "description": "The NCAA's Board of Governors voted to update the association's participation policy on transgender student-athletes after a Trump executive order.",
    "link": "https://abcnews.go.com/US/ncaa-transgender-participation-policy-response-executive-order/story?id=118543215",
    "timestamp": "2025-02-06T22:35:55Z"
  },
  {
    "title": "Traders See Profits Evaporate in Minutes as Trump Convulses Bets",
    "description": "The early days of Donald Trump’s trade war have been marked by a flurry of advances and retreats, forcing traders to adapt by increasingly making bets that are more conservative than usual or easily reversed.",
    "link": "https://financialpost.com/pmn/business-pmn/traders-see-profits-evaporate-in-minutes-as-trump-convulses-bets",
    "timestamp": "2025-02-06T22:35:27Z"
  },
  {
    "title": "Democrats’ Superlawyer Elias Leads Litigation Fighting Trump’s Buyout of Feds",
    "description": "An organization run by veteran Democratic election lawyer Marc Elias is representing federal unions in a lawsuit aimed at stopping the Trump administration’s buyout of... Read More\nThe post Democrats’ Superlawyer Elias Leads Litigation Fighting Trump’s Buyout…",
    "link": "https://www.dailysignal.com/2025/02/06/democrats-superlawyer-elias-leads-litigation-fighting-trumps-buyout-feds/",
    "timestamp": "2025-02-06T22:34:51Z"
  },
  {
    "title": "Bondi's First Acts as AG Curb Enforcement of Foreign Lobbying and Corporate Misconduct Laws",
    "description": "On her first day in office Wednesday, U.S. Attorney General Pam Bondi—a former lobbyist for foreign governments and wealthy special interests that have come under scrutiny by the Department of Justice she now leads—dissolved teams tasked with investigating fo…",
    "link": "https://www.commondreams.org/news/pam-bondi-day-one",
    "timestamp": "2025-02-06T22:33:23Z"
  },
  {
    "title": "What Would Happen if Donald Trump Is Impeached Again?",
    "description": "Texas congressman Al Green has filed articles of impeachment against President Donald Trump. Here's what happens if they stick.",
    "link": "https://www.newsweek.com/donald-trump-articles-impeachment-hypothetic-what-happens-next-2027554",
    "timestamp": "2025-02-06T22:32:18Z"
  },
  {
    "title": "Pelosi Reacts to Jill Biden Calling Her Disappointing",
    "description": "Thursday on MSNBC's \"Andrea Mitchell Reports,\" the host asked Rep. Nancy Pelosi (D-CA) about former first lady Jill Biden’s disappointment with her.\nThe post Pelosi Reacts to Jill Biden Calling Her Disappointing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/02/06/pelosi-reacts-to-jill-biden-calling-her-disappointing/",
    "timestamp": "2025-02-06T22:32:11Z"
  },
  {
    "title": "Some evangelical leaders challenge Trump's immigration, foreign aid policies amid calls for unity",
    "description": "While the president has had broad support among evangelicals, one pastor was trying \"to seek clarity,\" taking issue with policies targeting missionary aid and non-violent immigrants.",
    "link": "https://www.nbcnews.com/news/latino/evangelical-leaders-challenge-trumps-immigration-foreign-aid-policies-rcna190984",
    "timestamp": "2025-02-06T22:32:05Z"
  },
  {
    "title": "Yes, GOP congressman introduced a bill that would allow Trump to serve a third term",
    "description": "In January 2025, a GOP Congressmen introduced a bill that would allow U.S President Donald Trump — but not former presidents Obama, Biden, or Bush — to run for a third presidential term.",
    "link": "https://www.snopes.com//fact-check/bill-to-let-donald-trump-serve-third-term/",
    "timestamp": "2025-02-06T22:32:00Z"
  },
  {
    "title": "US judge blocks Trump offer for government workers until at least Monday",
    "description": "A U.S. judge on Thursday temporarily blocked the Trump administration's proposed incentive for federal workers until at least Monday, giving an initial win to labor unions that sued to stop it. \n\n\nThe ruling by U.S. District Judge George O'Toole in Boston pus…",
    "link": "https://www.voanews.com/a/us-judge-blocks-trump-offer-for-government-workers-until-at-least-monday/7965807.html",
    "timestamp": "2025-02-06T22:30:36Z"
  },
  {
    "title": "Politico forced to smack down Trump's 'flat-out false' conspiracy theory about them",
    "description": "Political news site Politico was compelled to release a statement on Thursday debunking a new conspiracy theory against them that has circulated with a boost from President Donald Trump.Amid widespread reporting and criticism of the Trump administration's eff…",
    "link": "https://www.rawstory.com/politico-trump/",
    "timestamp": "2025-02-06T22:30:24Z"
  },
  {
    "title": "Trump sanctions ICC",
    "description": "Washington has sanctioned the Hague-based court for its arrest warrants against Israeli political leaders Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612307-icc-trump-sanction-israel/",
    "timestamp": "2025-02-06T22:30:23Z"
  },
  {
    "title": "Elon Musk's Assault on the Government Has Canceled a Human Trial for a Promising HIV Vaccine",
    "description": "Billionaire Elon Musk's plundering of the US Agency for International Development (USAID) is already proving devastating for ongoing, life-saving research. As Science reports, researchers across eight African countries were set to launch a phase 1 clinical tr…",
    "link": "https://futurism.com/neoscope/usaid-trial-hiv-vaccine",
    "timestamp": "2025-02-06T22:30:21Z"
  },
  {
    "title": "4 takeaways from Rubio’s first trip abroad as secretary of state",
    "description": "The five-nation tour to Central America — a destination Rubio deliberately chose for his maiden voyage as President Donald Trump’s top diplomat — was overshadowed by a massive Washington-centered upheaval in U.S. foreign policy.",
    "link": "https://www.pbs.org/newshour/world/4-takeaways-from-rubios-first-trip-abroad-as-secretary-of-state",
    "timestamp": "2025-02-06T22:30:17Z"
  },
  {
    "title": "But Her Emails Redux: Team Trump Makes CIA Send List Of All Recently Hired Employees Over Unclassified Email (Mike Masnick/Techdirt)",
    "description": "Mike Masnick / Techdirt:\nBut Her Emails Redux: Team Trump Makes CIA Send List Of All Recently Hired Employees Over Unclassified Email  —  from the everything-is-just-so-stupid- now dept  —  Remember when Donald Trump and the MAGA universe wanted to “lock her …",
    "link": "https://www.memeorandum.com/250206/p125",
    "timestamp": "2025-02-06T22:30:00Z"
  },
  {
    "title": "Trump Selects Proud Boy Who Called Jan. 6 Rioters ‘Political Prisoners’ To Lead Counterterrorism Office - NewsBreak",
    "description": "Trump selected Joe Kent to serve as director of the National Counterterrorism Center despite him calling Jan. 6 rioters \"political prisoners.",
    "link": "https://www.newsbreak.com/share/3794271285705-trump-selects-proud-boy-who-called-jan-6-rioters-political-prisoners-to-lead-counterterrorism-office?_f=app_share&pd=09AdSN0H&lang=en_US&send_time=1738880928&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.4.0.27%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v2%2Cns_foryou_blend_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_model_exp_25q1-control&s=i2",
    "timestamp": "2025-02-06T22:29:47Z"
  },
  {
    "title": "Trump administration to keep only 294 USAID staff out of over 10,000 globally, sources say",
    "description": "President Donald Trump's administration plans to keep fewer than 300 staff at the U.S. Agency for International Development out of the agency's worldwide total of more than 10,000, four sources told Reuters on Thursday.",
    "link": "https://freerepublic.com/focus/f-news/4295576/posts",
    "timestamp": "2025-02-06T22:28:54Z"
  },
  {
    "title": "Trump's Tariffs Require Customs Agents To Check All Mail from China",
    "description": "President Donald Trump announced his promised tariffs on Saturday and paused those levied against Mexico and Canada on Monday for 30 days. In addition to",
    "link": "https://reason.com/2025/02/06/trumps-tariffs-require-customs-agents-to-check-all-mail-from-china/",
    "timestamp": "2025-02-06T22:28:51Z"
  },
  {
    "title": "Top political handicapper reveals prediction for 'volatile' 2026 battle for House majority",
    "description": "The fight for control of the House of Representatives in the 2026 midterm elections will be fought on a limited battlefield, a leading nonpartisan political handicapper predicts.",
    "link": "https://www.foxnews.com/politics/top-political-handicapper-reveals-prediction-volatile-2026-battle-house-majority",
    "timestamp": "2025-02-06T22:28:38Z"
  },
  {
    "title": "Donald Trump receives death threats not from other countries or criminal groups, but for banning transgender athletes",
    "description": "President Donald Trump has sparked heated controversy and online backlash after signing an executive order banning transgender women from competing in female sports. The decision,",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/02/06/67a52e38e2704e61a58b456c.html",
    "timestamp": "2025-02-06T22:26:55Z"
  },
  {
    "title": "Sanctuary State Governor and Mayor Slam DoJ's Lawsuit",
    "description": "The DOJ filed a lawsuit against left-wing Illinois Gov JB Pritzker and self-professed \"progressive\" Mayor Brandon Johnson over ICE obstruction\nThe post Sanctuary State Governor and Mayor Slam DoJ’s Lawsuit appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/02/06/sanctuary-state-governor-and-mayor-slam-dojs-lawsuit/",
    "timestamp": "2025-02-06T22:26:41Z"
  },
  {
    "title": "WWE Star Seth Rollins Says He Was ‘Happy’ to see Hulk Hogan Getting Booed on Raw: ‘People Get What They Deserve’",
    "description": "WWE star Seth Rollins was fully supportive of Hulk Hogan getting heavily booed during a recent taping of Monday Night Raw.\nThe post WWE Star Seth Rollins Says He Was ‘Happy’ to see Hulk Hogan Getting Booed on Raw: ‘People Get What They Deserve’ first appeared…",
    "link": "https://www.mediaite.com/sports/wwe-star-seth-rollins-says-he-was-happy-to-see-hulk-hogan-getting-booed-on-raw-people-get-what-they-deserve/",
    "timestamp": "2025-02-06T22:26:33Z"
  },
  {
    "title": "House Democrats launch bill to block Musk accessing personal and financial data",
    "description": "Senate Democrats announced a bill that would curb Elon Musk from accessing Americans' personal data, but they'll need Republican help to pass it.",
    "link": "https://abcnews.go.com/Politics/house-democrats-launch-bill-block-musk-accessing-personal/story?id=118539345",
    "timestamp": "2025-02-06T22:26:10Z"
  },
  {
    "title": "DOGE was tasked with stopping Treasury payments to USAID, AP sources say",
    "description": "Officials working with Elon Musk’s Department of Government Efficiency sought access to the Treasury Department payment system to stop money from flowing to the U.S. Agency for International Development. That's according to two people familiar with the matter…",
    "link": "https://www.seattlepi.com/news/politics/article/doge-was-tasked-with-stopping-treasury-payments-20152192.php",
    "timestamp": "2025-02-06T22:25:42Z"
  },
  {
    "title": "Unemployment in D.C. Nearly Doubles as Trump Aims to Shrink US Government",
    "description": "Trump signed an executive order mandating an immediate hiring freeze on the federal government.",
    "link": "https://www.newsweek.com/unemployment-washington-dc-doubles-trump-guts-federal-government-2027547",
    "timestamp": "2025-02-06T22:25:33Z"
  },
  {
    "title": "Compelled to take ‘dunki’ route to US for better life prospects, three UP men sent back to India",
    "description": "MUZAFFARNAGAR/PILIBHIT, Feb 6: Three men from Uttar Pradesh were compelled to take the treacherous “dunki” route to illegally enter the US in search of a better life for themselves and their families back home. On Wednesday, the trio arrived in Amritsar in a …",
    "link": "https://thehillstimes.in/national/compelled-to-take-dunki-route-to-us-for-better-life-prospects-three-up-men-sent-back-to-india",
    "timestamp": "2025-02-06T22:25:00Z"
  },
  {
    "title": "Trump dials back key part of Gaza takeover idea amid questions, criticism: ANALYSIS",
    "description": "Trump is continuing to outline his vision for U.S. control of Gaza, though is dialing back after widespread rebuke that his first plan would violate international law.",
    "link": "https://abcnews.go.com/Politics/trump-dials-back-key-part-gaza-takeover-idea/story?id=118534245",
    "timestamp": "2025-02-06T22:22:34Z"
  },
  {
    "title": "Trump Issues Sanctions on Iran, Threatens to “Obliterate” It if He’s Killed",
    "description": "Trump has signed an executive order to exert pressure on Iran while also trying to obtain a nuclear deal.",
    "link": "https://truthout.org/articles/trump-issues-sanctions-on-iran-threatens-to-obliterate-it-if-hes-killed/",
    "timestamp": "2025-02-06T22:22:34Z"
  },
  {
    "title": "Franklin Templeton seeks SEC approval to launch new crypto index ETF",
    "description": "Franklin Templeton Investments is seeking regulatory approval to launch a new crypto index exchange-traded fund, the firm said on Thursday, as asset managers hope to cash in on the crypto wave amid Donald Trump's victory in U.S. presidential elections.Trump e…",
    "link": "https://www.channelnewsasia.com/business/franklin-templeton-seeks-sec-approval-launch-new-crypto-index-etf-4922901",
    "timestamp": "2025-02-06T22:22:02Z"
  },
  {
    "title": "Trump Establishes Task Force to End Biden’s ‘Egregious’ Weaponization of Government Against Christians",
    "description": "President Donald J. Trump signed an executive order Thursday establishing a task force to end the anti-Christian weaponization of government. “The mission of this task... Read More\nThe post Trump Establishes Task Force to End Biden’s ‘Egregious’ Weaponization…",
    "link": "https://www.dailysignal.com/2025/02/06/trump-establish-task-force-end-bidens-egregious-weaponization-government-christians/",
    "timestamp": "2025-02-06T22:21:43Z"
  },
  {
    "title": "Trump signs order sanctioning International Criminal Court",
    "description": "The order accuses the Hague-based body of creating a \"shameful moral equivalency\" between Hamas and Israel, the White House says.",
    "link": "https://www.bbc.com/news/articles/cx2p19l24g2o",
    "timestamp": "2025-02-06T22:21:29Z"
  },
  {
    "title": "Trump ready to double down on Russian sanctions, US envoy to Ukraine Keith Kellogg says",
    "description": "\"You could really increase the sanctions — especially the latest sanctions [targeting oil production and exports,]\" retired Gen. Keith Kellogg exclusively told The Post.",
    "link": "https://nypost.com/2025/02/06/world-news/trump-ready-to-double-down-on-russian-sanctions-us-ukraine-envoy-keith-kellogg/",
    "timestamp": "2025-02-06T22:21:09Z"
  },
  {
    "title": "Johnson aims to announce GOP agenda framework on Friday, including permanent tax cuts",
    "description": "Speaker Mike Johnson said House Republicans are aiming to announce an overarching framework on their party-line agenda on Friday morning. It would include a permanent extension of the 2017 tax cuts, according to two people who were in a meeting between House …",
    "link": "https://biztoc.com/x/0dc45cae2bb375a8",
    "timestamp": "2025-02-06T22:20:57Z"
  },
  {
    "title": "Ex-USAID director confirms 'culture of corruption' within agency",
    "description": "Mark Moyar, a former director of the United States Agency for International Development, declared that the government agency has a \"culture of corruption\" that needs to be rooted out.During a Wednesday interview with Fox News' Jesse Watters, Moyar described h…",
    "link": "https://www.theblaze.com/news/ex-usaid-director-confirms-culture-of-corruption-within-agency",
    "timestamp": "2025-02-06T22:20:41Z"
  },
  {
    "title": "H-1B Yearly Lottery Announced Amid Fears of Cuts to Visa Program",
    "description": "The visa program, used mainly by big tech companies, was heavily debated by the GOP during the holidays.",
    "link": "https://www.newsweek.com/h1b-visa-lottery-opening-date-announced-uscis-donald-trump-2027569",
    "timestamp": "2025-02-06T22:19:46Z"
  },
  {
    "title": "A setback for Elon Musk’s plan to gut the federal workforce",
    "description": "The Logoff is a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff. Today’s edition is about a court order pushing back Elon Musk’s deadline fo…",
    "link": "https://www.vox.com/politics/398764/elon-musk-plan-gut-federal-workforce-the-logoff",
    "timestamp": "2025-02-06T22:19:19Z"
  },
  {
    "title": "With 'Clean Slate,' Laverne Cox adds a new title to her résumé: star and co-creator of her own show",
    "description": "Laverne Cox's new Prime Video comedy series, \"Clean Slate,\" is loosely inspired by her own Alabama upbringing.",
    "link": "https://www.nbcnews.com/nbc-out/out-pop-culture/clean-slate-laverne-cox-prime-video-transgender-rcna191076",
    "timestamp": "2025-02-06T22:19:18Z"
  },
  {
    "title": "Trump’s Housing Sec To Scrap Obama-Era Rule Allowing Men In Women’s Shelters",
    "description": "The agency said Thursday it is reversing a policy that requires domestic violence shelters and other facilities to accept men in women's spaces.",
    "link": "https://dailycaller.com/2025/02/06/trump-hud-secretary-scott-turner-to-scrap-gender-policy-shelters/",
    "timestamp": "2025-02-06T22:18:42Z"
  },
  {
    "title": "Donald Trump And Elon Musk Are Targeting USAID",
    "description": "USAID workers worldwide were pulled off the job Tuesday as President Donald Trump's administration posted notices online and sent emails telling employees that the government's spending overseas is now considered a waste and that they have 30 days to return h…",
    "link": "https://www.npr.org/2025/02/06/1229439866/1a-usaid-02-06-2025",
    "timestamp": "2025-02-06T22:18:33Z"
  },
  {
    "title": "Analysis: Unpacking Iran’s counterintelligence apparatus",
    "description": "Iran’s intelligence network is not a monolithic entity but a web of competing and cooperating factions that execute the regime’s global ambitions. Iran’s Islamic Revolutionary Guard Corps (IRGC), Quds Force, and Ministry of Intelligence each play distinct yet…",
    "link": "https://www.longwarjournal.org/archives/2025/02/analysis-unpacking-irans-counterintelligence-apparatus.php",
    "timestamp": "2025-02-06T22:18:17Z"
  },
  {
    "title": "Justices agree to pause briefing on Biden-era loan forgiveness rule",
    "description": "The Supreme Court on Thursday afternoon agreed to pause the briefing in a challenge to a Biden-era rule intended to streamline the process for reviewing requests for student loan forgiveness from borrowers whose schools defrauded them or were shut down. In a …",
    "link": "https://www.scotusblog.com/2025/02/justices-agree-to-pause-briefing-on-biden-era-loan-forgiveness-rule/",
    "timestamp": "2025-02-06T22:17:55Z"
  },
  {
    "title": "Senate Dems call on VA secretary to protect veteran data from DOGE",
    "description": "Lawmakers asked VA Secretary Doug Collins “to deny and sever” DOGE’s access to department systems that include information about veterans.",
    "link": "https://www.nextgov.com/people/2025/02/senate-dems-call-va-secretary-protect-veteran-data-doge/402821/",
    "timestamp": "2025-02-06T22:16:00Z"
  },
  {
    "title": "Nancy Pelosi flags 'worst idea' of new Trump administration",
    "description": "Rep. Nancy Pelosi (D-CA) attacked President Donald Trump on Thursday for what she is calling his \"worst idea\" yet. Speaking to MSNBC, Pelosi talked about the first actions that Trump's new administration has taken to cull the federal workforce, particularly t…",
    "link": "https://www.rawstory.com/trump-firing-2671110532/",
    "timestamp": "2025-02-06T22:15:40Z"
  },
  {
    "title": "Trump & Queensland: Our Trans Youth Need Us To Show Up For Them, Now",
    "description": "‘Trump & Queensland: Our Trans Youth Need Us To Show Up For Them, Now‘ is an opinion piece by Chloe Sargeant. In the mere weeks (it seems like much longer, ...\nThe post Trump & Queensland: Our Trans Youth Need Us To Show Up For Them, Now appeared first on Sta…",
    "link": "https://www.starobserver.com.au/opinion/trump-queensland-our-trans-youth-need-us-to-show-up-for-them-now/235197",
    "timestamp": "2025-02-06T22:15:17Z"
  },
  {
    "title": "US Seizes Venezuela Government Plane In Dominican Republic",
    "description": "The US on Thursday seized a second aircraft belonging to the Venezuelan government in less than a year during a visit to the Dominican Republic by Secretary of State Marco Rubio, despite nascent diplomacy with leftist leader Nicolas Maduro.",
    "link": "https://www.ndtv.com/world-news/us-seizes-venezuela-government-plane-in-dominican-republic-7652456",
    "timestamp": "2025-02-06T22:15:03Z"
  },
  {
    "title": "The right’s flirtation with degrowth, explained",
    "description": "Over the last few years, I’ve written a lot about degrowth ideology, the view that the only way to save the planet is to abandon economic growth as an objective. Degrowthers sometimes say uncontroversial things like that GDP isn’t the only thing that matters …",
    "link": "https://www.vox.com/future-perfect/398696/degrowth-economy-trump-right-poverty",
    "timestamp": "2025-02-06T22:15:01Z"
  },
  {
    "title": "Xinhua Middle East news summary at 2200 GMT, Feb. 6",
    "description": "JERUSALEM -- An army crane collapsed in the northern Gaza Strip Wednesday night, killing two Israeli soldiers and injuring eight others, according to the Israel Defense Forces (IDF) and media reports. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/07/xinhua-middle-east-news-summary-at-2200-gmt-feb-6",
    "timestamp": "2025-02-06T22:15:00Z"
  },
  {
    "title": "Trump Doubles Down on Gaza Displacement Idea",
    "description": "Legal experts and rights activists argue that the U.S. president’s proposal would amount to ethnic cleansing.",
    "link": "https://foreignpolicy.com/2025/02/06/trump-gaza-plan-displacement-israel-katz-ethnic-cleansing/",
    "timestamp": "2025-02-06T22:14:54Z"
  },
  {
    "title": "NCAA bans transgender women from sports a day after Trump executive order - NewsBreak",
    "description": "(Reuters) -The NCAA, the governing body for collegiate sports in the United States, banned transgender women from competing in women's sports effective imm",
    "link": "https://www.newsbreak.com/share/3794599441900-ncaa-bans-transgender-women-from-sports-a-day-after-trump-executive-order?_f=app_share&pd=0B4fi1R4&lang=en_US&send_time=1738885828&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.4.0.27%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-v2&s=i2",
    "timestamp": "2025-02-06T22:14:47Z"
  },
  {
    "title": "Demonstrators demand Senate delay, disrupt Trump orders, actions",
    "description": "Large groups of Marylanders opposed to White House actions and executive orders demonstrated Thursday for a second consecutive day, this time, in Baltimore.",
    "link": "https://www.wbaltv.com/article/baltimore-protest-trump-executive-orders-actions-usaid/63692269",
    "timestamp": "2025-02-06T22:14:30Z"
  },
  {
    "title": "Netanyahu meets with bipartisan senate leadership at Capitol Hill",
    "description": "A major topic of discussion was legislative action against the International Criminal Court, with Senate leaders pledging to advance a bill aimed at countering the court.",
    "link": "https://www.jpost.com/international/article-841052",
    "timestamp": "2025-02-06T22:14:14Z"
  },
  {
    "title": "This Week In Credit Card News: Senators Propose 10% Cap On Interest Rates",
    "description": "What took place this week in the credit card and payment industries",
    "link": "https://www.forbes.com/sites/billhardekopf/2025/02/06/this-week-in-credit-card-news-senators-propose-10-cap-on-interest-rates/",
    "timestamp": "2025-02-06T22:13:47Z"
  },
  {
    "title": "NYC hospitals tell staff not to hide patients from ICE — triggering furious Dems: ‘Fear and chaos’",
    "description": "The city’s public hospital system is warning staff not to help people avoid being found by Immigration and Custom Enforcement, as liberal pols demand the Mayor rescind the guidance in their fight to keep locations safe from homeland security.",
    "link": "https://nypost.com/2025/02/06/us-news/nyc-hospitals-tell-staff-not-to-hide-patients-from-ice-triggering-furious-dems-fear-and-chaos/",
    "timestamp": "2025-02-06T22:13:01Z"
  },
  {
    "title": "Would a US takeover of Gaza be against international law?",
    "description": "In a social media post earlier today, US President Donald Trump seemed to double down on claims his country would fight to control the territory of Gaza. He had also suggested recently at a press conference that Palestinians should leave the region and be tak…",
    "link": "https://www.bbc.co.uk/programmes/w172zb9cctgxnjv",
    "timestamp": "2025-02-06T22:13:00Z"
  },
  {
    "title": "DOGE Engineer Resigns After Being Linked to Extremely Racist Tweets: Report",
    "description": "25-year-old Marko Elez was a member of Elon Musk's unruly gang of fascists.",
    "link": "https://gizmodo.com/doge-engineer-resigns-over-extremely-racist-tweets-report-2000560615",
    "timestamp": "2025-02-06T22:12:10Z"
  },
  {
    "title": "The Courts Push Back on Trump",
    "description": "\"A familiar pattern has emerged since President Donald Trump returned to the White House less than three weeks ago: He makes a brash proposal, his opponents file a lawsuit and a federal judge puts the",
    "link": "https://politicalwire.com/2025/02/06/courts-push-back-on-trump/",
    "timestamp": "2025-02-06T22:12:05Z"
  },
  {
    "title": "Republicans say they are nearing deal on Trump's tax cuts, divided on cost",
    "description": "WASHINGTON (Reuters) -Congressional Republicans emerged from a five-hour meeting with U.S. President Donald Trump on Thursday without a deal on how to extend...",
    "link": "https://www.yahoo.com/news/republicans-nearing-deal-trumps-tax-221151516.html",
    "timestamp": "2025-02-06T22:11:51Z"
  },
  {
    "title": "Why Pam Bondi’s first day as attorney general was such a mess",
    "description": "Pam Bondi had all kinds of first-day moves, but the creation of the Justice Department's “Weaponization Working Group” was the most ridiculous.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pam-bondis-first-day-attorney-general-was-mess-rcna191068",
    "timestamp": "2025-02-06T22:11:38Z"
  },
  {
    "title": "Trump unveils sanctions against International Criminal Court for Netanyahu arrest warrant",
    "description": "President Donald Trump signed an executive order issuing financial sanctions and visa restrictions against International Criminal Court officials.",
    "link": "https://www.foxnews.com/politics/trump-unveils-sanctions-against-international-criminal-court-netanyahu-arrest-warrant",
    "timestamp": "2025-02-06T22:11:35Z"
  },
  {
    "title": "Elon Musk is a walking conflict of interest",
    "description": "As Elon Musk continues to help the Trump administration overhaul federal government, Chris Hayes breaks down the billionaire's possible conflicts of interest",
    "link": "https://www.msnbc.com/top-stories/latest/trump-elon-musk-conflict-of-interest-rcna191032",
    "timestamp": "2025-02-06T22:11:15Z"
  },
  {
    "title": "How Stinky got the no morals brigade to back Sideshow Bob and his wacky friends. DRTFA: I'm going with 'Lying', your guesses to the right [Asinine]",
    "description": "How Stinky got the no morals brigade to back Sideshow Bob and his wacky friends. DRTFA: I'm going with 'Lying', your guesses to the right",
    "link": "https://www.fark.com/comments/13552386/How-Stinky-got-no-morals-brigade-to-back-Sideshow-Bob-his-wacky-friends-DRTFA-Im-going-with-Lying-your-guesses-to-right",
    "timestamp": "2025-02-06T22:10:31Z"
  },
  {
    "title": "Donald Trump Jr Says Crypto Is the 'Future of American Hegemony'",
    "description": "Donald Trump Jr Says Crypto Is the 'Future of American Hegemony'\nThe son of the U.S. president made a surprise appearance at the Ondo Summit in New York City on Thursday.\nWhat to know:\n- Donald Trump Jr. said that crypto is the \"future of American hegemony.\"\n…",
    "link": "https://biztoc.com/x/e3442645dc9aa9b6",
    "timestamp": "2025-02-06T22:09:48Z"
  },
  {
    "title": "Evangelical leaders call on Trump to rethink 'hastily pursued' foreign aid cuts",
    "description": "President Donald Trump attends the National Prayer Breakfast in Washington.\nEvan Vucci/AP\nEvangelical leaders are pushing back on President Donald Trump's cuts to foreign aid.\nTrump and Elon Musk have targeted USAID in their sweeping cost-cutting efforts.\nSom…",
    "link": "https://biztoc.com/x/81598f7f16f9fff4",
    "timestamp": "2025-02-06T22:09:28Z"
  },
  {
    "title": "Tesla Sales Plummet in Germany Amid Musk's Support for AfD",
    "description": "\"Limiting yourself to AfD supporters as customers comes at a cost it seems,\" said one Germany-based political scientist on Wednesday, referring to the far-right political party Alternative for Germany, as Tesla sales were shown to have plummeted in the countr…",
    "link": "https://www.commondreams.org/news/tesla-germany",
    "timestamp": "2025-02-06T22:09:19Z"
  },
  {
    "title": "I’m a Teacher. Trump’s Plans for Public Schools Terrify Me. But There Are Ways Parents Can Help.",
    "description": "It’s been a tough couple of years. But I’ve been getting parent emails that cheer me.",
    "link": "https://slate.com/life/2025/02/trump-education-immigration-raids-schools-department.html",
    "timestamp": "2025-02-06T22:09:04Z"
  },
  {
    "title": "Dems who lashed out at Trump for being 'threat to democracy' flip script with last-minute delay tactics",
    "description": "Voters overwhelmingly elected President Donald Trump to carry out his agenda despite Democrats calling him a \"threat to democracy.\" Dems are now delaying key cabinet appointments.",
    "link": "https://www.foxnews.com/politics/dems-lashed-trump-being-threat-democracy-flip-script-delay-tactics",
    "timestamp": "2025-02-06T22:08:13Z"
  },
  {
    "title": "Here Are All The Major Lawsuits Against Trump—And Elon Musk’s DOGE",
    "description": "Judges ruled on Thursday alone to extend blocks on Trump’s birthright citizenship ban, limit Elon Musk’s access to Treasury documents and pause the deadline for federal employee buyouts.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/06/here-are-all-the-major-lawsuits-against-trump-and-elon-musks-doge/",
    "timestamp": "2025-02-06T22:07:25Z"
  },
  {
    "title": "Elon Musk’s Demolition Crew",
    "description": "by Avi Asher-Schapiro, Christopher Bing, Annie Waldman, Brett Murphy, Andy Kroll, Justin Elliott, Kirsten Berg, Sebastian Rotella, Alex Mierjeski, Pratheek Rebala and Al Shaw \n On President Donald Trump’s authority alone, Elon Musk, the world’s richest man, h…",
    "link": "https://projects.propublica.org/elon-musk-doge-tracker/",
    "timestamp": "2025-02-06T22:07:00Z"
  },
  {
    "title": "Google scraps its diversity hiring goals as it complies with Trump's new government contractor rules",
    "description": "Google is scrapping some of its diversity hiring targets, joining a lengthening list of U.S. companies that have abandoned or scaled back their diversity, equity and inclusion programs.",
    "link": "https://abc7chicago.com/post/google-scraps-diversity-hiring-goals-complies-trumps-new-government-contractor-rules/15873983/",
    "timestamp": "2025-02-06T22:06:15Z"
  },
  {
    "title": "The Trump Effect: National Endowment For The Arts Shifts Grant Priorities To Projects Celebrating America’s 250th Birthday",
    "description": "The National Endowment for the Arts revised its guidelines for arts grants, placing funding priority on those projects “that celebrate and honor the 250th anniversary of the signing of the Declaration of Independence.” The revisions to the fiscal year 2026 gr…",
    "link": "http://deadline.com/2025/02/trump-national-endowment-for-the-arts-america-250-1236280766/",
    "timestamp": "2025-02-06T22:05:47Z"
  },
  {
    "title": "'That Bullsh*t Can’t Happen': Grenell Says DEI Must Not Slow Fire Cleanup",
    "description": "Ambassador Ric Grenell told federal, state, and local leaders that he would not tolerate diversity, equity, and inclusion (DEI) criteria slowing down the process of cleaning up and rebuilding after L.A. fires.\nThe post ‘That Bullsh*t Can’t Happen’: Grenell Sa…",
    "link": "https://www.breitbart.com/politics/2025/02/06/that-bullsht-cant-happen-grenell-says-dei-must-not-slow-fire-cleanup/",
    "timestamp": "2025-02-06T22:05:36Z"
  },
  {
    "title": "Bill Bratton braces for Super Bowl, Mardi Gras and President Trump at the big game",
    "description": "Former big-city police commissioner Bill Bratton said the announcement that President Donald Trump will attend Sunday's Super Bowl just sent the security alert in New Orleans to SEAR 1.",
    "link": "https://www.bostonherald.com/2025/02/06/bill-bratton-braces-for-super-bowl-mardi-gras-and-president-trump-at-the-big-game/",
    "timestamp": "2025-02-06T22:04:32Z"
  },
  {
    "title": "Trump administration keeping only 294 USAID staff out of over 10,000 globally, sources say",
    "description": "WASHINGTON (Reuters) - President Donald Trump's administration plans to keep fewer than 300 staff at the U.S. Agency for International Development out of the agency's worldwide total of more than 10,000, four sources told Reuters on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/07/trump-administration-keeping-only-294-usaid-staff-out-of-over-10000-globally-sources-say",
    "timestamp": "2025-02-06T22:03:00Z"
  },
  {
    "title": "Soros-funded Dems suddenly upset by billionaires in government",
    "description": "USAID isn’t representing the United States around the world. It is representing a narrow and now very dated view around the world.",
    "link": "https://nypost.com/2025/02/06/opinion/soros-funded-dems-suddenly-upset-by-billionaires-in-government/",
    "timestamp": "2025-02-06T22:02:33Z"
  },
  {
    "title": "Liberal minister says he expects U.S. voices against Trump tariffs to 'get louder' in coming weeks",
    "description": "National Resources Minister Jonathan Wilkinson said the American business community is also quietly pushing back against Trump's tariff threats",
    "link": "https://nationalpost.com/news/canada/liberal-minister-says-he-expects-u-s-voices-against-trump-tariffs-to-get-louder-in-coming-weeks",
    "timestamp": "2025-02-06T22:02:15Z"
  },
  {
    "title": "Donald Trump Jr Says Crypto Is the 'Future of American Hegemony'",
    "description": "The son of the U.S. president made a surprise appearance at the Ondo Summit in New York City on Thursday.",
    "link": "https://www.coindesk.com/markets/2025/02/06/donald-trump-jr-says-crypto-is-the-future-of-american-hegemony",
    "timestamp": "2025-02-06T22:01:43Z"
  },
  {
    "title": "What Israel Wants in Gaza",
    "description": "Israel’s deputy foreign minister on the cease-fire, Trump’s proposal, and more.",
    "link": "https://foreignpolicy.com/2025/02/06/israel-gaza-trump-deputy-foreign-minister-interview/",
    "timestamp": "2025-02-06T22:00:05Z"
  },
  {
    "title": "'The View' host echoes Democratic calls for anti-Trump forces to take to the streets",
    "description": "\"The View\" co-host Ana Navarro called on Americans to take to the streets to protest President Donald Trump and his policies on Thursday, echoing some calls from Democrats.",
    "link": "https://www.foxnews.com/media/the-view-host-echoes-democratic-calls-anti-trump-forces-take-streets",
    "timestamp": "2025-02-06T22:00:03Z"
  },
  {
    "title": "Trump’s Energy Dominance Agenda Looks Like Texas",
    "description": "With our all-of-the-above energy approach, Texas has already proven that Trump’s energy agenda will be a success. In recent years, the Texas economy has grown well over twice as fast as America as a whole while delivering comparatively lower energy bills than…",
    "link": "https://wattsupwiththat.com/2025/02/06/trumps-energy-dominance-agenda-looks-like-texas/",
    "timestamp": "2025-02-06T22:00:00Z"
  },
  {
    "title": "Commentary: Trump’s plan for Gaza ‘Riviera’ sounds more real estate pitch than foreign policy",
    "description": "<![CDATA[ Even if President Donald Trump’s proposal for the United States to “take over” Gaza is never implemented in the way he described, the effects will be overwhelmingly negative and long-lasting, says international security expert Stefan Wolff. ]]>",
    "link": "https://www.channelnewsasia.com/commentary/trump-gaza-takeover-riviera-middle-east-israel-ceasefire-two-state-solution-4921386",
    "timestamp": "2025-02-06T22:00:00Z"
  },
  {
    "title": "Not Kidding: Michigan State Rep Says She Sterilized Herself To Protest Trump",
    "description": "A Democratic Michigan state representative told protesters Wednesday that she underwent voluntary sterilization to avoid becoming pregnant during President Donald Trump's second term, a left-wing media outlet reported.\nThe post Not Kidding: Michigan State Rep…",
    "link": "https://freebeacon.com/democrats/not-kidding-michigan-state-rep-says-she-sterilized-herself-to-protest-trump/",
    "timestamp": "2025-02-06T21:59:31Z"
  },
  {
    "title": "House lawmakers propose DeepSeek ban on U.S. government devices",
    "description": "Reps. Josh Gottheimer, D-N.J., and Darin LaHood, R-Ill., on Thursday introduced the “No DeepSeek on Government Devices Act,\" which would ban federal employees from using the Chinese AI app on government-owned electronics.",
    "link": "https://www.pbs.org/newshour/politics/house-lawmakers-propose-deepseek-ban-on-u-s-government-devices",
    "timestamp": "2025-02-06T21:58:51Z"
  }
]