[
  {
    "title": "Federal Judge Says White House Must Reinstate AP Access to Press Pool, Oval Office",
    "description": "A federal judge issued a ruling that the White House must reinstate Associated Press (AP) reporters' access to the press pool and to certain places like the Oval Office and Air Force One.\nThe post Federal Judge Says White House Must Reinstate AP Access to Pre…",
    "link": "https://www.breitbart.com/the-media/2025/04/08/federal-judge-white-house-must-reinstate-ap-access-press-pool-oval-office/",
    "timestamp": "2025-04-09T01:15:04Z"
  },
  {
    "title": "Trump tariffs could lower Bitcoin miner prices outside US, says mining exec",
    "description": "The Trump administration’s sweeping tariffs could collapse US demand for Bitcoin mining rigs, which would benefit mining operations outside the country as manufacturers will look outside the US to sell their surplus inventory for cheaper, says Hashlabs Mining…",
    "link": "https://cointelegraph.com/news/trumps-tariffs-lower-bitcoin-miner-price-outside-us",
    "timestamp": "2025-04-09T01:14:08Z"
  },
  {
    "title": "Watch: Donald Trump Speaks at National Republican Congressional Committee Dinner",
    "description": "President Donald Trump speaks at the National Republican Congressional Committee dinner on Tuesday, April 8.\nThe post Watch: Donald Trump Speaks at National Republican Congressional Committee Dinner appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/08/watch-live-donald-trump-speaks-at-national-republican-congressional-committee-dinner/",
    "timestamp": "2025-04-09T01:12:34Z"
  },
  {
    "title": "Trump says he told TSMC it would pay 100% tax if it doesn't build in US",
    "description": "President Donald Trump on Tuesday said he told the Taiwan Semiconductor Manufacturing Company it would pay a tax of up to 100 per cent if it didn't build its plants in the United StatesSpeaking to an event at the Republican National Congressional Committee, T…",
    "link": "https://www.channelnewsasia.com/business/trump-says-he-told-tsmc-it-would-pay-100-tax-if-it-doesnt-build-us-5053446",
    "timestamp": "2025-04-09T01:11:41Z"
  },
  {
    "title": "Trump says TSMC faced up to 100% tax if it did not build in US; Taiwan hopes for quick US agreement on tariffs",
    "description": "President Donald Trump on Tuesday (Apr 8) said he told the Taiwan Semiconductor Manufacturing Company, which has pledged to build new factories in the United States, it would pay a tax of up to 100 per cent if it did not build its plants in the country. Speak…",
    "link": "https://www.channelnewsasia.com/east-asia/taiwan-us-trump-tariffs-tsmc-100-percent-tax-agreement-5053446",
    "timestamp": "2025-04-09T01:11:00Z"
  },
  {
    "title": "Japan stocks, South Korean won tumble as Wall Street turns red",
    "description": "TOKYO: Japan's main Nikkei index of shares fell in early trade on Wednesday (Apr 9) as worries about a United States-China trade war killed off a rebound rally on Wall Street. South Korea's currency meanwhile fell to its lowest level against the dollar since …",
    "link": "https://www.channelnewsasia.com/business/asian-stocks-japan-nikkei-south-korea-won-tumble-trump-tariffs-5053396",
    "timestamp": "2025-04-09T01:08:03Z"
  },
  {
    "title": "Wall Street slides again as US forges ahead with 104% tariffs on China",
    "description": "S&P 500 companies have lost $5.8 trillion in stock market value since Trump's tariff announcement last Wednesday, the deepest four-day loss since the benchmark was created in the 1950s, according to LSEG data. Global markets had previously posted gains on hop…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-slides-again-as-us-forges-ahead-with-104-tariffs-on-china/articleshow/120110134.cms",
    "timestamp": "2025-04-09T01:05:43Z"
  },
  {
    "title": "Trump signals major tariff on pharma imports, Indian drugmakers could face impact",
    "description": "Donald Trump announced a forthcoming \"major\" tariff on pharmaceutical imports, aiming to incentivize drug companies to relocate operations to the U.S. He also stated he warned Taiwan Semiconductor Manufacturing Company (TSMC) about potential taxes if they did…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-will-soon-announce-tariffs-on-pharmaceutical-imports/articleshow/120110552.cms",
    "timestamp": "2025-04-09T01:03:47Z"
  },
  {
    "title": "Trump says US will soon announce tariffs on pharmaceutical imports",
    "description": "Donald Trump announced a forthcoming \"major\" tariff on pharmaceutical imports, aiming to incentivize drug companies to relocate operations to the U.S. He also stated he warned Taiwan Semiconductor Manufacturing Company (TSMC) about potential taxes if they did…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-will-soon-announce-tariffs-on-pharmaceutical-imports/articleshow/120110100.cms",
    "timestamp": "2025-04-09T01:03:47Z"
  },
  {
    "title": "JD Vance earns 'swift and scathing' rebuke from China after 'peasant' remark",
    "description": "While President Donald Trump’s tariffs continue to roil China, Vice President JD Vance created an uproar of his own after making comments about “Chinese peasants” that quickly spread throughout the foreign country – and incited the fury of Beijing officials.T…",
    "link": "https://www.rawstory.com/jd-vance-china/",
    "timestamp": "2025-04-09T01:01:01Z"
  },
  {
    "title": "Netanyahu-Trump meeting reveals unexpected gaps on key issues",
    "description": "During a recent White House visit, Israeli Prime Minister Benjamin Netanyahu faced a challenging encounter with President Trump, despite initial expectations of strong support. Key disagreements emerged over Iran's nuclear program, U.S. tariffs on Israeli goo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/netanyahu-trump-meeting-reveals-unexpected-gaps-on-key-issues/articleshow/120110032.cms",
    "timestamp": "2025-04-09T01:00:15Z"
  },
  {
    "title": "Sen. Johnson Talks Gibberish About Wisconsin Election",
    "description": "Sen. Ron Johnson spoke with Matt Smith of Wisconsin-based UpFront to discuss last week's elections:\nSMITH: Tuesday night. You know this data incredibly well. How did this happen on Tuesday? \nROJO: Well, Matt, you know, there's no way to sugarcoat this. It was…",
    "link": "https://crooksandliars.com/2025/04/sen-johnson-talks-gibberish-about",
    "timestamp": "2025-04-09T01:00:01Z"
  },
  {
    "title": "The Department of the Interior Moves to Restore Coal Industry",
    "description": "“The Golden Age is here, and we are starting to ‘Mine, Baby, Mine’ for clean American coal,” said Department of the Interior Secretary Doug Burgum. “Interior is unlocking America’s full potential in energy dominance and economic development to make life more …",
    "link": "https://wattsupwiththat.com/2025/04/08/the-department-of-the-interior-moves-to-restore-coal-industry/",
    "timestamp": "2025-04-09T01:00:00Z"
  },
  {
    "title": "Trump claims China manipulates currency to offset tariffs",
    "description": "United President Donald Trump criticized non-monetary trade barriers imposed by other countries, calling them even worse than tariffs. He said such restrictions block US products from entering foreign...",
    "link": "https://biztoc.com/x/1d301df36fee980d",
    "timestamp": "2025-04-09T00:59:28Z"
  },
  {
    "title": "Lesotho: the tiny African nation in the crosshairs of Trump's tariff war",
    "description": "\"Nobody has ever heard of\" Lesotho, Donald Trump said last month with his trademark braggadocio.\nThat's despite the US' diplomatic mission in the Kingdom of Lesotho, a tiny mountainous enclave surrounded by South Africa. But the US president has since ensured…",
    "link": "https://biztoc.com/x/717365d12c2ced18",
    "timestamp": "2025-04-09T00:59:00Z"
  },
  {
    "title": "China’s Copper Smelters Rue Beijing’s Curbs on US Raw Materials",
    "description": "Beijing’s response to punitive US tariffs could create yet another headache for Chinese copper smelters, already grappling with a shortage of raw materials and plummeting profits.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-copper-smelters-rue-beijings-curbs-on-us-raw-materials",
    "timestamp": "2025-04-09T00:58:09Z"
  },
  {
    "title": "There are two ways Trump's tariffs could play out. Both are laden with risk",
    "description": "A series of policies have up-ended the global trade system and wiped trillions of dollars of value from the face of the Earth. Here's what could happen next.",
    "link": "https://www.abc.net.au/news/2025-04-09/under-trump-tariffs-here-how-world-could-look-in-coming-years/105150824",
    "timestamp": "2025-04-09T00:58:01Z"
  },
  {
    "title": "CNBC Daily Open: Musk slams Navarro as Trump's 104% tariffs on China are set to take effect",
    "description": "Despite growing consternation and concern expressed by economists and CEOs, Trump administration officials have been stubborn in defending its trade policies.",
    "link": "https://www.cnbc.com/2025/04/09/cnbc-daily-open-musk-slams-navarro-104percent-tariffs-on-china-live-soon.html",
    "timestamp": "2025-04-09T00:57:48Z"
  },
  {
    "title": "Donald Trump tariff war: US raises China’s tariff to 104 per cent after deadline to remove retaliation missed",
    "description": "US President Donald Trump has imposed a 104 per cent tariff after China missed his deadline to remove a retaliatory tariff as a fierce trade war with alarming global impacts erupts.",
    "link": "https://www.perthnow.com.au/business/trade/donald-trump-tariff-war-us-raises-chinas-tariff-to-104-per-cent-after-deadline-to-remove-retaliation-missed-c-18310439",
    "timestamp": "2025-04-09T00:57:10Z"
  },
  {
    "title": "Gun-toting Noem joins ICE agents to go after criminal illegal aliens in Arizona",
    "description": "DHS Secretary Kristi Noem joined ICE and other law enforcement agents in Arizona during operations Tuesday, targeting illegal immigrants wanted for murder and human trafficking.",
    "link": "https://www.foxnews.com/politics/gun-toting-noem-joins-ice-agents-criminal-illegal-aliens-arizona",
    "timestamp": "2025-04-09T00:53:23Z"
  },
  {
    "title": "Australia Treasurer Calls Emergency Meeting on Trump Tariffs",
    "description": "Treasurer Jim Chalmers will meet with Australia’s top economic figures in the face of growing global uncertainty sparked by US President Donald Trump’s reciprocal tariffs regime. This follows similar meetings late Tuesday with the heads of Australia’s big ban…",
    "link": "https://financialpost.com/pmn/business-pmn/australia-treasurer-calls-emergency-meeting-on-trump-tariffs",
    "timestamp": "2025-04-09T00:53:03Z"
  },
  {
    "title": "U.S. FAA’s top air traffic control official to step down from agency",
    "description": "Tim Arel, chief operating officer of the FAA’s Air Traffic Organization, plans to leave the agency ahead of a major overhaul of the unit’s antiquated technology systems.",
    "link": "https://www.japantimes.co.jp/news/2025/04/09/world/politics/faa-air-traffic-control-step-down/",
    "timestamp": "2025-04-09T00:53:00Z"
  },
  {
    "title": "US senator Mark Warner slams Trump’s tariffs on Australia during fiery exchange with US trade representative",
    "description": "US senator Mark Warner slams Trump’s tariffs on Australia during fiery exchange with US trade representative7news.com.au",
    "link": "https://7news.com.au/sunrise/senator-mark-warner-slams-trumps-tariffs-on-australia-during-fiery-exchange-with-us-trade-representative-c-18311455",
    "timestamp": "2025-04-09T00:52:22Z"
  },
  {
    "title": "Jasmine Crockett Scorches GOP's 'Efficiency' Talk With A Blistering Trump Figure",
    "description": "The Democratic congresswoman used a DOGE subcommittee hearing to call out the president for wanting to \"play games\" on America's dime.",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-doge-trump-golfing-fallen-soldiers-transfer_n_67f5a187e4b0de127dd6ba11",
    "timestamp": "2025-04-09T00:51:10Z"
  },
  {
    "title": "Soaring one day, plunging the next. Why is the ASX 200 on a rollercoaster?",
    "description": "After rocketing 2.4% yesterday, why is the ASX 200 crashing again today?\nThe post Soaring one day, plunging the next. Why is the ASX 200 on a rollercoaster? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/09/soaring-one-day-plunging-the-next-why-is-the-asx-200-on-a-rollercoaster/",
    "timestamp": "2025-04-09T00:50:53Z"
  },
  {
    "title": "Trump’s 14% tariff threatens N323.96bn Nigerian non-oil exports to US",
    "description": "President of the United States, Donald Trump, on April 2, 2025, announced the enforcement of sweeping tariffs on all goods imported into the country, a move that has placed over N323.96bn worth of Nigerian exports at risk. Tagged the “Universal Baseline Tarif…",
    "link": "https://punchng.com/trumps-14-tariff-threatens-n323-96bn-nigerian-non-oil-exports-to-us/",
    "timestamp": "2025-04-09T00:50:14Z"
  },
  {
    "title": "Record Attendance At Geneva’s Watches And Wonders, With Tariffs Looming On Swiss Watches",
    "description": "Watches and Wonders, the luxury watch trade show held in Geneva April 1-7 was big on numbers this year, with 55,000 visitors, up 12% over last year.",
    "link": "https://www.forbes.com/sites/carolbesler/2025/04/08/record-attendance-at-genevas-watches-and-wonders-with-tariffs-looming-on-swiss-watches/",
    "timestamp": "2025-04-09T00:49:44Z"
  },
  {
    "title": "Trump claims China manipulating currency at record levels",
    "description": "United President Donald Trump criticized non-monetary trade barriers imposed by other countries, calling them even worse than tariffs. He said such restrictions block US products from entering foreign...",
    "link": "https://biztoc.com/x/d478361df01bb912",
    "timestamp": "2025-04-09T00:48:37Z"
  },
  {
    "title": "Trump: We will announce major tariff on pharmaceuticals",
    "description": "United States President Donald Trump said during remarks at the National Republican Congressional Committee (NRCC) dinner that the US is going to announce a \"major tariff\" on pharmaceuticals...",
    "link": "https://biztoc.com/x/895e3fe5cae62883",
    "timestamp": "2025-04-09T00:48:31Z"
  },
  {
    "title": "Conservative WSJ scolds Republicans threatening to 'torpedo' Trump's agenda",
    "description": "The conservative Wall Street Journal editorial board took far-right House Republicans to the woodshed for threatening to blockade the Senate's budget framework, warning them that they were essentially derailing the very pro-Trump agenda they claimed to stand …",
    "link": "https://www.rawstory.com/wsj-trump-taxes/",
    "timestamp": "2025-04-09T00:48:21Z"
  },
  {
    "title": "Oil Extends Brutal Selloff as Fresh Tariff Wave Imperils Demand",
    "description": "Oil extended a brutal selloff that’s driven prices to a four-year low as an intensifying trade war threatens to batter energy demand.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-extends-brutal-selloff-as-fresh-tariff-wave-imperils-demand",
    "timestamp": "2025-04-09T00:47:56Z"
  },
  {
    "title": "Lesotho: the tiny African nation in the crosshairs of Trump's tariff war",
    "description": "US president imposes 50% reciprocal levy on the impoverished state: the highest of his so-called 'Liberation Day' tariffs",
    "link": "https://theweek.com/business/economy/lesotho-the-tiny-african-nation-in-the-crosshairs-of-trumps-tariff-war",
    "timestamp": "2025-04-09T00:47:04Z"
  },
  {
    "title": "Agriculture secretary doesn't expect egg prices to significantly increase after Trump tariff announcement",
    "description": "Agriculture Secretary Brooke Rollins opens up about the potential impact of President Donald Trump's tariffs on American farmers on 'Special Report.'",
    "link": "https://www.foxnews.com/media/agriculture-secretary-doesnt-expect-egg-prices-significantly-increase-after-trump-tariff-announcement",
    "timestamp": "2025-04-09T00:45:51Z"
  },
  {
    "title": "Opinion: Ukraine crisis lucrative business for U.S. military-industrial complex",
    "description": "This photo taken on March 21, 2024 shows a building damaged in a missile attack in Kiev, Ukraine. (",
    "link": "http://en.people.cn/n3/2025/0409/c90000-20299361.html",
    "timestamp": "2025-04-09T00:44:27Z"
  },
  {
    "title": "The latest leak in the Keystone oil pipeline continues its troubled history",
    "description": "The latest leak in the Keystone oil pipeline in North Dakota on Tuesday continues the troubled history of the 15-year-old pipeline",
    "link": "https://abcnews.go.com/Business/wireStory/latest-leak-keystone-oil-pipeline-continues-troubled-history-120616797",
    "timestamp": "2025-04-09T00:44:04Z"
  },
  {
    "title": "Trump says US will soon announce tariffs on pharmaceutical imports",
    "description": "(Reuters) - President Donald Trump on Tuesday said the U.S. will soon announce a \"major\" tariff on pharmaceutical imports. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/09/trump-says-us-will-soon-announce-tariffs-on-pharmaceutical-imports",
    "timestamp": "2025-04-09T00:43:00Z"
  },
  {
    "title": "Texas AG Ken Paxton Will Challenge Sen. John Cornyn in 2026",
    "description": "\"And it's time we have another great senator that will actually stand up and fight for Republican values, fight for the values of the people of Texas, and also support Donald Trump in the areas that he's focused on...\"\nThe post Texas AG Ken Paxton Will Challe…",
    "link": "https://legalinsurrection.com/2025/04/texas-ag-ken-paxton-will-challenge-sen-john-cornyn-in-2026/",
    "timestamp": "2025-04-09T00:41:25Z"
  },
  {
    "title": "White House Confirms Trump Is Exploring Ways To 'Deport' U.S. Citizens (Sara Boboltz/HuffPost)",
    "description": "Sara Boboltz / HuffPost:\nWhite House Confirms Trump Is Exploring Ways To ‘Deport’ U.S. Citizens  —  The administration could try removing American citizens if it identifies a pathway it can claim to be legal.  —  Video  —  White House press secretary Karoline…",
    "link": "https://www.memeorandum.com/250408/p161",
    "timestamp": "2025-04-09T00:40:00Z"
  },
  {
    "title": "Exclusive: Trump administration moves to restore some terminated foreign aid programs, sources say (Reuters)",
    "description": "Reuters:\nExclusive: Trump administration moves to restore some terminated foreign aid programs, sources say  —  The administration of President Donald Trump on Tuesday moved to reinstate at least six recently canceled U.S. foreign aid programs, six sources fa…",
    "link": "https://www.memeorandum.com/250408/p162",
    "timestamp": "2025-04-09T00:40:00Z"
  },
  {
    "title": "The Trump 2.0 Effect on Meetings",
    "description": "From geopolitical tensions to controversial executive orders, President Donald Trump’s return to the White House is impacting the meetings industry. \n -Andrea Doyle",
    "link": "http://meetings.skift.com/2025/04/08/the-trump-2-0-effect-on-meetings/",
    "timestamp": "2025-04-09T00:38:04Z"
  },
  {
    "title": "Trump admin. confronts antisemitism and DEI",
    "description": "If DEI can’t recognize antisemitism, it's not a tool for justice but a weapon for exclusion.",
    "link": "https://www.jpost.com/opinion/article-849344",
    "timestamp": "2025-04-09T00:37:58Z"
  },
  {
    "title": "CBS News Interviews Confused Liechtensteiners Wondering Why Trump Hit Them With Massive Tariffs",
    "description": "CBS News foreign correspondent Elizabeth Palmer interviewed several \"puzzled and very sad\" citizens of Liechtenstein after Trump hit the country with tariffs.\nThe post CBS News Interviews Confused Liechtensteiners Wondering Why Trump Hit Them With Massive Tar…",
    "link": "https://www.mediaite.com/tv/cbs-news-interviews-confused-liechtensteiners-wondering-why-trump-hit-them-with-massive-tariffs/",
    "timestamp": "2025-04-09T00:37:42Z"
  },
  {
    "title": "Trump says non-tariff barriers worse than tariffs",
    "description": "United President Donald Trump criticized non-monetary trade barriers imposed by other countries, calling them even worse than tariffs. He said such restrictions block US products from entering foreign...",
    "link": "https://biztoc.com/x/f28f7e932abcb747",
    "timestamp": "2025-04-09T00:37:10Z"
  },
  {
    "title": "IRS acting commissioner resigning after deal to share immigrants' tax information with ICE",
    "description": "Melanie Krause, who served as acting head since February, will step down over the new data-sharing document.",
    "link": "https://roanoke.com/news/nation-world/article_fbb1d6a4-3f43-5026-a64a-9a67561969a8.html",
    "timestamp": "2025-04-09T00:35:00Z"
  },
  {
    "title": "Left Using '8647' Symbol for Violence Against Trump, Musk",
    "description": "Sen. Mike Lee, R-Utah, is calling on Americans across the political spectrum to denounce the use of \"8647\" by protesters — a phrase some allege is a coded call for violence against President Donald Trump — after anti-Trump and anti-Elon Musk rallies broke out…",
    "link": "https://freerepublic.com/focus/f-news/4309833/posts",
    "timestamp": "2025-04-09T00:34:11Z"
  },
  {
    "title": "US Tariffs to Significantly Impact Economies in Asia, ADB Says",
    "description": "The Asian Development Bank will lower its growth forecast for Asia further after the region was hit the hardest by tariffs from the US.",
    "link": "https://financialpost.com/pmn/business-pmn/us-tariffs-to-significantly-impact-economies-in-asia-adb-says",
    "timestamp": "2025-04-09T00:32:41Z"
  },
  {
    "title": "Billy Joel donates $50K to super PAC backing Andrew Cuomo’s mayoral bid — Barry Diller kicks in $250K",
    "description": "The Piano Man — who made the donation on April 2 — has been a Cuomo backer and pal in the past.",
    "link": "https://pagesix.com/2025/04/08/society/billy-joel-donates-50k-to-super-pac-backing-andrew-cuomo/",
    "timestamp": "2025-04-09T00:32:10Z"
  },
  {
    "title": "Japan's Nikkei falls 2.7% after Wall Street losses",
    "description": "The Nikkei 225 was down 2.67% to 32,130.00, having rebounded 6% on Tuesday from heavy losses after Trump's announcement of sweeping tariffs.",
    "link": "https://www.japantimes.co.jp/business/2025/04/09/markets/nikkei-stocks-trump-tariffs/",
    "timestamp": "2025-04-09T00:32:00Z"
  },
  {
    "title": "Hooked on a feeling",
    "description": "Longtime sage of the LGM commentariat JEC has some very sobering observations: The outcome of yesterday’s meeting between Trump and Netanyahu is probably the worst economic news so far. 1. Prior to the effective date of The Tariffs*, Israel offered the US acr…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/hooked-on-a-feeling",
    "timestamp": "2025-04-09T00:30:09Z"
  },
  {
    "title": "Trump fails to sway many House GOP holdouts as his 'big' bill of tax breaks and spending cuts stalls (Associated Press)",
    "description": "Associated Press:\nTrump fails to sway many House GOP holdouts as his ‘big’ bill of tax breaks and spending cuts stalls  —  House Speaker Mike Johnson found himself in a familiar jam on Tuesday: Conservative Republican holdouts are stalling action on President…",
    "link": "https://www.memeorandum.com/250408/p160",
    "timestamp": "2025-04-09T00:30:01Z"
  },
  {
    "title": "Trump embraces ‘tailored’ tariff deals as foreign leaders look to sweeten their offers | CNN Politics",
    "description": "Delegations from Japan and South Korea are en route. Italy’s prime minister will be in Washington next week. And Israel’s “proactive approach” to seeking out new US trade agreements could serve as a model for everyone, according to the White House.",
    "link": "https://www.cnn.com/2025/04/08/politics/trump-tariff-negotiations-foreign-leaders/index.html",
    "timestamp": "2025-04-09T00:29:43Z"
  },
  {
    "title": "\"Keeping India's Interests At Forefront\": Piyush Goyal On US Tariffs",
    "description": "Union Minister for Commerce and Industry Piyush Goyal stated that the Government is working on a bilateral trade agreement as was decided between Prime Minister Modi and US President Trump in February.",
    "link": "https://www.ndtv.com/india-news/keeping-indias-interests-at-forefront-piyush-goyal-on-us-tariffs-8120717",
    "timestamp": "2025-04-09T00:29:04Z"
  },
  {
    "title": "Trump Boasts About His ‘War on the World’ Before Backtracking – But Adds, ‘It’s Our Turn’ to Rip Off Other Countries",
    "description": "President Donald Trump does not appear remotely close to changing course on his pledge to impose across-the-board tariffs on nearly all imports beginning on Wednesday.\nThe post Trump Boasts About His ‘War on the World’ Before Backtracking – But Adds, ‘It’s Ou…",
    "link": "https://www.mediaite.com/trump/trump-boasts-about-his-war-on-the-world-before-backtracking-but-adds-its-our-turn-to-rip-off-other-countries/",
    "timestamp": "2025-04-09T00:26:36Z"
  },
  {
    "title": "Trump: It's our turn to do the ripping",
    "description": "United States President Donald Trump, speaking at the National Republican Congressional Committee dinner, said it is now the country's turn to benefit from trade policies.\n\"They ripped us of...",
    "link": "https://biztoc.com/x/70cf7a01feb4aae3",
    "timestamp": "2025-04-09T00:26:22Z"
  },
  {
    "title": "Trump Touts Supreme Court Win on Deportations, Thanks El Salvador",
    "description": "A divided US Supreme Court let President Donald Trump resume using a wartime law to try to deport alleged Venezuelan gang members, giving the administration a boost in a high-profile clash over the limits of presidential power.\nGranting an emergency request b…",
    "link": "https://biztoc.com/x/2dba1702006e5635",
    "timestamp": "2025-04-09T00:26:01Z"
  },
  {
    "title": "Trump Admin Cuts Maine Prison System's 'Nonessential' Federal Funds over Trans Inmate in Women's Prison",
    "description": "President Donald Trump's administration has stopped the flow of nonessential federal funds to Maine's Department of Corrections over the case of a so-called \"transgender\" inmate who is being held in a women's prison.\nThe post Trump Admin Cuts Maine Prison Sys…",
    "link": "https://www.breitbart.com/crime/2025/04/08/trump-administration-pulls-maine-docs-nonessential-federal-funds-transgender-inmate/",
    "timestamp": "2025-04-09T00:25:20Z"
  },
  {
    "title": "DOJ: Some Jan. 6 defendants should be repaid money they sent to Congress (Kyle Cheney/Politico)",
    "description": "Kyle Cheney / Politico:\nDOJ: Some Jan. 6 defendants should be repaid money they sent to Congress  —  Prosecutors say those whose convictions were wiped out are entitled to reimbursement of the restitution they paid.  —  Jan. 6 defendants whose convictions wer…",
    "link": "https://www.memeorandum.com/250408/p159",
    "timestamp": "2025-04-09T00:25:01Z"
  },
  {
    "title": "Acting IRS head quitting over agency's deal to help Trump's immigration authorities",
    "description": "The acting head of the IRS is reportedly stepping down over a deal her agency struck with the Trump administration, according to reports.Melanie Krause has been serving as the acting commissioner of the IRS since Feb. 28, following the retirement of Doug O'Do…",
    "link": "https://www.rawstory.com/acting-irs-head-quitting-after/",
    "timestamp": "2025-04-09T00:24:27Z"
  },
  {
    "title": "SecDef Pete Hegseth Vows the US Will Take Back the Panama Canal from China’s Influence",
    "description": "In a bold declaration at the Panama Canal, Secretary of Defense Pete Hegseth reaffirmed America's commitment to the region, asserting control against foreign influences and emphasizing the canal's strategic importance.\nThe post SecDef Pete Hegseth Vows the US…",
    "link": "https://www.thegatewaypundit.com/2025/04/secdef-pete-hegseth-vows-us-will-take-back/",
    "timestamp": "2025-04-09T00:20:29Z"
  },
  {
    "title": "Trump predicts a 'thundering' midterm landslide",
    "description": "United States President Donald Trump predicted major Republican wins in the upcoming midterm elections during remarks to supporters. \"We're gonna win the midterm elections and we're gonna...",
    "link": "https://biztoc.com/x/0bc020cd78a0cfeb",
    "timestamp": "2025-04-09T00:15:23Z"
  },
  {
    "title": "Trump puts Asia on track for 'significantly lower growth,' ADB says",
    "description": "MANILA -- Emerging Asia and the rest of the global economy face \"significantly lower growth\" due to the sweeping U.S. tariffs by President Donald Trump, the chief economist of the Asian Development Bank has warned.\nAlbert Park told reporters ahead of Wednesda…",
    "link": "https://biztoc.com/x/1814f6bdb9e39616",
    "timestamp": "2025-04-09T00:15:05Z"
  },
  {
    "title": "Trump: It's our turn to do the ripping off",
    "description": "United States President Donald Trump, speaking at the National Republican Congressional Committee dinner, said it is now the country's turn to benefit from trade policies.\n\"They ripped us of...",
    "link": "https://biztoc.com/x/6b16c07bdcdc16f2",
    "timestamp": "2025-04-09T00:15:03Z"
  },
  {
    "title": "IRS Acting Commissioner Is Resigning After Deal To Share Tax Information With ICE",
    "description": "The Internal Revenue Service’s acting commissioner is resigning over a deal to share immigrants’ tax data with Immigration and Customs Enforcement.",
    "link": "https://www.huffpost.com/entry/ap-us-irs-immigration-enforcement_n_67f5bb72e4b0de127dd6c06a",
    "timestamp": "2025-04-09T00:14:42Z"
  },
  {
    "title": "Trump Ally Ken Paxton Launches Primary Challenge For Senate Seat",
    "description": "The Texas race is likely to become the GOP's most contentious and expensive 2026 primary contest.",
    "link": "https://www.huffpost.com/entry/ap-us-election-2026-texas-senate-paxton_n_67f5ba55e4b030e590e0d308",
    "timestamp": "2025-04-09T00:14:34Z"
  },
  {
    "title": "Apple flew in iPhones last-minute to avoid the tariffs",
    "description": "Summary: Apple seems to be fearing the tariffs imposed by Donald Trump, as the company flew thousands of iPhones into the U.S. just before the tariffs",
    "link": "https://www.androidheadlines.com/2025/04/apple-iphones-last-minute-avoid-tariffs.html",
    "timestamp": "2025-04-09T00:13:57Z"
  },
  {
    "title": "Washington unveils date and agenda of next Russia-US talks",
    "description": "The next round of talks aimed at improving US-Russia diplomatic ties is expected to take place in Istanbul, Türkiye, on Thursday Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615419-russia-us-talks-istanbul/",
    "timestamp": "2025-04-09T00:10:09Z"
  },
  {
    "title": "David Zaslav Halts Non-Critical WBD Employee Business Travel in Cost-Cutting Amid Trump Tariffs",
    "description": "The move is a step toward curbing \"market volatility and reduced consumer confidence,\" the CEO says in an employee memo\nThe post David Zaslav Halts Non-Critical WBD Employee Business Travel in Cost-Cutting Amid Trump Tariffs appeared first on TheWrap.",
    "link": "https://www.thewrap.com/david-zaslav-wbd-employee-business-travel-cuts-spending-trump-tariffs/",
    "timestamp": "2025-04-09T00:09:20Z"
  },
  {
    "title": "Texas AG Ken Paxton launches Senate primary challenge against Republican Sen. John Cornyn",
    "description": "It will be one of the country’s most contentious 2026 primary contests.",
    "link": "https://www.bostonherald.com/2025/04/08/election-2026-texas-senate-paxton/",
    "timestamp": "2025-04-09T00:08:43Z"
  },
  {
    "title": "Trump fails to sway many House GOP holdouts as his 'big' bill of tax breaks and spending cuts stalls",
    "description": "House Speaker Mike Johnson found himself in a familiar jam on Tuesday: Conservative Republican holdouts are stalling action on President Donald Trump's &quot;big” bill of tax breaks and spending reductions, refusing to accept a Senate GOP budget framework app…",
    "link": "https://japantoday.com/category/world/trump-fails-to-sway-many-house-gop-holdouts-as-his-%27big%27-bill-of-tax-breaks-and-spending-cuts-stalls",
    "timestamp": "2025-04-09T00:08:30Z"
  },
  {
    "title": "Texas AG Ken Paxton officially joins U.S. Senate race challenging John Cornyn",
    "description": "Texas Attorney General Ken Paxton announced Tuesday he will challenge U.S. Sen. John Cornyn in next year’s midterm elections, setting up a barnburner clash of two Republican titans that is sure to reverberate across state and national politics. The contest, t…",
    "link": "https://freerepublic.com/focus/f-news/4309830/posts",
    "timestamp": "2025-04-09T00:05:49Z"
  },
  {
    "title": "Trump administration moves to restore some terminated foreign aid programs, sources say",
    "description": "President Donald Trump's administration on Tuesday moved to reinstate at least six recently canceled U.S. foreign aid programs for emergency food assistance, six sources familiar with the matter told Reuters. The quick reversal of decisions made just days ago…",
    "link": "https://japantoday.com/category/world/exclusive-trump-administration-moves-to-restore-some-terminated-foreign-aid-programs-sources-say",
    "timestamp": "2025-04-09T00:04:42Z"
  },
  {
    "title": "Trump Believes Apple Could Manufacture iPhones in the U.S",
    "description": "U.S. President Donald Trump \"absolutely\" believes that Apple could manufacture its iPhones and other devices in the United States, Press Secretary Karoline Leavitt said today during a media briefing.\nLeavitt was asked whether Trump thought that iPhone manufac…",
    "link": "https://biztoc.com/x/e7693187a59adfd7",
    "timestamp": "2025-04-09T00:03:58Z"
  },
  {
    "title": "Federal judge rules White House's Associated Press ban unconstitutional for 'viewpoint discrimination'",
    "description": "A federal judge called on the White House to restore the Associated Press' access to press events after it was barred from the Oval Office and Air Force One.",
    "link": "https://www.foxnews.com/media/federal-judge-rules-white-houses-associated-press-ban-unconstitutional-viewpoint-discrimination",
    "timestamp": "2025-04-09T00:03:42Z"
  },
  {
    "title": "Trump’s Crypto Czar David Sacks Brutally Mocked After He Declares ‘Black Monday Hoax Is Over’ — Only to Watch Market Take a Dive",
    "description": "Turmoil from President Donald Trump's tariffs has rocked the markets over the past few days, and crypto czar David Sacks had been pretty quiet on social media on the topic. Unfortunately for Sacks, he decided to break his silence on Tuesday morning with a twe…",
    "link": "https://www.mediaite.com/online/trumps-crypto-czar-david-sacks-brutally-mocked-after-he-declares-black-monday-hoax-is-over-only-to-watch-market-take-a-dive/",
    "timestamp": "2025-04-09T00:01:42Z"
  },
  {
    "title": "As stocks slide, how worried should Americans be about retirement funds?",
    "description": "Unlike some countries, many Americans' retirement funds are tied to the stock market through a 401(k).",
    "link": "https://www.bbc.com/news/articles/c7vnz23gl11o",
    "timestamp": "2025-04-09T00:01:21Z"
  },
  {
    "title": "Hyundai to Mitsui, shipyard giants line up at India gate",
    "description": "India’s ship building ambitions take shape with the Indian PSUs set to form joint ventures with Japan’ Mitsui and South Korea’ Hyundai Heavy Industries and Hanwha for building ships.",
    "link": "https://www.livemint.com/companies/shipbuilding-facility-in-india-cochin-shipyard-hyundai-hanwha-japanese-mitsui-for-building-ships-11744103176576.html",
    "timestamp": "2025-04-09T00:00:05Z"
  },
  {
    "title": "Brazil will require visas for US, Canadian, Australian citizens",
    "description": "Sao Paulo, April 8: Brazil will reintroduce visa requirements on Thursday for US, Canadian and Australian citizens, a move that ends the country’s open entry for people of those nationalities after six years. The United States Embassy in Brasilia said Monday …",
    "link": "https://thehillstimes.in/international/brazil-will-require-visas-for-us-canadian-australian-citizens",
    "timestamp": "2025-04-09T00:00:00Z"
  },
  {
    "title": "Trump Tariffs Revive Idea Bitcoin Could Outlast Dollar",
    "description": "Analysts say US tariffs under Trump may boost Bitcoin’s appeal over the dollar, amid rising distrust in fiat currencies and limited alternatives like gold, suggesting Bitcoin’s long-term dominance.",
    "link": "https://www.c-sharpcorner.com/news/trump-tariffs-revive-idea-bitcoin-could-outlast-dollar",
    "timestamp": "2025-04-09T00:00:00Z"
  },
  {
    "title": "Middle ground: India open to zero duty on imports from US in PLI, some other sectors",
    "description": "India is considering zero-duty imports from the US in various sectors, including those under the PLI scheme, to expedite a bilateral trade agreement and reverse reciprocal tariffs. This offer hinges on strict rules of origin, requiring 30-40% value addition a…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/middle-ground-india-open-to-zero-duty-on-imports-from-us-in-pli-some-other-sectors/articleshow/120104819.cms",
    "timestamp": "2025-04-09T00:00:00Z"
  },
  {
    "title": "AP Gets Preliminary Injunction Reversing Exclusion From Oval Office Press Pool",
    "description": "I'm on the road and can't discuss this in detail, but I thought I'd pass along a few excerpts from today's decision by Judge Trevor McFadden (D.D.C.) in AP v. Budowich: About two months ago, President Donald Trump renamed the Gulf of Mexico the Gulf of Americ…",
    "link": "https://www.hoover.org/research/ap-gets-preliminary-injunction-reversing-exclusion-oval-office-press-pool",
    "timestamp": "2025-04-09T00:00:00Z"
  },
  {
    "title": "China Restricts Rare Earths Exports, Again",
    "description": "The U.S. stock market bounced back on Tuesday, making the first sizable gains ever since U.S. President Donald Trump imposed a minimum 10% tariff on all imports from 90 countries, roiling financial markets across the globe. However, oil markets have struggled…",
    "link": "https://oilprice.com/Energy/Energy-General/China-Restricts-Rare-Earths-Exports-Again.html",
    "timestamp": "2025-04-09T00:00:00Z"
  },
  {
    "title": "New video of China’s tailless, triple-engine J-36 fighter jet has military aviation community buzzing",
    "description": "New images have emerged of one of China’s futuristic fighter jets, a three-engine, tailless, flying wing aircraft Western analysts have dubbed the J-36.",
    "link": "https://www.cnn.com/2025/04/08/asia/china-new-stealth-fighter-jet-pictures-intl-hnk-ml/index.html",
    "timestamp": "2025-04-08T23:59:48Z"
  },
  {
    "title": "Russell Brand to speak on free speech at Florida college after rape charges",
    "description": "The New College of Florida on Saturday will host actor, comedian and right-wing wellness influencer Russell Brand, days after he was charged with rape and sexual assault in the United Kingdom.",
    "link": "https://www.nbcnews.com/news/us-news/russell-brand-new-college-florida-free-speech-rape-rcna200311",
    "timestamp": "2025-04-08T23:58:43Z"
  },
  {
    "title": "Oil plunges to 4-year low as trade war threatens global demand",
    "description": "West Texas Intermediate (WTI) dropped for a fifth straight day, touching $57.64 a barrel, while Brent fell below $63.",
    "link": "https://www.bloomberg.com/news/articles/2025-04-08/latest-oil-market-news-and-analysis-for-april-9",
    "timestamp": "2025-04-08T23:58:30Z"
  },
  {
    "title": "Tariffs Are Coming for the Trinket Girlies, Too",
    "description": "Will Trump’s tariffs make trinkets like Sonny Angels and Labubus more expensive? According to CNBC, toy prices could rise up to 50 percent. That includes the foreign collectibles that Gen Z is obsessed with, like Sonny Angels and Labubus.",
    "link": "http://www.thecut.com/article/will-tariffs-make-sonny-angels-and-labubus-more-expensive.html",
    "timestamp": "2025-04-08T23:55:40Z"
  },
  {
    "title": "Joe Rogan, Dave Portnoy among the Trump backers now questioning his tariff policies (Meg Kinnard/Associated Press)",
    "description": "Meg Kinnard / Associated Press:\nJoe Rogan, Dave Portnoy among the Trump backers now questioning his tariff policies  —  As President Donald Trump's tariffs roil global markets, some of the thought leaders and influential podcasters who backed the Republican's…",
    "link": "https://www.memeorandum.com/250408/p151",
    "timestamp": "2025-04-08T23:55:00Z"
  },
  {
    "title": "Celebratory mood at Mar-a-Lago despite market drop after Trump’s ‘Liberation Day’ tariffs: ‘Felt like a rally’",
    "description": "A source tells Page Six that on Thursday, the night after \"Liberation Day,\" in which Trump announced his tariff plan — guests were in \"great spirits.\"",
    "link": "https://pagesix.com/2025/04/08/society/celebratory-mood-at-mar-a-lago-despite-market-drop-after-trumps-liberation-day-tariffs-felt-like-a-rally/",
    "timestamp": "2025-04-08T23:50:16Z"
  },
  {
    "title": "China vows to fight ‘to the end’ if President Trump continues tariff war",
    "description": "Beijing/Washington, April 8: The US and China headed to a full-blown trade war Tuesday with Beijing vowing to fight America’s “blackmail” to the end and retaliate against Donald Trump’s threat to impose an additional 50 per cent tariff. If Trump executes the …",
    "link": "https://thehillstimes.in/international/china-vows-to-fight-to-the-end-if-president-trump-continues-tariff-war",
    "timestamp": "2025-04-08T23:50:00Z"
  },
  {
    "title": "Bradley Whitford Says Jeff Bezos Should 'F**king Speak Up' Against Trump",
    "description": "Star Bradley Whitford didn’t hold back in his interview with Variety: “F**king speak up!”",
    "link": "https://www.huffpost.com/entry/bradley-whitford-jeff-bezos-trump_n_67f5743de4b07ae5c64b23c1",
    "timestamp": "2025-04-08T23:47:58Z"
  },
  {
    "title": "IRS chief to quit over deal to share data with immigration authorities",
    "description": "The acting head of the Internal Revenue Service plans to resign over a new agreement to share tax data of undocumented immigrants with Homeland Security personnel, according to two people familiar with the situation. Acting IRS commissioner Melanie Krause — t…",
    "link": "https://freerepublic.com/focus/f-news/4309826/posts",
    "timestamp": "2025-04-08T23:47:11Z"
  },
  {
    "title": "Asia-Pacific markets: Trump tariffs, China yuan",
    "description": "Asia-Pacific markets are lower on Wednesday as investors brace themselves for U.S. President Donald Trump's tariffs' come into full effect.",
    "link": "https://www.cnbc.com/2025/04/09/asia-pacific-markets-trump-tariffs-china-yuan.html",
    "timestamp": "2025-04-08T23:46:15Z"
  },
  {
    "title": "I, Famously Good President Herbert Hoover, Am Imposing Tariffs to Bolster Domestic Manufacturing",
    "description": "“President Herbert Hoover signed the Smoot-Hawley Tariff Act in 1930, even as many economists warned that the levies would prompt retaliatory tariffs from other countries, which is precisely what happened… Most historians look back on Smoot-Hawley as a mistak…",
    "link": "https://www.mcsweeneys.net/articles/i-famously-good-president-herbert-hoover-am-imposing-tariffs-to-bolster-domestic-manufacturing",
    "timestamp": "2025-04-08T23:45:00Z"
  },
  {
    "title": "RFK Jr. says he plans to tell CDC to stop recommending fluoride in drinking water",
    "description": "Salt Lake City, April 8: US Health Secretary Robert F. Kennedy Jr. on Monday said he plans to tell the Centres for Disease Control and Prevention to stop recommending fluoridation in communities nationwide. Kennedy said he’s assembling a task force of health …",
    "link": "https://thehillstimes.in/international/rfk-jr-says-he-plans-to-tell-cdc-to-stop-recommending-fluoride-in-drinking-water",
    "timestamp": "2025-04-08T23:45:00Z"
  },
  {
    "title": "'I wouldn't pop the champagne': Trump aide's brag of 'colossal' win cut down by expert",
    "description": "The Supreme Court permitted President Donald Trump this week to resume mass migrant deportation flights under the Alien Enemies Act of 1798, a ruling that had many of Trump's legal critics fuming and Trump's team proclaiming victory — but it wasn't quite that…",
    "link": "https://www.rawstory.com/elie-honig/",
    "timestamp": "2025-04-08T23:42:14Z"
  },
  {
    "title": "Veteran fund manager revises Marvell position after big M&A deal",
    "description": "This is no time to let down your guard.\nThat's good advice for prizefighters, and it'll work just as well for battered investors who have seen their portfolios smacked from pillar to post after President Donald Trump announced his reciprocal tariffs on friend…",
    "link": "https://biztoc.com/x/069d24d07763e828",
    "timestamp": "2025-04-08T23:42:05Z"
  },
  {
    "title": "China Announces Surprising Counter to Trump's Tariffs: This Could End Hollywood For Good",
    "description": "China could deliver a knockout blow to Hollywood by taking fewer movies even as Hollywood has pandered to China.",
    "link": "https://www.westernjournal.com/china-announces-surprising-counter-trumps-tariffs-end-hollywood-good/",
    "timestamp": "2025-04-08T23:41:58Z"
  }
]