[
  {
    "title": "Destroying Iran's nuclear weapons is a gift to the Iranian people",
    "description": "The military strike by Israel going on in full force as this article is published. This decisive action to preserve its existence is the height of realism. It is also a golden opportunity for regime change in Tehran. Opinion.",
    "link": "https://www.israelnationalnews.com/news/409918",
    "timestamp": "2025-06-13T03:57:00Z"
  },
  {
    "title": "Trump: I knew of Israel's Iran strikes in advance",
    "description": "Trump tells Fox News he was aware of Israel’s strikes in Iran beforehand but emphasizes the US was not militarily involved: \"We will defend Israel if necessary.\"",
    "link": "https://www.israelnationalnews.com/news/409917",
    "timestamp": "2025-06-13T03:56:00Z"
  },
  {
    "title": "Appeals court temporarily blocks judge’s ruling to return control of National Guard to California",
    "description": "The court said it would hold a hearing on the matter on June 17.",
    "link": "https://www.pbs.org/newshour/politics/appeals-court-temporarily-blocks-judges-ruling-to-return-control-of-national-guard-to-california",
    "timestamp": "2025-06-13T03:54:41Z"
  },
  {
    "title": "Appeals court temporarily blocks judge's ruling to return control of National Guard to California",
    "description": "The 9th U.S. Circuit Court of Appeals has temporarily blocked a federal judge’s order that directed President Donald Trump to return control of National Guard troops to California after he deployed them there following protests in Los Angeles over immigration…",
    "link": "https://www.wsbtv.com/news/national/appeals-court/62UJANZ3GJHPXFXCACK2LTRGP4/",
    "timestamp": "2025-06-13T03:53:22Z"
  },
  {
    "title": "Iran-Israel War: Why Israel bombed Iran’s nuclear sites and what it means for global security, oil, and trade",
    "description": "Iran-Israel War news: In a dramatic escalation, Israel launched Operation Rising Lion, striking nuclear and military infrastructure deep within Iran, citing concerns over Iran's nuclear weapons program. Prime Minister Netanyahu declared it a necessary act for…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/iran-israel-war-why-israel-bombed-irans-nuclear-sites-and-what-it-means-for-global-security-oil-and-trade/articleshow/121817049.cms",
    "timestamp": "2025-06-13T03:52:28Z"
  },
  {
    "title": "Did Israel Just \"Blow Up\" Trump's Bid For an Iran Nuke Deal?",
    "description": "On Thursday, Trump said he worried a strike might sink negotiations — or maybe it would help! What Netanyahu wants seems obvious.\nThe post Did Israel Just “Blow Up” Trump’s Bid For an Iran Nuke Deal? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/12/israel-iran-attack-trump-nuke-deal/",
    "timestamp": "2025-06-13T03:51:17Z"
  },
  {
    "title": "Akazawa sees a deal with U.S. sparing Japan from higher car levies",
    "description": "Akazawa heads to the U.S. as the two nations eye a potential trade deal out of an expected summit in Canada between Trump and Prime Minister Shigeru Ishiba.",
    "link": "https://www.japantimes.co.jp/business/2025/06/13/akazawa-sixth-trade-talks-tariffs/",
    "timestamp": "2025-06-13T03:50:00Z"
  },
  {
    "title": "Sinister George Soros anti-ICE ‘plot’ emerges amid LA riots… as ‘paid’ foreign agitators are finally exposed.",
    "description": "With thanks to the Daily Mail for having brought this issue to our attention. \nArticle by James Reinl\n“President Donald Trump‘s claim that ‘paid agitators’ are wreaking havoc in Los Angeles has raised questions about the protest groups …\nThe post Sinister Geo…",
    "link": "https://www.globalresearch.ca/sinister-george-soros-anti-ice-plot-emerges-amid-la-riots-as-paid-foreign-agitators-are-finally-exposed/5890726",
    "timestamp": "2025-06-13T03:49:56Z"
  },
  {
    "title": "Trump says 'changes' are coming to immigration enforcement after complaints from farmers and the hospitality industry",
    "description": "There may be some changes coming to the Trump administration's approach to immigration enforcement. President Donald Trump said in a Truth Social post on Thursday that both farmers and \"people in the Hotel and Leisure business\" have said that his approach to …",
    "link": "https://freerepublic.com/focus/f-news/4322753/posts",
    "timestamp": "2025-06-13T03:48:31Z"
  },
  {
    "title": "Uyghur Forced Labor Continues to Plague Global Supply Chains",
    "description": "Several reports over the past two weeks have shed light on the ongoing human rights issue of Uyghur forced labor and its impact on global supply chains. The most recent report was published on Wednesday, as Donald Trump and Xi Jinping agreed to a trade deal t…",
    "link": "https://chinadigitaltimes.net/2025/06/uyghur-forced-labor-continues-to-plague-global-supply-chains/",
    "timestamp": "2025-06-13T03:47:26Z"
  },
  {
    "title": "Akazawa Sees a Deal With US Sparing Japan From Higher Car Levies",
    "description": "Japan’s top trade negotiator expects a trade deal with the US to spare Tokyo from higher auto tariffs, even if US President Donald Trump decides to increase them against other nations.",
    "link": "https://financialpost.com/pmn/business-pmn/akazawa-sees-a-deal-with-us-sparing-japan-from-higher-car-levies",
    "timestamp": "2025-06-13T03:46:28Z"
  },
  {
    "title": "Trump Administration Seeks To Distance US From Israeli Strikes On Iran",
    "description": "Marco Rubio, Trump's secretary of state and national security adviser, stressed that Israel's strikes were unilateral.",
    "link": "https://www.huffpost.com/entry/trump-admin-distances-us-israel-strikes_n_684b9dc5e4b0c4fd78ff8245",
    "timestamp": "2025-06-13T03:45:14Z"
  },
  {
    "title": "With Israel Strike, Mark Levin Wins MAGA Battle Over Trump's Iran Policy",
    "description": "When Israel struck Iran, it also capped a long-running power struggle within Trump's inner circle.",
    "link": "https://www.newsweek.com/mark-levin-trump-maga-iran-israel-strike-2084905",
    "timestamp": "2025-06-13T03:43:41Z"
  },
  {
    "title": "Oil surges, stocks fall on Middle East fears as Israel strikes Iran",
    "description": "Oil prices soared more than 12 percent and stocks sank Friday after Israel launched \"preemptive\" strikes on Iranian nuclear and military sites and warned of ...",
    "link": "https://finance.yahoo.com/news/oil-surges-stocks-fall-middle-022051146.html",
    "timestamp": "2025-06-13T03:36:52Z"
  },
  {
    "title": "Senior US Democrat condemns Israel’s ‘reckless escalation’",
    "description": "Democratic senators sharply criticized US ally Israel on Thursday for its strikes on Iran, as the White House distanced itself from the attack but Republican senators voiced gratitude to Israel. “Israel’s alarming decision to launch airstrikes on Iran is a re…",
    "link": "https://www.digitaljournal.com/world/senior-us-democrat-condemns-israels-reckless-escalation/article",
    "timestamp": "2025-06-13T03:32:20Z"
  },
  {
    "title": "Police officers file civil lawsuit seeking court order to hang Jan. 6 plaque at U.S. Capitol",
    "description": "Two police officers who defended the Capitol during the Jan. 6, 2021 attack filed a federal civil lawsuit, asking a judge to order the hanging of a plaque to honor police heroes who protected the Capitol, lawmakers and staff from rioters. The lawsuit cites a …",
    "link": "https://freerepublic.com/focus/f-news/4322749/posts",
    "timestamp": "2025-06-13T03:32:07Z"
  },
  {
    "title": "‘May God Bless the Forces of Civilization’: Netanyahu Announces Operation ‘Rising Lion’ to Roll Back Iranian Threat",
    "description": "Following the launch of Operation Rising Lion — Israel’s military campaign targeting Iran’s nuclear and missile infrastructure — Prime Minister Benjamin Netanyahu vowed decisive action, declaring Friday that the Jewish State will continue striking Iran “as lo…",
    "link": "https://www.breitbart.com/politics/2025/06/12/netanyahu-announces-operation-rising-lion-roll-back-iranian-threat/",
    "timestamp": "2025-06-13T03:28:16Z"
  },
  {
    "title": "‘I Fully Support This Attack’: John Fetterman Encourages Israel to ‘Keep Wiping Out’ Iranians",
    "description": "Sen. John Fetterman (D-PA) encouraged Israel to \"keep wiping out\" Iranian scientists and military officials after the country launched an attack on Iran.\nThe post ‘I Fully Support This Attack’: John Fetterman Encourages Israel to ‘Keep Wiping Out’ Iranians fi…",
    "link": "https://www.mediaite.com/politics/i-fully-support-this-attack-john-fetterman-encourages-israel-to-keep-wiping-out-iranians/",
    "timestamp": "2025-06-13T03:27:10Z"
  },
  {
    "title": "Donald Trump’s antics may work with Elon Musk, but not with China",
    "description": "Trump’s tactics may work against Elon Musk given that his administration has leverage over Musk’s critical business activities. But with China, it does not.",
    "link": "https://www.japantimes.co.jp/commentary/2025/06/13/world/trump-musk-china/",
    "timestamp": "2025-06-13T03:25:00Z"
  },
  {
    "title": "Australian dollar dives as Israel's strike on Iran shakes markets",
    "description": "The Australian dollar falls heavily against the US dollar, losing 1 per cent against the greenback in the space of a couple of hours on the news of Israel's air strikes on Iran. The Aussie is often seen as a proxy for global financial and political instabilit…",
    "link": "https://www.abc.net.au/news/2025-06-13/australian-dollar-dives-israel-iran-strike-geopolitical-markets/105413386",
    "timestamp": "2025-06-13T03:24:21Z"
  },
  {
    "title": "5 things to know about Alexandr Wang, the buzzy Scale AI founder",
    "description": "Mark Zuckerberg's biggest bet on Meta AI will ride on the back of a fellow dropout who has dazzled Silicon Valley over the last decade.",
    "link": "https://www.businessinsider.com/alexandr-wang-scale-ai-meta-zuckerberg-mit-dropout-net-worth-2025-6",
    "timestamp": "2025-06-13T03:23:03Z"
  },
  {
    "title": "Iran vows ‘severe punishment’ for Israeli attack",
    "description": "Iran has promised to retaliate after Israel bombed its territory Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619069-iran-vow-israel-revenge/",
    "timestamp": "2025-06-13T03:16:18Z"
  },
  {
    "title": "President Donald Trump to visit Pittsburgh for innovation summit with Senator McCormick",
    "description": "President Donald Trump is set to visit Pittsburgh to attend an innovation summit with Senator David McCormick.",
    "link": "https://www.wpxi.com/news/local/president-donald-trump-visit-pittsburgh-innovation-summit-with-senator-mccormick/EO5DCTZUURAQFGXMM4Q2C5ZEAM/",
    "timestamp": "2025-06-13T03:15:55Z"
  },
  {
    "title": "Trump Told Netanyahu Not To Attack Iran: WSJ",
    "description": "The call went unheeded.\nThe post Trump Told Netanyahu Not To Attack Iran: WSJ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-told-netanyahu-not-to-attack-iran-wsj/",
    "timestamp": "2025-06-13T03:15:06Z"
  },
  {
    "title": "Iran accuses US of 'supporting' Israel in carrying out strikes on Tehran's nuclear sites",
    "description": "Iran accused the United States of supporting Israeli military strikes on its nuclear sites. This happened after Israel launched a preemptive strike on Iranian nuclear and military locations. The US denied involvement, with Senator Rubio emphasizing their prio…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-accuses-us-of-supporting-israel-in-carrying-out-strikes-on-tehrans-nuclear-sites/articleshow/121816398.cms",
    "timestamp": "2025-06-13T03:12:46Z"
  },
  {
    "title": "Israel strikes Iran: What we know",
    "description": "JERUSALEM: Israel said on Friday (Jun 13) it had carried out strikes on Iranian nuclear and military sites, promising to continue military action \"to remove this threat.\" The strikes h",
    "link": "https://www.channelnewsasia.com/world/israel-strikes-iran-what-we-know-5179376",
    "timestamp": "2025-06-13T03:12:00Z"
  },
  {
    "title": "The road ahead after the NCAA settlement comes with risk, reward and warnings",
    "description": "Two days after the approval of a groundbreaking $2.8 billion antitrust settlement, thousands of athletic directors and department personnel traveled to Orlando, Florida, for the annual National Association of Collegiate Directors of Athletics convention.",
    "link": "https://www.nbcsports.com/college-football/news/the-road-ahead-after-the-ncaa-settlement-comes-with-risk-reward-and-warnings",
    "timestamp": "2025-06-13T03:06:36Z"
  },
  {
    "title": "Foxconn sends 97% of India iPhone exports to US as Apple tackles Trump's tariffs",
    "description": "Between March and May, 97% of iPhones exported from India by Foxconn were shipped to the U.S., highlighting Apple’s move to bypass U.S. tariffs on China. Exports hit $3.2 billion in that period. Apple is rapidly scaling Indian production, with made-in-India i…",
    "link": "https://economictimes.indiatimes.com/tech/technology/foxconn-sends-97-of-india-iphone-exports-to-us-as-apple-tackles-trumps-tariffs/articleshow/121816444.cms",
    "timestamp": "2025-06-13T03:05:58Z"
  },
  {
    "title": "After Trump feud, role of Musk's SpaceX in Golden Dome missile shield in question",
    "description": "A new framework for the U.S. missile defense system is now being considered that could reduce the role of Elon Musk's SpaceX.",
    "link": "https://www.japantimes.co.jp/news/2025/06/13/world/trump-musk-feud-golden-dome/",
    "timestamp": "2025-06-13T03:04:00Z"
  },
  {
    "title": "Walmart distances itself from Christy Walton’s ad supporting anti-Trump protest movement",
    "description": "Walmart clarified its stance after heiress Christy Walton funded a newspaper ad urging civic action tied to protests against President Donald Trump. The company emphasized Walton’s actions were independent and unrelated to any corporate involvement, amid crit…",
    "link": "https://economictimes.indiatimes.com/news/international/us/walmart-distances-itself-from-christy-waltons-ad-supporting-anti-trump-protest-movement/articleshow/121816289.cms",
    "timestamp": "2025-06-13T03:01:14Z"
  },
  {
    "title": "Trump Can And Should Fire Fed Boss Over Economy",
    "description": "Trump Can And Should Fire Fed Boss Over Economy\n \nAuthored by Christian Whiton via RealClearPolitics,\nFederal Reserve kingpin Jerome Powell is busy doing what he does best: sabotaging a prosperous economy so that President Donald Trump and his fellow Republic…",
    "link": "https://biztoc.com/x/ac5d56c6bfc2a9ae",
    "timestamp": "2025-06-13T03:00:50Z"
  },
  {
    "title": "Iran and Israel's open warfare after decades of shadow war",
    "description": "Israel confirms strikes in Iran amidst rising tensions. This action occurs before scheduled talks between Iran and the US. The conflict escalates fears of a broader war. Decades of hostility include various attacks. Key events include Iran's revolution, Hezbo…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-and-israels-open-warfare-after-decades-of-shadow-war/articleshow/121816291.cms",
    "timestamp": "2025-06-13T03:00:14Z"
  },
  {
    "title": "Inside the new documentary that captures Jacinda Ardern’s life as PM",
    "description": "The life of NZ's former Prime Minister, who is a leader, a mother, and a wife.",
    "link": "https://www.washingtonpost.com/entertainment/movies/2025/06/12/jacinda-ardern-prime-minister-documentary/",
    "timestamp": "2025-06-13T02:55:44Z"
  },
  {
    "title": "US says it was not involved in Israel's military strikes in Iran",
    "description": "Secretary of State Marco Rubio says Israel took \"unilateral action\" and warns Iran not to retaliate against US forces.",
    "link": "https://www.bbc.com/news/articles/cm2kd2k3mv7o",
    "timestamp": "2025-06-13T02:55:09Z"
  },
  {
    "title": "EXCLUSIVE: VA Dept says LA riots forced community center closures impacting more than 600 veterans",
    "description": "Veterans Affairs Secretary Doug Collins criticizes California officials as anti-ICE riots force closure of LA veterans care center, impacting over 600 veteran appointments.",
    "link": "https://www.foxnews.com/politics/exclusive-va-dept-says-la-riots-forced-community-center-closures-impacting-more-than-600-veterans",
    "timestamp": "2025-06-13T02:53:08Z"
  },
  {
    "title": "31 NGOs behind 1,000+ protests this Saturday have been exposed by \n@DataRepublican\n—and the FBI is now investigating “any and all monetary connections responsible for these riots.”",
    "description": "31 NGOs behind 1,000+ protests this Saturday have been exposed by @DataRepublican —and the FBI is now investigating “any and all monetary connections responsible for these riots.”.. This isn’t grassroots. It’s Color Revolution 2.0—a coordinated, funded insurr…",
    "link": "https://freerepublic.com/focus/f-news/4322746/posts",
    "timestamp": "2025-06-13T02:49:48Z"
  },
  {
    "title": "Attacking Iran, Israel brazenly defies ‘man of peace’ Trump",
    "description": "US President Donald Trump on Thursday implored Israel not to attack Iran and declared once again his goal was to be a peacemaker. Hours later, Israeli Prime Minister Benjamin Netanyahu, one of Trump’s closest international allies, brazenly defied his advice b…",
    "link": "https://www.digitaljournal.com/world/attacking-iran-israel-brazenly-defies-man-of-peace-trump/article",
    "timestamp": "2025-06-13T02:47:20Z"
  },
  {
    "title": "As NATO ups defence spending, can Europe produce the weapons?",
    "description": "NATO leaders meeting in The Hague this month look set to agree to a major increase in military budgets under pressure from US President Donald Trump. But as Europe promises to ramp up defence spending and wean itself from reliance on the United States, a key …",
    "link": "https://www.digitaljournal.com/world/as-nato-ups-defence-spending-can-europe-produce-the-weapons/article",
    "timestamp": "2025-06-13T02:47:20Z"
  },
  {
    "title": "Israel Strikes Iran: Top Iranian General And Nuclear Scientists Killed (Live Updates)",
    "description": "The strike comes after President Donald Trump said the U.S. was \"fairly close\" to reaching a nuclear deal with Iran.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/06/12/israel-strikes-iran-top-iranian-general-and-nuclear-scientists-killed-live-updates/",
    "timestamp": "2025-06-13T02:46:36Z"
  },
  {
    "title": "Meta files lawsuit against AI firm behind fake nonconsensual nude images",
    "description": "Meta Platforms Inc. announced today that it’s suing a company that advertised generative artificial intelligence apps on Meta’s platforms that enabled users to “nudify” people from a clothed image. The lawsuit, launched in Hong Kong against Joy Timeline HK Lt…",
    "link": "https://siliconangle.com/2025/06/12/meta-files-lawsuit-ai-firm-behind-fake-non-consensual-nude-images/",
    "timestamp": "2025-06-13T02:44:24Z"
  },
  {
    "title": "Meta has filed a lawsuit against AI firm behind fake non-consensual nude images",
    "description": "Meta Platforms Inc. announced today that it’s suing a company that advertised generative artificial intelligence apps on Meta’s platforms that enabled users to “nudify” people from a clothed image. The lawsuit, launched in Hong Kong against Joy Timeline HK Lt…",
    "link": "https://siliconangle.com/2025/06/12/meta-filed-lawsuit-ai-firm-behind-fake-non-consensual-nude-images/",
    "timestamp": "2025-06-13T02:44:24Z"
  },
  {
    "title": "Israel strikes at the heart of Iran’s nuclear programme: Netanyahu",
    "description": "In a late-night video, Netanyahu announced that Israel had struck Iran’s main enrichment facility at Natanz, as well as its nuclear weaponisation and ballistic missile programmes.",
    "link": "https://www.thehindubusinessline.com/news/world/israel-operation-rising-lion-strikes-iran-nuclear-sites-netanyahu/article69689776.ece",
    "timestamp": "2025-06-13T02:39:59Z"
  },
  {
    "title": "Trump must return control of California National Guard to the state, judge rules",
    "description": "The order, which takes effect at noon Friday, said the deployment of the Guard was illegal and both violated the Tenth Amendment and exceeded Trump's statutory authority.",
    "link": "https://www.pbs.org/newshour/nation/trump-must-return-control-of-california-national-guard-to-the-state-judge-rules",
    "timestamp": "2025-06-13T02:39:01Z"
  },
  {
    "title": "Europeans chomp popcorn while Elon Musk and Donald Trump rage-quit their bromance",
    "description": "Welcome to Declassified, a weekly humor column. Once upon a time in Mar-a-Lago, Elon Musk and Donald Trump were political soulmates — a bromance forged in tweets, Tesla stocks, and errant Truths. But alas, the relationship has frayed. And to Europeans, the sl…",
    "link": "https://www.politico.eu/article/europe-grab-popcorn-elon-musk-and-donald-trump-rage-quit-bromance/",
    "timestamp": "2025-06-13T02:34:00Z"
  },
  {
    "title": "Iran's Revolutionary Guard Chief Killed in Israel Strike, State Media Says",
    "description": "Israel struck the capital city Tehran early Friday morning local time and warned of potential drone and missile strikes to Israel and civilians.",
    "link": "https://www.newsweek.com/iran-revolutionary-guard-chief-killed-israel-strike-2084925",
    "timestamp": "2025-06-13T02:33:14Z"
  },
  {
    "title": "Trump Tries to Humiliate GOP Senator by Claiming He ‘Snuck’ Into White House Picnic",
    "description": "Donald Trump appeared to make a dig at Sen. Rand Paul by suggesting he “snuck” into Thursday night’s congressional picnic—despite having been invited after a...",
    "link": "https://www.thedailybeast.com/trump-tries-to-humiliate-gop-senator-by-claiming-he-snuck-into-white-house-picnic/",
    "timestamp": "2025-06-13T02:31:46Z"
  },
  {
    "title": "Tensions Soar As Israeli Attack Targets Iranian Military Sites, Feared to Claim Lives of Top Revolutionary Guard Officials",
    "description": "Israeli airstrikes hit key Iranian military and nuclear sites in Tehran, reportedly killing top Revolutionary Guard officials. Tensions escalate as global leaders react to the attack amid Iran's advancing nuclear program.",
    "link": "https://www.ibtimes.com/tensions-soar-israeli-attack-targets-iranian-military-sites-feared-claim-lives-top-3775495",
    "timestamp": "2025-06-13T02:30:26Z"
  },
  {
    "title": "Jon Stewart Calls ABC News “A F—ing Joke” Over Terry Moran Dismissal: “So Stupid”",
    "description": "After ABC News unceremoniously parted ways with Terry Moran, Jon Stewart is calling out a double standard in broadcast journalism. The comedian recently clarified whether he agrees with the news network’s decision not to renew the reporter’s contract over a s…",
    "link": "http://deadline.com/2025/06/jon-stewart-calls-abc-news-fing-joke-terry-moran-dismissal-1236432711/",
    "timestamp": "2025-06-13T02:28:40Z"
  },
  {
    "title": "Israel Attacks Iran’s Nuclear Program in Major Escalation",
    "description": "Israel launched waves of airstrikes against Iran’s nuclear program and ballistic-missile sites on Friday morning, a major escalation in the standoff between the two adversaries that risks sparking a wider war in the Middle East.",
    "link": "https://financialpost.com/pmn/business-pmn/israel-attacks-irans-nuclear-program-in-major-escalation",
    "timestamp": "2025-06-13T02:25:02Z"
  },
  {
    "title": "Trump throws curveball at Japan tea giant's US expansion swing",
    "description": "TOKYO :Top Japanese tea brand Ito En's latest push to win over health-conscious U.S. customers with its traditional unsweetened brew has hit a new road bump: President Donald Trump's trade tariffs.The company, which splashed out on a tie-up with Major League …",
    "link": "https://www.channelnewsasia.com/business/trump-throws-curveball-japan-tea-giants-us-expansion-swing-5179296",
    "timestamp": "2025-06-13T02:23:51Z"
  },
  {
    "title": "Israel attacks Iran's capital with explosions booming across Tehran",
    "description": "Israel has attacked Iran’s capital in strikes that targeted the country’s nuclear program and raised the potential for an all-out war between the two bitter Middle East adversaries",
    "link": "https://www.wftv.com/news/world/israel-attacks-irans/T7QPCYMQOZGWRPCU6GOBK2ZH2U/",
    "timestamp": "2025-06-13T02:22:48Z"
  },
  {
    "title": "Netanyahu Says Israel Will Continue Bombing Iran Until ‘Threat’ Is Removed",
    "description": "Netanyahu confirmed Thursday that the country will continue to bomb Iran until the \"threat\" is removed, following initial strikes already launched.",
    "link": "https://dailycaller.com/2025/06/12/benjamin-netanyahu-israel-bombing-iran-operation-rising-lion/",
    "timestamp": "2025-06-13T02:22:46Z"
  },
  {
    "title": "Oil surges, stocks fall on Middle East fears as Israel strikes Iran",
    "description": "Oil prices soared and stocks sank Friday after Israel launched “preemptive” strikes on Iran’s nuclear and military sites and warned of more to come, stoking fears of a full-blown war. Investors ran for the hills on news of the attacks and a warning that retal…",
    "link": "https://www.digitaljournal.com/world/oil-surges-stocks-fall-on-middle-east-fears-as-israel-strikes-iran/article",
    "timestamp": "2025-06-13T02:22:32Z"
  },
  {
    "title": "Israel Says It Strikes Iran Amid Nuclear Tensions",
    "description": "\"We are at a decisive moment in Israel's history,\" Israeli Prime Minister Benjamin Netanyahu said in a recorded video message.",
    "link": "https://www.huffpost.com/entry/israel-strikes-iran-nuclear-tensions_n_684b87bce4b0c4fd78ff77c5",
    "timestamp": "2025-06-13T02:22:09Z"
  },
  {
    "title": "House package included funding cuts for global health programs like PEPFAR",
    "description": "The legislation, which passed in a 214-212 vote, included a $900 million reduction in funding for global health initiatives, including $500 million for programs like PEPFAR and $400 million for USAID health programs.",
    "link": "https://justthenews.com/politics-policy/health/house-package-included-funding-cuts-global-health-programs-pepfar",
    "timestamp": "2025-06-13T02:20:34Z"
  },
  {
    "title": "Gavin Newsom Says Trump ‘Will Be Relieved Of His Command’ of National Guard By ‘Noon Tomorrow’",
    "description": "California Gov. Gavin Newsom announced that President Donald Trump would \"be relieved of his command\" of the National Guard in California by \"noon tomorrow.\"\nThe post Gavin Newsom Says Trump ‘Will Be Relieved Of His Command’ of National Guard By ‘Noon Tomorro…",
    "link": "https://www.mediaite.com/politics/gavin-newsom-says-trump-will-be-relieved-of-his-command-of-national-guard-by-noon-tomorrow/",
    "timestamp": "2025-06-13T02:19:53Z"
  },
  {
    "title": "Judge Orders Trump to Return National Guard Control to Newsom",
    "description": "ICE carried out brutal raids and arrests in Los Angeles, leading to protests — which the president has used as an excuse to send military troops into the city",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-newsom-california-national-guard-judge-order-1235363798/",
    "timestamp": "2025-06-13T02:15:51Z"
  },
  {
    "title": "Judge Orders Trump to Return Control of California National Guard to State",
    "description": "A federal judge in San Francisco ordered the Trump administration to \"return control\" of the deployed California National Guard soldiers to the State. The judge wrote that President Donald Trump did not follow the congressionally mandated procedures for his o…",
    "link": "https://www.breitbart.com/border/2025/06/12/judge-orders-trump-to-return-control-of-california-national-guard-to-state/",
    "timestamp": "2025-06-13T02:14:03Z"
  },
  {
    "title": "Israeli Defense Minister Yisrael Katz Declares State of Emergency Amid Imminent Iranian Attack",
    "description": "Defense Minister Katz declares state of emergency, urges civilians to stay in protected areas",
    "link": "https://www.ibtimes.com/israeli-defense-minister-yisrael-katz-declares-state-emergency-amid-imminent-iranian-attack-3775490",
    "timestamp": "2025-06-13T02:10:56Z"
  },
  {
    "title": "Trump ordered to return control of California National Guard to governor (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump ordered to return control of California National Guard to governor … A federal judge late Thursday ruled that the federalization of parts of California's National Guard by President Donald Trump was “illegal,” and ordered Trump to ret…",
    "link": "https://www.memeorandum.com/250612/p160",
    "timestamp": "2025-06-13T02:10:00Z"
  },
  {
    "title": "Judge temporarily bars Trump’s National Guard deployment in Los Angeles | Honolulu Star-Advertiser",
    "description": "LOS ANGELES >> A federal judge today temporarily barred President Donald Trump from deploying National Guard troops in Los Angeles amid protests over stepped-up immigration enforcement, finding that the Guard was unlawfully mobilized by Trump.",
    "link": "https://www.staradvertiser.com/2025/06/12/breaking-news/judge-temporarily-bars-trumps-national-guard-deployment-in-los-angeles/",
    "timestamp": "2025-06-13T02:08:24Z"
  },
  {
    "title": "For Trump, resolving U.S.-China trade fight comes at a cost",
    "description": "The back-and-forth to seal a deal with Beijing exposed that key U.S. industries are reliant on magnets largely sourced from China.",
    "link": "https://www.japantimes.co.jp/news/2025/06/13/asia-pacific/politics/us-china-trade-fight-cost/",
    "timestamp": "2025-06-13T02:07:00Z"
  },
  {
    "title": "Marco Rubio Confirms U.S. Not Involved in Israel's Strikes Against Iran",
    "description": "Secretary of State Marco Rubio issued a statement in response to Israel launching strikes against Iran, and confirmed that the United States is \"not involved in\" the strikes.\nThe post Marco Rubio Confirms U.S. Not Involved in Israel’s Strikes Against Iran app…",
    "link": "https://www.breitbart.com/politics/2025/06/12/marco-rubio-u-s-not-involved-israel-strikes-iran/",
    "timestamp": "2025-06-13T02:06:51Z"
  },
  {
    "title": "Democratic US Senator Alex Padilla forced to ground, handcuffed by federal agents",
    "description": "Senator Alex Padilla was forcibly removed and handcuffed by security at a Homeland Security press conference after attempting to question Secretary Kristi Noem about immigration raids in Los Angeles. The incident sparked partisan outrage, with Democrats conde…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/democratic-us-senator-alex-padilla-forced-to-ground-handcuffed-by-federal-agents/articleshow/121815250.cms",
    "timestamp": "2025-06-13T02:06:20Z"
  },
  {
    "title": "Rubio calls Israeli strikes against Iran ‘unilateral action,’ urges ‘US interests or personnel’ not to be targeted",
    "description": "U.S. Secretary of State Marco Rubio on Thursday called Israel's strikes against Iran a \"unilateral action\" and said Washington was not involved while also urging Tehran not to target U.S. interests or personnel in the region.",
    "link": "https://nypost.com/2025/06/12/us-news/rubio-calls-israeli-strikes-against-iran-unilateral-says-us-not-involved/",
    "timestamp": "2025-06-13T02:04:09Z"
  },
  {
    "title": "Federal judge orders Trump to return control of California National Guard to Newsom",
    "description": "A federal judge has ruled that President Donald Trump acted illegally when he seized control of California’s National Guard during ICE-related riots in Los Angeles. U.S. District Judge Charles R. Breyer issued the decision Thursday, siding with Governor Gavin…",
    "link": "https://freerepublic.com/focus/f-news/4322742/posts",
    "timestamp": "2025-06-13T02:03:33Z"
  },
  {
    "title": "Germany’s tough-on-migration turn leaves Afghans in perilous limbo",
    "description": "Germany, like the U.S., is closing its door to Afghans facing persecution by the Taliban.",
    "link": "https://www.politico.eu/article/germany-migration-leaves-afghans-limbo-friedrich-merz-asylum-seekers-donald-trump-us-spd-afd/",
    "timestamp": "2025-06-13T02:01:00Z"
  },
  {
    "title": "Federal Judge Sides With California Against Trump in Temporary Ruling Over National Guard Deployment",
    "description": "A federal judge sided with California in a temporary ruling against the Administration—ordering control of the National Guard in the state to be returned to Gov. Gavin Newsom.",
    "link": "https://time.com/7293803/federal-judge-breyer-ruling-california-trump-national-guard-illegal-control/",
    "timestamp": "2025-06-13T02:00:00Z"
  },
  {
    "title": "Martin Scorsese Gets Political at Sicilian Film Festival",
    "description": "Martin Scorsese celebrates U.S. Immigrants at Taormina Film Festival: \"With the exception of Native Americans, we’re all either immigrants, children of immigrants or descendants of immigrants...The country is very young. It’s 250 years old, which is nothing i…",
    "link": "https://ohnotheydidnt.livejournal.com/130725305.html",
    "timestamp": "2025-06-13T01:59:41Z"
  },
  {
    "title": "Judge rules Trump illegally used California’s National Guard in Los Angeles protests; DOJ appeals the decision | CNN Politics",
    "description": "A federal appeals court late Thursday paused a ruling that required President Donald Trump to return control of members of California’s National Guard to the state.",
    "link": "https://www.cnn.com/2025/06/12/politics/trump-national-guard-california-breyer",
    "timestamp": "2025-06-13T01:59:17Z"
  },
  {
    "title": "Gold heads for weekly gain as Middle East tensions spur safe-haven demand",
    "description": "Gold prices increased on Friday, set for a weekly gain. Middle East tensions boosted demand for safe-haven assets. A weaker dollar and expectations of Federal Reserve rate cuts supported gold. Reports indicated Israel carried out strikes on Iran. US officials…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-heads-for-weekly-gain-as-middle-east-tensions-spur-safe-haven-demand/articleshow/121815154.cms",
    "timestamp": "2025-06-13T01:57:15Z"
  },
  {
    "title": "Trump may push Albanese on defence spending, but Australia has leverage it can use, too",
    "description": "Trump may push Albanese on defence spending, but America needs its allies and partners in the Indo-Pacific perhaps more than anywhere else in the world.",
    "link": "https://theconversation.com/trump-may-push-albanese-on-defence-spending-but-australia-has-leverage-it-can-use-too-258811",
    "timestamp": "2025-06-13T01:55:56Z"
  },
  {
    "title": "Trump ordered to return control of California National Guard to governor",
    "description": "A federal judge late Thursday ruled that the federalization of parts of California’s National Guard by President Donald Trump was “illegal,” and ordered Trump to return control of the Guard to state Gov. Gavin Newsom “forthwith.” But Judge Charles Breyer stay…",
    "link": "https://freerepublic.com/focus/f-news/4322739/posts",
    "timestamp": "2025-06-13T01:54:25Z"
  },
  {
    "title": "'No Kings' protests: What to know about the June 14 rallies against Trump",
    "description": "Tom Williams/CQ-Roll Call, Inc via Getty Images",
    "link": "https://www.out.com/news/no-kings-protests-what-to-know",
    "timestamp": "2025-06-13T01:53:48Z"
  },
  {
    "title": "S&P 500 ends higher as Oracle reignites AI rally; Boeing drops",
    "description": "The S&P 500 saw gains on Thursday. Oracle's positive AI forecast boosted market confidence. Tech giants like Microsoft and Nvidia also experienced growth. However, Boeing shares declined due to a tragic plane crash in Ahmedabad. Rising Middle East tensions ad…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-ends-higher-as-oracle-reignites-ai-rally-boeing-drops/articleshow/121815121.cms",
    "timestamp": "2025-06-13T01:52:46Z"
  },
  {
    "title": "Natanz Nuclear Facility Struck... Developing...",
    "description": "Natanz Nuclear Facility Struck... Developing...\r\n\n \n \n \n (Top headline, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:'Army chief and top nuclear scientists eliminated'...\r\nMossad leads series of secret operations...\r\nIDF: 'At the end there will be no nuclear…",
    "link": "https://www.jfeed.com/news/sxrtda",
    "timestamp": "2025-06-13T01:49:36Z"
  },
  {
    "title": "LA Protests: Judge temporarily bars Trump from deploying National Guard troops in Los Angeles",
    "description": "A U.S. judge temporarily blocked President Trump from deploying the National Guard in Los Angeles due to immigration enforcement protests, asserting the mobilization was unlawful. Judge Breyer ordered the Guard to return to Governor Newsom's control, rejectin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/la-protests-judge-temporarily-bars-trump-from-deploying-national-guard-troops-in-los-angeles/articleshow/121815104.cms",
    "timestamp": "2025-06-13T01:49:29Z"
  },
  {
    "title": "Judge says Trump illegally deployed National Guard to help with LA protests, must return control",
    "description": "The order takes effect at noon Friday. It said the deployment violated the Tenth Amendment and exceeded Trump's statutory authority.",
    "link": "https://roanoke.com/news/nation-world/crime-courts/article_0282a44d-810a-5e97-8b36-a27bca42a338.html",
    "timestamp": "2025-06-13T01:49:00Z"
  },
  {
    "title": "Judge says Trump illegally deployed National Guard to help with LA protests, must return control",
    "description": "The order takes effect at noon Friday. It said the deployment violated the Tenth Amendment and exceeded Trump's statutory authority.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_79fa7d6d-e503-5785-8e53-e9a872379baf.html",
    "timestamp": "2025-06-13T01:49:00Z"
  },
  {
    "title": "Israel Strikes Iran",
    "description": "The attack comes after a frenzy of speculation that Israel was planning to take military action against Iran’s nuclear facilities.",
    "link": "http://foreignpolicy.com/2025/06/12/israel-iran-attack-us-nuclear-program/",
    "timestamp": "2025-06-13T01:45:47Z"
  },
  {
    "title": "Judge says Trump illegally deployed National Guard to help with LA protests, must return control",
    "description": "A federal judge has issued a temporary restraining order directing President Donald Trump to return control of the California National Guard to Gov. Gavin Newsom",
    "link": "https://www.wsbtv.com/news/judge-says-trump/62UJANZ3GJHPXFXCACK2LTRGP4/",
    "timestamp": "2025-06-13T01:45:05Z"
  },
  {
    "title": "Israel attacks Iran's capital with explosions booming across Tehran",
    "description": "JERUSALEM: Israel attacked Iran's capital early Friday, with explosions booming across Tehran as Israel said it targeted nuclear and military sites. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/13/israel-attacks-iran039s-capital-with-explosions-booming-across-tehran",
    "timestamp": "2025-06-13T01:45:00Z"
  },
  {
    "title": "Judge Hands Gavin Newsom Control of National Guard in Blow to Trump",
    "description": "Judge Breyer ordered that control of the National Guard be handed back to Gavin Newsom.",
    "link": "https://www.newsweek.com/judge-hands-gavin-newsom-control-national-guard-blow-trump-2084911",
    "timestamp": "2025-06-13T01:43:53Z"
  },
  {
    "title": "Trump ordered to return control of California National Guard to governor",
    "description": "A federal judge late Thursday ruled that the federalization of parts of California's National Guard by President Donald Trump was \"illegal,\" and ordered Trump to return control of the Guard to state Gov. Gavin Newsom.\nBut Judge Charles Breyer stayed his own o…",
    "link": "https://biztoc.com/x/c85e27ebc7bf81ee",
    "timestamp": "2025-06-13T01:42:56Z"
  },
  {
    "title": "US probing agency to assist in Air India crash investigation",
    "description": "Following the Air India Boeing 787 crash in Ahmedabad, the NTSB will assist the Aircraft Accident Investigation Bureau, adhering to international protocols. US President Donald Trump described the crash as \"horrific\" and offered assistance to India. Tragicall…",
    "link": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/us-probing-agency-to-assist-in-air-india-crash-investigation/articleshow/121815057.cms",
    "timestamp": "2025-06-13T01:42:45Z"
  },
  {
    "title": "North Korea Restores Damaged Warship, Plans Two More Next Year",
    "description": "North Korea said it successfully refloated a 5,000-ton destroyer that suffered damage in a botched launch attempt last month that left it foundering in shallow water, with leader Kim Jong Un vowing to build two more vessels of the same class next year as part…",
    "link": "https://www.livemint.com/companies/news/north-korea-restores-damaged-warship-plans-two-more-next-year-11749778964922.html",
    "timestamp": "2025-06-13T01:42:44Z"
  },
  {
    "title": "Federal judge orders Trump to return control of California National Guard to Newsom",
    "description": "A federal judge ruled Trump’s deployment of the California National Guard during the ICE riots was illegal and ordered control returned to Governor Gavin Newsom.",
    "link": "https://www.foxnews.com/politics/federal-judge-orders-trump-return-control-california-national-guard-newsom",
    "timestamp": "2025-06-13T01:42:09Z"
  },
  {
    "title": "Judge rules on California’s request for a temporary restraining order against Trump troop deployment",
    "description": "A federal judge has ruled on California’s request for a temporary restraining order to prevent the use of federalized National Guard troops and active-duty Marines for law enforcement purposes on the streets of Los Angeles, following protests against the Trum…",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/judge-california-tro-request-trump-los-angeles-ice-protests-rcna212175",
    "timestamp": "2025-06-13T01:40:14Z"
  },
  {
    "title": "Judge rules Trump's Guard deployment in Los Angeles is illegal (Kyle Cheney/Politico)",
    "description": "Kyle Cheney / Politico:\nJudge rules Trump's Guard deployment in Los Angeles is illegal  —  U.S. District Judge Charles Breyer ordered the president to return control of the Guard to Gov. Gavin Newsom.  —  A federal judge has ordered President Donald Trump to …",
    "link": "https://www.memeorandum.com/250612/p156",
    "timestamp": "2025-06-13T01:40:00Z"
  },
  {
    "title": "Judge Rules Trump’s Deployment of National Guard in California Illegal",
    "description": "A federal judge in California ruled on Thursday that President Donald Trump's deployment of the National Guard in the state to quell protests is illegal.\nThe post Judge Rules Trump’s Deployment of National Guard in California Illegal first appeared on Mediait…",
    "link": "https://www.mediaite.com/politics/judge-rules-trumps-deployment-of-national-guard-in-california-illegal/",
    "timestamp": "2025-06-13T01:38:04Z"
  },
  {
    "title": "Judge temporarily bars Trump from deploying national guard troops in Los Angeles",
    "description": "Trump summoned military troops to Los Angeles to support a civilian police operation over the objection of Newsom, an extraordinary and rarely used measure.",
    "link": "https://www.japantimes.co.jp/news/2025/06/13/world/crime-legal/judge-block-trump-la-troops/",
    "timestamp": "2025-06-13T01:38:00Z"
  },
  {
    "title": "Appeals court allows Trump to keep national guard in L.A. with marines on the way",
    "description": "San Francisco-based U.S. District Judge Charles Breyer had earlier found that Trump's deployment of the guard was unlawful.",
    "link": "https://www.japantimes.co.jp/news/2025/06/13/world/crime-legal/trump-la-troops/",
    "timestamp": "2025-06-13T01:38:00Z"
  },
  {
    "title": "Israel carries out strikes against Iran",
    "description": "'Dozens' of military targets, 'including nuclear targets' hit",
    "link": "https://www.wnd.com/2025/06/israel-carries-out-strikes-against-iran/",
    "timestamp": "2025-06-13T01:34:19Z"
  },
  {
    "title": "Rubio says US not involved in Israeli strikes against Iran",
    "description": "WASHINGTON: US Secretary of State Marco Rubio warned Iran late on Thursday (Jun 13) not to respond to Israeli strikes by hitting American bases, saying Washington was not involved. \"We are not involved in strikes against Iran and our top priority is protectin…",
    "link": "https://www.channelnewsasia.com/world/rubio-says-us-not-involved-israeli-strikes-against-iran-5179056",
    "timestamp": "2025-06-13T01:33:00Z"
  },
  {
    "title": "Federal judge orders Trump to restore control of National Guard to California",
    "description": "Federal judge issues restraining order against Trump's illegal National Guard deployment in California, citing the Tenth Amendment.",
    "link": "https://www.wishtv.com/news/politics/federal-judge-orders-trump-to-restore-control-of-national-guard-to-california/",
    "timestamp": "2025-06-13T01:31:48Z"
  },
  {
    "title": "Alex Padilla Tears Up Recounting His Kristi Noem Detainment on MSNBC: ‘It’s All BS Coming From Trump’ | Video",
    "description": "The California senator also tells MSNBC about his meeting with Secretary of Homeland Security Kristi Noem after the incident\nThe post Alex Padilla Tears Up Recounting His Kristi Noem Detainment on MSNBC: ‘It’s All BS Coming From Trump’ | Video appeared first …",
    "link": "https://www.thewrap.com/senator-alex-padilla-tears-up-after-forceful-removal-msnbc/",
    "timestamp": "2025-06-13T01:30:08Z"
  }
]