[
  {
    "title": "Zelensky confirms resumption of US military aid",
    "description": "The Ukrainian leader has confirmed that the flow of military aid from Western states continues Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621370-zelensky-confirms-ukraine-aid/",
    "timestamp": "2025-07-12T01:49:39Z"
  },
  {
    "title": "Judge orders Trump administration to halt indiscriminate immigration stops, arrests in California",
    "description": "Advocacy groups filed the lawsuit accusing the administration of systematically targeting brown-skinned people in the ongoing crackdown.",
    "link": "https://www.bostonherald.com/2025/07/11/immigration-raids-los-angeles-lawsuit/",
    "timestamp": "2025-07-12T01:48:43Z"
  },
  {
    "title": "Judge Orders Trump Admin To Stop Rounding People Up Based On Race In LA Immigration Raids",
    "description": "A federal judge has ordered the Trump administration to halt indiscriminate immigration stops and arrests in Southern California.",
    "link": "https://www.huffpost.com/entry/ap-us-immigration-raids-los-angeles-lawsuit_n_6871bde8e4b057caaedf4a9c",
    "timestamp": "2025-07-12T01:47:21Z"
  },
  {
    "title": "Judge orders Trump administration to halt indiscriminate immigration stops, arrests in California",
    "description": "A federal judge on Friday ordered the Trump administration to halt indiscriminate immigration stops and arrests in seven California counties, including Los...",
    "link": "https://www.yahoo.com/news/judge-orders-trump-administration-halt-014316110.html",
    "timestamp": "2025-07-12T01:43:16Z"
  },
  {
    "title": "Ty Cobb: AG Pam Bondi Is Not Going Anywhere",
    "description": "Former White House special counsel Ty Cobb said Friday on CNN's \"OutFront\" that Attorney General Pam Bondi’s job was safe because letting her go so quickly would be a \"huge embarrassment\" to President Donald Trump.\nThe post Ty Cobb: AG Pam Bondi Is Not Going …",
    "link": "https://www.breitbart.com/clips/2025/07/11/ty-cobb-ag-pam-bondi-is-not-going-anywhere/",
    "timestamp": "2025-07-12T01:42:24Z"
  },
  {
    "title": "‘Assassination culture’ makes ICE its new target — and Dems fan the flames",
    "description": "Elected officials are doing nothing to calm their base’s insane fury. Instead, they’re openly demonizing ICE agents, often comparing them to Hitler's Gestapo.",
    "link": "https://nypost.com/2025/07/11/opinion/dems-fan-the-flames-of-assassination-culture-against-ice/",
    "timestamp": "2025-07-12T01:40:03Z"
  },
  {
    "title": "Kaitlan Collins Says Trump Officials Are ‘Frustrated’ Because the Epstein ‘News Cycle Is Only Getting Worse for Them’",
    "description": "CNN's Kaitlan Collins said officials in President Donald Trump's administration are increasingly frustrated over a vicious news cycle of their own making.\nThe post Kaitlan Collins Says Trump Officials Are ‘Frustrated’ Because the Epstein ‘News Cycle Is Only G…",
    "link": "https://www.mediaite.com/media/tv/kaitlan-collins-says-trump-officials-are-frustrated-because-the-epstein-news-cycle-is-only-getting-worse-for-them/",
    "timestamp": "2025-07-12T01:39:26Z"
  },
  {
    "title": "Pentagon confirms Iran's attack on Qatar air base hit dome used for US communications",
    "description": "Satellite images show Iran's attack on a US military base in Qatar in June hit a dome housing equipment used for secure communications.",
    "link": "https://www.abc.net.au/news/2025-07-12/pentagon-confirms-irans-attack-qatar-base-dome-us-communications/105524594",
    "timestamp": "2025-07-12T01:38:14Z"
  },
  {
    "title": "Trump visits Texas flood zone, defends government's disaster response",
    "description": "President Trump visited the flood-stricken Hill Country region of Texas, defending the response to the deadly flash flooding that claimed at least 120 lives. He praised Governor Abbott and Secretary Noem's efforts, while facing questions about potential impac…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-visits-texas-flood-zone-defends-governments-disaster-response/articleshow/122398151.cms",
    "timestamp": "2025-07-12T01:37:34Z"
  },
  {
    "title": "Unraveling claim Trump lifted sanctions on Russia in June 2025",
    "description": "A change to a nuclear-related license fueled the claim that the Trump administration lifted U.S. sanctions on Russia.",
    "link": "https://www.snopes.com//news/2025/07/12/trump-lifted-sanctions-russia/",
    "timestamp": "2025-07-12T01:30:00Z"
  },
  {
    "title": "Trump grants 'total authorization' to ICE agents to protect themselves after violent California clashes",
    "description": "President Donald Trump directed Homeland Security to allow ICE agents to use \"whatever means necessary\" against protesters during operations at California cannabis farms.",
    "link": "https://www.foxnews.com/politics/trump-grants-total-authorization-ice-agents-protect-themselves-violent-california-clashes",
    "timestamp": "2025-07-12T01:21:51Z"
  },
  {
    "title": "US sanctions Cuban president, ‘regime-controlled’ luxury hotels",
    "description": "Rubio said he had sanctioned several senior officials and their 'cronies' for their 'brutality toward the Cuban people'.",
    "link": "https://www.aljazeera.com/news/2025/7/12/us-sanctions-cuban-president-regime-controlled-luxury-hotels",
    "timestamp": "2025-07-12T01:19:15Z"
  },
  {
    "title": "Country star's ex gets 'reality check' about Trump's popularity across America",
    "description": "Liberal Barstool host Brianna Chickenfry reflected on political division, expressing surprise at Trump voters in her life while advocating for respect across differences.",
    "link": "https://www.foxnews.com/media/country-stars-ex-gets-reality-check-about-trumps-popularity-across-america",
    "timestamp": "2025-07-12T01:18:32Z"
  },
  {
    "title": "EXCLUSIVE — GOP Lawmakers Introduce Resolution Marking One Year Since Trump Assassination Attempt",
    "description": "One year after the attempted assassination of President Donald J. Trump in Butler, Pennsylvania, House Republicans are pushing a resolution to condemn political violence and honor the victims of the July 13, 2024, shooting.\nThe post EXCLUSIVE — GOP Lawmakers …",
    "link": "https://www.breitbart.com/politics/2025/07/11/exclusive-gop-lawmakers-introduce-resolution-marking-one-year-since-trump-assassination-attempt/",
    "timestamp": "2025-07-12T01:18:08Z"
  },
  {
    "title": "Worker Dies After US Immigration Raid On California Farm",
    "description": "A farm worker died on Friday after being injured during a raid by US immigration agents on a legal cannabis farm in California that resulted in arrests of 200 undocumented migrants and clashes with protestors.",
    "link": "https://www.ibtimes.com/worker-dies-after-us-immigration-raid-california-farm-3778296",
    "timestamp": "2025-07-12T01:15:17Z"
  },
  {
    "title": "Americans need full answers on the Secret Service’s Trump assassination-attempt failures",
    "description": "A full year (as of Sunday) after Matthew Thomas Crooks came within a hair of killing President Donald Trump, the nation still has no good answers as to the how or why of it.",
    "link": "https://nypost.com/2025/07/11/opinion/americans-deserve-answers-on-secret-services-trump-shooting-failure/",
    "timestamp": "2025-07-12T01:14:18Z"
  },
  {
    "title": "US State Department begins layoffs in Trump’s shake-up of diplomatic corps",
    "description": "Mass layoff came days after the Supreme Court cleared the way for US president to gut entire government positions.",
    "link": "https://www.aljazeera.com/news/2025/7/12/us-state-department-begins-layoffs-in-trumps-shake-up-of-diplomatic-corps",
    "timestamp": "2025-07-12T01:13:26Z"
  },
  {
    "title": "Trump Directs DHS, ICE to Arrest Rioters Throwing Objects at ICE: 'Never Want to See a Car Carrying a Law Enforcement Officer Attacked Again'",
    "description": "President Donald Trump directed Department of Homeland Security (DHS) Secretary Kristi Noem and border czar Tom Homan to instruct ICE and DHS agents to arrest rioters throwing objects at their vehicles.\nThe post Trump Directs DHS, ICE to Arrest Rioters Throwi…",
    "link": "https://www.breitbart.com/politics/2025/07/11/trump-dhs-ice-arrest-rioters-throwing-objects/",
    "timestamp": "2025-07-12T01:13:15Z"
  },
  {
    "title": "Worker dies after US immigration raid on California farm",
    "description": "A farm worker died on Friday after being injured during a raid by US immigration agents on a legal cannabis farm in California that resulted in arrests of...",
    "link": "https://www.yahoo.com/news/worker-dies-us-immigration-raid-011218758.html",
    "timestamp": "2025-07-12T01:12:18Z"
  },
  {
    "title": "Tucker Carlson Trashes Ben Shapiro for ‘Absurd’ Epstein Comments",
    "description": "Tucker Carlson ripped fellow conservative Ben Shapiro over Shapiro's defense of the Trump administration's handling of the Jeffrey Epstein files.\nThe post Tucker Carlson Trashes Ben Shapiro for ‘Absurd’ Epstein Comments first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/tucker-carlson-trashes-ben-shapiro-for-absurd-epstein-comments/",
    "timestamp": "2025-07-12T01:11:58Z"
  },
  {
    "title": "Trump prosecutor sparks 'firestorm' with false claim judges extended his term",
    "description": "A temporary federal prosecutor appointed by President Donald Trump claimed that federal judges extended his term in office — but the judges in question came out to say they had done no such thing.According to Syracuse.com, \"Interim U.S. Attorney John A. Sarco…",
    "link": "https://www.rawstory.com/trump-prosecutor/",
    "timestamp": "2025-07-12T01:11:42Z"
  },
  {
    "title": "Canada's Carney talked tough on Trump - now some say he's backing down",
    "description": "It's another curveball in the Canada-US trade war - a new missive by US Donald Trump threatening an unexpected 35% tariff on Canadian goods starting next month. It came as the two countries engage in intense trade talks meant to produce a new deal in the comi…",
    "link": "https://freerepublic.com/focus/f-news/4328220/posts",
    "timestamp": "2025-07-12T01:08:14Z"
  },
  {
    "title": "Trump defends state and federal response to deadly Texas floods",
    "description": "Visiting the area of Texas hit by deadly flooding last week, US President Donald Trump defends government officials who have faced scrutiny over whether they could have done more to warn residents ahead of the disaster.",
    "link": "https://www.abc.net.au/news/2025-07-12/trump-defends-response-to-deadly-texas-floods-during-visit/105524630",
    "timestamp": "2025-07-12T01:03:07Z"
  },
  {
    "title": "Alyssa Farah Griffin: Epstein Issue Not Going Away with MAGA Base",
    "description": "On Friday, on CNN's \"The Lead,\" former Trump administration communications official Alyssa Farah Griffin said the MAGA base was not going to accept the current Trump administration's handling of the Epstein files.\nThe post Alyssa Farah Griffin: Epstein Issue …",
    "link": "https://www.breitbart.com/clips/2025/07/11/alyssa-farah-griffin-epstein-issue-not-going-away-with-maga-base/",
    "timestamp": "2025-07-12T01:01:50Z"
  },
  {
    "title": "CNN Analyst Shocked Americans Aren’t Afraid of Media-Created ‘Climate Crisis’",
    "description": "Meanwhile, the press intends to double down on its climate hysteria.\nThe post CNN Analyst Shocked Americans Aren’t Afraid of Media-Created ‘Climate Crisis’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/cnn-analyst-shocked-americans-arent-afraid-of-media-created-climate-crisis/",
    "timestamp": "2025-07-12T01:00:14Z"
  },
  {
    "title": "Bitcoin Soars Past $118,800—Breakout Or Brutal Bull Trap?",
    "description": "Bitcoin’s summer rally accelerated in the early hours of 11 July, when the benchmark cryptocurrency sliced through $118,000 and printed exchange highs that peaked above $118,800, depending on venue data. The spike wiped out an estimated $1.25 billion in short…",
    "link": "http://www.newsbtc.com/bitcoin-news/bitcoin-soars-118800-breakout-or-bull-trap/",
    "timestamp": "2025-07-12T01:00:11Z"
  },
  {
    "title": "CNN Data Chief Reveals 'Historic' Nature Of This 'Massive, Unforced Error' Under Trump",
    "description": "Harry Enten said the president is \"trying to get away from\" a story that doesn't appear to have lost the public's interest.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-doj-fbi-epstein-files_n_68719165e4b057caaedf378b",
    "timestamp": "2025-07-12T00:56:51Z"
  },
  {
    "title": "Texas Trump threat suspect arrested after allegedly writing 'I won’t miss' in social media post",
    "description": "A Texas man was arrested on federal charges after an alleged Facebook threat saying “I won’t miss\" ahead of Trump’s Kerrville visit after the Fourth of July flash floods.",
    "link": "https://www.foxnews.com/us/texas-trump-threat-suspect-arrested-allegedly-writing-wont-miss-social-media-post",
    "timestamp": "2025-07-12T00:55:58Z"
  },
  {
    "title": "Trump Guts State Department And Staff Warns People Should Be ‘Scared’",
    "description": "“Donald Trump likes to say he’s about America first. What we’re witnessing here is America in retreat,” Democratic Sen. Chris Van Hollen told HuffPost at a rally for 1,353 dismissed diplomats.",
    "link": "https://www.huffpost.com/entry/trump-state-department-firing_n_6871a4d0e4b07a168b4798b6",
    "timestamp": "2025-07-12T00:54:01Z"
  },
  {
    "title": "Zohran Mamdani jolted progressives. Can California candidates replicate his success?",
    "description": "California progressives, who have long struggled for influence, hope to break through to mainstream voters by challenging the establishment and rejecting corporate spending.",
    "link": "https://www.kpbs.org/news/politics/2025/07/11/zohran-mamdani-jolted-progressives-can-california-candidates-replicate-his-success",
    "timestamp": "2025-07-12T00:51:20Z"
  },
  {
    "title": "The Donald Trump Award for Outstanding Achievement in the Field of Grifting",
    "description": "Hell, I think Bari might merit a lifetime achievement award at this point: David Ellison, the chief executive of the media company Skydance, has recently held early discussions about acquiring The Free Press, the online publication co-founded by Bari Weiss, a…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/the-donald-trump-award-for-outstanding-achievement-in-the-field-of-grifting",
    "timestamp": "2025-07-12T00:48:06Z"
  },
  {
    "title": "Gregg Jarrett Explains How Brennan And Comey ‘Tried To Entrap Trump’ And Then ‘Hobbled’ His Presidency",
    "description": "Gregg Jarrett outlined on Fox Business Friday how former CIA Director John Brennan and former FBI Director James Comey manipulated intelligence to target Trump.",
    "link": "https://dailycaller.com/2025/07/11/gregg-jarrett-james-comey-john-brennan-entrap-trump/",
    "timestamp": "2025-07-12T00:45:39Z"
  },
  {
    "title": "Trump urges immigration agents to arrest 'THUGS' in violent clashes",
    "description": "Trump urged immigration agents to use 'whatever means is necessary' to arrest 'THUGS' who attack them, after violent clash in California.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/11/trump-urges-immigration-agents-arrest-thugs/84671875007/",
    "timestamp": "2025-07-12T00:41:18Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,234",
    "description": "Here are the key events on day 1,234 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/7/12/russia-ukraine-war-list-of-key-events-day-1234",
    "timestamp": "2025-07-12T00:39:49Z"
  },
  {
    "title": "'Say goodbye': ICE blasted as 'out of control' after farm raid turns deadly",
    "description": "A Mexican farmworker who reportedly fell from a greenhouse while trying to hide during a Trump administration raid on a Southern California farm has died from his injuries, the United Farm Workers union announced Friday.Federal authorities, including U.S. Imm…",
    "link": "https://www.rawstory.com/ice-raids-2673142064/",
    "timestamp": "2025-07-12T00:38:47Z"
  },
  {
    "title": "US move to lift chip software curbs on China puts India on alert",
    "description": "Regarding companies rethinking their ‘China Plus One’ strategy with the lifting of software curbs, Dixit said that companies considering investing in India for EDA development or other functions might choose to thoughtfully evaluate their timing. However, Sha…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-move-to-lift-chip-software-curbs-on-china-puts-india-on-alert/articleshow/122391334.cms",
    "timestamp": "2025-07-12T00:30:00Z"
  },
  {
    "title": "Trump visits Texas flood zone, defends disaster response",
    "description": "US President Donald Trump has defended the state and federal response to deadly flash flooding in Texas as he visited the Hill Country region, where at least 120 people, including dozens of children, were killed.",
    "link": "https://www.rte.ie/news/us/2025/0712/1523150-texas-floods/",
    "timestamp": "2025-07-12T00:28:27Z"
  },
  {
    "title": "Trump visits Texas flood zone, defends disaster response",
    "description": "US President Donald Trump has defended the state and federal response to deadly flash flooding in Texas as he visited the stricken Hill Country region, where at least 120 people, including dozens of children, perished a week ago.",
    "link": "https://www.rte.ie/news/us/2025/0712/1523150-trump-texas-flood/",
    "timestamp": "2025-07-12T00:28:27Z"
  },
  {
    "title": "A U.S.-EU trade deal hinges on cars, agriculture and Trump",
    "description": "Cars and tariff levels on agriculture have emerged as key sticking points between the European Union and the U.S., sources have said.",
    "link": "https://www.japantimes.co.jp/business/2025/07/12/economy/us-eu-trade-cars-agriculture-trump/",
    "timestamp": "2025-07-12T00:28:00Z"
  },
  {
    "title": "Fox’s Laura Ingraham Stirs the Pot on Epstein Files: ‘How Many of You Are Satisfied?’",
    "description": "Fox News host Laura Ingraham antagonized the Trump administration on Friday night amid the ongoing backlash to its handling of files related to Jeffrey Epstein.\nThe post Fox’s Laura Ingraham Stirs the Pot on Epstein Files: ‘How Many of You Are Satisfied?’ fir…",
    "link": "https://www.mediaite.com/politics/foxs-laura-ingraham-stirs-the-pot-on-epstein-files-how-many-of-you-are-satisfied/",
    "timestamp": "2025-07-12T00:26:34Z"
  },
  {
    "title": "Israeli Settlers Beat American to Death in Illegally Occupied West Bank: Family, Health Ministry",
    "description": "The Palestinian Authority's Ministry of Health and cousins of Sayfollah Musallat—also known as Saif al-Din Kamel Abdul Karim Musallat—said Friday that Israeli settlers beat the dual U.S.-Palestinian citizen to death while he was visiting family in the illegal…",
    "link": "https://www.commondreams.org/news/settler-violence-west-bank",
    "timestamp": "2025-07-12T00:23:27Z"
  },
  {
    "title": "Farmworker Dies After Fall From Greenhouse During California ICE Raid",
    "description": "A Mexican farmworker who reportedly fell from a greenhouse while trying to hide during a Trump administration raid on a Southern California farm has died from his injuries, the United Farm Workers union announced Friday.Federal authorities including U.S. Immi…",
    "link": "https://www.commondreams.org/news/farmworker-dies-after-ice-raid",
    "timestamp": "2025-07-12T00:23:04Z"
  },
  {
    "title": "'Total authorization': Trump unleashes ICE on rock-throwing 'slimeballs'",
    "description": "President Donald Trump melted down Friday on social media over \"thugs\" that he said were \"violently throwing rocks and bricks\" at federal immigration agents.Trump wrote on his Truth Social platform that he \"watched in disbelief\" as \"thugs\" hurled rocks and br…",
    "link": "https://www.rawstory.com/trump-ice-2673142039/",
    "timestamp": "2025-07-12T00:22:21Z"
  },
  {
    "title": "Melania Trump Offers 'Deepest Sympathy' to Texas Flood Victims",
    "description": "President Donald Trump said it was “hard to believe the devastation” as he visited Texas to see firsthand the damage from extreme floods that killed at least 120 people and left scores still missing in the state’s Hill Country region.\nTrump’s visit was aimed …",
    "link": "https://biztoc.com/x/4e3866baf68f485a",
    "timestamp": "2025-07-12T00:21:03Z"
  },
  {
    "title": "DHS Defends ICE Arrest that Ended in California Surgery Center",
    "description": "The Department of Homeland Security is hitting back on claims that Immigration and Customs Enforcement (ICE) agents failed to identify themselves as they detained an illegal immigrant who ran into a Southern California surgery center to escape them earlier th…",
    "link": "https://www.breitbart.com/immigration/2025/07/11/dhs-defends-ice-arrest-ended-california-surgery-center/",
    "timestamp": "2025-07-12T00:20:15Z"
  },
  {
    "title": "US slaps visa sanctions on Cuban president",
    "description": "The US has blacklisted Cuban President Miguel Diaz-Canel and his top government ministers Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621369-us-sanctions-cuba-visas/",
    "timestamp": "2025-07-12T00:19:58Z"
  },
  {
    "title": "FBI's Dan Bongino Says It's Either Him Or Pam Bondi: Reports",
    "description": "The FBI deputy director is allegedly threatening to quit after a spat with the attorney general over the Jeffrey Epstein case.",
    "link": "https://www.huffpost.com/entry/dan-bongino-pam-bondi-jeffrey-epstein-fight_n_687194a9e4b07a168b478f9d",
    "timestamp": "2025-07-12T00:19:42Z"
  },
  {
    "title": "When Ideology Trumps Economic Interests",
    "description": "Among the disasters of US President Donald Trump’s “One Big Beautiful Bill,” one is particularly stinging for political economists. The bill radically phases out the clean-energy subsidies introduced during President Joe Biden’s administration three years ago…",
    "link": "https://english.khabarhub.com/2025/12/485010/",
    "timestamp": "2025-07-12T00:15:51Z"
  },
  {
    "title": "Trump Tours Texas Flood Sites And Defends Officials Amid Mounting Questions About Response",
    "description": "President Donald Trump toured the devastation from catastrophic flooding in Texas amid mounting criticism that officials failed to warn residents quickly enough that a deadly wall of water was coming their way.",
    "link": "https://www.huffpost.com/entry/us-trump-texas-flood-fema_n_6871a599e4b07a168b479923",
    "timestamp": "2025-07-12T00:14:28Z"
  },
  {
    "title": "State Department lays off over 1,300 employees under Trump administration plan",
    "description": "The State Department is firing over 1,300 employees in line with a dramatic reorganization plan initiated by the Trump administration earlier this year. A senior State Department official said Friday the department is sending layoff notices to 1,107 civil ser…",
    "link": "https://apnews.com/article/layoffs-diplomats-state-department-trump-rubio-bfdb86767b7bd5b6570819d404a7782e",
    "timestamp": "2025-07-12T00:12:00Z"
  },
  {
    "title": "Watch: Trump Offers Hope Of God's Welcome In Heaven to Those Lost at Camp Mystic",
    "description": "President Donald Trump offered the hope of God's reception in heaven of the young girls lost at Camp Mystic during the Texas flooding.",
    "link": "https://www.westernjournal.com/watch-trump-offers-hope-gods-welcome-heaven-lost-camp-mystic/",
    "timestamp": "2025-07-12T00:11:02Z"
  },
  {
    "title": "Nancy Mace Challenges Gavin Newsom To Debate So She Can 'Emasculate' Him",
    "description": "The South Carolina Republican's attempt to own the California governor didn't go so well — and it's all Jeffrey Epstein's fault.",
    "link": "https://www.huffpost.com/entry/nancy-mace-challenges-gavin-newsom-to-debate-to-emasculate-him_n_68718c28e4b0566597f971ad",
    "timestamp": "2025-07-12T00:09:30Z"
  },
  {
    "title": "Bitcoin surges to all-time high, goes past $118,000 level",
    "description": "India Business News: As equities wobble in the face of a fresh tariff onslaught from US President Donald Trump, Bitcoin bulls are positioning for a fresh rally. Bitcoin br.",
    "link": "https://timesofindia.indiatimes.com/business/india-business/bitcoin-surges-to-all-time-high-goes-past-118000-level/articleshow/122397035.cms",
    "timestamp": "2025-07-12T00:06:29Z"
  },
  {
    "title": "Roseanne Barr Responds To President Trump's Epstein Comments",
    "description": "Roseanne Barr Responds To President Trump's Epstein Commentslittlethings.com",
    "link": "https://littlethings.com/entertainment/roseanne-barr-longtime-supporter-of-donald-trump-urges-him-to-read-the-d-room",
    "timestamp": "2025-07-12T00:05:52Z"
  },
  {
    "title": "Trump visits Texas flood sites amid search for missing",
    "description": "US President Donald Trump visited parts of Texas that were hit by floods that left at least 120 people dead, while more than 170 remain missing. United States President Donald Trump visited parts of Texas on Friday that were affected by deadly flash floods a …",
    "link": "https://www.dw.com/en/trump-visits-texas-flood-sites-amid-search-for-missing/a-73249048",
    "timestamp": "2025-07-12T00:02:00Z"
  },
  {
    "title": "Report: FBI chief Kash Patel not resigning over Epstein",
    "description": "Director reportedly is overseeing one of the largest criminal conspiracy investigations in FBI history -- a decade-long look into the coordinated effort to sabotage Trump's presidency",
    "link": "https://www.wnd.com/2025/07/report-fbi-chief-kash-patel-not-resigning-epstein/",
    "timestamp": "2025-07-12T00:01:47Z"
  },
  {
    "title": "At least four dead and 11 missing after Houthi attack on Red Sea cargo ship",
    "description": "The death toll from the attack that sank the Liberian-flagged Eternity C ship is the highest from any seaborne assault carried out by the Iranian-backed rebels in the crucial maritime trade route.",
    "link": "https://www.abc.net.au/news/2025-07-12/houthi-attack-on-eternity-c-cargo-ship-leaves-at-least-four-dead/105524590",
    "timestamp": "2025-07-12T00:01:28Z"
  },
  {
    "title": "iPhone 17 parts land in Foxconn India factory",
    "description": "Foxconn has begun importing components from China to India for the iPhone 17 assembly, signaling Apple's intent to manufacture the latest model simultaneously in both countries. Trial production is slated to commence this month, with mass production expected …",
    "link": "https://economictimes.indiatimes.com/tech/technology/iphone-17-parts-land-in-foxconn-india-factory/articleshow/122399750.cms",
    "timestamp": "2025-07-12T00:00:00Z"
  },
  {
    "title": "Canada just can't win in trade war with Trump",
    "description": "The giant North American neighbors are rushing to conclude a new trade accord by July 21 but the process is proving painful for Canada.",
    "link": "https://www.japantimes.co.jp/business/2025/07/12/economy/canada-trump-trade-focus/",
    "timestamp": "2025-07-12T00:00:00Z"
  },
  {
    "title": "iPhone 17 parts land in Foxconn India factory",
    "description": "Foxconn has begun importing components from China to India for the iPhone 17 assembly, signaling Apple's intent to manufacture the latest model simultaneously in both countries. Trial production is slated to commence this month, with mass production expected …",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/iphone-17-parts-land-in-foxconn-india-factory/articleshow/122394404.cms",
    "timestamp": "2025-07-12T00:00:00Z"
  },
  {
    "title": "Trump orders ICE to act against violent protesters",
    "description": "United States President Donald Trump said he gave \"full authorization\" to US Immigration and Customs Enforcement's (ICE) officers to arrest and jail anyone who attacks them with rocks or...",
    "link": "https://biztoc.com/x/b7a5a8d55609a985",
    "timestamp": "2025-07-11T23:58:57Z"
  },
  {
    "title": "Trump Administration Reorg Prompts Over 1,300 State Department Layoffs",
    "description": "1,107 civil servants and 246 foreign service officers were sent layoff notices Friday\nThe post Trump Administration Reorg Prompts Over 1,300 State Department Layoffs appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-administration-state-department-layoffs-july-2025/",
    "timestamp": "2025-07-11T23:56:42Z"
  },
  {
    "title": "Former Trump White House Lawyer Says Pam Bondi Isn’t Going Anywhere Amid Power Struggle: ‘It’ll Be a Huge Embarrassment’ for Trump",
    "description": "An attorney who worked in the White House during President Donald Trump's first term said Attorney General Pam Bondi's job is safe for now.\nThe post Former Trump White House Lawyer Says Pam Bondi Isn’t Going Anywhere Amid Power Struggle: ‘It’ll Be a Huge Emba…",
    "link": "https://www.mediaite.com/media/tv/former-trump-white-house-lawyer-says-pam-bondi-isnt-going-anywhere-amid-power-struggle-itll-be-a-huge-embarrassment-for-trump/",
    "timestamp": "2025-07-11T23:54:42Z"
  },
  {
    "title": "'Sundowning again': Trump's new gaffe ignites speculation of 'cognitive decline'",
    "description": "President Donald Trump gushed over his Pentagon chief's Friday morning appearance on Fox News — but sharp-eyed observers questioned the state of his cognitive health, noting there was no such appearance.Trump wrote on his Truth Social platform, \"Secretary of …",
    "link": "https://www.rawstory.com/trump-hegseth-2673142003/",
    "timestamp": "2025-07-11T23:53:45Z"
  },
  {
    "title": "Canada needs a U.S. trade deal but shouldn't have set a negotiation deadline, says Poilievre",
    "description": "Conservative Leader Pierre Poilievre says Canada urgently needs to land a trade deal with the United States but it should not have set a deadline for negotiations because U.S. President Donald Trump “will try to take advantage” of the time crunch.",
    "link": "https://www.cbc.ca/news/politics/pierre-poilievre-interview-trump-carney-1.7583565",
    "timestamp": "2025-07-11T23:52:37Z"
  },
  {
    "title": "EXCLUSIVE: Jeffrey Epstein's White House Links Exposed — And How His Friendship With Donald Trump Stretches Back Decades",
    "description": "Trump has long denied ever having close ties with the convicted sex offender",
    "link": "https://radaronline.com/p/jeffrey-epstein-white-house-links-exposed-friendship-donald-trump/",
    "timestamp": "2025-07-11T23:48:31Z"
  },
  {
    "title": "How the Trump shooting changed America",
    "description": "Donald Trump raising his fist, spitting out the words “Fight! Fight! Fight!” as blood streams down his face from a bullet wound in his ear — it is the sort of image that used to be called iconic back before that word degenerated into a synonym for famous. The…",
    "link": "https://biztoc.com/x/fe012815e5119a1f",
    "timestamp": "2025-07-11T23:47:56Z"
  },
  {
    "title": "President Trump vows to help Texas recover from deadly flood devastation",
    "description": "President Donald Trump spoke with Fox News host Will Cain about rescue efforts in Kerrville, Texas after catastrophic flash floods on \"The Will Cain Show.\"",
    "link": "https://www.foxnews.com/media/president-trump-vows-help-texas-recover-from-deadly-flood-devastation",
    "timestamp": "2025-07-11T23:45:56Z"
  },
  {
    "title": "Trump tours Texas flood sites and defends officials amid mounting questions about response",
    "description": "President Donald Trump toured the devastation from catastrophic flooding in Texas and lauded local officials amid mounting criticism that they failed to warn residents quickly enough that a deadly wall of water was coming their way. Trump met Friday with…",
    "link": "https://apnews.com/article/trump-texas-floods-fema-phase-out-b77d9681d2d39f8c201351b54ecf944f",
    "timestamp": "2025-07-11T23:42:00Z"
  },
  {
    "title": "Corey Comperatore's daughters honor him with 'Corey's Cruise'",
    "description": "Allyson and Kaylee Comperatore say organizing the event has been both emotionally difficult and deeply healing.",
    "link": "https://www.wtae.com/article/corey-comperatore-daughters-coreys-cruise/65384550",
    "timestamp": "2025-07-11T23:41:00Z"
  },
  {
    "title": "UPDATE: Kash Patel Not Resigning, Will Stay Unless President Says Otherwise — John Solomon Teases “Big Surprises” for MAGA Base in the Coming Weeks",
    "description": "Kash Patel is NOT resigning from his post at the FBI — unless the President himself removes him, according to new reports.\nThe post UPDATE: Kash Patel Not Resigning, Will Stay Unless President Says Otherwise — John Solomon Teases “Big Surprises” for MAGA Base…",
    "link": "https://www.thegatewaypundit.com/2025/07/update-kash-patel-not-resigning-will-stay-unless/",
    "timestamp": "2025-07-11T23:40:56Z"
  },
  {
    "title": "Tariff Turnaround: Treasury Department Posts Stunning June Numbers",
    "description": "Tariffs are still a small part of the government's revenue streams, but in this case, they made all the difference.",
    "link": "https://www.westernjournal.com/tariff-turnaround-treasury-department-posts-stunning-june-numbers/",
    "timestamp": "2025-07-11T23:38:22Z"
  },
  {
    "title": "KBJ Keeps Showing America Why She Doesn’t Belong On SCOTUS",
    "description": "The more Jackson opens her mouth and pens unhinged opinions, the more clear it becomes she has no business being on SCOTUS.When the time came to pick a replacement for retiring Supreme Court Justice Stephen Breyer, then-President Joe Biden made it very clear …",
    "link": "https://freerepublic.com/focus/f-news/4328204/posts",
    "timestamp": "2025-07-11T23:32:44Z"
  },
  {
    "title": "San Diego and other municipalities sue over grant funding conditions",
    "description": "San Diego and dozens of other cities are taking federal agencies to court, claiming they're being strong-armed into supporting President Trump's policies in exchange for billions in grant funding.",
    "link": "https://www.kpbs.org/news/politics/2025/07/11/san-diego-and-other-municipalities-sue-over-grant-funding-conditions",
    "timestamp": "2025-07-11T23:29:08Z"
  },
  {
    "title": "Ukraine-Russia war latest: Putin ‘will be seeing things happen’, warns Trump after Kharkiv maternity ward hit",
    "description": "Donald Trump issued an ominous warning to Vladimir Putin after a maternity ward was struck by drones in Ukraine. The US president responded to news that drones had damaged a maternity hospital in Kharkiv, as he said: “I know. You'll be seeing things happen.” …",
    "link": "https://freerepublic.com/focus/f-news/4328198/posts",
    "timestamp": "2025-07-11T23:27:12Z"
  },
  {
    "title": "U.S. State Department starts firing more than 1,350 workers in shake-up",
    "description": "Critics of President Donald Trump say the move will undermine Washington's ability to defend and promote U.S. interests abroad.",
    "link": "https://www.japantimes.co.jp/news/2025/07/12/world/politics/us-state-department-firing-1350/",
    "timestamp": "2025-07-11T23:26:00Z"
  },
  {
    "title": "Breitbart Business Digest: American Economic Optimism Rises to Highest Levels in Years",
    "description": "One of the best kept secrets in the world today is that Americans are feeling far better about the economy than they have in years.\nThe post Breitbart Business Digest: American Economic Optimism Rises to Highest Levels in Years appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/11/breitbart-business-digest-american-economic-optimism-rises-to-highest-levels-in-years/",
    "timestamp": "2025-07-11T23:20:08Z"
  },
  {
    "title": "Israeli settlers beat to death US citizen in West Bank, family says",
    "description": "Rights advocates call on the Trump administration to ensure accountability for the killing of Sayfollah Musallet.",
    "link": "https://www.aljazeera.com/news/2025/7/11/israeli-settlers-beat-to-death-us-citizen-in-west-bank-family-says",
    "timestamp": "2025-07-11T23:15:25Z"
  },
  {
    "title": "The Gender Gap Grows Wider, Deeper",
    "description": "The gender gap, we’re informed by some of the best polling analysts in the business, is bigger than ever. Ever, in this case, means since... Read More\nThe post The Gender Gap Grows Wider, Deeper appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/11/gender-gap-grows-wider-deeper/",
    "timestamp": "2025-07-11T23:10:13Z"
  },
  {
    "title": "Canada's Carney's talked tough on Trump - now some say he's backing down",
    "description": "Canada has made concessions to win goodwill with the White House. Trump, in return, has threatened steeper tariffs.",
    "link": "https://www.bbc.com/news/articles/cvg81518yyyo",
    "timestamp": "2025-07-11T23:05:58Z"
  },
  {
    "title": "US sending special envoy after weapons deliveries resumed, says Ukraine",
    "description": "US envoy Keith Kellogg will travel to Kyiv early next week, according to Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.aljazeera.com/news/2025/7/11/us-sending-special-envoy-after-weapons-deliveries-resumed-says-ukraine",
    "timestamp": "2025-07-11T23:05:05Z"
  },
  {
    "title": "Curt Mills: Is Trump Still 'America First'?",
    "description": "What is the \"Trump doctrine\"? Just asking questions.\nPresident Donald Trump won his first term in office after breaking with the Republican establishment on a few fronts. One notable example: On the debate stage in 2016, he embarrassed Jeb Bush for his family…",
    "link": "https://biztoc.com/x/393a82470616addd",
    "timestamp": "2025-07-11T23:03:05Z"
  },
  {
    "title": "Trump tours catastrophic flood damage in central Texas, defends state and federal response",
    "description": "President Trump and the first lady visited central Texas on Friday, surveying the catastrophic damage and offering comfort to families who lost loved ones in last week's floods. The death toll stands at 120 and at least 160 people are missing. Amna Nawaz repo…",
    "link": "https://www.pbs.org/newshour/show/trump-tours-catastrophic-flood-damage-in-central-texas-defends-state-and-federal-response",
    "timestamp": "2025-07-11T22:55:36Z"
  },
  {
    "title": "Administrator Loeffler Joins President Trump to Offer Federal Support in Wake of Texas Disaster",
    "description": "Federal Officials Mobilize Aid to Help Small Businesses and Communities Recover After Devastating Floods Federal Officials Mobilize Aid to Help Small Businesses and Communities Recover After Devastating Floods",
    "link": "https://www.globenewswire.com/news-release/2025/07/11/3114305/0/en/Administrator-Loeffler-Joins-President-Trump-to-Offer-Federal-Support-in-Wake-of-Texas-Disaster.html",
    "timestamp": "2025-07-11T22:55:00Z"
  },
  {
    "title": "Don’t Exclude The World From The World Cup",
    "description": "Instead of the 2026 World Cup fostering global harmony, US President Trump’s immigration policies tell the world to stay away—and inspire fear in those who live here.",
    "link": "https://www.forbes.com/sites/minkyworden/2025/07/11/dont-exclude-the-world-from-the-world-cup/",
    "timestamp": "2025-07-11T22:54:54Z"
  },
  {
    "title": "This Is Not Keanu: Inside the Billion-Dollar Celebrity Impersonation Bitcoin Scam",
    "description": "Victims think they’re talking to Keanu Reeves. Or Kevin Costner. Then come the pleas for cash. The brazen AI-fueled con that fleeces lovestruck fans and has Hollywood finally fighting back. In November, Margaret climbed into her Toyota Camry, left her husband…",
    "link": "https://freerepublic.com/focus/f-news/4328193/posts",
    "timestamp": "2025-07-11T22:54:11Z"
  },
  {
    "title": "Curt Mills: Is Trump Still 'America First'?",
    "description": "The executive director of The American Conservative discusses Trump's meeting with Netanyahu, support for Ukraine, MAGA schisms, and the president's \"grand strategy\" on the latest episode of Just Asking Questions.",
    "link": "https://reason.com/podcast/2025/07/11/curt-mills-is-trump-still-america-first/",
    "timestamp": "2025-07-11T22:53:51Z"
  },
  {
    "title": "Debunking claim Trump ranted about washing machines during statement about July 2025 Texas floods",
    "description": "U.S. President Donald Trump said \"You know, it's called rain. It rains a lot in certain places... I opened it, they close it, washing machines to wash your dishes\" in reference to deadly Texas floods.",
    "link": "https://www.snopes.com//fact-check/trump-texas-floods-washing-machines/",
    "timestamp": "2025-07-11T22:52:00Z"
  },
  {
    "title": "Sanctuary California: ICE Agents Find 10 Migrant Children on Marijuana Farm, Arrest Nearly 200 Illegal Aliens",
    "description": "The Immigration and Customs Enforcement (ICE) has opened a child labor trafficking investigation into two marijuana farms after agents found 10 migrant children during a raid that saw almost 200 illegal aliens arrested.\nThe post Sanctuary California: ICE Agen…",
    "link": "https://www.breitbart.com/politics/2025/07/11/sanctuary-california-ice-agents-find-10-migrant-children-on-marijuana-farm-arrest-nearly-200-illegal-aliens/",
    "timestamp": "2025-07-11T22:51:47Z"
  },
  {
    "title": "Fallout over Epstein files cascades, roiling relations between AG Pam Bondi and FBI’s Dan Bongino",
    "description": "The turmoil lays bare the struggles to resolve the conspiracy theories they had stoked.",
    "link": "https://www.denverpost.com/2025/07/11/epstein-investigation-fallout-bondi-bongino/",
    "timestamp": "2025-07-11T22:51:02Z"
  },
  {
    "title": "Fallout over Epstein files cascades, roiling relations between AG Pam Bondi and FBI’s Dan Bongino",
    "description": "The turmoil lays bare the struggles to resolve the conspiracy theories they had stoked.",
    "link": "https://www.bostonherald.com/2025/07/11/epstein-investigation-fallout-bondi-bongino/",
    "timestamp": "2025-07-11T22:51:02Z"
  },
  {
    "title": "‘Big, Beautiful’ Law to Supercharge School Choice, Advocate Says",
    "description": "School choice advocates are celebrating the One Big, Beautiful Bill’s unprecedented creation of a federal school choice benefit that could empower parents across the country.... Read More\nThe post ‘Big, Beautiful’ Law to Supercharge School Choice, Advocate Sa…",
    "link": "https://www.dailysignal.com/2025/07/11/big-beautiful-law-to-supercharge-school-choice-advocate-says/",
    "timestamp": "2025-07-11T22:50:00Z"
  },
  {
    "title": "Axios: Bongino, Bondi at Odds Over Handling of Epstein Case Files",
    "description": "Federal Bureau of Investigation (FBI) Deputy Director Dan Bongino and Attorney General Pam Bondi are reportedly at odds over Bondi's handling of files related to convicted sex criminal Jeffrey Epstein, according to Axios.\nThe post Axios: Bongino, Bondi at Odd…",
    "link": "https://www.breitbart.com/politics/2025/07/11/axios-bongino-bondi-at-odds-over-handling-of-epstein-case-files/",
    "timestamp": "2025-07-11T22:45:06Z"
  },
  {
    "title": "Trump Says Texas Devastation ‘Hard to Believe’",
    "description": "President Donald Trump said it was “hard to believe the devastation” as he visited Texas to see firsthand the damage from extreme floods that killed at least 120 people and left scores still missing in the state’s Hill Country region.\nTrump’s visit was aimed …",
    "link": "https://biztoc.com/x/9ddc8cae1fa2cbeb",
    "timestamp": "2025-07-11T22:40:22Z"
  }
]