[
  {
    "title": "Imagine if Obama (an infinite series)",
    "description": "Anyone who supports Donald Trump is some combination of incredibly stupid and an objectively horrible person.  President Donald Trump posted an artificial intelligence-generated image of himself dressed as pope as the mourning of Pope Francis continues and ju…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/imagine-if-obama-an-infinite-series",
    "timestamp": "2025-05-04T12:41:00Z"
  },
  {
    "title": "How the stock market made back all its losses after Trump escalated the trade war",
    "description": "It felt much longer, but the U.S. stock market needed just a few weeks to roar all the way back to where it was on President Donald Trump’s “Liberation Day.” That’s when he shocked Wall Street by announcing much steeper tariffs than expected on nearly all U.S…",
    "link": "https://www.bostonherald.com/2025/05/04/how-the-stock-market-made-back-all-its-losses-after-trump-escalated-the-trade-war/",
    "timestamp": "2025-05-04T12:40:38Z"
  },
  {
    "title": "Trump’s Push For Deep-Sea Metals Clashes With UN Ocean Treaty",
    "description": "By Todd Woody May 1, 2025 (Bloomberg) –President Donald Trump first set his sights on Canada and Greenland’s mineral resources. Now he’s eyeing the global seabed that holds vast troves of critical metals for green technologies...",
    "link": "https://gcaptain.com/trumps-push-for-deep-sea-metals-clashes-with-un-ocean-treaty/",
    "timestamp": "2025-05-04T12:40:01Z"
  },
  {
    "title": "Thanks to Donald Trump, a party blamed by Netanyahu for antisemitism just won reelection",
    "description": "Trump's tariffs and threats helped deliver surprise wins to left-leaning parties in Canada and Australia – developments that may deepen Netanyahu's challenges amid growing domestic frustration and international isolation",
    "link": "https://www.haaretz.com/world-news/asia-and-australia/2025-05-04/ty-article/.premium/thanks-to-donald-trump-a-party-blamed-by-netanyahu-for-antisemitism-just-won-reelection/00000196-9afa-d1ea-ad97-fbfb5a360000",
    "timestamp": "2025-05-04T12:37:01Z"
  },
  {
    "title": "New York Times Mocks Rural California Town for Not Using Mainstream Media",
    "description": "The New York Times mocked residents of a small town in California's rural Central Valley on Saturday for not using mainstream media sources, blaming their ignorance for a militia that showed up -- five years ago.\nThe post New York Times Mocks Rural California…",
    "link": "https://www.breitbart.com/the-media/2025/05/04/new-york-times-mocks-rural-california-town-for-not-using-mainstream-media/",
    "timestamp": "2025-05-04T12:35:36Z"
  },
  {
    "title": "Missile fired by Yemen's Houthis lands near Israel's main airport",
    "description": "A missile fired by Yemen's Houthi rebels toward Israel on Sunday landed near Ben Gurion Airport, the country's main international airport, sending a plume of smoke into the air and causing panic among passengers in the terminal building.",
    "link": "https://www.cbc.ca/news/world/yemen-missile-israel-airport-1.7526078",
    "timestamp": "2025-05-04T12:34:19Z"
  },
  {
    "title": "Quinta Brunson Packs A Punch On ‘SNL’ With Benson Boone And Sabrina Carpenter",
    "description": "Quinta Brunson hosts for the second time with musical guest Benson Boone and appearances by Sabrina Carpenter and Dwyane Wade.",
    "link": "https://www.forbes.com/sites/rosaescandon/2025/05/04/quinta-brunson-packs-a-punch-on-snl-with-benson-boone-and-sabrina-carpenter/",
    "timestamp": "2025-05-04T12:31:44Z"
  },
  {
    "title": "What led to Mike Waltz’s ouster as Trump’s national security adviser?",
    "description": "The Signal group chat scandal and Waltz's hawkish stance on Iran are being touted as the reasons for his ouster as NSA.",
    "link": "https://www.aljazeera.com/news/2025/5/4/what-led-to-mike-waltzs-ouster-as-trumps-national-security-adviser",
    "timestamp": "2025-05-04T12:31:01Z"
  },
  {
    "title": "‘Everything is lining up’ — Tokenization is having its breakout moment",
    "description": "Tokenization of real-world assets (RWAs) is evolving from an abstract concept to a practical financial tool as institutional players increasingly test and deploy blockchain-based infrastructure at scale.This past week alone saw a flurry of announcements from …",
    "link": "https://cointelegraph.com/news/tokenization-breakout-moment-blackrock-multibank-telegram",
    "timestamp": "2025-05-04T12:30:08Z"
  },
  {
    "title": "Climate change is making coffee more expensive. Tariffs likely will too",
    "description": "Premium coffee roasters in the U.S. are reeling from the sharp price increases of coffee beans, which nearly doubled last year after record drought in Brazil.",
    "link": "https://richmond.com/news/nation-world/business/article_877e0d5a-c216-50e0-a6c6-56131e868204.html",
    "timestamp": "2025-05-04T12:30:00Z"
  },
  {
    "title": "Cuts have eliminated more than a dozen US government health-tracking programs",
    "description": "More than a dozen data-gathering programs that track deaths and disease appear to have been eliminated in the tornado of layoffs and proposed budget cuts in the Trump administration’s first 100 days",
    "link": "https://abcnews.go.com/US/wireStory/cuts-eliminated-dozen-us-government-health-tracking-programs-121444191",
    "timestamp": "2025-05-04T12:22:39Z"
  },
  {
    "title": "Houthis Hit Ben Gurion Airport with Missile; Israel Weighs Response; Iran Possible Target",
    "description": "A ballistic missile fired by the Iranian-backed Houthi rebels in Yemen struck the ground inside the perimeter of Israel's Ben Gurion Airport on Sunday, leading Israeli officials to prepare a response to Yemen -- or Iran.\nThe post Houthis Hit Ben Gurion Airpor…",
    "link": "https://www.breitbart.com/middle-east/2025/05/04/houthis-hit-ben-gurion-airport-with-missile-israel-weighs-response-iran-possible-target/",
    "timestamp": "2025-05-04T12:21:36Z"
  },
  {
    "title": "Berkshire shareholders reject diversity, AI proposals",
    "description": "Also voted down were proposals requiring Berkshire's board of directors to create a committee to oversee diversity and inclusion, having independent directors oversee AI-related risks, and requiring a report on \"voluntary\" environmental activities that exceed…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/berkshire-shareholders-reject-diversity-ai-proposals/articleshow/120872046.cms",
    "timestamp": "2025-05-04T12:21:25Z"
  },
  {
    "title": "Trump says a short-term economic recession will be ‘OK’",
    "description": "Meet the Press moderator Kristen Welker joins Sunday TODAY’s Willie Geist with a preview of her interview with President Donald Trump including their discussion around growing recession concerns.",
    "link": "https://www.today.com/video/trump-says-a-short-term-economic-recession-will-be-ok-238868037792",
    "timestamp": "2025-05-04T12:17:28Z"
  },
  {
    "title": "Trump says a short-term economic recession will be ‘OK’",
    "description": "Meet the Press moderator Kristen Welker joins Sunday TODAY’s Willie Geist with a preview of her interview with President Donald Trump including their discussion around growing recession concerns.",
    "link": "https://www.today.com/video/trump-downplays-recession-concerns-the-country-will-be-ok-238868037792",
    "timestamp": "2025-05-04T12:17:28Z"
  },
  {
    "title": "Musk reacts to VIDEO of forced mobilization in Ukraine",
    "description": "Recruiters in the city of Lutsk violently detained a deliveryman, according to a video on social media Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616739-musk-ukraine-mobilization-video/",
    "timestamp": "2025-05-04T12:17:20Z"
  },
  {
    "title": "'SNL' roasts Trump for posting an AI image of himself as the pope",
    "description": "Colin Jost joked that Trump must have walked past Pope Francis' open casket and thought, \"Oh, we should do a 'who wore it best?'\"",
    "link": "https://www.businessinsider.com/trump-pope-ai-image-snl-2025-5",
    "timestamp": "2025-05-04T12:10:43Z"
  },
  {
    "title": "Sunday Morning Talk Show Thread 4 May 2025",
    "description": "The Talk ShowsMay 4th, 2025 Guests to be interviewed today on major television talk shows:FACE THE NATION (CBS): Margaret Brennan anchors: Sen. Tammy Duckworth (D-Ill.); Rep. Mike Turner (R-Ohio); Ukrainian Ambassador Oksana Markarova; retired Gen. H.R. McMas…",
    "link": "https://freerepublic.com/focus/f-news/4314960/posts",
    "timestamp": "2025-05-04T12:03:05Z"
  },
  {
    "title": "These landlords accrued years of complaints and serious health violations. Denver handed them rental licenses anyway.",
    "description": "A Denver Post investigation found the city has handed out licenses to building owners with years of documented violations, who then continue to neglect their tenants.",
    "link": "https://www.denverpost.com/2025/05/04/denver-rental-license-complaints-landlords/",
    "timestamp": "2025-05-04T12:00:40Z"
  },
  {
    "title": "What the F----? Democrats turn to profanity instead of policy",
    "description": "Democrats aren't getting their message across to the American voter, so they turn to curse words for emphasis. It shows they prefer style over substance and F-bombs over policy.",
    "link": "https://www.foxnews.com/opinion/what-f-democrats-turn-profanity-instead-policy",
    "timestamp": "2025-05-04T12:00:10Z"
  },
  {
    "title": "'Dumpster fire': Retailers urge shoppers to buy now before tariffs raise prices",
    "description": "Retailers contending with the effects tariffs will have on their businesses are urging consumers to buy now in a bid to boost sales before spending drops.",
    "link": "https://www.cnbc.com/2025/05/04/retailers-urge-shoppers-to-buy-before-trump-tariffs-raise-prices.html",
    "timestamp": "2025-05-04T12:00:01Z"
  },
  {
    "title": "Asylum-seeking Honduran mother is still sitting in an Aurora ICE center six months after being detained",
    "description": "A Honduran mother of two was detained by ICE while delivering a food order to Buckley Space Force Base in Aurora. As she waits in detention months later, she still has questions.",
    "link": "https://www.denverpost.com/2025/05/04/ice-aurora-immigrant-detained-honduras-doordash/",
    "timestamp": "2025-05-04T12:00:01Z"
  },
  {
    "title": "As Trump Cuts Health, More May Exit Obamacare Like CVS Health’s Aetna",
    "description": "More health insurers may follow CVS Health's Aetna and exit Obamacare if President Trump and the Republican Congress continue to cut healthcare spending.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/05/04/as-trump-cuts-health-more-may-exit-obamacare-like-cvs-healths-aetna/",
    "timestamp": "2025-05-04T12:00:00Z"
  },
  {
    "title": "How Do You Do, Fellow White People? Tim Walz Says Hello!",
    "description": "Former vice-presidential candidate Tim Walz recently told an audience at Harvard’s Kennedy School that former Vice President Kamala Harris chose him as a running mate... Read More\nThe post How Do You Do, Fellow White People? Tim Walz Says Hello! appeared firs…",
    "link": "https://www.dailysignal.com/2025/05/04/how-do-you-do-fellow-white-people-tim-walz-says-hello/",
    "timestamp": "2025-05-04T12:00:00Z"
  },
  {
    "title": "What happens if Amtrak gets privatized?",
    "description": "Experts warn it would lead to higher prices, worse service, and a major reduction in rural routes.\nThe post What happens if Amtrak gets privatized?  appeared first on Popular Science.",
    "link": "https://www.popsci.com/science/amtrak-privatized/",
    "timestamp": "2025-05-04T12:00:00Z"
  },
  {
    "title": "Trump's endorsed candidate for pope disagrees with AI-generated post of US president as pontiff",
    "description": "Yesterday, Trump posted an AI-generated image of himself donning pope regalia on social media.",
    "link": "https://www.thejournal.ie/trump-posts-picture-of-himself-as-the-pope-6695718-May2025/",
    "timestamp": "2025-05-04T11:59:37Z"
  },
  {
    "title": "Pritzker and Ocasio-Cortez: A billionaire and a former bartender emerge as Trump resistance leaders",
    "description": "Democrats are looking for the right message and messengers to lead the opposition to President Donald Trump in his second term",
    "link": "https://abcnews.go.com/US/wireStory/pritzker-ocasio-cortez-billionaire-former-bartender-emerge-trump-121444008",
    "timestamp": "2025-05-04T11:58:39Z"
  },
  {
    "title": "America’s long history of ‘checks and balances’ is being tested by Trump like rarely before",
    "description": "The principle of “checks and balances” is rooted in the Constitution’s design of a national government with three distinct, coequal branches",
    "link": "https://abcnews.go.com/US/wireStory/americas-long-history-checks-balances-tested-trump-rarely-121443827",
    "timestamp": "2025-05-04T11:58:25Z"
  },
  {
    "title": "JOSH HAMMER: The Art Of A Second Iran Deal",
    "description": "President Donald Trump's first 100 days were the fastest and most frenzied 100 days in modern presidential history.",
    "link": "https://dailycaller.com/2025/05/04/opinion-the-art-of-a-second-iran-deal-josh-hammer/",
    "timestamp": "2025-05-04T11:57:38Z"
  },
  {
    "title": "Trump to meet Gulf leaders in Riyadh: source close to Saudi govt",
    "description": "US President Donald Trump is set to visit Riyadh later this month, marking his first foreign trip of his second term. He will meet with leaders of the Gulf Cooperation Council to strengthen political and economic ties. Ahead of the visit, the US approved a $3…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-to-meet-gulf-leaders-in-riyadh-source-close-to-saudi-govt/articleshow/120871317.cms",
    "timestamp": "2025-05-04T11:57:35Z"
  },
  {
    "title": "'Oh, come on': Trump's DOJ hamstrung by loss of credibility with judges",
    "description": "The deference that judges have traditionally extended to lawyers representing the Department of Justice (DOJ) has quickly evaporated under Donald Trump and his Attorney General Pam Bondi.According to a report from the Washington Post, it has become a common o…",
    "link": "https://www.rawstory.com/trump-2671889484/",
    "timestamp": "2025-05-04T11:54:57Z"
  },
  {
    "title": "The Destruction of the Department of Justice",
    "description": "When people at the department embrace Trump’s scorn for the law, the law, as a practical limitation on government action, ceases to exist.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/05/trump-destroying-doj/682681/",
    "timestamp": "2025-05-04T11:53:04Z"
  },
  {
    "title": "Putin: 'I hope we won't have to use nuclear weapons'",
    "description": "Russian president makes threat regarding Russia's nuclear arsenal, says Russia can bring his war in Ukraine to a \"logical conclusion.\"",
    "link": "https://www.israelnationalnews.com/news/407811",
    "timestamp": "2025-05-04T11:51:19Z"
  },
  {
    "title": "Trump Lawyers Behaving Badly",
    "description": "U.S. President Donald Trump directed\r\n Attorney General Pam Bondi “to seek sanctions against attorneys and law firms who engage in frivolous, unreasonable, and vexatious litigation,” including legal filings for improper purposes and statements that are not ba…",
    "link": "https://www.commondreams.org/opinion/trump-lawyers-behaving-badly",
    "timestamp": "2025-05-04T11:48:02Z"
  },
  {
    "title": "No, Trump is not a fascist. He is a hypercapitalist and just as dangerous",
    "description": "Trump wants to free big capital from the constraints of democracy by dismantling it.",
    "link": "https://www.aljazeera.com/opinions/2025/5/4/no-trump-is-not-a-fascist-he-is-a-hypercapitalist-and-just-as-dangerous",
    "timestamp": "2025-05-04T11:46:08Z"
  },
  {
    "title": "Trump’s Crypto Czar Issues Surprise Prediction As The Bitcoin Price Suddenly Soars",
    "description": "U.S. president Donald Trump’s crypto czar David Sacks has predicted a coming “Trump boom\"...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/05/04/trumps-crypto-czar-issues-surprise-prediction-as-bitcoin-price-suddenly-soars/",
    "timestamp": "2025-05-04T11:45:38Z"
  },
  {
    "title": "Chinese president to visit Russia on May 7-10: Kremlin",
    "description": "MOSCOW - Chinese President Xi Jinping will visit Russia on May 7-10 and join his Russian counterpart Vladimir Putin at commemorations of the Allied victory against Nazi Germany, the Kremlin said on Sunday.",
    "link": "https://www.bangkokpost.com/world/3017590/chinese-president-to-visit-russia-on-may-7-10-kremlin",
    "timestamp": "2025-05-04T11:45:00Z"
  },
  {
    "title": "Elon Musk Weighs in on Eventful Year: 'At Least I Didn't Get Shot'",
    "description": "\"It's not been boring, that's for sure—an eventful year to say the least,\" the Tesla CEO said in an interview with Lara Trump.",
    "link": "https://www.newsweek.com/elon-musk-fox-news-interview-doge-2067783",
    "timestamp": "2025-05-04T11:44:15Z"
  },
  {
    "title": "Golda Meir quoted in Ukraine",
    "description": "Head of Ukraine President's Office, Andriy Yermak, mentions Meir's birthday and compares Israel's wars to the Ukraine-Russia war.",
    "link": "https://www.israelnationalnews.com/news/407810",
    "timestamp": "2025-05-04T11:37:34Z"
  },
  {
    "title": "Yale scholars’ move to Canada can prompt us to reflect on the rule of law",
    "description": "Philosopher Jason Stanley and historian Timothy Snynder have sought to explain authoritarian impulses and politics in the United States and elsewhere and how to resist these.",
    "link": "https://theconversation.com/yale-scholars-move-to-canada-can-prompt-us-to-reflect-on-the-rule-of-law-254434",
    "timestamp": "2025-05-04T11:37:09Z"
  },
  {
    "title": "How Donald Trump’s tariffs threaten Canadians’ access to prescription drugs",
    "description": "U.S. tariffs present not only a risk of Canadian job losses — and loss of access to employer-sponsored drug plans — but also the risk of higher prescription drug prices.",
    "link": "https://theconversation.com/how-donald-trumps-tariffs-threaten-canadians-access-to-prescription-drugs-255581",
    "timestamp": "2025-05-04T11:36:49Z"
  },
  {
    "title": "Houthi rebels blitz Israel's busiest airport with ballistic missile...",
    "description": "HOUTHI rebels have unleashed a terrifying ballistic missile on Israel’s busiest airport. Israel promised to respond to the devastating strike on the Ben Gurion Airport as Defence Minister Isr…",
    "link": "https://www.the-sun.com/news/14161380/houthi-missile-israel-airport/",
    "timestamp": "2025-05-04T11:34:38Z"
  },
  {
    "title": "Trump's First 100 Days, Michigan Democrat Files For President's Impeachment, Elon Musk's Scrutiny Of Federal Reserve Spending And More: This Week In Politics",
    "description": "The week has been a whirlwind of political and financial news. From Elon Musk’s mixed feelings about his role in the Department of Government Efficiency (DOGE) to the impeachment proceedings against President Donald Trump, there’s a lot to unpack. Let’s dive …",
    "link": "https://biztoc.com/x/153e8c367cb734a2",
    "timestamp": "2025-05-04T11:26:27Z"
  },
  {
    "title": "Harsh Goenka’s ‘red flag’ quip as US cabinet hails Trump's 100 days: ‘When democracies start looking like fan clubs…’",
    "description": "Sharing a video of a meeting of the Donald Trump administration, Harsh Goenka pointed to the way Trump's cabinet ministers were admiring the president.",
    "link": "https://www.livemint.com/companies/people/harsh-goenka-red-flag-quip-as-us-cabinet-hails-donald-trump-100-days-when-democracies-start-looking-like-fan-club-11746348950645.html",
    "timestamp": "2025-05-04T11:23:34Z"
  },
  {
    "title": "I visited a retirement home to have a conversation with older Americans about the economy. They were scared.",
    "description": "At this New York retirement home, residents don't have many expenses. They still told me they're stressed about Social Security and their savings.",
    "link": "https://www.businessinsider.com/retired-seniors-scared-economy-social-security-administration-doge-2025-5",
    "timestamp": "2025-05-04T11:19:01Z"
  },
  {
    "title": "Mexico’s president says she rejected Trump’s plan to send US troops into her country",
    "description": "“Sovereignty is not for sale. Sovereignty is loved and defended,\" she said.",
    "link": "https://www.politico.com/news/2025/05/04/mexico-sheinbaum-trump-american-troops-00325257",
    "timestamp": "2025-05-04T11:14:04Z"
  },
  {
    "title": "Australia’s re-elected prime minister says voters chose unity over division - AP News",
    "description": "Australia’s re-elected prime minister says voters chose unity over divisionAP News Five takeaways from Australia’s general election after Anthony Albanese secures second termCNN Australia’s Anthony Albanese handed sweeping mandate in anti-Trump backlashFinanc…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177303683",
    "timestamp": "2025-05-04T11:13:06Z"
  },
  {
    "title": "Sean Penn Compares Trump to a Spouse Murderer: ‘He Might Destroy the World’",
    "description": "President Donald Trump resembles a \"jealous spouse who murders another partner\" and he may \"try to destroy the world\" if any third-term ambitions were left unfulfilled, left-wing actor Sean Penn has grimly warned.\nThe post Sean Penn Compares Trump to a Spouse…",
    "link": "https://www.breitbart.com/entertainment/2025/05/04/sean-penn-compares-trump-to-a-spouse-murderer-he-might-destroy-the-world/",
    "timestamp": "2025-05-04T11:09:03Z"
  },
  {
    "title": "BMW ends 180 agency staff contracts at Mini factory in Oxford",
    "description": "Move comes as industry grapples with impact of Donald Trump’s steep 25% tariffs on imported cars\nMini owner BMW has ended 180 agency staff contracts at its factory in Oxford as the British car industry grapples with global economic uncertainty and steep US ta…",
    "link": "https://biztoc.com/x/ebd4354577019a19",
    "timestamp": "2025-05-04T11:04:50Z"
  },
  {
    "title": "US dominates perception battle with India as they negotiate a trade deal: GTRI's Ajay Srivastava",
    "description": "According to Ajay Srivastava, the US has successfully framed India's trade practices as the cause of the US trade deficit, pressuring India to increase purchases of American goods and ease regulations for US companies. Srivastava argues this perception is mis…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-dominates-perception-battle-with-india-as-they-negotiate-a-trade-deal-gtris-ajay-srivastava/articleshow/120870775.cms",
    "timestamp": "2025-05-04T11:04:42Z"
  },
  {
    "title": "Two reporters cold called Donald Trump and he told them he 'ruled the world' when he picked up",
    "description": "Donald Trump reportedly told Atlantic journalists that he ruled the world after they cold called him",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-interview-us-politics-world-news-906878-20250504",
    "timestamp": "2025-05-04T11:03:54Z"
  },
  {
    "title": "Chinese president to visit Russia on May 7-10: Kremlin",
    "description": "Chinese President Xi Jinping will visit Russia on May 7-10 and join his Russian counterpart Vladimir Putin at commemorations of the Allied victory against Nazi Germany, the Kremlin said on Sunday. The visit coincides with heightened tensions between Beijing a…",
    "link": "https://www.digitaljournal.com/world/chinese-president-to-visit-russia-on-may-7-10-kremlin/article",
    "timestamp": "2025-05-04T11:03:18Z"
  },
  {
    "title": "Trump Doesn’t Rule Out a Recession This Year — What Could That Mean for Your Wallet?",
    "description": "President Donald Trump made headlines in March by stating that he wouldn't rule out the possibility of a recession. The Dow Jones Industrial initially...",
    "link": "https://finance.yahoo.com/news/trump-isn-t-ruling-recession-130106084.html",
    "timestamp": "2025-05-04T11:02:08Z"
  },
  {
    "title": "GOP amps up Trump impeachment talk in midterm battle as party leaders woo Kemp for Senate",
    "description": "President Donald Trump and GOP leaders are beginning to plot their midterm push to hang onto power amid a shaky political environment, courting key...",
    "link": "https://www.cnn.com/2025/05/04/politics/trump-republicans-midterms-kemp-senate",
    "timestamp": "2025-05-04T11:00:51Z"
  },
  {
    "title": "Chinese President To Visit Russia On May 7-10: Kremlin",
    "description": "Chinese President Xi Jinping will visit Russia on May 7-10 and join his Russian counterpart Vladimir Putin at commemorations of the Allied victory against Nazi Germany, the Kremlin said on Sunday.",
    "link": "https://www.ibtimes.com/chinese-president-visit-russia-may-7-10-kremlin-3772423",
    "timestamp": "2025-05-04T11:00:17Z"
  },
  {
    "title": "7 Signs You're Aging Well, According To Geriatricians",
    "description": "Doctors reveal what they look for when examining a patient's longevity and how you can adopt the behaviors for yourself.",
    "link": "https://www.huffpost.com/entry/7-signs-youre-aging-well-according-to-geriatricians-goog_l_6813cb12e4b0d6761e2c687f",
    "timestamp": "2025-05-04T11:00:11Z"
  },
  {
    "title": "I'm An Eye Doctor. Here's The 1 Product I'd Never Use On My Eyes.",
    "description": "An optometrist shares why this seemingly harmless item can lead to bigger issues with your eye health.",
    "link": "https://www.huffpost.com/entry/im-an-eye-doctor-heres-the-1-product-id-never-use-on-my-eyes-goog_l_6813cb45e4b0d6761e2c6886",
    "timestamp": "2025-05-04T11:00:11Z"
  },
  {
    "title": "Are You An 'Echoist' Without Even Realizing It?",
    "description": "Echoism is described as the opposite of narcissism. Here's how to tell if you have the trait (and why that's not necessarily a good thing).",
    "link": "https://www.huffpost.com/entry/are-you-an-echoist-without-even-realizing-it-goog_l_68121eade4b06470761492d1",
    "timestamp": "2025-05-04T11:00:11Z"
  },
  {
    "title": "Ever Wonder Why \"LB\" Stands For Pound?",
    "description": "And why 'oz' is shorthand for 'ounce.'",
    "link": "https://www.huffpost.com/entry/heres-why-lb-stands-for-pound-goog_n_6813ca04e4b0af409d4f1d6d",
    "timestamp": "2025-05-04T11:00:11Z"
  },
  {
    "title": "This is how Donald Trump can terminate tariff turmoil",
    "description": "President Donald Trump and Secretary Scott Bessent still have economic runway to get things done and alleviate all the tariff turmoil in the coming weeks and months.",
    "link": "https://www.foxnews.com/opinion/how-donald-trump-can-terminate-tariff-turmoil",
    "timestamp": "2025-05-04T11:00:01Z"
  },
  {
    "title": "How to Stay in Touch With Your Friends",
    "description": "The Atlantic’s writers and editors share what they do when life gets in the way.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/05/how-to-stay-in-touch-with-your-friends/682682/",
    "timestamp": "2025-05-04T11:00:00Z"
  },
  {
    "title": "Links 5/4/2025",
    "description": "Our strategic daily links: flying bike, snake venom, COVID politics, Chinese pharmaceuticals, Brazil engergy, Gaza horrors, Ukraine burning, Real ID, vanishing privacy, hopeless homeless, Trumpishness, DOGEy moves, immigration troubles, nervous markets, Democ…",
    "link": "https://www.nakedcapitalism.com/2025/05/links-5-4-2025.html",
    "timestamp": "2025-05-04T10:55:56Z"
  },
  {
    "title": "Australian PM basks in win, vows 'orderly' gov’t",
    "description": "Australia's left-leaning Prime Minister Anthony Albanese basked on Sunday in his landslide election win, promising a \"disciplined, orderly\" government to confront cost-of-living pain and tariff turmoil.",
    "link": "https://www.hurriyetdailynews.com/australian-pm-basks-in-win-vows-orderly-govt-208776",
    "timestamp": "2025-05-04T10:54:42Z"
  },
  {
    "title": "UK far right sets sights high after election wins",
    "description": "With a thumping success in local elections this week, the hard-right Reform U.K. party has loosened Britain's two-party stranglehold and is already eyeing Downing Street.",
    "link": "https://www.hurriyetdailynews.com/uk-far-right-sets-sights-high-after-election-wins-208775",
    "timestamp": "2025-05-04T10:53:33Z"
  },
  {
    "title": "'SNL' Pokes Fun at Donald Trump’s Executive Orders: Watch",
    "description": "President Donald Trump's first 100 days of office were mocked with a spoof pocking fun at his series of executive orders on the May 3 episode of Saturday Night Live.",
    "link": "https://people.com/snl-donald-trump-executive-orders-11727847",
    "timestamp": "2025-05-04T10:46:42Z"
  },
  {
    "title": "Navigating Big Tech's new era",
    "description": "In this Sunday edition of BI Today, we're talking about millennials' retirement panic and introducing a new tech newsletter.",
    "link": "https://www.businessinsider.com/bi-today-navigating-big-tech-new-era-2025-5",
    "timestamp": "2025-05-04T10:44:01Z"
  },
  {
    "title": "Trump faces backlash after posting AI image dressed as pope",
    "description": "Cardinals will gather on May 7 in a conclave in the Vatican's Sistine Chapel to elect a new pope.",
    "link": "https://www.aljazeera.com/news/2025/5/4/trump-faces-backlash-after-posting-ai-image-dressed-as-pope",
    "timestamp": "2025-05-04T10:41:40Z"
  },
  {
    "title": "Shilo Sanders responds to Donald Trump after his support for Shedeur: If you got the President pleading, you know something's wrong",
    "description": "Shilo Sanders didn&apos;t mince words when asked about President Donald Trump&apos;s surprising public defense of his brother Shedeur Sanders after the quarterback&apos;s dramatic",
    "link": "https://www.marca.com/en/nfl/cleveland-browns/2025/05/04/681741e422601d662d8b4590.html",
    "timestamp": "2025-05-04T10:40:59Z"
  },
  {
    "title": "Trump’s counterrevolution remains on course — and will stay that way if he sticks to the high ground",
    "description": "Despite the media hysteria, President Donald Trump's counterrevolution remains on course.",
    "link": "https://nypost.com/2025/05/04/opinion/trumps-counterrevolution-remains-on-course-and-will-stay-that-way-if-he-sticks-to-the-high-ground/",
    "timestamp": "2025-05-04T10:37:09Z"
  },
  {
    "title": "Israel's \"Sevenfold Response\" Warning After Houthi Missile Hits Airport",
    "description": "At least eight people were wounded after a ballistic missile launched from Yemen struck near Israel&#039;s Ben Gurion Airport on Sunday, following which the Benjamin Netanyahu-led government announced a &quot;sevenfold retaliation&quot;.",
    "link": "https://www.ndtv.com/world-news/israels-sevenfold-response-warning-after-houthi-missile-hits-biggest-israeli-airport-8327369",
    "timestamp": "2025-05-04T10:20:07Z"
  },
  {
    "title": "Ukraine's Zelenskiy to meet Czech president in Prague on Sunday",
    "description": "PRAGUE (Reuters) - Ukrainian President Volodymyr Zelenskiy will visit the Czech Republic on Sunday and meet its president, Petr Pavel, the Czech president's office said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/04/ukraine039s-zelenskiy-to-meet-czech-president-in-prague-on-sunday",
    "timestamp": "2025-05-04T10:16:00Z"
  },
  {
    "title": "Vucic expected at Moscow parade despite illness – Serbian deputy PM",
    "description": "Deputy PM Sinisa Mali has said Serbian President Aleksandar Vucic is likely to follow through with the visit Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616716-vucic-expected-at-moscow-parade/",
    "timestamp": "2025-05-04T10:14:18Z"
  },
  {
    "title": "Donald Trump draws criticism with AI image of himself as Pope",
    "description": "US President Donald Trump has shared an artificial intelligence-generated image of himself dressed as the pope on social media.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-draws-criticism-with-ai-image-of-himself-as-pope/a1371359486.html",
    "timestamp": "2025-05-04T10:10:02Z"
  },
  {
    "title": "San Francisco's Great American Comeback",
    "description": "Voice is AI-generated. Inconsistencies may occur.\n\"You can't go into San Francisco. It's not livable. Fifteen years ago, it was the best city in the country, one of the best cities in the world, and now you can't do anything.\"\nThat was President Donald Trump …",
    "link": "https://biztoc.com/x/ec516748f61ff834",
    "timestamp": "2025-05-04T10:09:53Z"
  },
  {
    "title": "Security Affairs newsletter Round 522 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Rhysida Ransom…",
    "link": "https://securityaffairs.com/177397/breaking-news/security-affairs-newsletter-round-522-by-pierluigi-paganini-international-edition.html",
    "timestamp": "2025-05-04T10:05:53Z"
  },
  {
    "title": "Will we see the first-ever American pope? How USA's image could come into play",
    "description": "Two Americans drawing attention: Cardinal Raymond Burke, 76, a former archbishop of St. Louis, and Cardinal Joseph Tobin, 72, archbishop of Newark.",
    "link": "https://www.usatoday.com/story/news/world/2025/05/04/could-there-be-american-pope/83385288007/",
    "timestamp": "2025-05-04T10:02:43Z"
  },
  {
    "title": "Missile fired by Yemen's Houthis lands near Israel's main airport",
    "description": "BEN GURION AIRPORT, Israel: A missile fired by Yemen's Houthi rebels towards Israel on Sunday (May 4) landed near Ben Gurion Airport, the country's main international airport, sending a plume of smoke into the air and causing panic among passengers in the ter…",
    "link": "https://www.channelnewsasia.com/world/missile-fired-yemen-houthis-land-near-israel-ben-gurion-airport-5107861",
    "timestamp": "2025-05-04T10:01:58Z"
  },
  {
    "title": "Meet the Barstool personality who delivers viral newscasts by ‘journalisming’",
    "description": "\"Unpack with Jack Mac\" is an almost-daily program that examines the day’s major news with satire and sarcasm in easily digestible videos on TikTok and other social media platforms.",
    "link": "https://www.foxnews.com/media/meet-the-barstool-personality-who-delivers-viral-newscasts-by-journalisming",
    "timestamp": "2025-05-04T10:00:46Z"
  },
  {
    "title": "The iPhone 20 already sounds like it will cost a fortune",
    "description": "\"Extraordinarily complex\" design means an extraordinary price tag.",
    "link": "https://www.creativebloq.com/tech/phones-tablets/the-iphone-20-already-sounds-like-it-will-cost-a-fortune",
    "timestamp": "2025-05-04T10:00:20Z"
  },
  {
    "title": "Perhaps Zelensky should write a book on the ‘art of the deal’",
    "description": "Ukraine’s leader held firm in negotiations with the Trump-led US on a deal over minerals and other natural resources. By keeping the risk of American exploitation low, Zelensky seems to have emerged as a hero from his White House squabble.",
    "link": "https://www.livemint.com/opinion/online-views/volodymyr-zelensky-donald-trump-yulia-svyrydenko-oval-office-european-union-us-congress-rada-washington-russia-minerals-11746193926382.html",
    "timestamp": "2025-05-04T10:00:10Z"
  },
  {
    "title": "San Francisco's Great American Comeback",
    "description": "Written off as hopelessly broken, the City by the Bay is recalibrating—fighting back against crime, restoring order, and reclaiming its lost identity as one of America's great cities.",
    "link": "https://www.newsweek.com/san-francisco-crime-new-mayor-comeback-2067442",
    "timestamp": "2025-05-04T10:00:02Z"
  },
  {
    "title": "The Trump admin's book purge at the Naval Academy goes beyond petty authoritarianism",
    "description": "One of us wrote an academic book on gender. The Trump administration thinks it's too dangerous for the Naval Academy to have in its library.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-dei-book-purge-naval-academy-rcna203875",
    "timestamp": "2025-05-04T10:00:00Z"
  },
  {
    "title": "Stocks unleash remarkable comeback after a historic dive from Trump's tariffs announcement",
    "description": "In the week following President Donald Trump’s “Liberation Day” tariffs announcement, it looked like the stock market had seen a ghost.",
    "link": "https://www.nbcnews.com/business/markets/stocks-unleash-remarkable-comeback-after-volatile-month-trump-tariffs-rcna204213",
    "timestamp": "2025-05-04T10:00:00Z"
  },
  {
    "title": "Kilmar Abrego Garcia: The story of the ‘mistakenly deported Maryland man’",
    "description": "El Salvador-born construction worker has become the face of US president Donald Trump’s immigration crackdown",
    "link": "https://www.irishtimes.com/world/us/2025/05/04/kilmar-abrego-garcia-the-story-of-the-mistakenly-deported-maryland-man/",
    "timestamp": "2025-05-04T10:00:00Z"
  },
  {
    "title": "Trump Administration Proposes Largest Ever Cut To NASA’s Budget — And Eyes Mars",
    "description": "NASA's topline funding could be slashed by 24% and its science budget by 47% after what experts describe as a \"destructive proposal\" by the Trump Administration to cut...",
    "link": "https://www.forbes.com/sites/jamiecartereurope/2025/05/04/trump-administration-proposes-largest-ever-cut-to-nasas-budget---and-eyes-mars/",
    "timestamp": "2025-05-04T10:00:00Z"
  },
  {
    "title": "Trump’s approval rating is low, but good luck finding those who regret their vote",
    "description": "Ninety-two percent of Trump voters are satisfied with their vote, says a Public Religion Research Institute poll released around the 100-day mark of his term.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-poll-low-approval-rating-regrets-rcna203972",
    "timestamp": "2025-05-04T10:00:00Z"
  },
  {
    "title": "Michael Lewis’s Paean to Federal Workers Hits Differently Under DOGE",
    "description": "In early March, the nonprofit Partnership for Public Service released its annual Best Places to Work in the Federal Government rankings, based on a survey of over one million civil servants across 75 agencies. Good news! Over two-thirds of the respondents to …",
    "link": "https://newrepublic.com/article/194690/michael-lewis-government-essays-federal-workers-musk-doge",
    "timestamp": "2025-05-04T10:00:00Z"
  },
  {
    "title": "Unfortunately, I Am Obsessed With Bill Belichick’s 24-Year-Old Girlfriend—and You Should Be Too",
    "description": "America didn't know it needed Jordon Hudson, but it did.",
    "link": "https://slate.com/life/2025/05/bill-belichick-girlfriend-jordon-hudson-interview-age.html",
    "timestamp": "2025-05-04T09:59:00Z"
  }
]