[
  {
    "title": "G20 nations agree central bank independence 'crucial'",
    "description": "The G20 nations stressed today that central banks must remain independent, after months of escalating attacks by US President Donald Trump on Federal Reserve boss Jerome Powell.",
    "link": "https://www.rte.ie/news/business/2025/0718/1524210-g20-nations-agree-central-bank-independence-crucial/",
    "timestamp": "2025-07-18T14:13:11Z"
  },
  {
    "title": "Donald Trump Celebrates CBS’s Cancellation Of Stephen Colbert’s “The Late Show”",
    "description": "Donald Trump celebrated CBS’s decision to cancel The Late Show with Stephen Colbert, and attacked the two remaining broadcast network late night hosts, Jimmy Kimmel and Jimmy Fallon. Trump posted on Truth Social, “I absolutely love that Colbert’ got fired. Hi…",
    "link": "http://deadline.com/2025/07/trump-stephen-solbert-cancelled-1236462213/",
    "timestamp": "2025-07-18T14:13:07Z"
  },
  {
    "title": "‘Accountability Restored’: Trump Admin Celebrates Ending Grants That Funded Far-Left Organizations",
    "description": "By Tyler O'Neil, The Daily Signal | July 16, 2025\nThe Trump White House and the State Department celebrated Tuesday the end of government grants that directed tax dollars to the Left’s dark money network.\n“President [Donald] Trump has done more than anyone to…",
    "link": "https://biztoc.com/x/b6f684994dfd46c6",
    "timestamp": "2025-07-18T14:12:14Z"
  },
  {
    "title": "Explosive claim: Ex-casino boss alleges Trump and Epstein brought underage girls to casino floor",
    "description": "A former casino executive alleges that Donald Trump and Jeffrey Epstein brought underage girls to Trump Plaza Hotel & Casino in the 1980s, a claim Trump vehemently denies. Trump's team dismisses the accuser as a liar, while Trump distances himself from Epstei…",
    "link": "https://economictimes.indiatimes.com/news/international/us/explosive-claim-ex-casino-boss-alleges-trump-and-epstein-brought-underage-girls-to-casino-floor/articleshow/122767373.cms",
    "timestamp": "2025-07-18T14:10:53Z"
  },
  {
    "title": "Trump and JD Vance Humiliatingly Flub Response to WSJ Epstein Story",
    "description": "Donald Trump and JD Vance clearly didn’t take the time to get their story straight about the president’s lewd 50th birthday letter to alleged sex trafficker Jeffrey Epstein.The Wall Street Journal reported Thursday that in 2003, Trump penned Epstein a “bawdy”…",
    "link": "https://newrepublic.com/post/198110/donald-trump-jd-vance-wall-street-journal-epstein",
    "timestamp": "2025-07-18T14:10:52Z"
  },
  {
    "title": "Jeffrey Epstein’s Victims Are Again Being Wronged by Donald Trump’s Circus",
    "description": "Jeet Heer\n\n\n\nPartisan politics is making a travesty of justice.\r\n\n\r\n\n\nThe post Jeffrey Epstein’s Victims Are Again Being Wronged by Donald Trump’s Circus appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/jeffrey-epstein-virginia-giuffre-trump/",
    "timestamp": "2025-07-18T14:10:10Z"
  },
  {
    "title": "Trump directs AG Bondi to work on unsealing grand jury transcripts in Epstein case: 'We are ready'",
    "description": "President Donald Trump has directed Attorney General Pam Bondi to work on releasing grand jury transcripts about Jeffrey Epstein in response to criticism over the handling of the case.",
    "link": "https://www.foxnews.com/politics/trump-directs-ag-bondi-work-unsealing-grand-jury-transcripts-epstein-case-we-ready",
    "timestamp": "2025-07-18T14:09:34Z"
  },
  {
    "title": "Trump Teases Forcing Rupert Murdoch To Testify In Epstein Letter Lawsuit: ‘Will Be An Interesting Experience!!!’",
    "description": "President Donald Trump further teased a lawsuit against The Wall Street Journal on by saying he's \"looking forward\" to media mogul Rupert Murdoch testifying.\nThe post Trump Teases Forcing Rupert Murdoch To Testify In Epstein Letter Lawsuit: ‘Will Be An Intere…",
    "link": "https://www.mediaite.com/media/news/trump-teases-forcing-rupert-murdoch-to-testify-in-epstein-letter-lawsuit-will-be-an-interesting-experience/",
    "timestamp": "2025-07-18T14:08:25Z"
  },
  {
    "title": "Trump Celebrates Colbert Firing, Says ‘I Hear Jimmy Kimmel Is Next’",
    "description": "\"I absolutely love that Colbert got fired,\" the president says\nThe post Trump Celebrates Colbert Firing, Says ‘I Hear Jimmy Kimmel Is Next’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-stephen-colbert-fired-jimmy-kimmel/",
    "timestamp": "2025-07-18T14:08:14Z"
  },
  {
    "title": "Celebrities React to Stephen Colbert's 'Late Show' Cancellation",
    "description": "Stephen Colbert’s dropping the mic on late-night TV next year, and looks like the talk-show king is seriously beloved ... 'cause the celebs are freaking out over the news. Ben Stiller, Rachel Zegler, \"Severance\" star Adam Scott and others flooded…",
    "link": "https://www.tmz.com/2025/07/18/stephen-colbert-late-night-show-cancellation-donald-trump-rachel-zegler-ben-stiller/",
    "timestamp": "2025-07-18T14:07:27Z"
  },
  {
    "title": "'Wow': CNN host stunned by legal expert's take on Trump's Epstein plan",
    "description": "President Donald Trump has directed Attorney General Pam Bondi to release grand jury transcripts related to Jeffrey Epstein's sex trafficking case, but a legal expert explained that left out most of the information about the case that his MAGA supporters had …",
    "link": "https://www.rawstory.com/trump-release-grand-jury-wow/",
    "timestamp": "2025-07-18T14:06:35Z"
  },
  {
    "title": "SEC Chair Atkins considers innovation exemption to boost tokenization",
    "description": "Crypto industry hails GENIUS Act as a win, while Senator Elizabeth Warren criticizes it for consumer protection gaps.",
    "link": "https://cointelegraph.com/news/sec-tokenization-exemption-genius-act-passes",
    "timestamp": "2025-07-18T14:06:00Z"
  },
  {
    "title": "G20 nations agree central bank independence ‘crucial’",
    "description": "The G20 nations stressed Friday that central banks must remain independent, after months of escalating attacks by US President Donald Trump on Federal Reserve boss Jerome Powell. The US leader has repeatedly lashed out at Powell for not lowering interest rate…",
    "link": "https://www.digitaljournal.com/world/g20-nations-agree-central-bank-independence-crucial/article",
    "timestamp": "2025-07-18T14:02:20Z"
  },
  {
    "title": "Trump: 'I Absolutely Love' Colbert Got 'Fired,' 'Jimmy Kimmel Is Next'",
    "description": "Trump weighed in on CBS's announced cancelation of Stephen Colbert's late-night talk show and is seemingly hopeful Jimmy Kimmel will be next to get axed.",
    "link": "https://variety.com/2025/tv/news/trump-absolutely-love-stephen-colbert-fired-jimmy-kimmel-next-1236464640/",
    "timestamp": "2025-07-18T14:00:31Z"
  },
  {
    "title": "Is Colbert’s Ouster Really Just a ‘Financial Decision’?",
    "description": "David Graham: \"For much of the 20th century, American broadcast television revolved around three networks: NBC, ABC, and CBS. William S. Paley, CBS’s longtime CEO, made sure that his company—the Columbia Broadcasting Service—was a leader",
    "link": "https://politicalwire.com/2025/07/18/is-colberts-ouster-really-just-a-financial-decision/",
    "timestamp": "2025-07-18T14:00:27Z"
  },
  {
    "title": "Justice Department Employees Dismissed Without Reason, Creating Climate of Fear",
    "description": "Perry Stein of The Washington Post wrote about the arbitrary dismissals at the Justice Department, as Attorney General Pam Bondi clears out anyone suspected of disloyalty to Trump’s agenda. Republicans complained in the past that Biden was “weaponizing” and “…",
    "link": "https://dianeravitch.net/2025/07/18/justice-department-employees-dismissed-without-reason-creating-climate-of-fear/",
    "timestamp": "2025-07-18T14:00:00Z"
  },
  {
    "title": "The CEO of NPR Made the Best Case for Defunding It",
    "description": "The notion that NPR can somehow become unbiased is about as believable as the IRS sending you a fruit basket to commend you for filing your taxes.",
    "link": "https://reason.com/2025/07/18/the-ceo-of-npr-made-the-best-case-for-defunding-it/",
    "timestamp": "2025-07-18T13:59:52Z"
  },
  {
    "title": "Trump Dismantles Syria Sanctions While Israel Bombs their Government",
    "description": "While President Trump dismantles Syria Sanctions Program in support of the new al Qaeda government, Israel is bombing the new government installed by the Mossad. \nNot to be deterred, Israel is also continuing its bombing of Lebanon and Yemen…\nThe post Trump D…",
    "link": "https://www.globalresearch.ca/trump-dismantles-syria-sanctions-israel-bombs-government/5895203",
    "timestamp": "2025-07-18T13:59:31Z"
  },
  {
    "title": "Brazil's former President Bolsonaro to wear ankle monitor",
    "description": "The former president's home and party headquarters in Brasilia were also searched. Brazil's supreme court has ordered former President Jair Bolsonaro to wear an ankle monitor.\n\nThe decision came as the former president's home and party headquarters in Brasili…",
    "link": "https://www.dw.com/en/brazils-former-president-bolsonaro-to-wear-ankle-monitor/a-73327772",
    "timestamp": "2025-07-18T13:58:00Z"
  },
  {
    "title": "Brazil's Bolsonaro ordered to wear ankle monitor",
    "description": "The former president's home and party headquarters in Brasilia were also searched as a coup trial against him nears an end.",
    "link": "https://www.dw.com/en/brazils-bolsonaro-ordered-to-wear-ankle-monitor/a-73327772",
    "timestamp": "2025-07-18T13:58:00Z"
  },
  {
    "title": "Joe Scarborough decries ‘terrible’ timing of Stephen Colbert ‘Late Show’ cancellation",
    "description": "The “Morning Joe” co-host spotlighted the full context leading up to CBS’ announcement that it’s canceling its marquee late-night talk show.",
    "link": "https://www.msnbc.com/top-stories/latest/colbert-late-show-cancellation-cbs-trump-morning-joe-rcna219456",
    "timestamp": "2025-07-18T13:57:15Z"
  },
  {
    "title": "Trump Nominates Two Lawyers to Seal Republican Control of US Labor Board",
    "description": "President Donald Trump has moved to install a Republican majority at the federal board that hears private-sector labor disputes and oversees union elections, which has been paralyzed by his unprecedented firing of a Democratic member. The White House sent the…",
    "link": "https://www.insurancejournal.com/news/national/2025/07/18/832302.htm",
    "timestamp": "2025-07-18T13:56:50Z"
  },
  {
    "title": "INGERSOLL: CBS Finally Mercy-Kills Stephen ‘Tedious And Unfunny’ Colbert",
    "description": "The Late Show with Stephen Colbert will officially end in May 2026. I couldn’t think of a better birthday gift two months before America’s 250th.",
    "link": "https://dailycaller.com/2025/07/18/ingersoll-cbs-finally-mercy-kills-stephen-tedious-and-unfunny-colbert/",
    "timestamp": "2025-07-18T13:55:59Z"
  },
  {
    "title": "Anaheim Wants To Use Disney’s Affordable Housing Donation To Aid Undocumented Immigrants Against ICE Raids",
    "description": "Raids by Immigration and Customs Enforcement (ICE) agents have rocked Southern California, including the Anaheim area around Disneyland. The raids are a part of President Donald Trump’s campaign promise of “mass deportations” of anyone in the country illegall…",
    "link": "https://insidethemagic.net/2025/07/anaheim-using-disney-funds-to-help-undocumented-immigrants-against-ice-rl1/",
    "timestamp": "2025-07-18T13:55:52Z"
  },
  {
    "title": "Jimmy Kimmel Slams CBS for Canceling 'The Late Show,' Shows Support for Pal Stephen Colbert",
    "description": "Jimmy Kimmel is speaking out following news that The Late Show with Stephen Colbert has been canceled. On Thursday (July 18), Stephen Colbert announced that his CBS late-night talk show will be ending next year, with the final episode airing in 2026. In a sta…",
    "link": "https://www.justjared.com/2025/07/18/jimmy-kimmel-slams-cbs-for-canceling-the-late-show-shows-support-for-pal-stephen-colbert/",
    "timestamp": "2025-07-18T13:54:07Z"
  },
  {
    "title": "Why Colbert Got Cancelled",
    "description": "If you think \"The Late Show\" got torched just for \"financial reasons,\" I've got swampland to sell you.\nThe post Why Colbert Got Cancelled appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/07/18/why-colbert-got-cancelled/",
    "timestamp": "2025-07-18T13:52:13Z"
  },
  {
    "title": "Trump Celebrates CBS Firing Colbert. That Should Worry Everyone",
    "description": "Trump gloats after Colbert’s cancellation, fueling speculation that CBS axed its top-rated host to appease him ahead of a crucial FCC merger approval.\nThe post Trump Celebrates CBS Firing Colbert. That Should Worry Everyone first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trump-applauds-colbert-ouster-sparking-cbs-appeasement-fears/",
    "timestamp": "2025-07-18T13:51:42Z"
  },
  {
    "title": "Biden’s Team Lied About Gaza. It’s Time to Hold Them Accountable",
    "description": "Impunity for abetting war crimes weakens U.S. democracy.",
    "link": "http://foreignpolicy.com/2025/07/18/biden-war-crimes-israel-gaza-accountability/",
    "timestamp": "2025-07-18T13:51:32Z"
  },
  {
    "title": "The 1600: Another Wonderful Secret",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-another-wonderful-secret-2100776",
    "timestamp": "2025-07-18T13:50:41Z"
  },
  {
    "title": "The Best Trump Burns That Probably Got Stephen Colbert Fired",
    "description": "Epstein and Elon provide plenty of punchlines",
    "link": "https://www.cracked.com/article_47448_the-best-trump-burns-that-probably-got-stephen-colbert-fired.html",
    "timestamp": "2025-07-18T13:50:00Z"
  },
  {
    "title": "Colbert canceled by CBS days after his withering criticism of parent company’s Trump settlement",
    "description": "CBS is canceling “The Late Show With Stephen Colbert” next May, shuttering a decades-old TV institution in a changing media landscape and removing from air one of President Donald Trump’s most prominent and persistent late-night critics.\nThursday’s announceme…",
    "link": "https://biztoc.com/x/08ae10252e8c0e5c",
    "timestamp": "2025-07-18T13:49:55Z"
  },
  {
    "title": "Trump’s ‘no tax on tips’ sparks questions for workers: ‘We’re looking at a crystal ball,’ expert says",
    "description": "President Donald Trump's \"big beautiful bill\" includes a section for \"no tax on tips.\" Now that the provision is enacted, here's what experts know so far.",
    "link": "https://www.cnbc.com/2025/07/18/trump-big-beautiful-bill-no-tax-on-tips.html",
    "timestamp": "2025-07-18T13:49:52Z"
  },
  {
    "title": "Trump's MAGA Ambassador Nominee Faces Protests",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nScores of protesters gathered outside the U.S. embassy in the Malaysian capital on Friday to protest against the nomination of Nick Adams, an ardent supporter of President Donald Trump and outspoken conservati…",
    "link": "https://biztoc.com/x/d997230730a51da2",
    "timestamp": "2025-07-18T13:49:51Z"
  },
  {
    "title": "Donald Trump Reacts to Stephen Colbert News, Predicts Who Is Next",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump celebrated the news that CBS is axing Stephen Colbert's \"The Late Show\", and predicted that ABC's Jimmy Kimmel would be the next host to get the chop.\n\"I absolutely love that Colbert' go…",
    "link": "https://biztoc.com/x/67b6e1a22bfb5a6d",
    "timestamp": "2025-07-18T13:49:42Z"
  },
  {
    "title": "Donald Trump Suffers Major Legal Loss in 'Deep State' War",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump suffered a legal blow on Thursday when a federal judge ruled that his move to fire Federal Trade Commission member Rebecca Slaughter, a Democrat, was illegal.\nThe Trump administration ha…",
    "link": "https://biztoc.com/x/8213f9f2e321b733",
    "timestamp": "2025-07-18T13:49:22Z"
  },
  {
    "title": "Blame It on Tariffs: CEOs Roll Out New Excuse for Bankruptcies",
    "description": "When At Home Group Inc.’s lawyer stood before a US bankruptcy judge last month asking to wipe out nearly $2 billion of the retailer’s debt, the reason came quick: tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/blame-it-on-tariffs-ceos-roll-out-new-excuse-for-bankruptcies",
    "timestamp": "2025-07-18T13:48:23Z"
  },
  {
    "title": "Decoding Trump: What Europe Did (and Didn’t) Understand",
    "description": "Donald Trump's July 14 statement, accompanied by a staged scene with the NATO secretary general, and his offhand remark about the first lady (which was quickly promoted in Kiev), has turned out to be one of his most complex statements of his presidency.",
    "link": "https://sputnikglobe.com/20250718/decoding-trump-what-europe-did-and-didnt-understand-1122456218.html",
    "timestamp": "2025-07-18T13:47:48Z"
  },
  {
    "title": "Trump's MAGA Ambassador Nominee Faces Protests",
    "description": "The nomination of Adams is one of several that have stirred criticism in the U.S.",
    "link": "https://www.newsweek.com/malaysia-protests-us-trump-ambassador-nominee-nick-adams-2100767",
    "timestamp": "2025-07-18T13:47:40Z"
  },
  {
    "title": "Fed Official Calls For Rate Cut Amid Ongoing Pressure From Trump",
    "description": "Federal Reserve Gov. Christopher Waller on Thursday called for the central bank to cut interest rates in July.",
    "link": "https://dailycaller.com/2025/07/18/christopher-waller-federal-reserve-rate-cut-trump/",
    "timestamp": "2025-07-18T13:47:32Z"
  },
  {
    "title": "ICE Discovers How to Bypass Sanctuary City Policy—'There's No Choice'",
    "description": "LA County Sheriff Robert Luna said at a press conference on Thursday that his department has \"no choice\" but to comply with ICE.",
    "link": "https://www.newsweek.com/ice-sanctuary-city-california-los-angeles-immigration-2100692",
    "timestamp": "2025-07-18T13:44:28Z"
  },
  {
    "title": "As Republicans claw back key funds, the White House pushes for even less bipartisanship",
    "description": "On federal spending, Donald Trump's team says it wants less bipartisanship, while expressing indifference to Congress’ existence. That's not sustainable.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-claw-back-key-funds-white-house-pushes-even-less-bipartisa-rcna219556",
    "timestamp": "2025-07-18T13:42:51Z"
  },
  {
    "title": "Donald Trump Reacts to Stephen Colbert News, Predicts Who Is Next",
    "description": "CBS is axing \"The Late Show\" in 2026.",
    "link": "https://www.newsweek.com/trump-reacts-stephen-colbert-late-show-jimmy-kimmel-2100773",
    "timestamp": "2025-07-18T13:42:22Z"
  },
  {
    "title": "Black Internet Reacts to Trump’s Scary Health Diagnosis",
    "description": "Trump has been diagnosed with chronic venous insufficiency, and the internet has some very interesting thoughts on the matter. \nThe post Black Internet Reacts to Trump’s Scary Health Diagnosis appeared first on The Root.",
    "link": "https://www.theroot.com/black-america-reacts-to-trumps-scary-health-diagnosis-2000051319",
    "timestamp": "2025-07-18T13:42:20Z"
  },
  {
    "title": "Colbert canceled by CBS days after his withering criticism of parent company’s Trump settlement",
    "description": "Colbert told his audience Thursday that he just learned “It's the end of ‘The Late Show’ on CBS. I’m not being replaced. This is all just going away.”",
    "link": "https://fortune.com/2025/07/18/why-was-stephen-colbert-canceled-by-cbs-paramount-trump/",
    "timestamp": "2025-07-18T13:41:13Z"
  },
  {
    "title": "Enigmas Never Age",
    "description": "Plus: Throuple reproduction, weight-loss drug competition, and more...",
    "link": "https://reason.com/2025/07/18/enigmas-never-age/",
    "timestamp": "2025-07-18T13:41:01Z"
  },
  {
    "title": "Donald Trump’s Sudden Health Reveal Has America Asking—What Exactly is He Hiding?",
    "description": "Donald Trump reveals chronic illness, sparking skepticism over timing and possible distraction from larger political controversies.",
    "link": "https://www.inquisitr.com/donald-trumps-sudden-health-reveal-has-america-asking-what-exactly-is-he-hiding",
    "timestamp": "2025-07-18T13:40:44Z"
  },
  {
    "title": "Pepsi Executive Floats Switch to Sugar After Trump Coca-Cola Announcement",
    "description": "Pepsi Executive Floats Switch to Sugar After Trump Coca-Cola Announcementtheepochtimes.com",
    "link": "https://www.theepochtimes.com/business/pepsi-executive-floats-switch-to-sugar-after-trump-coca-cola-announcement-5889290",
    "timestamp": "2025-07-18T13:40:36Z"
  },
  {
    "title": "Donald Trump Suffers Major Legal Loss in 'Deep State' War",
    "description": "U.S. District Judge Loren AliKhan said the Trump administration wanted the Federal Trade Commission to be a \"subservient agency.\"",
    "link": "https://www.newsweek.com/donald-trump-suffers-major-legal-loss-over-deep-state-war-2100667",
    "timestamp": "2025-07-18T13:39:57Z"
  },
  {
    "title": "“Our First Country Is Palestine,” Say Refugees in Syria’s Yarmouk Camp",
    "description": "“It’s not possible to stay for hundreds of years as refugees; we need a just solution,” says a Palestinian from Yarmouk.",
    "link": "https://truthout.org/articles/our-first-country-is-palestine-say-refugees-in-syrias-yarmouk-camp/",
    "timestamp": "2025-07-18T13:39:37Z"
  },
  {
    "title": "Stephen Colbert’s ‘Late Show’ canceled by CBS, ends May 2026",
    "description": "The most recent ratings from Nielsen show Colbert gaining viewers so far this year and winning his timeslot among broadcasters, with about 2.417 million viewers across 41 new episodes.",
    "link": "https://www.pbs.org/newshour/nation/stephen-colberts-late-show-canceled-by-cbs-ends-may-2026",
    "timestamp": "2025-07-18T13:39:31Z"
  },
  {
    "title": "Brazil's former President Bolsonaro ordered to wear electronic ankle monitor",
    "description": "Jair Bolsonaro, Brazil's ex-President, faces new restrictions. He must wear an ankle monitor. Federal police searched his home and party headquarters. The Supreme Court is investigating Bolsonaro. He is accused of attempting a coup after losing the 2022 elect…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/brazils-former-president-bolsonaro-ordered-to-wear-electronic-ankle-monitor/articleshow/122767262.cms",
    "timestamp": "2025-07-18T13:39:17Z"
  },
  {
    "title": "Enigmas Never Age",
    "description": "May every day be another wonderful…secret? Yesterday, The Wall Street Journal published new revelations about the relationship between financier/pedophile Jeffrey Epstein and President Donald Trump. For Epstein's 50th birthday, his longtime partner Ghislaine …",
    "link": "https://biztoc.com/x/d77ddb3c429eb354",
    "timestamp": "2025-07-18T13:38:35Z"
  },
  {
    "title": "Colbert Fallout: Jimmy Kimmel Posts Brutally Blunt Message for CBS",
    "description": "As the fallout from CBS announcing that The Late Show with Stephen Colbert would be ending its run in May 2026 continues to be heard, many folks have a lot to say about what the future holds for late-night talk shows on network television. There are also \"big…",
    "link": "https://bleedingcool.com/comics/colbert-fallout-jimmy-kimmel-posts-brutally-blunt-message-for-cbs/",
    "timestamp": "2025-07-18T13:38:03Z"
  },
  {
    "title": "It Takes Just One Word For Scott Jennings To Describe America’s Reaction To WSJ Trump-Epstein Story",
    "description": "Republican strategist Scott Jennings shrugged off a WSJ report on a bawdy letter allegedly written by President Donald Trump during a panel discussion.",
    "link": "https://dailycaller.com/2025/07/18/it-takes-just-one-word-for-scott-jennings-to-describe-americas-reaction-to-wsj-trump-epstein-story/",
    "timestamp": "2025-07-18T13:37:32Z"
  },
  {
    "title": "Sheena McGinley: What’s happening to US chat show hosts like Stephen Colbert suits Donald Trump down to the ground",
    "description": "“Welcome in here, out there, and all around the world to The Late Show. I am your host, Stephen Colbert.” That daily introduction has consistently brought immense personal joy – through Donald Trump’s first impeachment, the fraught 2020 election, the subseque…",
    "link": "https://www.independent.ie/opinion/comment/sheena-mcginley-whats-happening-to-us-chat-show-hosts-like-stephen-colbert-suits-donald-trump-down-to-the-ground/a1016239254.html",
    "timestamp": "2025-07-18T13:36:51Z"
  },
  {
    "title": "Weekly Coffee News: Parchment as Fish Food + US Traders Rush to Land Brazil",
    "description": "Roast Magazine’s Daily Coffee News is proud to maintain advertising partnerships with many of the world’s leading coffee companies, yet maintains a focus on fair and objective editorial content, with no sponsored content or native advertising.",
    "link": "https://dailycoffeenews.com/2025/07/18/weekly-coffee-news-parchment-as-fish-food-us-traders-rush-to-land-brazil/",
    "timestamp": "2025-07-18T13:36:04Z"
  },
  {
    "title": "CNN Anchor Torpedoes Scott Jennings Calling Trump-Epstein Bombshell ‘A Dud’: Trump ‘Clearly Pissed Off’",
    "description": "CNN anchor Abby Phillip torpedoed GOP analyst Scott Jennings's claim that the bombshell Jeffrey Epstein-Trump story was \"a dud\" by pointing out that President Donald Trump is \"clearly very pissed off\" about it.\nThe post CNN Anchor Torpedoes Scott Jennings Cal…",
    "link": "https://www.mediaite.com/media/news/cnn-anchor-torpedoes-scott-jennings-calling-trump-epstein-bombshell-a-dud-trump-clearly-pissed-off/",
    "timestamp": "2025-07-18T13:35:59Z"
  },
  {
    "title": "Stephen Colbert Net Worth & ‘Late Show’ Salary: What He Makes Annually",
    "description": "Stephen's time hosting 'The Late Show' will come to an end in May 2026, he and CBS announced in July 2025 shortly after the network settled its lawsuit with Donald Trump for $16 million.",
    "link": "https://hollywoodlife.com/feature/stephen-colbert-net-worth-salary-5429234/",
    "timestamp": "2025-07-18T13:33:54Z"
  },
  {
    "title": "Stefanik uses viral CEO cheating photo to slam Mamdani, Hochul",
    "description": "Rep. Elise Stefanik a used a viral Kiss Cam moment to criticize Gov. Hochul and NYC mayoral candidate Zohran Mamdani while potentially eyeing a gubernatorial bid in 2026.",
    "link": "https://www.foxnews.com/politics/stefanik-uses-viral-ceo-cheating-photo-slam-mamdani-hochul",
    "timestamp": "2025-07-18T13:33:34Z"
  },
  {
    "title": "UK Looking to Join Trump Plan to Purchase US Weapons for Ukraine",
    "description": "The UK is looking to participate in European purchases of US military equipment for Ukraine, as allies seize on Donald Trump’s more hostile stance toward Russia even if it means financing the weapons themselves.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-looking-to-join-trump-plan-to-purchase-us-weapons-for-ukraine",
    "timestamp": "2025-07-18T13:33:02Z"
  },
  {
    "title": "BREAKING: Biden Judge Rules Trump Firing Democrat FTC Commissioner Illegal",
    "description": "A federal judge on Thursday rehired the Democrat FTC Commissioner who was fired by President Trump earlier this year. US District Judge Loren AliKhan, a Biden appointee, said President Trump’s firing of Rebecca Kelly Slaughter, the Democrat FTC Commissioner w…",
    "link": "https://freerepublic.com/focus/f-news/4329353/posts",
    "timestamp": "2025-07-18T13:33:00Z"
  },
  {
    "title": "'I love that Colbert got fired:' Trump cheers show cancellation amid CBS 'bribe'",
    "description": "President Donald Trump took to social media Friday to celebrate the cancellation of “The Late Show with Stephen Colbert,” a move critics allege was retaliation for Colbert's accusation that parent company Paramount paid Trump in a settlement to secure support…",
    "link": "https://www.rawstory.com/stephen-colbert-2673358508/",
    "timestamp": "2025-07-18T13:31:34Z"
  },
  {
    "title": "Lawrence O’Donnell Shocked by JD Vance’s Fumbling of Trump-Epstein Letter by ‘Provoking’ Rupert Murodch: ‘Could Destroy Trump’",
    "description": "JD Vance may be a liability for Donald Trump in the wake of a WSJ report on Trump's relationship to late billionaire Jeffrey Epstein, Lawrence O'Donnell argued.\nThe post Lawrence O’Donnell Shocked by JD Vance’s Fumbling of Trump-Epstein Letter by ‘Provoking’ …",
    "link": "https://www.mediaite.com/media/tv/lawrence-odonnell-shocked-by-jd-vances-fumbling-of-trump-epstein-letter-by-provoking-rupert-murodch-could-destroy-trump/",
    "timestamp": "2025-07-18T13:30:16Z"
  },
  {
    "title": "‘Five-Alarm Fire’: Texas Dem Sounds Off on Trump’s Bid to Gerrymander Midterms",
    "description": "Rep. Greg Casar called for a mass Democratic response to efforts by Trump and Texas Republicans to create new GOP seats ahead of the midterms.",
    "link": "http://www.rollingstone.com/politics/politics-features/greg-casar-sounds-off-trump-texas-gerrymandering-push-1235388283/",
    "timestamp": "2025-07-18T13:30:00Z"
  },
  {
    "title": "Prince Harry arranges peace summit with King Charles within weeks – but has no plans to see William",
    "description": "The Duke of Sussex's press team was seen meeting up with the monarch’s communications secretary for a top-secret meeting in London last week.",
    "link": "https://nypost.com/2025/07/18/entertainment/prince-harry-arranges-peace-summit-with-king-charles-within-weeks-but-has-no-plans-to-see-william/",
    "timestamp": "2025-07-18T13:28:21Z"
  },
  {
    "title": "UK, India likely to unveil Free Trade Agreement next week, including whisky, EVs, textiles",
    "description": "India and the UK are set to sign a long-awaited free trade agreement next week, according to two Indian government sources. The deal will provide Indian electric vehicles and textiles with duty-free access to the UK market, while easing tariffs on British exp…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/uk-india-likely-to-unveil-free-trade-agreement-next-week-including-whisky-evs-textiles/articleshow/122767092.cms",
    "timestamp": "2025-07-18T13:28:14Z"
  },
  {
    "title": "Philippines eyes favourable US trade deal as Marcos set to meet Trump",
    "description": "The Philippines hopes to secure a trade agreement with the US when President Ferdinand Marcos Jr. discusses a planned US tariff during his meeting with President Donald Trump in Washington, according to a Manila official. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/18/philippines-eyes-favourable-us-trade-deal-as-marcos-set-to-meet-trump",
    "timestamp": "2025-07-18T13:28:00Z"
  },
  {
    "title": "Trump blames Federal Reserve board on Powell, rates",
    "description": "US President Donald Trump today blamed US Federal Reserve officials as he reiterated his criticisms of Fed Chair Jerome Powell and again called for lower interest rates.",
    "link": "https://www.rte.ie/news/business/2025/0718/1524200-trump-blames-fed-board-on-powell/",
    "timestamp": "2025-07-18T13:27:53Z"
  },
  {
    "title": "Is Mexican Coke Healthier Than US Coca-Cola? What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has announced that Coca-Cola will swap high-fructose corn syrup (HFCS) with cane sugar in a win for Health Secretary Robert F. Kennedy Jr.'s Make America Healthy Again (MAHA) initiative.…",
    "link": "https://biztoc.com/x/9794f9813a23b401",
    "timestamp": "2025-07-18T13:27:25Z"
  },
  {
    "title": "Israel May Be Using Syrian Raid on Druze Community to Overthrow Sharaa Gov’t - Politician",
    "description": "ST. PETERSBURG (Sputnik) - Israel may have struck Syria under the pretext of protecting the religious Druze minority in Suwayda in a bid to overthrow the Syrian government led by interim President Ahmed Sharaa, Tarek Ahmad, a member of the Syrian Social Natio…",
    "link": "https://sputnikglobe.com/20250718/israel-may-be-using-syrian-raid-on-druze-community-to-overthrow-sharaa-govt---politician-1122456074.html",
    "timestamp": "2025-07-18T13:26:36Z"
  },
  {
    "title": "‘The Letter Is Meaningless!’: Chris Cuomo Torches WSJ Over Trump-Epstein ‘Hack Job’",
    "description": "Chris Cuomo criticized The Wall Street Journal for its piece alleging that Donald Trump sent Jeffrey Epstein a suggestive letter for his 50th birthday in 2003.",
    "link": "https://dailycaller.com/2025/07/18/chris-cuomo-torches-wsj-article-trump-epstein/",
    "timestamp": "2025-07-18T13:25:32Z"
  },
  {
    "title": "Is Mexican Coke Healthier Than US Coca-Cola? What to Know",
    "description": "Trump has announced that Coca-Cola will swap high-fructose corn syrup with cane sugar.",
    "link": "https://www.newsweek.com/donald-trump-coca-cola-coke-high-fructose-corn-syrup-cane-sugar-2100664",
    "timestamp": "2025-07-18T13:25:26Z"
  },
  {
    "title": "How trolling Trump became a strategy for Newsom (Alex Thompson/Axios)",
    "description": "Alex Thompson / Axios:\nHow trolling Trump became a strategy for Newsom  —  California Gov. Gavin Newsom recently shook up his communications team, and now the outspoken Democrat is turning many of Donald Trump's brash political tactics against the president h…",
    "link": "https://www.memeorandum.com/250718/p33",
    "timestamp": "2025-07-18T13:25:01Z"
  },
  {
    "title": "Billy Long will be sworn in as IRS commissioner, taking over an agency he once sought to close",
    "description": "Billy Long takes over an agency struggling with staffing cuts and leadership turnover.",
    "link": "https://www.bostonherald.com/2025/07/18/billy-long-irs-commissioner/",
    "timestamp": "2025-07-18T13:22:59Z"
  },
  {
    "title": "GOP’s foreign aid vote will cost lives — and they don’t care",
    "description": "Their decision to claw back $9 billion in funding will be catastrophic",
    "link": "https://www.salon.com/2025/07/18/gops-foreign-aid-vote-will-cost-lives-and-they-dont-care/",
    "timestamp": "2025-07-18T13:22:32Z"
  },
  {
    "title": "Indonesia negotiating zero US tariff for key commodities",
    "description": "The Indonesian government is trying to negotiate a zero percent import tariff deal for key commodities with the United States (US) government.\r\n\r\nDespite the ...",
    "link": "https://en.antaranews.com/news/367397/indonesia-negotiating-zero-us-tariff-for-key-commodities",
    "timestamp": "2025-07-18T13:21:52Z"
  },
  {
    "title": "Donald Trump's Vein Disorder, Chronic Venous Insufficiency, Explained",
    "description": "The White House released a memo from Trump's physician on Thursday which revealed the president was diagnosed with CVI after he noticed swelling in his legs.",
    "link": "https://www.newsweek.com/donald-trump-chronic-venous-insufficiency-2100660",
    "timestamp": "2025-07-18T13:20:22Z"
  },
  {
    "title": "Brazil’s former President Bolsonaro ordered to wear an electronic ankle monitor",
    "description": "Bolsonaro is currently on trial at the Supreme Court accused of leading an alleged attempt to stage a coup to overturn the 2022 election in which he was defeated by left-wing president Luiz Inácio Lula da Silva.",
    "link": "https://www.pbs.org/newshour/world/brazils-former-president-bolsonaro-ordered-to-wear-an-electronic-ankle-monitor",
    "timestamp": "2025-07-18T13:20:14Z"
  },
  {
    "title": "Jon Stewart on Potential ‘Daily Show’ Cancellation After Skydance Merger: ‘Been Kicked Out of S–ttier Establishments’",
    "description": "Jon Stewart does not sound like he is losing sleep over “The Daily Show” potentially being canceled if Skydance’s acquisition of Paramount is approved. Stewart, on the Thursday episode of his “The Weekly Show” podcast, was asked if he is concerned the deal wo…",
    "link": "https://freerepublic.com/focus/f-news/4329351/posts",
    "timestamp": "2025-07-18T13:20:11Z"
  },
  {
    "title": "Stephen Colbert May Have Never Had More Eyes on ‘The Late Show’ Last Night. Unfortunately, His Lead Guest Was Adam Schiff",
    "description": "By\n Tara Ariano\n Published: July 18th, 2025",
    "link": "https://www.cracked.com/article_47447_stephen-colbert-may-have-never-had-more-eyes-on-the-late-show-last-night-unfortunately-his-lead-guest-was-adam-schiff.html",
    "timestamp": "2025-07-18T13:20:00Z"
  },
  {
    "title": "Trump Says Biden Admin Would Have Released Epstein Files If They Contained ‘Smoking Gun’",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump said on Friday that if the Epstein files had contained solid incriminating evidence, the Biden administration would have made this information public.",
    "link": "https://sputnikglobe.com/20250718/trump-says-biden-admin-would-have-released-epstein-files-if-they-contained-smoking-gun-1122455941.html",
    "timestamp": "2025-07-18T13:19:19Z"
  },
  {
    "title": "Jesse Watters Combatively Apologizes to Gavin Newsom Over Lying Suit: ‘I’m Sorry’",
    "description": "Watters apologized that his show “made a mistake” in its reporting on a phone call between Gavin Newsom and Trump after the governor's $787M lawsuit.\nThe post Jesse Watters Combatively Apologizes to Gavin Newsom Over Lying Suit: ‘I’m Sorry’ first appeared on …",
    "link": "https://www.mediaite.com/media/tv/jesse-watters-combatively-apologizes-to-gavin-newsom-over-lying-suit-im-sorry/",
    "timestamp": "2025-07-18T13:19:16Z"
  },
  {
    "title": "President Donald Trump Comments on Cancellation of CBS’s The Late Show",
    "description": "Though the cancellation comes days after Stephen Colbert criticized Paramount for settling a Trump lawsuit, the company said it was 'purely a financial decision.'",
    "link": "https://www.adweek.com/tvnewser/president-donald-trump-comments-on-cancellation-of-cbss-the-late-show/",
    "timestamp": "2025-07-18T13:16:51Z"
  },
  {
    "title": "Donald Trump Jr-Backed Thumzup Media Approves $250M In Bitcoin, Ethereum, XRP, SOL, Dogecoin Treasury Purchases",
    "description": "Thumzup Media Corporation (NASDAQ:TZUP), a digital adtech company backed by Donald Trump Jr., has received board approval to allocate up to $250 million into cryptocurrencies.\nWhat Happened: The board authorization allows Thumzup to hold a diversified portfol…",
    "link": "https://biztoc.com/x/ea8a3a4faa9315fd",
    "timestamp": "2025-07-18T13:16:34Z"
  },
  {
    "title": "What is chronic venous insufficiency? Trump diagnosis puts the condition in the spotlight",
    "description": "Swollen legs led to President Donald Trump being diagnosed with what’s called chronic venous insufficiency. It’s a fairly common condition among older adults but requires a thorough checkup to rule out more serious causes of swelling in the legs. Here are som…",
    "link": "https://biztoc.com/x/45031799a3af6e81",
    "timestamp": "2025-07-18T13:16:33Z"
  },
  {
    "title": "GrabAGun stock price declines after SPAC merger and listing on NYSE",
    "description": "GrabAGun Digital Holdings, an online firearms store backed by Donald Trump Jr., did not have the stock market debut that he and other shareholders had hoped for. Instead, its shares fell 23% Thursday on their first day of trading on the New York Stock Exchang…",
    "link": "https://biztoc.com/x/138b6834d6c233e0",
    "timestamp": "2025-07-18T13:16:11Z"
  },
  {
    "title": "Top Holy Land Clerics Visit Gaza After Deadly Church Strike",
    "description": "Two of the most senior Christian leaders in Jerusalem travelled to Gaza on Friday after Israeli fire killed three at the Palestinian territory's only Catholic church, provoking international condemnation.",
    "link": "https://www.ibtimes.com.au/top-holy-land-clerics-visit-gaza-after-deadly-church-strike-1859708",
    "timestamp": "2025-07-18T13:15:13Z"
  },
  {
    "title": "Bolsonaro Ordered to Wear Ankle Monitor After Police Search (Bloomberg)",
    "description": "Bloomberg:\nBolsonaro Ordered to Wear Ankle Monitor After Police Search  —  Brazil's Supreme Court sent police to raid the home of former President Jair Bolsonaro and attach a monitor to his ankle just as Donald Trump piles pressure on the country to drop crim…",
    "link": "https://www.memeorandum.com/250718/p30",
    "timestamp": "2025-07-18T13:15:01Z"
  },
  {
    "title": "Brazil police raid former president Jair Bolsonaro’s home, headquarters",
    "description": "Raids come as Trump threatens Brazil with tariffs over Bolsonaro trial for seeking to overturn election loss.",
    "link": "https://www.aljazeera.com/news/2025/7/18/brazil-police-raid-former-president-jair-bolsonaros-home-headquarters",
    "timestamp": "2025-07-18T13:14:34Z"
  },
  {
    "title": "Trump’s Old Drawings Resurface as He Denies Epstein Birthday Letter",
    "description": "The Wall Street Journal on Thursday evening reported that President Trump sent a 50th birthday letter to infamous predator Jeffrey Epstein in 2003, containing a signed sketch of a naked woman and the ominous caption, “Happy Birthday — and may every day be ano…",
    "link": "https://newrepublic.com/post/198102/trump-old-drawings-epstein-birthday-letter-denial",
    "timestamp": "2025-07-18T13:13:21Z"
  },
  {
    "title": "CBS Canceling Stephen Colbert’s ‘Late Show’ Is an End of an Era for Television — and a Chilling Sign of What’s to Come",
    "description": "The news of “The Late Show’s” cancellation by CBS doesn’t just end a franchise that had, to this point, lasted more than 30 years. It looks like the beginning of the end of an entire category of television. With one network now opting out of late-night talk e…",
    "link": "https://variety.com/2025/tv/columns/why-colbert-late-show-cancellation-chilling-end-of-era-1236464578/",
    "timestamp": "2025-07-18T13:13:15Z"
  },
  {
    "title": "Opinion: Talking Point This Week - Ugly, Or Not?",
    "description": "Another batch of upbeat US economic data including solid retail sales boosted risk appetite on Thursday, pushing to the back of investors' minds President Donald Trump's attacks on Fed Chair Jerome Powell and lifting the S&P 500 and Nasdaq to fresh record hig…",
    "link": "https://www.ndtvprofit.com/opinion/talking-point-this-week-ugly-or-not",
    "timestamp": "2025-07-18T13:09:52Z"
  },
  {
    "title": "Friday, July 18, 2025",
    "description": "ACA premiums to rise, surprise medical bills, ICE access to Medicaid data, PEPFAR funds, vaccine uptake, and more. Plus, your weekend reads.",
    "link": "https://kffhealthnews.org/morning-briefing/friday-july-18-2025/",
    "timestamp": "2025-07-18T13:08:54Z"
  },
  {
    "title": "Huge Israeli Airstrikes on Damascus",
    "description": "Israel attacked the defense ministry building twice, and near the presidential palace in Damascus on July 16. As the afternoon traffic drove by in the heart of the city, huge plumes of smoke billowed from the landmark building. This was …\nThe post Huge Israel…",
    "link": "https://www.globalresearch.ca/sweida-peace-follows-huge-israeli-airstrikes-damascus/5895373",
    "timestamp": "2025-07-18T13:08:34Z"
  },
  {
    "title": "“It won’t just be Colbert”: Shocked viewers of “The Late Show” react to the show’s cancellation after Paramount calls it a “financial decision”",
    "description": "In a stunning move, CBS announced that The Late Show with Stephen Colbert will end its run in May 2026. \n\n\nThis happened just days after the late-night host criticized the network for settling with President Donald Trump. Colbert publicly revealed the show’s …",
    "link": "https://www.dailydot.com/entertainment/the-late-show-canceled/",
    "timestamp": "2025-07-18T13:08:29Z"
  }
]