[
  {
    "title": "Ted Cruz Lauds Trump’s ‘America First’ Greenland Threats After Viral Clip Bashing President Resurfaced",
    "description": "Cruz praised the Trump administration’s efforts to acquire the Danish territory in an interview on Sunday.",
    "link": "https://www.forbes.com/sites/zacharyfolk/2026/01/18/ted-cruz-lauds-trumps-america-first-greenland-threats-after-viral-clip-bashing-president-resurfaced/",
    "timestamp": "2026-01-18T17:32:16Z"
  },
  {
    "title": "Israel pushes back on Trump's picks for executives on Gaza 'Board of Peace'",
    "description": "Israel says it is unhappy it was not consulted, and Palestinians have also been critical.",
    "link": "https://www.bbc.com/news/articles/cd0y453yd90o",
    "timestamp": "2026-01-18T17:30:24Z"
  },
  {
    "title": "EXCLUSIVE: The One Astonishingly Obvious Reason Donald Trump is Being Branded 'Beyond a Moron' Over His Plan to Invade Greenland",
    "description": "Donald Trump is being branded 'beyond a moron' by critics and foreign policy experts after reviving talk of invading or taking over Greenland.",
    "link": "https://radaronline.com/p/donald-trump-greenland-invasion-plan-criticism-beyond-moron/",
    "timestamp": "2026-01-18T17:30:00Z"
  },
  {
    "title": "Progressive activist calls for prosecution of Trump and his allies if Dems take majority in Congress",
    "description": "rogressive activist Jennifer Welch told former CNN correspondent Jim Acosta that mass prosecutions of President Trump and his closest allies would be needed if Democrats regain power. \"I believe, and this is just my opinion, that Trump and all of the bottom-f…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362784/posts",
    "timestamp": "2026-01-18T17:28:06Z"
  },
  {
    "title": "Republicans and Democrats are trying to contain Trump's Greenland aggression. Will it be enough?",
    "description": "Republican lawmakers are opposing President Donald Trump's threats to take over Greenland. They are speaking out and meeting with Danish officials. This situation raises concerns about the future of NATO, a key alliance. Some Republicans are pushing for legis…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/republicans-and-democrats-are-trying-to-contain-trumps-greenland-aggression-will-it-be-enough/articleshow/126653900.cms",
    "timestamp": "2026-01-18T17:25:58Z"
  },
  {
    "title": "'Losers': Far-right influencers dogpiled after seen chanting Heil Hitler on party bus",
    "description": "A collection of far-right influencers were widely condemned Sunday after video of them chanting “heil Hitler” while aboard a party bus circulated online, amassing more than 7 million views in a matter of hours.The influencers included Andrew Tate – a pro-Trum…",
    "link": "https://www.rawstory.com/nick-fuentes-2674906472/",
    "timestamp": "2026-01-18T17:25:37Z"
  },
  {
    "title": "Greenland row: German military ends short deployment",
    "description": "German soldiers departed Greenland as scheduled. It comes amid President Donald Trump’s tariff threats and his claim that Greenland should belong to the US. What you need to know EU ambassadors summoned to emergency meeting in Brussels Germany ends reconnaiss…",
    "link": "https://freerepublic.com/focus/f-news/4362782/posts",
    "timestamp": "2026-01-18T17:23:09Z"
  },
  {
    "title": "Terror Behind the Magic: The Man Who Allegedly Targeted JD Vance and Threatened to Blow Up Disneyland",
    "description": "For decades, Disneyland has been heralded as “The Happiest Place on Earth,” a meticulously curated sanctuary where families escape the stresses of the real world to immerse themselves in fantasy. However, that illusion of safety was nearly shattered recently …",
    "link": "https://insidethemagic.net/2026/01/california-man-facing-federal-charges-after-threatening-to-blow-up-disneyland-during-jd-vances-visit-in-july-rl1/",
    "timestamp": "2026-01-18T17:18:35Z"
  },
  {
    "title": "Donald Trump Says He’ll Sign Executive Order To Mandate Exclusive Broadcast Window For Army-Navy Game",
    "description": "Donald Trump plans to sign an executive order to block out an exclusive window for the Army-Navy Game, an effort to preserve its date and its lack of competition from other games. His post on Saturday comes amid proposal to expand the College Football Playoff…",
    "link": "http://deadline.com/2026/01/trump-army-navy-game-broadcast-networks-1236689202/",
    "timestamp": "2026-01-18T17:16:52Z"
  },
  {
    "title": "Trump invites India to global Board of Peace aimed at Gaza stability",
    "description": "The proposed international body aims to oversee governance, coordinate funding and support Gaza’s transition from conflict to peace following a ceasefire between Israel and Hamas.",
    "link": "https://www.thehindubusinessline.com/news/trump-invites-india-to-global-board-of-peace-aimed-at-gaza-stability/article70523100.ece",
    "timestamp": "2026-01-18T17:14:04Z"
  },
  {
    "title": "Socialist Spanish PM Sanchez Calls for Creation of 'European Armed Forces' over Trump's Greenland Threats",
    "description": "Spanish Prime Minister Pedro Sánchez has called for the formation of a “European Armed Forces” in light of U.S. President Donald J. Trump’s threats to use military force to take control of Greenland. Despite having chronically underinvested in its own\nThe pos…",
    "link": "https://www.breitbart.com/europe/2026/01/18/socialist-spanish-pm-sanchez-calls-for-creation-of-european-armed-forces/",
    "timestamp": "2026-01-18T17:11:39Z"
  },
  {
    "title": "Piers Morgan jokingly blames Trump for fall as he shares health update from hospital bed",
    "description": "Morgan, who previously called Trump a friend, has changed his tune in the last few years",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/piers-morgan-hospital-trump-update-b2902750.html",
    "timestamp": "2026-01-18T17:06:15Z"
  },
  {
    "title": "There Is No ‘Nice’ Way to Do Mass Deportations",
    "description": "Predictably, a fresh wave of outrage against President Donald Trump and his administration’s immigration policies followed the shooting in Minnesota of anti-ICE activist Renee Good. Viral videos of alleged outrages committed by ICE agents are bolstering the c…",
    "link": "https://freerepublic.com/focus/f-news/4362780/posts",
    "timestamp": "2026-01-18T17:05:19Z"
  },
  {
    "title": "Trump announces new tariffs over Greenland: How have EU allies responded?",
    "description": "The European Union is having an emergency meeting to devise a response to Trump's tariff threats over Greenland.",
    "link": "https://www.aljazeera.com/news/2026/1/18/trump-announces-new-tariffs-over-greenland-how-have-eu-allies-responded",
    "timestamp": "2026-01-18T17:05:05Z"
  },
  {
    "title": "Van Hollen: I Won't Vote to Fund Trump's Lawless, Brutal ICE Operations",
    "description": "Sunday on ABC's \"This Week,\" Sen. Chris Van Hollen (D-MD) said he would not vote to fund Immigration and Customs Enforcement (ICE).\nThe post Van Hollen: I Won’t Vote to Fund Trump’s Lawless, Brutal ICE Operations appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/01/18/van-hollen-i-wont-vote-to-fund-trumps-lawless-brutal-ice-operations/",
    "timestamp": "2026-01-18T17:04:10Z"
  },
  {
    "title": "The crooks are still in charge of Venezuela — US should plot a road map to freedom",
    "description": "President Trump’s grandiose promises to “make Venezuela rich” may end up like others of his that have so far failed to materialize.",
    "link": "https://nypost.com/2026/01/18/opinion/the-crooks-are-still-in-charge-of-venezuela-us-should-plot-a-road-map-to-freedom/",
    "timestamp": "2026-01-18T17:02:24Z"
  },
  {
    "title": "Who is part of Trump’s ‘Board of Peace’ for Gaza?",
    "description": "Trump unveils a complex three-tier governing structure for Gaza that places Trump and pro-Israel officials at the top.",
    "link": "https://www.aljazeera.com/news/2026/1/18/who-is-part-of-trumps-board-of-peace-for-gaza",
    "timestamp": "2026-01-18T17:02:22Z"
  },
  {
    "title": "Global markets brace for volatility as Trump threatens Europe tariffs over Greenland",
    "description": "Markets face fresh volatility as Trump vows tariffs on eight European nations over Greenland, reviving US-EU trade war fears and boosting safe-haven demand.",
    "link": "https://www.thehindubusinessline.com/markets/global-markets-brace-for-volatility-as-trump-threatens-europe-tariffs-over-greenland/article70523074.ece",
    "timestamp": "2026-01-18T17:00:45Z"
  },
  {
    "title": "Blair Distances Himself From Trump’s $1 Billion Peace Board Fee",
    "description": "Tony Blair, the former UK prime minister who’s been appointed to the executive panel of Donald Trump’s Board of Peace, distanced himself from the president’s demand that countries pay $1 billion for permanent membership.",
    "link": "https://financialpost.com/pmn/business-pmn/blair-distances-himself-from-trumps-1-billion-peace-board-fee",
    "timestamp": "2026-01-18T17:00:15Z"
  },
  {
    "title": "Trump's 'Board of Peace' hits a bump in the road",
    "description": "Only Hungary openly backs plan as other nations voice concern over US-led body, chaired by Trump, they say could sideline the United Nations.",
    "link": "https://www.israelnationalnews.com/news/421087",
    "timestamp": "2026-01-18T16:59:16Z"
  },
  {
    "title": "‘We believe in Allah, but we can’t do anything’: Somali shops reel in Minneapolis because ICE is bad for business",
    "description": "Abdi Wahid said early afternoons at the family business once meant 15 to 20 customers. These days, it’s tough to get one.",
    "link": "https://fortune.com/2026/01/18/somali-shops-small-business-minnesota-suffer-ice-crackdown/",
    "timestamp": "2026-01-18T16:56:45Z"
  },
  {
    "title": "Iran protests death toll crosses 5,000 as officials warn of executions",
    "description": "Protests that began on December 28 over economic hardship escalated into calls to end clerical rule, marking the deadliest unrest since 1979",
    "link": "https://www.thehindubusinessline.com/news/world/iran-protests-death-toll-crosses-5000-as-officials-warn-of-executions/article70523046.ece",
    "timestamp": "2026-01-18T16:50:24Z"
  },
  {
    "title": "TikTok’s ‘2026 Is The New 2016’ Trend, Explained",
    "description": "In 2026, TikTok and Instagram are looking back to 2016, and remembering the good times—here’s why social media users are so nostalgic for the old days.",
    "link": "https://www.forbes.com/sites/danidiplacido/2026/01/18/tiktoks-2016-is-the-new-2026-trend-explained/",
    "timestamp": "2026-01-18T16:50:20Z"
  },
  {
    "title": "Minneapolis posts anti-ICE video promoting 'peaceful protest' and unity",
    "description": "Minneapolis releases anti-ICE video promoting \"peaceful protest\" as tensions escalate. Federal agents face harassment while troops prepare for deployment.",
    "link": "https://www.foxnews.com/us/minneapolis-posts-anti-ice-video-promoting-peaceful-protest-unity",
    "timestamp": "2026-01-18T16:48:09Z"
  },
  {
    "title": "Bruce Springsteen Dedicates ‘Promised Land’ to Renee Good, Decries ‘Gestapo Tactics’ Leading to Citizens Being ‘Murdered’: ‘ICE Should Get the F— Out of Minneapolis’",
    "description": "In an unbilled performance Saturday night at the Light of Day festival in New Jersey, Bruce Springsteen took solemn time out during an otherwise celebratory 75-minute set to dedicate “The Promised Land” to the memory of slain Minneapolis woman Renee Good, dec…",
    "link": "https://variety.com/2026/music/news/bruce-springsteen-dedicates-renee-good-ice-gestapo-tactics-1236634267/",
    "timestamp": "2026-01-18T16:44:18Z"
  },
  {
    "title": "No decision on CFP expansion expected as deadline looms, leaders remain deadlocked on formatting",
    "description": "College Football Playoff leaders met Sunday in South Beach with expansion on the table and no resolution in sight. With the Big Ten and SEC still split on 16 vs. 24 teams, the postseason remains stuck at 12 with a deadline looming Friday.",
    "link": "https://www.cbssports.com/college-football/news/college-football-playoff-expansion-decision-big-ten-sec-formatting/",
    "timestamp": "2026-01-18T16:39:35Z"
  },
  {
    "title": "NFL fines Texans’ Azeez Al-Shaair for wearing ‘stop the genocide’ eye black",
    "description": "Texans linebacker Azeez Al-Shaair was fined $11,593 by the NFL for wearing eye black that contained the political message \"stop the genocide.\"",
    "link": "https://nypost.com/2026/01/18/sports/nfl-fines-texans-azeez-al-shaair-for-wearing-stop-the-genocide-eye-black/",
    "timestamp": "2026-01-18T16:37:54Z"
  },
  {
    "title": "More countries confirm invites to Trump's Board of Peace for rebuilding Gaza",
    "description": "At least four more countries on Sunday said the United States has invited them to join President Donald Trump's \"Board of Peace,\" a new body meant to oversee next steps in Gaza.",
    "link": "https://www.pbs.org/newshour/world/more-countries-confirm-invites-to-trumps-board-of-peace-for-rebuilding-gaza",
    "timestamp": "2026-01-18T16:35:07Z"
  },
  {
    "title": "Venezuela’s acting leader was once a DEA 'priority target': report",
    "description": "Venezuela's interim president Delcy Rodríguez was reportedly labeled a DEA \"priority target\" in 2022, appearing in intelligence files since at least 2018.",
    "link": "https://www.foxnews.com/world/venezuelas-acting-leader-once-dea-priority-target-report",
    "timestamp": "2026-01-18T16:33:16Z"
  },
  {
    "title": "German soldiers leave Greenland",
    "description": "Several European nations have recently sent troops to boost security of the Danish autonomous territory amid US threats to acquire it Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631113-german-soldiers-leave-greenland-trump/",
    "timestamp": "2026-01-18T16:31:09Z"
  },
  {
    "title": "Pentagon readies 1,500 troops to control Minnesota riots – WaPo",
    "description": "US President Donald Trump’s anti-immigration crackdown in Minnesota has been met with months of protests Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631117-pentagon-1500-troops-minnesota-riots/",
    "timestamp": "2026-01-18T16:30:57Z"
  },
  {
    "title": "'We'll Sue Your A-- Off': White House Threatens Lawsuit as Donald Trump Spars With CBS Evening News Anchor on Camera",
    "description": "Karoline Leavitt warned CBS News that they could face a lawsuit if it didn't air Donald Trump’s interview in full.",
    "link": "https://radaronline.com/p/white-house-threatens-lawsuit-donald-trump-spars-cbs/",
    "timestamp": "2026-01-18T16:30:00Z"
  },
  {
    "title": "Trump invites India to join proposed ‘Board of Peace’ for Gaza",
    "description": "India has reportedly received an invitation from US President Donald Trump to join a new 'Board of Peace' focused on Gaza. This initiative aims for a more agile approach to resolving global conflicts. While Hungary has accepted, other nations are responding c…",
    "link": "https://economictimes.indiatimes.com/news/india/trump-invites-india-to-join-proposed-board-of-peace-for-gaza/articleshow/126650278.cms",
    "timestamp": "2026-01-18T16:27:23Z"
  },
  {
    "title": "A stunned Europe finally wakes up to Trump's Greenland threat (Tim Lister/CNN)",
    "description": "Tim Lister / CNN:\nA stunned Europe finally wakes up to Trump's Greenland threat  —  Donald Trump NATO Tariffs European Union  —  It's not often that Europe speaks with one voice - or responds with such urgency.  —  But US President Donald Trump's announcement…",
    "link": "https://www.memeorandum.com/260118/p42",
    "timestamp": "2026-01-18T16:25:00Z"
  },
  {
    "title": "Brazil’s Billionaire Batistas Poised for Venezuelan Oil Revival",
    "description": "The billionaire Batista brothers are eyeing a billion-barrel Venezuelan oil project that stands to benefit from US President Donald Trump’s planned revival of the South American nation’s energy sector.",
    "link": "https://financialpost.com/pmn/business-pmn/brazils-billionaire-batistas-poised-for-venezuelan-oil-revival",
    "timestamp": "2026-01-18T16:24:55Z"
  },
  {
    "title": "Europe warns of 'dangerous downward spiral' after Trump threatens tariffs over Greenland",
    "description": "Europe condemns Trump's tariff threats over Greenland, warning of a dangerous downward spiral in transatlantic relations and shared security.",
    "link": "https://www.thehindubusinessline.com/news/world/europe-warns-of-dangerous-downward-spiral-after-trump-threatens-tariffs-over-greenland/article70522973.ece",
    "timestamp": "2026-01-18T16:24:48Z"
  },
  {
    "title": "Piers Morgan Reveals He’s Been Hospitalized, Details Surgery and Recovery",
    "description": "Political commentator Piers Morgan has been hospitalized and is detailing his painful ordeal, including necessary surgery. “1. Tripped on small step. 2. In a London hotel restaurant. 3. Fractured femur,” Morgan, 60, wrote via X and Instagram on Sunday, Januar…",
    "link": "https://www.usmagazine.com/celebrity-news/news/piers-morgan-reveals-hes-been-hospitalized-details-recovery-journey/#article",
    "timestamp": "2026-01-18T16:24:39Z"
  },
  {
    "title": "Europe hits back at Trump’s tariff threat over Greenland",
    "description": "European leaders slam Donald Trump’s threat to impose tariffs over Greenland, warning the move risks a dangerous transatlantic trade war and harms relation\n\nRead More: https://punchng.com/europe-hits-back-at-trumps-tariff-threat-over-greenland/",
    "link": "https://punchng.com/europe-hits-back-at-trumps-tariff-threat-over-greenland/",
    "timestamp": "2026-01-18T16:20:32Z"
  },
  {
    "title": "President Trump - Truth Social post about the Minneapolis violence",
    "description": "ICE is removing some of the most violent criminals in the World from our Country, and bring them back home, where they belong. Why is Minnesota fighting this? Do they really want murderers and drug dealers to be ensconced in their community? The thugs that ar…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362775/posts",
    "timestamp": "2026-01-18T16:20:04Z"
  },
  {
    "title": "Peace boards and technocrats won’t stem out Palestinian resistance",
    "description": "Any governance structure that does not take into account the Palestinian national aspirations is doomed to failure.",
    "link": "https://www.aljazeera.com/opinions/2026/1/18/peace-boards-and-technocrats-wont-stem-out-palestinian-resistance",
    "timestamp": "2026-01-18T16:19:41Z"
  },
  {
    "title": "FO° Podcasts: Maduro, the War on Drugs and Trump’s Revival of the Monroe Doctrine",
    "description": "Editor-in-Chief Atul Singh and Benjamin Delille, foreign correspondent for the French newspaper Libération, discuss US President Donald Trump’s confrontation with Venezuela. The discussion probes Washington’s stated war on drugs, the revival of the 1823 Monro…",
    "link": "https://www.fairobserver.com/podcasts/fo-podcasts-maduro-the-war-on-drugs-and-trumps-revival-of-the-monroe-doctrine/",
    "timestamp": "2026-01-18T16:18:57Z"
  },
  {
    "title": "Trump has not yet ‘shown his hand’ on Greenland as tariffs raise the stakes, foreign policy expert says",
    "description": "Trump threatens tariffs on Denmark and European allies to pressure negotiations over Greenland acquisition, with rates potentially rising to 25% by June.",
    "link": "https://www.foxnews.com/media/trump-has-not-yet-shown-his-hand-greenland-tariffs-raise-stakes-foreign-policy-expert-says",
    "timestamp": "2026-01-18T16:18:53Z"
  },
  {
    "title": "Piers Morgan blames Trump for hospitalization",
    "description": "British presenter Piers Morgan revealed he broke his hip during a visit to a restaurant in London, and tweeted, 'I blame Donald Trump'.",
    "link": "https://www.israelnationalnews.com/news/421085",
    "timestamp": "2026-01-18T16:18:47Z"
  },
  {
    "title": "Roger Waters Defends Murderous Iranian Regime amid Protests: 'One Man's Terrorism Is Another Man's Freedom Fighting'",
    "description": "Pink Floyd co-founder Rogers Waters defended the murderous regime in Iran, one week after defending former Venezuelan dictator Nicolás Maduro, calling claims that Iran has been a leading sponsor of terrorism around the world \"nonsense.\"",
    "link": "https://www.breitbart.com/entertainment/2026/01/18/roger-waters-defends-murderous-iranian-regime-amid-protests-one-mans-terrorism-is-another-mans-freedom-fighting/",
    "timestamp": "2026-01-18T16:15:33Z"
  },
  {
    "title": "‘SNL’s First Cold Open of 2026 Goes Big: Trump, Maduro, Minneapolis, and “Canceled” Midterms",
    "description": "Trump’s back, the midterms aren’t, and SNL is fully unhinged again.",
    "link": "https://decider.com/2026/01/18/snl-cold-open-2026-trump-maduro-minneapolis-midterms/",
    "timestamp": "2026-01-18T16:15:30Z"
  },
  {
    "title": "Man Trains Crows to Attack MAGA Hats",
    "description": "\"Some folks want to befriend crows, or get them to bring trinkets. I have... other goals.\"\nThe post Man Trains Crows to Attack MAGA Hats appeared first on Futurism.",
    "link": "http://futurism.com/future-society/crows-attack-maga-hats",
    "timestamp": "2026-01-18T16:15:00Z"
  },
  {
    "title": "‘It does change the mindset’: ICE director admits clashes with protesters forcing officers to shift gears",
    "description": "'In my 30 years of law enforcement, I never thought we would have to send law enforcement to protect law enforcement'",
    "link": "https://www.wnd.com/2026/01/it-does-change-mindset-ice-director-admits-clashes/",
    "timestamp": "2026-01-18T16:14:02Z"
  },
  {
    "title": "More countries confirm invites to Trump's Board of Peace for Gaza. $1 billion buys a permanent seat",
    "description": "At least four more countries say the United States has invited them to join President Donald Trump’s new “Board of Peace\" overseeing next steps for Gaza",
    "link": "https://abcnews.go.com/International/wireStory/countries-confirm-invites-trumps-board-peace-gaza-1-129329341",
    "timestamp": "2026-01-18T16:13:55Z"
  },
  {
    "title": "Europe warns of 'dangerous downward spiral' after Trump threatens tariffs over Greenland",
    "description": "The eight European countries targeted by U_S_ President Donald Trump for a 10% tariff for opposing American control of Greenland have criticized the move in an unusually strong joint statement, warning that his threats “undermine transatlantic relation...",
    "link": "https://abcnews.go.com/International/wireStory/europe-warns-dangerous-downward-spiral-after-trump-threatens-129324725",
    "timestamp": "2026-01-18T16:13:54Z"
  },
  {
    "title": "Republicans and Democrats are trying to contain Trump's Greenland aggression. Will it be enough?",
    "description": "Republican lawmakers are scrambling to contain President Donald Trump’s threats of taking possession of Greenland",
    "link": "https://abcnews.go.com/US/wireStory/republicans-democrats-trumps-greenland-aggression-129329251",
    "timestamp": "2026-01-18T16:13:48Z"
  },
  {
    "title": "Detained Iranian protester in good physical health after execution fears, family and rights group say | CNN",
    "description": "Detained Iranian protester Erfan Soltani, whose execution did not take place on Wednesday as some had feared, is in good physical health and has been able to meet with his family, according to a family member and a human rights group.",
    "link": "https://www.cnn.com/2026/01/18/middleeast/erfan-soltani-iran-protester-alive-execution-fears-intl",
    "timestamp": "2026-01-18T16:12:15Z"
  },
  {
    "title": "India gets Trump’s invite to join Board of Peace on Gaza, source says",
    "description": "NEW DELHI, Jan 18 (Reuters) - India has received an invitation from U.S. President Donald Trump to join his “Board of Peace” initiative that is aimed at resolving global … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/18/india-gets-trump-s-invite-to-join-board-of-peace-on-gaza-source-says",
    "timestamp": "2026-01-18T16:11:28Z"
  },
  {
    "title": "Iran's president warns any U.S. attack on Supreme Leader Khamenei would mean 'all-out war'",
    "description": "President Pezeshkian's threat comes after Trump hinted at regime change in an interview with Politico, calling for 'new leadership in Iran'",
    "link": "https://www.haaretz.com/israel-news/2026-01-18/ty-article/irans-president-warns-any-u-s-attack-on-khamenei-would-mean-all-out-war/0000019b-d1d5-db88-a7df-d3fddfa90000",
    "timestamp": "2026-01-18T16:10:32Z"
  },
  {
    "title": "Europe warns of 'dangerous downward spiral' after Trump threatens tariffs over Greenland",
    "description": "The eight European countries targeted by U.S. President Donald Trump for a 10% tariff for opposing American control of Greenland have criticized the move in an unusually strong joint statement, warning that his threats “undermine transatlantic relations and r…",
    "link": "https://apnews.com/article/greenland-denmark-us-trump-eu-tariffs-4e63efa690604004c69fc89a7c14e7c2",
    "timestamp": "2026-01-18T16:09:49Z"
  },
  {
    "title": "Canada 'concerned' about Trump's Greenland tariff threats, says PM Carney",
    "description": "Prime Minister Mark Carney says Canada is \"concerned\" about U.S. President Donald Trump's threat to impose increasing tariffs on several European countries until they accede to his demand to purchase and control Greenland.",
    "link": "https://www.cbc.ca/news/politics/canada-greenland-carney-trump-tariffs-9.7050435",
    "timestamp": "2026-01-18T16:09:10Z"
  },
  {
    "title": "India invited to join Board of Peace",
    "description": "Real time news brief - India invited to join Board of Peace - Israel National News flashes around the clock are waiting for you on the site",
    "link": "https://www.israelnationalnews.com/flashes/674638",
    "timestamp": "2026-01-18T16:07:40Z"
  },
  {
    "title": "Trump's Plan to Seize Greenland is Simultaneously Evil, Illegal, and Counterproductive",
    "description": "It would alienate allies, impose US rule on an unwilling population, and blatantly violate both US and international law.The plan to impose tariffs on nations opposing the seizure is also illegal and harmful.",
    "link": "https://reason.com/volokh/2026/01/18/trumps-plan-to-seize-greenland-is-simultaneously-evil-illegal-and-stupidly-counterproductive/",
    "timestamp": "2026-01-18T16:06:30Z"
  },
  {
    "title": "DAVID MARCUS: Sorry Omar Fateh, we're not doing Somali-run no-go zones in Minnesota",
    "description": "Minnesota state senator Omar Fateh pledged to make Cedar Riverside a 'no-go zone for white supremacists' in social media posts that sparked debate.",
    "link": "https://www.foxnews.com/opinion/david-marcus-sorry-omar-fateh-were-not-doing-somali-run-no-go-zones-minnesota",
    "timestamp": "2026-01-18T16:04:46Z"
  },
  {
    "title": "SNL Returns: Finn Wolfhard Gets By With a Little Help From His Friends",
    "description": "After a bit of a winter hibernation, NBC's Saturday Night Live returned this weekend with host Finn Wolfhard (Stranger Things 5) and musical guest A$AP Rocky. Heading into the show, we shared five key points we were keeping in mind about SNL's midseason retur…",
    "link": "https://bleedingcool.com/tv/snl-returns-finn-wolfhard-gets-by-with-a-little-help-from-his-friends/",
    "timestamp": "2026-01-18T16:04:07Z"
  },
  {
    "title": "Hungarian Prime Minister Accepts Trump's Invitation to Join Gaza Board of Peace",
    "description": "MOSCOW (Sputnik) - Hungarian Prime Minister Viktor Orban said on Sunday that he had accepted US President Donald Trump's invitation to join the Gaza Board of Peace.",
    "link": "https://sputnikglobe.com/20260118/hungarian-prime-minister-accepts-trumps-invitation-to-join-gaza-board-of-peace-1123483827.html",
    "timestamp": "2026-01-18T16:02:05Z"
  },
  {
    "title": "'Absolutely chilling': Ex-DOJ lawyer flags Trump official's act that 'shook me to my core'",
    "description": "A former DOJ pardon attorney on Saturday highlighted a Donald Trump official's \"absolutely chilling\" move that she said shook her to her core.DOJ ex-insider Liz Oyer appeared on MS NOW over the weekend, where she was asked about a recent \"joke\" Trump made abo…",
    "link": "https://www.rawstory.com/trump-todd-blanche-2674906264/",
    "timestamp": "2026-01-18T16:00:48Z"
  },
  {
    "title": "Piers Morgan Hospitalized After Fall, Undergoes Hip Replacement",
    "description": "Piers Morgan is hospitalized after a painful fall, which landed him with a brand new hip. The broadcaster revealed Sunday he's recovering in a London hospital after tripping at a restaurant, suffering a serious femur fracture that required a hip…\n Permalink",
    "link": "https://www.tmz.com/2026/01/18/piers-morgan-hospitalized-after-fall/",
    "timestamp": "2026-01-18T16:00:05Z"
  },
  {
    "title": "Official mocked for saying meal can be ‘piece of chicken, a piece of broccoli, a corn tortilla and one other thing’",
    "description": "Brooke Rollins says meal can be 'piece of chicken, broccoli, tortilla, one other thing'.",
    "link": "https://syndication.washingtonpost.com/nss/stories/ZRDDNKWDVBAO7NLZFFI47ABXSA",
    "timestamp": "2026-01-18T16:00:00Z"
  },
  {
    "title": "Christopher Luxon’s election-year opener: Prime Minister to remind New Zealanders of steady progress as Donald Trump causes turbulence overseas",
    "description": "ANALYSIS: The National Party leader is yet to comment on major world events.",
    "link": "https://www.nzherald.co.nz/nz/politics/christopher-luxons-election-year-opener-prime-minister-to-remind-new-zealanders-of-steady-progress-as-donald-trump-causes-turbulence-overseas/premium/HXPIE7UPYJE6LDXXCPPJNDM2QM/",
    "timestamp": "2026-01-18T16:00:00Z"
  },
  {
    "title": "Letters: The All Blacks have been spoilt by success over an epoch",
    "description": "OPINION: Country Calendar is a national treasure, a reader writes.",
    "link": "https://www.nzherald.co.nz/nz/letters-the-all-blacks-have-been-spoilt-by-success-over-an-epoch/premium/J7TRUDCD6JFPZHLVEG3M3746NM/",
    "timestamp": "2026-01-18T16:00:00Z"
  },
  {
    "title": "Republicans and Democrats are trying to contain Trump's Greenland aggression. Will it be enough?",
    "description": "Republican lawmakers are scrambling to contain President Donald Trump's threats of taking possession of Greenland, with some showing the most strident...",
    "link": "https://www.yahoo.com/news/articles/republicans-democrats-trying-contain-trumps-155858941.html",
    "timestamp": "2026-01-18T15:58:58Z"
  },
  {
    "title": "Trump Wants to Buy More Icebreakers to Patrol Off Canada - Reports",
    "description": "MOSCOW (Sputnik) - US President Donald Trump has expressed interest in purchasing additional icebreakers to patrol waters off Canada, NBC News reported on Sunday, citing US officials.",
    "link": "https://sputnikglobe.com/20260118/trump-wants-to-buy-more-icebreakers-to-patrol-off-canada---reports-1123483696.html",
    "timestamp": "2026-01-18T15:57:26Z"
  },
  {
    "title": "‘If I Said That, I Was Wrong’: Treasury Secretary Bizarrely Backpedals from Report He Privately Fumed at Trump",
    "description": "Treasury Secretary Scott Bessent bizarrely backpedaled from a report that he privately fumed at Trump about the DOJ probe of Fed Chair Jerome Powell.\nThe post ‘If I Said That, I Was Wrong’: Treasury Secretary Bizarrely Backpedals from Report He Privately Fume…",
    "link": "https://www.mediaite.com/media/news/if-i-said-that-i-was-wrong-treasury-secretary-bizarrely-backpedals-from-report-he-privately-fumed-at-trump/",
    "timestamp": "2026-01-18T15:55:53Z"
  },
  {
    "title": "Martin denies Government is moving away from Occupied Territories Bill in favour of 'peace process approach'",
    "description": "The Taoiseach said the Bill would have “very little impact” on Israeli policy and he could not give a timeline on when it will be enacted.",
    "link": "https://www.thejournal.ie/occupied-territories-bill-micheal-martin-delay-peace-gaza-6930836-Jan2026/",
    "timestamp": "2026-01-18T15:55:26Z"
  },
  {
    "title": "Trump to Sign Executive Order Giving Army-Navy Football Game a TV Window",
    "description": "The move would be a boost to David Ellison's Paramount, which holds the rights to the game, and a blow to Disney's ESPN, which has College Football Playoff Rights.",
    "link": "http://www.hollywoodreporter.com/tv/tv-news/trump-executive-order-army-navy-game-broadcast-time-slot-1236477319/",
    "timestamp": "2026-01-18T15:51:19Z"
  },
  {
    "title": "Navy Football Officially Responds To President Trump's Demand",
    "description": "Navy's football program has officially responded to President Trump's demand. The Army vs. Navy game has been played on a standalone Saturday in the middle of December for several years. It's a cool setting - and opportunity - for the historic college footbal…",
    "link": "https://thespun.com/college-football/navy-football-officially-responds-to-president-trumps-demand",
    "timestamp": "2026-01-18T15:49:49Z"
  },
  {
    "title": "Donald Trump throws wrench in 16-team CFP expansion with proposed ‘Army-Navy’ executive decision",
    "description": "The commander in chief wants to amend college football's final week.",
    "link": "https://www.sportingnews.com/us/ncaa-football/news/donald-trump-throws-wrench-16-team-cfp-expansion-proposed-army-navy-executive-decision/3eb6a4fb4ad72ad0cd240587",
    "timestamp": "2026-01-18T15:49:28Z"
  },
  {
    "title": "'Make America Go Away': Denmark incensed by Trump's push for Greenland",
    "description": "A bipartisan U.S. congressional delegation, intending to express solidarity in the face of Trump’s Greenland rhetoric, wrapped up a visit to the Danish capital.",
    "link": "https://www.nbcnews.com/world/europe/make-america-go-away-denmark-incensed-trumps-push-greenland-rcna254541",
    "timestamp": "2026-01-18T15:47:18Z"
  },
  {
    "title": "Mar-a-Lago Party With Dog Masks Draws Questions",
    "description": "Mar-a-Lago Party With Dog Masks Draws Questionscafemom.com",
    "link": "https://cafemom.com/entertainment/mar-a-lago-furry-party",
    "timestamp": "2026-01-18T15:44:46Z"
  },
  {
    "title": "'Run, Julia, Run!': President Trump Urges 'Total Winner' Rep. Julia Letlow to Primary Sen. Bill Cassidy",
    "description": "Rep. Julia Letlow (R-LA) secured President Donald Trump's endorsement on Saturday, a move that could see her primary Sen. Bill Cassidy (R-LA).\nThe post ‘Run, Julia, Run!’: President Trump Urges ‘Total Winner’ Rep. Julia Letlow to Primary Sen. Bill Cassidy app…",
    "link": "https://www.breitbart.com/politics/2026/01/18/run-julia-run-president-trump-urges-total-winner-rep-letlow-to-primary-sen-cassidy/",
    "timestamp": "2026-01-18T15:43:40Z"
  },
  {
    "title": "Electricity as the new eggs: Affordability concerns will swing the midterms just like the 2024 election, Bill McKibben says",
    "description": "“I think you’re starting to see that have a big political impact in the U.S. right now,” said McKibben, founder of multiple environmental activist groups.",
    "link": "https://fortune.com/2026/01/18/electricity-prices-are-the-new-eggs-midterms-affordability-data-centers-bill-mckibben/",
    "timestamp": "2026-01-18T15:41:38Z"
  },
  {
    "title": "Minneapolis Mayor Jacob Frey says it would be a 'shocking step' for Trump to invoke the Insurrection Act",
    "description": "Minneapolis Mayor Jacob Frey said in an interview with NBC News' \"Meet the Press\" that if President Donald Trump invoked the Insurrection Act to deploy the military to Minnesota, \"that would be a shocking step.\"",
    "link": "https://www.nbcnews.com/politics/politics-news/minneapolis-mayor-jacob-frey-trump-invoke-insurrection-act-troops-rcna254651",
    "timestamp": "2026-01-18T15:39:05Z"
  },
  {
    "title": "Delhi CM Rekha Gupta inaugurates development works worth Rs 100 crore",
    "description": "Addressing the gathering, Rekha Gupta said that the Delhi government has assured all public representatives that there will be no shortage of funds for development works.",
    "link": "https://timesofindia.indiatimes.com/india/delhi-cm-rekha-gupta-inaugurates-development-works-worth-rs-100-crore/articleshow/126648319.cms",
    "timestamp": "2026-01-18T15:38:49Z"
  },
  {
    "title": "Nick Fuentes clarifies his problem with Trump ‘is that he is not Hitler’",
    "description": "In the fall, a video of Nick Fuentes criticizing Donald Trump drew the praise of progressive former US congressman Jamaal Bowman. “Finally getting it Nick,” Bowman commented, apparently recognizing some common ground between himself on the left and Fuentes, o…",
    "link": "https://freerepublic.com/focus/f-chat/4362768/posts",
    "timestamp": "2026-01-18T15:37:23Z"
  },
  {
    "title": "America’s NATO allies erupt in tariff fury: read their rebuke of Trump",
    "description": "European governments blasted Trump’s announcement that eight countries will face 10% tariff for opposing U.S. control of Greenland beginning next month.",
    "link": "https://fortune.com/2026/01/18/americas-nato-allies-erupt-in-tariff-fury-read-their-rebuke-of-trump/",
    "timestamp": "2026-01-18T15:37:11Z"
  },
  {
    "title": "Don’s Greenland fixation: Letters to the Editor — Jan. 19, 2026",
    "description": "NY Post readers discuss President Trump’s insistence on the United States taking control of Greenland.",
    "link": "https://nypost.com/2026/01/18/opinion/dons-greenland-fixation-letters/",
    "timestamp": "2026-01-18T15:34:12Z"
  },
  {
    "title": "CIA director meets with Delcy Rodriguez in Venezuela",
    "description": "A White House official said the meeting lasted for two hours and came at the urging of President Donald Trump.",
    "link": "https://fortune.com/2026/01/18/cia-director-meets-with-delcy-rodriguez-in-venezuela/",
    "timestamp": "2026-01-18T15:34:05Z"
  },
  {
    "title": "'Please help me baby!' GOP pundit begs Elon Musk to unban him after cheering Iran bombing",
    "description": "Conservative radio host Dennis Kneale took to Newsmax Sunday to beg Elon Musk to reverse his permanent ban on the social media platform X – which Musk owns – after having joked on the platform about bombing Iran.“My X account has been permanently suspended! I…",
    "link": "https://www.rawstory.com/elon-musk-2674906344/",
    "timestamp": "2026-01-18T15:34:01Z"
  },
  {
    "title": "Trump accused Venezuela’s Maduro of massive drug dealing. The AP has receipts about the DEA’s probe of Delcy Rodriguez, too",
    "description": "Rodríguez has been on the radar of the DEA for years and in 2022 was even labeled a “priority target.\"",
    "link": "https://fortune.com/2026/01/18/delcy-rodriguez-dea-investigation-priority-target-venezuela-trump-maduro-drugs/",
    "timestamp": "2026-01-18T15:33:35Z"
  },
  {
    "title": "Trump accuses Tim Walz and Ilhan Omar of using ICE protests to distract from massive state fraud",
    "description": "President Donald Trump targeted Minnesota Democrats on over ICE operations, alleging they are distracting from state fraud issues and investigations.",
    "link": "https://www.foxnews.com/politics/trump-accuses-tim-walz-ilhan-omar-using-ice-protests-distract-massive-state-fraud",
    "timestamp": "2026-01-18T15:32:37Z"
  },
  {
    "title": "Gallego: Trump Has Turned ICE into a Third World 'Goon Squad'",
    "description": "Sunday on CNN's \"The State of the Union,\" Sen. Ruben Gallego (D-AZ) said President Donald Trump has turned Immigration and Customs Enforcement (ICE) into a third-world \"goon squad.\"\nThe post Gallego: Trump Has Turned ICE into a Third World ‘Goon Squad’ appear…",
    "link": "https://www.breitbart.com/clips/2026/01/18/gallego-trump-has-turned-ice-into-a-third-world-goon-squad/",
    "timestamp": "2026-01-18T15:31:13Z"
  },
  {
    "title": "International Net Zero Summit to be held at Panaji",
    "description": "Panaji: To strengthen collaborative action, policy alignment, and industry-led solutions for India’s transition to a net-zero economy, the Internation.",
    "link": "https://timesofindia.indiatimes.com/city/goa/international-net-zero-summit-to-be-held-at-panaji/articleshow/126647860.cms",
    "timestamp": "2026-01-18T15:29:52Z"
  },
  {
    "title": "Major U.S. allies in western Europe warn of ‘dangerous downward spiral’ as Trump threatens tariffs over his lust for Greenland",
    "description": "In an unusual, strong joint statement from major U.S. allies, Denmark, Norway, Sweden, France, Germany, the UK, the Netherlands and Finland spoke as one.",
    "link": "https://fortune.com/2026/01/18/us-allies-in-western-europe-warn-of-dangerous-spiral-over-greenland-tariffs/",
    "timestamp": "2026-01-18T15:28:49Z"
  },
  {
    "title": "Iran Expert: 'I am shocked by Witkoff's remarks on Iran'",
    "description": "Benny Sabeti, an Iran researcher, criticized President Trump's envoy for ignoring the Iranian people's struggle.",
    "link": "https://www.israelnationalnews.com/news/421083",
    "timestamp": "2026-01-18T15:28:01Z"
  },
  {
    "title": "Minister says Germany will not be 'blackmailed' by Donald Trump",
    "description": "Germany and its European allies will not yield to pressure from US President Donald Trump.  Trump announced new tariffs to force Europe's hand in the Greenland dispute.  German Finance Minister Lars Klingbeil stated that while Germany seeks common solutions w…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/minister-says-germany-will-not-be-blackmailed-by-donald-trump/articleshow/126647533.cms",
    "timestamp": "2026-01-18T15:27:07Z"
  },
  {
    "title": "Paddy Pimblett gives Topuria a 'deadline' to return",
    "description": "Paddy Pimblett is being very respectful of Ilia Topuria in the midst of all the personal problems he is having. The Englishman wished &apos;El Matador&apos; well a few days ago, as",
    "link": "https://www.marca.com/en/ufc/2026/01/18/696cfa2fe2704eee198b4583.html",
    "timestamp": "2026-01-18T15:25:48Z"
  },
  {
    "title": "Live updates: EU ambassadors meet for emergency talks over Trump’s tariff threats in Greenland row",
    "description": "Governments of eight countries against which tariffs have been threatened released joint statement on Sunday",
    "link": "https://www.irishtimes.com/world/europe/2026/01/18/eu-meeting-trump-tariffs-latest-greenland-live-updates/",
    "timestamp": "2026-01-18T15:25:48Z"
  },
  {
    "title": "Bessent Says Weak Europe Means Trump Must Take Greenland for US",
    "description": "Treasury Secretary Scott Bessent amplified President Donald Trump’s message to European allies that the US won’t back down on taking over Greenland, saying the continent is too weak to ensure its security.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-says-weak-europe-means-trump-must-take-greenland-for-us",
    "timestamp": "2026-01-18T15:23:47Z"
  }
]