[
  {
    "title": "Pakistan should return PoK to India: BJP leader Kavinder Gupta",
    "description": "Kavinder Gupta asserted India's stance against mediation on Kashmir, emphasizing Pakistan should return Pakistan-occupied Kashmir. Following Trump's offer to mediate, Kapil Sibal criticized the lack of information and urged the government to convene an all-pa…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/pakistan-should-return-pok-to-india-bjp-leader-kavinder-gupta/articleshow/121075124.cms",
    "timestamp": "2025-05-11T07:17:10Z"
  },
  {
    "title": "UK-US trade deal 'isn't worth the paper it's written on', says Nobel Prize-winning economist",
    "description": "A Nobel Prize-winning economist has told Sky News the recently announced UK-US trade deal \"isn't worth the paper it's written on\".",
    "link": "https://news.sky.com/story/uk-us-trade-deal-isnt-worth-the-paper-its-written-on-says-nobel-prize-winning-economist-13365655",
    "timestamp": "2025-05-11T07:16:00Z"
  },
  {
    "title": "Fragile ceasefire holds between India, Pakistan as Trump offers more help - Reuters",
    "description": "Fragile ceasefire holds between India, Pakistan as Trump offers more helpReuters India and Pakistan agree to a ceasefire, but will it hold? Here’s what to knowCNN ‘Educate Donald Trump’: Congress MP's curt remark over US President's Kashmir mediation offerHin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177440187",
    "timestamp": "2025-05-11T07:12:46Z"
  },
  {
    "title": "Elon Musk responds to Marco Rubio's India-Pakistan ceasefire post, gives 'one-word' reply",
    "description": "India and Pakistan have agreed to an immediate ceasefire following heightened tensions sparked by the April 22 terror attack in Jammu and Kashmir's Pahalgam. The breakthrough was achieved after intense US diplomatic engagement, with Secretary of State Marco R…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-responds-to-marco-rubios-india-pakistan-ceasefire-post-gives-one-word-reply-operation-sindoor-trump/articleshow/121074947.cms",
    "timestamp": "2025-05-11T07:04:52Z"
  },
  {
    "title": "Putin proposes to 'restart' direct negotiations between Russia and Ukraine in Istanbul",
    "description": "His remarks came after leaders from four major European countries threatened to ratchet up pressure on Putin.",
    "link": "https://www.thejournal.ie/putin-proposes-to-restart-direct-negotiations-between-russia-and-ukraine-in-istanbul-6701911-May2025/",
    "timestamp": "2025-05-11T07:04:41Z"
  },
  {
    "title": "Trump film tariffs may cause 'fear and unrest'",
    "description": "Paddington, Fast & Furious 6 and Guardians of the Galaxy are just a few blockbusters shot in London.",
    "link": "https://www.bbc.com/news/articles/ce3v1lgw2llo",
    "timestamp": "2025-05-11T07:00:17Z"
  },
  {
    "title": "Putin proposes direct talks with Ukraine to agree ‘long-term, lasting peace’",
    "description": "Russia’s proposal for peace talks in Turkey on May 15th welcomed by Trump",
    "link": "https://www.irishtimes.com/world/europe/2025/05/11/ukraine-russia-war-latest-updates/",
    "timestamp": "2025-05-11T06:57:15Z"
  },
  {
    "title": "The fertility crisis: can Trump make America breed again?",
    "description": "In 2021, J.D. Vance gave a speech in Virginia about the \"civilisational crisis\" of low birth rates. Praising Hungary's pro-natalist policies, he asked, \"Why can't we do that here?\" Now that Vance is vice-president, America may be about to try, said Michelle G…",
    "link": "https://biztoc.com/x/cbe439dd97282aee",
    "timestamp": "2025-05-11T06:48:02Z"
  },
  {
    "title": "US nuclear talks may be collapsing, and Iran is worried",
    "description": "After initial success in April, the talks in May have hit a snag. It is not clear if things can be salvaged this week.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-853471",
    "timestamp": "2025-05-11T06:47:01Z"
  },
  {
    "title": "Trump welcomes the resumption of trade relations with China: Great progress has been made",
    "description": "Talks between US and Chinese officials in Geneva expected to resume today - Tariffs will not return to reasonable levels yet, analysts say\nThe post Trump welcomes the resumption of trade relations with China: Great progress has been made appeared first on Pro…",
    "link": "https://en.protothema.gr/2025/05/11/trump-welcomes-the-resumption-of-trade-relations-with-china-great-progress-has-been-made/",
    "timestamp": "2025-05-11T06:46:59Z"
  },
  {
    "title": "Trump's Big Trade Promise To India, Pakistan After Ceasefire Agreement",
    "description": "US President Donald Trump has said the United States would increase trade &quot;substantially&quot; with both India and Pakistan, after the two nuclear power neighbours reached a fragile ceasefire agreement.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-big-trade-promise-to-india-pakistan-after-ceasefire-agreement-8385500",
    "timestamp": "2025-05-11T06:45:03Z"
  },
  {
    "title": "Hate, haters?",
    "description": "I have an interesting theory: people who hit you the most, actually love you the most? First, I don’t hate nobody. Why? Because I don’t want to be nobody else but myself. For example, all these people who hate Donald Trump, my unorthodox theory, I wonder if I…",
    "link": "https://erickimphotography.com/blog/2025/05/11/hate-haters/",
    "timestamp": "2025-05-11T06:41:36Z"
  },
  {
    "title": "The fertility crisis: can Trump make America breed again?",
    "description": "The self-styled 'fertilisation president', has been soliciting ideas on how to get Americans to have more babies",
    "link": "https://theweek.com/politics/the-fertility-crisis-can-trump-make-america-breed-again",
    "timestamp": "2025-05-11T06:40:00Z"
  },
  {
    "title": "No third-party intervention: Former DGP SP Vaid on Trump's mediation offer on Kashmir",
    "description": "Following Donald Trump's offer to mediate on Kashmir, former DGP SP Vaid reiterated India's stance of bilateral resolution per the Simla Agreement. He emphasized the strength of Indian forces and cautioned against Pakistan's continued use of terrorism as stat…",
    "link": "https://economictimes.indiatimes.com/news/india/no-third-party-intervention-former-dgp-sp-vaid-on-trumps-mediation-offer-on-kashmir/articleshow/121074721.cms",
    "timestamp": "2025-05-11T06:39:43Z"
  },
  {
    "title": "Trump 'proud' of Indian, Pakistani leadership for ceasefire",
    "description": "United States President Donald Trump expressed his pride in the leadership of both Pakistan and India for agreeing to a full and immediate ceasefire.In a post on Truth Social, Trump praised the \"stron...",
    "link": "https://biztoc.com/x/c67ae29ac3a2e387",
    "timestamp": "2025-05-11T06:37:14Z"
  },
  {
    "title": "PM Modi's Key Meet With Defence Officials, Day After Ceasefire Agreement",
    "description": "The meeting was attended by Defence Minister Rajnath Singh, National Security Advisor (NSA) Ajit Doval, Chief of Defence Staff (CDS) General Anil Chauhan, and the tri-services chiefs.",
    "link": "https://www.ndtv.com/india-news/pm-modis-key-meet-with-defence-officials-day-after-ceasefire-agreement-8385442",
    "timestamp": "2025-05-11T06:32:06Z"
  },
  {
    "title": "Wary investors hope U.S.-China talks cool high-stakes trade war",
    "description": "The highly anticipated meeting in Switzerland could mark one of the biggest developments since U.S. President Donald Trump launched sweeping tariffs on April 2.",
    "link": "https://www.japantimes.co.jp/business/2025/05/11/markets/investors-us-china-trade-war/",
    "timestamp": "2025-05-11T06:32:00Z"
  },
  {
    "title": "A bold tech move: why some manufacturers want to break free from Google",
    "description": "Chinese smartphone giants are poised to shake up the mobile landscape with a bold move away from Google's Android. Xiaomi, Oppo, Vivo, and OnePlus are",
    "link": "https://www.talkandroid.com/506627-a-bold-tech-move-why-some-manufacturers-want-to-break-free-from-google/",
    "timestamp": "2025-05-11T06:30:00Z"
  },
  {
    "title": "How hard are USAID cuts hitting Africa's healthcare?",
    "description": "HIV patients are losing access to medication, while healthcare programs have come to a halt. What impact are the Trump administration's USAID cuts having on healthcare in Africa?",
    "link": "https://www.dw.com/en/how-hard-are-usaid-cuts-hitting-africas-healthcare/a-72464620",
    "timestamp": "2025-05-11T06:30:00Z"
  },
  {
    "title": "How hard are the USAID cuts hitting Africa?",
    "description": "HIV patients are losing access to medication, while healthcare programs have come to a halt. What impact has the Trump administration's USAID cuts had on healthcare in Africa?",
    "link": "https://www.dw.com/en/how-hard-are-usaid-cuts-hitting-africa/a-72464620",
    "timestamp": "2025-05-11T06:30:00Z"
  },
  {
    "title": "It's Saturday Night Live's Mother's Day Episode with Walton Goggins and the Return of Cecily Strong",
    "description": "The White Lotus star brought an unbuttoned swagger to his hosting debut, with a boost from buddy Sam Rockwell.",
    "link": "https://www.vanityfair.com/hollywood/story/saturday-night-lives-mothers-day-episode-walton-goggins-return-of-cecily-strong",
    "timestamp": "2025-05-11T06:29:16Z"
  },
  {
    "title": "A million Ukrainian refugees are still in Poland. Now presidential candidates vow to put Poles first",
    "description": "In the early months of 2022, as Russia’s full-scale invasion of Ukraine began, millions of Ukrainians — mostly women and children — fled to Poland, where they were met with an extraordinary outpouring of sympathy. Ukrainian flags appeared in windows. Polish v…",
    "link": "https://japantoday.com/category/world/a-million-ukrainian-refugees-are-still-in-poland.-now-presidential-candidates-vow-to-put-poles-first",
    "timestamp": "2025-05-11T06:28:25Z"
  },
  {
    "title": "Trump says 'illegals can book a free flight to any foreign country' via CBP Home app. What is it?",
    "description": "President Donald Trump is urging illegal immigrants to jump before they are pushed out of the US after a signing an executive order \"to launch the first-ever self-deportation program\" on Friday. Homeland Security said earlier this week that migrants would be …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-illegals-can-book-a-free-flight-to-any-foreign-country-via-cbp-home-app-what-is-it/articleshow/121074458.cms",
    "timestamp": "2025-05-11T06:27:19Z"
  },
  {
    "title": "Trump hails 'total reset' in US-China trade relations as talks continue",
    "description": "U.S. President Donald Trump hailed a \"total reset\" in U.S.-China trade relations, ahead of a second day of talks Sunday between top officials from Washington and Beijing aimed at de-escalating trade tensions sparked by his aggressive tariff rollout.",
    "link": "https://www.hurriyetdailynews.com/trump-hails-total-reset-in-us-china-trade-relations-as-talks-continue-209020",
    "timestamp": "2025-05-11T06:25:32Z"
  },
  {
    "title": "What is habeas corpus and why might Donald Trump want to suspend it?",
    "description": "It is a safeguard against unlawful imprisonment - but the White House is \"actively looking\" at pausing it.",
    "link": "https://www.bbc.com/news/articles/cwynl8jv4gjo",
    "timestamp": "2025-05-11T06:20:59Z"
  },
  {
    "title": "What is habeas corpus and why might Donald Trump want to suspend it?",
    "description": "It is a safeguard against unlawful imprisonment - but the White House is \"actively looking\" at pausing it.",
    "link": "https://www.bbc.co.uk/news/articles/cwynl8jv4gjo",
    "timestamp": "2025-05-11T06:20:59Z"
  },
  {
    "title": "Trump praises 'friendly, constructive' US-China trade talks",
    "description": "The US president claims there has been a \"total reset\" in trade relations following a day of talks between the nations.",
    "link": "https://www.bbc.com/news/articles/cn053edex5eo",
    "timestamp": "2025-05-11T06:20:23Z"
  },
  {
    "title": "Putin offers Ukraine to resume direct peace talks in Istanbul",
    "description": "Russian President Vladimir Putin on Sunday proposed direct negotiations in the coming days to end the conflict in Ukraine but did not address a 30-day ceasefire proposal drawn up hours earlier by European allies of Kiev, reportedly with U.S. backing.",
    "link": "https://www.hurriyetdailynews.com/putin-offers-ukraine-to-resume-direct-peace-talks-in-istanbul-209017",
    "timestamp": "2025-05-11T06:20:02Z"
  },
  {
    "title": "Will a fragile India-Pakistan ceasefire spark a stock market rally? 5 signs to read",
    "description": "Despite heightened tensions at the borders, the announcement of an India-Pakistan ceasefire is expected to set Indian markets on an upward trajectory this week. The markets, which had been recovering from a recent correction, took a hit as tensions between th…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-a-fragile-india-pakistan-ceasefire-spark-a-stock-market-rally-5-signs-to-read/articleshow/121074484.cms",
    "timestamp": "2025-05-11T06:19:58Z"
  },
  {
    "title": "Polish pres. candidates vow to put Poles first over millions of Ukrainian refugees",
    "description": "As Poland gears up for the May 18 presidential election, a striking political shift is taking shape: the once-unifying cause of support for Ukrainians is turning into a wedge issue on the campaign trail",
    "link": "https://abcnews.go.com/International/wireStory/million-ukrainian-refugees-poland-now-presidential-candidates-vow-121682544",
    "timestamp": "2025-05-11T06:15:52Z"
  },
  {
    "title": "Putin proposes direct peace talks with Ukraine after 3 years of war",
    "description": "MOSCOW - Russian President Vladimir Putin on Sunday proposed direct talks with Ukraine on May 15 in Turkey that he said should be aimed at bringing a durable peace, an initiative welcomed by US President Donald Trump.",
    "link": "https://www.bangkokpost.com/world/3022850/putin-proposes-direct-peace-talks-with-ukraine-after-3-years-of-war",
    "timestamp": "2025-05-11T06:12:00Z"
  },
  {
    "title": "Trump hails ' great progress' after first meeting between US and Chinese officials on tariffs",
    "description": "Trump last month raised US tariffs on China to a combined 145%.",
    "link": "https://www.thejournal.ie/china-us-tariffs-talks-switzerland-6701894-May2025/",
    "timestamp": "2025-05-11T06:11:57Z"
  },
  {
    "title": "Gazans now eat one meal every two or three days as Trump plans his ‘Riviera’",
    "description": "In a just world, Putin, Netanyahu and their enabler, Trump, would stand trial for war crimes and the US administration’s ‘green light for genocide’",
    "link": "https://www.irishtimes.com/opinion/2025/05/11/gazans-now-eat-one-meal-every-two-or-three-days-as-trump-plans-his-riviera/",
    "timestamp": "2025-05-11T06:10:00Z"
  },
  {
    "title": "Election of the Day: Albania",
    "description": "(Note: no hyperlinks here because the blogging site is being weird and not letting me add them properly. Will update tomorrow if I can) Before diving in, a quick book recommendation. A couple of years ago I read Free: A Child and a Country at the End of Histo…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/election-of-the-day-albania",
    "timestamp": "2025-05-11T06:09:19Z"
  },
  {
    "title": "How backchannels and US mediators pulled India and Pakistan back from the brink",
    "description": "India and Pakistan agree to a full and immediate ceasefire after days of cross-border strikes.",
    "link": "https://www.bbc.com/news/articles/clyn617xv4no",
    "timestamp": "2025-05-11T06:08:13Z"
  },
  {
    "title": "Trump’s pro-crypto stance splits congress: Why & what next?",
    "description": "With Trump’s team holding 80% of TRUMP coin, lawmakers question whether crypto is a power play masked as innovation.",
    "link": "https://ambcrypto.com/trumps-pro-crypto-stance-splits-congress-why-what-next/",
    "timestamp": "2025-05-11T06:00:47Z"
  },
  {
    "title": "U.S. manufacturers see surge in orders as tariffs reshape supply chains",
    "description": "President Donald Trump’s tariffs on imports (especially from China) are driving small and midsize U.S. manufacturers to expand production, with companies like Jergens Inc. and Grand River Rubber reporting surging demand as businesses shift supply chains domes…",
    "link": "https://www.naturalnews.com/2025-05-11-us-manufacturers-see-surge-orders-following-tariffs.html",
    "timestamp": "2025-05-11T06:00:00Z"
  },
  {
    "title": "Health Ranger Report: Christopher Bjerknes challenges conventional narratives about world history",
    "description": "Author Christopher Bjerknes argues that Hitler was not an autonomous dictator, but a tool used by Zionist and communist interests. His early ties to Marxist groups and anti-Semitic rhetoric were allegedly orchestrated to weaken Germany and enable Soviet expan…",
    "link": "https://www.naturalnews.com/2025-05-11-christopher-bjerknes-challenges-conventional-narratives-world-history.html",
    "timestamp": "2025-05-11T06:00:00Z"
  },
  {
    "title": "Corporate America’s DEI standoff: Why major companies are defying the backlash",
    "description": "Major companies like Costco, Apple, Levi’s and Goldman Sachs rejected shareholder proposals to dismantle DEI programs, despite conservative activism, showing a divide between political rhetoric and corporate governance. Large institutional investors (e.g., Bl…",
    "link": "https://www.naturalnews.com/2025-05-11-corporate-america-dei-standoff-companies-defying-backlash.html",
    "timestamp": "2025-05-11T06:00:00Z"
  },
  {
    "title": "U.S.-U.K. trade deal unveiled: A new chapter in economic relations amid global uncertainty",
    "description": "President Donald J. Trump announced a new “full and comprehensive” trade deal with the United Kingdom on May 8, marking the first major trade agreement since the U.S. initiated a global trade war. The announcement led to a surge in U.S. stock markets, with th…",
    "link": "https://www.naturalnews.com/2025-05-11-trade-deal-new-chapter-in-economic-relations.html",
    "timestamp": "2025-05-11T06:00:00Z"
  },
  {
    "title": "White House Deputy Chief of Staff Stephen Miller condemns gender transition procedures for minors as “child torture”",
    "description": "Stephen Miller condemned gender transition procedures for minors as “child torture” and “medical malpractice,” vowing to cut federal funding for institutions facilitating such treatments. The Trump administration ended policies allowing biological males in wo…",
    "link": "https://www.naturalnews.com/2025-05-11-miller-condemns-gender-procedures-as-child-torture.html",
    "timestamp": "2025-05-11T06:00:00Z"
  },
  {
    "title": "Trump's trade war about to leave Americans with empty bathroom shelves? Check details",
    "description": "Are Americans about to face shortage of toilet papers in the United States? Suzano SA, Brazil's leading pulp exporter, reports a 20% drop in bleached hardwood pulp exports to the US due to Trump's tariffs, impacting toilet paper production. Increased costs ar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trumps-trade-war-about-to-leave-americans-with-empty-bathroom-shelves-shortage-of-toilet-papers/articleshow/121074144.cms",
    "timestamp": "2025-05-11T05:44:34Z"
  },
  {
    "title": "Cannes, the global Colosseum of film, readies for 78th edition with new challenges on the horizon",
    "description": "Perhaps as much as ever, all eyes in the movie world will be on the 78th Cannes Film Festival when it gets underway Tuesday in the South of France",
    "link": "https://abcnews.go.com/Business/wireStory/cannes-global-colosseum-film-readies-78th-edition-new-121681980",
    "timestamp": "2025-05-11T05:42:14Z"
  },
  {
    "title": "Trump's UK deal tests Canada's trade future",
    "description": "President Trump unveiled a preliminary trade agreement with the UK, boosting American exports while maintaining tariffs. This deal, offering insight into Trump's trade objectives, has implications for Canada, particularly its auto industry. Prime Minister Car…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/trumps-uk-deal-tests-canadas-trade-future/articleshow/121074076.cms",
    "timestamp": "2025-05-11T05:31:22Z"
  },
  {
    "title": "‘SNL’ Weekend Update Shuts Down ‘Woke’ Pope Complaints, Trashes Trump’s Alcatraz Revival",
    "description": "SNL's Weekend Update addresses complaints from conservatives that Pope Leo XIV is \"woke,\" and trashes Donald Trump wanting to reopen Alcatraz prison",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-weekend-update-shuts-down-woke-pope-complaints-trashes-trump-alcatraz-revival-1235336540/",
    "timestamp": "2025-05-11T05:30:45Z"
  },
  {
    "title": "Weekend Update Slams ‘Woke’ Pope Accusations, Jokes About Trump’s Film Tariffs and Summer Movie Season",
    "description": "The world has taken an interest in Chicago-born Cardinal Robert Francis Prevost’s American upbringing, and so did anchors Colin Jost and Michael Che during the “Saturday Night Live” Weekend Update segment on May 10. “I also love that conservatives are already…",
    "link": "https://variety.com/2025/tv/news/weekend-update-pope-jokes-trump-tariffs-summer-movies-1236393354/",
    "timestamp": "2025-05-11T05:29:42Z"
  },
  {
    "title": "Fragile ceasefire holds between India, Pakistan as Trump offers more help",
    "description": "AMRITSAR/MUZAFFARABAD: A fragile ceasefire was holding between India and Pakistan on Sunday (May 11), after hours of overnight fighting between the nuclear-armed neighbours, as US President Donald Trum",
    "link": "https://www.channelnewsasia.com/asia/india-pakistan-ceasefire-fragile-violation-trump-help-trade-5122476",
    "timestamp": "2025-05-11T05:29:31Z"
  },
  {
    "title": "Trump’s Ally PM Seeks to Anchor Albania in Europe: What to Watch",
    "description": "Edi Rama seeks to win an unprecedented fourth term as prime minister, pledging to finally take Albania into the European Union and turn it into a hot tourist destination with some help from the Trump family.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-ally-pm-seeks-to-anchor-albania-in-europe-what-to-watch",
    "timestamp": "2025-05-11T05:26:53Z"
  },
  {
    "title": "Economic jitters and soaring gold prices create a frenzy for US jewelry merchants",
    "description": "As gold prices soar to record highs resulting from global economic jitters, hundreds of thousands of U.S. dollars’ worth of gold are circulating through the doors of the St. Vincent Jewelry Center in downtown Los Angeles on any given day",
    "link": "https://abcnews.go.com/Business/wireStory/economic-jitters-soaring-gold-prices-create-frenzy-us-121681711",
    "timestamp": "2025-05-11T05:25:16Z"
  },
  {
    "title": "SNL mocks pope’s death and implies VP JD Vance played a role in controversial Trump sketch",
    "description": "Saturday Night Live’s latest Trump sketch sparks outrage after mocking Catholicism and implying Vice President JD Vance caused Pope Francis’ death.",
    "link": "https://www.foxnews.com/media/snl-mocks-popes-death-implies-vp-jd-vance-played-role-controversial-trump-sketch",
    "timestamp": "2025-05-11T05:21:30Z"
  },
  {
    "title": "ICC decided to charge Netanyahu after Khan accused of sexual assault",
    "description": "Shortly after being confronted by ICC staff about the sexual assault complaint, he canceled his planned visit to Israel and announced the warrants.",
    "link": "https://www.jpost.com/international/article-853465",
    "timestamp": "2025-05-11T05:21:03Z"
  },
  {
    "title": "Defending Our Rights Is Becoming Deadlier",
    "description": "The harassment, detention, torture, and eventual murder in 2006 of Anna Politkovskaya, a Russian investigative journalist who exposed government corruption, the horrors of the Second Chechen War, and the increasingly autocratic regime of Russian President Vla…",
    "link": "https://english.khabarhub.com/2025/11/465315/",
    "timestamp": "2025-05-11T05:15:23Z"
  },
  {
    "title": "The US is discovering what it means to have an isolationist economy",
    "description": "On its own, Ireland holds few cards in terms of economic weight: only through the EU can that be brought to bear in a collective way",
    "link": "https://www.irishtimes.com/opinion/2025/05/10/patrick-honohan-the-us-is-discovering-what-it-means-to-have-an-isolationist-economy/",
    "timestamp": "2025-05-11T05:15:00Z"
  },
  {
    "title": "Can Trump Rename the Persian Gulf? - The New York Times",
    "description": "Can Trump Rename the Persian Gulf?The New York Times Trump plans to announce that the US will call the Persian Gulf the Arabian Gulf, officials sayAP News Iran Warns ‘Wrath’ Over Trump’s Reported Plans For Renaming Persian Gulf The ‘Arabian Gulf’Forbes Donald…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177438609",
    "timestamp": "2025-05-11T05:14:24Z"
  },
  {
    "title": "South Korean conservative party fails in a bid to switch presidential candidates",
    "description": "South Korea’s embattled conservative party has canceled then reinstated the presidential candidacy of Kim Moon Soo within hours, after a failed attempt to replace him with former Prime Minister Han Duck-soo",
    "link": "https://abcnews.go.com/International/wireStory/south-korean-conservative-party-fails-bid-switch-presidential-121662274",
    "timestamp": "2025-05-11T05:10:26Z"
  },
  {
    "title": "From pledging to end Russia-Ukraine war in 24 hours to being 'sarcastic', how Trump backed from his promise",
    "description": "President Donald Trump repeatedly claimed he could end the Russia-Ukraine war in 24 hours. But he has failed to bring peace for both the nations. Initial talks with Putin and Zelenskyy showed promise, but a contentious meeting with Zelenskyy and disagreements…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-from-pledging-to-end-russia-ukraine-war-in-24-hours-to-being-sarcastic-how-trump-backed-from-his-promise/articleshow/121073641.cms",
    "timestamp": "2025-05-11T05:09:34Z"
  },
  {
    "title": "Iran accuses US of insincere nuclear talks, sees them as 'trap'",
    "description": "The source reportedly added that the responses given by the US included \"short and general answers,\" disregarding \"main proposals.\"",
    "link": "https://www.jpost.com/middle-east/iran-news/article-853464",
    "timestamp": "2025-05-11T05:08:23Z"
  },
  {
    "title": "Poland once threw its doors open to millions of Ukrainian refugees, but the mood has shifted",
    "description": "In the early months of 2022, as Russia’s full-scale invasion of Ukraine began, millions of Ukrainians — mostly women and children — fled to Poland, where...",
    "link": "https://www.yahoo.com/news/million-ukrainian-refugees-still-poland-050740913.html",
    "timestamp": "2025-05-11T05:07:40Z"
  },
  {
    "title": "Japan PM Ishiba reiterates call to eliminate all tariffs with US",
    "description": "TOKYO: Japanese Prime Minister Shigeru Ishiba reiterated on Sunday (May 11) that he will aim for the elimination of all tariffs in trade negotiations with the United States. Speaking on a Fuji Television morning program, Ishiba said that \"discussions have gra…",
    "link": "https://www.channelnewsasia.com/asia/japan-prime-minister-ishiba-trump-tariffs-elimination-5122436",
    "timestamp": "2025-05-11T05:06:00Z"
  },
  {
    "title": "Weekend Update’s Colin Jost Derides Right-Wing Ire At First American Pope: “There Are No Woke Catholics”",
    "description": "Saturday Night Live‘s Weekend Update had its fun with the headlines this week, including the naming of the new sovereign of the Vatican City State, Pope Leo XIV, the first American in the role. “As an American Catholic, I could not be more proud, which is a s…",
    "link": "http://deadline.com/2025/05/weekend-update-snl-american-pope-trump-tariffs-alcatraz-1236392680/",
    "timestamp": "2025-05-11T05:05:03Z"
  },
  {
    "title": "Trump on Putin's Talks Offer: 'Potentially Great Day for Russia and Ukraine'",
    "description": "US President Donald Trump, after Russian President Vladimir Putin's offer to hold direct talks with Kiev's representatives in Istanbul, called it a \"potentially great day for Russia and Ukraine,\" and promised to continue working with both sides.",
    "link": "https://sputnikglobe.com/20250511/trump-on-putins-talks-offer-potentially-great-day-for-russia-and-ukraine-1122030713.html",
    "timestamp": "2025-05-11T05:03:00Z"
  },
  {
    "title": "The Assembly: Inside the most groundbreaking TV show of the year",
    "description": "As Gary Lineker becomes the final guest to be grilled by a panel of neurodivergent and learning-disabled people on the no-rules interview show ‘The Assembly’, Ellie Muir speaks to its producers about making the series happen, encouraging celebrities to open u…",
    "link": "https://www.the-independent.com/arts-entertainment/tv/features/the-assembly-itv-cast-gary-lineker-danny-dyer-david-tennant-b2748054.html",
    "timestamp": "2025-05-11T05:00:00Z"
  },
  {
    "title": "In a trade war, what are the European alternatives to buying US products hit by tariffs?",
    "description": "How to swap your Nikes for Adidas trainers and other suggestions to avoid buying more costly products from Trump’s America",
    "link": "https://www.irishtimes.com/your-money/2025/05/11/in-a-trade-war-what-are-the-european-alternatives-to-buying-us-products-hit-by-tariffs/",
    "timestamp": "2025-05-11T05:00:00Z"
  },
  {
    "title": "'SNL' Reunites 'Drinking Buddies' Jeanine Pirro And Pete Hegseth",
    "description": "\"Saturday Night Live\" alum Cecily Strong returned as the president's new pick for D.C.'s interim U.S. Attorney.",
    "link": "https://www.huffpost.com/entry/snl-jeanine-pirro-pete-hegseth-drinking-buddies_n_682019e2e4b0d06d243406fb",
    "timestamp": "2025-05-11T04:59:10Z"
  },
  {
    "title": "Trump praises India, Pakistan’s ‘strong and unwaveringly powerful’ leadership for ceasefire deal",
    "description": "India and Pakistan agree to ceasefire, praised by US President Trump for their strong leadership and historic decision.",
    "link": "https://www.thehindubusinessline.com/news/national/trump-praises-india-pakistans-strong-and-unwaveringly-powerful-leadership-for-ceasefire-deal/article69563408.ece",
    "timestamp": "2025-05-11T04:46:27Z"
  },
  {
    "title": "US Vice President JD Vance called PM Modi after receiving 'alarming intel', encouraged ceasefire: Report",
    "description": "The US intervened to de-escalate India-Pakistan tensions, according to a CNN report. Alarming intelligence prompted US officials to urge Prime Minister Narendra Modi to engage in talks with Pakistan. Vice President JD Vance contacted Modi, suggesting a potent…",
    "link": "https://economictimes.indiatimes.com/news/india/us-vice-president-jd-vance-called-pm-modi-after-receiving-alarming-intel-encouraged-ceasefire-report/articleshow/121072550.cms",
    "timestamp": "2025-05-11T04:32:50Z"
  },
  {
    "title": "Trump claims credit for India-Pakistan ceasefire but is 'frustrated' with Russia-Ukraine conflict",
    "description": "US President Donald Trump has boasted of US role in the India-Pakistan ceasefire agreement. He lauded the ceasefire between India and Pakistan. But he is struggling to get a similar deal to stop the Russia-Ukraine war. Trump had promised to end the Russia-Ukr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-claimed-credit-for-india-pakistan-ceasefire-but-is-frustrated-with-russia-ukraine-conflict/articleshow/121072696.cms",
    "timestamp": "2025-05-11T04:31:35Z"
  },
  {
    "title": "‘SNL’ Cold Open: ‘AA Team’ Jeanine Pirro, Pete Hegseth Have One Big, Boozy Reunion",
    "description": "Former SNL cast member Cecily Strong revives her boozy portrayal of Jeanine Pirro alongside Colin Jost's Pete Hegseth, who finds an excuse to drink again",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-cold-open-aa-team-jeanine-pirro-pete-hegseth-reunite-trump-1235336543/",
    "timestamp": "2025-05-11T04:30:21Z"
  },
  {
    "title": "Donald Trump says the US is in danger of ‘messaging and propaganda’ from international cinema. Pull the other one",
    "description": "When Donald Trump proposed slapping a 100% tariff on movies produced overseas, he left film-makers scratching their heads",
    "link": "https://www.irishtimes.com/culture/film/2025/05/10/donald-clarke-the-truth-about-mission-impossible-and-other-films-from-foreign-lands/",
    "timestamp": "2025-05-11T04:30:00Z"
  },
  {
    "title": "Economic jitters and soaring gold prices create a frenzy for US jewelry merchants",
    "description": "As gold prices soar to record highs resulting from global economic jitters, hundreds of thousands of U.S. dollars’ worth of gold are circulating through the doors of the St. Vincent Jewelry Center in downtown Los Angeles on any given day. Many of the 500 inde…",
    "link": "https://www.seattlepi.com/news/politics/article/economic-jitters-and-soaring-gold-prices-create-a-20321314.php",
    "timestamp": "2025-05-11T04:25:05Z"
  },
  {
    "title": "Cecily Strong Makes Surprise Return to 'SNL' to Play Jeanine Pirro in Cold Open",
    "description": "Cecily Strong is back on Saturday Night Live! The 41-year-old actress left the show in December 2022, but she made a surprise return for the latest episode to play Jeanine Pirro. The cold open for the Mother’s Day episode on Saturday (May 10) featured Cecily …",
    "link": "https://www.justjared.com/2025/05/11/cecily-strong-makes-surprise-return-to-snl-to-play-jeanine-pirro-in-cold-open/",
    "timestamp": "2025-05-11T04:18:04Z"
  },
  {
    "title": "\"Will Work With You Both...\": Donald Trump's Kashmir Offer To India, Pak",
    "description": "Donald Trump&#039;s Mediation Offer To India, Pak Hours After Ceasefire Agreement",
    "link": "https://www.ndtv.com/world-news/donald-trumps-mediation-offer-to-india-pak-hours-after-ceasefire-agreement-8384772",
    "timestamp": "2025-05-11T04:17:06Z"
  },
  {
    "title": "Will work with India, Pakistan to find Kashmir solution after a 'thousand years': Donald Trump",
    "description": "President Trump pledged to boost trade with India and Pakistan, expressing hope for a resolution on Kashmir. However, shortly after a ceasefire agreement between India and Pakistan went into effect, India accused Pakistan of violating the accord. This led to …",
    "link": "https://economictimes.indiatimes.com/news/india/will-work-with-india-pakistan-to-find-kashmir-solution-after-a-thousand-years-donald-trump/articleshow/121072191.cms",
    "timestamp": "2025-05-11T04:15:28Z"
  },
  {
    "title": "Cannes, the global Colosseum of film, readies for 78th edition with new challenges on the horizon",
    "description": "Nowhere is the border-crossing nature of cinema more evident than the Cannes Film Festival, which kicks off Tuesday in the wake of U.S. President Donald Trump’s vow to enact tariffs on international films. Cannes, where filmmakers, sales agents and journalist…",
    "link": "https://financialpost.com/pmn/cannes-the-global-colosseum-of-film-readies-for-78th-edition-with-new-challenges-on-the-horizon",
    "timestamp": "2025-05-11T04:13:47Z"
  },
  {
    "title": "Iran, US to resume nuclear talks amid clashing red lines",
    "description": "DUBAI (Reuters) - Top Iranian and U.S. negotiators will resume talks on Sunday to address disputes over Tehran's nuclear programme, in a push for progress as Washington hardens its stance ahead of U.S. President Donald Trump's Middle East visit. Read full sto…",
    "link": "https://www.thestar.com.my/news/world/2025/05/11/iran-us-to-resume-nuclear-talks-amid-clashing-red-lines",
    "timestamp": "2025-05-11T04:10:00Z"
  },
  {
    "title": "Trump's disregard for intelligence briefings raises national security alarms",
    "description": "President Trump's infrequent attendance at President's Daily Briefings, a critical intelligence resource, raises concerns about his awareness of global threats. His preference for simplified summaries over detailed reports, coupled with internal turmoil and p…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-disregard-for-intelligence-briefings-raises-national-security-alarms/articleshow/121072203.cms",
    "timestamp": "2025-05-11T04:09:44Z"
  },
  {
    "title": "Rümeysa Öztürk freed, as Judge Warns of Grave Threat to Free Speech",
    "description": "'There has been no evidence that has been introduced by the government other than the op-ed,' U.S. District Judge William Sessions III said, referring to Öztürk's article urging divestment from Israel. By Brett Wilkins | - ( Common Dreams ) - Rümeysa Öztürk, …",
    "link": "https://www.juancole.com/2025/05/warning-threat-speech.html",
    "timestamp": "2025-05-11T04:06:47Z"
  },
  {
    "title": "Iran, US to resume nuclear talks amid clashing red lines",
    "description": "Top Iranian and U.S. negotiators are set to resume talks in Muscat, mediated by Oman, to address disputes over Iran's nuclear program. These discussions occur as Washington adopts a tougher stance before President Trump's Middle East visit.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-us-to-resume-nuclear-talks-amid-clashing-red-lines/articleshow/121072164.cms",
    "timestamp": "2025-05-11T04:06:43Z"
  },
  {
    "title": "Economic jitters and soaring gold prices create a frenzy for US jewelry merchants",
    "description": "At the biggest jewelry center in the United States, Alberto Hernandez fired up his machine on a recent day and waited until it glowed bright orange inside...",
    "link": "https://finance.yahoo.com/news/economic-jitters-soaring-gold-prices-040325905.html",
    "timestamp": "2025-05-11T04:03:25Z"
  },
  {
    "title": "Russia’s European neighbors are lifting bans on landmines. Campaigners are horrified | CNN",
    "description": "They are considered one of the world’s most dangerous, and indiscriminate, weapons. Yet five European countries have turned their backs on an international treaty on the use of landmines, citing the growing threat from Moscow.",
    "link": "https://www.cnn.com/2025/05/11/europe/europe-countries-landmine-ban-russia-intl",
    "timestamp": "2025-05-11T04:00:50Z"
  },
  {
    "title": "In Worcester, MA, another Dem politician allegedly attacked ICE agents",
    "description": "Before about ten minutes ago, I’d never thought much about Worcester, Massachusetts, except for its being a blue-collar town with a strong link to the American Revolution. Back then, Worcester’s residents fought for individual liberty and...",
    "link": "https://www.americanthinker.com/blog/2025/05/in_worcester_ma_another_dem_politician_allegedly_attacked_ice_agents.html",
    "timestamp": "2025-05-11T04:00:00Z"
  },
  {
    "title": "Redcoats to steel deals: How Trump forged a new Anglo-American alliance",
    "description": "In 1773, American colonists hurled crates of British tea into Boston Harbor.  In 2025, the United States agreed to export American beef and ethanol duty-free, while British cars will soon glide into American ports under a newly sl...",
    "link": "https://www.americanthinker.com/blog/2025/05/redcoats_to_steel_deals_how_trump_forged_a_new_anglo_american_alliance.html",
    "timestamp": "2025-05-11T04:00:00Z"
  },
  {
    "title": "SNL Video: Cecily Strong Returns as Jeanine Pirro to Chug Wine With Donald Trump (and Spit It in Colin Jost’s Face)",
    "description": "It must be wine o’clock: Saturday Night Live alum Cecily Strong returned to the show this week to reprise her role as Fox News host-turned-interim U.S. attorney Jeanine Pirro. (And yes, she brought a bottle of red with her.) In this week’s cold open, James Au…",
    "link": "https://tvline.com/recaps/snl-video-cecily-strong-jeanine-pirro-trump-hegseth-1235448314/",
    "timestamp": "2025-05-11T03:59:38Z"
  },
  {
    "title": "As Trump family's Gulf empire grows, rulers seek influence, arms, tech",
    "description": "DUBAI: Ahead of US President Donald Trump's Gulf visit next week, his son Eric was promoting his crypto firm in Dubai, while Don Jr prepared to talk about \"Monetising MAGA\" in Doha. Last month, the Trump Or",
    "link": "https://www.channelnewsasia.com/world/trump-gulf-empire-eric-don-crypto-dubai-qatar-real-estate-5122381",
    "timestamp": "2025-05-11T03:58:26Z"
  },
  {
    "title": "‘SNL’: Trump Crashes Mother’s Day Celebration, Cecily Strong Returns as Jeanine Pirro in Cold Open | Video",
    "description": "Colin Jost debuts as Secretary of Defense Pete Hegseth\nThe post ‘SNL’: Trump Crashes Mother’s Day Celebration, Cecily Strong Returns as Jeanine Pirro in Cold Open | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/snl-cold-open-trump-mothers-day-cecily-strong-jeanine-pirro-returns/",
    "timestamp": "2025-05-11T03:55:44Z"
  },
  {
    "title": "Cecily Strong Returns As Merlot-Spewing Jeanine Pirro In ‘Saturday Night Live’ Open That Skewers Donald Trump’s Fox News Picks",
    "description": "Saturday Night Live opened by skewering Donald Trump’s latest choice of a Fox News personality for a top administration position. This time, it was Jeanine Pirro, the co-host of The Five, who this week was named interim U.S. attorney. Returning to play a Merl…",
    "link": "http://deadline.com/2025/05/saturday-night-live-trump-jeanine-pirro-1236392661/",
    "timestamp": "2025-05-11T03:55:32Z"
  },
  {
    "title": "As Trump Family's Gulf Empire Grows, Rulers Seek Influence, Arms, Tech",
    "description": "Ahead of US President Donald Trump's Gulf visit next week, his son Eric was promoting his crypto firm in Dubai, while Don Jr prepared to talk about \"Monetising MAGA\" in Doha.",
    "link": "https://www.ibtimes.com.au/trump-familys-gulf-empire-grows-rulers-seek-influence-arms-tech-1858717",
    "timestamp": "2025-05-11T03:48:05Z"
  },
  {
    "title": "Trump fires top US copyright official (Katherine Tully-McManus/Politico)",
    "description": "Katherine Tully-McManus / Politico:\nTrump fires top US copyright official  —  Democrats are alleging foul play.  —  President Donald Trump continued a firing spree at the Library of Congress on Saturday when he dismissed the top copyright official in the nati…",
    "link": "https://www.memeorandum.com/250510/p63",
    "timestamp": "2025-05-11T03:40:01Z"
  },
  {
    "title": "WINNING! Trump Has Cut National Debt Growth by 92 Percent",
    "description": "Trump has been in office for only a few months and has already managed to cut national debt growth by 92 percent.\nThe post WINNING! Trump Has Cut National Debt Growth by 92 Percent appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/winning-trump-has-cut-national-debt-growth-92/",
    "timestamp": "2025-05-11T03:30:48Z"
  },
  {
    "title": "Trump Touts \"Great Progress\" In China Tariff Talks, Suggests \"Total Reset\" On The Table",
    "description": "Trump Touts \"Great Progress\" In China Tariff Talks, Suggests \"Total Reset\" On The Table\n \nPresident Donald Trump said late on Saturday that \"great progress\" was being made in ongoing U.S.-China talks over tariffs menacing the global economy, and even suggeste…",
    "link": "https://biztoc.com/x/b253bdb7fb520339",
    "timestamp": "2025-05-11T03:27:19Z"
  },
  {
    "title": "Iran warns US ahead of Oman talks: We will not retreat from our nuclear rights",
    "description": "Iranian FM Abbas Araghchi declares that Tehran would never give up its nuclear rights if US talks aimed to restrict them. His remarks come on the eve of new nuclear negotiations in Oman.",
    "link": "https://www.israelnationalnews.com/news/408138",
    "timestamp": "2025-05-11T03:23:37Z"
  },
  {
    "title": "Putin proposes direct Russia-Ukraine talks in Istanbul on May 15",
    "description": "Offer comes after European leaders called for an unconditional 30-day truce to start on Monday.",
    "link": "https://www.aljazeera.com/news/2025/5/11/putin-proposes-direct-russia-ukraine-talks-in-istanbul-on-may-15",
    "timestamp": "2025-05-11T03:15:54Z"
  },
  {
    "title": "Netanyahu's office has no idea what Trump will say on Middle East visit",
    "description": "In the best-case scenario, he will present a plan backed by Arab states to end the war without Hamas in power and with the immediate release of hostages. In the worst-case scenario, he presents nothing, or the proposal gets rejected, Trump loses interest, and…",
    "link": "https://www.haaretz.com/israel-news/2025-05-11/ty-article/.premium/netanyahus-office-has-no-idea-what-trump-will-say-on-middle-east-visit/00000196-bbcc-d1bb-a5d6-bffcf14e0000",
    "timestamp": "2025-05-11T03:03:38Z"
  }
]