[
  {
    "title": "Department of the Interior Implements Emergency Permitting Procedures to Strengthen Domestic Energy Supply",
    "description": "Accelerates permitting procedures to develop American Energy Dominance... In response to President Donald J. Trump’s declaration of a National Energy Emergency, the U.S. Department of the Interior will implement emergency permitting procedures to accelerate t…",
    "link": "https://freerepublic.com/focus/f-news/4313020/posts",
    "timestamp": "2025-04-24T18:43:55Z"
  },
  {
    "title": "Trump Organization Fires Lawyer as President Blasts Harvard Work",
    "description": "The Trump Organization fired a conservative lawyer who served as its ethics adviser hours after the president attacked him for helping Harvard University sue the administration.",
    "link": "https://www.livemint.com/companies/news/trump-organization-fires-lawyer-as-president-blasts-harvard-work-11745520183390.html",
    "timestamp": "2025-04-24T18:43:03Z"
  },
  {
    "title": "Coalition’s campaign lacks good planning and enough elbow grease",
    "description": "Whatever the result on May 3, even people within the Liberals think they have run a very poor national campaign. Not just poor, but odd.",
    "link": "https://www.abc.net.au/news/2025-04-25/coalition-campaign-lacks-good-planning/105213810",
    "timestamp": "2025-04-24T18:41:55Z"
  },
  {
    "title": "Trump Memecoin Leaps After the President of the United States Offers Dinner With Top Holders",
    "description": "Donald Trump’s official memecoin (TRUMP) is skyrocketing after the President offered to have dinner with its top holders. In a new announcement, the top 220 TRUMP holders are invited to a Gala dinner event with the President on May 22nd at his private nationa…",
    "link": "https://dailyhodl.com/2025/04/24/trump-memecoin-leaps-after-the-president-of-the-united-states-offers-dinner-with-top-holders/",
    "timestamp": "2025-04-24T18:41:11Z"
  },
  {
    "title": "More than 50 House Democrats demand answers after whistleblower report on DOGE",
    "description": "Members of the Congressional Labor Caucus wrote the letter after NPR reported that a whistleblower says DOGE may have removed sensitive labor data and compromised the security of computer systems.",
    "link": "https://www.npr.org/2025/04/24/nx-s1-5375118/congress-doge-nlrb-whistleblower",
    "timestamp": "2025-04-24T18:40:22Z"
  },
  {
    "title": "Fact check: Trump lies about the price of eggs, groceries and gas (Daniel Dale/CNN)",
    "description": "Daniel Dale / CNN:\nFact check: Trump lies about the price of eggs, groceries and gas  —  Gas.  Groceries.  Eggs.  Over the last week, President Donald Trump has lied about the price of all of them — using this repeated deception to try to minimize widespread …",
    "link": "https://www.memeorandum.com/250424/p95",
    "timestamp": "2025-04-24T18:40:01Z"
  },
  {
    "title": "Trump Reveals Russia's 'Pretty Big Concession' in Peace Talks with Ukraine",
    "description": "Earlier in the day, Trump issued an unusually direct message to Russian President Putin, urging him to \"STOP!\" attacks on Ukraine.",
    "link": "https://www.newsweek.com/trump-reveals-russias-pretty-big-concession-peace-talks-ukraine-2063802",
    "timestamp": "2025-04-24T18:38:56Z"
  },
  {
    "title": "Democrats' vice chair gets ultimatum: stay neutral in primaries or step down from party leadership",
    "description": "The DNC has vowed to stay neutral in Democratic primaries following vice chair David Hogg's plan to shell out $20 million through his outside political group, Leaders We Deserve, to primary-challenge some older Democrats in blue districts.",
    "link": "https://www.foxnews.com/politics/democrats-vice-chair-gets-ultimatum-neutral-primaries-down-party-leadership",
    "timestamp": "2025-04-24T18:38:33Z"
  },
  {
    "title": "BREAKING: Attorney Ty Clevenger Exposes FBI’s Role in Hiding Seth Rich Records and Perpetuating the Russia Hoax — Sends Scathing Letter to Pam Bondi, Kash Patel, and Trump Officials",
    "description": "Ty Clevenger has fired off a blistering letter to Attorney General Pam Bondi and FBI Director Kash Patel, accusing the FBI of flagrantly concealing critical records about the late DNC staffer Seth Rich and the now-discredited Russia collusion narrative. In Fe…",
    "link": "https://freerepublic.com/focus/f-news/4313019/posts",
    "timestamp": "2025-04-24T18:38:33Z"
  },
  {
    "title": "SEN. JONI ERNST: Here’s How Congress Can Save Millions Of American Jobs",
    "description": "Eight years ago, I worked with President Trump to enact the most significant simplification of our tax code in decades, the Tax Cuts and Jobs Act (TCJA), also known as the Trump tax cuts.",
    "link": "https://dailycaller.com/2025/04/24/senator-joni-ernst-american-tax-cuts-jobs-act-trump/",
    "timestamp": "2025-04-24T18:38:30Z"
  },
  {
    "title": "Voters Should Pick their Candidates, Not Party Bosses",
    "description": "Ken Martin, chair of the Democratic National Committee argues that party officers should remain neutral in Democratic primaries.",
    "link": "https://time.com/7280045/voters-should-pick-their-candidates-not-party-bosses/",
    "timestamp": "2025-04-24T18:38:29Z"
  },
  {
    "title": "Trump says effort for Iran nuclear deal going well",
    "description": "WASHINGTON (Reuters) - President Donald Trump on Thursday said U.S. attempts to broker a nuclear deal with Iran are going well, ahead of technical talks between U.S. and Iranian delegations in Oman on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/trump-says-effort-for-iran-nuclear-deal-going-well",
    "timestamp": "2025-04-24T18:37:00Z"
  },
  {
    "title": "Tech Talk: What you need to know about crossing the US border with your phone",
    "description": "Breaking tech down to its simple parts so we can all understand it a little better",
    "link": "https://www.androidcentral.com/phones/tech-talk-what-you-need-to-know-about-crossing-the-us-border-with-your-phone",
    "timestamp": "2025-04-24T18:37:00Z"
  },
  {
    "title": "Talks only if all unilateral tariffs gone, China tells US",
    "description": "China demands the US to revoke all unilateral tariffs, denying any ongoing trade deal talks, despite Trump's softened stance. Beijing insists on seeing sincerity and respect from Washington, including addressing concerns over sanctions and Taiwan, before enga…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/talks-only-if-all-unilateral-tariffs-gone-china-tells-us/articleshow/120594602.cms",
    "timestamp": "2025-04-24T18:35:53Z"
  },
  {
    "title": "Pahalgam Carnage: A Wake-Up Call for India",
    "description": "Bairaj ChawalgamiOnce again the Sufi land has been soaked by the innocent human blood and much blood has been spilled and there is need that spilling of innocent human blood should stop. The savage and inhuman terrorists have enacted Nadimarg and 2000 Pahalga…",
    "link": "https://statetimes.in/pahalgam-carnage-a-wake-up-call-for-india/",
    "timestamp": "2025-04-24T18:35:39Z"
  },
  {
    "title": "A dozen states sue the Trump administration to stop tariff policy",
    "description": "Twelve states in America have filed a lawsuit against the Trump administration. The suit challenges the legality of President Trump's tariff policy. States argue that the policy is unlawful and disrupts the American economy. They claim Trump's actions exceed …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-dozen-states-sue-the-trump-administration-to-stop-tariff-policy/articleshow/120594600.cms",
    "timestamp": "2025-04-24T18:35:37Z"
  },
  {
    "title": "State and local election officials question agency about Trump’s attempt to overhaul operations",
    "description": "Election officials from around the country questioned the leaders of a federal agency tasked by President Trump with implementing parts of his sweeping election overhaul.",
    "link": "https://www.pbs.org/newshour/politics/state-and-local-election-officials-question-agency-about-trumps-attempt-to-overhaul-operations",
    "timestamp": "2025-04-24T18:35:13Z"
  },
  {
    "title": "EXCLUSIVE: Christian Groups Sue to Block Reinstatement of Biden Official Who Weaponized Law to Force Gender Ideology on Employers",
    "description": "FIRST ON THE DAILY SIGNAL—Two Christian organizations are intervening in a lawsuit brought against the Trump administration by a fired independent agency employee who claims... Read More\nThe post EXCLUSIVE: Christian Groups Sue to Block Reinstatement of Biden…",
    "link": "https://www.dailysignal.com/2025/04/24/exclusive-christian-employee-files-discrimination-lawsuit-radical-eeoc-commissioner-fired-by-trump/",
    "timestamp": "2025-04-24T18:35:12Z"
  },
  {
    "title": "When Will Tariffs Go Into Effect 2025? What US Consumers Should Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs the United States continues to negotiate trade deals amid President Donald Trump's tariff pause, a key deadline looms over the global economy—one that could impact prices on imported goods and effect U.S. c…",
    "link": "https://biztoc.com/x/df596759320f8b43",
    "timestamp": "2025-04-24T18:35:07Z"
  },
  {
    "title": "US judge blocks Trump from withholding funds from 16 'sanctuary' cities, counties (Nate Raymond/Reuters)",
    "description": "Nate Raymond / Reuters:\nUS judge blocks Trump from withholding funds from 16 ‘sanctuary’ cities, counties  —  A federal judge on Thursday blocked Donald Trump's administration from withholding federal funding from more than a dozen so-called sanctuary jurisdi…",
    "link": "https://www.memeorandum.com/250424/p94",
    "timestamp": "2025-04-24T18:35:01Z"
  },
  {
    "title": "Trump slams China for reneging on Boeing planes purchase",
    "description": "WASHINGTON: US President Donald Trump on Thursday criticised China for backing out of a deal to buy new Boeing planes due to tariffs imposed in the rivals' trade war. \"Boeing should default",
    "link": "https://www.channelnewsasia.com/world/trump-slams-china-reneging-boeing-planes-purchase-5087556",
    "timestamp": "2025-04-24T18:35:00Z"
  },
  {
    "title": "Trump: We'll set prices for deals at some point",
    "description": "United States President Donald Trump stated on Thursday that Washington is going to just \"at one point set prices\" for tariff deals with other countries.\"They either negotiate a deal or we set a deal ...",
    "link": "https://biztoc.com/x/365d1e46e95edf75",
    "timestamp": "2025-04-24T18:34:47Z"
  },
  {
    "title": "Trump has his own deadline, 'no allegiance to anybody' in Ukraine-Russia peace deal",
    "description": "The U.S. wants to see Ukraine and Russia sign a peace deal \"fast,\" Trump told reporters Thursday.",
    "link": "https://www.foxnews.com/politics/trump-has-his-own-deadline-no-allegiance-anybody-ukraine-russia-peace-deal",
    "timestamp": "2025-04-24T18:34:42Z"
  },
  {
    "title": "'Vladimir, STOP!' Cries Trump, Who STILL Doesn't Know He's Putin's Bitch",
    "description": "Trump's 'final offer' for Ukraine/Russia peace is going about as well as things always go for Mr. Art of the Deal.",
    "link": "https://www.wonkette.com/p/vladimir-stop-cries-trump-who-still",
    "timestamp": "2025-04-24T18:34:03Z"
  },
  {
    "title": "Pro-Trump shop owner backs Schumer on tariffs: 'This has to be rectified'",
    "description": "TandyWear owner Tandy Jeckel said she supports both Sen. Schumer and President Trump, but worries that the latter's tariffs are hurting business.",
    "link": "https://www.foxnews.com/politics/pro-trump-shop-owner-backs-schumer-tariffs-this-has-rectified",
    "timestamp": "2025-04-24T18:33:31Z"
  },
  {
    "title": "K-tech plugs into India to light up electronics",
    "description": "LG Electronics is expanding its operations in India for exports, prompting its Korean component manufacturers to establish factories in the country with a ₹1,200 crore investment. Samsung is also considering a similar move, potentially bringing more Korean ve…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/k-tech-plugs-into-india-to-light-up-electronics/articleshow/120594504.cms",
    "timestamp": "2025-04-24T18:32:10Z"
  },
  {
    "title": "ICE Boston removes alien fugitive wanted for aggravated murder, desecration of corpse in Brazil",
    "description": "U.S. Immigration and Customs Enforcement removed a Brazilian fugitive convicted in her native country for aggravated first-degree murder, desecration of a corpse and theft of motor vehicle. Officers with ICE Boston removed Lenaria Aparecida Pereira Sandoval f…",
    "link": "https://freerepublic.com/focus/f-news/4313018/posts",
    "timestamp": "2025-04-24T18:31:46Z"
  },
  {
    "title": "Trump trade war spreads more gloom across businesses",
    "description": "Businesses are grappling with the fallout from President Trump's trade war, as tariffs disrupt supply chains and increase costs. PepsiCo and Thermo Fisher have lowered their financial outlooks, while Nestle and Unilever express concerns about weakening consum…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-trade-war-spreads-more-gloom-across-businesses/articleshow/120594442.cms",
    "timestamp": "2025-04-24T18:30:08Z"
  },
  {
    "title": "F-47 6th Generation Fighter Future Force Size Questions Emerge",
    "description": "The U.S. Air Force is firmly of the view that its new F-47 6th generation stealth fighters are key to “how we win” in future fights, according to the...",
    "link": "https://www.twz.com/air/f-47-future-force-size-questions-emerge",
    "timestamp": "2025-04-24T18:29:45Z"
  },
  {
    "title": "SEC postpones decisions on Polkadot and Hedera ETFs, over 70 filings await clarity",
    "description": "The agency would extend the deadline to June 11 to rule on Grayscale’s bid to convert its Polkadot Trust and Canary’s proposal to list a Hedera (HBAR) ETF. A separate delay was also announced for the Bitwise Bitcoin and Ethereum ETF, now pushed to June 10. Th…",
    "link": "https://coinjournal.net/news/sec-postpones-decisions-on-polkadot-and-hedera-etfs-over-70-filings-await-clarity/",
    "timestamp": "2025-04-24T18:29:17Z"
  },
  {
    "title": "When Will Tariffs Go Into Effect 2025? What US Consumers Should Know",
    "description": "On April 9, President Donald Trump announced a 90-day pause on a wide range of proposed new tariffs.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-effect-china-reciprocal-2063757",
    "timestamp": "2025-04-24T18:29:17Z"
  },
  {
    "title": "Trump makes rare criticism of Putin after Russia’s deadly Kyiv attacks",
    "description": "At least 12 people were killed in a Russian missile attack on the Ukrainian capital.",
    "link": "https://www.aljazeera.com/news/2025/4/24/trump-makes-rare-criticism-of-putin-after-russias-deadly-kyiv-attacks",
    "timestamp": "2025-04-24T18:28:18Z"
  },
  {
    "title": "The AI data center trade is coming back to life, but a key test remains",
    "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "link": "https://www.cnbc.com/2025/04/24/the-ai-data-center-trade-is-coming-back-to-life-but-a-key-test-remains.html",
    "timestamp": "2025-04-24T18:28:05Z"
  },
  {
    "title": "Pahalgam terror attack shows Pakistan's calculated diplomacy-terror operation",
    "description": "A terror attack near Pahalgam, claimed by a Lashkar-e-Taiba offshoot, killed 26, highlighting Pakistan's alleged support for terrorism amid economic overtures to the US. Victims were forced to recite Islamic verses, revealing a chilling religious dimension. T…",
    "link": "https://economictimes.indiatimes.com/news/india/pahalgam-terror-attack-shows-pakistans-calculated-diplomacy-terror-operation/articleshow/120593879.cms",
    "timestamp": "2025-04-24T18:27:55Z"
  },
  {
    "title": "Pete Hegseth Reportedly Wanted Makeup Studio in the Pentagon",
    "description": "The secretary of Defense denied asking for a $40,000 glam room, though that’s honestly the least of his troubles right now.",
    "link": "http://www.thecut.com/article/pete-hegseth-makeup-studio-pentagon.html",
    "timestamp": "2025-04-24T18:27:42Z"
  },
  {
    "title": "Corona beer maker Modelo says to invest $3.6 bn in Mexico",
    "description": "Grupo Modelo, the producer of Corona and other Mexican beer brands, said Thursday that it would invest more than $3.6 billion in Mexico despite trade tensions with the United States. “We stand with Mexico like good friends, in the good times and the bad,” Rau…",
    "link": "https://www.digitaljournal.com/world/corona-beer-maker-modelo-says-to-invest-3-6-bn-in-mexico/article",
    "timestamp": "2025-04-24T18:27:32Z"
  },
  {
    "title": "Trump tariff talks are prolonging uncertainty: S.Africa central bank chair",
    "description": "The central bank governor of G20 chair South Africa warned Thursday that the ongoing trade talks sparked by US President Donald Trump’s tariff plans could prolong uncertainty in the global financial markets. “In an environment where every country is negotiati…",
    "link": "https://www.digitaljournal.com/world/trump-tariff-talks-are-prolonging-uncertainty-s-africa-central-bank-chair/article",
    "timestamp": "2025-04-24T18:27:32Z"
  },
  {
    "title": "Judge blocks Trump bid to halt federal funding for sanctuary cities",
    "description": "A federal judge issued an injunction Thursday blocking President Donald Trump's efforts to halt federal funds from going to sanctuary jurisdictions.",
    "link": "https://www.nbcnews.com/politics/immigration/judge-blocks-trump-bid-halt-federal-funding-sanctuary-cities-rcna202828",
    "timestamp": "2025-04-24T18:26:46Z"
  },
  {
    "title": "Trump Admin Hits Back at NY Times Over ‘Sob Story’ of Deported Illegal Alien Convicted of Kidnapping",
    "description": "The Trump administration is firing back at The New York Times after the paper published a 3,000-word “sob story” about a criminal illegal alien recently... Read More\nThe post Trump Admin Hits Back at NY Times Over ‘Sob Story’ of Deported Illegal Alien Convict…",
    "link": "https://www.dailysignal.com/2025/04/24/trump-administration-hits-back-new-york-times-over-sob-story-deported-illegal-alien-convicted-kidnapping/",
    "timestamp": "2025-04-24T18:26:45Z"
  },
  {
    "title": "‘A devastating blow’: Trump guts funding for U.S.’s largest health study of women",
    "description": "Chris Hayes blasts the Trump administration for defunding the Women's Health Initiative, the largest women's health prevention study in the U.S.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-musk-doge-defund-womens-health-rcna202787",
    "timestamp": "2025-04-24T18:26:43Z"
  },
  {
    "title": "Carney says Canada has leverage to wait for a U.S. trade deal",
    "description": "Mark Carney said Canada does not need to reach a quick trade deal with the US and has enough leverage to wait longer if necessary. Read more",
    "link": "https://financialpost.com/news/economy/carney-canada-leverage-wait-us-trade-deal",
    "timestamp": "2025-04-24T18:26:35Z"
  },
  {
    "title": "Carney Says Canada Has Leverage to Wait For a US Trade Deal",
    "description": "Prime Minister Mark Carney said Canada does not need to reach a quick deal with US President Donald Trump, arguing his country has enough leverage in the negotiations to wait longer if necessary.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-says-canada-has-leverage-to-wait-for-a-us-trade-deal",
    "timestamp": "2025-04-24T18:26:35Z"
  },
  {
    "title": "Trump Admin Hits Back at NY Times Over ‘Sob Story’ on Deported Illegal Alien Convicted of Kidnapping",
    "description": "The Trump administration is firing back at The New York Times after the paper published a 3,000-word “sob story” about a criminal illegal alien recently... Read More\nThe post Trump Admin Hits Back at NY Times Over ‘Sob Story’ on Deported Illegal Alien Convict…",
    "link": "https://www.dailysignal.com/2025/04/24/trump-admin-hits-back-at-ny-times-over-sob-story-on-deported-illegal-alien-convicted-of-kidnapping/",
    "timestamp": "2025-04-24T18:26:00Z"
  },
  {
    "title": "China Denies Trump’s Claim That They Are Holding ‘Daily’ Tariff Talks",
    "description": "The Chinese government denied that it is enagaged in active tariff negotations with the United States after Trump claimed \"daily\" discussions.",
    "link": "http://www.rollingstone.com/politics/politics-news/china-denies-trump-tariff-talks-negotiations-1235324367/",
    "timestamp": "2025-04-24T18:25:37Z"
  },
  {
    "title": "Comedian Nikki Glaser worried that she could ‘not be let back into the country’ for Trump jokes",
    "description": "Comedian Nikki Glaser said in a recent Time magazine interview that anti-Trump jokes she told in Canada could have gotten her blocked from entering the U.S.",
    "link": "https://www.foxnews.com/media/comedian-nikki-glaser-worried-she-could-not-let-back-country-trump-jokes",
    "timestamp": "2025-04-24T18:24:54Z"
  },
  {
    "title": "US and China clash over status of trade talks. Here's what to know.",
    "description": "Trump said the two sides are discussing trade. A Chinese official called it \"fake news.\"",
    "link": "https://abcnews.go.com/Business/us-china-clash-status-trade-talks/story?id=121118799",
    "timestamp": "2025-04-24T18:23:38Z"
  },
  {
    "title": "Trump on Norway levies: They could pay more",
    "description": "US President Donald Trump indicated on Thursday that Norway could \"pay more\" when responding to questions about potential reductions in the proposed 15% US tariff on Norway.\"Well they have a big fund,...",
    "link": "https://biztoc.com/x/973a97ee47f24e6a",
    "timestamp": "2025-04-24T18:23:37Z"
  },
  {
    "title": "Trump: Russia ready not to take all of Ukraine",
    "description": "United States President Donald Trump said on Thursday that Russia is prepared to make a \"pretty big concession\" in an effort to achieve the end of the war in Ukraine.Asked by a reporter what concessio...",
    "link": "https://biztoc.com/x/913cb0f01913bd14",
    "timestamp": "2025-04-24T18:23:21Z"
  },
  {
    "title": "Half of Americans are very worried the U.S. is headed toward a recession—and point the finger to Trump’s tariffs",
    "description": "Americans’ trust in President Donald Trump to bolster the U.S. economy appears to be faltering, with a new poll showing that many people fear the country is being steered into a recession and that the president’s broad and haphazardly enforced tariffs will ca…",
    "link": "https://biztoc.com/x/bc2662c268e1076d",
    "timestamp": "2025-04-24T18:23:11Z"
  },
  {
    "title": "Shein And Temu Will Raise Prices Tomorrow Amid Trump Tariffs—What To Know",
    "description": "The online retailers, popular for their low prices, have not specified how much more expensive goods will become amid President Donald Trump’s tariffs on China.",
    "link": "https://www.forbes.com/sites/conormurray/2025/04/24/shein-and-temu-will-raise-prices-tomorrow-amid-trump-tariffs-what-to-know/",
    "timestamp": "2025-04-24T18:21:49Z"
  },
  {
    "title": "Judge partly blocks Trump order seeking to overhaul U.S. elections",
    "description": "(Reuters) -A federal judge on Thursday blocked parts of President Donald Trump's executive order seeking to impose new rules on U.S. elections, which Democrats and other groups said risked denying eligible citizens the right to vote. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/judge-partly-blocks-trump-order-seeking-to-overhaul-us-elections",
    "timestamp": "2025-04-24T18:21:00Z"
  },
  {
    "title": "BREAKING: Corrupt Clinton Judge Partially Blocks Trump Election Integrity Executive Order, Including Requiring Proof of Citizenship",
    "description": "A federal judge's recent decision to block key elements of Trump's election integrity order raises critical questions about voter rights and the future of electoral reforms. Insights into the implications await.\nThe post BREAKING: Corrupt Clinton Judge Partia…",
    "link": "https://www.thegatewaypundit.com/2025/04/breaking-corrupt-clinton-judge-partially-blocks-trump-election/",
    "timestamp": "2025-04-24T18:20:38Z"
  },
  {
    "title": "Judge blocks Trump attempt to require proof of citizenship to vote",
    "description": "A federal judge blocked the Trump administration's efforts to require proof of citizenship for voting.",
    "link": "https://abcnews.go.com/Politics/judge-blocks-trump-administration-requiring-proof-citizenship-register/story?id=121134512",
    "timestamp": "2025-04-24T18:20:18Z"
  },
  {
    "title": "Donald Trump Trots Out His Worst Manners for Funerals. What Can We Expect at the Pope’s?",
    "description": "The president, an etiquette maverick, has a long history of rudeness at the most solemn moments, from Roy Cohn’s memorial to the death of John McCain.",
    "link": "https://www.vanityfair.com/style/story/donald-trump-trots-out-his-worst-manners-for-funerals-what-can-we-expect-at-the-popes",
    "timestamp": "2025-04-24T18:20:11Z"
  },
  {
    "title": "'Trump 2028' hats launched for sale on president's official website",
    "description": "President Donald Trump's official store has started selling \"Trump 2028\" hats years before the next presidential election.\n\nThe new hats showed up on the official \"Trump Store\" website on Thursday for $50 each. Eric Trump was seen wearing the hat in an image …",
    "link": "https://www.rawstory.com/trump-2028-hat/",
    "timestamp": "2025-04-24T18:20:10Z"
  },
  {
    "title": "Trump Prepares to Take Revenge With Order Targeting ActBlue",
    "description": "Donald Trump is targeting a massive Democratic fundraising tool in an upcoming presidential memorandum banning foreign donations in U.S. elections, according to reporting from Politico.\r\nDonations platform ActBlue, which almost all Democratic candidates use i…",
    "link": "https://newrepublic.com/post/194373/trump-revenge-order-actblue-fundraising-democrats",
    "timestamp": "2025-04-24T18:19:59Z"
  },
  {
    "title": "Bitcoin-Friendly El Salvador Pitches Tokenized Real Estate 'Sandbox' to Trump's SEC",
    "description": "The prospect was raised during a meeting between the U.S. Securities and Exchange Commission’s Crypto Task Force and El Salvador regulators.",
    "link": "https://decrypt.co/316186/bitcoin-friendly-el-salvador-pitches-tokenized-real-estate-sandbox-to-trumps-sec",
    "timestamp": "2025-04-24T18:18:04Z"
  },
  {
    "title": "SoftBank Is Buying Bitcoin Again, After $130M Loss in 2018. Is This Time Different?",
    "description": "SoftBank returns to crypto years after founder Masayoshi Son lost $130M on bitcoin.",
    "link": "https://www.coindesk.com/markets/2025/04/24/softbank-is-buying-bitcoin-why-bulls-should-be-worried",
    "timestamp": "2025-04-24T18:17:41Z"
  },
  {
    "title": "'Stop weaponizing antisemitism to attack universities,' Schumer tells Trump",
    "description": "Four Jewish democrat senators, Richard Blumenthal, Jacky Rosen, Adam Schiff and Brian Schatz, joined Schumer in sending a letter to the president condemning the president.",
    "link": "https://www.jpost.com/diaspora/article-851422",
    "timestamp": "2025-04-24T18:17:31Z"
  },
  {
    "title": "Trump extends rare White House opportunity to those who buy his meme coin",
    "description": "An official who oversaw crypto policy for the SEC said of Team Trump's latest gambit, \"They are making the pay-to-play deal explicit.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-extends-rare-white-house-opportunity-buy-meme-coin-rcna202855",
    "timestamp": "2025-04-24T18:17:13Z"
  },
  {
    "title": "Carney admits Trump talked about Canada becoming 51st state during call last month",
    "description": "That seemingly contradicts Liberal Leader Mark Carney claim at the time that Trump “respected Canada’s sovereignty” during their discussion.",
    "link": "https://nationalpost.com/news/carney-admits-trump-talked-about-canada-becoming-51st-state-during-call-last-month",
    "timestamp": "2025-04-24T18:16:24Z"
  },
  {
    "title": "Carney admits Trump talked about Canada becoming 51st state during call last month",
    "description": "That seemingly contradicts Liberal Leader Mark Carney claim at the time that Trump “respected Canada’s sovereignty” during their discussion.",
    "link": "https://nationalpost.com/news/politics/federal_election/carney-admits-trump-talked-about-canada-becoming-51st-state-during-call-last-month",
    "timestamp": "2025-04-24T18:16:24Z"
  },
  {
    "title": "Dallas ’63: A Brilliant Synthesis Regarding the November 22, 1963 Coup d’état",
    "description": "Dallas ’63: A Brilliant Synthesis Regarding the November 22, 1963 Coup d’état, by Charles Burris Once again, the intrepid Peter Dale Scott takes us into that claustrophobic wilderness of mirrors where the criminal underworld meets the establishment upperworld…",
    "link": "https://www.lewrockwell.com/lrc-blog/dallas-63-a-brilliant-synthesis-regarding-the-november-22-1963-coup-detat/",
    "timestamp": "2025-04-24T18:15:26Z"
  },
  {
    "title": "One way or another",
    "description": "In 2014, Vladimir Putin seized the Crimea, even though Russia had previously recognized Ukrainian sovereignty over the peninsula.  The US government is now pressuring Ukraine to accept Russia’s sovereignty over Crimea.\nXi Jinping suggests that Mainland China …",
    "link": "https://www.econlib.org/one-way-or-another/",
    "timestamp": "2025-04-24T18:15:05Z"
  },
  {
    "title": "SEC task force met with Trump-supporting firms to discuss crypto regulation",
    "description": "The US Securities and Exchange Commission (SEC) crypto task force, headed by Hester Peirce, has continued meeting with digital asset company representatives as the agency explores regulatory changes.In an April 24 notice, the SEC task force disclosed a meetin…",
    "link": "https://cointelegraph.com/news/sec-crypto-task-force-ondo-finance-regulation",
    "timestamp": "2025-04-24T18:15:00Z"
  },
  {
    "title": "Trump’s New Merch Is a Terrifying Threat",
    "description": "For anyone still doubting if Donald Trump is contemplating a third term, consider that the president is currently selling “Trump 2028” hats.\r\nThe red caps were spotted on the online Trump store retailing for $50 a pop.\r\n“Make a statement with this Made in Ame…",
    "link": "https://newrepublic.com/post/194372/donald-trump-new-merch-threat-2028",
    "timestamp": "2025-04-24T18:12:59Z"
  },
  {
    "title": "Trump: Very difficult to get Crimea back to Ukraine",
    "description": "United States President Donald Trump said on Thursday that Ukraine faces a tough road in reclaiming Crimea, suggesting the territory was effectively lost under former President Barack Obama.\"We'll do ...",
    "link": "https://biztoc.com/x/d4636ad2a18b83db",
    "timestamp": "2025-04-24T18:12:39Z"
  },
  {
    "title": "Trump Executive Order Raises Alarm Over Women's Financial Independence",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAn Executive Order (EO) signed by President Donald Trump is raising concerns over the protection of women's financial independence, as well as other potential civil rights violations.\nThe EO, titled Restoring …",
    "link": "https://biztoc.com/x/12c8a4c3c00a95e9",
    "timestamp": "2025-04-24T18:12:13Z"
  },
  {
    "title": "China denies suggestion it’s in talks with Trump over tariffs",
    "description": "China has denied any suggestion that it is in active negotiations with the administration of U.S. President Donald Trump over tariffs.",
    "link": "https://biztoc.com/x/47702f5211dab381",
    "timestamp": "2025-04-24T18:12:12Z"
  },
  {
    "title": "Trump Welcomes Norwegian Prime Minister to White House",
    "description": "President Donald Trump welcoming Norwegian Prime Minster Jonas Gahr Støre in the Cabinet Room of White House on Thursday. Trump highlighted former NATO Secretary General Jens Stoltenberg who is now serving as Finance Minister of Norway.\n----------\n Like thi…",
    "link": "https://biztoc.com/x/4926b3ae4d5ec65c",
    "timestamp": "2025-04-24T18:12:09Z"
  },
  {
    "title": "Trump: I have no allegiance to anybody in Ukraine war",
    "description": "US President Donald Trump emphasized on Thursday that he has \"no allegiance to anybody\" in the ongoing conflict between Russia and Ukraine during his discussions with Norwegian Prime Minister Jonas Ga...",
    "link": "https://biztoc.com/x/5f53e6d5cf703902",
    "timestamp": "2025-04-24T18:12:07Z"
  },
  {
    "title": "Judge blocks Trump effort to expand proof of citizenship requirement for voter registration | CNN Politics",
    "description": "A federal judge has halted parts of an executive order signed by President Donald Trump that sought to boost requirements that Americans show documents proving their citizenship when registering to vote.",
    "link": "https://www.cnn.com/2025/04/24/politics/judge-blocks-trump-proof-of-citizenship-voter-registration/index.html",
    "timestamp": "2025-04-24T18:10:56Z"
  },
  {
    "title": "Putin gifted Trump a portrait of the US president, Russian artist reveals mystery painting",
    "description": "Russian President Vladimir Putin gifted President Donald Trump a painting depicting the moment the U.S. leader survived an assassination attempt last year.",
    "link": "https://www.foxnews.com/politics/putin-gifted-trump-portrait-us-president-russian-artist-reveals-mystery-painting-report",
    "timestamp": "2025-04-24T18:07:24Z"
  },
  {
    "title": "Trump Org puts ‘2028’ hat on sale in nod to third term talk: ‘Rewrite the rules’",
    "description": "The Constitution's 22nd Amendment states that \"No person shall be elected to the office of the President more than twice.\"",
    "link": "https://nypost.com/2025/04/24/us-news/trump-org-puts-2028-hat-on-sale-in-nod-to-third-term-talk-rewrite-the-rules/",
    "timestamp": "2025-04-24T18:06:40Z"
  },
  {
    "title": "Over 1,500 Economists Agree: Trump's Tariffs Are Terrible",
    "description": "When the Anti-Tariff Declaration was published on Friday, more than 150 economists signed on to oppose President Donald Trump's trade policy. Less than a",
    "link": "https://reason.com/2025/04/24/over-1500-economists-agree-trumps-tariffs-are-terrible/",
    "timestamp": "2025-04-24T18:06:38Z"
  },
  {
    "title": "As Alexandria Ocasio-Cortez takes on Donald Trump, rumors fly that her brother is involved in a $1.2 million fentanyl trafficking ring, here's what reports say",
    "description": "A false rumour about Alexandria Ocasio-Cortez's brother, Gabriel, is spreading online. The rumour claims he is involved in a fentanyl trafficking ring. Gabriel Ocasio-Cortez has denied these allegations. He clarified that he works with the homeless. He also w…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-alexandria-ocasio-cortez-takes-on-donald-trump-rumors-fly-that-her-brother-is-involved-in-a-1-2-million-fentanyl-trafficking-ring-heres-what-reports-say/articleshow/120593493.cms",
    "timestamp": "2025-04-24T18:06:32Z"
  },
  {
    "title": "Trump’s Attempt to Hijack Elections Dealt Massive Blow in Court",
    "description": "A federal judge ruled Thursday to block parts of Donald Trump’s executive order last month attempting to overhaul elections and voting processes. \r\nU.S. District Judge Colleen Kollar-Kotelly granted a preliminary injunction to halt several of the order’s init…",
    "link": "https://newrepublic.com/post/194370/trump-elections-voting-order-loss-court",
    "timestamp": "2025-04-24T18:06:10Z"
  },
  {
    "title": "Indonesia maintains financial stability amid global economic uncertainty: minister",
    "description": "JAKARTA, April 24 (Xinhua) -- Indonesia's Financial System Stability remains strong in the first quarter despite rising global economic and financial market uncertainties, according to Finance Minister Sri Mulyani Indrawati. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/indonesia-maintains-financial-stability-amid-global-economic-uncertainty-minister",
    "timestamp": "2025-04-24T18:06:00Z"
  },
  {
    "title": "Trump Executive Order Raises Alarm Over Women's Financial Independence",
    "description": "A new executive order from the White House targets the Equal Credit Opportunity Act which was written to prevent sex-based credit discrimination.",
    "link": "https://www.newsweek.com/trump-executive-order-raises-alarm-over-women-financial-independence-2063733",
    "timestamp": "2025-04-24T18:05:38Z"
  },
  {
    "title": "China denies suggestion it’s in talks with Trump over tariffs",
    "description": "China has denied any suggestion that it is in active negotiations with the administration of U.S. President Donald Trump over tariffs.",
    "link": "https://www.pbs.org/newshour/world/china-denies-suggestion-its-in-talks-with-trump-over-tariffs",
    "timestamp": "2025-04-24T18:04:22Z"
  },
  {
    "title": "Trump says he’ll sit for an interview with Jeffrey Goldberg, who exposed Pete Hegseth’s ‘Signalgate’",
    "description": "President Donald Trump on Thursday said he will meet with Jeffrey Goldberg, the Atlantic editor-in-chief who, in late March, was accidentally added to a Signal group chat that involved classified information and several top Trump officials.",
    "link": "https://www.cnn.com/2025/04/24/media/trump-interview-jeffrey-goldberg-atlantic-signal/index.html",
    "timestamp": "2025-04-24T18:04:22Z"
  },
  {
    "title": "US Judge Orders Trump Cannot Defund Migrant 'Sanctuary Cities'",
    "description": "A US judge ruled Thursday that Donald Trump cannot legally withhold federal funds from authorities offering limited protections to undocumented migrants, known as &quot;sanctuary cities,&quot; as the president presses his aggressive mass deportation effort.",
    "link": "https://www.ndtv.com/world-news/us-judge-orders-donald-trump-cannot-defund-migrant-sanctuary-cities-8248687",
    "timestamp": "2025-04-24T18:04:11Z"
  },
  {
    "title": "Watch Live: Donald Trump Meets with Prime Minister of Norway",
    "description": "President Donald Trump meets with Norway's Prime Minister Jonas Gahr Støre in the Oval Office on Thursday, April 24.\nThe post Watch Live: Donald Trump Meets with Prime Minister of Norway appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/24/watch-live-donald-trump-meets-with-prime-minister-of-norway/",
    "timestamp": "2025-04-24T18:03:47Z"
  },
  {
    "title": "Why Jon Cryer Called Donald Trump the “Charlie Sheen of Politics”",
    "description": "After Jon Cryer called President Donald Trump the “Charlie Sheen of politics” in 2016, he recently expressed that grouping his Two and a Half Men costar with the politician would actually be unfair.",
    "link": "https://www.eonline.com/news/1416608/jon-cryer-called-donald-trump-the-charlie-sheen-of-politics",
    "timestamp": "2025-04-24T18:03:26Z"
  },
  {
    "title": "Trump agenda drives record outflows from global sustainable funds, Morningstar says",
    "description": "Investors withdrew a record $8.6 billion from global sustainable funds in the first quarter, researcher Morningstar said on Thursday, attributing the outflows largely to the shift against climate and social initiatives by U.S. President Donald Trump.\nThe bigg…",
    "link": "https://biztoc.com/x/1994e4710319a2fd",
    "timestamp": "2025-04-24T18:01:25Z"
  },
  {
    "title": "Why Odyssey Marine Exploration (OMEX) Stock Is Exploding Higher",
    "description": "Shares of Odyssey Marine Exploration Inc (NASDAQ:OMEX) soared 112% to 90 cents during Thursday’s session following a Reuters report that President Donald Trump is expected to sign an executive order aimed at jumpstarting the U.S. deep-sea mining industry.\nWha…",
    "link": "https://biztoc.com/x/0506dce204eff69a",
    "timestamp": "2025-04-24T18:01:09Z"
  },
  {
    "title": "Trump Targets ActBlue, Foreign Contributions",
    "description": "President Donald Trump on Thursday was expected to sign a presidential memorandum to crack down on foreign contributions, a move that would put ActBlue, Democrats' major online fundraising platform, in the crosshairs of a federal probe, Politico reported. Att…",
    "link": "https://freerepublic.com/focus/f-news/4313015/posts",
    "timestamp": "2025-04-24T18:00:28Z"
  },
  {
    "title": "UPDATE - Joe Pags Launches New Podcast with Salem Media Group: “Unshaken and Unafraid.”",
    "description": "CAMARILLO, Calif., April 24, 2025 (GLOBE NEWSWIRE) -- Salem Media Group\r\n, Inc.\r\n (OTCQX: SALM) is proud to announce a powerful new addition to its growing lineup of fearless voices. Nationally syndicated talk radio host Joe Pags is launching a new podcast, “…",
    "link": "https://www.globenewswire.com/news-release/2025/04/24/3067837/0/en/UPDATE-Joe-Pags-Launches-New-Podcast-with-Salem-Media-Group-Unshaken-and-Unafraid.html",
    "timestamp": "2025-04-24T18:00:00Z"
  },
  {
    "title": "Trump tariffs push world's top PC makers toward Saudi Arabia",
    "description": "The so-called \"reciprocal tariffs\" imposed by the Trump administration could push major PC manufacturers to find new production hubs, and it likely won't be in the US. Earlier this month, laptop makers were already forced to halt shipments to the US due to ta…",
    "link": "https://www.techspot.com/news/107672-trump-tariffs-push-world-top-pc-makers-toward.html",
    "timestamp": "2025-04-24T17:59:00Z"
  },
  {
    "title": "Americans remain concerned about press freedoms, but partisan views have flipped since 2024",
    "description": "A majority of Democrats (60%) are highly concerned about press freedoms – about double the share of Republicans (28%).\nThe post Americans remain concerned about press freedoms, but partisan views have flipped since 2024 appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2025/04/24/americans-remain-concerned-about-press-freedoms-but-partisan-views-have-flipped-since-2024/",
    "timestamp": "2025-04-24T17:57:47Z"
  },
  {
    "title": "Free Expression Seen as Important Globally, but Not Everyone Thinks Their Country Has Press, Speech and Internet Freedoms",
    "description": "Across 35 countries, there are some disconnects between how people rate the importance of free expression and how free they feel they actually are.\nThe post Free Expression Seen as Important Globally, but Not Everyone Thinks Their Country Has Press, Speech an…",
    "link": "http://www.pewresearch.org/global/2025/04/24/free-expression-seen-as-important-globally-but-not-everyone-thinks-their-country-has-press-speech-and-internet-freedoms/",
    "timestamp": "2025-04-24T17:56:44Z"
  },
  {
    "title": "China Cheers on Trump's Iran Talks, Supports Tehran Nuclear Program",
    "description": "Chinese Foreign Minister Wang Yi told Iranian Foreign Minister Abbas Araghchi on Wednesday, during the latter's visit to Beijing, that the Chinese Communist Party supported ongoing talks between the Iranian terror state and the administration of President Don…",
    "link": "https://www.breitbart.com/asia/2025/04/24/china-cheers-on-trumps-iran-talks-supports-tehran-nuclear-program/",
    "timestamp": "2025-04-24T17:55:05Z"
  },
  {
    "title": "Trump says giving 'baby bonus' payments to mothers 'sounds like a good idea'",
    "description": "President Donald Trump said giving baby bonuses to U.S. mothers after delivering a child \"sounds like a good idea.\"",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/24/donald-trump-baby-bonus-payments-mothers/83248817007/",
    "timestamp": "2025-04-24T17:54:42Z"
  },
  {
    "title": "‘Overwhelming demand’ for Nintendo Switch 2 preorders creates frustrations for hopeful buyers",
    "description": "U.S. preorders for the Nintendo Switch 2 kicked off shortly after the clock struck midnight Thursday. But chaos soon ensued amid high demand.",
    "link": "https://www.pbs.org/newshour/nation/overwhelming-demand-for-nintendo-switch-2-preorders-creates-frustrations-for-hopeful-buyers",
    "timestamp": "2025-04-24T17:54:05Z"
  },
  {
    "title": "Pakistan warns Kashmir row could lead to 'all-out war' with India",
    "description": "Pakistan's defence minister has told Sky News that a row over a mass shooting in Kashmir could lead to an \"all-out war\" between his country and India.",
    "link": "https://news.sky.com/story/pakistan-warns-kashmir-row-could-lead-to-all-out-war-with-india-13355033",
    "timestamp": "2025-04-24T17:53:00Z"
  },
  {
    "title": "Trump fans furious he called out Putin for striking Kyiv: ‘Zelensky caused this’",
    "description": "Right-wingers on Truth Social are breaking with President Donald Trump after he criticized Russian strikes on Kyiv for impeding peace talks.\n\n\n\"I am not happy with the Russian strikes on KYIV,\" Trump posted Thursday morning. \"Not necessary, and very bad timin…",
    "link": "https://www.dailydot.com/debug/donald-trump-putin-truth-social-kyiv/",
    "timestamp": "2025-04-24T17:51:38Z"
  },
  {
    "title": "Letitia James unleashes fiery response to Trump’s ‘revenge tour’ in wake of mortgage fraud accusations",
    "description": "The federal criminal referral against Letitia James is a meritless, hypocritical salvo in President Trump’s “revenge tour” against his nemesis, the state attorney general’s lawyer charged Thursday.…",
    "link": "https://nypost.com/2025/04/24/us-news/letitia-james-unleashes-fiery-response-to-trumps-revenge-tour-in-wake-of-mortgage-fraud-accusations/",
    "timestamp": "2025-04-24T17:51:34Z"
  },
  {
    "title": "Why ZELENSKY can't and won't give up Crimea",
    "description": "Vladimir Putin initially denied having anything to do with Russia's capture of Crimea in February 2014, when mysterious masked commandos in unidentified green uniforms seized the local parliament and fanned out across the peninsula. Those \"little green men\" m…",
    "link": "https://freerepublic.com/focus/f-chat/4313014/posts",
    "timestamp": "2025-04-24T17:50:51Z"
  }
]