[
  {
    "title": "Donald Trump Demands Investigations Into Negative Approval Rating Polls",
    "description": "Trump criticized pollsters working with major news outlets as he suffers a slew of worsening numbers.",
    "link": "https://www.newsweek.com/donald-trump-demands-investigations-negative-approval-rating-polls-2064949",
    "timestamp": "2025-04-28T10:40:59Z"
  },
  {
    "title": "Tariffs are making strollers and car seats more expensive. Parents are worried | CNN Business",
    "description": "When soon-to-be moms and dads go to Modern Natural Baby, a baby and children’s gear and toy store outside of Detroit, they are typically looking for advice — the right brand of stroller, whether to buy a rocker or a glider for the nursery, or for help install…",
    "link": "https://www.cnn.com/2025/04/28/business/strollers-car-seats-tariffs/index.html",
    "timestamp": "2025-04-28T10:40:41Z"
  },
  {
    "title": "'You guys make it sound like...': Top Trump officials make big charge against children’s parents amid deportation",
    "description": "The US President Donald Trump’s administration has reportedly deported three US citizen children, including a 4-year-old who was suffering from metastatic cancer along with their mothers, according to the families’ attorneys. But top Trump officials Tom Homan…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-children-citizen-deported-you-guys-make-it-sound-like-top-trump-officials-make-big-charge-against-childrens-parents-amid-deportation/articleshow/120694649.cms",
    "timestamp": "2025-04-28T10:38:26Z"
  },
  {
    "title": "Emerging-Market Stocks Extend Rally Amid Earnings Optimism",
    "description": "Emerging-market stocks rose for a second day, with the benchmark gauge heading for a three-week high amid optimism over corporate earnings.",
    "link": "https://financialpost.com/pmn/business-pmn/emerging-market-stocks-extend-rally-amid-earnings-optimism",
    "timestamp": "2025-04-28T10:34:05Z"
  },
  {
    "title": "Bitcoin price jumps to $94,680, eyes $100,000 amid rising greed signals",
    "description": "10% weekly gain marks Bitcoin’s strongest move in weeks. Profit/Loss ratio close to 1.0, hinting at potential breakout. Greed sentiment reaches its highest level since November 2024. Bitcoin has broken above $90,000 after five weeks of sideways trading, reign…",
    "link": "https://coinjournal.net/news/bitcoin-price-jumps-to-94680-eyes-100000-amid-rising-greed-signals/",
    "timestamp": "2025-04-28T10:32:48Z"
  },
  {
    "title": "10 Monday AM Reads",
    "description": "My back-to-work morning train reads: • The End of the South Florida Dream: A similar phenomenon is taking place across all of South Florida, where a majority of the state’s aging condos are concentrated. Over the past few months, condo listings have shot up i…",
    "link": "https://ritholtz.com/2025/04/10-monday-am-reads-425/",
    "timestamp": "2025-04-28T10:30:05Z"
  },
  {
    "title": "These Colleges Are At Risk As Congress Takes Aim At Endowments",
    "description": "Not only Harvard will pay. As Republicans hunt for revenues, the tax on private college endowments could be raised and broadened. We found 127 schools that might be vulnerable.",
    "link": "https://www.forbes.com/sites/emmawhitford/2025/04/28/these-colleges-are-at-risk-as-congress-takes-aim-at-endowments/",
    "timestamp": "2025-04-28T10:30:00Z"
  },
  {
    "title": "'They are sick!' Raging Trump demands criminal probes into reports of his bad poll numbers",
    "description": "President Donald Trump highlighted findings by a Republican pollster to attack media organizations that found his approval rating was lagging.A survey conducted by ABCNews and the Washington Post found just 39 percent of Americans approve of his performance a…",
    "link": "https://www.rawstory.com/trump-2671856142/",
    "timestamp": "2025-04-28T10:29:59Z"
  },
  {
    "title": "Exclusive -- Shocking Data Suggests Abortion Pill Complications 22 Times Higher Than Previously Reported: ‘FDA Must Reinstate Stronger Safeguards’",
    "description": "While the abortion pill is touted as “safe and effective,” new data suggests complications are 22 times higher than previously reported.\nThe post Exclusive — Shocking Data Suggests Abortion Pill Complications 22 Times Higher Than Previously Reported: ‘FDA Mus…",
    "link": "https://www.breitbart.com/politics/2025/04/28/exclusive-shocking-data-suggests-abortion-pill-complications-22-times-higher-than-previously-reported-fda-must-reinstate-stronger-safeguards/",
    "timestamp": "2025-04-28T10:29:32Z"
  },
  {
    "title": "Russia Says Claims Over Annexed Ukraine Regions Key To Peace",
    "description": "Russia said on Monday it was ready to negotiate directly with Ukraine, but that recognition of its claims over five Ukrainian regions including Crimea were \"imperative\" to resolving the conflict.",
    "link": "https://www.ibtimes.com/russia-says-claims-over-annexed-ukraine-regions-key-peace-3771649",
    "timestamp": "2025-04-28T10:27:18Z"
  },
  {
    "title": "Putin critic Johann Wadephul to become Germany's foreign minister",
    "description": "Germany's next foreign minister, Johann Wadephul, is a former soldier, trained lawyer and conservative MP who has long been a strong supporter of military backing for Ukraine as it fights Russia's invasion.",
    "link": "https://www.thelocal.de/20250428/putin-critic-johann-wadephul-to-become-germanys-foreign-minister",
    "timestamp": "2025-04-28T10:27:13Z"
  },
  {
    "title": "At event with Donald Trump Jr in Bulgaria, crypto firm Nexo announces US return",
    "description": "While hosting the eldest son of U.S. President Donald Trump at a conference in Bulgaria on Sunday, crypto company Nexo Capital said it plans to return to the American market, two years after it paid a $45 million fine to settle U.S. regulatory charges.Donald …",
    "link": "https://www.channelnewsasia.com/business/event-donald-trump-jr-bulgaria-crypto-firm-nexo-announces-us-return-5094656",
    "timestamp": "2025-04-28T10:27:10Z"
  },
  {
    "title": "Anton To Lead Trump Team Negotiating With Iran",
    "description": "By George Caldwell, The Daily Signal | April 24, 2025\nPresident Donald Trump has chosen Michael Anton, the State Department’s director of policy planning, to lead the next round of nuclear negotiations with Iran, Politico reported Thursday.\nThis weekend, Anto…",
    "link": "https://biztoc.com/x/44486c7f948d726b",
    "timestamp": "2025-04-28T10:25:07Z"
  },
  {
    "title": "US aviation industry slammed by tariffs, seeks exemptions",
    "description": "By Rajesh Kumar Singh\nCHICAGO (Reuters) -The U.S. aviation industry, reeling from President Donald Trump's trade war and a slump in travel demand, is lobbying the White House for exemptions from tariffs.\nIndustry officials have held meetings with senior membe…",
    "link": "https://biztoc.com/x/e8e65ee8218ee032",
    "timestamp": "2025-04-28T10:24:50Z"
  },
  {
    "title": "Poll: Musk disapproval rating at 57%",
    "description": "Over half of Americans disapprove of the way billionaire Elon Musk is handling his job in the administration of United States President Donald Trump, a recent ABC News/Washington Post/Ipsos poll showe...",
    "link": "https://biztoc.com/x/48dc2fd223b0846d",
    "timestamp": "2025-04-28T10:24:47Z"
  },
  {
    "title": "Even untouched by tariffs, UK financial IT braces for the blow",
    "description": "Spend will come under scrutiny, but projects with good returns still likely to get backing, analyst says The ripple effects of recent US tariffs could hit sectors well beyond those currently in the firing line, or so warns TechMarketView.…",
    "link": "https://www.theregister.com/2025/04/28/uk_financial_services_tariffs/",
    "timestamp": "2025-04-28T10:24:15Z"
  },
  {
    "title": "We are ready for direct talks with Ukraine, expect movement from Kiev, says Kremlin",
    "description": "Moscow and Kiev have not held direct talks since March 2022, a few weeks after Russia's invasion began\nThe post We are ready for direct talks with Ukraine, expect movement from Kiev, says Kremlin appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/04/28/we-are-ready-for-direct-talks-with-ukraine-expect-movement-from-kiev-says-kremlin/",
    "timestamp": "2025-04-28T10:24:14Z"
  },
  {
    "title": "White House defends deportation of U.S. citizen children",
    "description": "The White House faces scrutiny over the deportation of two mothers and their U.S. citizen children, asserting legal compliance while advocates raise concerns about due process and health issues.",
    "link": "https://www.wmur.com/article/white-house-deportation-controversy-us-citizen-children/64605770",
    "timestamp": "2025-04-28T10:23:49Z"
  },
  {
    "title": "Elon Musk lays groundwork for big donor role in midterm elections as time with DOGE ends",
    "description": "Elon Musk is reportedly scaling back his White House role to focus on becoming a major Republican megadonor for the upcoming midterm elections. Despite facing public disapproval and controversies surrounding his companies, Musk intends to remain an influentia…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-lays-groundwork-for-big-donor-role-in-midterm-elections-as-time-with-doge-ends/articleshow/120694224.cms",
    "timestamp": "2025-04-28T10:23:24Z"
  },
  {
    "title": "DOGE Falls Way Short",
    "description": "NOTUS: “Since President Donald Trump returned to the White House, the federal government has spent $171 billion more than the same period in the previous two years…” “The data shows that DOGE has fallen far",
    "link": "https://politicalwire.com/2025/04/28/doge-falls-way-short/",
    "timestamp": "2025-04-28T10:22:03Z"
  },
  {
    "title": "Canadians vote in election dominated by concerns about Trump",
    "description": "OTTAWA (Reuters) - Canadians go to the polls on Monday after an election campaign in which U.S. President Donald Trump's tariffs and musings about annexing Canada became the central issue. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/28/canadians-vote-in-election-dominated-by-concerns-about-trump",
    "timestamp": "2025-04-28T10:20:00Z"
  },
  {
    "title": "US consumers will start feeling the pain of tariffs in stores by the end of May, Trump's ex-top economic advisor says",
    "description": "US shoppers will likely start feeling the tariffs' effects in \"the last couple weeks of May,\" Gary Cohn told CBS' Face The Nation.",
    "link": "https://www.businessinsider.com/us-shoppers-face-tariff-pain-may-end-former-trump-advisor-2025-4",
    "timestamp": "2025-04-28T10:18:01Z"
  },
  {
    "title": "Hawley reignites 'PELOSI Act' push to ban lawmakers from trading stocks",
    "description": "Sen. Josh Hawley, R-Mo., reintroduced his \"PELOSI Act\" seeking to ban lawmakers from making stock trades while they are in office on Monday.",
    "link": "https://www.foxnews.com/politics/hawley-reignites-pelosi-act-push-ban-lawmakers-from-trading-stocks",
    "timestamp": "2025-04-28T10:17:44Z"
  },
  {
    "title": "White House preparing for possible Trump-Kim talks – Axios",
    "description": "Pyongyang has grown stronger since the historic summits of the previous decade, the outlet has observed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616420-trump-kim-summit-axios/",
    "timestamp": "2025-04-28T10:17:37Z"
  },
  {
    "title": "China Says On 'Right Side Of History' In Trade Standoff With US",
    "description": "Since returning to the White House in January, US President Donald Trump has imposed 10 percent tariffs on most US trading partners and a separate 145 percent levy on many products from China.",
    "link": "https://www.ibtimes.com/china-says-right-side-history-trade-standoff-us-3771642",
    "timestamp": "2025-04-28T10:16:12Z"
  },
  {
    "title": "Trump Demands Free Passage For US Ships Through Panama And Suez Canals, Assigns Marco Rubio To 'Take Care' Of The Situation",
    "description": "In a recent post on Truth Social, President Donald Trump called for American access to two of the world's most strategic waterways, demanding that transit fees for US ships be removed immediately.\nWhat Happened: Trump wrote that “American ships, both military…",
    "link": "https://biztoc.com/x/42d85f6cb8ac11a6",
    "timestamp": "2025-04-28T10:13:45Z"
  },
  {
    "title": "Trump Accuses Democrats of 'Paying a Fortune' To Interrupt GOP Town Halls",
    "description": "President Donald Trump accused Democrats of paying hecklers following a series of hostile receptions to Republican lawmakers at public events.",
    "link": "https://biztoc.com/x/ba594e9ea5beef72",
    "timestamp": "2025-04-28T10:13:43Z"
  },
  {
    "title": "NFL Superstar Joins Donald Trump On Marine One And At Country Club",
    "description": "The player appeared to get cozy with the president on Sunday, perhaps adding another athlete to Team MAGA.",
    "link": "https://www.huffpost.com/entry/saquon-barkley-donald-trump_n_680f4507e4b049bc73d57bf1",
    "timestamp": "2025-04-28T10:11:15Z"
  },
  {
    "title": "Trump claims Zelenskyy is ready to give up Crimea in potential boost to Ukraine peace talks",
    "description": "President Trump has said Volodymyr Zelenskyy is prepared to give up Ukraine's claim to Crimea as part of a ceasefire deal to end his country's war with Russia.",
    "link": "https://www.nbcnews.com/world/ukraine/trump-zelenskyy-crimea-ukraine-russia-putin-rubio-francis-korea-peace-rcna203247",
    "timestamp": "2025-04-28T10:10:26Z"
  },
  {
    "title": "Canadians are set to vote in an election dominated by Trump’s trade war and bluster",
    "description": "Canada’s election on Monday is also a referendum on President Donald Trump, whose threats to the U.S. ally’s economy and sovereignty have infuriated voters.",
    "link": "https://www.nbcnews.com/world/north-america/canadians-are-set-vote-election-dominated-trumps-trade-war-bluster-rcna203253",
    "timestamp": "2025-04-28T10:09:03Z"
  },
  {
    "title": "Investors worry Big Oil could reduce share buybacks as crude prices slump",
    "description": "HOUSTON :When Exxon Mobil and Chevron report first-quarter results this week, investors will be focused on how falling oil prices have increased the risk to dividends and share repurchases for the rest of 2025.Big Oil has made returning cash to investors thro…",
    "link": "https://www.channelnewsasia.com/business/investors-worry-big-oil-could-reduce-share-buybacks-crude-prices-slump-5094591",
    "timestamp": "2025-04-28T10:08:04Z"
  },
  {
    "title": "Trump Accuses Democrats of 'Paying a Fortune' To Interrupt GOP Town Halls",
    "description": "President Donald Trump accused Democrats of paying hecklers following a series of hostile receptions to Republican lawmakers at public events.",
    "link": "https://www.newsweek.com/trump-accuses-democrats-paying-hecklers-2064919",
    "timestamp": "2025-04-28T10:05:50Z"
  },
  {
    "title": "Houthis Claim U.S. Strike On Yemen Killed 68 African Migrants Held In Detention Site",
    "description": "The U.S. military's Central Command has not commented on the alleged strike on the detention center, but on Sunday said it has struck 800 Houthi targets since March 15.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/04/28/houthis-claim-us-strike-on-yemen-killed-68-african-migrants-held-in-detention-site/",
    "timestamp": "2025-04-28T10:05:02Z"
  },
  {
    "title": "Elon Musk approval low, reflecting opposition to Trump cuts: POLL",
    "description": "Elon Musk's popularity is well underwater in public views of his work for President Donald Trump, according to an ABC News/Washington Post/Ipsos poll.",
    "link": "https://abcnews.go.com/Politics/elon-musk-approval-low-reflecting-opposition-trump-cuts/story?id=121199149",
    "timestamp": "2025-04-28T10:04:53Z"
  },
  {
    "title": "US aviation industry slammed by tariffs, seeks exemptions",
    "description": "CHICAGO (Reuters) -The U.S. aviation industry, reeling from President Donald Trump's trade war and a slump in travel demand, is lobbying the White House for ...",
    "link": "https://finance.yahoo.com/news/us-aviation-industry-slammed-tariffs-100328935.html",
    "timestamp": "2025-04-28T10:03:28Z"
  },
  {
    "title": "Did Trump Administration Deport US Children? What We Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's administration is under fire after three American children were removed from the United States.\nGovernment officials maintained that the children were not forcibly removed but accompan…",
    "link": "https://biztoc.com/x/efb07dfd99f7ec08",
    "timestamp": "2025-04-28T10:02:43Z"
  },
  {
    "title": "What the world is looking for in Canada's election",
    "description": "Assassinations, spies and taxes... as Canadians head to the polls, several other countries are closely watching.",
    "link": "https://www.bbc.com/news/articles/c62gryz170vo",
    "timestamp": "2025-04-28T10:02:19Z"
  },
  {
    "title": "Economists cast doubts on Liberal, Conservative fiscal projections as ‘too optimistic’",
    "description": "Economists are casting doubts on fiscal projections from both the Liberal and Conservative platforms in Canada's federal election. Read more",
    "link": "https://financialpost.com/federal_election/election-fiscal-projections-called-optimistic",
    "timestamp": "2025-04-28T10:00:51Z"
  },
  {
    "title": "The Tariffs and Retail: Winners and Losers Emerge",
    "description": "It’s been only a few weeks since the Trump administration’s so-called “Liberation Day,” but the effects on the country’s retailers are already evident. Earlier this month, President Donald Trump announced tariffs on nearly all U.S. trading partners and implem…",
    "link": "http://commercialobserver.com/2025/04/retail-tariffs-winners-losers/",
    "timestamp": "2025-04-28T10:00:50Z"
  },
  {
    "title": "'We're simply not ready': REAL ID rollout could trigger national headache, state lawmaker warns",
    "description": "Kentucky legislators are asking the Trump administration for an extension on the federal REAL ID deadline.",
    "link": "https://www.foxnews.com/politics/were-simply-not-ready-real-id-rollout-could-trigger-national-headache-kentucky-lawmaker-warns",
    "timestamp": "2025-04-28T10:00:40Z"
  },
  {
    "title": "Trump’s solar panel tariffs deal climate action a severe blow",
    "description": "Prohibitive rates of import duty on panels and cells tilt the energy field in the US in favour of emission-spewing fossil fuels as a source of electricity. This is as regressive a policy as it gets.",
    "link": "https://www.livemint.com/opinion/online-views/trump-solar-tariffs-biden-clean-energy-policy-morgan-stanley-solar-analysis-bloomberg-energy-report-china-solar-panel-11745666994848.html",
    "timestamp": "2025-04-28T10:00:07Z"
  },
  {
    "title": "Altcoin market caps $1.05T: Why an alt cycle makes more sense now",
    "description": "2024 ushered in a new crypto reality. Instead of avoiding it, it’s time to embrace it.",
    "link": "https://ambcrypto.com/altcoin-market-caps-1-05t-why-an-alt-cycle-makes-more-sense-now/",
    "timestamp": "2025-04-28T10:00:04Z"
  },
  {
    "title": "A President Who Championed American Universities",
    "description": "Trump’s attacks on higher education come 75 years after Lyndon B. Johnson set out to transform the sector.",
    "link": "http://foreignpolicy.com/2025/04/28/president-american-universities-lbj-johnson-trump/",
    "timestamp": "2025-04-28T10:00:02Z"
  },
  {
    "title": "In 100 Days, Trump Has Invented Something New: Clown-Show Fascism",
    "description": "Remember how April 2 was “Liberation\nDay”? That was the day Donald Trump announced his tariff regime; it was, I\nthink, the third grand announcement out of about six total. I know you remember\nit—the shock to the markets created headlines that are hard to forg…",
    "link": "https://newrepublic.com/article/194463/100-days-trump-clown-show-fascism",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "A Hundred Classics to Get Me Through a Hundred Days of Trump",
    "description": "Throughout the first one hundred days of the second Trump Presidency, Jill Lepore reads a hundred Penguin Little Black Classics.",
    "link": "https://www.newyorker.com/magazine/2025/05/05/a-hundred-classics-to-get-me-through-a-hundred-days-of-trump",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "A Lawyer Freed Young Thug. Now He’s Defending Diddy",
    "description": "A Profile of the attorney Brian Steel, who became the subject of a Drake song after representing Young Thug and the N.B.A. player Javaris Crittenton, and will defend Sean Combs at his trial for alleged sex-trafficking. Charles Bethea reports.",
    "link": "https://www.newyorker.com/magazine/2025/05/05/a-lawyer-freed-young-thug-now-hes-defending-diddy",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Josh Gottheimer uses AI in anti-Trump ad for the New Jersey governor's race",
    "description": "Democratic Rep. Josh Gottheimer argues in his first TV ad of the New Jersey governor's race that he is ready to fight President Donald Trump — and he's using artificial intelligence to make his case.",
    "link": "https://www.nbcnews.com/politics/elections/josh-gottheimer-uses-ai-anti-trump-ad-new-jersey-governors-race-rcna203190",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Donald Trump Is Already Ruining Christmas",
    "description": "Santa’s helpers are freaking out that steep tariffs on Chinese imports will prevent toys, trees, and decorations from arriving in the US on time for the December holiday.",
    "link": "https://www.wired.com/story/christmas-toys-trump-tariffs-china/",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Meta Earnings Preview: What To Know About The Stock Before The Upcoming Report",
    "description": "Meta earnings are coming. Here are some key factors to watch before the next report to help you make informed decisions on Meta.",
    "link": "https://www.forbes.com/sites/investor-hub/article/meta-stock-earnings-preview-what-to-know/",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "From “America First” to “Sell America”",
    "description": "John Cassidy on the first hundred days of President Donald Trump’s second term and the unprecedented economic fiasco that has unfolded.",
    "link": "https://www.newyorker.com/news/the-financial-page/from-america-first-to-sell-america",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "‘States’ rights’ are crucial to protecting American liberties",
    "description": "With a majority of the federal government under Trump-friendly GOP control, states are the one remaining bastion of constitutional authority able to push back.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/jb-pritzker-illinois-el-salvador-trump-states-rights-rcna202911",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "JD Vance Likes “Normal Gays.” Should We Count That as a Win?",
    "description": "In late March, a group of Republicans in California sparked controversy for their plan to host an event dubbed “A Normal Gay Social.” The party referenced something JD Vance said before the 2024 election: “I wouldn’t be surprised if me and Trump won … the nor…",
    "link": "https://newrepublic.com/article/194339/jd-vance-normal-gays-lgbtq-movement-history",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Signalgate, Trump, and The Atlantic",
    "description": "Denial and attack have worked exceedingly well for the president. But there are limits.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/06/signalgate-trump-atlantic-interview/682576/",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Donald Trump Is Enjoying This",
    "description": "The president explains how he plans to change America forever.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/06/trump-second-term-comeback/682573/",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Barry Blitt’s “The First Hundred Days”",
    "description": "Françoise Mouly speaks with the cartoonist Barry Blitt about his cover for the May 5, 2025, issue of The New Yorker.",
    "link": "https://www.newyorker.com/culture/cover-story/cover-story-2025-05-05",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Exclusive: Sam Altman Is Said to Have Pondered a Presidential Run",
    "description": "In an excerpt from her forthcoming book, ‘The Optimist,’ Keach Hagey reveals the extent of the OpenAI CEO’s political ambitions, including his solicitation of advice from friends and prominent political operators about running for office.",
    "link": "https://www.vanityfair.com/news/story/exclusive-sam-altman-is-said-to-have-pondered-a-presidential-run",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "The Trumpian Plot to Take Over the Federal Courts",
    "description": "A top Trump-aligned legal group filed a lawsuit last week that argued that two key components of the judicial branch are actually part of the executive branch—a novel legal theory that would radically expand President Donald Trump’s influence over the federal…",
    "link": "https://newrepublic.com/article/194461/trump-allies-commandeer-federal-courts",
    "timestamp": "2025-04-28T10:00:00Z"
  },
  {
    "title": "Did Trump Administration Deport US Children? What We Know",
    "description": "Secretary of State Marco Rubio rejected claims that three U.S. citizens—all under the age of 10—were deported without due process.",
    "link": "https://www.newsweek.com/trump-administration-deport-us-children-2064896",
    "timestamp": "2025-04-28T09:59:21Z"
  },
  {
    "title": "Putin thanks North Korea for sending troops to fight Ukraine: 'Will never forget the heroism'",
    "description": "Russian President Vladimir Putin on Monday thanked North Korea for sending troops to fight alongside Russia in his war against Ukraine and promised not to forget their sacrifices.",
    "link": "https://www.foxnews.com/world/putin-thanks-north-korea-sending-troops-fight-ukraine-will-never-forget-heroism",
    "timestamp": "2025-04-28T09:54:36Z"
  },
  {
    "title": "Russia and Ukraine trade long-range strikes as peace talks enter 'very critical' week",
    "description": "Ukraine and Russia targeted each other with long-range strikes, officials said Monday, amid continuing uncertainty about whether an agreement to stop their...",
    "link": "https://www.yahoo.com/news/russia-ukraine-trade-long-range-095334947.html",
    "timestamp": "2025-04-28T09:53:34Z"
  },
  {
    "title": "60 Minutes’ Scott Pelley Rebukes Parent Company Paramount in Shocking Moment After Veteran Producer’s Exit",
    "description": "CBS’ 60 Minutes took the unusual step of publicly calling out its corporate owner, Paramount Global, after the abrupt resignation of its longtime executive producer Bill Owens. Closing the program on Sunday, veteran anchor Scott Pelley placed the blame square…",
    "link": "https://www.mediaite.com/tv/60-minutes-scott-pelley-rebukes-parent-company-paramount-in-shocking-moment-after-veteran-producers-exit/",
    "timestamp": "2025-04-28T09:51:42Z"
  },
  {
    "title": "60 Minutes’ Scott Pelley Rebukes Parent Company Paramount in Shocking Moment After Veteran Producer’s Exit",
    "description": "CBS’ 60 Minutes took the unusual step of publicly calling out its corporate owner, Paramount Global, after the abrupt resignation of its longtime executive producer Bill Owens. Closing the program on Sunday, veteran anchor Scott Pelley placed the blame square…",
    "link": "https://www.mediaite.com/uk/60-minutes-scott-pelley-rebukes-parent-company-paramount-in-shocking-moment-after-veteran-producers-exit/",
    "timestamp": "2025-04-28T09:51:42Z"
  },
  {
    "title": "Harris Faulkner Visibly Triggers Dem Guest After She Tells Him Trump Facing ‘Lawfare’ Over Immigration",
    "description": "By Harold Hutchison, Daily Caller News Foundation | April 23, 2025\nFox News host Harris Faulkner frustrated a Democratic guest on Wednesday, reminding him about numerous lawsuits against President Donald Trump’s efforts to deport illegal immigrants.\nThe Supre…",
    "link": "https://biztoc.com/x/81b76e3580a96356",
    "timestamp": "2025-04-28T09:51:32Z"
  },
  {
    "title": "Trump blasts media over 'fake polls'",
    "description": "United States President Donald Trump took to Truth Social on Monday, blasting the New York Times, ABC, and the Washington Post over what he referred to as \"fake polls,\" while calling for them to be in...",
    "link": "https://biztoc.com/x/273bcf1cea021d07",
    "timestamp": "2025-04-28T09:51:21Z"
  },
  {
    "title": "Russia Launches Massive Ukraine Attacks After Trump Tells Putin To Stop",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nRussia has launched its largest wave of strikes on Ukraine since Thursday, when President Donald Trump urged his Russian counterpart to halt attacks on Moscow's neighbor, according to an independent investigat…",
    "link": "https://biztoc.com/x/820b441ba125dff0",
    "timestamp": "2025-04-28T09:50:55Z"
  },
  {
    "title": "Global shares mostly gain as uncertainty over US tariffs persists",
    "description": "Global markets are mostly higher as investors wait to see what comes of negotiations over U.S. President Donald Trump’s tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/global-shares-gain-uncertainty-us-tariffs-persists-121227276",
    "timestamp": "2025-04-28T09:50:16Z"
  },
  {
    "title": "‘Darkened his own brand’: Albanese lashes Dutton’s leadership style",
    "description": "Prime Minister Anthony Albanese has called out Peter Dutton's history of \"punching down on vulnerable people\" during a wide-ranging interview on 7.30 that focused on several key election issues.",
    "link": "https://www.abc.net.au/news/2025-04-28/anthony-albanese-says-peter-dutton-darkened-his-brand-/105180760",
    "timestamp": "2025-04-28T09:48:30Z"
  },
  {
    "title": "Russia Launches Massive Ukraine Attacks After Trump Tells Putin To Stop",
    "description": "Russia attacked Ukrainian regions with 149 drones on Sunday night, as Trump tries to end the conflict with peace talks.",
    "link": "https://www.newsweek.com/russia-drone-attack-ukraine-trump-putin-2064914",
    "timestamp": "2025-04-28T09:48:04Z"
  },
  {
    "title": "Mark Carney’s unexpected political rise as Canada faces a defining moment",
    "description": "Canada faces a political shift as Mark Carney leads the Liberal Party. He aims to address economic challenges and rising tensions with the United States. Carney's leadership contrasts with rivals like Pierre Poilievre. The upcoming election will determine if …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/mark-carneys-unexpected-political-rise-as-canada-faces-a-defining-moment/articleshow/120692722.cms",
    "timestamp": "2025-04-28T09:47:47Z"
  },
  {
    "title": "Live updates: 2025 Canadian federal election results",
    "description": "It is still too close to call whether the party will secure a majority, as votes are still being counted around the country.",
    "link": "https://www.bbc.com/news/live/cr5d13e4r2rt",
    "timestamp": "2025-04-28T09:46:07Z"
  },
  {
    "title": "Nexo to Return to U.S. After 2022 Exit, Citing Renewed Crypto Optimism Under Trump",
    "description": "The digital asset platform, which left the U.S. after clashing with regulators, says it’s relaunching with full services for retail and institutional clients.",
    "link": "https://www.coindesk.com/policy/2025/04/28/nexo-to-return-to-us-after-2022-exit-citing-renewed-crypto-optimism-under-trump",
    "timestamp": "2025-04-28T09:45:52Z"
  },
  {
    "title": "Gold slumps 1% as US-China trade tensions ease",
    "description": "Gold prices fell over 1% on Monday as easing trade relations between the US and China increased market confidence and reduced safe-haven demand.Last week, US President Donald Trump indicated a possibl...",
    "link": "https://biztoc.com/x/c211a7f7ecb39a2f",
    "timestamp": "2025-04-28T09:40:15Z"
  },
  {
    "title": "PoC rootkit Curing evades traditional Linux detection systems",
    "description": "Researchers created a PoC rootkit called Curing that uses Linux’s io_uring feature to evade traditional system call monitoring. Armo researchers have demonstrated a proof-of-concept (PoC) rootkit named Curing that relies on Linux asynchronous I/O mechanism io…",
    "link": "https://securityaffairs.com/177098/hacking/poc-rootkit-curing-evades-traditional-linux-detection-systems.html",
    "timestamp": "2025-04-28T09:38:36Z"
  },
  {
    "title": "The $160 Billion Fund Behind Novo Nordisk Puts Investing on Hold",
    "description": "The $160 billion fund behind Ozempic-maker Novo Nordisk A/S says President Donald Trump’s tariff war has created so much economic uncertainty that it now sees little likelihood it will move ahead with any big investments.",
    "link": "https://financialpost.com/pmn/business-pmn/the-160-billion-fund-behind-novo-nordisk-puts-investing-on-hold",
    "timestamp": "2025-04-28T09:37:58Z"
  },
  {
    "title": "Aging army tanks donated to Ukraine are yet to leave Australia",
    "description": "A fleet of retired tanks the Albanese government pledged to Ukraine last year remain stuck in Australia, with defence figures in part blaming resistance from the United States for their delayed transfer.",
    "link": "https://www.abc.net.au/news/2025-04-28/aging-tanks-donated-to-ukraine-are-yet-to-leave-australia/105226280",
    "timestamp": "2025-04-28T09:32:45Z"
  },
  {
    "title": "Trump's Next Steps with China Trade War; Canada Election Day",
    "description": "On today's podcast: 1) President Donald Trump’s tariff onslaught has roiled Washington and Wall Street for nearly a month. If the trade war persists, the next upheaval will hit much closer to home. 2) Donald Trump promised Americans a “boom like no other” if …",
    "link": "https://omny.fm/shows/bloomberg-daybreak/trumps-next-steps-with-china-trade-war-canada-election-day",
    "timestamp": "2025-04-28T09:30:19Z"
  },
  {
    "title": "Did You Know Consumer Debt Has Reached an All-Time High?",
    "description": "Katrina vanden Heuvel\n\n\n\nAnd total household debt now exceeds $18 trillion.\r\n\n\r\n\n\nThe post Did You Know Consumer Debt Has Reached an All-Time High? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/economy/consumer-debt-spending-trump-budget/",
    "timestamp": "2025-04-28T09:30:00Z"
  },
  {
    "title": "President Trump is about to complete his first 100 days—here’s what he’s done",
    "description": "In his first 100 days, President Donald Trump exerted his power in a sweep and scale that has no easy historical comparison.\nHis actions target the architecture of the New Deal, the Great Society, and the Reagan Republican orthodoxy of free trade and strong i…",
    "link": "https://biztoc.com/x/018c4baa8440dee9",
    "timestamp": "2025-04-28T09:29:16Z"
  },
  {
    "title": "Trump said to demand a list of 'sanctuary' cities",
    "description": "US President Donald Trump will sign an executive order Monday targeting Democratic-led states and cities that don't fully cooperate with federal immigration authorities, the Wall Street Journal report...",
    "link": "https://biztoc.com/x/6a4274a982bcc895",
    "timestamp": "2025-04-28T09:29:08Z"
  },
  {
    "title": "Thanks to Trump, Chinese firms are warming up to India",
    "description": "Chinese companies are now more open to diluting stakes in favour of Indian entities due to Trump's tariffs. Reliance Industries is a key contender for a stake in Haier India. Shanghai Highly Group has revived talks with Tata-owned Voltas for a joint venture. …",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/thanks-to-trump-chinese-firms-are-warming-up-to-india-reliance-likely-enters-race-for-haier-stake/articleshow/120692015.cms",
    "timestamp": "2025-04-28T09:27:15Z"
  },
  {
    "title": "Thanks to Trump, Chinese firms are warming up to India",
    "description": "Chinese companies are now more open to diluting stakes in favour of Indian entities due to Trump's tariffs. Reliance Industries is a key contender for a stake in Haier India. Shanghai Highly Group has revived talks with Tata-owned Voltas for a joint venture. …",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/thanks-to-trump-chinese-firms-are-warming-up-to-india-reliance-likely-enters-race-for-haier-stake/articleshow/120691611.cms",
    "timestamp": "2025-04-28T09:27:15Z"
  },
  {
    "title": "US Says Houthi Capabilities Degraded",
    "description": "Concerns about civilian impact in Yemen grow as Houthis report dozens killed in airstrike on prison holding African migrants.",
    "link": "https://www.newsweek.com/us-says-houthi-capabilities-degraded-2064851",
    "timestamp": "2025-04-28T09:24:11Z"
  },
  {
    "title": "Houthi rebels say 68 killed by US air strike that hit Yemen detention centre",
    "description": "Yemen's Iran-aligned Houthis has alleged that a US air strike has hit a prison in Saada that holds African migrants.",
    "link": "https://www.abc.net.au/news/2025-04-28/africn-migrants-in-yemen-killed-by-us-airstrike/105225732",
    "timestamp": "2025-04-28T09:23:17Z"
  },
  {
    "title": "Houthi rebels say 68 killed by US air strike that hit Yemen detention centre",
    "description": "Yemen's Iran-aligned Houthis has alleged that a US air strike has hit a detention centre in Saada that holds African migrants.",
    "link": "https://www.abc.net.au/news/2025-04-28/african-migrants-in-yemen-killed-by-us-airstrike/105225732",
    "timestamp": "2025-04-28T09:23:17Z"
  },
  {
    "title": "Philadelphia Eagles to visit Trump at White House today. Here's what to know.",
    "description": "The Philadelphia Eagles will visit President Trump at the White House today to celebrate their Super Bowl win. Here's everything you need to know.",
    "link": "https://www.cbsnews.com/philadelphia/news/eagles-white-house-visit-2025/",
    "timestamp": "2025-04-28T09:19:00Z"
  },
  {
    "title": "What the polls say about Trump's presidency at 100 days",
    "description": "As President Donald Trump hits the 100-day mark of his presidency, a spate of new polling shows significant warning signs on signature issues like the economy and cutting the size of government.",
    "link": "https://biztoc.com/x/332512dcd33a07e2",
    "timestamp": "2025-04-28T09:18:01Z"
  },
  {
    "title": "As China Downplays Trump Tariffs With 5% Growth Target, Top Economist Warns Of '90% Chance Of A US Recession' Amid Trade War",
    "description": "China's National Development and Reform Commission (NDRC), the country's top economic planning agency, is downplaying the impact of President Donald Trump's tariffs and projecting strong growth despite mounting macroeconomic headwinds.\nWhat Happened: On Monda…",
    "link": "https://biztoc.com/x/d66dbf2cdd1bdad5",
    "timestamp": "2025-04-28T09:18:01Z"
  },
  {
    "title": "Carney’s Edge Slips as Canada’s Election Comes to a Hectic End",
    "description": "The Conservative Party chipped away at the lead held by Mark Carney’s Liberals in the final days of Canada’s election campaign, though surveys still point to a probable Liberal victory in Monday’s vote.",
    "link": "https://financialpost.com/pmn/business-pmn/carneys-edge-slips-as-canadas-election-comes-to-a-hectic-end",
    "timestamp": "2025-04-28T09:17:19Z"
  },
  {
    "title": "'That Is Just A Fact': Jen Psaki Hits Trump With Raw Reality Of How Unpopular He Is",
    "description": "She said the president \"badly\" overplayed his hand -- and is now paying the price.",
    "link": "https://www.huffpost.com/entry/jen-psaki-trump-polls_n_680f0cd8e4b049bc73d557a3",
    "timestamp": "2025-04-28T09:17:08Z"
  },
  {
    "title": "Canadians Are Set To Vote In An Election Dominated By Trump's Trade War And Bluster",
    "description": "Canadians will decide whether to extend the Liberal Party’s decade in power or instead hand control to the Conservatives.",
    "link": "https://www.huffpost.com/entry/canadian-election-dominated-by-trump_n_680f451fe4b049bc73d57bf6",
    "timestamp": "2025-04-28T09:17:00Z"
  }
]