[
  {
    "title": "White House Withdraws Pro-Crypto Brian Quintenz's Name From CFTC Chair Nomination",
    "description": "Gemini's co-founders Tyler and Cameron Winklevoss opposed Quintenz's nomination.",
    "link": "https://www.coindesk.com/policy/2025/09/30/white-house-withdraws-brian-quintenz-s-name-from-cftc-chair-nomination",
    "timestamp": "2025-09-30T23:36:41Z"
  },
  {
    "title": "Dems in hot seat after DHS warns their frontline workers will go without pay if shutdown hits",
    "description": "Nearly 200,000 Department of Homeland Security frontline officers and employees will likely work without pay during the government shutdown while maintaining critical functions.",
    "link": "https://www.foxnews.com/politics/dems-in-hot-seat-after-dhs-warns-frontline-workers-will-go-without-pay-if-shutdown-hits",
    "timestamp": "2025-09-30T23:36:05Z"
  },
  {
    "title": "Democrats vote down GOP funding bill, putting government on path to shutdown",
    "description": "The 55-45 vote Tuesday on the bill to extend federal funding for seven weeks fell short of the 60 needed to end a filibuster.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_d8c96a72-dc66-5179-b1d4-ca70da3c149e.html",
    "timestamp": "2025-09-30T23:36:00Z"
  },
  {
    "title": "Government Shutdown Watch: Senate Rejects Eleventh-Hour Bid To Keep Government Open",
    "description": "The government will shut down at midnight Tuesday if Congress doesn't approve a new spending plan.",
    "link": "https://www.forbes.com/sites/saradorn/2025/09/30/government-shutdown-watch-senate-rejects-eleventh-hour-bid-to-keep-government-open/",
    "timestamp": "2025-09-30T23:35:58Z"
  },
  {
    "title": "EU leaders to discuss 'drone wall' in Denmark, days after airspace violations",
    "description": "COPENHAGEN (Reuters) -European Union leaders will discuss proposals for a \"drone wall\" to protect the continent at a summit on Wednesday in Copenhagen, just ...",
    "link": "https://www.yahoo.com/news/articles/eu-leaders-discuss-drone-wall-233507054.html",
    "timestamp": "2025-09-30T23:35:07Z"
  },
  {
    "title": "The Supreme Court’s newest decision could make it impossible to end the shutdown",
    "description": "Justice Brett Kavanaugh (L) and Chief Justice John Roberts listen as President Donald Trump speaks during his second inaugural. | Photo by Chip Somodevilla/Getty Images \nOn Friday, the Supreme Court handed down an order that could completely upend the balance…",
    "link": "https://biztoc.com/x/786719ca6de47cce",
    "timestamp": "2025-09-30T23:35:02Z"
  },
  {
    "title": "Pfizer CEO Albert Bourla agrees to lower prescription drug prices for Medicaid in deal with president, participate in TrumpRx",
    "description": "Pfizer has agreed to lower the cost of prescription drugs for Medicaid under a deal struck with the Trump administration, President Donald Trump said Tuesday.",
    "link": "https://abc7chicago.com/post/pfizer-ceo-albert-bourla-agrees-lower-prescription-drug-prices-medicaid-deal-president-participate-trumprx/17912970/",
    "timestamp": "2025-09-30T23:34:58Z"
  },
  {
    "title": "Trump administration blames Democrats for shutdown in official government warnings as deadline nears",
    "description": "By MEG KINNARD HOUSTON (AP) — With the first U.S. government shutdown in almost seven years looming, the Trump administration is using official government communications to blame Democrats and promote the president’s policies. At least one agency has posted a…",
    "link": "https://www.bostonherald.com/2025/09/30/trump-administration-blames-democrats-for-shutdown-in-official-government-warnings-as-deadline-nears/",
    "timestamp": "2025-09-30T23:33:43Z"
  },
  {
    "title": "The Supreme Court’s newest decision could make it impossible to end the shutdown",
    "description": "On Friday, the Supreme Court handed down an order that could completely upend the balance of power between Congress and President Donald Trump. The order effectively permits Trump to cancel $4 billion in foreign aid spending that he is required to spend under…",
    "link": "https://www.vox.com/politics/463335/supreme-court-shutdown-aids-vaccine-trump-impoundment",
    "timestamp": "2025-09-30T23:31:08Z"
  },
  {
    "title": "As Government Shutdown Looms, Donald Trump’s GOP And Democrats Start The Media Messaging Blame Game",
    "description": "The U.S. government is likely to shut down at 12:01 a.m. ET on Wednesday, with Donald Trump, Republicans and Democrats at an impasse and the sides now focusing their attention on winning the media messaging blame game. That was apparent on Capitol Hill, where…",
    "link": "http://deadline.com/2025/09/as-government-shutdown-looms-donald-trumps-gop-and-democrats-start-the-media-messaging-blame-game-1236566654/",
    "timestamp": "2025-09-30T23:30:12Z"
  },
  {
    "title": "Trump's masked ICE agents compared to KKK by Reagan-appointed judge",
    "description": "A federal judge in Massachusetts stunned observers on Tuesday with a scathing 161-page rebuke of President Donald Trump's administration for terrorizing noncitizen students for exercising their free speech rights to protest the Israeli occupation of Gaza. At …",
    "link": "https://www.rawstory.com/judge-ice-2674141354/",
    "timestamp": "2025-09-30T23:30:02Z"
  },
  {
    "title": "Schumer’s Bid To Shut Down Government Exposes Democratic Fissures",
    "description": "Senate Democrats blocked a clean extension of government funding late Tuesday evening, but a handful of Democrats bucked Senate Minority Leader Chuck Schumer in an effort to avert a looming government shutdown.  Three members of the Democratic caucus — Sens. …",
    "link": "https://dailycaller.com/2025/09/30/government-shutdown-democrats-chuck-schumer/",
    "timestamp": "2025-09-30T23:27:14Z"
  },
  {
    "title": "The US is on the brink of a government shutdown. Here's what that means",
    "description": "US President Donald Trump is warning a government shutdown is imminent. Here's a breakdown of what that means.",
    "link": "https://www.abc.net.au/news/2025-10-01/trump-us-government-shutdown-explained/105835552",
    "timestamp": "2025-09-30T23:25:19Z"
  },
  {
    "title": "Legault unveils bold economic and social plan to revive Quebec and cut public spending",
    "description": "In an attempt to revive his party's political fortunes, Quebec Premier François ​​​​​​​Legault has outlined what he calls a \"new economic vision\" for the province.",
    "link": "https://www.cbc.ca/news/canada/montreal/legault-social-economic-quebec-1.7647746",
    "timestamp": "2025-09-30T23:24:05Z"
  },
  {
    "title": "Houthis claim missile attack on Dutch ship in Gulf of Aden",
    "description": "Iranian-backed Houthis in Yemen claim missile strike on Dutch cargo ship Minervagracht in Gulf of Aden, which injured two crew members.",
    "link": "https://www.israelnationalnews.com/news/415656",
    "timestamp": "2025-09-30T23:23:28Z"
  },
  {
    "title": "The Commander in Chief Is Not Okay",
    "description": "Trump put on a disturbing show for America’s generals and admirals.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/09/trump-hegseth-speech-incoherent/684421/",
    "timestamp": "2025-09-30T23:23:00Z"
  },
  {
    "title": "The Commander in Chief Is Not Okay",
    "description": "Trump put on a disturbing show for America’s generals and admirals.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/09/trump-hegseth-speech-incoherent/684421/?utm_source=yahoo-news",
    "timestamp": "2025-09-30T23:23:00Z"
  },
  {
    "title": "Government shutdown risk grows after Dems block Trump-backed extension for a 2nd time",
    "description": "Senate Republicans and Democrats remain deadlocked over government funding as a partial shutdown looms, with disagreements over Obamacare subsidies.",
    "link": "https://www.foxnews.com/politics/government-shutdown-risk-grows-after-dems-block-trump-backed-extension-2nd-time",
    "timestamp": "2025-09-30T23:20:57Z"
  },
  {
    "title": "Top Democrat Dares Trump To Insult Him To His Face After Racist AI Parody",
    "description": "House Minority Leader Hakeem Jeffries fumed at the president for mocking Democrats after failed negotiations to avoid a government shutdown.",
    "link": "https://www.huffpost.com/entry/hakeem-jeffries-donald-trump-say-it-to-my-face-racist-ai-video_n_68dc3b6be4b0d2dd3158567c",
    "timestamp": "2025-09-30T23:17:36Z"
  },
  {
    "title": "Trump Presidential Library Approved by Miami: What to Know and Location Map",
    "description": "Florida officials voted to set aside nearly three acres in Miami as a potential site for the presidential library of Donald Trump.",
    "link": "https://biztoc.com/x/3f4e837872e95909",
    "timestamp": "2025-09-30T23:12:31Z"
  },
  {
    "title": "Schwarzenegger downplays Trump and backs Vatican initiative to ‘terminate’ global warming",
    "description": "Schwarzenegger was at the Vatican to headline a three-day climate conference.",
    "link": "https://www.bostonherald.com/2025/09/30/schwarzenegger-vatican-climate/",
    "timestamp": "2025-09-30T23:10:01Z"
  },
  {
    "title": "Americans Don't Agree with Democrats' Actions (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nAmericans Don't Agree with Democrats' Actions  —  We urge elected leaders to act with urgency and in good faith to identify a solution that will keep the government open beyond October 1.  Travelers, the shipping p…",
    "link": "https://www.memeorandum.com/250930/p149",
    "timestamp": "2025-09-30T23:10:00Z"
  },
  {
    "title": "Civil rights agency drops a key tool used to investigate workplace discrimination",
    "description": "The U.S. civil rights agency responsible for enforcing worker rights will stop investigating complaints about company policies that don’t explicitly discriminate but may disproportionately harm certain groups. The U.S. Equal Employment Opportunity Commission …",
    "link": "https://apnews.com/article/trump-discrimination-ai-eeoc-disparate-impact-a2e8aba11f3d3f095df95d488c6b3c40",
    "timestamp": "2025-09-30T23:08:08Z"
  },
  {
    "title": "Anti-ICE protesters shut down portion of Wacker Drive in Chicago",
    "description": "A group of demonstrators protesting ICE activity and federal troop deployment in Chicago marched along Wacker Drive on Monday evening.",
    "link": "https://www.nbcchicago.com/news/local/anti-ice-protesters-shut-down-portion-of-wacker-drive-in-downtown-chicago/3831786/",
    "timestamp": "2025-09-30T23:07:22Z"
  },
  {
    "title": "Tuesday Night Open Threads",
    "description": "So this was terrifying and surreal: At an address of assembled generals and admirals, Pete Hegseth, the US defense secretary, outlined changes to military policy and philosophy in a set of 10 directives meant to change organizational culture around fitness, r…",
    "link": "https://balloon-juice.com/2025/09/30/tuesday-night-open-threads/",
    "timestamp": "2025-09-30T23:06:16Z"
  },
  {
    "title": "Trump and Hegseth gather the military’s top commanders for a loyalty test",
    "description": "Could this meeting have been an email? Last week, when news broke that Secretary of Defense Pete Hegseth had ordered hundreds of generals from around the world to gather at the Marine base in Quantico, Virginia, this week, it set off fevered speculation about…",
    "link": "https://www.vox.com/today-explained-newsletter/463309/trump-hegseth-quantico-speech-generals-loyalty-test",
    "timestamp": "2025-09-30T23:05:30Z"
  },
  {
    "title": "The world's first carbon border tax will soon go live — shaking up global trade",
    "description": "The European Union is poised to fully implement its carbon border tax from Jan. 1.",
    "link": "https://www.cnbc.com/2025/10/01/carbon-border-tax-us-china-and-india-lash-out-at-eu-climate-policy.html",
    "timestamp": "2025-09-30T23:04:28Z"
  },
  {
    "title": "’60 Minutes’ Season 58 Premiere Scores Over 10 Million Viewers, Down Slightly From Previous Opener | Exclusive",
    "description": "The episode was up 5% from its performance on the same night in 2024\nThe post ’60 Minutes’ Season 58 Premiere Scores Over 10 Million Viewers, Down Slightly From Previous Opener | Exclusive appeared first on TheWrap.",
    "link": "https://www.thewrap.com/60-minutes-season-58-premiere-ratings-cbs/",
    "timestamp": "2025-09-30T23:03:39Z"
  },
  {
    "title": "Federal employees told Democrats to blame for shutdown in ‘highly inappropriate’ email",
    "description": "Federal employees at multiple agencies received emails Tuesday blaming congressional Democrats for a potential government shutdown “forced” by the party, an ...",
    "link": "https://thehill.com/homenews/administration/5530094-federal-emails-shutdown-democrats/",
    "timestamp": "2025-09-30T23:01:48Z"
  },
  {
    "title": "Chicago mayor says 'unstable human being' Trump must be 'checked' on military use in US cities",
    "description": "Chicago Mayor Brandon Johnson called President Donald Trump an \"unstable human being\" on CNN Monday, urging Congress to check his military deployment plans.",
    "link": "https://www.foxnews.com/media/chicago-mayor-says-unstable-human-being-trump-must-checked-military-use-us-cities",
    "timestamp": "2025-09-30T23:00:28Z"
  },
  {
    "title": "Harvard May Settle Government Dispute For $500 Million, Trump Says",
    "description": "The settlement comes after the Trump administration froze $2.2 billion in funding for Harvard and attempted to stop international student enrollment at the university.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/09/30/harvard-may-settle-government-dispute-for-500-million-trump-says/",
    "timestamp": "2025-09-30T23:00:13Z"
  },
  {
    "title": "Winston Peters shows courage abroad, but must show it at home – Richard Prebble",
    "description": "OPINION: It will take courageous leadership to avert a debt crisis.",
    "link": "https://www.nzherald.co.nz/business/winston-peters-shows-courage-abroad-but-must-show-it-at-home-richard-prebble/Z4FEAELUKRB77EVLFMLB5TQY7I/",
    "timestamp": "2025-09-30T23:00:00Z"
  },
  {
    "title": "Italy’s Meloni says Gaza flotilla risks escalation, could ‘blow up' potential ceasefire deal",
    "description": "Italian PM Giorgia Meloni blasted the Gaza flotilla for exploiting civilians as Israel braces for escalation, raising fears it could derail Donald Trump’s peace push.",
    "link": "https://www.foxnews.com/world/italys-meloni-says-gaza-flotilla-risks-escalation-could-blow-up-potential-ceasefire-deal",
    "timestamp": "2025-09-30T22:59:17Z"
  },
  {
    "title": "Only these workers can 'break' shutdown as America careens toward 'disaster': expert",
    "description": "Political scientist Larry Sabato is warning that President Donald Trump and the Republican Party may exploit the likely federal government shutdown, saying that the GOP, as the “anti-government party,” is “perfectly happy” when the government shuts down and “…",
    "link": "https://www.rawstory.com/government-shutdown-2674141408/",
    "timestamp": "2025-09-30T22:56:27Z"
  },
  {
    "title": "Republicans falsely claiming Democrats want to give free health care to those without legal status",
    "description": "Republicans falsely claiming Democrats want to give free health care to those without legal statusgo.com",
    "link": "https://abcnews.go.com/Politics/republicans-falsely-claiming-democrats-give-free-health-care/story?id=126094099",
    "timestamp": "2025-09-30T22:53:48Z"
  },
  {
    "title": "Defiant Schumer Predicts Most Americans Will Pressure Trump To End Shutdown",
    "description": "Senate Minority Leader Chuck Schumer said Tuesday that Republicans will soon face overwhelming public pressure to end the government shutdown.",
    "link": "https://dailycaller.com/2025/09/30/chuck-schumer-americans-pressure-trump-end-shutdown/",
    "timestamp": "2025-09-30T22:52:35Z"
  },
  {
    "title": "Trump: Drop in Drug Prices Will Have ‘Huge’ Impact on Midterms",
    "description": "WASHINGTON, D.C. – President Donald Trump believes that reductions in prescription drug prices will have a significant impact on the midterm elections.\nThe post Trump: Drop in Drug Prices Will Have ‘Huge’ Impact on Midterms appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/30/trump-drop-in-drug-prices-will-have-huge-impact-on-midterms/",
    "timestamp": "2025-09-30T22:52:12Z"
  },
  {
    "title": "Trump and Hegseth ripped by ex-Pentagon staff for 'condescending and insulting' America's top generals",
    "description": "Donald Trump and Pete Hegseth were accused of 'condescending and insulting' America's top generals and admirals at a highly anticipated summit on Tuesday. The president and Secretary of War hosted hundreds of military chiefs at Marine Corps Base Quantico on T…",
    "link": "https://freerepublic.com/focus/f-chat/4343571/posts",
    "timestamp": "2025-09-30T22:51:24Z"
  },
  {
    "title": "Trump and Hegseth ripped by ex-Pentagon staff for 'condescending and insulting' America's top generals",
    "description": "Donald Trump and Pete Hegseth were accused of 'condescending and insulting' America's top generals and admirals at a highly anticipated summit on Tuesday. The president and Secretary of War hosted hundreds of military chiefs at Marine Corps Base Quantico on T…",
    "link": "https://freerepublic.com/focus/f-news/4343571/posts",
    "timestamp": "2025-09-30T22:51:24Z"
  },
  {
    "title": "South Korean president to meet with OpenAI CEO on Wednesday",
    "description": "SEOUL (Reuters) -OpenAI Chief Executive Sam Altman on Wednesday plans to meet with South Korean President Lee Jae Myung, who seeks to boost Asia's fourth...",
    "link": "https://www.yahoo.com/news/articles/south-korean-president-meet-openai-224924676.html",
    "timestamp": "2025-09-30T22:49:24Z"
  },
  {
    "title": "Trump admin pulls Brian Quintenz as CFTC nominee: Report",
    "description": "The White House has withdrawn Brian Quintenz as Donald Trump's pick to chair the commodities regulator, Politico reports.",
    "link": "https://cointelegraph.com/news/white-house-pulls-brian-quintenz-cftc-nominee",
    "timestamp": "2025-09-30T22:47:01Z"
  },
  {
    "title": "Trump tells military brass U.S. faces ‘invasion from within’",
    "description": "The president has sought to involve the military in his political agenda despite fears by top officers that this could erode support for an institution meant to be apolitical.",
    "link": "https://www.japantimes.co.jp/news/2025/10/01/world/politics/trump-hegseth-military-speeches/",
    "timestamp": "2025-09-30T22:45:00Z"
  },
  {
    "title": "Hundreds of Generals Try to Keep a Straight Face",
    "description": "Pete Hegseth gathered commanders from around the globe to unveil new physical-fitness standards.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/09/pete-hegseth-speech-commanders-quantico-trump/684420/",
    "timestamp": "2025-09-30T22:45:00Z"
  },
  {
    "title": "Report: Trump Showed Schumer, Jeffries Biden Autopen Portrait",
    "description": "During a meeting with Senate Minority Leader Chuck Schumer (D-NY) and House Minority Leader Hakeem Jeffries (D-NY), President Donald Trump reportedly showed them a photo of former President Joe Biden that is represented by an “autopen.” Andrew Desiderio, a se…",
    "link": "https://www.breitbart.com/politics/2025/09/30/report-trump-showed-schumer-jeffries-biden-autopen-portrait/",
    "timestamp": "2025-09-30T22:44:54Z"
  },
  {
    "title": "James Comey case jeopardizes Americans' free speech rights, retired judges warn",
    "description": "The Trump administration's case against former FBI Director James Comey should be a warning sign to Americans, 42 former judges wrote in an open letter first obtained by NBC News.",
    "link": "https://www.nbcnews.com/politics/justice-department/james-comey-case-jeopardizes-free-speech-rights-retired-judges-rcna234774",
    "timestamp": "2025-09-30T22:42:36Z"
  },
  {
    "title": "Trump says Harvard deal is close, university will pay $500 million",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump said on Tuesday that his administration was close to a deal with Harvard University that would include a...",
    "link": "https://www.yahoo.com/news/articles/trump-says-harvard-deal-close-224146371.html",
    "timestamp": "2025-09-30T22:41:46Z"
  },
  {
    "title": "US consumer watchdog, largely shuttered, to continue work during shutdown, email says",
    "description": "WASHINGTON (Reuters) -The top U.S. watchdog agency for consumer finances told staff on Tuesday it will continue to operate in the event of a government...",
    "link": "https://www.yahoo.com/news/articles/us-consumer-watchdog-largely-shuttered-224101999.html",
    "timestamp": "2025-09-30T22:41:01Z"
  },
  {
    "title": "The imminent government shutdown, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The federal government is hours away from the start of…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/463322/government-shutdown-funding-trump-schumer-democrats",
    "timestamp": "2025-09-30T22:38:22Z"
  },
  {
    "title": "Donald Trump’s TikTok Deal Could Prove Treacherous For Content Creators, Politically & Economically",
    "description": "Donald Trump is currently in the process of closing a deal that could permanently alter TikTok and throw a major wrench into the creator economy. With far-reaching implications on the influential platform, the administration is in the final stages of negotiat…",
    "link": "http://deadline.com/2025/09/trump-tiktok-deal-content-creators-impact-1236565669/",
    "timestamp": "2025-09-30T22:37:46Z"
  },
  {
    "title": "Pfizer to offer cheaper drugs via Trump's website",
    "description": "Pfizer says prices for some drugs will be cut by up to 85% on the direct-to-consumer TrumpRx site.",
    "link": "https://www.bbc.com/news/articles/cgmze0pe8vxo",
    "timestamp": "2025-09-30T22:35:26Z"
  },
  {
    "title": "The Mainstream Media Is Catastrophically Failing To Meet The Moment",
    "description": "Earlier today we wrote about Trump’s extraordinary admission that he was basing military deployment decisions on old Fox News footage and lies from his advisors. But there’s an even more damning story here: how that revelation almost never saw the light of da…",
    "link": "https://www.techdirt.com/2025/09/30/the-mainstream-media-is-catastrophically-failing-to-meet-the-moment/",
    "timestamp": "2025-09-30T22:35:26Z"
  },
  {
    "title": "Charlie Kirk once changed transgender man's tire after Phoenix rally?",
    "description": "According to the story, Kirk once helped a transgender man who hours earlier had harshly criticized the conservative activist at one of his events.",
    "link": "https://www.snopes.com//news/2025/09/30/charlie-kirk-change-transgender-man-tire/",
    "timestamp": "2025-09-30T22:35:00Z"
  },
  {
    "title": "Charlie Kirk once changed transgender man's tire after Phoenix rally?",
    "description": "According to the story, Kirk once helped a transgender man who hours earlier had harshly criticized the conservative activist at one of his events.",
    "link": "https://www.snopes.com/news/2025/09/30/charlie-kirk-change-transgender-man-tire/",
    "timestamp": "2025-09-30T22:35:00Z"
  },
  {
    "title": "Trump SBA Delivers Record Capital to Small Businesses in FY25",
    "description": "America First agenda boosts small business optimism and growth America First agenda boosts small business optimism and growth",
    "link": "https://www.globenewswire.com/news-release/2025/09/30/3159126/0/en/Trump-SBA-Delivers-Record-Capital-to-Small-Businesses-in-FY25.html",
    "timestamp": "2025-09-30T22:32:00Z"
  },
  {
    "title": "Trump And Hegseth Shame Troops, Complain About DEI, And Threaten War With The American People",
    "description": "Hegseth launched into a vulgar tirade against service members who don’t fit his specific vision of who should represent the U.S.",
    "link": "https://www.huffpost.com/entry/hegseth-trump-dei-woke-military_n_68dc4252e4b0b11989efe10a",
    "timestamp": "2025-09-30T22:30:55Z"
  },
  {
    "title": "RFK Jr. Rejects UN Declaration on Chronic Diseases; Calls for Focus on Ultra-Processed Foods and Health Freedom",
    "description": "Health Secretary Robert F. Kennedy Jr. announced the U.S. will not comply with the UN's non-communicable disease declaration, calling it an ideological overreach that ignores root causes (like ultra-processed foods) while pushing controversial agendas.",
    "link": "https://www.shtfplan.com/headline-news/rfk-jr-rejects-un-declaration-on-chronic-diseases-calls-for-focus-on-ultra-processed-foods-and-health-freedom",
    "timestamp": "2025-09-30T22:30:48Z"
  },
  {
    "title": "What the Democrats Need to Do Now",
    "description": "From the daily newsletter: our writers imagine what the future of the Party could look like.",
    "link": "https://www.newyorker.com/newsletter/the-daily/what-the-democrats-need-to-do-now",
    "timestamp": "2025-09-30T22:30:00Z"
  },
  {
    "title": "Trump Orders Administration to ‘Leverage AI’ to Cure Childhood Cancer",
    "description": "President Donald Trump signed an executive order Tuesday directing a $50 million investment in using artificial intelligence to cure childhood cancer. “President Trump’s foresight in... Read More\nThe post Trump Orders Administration to ‘Leverage AI’ to Cure C…",
    "link": "https://www.dailysignal.com/2025/09/30/trump-orders-administration-to-leverage-ai-to-cure-childhood-cancer/",
    "timestamp": "2025-09-30T22:30:00Z"
  },
  {
    "title": "Jimmy Kimmel has nothing on Wikipedia when it comes to misinforming people",
    "description": "Wikipedia ruthlessly censors conservative voices — openly — while giving liberal and far left sources a seal of approval.",
    "link": "https://nypost.com/2025/09/30/opinion/jimmy-kimmel-has-nothing-on-wikipedia-when-it-comes-to-misinforming-people/",
    "timestamp": "2025-09-30T22:27:50Z"
  },
  {
    "title": "Ariana Grande draws White House ire for resharing Trump critique",
    "description": "The pop star is the latest addition to Trump’s 2025 celebrity grudge list.",
    "link": "https://www.salon.com/2025/09/30/ariana-grande-draws-white-house-ire-for-resharing-trump-critique/",
    "timestamp": "2025-09-30T22:27:31Z"
  },
  {
    "title": "'Disbelief': Pentagon reporter can't find one military official who liked Hegseth's speech (Sarah K. Burris/Raw Story)",
    "description": "Sarah K. Burris / Raw Story:\n‘Disbelief’: Pentagon reporter can't find one military official who liked Hegseth's speech  —  Longtime Pentagon reporter Helene Cooper said that she can't find any military officials who attended the meeting in Virginia with Pres…",
    "link": "https://www.memeorandum.com/250930/p143",
    "timestamp": "2025-09-30T22:25:00Z"
  },
  {
    "title": "Judge rebukes Kari Lake in court filing alleging blatant contempt in push to cut 500-plus VOA jobs",
    "description": "The Reagan appointee ruled that Lake and her agency have until Oct. 14 to show that their plans to reduce the Voice of America workforce are legal.",
    "link": "https://www.msnbc.com/top-stories/latest/kari-lake-judge-contempt-voice-of-america-job-cuts-rcna234807",
    "timestamp": "2025-09-30T22:24:27Z"
  },
  {
    "title": "Trump's budget chief slapped with suit to block him from using shutdown for mass firings",
    "description": "President Donald Trump's controversial director of the Office of Management and Budget, Russ Vought, is being sued by a group including federal labor unions and the State Democracy Defenders Fund of former White House ethics chief Norm Eisen, to prevent him f…",
    "link": "https://www.rawstory.com/russ-vought-lawsuit/",
    "timestamp": "2025-09-30T22:24:03Z"
  },
  {
    "title": "Democrat Mikie Sherrill Faces Questions over Naval Academy Admissions for Her Two Children",
    "description": "New Jersey Democratic gubernatorial candidate Rep. Mikie Sherrill is facing renewed attention after revelations that two of her children were accepted into the U.S. Naval Academy, days after her campaign was rattled by reports of her involvement in a 1994 che…",
    "link": "https://www.breitbart.com/politics/2025/09/30/democrat-mikie-sherrill-faces-questions-over-naval-academy-admissions-for-her-two-children/",
    "timestamp": "2025-09-30T22:23:05Z"
  },
  {
    "title": "Pope Leo XIV says Hegseth’s talk of war is ‘worrying’",
    "description": "U.S. Secretary of War Pete Hegseth speaks to senior military leaders at Marine Corps Base Quantico on Sept. 30, 2025 in Quantico, Virginia. / Credit: Andrew Harnik/Getty Images\n\nWashington, D.C. Newsroom, Sep 30, 2025 / 18:22 pm (CNA).\nPope Leo XIV on Tuesday…",
    "link": "https://www.catholicnewsagency.com/news/266873/pope-leo-xiv-says-hegseth-s-talk-of-war-is-worrying",
    "timestamp": "2025-09-30T22:22:00Z"
  },
  {
    "title": "Trump says administration close to finalizing federal funding deal with Harvard University",
    "description": "Harvard University may pay $500 million under a deal with President Donald Trump's administration to restore billions in frozen federal funding.",
    "link": "https://www.foxnews.com/politics/trump-administration-close-finalizing-federal-funding-deal-harvard-university",
    "timestamp": "2025-09-30T22:21:58Z"
  },
  {
    "title": "YouTube Will Pay $22 Million To Settle Lawsuit With Trump",
    "description": "YouTube will settle a lawsuit brought by President Donald Trump challenging his suspension from the platform following the Jan.",
    "link": "https://biztoc.com/x/dcc9e303f56bbb24",
    "timestamp": "2025-09-30T22:21:23Z"
  },
  {
    "title": "'Very DANGEROUS time for our country': Fmr. Air Force Secy on Trump's speech to military leaders",
    "description": "President Donald Trump addressed the country's top military officials today during a rare gathering of military leaders in Quantico, ...",
    "link": "https://biztoc.com/x/efd9b518543a5ad9",
    "timestamp": "2025-09-30T22:20:59Z"
  },
  {
    "title": "Oil settles lower as investors brace for possible OPEC+ output hike",
    "description": "HOUSTON (Reuters) -Oil prices settled lower on Tuesday as investors braced for a supply surplus due to potential OPEC+ plans for a larger output hike next...",
    "link": "https://sg.finance.yahoo.com/news/oil-settles-lower-investors-brace-222011619.html",
    "timestamp": "2025-09-30T22:20:11Z"
  },
  {
    "title": "Papers: Barca still open to signing Rashford despite dropping forward for lateness",
    "description": "The top stories and transfer rumours from Wednesday's newspapers...",
    "link": "https://www.skysports.com/football/transfer-paper-talk/12709/13441984/marcus-rashford-remains-barcelona-target-despite-being-dropped-for-getafe-fixture-for-poor-timekeeping-paper-talk",
    "timestamp": "2025-09-30T22:20:00Z"
  },
  {
    "title": "Gallego: Trump Is an 'Idiot,' He Doesn’t Understand How the Military Works",
    "description": "Tuesday on CNN's \"NewsCentral,\" Sen. Ruben Gallego (D-AZ) claimed President Donald Trump was an \"idiot\" who \"doesn’t actually understand how the military works.\"\nThe post Gallego: Trump Is an ‘Idiot,’ He Doesn’t Understand How the Military Works appeared firs…",
    "link": "https://www.breitbart.com/clips/2025/09/30/gallego-trump-is-an-idiot-he-doesnt-understand-how-the-military-works/",
    "timestamp": "2025-09-30T22:19:24Z"
  },
  {
    "title": "U.S. SEC Takes Preliminary Step to Expand Universe of Crypto Custody to State Trusts",
    "description": "Another no-action letter from the agency staff signals the SEC's view that state-chartered trusts are fine for handling digital asset custody.",
    "link": "https://www.coindesk.com/policy/2025/09/30/u-s-sec-takes-preliminary-step-to-expand-universe-of-crypto-custody-to-state-trusts",
    "timestamp": "2025-09-30T22:18:16Z"
  },
  {
    "title": "US agency sues Apple for alleged discrimination against Jewish worker",
    "description": "(Reuters) -The U.S. agency that enforces workplace anti-discrimination laws sued Apple on Tuesday, claiming the manager of a retail store made antisemitic...",
    "link": "https://www.yahoo.com/news/articles/us-agency-sues-apple-alleged-221715869.html",
    "timestamp": "2025-09-30T22:17:15Z"
  },
  {
    "title": "Trump threatens ‘a lot’ of firings as shutdown deadline nears",
    "description": "With just hours to go until deadline, the deadlock threatens to paralyze many U.S. government operations for the first time in nearly seven years,",
    "link": "https://www.japantimes.co.jp/news/2025/10/01/world/politics/trump-firings-shutdown-deadline/",
    "timestamp": "2025-09-30T22:16:00Z"
  },
  {
    "title": "A state of war now exists between the commander in chief and the people of the United States. He'll lose—so help us God.",
    "description": "Today, Donald Trump appeared before America's highest-ranked military officers to ...declare war on the people of the United States.Trump delivers remarks to military leaders at QuanticoNot all its people — not its 69 million rural Americans, just the 273 mil…",
    "link": "https://www.pmcarpenter.com/post/a-state-of-war-now-exists-between-the-commander-in-chief-and-the-people-of-the-united-states-he-ll",
    "timestamp": "2025-09-30T22:15:45Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Prioritizes Harnessing American AI Innovation to Unlock Cures for Pediatric Cancer (The White House)",
    "description": "The White House:\nFact Sheet: President Donald J. Trump Prioritizes Harnessing American AI Innovation to Unlock Cures for Pediatric Cancer  —  HARNESSING AMERICAN AI INNOVATION: Today, President Donald J. Trump signed an Executive Order to harness American AI …",
    "link": "https://www.memeorandum.com/250930/p141",
    "timestamp": "2025-09-30T22:15:00Z"
  },
  {
    "title": "Many Who Weaponized US Intelligence Got Off Scot-Free, Will Comey?",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Many Who Weaponized US Intelligence Got Off Scot-Free, Will Comey? appe…",
    "link": "https://www.dailysignal.com/2025/09/30/many-who-weaponized-us-intelligence-got-off-scot-free-will-comey/",
    "timestamp": "2025-09-30T22:14:14Z"
  },
  {
    "title": "Terrorist posed as hostage to lure IDF soldiers",
    "description": "During an IDF operation in Gaza City, forces spotted a man carrying a white flag and calling for help. This unusual sight raised suspicions that he might be an Israeli hostage, prompting additional forces to be deployed to the area. According to a report by C…",
    "link": "https://freerepublic.com/focus/f-news/4343567/posts",
    "timestamp": "2025-09-30T22:13:29Z"
  },
  {
    "title": "Pritzker compares Trump to Putin, calls for invoking 25th Amendment for suggesting military use Chicago as \"training grounds\"",
    "description": "After President Trump suggested Chicago should be used as \"training grounds for our military,\" Gov Pritzker said the 25th Amendment should be invoked to remove the president from office, saying \"there is something genuinely wrong with this man.\"",
    "link": "https://www.cbsnews.com/chicago/news/jb-pritzker-donald-trump-vladimir-putin-25th-amendment-military-training-grounds/",
    "timestamp": "2025-09-30T22:12:03Z"
  },
  {
    "title": "Trump warns Russia and China are catching up with US on submarines",
    "description": "The president referred to nuclear subs as “the most lethal weapons” ever made Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625665-trump-russia-china-submarines/",
    "timestamp": "2025-09-30T22:10:41Z"
  },
  {
    "title": "Trump Boasts He Has 'Bigger Heart' Than Reporter Who Corrected Him On Immigrant Health Care",
    "description": "Trump blamed Democrats for the possibility of a government shutdown, falsely claiming they want to give \"Cadillac Medicare to illegal immigrants.”",
    "link": "https://www.huffpost.com/entry/trump-bigger-heart-weijia-jiang-immigrant-health_n_68dc40b0e4b0d2dd31585c9d",
    "timestamp": "2025-09-30T22:09:45Z"
  },
  {
    "title": "Ben Gvir sharply criticizes Netanyahu: The agreement endangers Israel’s security",
    "description": "Minister Ben Gvir blasts Trump’s plan at a Cabinet meeting, calling it a threat to Israel’s security and a betrayal of Gaza.",
    "link": "https://www.israelnationalnews.com/news/415655",
    "timestamp": "2025-09-30T22:09:31Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The stock market has typically glided by previous government shutdowns — but this one could be riskier given the slew of economic conditions at play.",
    "link": "https://www.cnbc.com/2025/09/30/stock-market-today-live-updates.html",
    "timestamp": "2025-09-30T22:08:18Z"
  },
  {
    "title": "Jared Kushner is coming for your video games. And he’s not stopping there.",
    "description": "Plus, Scott Bessent’s phone reveals fault lines in MAGA world, Elon Musk shows up in the Epstein files and more — all in this week’s Tuesday Tech Drop.",
    "link": "https://www.msnbc.com/top-stories/latest/jared-kushner-electronic-arts-argentina-tiktok-epstein-rcna234754",
    "timestamp": "2025-09-30T22:06:35Z"
  },
  {
    "title": "Trump's peace plan treated with 'extreme skepticism' abroad: foreign analyst",
    "description": "President Donald Trump's peace plan for the war between Israel and Hamas is being met with \"extreme skepticism\" abroad, a foreign analyst revealed on Tuesday. Jane Kinninmont, CEO at the United Nations Association, discussed Trump's peace plan during an inter…",
    "link": "https://www.rawstory.com/trump-2674141055/",
    "timestamp": "2025-09-30T22:06:04Z"
  },
  {
    "title": "Smithsonian Museums to Remain Open Amid Anticipated Government Shutdown",
    "description": "The Smithsonian Institution said its museums would for now remain open in the event of a government shutdown.",
    "link": "https://www.artnews.com/art-news/news/smithsonian-museums-government-shutdown-1234754965/",
    "timestamp": "2025-09-30T22:05:49Z"
  },
  {
    "title": "Zohran Mamdani blasts Andrew Cuomo for cozying up to billionaire backers for big bucks: ‘New York City deserves better’",
    "description": "Socialist mayoral front-runner Zohran Mamdani on Tuesday lambasted his rival Andrew Cuomo for cozying up to billionaires for cash rather than rubbing elbows with hardscrabble New Yorkers on the campaign trail. Mamdani said Manhattan’s ultra-elite “Billionaire…",
    "link": "https://nypost.com/2025/09/30/us-news/zohran-mamdani-blasts-andrew-cuomo-for-cozying-up-to-billionaire-backers-for-big-bucks/",
    "timestamp": "2025-09-30T22:04:10Z"
  },
  {
    "title": "Arab Countries Say Trump Changed Language In Gaza Plan They Initially Agreed On",
    "description": "As Israel continues to kill dozens of Palestinians every day, Arab officials say the original proposal they worked out has been changed to favor Israel.",
    "link": "https://www.huffpost.com/entry/arab-countries-trump-changed-language-gaza-plan-israel_n_68dc4ca1e4b0f3800bcd0a87",
    "timestamp": "2025-09-30T22:03:38Z"
  },
  {
    "title": "Nike sees stocks surge by 1.5% as revenues jump in Q1",
    "description": "Nike’s first-quarter revenue surprised with a small rise, and the company beat profit estimates. Shares went up by 1.5% as CEO Elliott Hill’s changes show results. The company is working to reduce inventories and focus on core sports. New products like the wo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nike-sees-stocks-surge-by-1-5-as-revenues-jump-in-q1/articleshow/124244794.cms",
    "timestamp": "2025-09-30T22:02:11Z"
  },
  {
    "title": "Trump’s ‘One Big Beautiful Bill’ could see Massachusetts lose $650M in tax revenue",
    "description": "Massachusetts could lose out on $650 million in state revenue because of the tax breaks and spending cuts bill President Donald Trump signed over the summer, a massive budget shocker that could leave Beacon Hill Democrats scrambling to plug holes.",
    "link": "https://www.bostonherald.com/2025/09/30/trumps-one-big-beautiful-bill-could-see-massachusetts-lose-650m-in-tax-revenue/",
    "timestamp": "2025-09-30T22:01:35Z"
  },
  {
    "title": "Eric Trump: President Trump’s Presidential Library to Be Located in Miami Next to Iconic Freedom Tower",
    "description": "Eric Trump, president of the Trump presidential library foundation, announced on Tuesday the presidential library of his father President Donald J.\nThe post Eric Trump: President Trump’s Presidential Library to Be Located in Miami Next to Iconic Freedom Tower…",
    "link": "https://www.thegatewaypundit.com/2025/09/eric-trump-president-trumps-presidential-library-be-located/",
    "timestamp": "2025-09-30T22:00:23Z"
  },
  {
    "title": "Fox News Poll: Democrat Sherrill leads New Jersey governor’s race",
    "description": "Fox News poll shows Democrat Mikie Sherrill leading Republican Jack Ciattarelli by 8 points in New Jersey's gubernatorial race to replace term-limited Gov. Phil Murphy.",
    "link": "https://www.foxnews.com/politics/fox-news-poll-democrat-sherrill-leads-new-jersey-governors-race",
    "timestamp": "2025-09-30T22:00:02Z"
  },
  {
    "title": "I went undercover as a cleaner at a failing care home. Here's what I witnessed",
    "description": "Catriona MacPhee worked in a Highland care home for seven weeks as part of BBC Disclosure investigation.",
    "link": "https://www.bbc.com/news/articles/c4g78yj2v2go",
    "timestamp": "2025-09-30T21:57:46Z"
  },
  {
    "title": "Don Lemon Tells Dan Abrams That Pete Hegseth is a ‘DEI Hire’: ‘Not Qualified For That Position’",
    "description": "Don Lemon finds it ironic Secretary of War Pete Hegseth is dismantling DEI programs within the military, considering Hegseth himself is a \"DEI hire,\" he said\nThe post Don Lemon Tells Dan Abrams That Pete Hegseth is a ‘DEI Hire’: ‘Not Qualified For That Positi…",
    "link": "https://www.mediaite.com/media/don-lemon-tells-dan-abrams-that-pete-hegseth-is-a-dei-hire-not-qualified-for-that-position/",
    "timestamp": "2025-09-30T21:57:29Z"
  }
]