[
  {
    "title": "America First Deepens World Stagnation",
    "description": "Quelle surprise! America First is another leg down in the developing-country-unfriendly policies the Collective West has pursued.",
    "link": "https://www.nakedcapitalism.com/2025/02/america-first-deepens-world-stagnation.html",
    "timestamp": "2025-02-25T14:55:52Z"
  },
  {
    "title": "Trump's \"Favorite Dictator\" Sends Warning over his Gaza Plan",
    "description": "Egypt's president pushed back strongly against Donald Trump's proposal for the removal of Palestinians from the Gaza Strip.",
    "link": "https://www.newsweek.com/gaza-israel-donald-trump-war-egypt-palestinians-hamas-sisi-2035815",
    "timestamp": "2025-02-25T14:55:44Z"
  },
  {
    "title": "Russian State TV Host Jokes About Trump's Growing Rift With Europe",
    "description": "Vladimir Solovyov joked about which side Russia would choose in a potential \"war for Greenland\" as tensions between the U.S. and Europe increase.",
    "link": "https://www.newsweek.com/russian-state-tv-host-jokes-about-trump-growing-rift-europe-2035857",
    "timestamp": "2025-02-25T14:55:17Z"
  },
  {
    "title": "VCU Health resuming some gender-affirming care for trans youths under 19",
    "description": "The UVa Health System previously said it is resuming gender-affirming care for transgender youths after a federal judge issued a temporary restraining order that pauses a directive from President Donald Trump.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_c724b77a-f384-11ef-a689-978860a943c6.html",
    "timestamp": "2025-02-25T14:55:00Z"
  },
  {
    "title": "Net worth of Vivek Ramaswamy: Roviant Sciences founder who is running for Ohio governor",
    "description": "Vivek Ramaswamy, an American entrepreneur and politician of Indian origin, has announced his candidacy for Ohio Governor in the 2026 Republican primary. With endorsements from Donald Trump and Elon Musk, Ramaswamy’s campaign builds momentum. His net worth sur…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/net-worth-of-vivek-ramaswamy-roviant-sciences-founder-who-is-running-for-ohio-governor/articleshow/118561760.cms",
    "timestamp": "2025-02-25T14:53:03Z"
  },
  {
    "title": "Tiffany Cross Calls on Black People to Dump MSNBC on Joy Reid Zoom Call: ‘Don’t Even Hate-Watch!’",
    "description": "Tiffany Cross ripped her ex-employer for firing Joy Reid, calling on Black people to dump the network and roasting hosts who \"bent the knee\" to Trump.\nThe post Tiffany Cross Calls on Black People to Dump MSNBC on Joy Reid Zoom Call: ‘Don’t Even Hate-Watch!’ f…",
    "link": "https://www.mediaite.com/news/tiffany-cross-calls-on-black-people-to-dump-msnbc-on-joy-reid-zoom-call-dont-even-hate-watch/",
    "timestamp": "2025-02-25T14:53:03Z"
  },
  {
    "title": "Woman claims she was passed over for promotion because she isn’t gay",
    "description": "The US Supreme Court is set to hear arguments in a straight woman’s ‘reverse discrimination’ civil rights lawsuit after she claimed she was passed over for promotion and demoted in favour of gay colleagues who she says were less qualified than her. Marlean Am…",
    "link": "https://www.thepinknews.com/2025/02/25/marlean-ames-supreme-court-discrimination/",
    "timestamp": "2025-02-25T14:52:09Z"
  },
  {
    "title": "South Korea's Yoon unapologetic for martial law decision",
    "description": "Facing South Korea's Constitutional Court, Yoon Suk Yeol said his decision was needed to protect the country. This was the final day of hearings that could formally remove Yoon from office.",
    "link": "https://www.dw.com/en/south-koreas-yoon-unapologetic-for-martial-law-decision/a-71737075",
    "timestamp": "2025-02-25T14:52:00Z"
  },
  {
    "title": "Land reform in South Africa doesn’t need a new law: the state should release property it owns – economists",
    "description": "South Africa’s land reform minister should be distributing land owned by the government to black farmers rather than fussing about new laws.",
    "link": "https://theconversation.com/land-reform-in-south-africa-doesnt-need-a-new-law-the-state-should-release-property-it-owns-economists-250674",
    "timestamp": "2025-02-25T14:50:46Z"
  },
  {
    "title": "'Jarring': Analyst claims voter rage is giving Republicans shocking reality check",
    "description": "Republican lawmakers are finding themselves at a disadvantage when they venture out of the right-wing media bubbles in which they and their hardcore supporters exist, according to a Washington Post columnist.Rep. Glenn Grothman (R-WI) faced boos after returni…",
    "link": "https://www.rawstory.com/right-wing-media-bubble/",
    "timestamp": "2025-02-25T14:50:02Z"
  },
  {
    "title": "Serbian police raid offices of watchdogs, seek evidence on USAID donations",
    "description": "BELGRADE (Reuters) - Serbian police raided the offices of two Belgrade-based democracy watchdogs, seeking information about possible abuse of funds donated by the U.S. international aid agency (USAID), Nenad Stefanovic, a senior state prosecutor, said on Tues…",
    "link": "https://www.thestar.com.my/news/world/2025/02/25/serbian-police-raid-offices-of-watchdogs-seek-evidence-on-usaid-donations",
    "timestamp": "2025-02-25T14:50:00Z"
  },
  {
    "title": "‘You Have to Suck Up to Putin?’ Fox News’ Bill Hemmer Grills GOP Senator About Trump’s Concessions to Russia",
    "description": "Fox News' Bill Hemmer grilled Senator Bill Hagerty (R-TN) about President Donald Trump's position on the war between Russia and Ukraine on Tuesday.\nThe post ‘You Have to Suck Up to Putin?’ Fox News’ Bill Hemmer Grills GOP Senator About Trump’s Concessions to …",
    "link": "https://www.mediaite.com/tv/you-have-to-suck-up-to-putin-fox-news-bill-hemmer-grills-gop-senator-about-trumps-concessions-to-russia/",
    "timestamp": "2025-02-25T14:49:23Z"
  },
  {
    "title": "France’s Macron fact-checks Trump in real time on claim about Ukraine",
    "description": "The American president tried to peddle a brazen falsehood about European aid to Ukraine. France's Emmanuel Macron soon after embarrassed Trump with the truth.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/frances-macron-fact-checks-trump-real-time-claim-ukraine-rcna193624",
    "timestamp": "2025-02-25T14:48:46Z"
  },
  {
    "title": "The Presidential Power Grab That Should Terrify Every American | Opinion",
    "description": "On Feb. 18, the Trump administration issued an executive order that would strip independence from agencies Congress designed to operate free from presidential control.",
    "link": "https://www.newsweek.com/presidential-power-grab-that-should-terrify-every-american-opinion-2035897",
    "timestamp": "2025-02-25T14:48:09Z"
  },
  {
    "title": "Mandate to DOGE",
    "description": "Plus: Romanian democracy, FEMA's insane policies, Maher on trans kids, and more...",
    "link": "https://reason.com/2025/02/25/mandate-to-doge/",
    "timestamp": "2025-02-25T14:46:34Z"
  },
  {
    "title": "GMU’s Scalia law school removes DEI pages, prompting student petition",
    "description": "George Mason University's law school has removed webpages related to diversity, equity and inclusion, sparking student criticism and casting doubt on the future of related programs. Pages related to Antonin Scalia Law School's DEI Task Force, DEI Advisory Boa…",
    "link": "https://www.arlnow.com/2025/02/25/gmus-scalia-law-school-removes-dei-pages-prompting-student-petition/",
    "timestamp": "2025-02-25T14:45:47Z"
  },
  {
    "title": "NO COLOR REVOLUTION IN BUDAPEST: Hungarian PM Orbán Is Drafting Legislation To Protect National Sovereignty and Target Foreign Funding to Liberal-Globalist Media",
    "description": "Hungarian Prime Minister Viktor Orbán raises alarms about the resurgence of globalist NGOs in Europe, warning against their attempts to secure funding under the guise of human rights initiatives. His bold stance echoes a larger geopolitical struggle.\nThe post…",
    "link": "https://www.thegatewaypundit.com/2025/02/no-color-revolution-budapest-hungarian-pm-orban-is/",
    "timestamp": "2025-02-25T14:45:17Z"
  },
  {
    "title": "Tesla European car sales plummet 45% YoY: Is Elon Musk’s support for Donald Trump backfiring?",
    "description": "Amid Elon Musk's growing involvement in European political affairs, his company Tesla has experienced a significant decline in sales across the continent, selling just 9,945 vehicles in January 2025, a 45% drop compared to the same period last year, when it s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tesla-european-car-sales-plummet-45-yoy-is-elon-musks-support-for-donald-trump-backfiring/articleshow/118561808.cms",
    "timestamp": "2025-02-25T14:45:09Z"
  },
  {
    "title": "British PM pledges to lift defence spending",
    "description": "<p>LONDON - British Prime Minister Keir Starmer pledged on Tuesday to increase defence spending to 2.5% of the economy by 2027, as uncertainty reigns over US President Donald Trump&rsquo;s commitment to European security.</p>",
    "link": "https://www.bangkokpost.com/world/2967895/british-pm-pledges-to-lift-defence-spending",
    "timestamp": "2025-02-25T14:45:00Z"
  },
  {
    "title": "UK pledges to boost defense spending ahead of US visit",
    "description": "British Prime Minister Keir Starmer on Tuesday pledged to boost defense spending to 2.5 percent of the economy by 2027 with the aim of hiking it to 3 percent in the next parliament.",
    "link": "https://www.hurriyetdailynews.com/uk-pledges-to-boost-defense-spending-ahead-of-us-visit-206253",
    "timestamp": "2025-02-25T14:44:59Z"
  },
  {
    "title": "Trump’s Ukraine resources demand is ‘extortionate’ – Johnson",
    "description": "The US is preying on Ukraine just as it did on Britain during World War II, Boris Johnson has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613291-jonson/",
    "timestamp": "2025-02-25T14:42:58Z"
  },
  {
    "title": "EU sanctioned the leader of North Korea-linked APT groups",
    "description": "The European Union sanctioned the leader of North Korea-linked APT groups for aiding Russia in its war against Ukraine. The European Union announced sanctions against entities aiding Russia in the ongoing conflict with Ukraine, including Lee Chang Ho, who is …",
    "link": "https://securityaffairs.com/174622/security/eu-sanctioned-the-leader-of-north-korea-linked-apt-groups.html",
    "timestamp": "2025-02-25T14:42:46Z"
  },
  {
    "title": "Ex-Top Adviser Has Dire Warning About Trump’s Mental State",
    "description": "Former national security adviser John Bolton thinks that Donald Trump’s mind is deteriorating, based on some of his recent comments.\r\nCNN’s Kaitlan Collins asked Bolton in an interview Monday night whether Trump actually thinks Russian President Vladimir Puti…",
    "link": "https://newrepublic.com/post/191922/donald-trump-john-bolton-mental-state-vladimir-putin",
    "timestamp": "2025-02-25T14:42:29Z"
  },
  {
    "title": "The Old Republican Idea at the Center of Vivek Ramaswamy’s Run for Governor of Ohio",
    "description": "On Monday afternoon, former Republican presidential candidate, short-lived adviser to President Donald Trump’s plans to slash government spending, and one-time “libertarian-minded rap artist” Vivek Ramaswamy announced his bid for Ohio governor. In his effort,…",
    "link": "https://www.motherjones.com/politics/2025/02/vivek-ramaswamys-governor-ohio-doge-austerity-budget-cuts-musk/",
    "timestamp": "2025-02-25T14:42:08Z"
  },
  {
    "title": "Who Is David Cherry? Man Accused of Threatening to 'Gut' Elon Musk",
    "description": "Musk has expressed concern about a possible assassination attempt.",
    "link": "https://www.newsweek.com/elon-musk-texts-donald-trump-ashley-st-clair-threats-assassination-indiana-man-cherry-tesla-spacex-2035848",
    "timestamp": "2025-02-25T14:40:30Z"
  },
  {
    "title": "UK to raise defense spending to 2.5% of GDP by 2027, Starmer says 2 days before Trump meeting",
    "description": "The announcement comes as European countries scramble to bolster their collective defense.",
    "link": "https://www.bostonherald.com/2025/02/25/britain-defense-spending-pledge/",
    "timestamp": "2025-02-25T14:40:10Z"
  },
  {
    "title": "UK to boost defence spending to 2.5% of GDP by 2027, aiming for 3% in the long run – Cuts to foreign aid to fund military expansion",
    "description": "UK defence spending is set to rise to 2.5% of GDP by 2027, with a long-term goal of 3%, as announced by Prime Minister Keir Starmer. To fund this increase, the government will cut the foreign aid budget from 0.5% to 0.3% of GDP. This move aligns with NATO com…",
    "link": "https://economictimes.indiatimes.com/news/international/uk/uk-to-boost-defence-spending-to-2-5-of-gdp-by-2027-aiming-for-3-in-the-long-run-cuts-to-foreign-aid-to-fund-military-expansion/articleshow/118561732.cms",
    "timestamp": "2025-02-25T14:40:09Z"
  },
  {
    "title": "Apple says it will spend $500B+ in the US over the next four years, hire 20,000 US workers, and produce AI servers in Texas, after Tim Cook met with Trump",
    "description": "Apple to add 20,000 US jobs, spend hundreds of billions at home amid Trump tariffs\nThe company, which builds most iPhones and other products in China, says it plans to spend US$500 billion in the US over the next four years\nApple, as it seeks relief from US P…",
    "link": "https://biztoc.com/x/70dba9aea5c8ca2d",
    "timestamp": "2025-02-25T14:39:24Z"
  },
  {
    "title": "Sudanese Activists Are Fighting US and UAE Complicity in Sudan’s Genocide",
    "description": "The US acknowledged Sudan’s genocide in January but continues to send arms to the UAE, one of the war's main drivers.",
    "link": "https://truthout.org/articles/sudanese-activists-are-fighting-us-and-uae-complicity-in-sudans-genocide/",
    "timestamp": "2025-02-25T14:38:48Z"
  },
  {
    "title": "Trump Administration Terminates Key Health Advisory Committees, Threatening Health Equity",
    "description": "President Trump commanded the HHS to terminated key health advisory committees.  Here's how that affects public health.",
    "link": "https://www.forbes.com/sites/omerawan/2025/02/25/trump-administration-terminates-key-health-advisory-committees-threatening-health-equity/",
    "timestamp": "2025-02-25T14:38:25Z"
  },
  {
    "title": "Ron DeSantis Launches DOGE Task Force for Florida",
    "description": "The Florida governor aims to reduce \"bloat\" in state spending in a similar vein to Donald Trump and Elon Musk's federal initiative.",
    "link": "https://www.newsweek.com/ron-desantis-doge-task-force-florida-cuts-spending-2035845",
    "timestamp": "2025-02-25T14:37:56Z"
  },
  {
    "title": "Ukrainian parliament affirms Zelenskyy’s legitimacy",
    "description": "The 268 parliament members present on Tuesday voted unanimously in support of the Ukrainian president.",
    "link": "https://www.aljazeera.com/news/2025/2/25/ukrainian-parliament-affirms-zelenskyys-legitimacy",
    "timestamp": "2025-02-25T14:36:52Z"
  },
  {
    "title": "Exclusive -- Vivek Ramaswamy: Ohio Can ‘Be the State that Leads the Country’ in Trump’s Economic Revolution",
    "description": "WASHINGTON — Businessman Vivek Ramaswamy, who just launched his run for governor of Ohio in next year’s election, spoke exclusively with Breitbart News on Monday evening after his campaign launch to argue Ohio can lead the nation in an economic and education …",
    "link": "https://www.breitbart.com/politics/2025/02/25/exclusive-vivek-ramaswamy-ohio-can-be-the-state-that-leads-the-country-in-trumps-economic-revolution/",
    "timestamp": "2025-02-25T14:36:52Z"
  },
  {
    "title": "James Carville calls for Democrats to make 'strategic political retreat'",
    "description": "Democratic strategist James Carville suggested in an New York Times guest essay that members of his party make a \"strategic political retreat\" in response to Republicans.",
    "link": "https://www.foxnews.com/media/james-carville-calls-democrats-make-strategic-political-retreat",
    "timestamp": "2025-02-25T14:35:30Z"
  },
  {
    "title": "How the US spends taxpayer money as Musk-led DOGE seeks cuts",
    "description": "Raising taxes could help reduce deficit, but Trump's tax cut pledge will make Musk's aim to slash $1 trillion difficult.",
    "link": "https://www.aljazeera.com/news/2025/2/25/how-the-us-spends-taxpayer-money-as-musk-led-doge-seeks-cuts",
    "timestamp": "2025-02-25T14:33:51Z"
  },
  {
    "title": "Trump says tariffs on Canada and Mexico are ‘on time’ with more import taxes to come",
    "description": "Trump has claimed that other countries charge unfair import taxes that have come at the expense of domestic manufacturing and jobs.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-tariffs-on-canada-and-mexico-are-on-time-with-more-import-taxes-to-come",
    "timestamp": "2025-02-25T14:33:19Z"
  },
  {
    "title": "How Merz is planning to boost German defence spending",
    "description": "Germany's next leader, conservative Friedrich Merz, has raised the alarm over European defence but the clock is ticking for him to muster the funds needed to refurbish the armed forces.",
    "link": "https://www.thelocal.de/20250225/how-merz-is-planning-to-boost-german-defence-spending",
    "timestamp": "2025-02-25T14:32:57Z"
  },
  {
    "title": "UK to boost defence spending to Cold War levels amid Russian 'menace'",
    "description": "British Prime Minister Sir Keir Starmer says the spending boost, worth $26 billion, was designed to counter Russian aggression, amid uncertainty in Europe about the US' commitment to their defence.",
    "link": "https://www.abc.net.au/news/2025-02-26/uk-to-boost-military-spending/104982430",
    "timestamp": "2025-02-25T14:32:52Z"
  },
  {
    "title": "Stock market today: Stocks waver, bitcoin tumbles below $90,000 for first time since November",
    "description": "Tech stocks are poised for more losses as uncertainty over tariffs and risks to Nvidia take hold.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-stocks-waver-bitcoin-tumbles-below-90000-for-first-time-since-november-143122111.html",
    "timestamp": "2025-02-25T14:31:22Z"
  },
  {
    "title": "Fintech’s Gender Gap: Why Progress Isn’t Moving Fast Enough",
    "description": "The fintech industry, like traditional finance, remains stubbornly male-dominated—despite hard data showing companies with more women leaders are more profitable.",
    "link": "https://observer.com/2025/02/fintechs-gender-gap-why-progress-isnt-moving-fast-enough/",
    "timestamp": "2025-02-25T14:30:46Z"
  },
  {
    "title": "Crypto Bloodbath In 2025? CEO Says Most Altcoins Will Vanish",
    "description": "The crypto sector is undergoing a fundamental transition that may revolutionize investment methods by 2025. Related Reading: Bitcoin ETF Frenzy: Research Finds Most Investors Aren’t Sticking Around “It’s a selective altseason—most altcoins will not make it,” …",
    "link": "https://bitcoinist.com/crypto-bloodbath-in-2025-ceo-says-most-altcoins-will-vanish/",
    "timestamp": "2025-02-25T14:30:15Z"
  },
  {
    "title": "Bahrain F1 testing 2025: Lewis Hamilton’s Ferrari debut and rookie watch — What to expect as teams prepare for the new season",
    "description": "The 2025 Formula 1 winter testing in Bahrain begins with rookies making their debuts and Lewis Hamilton driving a Ferrari for the first time. Teams will fine-tune their cars ahead of the season opener in Melbourne, while fans analyse early performance indicat…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bahrain-f1-testing-2025-lewis-hamiltons-ferrari-debut-and-rookie-watch-what-to-expect-as-teams-prepare-for-the-new-season/articleshow/118561534.cms",
    "timestamp": "2025-02-25T14:30:10Z"
  },
  {
    "title": "How China’s ‘Ne Zha 2’ Beat ‘Inside Out 2’ to Become the Highest-Grossing Animated Film in History",
    "description": "This year’s biggest blockbuster (so far) isn’t from Marvel, Pixar or James Cameron. In fact, most Americans aren’t even familiar with the box office juggernaut — because it’s barely playing in North America. “Ne Zha 2,” a Chinese animated movie, has become an…",
    "link": "https://variety.com/2025/film/box-office/ne-zha-2-biggest-animated-movie-box-office-china-1236318940/",
    "timestamp": "2025-02-25T14:30:00Z"
  },
  {
    "title": "This Refinery Wants to Make Sustainable Aviation Fuel Mainstream. Trump’s Cuts Could Kill It",
    "description": "A sprawling Minnesota refinery wants to make low-carbon aviation fuel mainstream—but without government support experts believe the project could be \"dead in the water.\"",
    "link": "https://www.wired.com/story/refinery-saf-sustainable-fuel-rollout-problem/",
    "timestamp": "2025-02-25T14:30:00Z"
  },
  {
    "title": "Oil Prices Under Pressure Despite Fresh Sanctions on Iran",
    "description": "Oil prices were under pressure early on Tuesday morning despite the Trump administration announcing fresh sanctions on Iran's oil industry on Monday.- President Trump’s recent push for a deal between Russia and Ukraine, his foot-dragging over Canadian and Mex…",
    "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Under-Pressure-Despite-Fresh-Sanctions-on-Iran.html",
    "timestamp": "2025-02-25T14:30:00Z"
  },
  {
    "title": "Trump Accidentally Insults Himself: ‘Who Would Ever Sign A Thing Like This?’",
    "description": "The president recently rebuked a 2020 trade deal known as the U.S.-Mexico-Canada Agreement even though he signed it.",
    "link": "https://www.huffpost.com/entry/trump-usmca-nafta-tariffs-canada-mexico_n_67bda523e4b0f4e8df29f534",
    "timestamp": "2025-02-25T14:29:55Z"
  },
  {
    "title": "Donald Trump Accidentally Insults Himself: ‘Who Would Ever Sign A Thing Like This?’",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_24067e6e-2dc1-413b-9791-28954ff9743c",
    "timestamp": "2025-02-25T14:29:55Z"
  },
  {
    "title": "Google has mislabeled Canada's provincial parks as 'state' parks for years",
    "description": "Canadians have taken to social media wondering why Google Maps was referring to some provincial parks as \"state\" parks, an incorrect designation that has ruffled feathers at a time of heightened tension between Canada and the United States.",
    "link": "https://www.nationalobserver.com/2025/02/25/news/google-mislabeled-canada-provincial-parks-state",
    "timestamp": "2025-02-25T14:28:57Z"
  },
  {
    "title": "What minerals does Ukraine have – and why does Donald Trump want them?",
    "description": "Donald Trump is ramping up pressure on his Ukrainian counterpart to sign away up to 50% of its mineral supplies.",
    "link": "https://news.sky.com/story/what-minerals-does-ukraine-have-and-why-does-donald-trump-want-them-13316629",
    "timestamp": "2025-02-25T14:26:00Z"
  },
  {
    "title": "Gaza ceasefire: As clock ticks down, Israel prepares for more war",
    "description": "The Gaza ceasefire looks increasingly like it may end up being a fleeting interlude.",
    "link": "https://www.cnn.com/2025/02/25/middleeast/israel-hamas-gaza-ceasefire-intl/index.html",
    "timestamp": "2025-02-25T14:26:00Z"
  },
  {
    "title": "Republicans Are Starting a War Over Medicaid Cuts",
    "description": "Republicans are starting a war over Medicaid cuts in the GOP budget plan. Trump and Mike Johnson may talk about reducing waste, fraud, and abuse in the essential health care program for poor folks, but people know cuts when they see them.",
    "link": "http://nymag.com/intelligencer/article/republicans-medicaid-cuts-budget.html",
    "timestamp": "2025-02-25T14:25:43Z"
  },
  {
    "title": "'Really concerning': Massive bruise spotted on Trump's right hand, sparks frenzied speculation online",
    "description": "US President Donald Trump and French President Emmanuel Macron met in the Oval Office on Monday, drawing the public's attention to their awkward greeting. What caught netizens' attention was a massive and mysterious bruise on Trump's right hand which sparked …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-macron-meeting-really-concerning-massive-bruise-spotted-on-donald-trumps-right-hand-sparks-health-fears/articleshow/118561304.cms",
    "timestamp": "2025-02-25T14:25:06Z"
  },
  {
    "title": "SCOOP: FCC to brief lawmakers on George Soros investigation in closed-door meeting",
    "description": "The House of Representatives' Republican Study Committee is hosting FCC Chair Brendan Carr at its weekly lunch, Fox News Digital has learned.",
    "link": "https://www.foxnews.com/politics/scoop-fcc-brief-lawmakers-george-soros-investigation-closed-door-meeting",
    "timestamp": "2025-02-25T14:24:23Z"
  },
  {
    "title": "The Trump Presidency Is an Unmitigated Catastrophe for Ukraine",
    "description": "Kyiv is by far the best-defended Ukrainian city. The cafes are open and bustling, the supermarkets full, and cultural life is, if anything, more active than it was before Russia’s full-scale invasion of Ukraine on February 24, 2002, so much so that a signific…",
    "link": "https://newrepublic.com/article/191870/trump-presidency-catastrophe-ukraine",
    "timestamp": "2025-02-25T14:23:12Z"
  },
  {
    "title": "POLITICO: Trump allies circulate mass deportation plan calling for ‘processing camps’ and a private citizen ‘army’",
    "description": "A group of prominent military contractors, including former Blackwater CEO Erik Prince, has pitched the Trump White House on a proposal to carry out mass deportations through a network of “processing camps” on military bases, a private fleet of 100 planes, an…",
    "link": "https://freerepublic.com/focus/f-chat/4300325/posts",
    "timestamp": "2025-02-25T14:23:09Z"
  },
  {
    "title": "Elon Musk’s DOGE email to federal workers sparks backlash even as Donald Trump applauds it",
    "description": "US President Donald Trump defended Elon Musk’s recent actions, portraying them as an attempt to expose fraud and inefficiency in government operations. He praised an email sent to federal employees, calling it a strategic move. Meanwhile, a federal worker cri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-doge-email-to-federal-workers-sparks-backlash-even-as-donald-trump-applauds-it/articleshow/118561346.cms",
    "timestamp": "2025-02-25T14:23:00Z"
  },
  {
    "title": "Arizona plane collision raises questions about air traffic control towers. Here’s what to know",
    "description": "Of the 5,100 public airports across the United States, only about 10% have control towers staffed by people who direct the flow of traffic. \n\nTens of thousands of planes take off, land, and perform touch-and-goes at the Marana Regional Airport in southern Ari…",
    "link": "https://www.fastcompany.com/91284443/arizona-plane-collision-raises-questions-about-air-traffic-control-towers-heres-what-know",
    "timestamp": "2025-02-25T14:20:41Z"
  },
  {
    "title": "Trump: Ukraine's Zelenskiy May Visit Washington for Minerals Deal",
    "description": "President Donald Trump says the US is very close to reaching a deal with Ukraine over its natural resources. “Looks like we are getting close to a deal where we get our money back over time,” President Trump said during a meeting with French President Emmanue…",
    "link": "https://biztoc.com/x/2bf9258c6d249c21",
    "timestamp": "2025-02-25T14:17:11Z"
  },
  {
    "title": "complete list of Trump’s actions in his fifth week in office",
    "description": "President Donald Trump speaks during the signing of executive orders at his Mar-a-Lago resort in Palm Beach, Fla., on Feb. 18, 2025.",
    "link": "https://biztoc.com/x/af7f4deb739c40ab",
    "timestamp": "2025-02-25T14:16:49Z"
  },
  {
    "title": "Medicaid Cuts Threaten A Key House Vote On Trump’s Agenda Today—Here’s Why The GOP Is Divided",
    "description": "Trump has endorsed the House budget, but has also vowed that his administration would leave Medicaid intact.",
    "link": "https://www.forbes.com/sites/saradorn/2025/02/25/medicaid-cuts-threaten-a-key-house-vote-on-trumps-agenda-today-heres-why-the-gop-is-divided/",
    "timestamp": "2025-02-25T14:16:23Z"
  },
  {
    "title": "EXCLUSIVE… Enrique Tarrio Interview: The Only Evidence DOJ Had Against Proud Boys Was a Document They Knew Was Written by the FBI! – They Sentenced Them to 20 Years Anyway!",
    "description": "In an exclusive interview, former Proud Boys leader Enrique Tarrio reveals shocking allegations of FBI manipulation in the January 6 narrative—claiming the agency authored key evidence against him. This compelling testimony raises critical questions about gov…",
    "link": "https://www.thegatewaypundit.com/2025/02/exclusive-enrique-tarrio-interview-only-evidence-doj-had/",
    "timestamp": "2025-02-25T14:15:59Z"
  },
  {
    "title": "\"Slavery produced a genuine affection between the races\": Hegseth's church foretold \"DEI\" firings - NewsBreak",
    "description": "Donald Trump's administration is barely bothering to pretend that the firings at the Department of Defense are about anything but bigotry. On Friday, Trump",
    "link": "https://www.newsbreak.com/share/3828494519031-slavery-produced-a-genuine-affection-between-the-races-hegseth-s-church-foretold-dei-firings?_f=app_share&amp;pd=0DUd10BK&amp;lang=en_US&amp;send_time=1740492749&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v8&amp;s=i2",
    "timestamp": "2025-02-25T14:13:58Z"
  },
  {
    "title": "Trapped in Gaza: Residents speak out as Egypt blocks exit, rejects Trump’s relocation plan",
    "description": "Gazans trapped by closed borders voice frustration, with some supporting Trump’s relocation plan as Egypt blocks exits and Hamas clings to control amid devastation.",
    "link": "https://www.foxnews.com/world/trapped-gaza-residents-speak-out-egypt-blocks-exit-rejects-trumps-relocation-plan",
    "timestamp": "2025-02-25T14:12:13Z"
  },
  {
    "title": "Ash Sarkar: ‘Left-wingers on Twitter aren’t sane, I include myself in that’",
    "description": "Ash Sarkar discusses her new book Minority Rule, a wide-ranging polemic which analyses the function of ‘the culture war’ and why conservatives are winning it",
    "link": "https://www.dazeddigital.com/life-culture/article/66200/1/ash-sarkar-interview-minority-rule-book-review?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=ash-sarkar-left-wingers-on-twitter-aren-t-sane-i-include-myself-in-that",
    "timestamp": "2025-02-25T14:10:00Z"
  },
  {
    "title": "Savannah Chrisley Says Her Conservative Beliefs Have Cost Her",
    "description": "Savannah Chrisley Says Her Conservative Beliefs Have Cost Herlittlethings.com",
    "link": "https://littlethings.com/entertainment/savannah-chrisley-lost-deals-vocal-trump-supporter",
    "timestamp": "2025-02-25T14:08:14Z"
  },
  {
    "title": "Manitoba's craft brewers hazy and a little bitter over U.S. tariff threats and potential impacts",
    "description": "The U.S. tariff threat on aluminum is brewing up concerns for some Manitoba craft beer makers, who say a small increase in can prices could make a big impact on already-slim profit margins.",
    "link": "https://www.cbc.ca/news/canada/manitoba/craft-brewers-manitoba-aluminum-tariffs-1.7466794",
    "timestamp": "2025-02-25T14:07:43Z"
  },
  {
    "title": "British PM Starmer pledges 2.5% GDP defence spending from 2027",
    "description": "\"This government will begin the biggest sustained increase in defence spending since the end of the Cold War,\" Starmer told parliament on Tuesday.",
    "link": "https://www.euractiv.com/section/politics/news/british-pm-starmer-pledges-2-5-gdp-defence-spending-from-2027/",
    "timestamp": "2025-02-25T14:07:17Z"
  },
  {
    "title": "British PM Starmer pledges 2.5% GDP defence spending by 2027",
    "description": "\"This government will begin the biggest sustained increase in defence spending since the end of the Cold War,\" Starmer told parliament on Tuesday.",
    "link": "https://www.euractiv.com/section/politics/news/british-pm-starmer-pledges-2-5-gdp-defence-spending-by-2027/",
    "timestamp": "2025-02-25T14:07:17Z"
  },
  {
    "title": "You can still claim up to $2,000 per kid from the child tax credit, but that amount may drop after 2025—here's what to know",
    "description": "Many parents with children under age 17 can claim the child tax credit worth up to $2,000 per child for tax year 2024. But that could change after 2025, affecting returns filed in 2027.\nThat's because the 2017 Tax Cuts and Jobs Act enacted by President Donald…",
    "link": "https://biztoc.com/x/c49a00760d5e0793",
    "timestamp": "2025-02-25T14:05:59Z"
  },
  {
    "title": "FACT CHECK: Has Elon Musk Mandated Drug Testing For Federal Employees?",
    "description": "A viral post shared on Threads claims Tesla CEO and Department of Government Efficiency (DOGE) lead Elon Musk has purportedly mandated drug testing for federal employees.   View on Threads   Verdict: False The claim is not referenced on Musk’s verified X acco…",
    "link": "https://checkyourfact.com/2025/02/25/fact-check-musk-drug-testing-federal-employees/",
    "timestamp": "2025-02-25T14:04:58Z"
  },
  {
    "title": "Elon Musk Issues Ominous Warning After DOGE Productivity Email Pulled Back, Gives Employees ‘Another Chance’ to Answer",
    "description": "Elon Musk has conceded that federal employees who failed to reply to his cross-agency productivity audit email issued Saturday were given “another chance” at President Donald Trump’s “discretion” — but warned that next time, ignoring the email would result in…",
    "link": "https://www.mediaite.com/news/elon-musk-issues-ominous-warning-after-doge-productivity-email-pulled-back-gives-employees-another-chance-to-answer/",
    "timestamp": "2025-02-25T14:04:38Z"
  },
  {
    "title": "Landmark moment as the return of Trump stuns UK into action on defence",
    "description": "This is the moment the government finally woke up to the enormity of the threat faced by the UK and the inability of its hollowed-out armed forces to cope.",
    "link": "https://news.sky.com/story/landmark-moment-as-the-return-of-trump-stuns-uk-into-action-on-defence-13316819",
    "timestamp": "2025-02-25T14:03:00Z"
  },
  {
    "title": "Provinces have roughly $100B at hand for tariff relief, Desjardins estimates",
    "description": "OTTAWA — Canada’s provincial governments have enough fiscal firepower to respond to looming U.S. tariffs without supersizing their debt burdens, a new report says. The analysis released Tuesday from Desjardins Economics predicted upcoming provincial budgets w…",
    "link": "https://financialpost.com/pmn/provinces-have-roughly-100b-at-hand-for-tariff-relief-desjardins-estimates",
    "timestamp": "2025-02-25T14:00:52Z"
  },
  {
    "title": "Provinces have roughly $100B available for tariff relief",
    "description": "Before the threat of tariffs, most provinces expected their fiscal situations to improve in 2025 amid forecasts for renewed economic growth",
    "link": "https://financialpost.com/news/economy/provinces-have-100b-for-tariff-relief",
    "timestamp": "2025-02-25T14:00:52Z"
  },
  {
    "title": "Exclusive: Center for Peace Communications Launches Interview Series of Gazans Wishing to Emigrate, Supporting Trump’s Regional Plan",
    "description": "President Donald Trump's plan to rebuild Gaza by resettling its citizens has significant support among many Gazans and is the “only solution” for struggling civilians, according to the Center for Peace Communications, which is fighting for Gazans to be given …",
    "link": "https://www.breitbart.com/politics/2025/02/25/exclusive-center-peace-communications-launches-interview-series-gazans-wishing-emigrate/",
    "timestamp": "2025-02-25T14:00:38Z"
  },
  {
    "title": "Trump Order Revives Fears of Real Estate Push for San Francisco’s Presidio",
    "description": "President Donald Trump’s order renews concerns over a real estate push in San Francisco’s Presidio, but legal protections may block development, much like past failed bayfront plans.",
    "link": "https://www.kqed.org/news/12028300/trump-order-revives-fears-real-estate-push-san-franciscos-presidio",
    "timestamp": "2025-02-25T14:00:33Z"
  },
  {
    "title": "Shuttered NYC migrant shelter highlights Trump’s successful immigration clampdown: NY lawmaker",
    "description": "President Donald Trump's quick action to secure the border has helped alleviate the migrant crisis in places like New York City, one Republican State lawmaker argues.",
    "link": "https://www.foxnews.com/politics/shuttered-nyc-migrant-shelter-highlights-trumps-successful-immigration-clampdown-ny-lawmaker",
    "timestamp": "2025-02-25T14:00:32Z"
  },
  {
    "title": "Apple Will Invest $500 Billion, Add 20K Jobs Amid Tariffs on China",
    "description": "Apple will work with Foxconn Technology Group to build \"the servers that power the cloud component of Apple Intelligence — a system called Private Cloud Compute — in Houston.\"\nThe post Apple Will Invest $500 Billion, Add 20K Jobs Amid Tariffs on China first a…",
    "link": "https://legalinsurrection.com/2025/02/apple-will-invest-500-billion-add-20k-jobs-amid-tariffs-on-china/",
    "timestamp": "2025-02-25T14:00:29Z"
  },
  {
    "title": "As Facebook abandons fact-checking, it’s also offering bonuses for viral content",
    "description": "Hours after Donald Trump was sworn in as president, users spread a false claim on Facebook that Immigration and Customs Enforcement was paying a bounty for reports of undocumented people. “BREAKING — ICE is allegedly offering $750 per illegal immigrant that y…",
    "link": "https://www.niemanlab.org/2025/02/as-facebook-abandons-fact-checking-its-also-offering-bonuses-for-viral-content/",
    "timestamp": "2025-02-25T14:00:18Z"
  },
  {
    "title": "EXCLUSIVE: Enrique Tarrio Nails Joe Biden’s DOJ to the Cross – Here Is the Video Clip That Will Take The Democrats Down! (VIDEO)",
    "description": "Enrique Tarrio's explosive allegations against the Biden DOJ reveal a troubling narrative surrounding January 6, 2021. His refusal to comply with demands could have profound implications for the Democrats and mainstream media.\nThe post EXCLUSIVE: Enrique Tarr…",
    "link": "https://www.thegatewaypundit.com/2025/02/exclusive-enrique-tarrio-nails-joe-bidens-doj-cross/",
    "timestamp": "2025-02-25T14:00:09Z"
  },
  {
    "title": "You can still claim up to $2,000 per kid from the child tax credit, but that amount may drop after 2025—here's what to know",
    "description": "If Congress doesn't address the soon-expiring expanded child tax credit, parents could see a higher tax bill in the coming years.",
    "link": "https://www.cnbc.com/2025/02/25/how-much-child-tax-credit-is-worth-2024-taxes.html",
    "timestamp": "2025-02-25T14:00:01Z"
  },
  {
    "title": "K-12 DEI Program Faces Federal Scrutiny Amid Trump Crackdown",
    "description": "THE CENTER SQUARE—A parental rights education group has filed a federal complaint against a California school for allegedly offering training sessions to some teachers and... Read More\nThe post K-12 DEI Program Faces Federal Scrutiny Amid Trump Crackdown appe…",
    "link": "https://www.dailysignal.com/2025/02/25/k-12-dei-program-faces-federal-scrutiny-amid-trump-crackdown/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "Study: Hollywood’s Male Role Models Are Failing Young Men. Where Does That Go in the Trump Era?",
    "description": "A 2024 report finds young males (13-30) crave vulnerable male characters. But experts wonder if a cultural shift could lead Hollywood in another direction\nThe post Study: Hollywood’s Male Role Models Are Failing Young Men. Where Does That Go in the Trump Era?…",
    "link": "https://www.thewrap.com/hollywood-male-role-models-study/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "What we know about posts calling for 'economic blackout' on Feb. 28",
    "description": "Historian Heather Cox Richardson was not involved with this grassroots effort.",
    "link": "https://www.snopes.com//news/2025/02/25/economic-blackout-february-25/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "Bernie Sanders on Battling a Government ‘Of, By, and For’ the Billionaires",
    "description": "An exclusive interview with Bernie Sanders as he launched his ‘Fighting Oligarchy’ tour, countering billionaire power and Trump tax cuts in Omaha.",
    "link": "http://www.rollingstone.com/politics/politics-features/bernie-sanders-elon-musk-donald-trump-oligarchy-government-billionaires-1235278831/",
    "timestamp": "2025-02-25T14:00:00Z"
  },
  {
    "title": "Iran will not yield to US 'pressure and sanctions' on nuclear dispute",
    "description": "\"Iran's position regarding nuclear talks is clear and we will not negotiate under pressure and sanctions,\" Araghchi said.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-843708",
    "timestamp": "2025-02-25T13:59:35Z"
  },
  {
    "title": "Trump Revokes Biden Memo Threatening to Withhold Arms from Israel",
    "description": "President Donald Trump has reportedly revoked a policy under President Joe Biden to threaten arms sales to Israel if the country does not satisfy critics of its human rights record while battling Palestinian Hamas terrorists in Gaza.\nThe post Trump Revokes Bi…",
    "link": "https://www.breitbart.com/politics/2025/02/25/trump-revokes-biden-memo-threatening-to-withhold-arms-from-israel/",
    "timestamp": "2025-02-25T13:58:43Z"
  },
  {
    "title": "Cryptogate: Trump’s Snub of Zelensky Greatly Complicates Argentina’s President Milei’s Already Precarious Situation.",
    "description": "Amid the political upheaval caused by the cryptocurrency scandal, Argentinian President Javier Milei remained silent on the criticism leveled at Volodymyr Zelensky by Donald Trump despite always supporting the Ukrainian president. With this, the self-describe…",
    "link": "https://www.globalresearch.ca/trump-snub-zelensky-complicates-milei-situation/5880848",
    "timestamp": "2025-02-25T13:58:18Z"
  },
  {
    "title": "US Health Secretary Delays Rule Updating Definition of Healthy on Food Labels",
    "description": "The Food and Drug Administration announced in late 2024 that it was updating the definition of healthy on food labels.",
    "link": "https://www.theepochtimes.com/health/us-health-secretary-delays-rule-updating-definition-of-healthy-on-food-labels-5815877",
    "timestamp": "2025-02-25T13:56:58Z"
  },
  {
    "title": "Putin offers Russian and Ukrainian rare minerals to US",
    "description": "Russian President Vladimir Putin said he is open to offering the US access to rare minerals, including from Russian-occupied Ukraine. This comes after US President Donald Trump has repeatedly pushed for Ukraine to give up some of its minerals in exchange for …",
    "link": "https://freerepublic.com/focus/f-chat/4300320/posts",
    "timestamp": "2025-02-25T13:56:50Z"
  },
  {
    "title": "LGBT Americans reach record number, more likely to be Dems, Gen Z: Gallup poll",
    "description": "The overall number of Americans identifying as non-heterosexual soared to a record high according to a 2024 Gallup poll published last week.",
    "link": "https://www.foxnews.com/politics/lgbt-americans-reach-record-number-more-likely-dems-gen-z-gallup-poll",
    "timestamp": "2025-02-25T13:56:38Z"
  },
  {
    "title": "Lurid sex chats among NSA agents exposed as intel chief Tulsi Gabbard vows to punish workers posting about 'kinks, fetishes and polyamory'",
    "description": "Director of National Intelligence Tulsi Gabbard was irate and promised to root out National Security Administration agents who held lurid sex chats in sensitive government chat rooms in the name of DEI. The revelations of chats about 'polyamory and castration…",
    "link": "https://freerepublic.com/focus/f-news/4300319/posts",
    "timestamp": "2025-02-25T13:55:51Z"
  },
  {
    "title": "Russia-Ukraine war: How the US position has changed on UN resolutions",
    "description": "The US vote against Ukraine and Europe's UN resolution reflects larger policy changes of the Trump administration.",
    "link": "https://www.aljazeera.com/news/2025/2/25/russia-ukraine-war-how-the-us-position-has-changed-on-un-resolutions",
    "timestamp": "2025-02-25T13:55:41Z"
  },
  {
    "title": "Dow Jones Futures: Trump Tariffs 'Going Forward;' Hims Stock Crashes On Earnings",
    "description": "The Dow Jones Industrial Average and other major stock futures tentatively ventured into positive ground Tuesday as Wall Street digested President Donald Trump's announcement that the tariffs on Canada and Mexico will go into effect early March. Among stocks,…",
    "link": "https://biztoc.com/x/81b2b33ea25afe44",
    "timestamp": "2025-02-25T13:55:29Z"
  },
  {
    "title": "UK's Starmer boosts defence spending on eve of Washington trip",
    "description": "LONDON: Prime Minister Keir Starmer said on Tuesday (Feb 25) he would increase defence spending to 2.5 per cent of GDP every year by 2027, rising to 3 per cent after 2029, a clear signal to US President Donald Trump that Britain will step up its efforts to bo…",
    "link": "https://www.channelnewsasia.com/world/uk-starmer-defence-spending-washington-trip-trump-4959216",
    "timestamp": "2025-02-25T13:54:29Z"
  }
]