[
  {
    "title": "FBI asks agents to voluntarily travel to Minneapolis",
    "description": "The Department of Justice and the Department of Homeland Security have already been increasing their presence in Minneapolis.",
    "link": "https://fortune.com/2026/01/17/fbi-agents-voluntarily-travel-minneapolis-ice-raids-immigration/",
    "timestamp": "2026-01-18T03:07:18Z"
  },
  {
    "title": "Cubans want Donald Trump to save them: They look hopefully to the skies for US Black Hawks",
    "description": "The US capture of Nicholas Maduro sent a shockwave of fear through the regime in Havana. Heeding the words of Marco Rubio – “If I lived in Havana and I was in the government, I’d be concerned at least a little bit” – the communist government put the military …",
    "link": "https://freerepublic.com/focus/f-news/4362696/posts",
    "timestamp": "2026-01-18T03:06:02Z"
  },
  {
    "title": "DAVID BLACKMON: Trump Should Put WEF On Notice Because Climate Scam Is Over",
    "description": "President Donald Trump has never been shy about stating his belief that the climate change narrative pushed by the globalist community for the last half-century",
    "link": "https://dailycaller.com/2026/01/17/opinion-trump-should-put-wef-on-notice-because-climate-scam-is-over-david-blackmon/",
    "timestamp": "2026-01-18T02:58:14Z"
  },
  {
    "title": "Trump’s ‘board of peace’ appears to seek wider mandate beyond Gaza",
    "description": "While launched as part of Gaza ceasefire, Trump envisions board as 'bold new approach to resolving global conflicts'.",
    "link": "https://www.aljazeera.com/news/2026/1/18/trumps-board-of-peace-appears-to-seek-wider-mandate-beyond-gaza",
    "timestamp": "2026-01-18T02:53:21Z"
  },
  {
    "title": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: “He Will Lose It” – European Film Awards - Deadline",
    "description": "Norwegian Acting Legend Liv Ullmann Wades Into Donald Trump Nobel Peace Prize Gift: “He Will Lose It” – European Film AwardsDeadline Machado urges U.S. leaders to push for a democratic government in VenezuelaPBS Nobel Prize committee says Machado decision to …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180608506",
    "timestamp": "2026-01-18T02:52:53Z"
  },
  {
    "title": "FBI Announces $100,000 Reward After Government Vehicles Broken Into in Minneapolis",
    "description": "The FBI said it is offering a reward of up to $100,000 for information leading to the arrest and capture of individuals who allegedly stole government property out of an FBI vehicle in Minneapolis, as it announced the arrest of one suspect. FBI Director Kash …",
    "link": "https://freerepublic.com/focus/f-news/4362692/posts",
    "timestamp": "2026-01-18T02:49:22Z"
  },
  {
    "title": "Reps For Ludacris Claim His Involvement In Kid Rock’s MAGA Music Festival Was “A Mix Up”",
    "description": "After some intense internet backlash, fans at the Rock the Country music festival will not be seeing Ludacris hit the stage.",
    "link": "https://hiphopwired.com/3005317/ludracris-drops-out-rock-the-country-kid-rock-music-festival-reactions/",
    "timestamp": "2026-01-18T02:47:12Z"
  },
  {
    "title": "Here's why Donald Trump lashed out at Jamie Dimon, threatened to sue JPMorgan — All you need to know",
    "description": "US President Donald Trump has lashed out at Jamie Dimon, chief of JPMorgan Chase and threatened to sue the lender for debanking him following the 6 January Capitol riot in 2021. He also refuted Dimon's claim that the executive for offered the role of Fed chie…",
    "link": "https://www.livemint.com/companies/news/donald-trump-threatens-sue-jpmorgan-debanking-capitol-jan-6-riots-why-unhappy-with-jamie-dimon-deny-offer-fed-chief-role-11768699834996.html",
    "timestamp": "2026-01-18T02:42:50Z"
  },
  {
    "title": "‘Almost Passed Out’: Kai Trump Shares ‘Scary’ NASCAR Race Car Experience",
    "description": "The track almost looks deceptively wide, but once the helmet is on, it stops looking very slow. That was the experience ofKai Trump at the Daytona International Speedway from the passenger seat.",
    "link": "https://www.essentiallysports.com/golf-news-almost-passed-out-kai-trump-shares-scary-nascar-race-car-experience/",
    "timestamp": "2026-01-18T02:36:37Z"
  },
  {
    "title": "Trump’s health care plan excludes those with preexisting conditions - NewsBreak",
    "description": "Trump is rolling out what he's calling the \"Great Healthcare Plan,\" in efforts to make health care more affordable — but not everyone is included.",
    "link": "https://www.newsbreak.com/news/4445281642154-trumps-health-care-plan-excludes-those-with-preexisting-conditions?noAds=1&amp;_f=app_share&amp;s=a2&amp;share_destination_id=MTc5NzI0MDgzLTE3Njg3MDIwMjk4NDM%3D",
    "timestamp": "2026-01-18T02:30:51Z"
  },
  {
    "title": "Netanyahu Blasts Trump’s Gaza Peace Plan, Claims Composition of Gaza Executive Board “Runs Contrary” to Israeli Policy – Israel National Security Minister Calls for “Return to War with Enormous Force”",
    "description": "Israel may be displeased with President Trump’s Gaza Peace Plan, as Prime Minister Benjamin Netanyahu has surprisingly come out claiming that  the President’s Gaza Executive Board was “not coordinated with Israel and runs contrary to its policy.” As The Gatew…",
    "link": "https://www.thegatewaypundit.com/2026/01/netanyahu-blasts-trumps-gaza-peace-plan-claims-composition/",
    "timestamp": "2026-01-18T02:30:21Z"
  },
  {
    "title": "JPMorgan confirms Trump assertion that bank CEO Dimon was not offered Fed chair job",
    "description": "JPMorgan CEO Jamie Dimon has denied being offered the Federal Reserve chair position. This comes after President Donald Trump disputed a report claiming he made the offer. Trump also stated he will sue JPMorgan. The bank maintains it does not close accounts b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jpmorgan-confirms-trump-assertion-that-bank-ceo-dimon-was-not-offered-fed-chair-job/articleshow/126636012.cms",
    "timestamp": "2026-01-18T02:25:59Z"
  },
  {
    "title": "Israel objects to U.S. announcement of 'Board of Peace' leaders who will help oversee next steps in Gaza",
    "description": "Israel’s government is objecting to the White House announcement of leaders who will play a role in overseeing next steps in Gaza as the ceasefire moves into its challenging second phase. The rare criticism from Israel of its close ally in Washington said the…",
    "link": "https://japantoday.com/category/world/israel-objects-to-us-announcement-of-leaders-who-will-play-a-role-in-overseeing-next-steps-in-gaza",
    "timestamp": "2026-01-18T02:09:10Z"
  },
  {
    "title": "Faisal Islam: Trump's Greenland threats to allies are without parallel",
    "description": "The US president's latest threats will baffle the leaders of allied nations, writes the BBC's economics editor.",
    "link": "https://www.bbc.com/news/articles/cx2gjdx241wo",
    "timestamp": "2026-01-18T02:08:31Z"
  },
  {
    "title": "Anti-ICE demonstrators chase off outnumbered far-right activists at Minneapolis rally",
    "description": "Hundreds of anti-ICE protesters in Minneapolis chased off a small group of far-right activists who had vowed to march on a neighborhood where many immigrants live on Saturday, stoking tensions ‌in a city on edge after the killing of Renee Good by a federal im…",
    "link": "https://japantoday.com/category/world/anti-ice-demonstrators-chase-off-outnumbered-far-right-activists-at-minneapolis-rally2",
    "timestamp": "2026-01-18T02:07:47Z"
  },
  {
    "title": "World News Live Updates: EU to hold emergency meeting today over Trump's Greendland tariff threats",
    "description": "World News Live Updates: Ambassadors from the European Union’s 27 member states will meet on Sunday for emergency talks after US President Donald Trump threatened a new wave of escalating tariffs on European allies unless the United States is permitted to pur…",
    "link": "https://m.economictimes.com/news/newsblogs/world-india-news-live-updates-trump-greenland-tariffs-eu-republic-day-modi-bjp-rahul-gandhi-congress-weather-bmc-elections/liveblog/126635902.cms",
    "timestamp": "2026-01-18T02:05:59Z"
  },
  {
    "title": "US kills 'terrorist' operative linked to deadly IS ambush of three Americans in Syria",
    "description": "CENTCOM says it conducted a strike in north-west Syria that resulted in the death of an Al Qaeda operative linked to the ISIS gunman responsible for killing two US soldiers and a US civilian in Syria on December 13.",
    "link": "https://www.abc.net.au/news/2026-01-18/us-kills-al-qaeda-affiliate-tied-to-december-attack-in-syria/106241954",
    "timestamp": "2026-01-18T02:03:53Z"
  },
  {
    "title": "Europe’s Outrage Over Maduro Arrest Reflects Poor Understanding of Oil Industry",
    "description": "The dramatic arrest of Venezuelan leader Nicolás Maduro sent shock waves around the world. Yet nowhere was the reaction more negative – and more baffling – than in the European Union, where outrage swept through public discourse, a stark contrast to the gener…",
    "link": "https://wattsupwiththat.com/2026/01/17/europes-outrage-over-maduro-arrest-reflects-poor-understanding-of-oil-industry/",
    "timestamp": "2026-01-18T02:00:00Z"
  },
  {
    "title": "Seized Bitcoin From Samourai Wallet Case Not Sold And Will Remain In Strategic Reserve, White House Confirms",
    "description": "Patrick Witt said in a recent interview that setting up the Strategic Bitcoin Reserve remains on the government’s “priority list”.",
    "link": "https://zycrypto.com/seized-bitcoin-from-samourai-wallet-case-not-sold-and-will-remain-in-strategic-reserve-white-house-confirms/",
    "timestamp": "2026-01-18T01:55:27Z"
  },
  {
    "title": "Trump’s crackdown won’t solve credit cards’ many problems",
    "description": "Credit card interest rates are often painfully high, but there are better ways to protect consumers than the 10 per cent rate cap flagged by Donald Trump.",
    "link": "https://www.smh.com.au/business/banking-and-finance/trump-s-crackdown-won-t-solve-credit-cards-many-problems-20260115-p5nugh.html",
    "timestamp": "2026-01-18T01:53:28Z"
  },
  {
    "title": "Trump says he will sue JPMorgan Chase over ‘debanking’ him after Jan 6 protests",
    "description": "President Donald Trump announced plans to sue JPMorgan Chase within weeks. He alleges the bank wrongly debanked him following the January 6th Capitol protest. Trump also refuted reports that he offered JPMorgan CEO Jamie Dimon the position of Federal Reserve …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-he-will-sue-jpmorgan-chase-over-debanking-him-after-jan-6-protests/articleshow/126635382.cms",
    "timestamp": "2026-01-18T01:41:48Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,424",
    "description": "These are the key developments from day 1,424 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2026/1/18/russia-ukraine-war-list-of-key-events-day-1424",
    "timestamp": "2026-01-18T01:39:04Z"
  },
  {
    "title": "'Bleeding from the head': Jan. 6 rioter claims to be 'stabbed' by protester in Minneapolis",
    "description": "Right-wing provocateur Jake Lang, who was given a pardon by Donald Trump after attacking Capitol cops with a baseball bat on Jan. 6, claims to have been stabbed while leading a counter-protest in Minneapolis, Minnesota.We reported earlier in the day that Lang…",
    "link": "https://www.rawstory.com/ice-maga-stabbed-report/",
    "timestamp": "2026-01-18T01:31:25Z"
  },
  {
    "title": "Iran’s supreme leader admits thousands were killed in protests supported by ‘criminal’ Trump | CNN",
    "description": "Iran’s supreme leader, Ayatollah Ali Khamenei, acknowledged Saturday that thousands of Iranians were killed during more than two weeks of unrest in the country, and he blamed the deaths on US President Donald Trump, who he said “openly encouraged” the protest…",
    "link": "https://www.cnn.com/2026/01/17/middleeast/iran-supreme-leader-khamenei-protests-criminal-trump-intl-latam",
    "timestamp": "2026-01-18T01:31:01Z"
  },
  {
    "title": "Iran’s supreme leader acknowledges thousands killed as Trump calls for new leadership: reports",
    "description": "Iran's supreme leader Khamenei reportedly acknowledges thousands died in recent protests for the first time, as death toll estimates reach over 3,000.",
    "link": "https://www.foxnews.com/world/irans-supreme-leader-acknowledges-thousands-killed-trump-calls-new-leadership",
    "timestamp": "2026-01-18T01:28:06Z"
  },
  {
    "title": "Israel objects to US Gaza peace plan announcement",
    "description": "The committee announced by the White House includes no Israeli officials but has an Israeli businessperson, billionaire Yakir Gabay.",
    "link": "https://www.abc.net.au/news/2026-01-18/israel-objects-to-us-announcement-of-leaders-who-will-help-overs/106241834",
    "timestamp": "2026-01-18T01:12:05Z"
  },
  {
    "title": "It may come down to Trump using political pressure to force banks to cap interest rates on credit cards",
    "description": "“I don’t have a specific consequence to outline for you but certainly this is an expectation and frankly a demand that the president has made.”",
    "link": "https://fortune.com/2026/01/17/trump-political-pressure-force-banks-cap-interest-rates-credit-cards/",
    "timestamp": "2026-01-18T01:11:38Z"
  },
  {
    "title": "Big oil's complicated calculus for investing in Venezuela",
    "description": "President Donald Trump has clashed with major US oil companies over investment plans in Venezuela, saying he may block Exxon Mobil after its CEO called the country “uninvestable.” Trump wants oil firms to invest heavily to boost supply and keep oil prices low…",
    "link": "https://economictimes.indiatimes.com/news/international/business/big-oils-complicated-calculus-for-investing-in-venezuela/articleshow/126635072.cms",
    "timestamp": "2026-01-18T01:09:37Z"
  },
  {
    "title": "Thousands march in Greenland to support Arctic island in the face of Trump's threats to take it over",
    "description": "Thousands in Greenland marched against U.S. President Donald Trump's interest in their island.  Protesters chanted 'Greenland is not for sale' supporting self-governance.  Trump announced a 10% import tax on goods from eight European countries opposing U.S. c…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/thousands-march-in-greenland-to-support-arctic-island-in-the-face-of-trumps-threats-to-take-it-over/articleshow/126634960.cms",
    "timestamp": "2026-01-18T01:06:41Z"
  },
  {
    "title": "Justice Dept. enters new territory with probe of Minnesota officials",
    "description": "President Donald Trump’s Justice Department crossed a new threshold with its criminal investigation of top Democratic elected officials in Minnesota, targeting vocal critics during a moment of crisis in which protesters and federal agents are clashing on icy …",
    "link": "https://freerepublic.com/focus/f-news/4362682/posts",
    "timestamp": "2026-01-18T01:05:17Z"
  },
  {
    "title": "Israel objects to White House selection of candidates for Gaza 'Board of Peace'",
    "description": "Israel has objected to the United States' selection of candidates for a Gaza 'Board of Peace'. Prime Minister Benjamin Netanyahu stated the appointments were not coordinated with Israel and contradict its policy. Foreign Affairs Minister Gideon Sa'ar will con…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-objects-to-white-house-selection-of-candidates-for-gaza-board-of-peace/articleshow/126634878.cms",
    "timestamp": "2026-01-18T01:03:54Z"
  },
  {
    "title": "Change! U.S. Sees First Sustained Drop in Fentanyl-Linked Overdose Deaths in Years",
    "description": "One reason, as explained by Sec. of War Pete Hegseth, is that \"NO ONE wants to get into a narco boat\" after U.S. military's successful hits.\nThe post Change! U.S. Sees First Sustained Drop in Fentanyl-Linked Overdose Deaths in Years first appeared on Le·gal I…",
    "link": "https://legalinsurrection.com/2026/01/change-u-s-sees-first-sustained-drop-in-fentanyl-linked-overdose-deaths-in-years/",
    "timestamp": "2026-01-18T01:00:04Z"
  },
  {
    "title": "There’s broad bipartisan support in Congress to renew Obamacare subsidies, but the abortion issue could block a deal and keep premiums high",
    "description": "“The two sides are passionate about (abortion) so I think if they can find a way to bring it up, they probably will.”",
    "link": "https://fortune.com/2026/01/17/affordable-care-act-bipartisan-support-congress-obamacare-subsidies-premiums-abortion/",
    "timestamp": "2026-01-18T00:59:28Z"
  },
  {
    "title": "54 Nigerians seek asylum in Denmark",
    "description": "Official data shows 54 Nigerians sought asylum in Denmark between 2024 and 2025, with a notable decline amid the country’s strict immigration policies.\n\nRead More: https://punchng.com/54-nigerians-seek-asylum-in-denmark/",
    "link": "https://punchng.com/54-nigerians-seek-asylum-in-denmark/",
    "timestamp": "2026-01-18T00:53:51Z"
  },
  {
    "title": "Trump wants nations to pay $1 billion to stay on his peace board",
    "description": "President Trump is forming a new Board of Peace. Countries seeking permanent membership must contribute at least one billion dollars. Donald Trump will lead the board as its first chairman. This initiative aims to promote stability and governance in conflict …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-wants-nations-to-pay-1-billion-to-stay-on-his-peace-board/articleshow/126634295.cms",
    "timestamp": "2026-01-18T00:52:20Z"
  },
  {
    "title": "EU set to halt US trade deal over Trump’s new tariff threat",
    "description": "European Union lawmakers are moving to stall approval of the EU–US trade deal after US President Donald Trump threatened tariffs on European countries backing Greenland against US claims. Manfred Weber, head of the European People’s Party, said the deal canno…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-set-to-halt-us-trade-deal-over-trumps-new-tariff-threat/articleshow/126634354.cms",
    "timestamp": "2026-01-18T00:48:27Z"
  },
  {
    "title": "New details revealed: Why Trump chose not to strike Iran this week",
    "description": "Washington Post report provides new details on Trump’s decision to halt imminent US airstrikes on Iran after executions were canceled.",
    "link": "https://www.israelnationalnews.com/news/421051",
    "timestamp": "2026-01-18T00:44:08Z"
  },
  {
    "title": "Netanyahu to convene Security Cabinet at 10:00 a.m. amid tensions surrounding Iran.",
    "description": "Prime Minister Benjamin Netanyahu is set to convene the Security Cabinet on Sunday morning at 10:00 a.m., against the backdrop of rising tensions with Iran and the possibility that US President Donald Trump may order a strike on the Islamic Republic.Later, at…",
    "link": "https://www.israelnationalnews.com/flashes/674592",
    "timestamp": "2026-01-18T00:38:28Z"
  },
  {
    "title": "Thousands rally in Greenland against US annexation plans (VIDEOS)",
    "description": "Thousands of Greenlanders marched toward the US consulate to oppose US President Donald Trump’s plan to annex the Arctic island Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631092-greenland-rally-against-us-annexation/",
    "timestamp": "2026-01-18T00:35:05Z"
  },
  {
    "title": "Starmer begins pushback against Trump as president threatens tariffs over Greenland",
    "description": "It's hardly a Love Actually moment of brave UK defiance in the face of a domineering US president- but Sir Keir Starmer has clearly decided it's time to start pushing back.",
    "link": "https://news.sky.com/story/keir-starmer-begins-pushback-against-trump-as-president-threatens-tariffs-over-greenland-13495726",
    "timestamp": "2026-01-18T00:29:00Z"
  },
  {
    "title": "선 넘은 트럼프의 돈로 독트린",
    "description": "Tensions in Minneapolis escalated after a federal officer shot a man in the leg during protests over a sweeping immigration crackdown. The incident came a week after the fatal shooting of local woman Renée Good by ICE agents https://t.co/K58ROmm0tT pic.twitte…",
    "link": "https://ryueyes11.tistory.com/512052",
    "timestamp": "2026-01-18T00:27:10Z"
  },
  {
    "title": "Democrats' Best Hope To Rein In ICE Is Right Now (Jennifer Bendery/HuffPost)",
    "description": "Jennifer Bendery / HuffPost:\nDemocrats' Best Hope To Rein In ICE Is Right Now  —  Even if it's not by very much.  —  WASHINGTON - If Democrats in Congress have any chance at reining in how Immigration and Customs Enforcement operates under President Donald Tr…",
    "link": "https://www.memeorandum.com/260117/p70",
    "timestamp": "2026-01-18T00:25:04Z"
  },
  {
    "title": "Trump announces he will sue JPMorgan ‘over the next two weeks’ for allegedly ‘DEBANKING’ him",
    "description": "The president also ruled out the bank’s CEO, Jamie Dimon, as a possible pick for Fed chair.President Donald Trump announced Saturday that he will be suing the investment banking company JPMorgan Chase within “the next two weeks” for allegedly “DEBANKING” him …",
    "link": "https://freerepublic.com/focus/f-news/4362675/posts",
    "timestamp": "2026-01-18T00:24:58Z"
  },
  {
    "title": "European leaders hit back at Donald Trump’s vow to impose tariffs over Greenland",
    "description": "The US president has vowed to slap new tariffs on eight European countries until a deal is reached.",
    "link": "https://7news.com.au/news/european-leaders-hit-back-at-donald-trumps-vow-to-impose-tariffs-over-greenland-c-21342977",
    "timestamp": "2026-01-18T00:17:16Z"
  },
  {
    "title": "'Experienced terrorist' killed by US strikes in Syria after deadly ambush on Americans",
    "description": "An \"experienced terrorist leader\" with ties to al Qaeda has been killed in US strikes, after an Islamic State ambush last month left three Americans dead.",
    "link": "https://news.sky.com/story/experienced-terrorist-killed-by-us-strikes-in-syria-after-deadly-ambush-left-three-americans-dead-13495724",
    "timestamp": "2026-01-18T00:17:00Z"
  },
  {
    "title": "James Carville Shares 'Wipeout' Midterms Prediction With Stunned Fox News Host",
    "description": "Kayleigh McEnany appeared genuinely taken aback by the Democratic strategist's take.",
    "link": "https://www.huffpost.com/entry/james-carville-wipeout-midterms-prediction-kayleigh-mcenany-fox-news_n_696bfb2de4b061d96a0cbb4f",
    "timestamp": "2026-01-18T00:16:13Z"
  },
  {
    "title": "Donald Trump Comes Clean About His Health: Everything He's Said So Far About His Well-Being as Dementia Rumors Swirl",
    "description": "Donald Trump Comes Clean About His Health: Everything He's Said So Far About His Well-Being as Dementia Rumors Swirlnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4446547469992-donald-trump-comes-clean-about-his-health-everything-he-s-said-so-far-about-his-well-being-as-dementia-rumors-swirl?_f=app_share&amp;pd=0AnswGyA&amp;lang=en_US&amp;send_time=1768695229&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.37.4.4%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-18T00:14:23Z"
  },
  {
    "title": "British PM warns Trump of ‘wrong’ move against NATO",
    "description": "British Prime Minister Keir Starmer has publicly criticized US President Donald Trump’s plan to impose tariffs against fellow NATO members Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631094-starmer-trump-wrong-tariffs/",
    "timestamp": "2026-01-18T00:14:21Z"
  },
  {
    "title": "Trump’s Reported Price Tag for Nations to Stay on His Gaza Board of Peace: $1 Billion",
    "description": "Nations that wish to secure a permanent spot on Donald Trump's proposed \"Board of Peace\" will have to pony up at least $1 billion, according to Bloomberg.\nThe post Trump’s Reported Price Tag for Nations to Stay on His Gaza Board of Peace: $1 Billion first app…",
    "link": "https://www.mediaite.com/media/news/trumps-reported-price-tag-for-nations-to-stay-on-his-gaza-board-of-peace-1-billion/",
    "timestamp": "2026-01-18T00:10:13Z"
  },
  {
    "title": "Trump purchased up to $51 million in bonds at the end of 2025, including Netflix and Warner Bros. investments",
    "description": "President Donald Trump purchased up to $2 million in Netflix and Warner Bros. Discovery investments days after the announcement of a megadeal between the two media giants, among other purchases, according to a financial disclosure from the White House, renewi…",
    "link": "https://www.cnn.com/2026/01/17/business/trump-financial-disclosure-netflix-warner-bros",
    "timestamp": "2026-01-18T00:09:36Z"
  },
  {
    "title": "From surge in patriotism to fewer US trips - Trump's impact on Canada",
    "description": "The first year of Donald Trump's second term has had a profound effect on Canada, from its politics and economy to the way Canadians shop and travel.",
    "link": "https://www.bbc.com/news/articles/crmlvym2e3eo",
    "timestamp": "2026-01-18T00:07:52Z"
  },
  {
    "title": "EU to hold emergency meeting on Trump's tariffs over Greenland",
    "description": "The European Union will hold an emergency meeting of its ambassadors in Brussels on Sunday after U.S.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-greenland-tariffs-eu-trade-rcna254584",
    "timestamp": "2026-01-18T00:04:57Z"
  },
  {
    "title": "Trump wants nations to pay $1 billion to stay on his peace board, report says",
    "description": "Jan 17 (Reuters) - ‌The Trump administration wants ‌nations to pay $1 billion to ‌stay on his peace board, Bloomberg News reported on Saturday, citing a ‍draft charter. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/18/trump-wants-nations-to-pay-1-billion-to-stay-on-his-peace-board-report-says",
    "timestamp": "2026-01-18T00:01:00Z"
  },
  {
    "title": "Trump slams tariffs on UK, France for opposing Greenland takeover",
    "description": "President Trump announces new 10% tariffs on the UK, France, and other European nations for opposing the US purchase of Greenland.\n\nRead More: https://punchng.com/trump-slams-tariffs-on-uk-france-for-opposing-greenland-takeover/",
    "link": "https://punchng.com/trump-slams-tariffs-on-uk-france-for-opposing-greenland-takeover/",
    "timestamp": "2026-01-18T00:00:49Z"
  },
  {
    "title": "Don't believe claim video shows ICE agents in NYC being pelted with snowballs",
    "description": "The footage depicts a crowd of people in a setting somewhat resembling Central Park throwing snowballs at law enforcement officers.",
    "link": "https://www.snopes.com//fact-check/nyc-ice-agents-snowballs/",
    "timestamp": "2026-01-18T00:00:00Z"
  },
  {
    "title": "Oil’s Problem Isn’t Iran or Russia — It’s Too Much Oil",
    "description": "Crude oil prices are in retreat after rising on the possibility of U.S. strikes on Iran. Before the retreat, however, Brent crude and WTI had jumped to the highest in months, countering bearish forecasts for the year—and tearing traders between geopolitics an…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Oils-Problem-Isnt-Iran-or-Russia-Its-Too-Much-Oil.html",
    "timestamp": "2026-01-18T00:00:00Z"
  },
  {
    "title": "Masvidal Promises ‘Something Big’ For UFC Comeback",
    "description": "Jorge Masvidal can’t say exactly when his next UFC fight will take place, but “Gamebred” is at least promising “something big” for his awaited return to action. It’s been a while since UFC fans saw “Gamebred” grace the Octagon. The last time Masvidal fought f…",
    "link": "https://www.mmamania.com/ufc-news/415231/jorge-masvidal-promises-something-big-for-ufc-return-but-is-it-mcgregor-at-the-white-house",
    "timestamp": "2026-01-18T00:00:00Z"
  },
  {
    "title": "Progressive MeidasTouch Network Drops Michael Cohen’s Podcasts After Claiming He ‘Felt Coerced’ to Testify Against Trump",
    "description": "MeidasTouch Network announced it was cutting ties with Michael Cohen on Saturday after he claimed prosecutors \"pressured\" him to give anti-Trump testimony\nThe post Progressive MeidasTouch Network Drops Michael Cohen’s Podcasts After Claiming He ‘Felt Coerced’…",
    "link": "https://www.mediaite.com/media/progressive-meidastouch-network-drops-michael-cohens-podcasts-after-claiming-he-felt-coerced-to-testify-against-trump/",
    "timestamp": "2026-01-17T23:57:38Z"
  },
  {
    "title": "Democrats grapple with 'rising clamor' for Trump impeachment ahead of midterms",
    "description": "From the campaign trail to Capitol Hill, a growing number of Democrats have said they believe President Donald Trump has committed impeachable offenses in his first year back in office. But with their focus on the midterms, fewer elected Democrats are willing…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362670/posts",
    "timestamp": "2026-01-17T23:56:05Z"
  },
  {
    "title": "Trump says he'll hit Denmark and 7 other countries with new tariffs until there's a deal to buy Greenland (Steve Kopack/NBC News)",
    "description": "Steve Kopack / NBC News:\nTrump says he'll hit Denmark and 7 other countries with new tariffs until there's a deal to buy Greenland  —  Trump said the 10% duties on eight European countries would increase to 25% on June 1 unless a deal is reached.  — Add NBC N…",
    "link": "https://www.memeorandum.com/260117/p67",
    "timestamp": "2026-01-17T23:50:01Z"
  },
  {
    "title": "Hundreds protest Trump, ICE at Colorado State Capitol in Denver",
    "description": "Hundreds of people gathered at the state Capitol in Denver on Saturday to protest the actions of President Donald Trump’s administration, including recent surges in immigration enforcement and the shooting death of Renee Good in Minneapolis by a federal offic…",
    "link": "https://www.denverpost.com/2026/01/17/denver-protest-ice-trump-renee-good/",
    "timestamp": "2026-01-17T23:47:55Z"
  },
  {
    "title": "White House Threatened Trump Would Sue CBS If Tony Dokoupil’s POTUS Interview Didn’t Air In Full On ‘Evening News’",
    "description": "After Donald Trump gave a 13-minute interview to new CBS Evening News anchor Tony Dokoupil earlier this week, White House Press Secretary Karoline Leavitt delivered a message to the anchor and his news team with a message from POTUS: Air the complete intervie…",
    "link": "http://deadline.com/2026/01/trump-threatens-to-sue-cbs-tony-dokoupil-interview-1236686119/",
    "timestamp": "2026-01-17T23:46:42Z"
  },
  {
    "title": "It’s funny until somebody gets hurt",
    "description": "I know, this isn’t really serious: It’s “just a distraction” from the Epstein files or the price of groceries or the Gestapo in Minnesota. Right? We have subsidized Denmark, and all of the Countries of the European Union, and others, for many years by not cha…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/its-funny-until-somebody-gets-hurt-2",
    "timestamp": "2026-01-17T23:46:21Z"
  },
  {
    "title": "Trump names Kushner, Rubio, Blair to Gaza board; Israel objects to lineup (Washington Post)",
    "description": "Washington Post:\nTrump names Kushner, Rubio, Blair to Gaza board; Israel objects to lineup  —  Israeli officials oppose the inclusion of diplomats from Turkey and Qatar, nations Israel says will work to ensure Hamas's survival.  —  TEL AVIV — President Donald…",
    "link": "https://www.memeorandum.com/260117/p66",
    "timestamp": "2026-01-17T23:45:01Z"
  },
  {
    "title": "Unless Trump sees through Israel's policy in Gaza, phase two will stay a fantasy",
    "description": "As the IDF controls over half of the Gaza Strip, the Trump administration must make sure the current routine of attrition, with no full cease-fire, no withdrawal, no reconstruction and no functioning civilian government, is not made permanent by Israel",
    "link": "https://www.haaretz.com/opinion/editorial/2026-01-18/ty-article-opinion/unless-trump-sees-through-israels-policy-in-gaza-phase-two-will-stay-a-fantasy/0000019b-cdc3-d627-a99b-ffdb922b0000",
    "timestamp": "2026-01-17T23:36:27Z"
  },
  {
    "title": "Ex‑US envoy predicts Trump may target Iran’s Supreme Leader within days",
    "description": "Former US Ambassador to Israel Dan Shapiro warns Trump may attempt to eliminate Iran’s Supreme Leader, saying rising tensions and US military positioning could trigger major strikes but not immediate regime change.",
    "link": "https://www.israelnationalnews.com/news/421050",
    "timestamp": "2026-01-17T23:32:09Z"
  },
  {
    "title": "US strike eliminates al Qaeda operative connected to ISIS ambush that killed 3 Americans in Syria",
    "description": "Bilal Hasan al-Jasim was affiliated to gunman who killed 2 service members and interpreter in December attack U.S. Central Command (CENTCOM) announced on Saturday a leader affiliated with al Qaeda, who had direct ties to an ISIS terrorist responsible for kill…",
    "link": "https://freerepublic.com/focus/f-chat/4362668/posts",
    "timestamp": "2026-01-17T23:28:50Z"
  },
  {
    "title": "Anti-ICE Demonstrators Chase Off Outnumbered Far-Right Activists At Minneapolis Rally",
    "description": "Some in the crowd tossed water balloons that soaked the right-wing demonstrators as temperatures hit -4 degrees Fahrenheit with the wind chill.",
    "link": "https://www.huffpost.com/entry/anti-ice-demonstrators-chase-off-far-right-activists-minneapolis-rally_n_696c18afe4b0c97f839eb826",
    "timestamp": "2026-01-17T23:28:29Z"
  },
  {
    "title": "Eric Swalwell Promises to Yank ICE’s Driver’s Licenses If He Becomes California Governor: ‘Good Luck Walking to Work, A**holes’",
    "description": "Rep. Eric Swalwell (D-CA) vowed that if he becomes California's next governor he will revoke the driver's licenses of ICE agents who wear masks while driving.\nThe post Eric Swalwell Promises to Yank ICE’s Driver’s Licenses If He Becomes California Governor: ‘…",
    "link": "https://www.mediaite.com/politics/eric-swalwell-promises-to-yank-ices-drivers-licenses-if-he-becomes-california-governor-good-luck-walking-to-work-aholes/",
    "timestamp": "2026-01-17T23:17:21Z"
  },
  {
    "title": "Protests explode in Greenland amid Trump takeover push: 'We are not interested in being Americans'",
    "description": "Thousands march in Greenland wearing 'Make America Go Away' hats, rejecting Trump's purchase demands and tariff threats saying, 'we are not interested in being Americans.'",
    "link": "https://www.foxnews.com/world/protests-explode-greenland-amid-trump-takeover-push-we-not-interested-being-americans",
    "timestamp": "2026-01-17T23:16:09Z"
  },
  {
    "title": "Israel objects to US lineup of 'Gaza executive board'",
    "description": "Netanyahu's office said the lineup runs contrary to Israeli policy. The Trump administration had announced panel members who will oversee the transitional government in the war-ravaged Palestinian territory. Israel objected on Saturday to the US announcement …",
    "link": "https://www.dw.com/en/israel-objects-to-us-lineup-of-gaza-executive-board/a-75550023",
    "timestamp": "2026-01-17T23:15:00Z"
  },
  {
    "title": "Trump’s Billion-Dollar Board of Peace",
    "description": "The new entity has a global remit and a steep price for a permanent seat.",
    "link": "https://www.theatlantic.com/national-security/2026/01/trump-billion-dollar-board-of-peace/685671/",
    "timestamp": "2026-01-17T23:12:00Z"
  },
  {
    "title": "European Union and Mercosur bloc sign landmark free trade agreement",
    "description": "The EU and the Mercosur bloc of South American countries formally signed a long-sought landmark free trade agreement on Saturday, capping more than 25 years of negotiations to strengthen commercial ties in the face of rising protectionism and global trade ten…",
    "link": "https://www.pbs.org/newshour/world/european-union-and-mercosur-bloc-sign-landmark-free-trade-agreement",
    "timestamp": "2026-01-17T23:10:08Z"
  },
  {
    "title": "Abigail Spanberger sworn in as Virginia's first woman governor",
    "description": "It marks a new chapter as Democrats pull the levers of power in Virginia while Republican Donald Trump sits in the White House in neighboring Washington.",
    "link": "https://www.koco.com/article/abigail-spanberger-sworn-in-virginias-first-woman-governor/70034054",
    "timestamp": "2026-01-17T23:06:16Z"
  },
  {
    "title": "Brussels declares ‘full solidarity’ with Denmark",
    "description": "Top officials in Brussels have accused US President Donald Trump of “undermining” transatlantic unity with tariffs on European NATO states Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631091-eu-solidarity-denmark-greenland/",
    "timestamp": "2026-01-17T23:01:44Z"
  },
  {
    "title": "Trump Threatens Cuba: Make a Deal With The U.S. “Before It’s Too Late”",
    "description": "In January 2026, the U.S. Department of Justice unveiled an indictment alleging that President Nicolás Maduro was complicit in international drug trafficking, referencing the September 2013 Air France Flight 385 cocaine seizure as purported evidence. On the s…",
    "link": "https://www.activistpost.com/trump-threatens-cuba-make-a-deal-with-the-u-s-before-its-too-late/",
    "timestamp": "2026-01-17T23:00:00Z"
  },
  {
    "title": "Probe shows actress left Jeddah airport",
    "description": "KUALA LUMPUR: Actress Nadia Kesuma (pic), who was reported missing, is said to have left the King Abdulaziz International Airport in Jeddah, says Foreign Minister Datuk Seri Mohamad Hasan. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/01/18/probe-shows-actress-left-jeddah-airport",
    "timestamp": "2026-01-17T23:00:00Z"
  },
  {
    "title": "Thousands Protest in Greenland and Denmark over Trump Plans to Acquire Island",
    "description": "(AFP) — Thousands of people demonstrated in the capital of Greenland on Saturday against President Donald Trump’s plans for the US to annex the Danish autonomous territory.The protesters, including the territory’s prime minister, Jens-Frederik Nielsen, waving…",
    "link": "https://freerepublic.com/focus/f-news/4362664/posts",
    "timestamp": "2026-01-17T22:59:26Z"
  },
  {
    "title": "Roundup: Trump's tariffs threat over Greenland sparks EU pushback",
    "description": "BRUSSELS, Jan. 17 (Xinhua) -- U.S. President Donald Trump's threat to impose new tariffs on eight European countries unless Denmark accept a deal over Greenland has drawn swift rebukes from Nordic capitals and major European leaders, fueled calls for an EU-le…",
    "link": "https://www.thestar.com.my/news/world/2026/01/18/roundup-trump039s-tariffs-threat-over-greenland-sparks-eu-pushback",
    "timestamp": "2026-01-17T22:59:00Z"
  },
  {
    "title": "Is a red line still a red line?",
    "description": "'Don't replicate Obama's mistake, Mr. President'",
    "link": "https://www.wnd.com/2026/01/is-red-line-still-red-line/",
    "timestamp": "2026-01-17T22:57:07Z"
  },
  {
    "title": "Abigail Spanberger sworn in as Virginia's first woman governor",
    "description": "It marks a new chapter as Democrats pull the levers of power in Virginia while Republican Donald Trump sits in the White House in neighboring Washington.",
    "link": "https://www.wcvb.com/article/abigail-spanberger-sworn-in-virginias-first-woman-governor/70034054",
    "timestamp": "2026-01-17T22:56:32Z"
  },
  {
    "title": "‘We never, ever had winters like this’: Ukraine struggles as power cuts bite",
    "description": "Ukraine is enduring one of the harshest winters in its modern history as relentless Russian strikes cripple the country’s energy infrastructure, leaving millions without reliable heat or electricity. With nighttime temperatures in Kyiv dropping below -20C, ro…",
    "link": "https://freerepublic.com/focus/f-news/4362663/posts",
    "timestamp": "2026-01-17T22:56:25Z"
  },
  {
    "title": "Abigail Spanberger sworn in as Virginia's first woman governor",
    "description": "It marks a new chapter as Democrats pull the levers of power in Virginia while Republican Donald Trump sits in the White House in neighboring Washington.",
    "link": "https://www.wmur.com/article/abigail-spanberger-sworn-in-virginias-first-woman-governor/70034054",
    "timestamp": "2026-01-17T22:56:07Z"
  },
  {
    "title": "Abigail Spanberger sworn in as Virginia's first woman governor",
    "description": "It marks a new chapter as Democrats pull the levers of power in Virginia while Republican Donald Trump sits in the White House in neighboring Washington.",
    "link": "https://www.wbaltv.com/article/abigail-spanberger-sworn-in-virginias-first-woman-governor/70034054",
    "timestamp": "2026-01-17T22:53:42Z"
  },
  {
    "title": "CBS Evening News Threatened with Lawsuit Over Trump Interview: Report",
    "description": "Even after agreeing to pay him a $16 million settlement to make his lawsuit against CBS News' 60 Minutes go away (despite many believing the company had a strong case to challenge it in court), David Ellison's Paramount Skydance wasn't cut any slack by Donald…",
    "link": "https://bleedingcool.com/tv/cbs-evening-news-threatened-with-lawsuit-over-trump-interview-report/",
    "timestamp": "2026-01-17T22:52:08Z"
  },
  {
    "title": "Karoline Leavitt Reportedly Threatened CBS Anchor Tony Dokoupil to Not Edit Trump Interview: ‘We’ll Sue Your Ass Off’",
    "description": "Karoline Leavitt threatened Tony Dokoupil moments after he wrapped up his interview with Donald Trump, The New York Times reported\nThe post Karoline Leavitt Reportedly Threatened CBS Anchor Tony Dokoupil to Not Edit Trump Interview: ‘We’ll Sue Your Ass Off’ f…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-reportedly-threatened-cbs-anchor-tony-dokoupil-to-not-edit-trump-interview-well-sue-your-ass-off/",
    "timestamp": "2026-01-17T22:50:36Z"
  },
  {
    "title": "Michael Cohen Felt 'Coerced' Into Testifying Against Donald Trump Prompting President to Slam Prosecutions as a 'Setup'",
    "description": "Michael Cohen claimed prosecutors coerced his testimony in Trump cases, while the president slammed the legal actions.",
    "link": "https://radaronline.com/p/michael-cohen-felt-coerced-testifying-against-donald-trump/",
    "timestamp": "2026-01-17T22:45:00Z"
  },
  {
    "title": "'SET UP': Cohen Accuses Alvin Bragg, Letitia James of Coercing Him to Turn on Trump",
    "description": "\"Letitia James and Alvin Bragg may not share the same office or political calendar, but they share the same playbook.”",
    "link": "https://www.westernjournal.com/set-cohen-accuses-alvin-bragg-letitia-james-coercing-turn-trump/",
    "timestamp": "2026-01-17T22:44:03Z"
  },
  {
    "title": "US strikes Al-Qaeda leader with direct ties to ambush that killed 3 Americans",
    "description": "A third round of retaliatory strikes by the U.S. in Syria resulted in the death of an Al-Qaeda-affiliated leader, who officials say had a direct tie to the Islamic State member responsible for last month’s ambush that killed two U.S. soldiers and one American…",
    "link": "https://nypost.com/2026/01/17/world-news/us-kills-leader-tied-to-islamic-state-ambush-after-launching-third-round-of-retaliatory-strikes-in-syria/",
    "timestamp": "2026-01-17T22:36:41Z"
  },
  {
    "title": "Tech workers say they were mistaken for ICE agents, accosted by anti-ICE mob",
    "description": "What began as a casual lunch between five Twin Cities software engineers quickly escalated into a frightening encounter after the men were misidentified as undercover federal agents and protesters were alerted to the Minneapolis restaurant where they were din…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362660/posts",
    "timestamp": "2026-01-17T22:32:36Z"
  },
  {
    "title": "Donald Trump Crowns Himself 'Tariff King' in Late-Night Rant Despite Polling Showing His Trade War Is Extremely Unpopular",
    "description": "President Donald Trump labeled himself 'Mister Tariff', then escalated to calling himself the 'Tariff King'.",
    "link": "https://radaronline.com/p/donald-trump-crowns-himself-tariff-king-late-night-rant-trade-war/",
    "timestamp": "2026-01-17T22:30:00Z"
  },
  {
    "title": "Trump wants nations to pay $1 billion to stay on his peace board",
    "description": "Critics are worried that Trump is trying to build an alternative, or rival, to the United Nations, which he has long criticized.",
    "link": "https://fortune.com/2026/01/17/trump-nations-1-billion-membership-payment-peace-board-united-nations/",
    "timestamp": "2026-01-17T22:29:33Z"
  },
  {
    "title": "European Film Awards: Sentimental Value wins big at politically-charged ceremony",
    "description": "Palestine featured in several categories, while Iranian filmmaker Jafar Panahi spoke about oppression in his country",
    "link": "https://www.irishtimes.com/culture/film/2026/01/17/european-film-awards-joachim-trier-movie-wins-big-at-politically-charged-berlin-ceremony/",
    "timestamp": "2026-01-17T22:28:56Z"
  },
  {
    "title": "The Trump Doctrine",
    "description": "Venezuela 'was an operational masterstroke that undermines China, Russia, and Iran'",
    "link": "https://www.wnd.com/2026/01/trump-doctrine/",
    "timestamp": "2026-01-17T22:28:55Z"
  }
]