[
  {
    "title": "Dick Cheney's doctor demands congressional inquiry into Trump's mental fitness",
    "description": "The doctor who formerly treated Dick Cheney, longtime cardiologist Dr. Jonathan Reiner, called on Congress to launch an investigation into President Donald Trump's mental health over his obsession with owning Greenland.In a recent letter, Trump linked his que…",
    "link": "https://www.rawstory.com/dick-cheney-doctor-trump-fitness/",
    "timestamp": "2026-01-19T17:53:27Z"
  },
  {
    "title": "Some Trump voters are sneaking away (Amanda Marcotte/Salon)",
    "description": "Amanda Marcotte / Salon:\nSome Trump voters are sneaking away  —  They'll never admit they're wrong, but polling reveals quiet GOP regret  —  A decade into our collective Donald Trump nightmare, most of the reality-based population has given up on hoping MAGA …",
    "link": "https://www.memeorandum.com/260119/p62",
    "timestamp": "2026-01-19T17:50:02Z"
  },
  {
    "title": "★ Crazy People Do Crazy Things",
    "description": "If Trump declares that the U.S. is laying claim to all of the green cheese on the moon — say, to lower the price of dairy groceries — the news media should not respond with fact-finding articles with headlines like “How Much Cheese Is on the Moon?” They shoul…",
    "link": "https://daringfireball.net/2026/01/crazy_people_do_crazy_things",
    "timestamp": "2026-01-19T17:48:46Z"
  },
  {
    "title": "US Catholic cardinals urge Trump administration to embrace a moral compass in foreign policy",
    "description": "The cardinals stress that military action should be a last resort.",
    "link": "https://www.bostonherald.com/2026/01/19/vatican-us/",
    "timestamp": "2026-01-19T17:45:45Z"
  },
  {
    "title": "Trump has plan for instant strike back if Supreme Court rules against him: report",
    "description": "President Donald Trump has a plan for an instant strike back if the Supreme Court rules against his tariffs, according to a report Monday. In an interview with The New York Times, the United States Trade Representative Jamieson Greer — Trump's top trade negot…",
    "link": "https://www.rawstory.com/supreme-court-trump-tariffs/",
    "timestamp": "2026-01-19T17:45:37Z"
  },
  {
    "title": "Man Trains Crows to Attack MAGA Hats",
    "description": "Man Trains Crows to Attack MAGA Hatslittlethings.com",
    "link": "https://littlethings.com/entertainment/crows-maga-hats",
    "timestamp": "2026-01-19T17:44:00Z"
  },
  {
    "title": "How two acclaimed US films reveal the failures of leftwing revolutionary politics",
    "description": "It seems apt then that two films concerned with the failures of leftwing revolutionary politics should emerge almost simultaneously with Donald Trump’s resurgence.",
    "link": "https://theconversation.com/how-two-acclaimed-us-films-reveal-the-failures-of-leftwing-revolutionary-politics-270729",
    "timestamp": "2026-01-19T17:42:15Z"
  },
  {
    "title": "How George Orwell’s Nineteen Eighty-Four predicted the global power shifts happening now",
    "description": "Orwell is feted for the farsightedness of his geopolitical vision as long ago as the 1940s. But a lot of writers were thinking along similar lines.",
    "link": "https://theconversation.com/how-george-orwells-nineteen-eighty-four-predicted-the-global-power-shifts-happening-now-273122",
    "timestamp": "2026-01-19T17:42:14Z"
  },
  {
    "title": "More than 160 churchgoers kidnapped in twin Nigeria attacks - clergy",
    "description": "Police say armed gangs burst into the two churches in Kurmin Wali, Kaduna state, during Sunday service.",
    "link": "https://www.bbc.com/news/articles/c4grw9vg7y4o",
    "timestamp": "2026-01-19T17:41:47Z"
  },
  {
    "title": "Trump’s Greenland ambitions could wreck 20th-century alliances that helped build the modern world order",
    "description": "How the US treats its allies has been a crucial question for every president. What evolved over the centuries into an official embrace of friendly nations is now being reversed by Donald Trump.",
    "link": "https://theconversation.com/trumps-greenland-ambitions-could-wreck-20th-century-alliances-that-helped-build-the-modern-world-order-273863",
    "timestamp": "2026-01-19T17:39:34Z"
  },
  {
    "title": "60 Minutes airs pulled segment on Trump deportations",
    "description": "On Sunday, 60 Minutes aired a story about Trump administration deportations that was abruptly pulled from the news magazine's lineup a month ago, a move that triggered an internal battle about political pressure that spilled out into the open.",
    "link": "https://www.cbc.ca/news/entertainment/60-minutes-pulled-episode-9.7051397",
    "timestamp": "2026-01-19T17:39:24Z"
  },
  {
    "title": "Provoking War Over Greenland, Trump Warns Nobel Snub Ends Reason to ‘Think Purely of Peace’",
    "description": "After receiving President Donald Trump's latest demand for Greenland via text message Sunday, Norwegian Prime Minister Jonas Gahr Støre was among the European leaders who signaled they aim to meet with Trump at this week's World Economic Forum in Switzerland …",
    "link": "https://www.commondreams.org/news/trump-greenland-nobel",
    "timestamp": "2026-01-19T17:38:40Z"
  },
  {
    "title": "‘Orwell on Steroids!’ Ex-Bush Advisor GOES OFF on Trump Inviting Putin to be on ‘Board of Peace’",
    "description": "“What is going on here? I could see paying a billion dollars not to be part of this,” Haass joked of Trump's demands\nThe post ‘Orwell on Steroids!’ Ex-Bush Advisor GOES OFF on Trump Inviting Putin to be on ‘Board of Peace’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/orwell-on-steroids-ex-bush-advisor-goes-off-on-trump-inviting-putin-to-be-on-board-of-peace/",
    "timestamp": "2026-01-19T17:37:20Z"
  },
  {
    "title": "Trump's poll numbers are awful — but they contain a terrible warning for Dems",
    "description": "Donald Trump’s floor is his ceiling. And his ceiling is his floor.That is the stark takeaway from a new Associated Press-NORC poll showing his approval rating stuck at roughly 40 percent — flatlining across every major issue. Only 37 percent approve of his ha…",
    "link": "https://www.rawstory.com/raw-investigates/trump-polls-2674906431/",
    "timestamp": "2026-01-19T17:36:08Z"
  },
  {
    "title": "Fed Chair Jerome Powell To Attend Supreme Court Argument On Lisa Cook Case: AP Source",
    "description": "The high court is considering whether President Donald Trump can fire Fed governor Lisa Cook, an unprecedented attempt by the White House to remove an official appointed by former President Joe Biden.",
    "link": "https://www.huffpost.com/entry/federal-reserve-supreme-court-jerome-powell-lisa-cook_n_696e692be4b02f48956cf065",
    "timestamp": "2026-01-19T17:36:05Z"
  },
  {
    "title": "Top US Catholic cardinals question morality of American foreign policy",
    "description": "Jan 19 (Reuters) - ‌Three U.S. Catholic archbishops on Monday decried the direction of ‌American foreign policy, saying the country's \"moral role in confronting ‌evil around the world\" was in question and that military action must only be used as an extreme l…",
    "link": "https://www.thestar.com.my/news/world/2026/01/20/top-us-catholic-cardinals-question-morality-of-american-foreign-policy",
    "timestamp": "2026-01-19T17:34:00Z"
  },
  {
    "title": "Oh, he'll be comin' round the mountain",
    "description": "Donald Trump arrives in Davos facing EU challenges. The EU struggles to influence Trump on Greenland. US economic power and EU's reliance on American technology hinder its leverage. Europe's foreign policy is tied to US dictates. Trump seeks increased NATO co…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/oh-hell-be-comin-round-the-mountain/articleshow/126704931.cms",
    "timestamp": "2026-01-19T17:33:40Z"
  },
  {
    "title": "Statement from The Prime Minister (Government.no)",
    "description": "Government.no:\nStatement from The Prime Minister  —  Statement from Prime Minister Jonas Gahr Støre regarding communications with President Donald Trump.  —  'I can confirm that this is a text message that I received yesterday afternoon from President Trump. …",
    "link": "https://www.memeorandum.com/260119/p59",
    "timestamp": "2026-01-19T17:30:17Z"
  },
  {
    "title": "US big pharma sector poised to hike prices in Europe – FT",
    "description": "US drugmakers are reportedly looking to maintain profits at the expense of Europeans to offset lower prices at home Read Full Article at RT.com",
    "link": "https://www.rt.com/business/631170-us-drug-prices-europe/",
    "timestamp": "2026-01-19T17:30:17Z"
  },
  {
    "title": "Trump vs. Thune: POTUS blows up La. Senate race",
    "description": "President Donald Trump has blown up another Senate GOP primary, throwing Republicans into turmoil and giving Senate Majority Leader John Thune a blistering headache. Trump’s decision to endorse GOP Rep. Julia Letlow – who isn’t even formally in the Louisiana …",
    "link": "https://freerepublic.com/focus/f-news/4362949/posts",
    "timestamp": "2026-01-19T17:28:26Z"
  },
  {
    "title": "Trump to Norway PM Store: World Is Not Secure Unless U.S. Has ' Complete and Total Control of Greenland'",
    "description": "President Donald Trump declared that he no longer feels \"an obligation to think purely of peace\" in a letter to Norway's prime minister, Jonas Gahr Støre, expressing his desire to acquire Greenland from Denmark for the United States. \nThe post Trump to Norway…",
    "link": "https://www.breitbart.com/europe/2026/01/19/trump-to-norway-pm-store-world-is-not-secure-unless-u-s-has-complete-and-total-control-of-greenland/",
    "timestamp": "2026-01-19T17:28:19Z"
  },
  {
    "title": "Trump says not thinking 'purely of peace' in Greenland push",
    "description": "US President Donald Trump has threatened European nations with tariffs if they oppose his plans for Greenland. Trump stated the world is not safe without US control of the Arctic island. European leaders have denounced the move as blackmail and are preparing …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-not-thinking-purely-of-peace-in-greenland-push/articleshow/126704325.cms",
    "timestamp": "2026-01-19T17:27:33Z"
  },
  {
    "title": "Europe Will Lose the Most if It Continues to Respond Timidly to US Tariffs and Threats - Economist",
    "description": "EU lawmakers are shelving a 2025 transatlantic trade deal after Washington slapped on new tariffs and reignited its Greenland push.",
    "link": "https://sputnikglobe.com/20260119/europe-will-lose-the-most-if-it-continues-to-respond-timidly-to-us-tariffs-and-threats---economist-1123491091.html",
    "timestamp": "2026-01-19T17:27:27Z"
  },
  {
    "title": "Norway’s Prime Minister Fires Off a Terse Statement in Response to Wild Trump Screed",
    "description": "Norwegian Prime Minister Jonas Gahr Støre replied Monday to President Donald Trump’s highly controversial letter linking his desire to acquire Greenland to being snubbed for the Nobel Peace Prize, which is given out by a committee of five chosen by the Norweg…",
    "link": "https://freerepublic.com/focus/f-chat/4362948/posts",
    "timestamp": "2026-01-19T17:27:07Z"
  },
  {
    "title": "'So much for the partnership': Ford says he found out about Chinese EV deal only hours before it was announced",
    "description": "Ford said it was time for the federal government to 'step up' and listed several demands to support the Canadian auto industry",
    "link": "https://nationalpost.com/news/ford-says-he-found-out-about-chinese-ev-deal-only-hours-before-it-was-announced",
    "timestamp": "2026-01-19T17:24:47Z"
  },
  {
    "title": "'So much for the partnership': Ford says he found about Chinese EV deal only hours before it was announced",
    "description": "Ford said it was time for the federal government to 'step up' and listed several demands to support the Canadian auto industry",
    "link": "https://nationalpost.com/news/ford-says-he-found-about-chinese-ev-deal-only-hours-before-it-was-announced",
    "timestamp": "2026-01-19T17:24:47Z"
  },
  {
    "title": "Trump’s deadline for a 10% cap on credit card rates confuses bankers",
    "description": "President Donald Trump recently told the credit card industry that it had until Jan. 20 to comply with his demand for a 10% cap on interest rates.",
    "link": "https://www.ocregister.com/2026/01/19/as-trumps-deadline-for-a-cap-on-credit-card-rates-looms-banks-have-only-questions-and-no-answers/",
    "timestamp": "2026-01-19T17:19:38Z"
  },
  {
    "title": "Gunmen abduct more than 150 Christians in mass kidnapping",
    "description": "Armed bandits have kidnapped more than 150 Christians in simultaneous attacks on a number of churches in Nigeria.",
    "link": "https://news.sky.com/story/gunmen-abduct-more-than-150-christians-in-mass-kidnapping-13496319",
    "timestamp": "2026-01-19T17:19:00Z"
  },
  {
    "title": "Former AG Eric Holder Accuses the Trump Administration of Attempting to ‘Re-Segregate America’",
    "description": "Former Attorney General Eric Holder accused President Trump's administration of trying to \"re-segregate America\" during an event to honor Martin Luther King Jr.\nThe post Former AG Eric Holder Accuses the Trump Administration of Attempting to ‘Re-Segregate Ame…",
    "link": "https://www.mediaite.com/politics/former-ag-eric-holder-accuses-the-trump-administration-of-attempting-to-re-segregate-america/",
    "timestamp": "2026-01-19T17:18:52Z"
  },
  {
    "title": "Russia Says President Putin Has Been Invited to Join Trump's Gaza Peace Board",
    "description": "Putin has received an invitation to take up a place on President Donald Trump's $1-billion-a-seat Gaza Board of Peace, the Kremlin says. \nThe post Russia Says President Putin Has Been Invited to Join Trump’s Gaza Peace Board appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/01/19/russia-says-putin-has-been-invited-to-join-trumps-gaza-committee/",
    "timestamp": "2026-01-19T17:18:13Z"
  },
  {
    "title": "AP Source: Fed Chair Powell to attend Supreme Court argument on Cook case",
    "description": "The high court is considering whether Trump can fire Cook.",
    "link": "https://www.bostonherald.com/2026/01/19/fed-chair-powell-supreme-court/",
    "timestamp": "2026-01-19T17:17:41Z"
  },
  {
    "title": "A year on from his second inauguration, Trump 2.0 has one defining word: power",
    "description": "The president loves exercising power in the United States and abroad. But he’s tanking in the polls – and the November mid-terms may clip his wings at home.",
    "link": "https://theconversation.com/a-year-on-from-his-second-inauguration-trump-2-0-has-one-defining-word-power-273697",
    "timestamp": "2026-01-19T17:15:16Z"
  },
  {
    "title": "Trump escalates attacks on Ilhan Omar, suggests jail time or deportation from the US to Somalia",
    "description": "President Donald Trump asserted on Truth Social that Rep. Ilhan Omar should be jailed or deported to Somalia, alleging her involvement in a \"Minnesota Somalia Fraud.\" Trump also accused Omar of hating the USA and suggested her actions, along with the governor…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-escalates-attacks-on-ilhan-omar-suggests-jail-time-or-deportation-from-the-us-to-somalia/articleshow/126699825.cms",
    "timestamp": "2026-01-19T17:14:51Z"
  },
  {
    "title": "Elon Musk pours a staggering $10M into Kentucky Senate race, backing pro-Trump business outsider",
    "description": "Pro-Trump outsider Nate Morris says Musk's staggering donation gives his Kentucky Senate campaign firepower to compete against establishment Republicans.",
    "link": "https://www.foxnews.com/politics/elon-musk-pours-staggering-10m-kentucky-senate-race-backing-pro-trump-business-outsider",
    "timestamp": "2026-01-19T17:13:59Z"
  },
  {
    "title": "Canada considers sending troops to Greenland amid Trump's push for ownership of the island",
    "description": "A Royal Canadian Air Force contingent is already taking part in exercises there, but additional forces may be sent.",
    "link": "https://nationalpost.com/news/canada/canada-troops-trump-greenland",
    "timestamp": "2026-01-19T17:12:18Z"
  },
  {
    "title": "AP Source: Fed Chair Powell to attend Supreme Court argument on Cook case",
    "description": "Federal Reserve Chair Jerome Powell will attend the Supreme Court’s oral arguments Wednesday in a case involving the attempted firing of Fed governor Lisa Cook, an unusual show of support by the central bank chair. The high court is considering whether Presid…",
    "link": "https://apnews.com/article/federal-reserve-jerome-powell-lisa-cook-supreme-court-7f135bd222013d4fe61eb8f03c663676",
    "timestamp": "2026-01-19T17:11:46Z"
  },
  {
    "title": "Trump Suggests US Is Owed Greenland, Cites Nobel Snub In Private Warning To Europe",
    "description": "Trump warned Europe that he no longer feels bound to prioritize peace, linking his frustration over not receiving the Nobel Peace Prize to his campaign for Greenland.",
    "link": "https://dailycaller.com/2026/01/19/trump-suggests-us-is-owed-greenland-cites-nobel-snub-in-private-warning-to-europe/",
    "timestamp": "2026-01-19T17:09:59Z"
  },
  {
    "title": "Is Donald Trump at CFP championship game? Live updates on president's Miami vs. Indiana appearance",
    "description": "The Sporting News has you covered on whether the Commander-in-chief is at the College Football Playoff championship game.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_dd1ce146-7e20-42aa-bd75-cae139d4497c",
    "timestamp": "2026-01-19T17:08:13Z"
  },
  {
    "title": "‘When Did It All Go Down Hill For White Guys?’ Whoopi Goldberg Skewers Trump’s Civil Rights Comments On MLK Edition of The View",
    "description": "Whoopi Goldberg celebrated Martin Luther King Jr. by skewering Trump's recent comments that the Civil Rights Act caused \"reverse discrimination\" for white men.\nThe post ‘When Did It All Go Down Hill For White Guys?’ Whoopi Goldberg Skewers Trump’s Civil Right…",
    "link": "https://www.mediaite.com/media/news/when-did-it-all-go-down-hill-for-white-guys-whoopi-goldberg-skewers-trumps-civil-rights-comments-on-mlk-edition-of-the-view/",
    "timestamp": "2026-01-19T17:06:45Z"
  },
  {
    "title": "Reports: Elon Musk drops $10 million donation into Kentucky Senate candidate",
    "description": "Elon Musk, the richest man in the world, is putting money into Kentucky's Senate race.",
    "link": "https://www.wlky.com/article/reports-elon-musks-10-million-donation-kentucky-senate-morris/70049871",
    "timestamp": "2026-01-19T17:05:33Z"
  },
  {
    "title": "Inequality and unease are rising as elite Davos event opens with pro-business Trump set to attend",
    "description": "This year’s theme is “A spirit of dialogue.”",
    "link": "https://www.bostonherald.com/2026/01/19/davos-forum-begins/",
    "timestamp": "2026-01-19T17:04:46Z"
  },
  {
    "title": "Josh Shapiro Claims Kamala Harris' Team Asked Him If He'd Spied for Israel",
    "description": "Josh Shapiro went through an extensive vetting process while Kamala Harris figured out who she wanted as a running mate for her 2024 presidential campaign ... and he says he was asked if he'd ever spied for Israel. The governor of Pennsylvania…\n Permalink",
    "link": "https://www.tmz.com/2026/01/19/josh-shapiro-asked-if-he-spied-israel/",
    "timestamp": "2026-01-19T17:03:46Z"
  },
  {
    "title": "After unveiling a pitiful health care ‘plan,’ Trump struggles to explain its merits",
    "description": "One day after unveiling a purported health care “plan,” the president had an opportunity to tout its virtues. It did not go well.",
    "link": "https://www.ms.now/rachel-maddow-show/maddowblog/after-unveiling-a-pitiful-health-care-plan-trump-struggles-to-explain-its-merits",
    "timestamp": "2026-01-19T17:03:44Z"
  },
  {
    "title": "MeidasTouch Cuts Ties With Michael Cohen After He Said He Felt Coerced To Testify Against Trump",
    "description": "MeidasTouch announced its cutting ties with Michael Cohen just hours after he claimed prosecutors pressured him to curate his testimony against Trump.",
    "link": "https://dailycaller.com/2026/01/19/meidastouch-michael-cohen-donald-trump/",
    "timestamp": "2026-01-19T17:03:00Z"
  },
  {
    "title": "Debunked: False claims spread online that Greenland would bypass Denmark in talks with US",
    "description": "Surveys indicate the idea of a US takeover of Greenland is unpopular in both countries.",
    "link": "https://www.thejournal.ie/debunked-greenland-bypass-denmark-united-states-annexation-trump-surveys-parliament-6931622-Jan2026/",
    "timestamp": "2026-01-19T17:02:39Z"
  },
  {
    "title": "Davos braces for Trump showdown",
    "description": "US president scheduled to make his first appearance in six years amid simmering tensions over Greenland",
    "link": "https://www.irishtimes.com/business/2026/01/19/davos-braces-for-trump-showdown/",
    "timestamp": "2026-01-19T17:00:42Z"
  },
  {
    "title": "Piers Morgan Recuperating From Hip Surgery Following Fall, Might Host Online Talk Show From Home",
    "description": "Piers Morgan is recuperating in a hospital after a recent fall necessitated hip surgery. The host of the YouTube talk show Piers Morgan Uncensored says in a social media post today that he might be conducting the interview show from his London home for a bit.…",
    "link": "http://deadline.com/2026/01/piers-morgan-hip-surgery-femur-1236689581/",
    "timestamp": "2026-01-19T17:00:22Z"
  },
  {
    "title": "Trump’s tariff shock sends Bitcoin reeling – Can BTC’s support hold?",
    "description": "A geopolitical tariff shock tied to Greenland sent gold soaring and crypto tumbling.",
    "link": "https://ambcrypto.com/trumps-tariff-shock-sends-bitcoin-reeling-can-btcs-support-hold/",
    "timestamp": "2026-01-19T17:00:13Z"
  },
  {
    "title": "Third immigrant detainee at facility in El Paso has died, ICE says",
    "description": "A third undocumented immigrant detained at a sprawling tent camp in the Texas desert has died, U.S.",
    "link": "https://www.nbcnews.com/news/us-news/third-immigrant-detainee-facility-el-paso-died-ice-says-rcna254783",
    "timestamp": "2026-01-19T16:58:35Z"
  },
  {
    "title": "Now, Mumbai’s Lokhandwala Complex in redevelopment mode, to grow taller",
    "description": "Mumbai: In 1984-85, the rumble of construction swept the emerald green mangroves and marshland of Andheri West, giving rise to a posh housing colony i.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/now-mumbais-lokhandwala-complex-in-redevelopment-mode-to-grow-taller/articleshow/126700929.cms",
    "timestamp": "2026-01-19T16:58:00Z"
  },
  {
    "title": "Argentina Designates Iran's IRGC Quds Force as Terrorist Group",
    "description": "President of Argentina Javier Milei signed a decree this weekend designating the Islamic Revolutionary Guard Corps's (IRGC) Quds Force a terrorist organization.\nThe post Argentina Designates Iran’s IRGC Quds Force as Terrorist Group appeared first on Breitbar…",
    "link": "https://www.breitbart.com/national-security/2026/01/19/argentina-designates-irans-irgc-quds-force-as-terrorist-group/",
    "timestamp": "2026-01-19T16:57:42Z"
  },
  {
    "title": "Cuban Communists Announce Vague Plan for 'State of War' After Losing Soldiers in Maduro Arrest",
    "description": "Cuba's National Security Council held a meeting this weekend to discuss what state propaganda described as \"plans and measures to take a step toward a State of War,\" a day after welcoming the remains of 32 of its soldiers killed in an American operation to ar…",
    "link": "https://www.breitbart.com/latin-america/2026/01/19/cuban-communists-announce-vague-plan-for-state-of-war-after-losing-soldiers-in-maduro-arrest/",
    "timestamp": "2026-01-19T16:57:18Z"
  },
  {
    "title": "No clarity at present on Trump's 'Board of Peace', India will carefully examine invite: Experts",
    "description": "India has been invited by US President Donald Trump to join a new 'Board of Peace'. This board aims to bring lasting peace to Gaza and address global conflicts. Experts note a lack of clarity on the board's structure and mandate. India will carefully consider…",
    "link": "https://economictimes.indiatimes.com/news/india/no-clarity-at-present-on-trumps-board-of-peace-india-will-carefully-examine-invite-experts/articleshow/126702072.cms",
    "timestamp": "2026-01-19T16:57:00Z"
  },
  {
    "title": "Excise scam: BJP could steal special sessionthunder by targeting minister",
    "description": "Bengaluru: The alleged bribery scam in the excise department has put the Congress govt on the defensive ahead of a special session of the legislature .",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/excise-scam-bjp-could-steal-special-sessionthunder-by-targeting-minister/articleshow/126702133.cms",
    "timestamp": "2026-01-19T16:57:00Z"
  },
  {
    "title": "Nicki Minaj hurls homophobic slur at gay journalist Don Lemon after ICE protest",
    "description": "Nicki Minaj has continued her anti-LGBTQ+ push, now targeting gay journalist Don Lemon after his report on a Minnesota church service. The 43-year-old and 12-time Grammy nominee took to X on Monday (19 January) to post about Lemon in all caps. Her post comes …",
    "link": "https://www.thepinknews.com/2026/01/19/nicki-minaj-hurls-homophobic-slur-at-gay-journalist-don-lemon-after-ice-protest/",
    "timestamp": "2026-01-19T16:56:31Z"
  },
  {
    "title": "Diplomacy or retaliation? EU mulls its options as tensions with US rise over Greenland",
    "description": "European Union nations are contemplating strong responses to United States trade threats. Leaders are discussing retaliatory tariffs and the use of a new anti-coercion tool. This comes after President Trump announced potential import taxes on goods from eight…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/diplomacy-or-retaliation-the-eu-mulls-its-options-as-tensions-with-u-s-rise-over-greenland/articleshow/126701940.cms",
    "timestamp": "2026-01-19T16:55:12Z"
  },
  {
    "title": "Tariff Renewal Raises Real Question of Who Can Bear the Cost",
    "description": "The specter of a global trade war once again raised its head over the weekend. The immediate takeaway of the tariff news was familiar: uncertainty is back, and companies must prepare to weather it. But a more consequential issue lurks. The central question of…",
    "link": "https://www.pymnts.com/economy/2026/tariff-renewal-raises-real-question-of-who-can-bear-the-cost/",
    "timestamp": "2026-01-19T16:54:51Z"
  },
  {
    "title": "Trump’s Greenland threats push Europe toward divorcing America - politico.eu",
    "description": "Trump’s Greenland threats push Europe toward divorcing Americapolitico.eu Opinion | I’m the Secretary General of the Council of Europe. This Is Something I Thought I’d Never Have to Write.The New York Times As faith in the US fades a year into Trump 2.0, Euro…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180615220",
    "timestamp": "2026-01-19T16:52:59Z"
  },
  {
    "title": "Trump Screws Senator Bill Cassidy In A Big Way",
    "description": "Donald Trump may be dissembling in front of our eyes physically and mentally, but he always remembers those whom he believes have wronged him. \nSen. Bill Cassidy was one of the Republicans to vote to impeach Trump after the January 6th insurrection so Trump t…",
    "link": "https://crooksandliars.com/2026/01/trump-screws-sen-bill-cassidy-endorsing",
    "timestamp": "2026-01-19T16:52:55Z"
  },
  {
    "title": "The US economy seems strong after a year of Trump, but is it really?",
    "description": "While economic growth is strong, the gap between the haves and have-nots is widening.",
    "link": "https://www.aljazeera.com/economy/2026/1/19/the-us-economy-seems-strong-after-a-year-of-trump-but-is-it-really",
    "timestamp": "2026-01-19T16:51:42Z"
  },
  {
    "title": "Is There Life After the Dollar?",
    "description": "Global financial stability has long depended on the dollar’s role as the main reserve currency, with the expectation that the United States would both set the rules and uphold them. As American leadership grows more erratic, that dependence has become a vulne…",
    "link": "https://www.project-syndicate.org/commentary/limits-of-dollar-exorbitant-privilege-in-a-fracturing-world-by-paola-subacchi-2026-01",
    "timestamp": "2026-01-19T16:51:17Z"
  },
  {
    "title": "Davos' elite World Economic Forum set to open with pro-business Trump set to attend and inequality on the rise",
    "description": "The World Economic Forum, the think tank that hosts the annual event in the Alpine snows starting Tuesday, has a stated motto of \"improving the state of the world\" and this year's theme is \"A spirit of dialogue.\"",
    "link": "https://www.pbs.org/newshour/world/davos-elite-world-economic-forum-set-to-open-with-pro-business-trump-set-to-attend-and-inequality-on-the-rise",
    "timestamp": "2026-01-19T16:49:47Z"
  },
  {
    "title": "AR Rahman: Indian composer faces backlash for ‘bias’ in Bollywood remarks",
    "description": "The Oscar-winning composer faces backlash for saying he lost work due to 'communal bias' in Bollywood.",
    "link": "https://www.aljazeera.com/features/2026/1/19/ar-rahman-indian-composer-faces-backlash-for-bias-in-bollywood-remarks",
    "timestamp": "2026-01-19T16:48:50Z"
  },
  {
    "title": "What to know about the annual World Economic Forum meeting in Davos",
    "description": "Here's a look at the latest edition of the elite affair in Swiss Alps.",
    "link": "https://www.bostonherald.com/2026/01/19/what-to-know-davos/",
    "timestamp": "2026-01-19T16:48:49Z"
  },
  {
    "title": "Trump Has Dragged the Nation to a Point So Low It's Hard Fathom",
    "description": "How did we get to the point where the president can say and do things that put our culture and democracy at risk, and it’s just shrugged off as if it were normal? In social media posts and unscripted press comments he uses language that would have been unimag…",
    "link": "https://www.commondreams.org/opinion/trump-drags-nation-to-new-low",
    "timestamp": "2026-01-19T16:48:25Z"
  },
  {
    "title": "Economists Turn Bullish On Trump Economy",
    "description": "Wall Street Journal survey shows dramatic improvement in forecasts as recession fears fade and growth expectations surge\nThe post Economists Turn Bullish On Trump Economy appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2026/01/19/economists-turn-bullish-on-trump-economy/",
    "timestamp": "2026-01-19T16:48:16Z"
  },
  {
    "title": "The debate that never ends: Washington's constant health care fight",
    "description": "The ongoing debate over health care in the U.S. remains as contentious as ever. Since President Harry Truman's failed attempt to establish a national health care program in 1945, every president has grappled with the government's role in health care. This iss…",
    "link": "https://www.whec.com/ap-top-news/the-debate-that-never-ends-washingtons-constant-health-care-fight/",
    "timestamp": "2026-01-19T16:45:58Z"
  },
  {
    "title": "Tony Blair Balks At Trump’s $1B ‘Board of Peace’ Fee – After Accepting Spot on Exec Panel",
    "description": "Tony Blair accepted a spot on Donald Trump's \"Board of Peace,\" but is now balking at the $1 billion fee for nations to wishing to secure a permanent spot.\nThe post Tony Blair Balks At Trump’s $1B ‘Board of Peace’ Fee – After Accepting Spot on Exec Panel first…",
    "link": "https://www.mediaite.com/media/news/tony-blair-balks-at-trumps-1b-board-of-peace-fee-after-accepting-spot-on-exec-panel/",
    "timestamp": "2026-01-19T16:45:50Z"
  },
  {
    "title": "Ellen DeGeneres 'Proud' of Anti-ICE Agitators in Minneapolis: 'Sorry for Anyone Hurt Just for Protesting'",
    "description": "Ellen DeGeneres says she is \"proud\" of anti-ICE agitators in Minneapolis, Minnesota. \"I am sorry for anyone who has been hurt just for protesting,\" the embattled former talk show host added.\nThe post Ellen DeGeneres ‘Proud’ of Anti-ICE Agitators in Minneapoli…",
    "link": "https://www.breitbart.com/entertainment/2026/01/19/ellen-degeneres-proud-of-anti-ice-agitators-in-minneapolis-sorry-for-anyone-hurt-just-for-protesting/",
    "timestamp": "2026-01-19T16:44:18Z"
  },
  {
    "title": "Tom Morello Slams Trump Admin Over Homeland Security Slogan",
    "description": "Tom Morello blasted Trump online after DHS used a slogan he says echoes a Nazi massacre phrase, calling it an “irrevocable choice.”",
    "link": "https://littlethings.com/entertainment/tom-morello-slams-donald-trump-dhs-slogan",
    "timestamp": "2026-01-19T16:43:55Z"
  },
  {
    "title": "Thanks to the Left’s Extreme Rhetoric, Anti-ICE Agitators Are Now Invading Church Services",
    "description": "On Sunday, anti-ICE agitators invaded a church sanctuary in the middle of service, a shocking escalation arguably inspired by the Left’s extreme rhetoric against immigration... Read More\nThe post Thanks to the Left’s Extreme Rhetoric, Anti-ICE Agitators Are N…",
    "link": "https://www.dailysignal.com/2026/01/19/thanks-lefts-extreme-rhetoric-anti-ice-agitators-now-invading-church-services/",
    "timestamp": "2026-01-19T16:42:59Z"
  },
  {
    "title": "As faith in the US fades a year into Trump 2.0, Europe breaks with reliance on American security",
    "description": "European leaders are increasingly concerned about America's commitment to NATO.",
    "link": "https://www.denverpost.com/2026/01/19/europe-nato-trump/",
    "timestamp": "2026-01-19T16:42:46Z"
  },
  {
    "title": "As faith in the US fades a year into Trump 2.0, Europe breaks with reliance on American security",
    "description": "European leaders are increasingly concerned about America's commitment to NATO.",
    "link": "https://www.bostonherald.com/2026/01/19/europe-nato-trump/",
    "timestamp": "2026-01-19T16:42:46Z"
  },
  {
    "title": "Trump Says He Has 'No Obligation to Think of Peace' After Nobel Snub, Demands Greenland",
    "description": "Trump told Norway's PM he no longer feels obligated to think of peace after Nobel snub, demanding 'complete and total control' of Greenland.",
    "link": "https://www.ibtimes.com/trump-says-he-has-no-obligation-think-peace-after-nobel-snub-demands-greenland-3795640",
    "timestamp": "2026-01-19T16:42:13Z"
  },
  {
    "title": "Hoping for a $2,000 tariff dividend check? Trump is giving mixed messages.",
    "description": "If you have been hoping for a $2,000 tariff rebate check, President Donald Trump gave mixed messages in a recent interview with The New York Times.",
    "link": "https://www.businessinsider.com/trump-tariff-dividend-check-promise-2026-1",
    "timestamp": "2026-01-19T16:40:01Z"
  },
  {
    "title": "Read The Full Exchange Between Norway's Prime Minister And Trump Over Greenland",
    "description": "President Donald Trump cited his Nobel Peace Prize snub as a justification for his push to acquire Greenland in a letter to Norwegian Prime Minister Jonas Gahr Stoere.",
    "link": "https://www.huffpost.com/entry/norway-prime-minister-donald-trump-greenland-exchange_n_696e5bbae4b03601d1a5eec7",
    "timestamp": "2026-01-19T16:39:08Z"
  },
  {
    "title": "Trump's Board of Peace has several invited leaders trying to figure out how it'll work",
    "description": "The European Union, Russia, Belarus, and Thailand are invited to join President Trump's new Gaza peace plan board. Israel objects to the initiative, calling it detrimental. The board will oversee Hamas disarmament and Gaza reconstruction. Meanwhile, humanitar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-board-of-peace-has-several-invited-leaders-trying-to-figure-out-how-itll-work/articleshow/126700117.cms",
    "timestamp": "2026-01-19T16:33:49Z"
  },
  {
    "title": "US futures sink after Trump warns of higher tariffs for 8 countries over Greenland issue",
    "description": "US futures sink after Trump warns of higher tariffs for 8 countries over Greenland issuelocal10.com",
    "link": "https://www.local10.com//business/2026/01/19/us-futures-sink-after-trump-warns-of-higher-tariffs-for-8-countries-over-greenland-issue/",
    "timestamp": "2026-01-19T16:32:29Z"
  },
  {
    "title": "Top US Catholic cardinals question morality of American foreign policy",
    "description": "By Bhargav AcharyaJan 19 (Reuters) - Three U.S. Catholic archbishops on Monday decried the direction of American foreign policy, saying the country’s “moral role in confr… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/19/top-us-catholic-cardinals-question-morality-of-american-foreign-policy",
    "timestamp": "2026-01-19T16:30:56Z"
  },
  {
    "title": "【1月20日】看軍聞學英語",
    "description": "■林國賓 原文： The United States carried out a strike against Islamic State militants in northwest Nigeria at the request of Nigeria's government, President Donald Trump and the U.S. military said on Thursday, claiming the group had been targeting Christians in the…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b960c04b-c22b-47aa-bb42-a854f5dd9ebd",
    "timestamp": "2026-01-19T16:30:00Z"
  },
  {
    "title": "Trump is going to Davos — here are the big names who aren't",
    "description": "A who's who of heads of state, top CEOs and tech pioneers are landing in Davos for the 2026 World Economic Forum meeting. But some big names aren't going.",
    "link": "https://www.cnbc.com/2026/01/19/trump-world-economic-forum-davos-who-isnt-going.html",
    "timestamp": "2026-01-19T16:29:03Z"
  },
  {
    "title": "Jon Jones Issues Warning to Alex Pereira: 'Be Careful What You Wish For'",
    "description": "Jon Jones and Alex Pereira are building up a potential matchup.",
    "link": "https://www.sherdog.com/news/news/Jon-Jones-Issues-Warning-to-Alex-Pereira-Be-Careful-What-You-Wish-For-199795",
    "timestamp": "2026-01-19T16:26:59Z"
  },
  {
    "title": "'Europe is at a total loss': Russia gloats over Greenland tensions",
    "description": "The BBC's Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump's desire to buy Greenland.",
    "link": "https://www.bbc.com/news/articles/c17zpvkddpzo",
    "timestamp": "2026-01-19T16:26:34Z"
  },
  {
    "title": "Spot Bitcoin ETFs Notch $1.4 Billion Weekly Haul, Largest Since Early October",
    "description": "Institutional investors have continued to allocate capital to U.S.-listed spot Bitcoin exchange-traded funds (ETFs).",
    "link": "https://zycrypto.com/spot-bitcoin-etfs-notch-1-4-billion-weekly-haul-largest-since-early-october/",
    "timestamp": "2026-01-19T16:21:14Z"
  },
  {
    "title": "The Asian migrant workers propping up Greenland’s economy",
    "description": "Venturing into the icy seas around Greenland can be unforgiving and unpredictable. Steffen Andersen, a seasoned skipper preparing his six-man trawler for a fishing trip along the craggy coast, was in the mood to complain. He had recently hired a 16-year-old l…",
    "link": "https://freerepublic.com/focus/f-news/4362937/posts",
    "timestamp": "2026-01-19T16:20:16Z"
  },
  {
    "title": "Barron Trump 'Quietly Rekindles Romance With Ex-Girlfriend' After Calling It Quits Late Last Year — 'He's Private and Being Careful About His Next Steps'",
    "description": "The first son is said to have suffered a major heartbreak last fall but is 'regrouping' with his ex-girlfriend.",
    "link": "https://radaronline.com/p/barron-trump-rekindles-romance-ex-girlfriend-after-painful-breakup/",
    "timestamp": "2026-01-19T16:20:04Z"
  },
  {
    "title": "PILLAR OF JIHAD: Jihadist Leaders View Immigration as Key Component to Subvert the U.S.",
    "description": "In his new book \"The Invisible Coup: How American Elites and Foreign Powers Use Immigration as a Weapon,\" Peter Schweizer reveals how jihadist leaders treated mass migration as a means to penetrate, subvert, and ultimately remake the United States from within…",
    "link": "https://www.breitbart.com/politics/2026/01/19/pillar-of-jihad-jihadist-leaders-view-immigration-as-key-component-to-subvert-the-u-s/",
    "timestamp": "2026-01-19T16:19:52Z"
  },
  {
    "title": "Karl Rove Warns That Texas Is Turning Against GOP as Hispanic Support for Trump Craters",
    "description": "Karl Rove warned that Texans are turning against the GOP as Hispanic support for President Donald Trump craters during a recent appearance on Fox News.\nThe post Karl Rove Warns That Texas Is Turning Against GOP as Hispanic Support for Trump Craters first appe…",
    "link": "https://www.mediaite.com/media/tv/karl-rove-warns-that-texas-is-turning-against-gop-as-hispanic-support-for-trump-craters/",
    "timestamp": "2026-01-19T16:19:04Z"
  }
]