[
  {
    "title": "Poland votes in tight election as Europe watches",
    "description": "Poles began voting Sunday in a tight presidential election that will be decisive for the future of the country’s centrist government as well as for abortion and LGBTQ rights. Pro-EU Warsaw mayor Rafal Trzaskowski is expected to get 30 percent, according to op…",
    "link": "https://www.digitaljournal.com/world/poland-votes-in-tight-election-as-europe-watches-2/article",
    "timestamp": "2025-05-18T05:57:20Z"
  },
  {
    "title": "Pam Bondi's Qatar Links Under Scrutiny Over Trump's Luxury Plane Gift",
    "description": "Attorney General Pam Bondi's links to Qatar are under scrutiny again following reports that President Donald Trump will be gifted a luxury plane from the Qatari government. Bondi worked as a foreign lobbyist for the nation of Qatar, earning $115,000 a month i…",
    "link": "https://freerepublic.com/focus/f-news/4317653/posts",
    "timestamp": "2025-05-18T05:41:41Z"
  },
  {
    "title": "Scarlett Johansson closes out ‘SNL’ season 50 with record-breaking return to the studio that changed her life",
    "description": "Scarlett Johansson returns to host Saturday Night Live on May 17, marking her seventh time leading the sketch comedy show. Married to cast member Colin Jost, Johansson will become the most frequent female host in SNL history. The Season 50 finale features rap…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/scarlett-johansson-closes-out-snl-season-50-with-record-breaking-return-to-the-studio-that-changed-her-life/articleshow/121245713.cms",
    "timestamp": "2025-05-18T05:36:19Z"
  },
  {
    "title": "This is why Dick’s Sporting Goods is buying Foot Locker for $2.4 billion and why investors think it’s a huge r",
    "description": "As is the way with the world in the modern age, the uncertainty surrounding Donald Trump and his rash financial decisions are causing chaos for markets across the globe. The latest firm to take the leap in the depths, past the knowable, and see what lies on t…",
    "link": "https://biztoc.com/x/0b69dc2c82f8bf36",
    "timestamp": "2025-05-18T05:35:48Z"
  },
  {
    "title": "Trump budget would cut ocean data and leave boaters, anglers and forecasters scrambling for info",
    "description": "Sweeping research cuts in President Donald Trump's proposed budget would target an ocean-monitoring system that scientists say is crucial to predicting tsunami escape routes and hurricane intensity and helping ships navigate dangerous harbors safely",
    "link": "https://abcnews.go.com/US/wireStory/trump-budget-cut-ocean-data-leave-boaters-anglers-121919248",
    "timestamp": "2025-05-18T05:34:24Z"
  },
  {
    "title": "Poles vote for a new president as security concerns loom large",
    "description": "Poles are voting in a presidential election held at a time of heightened security concerns stemming from the ongoing war in neighboring Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/poles-vote-new-president-security-concerns-loom-large-121919065",
    "timestamp": "2025-05-18T05:34:23Z"
  },
  {
    "title": "Trump's Middle East 'bromance' and Qatar jet controversy lampooned on SNL finale",
    "description": "Saturday Night Live mocks President Trump's foreign policy reset, focusing on a fictional Saudi bromance, a controversial Qatari jet, and Boeing's safety issues.",
    "link": "https://www.foxnews.com/media/trumps-middle-east-bromance-qatar-jet-controversy-lampooned-snl-finale",
    "timestamp": "2025-05-18T05:31:07Z"
  },
  {
    "title": "Moody’s downgrade intensifies investor worry about US fiscal path",
    "description": "A US sovereign downgrade by Moody’s has exacerbated investor worries about a looming debt time-bomb that could spur bond market vigilantes who want to see more fiscal restraint from Washington.",
    "link": "https://www.thehindubusinessline.com/news/world/moodys-downgrade-intensifies-investor-worry-about-us-fiscal-path/article69589739.ece",
    "timestamp": "2025-05-18T05:21:53Z"
  },
  {
    "title": "Canada Says Most Tariffs on US Remain, Pushing Back on Oxford Report",
    "description": "Canada’s finance minister said the government kept 25% retaliatory tariffs on tens of billions of dollars in US goods, disputing a report from a research firm that suggested it had paused the vast majority of those levies.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-says-most-tariffs-on-us-remain-pushing-back-on-oxford-report",
    "timestamp": "2025-05-18T05:18:10Z"
  },
  {
    "title": "Q4 earnings, FII activity, global trends to guide stock markets this week: Analysts",
    "description": "“Additionally, there is growing optimism around the possibility of an early India-US trade deal, which could provide further support to market sentiment,\" Puneet Singhania, Director at Master Trust Group, said",
    "link": "https://www.thehindubusinessline.com/markets/q4-earnings-fii-activity-global-trends-to-guide-stock-markets-this-week-analysts/article69589729.ece",
    "timestamp": "2025-05-18T05:14:20Z"
  },
  {
    "title": "After Brexit, rapprochement? How Trump's America is reuniting Europe",
    "description": "Britain and the European Union are planning a summit in London. They aim to reset relations and sign a defense agreement. This is happening as the United States reduces its global role. Trade and energy cooperation are also on the agenda. Fishing rights and y…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/after-brexit-rapprochement-how-trumps-america-is-reuniting-europe/articleshow/121245507.cms",
    "timestamp": "2025-05-18T05:13:26Z"
  },
  {
    "title": "Netanyahu remembers Amalek",
    "description": "Trump…and the rest of the world…will never fully understand what Oct.7 did to the pride of the nation. Opinion.",
    "link": "https://www.israelnationalnews.com/news/408524",
    "timestamp": "2025-05-18T05:10:53Z"
  },
  {
    "title": "Libraries are cutting back on staff and services after Trump's order to dismantle small agency",
    "description": "Libraries across the United States have cut back on some digital services weeks after the Trump administration's move to dismantle the Institute of Museum and Library Services",
    "link": "https://abcnews.go.com/US/wireStory/libraries-cutting-back-staff-services-after-trumps-order-121918699",
    "timestamp": "2025-05-18T05:10:14Z"
  },
  {
    "title": "\"She Is No Longer Hot\": Donald Trump Takes A Dig At Taylor Swift (Again)",
    "description": "In 2024, Donald Trump criticised Taylor Swift and said, &quot;I hate her&quot;",
    "link": "https://www.ndtv.com/entertainment/donald-trump-takes-a-dig-at-taylor-swift-again-she-is-no-longer-hot-8443120",
    "timestamp": "2025-05-18T05:09:24Z"
  },
  {
    "title": "Analysis-Moody's downgrade intensifies investor worry about US fiscal path",
    "description": "NEW YORK (Reuters) -A U.S. sovereign downgrade by Moody's has exacerbated investor worries about a looming debt time-bomb that could spur bond market vigilan...",
    "link": "https://www.aol.com/news/analysis-moodys-downgrade-intensifies-investor-050717596.html",
    "timestamp": "2025-05-18T05:07:17Z"
  },
  {
    "title": "Moody's downgrade intensifies investor worry about US fiscal path",
    "description": "Moody's has downgraded America's credit rating. This has increased investor concerns about rising debt. Republicans are trying to pass tax cuts and spending changes. This could increase the debt. Investors are worried about the final bill. The bond market is …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/moodys-downgrade-intensifies-investor-worry-about-us-fiscal-path/articleshow/121245408.cms",
    "timestamp": "2025-05-18T05:05:52Z"
  },
  {
    "title": "Trump shrugs off Netanyahu on gulf tour",
    "description": "Donald Trump's recent Middle East tour signals a shift in US foreign policy. It appears Israel is no longer the central focus. Trump engaged with Saudi Arabia, Qatar, and the UAE, pursuing peace deals and economic partnerships. He lifted sanctions on Syria an…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-shrugs-off-netanyahu-on-gulf-tour/articleshow/121245349.cms",
    "timestamp": "2025-05-18T05:00:34Z"
  },
  {
    "title": "Palantir’s high-altitude rally defies the doubters and ‘cynics’",
    "description": "Investors chase AI and defence tech group’s stock to $300bn market cap despite analyst fears it is ‘priced for beyond perfection’",
    "link": "https://www.irishtimes.com/your-money/2025/05/18/palantirs-high-altitude-rally-defies-the-doubters-and-cynics/",
    "timestamp": "2025-05-18T05:00:00Z"
  },
  {
    "title": "Kevin Spacey to Make Surprise Appearance in Cannes to Accept a Lifetime Achievement Award (EXCLUSIVE)",
    "description": "Kevin Spacey is set to return to the Cannes Film Festival for the first time in almost a decade to collect a lifetime achievement honor. The two-time Oscar winner was last in Cannes in 2016, when he served as emcee for the amfAR gala and ripped into Donald Tr…",
    "link": "https://variety.com/2025/film/global/kevin-spacey-surprise-appearance-cannes-award-1236401716/",
    "timestamp": "2025-05-18T05:00:00Z"
  },
  {
    "title": "Trump lashes out at Walmart after retailer says they'll have to raise prices due to tariffs",
    "description": "President Donald Trump lashed out at Walmart after the retailer said it is likely to start rolling out tariff-induced price hikes soon.",
    "link": "https://biztoc.com/x/a2f5af69b5da24bf",
    "timestamp": "2025-05-18T04:56:39Z"
  },
  {
    "title": "Trump slams ABC News for Qatar plane coverage",
    "description": "United States President Donald Trump criticized ABC News for its coverage of the Boeing 747 airplane he said was donated to the Air Force (USAF) and the Department of Defense (DoD) by Qatar.In a post ...",
    "link": "https://biztoc.com/x/4e658952cf360961",
    "timestamp": "2025-05-18T04:51:28Z"
  },
  {
    "title": "SNL season finale cold open ridicules Trump boasting about ‘pre-bribe’ of $400m Qatar jet: ‘I did very well on this trip, got a lot of cool stuff’",
    "description": "James Austin Johnson returns once again to play the president as flagship NBC show closes out 50th season",
    "link": "https://www.the-independent.com/arts-entertainment/tv/snl-cold-open-trump-qatar-b2753129.html",
    "timestamp": "2025-05-18T04:47:27Z"
  },
  {
    "title": "이재명 한국 대통령 연임 가능할까?",
    "description": "Tesla pulls all the demand levers with discounts and incentives as sales crash https://t.co/8sBH8nsO1h by @fredericlambert— Electrek.co (@ElectrekCo) May 17, 2025 CEO of Novo Nordisk, maker of weight loss drug Wegovy, to step down in wake of share price drop …",
    "link": "https://ryueyes11.tistory.com/511634",
    "timestamp": "2025-05-18T04:19:30Z"
  },
  {
    "title": "Polish presidential election to test if PM's pro-EU vision is Trump-proof",
    "description": "WARSAW (Reuters) -Poles vote on Sunday in a presidential election that will decide whether Warsaw follows the pro-European path set by Prime Minister Donald Tusk, or takes a step towards bringing back nationalist admirers of U.S. President Donald Trump. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/05/18/polish-presidential-election-to-test-if-pm039s-pro-eu-vision-is-trump-proof",
    "timestamp": "2025-05-18T04:12:00Z"
  },
  {
    "title": "‘SNL’ Cold Open: Trump Bails on Sketch to Flirt With Audience",
    "description": "In the season 50 finale, Trump recaps his Middle East tour before taking a load off in the front row of the audience, surrounded by women",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-cold-open-donald-trump-bails-sketch-flirt-audience-1235342065/",
    "timestamp": "2025-05-18T04:10:23Z"
  },
  {
    "title": "One killed in Kyiv region as Russia steps up attacks after peace talks, Ukraine says",
    "description": "KYIV (Reuters) -A sustained overnight Russian drone attack killed a woman in the capital region and injured at least three people, including a child, Ukrainian authorities said early on Sunday, as Moscow stepped up its attacks following peace talks on Friday.…",
    "link": "https://www.thestar.com.my/news/world/2025/05/18/one-killed-in-kyiv-region-as-russia-steps-up-attacks-after-peace-talks-ukraine-says",
    "timestamp": "2025-05-18T04:06:00Z"
  },
  {
    "title": "That time the NFL came to Toronto",
    "description": "Toronto has a plethora of sports teams. From hockey to basketball to baseball, there are no shortage of opportunities to watch a high-level, A-tier game in town.While football fans have the CFL's Toronto Argonauts (who obviously do very well for themselves), …",
    "link": "https://www.blogto.com/sports_play/2025/05/nfs-toronto-buffalo-bills-rogers-centre/",
    "timestamp": "2025-05-18T04:06:00Z"
  },
  {
    "title": "The Gulf States have Long Boosted US Economic Dominance, even if not every President Got a Free Private Jet",
    "description": "By Adam Hanieh, University of Exeter (The Conversation) - After signing a US$142 billion (£107 billion) arms deal with Saudi Arabia, Donald Trump said the US bond with that country was “more powerful than ever”. He was also reportedly quite pleased with the g…",
    "link": "https://www.juancole.com/2025/05/economic-dominance-president.html",
    "timestamp": "2025-05-18T04:04:21Z"
  },
  {
    "title": "A confused man named Joe",
    "description": "Bit by bit, we are learning that President Biden’s elevator didn’t always go to the top floor. It’s a sad thing to imagine because there was a nuclear button around this man. Well, we think that it was around him, but maybe the famo...",
    "link": "https://www.americanthinker.com/blog/2025/05/a_confused_man_named_joe.html",
    "timestamp": "2025-05-18T04:00:00Z"
  },
  {
    "title": "Democrats nothing more than contrarians to Trump",
    "description": "In an amusing twist, many Democrats have come out against President Trump’s plan to cut prescription drug prices, raising the distinct possibility that there is nothing — absolutely nothing—that Trump could propose of which they wou...",
    "link": "https://www.americanthinker.com/blog/2025/05/democrats_nothing_more_than_contrarians_to_trump.html",
    "timestamp": "2025-05-18T04:00:00Z"
  },
  {
    "title": "Bruce Springsteen trashes America",
    "description": "The legacy media made sure the entire world would know that Bruce Springsteen was attacking America, and more specifically, Donald Trump. It was a vicious attack, and inappropriate to a concert setting.\r\n\r\nMy strong reaction surprised me, so examinin...",
    "link": "https://www.americanthinker.com/blog/2025/05/bruce_springsteen_trashes_america.html",
    "timestamp": "2025-05-18T04:00:00Z"
  },
  {
    "title": "Trump Pushes U.S. Federal Reserve For Rate Cuts, Criticizes Powell",
    "description": "Trump on Saturday said in a social media post the U.S. Federal Reserve should cut rates \"sooner, rather than later.\"",
    "link": "https://www.huffpost.com/entry/trump-federal-reserve-rate-cuts-jerome-powell_n_682958aee4b0f62057454711",
    "timestamp": "2025-05-18T03:53:43Z"
  },
  {
    "title": "‘Saturday Night Live’ Opens With “Fake” Donald Trump Defending Qatar’s “Gift” Of A Jumbo Jet — An Hour After The Real POTUS Did The Same",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_94190164-8002-426c-b32d-2d50c55e51f0",
    "timestamp": "2025-05-18T03:52:34Z"
  },
  {
    "title": "‘Saturday Night Live’ Opens With Show’s “Fake” Donald Trump Saying So Long For The Season: “The Real One Will Still Be Omnipresent”",
    "description": "Saturday Night Live opened its season finale with the show’s Donald Trump (James Austin Johnson) taking his seat in the audience and saying farewell until the fall. “After tonight, you won’t be seeing me here for a while,” said Johnson’s Trump. “Well, not the…",
    "link": "http://deadline.com/2025/05/saturday-night-live-trump-middle-east-1236402661/",
    "timestamp": "2025-05-18T03:52:34Z"
  },
  {
    "title": "SNL 50 Cold Open: Trump Loves The Middle East, Morgan Wallen Jokes",
    "description": "With NBC's Saturday Night Live wrapping up Season 50 tonight with host Scarlett Johansson (Jurassic World Rebirth) and musical guest Bad Bunny, we were wondering what SNL would be targeting with its final Cold Open until the fall. Donald Trump (James Austin J…",
    "link": "https://bleedingcool.com/tv/snl-50-cold-open-trump-loves-the-middle-east-morgan-wallen-jokes/",
    "timestamp": "2025-05-18T03:51:07Z"
  },
  {
    "title": "Ex-jihadists with Al-Qaida and Lashkar-e-Taiba links join Trump’s Religious Freedom Advisory board",
    "description": "Two former US jihadists, one trained at Lashkar-e-Taiba’s terror camp in Pakistan, have been appointed to the White House Advisory Board of Lay Leaders under Donald Trump. Ismail Royer, convicted for supporting terror activities including attacks in Kashmir, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ex-jihadists-with-al-qaida-and-lashkar-e-taiba-links-join-trumps-religious-freedom-advisory-board/articleshow/121244523.cms",
    "timestamp": "2025-05-18T03:46:38Z"
  },
  {
    "title": "Orban: EU Should Follow US on Ukraine",
    "description": "The Hungarian Prime Minister, Viktor Orban, has stated that there is no point in Europe going down different paths with the US.",
    "link": "https://sputnikglobe.com/20250518/orban-eu-should-follow-us-on-ukraine-1122074598.html",
    "timestamp": "2025-05-18T03:43:00Z"
  },
  {
    "title": "Pinkerton: Leo XIV and the Search for a New Social Contract in the Age of AI",
    "description": "Artificial Intelligence could enrich and enslave us—perhaps one or the other, perhaps both at the same time.  So, even non-Catholics should appreciate that Pope Leo XIV is summoning his Church to build a fortress for the free will of faith—the right of each s…",
    "link": "https://www.breitbart.com/faith/2025/05/17/pinkerton-leo-xiv-and-the-search-for-a-new-social-contract-in-the-age-of-ai/",
    "timestamp": "2025-05-18T03:40:21Z"
  },
  {
    "title": "Chinese companies eye Singapore listings to expand markets amid trade war",
    "description": "At least five Chinese and HK firms eye listings on SGX. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/some-chinese-companies-eye-singapore-listings-to-expand-markets-amid-trade-war",
    "timestamp": "2025-05-18T03:39:14Z"
  },
  {
    "title": "Trump Says Walmart Should 'Eat the Tariffs' Instead of Raising Prices",
    "description": "Walmart said last week it might have to raise prices because of Trump's tariffs.\n- Trump was not happy about it.\n- The president said Walmart made \"billions of dollars\" in 2024 and should \"eat the tariffs.\"\nPresident Donald Trump said on Saturday that Walmart…",
    "link": "https://biztoc.com/x/3e5e16675001a319",
    "timestamp": "2025-05-18T03:33:22Z"
  },
  {
    "title": "Sen. Markwayne Mullin: Plane from Qatar 'Has Been in Negotiations' Under Biden AdminIstration",
    "description": "Sen. Markwayne Mullin (R-OK) pointed out that talks regarding Qatar giving the United States a plane to temporarily replace Air Force One began under the Biden administration.\nThe post Sen. Markwayne Mullin: Plane from Qatar ‘Has Been in Negotiations’ Under B…",
    "link": "https://www.breitbart.com/politics/2025/05/17/sen-markwayne-mullin-plane-from-qatar-has-been-in-negotiations-under-biden-administration/",
    "timestamp": "2025-05-18T03:32:14Z"
  },
  {
    "title": "Trump Wants to Meet With Putin as Soon as Feasible - Rubio",
    "description": "US President Donald Trump wants to hold a meeting with Russian President Vladimir Putin as soon as feasible, US Secretary of State Marco Rubio said on Saturday.",
    "link": "https://sputnikglobe.com/20250518/trump-wants-to-meet-with-putin-as-soon-as-feasible---rubio-1122074484.html",
    "timestamp": "2025-05-18T03:21:00Z"
  },
  {
    "title": "Firefighter named among the dead after responding to tornado in southeastern Kentucky",
    "description": "The Laurel County Fire Department in Kentucky says that one of their firefighters is among the dead after responding to a call related to a tornado that tore through the southeastern part of the state Friday night.",
    "link": "https://www.wlwt.com/article/kentucky-firefighter-named-among-the-dead-after-tornado/64802646",
    "timestamp": "2025-05-18T03:18:07Z"
  },
  {
    "title": "Trump plans talks with Putin, Zelensky to push for Ukraine ceasefire",
    "description": "WASHINGTON DC: US President Donald Trump announced he plans to speak with Russian President Vladimir Putin by phone on Monday in an effort to help end the conflict in Ukraine, referring to the discussion as an attempt to stop the “bloodbath.” In a message pos…",
    "link": "https://english.khabarhub.com/2025/18/468009/",
    "timestamp": "2025-05-18T03:15:14Z"
  },
  {
    "title": "Bruce Springsteen Calls Out 'Unfit President' Trump Again on Stage",
    "description": "Bruce Springsteen resumed denouncing Donald Trump on stage Saturday night (May 17) in Manchester, England, after Trump called him \"dumb as a rock.\"",
    "link": "http://www.billboard.com/music/music-news/bruce-springsteen-trump-unfit-president-stage-speech-1235974885/",
    "timestamp": "2025-05-18T03:12:08Z"
  },
  {
    "title": "Romania votes in second round of presidential election",
    "description": "Polls have opened for the second round of Romania's presidential election - with little separating centrist candidate Nicusor Dan from the populist George Simion.",
    "link": "https://news.sky.com/story/romania-votes-in-second-round-of-presidential-election-with-bucharest-mayor-and-hard-right-trump-supporter-almost-tied-in-polls-13370049",
    "timestamp": "2025-05-18T03:00:00Z"
  },
  {
    "title": "Transactional diplomacy: Israel must defends its interests, not rely on Trump's whims",
    "description": "Israel must recognize that there may be moments when it will need to act to protect its core interests, even in the face of American objections.",
    "link": "https://www.jpost.com/opinion/article-854337",
    "timestamp": "2025-05-18T02:58:45Z"
  },
  {
    "title": "'I give these SleazeBags fair warning!' Trump unloads over 'free' plane coverage",
    "description": "Donald Trump on Saturday lobbed an apparent threat of litigation at ABC.Taking to his own social media site, Truth Social, the president asked, \"Why doesn’t Chairman Bob Iger do something about ABC Fake News, especially since I just won $16,000,000 based on t…",
    "link": "https://www.rawstory.com/trump-qatar-abc-coverage-law/",
    "timestamp": "2025-05-18T02:49:23Z"
  },
  {
    "title": "Libya won't want to host a million Gazans – so the humanitarian crisis will steer the course of the war",
    "description": "Trump reportedly wants to move Gazans to the North African state in exchange for billions of dollars – an improbable move, as Libya has been embroiled in a bloody civil war for over a decade. That leaves Israel with the dangerous burden of handling administra…",
    "link": "https://www.haaretz.com/israel-news/2025-05-18/ty-article/.premium/libya-wont-host-gazans-refugees-the-humanitarian-disaster-will-shape-the-war/00000196-e059-d6c4-a9d7-ead982eb0000",
    "timestamp": "2025-05-18T02:44:13Z"
  },
  {
    "title": "Netanyahu is driving Gideon's Chariots to Gaza, but Trump might still put a spoke in the wheels",
    "description": "Military pressure helped bring Hamas back to the negotiating table, but it didn't guarantee progress in the cease-fire talks. The IDF preparations in Gaza, meanwhile, are for a more minor operation than the army promised",
    "link": "https://www.haaretz.com/israel-news/2025-05-18/ty-article/.premium/netanyahu-drives-gideons-chariots-into-gaza-trump-could-still-put-a-spoke-in-the-wheels/00000196-dfd5-d6c4-a9d7-ffddae2f0000",
    "timestamp": "2025-05-18T02:43:04Z"
  },
  {
    "title": "John Nolte of Breitbart News Breaks Down the Media’s Real Motives in Covering Joe Biden’s Mental Decline (VIDEO)",
    "description": "John Nolte of Breitbart News recently made a video with Alex Marlow, also of Breitbart, where they discussed the Jake Tapper book about Biden’s mental decline and the media coverage of the story.\nThe post John Nolte of Breitbart News Breaks Down the Media’s R…",
    "link": "https://www.thegatewaypundit.com/2025/05/john-nolte-breitbart-news-breaks-down-medias-real/",
    "timestamp": "2025-05-18T02:40:27Z"
  },
  {
    "title": "Rich Rodriguez shows interest joining Nick Saban on Trump's College Sports Commission",
    "description": "May 17—President Donald Trump can be seen at college football games, UFC events, and even NASCAR races. Trump enjoys appearing at sporting events, and recently has entered himself into the college athletics space, attempting to create order in a wild west tha…",
    "link": "https://www.dominionpost.com/2025/05/17/rich-rodriguez-shows-interest-joining-nick-saban-on-trumps-college-sports-commission/",
    "timestamp": "2025-05-18T02:37:00Z"
  },
  {
    "title": "Rich Rodriguez shows interest joining Nick Saban on Trump's College Sports Commission",
    "description": "May 17—President Donald Trump can be seen at college football games, UFC events, and even NASCAR races. Trump enjoys appearing at sporting events, and recently has entered himself into the college athletics space, attempting to create order in a wild west tha…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c509d51e-22ef-4d5b-a58a-e736f90104e9",
    "timestamp": "2025-05-18T02:37:00Z"
  },
  {
    "title": "'You saved my life:' Freed hostage Edan Alexander thanks Trump in emotional phone call",
    "description": "President Donald Trump speaks with Edan Alexander, an American-Israeli soldier freed from Hamas captivity, showing a more human side to the ongoing war against Hamas.",
    "link": "https://www.foxnews.com/politics/you-saved-my-life-freed-hostage-edan-alexander-thanks-president-trump-emotional-phone-call",
    "timestamp": "2025-05-18T02:30:10Z"
  },
  {
    "title": "Supreme Court 'directly communicated' profane response to Stephen Miller: lawyer",
    "description": "Donald Trump's White House Deputy Chief of Staff Stephen Miller got a \"direct\" message from seven of nine Supreme Court justices, a former federal prosecutor said Saturday.\n\nEx-prosecutor Glenn Kirschner over the weekend published a video entitled, \"The Supre…",
    "link": "https://www.rawstory.com/supreme-court-direct-message-miller/",
    "timestamp": "2025-05-18T02:25:27Z"
  },
  {
    "title": "Trump must not leave Israel out of his Middle East deals",
    "description": "May in Israel fear that President Trump is falling in love with a kumbaya fantasy about the Middle East that could end up further isolating and endangering the embattled Jewish state.",
    "link": "https://nypost.com/2025/05/17/opinion/trump-must-not-leave-israel-out-of-his-middle-east-deals/",
    "timestamp": "2025-05-18T02:14:12Z"
  },
  {
    "title": "Trump to Walmart: Make less money",
    "description": "President Donald Trump lashed out at Walmart (WMT) on Saturday, pressuring the retail giant not to raise prices after it warned that his trade war policies would force it to do so.Read more...",
    "link": "https://qz.com/trump-walmart-prices-tariffs-inflation-1851781194",
    "timestamp": "2025-05-18T02:12:00Z"
  },
  {
    "title": "Trump to Walmart: Make less money",
    "description": "President Donald Trump lashed out at Walmart (WMT) on Saturday, pressuring the retail giant not to raise prices after it warned that his trade war policies...",
    "link": "https://finance.yahoo.com/news/trump-walmart-less-money-021200585.html",
    "timestamp": "2025-05-18T02:12:00Z"
  },
  {
    "title": "Walmart’s tariff troubles begin to bite but company posts first profitable quarter in e-commerce",
    "description": "Walmart’s latest earnings report reveals early signs of pressure from rising tariffs even as it celebrates its first profitable quarter in e-commerce. With CFO John David Rainey warning of price hikes and CEO Doug McMillon outlining trade-related challenges, …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/walmarts-tariff-troubles-begin-to-bite-but-company-posts-first-profitable-quarter-in-e-commerce/articleshow/121244200.cms",
    "timestamp": "2025-05-18T02:07:34Z"
  },
  {
    "title": "Poland votes in tight election as Europe watches",
    "description": "Poles vote on Sunday in a tight presidential election that will be decisive for the future of the country’s centrist government as well as for abortion and LGBTQ rights. Pro-EU Warsaw mayor Rafal Trzaskowski is expected to get 30 percent, ahead of nationalist…",
    "link": "https://www.digitaljournal.com/world/poland-votes-in-tight-election-as-europe-watches/article",
    "timestamp": "2025-05-18T02:07:20Z"
  },
  {
    "title": "Poland Votes In Tight Election As Europe Watches",
    "description": "Poles vote on Sunday in a tight presidential election that will be decisive for the future of the country's centrist government as well as for abortion and LGBTQ rights.",
    "link": "https://www.ibtimes.com/poland-votes-tight-election-europe-watches-3773863",
    "timestamp": "2025-05-18T02:06:07Z"
  },
  {
    "title": "Bruce Springsteen Gives Trump the Middle Finger with Another Defiant Concert",
    "description": "Despite a threat from Donald Trump to shut his mouth — or else, Bruce Springsteen stood his ground, unleashing another blistering critique of the president during a concert in Manchester, England.",
    "link": "https://consequence.net/2025/05/springsteen-trump-middle-finger-concert/",
    "timestamp": "2025-05-18T02:04:47Z"
  },
  {
    "title": "Pope Leo Backs Populist Pro-Family Policies to Promote 'Stable Union Between a Man and a Woman'",
    "description": "In an address to members of the Vatican's Diplomatic Corps, Pope Leo XIV stressed the fundamental importance of the union between men and women as the bedrock of civilisation. The Pontiff argued that governments should invest in family formation to foster mor…",
    "link": "https://www.breitbart.com/europe/2025/05/17/pope-leo-backs-populist-pro-family-policies-to-promote-stable-union-between-a-man-and-a-woman/",
    "timestamp": "2025-05-18T02:00:24Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino: James Comey 'brought shame to the FBI again' with '86 47' post",
    "description": "Dan Bongino, the FBI's deputy director, condemned former FBI Director James Comey's \"86 47\" social media post as the FBI and Secret Service investigate potential threats.",
    "link": "https://www.foxnews.com/politics/fbi-deputy-director-dan-bongino-james-comey-shame-fbi-badge-again-86-47-post",
    "timestamp": "2025-05-18T01:47:17Z"
  },
  {
    "title": "FBI calls deadly California clinic bombing an 'act of terrorism'",
    "description": "A bomb exploded outside a fertility clinic in Palm Springs, California, resulting in one fatality and multiple injuries. The FBI is investigating the incident as an act of terrorism, with evidence suggesting the clinic was deliberately targeted. The explosion…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fbi-calls-deadly-california-clinic-bombing-an-act-of-terrorism/articleshow/121244113.cms",
    "timestamp": "2025-05-18T01:43:57Z"
  },
  {
    "title": "Federal Appeals Court Bats Down Clinton Judge, Lifts Block on Trump’s Executive Order to Strip Federal Workers’ Union Rights",
    "description": "Last month a federal judge blocked President Trump’s executive order to strip federal workers of their ‘collective bargaining’ rights.\nThe post Federal Appeals Court Bats Down Clinton Judge, Lifts Block on Trump’s Executive Order to Strip Federal Workers’ Uni…",
    "link": "https://www.thegatewaypundit.com/2025/05/federal-appeals-court-bats-down-clinton-judge-lifts/",
    "timestamp": "2025-05-18T01:40:39Z"
  },
  {
    "title": "Trump warns Walmart: Don't raise prices due to my tariffs but do eat the costs from those taxes",
    "description": "President Donald Trump has ripped into Walmart, saying on social media that the retail giant should eat the additional costs created by his tariffs",
    "link": "https://www.wftv.com/news/trump-warns-walmart/IOWNVIZOFFF3JBNIGPWELTVW6Q/",
    "timestamp": "2025-05-18T01:34:47Z"
  },
  {
    "title": "Pope Leo stands as a counterpoint to Trump’s polarising leadership",
    "description": "Despite reservations about his US background, Leo’s ties to the Global South and support for the marginalised have won him global acceptance.",
    "link": "https://www.scmp.com/opinion/world-opinion/article/3310259/pope-leo-stands-counterpoint-trumps-polarising-leadership",
    "timestamp": "2025-05-18T01:30:08Z"
  },
  {
    "title": "Shane Ross: Donald Trump wants to be the ultimate peacemaker – and we should indulge his narcissism if it means lives will be saved",
    "description": "Is Donald Trump chasing the Nobel Peace Prize?",
    "link": "https://www.independent.ie/opinion/comment/shane-ross-donald-trump-wants-to-be-the-ultimate-peacemaker-and-we-should-indulge-his-narcissism-if-it-means-lives-will-be-saved/a433133862.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Letters: Catherine Corless never forgot the discarded Tuam babies and was a towering advocate for those children",
    "description": "Madam — Wayne O’Connor’s poignant article highlighting that the gentle excavation of the remains of up to 796 babies in Tuam will commence in a few weeks’ time brings some relief.",
    "link": "https://www.independent.ie/opinion/letters/letters-catherine-corless-never-forgot-the-discarded-tuam-babies-and-was-a-towering-advocate-for-those-children/a1151415227.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Brendan O’Connor: With the camels and sheikhs and ‘YMCA’, Baby Trump’s Big Day Out was a blessed relief",
    "description": "It was like high-end childcare. For the rest of the world, it was like if you were really struggling and someone surprised you by offering to take your toddler off your hands for a few days, to give you a break.",
    "link": "https://www.independent.ie/opinion/comment/brendan-oconnor-with-the-camels-and-sheikhs-and-ymca-baby-trumps-big-day-out-was-a-blessed-relief/a1601820488.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Donald Trump to speak with Putin and Zelensky by phone as Ukraine condemns Russia for killing nine bus passengers",
    "description": "US president Donald Trump says he will speak by phone tomorrow with Russian leader Vladimir Putin about the war in Ukraine.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-to-speak-with-putin-and-zelensky-by-phone-as-ukraine-condemns-russia-for-killing-nine-bus-passengers/a310303911.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "The Sunday Independent’s view: Ten years on, what unites us as the marriage equality referendum did?",
    "description": "This Thursday will mark the 10th anniversary of the marriage equality referendum.",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-ten-years-on-what-unites-us-as-the-marriage-equality-referendum-did/a1223886252.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Despite the tariff-shaped clouds, the future is still bright for Irish jobs",
    "description": "The precarious position of Ireland’s jobs market became abundantly clear in early April, when Taoiseach Micheál Martin called for calm not even 24 hours ­after Donald Trump announced tariffs on EU goods entering the US.",
    "link": "https://www.independent.ie/business/irelands-best-employers/despite-the-tariff-shaped-clouds-the-future-is-still-bright-for-irish-jobs/a1475604562.html",
    "timestamp": "2025-05-18T01:29:00Z"
  },
  {
    "title": "It's one of the most rowdy US sporting events. Here's what Preakness says about the economy",
    "description": "The Maryland tradition attracts a mix of socioeconomic classes. But this year, the tradition has been thrown into question.",
    "link": "https://www.bbc.com/news/articles/c2lk0zq7kg5o",
    "timestamp": "2025-05-18T01:24:23Z"
  },
  {
    "title": "Bomb At Fertility Clinic In California Kills One",
    "description": "An explosion outside a California fertility clinic killed one person in what the local mayor described as a bomb attack.",
    "link": "https://www.ndtv.com/world-news/bomb-at-fertility-clinic-in-california-kills-one-8442203",
    "timestamp": "2025-05-18T01:22:39Z"
  },
  {
    "title": "Trump’s deals cast China both as foe and prize, blurring signals",
    "description": "Pick through the details of recent U.S. trade negotiations and an outline of Donald Trump’s vision for the global economy starts to come into focus. As do its contradictions.",
    "link": "https://www.japantimes.co.jp/business/2025/05/18/economy/china-trump-trade-strategy-focus/",
    "timestamp": "2025-05-18T01:15:00Z"
  },
  {
    "title": "Isro's PSLV-C61/EOS-09 launch mission fails",
    "description": "ISRO's PSLV-C61 mission, intended to deploy the EOS-09 earth observation satellite, failed after normal performance until the second stage. An observation during the third stage led to the mission's incompletion. This was the third failure for PSLV, despite t…",
    "link": "https://timesofindia.indiatimes.com/science/isros-pslv-c61/eos-09-launch-mission-fails/articleshow/121243904.cms",
    "timestamp": "2025-05-18T01:13:24Z"
  },
  {
    "title": "MAGA 'intimidation' of judges puts their families' safety at 'high risk': expert",
    "description": "President Donald Trump has issued countless executive orders since returning to the White House almost four months ago, and some of them are being blocked — at least temporarily — by judges in the lower federal courts.Trump and many of his appointees, includi…",
    "link": "https://www.rawstory.com/trump-maga-judge-intimidation/",
    "timestamp": "2025-05-18T00:53:16Z"
  },
  {
    "title": "Trump Tells Walmart to ‘Eat the Tariffs’ As Company Warns of ‘Higher Prices’",
    "description": "Donald Trump warned Walmart not to raise prices after the company said it would have to do so “given the magnitude of the tariffs.”",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-walmart-eat-tariffs-china-higher-prices-trade-war-1235342061/",
    "timestamp": "2025-05-18T00:52:04Z"
  },
  {
    "title": "Frigate Touted By Trump Is Among Navy’s ‘Least Performing’ Programs",
    "description": "By Tony Capaccio May 13, 2025 (Bloomberg) –A $22 billion frigate project that President Donald Trump once touted as “the most beautiful, they look like yachts” was among the US Navy’s...",
    "link": "https://gcaptain.com/frigate-touted-by-trump-is-among-navys-least-performing-programs/",
    "timestamp": "2025-05-18T00:48:51Z"
  },
  {
    "title": "Bomb at fertility clinic in California kills one",
    "description": "LOS ANGELES (UNITED STATES) - An explosion outside a California fertility clinic Saturday killed one person in what the local mayor described as a bomb attack.",
    "link": "https://www.bangkokpost.com/world/3028255/bomb-at-fertility-clinic-in-california-kills-one",
    "timestamp": "2025-05-18T00:45:00Z"
  },
  {
    "title": "Seven Virginia governors celebrate Brown v. Board of Education; Wilder skips event",
    "description": "Gov. Glenn Youngkin and six other Virginia governors celebrate the 71st anniversary of the Supreme Court's landmark decision barring government-sanctioned school segregation. Former Gov. Doug Wilder boycotted the event, criticizing Youngkin's actions on DEI.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_80b0e2cc-7223-4d16-a7e9-72018fb7c495.html",
    "timestamp": "2025-05-18T00:43:00Z"
  },
  {
    "title": "House Republicans introduce legislation that would bar Comey from federal positions",
    "description": "The resolution comes after Comey shared a post on Instagram that appeared to call for the removal or assassination of President Donald Trump. The Thursday post showed the numbers \"8647\" etched in the sand at a beach via seashells. Lawmakers on the House Repub…",
    "link": "https://freerepublic.com/focus/f-news/4317628/posts",
    "timestamp": "2025-05-18T00:41:23Z"
  },
  {
    "title": "ISRO’s 101st Mission: PSLV-C61 Launches All-Weather EOS-09, Boosts India’s Satellite Surveillance",
    "description": "ISRO marked its 101st mission milestone with the successful launch of PSLV-C61, deploying the EOS-09 earth observation satellite into a sun-synchronous polar orbit. This radar imaging satellite, equipped with Synthetic Aperture Radar (SAR), enhances India's s…",
    "link": "https://timesofindia.indiatimes.com/science/isros-101st-mission-pslv-c61-launches-all-weather-eos-09-boosts-indias-satellite-surveillance/articleshow/121242923.cms",
    "timestamp": "2025-05-18T00:31:03Z"
  },
  {
    "title": "Sebastian Stan’s Marvel Role Was Almost Very Different (Would It Have Been Better?)",
    "description": "Winter Soldier holding Captain America's shield in the MCU.\nThere are countless stories of actors missing out on superhero roles. Sometimes, a big star passes on a part because it’s not right for them, such as Amanda Seyfried turning down the chance to play G…",
    "link": "http://comicbook.com/movies/news/would-sebastian-stan-captain-america-have-been-better/",
    "timestamp": "2025-05-18T00:30:00Z"
  },
  {
    "title": "Four days that took India and Pakistan to the brink",
    "description": "The BBC visits families in Kashmir devastated by the deadliest clashes in years, and speaks to military insiders.",
    "link": "https://www.bbc.com/news/articles/cvgvr4r5d2qo",
    "timestamp": "2025-05-18T00:08:56Z"
  },
  {
    "title": "Defence deals and palace invites: UK and EU haggle before first summit since Brexit",
    "description": "Defence deals, fishing rights and closer economic ties among the talking points at Downing Street.",
    "link": "https://www.bbc.com/news/articles/ckg4r54kd8do?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-18T00:00:10Z"
  },
  {
    "title": "Defence deals and palace invites: UK and EU haggle before first summit since Brexit",
    "description": "Defence deals, fishing rights and closer economic ties among the talking points at Downing Street.",
    "link": "https://www.bbc.com/news/articles/ckg4r54kd8do",
    "timestamp": "2025-05-18T00:00:04Z"
  },
  {
    "title": "Democrats and Journalists Still Avoid Biden’s Decline",
    "description": "The first excerpts of the Jake Tapper-Alex Thompson book on denying former President Joe Biden’s obvious mental decline have been posted, and you can already... Read More\nThe post Democrats and Journalists Still Avoid Biden’s Decline appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/05/17/democrats-and-journalists-still-avoid-bidens-decline/",
    "timestamp": "2025-05-18T00:00:00Z"
  },
  {
    "title": "Pedro Pascal urges filmmakers to resist Trump",
    "description": "Chilean-American actor Pedro Pascal issued an expletive-laced call for Hollywood to resist political pressure in the United States on Saturday while admitting it is \"scary\" to speak out against President Donald Trump. Asked about Trump's immigration policies,…",
    "link": "https://timesofindia.indiatimes.com/news/pedro-pascal-urges-filmmakers-to-resist-trump-its-very-scary-to-speak-to-issues-like-this/articleshow/121243092.cms",
    "timestamp": "2025-05-17T23:58:36Z"
  },
  {
    "title": "Trump says he will call Putin, then Zelenskyy, on Monday to push for Ukraine ceasefire",
    "description": "KYIV, Ukraine (AP) — U.S. President Donald Trump said he plans to speak by phone Monday with Russian leader Vladimir Putin, followed by Ukrainian President Volodymyr Zelenskyy and leaders of various NATO countries, about ending the war in Ukraine. Trump said …",
    "link": "https://freerepublic.com/focus/f-news/4317619/posts",
    "timestamp": "2025-05-17T23:48:27Z"
  },
  {
    "title": "UK to strike new deal with EU in coming days: PM's office",
    "description": "LONDON - UK Prime Minister Keir Starmer is set to sign a new deal with the EU seeking to reset ties after Brexit, his office said Saturday ahead of landmark talks.",
    "link": "https://www.bangkokpost.com/world/3028260/uk-to-strike-new-deal-with-eu-in-coming-days-pms-office",
    "timestamp": "2025-05-17T23:43:00Z"
  },
  {
    "title": "Canada PM Carney reaffirms support for Ukraine in first meeting with Zelenskiy",
    "description": "TORONTO (Reuters) -Canadian Prime Minister Mark Carney on Saturday reaffirmed the country's support for Ukraine in his first face-to-face meeting with Ukrainian President Volodymyr Zelenskiy since winning the election. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/18/canada-pm-carney-reaffirms-support-for-ukraine-in-first-meeting-with-zelenskiy",
    "timestamp": "2025-05-17T23:42:00Z"
  },
  {
    "title": "Iran says it will continue nuclear talks with US, shrugging off Trump’s threats",
    "description": "TEHRAN, May 17: Iran’s president said his country will continue talks with the United States over its rapidly advancing nuclear programme but will not withdraw from its rights because of US threats. “We are negotiating, and we will negotiate, we are not after…",
    "link": "https://thehillstimes.in/international/iran-says-it-will-continue-nuclear-talks-with-us-shrugging-off-trumps-threats",
    "timestamp": "2025-05-17T23:40:00Z"
  }
]