[
  {
    "title": "Inside 'Alligator Alcatraz': The new migrant detention facility erected at an abandoned Everglades airport",
    "description": "President Donald Trump visits \"Alligator Alcatraz,\" a new detention facility in the Florida Everglades surrounded by alligators and pythons, set to house up to 5,000 migrants.",
    "link": "https://www.foxnews.com/politics/inside-alligator-alcatraz-new-migrant-detention-facility-erected-abandoned-everglades-airport",
    "timestamp": "2025-07-02T15:16:24Z"
  },
  {
    "title": "Inside CBS News, Staff Is Angry After Trump Settlement",
    "description": "The network's employees are angry about the $16 million '60 Minutes' settlement, relieved at the lack of an apology, and nervous for what comes next under Skydance ownership.",
    "link": "http://www.hollywoodreporter.com/business/business-news/inside-cbs-news-staff-anger-60-minutes-paramount-1236304554/",
    "timestamp": "2025-07-02T15:14:09Z"
  },
  {
    "title": "Iran suspends cooperation with UN nuclear watchdog",
    "description": "Iranian President Masoud Pezeshkian has ordered the country to suspend its cooperation with the International Atomic Energy Agency after US and Israeli air strikes hit its key nuclear facilities.",
    "link": "https://www.abc.net.au/news/2025-07-03/iran-suspends-cooperation-with-nuclear-watchdog/105488370",
    "timestamp": "2025-07-02T15:12:50Z"
  },
  {
    "title": "South Park Creators Blast Paramount as Season 27 Release Date Delayed",
    "description": "Following Paramount‘s delay of South Park Season 27, creators Trey Parker and Matt Stone have released a statement ripping the network. Paramount announced on Wednesday that the premiere of South Park Season 27 on Comedy Central has moved from July 9 to July …",
    "link": "https://www.comingsoon.net/tv/news/1997844-south-park-creators-blast-paramount-seasn-27-release-date-delayed",
    "timestamp": "2025-07-02T15:12:31Z"
  },
  {
    "title": "Trump Announces Trade Deal with Vietnam: 20% Tariff on Vietnam, Zero on U.S.",
    "description": "Vietnam runs a very large trade surplus with the U.S. and a trade deficit with China, essentially recycling dollars from the U.S. into China.\nThe post Trump Announces Trade Deal with Vietnam: 20% Tariff on Vietnam, Zero on U.S. appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/02/trump-announces-trade-deal-with-vietnam/",
    "timestamp": "2025-07-02T15:12:28Z"
  },
  {
    "title": "50 Cent reacts as longtime nemesis Diddy ‘beats the feds’ in sex trafficking trial",
    "description": "Diddy was found guilty on two out of five counts in his sex trafficking trial.",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/50-cent-diddy-trial-verdict-b2781274.html",
    "timestamp": "2025-07-02T15:09:18Z"
  },
  {
    "title": "Nike, Lululemon Jump On Trump's Vietnam Trade Deal",
    "description": "The world’s largest apparel and footwear companies’ shares jumped after US President Donald Trump said he reached a trade deal with Vietnam on Wednesday, avoiding a potential supply chain catastrophe across the industry.",
    "link": "https://www.ndtvprofit.com/markets/nike-lululemon-jump-on-trumps-vietnam-trade-deal",
    "timestamp": "2025-07-02T15:09:15Z"
  },
  {
    "title": "Musk vs. Trump: Will Elon Start a Third Party?",
    "description": "The feud between Elon Musk and President Donald Trump continues to escalate with Trump now threatening to withdraw government subsidies from his former billionaire ally’s companies.\nOn this episode of the Elon, Inc. podcast, we discuss the possibility of Musk…",
    "link": "https://biztoc.com/x/2c74137eaf654989",
    "timestamp": "2025-07-02T15:09:12Z"
  },
  {
    "title": "The U.S. dollar has fallen to its lowest value since 1973. Here's what that means",
    "description": "President Donald Trump wants the U.S. to increase its exports and lower its imports. Thanks to a historic decline in the value of the U.S. dollar, he may get his wish — but at a cost he may not have anticipated.\nOver the past six months, the dollar has declin…",
    "link": "https://biztoc.com/x/183e6e853ea3cbf8",
    "timestamp": "2025-07-02T15:09:10Z"
  },
  {
    "title": "South Park Creators Rip Paramount Merger ‘Sh*tshow’ Amid $16 Million Trump Settlement: ‘It’s F*cking Up South Park’",
    "description": "South Park creators Trey Parker and Matt Stone took aim at Paramount Global’s merger with Skydance after Comedy Central announced a delay to the show premiere.\nThe post South Park Creators Rip Paramount Merger ‘Sh*tshow’ Amid $16 Million Trump Settlement: ‘It…",
    "link": "https://www.mediaite.com/media/news/south-park-creators-rip-paramount-merger-shtshow-amid-16-million-trump-settlement-its-fcking-up-south-park/",
    "timestamp": "2025-07-02T15:08:51Z"
  },
  {
    "title": "ICE flips script on Los Angeles mayor after telling authorities to 'go home'",
    "description": "ICE responded to Los Angeles Mayor Karen Bass's call for federal immigration authorities to \"go home,\" stating they will continue operations despite the mayor's opposition to raids",
    "link": "https://www.foxnews.com/politics/ice-flips-script-los-angeles-mayor-after-telling-authorities-go-home",
    "timestamp": "2025-07-02T15:08:33Z"
  },
  {
    "title": "Tesla Gets Dismal Sales News After Disastrous Robotaxi Launch",
    "description": "Tesla has posted its second quarter delivery numbers — and they're not looking any better. As the New York Times reports, the company reported it had delivered just 384,000 vehicles between April to June, a massive drop from 444,000 vehicles over the same per…",
    "link": "https://futurism.com/tesla-dismal-sales-news-robotaxi-launch",
    "timestamp": "2025-07-02T15:07:51Z"
  },
  {
    "title": "Donald Trump Reenters Fragrance Market With Two New Perfumes",
    "description": "Donald Trump unveiled two new fragrances for men and women inspired by his win in the 2024 presidential election.",
    "link": "http://wwd.com/pop-culture/new-fashion-releases/donald-trump-fragrance-victory-45-47-1237964358/",
    "timestamp": "2025-07-02T15:06:33Z"
  },
  {
    "title": "The U.S. dollar has fallen to its lowest value since 1973. Here's what that means.",
    "description": "President Donald Trump wants the U.S. to increase its exports and lower its imports.",
    "link": "https://www.nbcnews.com/business/economy/us-dollar-falls-lowest-value-since-1973-what-to-know-rcna216469",
    "timestamp": "2025-07-02T15:06:26Z"
  },
  {
    "title": "Trump Made Bizarre Request At Hospital After Assassination Attempt: Book",
    "description": "The president’s reported ask to the doctor treating his ear wound revolved around one of his obsessions.",
    "link": "https://www.huffpost.com/entry/donald-trump-ct-scan-iq-assassination-attemp_n_686529eee4b06a8312548b85",
    "timestamp": "2025-07-02T15:06:13Z"
  },
  {
    "title": "Until Paramount seized the trophy . . .",
    "description": "It appears that institutions will stick together in response to Trump authoritarianism. Not by joining together in collective resistance, as one would hope. But by individually capitulating, thereby providing cover to the next institution to capitulate. Yeste…",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/07/until-paramount-seized-the-trophy-.html",
    "timestamp": "2025-07-02T15:05:59Z"
  },
  {
    "title": "Trump Admin Gives Newsom’s California Taxpayer Bailout To Clean Up LA Riots",
    "description": "The Trump administration announced disaster aid to address an estimated $1 billion in damage from anti-deportation riots in Los Angeles on Newsom's watch.",
    "link": "https://dailycaller.com/2025/07/02/trump-admin-newsom-california-taxpayer-bailout-clean-up-la-riots/",
    "timestamp": "2025-07-02T15:04:43Z"
  },
  {
    "title": "Bitcoin Miner Hut 8 Jumps 15%, Leading Sector Higher After Inking 5-Year Energy Supply Deal",
    "description": "The pact with the Ontario Independent Electricity System Operator will provide HUT a steady income stream and help address Ontario’s projected electricity demand growth.",
    "link": "https://www.coindesk.com/business/2025/07/02/bitcoin-miner-hut-8-jumps-15-leading-sector-higher-after-inking-5-year-energy-supply-deal",
    "timestamp": "2025-07-02T15:03:44Z"
  },
  {
    "title": "Sean 'Diddy' Combs verdict: A trial on fame, consent and #MeToo",
    "description": "The Sean \"Diddy\" Combs' trial tested the limits of fame, power, consent and of the #MeToo movement in an era of AI misinformation and manosphere backlash.",
    "link": "https://www.dw.com/en/sean-diddy-combs-verdict-a-trial-on-fame-consent-and-metoo/a-73116733",
    "timestamp": "2025-07-02T15:02:00Z"
  },
  {
    "title": "Twenty States Sue Trump Administration for Sharing Medicaid Data with DHS",
    "description": "A coalition of 20 Democratic attorneys general sued the Trump administration on Tuesday after federal health officials shared data about Medicaid recipients with the Department of Homeland Security. “The Trump Administration has upended longstanding privacy p…",
    "link": "https://freerepublic.com/focus/f-news/4326505/posts",
    "timestamp": "2025-07-02T15:01:37Z"
  },
  {
    "title": "Trump Has Threatened Hamas",
    "description": "United States ruler Donald Trump has threatened the terrorist organization Hamas and urged it to accept a ceasefire deal with Israel. A rejection of a new American-backed ceasefire proposal will result in the militant group’s position deteriorating if it refu…",
    "link": "https://www.shtfplan.com/headline-news/trump-has-threatened-hamas",
    "timestamp": "2025-07-02T15:00:59Z"
  },
  {
    "title": "Could an Elon Musk third-party disrupt American politics?",
    "description": "Elon Musk’s threat this week to form his own political party isn’t the first time he has flirted with the idea.",
    "link": "https://www.nbcnews.com/tech/elon-musk/elon-musks-america-party-project-disrupt-politics-rcna216283",
    "timestamp": "2025-07-02T15:00:40Z"
  },
  {
    "title": "The crypto revolution remains half-built",
    "description": "Despite surging crypto adoption in emerging markets, the promise of financial sovereignty remains unfulfilled. Millions hold digital wealth they can’t easily use without seamless payment systems and practical off-ramps.",
    "link": "https://cointelegraph.com/news/crypto-revolution-remains-half-built",
    "timestamp": "2025-07-02T15:00:00Z"
  },
  {
    "title": "‘South Park’ Creators Slam Proposed Paramount-Skydance Merger, Saying “It’s F***ing Up” Their Show",
    "description": "South Park creators Trey Parker and Matt Stone are, to put it mildly, not happy about the proposed merger between Comedy Central parent Paramount Global and Skydance Media. In a blistering statement in response to the show’s Season 27 premiere date change ann…",
    "link": "http://deadline.com/2025/07/south-park-creators-slam-paramount-skydance-merger-1236447856/",
    "timestamp": "2025-07-02T15:00:00Z"
  },
  {
    "title": "Paramount Won’t Say Why ‘South Park’ Is Delayed, But Trey Parker and Matt Stone Have A Theory",
    "description": "The ‘South Park’ creators didn’t mince words over the sudden postponement",
    "link": "https://www.cracked.com/article_47200_paramount-wont-say-why-south-park-is-delayed-but-trey-parker-and-matt-stone-have-a-theory.html",
    "timestamp": "2025-07-02T15:00:00Z"
  },
  {
    "title": "Trump says US has struck trade deal with Vietnam",
    "description": "Donald Trump declared a trade agreement with Vietnam. Goods from Vietnam to the US will face a 20% tariff. US products entering Vietnam will have zero tariffs. Vietnam will pay a 40% tariff on transshipping. Trump mentioned discussions with To Lam, the Commun…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/vietnam-to-pay-20-pc-tariff-on-all-goods-exported-to-us-after-trade-deal/articleshow/122209057.cms",
    "timestamp": "2025-07-02T14:59:46Z"
  },
  {
    "title": "American behind pro-Canada rallies says 'most Canadian thing ever'... 'we're sorry' about Trump",
    "description": "Kate Powers “felt shame” when she first heard U.S. President Donald Trump talking about annexing Canada.",
    "link": "https://www.cbc.ca/news/canada/hamilton/kate-powers-elbows-up-for-canada-us-border-rallies-1.7574885",
    "timestamp": "2025-07-02T14:59:05Z"
  },
  {
    "title": "Military aid increasingly focuses on boosting Ukraine's defence industry",
    "description": "WIESBADEN, Germany (Reuters) -Fenced off behind barbed wire, about 350 soldiers from 31 countries including Ukrainians work in a hangar and air-conditioned green tents at a U.S. military base in Germany. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/02/military-aid-increasingly-focuses-on-boosting-ukraine039s-defence-industry",
    "timestamp": "2025-07-02T14:59:00Z"
  },
  {
    "title": "Bombardier shares hit highest since 2018 on $1.7 billion airplane order",
    "description": "Bombardier Inc. shares soared to the highest level in seven years after the Quebec-based private jet-maker announced a $1.7 billion aircraft order with an anonymous client.",
    "link": "https://financialpost.com/transportation/bombardier-shares-hit-highest-since-2018-on-1-7-billion-airplane-order",
    "timestamp": "2025-07-02T14:58:07Z"
  },
  {
    "title": "On Eric Adams’ corruption case, Trump says ‘a little bit’ more than he should have",
    "description": "Remember the scandalous circumstances surrounding Mayor Eric Adams' corruption case? Donald Trump's new comments make the mess worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/eric-adams-corruption-case-trump-says-little-bit-rcna216479",
    "timestamp": "2025-07-02T14:56:27Z"
  },
  {
    "title": "Katie Couric, Adam Kinzinger and More Condemn Paramount’s ‘Spineless Decision’ to Settle Trump Lawsuit",
    "description": "\"Hope it was worth it,\" the former \"CBS Evening News\" anchor says\nThe post Katie Couric, Adam Kinzinger and More Condemn Paramount’s ‘Spineless Decision’ to Settle Trump Lawsuit appeared first on TheWrap.",
    "link": "https://www.thewrap.com/paramount-trump-lawsuit-settlement-reactions-katie-couric/",
    "timestamp": "2025-07-02T14:56:04Z"
  },
  {
    "title": "NY Dems who have yet to endorse Mamdani unite in his defense against Trump",
    "description": "President Donald Trump's threats to arrest socialist candidate Zohran Mamdani, who would become NYC's first Muslim mayor if elected, draws backlash from New York Democrats.",
    "link": "https://www.foxnews.com/politics/new-york-democrats-unite-defense-socialist-nyc-mayoral-nominee-after-trump-threatened-his-arrest",
    "timestamp": "2025-07-02T14:55:55Z"
  },
  {
    "title": "Ukraine presses US for weapons",
    "description": "Kiev has requested more military aid from Washington after reports emerged of halted missile and ammunition shipments Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/620900-ukraine-requests-us-weapons/",
    "timestamp": "2025-07-02T14:55:34Z"
  },
  {
    "title": "Staffers At CBS News React With Dismay — But Not Surprise — At Paramount Settlement Of Donald Trump’s ’60 Minutes’ Lawsuit",
    "description": "The news that Paramount Global will settle Donald Trump’s 60 Minutes lawsuit for $16 million certainly did not come as a shock to staffers at CBS News. For months, there has been a great deal of consternation and even resignation at the prospect of a settleme…",
    "link": "http://deadline.com/2025/07/trump-60-minutes-settlement-cbs-news-1236447707/",
    "timestamp": "2025-07-02T14:55:19Z"
  },
  {
    "title": "‘911 Moment For The Democratic Party’: Mark Penn Sounds Alarm About ‘Antisemitic Socialist’ Mamdani",
    "description": "Mark Penn warned that Democratic mayoral nominee Zohran Mamdani of New York City poses a major threat to the Democratic Party.",
    "link": "https://dailycaller.com/2025/07/02/911-moment-for-the-democratic-party-mark-penn-sounds-alarm-about-antisemitic-socialist-mamdani/",
    "timestamp": "2025-07-02T14:52:52Z"
  },
  {
    "title": "Hamas says it is studying ceasefire proposal labelled 'final' by Trump",
    "description": "CAIRO: Hamas said on Wednesday (Jul 2) it was studying what United States President Donald Trump called a \"final\" ceasefire proposal for Gaza, but that Israel must pull out of the enclave, whi",
    "link": "https://www.channelnewsasia.com/world/hamas-studying-ceasefire-proposal-gaza-israel-us-trump-5216706",
    "timestamp": "2025-07-02T14:52:07Z"
  },
  {
    "title": "Hamas says it’s open to Gaza ceasefire but won’t Trump-backed temporary proposal",
    "description": "Israel hasn't publicly commented but maintains it will only end the war if Hamas surrenders and disarms. But Hamas refuses to do so.",
    "link": "https://www.pbs.org/newshour/world/hamas-says-its-open-to-gaza-ceasefire-but-wont-trump-backed-temporary-proposal",
    "timestamp": "2025-07-02T14:51:56Z"
  },
  {
    "title": "News Of Haitian TPS, Travel Ban & Supreme Court Order Stun Immigrants",
    "description": "Were cancellation of Haitian TPS, implementing a new Travel Ban and the Supreme Court bar of nationwide injunctions the right moves for Trump? Consequences could be huge.",
    "link": "https://www.forbes.com/sites/andyjsemotiuk/2025/07/02/news-of-haitian-tps-travel-ban--supreme-court-order-stun-immigrants/",
    "timestamp": "2025-07-02T14:51:37Z"
  },
  {
    "title": "Black Fatigue Has Become a Racist Punchline Online",
    "description": "The term coined by author Mary-Frances Winters to address the physical harm of white supremacy has been hijacked.",
    "link": "http://www.rollingstone.com/culture/culture-features/black-fatigue-racist-punchline-hijacked-1235377440/",
    "timestamp": "2025-07-02T14:50:38Z"
  },
  {
    "title": "Melania should be on first boat: Deportation calls for US' First Lady gains traction amid Trump's immigration crackdown",
    "description": "A petition launched to get US First Lady Melania Trump deported is picking up scheme as her husband Donald enacts his own mass deportation plans. The petition comes as President Donald Trump ramps up his deportation schemes including with the Department of Ju…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-melania-should-be-on-first-boat-deportation-calls-for-us-first-lady-gains-traction-amid-trumps-immigration-crackdown/articleshow/122208963.cms",
    "timestamp": "2025-07-02T14:49:01Z"
  },
  {
    "title": "Best Buy taps Walgreens CIO to lead its tech organization",
    "description": "Neal Sample will succeed Brian Tilzer, who served as the electronics retailer’s chief digital, analytics and technology officer for seven years.",
    "link": "https://www.ciodive.com/news/best-buy-tech-chief-walgreens-generative-ai-tariffs/752005/",
    "timestamp": "2025-07-02T14:49:00Z"
  },
  {
    "title": "Trump: I won't let communist lunatic Zohran Mandani destroy New York",
    "description": "US President vows to 'save' New York City from the Democratic Socialist and anti-Israel candidate who won the Democratic primary for mayor.",
    "link": "https://www.israelnationalnews.com/news/411028",
    "timestamp": "2025-07-02T14:47:49Z"
  },
  {
    "title": "Trump Reveals Latest Trade Deal",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said he has made a trade deal with Vietnam, as the July 9 deadline for the end of his reciprocal tariff pause approaches.\n\"Details to follow!\" Trump said in a Truth Social post on Wednes…",
    "link": "https://biztoc.com/x/1cb3350930f1e430",
    "timestamp": "2025-07-02T14:47:19Z"
  },
  {
    "title": "US natgas prices gain over 2% on mid-July heat forecasts, more cooling demand",
    "description": "\"We're starting to see some heat coming onto the maps for the middle of July, and that's bringing some support back into the natural gas markets,\" said Gary ...",
    "link": "https://finance.yahoo.com/news/us-natgas-prices-gain-over-144553216.html",
    "timestamp": "2025-07-02T14:45:53Z"
  },
  {
    "title": "What’s up with… HPE & Juniper, Arista, Totogi",
    "description": "HPE completes $14bn acquisition of Juniper Networks Arista buys Broadcom’s SD-WAN unit VeloCloudTotogi lands gig at New Zealand’s 2degrees",
    "link": "https://www.telecomtv.com/content/digital-platforms-services/what-s-up-with-hpe-juniper-arista-totogi-53371/",
    "timestamp": "2025-07-02T14:45:31Z"
  },
  {
    "title": "The Most Terrifying Part of Trump’s Renewed Threat to Deport Citizens",
    "description": "Donald Trump’s latest threat to illegally deport U.S. citizens is bone-chilling.\r\nSpeaking at a press conference Tuesday at “Alligator Alcatraz,” the Trump administration’s premiere wetland-themed concentration camp, Trump once again raised his “controversial…",
    "link": "https://newrepublic.com/post/197523/donald-trump-renewed-threat-deport-citizens-extremism",
    "timestamp": "2025-07-02T14:44:49Z"
  },
  {
    "title": "Bitcoin squeezes shorts in $108K spike as US jobs drop most in 2 years",
    "description": "Bitcoin shorts are suddenly on the receiving end of punishment as a US employment data surprise injects fresh volatility into BTC price action.",
    "link": "https://cointelegraph.com/news/bitcoin-squeezes-shorts-in-108k-spike-us-jobs-drop-most-in-2-years",
    "timestamp": "2025-07-02T14:43:31Z"
  },
  {
    "title": "Trump Deputy Stephen Miller Takes to Fox News to Slam Elon Musk: ‘Doesn’t Represent’ the ‘American People’",
    "description": "Stephen Miller took to Fox News on Tuesday night to slam Trump administration alum Elon Musk, and argue that Republicans aren't listening to him.\nThe post Trump Deputy Stephen Miller Takes to Fox News to Slam Elon Musk: ‘Doesn’t Represent’ the ‘American Peopl…",
    "link": "https://www.mediaite.com/media/tv/trump-deputy-stephen-miller-takes-to-fox-news-to-slam-elon-musk-doesnt-represent-the-american-people/",
    "timestamp": "2025-07-02T14:43:18Z"
  },
  {
    "title": "Trump's Big Beautiful Bill Could Kill Professional Gambling",
    "description": "An amendment to the bill which passed the Senate on Tuesday could drastically reduce the ability of gamblers to turn a profit.",
    "link": "https://www.newsweek.com/trump-big-beautiful-bill-threatens-professional-gambling-2093514",
    "timestamp": "2025-07-02T14:41:54Z"
  },
  {
    "title": "China Cheerleads Elon Musk's Campaign Against Key Trump Policies",
    "description": "The Chinese regime propaganda outlet Global Times published an article on Monday amplifying pro-China \"green\" energy personality Elon Musk's increasingly hostile criticisms of President Donald Trump.\nThe post China Cheerleads Elon Musk’s Campaign Against Key …",
    "link": "https://www.breitbart.com/asia/2025/07/02/china-cheerleads-elons-campaign-against-key-trump-policies/",
    "timestamp": "2025-07-02T14:41:47Z"
  },
  {
    "title": "Intense Trump-Musk war escalates with serious threats",
    "description": "The once-powerful alliance between President Donald Trump and tech mogul Elon Musk has devolved into an increasingly bitter public battle, with Trump now suggesting he could weaponize the very government cost-cutting agency Musk helped establish against the b…",
    "link": "https://rollingout.com/2025/07/02/trump-musk-war-escalates-with-threats/",
    "timestamp": "2025-07-02T14:40:20Z"
  },
  {
    "title": "Todd Chrisley got into prison fight with ‘Varsity Blues’ scandal mastermind: ‘I will rip your head off’",
    "description": "\"Chrisley Knows Best\" star Todd Chrisley revealed an alleged prison confrontation with college admissions scandal mastermind Rick Singer over comments about his daughter Savannah.",
    "link": "https://www.foxnews.com/entertainment/todd-chrisley-got-prison-fight-varsity-blues-scandal-mastermind-i-rip-your-head-off",
    "timestamp": "2025-07-02T14:39:55Z"
  },
  {
    "title": "3 bearish market veterans explain why the S&P's latest highs could be short-lived",
    "description": "The S&P 500 has rallied by about 24% from its April low, but bearish market watchers including David Rosenberg don't expect the gains to continue.",
    "link": "https://markets.businessinsider.com/news/stocks/spx-stock-market-outlook-crash-rosenberg-tariffs-rates-geopolitics-recession-2025-6",
    "timestamp": "2025-07-02T14:37:49Z"
  },
  {
    "title": "Ex-Fox Newser Stephen Hayes Accuses Mollie Hemingway of Trump Flip-Flop — From America First to MAGA ‘Cheerleading’",
    "description": "Stephen Hayes accused Fox News contributor Mollie Hemingway of a major flip flop on President Donald Trump and his strikes on Iran.\nThe post Ex-Fox Newser Stephen Hayes Accuses Mollie Hemingway of Trump Flip-Flop — From America First to MAGA ‘Cheerleading’ fi…",
    "link": "https://www.mediaite.com/media/podcasts/ex-fox-newser-stephen-hayes-accuses-mollie-hemingway-of-trump-flip-flop-from-america-first-to-maga-cheerleading/",
    "timestamp": "2025-07-02T14:37:15Z"
  },
  {
    "title": "Trump announces U.S. trade deal with Vietnam",
    "description": "President Donald Trump said the United States has struck a trade deal with Vietnam.",
    "link": "https://biztoc.com/x/4fbed7b891e37f7b",
    "timestamp": "2025-07-02T14:36:00Z"
  },
  {
    "title": "Trump says he made a trade deal with Vietnam",
    "description": "United States President Donald Trump said in a social media post on Wednesday that he made a trade deal with Vietnam, adding that details will follow.Vietnam, which exported $136.6 billion worth of go...",
    "link": "https://biztoc.com/x/ebe3634b255dfef4",
    "timestamp": "2025-07-02T14:35:51Z"
  },
  {
    "title": "Trump Visits $450 Million 'Alligator Alcatraz,' Suggests Taxpayers Should Fund More of Them",
    "description": "Only eight days after construction began, and 12 days after Florida Attorney General James Uthmeier released a video on X announcing plans for an immigration detention center in the Everglades, \"Alligator Alcatraz\" will officially open this week. The site, wh…",
    "link": "https://biztoc.com/x/ed8538bfff20b492",
    "timestamp": "2025-07-02T14:35:48Z"
  },
  {
    "title": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states say",
    "description": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states saynewsbreak.com",
    "link": "https://www.newsbreak.com/share/4084526627780-not-only-cruel-it-is-illegal-trump-admin-unlawfully-slashed-over-1b-in-youth-mental-health-funding-breached-grant-agreements-and-violated-federal-regulations-states-say?s=a2&amp;share_destination_id=MTg1MDcxMzI3LTE3NTE0NjY4OTY0Mjk%3D&amp;pd=0CWXVPUK&amp;hl=en_US&amp;send_time=1751466896&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v6%2Cns_foryou_recall_exp_25q3-v7%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-v5",
    "timestamp": "2025-07-02T14:35:23Z"
  },
  {
    "title": "Trump announces U.S. trade deal with Vietnam",
    "description": "President Donald Trump said the United States has struck a trade deal with Vietnam.",
    "link": "https://www.cnbc.com/2025/07/02/trump-trade-vietnam-deal.html",
    "timestamp": "2025-07-02T14:34:33Z"
  },
  {
    "title": "Cathie Wood Buys the Tesla Dip, Trims Coinbase and Roblox Stakes",
    "description": "Cathie Wood Piles into Tesla as ARK Trims COIN & RBLX",
    "link": "https://finance.yahoo.com/news/cathie-wood-buys-tesla-dip-143222467.html",
    "timestamp": "2025-07-02T14:32:22Z"
  },
  {
    "title": "Trump Family Goes All In On BTC, Raising $220 Million For American Bitcoin",
    "description": "The Trump family’s foray into the cryptocurrency market is intensifying, with recent developments highlighting their commitment to Bitcoin (BTC).  American Bitcoin, a cryptocurrency mining and holding company backed by Eric Trump and Donald Trump Jr. operatin…",
    "link": "https://bitcoinist.com/trump-raising-220-million-for-american-bitcoin/",
    "timestamp": "2025-07-02T14:30:58Z"
  },
  {
    "title": "Tesla deliveries fall for second quarter in a row",
    "description": "Elon Musk's controversial role in the Trump administration has been blamed for the collapse in sales.",
    "link": "https://www.bbc.com/news/articles/ckgdydzxe6go",
    "timestamp": "2025-07-02T14:30:49Z"
  },
  {
    "title": "Trump intensifies offensive against NYC’s Zohran Mamdani, muses about possible ‘arrest’",
    "description": "Donald Trump isn't just targeting Zohran Mamdani with name-calling. He's also questioning his citizenship and talking about a possible arrest.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-intensifies-offensive-nycs-zohran-mamdani-muses-possible-arrest-rcna216462",
    "timestamp": "2025-07-02T14:30:36Z"
  },
  {
    "title": "US confirms suspension of military aid to Kiev",
    "description": "The US is suspending military aid to Kiev to preserve its own defense capabilities, American envoy to NATO Matthew Whitaker has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620898-us-confirm-suspension-aid-kiev/",
    "timestamp": "2025-07-02T14:29:02Z"
  },
  {
    "title": "President Trump renews calls to deport ‘bad’ U.S. citizens",
    "description": "While touring a migrant detention center in the Florida Everglades, the president again suggested we should deport some U.S. citizens.",
    "link": "https://www.yahoo.com/news/president-trump-renews-calls-deport-142848124.html",
    "timestamp": "2025-07-02T14:28:48Z"
  },
  {
    "title": "Sean “Diddy” Combs Found Not Guilty of Racketeering and Sex Trafficking",
    "description": "The verdict capped over a year of intense public turmoil for the era-defining hip-hop mogul, who was convicted on two lesser prostitution counts.",
    "link": "https://www.vanityfair.com/style/story/diddy-verdict-not-guilty-racketeering-sex-trafficking",
    "timestamp": "2025-07-02T14:27:35Z"
  },
  {
    "title": "Donald Trump’s Autocratic One-Man Government Regime: Doomed to Failure? But Not Before a Lot of Chaos and Destruction. Prof. Rodrigue Tremblay",
    "description": "Democracy is presently threatened in some Western countries, notably in the United States.\nThe post Donald Trump’s Autocratic One-Man Government Regime: Doomed to Failure? But Not Before a Lot of Chaos and Destruction. Prof. Rodrigue Tremblay appeared first o…",
    "link": "https://www.globalresearch.ca/donald-trump-autocratic-one-man-government-regime-doomed-failure/5893510",
    "timestamp": "2025-07-02T14:27:11Z"
  },
  {
    "title": "Iran Formalizes Divorce with U.N. Nuclear Watchdog Agency",
    "description": "President Masoud Pezeshkian of Iran, who is subordinate to elderly \"supreme leader\" Ayatollah Ali Khamenei, signed a parliamentary bill into law on Wednesday ending all cooperation with the International Atomic Energy Agency (IAEA).\nThe post Iran Formalizes D…",
    "link": "https://www.breitbart.com/middle-east/2025/07/02/iran-formalizes-divorce-with-u-n-nuclear-watchdog-agency/",
    "timestamp": "2025-07-02T14:26:55Z"
  },
  {
    "title": "Diddy NOT Guilty On Trafficking … Reaches Out To Trump For Pardon!",
    "description": "Diddy Found Guilty on Prostitution Charges, Cleared of Sex Trafficking and RICO Allegations New York City, July 1, 2025 – After roughly 12 hours of deliberation, a federal jury returned a mixed verdict in the high-profile trial of Sean “Diddy” Combs. The musi…",
    "link": "https://mediatakeout.com/diddy-not-guilty-on-trafficking-reaches-out-to-trump-for-pardon/",
    "timestamp": "2025-07-02T14:26:31Z"
  },
  {
    "title": "YouTuber Steiny Says Trump Insulted His Outfit—'Disrespect'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAaron \"Steiny\" Steinberg said President Donald Trump insulted his outfit on Trump Force One.\nNewsweek reached out to Trump's representative via email for comment on Wednesday.\nThe Context\nSteinberg is a YouTub…",
    "link": "https://biztoc.com/x/6a78dbb087674642",
    "timestamp": "2025-07-02T14:25:46Z"
  },
  {
    "title": "South Park Creators Address Delay, Slam Paramount/Skydance \"S*** Show\"",
    "description": "Earlier today, the news broke that the 27th season of Trey Parker and Matt Stone's South Park would have its premiere date moved from July 9th to July 23rd. Now, Parker and Stone have released a statement, calling out Paramount Global over the pace of how the…",
    "link": "https://bleedingcool.com/tv/south-park-creators-address-delay-slam-paramount-skydance-s-show/",
    "timestamp": "2025-07-02T14:25:03Z"
  },
  {
    "title": "Trump ‘Recettive’ To Diddy Pardon … Diddy Faces 20+ Yrs!",
    "description": "Exclusive: Trump Says No to Diddy Pardon After Guilty Verdict in Sex Trafficking Case New YorTrump ‘Receptive’ to Pardoning Diddy After Guilty Verdict in Federal Prostitution Case New York, July 1, 2025 — Sean “Diddy” Combs is now a convicted felon after a fe…",
    "link": "https://mediatakeout.com/trump-recettive-to-diddy-pardon-diddy-faces-20-yrs/",
    "timestamp": "2025-07-02T14:24:25Z"
  },
  {
    "title": "Hamas is open to a ceasefire agreement. But Netanyahu says there's no room for group in postwar Gaza",
    "description": "Israeli Prime Minister Benjamin Netanyahu has vowed “there will be no Hamas” in postwar Gaza. Netanyahu made the comments on Wednesday. U.S. President Donald Trump said Tuesday that Israel had agreed on terms for a 60-day ceasefire in Gaza and…",
    "link": "https://apnews.com/article/israel-palestinians-hamas-war-news-07-02-2025-111a1cf968318cb0fb6d9865a3ac84dc",
    "timestamp": "2025-07-02T14:24:00Z"
  },
  {
    "title": "Trump Visits $450 Million 'Alligator Alcatraz,' Suggests Taxpayers Should Fund More of Them",
    "description": "Only eight days after construction began, Florida’s new immigration detention center in the Everglades is set to officially open this week.",
    "link": "https://reason.com/2025/07/02/trump-visits-450-million-alligator-alcatraz-suggests-taxpayers-should-fund-more-of-them/",
    "timestamp": "2025-07-02T14:23:53Z"
  },
  {
    "title": "US bank groups call for quick transition as Treasury phases out paper cheques",
    "description": "A trio of bank groups has written to the US Department of the Treasury urging it to move quickly in ditching paper cheques for electronic payment options.",
    "link": "https://www.finextra.com/newsarticle/46240/us-bank-groups-call-for-quick-transition-as-treasury-phases-out-paper-cheques",
    "timestamp": "2025-07-02T14:22:47Z"
  },
  {
    "title": "Plutocrats vs. Populists in Trump’s Washington",
    "description": "With control of the White House and both chambers of Congress, Republicans have a rare chance to advance a policy agenda that remains deeply unpopular with voters, who overwhelmingly oppose cutting essential programs to fund tax breaks for the rich. In the Tr…",
    "link": "https://www.project-syndicate.org/commentary/trump-big-beautiful-bill-benefits-rich-takes-from-poor-by-andrea-louise-campbell-2025-07",
    "timestamp": "2025-07-02T14:20:49Z"
  },
  {
    "title": "WATCH: Chris Cuomo’s gotcha question for Tom Homan about ‘Alligator Alcatraz’ backfires",
    "description": "'Let's compare it to the last administration, OK? They're putting illegal aliens in hotel rooms in New York City for like 500 bucks a night. That's a fact'",
    "link": "https://www.wnd.com/2025/07/watch-chris-cuomos-gotcha-question-tom-homan-about/",
    "timestamp": "2025-07-02T14:20:11Z"
  },
  {
    "title": "YouTuber Steiny Says Trump Insulted His Outfit—'Disrespect'",
    "description": "Aaron \"Steiny\" Steinberg, a member of Nelk, which backed Trump during the 2024 campaign, interviewed him in October.",
    "link": "https://www.newsweek.com/trump-insults-nelk-steiny-outfit-2093494",
    "timestamp": "2025-07-02T14:19:19Z"
  },
  {
    "title": "Ukraine pulls in US diplomat over Trump aid surprise",
    "description": "The Ukrainian foreign ministry called in a top U.S. diplomat in Kyiv to discuss American military aid to the country, after the Trump Administration scrapped a planned weapons shipment because of concerns about its own diminishing stockpiles. The decision is …",
    "link": "https://freerepublic.com/focus/f-news/4326494/posts",
    "timestamp": "2025-07-02T14:19:07Z"
  },
  {
    "title": "Alina Habba’s educational qualification: The academic background of Donald Trump’s New Jersey attorney nominee",
    "description": "Donald Trump has nominated Alina Habba, his personal lawyer and former campaign spokeswoman, as U.S. Attorney for the District of New Jersey. This nomination has sparked controversy due to Habba's lack of prosecutorial experience. She previously represented T…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/alina-habbas-educational-qualification-the-academic-background-of-donald-trumps-new-jersey-attorney-nominee/articleshow/122208492.cms",
    "timestamp": "2025-07-02T14:17:53Z"
  },
  {
    "title": "Donald Trump's Approval Rating Changes Direction in Multiple Polls",
    "description": "Some polls suggest that Trump's approval rating has ticked up slightly after a stretch of steady decline.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-2093469",
    "timestamp": "2025-07-02T14:16:09Z"
  },
  {
    "title": "J.D. Vance Says Immigrants Will 'Bankrupt' the Federal Government. The Opposite Is True.",
    "description": "Vance cast the tie-breaking vote for a bill that will add $4 trillion to the debt. Meanwhile, immigrants are helping to keep the federal government's fiscal ...",
    "link": "https://www.yahoo.com/news/j-d-vance-says-immigrants-141541602.html",
    "timestamp": "2025-07-02T14:15:41Z"
  },
  {
    "title": "Billionaires Line Up to Save New York from Democracy",
    "description": "Do you need something to worry about? With two hot wars involving nuclear powers, one false move, accidental or deliberate, could at any moment set off World War III. This has been the case ever since late 2021, when then-US President Joe Biden’s administrati…",
    "link": "https://www.fairobserver.com/election-news/billionaires-line-up-to-save-new-york-from-democracy/",
    "timestamp": "2025-07-02T14:14:42Z"
  },
  {
    "title": "The battle for AI talent has been on an entirely different level",
    "description": "Tech companies have long paid top dollar for talent, but recent AI hiring has been on a different level, with reports of eye-popping offers.",
    "link": "https://www.businessinsider.com/big-tech-ai-talent-salaries-zuckerberg-altman-murati-2025-7",
    "timestamp": "2025-07-02T14:14:41Z"
  },
  {
    "title": "Tesla shares jump 4% as investors discount EV maker's lower than estimated Q2 deliveries",
    "description": "Tesla shares saw an increase despite lower-than-expected deliveries. Nearly 12 crore shares changed hands. This happened amid tensions between Elon Musk and US President Donald Trump. Trump threatened action against Musk. This followed Musk's criticism of Tru…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tesla-shares-jump-4-as-investors-discount-ev-makers-lower-than-estimated-q2-deliveries/articleshow/122208443.cms",
    "timestamp": "2025-07-02T14:14:37Z"
  },
  {
    "title": "Mexican Drug Cartel Hacks FBI Agent’s Phone, Uses Info To Kill Off Informants?",
    "description": "For all the hoopla and bustle being said about Donald Trump deporting “criminal” immigrants and making America great again in the process, not much was made about the Trump administration letting 17 members of El Chapo’s family and other cartel leaders into t…",
    "link": "https://hiphopwired.com/2758914/mexican-drug-cartel-hacks-fbi-agents-phone-uses-info-to-kill-off-informants/",
    "timestamp": "2025-07-02T14:14:18Z"
  },
  {
    "title": "J.D. Vance Says Immigrants Will 'Bankrupt' the Federal Government. The Opposite Is True.",
    "description": "Vance cast the tie-breaking vote for a bill that will add $4 trillion to the debt. Meanwhile, immigrants are helping to keep the federal government's fiscal house of cards propped up.",
    "link": "https://reason.com/2025/07/02/j-d-vance-says-immigrants-will-bankrupt-the-federal-government-the-opposite-is-true/",
    "timestamp": "2025-07-02T14:13:45Z"
  },
  {
    "title": "The bizarre reason Trump and his team say they may try to ‘prosecute’ CNN",
    "description": "Former US President and Republican presidential candidate Donald Trump speaks with moderator and South Dakota Governor Kristi Noem during a town hall at the Greater Philadelphia Expo Center and Fairgrounds in Oaks, Pennsylvania, on October 14, 2024.",
    "link": "https://biztoc.com/x/6d1d1c6513b3bfef",
    "timestamp": "2025-07-02T14:13:35Z"
  },
  {
    "title": "Tesla sales fell sharply in Q2 as Musk backlash and competition chipped away at company’s dominance",
    "description": "NEW YORK (AP) — Sales of Tesla electric cars fell sharply in the last three months as boycotts over Elon Musk’s political views continue to keep buyers away, a significant development given expectations that anger with the company’s billionaire CEO would have…",
    "link": "https://financialpost.com/pmn/tesla-sales-fell-sharply-in-q2-as-musk-backlash-and-competition-chipped-away-at-companys-dominance",
    "timestamp": "2025-07-02T14:13:07Z"
  },
  {
    "title": "How BRICS Can Survive ‘America First’",
    "description": "Successes are still quite limited, but the grouping has the potential to shape a new international order.",
    "link": "http://foreignpolicy.com/2025/07/02/brics-america-first-trade/",
    "timestamp": "2025-07-02T14:08:42Z"
  },
  {
    "title": "Hamas 'serious' about reaching ceasefire agreement but insists on long-standing demands",
    "description": "Hamas official said Wednesday the group is ready for a \"complete end to the war\" after President Donald Trump announced a 60-day proposal, including partial Israeli withdrawal and hostage releases.",
    "link": "https://www.foxnews.com/world/hamas-serious-about-reaching-ceasefire-agreement-insists-long-standing-demands",
    "timestamp": "2025-07-02T14:05:52Z"
  },
  {
    "title": "Donald Trump live: President’s budget bill to face tight vote in US House",
    "description": "Republicans face concerns about the national debt and Medicaid as they weigh whether to pass the One Big Beautiful Bill.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/7/2/donald-trump-live-presidents-budget-bill-to-face-tight-vote-in-us-house",
    "timestamp": "2025-07-02T14:05:40Z"
  }
]