[
  {
    "title": "Bitcoin, Ether ETFs see $1B outflows as crypto market tumbles 6%",
    "description": "Bitcoin and Ether funds saw nearly $1 billion in outflows as crypto markets fell 6%, pushing Bitcoin ETF flows negative for January, data from SoSoValue show.",
    "link": "https://cointelegraph.com/news/bitcoin-ether-etfs-1-billion-outflows-crypto-6-percent-slump",
    "timestamp": "2026-01-30T12:34:12Z"
  },
  {
    "title": "Trump names former Federal Reserve governor Warsh as next Fed chair",
    "description": "President Donald Trump said Friday that he will nominate former Federal Reserve official Kevin Warsh to be the next chair of the Fed, a pick likely to result in sharp changes to the powerful agency that could bring it closer to the White House and reduce its …",
    "link": "https://www.hurriyetdailynews.com/trump-names-former-federal-reserve-governor-warsh-as-next-fed-chair-218430",
    "timestamp": "2026-01-30T12:33:32Z"
  },
  {
    "title": "Trump names former Federal Reserve offical as next Fed chair",
    "description": "If confirmed by the US Senate, Kevin Warsh, a former Federal Reserve governor, will become the next chair of the US central bank.",
    "link": "https://www.dw.com/en/trump-fed-kevin-warsh-jerome-powell/a-75729920",
    "timestamp": "2026-01-30T12:33:00Z"
  },
  {
    "title": "Lawmakers Face Deadline to Avert Partial Government Shutdown",
    "description": "Lawmakers are facing a midnight deadline to avert a partial government shutdown over the future and funding of ICE operations and raids in cities across the United States. It comes after the Senate failed to pass a deal to continue to fund the government and …",
    "link": "https://www.today.com/video/lawmakers-face-deadline-to-avert-partial-government-shutdown-256884805833",
    "timestamp": "2026-01-30T12:32:53Z"
  },
  {
    "title": "Jury finds Wisconsin man guilty of forging threat against Trump to get witness deported (Todd Richmond/Associated Press)",
    "description": "Todd Richmond / Associated Press:\nJury finds Wisconsin man guilty of forging threat against Trump to get witness deported  —  A jury found a Wisconsin man guilty Thursday of forging threats against President Donald trump in an attempt to get the victim in a r…",
    "link": "https://www.memeorandum.com/260130/p15",
    "timestamp": "2026-01-30T12:30:00Z"
  },
  {
    "title": "Trump’s EPA Protects Big Business, Not People or the Environment, Critics Say",
    "description": "This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration. After a tumultuous year under the Trump administration, the Environmental Protection Agency (EPA) has adopted a new, almost unrecognizable gu…",
    "link": "https://www.motherjones.com/politics/2026/01/trump-epa-lee-zeldin-big-business-environment-critics-climate-rules-regulations/",
    "timestamp": "2026-01-30T12:30:00Z"
  },
  {
    "title": "Leon Goretzka explains how Donald Trump uniquely motivated Germany ahead of 2026 FIFA World Cup",
    "description": "Leon Goretzka has explained how comments from Donald Trump have created an unexpected source of motivation for Germany ahead of the 2026 FIFA World Cup. Leon Goretzka and the German national team are preparing for a World Cup that will be staged across the Un…",
    "link": "https://www.hitc.com/leon-goretzka-explains-how-donald-trump-uniquely-motivated-germany-ahead-of-2026-fifa-world-cup/",
    "timestamp": "2026-01-30T12:30:00Z"
  },
  {
    "title": "Opinion - Trump should push now for a convention of states to consider 3 new amendments",
    "description": "More than 10 years after its delivery, warnings from Donald Trump’s June 2015 presidential candidacy announcement continue to resonate. He decried the high...",
    "link": "https://thehill.com/opinion/white-house/5712429-trump-should-now-push-for-a-convention-of-states/",
    "timestamp": "2026-01-30T12:30:00Z"
  },
  {
    "title": "Bigg Boss Kannada 12 grand finale creates history with record-breaking TRP",
    "description": "Bigg Boss Kannada Season 12's grand finale achieved a historic 19.4 TVR, becoming the highest-rated episode ever for the show. This record-breaking viewership propelled Colours Kannada to the top, highlighting the season's immense popularity driven by engagin…",
    "link": "https://timesofindia.indiatimes.com/tv/news/kannada/bigg-boss-kannada-12-grand-finale-creates-history-with-record-breaking-trp/articleshow/127801077.cms",
    "timestamp": "2026-01-30T12:27:06Z"
  },
  {
    "title": "Exxon Mobil reports strong quarterly profit on solid production at home and abroad",
    "description": "Exxon Mobil’s fourth-quarter adjusted profit managed to top analysts’ expectations as the oil and natural gas company continued to experience solid production in the Permian Basin and Guyana",
    "link": "https://abcnews.go.com/Business/wireStory/exxon-mobil-reports-strong-quarterly-profit-solid-production-129697501",
    "timestamp": "2026-01-30T12:26:20Z"
  },
  {
    "title": "UK mother of two blows life savings and left homeless after giving £250,000 to ‘Hollywood stars’",
    "description": "A Worcestershire mother lost £250,000 and her home after a two-year romance scam by fraudsters posing as celebrities. Drawn in through social media, she was emotionally manipulated into repeated payments, selling her house and belongings. Now homeless, she wa…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/uk-mother-of-two-blows-life-savings-and-left-homeless-after-giving-250000-to-hollywood-stars/articleshow/127798833.cms",
    "timestamp": "2026-01-30T12:23:36Z"
  },
  {
    "title": "Hillary Clinton Warns of MAGA ‘War on Empathy’ in Sweeping Essay: ‘Savagery Is a Feature, Not a Bug’",
    "description": "Clinton accused the MAGA movement of transforming “savagery” into a moral value in a sweeping new essay.\nThe post Hillary Clinton Warns of MAGA ‘War on Empathy’ in Sweeping Essay: ‘Savagery Is a Feature, Not a Bug’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/hillary-clinton-warns-of-maga-war-on-empathy-in-sweeping-essay-savagery-is-a-feature-not-a-bug/",
    "timestamp": "2026-01-30T12:22:28Z"
  },
  {
    "title": "Melania ticket sales suggest weak box office opening — and some theaters are cancelling screenings",
    "description": "Analysis of theaters around the country shows generally sparse sales for the film’s opening",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/melania-documentary-box-office-opening-weekend-b2910583.html",
    "timestamp": "2026-01-30T12:20:33Z"
  },
  {
    "title": "ICE Is Legally Required to Issue Full Reports on Detainee Deaths. They've Completely Stopped Doing It.",
    "description": "ICE is required to issue a full report to Congress on any detainee death within 90 days. They've skipped the last 8 deaths entirely.",
    "link": "https://www.jezebel.com/ice-detainee-deaths-reports-stopped-issuing-illegal-congress-requirement-90-days-investigation",
    "timestamp": "2026-01-30T12:20:19Z"
  },
  {
    "title": "Trump names former Federal Reserve governor Kevin Warsh as the next Fed chair, replacing Powell",
    "description": "The appointment, which requires Senate confirmation, amounts to a return trip for Warsh, 55, who was a member of the Fed's board from 2006 to 2011",
    "link": "https://www.thehindubusinessline.com/news/world/trump-names-former-federal-reserve-governor-warsh-as-the-next-fed-chair-replacing-powell/article70570186.ece",
    "timestamp": "2026-01-30T12:18:18Z"
  },
  {
    "title": "Zelensky Tells Putin to Come to Kyiv For Talks 'If He Dares'",
    "description": "Putin was playing a game by inviting his counterpart to Moscow, Zelensky said, making an equally facetious reciprocal invitation to Kyiv. \nThe post Zelensky Tells Putin to Come to Kyiv For Talks ‘If He Dares’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2026/01/30/zelensky-tells-putin-to-come-to-kyiv-for-talks-if-he-dares/",
    "timestamp": "2026-01-30T12:17:40Z"
  },
  {
    "title": "US dollar gains as Warsh named next Fed Chair",
    "description": "NEW YORK, Jan 30 : The U.S. dollar gained on Friday after former Federal Reserve Governor Kevin Warsh was selected to be the next Fed Chair, and as the U.S. currency recovered from a sharp selloff earlier in the week that analysts say was overdone in the shor…",
    "link": "https://www.channelnewsasia.com/business/us-dollar-gains-warsh-named-next-fed-chair-5895601",
    "timestamp": "2026-01-30T12:16:59Z"
  },
  {
    "title": "Dollar holds higher after Fed chief announcement",
    "description": "TOKYO/LONDON, Jan 30 : The dollar gave back some of its earlier gains on Friday but remained higher on the day after U.S. President Donald Trump said he had appointed former governor Kevin Warsh as chair of the U.S. Federal Reserve. The euro was last down 0.2…",
    "link": "https://www.channelnewsasia.com/business/dollar-holds-higher-after-fed-chief-announcement-5895601",
    "timestamp": "2026-01-30T12:16:59Z"
  },
  {
    "title": "FM says Iran open to talks ensuring its legitimate rights and based on mutual respect",
    "description": "Iran's Foreign Minister Abbas Araghchi says the Islamic Republic is open to diplomacy to reduce tensions in the region, stressing that talk must be based on mutual respect and ensure Tehran's legitimate rights.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/01/iran-260130-presstv07.htm",
    "timestamp": "2026-01-30T12:16:49Z"
  },
  {
    "title": "Trump says shutdown deal near, but markets remain on edge",
    "description": "A tentative deal in Washington has eased some shutdown fears, but with key votes still pending, crypto, gold and silver are trading through liquidity jitters and foreign policy risk.",
    "link": "https://cointelegraph.com/news/trump-say-us-government-shutdown-deal-near-market-jitters",
    "timestamp": "2026-01-30T12:16:47Z"
  },
  {
    "title": "Fintech lender SoFi profit jumps on strong growth in fee‑based businesses",
    "description": "Jan 30 : SoFi Technologies reported a rise in fourth-quarter profit on Friday, lifted by strong loan demand and rapid growth in its fee‑based businesses.Fintech lenders have become popular among young customers, who favor faster, app-based platforms over trad…",
    "link": "https://www.channelnewsasia.com/business/fintech-lender-sofi-profit-jumps-strong-growth-in-fee-based-businesses-5896611",
    "timestamp": "2026-01-30T12:16:07Z"
  },
  {
    "title": "US stock index futures cut losses after Trump nominates Kevin Warsh as next Fed Chair",
    "description": "U.S. stock index futures cut some losses ‍on Friday, after U.S. ​President Donald Trump nominated Kevin Warsh as ⁠the next Federal Reserve chair.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-stock-index-futures-cut-losses-after-trump-nominates-kevin-warsh-as-next-fed-chair/articleshow/127800708.cms",
    "timestamp": "2026-01-30T12:14:50Z"
  },
  {
    "title": "Meet Trump’s next Fed Chair Kevin Warsh: He wants a back-seat central bank, a more bullish monetary policy, and for his dog to live a really long time",
    "description": "Trump confirmed Warsh as the Fed chair nominee Friday morning. Here's what might be in store for the central bank.",
    "link": "https://fortune.com/2026/01/30/meet-trump-next-fed-chair-kevin-warsh-nominee-policy-bullish-dovish-dog/",
    "timestamp": "2026-01-30T12:14:30Z"
  },
  {
    "title": "Amber Rose Backs Nicki Minaj After Pro-Trump Speech, Calls Her “Iconic”",
    "description": "Amber Rose is standing firmly by Nicki Minaj after the rapper declared her admiration for President Donald Trump, calling the moment “iconic” and defending Minaj’s right to speak freely about her political views. Minaj recently appeared at the Trump Accounts …",
    "link": "https://mediatakeout.com/amber-rose-backs-nicki-minaj-after-pro-trump-speech-calls-her-iconic/",
    "timestamp": "2026-01-30T12:11:37Z"
  },
  {
    "title": "SCOOP: Trump leaning toward Warsh for Fed Chair; Hassett officially out. (Rachael Bade/The Inner Circle ...)",
    "description": "Rachael Bade / The Inner Circle, with Rachael Bade:\nSCOOP: Trump leaning toward Warsh for Fed Chair; Hassett officially out.  —  The president met with Warsh at the White House today.  —  QUICK EVENING SCOOP: President DONALD TRUMP has narrowed his choice…",
    "link": "https://www.memeorandum.com/260130/p11",
    "timestamp": "2026-01-30T12:10:01Z"
  },
  {
    "title": "Trump reveals his 'great' pick for US central bank boss",
    "description": "Kevin Warsh is not seen as the interest rate cut champion feared by financial markets and economists, amid continuing worries over the Fed's independence.",
    "link": "https://news.sky.com/story/trump-reveals-his-great-pick-for-us-central-bank-boss-13500929",
    "timestamp": "2026-01-30T12:10:00Z"
  },
  {
    "title": "Trump announces Kevin Warsh as fed chair pick",
    "description": "Trump said his pick to replace current Chairman Jerome Powell is an \"outstanding person and a person that won't be too surprising to people.\"",
    "link": "https://abcnews.go.com/Politics/trump-hell-announce-pick-federal-reserve-chair-friday/story?id=129688604",
    "timestamp": "2026-01-30T12:09:26Z"
  },
  {
    "title": "Trump gives last-minute nod in race that has GOP 'concerned': 'Nail-biter for Republicans'",
    "description": "President Donald Trump tossed an endorsement to a Republican state senate candidate ahead of a special election seen as a bellwether for the midterm elections.The president backed GOP candidate Leigh Wambsganss in the Saturday special election runoff in the o…",
    "link": "https://www.rawstory.com/texas-state-senate-special-election/",
    "timestamp": "2026-01-30T12:08:41Z"
  },
  {
    "title": "JUST IN: Trump Announces Kevin Warsh Is His Pick to Lead the Federal Reserve",
    "description": "In a Truth Social post Friday morning, President Donald Trump announced his pick to succeed Jerome Powell as chair of the Federal Reserve.\nThe post JUST IN: Trump Announces Kevin Warsh Is His Pick to Lead the Federal Reserve first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/just-in-trump-announces-kevin-warsh-is-his-pick-to-lead-the-federal-reserve/",
    "timestamp": "2026-01-30T12:08:33Z"
  },
  {
    "title": "Nobel Committee says Peace Prize winner likely revealed early by digital spying",
    "description": "By Gwladys FoucheOSLO, Jan 30 (Reuters) - Digital espionage was likely to have been behind the uncovering of the 2025 Nobel Peace Prize winner’s name ahead of its officia… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/30/nobel-committee-says-peace-prize-winner-likely-revealed-early-by-digital-spying",
    "timestamp": "2026-01-30T12:08:05Z"
  },
  {
    "title": "Trump names his pick to replace Jerome Powell at the Federal Reserve | CNN Business",
    "description": "The announcement caps an extensive search that started in September and was spearheaded by Treasury Secretary Scott Bessent, who presented final candidates to the president.",
    "link": "https://www.cnn.com/business/live-news/fed-chair-nominee-kevin-warsh-01-30-26",
    "timestamp": "2026-01-30T12:07:55Z"
  },
  {
    "title": "Trump names central banker Kevin Warsh as his pick to lead the US Fed",
    "description": "Donald Trump has named Kevin Warsh as his choice to become the next chair of the US central bank, the Federal Reserve.",
    "link": "https://www.independent.ie/business/world/trump-names-central-banker-kevin-warsh-as-his-pick-to-lead-the-us-fed/a293933314.html",
    "timestamp": "2026-01-30T12:06:32Z"
  },
  {
    "title": "Tulsi Gabbard Releases Documents that PROVE it Was Barack Obama who Led the Russiagate Conspiracy and Coup Against Donald Trump – Documents Have Been Turned Over to the DOJ",
    "description": "Director of National Intelligence, Tulsi Gabbard, released a bombshell report with new and damning information on Wednesday. On Wednesday afternoon she shared with White House reporters at the daily briefing. The documents reveal it was Barack Obama and the F…",
    "link": "https://freerepublic.com/focus/f-chat/4364661/posts",
    "timestamp": "2026-01-30T12:04:43Z"
  },
  {
    "title": "Breaking: Trump nominates Kevin Warsh as new Fed chair",
    "description": "Mr Warsh will replace current chair Jerome Powell when his term expires in May.",
    "link": "https://www.abc.net.au/news/2026-01-30/trump-nominates-kevin-warsh-as-next-fed-chair/106290084",
    "timestamp": "2026-01-30T12:04:07Z"
  },
  {
    "title": "Trump nominates Kevin Warsh as new Fed chair",
    "description": "Mr Warsh will replace current chair Jerome Powell when his term expires in May.",
    "link": "https://www.abc.net.au/news/2026-01-30/donald-trump-nominates-kevin-warsh-next-fed-chair/106290084",
    "timestamp": "2026-01-30T12:04:07Z"
  },
  {
    "title": "President Donald Trump announces Kevin Warsh as pick to be next Fed chair",
    "description": "Trump, 79, announced the pick of Warsh, 55, on Truth Social hours after The Post's Charlie Gasparino reported that the commander in chief had settled on the former Fed governor.",
    "link": "https://nypost.com/2026/01/30/us-news/president-donald-trump-announces-kevin-warsh-as-pick-to-be-next-fed-chair/",
    "timestamp": "2026-01-30T12:03:46Z"
  },
  {
    "title": "Trump names Kevin Warsh as the next Federal Reserve chair",
    "description": "President Donald Trump says he'll nominate former Federal Reserve governor Kevin Warsh to be the next Fed chair. Friday's pick is likely to result in sharp changes to the powerful agency that could bring it closer to the White House and reduce its longtime in…",
    "link": "https://apnews.com/article/warsh-trump-federal-reserve-chair-6b4441263c1b7ecb40b96adf17adeea2",
    "timestamp": "2026-01-30T12:03:22Z"
  },
  {
    "title": "Trump nominates Kevin Warsh to succeed Jerome Powell as Federal Reserve chair",
    "description": "Bush economic advisor Kevin Warsh is set to succeed Jerome Powell as chair of the Federal Reserve, President Trump announced Friday.",
    "link": "https://www.businessinsider.com/trump-nominates-kevin-warsh-next-federal-reserve-chair-2026-1",
    "timestamp": "2026-01-30T12:03:12Z"
  },
  {
    "title": "CBSE board exams 2026: How to finish your paper on time without writing faster",
    "description": "CBSE board exams begin on February 17, and the real panic often hits ten minutes into the paper when one question starts eating your time. This guide gives you a simple exam hall system: use the first five minutes to plan your route, budget minutes per mark, …",
    "link": "https://timesofindia.indiatimes.com/education/news/cbse-board-exams-2026-how-to-finish-on-time-without-writing-faster/articleshow/127800297.cms",
    "timestamp": "2026-01-30T12:02:57Z"
  },
  {
    "title": "Trump Names Kevin Warsh to Replace Fed Chair Jerome Powell",
    "description": "President Donald Trump announces that former Federal Reserve governor Kevin Warsh will replace Jerome Powell as chairman of the Federal Reserve. NBC's Garrett Haake reports and Christine Romans joins TODAY to weigh-in with analysis.",
    "link": "https://www.today.com/video/trump-names-kevin-warsh-to-replace-fed-chair-jerome-powell-256884805613",
    "timestamp": "2026-01-30T12:02:52Z"
  },
  {
    "title": "Trump to nominate Kevin Warsh as next Fed chair, replacing Jerome Powell",
    "description": "President Donald Trump has nominated Kevin Warsh to lead the Federal Reserve. Warsh, a former Fed governor, is set to replace Jerome Powell. This appointment signals a potential shift in the central bank's policies. Trump has openly criticized Powell for not …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-to-nominate-kevin-warsh-as-next-fed-chair-replacing-powell/articleshow/127800479.cms",
    "timestamp": "2026-01-30T12:02:41Z"
  },
  {
    "title": "Kiev still holding Russian hostages – senior diplomat",
    "description": "Kiev is still refusing to release 12 Russian civilians abducted in Kursk Region, Ambassador-at-Large Rodion Miroshnik has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/631762-ukraine-russian-hostages-mirishnik/",
    "timestamp": "2026-01-30T12:02:21Z"
  },
  {
    "title": "President Donald Trump nominates Kevin Warsh as Fed Chair",
    "description": "The president confirmed his pick on Friday to replace the incumbent Jerome Powell when his term ends in May.",
    "link": "https://www.coindesk.com/policy/2026/01/30/president-donald-trump-nominates-kevin-warsh-as-fed-chair",
    "timestamp": "2026-01-30T12:02:01Z"
  },
  {
    "title": "Trump picks former Fed official Warsh to run Fed",
    "description": "WASHINGTON, ‌Jan ‌30 (Reuters) - ‌President Donald Trump ‍on ‍Friday ‌said he had ‍chosen ​former ⁠Federal Reserve ‌Governor ⁠Kevin ‍Warsh ‍to head ‌the U.S. central bank. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/30/trump-picks-former-fed-official-warsh-to-run-fed",
    "timestamp": "2026-01-30T12:02:00Z"
  },
  {
    "title": "Trump names Kevin Warsh as next Federal Reserve chair, replacing Jerome Powell",
    "description": "President Donald Trump has nominated Kevin Warsh to lead the Federal Reserve. Warsh, a former Fed governor, is expected to bring significant changes to the agency. His appointment requires Senate confirmation. This move could shift the Fed's independence and …",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/trump-names-kevin-warsh-as-next-federal-reserve-chair-replacing-jerome-powell/articleshow/127800453.cms",
    "timestamp": "2026-01-30T12:01:48Z"
  },
  {
    "title": "Trump Says He's Nominating Kevin Warsh To Lead The Federal Reserve",
    "description": "I \"have no doubt that he will go down as one of the GREAT Fed Chairmen, maybe the best,\" Trump wrote on his Truth Social platform.",
    "link": "https://www.huffpost.com/entry/trump-nominates-kevin-warsh-fed_n_697c9b9ee4b0c02d1be18885",
    "timestamp": "2026-01-30T12:01:46Z"
  },
  {
    "title": "Wealth inequality and the 'K-shaped' economy are more striking than ever, data shows",
    "description": "The K-shaped economy is as apparent than ever and isn't going away anytime soon, economists say.",
    "link": "https://www.cnbc.com/2026/01/30/wealth-inequality-k-shaped-economy-united-states-consumer-spending-trump.html",
    "timestamp": "2026-01-30T12:01:02Z"
  },
  {
    "title": "Ukraine is bracing for brutal weather as Trump says Putin agreed to halt power grid attacks",
    "description": "Kyiv is experiencing power shortages and expects extreme cold.",
    "link": "https://www.bostonherald.com/2026/01/30/trump-putin-ukraine-severe-winter/",
    "timestamp": "2026-01-30T12:00:59Z"
  },
  {
    "title": "Trump and GOP eye midterm convention cities in high-stakes bid to hold House, Senate",
    "description": "Trump likes Nevada or Texas for possibly hosting GOP's first midterm convention, sources tell Fox News. Historic \"Trump-a-palooza\" aims to boost Republican chances.",
    "link": "https://www.foxnews.com/politics/trump-gop-eye-midterm-convention-cities-high-stakes-bid-hold-house-senate",
    "timestamp": "2026-01-30T12:00:58Z"
  },
  {
    "title": "Trump Admin Uses Equity Stakes, New Mines to Secure Critical Minerals Supply Chain",
    "description": "Trump administration announced a $1.6 billion deal with USA Rare Earth for development of mines, magnet production, and enhanced rare earths processing techniques.\nThe post Trump Admin Uses Equity Stakes, New Mines to Secure Critical Minerals Supply Chain fir…",
    "link": "https://legalinsurrection.com/2026/01/trump-admin-uses-equity-stakes-new-mines-to-secure-critical-minerals-supply-chain/",
    "timestamp": "2026-01-30T12:00:42Z"
  },
  {
    "title": "Alex Pretti should have faced charges for spitting on agent before fatal shooting: former prosecutor",
    "description": "Video shows Alex Pretti allegedly spitting at agents before Border Patrol shooting in Minneapolis. Former prosecutor explains why no charges filed.",
    "link": "https://www.foxnews.com/us/alex-pretti-should-have-faced-charges-spitting-agent-before-fatal-shooting-former-prosecutor",
    "timestamp": "2026-01-30T12:00:35Z"
  },
  {
    "title": "Democrats can run, but they can't hide: An immigration reckoning is next in 2028",
    "description": "Democrats remain trapped in civil war over ICE and immigration enforcement, treating border policy as moral proxy war rather than governing responsibility.",
    "link": "https://www.foxnews.com/opinion/democrats-can-run-cant-hide-immigration-reckoning-next-2028",
    "timestamp": "2026-01-30T12:00:06Z"
  },
  {
    "title": "Whisper it, but is Keir Starmer quietly reversing Brexit?",
    "description": "Six year after leaving the EU, the UK is navigating a delicate balancing act on trade and diplomatic ties with Brussels, as well as Washington and Beijing",
    "link": "https://www.irishtimes.com/world/uk/2026/01/30/whisper-it-but-is-keir-starmer-quietly-reversing-brexit/",
    "timestamp": "2026-01-30T12:00:00Z"
  },
  {
    "title": "James Fishback Says Don Lemon Is 'Lucky That He's Not Getting Executed In The Public Square'",
    "description": "Florida groyper GOP gubernatorial candidate James Fishback says the Founding Fathers would have had Don Lemon publicly executed: \"Don Lemon should be lucky that he's not getting executed in the public square for his little stunt.\"",
    "link": "https://www.peoplefor.org/rightwingwatch/james-fishback-says-don-lemon-lucky-hes-not-getting-executed-public-square",
    "timestamp": "2026-01-30T12:00:00Z"
  },
  {
    "title": "Too Emotional To Vote",
    "description": "<ul>\n<li>Debunked Again And Again</li>\n<li>You Say You Want A Revolution</li>\n<li>Bad Rabbit</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/too-emotional-vote",
    "timestamp": "2026-01-30T12:00:00Z"
  },
  {
    "title": "Trump taps Kevin Warsh to chair Federal Reserve",
    "description": "President Donald Trump plans to nominate Kevin Warsh to the board of the Federal Reserve as a governor and the next chair of the central bank",
    "link": "https://www.nbcnews.com/business/economy/trump-federal-reserve-chair-rcna256631",
    "timestamp": "2026-01-30T11:59:11Z"
  },
  {
    "title": "Gold demand to drop in 2026 as jewellery sales fall!",
    "description": "India's gold demand is projected to fall to 600-700 metric tons in 2026, a five-year low, due to record-high prices impacting jewelry purchases. While investment demand surged 17% in 2025, driven by ETFs seeking better returns than the stock market, jewelry s…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/gold-demand-to-drop-in-2026-as-jewellery-sales-fall/articleshow/127800026.cms",
    "timestamp": "2026-01-30T11:58:20Z"
  },
  {
    "title": "Europe sees modest growth, but the weaker dollar looms as a threat",
    "description": "The European economy recorded modest growth at the end of last year, overcoming higher U.S. tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/europe-sees-modest-growth-weaker-dollar-looms-threat-129696628",
    "timestamp": "2026-01-30T11:57:31Z"
  },
  {
    "title": "Trump nominates Kevin Warsh to replace Jerome Powell as Fed chair | CNN Business",
    "description": "President Donald Trump said Friday he is nominating Kevin Warsh to be the 17th chair of the Federal Reserve after Jerome Powell’s term ends in May.",
    "link": "https://www.cnn.com/2026/01/30/economy/kevin-warsh-nominated-fed-chair",
    "timestamp": "2026-01-30T11:56:53Z"
  },
  {
    "title": "Trump names former Federal Reserve governor Warsh as the next Fed chair, replacing Powell",
    "description": "President Donald Trump says he'll nominate former Federal Reserve governor Kevin Warsh to be the next Fed chair.",
    "link": "https://www.news4jax.com/business/2026/01/30/trump-names-former-federal-reserve-governor-warsh-as-the-next-fed-chair-replacing-powell/",
    "timestamp": "2026-01-30T11:56:10Z"
  },
  {
    "title": "Exclusive-$500 billion euro crisis fund could be used for defence, says ESM chief",
    "description": "FRANKFURT, Jan 30 (Reuters) - A European crisis fund with more ‌than 430 billion euros ($514 billion) of firepower could lend money to countries for defence, the head of the European Stability Mechanism told Reuters, as the bloc ‌scrambles to reinforce its mi…",
    "link": "https://www.thestar.com.my/news/world/2026/01/30/exclusive-500-billion-euro-crisis-fund-could-be-used-for-defence-says-esm-chief",
    "timestamp": "2026-01-30T11:56:00Z"
  },
  {
    "title": "Trump nominates Kevin Warsh for Federal Reserve chair to succeed Jerome Powell",
    "description": null,
    "link": "https://www.cnbc.com/2026/01/30/trump-nominates-kevin-warsh-for-federal-reserve-chair-to-succeed-jerome-powell.html",
    "timestamp": "2026-01-30T11:54:30Z"
  },
  {
    "title": "Melania Trump’s New Pet Name For Her Husband Gets A Brutal Tweak Online",
    "description": "Critics on social media switched out some letters.",
    "link": "https://www.huffpost.com/entry/melania-trump-nickname-donald-trump_n_697c8f77e4b0d9ba36bb7c96",
    "timestamp": "2026-01-30T11:54:06Z"
  },
  {
    "title": "Why is silver price going down by 14.1% and will it drop below $99.77 or rise again? Silver price fall explained. Here's what investors should do now",
    "description": "Why is silver price going down by 14.1% and will it drop below $99.77 or rise again? Silver prices dropped after hitting record highs. Profit-taking, dollar strength, and changes in U.S. monetary expectations pushed prices lower. Other precious metals also de…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-is-silver-price-going-down-by-14-1-and-will-it-drop-below-99-77-or-rise-again-silver-price-fall-explained-heres-what-investors-should-do-now/articleshow/127799712.cms",
    "timestamp": "2026-01-30T11:53:42Z"
  },
  {
    "title": "Prof. Schlevogt’s Compass No. 39: The exorbitant privilege trap – How dollar power ensnares America",
    "description": "The dollar’s reserve status yields leverage – at hidden cost. An economic reckoning reveals the trade-offs embedded in monetary dominance. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631763-dollar-power-ensnares-america/",
    "timestamp": "2026-01-30T11:49:40Z"
  },
  {
    "title": "Trump says he will announce his Federal Reserve chair nominee Friday",
    "description": "Trump’s pick is likely to result in sharp changes to the powerful agency that could bring it closer to the White House and reduce its longtime independence.",
    "link": "https://www.twincities.com/2026/01/30/trump-fed-chair-nominee/",
    "timestamp": "2026-01-30T11:47:59Z"
  },
  {
    "title": "Donald Trump claims 'tickets are selling fast' for Melania documentary as empty cinemas go viral",
    "description": "Donald Trump has claimed that 'tickets are selling fast' for Melania's documentary despite empty cinemas going viral",
    "link": "https://www.ladbible.com/news/donald-trump-melania-documentary-tickets-money-us-film-780691-20260130",
    "timestamp": "2026-01-30T11:46:47Z"
  },
  {
    "title": "Turning Point’s Super Bowl alternative to Bad Bunny looks like a flop",
    "description": "The organization won’t reveal the performers until the day of the game",
    "link": "https://www.salon.com/2026/01/30/turning-points-super-bowl-alternative-to-bad-bunny-looks-like-a-flop/",
    "timestamp": "2026-01-30T11:45:55Z"
  },
  {
    "title": "The US Is Making Moves in Latin America’s Southern Cone",
    "description": "“Argentina has become the centrepiece of the United States’ strategy for Latin America”: US Treasury Secretary Scott Bessent. ON Sunday (Jan 25), a Boeing C-40 Clipper belonging to the US Air Force landed in Ushuaia, Argentina’s — and the world’s — southernmo…",
    "link": "https://www.nakedcapitalism.com/2026/01/us-is-making-big-moves-in-latin-americas-southern-cone.html",
    "timestamp": "2026-01-30T11:45:27Z"
  },
  {
    "title": "Iran prepared for ‘fair’ talks with US but not on defence capabilities, Araqchi says",
    "description": "ISTANBUL, Jan 30 (Reuters) - Iran is prepared for the resumption of talks with the United States, but they should be fair and not include Iran’s defence capabilities, Ira… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/30/iran-prepared-for-fair-talks-with-us-but-not-on-defence-capabilities-araqchi-says",
    "timestamp": "2026-01-30T11:45:02Z"
  },
  {
    "title": "Ukraine braces for brutal cold as Trump says Putin agreed to halt power grid attacks",
    "description": "Russian President Vladimir Putin has agreed to U.S. President Donald Trump's request to pause attacks on Ukraine's power grid for a week. Trump announced this on Thursday, but details about the timing and scope remain unclear. Kremlin spokesperson Dmitry Pesk…",
    "link": "https://apnews.com/article/russia-ukraine-war-putin-trump-energy-truce-0f1e6e5cb72f11a181104db3bb5c4e1e",
    "timestamp": "2026-01-30T11:44:56Z"
  },
  {
    "title": "Trump calls Alex Pretti ‘agitator’, possible ‘insurrectionist’ after spitting, kicking video of slain ICU nurse surfaces",
    "description": "President Trump proclaimed Friday that Alex Pretti's \"stock has gone way down\" after video emerged of him spitting at federal immigration officers and smashing the taillight of their black SUV days before his killing by border agents in Minneapolis.",
    "link": "https://nypost.com/2026/01/30/us-news/trump-calls-alex-pretti-agitator-with-stock-way-down-after-video-emerged-of-him-spitting-kicking-ice/",
    "timestamp": "2026-01-30T11:44:10Z"
  },
  {
    "title": "Lindsey Graham Blocks Deal to Fund Government",
    "description": "Punchbowl News: “The Senate is struggling to reach an agreement to quickly pass a massive government funding deal negotiated by Democrats and President Donald Trump.” “Sen. Lindsey Graham (R-S.C.) emerged as the primary obstacle to a fast floor vote late Thur…",
    "link": "https://politicalwire.com/2026/01/30/lindsey-graham-blocks-deal-to-fund-government/",
    "timestamp": "2026-01-30T11:43:28Z"
  },
  {
    "title": "Trump Seizes on New Alex Pretti Video to Brand Him ‘Agitator and, Perhaps, Insurrectionist’ in Late-Night Rant",
    "description": "Trump pointed to newly surfaced video footage that he said showed a “crazed” display of “abuse and anger” toward immigration officers on Jan 13.\nThe post Trump Seizes on New Alex Pretti Video to Brand Him ‘Agitator and, Perhaps, Insurrectionist’ in Late-Night…",
    "link": "https://www.mediaite.com/media/news/trump-seizes-on-new-alex-pretti-video-to-brand-him-agitator-and-perhaps-insurrectionist-in-late-night-rant/",
    "timestamp": "2026-01-30T11:43:20Z"
  },
  {
    "title": "Trump says he will announce his Federal Reserve chair nominee on Friday morning",
    "description": "Trump is believed to have four finalists for the position, but did not give details.",
    "link": "https://www.bostonherald.com/2026/01/30/trump-fed-chair-nominee/",
    "timestamp": "2026-01-30T11:42:25Z"
  },
  {
    "title": "Trump names former Federal Reserve governor Warsh as the next Fed chair, replacing Powell",
    "description": "Trump's pick is likely to result in sharp changes to the powerful agency that could bring it closer to the White House and reduce its longtime independence.",
    "link": "https://www.denverpost.com/2026/01/30/trump-fed-chair-nominee/",
    "timestamp": "2026-01-30T11:42:25Z"
  },
  {
    "title": "'She's done a great job' - Donald Trump praises Melania's film",
    "description": "US First Lady Melania Trump and her husband President Donald Trump have walked the black carpet at the premier of her new documentary.",
    "link": "https://www.bbc.co.uk/news/videos/cvgnqgl57p2o",
    "timestamp": "2026-01-30T11:39:46Z"
  },
  {
    "title": "Trump threatens to ban Canadian-made planes",
    "description": "Donald Trump has threatened to decertify “all” Canadian-made planes as well as impose 50% tariff on Canadian jets sold in the US Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631758-trump-threatens-ban-canadian-planes/",
    "timestamp": "2026-01-30T11:38:33Z"
  },
  {
    "title": "Summary execution: Does this legal theory hold hope of justice for ICE shooting victims?",
    "description": "Lawyers speaking to Raw Story said justice could still prevail in the cases of Renee Good and Alex Pretti, the two people shot dead by federal agents in Minneapolis this month, despite the Trump administration’s refusal\r\n to cooperate with state investigation…",
    "link": "https://www.rawstory.com/raw-investigates/minneapolis-shooting-2675060691/",
    "timestamp": "2026-01-30T11:38:17Z"
  },
  {
    "title": "Exxon earnings beat estimates despite low oil prices",
    "description": "Last year, crude oil logged the biggest annual price decline since 2020.",
    "link": "https://www.cnbc.com/2026/01/30/exxonmobil-xom-4q-2025-earnings.html",
    "timestamp": "2026-01-30T11:37:52Z"
  },
  {
    "title": "Aggression Against Iran, Its People Will Receive Immediate, Decisive Response – President",
    "description": "TEHRAN (Sputnik) - Any aggression against Iran and its people will receive an immediate and decisive response, Iranian President Masoud Pezeshkian said on Friday.",
    "link": "https://sputnikglobe.com/20260130/aggression-against-iran-its-people-will-receive-immediate-decisive-response--president-1123553411.html",
    "timestamp": "2026-01-30T11:36:50Z"
  },
  {
    "title": "Trump Contradicts Homan's Talk Of Partial Withdrawal From Minneapolis",
    "description": "The president just put the kibosh on the border czar's wish to reduce the amount of federal officers there.",
    "link": "https://www.huffpost.com/entry/donald-trump-contradicts-tom-homan-pullback_n_697c875be4b0c02d1be10ae5",
    "timestamp": "2026-01-30T11:35:23Z"
  },
  {
    "title": "Chevron Exceeds Profit Forecasts With Booming Oil Production",
    "description": "Chevron Corp. beat analysts’ estimates as oil production surged with supply growth from the US Gulf of Mexico and Kazakhstan helping blunt the impact of falling crude prices.",
    "link": "https://financialpost.com/pmn/business-pmn/chevron-exceeds-profit-forecasts-with-booming-oil-production",
    "timestamp": "2026-01-30T11:34:08Z"
  },
  {
    "title": "Voltaire, International Newsletter N°160",
    "description": "Our director of publication and editor-in-chief directed French magazines several years ago, and has won journalism awards abroad. He has regularly contributed to some fifteen major dailies and magazines around the world. \nVoltaire, International Newsletter i…",
    "link": "https://www.voltairenet.org/article223622.html",
    "timestamp": "2026-01-30T11:31:24Z"
  },
  {
    "title": "Scientists resist Trump’s war on climate data",
    "description": "Climate scientists are determined to preserve their projects and inform the public under a new organizational shell",
    "link": "https://www.salon.com/2026/01/30/scientists-resist-trumps-war-on-climate-data/",
    "timestamp": "2026-01-30T11:30:44Z"
  },
  {
    "title": "10 Friday AM Reads",
    "description": "My end-of-week morning train WFH reads: • The average 50-something American is now worth $1.4 million: Want to get rich? Get old. That’s what the data tells us about net worth in America. The average 50-something American has a net worth of $1.4 million, acco…",
    "link": "https://ritholtz.com/2026/01/10-friday-am-reads-485/",
    "timestamp": "2026-01-30T11:30:42Z"
  },
  {
    "title": "He Lost an Eye in the George Floyd Protests. Now He Represents the Ward Where Renée Good Was Killed.",
    "description": "It was Soren Stevenson’s third day in office on the Minneapolis city council when, in the middle of a strategic planning session, Mayor Jacob Frey rushed out of the room. Soon, the council learned why: Federal agents had shot and killed Renée Good. Stevenson …",
    "link": "https://www.motherjones.com/politics/2026/01/minneapolis-renee-good-alex-pretti-soren-stevenson-council-interview/",
    "timestamp": "2026-01-30T11:30:00Z"
  },
  {
    "title": "Nationwide protests, walkouts planned over fatal ICE shootings in Minneapolis",
    "description": "MINNEAPOLIS, Jan ‌30 (Reuters) - Student organizers have called for walkouts and protests across the United States on Friday to demand that federal immigration agents ‌withdraw from Minnesota, after two fatal shootings of U.S. citizens generated public outrag…",
    "link": "https://www.thestar.com.my/news/world/2026/01/30/nationwide-protests-walkouts-planned-over-fatal-ice-shootings-in-minneapolis",
    "timestamp": "2026-01-30T11:29:00Z"
  },
  {
    "title": "Senate leaders scramble to save bipartisan deal and avert partial government shutdown at midnight",
    "description": "Democrats struck a rare deal with President Donald Trump Thursday to separate funding for the Homeland Security Department from a broad government spending bill.",
    "link": "https://www.bostonherald.com/2026/01/30/us-congress-budget-deal-trump/",
    "timestamp": "2026-01-30T11:26:15Z"
  },
  {
    "title": "Ukraine updates: Kremlin says Trump asked Putin not to hit Kyiv until Feb 1",
    "description": "The Kremlin announced that US President Donald Trump had asked Vladimir Putin to halt strikes on Kyiv until February 1. However, Ukraine reported that Russia launched one missile and over 100 drones overnight. Follow DW.",
    "link": "https://www.dw.com/en/kremlin-peskov-putin-trump-stop-kyiv-strikes/live-75726689",
    "timestamp": "2026-01-30T11:24:00Z"
  },
  {
    "title": "Sydney Sweeney Breaks Silence on ‘MAGA Barbie’ Label",
    "description": "“But it’s somebody else assigning something to me, and I can’t control that,“ she told Cosmopolitan.",
    "link": "https://www.newsweek.com/entertainment/sydney-sweeney-responds-maga-barbie-label-11440797",
    "timestamp": "2026-01-30T11:23:34Z"
  },
  {
    "title": "Trump suggests 'agitator and insurrectionist' Alex Pretti deserved death in midnight rant",
    "description": "President Donald Trump smeared slain nurse Alex Pretti in an overnight social media post.New video shows an encounter between the 37-year-old Pretti and federal immigration agents 11 days before Border Patrol officers fatally shot him Jan. 24, and the 79-year…",
    "link": "https://www.rawstory.com/alex-pretti-trump-late-smear/",
    "timestamp": "2026-01-30T11:22:56Z"
  }
]