[
  {
    "title": "What’s in the Epstein Emails? Trump News & More Big Reveals",
    "description": "What’s in the Epstein emails? In the 23,000 pages of documents released by the House, Epstein claims Trump ‘knew about the girls’ and says he knows ‘how dirty Donald is.’ Here are updates on the Trump news and other big reveals in the emails.",
    "link": "http://nymag.com/intelligencer/article/epstein-emails-trump-news-updates.html",
    "timestamp": "2025-11-12T20:25:00Z"
  },
  {
    "title": "The 10 states that have passed pro-LGBTQ+ bills — or defeated the most anti-LGBTQ+ ones — in 2025",
    "description": "Liberal states stand out for passage of supportive laws, while the sheer volume of anti-LGBTQ+ legislation introduced in some conservative ones means many bills died there.",
    "link": "https://www.advocate.com/politics/10-states-pro-lgbtq-bills",
    "timestamp": "2025-11-12T20:24:08Z"
  },
  {
    "title": "Netanyahu thanks Trump for letter to Herzog: 'You get right to the point'",
    "description": "Prime Minister Benjamin Netanyahu reacted to President Donald Trump's letter to Israeli President Isaac Herzog asking him to pardon him.",
    "link": "https://www.israelnationalnews.com/news/417706",
    "timestamp": "2025-11-12T20:24:02Z"
  },
  {
    "title": "Copyright Office head asks Supreme Court to keep her in role – Roll Call",
    "description": "The register of copyrights at the Library of Congress defended a lower court ruling that kept her in office despite President Donald Trump%u2019s attempts to fire...",
    "link": "https://lisnews.org/copyright-office-head-asks-supreme-court-to-keep-her-in-role-roll-call/",
    "timestamp": "2025-11-12T20:23:54Z"
  },
  {
    "title": "LA Olympics schedules top women's event before men's for first time ever",
    "description": "The 2028 Los Angeles Olympics will make history by scheduling the women's 100-meter final on opening night, marking the first time this event opens Olympic competition.",
    "link": "https://www.foxnews.com/sports/la-olympics-schedule-prioritizes-womens-event-over-mens-first-time-ever",
    "timestamp": "2025-11-12T20:23:49Z"
  },
  {
    "title": "Epstein Claims He ‘Gave’ Trump His Ex-Girlfriend In Bombshell Email Dump",
    "description": "Deceased sex criminal Jeffrey Epstein said he \"gave\" his ex-girlfriend to Donald Trump after he'd been with her for two years in a newly-revealed email.\nThe post Epstein Claims He ‘Gave’ Trump His Ex-Girlfriend In Bombshell Email Dump first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/epstein-claims-he-gave-trump-his-ex-girlfriend-in-bombshell-email-dump/",
    "timestamp": "2025-11-12T20:23:39Z"
  },
  {
    "title": "TN libraries close a week after Trump ‘gender ideology’ order on books",
    "description": "Rutherford County libraries close for week to adhere to Trump ‘gender ideology’ order Murfreesboro Daily News JournalLibrary patrons will endure a week-long closure of Smyrna and...",
    "link": "https://lisnews.org/tn-libraries-close-a-week-after-trump-gender-ideology-order-on-books/",
    "timestamp": "2025-11-12T20:22:37Z"
  },
  {
    "title": "By the numbers: The government shutdown’s toll on air travel in the US",
    "description": "Thousands of flights have been canceled and major airports are experiencing long delays.",
    "link": "https://www.bostonherald.com/2025/11/12/government-shutdown-airline-impact/",
    "timestamp": "2025-11-12T20:21:02Z"
  },
  {
    "title": "‘The Daily Show’ Praises Trump Plan for $2,000 Tariff Rebate Checks to the Poor: ‘Stupid Himself Into Socialism?’ | Video",
    "description": "Host Josh Johnson points out that the president's actions are actually pretty progressive, and he doesn't even know it\nThe post ‘The Daily Show’ Praises Trump Plan for $2,000 Tariff Rebate Checks to the Poor: ‘Stupid Himself Into Socialism?’ | Video appeared …",
    "link": "https://www.thewrap.com/the-daily-show-trump-tariff-rebate-checks-socialism-comedy-central/",
    "timestamp": "2025-11-12T20:18:22Z"
  },
  {
    "title": "Trump’s 50-year mortgages lose steam as industry questions costs",
    "description": "Days after \n \n \n \n \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n \n \n \n \n ’s party lost several key election contests that centered on \n \n \n \n \n \n \n \n \n \n cost-of-living\n \n \n \n \n \n \n \n \n \n concerns, the president floated the prospect of a 50-year mortgage to help voters…",
    "link": "https://biztoc.com/x/a7b0199bd7558aa3",
    "timestamp": "2025-11-12T20:18:13Z"
  },
  {
    "title": "Tungsten Is the Next Flash Point in the Resource Race",
    "description": "Alarmed by Beijing’s rare earths chokehold, Washington is scrambling to plug other potential vulnerabilities.",
    "link": "http://foreignpolicy.com/2025/11/12/us-china-tungsten-critical-mineral-supply-chain/",
    "timestamp": "2025-11-12T20:18:04Z"
  },
  {
    "title": "How the Jeffrey Epstein row plunged Maga world into turmoil",
    "description": "Long-running saga has pitted Trump, a friend of the financier for many years before later disavowing him, against his base",
    "link": "https://www.irishtimes.com/world/us/2025/11/12/how-the-jeffrey-epstein-row-plunged-maga-world-into-turmoil/",
    "timestamp": "2025-11-12T20:17:04Z"
  },
  {
    "title": "Epstein email says Trump ‘knew about the girls’ as White House calls its release a Democratic smear",
    "description": "Democrats released emails referencing Trump, including a 2011 Epstein note saying Trump spent hours at his home with a sex trafficking victim.",
    "link": "https://fortune.com/2025/11/12/house-democrats-over-sight-committee-jeffrey-epstein-donald-trump-ghislaine-maxwell/",
    "timestamp": "2025-11-12T20:15:27Z"
  },
  {
    "title": "New Jeffrey Epstein Emails Allege Trump Knew Of His Misdeeds",
    "description": "New emails by Jeffrey Epstein, revealed by Democrats, reveal the convicted sex offender alleged that President Donald Trump knew more about his actions than previously claimed.",
    "link": "https://hiphopwired.com/2905229/new-jeffrey-epstein-emails-allege-trump-knew-of-his-misdeeds/",
    "timestamp": "2025-11-12T20:14:38Z"
  },
  {
    "title": "‘FAKE NARRATIVE’? Dems Left Out a Key Detail in Epstein Files Drop, Republicans Say",
    "description": "House Democrats redacted a key detail from their Wednesday release of Jeffrey Epstein files to promote a “fake narrative” and “smear” President Donald Trump, according... Read More\nThe post ‘FAKE NARRATIVE’? Dems Left Out a Key Detail in Epstein Files Drop, R…",
    "link": "https://www.dailysignal.com/2025/11/12/fake-narrative-dems-left-out-key-detail-epstein-files-drop/",
    "timestamp": "2025-11-12T20:13:23Z"
  },
  {
    "title": "The Donald Trump and Jeffrey Epstein Relationship: Everything We Know",
    "description": "Amid a looming vote on the Epstein files, House Democrats on Wednesday released emails in which the late financier and sex trafficker said Trump “knew about the girls.”",
    "link": "https://www.vanityfair.com/news/story/trump-epstein-relationship-history",
    "timestamp": "2025-11-12T20:13:04Z"
  },
  {
    "title": "US criticises Britain over nuclear reactor proposals",
    "description": "LONDON (Reuters) -The U.S. ambassador to London on Wednesday attacked Britain's approach to nuclear power in an unusually strong criticism on the eve of an...",
    "link": "https://uk.news.yahoo.com/us-criticises-britain-over-nuclear-201147073.html",
    "timestamp": "2025-11-12T20:11:47Z"
  },
  {
    "title": "Parliament’s center pans von der Leyen’s draft digital reforms",
    "description": "The leaked digital omnibus proposal has centrists and the left railing against the \"erosion\" of EU rules.",
    "link": "https://www.politico.eu/article/ursula-von-der-leyen-eu-parliament-draft-digital-reforms/",
    "timestamp": "2025-11-12T20:11:38Z"
  },
  {
    "title": "British Media Frets Over Trump’s Threat to Sue BBC: ‘If the BBC Just Backs Down, It Doesn’t Deserve to Survive’",
    "description": "President Donald Trump's threat to sue the BBC has sent seismic waves of panic through the British media.\nThe post British Media Frets Over Trump’s Threat to Sue BBC: ‘If the BBC Just Backs Down, It Doesn’t Deserve to Survive’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/british-media-frets-over-trumps-threat-to-sue-bbc-if-the-bbc-just-backs-down-it-doesnt-deserve-to-survive/",
    "timestamp": "2025-11-12T20:11:25Z"
  },
  {
    "title": "Cowardice And Capitulation At Cornell",
    "description": "On Friday it was announced that my alma mater, Cornell, had caved to the Trump administration and agreed to a “deal” the federal government had offered them to get back the funding it had illegally cut off from Cornell as part of its authoritarian efforts to …",
    "link": "https://www.techdirt.com/2025/11/12/cowardice-and-capitulation-at-cornell/",
    "timestamp": "2025-11-12T20:10:21Z"
  },
  {
    "title": "In Syria “Happy Terrorists” Join Hands. Al Qaeda “Bad Guys” are our Friends",
    "description": "This is no laughing matter. \nHere they are together, MAGA Donald Trump, and former Al Qaeda leader Muhammed Al Jawlani with a U.S flag in the background. \n“Besides showering compliments, President Trump also backed the former terrorist and said …\nThe post In …",
    "link": "https://www.globalresearch.ca/in-syria-happy-terrorists-join-hands-al-qaeda-bad-guys-are-our-friends/5905526",
    "timestamp": "2025-11-12T20:10:20Z"
  },
  {
    "title": "Pro-life organization invests $80 million to maintain majority in Congress",
    "description": "Putting bull's-eye on Democrats' 'all trimester abortion agenda'",
    "link": "https://www.wnd.com/2025/11/pro-life-organization-invests-80-million-maintain-majority/",
    "timestamp": "2025-11-12T20:10:13Z"
  },
  {
    "title": "Is the New York Stock Exchange moving to Texas because of Mamdani's win?",
    "description": "The New York Stock Exchange was moving to Texas due to Zohran Mamdani winning the New York mayoral election in November 2025.",
    "link": "https://www.snopes.com//fact-check/new-york-stock-exchange-texas/",
    "timestamp": "2025-11-12T20:10:00Z"
  },
  {
    "title": "Trump is 'committed' to $2,000 tariff dividend payments, White House says",
    "description": "President Donald Trump remains \"committed\" to sending each American a $2,000 dividend check to be distributed from tariff revenue.",
    "link": "https://abcnews.go.com/Business/trump-committed-2000-tariff-dividend-payments-white-house/story?id=127460426",
    "timestamp": "2025-11-12T20:09:45Z"
  },
  {
    "title": "JD Vance’s Old Epstein Tweets Come Back To Bite Him",
    "description": "Four years ago, Vance was wondering why the Epstein case seemed to get swept under the rug.",
    "link": "https://www.huffpost.com/entry/jd-vances-old-epstein-tweets-come-back-to-bite-him_n_6914d444e4b0c37fa3d2afb2",
    "timestamp": "2025-11-12T20:09:42Z"
  },
  {
    "title": "The U.S. Mint ended production of the penny, citing cost savings and the coin’s fading relevance as its buying power—once enough for a snack or candy—has all but disappeared",
    "description": "“God bless America, and we’re going to save the taxpayers $56 million,” U.S. Treasurer Brandon Beach said just before hitting a button to strike the final penny.",
    "link": "https://fortune.com/2025/11/12/us-mint-ends-production-of-the-penny-inflation-prices-currency-federal-reserve/",
    "timestamp": "2025-11-12T20:08:47Z"
  },
  {
    "title": "Kai Trump shares advice from grandpa Donald — and mom’s boyfriend Tiger Woods — ahead of pro golf debut",
    "description": "The 18-year-old will play in The Annika tournament with the Ladies Professional Golf Association (LPGA) at the Pelican Golf Club in Belleair, Fla.",
    "link": "https://pagesix.com/2025/11/12/celebrity-news/kai-trump-shares-advice-from-grandpa-donald-and-moms-boyfriend-tiger-woods-ahead-of-pro-golf-debut/",
    "timestamp": "2025-11-12T20:08:04Z"
  },
  {
    "title": "Trump’s Epstein Problem Is Back and Worse Than Ever",
    "description": "Trump called the Epstein scandal a ‘dead issue,’ but it came back to life today with new emails alleging he ‘knew about the girls’ and the forthcoming release of thousands of government files about his late friend.",
    "link": "http://nymag.com/intelligencer/article/epstein-emails-adelita-grijalva-mean-deep-trouble-for-trump.html",
    "timestamp": "2025-11-12T20:08:00Z"
  },
  {
    "title": "Democrats could learn a very valuable lesson from the shutdown fight",
    "description": "Chris Hayes breaks down what lesson Democrats should take from the shutdown, which gave voice to millions of Americans suffering from high health care costs.",
    "link": "https://www.msnbc.com/top-stories/latest/shutdown-deal-democrats-weak-republicans-health-care-rcna243520",
    "timestamp": "2025-11-12T20:07:33Z"
  },
  {
    "title": "New State Dept Policy Allows Rejection of Visa Apps Over Common Health Issues",
    "description": "The new directive reinforces past US policies that wrongly targeted immigrants using xenophobic “illness” claims.",
    "link": "https://truthout.org/articles/new-state-dept-policy-allows-rejection-of-visa-apps-over-common-health-issues/",
    "timestamp": "2025-11-12T20:07:33Z"
  },
  {
    "title": "Trump is showering Netanyahu with gifts. What is he getting in return?",
    "description": "Trump's intervention in Netanyahu's trial, breaking all bounds of U.S. involvement in Israeli politics, is a cause for celebration for the prime minister, proving Trump is doing all he can to shield him from the consequences of his own actions",
    "link": "https://www.haaretz.com/israel-news/haaretz-today/2025-11-12/ty-article/.highlight/trump-is-showering-netanyahu-with-gifts-what-is-he-getting-in-return/0000019a-795f-d326-a3ff-fd5fd88f0000",
    "timestamp": "2025-11-12T20:07:09Z"
  },
  {
    "title": "White House Uses Shutdown as Excuse to Not Release Key Economic Data",
    "description": "The decision comes as Americans grow increasingly anxious about inflation, affordability, and the state of Trump’s economy.",
    "link": "https://newrepublic.com/post/203102/white-house-shutdown-excuse-wont-release-key-economic-data-jobs-inflation",
    "timestamp": "2025-11-12T20:02:40Z"
  },
  {
    "title": "Read the Jeffrey Epstein emails that mention Donald Trump",
    "description": "The powerful House Oversight Committee released more than 20,000 pages of documents provided by the estate of Jeffrey Epstein Wednesday.",
    "link": "https://nypost.com/2025/11/12/us-news/read-the-jeffrey-epstein-emails-that-mention-donald-trump/",
    "timestamp": "2025-11-12T20:01:37Z"
  },
  {
    "title": "Trump gets the Epstein scandal backward",
    "description": "Rachel Maddow points out that Donald Trump's sympathy for former-Prince Andrew losing his title over his disgraceful association ...",
    "link": "https://biztoc.com/x/e03fa6e3ab6ccdab",
    "timestamp": "2025-11-12T20:01:27Z"
  },
  {
    "title": "Shutdown Deal Kills Rules to Prevent Food Contamination and Foodborne Illnesses",
    "description": "The gutting of these rules coincides with a huge increase in hospitalizations and deaths from foodborne illnesses.",
    "link": "https://www.levernews.com/shutdown-deal-kills-food-safety-rules/",
    "timestamp": "2025-11-12T20:01:21Z"
  },
  {
    "title": "Newsom Signs Climate Deal With Nigeria Despite the Christian Genocide",
    "description": "Yes, let's be friendly with the epicenter of Christian persecution in Africa. You're such a winner, Newsom.\nThe post Newsom Signs Climate Deal With Nigeria Despite the Christian Genocide first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/newsom-signs-climate-deal-with-nigeria-despite-the-christian-genocide/",
    "timestamp": "2025-11-12T20:00:27Z"
  },
  {
    "title": "James Carville says Democrats lacked 'endgame plan' for shutdown, urges party to move on",
    "description": "James Carville said Tuesday that Democrats lacked a real \"endgame\" strategy during the government shutdown, and urged the party to move on during a conversation with Jim Acosta.",
    "link": "https://www.foxnews.com/media/james-carville-says-democrats-lacked-endgame-plan-shutdown-urges-party-move-on",
    "timestamp": "2025-11-12T20:00:24Z"
  },
  {
    "title": "'Rare': Catholic bishops prepare to send Trump a ‘special message’",
    "description": "A group of Catholic bishops is preparing a \"special message\" for President Donald Trump and is expected to consider it on Wednesday. The U.S. Conference of Catholic Bishops announced it will take a stand for migrants whom the Trump administration has targeted…",
    "link": "https://www.rawstory.com/donald-trump-catholic-church/",
    "timestamp": "2025-11-12T19:58:18Z"
  },
  {
    "title": "Trump Sends America’s Largest Aircraft Carrier to Caribbean amid Rising Tensions with Venezuela",
    "description": "America’s largest aircraft carrier, the USS Gerald R. Ford, arrived in the Caribbean on Tuesday, joining eight other warships and a nuclear submarine in the region.\nThe post Trump Sends America’s Largest Aircraft Carrier to Caribbean amid Rising Tensions with…",
    "link": "https://www.breitbart.com/latin-america/2025/11/12/trump-sends-americas-largest-aircraft-carrier-to-caribbean-amid-rising-tensions-with-venezuela/",
    "timestamp": "2025-11-12T19:57:49Z"
  },
  {
    "title": "Leavitt Goes on Wild Rant When Asked About Trump Cutting Off SNAP",
    "description": "Karoline Leavitt blamed Donald Trump’s continued efforts to cut food stamp funding on Democrats and a judge.",
    "link": "https://newrepublic.com/post/203104/karoline-leavitt-donald-trump-cutting-snap-food-stamps",
    "timestamp": "2025-11-12T19:57:42Z"
  },
  {
    "title": "Epstein email says Trump 'knew about the girls' as White House calls its release a Democratic smear",
    "description": "President Donald Trump says Democrats who released Jeffrey Epstein emails mentioning him are trying to bring up his ties to the late sex offender again because \"they’ll do anything at all to deflect on how badly they’ve done” on the…",
    "link": "https://apnews.com/article/epstein-emails-trump-house-democrats-db7df1042a73e610fb5deddf2f90bd3a",
    "timestamp": "2025-11-12T19:57:13Z"
  },
  {
    "title": "3623 - Trump's Epstein Email Problem; Anti-Trust Import to Socialists w/ Ryan Cooper",
    "description": "The House Oversight Committee releases three email threads from the Epstein estate that make Donald Trump look as he would put it, not so great. The emails show Michael Wolff advising Epstein on how to use his association with Trump to curry favor with him. M…",
    "link": "https://majorityfm.libsyn.com/3623-trumps-epstein-email-problem-anti-trust-import-to-socialists-w-ryan-cooper",
    "timestamp": "2025-11-12T19:56:00Z"
  },
  {
    "title": "Karoline Leavitt Accuses Democrats Of Shutting Government Down To Fix Healthcare Mess They ‘Created’",
    "description": "White House press secretary Karoline Leavitt accused Democrats of shutting down the government to rail about the healthcare crisis that they \"created.\"",
    "link": "https://dailycaller.com/2025/11/12/karoline-leavitt-democrats-shutdown-government-obamacare/",
    "timestamp": "2025-11-12T19:55:31Z"
  },
  {
    "title": "What Michael Wolff Has Said About Jeffrey Epstein",
    "description": "Author Michael Wolff advised Jeffrey Epstein to let Donald Trump “hang himself” amid questions on their relationship, emails show.",
    "link": "https://biztoc.com/x/920388312ccace3f",
    "timestamp": "2025-11-12T19:55:26Z"
  },
  {
    "title": "'Something out of a book': Caitlin Clark's LPGA encore delivers again",
    "description": "Though Clark's game, especially off the tee, didn't cooperate Wednesday at The Annika, simply the LPGA megastar's returning presence on the women's golf stage was enough to boost the sport once more.",
    "link": "https://www.nbcsports.com/golf/news/something-out-of-a-book-caitlin-clarks-lpga-encore-delivers-again",
    "timestamp": "2025-11-12T19:53:17Z"
  },
  {
    "title": "Troubling Epstein emails about Trump disclosed by House",
    "description": "House Democrats on the Oversight Committee have disclosed emails exchanged between Jeffrey Epstein and various individuals that reference President Donald Trump. The release on Wednesday included correspondence spanning from 2011 to 2019, adding new dimension…",
    "link": "https://rollingout.com/2025/11/12/troubling-epstein-emails-trump-house/",
    "timestamp": "2025-11-12T19:53:08Z"
  },
  {
    "title": "US sanctions 32 entities, individuals from several countries including India",
    "description": "The US has imposed sanctions on 32 entities and individuals across several countries, including India and China, for their alleged involvement in Iran's ballistic missile and drone programs. This action aims to counter Iran's aggressive weapons development an…",
    "link": "https://economictimes.indiatimes.com/news/india/us-sanctions-32-entities-individuals-from-several-countries-including-india/articleshow/125284054.cms",
    "timestamp": "2025-11-12T19:49:43Z"
  },
  {
    "title": "Trump issues sweeping pardons for 2020 election allies — what the move really means",
    "description": "President Donald Trump pardoned more than 70 people accused of seeking to overturn the 2020 election results, including former lawyer Rudy Giuliani.",
    "link": "https://www.foxnews.com/politics/trump-issues-sweeping-pardons-2020-election-allies-what-move-really-means",
    "timestamp": "2025-11-12T19:48:14Z"
  },
  {
    "title": "White House Press Secretary Says Trump “Did Nothing Wrong” As Reporters Press Her On Jeffrey Epstein Emails Release",
    "description": "White House Press Secretary Karoline Leavitt was peppered with questions over the release earlier on Wednesday of emails from Jeffrey Epstein in which he claimed that Donald Trump “knew about the girls” and “spent hours” at Epstein’s home with one of his vict…",
    "link": "http://deadline.com/2025/11/trump-jeffrey-epstein-files-press-secretary-1236615569/",
    "timestamp": "2025-11-12T19:47:39Z"
  },
  {
    "title": "'Very bad or stupid': Trump attacks Republicans backing Epstein petition as vote nears",
    "description": "President Donald Trump lashed out at four House Republicans who were backing a petition that would force a vote on the release of files related to sex offender Jeffrey Epstein.In emails released by House Democrats on Wednesday, Epstein claimed that Trump \"kne…",
    "link": "https://www.rawstory.com/trump-stupid-republicans-epstein/",
    "timestamp": "2025-11-12T19:45:20Z"
  },
  {
    "title": "Shots Podcast Network Joins Cumulus Podcast Network, Bringing Unfiltered Entertainment to Millions of Listeners",
    "description": "Shots Podcast Network, including Full Send, One Night w/Steiny and The Rush with Maxx Crosby podcasts, joins the Cumulus Podcast Network.......",
    "link": "https://www.globenewswire.com/news-release/2025/11/12/3186681/9032/en/Shots-Podcast-Network-Joins-Cumulus-Podcast-Network-Bringing-Unfiltered-Entertainment-to-Millions-of-Listeners.html",
    "timestamp": "2025-11-12T19:44:00Z"
  },
  {
    "title": "Maine candidate leaves Senate race for House primary, shaking up 2 high stakes contests",
    "description": "The Democratic primary to take on Republican Sen. Susan Collins of Maine looks different due to the decision of one candidate to drop out and join a different race with high stakes",
    "link": "https://abcnews.go.com/Politics/wireStory/maine-candidate-leaves-senate-race-house-primary-shaking-127461851",
    "timestamp": "2025-11-12T19:41:39Z"
  },
  {
    "title": "Big Chunk Of Trump’s 2024 Voter Coalition Splits Off In 2025, Potentially Spelling Danger For GOP",
    "description": "Despite Trump's historic Latino swing, the 2025 election spells trouble for Republicans as they seek to keep this coalition intact for the midterms next year.",
    "link": "https://dailycaller.com/2025/11/12/trump-2024-latino-vote-democrats-republicans-elections-races-2026-2028/",
    "timestamp": "2025-11-12T19:41:00Z"
  },
  {
    "title": "Kai Trump is set to make LPGA debut. From YouTube viral video to golf player, all about Donald Trump's granddaughter",
    "description": "Donald Trump's granddaughter Kai Trump is all set to make LPGA debut.",
    "link": "https://economictimes.indiatimes.com/news/international/us/kai-trump-is-set-to-make-lpga-debut-from-youtube-viral-video-to-golf-player-all-about-donald-trumps-granddaughter/articleshow/125283758.cms",
    "timestamp": "2025-11-12T19:40:21Z"
  },
  {
    "title": "Glinda vs. Elphaba, Jennifer Lawrence vs. postpartum depression and wilderness vs. progress in November movies",
    "description": "This month’s new releases include ‘Wicked: For Good,’ ‘Die My Love’ and ‘Train Dreams’",
    "link": "https://theweek.com/culture-life/film/november-movies-wicked-for-good-die-my-love-train-dreams",
    "timestamp": "2025-11-12T19:38:52Z"
  },
  {
    "title": "Watch: Donald Trump plays his own janitor in resurfaced 2004 ‘SNL’ sketch",
    "description": "A 2004 Saturday Night Live sketch featuring Donald Trump as a janitor mocking his own persona has vanished from official releases and online. The lost clip depicted Trump satirizing his own vanity and excess, a performance that now feels eerily prophetic give…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/watch-donald-trump-plays-his-own-janitor-in-resurfaced-2004-snl-sketch/articleshow/125283698.cms",
    "timestamp": "2025-11-12T19:36:26Z"
  },
  {
    "title": "Atlanta Fed president Bostic to retire, opening seat on interest-rate setting committee",
    "description": "It comes as President Trump is seeking to exert more control over the central bank.",
    "link": "https://www.pbs.org/newshour/economy/atlanta-fed-president-bostic-to-retire-opening-seat-on-interest-rate-setting-committee",
    "timestamp": "2025-11-12T19:35:42Z"
  },
  {
    "title": "Top Trump Officials Huddling at White House Ahead of Potential House Vote On Epstein Files: CNN",
    "description": "CNN reported that top officials in Trump's administration are huddling at the White House to address a potential House vote to release all Epstein files.\nThe post Top Trump Officials Huddling at White House Ahead of Potential House Vote On Epstein Files: CNN …",
    "link": "https://www.mediaite.com/media/news/top-trump-officials-huddling-at-white-house-ahead-of-potential-house-vote-on-epstein-files-cnn/",
    "timestamp": "2025-11-12T19:35:09Z"
  },
  {
    "title": "The New Epstein Emails Look Pretty Bad for Trump",
    "description": "Republicans still have the president's back, although their response was threadbare.",
    "link": "https://www.esquire.com/news-politics/politics/a69411289/trump-epstein-emails/",
    "timestamp": "2025-11-12T19:34:00Z"
  },
  {
    "title": "Starmer refuses to say whether he will urge Trump to drop his threat to sue BBC",
    "description": "Keir Starmer has refused to say whether he would urge Donald Trump to drop his threat to sue the BBC for a billion dollars over the broadcaster’s edit of a speech he made after losing the 2020 presidential election.",
    "link": "https://biztoc.com/x/530a9b556fbba00b",
    "timestamp": "2025-11-12T19:32:47Z"
  },
  {
    "title": "Donald Trump Reacts After New Jeffrey Epstein Emails Released",
    "description": "President Donald Trump has posted his first remarks since Democrats on the House Oversight Committee released three emails referencing Trump sent by the late sex-trafficker Jeffrey Epstein.\nTrump posted Wednesday afternoon on Truth Social, \"The Democrats are …",
    "link": "https://biztoc.com/x/a54733b1656b0d63",
    "timestamp": "2025-11-12T19:32:45Z"
  },
  {
    "title": "CNN's Data Chief Almost Swears On-Air Talking About 1 ‘Ginormous’ Mistake Trump Is Making",
    "description": "Harry Enten said the “ginormous error” could go “down in political infamy.”",
    "link": "https://www.huffpost.com/entry/harry-enten-trump-republicans-economy_n_6914acafe4b0c37fa3d29289",
    "timestamp": "2025-11-12T19:30:58Z"
  },
  {
    "title": "Michael Wolff told Jeffrey Epstein he could end Trump’s 2016 campaign",
    "description": "“Yeah, you’re the Trump bullet,” Wolff told the notorious sex criminal.",
    "link": "https://nypost.com/2025/11/12/us-news/michael-wolff-told-jeffrey-epstein-he-could-end-trumps-2016-campaign/",
    "timestamp": "2025-11-12T19:28:42Z"
  },
  {
    "title": "Starmer refuses to say whether he will urge Trump to drop his threat to sue BBC",
    "description": "Keir Starmer has refused to say whether he would urge Donald Trump to drop his threat to sue the BBC for a billion dollars over the broadcaster’s edit of a speech he made after losing the 2020 presidential election.",
    "link": "https://www.pbs.org/newshour/world/starmer-refuses-to-say-whether-he-will-urge-trump-to-drop-his-threat-to-sue-bbc",
    "timestamp": "2025-11-12T19:27:50Z"
  },
  {
    "title": "Venezuela puts military on high alert in response to US buildup in Caribbean",
    "description": "Venezuela has announced a “massive deployment” of troops in response to the US naval armada approaching its waters Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627691-venezuela-military-us-buildup/",
    "timestamp": "2025-11-12T19:27:46Z"
  },
  {
    "title": "Crockett: Trump Is ‘More Corrupt and More Criminal’ than Any Other President",
    "description": "Wednesday on CNN’s “The Situation Room,” Rep. Jasmine Crockett (D-TX) claimed President Donald Trump was “more corrupt and more criminal than any other president than we’ve had.” Host Pamela Brown said, “We spoke to Marlin Stutzman earlier, he’s a Republican,…",
    "link": "https://freerepublic.com/focus/f-bloggers/4352159/posts",
    "timestamp": "2025-11-12T19:27:15Z"
  },
  {
    "title": "The US penny is officially dead",
    "description": "The government minted the final one-cent coin in Philadelphia, though billions remain in circulation.",
    "link": "https://www.businessinsider.com/us-penny-officially-dead-philadelphia-mint-2025-11",
    "timestamp": "2025-11-12T19:27:08Z"
  },
  {
    "title": "Trump Seethes Over Latest Wild Turn in ‘Jeffrey Epstein Hoax’",
    "description": "President Donald Trump responded directly to the latest wild turn in what he calls \"the Jeffrey Epstein Hoax\" for the first time on Wednesday afternoon.\nThe post Trump Seethes Over Latest Wild Turn in ‘Jeffrey Epstein Hoax’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-seethes-over-latest-wild-turn-in-jeffrey-epstein-hoax/",
    "timestamp": "2025-11-12T19:26:43Z"
  },
  {
    "title": "ROOKE: If Someone’s In Trump’s Ear With Latest Idiotic Ideas, They Need To Be Kicked Out Of White House",
    "description": "There are days when our nation feels like it's on the right track, and then others when it feels like we are in a runaway car with no brakes.",
    "link": "https://dailycaller.com/2025/11/12/rooke-trump-white-house-h1b-visa-program-immigration-china-students-lara-ingraham/",
    "timestamp": "2025-11-12T19:26:32Z"
  },
  {
    "title": "JUST IN: Trump Called Lauren Boebert Amid Pressure For Her to Drop Support For Epstein Files Release, Reports NYT",
    "description": "The New York Times reported on Wednesday that President Donald Trump called Rep. Lauren Boebert (R-CO) on Tuesday morning as part of the campaign urging her to drop her support for the release of the Epstein files. “Mr. Trump connected with Ms. Boebert by pho…",
    "link": "https://www.mediaite.com/media/news/just-in-trump-called-lauren-boebert-amid-pressure-for-her-to-drop-support-for-epstein-files-release-reports-nyt/",
    "timestamp": "2025-11-12T19:26:14Z"
  },
  {
    "title": "US Ends Penny-Making Run After More Than 230 Years",
    "description": "The US is set to make its final penny. The Philadelphia Mint will strike its last batch of one-cent coins on Thursday, after more than 230 years of production. From a report: The coins will remain in circulation but the phase-out has already prompted business…",
    "link": "https://news.slashdot.org/story/25/11/12/1849239/us-ends-penny-making-run-after-more-than-230-years",
    "timestamp": "2025-11-12T19:25:00Z"
  },
  {
    "title": "Supreme Court to hear arguments on Trump bid to fire Fed Gov. Lisa Cook on Jan. 21",
    "description": "Two lower federal courts have blocked President Trump from removing Lisa Cook as a governor of the Federal Reserve Board.",
    "link": "https://www.cnbc.com/2025/11/12/trump-fed-lisa-cook-supreme-court.html",
    "timestamp": "2025-11-12T19:23:20Z"
  },
  {
    "title": "Trump hopes to sign bill ending government shutdown Wednesday",
    "description": "AMD climbs after outlining plan for steep growth in AI data center chip market\nInvesting.com -- U.S. President Donald Trump hopes to sign legislation Wednesday night that would end the ongoing government shutdown, according to White House Press Secretary Karo…",
    "link": "https://biztoc.com/x/33171993bb7b6d81",
    "timestamp": "2025-11-12T19:21:47Z"
  },
  {
    "title": "The Trump Administration's Latest Housing 'Fix' Could Inflate Another Bubble",
    "description": "President Donald Trump made headlines with his controversial proposal to make housing affordable by introducing 50-year mortgages. While that plan was merely floated—and may not even be legal—the administration has laid the groundwork for another housing bubb…",
    "link": "https://biztoc.com/x/b0b191d98ee5e02f",
    "timestamp": "2025-11-12T19:21:38Z"
  },
  {
    "title": "Trump Begs Lauren Boebert to Take Her Name Off Epstein Files Petition",
    "description": "The White House is clearly spiraling over the files, especially as new details drop.",
    "link": "https://newrepublic.com/post/203100/donald-trump-lauren-boebert-epstein-files-petition",
    "timestamp": "2025-11-12T19:21:23Z"
  },
  {
    "title": "What to know as the US Mint in Philadelphia presses its final penny",
    "description": "The U.S. Mint in Philadelphia has printed its last penny, marking a significant step in the 1-cent coin's demise",
    "link": "https://abcnews.go.com/Business/wireStory/us-mint-philadelphia-presses-final-penny-127460422",
    "timestamp": "2025-11-12T19:17:55Z"
  },
  {
    "title": "Osbournes Fire Back at Roger Waters: “A Sad, Irrelevant, Old, Miserable, Ugly Human Being”",
    "description": "The former Pink Floyd member had made disparaging remarks about Ozzy following his death.\nOsbournes Fire Back at Roger Waters: “A Sad, Irrelevant, Old, Miserable, Ugly Human Being”\nSpencer Kaufman",
    "link": "https://consequence.net/2025/11/osbournes-slam-roger-waters/",
    "timestamp": "2025-11-12T19:17:04Z"
  },
  {
    "title": "Trump’s lies about costs shows something is very wrong 'inside the man’s mind': economist",
    "description": "Breaking down President Donald Trump's latest spin on his faltering economy, University of Michigan economics professor Justin Wolfers said his lies are so shocking he wonders if the president is suffering a mental breakdown, The Daily Beast reports.In his la…",
    "link": "https://www.rawstory.com/trumps-lies-about-costs-shows-something-is-very-wrong-inside-the-mans-mind-economist/",
    "timestamp": "2025-11-12T19:16:44Z"
  },
  {
    "title": "WLS: Judge orders release of hundreds arrested in Illinois immigration crackdown | CNN",
    "description": "A federal judge ordered the release of more than 600 people arrested as part of the Trump administration’s immigration crackdown in Illinois, according to CNN affiliate WLS, dealing a blow to federal efforts to detain and deport as many undocumented people as…",
    "link": "https://www.cnn.com/2025/11/12/us/chicago-ice-arrests-hearing",
    "timestamp": "2025-11-12T19:15:08Z"
  },
  {
    "title": "Circle shares slump after Q3 earnings despite big jump in revenue",
    "description": "Investors appeared concerned over declining interest rates and rising expenses at the stablecoin giant.",
    "link": "https://fortune.com/2025/11/12/circle-shares-slump-after-earnings/",
    "timestamp": "2025-11-12T19:15:08Z"
  },
  {
    "title": "Mike Johnson Will Finally Swear In His Worst Nightmare",
    "description": "More Epstein files could, in theory, be coming soon. That’s because, at 4 p.m. ET on Wednesday, House Speaker Mike Johnson will finally swear in Rep. Adelita Grijalva, the Arizona Democrat who has promised to provide the final congressional signature on a dis…",
    "link": "https://www.motherjones.com/politics/2025/11/mike-johnson-adelita-grijalva-jeffrey-epstein/",
    "timestamp": "2025-11-12T19:14:54Z"
  },
  {
    "title": "Elaine Luria helped investigate Jan. 6 and lost her House seat. Now she’s making a comeback bid",
    "description": "A Virginia Democrat who helped investigate Jan. 6 is making a comeback bid after last week’s sweeping election wins as her party looks to break President Trump’s grip on federal power in the 2026 midterms.",
    "link": "https://www.pbs.org/newshour/politics/elaine-luria-helped-investigate-jan-6-and-lost-her-house-seat-now-shes-making-a-comeback-bid",
    "timestamp": "2025-11-12T19:14:02Z"
  },
  {
    "title": "Karoline Leavitt Insists That Shocking Epstein Emails Only ‘Prove’ Trump Did ‘Nothing Wrong’",
    "description": "Karoline Leavitt claimed that bombshell emails from sex predator Jeffrey Epstein that reference President Trump only prove that Trump \"did nothing wrong.\"\nThe post Karoline Leavitt Insists That Shocking Epstein Emails Only ‘Prove’ Trump Did ‘Nothing Wrong’ fi…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-insists-that-shocking-epstein-emails-only-prove-trump-did-nothing-wrong/",
    "timestamp": "2025-11-12T19:11:19Z"
  },
  {
    "title": "Out Rep. Robert Garcia leads Dems in Epstein email release, which appears to reveal more Trump connections",
    "description": "Senate Democrats released on Wednesday a new batch of emails from the estate of the late convicted sex offender Jeffrey Epstein that mention Donald Trump. The emails now raise further questions about Trump and Epstein's friendship.",
    "link": "https://www.advocate.com/politics/garcia-democrats-emails-epstein-trump",
    "timestamp": "2025-11-12T19:11:10Z"
  },
  {
    "title": "Donald Trump Sprays Syrian President With Cologne During White House Visit",
    "description": "President Donald Trump is big on hospitality ... because he sprayed down Syria's president with his own cologne during a White House visit Monday. Trump was hosting Ahmed al-Sharaa in the Oval Office and insisted on showing off his Victory 47…\n Permalink",
    "link": "https://www.tmz.com/2025/11/12/donald-trump-syrian-president-visit/",
    "timestamp": "2025-11-12T19:11:07Z"
  },
  {
    "title": "Trump’s 50-year mortgages lose steam as industry questions costs",
    "description": "U.S. President Donald Trump’s 50-year mortgage idea is struggling to gain traction in the housing industry as experts dismiss it. Read more.",
    "link": "https://financialpost.com/real-estate/mortgages/trumps-50-year-mortgages-lose-steam-as-industry-questions-costs",
    "timestamp": "2025-11-12T19:07:08Z"
  },
  {
    "title": "Rick Scott calls Democrats 'heartless' as he pitches new Obamacare fix",
    "description": "Sen. Rick Scott's, R-Fla., pushes plan to send healthcare subsidy money directly to consumers rather than insurance companies.",
    "link": "https://www.foxnews.com/politics/rick-scott-calls-democrats-heartless-he-pitches-new-obamacare-fix",
    "timestamp": "2025-11-12T19:06:32Z"
  },
  {
    "title": "Trump Writes Letter Urging Israeli President Herzog To Pardon Netanyahu",
    "description": "President Donald Trump sent a formal letter to Israeli President Isaac Herzog urging him to pardon Prime Minister Benjamin Netanyahu.",
    "link": "https://dailycaller.com/2025/11/12/donald-trump-letter-isaac-herzog-pardon-benjamin-netanyahu/",
    "timestamp": "2025-11-12T19:04:47Z"
  },
  {
    "title": "Look out for these 5 factors to spark an everything rally in markets through year-end",
    "description": "The S&P 500 could break through 7,100 by the end of 2025 as the stock rally broadens out, according to a top Wells Fargo strategist.",
    "link": "https://www.businessinsider.com/stock-market-outlook-sp500-prediction-rally-shutdown-tax-earnings-tariffs-2025-11",
    "timestamp": "2025-11-12T19:04:23Z"
  },
  {
    "title": "The Trump Administration's Latest Housing 'Fix' Could Inflate Another Bubble",
    "description": "Socializing risk to subsidize demand isn't a solution to the housing crisis, but it is a good start to another financial crisis.",
    "link": "https://reason.com/2025/11/12/the-trump-administrations-latest-housing-fix-could-inflate-another-bubble/",
    "timestamp": "2025-11-12T19:03:43Z"
  },
  {
    "title": "Prabowo's foreign policy hints at what Indonesia gains from treaty with Australia",
    "description": "Details of an upgraded security treaty between Indonesia and Australia are yet to be made public, and the practical impact it will have on relations between the two countries depends on who you ask.",
    "link": "https://www.abc.net.au/news/2025-11-13/what-treaty-with-australia-means-for-indonesia/106002126",
    "timestamp": "2025-11-12T19:03:17Z"
  },
  {
    "title": "Donald Trump Is a Lamer Duck Than Ever (Mark Leibovich/The Atlantic)",
    "description": "Mark Leibovich / The Atlantic:\nDonald Trump Is a Lamer Duck Than Ever  —  Even though he doesn't want you to think so  —  For a president who wants to project vigor and command at all times, Donald Trump made the worst possible spectacle of himself in the Ova…",
    "link": "https://www.memeorandum.com/251112/p81",
    "timestamp": "2025-11-12T19:00:28Z"
  },
  {
    "title": "Trump's '50-Year Mortgage' Scheme Instantly Hated By Everyone Except Idiot Who Sold Him On It",
    "description": "Probably a week away from 'Bill Pulte? Never met him. He brought coffee sometimes.'",
    "link": "https://www.wonkette.com/p/trumps-50-year-mortgage-scheme-instantly",
    "timestamp": "2025-11-12T19:00:22Z"
  },
  {
    "title": "Sharon Osbourne tears up over Trump's heartfelt condolence call after Ozzy's death",
    "description": "Sharon Osbourne shared emotional voicemail from President Donald Trump after Ozzy's death. The family additionally received heartfelt condolences from King Charles III.",
    "link": "https://www.foxnews.com/entertainment/sharon-osbourne-tears-up-trumps-heartfelt-condolence-call-ozzys-death",
    "timestamp": "2025-11-12T19:00:00Z"
  }
]