[
  {
    "title": "Trump Admin Sues to Block Blue States From Taking Fossil Fuel Companies To Court Over Climate Change",
    "description": "The Trump administration filed lawsuits Wednesday against Michigan and Hawaii in an attempt to block the states from seeking damages in court against fossil fuel companies for alleged environmental harm.",
    "link": "https://wattsupwiththat.com/2025/05/01/trump-admin-sues-to-block-blue-states-from-taking-fossil-fuel-companies-to-court-over-climate-change/",
    "timestamp": "2025-05-02T01:00:00Z"
  },
  {
    "title": "Trump ‘blundered’ on China tariffs – Medvedev",
    "description": "The US tariffs on China are doomed to fail, former Russian President Dmitry Medvedev has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616647-trump-whiffed-with-china-tariffs/",
    "timestamp": "2025-05-02T00:58:16Z"
  },
  {
    "title": "Tokyo's Tariff Envoy Says US Talks 'Constructive'",
    "description": "Tokyo's envoy for US tariff talks in Washington said Thursday that the second round of negotiations between the two countries had been \"frank and constructive.\"",
    "link": "https://www.ibtimes.com/tokyos-tariff-envoy-says-us-talks-constructive-3772207",
    "timestamp": "2025-05-02T00:57:20Z"
  },
  {
    "title": "Mike Waltz Accidentally Reveals App Govt Uses to Archive Signal Messages",
    "description": "Article URL: https://www.404media.co/mike-waltz-accidentally-reveals-obscure-app-the-government-is-using-to-archive-signal-messages/\nComments URL: https://news.ycombinator.com/item?id=43865103\nPoints: 6\n# Comments: 1",
    "link": "https://www.404media.co/mike-waltz-accidentally-reveals-obscure-app-the-government-is-using-to-archive-signal-messages/",
    "timestamp": "2025-05-02T00:56:57Z"
  },
  {
    "title": "Chattanooga rally supports VW employees amid contract negotiations | Chattanooga Times Free Press",
    "description": "Chattanooga rally supports VW employees amid contract negotiations | Chattanooga Times Free Presstimesfreepress.com",
    "link": "https://www.timesfreepress.com/news/2025/may/01/local-rally-supports-vw-employees-amid-contract/",
    "timestamp": "2025-05-02T00:55:49Z"
  },
  {
    "title": "May Day Protestors Rally Against Trump Across the Nation",
    "description": "This year’s May Day, also known as International Workers Day, brought out thousands of labor unions around the nation to mark the historic recognition of the working class and mobilize protestors against current administrative policies championed by President…",
    "link": "http://www.rollingstone.com/culture/culture-pictures/photos-may-day-protest-nyc-2025-1235328851/",
    "timestamp": "2025-05-02T00:54:29Z"
  },
  {
    "title": "Tokyo’s tariff envoy says US talks ‘constructive’",
    "description": "Tokyo’s envoy for US tariff talks in Washington said Thursday that the second round of negotiations between the two countries had been “frank and constructive.” Japan, a key US ally and its biggest investor, is subject to the same 10 percent baseline tariffs …",
    "link": "https://www.digitaljournal.com/world/tokyos-tariff-envoy-says-us-talks-constructive/article",
    "timestamp": "2025-05-02T00:52:20Z"
  },
  {
    "title": "Army plans for a potential parade on Trump’s birthday call for 6,600 soldiers | CNN Politics",
    "description": "Detailed Army plans for a potential military parade on President Donald Trump’s birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and possibly a couple thousand civilians, The Associated Press has learned.",
    "link": "https://www.cnn.com/2025/05/01/politics/army-plans-military-parade-trump-birthday",
    "timestamp": "2025-05-02T00:51:36Z"
  },
  {
    "title": "Trump Boots Mike Waltz As National Security Adviser, Taps Marco Rubio As Interim Replacement",
    "description": "President Donald Trump’s national security team saw a major reshuffle with the removal of national security adviser Mike Waltz.\nWaltz, a former congressman recognized for his hawkish stance, has been nominated by Trump to serve as the U.S. ambassador to the U…",
    "link": "https://biztoc.com/x/753f2ed9c0486920",
    "timestamp": "2025-05-02T00:45:47Z"
  },
  {
    "title": "'Divine dreams' and 38 virgins at Trump prayer event",
    "description": "WASHINGTON &mdash; United States President Donald Trump was surrounded by faith leaders calling for him to be given \"divine dreams\" in an extraordinary event at the White House on Thursday.",
    "link": "https://www.bangkokpost.com/world/3016130/divine-dreams-and-38-virgins-at-trump-prayer-event",
    "timestamp": "2025-05-02T00:45:00Z"
  },
  {
    "title": "Stephen Miller just called out legacy media to their faces for defending cartel thugs",
    "description": "DC_Draino @DC_Draino Stephen Miller just called out legacy media to their faces for defending cartel thugs He says if he offered them a rent-free home in a neighborhood with MS-13 members, none of them would take it So why should other Americans be forced to …",
    "link": "https://freerepublic.com/focus/f-bloggers/4314520/posts",
    "timestamp": "2025-05-02T00:44:45Z"
  },
  {
    "title": "Army plans for a potential parade on Trump’s birthday call for 6,600 soldiers, AP learns",
    "description": "WASHINGTON (AP) — Detailed Army plans for a potential military parade on President Donald Trump’s birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and possibly a couple thousand civilians, The Associated P…",
    "link": "https://freerepublic.com/focus/f-chat/4314519/posts",
    "timestamp": "2025-05-02T00:43:43Z"
  },
  {
    "title": "Apple is getting punished for the one thing it did not deliver this quarter",
    "description": "Apple almost nailed it.",
    "link": "https://www.cnbc.com/2025/05/01/apple-is-getting-punished-for-one-thing-it-did-not-deliver-this-quarter.html",
    "timestamp": "2025-05-02T00:43:17Z"
  },
  {
    "title": "What Donald Trump said about Nick Saban, Kalen DeBoer and state of Alabama football",
    "description": "Shortly after taking the stage at Coleman Coliseum May 1, President Donald Trump talked Alabama football.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b5fbd0a9-50e5-4b88-b6c2-af5e3abc4897",
    "timestamp": "2025-05-02T00:42:12Z"
  },
  {
    "title": "Breitbart Business Digest: Consumers Aren't Front Running Tariffs",
    "description": "The supposed culprit of the import surge—consumer panic buying—simply isn’t real. Consumers are not front-running the tariffs, and that is good news.\nThe post Breitbart Business Digest: Consumers Aren’t Front Running Tariffs appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/05/01/breitbart-business-digest-consumers-arent-front-running-tariffs/",
    "timestamp": "2025-05-02T00:40:11Z"
  },
  {
    "title": "Army parade plans for Trump’s birthday call for 6,600 soldiers, 150 vehicles and 50 helicopters, AP reports",
    "description": "Detailed Army plans for a potential military parade on President Donald Trump’s birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and potentially a couple thousand civilians.",
    "link": "https://www.pbs.org/newshour/nation/army-parade-plans-for-trumps-birthday-call-for-6600-soldiers-150-vehicles-and-50-helicopters-ap-reports",
    "timestamp": "2025-05-02T00:38:27Z"
  },
  {
    "title": "Trump company struck deal for luxury golf resort in Qatar",
    "description": "The Trump family company has struck a deal for a luxury golf resort in Qatar.",
    "link": "https://www.ketv.com/article/trump-qatar-golf-resort-deal-ethics/64639239",
    "timestamp": "2025-05-02T00:35:23Z"
  },
  {
    "title": "Oil Renews Slide Before OPEC+ Meeting That May Agree Supply Hike",
    "description": "Oil declined at the end of a volatile week as traders weighed a potential supply hike from OPEC+ and the trade war’s risks to demand, against a fresh threat of US sanctions against Iranian flows.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-renews-slide-before-opec-meeting-that-may-agree-supply-hike",
    "timestamp": "2025-05-02T00:30:42Z"
  },
  {
    "title": "Trump’s health agency urges therapy for transgender youth, not broader gender-affirming healthcare",
    "description": "President Donald Trump’s administration released a lengthy review of transgender health care on Thursday that advocates for a greater reliance on behavioral therapy rather than broad gender-affirming medical care for youths with gender dysphoria.",
    "link": "https://www.wmbfnews.com/2025/05/01/trumps-health-agency-urges-therapy-transgender-youth-not-broader-gender-affirming-healthcare/",
    "timestamp": "2025-05-02T00:30:38Z"
  },
  {
    "title": "Foreign funds sour on US corporate bonds as Trump sows chaos",
    "description": "Investors outside the US turned into net sellers of corporate debt in the first half of April, after US President Donald Trump announced the highest tariffs on foreign countries in more than a century. That's according to data tracking direct flows compiled b…",
    "link": "https://economictimes.indiatimes.com/markets/bonds/foreign-funds-sour-on-us-corporate-bonds-as-trump-sows-chaos/articleshow/120807139.cms",
    "timestamp": "2025-05-02T00:30:14Z"
  },
  {
    "title": "Watch Live: Donald Trump Delivers Commencement Address at University of Alabama",
    "description": "President Donald Trump delivers a commencement address at the University of Alabama on Thursday, May 1.\nThe post Watch Live: Donald Trump Delivers Commencement Address at University of Alabama appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/01/watch-live-donald-trump-delivers-commencement-address-at-university-of-alabama/",
    "timestamp": "2025-05-02T00:29:57Z"
  },
  {
    "title": "Trump administration asks Supreme Court to strip legal protections from 350,000 Venezuelan migrants",
    "description": "WASHINGTON (AP) — The Trump administration on Thursday asked the Supreme Court to strip temporary legal protections from 350,000 Venezuelans, potentially exposing them to being deported.The Justice Department asked the high court to put on hold a ruling from …",
    "link": "https://freerepublic.com/focus/f-news/4314518/posts",
    "timestamp": "2025-05-02T00:29:14Z"
  },
  {
    "title": "Aritzia diversifying away from China amid tariff tensions: CEO",
    "description": "Aritzia is shifting some of its supply chain away from China, which has been hammered with triple-digit tariffs from the U.S. Read more.",
    "link": "https://financialpost.com/news/retail-marketing/aritzia-china-tariff-tensions",
    "timestamp": "2025-05-02T00:27:42Z"
  },
  {
    "title": "Aritzia diversifying away from China as tariff tensions continue: CEO",
    "description": "Aritzia Inc. says it is shifting some of its supply chain away from China, which has been hammered with triple-digit tariffs from the United States. The Vancouver-based apparel company said Thursday that the Asian nation is one of the top three countries it r…",
    "link": "https://financialpost.com/pmn/aritzia-diversifying-away-from-china-as-tariff-tensions-continue-ceo-2",
    "timestamp": "2025-05-02T00:27:42Z"
  },
  {
    "title": "‘Divine dreams’ and 38 virgins at Trump prayer event",
    "description": "US President Donald Trump was surrounded by faith leaders calling for him to be given “divine dreams” in an extraordinary event at the White House on Thursday. One man even knelt in front of the 78-year-old Republican for the ceremony in the Rose Garden to ma…",
    "link": "https://www.digitaljournal.com/world/divine-dreams-and-38-virgins-at-trump-prayer-event/article",
    "timestamp": "2025-05-02T00:27:20Z"
  },
  {
    "title": "'Divine Dreams' And 38 Virgins At Trump Prayer Event",
    "description": "US President Donald Trump was surrounded by faith leaders calling for him to be given \"divine dreams\" in an extraordinary event at the White House on Thursday.",
    "link": "https://www.ibtimes.com/divine-dreams-38-virgins-trump-prayer-event-3772204",
    "timestamp": "2025-05-02T00:27:07Z"
  },
  {
    "title": "Trump ousts White House national security adviser Waltz, replaces him with Rubio",
    "description": "Waltz was blamed for accidentally adding the editor of The Atlantic magazine to a private thread describing details of an imminent U.S. bombing campaign in Yemen.",
    "link": "https://www.japantimes.co.jp/news/2025/05/02/world/politics/trump-replaces-waltz/",
    "timestamp": "2025-05-02T00:26:00Z"
  },
  {
    "title": "Apple says most iPhones sold in US will be from India",
    "description": "Apple has for years relied on Chinese factories to make its iPhones. But it's shifting some production to India to mitigate potential Trump tariffs. Apple CEO Tim Cook said Thursday that India will play a major role in making iPhones destined for the US marke…",
    "link": "https://www.dw.com/en/apple-says-most-iphones-sold-in-us-will-be-from-india/a-72411418",
    "timestamp": "2025-05-02T00:25:00Z"
  },
  {
    "title": "US-Iran nuclear talks delayed amid tensions over sanctions",
    "description": "A planned fourth round of US-Iran nuclear talks scheduled for Saturday postponed, with Iran citing US sanctions and approach as key factors.",
    "link": "https://www.israelnationalnews.com/news/407725",
    "timestamp": "2025-05-02T00:24:21Z"
  },
  {
    "title": "Soldier at a Colorado nightclub during an immigration raid charged with distributing cocaine",
    "description": "A soldier present at an after-hours nightclub where more than 100 immigrants suspected of being in the U.S. illegally were taken into custody has been charged with distributing cocaine",
    "link": "https://abcnews.go.com/US/wireStory/soldier-colorado-nightclub-immigration-raid-charged-distributing-cocaine-121373527",
    "timestamp": "2025-05-02T00:22:16Z"
  },
  {
    "title": "Trump fires back after Sanders mocks crowd size at rally",
    "description": "Vermont Sen. Bernie Sanders took a shot at the president on social media on Wednesday and Donald Trump is firing back.",
    "link": "https://www.wcax.com/2025/05/01/trump-fires-back-after-sanders-mocks-crowd-size-rally/",
    "timestamp": "2025-05-02T00:20:25Z"
  },
  {
    "title": "Top NSC official wants to normalize offensive hacking as tool of US might",
    "description": "At the RSAC Conference, Alexei Bulazel said hacking back against adversaries could be the new norm for America’s cyber strategy. He signaled support for various federal cyber offices, but acknowledged they’d be geared in the direction of Trump-era goals.",
    "link": "https://www.nextgov.com/cybersecurity/2025/05/top-nsc-official-wants-normalize-offensive-hacking-tool-us-might/405014/",
    "timestamp": "2025-05-02T00:18:00Z"
  },
  {
    "title": "US robot makers hope to beat China in humanoid race. Tariffs could affect their ambitions",
    "description": "For now, humanoids are still a niche but one that invites intense curiosity.",
    "link": "https://www.bostonherald.com/2025/05/01/trump-tariffs-robots/",
    "timestamp": "2025-05-02T00:17:43Z"
  },
  {
    "title": "Exclusive — Trump Justice Department Budget Request Depoliticizes FBI and ATF, Supports Law Enforcement, and Focuses on Fighting Crime",
    "description": "President Donald Trump's fiscal year 2026 budget request for the Justice Department will work to depoliticize the FBI and focus on fighting crime and combatting illegal immigration, Breitbart News has learned exclusively.\nThe post Exclusive — Trump Justice De…",
    "link": "https://www.breitbart.com/politics/2025/05/01/exclusive-trump-justice-department-budget-request-depoliticizes-fbi-and-atf-supports-law-enforcement-and-focuses-on-fighting-crime/",
    "timestamp": "2025-05-02T00:14:41Z"
  },
  {
    "title": "Justice Department sues Hawaii, Michigan, Vermont and New York over state climate actions",
    "description": "The Justice Department is suing four states over climate action",
    "link": "https://abcnews.go.com/Politics/wireStory/justice-department-sues-hawaii-michigan-vermont-new-york-121367111",
    "timestamp": "2025-05-02T00:14:21Z"
  },
  {
    "title": "US says minerals deal will strengthen Trump in talks with Russia",
    "description": "KYIV: Kyiv and Washington on Thursday (May 1) hailed a deal giving the United States preferential access to new Ukrainian minerals as a milestone that a top US official said would strengthen President Donald Tr",
    "link": "https://www.channelnewsasia.com/world/us-says-minerals-deal-will-strengthen-trump-talks-russia-5102776",
    "timestamp": "2025-05-02T00:14:00Z"
  },
  {
    "title": "Harvard doesn’t deserve Trump’s wrath",
    "description": "You would think that if Donald Trump really wanted to make America great again, he might avoid taking steps that could irreparably damage its most famous university, one which has contributed more than any other to the prestige of American science and learnin…",
    "link": "https://biztoc.com/x/7b392db3cc478b89",
    "timestamp": "2025-05-02T00:13:13Z"
  },
  {
    "title": "Trump 'Saddened' That China Getting 'Hammered' by Tariffs",
    "description": "President Donald Trump says China is \"getting absolutely hammered\" by tariffs. He argued Wednesday during a Cabinet meeting that a recent fall in cargo flows indicated that Beijing would soon need to engage with him. The president said he was “not happy” with…",
    "link": "https://biztoc.com/x/d13c14eda549b8dc",
    "timestamp": "2025-05-02T00:13:01Z"
  },
  {
    "title": "Mike Waltz Named UN Envoy, Rubio Becomes Interim National Security Adviser",
    "description": "U.S. President Donald Trump ousted his national security adviser Mike Waltz on Thursday and named Secretary of State Marco Rubio as his interim replacement in the first major shakeup of Trump&#039;s inner circle since he took office in January.",
    "link": "https://www.ndtv.com/world-news/trump-nominates-mike-waltz-as-un-ambassador-makes-marco-rubio-interim-nsa-8308574",
    "timestamp": "2025-05-02T00:11:42Z"
  },
  {
    "title": "CIA releases videos encouraging Chinese officials to leak secrets to US",
    "description": "The CIA has released two short videos that appear designed to tap into possible discontent in the Chinese government and encourage leaks of sensitive state secrets to the US.",
    "link": "https://www.abc.net.au/news/2025-05-02/cia-releases-mandarin-videos-to-lure-chinese-information-leaks/105242672",
    "timestamp": "2025-05-02T00:11:32Z"
  },
  {
    "title": "Trump will address graduating students at the University of Alabama",
    "description": "President Donald Trump is set to address graduating students at the University of Alabama",
    "link": "https://abcnews.go.com/US/wireStory/trump-address-graduating-students-university-alabama-121358092",
    "timestamp": "2025-05-02T00:06:31Z"
  },
  {
    "title": "Army plans for a potential parade on Trump's birthday call for 6,600 soldiers, AP learns",
    "description": "Detailed Army plans for a potential military parade on President Donald Trump’s birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and potentially a couple thousand civilians",
    "link": "https://abcnews.go.com/US/wireStory/army-plans-potential-parade-trumps-birthday-call-6600-121379699",
    "timestamp": "2025-05-02T00:06:30Z"
  },
  {
    "title": "Talks or no talks: who blinks first in US-China trade war?",
    "description": "Donald Trump and Xi Jinping are locked in a game of chicken - despite wanting the same outcome.",
    "link": "https://www.bbc.com/news/articles/cg419qw9g15o",
    "timestamp": "2025-05-02T00:06:21Z"
  },
  {
    "title": "Trump threatens sanctions against buyers of Iranian oil after US-Iran nuclear talks are postponed",
    "description": "President Donald Trump is threatening sanctions on anyone who buys Iranian oil",
    "link": "https://abcnews.go.com/International/wireStory/trump-threatens-sanctions-buyers-iranian-oil-after-us-121358617",
    "timestamp": "2025-05-02T00:06:20Z"
  },
  {
    "title": "Rogan mocks 'my favorite podcaster' Gavin Newsom as Democrats attempt to recapture podcasting",
    "description": "The host of \"The Joe Rogan Experience\" skewered California Gov. Gavin Newsom's podcast, initially thinking it had been canceled because so few people were talking about it.",
    "link": "https://www.foxnews.com/media/rogan-mocks-my-favorite-podcaster-gavin-newsom-democrats-attempt-recapture-podcasting",
    "timestamp": "2025-05-02T00:00:23Z"
  },
  {
    "title": "President Trump’s Truth+ Considering Releasing New ‘Utility Token’ and Crypto Wallet for Its Ecosystem",
    "description": "President Donald Trump’s Truth+ video streaming app is considering releasing a utility token. Devin Nunes, the chief executive and chairman of the Trump Media & Technology Group (TMTG), says in a new shareholder letter that the firm is exploring a token and a…",
    "link": "https://dailyhodl.com/2025/05/01/president-trumps-truth-considering-releasing-new-utility-token-and-crypto-wallet-for-its-ecosystem/",
    "timestamp": "2025-05-02T00:00:16Z"
  },
  {
    "title": "Americans recognize Canada as most important US ally, despite Trump claims: poll",
    "description": "Despite U.S. President Donald Trump's repeated claim that Canada has been ripping off the United States, new polling suggests the percentage of Americans identifying Canada as their country's most important ally has doubled.",
    "link": "https://www.nationalobserver.com/2025/05/01/news/us-canada-ally-trump-poll",
    "timestamp": "2025-05-02T00:00:14Z"
  },
  {
    "title": "Genocide’s Back: Trump-Backed Israeli Brutality",
    "description": "* Warning: indelicate language. If we in the West are the most propagandized people in the world; Gazans are the least propagandized. Outwardly captives, Gazans are liberated from the illiberal political propaganda that grips the West WHAT has Israel been up …",
    "link": "https://www.activistpost.com/genocides-back-trump-backed-israeli-brutality/",
    "timestamp": "2025-05-02T00:00:00Z"
  },
  {
    "title": "Victor Davis Hanson: DEI, Counter Revolutions And Why Trump Is A 'Tragic Hero'",
    "description": "Hoover Institution fellow Victor Davis Hanson talks about the first 100 days of Donald Trump’s second presidency, describing it as a bold counterrevolution against decades of cultural, political, and economic drift. He discusses Trump’s sweeping agenda—from c…",
    "link": "https://www.hoover.org/research/victor-davis-hanson-dei-counter-revolutions-and-why-trump-tragic-hero",
    "timestamp": "2025-05-02T00:00:00Z"
  },
  {
    "title": "Allies At War: A 'Revelatory' Account Of The Second World War",
    "description": "Hoover Institution fellow Andrew Roberts on Tim Bouverie's book; as well as being historically illuminating, Bouverie's book is also \"extremely timely\", said Roberts, – for it comes at a time when, thanks to Donald Trump, the Western alliance that has \"kept t…",
    "link": "https://www.hoover.org/research/allies-war-revelatory-account-second-world-war",
    "timestamp": "2025-05-02T00:00:00Z"
  },
  {
    "title": "Victor Davis Hanson: Donald Trump Brought A Plan. The Left Brought Hysterics",
    "description": "Hoover Institution fellow Victor Davis Hanson notes that whether you like President Donald Trump or not, he is embracing policies that BOTH Democrats and Republicans saw as solutions in the past. Only difference is, today, Democrats are terrified of President…",
    "link": "https://www.hoover.org/research/victor-davis-hanson-donald-trump-brought-plan-left-brought-hysterics",
    "timestamp": "2025-05-02T00:00:00Z"
  },
  {
    "title": "Trump’s Assault on PBS and NPR Chooses Oligarchy Over Press Freedom and Democracy",
    "description": "Politics\n \n \n / \n May 2, 2025\n \r\n\n \nTrump’s Assault on PBS and NPR Chooses Oligarchy Over Press Freedom and Democracy\r\n\n\n\nAs the supporters of speaking truth to power celebrate World Press Freedom Day, Trump seeks to defund public media in the United States.\r…",
    "link": "https://www.thenation.com/article/archive/trump-npr-pbs-threat/",
    "timestamp": "2025-05-02T00:00:00Z"
  },
  {
    "title": "Miles Yu: Trump Bringing Other Parts of The World Along With the US in Economically Isolating China",
    "description": "Hoover Institution fellow Miles Yu discusses his insights and analysis of President Donald Trump’s first 100 days in office during his second term, Trump’s most effective policy toward China, and how the US economy relates to national security.",
    "link": "https://www.hoover.org/research/miles-yu-trump-bringing-other-parts-world-along-us-economically-isolating-china",
    "timestamp": "2025-05-02T00:00:00Z"
  },
  {
    "title": "Canada's auto industry gets more relief from Trump's tariffs",
    "description": "U.S. Customs and Border Protection guidance released today says automobile parts compliant with the Canada-U.S.-Mexico Agreement on trade will not be subject to the 25 per cent auto part tariffs that were set to go in place on May 3.",
    "link": "https://www.nationalobserver.com/2025/05/01/news/canadian-auto-trump-tariffs-relief",
    "timestamp": "2025-05-01T23:58:44Z"
  },
  {
    "title": "Maine Teacher Calls for Secret Service to Assassinate Trump, Administration",
    "description": "A Maine teacher has called for President Donald Trump and members of his administration to be killed, according to news reports. JoAnna St. Germain, an English teacher at Waterville Senior High School, made Facebook posts on Tuesday calling on the Secret Serv…",
    "link": "https://freerepublic.com/focus/f-news/4314511/posts",
    "timestamp": "2025-05-01T23:58:13Z"
  },
  {
    "title": "Gov. Whitmer Addresses Her Controversial Working Relationship With Trump",
    "description": "Michigan's Democratic governor previously said she'd \"work with anyone to move our state forward.\"",
    "link": "https://www.huffpost.com/entry/gov-whitmer-says-her-controversial-relationship-with-trump-doesnt-mean-ive-abandoned-any-of-my-values_n_6813d643e4b099406f21f6e4",
    "timestamp": "2025-05-01T23:57:34Z"
  },
  {
    "title": "Kamala Harris weighs run for governor or another presidential bid",
    "description": "In her first major public remarks since her 2024 presidential defeat, Kamala Harris acknowledged she's thinking about her next political steps.",
    "link": "https://www.cbsnews.com/news/kamala-harris-california-governor-or-presidential-bid/",
    "timestamp": "2025-05-01T23:55:42Z"
  },
  {
    "title": "\"Economic Terrorism\": Iran Slams Fresh US Sanctions",
    "description": "Iranian Foreign Ministry spokesman Esmaeil Baghaei has strongly condemned fresh US sanctions on individuals and entities in Iran and other countries on the pretext of cooperating with Tehran in different areas.",
    "link": "https://www.ndtv.com/world-news/economic-terrorism-iran-slams-fresh-us-sanctions-8308509",
    "timestamp": "2025-05-01T23:51:54Z"
  },
  {
    "title": "Did Donald Trump — or ABC News — choose who would interview the president? Why does it matter?",
    "description": "The interview exposed a delicate question for journalists.",
    "link": "https://www.bostonherald.com/2025/05/01/media-trump-abc-explained/",
    "timestamp": "2025-05-01T23:49:38Z"
  },
  {
    "title": "Vance denies Waltz's removal as NSA was due to 'Signalgate,' calls his UN ambassador nomination a 'promotion'",
    "description": "Vice President JD Vance discusses Mike Waltz's ouster as national security advisor, \"Signalgate\" and strikes against the Houthis during an exclusive interview on 'Special Report.'",
    "link": "https://www.foxnews.com/media/vance-denies-waltzs-removal-nsa-due-signalgate-calls-his-un-ambassador-nomination-promotion",
    "timestamp": "2025-05-01T23:49:16Z"
  },
  {
    "title": "Waltz was photographed using Signal during Cabinet meeting a day before his removal",
    "description": "Mike Waltz was photographed using Signal in a Cabinet meeting the day before Trump announced he was replacing him as national security adviser.",
    "link": "https://abcnews.go.com/Politics/waltz-photographed-signal-trumps-cabinet-meeting-day-removal/story?id=121373232",
    "timestamp": "2025-05-01T23:48:16Z"
  },
  {
    "title": "Trump Administration Peddles Junk Science, Conversion Therapy In Youth Trans Health Care Report",
    "description": "LGBTQ+ advocates and researchers say the report helps push Trump’s agenda of eliminating gender-affirming care for youth.",
    "link": "https://www.huffpost.com/entry/hhs-trump-trans-youth-health-care-review_n_6813fa5de4b0fe32871bb0c1",
    "timestamp": "2025-05-01T23:47:45Z"
  },
  {
    "title": "U.N. considers major overhaul amid funding crisis, internal memo shows",
    "description": "Deep budget shortfalls — 20% staffing cuts at UNICEF, 30% at the migration agency—have spurred urgent calls for “bold and immediate” efficiency measures.",
    "link": "https://www.japantimes.co.jp/news/2025/05/02/world/politics/united-nations-overhaul/",
    "timestamp": "2025-05-01T23:46:00Z"
  },
  {
    "title": "Bret Baier Confronts JD Vance on Poor Economic Data: ‘The Economy Shrank’",
    "description": "Vice President JD Vance deflected when Fox News's Bret Baier pointed out the economy contracted during the first quarter of the Trump administration.\nThe post Bret Baier Confronts JD Vance on Poor Economic Data: ‘The Economy Shrank’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/bret-baier-confronts-jd-vance-on-poor-economic-data-the-economy-shrank/",
    "timestamp": "2025-05-01T23:44:31Z"
  },
  {
    "title": "Recession Indicators Aren't Always Metrics. Sometimes, They're Memes",
    "description": "Cultural memes on social media are documenting widespread fear over an economic downturn. But are they accurate?",
    "link": "https://www.cnet.com/personal-finance/banking/how-to-know-which-recession-indicators-are-real/",
    "timestamp": "2025-05-01T23:44:07Z"
  },
  {
    "title": "Hasbro CEO details tariff impact: 'We're making rapid changes'",
    "description": "In a Thursday interview with CNBC's Jim Cramer, Hasbro CEO Chris Cocks explained how the toy maker is trying to diversify its supply chain.",
    "link": "https://www.cnbc.com/2025/05/01/hasbro-ceo-details-tariff-impact-were-making-rapid-changes.html",
    "timestamp": "2025-05-01T23:43:39Z"
  },
  {
    "title": "Army's Massive Parade for Trump's Birthday Includes Plan for 6,600 Troops",
    "description": "President Trump has long pushed for a grand military parade since witnessing France's Bastille Day parade in 2017.",
    "link": "https://www.newsweek.com/armys-massive-parade-trumps-birthday-includes-plan-6600-troops-2067045",
    "timestamp": "2025-05-01T23:42:09Z"
  },
  {
    "title": "Allegations Shri Thanedar abandoned animals at testing lab resurfaced after attempt to impeach Trump",
    "description": "A business management consulting firm took over running six of Thanedar's companies in 2010 after they defaulted on loan payments.",
    "link": "https://www.snopes.com//news/2025/05/01/shri-thanedar-dogs-monkeys/",
    "timestamp": "2025-05-01T23:41:00Z"
  },
  {
    "title": "Apple braces for $900m blow from Trump tariffs",
    "description": "Apple braces for $900m blow from Trump tariffs\nTariffs on goods coming into the US will add nearly a billion dollars to Apple's costs this quarter, the tech giant has said, despite President Donald Trump's decision to spare key electronics from the new import…",
    "link": "https://biztoc.com/x/0c73f7f77f1a4885",
    "timestamp": "2025-05-01T23:40:00Z"
  },
  {
    "title": "Trump Crypto Corruption Intensifies as Abu Dhabi Firm Invests $2 Billion",
    "description": "Donald Trump and his family continue to cash in on cryptocurrency from entities looking to curry influence with the president and his administration — which is simultaneously working to deregulate the industry.\nAt a crypto conference in the United Arab Emirat…",
    "link": "https://biztoc.com/x/6b4eb0a7a62f9985",
    "timestamp": "2025-05-01T23:39:54Z"
  },
  {
    "title": "What “anti-DEI” actually means to conservatives",
    "description": "It means things like “it’s fine for African-Americans to be exposed to untreated sewage“: For the last 14 years, when it rains in Lowndes County, Alabama, contaminated standing water builds up around Annye Burke’s home. When the septic tank breaks down, raw s…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/what-anti-dei-actually-means-to-conservatives",
    "timestamp": "2025-05-01T23:39:37Z"
  },
  {
    "title": "Aritzia diversifying away from China as tariff tensions continue: CEO",
    "description": "Aritzia Inc. says it is shifting some of its supply chain away from China, which has been hammered with triple-digit tariffs from the United States. The Vancouver-based apparel company said Thursday that the Asian nation is one of the top three countries it r…",
    "link": "https://financialpost.com/pmn/aritzia-diversifying-away-from-china-as-tariff-tensions-continue-ceo",
    "timestamp": "2025-05-01T23:36:39Z"
  },
  {
    "title": "Trump Title IX team probing education chief who called it 'inaccurate' to say there are only boys and girls",
    "description": "President Donald Trump's newly formed Title IX investigative team is launching an investigation into the Washington state superintendent of public instruction.",
    "link": "https://www.foxnews.com/sports/trump-title-ix-team-probing-education-chief-who-called-inaccurate-say-theres-only-boys-girls",
    "timestamp": "2025-05-01T23:36:04Z"
  },
  {
    "title": "Trump says it's Biden's economy, but businesses and economists beg to differ (Associated Press)",
    "description": "Associated Press:\nTrump says it's Biden's economy, but businesses and economists beg to differ  —  When the stock market was climbing in January 2024, Donald Trump knew exactly who deserved credit: He did.  Nearly a year before his return to the White House, …",
    "link": "https://www.memeorandum.com/250501/p141",
    "timestamp": "2025-05-01T23:35:06Z"
  },
  {
    "title": "Donald Trump's baffling health mystery from 'forged' medical report to 'astonishing' weight loss - NewsBreak",
    "description": "Donald Trump has long been secretive about his health, and a recent report from his physician has claimed that the 78-year-old is 'fully fit to execute the",
    "link": "https://www.newsbreak.com/share/3986114196727-donald-trump-s-baffling-health-mystery-from-forged-medical-report-to-astonishing-weight-loss?_f=app_share&amp;pd=0DVWQmpv&amp;lang=en_US&amp;send_time=1746142401&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.15.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-control%2Cns_foryou_recall_exp_25q2-v5%2Cns_foryou_model_exp_25q2_v2-v6%2Cns_foryou_rank_exp_25q2-v3%2Cns_local_strategy_25q1_exp-control&amp;s=i2",
    "timestamp": "2025-05-01T23:33:59Z"
  },
  {
    "title": "Trump administration discontinues $1 billion in school mental health grants - NewsBreak",
    "description": "The Trump administration will not renew Biden-era grants worth $1 billion that were aimed at boosting mental health services in schools, a Department of E",
    "link": "https://www.newsbreak.com/share/3987831392442-trump-administration-discontinues-1-billion-in-school-mental-health-grants?_f=app_share&amp;pd=0BUXWIYR&amp;lang=en_US&amp;send_time=1746142342&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.17.1.6%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v5%2Cns_foryou_recall_exp_25q2-control%2Cns_local_strategy_25q1_exp-v7&amp;s=i2",
    "timestamp": "2025-05-01T23:32:48Z"
  },
  {
    "title": "Liberation Day might have cost you Independence Day: Firework costs skyrockets on Trump tariffs",
    "description": "Consumers could be waiting for fireworks until 2026",
    "link": "https://www.independentespanol.com/estilo/viajes/vuelo-mh370-desaparicion-malasia-airlines-teorias-b2540391.html",
    "timestamp": "2025-05-01T23:31:06Z"
  },
  {
    "title": "Pam Bondi Claims Donald Saved 258 Million Lives From Fentanyl",
    "description": "Trump Attorney General Pam Bondi claimed Trump saved two-thirds of the country from overdosing from fentanyl in today's Trump North Korean-style Dear Leader Cabinet meeting. \nBondi tweeted out yesterday that Trump saved 119 Million lives, a number that ties t…",
    "link": "https://crooksandliars.com/2025/04/pam-bondi-claims-trump-saved-258-million",
    "timestamp": "2025-05-01T23:31:04Z"
  },
  {
    "title": "Patrick Mahomes' Comment on New Haircut Sparks Backlash on Social Media",
    "description": "Patrick Mahomes is facing controversy for referring to his hair as \"nappy\" in a recent local news interview about his haircut.",
    "link": "https://people.com/patrick-mahomes-nappy-hair-comment-sparks-backlash-social-media-11726821",
    "timestamp": "2025-05-01T23:30:39Z"
  },
  {
    "title": "US Export-Import Bank Lifts Curbs on Coal Plant Loans After Trump Order",
    "description": "The bank’s board voted to repeal the 12-year-old restrictions in a move decried by environmentalists.",
    "link": "https://financialpost.com/pmn/business-pmn/us-export-import-bank-lifts-curbs-on-coal-plant-loans-after-trump-order",
    "timestamp": "2025-05-01T23:29:35Z"
  },
  {
    "title": "Thousands rally in Boston, and nationwide, over Trump administrations policies",
    "description": "This May Day, workers are sending out a call for action and solidarity in the face of unprecedented challenges.",
    "link": "https://www.bostonherald.com/2025/05/01/thousands-rally-in-boston-and-nationwide-over-trump-administrations-policies/",
    "timestamp": "2025-05-01T23:29:27Z"
  },
  {
    "title": "Tailwind To Turbulence: Why $8 Billion In Climate Projects Just Vanished",
    "description": "Climate tech faces $8B in U.S. project cancellations amid policy shifts, while other countries like Canada look to fill the gap with bold carbon removal plans",
    "link": "https://www.forbes.com/sites/phildeluna/2025/05/01/tailwind-to-turbulence-why-8-billion-in-climate-projects-just-vanished/",
    "timestamp": "2025-05-01T23:27:31Z"
  },
  {
    "title": "Canadian automobile parts won’t be hit with Trump’s tariffs",
    "description": "WASHINGTON — U.S. Customs and Border Protection guidance released on Thursday said automobile parts compliant with the Canada-U.S.-Mexico Agreement on trade will not be hit with President Donald Trump’s tariffs. It’s the latest sign of relief for the deeply i…",
    "link": "https://financialpost.com/pmn/canadian-automobile-parts-wont-be-hit-with-trumps-tariffs",
    "timestamp": "2025-05-01T23:27:24Z"
  },
  {
    "title": "Yes, Pam Bondi claimed fentanyl seizures under Trump have saved 258M people",
    "description": "On April 30, 2025, U.S. Attorney General Pam Bondi said fentanyl seizures in the first 100 days of President Donald Trump's second term have \"saved 258 million lives.\"",
    "link": "https://www.snopes.com//fact-check/pam-bondi-fentanyl-258m/",
    "timestamp": "2025-05-01T23:27:00Z"
  },
  {
    "title": "Plans for potential parade on Trump's birthday call for 6,600 soldiers",
    "description": "Plans for potential parade on Trump's birthday call for 6,600 soldierstwincities.com",
    "link": "https://www.twincities.com/2025/05/01/trump-military-birthday-parade/",
    "timestamp": "2025-05-01T23:26:32Z"
  },
  {
    "title": "‘You Shot Him in the Ear’: Jesse Watters Jabs Jessica Tarlov for Trump Murder Attempt After She Criticizes ICE",
    "description": "Fox News host Jesse Watters jokingly accused co-host Jessica Tarlov of shooting President Donald Trump in the ear on Thursday during an argument.\nThe post ‘You Shot Him in the Ear’: Jesse Watters Jabs Jessica Tarlov for Trump Murder Attempt After She Criticiz…",
    "link": "https://www.mediaite.com/tv/you-shot-him-in-the-ear-jesse-watters-jabs-jessica-tarlov-for-trump-murder-attempt-after-she-criticizes-ice/",
    "timestamp": "2025-05-01T23:23:19Z"
  },
  {
    "title": "HHS breaks with major U.S. medical groups in review of pediatric gender care",
    "description": "The Department of Health and Human Services released a review on Thursday that found that the quality of evidence regarding the effects of transition-related care for minors “is very low,” and that, as a result, many U.S. doctors have managed to unintentional…",
    "link": "https://www.nbcnews.com/nbc-out/out-health-and-wellness/hhs-breaks-major-us-medical-groups-review-pediatric-gender-care-rcna204185",
    "timestamp": "2025-05-01T23:23:10Z"
  },
  {
    "title": "Bernie Sanders Takes a Shot at Chuck Schumer as Democratic Party Infighting Escalates",
    "description": "After Schumer told CNN the Senate Democratic Caucus is “totally united,” Sanders told the network he thinks the party needs “an agenda.”",
    "link": "https://www.westernjournal.com/united-around-bernie-sanders-snipes-chuck-schumer-claim-senate-dems-unified/",
    "timestamp": "2025-05-01T23:22:15Z"
  },
  {
    "title": "Army plans for a potential parade on Trump’s birthday call for 6,600 soldiers, AP learns",
    "description": "It would likely cost tens of millions of dollars to put on such an event.",
    "link": "https://www.bostonherald.com/2025/05/01/trump-military-birthday-parade/",
    "timestamp": "2025-05-01T23:21:44Z"
  },
  {
    "title": "'Chopped up my quote!' Trump DOJ official rages at NYT after new report",
    "description": "President Donald Trump's Deputy Attorney General Todd Blanche was enraged Thursday that The New York Times didn't use the entirety of a quote he provided on their latest reporting about the prosecutions of Columbia University protesters.The Times article pain…",
    "link": "https://www.rawstory.com/todd-blanche-2671879655/",
    "timestamp": "2025-05-01T23:21:21Z"
  },
  {
    "title": "ACT Expo 2025 – one step forward, two steps back for clean trucking [part 1]",
    "description": "ACT Expo is North America’s premier clean truck and transport trade show – and for 2025 it was bigger than ever, with more exhibitors and more, more capable battery electric vehicles than ever. The downsides? NACFE have scored with their “messy middle” messag…",
    "link": "http://electrek.co/2025/05/01/act-expo-2025-one-step-forward-two-steps-back-for-clean-trucking-part-1/",
    "timestamp": "2025-05-01T23:21:03Z"
  },
  {
    "title": "‘It’s a Game Changer’: Mineral Deal Raises Hopes of GOP Uniting Behind Ukraine",
    "description": "A landmark agreement for Ukraine to hand over half of its future oil, gas and mineral wealth to the U.S. may be thawing a cold war within the Republican Party. For more than a year, Republicans have been at odds over the war-torn country, with Trump-aligned l…",
    "link": "https://time.com/7282110/ukraine-minerals-deal/",
    "timestamp": "2025-05-01T23:20:51Z"
  },
  {
    "title": "US small parcels loophole set to close, pushing up prices at Shein and Temu",
    "description": "US small parcels loophole set to close, pushing up prices at Shein and Temu\nA duty-free loophole for low-value packages is about to be closed by President Donald Trump, pushing up prices for US customers of firms like Shein and Temu.\nThe Chinese online retail…",
    "link": "https://biztoc.com/x/bcdf8299f95e62c2",
    "timestamp": "2025-05-01T23:18:13Z"
  },
  {
    "title": "Trump Sidelines Mike Waltz as National Security Adviser",
    "description": "President Donald Trump said he will nominate Michael Waltz, his current national security adviser, to be the next US ambassador to the UN, sidelining a top aide who drew a wave of criticism for inadvertently adding a journalist to a Signal group chat where of…",
    "link": "https://biztoc.com/x/684f3997f79114ce",
    "timestamp": "2025-05-01T23:18:05Z"
  },
  {
    "title": "Conservative MP open to speaking with friend JD Vance if Liberals ask for help",
    "description": "Conservative MP Jamil Jivani — who is also a friend of U.S. Vice-President JD Vance — says he’s open to helping the government during negotiations with the U.S. administration if the Liberals ask.",
    "link": "https://www.cbc.ca/news/politics/jamil-jivani-j-d-vance-u-s-relations-1.7524407",
    "timestamp": "2025-05-01T23:15:53Z"
  },
  {
    "title": "Trade war injects note of uncertainty into CN Rail outlook, as profits climb",
    "description": "MONTREAL — Canadian National Railway Co. saw a rise in both profits and uncertainty in its latest quarter as the country’s biggest railroad operator worked through a trade war set off by U.S. President Donald Trump. Despite the tariff turmoil, the company sto…",
    "link": "https://financialpost.com/pmn/trade-war-injects-note-of-uncertainty-into-cn-rail-outlook-as-profits-climb",
    "timestamp": "2025-05-01T23:15:03Z"
  }
]