[
  {
    "title": "Norman Rockwell sketches once hung in White House up for auction",
    "description": "The White House Historical Association is hoping to reclaim a series of sketches by American painter and illustrator Norman Rockwell that once hung in the West Wing",
    "link": "https://abcnews.go.com/Entertainment/wireStory/norman-rockwell-sketches-hung-white-house-friday-auction-127507071",
    "timestamp": "2025-11-14T00:37:18Z"
  },
  {
    "title": "Haeran Ryu leads Annika event after 64 while defending champ Nelly Korda makes 17 pars",
    "description": "Haeran Ryu shot a 6-under 64 on Thursday to take the first-round lead in The Annika while defending champion Nelly Korda had 17 pars and one bogey in a 71.",
    "link": "https://www.nbcsports.com/golf/news/haeran-ryu-leads-annika-event-after-64-while-defending-champ-nelly-korda-makes-17-pars",
    "timestamp": "2025-11-14T00:36:25Z"
  },
  {
    "title": "BBC issues apology to Trump following Jan. 6 speech editing controversy",
    "description": "The British broadcaster admits it \"created the impression that President Trump had made a direct call for violent action\" on Jan. 6 ahead of the Capitol riot.",
    "link": "https://www.msnbc.com/top-stories/latest/bbc-apology-trump-jan-6-speech-editing-rcna243820",
    "timestamp": "2025-11-14T00:36:10Z"
  },
  {
    "title": "Netanyahu insists he won't seek pardon after Trump's letter",
    "description": "The Israeli PM says he will not push for a pardon or concede guilt in his long-running corruption trial, less than a day after thanking Donald Trump for urging Israel's president to clear his record.",
    "link": "https://www.abc.net.au/news/2025-11-14/benjamin-netanyahu-wont-seek-pardon-after-trump-letter-to-herzog/106008604",
    "timestamp": "2025-11-14T00:34:18Z"
  },
  {
    "title": "Top Goldman Sachs lawyer asked Jeffrey Epstein for career advice, bashed Trump, private emails show",
    "description": "Newly released emails show Kathryn Ruemmler, now Goldman's top lawyer and a former Obama official, maintained ties with Jeffrey Epstein for years.",
    "link": "https://www.businessinsider.com/jeffrey-epstein-emails-donald-trump-kathryn-ruemmler-goldman-sachs-lawyer-2025-11",
    "timestamp": "2025-11-14T00:34:03Z"
  },
  {
    "title": "‘NO BEARING’: Despite Trump Pardons, Democrat AGs to Prosecute Election Cases",
    "description": "Despite President Donald Trump’s pardons on Sunday, Democrat attorneys general told The Daily Signal and publicly suggested they plan to continue their state prosecutions against... Read More\nThe post ‘NO BEARING’: Despite Trump Pardons, Democrat AGs to Prose…",
    "link": "https://www.dailysignal.com/2025/11/13/no-bearing-despite-trump-pardons-democrat-ags-prosecute-election-cases/",
    "timestamp": "2025-11-14T00:32:01Z"
  },
  {
    "title": "Trump’s ‘hemp ban’ shut down backdoor legal weed — and the pot industry is howling",
    "description": "It’s a much-needed correction for states that had “farm-bill legalization” unwillingly thrust on them — and the many kids unwittingly harmed as a result.",
    "link": "https://nypost.com/2025/11/13/opinion/trumps-hemp-ban-ended-backdoor-legal-weed-despite-pot-industrys-howls/",
    "timestamp": "2025-11-14T00:31:18Z"
  },
  {
    "title": "These Norman Rockwell sketches once hung in the White House. On Friday, they're up for auction",
    "description": "The White House Historical Association is hoping to reclaim a series of sketches by American painter and illustrator Norman Rockwell that once hung in the West Wing",
    "link": "https://abcnews.go.com/US/wireStory/norman-rockwell-sketches-hung-white-house-friday-auction-127507070",
    "timestamp": "2025-11-14T00:29:49Z"
  },
  {
    "title": "‘These Dumb B*stards’: Democrats Get Brutally Roasted for Using Epstein Dig at Trump",
    "description": "The Democrats' official X account was brutally roasted after it promoted an insult that deceased sex criminal Jeffrey Epstein lobbed at Donald Trump years ago.\nThe post ‘These Dumb B*stards’: Democrats Get Brutally Roasted for Using Epstein Dig at Trump first…",
    "link": "https://www.mediaite.com/media/news/these-dumb-bstards-democrats-get-brutally-roasted-for-using-epstein-dig-at-trump/",
    "timestamp": "2025-11-14T00:26:10Z"
  },
  {
    "title": "Trump pardons former Tottenham Hotspur owner Joe Lewis, who pleaded guilty to insider trading",
    "description": "President Donald Trump has issued a pardon to Joe Lewis, a British billionaire who pleaded guilty last year to federal insider trading charges",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-pardons-former-tottenham-hotspur-owner-joe-lewis-insider-trading-rcna243826",
    "timestamp": "2025-11-14T00:23:21Z"
  },
  {
    "title": "Epstein Returns at the Worst Time for Trump",
    "description": "The president is desperate to make the questions go away, but there is no sign they will.",
    "link": "https://www.theatlantic.com/politics/2025/11/jeffrey-epstein-trump-emails/684926/",
    "timestamp": "2025-11-14T00:23:00Z"
  },
  {
    "title": "FBI Hits Back at Tucker Carlson After Former Fox Host Accuses Agency of Lying About Trump Shooter",
    "description": "The FBI hit back at Tucker Carlson after the former Fox News host accused the agency of lying about President Donald Trump's attempted assassin Thomas Crooks.\nThe post FBI Hits Back at Tucker Carlson After Former Fox Host Accuses Agency of Lying About Trump S…",
    "link": "https://www.mediaite.com/politics/fbi-hits-back-at-tucker-carlson-after-former-fox-host-accuses-agency-of-lying-about-trump-shooter/",
    "timestamp": "2025-11-14T00:22:13Z"
  },
  {
    "title": "Texas GOP regret 'their overconfidence' as Trump-led effort 'may end up backfiring'",
    "description": "After Texas Republicans' intial success in redistricting, President Donald Trump's gerrymandering strategy is starting to backfire, writes Salon's Heather Digby Parton, and as Democrats have the last laugh, Republicans are starting to doubt their \"overconfide…",
    "link": "https://www.rawstory.com/texas-gop-regret-their-overconfidence-as-trump-led-effort-may-end-up-backfiring/",
    "timestamp": "2025-11-14T00:21:02Z"
  },
  {
    "title": "Ryu grabs LPGA lead, Kai Trump struggles in debut",
    "description": "South Korean Ryu Hae-ran fired seven birdies in a six-under par 64 on Thursday to seize a one-shot lead over Australian Grace Kim in the LGPA Annika at Pelican tournament in Belleair, Florida.Kim, who captured her first major title at the Evian Championship t…",
    "link": "https://sports.yahoo.com/article/ryu-grabs-lpga-lead-kai-002008475.html",
    "timestamp": "2025-11-14T00:20:08Z"
  },
  {
    "title": "Trump, 79, Roasted After ‘Dumb’ Word Salad",
    "description": "President Donald Trump stirred up some particularly fervent humiliation from internet users after he made a mess of his words during a public address on...",
    "link": "https://www.thedailybeast.com/donald-trump-79-roasted-after-dumb-word-salad/",
    "timestamp": "2025-11-14T00:19:15Z"
  },
  {
    "title": "Did Trump call Lauren Boebert and Nancy Mace about Epstein petition? What we know",
    "description": "Posts claimed Trump called the GOP congresswomen to urge them to drop their names from a petition seeking a House vote to release the Epstein files.",
    "link": "https://www.snopes.com//news/2025/11/13/trump-call-boebert-mace-epstein/",
    "timestamp": "2025-11-14T00:18:00Z"
  },
  {
    "title": "Draft rules ease setback, basement & parking norms in Bengaluru Master Plan",
    "description": "Bengaluru: In a move aimed at helping homeowners with smaller plots build legally without losing precious space, the state govt has proposed sweeping .",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/draft-rules-ease-setback-basement-parking-norms-in-bengaluru-master-plan/articleshow/125307197.cms",
    "timestamp": "2025-11-14T00:16:29Z"
  },
  {
    "title": "Top Fannie Mae officials ousted after sounding alarm on sharing confidential housing data",
    "description": "The emails show the data was shared with rival Freddie Mac.",
    "link": "https://www.bostonherald.com/2025/11/13/trump-pulte/",
    "timestamp": "2025-11-14T00:16:00Z"
  },
  {
    "title": "Top Fannie Mae officials ousted after sounding alarm on sharing confidential housing data",
    "description": "The emails show the data was shared with rival Freddie Mac.",
    "link": "https://www.denverpost.com/2025/11/13/trump-pulte/",
    "timestamp": "2025-11-14T00:16:00Z"
  },
  {
    "title": "How to Measure Climate Progress",
    "description": "Try putting yourself in Bill Gates’s shoes. You could spend your days on what made you one of the world’s richest people while also deploying your wealth to do the most good. You could invest in for-profit ventures pursuing things like clean-energy breakthrou…",
    "link": "https://english.khabarhub.com/2025/14/505975/",
    "timestamp": "2025-11-14T00:15:46Z"
  },
  {
    "title": "BBC apologises to Trump over Panorama edit but refuses to pay compensation (Noor Nanji/BBC)",
    "description": "Noor Nanji / BBC:\nBBC apologises to Trump over Panorama edit but refuses to pay compensation  —  The BBC has apologised to US President Donald Trump for a Panorama episode that spliced parts of his 6 January 2021 speech together, but rejected his demands for …",
    "link": "https://www.memeorandum.com/251113/p140",
    "timestamp": "2025-11-14T00:15:00Z"
  },
  {
    "title": "Trump's next immigration crackdown will target Charlotte, North Carolina, a sheriff says",
    "description": "Charlotte, North Carolina, is the latest U.S. city preparing for a potential immigration crackdown by the Trump administration",
    "link": "https://abcnews.go.com/US/wireStory/trumps-immigration-crackdown-target-charlotte-north-carolina-sheriff-127500659",
    "timestamp": "2025-11-14T00:13:31Z"
  },
  {
    "title": "New Texas A&M policy requires professors to get approval for some race and gender topics",
    "description": "Texas A&M University System regents on Thursday required professors to receive approval from the school president to discuss some race and gender topics, tightening rules months after a viral video of a student confronting an instructor over her lessons threw…",
    "link": "https://www.pbs.org/newshour/education/new-texas-am-policy-requires-professors-to-get-approval-for-some-race-and-gender-topics",
    "timestamp": "2025-11-14T00:13:04Z"
  },
  {
    "title": "JD Vance Shares 'MAHA-Style' Opinion That Even He Admits Sounds 'Crazy'",
    "description": "The vice president lauded the audience for asking the \"right questions\" about food and medicine during a talk with Robert F. Kennedy Jr.",
    "link": "https://www.huffpost.com/entry/jd-vance-ibuprofen-make-america-healthy-again_n_6916152fe4b0295c356b1dfc",
    "timestamp": "2025-11-14T00:12:33Z"
  },
  {
    "title": "Justice Department sues to block California Gov. Gavin Newsom’s redistricting plan",
    "description": "Justice Department sues over California's Proposition 50 redistricting plan",
    "link": "https://www.msnbc.com/top-stories/latest/california-redistricting-newsom-proposition-50-doj-lawsuit-rcna243792",
    "timestamp": "2025-11-14T00:11:13Z"
  },
  {
    "title": "Startup IPO boom gives early backers grand exit",
    "description": "Three Indian startups are set to go public this week, marking a significant trend for investor exits. Early backers like Peak XV Partners are realizing substantial returns, with Pine Labs and Groww poised for strong performances. This IPO boom signals a domin…",
    "link": "https://timesofindia.indiatimes.com/business/india-business/startup-ipo-boom-gives-early-backers-grand-exit/articleshow/125312881.cms",
    "timestamp": "2025-11-14T00:11:11Z"
  },
  {
    "title": "Donald Trump's Approval Rating With Hispanics Spikes in New Poll",
    "description": "In recent cycles, Trump made significant gains with Hispanics, contributing to his 2024 reelection.",
    "link": "https://biztoc.com/x/3a19394d3df969aa",
    "timestamp": "2025-11-14T00:10:35Z"
  },
  {
    "title": "Far-Left Congressman Eric Swalwell Has Been Referred to the Justice Department for Criminal Charges",
    "description": "\"As the most vocal critic of Donald Trump over the last decade and as the only person who still has a surviving lawsuit against him ...\"",
    "link": "https://www.westernjournal.com/far-left-congressman-eric-swalwell-referred-justice-department-criminal-charges/",
    "timestamp": "2025-11-14T00:09:49Z"
  },
  {
    "title": "These Norman Rockwell sketches once hung in the White House. On Friday, they're up for auction",
    "description": "The White House Historical Association is bidding to reclaim a series of sketches by American painter and illustrator Norman Rockwell that once hung in the...",
    "link": "https://www.yahoo.com/news/articles/norman-rockwell-sketches-once-hung-000936850.html",
    "timestamp": "2025-11-14T00:09:36Z"
  },
  {
    "title": "Trump administration says it has trade frameworks with Argentina, Ecuador, El Salvador and Guatemala",
    "description": "The frameworks are expected to be signed within two weeks.",
    "link": "https://www.bostonherald.com/2025/11/13/trump-trade/",
    "timestamp": "2025-11-14T00:08:00Z"
  },
  {
    "title": "These Republican Senators Could Make Millions Thanks To The Government Funding Bill",
    "description": "The new law lets senators sue for major damages if the Justice Department obtains their phone records without telling them.",
    "link": "https://www.huffpost.com/entry/senate-republicans-lawsuits-funding-bill_n_69164faee4b0dd708f3a178a",
    "timestamp": "2025-11-14T00:05:45Z"
  },
  {
    "title": "Karuna Pandey on her role post leap in Pushpa Impossible; says ‘Pushpa has taken a step forward by becoming an advocate’",
    "description": "Pushpa Impossible's recent seven-year leap sees Pushpa evolve into a lawyer, a powerful progression symbolizing perseverance and lifelong learning. Actress Karuna Pandey shares how Pushpa's journey from a middle-aged student to an advocate inspires women, hig…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/karuna-pandey-on-her-role-post-leap-in-pushpa-impossible-says-pushpa-has-taken-a-step-forward-by-becoming-an-advocate/articleshow/125312853.cms",
    "timestamp": "2025-11-14T00:05:11Z"
  },
  {
    "title": "MAGA podcaster with a 'Nazi streak' tapped for new Trump gig after nomination thwarted",
    "description": "President Donald Trump has renominated Paul Ingrassia, a MAGA podcaster who has claimed he has a \"Nazi streak\" in him, to a new government job after withdrawing him from leading a government watchdog agency, according to a new report. Ingrassia has told colle…",
    "link": "https://www.rawstory.com/paul-ingrassia-2674294166/",
    "timestamp": "2025-11-14T00:02:01Z"
  },
  {
    "title": "Trump administration prepares tariff exemptions in bid to lower food prices",
    "description": "The Trump administration is planning to offer exemptions on certain tariffs. This move aims to reduce high food prices that are causing concern for American consumers. The exemptions are expected to cover items like beef and citrus. This comes after recent el…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-prepares-tariff-exemptions-in-bid-to-lower-food-prices/articleshow/125312833.cms",
    "timestamp": "2025-11-14T00:01:47Z"
  },
  {
    "title": "IPO papers too complex? Sebi wants cos to give summary",
    "description": "Sebi is proposing changes to IPO filings. Companies will submit a summary of key offer points instead of a lengthy abridged document. Promoter-pledged shares will now be included for lock-in. These measures aim to increase retail investor involvement in publi…",
    "link": "https://timesofindia.indiatimes.com/business/india-business/ipo-papers-too-complex-sebi-wants-cos-to-give-summary/articleshow/125312832.cms",
    "timestamp": "2025-11-14T00:01:46Z"
  },
  {
    "title": "The Gospel According to the Military-Industrial Complex",
    "description": "“Rebellion to tyrants is obedience to God.” ~ Thomas Jefferson For a man supposedly intent on winning a Nobel Peace Prize, Donald Trump spends an extraordinary amount of time waging war, threatening to wage war, and fantasizing about waging war. Notwithstandi…",
    "link": "https://original.antiwar.com/jwhitehead/2025/11/13/the-gospel-according-to-the-military-industrial-complex/",
    "timestamp": "2025-11-14T00:00:40Z"
  },
  {
    "title": "DHS Sec. Kristi Noem Hands Out $10,000 Bonus Checks to TSA Agents for 'Exemplary Service' During Shutdown",
    "description": "Homeland Security Secretary Kristi Noem handed out $10,000 bonus checks to Transportation Security Administration (TSA) agents who exhibited \"exemplary service\" while working without pay during the government shutdown on Thursday.\nThe post DHS Sec. Kristi Noe…",
    "link": "https://www.breitbart.com/politics/2025/11/13/dhs-sec-kristi-noem-hands-out-10000-bonus-checks-to-tsa-agents-for-exemplary-service-during-shutdown/",
    "timestamp": "2025-11-14T00:00:27Z"
  },
  {
    "title": "Trump’s Energy Pushback Sends Shockwaves Through Wind Industry",
    "description": "The energy transition faces the biggest challenge yet as a global backlash against renewable energy – spearheaded by U.S. President Donald Trump – is gaining momentum, according to two of the European pioneers of wind turbine design. President Trump’s views o…",
    "link": "https://oilprice.com/Alternative-Energy/Wind-Power/Trumps-Energy-Pushback-Sends-Shockwaves-Through-Wind-Industry.html",
    "timestamp": "2025-11-14T00:00:00Z"
  },
  {
    "title": "Who will fill the climate-data void left by the Trump administration?",
    "description": "US withdrawal from monitoring projects has sent the world scrambling for alternatives.",
    "link": "https://www.nature.com/articles/d41586-025-03532-4",
    "timestamp": "2025-11-14T00:00:00Z"
  },
  {
    "title": "U.S. attorney prosecuting Comey and James faces legal challenge over her appointment",
    "description": "President Trump’s Justice Department was on defense in a northern Virginia courtroom. A judge is weighing whether to disqualify the U.S. attorney pursuing charges against former FBI Director James Comey and New York Attorney General Letitia James. That prosec…",
    "link": "https://www.pbs.org/newshour/show/u-s-attorney-prosecuting-comey-and-james-faces-legal-challenge-over-her-appointment",
    "timestamp": "2025-11-13T23:55:56Z"
  },
  {
    "title": "Donald Trump's granddaughter, Kai, should not be judged by score in LPGA debut | D'Angelo",
    "description": "Kai Trump, the youngest contestant in the field, had the brightest spotlight. She was followed by eight to 10 Secret Service agents while shooting 13-over 83...",
    "link": "https://www.palmbeachpost.com/story/sports/pga/2025/11/13/donald-trump-kai-trump-lpga-the-annika/87193092007/",
    "timestamp": "2025-11-13T23:54:36Z"
  },
  {
    "title": "Stock market today: Dow slides, Nasdaq pares losses as Fed rate-cut doubts creep in",
    "description": "Stock futures have inched up following the market's worst day in over a month, erasing weeks of gains and pulling back from record highs.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-slides-nasdaq-recovers-amid-growing-doubts-on-fed-rate-cut-path-235130256.html",
    "timestamp": "2025-11-13T23:51:30Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq futures dive after bruising sell-off as rate-cut doubts creep in",
    "description": "Stock futures have inched up following the market's worst day in over a month, erasing weeks of gains and pulling back from record highs.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-dive-after-bruising-sell-off-as-rate-cut-doubts-creep-in-235130357.html",
    "timestamp": "2025-11-13T23:51:30Z"
  },
  {
    "title": "Before Trump became a ‘racist’",
    "description": "We're seeing 'hypocrisy, selective outrage and double standards'",
    "link": "https://www.wnd.com/2025/11/before-trump-became-racist/",
    "timestamp": "2025-11-13T23:51:30Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq dive, deepening bruising sell-off as rate-cut doubts creep in",
    "description": "Stock futures have inched up following the market's worst day in over a month, erasing weeks of gains and pulling back from record highs.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-dive-deepening-bruising-sell-off-as-rate-cut-doubts-creep-in-235130386.html",
    "timestamp": "2025-11-13T23:51:30Z"
  },
  {
    "title": "MAGA Donald Trump “Comes to the Rescue of Christians” in Nigeria? Fueling Political and Social Divisions in the Number One Oil Economy in Africa",
    "description": "After classifying Nigeria as a “disgraced country,” US President Donald Trump said on November 1 that American troops will attack the African country if the killing of Christians by Islamic terrorists does not end. \nTrump’s threat comes after long lobbying …\n…",
    "link": "https://www.globalresearch.ca/us-motive-military-intervention-nigeria-unrelated-christian-massacres/5905711",
    "timestamp": "2025-11-13T23:51:15Z"
  },
  {
    "title": "The shutdown has ended – but this economist isn’t rejoicing quite yet",
    "description": "After 43 days, the U.S. government shutdown finally came to an end late on Nov. 12, 2025, when Congress voted through a long-overdue funding bill, which President Donald Trump promptly signed.\nBut the prolonged gap in government-as-usual has come at a cost to…",
    "link": "https://biztoc.com/x/be5019f5dd0a8f46",
    "timestamp": "2025-11-13T23:48:14Z"
  },
  {
    "title": "Trump administration joins lawsuit against California’s redistricting maps",
    "description": "Voters' approval of Proposition 50 means Democrats might win up to five additional seats in the House in the midterms.",
    "link": "https://www.aljazeera.com/news/2025/11/13/trump-administration-joins-lawsuit-against-californias-redistricting-maps",
    "timestamp": "2025-11-13T23:47:37Z"
  },
  {
    "title": "Trump prepares to cave on his own tariffs in desperate bid to lower food costs: report",
    "description": "President Donald Trump's administration is preparing broad exemptions to the president's signature tariff regime in a desperate bid to lower food costs, according to a new report. The New York Times reported on the exemptions, citing three sources familiar wi…",
    "link": "https://www.rawstory.com/trump-tariffs-2674294156/",
    "timestamp": "2025-11-13T23:47:08Z"
  },
  {
    "title": "Sen. John Kennedy ridicules Democratic Party divide between Schumer and 'socialist' wing' led by AOC",
    "description": "Senator John Kennedy discusses the Democratic Party divide, defends the filibuster, and warns about Chinese influence threats during interview on government shutdown fallout.",
    "link": "https://www.foxnews.com/media/kennedy-describes-democratic-party-divide-between-schumer-socialist-wing-led-aoc",
    "timestamp": "2025-11-13T23:46:21Z"
  },
  {
    "title": "Poll: No To 'Democratic Socialism' But Voters LOVE Mamdani's Ideas",
    "description": "YouGov has been polling Americans on the subject of Zohran Mamdani, and they seem surprisingly but not overwhelmingly positive about him.\n\r\n\nHowever, they don't seem particularly fond of democratic socialism.\r\nread more",
    "link": "https://crooksandliars.com/2025/11/poll-no-democratic-socialism-voters-love",
    "timestamp": "2025-11-13T23:45:46Z"
  },
  {
    "title": "'Time to Clear House': Sunrise Movement Launches Major Primary Effort Against Corporate Dems",
    "description": "Amid growing outrage over corporate Democrats' failure to meaningfully stand up against President Donald Trump’s authoritarianism, Sunrise Movement on Thursday launched \"the most ambitious\" primary campaign to replace feckless incumbents with progressives.\"Fo…",
    "link": "https://www.commondreams.org/news/sunrise-primary-campaign",
    "timestamp": "2025-11-13T23:45:24Z"
  },
  {
    "title": "US pressures UN Council to adopt Trump's Gaza peace plan",
    "description": "Unlike previous US drafts, the latest mentions a possible future Palestinian state.",
    "link": "https://www.channelnewsasia.com/world/us-pressures-un-council-adopt-gaza-peace-plan-5466511",
    "timestamp": "2025-11-13T23:44:00Z"
  },
  {
    "title": "Donald Trump’s granddaughter Kai in last after 83 in shaky LPGA debut",
    "description": "Kai Trump, the US president’s granddaughter and the eldest child of Donald Trump Jr, opened her LPGA career with a 13-over-par 83 on Thursday at The Annika, a debut round that left her at the bottom of the leaderboard and underscored the chasm between elite j…",
    "link": "https://sports.yahoo.com/article/donald-trump-granddaughter-kai-last-234249949.html",
    "timestamp": "2025-11-13T23:42:49Z"
  },
  {
    "title": "Jon Stewart Questions Why Mamdani Is ‘Cast as a Radical’ When He Shares Trump’s Same ‘Populist Frustration’ | Video",
    "description": "\"Boy, I don't want to put those two things together, but here we go down that path,\" the host says\nThe post Jon Stewart Questions Why Mamdani Is ‘Cast as a Radical’ When He Shares Trump’s Same ‘Populist Frustration’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jon-stewart-zohran-mamdani-donald-trump-populist-frustration/",
    "timestamp": "2025-11-13T23:42:31Z"
  },
  {
    "title": "The Epstein Scandal Is Now a Chronic Disease of the Trump Presidency",
    "description": "The Jeffrey Epstein scandal has been compared to “a bad case of herpes,” that might lie low for a while but will never stop afflicting Donald Trump and shadowing his Presidency, Susan B. Glasser writes.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/the-epstein-scandal-is-now-a-chronic-disease-of-the-trump-presidency",
    "timestamp": "2025-11-13T23:41:42Z"
  },
  {
    "title": "TACO! Trump Reportedly Preparing Big Tariff Reductions as Part of Affordability Push",
    "description": "President Donald Trump is reportedly considering a major rollback of his trade policy.\nThe post TACO! Trump Reportedly Preparing Big Tariff Reductions as Part of Affordability Push first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/taco-trump-reportedly-preparing-big-tariff-reductions-as-part-of-affordability-push/",
    "timestamp": "2025-11-13T23:41:41Z"
  },
  {
    "title": "Unpacking the federal ban on certain hemp products included in deal to end shutdown",
    "description": "Laws around cannabis in the United States are confusing. Here's what the change might actually mean.",
    "link": "https://www.snopes.com//news/2025/11/13/shutdown-hemp-ban-explained/",
    "timestamp": "2025-11-13T23:41:00Z"
  },
  {
    "title": "BBC issues apologies to Trump, White House for misleading edits of president’s words",
    "description": "Lawyers' letters delivered even as $1 billion lawsuit being contemplated",
    "link": "https://www.wnd.com/2025/11/bbc-issues-apologies-trump-white-house-misleading-edits/",
    "timestamp": "2025-11-13T23:35:04Z"
  },
  {
    "title": "Trump administration repealing protections for key swaths of Alaska petroleum reserve",
    "description": "The Trump administration says it is rescinding federal rules that were aimed at protecting vast swaths of a petroleum reserve in Alaska that provide key habitat for migrating birds, caribou and other wildlife",
    "link": "https://abcnews.go.com/Business/wireStory/trump-administration-repealing-protections-key-swaths-alaska-petroleum-127506260",
    "timestamp": "2025-11-13T23:33:57Z"
  },
  {
    "title": "BBC apologises to Donald Trump for edit of speech but refuses to pay compensation - Financial Times",
    "description": "BBC apologises to Donald Trump for edit of speech but refuses to pay compensationFinancial Times BBC apologises to Trump over Panorama edit but refuses to pay compensationBBC BBC apologizes to Trump for documentary edits, but pushes back on legal threatPoliti…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180068258",
    "timestamp": "2025-11-13T23:32:47Z"
  },
  {
    "title": "Fannie Mae officials ousted after voicing concerns on data leak",
    "description": "A confidant of Bill Pulte, the Trump administration’s top housing regulator, provided confidential mortgage pricing data from Fannie Mae to a principal competitor. Emails reviewed by The Associated Press reveal the disclosure alarmed senior officials of the g…",
    "link": "https://apnews.com/article/fannie-mae-freddie-mac-firing-pulte-data-a4f8c53df74fef83ec7fd07e3d524746",
    "timestamp": "2025-11-13T23:32:42Z"
  },
  {
    "title": "Trump just played his own fans for 'absolute fools': analyst",
    "description": "A progressive analyst claimed during a podcast episode on Thursday that President Donald Trump is playing fans of the MAGA movement for \"absolute fools\" after his latest flip-flop. On Wednesday, lawmakers released tens of thousands of new documents from disgr…",
    "link": "https://www.rawstory.com/trump-epstein-2674294020/",
    "timestamp": "2025-11-13T23:32:25Z"
  },
  {
    "title": "BBC Apologizes to Trump But Refuses to Pay Him: ‘Strong Belief’ They Have Solid Legal Defense",
    "description": "On Thursday, the BBC acknowledged an inaccurate edit of Trump's January 6th speech \"showed excerpts taken from different parts of the speech\" and apologized — but refused to pay compensation.\nThe post BBC Apologizes to Trump But Refuses to Pay Him: ‘Strong Be…",
    "link": "https://www.mediaite.com/media/bbc-apologizes-to-trump-but-refuses-to-pay-him-strong-belief-they-have-solid-legal-defense/",
    "timestamp": "2025-11-13T23:31:04Z"
  },
  {
    "title": "Trump administration repealing protections for key swaths of Alaska petroleum reserve",
    "description": "JUNEAU, Alaska (AP) — The Trump administration said Thursday it is rescinding federal rules that were aimed at protecting from future oil and gas leasing vast swaths of a petroleum reserve in Alaska that provide key habitat for migrating birds, caribou and ot…",
    "link": "https://financialpost.com/pmn/trump-administration-repealing-protections-for-key-swaths-of-alaska-petroleum-reserve",
    "timestamp": "2025-11-13T23:30:29Z"
  },
  {
    "title": "Trump to ease coffee and banana tariffs in Latin America trade deals",
    "description": "The Trump administration on Thursday announced frameworks for trade deals with four Latin American countries, which senior officials said will include tariff relief on coffee and bananas.",
    "link": "https://www.bbc.com/news/articles/cvg7jm046e4o",
    "timestamp": "2025-11-13T23:30:00Z"
  },
  {
    "title": "Fury as no one charged despite DHS' wild claim building overrun with 'terrorists'",
    "description": "Late at night on Sept. 30, over 300 federal agents stormed an apartment building in one of Chicago’s lowest-income neighborhoods. After descending from Black Hawk helicopters, they broke down residents’ doors, destroyed furniture and belongings, deployed flas…",
    "link": "https://www.rawstory.com/fury-as/",
    "timestamp": "2025-11-13T23:25:10Z"
  },
  {
    "title": "Trump Lifts More Oil Drilling Curbs on Millions of Arctic Acres",
    "description": "The Trump administration rescinded restrictions on oil drilling in Alaska’s mammoth state petroleum reserve, reversing a move by former President Joe Biden that put an estimated 8.7 billion barrels of recoverable oil off limits.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-lifts-more-oil-drilling-curbs-on-millions-of-arctic-acres",
    "timestamp": "2025-11-13T23:22:00Z"
  },
  {
    "title": "Goldman Sachs stands by top lawyer Kathy Ruemmler after her emails with Jeffrey Epstein exposed",
    "description": "The email chats between top lawyer Kathy Ruemmler and Jeffrey Epstein came years after his guilty plea to sex crimes in Florida.",
    "link": "https://www.cnbc.com/2025/11/13/goldman-sachs-jeffrey-epstein-emails-ruemmler.html",
    "timestamp": "2025-11-13T23:21:13Z"
  },
  {
    "title": "What to know about how Florida will teach McCarthyism and the Cold War",
    "description": "Students in Florida’s public schools will soon be learning an interpretation of McCarthyism and the Cold War that is steeped in rhetoric of that era",
    "link": "https://abcnews.go.com/US/wireStory/florida-teach-mccarthyism-cold-war-127500773",
    "timestamp": "2025-11-13T23:17:33Z"
  },
  {
    "title": "U.S. Allies Turn Against Trump’s Drug Boat War",
    "description": "Western partners are distancing themselves from the U.S. operation.",
    "link": "http://foreignpolicy.com/2025/11/13/allies-trump-drug-boat-war-venezuela/",
    "timestamp": "2025-11-13T23:16:18Z"
  },
  {
    "title": "Don't buy into alleged Trump post addressing 'dog that hasn't barked' email from Epstein",
    "description": "U.S. President Donald Trump posted on social media that disgraced financier Jeffrey Epstein was a \"total creep\" and said, \"The dog didn't bark because the dog didn't have time! Too busy making the country great, building towers, eating tremendous steaks.\"",
    "link": "https://www.snopes.com//fact-check/trump-post-dog-hasnt-barked-epstein/",
    "timestamp": "2025-11-13T23:16:00Z"
  },
  {
    "title": "BBC apologises to Trump over Panorama edit but refuses to pay compensation",
    "description": "The BBC has apologised to US President Donald Trump for a Panorama episode that spliced parts of his 6 January 2021 speech together, but rejected his demands for compensation.The corporation said the edit had given \"the mistaken impression that President Trum…",
    "link": "https://freerepublic.com/focus/f-news/4352385/posts",
    "timestamp": "2025-11-13T23:13:28Z"
  },
  {
    "title": "The mainstreaming of Jew-hatred",
    "description": "Fragmentation threatens to empower extremes on both the left and right of the political spectrum. Opinion.",
    "link": "https://www.israelnationalnews.com/news/417768",
    "timestamp": "2025-11-13T23:12:50Z"
  },
  {
    "title": "Canadian boycott of US travel shows no sign of slowing",
    "description": "Kristy Gammon used to travel to the US from Canada at least once every other year, taking ski trips at Lake Placid in New York and travelling to Baltimore, Maryland, for her husband's favourite Orioles baseball games. But those trips are now over, she said. T…",
    "link": "https://freerepublic.com/focus/f-news/4352384/posts",
    "timestamp": "2025-11-13T23:12:49Z"
  },
  {
    "title": "US launches new military operation",
    "description": "The US has announced a new military task force to combat drug cartels amid tensions with Venezuela Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627771-us-operation-against-narcoterrorists/",
    "timestamp": "2025-11-13T23:11:47Z"
  },
  {
    "title": "'Losers': Trump DOJ mocked over Hail Mary lawsuit to thwart blue state's election plot",
    "description": "President Donald Trump's Justice Department is joining a last-ditch lawsuit in federal court to try to overturn Proposition 50 — the recently passed ballot referendum in California that temporarily suspends the state's independent redistricting commission and…",
    "link": "https://www.rawstory.com/california-lawsuit/",
    "timestamp": "2025-11-13T23:11:45Z"
  },
  {
    "title": "Trump's granddaughter makes LPGA debut, post day's highest score",
    "description": "Kai Trump, the eldest granddaughter of U.S. President Donald Trump, made her LPGA debut on Thursday at Pelican Golf Club in Belleair, Florida, where she struggled en route to posting the day's highest score.The 18-year-old amateur, who received a sponsor's ex…",
    "link": "https://www.channelnewsasia.com/sport/trumps-granddaughter-makes-lpga-debut-post-days-highest-score-5466451",
    "timestamp": "2025-11-13T23:11:13Z"
  },
  {
    "title": "Ex-Harvard president Larry Summers joked about ‘women being less intelligent than men’ in emails to Epstein",
    "description": "The emails have raised eyebrows, especially in academia circles, as Summers was President of Harvard University from 2001 until 2006.",
    "link": "https://nypost.com/2025/11/13/us-news/ex-harvard-president-larry-summers-joked-about-women-being-less-intelligent-than-men-in-emails-to-epstein/",
    "timestamp": "2025-11-13T23:10:57Z"
  },
  {
    "title": "Kai Trump’s ‘nervous’ LPGA debut included a little bit of everything",
    "description": "Admitting she was more nervous than she expected, President Donald Trump’s granddaughter opened with an 83 in Florida.",
    "link": "https://sports.yahoo.com/article/kai-trump-nervous-lpga-debut-230954333.html",
    "timestamp": "2025-11-13T23:09:54Z"
  },
  {
    "title": "‘Epstein Was Preoccupied With Trump’: Ace Epstein Reporter Marvels That Trump’s Name Comes Up ‘Over 2,000 Times’ in Docs",
    "description": "\"It does show how much room Trump held in Epstein's brain, so to speak, or how much Epstein was preoccupied with Trump.\"\nThe post ‘Epstein Was Preoccupied With Trump’: Ace Epstein Reporter Marvels That Trump’s Name Comes Up ‘Over 2,000 Times’ in Docs first ap…",
    "link": "https://www.mediaite.com/media/tv/epstein-was-preoccupied-with-trump-ace-epstein-reporter-marvels-that-trumps-name-comes-up-over-2000-times-in-docs/",
    "timestamp": "2025-11-13T23:09:26Z"
  },
  {
    "title": "'His best friend was Donald Trump': Epstein's ex-girlfriend and Trump accuser speaks out",
    "description": "Stacey Williams is a former girlfriend of Jeffrey Epstein and says she was groped by Donald Trump back in 1993 inside Trump ...",
    "link": "https://biztoc.com/x/2a252525f2ddde99",
    "timestamp": "2025-11-13T23:08:54Z"
  },
  {
    "title": "Trump, 79, Wears Hand Makeup for Melania Speech",
    "description": "The president appeared to be covering his hand with ill-matched makeup at the White House.",
    "link": "https://www.thedailybeast.com/trump-79-wears-hand-makeup-for-melania-speech/",
    "timestamp": "2025-11-13T23:08:09Z"
  },
  {
    "title": "Epstein Emails Reference Bitcoin Meeting With Brock Pierce at Manhattan Mansion",
    "description": "Brock Pierce spoke about Bitcoin with Larry Summers at Jeffrey Epstein’s Manhattan townhouse, emails from the financier’s estate indicate.",
    "link": "https://decrypt.co/348586/epstein-emails-reference-bitcoin-meeting-brock-pierce-manhattan-mansion",
    "timestamp": "2025-11-13T23:07:01Z"
  },
  {
    "title": "Diddy prison release delayed due to multiple violations",
    "description": "Sean “Diddy” Combs’ stay behind bars has taken another turn. The hip-hop icon, entrepreneur, and cultural powerhouse is currently serving his prison sentence at Fort Dix Federal Correctional Institution in central New Jersey. Upon sentencing, Diddy reportedly…",
    "link": "https://rollingout.com/2025/11/13/diddy-prison-release-delayed-violations/",
    "timestamp": "2025-11-13T23:06:50Z"
  },
  {
    "title": "Squabbling lawmakers made $20K each during longest government shutdown in history",
    "description": "DC lawmakers grabbed more than $11 million during the six-week funding row that saw food stamp aid slashed - and YOU were paying for it.",
    "link": "https://nypost.com/2025/11/13/business/squabbling-members-of-congress-made-20k-each-during-record-long-shutdown/",
    "timestamp": "2025-11-13T23:06:33Z"
  },
  {
    "title": "BBC apologises to Trump over documentary, rejects defamation claim",
    "description": "In a letter, BBC said it had no plans to rebroadcast the documentary that was the basis of Trump's defamation claim.",
    "link": "https://www.aljazeera.com/economy/2025/11/13/bbc-apologises-to-trump-over-documentary-rejects-defamation-claim",
    "timestamp": "2025-11-13T23:06:31Z"
  },
  {
    "title": "Trump's grandaughter last after debut LPGA round",
    "description": "Kai Trump shoots a 13-over-par round on her LPGA debut as she ends the first day of the Annika tournament in last place.",
    "link": "https://www.bbc.com/sport/golf/articles/c781gyqnld0o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-11-13T23:04:34Z"
  },
  {
    "title": "Trump's grandaughter last after debut LPGA round",
    "description": "Kai Trump shoots a 13-over-par round on her LPGA debut as she ends the first day of the Annika tournament in last place.",
    "link": "https://www.bbc.com/sport/golf/articles/c781gyqnld0o",
    "timestamp": "2025-11-13T23:03:46Z"
  },
  {
    "title": "Trump, 79, Makes Obesity and Age Grounds for Visa Denial",
    "description": "The Trump administration has ordered visa officers to consider obesity, diabetes, and age as reasons for rejecting visa applicants.",
    "link": "https://www.thedailybeast.com/trump-79-makes-obesity-and-age-grounds-for-visa-denial/",
    "timestamp": "2025-11-13T23:02:06Z"
  },
  {
    "title": "How Should We Celebrate America’s Birthday?",
    "description": "From the daily newsletter: the conflicting approaches to honoring the nation’s semiquincentennial.",
    "link": "https://www.newyorker.com/newsletter/the-daily/who-gets-to-tell-americas-story",
    "timestamp": "2025-11-13T23:00:00Z"
  },
  {
    "title": "Trump’s Battle for the Economy Ahead of Midterms",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Trump’s Battle for the Economy Ahead of Midterms appeared first on The …",
    "link": "https://www.dailysignal.com/2025/11/13/trumps-battle-for-the-economy-ahead-of-midterms/",
    "timestamp": "2025-11-13T22:56:32Z"
  },
  {
    "title": "‘Political retaliation’: Judge won’t let ICE-storming congresswoman off the hook",
    "description": "Rep. McIver is accused of interfering with federal officers, ruling says actions don't qualify as 'oversight'",
    "link": "https://www.wnd.com/2025/11/political-retaliation-judge-wont-let-ice-storming-congresswoman/",
    "timestamp": "2025-11-13T22:56:12Z"
  }
]