[
  {
    "title": "El Salvador's Bukele Flaunts 'Iron Fist' Alliance With Trump",
    "description": "El Salvador's pugilistic president has become a key partner for US President Donald Trump's in-your-face campaign to deport migrants, with both men hoping to reap the political benefits.",
    "link": "https://www.ibtimes.com.au/el-salvadors-bukele-flaunts-iron-fist-alliance-trump-1857478",
    "timestamp": "2025-04-02T07:42:23Z"
  },
  {
    "title": "El Salvador's Bukele Flaunts 'Iron Fist' Alliance With Trump",
    "description": "El Salvador's pugilistic president has become a key partner for US President Donald Trump's in-your-face campaign to deport migrants, with both men hoping to reap the political benefits.",
    "link": "https://www.ibtimes.com/el-salvadors-bukele-flaunts-iron-fist-alliance-trump-3768527",
    "timestamp": "2025-04-02T07:42:07Z"
  },
  {
    "title": "Fox News Host Slams Elon Musk With Brutal Billion Dollar Question",
    "description": "Fox News host Jessica Tarlov confronted billionaire Elon Musk on Tuesday over his glaring conflicts of interest as an adviser for President Donald Trump.\n“So you’ve been making cuts to a lot of the agencies that have open investigations and regulatory battles…",
    "link": "https://biztoc.com/x/72a9a9139ec5595a",
    "timestamp": "2025-04-02T07:41:07Z"
  },
  {
    "title": "Donald Trump’s net worth skyrockets to $5.1 billion, doubles in a year fueled by Truth Social and crypto",
    "description": "The 2025 Forbes Billionaires List reveals a record-breaking surge in global wealth, with 3,028 billionaires amassing a collective $16.1 trillion. Donald Trump’s fortune has more than doubled, propelling him up the ranks, while Elon Musk reclaims the top spot …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/forbes-billionaires-list-2025-donald-trumps-net-worth-skyrockets-to-5-1-billion-doubles-in-a-year-fueled-by-truth-social-and-crypto/articleshow/119898615.cms",
    "timestamp": "2025-04-02T07:39:47Z"
  },
  {
    "title": "Japan's Nikkei ekes out gain in countdown to Trump tariffs",
    "description": "Japan's Nikkei share average ended Wednesday with a small rise after swinging between gains and losses, as traders positioned for U.S. President Donald Trump's tariffs.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ekes-out-gain-in-countdown-to-trump-tariffs/articleshow/119899332.cms",
    "timestamp": "2025-04-02T07:38:09Z"
  },
  {
    "title": "Trump tariffs will have massive effect on Italian companies, business lobby warns",
    "description": "The effect of U.S. tariffs on Italian companies will be massive, the head of national industry lobby Confindustria said on Wednesday, calling for Europe to...",
    "link": "https://finance.yahoo.com/news/trump-tariffs-massive-effect-italian-073756780.html",
    "timestamp": "2025-04-02T07:37:56Z"
  },
  {
    "title": "US moves B-2 stealth bombers to Indian Ocean island in massive show of force to Houthis, Iran | CNN",
    "description": "The Pentagon has sent at least six B-2 bombers – 30% of the US Air Force’s stealth bomber fleet – to the Indian Ocean island of Diego Garcia, in what analysts have called a message to Iran as tensions once again flare in the Middle East.",
    "link": "https://www.cnn.com/2025/04/02/middleeast/us-b2-bombers-diego-garcia-intl-hnk-ml/index.html",
    "timestamp": "2025-04-02T07:37:21Z"
  },
  {
    "title": "Opinion: Trump & The Ayatollah: It's a Pity Both Can't Lose",
    "description": "Who can predict the outcome of a tryst between a self-styled \"transactional\" deal-maker and those who coined the word \"Bazaar\" and raised negotiations to the art of 'Mutazayedat', or overbidding?",
    "link": "https://www.ndtv.com/opinion/trump-the-ayatollah-its-a-pity-both-cant-lose-8067975",
    "timestamp": "2025-04-02T07:35:43Z"
  },
  {
    "title": "NATO Tries To Keep US On Board Amid Fears Of Trump Withdrawal",
    "description": "Nervous US allies at NATO are scrambling to keep President Donald Trump engaged by upping defence spending, vowing to take the reins on Ukraine and queueing for face time at the White House.",
    "link": "https://www.ndtv.com/world-news/nato-tries-to-keep-us-on-board-amid-fears-of-trump-withdrawal-8067541",
    "timestamp": "2025-04-02T07:34:35Z"
  },
  {
    "title": "Starmer holds fire on Trump’s Liberation Day",
    "description": "It’s a big day, and nobody quite knows how it’ll end. U.S. President Donald Trump will share the details of his tariff plans at about 9 p.m. U.K. time. As we record, the message from the UK government stays the same — it’s a cool and calm approach, talks cont…",
    "link": "https://www.politico.eu/podcast/politics-at-sam-and-annes/starmer-holds-fire-on-trumps-liberation-day/",
    "timestamp": "2025-04-02T07:34:27Z"
  },
  {
    "title": "GOP Senator Warns Donald Trump That Tariffs Could Push His State's Farmers To The Brink",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_cb290014-3ad7-486b-a4dd-d349d99815b1",
    "timestamp": "2025-04-02T07:32:39Z"
  },
  {
    "title": "GOP Senator Warns Trump How Tariffs Could Push His State's Farmers To The Brink",
    "description": "North Carolina's Thom Tillis warned of \"irreparable\" damage.",
    "link": "https://www.huffpost.com/entry/thom-tillis-warning-tariffs-donald-trump_n_67ecd756e4b0923ef8b49736",
    "timestamp": "2025-04-02T07:32:39Z"
  },
  {
    "title": "How one of the largest auto suppliers in the world is preparing for Trump's tariffs - Reuters",
    "description": "How one of the largest auto suppliers in the world is preparing for Trump's tariffsReuters Trump doesn’t seem to understand how car prices workCNN Donald Trump’s plan for American carmaking is full of potholesThe Economist Trump Warned U.S. Automakers Not to …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176900247",
    "timestamp": "2025-04-02T07:32:22Z"
  },
  {
    "title": "Spike in Palo Alto Networks scanner activity suggests imminent cyber threats",
    "description": "Hackers are scanning for vulnerabilities in Palo Alto Networks GlobalProtect portals, likely preparing for targeted attacks. Researchers at the threat intelligence firm GreyNoise warn of hackers that are scanning for vulnerabilities in Palo Alto Networks Glob…",
    "link": "https://securityaffairs.com/176108/hacking/spike-in-palo-alto-networks-scanner-activity-suggests-imminent-cyber-threats.html",
    "timestamp": "2025-04-02T07:29:05Z"
  },
  {
    "title": "Wisconsin Supreme Court Election Results: Susan Crawford Defeats Elon Musk-Backed Brad Schimel",
    "description": "Democrats are over the moon after Susan Crawford crushed the Wisconsin Supreme Court race, defeating Brad Schimel who had the support of Elon Musk and President Donald Trump.",
    "link": "https://www.ibtimes.com/wisconsin-supreme-court-election-results-susan-crawford-defeats-elon-musk-backed-brad-schimel-3768507",
    "timestamp": "2025-04-02T07:29:05Z"
  },
  {
    "title": "Dems say Wisconsin voters 'decisively' rejected Trump, Musk after liberal wins state Supreme Court seat",
    "description": "Democrats celebrated after the liberal-leaning candidate won an election on Tuesday for a seat on Wisconsin's Supreme Court, protecting the liberal majority on the bench.",
    "link": "https://www.foxnews.com/politics/dems-say-wisconsin-voters-decisively-rejected-trump-musk-after-liberals-win-state-supreme-court-seat",
    "timestamp": "2025-04-02T07:25:10Z"
  },
  {
    "title": "Department of Homeland Security Opposes Ending Trump Tariffs on Canada Due to Flow of Illicit Drugs",
    "description": "The Department of Homeland Security (DHS) said in a memo this week it opposes ending President Donald Trump's tariffs on Canada to the flow of illicit drugs across the northern border.\nThe post Department of Homeland Security Opposes Ending Trump Tariffs on C…",
    "link": "https://www.breitbart.com/politics/2025/04/02/department-of-homeland-security-opposes-ending-trump-tariffs-on-canada-due-to-flow-of-illicit-drugs/",
    "timestamp": "2025-04-02T07:23:29Z"
  },
  {
    "title": "Houthi Video Shows Wreckage They Say Is Downed U.S. Drone",
    "description": "The Houthis claim to have shot down a U.S. drone as they come under repeated air attack by American forces",
    "link": "https://www.newsweek.com/houthis-yemen-red-sea-donald-trump-united-states-shipping-2053974",
    "timestamp": "2025-04-02T07:23:15Z"
  },
  {
    "title": "Hochul calls for mother, 3 kids apprehended by ICE from upstate NY farm to be released",
    "description": "Eight people, including a mother and her three children, were taken into custody by US Immigration and Customs Enforcement from an upstate New York farm last week — and now Gov. Kathy Hochul is calling for their release and return to the Empire State.",
    "link": "https://nypost.com/2025/04/02/us-news/hochul-calls-for-mother-3-kids-apprehended-by-ice-from-upstate-ny-farm-to-be-released/",
    "timestamp": "2025-04-02T07:22:29Z"
  },
  {
    "title": "Trump’s tariffs could bring economic shock for Ireland",
    "description": "Donald Trump’s new tariffs could have huge economic impact on Ireland. Meanwhile political class focused only on speaking rights row.",
    "link": "https://www.irishtimes.com/politics/2025/04/02/trumps-tariffs-could-bring-economic-shock-for-ireland/",
    "timestamp": "2025-04-02T07:13:30Z"
  },
  {
    "title": "Ericsson denies Trump demands pushed it to remove diversity references",
    "description": "Swedish telecom giant Ericsson has removed all references to 'diversity and inclusion' from its annual report after US President Donald Trump moved to abolish diversity, equity and inclusion programmes (DEI) in the public and private sectors.",
    "link": "https://www.thelocal.se/20250402/ericsson-denies-trump-demands-pushed-it-to-remove-diversity-references",
    "timestamp": "2025-04-02T07:13:27Z"
  },
  {
    "title": "Commentary: Appeasing Washington will lead to more economic bullying",
    "description": "BEIJING, April 2 (Xinhua) -- By doubling down on tariffs under the pretext of",
    "link": "http://en.people.cn/n3/2025/0402/c90000-20297322.html",
    "timestamp": "2025-04-02T07:09:38Z"
  },
  {
    "title": "Yemen blames death of four on US strikes",
    "description": "Yemen’s Huthi rebels said on Wednesday that overnight air strikes on Hodeida province killed four people in an attack they blamed on the United States. “The casualty toll of the American aggression targeting the Water Management building in… Hodeida governora…",
    "link": "https://punchng.com/yemen-blames-death-of-four-on-us-strikes/",
    "timestamp": "2025-04-02T07:08:27Z"
  },
  {
    "title": "Global investors cautious, gold rises as markets await ‘liberation day’ tariff announcement – business live",
    "description": "Donald Trump to announce latest round of tariffs at 8pm GMT\nIpek Ozkardeskaya, senior analyst at Swissquote Bank, said that after the US manufacturing data yesterday,\nThe Fed is still expected to deliver its next rate cut in June – and not before – but things…",
    "link": "https://biztoc.com/x/93b60bd48f345148",
    "timestamp": "2025-04-02T07:08:19Z"
  },
  {
    "title": "Europe opens lower ahead of Trump's new tariffs",
    "description": "Major European stock markets opened lower on Wednesday ahead of the new tariffs which are set to be imposed by United States President Donald Trump later today. Investors anticipated how the evolving ...",
    "link": "https://biztoc.com/x/5aeeb8c861e2fd9d",
    "timestamp": "2025-04-02T07:08:18Z"
  },
  {
    "title": "'Forge Warriors, Rebuild Strength, Restore Deterrence,' Hegseth Tells Midshipmen During Academy Visit",
    "description": "The Brigade of Midshipmen greeted Defense Secretary Pete Hegseth with thunderous applause upon his arrival to King Hall at the U.S. Naval Academy this afternoon to kick off the defense secretary's first visit to the academy since his confirmation in January.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250401-dodnews03.htm",
    "timestamp": "2025-04-02T07:05:20Z"
  },
  {
    "title": "How Hungary Will Defy An ICC Arrest Warrant When Netanyahu Visits",
    "description": "When Israeli Prime Minister Benjamin Netanyahu visits Hungary, it is virtually certain he will not be detained despite an arrest warrant from the International Criminal Court over alleged war crimes in Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250402-rferl02.htm",
    "timestamp": "2025-04-02T07:05:20Z"
  },
  {
    "title": "Leader's aide: If US strikes, Iran may have no choice but to go nuclear",
    "description": "A senior advisor to Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei has warned that if the United States and Israel bomb Iran under any nuclear pretext, the Islamic Republic may have no choice but to go nuclear.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-presstv06.htm",
    "timestamp": "2025-04-02T07:05:10Z"
  },
  {
    "title": "Ukraine's NATO Obsession Led to Crisis - Trump",
    "description": "US President Donald Trump said that the issue of Kiev's membership in NATO had been the cause of the Ukraine conflict, and it was not discussed in the context of the rare earth metals deal.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250401-sputnik02.htm",
    "timestamp": "2025-04-02T07:05:10Z"
  },
  {
    "title": "New U.S. sanctions target a network allegedly involved in Iran's drone program",
    "description": "The U.S. Department of the Treasury has imposed sanctions targeting a network of entities and individuals it accused of being involved in procuring components for Iran's drone program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-irna01.htm",
    "timestamp": "2025-04-02T07:05:10Z"
  },
  {
    "title": "Germany's Baerbock Warns Of Putin Stalling Tactics During Kyiv Visit",
    "description": "German Foreign Minister Annalena Baerbock, in Kyiv on a surprise visit, has warned against falling for Russia's stalling tactics in peace negotiations to end the war in Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250401-rferl02.htm",
    "timestamp": "2025-04-02T07:05:04Z"
  },
  {
    "title": "No such thing as 'military option' let alone 'military solution' to nuclear issue: Foreign minister",
    "description": "Foreign Minister Abbas Araghchi has stressed the importance of diplomacy over Iran's nuclear program, warning there is no \"military solution\" as tensions escalate following US President Donald Trump's threats to bomb Iran's nuclear infrastructure.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-presstv02.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "US Military Orders Second Aircraft Carrier Group To Middle East",
    "description": "The US military has announced a second aircraft carrier group will deploy to the Middle East to respond to regional threats to stability as US forces continue to hit Iran-linked Huthi fighters in Yemen from its ships in the Red Sea.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250402-rferl04.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Nominee for Chairman: Military's Top Job is Creating Peace Through Strength",
    "description": "The U.S. military must fight America's wars when needed. Still, the military's top priority is to prevent those wars by signaling to adversaries its readiness to fight and win in any scenario, said President Donald J. Trump's nominee for chairman of the Joint…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250401-dodnews02.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Iran determined to implement all its agreements with Iraq: President Pezeshkian",
    "description": "President Masoud Pezeshkian has reaffirmed the Islamic Republic's commitment to strengthening its relations with its friendly neighbor Iraq, saying Iran is determined to implement all the agreements between Tehran and Baghdad in order to thwart enemies' plots…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-presstv05.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "What We Know — And Don't Know — About Trump's Massive Tariff Plan",
    "description": "US President Donald Trump is set to announce a number of massive tariffs on April 2 as part of his ambitious economic agenda to rewire the United States' trading relationships with its allies and adversaries alike, while shaking up the global economy in the p…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250402-rferl03.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "EU Lawmakers Debate Support For RFE/RL Amid US Funding Freeze",
    "description": "European Commissioner for Enlargement Marta Kos has emphasized the \"need to protect Radio Free Europe/Radio Liberty (RFE/RL),\" warning that \"if we don't, we hand a gift to autocrats the world over.\"",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250401-rferl01.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Dodik Meets With Putin As Visit To Moscow Riles Bosnian Lawmakers",
    "description": "Bosnian Serb leader Milorad Dodik met with Russian President Vladimir Putin during a surprise visit to Moscow as lawmakers back home warned the nationalist leader was putting Bosnia-Herzegovina's EU drive at risk.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250401-rferl03.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Leader's aide: Bombing Iran would push it to develop nuclear weapons to defend itself",
    "description": "A senior adviser to Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei says Iran doesn't seek to build nuclear weapons but any strike on the country by the United States or Israel on the false pretext that it does would force the country to develo…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-irna03.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "In letter to UN, Iran condemns Trump's 'reckless, belligerent remarks'",
    "description": "Iran has strongly condemned US President Donald Trump's latest threats against the country, describing them as a flagrant violation of international law and principles of the UN Charter.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-presstv07.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "At Brussels Foreign Ministers Summit, All Eyes Will Be On Marco Rubio",
    "description": "On April 3-4, NATO foreign ministers will gather in Brussels for their regular spring meeting.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250402-rferl01.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Trump vows to continue strikes on Yemen's Houthis",
    "description": "U.S. President Donald Trump vowed on Monday that strikes on Yemen's Houthis will continue until they are no longer a threat to U.S. ships.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/04/mil-250401-pdo02.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Russia condemns Trump's threat to strike Iran, warns of 'catastrophic' consequences",
    "description": "Russia has condemned U.S. President Donald Trump's threat of military strikes on Iran, warning that such a move could have \"catastrophic\" consequences for the region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-irna02.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Russia warns any US attack on Iran would have 'catastrophic' consequences for entire region",
    "description": "Russia's deputy foreign minister has warned the United States that any military attack on Iran's nuclear sites would have \"catastrophic\" consequences for the entire region.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250401-presstv01.htm",
    "timestamp": "2025-04-02T07:05:03Z"
  },
  {
    "title": "Tuberville on Judicial Lawfare: 'This Is Four-Corners Basketball, Keep-Away'",
    "description": "Tuesday, during an appearance on FNC's \"The Will Cain Show,\" Sen. Tommy Tuberville (R-AL) warned of the perils of federal judges continuing to interfere with President Donald Trump's effort to fulfill his presidential duties.\nThe post Tuberville on Judicial L…",
    "link": "https://www.breitbart.com/clips/2025/04/02/tuberville-on-judicial-lawfare-this-is-four-corners-basketball-keep-away/",
    "timestamp": "2025-04-02T07:03:19Z"
  },
  {
    "title": "Israel says expands Gaza offensive to seize ‘large areas’",
    "description": "Israeli Defence Minister Israel Katz announced Wednesday a major expansion of a military operation in the Hamas-run Gaza Strip, saying the army would seize “large areas” of the Palestinian territory. The defence chief said in a statement that Israel would exp…",
    "link": "https://www.digitaljournal.com/world/israel-says-expands-gaza-offensive-to-seize-large-areas/article",
    "timestamp": "2025-04-02T07:02:21Z"
  },
  {
    "title": "Trump faces first electoral setback after Wisconsin Supreme Court vote",
    "description": "Donald Trump’s second presidency was dealt a spinning blow by voters in Wisconsin Tuesday as they elected a liberal judge to the state’s Supreme Court, despite his powerful advisor Elon Musk pouring millions into the race to sway the polls. Two months into hi…",
    "link": "https://www.digitaljournal.com/world/trump-faces-first-electoral-setback-after-wisconsin-supreme-court-vote/article",
    "timestamp": "2025-04-02T07:02:21Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Trump ‘Liberation Day’ tariffs loom, tourism figures drop and Val Kilmer dead at 65",
    "link": "https://www.thejournal.ie/8-at-8-wednesday-117-6665500-Apr2025/",
    "timestamp": "2025-04-02T07:01:27Z"
  },
  {
    "title": "Bombs away: Viral coverage stirs debate on New York Yankees’ ‘torpedo bats’",
    "description": "The New York Yankees' new torpedo bats, developed by MIT physicist Aaron Leanhardt who has also done work for NASA, have gone viral and sparked a fierce debate.",
    "link": "https://www.foxnews.com/media/bombs-away-viral-coverage-stirs-debate-new-york-yankees-torpedo-bats",
    "timestamp": "2025-04-02T07:00:07Z"
  },
  {
    "title": "Tariffs Explained: Impacts for You as Major New Trump Tariffs Arrive Today",
    "description": "President Donald Trump has dubbed April 2, the day many of his major tariffs will take effect, \"Liberation Day.\" Still, the reality of the situation will be a lot less grandiose for everyday people.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-impacts-for-you-as-major-new-trump-tariffs-arrive-today/",
    "timestamp": "2025-04-02T07:00:00Z"
  },
  {
    "title": "How to Talk to your Son about Dangerous Extremist Influencers",
    "description": "With TV drama Adolescence and Andrew Tate currently in the news, author Craig Johnson asks how the toxic ideology extremist influencers became so widespread and offers practical advice to help young people affected. CW: Reference to sexual assault and violenc…",
    "link": "https://thequietus.com/opinion-and-essays/black-sky-thinking/adolescence-andrew-tate-explained/",
    "timestamp": "2025-04-02T07:00:00Z"
  },
  {
    "title": "Crypto prices today: Bitcoin tops $84k ahead of US tariffs, altcoins trade mixed",
    "description": "Markets are preparing for the announcement of new reciprocal tariffs, expected to be revealed at 1:30 a.m. IST, which could take effect right away. Trump has already imposed tariffs on aluminum, steel, and automobiles, along with higher duties on Chinese impo…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/crypto-prices-today-bitcoin-tops-84k-ahead-of-us-tariffs-altcoins-trade-mixed/articleshow/119898154.cms",
    "timestamp": "2025-04-02T06:56:11Z"
  },
  {
    "title": "Israel announces major military expansion in Gaza as dawn air strikes kill 15 people",
    "description": "A house sheltering displaced people was bombed early this morning.",
    "link": "https://www.thejournal.ie/gaza-latest-news-6665478-Apr2025/",
    "timestamp": "2025-04-02T06:51:27Z"
  },
  {
    "title": "Trump Faces First Electoral Setback After Wisconsin Supreme Court Vote",
    "description": "Donald Trump's second presidency was dealt a spinning blow by voters in Wisconsin Tuesday as they elected a liberal judge to the state's Supreme Court, despite his powerful advisor Elon Musk pouring millions into the race to sway the polls.",
    "link": "https://www.ibtimes.com.au/trump-faces-first-electoral-setback-after-wisconsin-supreme-court-vote-1857474",
    "timestamp": "2025-04-02T06:51:16Z"
  },
  {
    "title": "Trump Faces First Electoral Setback After Wisconsin Supreme Court Vote",
    "description": "Donald Trump's second presidency was dealt a spinning blow by voters in Wisconsin Tuesday as they elected a liberal judge to the state's Supreme Court, despite his powerful advisor Elon Musk pouring millions into the race to sway the polls.",
    "link": "https://www.ibtimes.com/trump-faces-first-electoral-setback-after-wisconsin-supreme-court-vote-3768515",
    "timestamp": "2025-04-02T06:51:13Z"
  },
  {
    "title": "‘Liberation Day’: Ireland braces for economic shock as Trump to announce tariffs",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/politics/liberation-day-ireland-braces-for-economic-shock-as-trump-to-announce-tariffs/a616185087.html",
    "timestamp": "2025-04-02T06:50:00Z"
  },
  {
    "title": "Trump's ‘Liberation Day’: Ireland braces for economic shock as US president to announce tariffs",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/politics/trumps-liberation-day-ireland-braces-for-economic-shock-as-us-president-to-announce-tariffs/a616185087.html",
    "timestamp": "2025-04-02T06:50:00Z"
  },
  {
    "title": "‘Liberation Day’: Ireland braces for economic shock as Trump to announce tariffs",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/liberation-day-ireland-braces-for-economic-shock-as-trump-to-announce-tariffs/a616185087.html",
    "timestamp": "2025-04-02T06:50:00Z"
  },
  {
    "title": "Mexico's Security Chief Harfuch Quietly Formed UNO, an Elite Federal Police Force to Take on Cartels",
    "description": "\"Socalj\" for Borderland Beat  Six years ago Mexico’s president disbanded the country’s Federal Police and handed security responsibilities f...",
    "link": "https://www.borderlandbeat.com/2025/04/mexicos-security-chief-harfuch-quietly.html",
    "timestamp": "2025-04-02T06:50:00Z"
  },
  {
    "title": "Trump's ‘Liberation Day’: Ireland braces for economic shock as US president to announce tariffs",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/irish-news/trumps-liberation-day-ireland-braces-for-economic-shock-as-us-president-to-announce-tariffs/a616185087.html",
    "timestamp": "2025-04-02T06:50:00Z"
  },
  {
    "title": "NATO presses to keep Trump on board, but is he hobbling alliance?",
    "description": "As the Trump administration savages Europe, undercuts Kyiv and warms to Russia, there is fear that even if the alliance is salvaged, it runs the risk of being hollowed out.",
    "link": "https://www.japantimes.co.jp/news/2025/04/02/world/politics/nato-trump-alliance/",
    "timestamp": "2025-04-02T06:49:00Z"
  },
  {
    "title": "Stock markets fluctuate amid uncertainty over Trump tariffs",
    "description": "Equity markets were mixed Wednesday as nervous investors brace for Donald Trump’s wave of tariffs later in the day, with speculation about what he has in store stoking uncertainty on trading floors. Equities have been battered leading up to the US president’s…",
    "link": "https://punchng.com/stock-markets-fluctuate-amid-uncertainty-over-trump-tariffs/",
    "timestamp": "2025-04-02T06:46:15Z"
  },
  {
    "title": "Investors are turning bearish on the U.S. dollar as Trump tariffs loom",
    "description": "The rollout of U.S. President Donald Trump's tariffs regime is dampening sentiment toward the dollar and prompting investors to look elsewhere for their foreign exchange (FX) trades, strategists told CNBC.\nThe dollar index, which measures the value of the gre…",
    "link": "https://biztoc.com/x/55eee569acc1bda5",
    "timestamp": "2025-04-02T06:46:02Z"
  },
  {
    "title": "Trump tariffs 'could cost NI firms £100m'",
    "description": "Trump tariffs 'could cost NI firms £100m'\nTariffs of 20% on Northern Ireland goods entering the US could cost local businesses at least £100m in lost sales, an economist has estimated.\nUS President Donald Trump is expected to announce a new round of tariffs o…",
    "link": "https://biztoc.com/x/5eeacfacb002b871",
    "timestamp": "2025-04-02T06:46:00Z"
  },
  {
    "title": "Trump is set to announce 'reciprocal' tariffs in a risky move that could reshape the economy",
    "description": "Trump is set to announce 'reciprocal' tariffs in a risky move that could reshape the economy\nPresident Donald Trump is set to launch a barrage of so-called reciprocal tariffs on friend and foe alike\nWASHINGTON -- After weeks of White House hype and public anx…",
    "link": "https://biztoc.com/x/88fdae7ddc4137d1",
    "timestamp": "2025-04-02T06:45:52Z"
  },
  {
    "title": "Stock market today: Asian shares mostly decline ahead of Trump's latest tariffs",
    "description": "Asian shares are mostly falling, shaken by jitters over what President Donald Trump will announce about tariffs on his “Liberation Day” later in the global day",
    "link": "https://biztoc.com/x/eec7644599c3b40a",
    "timestamp": "2025-04-02T06:45:52Z"
  },
  {
    "title": "Russia, China sent hundreds of people to help Myanmar, as the US sends three",
    "description": "The United States is sending a three-person disaster response team to earthquake-stricken Myanmar, days after much larger contingents from China and Russia began pulling people out of the rubble.",
    "link": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-usaid-cuts-emergency-response/105125224",
    "timestamp": "2025-04-02T06:45:43Z"
  },
  {
    "title": "Investors are turning bearish on the U.S. dollar as Trump tariffs loom",
    "description": "Market watchers told CNBC they saw upside for certain currencies amid \"erosion of confidence in the dollar.\"",
    "link": "https://www.cnbc.com/2025/04/02/liberation-day-how-fx-investors-are-trading-currencies.html",
    "timestamp": "2025-04-02T06:39:20Z"
  },
  {
    "title": "Election diary: Dutton tries to shake off Trump dust and avoid being trapped on wages",
    "description": "As we prepare for Trump’s “Liberation Day” both sides of the campaign are bracing to see what the how Trump will effect the campaign.",
    "link": "https://theconversation.com/election-diary-dutton-tries-to-shake-off-trump-dust-and-avoid-being-trapped-on-wages-253117",
    "timestamp": "2025-04-02T06:39:10Z"
  },
  {
    "title": "Kazakh CPC Oil Exports Capped at 700,000 bpd After Russian Suspension",
    "description": "Caspian Pipeline Consortium (CPC) blend oil exports have been capped at 1 million barrels per day, taking 700,000 bpd off the market, after Russia ordered the shutdown of two out of three moorings at the CPC main Black Sea oil export terminal.  The order went…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Kazakh-CPC-Oil-Exports-Capped-at-700000-bpd-After-Russian-Suspension.html",
    "timestamp": "2025-04-02T06:38:07Z"
  },
  {
    "title": "China carries out live-fire exercises in drill encircling Taiwan - military",
    "description": "Such drills have become increasingly routine amid souring cross-strait ties.",
    "link": "https://www.bbc.com/news/articles/c24q5pg8m07o",
    "timestamp": "2025-04-02T06:37:45Z"
  },
  {
    "title": "Nintendo to reveal Switch 2 details with pricing, launch date in focus",
    "description": "TOKYO : Nintendo is set to reveal details of its Switch 2 on Wednesday with investors looking for the pricing and launch date of the successor to the home-portable Switch gaming device.Analysts expect a smooth transition to the new device with the Kyoto-based…",
    "link": "https://www.channelnewsasia.com/business/nintendo-reveal-switch-2-details-pricing-launch-date-focus-5039411",
    "timestamp": "2025-04-02T06:36:43Z"
  },
  {
    "title": "PM signals 'more to say' about China's controversial Darwin Port lease",
    "description": "American officials have continued to voice their concerns about the agreement signed with Beijing-controlled Landbridge since the election of Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-04-02/pm-more-to-say-about-china-darwin-port-lease/105129244",
    "timestamp": "2025-04-02T06:35:30Z"
  },
  {
    "title": "Trump Travel Ban Might Hit This Bitcoin-Friendly Country And No It's Not El Salvador",
    "description": "The Donald Trump administration is considering putting stringent travel restrictions on several countries, with citizens from up to 11 countries facing a total ban on entering the U.S. \nWhat happened: The draft list of recommendations included Bhutan in the \"…",
    "link": "https://biztoc.com/x/e3d425c960c9edc1",
    "timestamp": "2025-04-02T06:34:42Z"
  },
  {
    "title": "CNBC Daily Open: Trump tariffs could be hours away — but might be milder than thought",
    "description": "Investors were slightly assuaged by reports that tariffs could be lower than expected, pushing up stocks. It is, however, too early to let down your guard.",
    "link": "https://www.cnbc.com/2025/04/02/cnbc-daily-open-tariffs-could-be-near-might-be-milder-than-thought.html",
    "timestamp": "2025-04-02T06:32:58Z"
  },
  {
    "title": "A wary Europe awaits Rubio with NATO's future on the line",
    "description": "Secretary of State Marco Rubio is traveling this week to a gathering of top diplomats from NATO countries",
    "link": "https://abcnews.go.com/US/wireStory/wary-europe-awaits-rubio-natos-future-line-120399372",
    "timestamp": "2025-04-02T06:22:16Z"
  },
  {
    "title": "Democrats' win in Wisconsin court race also is a big loss for Elon Musk",
    "description": "The Democrats' victory in the Wisconsin Supreme Court race is a big loss for Elon Musk",
    "link": "https://abcnews.go.com/US/wireStory/democrats-win-wisconsin-court-race-big-loss-elon-120398589",
    "timestamp": "2025-04-02T06:22:14Z"
  },
  {
    "title": "'Embrace instead of being paranoid': As US tariffs loom, Minhaz Merchant says this is biggest economic reform India needs",
    "description": "India and US are navigating heightened trade tensions due to the implementation of reciprocal tariffs by the Trump administration",
    "link": "https://www.businesstoday.in/latest/economy/story/embrace-instead-of-being-paranoid-as-us-tariffs-loom-minhaz-merchant-says-this-is-biggest-economic-reform-india-needs-470301-2025-04-02",
    "timestamp": "2025-04-02T06:21:33Z"
  },
  {
    "title": "Israel Says Expands Gaza Offensive To Seize 'Large Areas'",
    "description": "Israeli Defence Minister Israel Katz announced Wednesday a major expansion of a military operation in the Hamas-run Gaza Strip, saying the army would seize \"large areas\" of the Palestinian territory.",
    "link": "https://www.ibtimes.com/israel-says-expands-gaza-offensive-seize-large-areas-3768506",
    "timestamp": "2025-04-02T06:21:16Z"
  },
  {
    "title": "Hakeem Jeffries: Voters Rejecting 'Rapidly Deteriorating Republican Brand'",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) claimed Tuesday on MSNBC's \"The Last Word\" that voters were rejecting the \"rapidly deteriorating Republican brand\" while discussing two special elections in Florida that the Republicans won and one race for a seat …",
    "link": "https://www.breitbart.com/clips/2025/04/01/hakeem-jeffries-voters-rejecting-rapidly-deteriorating-republican-brand/",
    "timestamp": "2025-04-02T06:17:06Z"
  },
  {
    "title": "Wisconsin and Florida elections provide early warning signs to Trump and Republicans",
    "description": "A trio of elections have provided plenty of warning signs to Republicans and President Donald Trump",
    "link": "https://abcnews.go.com/Politics/wireStory/wisconsin-florida-elections-provide-early-warning-signs-trump-120401102",
    "timestamp": "2025-04-02T06:14:29Z"
  },
  {
    "title": "Premier-shaped hole hard to explain for Albanese — but Dutton jumped straight in",
    "description": "As Australia braces for Trump's trade call, Anthony Albanese and Peter Dutton have spent a day on the hustings in Melbourne.",
    "link": "https://www.abc.net.au/news/2025-04-02/jacinta-allan-anthony-albanese-peter-dutton-federal-election/105125912",
    "timestamp": "2025-04-02T06:11:36Z"
  },
  {
    "title": "Cory Booker's Record-Setting Senate Speech Had Many Hollywood Elements",
    "description": "The New Jersey senator's epic floor session drew many cues from Hollywood, and may teach it a few things too.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/cory-booker-senate-speech-record-1236179068/",
    "timestamp": "2025-04-02T06:08:37Z"
  },
  {
    "title": "Meme politics: White House embraces aggressive alt-right online culture",
    "description": "The official White House X account is embracing the communications strategy that often celebrates others' suffering.\nThe post Meme politics: White House embraces aggressive alt-right online culture appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/meme-politics-white-house-embraces-aggressive-alt-right-online-culture/article",
    "timestamp": "2025-04-02T06:06:49Z"
  },
  {
    "title": "Midnight shocker? 5 Indian sectors on edge as Trump to drop tariff bomb",
    "description": "Indian exporters brace for potential impact as President Trump announces new tariffs on various sectors. Key areas such as agriculture, pharmaceuticals, chemicals, electronics, and automobiles could face significant tariff hikes. Shrimp exports, pharmaceutica…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/midnight-shocker-5-indian-sectors-on-edge-as-trump-to-drop-tariff-bomb/articleshow/119896680.cms",
    "timestamp": "2025-04-02T06:06:38Z"
  },
  {
    "title": "Japan has some cards to play in trade war with the United States",
    "description": "It could offer voluntary restraints on exports, or it could offer to buy more from the U.S. in order to reduce the trade surplus with that country.",
    "link": "https://www.japantimes.co.jp/business/2025/04/02/economy/tariff-japan-cards/",
    "timestamp": "2025-04-02T06:06:00Z"
  },
  {
    "title": "Trump to escalate global trade tensions with new reciprocal tariffs on US trading partners (Reuters)",
    "description": "Reuters:\nTrump to escalate global trade tensions with new reciprocal tariffs on US trading partners  —  U.S. President Donald Trump was poised to impose sweeping new reciprocal tariffs on global trading partners on Wednesday, upending decades of rules-based t…",
    "link": "https://www.memeorandum.com/250402/p5",
    "timestamp": "2025-04-02T06:05:01Z"
  },
  {
    "title": "Israel says it will expand Gaza military operation, seize large areas of enclave",
    "description": "More than 140,000 people have been displaced again since end of the Israel-Hamas ceasefire, UN estimates",
    "link": "https://www.irishtimes.com/world/middle-east/2025/04/02/gaza-strip-israel-hamas-war/",
    "timestamp": "2025-04-02T06:02:17Z"
  },
  {
    "title": "The Washington Post’s David Ignatius Remains the Leading Apologist for the CIA",
    "description": "For the past 20 years, the Washington Post’s David Ignatius has been the mainstream media’s leading apologist for the Central Intelligence Agency, and his latest editorial essay (“Intelligence analysts are still doing their job”) indicates he is loathe to yie…",
    "link": "https://www.counterpunch.org/2025/04/02/the-washington-posts-david-ignatius-remains-the-leading-apologist-for-the-cia/",
    "timestamp": "2025-04-02T06:00:44Z"
  },
  {
    "title": "Wisconsin voters overwhelmingly approve voter ID constitutional amendment, Trump celebrates â\u0080\u009cbig winâ\u0080\u009d",
    "description": "Wisconsin voters approved a constitutional amendment requiring photo ID for voting, backed by 63.1% of voters. Republicans solidified the voter ID law to prevent future legal or legislative challenges. Democrats retained control of the Wisconsin Supreme Court…",
    "link": "https://www.naturalnews.com/2025-04-02-wisconsin-voters-approve-id-amendment.html",
    "timestamp": "2025-04-02T06:00:00Z"
  },
  {
    "title": "Federal charges filed in Tesla firebombing as far-left attacks spark national alarm",
    "description": "DOJ charges Cooper Frederick for firebombing a Tesla dealership in Colorado, endangering workers. Far-left extremists are linked to a surge in violent attacks on Tesla properties nationwide. President Trump demands 20-year sentences for perpetrators, calling …",
    "link": "https://www.naturalnews.com/2025-04-02-federal-charges-tesla-firebombing-attacks-alarm.html",
    "timestamp": "2025-04-02T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s Threat to Bomb Iran Risks Triggering Global Nuclear War, Analysts Warn",
    "description": "Trump’s aggressive threats toward Iran risk sparking global conflict, with analysts warning miscalculations could lead to World War III amid Iran’s nuclear-capable missiles and Russian alliances. Critics accuse Trump of falling into an Israeli-led strategy, e…",
    "link": "https://www.naturalnews.com/2025-04-02-trumps-threat-to-bomb-iran-risks-triggering-global-nuclear-war.html",
    "timestamp": "2025-04-02T06:00:00Z"
  },
  {
    "title": "Cory Booker sets a record with marathon US Senate speech",
    "description": "Democratic senator Cory Booker broke the record for the longest speech on the US Senate floor with a marathon critique of president Donald Trump.",
    "link": "https://www.independent.ie/world-news/north-america/cory-booker-sets-a-record-with-marathon-us-senate-speech/a883741566.html",
    "timestamp": "2025-04-02T05:59:00Z"
  },
  {
    "title": "Democrat Cory Booker sets a record with marathon US Senate speech – at more than 25 hours long",
    "description": "Democratic senator Cory Booker has broken the record for the longest speech on the US Senate floor with a marathon critique of President Donald Trump.",
    "link": "https://www.independent.ie/world-news/north-america/democrat-cory-booker-sets-a-record-with-marathon-us-senate-speech-at-more-than-25-hours-long/a883741566.html",
    "timestamp": "2025-04-02T05:59:00Z"
  }
]