[
  {
    "title": "Russian oil company Lukoil to sell international assets in response to Trump sanctions",
    "description": "Lukoil is selling its international assets in response to U.S. sanctions",
    "link": "https://abcnews.go.com/International/wireStory/russian-oil-company-lukoil-sell-international-assets-response-126926241",
    "timestamp": "2025-10-28T09:49:48Z"
  },
  {
    "title": "How International Crises Help Authoritarians",
    "description": "In today’s increasingly multipolar world, the rise of geopolitical conflicts has been a boon for competitive authoritarian regimes. Russia’s war against Ukraine, for example, strengthened the domestic positions of Hungarian Prime Minister Viktor Orbán and Tur…",
    "link": "https://www.project-syndicate.org/commentary/ukraine-war-helped-authoritarians-orban-hungary-erdogan-turkey-by-senem-aydin-duzgit-2025-10",
    "timestamp": "2025-10-28T09:42:19Z"
  },
  {
    "title": "Can Trump’s political formula find an audience in Europe?",
    "description": "Donald Trump’s appeal is built on a blend of border control, neoliberalism and mercantilism, writes Giray Gozgor. Yet while this mix might seem uniquely American, there are signs of the … Continued\nThe post Can Trump’s political formula find an audience in Eu…",
    "link": "https://blogs.lse.ac.uk/europpblog/2025/10/28/european-trumpism-can-trumps-political-formula-find-an-audience-in-europe/",
    "timestamp": "2025-10-28T09:42:04Z"
  },
  {
    "title": "Takaiichi and Trump Emphasize Importance of Japan-U.S. Alliance",
    "description": "Prime Minister Takaiichi’s first face-to-face meeting with U.S. President Trump drew high praise from officials at the Prime Minister’s Office, who described the atmosphere as friendly and open. According to government sources, the two leaders addressed each …",
    "link": "https://newsonjapan.com/article/147427.php",
    "timestamp": "2025-10-28T09:39:06Z"
  },
  {
    "title": "The Art of Documentary Photography: Matt McClain",
    "description": "The photographers we are featuring over the next few days are exceptional documentary photographers and photojournalists. What really stands out is their ability to capture reality and translate it into something poetic and powerful. They are successful becau…",
    "link": "http://lenscratch.com/2025/10/the-art-of-documentary-photography-matt-mcclain/",
    "timestamp": "2025-10-28T09:37:29Z"
  },
  {
    "title": "K-경제 미국의 심각한 양극화 진행",
    "description": "Chinese and US trade negotiators have lined up an array of agreements for Xi Jinping and Donald Trump to formally unveil this week, but none address the core issues: Here’s your Evening Briefing https://t.co/Qc7JGpulDk— Bloomberg (@business) October 27, 2025 …",
    "link": "https://ryueyes11.tistory.com/511951",
    "timestamp": "2025-10-28T09:37:01Z"
  },
  {
    "title": "Man accused of killing Charlie Kirk can avoid wearing prison uniform in court",
    "description": "Judge Tony Graf ruled that Tyler Robinson 'shall be dressed as one who is presumed innocent'. Prosecutors are seeking the death penalty over the killing of the conservative activist.",
    "link": "https://news.sky.com/story/man-accused-of-killing-charlie-kirk-can-avoid-wearing-prison-uniform-in-court-but-must-be-restrained-13459222",
    "timestamp": "2025-10-28T09:36:00Z"
  },
  {
    "title": "Man admits murdering Japan's former prime minister",
    "description": "Tetsuya Yamagami, 45, held a grudge against the controversial Unification Church, which he believed had close ties to Shinzo Abe and other Japanese politicians.",
    "link": "https://news.sky.com/story/man-admits-murdering-japans-former-prime-minister-shinzo-abe-13459224",
    "timestamp": "2025-10-28T09:36:00Z"
  },
  {
    "title": "Anwar trumps as 47th Asean Summit host, raises Malaysia's stature in the eyes of the world",
    "description": "KUALA LUMPUR: Prime Minister Datuk Seri Anwar Ibrahim's highly successful hosting of the 47th Asean Summit in 2025 marks a triumphant diplomatic achievement for Malaysia in validating its leadership in a rapidly evolving and sometimes tumultuous regional and …",
    "link": "https://www.thestar.com.my/news/nation/2025/10/28/anwar-trumps-as-47th-asean-summit-host-raises-malaysia039s-stature-in-the-eyes-of-the-world",
    "timestamp": "2025-10-28T09:36:00Z"
  },
  {
    "title": "Why is Tether So Profitable, and Will It Last?",
    "description": "Tether appears to be unstoppable right now, with the world’s largest stablecoin issuer on track to make about $15 billion this year.That’s a staggering...",
    "link": "https://cryptonews.com/exclusives/why-is-tether-so-profitable-and-will-it-last/",
    "timestamp": "2025-10-28T09:33:52Z"
  },
  {
    "title": "Trump praises Japan's new prime minister, saying US is an 'ally at the strongest level'",
    "description": "President Donald Trump has met with Japan's new Prime Minister, Sanae Takaichi, during his trip to Asia",
    "link": "https://abcnews.go.com/Business/wireStory/trump-praises-japans-new-prime-minister-us-ally-126914977",
    "timestamp": "2025-10-28T09:33:45Z"
  },
  {
    "title": "Trump Set to Dine With OpenAI, Salesforce CEO in Tokyo",
    "description": "US President Donald Trump plans to dine with chief executive officers including Salesforce Inc.’s Marc Benioff, Toshiba Corp.’s Taro Shimada and Rakuten Group Inc.’s Hiroshi Mikitani as he looks to tout Japanese investment in the US and wraps his visit to Tok…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-set-to-dine-with-openai-salesforce-ceo-in-tokyo",
    "timestamp": "2025-10-28T09:33:39Z"
  },
  {
    "title": "Trump Signs Rare-Earths Agreement With Japan; Will Meet With China’s Xi Thursday; Shutdown Latest",
    "description": "LIVE\nTrump Signs Rare-Earths Agreement With Japan; Will Meet With China’s Xi Thursday; Shutdown Latest.\nFollow the latest news from Washington, D.C.\nLast Updated:\nOct. 28, 2025 at 5:20 AM ET\nKey Events\nLatest Updates\nPresident Donald Trump signed an agreement…",
    "link": "https://biztoc.com/x/564f30e89e39284e",
    "timestamp": "2025-10-28T09:30:39Z"
  },
  {
    "title": "Bill Gates helped convince Trump against letting RFK Jr. lead a vaccine and autism task force in 2017, a new book says",
    "description": "Gates, a vaccine proponent, told Trump in 2017 that it \"would be a terrible mistake\" to let RFK Jr. lead a vaccine task force, per a new book.",
    "link": "https://www.businessinsider.com/bill-gates-trump-rfk-jr-vaccine-panel-book-2025-10",
    "timestamp": "2025-10-28T09:30:02Z"
  },
  {
    "title": "There's one key issue on which Dems can effectively hold GOP feet to the fire — now",
    "description": "On Monday, in one of the single most impressive analytical discussions ever to occur on perhaps the most deeply cerebral and politically aware show in US television — The View — the hosts took turns discussing the clear and present danger that lingers wheneve…",
    "link": "https://www.rawstory.com/raw-investigates/trump-third-term/",
    "timestamp": "2025-10-28T09:30:02Z"
  },
  {
    "title": "Here’s What Trump’s Ballroom Donors Want",
    "description": "The price tag on Donald Trump’s garish White House ballroom, now up to $350 million, keeps increasing. That’s because the cost of construction isn’t nearly as important as having an inventory of donations available for corporate America to pony up.\nThe post H…",
    "link": "http://prospect.org/2025/10/28/heres-what-trumps-ballroom-donors-want/",
    "timestamp": "2025-10-28T09:30:00Z"
  },
  {
    "title": "Starmer Says UK Won’t Cave to China Threats Over London Embassy",
    "description": "Prime Minister Keir Starmer insisted he wouldn’t be cowed by pressure to approve a controversial new mega-embassy in London, hitting back at recent threats from Beijing which cast doubt on the UK’s attempts to improve ties.",
    "link": "https://financialpost.com/pmn/business-pmn/starmer-says-uk-wont-cave-to-china-threats-over-london-embassy",
    "timestamp": "2025-10-28T09:28:34Z"
  },
  {
    "title": "Asean Summit wraps with deepening integration, uplifting signs for regional economy",
    "description": "KUALA LUMPUR: The upgraded trade in goods agreement, reciprocal tariff deals with the United States and renewed commitments by dialogue partners such as Australia to pour millions of ringgit in investments into the region and New Zealand to enhance economic p…",
    "link": "https://www.thestar.com.my/news/nation/2025/10/28/asean-summit-wraps-with-deepening-integration-uplifting-signs-for-regional-economy",
    "timestamp": "2025-10-28T09:28:00Z"
  },
  {
    "title": "Russian oil company Lukoil to sell international assets in response to Trump sanctions",
    "description": "FRANKFURT, Germany (AP) — Russian oil major Lukoil says it is selling its international assets in response to sanctions imposed by U.S. President Donald Trump that aim to push Russia to agree to a ceasefire in its war against Ukraine. The company said in a st…",
    "link": "https://financialpost.com/pmn/russian-oil-company-lukoil-to-sell-international-assets-in-response-to-trump-sanctions",
    "timestamp": "2025-10-28T09:25:50Z"
  },
  {
    "title": "Grupo Financiero (GGAL) Climbs 38.7% on Argentine Markets Rally, Milei Win",
    "description": "We recently published 10 Big Names Crushing Wall Street. Grupo Financiero Galicia SA (NASDAQ:GGAL) is one of the top-performing stocks on Monday. Grupo...",
    "link": "https://finance.yahoo.com/news/grupo-financiero-ggal-climbs-38-092503532.html",
    "timestamp": "2025-10-28T09:25:03Z"
  },
  {
    "title": "Banco BBVA (BBAR) Soars 40.7% Amid Argentine Markets Rally",
    "description": "We recently published 10 Big Names Crushing Wall Street. Banco BBVA Argentina SA (NYSE:BBAR) is one of the top-performing stocks on Monday. Banco BBVA...",
    "link": "https://finance.yahoo.com/news/banco-bbva-bbar-soars-40-092455384.html",
    "timestamp": "2025-10-28T09:24:55Z"
  },
  {
    "title": "Trump on Russia's Burevestnik Test: Russia, US Not Playing Games With Each Other",
    "description": "Russia and the United States do not play games with each other, US President Donald Trump said, commenting on the successful testing of Russia's nuclear-powered Burevestnik cruise missile.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251027-sputnik02.htm",
    "timestamp": "2025-10-28T09:24:43Z"
  },
  {
    "title": "Trump says Russia's testing of nuclear-powered missile 'not appropriate'",
    "description": "US President Donald Trump has described Russia's recent testing of its nuclear-powered Burevestnik cruise missile as \"not appropriate,\" echoing Washington's routine attempts to tarnish Moscow's deterrence building efforts, even as he claims to seek a softer a…",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/10/russia-251027-presstv01.htm",
    "timestamp": "2025-10-28T09:24:43Z"
  },
  {
    "title": "IT firms have found a workaround H-1B visa hike. And it's boosting margins.",
    "description": "Five of the country’s 13 large IT solutions providers—Infosys Ltd, HCL Technologies Ltd, Tech Mahindra Ltd, Persistent Systems Ltd, and L&amp;T Technology Services Ltd—have recorded improved operating margins in the September quarter.",
    "link": "https://www.livemint.com/companies/donald-trump-h-1b-visa-fee-hike-indian-it-firms-offshore-strategy-boosts-operating-margins-infosys-hcl-walmart-ltts-11761625895147.html",
    "timestamp": "2025-10-28T09:21:22Z"
  },
  {
    "title": "Putin Receives North Korea's Top Diplomat As Zelenskyy Pushes Long-Range Missile Development",
    "description": "Russian President Vladimir Putin received North Korea's top diplomat at the Kremlin on October 27 as Russian forces continued their push in eastern Ukraine, penetrating a key city amid fierce fighting.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251028-rferl02.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "PBBM raises aggression in WPS before ASEAN meet with Trump",
    "description": "President Ferdinand R. Marcos Jr. raised concerns over China's aggressive activities in the West Philippines Sea before a summit meeting between United States President Donald Trump and leaders of the Association of Southeast Asian Nations (ASEAN) in Kuala Lu…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251027-pna03.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "Chinese FM hopes China, U.S. to create conditions for development of bilateral relations",
    "description": "Chinese Foreign Minister Wang Yi on Monday expressed hopes that China and the United States will work in the same direction to get well poised for high-level interactions and create conditions for the development of bilateral relations.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/10/china-251028-pdo01.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "King Abdullah rejects US plan for international force in Gaza, insists on Palestinian sovereignty",
    "description": "Jordan's King Abdullah II has rejected the idea of countries joining an international force to \"enforce\" peace in Gaza under a plan proposed by US President Donald Trump, insisting that the security of the besieged strip must remain solely in Palestinian hand…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251027-presstv05.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "Russia repels major Ukrainian drone assault on Moscow: Mayor",
    "description": "Russian air defense units successfully foiled a large-scale Ukrainian drone attack on Moscow overnight, neutralizing more than three dozen hostile UAVs aimed at the capital, Mayor Sergei Sobyanin said on Monday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251027-presstv01.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "US Senator Lindsey Graham says land strikes in Venezuela 'real possibility' amid rising tensions",
    "description": "American senator Lindsey Graham has said that land strikes in Venezuela are a \"real possibility\", amid rising tensions over a major US military buildup in the Caribbean, condemned by Caracas as preparation for an invasion.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251027-presstv07.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "Brazil's President Offers Trump Assistance in Resolving Venezuelan Crisis",
    "description": "Brazilian President Luiz Inacio Lula da Silva at a meeting with US President Donald Trump expressed his willingness to mediate a resolution to the tense situation around Venezuela, Brazilian Foreign Minister Mauro Vieira told reporters.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/10/mil-251027-sputnik02.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "China says bombers, fighter jets flew near Taiwan ahead of Trump-Xi meeting",
    "description": "China says several of its fighter jets and strategic bombers flew near Taiwan's airspace, ahead of President Xi Jinping's meeting with his US counterpart, Donald Trump, scheduled on the sidelines of the Asia-Pacific Economic Cooperation (APEC) conference.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251027-presstv01.htm",
    "timestamp": "2025-10-28T09:16:47Z"
  },
  {
    "title": "Trump and Japan’s Takaichi sign two landmark deals",
    "description": "Kathmandu, Oct 28:  US President Donald Trump and Japanese Prime Minister Sanae Takaichi have signed two new agreements. One agreement […]\nThe post Trump and Japan’s Takaichi sign two landmark deals appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/10/28/trump-and-japans-takaichi-sign-two-landmark-deals/",
    "timestamp": "2025-10-28T09:15:00Z"
  },
  {
    "title": "Silver Platinum Palladium Price Rate Today Prediction Analysis and Forecast Explained: Precious metal price forecasts 2025–2026 by major banks - Citi, JP Morgan, HSBC, ANZ, Goldman Sachs",
    "description": "Silver platinum palladium price rate today shows a downward trend as market optimism over the U.S.-China trade deal reduces safe-haven demand. Investors await central bank decisions and interest rate updates. Analysts revise short-term metal forecasts amid gl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/silver-platinum-palladium-price-rate-today-prediction-analysis-and-forecast-explained-precious-metal-price-forecasts-20252026-by-major-banks-citi-jp-morgan-hsbc-anz-goldman-sachs-bank-of-america-standard-charteredcommerzbank-deutsche-bank-spot-silver-global-trade-shifts-interest-rate-trends/articleshow/124869126.cms",
    "timestamp": "2025-10-28T09:14:57Z"
  },
  {
    "title": "Trump says missiles for Japan’s F-35s will arrive ‘this week’ during visit to USS George Washington",
    "description": "Trump announces F-35 missiles for Japan arriving 'this week' during USS George Washington visit, signaling accelerated U.S. defense deliveries to Tokyo.",
    "link": "https://www.foxnews.com/world/trump-says-missiles-japans-f-35s-arrive-this-week-during-visit-uss-george-washington",
    "timestamp": "2025-10-28T09:09:10Z"
  },
  {
    "title": "Trump in Japan; UnitedHealth to report; gold drops - what’s moving marke",
    "description": "Gold prices slip further below $4,000/oz amid easing trade tensions\nInvesting.com - U.S. stock futures are subdued as a busy week filled with big-name earnings reports, central bank interest rate decisions, and high-level trade negotiations picks up the pace.…",
    "link": "https://biztoc.com/x/dcdb146654729873",
    "timestamp": "2025-10-28T09:08:43Z"
  },
  {
    "title": "Japan welcomed Trump by turning the grounds of a palace into a car show featuring a Ford F-150 pickup truck",
    "description": "A Ford-150 pickup greeted Trump during his visit to Japan's Akasaka Palace for his meeting with the country's prime minister.\nAP Photo/Mayuko Ono\nJapan had a Ford F-150 pickup truck on display near their summit venue with President Donald Trump.\nTrump met wit…",
    "link": "https://biztoc.com/x/fe45e3b810c45036",
    "timestamp": "2025-10-28T09:08:11Z"
  },
  {
    "title": "Republicans send Biden autopen report to the Justice Department, urging further investigation",
    "description": "House Republicans on Tuesday unveiled their long-promised report on former President Joe Biden’s use of the autopen, delivering a blistering critique of his ...",
    "link": "https://www.yahoo.com/news/articles/republicans-send-biden-autopen-report-090750341.html",
    "timestamp": "2025-10-28T09:07:50Z"
  },
  {
    "title": "Japan heavyweights including SoftBank eye role in $550 billion US investment package",
    "description": "TOKYO :Around 20 companies from Japan and the U.S. have expressed interest in projects that could contribute to Tokyo's commitment to invest $550 billion in the United States as part of a trade agreement, a factsheet by the two countries showed on Tuesday. U.…",
    "link": "https://www.channelnewsasia.com/business/japan-heavyweights-including-softbank-eye-role-in-550-billion-us-investment-package-5429491",
    "timestamp": "2025-10-28T09:06:36Z"
  },
  {
    "title": "MSNBC host claims she doesn't believe any Democrat has called Trump Hitler",
    "description": "Nicolle Wallace states she doesn't believe any Democrat has called Trump Hitler, contradicting the record of prominent Democratic lawmakers making such comparisons.",
    "link": "https://www.foxnews.com/media/msnbc-host-claims-she-doesnt-believe-any-democrat-has-called-trump-hitler",
    "timestamp": "2025-10-28T09:00:51Z"
  },
  {
    "title": "MORNING GLORY: Which way Gotham?",
    "description": "Can rookie politician Zohran Mamdani manage NYC's 300,000 employees? Early voting turnout suggests voters weigh experience vs. change in mayoral election.",
    "link": "https://www.foxnews.com/opinion/morning-glory-which-way-gotham",
    "timestamp": "2025-10-28T09:00:49Z"
  },
  {
    "title": "Comer unleashes on Biden, demands DOJ probe of autopen use in scathing new report",
    "description": "The House Oversight Committee released a 100-page report detailing its investigation into former President Joe Biden's use of autopen.",
    "link": "https://www.foxnews.com/politics/comer-unleashes-biden-demands-doj-probe-autopen-use-scathing-new-report",
    "timestamp": "2025-10-28T09:00:36Z"
  },
  {
    "title": "The Final Leg of New York’s Mayoral Race Has Gotten Ugly",
    "description": "The last days have been marked by bigotry, bitterness, and broken friendships, writes columnist Errol Louis.",
    "link": "http://nymag.com/intelligencer/article/cuomo-sliwa-zohran-mamdani-nyc-mayor-ugly-finish.html",
    "timestamp": "2025-10-28T09:00:19Z"
  },
  {
    "title": "The Tried And Tested GOP Playbook Doesn’t Seem To Be Working In A Crucial State",
    "description": "Republican's anti-trans rhetoric worked in 2021, but the strategy appears to be falling flat just four years later.",
    "link": "https://www.huffpost.com/entry/virginia-election-culture-wars-gop_n_68ffc717e4b0049ce5fe6274",
    "timestamp": "2025-10-28T09:00:17Z"
  },
  {
    "title": "GOP-led Oversight Committee says Biden pardons signed by autopen are ‘void’ in final report | CNN Politics",
    "description": "Former President Joe Biden experienced such “cognitive decline” while in office that it remains a serious question as to whether he was aware of the substance of the various pardons and commutations signed in his name via autopen, the House Oversight Committe…",
    "link": "https://www.cnn.com/2025/10/28/politics/biden-autopen-investigation-house-oversight-final-report",
    "timestamp": "2025-10-28T09:00:01Z"
  },
  {
    "title": "Biden actions were ‘not all his own’ after health cover-up, bombshell House GOP report finds",
    "description": "The House Oversight Committee found that the 46th president's executive orders signed by autopen should be considered null and void if they bore \"approval traceable to the president's own consent.\"",
    "link": "https://nypost.com/2025/10/28/us-news/biden-actions-were-not-all-his-own-after-health-cover-up-bombshell-house-gop-report-finds/",
    "timestamp": "2025-10-28T09:00:00Z"
  },
  {
    "title": "Trump’s Angry, Crazed Eruption over Cognitive Test Backfires on Itself",
    "description": "On Air Force One, President Donald Trump unleashed a bizarre, angry, rambling rant about the cognitive test he supposedly aced this weekend. Worse, he compared himself cognitively to two Democrats who both happen to be nonwhite women. This rant backfired on i…",
    "link": "https://newrepublic.com/article/202326/trump-angry-crazed-eruption-cognitive-test-exposes-decline",
    "timestamp": "2025-10-28T09:00:00Z"
  },
  {
    "title": "The 9 at 9: Tuesday",
    "description": "Here’s all the news to know as you start your day.",
    "link": "https://www.thejournal.ie/9-at-9-28-10-25-6857923-Oct2025/",
    "timestamp": "2025-10-28T09:00:00Z"
  },
  {
    "title": "Biden White House doctor Kevin O’Connor referred for investigation of ex-prez health cover-up — could lose license",
    "description": "\"Based on the nature and extent of Dr. O'Connor's actions, the Committee recommends that the Board of Medicine impose discipline, sanction, or revocation of his medical license,\" Rep. James Comer (R-Ky.) wrote.",
    "link": "https://nypost.com/2025/10/28/us-news/biden-white-house-doctor-kevin-oconnor-referred-for-investigation-of-ex-prez-health-cover-up-could-lose-license/",
    "timestamp": "2025-10-28T09:00:00Z"
  },
  {
    "title": "Many Fear Federal Loan Caps Will Deter Aspiring Doctors and Worsen MD Shortage",
    "description": "Health care professionals fear that new caps on federal student lending, set to start in July, will put medical school out of reach for many who want to become doctors and exacerbate physician shortages. Others say unlimited federal lending has fed a rise in …",
    "link": "https://kffhealthnews.org/news/article/medical-school-federal-loan-caps-doctor-shortage-trump-law/",
    "timestamp": "2025-10-28T09:00:00Z"
  },
  {
    "title": "‘We’re the Resistance’",
    "description": "Rossana Pérez arrived in Los Angeles as a refugee more than 40 years ago. Now, the professor, writer, and activist reflects on how to cope with the terror and trauma of ICE raids in her city.\nThe post ‘We’re the Resistance’ appeared first on The American Pros…",
    "link": "http://prospect.org/2025/10/28/were-the-resistance-ice-raids-los-angeles/",
    "timestamp": "2025-10-28T09:00:00Z"
  },
  {
    "title": "US Vice President JD Vance to visit Kenya after attending G20 summit in South Africa",
    "description": "US Vice President JD Vance is set to visit Kenya from November 24 to 27 following his attendance at the G20 Summit in Johannesburg, South Africa. The trip underscores Washington’s ongoing diplomatic engagement with Kenya, a key non-NATO ally, amid discussions…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-vice-president-jd-vance-to-visit-kenya-after-attending-g20-summit-in-south-africa/articleshow/124869313.cms",
    "timestamp": "2025-10-28T08:59:43Z"
  },
  {
    "title": "Japan welcomed Trump by turning the grounds of a palace into a car show featuring a Ford F-150 pickup truck",
    "description": "Trump said Japan's plan to buy a fleet of Ford F-150 pickup trucks showed Japanese Prime Minister Sanae Takaichi has \"good taste.\"",
    "link": "https://www.businessinsider.com/japan-welcome-trump-car-show-ford-f150-pickup-2025-10",
    "timestamp": "2025-10-28T08:56:49Z"
  },
  {
    "title": "Shipping emissions levy shelved as countries bow to US pressure",
    "description": "A long-planned charge on greenhouse gas emissions has been postponed as Trump officials stand accused of intimidation tactics.",
    "link": "https://www.nationalobserver.com/2025/10/28/news/shipping-emissions-levy-us-bullying",
    "timestamp": "2025-10-28T08:55:24Z"
  },
  {
    "title": "Stock Rally Stalls Ahead of Big-Tech Earnings, Fed: Markets Wrap",
    "description": "The record-breaking stocks rally faltered as investors parsed a flurry of corporate earnings, while awaiting results from US megacap technology companies as well as a Federal Reserve policy decision.",
    "link": "https://financialpost.com/pmn/business-pmn/stock-rally-stalls-ahead-of-big-tech-earnings-fed-markets-wrap",
    "timestamp": "2025-10-28T08:48:10Z"
  },
  {
    "title": "Trump praises Japan's new prime minister during visit",
    "description": "President Trump began one of his busiest days of his Asia trip on Tuesday by greeting the new Japanese prime minister, and taking her with him as he spoke to U.S. troops aboard an aircraft carrier.",
    "link": "https://www.npr.org/2025/10/28/g-s1-95314/trump-japan-visit",
    "timestamp": "2025-10-28T08:47:29Z"
  },
  {
    "title": "Oil falls as OPEC+ output plans offset US-China trade optimism",
    "description": "Oil prices fell on Tuesday, marking their third day of declines as an OPEC+ plan to raise output outweighed optimism about a potential U.S.-China trade deal.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-falls-as-opec-output-plans-offset-us-china-trade-optimism/articleshow/124869057.cms",
    "timestamp": "2025-10-28T08:42:30Z"
  },
  {
    "title": "Ex-Obama Photographer Dogs Trump With Beloved Image Of Now-Demolished East Wing",
    "description": "Pete Souza slammed the current president as a \"wannabe king.\"",
    "link": "https://www.huffpost.com/entry/pete-souza-donald-trump-ballroom_n_69006945e4b0973a4c053f1e",
    "timestamp": "2025-10-28T08:36:34Z"
  },
  {
    "title": "Zelensky says needs European support for two to three more years of fighting",
    "description": "President Volodymyr Zelensky has said that Ukraine needs European financial support to continue fighting the invading Russian forces for another two or three years.",
    "link": "https://www.hurriyetdailynews.com/zelensky-says-needs-european-support-for-two-to-three-more-years-of-fighting-215111",
    "timestamp": "2025-10-28T08:35:30Z"
  },
  {
    "title": "Gold price rate today, prediction, analysis, forecast for 2025, 2026: Gold crashes to three-week low. Here's why, 11 major analysts’ projections, spot gold, gold futures price, market outlook",
    "description": "Gold price rate today, prediction, analysis, forecast for 2025, 2026 is here. Gold prices dropped to a near three-week low as hopes for a U.S.-China trade deal reduced safe-haven demand. Investors await policy decisions from the U.S. Federal Reserve, European…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-rate-today-prediction-analysis-forecast-gold-crashes-to-three-week-low-heres-why-11-major-analysts-projections-spot-gold-gold-futures-price-market-outlook-citi-jp-morgan-hsbc-anz-bank-of-america-standard-chartered-goldman-sachs-commerzbank-deutsche-bank-ubs/articleshow/124868705.cms",
    "timestamp": "2025-10-28T08:34:55Z"
  },
  {
    "title": "Brazil’s ex-president Bolsonaro appeals 27-year sentence for attempted coup",
    "description": "The sentence handed to the far-right politician last month has become a major issue in Brazil-US relations.",
    "link": "https://www.aljazeera.com/news/2025/10/28/brazils-ex-president-bolsonaro-appeals-27-year-sentence-for-attempted-coup",
    "timestamp": "2025-10-28T08:33:49Z"
  },
  {
    "title": "Cambodian prisoners of war to undergo health check-ups as release process begins",
    "description": "KUALA LUMPUR: Cambodian prisoners of war will undergo a thorough health check-up as part of their release, says Thailand's deputy spokesperson for the Foreign Ministry, Maratee Andamo. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/28/cambodian-prisoners-of-war-to-undergo-health-check-ups-as-release-process-begins",
    "timestamp": "2025-10-28T08:33:00Z"
  },
  {
    "title": "Man pleads guilty to murdering former Japanese prime minister Shinzo Abe",
    "description": "A man accused of fatally shooting former Prime Minister Shinzo Abe admitted to murder on Tuesday in the first hearing of the case, media said, three years after the assassination of Japan's longest-serving premier stunned the nation.",
    "link": "https://www.independent.ie/world-news/man-pleads-guilty-to-murdering-former-japanese-prime-minister-shinzo-abe/a1808059967.html",
    "timestamp": "2025-10-28T08:32:40Z"
  },
  {
    "title": "Saudi hosts world's business elite with eyes on gigaprojects, AI",
    "description": "Saudi Arabia launched its Future Investment Initiative in Riyadh, drawing global leaders and business elites to boost its gigaprojects and AI ambitions. The conference highlights foreign investment growth, upcoming tech deals, and economic diversification eff…",
    "link": "https://economictimes.indiatimes.com/tech/technology/saudi-hosts-worlds-business-elite-with-eyes-on-gigaprojects-ai/articleshow/124868770.cms",
    "timestamp": "2025-10-28T08:28:06Z"
  },
  {
    "title": "Japan Cites Specific Projects for $550 Billion US Investment",
    "description": "Japan unveiled a list of potential projects for its $550 billion US investment vehicle, providing a first look into what specific proposals could be funded by the mechanism that’s a key part of the two countries’ trade deal.",
    "link": "https://financialpost.com/pmn/business-pmn/japan-cites-specific-projects-for-550-billion-us-investment",
    "timestamp": "2025-10-28T08:27:35Z"
  },
  {
    "title": "World far off track to meeting climate goals, U.N. warns",
    "description": "U.N. Secretary-General Antonio Guterres warned that slow action from nations meant it was \"inevitable\" efforts to limit temperature rise to 1.5 degrees Celsius would fail.",
    "link": "https://www.japantimes.co.jp/environment/2025/10/28/climate-change/climate-goals-off-track/",
    "timestamp": "2025-10-28T08:26:00Z"
  },
  {
    "title": "Trump bulldozes top donor's family legacy in vulgar White House demolition",
    "description": "Rachel Maddow shares reporting from the New York Times that billionaire Timothy Mellon, a top donor to Donald Trump's ...",
    "link": "https://biztoc.com/x/e390b9ef10fae066",
    "timestamp": "2025-10-28T08:20:01Z"
  },
  {
    "title": "Karnataka CM Siddaramaiah confers 'Pride of India Award’ on motivational speaker Munawar Zama",
    "description": "Motivational speaker Munawar Zama, founder of English House Academy, received the 'Pride of India Award' from Karnataka CM Siddaramaiah for his contributions to youth empowerment. Zama's workshops have transformed over 3.5 lakh lives, guiding individuals towa…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/karnataka-cm-siddaramaiah-confers-pride-of-india-award-on-motivational-speaker-munawar-zama/articleshow/124868624.cms",
    "timestamp": "2025-10-28T08:19:32Z"
  },
  {
    "title": "The family’s black sheep has fired off another presidential insult.",
    "description": "Black sheep niece Mary Trump trolled her estranged uncle over his health boasts and the meaning of his tests. Mary, the daughter of Donald’s older brother...",
    "link": "https://www.thedailybeast.com/trumps-niece-mary-slams-moron-uncle-donald-over-cognitive-test-results/",
    "timestamp": "2025-10-28T08:17:28Z"
  },
  {
    "title": "Peace talks hosted by Turkey between Pakistan and Afghanistan hit impasse in Istanbul",
    "description": "Peace talks between Pakistan and Afghanistan have hit an impasse in Istanbul after three days of negotiations, according to state media in both countries",
    "link": "https://abcnews.go.com/International/wireStory/peace-talks-hosted-turkey-pakistan-afghanistan-hit-impasse-126926052",
    "timestamp": "2025-10-28T08:13:31Z"
  },
  {
    "title": "Peace talks hosted by Turkey between Pakistan and Afghanistan hit impasse in Istanbul",
    "description": "Peace talks between Pakistan and Afghanistan have stalled in Istanbul. Both nations are blaming each other for the deadlock. Efforts are underway to resolve the impasse. Tensions have been high over cross-border attacks and militant safe havens. The future of…",
    "link": "https://economictimes.indiatimes.com/news/defence/peace-talks-hosted-by-turkey-between-pakistan-and-afghanistan-hit-impasse-in-istanbul/articleshow/124868494.cms",
    "timestamp": "2025-10-28T08:11:54Z"
  },
  {
    "title": "US-Japan summit signs rare earths deal and promises golden age alliance",
    "description": "On the morning of October 28, 2025, Japanese Prime Minister Sanae Takaichi and US President Donald Trump signed two important agreements during their meeting at the Akasaka Palace in Tokyo. According to Nikkei and Jiji Press, given the deteriorating security …",
    "link": "https://www.digitimes.com/news/a20251028PD238/alliance-donald-trump-nikkei-policy-security.html",
    "timestamp": "2025-10-28T08:11:21Z"
  },
  {
    "title": "Oil falls as OPEC+ output plans offset US-China trade optimism",
    "description": "By Ashitha Shivaprasad and Sam Li (Reuters) -Oil prices fell on Tuesday, marking their third day of declines as an OPEC+ plan to raise output outweighed...",
    "link": "https://finance.yahoo.com/news/oil-falls-opec-output-plans-080702485.html",
    "timestamp": "2025-10-28T08:07:02Z"
  },
  {
    "title": "Report: Hamas Stages Fake Hostage Body Recovery, Returns Wrong Remains",
    "description": "Hamas staged a fake recovery of a hostage's body in the Gaza Strip, according to Israeli soldiers who observed the event; and also returned a coffin to Israel Monday that contained more remains of a previously recovered hostage.\nThe post Report: Hamas Stages …",
    "link": "https://www.breitbart.com/middle-east/2025/10/28/report-hamas-stages-fake-hostage-body-recovery-returns-fake-remains/",
    "timestamp": "2025-10-28T08:06:18Z"
  },
  {
    "title": "Shohei Ohtani becomes the only player in MLB postseason history to be intentionally walked four times in a single game",
    "description": "Shohei Ohtani's historic Game 3 performance saw him become the first player intentionally walked four times in a postseason game. He also set records for multi-home run games and total bases in a single postseason. His dominance forced the Blue Jays into unpr…",
    "link": "https://timesofindia.indiatimes.com/sports/mlb/news/shohei-ohtani-becomes-the-only-player-in-mlb-postseason-history-to-be-intentionally-walked-four-times-in-a-single-game/articleshow/124868412.cms",
    "timestamp": "2025-10-28T08:06:02Z"
  },
  {
    "title": "Lukoil to sell overseas assets after US sanctions tighten grip on Russia's oil industry",
    "description": "Lukoil will sell its overseas assets due to new US sanctions, initiating the bidding process under a wind-down license. The sanctions target Russian oil firms, particularly Lokoil and Rosneft, aiming to pressure Russia amid its ongoing conflict with Ukraine.",
    "link": "https://www.livemint.com/companies/news/lukoil-to-sell-overseas-assets-after-us-sanctions-tighten-grip-on-russias-oil-industry-11761633342682.html",
    "timestamp": "2025-10-28T08:03:30Z"
  },
  {
    "title": "Trump: Toyota to build $10B worth of auto plants in US",
    "description": "United States President Donald Trump said on Tuesday that he was informed by Japanese Prime Minister Sanae Takaichi that Toyota plans to build auto factories across the US worth around $10 billion in ...",
    "link": "https://biztoc.com/x/112c40c037ce8757",
    "timestamp": "2025-10-28T08:02:02Z"
  },
  {
    "title": "The Fed is expected to cut rates this week — even while the government is shut down",
    "description": "The government shutdown means the latest job numbers haven't been released, but the Fed is still likely to cut.",
    "link": "https://www.businessinsider.com/what-likely-october-rate-cut-means-for-your-wallet-2025-10",
    "timestamp": "2025-10-28T08:02:01Z"
  },
  {
    "title": "Trump welcomes Japan prime minister’s promise to accelerate military build-up",
    "description": "USA- TRUMP/JAPAN (UPDATE 5, PIX, TV, GRAPHIC):UPDATE 5-Trump praises Japan's 'great' female leader in talks on trade, critical minerals",
    "link": "https://www.irishtimes.com/world/asia-pacific/2025/10/28/trump-welcomes-japan-prime-ministers-promise-to-accelerate-military-build-up/",
    "timestamp": "2025-10-28T08:00:31Z"
  },
  {
    "title": "The 8 at 8: Tuesday",
    "description": "Here’s all the news to know as you start your day.",
    "link": "https://www.thejournal.ie/8-at-8-28-10-25-6857923-Oct2025/",
    "timestamp": "2025-10-28T08:00:16Z"
  },
  {
    "title": "Trade deal or no trade deal, China still holds crucial minerals leverage over U.S.",
    "description": "China still has substantial leverage over the U.S. in its dominance of the rare earth minerals market, despite the two countries agreeing to a framework trade deal days before a meeting between U.S. President Donald Trump and Chinese President Xi Jinping.",
    "link": "https://www.cbc.ca/news/world/trump-xi-us-china-apec-meeting-9.6955385",
    "timestamp": "2025-10-28T08:00:00Z"
  },
  {
    "title": "Which industry in Alberta is most threatened by tariffs?",
    "description": "As tariffs make an impact, Canadian industries are finding themselves competing for priority in trade negotiations. Here are the industries under threat in each province.",
    "link": "https://www.cbc.ca/news/politics/tariffs-industries-canadian-provinces-9.6950272",
    "timestamp": "2025-10-28T08:00:00Z"
  },
  {
    "title": "World far off track to meet climate goals: UN",
    "description": "The UN estimated Tuesday that nations' carbon-cutting pledges imply a far-from-sufficient 10-percent emissions cut by 2035, cautioning that it was unable to provide a robust global overview after most countries failed to submit their plans on time. The estima…",
    "link": "https://timesofindia.indiatimes.com/home/environment/global-warming/world-far-off-track-to-meet-climate-goals-un/articleshow/124868141.cms",
    "timestamp": "2025-10-28T07:56:47Z"
  },
  {
    "title": "World far off track to meet climate goals: UN",
    "description": "The UN estimated Tuesday that nations' carbon-cutting pledges imply a far-from-sufficient 10-percent emissions cut by 2035, cautioning that it was unable to provide a robust global overview after most countries failed to submit their plans on time. The estima…",
    "link": "https://economictimes.indiatimes.com/news/environment/global-warming/world-far-off-track-to-meet-climate-goals-un/articleshow/124868141.cms",
    "timestamp": "2025-10-28T07:51:44Z"
  },
  {
    "title": "Japan Planning to Nominate Trump for Nobel Prize: White House",
    "description": "Japan's Prime Minister Sanae Takaichi has said she was \"so impressed and inspired\" by President Donald Trump.",
    "link": "https://biztoc.com/x/5233086a13877197",
    "timestamp": "2025-10-28T07:50:40Z"
  },
  {
    "title": "'Too Old?': Stephen Colbert Has A Biting Reality Check About 'Low Battery' Trump",
    "description": "'Too Old?': Stephen Colbert Has A Biting Reality Check About 'Low Battery' Trumphuffpost.com",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-dance-moves_n_690060efe4b0ebfddfbb996e",
    "timestamp": "2025-10-28T07:48:50Z"
  },
  {
    "title": "Christopher Luxon expected to attend dinner in South Korea alongside US President Donald Trump",
    "description": "Luxon and Trump are yet to meet in person.",
    "link": "https://www.nzherald.co.nz/nz/politics/christopher-luxon-expected-to-attend-dinner-in-south-korea-alongside-us-president-donald-trump/XJLXR6FFY5CXXLJ66SFC74TIQE/",
    "timestamp": "2025-10-28T07:47:31Z"
  },
  {
    "title": "Primark seizes US opportunity as Trump hits online rivals",
    "description": "Primark is accelerating its US store openings and ramping up marketing, betting that President Donald Trump's move to scrap a duty exemption on e-commerce parcels will drive budget-conscious shoppers away from online rivals and back to stores.",
    "link": "https://www.rte.ie/news/business/2025/1028/1540858-primark-eyes-us-expansion/",
    "timestamp": "2025-10-28T07:45:39Z"
  },
  {
    "title": "Gold prices at 2-week low amid easing US-China tensions, Fed policy caution. Is this a dip to buy or a warning sign?",
    "description": "Gold fell below $4,000/oz, hitting a two-week low as easing US-China trade tensions and caution ahead of the Fed policy decision dampened safe-haven demand. December futures settled at $4,019.70, down 2.85%, while silver dropped 3.73% to $46.77, breaching key…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-prices-at-2-week-low-amid-easing-us-china-tensions-fed-policy-caution-is-this-a-dip-to-buy-or-a-warning-sign/articleshow/124868000.cms",
    "timestamp": "2025-10-28T07:45:24Z"
  },
  {
    "title": "Saurabh Mukherjea's Global Compounders Fund delivers 27% CAGR in 3 years",
    "description": "Marcellus Investment Managers’ Global Compounders Portfolio, launched from its GIFT City hub three years ago, has crossed Rs 300 crore in AUM across its PMS, AIF, and advisory platforms. The fund, which invests in top global companies across North America, Eu…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/saurabh-mukherjeas-global-compounders-fund-delivers-27-cagr-in-3-years/articleshow/124867976.cms",
    "timestamp": "2025-10-28T07:44:40Z"
  },
  {
    "title": "Venezuela suspends Trinidad and Tobago gas accord over US warship visit",
    "description": "Caracas asserts that US actions in the Caribbean are a military threat and are meant to steal its oil and gas wealth.",
    "link": "https://www.aljazeera.com/news/2025/10/28/venezuela-suspends-trinidad-and-tobago-gas-accord-over-us-warship-visit",
    "timestamp": "2025-10-28T07:43:20Z"
  },
  {
    "title": "Renault confirms Duster’s India return: Debut set on this date!",
    "description": "In terms of design, the next-gen Duster looks completely new and doesn’t look like it’s an evolution from the previous generation. The SUV takes inspiration from the Bigster concept. At the front, it gets a sleek LED headlight setup with Y-shaped LED DRLs and…",
    "link": "https://timesofindia.indiatimes.com/auto/cars/renault-confirms-dusters-india-return-debut-set-on-this-date/articleshow/124866973.cms",
    "timestamp": "2025-10-28T07:41:10Z"
  },
  {
    "title": "Trump: Japan to get first batch of missiles this week",
    "description": "United States President Donald Trump announced on Tuesday that his country will deliver the first batch of missiles this week, \"ahead of schedule.\"Speaking to the troops at USS George Washington in Ja...",
    "link": "https://biztoc.com/x/6c78ecb9f3632647",
    "timestamp": "2025-10-28T07:40:10Z"
  }
]