[
  {
    "title": "More artists pull out of Kennedy Center shows following name change",
    "description": "The Kennedy Center has been hit with a string of abrupt cancellations in the wake of its board of trustees’ adding President Donald Trump’s name to the landmark performing arts",
    "link": "https://www.wxow.com/news/entertainment/more-artists-pull-out-of-kennedy-center-shows-following-name-change/article_6b123766-68cd-5831-8d22-8bb88d959fca.html",
    "timestamp": "2025-12-30T21:38:37Z"
  },
  {
    "title": "Fed meeting minutes reveal deep splits on December rate cut decision",
    "description": "The minutes released Tuesday indicate that some Fed officials who supported the rate cut had reservations.",
    "link": "https://www.cbsnews.com/news/december-interest-rate-cut-fed-minutes/",
    "timestamp": "2025-12-30T21:37:24Z"
  },
  {
    "title": "Michigan to get $173M in federal funds to ‘strengthen rural health’",
    "description": "The state’s funding is part of a $50 billion “Rural Health Transformation Program,” which was created as part of President Donald Trump’s One Big Beautiful Bill.",
    "link": "https://www.mlive.com/politics/2025/12/michigan-to-get-173m-in-federal-funds-to-strengthen-rural-health.html",
    "timestamp": "2025-12-30T21:35:17Z"
  },
  {
    "title": "Nearly 25 Islamic State fighters killed or captured in Syria, US military says",
    "description": "U.S. Central Command said 11 missions were carried out over the past 10 days.",
    "link": "https://www.denverpost.com/2025/12/30/us-syria-islamic-state/",
    "timestamp": "2025-12-30T21:33:09Z"
  },
  {
    "title": "Nearly 25 Islamic State fighters killed or captured in Syria, US military says",
    "description": "U.S. Central Command said 11 missions were carried out over the past 10 days.",
    "link": "https://www.bostonherald.com/2025/12/30/us-syria-islamic-state/",
    "timestamp": "2025-12-30T21:33:09Z"
  },
  {
    "title": "Iran's President Says Answer To Attack Would Be Harsh In Apparent Response To Trump Warning",
    "description": "Iranian President Masoud Pezeshkian has warned of a harsh response to any attack on his country.",
    "link": "https://www.huffpost.com/entry/iran-president-trump-threat_n_695443d1e4b032c4e8a8935c",
    "timestamp": "2025-12-30T21:31:57Z"
  },
  {
    "title": "‘Deport Nicki Minaj To Trinidad’ Petition Blows Up With Over 60,000 Signatures",
    "description": "Nicki Minaj has found herself at the center of controversy in recent weeks. Her alignment with President Donald Trump and Vice President JD Vance has left a sour taste in the mouths of many fans. The situation escalated further after the Beez In The Trap rapp…",
    "link": "https://hiphopwired.com/playlist/deport-nicki-minaj-petition/",
    "timestamp": "2025-12-30T21:30:16Z"
  },
  {
    "title": "Stroke survivor can't access benefits as Social Security engulfed in 'turmoil' under Trump",
    "description": "An in-depth report published by the Washington Post on Tuesday offers new details about the damage being done to the Social Security Administration during President Donald Trump’s second term.The Post, citing both internal documents and interviews with inside…",
    "link": "https://www.rawstory.com/social-security-2674838126/",
    "timestamp": "2025-12-30T21:28:38Z"
  },
  {
    "title": "Ric Grenell Offers Shocking Explanation Why Artists May Be Bailing on Their Trump-Kennedy Center Gigs",
    "description": "President Trump's name being added to The Kennedy Center has really upended the world of performing arts in the Nation's...",
    "link": "https://redstate.com/terichristoph/2025/12/30/artists-are-cancelling-their-kennedy-center-gigs-and-ric-grenell-says-he-knows-why-n2197615",
    "timestamp": "2025-12-30T21:24:22Z"
  },
  {
    "title": "Emmer on Reports of Minnesota Fraud: ‘Revoke Their Citizenship’",
    "description": "House Majority Whip Tom Emmer, one of Washington’s top-ranking Republicans, called for the denaturalization and deportation of Somalis in Minnesota who defrauded taxpayers. “I have... Read More\nThe post Emmer on Reports of Minnesota Fraud: ‘Revoke Their Citiz…",
    "link": "https://www.dailysignal.com/2025/12/30/emmer-on-reports-of-minnesota-fraud-revoke-their-citizenship/",
    "timestamp": "2025-12-30T21:23:54Z"
  },
  {
    "title": "Trump DOJ Sues State Giving Illegal Immigrants Massive In-State Tuition Breaks",
    "description": "DAILY CALLER NEWS FOUNDATION—The Department of Justice (DOJ) has filed a lawsuit accusing Virginia of unlawfully granting illegal aliens in-state resident discounts on college tuition.... Read More\nThe post Trump DOJ Sues State Giving Illegal Immigrants Massi…",
    "link": "https://www.dailysignal.com/2025/12/30/doj-sues-virginia-for-giving-illegal-immigrants-in-state-tuition/",
    "timestamp": "2025-12-30T21:23:53Z"
  },
  {
    "title": "India-Pakistan tensions among hotspot issues ‘mediated’ by China: Wang Yi",
    "description": "China’s claim of having “mediated” tensions between India and Pakistan has been firmly rejected by New Delhi, which reiterated that the May 7–10 Operation Sindoor conflict was resolved through direct talks between the two countries’ DGMOs",
    "link": "https://www.thehindubusinessline.com/news/world/india-pakistan-tensions-among-hotspot-issues-mediated-by-china-wang-yi/article70454726.ece",
    "timestamp": "2025-12-30T21:21:30Z"
  },
  {
    "title": "DOGE Cuts and Borked Code Delay Important Energy Report",
    "description": "The ghost of Elon continues to haunt the federal government.",
    "link": "https://gizmodo.com/doge-cuts-and-borked-code-delay-important-energy-report-2000704413",
    "timestamp": "2025-12-30T21:20:59Z"
  },
  {
    "title": "Steve Bannon promises ‘Irish Trump’ and says he is working to form ‘national party’ in Ireland",
    "description": "Former White House strategist says he is ‘behind the scenes on the Irish situation’",
    "link": "https://www.irishtimes.com/politics/2025/12/30/steve-bannon-promises-irish-trump-and-says-he-is-working-to-form-national-party-in-ireland/",
    "timestamp": "2025-12-30T21:19:51Z"
  },
  {
    "title": "Floyd Mayweather Could Lose Las Vegas Strip Club Over $52k In Unpaid Property Taxes Amid Reports That He’s Millions Of Dollars In Debt",
    "description": "Floyd Mayweather might not have as much money as he claims he has. On social media, Mayweather loves to flaunt his money and luxurious lifestyle by posing with money everywhere he goes. Just a few weeks ago, the boxer went viral when he was seen counting mone…",
    "link": "https://brobible.com/sports/article/floyd-mayweather-las-vegas-strip-club/",
    "timestamp": "2025-12-30T21:18:41Z"
  },
  {
    "title": "As Towns and Cities Fight Off Data Centers, Calls Grow for a National Moratorium",
    "description": "The battle to build new data centers has pitted communities across the country against Silicon Valley.",
    "link": "https://truthout.org/articles/as-towns-and-cities-fight-off-data-centers-calls-grow-for-a-national-moratorium/",
    "timestamp": "2025-12-30T21:17:42Z"
  },
  {
    "title": "Judge Says Trump Can’t Strip Lawyer’s Security Clearance Just Because He Doesn’t Like His Clients",
    "description": "Donald Trump has an enemies list. Not a secret one, either. Its actually been published at the official White House website. But he has plenty of enemies beyond that. And ever since his return to office, hes been engaged in acts of vengeance. Federal agencies…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180488459",
    "timestamp": "2025-12-30T21:12:05Z"
  },
  {
    "title": "Ohio lawmakers introduce bill to rename highway section after President Trump",
    "description": "Two Ohio state lawmakers have introduced a bill to rename a section of Interstate-70 after President Donald Trump.",
    "link": "https://www.wlwt.com/article/ohio-donald-trump-president-franklin-county-interstate/69889306",
    "timestamp": "2025-12-30T21:09:32Z"
  },
  {
    "title": "China's top diplomat criticizes U.S. arms sale to Taiwan",
    "description": "The military package announced earlier this month by the U.S. State Department amounts to the largest U.S. arms sale to Taiwan and is valued at more than $11 billion. China responded to the sale by launching two days of military drills around Taiwan on Monday.",
    "link": "https://www.pbs.org/newshour/world/chinas-top-diplomat-criticizes-u-s-arms-sale-to-taiwan",
    "timestamp": "2025-12-30T21:08:18Z"
  },
  {
    "title": "Pentagon Announces $8.6B Contract for Boeing to Make F-15s for Israel",
    "description": "The contract will provide Israel with 25 F-15 fighter jets, with the option for 25 more.",
    "link": "https://truthout.org/articles/pentagon-announces-8-6b-contract-for-boeing-to-make-f-15s-for-israel/",
    "timestamp": "2025-12-30T21:08:15Z"
  },
  {
    "title": "Judge Says Trump Can’t Strip Lawyer’s Security Clearance Just Because He Doesn’t Like His Clients",
    "description": "Donald Trump has an enemies list. Not a secret one, either. It’s actually been published at the official White House website. But he has plenty of enemies beyond that. And ever since his return to office, he’s been engaged in acts of vengeance. Federal agenci…",
    "link": "https://www.techdirt.com/2025/12/30/judge-says-trump-cant-strip-lawyers-security-clearance-just-because-he-doesnt-like-his-clients/",
    "timestamp": "2025-12-30T21:07:30Z"
  },
  {
    "title": "George Clooney takes aim at Trump, says he was 'a big goofball’ before politics",
    "description": "George Clooney reveals he knew Donald Trump \"very well\" before fame changed everything. The actor describes their past friendship and Trump's transformation.",
    "link": "https://www.foxnews.com/entertainment/george-clooney-takes-aim-trump-says-he-a-big-goofball-before-politics",
    "timestamp": "2025-12-30T21:06:47Z"
  },
  {
    "title": "This Trumpist threat proved itself a danger — now it's forming again",
    "description": "By Alexander Lowie, Postdoctoral associate in Classical and Civic Education, University of Florida Stewart Rhodes, the founder of the Oath Keepers, a far-right militia, announced in November 2025 that he will relaunch the group after it disbanded following hi…",
    "link": "https://www.rawstory.com/2674837414/",
    "timestamp": "2025-12-30T21:06:13Z"
  },
  {
    "title": "BREAKING: U.S. Military ANNIHILATES 30th Drug Boat in the Eastern Pacific",
    "description": "U.S. Southern Command just announced the latest strike on a Venezuelan drug boat in the Eastern Pacific. In a significant milestone, this marks the 30th strike against a narco-terrorist drug boat. Two were killed in today’s strike. Watch the footage: VIDEO AT…",
    "link": "https://freerepublic.com/focus/f-bloggers/4359626/posts",
    "timestamp": "2025-12-30T21:03:22Z"
  },
  {
    "title": "How should American colleges measure merit?",
    "description": "The Trump Administration ordered universities to turn over data to prove they're not considering race in admissions. But education expert Richard Kahlenberg argues that for college admissions to look at merit fairly, they need to look at class.\n\n***\nThank you…",
    "link": "https://www.wbur.org/onpoint/2025/12/30/american-colleges-merit-trump",
    "timestamp": "2025-12-30T21:00:00Z"
  },
  {
    "title": "On the canvas: Why the economy didn’t recover like it was supposed to – Liam Dann",
    "description": "OPINION: Squeezed by two kinds of bad economy at once – economists call it stagflation.",
    "link": "https://www.nzherald.co.nz/business/on-the-canvas-why-the-economy-didnt-recover-like-it-was-supposed-to-liam-dann/premium/HTNTSB4OS5GVHCQTNIITSAWWFE/",
    "timestamp": "2025-12-30T21:00:00Z"
  },
  {
    "title": "As a property slump drags on, China's economy looks more resilient than it feels",
    "description": "By some measures, China’s economy is looking resilient, with strong exports and breakthroughs in artificial intelligence and other advanced technologies. But that’s not how it feels for many ordinary Chinese, who have been enduring the strain from weak proper…",
    "link": "https://japantoday.com/category/business/as-a-property-slump-drags-on-china%27s-economy-looks-more-resilient-than-it-feels",
    "timestamp": "2025-12-30T20:59:50Z"
  },
  {
    "title": "Performers cancel concerts at Kennedy center after Trump renaming",
    "description": "A prominent jazz group and a dance company have canceled shows at Washington's premier performing arts center to protest its renaming to include U.S. President Donald Trump. Family members of late president John F. Kennedy and Democratic politicians have alre…",
    "link": "https://japantoday.com/category/entertainment/performers-cancel-concerts-at-kennedy-center-after-trump-renaming",
    "timestamp": "2025-12-30T20:57:56Z"
  },
  {
    "title": "Oil Pauses Ahead of OPEC+ Meeting",
    "description": "US stockpiles climbed sharply, reinforcing concerns that supply is outpacing demand.",
    "link": "https://www.rigzone.com/news/wire/oil_pauses_ahead_of_opec_meeting-30-dec-2025-182649-article/",
    "timestamp": "2025-12-30T20:57:15Z"
  },
  {
    "title": "DOJ challenges Virginia law granting in-state tuition to illegal immigrants",
    "description": "The Justice Department filed suit against Virginia, claiming its in-state tuition policy for illegal immigrants unlawfully favors noncitizens over American students.",
    "link": "https://www.foxnews.com/politics/doj-challenges-virginia-law-granting-in-state-tuition-illegal-immigrants",
    "timestamp": "2025-12-30T20:56:23Z"
  },
  {
    "title": "Nikkei logs highest year-end close on record above 50,000",
    "description": "The Nikkei stock index climbed 26 percent in 2025 from a year earlier to close at a record year-end high above 50,000 on Tuesday, helped by an artificial intelligence boom and expectations for economic measures under Prime Minister Sanae Takaichi. Tokyo stock…",
    "link": "https://japantoday.com/category/business/urgent-nikkei-logs-highest-year-end-close-on-record-above-50-000",
    "timestamp": "2025-12-30T20:55:34Z"
  },
  {
    "title": "Nikki Haley's son accuses Ohio Republican of 'sleazy' long con",
    "description": "Former South Carolina Gov. Nikki Haley's son took to X on Tuesday to lash out at Vivek Ramaswamy, the biotech businessman turned Department of Government Efficiency adviser who is now running for governor of Ohio as a Republican with President Donald Trump's …",
    "link": "https://www.rawstory.com/vivek-ramaswamy-2674837917/",
    "timestamp": "2025-12-30T20:54:12Z"
  },
  {
    "title": "Iran's president says answer to attack would be harsh in apparent response to Trump warning",
    "description": "Iranian President Masoud Pezeshkian on Tuesday said his country’s answer to an attack would be harsh, which appeared to be in response to a warning by U.S. President Donald Trump over reconstruction of Iran’s nuclear program. “Answer of Islamic Republic of Ir…",
    "link": "https://japantoday.com/category/world/iran%27s-president-says-answer-to-attack-would-be-harsh-in-apparent-response-to-trump-warning",
    "timestamp": "2025-12-30T20:51:44Z"
  },
  {
    "title": "Iran's government offers dialogue as protests spread to universities",
    "description": "Protests over Iran's soaring cost of living spread to several universities on Tuesday, with students joining shopkeepers and bazaar merchants, semi-official media reported, as the government offered dialogue with demonstrators. Iran's rial currency has lost n…",
    "link": "https://japantoday.com/category/world/iran%27s-government-offers-dialogue-as-protests-spread-to-universities1",
    "timestamp": "2025-12-30T20:51:34Z"
  },
  {
    "title": "U.S. NATO envoy casts doubt on Russian claim that Ukraine attacked Putin’s residence",
    "description": "U.S. ambassador to NATO Matthew Whitaker cast doubt on Tuesday on Russia’s accusation that Ukraine attacked ‌President Vladimir Putin’s residence, saying he wants to see U.S. intelligence on the incident. &quot;It is unclear whether it actually happened,&quot…",
    "link": "https://japantoday.com/category/world/us-nato-envoy-casts-doubt-on-russian-claim-that-ukraine-attacked-putin%E2%80%99s-residence",
    "timestamp": "2025-12-30T20:51:02Z"
  },
  {
    "title": "Zelenskyy discusses U.S. troop presence in Ukraine with Trump",
    "description": "Ukrainian President Volodymyr Zelenskyy said on Tuesday Kyiv was discussing with Washington a possible presence of U.S. troops in Ukraine as part of security guarantees, and also raised what he called a faked attack on Russian President Vladimir Putin's resid…",
    "link": "https://japantoday.com/category/world/zelenskiy-discusses-us-troop-presence-in-ukraine-with-trump",
    "timestamp": "2025-12-30T20:50:50Z"
  },
  {
    "title": "Why is Trump’s alleged strike on Venezuela shrouded in so much secrecy?",
    "description": "Trump’s comments have raised more questions than answers about what his administration is doing in the Southern Hemisphere",
    "link": "https://theweek.com/politics/trump-venezuela-drug-strike-war",
    "timestamp": "2025-12-30T20:50:03Z"
  },
  {
    "title": "‘Very Scary’: Ex-Scientologist Leah Remini Sounds Alarm Over Religion’s ‘Infiltration’ of Trump Admin",
    "description": "Actor and ex-Scientologist Leah Remini said it is \"very scary\" to see President Donald Trump surrounded by a number of Scientologists recently.\nThe post ‘Very Scary’: Ex-Scientologist Leah Remini Sounds Alarm Over Religion’s ‘Infiltration’ of Trump Admin firs…",
    "link": "https://www.mediaite.com/politics/very-scary-ex-scientologist-leah-remini-sounds-alarm-over-religions-infiltration-of-trump-admin/",
    "timestamp": "2025-12-30T20:48:05Z"
  },
  {
    "title": "Chappell Roan Walks Back Brigitte Bardot Praise After Learning of Late French Star's Far-Right Views",
    "description": "\"Holy (expletive) i did not know all that insane (expletive) Ms. Bardot stood for,\" Roan wrote Monday in a post on her Instagram Stories.Grammy-winning singer Chappell Roan has backtracked on her praise for Brigitte Bardot after learning about the late French…",
    "link": "https://freerepublic.com/focus/f-chat/4359625/posts",
    "timestamp": "2025-12-30T20:46:41Z"
  },
  {
    "title": "Trump take Social Security",
    "description": "As is well known, DOGE and related Republican cuts to the federal government did not save any material amounts of money, but they were very good at making many government services worse. Social Security is another example: The Social Security Administration —…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/trump-take-social-security",
    "timestamp": "2025-12-30T20:46:22Z"
  },
  {
    "title": "ROOKE: The Somali Fraud Scandal Gave Trump A Kill Switch. What Happens If He Doesn’t Use It",
    "description": "The anger that even every day Americans toward the massive fraud uncovered in Minnesota provides almost unlimited leeway to get back to work.",
    "link": "https://dailycaller.com/2025/12/30/rooke-somalia-fraud-billions-trump-administration-deportations-convictions-voters/",
    "timestamp": "2025-12-30T20:45:35Z"
  },
  {
    "title": "The Irish Times view on the Ukraine talks: Europe must have a seat at the table",
    "description": "Despite talk of progress, major obstacles remain",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/12/30/the-irish-times-view-on-the-ukraine-talks-europe-must-have-a-seat-at-the-table/",
    "timestamp": "2025-12-30T20:42:00Z"
  },
  {
    "title": "US commits $480M in health funding to Ivory Coast, the latest to sign ‘America First’ health deals",
    "description": "The signing covers areas such as HIV, malaria, maternal and child health, and global health security.",
    "link": "https://www.bostonherald.com/2025/12/30/ivory-coast-us-health-deal/",
    "timestamp": "2025-12-30T20:38:00Z"
  },
  {
    "title": "Who's retiring from Congress or not seeking reelection? Here's a guide",
    "description": "Congressional retirements can be a key barometer before the midterm elections, an indicator of how much churn could be coming to Capitol Hill in the coming cycle.",
    "link": "https://www.pbs.org/newshour/politics/whos-retiring-from-congress-or-not-seeking-reelection-heres-a-guide",
    "timestamp": "2025-12-30T20:34:22Z"
  },
  {
    "title": "DHS looks to demolish historic St Elizabeths buildings due to 'unacceptable' risks",
    "description": "Historic St. Elizabeths buildings face demolition as DHS claims emergency conditions. The move is facing pushback from preservation groups.",
    "link": "https://www.foxnews.com/politics/dhs-looks-demolish-historic-st-elizabeths-buildings-due-unacceptable-risks",
    "timestamp": "2025-12-30T20:29:45Z"
  },
  {
    "title": "Inside Trump’s “no data, just vibes” approach to science",
    "description": "One of the biggest changes so far during President Donald Trump’s second term has been the steady degradation of basic data collection.  In some cases, moves have been driven by his ideological resistance to the numbers themselves; in others, by a desire to b…",
    "link": "https://www.vox.com/climate/473751/trump-data-deletion-nih-epa-ncar-climate-science-epa-rfk-hhs",
    "timestamp": "2025-12-30T20:28:22Z"
  },
  {
    "title": "Young white men are turning to toxic influences like Nick Fuentes because they’ve been sacrificed on the altar of diversity",
    "description": "Gen Z men have been sacrificed on the altar of diversity — and it’s sending them into the arms of reactionary influencers.",
    "link": "https://nypost.com/2025/12/30/us-news/how-anti-white-dei-discrimination-fueled-nick-fuentess-fan-base/",
    "timestamp": "2025-12-30T20:19:59Z"
  },
  {
    "title": "Trump hit with ominous health prophecy from shamans: 'United States should prepare'",
    "description": "As the New Year approaches, a group of Peruvian shamans has gathered in the capital city of Lima for an annual prediction event — and according to The Daily Beast, they are urging the United States to brace itself for President Donald Trump's health to declin…",
    "link": "https://www.rawstory.com/trump-shamans/",
    "timestamp": "2025-12-30T20:16:52Z"
  },
  {
    "title": "Winning year for Aussie beef despite Trump's tariffs",
    "description": "When Donald Trump enforced a 10 per cent tariff on Australian beef, there were some concerns it would impact trade. But the opposite happened.",
    "link": "https://www.abc.net.au/news/2025-12-31/record-year-for-aussie-beef-despite-trump-tariffs/106188120",
    "timestamp": "2025-12-30T20:13:10Z"
  },
  {
    "title": "Federal Reserve’s December rate cut exposes deep policy divide — Do FOMC minutes complicate 2026 interest rate cuts?",
    "description": "Federal Reserve ended 2025 with a sharply divided decision on interest rates. Newly released December meeting minutes show officials narrowly backed a rate cut, while deeply disagreeing on what comes next. With inflation still elevated, growth strong, and job…",
    "link": "https://economictimes.indiatimes.com/news/international/us/federal-reserves-december-rate-cut-exposes-deep-policy-divide-do-fomc-minutes-complicate-2026-interest-rate-cuts/articleshow/126259285.cms",
    "timestamp": "2025-12-30T20:12:38Z"
  },
  {
    "title": "Holiday Chaos: Ivanka Trump Sparks Outrage in Aspen After Massive Security Detail 'Completely Disrupted' Skiers — 'She Acts Like She’s the First Lady'",
    "description": "Donald Trump's eldest daughter made enemies in Aspen when her family and their security detail took over the tiny ski town.",
    "link": "https://radaronline.com/p/ivanka-trump-security-detail-disrupts-aspen-outrage-acts-like-first-lady/",
    "timestamp": "2025-12-30T20:12:22Z"
  },
  {
    "title": "ASX ends 'stressful' year with value of gold and lithium stocks soaring",
    "description": "Several gold, lithium and other mining stocks have seen their share price double, and even triple, in 2025 as Australia's share market has had a much better than expected year despite tariffs, economic uncertainty and Donald Trump's ongoing unpredictability.",
    "link": "https://www.abc.net.au/news/2025-12-31/asx-ends-stressful-year-with-gold-and-lithium-stocks-surging/106188730",
    "timestamp": "2025-12-30T20:05:59Z"
  },
  {
    "title": "These Republicans Honored Kwanzaa On Second Day Of Christmas",
    "description": "Some Republican officials in late December 2025 posted social media messages honoring Kwanzaa, a secular holiday founded by a criminal black nationalist.",
    "link": "https://dailycaller.com/2025/12/30/mike-lawler-mike-dewine-kwanzaa-social-media/",
    "timestamp": "2025-12-30T20:05:39Z"
  },
  {
    "title": "‘Extremely alarming’: Anti-Trump candidate for Congress unabashedly pushes ’86 47′",
    "description": "'You've been caught and called out. Your political career just ended because you wanted to be a tough guy on the internet'",
    "link": "https://www.wnd.com/2025/12/extremely-alarming-anti-trump-candidate-congress-unabashedly-pushes/",
    "timestamp": "2025-12-30T20:04:47Z"
  },
  {
    "title": "Point of no return: The Middle East entered a new era of conflict in 2025",
    "description": "Israel, the US, and a fractured regional order are creating a volatile precedent for the year ahead Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630259-2025-in-middle-east/",
    "timestamp": "2025-12-30T20:04:05Z"
  },
  {
    "title": "Judge orders Trump administration to continue to seek funding for the CFPB",
    "description": "The order is the latest in a complex legal battle over the fate of the Consumer Financial Protection Bureau, a watchdog agency.",
    "link": "https://www.npr.org/2025/12/30/nx-s1-5661581/cfpb-funding-order",
    "timestamp": "2025-12-30T20:02:44Z"
  },
  {
    "title": "World bids farewell to 2025, a year of Trump, truces and turmoil",
    "description": "New Year’s Eve revellers will toast the end of 2025 on Wednesday, waving goodbye to 12 months packed with Trump tariffs, a Gaza truce and vain hopes for peace in Ukraine. It was one of the warmest years on record, the stifling heat stoking wildfires in Europe…",
    "link": "https://www.digitaljournal.com/world/world-bids-farewell-to-2025-a-year-of-trump-truces-and-turmoil/article",
    "timestamp": "2025-12-30T20:02:23Z"
  },
  {
    "title": "Iranian hackers: 'We obtained documents on corruption in Israel",
    "description": "Iranian hacking group claims to obtain damning information from phone of PM’s chief of staff.",
    "link": "https://www.israelnationalnews.com/news/420154",
    "timestamp": "2025-12-30T20:01:43Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.wmur.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:57:16Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.wisn.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:56:13Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.wbaltv.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:55:52Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.kcra.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:55:46Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.wtae.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:55:45Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.wmtw.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:55:42Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.ketv.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:55:39Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.wgal.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:55:38Z"
  },
  {
    "title": "Listen to the Cassandras",
    "description": null,
    "link": "https://kottke.org/25/12/listen-to-the-cassandras",
    "timestamp": "2025-12-30T19:55:25Z"
  },
  {
    "title": "Kennedy Center renaming prompts new round of cancellations from artists",
    "description": "More artists have canceled scheduled performances at the Kennedy Center following the addition of President Donald Trump's name to the facility.",
    "link": "https://www.wesh.com/article/kennedy-center-renaming-prompts-new-round-of-cancellations/69888645",
    "timestamp": "2025-12-30T19:53:35Z"
  },
  {
    "title": "Viral YouTuber Tells Trump Jr. He Wants to See Tim Walz in a ‘Prison Cell’",
    "description": "“That's what he should have to do, and same with all the other fraudsters and all the corrupt politicians who allowed this to happen.\"\nThe post Viral YouTuber Tells Trump Jr. He Wants to See Tim Walz in a ‘Prison Cell’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/viral-youtuber-tells-trump-jr-he-wants-to-see-tim-walz-in-a-prison-cell/",
    "timestamp": "2025-12-30T19:52:43Z"
  },
  {
    "title": "Elon Musk unleashes on Tim Walz with new nickname amid Minnesota fraud investigations",
    "description": "Elon Musk takes aim at Minnesota Governor Tim Walz amid investigations into alleged fraud schemes targeting the state's Medicaid and children's nutrition programs.",
    "link": "https://www.foxnews.com/politics/elon-musk-unleashes-tim-walz-new-nickname-amid-minnesota-fraud-investigations",
    "timestamp": "2025-12-30T19:52:27Z"
  },
  {
    "title": "EXCLUSIVE: Calls Come for Fraud Investigations Into Ohio Daycares",
    "description": "FIRST ON THE DAILY SIGNAL—Suspicion of fraud in Minnesota appears to be just the tip of the iceberg. With fraud suspected in Ohio as well,... Read More\nThe post EXCLUSIVE: Calls Come for Fraud Investigations Into Ohio Daycares appeared first on The Daily Sign…",
    "link": "https://www.dailysignal.com/2025/12/30/exclusive-calls-come-for-fraud-investigations-into-ohio-daycares/",
    "timestamp": "2025-12-30T19:51:51Z"
  },
  {
    "title": "CNN’s Abby Phillip Questions Nick Shirley Going to Minnesota Daycares: Somalis Are ‘Under Attack’",
    "description": "CNN's Abby Phillip questioned independent journalist Nick Shirley for reporting on empty Minnesota daycare centers while the \"Somali community is under attack\"\nThe post CNN’s Abby Phillip Questions Nick Shirley Going to Minnesota Daycares: Somalis Are ‘Under …",
    "link": "https://www.mediaite.com/media/cnns-abby-phillip-questions-nick-shirley-going-to-minnesota-daycares-somalis-are-under-attack/",
    "timestamp": "2025-12-30T19:49:29Z"
  },
  {
    "title": "Tatiana Schlossberg, JFK’s Granddaughter, Dies at 35 After Blood Cancer Battle",
    "description": "Tatiana Schlossberg, the granddaughter of John F. Kennedy who chronicled her blood cancer battle in a devastating recent New Yorker column, died Tuesday. She was 35. The JFK Library Foundation announced her death, writing on behalf of her family, “Our beautif…",
    "link": "https://variety.com/2025/politics/news/tatiana-schlossberg-dead-jfk-granddaughter-blood-cancer-1236620495/",
    "timestamp": "2025-12-30T19:46:22Z"
  },
  {
    "title": "Comedian Shane Gillis Rips DHS for Making Silly ICE Videos: 'That's F**king Terrible'",
    "description": "Comedian Shane Gilli is unhappy that the Department of Homeland Security is making meme-styled, funny videos for ICE.\nThe post Comedian Shane Gillis Rips DHS for Making Silly ICE Videos: ‘That’s F**king Terrible’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/12/30/comedian-shane-gillis-rips-dhs-for-making-silly-ice-videos-thats-fking-terrible/",
    "timestamp": "2025-12-30T19:44:52Z"
  },
  {
    "title": "Susie Wiles Lands in Even More Hot Water Over Vanity Fair Interview",
    "description": "White House Chief of Staff Susie Wiles might have revealed more than she ought to about the Epstein files.The Vanity Fair profile on the president’s famed “ice maiden” has continued to haunt the administration weeks after its publication, in large part thanks…",
    "link": "https://newrepublic.com/post/204817/susie-wiles-vanity-fair-epstein-files",
    "timestamp": "2025-12-30T19:44:07Z"
  },
  {
    "title": "'Very scary': Ex-Scientologist issues warning after Trump seen 'hanging out' with members",
    "description": "Former Scientologist Leah Remini warned that President Donald Trump's administration has been \"infiltrated\" by members of the secretive church.Conservative broadcaster Erick Erickson noted on Tuesday that at least five Scientologists had been seen with Trump …",
    "link": "https://www.rawstory.com/trump-scientology/",
    "timestamp": "2025-12-30T19:42:28Z"
  },
  {
    "title": "Artists cancel performances at Trump-Kennedy Center, citing 'takeover' by Trump administration",
    "description": "Artists cancel performances at Trump-Kennedy Center, citing 'takeover' by Trump administrationgo.com",
    "link": "https://abcnews.go.com/Politics/artists-cancel-performances-trump-kennedy-center-citing-takeover/story?id=128780162",
    "timestamp": "2025-12-30T19:40:58Z"
  },
  {
    "title": "Chaos at the Kennedy Center: Everything That Happened This Year Under Donald Trump",
    "description": "Board purges, crony appointments, cancelations, and a legally dubious name change marked Donald Trump's first year in charge of the Kennedy Center.",
    "link": "http://www.rollingstone.com/music/music-news/trump-kennedy-center-everything-that-happend-2026-1235492341/",
    "timestamp": "2025-12-30T19:39:35Z"
  },
  {
    "title": "DOGE Cuts, Coding Issues Delayed a Key US Oil Report This Week",
    "description": "A closely watched US oil report was delayed by several hours this week in the latest sign that federal staffing cuts are impacting data that’s crucial to markets.",
    "link": "https://financialpost.com/pmn/business-pmn/doge-cuts-coding-issues-delayed-a-key-us-oil-report-this-week",
    "timestamp": "2025-12-30T19:38:00Z"
  },
  {
    "title": "Clooney: ABC, CBS should have told Trump “go f**k yourself”",
    "description": "The \"Good Night, and Good Luck\" star worried about the future of the press in a new interview.",
    "link": "https://www.salon.com/2025/12/30/clooney-abc-cbs-should-have-told-trump-go-fk-yourself/",
    "timestamp": "2025-12-30T19:37:57Z"
  },
  {
    "title": "FINALLY, Jewish Space Lasers",
    "description": "While soon-to-be-former Georgia Republican Congresscritter Marjorie Taylor Greene continues her one-sided breakup from President Donald Trump, one of her favorite conspiracy theories just became reality in Israel. That's right: Jewish Space Lasers are real, e…",
    "link": "https://freerepublic.com/focus/f-news/4359610/posts",
    "timestamp": "2025-12-30T19:35:22Z"
  },
  {
    "title": "Trump Gushed That Zohran Mamdani Was ‘Better Looking in Person’ After Feuding For Months",
    "description": "The president made the comments after criticizing the New York City mayor-elect’s appearance.",
    "link": "https://www.huffpost.com/entry/trump-mamdani-better-looking-in-person_n_6953f5f4e4b01b40d0055af9",
    "timestamp": "2025-12-30T19:32:06Z"
  },
  {
    "title": "US NATO envoy casts doubt on Russian claim that Ukraine attacked Putin’s residence",
    "description": "WASHINGTON, Dec 30 (Reuters) - U.S. ‌ambassador to NATO Matthew Whitaker cast doubt on Tuesday on Russia's accusation that ‌Ukraine attacked President Vladimir Putin's residence, saying he wants to see U.S. intelligence ‌on the incident. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/31/us-nato-envoy-casts-doubt-on-russian-claim-that-ukraine-attacked-putins-residence",
    "timestamp": "2025-12-30T19:32:00Z"
  },
  {
    "title": "Rosie O'Donnell: I Wish I Could Say I Don't Think About Trump a Lot, but I Do",
    "description": "Actress Rosie O'Donnell, who moved to Ireland earlier this year and promised her therapist she would try to go two days without talking about President Donald Trump, has confessed she thinks about him much more than she'd like to.\nThe post Rosie O’Donnell: I …",
    "link": "https://www.breitbart.com/entertainment/2025/12/30/rosie-odonnell-i-wish-i-could-say-i-dont-think-about-trump-a-lot-but-i-do/",
    "timestamp": "2025-12-30T19:29:57Z"
  },
  {
    "title": "Midday Wrapped Part 1: Our favorite episodes of 2025",
    "description": "As 2025 comes to a close, the Midday Edition team is reflecting on some of our favorite conversations from the year — and we're splitting it into two parts.In this first episode of Midday Wrapped, producers Julianna Domingo and Ashley Rusch take listeners beh…",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/kpbs-midday-edition-favorite-episodes-2025",
    "timestamp": "2025-12-30T19:25:00Z"
  },
  {
    "title": "'Too little, too late': Experts say Kavanaugh won't undo his damage with major U-turn",
    "description": "A recent opinion by Supreme Court Justice Brett Kavanaugh, which has all of the appearances that he wants the expression “Kavanaugh stops” to fade into obscurity, was panned by Slate legal analysts Dahlia Lithwick and Mark Joseph Stern on Tuesday.At issue was…",
    "link": "https://www.rawstory.com/kavanaugh-2674837701/",
    "timestamp": "2025-12-30T19:23:44Z"
  },
  {
    "title": "Trump DOJ Cases Against Chicago Protesters Are an Utter Failure",
    "description": "Immigrations and Customs Enforcement detained more than a hundred people in their Chicago “Midway Blitz” operation in September. But as it turns out, at least half of those people were kidnapped for no reason, as their charges were dropped. Only nine arrests …",
    "link": "https://newrepublic.com/post/204812/donald-trump-department-justice-chicago-protesters-arrest-ice",
    "timestamp": "2025-12-30T19:21:04Z"
  },
  {
    "title": "Trump’s New Venezuela Escalation Raises Questions on Next Steps",
    "description": "President Donald Trump’s unusual decision to reveal a covert US strike against what he said was a drug-trafficking facility in Venezuela marked a new escalation in his pressure campaign against the regime of Nicolas Maduro, raising new questions about how far…",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-new-venezuela-escalation-raises-questions-on-next-steps",
    "timestamp": "2025-12-30T19:17:22Z"
  },
  {
    "title": "Bipartisan House China panel slams Beijing’s Taiwan drills as ‘deliberate escalation’",
    "description": "China conducts two-day military exercises around Taiwan with rockets, bombers and assault ships as House Select Committee on China warns of deliberate escalation by Beijing.",
    "link": "https://www.foxnews.com/politics/bipartisan-house-china-panel-slams-beijings-taiwan-drills-deliberate-escalation",
    "timestamp": "2025-12-30T19:16:46Z"
  },
  {
    "title": "No, the White House can’t defund the CFPB, judge says, just days before agency would run out of cash",
    "description": "At the heart of this case is whether budget bigwig Russell Vought can effectively shut down the agency and lay off all of the bureau's employees.",
    "link": "https://fortune.com/2025/12/30/cfpb-russell-vought-defunding-agency-consumer-protection-judge/",
    "timestamp": "2025-12-30T19:14:33Z"
  },
  {
    "title": "Donald Trump’s Golden Age of Awful",
    "description": "Susan B. Glasser on acts by President Donald Trump and his enablers in 2025, in areas such as immigration, the economy, the rule of law, and Presidential power.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/donald-trumps-golden-age-of-awful",
    "timestamp": "2025-12-30T19:14:17Z"
  }
]