[
  {
    "title": "Cleveland Guardians respond after President Donald Trump calls for team name to be reverted to old moniker",
    "description": "The Guardians changed their branding in 2021",
    "link": "https://www.cbssports.com/mlb/news/cleveland-guardians-respond-after-president-donald-trump-calls-for-team-name-to-be-reverted-to-old-moniker/",
    "timestamp": "2025-07-21T18:28:10Z"
  },
  {
    "title": "Trump posted AI-generated video of Obama getting arrested in Oval Office",
    "description": "In July 2025, U.S. President Donald Trump posted an artificial intelligence-generated video of former President Barack Obama being arrested in the Oval Office.",
    "link": "https://www.snopes.com//fact-check/trump-ai-video-obama/",
    "timestamp": "2025-07-21T18:28:00Z"
  },
  {
    "title": "Trump's 'CBP Home App' Gets Tens of Thousands of Illegals to Self-Deport",
    "description": "Self-deportations of illegal aliens have ramped up significantly since President Donald Trump's Department of Homeland Security (DHS) began prioritizing a cost-effective departure program, new agency data reveal.\nThe post Trump’s ‘CBP Home App’ Gets Tens of T…",
    "link": "https://www.breitbart.com/politics/2025/07/21/trumps-cbp-home-app-gets-tens-of-thousands-illegals-to-self-deport/",
    "timestamp": "2025-07-21T18:27:55Z"
  },
  {
    "title": "How Trump Turned His Truth Social App Into A Megaphone",
    "description": "Donald Trump has turned his obscure Truth Social platform into a megaphone in his second presidential term -- constantly posting everything from major policy announcements to personal threats and unashamed self-promotion.",
    "link": "https://www.ibtimes.com/how-trump-turned-his-truth-social-app-megaphone-3779042",
    "timestamp": "2025-07-21T18:27:22Z"
  },
  {
    "title": "Amid Outrage Over Epstein Files, AG Pam Bondi Will Be Featured Speaker at CPAC ‘Summit Against Human Trafficking’",
    "description": "On Wednesday, Attorney General Pam Bondi will be a featured speaker at a CPAC conference titled the \"International Summit Against Human Trafficking.\"\nThe post Amid Outrage Over Epstein Files, AG Pam Bondi Will Be Featured Speaker at CPAC ‘Summit Against Human…",
    "link": "https://www.mediaite.com/media/news/amid-outrage-over-epstein-files-ag-pam-bondi-will-be-featured-speaker-at-cpac-summit-against-human-trafficking/",
    "timestamp": "2025-07-21T18:26:34Z"
  },
  {
    "title": "Trump calls for Washington and Cleveland sports franchises to revert to their former names",
    "description": "Trump has given an ultimatum to Washington’s NFL team: Reinstate the team’s old, racist name caricaturizing Indigenous people — the Redskins — or risk losing out on a new stadium in D.C.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-commanders-redskins-guardians-indians-team-names-rcna220034",
    "timestamp": "2025-07-21T18:25:15Z"
  },
  {
    "title": "Congresswoman sends Jerome Powell’s name to DOJ, seeking investigation of ‘lying under oath’",
    "description": "Accused of misstatements about a $700 million cost overrun for the renovation of Federal Reserve offices in Washington",
    "link": "https://www.wnd.com/2025/07/congresswoman-sends-jerome-powells-name-doj-seeking-investigation/",
    "timestamp": "2025-07-21T18:23:23Z"
  },
  {
    "title": "How Trump turned his Truth Social app into a megaphone",
    "description": "Donald Trump has turned his obscure Truth Social platform into a megaphone in his second presidential term.\nThe post How Trump turned his Truth Social app into a megaphone appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/how-trump-turned-his-truth-social-app-into-a-megaphone/article",
    "timestamp": "2025-07-21T18:22:49Z"
  },
  {
    "title": "Interest In Epstein Podcasts, Books, Documentaries Soar Amid Renewed Scrutiny Of Trump",
    "description": "President Donald Trump's relationship to Jeffrey Epstein is facing renewed scrutiny after a report about on a suggestive birthday card Trump allegedly gifted Epstein in 2003.",
    "link": "https://www.forbes.com/sites/maryroeloffs/2025/07/21/interest-in-epstein-podcasts-books-documentaries-soar-amid-renewed-scrutiny-of-trump/",
    "timestamp": "2025-07-21T18:22:28Z"
  },
  {
    "title": "WWE Legend Umaga's Son Makes Impactful Debut",
    "description": "The son of a beloved WWE legend just made his shocking debut for a rival promotion... and his partner called him \"the most dangerous\" member of The Bloodline.",
    "link": "https://www.newsweek.com/sports/wrestling/wwe-legend-umagas-son-makes-impactful-debut-2101863",
    "timestamp": "2025-07-21T18:21:56Z"
  },
  {
    "title": "Hunter Biden Says He'd 'Invade' US Ally El Salvador To Bring Back Illegal Immigrants If He Became President",
    "description": "In an expletive-filled rant, Hunter Biden said he would invade El Salvador to bring illegal immigrants back to the United States if he were president.\nThe post Hunter Biden Says He'd 'Invade' US Ally El Salvador To Bring Back Illegal Immigrants If He Became P…",
    "link": "https://freebeacon.com/latest-news/hunter-biden-says-hed-invade-us-ally-el-salvador-to-bring-back-illegal-immigrants-if-he-became-president/",
    "timestamp": "2025-07-21T18:20:56Z"
  },
  {
    "title": "Hunter Biden Warns That Without Illegal Immigrants, The Price Of Prostitutes And Crack Will Skyrocket",
    "description": "WILMINGTON, DE — As part of a wide-ranging sit-down interview released on YouTube, Hunter Biden warned Americans that, without illegal immigrants, the price of crack cocaine and prostitutes would skyrocket.",
    "link": "https://babylonbee.com/news/hunter-biden-warns-that-without-illegal-immigrants-the-price-of-crack-will-skyrocket",
    "timestamp": "2025-07-21T18:20:55Z"
  },
  {
    "title": "US Treasury chief calls for review of Fed for ‘many mistakes’ (VIDEO)",
    "description": "Scott Bessent has said the Federal Reserve was wrong to criticize President Donald Trump’s tariff policy Read Full Article at RT.com",
    "link": "https://www.rt.com/business/621778-bessent-fed-review-mistakes/",
    "timestamp": "2025-07-21T18:20:37Z"
  },
  {
    "title": "Trump Calls for Obama's Arrest With Jaw-Dropping Video After Tulsi Gabbard Claimed Ex-Prez 'Manufactured' Intelligence to Create 2016 Russian Election Interference Case",
    "description": "Donald Trump wants the public to focus on Barack Obama and his 'Russia drama,' while he attempts to bury the current Jeffrey Epstein storyline.",
    "link": "https://radaronline.com/p/trump-obama-arrest-video-tulsi-gabbard-russian-election/",
    "timestamp": "2025-07-21T18:20:00Z"
  },
  {
    "title": "Astronomer CEO's ‘kiss cam’ controversy sparked over $7 million in prediction markets bets on his ouster",
    "description": "The controversy triggered $2.4 million in total trading volumes on Kalshi, marking one of the most traded cultural events on prediction markets.",
    "link": "https://www.cnbc.com/2025/07/21/astronomer-ceos-kiss-cam-controversy-sparked-over-7-million-in-prediction-markets-bets-on-his-ouster.html",
    "timestamp": "2025-07-21T18:18:04Z"
  },
  {
    "title": "Police Federation seeks legal advice ahead of Trump visit",
    "description": "The group, which represents rank-and-file officers, says workforce agreements have been breached.",
    "link": "https://www.bbc.com/news/articles/c62dy0d85mgo",
    "timestamp": "2025-07-21T18:17:39Z"
  },
  {
    "title": "Commerce honcho Lutnick once called Trump ‘buffoon’ — but now talks to him every night: report",
    "description": "\"Lutnick and President Donald Trump speak on the phone most nights, at around one in the morning, just after Lutnick gets in bed,\" New Yorker magazine writer Antonia Hitchens said.",
    "link": "https://nypost.com/2025/07/21/us-news/commerce-honcho-lutnick-once-called-trump-buffoon-but-now-talks-to-him-every-night-report/",
    "timestamp": "2025-07-21T18:16:42Z"
  },
  {
    "title": "Donald Trump Has Request for Judge Ruling in Bryan Kohberger Case",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump made a request to District Judge Steven Hippler, who is presiding over the Bryan Kohberger case.\nKohberger, 30, pleaded guilty to four counts of first-degree murder and one count of burg…",
    "link": "https://biztoc.com/x/ef38154eb0c41d63",
    "timestamp": "2025-07-21T18:14:56Z"
  },
  {
    "title": "Trump Media builds $2 billion bitcoin hoard, as crypto swells president's net worth",
    "description": "Trump has embraced digital currency to such a degree that crypto now reportedly accounts for most of his net worth.",
    "link": "https://www.cnbc.com/2025/07/21/trump-djt-bitcoin-net-worth.html",
    "timestamp": "2025-07-21T18:13:15Z"
  },
  {
    "title": "First US Rare Earth Minerals Mine in 70 Years Will Lessen Dependence on China",
    "description": "Last week on the Senate floor, I hailed the opening in Sheridan, Wyoming, of the Brook Mine—the first rare earth elements mine to break ground... Read More\nThe post First US Rare Earth Minerals Mine in 70 Years Will Lessen Dependence on China appeared first o…",
    "link": "https://www.dailysignal.com/2025/07/21/first-new-rare-earth-minerals-mine-70-years-will-lessen-us-dependence-china/",
    "timestamp": "2025-07-21T18:12:34Z"
  },
  {
    "title": "‘Political infection’: FBI blasted for failing even ‘due diligence’ while ‘investigating’ Hillary Clinton’s email scandal",
    "description": "Declassified document showed agency didn't to even review thumbdrives that contained potentially key information about an 'illicit private server'",
    "link": "https://www.wnd.com/2025/07/political-infection-fbi-blasted-failing-even-due-diligence/",
    "timestamp": "2025-07-21T18:12:14Z"
  },
  {
    "title": "Another Major Hospital Drops Trans Treatments For Kids",
    "description": "The Children’s National Hospital in Washington, D.C., announced on Friday that it would no longer prescribe transgender-related medication to its patients.",
    "link": "https://dailycaller.com/2025/07/21/major-hospital-drops-trans-treatments-for-kids/",
    "timestamp": "2025-07-21T18:11:30Z"
  },
  {
    "title": "Donald Trump Has Request for Judge Ruling in Bryan Kohberger Case",
    "description": "Bryan Kohberger pleaded guilty to four counts of first-degree murder after the prosecution and defense reached a plea agreement.",
    "link": "https://www.newsweek.com/trump-truth-social-bryan-kohberger-idaho-student-murders-2101941",
    "timestamp": "2025-07-21T18:10:11Z"
  },
  {
    "title": "All They Will Call You Will be ‘Deportees’",
    "description": "Goodbye to my Juan, goodbye, Rosalita,Adios mis amigos, Jesus y Maria;You won’t have your names when you ride the big airplane,All they will call you will be “deportees”—“Deportees,(Plane Wreck at Los Gatos)”\r\n Woody Guthrie, 1948On January 28, 1948 a small p…",
    "link": "https://www.commondreams.org/opinion/call-you-deportees",
    "timestamp": "2025-07-21T18:10:06Z"
  },
  {
    "title": "Right-Wing Leader Says Conservatives Need ‘Scalps’ of Woke Wall Street CEOs",
    "description": "Lisa Nelson, ALEC’s CEO, said conservatives need a “scalp” from either Bank of America’s Brian Moynihan or BlackRock’s Larry Fink.",
    "link": "http://www.rollingstone.com/politics/politics-features/alec-conservative-scalp-woke-ceos-blackrock-bank-of-america-1235389886/",
    "timestamp": "2025-07-21T18:10:05Z"
  },
  {
    "title": "Harvard seeks billions in funding restored at a pivotal hearing in its standoff with Trump",
    "description": "Harvard University is in federal court. It is fighting the Trump administration. The dispute is over $2.6 billion in federal funding cuts. Harvard claims the cuts are illegal. The government says Harvard violated directives against antisemitism. A judge is qu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/harvard-seeks-billions-in-funding-restored-at-a-pivotal-hearing-in-its-standoff-with-trump/articleshow/122820882.cms",
    "timestamp": "2025-07-21T18:09:00Z"
  },
  {
    "title": "Fox’s Andy McCarthy Torches Tulsi Gabbard Over ‘Misleading’ Attack on Obama and Russia Investigation",
    "description": "Fox News contributor Andy McCarthy torched Director of National Intelligence Tulsi Gabbard over her misleading new attack on the Obama administration.\nThe post Fox’s Andy McCarthy Torches Tulsi Gabbard Over ‘Misleading’ Attack on Obama and Russia Investigatio…",
    "link": "https://www.mediaite.com/media/news/foxs-andy-mccarthy-torches-tulsi-gabbard-over-misleading-attack-on-obama-over-russia-investigation/",
    "timestamp": "2025-07-21T18:08:57Z"
  },
  {
    "title": "What the Cancellation of Stephen Colbert’s “Late Show” Means",
    "description": "Vinson Cunningham on CBS’s decision to end the series, announced days after Paramount, its parent company, settled a lawsuit over “60 Minutes” with President Donald Trump and completed a sale to Skydance Media.",
    "link": "https://www.newyorker.com/culture/on-television/what-the-cancellation-of-stephen-colberts-late-show-means",
    "timestamp": "2025-07-21T18:08:33Z"
  },
  {
    "title": "Trump: Cashless Bail a ‘Complete Disaster, and Must Be Ended IMMEDIATELY’",
    "description": "President Donald Trump took to Truth Social to demand the elimination of cashless bail, saying the policy has failed and is endangering public safety.\nThe post Trump: Cashless Bail a ‘Complete Disaster, and Must Be Ended IMMEDIATELY’ appeared first on Breitba…",
    "link": "https://www.breitbart.com/politics/2025/07/21/trump-cashless-bail-a-complete-disaster-and-must-be-ended-immediately/",
    "timestamp": "2025-07-21T18:08:26Z"
  },
  {
    "title": "Harvard asks judge to block Trump administration from withholding federal funds",
    "description": "Harvard asks judge to block Trump administration from withholding federal fundsgo.com",
    "link": "https://abcnews.go.com/US/harvard-argues-trump-administrations-withholding-federal-funds/story?id=123930086",
    "timestamp": "2025-07-21T18:07:48Z"
  },
  {
    "title": "DNC vice chair compares President Trump to notorious segregationists during heated town hall event",
    "description": "At a Philadelphia town hall, DNC's Rep. Malcolm Kenyatta referenced George Wallace's segregation slogan while criticizing President Donald Trump as Beto O'Rourke advocated for Democrats",
    "link": "https://www.foxnews.com/politics/dnc-vice-chair-compares-president-trump-notorious-segregationists-during-heated-town-hall-event",
    "timestamp": "2025-07-21T18:06:44Z"
  },
  {
    "title": "HRW Report Documents Abusive Practices at Three Florida Immigration Detention Centers Since January 2025",
    "description": "The 92-page report, “‘You Feel Like Your Life is Over’: Abusive Practices at Three Florida Immigration Detention Centers Since January 2025,” documents that people detained at Krome North Service Processing Center (Krome), Broward Transitional Center (BTC), a…",
    "link": "https://www.hrw.org/report/2025/07/21/you-feel-like-your-life-is-over/abusive-practices-at-three-florida-immigration",
    "timestamp": "2025-07-21T18:05:36Z"
  },
  {
    "title": "The history of Native American sports name changes, from the Obama era to Trump's latest comments",
    "description": "President Donald Trump’s social media posts calling for the NFL’s Washington Commanders and Major League Baseball’s Cleveland Guardians to revert to their old names has revived the conversation about Native American imagery in sports. Then-President Barack Ob…",
    "link": "https://sports.yahoo.com/article/history-native-american-sports-name-180426881.html",
    "timestamp": "2025-07-21T18:04:26Z"
  },
  {
    "title": "Here’s exactly how much you’ll save on your 2026 taxes, by income bracket: Trump Big Beautiful Bill benefits",
    "description": "Now that President Donald Trump’s so-called Big Beautiful Bill is the law, you’re probably wondering how much you’ll save on your taxes when you file next year. The Tax Policy Center (TPC), a nonpartisan think tank staffed by the Urban Institute and the Brook…",
    "link": "https://biztoc.com/x/02bf52cffc16f2b2",
    "timestamp": "2025-07-21T18:04:10Z"
  },
  {
    "title": "Coffee Break: Trump Makes an Example Out of Paramount",
    "description": "President Donald Trump has zeroed in on Paramount, the weakest of American media titans, to administer a lesson in sontaku, the Japanese art of “obeying in advance” or “following unspoken orders.”\nParamount’s CBS claimed the decision to cancel Stephen Colbert…",
    "link": "https://biztoc.com/x/de99c2407272f459",
    "timestamp": "2025-07-21T18:03:53Z"
  },
  {
    "title": "Trump officials who hold more than one job",
    "description": "As someone who has held a host of different jobs over the course of his time in the public eye — hotelier, game show host, product pitch-man — it comes as little surprise that President Donald Trump would expect his White House staff to wear multiple hats as …",
    "link": "https://biztoc.com/x/deea96431aab1d6e",
    "timestamp": "2025-07-21T18:03:50Z"
  },
  {
    "title": "House Republican Who Routinely Opposes Trump Praises First Lady: 'We Owe Melania Some Thanks'",
    "description": "House Republican Who Routinely Opposes Trump Praises First Lady: 'We Owe Melania Some Thanks'westernjournal.com",
    "link": "https://www.westernjournal.com/house-republican-routinely-opposes-trump-praises-first-lady-owe-melania-thanks/",
    "timestamp": "2025-07-21T18:01:59Z"
  },
  {
    "title": "Friedman to Arutz Sheva: Trump, Netanyahu bet legacy on Iran strike, and it paid off",
    "description": "Former US Ambassador David Friedman tells Arutz Sheva that Israel must take the lead on sovereignty, praises Trump’s bold stance on Iran, Gaza, and the Abraham Accords.",
    "link": "https://www.israelnationalnews.com/news/412029",
    "timestamp": "2025-07-21T18:01:00Z"
  },
  {
    "title": "Coffee Break: Trump Makes an Example Out of Paramount",
    "description": "President Donald Trump has zeroed in on Paramount, the weakest of American media titans, to administer a lesson in sontaku, the Japanese art of \"obeying in advance\" or \"following unspoken orders.\"",
    "link": "https://www.nakedcapitalism.com/2025/07/trump-paramount-larry-ellison-skydance-colbert.html",
    "timestamp": "2025-07-21T18:00:56Z"
  },
  {
    "title": "DOJ confirms receipt of Tulsi Gabbard’s criminal referral on Barack Obama administration",
    "description": "DNI has uncovered evidence that Democrat and his national security team orchestrated the yearslong Trump-Russia collusion conspiracy theory",
    "link": "https://www.wnd.com/2025/07/doj-confirms-receipt-tulsi-gabbards-criminal-referral-barack/",
    "timestamp": "2025-07-21T18:00:37Z"
  },
  {
    "title": "Actor Jeff Daniels laments Kamala Harris’ loss, suggests she would have governed like Abraham Lincoln",
    "description": "Jeff Daniels criticized the Republican Party's \"deterioration\" during an interview, claiming Harris would have appointed figures like Liz Cheney to her cabinet.",
    "link": "https://www.foxnews.com/media/actor-jeff-daniels-laments-kamala-harris-loss-suggests-she-would-have-governed-like-abraham-lincoln",
    "timestamp": "2025-07-21T18:00:20Z"
  },
  {
    "title": "3 HOUR YOUTUBE interview...",
    "description": "HUNTER Biden has denied that a bag of cocaine found in the White House during his dad’s presidency was his in a bizarre new interview. The controversial former first son sat down for a three-…",
    "link": "https://www.the-sun.com/news/14779299/hunter-biden-cocaine-white-house-andrew-callaghan/",
    "timestamp": "2025-07-21T18:00:03Z"
  },
  {
    "title": "Is ICE really Trump's Gestapo?",
    "description": "By Daniel H. Magilow, Professor of German, University of Tennessee. Minnesota Gov. Tim Walz recently sparked controversy by comparing U.S. Immigration and Customs Enforcement (ICE) to Nazi Germany’s notorious secret police, the Gestapo.“Donald Trump’s modern-…",
    "link": "https://www.rawstory.com/gestapo/",
    "timestamp": "2025-07-21T18:00:02Z"
  },
  {
    "title": "In Colorado, naturally hot water from an underground reservoir is used to maintain optimal growing temperatures",
    "description": "Cost is the main reason why there aren't more geothermal farming operations in the US.",
    "link": "https://syndication.washingtonpost.com/nss/stories/HVIEGWQ4E5ALBM4CCJTISUKMRQ",
    "timestamp": "2025-07-21T18:00:01Z"
  },
  {
    "title": "Lawyers ask that Kilmar Abrego Garcia stay in jail to avoid US deportation",
    "description": "Despite being wrongly deported and returned to the US, lawyers say Abrego Garcia again faces expulsion.",
    "link": "https://www.aljazeera.com/news/2025/7/21/lawyers-ask-that-kilmar-abrego-garcia-stay-in-jail-to-avoid-us-deportation",
    "timestamp": "2025-07-21T17:59:44Z"
  },
  {
    "title": "Hunter Biden Rages Against Trump, Slams Democrats in Weird Interview",
    "description": "\"And James Carville, who hasn't run a race in 40 f*cking years, and David Axelrod, who had one success in his political life, and that was Barack Obama. And that was because of Barack Obama, not because of f*cking David Axelrod...\"\nThe post Hunter Biden Rages…",
    "link": "https://legalinsurrection.com/2025/07/hunter-biden-rages-against-trump-slams-democrats-in-weird-interview/",
    "timestamp": "2025-07-21T17:59:33Z"
  },
  {
    "title": "Japan PM Shigeru Ishiba vows to stay on after bruising election defeat",
    "description": "\"I will stay in office and do everything in my power to chart a path toward resolving these challenges,\" Ishiba said, adding that he intended to speak directly with US President Donald Trump as soon as possible and deliver tangible results. Analysts say his d…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/japan-pm-shigeru-ishiba-vows-to-stay-on-after-bruising-election-defeat/articleshow/122820657.cms",
    "timestamp": "2025-07-21T17:59:03Z"
  },
  {
    "title": "Congressional Republicans face bruising battle to avoid government shutdown",
    "description": "House and Senate Republicans are readying for a sprint to the end of fiscal year 2025 while President Trump pushes Congress to further cut government spending.",
    "link": "https://www.foxnews.com/politics/congressional-republicans-face-bruising-battle-avoid-government-shutdown",
    "timestamp": "2025-07-21T17:58:20Z"
  },
  {
    "title": "Just In: Obama judge has reportedly been assigned to President Donald Trump’s $10 billion defamation lawsuit against Rupert Murdoch and The Wall Street Journal.",
    "description": "former President Barack Obama judge has reportedly been assigned to President Donald Trump's $10 billion defamation lawsuit against Rupert Murdoch and The Wall Street Journal. U.S. District Judge Darrin Gayles in the Southern District of Florida was nominated…",
    "link": "https://freerepublic.com/focus/f-news/4329937/posts",
    "timestamp": "2025-07-21T17:57:57Z"
  },
  {
    "title": "Trump officials who hold more than one job",
    "description": "Wearing multiple hats has become the norm inside a White House known for a revolving door of functionaries and officials",
    "link": "https://theweek.com/politics/trump-white-house-multiple-jobs-duffy-rubio",
    "timestamp": "2025-07-21T17:57:54Z"
  },
  {
    "title": "Premiers meet with Indigenous groups on first day of three-day Ontario gathering",
    "description": "HUNTSVILLE, ONT. — Canada’s premiers are pledging economic reconciliation with Indigenous people as they head into discussions with First Nations, Metis and Inuit groups at a three-day meeting in cottage country north of Toronto. The premiers have gathered at…",
    "link": "https://financialpost.com/pmn/premiers-meet-with-indigenous-groups-on-first-day-of-three-day-ontario-gathering",
    "timestamp": "2025-07-21T17:56:11Z"
  },
  {
    "title": "EXPLOSIVE: Senate Judiciary Committee Drops Bombshell on FBI’s Clinton Cover-Up — Declassifies and Releases Long-Hidden “Clinton Annex” to the Public",
    "description": "The U.S. Senate Committee on the Judiciary has released a scathing statement exposing the FBI’s utter failure—if not outright refusal—to properly investigate Hillary Clinton’s illegal use of a private email server during her time as Secretary of State. Senato…",
    "link": "https://freerepublic.com/focus/f-news/4329936/posts",
    "timestamp": "2025-07-21T17:56:10Z"
  },
  {
    "title": "EU to ramp up retaliation plans as US tariff deal prospects dim",
    "description": "The European Commission, which negotiates trade agreements on behalf of the 27-member bloc, had appeared on course for an agreement in which the EU would still have faced a 10% U.S. tariff on most of its exports, with some concessions.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eu-to-ramp-up-retaliation-plans-as-us-tariff-deal-prospects-dim/articleshow/122820576.cms",
    "timestamp": "2025-07-21T17:53:38Z"
  },
  {
    "title": "Hearing begins in Harvard’s case against the Trump administration",
    "description": "The university is suing for the restoration of more than $2bn in grants cut for hundreds of research projects.",
    "link": "https://www.aljazeera.com/news/2025/7/21/hearing-begins-in-harvards-case-against-the-trump-administration",
    "timestamp": "2025-07-21T17:53:26Z"
  },
  {
    "title": "Trump Should Kill Commanders Stadium Deal, but Not Because of the Team's Name",
    "description": "Over the weekend, President Donald Trump weighed in on an issue somewhat outside his purview as commander in chief: the name of his local professional football team.\nIn social media posts, Trump threatened to terminate a deal for a new stadium unless the NFL …",
    "link": "https://biztoc.com/x/48c51cc7bc4f272e",
    "timestamp": "2025-07-21T17:53:06Z"
  },
  {
    "title": "Trump demands end to cashless bail, says 'complete disaster' driving crime in cities, endangering police (Danielle Wallace/Fox News)",
    "description": "Danielle Wallace / Fox News:\nTrump demands end to cashless bail, says ‘complete disaster’ driving crime in cities, endangering police  —  Trump warns that ‘WORST criminals are flooding our streets’ due to no-cash bail laws  —  President Donald Trump demanded …",
    "link": "https://www.memeorandum.com/250721/p75",
    "timestamp": "2025-07-21T17:50:00Z"
  },
  {
    "title": "Hunter Biden Says He Would ‘F*cking Invade’ Sovereign Nation To Bring Illegals Back To US",
    "description": "Hunter Biden said that if he became president, he'd threaten to \"invade\" El Salvador to retrieve illegal migrants Donald Trump's administration has sent there.",
    "link": "https://dailycaller.com/2025/07/21/hunter-biden-invade-sovereign-nation-illegals-us/",
    "timestamp": "2025-07-21T17:48:55Z"
  },
  {
    "title": "The Trump Administration “Cheated” Alaska Senator Lisa Murkowski Out of a Deal",
    "description": "You’re telling me the president lied to someone? I’m shocked.",
    "link": "https://www.esquire.com/news-politics/politics/a65465854/lisa-murkowski-gop-bill-trump-alaska/",
    "timestamp": "2025-07-21T17:48:00Z"
  },
  {
    "title": "Here’s exactly how much you’ll save on your 2026 taxes, by income bracket: Trump Big Beautiful Bill benefits",
    "description": "Now that President Donald Trump’s so-called Big Beautiful Bill is the law, you’re probably wondering how much you’ll save on your taxes when you file next year. The Tax Policy Center (TPC), a nonpartisan think tank staffed by the Urban Institute and the Brook…",
    "link": "https://www.fastcompany.com/91371700/2026-taxes-exactly-how-much-youll-save-by-income-bracket-trump-big-beautiful-bill-benefits-analysis",
    "timestamp": "2025-07-21T17:45:00Z"
  },
  {
    "title": "State Department Revokes Visa for Brazil's Bolsonaro-Persecuting Judge Alexandre de Moraes",
    "description": "U.S. Secretary of State Marco Rubio imposed U.S. visa restrictions over the weekend on Brazil Supreme Federal Tribunal (STF) Justice Alexandre de Moraes in response to his involvement in the censorship of the free speech rights of Americans and the political …",
    "link": "https://www.breitbart.com/latin-america/2025/07/21/state-department-revokes-visa-for-brazils-bolsonaro-persecuting-judge-alexandre-de-moraes/",
    "timestamp": "2025-07-21T17:44:37Z"
  },
  {
    "title": "It would be surprising if Trump wins his Epstein lawsuit against Murdoch and the Journal",
    "description": "President Donald Trump filed a defamation lawsuit Friday over a Wall Street Journal article related to Jeffrey Epstein.",
    "link": "https://biztoc.com/x/c2dee2e607bfd536",
    "timestamp": "2025-07-21T17:42:01Z"
  },
  {
    "title": "WATCH: Trump Jokes About Dating Young Girl ‘In 10 Years’ in Newly Resurfaced Clip",
    "description": "President Donald Trump joked about dating a young girl \"in 10 years\" in a resurfaced clip published by Entertainment Tonight.\nThe post WATCH: Trump Jokes About Dating Young Girl ‘In 10 Years’ in Newly Resurfaced Clip first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/watch-trump-jokes-about-dating-young-girl-in-10-years-in-newly-resurfaced-clip/",
    "timestamp": "2025-07-21T17:41:49Z"
  },
  {
    "title": "Guardians Dismiss Trump's Demand to Drop Woke Name, Commanders Silent",
    "description": "The Cleveland Guardians are waving off President Donald Trump's suggestion that they return their name and mascot to the Cleveland Indians.\nThe post Guardians Dismiss Trump’s Demand to Drop Woke Name, Commanders Silent appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/07/21/guardians-dismiss-trumps-demand-drop-woke-name-commanders-silent/",
    "timestamp": "2025-07-21T17:41:17Z"
  },
  {
    "title": "What was JD Vance doing at Rupert Murdoch’s ranch just before WSJ dropped Trump-Epstein bombshell? Rumors swirl",
    "description": "Vice President JD Vance met with Rupert Murdoch in Montana shortly before the Wall Street Journal published a story linking Donald Trump to Jeffrey Epstein. The report triggered Trump’s anger and a $10 billion lawsuit. The trip was unannounced and included ot…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jd-vance-rupert-murdoch-wall-street-journal-trump-epstein-letter-birthday-lawsuit-news-corp-fox-news-lachlan-murdoch-emma-tucker-truth-social-montana-defamation-fake-news/articleshow/122820251.cms",
    "timestamp": "2025-07-21T17:38:23Z"
  },
  {
    "title": "Judge Warns Trump Is Turning Into Henry II With His Dangerous Rants",
    "description": "A federal judge compared Donald Trump to Henry II for his blatant efforts to punish his administration’s critics.While overseeing a lawsuit Monday concerning the Trump administration’s crackdown on non-citizens’ pro-Palestinian speech, U.S. District Judge Wil…",
    "link": "https://newrepublic.com/post/198175/judge-warns-donald-trump-henry-ii-dangerous-rants",
    "timestamp": "2025-07-21T17:38:21Z"
  },
  {
    "title": "President Donald Trump threatens to shut down Commanders' NFL stadium deal unless team reverts to old name",
    "description": "The franchise is in the process of trying to get a $3.7 billion stadium complex built in D.C",
    "link": "https://www.cbssports.com/nfl/news/president-donald-trump-threatens-to-shut-down-commanders-nfl-stadium-deal-unless-team-reverts-to-old-name/",
    "timestamp": "2025-07-21T17:35:28Z"
  },
  {
    "title": "Cat account with 1M followers to protest JD Vance on Nantucket",
    "description": "Local activist groups will hold the “Meowtucket” rally to protest JD Vance's fundraiser visit to the island. Here's what to know.",
    "link": "https://www.boston.com/news/local-news/2025/07/21/jd-vance-nantucket-fundraiser-meowtucket-protest/",
    "timestamp": "2025-07-21T17:35:07Z"
  },
  {
    "title": "Hunter Biden Gives His Take On What Caused His ‘Horrible Debate’ Performance With Trump",
    "description": "Former president Joe Biden’s son gave his own explanation for what caused his father’s “horrible debate” against President Donald Trump in the 2024 election. Hunter Biden spoke with journalist Andrew Callaghan on his YouTube show Channel 5, admitting that “it…",
    "link": "https://www.mediaite.com/media/news/hunter-biden-gives-his-take-on-what-caused-his-horrible-debate-performance-with-trump/",
    "timestamp": "2025-07-21T17:32:49Z"
  },
  {
    "title": "Trump Should Kill Commanders Stadium Deal, but Not Because of the Team's Name",
    "description": "If Trump kills the deal over the team changing its name, he'd be doing the right thing but in perhaps the most corrupt possible way.",
    "link": "https://reason.com/2025/07/21/trump-should-kill-commanders-stadium-deal-but-not-because-of-the-teams-name/",
    "timestamp": "2025-07-21T17:32:09Z"
  },
  {
    "title": "Senate Republicans Sabotage $400 Million of Trump’s Anti-Woke Cuts",
    "description": "For a party with such distrust in the mainstream media, Republicans certainly put a lot of stock in the headlines about PEPFAR. While thousands of people would most certainly not die from the targeted cuts to the President’s Emergency Plan for AIDS Relief, Se…",
    "link": "https://freerepublic.com/focus/f-chat/4329927/posts",
    "timestamp": "2025-07-21T17:31:08Z"
  },
  {
    "title": "ABC's Martha Raddatz admits Trump border policies 'certainly working' in stemming migrant flow",
    "description": "ABC News correspondent Martha Raddatz fact-checked LA Mayor Karen Bass on Trump's immigration policies as border crossings hit record lows under the new administration.",
    "link": "https://www.foxnews.com/media/abcs-martha-raddatz-admits-trump-border-policies-certainly-working-stemming-migrant-flow",
    "timestamp": "2025-07-21T17:30:41Z"
  },
  {
    "title": "Donald Trump Had No Idea ‘Drunk Uncle’ Was Roasting Him on ‘SNL’",
    "description": "By\n Matt Solomon\n Published: July 21st, 2025",
    "link": "https://www.cracked.com/article_47472_donald-trump-had-no-idea-drunk-uncle-was-roasting-him-on-snl.html",
    "timestamp": "2025-07-21T17:30:00Z"
  },
  {
    "title": "Poll Position: Mamdani's the frontrunner, but isn't running away with NYC mayoral race just yet",
    "description": "Polls show Zohran Mamdani narrowly leading Andrew Cuomo in the NYC mayoral race, with incumbent Mayor Eric Adams and Republican Curtis Sliwa trailing in an unusually competitive election.",
    "link": "https://www.foxnews.com/politics/poll-position-mamdanis-front-runner-isnt-running-away-nyc-mayoral-race",
    "timestamp": "2025-07-21T17:29:01Z"
  },
  {
    "title": "UK sanctions 135 oil tankers in Russia's shadow fleet",
    "description": "Britain has imposed sanctions on 135 Russian shadow fleet oil tankers, targeting vessels used to evade restrictions and fund Moscow’s war in Ukraine. The move also includes sanctions on two firms linked to oil transport. The UK aims to curb Russia’s $24 billi…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/uk-sanctions-135-oil-tankers-in-russias-shadow-fleet/articleshow/122820088.cms",
    "timestamp": "2025-07-21T17:27:40Z"
  },
  {
    "title": "Hunter Unhinged:F-bomb Tirade Against Trump Deportations -- ‘Who Do You Think Washes Your Dishes!?’",
    "description": "Hunter Biden, the troubled son of former President Joe Biden, gave a big, fat “f you” to those who are upset about illegal immigration in the country, asking how people expect their hotel rooms to be cleaned. Hunter Biden ranted about those who are upset over…",
    "link": "https://freerepublic.com/focus/f-news/4329926/posts",
    "timestamp": "2025-07-21T17:27:34Z"
  },
  {
    "title": "President Trump Posts Fake Video Depicting Barack Obama’s Arrest Amid Esptein Scandal",
    "description": "President Trump shared an AI-generated video of Barack Obama being arrested along with attacks at President Obama's cabinet.",
    "link": "https://hiphopwired.com/2782331/president-trump-fake-video-barack-obama-arrest/",
    "timestamp": "2025-07-21T17:27:18Z"
  },
  {
    "title": "Border Czar Homan Pledges to ‘Flood the Zone’ of Sanctuary Cities",
    "description": "New York City is going to get more of what its left-wing politicians do not want, border czar Tom Homan says. Homan is pledging to... Read More\nThe post Border Czar Homan Pledges to ‘Flood the Zone’ of Sanctuary Cities appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/21/border-czar-homan-pledges-flood-zone-sanctuary-cities/",
    "timestamp": "2025-07-21T17:26:48Z"
  },
  {
    "title": "The Telling Emptiness of Trump’s Doodles",
    "description": "What’s interesting is how hard Trump’s drawings work to reveal nothing. You can feel him trying. The exception is his reported drawing for Epstein.",
    "link": "http://nymag.com/intelligencer/article/jerry-saltz-reviews-trumps-doodles.html",
    "timestamp": "2025-07-21T17:24:35Z"
  },
  {
    "title": "'Biggest thing that keeps Trump up at night': Dems share major plan to counter GOP",
    "description": "House Democrats are pushing back against President Donald Trump’s directive to eliminate Democratic seats in Texas by launching an aggressive redistricting strategy of their own—hiring top attorneys to help cut down the number of GOP-held seats in five key st…",
    "link": "https://www.rawstory.com/biggest-thing-that-keeps-trump-up-at-night-dems-announce-major-plan-to-counter-gop/",
    "timestamp": "2025-07-21T17:23:52Z"
  },
  {
    "title": "Obama now 'squarely in Russiagate crosshairs,' journalist Matt Taibbi claims",
    "description": "Matt Taibbi reports that Obama is now at the 'center square' of Gabbard's Russiagate investigation following the release of Trump-Russia documents.",
    "link": "https://www.foxnews.com/media/obama-now-squarely-russiagate-crosshairs-journalist-matt-taibbi-claims",
    "timestamp": "2025-07-21T17:23:26Z"
  },
  {
    "title": "James Gunn said he thought his ‘career was over’ when Disney fired him: ‘I didn’t think I was gonna make another dime in this industry’",
    "description": "\"This started out as the worst day of my life, but I actually think it's the best day of my life,\" Gunn recalled thinking on the day he was fired.",
    "link": "https://fortune.com/2025/07/21/james-gunn-disney-fired-rehired-controversy-career-over/",
    "timestamp": "2025-07-21T17:22:48Z"
  },
  {
    "title": "Trump demands end to cashless bail, says 'complete disaster' driving crime in cities, endangering police",
    "description": "President Donald Trump calls for ending cashless bail, linking criminal justice reform to crime in U.S. cities and increased attacks on law enforcement.",
    "link": "https://www.foxnews.com/politics/trump-demands-end-cashless-bail-says-complete-disaster-driving-crime-cities-endangering-police",
    "timestamp": "2025-07-21T17:22:30Z"
  },
  {
    "title": "Judge Affirms 'Americans Have a Right to Know How Taxpayer Money Is Being Spent'",
    "description": "Advocacy groups that sued U.S. President Donald Trump's administration this spring for taking offline a legally mandated website that details federal spending celebrated on Monday after a federal judge ordered the restoration of the Public Apportionments Data…",
    "link": "https://www.commondreams.org/news/russell-vought",
    "timestamp": "2025-07-21T17:22:24Z"
  },
  {
    "title": "Hunter Biden says dad Joe was on Ambien during disastrous 2024 debate with Trump",
    "description": "Hunter ripped into portrayals of his father’s decline as a conspiracy theory, and insisted that the 46th president simply “got old before our eyes.”",
    "link": "https://nypost.com/2025/07/21/us-news/hunter-biden-says-dad-joe-was-on-ambien-during-disastrous-2024-debate-with-trump/",
    "timestamp": "2025-07-21T17:21:32Z"
  },
  {
    "title": "ICE Agents Are Desperate to Quit Under Stephen Miller’s Regime",
    "description": "Federal immigration officials are looking for their own path away from the Trump administration.Veronica Cardenas, a former Immigration and Customs Enforcement prosecutor, told MSNBC Sunday that many ICE agents are “unhappy” and experiencing “very low” morale…",
    "link": "https://newrepublic.com/post/198167/stephen-miller-ice-agents-desperate-quit",
    "timestamp": "2025-07-21T17:20:43Z"
  },
  {
    "title": "U.S. Treasury’s Bessent calls for examination of Federal Reserve as an institution, determine its success",
    "description": "U.S. Treasury Secretary Scott Bessent on Monday said the entire Federal Reserve needed to be examined as an institution and whether it had been successful.\nBessent, speaking with CNBC, declined to comment on a report that he had advised President Donald Trump…",
    "link": "https://biztoc.com/x/170fd891cdec6ad6",
    "timestamp": "2025-07-21T17:19:42Z"
  },
  {
    "title": "What Is The Trisha Paytas Baby Theory, And How Does It Involve Trump?",
    "description": "\"Is it just any influential person that dies get to come reincarnated as my baby?\" Paytas said on their podcast in April.",
    "link": "https://www.newsweek.com/trisha-paytas-baby-theory-reincarnation-donaldt-trump-chronic-venous-insufficiency-2101841",
    "timestamp": "2025-07-21T17:19:40Z"
  },
  {
    "title": "A judge partially struck down Trump's travel ban",
    "description": "In a revival of a travel ban he instituted during his first term in the White House, Donald Trump announced a new version denying citizens of 12 countries from entering the U.S. for any reason at the start of June.\nIran, Somalia, Sudan, Libya, and Yemen were …",
    "link": "https://biztoc.com/x/1d3e8da76c29f64a",
    "timestamp": "2025-07-21T17:19:36Z"
  },
  {
    "title": "Trump's threats to fire Jerome Powell are unsettling the markets",
    "description": "We do not know if President Donald Trump will fire Jerome Powell from his job as chair of the Federal Reserve. We do know the financial markets do not much like the idea.\nTrump's attacks on Powell for not reducing interest rates have \"rattled financial market…",
    "link": "https://biztoc.com/x/51f5b0cb5e2990c0",
    "timestamp": "2025-07-21T17:19:34Z"
  },
  {
    "title": "5 reasons you should care about Texas' Trump-inspired redistricting scheme",
    "description": "Texas Gov. Greg Abbott speaks as then-former President Donald Trump look son during a tour to an unfinished section of the border wall on June 30, 2021 in Pharr, Texas.",
    "link": "https://biztoc.com/x/92cc158ba9957af2",
    "timestamp": "2025-07-21T17:19:19Z"
  },
  {
    "title": "It would be surprising if Trump wins his Epstein lawsuit against Murdoch and the Journal",
    "description": "President Donald Trump filed a defamation lawsuit Friday over a Wall Street Journal article related to Jeffrey Epstein.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/wall-street-journal-trump-epstein-lawsuit-rcna219968",
    "timestamp": "2025-07-21T17:18:28Z"
  },
  {
    "title": "South African president removes minister criticised by key coalition partner",
    "description": "JOHANNESBURG (Reuters) -South African President Cyril Ramaphosa has removed the higher education minister from her position, his office said on Monday, after his party's key coalition partner accused her of misconduct. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/22/south-african-president-removes-minister-criticised-by-key-coalition-partner",
    "timestamp": "2025-07-21T17:18:00Z"
  },
  {
    "title": "Nick Offerman Was So Upset About This \"Huge Mistake\" Trump Made That He Stopped By \"The Daily Show\" To Give An Emotional Speech",
    "description": "The Parks and Recreation star hit the president with a brutal reality check.",
    "link": "https://www.buzzfeed.com/benblanchet/daily-show-nick-offerman-trump-national-parks-funding-cuts",
    "timestamp": "2025-07-21T17:17:51Z"
  },
  {
    "title": "Michael Flynn floats 'military trial for Obama' despite presidential immunity",
    "description": "Disgraced former National Security Adviser Michael Flynn suggested former President Barack Obama should face a \"military trial\" after Director of National Intelligence Tulsi Gabbard accused him of a \"treasonous conspiracy\" to undermine Donald Trump's presiden…",
    "link": "https://www.rawstory.com/michael-flynn-obama/",
    "timestamp": "2025-07-21T17:15:52Z"
  },
  {
    "title": "Jeep maker Stellantis says it will lose $2.7 billion due partly to tariffs",
    "description": "Jeep maker Stellantis says it will lose $2.7 billion due partly to tariffsgo.com",
    "link": "https://abcnews.go.com/Business/jeep-maker-stellantis-lose-27-billion-due-partly/story?id=123921743",
    "timestamp": "2025-07-21T17:14:26Z"
  }
]