[
  {
    "title": "Trump and the GOP’s desperate Signal spin is getting insulting",
    "description": "The White House and their GOP allies are using every trick in the book to avoid accountability over the Signal messaging scandal.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-hegseth-waltz-signal-messaging-scandal-rcna198466",
    "timestamp": "2025-03-27T22:51:16Z"
  },
  {
    "title": "RFK Jr. Plans to Slash At LEAST 10,000 Jobs at HHS",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. is reportedly planning to reduce the department’s workforce by 10,000 positions. The National Pulse reported in mid-February that the Department of Health and Human Services (HHS) was poised to cut 5,0…",
    "link": "https://freerepublic.com/focus/f-news/4307164/posts",
    "timestamp": "2025-03-27T22:48:18Z"
  },
  {
    "title": "Why is Judge Dale Ho playing ‘Sword of Damocles’ with Eric Adams — and NYC voters?",
    "description": "The judge in Eric Adams' case asked for outside legal advice around a dismissal, why hasn't he followed the advice he asked for yet?",
    "link": "https://nypost.com/2025/03/27/opinion/whats-the-holdup-judge-ho-playing-sword-of-damocles-with-eric-adams-like-judge-merchan-did-with-trump/",
    "timestamp": "2025-03-27T22:47:57Z"
  },
  {
    "title": "Pro-Life Activists Call On Congress To ‘Defund Big Abortion’",
    "description": "'This is a top priority'",
    "link": "https://dailycaller.com/2025/03/27/pro-life-activists-congress-defund-abortion/",
    "timestamp": "2025-03-27T22:47:41Z"
  },
  {
    "title": "White House Posts Ghoulish AI Cartoon Showing Woman's Deportation",
    "description": "When Studio Ghibli-style ChatGPT creations took off this week, no one expected the Trump administration to join the trend.",
    "link": "https://www.huffpost.com/entry/white-house-deportation-ai-ghibli-animation-cartoon_n_67e5b4ace4b0455df70b41c2",
    "timestamp": "2025-03-27T22:47:12Z"
  },
  {
    "title": "New Canadian Prime Minister Carney will run in Ottawa area district as he seeks to join Parliament",
    "description": "New Canadian Prime Minister Mark Carney will run in an Ottawa area district as he seeks to join Parliament for the first time, the Liberal Party announced Saturday, a day before Carney triggers an early general election before a vote on April 28. The election…",
    "link": "https://freerepublic.com/focus/f-news/4307163/posts",
    "timestamp": "2025-03-27T22:46:15Z"
  },
  {
    "title": "Anti-abortion groups aiming to defund Planned Parenthood look to DOGE to get it done",
    "description": "Major anti-abortion groups gathered in the nation's capital on Thursday to begin a lobbying effort with Congress and President Donald Trump's administration aimed at eliminating funding for Planned Parenthood, with some calling on Elon Musk to make the organi…",
    "link": "https://www.pbs.org/newshour/politics/anti-abortion-groups-aiming-to-defund-planned-parenthood-look-to-doge-to-get-it-done",
    "timestamp": "2025-03-27T22:45:17Z"
  },
  {
    "title": "Trump Pulls Stefanik's UN Nomination to Protect GOP Majority (Billy House/Bloomberg)",
    "description": "Billy House / Bloomberg:\nTrump Pulls Stefanik's UN Nomination to Protect GOP Majority  —  President Donald Trump says he will withdraw Representative Elise Stefanik's nomination to serve as the US ambassador to the United Nations, citing Republicans' narrow h…",
    "link": "https://www.memeorandum.com/250327/p126",
    "timestamp": "2025-03-27T22:45:02Z"
  },
  {
    "title": "A Playlist for Spring",
    "description": "From the daily newsletter: a playlist to help you navigate the season’s awkward in-between days.",
    "link": "https://www.newyorker.com/newsletter/the-daily/a-playlist-for-spring",
    "timestamp": "2025-03-27T22:45:00Z"
  },
  {
    "title": "'Send Julia Louis-Dreyfus with a Veep soundtrack': J.D. Vance mocked over Greenland visit",
    "description": "J.D. Vance earned mockery this week from a former Republican lawmaker as the vice president tried to salvage the second lady's cultural trip to Greenland by refashioning it as a national security visit. President Donald Trump has pressed the idea of the Unite…",
    "link": "https://www.rawstory.com/trump-greenland-2671617204/",
    "timestamp": "2025-03-27T22:43:36Z"
  },
  {
    "title": "Albanese faces headwinds ahead of Australian election",
    "description": "The government faces the unenviable prospect of being the first which fails to win a second term in almost 100 years.",
    "link": "https://www.bbc.com/news/articles/c3d883k1rx5o",
    "timestamp": "2025-03-27T22:40:07Z"
  },
  {
    "title": "Yes, Biden admin authorized use of Signal — but not for sensitive military intel",
    "description": "The claims spread after members of President Donald Trump's White House accidentally added The Atlantic's editor-in-chief to a group chat.",
    "link": "https://www.snopes.com//news/2025/03/27/biden-authorized-signal/",
    "timestamp": "2025-03-27T22:40:00Z"
  },
  {
    "title": "Education Dept. opens investigation into California schools' gender identity law",
    "description": "The Department of Education is investigating a California law that bars public schools from disclosing to parents the sexual orientation of their children.",
    "link": "https://www.nbcnews.com/news/us-news/education-dept-opens-investigation-california-schools-gender-identity-rcna198400",
    "timestamp": "2025-03-27T22:38:55Z"
  },
  {
    "title": "Auto Tariffs: German Carmakers Face Billions in Losses – German Auto Suppliers Have 330 Locations in Mexico",
    "description": "The atomic sledgehammer that President Trump just delivered to the German auto industry simply cannot be overemphasized. A 25% tariff on imported cars and car parts completely negates hundreds of billions in pre-positioned investment dollars by German auto co…",
    "link": "https://freerepublic.com/focus/f-bloggers/4307160/posts",
    "timestamp": "2025-03-27T22:37:40Z"
  },
  {
    "title": "‘Really going to hurt’: Sticker shock likely from Trump’s auto tariffs, car biz veterans say",
    "description": "With President Donald Trump announcing a 25% tariff on all imported vehicles and auto parts, workers in the auto industry right in South Florida are reacting and voicing their concerns.",
    "link": "https://www.local10.com/news/politics/2025/03/27/really-going-to-hurt-sticker-shock-likely-from-trumps-auto-tariffs-car-biz-veterans-say/",
    "timestamp": "2025-03-27T22:37:07Z"
  },
  {
    "title": "What Would a Military Strike on Iran Mean for the Middle East?",
    "description": "An attack by the United States or Israel would have profound effects on domestic Iranian politics, the strategy of U.S. Gulf allies, and broader regional dynamics.",
    "link": "http://foreignpolicy.com/2025/03/27/trump-iran-nuclear-israel-saudi-arabia-khamenei-mbs-military-strike/",
    "timestamp": "2025-03-27T22:36:23Z"
  },
  {
    "title": "Will Trump Defund NPR And PBS? Here’s What We Know As President Attacks The Broadcasters",
    "description": "The broadcasters have faced calls for defunding across several presidential administrations, with Trump’s becoming one of the most combative against public media funding.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/03/27/will-trump-defund-npr-and-pbs-heres-what-we-know-as-president-attacks-the-broadcasters/",
    "timestamp": "2025-03-27T22:36:02Z"
  },
  {
    "title": "Putin suggests possibility of placing Ukraine under temporary administration, Russian news agencies report",
    "description": "(Reuters) - Russian President Vladimir Putin suggested Ukraine could be placed under a form of temporary administration to allow for new elections and the signature of key accords with the aim of reaching a settlement, Russian news agencies reported early on …",
    "link": "https://www.thestar.com.my/news/world/2025/03/28/putin-suggests-possibility-of-placing-ukraine-under-temporary-administration-russian-news-agencies-report",
    "timestamp": "2025-03-27T22:36:00Z"
  },
  {
    "title": "Woman Says She Was Fired After Threats From Man Who Made Trans Accusation",
    "description": "Dani Davis, a former Walmart employee, says she was fired after not properly reporting an incident in which she was falsely accused of being transgender.",
    "link": "https://www.newsweek.com/woman-says-she-was-fired-after-threats-man-who-made-trans-accusation-2051777",
    "timestamp": "2025-03-27T22:35:43Z"
  },
  {
    "title": "Oppn targets govt on US tariff threats, demands clarification on its response in Rajya Sabha",
    "description": "NEW DELHI, March 27: Opposition MPs on Thursday raised concerns over US President Donald Trump’s tariff threats, with senior Congress leader P Chidambaram asking the government to clarify India’s response, emphasising that there has been no discussion in Parl…",
    "link": "https://thehillstimes.in/national/oppn-targets-govt-on-us-tariff-threats-demands-clarification-on-its-response-in-rajya-sabha",
    "timestamp": "2025-03-27T22:35:00Z"
  },
  {
    "title": "Trump's new auto tariffs set to hit European carmakers especially hard",
    "description": "Donald Trump has repeatedly threatened to impose higher tariffs on cars and light trucks imported into the US from abroad. And every so often he has backed away, stating just recently that there would be no \"product-specific\" tariffs.\nNow, the US president ha…",
    "link": "https://biztoc.com/x/604dcd12d808785f",
    "timestamp": "2025-03-27T22:34:48Z"
  },
  {
    "title": "Zelensky Rejects Any Peace Deal That Surrenders Territory",
    "description": "Ukrainian President Volodymyr Zelensky has firmly stated that Ukraine will not surrender any territories to Russia that have been under Russian control since 2022. Following Russia’s 2022 invasion, regions such as Donetsk, Luhansk, Kherson, and Zaporizhzhia h…",
    "link": "https://freerepublic.com/focus/f-news/4307158/posts",
    "timestamp": "2025-03-27T22:34:36Z"
  },
  {
    "title": "Traders upgrade 2025 gold price forecast",
    "description": "<p>The Gold Traders Association (GTA) has upgraded its international gold price forecast for 2025 to US$3,400 an ounce from $3,200, adding the domestic price could top 50,000 baht per baht-weight in the second quarter.</p>",
    "link": "https://www.bangkokpost.com/business/general/2989597/traders-upgrade-2025-gold-price-forecast",
    "timestamp": "2025-03-27T22:34:00Z"
  },
  {
    "title": "Steve Witkoff Understands Diplomacy Usually Requires Patience, Engagement",
    "description": "The special envoy to the Middle East knows diplomacy is not about ideological purity; it's about engagement and playing long game.",
    "link": "https://www.newsweek.com/steve-witkoff-understands-diplomacy-usually-requires-patience-engagement-2051811",
    "timestamp": "2025-03-27T22:33:49Z"
  },
  {
    "title": "Trump privately vents his frustration about Michael Waltz",
    "description": "President Donald Trump expressed frustration with national security adviser Michael Waltz Thursday in his conversations with people about his decision to withdraw Rep.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-privately-vents-frustration-michael-waltz-rcna198483",
    "timestamp": "2025-03-27T22:31:09Z"
  },
  {
    "title": "Deep red state makes major announcement about income tax: 'We plant our flag'",
    "description": "Mississippi taxpayers will get significant relief with the incremental elimination of the state's income tax, which will drop from 4.7% to nothing in a few years.",
    "link": "https://www.foxnews.com/politics/deep-red-state-makes-major-announcement-about-income-tax",
    "timestamp": "2025-03-27T22:30:40Z"
  },
  {
    "title": "Trump administration blocks more than $400M in funding for Illinois health programs",
    "description": "Trump administration blocks more than $400M in funding for Illinois health programs25newsnow.com",
    "link": "https://www.25newsnow.com/2025/03/27/trump-administration-blocks-more-than-400m-funding-illinois-health-programs/",
    "timestamp": "2025-03-27T22:30:07Z"
  },
  {
    "title": "Trump team revokes $11 billion in funding for addiction, mental health care - NewsBreak",
    "description": "The Trump administration says it hopes to save $11.4 billion by freezing and revoking COVID-era grants. Addiction experts say clawing back the federal fund",
    "link": "https://www.newsbreak.com/share/3874606513380-trump-team-revokes-11-billion-in-funding-for-addiction-mental-health-care?s=a2&share_destination_id=ODg0OTM1NzEtMTc0MzExNDUzNDE4Nw%3D%3D&pd=05zJDfwt&hl=en_US&send_time=1743114534&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.12.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v7%2Cns_foryou_blend_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-v4%2Cns_foryou_recall_exp_25q2-v6%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_rank_exp_25q1-v7",
    "timestamp": "2025-03-27T22:29:45Z"
  },
  {
    "title": "U.S. auto tariffs may be less severe than initially thought, Ontario government officials say",
    "description": "Two government officials familiar with ongoing trade talks between Canada and the U.S. say President Donald Trump's impending tariffs on the auto industry may not be as severe as first expected.",
    "link": "https://www.cbc.ca/news/canada/toronto/us-auto-tariffs-may-be-12-5-per-cent-ontario-government-officials-1.7494988",
    "timestamp": "2025-03-27T22:29:15Z"
  },
  {
    "title": "Senior Trump officials ordered to preserve Signal group chat",
    "description": "A lawsuit alleged that a Signal chat used by senior White House offiicals to discuss a US strike in Yemen violated federal records laws",
    "link": "https://www.bbc.com/news/articles/c9de770q9e0o",
    "timestamp": "2025-03-27T22:29:05Z"
  },
  {
    "title": "'Want me to answer?' CNN host pushes back as Trump aide says 'Ford isn't really American'",
    "description": "Peter Navarro, a counselor to President Donald Trump, clashed with CNN's Kasie Hunt on Thursday after he attempted to claim that American automakers weren't really American. Navarro claimed that the tariffs would ultimately put more money in Americans' pocket…",
    "link": "https://www.rawstory.com/auto-tariffs/",
    "timestamp": "2025-03-27T22:27:55Z"
  },
  {
    "title": "Top Conservative strategist says Poilievre needs to urgently pivot or he will lose",
    "description": "One of the country's top Conservative strategists who just helped Ontario Premier Doug Ford win a sizable majority government says Pierre Poilievre urgently needs to make a pivot and start talking more about the issue voters care about most — the U.S. threat …",
    "link": "https://www.cbc.ca/news/politics/top-conservative-strategist-poilievre-lose-1.7495524",
    "timestamp": "2025-03-27T22:24:57Z"
  },
  {
    "title": "Lululemon sees more ‘modest’ growth in U.S. as consumers turn cautious",
    "description": "Lululemon Athletica Inc. is expecting modest growth in its U.S. business this year, with consumers pleased with the clothing retailer’s fresh offerings but cautious about the economy. Chief executive Calvin McDonald told a quarterly conference call Thursday t…",
    "link": "https://financialpost.com/pmn/lululemon-sees-more-modest-growth-in-u-s-as-consumers-turn-cautious",
    "timestamp": "2025-03-27T22:24:57Z"
  },
  {
    "title": "Top Conservative strategist says Poilievre needs to urgently pivot or he will lose",
    "description": "One of the country's top Conservative strategists who just helped Ontario Premier Doug Ford win a sizable majority government says Pierre Poilievre urgently needs to make a pivot and start talking more about the issue voters care about most — the U.S. threat …",
    "link": "https://www.cbc.ca/news/politics/top-conservative-stragegist-poilievre-lose-1.7495524",
    "timestamp": "2025-03-27T22:24:57Z"
  },
  {
    "title": "‘I want to underline the scale of the shock we could face here in Ireland’ – Finance Minister Paschal Donohoe on looming US tariffs",
    "description": "Minister for Finance Paschal Donohoe said Ireland is going to face a “significant” economic challenge should US tariffs proceed as expected from next week.",
    "link": "https://www.independent.ie/world-news/i-want-to-underline-the-scale-of-the-shock-we-could-face-here-in-ireland-finance-minister-paschal-donohoe-on-looming-us-tariffs/a1356588531.html",
    "timestamp": "2025-03-27T22:24:31Z"
  },
  {
    "title": "U.S. economy grew 2.4 percent in 4th quarter of 2024 after upgrade in growth estimate",
    "description": "It’s unclear whether the United States can sustain that growth as President Donald Trump wages trade wars, purges the federal workforce and promises mass deportations of immigrants working in the country illegally.",
    "link": "https://biztoc.com/x/fe945c9ede5dde69",
    "timestamp": "2025-03-27T22:23:44Z"
  },
  {
    "title": "Elon Musk, DOGE team offer unprecedented peak behind the curtain of Trump's cost-cutting department",
    "description": "Department of Government Efficiency (DOGE) head Elon Musk and members of the cost-cutting organization sit down for an exclusive interview on 'Special Report.'",
    "link": "https://www.foxnews.com/media/elon-musk-doge-team-offer-unprecedented-peak-behind-curtain-trumps-cost-cutting-department",
    "timestamp": "2025-03-27T22:23:24Z"
  },
  {
    "title": "Brazilian Left Welcomes Trial of Bolsonaro for Alleged Coup Attempt",
    "description": "Brazilian leftists including President Luiz Inácio Lula da Silva hailed Wednesday's unanimous ruling by a panel of the Federal Supreme Court compelling former far-right President Jair Bolsonaro and seven associates to stand trial for alleged crimes including …",
    "link": "https://www.commondreams.org/news/bolsonaro-trial",
    "timestamp": "2025-03-27T22:22:15Z"
  },
  {
    "title": "‘Fellow Travelers’ Lavender Scare Opera Withdraws From Kennedy Center In Protest Of Trump Takeover",
    "description": "The composer and lyricist of Fellow Travelers, an opera based on Thomas Mallon’s 2007 novel about the anti-gay lavender scare of the 1950s, have withdrawn the work from the 2025-26 season of the Washington National Opera at The Kennedy Center in Washington D.…",
    "link": "http://deadline.com/2025/03/fellow-travelers-opera-kennedy-center-1236352623/",
    "timestamp": "2025-03-27T22:20:52Z"
  },
  {
    "title": "Danielle Smith's fight against Trump tariffs takes her to conservative education group's donor gala",
    "description": "She'll be interviewed by the host of controversial non-profit PragerU's podcast, who asked her last Canadian guest if Canada should be the 51st state (he said yes).",
    "link": "https://www.cbc.ca/news/canada/calgary/danielle-smith-prageru-ben-shapiro-florida-gala-analysis-1.7495432",
    "timestamp": "2025-03-27T22:19:53Z"
  },
  {
    "title": "Fed's Collins says it is clear tariffs will drive inflation up near term",
    "description": "(Reuters) -Federal Reserve Bank of Boston President Susan Collins said on Thursday that Trump administration tariffs will drive up U.S. inflation but it is...",
    "link": "https://finance.yahoo.com/news/feds-collins-says-clear-tariffs-221951147.html",
    "timestamp": "2025-03-27T22:19:51Z"
  },
  {
    "title": "FTC commissioners ousted by Trump speak out after filing lawsuit to reverse firings",
    "description": "Federal Trade Commissioners Rebecca Slaughter and Alvaro Bedoya speak out after filing a lawsuit over their firing by the Trump administration.",
    "link": "https://abcnews.go.com/US/ftc-commissioners-ousted-trump-speak-after-filing-lawsuit/story?id=120231862",
    "timestamp": "2025-03-27T22:19:48Z"
  },
  {
    "title": "Cowardly Senators Anonymously Whine About J.D. Vance’s America First Foreign Policy",
    "description": "Vance's consideration of the strike displays quite a bit more nuance than the bomb-first-ask-questions-later wing of the Republican Party.",
    "link": "https://thefederalist.com/2025/03/27/cowardly-senators-anonymously-whine-about-j-d-vances-america-first-foreign-policy/",
    "timestamp": "2025-03-27T22:17:31Z"
  },
  {
    "title": "Trump administration blocks more than $400M in funding for Illinois health programs",
    "description": "Trump administration blocks more than $400M in funding for Illinois health programscapitolnewsillinois.com",
    "link": "https://capitolnewsillinois.com/news/trump-administration-blocks-more-than-400m-in-funding-for-illinois-health-programs/",
    "timestamp": "2025-03-27T22:17:04Z"
  },
  {
    "title": "U.S. economy grew 2.4 percent in 4th quarter of 2024 after upgrade in growth estimate",
    "description": "It’s unclear whether the United States can sustain that growth as President Donald Trump wages trade wars, purges the federal workforce and promises mass deportations of immigrants working in the country illegally.",
    "link": "https://www.pbs.org/newshour/economy/u-s-economy-grew-2-4-percent-in-4th-quarter-of-2024-after-upgrade-in-growth-estimate",
    "timestamp": "2025-03-27T22:16:41Z"
  },
  {
    "title": "Trump tariffs: Car prices, repair costs expected to go up",
    "description": "President Donald Trump announced new 25% auto import tariffs on Wednesday. Here's what it means for you.",
    "link": "https://www.fox6now.com/news/trump-auto-tariffs-car-price",
    "timestamp": "2025-03-27T22:15:37Z"
  },
  {
    "title": "RFK Jr. to Slash 10,000 Jobs At US Department of Health",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. announced Thursday that 10,000 full-time jobs from the Cabinet department will",
    "link": "https://ijr.com/rfk-jr-to-slash-10000-jobs-at-us-department-of-health/",
    "timestamp": "2025-03-27T22:15:25Z"
  },
  {
    "title": "Judge Hears Associated Press Suit Over White House Denial Of Access",
    "description": "Lawyers for the Associated Press (AP) urged a federal judge on Thursday to restore the news agency's reporters access to the White House press pool that covers US President Donald Trump's events.",
    "link": "https://www.ibtimes.com/judge-hears-associated-press-suit-over-white-house-denial-access-3767929",
    "timestamp": "2025-03-27T22:15:18Z"
  },
  {
    "title": "Signal Chat Caught Trump Officials Cheering Destruction Of Entire Building To Kill 1 Man (S.V. Date/HuffPost)",
    "description": "S.V. Date / HuffPost:\nSignal Chat Caught Trump Officials Cheering Destruction Of Entire Building To Kill 1 Man  —  Houthi officials said 53 people were killed in the Yemen strikes that have become notorious for Trump administration officials' use of Signal fo…",
    "link": "https://www.memeorandum.com/250327/p124",
    "timestamp": "2025-03-27T22:15:01Z"
  },
  {
    "title": "Trump Admin Pulls Research Funding To Protect Pregnant Women From Domestic Violence",
    "description": "Homicide by an abusive partner is the leading cause of death for pregnant women in the U.S. – and researchers are gutted by the sudden cuts.",
    "link": "https://www.huffpost.com/entry/trump-admin-pulls-research-funding-protection-pregnant-women-domestic-violence_n_67e5bbf0e4b0e9fab0ffb1cc",
    "timestamp": "2025-03-27T22:13:49Z"
  },
  {
    "title": "Trump's new auto tariffs set to hit European carmakers especially hard",
    "description": "Europe's auto industry is in a state of shock after the US president unveiled a 25% tariff on imported vehicles. The expanding trade war is hammering auto stocks and testing strained ties with allies.",
    "link": "https://www.dw.com/en/trumps-new-auto-tariffs-set-to-hit-european-carmakers-especially-hard/a-72060583",
    "timestamp": "2025-03-27T22:13:00Z"
  },
  {
    "title": "Trump's auto tariffs deal massive blow to German carmakers",
    "description": "Europe's auto industry is in a state of shock after the US president unveiled a 25% tariff on imported vehicles. The expanding trade war is hammering auto stocks and testing strained ties with allies.",
    "link": "https://www.dw.com/en/trumps-auto-tariffs-deal-massive-blow-to-german-carmakers/a-72060583",
    "timestamp": "2025-03-27T22:13:00Z"
  },
  {
    "title": "Judge hears Associated Press suit over White House denial of access",
    "description": "Lawyers for the Associated Press (AP) urged a federal judge on Thursday to restore the news agency’s reporters access to the White House press pool that covers US President Donald Trump’s events. AP journalists and photographers have been barred from the Oval…",
    "link": "https://www.digitaljournal.com/world/judge-hears-associated-press-suit-over-white-house-denial-of-access/article",
    "timestamp": "2025-03-27T22:12:49Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Investors digested the latest reading of the personal consumption expenditures price index.",
    "link": "https://www.cnbc.com/2025/03/27/stock-market-today-live-updates.html",
    "timestamp": "2025-03-27T22:12:14Z"
  },
  {
    "title": "Turkey crackdown on journalists and protesters",
    "description": "After days of protests following the arrest of Istanbul Mayor Ekrem Imamoglu, Turkish authorities have arrested almost 1,900 people including protesters and journalists. Also on the programme, US President Donald Trump said he would target imported vehicles a…",
    "link": "https://www.bbc.co.uk/programmes/w172zb9fxppcpsq",
    "timestamp": "2025-03-27T22:11:00Z"
  },
  {
    "title": "The lawsuits blocking Trump’s agenda, explained in 2 charts",
    "description": "President Donald Trump came into office with plans to enact his agenda at breakneck speed, and to some extent, it’s working. Less than 100 days into his second term, Trump has already issued 99 executive orders — a “shock and awe” approach meant to overwhelm …",
    "link": "https://www.vox.com/politics/406236/lawsuit-trump-courts-judiciary-executive-order",
    "timestamp": "2025-03-27T22:10:49Z"
  },
  {
    "title": "The reality of Donald Trump crashes into the federal election",
    "description": "The first few days of the 2025 federal campaign bore a certain resemblance to a normal election. The norm-defying reality of Donald Trump finally intruded on Wednesday.",
    "link": "https://www.cbc.ca/news/politics/trump-carney-poilievre-analysis-1.7495490",
    "timestamp": "2025-03-27T22:09:01Z"
  },
  {
    "title": "Trump threatens the Fighting Irish with targeted pharma tariffs. Game on?",
    "description": "Tariffs will trigger some job losses, and impact future investment, but Ireland’s strategic value remains solid - ‘Pharma isn’t ditching Ireland anytime soon.’",
    "link": "https://www.euractiv.com/section/health-consumers/news/trump-threatens-the-fighting-irish-with-targeted-pharma-tariffs-game-on/",
    "timestamp": "2025-03-27T22:08:40Z"
  },
  {
    "title": "'Old' relationship with America is 'over': Canadians slash US travel",
    "description": "The Canadian Prime Minister and the Canadian people are expressing anger and frustration with Donald Trump, following months of attacks, and now threatened as well as actual double-digit and even triple-digit tariffs, by the U.S. President on America’s northe…",
    "link": "https://www.rawstory.com/mark-carney-2671617389/",
    "timestamp": "2025-03-27T22:08:21Z"
  },
  {
    "title": "US judge orders Trump admin to save ‘Signalgate’ chat",
    "description": "A US judge ordered Donald Trump’s administration on Thursday to preserve messages from a chat group used by top national security officials to discuss plans for an attack on Yemen’s Huthi rebels. The ruling adds to the pressure on the White House after the At…",
    "link": "https://www.digitaljournal.com/world/us-judge-orders-trump-admin-to-save-signalgate-chat/article",
    "timestamp": "2025-03-27T22:07:20Z"
  },
  {
    "title": "A Glimmer of Hope in Difficult Ukraine Peace Talks?",
    "description": "The United States’ work to bring peace to Ukraine is proving to be difficult, as Americans attempt to bring about a ceasefire in the Black... Read More\nThe post A Glimmer of Hope in Difficult Ukraine Peace Talks? appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/27/glimmer-hope-difficult-ukraine-peace-talks/",
    "timestamp": "2025-03-27T22:06:48Z"
  },
  {
    "title": "How a slice of Trump's coalition is viewing his presidency: From the Politics Desk",
    "description": "In today’s newsletter, we bring you the findings from our new focus group of Black men who voted for Donald Trump in 2024.",
    "link": "https://www.nbcnews.com/politics/politics-news/slice-trumps-coalition-viewing-presidency-politics-desk-rcna198479",
    "timestamp": "2025-03-27T22:06:25Z"
  },
  {
    "title": "Iran Shows Off ‘Underground Missile City’ Stuffed with Advanced Weapons",
    "description": "The Iranian military posted a video Tuesday showing off a massive “underground missile city” packed full of expensive weapons.\nThe post Iran Shows Off ‘Underground Missile City’ Stuffed with Advanced Weapons appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/03/27/iran-shows-off-underground-missile-city-stuffed-advanced-weapons/",
    "timestamp": "2025-03-27T22:06:06Z"
  },
  {
    "title": "Trump withdraws Rep. Elise Stefanik's nomination for UN ambassador, citing tight GOP House margin (Associated Press)",
    "description": "Associated Press:\nTrump withdraws Rep. Elise Stefanik's nomination for UN ambassador, citing tight GOP House margin  —  President Donald Trump announced Thursday that he was pulling Rep. Elise Stefanik's nomination to be U.S. ambassador to the United Nations,…",
    "link": "https://www.memeorandum.com/250327/p121",
    "timestamp": "2025-03-27T22:05:01Z"
  },
  {
    "title": "Fox News Becomes a Haven for Blue Chip Advertisers Amid Post-Election Ratings Surge",
    "description": "In the wake of the 2024 election, Fox News has found itself a magnet for major advertisers, pulling in revenue from 125 major companies, according to a report from the Financial Times. While cable news typically sees viewers tune out following contentious nat…",
    "link": "https://www.mediaite.com/news/fox-news-becomes-a-haven-for-blue-chip-advertisers-amid-post-election-ratings-surge/",
    "timestamp": "2025-03-27T22:02:52Z"
  },
  {
    "title": "‘We Are Ecstatic’: Union Boss Who Backed Harris Says He’s Thrilled With One Major Trump Policy",
    "description": "United Auto Workers President Shawn Fain praised President Donald Trump in the wake of Trump’s announcement of tariffs on imported automobiles and auto parts.",
    "link": "https://dailycaller.com/2025/03/27/we-are-ecstatic-union-boss-who-backed-harris-says-hes-thrilled-with-one-major-trump-policy/",
    "timestamp": "2025-03-27T22:01:56Z"
  },
  {
    "title": "Trump is interested in joining the Commonwealth. It’s not up to him – or even the King",
    "description": "Donald Trump has suggested the US might be interested in joining the Commonwealth. But would Trump’s America be welcome?",
    "link": "https://theconversation.com/trump-is-interested-in-joining-the-commonwealth-its-not-up-to-him-or-even-the-king-253217",
    "timestamp": "2025-03-27T22:01:49Z"
  },
  {
    "title": "Your new car could cost thousands more thanks to Trump’s auto tariffs—and GM and Ford could lose billions, analyst warns",
    "description": "President Donald Trump’s 25% tax on imported cars, light trucks, and auto parts is likely to drive up prices at a time when many Americans already struggle to afford a new set of wheels. The tariffs will also force car companies to rethink what cars they make…",
    "link": "https://biztoc.com/x/f0f8dc06dee95d89",
    "timestamp": "2025-03-27T22:01:30Z"
  },
  {
    "title": "Putin: Trump 'sincerely' wants to end Ukraine conflict",
    "description": "Russian President Vladimir Putin expressed confidence on Thursday that his United States counterpart Donald Trump genuinely wants to bring the war in Ukraine to an end.\"In my opinion, the newly electe...",
    "link": "https://biztoc.com/x/dfff0fbcaaa93fff",
    "timestamp": "2025-03-27T22:01:28Z"
  },
  {
    "title": "With 25% tariffs on imported autos, carmakers could face higher costs and lower sales",
    "description": "WASHINGTON — President Donald Trump said he was placing 25% tariffs on auto imports, a move the White House claims would foster domestic manufacturing but could also put a financial squeeze on automakers that depend on global supply chains.\n“This will continu…",
    "link": "https://biztoc.com/x/2a0bd6ba6de5b099",
    "timestamp": "2025-03-27T22:01:19Z"
  },
  {
    "title": "'Snow White' actress Rachel Zegler's old tweet cursing out Trump resurfaces as film flounders",
    "description": "An old tweet has resurfaced where actress Rachel Zegler had used profanity and condemned Donald Trump, now going viral once again online shortly after her film's opening weekend.",
    "link": "https://www.foxnews.com/media/snow-white-actress-rachel-zeglers-old-tweet-cursing-out-trump-resurfaces-film-flounders",
    "timestamp": "2025-03-27T22:00:53Z"
  },
  {
    "title": "Trump's new 25% tariff is a 'huge deal' for auto industry in Louisville, experts say",
    "description": "The United States last year imported nearly 8 million cars and light trucks worth $244 billion.",
    "link": "https://www.wdrb.com/news/business/trumps-new-25-tariff-is-a-huge-deal-for-auto-industry-in-louisville-experts-say/article_c5e5129a-8361-4353-b2d6-32510f9385a6.html",
    "timestamp": "2025-03-27T22:00:46Z"
  },
  {
    "title": "Man accused of setting fire to Tesla vehicles in Las Vegas arrested, police say",
    "description": "He was taken into the custody of the federal government Thursday.",
    "link": "https://www.bostonherald.com/2025/03/27/tesla-vandalism-vegas/",
    "timestamp": "2025-03-27T22:00:10Z"
  },
  {
    "title": "Trump and the Fate of the Dollar",
    "description": "This post Trump and the Fate of the Dollar appeared first on Daily Reckoning.\nJim Rickards explores Trump’s possible “Mar-a-Lago Accord” and what it means for the dollar.\nThe post Trump and the Fate of the Dollar appeared first on Daily Reckoning.",
    "link": "https://dailyreckoning.com/trump-and-the-fate-of-the-dollar/",
    "timestamp": "2025-03-27T22:00:09Z"
  },
  {
    "title": "Canada's prime minister says nothing off the table in response to Trump's tariffs",
    "description": "OTTAWA: Canada will wait until next week to strike back against the latest US threat of tariffs and nothing is off the table regarding possible countermeasures, Prime Minister Mark Carney said on Thursday (Mar 27).",
    "link": "https://www.channelnewsasia.com/world/canada-prime-minister-mark-carney-response-trump-tariffs-5028961",
    "timestamp": "2025-03-27T21:59:00Z"
  },
  {
    "title": "Canada's prime minister says nothing off the table in response to Trump's tariffs",
    "description": "OTTAWA: Canada will wait until next week to strike back against the latest US threat of tariffs and nothing is off the table regarding possible countermeasures, Prime Minister Mark Carney said on Thursday (Mar 27).",
    "link": "https://www.channelnewsasia.com/world/canada-prime-minister-mark-carney-response-trump-tariffs-5028961",
    "timestamp": "2025-03-27T21:59:00Z"
  },
  {
    "title": "Canada's prime minister says nothing off the table in response to Trump's tariffs",
    "description": "OTTAWA: Canada will wait until next week to strike back against the latest US threat of tariffs and nothing is off the table regarding possible countermeasures, Prime Minister Mark Carney said on Thursday (Mar 27). Carney, warning Canadians that tough times l…",
    "link": "https://www.channelnewsasia.com/asia/canadas-prime-minister-says-nothing-table-response-trumps-tariffs-5028961",
    "timestamp": "2025-03-27T21:59:00Z"
  },
  {
    "title": "The disturbing thread that ties together Trump’s major moves so far",
    "description": "Perhaps the biggest common theme of Donald Trump’s second term is that his administration has aggressively used federal power to punish those deemed to be its — or his — enemies. Some foreign students who criticized Israel have had their visas revoked and hav…",
    "link": "https://www.vox.com/politics/406186/trump-retribution-targeting-israel-critics-biglaw-weissmann",
    "timestamp": "2025-03-27T21:58:55Z"
  },
  {
    "title": "Kristi Noem’s El Salvador Prison Photo Op Might Have Violated the Geneva Convention",
    "description": "Department of Homeland Security Secretary Kristi Noem's photo op in an El Salvadoran prison drew swift backlash online, but some observers are pointing out that it may have also violated the Geneva Convention.\nThe post Kristi Noem’s El Salvador Prison Photo O…",
    "link": "https://www.mediaite.com/opinion/kristi-noems-el-salvador-prison-photo-op-might-have-violated-the-geneva-convention/",
    "timestamp": "2025-03-27T21:58:15Z"
  },
  {
    "title": "Behar: Trump Needs to Stop Blaming Biden — 'That Ship Has Sailed'",
    "description": "Joy Behar demanded on ABC's \"The View\" that President Donald Trump stop blaming former President Joe Biden for problems.\nThe post Behar: Trump Needs to Stop Blaming Biden — ‘That Ship Has Sailed’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/03/27/behar-trump-needs-to-stop-blaming-biden-that-ship-has-sailed/",
    "timestamp": "2025-03-27T21:58:08Z"
  },
  {
    "title": "Immigration, economy top Quebec premier's federal election wish list",
    "description": "Quebec Premier François Legault isn't playing political favourites and remained tightlipped about who he'd like to see win the federal election. Still, he has a list of demands he wants the federal parties to consider.",
    "link": "https://www.cbc.ca/news/canada/montreal/quebec-legault-federal-election-demands-1.7494762",
    "timestamp": "2025-03-27T21:56:45Z"
  },
  {
    "title": "'Much more expensive': What do Trump's auto tariffs mean for car prices?",
    "description": "'Much more expensive': What do Trump's auto tariffs mean for car prices?go.com",
    "link": "https://abcnews.go.com/Business/expensive-trumps-auto-tariffs-car-prices/story?id=120210735",
    "timestamp": "2025-03-27T21:56:05Z"
  },
  {
    "title": "Citing Trump's Push for Ethnic Cleansing, Sanders Says Congress 'Must Act to Block' Arms Sales to Israel",
    "description": "Sen. Bernie Sanders of Vermont announced Thursday he plans to force votes in the U.S. Senate next week on two joint resolutions of disapproval aimed at blocking proposed arms sales from the United States to Israel, citing U.S. President Trump's recent proposa…",
    "link": "https://www.commondreams.org/news/sandes-resolutions-of-disapproval-israel",
    "timestamp": "2025-03-27T21:55:10Z"
  },
  {
    "title": "What could happen on March 29 when Tesla Takedown protests are planned? Donald Trump is watching as some protesters could be sent to El Salvador's dreaded jail",
    "description": "Global Tesla Takedown protests face government pushback, legal risks, and corporate influence concerns. Explore the clash over free speech, privacy, and Musk’s role.",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-could-happen-on-march-29-when-tesla-takedown-protests-are-planned-donald-trump-is-watching-as-some-protesters-could-be-sent-to-el-salvadors-dreaded-jail/articleshow/119617018.cms",
    "timestamp": "2025-03-27T21:54:38Z"
  },
  {
    "title": "Greenland forms new unity government on eve of JD Vance visit",
    "description": "Four of the five parties elected to Greenland’s parliament two weeks ago have agreed to band together in a broad coalition.",
    "link": "https://www.politico.eu/article/greenland-unity-government-jd-vance-visit-donald-trump/",
    "timestamp": "2025-03-27T21:53:13Z"
  },
  {
    "title": "Trump White House invites a bloc of conservative podcasters as a jab at legacy media",
    "description": "On Thursday, several conservative podcasters were invited to the White House to participate in Podcast Row, an event meant to engage alternative media by granting them hours of unprecedented access to senior Trump Administration officials. The White House int…",
    "link": "https://www.theverge.com/policy/637890/trump-white-house-podcast-row",
    "timestamp": "2025-03-27T21:53:08Z"
  },
  {
    "title": "DHS Staffer Punished After Accidentally Adding Journalist to Email: Report",
    "description": "Unlike Waltz and Hegseth, who remain in their positions, the Homeland Security staffer is being disciplined, NBC News reported.",
    "link": "https://www.newsweek.com/dhs-staffer-punished-after-accidentally-adding-journalist-email-report-2051800",
    "timestamp": "2025-03-27T21:52:50Z"
  },
  {
    "title": "Judge orders Trump administration to preserve Signal texts on Houthi attack",
    "description": "Judge James Boasberg issued a temporary restraining order against deleting any messages in the controversial chat.",
    "link": "https://www.aljazeera.com/news/2025/3/27/judge-orders-trump-administration-to-preserve-signal-texts-on-houthi-attack",
    "timestamp": "2025-03-27T21:52:37Z"
  },
  {
    "title": "World Insights: Europe pushes back as Trump slaps tariffs on imported cars",
    "description": "BERLIN, March 27 (Xinhua) -- U.S. President Donald Trump on Wednesday turned his earlier threat into action by signing an executive order imposing 25 percent tariffs on all imported vehicles. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/28/world-insights-europe-pushes-back-as-trump-slaps-tariffs-on-imported-cars",
    "timestamp": "2025-03-27T21:51:00Z"
  },
  {
    "title": "Trump Proposes 25 Percent Automobile Tariffs",
    "description": "The 25 percent levy is expected to come one day after sweeping “reciprocal” duties go into effect.",
    "link": "http://foreignpolicy.com/2025/03/27/trump-auto-tariffs-cars-trade-war-reciprocal/",
    "timestamp": "2025-03-27T21:50:59Z"
  },
  {
    "title": "Trump’s Proposed Auto Tariffs Plunge Wall Street, Foreign Markets Into Turmoil",
    "description": "The 25 percent levy is expected to come one day after sweeping “reciprocal” duties go into effect.",
    "link": "http://foreignpolicy.com/2025/03/27/trump-auto-tariffs-cars-trade-war-reciprocal-china-canada-eu-mexico/",
    "timestamp": "2025-03-27T21:50:55Z"
  },
  {
    "title": "What IT Security?",
    "description": "What IT Security?\n \nAuthored by Karl Denninger via Market-Ticker.org,\nOh boy....\nPresident Donald Trump revealed that a staffer with national security advisor Mike Waltz's office included the editor-in-chief of the Atlantic in a Signal group chat with senior …",
    "link": "https://biztoc.com/x/009fb7b1ad8cc1ad",
    "timestamp": "2025-03-27T21:50:10Z"
  },
  {
    "title": "Republicans Vote to Let Banks Screw Over Working Americans",
    "description": "The Consumer Financial Protection Bureau (CFPB) instituted a $5 cap on overdraft fees under President Joe Biden. Thankfully for major banking institutions — and unfortunately for working Americans — Donald Trump won the presidential election last November, an…",
    "link": "https://biztoc.com/x/8e189a1cc70c7f49",
    "timestamp": "2025-03-27T21:50:08Z"
  },
  {
    "title": "Republican Wants to Take Tariff Power Away From Donald Trump",
    "description": "\"I think we should look back and maybe restore the power back to Congress,\" Rep. Don Bacon said about presidential tariff authority.",
    "link": "https://biztoc.com/x/6c8170edfa1f2a74",
    "timestamp": "2025-03-27T21:49:59Z"
  },
  {
    "title": "Copyright questions loom as ChatGPT's Ghibli-style images go viral",
    "description": "The release of the latest image generator on OpenAI's ChatGPT has triggered an online flood of memes featuring images done in the style of Studio Ghibli, the Japanese studio behind classic animated films like &quot;My Neighbor Totoro&quot; and &quot;Princess …",
    "link": "https://japantoday.com/category/tech/copyright-questions-loom-as-chatgpt%27s-ghibli-style-images-go-viral",
    "timestamp": "2025-03-27T21:49:38Z"
  },
  {
    "title": "Judge in crosshairs of Trump deportation case orders preservation of Signal messages",
    "description": "Judge James Boasberg ordered all Signal chats linked to a planned military strike in Yemen preserved after American Oversight filed a records lawsuit.",
    "link": "https://www.foxnews.com/politics/judge-boasberg-crosshairs-trump-deportation-case-orders-preservation-signal-messages",
    "timestamp": "2025-03-27T21:48:58Z"
  },
  {
    "title": "Make measles and e coli great again",
    "description": "Preventing diseases, a safe food supply — these are the demons you must slay if you want to be Donald Trump’s Director of Health and Human Services: The Trump administration announced on Thursday that it was laying off 10,000 employees at the Health and Human…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/make-measles-and-e-coli-great-again",
    "timestamp": "2025-03-27T21:48:00Z"
  }
]