[
  {
    "title": "Jordon Hudson Supports Boyfriend Bill Belichick on the Field as He Coaches UNC Football Practice",
    "description": "Jordon Hudson attended a UNC football practice with her boyfriend Bill Belichick on April 12. She was seen wearing a snakeskin trench coat and white heeled boots while standing beside him on the field.",
    "link": "https://people.com/jordon-hudson-supports-bill-belichick-at-unc-football-practice-11714944",
    "timestamp": "2025-04-14T18:49:00Z"
  },
  {
    "title": "U.S.-Born Attorney Says She Was Told To 'Immediately' Self-Deport In DHS Email",
    "description": "“It is time for you to leave the United States,” read the email reportedly sent to Nicole Micheroni, who is questioning how many others it was inappropriately sent to.",
    "link": "https://www.huffpost.com/entry/american-attorney-nicole-micheroni-told-self-deport-dhs_n_67fd03cbe4b0b88ef3cc7bba",
    "timestamp": "2025-04-14T18:48:39Z"
  },
  {
    "title": "Why Beijing Is Standing Up to Trump",
    "description": "Chinese leaders have their pride, too.",
    "link": "http://foreignpolicy.com/2025/04/14/china-trump-trade-war-xi/",
    "timestamp": "2025-04-14T18:48:35Z"
  },
  {
    "title": "A Donald Trump ally has a suggestion for Warner Bros. Discovery: Why don't you pay us or give us a TV show?",
    "description": "Donald Trump is suing some media companies. But he's also open to deals with them, like one with WBD that could include money, programming, or both.",
    "link": "https://www.businessinsider.com/donald-trump-warner-bros-discovery-ally-wants-show-pay-2025-04",
    "timestamp": "2025-04-14T18:47:15Z"
  },
  {
    "title": "Russia Could Help China Resist Trump's Trade War",
    "description": "Russia was spared Trump's tariffs—prompting questions about economic opportunities for China.",
    "link": "https://www.newsweek.com/china-russia-trade-boom-trump-us-tariffs-loophole-2059337",
    "timestamp": "2025-04-14T18:46:59Z"
  },
  {
    "title": "New malware ‘ResolverRAT’ targets healthcare, pharmaceutical firms",
    "description": "New malware ‘ResolverRAT’ is targeting healthcare and pharmaceutical firms, using advanced capabilities to steal sensitive data. Morphisec researchers discovered a new malware dubbed ‘ResolverRAT’ that is targeting healthcare and pharmaceutical firms, using a…",
    "link": "https://securityaffairs.com/176537/malware/new-malware-resolverrat-targets-healthcare-pharmaceutical-firms.html",
    "timestamp": "2025-04-14T18:46:27Z"
  },
  {
    "title": "Josh Shapiro survives deadly arson attack—now the left must own the culture of political violence it created",
    "description": "Sunday’s arson attack on Pennsylvania Gov. Josh Shapiro is the latest in an epidemic of political violence that’s been plaguing the nation for half a decade — an epidemic driven by the left.…",
    "link": "https://nypost.com/2025/04/14/opinion/josh-shapiro-survives-fire-assassination-attemptthe-left-must-own-the-culture-of-political-violence-it-created/",
    "timestamp": "2025-04-14T18:45:47Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash (Josh Boak/Associated Press)",
    "description": "Josh Boak / Associated Press:\nTrump considers pausing his auto tariffs as the world economy endures whiplash  —  President Donald Trump on Monday suggested that he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to…",
    "link": "https://www.memeorandum.com/250414/p79",
    "timestamp": "2025-04-14T18:45:01Z"
  },
  {
    "title": "The unreality of reality TV: How competition shows influence U.S. politics and shape views about economic inequality",
    "description": "It was about five years ago that I first started noticing the name Eunji Kim on some interesting research. Best dissertation, best paper, best article — she seemed to be winning them all. In her (still relatively brief) career, she’s written about everything …",
    "link": "https://www.niemanlab.org/2025/04/the-unreality-of-reality-tv-how-competition-shows-influence-u-s-politics-and-shape-views-about-economic-inequality/",
    "timestamp": "2025-04-14T18:44:40Z"
  },
  {
    "title": "Mark Zuckerberg, serial witness, takes the hot seat again",
    "description": "Zuckerberg on Monday again took the hot seat, this time as the marquee witness in the Federal Trade Commission's landmark lawsuit accusing Meta of breaking antitrust law. Regulators sued the company in the U.S. District Court for the District of Columbia over…",
    "link": "https://economictimes.indiatimes.com/tech/technology/mark-zuckerberg-serial-witness-takes-the-hot-seat-again/articleshow/120289238.cms",
    "timestamp": "2025-04-14T18:44:24Z"
  },
  {
    "title": "‘Loser behavior’: Charli XCX called out for Coachella sash that fans say disrespected Green Day",
    "description": "Pop star Charli XCX is catching heat after some took her \"Miss Should Be Headliner\" sash as shade for this year's Coachella star, Green Day. Photographers caught the \"Boom Clap\" singer in the sash at the afterparty as she danced by the DJ. She posted those ph…",
    "link": "https://www.dailydot.com/culture/charli-xcx-green-day-coachella/",
    "timestamp": "2025-04-14T18:44:00Z"
  },
  {
    "title": "Auto Stocks Rise On Trump's Comments About Supporting U.S. Car Companies",
    "description": "Shares of major automakers such as Ford Motors Inc. (NYSE:F), General Motos Inc. (NYSE:GM) and Stellantis Inc. (NYSE:STLA) are trading higher Monday after President Donald Trump indicated he wants to support car companies navigating recent trade changes.\nWhat…",
    "link": "https://biztoc.com/x/ff995d3dad42f197",
    "timestamp": "2025-04-14T18:43:04Z"
  },
  {
    "title": "Brexit ... but make it American",
    "description": "Nearly a decade after Brexit, the British economy is still feeling the fallout. Now, President Donald Trump seems to be pulling from a similar playbook — with tariffs that could reshape the U.S. economy in eerily familiar ways. (Shocker, we know!) But first: …",
    "link": "https://www.marketplace.org/episode/2025/04/14/is-this-our-brexit",
    "timestamp": "2025-04-14T18:42:47Z"
  },
  {
    "title": "Rate cuts ahead but don’t bet on a double just yet",
    "description": "There's almost no chance the RBA will keep rates on hold in May, but the biggest challenge comes from Donald Trump's erratic behaviour while financial markets have descended into a state of almost constant turmoil.",
    "link": "https://www.abc.net.au/news/2025-04-15/analysis-verrender-america-first-rate-cuts/105175844",
    "timestamp": "2025-04-14T18:41:50Z"
  },
  {
    "title": "Trump blames Zelenskyy for starting Ukraine war - a day after dozens killed in Russian missile strikes",
    "description": "Donald Trump has questioned Volodymyr Zelenskyy's competence and suggested Ukraine started the war against Russia which is \"20 times\" its size.",
    "link": "https://news.sky.com/story/donald-trump-blames-volodymyr-zelenskyy-for-starting-ukraine-war-a-day-after-dozens-killed-in-russian-missile-strikes-13349001",
    "timestamp": "2025-04-14T18:41:00Z"
  },
  {
    "title": "Trump urges the FCC to punish ‘60 Minutes’ over reports on Greenland and Ukraine | CNN Business",
    "description": "President Trump has a “hope” for his Federal Communications Commission: that the agency will punish CBS for airing “60 Minutes” reports he doesn’t like.",
    "link": "https://www.cnn.com/2025/04/14/media/trump-fcc-60-minutes-cbs/index.html",
    "timestamp": "2025-04-14T18:40:43Z"
  },
  {
    "title": "The dangers of performance-based layoffs",
    "description": "Workers laid off by Meta in its recent cull that publicly targeted low performers were quick to fight back. Find out more here",
    "link": "https://financialpost.com/financial-times/the-dangers-of-performance-based-layoffs",
    "timestamp": "2025-04-14T18:39:50Z"
  },
  {
    "title": "‘White Lotus’ Star Aimee Lou Wood Blasts ‘SNL’ for ‘Mean & Unfunny’ Sketch",
    "description": "Aimee Lou Wood is not a fan of the way she was portrayed on this week’s “Saturday Night Live.”\n During a parody sketch called “White POTUS,” the sketch comedy show replaced characters from “The White Lotus” with President Donald Trump, his family, and other p…",
    "link": "https://extratv.com/2025/04/14/white-lotus-star-aimee-lou-wood-blasts-snl-for-mean-and-unfunny-sketch/",
    "timestamp": "2025-04-14T18:39:47Z"
  },
  {
    "title": "Trump to Host Special Easter Service at White House, Top Preachers to Participate",
    "description": "President Donald Trump will be hosting an Easter dinner and worship service at the White House on Wednesday.",
    "link": "https://www.westernjournal.com/trump-host-special-easter-service-white-house-top-preachers-participate/",
    "timestamp": "2025-04-14T18:39:35Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash",
    "description": "President Donald Trump says he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.",
    "link": "https://www.clickondetroit.com/business/2025/04/14/trump-considers-pausing-his-auto-tariffs-as-the-world-economy-endures-whiplash/",
    "timestamp": "2025-04-14T18:39:03Z"
  },
  {
    "title": "Cuomo lands key endorsement as comeback bid for NYC mayor heats up",
    "description": "Former New York Gov. Andrew Cuomo is showcasing the backing of two powerful labor unions as he runs for mayor of the nation's most populous city.",
    "link": "https://www.foxnews.com/politics/cuomo-lands-key-endorsement-comeback-bid-nyc-mayor-heats-up",
    "timestamp": "2025-04-14T18:38:10Z"
  },
  {
    "title": "If Donald Trump Weighs 224 Lbs., I'm Jean Shrimpton",
    "description": "Dr. Sean Barbadella earned his salary this weekend with the release of the president's annual exam.",
    "link": "https://www.esquire.com/news-politics/politics/a64478330/trump-presidential-annual-health-physical-results/",
    "timestamp": "2025-04-14T18:37:00Z"
  },
  {
    "title": "Harvard Announces It Will Defy Trump Order to Cut DEI Programs and Expel Pro-Palestinian Protestors",
    "description": "Harvard University announced it will not comply with orders from Donald Trump to cut DEI programs and expel students in involved in pro-Palestinian protests.\nThe post Harvard Announces It Will Defy Trump Order to Cut DEI Programs and Expel Pro-Palestinian Pro…",
    "link": "https://www.mediaite.com/news/harvard-announces-it-will-defy-trump-order-to-cut-dei-programs-and-expel-pro-palestinian-protestors/",
    "timestamp": "2025-04-14T18:36:49Z"
  },
  {
    "title": "'Hurts me so much': How Trump caused chaos in the K-beauty world",
    "description": "American beauty founders are warning prices are likely to go up as the global skincare and cosmetics industry comes to terms with Donald Trump's new tariff regime.",
    "link": "https://www.abc.net.au/news/2025-04-15/kbeauty-and-global-skincare-industry-reeling-from-tariff-shock/105153034",
    "timestamp": "2025-04-14T18:36:08Z"
  },
  {
    "title": "Man charged for arson attacks at Tesla dealership, New Mexico GOP office",
    "description": "Man charged for arson attacks at Tesla dealership, New Mexico GOP officego.com",
    "link": "https://abcnews.go.com/US/man-charged-arson-attacks-tesla-dealership-new-mexico/story?id=120719532",
    "timestamp": "2025-04-14T18:35:28Z"
  },
  {
    "title": "Agbakoba proposes N500tn budget for 2027, demands sweeping reforms",
    "description": "Legal luminary and former President of the Nigerian Bar Association, Dr. Olisa Agbakoba, SAN, has proposed a N500 trillion national budget for 2027, asserting that such an ambitious fiscal goal is achievable only if “Nigeria undergoes deep-rooted political an…",
    "link": "https://punchng.com/agbakoba-proposes-n500tn-budget-for-2027-demands-sweeping-reforms/",
    "timestamp": "2025-04-14T18:34:13Z"
  },
  {
    "title": "Resellers may be sitting on costly pile of regret after US smartphone shopping spree",
    "description": "Q1 sector growth unlikely to survive current trade policy Profiteering resellers stateside filled up on smartphone inventory in calendar Q1 before the scheduled imposition of US tariffs, which have rocked global stock prices and US Treasury bonds since April …",
    "link": "https://www.theregister.com/2025/04/14/smartphone_q1_2025/",
    "timestamp": "2025-04-14T18:34:06Z"
  },
  {
    "title": "Harvard Won’t Comply With Trump’s Demands to Dismantle DEI, Limit Protests",
    "description": "Harvard's endowment is $53.2 billion. It doesn't need my money.\nThe post Harvard Won’t Comply With Trump’s Demands to Dismantle DEI, Limit Protests first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/harvard-wont-comply-with-trumps-demands-to-dismantle-dei-limit-protests/",
    "timestamp": "2025-04-14T18:33:41Z"
  },
  {
    "title": "Trump Blames Zelensky For 'Millions' Of Deaths In Russian Invasion",
    "description": "US President Donald Trump resumed his attempts Monday to blame Ukrainian leader Volodymyr Zelensky for Russia's invasion, falsely accusing him of responsibility for \"millions\" of deaths.",
    "link": "https://www.ibtimes.com/trump-blames-zelensky-millions-deaths-russian-invasion-3770042",
    "timestamp": "2025-04-14T18:33:16Z"
  },
  {
    "title": "Liberty Justice Center and I File Lawsuit Challenging Trump's \"Liberation Day\" Tariffs",
    "description": "President Donald Trump signed two executive orders on April 2 instituting tariffs on a wide range of countries. ( Andrew Leyden/ZUMAPRESS/Newscom) \n \nToday, the Liberty Justice Center and I filed a lawsuit in the Court of International Trade challenging the l…",
    "link": "https://biztoc.com/x/3cca2501dabb2914",
    "timestamp": "2025-04-14T18:32:08Z"
  },
  {
    "title": "13 potential 2028 presidential candidates for both major parties",
    "description": "Since the post-1968 reforms that opened presidential nominations to binding primaries and caucuses, there have only been four cycles that didn't feature an incumbent or former president. But assuming that President Donald Trump doesn't seek an unconstitutiona…",
    "link": "https://biztoc.com/x/fa29e3f67c26911c",
    "timestamp": "2025-04-14T18:31:53Z"
  },
  {
    "title": "These abortion abolitionists want women who get abortion to face criminal charges",
    "description": "Bills introduced in at least 12 states this year would allow prosecutors to charge those who have abortions with homicide.",
    "link": "https://www.bostonherald.com/2025/04/14/anti-abortion-criminalization/",
    "timestamp": "2025-04-14T18:31:00Z"
  },
  {
    "title": "Trump Brags That He's Got the “Best Relationship” With the “Coolest Dictator in the World”",
    "description": "During a White House meeting with the president, El Salvador's Nayib Bukele refused to return the Maryland father who was accidentally deported and detained in his draconian prison.",
    "link": "https://www.vanityfair.com/news/story/trump-brags-that-hes-got-the-best-relationship-with-the-coolest-dictator-in-the-world",
    "timestamp": "2025-04-14T18:30:56Z"
  },
  {
    "title": "James Carville urges Democrats to avoid distractions, use Trump's economic 'chaos' against him",
    "description": "James Carville urged Democrats to avoid distractions as they work to win back an advantage with voters on the economy, suggesting they focus on high prices and 401k accounts.",
    "link": "https://www.foxnews.com/media/james-carville-urges-democrats-avoid-distractions-use-trumps-economic-chaos-against-him",
    "timestamp": "2025-04-14T18:30:55Z"
  },
  {
    "title": "Trump says Iran must ditch ‘concept of a nuclear weapon’ ahead of more talks",
    "description": "President Donald Trump says Iran \"wants to deal\" with Washington, but he once again demanded that the world's number one terror sponsor drop any \"concept of a nuclear weapon.\"",
    "link": "https://www.foxnews.com/world/trump-says-iran-must-ditch-concept-nuclear-weapon-ahead-more-talks",
    "timestamp": "2025-04-14T18:30:50Z"
  },
  {
    "title": "American Sméagol James Carville Schemes How to ‘Turn Trump’s Economic Chaos Against Him’",
    "description": "Mr. “It’s the economy, stupid” James Carville is scheming how to exploit the economy for hapless Democrats to use as a political cudgel against President Donald Trump. Carville’s latest guest essay for The New York Times, “How to Turn Trump’s Economic Chaos A…",
    "link": "https://freerepublic.com/focus/f-bloggers/4310978/posts",
    "timestamp": "2025-04-14T18:30:13Z"
  },
  {
    "title": "China, Vietnam Sign Agreements After Xi Jinping's Warning On Protectionism",
    "description": "China and Vietnam signed dozens of cooperation agreements Monday, strengthening ties between the communist-run countries after Chinese leader Xi Jinping warned that protectionism &quot;leads nowhere&quot; and that a trade war would have &quot;no winners&quot;.",
    "link": "https://www.ndtv.com/world-news/china-vietnam-sign-agreements-after-xi-jinpings-warning-on-protectionism-8164625",
    "timestamp": "2025-04-14T18:30:04Z"
  },
  {
    "title": "Well I'm Sure The Other News Outlets Will Continue Their Existing Show Of Solidarity",
    "description": "Good job, Schumer:\nDespite a court order, a reporter and photographer from The Associated Press were barred from an Oval Office news conference on Monday with President Donald Trump and his counterpart from El Salvador, Nayib Bukele.\nSchumer's \"red line\" for …",
    "link": "https://www.eschatonblog.com/2025/04/well-im-sure-other-news-outlets-will.html",
    "timestamp": "2025-04-14T18:30:00Z"
  },
  {
    "title": "Gasoline Prices Fall for First Time in a Month, Still Higher YoY",
    "description": "Average national prices for a gallon of gasoline at the pump on Monday fell for the first time in a month, according to GasBuddy, dropping 8.2 cents per gallon compared to a week ago, with prices still 7.8 cents higher than a month ago, and 46.9 cents higher …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Gasoline-Prices-Fall-for-First-Time-in-a-Month-Still-Higher-YoY.html",
    "timestamp": "2025-04-14T18:30:00Z"
  },
  {
    "title": "XRP a Bright Spot as Investors Yank $789 Million from Bitcoin, Ethereum Funds: CoinShares",
    "description": "Products tracking Bitcoin and other coins generated outflows last week amid Donald Trump's tariff zigzag, except for XRP funds.",
    "link": "https://decrypt.co/314733/xrp-bright-spot-bitcoin-ethereum-etf-flows",
    "timestamp": "2025-04-14T18:29:32Z"
  },
  {
    "title": "Aimee Lou Wood Gets Support From Cara Delevingne, Jameela Jamil, & More Following 'Saturday Night Live' Parody",
    "description": "Several stars are speaking out in support of Aimee Lou Wood after Saturday Night Live made fun of her appearance and accent. During the April 12 episode, the NBC series parodied The White Lotus with a sketch titled “The White Potus,” which poked fun at Presid…",
    "link": "https://www.justjared.com/2025/04/14/aimee-lou-wood-gets-support-from-cara-delevingne-jameela-jamil-more-following-saturday-night-live-parody/",
    "timestamp": "2025-04-14T18:28:56Z"
  },
  {
    "title": "Harvard rejects Trump administration demands amid threats of funding cuts",
    "description": "Harvard University will \"not accept\" demands made by President Donald Trump's administration amid threats of funding cuts, according to a statement issued Monday.",
    "link": "https://www.nbcnews.com/news/us-news/harvard-rejects-trump-administration-demands-threats-funding-cuts-rcna201203",
    "timestamp": "2025-04-14T18:28:50Z"
  },
  {
    "title": "Trump uses chaotic Oval Office moment to attack trans people — and finds a willing ally in El Salvador’s hardline president",
    "description": "During a freewheeling Oval Office appearance Monday with El Salvador’s self-declared “world’s coolest dictator,” President Donald Trump once again turned to transphobia as political red meat — and found a willing partner in President Nayib Bukele, who is visi…",
    "link": "https://www.advocate.com/politics/trump-el-salvador-transgender",
    "timestamp": "2025-04-14T18:28:33Z"
  },
  {
    "title": "13 potential 2028 presidential candidates for both major parties",
    "description": "A rare open primary for both parties has a large number of people considering a run for president",
    "link": "https://theweek.com/politics/potential-2028-presidential-candidates-democrat-republican",
    "timestamp": "2025-04-14T18:28:14Z"
  },
  {
    "title": "Chuck Todd on Leaving NBC News, Covering Trump, and Why Algorithms Are ‘The Bane of Our Polarized Existence’",
    "description": "Chuck Todd, former NBC News anchor and moderator of Meet the Press, had already given up on cable news years before his exit from the network.\nThe post Chuck Todd on Leaving NBC News, Covering Trump, and Why Algorithms Are ‘The Bane of Our Polarized Existence…",
    "link": "https://www.mediaite.com/podcasts/chuck-todd-on-leaving-nbc-news-covering-trump-and-why-algorithms-are-the-bane-of-our-polarized-existence/",
    "timestamp": "2025-04-14T18:28:09Z"
  },
  {
    "title": "Trump blames Zelensky for ‘millions’ of deaths in Russian invasion",
    "description": "US President Donald Trump resumed his attempts Monday to blame Ukrainian leader Volodymyr Zelensky for Russia’s invasion, falsely accusing him of responsibility for “millions” of deaths. Trump — who had a blazing public row in the Oval Office with Zelensky si…",
    "link": "https://www.digitaljournal.com/world/trump-blames-zelensky-for-millions-of-deaths-in-russian-invasion/article",
    "timestamp": "2025-04-14T18:27:20Z"
  },
  {
    "title": "Trump says ‘home-grown’ Americans are next to go to El Salvador, tells Bukele ‘gotta build about five more places’",
    "description": "\"You gotta build about five more places,\" Trump told Salvadoran President Nayib Bukele in the Oval Office, prompting laughter from administration officials.",
    "link": "https://nypost.com/2025/04/14/us-news/trump-says-home-grown-americans-are-next-to-go-to-el-salvador-tells-bukele-gotta-build-about-five-more-places/",
    "timestamp": "2025-04-14T18:27:18Z"
  },
  {
    "title": "Weapons Dealers Had No Problem Stocking Their Shelves After Biden’s Botched Afghanistan Withdrawal",
    "description": "A Pakistani marketplace known for selling weapons to interested buyers, including terrorists, bustled with activity in the immediate aftermath of the Biden administration’s botched pullout from Afghanistan, The Washington Post reported Monday. The market in D…",
    "link": "https://freerepublic.com/focus/f-news/4310977/posts",
    "timestamp": "2025-04-14T18:26:40Z"
  },
  {
    "title": "‘I Can’t Keep Up With You!’ MAGA Reporter Sprays Blizzard Of Praise At Trump On Air Force One For Being ‘Healthy And Energized’",
    "description": "Real America’s Voice White House Correspondent Brian Glenn showered President Donald Trump with praise aboard Air Force One over his “health” and “energetic”-ness, exclaiming, “I can’t keep up with you!” Trump emerged into the press cabin aboard Air Force One…",
    "link": "https://www.mediaite.com/news/i-cant-keep-up-with-you-maga-reporter-sprays-blizzard-of-praise-at-trump-on-air-force-one-for-being-healthy-and-energized/",
    "timestamp": "2025-04-14T18:25:56Z"
  },
  {
    "title": "El Salvador’s President Refuses To Return Man Who Was Mistakenly Deported",
    "description": "In an appearance at the White House with co-president Trump, President Nayib Bukele of El Salvador said his country would not order the return of a Maryland man who was mistakenly deported, and Donald's administration previously admitted that Kilmar Armando A…",
    "link": "https://crooksandliars.com/2025/04/el-salvador-s-president-refuses-return-man",
    "timestamp": "2025-04-14T18:25:25Z"
  },
  {
    "title": "James Carville Schemes How to ‘Turn Trump’s Economic Chaos Against Him’",
    "description": "Mr. “It’s the economy, stupid” James Carville is scheming how to exploit the economy for hapless Democrats to use as a political cudgel against President Donald Trump.",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/04/14/american-smeagol-james-carville-schemes-how-turn-trumps",
    "timestamp": "2025-04-14T18:24:02Z"
  },
  {
    "title": "Trump Says He's 'All For' Sending U.S. Citizens To El Salvador",
    "description": "It's the second time in a week that the Trump administration has said it wants to forcibly disappear U.S. citizens abroad.",
    "link": "https://www.huffpost.com/entry/trump-send-us-citizens-el-salvador_n_67fd3878e4b09c14eff558c2",
    "timestamp": "2025-04-14T18:22:32Z"
  },
  {
    "title": "The Trump Administration Can't Admit It Made A Mistake",
    "description": "The president and one of his top advisers repeatedly made outrageous claims about the man who has been sent to a prison in El Salvador known for its abuses.",
    "link": "https://www.huffpost.com/entry/the-trump-administration-cant-stop-lying-about-kilmar-abrego-garcia_n_67fd41e5e4b09c14eff560d6",
    "timestamp": "2025-04-14T18:20:52Z"
  },
  {
    "title": "Despite a court order, White House bars AP from Oval Office event (David Bauder/Associated Press)",
    "description": "David Bauder / Associated Press:\nDespite a court order, White House bars AP from Oval Office event  —  Despite a court order, a reporter and photographer from The Associated Press were barred from an Oval Office news conference on Monday with President Donald…",
    "link": "https://www.memeorandum.com/250414/p72",
    "timestamp": "2025-04-14T18:20:00Z"
  },
  {
    "title": "Harvard University rejects Trump DEI demands, imperiling $9 billion in federal funding - NewsBreak",
    "description": "Harvard University rejected a proposed deal with President Donald Trump, putting $9 billion in federal funding at risk. The Trump administration proposed c",
    "link": "https://www.newsbreak.com/share/3962468395735-harvard-university-rejects-trump-dei-demands-imperiling-9-billion-in-federal-funding?_f=app_share&pd=0F7zG5T5&lang=en_US&send_time=1744659096&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.15.2.8%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v8%2Cns_local_strategy_25q1_exp-v16%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_recall_exp_25q2-control&s=i2",
    "timestamp": "2025-04-14T18:20:00Z"
  },
  {
    "title": "Harvard has $2.2 billion in grants frozen by Trump administration after rejecting demands - NewsBreak",
    "description": "The Trump administration on Monday night said it was freezing $2.2 billion in grants to Harvard University over concerns about antisemitism on campus. The",
    "link": "https://www.newsbreak.com/share/3962468395735-harvard-university-rejects-trump-dei-demands-imperiling-9-billion-in-federal-funding?s=a2&share_destination_id=MjcwMjk3ODQwLTE3NDQ2NTg0NTE4MDc%3D&pd=0II8oasa&hl=en_US&send_time=1744658451&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.15.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v1%2Cns_local_strategy_25q1_exp-v4%2Cns_push_exp_rt_bucketv12-control%2Cns_foryou_recall_exp_25q2-control%2Cns_foryou_model_exp_25q1-v3",
    "timestamp": "2025-04-14T18:20:00Z"
  },
  {
    "title": "Harvard has $2.2 billion in grants frozen by Trump administration after rejecting demands - NewsBreak",
    "description": "The Trump administration on Monday night said it was freezing $2.2 billion in grants to Harvard University over concerns about antisemitism on campus. The",
    "link": "https://www.newsbreak.com/share/3962468395735-harvard-university-rejects-trump-dei-demands-imperiling-9-billion-in-federal-funding?_f=app_share&pd=04SdOxww&lang=en_US&send_time=1744660570&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.15.1.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v8%2Cns_foryou_recall_exp_25q2-control%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-control&s=i2",
    "timestamp": "2025-04-14T18:20:00Z"
  },
  {
    "title": "Trump wants to deport some US citizens to El Salvador",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump said on Monday he wants to deport some violent criminals who are U.S. citizens to El Salvador, where they would be incarcerated under an agreement with that country's government. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/15/trump-wants-to-deport-some-us-citizens-to-el-salvador",
    "timestamp": "2025-04-14T18:20:00Z"
  },
  {
    "title": "Gretchen Whitmer Addresses Viral Photo Of Her Trying to Hide Trump Oval Office Meeting: ‘That’s All It Was’",
    "description": "\"We saw that viral picture of Michigan Governor Gretchen Whitmer the other day in the Oval Office. Hard to believe this was real when it first came out\"\nThe post Gretchen Whitmer Addresses Viral Photo Of Her Trying to Hide Trump Oval Office Meeting: ‘That’s A…",
    "link": "https://www.mediaite.com/tv/gretchen-whitmer-addresses-viral-photo-of-her-trying-to-hide-trump-oval-office-meeting-thats-all-it-was/",
    "timestamp": "2025-04-14T18:19:52Z"
  },
  {
    "title": "Trump Celebrates Masters Winner Rory McIlroy: 'Tremendous Courage'",
    "description": "President Donald Trump celebrated pro golfer Rory McIlroy's Masters win on Sunday calling McIlroy's game an \"amazing\" effort.\nThe post Trump Celebrates Masters Winner Rory McIlroy: ‘Tremendous Courage’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/04/14/trump-celebrates-masters-winner-rory-mcilroy-tremendous-courage/",
    "timestamp": "2025-04-14T18:18:52Z"
  },
  {
    "title": "[Ilya Somin] Liberty Justice Center and I File Lawsuit Challenging Trump's \"Liberation Day\" Tariffs",
    "description": "Today, the Liberty Justice Center and I filed a lawsuit in the Court of International Trade challenging the legality of Donald Trump's gargantuan",
    "link": "https://reason.com/volokh/2025/04/14/liberty-justice-center-and-i-file-lawsuit-challenging-trumps-liberation-day-tariffs/",
    "timestamp": "2025-04-14T18:18:42Z"
  },
  {
    "title": "Fox Nation Plans Game Show About Isolated People Guessing What Trump Did In His First 90 Days",
    "description": "The show, featuring contestants clueless about President Trump's actions in office, will debut next month on Fox News Media's Fox Nation streaming service. On Jan. 20, the day of President Donald Trump’s inauguration, Fox News Media placed four people “in com…",
    "link": "https://freerepublic.com/focus/f-chat/4310975/posts",
    "timestamp": "2025-04-14T18:18:10Z"
  },
  {
    "title": "John Oliver: Trump & Tariffs",
    "description": "John Oliver discusses the ongoing chaos surrounding Donald Trump and tariffs, why the past week could have lasting repercussions, and why your grandma might be looking to start an OnlyFans.",
    "link": "https://littlegreenfootballs.com/article/54531_John_Oliver-_Trump_and_Tariffs",
    "timestamp": "2025-04-14T18:17:36Z"
  },
  {
    "title": "Trump wants to deport some US citizens to El Salvador",
    "description": "U.S. President Donald Trump said on Monday he wants to deport some violent criminals who are U.S. citizens to El Salvador, where they would be incarcerated...",
    "link": "https://www.yahoo.com/news/trump-wants-deport-us-citizens-181642313.html",
    "timestamp": "2025-04-14T18:16:42Z"
  },
  {
    "title": "Gates Scholarships Will No Longer Be Restricted To Minority Students",
    "description": "After complaints were raised about its tax-exempt status, the Gates Foundation said it will no longer restrict eligibility for Gates Scholarships to minority students.",
    "link": "https://www.forbes.com/sites/michaeltnietzel/2025/04/14/gates-scholarships-will-no-longer-be-restricted-to-minority-students/",
    "timestamp": "2025-04-14T18:16:07Z"
  },
  {
    "title": "Nvidia commits to $500bn AI server production in the US",
    "description": "The chipmaker is the latest tech firm to announce plans to bring jobs to the United States.",
    "link": "https://www.aljazeera.com/economy/2025/4/14/nvidia-commits-to-500bn-ai-server-production-in-the-us",
    "timestamp": "2025-04-14T18:15:11Z"
  },
  {
    "title": "Fox Business’ Dagen McDowell Mocks DOGE for Trying to Solve Deficit Using ‘Elon Musk Math’",
    "description": "Fox Business' Dagen McDowell mocked the Department of Government Efficiency for using \"Elon Musk Math\" to cut the federal deficit on Monday.\nThe post Fox Business’ Dagen McDowell Mocks DOGE for Trying to Solve Deficit Using ‘Elon Musk Math’ first appeared on …",
    "link": "https://www.mediaite.com/tv/fox-business-dagen-mcdowell-mocks-doge-for-trying-to-solve-deficit-using-elon-musk-math/",
    "timestamp": "2025-04-14T18:14:36Z"
  },
  {
    "title": "Stephen Miller: Trump Administration Will Continue Sending Tren de Aragua Members to El Salvador",
    "description": "WH Deputy Chief of Staff Stephen Miller said Monday that the Trump administration will continue sending Tren de Aragua aliens in the U.S. to El Salvador.\nThe post Stephen Miller: Trump Administration Will Continue Sending Tren de Aragua Members to El Salvador…",
    "link": "https://www.breitbart.com/politics/2025/04/14/stephen-miller-trump-administration-will-continue-sending-tren-de-aragua-members-el-salvador/",
    "timestamp": "2025-04-14T18:14:36Z"
  },
  {
    "title": "A Drawdown of U.S. Forces in Europe Is All but Certain",
    "description": "Here’s how the Pentagon can rebalance its approach to the continent without sacrificing U.S. interests.",
    "link": "http://foreignpolicy.com/2025/04/14/us-troops-europe-nato-drawdown-pentagon-trump-hegseth-posture-review/",
    "timestamp": "2025-04-14T18:13:03Z"
  },
  {
    "title": "Trump Health Report Notes His ‘Frequent Victories in Golf’",
    "description": "Trump health report notes his ‘frequent victories in golf.’ After Trump’s physical, his doctor, Sean Barbabella, issued a weirdly normal report on on his weight, medications, and colonoscopy. But Barbabella closed by praising Trump’s golfing skills.",
    "link": "http://nymag.com/intelligencer/article/trump-health-report-notes-his-frequent-victories-in-golf.html",
    "timestamp": "2025-04-14T18:12:11Z"
  },
  {
    "title": "Spain Updates Travel Advice For US",
    "description": "Spain joins a growing list of countries updating travel information for citizens heading to the U.S.",
    "link": "https://www.newsweek.com/spain-updates-travel-advice-united-states-2059571",
    "timestamp": "2025-04-14T18:12:00Z"
  },
  {
    "title": "Trump Implies Some Tariff Relief For Car Companies—Sending Ford, GM, Stellantis Stocks Jumping",
    "description": "President Donald Trump said car companies “need a little bit of time” to move part manufacturing into the United States.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/04/14/trump-implies-some-tariff-relief-for-car-companies-sending-ford-gm-stellantis-stocks-jumping/",
    "timestamp": "2025-04-14T18:11:30Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash",
    "description": "President Trump hinted at potential temporary tariff exemptions for the auto industry, citing the need for companies to adjust supply chains. This follows previous tariff announcements and subsequent adjustments, causing market uncertainty. Trump also mention…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-considers-pausing-his-auto-tariffs-as-the-world-economy-endures-whiplash/articleshow/120288699.cms",
    "timestamp": "2025-04-14T18:10:34Z"
  },
  {
    "title": "Trump Is Defying the Supreme Court",
    "description": "The Court told the Trump administration to “facilitate” the return of Kilmar Abrego Garcia from El Salvador’s infamous CECOT prison. So far, the administration is pretending to comply while refusing to do so.",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/bukele-trump-court-order/682432/",
    "timestamp": "2025-04-14T18:10:00Z"
  },
  {
    "title": "There’s a brewing clash between Trump and DOGE with cost-cutting at odds with the president’s long-stated dream",
    "description": "Community celebrations being planned to commemorate the nation's 250th anniversary next year are at risk of being significantly scaled back or canceled because of federal funding cuts under President Donald Trump's administration, according to multiple state …",
    "link": "https://biztoc.com/x/9364b8866403fd8a",
    "timestamp": "2025-04-14T18:09:59Z"
  },
  {
    "title": "Fire set at Pennsylvania Gov. Josh Shapiro’s home is the latest in a string of political violence",
    "description": "Trump was the target of two assassination attempts during last year’s presidential campaign.",
    "link": "https://www.bostonherald.com/2025/04/14/recent-political-violence/",
    "timestamp": "2025-04-14T18:09:58Z"
  },
  {
    "title": "China has stopped exporting rare earths to everyone, not just the US, cutting off critical materials for tech, autos, aerospace and defense",
    "description": "After President Donald Trump unveiled his so-called reciprocal tariffs on \"Liberation Day,\" China retaliated with its own duties and export controls on rare earth minerals, which are critical to the tech, auto, aerospace and defense sectors. So far, those exp…",
    "link": "https://biztoc.com/x/01b31aabb8a18a7e",
    "timestamp": "2025-04-14T18:09:50Z"
  },
  {
    "title": "Trump, 'Looking To Help,' Lifts General Motors, Ford. Tesla Not So Lucky",
    "description": "President Donald Trump said Monday he is looking to \"help some of the car companies\" with his 25% tariffs on foreign-made imports. GM and Ford rose.\nThe post Trump, 'Looking To Help,' Lifts General Motors, Ford. Tesla Not So Lucky. appeared first on Investor'…",
    "link": "https://biztoc.com/x/ada04b1005525d1b",
    "timestamp": "2025-04-14T18:09:31Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash",
    "description": "By JOSH BOAK\nWASHINGTON (AP) — President Donald Trump on Monday suggested that he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.\nRelated Articles\n \n \n \n Majori…",
    "link": "https://biztoc.com/x/f1bc87e34b2e7269",
    "timestamp": "2025-04-14T18:09:21Z"
  },
  {
    "title": "Volodymyr Zelensky and JD Vance’s war of words is getting nastier, here’s what the Ukrainian president said that could trigger a reaction from the U.S. VP",
    "description": "Tensions escalate as Ukrainian President Zelensky accuses US Vice President JD Vance of justifying Putin's actions and promoting a distorted view of the conflict. Zelensky insists Ukraine is the victim, rejecting narratives blurring the lines. This follows a …",
    "link": "https://economictimes.indiatimes.com/news/international/us/volodymyr-zelensky-and-jd-vances-war-of-words-is-getting-nastier-heres-what-the-ukrainian-president-said-that-could-trigger-a-reaction-from-the-u-s-vp/articleshow/120288659.cms",
    "timestamp": "2025-04-14T18:09:13Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash",
    "description": "President Donald Trump says he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.",
    "link": "https://www.news4jax.com/business/2025/04/14/trump-considers-pausing-his-auto-tariffs-as-the-world-economy-endures-whiplash/",
    "timestamp": "2025-04-14T18:08:46Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash",
    "description": "President Donald Trump says he might temporarily exempt the auto industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.",
    "link": "https://www.clickorlando.com/business/2025/04/14/trump-considers-pausing-his-auto-tariffs-as-the-world-economy-endures-whiplash/",
    "timestamp": "2025-04-14T18:08:44Z"
  },
  {
    "title": "Quick, No One Tell Trump About Bernie Sanders and AOC’s Crowd Sizes",
    "description": "The Coachella appearance was just a pitstop for the Vermont senator whose “fight oligarchy” tour has attempted to combine celebrity and performance with a cathartic rally.",
    "link": "https://www.vanityfair.com/news/story/bernie-sanders-coachella-utah",
    "timestamp": "2025-04-14T18:07:02Z"
  },
  {
    "title": "El Salvador’s Bukele says he cannot return man mistakenly deported by US",
    "description": "In Oval Office meeting with Bukele, Donald Trump says he will send as many people living in the US illegally to El Salvador as possible",
    "link": "https://www.irishtimes.com/world/us/2025/04/14/el-salvadors-bukele-says-he-cannot-return-man-mistakenly-deported-by-us/",
    "timestamp": "2025-04-14T18:05:05Z"
  },
  {
    "title": "Trump considers pausing his auto tariffs as the world economy endures whiplash",
    "description": "The president's statement hints at yet another round of reversals on tariffs.",
    "link": "https://www.bostonherald.com/2025/04/14/trump-auto-tariffs-whiplash/",
    "timestamp": "2025-04-14T18:03:39Z"
  },
  {
    "title": "Why weakening U.S. bank regulators could repeat the mistakes of the 2008 financial crisis",
    "description": "The targeting of the FDIC could dangerously erode its ability to manage financial crises, like the one that occurred in 2008.",
    "link": "https://theconversation.com/why-weakening-u-s-bank-regulators-could-repeat-the-mistakes-of-the-2008-financial-crisis-254365",
    "timestamp": "2025-04-14T18:00:31Z"
  },
  {
    "title": "Trump's decision to gut the Education Department is not only illegal, it's wrong (Randi Weingarten/Fox News)",
    "description": "Randi Weingarten / Fox News:\nTrump's decision to gut the Education Department is not only illegal, it's wrong  —  President Trump's plan for the Education Department is all about redistributing money and opportunity from the many to the few  —  President Dona…",
    "link": "https://www.memeorandum.com/250414/p68",
    "timestamp": "2025-04-14T18:00:01Z"
  },
  {
    "title": "Iran Faces Tough Decisions in Nuclear Negotiations",
    "description": "Nuclear talks in Oman marked the first formal engagement between Iran and the United States in years, and though progress may have been slight, it was enough to signal a willingness to temper tensions through diplomacy rather than military action. Iranian and…",
    "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Iran-Faces-Tough-Decisions-in-Nuclear-Negotiations.html",
    "timestamp": "2025-04-14T18:00:00Z"
  },
  {
    "title": "Former Trump Campaign Adviser: Don't Believe the Anti-Tariff Hysteria | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn April 2, 2025, President Donald J. Trump didn't just unveil tariffs—he sparked a revolution.\nIn the Rose Garden, surrounded by proud union workers, the president proclaimed America's \"Liberation Day,\" smash…",
    "link": "https://biztoc.com/x/2d1e5a146f4bd677",
    "timestamp": "2025-04-14T17:58:39Z"
  },
  {
    "title": "Lawyer for wrongly deported Maryland man says it might take contempt order to get him back",
    "description": "Lawyer for wrongly deported Maryland man says it might take contempt order to get him backgo.com",
    "link": "https://abcnews.go.com/US/lawyer-wrongly-deported-maryland-man-contempt-order-back/story?id=120787771",
    "timestamp": "2025-04-14T17:57:02Z"
  },
  {
    "title": "Aimee Lou Wood Says She’s ‘Not Hating’ on ‘SNL’ Star Sarah Sherman After Calling Out ‘White Lotus’ Parody as ‘Mean’: ‘I Am Not Thin Skinned… Not Her Fault’",
    "description": "Aimee Lou Wood clarified on social media that she was not hating on “Saturday Night Live” cast member Sarah Sherman when she called out the show’s “White Lotus” parody for being “mean and unfunny.” Sherman played an exaggerated version of Wood’s Chelsea from …",
    "link": "https://variety.com/2025/tv/news/aimee-lou-wood-snl-sarah-sherman-white-lotus-parody-1236369112/",
    "timestamp": "2025-04-14T17:56:51Z"
  },
  {
    "title": "Despite a court order, White House bars AP from Oval Office event",
    "description": "The Trump administration has turned a reporter and photographer from The Associated Press away from covering an Oval Office news conference involving President Donald Trump and El Salvador President Nayib Bukele.",
    "link": "https://www.clickorlando.com/business/2025/04/14/despite-a-court-order-white-house-bars-ap-from-oval-office-event/",
    "timestamp": "2025-04-14T17:56:29Z"
  },
  {
    "title": "Visitors to U.S. Take Extreme Precautions as Trump Continues March of Fascism",
    "description": "The U.S. is not a safe place to visit (or live) right now.",
    "link": "https://gizmodo.com/visitors-to-u-s-take-extreme-precautions-as-trump-continues-march-of-fascism-2000589040",
    "timestamp": "2025-04-14T17:55:31Z"
  },
  {
    "title": "City Warns Water Rates May Increase After Trump Funding Freeze",
    "description": "The federal funds were planned to be used to construct a water filtration system to eliminate PFAS from drinking water.",
    "link": "https://www.newsweek.com/city-warns-drinking-water-rates-increase-pfas-trump-funding-freeze-2059595",
    "timestamp": "2025-04-14T17:55:01Z"
  },
  {
    "title": "Gayle King defends space flight ‘PR stunt’ for Jeff Bezos, Lauren Sanchez",
    "description": "During an interview ahead of the controversial flight, King admitted it was 'troubling' to be seen as part of an 'ad' for the billionaire Bezos and his fiancee.",
    "link": "https://www.bostonherald.com/2025/04/14/gayle-king-justify-space-flight-pr-stunt-jeff-bezos/",
    "timestamp": "2025-04-14T17:54:01Z"
  }
]