[
  {
    "title": "Jetmaker circles North Carolina, with massive project that could add 10,000 jobs",
    "description": "JetZero, which has been scouting sites across the country for a factory to build its blended-wing aircraft, is expected to announce plans to build in the Triad as early as this week.",
    "link": "https://www.wral.com/story/jetmaker-circles-north-carolina-with-massive-project-that-could-add-10-000-jobs/22045770/",
    "timestamp": "2025-06-11T02:52:49Z"
  },
  {
    "title": "Tesla faces new challenge as leader announces exit",
    "description": "As Elon Musk shifts his focus back to Tesla (TSLA) amid an ongoing disagreement with President Donald Trump, his company is preparing for another leadership change. The automaker has expanded into other areas of technology in recent years, prompting its leade…",
    "link": "https://freerepublic.com/focus/f-news/4322289/posts",
    "timestamp": "2025-06-11T02:52:46Z"
  },
  {
    "title": "Leaders warn race for minerals could turn seabed into 'wild west'",
    "description": "Anxiety over Trump's push to fast-track deep-sea mining in international waters took center stage at the opening of the U.N. Ocean Conference in France.",
    "link": "https://www.japantimes.co.jp/environment/2025/06/11/sustainability/minerals-seabed-wild-west/",
    "timestamp": "2025-06-11T02:51:00Z"
  },
  {
    "title": "Asian equities rally after China-US framework on trade",
    "description": "Asian stocks rose Wednesday as investors welcomed a China-US agreement to lower trade tensions that stoked hopes the economic superpowers will eventually reach a broader tariff deal. After two days of high-profile, closely watched talks in London, the two sid…",
    "link": "https://www.digitaljournal.com/world/asian-equities-rally-after-china-us-framework-on-trade/article",
    "timestamp": "2025-06-11T02:47:32Z"
  },
  {
    "title": "North Carolina GOP sends immigration-crackdown bills to Democratic Gov. Stein",
    "description": "Republicans at the North Carolina legislature have given final approval to two pieces of immigration legislation",
    "link": "https://abcnews.go.com/Politics/wireStory/north-carolina-gop-sends-immigration-crackdown-bills-democratic-122712385",
    "timestamp": "2025-06-11T02:46:29Z"
  },
  {
    "title": "Trump Is Prepping to Send Thousands Of Immigrants To Guantanamo: Reports",
    "description": "The detention facility still carries a notorious reputation for inhumane conditions and a \"climate of extreme fear.\"",
    "link": "https://www.huffpost.com/entry/trump-guantanamo-bay-immigrant-detention_n_6848bfa0e4b07d60ea759f30",
    "timestamp": "2025-06-11T02:45:23Z"
  },
  {
    "title": "Elon Musk says Tesla's driverless robotaxi service to 'tentatively' launch in Austin on June 22",
    "description": "Elon Musk's Tesla plans to launch robotaxi service in Austin, Texas. The tentative date is June 22. Safety concerns might cause delays. Initially, the taxis will be remotely monitored and geofenced. Expansion to Los Angeles, San Antonio, and San Francisco is …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-says-teslas-driverless-robotaxi-service-to-tentatively-launch-in-austin-on-june-22/articleshow/121766302.cms",
    "timestamp": "2025-06-11T02:44:03Z"
  },
  {
    "title": "'No Kings' protests planned in Houston; when, where, what you need to know",
    "description": "Half a dozen protests are planned in Houston for Saturday, June 14 by the No Kings movement, according to their website.",
    "link": "https://www.fox26houston.com/news/no-kings-protests-planned-houston-when-where-what-you-need-know",
    "timestamp": "2025-06-11T02:43:51Z"
  },
  {
    "title": "FACT CHECK: Newsom Falsely Claims Riots Only Began After Trump Federalized Guard",
    "description": "Gavin Newsom falsely claimed that the Los Angeles riots only began after President Donald Trump federalized the California National Guard.\nThe post FACT CHECK: Newsom Falsely Claims Riots Only Began After Trump Federalized Guard appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/10/fact-check-newsom-falsely-claims-riots-only-began-after-trump-federalized-guard/",
    "timestamp": "2025-06-11T02:40:47Z"
  },
  {
    "title": "Michael Saylor rejects crypto winter fears, says Bitcoin ‘going to $1M’",
    "description": "Strategy’s Michael Saylor claims that “all the evidence” indicates Bitcoin is unlikely to face another crypto winter anytime soon.",
    "link": "https://cointelegraph.com/news/strategy-michael-saylor-rejects-crypto-winter-bitcoin-price-prediction",
    "timestamp": "2025-06-11T02:39:11Z"
  },
  {
    "title": "US journalist dropped by ABC over Trump administration ‘hater’ comment",
    "description": "Veteran correspondent for the US broadcaster, Terry Moran, had called Trump aide Stephen Miller a 'world-class hater'.",
    "link": "https://www.aljazeera.com/news/2025/6/11/us-journalist-dropped-by-abc-over-trump-administration-hater-comment",
    "timestamp": "2025-06-11T02:37:02Z"
  },
  {
    "title": "The Silence of the Generals — As President Donald Trump crossed a dangerous line at Fort Bragg ... (Tom Nichols/The Atlantic)",
    "description": "Tom Nichols / The Atlantic:\nThe Silence of the Generals  —  As President Donald Trump crossed a dangerous line at Fort Bragg, the brass failed to speak out in the Army's defense.  —  President Donald Trump continued his war against America's most cherished mi…",
    "link": "https://www.memeorandum.com/250610/p157",
    "timestamp": "2025-06-11T02:35:00Z"
  },
  {
    "title": "Sherrill, Ciattarelli win New Jersey gubernatorial primaries",
    "description": "Voters went to the polls on Tuesday for New Jersey’s primary elections, which set up the state’s gubernatorial general election this year.",
    "link": "https://abcnews.go.com/Politics/new-jersey-sherrill-ciattarelli-primaries-governor-setting-key-2025/story?id=122672319",
    "timestamp": "2025-06-11T02:32:47Z"
  },
  {
    "title": "Trump dances with soldiers at Fort Bragg as crowd erupts in patriotic 'USA' chants",
    "description": "Trump's appearance at Fort Bragg for the Army's 250th anniversary featured his viral dance moves, generating cheers and patriotic chants from the appreciative military crowd.",
    "link": "https://www.foxnews.com/politics/trump-dances-soldiers-fort-bragg-crowd-erupts-patriotic-usa-chants",
    "timestamp": "2025-06-11T02:29:40Z"
  },
  {
    "title": "‘Next time, I’m not waiting’: Trump’s endgame has arrived",
    "description": "Donald Trump's obsession with turning the army on its own people, like the Los Angeles protestors, is drawn from US political history as old as the country itself. \nThe post ‘Next time, I’m not waiting’: Trump’s endgame has arrived appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/06/11/donald-trump-usa-army-insurrection-act-los-angeles-protests/",
    "timestamp": "2025-06-11T02:29:06Z"
  },
  {
    "title": "Apple's iPhone production slows but steadies in May at ₹15,000 crore",
    "description": "Apple's India iPhone production remains strong. Vendors produced over ₹15,000 crore worth of iPhones in May. This is slightly less than previous months but still exceeds 2024 averages. Production has reached ₹84,000 crore this year, matching 2024 domestic con…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/apple-iphone-production-slows-but-steadies-in-may-at-15000-crore/articleshow/121765973.cms",
    "timestamp": "2025-06-11T02:28:06Z"
  },
  {
    "title": "‘This moment we have feared has arrived’: Newsom rips Trump’s ‘military dragnet’",
    "description": "California Gov. Gavin Newsom delivered a blistering rebuke of Donald Trump on Tuesday, accusing the president of unleashing a “military dragnet” across Los Angeles and targeting vulnerable residents under the guise of law and order. “This moment we have feare…",
    "link": "https://www.rawstory.com/newsom-trump-2672345933/",
    "timestamp": "2025-06-11T02:25:59Z"
  },
  {
    "title": "Gavin Newsom warns 'democracy is under assault' in speech blasting Trump's immigration tactics",
    "description": "The California governor has clashed with Trump in recent days over the president's deployment of the National Guard to quell protests in Los Angeles.",
    "link": "https://www.nbcnews.com/politics/immigration/gavin-newsom-democracy-speech-trump-immigration-los-angeles-protests-rcna212237",
    "timestamp": "2025-06-11T02:25:41Z"
  },
  {
    "title": "US sees nationwide protests against immigration raids; violence erupts in some cities",
    "description": "Immigration raids spark nationwide US protests from Austin to NYC. Clashes reported, arrests made. Larger anti-ICE demonstrations planned over the weekend",
    "link": "https://www.thehindubusinessline.com/news/world/us-immigration-protests-ice-raids-trump-guard/article69681380.ece",
    "timestamp": "2025-06-11T02:24:51Z"
  },
  {
    "title": "Curfew imposed in Los Angeles following riots",
    "description": "Los Angeles Mayor Karen Bass has imposed a local curfew in an effort to quell immigration riots Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618934-la-curfew-riots-looting/",
    "timestamp": "2025-06-11T02:23:48Z"
  },
  {
    "title": "FULL MATCH: Oba Femi vs. Jasper Troy | NXT Title Match: NXT, June 10, 2025",
    "description": "Oba Femi defends the NXT Championship against the monstrous Jasper Troy. Catch WWE action on Netflix, Peacock, USA Network, CW Network and more. #WWENXT",
    "link": "http://www.wwe.com/videos/full-match-oba-femi-vs-jasper-troy-nxt-title-match-nxt-june-10-2025",
    "timestamp": "2025-06-11T02:23:00Z"
  },
  {
    "title": "Towery: Americans Support Trump Sending National Guard To L.A. 59-39, Other Pollsters Have Similar Numbers",
    "description": "InsiderAdvantage pollster Matt Towery reports on a new poll showing 59% of Americans supporting President Donald Trump's decision to deploy the National Guard in California. Towery told FOX News host Sean Hannity that Democrats need a face like former Preside…",
    "link": "https://www.realclearpolitics.com/video/2025/06/10/towery_americans_support_sending_national_guard_to_la_59-39_other_pollsters_have_similar_numbers.html",
    "timestamp": "2025-06-11T02:22:46Z"
  },
  {
    "title": "Leader of Al-Qaeda in the Arabian Peninsula AQAP calls on American Muslims to assassinate Trump, Vance, Hegseth, Rubio and Elon Musk.",
    "description": ".... and there are 4.5 million Muslims in America alone ...",
    "link": "https://freerepublic.com/focus/f-chat/4322285/posts",
    "timestamp": "2025-06-11T02:22:42Z"
  },
  {
    "title": "Musk says Tesla's robotaxi service to 'tentatively' launch in Austin on June 22",
    "description": "Elon Musk says Tesla is “tentatively” set to begin providing robotaxi service in Austin, Texas, on June 22",
    "link": "https://abcnews.go.com/Technology/wireStory/musk-teslas-robotaxi-service-tentatively-launch-austin-june-122716681",
    "timestamp": "2025-06-11T02:22:27Z"
  },
  {
    "title": "Michael Goodwin: Dems agree NYC is too expensive — and voters can’t afford them being charge",
    "description": "If there is a single point of agreement among all the Democrats running for mayor, it’s that New York is too damn expensive.",
    "link": "https://nypost.com/2025/06/10/opinion/michael-goodwin-dems-agree-nyc-is-too-expensive-and-voters-cant-afford-them-being-charge/",
    "timestamp": "2025-06-11T02:21:39Z"
  },
  {
    "title": "‘Come and get me’: Gavin Newsom has entered the meme war",
    "description": "California Gov. Gavin Newsom (D) has found himself in the center of the internet’s spotlight after squaring off with President Donald Trump on social media over the deployment of military troops to counter protesters in Los Angeles. While police deployed tear…",
    "link": "https://freerepublic.com/focus/f-chat/4322282/posts",
    "timestamp": "2025-06-11T02:15:04Z"
  },
  {
    "title": "Newsom Compares Trump To “Failed Dictators” In Fiery Speech Over Troops Deployed In LA: “The Moment We Have Feared Has Arrived”",
    "description": "Gavin Newsom made a stand for American democracy in a fiery speech Wednesday condemning Donald Trump for deploying nearly 5,000 troops in LA over ICE raids protests. In a quickly organized near primetime address coming on the fifth day of unrest in the City o…",
    "link": "http://deadline.com/2025/06/newsom-trump-dictator-speech-1236430398/",
    "timestamp": "2025-06-11T02:15:00Z"
  },
  {
    "title": "Satanic Temple Opens Abortion Clinic in Maine, Tells Women to Do Evil Chants Celebrating Killing Babies",
    "description": "The Satanic Temple plans to open an abortion center in Maine on June 14, 2025, named “The President’s Yuge Most Beautiful Tremendous Satanic Abortion Clinic” in a mocking nod to President Donald Trump’s birthday. “We hope he receives this clinic’s distinguish…",
    "link": "https://freerepublic.com/focus/f-religion/4322281/posts",
    "timestamp": "2025-06-11T02:13:01Z"
  },
  {
    "title": "Defiant Gavin Newsom Hits Back at Trump in Primetime Address: ‘Brazen Abuse of Power’",
    "description": "California Governor Gavin Newsom slammed President Donald Trump on Tuesday night as federal troops remained in Los Angeles.\nThe post Defiant Gavin Newsom Hits Back at Trump in Primetime Address: ‘Brazen Abuse of Power’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/defiant-gavin-newsom-hits-back-at-trump-in-primetime-address-brazen-abuse-of-power/",
    "timestamp": "2025-06-11T02:11:53Z"
  },
  {
    "title": "Trump tariffs may remain in effect while appeals proceed, federal appeals court rules",
    "description": "A federal appeals court allowed President Donald Trump’s most sweeping tariffs to remain in effect on Tuesday while it reviews a lower court decision blocking them on grounds that Trump had exceeded his authority by imposing them",
    "link": "https://biztoc.com/x/db588be661516766",
    "timestamp": "2025-06-11T02:11:25Z"
  },
  {
    "title": "Gov. Newsom: ‘Trump chose theatrics over public safety’",
    "description": "California Gov. Gavin Newsom responded to President Donald Trump deploying the National Guard in response to anti-ICE raid protests. Newsom warned that other states could be next, and said Trump “chose escalation.”",
    "link": "https://biztoc.com/x/c837bae43e14f8e7",
    "timestamp": "2025-06-11T02:11:21Z"
  },
  {
    "title": "US offers $10M reward for El Chapo’s fugitive sons linked to fentanyl trafficking",
    "description": "The US government is offering a $10 million reward for information leading to the arrest of El Chapo’s fugitive sons, Ivan and Alfredo Guzman. Authorities say they rebuilt the Sinaloa Cartel and led fentanyl trafficking into the US. Sanctions were also announ…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-offers-10m-reward-for-el-chapos-fugitive-sons-linked-to-fentanyl-trafficking/articleshow/121765652.cms",
    "timestamp": "2025-06-11T02:09:09Z"
  },
  {
    "title": "Trade talks back on track: US, China agree on framework to resolve disputes",
    "description": "US and China agree in principle on a framework to ease trade tensions after London talks. The move revives a truce shaken by recent disputes over tech and tariffs",
    "link": "https://www.thehindubusinessline.com/news/world/us-china-trade-framework-london-talks-trump-xi/article69681361.ece",
    "timestamp": "2025-06-11T02:08:02Z"
  },
  {
    "title": "‘Applied AI’ set to dominate France’s Vivatech trade fair",
    "description": "Drawing high-powered tech CEOs and a presidential visit, Paris’s Vivatech trade fair opening on Wednesday will spotlight hoped-for economic benefits from AI. The top attraction on the opening day of this year’s four-day show will be Nvidia chief executive Jen…",
    "link": "https://www.digitaljournal.com/world/applied-ai-set-to-dominate-frances-vivatech-trade-fair/article",
    "timestamp": "2025-06-11T02:07:32Z"
  },
  {
    "title": "Bass: Trump Assertion We Pay Protesters 'Absolutely Absurd'",
    "description": "Tuesday on CNN's \"OutFront,\" Los Angeles Mayor Karen Bass (D) said President Donald Trump's comment that she and Gov. Gavin Newsom (D-CA) \"paid troublemakers\" was \"absolutely absurd.\"\nThe post Bass: Trump Assertion We Pay Protesters ‘Absolutely Absurd’ appear…",
    "link": "https://www.breitbart.com/clips/2025/06/10/bass-trump-assertion-we-pay-protesters-absolutely-absurd/",
    "timestamp": "2025-06-11T02:07:28Z"
  },
  {
    "title": "Newsom Fails to Launch in Trump Attack: Technical Difficulties Plague Screed",
    "description": "Democrat California Gov. Gavin Newsom failed to launch in an anti-Trump attack on Tuesday when he released a live video that was plagued with audio difficulties.\nThe post Newsom Fails to Launch in Trump Attack: Technical Difficulties Plague Screed appeared fi…",
    "link": "https://www.breitbart.com/politics/2025/06/10/newsom-fails-trump-attack-technical-difficulties-plague-screed/",
    "timestamp": "2025-06-11T02:02:41Z"
  },
  {
    "title": "Trump tariffs may remain in effect while appeals proceed, federal appeals court rules",
    "description": "A federal appeals court allowed President Donald Trump’s most sweeping tariffs to remain in effect on Tuesday while it reviews a lower court decision blocking them on grounds that Trump had exceeded his authority by imposing them",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-tariffs-may-remain-effect-appeals-proceed-federal-appeals-court-rcna212236",
    "timestamp": "2025-06-11T02:02:00Z"
  },
  {
    "title": "Oil prices down, markets assess US-China trade talks outcome",
    "description": "Oil prices experienced a slight dip early Wednesday as markets analyzed U.S.-China trade talk outcomes, awaiting President Trump's review. Concerns over weak Chinese oil demand and OPEC+ production increases are weighing on the market. While a trade truce fra…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-down-markets-assess-us-china-trade-talks-outcome/articleshow/121765695.cms",
    "timestamp": "2025-06-11T02:01:38Z"
  },
  {
    "title": "Mayor Bass Abruptly Orders Curfew for Downtown Los Angeles",
    "description": "After four days of coddling rioters and attacking President Donald Trump for federalizing California National Guard troops, Democrat Los Angeles Mayor Karen Bass suddenly turned law and order on the fifth day, announcing a curfew in downtown L.A.\nThe post May…",
    "link": "https://www.thegatewaypundit.com/2025/06/mayor-bass-abruptly-orders-curfew-downtown-los-angeles/",
    "timestamp": "2025-06-11T02:00:49Z"
  },
  {
    "title": "'Nobody can believe what he says': Schiff rips Trump after latest wild claim",
    "description": "Sen. Adam Schiff (D-CA) tore into President Donald Trump's latest claim that the California governor and Los Angeles mayor \"paid troublemakers, agitators and insurrectionists\" to riot — one of the many pretexts he is using to send the National Guard and Marin…",
    "link": "https://www.rawstory.com/adam-schiff-trump/",
    "timestamp": "2025-06-11T02:00:03Z"
  },
  {
    "title": "Senate HELP Committee Releases Plan for Higher Ed Reform",
    "description": "Senate Republicans want to eliminate so-called “inflationary loans,” stop federal aid to degrees that leave students worse off and expand the Pell Grant to workforce training programs as part of a draft plan released late Tuesday evening to overhaul higher ed…",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/06/10/senate-help-committee-releases-big-beautiful-bill",
    "timestamp": "2025-06-11T02:00:00Z"
  },
  {
    "title": "Former Japan envoy to U.S. calls for avoiding Trump's isolationist policies at G7",
    "description": "Former Japanese Ambassador to the United States Ichiro Fujisaki warned U.S. President Donald Trump may start saying his country will no longer participate in the summit.",
    "link": "https://www.japantimes.co.jp/news/2025/06/11/japan/politics/ex-japan-envoy-interview/",
    "timestamp": "2025-06-11T01:59:00Z"
  },
  {
    "title": "Gold rises on lower dollar, US-China trade uncertainty",
    "description": "Gold prices saw an increase on Wednesday. This rise is attributed to a weaker dollar and doubts surrounding the final United States-China trade deal. Markets are keenly awaiting United States inflation data for further guidance. United States and Chinese offi…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-rises-on-lower-dollar-us-china-trade-uncertainty/articleshow/121765667.cms",
    "timestamp": "2025-06-11T01:58:40Z"
  },
  {
    "title": "LA mayor imposes curfew amid escalating unrest",
    "description": "Los Angeles Mayor Karen Bass issues a curfew for downtown LA following a \"tipping point\" of looting and vandalism.",
    "link": "https://www.israelnationalnews.com/news/409784",
    "timestamp": "2025-06-11T01:57:09Z"
  },
  {
    "title": "Dollar holds steady after US, China reach framework deal to ease export curbs",
    "description": "The dollar remained stable against major currencies on Wednesday. This followed an agreement between the United States and China on a trade framework. The deal aims to resolve the trade war. Investors are watching for details. They hope it will rebuild trust …",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-holds-steady-after-us-china-reach-framework-deal-to-ease-export-curbs/articleshow/121765626.cms",
    "timestamp": "2025-06-11T01:54:36Z"
  },
  {
    "title": "Poll: Majority Approve Trump Deploying National Guard to Quell Los Angeles Riots",
    "description": "A new poll shows that a majority of Americans approve Trump deploying National Guard troops to quell the ongoing anti-ICE riots in LA.\nThe post Poll: Majority Approve Trump Deploying National Guard to Quell Los Angeles Riots appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/10/poll-majority-approve-trump-deploying-national-guard-to-quell-los-angeles-riots/",
    "timestamp": "2025-06-11T01:54:12Z"
  },
  {
    "title": "Gavin Newsom Warns Trump Is Acting as a Dictator Amid Protests: ‘Moment We Have Feared Has Arrived’",
    "description": "\"It clearly will not end here, other states will be next, democracy is next,\" the California governor says in a speech Tuesday night\nThe post Gavin Newsom Warns Trump Is Acting as a Dictator Amid Protests: ‘Moment We Have Feared Has Arrived’ appeared first on…",
    "link": "https://www.thewrap.com/gavin-newsom-warns-trump-is-acting-as-a-dictator-amid-protests-moment-we-have-feared-has-arrived/",
    "timestamp": "2025-06-11T01:53:16Z"
  },
  {
    "title": "The White House Is Delighted With Events in Los Angeles",
    "description": "But Trump aides know there are real risks for the president if troops are involved in violence.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/trump-national-guard-los-angeles-hegseth/683104/",
    "timestamp": "2025-06-11T01:53:00Z"
  },
  {
    "title": "Trump Vows He’ll Restore All Confederate Names to Military Bases: ‘I’m Superstitious…We Won a Lot of Battles Out of Those Forts’",
    "description": "President Donald Trump promised the troops at Fort Bragg that he would restore the names of all military bases previously named for Confederate generals, saying that he was \"very superstitious\" and \"we won a lot of battles out of those forts.\"\nThe post Trump …",
    "link": "https://www.mediaite.com/politics/trump/trump-vows-hell-restore-all-confederate-names-to-military-bases-im-superstitious-we-won-a-lot-of-battles-out-of-those-forts/",
    "timestamp": "2025-06-11T01:52:06Z"
  },
  {
    "title": "Appeals court lets Trump administration keep collecting tariffs while challenges continue",
    "description": "A federal appeals court agreed Tuesday to let the government keep collecting President Donald Trump’s sweeping import taxes while challenges to his signature trade policy continue on appeal",
    "link": "https://abcnews.go.com/Business/wireStory/appeals-court-lets-trump-administration-collecting-tariffs-challenges-122715758",
    "timestamp": "2025-06-11T01:50:33Z"
  },
  {
    "title": "Syria's post-war economic recovery will require 'substantial' international support, IMF says",
    "description": "The International Monetary Fund had said it visited Syria for the first time since 2009 as the country scrambles to rebuild after over a decade of conflict",
    "link": "https://abcnews.go.com/Business/wireStory/syrias-post-war-economic-recovery-require-substantial-international-122716179",
    "timestamp": "2025-06-11T01:50:29Z"
  },
  {
    "title": "Nighttime curfew in LA as Trump vows to 'liberate' city",
    "description": "A nighttime curfew was declared in Los Angeles on Tuesday as local officials sought to get a handle on protests that Donald Trump claimed were an invasion by...",
    "link": "https://www.yahoo.com/news/trump-deploys-marines-raising-tensions-132222433.html",
    "timestamp": "2025-06-11T01:48:34Z"
  },
  {
    "title": "BABBLES: Make motherland safe and prosperous",
    "description": "By Babbler Around four dozen Nepalis were deported from the USA on Sunday. Perhaps, this is the third group of […]\nThe post BABBLES: Make motherland safe and prosperous appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/06/11/babbles-make-motherland-safe-and-prosperous/",
    "timestamp": "2025-06-11T01:47:09Z"
  },
  {
    "title": "Los Angeles like protests over immigration raids spreading throughout United States",
    "description": "Demonstrations against immigration raids have erupted across America. Los Angeles saw initial protests, prompting a military response. Now, cities like Seattle, Austin, and New York are witnessing marches. Protesters oppose ICE actions. Some demonstrations tu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/los-angeles-like-protests-over-immigration-raids-spreading-throughout-united-states/articleshow/121765571.cms",
    "timestamp": "2025-06-11T01:44:59Z"
  },
  {
    "title": "Bar Association: 'Deeply Disturbing' That Pam Bondi Cut Us Out Of Vetting Trump’s Court Picks",
    "description": "In a new letter, ABA president William Bay says the DOJ's claims that the country's main legal organization is an activist group are \"unsupported by the facts.”",
    "link": "https://www.huffpost.com/entry/bar-association-pam-bondi-trump-judicial-nominees_n_6848c703e4b07d60ea75a2db",
    "timestamp": "2025-06-11T01:43:42Z"
  },
  {
    "title": "Dozens of congressional Republicans plan to snub Trump’s military parade",
    "description": "President Donald Trump is throwing himself a birthday celebration this weekend – but while the event honors both the Army’s 250th anniversary and Trump's own 79th birthday, most congressional Republicans won’t be there to celebrate.That’s according to a repor…",
    "link": "https://www.rawstory.com/trump-parade-2672345853/",
    "timestamp": "2025-06-11T01:43:09Z"
  },
  {
    "title": "US Justice Department says Trump can cancel national monuments that protect landscapes",
    "description": "Lawyers for President Donald Trump’s administration say he has the authority to abolish national monuments meant to protect historical and archaeological sites",
    "link": "https://abcnews.go.com/US/wireStory/us-justice-department-trump-cancel-national-monuments-protect-122714037",
    "timestamp": "2025-06-11T01:42:29Z"
  },
  {
    "title": "Nationwide protests erupt in the US over ICE raids as Trump deploys troops, plans military parade",
    "description": "Nationwide protests have erupted in response to immigration enforcement raids in Los Angeles, prompting President Trump's mobilization of National Guard troops. Demonstrations have spread to cities like Austin, Seattle, and Washington, D.C., with protesters d…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/nationwide-protests-erupt-in-the-us-over-ice-raids-as-trump-deploys-troops-plans-military-parade/articleshow/121765521.cms",
    "timestamp": "2025-06-11T01:37:51Z"
  },
  {
    "title": "Syria’s post-war economic recovery will require ‘substantial’ international support, IMF says",
    "description": "DAMASCUS, Syria (AP) — Syria will need “substantial international” support for its efforts to rehabilitate the economy, meet urgent humanitarian needs, and rebuild essential institutions and infrastructure, the International Monetary Fund said Tuesday. Syria …",
    "link": "https://financialpost.com/pmn/syrias-post-war-economic-recovery-will-require-substantial-international-support-imf-says",
    "timestamp": "2025-06-11T01:37:48Z"
  },
  {
    "title": "Ukraine says Russian strikes hit Kharkiv, killing two",
    "description": "Fresh Russian strikes on Ukraine’s northeastern city of Kharkiv killed two people and wounded 54 including children early Wednesday, authorities said, as Moscow pushed ahead with its relentless attacks after rejecting an unconditional ceasefire. “Seventeen st…",
    "link": "https://www.digitaljournal.com/world/ukraine-says-russian-strikes-hit-kharkiv-killing-two/article",
    "timestamp": "2025-06-11T01:37:20Z"
  },
  {
    "title": "LA Mayor Karen Bass imposes curfew on downtown over increased vandalism, looting from riots: ‘Reached a tipping point’",
    "description": "She said in a news conference that she had declared a local emergency and that the curfew will run from 8 p.m. Tuesday until 6 a.m. Wednesday.",
    "link": "https://nypost.com/2025/06/10/us-news/los-angeles-mayor-imposes-curfew-on-downtown-following-increased-nighttime-violence/",
    "timestamp": "2025-06-11T01:36:46Z"
  },
  {
    "title": "Trump admin approves waivers for 3 states to ban soda, other junk food from public food programs",
    "description": "Three states received federal waivers to prohibit participants in food assistance programs from buying junk food, bringing the total to six states reforming their food stamp programs.",
    "link": "https://www.foxnews.com/politics/trump-admin-approves-waivers-three-states-ban-soda-other-junk-food-from-public-food-programs",
    "timestamp": "2025-06-11T01:34:46Z"
  },
  {
    "title": "Kansas City protesters march against ICE",
    "description": "Demonstrators marched through Kansas City on Tuesday in protest of ICE enforcement.",
    "link": "https://www.kmbc.com/article/kansas-city-protesters-march-against-ice-enforcement-policies/65028851",
    "timestamp": "2025-06-11T01:34:32Z"
  },
  {
    "title": "Judge tosses lawsuit over Trump's firing of US African Development Foundation board members",
    "description": "A federal judge has tossed out a lawsuit over President Donald Trump’s dismantling of a U.S. federal agency that invests in African small businesses",
    "link": "https://abcnews.go.com/Business/wireStory/judge-tosses-lawsuit-trumps-firing-us-african-development-122714650",
    "timestamp": "2025-06-11T01:34:29Z"
  },
  {
    "title": "Trump Pick To Face Democrat Lawmaker In Key Governor’s Showdown",
    "description": "Jack Ciattarelli, the candidate endorsed by President Donald Trump, won the Republican nomination for New Jersey governor in a landslide Tuesday night — and is set to face Democratic New Jersey Rep. Mikie Sherrill, the winner of her party’s primary, in Novemb…",
    "link": "https://dailycaller.com/2025/06/10/jack-ciattarelli-mikie-sherrill-new-jersey-governor-primary/",
    "timestamp": "2025-06-11T01:32:39Z"
  },
  {
    "title": "Trump tariffs may remain in effect while appeals proceed, US appeals court rules",
    "description": "A federal appeals court has allowed President Trump's tariffs to remain in effect while it reviews a lower court decision that blocked them. The court will consider whether Trump exceeded his authority by imposing the tariffs under an emergency economic power…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-tariffs-may-remain-in-effect-while-appeals-proceed-us-appeals-court-rules/articleshow/121765478.cms",
    "timestamp": "2025-06-11T01:32:08Z"
  },
  {
    "title": "1 arrested as protesters fill Buford Highway over response to immigration raids in Los Angeles",
    "description": "What started out as a peaceful protest devolved into chaos on Tuesday night as police started breaking up an immigration protest in Brookhaven.",
    "link": "https://www.wsbtv.com/news/local/dekalb-county/1-arrested-protestors-fill-buford-highway-over-response-immigration-raids-los-angeles/T5R4JDB44VHY7N2KCDU3XKFINU/",
    "timestamp": "2025-06-11T01:30:40Z"
  },
  {
    "title": "Appeals court lets Trump administration keep collecting tariffs while challenges continue",
    "description": "A federal appeals court agreed Tuesday to let the government keep collecting President Donald Trump’s sweeping import taxes while challenges to his signature...",
    "link": "https://finance.yahoo.com/news/appeals-court-lets-trump-administration-013022256.html",
    "timestamp": "2025-06-11T01:30:22Z"
  },
  {
    "title": "Letters: We got housing right in the mid-20th century, long before ideology took over",
    "description": "Yet again I feel the need to comment on the affordable new home supply crisis. I use the term “home” as opposed to “house” or “apartment”, because that is what they are.",
    "link": "https://www.independent.ie/opinion/letters/letters-we-got-housing-right-in-the-mid-20th-century-long-before-ideology-took-over/a1505212530.html",
    "timestamp": "2025-06-11T01:30:00Z"
  },
  {
    "title": "Marines called into LA riot zone are only protecting federal officials and property",
    "description": "The marines that deployed to the Los Angeles area on orders from president Donald Trump have not yet been called to respond to the city’s immigration protests and are there only to protect federal officials and property, the Marine Corps commandant said yeste…",
    "link": "https://www.independent.ie/world-news/north-america/marines-called-into-la-riot-zone-are-only-protecting-federal-officials-and-property/a73132970.html",
    "timestamp": "2025-06-11T01:30:00Z"
  },
  {
    "title": "Everything You Need to Know About Todd and Julie Chrisley's Prison Release After Pair Were Pardoned by Donald Trump",
    "description": "Todd and Julie Chrisley are now free from behind bars thanks to President Donald Trump.",
    "link": "https://okmagazine.com/p/todd-julie-chrisley-prison-release-donald-trump-pardon/",
    "timestamp": "2025-06-11T01:30:00Z"
  },
  {
    "title": "Oil prices down, markets assess US-China trade talks outcome",
    "description": "TOKYO (Reuters) -Oil prices fell in early trade on Wednesday as markets were assessing the outcome of U.S.-China trade talks, yet to be reviewed by President...",
    "link": "https://finance.yahoo.com/news/oil-prices-down-markets-assess-012734371.html",
    "timestamp": "2025-06-11T01:27:34Z"
  },
  {
    "title": "Appeals court sides with Trump, allows tariffs to go into effect",
    "description": "President Donald Trump announcing his \"Liberation Day\" tariffs alongside Secretary of Commerce Howard Lutnick on April 2.\nCarlos Barria/REUTERS\nThe US Court of Appeals allows Trump's tariffs to remain pending further arguments.\nThe court will hear more argume…",
    "link": "https://biztoc.com/x/7a7b0227724bdcaa",
    "timestamp": "2025-06-11T01:26:39Z"
  },
  {
    "title": "There’s Growing Anger Over Mexican Flags Flown At LA Protests. Here’s What Everyone Is Getting Wrong.",
    "description": "Who gets to tell oppressed people how to resist their oppression?",
    "link": "https://www.huffpost.com/entry/mexican-flags-los-angeles-ice-protests_n_68486744e4b07d60ea7540e7",
    "timestamp": "2025-06-11T01:26:35Z"
  },
  {
    "title": "Stephen A. Smith Claims L.A. Riots will Sink Gavin Newsom’s 2028 Presidential Hopes",
    "description": "ESPN sportstalker Stephen A. Smith continues to delve into political discussions, this time addressing himself to California’s left-wing Democratic Gov. Gavin Newsom with the warning that the riots in L.A. will likely sink the governor’s 2028 presidential amb…",
    "link": "https://freerepublic.com/focus/f-chat/4322274/posts",
    "timestamp": "2025-06-11T01:26:04Z"
  },
  {
    "title": "CNN Data Chief Names 1 Group That's 'Tremendously' Shifted Toward GOP On Immigration",
    "description": "Harry Enten said this demographic has grown more \"hawkish\" on the issue.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-immigrant-citizens-views-trump-second-term_n_6848b678e4b0d219da1a224f",
    "timestamp": "2025-06-11T01:22:24Z"
  },
  {
    "title": "Korean Americans criticize Donald Trump Jr. for 'reckless' social media post",
    "description": "They accused the U.S. president's son of mocking the current Los Angeles unrest by referencing members of the community who reportedly opened fire on looters during riots in 1992.",
    "link": "https://www.japantimes.co.jp/news/2025/06/11/world/politics/korean-americans-donald-trump-jr/",
    "timestamp": "2025-06-11T01:22:00Z"
  },
  {
    "title": "Western powers submit IAEA resolution over Iran's nuclear non-compliance",
    "description": "Western powers submit a resolution to the UN's nuclear watchdog condemning Iran's \"non-compliance\" with its nuclear obligations.",
    "link": "https://www.israelnationalnews.com/news/409782",
    "timestamp": "2025-06-11T01:16:16Z"
  },
  {
    "title": "Watch: 'It's important' - LA protesters on why they're taking to the streets",
    "description": "Demonstrations have continued in other major US cities, including Chicago, where protesters clashed with police on Tuesday.",
    "link": "https://www.bbc.com/news/videos/cnv1l9vl8p5o",
    "timestamp": "2025-06-11T01:15:35Z"
  },
  {
    "title": "The Results From New Jersey's Governor's Race Are In",
    "description": "Jack Ciattarelli has secured the Republican nomination for New Jersey governor, giving the state a proven fiscal conservative and no-nonsense leader ready to rein in runaway taxes, restore public safety, and roll back the overreach of the Democratic machine. …",
    "link": "https://freerepublic.com/focus/f-news/4322268/posts",
    "timestamp": "2025-06-11T01:15:15Z"
  },
  {
    "title": "Protests Over Immigration Raids Pop Up Across The U.S. With More Planned",
    "description": "Protests that sprang up in Los Angeles over immigration enforcement raids are beginning to spread across the country.",
    "link": "https://www.huffpost.com/entry/us-immigration-protests_n_6848d6fbe4b0cf5f0c9a273e",
    "timestamp": "2025-06-11T01:14:32Z"
  },
  {
    "title": "Appeals court sides with Trump, allows tariffs to go into effect",
    "description": "The US Court of Appeals for the Federal Circuit on Tuesday allowed President Donald Trump's sweeping tariffs to stay in effect, pending more arguments.",
    "link": "https://www.businessinsider.com/appeals-court-allows-trump-tariffs-to-go-into-effect-2025-6",
    "timestamp": "2025-06-11T01:12:56Z"
  },
  {
    "title": "Army restores the names of seven bases that lost their Confederate-linked names under Biden",
    "description": "Seven Army bases whose names were changed in 2023 because they honored Confederate leaders are all reverting back to their original names",
    "link": "https://abcnews.go.com/US/wireStory/army-restores-names-bases-lost-confederate-linked-names-122715169",
    "timestamp": "2025-06-11T01:10:24Z"
  },
  {
    "title": "US appeals court rules Trump tariffs can stay during ongoing legal challenge",
    "description": "A US appeals court lets Trump’s broad tariffs stay while reviewing claims he exceeded authority under emergency law. Full hearing scheduled for July 31",
    "link": "https://www.thehindubusinessline.com/news/world/us-court-trump-tariffs-emergency-powers-legal-challenge/article69681329.ece",
    "timestamp": "2025-06-11T01:07:35Z"
  },
  {
    "title": "Rally at San Diego Int'l Airport slams 'racist' Trump travel ban",
    "description": "The people at the rally say the travel ban isn’t about safety, but rather it’s a racist policy meant to attack and punish immigrants.",
    "link": "https://www.kpbs.org/news/politics/2025/06/10/rally-at-san-diego-intl-airport-slams-racist-trump-travel-ban",
    "timestamp": "2025-06-11T01:06:55Z"
  },
  {
    "title": "Trump-backed ex-lawmaker wins nod for another run at NJ governor",
    "description": "A multiple-time Republican candidate for governor of New Jersey got another nomination on Tuesday night, The New York Times reported — with the blessing of President Donald Trump.\"With about 20 percent of the estimated vote reported, Mr. [Jack] Ciattarelli, a…",
    "link": "https://www.rawstory.com/jack-ciattarelli-2672345247/",
    "timestamp": "2025-06-11T01:05:48Z"
  },
  {
    "title": "CNBC Daily Open: The U.S. stock market could be a little too optimistic",
    "description": "The stock market seems to be betting on more trade breakthroughs and favorable inflation data. But the bond market and CEOs might not be so sure about that.",
    "link": "https://www.cnbc.com/2025/06/11/cnbc-daily-open-the-us-stock-market-could-be-a-little-too-optimistic.html",
    "timestamp": "2025-06-11T01:03:52Z"
  },
  {
    "title": "LA protests: Partial curfew goes into effect",
    "description": "A partial curfew has gone into effect in the downtown area of Los Angeles. Trump vowed to \"liberate\" Los Angeles, whole California Governor Newsom warned democracy was \"under assault.\" Follow DW for more.",
    "link": "https://www.dw.com/en/la-protests-partial-curfew-goes-into-effect/live-72850524",
    "timestamp": "2025-06-11T01:03:00Z"
  },
  {
    "title": "LA protests: Curfew set as Trump lambasts 'foreign enemy'",
    "description": "Trump vowed to \"liberate\" Los Angeles, hurling insults at the protesters during the US army anniversary. Meanwhile, LA Mayor Bass announced an overnight curfew in the downtown area. Follow DW for more.",
    "link": "https://www.dw.com/en/la-protests-curfew-set-as-trump-lambasts-foreign-enemy/live-72850524",
    "timestamp": "2025-06-11T01:03:00Z"
  },
  {
    "title": "Sarah Huckabee Sanders calls Gavin Newsom 'insane' for rejecting federal assistance during Los Angeles unrest",
    "description": "Sarah Huckabee Sanders defended President Trump deploying National Guard to L.A., stating Gavin Newsom is \"choos[ing] rioters and criminal illegals\" over American law enforcement.",
    "link": "https://www.foxnews.com/media/sarah-huckabee-sanders-calls-gavin-newsom-insane-rejecting-federal-assistance-during-los-angeles-unrest",
    "timestamp": "2025-06-11T01:00:35Z"
  },
  {
    "title": "The Boards for Correction of Military Records are an Insult to the Efforts of President Trump and Defense Secretary Hegseth, Undermining Their Intentions to Restore the Military",
    "description": "Tens of thousands of service members and veterans were negatively impacted by previous illegally mandated anthrax vaccines and COVID-19 shots.\nThe post The Boards for Correction of Military Records are an Insult to the Efforts of President Trump and Defense S…",
    "link": "https://www.thegatewaypundit.com/2025/06/boards-correction-military-records-are-insult-efforts-president/",
    "timestamp": "2025-06-11T01:00:29Z"
  }
]