[
  {
    "title": "Anti-Trump resistance sees another leader in Van Hollen as Democrats' leadership carousel turns (Steve Peoples/Associated Press)",
    "description": "Steve Peoples / Associated Press:\nAnti-Trump resistance sees another leader in Van Hollen as Democrats' leadership carousel turns  —  Now, it's Chris Van Hollen's turn.  The mild-mannered Maryland senator has suddenly emerged as a leading figure in the resist…",
    "link": "https://www.memeorandum.com/250420/p46",
    "timestamp": "2025-04-20T21:10:01Z"
  },
  {
    "title": "Trump hopes Russia, Ukraine will reach deal 'this week'",
    "description": "United States President Donald Trump expressed hope that Russia and Ukraine will reach a deal \"this week.\" In addition, the president said both countries would then be able to \"start to do big busines...",
    "link": "https://biztoc.com/x/8ef2f53eb456b3e6",
    "timestamp": "2025-04-20T21:08:16Z"
  },
  {
    "title": "‘War On Coal Is Finally Over’: Energy Experts Say Trump Admin’s Deregulation Agenda Could Fuel Coal’s Revival",
    "description": "Energy generated from burning coal only powers roughly 16% of the U.S., though 40 states are dependent on coal, according to data from America’s Power. Energy generation through coal reached a record low in 2023, a Rhodium Group study reported. In 2021, howev…",
    "link": "https://wattsupwiththat.com/2025/04/20/war-on-coal-is-finally-over-energy-experts-say-trump-admins-deregulation-agenda-could-fuel-coals-revival/",
    "timestamp": "2025-04-20T21:00:00Z"
  },
  {
    "title": "Will the global economy stall?",
    "description": "The timing could hardly have been less propitious. Just as the world economy was showing signs of stabilising, the odds of a policy-induced global recession have risen significantly. The latest update to the Brookings-FT Tiger index reveals a mixed picture, w…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3007159/will-the-global-economy-stall-",
    "timestamp": "2025-04-20T21:00:00Z"
  },
  {
    "title": "Democratic Party's Easter post on X snubs Biden while resurfacing holiday photos of Obama, Clinton, JFK",
    "description": "The Democratic Party's official X account went viral on Easter Sunday for its holiday post celebrating several Democratic presidents but omitting Joe Biden.",
    "link": "https://www.foxnews.com/media/democratic-partys-easter-post-x-snubs-biden-while-resurfacing-holiday-photos-obama-clinton-jfk",
    "timestamp": "2025-04-20T21:00:00Z"
  },
  {
    "title": "Tariffs divide New Hampshire business leaders | CloseUp",
    "description": "Hollie Noveletsky with Novel Iron Works and Jim Jalbert with C&J Bus Lines join WMUR's Adam Sexton on CloseUp to discuss how the recent tariffs imposed by President Donald Trump are impacting their businesses.",
    "link": "https://www.wmur.com/article/closeup-tariffs-business-new-hampshire/64534072",
    "timestamp": "2025-04-20T20:57:24Z"
  },
  {
    "title": "Corporate Chiefs Gave Trump’s Inaugural Committee $250 Billion. Benefits Abound.",
    "description": "Donald Trump’s inaugural committee raised almost $250 million, much of it from donors who are seeking—and in many cases have already received—valuable favors from the administration of the famously transactional president. The Wall Street Journal, which revie…",
    "link": "https://www.motherjones.com/politics/2025/04/trump-inauguration-funds-corporations-oligarchy/",
    "timestamp": "2025-04-20T20:47:29Z"
  },
  {
    "title": "'The guy with all those bankruptcies': Trump's Easter Day swipe at 'businessmen' backfires",
    "description": "Donald Trump on Sunday took a swipe at businessmen who criticize his signature policy, and observers immediately pounced on the purported irony.\n\nTrump over the weekend posted the following statement on Truth Social: \"THE BUSINESSMEN WHO CRITICIZE TARIFFS ARE…",
    "link": "https://www.rawstory.com/trump-businessmen-bankruptcies-observers/",
    "timestamp": "2025-04-20T20:46:31Z"
  },
  {
    "title": "US judge (Brian Murphy) halts Trump plan for rapid deportations to third countries",
    "description": "(Reuters) -A U.S. judge barred the Trump administration from rapidly deporting hundreds if not thousands of migrants to countries other than their own without giving them a chance to show they fear being persecuted, tortured or killed there. U.S. District Jud…",
    "link": "https://freerepublic.com/focus/f-news/4312201/posts",
    "timestamp": "2025-04-20T20:43:32Z"
  },
  {
    "title": "Sen. Van Hollen Accuses Trump Border Czar of Lying About Deportations: ‘Respect This Person’s Constitutional Rights’ | Video",
    "description": "Maryland's senator also tells ABC's Jon Karl about his visit to see Kilmar Armando Abrego Garcia in El Salvador\nThe post Sen. Van Hollen Accuses Trump Border Czar of Lying About Deportations: ‘Respect This Person’s Constitutional Rights’ | Video appeared firs…",
    "link": "https://www.thewrap.com/sen-van-hollen-trump-border-czar-lying-deportations/",
    "timestamp": "2025-04-20T20:43:05Z"
  },
  {
    "title": "Bill Maher Mocks AOC, Bernie, Cory Booker: It's Not About Big Crowds and Speeches, It's About Who Shows Up On Election Day",
    "description": "During his recent \"Real Time\" broadcast, HBO host Bill Maher scolded the Democrats for putting unserious people out front in the fight against President Donald Trump and said that neither AOC nor Bernie Sanders should be the Democrat nominee in 2028.",
    "link": "https://www.breitbart.com/entertainment/2025/04/20/bill-maher-mocks-aoc-bernie-cory-booker-its-not-about-big-crowds-and-speeches-its-about-who-shows-up-on-election-day/",
    "timestamp": "2025-04-20T20:36:23Z"
  },
  {
    "title": "Trump says he hopes Ukraine, Russia will make a deal this week",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump said on Sunday he hopes Russia and Ukraine will make a deal this week to end the conflict in Ukraine. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/21/trump-says-he-hopes-ukraine-russia-will-make-a-deal-this-week",
    "timestamp": "2025-04-20T20:33:00Z"
  },
  {
    "title": "'Bad at business': Trump lashes out at 'businessmen' critics in 'unhinged' Easter comments",
    "description": "Donald Trump on Easter lectured \"businessmen who criticize\" his policies.\n\nThe President of the United States took to his own social media network -- called Truth Social -- on Easter Sunday, first writing, \"HAPPY EASTER. WE WILL, MAKE AMERICA GREAT AGAIN! DON…",
    "link": "https://www.rawstory.com/trump-bad-at-business-easter/",
    "timestamp": "2025-04-20T20:28:32Z"
  },
  {
    "title": "‘SNL’ Star Bowen Yang Calls Aimee Lou Wood’s Backlash to ‘White Lotus’ Spoof ‘Completely Valid’: ‘Parody Can Go Too Far Sometimes’",
    "description": "“Saturday Night Live” cast member Bowen Yang is siding with Aimee Lou Wood after the “White Lotus” star took offense to her portrayal on the late-night sketch show. In a sit down with Extra, Yang said that it was “completely valid” for Wood to react how she d…",
    "link": "https://variety.com/2025/tv/news/bowen-yang-aimee-lou-wood-white-lotus-spoof-snl-1236373537/",
    "timestamp": "2025-04-20T20:26:28Z"
  },
  {
    "title": "Trump hopes Russia and Ukraine 'make deal this week' - as Putin's 'Easter truce' expires",
    "description": "Donald Trump has said he hopes Russia and Ukraine \"will make a deal this week\" as Vladimir Putin's \"Easter truce\" expired, with the two countries blaming each other for breaking it.",
    "link": "https://news.sky.com/story/trump-hopes-russia-and-ukraine-make-deal-this-week-as-putins-easter-truce-expires-13352928",
    "timestamp": "2025-04-20T20:26:00Z"
  },
  {
    "title": "Trump tariffs could lead to a summer drop-off in economic activity after an 'artificially high' start, Chicago Fed chief says",
    "description": "Business owners and CEOs are already stocking up on inventory, and some American shoppers are panic buying big-ticket items in anticipation of President Donald Trump's tariffs. The sudden buying binge could cause an \"artificially high\" level of economic activ…",
    "link": "https://biztoc.com/x/3092ea25bf40b98f",
    "timestamp": "2025-04-20T20:24:14Z"
  },
  {
    "title": "Trump says he hopes Ukraine, Russia will make a deal this week",
    "description": "U.S. President Donald Trump said on Sunday he hopes Russia and Ukraine will make a deal this week to end the conflict in Ukraine. \"BOTH WILL THEN START TO DO...",
    "link": "https://www.yahoo.com/news/trump-says-hopes-ukraine-russia-202403205.html",
    "timestamp": "2025-04-20T20:24:03Z"
  },
  {
    "title": "My Neighbor Tries To Deal With Cybertruck Hate: ‘At First It Was Thumbs Up But Lately…’",
    "description": "The Tesla Cybertruck has become the focus of a lot of the most extreme Tesla hostility, directed indiscriminately at innocent people.",
    "link": "https://www.forbes.com/sites/brookecrothers/2025/04/20/my-neighbor-tries-to-deal-with-cybertruck-hate-at-first-it-was-thumbs-up-but-lately/",
    "timestamp": "2025-04-20T20:24:02Z"
  },
  {
    "title": "First Shockwaves of Trump’s Tariffs Are About to Hit the World Economy",
    "description": "Supply Lines is a daily newsletter that tracks global trade. Sign up here.\nMost Read from Bloomberg\nThree weeks after US President Donald Trump effectively declared a trade war with the whole world, new economic forecasts and surveys will point to the initial…",
    "link": "https://biztoc.com/x/b9c0a2ba9dc492c8",
    "timestamp": "2025-04-20T20:23:56Z"
  },
  {
    "title": "‘Don’t Become Monsters!’ Joe Rogan Opposition to Trump on Due Process for Abrego Garcia Praised By Liberals",
    "description": "The podcast host typically criticized by the left received rare praise for speaking up in support of due process for cases like that of Kilmar Abrego Garcia.\nThe post ‘Don’t Become Monsters!’ Joe Rogan Opposition to Trump on Due Process for Abrego Garcia Prai…",
    "link": "https://www.mediaite.com/politics/dont-become-monsters-joe-rogan-opposition-to-trump-on-due-process-for-abrego-garcia-praised-by-liberals/",
    "timestamp": "2025-04-20T20:17:54Z"
  },
  {
    "title": "Zuckerberg, Dimon Sold Shares Ahead Of Stock Rout Triggered By Trump Tariff Talk",
    "description": "According to a latest report, insiders including Meta Platforms Inc. (NASDAQ:META)’s Mark Zuckerberg, Oracle Corp. (NYSE:ORCL)’s Safra Catz, and JPMorgan Chase & Co. (NYSE:JPM)’s Jamie Dimon offloaded shares worth billions prior to President Donald Trump‘s ta…",
    "link": "https://biztoc.com/x/4b2f6631af947634",
    "timestamp": "2025-04-20T20:13:15Z"
  },
  {
    "title": "Dems left with egg on their face as DNC appears to snub Biden on Easter",
    "description": "Former President Biden appeared to be snubbed by his own party on social media Sunday, being left out of a photo album that included the most recent Democratic presidents.",
    "link": "https://www.foxnews.com/politics/dems-egg-their-face-dnc-appears-nub-biden-easter",
    "timestamp": "2025-04-20T20:12:51Z"
  },
  {
    "title": "‘I’m About To Kick Your A*s’: Five Times Panels Came Unglued On Piers Morgan’s Program",
    "description": "Slowly becoming known for its unfiltered panelists, Morgan’s show has grown by sparking intense moments that often leave guests visibly unglued.",
    "link": "https://dailycaller.com/2025/04/20/piers-morgan-panel-unglued-donald-trump-mangione-democrats/",
    "timestamp": "2025-04-20T20:09:39Z"
  },
  {
    "title": "Kansas City has long been a federal hub. The pain from DOGE’s cuts is everywhere",
    "description": "With nearly 30,000 workers, the federal government is the largest employer in Missouri’s second largest metropolitan area.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_994d2e8c-d121-4aa2-aa5f-f323032422fa.html",
    "timestamp": "2025-04-20T20:09:00Z"
  },
  {
    "title": "DHL suspends some shipments to US amid Trump tariff regime",
    "description": "DHL Express is suspending some shipments to the US as Donald Trump's new tariff regime takes effect.",
    "link": "https://news.sky.com/story/dhl-suspends-some-shipments-to-us-amid-trump-tariff-regime-13352908",
    "timestamp": "2025-04-20T20:09:00Z"
  },
  {
    "title": "“The World will not be destroyed by those who do evil, but rather by those who watch them without doing anything to stop them.”",
    "description": "“The World will not be destroyed by those who do evil, but rather by those who watch them without doing anything to stop them.”",
    "link": "https://freerepublic.com/focus/f-news/4312195/posts",
    "timestamp": "2025-04-20T20:02:58Z"
  },
  {
    "title": "Are You Surprised That This Group Still Loves Donald Trump?",
    "description": "In the 2024 presidential election, Donald Trump saw his popularity soar with youth voters compared to former Vice President Kamala Harris. Youth voters, or those between ages eighteen and twenty-nine, make up a small subset of Trump’s fans. Yet Trump received…",
    "link": "https://biztoc.com/x/7ce908b0c7561555",
    "timestamp": "2025-04-20T20:02:09Z"
  },
  {
    "title": "Fox reporter denies 'pumping stocks' after scoop on 'significant' White House trade deal",
    "description": "A veteran Donald Trump reporter Sunday denied \"pumping\" the stock market after dropping a \"scoop\" about a purported White House trade deal in the works.\n\nFOX Biz senior correspondent Charles Gasparino, who reports on Trump often and earned the ire of MAGA whe…",
    "link": "https://www.rawstory.com/trump-trade-deal-pump-stocks/",
    "timestamp": "2025-04-20T19:59:05Z"
  },
  {
    "title": "Is the Smithsonian Museum of the American Latino Finally Moving Forward?",
    "description": "Amid the Trump administration’s mass deportation campaign, a bipartisan coalition is advocating for a bill that would guarantee the institution a spot on the National Mall.",
    "link": "http://hyperallergic.com/1004842/is-the-smithsonian-museum-of-the-american-latino-finally-moving-forward/",
    "timestamp": "2025-04-20T19:59:00Z"
  },
  {
    "title": "Justice Alito Shreds SCOTUS Colleagues for ‘Legally Questionable’ Ruling in Deportation Case — While Also Warning That Trump Must Follow It",
    "description": "Supreme Court Justice Samuel Alito denounced the decision handed down by his colleagues which blocked the Trump administration from deporting a group of Venezuelan migrants under the Alien Enemies Act. The Court, by a 7-2 margin, ruled against the Trump admin…",
    "link": "https://www.mediaite.com/news/justice-alito-shreds-scotus-colleagues-for-legally-questionable-ruling-in-deportation-case-while-also-warning-that-trump-must-follow-it/",
    "timestamp": "2025-04-20T19:56:30Z"
  },
  {
    "title": "Alito blasts 'unprecedented' SCOTUS move to halt Trump's Venezuelan deportations: 'Legally questionable'",
    "description": "Justice Samuel Alito issued a strongly-worded dissent against the SCOTUS decision to stop President Trump's deportations of Venezuelan criminals under the Alien Enemies Act of 1798.",
    "link": "https://www.foxnews.com/politics/alito-blasts-unprecedented-scotus-move-halt-trumps-venezuelan-deportations-legally-questionable",
    "timestamp": "2025-04-20T19:54:04Z"
  },
  {
    "title": "Alito blasts 'unprecedented' SCOTUS move to halt Trump's Venezuela deportations: 'Legally questionable'",
    "description": "Justice Samuel Alito issued a strongly-worded dissent against the SCOTUS decision to stop President Trump's deportations of Venezuelan criminals under the Alien Enemies Act of 1798.",
    "link": "https://www.foxnews.com/politics/alito-blasts-unprecedented-scotus-move-halt-alien-enemies-act-deportations-legally-questionable",
    "timestamp": "2025-04-20T19:54:04Z"
  },
  {
    "title": "Donald Trump's Trade War: JPMorgan Predicts Deals, Higher Taxes and Potential Recession Avoidance",
    "description": "JPMorgan (NYSE:JPM) has predicted that the ongoing tariff war initiated by President Donald Trump could lead to some agreements between the US and its trade partners, along with a significant rise in tax rates.\nWhat Happened: The global investment strategy te…",
    "link": "https://biztoc.com/x/1dbf400d50c38c4f",
    "timestamp": "2025-04-20T19:50:40Z"
  },
  {
    "title": "Trump faces bipartisan criticism over Abrego Garcia deportation",
    "description": "Maryland senator calls Abrego Garcia case a 'constitutional crisis,' a Louisiana senator says its a 'screw up'",
    "link": "https://www.npr.org/2025/04/20/g-s1-61475/trump-faces-bipartisan-criticism-over-abrego-garcia-deportation",
    "timestamp": "2025-04-20T19:50:29Z"
  },
  {
    "title": "Amid Trump's feud with Jerome Powell, a GOP senator says the Fed Chair has 'tiger blood' and will 'do what he thinks is right'",
    "description": "Sen. John Kennedy of Louisiana said on NBC's \"Meet the Press\" that he doesn't think Trump can oust Powell as chair of the Federal Reserve.",
    "link": "https://www.businessinsider.com/jerome-powell-trump-federal-reserve-john-kennedy-tariffs-2025-4",
    "timestamp": "2025-04-20T19:48:37Z"
  },
  {
    "title": "Politico’s Jonathan Martin Rips Trump for Snubbing Gov. Shapiro After Attack on His Residence — Doubles Down Amid Criticism from the Right",
    "description": "Jonathan Martin, senior political columnist at Politico, criticized Donald Trump for staying silent after a suspected arson attack on the Pennsylvania governor’s residence. When faced with backlash from conservatives online, Martin stood by his comments and d…",
    "link": "https://www.mediaite.com/tv/politicos-jonathan-martin-rips-trump-for-snubbing-gov-shapiro-after-attack-on-his-residence-doubles-down-amid-criticism-from-the-right/",
    "timestamp": "2025-04-20T19:38:23Z"
  },
  {
    "title": "Bitcoin’s Largest Holders Are Stacking Again — What It Means For The Market",
    "description": "The Bitcoin market has shown high volatility in April, having produced similar levels of gains and losses over the past three weeks. Amidst the choppy price action, Bitcoin whales appear to be increasing their holdings, perhaps in anticipation of future price…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoins-largest-holders-are-stacking-again-what-it-means-for-the-market/",
    "timestamp": "2025-04-20T19:30:18Z"
  },
  {
    "title": "Trump draft executive order would make sweeping changes to the U.S. State Department",
    "description": "The Trump administration could soon roll out sweeping changes to the U.S.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-draft-executive-order-sweeping-changes-state-department-rcna202047",
    "timestamp": "2025-04-20T19:29:51Z"
  },
  {
    "title": "Firing Federal Reserve Chair Jerome Powell would hurt the dollar and US economy: France",
    "description": "French Finance Minister Eric Lombard cautioned that President Trump's potential dismissal of Federal Reserve Chair Jerome Powell would jeopardize the dollar's credibility and destabilize the US economy. Lombard highlighted Trump's previous tariff actions as d…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/firing-federal-reserve-chair-jerome-powell-would-hurt-the-dollar-and-us-economy-france/articleshow/120463550.cms",
    "timestamp": "2025-04-20T19:29:09Z"
  },
  {
    "title": "Modi-Vance talks today; Vances to visit Akshardham temple",
    "description": "STATE TIMES NEWS NEW DELHI: Prime Minister Narendra Modi will host a dinner for US Vice President J D Vance and Indian-origin Second Lady Usha on Monday evening after holding talks with the American leader on a range of key issues, including trade, tariff, re…",
    "link": "https://statetimes.in/modi-vance-talks-today-vances-to-visit-akshardham-temple/",
    "timestamp": "2025-04-20T19:28:15Z"
  },
  {
    "title": "Anti-Trump resistance sees another leader in Van Hollen as Democrats' leadership carousel turns",
    "description": "Chris Van Hollen has emerged, for now, as a leading figure in the resistance to President Donald Trump",
    "link": "https://abcnews.go.com/Politics/wireStory/anti-trump-resistance-sees-leader-van-hollen-democrats-120994590",
    "timestamp": "2025-04-20T19:26:19Z"
  },
  {
    "title": "Toll on Manhattan drivers remains in effect, despite Trump’s Easter Sunday deadline",
    "description": "Manhattan’s congestion toll remains in effect, despite an Easter deadline from President Donald Trump’s administration to halt the first-in-the-nation fee",
    "link": "https://abcnews.go.com/Politics/wireStory/toll-manhattan-drivers-remains-effect-despite-trumps-easter-120994402",
    "timestamp": "2025-04-20T19:24:54Z"
  },
  {
    "title": "President Trump Lifts Commercial Fishing Ban In Central Pacific-Fishing Industry Celebrates",
    "description": "https://www.thegatewaypundit.com/2025/04/president-trump-lifts-commercial-fishing-ban-central-pacific/President Donald Trump signed two executive orders and a proclamation aimed at reducing regulatory burdens on the U.S. fishing industry, and combating unfair…",
    "link": "https://freerepublic.com/focus/f-news/4312189/posts",
    "timestamp": "2025-04-20T19:20:55Z"
  },
  {
    "title": "Axed Pentagon aides claim their character was 'slandered,' little details were shared about leak investigation",
    "description": "Three Three top Pentagon aides who were fired on Friday night after being placed on leave in relation to an investigation examining unauthorized leaks have spoken out about the situation was handled by leaders.",
    "link": "https://www.foxnews.com/politics/axed-pentagon-aides-claim-character-slandered-little-details-were-shared-about-leak-investigation",
    "timestamp": "2025-04-20T19:20:18Z"
  },
  {
    "title": "'He Is Risen!': Trump Posts Easter Message of Devotion to the Nation",
    "description": "President Donald Trump, who in his wheeling and dealing developer years in New York was never described as a religious man, posted a particularly reverent post to the nation for Easter Sunday.\nThe post ‘He Is Risen!’: Trump Posts Easter Message of Devotion to…",
    "link": "https://www.breitbart.com/faith/2025/04/20/trump-posts-easter-message-of-devotion-to-the-nation/",
    "timestamp": "2025-04-20T19:19:56Z"
  },
  {
    "title": "Vice President JD Vance, Pope Francis Have Easter Sunday Meeting At Vatican",
    "description": "Vice President JD Vance met with Pope Francis on Easter Sunday, a diplomatic high-water mark for his ongoing April 18-24 trip to Italy, Vatican City and India.",
    "link": "https://dailycaller.com/2025/04/20/jd-vance-meets-pope-francis-vatican-easter-sunday-pietro-parolin-paul-gallagher/",
    "timestamp": "2025-04-20T19:15:43Z"
  },
  {
    "title": "President Donald Trump continues to lose supporters. Now, Senator John Kennedy opposes his plans to send US citizens to foreign prisons",
    "description": "Senator John Kennedy disagreed with Donald Trump’s idea of sending US citizens to foreign prisons. Kennedy cited constitutional protections and said such actions are against American law.",
    "link": "https://economictimes.indiatimes.com/news/international/us/president-donald-trump-continues-to-lose-supporters-now-senator-john-kennedy-opposes-his-plans-to-send-us-citizens-to-foreign-prisons/articleshow/120462993.cms",
    "timestamp": "2025-04-20T19:13:13Z"
  },
  {
    "title": "Clyburn blames media for Democratic failures, takes aim at Washington Post",
    "description": "Rep. James Clyburn blamed the media on Friday for Democratic messaging failures and specifically called out the Washington Post for caving to a \"wannabe dictator.\"",
    "link": "https://www.foxnews.com/media/clyburn-blames-media-democratic-failures-takes-aim-washington-post",
    "timestamp": "2025-04-20T19:12:25Z"
  },
  {
    "title": "Chickens. Pickup trucks. Trade war? | CNN Business",
    "description": "It’s called a chicken tax, but it’s levied on pickups. And it shows just why President Donald Trump’s tariffs could change the US economy longer than you might think.",
    "link": "https://www.cnn.com/2025/04/20/business/chicken-tax-auto-tariffs/index.html",
    "timestamp": "2025-04-20T19:12:12Z"
  },
  {
    "title": "‘Ludicrous arguments’: Trump planning overhaul of Endangered Species Act",
    "description": "Predicted to have 'a seismic, real-world effect on the ability to build'",
    "link": "https://www.wnd.com/2025/04/ludicrous-arguments-trump-planning-overhaul-of-endangered-species-act/",
    "timestamp": "2025-04-20T19:08:55Z"
  },
  {
    "title": "Meet the Key Five People Who Are Shaping Trump's Economic Agenda",
    "description": "In the midst of a broad tariff agenda that has caused turmoil in financial markets, President Donald Trump is relying on a diverse group of economic advisers to guide his policies.\nWhat Happened: The team comprises of Treasury Secretary Scott Bessent, Senior …",
    "link": "https://biztoc.com/x/ed4cce3ba402dd48",
    "timestamp": "2025-04-20T19:06:38Z"
  },
  {
    "title": "Read Justice Alito’s dissent from late-night Supreme Court order blocking some deportations",
    "description": "The Supreme Court acted “literally in the middle of the night” and without sufficient explanation in blocking the Trump administration from deporting any Venezuelans held in northern Texas under an 18th-century wartime law, Justice Samuel Alito wrote in a sha…",
    "link": "https://www.pbs.org/newshour/politics/read-justice-alitos-dissent-from-late-night-supreme-court-order-blocking-some-deportations",
    "timestamp": "2025-04-20T19:04:03Z"
  },
  {
    "title": "Zelensky accuses Russia of 2,000 ceasefire violations",
    "description": "President Volodymyr Zelensky on Sunday accused Russia of carrying out more than 2,000 violations of Russian President Vladimir Putin's Easter truce, but suggested extending a pause on aerial strikes after a day of no air raid alerts across Ukraine.",
    "link": "https://www.hurriyetdailynews.com/zelensky-accuses-russia-of-2-000-ceasefire-violations-208284",
    "timestamp": "2025-04-20T19:01:30Z"
  },
  {
    "title": "Letitia James reaps what she sows after leveling 'laughable' case at Trump: expert",
    "description": "The Trump administration's criminal referral targeting New York Attorney General Letitia James for reported mortgage fraud likely never would have unfolded if not for the Democrat's years of targeting the president in court, a New York City real estate attorn…",
    "link": "https://freerepublic.com/focus/f-news/4312186/posts",
    "timestamp": "2025-04-20T19:00:19Z"
  },
  {
    "title": "Rep. James Clyburn Blames the Democrats’ Problems on the Media Not Being Friendly Enough to Them",
    "description": "\"We have The Washington Post, for instance, caving to this wannabe dictator and we've got other media entities that seem to rather push a narrative that will bring eyes to their newspapers or their television sets and not really give a fair hearing or reporti…",
    "link": "https://legalinsurrection.com/2025/04/rep-james-clyburn-blames-the-democrats-problems-on-the-media-not-being-friendly-enough-to-them/",
    "timestamp": "2025-04-20T19:00:03Z"
  },
  {
    "title": "Are AI Energy Concerns Overblown?",
    "description": "Last week, tech moguls pleaded with the United States Congress to ramp up energy production to meet soaring energy demand driven by artificial intelligence. The already considerable energy footprint of data centers is sharply on the rise, and is projected to …",
    "link": "https://oilprice.com/Energy/Energy-General/Are-AI-Energy-Concerns-Overblown.html",
    "timestamp": "2025-04-20T19:00:00Z"
  },
  {
    "title": "High-ranking Dem Jamie Raskin threatens countries that support Trump: ‘When we come back to power … we are not going to look kindly’",
    "description": "\"Implicit in it should be the idea that if and when we come back to power — and we will — we are not going to look kindly upon people who ... facilitated authoritarianism in our country,\" Rep. Jamie Raskin said.",
    "link": "https://nypost.com/2025/04/20/us-news/dem-rep-jamie-raskin-threatens-countries-that-support-trump/",
    "timestamp": "2025-04-20T18:59:56Z"
  },
  {
    "title": "Far-Right Activist Tied to Jailed Chinese Fraudster Joins Team Trump. He’s Not Alone.",
    "description": "Miles Guo, an exiled Chinese billionaire best known for his ties to Steve Bannon, is in a Brooklyn jail awaiting sentencing following his conviction for orchestrating a massive fraud scheme. But Guo’s years of using his wealth to forge ties with people close …",
    "link": "https://www.motherjones.com/politics/2025/04/miles-guo-gavin-wax-trump-leavitt-bove-connections/",
    "timestamp": "2025-04-20T18:57:25Z"
  },
  {
    "title": "Ivanka Trump Heads Back to the Beach in Black Bikini, Surfing Again",
    "description": "Ivanka Trump's surfing enough this week to consider going pro ... 'cause she was back out in the ocean off the coast of Costa Rica, sporting another bikini. The First Daughter hit the beach with a few pals ... walking into the crisp ocean blue with…\n Permalink",
    "link": "https://www.tmz.com/2025/04/20/ivanka-trump-beach-surfing-costa-rica/",
    "timestamp": "2025-04-20T18:56:54Z"
  },
  {
    "title": "The Ukraine mineral deal is a win for America, Ukraine, and peace",
    "description": "'Trump is offering Zelensky a lifeline'",
    "link": "https://www.wnd.com/2025/04/the-ukraine-mineral-deal-is-a-win-for-america-ukraine-and-peace/",
    "timestamp": "2025-04-20T18:56:36Z"
  },
  {
    "title": "Chicago Fed President Austan Goolsbee says a move by Trump to terminate Jerome Powell would ‘undermine the credibility of the Fed’",
    "description": "President Donald Trump said this week Fed chair Jerome Powell’s “termination cannot come fast enough.” That’s led to a debate about whether the president has the power to remove Federal Reserve leadership. Chicago Fed President Austan Goolsbee says this move …",
    "link": "https://biztoc.com/x/b94dd9b0b167c061",
    "timestamp": "2025-04-20T18:55:29Z"
  },
  {
    "title": "Robert F. Kennedy Jr. suggests compensating families of some people with autism",
    "description": "The Health and Human Services secretary defended his claims about children with autism that drew backlash last week, saying he was referring to a quarter of ...",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/20/rfk-jr-autism-claims-compensate-families/83185167007/",
    "timestamp": "2025-04-20T18:54:53Z"
  },
  {
    "title": "More CEOs eye exit as going gets tough, options spring up",
    "description": "India Inc. is witnessing a surge in CEO departures, with a significant increase in exits at NSE-listed companies during the March quarter of 2025. This trend is fueled by factors like new opportunities, talent scarcity, heightened scrutiny, and rising expecta…",
    "link": "https://economictimes.indiatimes.com/jobs/c-suite/more-ceos-eye-exit-as-going-gets-tough-options-spring-up/articleshow/120462541.cms",
    "timestamp": "2025-04-20T18:54:26Z"
  },
  {
    "title": "US vice president JD Vance's India trip signals high-level US engagement with India",
    "description": "US Vice President JD Vance's India visit marks a period of intensified bilateral engagement following President Trump's inauguration. Discussions will encompass US participation in India's civil nuclear energy sector and the scheduling of the Quad summit. Van…",
    "link": "https://economictimes.indiatimes.com/news/india/us-vice-president-jd-vances-india-trip-signals-high-level-us-engagement-with-india/articleshow/120462530.cms",
    "timestamp": "2025-04-20T18:53:55Z"
  },
  {
    "title": "New Mexico Democrat Judge Resigns After ICE Arrests Alleged Tren de Aragua Gang Member in His Home - NewsBreak",
    "description": "A Democrat judge in New Mexico resigned from his bench last month after immigration agents arrested an alleged Tren de Aragua gang member living in his hom",
    "link": "https://www.newsbreak.com/share/3970907356242-new-mexico-democrat-judge-resigns-after-ice-arrests-alleged-tren-de-aragua-gang-member-in-his-home?_f=app_share&pd=09bogymu&lang=en_US&send_time=1745174900&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.16.0.29%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v5%2Cns_foryou_recall_exp_25q2-v4%2Cns_foryou_model_exp_25q1-v3%2Cns_local_strategy_25q1_exp-v6%2Cns_push_exp_rt_bucketv12-v8&s=i2",
    "timestamp": "2025-04-20T18:51:59Z"
  },
  {
    "title": "Chicago Fed President Austan Goolsbee says a move by Trump to terminate Jerome Powell would ‘undermine the credibility of the Fed’",
    "description": "President Donald Trump said this week Jerome Powell’s “termination cannot come fast enough.”",
    "link": "https://www.yahoo.com/news/chicago-fed-president-austan-goolsbee-184920887.html",
    "timestamp": "2025-04-20T18:49:20Z"
  },
  {
    "title": "Pentagon review of close combat training standards is long overdue",
    "description": "Goals should not include 'percentage-based demographic quotas'",
    "link": "https://www.wnd.com/2025/04/pentagon-review-of-close-combat-training-standards-is-long-overdue/",
    "timestamp": "2025-04-20T18:46:16Z"
  },
  {
    "title": "FTX Founder Sam Bankman-Fried Transferred to Low-Security Federal Prison in Los Angeles",
    "description": "The incarcerated founder of bankrupt crypto exchange FTX is now detained in a correctional facility in Los Angeles, California. According to the inmate database of the Federal Bureau of Prisons (BOP), Sam Bankman-Fried is currently serving time at the Federal…",
    "link": "https://dailyhodl.com/2025/04/20/ftx-founder-sam-bankman-fried-transferred-to-low-security-federal-prison-in-los-angeles/",
    "timestamp": "2025-04-20T18:45:54Z"
  },
  {
    "title": "Hamas Video Shows Israeli Hostage Urging Trump To Gain His Release",
    "description": "Hamas Video Shows Israeli Hostage Urging Trump To Gain His Release\n \nOn Saturday the armed wing of Hamas, known as the Qassam Brigades, issued a 'proof of life' video showing Israeli hostage Elkana Buhbut speaking to his US national wife in a phone call, requ…",
    "link": "https://biztoc.com/x/f8350e9642069b02",
    "timestamp": "2025-04-20T18:44:32Z"
  },
  {
    "title": "Ranked-Choice Voting Is One of the Greatest Threats to Democracy.",
    "description": "RANKED-CHOICE VOTING IS ONE OF THE GREATEST THREATS TO DEMOCRACY. It is a total, and very fraudulent, JOKE! https://thehill.com/opinion/campaign/5253950-ranked-choice-voting-unpopular-legislatures/Action in state legislative sessions are proving that ranked-c…",
    "link": "https://freerepublic.com/focus/f-news/4312184/posts",
    "timestamp": "2025-04-20T18:42:43Z"
  },
  {
    "title": "Trump DOJ Opens Door to Reversing Peter Navarro’s Criminal Conviction",
    "description": "The Justice Department under President Donald Trump is reconsidering the legal basis for Peter Navarro’s 2023 conviction for criminal contempt of Congress, according to court filings reviewed by The Washington Post. In a motion filed two weeks ago that was  v…",
    "link": "https://www.mediaite.com/news/trump-doj-opens-door-to-reversing-peter-navarros-criminal-conviction/",
    "timestamp": "2025-04-20T18:30:48Z"
  },
  {
    "title": "Trump is defending Obamacare at the Supreme Court. A win could boost RFK Jr.’s influence | CNN Politics",
    "description": "President Donald Trump’s Justice Department is defending the Affordable Care Act before the Supreme Court – a notable contrast to his first term, when his administration sought to repeal the law in Congress and then refused to defend it in a major challenge b…",
    "link": "https://www.cnn.com/2025/04/20/politics/obamacare-affordable-care-act-supreme-court-rfk-jr/index.html",
    "timestamp": "2025-04-20T18:30:22Z"
  },
  {
    "title": "Happy Easter to all, including the Radical Left Lunatics who are fighting and scheming so hard to bring Murderers, Drug Lords, Dangerous Prisoners, the Mentally Insane, and well known MS-13 Gang Members and Wife Beaters, back into our Country.",
    "description": "Happy Easter also to the WEAK and INEFFECTIVE Judges and Law Enforcement Officials who are allowing this sinister attack on our Nation to continue, an attack so violent that it will never be forgotten! Sleepy Joe Biden purposefully allowed Millions of CRIMINA…",
    "link": "https://freerepublic.com/focus/f-news/4312182/posts",
    "timestamp": "2025-04-20T18:26:19Z"
  },
  {
    "title": "15 years after Deepwater Horizon oil spill, lawsuits and coastal restoration have stalled",
    "description": "Fifteen years after the Deepwater Horizon oil rig exploded off the Gulf Coast, killing 11 and sending 134 million gallons of crude gushing into the ocean, the effects of the nation's worst offshore oil spill are still being felt.",
    "link": "https://www.pbs.org/newshour/nation/15-years-after-deepwater-horizon-oil-spill-lawsuits-and-coastal-restoration-have-stalled",
    "timestamp": "2025-04-20T18:23:18Z"
  },
  {
    "title": "Exclusive: Van Hollen Never Reached Out About Daughter's Murder—Patty Morin",
    "description": "The mother of Rachel Morin, who was killed by an undocumented migrant, rebuked her senator in comments to Newsweek on Sunday.",
    "link": "https://www.newsweek.com/exclusive-chris-van-hollen-never-reached-out-daughters-murder-patty-morin-2061921",
    "timestamp": "2025-04-20T18:22:25Z"
  },
  {
    "title": "Japan Reacts to Trump's Tariffs",
    "description": "As former U.S. President Donald Trump’s trade policies—particularly tariffs—once again become a topic of global attention, Japanese citizens are voicing a wide range of opinions. (News On Japan)",
    "link": "https://newsonjapan.com/article/145483.php",
    "timestamp": "2025-04-20T18:20:47Z"
  },
  {
    "title": "Pope Francis Meets JD Vance On Easter Sunday For Brief Conversation After Clash Over Immigration",
    "description": "A Catholic convert, the vice president spent the weekend in Rome meeting with various Italian and Vatican leaders.",
    "link": "https://www.vanityfair.com/news/story/pope-francis-meets-jd-vance-easter-2025",
    "timestamp": "2025-04-20T18:15:26Z"
  },
  {
    "title": "This Midwestern city has long been a federal hub. The pain from DOGE’s cuts is everywhere",
    "description": "The Kansas City, Missouri, metropolitan area has long been a regional hub for the federal government, and the pain from the Trump administration's cuts can be seen everywhere",
    "link": "https://abcnews.go.com/Business/wireStory/midwestern-city-long-federal-hub-pain-doges-cuts-120987832",
    "timestamp": "2025-04-20T18:14:19Z"
  },
  {
    "title": "Hunter Biden Whistleblower Replaced As Acting IRS Commissioner Just Days Into Job",
    "description": "The acting commissioner of the Internal Revenue Service was replaced Friday three days after assuming the role, following a power struggle",
    "link": "https://dailycaller.com/2025/04/20/gary-shapley-acting-internal-revenue-service-commissioner-replaced/",
    "timestamp": "2025-04-20T18:14:01Z"
  },
  {
    "title": "Trump tariffs could lead to a summer drop-off in economic activity after an 'artificially high' start, Chicago Fed chief says",
    "description": "Business owners and CEOs are already stocking up on inventory, and some American shoppers are panic buying big-ticket items in anticipation of President Donald Trump's tariffs. The sudden buying binge could cause an \"artificially high\" level of economic activ…",
    "link": "https://biztoc.com/x/339a567a029e8c29",
    "timestamp": "2025-04-20T18:11:39Z"
  },
  {
    "title": "Van Hollen: U.S. in 'Constitutional Crisis' over Abrego Garcia Case",
    "description": "Senator Chris Van Hollen (D-MD) said Sunday on NBC's \"Meet the Press\" that President Donald Trump had placed the United States into a constitutional crisis over the case of Kilmar Abrego Garcia.\nThe post Van Hollen: U.S. in ‘Constitutional Crisis’ over Abrego…",
    "link": "https://www.breitbart.com/clips/2025/04/20/van-hollen-u-s-in-constitutional-crisis-over-abrego-garcia-case/",
    "timestamp": "2025-04-20T18:08:28Z"
  },
  {
    "title": "Russia-Ukraine war: US says it would welcome extension of ceasefire",
    "description": "The U.S. State Department expressed openness to extending the Easter ceasefire declared by Vladimir Putin, despite conflicting reports of violations from both Russia and Ukraine. While Putin announced a one-day truce, the Kremlin later indicated no extension …",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-ukraine-war-us-says-it-would-welcome-extension-of-ceasefire/articleshow/120461074.cms",
    "timestamp": "2025-04-20T18:03:00Z"
  },
  {
    "title": "Major brands from tech to fashion announce price hike due to Trump’s new tariffs: Here’s what will cost you more",
    "description": "With a sweeping 10% tariff now applied to nearly all imports, excluding critical sectors such as semiconductors and pharmaceuticals, businesses are adjusting their operations to adapt to the shifting trade environment.",
    "link": "https://economictimes.indiatimes.com/news/international/us/major-brands-from-tech-to-fashion-announce-price-hike-due-to-trumps-new-tariffs-heres-what-will-cost-you-more/articleshow/120460851.cms",
    "timestamp": "2025-04-20T18:02:45Z"
  },
  {
    "title": "Trump tariffs could lead to a summer drop-off in economic activity after an 'artificially high' start, Chicago Fed chief says",
    "description": "Chicago Fed president Austan Goolsbee forecasts a potential short-term economic bump from President Trump's tariffs, followed by a summer drop-off.",
    "link": "https://www.cnbc.com/2025/04/20/trump-tariffs-could-cause-summer-economic-slump-chicago-fed-president.html",
    "timestamp": "2025-04-20T18:02:08Z"
  },
  {
    "title": "Russia attacking Ukraine despite Easter truce, says Zelenskiy",
    "description": "Either Putin has lost control of his army or Russia has ‘no intention of making a genuine move towards ending the war’, says Ukrainian president",
    "link": "https://www.irishtimes.com/world/europe/2025/04/20/russia-attacking-ukraine-despite-easter-truce-says-zelenskiy/",
    "timestamp": "2025-04-20T18:00:43Z"
  },
  {
    "title": "Strollers and other baby products will get more expensive -- and harder to find -- with tariffs",
    "description": "Strollers and other baby products will get more expensive -- and harder to find -- with tariffsksat.com",
    "link": "https://www.ksat.com/business/2025/04/20/strollers-and-other-baby-products-will-get-more-expensive-and-harder-to-find-with-tariffs/",
    "timestamp": "2025-04-20T18:00:37Z"
  },
  {
    "title": "Trump Resistance Losing Its Grip in Deep-Blue California",
    "description": "The poll found that voters are far more likely to support a \"détente\" with the White House.\nThe post Trump Resistance Losing Its Grip in Deep-Blue California first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/trump-resistance-losing-its-grip-in-deep-blue-california/",
    "timestamp": "2025-04-20T18:00:36Z"
  },
  {
    "title": "President Trump Lifts Commercial Fishing Ban In Central Pacific-Fishing Industry Celebrates",
    "description": "President Trump's recent executive orders aim to revitalize the U.S. fishing industry by lifting a significant commercial fishing ban in the Central Pacific, promising economic benefits and sustainable practices.\nThe post President Trump Lifts Commercial Fish…",
    "link": "https://www.thegatewaypundit.com/2025/04/president-trump-lifts-commercial-fishing-ban-central-pacific/",
    "timestamp": "2025-04-20T18:00:34Z"
  },
  {
    "title": "Federal Judge Permanently Enjoins Equal Employment Opportunity Commission Abortion Regulation for Catholic Business Group",
    "description": "Catholic businesses may not be forced to subsidize abortions or fertility treatments, ruled federal Judge Daniel Traynor, a Donald Trump appointee to the District Court of North... Read More\nThe post Federal Judge Permanently Enjoins Equal Employment Opportun…",
    "link": "https://www.dailysignal.com/2025/04/20/federal-judge-permanently-enjoins-equal-employment-opportunity-commission-abortion-regulation-for-catholic-business-group/",
    "timestamp": "2025-04-20T18:00:00Z"
  },
  {
    "title": "‘You Can’t Ignore a Tattoo!’ Trump Border Czar Tom Homan Defends Tattoos as Grounds for Deportations in Testy Exchange With ABC’s Karl",
    "description": "Tom Homan — the border czar for President Trump — defended using tattoos as justification for migrant deportations, when confronted by ABC's Jonathan Karl.\nThe post ‘You Can’t Ignore a Tattoo!’ Trump Border Czar Tom Homan Defends Tattoos as Grounds for Deport…",
    "link": "https://www.mediaite.com/news/you-cant-ignore-a-tattoo-trump-border-czar-tom-homan-defends-tattoos-as-grounds-for-deportations-in-testy-exchange-with-abcs-karl/",
    "timestamp": "2025-04-20T17:57:53Z"
  },
  {
    "title": "Trump’s ‘Happy Easter’ Message Filled with Vengeance and Vitriol",
    "description": "Donald Trump's happy Easter message was a screed blasting his enemies, including \"Radical Left Lunatics\" and \"WEAK and INEFFECTIVE Judges.\"",
    "link": "http://www.rollingstone.com/politics/politics-news/trumps-happy-easter-message-1235321550/",
    "timestamp": "2025-04-20T17:55:50Z"
  }
]