[
  {
    "title": "Trump uses Oval Office to hasten major golf merger — and further enrich his family: report",
    "description": "President Donald Trump held a strategy session in the Oval Office on how to expedite the merger between the PGA Tour and LIV Golf, reported The New York Times on Monday — a merger from which his own family stands to gain substantial wealth.According to Eric L…",
    "link": "https://www.rawstory.com/pga-tour/",
    "timestamp": "2025-02-17T23:49:40Z"
  },
  {
    "title": "Netanyahu Orders Immediate Enforcement Of UNRWA Law",
    "description": "Israel&#039;s Prime Minister Benjamin Netanyahu on Tuesday instructed the immediate enforcement of the UNRWA law, which was passed by the Knesset with broad support.",
    "link": "https://www.ndtv.com/world-news/israel-pm-benjamin-netanyahu-orders-immediate-enforcement-of-unrwa-law-7734651",
    "timestamp": "2025-02-17T23:49:29Z"
  },
  {
    "title": "NH protesters join nationwide 'Not My Presidents Day' rally",
    "description": "Hundreds of protesters gathered in Concord on Monday as part of nationwide statehouse demonstrations to voice concerns about President Donald Trump.",
    "link": "https://www.wmur.com/article/concord-nh-presidents-day-protest-02172025/63821970",
    "timestamp": "2025-02-17T23:47:23Z"
  },
  {
    "title": "Playboy Returns to Fit Females, Nudity, After Woke Rebrand Fail",
    "description": "Playboy is reportedly returning to its roots after going through a failed woke rebrand that included pop star Lizzo on a centerfold, a transgender Playmate, and a ban on nudity.\nThe post Playboy Returns to Fit Females, Nudity, After Woke Rebrand Fail appeared…",
    "link": "https://www.breitbart.com/entertainment/2025/02/17/playboy-returns-to-fit-females-nudity-after-woke-rebrand-fail/",
    "timestamp": "2025-02-17T23:47:21Z"
  },
  {
    "title": "Germany set to reject Keir Starmer's plan to put troops in Ukraine",
    "description": "Germany is likely to reject Sir Keir Starmer's plan to send a European peacekeeping force into Ukraine, according to reports. The UK and France are set to propose deploying soldiers to Kyiv if there is a deal to end the war with Russia, but Germany and Poland…",
    "link": "https://freerepublic.com/focus/f-news/4298383/posts",
    "timestamp": "2025-02-17T23:45:10Z"
  },
  {
    "title": "China says US has ‘gravely backpedaled’ on Taiwan",
    "description": "Beijing, Feb 17: China’s Foreign Ministry took issue Monday with a revised US government fact sheet that removed a line on American opposition to independence for Taiwan. The United States has “gravely backpedaled” on its position on Taiwan and sent the wrong…",
    "link": "https://thehillstimes.in/international/china-says-us-has-gravely-backpedaled-on-taiwan",
    "timestamp": "2025-02-17T23:45:00Z"
  },
  {
    "title": "James Carville Tells Democrats Opposing Trump to ‘Just Let It Go’ and ‘Do Nothing’ for Now",
    "description": "Democratic strategist James Carville advised Democratic politicians to \"do nothing\" to oppose President Donald Trump – at least for now. \nThe post James Carville Tells Democrats Opposing Trump to ‘Just Let It Go’ and ‘Do Nothing’ for Now first appeared on Med…",
    "link": "https://www.mediaite.com/tv/james-carville-tells-democrats-opposing-trump-to-just-let-it-go-and-do-nothing-for-now/",
    "timestamp": "2025-02-17T23:42:54Z"
  },
  {
    "title": "Elon Musk's DOGE Seeking Access To Heavily Guarded Taxpayer Information: Report",
    "description": "\"It takes direct access to the system to identify and fix it,\" a White House spokesperson said.",
    "link": "https://www.huffpost.com/entry/elon-musk-doge-irs-taxpayer-data_n_67b39097e4b0cd020cc2d1a1",
    "timestamp": "2025-02-17T23:42:34Z"
  },
  {
    "title": "‘No kings’ protest hits Hub",
    "description": "Protesters against President Donald Trump and his policies braved frigid temperatures to demonstrate Monday at rallies corresponding with the Presidents Day holiday.",
    "link": "https://www.bostonherald.com/2025/02/17/no-kings-protest-hits-hub/",
    "timestamp": "2025-02-17T23:41:45Z"
  },
  {
    "title": "Watchdog says Israel is advancing plans for nearly 1,000 more settler homes in West Bank",
    "description": "Jerusalem, Feb 17: Israel issued a tender for the construction of nearly 1,000 additional settler homes in the occupied West Bank, an anti-settlement watchdog said Monday. Peace Now says the development of 974 new housing units would allow the population of t…",
    "link": "https://thehillstimes.in/international/watchdog-says-israel-is-advancing-plans-for-nearly-1000-more-settler-homes-in-west-bank",
    "timestamp": "2025-02-17T23:40:00Z"
  },
  {
    "title": "Politicians loves handing out tax breaks for small business. But do they work?",
    "description": "A new study suggests investment tax breaks do little to encourage investment — but will that stop them from being used as a political tool?\nThe post Politicians loves handing out tax breaks for small business. But do they work? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/02/18/tax-breaks-small-business-australia/",
    "timestamp": "2025-02-17T23:39:33Z"
  },
  {
    "title": "BHP’s Profit Slump Prompts Hefty Cut to Interim Dividend",
    "description": "BHP Group Ltd. said first-half profit slumped 23% as China’s faltering economy dampened demand for iron ore, prompting the miner to cut its interim dividend to an eight-year low.",
    "link": "https://financialpost.com/pmn/business-pmn/bhps-profit-slump-prompts-hefty-cut-to-interim-dividend",
    "timestamp": "2025-02-17T23:36:06Z"
  },
  {
    "title": "Farmers feeling weight of Trump policies with shutdown of aid",
    "description": "In the last two presidential elections, farmers voted overwhelmingly for Donald Trump, but now some are saying his efforts to cut the government are causing major financial pressure. William Brangham reports and speaks with Nick Levendofsky, executive directo…",
    "link": "https://www.pbs.org/newshour/show/farmers-feeling-weight-of-trump-policies-with-shutdown-of-aid",
    "timestamp": "2025-02-17T23:35:43Z"
  },
  {
    "title": "Spike Lee Wears Jacket Demanding Reparations at NBA All-Star Game",
    "description": "Film director Spike Lee wore a jacket to the NBA All-Star Game with a message demanding slavery reparations.\nThe post Spike Lee Wears Jacket Demanding Reparations at NBA All-Star Game appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/02/17/spike-lee-wears-jacket-demanding-reparations-at-nba-all-star-game/",
    "timestamp": "2025-02-17T23:31:24Z"
  },
  {
    "title": "NATO secretary general says European countries have to do 'much, much more' to increase defense spending",
    "description": "NATO Secretary General Mark Rutte weighs in on talks to end Russia's war in Ukraine and the future of the military alliance on 'The Story.'",
    "link": "https://www.foxnews.com/media/nato-secretary-general-says-european-countries-have-do-much-much-more-increase-defense-spending",
    "timestamp": "2025-02-17T23:30:47Z"
  },
  {
    "title": "'Big Sunday Show' hosts tell companies to 'read the room' when it comes to their DEI policies",
    "description": "'The Big Weekend Show' unpacks Disney's updated warning on classic films as companies roll back on DEI initiatives.",
    "link": "https://www.foxnews.com/media/big-sunday-show-hosts-tell-companies-read-room-when-comes-dei-policies",
    "timestamp": "2025-02-17T23:30:31Z"
  },
  {
    "title": "MAGA sheriff running for CA governor vows to end 'sanctuary' laws (Nicole Norman/Politico)",
    "description": "Nicole Norman / Politico:\nMAGA sheriff running for CA governor vows to end ‘sanctuary’ laws  —  Similar laws in other states have become a target for President Donald Trump.  —  RIVERSIDE, California — A pro-Trump sheriff from Southern California said he woul…",
    "link": "https://www.memeorandum.com/250217/p91",
    "timestamp": "2025-02-17T23:30:01Z"
  },
  {
    "title": "Elon Musk’s DOGE wants access to the tax information of every American, and Trump plans to give it to him",
    "description": "Elon Musk’s DOGE team is seeking access to sensitive taxpayer data held by the IRS. A 25-year-old staffer is reportedly set to gain access to it.",
    "link": "https://www.newsbreak.com/share/3816563488538-elon-musk-s-doge-wants-access-to-the-tax-information-of-every-american-and-trump-plans-to-give-it-to-him?s=a2&amp;share_destination_id=MjA0MDk1Njk3LTE3Mzk4MzQ4ODU1NzU%3D&amp;pd=0DoMc5oM&amp;hl=en_US&amp;send_time=1739834885&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.3.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_rank_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v8",
    "timestamp": "2025-02-17T23:29:31Z"
  },
  {
    "title": "Did Trump Fire All FAA Workers? Find Out Amid Federal Layoffs",
    "description": "The Federal Aviation Administration is the latest agency to lose hundreds of employees, even as deadly crashes continue to rise in the U.S. Find out more here.",
    "link": "https://hollywoodlife.com/2025/02/17/did-trump-fire-faa-workers-federal-layoffs/",
    "timestamp": "2025-02-17T23:27:27Z"
  },
  {
    "title": "What the bleep?",
    "description": "Congressional Democrats have very specific ideas about President Trump and Elon Musk, and they aren't fussing, but cussing about them.",
    "link": "https://www.foxnews.com/politics/what-bleep",
    "timestamp": "2025-02-17T23:23:31Z"
  },
  {
    "title": "In Slap at Trump, South Africa Hints at Nuclear Deals with Iran, Russia",
    "description": "South Africa has responded to President Donald Trump's criticism of its expropriation legislation and its foreign policy by suggesting that it is prepared to work with Iran and Russia in developing domestic nuclear power plants.\nThe post In Slap at Trump, Sou…",
    "link": "https://www.breitbart.com/africa/2025/02/17/in-slap-at-trump-south-africa-hints-at-nuclear-deals-with-iran-russia/",
    "timestamp": "2025-02-17T23:23:08Z"
  },
  {
    "title": "Trump 2.0? These Democratic AGs are prepared.",
    "description": "LOS ANGELES — For nearly a year, Democratic attorneys general — the chief law enforcement officers in 22 states, plus D.C. — have been planning for this moment. They have now put themselves at the front line of resistance to a reelected Donald Trump.The attor…",
    "link": "https://freerepublic.com/focus/f-chat/4298378/posts",
    "timestamp": "2025-02-17T23:21:56Z"
  },
  {
    "title": "Four deputies for New York City Mayor Adams resign as feds drop corruption case",
    "description": "The Trump administration is seeking to ensure Adams' cooperation with its immigration crackdown. The bargain has raised new questions about the mayor's political independence and ability to lead the city.",
    "link": "https://www.pbs.org/newshour/politics/four-deputies-for-new-york-city-mayor-adams-resign-as-feds-drop-corruption-case",
    "timestamp": "2025-02-17T23:21:56Z"
  },
  {
    "title": "A Look at the Internal 'Resistance' Biden's State Department DEI Fellows Launched Against American Support for Israel",
    "description": "A pair of State Department fellowship programs championed by former secretary of state Antony Blinken aimed to \"enhance diversity, equity, inclusion, and accessibility (DEIA) in the federal workforce.\" They also sparked an internal \"resistance\" against U.S. s…",
    "link": "https://freebeacon.com/newsletters/a-look-at-the-internal-resistance-bidens-state-department-dei-fellows-launched-against-american-support-for-israel/",
    "timestamp": "2025-02-17T23:20:57Z"
  },
  {
    "title": "Trumps constitutional power grab :o",
    "description": "Trump asks Supreme Court to allow him to fire independent agency leader \n\nThe administration asked the Supreme Court on Sunday to clear the way for the president to fire the leader of an independent agency that investigates whistleblower reports filed by gove…",
    "link": "https://slashdot.org/submission/17333335/trumps-constitutional-power-grab-o",
    "timestamp": "2025-02-17T23:18:48Z"
  },
  {
    "title": "Federal mass firings will increase wildfire risk, endanger Colorado’s public lands, state leaders warn",
    "description": "Mass firings across federal agencies responsible for wildfire prevention and public lands management will endanger Coloradans and put at risk the state's beloved mountains, rivers and grasslands, state leaders said.",
    "link": "https://www.denverpost.com/2025/02/17/colorado-public-lands-federal-employees-mass-firings-donald-trump/",
    "timestamp": "2025-02-17T23:18:39Z"
  },
  {
    "title": "European leaders gather for emergency meeting after Trump shuts them out of Ukraine talks",
    "description": "European leaders held an emergency meeting in Paris on Monday to align their position after the Trump administration said they would be excluded from talks with Russia to negotiate an end to the war in Ukraine. The gathering of several key European leaders ai…",
    "link": "https://freerepublic.com/focus/f-news/4298376/posts",
    "timestamp": "2025-02-17T23:12:15Z"
  },
  {
    "title": "Wrong way to win back voters, ludicrous denials of gov’t fraud and other commentary",
    "description": "Democrats’ “unconditional defense of government bureaucracies does not appear to be a promising route” to recapturing the voters they’re losing, warns Ruy Teixeira at The Liberal Patriot.",
    "link": "https://nypost.com/2025/02/17/opinion/wrong-way-to-win-back-voters-ludicrous-denials-of-govt-fraud-and-other-commentary/",
    "timestamp": "2025-02-17T23:11:30Z"
  },
  {
    "title": "Tech Expert, James Altucher Declares: ‘Trump’s #1 IPO’ Could Reshape America’s Financial Landscape",
    "description": "New York, NY, Feb. 17, 2025 (GLOBE NEWSWIRE) -- Renowned financial forecaster and AI expert, James Altucher is making a bold prediction in his latest presentation: Donald Trump’s presidency will usher in what he calls ‘Trump’s #1 IPO’—an unprecedented financi…",
    "link": "https://www.globenewswire.com/news-release/2025/02/17/3027440/0/en/Tech-Expert-James-Altucher-Declares-Trump-s-1-IPO-Could-Reshape-America-s-Financial-Landscape.html",
    "timestamp": "2025-02-17T23:11:00Z"
  },
  {
    "title": "'Demand more': WaPo opinion writer won't apologize for making Dems 'uncomfortable'",
    "description": "A Washington Post opinion writer came out swinging against Democrats who complained he hasn't been tougher on President Donald Trump.Shadi Hamid wrote Monday, \"I’m more critical of Democrats precisely because I expect more from them.\"He continued, \"When Trump…",
    "link": "https://www.rawstory.com/trump-s-morals/",
    "timestamp": "2025-02-17T23:10:10Z"
  },
  {
    "title": "Trump's Gaza plan should be given a fighting chance",
    "description": "Many Gazans, particularly the young, are interested in leaving and have declared this over the years in polls and with their feet.",
    "link": "https://www.jpost.com/opinion/article-842535",
    "timestamp": "2025-02-17T23:05:11Z"
  },
  {
    "title": "Elevance Health Bolsters Employer Insurance Business",
    "description": "Elevance Health says its acquisition of Verily’s Granular Insurance is designed to bolster its offerings to self-funded employer clients.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/02/17/elevance-health-bolsters-employer-insurance-business/",
    "timestamp": "2025-02-17T23:04:50Z"
  },
  {
    "title": "Germany will not send troops to Ukraine without ‘US involvement’ – AFP",
    "description": "Berlin reportedly opposes sending EU peacekeepers to Ukraine without US involvement, AFP has reported on Monday Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612883-berlin-to-dismiss-uk-peacekeepers-plan/",
    "timestamp": "2025-02-17T23:04:29Z"
  },
  {
    "title": "NBC Reporter Invokes Trump, Musk During Coverage Of Most Recent Plane Crash, But It Happened In Canada",
    "description": "NBC News senior correspondent Tom Costello invoked President Donald Trump and DOGE head into a Delta Air Lines plane crash that happened in Toronto, Canada.",
    "link": "https://dailycaller.com/2025/02/17/nbc-reporter-tom-costello-trump-musk-plane-crash-doge/",
    "timestamp": "2025-02-17T23:04:20Z"
  },
  {
    "title": "If You Think That The Left Is Angry Now, Just Wait Until Fraudulent Social Security Payments Stop Going Out",
    "description": "What is our society going to look like if “the biggest fraud in history” is brought to a screeching halt?  Elon Musk and his DOGE team have been taking a meat axe to federal agency after federal agency, but Social Security is the big Kahuna.  According to the…",
    "link": "http://theeconomiccollapseblog.com/if-you-think-that-the-left-is-angry-now-just-wait-until-fraudulent-social-security-payments-stop-going-out/",
    "timestamp": "2025-02-17T23:03:35Z"
  },
  {
    "title": "Intellectual death recorded",
    "description": "Elon Musk certainly didn’t start out as anything like this sort of idiot, although the notion that he was some sort of Tesla-like genius was always transparently absurd on its face (Embarrassing confession: there used to be a mentally unhinged lawyer on my Mi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/intellectual-death-recorded",
    "timestamp": "2025-02-17T23:01:41Z"
  },
  {
    "title": "Army Cuts Outreach at Girls School After Dropping Recruiting at Black Engineering Event...",
    "description": "The Army has severed a long-standing partnership with Ashley Hall, an all-girls preparatory school in Charleston, South Carolina, as the Pentagon radically recalibrates its approach to diversity under President Donald Trump.",
    "link": "https://www.military.com/daily-news/2025/02/17/army-cuts-outreach-girls-school-after-dropping-recruiting-black-engineering-event.html",
    "timestamp": "2025-02-17T23:00:03Z"
  },
  {
    "title": "Protesters in Roanoke decry Trump, Musk, Congress",
    "description": "Among the hundreds of people who amassed outside the federal building in downtown Roanoke during lunch hour Monday, frustrations generally pointed toward President Donald Trump and his advisor, billionaire Elon Musk.",
    "link": "https://roanoke.com/news/local/roanoke-trump-musk-congress-protests-local-government-national-federal-news-presidents-day/article_0b0a5446-ed80-11ef-8da5-43de74e4bca3.html",
    "timestamp": "2025-02-17T22:59:00Z"
  },
  {
    "title": "WATCH: Trump’s 5-Year-Old Granddaughter Carolina Catches Ride with Grandpa at Daytona 500",
    "description": "President Donald Trump's adorable granddaughter Carolina caught a ride with her grandpa in the presidential limo at Daytona 500 on Sunday.\nThe post WATCH: Trump’s 5-Year-Old Granddaughter Carolina Catches Ride with Grandpa at Daytona 500 appeared first on Bre…",
    "link": "https://www.breitbart.com/politics/2025/02/17/watch-trumps-5-year-old-granddaughter-carolina-catches-ride-grandpa-daytona-500/",
    "timestamp": "2025-02-17T22:52:55Z"
  },
  {
    "title": "Trump nominates 'Stop the Steal' organizer who advocated for Jan. 6 defendants as D.C.'s top prosecutor",
    "description": "Trump has nominated interim U.S. attorney for the District of Columbia Ed Martin — a \"Stop the Steal\" organizer who advocated for Jan. 6 defendants — to be the district's top prosecutor on a permanent basis.",
    "link": "https://www.nbcnews.com/politics/justice-department/trump-nominates-stop-steal-organizer-advocated-jan-6-defendants-dcs-to-rcna192451",
    "timestamp": "2025-02-17T22:52:43Z"
  },
  {
    "title": "Elon Musk’s DOGE wants access to the tax information of every American, and Trump plans to give it to him",
    "description": "Elon Musk’s DOGE team is seeking access to sensitive taxpayer data held by the IRS. A 25-year-old staffer is reportedly set to gain access to it.",
    "link": "https://www.newsbreak.com/share/3816563488538-elon-musk-s-doge-wants-access-to-the-tax-information-of-every-american-and-trump-plans-to-give-it-to-him?_f=app_share&amp;pd=00s25Zl2&amp;lang=en_US&amp;send_time=1739832663&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.7.0.65%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_blend_exp_25q1-v6%2Cns_foryou_model_exp_25q1-control&amp;s=i2",
    "timestamp": "2025-02-17T22:51:30Z"
  },
  {
    "title": "'No one is coming to save anybody': MSNBC's Nicolle Wallace​ issues urgent plea",
    "description": "MSNBC host Nicolle Wallace told viewers Monday afternoon no one is coming to save them.And they must act.Her remark came after protesters flooded the streets of Washington, D.C., earlier on the President's Day holiday to oppose President Donald Trump's purge …",
    "link": "https://www.rawstory.com/anti-trump-protest/",
    "timestamp": "2025-02-17T22:51:04Z"
  },
  {
    "title": "Washington Post Kills Ad Calling on Trump to Fire Musk",
    "description": "Julie Creswell of The New York Times reported that The Washington Post killed an ad calling on Trump to fire his best buddy Elon Musk. The story was first reported in The Hill. Who could have given such an order? Creswell writes: An advertisement that was set…",
    "link": "https://dianeravitch.net/2025/02/17/washington-post-kills-ad-calling-on-trump-to-fire-musk/",
    "timestamp": "2025-02-17T22:45:00Z"
  },
  {
    "title": "Four Top New York City Officials Resign As Turmoil Ripples Over Mayor Adams' Corruption Case",
    "description": "Four top deputies to New York City Mayor Eric Adams are resigning.",
    "link": "https://www.huffpost.com/entry/eric-adams-nyc-mayor-investigations-resignations_n_67b3bb1ce4b0cd020cc2e067",
    "timestamp": "2025-02-17T22:43:59Z"
  },
  {
    "title": "US sends Israel 2,000-pound bombs that can 'pancake' buildings",
    "description": "Israel has begun receiving 2,000-pound bombs from the US, after President Donald Trump lifted an export block on the weapons that was imposed over concerns they were killing civilians in Gaza.",
    "link": "https://www.abc.net.au/news/2025-02-18/us-sends-israel-2000-pound-bomb-heavy-weapons/104944950",
    "timestamp": "2025-02-17T22:43:04Z"
  },
  {
    "title": "MSNBC Legal Analyst Reveals Why He Left Cable Network",
    "description": "Glenn Kirschner said he left MSNBC to try to reach a broader audience in this \"battle for a healthy American democracy.\"",
    "link": "https://www.newsweek.com/glenn-kirschner-leaves-msnbc-2032383",
    "timestamp": "2025-02-17T22:39:52Z"
  },
  {
    "title": "‘Congress Has Not Acted!’ Bush’s USAID Chief Warns Of ‘Constitutional Crisis’ And Musk Overstepping Executive Power",
    "description": "\"It does appear we may be headed towards some sort of a constitutional crisis. I don't-- I-- I hope that doesn't happen.\"\nThe post ‘Congress Has Not Acted!’ Bush’s USAID Chief Warns Of ‘Constitutional Crisis’ And Musk Overstepping Executive Power first appear…",
    "link": "https://www.mediaite.com/tv/congress-has-not-acted-bushs-usaid-chief-warns-of-constitutional-crisis-and-musk-overstepping-executive-power/",
    "timestamp": "2025-02-17T22:38:32Z"
  },
  {
    "title": "Abp. Vigano asks Trump’s CIA director to ‘investigate the Deep State plan to eliminate Benedict XVI’",
    "description": "Abp. Vigano asks Trump’s CIA director to ‘investigate the Deep State plan to eliminate Benedict XVI’In a wide-ranging interview, Archbishop Viganò praised Donald Trump for the 'return of the U.S. to the Geneva Consensus Declaration, which defends the right to…",
    "link": "https://freerepublic.com/focus/f-religion/4298370/posts",
    "timestamp": "2025-02-17T22:37:35Z"
  },
  {
    "title": "'He Didn't Want to Shake a Black Man's Hand': Tom Hanks' Controversial Portrayal of Donald Trump Supporters In 'SNL' Skit Gets Ripped by MAGA Trolls",
    "description": "“Saturday Night Live” may have leaned too liberal with their depiction of Donald Trump’s MAGA supporters during the show’s star-studded 50th anniversary special. Among the",
    "link": "https://atlantablackstar.com/2025/02/17/tom-hanks-snls-doug-skit-as-donald-trump-supporters/",
    "timestamp": "2025-02-17T22:36:17Z"
  },
  {
    "title": "US and Russia set to begin high-stakes talks over Ukraine's fate",
    "description": "Tuesday's talks come days after Donald Trump's phone call with Vladimir Putin.",
    "link": "https://abcnews.go.com/Politics/us-russia-set-begin-high-stakes-talks-ukraines/story?id=118900923",
    "timestamp": "2025-02-17T22:35:50Z"
  },
  {
    "title": "'Backfired spectacularly': European officials reportedly now view US as an 'adversary'",
    "description": "If Vice President J.D. Vance hoped to earn respect among international leaders with his speech in Germany last week, it wouldn't work, according to one senior diplomat. Vance not only didn't persuade his audience, he insulted them, the Financial Times reporte…",
    "link": "https://www.rawstory.com/european-union-trump-2671169459/",
    "timestamp": "2025-02-17T22:33:56Z"
  },
  {
    "title": "'Backfired spectacularly': European officials reportedly now view US as an 'adversary' - NewsBreak",
    "description": "If Vice President J.D. Vance hoped to earn respect among international leaders with his speech in Germany last week, it didn't work, according to one senio",
    "link": "https://www.newsbreak.com/share/3817358183433-backfired-spectacularly-european-officials-reportedly-now-view-us-as-an-adversary?s=a2&share_destination_id=MjMxOTYxNzUtMTczOTg4MTU0NzUyMA%3D%3D&pd=01ZKNrmo&hl=en_US&send_time=1739881547&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v7",
    "timestamp": "2025-02-17T22:33:56Z"
  },
  {
    "title": "'Backfired spectacularly': European officials reportedly now view US as an 'adversary' - NewsBreak",
    "description": "If Vice President J.D. Vance hoped to earn respect among international leaders with his speech in Germany last week, it didn't work, according to one senio",
    "link": "https://www.newsbreak.com/share/3817358183433-backfired-spectacularly-european-officials-reportedly-now-view-us-as-an-adversary?s=a2&share_destination_id=MTA4NTQ2NDI1LTE3Mzk5MDcyNzI0MjY%3D&pd=07LRsnOy&hl=en_US&send_time=1739907272&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_push_exp_rt_bucketv12-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v5%2Cns_foryou_recall_exp_25q1-v3",
    "timestamp": "2025-02-17T22:33:56Z"
  },
  {
    "title": "Bitcoin Bull Run Just Getting Started as Institutions Load Up, Says Bernstein",
    "description": "The market may have cooled for now, but the bull run is far from over, say analysts at global investment firm Bernstein.",
    "link": "https://decrypt.co/306408/bitcoin-bull-run-just-getting-started-bernstein",
    "timestamp": "2025-02-17T22:25:06Z"
  },
  {
    "title": "The anti-Musk protest movement is expected to ramp up with Congress on recess",
    "description": "President Donald Trump's billionaire top lieutenant, Elon Musk, is the focus for thousands of Democratic activists launching a massive protest campaign this week.",
    "link": "https://www.ksat.com/business/2025/02/17/the-anti-musk-protest-movement-is-expected-to-ramp-up-with-congress-on-recess/",
    "timestamp": "2025-02-17T22:20:24Z"
  },
  {
    "title": "Activists Protest in D.C. Outside Capitol, Drag Effigy that Appears to Be of President Trump by a Noose",
    "description": "Activists are protesting outside of the United States Capitol in Washington, DC, on Presidents Day, claiming to stand against “executive overreach.” “​​The #50501 protests were a decentralized rapid response to the anti-democratic and illegal actions of the T…",
    "link": "https://freerepublic.com/focus/f-news/4298363/posts",
    "timestamp": "2025-02-17T22:20:00Z"
  },
  {
    "title": "Ready and willing. That’s my take from today’s meeting in Paris.",
    "description": "Europe is ready and willing to step up. To lead in providing security guarantees for Ukraine. Ready and willing to invest a lot more in our security. The details will need to be decided but the commitment is clear.",
    "link": "https://freerepublic.com/focus/f-chat/4298362/posts",
    "timestamp": "2025-02-17T22:19:09Z"
  },
  {
    "title": "'Profiles in Courage': Four NYC Deputy Mayors to Resign Over Eric Adams' Quid Pro Quo With Trump",
    "description": "As news broke Monday that four of New York City Mayor Eric Adams' top deputies plan to resign over the alleged deal Adams made with the Trump administration in order to get his corruption case dismissed, calls mounted for the mayor to end the chaos by steppin…",
    "link": "https://www.commondreams.org/news/mayor-adams-deputy-mayors",
    "timestamp": "2025-02-17T22:18:40Z"
  },
  {
    "title": "Four top New York City officials resign as turmoil ripples over Mayor Adams’ corruption case",
    "description": "Adams is increasing scrutiny since federal prosecutors were ordered to drop the mayor’s corruption case.",
    "link": "https://www.bostonherald.com/2025/02/17/nyc-mayor-investigations-city-officials-resign/",
    "timestamp": "2025-02-17T22:14:43Z"
  },
  {
    "title": "Fact Check: Shock Video Shows Euro Defense Leader Crying After JD Vance's Scolding - Is It Accurate?",
    "description": "Video indicates the chairman of the Munich Security Conference broke into tears following remarks made by Vice President Vance.",
    "link": "https://www.westernjournal.com/fact-check-shock-video-shows-euro-defense-leader-crying-jd-vances-scolding-accurate/",
    "timestamp": "2025-02-17T22:13:52Z"
  },
  {
    "title": "Several Injured After Delta Plane Flips Over Upon Landing in Toronto",
    "description": "The flight came in from Minneapolis, MN, with 76 passengers and four crew members.\nThe post Several Injured After Delta Plane Flips Over Upon Landing in Toronto first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/several-injured-after-delta-plane-flips-over-upon-landing-in-toronto/",
    "timestamp": "2025-02-17T22:09:56Z"
  },
  {
    "title": "‘No Kings Day’: Protesters Denounce Trump and Musk",
    "description": "Protesters gathered across the country to denounce Donald Trump and Elon Musk on Presidents Day — or, as many called it, 'No Kings Day'",
    "link": "http://www.rollingstone.com/politics/politics-news/donald-trump-elon-musk-protests-no-kings-day-1235270646/",
    "timestamp": "2025-02-17T22:07:28Z"
  },
  {
    "title": "Rep. Eric Swalwell Falsely Claims Trump Had ‘More Plane Crashes’ in First Month Than Any President",
    "description": "Far-left Rep. Eric Swalwell (D-CA) falsely claimed that “no president has had more planes crash in their first month in office than Donald Trump,” a statement easily debunked by the National Transportation Safety Board (NTSB). Responding to the news of a sing…",
    "link": "https://freerepublic.com/focus/f-news/4298358/posts",
    "timestamp": "2025-02-17T22:06:52Z"
  },
  {
    "title": "Thousands of people protest in Washington, D.C., and across the U.S. on Presidents Day",
    "description": "The protestors participated in the 50501 Movement, which originated in response to the Trump administration and its efforts to cut government spending. Many chanted \"Where is Congress?'\"",
    "link": "https://www.npr.org/2025/02/17/nx-s1-5299915/dc-protests",
    "timestamp": "2025-02-17T22:06:43Z"
  },
  {
    "title": "Wendy Guevara Joins ‘Desiguales’ As Co-Host At TelevisaUnivision & Makes Trans History",
    "description": "Wendy Guevara has joined Desiguales as the sixth co-host of TelevisaUnivision’s daytime talk show. Guevara, who made history as the first transgender person to win a reality TV show in Mexico when she took the crown of La Casa de los Famosos México Season 1, …",
    "link": "http://deadline.com/2025/02/wendy-guevara-desiguales-host-televisaunivision-1236293107/",
    "timestamp": "2025-02-17T22:03:59Z"
  },
  {
    "title": "'Total sham!' Defense Secretary Hegseth blames 'Biden IRS' over $33K audit",
    "description": "Defense Secretary Pete Hegseth expressed disgust on social media Monday after apparently receiving an IRS audit notice addressed to him and his wife.\n\nHegseth posted a photo of the notice that read, \"Dear Peter B & Jennifer A. Hegseth: We're auditing your fed…",
    "link": "https://www.rawstory.com/pete-hegseth-2671169727/",
    "timestamp": "2025-02-17T22:03:31Z"
  },
  {
    "title": "Yukon premier says trip to Washington, D.C., highlighted North amid tariff dispute",
    "description": "WHITEHORSE — Yukon Premier Ranj Pillai says he met with elected representatives from Alaska to discuss the importance of working together and the impact of possible tariffs on both counties. A statement from Pillai says he met with Alaska Senator Lisa Murkows…",
    "link": "https://financialpost.com/pmn/yukon-premier-says-trip-to-washington-d-c-highlighted-north-amid-tariff-dispute",
    "timestamp": "2025-02-17T22:00:45Z"
  },
  {
    "title": "Dr Will Happer: The Academic Who Knows Where the Bodies are Buried",
    "description": "Dr. Will Happer served in President Trump's first administration. Happer once told Al Gore to his face \"What you’ve said is absolutely incorrect\".",
    "link": "https://wattsupwiththat.com/2025/02/17/dr-will-happer-the-academic-who-knows-where-the-bodies-are-buried/",
    "timestamp": "2025-02-17T22:00:00Z"
  },
  {
    "title": "Revealed: The Scientology Insider at Center of Donald Trump's Ukraine 'Peace Talks' as President Declares He Will Meet Mad Vlad Putin 'Soon'",
    "description": "Donald Trump has given Scientologist John P. Coale the position of depurt Ukraine envoy in hopes of helping end their war with Russia.",
    "link": "https://radaronline.com/p/scientology-donald-trump-ukraine-peace-talks-as-vladimir-putin/",
    "timestamp": "2025-02-17T22:00:00Z"
  },
  {
    "title": "Oil Producers Exercise Caution Despite Policy Shifts",
    "description": "Ahead of his second term, President Donald Trump revived the “Drill, Baby, Drill” slogan, reaffirming his commitment to boosting domestic oil production and reducing energy costs. This policy aims to enhance energy independence, drive economic growth, and low…",
    "link": "https://oilprice.com/Energy/Energy-General/Oil-Producers-Exercise-Caution-Despite-Policy-Shifts.html",
    "timestamp": "2025-02-17T22:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Democrat Governors Arranged Meeting With Biden White House to Thwart Trump Agenda, Emails Show",
    "description": "White House officials under outgoing President Joe Biden may have colluded with staffers representing a coalition of Democrat governors planning to thwart President-elect Donald Trump’s... Read More\nThe post EXCLUSIVE: Democrat Governors Arranged Meeting With…",
    "link": "https://www.dailysignal.com/2025/02/17/exclusive-democrat-governors-arranged-meeting-with-biden-white-house-to-thwart-trump-agebda-emails-show/",
    "timestamp": "2025-02-17T22:00:00Z"
  },
  {
    "title": "Trump making fewer market-moving social-media posts than first term: study",
    "description": "JPMorgan analysts found that only 10% of the 126 posts Trump had published this time around on sensitive topics such as trade tariffs, foreign relations and economics caused clear currency market moves.",
    "link": "https://nypost.com/2025/02/17/business/trump-making-fewer-market-moving-social-media-posts-than-first-term-study/",
    "timestamp": "2025-02-17T21:58:13Z"
  },
  {
    "title": "Trump Uses Supreme Court Immunity Ruling to Claim “Unrestricted Power”",
    "description": "Donald Trump is arguing to the Supreme Court that they have already given him “unrestricted power” to fire people.\r\nThe White House’s acting solicitor general, Sarah M. Harris, cited the Supreme Court’s July decision giving the president near-total immunity i…",
    "link": "https://newrepublic.com/post/191619/trump-supreme-court-immunity-unrestricted-power",
    "timestamp": "2025-02-17T21:58:10Z"
  },
  {
    "title": "Mexico awaits Google response on dispute over Gulf of Mexico before filing lawsuit",
    "description": "Mexico says it’s awaiting a new response from Google to its request that the tech company fully restore the name Gulf of Mexico to its Google Maps service before filing a lawsuit",
    "link": "https://abcnews.go.com/Technology/wireStory/mexico-awaits-new-response-google-dispute-gulf-mexico-118899927",
    "timestamp": "2025-02-17T21:57:20Z"
  },
  {
    "title": "Canada's anthem booed as payback for fight-laden hockey clash with USA",
    "description": "After Sunday's ice hockey clash between the US and Canada saw The Star-Spangled Banner booed and three fights in the first few seconds, Boston fans get their own back by booing the Canadian anthem.",
    "link": "https://www.abc.net.au/news/2025-02-18/canada-anthem-booed-at-4-nations-face-off-ice-hockey-fight-usa/104949010",
    "timestamp": "2025-02-17T21:56:38Z"
  },
  {
    "title": "'What on earth is happening?' Upside-down Delta plane rocks social media",
    "description": "News of yet another airplane disaster — after years of relative calm in the skies — prompted an explosion of shock and confusion by commenters on social media Monday.A Delta Connection CRJ-900 bound from Minneapolis to Toronto came to a rest upside-down on th…",
    "link": "https://www.rawstory.com/plane-crash-2671169667/",
    "timestamp": "2025-02-17T21:55:40Z"
  },
  {
    "title": "Colorado’s national parks face uncertainty amid President Trump’s hiring freeze, staffing instability",
    "description": "Visitors to America's national parks in Colorado could find dirty bathrooms and closure signs on visitor centers and campgrounds this summer if a federal hiring freeze does not thaw.",
    "link": "https://www.denverpost.com/2025/02/17/colorado-national-parks-federal-hiring-freeze-layoffs-donald-trump/",
    "timestamp": "2025-02-17T21:53:33Z"
  },
  {
    "title": "Mexico says it will sue Google if it insists on using 'Gulf of America'",
    "description": "Mexico will take Google to court if it insists on changing the Gulf of Mexico's name to &quot;Gulf of America&quot; for Maps users in the United States, President Claudia Sheinbaum said Monday. She said her government had written again to the U.S. company arg…",
    "link": "https://japantoday.com/category/world/mexico-says-to-sue-google-if-it-insists-on-using-%27gulf-of-america%27",
    "timestamp": "2025-02-17T21:52:18Z"
  },
  {
    "title": "Trump begins firings of FAA air traffic control staff just weeks after fatal DC plane crash",
    "description": "The Trump administration has begun firing several hundred Federal Aviation Administration employees, upending staff on a busy air travel weekend and just weeks after a January fatal mid-air collision at Ronald Reagan Washington National Airport. Probationary …",
    "link": "https://japantoday.com/category/world/trump-begins-firings-of-faa-air-traffic-control-staff-just-weeks-after-fatal-dc-plane-crash",
    "timestamp": "2025-02-17T21:52:02Z"
  },
  {
    "title": "Judge expected to rule in 24 hours in case that aims to sharply curtail Musk's DOGE",
    "description": "A U.S. judge said on Monday she hoped to rule within 24 hours in a lawsuit that aims to protect information systems at major government agencies from Elon Musk's DOGE team, which President Donald Trump has tasked with overhauling the government. U.S. District…",
    "link": "https://japantoday.com/category/world/judge-expected-to-rule-in-24-hours-in-case-that-aims-to-sharply-curtail-musk%27s-doge",
    "timestamp": "2025-02-17T21:51:55Z"
  },
  {
    "title": "Rubio and Saudi crown prince discuss Gaza after Trump proposal",
    "description": "U.S. Secretary of State Marco Rubio and Saudi Crown Prince Mohammed bin Salman discussed plans for Gaza during a meeting on Monday, State Department spokesperson Tammy Bruce said. Rubio is visiting the Middle East after President Donald Trump infuriated the A…",
    "link": "https://japantoday.com/category/world/rubio-and-saudi-crown-prince-discuss-gaza-after-trump-proposal",
    "timestamp": "2025-02-17T21:51:36Z"
  },
  {
    "title": "Israel says it is committed to Trump plan for Gaza displacement",
    "description": "Israel expressed commitment on Monday to a U.S. proposal to take over Gaza and displace its Palestinian residents, as Washington's top diplomat held talks in Saudi Arabia where he was expected to push the plan opposed by Arab states. Arriving in the kingdom a…",
    "link": "https://japantoday.com/category/world/israel-security-cabinet-to-discuss-new-phase-of-gaza-truce",
    "timestamp": "2025-02-17T21:51:27Z"
  },
  {
    "title": "European leaders meet to discuss Ukraine as UK troop offer hardens regional resolve",
    "description": "Britain said it was ready to send peacekeeping troops to back up any Ukraine peace deal as European leaders gathered on Monday to agree on a unified strategy, while Russian and U.S. officials prepared to meet for their own talks to try to end the conflict. Th…",
    "link": "https://japantoday.com/category/world/european-leaders-meet-to-discuss-ukraine-as-uk-troop-offer-hardens-regional-resolve",
    "timestamp": "2025-02-17T21:51:13Z"
  },
  {
    "title": "All 5 Liberal leadership candidates clear final financial hurdle, turn to policies ahead of debate",
    "description": "All five Liberal leadership candidates say they've either already paid or will submit the final $125,000 due Monday evening that's required to stay in the race. Now, ahead of English and French debates in Montreal next week, the contenders are rolling out mor…",
    "link": "https://www.cbc.ca/news/politics/liberal-leadership-candidates-financial-hurdle-1.7461078",
    "timestamp": "2025-02-17T21:49:57Z"
  },
  {
    "title": "Shakira resumes world tour after Lima hospital stay",
    "description": "Colombian pop star Shakira said her concert in Peru Monday will go ahead a day after she called off another performance because of a sudden hospitalization. The singer-songwriter, 48, had gone to the emergency room on Saturday night and was briefly admitted t…",
    "link": "https://japantoday.com/category/entertainment/shakira-resumes-world-tour-after-lima-hospital-stay",
    "timestamp": "2025-02-17T21:49:18Z"
  },
  {
    "title": "Hollywood should resist Trump pressure, says director Todd Haynes",
    "description": "American film director Todd Haynes has urged the film industry to stand up to Donald Trump's new administration and warned about the danger of being &quot;contaminated&quot; by the radical changes underway in the United States. Speaking to AFP in Berlin, wher…",
    "link": "https://japantoday.com/category/entertainment/hollywood-should-resist-trump-pressure-says-director-todd-haynes",
    "timestamp": "2025-02-17T21:48:41Z"
  },
  {
    "title": "Anti-Trump 50501 Protests Break Out Across the Country",
    "description": "Thousands of protesters gathered at different cities across the country Monday to declare President’s Day as “No Kings Day,” in protest of the unlawful actions of President Donald Trump and Elon Musk to upend the federal government. \r\nThe swath of protests we…",
    "link": "https://newrepublic.com/post/191612/anti-trump-50501-protests-presidents-day",
    "timestamp": "2025-02-17T21:48:31Z"
  },
  {
    "title": "Coup in Kiev: Zelensky abuses peace talks to take out rivals",
    "description": "An attempt to eliminate the influence of former Ukrainian President Pyotr Poroshenko could be Zelensky’s last mistake Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612865-zelensky-attempt-eliminate-influence-poroshenko/",
    "timestamp": "2025-02-17T21:47:00Z"
  },
  {
    "title": "‘Absolutely Nuts’: Blue State Bill Aims To Jail Those Who ‘Misgender’ Dead People",
    "description": "A Colorado bill could put doctors, government employees or morticians in jail if they accurately record the sex of dead people who identified as transgender.",
    "link": "https://dailycaller.com/2025/02/17/colorado-bill-transgender-deceased-people-death-certificate/",
    "timestamp": "2025-02-17T21:46:13Z"
  },
  {
    "title": "WINNING: Trump Announces Plan To Attack The British And Prussian Forces At Waterloo",
    "description": "WASHINGTON, D.C. — America's resurgence reached a new level this morning, as President Donald Trump announced a plan to attack the British and Prussian forces at Waterloo, effective immediately. The announcement of the new offensive came on the heels of Presi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4298352/posts",
    "timestamp": "2025-02-17T21:45:20Z"
  }
]