[
  {
    "title": "What can Democrats do to oppose Trump?",
    "description": "The minority party gets off to a 'slow start' in opposition",
    "link": "https://theweek.com/politics/democrats-oppose-trump-republicans-musk-congress",
    "timestamp": "2025-02-10T19:57:12Z"
  },
  {
    "title": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaints",
    "description": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaintsclickondetroit.com",
    "link": "https://www.clickondetroit.com/news/politics/2025/02/10/so-long-penny-trump-orders-us-to-ditch-1-cent-coin-after-decades-of-complaints/",
    "timestamp": "2025-02-10T19:57:11Z"
  },
  {
    "title": "Wisconsin sues Trump administration over research funding cuts; joins coalition",
    "description": "Attorneys general from 22 states, including Wisconsin, filed a lawsuit Monday, against the Trump administration for slashing funding for medical and public health research at universities nationwide.",
    "link": "https://www.fox6now.com/news/wisconsin-lawsuit-trump-administration-funding-cuts",
    "timestamp": "2025-02-10T19:56:54Z"
  },
  {
    "title": "Netanyahu asks Trump to lift restrictions on computer chip exports to Israel",
    "description": "Prime Minister Benjamin Netanyahu requested that US Secretary of Commerce Howard Lutnik remove Israel from the",
    "link": "https://www.jpost.com/breaking-news/article-841556",
    "timestamp": "2025-02-10T19:56:06Z"
  },
  {
    "title": "ROOKE: Hidden Deep Inside New Polling Is A Major Warning For Democrats",
    "description": "New polling suggests that Democrats have a major problem with their voter stronghold, and it's clear they have no idea how to fix it.",
    "link": "https://dailycaller.com/2025/02/10/rooke-polling-democrats-republicans-generation-z-donald-trump/",
    "timestamp": "2025-02-10T19:56:03Z"
  },
  {
    "title": "Kanye West Exits Social Media (Again) After Professing Love For Hitler (Again)",
    "description": "Ye is now selling swastika shirts he promoted via a Super Bowl ad.",
    "link": "https://www.huffpost.com/entry/kanye-west-twitter-x-elon-musk_n_67aa3675e4b0ade4a9a36906",
    "timestamp": "2025-02-10T19:55:29Z"
  },
  {
    "title": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaints",
    "description": "Trump’s surprise order comes after decades of unsuccessful efforts to pitch the penny.",
    "link": "https://www.bostonherald.com/2025/02/10/trump-no-more-pennies/",
    "timestamp": "2025-02-10T19:55:06Z"
  },
  {
    "title": "California man finds 525-pound bear living under his home after Los Angeles wildfires",
    "description": "The California wildfires burned over 14,000 acres and are ranked among the state's three most destructive fires, according to the California Department of Forestry and Fire Protection.",
    "link": "https://economictimes.indiatimes.com/news/international/us/california-man-finds-525-pound-bear-living-under-his-home-after-los-angeles-wildfires/articleshow/118127099.cms",
    "timestamp": "2025-02-10T19:54:36Z"
  },
  {
    "title": "What Investors Are Missing about Pfizer and Merck",
    "description": "What Investors Are Missing about Pfizer and Merckbtm25@yale.edu\nMon, 02/10/2025 - 14:54\n Faculty Viewpoints\n <li>\n Jeffrey A. Sonnenfeld\n\n\n Senior Associate Dean for Leadership Studies & Lester Crown Professor in the Practice of Management\n\r\n\n \r\n\n</li>\n <li>\n…",
    "link": "https://insights.som.yale.edu/insights/what-investors-are-missing-about-pfizer-and-merck",
    "timestamp": "2025-02-10T19:54:04Z"
  },
  {
    "title": "Scoop: Trump planning to pardon Rod Blagojevich",
    "description": "President Donald Trump is expected to pardon former Illinois Gov. Rod Blagojevich, according to a person familiar with the plans.Blagojevich served eight years in prison on charges stemming from his effort to sell Barack Obama's Senate seat after Obama won th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4296503/posts",
    "timestamp": "2025-02-10T19:53:23Z"
  },
  {
    "title": "Scoop: Trump planning to pardon Rod Blagojevich",
    "description": "President Donald Trump is expected to pardon former Illinois Gov. Rod Blagojevich, according to a person familiar with the plans.Blagojevich served eight years in prison on charges stemming from his effort to sell Barack Obama's Senate seat after Obama won th…",
    "link": "https://freerepublic.com/focus/f-news/4296503/posts",
    "timestamp": "2025-02-10T19:53:23Z"
  },
  {
    "title": "Live: Coalition calls for Morrison and Hockey to be drafted into tariff fight",
    "description": "The shadow trade minister has suggested Scott Morrison could be called in to help Australia secure an exemption from Donald Trump's latest tariffs. Follow live.",
    "link": "https://www.abc.net.au/news/2025-02-11/federal-politics-live-blog-feburary-11/104921486",
    "timestamp": "2025-02-10T19:52:41Z"
  },
  {
    "title": "Trump gets high approval ratings for his first weeks, new CBS poll finds",
    "description": "President Donald Trump received positive marks on immigration policy, his handing of the Israel-Hamas conflict and more.",
    "link": "https://biztoc.com/x/04ff2ca560ed053a",
    "timestamp": "2025-02-10T19:51:55Z"
  },
  {
    "title": "Trump’s steel and aluminum tariffs aren’t rattling markets Monday. Blame investor fatigue",
    "description": "It’s been only three weeks since President Donald Trump took office and began to unleash an array of trade proposals, but investors already appear to have become inured to those pronouncements, including his latest regarding 25% tariffs on steel and aluminum.",
    "link": "https://biztoc.com/x/96670bb6457ffc4b",
    "timestamp": "2025-02-10T19:51:52Z"
  },
  {
    "title": "One of Elon Musk’s DOGE Staffers Used to Sell Ketamine Professionally",
    "description": "As the staff of Elon Musk's Department of Government Efficiency (DOGE) makes headlines for moving fast and breaking things, a deeper look into their backgrounds reveals that one used to hawk the billionaire's favorite drug for a living. As the Washington Post…",
    "link": "https://futurism.com/neoscope/elon-musk-doge-staffer-ketamine",
    "timestamp": "2025-02-10T19:51:42Z"
  },
  {
    "title": "Trump expected to pardon ex-Illinois Gov. Blagojevich 5 years after commuting his sentence",
    "description": "Trump already commuted Blagojevich’s 14-year sentence for political corruption charges during his first term.",
    "link": "https://www.pbs.org/newshour/politics/trump-expected-to-pardon-ex-illinois-gov-blagojevich-5-years-after-commuting-his-sentence",
    "timestamp": "2025-02-10T19:51:27Z"
  },
  {
    "title": "Hamas halts hostage releases, cites Israel ceasefire breaches | Honolulu Star-Advertiser",
    "description": "JERUSALEM >> Hamas today announced it would stop releasing Israeli hostages until further notice over what the Palestinian militant group said were Israeli violations of the ceasefire agreement.",
    "link": "https://www.staradvertiser.com/2025/02/10/breaking-news/hamas-halts-hostage-releases-cites-israel-ceasefire-breaches/",
    "timestamp": "2025-02-10T19:51:16Z"
  },
  {
    "title": "Jen Psaki Taunts Trump Over President Musk Magazine Cover: ‘I’m Just Gonna Leave That Up There!’",
    "description": "Jen Psaki taunted President Donald Trump over a Time Magazine cover featuring Elon Musk at the  Resolute Desk in the Oval Office.\nThe post Jen Psaki Taunts Trump Over President Musk Magazine Cover: ‘I’m Just Gonna Leave That Up There!’ first appeared on Media…",
    "link": "https://www.mediaite.com/tv/jen-psaki-taunts-trump-over-president-musk-magazine-cover-im-just-gonna-leave-that-up-there/",
    "timestamp": "2025-02-10T19:51:14Z"
  },
  {
    "title": "Trump Team Orders Work Pause At US Consumer Protection Agency",
    "description": "US President Donald Trump's administration has informed staff at the country's consumer protection agency that it is temporarily shuttering its headquarters and pausing all work, according to an email shared Monday with AFP.\nThe Consumer Financial Protection …",
    "link": "https://www.ibtimes.com/trump-team-orders-work-pause-us-consumer-protection-agency-3763163",
    "timestamp": "2025-02-10T19:51:08Z"
  },
  {
    "title": "Macron says France will apply 'Notre Dame strategy' on AI",
    "description": "President Emmanuel Macron says France will \"commit to a clear timeline\" and \"deliver\" on AI development, as Europe risks falling behind the US and China. He likened it to the rapid Notre Dame cathedral rebuild.",
    "link": "https://www.dw.com/en/macron-says-france-will-apply-notre-dame-strategy-on-ai/a-71565597",
    "timestamp": "2025-02-10T19:51:00Z"
  },
  {
    "title": "Macron says France will apply 'Notre Dame strategy' on AI",
    "description": "President Emmanuel Macron says France will \"commit to a clear timeline\" and \"deliver\" on AI development, as Europe risks falling behind the US and China. He likened it to the rapid Notre Dame cathedral rebuild. On the opening day of an AI summit in Paris co-h…",
    "link": "https://www.dw.com/en/macron-says-france-will-apply-notre-dame-strategy-on-ai/a-71565597",
    "timestamp": "2025-02-10T19:51:00Z"
  },
  {
    "title": "5 Former Treasury Secretaries Warn Of DOGE Activities: 'Gravely Concerning'",
    "description": "Five former Treasury secretaries are sounding the alarm, warning Americans that political interference in the nation's financial system threatens both democracy and economic stability.",
    "link": "https://www.ibtimes.com/treasury-secretaries-doge-warning-3763160",
    "timestamp": "2025-02-10T19:50:38Z"
  },
  {
    "title": "Prince Harry appears to take swipe at Donald Trump after ‘terrible’ Meghan remark",
    "description": "It comes after the US President labelled Meghan Markle 'terrible'.",
    "link": "https://www.nzherald.co.nz/lifestyle/prince-harry-appears-to-take-swipe-at-donald-trump-after-terrible-meghan-remark/RDASKO2LUVCUBBHSSCR43WJADA/",
    "timestamp": "2025-02-10T19:50:33Z"
  },
  {
    "title": "Ivanka Trump's son trends on social media for his behaviour with Donald Trump",
    "description": "Several viral videos from Super Bowl 2025 showed US President Donald Trump walking alongside Ivanka Trump's youngest son Theodore on the field. Social media users have lauded the seven-year-old child for his attentive behaviour around his grandfather.",
    "link": "https://economictimes.indiatimes.com/news/international/us/ivanka-trumps-son-trends-on-social-media-for-his-behaviour-with-donald-trump/articleshow/118127065.cms",
    "timestamp": "2025-02-10T19:50:19Z"
  },
  {
    "title": "Salesforce plans US$500m in AI-related investments in Saudi Arabia",
    "description": "As countries compete to secure investments in the technology.",
    "link": "https://www.itnews.com.au/news/salesforce-plans-us500m-in-ai-related-investments-in-saudi-arabia-614908?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2025-02-10T19:48:50Z"
  },
  {
    "title": "Emaciated state of latest released hostages piles pressure on Israel to bring the rest home",
    "description": "Three captives report having been tortured and deliberately starved, and that captors denied them water for days at a time",
    "link": "https://www.irishtimes.com/world/middle-east/2025/02/10/emaciated-state-of-latest-released-hostages-piles-pressure-on-israel-to-bring-the-rest-home/",
    "timestamp": "2025-02-10T19:47:51Z"
  },
  {
    "title": "Trump team orders work pause at US consumer protection agency",
    "description": "US President Donald Trump’s administration has informed staff at the country’s consumer protection agency that it is temporarily shuttering its headquarters and pausing all work, according to an email shared Monday with AFP. The Consumer Financial Protection …",
    "link": "https://www.digitaljournal.com/world/trump-team-orders-work-pause-at-us-consumer-protection-agency/article",
    "timestamp": "2025-02-10T19:47:35Z"
  },
  {
    "title": "Was Trump Booed at the 2025 Super Bowl?",
    "description": "The most viral moment at the 2025 Super Bowl was when fans booed Taylor Swift, but what about the president?",
    "link": "https://hollywoodlife.com/2025/02/10/was-trump-booed-2025-super-bowl/",
    "timestamp": "2025-02-10T19:47:07Z"
  },
  {
    "title": "Donald Trump Dunks On Taylor Swift For Getting Booed During The Super Bowl",
    "description": "President Trump still has a bone to pick with Taylor Swift. During the election, Swift endorsed Kamala Harris and took shots at Trump in an Instagram post. On Sunday, both Trump and Swift attended the Super Bowl. While Trump received loud cheers during the na…",
    "link": "https://brobible.com/sports/article/donald-trump-taylor-swift-super-bowl/",
    "timestamp": "2025-02-10T19:46:59Z"
  },
  {
    "title": "Dancer Who Waved Sudan and Gaza Flag During Super Bowl Hit With NFL Ban, But No Charges",
    "description": "A cast member who unfurled a banner combining the Palestinian and Sudanese flags during Kendrick Lamar's halftime show received a lifetime ban from NFL stadiums and events",
    "link": "http://www.rollingstone.com/music/music-news/kendrick-lamar-protester-palestine-sudan-flag-no-charges-1235262507/",
    "timestamp": "2025-02-10T19:46:52Z"
  },
  {
    "title": "Trump Lays the Groundwork to Defy the Courts",
    "description": "The inevitable collision between Donald Trump and the judiciary is accelerating at a remarkable pace. In just three weeks since taking office, at least 10 federal judges have issued rulings blocking or halting key actions",
    "link": "https://politicalwire.com/2025/02/10/trump-lays-the-groundwork-for-defying-the-courts/",
    "timestamp": "2025-02-10T19:44:49Z"
  },
  {
    "title": "Everyone at the Super Bowl Wanted to Hang With Kevin Costner",
    "description": "The real star of the Super Bowl was none other than Kevin Costner. The actor was palling around with everyone from Pete Davidson to Kimberly Guilfoyle.",
    "link": "http://www.thecut.com/article/kevin-costner-pete-davidson-super-bowl-hang-out.html",
    "timestamp": "2025-02-10T19:43:14Z"
  },
  {
    "title": "Trump Has a ‘List’ of National Archives Staff to Fire as Revenge for Docs Scandal",
    "description": "President Donald Trump, still bitter about the FBI's raid of Mar-a-Lago, has asked for a \"list\" of National Archives staffers to fire.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-list-national-archives-staff-fire-1235262564/",
    "timestamp": "2025-02-10T19:42:51Z"
  },
  {
    "title": "Trump Quietly Fires Official In Charge Of Overseeing Corruption In Government",
    "description": "Hampton Dellinger, who was the head of the Office of Special Counsel at the Justice Department, is fighting back with a lawsuit.",
    "link": "https://www.huffpost.com/entry/trump-quietly-fires-watchdog-overseeing-corruption-in-government_n_67aa4eace4b038077c881272",
    "timestamp": "2025-02-10T19:42:39Z"
  },
  {
    "title": "Salesforce plans US$500m in AI-related investments in Saudi Arabia",
    "description": "As countries compete to secure investments in the technology.",
    "link": "https://www.itnews.com.au/news/salesforce-plans-us500m-in-ai-related-investments-in-saudi-arabia-614908?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Technology+feed",
    "timestamp": "2025-02-10T19:42:18Z"
  },
  {
    "title": "Federal Whistleblower Claims Pennsylvania Governor Josh Shapiro Ordered Trump Assassination",
    "description": "A federal whistleblower has come forward with allegations that Pennsylvania Governor Josh Shapiro was involved in the July 13, 2024, assassination attempt on former President Donald Trump in Butler, Pennsylvania. The whistleblower, identified as Hadassah Fein…",
    "link": "https://freerepublic.com/focus/f-news/4296497/posts",
    "timestamp": "2025-02-10T19:42:04Z"
  },
  {
    "title": "Mexico to await potential Trump steel, aluminum tariffs before reacting, Sheinbaum says",
    "description": "Mexico, a top shipper of steel to the United States, will wait to see if U.S. President Donald Trump announces tariffs on steel and aluminum imports before reacting, President Claudia Sheinbaum said on Monday.\nTrump is expected to introduce new 25 per cent ta…",
    "link": "https://biztoc.com/x/aa66402b099e5976",
    "timestamp": "2025-02-10T19:41:02Z"
  },
  {
    "title": "WATCH: Trump Makes Army Ads Great Again After Four Years of Woke Nonsense Under Biden",
    "description": "President Donald Trump promised to strengthen America's military by ensuring that service members will no longer be \"subjected to radical political theories and social experiments while on duty,\" and that's exactly what he's done. Last month, Trump signed an …",
    "link": "https://freebeacon.com/politics/watch-trump-makes-army-ads-great-again-after-four-years-of-woke-nonsense-under-biden/",
    "timestamp": "2025-02-10T19:40:51Z"
  },
  {
    "title": "TikTok wants Android users to sideload its app",
    "description": "With TikTok’s fate in the U.S. uncertain — its ban in the country has been paused, but only temporarily, thanks to an executive order from President Donald Trump — the ByteDance-owned company is now encouraging Android device owners to sideload its video app …",
    "link": "https://biztoc.com/x/93b5970838dffee0",
    "timestamp": "2025-02-10T19:40:47Z"
  },
  {
    "title": "Elon Musk On Cover of Time May Displease Donald Trump",
    "description": "Exactly eight years ago this week, Time magazine published a memorable cover story on Steve Bannon. The headline used for the piece inside the magazine asked, “Is Steve Bannon the Second Most Powerful Man in the World?”\nIt’s easy to forget, but as Donald Trum…",
    "link": "https://biztoc.com/x/722eefe0c8d9011b",
    "timestamp": "2025-02-10T19:40:44Z"
  },
  {
    "title": "Gaza: The Trump family's Middle East business interests",
    "description": "US President Donald Trump's comments on February 4 about Gaza revived an idea previously touted by himself and his son-in-law, Jared Kushner.\nHis plan positions Gaza in terms of real estate potential, rather than its humanitarian or political situation. After…",
    "link": "https://biztoc.com/x/c17e200b89c2ded1",
    "timestamp": "2025-02-10T19:40:41Z"
  },
  {
    "title": "New York Democrats Are Conjuring Up a Despicable Plan to Leave Elise Stefanik’s House Seat Open For Nine Months",
    "description": "New York Democrats' strategic move to delay a special election for Rep. Elise Stefanik’s seat threatens Republican prospects, raising questions about election integrity and political maneuvering ahead of the critical midterms.\nThe post New York Democrats Are …",
    "link": "https://www.thegatewaypundit.com/2025/02/new-york-democrats-are-conjuring-up-despicable-plan/",
    "timestamp": "2025-02-10T19:40:37Z"
  },
  {
    "title": "Tulsi Gabbard faces next test in confirmation battle with key Senate hurdle",
    "description": "Trump's pick to direct national intelligence efforts will get a key Senate vote to tee up her confirmation later this week.",
    "link": "https://www.foxnews.com/politics/tulsi-gabbard-faces-next-test-confirmation-battle-key-senate-hurdle",
    "timestamp": "2025-02-10T19:40:21Z"
  },
  {
    "title": "Trump gets high approval ratings for his first weeks, new CBS poll finds",
    "description": "President Donald Trump received positive marks on immigration policy, his handing of the Israel-Hamas conflict and more.",
    "link": "https://www.cnbc.com/2025/02/10/trump-approval-rating-president-poll.html",
    "timestamp": "2025-02-10T19:40:20Z"
  },
  {
    "title": "Satoshi Nakamoto’s $100-billion hidden Bitcoin wallet faces new risks as mystery deepens",
    "description": "The identity of Bitcoin's creator, Satoshi Nakamoto, remains shrouded in secrecy. A warning has been issued concerning the $100-billion Bitcoin fortune in Nakamoto's inactive wallets amid rising speculation.",
    "link": "https://economictimes.indiatimes.com/news/international/us/satoshi-nakamotos-100-billion-hidden-bitcoin-wallet-faces-new-risks-as-mystery-deepens/articleshow/118126536.cms",
    "timestamp": "2025-02-10T19:40:17Z"
  },
  {
    "title": "TikTok wants Android users to sideload its app",
    "description": "With TikTok’s fate in the U.S. uncertain — its ban in the country has been paused, but only temporarily, thanks to an executive order from President Donald Trump — the ByteDance-owned company is now encouraging Android device owners to sideload its video app …",
    "link": "https://techcrunch.com/2025/02/10/tiktok-wants-android-users-to-sideload-its-app/",
    "timestamp": "2025-02-10T19:38:57Z"
  },
  {
    "title": "Salesforce plans US$500m in AI-related investments in Saudi Arabia",
    "description": "As countries compete to secure investments in the technology.",
    "link": "https://www.itnews.com.au/news/salesforce-plans-us500m-in-ai-related-investments-in-saudi-arabia-614908?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+",
    "timestamp": "2025-02-10T19:38:38Z"
  },
  {
    "title": "2 More U.S. Regulatory Dominos May Have Fallen for Crypto: OCC and CFPB",
    "description": "FDIC Acting Chairman Travis Hill said the agency is overhauling its crypto approach, just as U.S. senators examine regulators keeping banks out of crypto.",
    "link": "https://www.coindesk.com/news-analysis/2025/02/10/two-more-u-s-regulatory-dominos-may-have-fallen-for-crypto-occ-and-cfpb",
    "timestamp": "2025-02-10T19:37:34Z"
  },
  {
    "title": "Don Jr. Brought His Love Triangle to the Super Bowl",
    "description": "In what is becoming a bit of a pattern, Don Jr.’s ex-fiancée, Kimberly Guilfoyle, showed up in the same place as him and his new girlfriend, Bettina Anderson.",
    "link": "http://www.thecut.com/article/don-jr-kimberly-guilfoyle-super-bowl.html",
    "timestamp": "2025-02-10T19:37:27Z"
  },
  {
    "title": "Hegseth bans future trans soldiers, makes sweeping changes for current ones",
    "description": "Defense Sec. Pete Hegseth instituted a ban on allowing transgender people to join the military late last week, following a directive from President Donald Trump.",
    "link": "https://www.foxnews.com/politics/hegseth-bans-future-trans-soldiers-changes-current-ones",
    "timestamp": "2025-02-10T19:37:15Z"
  },
  {
    "title": "CBS News Poll: 70% of Americans Say Donald Trump Is Keeping Campaign Promises",
    "description": "Seventy percent believe President Donald Trump is making good on his campaign promises, a Sunday CBS News poll found, underscoring why the establishment media is in a tizzy. \nThe post CBS News Poll: 70% of Americans Say Donald Trump Is Keeping Campaign Promis…",
    "link": "https://www.breitbart.com/politics/2025/02/10/cbs-news-poll-70-of-americans-say-donald-trump-is-keeping-campaign-promises/",
    "timestamp": "2025-02-10T19:36:08Z"
  },
  {
    "title": "Elon Musk Keeps Boosting White Nationalists on X",
    "description": "In the three weeks since Donald Trump took office, Elon Musk has posted on X at the pace of an iPad-addicted child. During a roughly two-hour stretch on Friday morning, Musk tweeted more than 40 times—about once every three minutes—on X, the social media plat…",
    "link": "https://www.motherjones.com/politics/2025/02/elon-musk-x-racists-boosting-white-nationalists-south-africa-antisemitism-adl-springfield-doge-holocaust/",
    "timestamp": "2025-02-10T19:35:22Z"
  },
  {
    "title": "Trump to Loosen Enforcement of US Law Banning Overseas Bribes (Jenny Leonard/Bloomberg)",
    "description": "Jenny Leonard / Bloomberg:\nTrump to Loosen Enforcement of US Law Banning Overseas Bribes  —  President Donald Trump is set to sign an executive order rolling back enforcement of a law that makes it illegal for US companies to bribe foreign officials, arguing …",
    "link": "https://www.memeorandum.com/250210/p83",
    "timestamp": "2025-02-10T19:35:01Z"
  },
  {
    "title": "Judge finds Trump administration hasn’t fully followed his order to unfreeze federal spending",
    "description": "WASHINGTON (AP) — A federal judge found Monday that the Trump administration hasn’t fully followed his order to unfreeze federal spending and told the White House to release all the money. U.S. District Court Judge John McConnell ruled that ongoing struggles …",
    "link": "https://freerepublic.com/focus/f-news/4296493/posts",
    "timestamp": "2025-02-10T19:34:53Z"
  },
  {
    "title": "“A Real Estate Development for the Future”: Trump Doubles Down on Plan to Take Over Gaza",
    "description": "President Donald Trump is doubling down—in strikingly transactional and inhumane terms—on his stated plan to take over Gaza, force out Palestinians, and block them from returning after the devastating war with Israel. In a new clip previewing a forthcoming in…",
    "link": "https://www.motherjones.com/politics/2025/02/trump-gaza-real-estate-takeover/",
    "timestamp": "2025-02-10T19:34:14Z"
  },
  {
    "title": "Map Shows Red States Losing the Most Funding From NIH Cuts",
    "description": "The NIH's new 15 percent limit on indirect funding could cost states billions of dollars in medical research funding.",
    "link": "https://www.newsweek.com/map-shows-red-states-losing-most-nih-funding-2028959",
    "timestamp": "2025-02-10T19:34:06Z"
  },
  {
    "title": "How much does it cost to make a penny, and are we ‘losing’ money on other coins?",
    "description": "In a move potentially foretold by the Department of Government Efficiency (DOGE), it seems the U.S. could be on the verge of ending penny production. President Donald Trump on Sunday said that he had asked the Treasury Department to stop minting new pennies, …",
    "link": "https://freerepublic.com/focus/f-chat/4296492/posts",
    "timestamp": "2025-02-10T19:33:30Z"
  },
  {
    "title": "'Insult to the people of Australia': US congressman rails against Trump's tariffs",
    "description": "Congressman Joe Courtney tells the house the US president's looming tariffs on steel and aluminium are \"completely needless\" and \"almost an insult to the people of Australia\".",
    "link": "https://www.abc.net.au/news/2025-02-11/donald-tump-looming-tariffs-insult-to-australia-says-lawmaker/104921396",
    "timestamp": "2025-02-10T19:32:51Z"
  },
  {
    "title": "The closure of a consumer watchdog will help Elon Musk — but hurt the rest of us",
    "description": "The Trump administration has effectively shut down the Consumer Financial Protection Bureau, at least for now.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-musk-shut-down-cfpb-big-tech-vought-rcna191479",
    "timestamp": "2025-02-10T19:32:48Z"
  },
  {
    "title": "Elon Musk reminds us why federal judges have life tenure",
    "description": "On top of seemingly supporting defiance of court orders, Elon Musk proposed on his social media platform “that the worst 1% of appointed judges, as determined by elected bodies, be fired every year.”",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/elon-musk-fire-federal-judges-life-tenure-rcna191502",
    "timestamp": "2025-02-10T19:31:14Z"
  },
  {
    "title": "Scaramucci attributes Bitcoin’s late bloomer status to ETF delays",
    "description": "SkyBridge Capital founder Anthony Scaramucci said Bitcoin’s (BTC) current price near $97,000 reflects where it should have been two years ago. Speaking on CNBC’s Squawk Box on Feb. 10, Scaramucci said Bitcoin’s delayed rally was largely due to the sluggish ap…",
    "link": "https://cryptoslate.com/scaramucci-attributes-bitcoins-late-bloomer-status-to-etf-delays/",
    "timestamp": "2025-02-10T19:30:59Z"
  },
  {
    "title": "Why the ‘wallet inspector,’ a 32-year old ‘Simpsons’ gag, may be the defining meme of 2025",
    "description": "Last month, Elon Musk’s social media platform X announced it was launching a “digital wallet” service. Users would be able to transfer money from their bank accounts to a wallet on X, bringing the platform one step closer to its much-promised Everything App d…",
    "link": "https://www.fastcompany.com/91275958/why-the-wallet-inspector-a-32-year-old-simpsons-gag-may-be-the-defining-meme-of-2025",
    "timestamp": "2025-02-10T19:30:00Z"
  },
  {
    "title": "Trump has unleashed chaos by distraction upon the international community. That's no accident",
    "description": "Trump has unleashed chaos by distraction around the world. The result — foreign leaders are scrambling to respond and regular people are wondering how they'll get food and medicine.",
    "link": "https://richmond.com/news/nation-world/government-politics/trump-administration-chao-distraction-political-strategy/article_c86f718b-6f0c-5242-ac1f-6852571c9a20.html",
    "timestamp": "2025-02-10T19:30:00Z"
  },
  {
    "title": "Trump has unleashed chaos by distraction upon the international community. That's no accident",
    "description": "Trump has unleashed chaos by distraction around the world. The result — foreign leaders are scrambling to respond and regular people are wondering how they'll get food and medicine.",
    "link": "https://roanoke.com/news/nation-world/government-politics/trump-administration-chao-distraction-political-strategy/article_cbbe1e4a-7168-5e7c-9319-8830d2da5b9f.html",
    "timestamp": "2025-02-10T19:30:00Z"
  },
  {
    "title": "Trump says he ordered firing of military academies' Board of Visitors",
    "description": "President Trump's administration is cutting membership at the Boards of Visitors for U.S. military academies this week.",
    "link": "https://www.foxnews.com/politics/trump-says-he-ordered-firing-military-academies-board-visitors",
    "timestamp": "2025-02-10T19:26:34Z"
  },
  {
    "title": "Canadian aid workers warn 'catastrophic' USAID halt puts Ottawa's projects in limbo",
    "description": "Canada's aid sector is bracing for cataclysmic suffering worldwide, and is asking Ottawa to help fill gaps as Washington winds down the U.S. Agency for International Development.",
    "link": "https://www.cbc.ca/news/politics/canada-usaid-shutdown-1.7455291",
    "timestamp": "2025-02-10T19:25:34Z"
  },
  {
    "title": "JAMES P. PINKERTON: Trump’s Outside The Box Thinking Could Spark Supply-Side Revolution Not Seen Since Reagan",
    "description": "the Kemp-Reagan-Trump vision is about expanding supply",
    "link": "https://dailycaller.com/2025/02/10/opinion-trump-supply-side-reagan-james-p-pinkerton/",
    "timestamp": "2025-02-10T19:22:53Z"
  },
  {
    "title": "Donald Trump set to pardon disgraced ex-Illinois Gov. Rod Blagojevich: source",
    "description": "President Trump is expected to issue a pardon to former Illinois Gov. Rod Blagojevich, almost exactly five years after he commuted the Democrat’s 14-year sentence on federal corruption charges, The Post has learned. It was unclear when the pardon would be iss…",
    "link": "https://nypost.com/2025/02/10/us-news/donald-trump-set-to-pardon-disgraced-ex-illinois-gov-rod-blagojevich-source/",
    "timestamp": "2025-02-10T19:22:23Z"
  },
  {
    "title": "Poll: Majority of Americans Say 'Tough' and 'Energetic' Trump Doing What He Promised in Campaign",
    "description": "Americans approve of President Donald Trump's job performance and believe the \"tough\" and \"energetic\" president is doing precisely what he promised to do in his campaign, according to a recent CBS News/YouGov poll.\nThe post Poll: Majority of Americans Say ‘To…",
    "link": "https://www.breitbart.com/pre-viral/2025/02/10/poll-majority-americans-say-tough-and-energetic-trump-doing-what-he-promised-campaign/",
    "timestamp": "2025-02-10T19:22:06Z"
  },
  {
    "title": "Democrats Uncover Devious Billionaire Plot To Spend Billions Buying Social Media Company To Get President Trump Elected In Order To Access The Treasury Database And Steal Grandma's $695 Social Security Check",
    "description": "WASHINGTON, D.C. — Democrats have uncovered a devious billionaire plot to spend billions buying a social media company in order to manipulate the country into electing Donald Trump to gain access to the Treasury database and steal American grandmothers' $695 …",
    "link": "https://babylonbee.com/news/democrats-uncover-devious-billionaire-plot-to-spend-billions-buying-social-media-company-to-get-president-trump-elected-in-order-to-access-the-treasury-database-and-steal-grandmas-695-social-",
    "timestamp": "2025-02-10T19:21:28Z"
  },
  {
    "title": "Another Biden Holdover in Executive Branch Caught Up in Trump Firing Spree Files Lawsuit – TRO Request Assigned to Corrupt Obama Judge Amy Berman Jackson",
    "description": "A Biden-appointed special counsel has initiated legal action against Trump following his dismissal, raising critical questions about judicial integrity and political motives in the ongoing legal saga.\nThe post Another Biden Holdover in Executive Branch Caught…",
    "link": "https://www.thegatewaypundit.com/2025/02/another-biden-holdover-executive-branch-caught-up-trump/",
    "timestamp": "2025-02-10T19:20:33Z"
  },
  {
    "title": "Musk’s shadow hangs over Macron’s AI summit",
    "description": "The special relationship that the French president tried to nurture with the tech billionaire never really bore fruit.",
    "link": "https://www.politico.eu/article/elon-musk-shadow-emmanuel-macron-ai-summit/",
    "timestamp": "2025-02-10T19:20:25Z"
  },
  {
    "title": "Strategy gone wrong? Donald Trump angry that deportation numbers aren’t high, ‘It’s driving him nuts,’ claims report",
    "description": "Donald Trump is reportedly fuming that immigration officials are not being able to carry out his promise of carrying out the largest deportation operation in the history of the United States, as the deportation numbers are not taking a surge",
    "link": "https://economictimes.indiatimes.com/news/international/us/strategy-gone-wrong-donald-trump-angry-that-deportation-numbers-arent-high-its-driving-him-nuts-claims-report/articleshow/118126770.cms",
    "timestamp": "2025-02-10T19:19:58Z"
  },
  {
    "title": "President Trump Mocks Taylor Swift for Getting Booed at Super Bowl",
    "description": "Taylor Swift may have shaken off her haters at the 2025 Super Bowl but the moment is continuing to make waves.\nIndeed, President Donald Trump reacted to the singer getting booed at the Feb. 9 game...",
    "link": "https://www.eonline.com/news/1413269/president-donald-trump-mocks-taylor-swift-for-getting-booed-at-super-bowl-2025",
    "timestamp": "2025-02-10T19:19:54Z"
  },
  {
    "title": "Trump Takes Aim at Letitia James in Latest Wave of Revenge",
    "description": "Donald Trump is still stripping the security clearances of his political enemies, and this time, he’s doing it to people who still work for the government!\r\nNew York Attorney General Letitia James and District Attorney Alvin Bragg were the most recent targets…",
    "link": "https://newrepublic.com/post/191359/donald-trump-revenge-security-clearance-letitia-james",
    "timestamp": "2025-02-10T19:19:38Z"
  },
  {
    "title": "Starmer to visit Trump before end of February",
    "description": "Sir Keir Starmer will visit Donald Trump in Washington DC before the end of this month for their first meeting since Mr Trump became president for the second...",
    "link": "https://uk.news.yahoo.com/starmer-lines-trip-washington-dc-191844884.html",
    "timestamp": "2025-02-10T19:18:44Z"
  },
  {
    "title": "Trump unleashes chaos by distraction upon the international community",
    "description": "President Donald Trump has unleashed chaos by distraction around the world with a blitz of executive orders and ideas.",
    "link": "https://biztoc.com/x/1fd922244f57e4cc",
    "timestamp": "2025-02-10T19:18:27Z"
  },
  {
    "title": "U.S. copper price premium soars to record after Trump tariff moves",
    "description": "The price of copper in the United States rocketed on Monday after U.S. President Donald Trump pushed forward his plans to slap tariffs on industrial metals.\nThe premium of U.S. Comex copper futures over those traded on the London Metal Exchange surged to a re…",
    "link": "https://biztoc.com/x/390b3859ede68c21",
    "timestamp": "2025-02-10T19:18:24Z"
  },
  {
    "title": "Map Shows Huge Drops in HIV Funding as Surge in Infections Predicted",
    "description": "The number of new HIV infections could jump since Donald Trump announced a freeze in foreign aid.",
    "link": "https://biztoc.com/x/d285cd1cd8b970d7",
    "timestamp": "2025-02-10T19:18:24Z"
  },
  {
    "title": "Trump administration sued by 22 states over funding cuts to research projects",
    "description": "Twenty-two state attorneys general filed a lawsuit Monday against the Trump administration’s decision to slash research funding by limiting how it pays out universities and research institutes for “indirect costs.”",
    "link": "https://www.nbcnews.com/science/science-news/trump-administration-sued-22-states-funding-cuts-research-projects-rcna191529",
    "timestamp": "2025-02-10T19:17:00Z"
  },
  {
    "title": "States Sue Trump Over Executive Order Halting Trans Health Care Funds",
    "description": "“The order is a cruel and baseless broadside against transgender youth,” the lawsuit says.",
    "link": "https://truthout.org/articles/states-sue-trump-over-executive-order-halting-trans-health-care-funds/",
    "timestamp": "2025-02-10T19:16:43Z"
  },
  {
    "title": "Trump to Pardon Rod Blagojevich",
    "description": "\"President Donald Trump is expected to pardon former Illinois Gov. Rod Blagojevich,\" Axios reports. \"Blagojevich served eight years in prison on charges stemming from his effort to sell Barack Obama's Senate seat after Obama won",
    "link": "https://politicalwire.com/2025/02/10/trump-to-pardon-rod-blagojevich/",
    "timestamp": "2025-02-10T19:16:38Z"
  },
  {
    "title": "The Inside Story of the Super Bowl Halftime Performer Who Raised a Palestine and Sudan Flag",
    "description": "“Are you going to be a coward?” Zül-Qarnain Nantambu asked himself before taking the field for Kendrick Lamar’s show. “Are you going to take a stand?”\nThe post The Inside Story of the Super Bowl Halftime Performer Who Raised a Palestine and Sudan Flag appeare…",
    "link": "https://theintercept.com/2025/02/10/super-bowl-kendrick-lamar-gaza-sudan-protester/",
    "timestamp": "2025-02-10T19:16:22Z"
  },
  {
    "title": "Trump Claims The Jan. 6 Cop-Assaulters He Pardoned Were The Ones Assaulted (S.V. Date/HuffPost)",
    "description": "S.V. Date / HuffPost:\nTrump Claims The Jan. 6 Cop-Assaulters He Pardoned Were The Ones Assaulted  —  The president's latest assertion came as his White House touted his support for first responders.  —  LOADING  —  ABOARD AIR FORCE ONE — President Donald Trum…",
    "link": "https://www.memeorandum.com/250210/p79",
    "timestamp": "2025-02-10T19:15:01Z"
  },
  {
    "title": "‘A Great Move’: Democratic Governor Praises Trump for Ordering An End to the Penny",
    "description": "Despite his willingness to praise Trump at times, Polis has also been a harsh critic of the president, slamming his tariffs among other recent moves.\nThe post ‘A Great Move’: Democratic Governor Praises Trump for Ordering An End to the Penny first appeared on…",
    "link": "https://www.mediaite.com/politics/a-great-move-democratic-governor-praises-trump-for-eliminating-the-penny/",
    "timestamp": "2025-02-10T19:14:29Z"
  },
  {
    "title": "Gaza: The Trump family's Middle East business interests",
    "description": "US President Donald Trump's comments about developing Gaza for real estate purposes are not new. For years, his family has viewed the Middle East as key to its business ambitions. US President Donald Trump's comments on February 4 about Gaza revived an idea p…",
    "link": "https://www.dw.com/en/gaza-the-trump-familys-middle-east-business-interests/a-71564349",
    "timestamp": "2025-02-10T19:14:00Z"
  },
  {
    "title": "Map Shows Huge Drops in HIV Funding as Surge in Infections Predicted",
    "description": "In Africa, a U.S. funding loss will be critical to HIV programs in countries like Uganda, Mozambique and Tanzania.",
    "link": "https://www.newsweek.com/map-shows-huge-drop-hiv-funding-surge-infections-expected-2028938",
    "timestamp": "2025-02-10T19:13:33Z"
  },
  {
    "title": "‘I’m genuinely puzzled:’ The baffling work from home puzzle",
    "description": "Businesses are tightening hybrid work rules but working from home levels have so far barely budged. Find out more.",
    "link": "https://financialpost.com/financial-times/baffling-work-from-home-puzzle",
    "timestamp": "2025-02-10T19:13:02Z"
  },
  {
    "title": "Zelensky to meet JD Vance in Munich on Friday: Kyiv presidency",
    "description": "Ukrainian President Volodymyr Zelensky will meet US Vice President JD Vance on Friday at the Munich Security Conference, where they are set to discuss Washington’s push for an end to the three-year war with Russia. US President Donald Trump will also despatch…",
    "link": "https://www.digitaljournal.com/world/zelensky-to-meet-jd-vance-in-munich-on-friday-kyiv-presidency/article",
    "timestamp": "2025-02-10T19:12:20Z"
  },
  {
    "title": "Why so many Latino voters supported Donald Trump",
    "description": "It’s a mistake to assume American Latinos are a homogenous voter group.",
    "link": "https://theconversation.com/why-so-many-latino-voters-supported-donald-trump-248806",
    "timestamp": "2025-02-10T19:12:18Z"
  }
]