[
  {
    "title": "Australia's Labor party likely to retain power as Trump concerns weigh, polls show",
    "description": "Australia's center-left Labor government is likely to retain power in a close-run national election this weekend, two opinion polls showed on Thursday, with voters ranking U.S. President Donald Trump's policies among their top concerns. A RedBridge-Accent pol…",
    "link": "https://japantoday.com/category/world/australia%27s-centre-left-labor-likely-to-retain-power-as-trump-concerns-weigh-polls-show",
    "timestamp": "2025-05-01T03:55:06Z"
  },
  {
    "title": "Harris Rips Trump In Major Post-Election Speech: 'Wholesale Abandonment' Of U.S. Ideals",
    "description": "Former Vice President Kamala Harris is using a high-profile speech in San Francisco to deliver a sharp-edged critique of President Donald Trump's administration.",
    "link": "https://www.huffpost.com/entry/democrats-harris-trump_n_6812ef2ce4b0a346f101f3fa",
    "timestamp": "2025-05-01T03:54:28Z"
  },
  {
    "title": "As Trump marks 100 days, Harris criticizes economy and warns of a 'constitutional crisis'",
    "description": "Former Vice President Kamala Harris on April 30 criticized President Donald Trump’s economy and warned of a constitutional crisis.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/30/harris-warns-of-constitutional-crisis-in-sharp-critique-of-trump/83331666007/",
    "timestamp": "2025-05-01T03:50:53Z"
  },
  {
    "title": "Kamala Harris accuses Trump of 'wholesale abandonment' of American ideals in major post-election speech",
    "description": "Kamala Harris gave a speech criticizing Donald Trump. This happened amidst speculation about her political future. She might run for president or California governor. Harris spoke at an event for Emerge America. She attacked Trump's handling of the economy an…",
    "link": "https://timesofindia.indiatimes.com/world/us/kamala-harris-accuses-trump-of-wholesale-abandonment-of-american-ideals-in-major-post-election-speech/articleshow/120782386.cms",
    "timestamp": "2025-05-01T03:48:54Z"
  },
  {
    "title": "Bank Of Japan Holds Rates, Lowers Growth Forecasts",
    "description": "The Bank of Japan on Thursday left its key interest rate unchanged but revised down its growth forecasts, warning that US trade tariffs are fuelling economic uncertainty.",
    "link": "https://www.ibtimes.com/bank-japan-holds-rates-lowers-growth-forecasts-3772082",
    "timestamp": "2025-05-01T03:48:08Z"
  },
  {
    "title": "Tokyo Stocks Rise As BoJ Holds Rates Steady",
    "description": "Japanese stocks rose Thursday as the central bank kept its key interest rates steady as expected, in thin trade with most Asian markets shut for the May 1 holiday.",
    "link": "https://www.ibtimes.com/tokyo-stocks-rise-boj-holds-rates-steady-3772079",
    "timestamp": "2025-05-01T03:48:07Z"
  },
  {
    "title": "'Daily Show' Rips Trump For Not Recognizing 1 Key Piece Of American History",
    "description": "Desi Lydic called out the president for his stunningly \"wrong answer\" to ABC News' Terry Moran.",
    "link": "https://www.huffpost.com/entry/daily-show-desi-lydic-trump-declaration-of-independence_n_6812d6a3e4b0a346f101ecc7",
    "timestamp": "2025-05-01T03:45:34Z"
  },
  {
    "title": "Kamala Harris bizarrely references viral elephant video in speech attacking Trump’s ‘vision for America’ after first 100 days: ‘Google it’",
    "description": "Harris described how after they “felt the earth shaking beneath their feet,” elephants in the zoo “got in a circle and stood next to each other to protect the most vulnerable.&#82…",
    "link": "https://nypost.com/2025/04/30/us-news/kamala-harris-brings-up-elephant-video-during-san-francisco-speech-against-trumps-first-100-days-in-office/",
    "timestamp": "2025-05-01T03:45:25Z"
  },
  {
    "title": "Ukraine and US sign minerals deal",
    "description": "WASHINGTON - The United States and Ukraine have signed a minerals deal after a two-month delay, in what President Donald Trump&rsquo;s administration called a new form of US commitment to Kyiv after the end of military aid.",
    "link": "https://www.bangkokpost.com/world/3015385/ukraine-and-us-sign-minerals-deal",
    "timestamp": "2025-05-01T03:45:00Z"
  },
  {
    "title": "Trump Says He Has \"Potential Deals\" With India, Japan Amid Tariff Threat",
    "description": "Trump said he was in no rush to conclude the deals because the United States is reaping the benefits of the tariffs he has imposed.",
    "link": "https://www.ndtv.com/world-news/trump-says-he-has-potential-deals-with-india-japan-south-korea-amid-tariff-threat-8300975",
    "timestamp": "2025-05-01T03:44:03Z"
  },
  {
    "title": "Tokyo stocks rise as BoJ holds rates steady",
    "description": "Japanese stocks rose Thursday as the central bank kept its key interest rates steady as expected, in thin trade with most Asian markets shut for the May 1 holiday. Japan’s main Nikkei 225 index and broader Topix index were up in morning trade, with the Bank o…",
    "link": "https://www.digitaljournal.com/world/tokyo-stocks-rise-as-boj-holds-rates-steady/article",
    "timestamp": "2025-05-01T03:42:32Z"
  },
  {
    "title": "Bank of Japan holds rates, lowers growth forecasts",
    "description": "The Bank of Japan on Thursday left its key interest rate unchanged but revised down its growth forecasts, warning that US trade tariffs are fuelling economic uncertainty. “The introduction of wide-ranging tariffs is expected to impact global trade activity,” …",
    "link": "https://www.digitaljournal.com/world/bank-of-japan-holds-rates-lowers-growth-forecasts/article",
    "timestamp": "2025-05-01T03:42:20Z"
  },
  {
    "title": "Trump company strikes Qatari golf resort deal in a sign it's not holding back from foreign business",
    "description": "The Trump family company has struck a deal for a luxury golf resort in Qatar",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-company-strikes-qatari-golf-resort-deal-sign-121338302",
    "timestamp": "2025-05-01T03:42:15Z"
  },
  {
    "title": "Bank of Japan holds rates, lowers growth forecasts",
    "description": "The Bank of Japan on Thursday left its key interest rate unchanged but revised down its growth forecasts, warning that US trade tariffs are fuelling economic...",
    "link": "https://finance.yahoo.com/news/bank-japan-holds-rates-lowers-034008034.html",
    "timestamp": "2025-05-01T03:40:08Z"
  },
  {
    "title": "Scott Jennings and Ana Navarro Throw Down Over Trump Tattoo Claim: ‘Are You a Tattoo Truther?!’",
    "description": "The panel on CNN News Night got contentious yet again when Scott Jennings and Ana Navarro sparred over President Donald Trump's claims during a recent interview about tattoos on a migrant who was sent to a prison in El Salvador.\nThe post Scott Jennings and An…",
    "link": "https://www.mediaite.com/tv/scott-jennings-and-ana-navarro-throw-down-over-trump-tattoo-claim-are-you-a-tattoo-truther/",
    "timestamp": "2025-05-01T03:37:21Z"
  },
  {
    "title": "US Senate rejects bid to block Trump’s tariffs",
    "description": "Three Republican senators join Democrats in voting for resolution to oppose US president's trade policy.",
    "link": "https://www.aljazeera.com/economy/2025/5/1/us-senate-rejects-bid-to-block-trumps-tariffs",
    "timestamp": "2025-05-01T03:36:48Z"
  },
  {
    "title": "What is in the US-Ukraine minerals deal?",
    "description": "A new investment fund is to be established to help with post-war reconstruction of Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/1/what-is-in-the-us-ukraine-minerals-deal",
    "timestamp": "2025-05-01T03:33:44Z"
  },
  {
    "title": "Leafy suburbs property prices drop on Trump budget cuts effect",
    "description": "Property prices in Juja saw the highest increase in the last year at 13.8 per cent when considering all houses, followed by Loresho at 11.7 per cent and Kiserian at 11.4 per cent.",
    "link": "http://www.standardmedia.co.ke/business/real-estate/article/2001517832/leafy-suburbs-property-prices-drop-on-trump-budget-cuts-effect",
    "timestamp": "2025-05-01T03:31:17Z"
  },
  {
    "title": "Kamala Harris Avers Poll-Sagging Trump DOGE Agenda “Is Not A Vision That Americans Want”",
    "description": "Sounding a lot like a candidate for something, Kamala Harris returned to her old stomping ground of San Francisco tonight to warn Americans the apparent chaos of Donald Trump’s Project 2025 fueled agenda is a ruse to distract from the long-lasting wounds bein…",
    "link": "http://deadline.com/2025/04/kamala-harris-speech-trump-doge-1236381966/",
    "timestamp": "2025-05-01T03:24:29Z"
  },
  {
    "title": "GE2025: Judge the PAP team fairly when deciding Singapore's next chapter, says PM Wong",
    "description": "Prime Minister Lawrence Wong said tripartism is a reason why so much can be achieved in Singapore, with the PAP government, NTUC and the labour movement “working as partners, not at odds with one another”.",
    "link": "https://www.channelnewsasia.com/singapore/ge2025-pap-lawrence-wong-may-day-rally-5101561",
    "timestamp": "2025-05-01T03:22:00Z"
  },
  {
    "title": "Tesla board quietly begins search for Musk’s successor amid company challenges: WSJ",
    "description": "Tesla's search for a new CEO highlights the need for stable leadership to navigate market challenges and sustain investor confidence.\nThe post Tesla board quietly begins search for Musk’s successor amid company challenges: WSJ appeared first on Crypto Briefin…",
    "link": "https://cryptobriefing.com/tesla-leadership-succession-amid-challenges/",
    "timestamp": "2025-05-01T03:20:45Z"
  },
  {
    "title": "Japan's Nikkei rises ahead of BOJ decision; Advantest jumps",
    "description": "Nikkei inched up as investors awaited Bank of Japan's rate decision. Focus is on U.S. trade talks. Advantest surged, buoyed by U.S. tech gains. Bank of Japan is expected to hold rates steady. Investors are keen on Governor Ueda's comments on U.S. trade policy…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-ahead-of-boj-decision-advantest-jumps/articleshow/120782354.cms",
    "timestamp": "2025-05-01T03:17:38Z"
  },
  {
    "title": "Wall Street CEOs Pull The 'Trump Tariff' Card: Is Macro Fear The New Excuse For Weak Guidance?—Asks Leading Fund Manager",
    "description": "As \"macro uncertainty\" and President Donald Trump‘s tariffs become the go-to scapegoats for CEOs this earnings season, fund manager Gary Black isn’t buying it.\nWhat Happened: On Tuesday, Black posted on X, citing former Chicago Mayor Rahm Emanuel's famous quo…",
    "link": "https://biztoc.com/x/539a035ee25bb860",
    "timestamp": "2025-05-01T03:17:31Z"
  },
  {
    "title": "BOJ holds steady on interest rates amid Trump tariff uncertainty",
    "description": "TOKYO -- The Bank of Japan held its key interest rate steady on Thursday as U.S. President Donald Trump's sweeping tariff policy casts a shadow over the Japanese economy.\nThe central bank kept its policy rate, an uncollateralized overnight call rate, at 0.5% …",
    "link": "https://biztoc.com/x/f6ef6e768d28c97d",
    "timestamp": "2025-05-01T03:17:30Z"
  },
  {
    "title": "Bank of Japan holds rates steady for second straight meeting as Trump tariffs threaten exports",
    "description": "Japan's central bank held its policy rate at 0.5% Thursday, holding them for a second straight meeting, as U.S. President Donald Trump's tariffs threaten the country's exports.\nThe move was in line with a Reuters poll of economists, and comes at a time of glo…",
    "link": "https://biztoc.com/x/d73c59bdbb215ca2",
    "timestamp": "2025-05-01T03:17:30Z"
  },
  {
    "title": "Busting ‘Manufacturing Jobs’ Myths",
    "description": "A longstanding goal of American politicians on the left and the right—including and especially the last two U.S. presidents—is to boost not just American manufacturing but American manufacturing jobs. Just yesterday, in fact, President Donald Trump celebrated…",
    "link": "https://biztoc.com/x/2b78ebbbb51ea0c1",
    "timestamp": "2025-05-01T03:17:26Z"
  },
  {
    "title": "Trump adminstration's 1st 100 days: Major policy shifts, legal battles and controversies",
    "description": "WASHINGTON, April 30 (Xinhua) -- The first 100 days of U.S. President Donald Trump's second term hav",
    "link": "http://en.people.cn/n3/2025/0501/c90000-20309990.html",
    "timestamp": "2025-05-01T03:15:00Z"
  },
  {
    "title": "Countries race to recruit U.S. scientists disillusioned by Trump policies",
    "description": "WASHINGTON, April 30 (Xinhua) -- One hundred days into U.S. President Donald Trump's second term, a",
    "link": "http://en.people.cn/n3/2025/0501/c90000-20309993.html",
    "timestamp": "2025-05-01T03:14:40Z"
  },
  {
    "title": "Microsoft reports strong results driven by cloud and AI",
    "description": "Technology giant Microsoft posted robust quarterly results on Wednesday, with revenue rising 13 percent to $70.1 billion, powered by a strong performance in its cloud computing and artificial intelligence businesses. The company's Intelligent Cloud segment, a…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/microsoft-reports-strong-results-driven-by-cloud-and-ai/articleshow/120782313.cms",
    "timestamp": "2025-05-01T03:14:37Z"
  },
  {
    "title": "White House Launches Its Own Drudge Report, Prompting Slap Back From Drudge",
    "description": "The Trump administration launched its own version of the Drudge Report on Wednesday under the name, \"The White House Wire.\"\nThe post White House Launches Its Own Drudge Report, Prompting Slap Back From Drudge first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/white-house-launches-its-own-drudge-report-prompting-slap-back-from-drudge/",
    "timestamp": "2025-05-01T03:12:26Z"
  },
  {
    "title": "Bank of Japan holds rates steady for second straight meeting as Trump tariffs threaten exports",
    "description": null,
    "link": "https://www.cnbc.com/2025/05/01/bank-of-japan-holds-rates-steady-for-second-straight-meeting-as-trump-tariffs-threaten-exports.html",
    "timestamp": "2025-05-01T03:09:19Z"
  },
  {
    "title": "Newt Gingrich Says Trump Now ‘More Religious’ And Knows Why ‘God Saved His Life’ Last Summer",
    "description": "Newt Gingrich said Wednesday that President Donald Trump’s faith has deepened dramatically following what he believes were two near-death experiences last year.",
    "link": "https://dailycaller.com/2025/04/30/newt-gingrich-trump-religious/",
    "timestamp": "2025-05-01T03:08:48Z"
  },
  {
    "title": "Trump Assembles Executives Including Masayoshi Son at White House to Highlight U.S. Investment",
    "description": "At the White House, President Donald Trump brought together corporate executives, including SoftBank Group Chairman and CEO Masayoshi Son, to highlight major investment commitments made in the United States—presenting them as a direct result of his administra…",
    "link": "https://newsonjapan.com/article/145606.php",
    "timestamp": "2025-05-01T03:07:17Z"
  },
  {
    "title": "President Trump Participates in a Cabinet Meeting, Apr. 30, 2025",
    "description": "Complete cabinet meeting. Thot i would post this as i looked for it and doesn't appear to be posted except in pieces.",
    "link": "https://freerepublic.com/focus/f-news/4314330/posts",
    "timestamp": "2025-05-01T03:02:52Z"
  },
  {
    "title": "White House Wants To Use Prisons In More Foreign Countries To Detain Migrants",
    "description": "The U.S.'s standing deal with an infamous prison in El Salvador is already the subject of multiple lawsuits.",
    "link": "https://www.huffpost.com/entry/white-house-deportation-countries-libya-rwanda_n_6812a3b6e4b08d7465599074",
    "timestamp": "2025-05-01T03:01:36Z"
  },
  {
    "title": "‘Let’s Not’: Abby Phillip Calls Out Scott Jennings for Accusing Guest of Being ‘Angry’",
    "description": "A spat between Scott Jennings and Gretchen Carlson took a turn after the Republican operative accused Carlson of being \"angry\" during a spirited debate on Wednesday night.\nThe post ‘Let’s Not’: Abby Phillip Calls Out Scott Jennings for Accusing Guest of Being…",
    "link": "https://www.mediaite.com/tv/lets-not-abby-phillip-calls-out-scott-jennings-for-accusing-guest-of-being-angry/",
    "timestamp": "2025-05-01T03:00:48Z"
  },
  {
    "title": "How will Carney take on Trump?",
    "description": "One hundred days into Donald Trump’s second presidency and he’s already swung another election. How will Canadian Prime Minister Mark Carney, emboldened by his victory at the polls, take on Trump? Host Anne McElvoy talks to Ralph Goodale, who has been at the …",
    "link": "https://www.politico.eu/podcast/power-play/how-will-carney-take-on-trump/",
    "timestamp": "2025-05-01T03:00:00Z"
  },
  {
    "title": "From blackout to ‘black hole’: How streaming services like 9Now and Kayo could swing the election",
    "description": "Streaming providers know where you shop, where you travel, and if you are a parent. And they'll let political parties target you using this data — but won't tell you how.\nThe post From blackout to ‘black hole’: How streaming services like 9Now and Kayo could …",
    "link": "http://www.crikey.com.au/2025/05/01/streaming-services-influence-election-targeted-ads/",
    "timestamp": "2025-05-01T02:58:05Z"
  },
  {
    "title": "India Dials Non-Permanent UN Security Council Members After Pahalgam Attack",
    "description": "In the wake of a deadly terror attack in Jammu and Kashmir&#039;s Pahalgam that claimed 26 civilian lives, India has reached out to its counterparts from eight non-permanent member nations of the United Nations Security Council (UNSC).",
    "link": "https://www.ndtv.com/world-news/with-pakistan-in-unsc-india-dials-non-permanent-un-security-council-members-after-pahalgam-attack-8300747",
    "timestamp": "2025-05-01T02:57:59Z"
  },
  {
    "title": "North Carolina Digital Assets Bill Passes House, Moves to Senate for Debate",
    "description": "As Trump embraces crypto nationally, U.S. states are pushing for their own digital asset legislation politicians warms to the idea.",
    "link": "https://decrypt.co/317247/north-carolina-digital-assets-bill-passes-house",
    "timestamp": "2025-05-01T02:57:20Z"
  },
  {
    "title": "Elon Musk Reacts After Ray Dalio Warns Of US Decline, Says China Has Already Surpassed America As Global Consumption Leader",
    "description": "Billionaire investor Ray Dalio recently sounded the alarm on the future of the United States, warning of a breakdown in the global order and the end of...",
    "link": "https://finance.yahoo.com/news/elon-musk-reacts-ray-dalio-025549136.html",
    "timestamp": "2025-05-01T02:55:49Z"
  },
  {
    "title": "Trump tells business chiefs he needs 'little bit of time' as US economy shrinks",
    "description": "Trump tells business chiefs he needs 'little bit of time' as US economy shrinks\nPresident Donald Trump has asked for more time on the US economy as it contracted for the first time in three years, stoking recession fears.\nHe said the figure was misleading bec…",
    "link": "https://biztoc.com/x/7976711b3ded2e5d",
    "timestamp": "2025-05-01T02:55:35Z"
  },
  {
    "title": "LDP policy chief meets Ryosei Akazawa in U.S. for tariff talk briefing",
    "description": "On his arrival in the United States, Akazawa told reporters tariff measures by the Trump administration were \"causing serious damage.\"",
    "link": "https://www.japantimes.co.jp/business/2025/05/01/japan-akazawa-us-tariff-talks-preparation/",
    "timestamp": "2025-05-01T02:51:00Z"
  },
  {
    "title": "Trump Admin Freaks Out Over Report Amazon Planned To Be Transparent About Tariffs",
    "description": "Okay, there’s a lot to unpack in this story, so hang with me here. For the past month or so, Americans and American businesses have been stuck in tariff hell. Blanket and additional tariffs issued via executive order by Trump have been in a seesaw pattern for…",
    "link": "https://www.techdirt.com/2025/04/30/trump-admin-freaks-out-over-report-amazon-planned-to-be-transparent-about-tariffs/",
    "timestamp": "2025-05-01T02:49:15Z"
  },
  {
    "title": "Second protective order filed by wife of Kilmar Abrego Garcia uncovered",
    "description": "New court documents revealed that the wife of Kilmar Abrego Garcia — the Maryland man mistakenly deported to El Salvador by the Trump administration — filed more than one protective order against him.",
    "link": "https://www.fox5dc.com/news/second-protective-order-filed-wife-kilmar-abrego-garcia-uncovered",
    "timestamp": "2025-05-01T02:44:46Z"
  },
  {
    "title": "Chris Hayes Can’t Believe ‘the Golden Toilet Guy’ – Trump – ‘Is Preaching Minimalism’ Amid Tariff Economic Turmoil | Video",
    "description": "\"Imagine if that had been Donald Trump's 2024, campaign message,\" the MSNBC host mused \nThe post Chris Hayes Can’t Believe ‘the Golden Toilet Guy’ – Trump – ‘Is Preaching Minimalism’ Amid Tariff Economic Turmoil | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/chris-hayes-trump-golden-toilet-guy-minimalism-tariffs-msnbc/",
    "timestamp": "2025-05-01T02:36:29Z"
  },
  {
    "title": "‘This Is An Idiotic Thing To Do’: Kari Lake Blasts Democrat Rep To His Face Over Trump Impeachment Push",
    "description": "Kari Lake ripped into Democrat Michigan Rep. Shri Thanedar to his face over his push to impeach President Donald Trump.",
    "link": "https://dailycaller.com/2025/04/30/kari-lake-democrat-shri-thanedar-piers-morgan-impeachment-donald-trump/",
    "timestamp": "2025-05-01T02:35:33Z"
  },
  {
    "title": "The Economy Just Shrank. Are We In A Recession?",
    "description": "The U.S. economy contracted in the first quarter, raising the question: Are we in a recession? Economic growth, as measured by the Gross Domestic Product, has to be negative for more than one quarter for a recession, according to the National Bureau of Econom…",
    "link": "https://freerepublic.com/focus/f-news/4314323/posts",
    "timestamp": "2025-05-01T02:34:39Z"
  },
  {
    "title": "U.S., Ukraine Sign Minerals Deal in Major Breakthrough for Peace Talks",
    "description": "U.S. and Ukrainian officials have signed a long-anticipated deal that gives the U.S. access to Ukraine’s rare earth minerals in exchange for a promised security guarantee to protect Kyiv from future Russian aggression, signaling President Donald Trump’s commi…",
    "link": "https://slashdot.org/submission/17335639/us-ukraine-sign-minerals-deal-in-major-breakthrough-for-peace-talks",
    "timestamp": "2025-05-01T02:33:59Z"
  },
  {
    "title": "Japan Must Refuse Trump’s Military Cost Demand, Ex-Minister Says",
    "description": "Japan needs to firmly refuse US President Donald Trump’s calls for Tokyo to increase what it pays to keep American military bases in the country, a former Japanese foreign minister said, a day before the second round of talks over tariffs between the allies.",
    "link": "https://financialpost.com/pmn/business-pmn/japan-must-refuse-trumps-military-cost-demand-ex-minister-says",
    "timestamp": "2025-05-01T02:30:33Z"
  },
  {
    "title": "Ukraine signs deal to give US access to rare minerals with Trump admin 'committed to a peace process': The deal will give the US access to Ukraine's rare minerals in exchange for continued support in its war with Russia",
    "description": "Ukraine has signed a deal with the United States, giving the U.S. access to Ukraine's rare minerals as it continues to work with the Trump administration in an effort to end its three-year war with Russia. Ukrainian Economy Minister and Deputy Prime Minister …",
    "link": "https://freerepublic.com/focus/f-news/4314322/posts",
    "timestamp": "2025-05-01T02:30:20Z"
  },
  {
    "title": "Tesla Board Explored Search for New CEO Amid Musk White House Focus: Report",
    "description": "As Musk spent time heading the Department of Government Efficiency, the board explored a search for a new leader.",
    "link": "https://www.newsweek.com/tesla-board-explored-search-new-ceo-amid-musk-white-house-focus-report-2066501",
    "timestamp": "2025-05-01T02:26:58Z"
  },
  {
    "title": "Lovefest or Cabinet meeting? For Donald Trump, it's both (Seung Min Kim/Associated Press)",
    "description": "Seung Min Kim / Associated Press:\nLovefest or Cabinet meeting?  For Donald Trump, it's both  —  Near the end of President Donald Trump's marathon Cabinet meeting Wednesday, Secretary of State Marco Rubio noted that the U.S. has brought home 47 wrongfully deta…",
    "link": "https://www.memeorandum.com/250430/p159",
    "timestamp": "2025-05-01T02:25:00Z"
  },
  {
    "title": "Tucker Carlson accuses Ukrainians of trying to kill Trump",
    "description": "Journalist Tucker Carlson claimed that Ukraine was involved in a plan to kill U.S. President Donald Trump. Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616581-carlson-ukrainians-kill-trump/",
    "timestamp": "2025-05-01T02:23:49Z"
  },
  {
    "title": "Trump says egg prices are falling. Some experts say the claim is misleading",
    "description": "Trump says egg prices are falling. Some experts say the claim is misleading.\nConsumer egg prices have climbed 25% since January, data shows.\nPresident Donald Trump this week disputed criticism over high egg prices in an exclusive interview with ABC News, faul…",
    "link": "https://biztoc.com/x/8caaf5ceae447dca",
    "timestamp": "2025-05-01T02:22:43Z"
  },
  {
    "title": "'What the hell?' Trump baffles internet with wild answer at town hall",
    "description": "President Donald Trump delivered a rambling response to a question about his push to crack down on Harvard University that left many political observers struggling to understand his answer.The baffling moment unfolded Wednesday as Trump called into a NewsNati…",
    "link": "https://www.rawstory.com/trump-2671875126/",
    "timestamp": "2025-05-01T02:21:39Z"
  },
  {
    "title": "Hegseth sends strong message to Iran and Houthis: 'You will pay'",
    "description": "Defense Secretary Pete Hegseth told Iran that it has been warned as it continues to support the Houthis terrorist organization and its attacks in the Red Sea.",
    "link": "https://www.foxnews.com/politics/hegseth-sends-strong-message-iran-houthis-you-pay",
    "timestamp": "2025-05-01T02:21:38Z"
  },
  {
    "title": "China blames US for origin of COVID-19 and turning 'deaf ear to the numerous questions over its conduct'",
    "description": "The United States is to blame for COVID-19, Chinese officials wrote in a paper published Wednesday after the White House blamed the disease on a leak.",
    "link": "https://www.foxnews.com/world/china-blames-us-origin-covid-19-turning-deaf-ear-numerous-questions-over-its-conduct",
    "timestamp": "2025-05-01T02:20:44Z"
  },
  {
    "title": "Trump says US kids may get '2 dolls instead of 30'",
    "description": "President Donald Trump is acknowledging that his tariffs could result in fewer and costlier products in the United States.",
    "link": "https://www.wlwt.com/article/trump-defends-tariffs-us-economy-gdp/64637045",
    "timestamp": "2025-05-01T02:20:30Z"
  },
  {
    "title": "The Trump Administration Has Revoked the Visas of 4,000 Foreign Students in First 100 Days – Most With Criminal Records",
    "description": "As the debate over student visas continues to heat up, Senator Marco Rubio has emerged as a key figure in the discussion. Rubio recently stated, \"We need to strike a balance between welcoming international students and ensuring national security.\"\nThe post Th…",
    "link": "https://www.thegatewaypundit.com/2025/04/trump-administration-has-revoked-visas-4000-foreign-students/",
    "timestamp": "2025-05-01T02:20:04Z"
  },
  {
    "title": "Lovefest or cabinet meeting? For Donald Trump, it's both",
    "description": "Near the end of President Donald Trump’s marathon cabinet meeting Wednesday, Secretary of State Marco Rubio noted that the U.S. has brought home 47 wrongfully detained Americans so far in Trump’s second term. “Forty-seven for the 47th president in the first 1…",
    "link": "https://japantoday.com/category/world/lovefest-or-cabinet-meeting-for-donald-trump-it%27s-both",
    "timestamp": "2025-05-01T02:18:31Z"
  },
  {
    "title": "President Trump reveals what he told Zelenskyy during viral meeting at the Vatican",
    "description": "During a town hall hosted by NewsNation President Donald Trump shared what he and Ukrainian President Volodymyr Zelenskyy discussed during their viral meeting at the Vatican",
    "link": "https://www.foxnews.com/politics/president-trump-reveals-what-he-told-zelenskyy-during-viral-meeting-vatican",
    "timestamp": "2025-05-01T02:18:17Z"
  },
  {
    "title": "Trump's Cabinet shrugs off economic contraction, at odds with pledges",
    "description": "Figures show U.S. gross domestic product contracted at an annual rate of 0.3 percent in the first quarter.",
    "link": "https://www.japantimes.co.jp/news/2025/05/01/world/politics/trump-cabinet-shrinking-economy/",
    "timestamp": "2025-05-01T02:18:00Z"
  },
  {
    "title": "Maryland judge, Sen. Van Hollen push back against Trump administration over Kilmar Abrego Garcia deportation case",
    "description": "A Maryland judge denied the Trump administration's motion to delay discovery in the Kilmar Abrego Garcia deportation case again Wednesday.",
    "link": "https://www.cbsnews.com/baltimore/news/kilmar-abrego-garcia-trump-deportation-immigration-judge/",
    "timestamp": "2025-05-01T02:16:41Z"
  },
  {
    "title": "U.S. eyes more migration deals, with Rwanda said to be in talks",
    "description": "\"We are actively searching for other countries to take people from third countries,\" said U.S. Secretary of State Marco Rubio.",
    "link": "https://www.japantimes.co.jp/news/2025/05/01/world/politics/us-migration-deals-rwanda/",
    "timestamp": "2025-05-01T02:13:00Z"
  },
  {
    "title": "Trump says US kids may get '2 dolls instead of 30'",
    "description": "President Donald Trump is acknowledging that his tariffs could result in fewer and costlier products in the United States.",
    "link": "https://www.wmur.com/article/trump-defends-tariffs-us-economy-gdp/64637045",
    "timestamp": "2025-05-01T02:12:26Z"
  },
  {
    "title": "Trump says US kids may get '2 dolls instead of 30'",
    "description": "President Donald Trump is acknowledging that his tariffs could result in fewer and costlier products in the United States.",
    "link": "https://www.wtae.com/article/trump-defends-tariffs-us-economy-gdp/64637045",
    "timestamp": "2025-05-01T02:12:26Z"
  },
  {
    "title": "Hegseth warns Iran: You will pay the consequences for supporting the Houthis",
    "description": "US Defense Secretary Pete Hegseth warns Iran of consequences for backing Yemen's Houthis, as the US military intensifies its air campaign. Over 1,000 Houthi targets have been hit since mid-March.",
    "link": "https://www.israelnationalnews.com/news/407672",
    "timestamp": "2025-05-01T02:12:16Z"
  },
  {
    "title": "Illegal immigrant with weapons conviction arrested in California as ICE targets criminals",
    "description": "An illegal immigrant with a previous conviction for carrying a concealed weapon was arrested by ICE in California, the agency said on Wednesday.",
    "link": "https://www.foxnews.com/us/illegal-immigrant-weapons-conviction-arrested-california-ice-targets-criminals",
    "timestamp": "2025-05-01T02:11:40Z"
  },
  {
    "title": "The global costs of the US-China tariff war are mounting. And the worst may be yet to come",
    "description": "The escalating US-China trade war leaves everyone worse off. A collective effort to restore the global trading system is urgently needed.",
    "link": "https://theconversation.com/the-global-costs-of-the-us-china-tariff-war-are-mounting-and-the-worst-may-be-yet-to-come-254583",
    "timestamp": "2025-05-01T02:10:26Z"
  },
  {
    "title": "From obedience to choice: A Chinese migrant's first real vote in Australia",
    "description": "I remember my first vote in China — three candidates, three ballot boxes and voting slips. There was just one thing missing and in Australia, it's everywhere.",
    "link": "https://www.abc.net.au/news/2025-05-01/first-time-voter-reflects-on-australian-federal-election-china/105224628",
    "timestamp": "2025-05-01T02:08:30Z"
  },
  {
    "title": "Trump says US kids may get '2 dolls instead of 30'",
    "description": "President Donald Trump is acknowledging that his tariffs could result in fewer and costlier products in the United States.",
    "link": "https://www.ketv.com/article/trump-defends-tariffs-us-economy-gdp/64637045",
    "timestamp": "2025-05-01T02:08:20Z"
  },
  {
    "title": "Trump says tariffs politically risky, but he’s not rushing deals",
    "description": "Trump said there was a significant political risk to his efforts, but added that he remained determined to push on.",
    "link": "https://www.japantimes.co.jp/news/2025/05/01/world/politics/trump-tariffs-risky-deals/",
    "timestamp": "2025-05-01T02:08:00Z"
  },
  {
    "title": "UK military launches airstrikes with US targeting Yemen's Houthi rebels",
    "description": "The British military has launched airstrikes with the United States targeting Yemen’s Houthi rebels",
    "link": "https://abcnews.go.com/International/wireStory/uk-military-launches-airstrikes-us-targeting-yemens-houthi-121301728",
    "timestamp": "2025-05-01T02:06:16Z"
  },
  {
    "title": "Kamala Harris' sharp critique of Trump sparks speculation about political comeback",
    "description": "Kamala Harris is poised to deliver a significant speech at the Emerge America gala, criticizing Donald Trump's leadership and policies. This event marks a pivotal moment as she addresses the political landscape and contemplates her future, including potential…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/kamala-harris-sharp-critique-of-trump-sparks-speculation-about-political-comeback/articleshow/120781595.cms",
    "timestamp": "2025-05-01T02:04:07Z"
  },
  {
    "title": "BOJ to keep rates steady, cut growth forecasts",
    "description": "The Bank of Japan is anticipated to maintain steady interest rates while reducing growth forecasts due to uncertainties surrounding U.S. tariffs. Despite these headwinds, inflation is projected to remain near the 2% target, suggesting that rate hike plans may…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-to-keep-rates-steady-cut-growth-forecasts/articleshow/120781572.cms",
    "timestamp": "2025-05-01T02:02:55Z"
  },
  {
    "title": "Europe’s politicians turn to Newsmax to catch Trump’s eye",
    "description": "The pro-MAGA outlet and its contemporaries are an awkward match for stolid, center-left ministers like those in Britain.",
    "link": "https://www.politico.eu/article/european-politicians-newsmax-donald-trump-maga-media-rachel-reeves-john-healey-uk/",
    "timestamp": "2025-05-01T02:01:00Z"
  },
  {
    "title": "U.S. economy in Q1 shrinks amid new tariff policies, recession concerns grow",
    "description": "People shop for groceries at a store in New York, the United States, on March 28, 2025. (Photo by M",
    "link": "http://en.people.cn/n3/2025/0501/c90000-20309941.html",
    "timestamp": "2025-05-01T01:59:49Z"
  },
  {
    "title": "Meta quarterly profit climbs despite big cloud spending",
    "description": "Meta reported a strong quarter with $16.6 billion profit and $42.3 billion revenue, beating expectations. Advertising remained robust despite economic uncertainties. CEO Mark Zuckerberg highlighted progress in AI, including nearly one billion Meta AI users an…",
    "link": "https://economictimes.indiatimes.com/tech/technology/meta-quarterly-profit-climbs-despite-big-cloud-spending/articleshow/120781537.cms",
    "timestamp": "2025-05-01T01:59:46Z"
  },
  {
    "title": "Tesla Board Reportedly Explored Options for Replacing Musk",
    "description": "An increasingly frustrated board of directors commenced a search of possible candidates to replace CEO Elon Musk, The Wall Street Journal reported on Wednesday night.\nThe post Tesla Board Reportedly Explored Options for Replacing Musk first appeared on Mediai…",
    "link": "https://www.mediaite.com/news/tesla-board-reportedly-explored-options-for-replacing-musk/",
    "timestamp": "2025-05-01T01:58:49Z"
  },
  {
    "title": "Trump says he's made no mistakes despite falling economy and approval ratings",
    "description": "Trump told a NewsNation town hall he's made no mistakes during his first 100 days back in office despite the shrinking economy.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/30/trump-acknowledges-no-mistakes-economy-stocks/83378707007/",
    "timestamp": "2025-05-01T01:57:53Z"
  },
  {
    "title": "UN body warns over Trump’s deep-sea mining order",
    "description": "The head of the International Seabed Authority (ISA) on Wednesday criticized US President Donald Trump’s order to fast-track deep-sea mining in the open ocean outside American territorial waters. “No state has the right to unilaterally exploit the mineral res…",
    "link": "https://www.digitaljournal.com/world/un-body-warns-over-trumps-deep-sea-mining-order/article",
    "timestamp": "2025-05-01T01:57:20Z"
  },
  {
    "title": "'You will be hunted': Voting machine company reveals new death threats from Fox viewers",
    "description": "A leading voting machine manufacturer recently unveiled multiple threats made against its employees as part of its ongoing defamation lawsuit against Fox News.The Washington Post reported Wednesday on the latest federal court filing by Smartmatic, which is se…",
    "link": "https://www.rawstory.com/smartmatic-lawsuit-2671875112/",
    "timestamp": "2025-05-01T01:56:02Z"
  },
  {
    "title": "The Funniest Memes About America’s Impending Doll Shortage",
    "description": "President Trump said, \"Maybe the children will have two dolls instead of 30 dolls.\"",
    "link": "https://gizmodo.com/the-funniest-memes-about-americas-impending-doll-shortage-2000596698",
    "timestamp": "2025-05-01T01:55:00Z"
  },
  {
    "title": "Tesla’s board began the process to replace Elon Musk as CEO",
    "description": "Tesla’s board in March contacted multiple executive placement firms to begin a search process for a new CEO to replace Elon Musk at the helm of the embattled electric car company, the Wall Street Journal reported Wednesday night, citing multiple anonymous sou…",
    "link": "https://www.cnn.com/2025/04/30/business/tesla-board-elon-musk-ceo-search/index.html",
    "timestamp": "2025-05-01T01:54:16Z"
  },
  {
    "title": "Seventeen years later, Brood XIV cicadas emerge in US",
    "description": "by Issam AHMEDThe last time these thrumming, red-eyed bugs burrowed out of the ground across America's suburbs and woodlands was the early summer of 2008.Global financial jitters were mounting, iPhones were a luxury item, and George W. Bush was still presiden…",
    "link": "https://www.rawstory.com/cicadas/",
    "timestamp": "2025-05-01T01:53:41Z"
  },
  {
    "title": "100 days in, Trump still fixated on Joe Biden",
    "description": "by Aurélia ENDSix months after defeating Joe Biden, President Donald Trump is back in power but remains obsessed with his White House predecessor, taking every opportunity to blame the man who remains his greatest political bugbear.The country's GDP fell in t…",
    "link": "https://www.rawstory.com/biden-trump-2671875121/",
    "timestamp": "2025-05-01T01:52:26Z"
  },
  {
    "title": "US, Ukraine sign 'investment' deal for natural resources",
    "description": "Few details are known about the agreement to form a \"reconstruction investment\" fund. However, Ukrainian Economy Minister Yulia Svyrydenko has said Kyiv will retain full ownership of Ukrainian mineral resources.",
    "link": "https://www.dw.com/en/us-ukraine-sign-investment-deal-for-natural-resources/a-72403957",
    "timestamp": "2025-05-01T01:52:00Z"
  },
  {
    "title": "Stephen A. Smith Gets Trump’s Presidential Endorsement: ‘I’d Love To See Him Run’ | Video",
    "description": "As with some of his cabinet picks, Trump appears to connect being on TV to being good at governing\nThe post Stephen A. Smith Gets Trump’s Presidential Endorsement: ‘I’d Love To See Him Run’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-wants-stephen-a-smith-to-run-for-president-news-nation/",
    "timestamp": "2025-05-01T01:51:55Z"
  },
  {
    "title": "Dollar takes a breather; yen waits on BOJ",
    "description": "The dollar stabilized despite weak U.S. data, buoyed by hopes of easing trade tensions, particularly with China. Investors are closely watching upcoming U.S. jobs data and the Bank of Japan's meeting, as these events could influence currency valuations. The A…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-takes-a-breather-yen-waits-on-boj/articleshow/120781462.cms",
    "timestamp": "2025-05-01T01:51:40Z"
  },
  {
    "title": "Lovefest or Cabinet meeting? For Donald Trump, it's both",
    "description": "Donald Trump's Cabinet met to celebrate his second term's first 100 days. Officials lauded Trump's leadership and achievements. Marco Rubio mentioned the return of 47 detained Americans. JD Vance compared Trump to past presidents. Doug Burgum praised Trump's …",
    "link": "https://timesofindia.indiatimes.com/world/us/lovefest-or-cabinet-meeting-for-donald-trump-its-both/articleshow/120781148.cms",
    "timestamp": "2025-05-01T01:50:47Z"
  },
  {
    "title": "Tesla's board looking for Elon Musk's successor as CEO - reports",
    "description": "Tesla's board members have reportedly started their search for someone to replace Elon Musk as CEO.",
    "link": "https://news.sky.com/story/teslas-board-members-have-reportedly-started-looking-for-elon-musks-successor-as-ceo-13359016",
    "timestamp": "2025-05-01T01:50:00Z"
  },
  {
    "title": "Pedro Almodóvar defends Hunter Schafer from Trump’s ‘lunatic’ treatment of trans people",
    "description": "Spanish director Pedro Almodóvar (The Room Next Door) has defended trans star Hunter Schafer (Euphoria) against President Donald Trump’s ‘authoritarian, lunatic’ treatment of trans people in the United States. Almodóvar accepted the Chaplin Award for Film at …",
    "link": "https://www.thepinknews.com/2025/05/01/pedro-almodovar-hunter-schafer-trump/",
    "timestamp": "2025-05-01T01:49:29Z"
  },
  {
    "title": "Australia's centre-left Labor likely to retain power as Trump concerns weigh, polls show",
    "description": "SYDNEY (Reuters) - Australia's centre-left Labor government is likely to retain power in a close-run national election this weekend, two opinion polls showed on Thursday, with voters ranking U.S. President Donald Trump's policies among their top concerns. Rea…",
    "link": "https://www.thestar.com.my/news/world/2025/05/01/australia039s-centre-left-labor-likely-to-retain-power-as-trump-concerns-weigh-polls-show",
    "timestamp": "2025-05-01T01:49:00Z"
  },
  {
    "title": "Late rally propels Dow, S&P 500 to slight gains",
    "description": "The Dow and S&P 500 ended higher after recovering from earlier losses. This happened after economic data revealed a contraction in the first quarter. The GDP fell short of expectations. Consumer spending increased in March. Tech stocks like Meta and Microsoft…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/late-rally-propels-dow-sp-500-to-slight-gains/articleshow/120781433.cms",
    "timestamp": "2025-05-01T01:47:39Z"
  },
  {
    "title": "Trump tells business chiefs he needs 'little bit of time' as US economy shrinks",
    "description": "The US president blames the first quarterly GDP decline in three years on his Democratic predecessor.",
    "link": "https://www.bbc.com/news/articles/c807n4rnmjyo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-01T01:47:27Z"
  },
  {
    "title": "Bank of Japan holds rates as Trump tariffs unsettle markets and economies",
    "description": "The policy board made no adjustment to the short-term policy rate, currently 0.5%, at a two-day meeting that concluded Thursday.",
    "link": "https://www.japantimes.co.jp/business/2025/05/01/economy/boj-mtg-may-2025/",
    "timestamp": "2025-05-01T01:47:00Z"
  },
  {
    "title": "Qualcomm beats expectations but its stock wobbles on light revenue forecast",
    "description": "Chipmaker Qualcomm Inc. beat analysts expectations on the back of some impressive revenue growth as it delivered its second-quarter earnings results today. The company said it’s reaping the rewards of a diversification strategy that has seen it expand beyond …",
    "link": "https://siliconangle.com/2025/04/30/qualcomm-beats-expectations-stock-wobbles-light-revenue-forecast/",
    "timestamp": "2025-05-01T01:46:59Z"
  }
]