[
  {
    "title": "Trump says he spoke with Nobel Peace Prize winner Maria Corina Machado",
    "description": "Asked about the Nobel on Friday evening, Trump did not directly criticise the Committee's decision, but he credited himself for resolving several wars and said Machado might have given him the award if he asked. \"The person who actually got the Nobel Prize ca…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-he-spoke-with-nobel-peace-prize-winner-maria-corina-machado/articleshow/124487350.cms",
    "timestamp": "2025-10-11T18:11:00Z"
  },
  {
    "title": "What did Trump’s latest physical exam reveal about his health? - NewsBreak",
    "description": "WASHINGTON, D.C. — President Donald Trump’s latest medical evaluation at Walter Reed National Military Medical Center found him to be in “exceptional healt",
    "link": "https://www.newsbreak.com/share/4286510755857-what-did-trump-s-latest-physical-exam-reveal-about-his-health?s=a2&amp;share_destination_id=MTk3MzkzNDUwLTE3NjAyMDYyMTMwODk%3D&amp;pd=0DMF3KoP&amp;hl=en_US&amp;send_time=1760206213&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.3%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-11T18:10:57Z"
  },
  {
    "title": "De Niro calls on Americans to join ‘No Kings’ protest",
    "description": "Robert De Niro on Thursday called on people to take to the streets to protest President Trump in an upcoming “No Kings Day” on Oct. 18. “The original No Kings protest was 250 years ago,” De Niro said in a video shared on the Indivisible Project’s Instagram pa…",
    "link": "https://freerepublic.com/focus/f-chat/4345730/posts",
    "timestamp": "2025-10-11T18:09:29Z"
  },
  {
    "title": "De Niro calls on Americans to join ‘No Kings’ protest",
    "description": "Robert De Niro on Thursday called on people to take to the streets to protest President Trump in an upcoming “No Kings Day” on Oct. 18. “The original No Kings protest was 250 years ago,” De Niro said in a video shared on the Indivisible Project’s Instagram pa…",
    "link": "https://freerepublic.com/focus/f-news/4345730/posts",
    "timestamp": "2025-10-11T18:09:29Z"
  },
  {
    "title": "Health Secretary Kennedy, Trump link circumcision to autism through Tylenol - NewsBreak",
    "description": "WASHINGTON – Health Secretary Robert F. Kennedy Jr. expanded his crusade against using Tylenol with a warning: boys who were circumcised were twice as like",
    "link": "https://www.newsbreak.com/share/4283279798226-health-secretary-kennedy-trump-link-circumcision-to-autism-through-tylenol?_f=app_share&amp;pd=0IgZpe4d&amp;lang=en_US&amp;send_time=1760206109&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.40.2.14%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-v2%2Csc_play_button_v1-control&amp;s=i2",
    "timestamp": "2025-10-11T18:09:00Z"
  },
  {
    "title": "Oct. 15 paychecks: Trump vows to get troops paid despite Schumer shutdown",
    "description": "'I will not allow the Democrats to hold our Military, and the entire Security of our Nation, HOSTAGE'",
    "link": "https://www.wnd.com/2025/10/oct-15-paychecks-trump-vows-get-troops-paid/",
    "timestamp": "2025-10-11T18:01:34Z"
  },
  {
    "title": "Trump points the finger at Putin as America's relationship with India falters",
    "description": "Regardless of its historical defence ties to Russia, or its economic reliance on the United States, India is politically non-monogamous.",
    "link": "https://www.abc.net.au/news/2025-10-12/india-united-states-russia-modi-trump-putin/105830580",
    "timestamp": "2025-10-11T18:00:00Z"
  },
  {
    "title": "Market sell-off: Trump post lops off $2 trillion from stocks in a single day (John Melloy/CNBC)",
    "description": "John Melloy / CNBC:\nMarket sell-off: Trump post lops off $2 trillion from stocks in a single day  —  On Friday morning, the S&P 500 was less than a couple of points from another all-time high.  Then, after a single social media post from President Donald Trum…",
    "link": "https://www.memeorandum.com/251011/p43",
    "timestamp": "2025-10-11T18:00:00Z"
  },
  {
    "title": "Joe Biden Reportedly Undergoing Radiation Therapy To Treat Cancer",
    "description": "Former President Joe Biden is receiving radiation therapy and hormone treatment as he battles prostate cancer, according to multiple reports.",
    "link": "https://dailycaller.com/2025/10/11/joe-biden-undergoing-radiation-therapy-treat-prostate-cancer/",
    "timestamp": "2025-10-11T17:58:34Z"
  },
  {
    "title": "Behind the curtain of the unpredictable, and frankly unbelievable, world that is global politics right now",
    "description": "A Hamas leader, who narrowly escaped assassination just weeks ago, tells Sky News he believes Donald Trump is the key to a ceasefire agreement. Few could have anticipated this.",
    "link": "https://news.sky.com/story/my-glimpse-behind-the-curtain-into-the-unpredictable-and-frankly-unbelievable-world-of-global-politics-right-now-13448736",
    "timestamp": "2025-10-11T17:58:00Z"
  },
  {
    "title": "Markets expect Trump's latest China tariffs will backfire as gold jumps and the dollar 'is not looking looking healthy'",
    "description": "Financial markets suffered a rerun of their swoon in April, when “Liberation Day” tariffs shocked global investors, signaling that his latest China duties may end up hurting the U.S. more than their intended target.\nOn Friday, President Donald Trump said he w…",
    "link": "https://biztoc.com/x/7c8b81ee46e40ef8",
    "timestamp": "2025-10-11T17:57:53Z"
  },
  {
    "title": "Kizilelma Conducts First Live Fire Trials",
    "description": "Kizilelma’s live-fire tests come within days of the carriage trials with the TOLUN and TEBER-82 munitions. Baykar’s Kizilelma UCAV recorded another milestone when it dropped two inert munitions, the TOLUN glide bomb and the TEBER-82 guided bomb, in its first …",
    "link": "https://theaviationist.com/2025/10/11/kizilelma-first-live-fire-trials/",
    "timestamp": "2025-10-11T17:57:16Z"
  },
  {
    "title": "How the downfall of Starbucks is destroying the housing market: 'This isn't just about coffee'",
    "description": "Starbucks just closed hundreds of locations, and while that's bad news for coffee drinkers, it could be even worse for the housing market... This is because of the 'Starbucks effect' — the phenomenon where the coffee chain's presence is associated with rising…",
    "link": "https://freerepublic.com/focus/f-news/4345724/posts",
    "timestamp": "2025-10-11T17:47:46Z"
  },
  {
    "title": "Markets braced for chaos after Trump triggers record-breaking crypto crash",
    "description": "Donald Trump’s threat to impose new 100pc tariffs on China has triggered one of the biggest cryptocurrency crashes in history and stoked fears of chaos in global markets next week.\nAround $400bn (£300bn) was wiped off the value of the crypto market in a span …",
    "link": "https://biztoc.com/x/374f1ca0e4930aee",
    "timestamp": "2025-10-11T17:46:41Z"
  },
  {
    "title": "Relief, scepticism over Gaza ceasefire at pro-Palestine rally in London",
    "description": "Tens of thousands gather in British capital with protest leader saying there is 'relief' and 'trepidation' over truce.",
    "link": "https://www.aljazeera.com/news/2025/10/11/relief-scepticism-over-gaza-ceasefire-at-pro-palestine-rally-in-london",
    "timestamp": "2025-10-11T17:43:24Z"
  },
  {
    "title": "Trump Uses Nobel Peace Prize Loss To Reignite Grudge Against Obama",
    "description": "He didn't hold back.",
    "link": "https://www.huffpost.com/entry/trump-obama-nobel-peace-prize_n_68ea8f4be4b097dfe3b22bd1",
    "timestamp": "2025-10-11T17:43:21Z"
  },
  {
    "title": "New US envoy on 6-day India visit: Day 1 sees Sergio Gor meet Modi and Jaishankar",
    "description": "US ambassador-designate Sergio Gor met Prime Minister Narendra Modi in New Delhi. The meeting aimed to address challenges and boost India-US ties. Gor also met External Affairs Minister S Jaishankar and Foreign Secretary Vikram Misri. His appointment is seen …",
    "link": "https://economictimes.indiatimes.com/news/india/new-us-envoy-on-6-day-india-visit-day-1-sees-sergio-gor-meet-modi-and-jaishankar/articleshow/124486312.cms",
    "timestamp": "2025-10-11T17:42:03Z"
  },
  {
    "title": "America is full; no space for Indians, Charlie Kirk said",
    "description": "Among issues Charlie Kirk took a strong stand against was immigration, even legal immigration stemming from H1B visas that many Indian students and professionals use. “America does not need more visas for people from India. Perhaps no form of legal immigratio…",
    "link": "https://freerepublic.com/focus/f-chat/4345723/posts",
    "timestamp": "2025-10-11T17:40:31Z"
  },
  {
    "title": "US Senate passes GAIN Act, prioritizing domestic AI and HPC chip sales",
    "description": "The GAIN AI Act, recently passed by the Senate, stipulates that US manufacturers of high-performance computer chips must fill domestic orders before exporting.",
    "link": "https://cointelegraph.com/news/senate-passes-gain-act-prioritizing-domestic-hpc-ai-sales",
    "timestamp": "2025-10-11T17:38:47Z"
  },
  {
    "title": "Binance offers compensation after $19bn crypto crash that crippled centralised exchanges, boosted DeFi",
    "description": "Crypto sellout triggered record $19bn liquidations and chaos across exchanges. Binance pledges payouts after system failures during market crash. DeFi...",
    "link": "https://www.dlnews.com/articles/markets/binance-offers-compensation-after-bitcoin-price-crash/",
    "timestamp": "2025-10-11T17:38:13Z"
  },
  {
    "title": "Exclusive -- Nate Morris: Donald Trump Deserves Nobel Peace Prize to Be Named After Him",
    "description": "President Donald Trump deserves the Nobel Peace Prize to be named after him, Kentucky Senate candidate Nate Morris (R) said during an interview on Breitbart News Saturday.\nThe post Exclusive — Nate Morris: Donald Trump Deserves Nobel Peace Prize to Be Named A…",
    "link": "https://www.breitbart.com/radio/2025/10/11/exclusive-nate-morris-donald-trump-deserves-nobel-peace-prize-named-after-him/",
    "timestamp": "2025-10-11T17:36:08Z"
  },
  {
    "title": "US values ties with India, says envoy-designate Sergio Gor after meeting PM Modi",
    "description": "US envoy-designate Sergio Gor meets PM Modi, vows to deepen India-US ties on defence, trade, and critical minerals despite tariff tensions",
    "link": "https://www.thehindubusinessline.com/news/us-values-ties-with-india-says-envoy-designate-sergio-gor-after-meeting-pm-modi/article70153148.ece",
    "timestamp": "2025-10-11T17:35:02Z"
  },
  {
    "title": "Biden is receiving radiation and hormone therapy to treat his prostate cancer, aide says",
    "description": "Former President Joe Biden is receiving radiation and hormone therapy as part of a new phase of treating the aggressive form of prostate cancer he was diagnosed with after leaving office, a spokesperson said Saturday.",
    "link": "https://www.pbs.org/newshour/politics/biden-is-receiving-radiation-and-hormone-therapy-to-treat-his-prostate-cancer-aide-says",
    "timestamp": "2025-10-11T17:32:33Z"
  },
  {
    "title": "‘Giveaway scheme’: Republicans aren’t keen on extending Obamacare ‘tax credits’",
    "description": "Sen. Thune: 'For the most part, they’re direct subsidies to insurance companies'",
    "link": "https://www.wnd.com/2025/10/giveaway-scheme-republicans-arent-keen-extending-obamacare-tax/",
    "timestamp": "2025-10-11T17:31:55Z"
  },
  {
    "title": "CNN Host Makes Brutal Case In Favor Of Trump Nobel Prize",
    "description": "Michael Smerconish offered a perhaps unintentionally brutal argument in favor of awarding Trump the Nobel Prize if peace takes hold over the next year.\nThe post CNN Host Makes Brutal Case In Favor Of Trump Nobel Prize first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/cnn-host-makes-brutal-case-in-favor-of-trump-nobel-prize/",
    "timestamp": "2025-10-11T17:31:02Z"
  },
  {
    "title": "DOJ Closing In on Charges Against Bolton, Reports Say",
    "description": "The Justice Department is preparing criminal charges against John Bolton, Donald Trump's former national security adviser, according to exclusive reporting from MSNBC. Prosecutors in Maryland are said to be weighing whether to seek a grand jury indictment or …",
    "link": "https://freerepublic.com/focus/f-news/4345719/posts",
    "timestamp": "2025-10-11T17:30:07Z"
  },
  {
    "title": "Zelenskyy urges Trump to end Ukraine war like in 'the Middle East'",
    "description": "The leaders of Ukraine and the US spoke on the phone on Saturday, with President Zelenskyy urging Trump to broker a deal to stop the war in his country, just like he has in the Middle East.",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-urges-trump-end-ukraine-war-in-middle-east-5396386",
    "timestamp": "2025-10-11T17:28:34Z"
  },
  {
    "title": "Biden undergoes radiation therapy for cancer, spokesperson says",
    "description": "Former President Joe Biden was diagnosed with aggressive prostate cancer four months ago and is now receiving radiation therapy as part of his treatment.",
    "link": "https://www.foxnews.com/politics/biden-undergoes-radiation-therapy-cancer-spokesperson-says",
    "timestamp": "2025-10-11T17:26:46Z"
  },
  {
    "title": "ICE isn't hiring the best people (MSNBC)",
    "description": "MSNBC:\nICE isn't hiring the best people  —  The agency is on a hiring spree.  But we know what that kind of breakneck expansion of the workforce can result in because we've seen it before.  —  As federal agents swarm American cities on the orders of President…",
    "link": "https://www.memeorandum.com/251011/p36",
    "timestamp": "2025-10-11T17:20:02Z"
  },
  {
    "title": "Trump War Chief Hegseth Pushes Back After MAGA Backlash To Foreign Base",
    "description": "Secretary of War Pete Hegseth has sent out a \"clarification\" after major MAGA backlash over news that the U.S. will host a Qatari air force facility on U.S. soil.\nThe post Trump War Chief Hegseth Pushes Back After MAGA Backlash To Foreign Base first appeared …",
    "link": "https://www.mediaite.com/media/news/trump-war-chief-hegseth-pushes-back-after-maga-backlash-to-foreign-base/",
    "timestamp": "2025-10-11T17:19:11Z"
  },
  {
    "title": "Portland Antifa Violence Ignored: Residents, Businesses Demand Federal Help",
    "description": "The White House is spotlighting what it describes as years of unchecked Antifa violence in Portland, Oregon, hosting independent journalists who have documented the unrest as President Donald Trump mobilizes federal resources to address what officials call a …",
    "link": "https://freerepublic.com/focus/f-news/4345714/posts",
    "timestamp": "2025-10-11T17:18:48Z"
  },
  {
    "title": "ICE Propaganda Video Hit with DMCA Takedown Over Use of The Cure’s “Friday I’m in Love”",
    "description": "The Department of Homeland Security had soundtracked a video with The Cure, imagining \"life after all the criminal aliens are deported.\" \nICE Propaganda Video Hit with DMCA Takedown Over Use of The Cure’s “Friday I’m in Love”\nScoop Harrison",
    "link": "https://consequence.net/2025/10/ice-video-dmca-the-cure/",
    "timestamp": "2025-10-11T17:15:27Z"
  },
  {
    "title": "New tariff threats crush stocks during a big week for Nvidia and key portfolio moves",
    "description": "Wall Street's weekly performance was near the flat line heading into Friday. Things started OK on the final trading day of the week, until President Donald Trump 's new China trade threats tanked the stock market. The S & P 500 lost 2.71% on Friday — the wors…",
    "link": "https://biztoc.com/x/0bf30becea4b7fa5",
    "timestamp": "2025-10-11T17:13:32Z"
  },
  {
    "title": "India can grow by 7.5-8% with greater investment in renewable energy: Nicholas Stern",
    "description": "By investing more in clean and efficient infrastructure to meet its sharply higher electricity demands, India can chart a “very different kind of growth” path on its way to becoming a developed nation, according to Nicholas Stern of the London School of Econo…",
    "link": "https://indianexpress.com/article/business/india-grow-investment-renewable-energy-nicholas-stern-10301589/",
    "timestamp": "2025-10-11T17:13:29Z"
  },
  {
    "title": "What Charlie Kirk said about Indians and H-1B visas in tweet posted just days before he was fatally shot",
    "description": "An old tweet by Charlie Kirk has resurfaced after Donald Trump signed a proclamation requiring companies to pay $100,000 yearly for H-1B visas for foreign employees. Shared just six days before he was shot and killed at a Utah college event, the conservative …",
    "link": "https://freerepublic.com/focus/f-chat/4345713/posts",
    "timestamp": "2025-10-11T17:13:13Z"
  },
  {
    "title": "Iran out in cold as Mideast unites in support of Gaza ceasefire",
    "description": "Iran faces a weakened position following the Israel-Hamas war, with its \"Axis of Resistance\" significantly disrupted by Israeli strikes on key leaders and military capabilities. The country's economy is struggling under sanctions, and its regional influence h…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-out-in-cold-as-mideast-unites-in-support-of-gaza-ceasefire/articleshow/124485209.cms",
    "timestamp": "2025-10-11T17:10:12Z"
  },
  {
    "title": "Trump Takes Advantage of Schumer Shutdown, Fires Entire Agency In One Fell Swoop",
    "description": "The Trump administration is using the ongoing government shutdown as an opportunity to cut massive amounts of Democrat waste in government.",
    "link": "https://www.westernjournal.com/trump-takes-advantage-schumer-shutdown-fires-entire-agency-one-fell-swoop/",
    "timestamp": "2025-10-11T17:08:30Z"
  },
  {
    "title": "North Korea displays new long-range missile at military parade celebrating Kim Jong Un",
    "description": "At a massive military parade attended by foreign leaders, North Korean leader Kim Jong Un rolled out his nuclear-armed military’s most powerful weapons, including a new intercontinental ballistic missile he may be preparing to test in coming weeks.",
    "link": "https://www.pbs.org/newshour/world/north-korea-displays-new-long-range-missile-at-military-parade-celebrating-kim-jong-un",
    "timestamp": "2025-10-11T17:06:25Z"
  },
  {
    "title": "CNN Panel Pushes Back On Mike Johnson, MAGA Outrage Over 'No Kings' Rally",
    "description": "“It's just a rally, and it's OK to do that and Trump people do it all the time,” guest Kara Swisher said.",
    "link": "https://www.huffpost.com/entry/abby-phillip-cnn-no-kings-mike-johnson-anti-trump_n_68ea7e76e4b0603b42c6a54c",
    "timestamp": "2025-10-11T17:06:18Z"
  },
  {
    "title": "Facing unprecedented demand, Weld Food Bank manages rising costs, cuts to funding",
    "description": "“The need is overwhelming. And for the first time, I think we feel somewhat unsure of whether or not we’re going to be able to reliably provide the services we have for the last 40 some odd years. …",
    "link": "https://www.greeleytribune.com/2025/10/11/weld-food-bank-snap-federal-demand/",
    "timestamp": "2025-10-11T17:04:27Z"
  },
  {
    "title": "‘Moving Heaven and Earth’: Trump to Return to D.C. to Honor Charlie Kirk with Medal of Freedom on Birthday",
    "description": "President Donald Trump is making extraordinary efforts to return to Washington, D.C., next week to personally award the late Turning Point USA founder Charlie Kirk the Presidential Medal of Freedom during a White House ceremony coinciding with what would have…",
    "link": "https://www.breitbart.com/politics/2025/10/11/moving-heaven-and-earth-trump-to-return-to-d-c-to-honor-charlie-kirk-with-medal-of-freedom-on-birthday/",
    "timestamp": "2025-10-11T17:04:21Z"
  },
  {
    "title": "Trump fires back at China’s rare earth mineral restrictions by threatening 100% tariffs",
    "description": "President Donald Trump declared Friday that he will impose a 100% tariff on all imports from China, while also imposing export controls on “any and all critical software” from the United States.",
    "link": "https://biztoc.com/x/cca1978ea0884c22",
    "timestamp": "2025-10-11T17:01:59Z"
  },
  {
    "title": "Furlough could affect federal civilian employees in Hawaii | Honolulu Star-Advertiser",
    "description": "Hundreds of federal civilian workers in Hawaii may be part of mass layoffs that began Friday by the White House amid a national government shutdown.",
    "link": "https://www.staradvertiser.com/2025/10/11/hawaii-news/furlough-could-affect-federal-civilian-employees-in-hawaii/",
    "timestamp": "2025-10-11T17:00:29Z"
  },
  {
    "title": "Trump fires back at China’s rare earth mineral restrictions by threatening 100% tariffs | TechCrunch",
    "description": "President Donald Trump declared Friday that he will impose a 100% tariff on all imports from China, while also imposing export controls on “any and all critical software” from the United States.",
    "link": "https://techcrunch.com/2025/10/11/trump-fires-back-at-chinas-rare-earth-mineral-restrictions-by-threatening-100-tariffs/",
    "timestamp": "2025-10-11T16:59:01Z"
  },
  {
    "title": "The Trump split screen: A peacemaker abroad, a retribution campaign at home",
    "description": "President Trump achieved a dual victory, securing a Gaza ceasefire deal while simultaneously seeing New York's attorney general indicted after his public demands. This \"split screen\" highlights his presidency, showcasing a peacemaker abroad and a figure fueli…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-trump-split-screen-a-peacemaker-abroad-a-retribution-campaign-at-home/articleshow/124484811.cms",
    "timestamp": "2025-10-11T16:58:39Z"
  },
  {
    "title": "Zcash recovers to pre-crash highs following crypto market meltdown",
    "description": "The Zcash cryptocurrency staged a massive recovery following Friday's crypto market crash that wiped away billions in value from the markets.",
    "link": "https://cointelegraph.com/news/zcash-recovers-crash-high-market-meltdown",
    "timestamp": "2025-10-11T16:58:19Z"
  },
  {
    "title": "Changpeng Zhao Could Soon Return To Binance As President Trump Seriously Weighs Pardon",
    "description": "Changpeng “CZ” Zhao, founder of Binance, is closer to receiving a presidential pardon from U.S. President Donald Trump amid ongoing White House discussions.",
    "link": "https://zycrypto.com/changpeng-zhao-could-soon-return-to-binance-as-president-trump-seriously-weighs-pardon/",
    "timestamp": "2025-10-11T16:56:10Z"
  },
  {
    "title": "‘I don’t care’: Things have gotten so bad for Katie Porter she’s losing to a guy not even in the race",
    "description": "'She has potentially annihilated her chances to be the next governor of California more so than any other candidate I've ever seen'",
    "link": "https://www.wnd.com/2025/10/i-dont-care-things-have-gotten-so-bad/",
    "timestamp": "2025-10-11T16:55:59Z"
  },
  {
    "title": "‘Unlivable’ conditions festered at Chicago apartment building long before jarring immigration raid",
    "description": "A week after federal agents arrested dozens of people during a military-style immigration raid of a South Shore apartment building, resident Cassandra Murray slowly inches down four flights of stairs because the elevators are broken again. Murray is disabled …",
    "link": "https://freerepublic.com/focus/f-news/4345710/posts",
    "timestamp": "2025-10-11T16:54:51Z"
  },
  {
    "title": "Bank Of America, Citi, And Goldman Sachs Among Big Banks Exploring The Launch Of Joint Stablecoin",
    "description": "A group of some of the world’s largest and most powerful banks is working together to explore issuing a stablecoin product.",
    "link": "https://zycrypto.com/bank-of-america-citi-and-goldman-sachs-among-big-banks-exploring-the-launch-of-joint-stablecoin/",
    "timestamp": "2025-10-11T16:52:30Z"
  },
  {
    "title": "Crypto liquidations drive historic market turbulence",
    "description": "Friday saw dramatic crypto market activity in the hours after President Donald Trump threatened a new flare-up in US-China trade tensions.",
    "link": "https://biztoc.com/x/29190e5fe444d088",
    "timestamp": "2025-10-11T16:51:18Z"
  },
  {
    "title": "Trump Derangement: Neil Young to Pull His Music off Amazon Because ‘Bezos Supports This Government’",
    "description": "Leftist rocker Neil Young has pulled his music from Amazon and is calling for a boycott because, he says, the online retail giant supports Donald Trump's government.\nThe post Trump Derangement: Neil Young to Pull His Music off Amazon Because ‘Bezos Supports T…",
    "link": "https://www.breitbart.com/entertainment/2025/10/11/trump-derangement-neil-young-to-pull-his-music-off-amazon-because-bezos-supports-this-government/",
    "timestamp": "2025-10-11T16:51:15Z"
  },
  {
    "title": "Green MEP on Gaza aid flotilla to be released Sunday",
    "description": "An aide to French lawmaker Mélissa Camara said there were no indications she faced mistreatment during her detention.",
    "link": "https://www.politico.eu/article/green-mep-on-gaza-aid-flotilla-to-be-released-sunday/",
    "timestamp": "2025-10-11T16:48:32Z"
  },
  {
    "title": "Hillary Clinton & Kamala Harris Hit Rock Bottom As They Cackle Through An Absurd Lie About Donald Trump",
    "description": "The best #content train on the planet right now went full steam ahead this week, and it even picked up a new, insufferable passenger! The Kamala Harris book tour, in which Kamala goes around and lies her ass off about things that have literally never happened…",
    "link": "https://freerepublic.com/focus/f-chat/4345709/posts",
    "timestamp": "2025-10-11T16:47:54Z"
  },
  {
    "title": "Charlie Kirk's Accused Assassin Asks to Wear Street Clothes and Ditch Shackles for Court",
    "description": "The man accused of violently assassinating Turning Point USA founder Charlie Kirk wants to ditch his prison clothes when he appears in court.\nThe post Charlie Kirk’s Accused Assassin Asks to Wear Street Clothes and Ditch Shackles for Court appeared first on B…",
    "link": "https://www.breitbart.com/crime/2025/10/11/charlie-kirks-accused-assassin-asks-wear-street-clothes-ditch-shackles-court/",
    "timestamp": "2025-10-11T16:44:19Z"
  },
  {
    "title": "The Death of Public Health",
    "description": "Another Friday night massacre, but this time it's not just an essential federal public health agency that will die",
    "link": "https://rasmussenretorts.substack.com/p/the-death-of-public-health",
    "timestamp": "2025-10-11T16:40:57Z"
  },
  {
    "title": "Anti-Fascist Expert Professor Moves His Family To Spain After Threats",
    "description": "An expert on anti-fascist groups who teaches at Rutgers University has fled with his family to Spain after getting death threats amid a campaign by the campus chapter of Turning Point USA and other conservative groups to get him fired. Via AP:\nMark Bray, an a…",
    "link": "https://crooksandliars.com/2025/10/anti-fascist-expert-professor-moves-his",
    "timestamp": "2025-10-11T16:40:52Z"
  },
  {
    "title": "Joy Reid Straight-Up Asks Elizabeth Warren If Trump Has ‘Early Onset Dementia’",
    "description": "Joy Reid bluntly asked Senator Elizabeth Warren if she and her colleagues discuss the prospect that Trump is \"suffering some sort of early onset dementia.\"\nThe post Joy Reid Straight-Up Asks Elizabeth Warren If Trump Has ‘Early Onset Dementia’ first appeared …",
    "link": "https://www.mediaite.com/media/podcasts/joy-reid-straight-up-asks-elizabeth-warren-if-trump-has-early-onset-dementia/",
    "timestamp": "2025-10-11T16:39:27Z"
  },
  {
    "title": "Joe Biden receiving radiation and hormone therapy to treat prostate cancer",
    "description": "Former US president left office in January after he dropped his bid for re-election six months earlier",
    "link": "https://www.irishtimes.com/world/us/2025/10/11/joe-biden-receiving-radiation-and-hormone-therapy-to-treat-prostate-cancer/",
    "timestamp": "2025-10-11T16:35:24Z"
  },
  {
    "title": "RAF spy planes patrol Russian border in response to Putin’s ‘hybrid war’",
    "description": "Two RAF surveillance planes were deployed on a 12-hour mission to patrol Nato’s eastern frontier.",
    "link": "https://uk.news.yahoo.com/raf-spy-planes-patrol-russian-163011714.html",
    "timestamp": "2025-10-11T16:30:11Z"
  },
  {
    "title": "Markets expect Trump’s latest China tariffs will backfire as gold jumps and the dollar ‘is not looking looking healthy’",
    "description": "Financial markets suffered a rerun of their swoon in April, when “Liberation Day” tariffs shocked global investors, signaling that his latest China duties may end up hurting the U.S. more than their intended target.\nOn Friday, President Donald Trump said he w…",
    "link": "https://biztoc.com/x/46bdeb298e1b3b1c",
    "timestamp": "2025-10-11T16:28:50Z"
  },
  {
    "title": "Biden is receiving radiation and hormone therapy to treat his prostate cancer",
    "description": "Biden is receiving radiation and hormone therapy to treat his prostate cancerlocal10.com",
    "link": "https://www.local10.com//health/2025/10/11/biden-is-receiving-radiation-and-hormone-therapy-to-treat-his-prostate-cancer/",
    "timestamp": "2025-10-11T16:27:35Z"
  },
  {
    "title": "Trump Teases Monumental Addition To Nation's Capital In Wordless Midnight Post",
    "description": "The president shared an artist's illustration on his Truth Social platform on Friday for his latest design project in Washington, D.C.",
    "link": "https://www.huffpost.com/entry/trump-teases-triumphal-arch-washington-dc_n_68ea5b60e4b05810b8ff548d",
    "timestamp": "2025-10-11T16:27:33Z"
  },
  {
    "title": "What happens during a US government shutdown?",
    "description": "Many government institutions are affected by a shutdown of the US government. DW explains the mechanisms and consequences of the latest budget gridlock in Washington. The government shutdown in the United States began on October 1, with no end in sight. As a …",
    "link": "https://www.dw.com/en/what-happens-during-a-us-government-shutdown/a-74319785",
    "timestamp": "2025-10-11T16:27:00Z"
  },
  {
    "title": "Israel: Witkoff, Kushner hail Trump ahead of hostage release",
    "description": "White House envoys Steve Witkoff and Jared Kushner thanked Donald Trump for brokering a ceasefire deal for Gaza during a speech on Hostages' Square in Tel Aviv. DW has more.",
    "link": "https://www.dw.com/en/israel-witkoff-kushner-hail-trump-ahead-of-hostage-release/live-74319959",
    "timestamp": "2025-10-11T16:25:00Z"
  },
  {
    "title": "US Has No Plans to Send Troops to Gaza - CENTCOM",
    "description": "WASHINGTON (Sputnik) - The United States does not intend to send its troops to the Gaza Strip as part of the post-conflict stabilization, US Central Command (CENTCOM) chief Brad Cooper confirmed on Saturday.",
    "link": "https://sputnikglobe.com/20251011/us-has-no-plans-to-send-troops-to-gaza---centcom-1122944142.html",
    "timestamp": "2025-10-11T16:24:51Z"
  },
  {
    "title": "트럼프의 무역전쟁은 아직 끝나지 않았다",
    "description": "France's Sébastien Lecornu is racing to form a government, betting on policy concessions and lawmakers’ fear of snap elections as he prepares to file a budget https://t.co/2LlxLx1v2T— Bloomberg (@business) October 11, 2025 The risk for Labour is the UK econom…",
    "link": "https://ryueyes11.tistory.com/511925",
    "timestamp": "2025-10-11T16:24:19Z"
  },
  {
    "title": "‘A war zone’: Federal judges sound alarm on Supreme Court’s use of 'shadow' rulings",
    "description": "A majority of federal judges who spoke with The New York Times recently – many of them appointed by Republican presidents – are sounding the alarm on the Supreme Court’s increased use of its emergency docket, also known as a “shadow docket,” a process by whic…",
    "link": "https://www.rawstory.com/supreme-court-2674176188/",
    "timestamp": "2025-10-11T16:23:47Z"
  },
  {
    "title": "DAVID MARCUS: Ciattarelli backers channel rally magic of Trump, Kirk at NJ event",
    "description": "Jack Ciattarelli draws 800 supporters to a conservative rally in Wildwood, New Jersey, as the GOP gubernatorial candidate builds momentum for his campaign.",
    "link": "https://www.foxnews.com/opinion/david-marcus-ciattarelli-backers-channel-rally-magic-trump-kirk-nj-event",
    "timestamp": "2025-10-11T16:19:53Z"
  },
  {
    "title": "MSNBC Host Calls BS on Trump’s 'Routine' Health Checks",
    "description": "The White House would appear to have struggled with what exactly the word “annual” actually means.",
    "link": "https://www.thedailybeast.com/msnbc-host-calls-bs-on-trumps-routine-health-checks/",
    "timestamp": "2025-10-11T16:18:56Z"
  },
  {
    "title": "Major analyst drops 5-word take on market pullback",
    "description": "The stock market never ceases to amaze, and with President Donald Trump in the driver’s seat, the script can flip at a moment's notice.\nFriday, Oct. 10 was one of those days when the screens bled red, traders went into crisis mode, and the “buy-the-dip” muscl…",
    "link": "https://biztoc.com/x/8e0a229d656ea107",
    "timestamp": "2025-10-11T16:18:04Z"
  },
  {
    "title": "Senators Warn Trump Administration Is Developing Secret Watchlist of Americans",
    "description": "One called National Security Presidential Memorandum 7 “a greater infringement on freedoms than the Patriot Act.”…",
    "link": "https://www.kenklippenstein.com/p/senator-warns-of-trumps-secret-watchlist",
    "timestamp": "2025-10-11T16:16:04Z"
  },
  {
    "title": "Today’s News in a Nutshell",
    "description": "KATHMANDU: Khabarhub brings you a glimpse of major developments of the day in Nepal, including politics, business/economy, sports, entertainment, and more. Shashank advises Deuba: Dissolve central committee, appoint acting president Nepali Congress leader Dr.…",
    "link": "https://english.khabarhub.com/2025/11/500953/",
    "timestamp": "2025-10-11T16:15:45Z"
  },
  {
    "title": "Markets expect Trump’s latest China tariffs will backfire as gold jumps and the dollar ‘is not looking looking healthy’",
    "description": "\"This is now the second instance where markets are trading tariffs as backfiring on the US, not on the rest of the world.\"",
    "link": "https://fortune.com/2025/10/11/trump-china-tariffs-backfire-gold-prices-dollar-stock-selloff/",
    "timestamp": "2025-10-11T16:14:47Z"
  },
  {
    "title": "Protothema at the Gaza–Israel border: Fragile ceasefire takes hold amid tense calm — Watch video",
    "description": "Humanitarian aid is gradually entering northern Gaza, displaced Palestinians are returning to their homes and electricity is being restored - The political weight Trump's visit gives to the process\nThe post Protothema at the Gaza–Israel border: Fragile ceasef…",
    "link": "https://en.protothema.gr/2025/10/11/protothema-at-the-gaza-israel-border-fragile-ceasefire-takes-hold-amid-tense-calm-watch-video/",
    "timestamp": "2025-10-11T16:14:05Z"
  },
  {
    "title": "ICE Will Hold Immigrants in Jail Accused of “Excessive, Invasive” Gynecological Procedures",
    "description": "The Georgia facility gained notoriety for allegations that women received “often unnecessary” gynecological treatment, at times lacking informed consent.\nThe post ICE Will Hold Immigrants in Jail Accused of “Excessive, Invasive” Gynecological Procedures appea…",
    "link": "https://theintercept.com/2025/10/11/ice-georgia-irwin-detention-center-gynecological-procedures/",
    "timestamp": "2025-10-11T16:09:03Z"
  },
  {
    "title": "Democratic National Committee Chair Ken Martin endorses Zohran Mamdani in NYC mayoral race",
    "description": "Democratic National Committee Chair Ken Martin endorsed Zohran Mamdani, the Democratic nominee in the New York City mayoral race, just weeks ahead of Election Day.",
    "link": "https://www.nbcnews.com/politics/elections/democratic-national-committee-zohran-mamdani-endorsement-nyc-mayor-rcna237025",
    "timestamp": "2025-10-11T16:05:57Z"
  },
  {
    "title": "Major analyst drops 5-word take on market pullback",
    "description": "The stock market never ceases to amaze, and with President Donald Trump in the driver’s seat, the script can flip at a moment's notice. Friday, Oct. 10 was...",
    "link": "https://www.thestreet.com/investing/major-analyst-drops-5-word-take-on-market-pullback",
    "timestamp": "2025-10-11T16:02:19Z"
  },
  {
    "title": "Democrats, Media Revive Bogus ‘Antifa Doesn’t Exist’ Narrative",
    "description": "\"There's no Antifa. This is an entirely imaginary organization. There is not an Antifa. This is no different than if they announced they rounded up a dozen decepticons...\"\nThe post Democrats, Media Revive Bogus ‘Antifa Doesn’t Exist’ Narrative first appeared …",
    "link": "https://legalinsurrection.com/2025/10/democrats-media-revive-bogus-antifa-doesnt-exist-narrative/",
    "timestamp": "2025-10-11T16:00:56Z"
  },
  {
    "title": "SUI Ready For $7 Price Target As Market Pressure Builds — Analyst",
    "description": "Amid a new wave of economic tensions between the US and China, Sui (SUI), alongside other cryptocurrencies, has experienced a heavy price decline in the past few hours as investors move their capital into more stable assets. Despite this mayhem, prominent mar…",
    "link": "http://www.newsbtc.com/sui/sui-ready-for-7-price-target-as-market-pressure-builds-analyst/",
    "timestamp": "2025-10-11T16:00:42Z"
  },
  {
    "title": "Hostages to be released on Monday - perhaps even Sunday",
    "description": "Under the agreement, living hostages will be returned first, possibly as a single group, and deceased hostages will be returned later.",
    "link": "https://www.israelnationalnews.com/news/416097",
    "timestamp": "2025-10-11T16:00:00Z"
  },
  {
    "title": "Asean to have 11 members",
    "description": "SERI ISKANDAR: Timor-Leste will officially become a full member of Asean on Oct 26, says Prime Minister Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/12/asean-to-have-11-members",
    "timestamp": "2025-10-11T16:00:00Z"
  },
  {
    "title": "Call for contingency plans in face of US govt shutdown",
    "description": "PETALING JAYA: Several export-oriented sectors in Malaysia will be impacted if there is a prolonged shutdown of the US government, say industry players. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/12/call-for-contingency-plans-in-face-of-us-govt-shutdown",
    "timestamp": "2025-10-11T16:00:00Z"
  },
  {
    "title": "United Ireland could result in unionists holding Dáil’s balance of power, UUP leader says",
    "description": "Mike Nesbitt warns ‘biggest threat’ to NI remaining part of UK is English nationalism",
    "link": "https://www.irishtimes.com/politics/2025/10/11/united-ireland-could-result-in-unionists-holding-dails-balance-of-power-uup-leader-says/",
    "timestamp": "2025-10-11T15:59:19Z"
  },
  {
    "title": "United Ireland could result in unionists holding Dáil’s balance of power, UUP says",
    "description": "Mike Nesbitt warns ‘biggest threat’ to NI  remaining part of UK is English nationalism",
    "link": "https://www.irishtimes.com/politics/2025/10/11/united-ireland-could-result-in-unionists-holding-dails-balance-of-power-conference-hears/",
    "timestamp": "2025-10-11T15:59:19Z"
  },
  {
    "title": "Chicago Mayor Flat Out Says Trump ‘Declared War’ On His City After President Calls For His Arrest",
    "description": "Chicago Mayor Brandon Johnson claimed on Saturday that it's \"clear\" President Donald Trump has \"declared war\" on his city and others.\nThe post Chicago Mayor Flat Out Says Trump ‘Declared War’ On His City After President Calls For His Arrest first appeared on …",
    "link": "https://www.mediaite.com/media/tv/chicago-mayor-flat-out-says-trump-declared-war-on-his-city-after-president-calls-for-his-arrest/",
    "timestamp": "2025-10-11T15:59:01Z"
  },
  {
    "title": "Zelenskiy Discusses Air Defense, Weapons With Trump, Carney",
    "description": "Volodymyr Zelenskiy had a “very positive and productive” phone call with President Donald Trump and also spoke on Saturday with Canadian Prime Minister Mark Carney, the Ukrainian president said in posts on X.",
    "link": "https://financialpost.com/pmn/business-pmn/zelenskiy-discusses-air-defense-weapons-with-trump-carney",
    "timestamp": "2025-10-11T15:57:13Z"
  },
  {
    "title": "AstraZeneca agrees to cut US drug prices under Trump tariff pressure",
    "description": "The UK-based pharma giant AstraZeneca agreed to lower its medicine prices in the US, President Donald Trump announced on Friday, following weeks of threats to impose steep tariffs on imported pharmaceuticals.\nAstraZeneca “has committed to granting Americans s…",
    "link": "https://biztoc.com/x/157118c1561929c9",
    "timestamp": "2025-10-11T15:55:27Z"
  },
  {
    "title": "Rahm Emanuel agrees that 'President Trump deserves credit' for Israel-Hamas peace deal",
    "description": "Former Chicago Mayor Rahm Emanuel praised Donald Trump's role in brokering Israel-Hamas ceasefire on Friday, saying it proves America remains the essential global power.",
    "link": "https://www.foxnews.com/media/rahm-emanuel-agrees-president-trump-deserves-credit-israel-hamas-peace-deal",
    "timestamp": "2025-10-11T15:55:14Z"
  },
  {
    "title": "Sorry, Dems: President Trump Is in Great Health",
    "description": "Americans have worried about the health of presidents, well, since there have been Americans and American presidents. We expect the...",
    "link": "https://redstate.com/wardclark/2025/10/11/sorry-dems-president-trump-is-in-great-health-n2194960",
    "timestamp": "2025-10-11T15:53:27Z"
  },
  {
    "title": "“The People Deserve the Truth!” – Jasmine Crockett Slams White House, Demands Transparency on Donald Trump’s Health - NewsBreak",
    "description": "President Donald Trump underwent a semiannual health check following his annual one in April and was declared to be in good health. However, the test has o",
    "link": "https://www.newsbreak.com/share/4286334451569-the-people-deserve-the-truth-jasmine-crockett-slams-white-house-demands-transparency-on-donald-trump-s-health?s=a2&amp;share_destination_id=MjM3Nzg0NTk4LTE3NjAxOTc0MDUyNjM%3D&amp;pd=0G5idSeg&amp;hl=en_US&amp;send_time=1760197405&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.40.3%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v3",
    "timestamp": "2025-10-11T15:51:49Z"
  },
  {
    "title": "Analyst who called the 2022 crypto crash warns of new ‘black swan’",
    "description": "The pseudonymous crypto trader “Capo of Crypto”, known among retail traders for correctly predicting the 2022 capitulation, says this week’s carnage may be...",
    "link": "https://www.thestreet.com/crypto/business/analyst-2022-crypto-crash-warns-of-black-swan",
    "timestamp": "2025-10-11T15:51:45Z"
  },
  {
    "title": "Biden receiving radiation and hormone therapy to treat prostate cancer",
    "description": "The 82-year-old Democrat left office in January after he had dropped his bid for re-election six months earlier.",
    "link": "https://www.thejournal.ie/biden-cancer-treatment-6841849-Oct2025/",
    "timestamp": "2025-10-11T15:48:07Z"
  },
  {
    "title": "AstraZeneca agrees to cut US drug prices under Trump tariff pressure",
    "description": "The move reflects the administration’s strategy of directly pressuring drugmakers through tariff threats",
    "link": "https://www.euractiv.com/news/astrazeneca-agrees-to-cut-us-drug-prices-under-trump-tariff-pressure/",
    "timestamp": "2025-10-11T15:47:14Z"
  },
  {
    "title": "Stocks’ worst swoon since fallout from Liberation Day: Trump Truth Social post on ‘massive increase of tariffs’ shatters calm",
    "description": "A monthslong calm on Wall Street shattered Friday, and U.S. stocks tumbled after President Donald Trump threatened to crank tariffs much higher on China.\nThe S&P 500 sank 2.7% in its worst day since April 10. The Dow Jones Industrial Average dropped 878 point…",
    "link": "https://biztoc.com/x/c1197f4f13979d7b",
    "timestamp": "2025-10-11T15:44:40Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Calls Out New Trump Threat — Words Could Be Used ‘In Forthcoming Lawsuits’",
    "description": "Kaitlan Collins called out Trump’s threat to target Democrats with mass layoffs amid the government shutdown, noting it could end up bolstering lawsuits.\nThe post CNN’s Kaitlan Collins Calls Out New Trump Threat — Words Could Be Used ‘In Forthcoming Lawsuits’…",
    "link": "https://www.mediaite.com/media/tv/cnns-kaitlan-collins-calls-out-new-trump-threat-words-could-be-used-in-forthcoming-lawsuits/",
    "timestamp": "2025-10-11T15:44:37Z"
  },
  {
    "title": "Macron heads to Egypt on Monday to back Gaza ceasefire deal",
    "description": "The announcement follows a meeting of European and Arab-Muslim leaders hosted by Macron in Paris this week",
    "link": "https://www.euractiv.com/news/macron-heads-to-egypt-on-monday-to-back-gaza-ceasefire-deal/",
    "timestamp": "2025-10-11T15:44:00Z"
  },
  {
    "title": "Trump ‘remains in exceptional health’ after check-up",
    "description": "President Donald Trump “remains in exceptional health” after his follow-up exam at Walter Reed National Military Medical Center.",
    "link": "https://www.oann.com/newsroom/trump-remains-in-exceptional-health-after-check-up/",
    "timestamp": "2025-10-11T15:37:10Z"
  }
]