[
  {
    "title": "Stablecoin, crypto market structure legislation slated for approval by August – Bo Hines",
    "description": "President Donald Trump’s administration aims to finalize stablecoin and crypto market structure legislation before the August 2025 congressional recess, according to Bo Hines, executive director of the President’s Council of Advisors on Digital Assets.  In a …",
    "link": "https://cryptoslate.com/stablecoin-crypto-market-structure-legislation-slated-for-approval-by-august-bo-hines/",
    "timestamp": "2025-04-29T21:40:13Z"
  },
  {
    "title": "Trump's Truth Social Mulls Launching Token for Subscriptions in Latest Crypto Push",
    "description": "The company also plans to forge ahead with its ETFs, which will include cryptocurrencies.",
    "link": "https://www.coindesk.com/business/2025/04/29/trump-s-truth-social-mulls-launching-token-for-subscriptions-in-further-crypto-push",
    "timestamp": "2025-04-29T21:39:38Z"
  },
  {
    "title": "Nasdaq Seeks SEC Nod To List 21Shares’ Proposed Spot Dogecoin ETF",
    "description": "Nasdaq submitted a 19b-4 filing with the U.S. SEC to approve the listing of a spot Dogecoin exchange-traded fund (ETF) managed by 21Shares.",
    "link": "https://zycrypto.com/nasdaq-seeks-sec-nod-to-list-21shares-proposed-spot-dogecoin-etf/",
    "timestamp": "2025-04-29T21:39:26Z"
  },
  {
    "title": "I Can Get Behind Any System By Which a Pathetic Goon like Pierre Poilievre Can Lose Twice in One Night",
    "description": "Meanwhile, the liberal leader, Mark Carney, the next prime minister of Canada, is leaving his every word unminced. He considers his win a victory over an opponent besides Poilievre.",
    "link": "https://www.esquire.com/news-politics/politics/a64625173/canada-parliamentary-elections-poilievre-loss/",
    "timestamp": "2025-04-29T21:39:00Z"
  },
  {
    "title": "Donald Trump Removes Doug Emhoff And Other Joe Biden Appointees From U.S. Holocaust Museum’s Board",
    "description": "Donald Trump has acted once again to remove his predecessor Joe Biden’s appointees from various commissions, this time ousting former Second Gentleman Doug Emhoff and other Democrats from the board that oversees the U.S. Holocaust Memorial Museum. Emhoff, who…",
    "link": "http://deadline.com/2025/04/trump-holocaust-museum-doug-emhoff-1236380394/",
    "timestamp": "2025-04-29T21:38:49Z"
  },
  {
    "title": "Dem senators rip GOP's 'Silence of the Lambs' as Trump marks 100th day",
    "description": "Democratic United States senators Amy Klobuchar, Cory Booker and Chuck Schumer slammed President Donald Trump on his 100th day in office.",
    "link": "https://www.foxnews.com/politics/dem-senators-rip-gops-silence-lambs-trump-marks-100th-day",
    "timestamp": "2025-04-29T21:38:02Z"
  },
  {
    "title": "Trump Jokes About His 'No. 1 Choice' For Pope, And People Pray He's Really Kidding",
    "description": "\"God help us,\" one person wrote on social media.",
    "link": "https://www.huffpost.com/entry/trump-jokes-about-his-number-one-choice-for-pope_n_68112810e4b0ba6ce6d4d692",
    "timestamp": "2025-04-29T21:37:00Z"
  },
  {
    "title": "Carney and Trump to meet in person in 'near future' during call Tuesday: PMO",
    "description": "The Canadian readout of the call said that Trump congratulated newly-elected Carney, and that both leaders agreed to work together as independent nations.",
    "link": "https://nationalpost.com/news/politics/mark-carney-donald-trump-call",
    "timestamp": "2025-04-29T21:36:44Z"
  },
  {
    "title": "‘DISGUSTING’: Legal Immigrant Descended From Holocaust Survivor Slams Democrat Comparing Trump’s Deportations to Hitler",
    "description": "A Republican Colorado state representative who came to the U.S. legally and is descended from a Holocaust survivor slammed his Democrat colleague for comparing President... Read More\nThe post ‘DISGUSTING’: Legal Immigrant Descended From Holocaust Survivor Sla…",
    "link": "https://www.dailysignal.com/2025/04/29/disgusting-legal-immigrant-descended-holocaust-survivors-slams-democrat-comparing-trumps-deportations-hitler/",
    "timestamp": "2025-04-29T21:35:08Z"
  },
  {
    "title": "D.L. Hughley Slams Saquon Barkley, Other Eagles for Visiting White House",
    "description": "D.L. Hughley says any Black person who visits President Donald Trump in the White House doesn't understand or care about Black issues ... specifically tearing into Saquon Barkley for going with the Eagles to the president's residence. The comedian…\n Permalink",
    "link": "https://www.tmz.com/2025/04/29/dl-hughley-slams-saquon-barkley-eagles-visiting-white-house/",
    "timestamp": "2025-04-29T21:35:04Z"
  },
  {
    "title": "Trump Pick to Run DEA Could Challenge America’s Already Tense Relations With Mexico",
    "description": "by Tim Golden \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nIn the spring of 2019, as a new Mexican government shut down most of its cooperat…",
    "link": "https://www.propublica.org/article/trump-dea-nominee-terry-cole-mexico-drug-cartels",
    "timestamp": "2025-04-29T21:35:00Z"
  },
  {
    "title": "MAGA supporters get the shock of their lives realizing that Trump's tariffs are bad for them, too",
    "description": "It’s finally time for the “find out” part of FAFO.",
    "link": "https://www.pride.com/politics/maga-angry-at-trump-tariffs",
    "timestamp": "2025-04-29T21:34:42Z"
  },
  {
    "title": "‘Bloodbath’: Woke lawyers in DOJ ‘self-deporting’ when told to do their job",
    "description": "'En masse, dozens and now over 100 attorneys decided they'd rather not'",
    "link": "https://www.wnd.com/2025/04/bloodbath-woke-lawyers-in-doj-self-deporting-when-told-to-do-their-job/",
    "timestamp": "2025-04-29T21:34:07Z"
  },
  {
    "title": "Amazon Won’t Display Tariff Costs Next to Product Prices",
    "description": "Amazon said Tuesday it would not be displaying the cost of tariffs right next to products’ total prices on any of the company’s websites, contrary... Read More\nThe post Amazon Won’t Display Tariff Costs Next to Product Prices appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2025/04/29/amazon-declines-show-tariff-impact-goods/",
    "timestamp": "2025-04-29T21:34:00Z"
  },
  {
    "title": "‘Stop Hyperventilating’: Fox News’ Will Cain Confronts James Carville Over Comparing Trump To Hitler",
    "description": "Fox News host Will Cain confronted Democratic strategist James Carville on Tuesday over likening President Donald Trump to Adolf Hitler.",
    "link": "https://dailycaller.com/2025/04/29/fox-news-will-cain-confronts-james-carville-comparing-trump-hitler/",
    "timestamp": "2025-04-29T21:33:57Z"
  },
  {
    "title": "Trump locks in future of Michigan air base with new fighter jet announcement",
    "description": "President Donald Trump landed in Michigan and shared a hug with a longtime antagonist, Democratic Gov. Gretchen Whitmer, as they appeared together to announce a new fighter jet mission being placed at an Air National Guard base outside Detroit",
    "link": "https://abcnews.go.com/US/wireStory/trump-locks-future-michigan-air-base-new-fighter-121292903",
    "timestamp": "2025-04-29T21:32:49Z"
  },
  {
    "title": "Trump praises Gov. Gretchen Whitmer while announcing new fighter jets for a Michigan air base",
    "description": "Trump announced a new series of fighter jets for the Selfridge Air National Guard base in Michigan, giving credit in part to Democratic Gov. Gretchen Whitmer.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-praises-gov-gretchen-whitmer-michigan-air-base-rcna203610",
    "timestamp": "2025-04-29T21:31:10Z"
  },
  {
    "title": "The story of Trump's first 100 days in 4 charts: From the Politics Desk",
    "description": "In today’s edition, we break down four sets of data that explain President Donald Trump’s first 100 days in office.",
    "link": "https://www.nbcnews.com/politics/politics-news/story-trumps-first-100-days-4-charts-politics-desk-rcna203564",
    "timestamp": "2025-04-29T21:30:00Z"
  },
  {
    "title": "Trump's first 100 Days in photos",
    "description": "President Donald Trump has rolled out a tariff regime, pushed for mass deportations, empowered Elon Musk to slash the government and more.",
    "link": "https://www.cnbc.com/2025/04/29/trumps-first-100-days-in-photos.html",
    "timestamp": "2025-04-29T21:29:32Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In Haiti, the Office for the Coordination of Humanitarian Affairs reports that gang activities continue to fuel violence, displace families and disrupt humanitarian operations. According to International Organization for Migration, more than 200,000 people we…",
    "link": "https://press.un.org/en/2025/db250429.doc.htm",
    "timestamp": "2025-04-29T21:29:32Z"
  },
  {
    "title": "Iraqi man charged with illegally voting in the 2020 election in New York",
    "description": "An Iraqi man living in upstate New York has been charged with illegally voting in the 2020 election",
    "link": "https://abcnews.go.com/Politics/wireStory/iraqi-man-charged-illegally-voting-2020-election-new-121293216",
    "timestamp": "2025-04-29T21:29:27Z"
  },
  {
    "title": "You're Fired: Trump Kicks Doug Emhoff off U.S. Holocaust Memorial Council",
    "description": "President Donald Trump fired former Second Gentleman Doug Emhoff from the U.S. Holocaust Memorial Council, along with others nominated by President Joe Biden, on Tuesday, his 100th day in office.\nThe post You’re Fired: Trump Kicks Doug Emhoff off U.S. Holocau…",
    "link": "https://www.breitbart.com/politics/2025/04/29/youre-fired-trump-kicks-doug-emhoff-off-u-s-holocaust-memorial-council/",
    "timestamp": "2025-04-29T21:29:01Z"
  },
  {
    "title": "Live: Shares keep rising as US sees record trade deficit",
    "description": "Markets are set for another day of moderate gains, and the US has posted a record trade deficit for March ahead of the imposition of Donald Trump's sweeping tariffs in April. Follow the day's events and insights from our business reporters on the ABC News liv…",
    "link": "https://www.abc.net.au/news/2025-04-30/asx-markets-business-news-live-updates/105232100",
    "timestamp": "2025-04-29T21:28:44Z"
  },
  {
    "title": "Iraqi Man Accused Of Illegally Voting In 2020 Election In New York",
    "description": "Akeel Abdul Jamiel, 45, is charged with voting by aliens, a misdemeanor punishable by up to one year in prison.",
    "link": "https://www.huffpost.com/entry/akeel-abdul-jamiel-illegal-voting-2020_n_681142fbe4b048ed15244529",
    "timestamp": "2025-04-29T21:28:08Z"
  },
  {
    "title": "WATCH: AOC leaves door open for 2028 presidential bid as campaign buzz soars",
    "description": "Rep. Alexandria Ocasio-Cortez, D-N.Y., did not rule out 2028 presidential aspirations when asked by Fox News Digital about the viral video that had pundits guessing if she was soft launching her campaign.",
    "link": "https://www.foxnews.com/politics/watch-aoc-leaves-door-open-2028-presidential-bid-campaign-buzz-soars",
    "timestamp": "2025-04-29T21:27:22Z"
  },
  {
    "title": "Exclusive — Sen. Marsha Blackburn, Republicans Propose to Ensure America Remains Top Destination for Investment",
    "description": "Sen. Marsha Blackburn (R-TN) and Senate Republicans on Tuesday proposed legislation on Tuesday that would make President Donald Trump's Investment Accelerator permanent and make sure the United States is the top destination for investment.\nThe post Exclusive …",
    "link": "https://www.breitbart.com/politics/2025/04/29/exclusive-sen-marsha-blackburn-republicans-propose-to-ensure-america-remains-top-destination-for-investment/",
    "timestamp": "2025-04-29T21:26:52Z"
  },
  {
    "title": "Trump Official Tells Fox News to Fire Its Pollster Live on Air",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA top Trump administration official blasted Fox News' pollster during a live interview on the network when he was confronted about President Donald Trump's dismal poll numbers.\nNewsweek has reached out to the …",
    "link": "https://biztoc.com/x/1c998d5a8f3ef332",
    "timestamp": "2025-04-29T21:26:18Z"
  },
  {
    "title": "Amazon Pressures Suppliers For Discounts, May Show Tariff Related Costs On Haul Site",
    "description": "Amazon.Com Inc (NASDAQ:AMZN) canvassed its suppliers to offer low, double-digit discounts on homeware to consumer electronics as U.S. President Donald Trump’s tariffs kicked in.\nThe Trump administration imposed tariffs of up to 145% on China, prompting Amazon…",
    "link": "https://biztoc.com/x/0260461a5d23e5d6",
    "timestamp": "2025-04-29T21:26:06Z"
  },
  {
    "title": "Donald Trump's Approval Rating With Republican College Students Plummets",
    "description": "Thirty percent of College Republicans say they now support Trump less than in January, a Newsweek/CollegePulse poll found.",
    "link": "https://biztoc.com/x/342a43b715a9cd38",
    "timestamp": "2025-04-29T21:25:59Z"
  },
  {
    "title": "Right-wing 'LeBron James of lawyers' steps up to defend judge arrested by Trump's FBI",
    "description": "A Milwaukee judge arrested by President Donald Trump's FBI has drawn a dream team of conservative lawyers for her defense.Steven Biskupic, former U.S. attorney in the Eastern District of Wisconsin, will lead the defense team in the federal obstruction case ag…",
    "link": "https://www.rawstory.com/judge-hannah-dugan-defense/",
    "timestamp": "2025-04-29T21:25:44Z"
  },
  {
    "title": "Pritzker’s protest call could ‘incite violence,’ Trump aide says",
    "description": "A White House aide has accused Gov. J.B. Pritzker of 'inciting violence' after remarks he made during a speech in New Hampshire.",
    "link": "https://www.nbcchicago.com/news/local/chicago-politics/trump-aide-pritzkers-call-for-protests-could-be-seen-as-inciting-violence/3733550/",
    "timestamp": "2025-04-29T21:25:41Z"
  },
  {
    "title": "US Threatens To Quit Russia-Ukraine Effort Unless \"Concrete Proposals\"",
    "description": "Secretary of State Marco Rubio warned Tuesday that the United States would end mediation unless Russia and Ukraine come up with &quot;concrete proposals,&quot; as US patience wanes on an early priority for President Donald Trump.",
    "link": "https://www.ndtv.com/world-news/us-threatens-to-quit-russia-ukraine-effort-unless-concrete-proposals-8290527",
    "timestamp": "2025-04-29T21:25:02Z"
  },
  {
    "title": "Tainted love",
    "description": "Here’s Michigan governor Gretchen Whitmer, who is (was?) on the short list of likely Democratic presidential nominees in 2028, receiving a warm and loving embrace from Donald Trump upon Trump’s arrival in Michigan today. This is so nonsensical it’s hard to kn…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/tainted-love",
    "timestamp": "2025-04-29T21:23:58Z"
  },
  {
    "title": "These are the biggest 'anti-environment' policies enacted in Trump's 1st 100 days",
    "description": "President Donald Trump has enacted a sweeping number of policies that could harm the environment and hamper goals for greenhouse gas reductions, some experts say.",
    "link": "https://abcnews.go.com/US/biggest-anti-environment-policies-enacted-trumps-1st-100/story?id=121125789",
    "timestamp": "2025-04-29T21:23:35Z"
  },
  {
    "title": "Trump needs to pick his legal battles wisely to beat activist Dems",
    "description": "The first 100 days of the Trump administration have been described in the same way on sites ranging from the ACLU to Vanity Fair: Chaos.",
    "link": "https://nypost.com/2025/04/29/opinion/trump-needs-to-pick-his-legal-battles-wisely-to-beat-activist-dems/",
    "timestamp": "2025-04-29T21:22:19Z"
  },
  {
    "title": "Trump Official Tells Fox News to Fire Its Pollster Live on Air",
    "description": "\"We don't acknowledge any of that polling,\" Stephen Miller told anchor John Roberts when he was grilled about Trump's low ratings.",
    "link": "https://www.newsweek.com/stephen-miller-fox-news-pollster-interview-live-2065860",
    "timestamp": "2025-04-29T21:22:15Z"
  },
  {
    "title": "Giants say President Donald Trump never talked to team about letting Saquon Barkley walk in free agency",
    "description": "NEW YORK — The Giants went 3-14 and still found their way to the White House with the Super Bowl champion Eagles on Monday. President Donald Trump claimed during the Eagles’ visit — which did not include quarterback and Super Bowl MVP Jalen Hurts — that he to…",
    "link": "https://www.nydailynews.com/2025/04/29/giants-say-president-donald-trump-never-talked-to-team-about-letting-saquon-barkley-walk-in-free-agency/",
    "timestamp": "2025-04-29T21:22:00Z"
  },
  {
    "title": "Hegseth says he's undoing 'social justice/Biden initiative' that Trump signed into law",
    "description": "Defense Secretary Pete Hegseth announced that he had \"proudly ended\" the Women, Peace and Security program at the Pentagon on Tuesday, a program signed into law by President Donald Trump in his first term. \"WPS is yet another woke divisive/social justice/Bide…",
    "link": "https://freerepublic.com/focus/f-news/4314055/posts",
    "timestamp": "2025-04-29T21:21:45Z"
  },
  {
    "title": "Trump eases auto tariffs burden as Lutnick touts one done foreign trade deal",
    "description": "WASHINGTON: US President Donald Trump signed an order to soften the blow of his auto tariffs on Tuesday (Apr 29) with a mix of credits and relief from other levies on materials, and his trade team touted its first deal with a foreign trading partner, developm…",
    "link": "https://www.channelnewsasia.com/business/trump-eases-auto-tariffs-burden-lutnick-touts-one-done-foreign-trade-deal-5098286",
    "timestamp": "2025-04-29T21:20:00Z"
  },
  {
    "title": "'They don't understand!' Trump adviser says president was right to bully Amazon",
    "description": "President Donald Trump's economic adviser Kevin Hassett staunchly defended Trump's threats against Amazon on CNN on Tuesday, asserting he was right to force the company to back down from its reported plans to disclose tariff costs in purchases by consumers.\"I…",
    "link": "https://www.rawstory.com/hassett-kevin/",
    "timestamp": "2025-04-29T21:19:00Z"
  },
  {
    "title": "S&P/TSX composite index closes higher, along with U.S. stock markets",
    "description": "TORONTO — Canada’s main stock index closed up along with U.S. markets Tuesday as investors saw reason for optimism on the trade front. The S&P/TSX composite index was trading down earlier in the day and U.S. markets were mixed, but that shifted as U.S. Commer…",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-index-closes-higher-along-with-u-s-stock-markets",
    "timestamp": "2025-04-29T21:18:25Z"
  },
  {
    "title": "Will Trump Be Impeached a Third Time?",
    "description": "Thanks to his wild abuses of power and unconstitutional power grabs, Trump may be impeached a third time if Democrats flip the House in the 2026 midterms, as Jon Ossoff suggests. But he would likely be acquitted by the Senate a third time.",
    "link": "http://nymag.com/intelligencer/article/will-trump-be-impeached-a-third-time.html",
    "timestamp": "2025-04-29T21:18:06Z"
  },
  {
    "title": "Trump’s envoy sought to convince Putin on terms of ceasefire deal – Bloomberg",
    "description": "Steve Witkoff met the Russian president last week in the latest round of diplomacy on the Ukraine conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616518-putin-witkoff-ukraine-ceasefire/",
    "timestamp": "2025-04-29T21:17:25Z"
  },
  {
    "title": "Jon Stewart rocks Asbury Park after Trump takedown, Daily Show",
    "description": "Jon Stewart's band, Church and State TM, played Georgies Bar in Asbury Park on April 28.",
    "link": "https://www.app.com/story/entertainment/music/2025/04/29/jon-stewart-asbury-park-donald-trump-daily-show/83351988007/",
    "timestamp": "2025-04-29T21:16:53Z"
  },
  {
    "title": "House GOP wants to pump billions into Trump's deportations and detentions as part of tax bill",
    "description": "Republicans in Congress are working to pump billions of dollars into President Donald Trump’s mass deportation and border security program.",
    "link": "https://www.news4jax.com/news/politics/2025/04/29/house-gop-wants-to-pump-billions-into-trumps-deportations-and-detentions-as-part-of-tax-bill/",
    "timestamp": "2025-04-29T21:16:52Z"
  },
  {
    "title": "Donald Trump's Approval Rating With Republican College Students Plummets",
    "description": "Thirty percent of College Republicans say they now support Trump less than in January, a Newsweek/CollegePulse poll found.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-college-students-plummets-2065728",
    "timestamp": "2025-04-29T21:15:08Z"
  },
  {
    "title": "What Time Is Trump on TV Tonight? How To Watch ‘President Trump The First 100 Days’",
    "description": "The primetime special comes just as President Trump received the lowest 100-day approval rating of any president in the last 80 years",
    "link": "https://decider.com/2025/04/29/president-trump-first-100-days-abc-hulu/",
    "timestamp": "2025-04-29T21:15:00Z"
  },
  {
    "title": "Trump Leaves Washington for 100 Days Rally in Michigan",
    "description": "President Donald Trump is holding a rally in Michigan on Tuesday to mark the first 100 days of his second term, staging his largest political event since returning to the White House in a state that has been especially rocked by his steep trade tariffs and co…",
    "link": "https://biztoc.com/x/c1c5aa69e96a3288",
    "timestamp": "2025-04-29T21:14:58Z"
  },
  {
    "title": "First Accuser Takes The Witness Stand At Harvey Weinstein’s #MeToo Retrial",
    "description": "The first of three women expected to testify at Harvey Weinstein’s rape retrial told jurors she refused Weinstein's advances when they met to discuss potential jobs.",
    "link": "https://www.huffpost.com/entry/ap-us-sexual-misconduct-weinstein_n_68113d07e4b00bb8ae4b9a48",
    "timestamp": "2025-04-29T21:14:12Z"
  },
  {
    "title": "The pointy end: Inflation data, renters and One Nation’s chances",
    "description": "New RBA inflation data will be one of the last big bits of news before Australia votes on Saturday, and One Nation's chances are getting a lot of last-minute attention.\nThe post The pointy end: Inflation data, renters and One Nation’s chances appeared first o…",
    "link": "http://www.crikey.com.au/2025/04/30/2025-federal-election-inflation-renters-one-nation/",
    "timestamp": "2025-04-29T21:14:11Z"
  },
  {
    "title": "John Bolton Tells CNN Pete Hegseth Should ‘Resign For His Own Safety’s Sake’",
    "description": "John Bolton has long faced threats from foreign countries, including a recent plot against him by Iran.\nThe post John Bolton Tells CNN Pete Hegseth Should ‘Resign For His Own Safety’s Sake’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/john-bolton-tells-cnn-pete-hegseth-should-resign-for-his-own-safetys-sake/",
    "timestamp": "2025-04-29T21:14:09Z"
  },
  {
    "title": "Trump Catches Whitmer off Guard Again by Inviting Her on Stage: ‘I Hadn’t Planned to Speak’",
    "description": "President Donald Trump once again caught Michigan Governor Gretchen Whitmer off guard at an event – this time by inviting her to speak on stage.\nThe post Trump Catches Whitmer off Guard Again by Inviting Her on Stage: ‘I Hadn’t Planned to Speak’ first appeare…",
    "link": "https://www.mediaite.com/tv/trump-catches-whitmer-off-guard-again-by-inviting-her-on-stage-i-hadnt-planned-to-speak/",
    "timestamp": "2025-04-29T21:12:46Z"
  },
  {
    "title": "House GOP wants to pump billions into Trump’s deportations and detentions as part of tax bill",
    "description": "The U.S. under the legislation would impose a $1,000 fee on migrants seeking asylum — something the nation has never done.",
    "link": "https://www.bostonherald.com/2025/04/29/house-gop-tax-bill/",
    "timestamp": "2025-04-29T21:12:40Z"
  },
  {
    "title": "No Talk, but Some Action on U.S.-China Tariffs",
    "description": "Beijing refutes Trump’s claims about ongoing trade negotiations between the two countries.",
    "link": "http://foreignpolicy.com/2025/04/29/china-tariff-trade-economy-trump-united-states-negotiations/",
    "timestamp": "2025-04-29T21:11:33Z"
  },
  {
    "title": "AmeriCorps cuts prompt Colorado and other Democratic-led states to sue Trump administration",
    "description": "In Colorado, Gov. Jared Polis said in a statement, AmeriCorps members help support wildfire mitigation, students in schools and expanded mental health access.",
    "link": "https://www.denverpost.com/2025/04/29/americorps-cuts-colorado-lawsuit-trump/",
    "timestamp": "2025-04-29T21:11:24Z"
  },
  {
    "title": "Think Trump’s Unpopular Now? Just Wait.",
    "description": "Just over a month ago, President Donald Trump was more popular than he was at any point in his first term. This was especially troubling because his administration was proving to be even more incompetent, corrupt, and authoritarian this time around. He was bu…",
    "link": "https://newrepublic.com/article/194577/trump-unpopular-100-days-approval-ratings-falling",
    "timestamp": "2025-04-29T21:09:37Z"
  },
  {
    "title": "Bitcoin Mixer Founders May Get Reprieve as DOJ Weighs Dropping Case",
    "description": "Will U.S. authorities continue pressing ahead with the controversial coin mixing case?",
    "link": "https://decrypt.co/316925/bitcoin-mixer-founders-may-get-reprieve-as-doj-weighs-dropping-case",
    "timestamp": "2025-04-29T21:08:33Z"
  },
  {
    "title": "Former White House Photographer Pete Souza Says Trump Photostream a ‘Reality TV Show’",
    "description": "Pete Souza, former Chief Official White House Photographer for Presidents Ronald Reagan and Barack Obama, describes President Trump's presidential photo stream as \"an Oval Office reality show\" in a new article on Vanity Fair.\n[Read More]",
    "link": "https://petapixel.com/2025/04/29/former-white-house-photographer-pete-souza-says-trump-photostream-a-reality-tv-show/",
    "timestamp": "2025-04-29T21:08:04Z"
  },
  {
    "title": "We’re about to glimpse the future of all conservative parties",
    "description": "The upcoming Australian election will illustrate how most Western elections will play out in the near future Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616499-conservative-parties-future-australia/",
    "timestamp": "2025-04-29T21:07:55Z"
  },
  {
    "title": "Russia and US were on brink of WWIII – Oliver Stone",
    "description": "Russia and the US came close to nuclear war during the three years of the Ukraine conflict, Oliver Stone has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616519-brink-wwiii-oliver-stone/",
    "timestamp": "2025-04-29T21:07:50Z"
  },
  {
    "title": "WATCH: Piers Morgan tells Dem candidate he’d take her ‘a lot more seriously’ if she acknowledged recent Trump success",
    "description": "'No one can even bring it upon themselves to give him credit for an obvious win for America'",
    "link": "https://www.wnd.com/2025/04/watch-piers-morgan-tells-dem-candidate-hed-take-her-a-lot-more-seriously-if-she-acknowledged-recent-trump-success/",
    "timestamp": "2025-04-29T21:07:27Z"
  },
  {
    "title": "Trump Hands Gretchen Whitmer Rare Praise Amid Military Announcement",
    "description": "Trump delivered the news at Selfridge Air National Guard Base, just after landing for a rally celebrating his 100th day in office.",
    "link": "https://www.newsweek.com/trump-hands-gretchen-whitmer-rare-praise-amid-military-announcement-2065869",
    "timestamp": "2025-04-29T21:07:17Z"
  },
  {
    "title": "Elizabeth Warren Marks 100 Days Of Trump By Reading Aloud 100 Reports Of His Corruption",
    "description": "The Massachusetts senator plans to read into the congressional record dozens of cases of Trump using the presidency to benefit himself personally.",
    "link": "https://www.huffpost.com/entry/elizabeth-warren-donald-trump-100-days-corrupt_n_68111f2be4b0cbf3b6c1ddaa",
    "timestamp": "2025-04-29T21:06:57Z"
  },
  {
    "title": "Tribes and environmental groups brace as Trump officials consider scaling back Chuckwalla Monument",
    "description": "The Trump administration is reportedly looking at changing the boundaries of the Southern California monument and others to open up land for mining and oil production.",
    "link": "https://www.kpbs.org/news/environment/2025/04/29/tribes-and-environmental-groups-brace-as-trump-officials-consider-scaling-back-chuckwalla-monument",
    "timestamp": "2025-04-29T21:06:31Z"
  },
  {
    "title": "100 Days, 200 Lawsuits: Donald Trump Completes Turbulent 3 Months In Office",
    "description": "Donald Trump said on Tuesday that he has had &quot;a lot of fun&quot; in his first hundred days in office during his second term as President. However, much of his agenda in these three months have met considerable resistance in court from federal judges.",
    "link": "https://www.ndtv.com/world-news/100-days-200-lawsuits-donald-trump-completes-turbulent-3-months-in-office-8290466",
    "timestamp": "2025-04-29T21:05:27Z"
  },
  {
    "title": "Tariffs Win as Walmart Announces Major Investment in American Products and Small Businesses",
    "description": "PULSE POINTS:❓What Happened: Walmart has announced new programs, including “Grow with US” and the 2025 Open Call, to expand support for American-made products and American small businesses, as President Donald J. Trump pursues a policy of supporting American …",
    "link": "https://freerepublic.com/focus/f-news/4314051/posts",
    "timestamp": "2025-04-29T21:04:55Z"
  },
  {
    "title": "Trump Is Repeating Biden's AI Mistakes",
    "description": "President Donald Trump pledged to remove \"barriers to American leadership in artificial intelligence\" in a January executive order by reversing the Biden administration's precautionary approach to AI. Despite this order, the Trump administration is repeating …",
    "link": "https://biztoc.com/x/6e233a06ebd40e50",
    "timestamp": "2025-04-29T21:03:56Z"
  },
  {
    "title": "‘Tearing down’: What drives Trump’s foreign policy?",
    "description": "Motivated by grievances against allies and foes, US president is 'tearing down' the modern global order, analysts say.",
    "link": "https://www.aljazeera.com/news/2025/4/29/tearing-down-what-drives-trumps-foreign-policy",
    "timestamp": "2025-04-29T21:03:53Z"
  },
  {
    "title": "Take It Down Act, addressing nonconsensual deepfakes and ‘revenge porn,’ passes. What is it?",
    "description": "Congress approved legislation to enact stricter penalties for distribution of non-consensual intimate imagery.",
    "link": "https://www.bostonherald.com/2025/04/29/take-it-down-act-deepfakes-revenge-porn/",
    "timestamp": "2025-04-29T21:03:43Z"
  },
  {
    "title": "Report: State Department Revokes 4K Foreign Students’ Visas in First 100 Days of Trump’s Second Term, Most with Criminal Records",
    "description": "In the first 100 days of President Donald Trump's second term, the State Department revoked the visas of 4,000 foreign students, 90 percent of whom have criminal records.\nThe post Report: State Department Revokes 4K Foreign Students’ Visas in First 100 Days o…",
    "link": "https://www.breitbart.com/pre-viral/2025/04/29/report-state-department-revokes-4k-foreign-students-visas-in-first-100-days-of-trumps-second-term-most-with-criminal-records/",
    "timestamp": "2025-04-29T21:02:58Z"
  },
  {
    "title": "Former Social Security head calls out Trump's 'big lies' about fraud, waste and abuse",
    "description": "Former Social Security Commissioner Martin O’Malley is touring the country to push back against what he calls the Trump administration’s “big lies” and misinformation undermining the earned benefits program.",
    "link": "https://www.msnbc.com/top-stories/latest/martin-omalley-musk-social-security-trump-newsletter-rcna203567",
    "timestamp": "2025-04-29T21:01:28Z"
  },
  {
    "title": "Prime Minister Carney speaks with President of the United States Donald J. Trump (Prime Minister of Canada)",
    "description": "Prime Minister of Canada:\nPrime Minister Carney speaks with President of the United States Donald J. Trump  — Prime Minister Carney speaks with President of the United States Donald J. Trump  —  Today, the Prime Minister, Mark Carney, spoke with the President…",
    "link": "https://www.memeorandum.com/250429/p119",
    "timestamp": "2025-04-29T21:00:31Z"
  },
  {
    "title": "Save the Dates: Wild Cards Finale Delayed, Las Culturistas Culture Awards on Bravo and More",
    "description": "Wild Cards is shifting its Season 2 finale. The episode, which was originally slated for this week, will now air next Wednesday, May 7 at 8/7c on The CW. As a result, Sullivan’s Crossing Season 3 will now premiere Wednesday, May 14 at 8 pm. In lieu of Wild Ca…",
    "link": "https://tvline.com/news/wild-cards-season-2-finale-air-date-delayed-the-cw-1235441100/",
    "timestamp": "2025-04-29T21:00:19Z"
  },
  {
    "title": "The Trump administration’s push to privatize US public lands",
    "description": "In its first 100 days, Trump 2.0 has waged war on the lands, waters, and wildlife we all own.",
    "link": "http://grist.org/climate/the-trump-administrations-push-to-privatize-us-public-lands/",
    "timestamp": "2025-04-29T21:00:15Z"
  },
  {
    "title": "Vitol Steps Up Venezuela Oil Buying Before USA License Lapses",
    "description": "Vitol is set to load at least 2.5 million barrels of Venezuelan oil this month, according to documents seen by Bloomberg.",
    "link": "https://www.rigzone.com/news/wire/vitol_steps_up_venezuela_oil_buying_before_usa_license_lapses-29-apr-2025-180376-article/",
    "timestamp": "2025-04-29T21:00:01Z"
  },
  {
    "title": "Trump's Kennedy Center Canceling Pride Events Has Left LGBTQQIAAP2S+ Groups in Mourning",
    "description": "A series of gay pride concerts and stage events have been canceled at the John F. Kennedy Center for the Performing Arts in Washington D.C.\nThe post Trump’s Kennedy Center Canceling Pride Events Has Left LGBTQQIAAP2S+ Groups in Mourning appeared first on Brei…",
    "link": "https://www.breitbart.com/entertainment/2025/04/29/trumps-kennedy-center-canceling-pride-events-has-left-lgbtqqiaap2s-groups-in-mourning/",
    "timestamp": "2025-04-29T21:00:00Z"
  },
  {
    "title": "Inside Economics: Why the Kiwi is so strong against the Aussie dollar, the big Budget squeeze ... and asset recycling",
    "description": "OPINION: Liam Dann takes a deep dive into the week's economic news.",
    "link": "https://www.nzherald.co.nz/business/economy/inside-economics-why-the-kiwi-is-so-strong-against-the-aussie-dollar-the-big-budget-squeezeand-asset-recycling/BVICMPUV75CWNA6LZXAS7RJ3XI/",
    "timestamp": "2025-04-29T21:00:00Z"
  },
  {
    "title": "Trump’s stunning first 100 days: The highs, the lows and the road ahead",
    "description": "When Donald Trump headed back to the White House on Jan. 20, most folks knew him fairly well.",
    "link": "https://nypost.com/2025/04/29/opinion/trumps-stunning-first-100-days-the-highs-the-lows-and-the-road-ahead/",
    "timestamp": "2025-04-29T20:57:51Z"
  },
  {
    "title": "Trump announces new 'serious power' fighter jets for Michigan Guard base to replace aging A-10s",
    "description": "Trump shared details of the new fighter jet mission during a speech to National Guardsmen at the Michigan base for an event commemorating his 100th day in office.",
    "link": "https://www.foxnews.com/politics/trump-announces-new-serious-power-fighter-jets-michigan-guard-base-replace-aging-a-10s",
    "timestamp": "2025-04-29T20:57:40Z"
  },
  {
    "title": "Harvard antisemitism and Islamophobia task forces find widespread fear, bigotry",
    "description": "The reports were the result of two task forces set up in January 2024, once on combating antisemitism and anti-Israel bias, and other on combating anti-Arab bias.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-852030",
    "timestamp": "2025-04-29T20:57:24Z"
  },
  {
    "title": "Justice Department Introduces “America First Antitrust” Policy",
    "description": "New Justice Department Antitrust Chief introduces \"America First Antitrust Policy,\" featuring (1) individual liberty, (2) the rule of law, and (3) regulatory reform.",
    "link": "https://www.forbes.com/sites/aldenabbott/2025/04/29/justice-department-introduces-america-first-antitrust-policy/",
    "timestamp": "2025-04-29T20:56:38Z"
  },
  {
    "title": "House GOP wants to pump billions into Trump's deportations and detentions as part of tax bill",
    "description": "As part of their big tax bill, Republicans in Congress are pumping billions of dollars into President Donald Trump's mass deportation and border security...",
    "link": "https://www.yahoo.com/news/house-gop-wants-pump-billions-205615197.html",
    "timestamp": "2025-04-29T20:56:15Z"
  },
  {
    "title": "Gov. Hochul says NY budget will create $50M rental aid program championed by tenant groups",
    "description": "Gov. Kathy Hochul announces the budget on April 28.\n \n\nTenant activists and landlords alike had pushed for the program for years. Hochul ultimately agreed to about a fifth of the funding its legislative sponsors originally sought [ more › ]",
    "link": "https://gothamist.com/news/gov-hochul-says-ny-budget-will-create-50m-rental-aid-program-championed-by-tenant-groups",
    "timestamp": "2025-04-29T20:56:00Z"
  },
  {
    "title": "Mark Carney won: Here are the key economic priorities for his new government",
    "description": "In the face of U.S. tariffs, the new Canadian government should take prudent, urgent and bold steps to strengthen the nation’s economy.",
    "link": "https://theconversation.com/mark-carney-won-here-are-the-key-economic-priorities-for-his-new-government-255477",
    "timestamp": "2025-04-29T20:55:50Z"
  },
  {
    "title": "Trump Is Repeating Biden's AI Mistakes",
    "description": "President Donald Trump pledged to remove \"barriers to American leadership in artificial intelligence\" in a January executive order by reversing the Biden",
    "link": "https://reason.com/2025/04/29/trump-is-repeating-bidens-ai-mistakes/",
    "timestamp": "2025-04-29T20:55:07Z"
  },
  {
    "title": "A 'p*ssed' Trump called Jeff Bezos after learning Amazon considered breaking out a tariff charge (CNN)",
    "description": "CNN:\nA ‘p*ssed’ Trump called Jeff Bezos after learning Amazon considered breaking out a tariff charge  —  New York CNN —  The White House took aggressive aim at Amazon, with President Donald Trump putting in a call to Amazon founder Jeff Bezos Tuesday morning…",
    "link": "https://www.memeorandum.com/250429/p118",
    "timestamp": "2025-04-29T20:55:00Z"
  },
  {
    "title": "Arizona legislature pushes for a state bitcoin reserve",
    "description": "The Arizona state legislature approved a pair of bills on Monday that could pave the way for the creation of the country’s first-ever state Bitcoin reserve.",
    "link": "https://www.nbcnews.com/politics/economics/arizona-legislature-pushes-state-bitcoin-reserve-rcna203612",
    "timestamp": "2025-04-29T20:53:43Z"
  },
  {
    "title": "Major brands pulling back from LGBTQ parades – WSJ",
    "description": "Companies have reportedly scaled down NYC Pride sponsorships over political pressure and economic concerns Read Full Article at RT.com",
    "link": "https://www.rt.com/business/616517-lgbtq-companies-cut-sponsorship/",
    "timestamp": "2025-04-29T20:53:37Z"
  },
  {
    "title": "Trump Applauds Bezos After Amazon Refutes Claim It Planned To Display Tariff Costs",
    "description": "Topline\nThe White House took aim at Amazon on Tuesday after the e-commerce giant reportedly prepared to directly display to consumers the price increases associated with President Donald Trump’s tariffs—with Trump calling Amazon founder Jeff Bezos personally …",
    "link": "https://biztoc.com/x/604100d3f6fbbd7a",
    "timestamp": "2025-04-29T20:53:15Z"
  },
  {
    "title": "Trump: Selfridge to play 'vital' role in US defense",
    "description": "United States President Donald Trump underlined on Tuesday that Selfridge will play a \"vital role\" in the country's national defense.\"I am proud to announce that very soon we will replace the retiring...",
    "link": "https://biztoc.com/x/783b56c099f49923",
    "timestamp": "2025-04-29T20:53:01Z"
  },
  {
    "title": "Trump Org to build golf course in Qatar as White House announces official visit to region",
    "description": "Qatari developers Qatari Diar and Dar Global are expected to announce the building of a Trump International Golf Course and Trump Villas in the country, according to a Reuters report\r\n.The move comes as the White House announced President Donald Trump will ma…",
    "link": "https://www.rawstory.com/2671864439/",
    "timestamp": "2025-04-29T20:52:56Z"
  },
  {
    "title": "Trump dismisses Biden nominees to US Holocaust Memorial Council, including Doug Emhoff",
    "description": "Trump has moved to fire many Biden appointees across government — including ostensibly apolitical roles.",
    "link": "https://www.bostonherald.com/2025/04/29/trump-holocaust-museum-board/",
    "timestamp": "2025-04-29T20:52:48Z"
  },
  {
    "title": "House Democratic Leader Hakeem Jeffries Questions Whether Trump is Cognitively ‘Fit’ to Be President",
    "description": "House Minority Leader Hakeem Jeffries believes President Donald Trump's mental fitness should be under the same scrutiny as former President Joe Biden's was.\nThe post House Democratic Leader Hakeem Jeffries Questions Whether Trump is Cognitively ‘Fit’ to Be P…",
    "link": "https://www.mediaite.com/podcasts/house-democratic-leader-hakeem-jeffries-questions-whether-trump-is-cognitively-fit-to-be-president/",
    "timestamp": "2025-04-29T20:52:14Z"
  },
  {
    "title": "Trump Announces New Boeing F-15EX Unit and KC-46 Squadron for Selfridge ANGB",
    "description": "“Very soon we will replace the A-10 with 21 new F-15EX Eagle II fighter jets, the best in world,” President Trump announced during visit to Selfridge ANGB in Michigan. U.S. President Donald Trump has announced that Selfridge Air National Guard Base in Mt. Cle…",
    "link": "https://theaviationist.com/2025/04/29/selfridge-angb-to-get-new-f-15ex-unit/",
    "timestamp": "2025-04-29T20:52:06Z"
  }
]