[
  {
    "title": "The left-wing revolt Karen Bass never saw coming",
    "description": "The filing deadline for Los Angeles mayor closed at noon last Saturday. And this race looks nothing like the cakewalk Karen Bass expected. Billionaire developer Rick Caruso passed on a rematch. LA County Supervisor Lindsey Horvath decided not to jump in. Form…",
    "link": "https://nypost.com/2026/02/09/opinion/the-revolt-karen-bass-never-saw-coming/",
    "timestamp": "2026-02-09T23:06:14Z"
  },
  {
    "title": "Bad Bunny may have trounced Kid Rock in Super Bowl halftime showdown if historic trends hold",
    "description": "A day after the Seattle Seahawks became Super Bowl champions, speculation about the halftime music showdown is making news",
    "link": "https://abcnews.go.com/Entertainment/wireStory/bad-bunny-trounced-kid-rock-super-bowl-halftime-130008281",
    "timestamp": "2026-02-09T23:01:51Z"
  },
  {
    "title": "Why the NFL doesn't care about Bad Bunny MAGA backlash",
    "description": "The NFL has strongly backed Bad Bunny's Super Bowl halftime show despite a conservative campaign to turn the event into a culture war.",
    "link": "https://www.washingtonexaminer.com/news/entertainment/4451648/why-nfl-does-not-care-bad-bunny-maga-backlash/",
    "timestamp": "2026-02-09T22:55:46Z"
  },
  {
    "title": "Labor lawyers told to ‘stop engaging’ with American Bar Association in official capacities",
    "description": "Lawyers' group moving more and more to leftist ideologies",
    "link": "https://www.wnd.com/2026/02/labor-lawyers-told-stop-engaging-american-bar-association/",
    "timestamp": "2026-02-09T22:55:38Z"
  },
  {
    "title": "Catholic leaders express sorrow over racist Trump post; bishops demand apology",
    "description": "U.S. Catholic Bishops Garcia and Weisenburger, with Cardinal Cupich, condemned President Trump's social media post. Trump denied it was intentional and refused to apologize.",
    "link": "https://www.ewtnnews.com/world/us/catholic-bishops-slam-racist-post-by-trump",
    "timestamp": "2026-02-09T22:55:09Z"
  },
  {
    "title": "Pete Hegseth’s Attack on Harvard",
    "description": "The anger at the Ivy League is about status envy, not war-fighting.",
    "link": "https://www.theatlantic.com/ideas/2026/02/pete-hegseth-attack-on-harvard/685945/",
    "timestamp": "2026-02-09T22:54:43Z"
  },
  {
    "title": "Texas Democrat Who Said Non-Whites Should ‘Take Over This Country’ Facing Widespread Backlash",
    "description": "Democratic State Rep. Gene Wu of Texas came under fire after racially-charged comments he made in a December 2024 podcast resurfaced on social media.",
    "link": "https://dailycaller.com/2026/02/09/texas-democrat-who-said-non-whites-should-take-over-this-country-facing-widespread-backlash/",
    "timestamp": "2026-02-09T22:53:36Z"
  },
  {
    "title": "Chloe Kim Speaks Out After Donald Trump Bashes Fellow Olympian Hunter Hess",
    "description": "Chloe Kim is sticking up for her fellow U.S. Olympian Hunter Hess. While in Italy for the 2026 Winter Olympics, the 27-year-old freestyle skier addressed what is politically going on in America. “It brings up mixed emotions to represent the U.S. right now,” H…",
    "link": "https://www.justjared.com/2026/02/09/chloe-kim-speaks-out-after-donald-trump-bashes-fellow-olympian-hunter-hess/",
    "timestamp": "2026-02-09T22:50:18Z"
  },
  {
    "title": "Gabbard’s office warns attorney against sharing classified complaint with Congress",
    "description": "An anonymous employee alleged that Gabbard withheld classified material for political purposes.",
    "link": "https://www.bostonherald.com/2026/02/09/gabbard-complaint-what-to-know/",
    "timestamp": "2026-02-09T22:49:33Z"
  },
  {
    "title": "Gabbard’s office warns attorney against sharing classified complaint with Congress",
    "description": "An anonymous employee alleged that Gabbard withheld classified material for political purposes.",
    "link": "https://www.denverpost.com/2026/02/09/gabbard-complaint-what-to-know/",
    "timestamp": "2026-02-09T22:49:33Z"
  },
  {
    "title": "Top Hamas Leader Rejects Trump’s Disarmament Demand, Vows No ‘Foreign Rule’ in Gaza",
    "description": "A senior Hamas leader declared that surrendering weapons would “criminalize the resistance” and vowed Gaza would never accept “foreign rule,” openly defying President Donald Trump’s 20-point peace framework as Phase Two of the U.S.-brokered plan moves toward …",
    "link": "https://freerepublic.com/focus/f-news/4366160/posts",
    "timestamp": "2026-02-09T22:49:01Z"
  },
  {
    "title": "Kid Rock Song From Turning Point USA Halftime Show Dethrones Bad Bunny As Top Hit On Sales Chart",
    "description": "Kid Rock's new Christian-themed song from Turning Point USA's Halftime Show beat Bad Bunny as the top hit on Apple's sales chart as of Monday.",
    "link": "https://dailycaller.com/2026/02/09/kid-rock-til-you-cant-turning-point-halftime-show-bad-bunny/",
    "timestamp": "2026-02-09T22:47:33Z"
  },
  {
    "title": "Trump mocked after Bad Bunny halftime show plays at his private Super Bowl party",
    "description": "Despite White House claims that President Donald Trump would “much prefer” an “All American” alternative halftime show headlined by Kid Rock, video circulating online shows Bad Bunny’s official Super Bowl LX performance playing on big screens at Trump’s priva…",
    "link": "https://www.rawstory.com/super-bowl-party/",
    "timestamp": "2026-02-09T22:45:02Z"
  },
  {
    "title": "Taylor Swift Slammed for Silence on ICE",
    "description": "Taylor Swift Slammed for Silence on ICEcafemom.com",
    "link": "https://cafemom.com/entertainment/taylor-swift-slammed-silence-ice-trump-admin",
    "timestamp": "2026-02-09T22:44:49Z"
  },
  {
    "title": "Top Hamas Leader Rejects Trump’s Disarmament Demand, Vows No ‘Foreign Rule’ in Gaza",
    "description": "A senior Hamas leader declared that surrendering weapons would “criminalize the resistance,” openly defying President Donald Trump’s 20-point peace framework.\nThe post Top Hamas Leader Rejects Trump’s Disarmament Demand, Vows No ‘Foreign Rule’ in Gaza appeare…",
    "link": "https://www.breitbart.com/politics/2026/02/09/top-hamas-leader-rejects-trumps-disarmament-demand-vows-no-foreign-rule-gaza/",
    "timestamp": "2026-02-09T22:42:24Z"
  },
  {
    "title": "WATCH: Megyn Kelly, Piers Morgan come to verbal blows over Bad Bunny’s Super Bowl performance",
    "description": "'We don't need a black national anthem, we don't need a Spanish speaking, non-English performing performer and we don't need an ICE or America-hater featured as our primetime entertainment'",
    "link": "https://www.wnd.com/2026/02/watch-megyn-kelly-piers-morgan-come-verbal-blows/",
    "timestamp": "2026-02-09T22:41:23Z"
  },
  {
    "title": "Read Trump’s Pitch Deck for Selling America’s Birthday",
    "description": "Freedom 250 is urging donors to repeat far-right Christian nationalist and anti-abortion talking points.\nThe post Read Trump’s Pitch Deck for Selling America’s Birthday appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/09/read-trumps-pitch-deck-selling-americas-birthday/",
    "timestamp": "2026-02-09T22:40:15Z"
  },
  {
    "title": "Bad Bunny effect: Duolingo saw a 35% increase in Spanish students after the Super Bowl show",
    "description": "Music influences each listener differently. An example of this was the halftime show by Benito Antonio Martínez Ocasio, known artistically as Bad Bunny, which had a record 135 mill",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/09/698a615046163fd9728b457f.html",
    "timestamp": "2026-02-09T22:38:30Z"
  },
  {
    "title": "Airlines will no longer be able to refuel on Cuba as U.S. blockade deepens island's energy crisis",
    "description": "Cuban aviation officials have warned airlines that there isn't enough fuel for airplanes to refuel on the island, the latest step in its moves to ration energy as the Trump administration cuts the Caribbean nation off from its fuel resources.",
    "link": "https://www.pbs.org/newshour/world/airlines-will-no-longer-be-able-to-refuel-on-cuba-as-u-s-blockade-deepens-islands-energy-crisis",
    "timestamp": "2026-02-09T22:35:55Z"
  },
  {
    "title": "Ghislaine Maxwell Pleads the Fifth, Will Spill Epstein Secrets If Trump Grants Her …",
    "description": "Reading Time: 3 minutesGhislaine Maxwell is willing to trade information for a pardon.\nGhislaine Maxwell Pleads the Fifth, Will Spill Epstein Secrets If Trump Grants Her … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2026/02/ghislaine-maxwell-pleads-the-fifth-will-spill-epstein-secrets-if-trump-grants-her-clemency-report/",
    "timestamp": "2026-02-09T22:34:03Z"
  },
  {
    "title": "Ray Dalio Warns Tucker Carlson Central Bank Digital Currencies Could Give Global Governments Total Control",
    "description": "Ray Dalio warned Tucker Carlson that he believed Central Bank Digital Currencies (CBDC) would be adopted and that there would be privacy issues.",
    "link": "https://dailycaller.com/2026/02/09/ray-dalio-warns-tucker-carlson-central-bank-digital-currencies-global-governments-total-control/",
    "timestamp": "2026-02-09T22:30:11Z"
  },
  {
    "title": "EXCLUSIVE: University Hit With New Complaint After Dean Confirms Hidden DEI Curriculum",
    "description": "Arizona State University is facing a second federal complaint after another faculty member admitted the school is secretly continuing its DEI march.",
    "link": "https://dailycaller.com/2026/02/09/exclusive-university-hit-with-new-complaint-after-dean-confirms-hidden-dei-curriculum/",
    "timestamp": "2026-02-09T22:26:44Z"
  },
  {
    "title": "Stephen Miller blames Biden for child sex trafficking case that occurred under Trump",
    "description": "White House adviser Stephen Miller suggested former President Joe Biden was to blame for a sex trafficking case that happened during President Donald Trump's second term.On Monday, Miller responded to a Daily Wire reporter's account of a teenager who crossed …",
    "link": "https://www.rawstory.com/stephen-miller-trump-trafficking/",
    "timestamp": "2026-02-09T22:26:39Z"
  },
  {
    "title": "Epstein Island Visitor Howard Lutnick Still Has His Job In Trump's Cabinet",
    "description": "Trump has attacked others for having visited Epstein’s notorious Caribbean island, but appears to be fine with his commerce secretary’s apparent trip there.",
    "link": "https://www.huffpost.com/entry/trump-lutnick-epstein_n_698a4664e4b0509b8127fe8f",
    "timestamp": "2026-02-09T22:23:03Z"
  },
  {
    "title": "Guthrie family at 'hour of desperation' in search for their missing mother",
    "description": "Savannah Guthrie's family is \"at an hour of desperation\" in the search for her missing mother, the Today show co-host said in a video released Monday ahead of a looming ransom deadline apparently set by Nancy Guthrie's abductors.",
    "link": "https://www.cbc.ca/news/world/nancy-guthrie-savannah-missing-mother-9.7081737",
    "timestamp": "2026-02-09T22:21:41Z"
  },
  {
    "title": "Republicans turn on MAGA-friendly CBS News boss for reporting on ICE backlash",
    "description": "Republicans turned on MAGA-friendly CBS News boss Bari Weiss after the network reported Monday on ICE arrests and what's happening within the agency, which was actually documented by the Trump administration's Department of Homeland Security.CBS reported how …",
    "link": "https://www.rawstory.com/republicans-maga-cbs/",
    "timestamp": "2026-02-09T22:21:20Z"
  },
  {
    "title": "Exxon Abruptly Drops Lawyers Who Were Named in Epstein Files",
    "description": "It seems even giant oil companies have more scruples than the Trump administration and their allies.Exxon swiftly dropped a couple of their longtime lawyers earlier this month after the attorneys’ names were revealed in the Epstein files, the sprawling invest…",
    "link": "https://newrepublic.com/post/206377/exxon-drops-lawyers-epstein-files",
    "timestamp": "2026-02-09T22:13:29Z"
  },
  {
    "title": "MAGA erupts after Epstein survivors release Super Bowl ad targeting Trump admin",
    "description": "Fans of President Donald Trump’s MAGA movement erupted in anger Sunday after survivors of Jeffrey Epstein’s crimes announced a Super Bowl–timed ad accusing the Trump administration of mishandling the Epstein files, including the release of victims’ personal i…",
    "link": "https://www.rawstory.com/maga-fans-2675233566/",
    "timestamp": "2026-02-09T22:10:03Z"
  },
  {
    "title": "Ford Defies Trump After Worker Heckled President (Josh Fiallo/The Daily Beast)",
    "description": "Josh Fiallo / The Daily Beast:\nFord Defies Trump After Worker Heckled President  —  YOU'RE... NOT FIRED!  —  The president told the factory worker he would be fired, but he did not even receive a negative mark on his record.  —  Ford has refused to fire the f…",
    "link": "https://www.memeorandum.com/260209/p75",
    "timestamp": "2026-02-09T22:10:01Z"
  },
  {
    "title": "US Boards Fleeing ‘Shadow Fleet’ Tanker Weeks After Maduro Raid",
    "description": "U.S. forces boarded a sanctioned oil tanker in the Indian Ocean after tracking the vessel for thousands of miles from the Caribbean Sea.",
    "link": "https://dailycaller.com/2026/02/09/us-boards-fleeing-shadow-fleet-tanker-weeks-after-maduro-raid/",
    "timestamp": "2026-02-09T22:09:27Z"
  },
  {
    "title": "Savannah Guthrie pleads ‘we will pay’ as search for her missing mother continues after a week",
    "description": "The \"Today\" show's 84-year-old mother was first reported missing last week.",
    "link": "https://fortune.com/2026/02/09/savannah-guthrie-case-mother-missing-we-will-pay/",
    "timestamp": "2026-02-09T22:08:50Z"
  },
  {
    "title": "Palestinian woman hospitalized following seizure in US ICE detention",
    "description": "By Kanishka SinghWASHINGTON, Feb 9 (Reuters) - A Palestinian woman, who lost dozens of family members in the Gaza war, has been hospitalized following a seizure in U.S. i… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/09/palestinian-woman-hospitalized-following-seizure-in-us-ice-detention",
    "timestamp": "2026-02-09T22:07:43Z"
  },
  {
    "title": "From grocery store bagger to a Super Bowl stage MAGA can’t silence: The meteoric rise of Bad Bunny",
    "description": "After making history at the Grammys, the Latin trap titan headlined the 2026 Super Bowl halftime show, Kevin E G Perry reports",
    "link": "https://www.the-independent.com/arts-entertainment/music/features/bad-bunny-super-bowl-grammys-b2917049.html",
    "timestamp": "2026-02-09T22:07:35Z"
  },
  {
    "title": "Bad Bunny's Super Bowl halftime show explored who gets to be American",
    "description": "Bad Bunny concluded his historic Super Bowl halftime performance with a few English-language words",
    "link": "https://www.wsbradio.com/entertainment/bad-bunnys-super/JHKVKLBWEY6NDDYZRFTPBXZKZM/",
    "timestamp": "2026-02-09T22:07:34Z"
  },
  {
    "title": "JUST IN: Dan Bongino Returning to Fox News Following Stint in Trump Admin",
    "description": "Dan Bongino is returning to Fox News following his stint as the deputy director of the FBI under President Donald Trump, The New York Times reported on Monday\nThe post JUST IN: Dan Bongino Returning to Fox News Following Stint in Trump Admin first appeared on…",
    "link": "https://www.mediaite.com/media/just-in-dan-bongino-returning-to-fox-news-following-stint-in-trump-admin/",
    "timestamp": "2026-02-09T22:06:19Z"
  },
  {
    "title": "Trump Begs People to Keep Liking Him as His Global Popularity Tanks",
    "description": "Donald Trump’s White House is urging Americans not to be “Panicans” as the president’s approval ratings continue to slip around the world. In an article published Monday titled “Don’t Be a Panican. We’re Winning—and We’re Not Slowing Down,” the White House be…",
    "link": "https://newrepublic.com/post/206374/donald-trump-begs-people-panican-global-popularity",
    "timestamp": "2026-02-09T22:05:20Z"
  },
  {
    "title": "Bakari Sellers Compares Trump Supporters To ‘Cancer,’ Calls For ‘Fumigation’ Of US",
    "description": "Former Democratic state Rep. Bakari Sellers of South Carolina said Friday that “a more aggressive approach” was needed to “remove” President Donald Trump and his supporters. Trump came under fire over a deleted video restating his claims about the 2020 electi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4366147/posts",
    "timestamp": "2026-02-09T22:03:58Z"
  },
  {
    "title": "Chinese Media Elevate Anti-American Comments by U.S. Athletes at Winter Olympics",
    "description": "China's Global Times state propaganda newspaper proclaimed that America was besieged by \"deep divisions\" in an article on the Winter Olympics.\nThe post Chinese Media Elevate Anti-American Comments by U.S. Athletes at Winter Olympics appeared first on Breitbar…",
    "link": "https://www.breitbart.com/sports/2026/02/09/chinese-media-elevate-anti-american-comments-u-s-athletes-winter-olympics/",
    "timestamp": "2026-02-09T22:03:28Z"
  },
  {
    "title": "MAGA World Throws Steve Bannon Under The Bus",
    "description": "High-profile right-wingers lashed out over Bannon's relationship with Jeffrey Epstein.",
    "link": "https://www.huffpost.com/entry/epstein-files-conservatives-blame-steve-bannon_n_698a08d8e4b09f934ad0ea9b",
    "timestamp": "2026-02-09T22:03:22Z"
  },
  {
    "title": "Redacted Epstein files undercut crucial Trump claim about relationship: lawmaker",
    "description": "One Democratic lawmaker in Congress made an eye-popping revelation about the Jeffrey Epstein files on Monday, one that appears to undercut a key claim from President Donald Trump. Rep. Jamie Raskin (D-MD) said in a gaggle with reporters on Monday that there a…",
    "link": "https://www.rawstory.com/jamie-raskin-2675238609/",
    "timestamp": "2026-02-09T22:02:48Z"
  },
  {
    "title": "Breitbart Business Digest: China's Dual Decoupling",
    "description": "Xi Jinping is betting that China can build domestic alternatives to American semiconductors and reduce its dollar exposure before either becomes a crisis.\nThe post Breitbart Business Digest: China’s Dual Decoupling appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2026/02/09/breitbart-business-digest-chinas-dual-decoupling/",
    "timestamp": "2026-02-09T22:02:17Z"
  },
  {
    "title": "Raskin Says Unredacted Epstein Files Reveal DOJ in “Cover-Up Mode”",
    "description": "After reviewing the Justice Department’s unredacted Epstein files on Monday, Democratic Representative Jamie Raskin is convinced that the Department of Justice is in “cover-up mode.”Members of Congress were allowed to view the unredacted versions of all DOJ f…",
    "link": "https://newrepublic.com/post/206371/raskin-unredacted-epstein-files-doj-cover-up-mode",
    "timestamp": "2026-02-09T22:01:15Z"
  },
  {
    "title": "Ossoff rallies Atlanta crowd, putting health care at the center of Democrats' 2026 fight",
    "description": "U.S. Sen. Jon Ossoff from Georgia energized Atlanta supporters, spotlighting health care as a defining issue for Democrats in the 2026 election cycle.",
    "link": "https://www.cbsnews.com/atlanta/news/ossoff-rallies-atlanta-crowd-puts-health-care-at-center-of-democrats-2026-fight/",
    "timestamp": "2026-02-09T22:00:36Z"
  },
  {
    "title": "A moment of truth for Democrats ahead of this week's DHS shutdown deadline: From the Politics Desk",
    "description": "The Department of Homeland Security is slated to run out of funding, and Democrats have issued a list of demands to keep the money flowing for ICE and CBP.",
    "link": "https://www.nbcnews.com/politics/politics-news/moment-truth-democrats-dhs-shutdown-deadline-politics-desk-rcna258260",
    "timestamp": "2026-02-09T22:00:00Z"
  },
  {
    "title": "Takaichi's big election win could mean more trouble with Beijing",
    "description": "Japanese Prime Minister Sanae Takaichi’s thumping election win has blunted domestic opposition to her hawkish security agenda, encouraging plans to press ahead with a defense expansion that China has condemned as a return to militarism. As the scale of her ‌g…",
    "link": "https://japantoday.com/category/politics/japan-pm%27s-big-election-win-could-mean-more-beef-with-beijing1",
    "timestamp": "2026-02-09T21:59:27Z"
  },
  {
    "title": "One Nation is eyeing off Victoria, and that's a headache for the opposition",
    "description": "The right-wing party's prized recruit, Barnaby Joyce, made a key appearance deep in National Party territory as the 2026 Victorian election campaign began to take shape, Richard Willingham writes.",
    "link": "https://www.abc.net.au/news/2026-02-10/barnaby-joyce-one-nation-eyeing-victorian-election-seats/106322072",
    "timestamp": "2026-02-09T21:58:32Z"
  },
  {
    "title": "Gaming Site Plagued By Satanic Pedophilia Cults Announces Overhaul Of Child Safety Policies",
    "description": "The messaging platform Discord announced new safety restrictions on Monday as it continually faces controversy over child sexual abuse and violent extremism.",
    "link": "https://dailycaller.com/2026/02/09/gaming-site-discord-satanic-pedophilia-cult-child-safety-764-nihilistic-violent-extremists-nve/",
    "timestamp": "2026-02-09T21:58:12Z"
  },
  {
    "title": "Savannah Guthrie makes new video plea as missing mother's ransom deadline nears",
    "description": "Savannah Guthrie said in a video released Monday that her family is “at an hour of desperation” is the search for the “Today” show host's missing mother, ahead of Monday evening's looming ransom deadline set by the purported abductors. She didn’t mention the …",
    "link": "https://japantoday.com/category/world/purported-nancy-guthrie-ransom-note-deadline-approaches-as-search-enters-a-second-week",
    "timestamp": "2026-02-09T21:57:06Z"
  },
  {
    "title": "Bar Complaint Filed Against Prosecutor Who Petitioned for Raid of Journalist's Home",
    "description": "Soon after the FBI raided Washington Post reporter Hannah Natanson's home in Virginia last month, the Freedom of the Press Foundation said it suspected that the Trump administration was either \"ignoring or distorting\" federal law when it allowed the search an…",
    "link": "https://www.commondreams.org/news/reporter-washington-post",
    "timestamp": "2026-02-09T21:56:58Z"
  },
  {
    "title": "Jimmy Lai's children look to Trump and other leaders to push China to free their father",
    "description": "The children of Jimmy Lai, a pro-democracy former Hong Kong media mogul and China critic, said Monday that a possible visit by President Donald Trump to Beijing in April could be “crucial” in securing the release of their 78-year-old father. Lai's son and dau…",
    "link": "https://japantoday.com/category/world/jimmy-lai%27s-children-look-to-trump-and-other-leaders-to-push-china-to-free-their-father",
    "timestamp": "2026-02-09T21:56:50Z"
  },
  {
    "title": "From kneeling to Spanish anthems: How the NFL lost Middle America at halftime",
    "description": "Super Bowl viewers rejected Bad Bunny's political halftime show, with up to 9 million watching Turning Point's alternative show featuring Kid Rock instead.",
    "link": "https://www.foxnews.com/opinion/kneeling-spanish-anthems-how-nfl-lost-middle-america-halftime",
    "timestamp": "2026-02-09T21:56:45Z"
  },
  {
    "title": "Cuba says airlines can no longer refuel on the island as U.S. blockade deepens energy crisis",
    "description": "Cuban aviation officials have warned airlines that there isn't enough fuel for airplanes to refuel on the island, the latest step in its moves to ration energy as the Trump administration cuts the Caribbean nation off from its fuel resources. The government o…",
    "link": "https://japantoday.com/category/world/cuba-says-airlines-can-no-longer-refuel-on-the-island-as-us-blockade-deepens-energy-crisis",
    "timestamp": "2026-02-09T21:56:39Z"
  },
  {
    "title": "Masks emerge as symbol of Trump's ICE crackdown and flashpoint in Congress",
    "description": "Beyond the car windows being smashed, people tackled on city streets — or even a little child with a floppy bunny ears snowcap detained — the images of masked federal officers has become a flashpoint in the Trump administration’s immigration enforcement opera…",
    "link": "https://japantoday.com/category/world/masks-emerge-as-symbol-of-trump%27s-ice-crackdown-and-a-flashpoint-in-congress",
    "timestamp": "2026-02-09T21:56:12Z"
  },
  {
    "title": "Iran steps up arrests while remaining positive on U.S. talks",
    "description": "Iran stepped up its crackdown on Monday after recent protests, making more arrests while holding the door open to Washington for further nuclear negotiations. The arrests -- including that of Javad Emam, the spokesperson for the main reformist coalition -- ca…",
    "link": "https://japantoday.com/category/world/iran-steps-up-arrests-while-remaining-positive-on-us-talks",
    "timestamp": "2026-02-09T21:55:34Z"
  },
  {
    "title": "Trump's tariffs cost American households $1,000 last year: Research group",
    "description": "Trump's tariffs cost American households $1,000 last year: Research groupgo.com",
    "link": "https://abcnews.go.com/Business/trumps-tariffs-cost-american-households-1000-year-research/story?id=130003484",
    "timestamp": "2026-02-09T21:55:26Z"
  },
  {
    "title": "Ghislaine Maxwell refuses to answer questions at congressional deposition",
    "description": "Jeffrey Epstein associate Ghislaine Maxwell refused to answer questions at a deposition before the U.S.  House's Committee on Oversight and Government Reform ‌on Monday, according to lawmakers, drawing criticism from both Republican and Democratic members of …",
    "link": "https://japantoday.com/category/world/ghislaine-maxwell-refuses-to-answer-questions-at-congressional-deposition-lawmakers-say1",
    "timestamp": "2026-02-09T21:55:15Z"
  },
  {
    "title": "International outrage grows over Israel's plans for West Bank",
    "description": "International outrage was growing on Monday at Israeli plans to tighten the country's grip over the occupied West Bank, with the United Nations chief saying he was &quot;gravely concerned&quot;. Earlier, Saudi Arabia and seven other Muslim-majority countries …",
    "link": "https://japantoday.com/category/world/international-outrage-grows-over-israel%27s-plans-for-west-bank",
    "timestamp": "2026-02-09T21:55:06Z"
  },
  {
    "title": "Trump's tariffs cost American households $1,000 last year: Research group",
    "description": "Trump's tariffs cost American households $1,000 last year: Research groupabcnews.com",
    "link": "https://abcnews.com/Business/trumps-tariffs-cost-american-households-1000-year-research/story?id=130003484",
    "timestamp": "2026-02-09T21:55:00Z"
  },
  {
    "title": "Trump's immigration crackdown straining federal courts; judges are raising the alarm",
    "description": "Federal judges around the country are scrambling to address a deluge of lawsuits from immigrants locked up under the Trump administration's mass deportation campaign. Under past administrations, people with no criminal record could generally request a bond he…",
    "link": "https://japantoday.com/category/world/trump%27s-immigration-crackdown-is-straining-federal-courts.-judges-are-raising-the-alarm",
    "timestamp": "2026-02-09T21:54:52Z"
  },
  {
    "title": "USA's Kim requests compassion in wake of Trump's jab at Olympian Hess",
    "description": "U.S. snowboarder Chloe Kim called for compassion in leadership in response to President Trump's slight of skier Hunter Hess at the Winter Olympics.",
    "link": "https://www.upi.com/Sports_News/2026/02/09/italy-USA-Kim-compassion-Trump-jab-Hess/2231770669871/",
    "timestamp": "2026-02-09T21:53:53Z"
  },
  {
    "title": "United Nations presses for answers on US funding commitments",
    "description": "UN spokesperson says the international body is 'waiting to see exactly when payments' will be made by Washington.",
    "link": "https://www.aljazeera.com/news/2026/2/9/united-nations-presses-for-answers-on-us-funding-commitments",
    "timestamp": "2026-02-09T21:53:52Z"
  },
  {
    "title": "Bad Bunny's Super Bowl halftime show explored who gets to be American",
    "description": "Bad Bunny concluded his historic Super Bowl halftime performance with a few English-language words. He said “God Bless America” and then proceeded to list countries in the Americas including the United States and Canada. It seemed as though he was reminding h…",
    "link": "https://apnews.com/article/bad-bunny-halftime-show-america-0f3534a06cc01fb7c5aae7487debe4fb",
    "timestamp": "2026-02-09T21:52:48Z"
  },
  {
    "title": "Bill Maher Complains About Ongoing Beef With Jimmy Kimmel: ‘He’s Very Mad at Me’ | Video",
    "description": "The podcaster, who previously called out Kimmel's wife over her anti-Trump remarks, says \"I don't think I did anything wrong\"\nThe post Bill Maher Complains About Ongoing Beef With Jimmy Kimmel: ‘He’s Very Mad at Me’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/tv/bill-maher-jimmy-kimmel-beef-donald-trump-molly-mcnearney/",
    "timestamp": "2026-02-09T21:52:21Z"
  },
  {
    "title": "US to fund free speech initiatives in Europe, Trump official says",
    "description": "By Simon LewisWASHINGTON, Feb 9 (Reuters) - The Trump administration will fund efforts to promote free speech within Western countries allied with Washington, a senior St… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/09/us-to-fund-free-speech-initiatives-in-europe-trump-official-says",
    "timestamp": "2026-02-09T21:52:16Z"
  },
  {
    "title": "MAGA effort to re-gerrymander red state in jeopardy as 'extensive fraud' alleged",
    "description": "In a huge blow to Utah Republicans and the GOP's efforts to hold the House majority in this year's elections, county officials have flagged thousands of invalid and potentially fraudulent signatures in a petition drive to repeal the state's anti-gerrymanderin…",
    "link": "https://www.rawstory.com/utah-gerrymandering-2675237701/",
    "timestamp": "2026-02-09T21:51:40Z"
  },
  {
    "title": "‘Interests of justice’: Feds want judge to cancel Steve Bannon’s indictment and conviction",
    "description": "Pelosi's partisan commission pursued Trump ally for refusing to testify",
    "link": "https://www.wnd.com/2026/02/interests-justice-feds-want-judge-cancel-steve-bannons/",
    "timestamp": "2026-02-09T21:50:57Z"
  },
  {
    "title": "The Maple Leaf Rescue: Why Disney is Dispatches “Diplomatic” Teams to Canada to Save Florida’s Slumping International Tourism",
    "description": "For decades, the sound of the Canadian accent has been as ubiquitous in Central Florida as the humidity and the smell of popcorn on Main Street, U.S.A. Canada is, and has always been, Florida’s number one international market. But as of February 2026, the “Sn…",
    "link": "https://insidethemagic.net/2026/02/disney-world-representatives-heading-for-talks-with-canadian-officials-to-bring-them-back-to-central-florida-rl1/",
    "timestamp": "2026-02-09T21:50:28Z"
  },
  {
    "title": "Trump’s border tsar warned immigration crackdown would upset public",
    "description": "Donald Trump’s border tsar warned months ago that the administration’s aggressive and sweeping immigration crackdown risked losing public support.",
    "link": "https://uk.news.yahoo.com/trump-border-tsar-warned-immigration-215021755.html",
    "timestamp": "2026-02-09T21:50:21Z"
  },
  {
    "title": "The MAGA court decision that just supercharged ICE",
    "description": "Two judges on the United States Court of Appeals for the Fifth Circuit, a court dominated by MAGA Republicans, just handed the Trump administration broad authority to lock up millions of immigrants — provided that it can get those immigrants to Texas, Louisia…",
    "link": "https://www.vox.com/politics/478637/fifth-circuit-ice-detention-edith-jones-buenrostro-mendez-bondi",
    "timestamp": "2026-02-09T21:49:11Z"
  },
  {
    "title": "Trump Stops Start – Let The Nuclear Arms Race Begin",
    "description": "In what is likely the most reckless move by a US President in our lifetimes, President Donald J. Trump has ignored all efforts to continue the New Strategic Arms Reduction Treaty (New START). Asked by the Press if he thought an extension was worthwhile, Trump…",
    "link": "https://www.antiwar.com/blog/2026/02/09/trump-stops-start-let-the-nuclear-arms-race-begin/",
    "timestamp": "2026-02-09T21:49:09Z"
  },
  {
    "title": "Ghislaine Maxwell refuses to answer questions at congressional deposition, lawmakers say",
    "description": "<![CDATA[ Jeffrey Epstein's convicted associate, Ghislaine Maxwell, refused to answer questions from the US House Oversight Committee. ]]>",
    "link": "https://www.channelnewsasia.com/world/ghislaine-maxwell-epstein-us-house-justice-5918871",
    "timestamp": "2026-02-09T21:48:00Z"
  },
  {
    "title": "When conflict meets competition: Trump's immigration agenda roils opening days of Winter Olympics",
    "description": "As the Winter Olympics opened in Milan, Vice President JD Vance hailed the competition as “one of the few things that unites the entire country.” The early days of the Milan Cortina Games have been roiled by the tumultuous political debate in the U.S. America…",
    "link": "https://sports.yahoo.com/articles/conflict-meets-competition-trumps-immigration-214746855.html",
    "timestamp": "2026-02-09T21:47:46Z"
  },
  {
    "title": "Trump-Heckling Auto Worker Keeps His Job and Faces No Discipline: UAW",
    "description": "TJ Sabula, the auto worker who called President Donald Trump a “pedophile protector\" last month, is reportedly keeping his job.According to a report from the Detroit News, United Auto Workers (UAW) vice president Laura Dickerson said on Monday that Sabula is …",
    "link": "https://www.commondreams.org/news/tj-sabula-trump-heckler",
    "timestamp": "2026-02-09T21:46:31Z"
  },
  {
    "title": "Politician Demands FCC Take ‘Dramatic Action’ Against Bad Bunny For Super Bowl Lyrics",
    "description": "Bad Bunny’s Super Bowl LX halftime show was one of the more polarizing in recent memory. Politicians on either side of the party line posted their opinions of the performance after the fact. One US representative in the state of Florida is demanding the FCC r…",
    "link": "https://brobible.com/culture/article/randy-fine-demands-fcc-violation-bad-bunny-super-bowl-lyrics/",
    "timestamp": "2026-02-09T21:46:16Z"
  },
  {
    "title": "Secretary Rubio, other leaders denounce Jimmy Lai’s ‘tragic’ 20-year sentence",
    "description": "Lai, Catholic entrepreneur and media tycoon, was sentenced over what Chinese officials claim were national security violations.",
    "link": "https://www.ewtnnews.com/world/asia-pacific/secretary-rubio-other-leaders-denounce-jimmy-lai-s-tragic-20-year-sentence",
    "timestamp": "2026-02-09T21:45:00Z"
  },
  {
    "title": "Howard Lutnick, Trump's commerce secretary, faces calls to resign over Epstein ties",
    "description": "Howard Lutnick, Trump's commerce secretary, faces calls to resign over Epstein tiesgo.com",
    "link": "https://abcnews.go.com/Politics/howard-lutnick-trumps-commerce-secretary-faces-calls-resign/story?id=130002715",
    "timestamp": "2026-02-09T21:43:58Z"
  },
  {
    "title": "Andy Cohen Tells Off Bad Bunny Haters and Roasts MAGA Outrage Over Super Bowl Halftime Show Being in Spanish: ‘Oh, That’s Lady Gaga Singing in English!’",
    "description": "Andy Cohen isn’t letting Bad Bunny trolls get away with bashing the Super Bowl Halftime Show. The host of Bravo’s nightly talk show “Watch What Happens Live” and the executive producer of “The Real Housewives” franchise spent time on Threads after the big gam…",
    "link": "https://variety.com/2026/music/news/andy-cohen-bad-bunny-super-bowl-halftime-show-maga-haters-1236657278/",
    "timestamp": "2026-02-09T21:42:12Z"
  },
  {
    "title": "Trump ally's 2028 dreams in chaos as MAGA infights on thorny issue: 'He can't say a word'",
    "description": "Republicans have reached a significant challenge ahead of the 2028 elections — infighting over the party's stance on artificial intelligence — a clash that has put potential presidential hopeful and Vice President JD Vance in the middle of the GOP's ranging i…",
    "link": "https://www.rawstory.com/republicans-2675237252/",
    "timestamp": "2026-02-09T21:40:18Z"
  },
  {
    "title": "‘Lion King’ Actor Whoopi Goldberg Blasts Donald Trump For Racist AI Video Of Apes And Hippo: ‘At Least Once Check Your Facts’",
    "description": "Whoopi Goldberg, who lent her voice to Shenzi the cunning hyena in the 1994 Disney classic The Lion King, is lambasting President Donald Trump for the racist AI video he shared that depicted Barack and Michelle Obama as apes and Goldberg as a hippo. “You know…",
    "link": "http://deadline.com/2026/02/whoopi-goldberg-lion-king-donald-trump-1236713585/",
    "timestamp": "2026-02-09T21:36:29Z"
  },
  {
    "title": "Savannah Guthrie releases second video plea for missing mother",
    "description": "US TV host Savannah Guthrie says her family is at its “hour of desperation” in the search for their kidnapped mother, but makes no mention of a possible ransom in a new video.",
    "link": "https://www.abc.net.au/news/2026-02-10/savannah-guthrie-makes-new-video-plea-over-missing-mother/106325066",
    "timestamp": "2026-02-09T21:35:30Z"
  },
  {
    "title": "NBC Hid The Boos For JD Vance. Where’s Trump’s ‘Unfair Editing’ Lawsuit?",
    "description": "If you watched NBC’s prime time broadcast of the Winter Olympics opening ceremony on Friday, you saw Vice President JD Vance in the stands at San Siro Stadium in Milan with his wife, Usha. The commentary team said “JD Vance” and moved on. Pleasant enough. But…",
    "link": "https://www.techdirt.com/2026/02/09/nbc-hid-the-boos-for-jd-vance-wheres-trumps-unfair-editing-lawsuit/",
    "timestamp": "2026-02-09T21:32:18Z"
  },
  {
    "title": "DOJ may face investigation for pressuring Apple, Google to remove apps for tracking ICE agents",
    "description": "House Judiciary Committee member Jamie Raskin (D-MD) has asked the US Department of Justice to turn over all its communications with both Apple and Google regarding the companies' decisions to remove apps that shared information about sightings of US Immigrat…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180762574",
    "timestamp": "2026-02-09T21:32:06Z"
  },
  {
    "title": "Oil Settles Higher as Hormuz Risks Resurface",
    "description": "Oil prices closed higher after the US warned ships to avoid Iranian waters near the Strait of Hormuz.",
    "link": "https://www.rigzone.com/news/wire/oil_settles_higher_as_hormuz_risks_resurface-09-feb-2026-182951-article/",
    "timestamp": "2026-02-09T21:30:23Z"
  },
  {
    "title": "Super Bowl Music Recap: Bad Bunny Says “God Bless America,” Green Day Says Nothing & More",
    "description": "Super Bowl LX is a wrap, and we discussed all the music-related aspects on the new episode of BV Weekly. That includes Bad Bunny's historic Halftime Show; Green Day's opening ceremony performance; Zach Bryan's pre-game Madden Bowl performance; Brandi Carlile'…",
    "link": "https://www.brooklynvegan.com/super-bowl-music-recap-bad-bunny-says-god-bless-america-green-day-says-nothing-more/",
    "timestamp": "2026-02-09T21:28:44Z"
  },
  {
    "title": "'Adios': CNN Data Guru Shows How Trump's Non-College Base Is 'Collapsing' Steve Bannon: Republicans Facing 'Nuclear Winter' In The Midterms",
    "description": "CNN’s data guru, Harry Enten, revealed devastating poll numbers for Republicans with voters without a college degree, which is Donald Trump's base. Enten said Trump's base with those voters is \"collapsing.\"\n\"Yeah, OK. So you know, if you know anything about D…",
    "link": "https://crooksandliars.com/2026/02/adioscnn-data-guru-shows-how-trumps-non",
    "timestamp": "2026-02-09T21:27:48Z"
  },
  {
    "title": "Savannah Guthrie makes new video plea as ransom deadline for her missing mother nears",
    "description": "Savannah Guthrie said in a video released Monday that her family is \"at an hour of desperation\" in the search for the \"Today\" show host's missing mother, ahead of Monday evening's looming ransom deadline set by the purported abductors.",
    "link": "https://www.pbs.org/newshour/nation/savannah-guthrie-makes-new-video-plea-as-ransom-deadline-for-her-missing-mother-nears",
    "timestamp": "2026-02-09T21:26:24Z"
  },
  {
    "title": "What's driving stock market turbulence? Experts weigh in",
    "description": "Markets extended gains on Monday, after suffering major losses days earlier.",
    "link": "https://abcnews.go.com/Business/driving-stock-market-turbulence-experts-weigh/story?id=129990321",
    "timestamp": "2026-02-09T21:26:08Z"
  },
  {
    "title": "Savannah Guthrie makes new video plea as missing mother’s ransom deadline nears",
    "description": "Savannah Guthrie said in a video released Monday that her family is “at an hour of desperation” in the search her missing mother, Nancy Guthrie, ahead of a looming ransom deadline set for Monday evening by her purported abductors.",
    "link": "https://www.wpxi.com/news/local/savannah-guthrie-makes-new-video-plea-missing-mothers-ransom-deadline-nears/P5QDQ53LZZFGRMPQ4DJREGEB3I/",
    "timestamp": "2026-02-09T21:25:39Z"
  },
  {
    "title": "Texas Senate Race Could Be a Match for the Ages",
    "description": "Texas 2026 Senate race could be match for the ages. The latest polls favor a matchup between Jasmine Crockett and Ken Paxton, which might make this high-stakes midterms race even messier.",
    "link": "http://nymag.com/intelligencer/article/texas-senate-race-polls.html",
    "timestamp": "2026-02-09T21:25:21Z"
  },
  {
    "title": "Gospel Singer Sandi Patty Comments On Trump's Racist Post",
    "description": "Gospel music legend Sandi Patty has spoken out about the racist video that was recently published on President Donald Trump's Truth Social account.",
    "link": "http://www.billboard.com/music/music-news/sandi-patty-trump-racist-video-1236176686/",
    "timestamp": "2026-02-09T21:23:45Z"
  },
  {
    "title": "Tulsi Gabbard to testify at Senate Intelligence Committee amid election probe concerns",
    "description": "Director of National Intelligence Tulsi Gabbard has said she was at a Georgia election center during an FBI raid at the direction of President Trump.",
    "link": "https://www.cnbc.com/2026/02/09/tulsi-gabbard-testify-senate-intelligence-fulton-county-election.html",
    "timestamp": "2026-02-09T21:23:06Z"
  },
  {
    "title": "A First Amendment Lawsuit Challenges FTC Chairman Andrew Ferguson's Vendetta Against NewsGuard",
    "description": "Andrew Ferguson has targeted the news rating company with onerous record demands and a merger condition aimed at cutting off its revenue.",
    "link": "https://reason.com/2026/02/09/a-first-amendment-lawsuit-challenges-ftc-chairman-andrew-fergusons-vendetta-against-newsguard/",
    "timestamp": "2026-02-09T21:23:00Z"
  }
]