[
  {
    "title": "Chuck Schumer a Likely Casualty of the Democrat Civil War",
    "description": "The party is broken – and once-integral cogs in the machine are slated for replacement. Senate Minority Leader Chuck Schumer (D-NY) has now perhaps become the most high-profile victim of the Democratic Party’s civil war – with less emphasis on the “civil.” A …",
    "link": "https://freerepublic.com/focus/f-bloggers/4312963/posts",
    "timestamp": "2025-04-24T13:31:58Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Thursday",
    "description": "Wall Street was headed for a muted open today after China said trade talks with the U.S. have not started.",
    "link": "https://www.cnbc.com/2025/04/24/jim-cramers-top-10-things-to-watch-in-the-stock-market-thursday.html",
    "timestamp": "2025-04-24T13:31:31Z"
  },
  {
    "title": "Apple, Meta Fined as EU Presses Ahead With Tech Probes",
    "description": "Apple was fined 500 million euros ($570 million) on Wednesday and Meta 200 million euros, as European Union antitrust regulators handed out the first sanctions under landmark legislation aimed at curbing the power of Big Tech. The EU fines could …",
    "link": "https://www.insurancejournal.com/news/international/2025/04/24/821139.htm",
    "timestamp": "2025-04-24T13:30:16Z"
  },
  {
    "title": "Russia ready for talks on new nuclear pact with US, Shoigu says",
    "description": "Russia is prepared to resume talks on nuclear arms control with the US, two years after suspending the last accord limiting their atomic arsenals, a top security official said.",
    "link": "https://www.bangkokpost.com/world/3010667/russia-ready-for-talks-on-new-nuclear-pact-with-us-shoigu-says",
    "timestamp": "2025-04-24T13:30:00Z"
  },
  {
    "title": "Elon Musk’s Luck Runs Out",
    "description": "Why he didn’t see this coming",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/04/elon-musk-tesla-doge/682566/",
    "timestamp": "2025-04-24T13:30:00Z"
  },
  {
    "title": "‘Vladimir, STOP!’ Trump posts rare criticism of Putin after deadly attack on Kyiv",
    "description": "Trump said in a social media post on Thursday that \"I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing. Vladimir, STOP! 5000 soldiers a week are dying.\"",
    "link": "https://www.pbs.org/newshour/politics/vladimir-stop-trump-posts-rare-criticism-of-putin-after-deadly-attack-on-kyiv",
    "timestamp": "2025-04-24T13:29:14Z"
  },
  {
    "title": "Morgan Stanley to Sell Final $1.23 Billion of X Buyout Debt",
    "description": "(Bloomberg) -- Morgan Stanley launched a pivotal sale of the last bit of debt tied to Elon Musk’s buyout of social-media platform X Holdings Corp. on...",
    "link": "https://finance.yahoo.com/news/morgan-stanley-sell-final-1-132658151.html",
    "timestamp": "2025-04-24T13:26:58Z"
  },
  {
    "title": "Why Republicans Are Still Sticking with Trump",
    "description": "Despite sinking approval ratings — even on the economy, once considered his strongest issue — Donald Trump still faces almost no criticism from Republican lawmakers. His grip on the party remains remarkably tight. There are",
    "link": "https://politicalwire.com/2025/04/24/why-republicans-are-still-sticking-with-trump/",
    "timestamp": "2025-04-24T13:26:31Z"
  },
  {
    "title": "Poll Delivers Trump Bad News on Economy",
    "description": "Trump won the election in part due to frustration with inflation and his promise to lead the U.S. into a new age of growth.",
    "link": "https://www.newsweek.com/poll-delivers-trump-bad-news-economy-2063591",
    "timestamp": "2025-04-24T13:26:12Z"
  },
  {
    "title": "China’s Investments in Southeast Asia Snarl US Plans on Supply Chains",
    "description": "Chinese investments in Southeast Asian manufacturing are likely much higher than official data shows, underscoring the difficulty of any US attempt to box in Beijing or exclude Chinese-made goods from its supply chains.",
    "link": "https://financialpost.com/pmn/business-pmn/chinas-investments-in-southeast-asia-snarl-us-plans-on-supply-chains",
    "timestamp": "2025-04-24T13:25:59Z"
  },
  {
    "title": "Ex-NFL player calls for male athletes to support females amid fight against trans inclusion in women's sports",
    "description": "Former NFL player Frank Murphy called on athletes from the league and the NBA to stand up against trans inclusion in women's sports on Thursday.",
    "link": "https://www.foxnews.com/sports/ex-nfl-player-calls-male-athletes-support-females-amid-fight-against-trans-inclusion-womens-sports",
    "timestamp": "2025-04-24T13:24:23Z"
  },
  {
    "title": "Trump tells Putin to 'STOP!' Russian strikes on Kyiv",
    "description": null,
    "link": "https://www.cnbc.com/2025/04/24/trump-putin-russia-ukraine-kyiv.html",
    "timestamp": "2025-04-24T13:23:03Z"
  },
  {
    "title": "Trump Says Lowering China Tariffs Depends on Them",
    "description": "President Donald Trump said he plans to be “very nice” to China in any trade talks and that tariffs will drop if the two countries can reach a deal, a sign he may be backing down from his tough stance on Beijing amid market volatility. #trump #us #china #tari…",
    "link": "https://biztoc.com/x/b6206b9d93826be0",
    "timestamp": "2025-04-24T13:22:39Z"
  },
  {
    "title": "Shein and Temu set to get expensive in the US from April 25: Here’s how you can still save money",
    "description": "Shein and Temu, both Chinese e-commerce sites, are set to increase prices for US consumers owing to increased tariffs imposed by US President Donald Trump. The ongoing trade war between US and China has hugely impaced such platforms.",
    "link": "https://economictimes.indiatimes.com/news/international/us/shein-and-temu-set-to-get-expensive-in-the-us-from-april-25-heres-how-you-can-still-save-money/articleshow/120587988.cms",
    "timestamp": "2025-04-24T13:22:38Z"
  },
  {
    "title": "It's not just 'leftist' judges. GOP appointees have many sharp words for Trump. (Aaron Blake/Washington Post)",
    "description": "Aaron Blake / Washington Post:\nIt's not just ‘leftist’ judges.  GOP appointees have many sharp words for Trump.  —  Three times in the last 16 days, Republican-nominated judges have pitched the administration's actions as brazen, lawless — and even dangerous.…",
    "link": "https://www.memeorandum.com/250424/p42",
    "timestamp": "2025-04-24T13:20:01Z"
  },
  {
    "title": "Gov. Gen. Mary Simon will represent Canada at Pope Francis's funeral on Saturday",
    "description": "Gov. Gen. Mary Simon will represent Canada at the funeral for Pope Francis at the Vatican on Saturday, says Prime Minister Mark Carney.",
    "link": "https://www.nationalobserver.com/2025/04/24/news/gov-gen-mary-simon-will-represent-canada-pope-franciss-funeral-saturday",
    "timestamp": "2025-04-24T13:17:42Z"
  },
  {
    "title": "1.9 Million People Stuck In Student Loan Forgiveness And Repayment Limbo Get Some Key Updates",
    "description": "Nearly two million federal student loan borrowers pursuing lower payments and loan forgiveness have been stuck in limbo. Now, we have some updates.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/04/24/19-million-people-stuck-in-student-loan-forgiveness-and-repayment-limbo-get-some-key-updates/",
    "timestamp": "2025-04-24T13:17:26Z"
  },
  {
    "title": "AOC’s Brother Denies He’s Linked to $1.2M Fentanyl Ring After Fake News Spreads Like Wildfire",
    "description": "The brother of Rep. Alexandria Ocasio-Cortez (D-NY) denied being involved in drug trafficking after a fake news story about him went viral.\nThe post AOC’s Brother Denies He’s Linked to $1.2M Fentanyl Ring After Fake News Spreads Like Wildfire first appeared o…",
    "link": "https://www.mediaite.com/news/aocs-brother-denies-hes-linked-to-1-2m-fentanyl-ring-after-fake-news-spreads-like-wildfire/",
    "timestamp": "2025-04-24T13:17:21Z"
  },
  {
    "title": "Trump issues rare rebuke for Putin after Kyiv attacks",
    "description": "Donald Trump said deadly Russian attacks on Kyiv were \"not necessary and very bad timimg.\" Ukraine's foreign minister has said the assaults showed Moscow does not want peace. DW has more.",
    "link": "https://www.dw.com/en/trump-issues-rare-rebuke-for-putin-after-kyiv-attacks/live-72328966",
    "timestamp": "2025-04-24T13:17:00Z"
  },
  {
    "title": "Trump Speaks with South Africa's Ramaphosa About Ukraine-Russia Peace",
    "description": "President Donald Trump spoke with South African President Cyril Ramaphosa on Thursday about the peace process between Russia and Ukraine, as Ukrainian President Volodymyr Zelensky visited South Africa.\nThe post Trump Speaks with South Africa’s Ramaphosa About…",
    "link": "https://www.breitbart.com/africa/2025/04/24/trump-speaks-with-south-africas-ramaphosa-about-ukraine-russia-peace/",
    "timestamp": "2025-04-24T13:16:59Z"
  },
  {
    "title": "'Sugar-high of Trump first 100 days is over' as support collapses: ex-Republican adviser",
    "description": "As Donald Trump closes in on the end of his first 100 days of his second administration, his approval numbers are plummeting as the reality of his policies –– from trade to immigration –– take hold and American voters take stock.Early Thursday morning on MSNB…",
    "link": "https://www.rawstory.com/trump-polling-tariffs-100-days/",
    "timestamp": "2025-04-24T13:14:07Z"
  },
  {
    "title": "It pays to criticize Elon Musk — even for MAGA activists; Laura Loomer and other far-right users found out as their X engagement plummeted after taking on the Tesla CEO",
    "description": "Far-right influencers, including Laura Loomer, experienced a decline in X engagement after criticizing Elon Musk's immigration policies. Despite Musk's free speech claims, users allege visibility and monetization throttling. Loomer estimated a $50,000 loss du…",
    "link": "https://economictimes.indiatimes.com/news/international/us/it-pays-to-criticize-elon-musk-even-for-maga-activists-laura-loomer-and-other-far-right-users-found-out-as-their-x-engagement-plummeted-after-taking-on-the-tesla-ceo/articleshow/120587801.cms",
    "timestamp": "2025-04-24T13:13:32Z"
  },
  {
    "title": "CFIB economic forecast predicts significant contraction in second quarter",
    "description": "OTTAWA — A forecast from the Canadian Federation of Independent Business estimates the economy saw muted growth in the first three months of the year and predicts a significant contraction for the second quarter. The report estimates the Canadian economy grew…",
    "link": "https://financialpost.com/pmn/cfib-economic-forecast-predicts-significant-contraction-in-second-quarter",
    "timestamp": "2025-04-24T13:12:40Z"
  },
  {
    "title": "Venezuelan government uses Tren de Aragua as proxies to undermine US public safety, FBI assessment finds",
    "description": "EXCLUSIVE: The FBI assesses that some Venezuelan government officials \"likely facilitate\" the migration of members of the violent gang Tren de Aragua from Venezuela to the United States to advance the Maduro regime’s objective of undermining public safety in …",
    "link": "https://freerepublic.com/focus/f-chat/4312955/posts",
    "timestamp": "2025-04-24T13:12:03Z"
  },
  {
    "title": "US filings for jobless benefits inch up as labor market remains strong despite fears of downturn",
    "description": "U.S. applications for jobless benefits rose modestly as business continue to retain workers despite economic fears.",
    "link": "https://www.bostonherald.com/2025/04/24/jobless-benefits-inch-up/",
    "timestamp": "2025-04-24T13:11:31Z"
  },
  {
    "title": "European Commission fines Apple €500m and Meta €200m over DMA breaches",
    "description": "Get set for the next tangling of antlers between the US and the European Union. Why? Because the European Commission has found Apple and Meta in breach of its Digital Markets Act, and has fined the tech giants €500m and €200m respectively. Apple was fined for…",
    "link": "http://musically.com/2025/04/24/european-commission-fines-apple-e500m-and-meta-e200m-over-dma-breaches/",
    "timestamp": "2025-04-24T13:11:00Z"
  },
  {
    "title": "IMF chief urges countries to move ‘swiftly’ to resolve trade tensions that threaten global growth",
    "description": "WASHINGTON (AP) — The head of the International Monetary Fund urged countries to move “swiftly” to resolve trade disputes that threaten global economic growth. IMF managing director Kristalina Georgieva said the unpredictability arising from President Donald …",
    "link": "https://financialpost.com/pmn/imf-chief-urges-countries-to-move-swiftly-to-resolve-trade-tensions-that-threaten-global-growth",
    "timestamp": "2025-04-24T13:10:58Z"
  },
  {
    "title": "European Commission announces ‘multi-billion-dollar tariff’ on American tech companies",
    "description": "And demands corporations 'change' their business model to offer 'inferior service'",
    "link": "https://www.wnd.com/2025/04/european-commission-announces-multi-billion-dollar-tariff-on-american-tech-companies/",
    "timestamp": "2025-04-24T13:10:33Z"
  },
  {
    "title": "Trump on Russia strikes on Kyiv: 'Vladimir, STOP!\"",
    "description": "WASHINGTON (Reuters) - President Donald Trump turned his criticism on Russian President Vladimir Putin on Thursday after Russia pounded Kyiv with missiles and drones overnight, saying \"Vladimir, STOP!\" Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/24/trump-on-russia-strikes-on-kyiv-039vladimir-stop",
    "timestamp": "2025-04-24T13:10:00Z"
  },
  {
    "title": "CNBC's Inside India newsletter: Have India stocks bottomed?",
    "description": "Indian stocks have rallied about 10% since bottoming out on April 7, when trade tensions between the United States and China escalated.",
    "link": "https://www.cnbc.com/2025/04/24/have-india-stocks-bottomed.html",
    "timestamp": "2025-04-24T13:09:51Z"
  },
  {
    "title": "Photos show the most powerful moments from Pope Francis' funeral proceedings",
    "description": "Pope Francis, the 266th head of the Roman Catholic Church, died on April 21 at the age of 88.",
    "link": "https://www.businessinsider.com/pope-francis-funeral-photos-vatican-city-rome-2025-4",
    "timestamp": "2025-04-24T13:08:49Z"
  },
  {
    "title": "Donald Trump urges Vladimir Putin to 'STOP!' after a deadly attack on Kyiv",
    "description": "President Donald Trump on Thursday offered rare criticism of Vladimir Putin, urging the Russian leader to “STOP!” after a deadly barrage of attacks on Kyiv, Ukraine's capital.",
    "link": "https://www.independent.ie/world-news/donald-trump-urges-vladimir-putin-to-stop-after-a-deadly-attack-on-kyiv/a1822625076.html",
    "timestamp": "2025-04-24T13:08:47Z"
  },
  {
    "title": "'Vladimir stop!' Trump pleads with Putin to end bombing campaign against Ukraine",
    "description": "President Donald Trump pleaded with Russian president Vladimir Putin to call off a bombing campaign against Ukraine.Russia launched its deadliest attacks against Kyiv in nine months Thursday morning, just hours after Trump accused Ukraine president Volodymyr …",
    "link": "https://www.rawstory.com/trump-russia-ukraine-war-2671838462/",
    "timestamp": "2025-04-24T13:07:28Z"
  },
  {
    "title": "Nestle beats quarterly sales estimates, says indirect tariff impact 'unclear'",
    "description": "LONDON : Nestle on Thursday said the indirect impact of U.S. tariffs was \"unclear\" and posted better-than-expected first-quarter organic sales growth, as the world's biggest packaged food company hiked prices for its Kit-Kat chocolate bars and Nescafe coffee.…",
    "link": "https://www.channelnewsasia.com/business/nestle-beats-quarterly-sales-estimates-says-indirect-tariff-impact-unclear-5086626",
    "timestamp": "2025-04-24T13:05:50Z"
  },
  {
    "title": "Trump, Burgum Move To Slash Energy Project Permitting Time",
    "description": "Interior Secretary Doug Burgum moved in Wednesday to implement streamlined permitting procedures for energy projects on federal lands.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/04/24/trump-burgum-move-to-slash-energy-project-permitting-time/",
    "timestamp": "2025-04-24T13:05:43Z"
  },
  {
    "title": "How America's $5,000 Baby Bonus Could Work",
    "description": "The White House is reportedly considering giving a $5,000 \"baby bonus\" to women who have children.",
    "link": "https://www.newsweek.com/baby-bonus-america-5000-2063519",
    "timestamp": "2025-04-24T13:05:29Z"
  },
  {
    "title": "Orders for big-ticket items like autos and appliances surged 9.2% in March in rush to beat tariffs",
    "description": "Transportation equipment orders surged 27%, led by a 139% increase in nondefense aircraft and parts.",
    "link": "https://www.cnbc.com/2025/04/24/orders-for-big-ticket-items-like-autos-and-appliances-surged-9point2percent-in-march-in-rush-to-beat-tariffs.html",
    "timestamp": "2025-04-24T13:05:18Z"
  },
  {
    "title": "China refutes Trump tariff-talks claim",
    "description": "US President Donald Trump earlier signaled a potential easing of China tariffs and said he has discussed the situation with Beijing Read Full Article at RT.com",
    "link": "https://www.rt.com/business/616192-china-trump-claim-tariffs/",
    "timestamp": "2025-04-24T13:05:10Z"
  },
  {
    "title": "White House calls EU fines on Apple and Meta ‘economic extortion’",
    "description": "The White House on Wednesday condemned EU fines on Apple and Meta Platforms, labeling them a \"novel form of economic extortion\" that…\nThe post White House calls EU fines on Apple and Meta ‘economic extortion’ appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/04/24/white-house-calls-eu-fines-on-apple-and-meta-economic-extortion/",
    "timestamp": "2025-04-24T13:05:01Z"
  },
  {
    "title": "In rare criticism of Putin, Trump urges the Russian leader to 'STOP!' after a deadly attack on Kyiv",
    "description": "Donald Trump has urged Vladimir Putin to halt attacks on Kyiv, expressing unhappiness with the strikes and citing heavy casualties. Trump's frustration grows as peace efforts stall, and he criticizes Zelenskyy for refusing to cede Crimea. He is scheduled to m…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-rare-criticism-of-putin-trump-urges-the-russian-leader-to-stop-after-a-deadly-attack-on-kyiv/articleshow/120587575.cms",
    "timestamp": "2025-04-24T13:04:55Z"
  },
  {
    "title": "McMahon: Trump order will prevent Qatari influence on teaching Middle East at schools",
    "description": "A White House Fact Sheet claimed that $60 billion in foreign gifts and contracts had flowed into American academic institutions over several decades.",
    "link": "https://www.jpost.com/international/article-851385",
    "timestamp": "2025-04-24T13:04:31Z"
  },
  {
    "title": "‘Vladimir, STOP!’ Trump Calls Out Putin on Truth Social After Deadly Russian Strike on Kyiv",
    "description": "Trump is not happy with Russian President Putin, which we know because he took to social media and wrote, \"I am not happy\" following Russian missile strikes.\nThe post ‘Vladimir, STOP!’ Trump Calls Out Putin on Truth Social After Deadly Russian Strike on Kyiv …",
    "link": "https://www.mediaite.com/trump/vladimir-stop-trump-calls-out-putin-on-truth-social-after-deadly-russian-strike-on-kyiv/",
    "timestamp": "2025-04-24T13:04:24Z"
  },
  {
    "title": "Pete Hegseth’s reported new makeup studio at the Pentagon gives away the game",
    "description": "New allegations reinforce concerns that Pete Hegseth's job is to effectively play the role of defense secretary on television.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pete-hegseths-reported-new-makeup-studio-pentagon-gives-away-game-rcna202751",
    "timestamp": "2025-04-24T13:03:51Z"
  },
  {
    "title": "In rare criticism of Putin, Trump urges the Russian leader to ‘STOP!’ after a deadly attack on Kyiv",
    "description": "Trump took to social media to urge Russia's Putin to stop attacking Ukraine after deadly overnight mission.",
    "link": "https://www.bostonherald.com/2025/04/24/trump-criticizes-putin-ukraine-attack/",
    "timestamp": "2025-04-24T13:03:49Z"
  },
  {
    "title": "Trump trade war is wrecking hope for 2025 US trucking rebound",
    "description": "NEW ORLEANS (Reuters) -U.S. truckers are moving record volumes of auto parts, appliances and sneakers after their customers stocked up ahead of President...",
    "link": "https://ca.finance.yahoo.com/news/trump-trade-war-wrecking-hope-130348390.html",
    "timestamp": "2025-04-24T13:03:48Z"
  },
  {
    "title": "Theo Raises $20M to Bring Hedge Fund Strategies to Retail Crypto Traders",
    "description": "Theo plans to use the funds to build user-friendly infrastructure, automating complex trading strategies without the technical expertise.",
    "link": "https://decrypt.co/316084/theo-raises-20m-to-bring-hedge-fund-strategies-to-retail-crypto-traders",
    "timestamp": "2025-04-24T13:01:11Z"
  },
  {
    "title": "Leavitt goes off on Democrat for taxpayer-funded trip to support deported suspected MS-13 gang member",
    "description": "Sen. Van Hollen took a highly publicized trip last week to El Salvador to advocate for Kilmar Abrego Garcia's return.. White House Press Secretary Karoline Leavitt blasted Maryland Democratic Sen. Chris Van Hollen on Monday after he admitted that his trip to …",
    "link": "https://freerepublic.com/focus/f-news/4312952/posts",
    "timestamp": "2025-04-24T13:00:37Z"
  },
  {
    "title": "Bitcoin Miners Get Little Relief From Top Cryptocurrency’s Rally",
    "description": "Bitcoin miners’ earnings power and stocks have diverged from the asset they help produce, a stark reminder of the deteriorating economics of an industry US President Donald Trump has championed.",
    "link": "https://financialpost.com/pmn/business-pmn/bitcoin-miners-get-little-relief-from-top-cryptocurrencys-rally",
    "timestamp": "2025-04-24T13:00:34Z"
  },
  {
    "title": "IMF chief urges countries to move 'swiftly' to resolve trade tensions that threaten global growth",
    "description": "IMF managing director Kristalina Georgieva said the unpredictability arising from President Donald Trump’s aggressive campaign of taxes on foreign imports is...",
    "link": "https://finance.yahoo.com/news/imf-chief-urges-countries-move-130019492.html",
    "timestamp": "2025-04-24T13:00:19Z"
  },
  {
    "title": "Democrats can afford to fight for Kilmar Abrego Garcia (Eric Levitz/Vox)",
    "description": "Eric Levitz / Vox:\nDemocrats can afford to fight for Kilmar Abrego Garcia  —  Immigration is Trump's best issue.  But the benefits of fighting his lawless deportations are worth the political risks. … President Donald Trump has been sending undocumented immig…",
    "link": "https://www.memeorandum.com/250424/p35",
    "timestamp": "2025-04-24T13:00:04Z"
  },
  {
    "title": "TRUMP price prediction – After the 75% surge, is $16 coming next?",
    "description": "Before the dinner party invite announcement, the demand for Official Trump had been weak, with the OBV in a downtrend.",
    "link": "https://ambcrypto.com/trumps-75-price-surge-what-triggered-it-and-is-16-next/",
    "timestamp": "2025-04-24T13:00:01Z"
  },
  {
    "title": "Thursday, April 24, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/thursday-april-24-2025/",
    "timestamp": "2025-04-24T12:59:13Z"
  },
  {
    "title": "Pope's death sparks betting frenzy for successor",
    "description": "The date when Catholic cardinals will gather to select Pope Francis's successor is not yet known. But bookmakers and crypto investors are already scrambling to guess who will be the next pontiff.",
    "link": "https://www.hurriyetdailynews.com/popes-death-sparks-betting-frenzy-for-successor-208433",
    "timestamp": "2025-04-24T12:58:57Z"
  },
  {
    "title": "The great collapse of US higher education has begun",
    "description": "Budget cuts, culture wars and enrolment crashes are pushing American universities off the edge.",
    "link": "https://www.aljazeera.com/opinions/2025/4/24/the-great-collapse-of-us-higher-education-has-begun",
    "timestamp": "2025-04-24T12:57:32Z"
  },
  {
    "title": "South African leader talks with Trump after months of tension",
    "description": "President Cyril Ramaphosa and his US counterpart have discussed the process of ending hostilities between Moscow and Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/616206-south-african-leader-trump-bilateral-ukraine-peace-talks/",
    "timestamp": "2025-04-24T12:56:38Z"
  },
  {
    "title": "Alaska, rich in petroleum, faces an energy shortage",
    "description": "Alaska produces a lot of crude oil, but many of the state’s utilities, businesses and homes run on natural gas, which is in dwindling supply near population centers.",
    "link": "https://theconversation.com/alaska-rich-in-petroleum-faces-an-energy-shortage-254903",
    "timestamp": "2025-04-24T12:56:16Z"
  },
  {
    "title": "Challenging anarchy: Russian roulette in post-Assad Syria",
    "description": "Western powers want to present the fall of the Syrian regime as a strategic defeat for Moscow, but its goals have changed in the past decade Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616148-post-assad-syria-russia/",
    "timestamp": "2025-04-24T12:55:12Z"
  },
  {
    "title": "US weekly jobless claims increase moderately amid low layoffs",
    "description": "U.S. jobless claims edged up slightly to 222,000, indicating a resilient labor market despite economic uncertainties fueled by tariffs. The data, influenced by holiday volatility and spring breaks, comes amid concerns that President Trump's trade policies cou…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-weekly-jobless-claims-increase-moderately-amid-low-layoffs/articleshow/120587100.cms",
    "timestamp": "2025-04-24T12:53:38Z"
  },
  {
    "title": "Trump changes tone over tariffs on China. And, new executive actions target education - NPR",
    "description": "Trump changes tone over tariffs on China. And, new executive actions target educationNPR April 23, 2025 – Donald Trump presidency newsCNN My Take 5 (Edition 44): The week that was in international affairsTimes of India PHOTO COLLECTION: Vatican Pope Francis L…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177121733",
    "timestamp": "2025-04-24T12:53:21Z"
  },
  {
    "title": "Fetterman calls for bombing Iranian nuclear facilities: 'Waste that s---'",
    "description": "Democratic Sen. John Fetterman of Pennsylvania, a staunch supporter of Israel, is advocating for the destruction of Iran's nuclear facilities",
    "link": "https://www.foxnews.com/politics/fetterman-calls-bombing-iranian-nuclear-facilities",
    "timestamp": "2025-04-24T12:52:40Z"
  },
  {
    "title": "China says there are no tariff talks with the Trump administration",
    "description": "China has denied President Trump's assertion that the two sides were involved in active negotiations over tariffs.",
    "link": "https://www.cbsnews.com/news/china-denies-us-tariff-negotiations-trump/",
    "timestamp": "2025-04-24T12:52:17Z"
  },
  {
    "title": "IBM Stock Falls Despite Earnings Beat. Here's What The Tech Giant Said About DOGE, Tariffs.",
    "description": "IBM stock was lower Thursday despite a Q1 earnings beat and strong forecast. The company acknowledged DOGE has cut some IBM contracts.",
    "link": "https://www.investors.com/news/technology/ibm-stock-q1-2025-earnings-results-ai/",
    "timestamp": "2025-04-24T12:50:02Z"
  },
  {
    "title": "Donald Trump Pleads With Putin to Stop Attacking Ukraine: 'Vladimir, STOP!'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump pleaded with Russian President Vladimir Putin to stop his attacks on Ukraine after another set of deadly strikes rocked Kyiv, urging him to secure a peace deal.\n\"I am not happy with…",
    "link": "https://biztoc.com/x/36aa09ef95ba81b8",
    "timestamp": "2025-04-24T12:50:00Z"
  },
  {
    "title": "US filings for jobless benefits inch up as labor market remains strong",
    "description": "U.S. applications for jobless benefits rose modestly last week as business continue to retain workers despite fears of a possible economic downturn",
    "link": "https://abcnews.go.com/Business/wireStory/us-filings-jobless-benefits-inch-labor-market-remains-121120004",
    "timestamp": "2025-04-24T12:49:01Z"
  },
  {
    "title": "US stock futures today: Dow futures slip as China says trade talks haven’t even started, S&P 500 and Nasdaq drop, P&G cuts outlook, Texas Instruments and ServiceNow soar—Is Wall Street heading for a deeper pullback?",
    "description": "US stock futures today: Dow futures slip as China says trade talks haven’t even started, shaking investor confidence and pulling Wall Street lower in early trading. The S&P 500 and Nasdaq also dipped, raising fresh fears of a deeper market correction. While P…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-futures-today-dow-futures-slip-as-china-says-trade-talks-havent-even-started-sp-500-and-nasdaq-drop-pg-cuts-outlook-texas-instruments-and-servicenow-soaris-wall-street-heading-for-a-deeper-pullback/articleshow/120586719.cms",
    "timestamp": "2025-04-24T12:48:30Z"
  },
  {
    "title": "Trump Plans Private Dinner for Largest Buyers of $TRUMP Crypto",
    "description": "Trump's corruption knows no bounds.",
    "link": "https://gizmodo.com/trump-plans-private-dinner-for-largest-buyers-of-trump-crypto-2000593536",
    "timestamp": "2025-04-24T12:48:24Z"
  },
  {
    "title": "US filings for jobless benefits inch up as labor market remains strong despite fears of downturn",
    "description": "U.S. applications for jobless benefits rose modestly last week as business continue to retain workers despite fears of a possible economic downturn. Jobless claim applications inched up by 6,000 to 222,000 for the week ending April 19, the Labor Department sa…",
    "link": "https://financialpost.com/pmn/us-filings-for-jobless-benefits-inch-up-as-labor-market-remains-strong-despite-fears-of-downturn",
    "timestamp": "2025-04-24T12:47:54Z"
  },
  {
    "title": "Zelensky Refuses Any Peace Deal Taking Orders from EU & NATO – War Forever",
    "description": "Donald Trump berated Zelenskyy on April 23, after he said Ukraine would not legally recognize Russian control over Crimea. He said he will not accept ceding any territory, even though this is against the Minsk Agreement that was supposed to allow the Donbas t…",
    "link": "https://freerepublic.com/focus/f-chat/4312948/posts",
    "timestamp": "2025-04-24T12:47:10Z"
  },
  {
    "title": "Donald Trump Pleads With Putin to Stop Attacking Ukraine: 'Vladimir, STOP!'",
    "description": "It is rare for Trump to directly criticize Putin.",
    "link": "https://www.newsweek.com/donald-trump-pleads-putin-stop-attacking-ukraine-vladimir-stop-2063566",
    "timestamp": "2025-04-24T12:47:09Z"
  },
  {
    "title": "Federal judge gives DOJ another week in Abrego Garcia deportation case",
    "description": "A federal judge has granted the DOJ a one-week extension to provide information on its efforts to return deported illegal migrant Abrego Garcia to the U.S.",
    "link": "https://www.foxnews.com/politics/federal-judge-gives-doj-another-week-abrego-garcia-deportation-case",
    "timestamp": "2025-04-24T12:46:19Z"
  },
  {
    "title": "Trump Mulls $5000 Baby Bonus: Would It Offset Cost Of Raising A Child?",
    "description": "The Trump administration is reportedly weighing a $5,000 baby bonus to boost U.S. birthrates. Would it be enough to offset the rising cost of raising a child in America?",
    "link": "https://www.forbes.com/sites/shaharziv/2025/04/24/trump-mulls-5000-baby-bonus-would-it-offset-cost-of-raising-a-child/",
    "timestamp": "2025-04-24T12:45:00Z"
  },
  {
    "title": "UK PM Starmer nears EU defence pact in shadow of Trump trade talks",
    "description": "LONDON/WASHINGTON (Reuters) - Britain is edging towards a new defence agreement with the European Union that officials on both sides hope will help to improve post-Brexit ties following U.S. President Donald Trump's upending of security and trade alliances. R…",
    "link": "https://www.thestar.com.my/news/world/2025/04/24/uk-pm-starmer-nears-eu-defence-pact-in-shadow-of-trump-trade-talks",
    "timestamp": "2025-04-24T12:44:00Z"
  },
  {
    "title": "Weak Demand Set to Drag China’s LNG Imports Down by 20%",
    "description": "China continues to witness weak demand for liquefied natural gas and its LNG imports in April are estimated to be 20% lower than the volumes imported in the same month last year, Bloomberg reported on Thursday, citing data from analytics firm Kpler.  LNG impo…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Weak-Demand-Set-to-Drag-Chinas-LNG-Imports-Down-by-20.html",
    "timestamp": "2025-04-24T12:43:23Z"
  },
  {
    "title": "Putin Ally Warns Ukraine Solution May Lead to WW3",
    "description": "Former Defense Minister Sergei Shoigu said that European peacekeepers would try to control Ukraine and its mineral resources.",
    "link": "https://www.newsweek.com/shoigu-putin-ukraine-rare-earths-2063492",
    "timestamp": "2025-04-24T12:43:12Z"
  },
  {
    "title": "What Is Democratic Legality?",
    "description": "The left decries Trump’s deportation of an MS-13-linked illegal alien while ignoring its own legal hypocrisy and attempts to undermine the U.S. justice system. Since 2021, the left has waged a veritable war against the American legal system in a variety of wa…",
    "link": "https://freerepublic.com/focus/f-chat/4312947/posts",
    "timestamp": "2025-04-24T12:42:50Z"
  },
  {
    "title": "Germany blames Trump tariffs for zero-percent growth forecasts",
    "description": "Germany's economy is expected to post zero growth in 2025, outgoing Economy Minister Robert Habeck said Thursday, blaming US President Donald Trump's trade policy.",
    "link": "https://www.thelocal.de/20250424/germany-blames-trump-tariffs-for-zero-percent-growth-forecasts",
    "timestamp": "2025-04-24T12:42:37Z"
  },
  {
    "title": "Germany expects zero GDP growth this year, blames Trump tariffs",
    "description": "Germany’s economy is expected to post zero growth in 2025, outgoing Economy Minister Robert Habeck said Thursday, blaming US President Donald Trump’s trade policy. “The US trade policy of threatening and imposing tariffs has a direct impact on the German econ…",
    "link": "https://www.digitaljournal.com/world/germany-expects-zero-gdp-growth-this-year-blames-trump-tariffs-2/article",
    "timestamp": "2025-04-24T12:42:33Z"
  },
  {
    "title": "Shocking China statement sends markets tumbling",
    "description": "Bitcoin slips below $93K as uncertainty returns to global markets.",
    "link": "https://www.thestreet.com/crypto/policy/china-denies-trade-talks-with-u-s-sends-markets-lower",
    "timestamp": "2025-04-24T12:41:52Z"
  },
  {
    "title": "European Warmongers Undermine Trump’s Peace Efforts – Russian Foreign Intelligence",
    "description": "MOSCOW (Sputnik) - The Russian Foreign Intelligence Service (SVR) said on Thursday that it has information suggesting that new European warmongers are launching a campaign to undermine the peace efforts of US President Donald Trump.",
    "link": "https://sputnikglobe.com/20250424/european-warmongers-undermine-trumps-peace-efforts--russian-foreign-intelligence-1121926066.html",
    "timestamp": "2025-04-24T12:40:59Z"
  },
  {
    "title": "German economic forecast slashed to zero, outgoing minister blames Trump tariffs",
    "description": "The ministry’s projection is more closely aligned with the joint forecast by Germany’s leading economic research institutes, who foresee GDP growing by just 0.1%.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/german-economic-forecast-slashed-to-zero-outgoing-minister-blames-trump-tariffs/",
    "timestamp": "2025-04-24T12:40:43Z"
  },
  {
    "title": "Mexico’s Inflation Unexpectedly Ticked Up as Banxico Cuts Rates",
    "description": "Mexico’s annual inflation unexpectedly ticked up in the first two weeks of April while remaining within the central bank’s target range ahead of policymakers’ interest rate meeting next month.",
    "link": "https://financialpost.com/pmn/business-pmn/mexicos-inflation-unexpectedly-ticked-up-as-banxico-cuts-rates",
    "timestamp": "2025-04-24T12:40:36Z"
  },
  {
    "title": "Hounded by Wall Street, Trump tempers his populist rhetoric (Politico)",
    "description": "Politico:\nHounded by Wall Street, Trump tempers his populist rhetoric  —  The president has heard from all corners and appears to be listening.  At least a little.  —  Donald Trump has described his trade war as a bold effort to prioritize Main Street concern…",
    "link": "https://www.memeorandum.com/250424/p29",
    "timestamp": "2025-04-24T12:40:01Z"
  },
  {
    "title": "“Signs of recovery” for Shimano as component sales jump by 16% at start of 2025 – but Trump tariffs hitting consumer confidence in US, brand says",
    "description": "Shimano says retail sales in Europe have increased as demand “stabilised” after a sluggish 2024 compounded by the company’s costly crank recall programme",
    "link": "https://road.cc/content/news/signs-recovery-shimano-sales-rise-313683",
    "timestamp": "2025-04-24T12:39:46Z"
  },
  {
    "title": "Resistance Democrats embrace combative, profanity-laced 'dark woke' rebrand to combat Trump",
    "description": "Some members of the Democratic Party are using harsher, more profane language in line with the \"dark woke\" meme that has become popular online.",
    "link": "https://www.foxnews.com/media/resistance-democrats-embrace-combative-profanity-laced-dark-woke-rebrand-combat-trump",
    "timestamp": "2025-04-24T12:39:34Z"
  },
  {
    "title": "Markey: ‘Rubio Is Acting Unconstitutionally and Illegally on Behalf of Donald Trump’",
    "description": "Senator Ed Markey (D-MA) said Wednesday on MSNBC’s “All In” that Secretary of State Marco Rubio is acting “unconstitutionally and illegally” on behalf of President Donald Trump. Discussing Turkish national Rumeysa Ozturk, Markey said, “There have been no char…",
    "link": "https://freerepublic.com/focus/f-news/4312945/posts",
    "timestamp": "2025-04-24T12:39:20Z"
  },
  {
    "title": "72% of American Jews disapprove of Donald Trump’s performance so far, poll finds",
    "description": "The survey also said most American Jews dislike how Trump is handling antisemitism in the United States.",
    "link": "https://www.jpost.com/diaspora/article-851378",
    "timestamp": "2025-04-24T12:37:19Z"
  },
  {
    "title": "Trump Targets American Bar Association Accreditation Power – Something I’ve Advocated For Years",
    "description": "I've been arguing to strip the ABA of its near-monopoly accrediting power since 2022. I'm proud that I was against the ABA before it was cool to be against the ABA.\nThe post Trump Targets American Bar Association Accreditation Power – Something I’ve Advocated…",
    "link": "https://legalinsurrection.com/2025/04/trump-targets-american-bar-association-accreditation-power-something-ive-advocated-for-years/",
    "timestamp": "2025-04-24T12:35:21Z"
  },
  {
    "title": "Stock futures fall as China throws cold water on the market rally",
    "description": "Stock futures were slipping Thursday morning as the latest twist in U.S.-China relations took the air out of Wednesday’s rally. Beijing pushed back, saying there have been no trade talks — contrary to the hints and claims swirling stateside.Read more...",
    "link": "https://qz.com/djia-sp500-nasdaq-stocks-markets-china-tariffs-google-1851777632",
    "timestamp": "2025-04-24T12:35:00Z"
  },
  {
    "title": "Trump administration weighs investing in critical mineral companies, Interior Secretary says",
    "description": "China dumps critical minerals, collapsing prices and making it difficult for U.S. companies to compete, Interior Secretary Doug Burgum said.",
    "link": "https://www.cnbc.com/2025/04/24/trump-weighs-investments-in-critical-mineral-companies-burgum-says.html",
    "timestamp": "2025-04-24T12:34:39Z"
  },
  {
    "title": "Netanyahu expected in Baku as Azerbaijan eyes inclusion in Abraham Accords",
    "description": "The visit seeks to strengthen Israel’s regional position through mediation efforts with Turkey and by extending the Abraham Accords eastward.",
    "link": "https://www.jpost.com/middle-east/article-851376",
    "timestamp": "2025-04-24T12:33:37Z"
  },
  {
    "title": "Russia launches ‘massive’ attack on Kyiv as Trump touts ‘peace deal’",
    "description": "Russia launched one of its largest missile attacks on Ukraine’s capital city since its invasion in 2022.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/4/24/russia-launches-massive-attack-on-kyiv-as-trump-touts-peace",
    "timestamp": "2025-04-24T12:33:19Z"
  },
  {
    "title": "Bishop Strickland Issues Warning Over Next Pope: 'Simple Truth'",
    "description": "Strickland, a vocal critic of Pope Francis within the church, said he feared the conclave would elect another progressive pontiff.",
    "link": "https://www.newsweek.com/bishop-strickland-issues-warning-over-next-pope-simple-truth-2063429",
    "timestamp": "2025-04-24T12:32:52Z"
  },
  {
    "title": "FCC Boss Brendan Carr Whines About Accurate Comcast/NBC Reporting That Made Donald Trump Sad",
    "description": "There’s simply no limit of problems in telecom and media that competent FCC regulatorscouldbe taking aim at.Broadband price gouging by monopolies, widespreadtelecom privacy and security failures, the obvious harm ofunchecked media consolidationall come quickl…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177121371",
    "timestamp": "2025-04-24T12:32:23Z"
  },
  {
    "title": "Bribery, Rebranded",
    "description": "Donald Trump has attacked just about every institution in American life—from the courts to the press to the universities—but his knack for inventing new forms of corruption still manages to surprise. The New York Times",
    "link": "https://politicalwire.com/2025/04/24/bribery-rebranded/",
    "timestamp": "2025-04-24T12:32:09Z"
  },
  {
    "title": "Trump is putting his 'touches' on the White House with flagpoles, art and an Oval Office overhaul",
    "description": "Other changes include golden accents in the Oval Office and possibly paving over the lawn in the Kennedy-era Rose Garden.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_4a26b28d-e562-58d4-8aca-d40220e3df94.html",
    "timestamp": "2025-04-24T12:30:00Z"
  }
]