[
  {
    "title": "World Economies Brace For Trump Tariffs Ahead Of Deadline",
    "description": "World economies were jittery Monday ahead of US President Donald Trump's \"Liberation Day\" when he is set to unleash tariffs against multiple countries, risking global turmoil to redress what he says are unfair trade imbalances.",
    "link": "https://www.ibtimes.com/world-economies-brace-trump-tariffs-ahead-deadline-3768312",
    "timestamp": "2025-03-31T14:36:08Z"
  },
  {
    "title": "The CHIPS Act could be in danger due to mass layoff",
    "description": "Right now, all eyes are on chip manufacturers as the U.S. tries to completely own the chip market. The U.S. government is trying to move more",
    "link": "https://www.androidheadlines.com/2025/03/chips-act-danger-due-mass-layoff.html",
    "timestamp": "2025-03-31T14:35:43Z"
  },
  {
    "title": "How Oregon’s laws on forcing mental health treatment could change this year",
    "description": "The state has wrestled for years with ordering civil commitments for people with severe mental illness. Here’s what you need to know.",
    "link": "https://www.opb.org/article/2025/03/31/oregon-civil-commitment-laws-change/",
    "timestamp": "2025-03-31T14:32:50Z"
  },
  {
    "title": "Stocks Sink Again: Day Could End With Historically Bad March",
    "description": "March is shaping out to be the worst month for the S&P 500 since September 2022, erasing more than $3 trillion in market value.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/31/stocks-sink-again-day-could-end-with-historically-bad-march/",
    "timestamp": "2025-03-31T14:32:32Z"
  },
  {
    "title": "World economies brace for Trump tariffs ahead of deadline",
    "description": "World economies were jittery Monday ahead of US President Donald Trump’s “Liberation Day” when he is set to unleash tariffs against multiple countries, risking global turmoil to redress what he says are unfair trade imbalances. Trump — who has been making unp…",
    "link": "https://www.digitaljournal.com/world/world-economies-brace-for-trump-tariffs-ahead-of-deadline/article",
    "timestamp": "2025-03-31T14:32:21Z"
  },
  {
    "title": "Capital gains tax break for investing in Canada is a big idea that makes sense",
    "description": "Kim Moody: If we want to protect their prosperity and sovereignty, we will need to see past the performative polish of Carney. Read more",
    "link": "https://financialpost.com/personal-finance/capital-gains-tax-break-for-investing-in-canada-is-a-big-idea-that-makes-sense",
    "timestamp": "2025-03-31T14:32:19Z"
  },
  {
    "title": "NASA astronauts Butch Wilmore, Suni Williams give first interview since return to Earth in Fox News exclusive",
    "description": "NASA astronauts Butch Wilmore and Suni Williams, who spent nine months in space, spoke to Fox News anchor Bill Hemmer in their first interview since returning to Earth.",
    "link": "https://www.foxnews.com/media/nasa-astronauts-butch-wilmore-suni-williams-give-first-interview-since-return-earth-fox-news-exclusive",
    "timestamp": "2025-03-31T14:31:50Z"
  },
  {
    "title": "‘NOT JOKING’: Trump Outlines Potential Road to Third Term",
    "description": "President Donald Trump is “not joking” about seeking a third term in the Oval Office, he told NBC News Sunday morning. “There are methods which... Read More\nThe post ‘NOT JOKING’: Trump Outlines Potential Road to Third Term appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/31/not-joking-trump-outlines-potential-road-to-third-term/",
    "timestamp": "2025-03-31T14:31:06Z"
  },
  {
    "title": "Trump Says TikTok Has 'A Lot Of Potential Buyers,' Deal To Come Before Saturday Deadline",
    "description": "President Donald Trump told reporters on Sunday that an agreement to sell TikTok’s U.S. operations to a non-Chinese buyer is expected to be finalized before the April 5 deadline. \nThe Details: President Trump set the Saturday deadline for a sale in January un…",
    "link": "https://biztoc.com/x/fbd812895feb4d5b",
    "timestamp": "2025-03-31T14:30:45Z"
  },
  {
    "title": "Peskov: No Trump-Putin phone call currently on schedule",
    "description": "A new telephone call with US President Donald Trump is not on the agenda of Russian President Vladimir Putin, however, it can be quickly organized, Russian Presidential Spokesman Dmitry Peskov said on Monday, APA reports citing TASS. \"There is no such telepho…",
    "link": "https://freerepublic.com/focus/f-chat/4307892/posts",
    "timestamp": "2025-03-31T14:30:37Z"
  },
  {
    "title": "Here’s why Democrats think Elon Musk distributing millions in Wisconsin may benefit them: A look at voter sentiments",
    "description": "America PAC has funneled over $6 million into Schimel’s campaign efforts, while Musk himself has contributed $3 million to the state’s Republican Party.",
    "link": "https://economictimes.indiatimes.com/news/international/us/heres-why-democrats-think-elon-musk-distributing-millions-in-wisconsin-will-benefit-them-a-look-at-voter-sentiments/articleshow/119810636.cms",
    "timestamp": "2025-03-31T14:30:23Z"
  },
  {
    "title": "Trump discusses Iran, third term; Final Four matchups set | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_90da89c7-075f-5a75-8b01-7c6497b629f0.html",
    "timestamp": "2025-03-31T14:30:00Z"
  },
  {
    "title": "Trump discusses Iran, third term; Final Four matchups set | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_b9d7466c-f9a3-5e66-960b-d88a5a2d9e41.html",
    "timestamp": "2025-03-31T14:30:00Z"
  },
  {
    "title": "Sunita Williams and Barry Wilmore break their silence: Who’s really to blame for their 9-month space ordeal?",
    "description": "Astronauts Sunita Williams and Barry Wilmore were supposed to spend just over a week on the ISS but ended up staying nine months. They said multiple factors, including flawed testing and overlooked signals, caused the delay. Wilmore also acknowledged his own …",
    "link": "https://economictimes.indiatimes.com/magazines/panache/sunita-williams-and-barry-wilmore-break-their-silence-whos-really-to-blame-for-their-9-month-space-ordeal/articleshow/119810946.cms",
    "timestamp": "2025-03-31T14:28:24Z"
  },
  {
    "title": "White House Adds Right Wing Influencer Paid By The Russians To Press Pool",
    "description": "Hard to disagree with others that this is just another sign of the inherent corruption of the Trump administration. Imagine picking this guy, who the Russians were recently paying $400,000 a month over the Associated Press.\nSource: Daily Beast\nA right-wing in…",
    "link": "https://crooksandliars.com/2025/03/white-house-adds-right-wing-influencer",
    "timestamp": "2025-03-31T14:27:47Z"
  },
  {
    "title": "Polish PM Tusk makes last-ditch plea to avoid Trump’s tariffs",
    "description": "U.S. president is set to impose tariffs on EU goods on Wednesday.",
    "link": "https://www.politico.eu/article/poland-donald-tusk-make-last-ditch-plea-avoid-trump-tariffs/",
    "timestamp": "2025-03-31T14:26:28Z"
  },
  {
    "title": "Stock Markets Around The World Tumble As Trump's 'Liberation Day' Approaches",
    "description": "The U.S. stock market’s drops followed a sell-off that spanned the world earlier Monday as worries build over tariffs coming Wednesday from Trump.",
    "link": "https://www.huffpost.com/entry/stock-markets-tumble-trump-tariffs_n_67eaa443e4b0f26ae735d7bf",
    "timestamp": "2025-03-31T14:25:27Z"
  },
  {
    "title": "Apple's EU troubles just got $160 million worse",
    "description": "Just last month, we told you that Apple was on the verge of facing an antitrust fine in France over its privacy controls. Well, now it's official – the hammer has dropped.",
    "link": "https://www.phonearena.com/news/apple-eu-troubles-just-got-160-million-worse_id169043",
    "timestamp": "2025-03-31T14:23:43Z"
  },
  {
    "title": "South Africa’s Wrestling Match With Trump",
    "description": "With South Africa finding itself singled out by US President Donald Trump and those around him, the country’s ambitions for its G20 presidency now face major hurdles. Worse, because it must hand the G20 baton to the United States later this year, it has no ch…",
    "link": "https://www.project-syndicate.org/commentary/south-africa-trump-us-attacks-obstruction-at-the-g20-by-adekeye-adebajo-2025-03",
    "timestamp": "2025-03-31T14:23:05Z"
  },
  {
    "title": "Magnificent 7 stocks slide amid Trump tariff worries",
    "description": "The market’s highest-performing tech stocks all slid on Monday morning amid worries over President Donald Trump’s tariffs.Read more...",
    "link": "https://qz.com/magnificent-7-stocks-slide-trump-tariffs-tesla-nvidia-1851773474",
    "timestamp": "2025-03-31T14:23:00Z"
  },
  {
    "title": "Chella Man: I Am Choosing Deaf Trans Joy Without Conditions",
    "description": "\"My joy for being alive is not born out of resistance to any system, no matter who is in office,\" writes Chella Man.",
    "link": "https://time.com/7273059/chella-man-choosing-trans-joy-essay/",
    "timestamp": "2025-03-31T14:22:29Z"
  },
  {
    "title": "Russia: Supreme Court to consider suspending ban on Taliban",
    "description": "As Russia develops ties with the Taliban, the country is considering suspending the ban on the movement. The expected move, however, would not amount to a formal recognition of the Taliban government in Afghanistan.",
    "link": "https://www.dw.com/en/russia-supreme-court-to-consider-suspending-ban-on-taliban/a-72099620",
    "timestamp": "2025-03-31T14:22:00Z"
  },
  {
    "title": "Poland to sign air defence deal with US worth almost $2 billion",
    "description": "WARSAW (Reuters) - Poland and the United States will sign an agreement worth nearly $2 billion for the delivery of logistical support for the Patriot air defence system, Poland's defence minister said on Monday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/31/poland-to-sign-air-defence-deal-with-us-worth-almost-2-billion",
    "timestamp": "2025-03-31T14:22:00Z"
  },
  {
    "title": "I’m a Financial Planner: 4 Moves My Upper-Class Clients Are Making Under Trump",
    "description": "President Donald Trump’s second term is just getting started, but he’s already made some sweeping changes that have affected the economy and individuals’ wallets. To prepare for the next four years, many wealthy Americans are making money moves to ensure they…",
    "link": "https://biztoc.com/x/f7df70fe52e8da37",
    "timestamp": "2025-03-31T14:20:29Z"
  },
  {
    "title": "The Magnificent 7, automakers, Moderna, Warner Bros. Discovery, U.S. Bancorp: Stocks to watch today",
    "description": "In This Article:\nStocks fell on Monday after the Wall Street Journal reported that President Donald Trump has pushed his team to be more aggressive on tariffs in recent days. The S&P 500 fell 1.3%, the Nasdaq Composite 2.2%, and the Dow Jones Industrial Avera…",
    "link": "https://biztoc.com/x/2ea98d285b15b4fb",
    "timestamp": "2025-03-31T14:20:23Z"
  },
  {
    "title": "Poland, US To Sign Air Defence Deal Worth Nearly $2 Billion",
    "description": "Poland and the United States will sign an agreement worth nearly $2 billion for the delivery of logistical support for the Patriot air defence system, Poland&#039;s defence minister said on Monday.",
    "link": "https://www.ndtv.com/world-news/poland-us-to-sign-air-defence-deal-worth-nearly-2-billion-8054946",
    "timestamp": "2025-03-31T14:20:19Z"
  },
  {
    "title": "Trump Wants to Convince the World That Climate Change Is a Good Thing",
    "description": "The president, who regularly attacks renewable energy, is apparently ready to argue that climate change would benefit humans",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-convince-world-climate-change-good-1235306675/",
    "timestamp": "2025-03-31T14:20:17Z"
  },
  {
    "title": "People demanding Amazon Canada remove 'insulting' 51st state merch",
    "description": "Fed-up Canadians are taking a stand and calling on Amazon Canada to pull 51st-state merchandise being sold online.\r\nOn February 9, Thornbury, ON, resident Sue Williams-Dunn started a Change.org petition titled \"Urge Amazon to Discontinue Selling 'Canada, 51st…",
    "link": "https://dailyhive.com/canada/amazon-canada-51st-state-canada-merchandise",
    "timestamp": "2025-03-31T14:19:23Z"
  },
  {
    "title": "Justice Department instructed to dismiss legal challenge to Georgia election law",
    "description": "U.S. Attorney General Pam Bondi on Monday instructed the Justice Department to dismiss a lawsuit challenging a sweeping election overhaul that Georgia Republican lawmakers passed in the wake of President Donald Trump’s 2020 election loss in the state.",
    "link": "https://www.wsbtv.com/news/local/atlanta/justice-department-instructed-dismiss-legal-challenge-georgia-election-law/LK5L3RZOSNHUHOE6F6U27G4RSI/",
    "timestamp": "2025-03-31T14:15:35Z"
  },
  {
    "title": "White House plans to take over press room seating chart, likely boot legacy media farther back: report",
    "description": "It’s the Trump administration’s latest effort to shake up traditional media’s grip on White House coverage.",
    "link": "https://nypost.com/2025/03/31/business/white-house-plans-to-shake-up-press-room-seating-chart-likely-boot-legacy-media-further-back-report/",
    "timestamp": "2025-03-31T14:14:44Z"
  },
  {
    "title": "March 2025 in charts: Trump trade war hits Bitcoin, $22M in DeFi hacks",
    "description": "March was a rough month for markets — US President Donald Trump’s uncertain tariff policies created volatility in Bitcoin and crypto markets; meanwhile, decentralized finance (DeFi) struggled with security concerns.Retaliatory tariffs on US goods in China and…",
    "link": "https://cointelegraph.com/news/march-2025-charts-trump-bitcoin-defi-hacks",
    "timestamp": "2025-03-31T14:14:25Z"
  },
  {
    "title": "Trump 'Couldn't Care Less' If Tariffs Make Foreign Cars More Expensive",
    "description": "Tariff woes, praise for Trump from unlikely quarters, and an expensive shakeup in racing. It's all happening in The Morning Shift this merry Monday.",
    "link": "https://www.jalopnik.com/1823014/trump-couldnt-care-less-foreign-car-prices-after-tariffs/",
    "timestamp": "2025-03-31T14:14:14Z"
  },
  {
    "title": "Monday headlines: Eat, pray, shove",
    "description": "About 70 percent of adults in the United States say they are following news about the White House. / Pew Research\n\nThe administration plans to build a \"war-fighting headquarters\" in Japan to deter China. / NBC News\n\nDonald Trump says he is not joking about ru…",
    "link": "https://themorningnews.org/p/monday-headlines-eat-pray-shove",
    "timestamp": "2025-03-31T14:14:00Z"
  },
  {
    "title": "Trump’s Academic Purge Will Make America Stupid and Provincial Again",
    "description": "Jeet Heer\n\n\n\nThe administration’s targeting of international students is a return to a disgraced tradition of xenophobic anti-intellectualism.\r\n\n\r\n\n\nThe post Trump’s Academic Purge Will Make America Stupid and Provincial Again appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/trump-academic-purge/",
    "timestamp": "2025-03-31T14:13:27Z"
  },
  {
    "title": "'Scared and sick': Trump voters struggle to deal with tariff reality set to go into effect",
    "description": "CNN's John Berman asked conservative commentator Scott Jennings to explain in one sentence what he thinks President Donald Trump's tariff policy will look like when he announces it on April 2, adding, \"Do you think \n[the president] can explain it in one sente…",
    "link": "https://www.rawstory.com/trump-tariffs-2671642729/",
    "timestamp": "2025-03-31T14:13:25Z"
  },
  {
    "title": "Breakaway region in Africa rejects key port offer to US",
    "description": "Somaliland says strategic maritime assets in Berbera on the Gulf of Aden do not belong to Mogadishu Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/615024-somaliland-opposes-somalia-us-port-control-offer/",
    "timestamp": "2025-03-31T14:11:52Z"
  },
  {
    "title": "Congress Has a Choice on Sudan",
    "description": "Trump’s indifference and aid cuts are exacerbating the world’s largest humanitarian crisis.",
    "link": "http://foreignpolicy.com/2025/03/31/sudan-civil-war-humanitarian-aid-crisis-trump-congress/",
    "timestamp": "2025-03-31T14:10:49Z"
  },
  {
    "title": "Apple Is Being Forced To Pay A $162 Million Fine By A French Regulatory Authority After Advertisers Complained That They Cannot Access User Data To Serve Them Targeted Content",
    "description": "The App Tracking Transparency (ATT) tool that Apple unveiled in 2021 gives iPhone and iPad owners more freedom as they can now decide which apps can track their activity. While it does mean that users would be bombarded with fewer digital advertisements, the …",
    "link": "https://wccftech.com/apple-fined-162-million-by-french-regulator-because-advertisers-complained/",
    "timestamp": "2025-03-31T14:10:47Z"
  },
  {
    "title": "Democratic base’s anger puts some party leaders on shaky ground",
    "description": "The visceral anger among Democrats toward their party leaders is reaching new heights.",
    "link": "https://www.bostonherald.com/2025/03/31/us-democrats-backlash/",
    "timestamp": "2025-03-31T14:10:04Z"
  },
  {
    "title": "Maine residents agree with keeping trans athletes out of girls' and women's sports, poll shows",
    "description": "As Maine has come under fire over its transgender athlete policies, a new poll showed most residents agree that biological males shouldn't compete against girls and women.",
    "link": "https://www.foxnews.com/sports/maine-residents-agree-keeping-trans-athletes-out-girls-womens-sports-poll-shows",
    "timestamp": "2025-03-31T14:08:29Z"
  },
  {
    "title": "Top Putin Adviser Takes Victory Lap, Praises Trump in Shocking Interview with CNN’s Fareed Zakaria: ‘Putinism Has Won’",
    "description": "Aleksandr Dugin, \"Putin's brain,\" took a victory lap over the U.S.'s foreign policy inclinations under Donald Trump in a shocking interview with Fareed Zakaria.\nThe post Top Putin Adviser Takes Victory Lap, Praises Trump in Shocking Interview with CNN’s Faree…",
    "link": "https://www.mediaite.com/tv/top-putin-adviser-takes-victory-lap-praises-trump-in-shocking-interview-with-cnns-fareed-zakaria-putinism-has-won/",
    "timestamp": "2025-03-31T14:08:11Z"
  },
  {
    "title": "Tesla Insiders Are Dumping the Stock. Is It a Red Flag or a Red Herring?",
    "description": "Tesla (TSLA -5.33%) stock has been under enormous pressure in recent weeks. After surging in the aftermath of the U.S. presidential election on hopes that CEO Elon Musk's cozy relationship with President Donald Trump would lead to a windfall for the electric …",
    "link": "https://biztoc.com/x/e34d8a564a68c8f0",
    "timestamp": "2025-03-31T14:07:45Z"
  },
  {
    "title": "Tim Walz Concedes He’s Prone To Being A ‘Train Wreck’ As He Offers A Critique Of Democrats",
    "description": "Democratic Minnesota Gov. Tim Walz admitted he can sometimes be a \"train wreck\" because he speaks \"from the heart.\"",
    "link": "https://dailycaller.com/2025/03/31/tim-walz-concedes-hes-prone-to-being-a-train-wreck-as-he-offers-a-critique-of-democrats/",
    "timestamp": "2025-03-31T14:07:40Z"
  },
  {
    "title": "Apple hit with $162 million French antitrust fine over privacy tool",
    "description": "PARIS :Apple was hit with a 150 million euro ($162.4 million) fine by French antitrust regulators on Monday for abusing its dominant position in mobile app advertising on its devices via a privacy control tool.The fine - the first by any antitrust regulator o…",
    "link": "https://www.channelnewsasia.com/business/apple-hit-162-million-french-antitrust-fine-over-privacy-tool-5035241",
    "timestamp": "2025-03-31T14:06:30Z"
  },
  {
    "title": "'Should be embarrassing': GOP Congress shamed for letting Elon Musk take their jobs",
    "description": "Republicans in Congress aren't acting like they're a co-equal branch of government with the president, wrote Hayes Brown in a scathing analysis for MSNBC — and in fact, it's not just President Donald Trump they're surrendering constitutional powers to, but un…",
    "link": "https://www.rawstory.com/musk-constitutional-powers/",
    "timestamp": "2025-03-31T14:04:54Z"
  },
  {
    "title": "GOP Rep. Breaks Ranks With Trump And Co. In ABC Interview",
    "description": "The Republican lawmaker found the development \"surprising.\"",
    "link": "https://www.huffpost.com/entry/mike-turner-signal-group-chat-classified_n_67ea766ce4b008c5a2ec995d",
    "timestamp": "2025-03-31T14:04:33Z"
  },
  {
    "title": "Zelenskyy bows to pressure from Donald Trump and JD Vance; reports indicate Ukraine may hold elections this summer",
    "description": "Ukrainian President Volodymyr Zelenskyy may be preparing for elections this summer, a shift in stance attributed to international pressure from figures like Trump and Putin. A ceasefire expected by April's end could pave the way for polling in July 2025. The …",
    "link": "https://economictimes.indiatimes.com/news/international/us/zelenskyy-bows-to-pressure-from-donald-trump-and-jd-vance-reports-indicate-ukraine-may-hold-elections-this-summer/articleshow/119808991.cms",
    "timestamp": "2025-03-31T14:03:33Z"
  },
  {
    "title": "Universities in Iran Offers Entry to Pro-Hamas Students Deported from U.S.",
    "description": "The heads of Iranian universities issued a statement on Sunday welcoming students deported from America for supporting Hamas, an Iran-backed terrorist organization, or other jihadist movements.\nThe post Universities in Iran Offers Entry to Pro-Hamas Students …",
    "link": "https://www.breitbart.com/middle-east/2025/03/31/universities-in-iran-offers-entry-to-pro-hamas-students-deported-from-u-s/",
    "timestamp": "2025-03-31T14:01:13Z"
  },
  {
    "title": "It Is Basically Holistically Intuitive",
    "description": "To analyze society and the economy, and especially if the goal is to coerce peaceful individuals, an understanding of basic economics should be a must. Economics is needed to think clearly about the social consequences of individual actions and government int…",
    "link": "https://www.econlib.org/it-is-basically-holistically-intuitive/",
    "timestamp": "2025-03-31T14:00:44Z"
  },
  {
    "title": "Trump says reciprocal tariffs will 'start with all countries,' rejects narrower launch",
    "description": "Some Trump administration officials have suggested that the reciprocal tariffs would be focused on a handful of countries with large U.S. trade imbalances.",
    "link": "https://www.cnbc.com/2025/03/31/trump-tariffs-reciprocal-april-2.html",
    "timestamp": "2025-03-31T14:00:43Z"
  },
  {
    "title": "The SF Barber That Welcomes All Trans People Into His Shop",
    "description": "On Trans Day of Visibility, we visit Santana ‘Twinks’ Vasquez at Steel & Strand Barbershop in San Francisco, a safe space for queer and transgender people, and where trans men can get a free haircut.",
    "link": "https://www.kqed.org/news/12033501/the-sf-barber-that-welcomes-all-trans-people-into-his-shop",
    "timestamp": "2025-03-31T14:00:07Z"
  },
  {
    "title": "TRUMP GAMBLES WITH AMERICANS' FINANCES",
    "description": "President Donald Trump is set to gamble the success of his second term, the economy and the personal finances of millions of Americans this week on his long-held belief that tariffs can re-create a golden age of US wealth and independence.",
    "link": "https://www.cnn.com/2025/03/31/politics/trump-tariffs-liberation-day-risk/index.html",
    "timestamp": "2025-03-31T14:00:03Z"
  },
  {
    "title": "Catherine Rampell: DOGE Is Making Government “Comically Inefficient”",
    "description": "https://www.washingtonpost.com/opinions/2025/03/21/doge-government-efficiency-federal-workers/ A senior aide to President Donald Trump once said the administration hoped to traumatize civil servants, an objective it has handily accomplished through arbitrary …",
    "link": "https://dianeravitch.net/2025/03/31/catherine-rampell-doge-is-making-government-comically-inefficient/",
    "timestamp": "2025-03-31T14:00:00Z"
  },
  {
    "title": "TV Ad By Second Amendment Foundation Rallies Opposition To ‘Gun-Grabbers’",
    "description": "The Second Amendment Foundation (SAF), one leader in the battle to protect the right to keep and bear arms, has launched a new national television commercial aimed at rallying America behind President Donald Trump’s pro-Second Amendment agenda. In a press rel…",
    "link": "https://www.thetruthaboutguns.com/saf-tv-ad-campaign-supports-trump-second-amendment/",
    "timestamp": "2025-03-31T14:00:00Z"
  },
  {
    "title": "Trump Threatens Russia With Oil Tariffs",
    "description": "US President Donald Trump threatened Russia with new tariffs on oil products if Moscow blocks his cease-fire initiatives, while he also said Ukrainian leader Volodymyr Zelenskyy faces \"big, big problems\" if he doesn't sign a key minerals deal with Washington.…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Trump-Threatens-Russia-With-Oil-Tariffs.html",
    "timestamp": "2025-03-31T14:00:00Z"
  },
  {
    "title": "Transgender people are about 1% of the U.S. population. Yet they’re a political lightning rod",
    "description": "On the campaign trail, Donald Trump used contentiousness around transgender people’s access to sports and bathrooms to fire up conservative voters and sway undecideds.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/transgender-people-are-1-us-population-yet-re-political-lightning-rod-rcna198852",
    "timestamp": "2025-03-31T13:57:50Z"
  },
  {
    "title": "BNB Chain catches memecoin wave as Solana wipes out",
    "description": "BNB Chain, the EVM-compatible network tied to cryptocurrency exchange Binance, is experiencing a resurgence in the decentralized finance (DeFi) and memecoin spaces just as some of its rivals face an identity crisis.For most of 2024 and into early 2025, Solana…",
    "link": "https://cointelegraph.com/news/bnb-chain-memecoin-wave-solana",
    "timestamp": "2025-03-31T13:57:44Z"
  },
  {
    "title": "Wisconsin Supreme Court Race: Why Elon Musk And Fellow Billionaires Are Spending Millions On Tuesday’s Election",
    "description": "Musk claimed at a rally Sunday the race would \"affect the entire destiny of humanity.\"",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/31/wisconsin-supreme-court-race-why-elon-musk-and-fellow-billionaires-are-spending-millions-on-tuesdays-election/",
    "timestamp": "2025-03-31T13:57:34Z"
  },
  {
    "title": "Trump Family Starts Bitcoin Mining Venture in Further Push Into Crypto",
    "description": "Eric Trump and Donald Trump Jr. are investing in a Bitcoin-mining company called American Bitcoin, created by the merger of two firms.",
    "link": "https://biztoc.com/x/6d78709613d58ca2",
    "timestamp": "2025-03-31T13:57:02Z"
  },
  {
    "title": "Stocks tumble ahead of Wednesday's 'liberation day' tariffs announcement",
    "description": "Markets tumbled as trading opened Monday morning, with investors continuing to unload holdings in anticipation of President Donald Trump \"Liberation Day\" tariffs announcement Wednesday.",
    "link": "https://biztoc.com/x/85245515481a7edd",
    "timestamp": "2025-03-31T13:56:49Z"
  },
  {
    "title": "Trump sons launch new Bitcoin mining business called ‘American Bitcoin’",
    "description": "Hut 8, a publicly traded Bitcoin mining company, announced Monday morning that it was partnering with President Donald Trump’s sons, Eric Trump and Donald Trump Jr., to launch a new Bitcoin mining subsidiary called American Bitcoin. The public company, whose …",
    "link": "https://biztoc.com/x/e7fc679a7a703905",
    "timestamp": "2025-03-31T13:56:44Z"
  },
  {
    "title": "Israel tells Palestinians to evacuate Rafah amid new proposed hostage deal",
    "description": "Israel has proposed an extended truce in Gaza in exchange for the return of about half the remaining hostages, Israeli officials said on Monday, as the military issued new evacuation orders and said \"intense operations\" were planned in the south of the enclav…",
    "link": "https://www.cbc.ca/news/world/gaza-evacuation-orders-1.7497781",
    "timestamp": "2025-03-31T13:56:08Z"
  },
  {
    "title": "Conservative backlash erupts after Trump's Graham endorsement: 'I am not with Trump at all with this one'",
    "description": "Conservative backlash erupted after President Donald Trump endorsed Republican Sen. Lindsey Graham of South Carolina for re-election.",
    "link": "https://www.foxnews.com/politics/conservative-backlash-erupts-after-trumps-graham-endorsement-i-am-not-trump-all-one",
    "timestamp": "2025-03-31T13:54:07Z"
  },
  {
    "title": "U.S. stocks erase losses as tariffs keep markets on edge",
    "description": "U.S. stocks swung wildly Monday, with the S&ampamp;P 500 Index erasing what had been a steep drop as worries flared about Trump’s tariffs. Read on",
    "link": "https://financialpost.com/news/us-stocks-swoon-as-trump-sows-economic-fear-across-wall-street",
    "timestamp": "2025-03-31T13:53:48Z"
  },
  {
    "title": "US Stocks Swoon as Trump Sows Economic Fear Across Wall Street",
    "description": "The US stock market rout intensified on Monday on fears that President Donald Trump’s next tariff rollout will deliver a shock to the global economy, with rising recession concerns leaving the S&P 500 Index on track for its worst quarter compared to the rest …",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-swoon-as-trump-sows-economic-fear-across-wall-street",
    "timestamp": "2025-03-31T13:53:48Z"
  },
  {
    "title": "Liberal internationalism after USAID",
    "description": "As US aid falters, the crisis of liberal internationalism deepens. What comes next when even its strongest institutions can no longer hold the facade together?",
    "link": "https://africasacountry.com/2025/03/liberal-internationalism-after-usaid/",
    "timestamp": "2025-03-31T13:53:34Z"
  },
  {
    "title": "Russia-linked Gamaredon targets Ukraine with Remcos RAT",
    "description": "Russia-linked Gamaredon targets Ukraine with a phishing campaign using troop-related lures to deploy the Remcos RAT via PowerShell downloader. Talos researchers warn that Russia-linked APT group Gamaredon (a.k.a. Armageddon, Primitive Bear, ACTINIUM, Callisto…",
    "link": "https://securityaffairs.com/176057/cyber-warfare-2/russia-linked-gamaredon-targets-ukraine-with-remcos-rat.html",
    "timestamp": "2025-03-31T13:52:32Z"
  },
  {
    "title": "NVIDIA (NVDA) Stands Strong Amid Geopolitical Concerns with AI Chip Market Recovery",
    "description": "We recently published a list of 10 AI Stocks Dominating the News This Week. In this article, we are going to take a look at where NVIDIA Corporation...",
    "link": "https://finance.yahoo.com/news/nvidia-nvda-stands-strong-amid-135225980.html",
    "timestamp": "2025-03-31T13:52:25Z"
  },
  {
    "title": "Microsoft (MSFT) Expands AI-Driven Security Copilot with Six New Agents",
    "description": "We recently published a list of 10 AI Stocks Dominating the News This Week. In this article, we are going to take a look at where Microsoft Corporation...",
    "link": "https://finance.yahoo.com/news/microsoft-msft-expands-ai-driven-135156481.html",
    "timestamp": "2025-03-31T13:51:56Z"
  },
  {
    "title": "Amazon (AMZN) Taps into Generative AI for Retail Media and Advertising Growth",
    "description": "We recently published a list of 10 AI Stocks Dominating the News This Week. In this article, we are going to take a look at where Amazon.com, Inc...",
    "link": "https://finance.yahoo.com/news/amazon-amzn-taps-generative-ai-135140574.html",
    "timestamp": "2025-03-31T13:51:40Z"
  },
  {
    "title": "Why Trans People Must Prove a History of Discrimination Before the Supreme Court",
    "description": "From criminal cross-dressing laws to bans on open military service, the government has long sanctioned discrimination against trans people.",
    "link": "https://time.com/7272976/trans-people-prove-discrimination-supreme-court/",
    "timestamp": "2025-03-31T13:51:29Z"
  },
  {
    "title": "FCC to Investigate ABC News’ Parent Company, Disney Over its D.E.I. Efforts",
    "description": "FCC chair sent a letter to Disney’s CEO claiming its D.E.I efforts “infected many aspects of your company’s decisions.",
    "link": "https://www.adweek.com/tvnewser/fcc-to-investigate-abc-news-parent-company-disney-over-its-dei-efforts/",
    "timestamp": "2025-03-31T13:50:39Z"
  },
  {
    "title": "Trump asks justices to intervene on Alien Enemies Act removals (UPDATED) Amy Howe analyzes Trump ’emergency request’ to John Roberts.",
    "description": "The Trump administration came to the Supreme Court on Friday morning, asking the justices to allow it to enforce an executive order that directs government officials to quickly remove, without a hearing, noncitizens who are designated as members of a Venezuel…",
    "link": "https://freerepublic.com/focus/f-chat/4307886/posts",
    "timestamp": "2025-03-31T13:50:18Z"
  },
  {
    "title": "Trump Tells NBC He’s ‘Not Joking’ About A Third Term In Office",
    "description": "Trump told NBC's Kristen Welker that \"there are methods\" that would allow him to seek a third term, saying that \"a lot of people want me to do it.\"",
    "link": "https://www.forbes.com/sites/markjoyella/2025/03/31/trump-tells-nbc-hes-not-joking-about-a-third-term-in-office/",
    "timestamp": "2025-03-31T13:50:06Z"
  },
  {
    "title": "US CHIPS Act Getting Scrapped By Trump Administration Now Looks Imminent; Over 80% of Staff Laid Off, Courtesy of Elon’s DOGE",
    "description": "Well, it seems like the US's CHIPS Act incentive might just see its demise under the current government, as it is claimed that the brains behind it have either left or got fired by DOGE. Trump Previously Claimed the CHIPS Act Has Given Hundreds of Billions To…",
    "link": "https://wccftech.com/us-chips-act-getting-scrapped-by-trump-administration-looks-imminent/",
    "timestamp": "2025-03-31T13:46:06Z"
  },
  {
    "title": "Germany's inflation fell in March but trade conflicts cloud horizon",
    "description": "Inflation dropped slightly in Germany last month, maintaining a rate just above two percent. But with further US tariffs expected, and the possibility of an escalating trade war, the economic outlook is anything but stable.",
    "link": "https://www.thelocal.de/20250331/germanys-inflation-fell-in-march-but-trade-conflicts-cloud-horizon",
    "timestamp": "2025-03-31T13:45:44Z"
  },
  {
    "title": "‘Full-Blown Panic Mode’: Fox Anchor Confronts Trump Ally Donalds Over Razor-Thin Race to Replace Waltz",
    "description": "Fox News anchor Shannon Bream confronted Rep. Byron Donalds (R-FL) over reports the GOP is in \"full-blown panic mode\" over a special election.\nThe post ‘Full-Blown Panic Mode’: Fox Anchor Confronts Trump Ally Donalds Over Razor-Thin Race to Replace Waltz firs…",
    "link": "https://www.mediaite.com/news/full-blown-panic-mode-fox-anchor-confronts-trump-ally-donalds-over-razor-thin-race-to-replace-waltz/",
    "timestamp": "2025-03-31T13:45:44Z"
  },
  {
    "title": "Finland's Stubb: Trump running out of patience with Putin",
    "description": "Finland's President Alexander Stubb said on Monday that his American counterpart Donald Trump is the only person who can secure a ceasefire in Ukraine, stressing that the US leader is \"running out of ...",
    "link": "https://biztoc.com/x/9489a52750633647",
    "timestamp": "2025-03-31T13:45:32Z"
  },
  {
    "title": "XRP bulls in ‘denial’ as price trend mirrors previous 75-90% crashes",
    "description": "XRP (XRP) has lost more than 40% since hitting a multi-year high near $3.40 in January, and onchain data suggests the downtrend could deepen in the weeks ahead.“Denial” preceding past 75-90% XRP crashes is back\r\nXRP’s Net Unrealized Profit/Loss (NUPL) data fr…",
    "link": "https://cointelegraph.com/news/xrp-bulls-denial-price-trend-mirrors-75-90-crashes",
    "timestamp": "2025-03-31T13:45:00Z"
  },
  {
    "title": "Wall Street is fed up with Trump’s tariffs. Stocks are off to their worst start to a year since 2020",
    "description": "As Wall Street heads into a new quarter, a flurry of President Donald Trump’s tariffs are set to go into effect. That has traders on edge and has helped put US stocks in their worst first-quarter slump in years.",
    "link": "https://www.cnn.com/2025/03/31/investing/us-stocks-trump-tariff-uncertainty/index.html",
    "timestamp": "2025-03-31T13:43:14Z"
  },
  {
    "title": "'Breaking point': Ex-staffer pens brutal takedown of former boss Chuck Schumer",
    "description": "Leah Juliett, a former staffer for Sen. Chuck Schumer (D-NY), is trashing their one-time boss with an editorial in Teen Vogue that argues he's killing the party's reputation among young voters.In fact, Juliett believes that they're hardly alone among people i…",
    "link": "https://www.rawstory.com/chuck-schumer-2671642169/",
    "timestamp": "2025-03-31T13:40:21Z"
  },
  {
    "title": "“Make America Healthy Again”: The new Lysenkoism",
    "description": "Trofim Lysenko was a Soviet scientist whose dogmatic science denialism led to mass famine when his ideas were applied to agriculture. Robert F. Kennedy Jr. is a lot like Lysenko in his science denial. Will his results be as disastrous?\nThe post “Make America …",
    "link": "https://sciencebasedmedicine.org/make-america-healthy-again-the-new-lysenkoism/",
    "timestamp": "2025-03-31T13:40:00Z"
  },
  {
    "title": "Why Trump Says He’s ‘Not Joking’ About a Third Term",
    "description": "The prospect of smashing imagined limits on his power gives him an obvious thrill.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/trump-third-term/682243/",
    "timestamp": "2025-03-31T13:39:44Z"
  },
  {
    "title": "Democratic Senator Rips Intelligence Chiefs, Accuses Them Of Lying To Congress",
    "description": "Director of National Intelligence Tulsi Gabbard and CIA Director John Ratcliffe claimed the information shared on the Signal group chat was not classified.",
    "link": "https://www.huffpost.com/entry/michael-bennet-slams-gabbard-ratcliffe_n_67ea7189e4b0e18ce525f7ab",
    "timestamp": "2025-03-31T13:39:07Z"
  },
  {
    "title": "With his choice for drug czar, Trump adds to his team of Fox-affiliated amateurs",
    "description": "Donald Trump's drug czar nominee does not have background in drug policy, public health, law enforcement or government service. But she was on Fox News.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/choice-drug-czar-trump-adds-team-fox-affiliated-amateurs-rcna198843",
    "timestamp": "2025-03-31T13:39:04Z"
  },
  {
    "title": "US Black Women Now Have Lower Fertility Rate Than White Women",
    "description": "Something historic just happened — and unless you’re a demographer or a data nerd, you might’ve missed it. For the first time in recorded U.S. history, the Black fertility rate has dropped below the White fertility rate. Yep, you read that right. According to…",
    "link": "https://mediatakeout.com/us-black-women-have-lower-fertility-rate-than-white-women/",
    "timestamp": "2025-03-31T13:37:43Z"
  },
  {
    "title": "Stocks tumble ahead of Wednesday's 'liberation day' tariffs announcement",
    "description": "Markets tumbled as trading opened Monday morning, with investors continuing to unload holdings in anticipation of President Donald Trump \"Liberation Day\" tariffs announcement Wednesday.",
    "link": "https://www.nbcnews.com/business/markets/stocks-tumble-ahead-wednesdays-liberation-day-tariffs-announcement-rcna198833",
    "timestamp": "2025-03-31T13:37:43Z"
  },
  {
    "title": "Trump Approval Rating Tracker: 60% Unhappy About Tariffs",
    "description": "The latest survey, released March 31, show 56% disapprove of Trump's job performance.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/31/trump-approval-rating-tracker-60-unhappy-about-tariffs/",
    "timestamp": "2025-03-31T13:36:48Z"
  },
  {
    "title": "Trump ‘couldn’t care less’ about tariff-driven car price hikes",
    "description": "The US president is set to impose an additional 25% tariff on auto imports this week Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615012-trump-car-imports-tariffs/",
    "timestamp": "2025-03-31T13:36:31Z"
  },
  {
    "title": "CoffeeLoader uses a GPU-based packer to evade detection",
    "description": "CoffeeLoader is a sophisticated malware that uses numerous techniques to bypass security solutions, Zscaler ThreatLabz warns. Zscaler ThreatLabz discovered CoffeeLoader, a malware family active since September 2024, that uses multiple techniques to evade endp…",
    "link": "https://securityaffairs.com/176046/malware/coffeeloader-is-a-sophisticated-malware.html",
    "timestamp": "2025-03-31T13:35:30Z"
  },
  {
    "title": "Chuck Todd Issues ‘Warning’ To Kamala Harris About Political Future",
    "description": "Political analyst Chuck Todd cautioned former Vice President Kamala Harris about running for California governor in 2026.",
    "link": "https://dailycaller.com/2025/03/31/chuck-todd-issues-warning-kamala-harris-about-political-future/",
    "timestamp": "2025-03-31T13:34:57Z"
  },
  {
    "title": "Third Term",
    "description": "\"I'm not joking,\" said President Donald Trump to NBC this past weekend, referring to his talk of seeking a third term. \n\"A lot of people want me to do it,\" said Trump on the air. \"But I mean, I basically tell them we have a long way to go, you know, it's very…",
    "link": "https://biztoc.com/x/391d7089c660ef09",
    "timestamp": "2025-03-31T13:34:10Z"
  },
  {
    "title": "Eric Adams pushes judge to dismiss charges before ballot deadline",
    "description": "New York City Mayor Eric Adams asked a federal judge on Monday to drop criminal corruption charges before a political deadline this week.",
    "link": "https://abcnews.go.com/Politics/eric-adams-pushes-judge-dismiss-charges-ballot-deadline/story?id=120329624",
    "timestamp": "2025-03-31T13:33:58Z"
  },
  {
    "title": "‘Have you seen their car?’: When Elon Musk openly laughed at BYD. A mockery that didn’t age well",
    "description": "In 2024, BYD overtook Tesla in global electric vehicle sales. BYD reported higher annual revenue than Tesla. While Tesla faced brand perception issues and public backlash due to Elon Musk’s political ties, BYD focused on innovation and market expansion. BYD's…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/have-you-seen-their-car-when-elon-musk-openly-laughed-at-byd-a-mockery-that-didnt-age-well/articleshow/119808617.cms",
    "timestamp": "2025-03-31T13:33:47Z"
  },
  {
    "title": "Can Trump serve a third term as US president? - BBC.com",
    "description": "Can Trump serve a third term as US president?BBC.com Donald Trump criticized for suggesting there are ‘methods’ for a third term – US politics liveThe Guardian US Trump says he’s considering ways to serve a third term as presidentThe Associated Press Trump is…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176872763",
    "timestamp": "2025-03-31T13:32:59Z"
  },
  {
    "title": "Micheál Martin said the European Union will be 'strategic' in its response if US President Donald Trump launches a trade war",
    "description": "Micheál Martin said the European Union will be 'strategic' in its response if US President Donald Trump launches a trade war",
    "link": "https://www.independent.ie/irish-news/micheal-martin-said-the-european-union-will-be-strategic-in-its-response-if-us-president-donald-trump-launches-a-trade-war/a1193706817.html",
    "timestamp": "2025-03-31T13:32:48Z"
  }
]