[
  {
    "title": "Bill strengthening immigrant protections advances in Colorado legislature",
    "description": "Legislation which further insulates state and local officials from ICE enforcement and denotes public buildings where Colorado immigrants can seek temporary refuge from federal immigration agents advanced on a preliminary vote.",
    "link": "https://www.cbsnews.com/colorado/news/bill-strengthening-immigrant-protections-advances-colorado-legislature/",
    "timestamp": "2025-05-03T04:23:11Z"
  },
  {
    "title": "Tariffs on car parts entering the US come into force",
    "description": "Import taxes were eased after carmaker outcry,  but it's \"still a big tariff\", analysts say.",
    "link": "https://www.bbc.com/news/articles/c4grdke5r1jo",
    "timestamp": "2025-05-03T04:21:26Z"
  },
  {
    "title": "NPR stations targeted for cuts by Trump have provided lifelines to listeners during disasters",
    "description": "After Hurricane Helene devastated Asheville, North Carolina, the sound coming from open car windows as residents gathered on a street at the top of a ridge...",
    "link": "https://www.yahoo.com/news/npr-stations-targeted-cuts-trump-041856029.html",
    "timestamp": "2025-05-03T04:18:56Z"
  },
  {
    "title": "News Summary-Intelligence Report 5/2/2025*Newsdump Friday*Israeli Attacks In Syria*Trump Budget Plan*Gaza Aid Ship Attacked*German Opposition Designated \"Right-Wing Extremist\"*Russell Brand In Court*Reform UK's Big Win*",
    "description": "a US-Israeli plan emerging to provide humanitarian... \"I campaigned for no more foreign wars. And now we are supposedly on the verge of going to war with Iran\" Marjorie Taylor Greene... A 'settlement in principle' between the US Justice Department and the fam…",
    "link": "https://freerepublic.com/focus/f-bloggers/4314778/posts",
    "timestamp": "2025-05-03T04:16:00Z"
  },
  {
    "title": "Trump's tariff on cheap chinese imports will cost big tech billions",
    "description": "The elimination of a tariff loophole that benefited Temu and Shein has led to a significant reduction in their online advertising spending. This shift is impacting tech giants like Meta and Alphabet, who previously enjoyed a windfall from these retailers' agg…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariff-on-cheap-chinese-imports-will-cost-big-tech-billions/articleshow/120841900.cms",
    "timestamp": "2025-05-03T04:15:51Z"
  },
  {
    "title": "US state dept okays possible arms sale to Ukraine",
    "description": "This sale is an actual weapons deal whose principal contractors include Lockheed Martin Aeronautics, BAE Systems and AAR Corporation, the Pentagon said.>WASHINGTON: The US state department has approved the potential sale of F-16 training and sustainment, alon…",
    "link": "https://freerepublic.com/focus/f-chat/4314776/posts",
    "timestamp": "2025-05-03T04:09:06Z"
  },
  {
    "title": "Google plans to roll out its AI chatbot to children under 13",
    "description": "Google will launch its Gemini AI chatbot for children under 13 with parent-managed accounts next week. Aimed at helping with homework and creativity, Gemini includes safety filters. Parents can control access and settings. Despite safeguards, concerns remain …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/google-plans-to-roll-out-its-ai-chatbot-to-children-under-13/articleshow/120841838.cms",
    "timestamp": "2025-05-03T04:07:00Z"
  },
  {
    "title": "US Vice President JD Vance's global travels are a mix of diplomacy, dealmaking, soft power and family time",
    "description": "Vice President JD Vance is actively involved in international diplomacy. He travels extensively with his family. Vance meets with world leaders and delivers speeches promoting US policy. His trips include cultural visits to iconic sites like the Taj Mahal. Th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-vice-president-jd-vances-global-travels-are-a-mix-of-diplomacy-dealmaking-soft-power-and-family-time/articleshow/120841835.cms",
    "timestamp": "2025-05-03T04:06:52Z"
  },
  {
    "title": "'Do I Look Like I Care?': AOC Shreds Trump's Border Czar In Blunt Free Speech Reminder",
    "description": "The congresswoman slammed Tom Homan after he claimed she could be in \"trouble\" over her \"know your rights\" advice.",
    "link": "https://www.huffpost.com/entry/aoc-alexandria-ocasio-cortez-trump-tom-homan-immigration_n_68155361e4b08215e5f69edd",
    "timestamp": "2025-05-03T04:04:36Z"
  },
  {
    "title": "Trump Posting Apparent AI Photo of Himself as the Pope Takes Off Online",
    "description": "The president posted the photo Friday night with no caption and it has since sparked praise and backlash.",
    "link": "https://www.newsweek.com/trump-posting-apparent-ai-photo-himself-pope-takes-off-online-2067617",
    "timestamp": "2025-05-03T04:02:35Z"
  },
  {
    "title": "Not your grandfather’s steel industry",
    "description": "When Barack Obama said manufacturing jobs aren’t coming back, he forgot to tell J.D. Vance.\r\n\r\nOn Thursday, Vance told Fox News’s Bret Baier he was shocked at the level of next-generation technology he saw at a South Carolina st...",
    "link": "https://www.americanthinker.com/blog/2025/05/not_your_grandfather_s_steel_industry.html",
    "timestamp": "2025-05-03T04:00:00Z"
  },
  {
    "title": "Civil rights? Not this Civil Rights Division!",
    "description": "Perhaps the worst, most hostile and weaponized division of the Department of Justice (DOJ) under Biden’s Handlers was the Civil Rights Division (CRD).  Charged with enforcing America’s civil rights laws, it became a hotbed of le...",
    "link": "https://www.americanthinker.com/blog/2025/05/civil_rights_not_this_civil_rights_division.html",
    "timestamp": "2025-05-03T04:00:00Z"
  },
  {
    "title": "Cutting China and WHO down to size starts with U.S. vape reform",
    "description": "Amid the ongoing tariff war between President Donald Trump and Chinese president Xi Jinping, another critical front is emerging -- one with serious implications for more than 20 million American adults: the battle to lead in the manufacturing of toba...",
    "link": "https://www.americanthinker.com/blog/2025/05/cutting_china_and_who_down_to_size_starts_with_u_s_vape_reform.html",
    "timestamp": "2025-05-03T04:00:00Z"
  },
  {
    "title": "Trump does these things because they are hard",
    "description": "I’ve seen the whole gamut of reports and analysis of Trump 47’s first 100 days.  The left are apoplectic and describe it in Machiavellian terms: Trump is an authoritarian, Elon Musk is a Nazi, economic Armageddon, a constitution...",
    "link": "https://www.americanthinker.com/blog/2025/05/trump_does_these_things_because_they_are_hard.html",
    "timestamp": "2025-05-03T04:00:00Z"
  },
  {
    "title": "Across the great divide: Trump rides the Crimson Tide in Alabama as Kamala emerges to split opinion again",
    "description": "One speech of condemnation and another full of braggadocio underscore where US is at after president’s first 100 days",
    "link": "https://www.irishtimes.com/world/us/2025/05/03/across-the-great-divide-trump-rides-the-crimson-tide-in-alabama-as-kamala-emerges-to-split-opinion-again/",
    "timestamp": "2025-05-03T04:00:00Z"
  },
  {
    "title": "Trump goes trolling with an AI-generated image of himself dressed as pope and the left has a cow",
    "description": "Sometimes, Trump is just playin' around.\r\n\r\nAnd when he does, the left has a cow -- and then he kicks back and enjoys it.\r\n\r\nYou'd think they'd know enough not to take the bait by now ... but they don't.\r\n\r\nSo now we have this:\r\n\r\n\r\n\r...",
    "link": "https://www.americanthinker.com/blog/2025/05/trump_trolls_the_left_with_an_ai_generated_image_of_himself_dressed_as_pope_and_the_left_has_a_cow.html",
    "timestamp": "2025-05-03T04:00:00Z"
  },
  {
    "title": "Trump says US in transition period, downplays impact of short-term recession",
    "description": "President Trump acknowledged the U.S. economy is in a \"transition period,\" expressing optimism for future performance despite concerns about a potential short-term recession. He cited strong employment figures and reiterated his call for the Federal Reserve t…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-says-us-in-transition-period-downplays-impact-of-short-term-recession/articleshow/120841653.cms",
    "timestamp": "2025-05-03T03:49:23Z"
  },
  {
    "title": "Trading Day: Resilience trumps uncertainty",
    "description": "Despite a surprising U.S. economic contraction in the first quarter, global markets showed resilience, with stocks rising and volatility easing. Positive Eurozone GDP and a strong U.S. jobs report boosted sentiment, overshadowing corporate concerns about tari…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trading-day-resilience-trumps-uncertainty/articleshow/120841584.cms",
    "timestamp": "2025-05-03T03:44:21Z"
  },
  {
    "title": "5 world market themes for the week ahead",
    "description": "Global markets brace for a busy week. The Federal Reserve leads central bank meetings amid economic concerns. China's trade data will reveal tariff impacts. Elections in Australia, Singapore, and Romania could shift political landscapes. UK shows positive tre…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/120841562.cms",
    "timestamp": "2025-05-03T03:41:51Z"
  },
  {
    "title": "Wall St Week Ahead-Fed outlook in focus as US stocks rally picks up steam",
    "description": "The Federal Reserve meeting will assess the recent stock market recovery. Investors hope for interest rate cuts. Stocks recovered after President Trump's tariffs caused a slump. The Fed is expected to hold rates steady. Market anticipates potential rate cuts.…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-fed-outlook-in-focus-as-us-stocks-rally-picks-up-steam/articleshow/120841530.cms",
    "timestamp": "2025-05-03T03:40:12Z"
  },
  {
    "title": "Singapore votes with new PM seeking strong mandate amid tariff turmoil",
    "description": "Singaporeans cast their votes Saturday in an election where Prime Minister Lawrence Wong faces his first major test against a rejuvenated opposition in uncertain economic times for the trade-centred nation. Wong has repeatedly said he needed a strong mandate …",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/singapore-votes-with-new-pm-seeking-strong-mandate-amid-tariff-turmoil/articleshow/120841333.cms",
    "timestamp": "2025-05-03T03:40:09Z"
  },
  {
    "title": "Trump's Next 100 Days: Now Comes The Hard Part",
    "description": "President Donald Trump spent his first 100 days issuing a blitz of executive orders to deliver rapidly on campaign pledges, drastically downsize the government and reshape America&#039;s role on the global stage.",
    "link": "https://www.ndtv.com/world-news/trumps-next-100-days-now-comes-the-hard-part-8317857",
    "timestamp": "2025-05-03T03:39:38Z"
  },
  {
    "title": "‘A Supply Problem, Not A Demand Problem’: Tucker Carlson Reveals What Changed His Mind About US Drug Policy",
    "description": "Tucker Carlson said Friday on his show that he’s changed his perspective on U.S. drug policy, arguing the issue stems from supply, not demand.",
    "link": "https://dailycaller.com/2025/05/02/tucker-carlson-drug-policy-united-states-chris-cella/",
    "timestamp": "2025-05-03T03:36:13Z"
  },
  {
    "title": "What You Need To Know About Australia's Upcoming Election",
    "description": "Opinion polls indicate Prime Minister Anthony Albanese&#039;s ruling centre-left Labor party is ahead of the conservative Liberal-National coalition.",
    "link": "https://www.ndtv.com/world-news/what-you-need-to-know-about-australias-upcoming-election-opinion-polls-show-anthony-albanese-party-ahead-8317848",
    "timestamp": "2025-05-03T03:35:30Z"
  },
  {
    "title": "White House 2026 budget plan includes call to cut low-income energy assistance program",
    "description": "In the proposed budget, President Trump's administration is looking to not only cut funding for the Low-Income Home Energy Assistance Program, but eliminate the program altogether.",
    "link": "https://www.wmur.com/article/white-house-2026-budget-plan-energy-assistance-cuts/64659496",
    "timestamp": "2025-05-03T03:34:34Z"
  },
  {
    "title": "Trump plans to cut 1,200 jobs from CIA, other US spy agencies: Report",
    "description": "Cuts will reportedly take place over several years and be accomplished through reduced hiring as opposed to layoffs.",
    "link": "https://www.aljazeera.com/news/2025/5/3/trump-plans-to-cut-1200-jobs-from-cia-other-us-spy-agencies-report",
    "timestamp": "2025-05-03T03:34:28Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Secures Agreement to Establish United States-Ukraine Reconstruction Investment Fund",
    "description": "A FIRST-OF-ITS-KIND HISTORIC PARTNERSHIP: Under the leadership of President Donald J. Trump, the US and Ukraine entered into a historic agreement on April 30, launching a first-of-its-kind partnership for the reconstruction and long-term economic success of U…",
    "link": "https://freerepublic.com/focus/f-chat/4314770/posts",
    "timestamp": "2025-05-03T03:31:28Z"
  },
  {
    "title": "An Unavoidable Trade War with Canada is Looming - Trigger Date July/August 2025",
    "description": "https://theconservativetreehouse.com/blog/2025/05/02/an-unavoidable-trade-war-with-canada-is-looming-trigger-date-july-august-2025/According to the people present, when former Canadian Prime Minister Justin Trudeau traveled to Mar-a-Lago to meet with Presiden…",
    "link": "https://freerepublic.com/focus/f-news/4314769/posts",
    "timestamp": "2025-05-03T03:28:14Z"
  },
  {
    "title": "Bitcoin bros at 'the club' may stop US gov’t from buying BTC — Arthur Hayes",
    "description": "BitMEX co-founder Arthur Hayes says the United States is unlikely to add more Bitcoin to its reserves beyond what it has already seized due to the country’s high debt levels and the stereotype behind “Bitcoin bros.”“I’m not really into the whole Strategic Res…",
    "link": "https://cointelegraph.com/news/arthur-hayes-bitmex-us-strategic-reseve-plans-doubts-bitcoin-bros",
    "timestamp": "2025-05-03T03:25:20Z"
  },
  {
    "title": "Weissmann: Trump Brought Back 'McCarthy Era,' People Are Being Blacklisted",
    "description": "Former federal prosecutor Andrew Weissmann declared Friday on MSNBC's \"The Beat\" that President Donald Trump had brought back \"McCarthy era\" blacklisting.\nThe post Weissmann: Trump Brought Back ‘McCarthy Era,’ People Are Being Blacklisted appeared first on Br…",
    "link": "https://www.breitbart.com/clips/2025/05/02/weissmann-trump-brought-back-mccarthy-era-people-are-being-blacklisted/",
    "timestamp": "2025-05-03T03:24:32Z"
  },
  {
    "title": "Trump on Recession Threat: 'This Is a Transition Period — I Think We Are Going to Do Fantastically'",
    "description": "In a preview of an interview with President Donald Trump that will air Sunday on NBC's \"Meet the Press,\" the president said that the United States economy will be fantastic after a \"transition period.\"\nThe post Trump on Recession Threat: ‘This Is a Transition…",
    "link": "https://www.breitbart.com/clips/2025/05/02/trump-on-recession-threat-this-is-a-transition-period-i-think-we-are-going-to-do-fantastically/",
    "timestamp": "2025-05-03T03:22:37Z"
  },
  {
    "title": "Second US military zone along border with Mexico set up to deter migrants",
    "description": "Trump administration says Texas National Defense Area to run east from the Texas-New Mexico border in El Paso.",
    "link": "https://www.aljazeera.com/news/2025/5/3/second-us-military-zone-along-border-with-mexico-set-up-to-deter-migrants",
    "timestamp": "2025-05-03T03:22:33Z"
  },
  {
    "title": "Bill Maher Can’t Believe Trump Is Running on ‘Let’s Make Christmas Worse for Children’  Video",
    "description": "\"They say, soon the shelves at Walmart could be 90% bare, just like the people who shop there,\" the \"Real Time\" host jokes\nThe post Bill Maher Can’t Believe Trump Is Running on ‘Let’s Make Christmas Worse for Children’  Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bill-maher-monologue-trump-makes-christmas-worse-for-kids-hbo/",
    "timestamp": "2025-05-03T03:22:12Z"
  },
  {
    "title": "US gives initial approval for $3.5 billion missile sale to Saudi Arabia before Trump's planned visit",
    "description": "The United States has given initial approval to sell $3.5 billion worth of air-to-air missiles for Saudi Arabia’s fighter jets, the latest proposed arms deal for the region ahead of President Donald Trump’s planned trip to the region later this month",
    "link": "https://abcnews.go.com/US/wireStory/us-initial-approval-35-billion-missile-sale-saudi-121420961",
    "timestamp": "2025-05-03T03:18:31Z"
  },
  {
    "title": "Transgender women banned from women’s cricket in England and Wales",
    "description": "The ECB instead allows transgender women to play in open and mixed cricket matches.",
    "link": "https://www.nzherald.co.nz/sport/cricket/transgender-women-banned-from-womens-cricket-in-england-and-wales/EII4TT3NQZB7DN2UXT5P6SYZR4/",
    "timestamp": "2025-05-03T03:15:46Z"
  },
  {
    "title": "Who’s driving this donkey? Losing Dems need a moderate pivot, but radical left steering for a cliff",
    "description": "On Nov. 5, the Democratic Party received what counts in our hyper-polarized age as a comprehensive drubbing. Donald Trump swept all seven battleground states, improved over his 2016 and 2020 performances with nearly every demographic subcategory, and became t…",
    "link": "https://freerepublic.com/focus/f-chat/4314768/posts",
    "timestamp": "2025-05-03T03:11:58Z"
  },
  {
    "title": "Trump’s 2026 budget request includes plans for an Israeli-inspired ‘Golden Dome for America’",
    "description": "It’s part of Trump’s proposal for a massive $113 billion increase in Department of Defense spending, a jump of 13%, amid widespread cuts elsewhere.",
    "link": "https://www.jpost.com/american-politics/article-852432",
    "timestamp": "2025-05-03T03:11:35Z"
  },
  {
    "title": "Former Georgia Democrat Candidate Who Called for Assassination of Trump Arrested in Child Sex Trafficking Bust",
    "description": "A Georgia Democrat who ran for a seat in Georgia's State House last year, and previously called for the assassination of President Donald Trump, was arrested in a multi-agency human trafficking operation focused on child sex trafficking, according to a press …",
    "link": "https://www.breitbart.com/politics/2025/05/02/former-georgia-democrat-candidate-assassination-trump-arrested-human-trafficking/",
    "timestamp": "2025-05-03T03:08:32Z"
  },
  {
    "title": "The Downfall Of 60 Minutes And The Biggest Media Scandal You’ve Never Heard Of",
    "description": "Last week, 60 Minutes’ executive producer Bill Owens resigned in protest — but Owens and the rest of the news program have never taken responsibility for their own corruption.Last week, Bill Owens, the executive producer of CBS’ flagship news program 60 Minut…",
    "link": "https://freerepublic.com/focus/f-news/4314767/posts",
    "timestamp": "2025-05-03T03:07:33Z"
  },
  {
    "title": "US gives initial approval for $3.5 billion missile sale to Saudi Arabia before Trump's planned visit",
    "description": "The United States has given initial approval to sell $3.5 billion worth of air-to-air missiles for Saudi Arabia’s fighter jets, the latest proposed arms deal for the region ahead of President Donald Trump’s planned trip to the region later this month. The sal…",
    "link": "https://www.seattlepi.com/news/world/article/us-gives-initial-approval-for-3-5-billion-20307813.php",
    "timestamp": "2025-05-03T03:06:42Z"
  },
  {
    "title": "Trump shrugs off recession fears, saying a downturn would be ‘OK’",
    "description": "President Donald Trump appeared to dismiss growing concerns that his economic policies could cause a recession, telling NBC News that the economy would be “OK” in the long term even if a recession happens in the near future.\n“Some people on Wall Street say th…",
    "link": "https://biztoc.com/x/ca60d459bb1f59a3",
    "timestamp": "2025-05-03T03:05:15Z"
  },
  {
    "title": "US gives initial approval for $3.5 bn missile sale to Saudi Arabia before Trump's planned visit",
    "description": "The U.S. has initially approved a $3.5 billion sale of air-to-air missiles to Saudi Arabia, potentially one of several deals to be highlighted during President Trump's upcoming visit. This sale, involving 1,000 advanced missiles, aims to bolster Saudi Arabia'…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-gives-initial-approval-for-3-5-bn-missile-sale-to-saudi-arabia-before-trumps-planned-visit/articleshow/120840584.cms",
    "timestamp": "2025-05-03T03:04:32Z"
  },
  {
    "title": "Taiwan, SEA anchor US chip supply: Tariffs may do more harm than good",
    "description": "US President Donald Trump announced on April 14 a national security investigation into semiconductor imports. The US Commerce Department's Bureau of Industry and Security (BIS) followed with 14 points of inquiry, focusing on foreign subsidies, supply chain de…",
    "link": "https://www.digitimes.com/news/a20250429PD212/taiwan-donald-trump-asia-security-investigation.html",
    "timestamp": "2025-05-03T03:03:17Z"
  },
  {
    "title": "PBS chief slams Trump's executive order as \"blatantly unlawful\"",
    "description": "NEW YORK, May 2 (Xinhua) -- The head of The Public Broadcasting Service (PBS) said on Friday that U.",
    "link": "http://en.people.cn/n3/2025/0503/c90000-20310218.html",
    "timestamp": "2025-05-03T03:01:31Z"
  },
  {
    "title": "Kuwait Clamps Down On Bitcoin Mining As Power Grid Reaches Breaking Point",
    "description": "The government of Kuwait has initiated a crackdown on cryptocurrency miners throughout the nation, accusing them of aggravating power shortages with summer just around the corner, according to a Reuters report. The interior ministry last week declared a “wide…",
    "link": "https://bitcoinist.com/bitcoin-mining-banned-in-kuwait-as-power-grid-reaches-breaking-point/",
    "timestamp": "2025-05-03T03:00:44Z"
  },
  {
    "title": "Republican Strategist Insists Trump Didn’t Say the Thing He Just Said on TV",
    "description": "Erin Maguire claimed that President Donald Trump did not say the thing he just said on television.\nThe post Republican Strategist Insists Trump Didn’t Say the Thing He Just Said on TV first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/republican-strategist-insists-trump-didnt-say-the-thing-he-just-said-on-tv/",
    "timestamp": "2025-05-03T03:00:05Z"
  },
  {
    "title": "Trump wants $1 trillion for defense while slashing child care and health programs - NewsBreak",
    "description": "The White House released President Donald Trump's 2026 budget proposal Friday, hoping to slash, if not zero out, spending on many government programs inclu",
    "link": "https://www.newsbreak.com/share/3990182018284-trump-wants-1-trillion-for-defense-while-slashing-child-care-and-health-programs?s=a2&share_destination_id=MjI5MTQ2MzUwLTE3NDYyNDgxNDIyOTY%3D&pd=0FVTQsxU&hl=en_US&send_time=1746248142&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.16.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-v1%2Cns_local_strategy_25q1_exp-v17%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_recall_exp_25q2-v8",
    "timestamp": "2025-05-03T02:57:02Z"
  },
  {
    "title": "Trump wants $1 trillion for defense while slashing child care and health programs - NewsBreak",
    "description": "The White House released President Donald Trump's 2026 budget proposal Friday, hoping to slash, if not zero out, spending on many government programs inclu",
    "link": "https://www.newsbreak.com/share/3990182018284-trump-wants-1-trillion-for-defense-while-slashing-child-care-and-health-programs?s=a2&share_destination_id=MTc0NjgxNTIwLTE3NDYzMTg2MjcxNDA%3D&pd=0BowdsUz&hl=en_US&send_time=1746318627&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.17.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q2-control%2Cns_foryou_recall_exp_25q2-v4%2Cns_local_strategy_25q1_exp-v4%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-control",
    "timestamp": "2025-05-03T02:57:02Z"
  },
  {
    "title": "Trump wants $1 trillion for defense while slashing child care and health programs - NewsBreak",
    "description": "The White House released President Donald Trump's 2026 budget proposal Friday, hoping to slash, if not zero out, spending on many government programs inclu",
    "link": "https://www.newsbreak.com/share/3990182018284-trump-wants-1-trillion-for-defense-while-slashing-child-care-and-health-programs?s=a2&share_destination_id=MzE0ODIzMDMxLTE3NDYzMjQzODc0Mjc%3D&pd=0LIxqpg2&hl=en_US&send_time=1746324387&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.18.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q2_v2-v7%2Cns_foryou_recall_exp_25q2-v1%2Cns_foryou_blend_exp_25q2-v5%2Cns_local_strategy_25q1_exp-v6%2Cns_foryou_rank_exp_25q2-v1",
    "timestamp": "2025-05-03T02:57:02Z"
  },
  {
    "title": "US clarifies stance on its Ukraine conflict mediation role",
    "description": "The US says it will continue to act as a mediator between Russia and Ukraine for the time being Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616678-us-clarify-ukraine-conflict-mediation/",
    "timestamp": "2025-05-03T02:56:30Z"
  },
  {
    "title": "US gives initial approval for $3.5 billion missile sale to Saudi Arabia before Trump’s planned visit",
    "description": "DUBAI, United Arab Emirates (AP) — The United States has given initial approval to sell $3.5 billion worth of air-to-air missiles for Saudi Arabia’s fighter jets, the latest proposed arms deal for the region ahead of President Donald Trump ‘s planned trip to …",
    "link": "https://financialpost.com/pmn/us-gives-initial-approval-for-3-5-billion-missile-sale-to-saudi-arabia-before-trumps-planned-visit",
    "timestamp": "2025-05-03T02:53:52Z"
  },
  {
    "title": "US gives initial approval for $3.5 billion missile sale to Saudi Arabia before Trump's planned visit",
    "description": "The United States has given initial approval to sell $3.5 billion worth of air-to-air missiles for Saudi Arabia's fighter jets, the latest proposed arms deal...",
    "link": "https://www.yahoo.com/news/us-gives-initial-approval-3-024848628.html",
    "timestamp": "2025-05-03T02:48:48Z"
  },
  {
    "title": "Chinese Slavery-Linked Temu Halts Shipments from China to U.S.",
    "description": "Chinese discount shopping website Temu has halted shipments of goods from China to the United States, as President Donald Trump ended a loophole last month that had allowed duties, or tariffs, to be lifted on small ship\nThe post Chinese Slavery-Linked Temu Ha…",
    "link": "https://www.breitbart.com/economy/2025/05/02/chinese-slavery-linked-temu-halts-shipments-from-china-to-u-s/",
    "timestamp": "2025-05-03T02:48:41Z"
  },
  {
    "title": "Trump's next 100 days: Now comes the hard part",
    "description": "WASHINGTON &mdash; United States President Donald Trump spent his first 100 days issuing a blitz of executive orders to deliver rapidly on campaign pledges, drastically downsize the government and reshape America's role on the global stage.",
    "link": "https://www.bangkokpost.com/world/3016897/trumps-next-100-days-now-comes-the-hard-part",
    "timestamp": "2025-05-03T02:45:00Z"
  },
  {
    "title": "Trump Calls NPR And PBS 'Biased And Partisan,' Signs Executive Order To Stop Funding",
    "description": "",
    "link": "https://www.benzinga.com/25/05/45181825/trump-calls-npr-and-pbs-biased-and-partisan-signs-executive-order-to-stop-funding",
    "timestamp": "2025-05-03T02:32:20Z"
  },
  {
    "title": "Australia Election 2025: PM Albanese sits pretty, Dutton seeks to defy Trump factor and Labor win predictions",
    "description": "Australia prepares for elections on Saturday with public polling suggesting a Labor advantage. Anthony Albanese and Peter Dutton are making final appeals to voters. Early voting numbers are substantial and both leaders express confidence of winning. Seat tall…",
    "link": "https://economictimes.indiatimes.com/news/international/new-zealand/australia-election-2025-pm-albanese-sits-pretty-dutton-seeks-to-defy-trump-factor-and-labor-win-predictions/articleshow/120839267.cms",
    "timestamp": "2025-05-03T02:21:44Z"
  },
  {
    "title": "US criticizes Germany for labeling AfD 'extremist'",
    "description": "Trump administration officials have condemned the move by Germany's domestic intelligence agency to designate the far-right AfD party an extremist group, setting off a diplomatic row between the two NATO allies. Top-ranking officials in US President Donald Tr…",
    "link": "https://www.dw.com/en/us-criticizes-germany-for-labeling-afd-extremist/a-72423560",
    "timestamp": "2025-05-03T02:21:00Z"
  },
  {
    "title": "Trump taps shock jock Sid Rosenberg and a Haredi newspaper publisher for Holocaust Memorial Council",
    "description": "They will replace Emhoff and a number of Biden administration officials, including Susan Rice, Tom Perez and Ron Klain, all of whom Trump abruptly dismissed from the board this week.",
    "link": "https://www.jpost.com/diaspora/article-852427",
    "timestamp": "2025-05-03T02:20:21Z"
  },
  {
    "title": "Donald Trump's tariffs bite at quiet US ports",
    "description": "The Port of Los Angeles is experiencing a significant slowdown due to the US-China trade war, with cargo volumes plummeting. Importers are halting shipments from China in response to tariffs, leading to potential shortages and higher prices for American consu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-tariffs-bite-at-quiet-us-ports/articleshow/120839480.cms",
    "timestamp": "2025-05-03T02:19:31Z"
  },
  {
    "title": "Nike, Adidas, Skechers and 73 other footwear brands urged Donald Trump for tariff exemption amid fears of rising costs",
    "description": "USA-TRUMP/TARIFFS-FOOTWEAR RETAILERS:Footwear brands including Nike and Adidas ask Trump for tariff exemption",
    "link": "https://www.livemint.com/companies/nike-adidas-skechers-and-73-other-footwear-brands-urged-donald-trump-for-tariff-exemption-amid-fears-of-rising-costs-11746237655711.html",
    "timestamp": "2025-05-03T02:17:06Z"
  },
  {
    "title": "Iran must 'walk away' from all uranium enrichment, Marco Rubio says",
    "description": "U.S. Secretary of State Marco Rubio demanded Iran halt uranium enrichment, missile development, and support for terrorist groups, also insisting on American inspections of Iranian facilities. These demands highlight significant disagreements in nuclear talks,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-must-walk-away-from-all-uranium-enrichment-marco-rubio-says/articleshow/120839399.cms",
    "timestamp": "2025-05-03T02:15:42Z"
  },
  {
    "title": "‘Uh, Yeah’: Trump Says It’s ‘Ok’ if He Causes a Recession",
    "description": "President Donald Trump acknowledged that his trade policies could lead to a recession, but said ultimately, \"We're gonna do fantastically.\"\nThe post ‘Uh, Yeah’: Trump Says It’s ‘Ok’ if He Causes a Recession first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/uh-yeah-trump-says-its-ok-if-he-causes-a-recession/",
    "timestamp": "2025-05-03T02:15:17Z"
  },
  {
    "title": "Markets erase April losses as jobs report fuels stock gains",
    "description": "The stock market rallied Friday after a stronger-than-expected jobs report eased concerns that President Donald Trump’s sweeping tariffs could tank the U.S. economy, with the S&P 500 and Dow Jones Industrial Average extending their winning streaks to nine day…",
    "link": "https://freerepublic.com/focus/f-news/4314760/posts",
    "timestamp": "2025-05-03T02:14:02Z"
  },
  {
    "title": "Trump dismisses Wall Street worries about short-term recession: ‘I think we’re going to do fantastically’",
    "description": "President Donald Trump on Friday dismissed fears of a short-term recession, saying the economy will \"do fantastically\" in the long run.",
    "link": "https://www.foxnews.com/media/trump-dismisses-wall-street-worries-about-short-term-recession-fantastically",
    "timestamp": "2025-05-03T02:10:49Z"
  },
  {
    "title": "AOC Challenges Trump's Border Czar Over Immigration: 'Come for Me'",
    "description": "Homan has called for the Department of Justice to gauge if there is a legal red line lawmakers are crossing.",
    "link": "https://www.newsweek.com/aoc-challenges-trumps-border-czar-over-immigration-come-me-2067605",
    "timestamp": "2025-05-03T02:07:20Z"
  },
  {
    "title": "Alan Dershowitz Explains How Trump Conviction Will Get Appealed",
    "description": "Alan Dershowitz explained on Newsmax Friday how President Donald Trump’s conviction in the New York hush money case can still be appealed.",
    "link": "https://dailycaller.com/2025/05/02/alan-dershowitz-juan-merchan-trump-hush-money-case/",
    "timestamp": "2025-05-03T02:04:58Z"
  },
  {
    "title": "Trump's next 100 days: Now comes the hard part",
    "description": "President Donald Trump spent his first 100 days issuing a blitz of executive orders to deliver rapidly on campaign pledges, drastically downsize the government and reshape America's role on the global stage. In a dizzying first three months, Trump wielded exe…",
    "link": "https://timesofindia.indiatimes.com/world/us/trumps-next-100-days-now-comes-the-hard-part/articleshow/120839318.cms",
    "timestamp": "2025-05-03T02:04:48Z"
  },
  {
    "title": "‘That's a front’: NY Times' Maggie Haberman suspects Trump’s economic bravado is fake",
    "description": "President Donald Trump is merely \"putting on a front\" with his assurances he's not worried about the economy, New York Times reporter Maggie Haberman told CNN's Kaitlan Collins on Friday evening. This comes as Trump was roundly smacked down by fact-checkers f…",
    "link": "https://www.rawstory.com/trump-recession-2671884342/",
    "timestamp": "2025-05-03T02:03:27Z"
  },
  {
    "title": "Trump's Tariffs Bite At Quiet US Ports",
    "description": "At the Port of Los Angeles, the frenetic choreography of cranes unloading containers from Asia has slowed to a tiptoe, and the noise of the busiest docks in the US is quieting.",
    "link": "https://www.ibtimes.com/trumps-tariffs-bite-quiet-us-ports-3772346",
    "timestamp": "2025-05-03T02:03:23Z"
  },
  {
    "title": "Mexican Mega-port Confronts Trump's Tariff Storm",
    "description": "At dawn, container ships from Asia unload at a huge Pacific port in Mexico that so far appears to be weathering the storm unleashed by US President Donald Trump's tariffs.",
    "link": "https://www.ibtimes.com/mexican-mega-port-confronts-trumps-tariff-storm-3772343",
    "timestamp": "2025-05-03T02:03:21Z"
  },
  {
    "title": "Trump's Next 100 Days: Now Comes The Hard Part",
    "description": "President Donald Trump spent his first 100 days issuing a blitz of executive orders to deliver rapidly on campaign pledges, drastically downsize the government and reshape America's role on the global stage.",
    "link": "https://www.ibtimes.com/trumps-next-100-days-now-comes-hard-part-3772340",
    "timestamp": "2025-05-03T02:03:19Z"
  },
  {
    "title": "Trump's Tariffs Bite At Quiet US Ports",
    "description": "At the Port of Los Angeles, the frenetic choreography of cranes unloading containers from Asia has slowed to a tiptoe, and the noise of the busiest docks in the US is quieting.",
    "link": "https://www.ibtimes.com.au/trumps-tariffs-bite-quiet-us-ports-1858487",
    "timestamp": "2025-05-03T02:03:10Z"
  },
  {
    "title": "Mexican mega-port confronts Trump’s tariff storm",
    "description": "At dawn, container ships from Asia unload at a huge Pacific port in Mexico that so far appears to be weathering the storm unleashed by US President Donald Trump’s tariffs. Members of the navy patrol the waters off Lazaro Cardenas, which for years has also bee…",
    "link": "https://www.digitaljournal.com/world/mexican-mega-port-confronts-trumps-tariff-storm/article",
    "timestamp": "2025-05-03T01:57:33Z"
  },
  {
    "title": "Trump’s tariffs bite at quiet US ports",
    "description": "At the Port of Los Angeles, the frenetic choreography of cranes unloading containers from Asia has slowed to a tiptoe, and the noise of the busiest docks in the US is quieting.  “You could hear a pin drop, it’s very unusual,” Port Director Gene Seroka told AF…",
    "link": "https://www.digitaljournal.com/world/trumps-tariffs-bite-at-quiet-us-ports/article",
    "timestamp": "2025-05-03T01:57:33Z"
  },
  {
    "title": "Trump’s next 100 days: Now comes the hard part",
    "description": "President Donald Trump spent his first 100 days issuing a blitz of executive orders to deliver rapidly on campaign pledges, drastically downsize the government and reshape America’s role on the global stage. But the job gets trickier now for the self-styled d…",
    "link": "https://www.digitaljournal.com/world/trumps-next-100-days-now-comes-the-hard-part/article",
    "timestamp": "2025-05-03T01:57:21Z"
  },
  {
    "title": "Archaeologists Uncovered a Painting That May Prove the Existence of a Mysterious Creature",
    "description": "Art imitates life ... maybe.There’s something intriguing, even frightening, about the image of an ancient horned serpent roaming across the land. Thanks to some suggestive fossils and legends of old, talk of such a creature isn’t a new concept. But the recent…",
    "link": "https://freerepublic.com/focus/f-chat/4314756/posts",
    "timestamp": "2025-05-03T01:56:39Z"
  },
  {
    "title": "Public media ready to fight ‘unlawful’ Trump order defunding PBS, NPR",
    "description": "President Donald Trump’s executive order seeking to end federal funding for NPR and PBS — because of news coverage he called “biased and partisan” — triggered a fierce backlash from public broadcasters that appears poised to expand the White House’s larger le…",
    "link": "https://freerepublic.com/focus/f-news/4314755/posts",
    "timestamp": "2025-05-03T01:55:34Z"
  },
  {
    "title": "Trump Renames Veteran’s Day to Victory Day for WW1, Will Name May 8 as Victory Day for WW2",
    "description": "President Donald Trump has announced plans to rename Veterans Day as \"Victory Day for World War I\" and designate May 8 as \"Victory Day for World War II,\" asserting that the United States deserves greater recognition for its military achievements in both world…",
    "link": "https://www.thegatewaypundit.com/2025/05/trump-renames-veterans-day-victory-day-ww1-will/",
    "timestamp": "2025-05-03T01:50:57Z"
  },
  {
    "title": "US, Japanese officials to start trade consultations, Treasury says; Japan said it is sceptical",
    "description": "WASHINGTON: Top US and Japanese officials agreed to start immediate working-level consultations after \"frank and constructive\" trade talks in Washington on Thursday (May 1), the US Treasury Department said",
    "link": "https://www.channelnewsasia.com/east-asia/us-japan-officials-start-trade-consultations-treasury-skeptical-5106066",
    "timestamp": "2025-05-03T01:47:24Z"
  },
  {
    "title": "Judge issues permanent block of Trump executive order targeting Perkins Coie law firm",
    "description": "Judge issues permanent block of Trump executive order targeting Perkins Coie law firmgo.com",
    "link": "https://abcnews.go.com/Politics/judge-issues-permanent-block-trump-executive-order-targeting/story?id=121415580",
    "timestamp": "2025-05-03T01:43:00Z"
  },
  {
    "title": "New $167M Powerball winner won’t be making a quick exit from jail after kicking cop in face during bar fight: Police",
    "description": "A Kentucky man won the Powerball lottery in his home state and then went to Florida to celebrate, which allegedly got a bit out of hand. James Farthing, 50, won the Kentucky Powerball on April 26 after playing a $2 ticket along with his mother, Linda Grizzle.…",
    "link": "https://freerepublic.com/focus/f-chat/4314754/posts",
    "timestamp": "2025-05-03T01:40:05Z"
  },
  {
    "title": "Capitol stormer Ashli Babbitt's family to get settlement from U.S.",
    "description": "The U.S. has reached legal settlement terms with the family of Ashli Babbitt, who was killed by police during the Jan. 6 attack on the U.S. Capitol.",
    "link": "https://www.nydailynews.com/2025/05/02/capitol-rioter-ashli-babbitts-family-settlement-united-states/",
    "timestamp": "2025-05-03T01:38:45Z"
  },
  {
    "title": "Michelle Obama calls out the 'scam' she fell for in the Ivy League and how she overcame it [barf alert]",
    "description": "A tough first semester at Princeton taught Michelle Obama a career lesson that she's passing down to young professionals.(snip) As an affirmative action student from Chicago, Obama said, she felt \"a little intimidated\" by Princeton's Ivy status when she arriv…",
    "link": "https://freerepublic.com/focus/f-chat/4314752/posts",
    "timestamp": "2025-05-03T01:35:31Z"
  },
  {
    "title": "Maggie Haberman Says Trump ‘Right Now Seems To Believe Himself’ When Making Stuff Up",
    "description": "CNN political analyst Maggie Haberman said President Donald Trump \"seems to believe\" the blatant falsehoods he is telling people. \nThe post Maggie Haberman Says Trump ‘Right Now Seems To Believe Himself’ When Making Stuff Up first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/maggie-haberman-says-trump-right-now-seems-to-believe-himself-when-making-stuff-up/",
    "timestamp": "2025-05-03T01:34:18Z"
  },
  {
    "title": "Donald Trump is looming over Australia's election - BBC",
    "description": "Donald Trump is looming over Australia's electionBBC Australia Election 2025: Voters Focus on Cost-of-Living Concerns Amid Global TurmoilThe New York Times Coalition braces for tough result as Albanese hopes to be first PM to win re-election since HowardThe G…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177273101",
    "timestamp": "2025-05-03T01:32:42Z"
  },
  {
    "title": "Trump Downplays Possible Recession As A 'Transition Period'",
    "description": "\"Anything can happen,\" the president admitted.",
    "link": "https://www.huffpost.com/entry/trump-downplays-recession-transition-period_n_68155890e4b0bd67788c7546",
    "timestamp": "2025-05-03T01:30:03Z"
  },
  {
    "title": "Vance Blames Trump's Economic Tariff Wreckage On Biden",
    "description": "JD Vance proving once again he's just as big of a liar as his boss. Vance made an appearance on Fox's Special Report with Bret Baier, and fell right in line with the likes of Tommy Tuberville when asked about the economic downturn caused by Trump's tariffs.\nT…",
    "link": "https://crooksandliars.com/2025/05/vance-tries-blaming-trumps-economic-tariff",
    "timestamp": "2025-05-03T01:30:01Z"
  },
  {
    "title": "The Irish Independent’s view: The need to defend independent journalism has never been more critical",
    "description": "“He who does not weep does not see,” wrote Victor Hugo. Today, World Press Freedom Day, is a chance to think about all those who are forced to keep silent where the truth about injustice is suppressed and concealed from the world’s gaze.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-the-need-to-defend-independent-journalism-has-never-been-more-critical/a1515732687.html",
    "timestamp": "2025-05-03T01:30:00Z"
  },
  {
    "title": "Time magazine didn't publish cover showing Mark Carney giving Trump the middle finger",
    "description": "An image circulating online in late April 2025 authentically showed a Time magazine cover featuring the words \"Hey, Donald\" and Canadian Prime Minister Mark Carney holding up his middle finger.",
    "link": "https://www.snopes.com//fact-check/time-magazine-trump-mark-carney-middle-finger/",
    "timestamp": "2025-05-03T01:30:00Z"
  },
  {
    "title": "Richard Curran: Donald Trump’s self-inflicted wounds open way for Europe to step up on the world stage",
    "description": "Donald Trump really has blown it. His ousting of national security adviser Mike Waltz failed to distract from the hard fact that the US economy shrank in the first three months of this year.",
    "link": "https://www.independent.ie/opinion/comment/richard-curran-donald-trumps-self-inflicted-wounds-open-way-for-europe-to-step-up-on-the-world-stage/a807641749.html",
    "timestamp": "2025-05-03T01:30:00Z"
  },
  {
    "title": "Former Trump chief of staff Mick Mulvaney on immigration, Ukraine and why Ireland is not being ‘singled out’ by US",
    "description": "Reflecting on Donald Trump’s first 100 days back in the Oval Office, former White House chief of staff Mick Mulvaney has insisted he does not think the US is “singling out” Ireland, even as concern grows here over pharma and tech jobs.",
    "link": "https://www.independent.ie/irish-news/former-trump-chief-of-staff-mick-mulvaney-on-immigration-ukraine-and-why-ireland-is-not-being-singled-out-by-us/a381436756.html",
    "timestamp": "2025-05-03T01:30:00Z"
  },
  {
    "title": "Australians vote in national election with their sights on Trump, living costs",
    "description": "Voting began on Saturday in Australia's national election that polls show will likely favor Labor Prime Minister Anthony Albanese over conservative challenger Peter Dutton, with voter appetite for change dampened by worries over Donald Trump's volatile diplom…",
    "link": "https://japantoday.com/category/world/australians-vote-in-national-election-with-their-sights-on-trump-living-costs1",
    "timestamp": "2025-05-03T01:29:55Z"
  },
  {
    "title": "How ordinary Poles are preparing for a Russian invasion",
    "description": "After the election of Donald Trump, ordinary Poles fear they could be in Moscow's sights.",
    "link": "https://www.bbc.com/news/articles/cj9exj0nn0ko",
    "timestamp": "2025-05-03T01:28:09Z"
  },
  {
    "title": "How ordinary Poles are preparing for a Russian invasion",
    "description": "After the election of Donald Trump, ordinary Poles fear they could be in Moscow's sights.",
    "link": "https://www.bbc.co.uk/news/articles/cj9exj0nn0ko",
    "timestamp": "2025-05-03T01:28:09Z"
  },
  {
    "title": "Judge slaps down Trump's 'cringe-worthy' executive order targeting Perkins Coie",
    "description": "Trump has been signing executive orders against legal powerhouses such as Jenner & Block, Perkins Coie, and Covington & Burling.\nEvelyn Hockstein/REUTERS\nJudge Beryl Howell, in a Friday ruling, blocked Donald Trump's executive order against Perkins Coie.\nHowe…",
    "link": "https://biztoc.com/x/3542f6e1111518d8",
    "timestamp": "2025-05-03T01:26:35Z"
  }
]