[
  {
    "title": "Are we all living in Florida now? The rise of ‘don’t say climate’ politics.",
    "description": "Talking about climate change may be politically radioactive, but adjusting to its effects is no longer optional.",
    "link": "https://grist.org/language/florida-adaptation-dont-say-climate-politics-bill-gates/",
    "timestamp": "2025-11-10T09:45:00Z"
  },
  {
    "title": "Thailand suspends Cambodia peace deal after landmine blast",
    "description": "A landmine injured two Thai soldiers on patrol near the border, endangering a peace agreement overseen by US President Donald Trump.",
    "link": "https://www.dw.com/en/thailand-suspends-cambodia-peace-deal-after-landmine-blast/a-74683180",
    "timestamp": "2025-11-10T09:45:00Z"
  },
  {
    "title": "BBC not institutionally biased, says News CEO after resigning",
    "description": "Deborah Turness quit on Sunday alongside the corporation's director general Tim Davie.",
    "link": "https://www.bbc.com/news/articles/crmxp1ve7wlo",
    "timestamp": "2025-11-10T09:43:08Z"
  },
  {
    "title": "BBC head resigns after criticism about the editing of a Trump speech",
    "description": "The head of the BBC and a top news executive resigned Sunday over criticisms about the way the organization edited a speech by President Donald Trump for a documentary.",
    "link": "https://www.npr.org/2025/11/10/nx-s1-5603631/bbc-head-resigns-after-criticism-about-the-editing-of-a-trump-speech",
    "timestamp": "2025-11-10T09:39:05Z"
  },
  {
    "title": "The Martyrs of Nigeria and Most Likely Events to Come",
    "description": "In yesterday’s Gospel reading, from John 2: 13-22, Jesus drove away the traders who were defiling the Temple. It was demanded of Him to provide a sign to justify why He did that. In the world today, President Donald Trump of the USA issued a warning to the te…",
    "link": "https://thechronicle.com.gh/the-martyrs-of-nigeria-and-most-likely-events-to-come/",
    "timestamp": "2025-11-10T09:31:42Z"
  },
  {
    "title": "UN climate talks are built on consensus. That’s part of the problem.",
    "description": "At COP, the requirement that countries find consensus before taking action has stalled climate progress for decades. Experts say there's a better way.",
    "link": "https://grist.org/cop30/un-climate-treaty-voting-by-consensus/",
    "timestamp": "2025-11-10T09:30:00Z"
  },
  {
    "title": "Bitcoin price eyes $112K liquidity grab as US government shutdown nears end",
    "description": "The reopening of the US government could fuel Bitcoin price recovery, as exchange order-book liquidity placed $112,000 on top of the list for bulls.",
    "link": "https://cointelegraph.com/news/bitcoin-price-eyes-112k-liquidity-us-government-shutdown-nears-end",
    "timestamp": "2025-11-10T09:30:00Z"
  },
  {
    "title": "Trump administration cannot withhold $4 billion for food aid, US appeals court rules",
    "description": "Gold prices jump back above $4,000/oz on soft dollar; US shutdown end in sight\nBy Nate Raymond\nBOSTON (Reuters) -A federal appeals court late on Sunday allowed a judge’s order to stand that directs U.S. President Donald Trump’s administration to fully fund th…",
    "link": "https://biztoc.com/x/6232fdf9bdef407e",
    "timestamp": "2025-11-10T09:26:09Z"
  },
  {
    "title": "US Senate strikes deal aimed at ending record-long government shutdown",
    "description": "The agreement is seen as the first real sign of progress towards ending the US government shutdown, which has seen millions of American lives disrupted since it took effect on 1 October.",
    "link": "https://news.sky.com/story/us-senate-strikes-deal-aimed-at-ending-record-long-government-shutdown-13467834",
    "timestamp": "2025-11-10T09:21:00Z"
  },
  {
    "title": "No Christian Genocide in Nigeria -Supreme Islamic Council fires back at Trump",
    "description": "The Nigerian Supreme Council for Islamic Affairs, NSCIA, has strongly rejected the designation of Nigeria as a “Country of Particular Concern” by former United States President Donald Trump. The council described the claim of “Christian genocide” in the count…",
    "link": "https://thechronicle.com.gh/no-christian-genocide-in-nigeria-supreme-islamic-council-fires-back-at-trump/",
    "timestamp": "2025-11-10T09:16:13Z"
  },
  {
    "title": "Does toned milk have less nutrition?",
    "description": "Toned milk offers a balanced nutritional profile with reduced fat and calories compared to whole milk. It retains essential nutrients like protein and calcium, making it a healthy choice for daily consumption, weight management, and those seeking lower fat in…",
    "link": "https://timesofindia.indiatimes.com/life-style/food-news/does-toned-milk-have-less-nutrition/articleshow/125220427.cms",
    "timestamp": "2025-11-10T09:15:00Z"
  },
  {
    "title": "Trump administration cannot withhold $4 billion for food aid, US appeals court rules",
    "description": "A federal appeals court upheld a judge's order requiring the Trump administration to fully fund food aid benefits for 42 million low-income Americans during the government shutdown. The 1st U.S. Circuit Court of Appeals declined to halt the order, though a Su…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-administration-cannot-withhold-4-billion-for-food-aid-us-appeals-court-rules/articleshow/125220476.cms",
    "timestamp": "2025-11-10T09:13:40Z"
  },
  {
    "title": "Thailand threatens to suspend truce deal with Cambodia after a land mine injures troops",
    "description": "Thailand threatened on Monday to suspend a U.S.-brokered ceasefire agreement with Cambodia, with the country's prime minister saying all actions under the...",
    "link": "https://www.yahoo.com/news/articles/thailand-halt-actions-truce-deal-091258848.html",
    "timestamp": "2025-11-10T09:12:58Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani, others involved in efforts to overturn 2020 election, pardon attorney says - CNN",
    "description": "Trump pardons Rudy Giuliani, others involved in efforts to overturn 2020 election, pardon attorney saysCNN Trump pardons Giuliani, Powell, Chesebro and dozens more involved in 2020 ‘fake electors’ caseNew York Post Full List of Donald Trump Pardons of ‘Fake E…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180023918",
    "timestamp": "2025-11-10T09:12:46Z"
  },
  {
    "title": "'Put him on first flight...': Republicans push to strip Zohran Mamdani of US citizenship. But can they really do it?",
    "description": "Republicans are attempting to prevent Zohran Mamdani, New York City's first Muslim and South Asian mayor-elect, from taking office. Citing unsubstantiated claims of communist and  terrorist  ties, some lawmakers are demanding investigations into his citizensh…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-put-him-on-first-flight-republicans-push-to-strip-zohran-mamdani-of-us-citizenship-but-can-they-really-do-it/articleshow/125220410.cms",
    "timestamp": "2025-11-10T09:12:45Z"
  },
  {
    "title": "US Senate takes first step towards ending the government shutdown",
    "description": "The U.S. Senate on Sunday moved forward on a measure aimed at reopening the federal government and ending a now 40-day shutdown that has side-lined federal workers, delayed food aid and snarled air travel.",
    "link": "https://www.independent.ie/world-news/north-america/us-senate-takes-first-step-towards-ending-the-government-shutdown/a1316277665.html",
    "timestamp": "2025-11-10T09:12:31Z"
  },
  {
    "title": "What is Trump’s $2,000 Tariff Dividend and How Will it Impact the Crypto Market?",
    "description": "US President Donald Trump has unveiled a sweeping \"tariff dividend\" program, pledging at least $2,000 per eligible American citizen, excluding high-income earners.\nAs this influx of new capital enters the market, experts believe it could serve as a powerful c…",
    "link": "https://biztoc.com/x/8cf9a2d2ceee43b3",
    "timestamp": "2025-11-10T09:09:39Z"
  },
  {
    "title": "'Most hated bull run ever?' 5 things to know in Bitcoin this week",
    "description": "Bitcoin made major gains on the back of the US government potentially ending its shutdown, while planning to give many Americans a $2,000 tariff \"dividend.\"",
    "link": "https://cointelegraph.com/news/most-hated-bull-run-ever-5-things-bitcoin-this-week",
    "timestamp": "2025-11-10T09:08:11Z"
  },
  {
    "title": "China Curbs Drug Precursors to North America After US Trade Deal",
    "description": "China added more than a dozen fentanyl precursors to a list of controlled exports to the US, Mexico and Canada, in an apparent move to implement commitments made in a trade deal reached between Xi Jinping and Donald Trump last month.",
    "link": "https://financialpost.com/pmn/business-pmn/china-curbs-drug-precursors-to-north-america-after-us-trade-deal",
    "timestamp": "2025-11-10T09:02:25Z"
  },
  {
    "title": "Yogi Adityanath to make recital of 'Vande Mataram' mandatory in UP's educational institutions",
    "description": "Uttar Pradesh chief minister Yogi Adityanath announced that reciting 'Vande Mataram' will be made mandatory in all educational institutions across the state. This move aims to instill respect for the nation and counter elements that weaken national unity. The…",
    "link": "https://timesofindia.indiatimes.com/india/yogi-adityanath-to-make-recital-of-vande-mataram-mandatory-in-ups-educational-institutions/articleshow/125220082.cms",
    "timestamp": "2025-11-10T09:00:31Z"
  },
  {
    "title": "Stellantis takes Ontario auto supplier to court over claims of extortion",
    "description": "Stellantis and one of its Canadian auto suppliers are battling in court over the price of brake rotors in a dispute that threatens to shutter some auto assembly plants in Michigan.",
    "link": "https://www.cbc.ca/news/canada/windsor/stellantis-peterson-springs-fca-suppliers-automotive-auto-tariffs-trump-9.6968173",
    "timestamp": "2025-11-10T09:00:00Z"
  },
  {
    "title": "Swift, trucking boycott NYC after Zohran Mamdani's mayoral election? Get real",
    "description": "The claim that NYC's incoming mayor will quadruple costs for trucking companies doesn't hold up to minimal scrutiny. It's not the first time a proposed NYC boycott has fallen apart.",
    "link": "https://www.overdriveonline.com/channel-19/article/15771453/trucking-boycotting-nyc-after-zohran-mamdanis-election-get-real",
    "timestamp": "2025-11-10T08:58:24Z"
  },
  {
    "title": "Ahead of KDMC polls, UBT, Congress and Shinde faction leaders switch to BJP in Dombivli; Shinde Sena hits back by poaching BJP leaders",
    "description": "Ahead of KDMC elections, BJP secured a major win by inducting Uddhav Thackeray's Shiv Sena (UBT) district president Dipesh Mhatre and his supporters. The move, however, angered the Shinde faction, who retaliated by inducting former BJP corporators. This aggre…",
    "link": "https://timesofindia.indiatimes.com/city/thane/ahead-of-kdmc-polls-ubt-congress-and-shinde-faction-leaders-switch-to-bjp-in-dombivli-shinde-sena-hits-back-by-poaching-bjp-leaders/articleshow/125220136.cms",
    "timestamp": "2025-11-10T08:56:15Z"
  },
  {
    "title": "Delhi’s ‘worst’ air quality crisis hits hard: Founder reveals shocking symptoms on landing; is 2026 doomsday for pollution",
    "description": "Delhi's air quality has reached critical levels, causing immediate health issues like headaches and burning eyes for visitors, as highlighted by Kidbea founder Swapnil Srivastav. His viral post criticizes the government's inaction compared to international st…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/delhis-worst-air-quality-crisis-hits-hard-founder-reveals-shocking-symptoms-on-landing-is-2026-doomsday-for-pollution/articleshow/125220027.cms",
    "timestamp": "2025-11-10T08:54:43Z"
  },
  {
    "title": "Outgoing BBC News boss: 'the buck stops with me'",
    "description": "The outgoing BBC News CEO Deborah Turness says \"the buck stops with me\", while also insisting that BBC News is \"not institutionally biased\", after she and...",
    "link": "https://uk.news.yahoo.com/outgoing-bbc-news-boss-buck-085109181.html",
    "timestamp": "2025-11-10T08:51:09Z"
  },
  {
    "title": "Thailand suspends Cambodia deal after landmine injures troops",
    "description": "Tensions have escalated as Thailand announced a suspension of its peace agreement with Cambodia following a landmine detonation that resulted in injuries to two Thai soldiers. The planned accord, backed by US President Donald Trump, was intended to mitigate r…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/thailand-suspends-cambodia-deal-after-landmine-injures-troops/articleshow/125220087.cms",
    "timestamp": "2025-11-10T08:50:22Z"
  },
  {
    "title": "Trump Pardons Key Players In Scheme To Overturn 2020 Election",
    "description": "The president is not done rewriting history about his effort to cling to power following his 2020 defeat.",
    "link": "https://www.huffpost.com/entry/trump-pardons-giuliani-and-others-2020-election-scheme_n_69118ff8e4b003bdc1850ba3",
    "timestamp": "2025-11-10T08:33:56Z"
  },
  {
    "title": "GOP Congressman Sounds Alarm On What Could Decimate Party In 2026",
    "description": "“We need to deal with that now,” said New Jersey Republican Jeff Van Drew.",
    "link": "https://www.huffpost.com/entry/jeff-van-drew-warning-republicans_n_69119aa9e4b003bdc185140b",
    "timestamp": "2025-11-10T08:33:13Z"
  },
  {
    "title": "Trump Floats Sending Out $2K Checks From Tariff Revenues",
    "description": "Donald Trump said Sunday that he is considering giving most Americans a $2,000 check funded by tariff revenues, in what appears to be an effort to build public support for his trade policies, the Guardian reports. \"A dividend of at least $2000 a person (not i…",
    "link": "https://www.newser.com/story/378378/trump-floats-sending-out-2k-checks-from-tariff-revenues.html",
    "timestamp": "2025-11-10T08:30:00Z"
  },
  {
    "title": "There is a pressure in this industry to look a particular way, but I’ve learned to take it positively: Veronica",
    "description": "Veronica Vanij shares her fitness journey. She gained weight for past roles in Non-Stop Dhamal and Ichchha. A new exciting project motivated her to lose 10 kilos.",
    "link": "https://timesofindia.indiatimes.com/web-series/news/hindi/there-is-a-pressure-in-this-industry-to-look-a-particular-way-but-ive-learned-to-take-it-positively-veronica/articleshow/125219656.cms",
    "timestamp": "2025-11-10T08:29:54Z"
  },
  {
    "title": "Novo Nordisk appears to have lost a major bidding war to Pfizer",
    "description": "Politiken Edition | Get the daily news here. Read the essential Danish news and topics of today - in English. Politiken Edition is your window to Denmark.",
    "link": "https://politiken.dk/edition/news/art10616731/Novo-Nordisk-appears-to-have-lost-a-major-bidding-war-to-Pfizer",
    "timestamp": "2025-11-10T08:23:51Z"
  },
  {
    "title": "BBC chairman expected to apologise for Trump speech edit",
    "description": "The chairman of the BBC is expected to apologise for the way a speech by Donald Trump was edited for a Panorama programme after several days of pressure on the broadcaster prompted the resignation of director-general Tim Davie.",
    "link": "https://www.rte.ie/news/uk/2025/1110/1543092-bbc-resignations/",
    "timestamp": "2025-11-10T08:23:07Z"
  },
  {
    "title": "\"He’s got to stop the injuries\": President Donald Trump flags health risks for Washington Commanders' QB Jayden Daniels after surgery update",
    "description": "Jayden Daniels, after a stellar rookie season leading the Commanders to the NFC Championship, is facing a sophomore slump marked by a significant injury and declining statistics. Despite a dislocated elbow with no broken bones or ligament damage, his performa…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/hes-got-to-stop-the-injuries-president-donald-trump-flags-health-risks-for-washington-commanders-qb-jayden-daniels-after-surgery-update/articleshow/125218783.cms",
    "timestamp": "2025-11-10T08:19:32Z"
  },
  {
    "title": "Why is the BBC set to apologise over a Donald Trump speech edit?",
    "description": "A 19-page dossier highlighted concerns over the broadcaster’s impartiality",
    "link": "https://www.irishtimes.com/world/uk/2025/11/10/why-is-the-bbc-set-to-apologise-over-a-donald-trump-speech-edit/",
    "timestamp": "2025-11-10T08:18:12Z"
  },
  {
    "title": "Stock markets surge after US lawmakers move to end government shutdown",
    "description": "US Senate vote to end shutdown delivers reprieve to investors worried about AI valuations and weakness in US economy.",
    "link": "https://www.aljazeera.com/economy/2025/11/10/stock-markets-surge-after-us-lawmakers-move-to-end-government-shutdown",
    "timestamp": "2025-11-10T08:16:18Z"
  },
  {
    "title": "What is Trump’s $2,000 Tariff Dividend and How Will it Impact the Crypto Market?",
    "description": "Trump’s $2,000 “tariff dividend” could inject $440 billion into the economy, fueling hopes for a major crypto bull run.",
    "link": "https://beincrypto.com/trump-tariff-dividend-crypto-bull-run/",
    "timestamp": "2025-11-10T08:15:45Z"
  },
  {
    "title": "FBI chief Kash Patel makes China visit to discuss fentanyl, law enforcement cooperation, sources say",
    "description": "FBI Director Kash Patel recently visited Beijing for talks on fentanyl and law enforcement. This trip followed a summit where US and Chinese presidents agreed on cooperation. China announced adjustments to its chemical export licenses for certain substances. …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/fbi-chief-kash-patel-makes-china-visit-to-discuss-fentanyl-law-enforcement-cooperation-sources-say/articleshow/125219363.cms",
    "timestamp": "2025-11-10T08:11:49Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani, others involved in efforts to overturn 2020 election, pardon attorney says | CNN Politics",
    "description": "President Donald Trump has pardoned a long list of his political allies for their support or involvement in alleged plans to overturn the 2020 presidential election, according to the Department of Justice’s Pardon Attorney, Ed Martin.",
    "link": "https://www.cnn.com/2025/11/10/politics/trump-pardon-allies-2020-election-hnk",
    "timestamp": "2025-11-10T08:08:38Z"
  },
  {
    "title": "China suspends ‘special port fees’ on US vessels",
    "description": "China said Monday it would suspend for one year “special port fees” on US vessels “simultaneously” with Washington’s pause on levies targeting Chinese ships, as a fragile trade truce between the superpowers continues to take shape. The United States and China…",
    "link": "https://www.digitaljournal.com/world/china-suspends-special-port-fees-on-us-vessels/article",
    "timestamp": "2025-11-10T08:07:32Z"
  },
  {
    "title": "In a SNAP, Trump blamed for blocking food assistance to low-income families",
    "description": "Trump's decision to halt SNAP benefits during the 40-day government shutdown affects 42 million Americans while federal workers go unpaid and controversy grows.",
    "link": "https://www.foxnews.com/opinion/snap-trump-blamed-blocking-food-assistance-low-income-families",
    "timestamp": "2025-11-10T08:00:46Z"
  },
  {
    "title": "What’s Next for ETH, XRP, ADA, SOL as Trump Dangles a $2K ‘Tariff Dividend’",
    "description": "The idea of direct household payments, even hypothetical, revived the same risk-on reflex that drove digital assets during the pandemic-era stimulus rounds.",
    "link": "https://www.coindesk.com/markets/2025/11/10/what-s-next-for-eth-xrp-ada-sol-as-trump-dangles-a-usd2k-tariff-dividend",
    "timestamp": "2025-11-10T07:58:49Z"
  },
  {
    "title": "The 8 at 8: Monday",
    "description": "Millions are displaced in the Philippines, a poultry housing order comes in and the BBC chairman is to apologise.",
    "link": "https://www.thejournal.ie/8-at-8-1011-6869759-Nov2025/",
    "timestamp": "2025-11-10T07:54:32Z"
  },
  {
    "title": "Full List of Donald Trump Pardons of ‘Fake Electors’",
    "description": "President Donald Trump has pardoned a long list of allies who allegedly supported his bid to subvert the 2020 election, according to the Justice Department (DOJ).\nEd Martin, the DOJ's pardon attorney, shared a document on X on Sunday that named the 77 people …",
    "link": "https://biztoc.com/x/db7429ea048c73d0",
    "timestamp": "2025-11-10T07:53:00Z"
  },
  {
    "title": "Mythbusters: What happens if you store your ammunition and loaded guns in an over, forget that they're in the oven, and turn the over on?",
    "description": "Mythbusters: What happens if you store your ammunition and loaded guns in an over, forget that they're in the oven, and turn the over on?",
    "link": "https://freerepublic.com/focus/f-chat/4351726/posts",
    "timestamp": "2025-11-10T07:52:27Z"
  },
  {
    "title": "Los Angeles Chargers on a roll as Justin Herbert leads them past Pittsburgh Steelers",
    "description": "Justin Herbert threw for 220 yards and a touchdown as the Los Angeles Chargers defeated AFC West rivals, the Pittsburgh Steelers, 25–10, securing their third consecutive win.",
    "link": "https://www.independent.ie/sport/other-sports/american-football/los-angeles-chargers-on-a-roll-as-justin-herbert-leads-them-past-pittsburgh-steelers/a1314857943.html",
    "timestamp": "2025-11-10T07:51:47Z"
  },
  {
    "title": "BBC chairman expected to apologise for misleading edit to Trump speech",
    "description": "Trump claimed the documentary had been an attempt to ‘step on the scales’ of the presidential election.",
    "link": "https://www.thejournal.ie/bbc-trump-6869764-Nov2025/",
    "timestamp": "2025-11-10T07:44:33Z"
  },
  {
    "title": "'Climate conference of truth' in Brazil?",
    "description": "At COP30, the international community again will try to agree on targets to limit catastrophic global temperature rise. But many barriers remain before steep greenhouse gas cuts are realized.",
    "link": "https://www.dw.com/en/climate-conference-of-truth-in-brazil/a-74573589",
    "timestamp": "2025-11-10T07:42:00Z"
  },
  {
    "title": "COP30: 'Climate conference of truth' in Brazil?",
    "description": "At COP30, the international community again will try to agree on targets to limit catastrophic global temperature rise. But many barriers remain before steep greenhouse gas cuts are realized.",
    "link": "https://www.dw.com/en/cop30-climate-conference-of-truth-in-brazil/a-74573589",
    "timestamp": "2025-11-10T07:42:00Z"
  },
  {
    "title": "US senators take first step to end longest government shutdown in history",
    "description": "Eight Democrats cross party lines to back deal seeking to reopen federal administration after record budget impasse",
    "link": "https://www.irishtimes.com/world/us/2025/11/10/us-senators-take-first-step-to-end-longest-government-shutdown-in-history/",
    "timestamp": "2025-11-10T07:40:44Z"
  },
  {
    "title": "Trump's Limo Ride Had A Strange Moment, And Everyone Could See It",
    "description": "Spectators spotted something different about The Beast during the president's ride to the airport.",
    "link": "https://www.huffpost.com/entry/trump-limp-trunk-open_n_69118231e4b03f26059c5359",
    "timestamp": "2025-11-10T07:40:09Z"
  },
  {
    "title": "8 Democrats defy Chuck Schumer in fury over shutdown deal",
    "description": "Chuck Schumer is experiencing one of the most challenging moments of his political career as members of his own party openly question his leadership. The Senate minority leader found himself on the losing side Sunday when eight Democratic caucus members joine…",
    "link": "https://rollingout.com/2025/11/10/8-democrats-defy-chuck-schumer-shutdown/",
    "timestamp": "2025-11-10T07:38:38Z"
  },
  {
    "title": "Trump Pardons 77 MAGA Allies Linked To 2020 'Fake Electors' Plot — Including Rudy Giuliani, Sidney Powell And Mark Meadows",
    "description": "President Donald Trump granted pardons to 77 MAGA allies, including his personal lawyer Rudy Giuliani, who were linked to a scheme to overturn the 2020 presidential election.\nPardons Tied To ‘Fake Electors' Plot\nThe list of those pardoned was published by Tru…",
    "link": "https://biztoc.com/x/764d95dd7845156e",
    "timestamp": "2025-11-10T07:30:38Z"
  },
  {
    "title": "China's consumer prices rose in October",
    "description": "China's consumer prices rose in October, official data released over the weekend showed, reversing months of stagnation and decline as the country battles a range of economic headwinds.",
    "link": "https://www.rte.ie/news/business/2025/1110/1543087-chinas-consumer-prices-rose-in-october/",
    "timestamp": "2025-11-10T07:30:04Z"
  },
  {
    "title": "CNBC Daily Open: Don't hit panic button on tech pullback just yet",
    "description": "Earnings have been \"reassuring\" despite worries about tech stocks' high valuations, a strategist told CNBC. That means the fall in tech stocks might not last.",
    "link": "https://www.cnbc.com/2025/11/10/cnbc-daily-open-dont-hit-panic-button-on-tech-pullback-just-yet.html",
    "timestamp": "2025-11-10T07:30:01Z"
  },
  {
    "title": "Will EU's carbon border tax crash COP30 party?",
    "description": "Europe's new carbon tax on imports is causing global friction.  This policy aims to level the playing field for EU industries.  However, other nations fear it is protectionist and could shift emission reduction costs.  The mechanism is set to become fully ope…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/will-eus-carbon-border-tax-crash-cop30-party/articleshow/125218262.cms",
    "timestamp": "2025-11-10T07:23:39Z"
  },
  {
    "title": "US senators reach deal that could end record-long shutdown",
    "description": "The agreement followed wrangling over health care subsidies, food benefits and the firing of federal employees.",
    "link": "https://www.thejournal.ie/us-government-shutdown-9-6869747-Nov2025/",
    "timestamp": "2025-11-10T07:22:12Z"
  },
  {
    "title": "Amazon poised to host toughest climate talks in years",
    "description": "An odor of oil hung over last year's UN climate conference in Baku, capital of fossil fuel-rich Azerbaijan. Starting Monday, the 50,000 participants of COP30 will instead feel the heavy, humid air of the Amazon rainforest in Belem, Brazil, where they face the…",
    "link": "https://japantoday.com/category/world/amazon-poised-to-host-toughest-climate-talks-in-years",
    "timestamp": "2025-11-10T07:01:41Z"
  },
  {
    "title": "China suspends 'special port fees' on US vessels",
    "description": "Beijing (AFP) Nov 10, 2025\n\n\n China said Monday it would suspend for one year \"special port fees\" on US vessels \"simultaneously\" with Washington's pause on levies targeting Chinese ships, as a fragile trade truce between the superpowers continues to take shap…",
    "link": "https://www.energy-daily.com/reports/China_suspends_special_port_fees_on_US_vessels_999.html",
    "timestamp": "2025-11-10T06:59:33Z"
  },
  {
    "title": "BBC chief Tim Davie resigns, expected to apologise amid controversy over edited Donald Trump speech",
    "description": "BBC chairman Samir Shah is expected to apologise for the way a speech by Donald Trump was edited for Panorama after several days of pressure on the broadcaster prompted the resignation of director-general Tim Davie.",
    "link": "https://www.independent.ie/world-news/britain/bbc-chief-tim-davie-resigns-expected-to-apologise-amid-controversy-over-edited-donald-trump-speech/a682435296.html",
    "timestamp": "2025-11-10T06:50:00Z"
  },
  {
    "title": "Will the director general’s resignation be enough to restore public trust in the BBC?",
    "description": "Tim Davie stepped down amid controversy over editing of Donald Trump speech to make it look like he had explicitly encouraged Capitol riots",
    "link": "https://www.irishtimes.com/world/uk/2025/11/10/will-the-director-generals-resignation-be-enough-to-restore-public-trust-in-the-bbc/",
    "timestamp": "2025-11-10T06:47:44Z"
  },
  {
    "title": "China lifts sanctions on US units of South Korea ship giant Hanwha",
    "description": "China said Monday it would suspend sanctions against U.S. subsidiaries of Hanwha Ocean, one of South Korea's largest shipbuilders, as a fragile trade truce between Washington and Beijing continued to take shape.",
    "link": "https://www.hurriyetdailynews.com/china-lifts-sanctions-on-us-units-of-south-korea-ship-giant-hanwha-215557",
    "timestamp": "2025-11-10T06:45:50Z"
  },
  {
    "title": "Not Just Immigration Raids: Latino Workers Are Suffering from GOP Tax Policy as Well",
    "description": "Because of historic discrimination and language barriers, Latino workers are more heavily represented in certain industries than in others. Those industries — which include construction, healthcare and hospitality — are also ones that have seen a dramatic slu…",
    "link": "https://www.counterpunch.org/2025/11/10/not-just-immigration-raids-latino-workers-are-suffering-from-gop-tax-policy-as-well/",
    "timestamp": "2025-11-10T06:40:10Z"
  },
  {
    "title": "Full Rosters Announced for \"Optum Golf Channel Games\" - Live Primetime Competition Featuring Rory McIlroy and Scottie Scheffler on Golf Channel and USA Network December 17",
    "description": "Team Rory will include Shane Lowry, Luke Donald, and Haotong Li; and Team Scottie will feature Keegan Bradley, Sam Burns, and Luke Clanton.",
    "link": "http://www.thefutoncritic.com/news/2025/11/10/full-rosters-announced-for-optum-golf-channel-games-live-primetime-competition-featuring-rory-mcilroy-and-scottie-scheffler-on-golf-channel-and-usa-network-december-17-17214/20251110golf01/",
    "timestamp": "2025-11-10T06:40:00Z"
  },
  {
    "title": "Three takeaways from the US shutdown deal",
    "description": "The longest shutdown in US history appears to be drawing to a close, leaving Democrats divided and Trump's hard line paying off.",
    "link": "https://www.bbc.com/news/articles/ce9dpyevx3jo",
    "timestamp": "2025-11-10T06:36:38Z"
  },
  {
    "title": "China Lifts Chip Export Curbs",
    "description": "China Relaxes Chip Export Controls, Boosting Automotive Industry Great news for the automotive industry! China’s Ministry of Commerce announced on Sunday that it’s exempting Nexperia chips from export controls for civilian use. This move is expected to allevi…",
    "link": "https://nep123.com/china-lifts-chip-export-curbs/",
    "timestamp": "2025-11-10T06:33:07Z"
  },
  {
    "title": "Hungary Gets US Exemption for Russian Oil",
    "description": "President Trump granted Hungary an exemption from sanctions on purchases of Russian oil, providing a major win for Prime Minister Orban.",
    "link": "https://www.rigzone.com/news/wire/hungary_gets_us_exemption_for_russian_oil-10-nov-2025-182276-article/",
    "timestamp": "2025-11-10T06:30:00Z"
  },
  {
    "title": "Trump pardons Rudy Giuliani, Mark Meadows, Sidney Powell, others involved in 2020 election interference saga",
    "description": "President Trump grants full pardons to Rudy Giuliani, Mark Meadows, Sidney Powell and others accused of efforts to overturn the 2020 election.",
    "link": "https://www.foxnews.com/politics/trump-pardons-giuliani-mark-meadows-sidney-powell-others-involved-2020-election-interference-saga",
    "timestamp": "2025-11-10T06:29:47Z"
  },
  {
    "title": "China lifts sanctions on US units of South Korea ship giant Hanwha",
    "description": "China said Monday it would suspend sanctions against US subsidiaries of Hanwha Ocean, one of South Korea’s largest shipbuilders, as a fragile trade truce between Washington and Beijing continued to take shape. The United States and China have been involved in…",
    "link": "https://www.digitaljournal.com/world/china-lifts-sanctions-on-us-units-of-south-korea-ship-giant-hanwha/article",
    "timestamp": "2025-11-10T06:27:32Z"
  },
  {
    "title": "COP30 gets underway in Brazil — and a Trump-shaped hole is hanging over the climate summit",
    "description": "U.S. President Donald Trump recently described climate change as the \"greatest con job ever perpetrated on the world.\"",
    "link": "https://biztoc.com/x/780b59ee54af91a5",
    "timestamp": "2025-11-10T06:23:48Z"
  },
  {
    "title": "US Justice Department Probes Meatpackers, Attorney General Says",
    "description": "President Donald Trump on Friday accused meatpacking companies of driving up U.S. beef prices, which have hit records, through manipulation and collusion, and ordered the Justice Department to investigate. Attorney General Pam Bondi said in an X post the prob…",
    "link": "https://www.insurancejournal.com/news/national/2025/11/10/846949.htm",
    "timestamp": "2025-11-10T06:23:46Z"
  },
  {
    "title": "Global Briefing: In a shifting world order, where do Europe and Ireland stand?",
    "description": "A new Irish Times newsletter connecting the dots between global events and making sense of the forces transforming the world",
    "link": "https://www.irishtimes.com/world/2025/11/10/welcome-to-the-global-briefing/",
    "timestamp": "2025-11-10T06:22:59Z"
  },
  {
    "title": "What the Trump doctrine “drill, baby, drill” brings: Greek EEZ, American giants and mega deals €30 billion Washington – Athens",
    "description": "Upgraded the role of our country which is being transformed into a key player in the new energy map and the security architecture of Europe – Huge the investment opportunities and shielding against the Turkish threat – Of vital importance also the revival of …",
    "link": "https://en.protothema.gr/2025/11/10/what-the-trump-doctrine-drill-baby-drill-brings-greek-eez-american-giants-and-mega-deals-e30-billion-washington-athens/",
    "timestamp": "2025-11-10T06:21:02Z"
  },
  {
    "title": "COP30 gets underway in Brazil — and a Trump-shaped hole is hanging over the climate summit",
    "description": "U.S. President Donald Trump recently described climate change as the \"greatest con job ever perpetrated on the world.\"",
    "link": "https://www.cnbc.com/2025/11/10/cop30-in-brazil-a-trump-shaped-hole-is-hanging-over-the-climate-talks.html",
    "timestamp": "2025-11-10T06:20:30Z"
  },
  {
    "title": "A leaked memo brought down two senior BBC bosses — here's what it said",
    "description": "A leaked memo to the BBC's editorial standards board has dominated headlines in Britain and led to the resignations of two board members. Here's a look at what has happened and how the bosses responded.",
    "link": "https://www.abc.net.au/news/2025-11-10/bbc-bosses-resignation-trump-edit-explained/105991616",
    "timestamp": "2025-11-10T06:20:01Z"
  },
  {
    "title": "China rolls out K-visa, competes with US in wooing global tech talent",
    "description": "The K-visa, rolled out by Beijing last month, is part of China's effort to catch up with the US in the race for global talent and cutting edge technology",
    "link": "https://www.thehindubusinessline.com/news/world/china-creates-new-visa-competing-with-us-in-wooing-global-tech-talent/article70261667.ece",
    "timestamp": "2025-11-10T06:19:50Z"
  },
  {
    "title": "Trump pardons Giuliani, Powell, Chesebro and dozens more involved in 2020 ‘fake electors’ case",
    "description": "President Trump granted pardons for 77 individuals tied to a plot to overturn the 2020 presidential election – including Rudy Giuliani, Sidney Powell, and Kenneth Chesebro, the White House announced late Sunday night.",
    "link": "https://nypost.com/2025/11/10/us-news/trump-pardons-rudy-giuliani-john-eastman-sydney-powell-and-dozens-more-involved-in-2020-fake-elector-scheme/",
    "timestamp": "2025-11-10T06:15:11Z"
  },
  {
    "title": "China steps up efforts to woo global tech talent with a new visa scheme",
    "description": "China has a new visa scheme that is creating job opportunities for foreign professionals, part of its effort to attract global talent and gain an edge in global technology. The K-visa, similar to the H-1B visa in the United States, targets skilled science and…",
    "link": "https://apnews.com/article/china-us-talent-tech-visa-h1b-4c5792cf1b9fec9a846ca002f9e383ae",
    "timestamp": "2025-11-10T06:14:37Z"
  },
  {
    "title": "Trump pardons Giuliani, others charged with 2020 interference",
    "description": "United States President Donald Trump issued \"full, complete and unconditional\" pardons for his former attorneys, Rudy Giuliani and John Eastman, his former White House chief of staff Mark Meadows and ...",
    "link": "https://biztoc.com/x/5a5983266bef9d16",
    "timestamp": "2025-11-10T06:13:14Z"
  },
  {
    "title": "German far-right activist seeks asylum in U.S. as Trump ties deepen",
    "description": "Social media influencer Naomi Seibt, a supporter of the nationalist AfD party, said she is being persecuted in Germany for her political views.BERLIN — A prominent far-right German activist has applied for political asylum in the United States, citing fears f…",
    "link": "https://freerepublic.com/focus/f-news/4351722/posts",
    "timestamp": "2025-11-10T06:06:11Z"
  },
  {
    "title": "Why Bernie Sanders called Democrats voting with Trump’s Republicans to end government shutdown a very bad night and warned millions could lose health care as Senate nears deal",
    "description": "A government shutdown, now the longest in US history, has seen Senator Bernie Sanders fiercely criticize eight Democrats for a vote he deems detrimental to millions' healthcare.  A deal to end the shutdown reportedly includes a promise to vote on expiring hea…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-bernie-sanders-called-democrats-voting-with-trumps-republicans-to-end-government-shutdown-a-very-bad-night-and-warned-millions-could-lose-health-care-as-senate-nears-deal/articleshow/125216129.cms",
    "timestamp": "2025-11-10T06:03:02Z"
  },
  {
    "title": "America’s Self-Defeating China Strategy",
    "description": "America’s Self-Defeating China Strategyforeignaffairs.com",
    "link": "https://www.foreignaffairs.com/united-states/americas-self-defeating-china-strategy",
    "timestamp": "2025-11-10T06:01:07Z"
  },
  {
    "title": "Cornell Strikes Deal With White House to Restore Funding",
    "description": "Cornell University said it reached an agreement with the White House to restore about $250 million in federal funding, becoming the latest elite school to negotiate relief in response to the Trump administration’s campaign to remake higher education. The Itha…",
    "link": "https://www.insurancejournal.com/news/east/2025/11/10/846968.htm",
    "timestamp": "2025-11-10T06:00:39Z"
  },
  {
    "title": "Cristiano Ronaldo has not lost his self-regard in latest interview",
    "description": "Joe Cole on remaining forever young; Pep Guardiola’s incredible record",
    "link": "https://www.irishtimes.com/sport/soccer/2025/11/10/cristiano-ronaldo-has-not-lost-his-self-regard-in-latest-interview/",
    "timestamp": "2025-11-10T06:00:01Z"
  },
  {
    "title": "Cold comfort at Athens forum on democracy in face of threats and rising tide of populism",
    "description": "Organisers express hope for ‘rule by the people’, but speakers take more pessimistic line",
    "link": "https://www.irishtimes.com/world/europe/2025/11/10/cold-comfort-at-athens-forum-on-democracy-in-face-of-threats-and-rising-tide-of-populism/",
    "timestamp": "2025-11-10T06:00:01Z"
  },
  {
    "title": "U.S. escalates military pressure on Venezuela with repeated bomber flights amid rising tensions",
    "description": "The U.S. has deployed B-52 bombers within 50 miles of Venezuela’s coast, marking the fourth such flight since mid-October, alongside warships and the USS Gerald Ford aircraft carrier—raising concerns over psychological warfare or preparation for conflict. Bom…",
    "link": "https://www.naturalnews.com/2025-11-10-us-escalates-pressure-venezuela-repeated-bomber-flights.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "‘Dog-whistle racism’: How far-right claims of protecting women justify abuse of immigrants",
    "description": "Most far-right groups subscribe to an ideology propagating patriarchal view of women’s role in society, says expert",
    "link": "https://www.irishtimes.com/ireland/2025/11/10/dog-whistle-racism-how-far-right-claims-of-protecting-women-justify-abuse-of-immigrants/",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "8 Dem Senators Vote With GOP in First Step to End Shutdown",
    "description": "The Senate took the first step to end the government shutdown on Sunday after a group of moderate Democrats agreed to proceed without a guaranteed extension of health care subsidies, angering many in their caucus who say Americans want them to continue the fi…",
    "link": "https://www.newser.com/story/378377/8-dem-senators-vote-with-gop-in-first-step-to-end-shutdown.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s economic strategy faces scrutiny over inflation, debt, and tariff policies",
    "description": "50-Year Mortgages as Debt Slavery: Trump’s proposed 50-year mortgages trap homeowners in perpetual debt, paying mostly interest with minimal principal reduction—effectively turning homeownership into bank-controlled rent. “Tariff Dividend” Fuels Inflation: Th…",
    "link": "https://www.naturalnews.com/2025-11-10-trumps-economic-strategy-faces-scrutiny.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "A grave injustice is corrected: Trump pardons patriots persecuted for questioning the 2020 election",
    "description": "In a powerful act of restorative justice, President Donald Trump has issued a sweeping pardon for more than seventy individuals who were systematically targeted and persecuted for their efforts to expose the irregularities of the 2020 presidential election. T…",
    "link": "https://www.naturalnews.com/2025-11-10-trump-pardons-patriots-persecuted-questioning-2020-election.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "Trump’s “mega detention” plan: Converting Amazon-style warehouses into mass deportation hubs",
    "description": "The Trump administration is considering converting Amazon-style warehouses (600,000+ sq. ft.) into “mega detention centers” near southern airports to streamline deportations. These facilities would far exceed ICE’s current capacity (150,000–277,000 sq. ft.), …",
    "link": "https://www.naturalnews.com/2025-11-10-converting-amazon-style-warehouses-into-mass-deportation-hubs.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "Trump proposes $2,000 “tariff dividend” for most Americans",
    "description": "President Trump has announced a proposed $2,000 payout per person (excluding high-income earners), funded by tariff revenues, claiming it will benefit middle- and lower-income households without causing inflation. The Treasury reported $195B in 2025 tariff re…",
    "link": "https://www.naturalnews.com/2025-11-10-trump-proposes-tariff-dividend-for-most-americans.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "Turkey seeks safe passage for 200 people in Gaza tunnels amid standoff with Israel",
    "description": "Turkey is attempting to secure safe passage for 200 people trapped in Gaza tunnels. It describes those trapped as civilians, while Israel identifies them as Hamas terrorists. This follows Turkey’s recent success in facilitating the return of an Israeli soldie…",
    "link": "https://www.naturalnews.com/2025-11-10-turkey-passage-gaza-tunnels-standoff-israel.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "Gunfire erupts in Chicago: Border agents targeted after activist’s threats",
    "description": "A suspect fired shots at U.S. Border Patrol agents during an enforcement operation in Chicago’s Little Village neighborhood. The shooter, driving a black Jeep, escaped unharmed, but the incident highlights escalating dangers for law enforcement. A Latin Kings…",
    "link": "https://www.naturalnews.com/2025-11-10-chicago-border-agents-targeted-after-activists-threats.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "U.S.-Russia energy talks intensify: Hungary exempted from U.S. sanctions on Russian energy for one year",
    "description": "The U.S. granted Hungary a one-year exemption from sanctions on Russian oil and gas, allowing continued imports despite Western restrictions. The decision followed discussions between Hungarian PM Viktor Orbán and U.S. President Donald Trump, who supports ene…",
    "link": "https://www.naturalnews.com/2025-11-10-hungary-granted-sanctions-exemption-for-russian-oil.html",
    "timestamp": "2025-11-10T06:00:00Z"
  },
  {
    "title": "Tensions rise as Iran and Israel prepare for possible renewed conflict",
    "description": "Despite strikes, analysts believe Iran retains key nuclear capabilities, raising fears that its uranium stockpile and secret sites could soon trigger renewed conflict with Israel.",
    "link": "https://www.israelnationalnews.com/news/417548",
    "timestamp": "2025-11-10T05:58:09Z"
  }
]