[
  {
    "title": "Trump scrambles to appease crucial voting bloc that is slipping from GOP",
    "description": "President Donald Trump tossed a bone to a crucial voting block that's drifting away from the Republican Party less than a year after helping him win re-election.The 79-year-old president received a higher percentage of the Latino vote in 2024 than any other R…",
    "link": "https://www.rawstory.com/trump-latino-voters-scramble/",
    "timestamp": "2025-12-31T13:54:27Z"
  },
  {
    "title": "Trump-Kennedy Center To Ring In The New Year With Epstein Dancers? South Park Writer Trolls Trump With Domain Purchase",
    "description": "The Trump-Kennedy Center faces fresh controversy after a South Park writer trolls the rebrand with a satirical domain purchase.",
    "link": "https://www.ibtimes.com/trump-kennedy-center-ring-new-year-epstein-dancers-south-park-writer-trolls-trump-domain-3794055",
    "timestamp": "2025-12-31T13:51:41Z"
  },
  {
    "title": "Trump 'Mocks' Kennedy Family Hours After Tatiana Schlossberg Dies—What Did He Do?",
    "description": "President Trump mocked the Kennedy family on Truth Social after Tatiana Schlossberg, JFK's granddaughter, died from acute myeloid leukaemia. This reignited controversy over his decision to rename the Kennedy Center during the family's mourning.",
    "link": "https://www.ibtimes.com/trump-mocks-kennedy-family-hours-after-tatiana-schlossberg-dieswhat-did-he-do-3794056",
    "timestamp": "2025-12-31T13:51:24Z"
  },
  {
    "title": "Donald Trump Florida Visit: Taxpayers Allegedly Foot $3.4M Golf Bill While Zelensky Waits",
    "description": "Trump's Mar-a-Lago golf visits cost taxpayers $3.4M each; projected $300M for second term whilst Ukraine crisis awaits decisive diplomacy.",
    "link": "https://www.ibtimes.com/donald-trump-florida-visit-taxpayers-allegedly-foot-34m-golf-bill-while-zelensky-waits-3794059",
    "timestamp": "2025-12-31T13:51:00Z"
  },
  {
    "title": "Trump Should Seize This Opportunity To Correct His Unforced Error",
    "description": "By Peter Parisi, The Daily Signal | December 31, 2025\nI voted for Donald Trump for president three times, and would again, but his social media post about Rob Reiner after the recent killing of the leftist Hollywood actor-director was unpresidential and, to s…",
    "link": "https://biztoc.com/x/ef49588665ae2e5a",
    "timestamp": "2025-12-31T13:50:39Z"
  },
  {
    "title": "Trump’s approach to Africa: more trade deals, less democracy and human rights",
    "description": "From Christmas strikes in Nigeria to peace deals and talks of trade, the US president’s diplomatic approach to the continent has been all over the place\nWhen he convened the leaders of Rwanda and the Democratic Republic of the Congo to sign a peace deal in ea…",
    "link": "https://biztoc.com/x/ec004002f578b135",
    "timestamp": "2025-12-31T13:50:33Z"
  },
  {
    "title": "Elon Musk’s 2025 recap: how the world’s richest person became its most chaotic",
    "description": "The year of 2025 was dizzying for Elon Musk. The tech titan began the year holding court with Donald Trump in Washington DC. As the months ticked by, one public appearance after another baffled the US and the world. Musk appeared to give a Nazi salute at Trum…",
    "link": "https://biztoc.com/x/9deca976a553c85a",
    "timestamp": "2025-12-31T13:50:23Z"
  },
  {
    "title": "What Was Jeffrey Epstein Reading? Shocking Books on Trump, Tantric Sex, and Immortality Revealed In Kindle List",
    "description": "Jeffrey Epstein's Amazon Kindle receipts reveal books on Trump, tantric sex, narcissism and immortality, raising fresh questions about his private obsessions.",
    "link": "https://www.ibtimes.com/what-was-jeffrey-epstein-reading-shocking-books-trump-tantric-sex-immortality-revealed-kindle-3794065",
    "timestamp": "2025-12-31T13:49:35Z"
  },
  {
    "title": "How Donald Trump launched a new push to amass US government data in 2025",
    "description": "Proponents say compiling personal information in a single database is more efficient. But critics fear risks to privacy.",
    "link": "https://www.aljazeera.com/news/longform/2025/12/31/how-donald-trump-launched-a-new-push-to-amass-us-government-data-in-2025",
    "timestamp": "2025-12-31T13:48:13Z"
  },
  {
    "title": "US applications for jobless benefits fell below 200,000 last week with layoffs historically low",
    "description": "Fewer Americans applied for unemployment benefits last week as layoffs remain low despite a weakening labor market.",
    "link": "https://www.bostonherald.com/2025/12/31/layoffs-historically-low-jobless-applications/",
    "timestamp": "2025-12-31T13:44:49Z"
  },
  {
    "title": "New Details Emerge On Venezuela Port Attack",
    "description": "By George Caldwell, The Daily Signal | December 30, 2025\nPresident Donald Trump on Monday confirmed reports of a United States drone attack on a Venezuelan port last week, telling reporters the target was a loading area for drugs.\nOn Monday, CNN reported the …",
    "link": "https://biztoc.com/x/47835da6dbeef725",
    "timestamp": "2025-12-31T13:39:56Z"
  },
  {
    "title": "Zohran Mamdani New York Mayor swearing-in ceremony date, time, locations. Details here",
    "description": "Zohran Mamdani's oath-taking ceremony as New York Mayor will be held through two events.",
    "link": "https://economictimes.indiatimes.com/news/international/us/zohran-mamdani-new-york-mayor-swearing-in-ceremony-date-time-locations-details-here/articleshow/126273338.cms",
    "timestamp": "2025-12-31T13:39:16Z"
  },
  {
    "title": "Trump Tax Bill Hits You Twice: 'One Big Beautiful' Law Cuts Clinics as Appeals Court Sides with Him",
    "description": "A US appeals court allows Trump's tax law to cut Medicaid funding for Planned Parenthood, raising concerns over clinic closures and healthcare access.",
    "link": "https://www.ibtimes.com/trump-tax-bill-hits-you-twice-one-big-beautiful-law-cuts-clinics-appeals-court-sides-him-3794072",
    "timestamp": "2025-12-31T13:38:30Z"
  },
  {
    "title": "Bari Weiss at CBS Is Manufacturing Consent for Trump's Structural Viciousness",
    "description": "According to the concept of “manufactured consent,” elaborated by Noam Chomsky and Ed Herman in the 1980s, the media carries out a propaganda function in support of the dominant political system. In the United States, this consent has favored particular gover…",
    "link": "https://fpif.org/cbs-pulls-report-challenging-trump-foreign-policy/",
    "timestamp": "2025-12-31T13:38:02Z"
  },
  {
    "title": "London's FTSE scores best year since 2009",
    "description": "The UK's FTSE 100 has had its best year since recovering from the financial crisis, outperforming global rivals as shares soared against broader economic and political uncertainty.",
    "link": "https://www.rte.ie/news/business/2025/1231/1551033-londons-ftses-2025-performance/",
    "timestamp": "2025-12-31T13:37:39Z"
  },
  {
    "title": "Russia Bombards Ukraine's Odesa With Drones Amid Tense Peace Talks",
    "description": "Russian drones blasted apartment buildings and the power grid in the southern Ukraine city of Odesa in an overnight attack that injured six people, including a toddler and two other children, officials said Wednesday\nThe post Russia Bombards Ukraine’s Odesa W…",
    "link": "https://www.breitbart.com/europe/2025/12/31/russia-bombards-buildings-in-ukraines-odesa-amid-tense-peace-talks/",
    "timestamp": "2025-12-31T13:36:40Z"
  },
  {
    "title": "The plot to redraw America (Politico)",
    "description": "Politico:\nThe plot to redraw America … Donald Trump was confused.  —  His top political aide, James Blair, arrived in the Oval Office one afternoon this April to pitch a novel gambit: Republicans could begin padding their narrow U.S. House majority well befor…",
    "link": "https://www.memeorandum.com/251231/p16",
    "timestamp": "2025-12-31T13:35:01Z"
  },
  {
    "title": "'Strength and Honour': White House Uses Iconic Scene From Russell Crowe's Gladiator to Ring In 2026",
    "description": "The White House welcomed 2026 with a Gladiator clip quoting 'strength and honour', sparking mixed reactions over pop culture symbolism in official messaging.",
    "link": "https://www.ibtimes.com/strength-honour-white-house-uses-iconic-scene-russell-crowes-gladiator-ring-2026-3794078",
    "timestamp": "2025-12-31T13:31:47Z"
  },
  {
    "title": "'Keep in mind': Conservative hit with context over fraud claims in viral videos",
    "description": "A CNN panel ripped apart viral video claims by a right-wing YouTuber claiming rampant fraud at Somali-run child care centers in Minnesota.YouTube content creator Nick Shirley recorded video of himself and a conservative activist barging into daycares looking …",
    "link": "https://www.rawstory.com/daycare-fraud-minnesota/",
    "timestamp": "2025-12-31T13:29:36Z"
  },
  {
    "title": "Ukraine–Russia at a crossroads: How the war evolved in 2025 and what comes next",
    "description": "President Donald Trump engaged Ukraine, Russian leaders throughout 2025 in unprecedented diplomatic push to end the war, including Alaska summit and Mar-a-Lago meetings.",
    "link": "https://www.foxnews.com/politics/ukraine-russia-crossroads-how-war-evolved-2025-what-comes-next",
    "timestamp": "2025-12-31T13:29:15Z"
  },
  {
    "title": "EXCLUSIVE: Man Behind Trump Coin Has Even Bigger Plans For President’s Legacy",
    "description": "US Treasurer Brandon Beach, the official behind the $1 Trump coin, has a game plan to put the president's face on paper currency in the very near future.",
    "link": "https://dailycaller.com/2025/12/31/brandon-beach-working-on-250-trump-bill/",
    "timestamp": "2025-12-31T13:28:51Z"
  },
  {
    "title": "Elon Musk’s 2025 recap: how the world’s richest person became its most chaotic",
    "description": "How the tech CEO and ‘Dogefather’ made a mess of the year – from an apparent Nazi salute during his White House tenure to Tesla sales slumps and Starship explosions\nThe year of 2025 was dizzying for Elon Musk. The tech titan began the year holding court with …",
    "link": "https://biztoc.com/x/5ac6c8729baf7f3a",
    "timestamp": "2025-12-31T13:28:15Z"
  },
  {
    "title": "Trump Org Delays $499 Gold Phone Amid Shipping Issues",
    "description": "The latest Trump-branded product is running late. Trump Mobile, a phone venture tied to the Trump Organization and run by Donald Trump Jr. and Eric Trump, has delayed delivery of its $499 gold-colored \"T1\" smartphone, which had been touted for arrival by the …",
    "link": "https://www.newser.com/story/381222/trump-org-delays-499-gold-phone-amid-shipping-issues.html",
    "timestamp": "2025-12-31T13:26:43Z"
  },
  {
    "title": "The separation: Inside the unraveling US-Ukraine partnership",
    "description": "Trump had made some things crystal clear: For all the help the U.S. had given the Ukrainians, it should get something in return.",
    "link": "https://indianexpress.com/article/world/the-separation-inside-the-unraveling-us-ukraine-partnership-10448700/",
    "timestamp": "2025-12-31T13:26:29Z"
  },
  {
    "title": "Suspect in death threat against Richard Grenell ordered held without bond",
    "description": "A Virginia man was hit with criminal charges after allegedly threatening to kill a federal employee who Fox News identified as Richard Grenell, the interim president of the Kennedy Center and a special envoy for President Donald Trump.",
    "link": "https://www.nbcnews.com/politics/justice-department/suspect-death-threat-richard-grenell-president-kennedy-center-trump-rcna251657",
    "timestamp": "2025-12-31T13:25:23Z"
  },
  {
    "title": "From battleships to buildings: Trump's name is everywhere (Tim Reid/Reuters)",
    "description": "Tim Reid / Reuters:\nFrom battleships to buildings: Trump's name is everywhere  —  As a New York businessman, President Donald Trump put his name on real estate, golf courses, vodka, steaks, bottled water and his own university.  —  As president in his second …",
    "link": "https://www.memeorandum.com/251231/p14",
    "timestamp": "2025-12-31T13:25:00Z"
  },
  {
    "title": "Trump’s Drone Ban Is Corrupt, Protectionist Nonsense Dressed Up As A National Security Fix",
    "description": "For years we had to listen to a bipartisan roster of lawmakers insist that TikTok was one of the greatest national security threats to ever face the nation. In reality, they were mostly just interested in protecting Facebook from a short-form video company it…",
    "link": "https://www.techdirt.com/2025/12/31/trumps-drone-ban-is-corrupt-protectionist-nonsense-dressed-up-as-a-national-security-fix/",
    "timestamp": "2025-12-31T13:20:29Z"
  },
  {
    "title": "5 themes that defined business and markets in 2025: Morning Squawk",
    "description": "From tariffs to AI to inflation, these were the trends that shaped Wall Street, Main Street and Silicon Valley in 2025.",
    "link": "https://www.cnbc.com/2025/12/31/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-12-31T13:20:10Z"
  },
  {
    "title": "Trump Said Russia 'Looked Invincible' After Viewing May 9th Military Parade - Reports",
    "description": "WASHINGTON (Sputnik) - US President Donald Trump thought, after viewing footage of the May 9th Victory Day military parade in Moscow, that Russia looked \"invincible,\" The New York Times reported.",
    "link": "https://sputnikglobe.com/20251231/trump-said-russia-looked-invincible-after-viewing-may-9th-military-parade---reports-1123395839.html",
    "timestamp": "2025-12-31T13:18:38Z"
  },
  {
    "title": "Trump narrows Fed chair picks, January decision expected",
    "description": "Ahead of the New Year's holiday, President Donald Trump said he will make a decision on who he wants to lead the Federal Reserve by January. \nCurrent Chair Jerome Powell's term expires in May 2026, and he has made it clear he will fulfill his obligation runni…",
    "link": "https://biztoc.com/x/fd8962b5621e795f",
    "timestamp": "2025-12-31T13:17:12Z"
  },
  {
    "title": "Is TRUMP being soft-rugged? On-chain data points to a $94mln exit",
    "description": "But what’s the endgame behind this silent liquidation?",
    "link": "https://ambcrypto.com/is-trump-being-soft-rugged-on-chain-data-points-to-a-94mln-exit/",
    "timestamp": "2025-12-31T13:15:44Z"
  },
  {
    "title": "U.S. Strikes Against Venezuela: Trump \"Wants the Oil\" as Grassroots Resist \"Economic Asphyxiation\"",
    "description": "As the Trump administration escalates its military campaign against Venezuela, we speak to Venezuelan journalist Andreína Chávez about the latest developments. Responding to the U.S. military’s drone strikes on small boats and seizures of oil tankers off the …",
    "link": "https://www.democracynow.org/2025/12/31/venezuela_trump_air_strikes",
    "timestamp": "2025-12-31T13:12:46Z"
  },
  {
    "title": "'I had to say no': DC plastic surgeon spills on Trump-linked patients with 'Joker' smile",
    "description": "A plastic surgeon who has worked in Washington D.C. for nearly 15 years said this second Trump administration is unique in that she's noticing a \"Mar-a-Lago face\" trend she has had to say no to.Dr. Anita Kulkarni this month did a Substack interview in which s…",
    "link": "https://www.rawstory.com/trump-surgery-admin-mar-a-lago/",
    "timestamp": "2025-12-31T13:09:21Z"
  },
  {
    "title": "Netanyahu said to have raised new Iran strikes with Trump",
    "description": "Israeli Prime Minister Benjamin Netanyahu brought up the topic of the possibily hitting Iran again in 2026 with United States President Donald Trump, Axios reported on Wednesday.More to come......",
    "link": "https://biztoc.com/x/d40c08616b2d67fc",
    "timestamp": "2025-12-31T13:05:59Z"
  },
  {
    "title": "Mexican President Sheinbaum Calls UN To Take a 'Much More Leading Role' In U.S.-Venezuela Tensions",
    "description": "Mexican President Claudia Sheinbaum called on the UN to adopt a \"much more leading role\" in addressing the tensions between the U.S. and Venezuela.",
    "link": "https://www.ibtimes.com/mexican-president-sheinbaum-calls-un-take-much-more-leading-role-us-venezuela-tensions-3794043",
    "timestamp": "2025-12-31T13:04:02Z"
  },
  {
    "title": "Lauren Boebert Rebukes Trump for Using First Veto to Spike Her Colorado Water Project",
    "description": "Boebert even floated the idea that the move could be linked to “political retribution” over her stand on the release of the Jeffrey Epstein files.\nThe post Lauren Boebert Rebukes Trump for Using First Veto to Spike Her Colorado Water Project first appeared on…",
    "link": "https://www.mediaite.com/media/news/lauren-boebert-rebukes-trump-for-using-first-veto-to-spike-her-colorado-water-project/",
    "timestamp": "2025-12-31T13:03:12Z"
  },
  {
    "title": "Conspiracy theorist-podcaster joins crowded GOP race for Colorado governor, but will candidacy ‘go nowhere’?",
    "description": "\"There seems to be an opening for Republicans,\" one former party chairman said. \"But that opening will only exist if we have candidates who won't get pulled into this conspiracy stuff.\"",
    "link": "https://www.denverpost.com/2025/12/31/colorado-governor-race-joe-oltmann-republicans-jared-polis/",
    "timestamp": "2025-12-31T13:00:55Z"
  },
  {
    "title": "The forgotten history of how Benjamin Franklin tried to annex Canada",
    "description": "Donald Trump is not the first American to say that he wanted to possess Canada. At the very start of the U.S., Benjamin Franklin pushed the same agenda",
    "link": "https://nationalpost.com/news/canada/benjamin-franklin-tried-to-annex-canada",
    "timestamp": "2025-12-31T13:00:14Z"
  },
  {
    "title": "Trump Should Seize This Opportunity to Correct His Unforced Error",
    "description": "I voted for Donald Trump for president three times, and would again, but his social media post about Rob Reiner after the recent killing of... Read More\nThe post Trump Should Seize This Opportunity to Correct His Unforced Error appeared first on The Daily Sig…",
    "link": "https://www.dailysignal.com/2025/12/31/trump-should-seize-this-opportunity-to-correct-his-unforced-error/",
    "timestamp": "2025-12-31T13:00:00Z"
  },
  {
    "title": "Report: Federal statistical system needs help to meet its ‘basic mission’ in the face of upheaval",
    "description": "Statistical agencies have lost scores of staff under the Trump administration, threatening their ability to meet their mission, according to a new report from the American Statistical Association.",
    "link": "https://www.nextgov.com/people/2025/12/report-federal-statistical-system-needs-help-meet-its-basic-mission-face-upheaval/410296/",
    "timestamp": "2025-12-31T13:00:00Z"
  },
  {
    "title": "New legal structure of Alberta health system in place, Premier Smith now eyes results",
    "description": "The Alberta government in 2025 completed the final legal foundations of its new health-care system, and Premier Danielle Smith says she'll be working in 2026 to prove it was worth it.",
    "link": "https://www.cbc.ca/news/canada/calgary/alberta-health-lookahead-2026-9.7030203",
    "timestamp": "2025-12-31T13:00:00Z"
  },
  {
    "title": "Russia Sides With Venezuela During Tensions With The U.S.",
    "description": "Russia has reaffirmed that it will provide full support and stands in solidarity with Venezuela as the country faces a United States military blockade in the Caribbean. Moscow’s Foreign Minister Sergey Lavrov held a phone conversation with his Venezuelan coun…",
    "link": "https://www.activistpost.com/russia-sides-with-venezuela-during-tensions-with-the-u-s/",
    "timestamp": "2025-12-31T13:00:00Z"
  },
  {
    "title": "Shamans issue a grim 2026 health forecast involving Donald Trump",
    "description": "Peruvian shamans have issued a stark warning, predicting that US President Donald Trump will fall seriously ill in the coming year. This prediction comes amid ongoing public speculation about Trump's health, fueled by past photos of bruised hands and swollen …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/shamans-issue-a-grim-2026-health-forecast-involving-donald-trump/articleshow/126272356.cms",
    "timestamp": "2025-12-31T12:58:33Z"
  },
  {
    "title": "Former Soviet republics react to Ukraine’s failed strike on Putin residence",
    "description": "The leaders of several former Soviet republics have denounced Kiev’s reported drone attack on Russian President Vladimir Putin’s residence Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630282-former-soviet-republics-react-putin-residence-attack/",
    "timestamp": "2025-12-31T12:55:38Z"
  },
  {
    "title": "Trump Kennedy Center appointees stacked the deck before name change vote: report",
    "description": "Before voting to add Donald Trump's name to the John F. Kennedy Center for the Performing Arts, the center's bylaws were altered to ensure the measure would pass without opposition, according to new reporting.According to documents obtained by the Washington …",
    "link": "https://www.rawstory.com/kennedy-center-name-change/",
    "timestamp": "2025-12-31T12:52:36Z"
  },
  {
    "title": "Zohran Mamdani is set to be sworn in as mayor as NYC rings in the New Year",
    "description": "Mamdani's office expects thousands of people to attend the block party and says there will be performances, music and interfaith elements at the public inauguration.",
    "link": "https://www.bostonherald.com/2025/12/31/zohran-mamdani-new-york-mayor/",
    "timestamp": "2025-12-31T12:51:33Z"
  },
  {
    "title": "Trump Mobile delays shipment of gold-coloured smartphone",
    "description": "Trump Mobile has pushed back plans to deliver its gold-coloured smartphone by the end of the year, the Financial Times reported today.",
    "link": "https://www.rte.ie/news/business/2025/1231/1551027-trump-mobile-delays-shipment-of-gold-colored-smartphone/",
    "timestamp": "2025-12-31T12:51:26Z"
  },
  {
    "title": "Mamdani 'accidentally honors' free market with subway station ceremony, Washington Post argues",
    "description": "The Washington Post editorial board criticized NYC Mayor-elect Zohran Mamdani's subway station inauguration plan, arguing it inadvertently honored capitalism.",
    "link": "https://www.foxnews.com/media/mamdani-accidentally-honors-free-market-subway-station-ceremony-washington-post-argues",
    "timestamp": "2025-12-31T12:47:18Z"
  },
  {
    "title": "Trump claims 'windmills kill all our beautiful Bald eagles,' shares image of dead falcon in Israel",
    "description": "Eagle-eyed users were quick to point out that the image Trump posted on Truth Social, featured in Haaretz in 2017, was taken in Israel.  'Is he the eagle and Bibi the windmill?' one user wondered. 'Our own fucking president can't tell a falcon and bald eagle …",
    "link": "https://www.haaretz.com/us-news/2025-12-31/ty-article/.premium/trump-windmills-kill-our-beautiful-bald-eagles-shares-image-of-dead-falcon-in-israel/0000019b-73e3-d379-a3bb-f3f79deb0000",
    "timestamp": "2025-12-31T12:47:06Z"
  },
  {
    "title": "From battleships to buildings: Trump's name is everywhere",
    "description": "WASHINGTON, Dec 31 (Reuters) - As a New York businessman, President Donald Trump ‌put his name on real estate, golf courses, vodka, steaks, bottled water and his own university. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/31/from-battleships-to-buildings-trump039s-name-is-everywhere",
    "timestamp": "2025-12-31T12:47:00Z"
  },
  {
    "title": "China announces it 'successfully completed' Taiwan military maneuvers",
    "description": "China’s People’s Liberation Army says it has “successfully completed” two days of military exercises in the waters off Taiwan",
    "link": "https://abcnews.go.com/International/wireStory/china-announces-successfully-completed-taiwan-military-maneuvers-128801777",
    "timestamp": "2025-12-31T12:45:21Z"
  },
  {
    "title": "Wednesday: Hili dialogue",
    "description": "Welcome to a Hump Day (“水曜日” in Japanese), the last day of 2025, New Year’s Eve, and, appropriately, National Champagne Day. Here’s a short video about how it’s made, which helps you understand why the good stuff is not cheap. (Note: the name “champagne” is r…",
    "link": "https://whyevolutionistrue.com/2025/12/31/wednesday-hili-dialogue-562/",
    "timestamp": "2025-12-31T12:45:11Z"
  },
  {
    "title": "Eyewitnesses Detail Mysterious Explosion in Northwest Venezuela",
    "description": "Two eyewitnesses in Northwestern Venezuela in an area known for drug trafficking tell NBC News that they saw an explosion on Dec. 18 that destroyed a hut that was possibly used for storage. It is unclear if it's the same strike that President Donald Trump men…",
    "link": "https://www.today.com/video/eyewitnesses-detail-mysterious-explosion-in-northwest-venezuela-255221317518",
    "timestamp": "2025-12-31T12:42:35Z"
  },
  {
    "title": "How Billionaires of Conscience Can Use Their Wealth to Take Down Trump",
    "description": "There are reportedly about 900 billionaires (probably more) in the US About 5% can be described as enlightened people who know the importance of contributing to organizations that advance justice. They are also appalled by the Trump dictatorship and are not p…",
    "link": "https://www.commondreams.org/opinion/billionaires-vs-trump",
    "timestamp": "2025-12-31T12:40:02Z"
  },
  {
    "title": "Intelligence confirmed terrorists’ presence before joint strikes — DHQ",
    "description": "Nigeria’s Defence Headquarters confirms intelligence verified terrorist presence before recent joint US-Nigerian strikes. A battle damage assessment is ong\n\nRead More: https://punchng.com/intelligence-confirmed-terrorists-presence-before-joint-strikes-dhq/",
    "link": "https://punchng.com/intelligence-confirmed-terrorists-presence-before-joint-strikes-dhq/",
    "timestamp": "2025-12-31T12:37:28Z"
  },
  {
    "title": "Oil prices set for biggest annual drop since 2020",
    "description": "Oil prices were little changed today and are set to fall more than 15% over the course of 2025, as oversupply concerns grew in a year marked by wars, higher tariffs and OPEC+ output and sanctions on Russia, Iran and Venezuela.",
    "link": "https://www.rte.ie/news/business/2025/1231/1551018-world-oil-prices/",
    "timestamp": "2025-12-31T12:32:59Z"
  },
  {
    "title": "Trump administration halts child care payments to Minnesota over alleged fraud",
    "description": "Minnesota child care fraud: Federal child care payments to Minnesota are frozen. This follows allegations of widespread fraud in child care and healthcare programs. Investigations by the FBI and DHS are underway. The freeze impacts funds for thousands of chil…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-halts-child-care-payments-to-minnesota-over-alleged-fraud/articleshow/126271157.cms",
    "timestamp": "2025-12-31T12:30:42Z"
  },
  {
    "title": "Hero: Bishop Mariann Budde",
    "description": "The staff of Mother Jones is, once again, rounding up the heroes and monsters of the past year. This is a non-exhaustive and totally subjective list, giving our reporters a chance to write about something that brought joy, discontent, or curiosity. Happy holi…",
    "link": "https://www.motherjones.com/politics/2025/12/hero-bishop-mariann-budde/",
    "timestamp": "2025-12-31T12:30:00Z"
  },
  {
    "title": "The Five Most Unhinged Climate Lies Trump Told in 2025",
    "description": "This story was originally published by Guardian and is reproduced here as part of the Climate Desk collaboration. In the past decade at the forefront of US politics, Donald Trump has unleashed a barrage of unusual, misleading, or dubious assertions about the …",
    "link": "https://www.motherjones.com/politics/2025/12/the-five-most-unhinged-climate-lies-trump-told-in-2025/",
    "timestamp": "2025-12-31T12:30:00Z"
  },
  {
    "title": "Trump Sparks War Panic as Dementia Fears Grow Over Vague Venezuela Strike Claim",
    "description": "Donald Trump faces backlash after a vague claim about a strike in Venezuela sparks war fears and concerns about his clarity.",
    "link": "https://www.ibtimes.com/trump-sparks-war-panic-dementia-fears-grow-over-vague-venezuela-strike-claim-3794040",
    "timestamp": "2025-12-31T12:28:14Z"
  },
  {
    "title": "China announces it 'successfully completed' Taiwan military maneuvers",
    "description": "China's People's Liberation Army said Wednesday that it “successfully completed” two days of military exercises in the waters off Taiwan, concluding a set of...",
    "link": "https://www.yahoo.com/news/articles/china-announces-successfully-completed-taiwan-122250412.html",
    "timestamp": "2025-12-31T12:22:50Z"
  },
  {
    "title": "Trump Warns Iran Of Possible Strike, Urges Hamas To Disarm After Meeting Netanyahu",
    "description": "By Andrea Shalal, Maayan Lubell & Gram Slattery via The Daily Signal | December 29, 2025\nU.S. President Donald Trump said on Monday the United States could support another major strike on Iran, were it to resume rebuilding its ballistic missile or nuclear wea…",
    "link": "https://biztoc.com/x/ca5c5ecb2413ad9d",
    "timestamp": "2025-12-31T12:22:08Z"
  },
  {
    "title": "Ray Dalio says US is suffering a breakdown of ‘monetary, political and geopolitical orders.’ Here’s what you can do now",
    "description": "In a lengthy social media post in April, Dalio argued that the tariff drama is merely a symptom of deeper structural problems",
    "link": "https://finance.yahoo.com/news/ray-dalio-says-us-suffering-122000943.html",
    "timestamp": "2025-12-31T12:20:00Z"
  },
  {
    "title": "Here Are The 10 Biggest Media Hoaxes Of 2025",
    "description": "In no particular order, here are the biggest hoaxes run by our truth-deprived media throughout the past year.",
    "link": "https://thefederalist.com/2025/12/31/here-are-the-10-biggest-media-hoaxes-of-2025/",
    "timestamp": "2025-12-31T12:17:47Z"
  },
  {
    "title": "Kennedy Center Boss Claims CNN and WaPo Are Emailing Performers, ‘Encouraging’ Them to Boycott Shows",
    "description": "The accusations land amid a growing revolt from artists who say the center’s leadership has been politicized following Trump’s shake-up.\nThe post Kennedy Center Boss Claims CNN and WaPo Are Emailing Performers, ‘Encouraging’ Them to Boycott Shows first appear…",
    "link": "https://www.mediaite.com/media/news/kennedy-center-boss-claims-cnn-and-wapo-are-emailing-performers-encouraging-them-to-boycott-shows/",
    "timestamp": "2025-12-31T12:11:34Z"
  },
  {
    "title": "Trump's First Second-Term Vetoes Deny Clean Drinking Water and Return of Native Land",
    "description": "Both vetoes by Trump were bills passed by Congress unanimously, setting up a pending override showdown if Republicans have any guts.",
    "link": "https://www.jezebel.com/trump-vetoes-second-term-clean-water-colorado-miccosukee-reserved-area-florida-native-land",
    "timestamp": "2025-12-31T12:09:29Z"
  },
  {
    "title": "'Super flu' cases surge and Minnesota child care payments come to a halt: Morning Rundown",
    "description": "A new strain of the flu is spiking, the Trump administration freezes child care payments to the state of Minnesota and eyewitnesses recount an explosion in Venezuela that has raised concern over the U.S. military action against the South American country.",
    "link": "https://www.nbcnews.com/news/us-news/super-flu-cases-surge-minnesota-child-care-payments-come-halt-morning-rcna251649",
    "timestamp": "2025-12-31T12:07:06Z"
  },
  {
    "title": "Trump family business delays launch of gold smartphone",
    "description": "US-made device planned for release by end of year hit by recent government shutdown affecting shipments",
    "link": "https://www.irishtimes.com/world/us/2025/12/31/trump-family-business-delays-launch-of-gold-smartphone/",
    "timestamp": "2025-12-31T12:03:55Z"
  },
  {
    "title": "Democrats had major election victories in 2025, but wins don’t erase party’s critical weaknesses",
    "description": "Democrats scored major victories in 2025 elections despite brand challenges. DNC chair sees silver lining as party prepares for crucial midterms ahead.",
    "link": "https://www.foxnews.com/politics/democrats-had-major-election-victories-2025-wins-dont-erase-partys-critical-weaknesses",
    "timestamp": "2025-12-31T12:00:58Z"
  },
  {
    "title": "Peruvian Shamans, Armed with Coca and Ayahuasca, Predict Trump Victory in Venezuela for 2026",
    "description": "A group of indigenous shamans in Lima, Peru, organized a ritual on Monday to access visions of the future in anticipation of the 2026 new year. These visions, they told assembled media, showed the demise of Venezuelan dictator Nicolás Maduro and a potential t…",
    "link": "https://www.breitbart.com/latin-america/2025/12/31/peruvian-shamans-armed-with-coca-and-ayahuasca-predict-trump-victory-in-venezuela-for-2026/",
    "timestamp": "2025-12-31T12:00:29Z"
  },
  {
    "title": "If 2025 tested our resolve, 2026 will prove our resilience",
    "description": "They say with age comes wisdom. When I was much younger, I laughed at that idea. I was convinced I already possessed all the wisdom I’d ever need. Now, with time behind me, lots of it, I laugh for a very different reason, and at how little I truly understood …",
    "link": "https://www.advocate.com/voices/2026-will-prove-lgbtq-resilience",
    "timestamp": "2025-12-31T12:00:02Z"
  },
  {
    "title": "How $160 million worth of export-controlled Nvidia chips were allegedly smuggled into China",
    "description": "The scheme involved falsifying shipping documents to misclassify the GPUs and hide their true destinations, including China and other prohibited locations.",
    "link": "https://www.cnbc.com/2025/12/31/160-million-export-controlled-nvidia-gpus-allegedly-smuggled-to-china.html",
    "timestamp": "2025-12-31T12:00:01Z"
  },
  {
    "title": "Sanders Backs Push for Billionaire Tax in California as Newsom Raises Money to Fight It",
    "description": "US Sen. Bernie Sanders on Tuesday endorsed an effort in California to impose a one-time tax on the wealth of the state's billionaires, a grassroots campaign that has drawn opposition from Democratic Gov. Gavin Newsom and powerful investors.Sanders (I-Vt.) sai…",
    "link": "https://www.commondreams.org/news/sanders-california-billionaire-tax",
    "timestamp": "2025-12-31T11:57:23Z"
  },
  {
    "title": "RIP MTV: The 9 Music Videos that Defined the Network & Reshaped the Culture (& the 1 That Killed Feminism)",
    "description": "As of today, MTV will no longer air music videos—and of all the lists and round-ups published this past month, few, if any, highlighted women's impact on the medium.",
    "link": "https://www.jezebel.com/rip-mtv-the-9-music-videos-that-defined-the-network-reshaped-the-culture-the-1-that-killed-feminism",
    "timestamp": "2025-12-31T11:56:29Z"
  },
  {
    "title": "How many countries has Trump bombed in 2025?",
    "description": "Venezuela is the latest country to be hit by US strikes as the Trump administration ramps up military interventions.",
    "link": "https://www.aljazeera.com/news/2025/12/31/how-many-countries-has-trump-bombed-in-2025",
    "timestamp": "2025-12-31T11:53:39Z"
  },
  {
    "title": "Wars, unrest, AI and tariffs: The global crises that defined 2025",
    "description": "Global instability marked 2025. India-Pakistan tensions flared after a terror attack. The Israel-Gaza war continued. Russia-Ukraine conflict persisted. The US expanded tariffs. France faced a major museum heist. Bangladesh and Nepal saw political unrest. Epst…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/wars-unrest-ai-and-tariffs-the-global-crises-that-defined-2025/articleshow/126271008.cms",
    "timestamp": "2025-12-31T11:51:37Z"
  },
  {
    "title": "How Trump Outmaneuvered The Economists",
    "description": "They were certain from the start. The day Donald Trump returned to the Oval Office in January 2025, the alarms went off across the economics establishment. Tariffs, trade wars, policy chaos. The verdict was unanimous: Recession loomed, stagflation threatened,…",
    "link": "https://biztoc.com/x/f0ca5ff0330dbf11",
    "timestamp": "2025-12-31T11:48:30Z"
  },
  {
    "title": "Who is Mike Tomlin’s wife Kiya Winston? Inside the fashion designer’s life, career, and marriage to the Pittsburgh Steelers' head coach",
    "description": "Kiya Winston, wife of Steelers coach Mike Tomlin, has carved her own successful path in fashion. Born in New Jersey, she developed a passion for design early, leading to her own clothing brand, Kiya Tomlin Fashion. She met Mike at William and Mary and married…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/who-is-mike-tomlins-wife-kiya-winston-inside-the-fashion-designers-life-career-and-marriage-to-the-pittsburgh-steelers-head-coach/articleshow/126271213.cms",
    "timestamp": "2025-12-31T11:47:11Z"
  },
  {
    "title": "The right hit peak incel in 2025",
    "description": "From Mar-a-Lago face to Elon Musk, MAGA's sexual dysfunction exposed itself",
    "link": "https://www.salon.com/2025/12/31/the-right-hit-peak-incel-in-2025/",
    "timestamp": "2025-12-31T11:45:27Z"
  },
  {
    "title": "Here is to a quarter century of US military havoc",
    "description": "The US has waged its 'war on terror' for 25 years now, sowing death and destruction across the world.",
    "link": "https://www.aljazeera.com/opinions/2025/12/31/here-is-to-a-quarter-century-of-us-military-havoc",
    "timestamp": "2025-12-31T11:40:04Z"
  },
  {
    "title": "'I am so happy': Crowd celebrates Thailand's release of Cambodian soldiers",
    "description": "The release is a key part of a ceasefire deal struck to bring peace to the border between the two countries.",
    "link": "https://www.abc.net.au/news/2025-12-31/thailand-releases-cambodian-soldiers-as-part-of-ceasefire-deal/106190984",
    "timestamp": "2025-12-31T11:39:28Z"
  },
  {
    "title": "Donald Trump Mocked After Seemingly Confusing Bald Eagle with a Falcon",
    "description": "President Donald Trump has been mocked online after he appeared to confuse a bald eagle with a falcon.\nTrump shared a post on Truth Social on the evening of Tuesday, December 30, which showed a dead bird lying in front of a windmill. The post read, \"Windmills…",
    "link": "https://biztoc.com/x/14df1c2158e357d1",
    "timestamp": "2025-12-31T11:37:42Z"
  },
  {
    "title": "Retail investors close out one of their best years ever. How they beat Wall Street at their own game",
    "description": "Mom-and-pop investors bought the dip at key points, giving them outsized benefits from the market's run this year.",
    "link": "https://www.cnbc.com/2025/12/31/retail-investors-dip-buying-taco-trade-strong-2025.html",
    "timestamp": "2025-12-31T11:35:41Z"
  },
  {
    "title": "World rings in 2026 and waves goodbye to year of Trump, a new pope and hopes for peace",
    "description": "The world is waving goodbye to 2025 and ringing in 2026 with fireworks from Auckland and Sydney to London and New York.",
    "link": "https://www.nbcnews.com/world/asia/new-year-celebrations-world-2025-2026-sydney-trump-ukraine-gaza-peace-rcna251651",
    "timestamp": "2025-12-31T11:33:05Z"
  },
  {
    "title": "Dollar Set for Worst Year Since 2017 With Fed Drama Center Stage",
    "description": "The dollar is poised for its sharpest annual retreat in eight years and investors say more declines are coming if the next Federal Reserve chief opts for deeper interest-rate cuts as expected.",
    "link": "https://financialpost.com/pmn/business-pmn/dollar-set-for-worst-year-since-2017-with-fed-drama-center-stage",
    "timestamp": "2025-12-31T11:31:00Z"
  },
  {
    "title": "U.S. dollar set for worst year since 2017 with Fed drama centre stage",
    "description": "The U.S. dollar is poised for its sharpest annual retreat in eight years and investors say more declines are coming. Read more.",
    "link": "https://financialpost.com/news/economy/dollar-worst-year-2017-fed-drama",
    "timestamp": "2025-12-31T11:31:00Z"
  },
  {
    "title": "A rough year for journalists in 2025, with a little hope for things to turn around",
    "description": "NEW YORK (AP) — By nearly any measure, 2025 has been a rough year for anyone concerned about freedom of the press. It’s likely to be the deadliest year on record for journalists and media workers. The number of assaults on reporters in the U.S. nearly equals …",
    "link": "https://freerepublic.com/focus/f-news/4359682/posts",
    "timestamp": "2025-12-31T11:26:28Z"
  },
  {
    "title": "U.S. lawyers to review millions of pages of Epstein files in January before further release, document shows",
    "description": "The U.S. Justice Department revealed it has 5.2 million pages of Epstein files left to review and needs 400 lawyers from four different department offices to help with the process through late January, according to a government document reviewed by Reuters on…",
    "link": "https://www.cbc.ca/news/world/epstein-files-release-legal-review-9.7030888",
    "timestamp": "2025-12-31T11:25:40Z"
  },
  {
    "title": "Drugmakers raise US prices on 350 medicines despite pressure from Donald Trump",
    "description": "Drug companies are set to increase prices on over 350 medicines. This includes vital vaccines and cancer drugs. The median price hike is around 4 percent. Some companies are also cutting prices on a few drugs. These changes are planned for the upcoming year. …",
    "link": "https://economictimes.indiatimes.com/news/international/business/drugmakers-raise-us-prices-on-350-medicines-despite-pressure-from-donald-trump/articleshow/126271120.cms",
    "timestamp": "2025-12-31T11:23:49Z"
  },
  {
    "title": "Clooney granted fast-tracked French citizenship after request from top official",
    "description": "France's foreign affairs minister underlined Clooney's philanthropy and economic impact on France as motivation for the decision.",
    "link": "https://www.politico.eu/article/george-amal-clooney-french-citizenship-through-fast-track-process-request-jean-noel-barrot/",
    "timestamp": "2025-12-31T11:19:06Z"
  },
  {
    "title": "Mamdani's inauguration: New York, new year, new mayor",
    "description": "NEW YORK, Dec 31 (Reuters) - Zohran Mamdani was a trailblazing ‌candidate whom many in his city of 8 million  -- some with hope, some with trepidation -- expect to be a disruptive New York mayor. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/31/mamdani039s-inauguration-new-york-new-year-new-mayor",
    "timestamp": "2025-12-31T11:16:00Z"
  },
  {
    "title": "From battleships to buildings: Trump's name is everywhere",
    "description": "President Donald Trump is attaching his name to government programs and national institutions. This includes buildings, Navy warships, a visa program, and a drug pricing website. Historians question the longevity of this branding effort. Critics worry it crea…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/from-battleships-to-buildings-trumps-name-is-everywhere/articleshow/126270952.cms",
    "timestamp": "2025-12-31T11:14:49Z"
  }
]