[
  {
    "title": "The 1600: Carlo vs. Carlo Returns",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-carlo-vs-carlo-returns-2089939",
    "timestamp": "2025-06-24T13:42:21Z"
  },
  {
    "title": "Breaking Down the Environmental Risks From Strikes on Iran’s Nuclear Enrichment Sites",
    "description": "The U.S. attack on Iran's nuclear enrichment sites poses minimum radiation danger.",
    "link": "https://time.com/7297135/environmental-risks-bombing-iran-nuclear-enrichment-sites/",
    "timestamp": "2025-06-24T13:40:18Z"
  },
  {
    "title": "Global stock market reacts to Trump’s ceasefire in Israel-Iran war",
    "description": "Stocks rallied and oil prices fell Tuesday after U.S. President Donald Trump announced what appears to be a shaky ceasefire in the Israel-Iran war.The tentative truce proposed by Trump remained uncertain after Israel said Iran had launched missiles into its a…",
    "link": "https://biztoc.com/x/6b70c36e45fc0341",
    "timestamp": "2025-06-24T13:38:55Z"
  },
  {
    "title": "Oil prices drop sharply, and stocks rally worldwide after announcement of Israel-Iran ceasefire",
    "description": "Oil prices fell more than 4% to below where they were before the conflict began.",
    "link": "https://www.bostonherald.com/2025/06/24/financial-markets-june-24/",
    "timestamp": "2025-06-24T13:38:54Z"
  },
  {
    "title": "Wall Street up at open as Middle East tensions ease",
    "description": "Major United States stock exchanges traded with gains at the open on Tuesday as fears over a larger conflict escalation in the Middle East dissipated with US President Donald Trump announcing that Isr...",
    "link": "https://biztoc.com/x/70ec2707a35c5524",
    "timestamp": "2025-06-24T13:38:52Z"
  },
  {
    "title": "Tucker Carlson Claims MAGA Victory Over Ted Cruz, Mark Levin",
    "description": "Carlson called the MAGA hawks \"nihilists\" and \"buffoons\" whose priorities were \"absolutely willing to destroy the United States.\"",
    "link": "https://www.newsweek.com/tucker-carlson-maga-levin-cruz-2089874",
    "timestamp": "2025-06-24T13:38:10Z"
  },
  {
    "title": "Israel-Iran ceasefire is in effect, Trump says",
    "description": "President Donald Trump expressed deep frustration with both sides when the deal initially faltered.",
    "link": "https://www.pbs.org/newshour/world/israel-iran-ceasefire-is-in-effect-trump-says",
    "timestamp": "2025-06-24T13:38:05Z"
  },
  {
    "title": "'Trump has moved on': MTG warned she's getting dumped by MAGA",
    "description": "In the Georgia political world, reaction to U.S. military attacks against three nuclear sites in Iran fell mostly, but not entirely, along party lines.President Donald Trump announced the strikes Saturday night, calling them “a spectacular military success.”T…",
    "link": "https://www.rawstory.com/trump-has-moved-on-marjories-taylor-gretg-warned-she-s-getting-dumped-by-maga/",
    "timestamp": "2025-06-24T13:37:19Z"
  },
  {
    "title": "The ballistic missile threat persists",
    "description": "Iran’s vast missile arsenal, dispersed across underground bunkers, urban areas and remote regions, will not vanish overnight, although Israel has significantly degraded it. Analysis.",
    "link": "https://www.israelnationalnews.com/news/410582",
    "timestamp": "2025-06-24T13:37:13Z"
  },
  {
    "title": "Nasdaq opens 1% higher after Trump's Israel-Iran ceasefire announcement",
    "description": "Wall Street's main indexes opened higher on Tuesday as President Donald Trump announced a ceasefire between Israel and Iran, calming investor nerves after the 12-day conflict hurt global risk assets and fanned inflation concerns.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-after-trumps-israel-iran-ceasefire-announcement/articleshow/122050413.cms",
    "timestamp": "2025-06-24T13:36:37Z"
  },
  {
    "title": "Get It All Out of the System",
    "description": "Plus: Strait of Hormuz possibly closing, NYC's socialist nonsense hopefully coming to a close, and more...",
    "link": "https://reason.com/2025/06/24/get-it-all-out-of-the-system/",
    "timestamp": "2025-06-24T13:34:06Z"
  },
  {
    "title": "Trump Freaks Out That Israel Has Already Violated the Iran Ceasefire",
    "description": "So much for Donald Trump’s “12 Day War.” The U.S. president said Tuesday that both Israel and Iran have violated a ceasefire.\r\nTrump was furious when speaking to reporters Tuesday morning, just hours after he’d announced an impending ceasefire that would end …",
    "link": "https://newrepublic.com/post/197142/donald-trump-freaks-israel-violated-iran-ceasefire",
    "timestamp": "2025-06-24T13:31:01Z"
  },
  {
    "title": "There Was No US Strike on Iran",
    "description": "Humans have a tendency to obey political authorities, even when it may not seem in each individual’s self-interest to do so. Nationalism is a modern manifestation of this phenomenon. After the US government’s strike on nuclear facilities of the Iranian govern…",
    "link": "https://www.econlib.org/there-was-no-us-strike-on-iran/",
    "timestamp": "2025-06-24T13:30:14Z"
  },
  {
    "title": "New study shows that sports help transgender teen's mental health",
    "description": "At a time when transgender athletes, especially trans girls and women, are under attack from federal and state governments, a new study shows how beneficial sports participation is for young trans people.",
    "link": "https://www.advocate.com/lgbt-youth/sports-help-trans-teens-mental-health",
    "timestamp": "2025-06-24T13:30:05Z"
  },
  {
    "title": "Charlamagne says Dems ‘sound like hypocrites’ for demanding congressional approval for Iran strikes",
    "description": "Radio host Charlamagne tha God called out Democrats on Monday for their outrage about President Donald Trump launching strikes on Iran without congressional authority, saying they turned a blind eye when Democrats recently did the same.",
    "link": "https://nypost.com/2025/06/24/media/charlamagne-says-dems-sound-like-hypocrites-after-iran-strikes/",
    "timestamp": "2025-06-24T13:29:47Z"
  },
  {
    "title": "‘The Happy Hooker of Politics’: Mark Levin Wrecks Tucker Carlson, Accuses Him of Harboring ‘Deep Hatred for President Trump’",
    "description": "Fox News' Mark Levin minced no words in his latest denunciation of his ex-colleague Tucker Carlson, deeming him \"the Happy Hooker of politics.\"\nThe post ‘The Happy Hooker of Politics’: Mark Levin Wrecks Tucker Carlson, Accuses Him of Harboring ‘Deep Hatred fo…",
    "link": "https://www.mediaite.com/media/news/the-happy-hooker-of-politics-mark-levin-wrecks-tucker-carlson-accuses-him-of-harboring-deep-hatred-for-president-trump/",
    "timestamp": "2025-06-24T13:29:17Z"
  },
  {
    "title": "Funding crisis stalls UN probe into possible war crimes in Congo",
    "description": "GENEVA (Reuters) -A U.N.-mandated commission investigating suspected human rights violations and war crimes in Democratic Republic of Congo cannot proceed due to a funding crisis in the U.N. human rights office (OHCHR), according to a letter seen by Reuters. …",
    "link": "https://www.thestar.com.my/news/world/2025/06/24/funding-crisis-stalls-un-probe-into-possible-war-crimes-in-congo",
    "timestamp": "2025-06-24T13:29:00Z"
  },
  {
    "title": "Alberta industry blew past gas flaring ceiling in 2024 as province eliminates limit",
    "description": "Energy producers in Alberta, Canada's top oil-producing province, blew past the province's self-imposed limit on annual natural gas flaring in 2024 for a second year in a row, Reuters calculations show.",
    "link": "https://www.cbc.ca/news/canada/edmonton/alberta-flaring-1.7569189",
    "timestamp": "2025-06-24T13:28:49Z"
  },
  {
    "title": "Powell says Fed can wait to reduce interest rates as Trump demands cuts",
    "description": "By CHRIS RUGABER, AP Economics Writer\nWASHINGTON (AP) — The Federal Reserve will continue to wait and see how the economy evolves before deciding whether to reduce its key interest rate, Chair Jerome Powell said Tuesday, a stance directly at odds with Preside…",
    "link": "https://biztoc.com/x/de2d280508bd5d48",
    "timestamp": "2025-06-24T13:28:08Z"
  },
  {
    "title": "Trump: China can continue to purchase oil from Iran",
    "description": "United States President Donald Trump took to Truth Social again on Tuesday, stating that China can \"now continue to purchase oil from Iran.\" His remarks came after he helped broker a ceasefire agreeme...",
    "link": "https://biztoc.com/x/bfce13b602bdf227",
    "timestamp": "2025-06-24T13:27:59Z"
  },
  {
    "title": "Israel Can Still Lose the Peace",
    "description": "History shows that Israel’s successful wars don’t always produce stability.",
    "link": "http://foreignpolicy.com/2025/06/24/israel-peace-iran-ceasefire-palestine-order/",
    "timestamp": "2025-06-24T13:26:59Z"
  },
  {
    "title": "Powell says Fed can wait to reduce interest rates as Trump demands cuts",
    "description": "Powell says Fed can wait to reduce interest rates as Trump demands cutstwincities.com",
    "link": "https://www.twincities.com/2025/06/24/federal-reserve-jerome-powell/",
    "timestamp": "2025-06-24T13:26:46Z"
  },
  {
    "title": "An angry Trump decries Israel, Iran for breaking ceasefire (Jake Traylor/Politico)",
    "description": "Jake Traylor / Politico:\nAn angry Trump decries Israel, Iran for breaking ceasefire  —  Trump spoke ahead of flying to Europe to meet with NATO allies.  —  A visibly frustrated President Donald Trump condemned Israel and Iran Tuesday morning for violating a c…",
    "link": "https://www.memeorandum.com/250624/p42",
    "timestamp": "2025-06-24T13:25:01Z"
  },
  {
    "title": "Trump’s F-Bomb Meltdown Over Iran-Israel Sparks MAGA Cheers, Critics’ Horror",
    "description": "\"Inject this straight into my veins,\" cheered far-right GOP Rep. Marjorie Taylor Greene.",
    "link": "https://www.huffpost.com/entry/donald-trump-f-bomb-israel-iran_n_685a8a9ce4b07dc1294478c4",
    "timestamp": "2025-06-24T13:24:48Z"
  },
  {
    "title": "Despite growing divide at the Fed, Chair Powell throws cold water on the possibility of a July rate cut",
    "description": "It’s still too soon for the Federal Reserve to consider lowering interest rates, Chair Jerome Powell said Tuesday.",
    "link": "https://www.cnn.com/2025/06/24/economy/fed-chair-powell-testimony-capitol-hill",
    "timestamp": "2025-06-24T13:23:43Z"
  },
  {
    "title": "US Fed chair to signal no rush for rate cuts despite Trump pressure",
    "description": "Federal Reserve Chair Jerome Powell indicated to Congress that the central bank is prepared to assess the impact of tariffs before considering further interest rate cuts, despite President Trump's urging for immediate reductions. Powell emphasized the Fed's c…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-fed-chair-to-signal-no-rush-for-rate-cuts-despite-trump-pressure/articleshow/122050241.cms",
    "timestamp": "2025-06-24T13:22:44Z"
  },
  {
    "title": "Trump delivers angry outburst at Israel-Iran ceasefire breaches",
    "description": "“They don’t know what the f*** they’re doing.”",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/24/trump-delivers-angry-outburst-at-israel-iran-ceasefire-breaches",
    "timestamp": "2025-06-24T13:22:38Z"
  },
  {
    "title": "Trump’s Big Beautiful Bill Will Harm Those At The Bottom",
    "description": "The distributional effects of the \"Big Beautiful Bill\" are clear: it is a giveaway to the wealthiest Americans at the expense of the poor and working class.",
    "link": "https://www.forbes.com/sites/londonschoolofeconomics/2025/06/24/trumps-big-beautiful-bill-will-harm-those-at-the-bottom/",
    "timestamp": "2025-06-24T13:22:37Z"
  },
  {
    "title": "Trump lashes out at Israel, Iran as attacks continue despite ceasefire claim",
    "description": "President Trump lashed out at both sides for continuing to attack one another hours after he announced a ceasefire between the two countries.",
    "link": "https://www.mlive.com/news/2025/06/trump-angry-with-israel-iran-they-dont-know-what-the-f-theyre-doing.html",
    "timestamp": "2025-06-24T13:22:33Z"
  },
  {
    "title": "Accenture jitters hit IT; Apple’s India push, charted",
    "description": "IT bellwether Accenture’s Q3 results shake up India’s $280 billion software export industry. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/accenture-jitters-hit-it-apples-india-push-charted/articleshow/122049792.cms",
    "timestamp": "2025-06-24T13:22:26Z"
  },
  {
    "title": "Powell says Fed can wait to reduce interest rates as Trump demands cuts",
    "description": "Powell said the Fed needs to learn more before adjusting rates.",
    "link": "https://www.bostonherald.com/2025/06/24/federal-reserve-jerome-powell/",
    "timestamp": "2025-06-24T13:21:10Z"
  },
  {
    "title": "Powell says Fed can wait to reduce interest rates as Trump demands cuts",
    "description": "Powell said the Fed needs to learn more before adjusting rates.",
    "link": "https://www.denverpost.com/2025/06/24/federal-reserve-jerome-powell/",
    "timestamp": "2025-06-24T13:21:10Z"
  },
  {
    "title": "US current account surges to record high in first quarter",
    "description": "America's current account deficit reached a record high in the first quarter. The Commerce Department reported a significant jump due to increased imports. Businesses accelerated imports to avoid tariffs imposed by President Trump. The deficit hit $450.2 bill…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-current-account-surges-to-record-high-in-first-quarter/articleshow/122050208.cms",
    "timestamp": "2025-06-24T13:20:33Z"
  },
  {
    "title": "Markets On Edge As Israel-Iran Ceasefire Collapses But Trump Declares It Still Holds",
    "description": "The U.S. dollar has strengthened slightly amid renewed demand for safe-haven assets, and the 10-year Treasury yield has declined modestly.",
    "link": "https://www.ibtimes.com/markets-edge-israel-iran-ceasefire-collapses-trump-declares-it-still-holds-3776672",
    "timestamp": "2025-06-24T13:20:13Z"
  },
  {
    "title": "Fed's Hammack sees no imminent need to cut interest rates",
    "description": "NEW YORK (Reuters) -Federal Reserve Bank of Cleveland President Beth Hammack said Tuesday she sees no pressing need to cut interest rates when there’s still ...",
    "link": "https://finance.yahoo.com/news/feds-hammack-sees-no-imminent-131819146.html",
    "timestamp": "2025-06-24T13:18:19Z"
  },
  {
    "title": "What’s with Iran’s Death to America chant?",
    "description": "Donald Trump has painted Iran as a hateful nation, saying people even chant ‘death to America’.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/6/24/whats-with-irans-death-to-america-chant",
    "timestamp": "2025-06-24T13:18:19Z"
  },
  {
    "title": "Republican senator calls caucusing with Democrats an 'interesting hypothetical'",
    "description": "Republican Sen. Lisa Murkowski discusses the possibility of breaking from GOP caucus if Democrats win three seats in 2027, emphasizing a focus on Alaskans.",
    "link": "https://www.foxnews.com/politics/republican-senator-calls-caucusing-democrats-interesting-hypothetical",
    "timestamp": "2025-06-24T13:18:09Z"
  },
  {
    "title": "Trump thrashes CNN as ‘gutless losers’ for coverage of U.S. strikes on Iran",
    "description": "President Trump trashed CNN as \"gutless losers\" and said MSNBC was run by a \"disgrace\" in angry remarks about Iran coverage at the White House on Tuesday.",
    "link": "https://www.foxnews.com/media/trump-thrashes-cnn-gutless-losers-coverage-u-s-strikes-iran",
    "timestamp": "2025-06-24T13:14:17Z"
  },
  {
    "title": "Gold Price crashes: Gold rate drops to 2-week low after Iran Israel war ceasefire. Analysts predict bullion rates",
    "description": "Gold rate today nosedived big time as US President Donald Trump declared Iran-Israel war ceasefire.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-crashes-gold-rate-drops-to-2-week-low-after-iran-israel-war-ceasefire-analysts-predict-bullion-rates/articleshow/122050005.cms",
    "timestamp": "2025-06-24T13:12:27Z"
  },
  {
    "title": "WW3 map shows the safest countries to flee to in the event of a nuclear war as world tensions rise",
    "description": "As the specter of another World War looms large, people worldwide are pondering potential safe havens should Russia escalate from nuclear warfare threats to actual missile launches. This comes in the wake of Iran and trading missile strikes as the tensions in…",
    "link": "https://freerepublic.com/focus/f-news/4324978/posts",
    "timestamp": "2025-06-24T13:11:36Z"
  },
  {
    "title": "Alberta Exceeded Its Flaring Limit for Years Before Scrapping It",
    "description": "Oil and gas companies in Alberta exceeded last year the Canadian oil-producing province’s self-imposed limit on natural gas flaring, for a second year running, according to estimates by Reuters. Flaring, the controlled burning of natural gas that takes place …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Alberta-Exceeded-Its-Flaring-Limit-for-Years-Before-Scrapping-It.html",
    "timestamp": "2025-06-24T13:11:35Z"
  },
  {
    "title": "'I Hate This Word Ceasefire!' Mark Levin Seethes Over Trump Iran Announcement — Protests 'Hitler Wasn't Thrown a Lifeline' (Charlie Nash/Mediaite)",
    "description": "Charlie Nash / Mediaite:\n‘I Hate This Word Ceasefire!’  Mark Levin Seethes Over Trump Iran Announcement — Protests 'Hitler Wasn't Thrown a Lifeline'  —  Mark Levin seethed over President Donald Trump's announcement of a ceasefire between Israel and Iran on Mo…",
    "link": "https://www.memeorandum.com/250624/p38",
    "timestamp": "2025-06-24T13:10:00Z"
  },
  {
    "title": "Thomas Massie Tells Theo Von U.S. Gets ‘a Lot of Countries That Hate Us’ in Exchange for Support for Israel",
    "description": "Thomas Massie told podcaster and comedian Theo Von that the United States gets \"a lot of countries that hate us\" in exchange for its support of Israel.\nThe post Thomas Massie Tells Theo Von U.S. Gets ‘a Lot of Countries That Hate Us’ in Exchange for Support f…",
    "link": "https://www.mediaite.com/media/podcasts/thomas-massie-tells-theo-von-u-s-gets-a-lot-of-countries-that-hate-us-in-exchange-for-support-for-israel/",
    "timestamp": "2025-06-24T13:09:49Z"
  },
  {
    "title": "Gold drops over 1% to two-week low after Trump’s Israel–Iran ceasefire; gold futures fall 1.7%, denting safe-haven demand",
    "description": "Gold drops sharply after Trump’s Israel-Iran ceasefire deal triggered a shift in investor sentiment. With fears of Middle East conflict easing, demand for safe-haven assets like gold faded, sending spot gold down to $3,322.09 and gold futures falling 1.7% to …",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-drops-over-1-to-two-week-low-after-trumps-israeliran-ceasefire-gold-futures-fall-1-7-denting-safe-haven-demand/articleshow/122049594.cms",
    "timestamp": "2025-06-24T13:07:59Z"
  },
  {
    "title": "Did Iran-Israel call a truce? Unravelling a day of ceasefires and shots fired",
    "description": "In a rapid escalation, Iran and Israel exchanged military blows, starting with Iranian missile strikes on US bases in Qatar and followed by Israeli retaliatory attacks near Tehran. Despite President Trump's ceasefire announcements, violations persisted, marke…",
    "link": "https://economictimes.indiatimes.com/news/defence/did-iran-israel-call-a-truce-unravelling-a-day-of-ceasefires-and-shots-fired/articleshow/122049783.cms",
    "timestamp": "2025-06-24T13:07:58Z"
  },
  {
    "title": "Iran, a potent cyberthreat, may respond with infiltration and hacking America’s critical infrastructure | CNN Business",
    "description": "Hospitals, water dams and power plants across the US are on alert for any potential Iranian cyberattacks in retaliation for US airstrikes on Iran nuclear sites over the weekend.",
    "link": "https://www.cnn.com/2025/06/24/tech/iran-cyberattack-fears-us",
    "timestamp": "2025-06-24T13:07:47Z"
  },
  {
    "title": "Trump says Israel-Iran ceasefire is in effect after deal initially faltered",
    "description": "Trump said in his view both sides had violated the nascent agreement.",
    "link": "https://www.denverpost.com/2025/06/24/mideast-wars-iran-israel/",
    "timestamp": "2025-06-24T13:07:15Z"
  },
  {
    "title": "Media Matters Sues FTC in Response to ‘Retribution’ Campaign",
    "description": "The progressive media watchdog believes the FTC is working to limit its free-speech rights.",
    "link": "https://www.adweek.com/media/media-matters-sues-ftc-in-response-to-retribution-campaign/",
    "timestamp": "2025-06-24T13:06:47Z"
  },
  {
    "title": "GOP Sen. Mike Lee Forced To Revise Plan To Sell Public Lands After Major Backlash",
    "description": "The Senate parliamentarian advised on Monday that Lee's controversial proposal to sell millions of acres of public land violated the chamber's rules.",
    "link": "https://www.huffpost.com/entry/public-lands-mike-lee-gop_n_6859a60be4b0b13879324859",
    "timestamp": "2025-06-24T13:02:56Z"
  },
  {
    "title": "‘They don’t know what the [bleep] they’re doing’: Watch Trump unload on Iran and Israel",
    "description": "'When I say OK, now you have 12 hours, you don't go out in the first hour just drop everything you have on them'",
    "link": "https://www.wnd.com/2025/06/they-dont-know-what-bleep-theyre-doing-trump/",
    "timestamp": "2025-06-24T13:02:16Z"
  },
  {
    "title": "And now, as the Middle East is being renewed…",
    "description": "A new front has been added to the military one — the political diplomatic front — and on this front, we can no longer rely on miracles, even after having witnessed so many. The renewed Middle East now emerging must include Israeli sovereignty over Judea and S…",
    "link": "https://www.israelnationalnews.com/news/410579",
    "timestamp": "2025-06-24T13:01:25Z"
  },
  {
    "title": "The Trump-Biden Debate One Year Later: A Cover-Up Exposed, a Danger Revealed",
    "description": "“Oh, God …” That was my spontaneous gasp mere seconds into the now-infamous Trump-Biden CNN debate, which took place one year ago this Friday. The... Read More\nThe post The Trump-Biden Debate One Year Later: A Cover-Up Exposed, a Danger Revealed appeared firs…",
    "link": "https://www.dailysignal.com/2025/06/24/the-trump-biden-debate-one-year-later-a-cover-up-exposed-a-danger-revealed/",
    "timestamp": "2025-06-24T13:00:00Z"
  },
  {
    "title": "Powell Signals Patience On Rate Cuts, Shrugs Off Trump Pressure",
    "description": "Markets expect one or two rate cuts later this year, possibly starting in September, but Powell gave no firm commitment.",
    "link": "https://www.ibtimes.com/powell-signals-patience-rate-cuts-shrugs-off-trump-pressure-3776669",
    "timestamp": "2025-06-24T12:59:29Z"
  },
  {
    "title": "Americans Accelerate Car Purchases",
    "description": "Americans are buying early and increasingly opting for American-made vehicles to avoid the impact of Trump's 25 percent automobile tariffs.",
    "link": "https://www.newsweek.com/americans-accelerate-car-purchases-trump-tariffs-2089851",
    "timestamp": "2025-06-24T12:58:25Z"
  },
  {
    "title": "Barak Ravid Details Trump’s ‘Exceptionally Firm and Direct’ Call With Netanyahu as Ceasefire Teetered",
    "description": "Trump personally pressured Israeli Prime Minister Benjamin Netanyahu to halt a retaliatory strike on Iran in a tense intervention direct from Air Force One.\nThe post Barak Ravid Details Trump’s ‘Exceptionally Firm and Direct’ Call With Netanyahu as Ceasefire …",
    "link": "https://www.mediaite.com/media/news/barak-ravid-details-trumps-exceptionally-firm-and-direct-call-with-netanyahu-as-ceasefire-teetered/",
    "timestamp": "2025-06-24T12:57:58Z"
  },
  {
    "title": "'They don't know what the f**k they're doing': Trump cusses out Israel, Iran for nearly blowing up his ceasefire",
    "description": "President Donald Trump announced Monday evening that Iran and Israel had agreed to a ceasefire, bringing an end to what was fast becoming another bloody Middle Eastern quagmire. Trump indicated that Iran would begin the ceasefire and that 12 hours later, Isra…",
    "link": "https://www.theblaze.com/news/they-dont-know-what-the-f-they-are-doing-trump-cusses-out-israel-iran-for-nearly-blowing-up-his-ceasefire",
    "timestamp": "2025-06-24T12:56:48Z"
  },
  {
    "title": "Utah College Student Says ICE Agent Who Detained Her 'Knew It Wasn't Right'",
    "description": "A 19-year-old student at the University of Utah says the agent who detained her repeatedly apologized and \"knew it wasn't right.\"",
    "link": "https://www.newsweek.com/caroline-dias-goncalves-utah-college-student-ice-agent-2089824",
    "timestamp": "2025-06-24T12:56:03Z"
  },
  {
    "title": "Sharri Markson reacts to ‘shocking violation’ by Iran following ceasefire.",
    "description": "Sharri Markson reacts to ‘shocking violation’ by Iran following ceasefire. Sky News Australia Jun 24, 2025. Sharri Markson. Sky News host Sharri Markson says the ceasefire in the Middle East is set to collapse after a “shocking violation” by Iran. President D…",
    "link": "https://freerepublic.com/focus/f-bloggers/4324976/posts",
    "timestamp": "2025-06-24T12:55:58Z"
  },
  {
    "title": "CBS Execs Have Second Thoughts About Paying Trump Bribe Money After California Threatens Bribery Inquiry",
    "description": "When last we checked it with the feckless execs at CBS/Paramount, they were preparing to pay Donald Trump tens of millions of dollars to settle a completely bogus lawsuit designed to bully the media giant into compliance. CBS desperately wants the Trump admin…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178161081",
    "timestamp": "2025-06-24T12:55:27Z"
  },
  {
    "title": "Marjorie Taylor Greene Flips Out Over 'Dirty Rumors' About Her And Donald Trump - HuffPost",
    "description": "Marjorie Taylor Greene Flips Out Over 'Dirty Rumors' About Her And Donald TrumpHuffPost Marjorie Taylor Greene says Trump voters wanted ‘no more foreign wars’ and Iran strikes expose MAGA divideCNN \"He Has Played Every Single One Of You\": People Have A LOT To…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178161075",
    "timestamp": "2025-06-24T12:55:06Z"
  },
  {
    "title": "Trump Says Israel 'Is Not Going To Attack Iran' After Ceasefire Violation: 'Turn Around And Head Home'",
    "description": "Amid heightened tensions between Israel and Iran, President Donald Trump declared Tuesday that a ceasefire between the two adversaries was back in effect, even as reports of renewed hostilities raised doubts about its durability.\nWhat Happened: \"Israel is not…",
    "link": "https://biztoc.com/x/b18cc4d30f5f046d",
    "timestamp": "2025-06-24T12:54:59Z"
  },
  {
    "title": "Trump is testing how far presidential immunity will go to save him millions",
    "description": "Donald Trump is appealing a jury verdict that ordered him to pay $83.3 million for defaming E. Jean Carroll from The White House.\nANGELA WEISS/AFP via Getty Images\nTrump is arguing that presidential immunity should invalidate a $83.3 million jury verdict.\nA j…",
    "link": "https://biztoc.com/x/7b8f76ff8dae0d49",
    "timestamp": "2025-06-24T12:54:46Z"
  },
  {
    "title": "Trump: Biden let a lot of sleeper cells in US",
    "description": "United States President Donald Trump told reporters onboard Air Force One on Tuesday that his predecessor, Joe Biden, \"let a lot of super cells in\" the country, in likely reference to sleeper cells, w...",
    "link": "https://biztoc.com/x/3f2baca1880c0120",
    "timestamp": "2025-06-24T12:54:45Z"
  },
  {
    "title": "Trump Tells Israel to Stop Dropping Bombs to Save Iran Truce",
    "description": "US President Donald Trump accused Israel and Iran of violating a ceasefire he announced on Tuesday and demanded both sides stick to the agreement.\n“DO NOT DROP THOSE BOMBS. IF YOU DO IT IS A MAJOR VIOLATION. BRING YOUR PILOTS HOME, NOW!,” Trump wrote on his T…",
    "link": "https://biztoc.com/x/1def4d317e3e9d68",
    "timestamp": "2025-06-24T12:54:41Z"
  },
  {
    "title": "Trump drops f-bomb as Israel and Iran face accusations of ceasefire violations",
    "description": "President Donald Trump speaks the press before boarding Marine One from the South Lawn of the White House in Washington, DC on June 24, 2025, to attend the NATO's Heads of State and Government summit in The Hague.",
    "link": "https://biztoc.com/x/02a8015c1b89e326",
    "timestamp": "2025-06-24T12:54:35Z"
  },
  {
    "title": "US Federal Reserve to take longer to cut interest rates, says Jerome Powell",
    "description": "The Federal Reserve will continue to wait and see how the economy evolves before deciding whether to reduce its key interest rate, Chair Jerome Powell said on Tuesday, a stance directly at odds with President Donald Trump's calls for immediate cuts.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-federal-reserve-to-take-longer-to-cut-interest-rates-says-jerome-powell/articleshow/122049747.cms",
    "timestamp": "2025-06-24T12:52:58Z"
  },
  {
    "title": "Germany vows fair share of Europe's defence as Nato leaders arrive at Hague summit",
    "description": "The German chancellor says Nato leaders will aim to ensure peace in Europe for generations to come.",
    "link": "https://www.bbc.com/news/articles/c4gd98qry6jo",
    "timestamp": "2025-06-24T12:50:57Z"
  },
  {
    "title": "Tehran has the right to develop nuclear energy for peaceful purposes – Indian expert",
    "description": "Sunjoy Joshi has expressed solidarity with Iran’s civilian nuclear program Read Full Article at RT.com",
    "link": "https://www.rt.com/india/620420-tehran-has-right-to-develop/",
    "timestamp": "2025-06-24T12:50:43Z"
  },
  {
    "title": "Powell says Fed can wait to reduce interest rates as Trump demands cuts",
    "description": "The Federal Reserve will continue to wait and see how the economy evolves before deciding whether to reduce its key interest rate, Chair Jerome Powell says, a stance directly at odds with President Donald Trump’s calls for immediate cuts. Powell said Tuesday …",
    "link": "https://www.seattlepi.com/news/politics/article/powell-says-fed-can-wait-to-reduce-interest-rates-20391154.php",
    "timestamp": "2025-06-24T12:50:40Z"
  },
  {
    "title": "Lisa Murkowski: I am one who when I see something that needs to be called out, I will call it out if it needs to be. Unless, you know, it involves voting against Trump. Also, please buy my book [Dumbass]",
    "description": "Lisa Murkowski: I am one who when I see something that needs to be called out, I will call it out if it needs to be. Unless, you know, it involves voting against Trump. Also, please buy my book",
    "link": "https://www.fark.com/comments/13717618/Lisa-Murkowski-I-am-one-who-when-I-see-something-that-needs-to-be-called-out-I-will-call-it-out-if-it-needs-to-be-Unless-you-know-it-involves-voting-against-Trump-Also-please-buy-my-book",
    "timestamp": "2025-06-24T12:50:06Z"
  },
  {
    "title": "President Trump Urges Israel to Call Off Retaliatory Strikes After Iran Violates Ceasefire",
    "description": "President Donald Trump to Israel: \"Do not drop those bombs. Bring your pilots home, now!\"\nThe post President Trump Urges Israel to Call Off Retaliatory Strikes After Iran Violates Ceasefire first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/president-trump-urges-israel-to-call-off-retaliatory-strikes-after-iran-violates-ceasefire/",
    "timestamp": "2025-06-24T12:50:01Z"
  },
  {
    "title": "Trump is testing how far presidential immunity will go to save him millions",
    "description": "President Donald Trump is invoking the Supreme Court's sweeping immunity decision to argue he shouldn't have to pay $83.3 million to E. Jean Carroll.",
    "link": "https://www.businessinsider.com/trump-tests-presidential-immunity-carroll-defamation-verdict-payout-2025-6",
    "timestamp": "2025-06-24T12:49:15Z"
  },
  {
    "title": "'When you think it can't get worse': Experts warn Supreme Court caused new chaos",
    "description": "The Supreme Court on Monday temporarily lifted a lower court order\r\n that had required the Trump administration to give migrants the chance to challenge their deportation to a country other than their nation of origin, clearing the way for resumption of such …",
    "link": "https://www.rawstory.com/when-you-think-it-can-t-get-worse-experts-warn-supreme-court-caused-new-chaos/",
    "timestamp": "2025-06-24T12:46:23Z"
  },
  {
    "title": "Trump Says Iran-Israel Truce Holds After Berating Both Countries",
    "description": "US President Donald Trump said Tuesday that a ceasefire between Iran and Israel was holding, shortly after he lashed out at both countries and cursed as he accused them of violating the truce.",
    "link": "https://www.ibtimes.com/trump-says-iran-israel-truce-holds-after-berating-both-countries-3776665",
    "timestamp": "2025-06-24T12:45:18Z"
  },
  {
    "title": "Powell says Fed can wait to reduce interest rates as Trump demands cuts",
    "description": "The Federal Reserve will continue to wait and see how the economy evolves before deciding whether to reduce its key interest rate, Chair Jerome Powell says, a stance directly at odds with President Donald Trump’s calls for immediate cuts",
    "link": "https://abcnews.go.com/US/wireStory/powell-fed-wait-reduce-interest-rates-trump-demands-123150329",
    "timestamp": "2025-06-24T12:44:38Z"
  },
  {
    "title": "Trump drops f-bomb as Israel and Iran face accusations of ceasefire violations",
    "description": "As Donald Trump drops an f-bomb, he's getting a timely lesson in “Middle East crises are complicated,” which is something he should’ve already known.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-drops-f-bomb-israel-iran-face-accusations-ceasefire-violations-rcna214698",
    "timestamp": "2025-06-24T12:42:10Z"
  },
  {
    "title": "Opinion: No wonder Trump is angry — he's playing high-stakes poker",
    "description": "Our columnist examines the chaos of the last few days and looks at Donald Trump’s options.",
    "link": "https://www.thejournal.ie/readme/trump-fuck-6742229-Jun2025/",
    "timestamp": "2025-06-24T12:41:42Z"
  },
  {
    "title": "Iran Israel war continues despite Ceasefire. What is Donald Trump doing now?",
    "description": "Iran Israel ceasefire was declared by Donald Trump but even after the US President's announcement Tehran and Tel Aviv are continuing strikes.",
    "link": "https://economictimes.indiatimes.com/news/international/us/iran-israel-war-continues-despite-ceasefire-what-is-donald-trump-doing-now/articleshow/122049392.cms",
    "timestamp": "2025-06-24T12:41:14Z"
  },
  {
    "title": "Oil prices are falling so much it’s now cheaper than it was before the Iran-Israel conflict",
    "description": "Oil prices fell sharply Tuesday, returning to levels seen before the Iran-Israel conflict, as investors cheered news of a ceasefire, albeit fragile, between the two countries.",
    "link": "https://www.cnn.com/2025/06/24/business/oil-prices-fall-iran-israel-ceasefire-intl",
    "timestamp": "2025-06-24T12:40:38Z"
  },
  {
    "title": "Ceasefire Between Israel, Iran Collapses Within A Day; Trump Slams Both Sides",
    "description": "Israel claimed Tuesday that Iran fired multiple missiles into southern Israeli territory shortly after the ceasefire came into effect. Two of the projectiles were intercepted over Beersheba, according to Israeli defense sources.",
    "link": "https://www.ibtimes.com/ceasefire-between-israel-iran-collapses-within-day-trump-slams-both-sides-3776663",
    "timestamp": "2025-06-24T12:39:23Z"
  },
  {
    "title": "World wary as it welcomes Iran-Israel ceasefire",
    "description": "The world celebrated ceasefire deal but is wary of a return to hostilities, as some called for a similar deal for Gaza.",
    "link": "https://www.aljazeera.com/news/2025/6/24/world-wary-as-it-welcomes-iran-israel-ceasefire",
    "timestamp": "2025-06-24T12:38:25Z"
  },
  {
    "title": "Supreme Court rules Trump can rapidly deport immigrants to Libya, South Sudan and other countries they aren’t from",
    "description": "A federal judge had previously blocked the Trump administration’s plans to deport immigrants to third-country destinations, but some of them have remained detained in another African county, Djibouti.",
    "link": "https://theconversation.com/supreme-court-rules-trump-can-rapidly-deport-immigrants-to-libya-south-sudan-and-other-countries-they-arent-from-258155",
    "timestamp": "2025-06-24T12:38:18Z"
  },
  {
    "title": "Netanyahu responds to Trump: IAF destroyed radar system near Tehran after missile attack",
    "description": "The Prime Minister's Office stated following the criticism from President Trump, who called on Israel not to retaliate for Iran's violation of the ceasefire, that Israel has refrained from further retaliation.",
    "link": "https://www.israelnationalnews.com/news/410577",
    "timestamp": "2025-06-24T12:38:00Z"
  },
  {
    "title": "Speaker's gushing over Iran threat shot down by Dem: 'I was in same briefing'",
    "description": "In addition to pushing back against U.S. House Speaker Mike Johnson's claim that President Donald Trump\r\n \"made the right call\" in attacking Iran's nuclear sites, U.S. Sen. Chris Murphy on Monday spelled out \"ideas that should guide Americans' thinking as the…",
    "link": "https://www.rawstory.com/speaker-gushing-over-threat-shot-down-by-dem-i-was-in-same-briefing/",
    "timestamp": "2025-06-24T12:37:57Z"
  },
  {
    "title": "Powell repeats rate cuts can wait as Fed studies tariff impacts",
    "description": "WASHINGTON (Reuters) -U.S. Federal Reserve Chair Jerome Powell said on Tuesday the central bank needs more time to see if rising tariffs drive inflation...",
    "link": "https://finance.yahoo.com/news/powell-repeats-rate-cuts-wait-123718452.html",
    "timestamp": "2025-06-24T12:37:18Z"
  },
  {
    "title": "Federal energy office illustrates the perils of fluctuating budgets and priorities",
    "description": "When presidential administrations turn over, funding levels and project priorities change. A look at one specific government office demonstrates how these shifts in direction waste time and money.",
    "link": "https://theconversation.com/federal-energy-office-illustrates-the-perils-of-fluctuating-budgets-and-priorities-255936",
    "timestamp": "2025-06-24T12:37:10Z"
  },
  {
    "title": "Venice swaps palazzi for paparazzi as Jeff Bezos and Lauren Sanchez prepare to tie the knot",
    "description": "The so-called wedding of the century will see some of the world’s most famous celebrities descend on the City of Water. But protests and crowding concerns could take the shine off the Amazon tycoon’s special day, Alex Croft reports",
    "link": "https://www.the-independent.com/news/world/europe/jeff-bezos-wedding-lauren-sanchez-venice-protests-b2775053.html",
    "timestamp": "2025-06-24T12:36:09Z"
  },
  {
    "title": "We asked students queuing outside the US embassy what they make of new visa social media checks",
    "description": "As the US embassy demands applicants social media records, there have been warnings that students should be careful.",
    "link": "https://www.thejournal.ie/students-us-embassy-visa-social-media-checks-6742075-Jun2025/",
    "timestamp": "2025-06-24T12:36:09Z"
  },
  {
    "title": "JUST IN: Trump Goes Absolutely Berserk on Iran and Israel as Ceasefire Deal Crumbles: ‘They Don’t Know What the **** They’re Doing’",
    "description": "President Donald Trump issued a blunt warning to Israel on Tuesday to “not bomb Iran” as he departed for the NATO summit in The Hague, taking a critical position just 24 hours after brokering a fragile ceasefire already threatened after a missile strike from …",
    "link": "https://freerepublic.com/focus/f-chat/4324974/posts",
    "timestamp": "2025-06-24T12:36:05Z"
  },
  {
    "title": "A cease-fire between Israel and Iran hangs in the balance. The markets are holding their nerve.",
    "description": "The cease-fire between Iran and Israel looks fragile, but negative market panic hasn't taken hold as of yet.",
    "link": "https://www.businessinsider.com/trump-israel-iran-cease-fire-violated-strike-markets-stocks-2025-6",
    "timestamp": "2025-06-24T12:35:33Z"
  }
]