[
  {
    "title": "U.S. ships built in China exempt from new port fees",
    "description": "China won’t collect port fees on Chinese-built U.S. cargo vessels. The post U.S. ships built in China exempt from new port fees appeared first on...",
    "link": "https://finance.yahoo.com/news/u-ships-built-china-exempt-134941475.html",
    "timestamp": "2025-10-15T13:49:41Z"
  },
  {
    "title": "JD Vance tries to downplay leak of disgusting Young Republican chats",
    "description": "For JD Vance to suggest it’s “pearl clutching” to condemn those who were part of a racist group chat says a great deal about the vice president's judgment.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jd-vance-tries-downplay-leak-disgusting-young-republican-chats-rcna237752",
    "timestamp": "2025-10-15T13:49:33Z"
  },
  {
    "title": "Harming Chinese Economy Not US Goal, Believes Same Is True for Beijing - Bessent",
    "description": "WASHINGTON (Sputnik) - Damaging China's economy is not part of Washington's plan, and the United Stated believes that Beijing does not want to harm the US economy as well, US Secretary of the Treasury Scott Bessent said on Wednesday.",
    "link": "https://sputnikglobe.com/20251015/harming-chinese-economy-not-us-goal-believes-same-is-true-for-beijing---bessent-1122965796.html",
    "timestamp": "2025-10-15T13:48:05Z"
  },
  {
    "title": "Court blocks transfer of Miami property for Trump presidential library",
    "description": "A Miami court Tuesday blocked the transfer of land planned for President Donald Trump's presidential library, citing violation of the state's Sunshine Law.",
    "link": "https://www.upi.com/Top_News/US/2025/10/15/court-blocks-transfer-property-trump-presidential-library/4861760534362/",
    "timestamp": "2025-10-15T13:47:52Z"
  },
  {
    "title": "Trump ready to meet with China's Xi in South Korea, Bessent tells CNBC",
    "description": "WASHINGTON (Reuters) -U.S. Treasury Secretary Scott Bessent on Wednesday insisted that Washington did not want to escalate a trade conflict with China...",
    "link": "https://finance.yahoo.com/news/trump-ready-meet-chinas-xi-134723910.html",
    "timestamp": "2025-10-15T13:47:23Z"
  },
  {
    "title": "Trump Forces Out Second Prosecutor for Refusing to Bend the Knee",
    "description": "President Donald Trump’s administration forced out yet another U.S. attorney for not going along with their flimsy case, The New York Times reported. Todd Gilbert, the U.S. attorney in the Western District of Virginia, was forced to resign in August after he …",
    "link": "https://newrepublic.com/post/201784/donald-trump-forces-out-attorney-russia-investigation",
    "timestamp": "2025-10-15T13:45:26Z"
  },
  {
    "title": "Parents of 2 US citizens demand return of their sons’ bodies and all deceased hostages held by Hamas in Gaza",
    "description": "Two American citizens Itay Chen and Omer Neutra remain among deceased hostages held by Hamas as terror group violates hostage exchange agreement.",
    "link": "https://www.foxnews.com/world/parents-2-us-citizens-demand-return-sons-bodies-all-deceased-hostages-held-hamas-gaza",
    "timestamp": "2025-10-15T13:45:21Z"
  },
  {
    "title": "Pakistan and Afghanistan agree to temporary ceasefire after deadly violence",
    "description": "A 48-hour ceasefire has been decided between the Pakistan government and the Afghan Taliban regime.",
    "link": "https://www.abc.net.au/news/2025-10-16/pakistan-afghanistan-fighting-temporary-ceasefire-conflict/105897208",
    "timestamp": "2025-10-15T13:43:37Z"
  },
  {
    "title": "All to know about FIFA World Cup 2026 – teams, qualifying, format, draw",
    "description": "As continental qualification for the FIFA World Cup 2026 nears its end, the focus is shifting to the tournament itself.",
    "link": "https://www.aljazeera.com/sports/2025/10/15/all-to-know-about-fifa-world-cup-2026",
    "timestamp": "2025-10-15T13:40:57Z"
  },
  {
    "title": "Nationwide 'No Kings' protests against Trump scheduled for October 18: Here are locations and other details",
    "description": "Americans will protest President Trump's administration on October 18.  These 'No Kings' demonstrations are planned across all 50 states.  Organizers aim to show the strength of the people against perceived abuses of power.  The movement emphasizes democracy …",
    "link": "https://economictimes.indiatimes.com/news/international/us/nationwide-no-kings-protests-against-trump-scheduled-for-october-18-here-are-locations-and-other-details/articleshow/124579854.cms",
    "timestamp": "2025-10-15T13:38:22Z"
  },
  {
    "title": "Shutdown faces taxpayer reckoning as lawmaker works to expose 'true cost of Democrats’ political stunt'",
    "description": "Iowa Sen. Joni Ernst proposes legislation mandating detailed reports on government shutdown expenses after current closure costs to taxpayers are estimated at $400 million a day.",
    "link": "https://www.foxnews.com/politics/shutdown-faces-taxpayer-reckoning-lawmaker-works-expose-true-cost-democrats-political-stunt",
    "timestamp": "2025-10-15T13:37:35Z"
  },
  {
    "title": "CNN Table Erupts When Trump Fan Claims ‘We’re Not Calling People Hitler’",
    "description": "The CNN Newsnight table erupted when Trump defender Ben Ferguson blurted out \"We're not calling people Hitler\" in a discussion of a leaked chat.\nThe post CNN Table Erupts When Trump Fan Claims ‘We’re Not Calling People Hitler’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/cnn-table-erupts-when-trump-fan-claims-were-not-calling-people-hitler/",
    "timestamp": "2025-10-15T13:35:54Z"
  },
  {
    "title": "Will You Be Comfortable Buying Nvidia Stock?",
    "description": "Nvidia’s has emerged the most important semiconductor player in the AI space, driven by its advanced GPU architectures",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/10/15/will-you-be-comfortable-buying-nvidia-stock/",
    "timestamp": "2025-10-15T13:35:36Z"
  },
  {
    "title": "Trump Vows Expiration Date For ‘Semi-Communist’ Government Programs",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 14, 2025\nPresident Donald Trump said he would decide on Friday which “Democrat programs” to permanently end as the federal government shutdown drags on.\n“The Democrats are getting killed, and we’re go…",
    "link": "https://biztoc.com/x/2a51a1aae45bbca1",
    "timestamp": "2025-10-15T13:33:33Z"
  },
  {
    "title": "Bessent Sees ‘Fulsome’ Global Response to China on Rare Earths",
    "description": "Treasury Secretary Scott Bessent predicted a coordinated response to China’s move to control the global supply of rare earths from the US and a number of its allies and partners.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-sees-fulsome-global-response-to-china-on-rare-earths",
    "timestamp": "2025-10-15T13:32:08Z"
  },
  {
    "title": "Gov. JB Pritzker joins Democratic governors' health coalition to combat Trump's 'war on science'",
    "description": "The Governors Public Health Initiative is an effort to protect Democratic states from massive public health changes being enacted by the Trump administration.",
    "link": "https://chicago.suntimes.com/health/2025/10/15/gov-jb-pritzker-joins-democratic-governors-health-coalition-to-combat-trump",
    "timestamp": "2025-10-15T13:31:47Z"
  },
  {
    "title": "Federal workers endure financial strain and fear layoffs as the government shutdown drags on",
    "description": "The fate of the federal workers is among several pressure points that could push lawmakers to agree to resolve the stalemate.",
    "link": "https://www.bostonherald.com/2025/10/15/government-shutdown-federal-worker-fears/",
    "timestamp": "2025-10-15T13:29:05Z"
  },
  {
    "title": "Federal workers endure financial strain and fear layoffs as the government shutdown drags on",
    "description": "The fate of the federal workers is among several pressure points that could push lawmakers to agree to resolve the stalemate.",
    "link": "https://www.denverpost.com/2025/10/15/government-shutdown-federal-worker-fears/",
    "timestamp": "2025-10-15T13:29:05Z"
  },
  {
    "title": "Bessent will present 3 or 4 Fed chief candidates to Trump after Thanksgiving",
    "description": "As we approach the holiday season, President Donald Trump gears up for a significant decision as he prepares to interview candidates for the Federal Reserve leadership. Following Thanksgiving, Treasury Secretary Scott Bessent will recommend a shortlist of thr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/bessent-will-present-3-or-4-fed-chief-candidates-to-trump-after-thanksgiving/articleshow/124581558.cms",
    "timestamp": "2025-10-15T13:26:02Z"
  },
  {
    "title": "Trump is a 'go' on meeting with China's Xi, Bessent tells CNBC",
    "description": "WASHINGTON: US President Donald Trump is ready to meet Chinese President Xi Jinping and officials from both countries are working to set up a meeting, Treasury Secretar",
    "link": "https://www.channelnewsasia.com/world/trump-xi-jinping-meeting-go-bessent-5404346",
    "timestamp": "2025-10-15T13:25:15Z"
  },
  {
    "title": "Mike Johnson Threatened With Lawsuit for Dragging His Feet on New Dem",
    "description": "It’s been more than three weeks since Representative-elect Adelita Grijalva won the special election in Arizona, and the state has had enough of Congress’s delays.Republican leadership has refused to swear in Grijalva until Congress returns to its regular ses…",
    "link": "https://newrepublic.com/post/201786/mike-johnson-lawsuit-swear-in-democrat-grijalva",
    "timestamp": "2025-10-15T13:24:57Z"
  },
  {
    "title": "Charlie Kirk Understood True Freedom Is Inseparable From Duty",
    "description": "Charlie Kirk Understood True Freedom Is Inseparable From DutyOn Tuesday, President Donald Trump posthumously awarded Charlie Kirk with the Presidential Medal of Freedom on what would have been Kirk’s 32nd birthday. Kirk’s wife, Erika, accepted the award on he…",
    "link": "https://freerepublic.com/focus/f-news/4346481/posts",
    "timestamp": "2025-10-15T13:22:26Z"
  },
  {
    "title": "Trump Says US to Discuss Free Trade Deal With Argentina",
    "description": "President Donald Trump said he would discuss a potential free trade agreement with Argentine President Javier Milei and defended a $20 billion lifeline to Buenos Aires ahead of elections in the country. Milei met with Trump and administration leaders at the W…",
    "link": "https://biztoc.com/x/f0a78dc369412921",
    "timestamp": "2025-10-15T13:22:10Z"
  },
  {
    "title": "Sherrill’s Campaign Receives Thousands from CCP-Connected Businessman",
    "description": "A Chinese-born auto executive whose company has documented connections to the Chinese Communist Party has contributed at least $65,000 to Rep. Mikie Sherrill’s gubernatorial campaign in New Jersey, according to federal records, as the congresswoman faces grow…",
    "link": "https://www.breitbart.com/politics/2025/10/15/sherrills-campaign-receives-thousands-from-ccp-connected-businessman/",
    "timestamp": "2025-10-15T13:22:07Z"
  },
  {
    "title": "US Treasury chief Scott Bessent 'optimistic' over China trade talks, says Trump plans to meet Xi Jinping",
    "description": "US Treasury Secretary Scott Bessent has shared an encouraging update on the trade dialogue between the United States and China, highlighting active communication at both senior and operational levels.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-treasury-chief-scott-bessent-optimistic-over-china-trade-talks-says-trump-plans-to-meet-xi-jinping/articleshow/124581214.cms",
    "timestamp": "2025-10-15T13:18:19Z"
  },
  {
    "title": "'Did she wear a MAGA hat?': Trump strikes back at ‘The View’ again after Alyssa Farah Griffin’s pledge for Israeli hostages",
    "description": "Former Trump aide Alyssa Farah Griffin is facing backlash for not wearing a MAGA hat as promised after Israeli hostages were freed. Griffin had pledged to wear the hat if Trump achieved this diplomatic feat. Trump himself commented on the situation, questioni…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-did-she-wear-a-maga-hat-trump-strikes-back-at-the-view-again-after-alyssa-farah-griffins-pledge-for-israeli-hostages/articleshow/124580906.cms",
    "timestamp": "2025-10-15T13:17:29Z"
  },
  {
    "title": "‘Deserves to burn in hell’: State Department revokes visas for foreigners who celebrated Charlie Kirk’s murder",
    "description": "'Aliens who take advantage of America's hospitality while celebrating the assassination of our citizens will be removed'",
    "link": "https://www.wnd.com/2025/10/deserves-burn-hell-state-department-revokes-visas-foreigners/",
    "timestamp": "2025-10-15T13:15:59Z"
  },
  {
    "title": "LuBian-linked wallet moves $1.3B in BTC a day after DOJ reveals $15B forfeiture case",
    "description": "The transfer came a day after the US DOJ unsealed an indictment against Prince Holding Group, which allegedly used LuBian to launder illicit funds.",
    "link": "https://cointelegraph.com/news/lubian-wallet-moves-1b-bitcoin-doj-15b-seizure-case",
    "timestamp": "2025-10-15T13:14:37Z"
  },
  {
    "title": "Oil rises with US-China trade tensions in focus",
    "description": "LONDON (Reuters) -Oil prices climbed on Wednesday after closing at five-month lows in the previous session, as investors weighed an escalation in trade...",
    "link": "https://finance.yahoo.com/news/oil-rises-us-china-trade-131437117.html",
    "timestamp": "2025-10-15T13:14:37Z"
  },
  {
    "title": "Gaza residents 'cautious' about movements amid ceasefire",
    "description": "People in Gaza are being cautious about their movements as they wait to see if the current ceasefire holds.",
    "link": "https://www.rte.ie/news/middle-east/2025/1015/1538712-gaxa-ceasefire/",
    "timestamp": "2025-10-15T13:08:49Z"
  },
  {
    "title": "Gaza residents 'cautious' about movements amid ceasefire",
    "description": "People in Gaza are being cautious about their movements as they wait to see if the current ceasefire holds.",
    "link": "https://www.rte.ie/news/middle-east/2025/1015/1538712-gaza-ceasefire/",
    "timestamp": "2025-10-15T13:08:49Z"
  },
  {
    "title": "Trump administration reallocates funds to sustain programs as shutdown enters its third week",
    "description": "As the government shutdown continues into its third week, the Trump administration is shifting funds to maintain military pay and nutrition programs amid congressional gridlock.",
    "link": "https://www.wmur.com/article/trump-administration-reallocates-funds-to-sustain-programs-as-shutdown-third-week/69037995",
    "timestamp": "2025-10-15T13:08:17Z"
  },
  {
    "title": "Meta removes ICE-tracking Facebook page in Chicago at the request of the Justice Department",
    "description": "Meta has removed a Facebook page used to track the presence of immigration agents at the request of the Department of Justice, the company confirmed on Tuesday",
    "link": "https://www.nbcnews.com/tech/social-media/meta-removes-ice-tracking-facebook-page-chicago-request-justice-depart-rcna237743",
    "timestamp": "2025-10-15T13:07:46Z"
  },
  {
    "title": "The Big Bitcoin Short (Part 2): Rumor mill suspects links to US government insiders",
    "description": "Previously on The Big Bitcoin Short: a trader shorted Bitcoin minutes before President Trump’s tariff post and booked about $160 – $200 million. Eye, a crypto investigator who helped frame the story by tracing wallets and proposing that Garrett Jin could be a…",
    "link": "https://cryptoslate.com/the-big-bitcoin-short-part-2-rumor-mill-suspects-trader-links-to-us-government-insiders/",
    "timestamp": "2025-10-15T13:05:36Z"
  },
  {
    "title": "Young Republicans Caught Being Exactly Who You Think They Are",
    "description": "Shocked, appalled, saddened, did we mention shocked?",
    "link": "https://www.wonkette.com/p/young-republicans-caught-being-exactly",
    "timestamp": "2025-10-15T13:04:50Z"
  },
  {
    "title": "Crypto ‘got a passing grade’ on weekend crash: Bitwise’s Matt Hougan",
    "description": "Bitwise’s Matt Hougan called last weekend’s $20 billion crypto liquidation a “blip,” noting that DeFi platforms held firm, showing the market’s resilience.",
    "link": "https://cointelegraph.com/news/crypto-passing-grade-weekend-crash-bitwise-s-matt-hougan",
    "timestamp": "2025-10-15T13:04:15Z"
  },
  {
    "title": "‘Exhausted, But Happy’: Christians in Gaza Breathe Sigh of Relief After Trump Peace Deal",
    "description": "The small but devout Christian community in Gaza is slowly starting the process of rebuilding after Israel and the genocidal terrorist organization Hamas agreed to a peace deal, brokered by the White House, this week, Father Gabriel Romanelli of Gaza City’s H…",
    "link": "https://www.breitbart.com/middle-east/2025/10/15/exhausted-but-happy-christians-in-gaza-breathe-sigh-of-relief-after-trump-peace-deal/",
    "timestamp": "2025-10-15T13:02:44Z"
  },
  {
    "title": "Trump admin slammed for using ethnic cleaning euphemism: ‘Wannabe Nazis’",
    "description": "The Department of Homeland Security relayed a message on social media Tuesday from its official X account: a single word that critics say is a blatant call for ethnic cleansing.“Remigrate,” the post reads, a term that first saw prominence\r\n in Europe in the m…",
    "link": "https://www.rawstory.com/deportation-2674186514/",
    "timestamp": "2025-10-15T13:01:03Z"
  },
  {
    "title": "Trump’s war on cartels enters new phase as experts predict what’s next",
    "description": "As Trump declares an “armed conflict\" with the cartels, experts gave insight on what Americans can expect to see next in the “quasi-war\" taking place at the country’s doorstep.",
    "link": "https://www.foxnews.com/politics/trumps-war-cartels-enters-new-phase-experts-predict-whats-next",
    "timestamp": "2025-10-15T13:00:35Z"
  },
  {
    "title": "Anarchist Group Calls for BLM-Style ‘Revolt’ at Anti-Trump ‘No Kings’ Rallies",
    "description": "DAILY CALLER NEWS FOUNDATION—Leftists are calling for veterans of “the George Floyd revolt” to join upcoming “No Kings” rallies against President Donald Trump on Saturday.... Read More\nThe post Anarchist Group Calls for BLM-Style ‘Revolt’ at Anti-Trump ‘No Ki…",
    "link": "https://www.dailysignal.com/2025/10/15/anarchist-group-calls-for-blm-style-revolt-at-anti-trump-no-kings-rallies/",
    "timestamp": "2025-10-15T13:00:00Z"
  },
  {
    "title": "Braving Trump, Apple's Tim Cook promises to boost China investment",
    "description": "Apple CEO Tim Cook pledged to expand investment in China despite US-China trade tensions. Meeting Chinese officials in Beijing, Cook reaffirmed Apple’s commitment to its Chinese suppliers and market. While balancing US manufacturing promises, Apple continues …",
    "link": "https://economictimes.indiatimes.com/tech/technology/braving-trump-apples-tim-cook-promises-to-boost-china-investment/articleshow/124580296.cms",
    "timestamp": "2025-10-15T12:56:05Z"
  },
  {
    "title": "Winning with misinformation: New research identifies link between endorsing easily disproven claims and prioritizing symbolic strength",
    "description": "Conversations around misinformation that assume everyone cares about literal truth may be missing the point.",
    "link": "https://theconversation.com/winning-with-misinformation-new-research-identifies-link-between-endorsing-easily-disproven-claims-and-prioritizing-symbolic-strength-265652",
    "timestamp": "2025-10-15T12:53:34Z"
  },
  {
    "title": "Flare-up in US-China trade tensions poses a big risk to Thailand's growth, deputy central bank governor says",
    "description": "WASHINGTON (Reuters) -The fresh flare-up in trade tensions between the United States and China is a big risk to the outlook for Thailand's economic growth...",
    "link": "https://finance.yahoo.com/news/flare-us-china-trade-tensions-125325849.html",
    "timestamp": "2025-10-15T12:53:25Z"
  },
  {
    "title": "As Republicans seek Jack Smith’s testimony, the former special counsel has plenty to say",
    "description": "As Jim Jordan and other Republicans drag former special counsel Jack Smith into the spotlight, the phrase \"be careful what you wish for\" keeps coming to mind.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-seek-jack-smiths-testimony-former-special-counsel-plenty-s-rcna237737",
    "timestamp": "2025-10-15T12:52:50Z"
  },
  {
    "title": "Why higher tariffs on Canadian lumber may not be enough to stimulate long-term investments in US forestry",
    "description": "The US has ample forest resources, but replacing imports with domestic lumber isn’t as simple as it sounds.",
    "link": "https://theconversation.com/why-higher-tariffs-on-canadian-lumber-may-not-be-enough-to-stimulate-long-term-investments-in-us-forestry-265713",
    "timestamp": "2025-10-15T12:52:37Z"
  },
  {
    "title": "Treasury Secretary Bessent says a stock market decline won't deter the U.S. from taking strong action against China",
    "description": "Treasury Secretary Scott Bessent insisted that the U.S. won't change its negotiating stance on China due to stock market volatility.",
    "link": "https://www.cnbc.com/2025/10/15/treasury-secretary-bessent-stock-market-china.html",
    "timestamp": "2025-10-15T12:48:23Z"
  },
  {
    "title": "Braving Trump, Apple's Tim Cook promises to boost China investment",
    "description": "BEIJING (Reuters) -Apple's Tim Cook pledged to boost the tech giant's investment in China on Wednesday as it navigates the trade war between Beijing and...",
    "link": "https://finance.yahoo.com/news/braving-trump-apples-tim-cook-124744085.html",
    "timestamp": "2025-10-15T12:47:44Z"
  },
  {
    "title": "School News Assembly Headlines for 16th October: Top national, international, sports and business update",
    "description": "Today's news brings updates on national events including protests and court proceedings. Internationally, IMF reports highlight government spending inefficiencies, while a US government shutdown delays economic data. In sports, Brett Lee praises Shubman Gill'…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/school-news-assembly-headlines-for-16th-october-top-national-international-sports-and-business-update/articleshow/124579943.cms",
    "timestamp": "2025-10-15T12:47:10Z"
  },
  {
    "title": "Pro-Hamas messages broadcast at two North American airports following apparent cyber breaches | CNN",
    "description": "Unauthorized pro-Palestinian political messages praising Hamas and attacking President Donald Trump and Israel’s prime minister were broadcast through public address systems at two airports in North America on Tuesday, disrupting operations and sparking inves…",
    "link": "https://www.cnn.com/2025/10/15/us/airport-cyber-breach-pennsylvania-canada-hnk",
    "timestamp": "2025-10-15T12:45:25Z"
  },
  {
    "title": "In shutdown, federal workers face financial strain and fear layoffs",
    "description": "Federal workers furloughed or working without pay are feeling the financial squeeze and fear being swept up in the Trump administration's layoffs. The fate of the federal workers is among several pressure points that could push lawmakers to agree to resolve t…",
    "link": "https://apnews.com/article/congress-federal-workers-shutdown-layoffs-5bef57b6c431830a9af84fbfcc59b324",
    "timestamp": "2025-10-15T12:45:21Z"
  },
  {
    "title": "Petty TIME Magazine Posts Nasty Photo of Trump on Cover After He Ends Hamas-Israel War – It’s Not the First Time",
    "description": "Nasty TIME Magazine, that becomes less and less important as the years go by, published an image of President Trump on their cover this week.\nThe post Petty TIME Magazine Posts Nasty Photo of Trump on Cover After He Ends Hamas-Israel War – It’s Not the First …",
    "link": "https://www.thegatewaypundit.com/2025/10/petty-time-magazine-posts-nasty-photo-trump-cover/",
    "timestamp": "2025-10-15T12:45:08Z"
  },
  {
    "title": "Federal workers endure financial strain and fear layoffs as the government shutdown drags on",
    "description": "Federal workers furloughed or working without pay are feeling the financial squeeze and fear being swept up in the Trump administration's layoffs.",
    "link": "https://www.clickondetroit.com/news/politics/2025/10/15/federal-workers-endure-financial-strain-and-fear-layoffs-as-the-government-shutdown-drags-on/",
    "timestamp": "2025-10-15T12:45:06Z"
  },
  {
    "title": "That Disgusting RFK Jr. Tweet Is Actually Fake",
    "description": "The photoshopped image appears to have come from r/poopfromabutt on Reddit. Seriously.",
    "link": "https://gizmodo.com/that-disgusting-rfk-jr-tweet-is-actually-fake-2000672295",
    "timestamp": "2025-10-15T12:45:04Z"
  },
  {
    "title": "Trump says U.S. won't benefit from $20 billion bailout for Argentina (Washington Post)",
    "description": "Washington Post:\nTrump says U.S. won't benefit from $20 billion bailout for Argentina  —  The president explicitly conditioned the relief on the success in this month's elections of the Argentinian president, who admires and emulates him.  —  President Donald…",
    "link": "https://www.memeorandum.com/251015/p27",
    "timestamp": "2025-10-15T12:45:00Z"
  },
  {
    "title": "'Firepower' coming for Ukraine, Hegseth tells NATO",
    "description": "Defense Secretary Pete Hegseth promised Wednesday that \"firepower\" was coming for Ukraine amid speculation that Washington could hand Kyiv long-range Tomahawk missiles to pressure Russia to end the war.",
    "link": "https://www.nbcnews.com/world/ukraine/firepower-coming-ukraine-hegseth-tells-nato-rcna237722",
    "timestamp": "2025-10-15T12:44:53Z"
  },
  {
    "title": "What is nihilistic violent extremism, blamed for most mass shootings in US?",
    "description": "Prosecutors label crimes as 'nihilistic violent extremism', while experts caution against oversimplifying motivations.",
    "link": "https://www.aljazeera.com/news/2025/10/15/what-is-nihilistic-violent-extremism-blamed-for-most-mass-shootings-in-us",
    "timestamp": "2025-10-15T12:44:15Z"
  },
  {
    "title": "Trump says U.S. financial support for Argentina could hinge on their midterm election results",
    "description": "U.S. support for Argentina hinges on the ruling party of President Javier Milei succeeding in this month's midterm legislative elections, President Donald Trump said on Tuesday, roiling markets in the South American country with what could be the Republican's…",
    "link": "https://www.cbc.ca/news/world/us-trump-argentina-milei-bailout-midterm-elections-9.6938899",
    "timestamp": "2025-10-15T12:43:16Z"
  },
  {
    "title": "Flare-up in US-China trade tensions poses a big risk to Thailand's growth - deputy central bank governor",
    "description": "WASHINGTON (Reuters) -The fresh flare-up in trade tensions between the United States and China is a big risk to the outlook for Thailand's economic growth...",
    "link": "https://finance.yahoo.com/news/flare-us-china-trade-tensions-124134083.html",
    "timestamp": "2025-10-15T12:41:34Z"
  },
  {
    "title": "Democrats Hold Socialist Zohran Mamdani At Arms Length After He Declared Victory Over Party’s ‘Soul’",
    "description": "Avowed socialist Zohran Mamdani says his mayoral campaign has put progressives in the driver’s seat of the Democratic Party — but establishment Democrats are not ready to take their hands off the wheel.  Mamdani, 33, the party’s nominee in the New York City m…",
    "link": "https://dailycaller.com/2025/10/15/senate-democrats-zohran-mamdani-arms-length-socialist/",
    "timestamp": "2025-10-15T12:40:46Z"
  },
  {
    "title": "US investment boom is sustainable, Bessent says",
    "description": "Washington () -The wave of investment into the U. economy is sustainable and is only getting started, but the federal government shutdown is increasingly an ...",
    "link": "https://finance.yahoo.com/news/us-investment-boom-sustainable-bessent-123644367.html",
    "timestamp": "2025-10-15T12:36:44Z"
  },
  {
    "title": "Egypt says Israel and Hamas approved Palestinian team tapped to govern postwar Gaza",
    "description": "15 Palestinian technocrats will ‘take care of daily life’ in Gaza, declares Egyptian FM, as UN official says a number of countries have pledged billions needed for reconstruction. “We need to deploy them to take care of the daily life of the people in Gaza, a…",
    "link": "https://freerepublic.com/focus/f-news/4346471/posts",
    "timestamp": "2025-10-15T12:36:43Z"
  },
  {
    "title": "'Happens all the time': Grocery clerk hit with profanity from sticker-shocked customers",
    "description": "President Donald Trump won re-election last year by promising to end inflation \"on Day One,\" but 268 days into his second term grocery customers are swearing off some choices as too expensive.Mario Bedolla has worked four decades at North Pulaski Fresh Market…",
    "link": "https://www.rawstory.com/trump-inflation-2674186339/",
    "timestamp": "2025-10-15T12:35:22Z"
  },
  {
    "title": "The government shutdown is putting a renewed spotlight on the cracks in the US aviation system",
    "description": "Experts say air travel could face deeper problems if the shutdown continues.",
    "link": "https://www.bostonherald.com/2025/10/15/government-shutdown-air-travel-impact/",
    "timestamp": "2025-10-15T12:34:49Z"
  },
  {
    "title": "Democrat Rep. Madeleine Dean Fumes as President Trump Uses Unspent Funds to Pay Troops During Democrat Shutdown",
    "description": "Democrat Rep. Madeleine Dean (D-PA) lashed out after President Donald Trump announced that he would use unspent research and development (R&D) funds to pay U.S. troops amid the ongoing Democrat-caused government shutdown. During a CNN interview with John Berm…",
    "link": "https://freerepublic.com/focus/f-news/4346469/posts",
    "timestamp": "2025-10-15T12:33:25Z"
  },
  {
    "title": "Abbott revenue falls short of estimates on weak demand for diagnostic devices",
    "description": "() -Abbott missed analysts' estimates for third-quarter revenue on Wednesday, as weakness in its diagnostics and nutritional businesses failed to offset...",
    "link": "https://finance.yahoo.com/news/abbott-revenue-falls-short-estimates-123322838.html",
    "timestamp": "2025-10-15T12:33:22Z"
  },
  {
    "title": "Factbox-From OpenAI to Meta, firms channel billions into AI infrastructure as demand booms",
    "description": "OpenAI has partnered with Broadcom to produce its first in-house artificial intelligence processors, the latest tie-up for the world's most valuable startup ...",
    "link": "https://finance.yahoo.com/news/factbox-openai-meta-firms-channel-122829583.html",
    "timestamp": "2025-10-15T12:28:29Z"
  },
  {
    "title": "'Disgusting': Racist, Homophobic, Antisemitic, and Violent Private Chats of GOP Leaders Exposed",
    "description": "Is this who they are when not in view of public judgment or recrimination?That is just one of the questions being widely asked after Politico on Tuesday revealed nearly seven months of grotesque private chats between members of Leaders of Young Republicans, t…",
    "link": "https://www.commondreams.org/news/young-gop-leaders-hitler-chats",
    "timestamp": "2025-10-15T12:26:52Z"
  },
  {
    "title": "Abraham Accords: Trump’s Tool For Peace In Middle East",
    "description": "By Virginia Allen, The Daily Signal | October 14, 2025\nThe Middle East is facing an opportunity for peace, President Donald Trump told world leaders in Israel and Egypt. One of the means to achieve that future, according to Trump, is through the Abraham Accor…",
    "link": "https://biztoc.com/x/c8a6b924ba38a23c",
    "timestamp": "2025-10-15T12:26:30Z"
  },
  {
    "title": "Trump Critics Bash Him for Chuckling About His Own Shooting at Slain Pal Charlie Kirk’s Medal Ceremony",
    "description": "Critics torched Trump over a quip about his own shooting as he honored slain activist and friend Charlie Kirk, who was killed by an assassin's bullet.\nThe post Trump Critics Bash Him for Chuckling About His Own Shooting at Slain Pal Charlie Kirk’s Medal Cerem…",
    "link": "https://www.mediaite.com/online/trump-critics-bash-him-for-chuckling-about-his-own-shooting-at-slain-pal-charlie-kirks-medal-ceremony/",
    "timestamp": "2025-10-15T12:26:23Z"
  },
  {
    "title": "America Must Choose: MAGA or Mamdani-ism – AMAC Magazine Exclusive",
    "description": "Whenever a nation goes into crisis, an invisible countdown begins. We may not be able to see it. We may not know how much time is left. But the countdown is there—the countdown to reform or revolution. When a nation faces major problems that leave the people …",
    "link": "https://freerepublic.com/focus/f-chat/4346468/posts",
    "timestamp": "2025-10-15T12:25:19Z"
  },
  {
    "title": "Trump Has Just Condemned More Americans to Hunger",
    "description": "Elie Mystal\n\n\n\nThe administration’s decision to fast-track a bunch of changes to food stamps—including new work requirements—is as stupid as it is cruel.\r\n\n\r\n\n\nThe post Trump Has Just Condemned More Americans to Hunger appeared first on The Nation.",
    "link": "https://www.thenation.com/article/economy/food-stamp-work-requirements/",
    "timestamp": "2025-10-15T12:24:47Z"
  },
  {
    "title": "Jack Smith speaks out against the Trump administration in rare interview",
    "description": "Jack Smith, the special counsel who brought two criminal cases against Donald Trump, spoke out against the Trump administration in a rare interview posted Tuesday.Smith, who resigned from the Justice Department in January shortly before Trump returned to offi…",
    "link": "https://freerepublic.com/focus/f-chat/4346467/posts",
    "timestamp": "2025-10-15T12:24:42Z"
  },
  {
    "title": "Supreme Court takes up GOP-led challenge to Voting Rights Act that could affect control of Congress",
    "description": "The challenge could gut a key provision that prohibits racial discrimination in redistricting.",
    "link": "https://www.bostonherald.com/2025/10/15/supreme-court-voting-rights-act/",
    "timestamp": "2025-10-15T12:23:51Z"
  },
  {
    "title": "Supreme Court takes up GOP-led challenge to Voting Rights Act that could affect control of Congress",
    "description": "The challenge could gut a key provision that prohibits racial discrimination in redistricting.",
    "link": "https://www.denverpost.com/2025/10/15/supreme-court-voting-rights-act/",
    "timestamp": "2025-10-15T12:23:51Z"
  },
  {
    "title": "Trump says US to disarm Hamas if it does not do so itself",
    "description": "U.S. President Donald Trump on Oct. 14 said that \"we will disarm\" Hamas if the Palestinian militants refuse to do it themselves, as he called for the group to release the bodies of hostages in Gaza.",
    "link": "https://www.hurriyetdailynews.com/trump-says-us-to-disarm-hamas-if-it-does-not-do-so-itself-214705",
    "timestamp": "2025-10-15T12:20:45Z"
  },
  {
    "title": "Wednesday, October 15, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-october-15-2025/",
    "timestamp": "2025-10-15T12:19:43Z"
  },
  {
    "title": "Can the ACLU Serve Progressives and Conservatives?",
    "description": "ACLU legal director Ben Wizner warns that Donald Trump’s war on dissent endangers the First Amendment, urges Americans to protect speech they dislike, and reflects on Edward Snowden’s enduring legacy.",
    "link": "https://reason.com/podcast/2025/10/15/can-the-aclu-serve-progressives-and-conservatives/",
    "timestamp": "2025-10-15T12:18:16Z"
  },
  {
    "title": "Trump Awards Charlie Kirk A Posthumous Presidential Medal Of Freedom",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 14, 2025\nPresident Donald Trump on Tuesday awarded the late conservative hero Charlie Kirk the Presidential Medal of Freedom.\n“Today, we’re here to honor and remember a fearless warrior for liberty, b…",
    "link": "https://biztoc.com/x/991bd89a35022fd2",
    "timestamp": "2025-10-15T12:15:34Z"
  },
  {
    "title": "Trump says US will not 'waste our time' helping Argentina if Milei loses (Ione Wells/BBC)",
    "description": "Ione Wells / BBC:\nTrump says US will not ‘waste our time’ helping Argentina if Milei loses  —  President Donald Trump has acknowledged that a $20bn (£15bn) US lifeline to help calm Argentina's currency crisis is an attempt to sway legislative elections this m…",
    "link": "https://www.memeorandum.com/251015/p21",
    "timestamp": "2025-10-15T12:15:00Z"
  },
  {
    "title": "Katie Porter says she regrets viral outbursts at reporter, staffer",
    "description": "Former Democratic lawmaker Katie Porter acknowledges she “could have handled things better\" regarding her viral outbursts against a reporter and a staffer.",
    "link": "https://www.foxnews.com/politics/katie-porter-says-she-regrets-viral-outbursts-reporter-staffer",
    "timestamp": "2025-10-15T12:14:56Z"
  },
  {
    "title": "Afghan Taliban and Pakistan claim many dead in new border clashes",
    "description": "Fresh fighting broke out on Wednesday, with each side accusing the other of initiating the clashes.",
    "link": "https://www.bbc.com/news/articles/c3dnvnjdg1ro",
    "timestamp": "2025-10-15T12:14:54Z"
  },
  {
    "title": "Trump ‘optimistic’ he can broker peace in Ukraine after Middle East success - Politico",
    "description": "Trump ‘optimistic’ he can broker peace in Ukraine after Middle East successPolitico As Trump focuses again on Ukraine war, Zelensky seeks long-range missilesThe Washington Post Zelenskiy to meet Trump on Friday to talk air defence, new weaponsReuters Donald T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179798860",
    "timestamp": "2025-10-15T12:12:55Z"
  },
  {
    "title": "Federal workers endure financial strain and fear layoffs as the government shutdown drags on",
    "description": "As the government shutdown drags on, federal employees find themselves in a tightening vise of financial strain. Many are either working without compensation or experiencing furloughs, leading to a growing pile of unpaid bills and a surge in anxiety. The pros…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/federal-workers-endure-financial-strain-and-fear-layoffs-as-the-government-shutdown-drags-on/articleshow/124578418.cms",
    "timestamp": "2025-10-15T12:11:35Z"
  },
  {
    "title": "America Confronts Its Next Great Energy Crisis: Rare Earth Minerals",
    "description": "America's heavy reliance on imports of its rare earth minerals via supply chains controlled by China could result in the most disruptive energy crisis since 1973.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/10/15/america-confronts-its-next-great-energy-crisis-rare-earth-minerals/",
    "timestamp": "2025-10-15T12:08:20Z"
  },
  {
    "title": "Comey seeks to toss criminal case calling Trump prosecutor 'unlawful' appointee",
    "description": "Lawyers for James Comey told a federal judge in Alexandria on Tuesday that they plan to file a motion early next week to formally dismiss his criminal case, citing what they argued is President Donald Trump’s \"unlawful\" appointment of former White House aide …",
    "link": "https://freerepublic.com/focus/f-news/4346465/posts",
    "timestamp": "2025-10-15T12:05:52Z"
  },
  {
    "title": "Trump threatens to cut aid to Argentina if Milei loses in midterms",
    "description": "US President Donald Trump said that his country’s $20 billion bailout for Argentina was contingent on Javier Milei’s party prevailing in midterm elections.\nBuenos Aires is suffering a currency crisis; in a meeting in Washington, Trump reiterated Washington’s …",
    "link": "https://biztoc.com/x/e7ebc380438e943b",
    "timestamp": "2025-10-15T12:05:02Z"
  },
  {
    "title": "Trump Threatens to Cut More Jobs as Shutdown Enters Day 15",
    "description": "With the government shutdown at Day 15, President Donald Trump is issuing new threats, warning he’ll have a list of programs and jobs that could be cut permanently by the end of the week. NBC’s Ryan Nobles reports for TODAY.",
    "link": "https://biztoc.com/x/2a28823374183b91",
    "timestamp": "2025-10-15T12:05:01Z"
  },
  {
    "title": "Netanyahu says he's giving \"peace a chance,\" but voices long term doubts",
    "description": "Netanyahu tells CBS News he's giving \"peace a chance,\" but despite Trump's assertion the war is over, Israel's leader talks of change over generations.",
    "link": "https://www.cbsnews.com/news/israel-netanyahu-hamas-gaza-peace-deal-no-palestinian-state-with-fanaticism/",
    "timestamp": "2025-10-15T12:03:11Z"
  },
  {
    "title": "Trump's new China threat, bank earnings, Boeing deliveries and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/10/15/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-10-15T12:03:04Z"
  },
  {
    "title": "Gavin Newsom, and his opponents, make California’s redistricting fight about him | CNN Politics",
    "description": "Democratic Gov. Gavin Newsom’s name isn’t on the ballot this year, but California’s upcoming special election will likely hinge on how voters view him.",
    "link": "https://www.cnn.com/2025/10/15/politics/gavin-newsom-california-redistricting",
    "timestamp": "2025-10-15T12:00:53Z"
  },
  {
    "title": "Trump’s redistricting push gains steam in another key state: 'We will stand with the president'",
    "description": "GOP-controlled North Carolina legislature will vote on new congressional map targeting Democratic Rep. Ron Davis's swing district to secure additional Republican seat.",
    "link": "https://www.foxnews.com/politics/trumps-redistricting-push-gains-steam-another-key-state-stand-with-president",
    "timestamp": "2025-10-15T12:00:47Z"
  },
  {
    "title": "Trump storms most violent US city with federal muscle as police group warns of soft-on-crime consequences",
    "description": "Trump administration sends FBI, ATF and other federal agencies to Memphis despite local police disputing claims that the city is plagued by elevated crime levels.",
    "link": "https://www.foxnews.com/us/trump-storms-most-violent-us-city-federal-muscle-police-group-warns-soft-crime-consequences",
    "timestamp": "2025-10-15T12:00:47Z"
  },
  {
    "title": "Former Yale Prof Compares Firing People Over Vile Charlie Kirk Posts to Nazi Germany",
    "description": "\"I think that they’re throwing everything at this. This is more than McCarthy.\"\nThe post Former Yale Prof Compares Firing People Over Vile Charlie Kirk Posts to Nazi Germany first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/former-yale-prof-compares-firing-people-over-vile-charlie-kirk-posts-to-nazi-germany/",
    "timestamp": "2025-10-15T12:00:46Z"
  }
]