[
  {
    "title": "Sotomayor Scorches Supreme Court's Racial Profiling Ruling In Blistering Dissent",
    "description": "\"The Constitution does not permit the creation of such a second-class citizenship status,\" the justice wrote in her dissent.",
    "link": "https://www.huffpost.com/entry/sonia-sotomayor-racial-profiling-dissent_n_68bf0681e4b055a5037b975c",
    "timestamp": "2025-09-08T19:21:13Z"
  },
  {
    "title": "BREAKING: WSJ Publishes Photo of Trump’s Bawdy Birthday Letter to Epstein — Which Trump Called ‘Fake’",
    "description": "The Wall Street Journal has published a photo of a bawdy letter President Donald Trump reportedly wrote to Jeffrey Epstein for his 50th birthday\nThe post BREAKING: WSJ Publishes Photo of Trump’s Bawdy Birthday Letter to Epstein — Which Trump Called ‘Fake’ fir…",
    "link": "https://www.mediaite.com/media/news/breaking-wsj-publishes-photo-of-trumps-bawdy-birthday-letter-to-epstein-which-trump-called-fake/",
    "timestamp": "2025-09-08T19:19:56Z"
  },
  {
    "title": "US Open Tells Broadcasters Not To Broadcast Trump Being Booed At The US Open",
    "description": "Good lord, here comes another act of preemptive cowardice in service of ensuring the most powerful man in the world enjoys his appearance before a crowd he can’t control or doesn’t own. Here’s Ben Rothenburg of tennis-focused blog Bounces with the scoop: An i…",
    "link": "https://www.techdirt.com/2025/09/08/us-open-tells-broadcasters-not-to-broadcast-trump-being-booed-at-the-us-open/",
    "timestamp": "2025-09-08T19:19:20Z"
  },
  {
    "title": "Trump appears with Rolex CEO at U.S. Open even as 39% tariff set to pummel Swiss watch imports",
    "description": "President Donald Trump reportedly attended the U.S. Open this weekend at the invitation of the watchmaker.",
    "link": "https://www.cnbc.com/2025/09/08/trump-us-open-invitation-rolex-tariff-switzerland.html",
    "timestamp": "2025-09-08T19:17:16Z"
  },
  {
    "title": "Speaker Johnson walks backs comment that Trump was an ‘FBI informant’ in Epstein case | CNN Politics",
    "description": "House Speaker Mike Johnson on Monday attempted to clean up earlier remarks he made claiming that President Donald Trump had been an “FBI informant” in the Jeffrey Epstein case.",
    "link": "https://www.cnn.com/2025/09/08/politics/johnson-trump-fbi-informant-epstein",
    "timestamp": "2025-09-08T19:17:15Z"
  },
  {
    "title": "Will Trump’s new Gaza ceasefire proposal end Israel’s genocide?",
    "description": "Observers are sceptical that Donald Trump's US ceasefire proposal can bring Israel's genocide in Gaza to an end.",
    "link": "https://www.aljazeera.com/news/2025/9/8/will-trumps-new-gaza-ceasefire-proposal-end-israels-genocide",
    "timestamp": "2025-09-08T19:17:10Z"
  },
  {
    "title": "The Way to Stop Autocratic Slide Is Staring Us in the Face",
    "description": "There has been accelerating doomer sentiment in recent days that democracy may be cooked.",
    "link": "https://slate.com/news-and-politics/2025/09/trump-news-chicago-autocracy-democracy-constitution-law.html",
    "timestamp": "2025-09-08T19:16:04Z"
  },
  {
    "title": "Trump's risque birthday doodle to Jeffrey Epstein released by House Democrats",
    "description": "Democrats on the House Oversight Committee released a risque birthday note from President Donald Trump to sex offender Jeffrey Epstein.In July, the Wall Street Journal first reported that Trump had sent Epstein the note written inside of a doodle of a woman's…",
    "link": "https://www.rawstory.com/trump-epstein-2673971276/",
    "timestamp": "2025-09-08T19:14:22Z"
  },
  {
    "title": "Neoliberalism in France Receives a New Blow as Yet Another Government Falls",
    "description": "Europe’s second-largest economy has plunged into political paralysis again, as the French government has been overthrown by yet another no-confidence vote. This time, the no-confidence vote was against Prime Minister François Bayrou and his proposals to reduc…",
    "link": "https://www.commondreams.org/opinion/france-neoliberalism",
    "timestamp": "2025-09-08T19:13:52Z"
  },
  {
    "title": "Democrats release suggestive letter to Epstein purportedly signed by Trump, which he denies",
    "description": "Trump filed a $10 billion lawsuit against The Wall Street Journal for a report on the alleged letter.",
    "link": "https://www.bostonherald.com/2025/09/08/epstein-letter-trump/",
    "timestamp": "2025-09-08T19:13:40Z"
  },
  {
    "title": "Democrats release suggestive letter to Epstein purportedly signed by Trump, which he denies",
    "description": "Trump filed a $10 billion lawsuit against The Wall Street Journal for a report on the alleged letter.",
    "link": "https://www.denverpost.com/2025/09/08/epstein-letter-trump/",
    "timestamp": "2025-09-08T19:13:40Z"
  },
  {
    "title": "3576 - McTrump Slump; The Immigrant Rebuild of NOLA w/ Sarah Fouts",
    "description": "It's Fun Day Monday on the Majority Report On Today's Show: The Trump slump is really starting to punish Americans as farmers panic and stagflation builds McDonald's CEO breaks down the dual realities of the American economy. People making over 100k are livin…",
    "link": "https://majorityfm.libsyn.com/3576-mctrump-slump-the-immigrant-rebuild-of-nola-w-sarah-fouts",
    "timestamp": "2025-09-08T19:10:00Z"
  },
  {
    "title": "Trump renews attacks on Biden’s health to distract from his own lack of transparency",
    "description": "Ali Velshi highlights Trump's history of obstructing information regarding his health and contrasts his transparency with that of Joe Biden.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-health-conspiracies-transparency-biden-rcna229870",
    "timestamp": "2025-09-08T19:09:58Z"
  },
  {
    "title": "U.S. government shutdown September deadline nears: Check date, key details",
    "description": "Will there be government shutdown under the tenure of U.S. President Donald Trump?",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-government-shutdown-september-deadline-nears-check-date-key-details/articleshow/123772613.cms",
    "timestamp": "2025-09-08T19:09:36Z"
  },
  {
    "title": "Supreme Court allows immigration agents to resume ‘roving patrols’ in LA, siding with Trump",
    "description": "The U.S. Supreme Court lifted limits on immigration sweeps in Southern California, overturning a lower court ruling that prohibited agents from stopping people based on their appearance.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/09/08/supreme-court-allows-immigration-agents-to-resume-roving-patrols-in-la-siding-with-trump",
    "timestamp": "2025-09-08T19:08:46Z"
  },
  {
    "title": "He apparently even has stochastically-coded language for Domestic Violence enthusiasts [Scary]",
    "description": "He apparently even has stochastically-coded language for Domestic Violence enthusiasts",
    "link": "https://www.fark.com/comments/13804190/He-apparently-even-has-stochastically-coded-language-for-Domestic-Violence-enthusiasts",
    "timestamp": "2025-09-08T19:08:33Z"
  },
  {
    "title": "New tariff rules bring 'maximum chaos' as surprise charges hit consumers",
    "description": "The bills are sudden and jarring: $1,400 for a computer part from Germany, $620 for an aluminum case from Sweden and $1,041 for handbags from Spain",
    "link": "https://www.nbcnews.com/business/consumer/surprise-tariff-bills-de-minimis-rcna229375",
    "timestamp": "2025-09-08T19:06:45Z"
  },
  {
    "title": "Trump's Epstein letter and drawing from 'birthday book' released",
    "description": "Trump's signature in the letter to Epstein is located just below the thighs of a drawing of a woman's torso.",
    "link": "https://www.cnbc.com/2025/09/08/trump-epstein-birthday-book-oversight.html",
    "timestamp": "2025-09-08T19:06:18Z"
  },
  {
    "title": "Illinois among blue states to keep public health dollars while red states lose out",
    "description": "By ANNA CLAIRE VOLLERS stateline.org Article Summary President Donald Trump’s administration sought to block $11 billion in public health funding",
    "link": "https://capitolnewsillinois.com/news/illinois-among-blue-states-to-keep-public-health-dollars-while-red-states-lose-out/",
    "timestamp": "2025-09-08T19:06:08Z"
  },
  {
    "title": "Donald Trump's Alleged 'Birthday Book' Message To Jeffrey Epstein Revealed",
    "description": "The House Oversight Committee obtained the material from Epstein's estate via subpoena.",
    "link": "https://www.huffpost.com/entry/epstein-birthday-book-trump-message-revealed_n_68bf2695e4b055a5037bbf8b",
    "timestamp": "2025-09-08T19:05:44Z"
  },
  {
    "title": "Gene Pressman’s Just-Released Exposé on the Glitzy World of Barneys New York Is Already Topping Bestseller Lists — Here’s How to Get the Book",
    "description": "\"They All Came to Barneys\" details the highs and lows of the beloved, multimillion-dollar fashion retail empire, told from the voice of Gene Pressman, who was the store's co-CEO during its heyday.",
    "link": "http://wwd.com/shop/shop-fashion/they-all-came-to-barneys-book-buy-read-online-1238123128/",
    "timestamp": "2025-09-08T19:05:35Z"
  },
  {
    "title": "Newsom Hits Back Hard at Trump’s LA Claims: He Thanked His Troops For Ending the Riot Before They Arrived",
    "description": "\"Why doesn’t the President remember where he’s sending troops or when they got somewhere???\" Newsom fumed\nThe post Newsom Hits Back Hard at Trump’s LA Claims: He Thanked His Troops For Ending the Riot Before They Arrived first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/newsom-hits-back-hard-at-trumps-la-claims-he-thanked-his-troops-for-ending-the-riot-before-they-arrived/",
    "timestamp": "2025-09-08T19:05:13Z"
  },
  {
    "title": "Mystery blue object between Trump's teeth sparks questions — and mockery: 'Meds or mint?'",
    "description": "A mysterious blue object spotted between President Donald Trump’s teeth at the U.S. Open set off a social media firestorm and fueled speculation and plenty of mockery about the president’s health.Legal analyst Amee Vanderpool, who pens the \"SHERO\" Substack, s…",
    "link": "https://www.rawstory.com/trump-pill/",
    "timestamp": "2025-09-08T19:04:56Z"
  },
  {
    "title": "DHS announces \"Operation Midway Blitz\" amid ICE operations in Chicago",
    "description": "President Donald Trump has amplified his promises to send National Guard troops and immigration agents to Chicago by posting a parody image from \"Apocalypse Now\" featuring a ball of flames as helicopters zoom over the nation's third-largest city.",
    "link": "https://www.cbsnews.com/chicago/news/operation-midway-blitz-chicago-ice-operations-immigration-crackdown/",
    "timestamp": "2025-09-08T19:04:53Z"
  },
  {
    "title": "Trump celebrates West Point alumni group canceling award ceremony to honor Tom Hanks",
    "description": "Trump celebrates West Point alumni group canceling award ceremony to honor Tom Hankslocal10.com",
    "link": "https://www.local10.com//entertainment/2025/09/08/trump-celebrates-west-point-alumni-group-canceling-award-ceremony-to-honor-tom-hanks/",
    "timestamp": "2025-09-08T19:02:33Z"
  },
  {
    "title": "Epstein Files Update as House Gets Alleged Trump Note, Estate Materials",
    "description": "Chairman James Comer had subpoenaed the estate for materials that are expected to include Epstein's so-called birthday book.",
    "link": "https://www.newsweek.com/jeffrey-epstein-birthday-book-donald-trump-estate-files-2126582",
    "timestamp": "2025-09-08T19:01:50Z"
  },
  {
    "title": "Trump at Museum of the Bible: ‘We Will Never Apologize for Our Faith’",
    "description": "President Donald Trump declared that Americans will never apologize for their faith and revealed that the Department of Education will issue guidance to protect prayer in schools. \nThe post Trump at Museum of the Bible: ‘We Will Never Apologize for Our Faith’…",
    "link": "https://www.breitbart.com/politics/2025/09/08/trump-at-museum-of-bible-we-will-never-apologize-for-our-faith/",
    "timestamp": "2025-09-08T19:00:54Z"
  },
  {
    "title": "US supreme court backs Trump’s aggressive immigration raids",
    "description": "The court’s three liberal justices publicly dissented, directing pointed criticism at its conservative majority",
    "link": "https://www.irishtimes.com/world/us/2025/09/08/us-supreme-court-backs-trumps-aggressive-immigration-raids/",
    "timestamp": "2025-09-08T19:00:30Z"
  },
  {
    "title": "Trump condemns 'lunatic' in Charlotte stabbing: 'If we don't handle evil, we don't have a country' (Fox News)",
    "description": "Fox News:\nTrump condemns ‘lunatic’ in Charlotte stabbing: 'If we don't handle evil, we don't have a country'  —  President Donald Trump on Monday reacted to the fatal stabbing of a 23-year-old Ukrainian refugee that happened last month in Charlotte, North Car…",
    "link": "https://www.memeorandum.com/250908/p94",
    "timestamp": "2025-09-08T19:00:26Z"
  },
  {
    "title": "Another Bloody Weekend Puts Chicago in Trump’s Crosshairs; ICE Raid Now Underway",
    "description": "\"Excuse me, do you know how many people were killed in Chicago last weekend? Eight. You know how many people were killed in Chicago the week before? Seven. ... You think there’s worse than that? I don’t think so.\"\nThe post Another Bloody Weekend Puts Chicago …",
    "link": "https://legalinsurrection.com/2025/09/another-bloody-weekend-on-the-streets-of-chicago-puts-city-in-trumps-crosshairs/",
    "timestamp": "2025-09-08T19:00:24Z"
  },
  {
    "title": "Inside Donald Trump's authoritarian lurch",
    "description": "Trump is not an American monarch. Nor is he an American dictator. Nonetheless, he is displaying blatant signs of being an American authoritarian.",
    "link": "https://www.abc.net.au/news/2025-09-09/donald-trump-dictator-authoritarian/105720444",
    "timestamp": "2025-09-08T19:00:00Z"
  },
  {
    "title": "Donald Trump's 'Rose Garden Club' Launch Sparks Liberal Meltdown: Critics Blast GOP for 'Cheersing Diet Cokes' While Economy Implodes",
    "description": "Donald Trump has officially opened his new White House patio dubbed 'the Rose Garden Club' and liberals are already complaining, saying the GOP should focus on economy.",
    "link": "https://radaronline.com/p/trump-rose-garden-club-sparks-liberal-meltdown-diet-cokes-economy/",
    "timestamp": "2025-09-08T19:00:00Z"
  },
  {
    "title": "Americans should be worried about Trump’s economy",
    "description": "On the heels of a disappointing August jobs report, Ali Velshi explains why, as Janet Yellen warned, Americans should be worried about Trump's economy.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-economy-august-jobs-report-unemployment-federal-reserve-rcna229899",
    "timestamp": "2025-09-08T18:59:33Z"
  },
  {
    "title": "Randy Fine Reveals Plan to Hold Judges Accountable for Violent Repeat Offenders",
    "description": "Rep. Randy Fine (R-FL) is introducing legislation to \"hold judges accountable when violent repeat offenders they release commit new crimes\" after the brutal murder of a Ukrainian refugee that occurred on a rail system in Charlotte, North Carolina.\nThe post Ra…",
    "link": "https://www.breitbart.com/politics/2025/09/08/randy-fine-reveals-plan-to-hold-judges-accountable-for-violent-repeat-offenders/",
    "timestamp": "2025-09-08T18:59:18Z"
  },
  {
    "title": "The One Crime Trump Doesn’t Seem to Have a Problem With? Domestic Violence.",
    "description": "Speaking at the Museum of the Bible on Monday, President Donald Trump repeated one of his favorite falsehoods as of late: That his deployment of the National Guard in Washington, DC, has virtually eliminated crime in the nation’s capital. That is, of course, …",
    "link": "https://www.motherjones.com/politics/2025/09/the-one-crime-trump-doesnt-seem-to-have-a-problem-with-domestic-violence/",
    "timestamp": "2025-09-08T18:58:51Z"
  },
  {
    "title": "Organizers Ramp Up Push for Oct. 18 No Kings Actions Against 'Wannabe Dictator' Trump",
    "description": "The coalition of progressive organizations that helped organize the nationwide \"No Kings\" protests this summer are ramping up for a potentially even bigger event in the fall.The organizations pushed out new publicity on Monday about the \"No Kings 2\" demonstra…",
    "link": "https://www.commondreams.org/news/no-kings-2-october-18",
    "timestamp": "2025-09-08T18:58:39Z"
  },
  {
    "title": "Supreme Court OKs Los Angeles immigration sweeps",
    "description": "The Supreme Court on Monday cleared the way for federal agents to conduct sweeping immigration operations for now in Los Angeles, the latest victory for President Donald Trump's administration at the high court.",
    "link": "https://www.bostonherald.com/2025/09/08/supreme-court-oks-los-angeles-immigration-sweeps/",
    "timestamp": "2025-09-08T18:57:08Z"
  },
  {
    "title": "Complicity in Israeli genocide is Starmer’s shame",
    "description": "British prime minister Keir Starmer and the governing Labour party have shown themselves to be utterly complicit in the Israeli genocide taking place in Gaza, doing nothing except make largely meaningless statements. But their latest actions are jaw-dropping.…",
    "link": "https://freethoughtblogs.com/singham/2025/09/08/complicity-in-israeli-genocide-is-starmers-shame/",
    "timestamp": "2025-09-08T18:56:21Z"
  },
  {
    "title": "'The View' co-host urges people to take videos of ICE agents",
    "description": "Ana Navarro, a co-host of \"The View,\" warned against violence against ICE on Monday but encouraged people to film enforcement operations during the ABC show.",
    "link": "https://www.foxnews.com/media/the-view-co-host-urges-people-take-videos-ice-agents",
    "timestamp": "2025-09-08T18:55:46Z"
  },
  {
    "title": "Red Sea cable cuts disrupt internet in Asia, Middle East; Houthis deny involvement as Microsoft warns of disruption",
    "description": "Undersea cable cuts in the Red Sea disrupted internet access in parts of Asia and the Middle East, experts said Sunday, though it wasn't immediately clear what caused the incident.",
    "link": "https://fortune.com/2025/09/08/red-sea-cable-cuts-disrupt-internet-in-asia-middle-east-houthis-deny-involvement-as-microsoft-warns-of-disruption/",
    "timestamp": "2025-09-08T18:54:59Z"
  },
  {
    "title": "Republicans eager for Trump to expand use of military on U.S. soil",
    "description": "As Trump has stepped up his use of military force, fellow Republicans in Congress have done little but cheer him on.",
    "link": "https://www.pbs.org/newshour/politics/republicans-eager-for-trump-to-expand-use-of-military-on-u-s-soil",
    "timestamp": "2025-09-08T18:52:23Z"
  },
  {
    "title": "China's export growth slows in August as US tariffs and trade tensions bite",
    "description": "China's export growth slowed to 4.4% in August, a decrease from July's 7.2% increase, while imports rose by 1.8%. Trade tensions with the U.S. continue, with exports to the U.S. plummeting 33%. Despite this, exports to the EU saw a 10.4% increase, and rare ea…",
    "link": "https://economictimes.indiatimes.com/news/international/business/chinas-export-growth-slows-in-august-as-us-tariffs-and-trade-tensions-bite/articleshow/123772530.cms",
    "timestamp": "2025-09-08T18:52:18Z"
  },
  {
    "title": "Scott Bessent Continues His Gaslighting On Trump's Tariffs",
    "description": "Treasury Sec. Scott Bessent continued insulting the intelligence of every American during an interview on this Sunday's Meet the Press. Even though Bessent had previously admitted that tariffs are price increases, he was back to denying their impact when host…",
    "link": "https://crooksandliars.com/2025/09/scott-bessent-continues-his-gaslighting",
    "timestamp": "2025-09-08T18:52:14Z"
  },
  {
    "title": "GOP Senator Blames 'What The CDC Did During COVID' For Shooting At Its HQ",
    "description": "Sen. Roger Marshall (R-KS) suggested that a shooting at the Centers for Disease Control and Prevention (CDC) happened because of what the agency \"did during COVID.\"\n\n\nDuring a Sunday interview with Marshall, CBS host Margaret Brennan advised the senator to be…",
    "link": "https://crooksandliars.com/2025/09/gop-senator-blames-what-cdc-did-during",
    "timestamp": "2025-09-08T18:52:14Z"
  },
  {
    "title": "House committee receives ‘birthday book’ in first batch of documents from Epstein estate | CNN Politics",
    "description": "The House Oversight Committee has received its first documents from Jeffrey Epstein’s estate, including a reported collection of letters gifted to the estate of late convicted sex offender for his 50th birthday that included a note bearing President Donald Tr…",
    "link": "https://www.cnn.com/2025/09/08/politics/epstein-estate-birthday-book-documents-house-oversight",
    "timestamp": "2025-09-08T18:51:38Z"
  },
  {
    "title": "‘Ridiculousness’: Not just Secret Service, now L.A. cops drop protection for Kamala Harris",
    "description": "'Pulling police officers from protecting everyday Angelenos to protect a failed presidential candidate who also happens to be a multi-millionaire ... and who can easily afford to pay for her own security, is nuts'",
    "link": "https://www.wnd.com/2025/09/ridiculousness-not-just-secret-service-now-l-cops/",
    "timestamp": "2025-09-08T18:51:23Z"
  },
  {
    "title": "Trump: European Leaders Will Return This Week To Discuss Russia–Ukraine War",
    "description": "Trump: European Leaders Will Return This Week To Discuss Russia–Ukraine War\n \nAuthored by Joseph Lord via The Epoch Times,\nPresident Donald Trump announced on Sunday that European leaders would return to the United States in the coming days to discuss the adm…",
    "link": "https://biztoc.com/x/54e93c60fb3f5ba0",
    "timestamp": "2025-09-08T18:51:05Z"
  },
  {
    "title": "Trump questions whether 'lesser' crimes such as domestic violence should count toward DC crime statistics",
    "description": "Trump questions whether 'lesser' crimes such as domestic violence should count toward DC crime statisticsgo.com",
    "link": "https://abcnews.go.com/Politics/trump-questions-lesser-crimes-domestic-violence-count-dc/story?id=125370358",
    "timestamp": "2025-09-08T18:50:19Z"
  },
  {
    "title": "Trump boosts end-run around Johnson on congressional stock trading ban (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\nTrump boosts end-run around Johnson on congressional stock trading ban  —  President Donald Trump offered support Monday for GOP Rep. Anna Paulina Luna's push to circumvent House Republican leaders and force a vote on a congressi…",
    "link": "https://www.memeorandum.com/250908/p92",
    "timestamp": "2025-09-08T18:50:01Z"
  },
  {
    "title": "JUST IN: Dem. North Carolina Governor Finally Breaks Silence on Iryna Zarutska Light Rail Murder – Post Gets Brutal Community Note After he Tries to Blame Understaffing of Police for Repeat Offender who was Repeatedly Released",
    "description": "Democrat North Carolina Governor Josh Stein broke his deafening silence on the senseless and unprovoked murder of 23-year-old Ukrainian refugee Iryna Zarutska by 34-year-old Decarlos Brown Jr. on the Charlotte light rail. After posting his statement on X and …",
    "link": "https://freerepublic.com/focus/f-news/4339215/posts",
    "timestamp": "2025-09-08T18:47:36Z"
  },
  {
    "title": "JUST IN: Dem. North Carolina Governor Finally Breaks Silence on Iryna Zarutska Light Rail Murder – Post Gets Brutal Community Note After he Tries to Blame Understaffing of Police for Repeat Offender who was Repeatedly Released",
    "description": "Democrat North Carolina Governor Josh Stein broke his deafening silence on the senseless and unprovoked murder of 23-year-old Ukrainian refugee Iryna Zarutska by 34-year-old Decarlos Brown Jr. on the Charlotte light rail. After posting his statement on X and …",
    "link": "https://freerepublic.com/focus/f-bloggers/4339215/posts",
    "timestamp": "2025-09-08T18:47:36Z"
  },
  {
    "title": "SpaceX expands Starlink satellite network with $17bn EchoStar deal",
    "description": "The spectrum purchase allows SpaceX to expand the cell network's capacity and help 'end mobile dead zones'.",
    "link": "https://www.aljazeera.com/economy/2025/9/8/spacex-expands-starlink-satellite-network-with-17bn-echostar-deal",
    "timestamp": "2025-09-08T18:47:32Z"
  },
  {
    "title": "‘Do You Think This Is Funny?’: CNN Host Seems Triggered By Trump Meme In Interview With Former ICE Head",
    "description": "Brianna Keilar repeatedly asked Jonathan Fahey about the appropriateness of the meme Donald Trump posted hinting at a federal immigration crackdown in Chicago.",
    "link": "https://dailycaller.com/2025/09/08/cnn-host-asks-former-ice-director-if-trump-meme-is-funny/",
    "timestamp": "2025-09-08T18:47:22Z"
  },
  {
    "title": "The dark secret behind China's military display as deflation eats it from within",
    "description": "While the world's two largest economies are in a battle, there's a possible silver lining for Australia.",
    "link": "https://www.abc.net.au/news/2025-09-09/xi-and-trump-with-trouble-at-home-going-head-to-head/105749856",
    "timestamp": "2025-09-08T18:45:06Z"
  },
  {
    "title": "Missouri Senator Urges Trump to Award Medal of Freedom to Conservative Stalwart Buchanan",
    "description": "Sen. Eric Schmitt, R-Mo., has written to President Donald Trump expressing support for awarding Pat Buchanan the Presidential Medal of Freedom. Schmitt joins other conservative... Read More\nThe post Missouri Senator Urges Trump to Award Medal of Freedom to Co…",
    "link": "https://www.dailysignal.com/2025/09/08/missouri-senator-urges-trump-award-medal-freedom-conservative-stalwart-buchanan/",
    "timestamp": "2025-09-08T18:45:00Z"
  },
  {
    "title": "Trump Announces New Nationwide Rules for Prayer in Public Schools",
    "description": "President Donald Trump announced on Monday event in D.C., new guidance on religious liberty in schoools is forthcoming.",
    "link": "https://www.westernjournal.com/trump-announces-new-nationwide-rules-prayer-public-schools/",
    "timestamp": "2025-09-08T18:42:00Z"
  },
  {
    "title": "China’s exports weaken in August as contentious US trade tensions persist",
    "description": "China's exports grew last month but at a slower pace than in recent months, the country's customs agency said Monday.",
    "link": "https://fortune.com/2025/09/08/chinas-exports-weaken-august-us-trade-tensions-persist/",
    "timestamp": "2025-09-08T18:40:32Z"
  },
  {
    "title": "Supreme Court allows immigration operations to resume in LA",
    "description": "The nation’s highest court delivered a significant win for the Trump administration’s immigration enforcement efforts on Monday, allowing federal agents to resume widespread operations throughout Los Angeles. The Supreme Court’s conservative majority removed …",
    "link": "https://rollingout.com/2025/09/08/supreme-court-allows-immigration-operations-to-resume-in-la/",
    "timestamp": "2025-09-08T18:39:23Z"
  },
  {
    "title": "Trial opens for man accused of plot to shoot Donald Trump on a Florida golf course last year",
    "description": "Routh was arrested on 15 September after a Secret Service agent saw the barrel of a rifle poking from the bushes on the perimeter a golf course where Trump was playing a round.",
    "link": "https://www.thejournal.ie/trial-opens-man-accused-of-plot-to-shoot-donald-trump-6811124-Sep2025/",
    "timestamp": "2025-09-08T18:39:16Z"
  },
  {
    "title": "Why the Food Industry and the Left Really Hate MAHA Ambassador RFK Jr.",
    "description": "Of all Donald Trump’s cabinet picks, it’s Robert F. Kennedy Jr. who attracts the most vitriol, which is saying something. You could see just how much the Health and Human Services secretary is despised last week at a Senate committee hearing when Democrat aft…",
    "link": "https://freerepublic.com/focus/f-news/4339211/posts",
    "timestamp": "2025-09-08T18:37:36Z"
  },
  {
    "title": "Tech Insider Reveals Why Trump and Musk Are Back…",
    "description": "James Altucher’s presentation reveals how Trump’s executive actions and Elon Musk’s AI mothership could ignite the most transformative wave of technology in modern history. James Altucher’s presentation reveals how Trump’s executive actions and Elon Musk’s AI…",
    "link": "https://www.globenewswire.com/news-release/2025/09/08/3146388/0/en/Tech-Insider-Reveals-Why-Trump-and-Musk-Are-Back.html",
    "timestamp": "2025-09-08T18:37:00Z"
  },
  {
    "title": "‘The Double Tax’ on Black Women Workers Threatens Black Homeownership",
    "description": "As Black women's employment has fallen so has the Black homeownership rate. Learn how ‘The Double Tax’ is driving these trends.",
    "link": "https://www.forbes.com/sites/darylfairweather/2025/09/08/the-double-tax-on-black-women-workers-threatens-black-homeownership/",
    "timestamp": "2025-09-08T18:34:18Z"
  },
  {
    "title": "WATCH: ‘Nancy Pelosi’ complains she can no longer get insider information for her investments",
    "description": "Trump reposts artificial intelligence version of ex-House Speaker's tirade, 'It hasn't been easy OK'",
    "link": "https://www.wnd.com/2025/09/watch-nancy-pelosi-complains-she-can-no-longer/",
    "timestamp": "2025-09-08T18:34:14Z"
  },
  {
    "title": "CoinShares Launches SPAC as Crypto Hits US ‘Inflection Point’",
    "description": "Sweden-listed cryptocurrency asset manager CoinShares is preparing to go public in the U.S. The company announced Monday (Sept. 8) that it had entered into a special purpose acquisition company (SPAC) agreement that will see CoinShares list on the Nasdaq, val…",
    "link": "http://www.pymnts.com/cryptocurrency/2025/coinshares-launches-spac-as-crypto-hits-us-inflection-point/",
    "timestamp": "2025-09-08T18:34:11Z"
  },
  {
    "title": "Trump's is building a $5 billion fleet of kamikaze robot boats to unleash 'hell' on enemies... but they keep going rogue",
    "description": "As a tugboat captain pulled an unmanned U.S. military drone boat out of Naval Base Ventura County in California recently, there seemed little danger. But then, the robot vessel suddenly turned itself on, zoomed forward and bashed into the vessel towing it, ca…",
    "link": "https://freerepublic.com/focus/f-chat/4339208/posts",
    "timestamp": "2025-09-08T18:32:58Z"
  },
  {
    "title": "Poll: Americans Are Buying Way Less Thanks to Trump’s Tariffs",
    "description": "Four in 10 Americans say that they’re buying less thanks to President Donald Trump’s tariffs, according to a new poll from CBS.Support for the tariffs has fallen steadily since June, when 41 percent of those surveyed opposed them. In July, that number fell to…",
    "link": "https://newrepublic.com/post/200144/poll-americans-buying-less-trump-tariffs",
    "timestamp": "2025-09-08T18:32:36Z"
  },
  {
    "title": "Nvidia's Huang joining Trump on UK state visit next week",
    "description": "OpenAI's Sam Altman, Blackstone CEO Steven Schwartzman, and BlackRock CEO Larry Fink will also be attending, according to Sky News.",
    "link": "https://www.cnbc.com/2025/09/08/nvidia-huang-trump-uk-state-visit.html",
    "timestamp": "2025-09-08T18:32:32Z"
  },
  {
    "title": "Another Gift to Trump: Supreme Court Lifts Lower Court Ban on 'Blatant Racial Profiling' by ICE Agents",
    "description": "The US Supreme Court on Monday gave its approval for federal immigration agents to stop and detain anyone in the Los Angeles area based on factors including \"the type of work one does,\" a person's use of Spanish or accented English, or their \"apparent race or…",
    "link": "https://www.commondreams.org/news/supreme-court-ice",
    "timestamp": "2025-09-08T18:30:40Z"
  },
  {
    "title": "Women Confront GOP Attacks in Statehouses and Demand Transparency in Congress",
    "description": "As Texas escalates its war on women, survivors of Jeffrey Epstein take the fight to Congress.\nThere is a simple truth at the core of the current Republican agenda, and our current moment: It is unsafe to be a woman in today’s America. And that situation is by…",
    "link": "https://msmagazine.com/2025/09/08/texas-abortion-pills-republicans-trump-epstein-files-congress/",
    "timestamp": "2025-09-08T18:30:32Z"
  },
  {
    "title": "‘Free Speech’ University in Austin Makes Freshmen Read Palantir CEO’s Deep Thoughts",
    "description": "Sad things are happening in the state of Texas.",
    "link": "https://gizmodo.com/free-speech-university-in-austin-makes-freshman-read-palantir-ceos-deep-thoughts-2000654777",
    "timestamp": "2025-09-08T18:30:04Z"
  },
  {
    "title": "Trump's Oval Office Bling Exposed as 'Knockoff' $60 Plastic Sprayed Gold From Home Depot",
    "description": "Donald Trump is a fan of all things tacky, and it appears he has once again stayed true to himself with his new Oval Office redesign.",
    "link": "https://radaronline.com/p/trump-oval-office-bling-exposed-plastic-gold-home-depot/",
    "timestamp": "2025-09-08T18:30:00Z"
  },
  {
    "title": "‘The Late Show with Stephen Colbert’ Wins Its First Sympathy Emmy",
    "description": "Colbert’s ‘Late Show’ took home the first Emmy in its 10-year existence post-cancellation",
    "link": "https://www.cracked.com/article_48219_the-late-show-with-stephen-colbert-wins-its-first-sympathy-emmy.html",
    "timestamp": "2025-09-08T18:30:00Z"
  },
  {
    "title": "Trump quietly gives JD Vance a tiny sliver of his fundraising ahead of 2028 election",
    "description": "President Donald Trump has given his vice president a portion of his impressive fundraising haul, but it represents only pennies on the dollar.NBC News reported Monday that Trump’s fundraising emails and donation buttons on his official site ask donors to con…",
    "link": "https://www.rawstory.com/jd-vance-2673970162/",
    "timestamp": "2025-09-08T18:29:52Z"
  },
  {
    "title": "US Supreme Court allows Trump’s controversial immigration raids to continue",
    "description": "Decision effectively allows immigration agents to use racial profiling to detain people, greenlighting sweeping raids.",
    "link": "https://www.aljazeera.com/news/2025/9/8/us-supreme-court-allows-trumps-controversial-immigration-raids-to-continue",
    "timestamp": "2025-09-08T18:28:36Z"
  },
  {
    "title": "Top Pentagon officials visit Puerto Rico as tensions with Venezuela soar",
    "description": "WASHINGTON (Reuters) -Defense Secretary Pete Hegseth and the top U.S. general Dan Caine made a surprise visit to Puerto Rico on Monday, the first trip by...",
    "link": "https://www.yahoo.com/news/articles/top-pentagon-officials-visit-puerto-182813334.html",
    "timestamp": "2025-09-08T18:28:13Z"
  },
  {
    "title": "What Is ICE Doing With This Israeli Spyware Firm?",
    "description": "The Department of Homeland Security restored a $2 million contract with Paragon, maker of the surveillance tool Graphite, despite earlier civil liberties concerns.",
    "link": "https://reason.com/2025/09/08/what-is-ice-doing-with-this-israeli-spyware-firm/",
    "timestamp": "2025-09-08T18:28:06Z"
  },
  {
    "title": "Race, Crime and Media Bias Collide on a Charlotte Light Rail Train",
    "description": "Many have questioned why the horrific murder of a Ukrainian refugee at the hands of a repeat offender hasn't received wider coverage from mainstream outlets.",
    "link": "https://www.newsweek.com/media-race-charlotte-stabbing-iryna-zarutska-decarlos-brown-2126498",
    "timestamp": "2025-09-08T18:26:32Z"
  },
  {
    "title": "Bureaucrat Who Touted Efforts to ‘Empower’ ‘LGBTI Activists’ Still Has Policymaking Role at State Department Under Trump",
    "description": "A career bureaucrat who celebrated how the State Department would “empower” “LGBTI activists” in other countries remains in a senior leadership role at State under... Read More\nThe post Bureaucrat Who Touted Efforts to ‘Empower’ ‘LGBTI Activists’ Still Has Po…",
    "link": "https://www.dailysignal.com/2025/09/08/bureaucrat-who-touted-efforts-empower-lgbti-activists-still-has-policy-making-role-state-under-trump/",
    "timestamp": "2025-09-08T18:26:00Z"
  },
  {
    "title": "Crockett: Trump Administration Protects 'Pedophiles,' 'Criminals'",
    "description": "Sunday on MSNBC’s “Alex Witt Reports,” Rep. Jasmine Crockett (D-TX) said President Donald Trump’s administration was protecting pedophiles and criminals. Witt said, “So the Justice Department asked a federal judge overseeing the case to deny request from NBC …",
    "link": "https://www.breitbart.com/clips/2025/09/08/crockett-trump-administration-protects-pedophiles-criminals/",
    "timestamp": "2025-09-08T18:24:51Z"
  },
  {
    "title": "The Return of the Kirkpatrick Doctrine",
    "description": "In August 1981, US Ambassador to the United Nations Jeane Kirkpatrick traveled to Santiago to meet with Chilean dictator Augusto Pinochet, eight years after he seized power in a military coup. Kirkpatrick cheeringly described their talk as “most pleasant\r\n” a…",
    "link": "https://www.commondreams.org/opinion/trump-latin-america-imperialism",
    "timestamp": "2025-09-08T18:22:38Z"
  },
  {
    "title": "Republicans Blocking Discharge Resolution To Force Release Of Epstein Documents",
    "description": "The discharge petition from Republican Kentucky Rep. Thomas Massie and Democrat California Rep. Ro Khanna has 215 signatures, three short of the majority.",
    "link": "https://dailycaller.com/2025/09/08/thomas-massie-ro-khanna-jeffrey-epstein-files-doj-house-oversight/",
    "timestamp": "2025-09-08T18:20:54Z"
  },
  {
    "title": "'I'm nobody's justice!' Amy Coney Barrett insists she's not in Trump's pocket",
    "description": "Supreme Court Justice Amy Coney Barrett pushed back on claims that she’d become \"President Donald Trump’s justice,\" and instead characterized herself as being “nobody’s justice” in a recent interview with USA Today published Monday.\"I'm nobody's justice,” she…",
    "link": "https://www.rawstory.com/amy-coney-barrett-2673970951/",
    "timestamp": "2025-09-08T18:20:39Z"
  },
  {
    "title": "'You have been warned, leave now,' Netanyahu tells Gaza city residents as attacks intensify",
    "description": "One resident said, ‘Israel destroys everything – even the memories. If they could, they would strip the very oxygen from the air.’",
    "link": "https://www.thejournal.ie/netanyahu-tells-gaza-residents-to-leave-attacks-intensify-6811097-Sep2025/",
    "timestamp": "2025-09-08T18:20:17Z"
  },
  {
    "title": "Why is it hard to find a job right now? Experts weigh in",
    "description": "Worker confidence in the ability to find a job has hit a record low.",
    "link": "https://abcnews.go.com/Business/hard-find-job-now-experts-weigh/story?id=125357979",
    "timestamp": "2025-09-08T18:20:00Z"
  },
  {
    "title": "$83M verdict stands: Appeals court slams Trump’s attacks on E. Jean Carroll as ‘extraordinary and egregious’",
    "description": "A federal appeals court on Monday upheld a civil jury’s finding that President Donald Trump must pay $83.3 million to E. Jean Carroll for his repeated social media attacks and public statements against the longtime advice columnist after she accused him of se…",
    "link": "https://biztoc.com/x/8e93e90d02a2273f",
    "timestamp": "2025-09-08T18:17:46Z"
  },
  {
    "title": "Johnson says he didn't use 'right terminology' in calling Trump an Epstein 'informant'",
    "description": "Speaker Mike Johnson on Monday revised his claim last week that President Donald Trump was an \"FBI informant\" in the Jeffrey Epstein case, telling reporters Monday that he possibly didn't use the \"right terminology.\" \n\"What I was referring to in that long con…",
    "link": "https://biztoc.com/x/2a3d903f7e84a55f",
    "timestamp": "2025-09-08T18:17:28Z"
  },
  {
    "title": "The capitulation of the US media is not an aberration",
    "description": "President Donald Trump's administration is bringing to the fore weaknesses that have long plagued US democracy.",
    "link": "https://www.aljazeera.com/opinions/2025/9/8/the-capitulation-of-the-us-media-is-not-an-aberration",
    "timestamp": "2025-09-08T18:15:40Z"
  },
  {
    "title": "$83M verdict stands: Appeals court slams Trump’s attacks on E. Jean Carroll as ‘extraordinary and egregious’",
    "description": "A federal appeals court on Monday upheld a civil jury's finding that President Donald Trump must pay $83.3 million to E. Jean Carroll.",
    "link": "https://fortune.com/2025/09/08/https-fortune-com-2025-09-08-appeals-court-upholds-ejean-carroll-83m-defamation-verdict-vs-trump/",
    "timestamp": "2025-09-08T18:15:12Z"
  },
  {
    "title": "Trump Says He Will Sanction Russia After Putin Launches Largest Air Attack of the War",
    "description": "President Donald Trump said he was ready to sanction Russia after Moscow launched its largest air attack against Ukraine since the start of the war on Sunday, setting Kyiv’s government headquarters on fire and killing at least five, including one infant.Forty…",
    "link": "https://freerepublic.com/focus/f-news/4339206/posts",
    "timestamp": "2025-09-08T18:14:57Z"
  },
  {
    "title": "US Chief Justice Lets Trump Oust FTC Commissioner For Now",
    "description": "US Chief Justice John Roberts let President Donald Trump temporarily oust a Democratic member of the Federal Trade Commission, signaling that the Supreme Court is likely to back Trump’s bid to assert control over the independent agency. Rebecca Kelly Slaughte…",
    "link": "https://www.ndtvprofit.com/world/us-chief-justice-lets-trump-oust-ftc-commissioner-for-now",
    "timestamp": "2025-09-08T18:13:06Z"
  },
  {
    "title": "What will happen if the US Supreme Court blocks Trump's tariffs - all scenarios explained",
    "description": "Trump tariffs Supreme Court: Donald Trump seeks Supreme Court intervention on his authority to impose tariffs. An appeals court rejected his use of the IEEPA law for this purpose. Trump's team anticipates a favorable Supreme Court ruling. Alternative legal av…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-will-happen-if-the-us-supreme-court-blocks-trumps-tariffs-all-scenarios-explained/articleshow/123768948.cms",
    "timestamp": "2025-09-08T18:12:44Z"
  },
  {
    "title": "'We'd love to go into Chicago,' Trump says after controversy over 'war' meme",
    "description": "President Donald Trump on Monday continued to take aim at Chicago as the city braces for expected federal intervention.",
    "link": "https://abcnews.go.com/Politics/wed-love-chicago-trump-after-controversy-war-meme/story?id=125365999",
    "timestamp": "2025-09-08T18:11:17Z"
  },
  {
    "title": "Secret Service Spent $11 Million on Hunter Biden Travel Detail",
    "description": "THE CENTER SQUARE—The Biden administration spent more than $10 million over three years on a security detail and related expenses for former First Son Hunter... Read More\nThe post Secret Service Spent $11 Million on Hunter Biden Travel Detail appeared first o…",
    "link": "https://www.dailysignal.com/2025/09/08/secret-service-spent-11-million-on-hunter-biden-travel-detail/",
    "timestamp": "2025-09-08T18:11:13Z"
  },
  {
    "title": "JUST IN: Supreme Court Hands Trump Two Big Wins Via Emergency Ruling",
    "description": "The Trump Administration scored two big legal wins Monday, including the Supreme Court allowing ICE to resume \"roving\" immigration arrests in California\nThe post JUST IN: Supreme Court Hands Trump Two Big Wins Via Emergency Ruling first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/just-in-supreme-court-hands-trump-two-big-wins-via-emergency-ruling/",
    "timestamp": "2025-09-08T18:11:08Z"
  },
  {
    "title": "Trump Suggests Domestic Violence Isn’t Really A Crime And Critics Pounce",
    "description": "Considering that homicide by an abusive partner is the leading cause of death among pregnant and postpartum women in the U.S., it's no wonder that people were outraged.",
    "link": "https://www.huffpost.com/entry/critics-shocked-at-trumps-domestic-violence-crime-comment_n_68bf048fe4b055a5037b9638",
    "timestamp": "2025-09-08T18:09:23Z"
  },
  {
    "title": "SCOTUS Allows Trump Firing Of Ex-Schumer Aide From FTC — For Now",
    "description": "The Supreme Court on Monday moved to allow President Donald Trump to fire a Democratic member of the FTC after the commissioner sued over her dismissal.",
    "link": "https://dailycaller.com/2025/09/08/scotus-allows-trump-firing-of-ex-schumer-aide-from-ftc-for-now/",
    "timestamp": "2025-09-08T18:08:47Z"
  }
]