[
  {
    "title": "Our NY Post Op-Ed: Trump makes academia face the damning truth about foreign students",
    "description": "\"Are American graduate schools still American?\"\nThe post Our NY Post Op-Ed: Trump makes academia face the damning truth about foreign students first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/our-ny-post-op-ed-trump-makes-academia-face-the-damning-truth-about-foreign-students/",
    "timestamp": "2025-07-27T23:30:23Z"
  },
  {
    "title": "U.S., China to resume tariff talks in effort to extend truce",
    "description": "China is facing an Aug. 12 deadline to strike a durable tariff agreement with the Trump administration, after Beijing and Washington reached a preliminary deal in June.",
    "link": "https://www.japantimes.co.jp/business/2025/07/28/us-china-tariff-talks-truce/",
    "timestamp": "2025-07-27T23:28:00Z"
  },
  {
    "title": "Lutnick: U.S. to release result of probe into chip imports in two weeks",
    "description": "The Trump administration will announce the results of a national security probe into imports of semiconductors in two weeks, Commerce Secretary Howard Lutnick said on Sunday, as President Donald Trump suggested higher tariffs were on the horizon.\nLutnick told…",
    "link": "https://biztoc.com/x/e14e7f1ce775e4b9",
    "timestamp": "2025-07-27T23:23:46Z"
  },
  {
    "title": "EU and US agree trade deal, with 15% tariffs for European exports to America",
    "description": "SUMMARY: * The United States and European Union have reached a trade deal which will see a blanket tariff of 15% on all EU goods imported to the US. * President Trump says the EU has promised hundreds of billions of dollars of investment and energy purchases.…",
    "link": "https://freerepublic.com/focus/f-news/4331117/posts",
    "timestamp": "2025-07-27T23:22:34Z"
  },
  {
    "title": "Wilders to Macron: Create New Palestinian State in Southern France -- 'Happy Suicide!’",
    "description": "Dutch right-wing leader Geert Wilders delivered a fierce rebuke to French President Emmanuel Macron's decision to recognize a Palestinian state, sarcastically suggesting that southern France could become the new Palestinian state while declaring \"Good luck Em…",
    "link": "https://www.breitbart.com/politics/2025/07/27/wilders-to-macron-create-new-palestinian-state-in-southern-france-happy-suicide/",
    "timestamp": "2025-07-27T23:18:04Z"
  },
  {
    "title": "Room for one more on Mount Rushmore? (Trump wants to know.) | Honolulu Star-Advertiser",
    "description": "President Donald Trump has made no secret of his fondness for Mount Rushmore and his desire to join its rock-star lineup.",
    "link": "https://www.staradvertiser.com/2025/07/27/breaking-news/room-for-one-more-on-mount-rushmore-trump-wants-to-know/",
    "timestamp": "2025-07-27T23:15:03Z"
  },
  {
    "title": "Hulk Hogan’s death evokes polarizing viewpoints",
    "description": "Terry “Hulk Hogan” Bollea passed away on Thursday, July 24, 2025. Arguably, he had the most success as a pro wrestler in the modern time to crossover into mainstream pop culture. Too bad the character was not the same as the person. As many people found out l…",
    "link": "https://mmapayout.com/2025/07/27/hulk-hogans-death-evokes-polarizing-viewpoints/",
    "timestamp": "2025-07-27T23:13:11Z"
  },
  {
    "title": "'Hold On': Lindsey Graham Busted On Live TV For Trying To 'Distract From Epstein'",
    "description": "NBC host Kristen Welker called out Sen. Lindsey Graham (R-SC) for attempting to \"rewrite history\" on Russia's interference in the 2016 election \"to distract from the Epstein matter.\"\n\n\nDuring a Sunday interview on Meet the Press, Graham called for a special c…",
    "link": "https://crooksandliars.com/2025/07/hold-lindsey-graham-busted-live-tv-trying",
    "timestamp": "2025-07-27T23:11:17Z"
  },
  {
    "title": "US-EU deal sets a 15% tariff on most goods and averts the threat of a trade war with a global shock",
    "description": "US-EU deal sets a 15% tariff on most goods and averts the threat of a trade war with a global shockwsbtv.com",
    "link": "https://www.wsbtv.com/news/us-eu-deal-sets-15/M6AMIBEJBZDX3HE4AVBZJOAK6Y/",
    "timestamp": "2025-07-27T23:10:39Z"
  },
  {
    "title": "Tariffs aren't good news but it could have been worse",
    "description": "While the crucial EU-US trade deal announced this weekend does bring certainty for businesses, there are significant drawbacks.",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0728/1525620-tariffs-negative-trade/",
    "timestamp": "2025-07-27T23:10:01Z"
  },
  {
    "title": "Tariffs aren't good news but it could have been worse",
    "description": "While the crucial EU-US trade deal announced this weekend does bring certainty for businesses, there are significant drawbacks.",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0728/1525620-tariffs-trade-analysis/",
    "timestamp": "2025-07-27T23:10:01Z"
  },
  {
    "title": "Israel announces daily pauses in Gaza fighting as aid airdrops begin",
    "description": "Israel on Sunday announced a halt in military operations for 10 hours a day in parts of Gaza and new aid corridors as Jordan and the United Arab Emirates airdropped supplies into the enclave, where images of starving Palestinians have alarmed the world. Israe…",
    "link": "https://japantoday.com/category/world/israel-announces-daily-pauses-in-gaza-fighting-as-aid-airdrops-begin3",
    "timestamp": "2025-07-27T23:00:51Z"
  },
  {
    "title": "Johnson Blasts Massie and Khanna’s ‘Reckless’ Epstein File Discharge Petition",
    "description": "House Speaker Mike Johnson stated during an interview on “Meet the Press” Sunday that House Republicans are working to release all “credible” information on the... Read More\nThe post Johnson Blasts Massie and Khanna’s ‘Reckless’ Epstein File Discharge Petitio…",
    "link": "https://www.dailysignal.com/2025/07/27/mike-johnson-emphasizes-transparency/",
    "timestamp": "2025-07-27T23:00:00Z"
  },
  {
    "title": "Is FIFA moving World Cup games from US to Canada over Trump's immigration policies?",
    "description": "Eleven stadiums across the United States are scheduled to host most of the 2026 tournament's matches.",
    "link": "https://www.snopes.com//news/2025/07/27/trump-canada-world-cup-fifa/",
    "timestamp": "2025-07-27T23:00:00Z"
  },
  {
    "title": "Trade deal includes ‘zero for zero’ arrangement for aviation, says Simon Harris",
    "description": "Minister tells trade forum that EU-US agreement gives ‘certainty for Irish, European and American businesses’",
    "link": "https://www.irishtimes.com/ireland/2025/07/27/trade-deal-includes-zero-for-zero-arrangement-for-aviation-says-simon-harris/",
    "timestamp": "2025-07-27T22:58:34Z"
  },
  {
    "title": "‘I’m going to bomb the plane!’ Watch man on flight to Scotland threaten Trump with death while president is in Scotland",
    "description": "'He was fighting a bit on the floor, but at this point, he knew he'd f***ed up'",
    "link": "https://www.wnd.com/2025/07/im-going-bomb-plane-watch-man-flight-scotland/",
    "timestamp": "2025-07-27T22:53:46Z"
  },
  {
    "title": "For Millions, Health Bills Are About To Get Bigger Thanks to Trump",
    "description": "President Donald Trump rode to reelection last fall on voter concerns about prices. But as his administration pares back federal rules and programs designed to protect patients from the high cost of health care, Trump risks pushing more Americans into debt, f…",
    "link": "https://flaglerlive.com/relief-denied/",
    "timestamp": "2025-07-27T22:50:46Z"
  },
  {
    "title": "Islamic State-Backed Rebels Attack Catholic Church in Congo, Nearly Three Dozen Dead",
    "description": "The death toll has risen to at least 34 people in a savage attack by Islamic State-backed rebels on a Catholic church in the eastern Congo on Sunday, according to a local leader.\nThe post Islamic State-Backed Rebels Attack Catholic Church in Congo, Nearly Thr…",
    "link": "https://www.breitbart.com/africa/2025/07/27/rebels-attack-catholic-church-in-congo-nearly-three-dozen-dead/",
    "timestamp": "2025-07-27T22:48:03Z"
  },
  {
    "title": "China Pushes Creation of World AI Cooperation Effort",
    "description": "China has proposed creating an organization to promote global artificial intelligence (AI) cooperation. [contact-form-7] The country wants to help guide worldwide efforts to regulate AI and share China’s own innovations, said Premier Li Qiang, whose remarks a…",
    "link": "http://www.pymnts.com/artificial-intelligence-2/2025/china-pushes-creation-of-world-ai-cooperation-effort/",
    "timestamp": "2025-07-27T22:47:18Z"
  },
  {
    "title": "'Pattern of dishonesty': Economist slams Trump's 'shifting rationale' on tariffs",
    "description": "President Donald Trump is not being honest with Americans about his trade policies, according to one economist. Trump has sought to reshape global trade by imposing significant tariffs on America's trading partners, such as South Korea and Japan. Some experts…",
    "link": "https://www.rawstory.com/trump-tariffs-2673768835/",
    "timestamp": "2025-07-27T22:43:28Z"
  },
  {
    "title": "'US exceptionalism roars back' as markets defy doomsayers and draw record foreign inflows after panic over Trump tariffs",
    "description": "Foreign investors returned to U.S. stocks and bonds in force in May, just a month after retreating in the wake of President Donald Trump’s unexpectedly aggressive tariffs. New data show record net inflows, as the highest tariff rates were on hold to allow bre…",
    "link": "https://biztoc.com/x/660f154d35e0b301",
    "timestamp": "2025-07-27T22:39:36Z"
  },
  {
    "title": "EU reaches broad tariff deal with U.S. to avert painful trade blow",
    "description": "The U.S. and European Union agreed on a hard-fought deal that will see the bloc face 15% tariffs on most of its exports, including automobiles.",
    "link": "https://www.japantimes.co.jp/business/2025/07/28/economy/eu-us-tariff-deal/",
    "timestamp": "2025-07-27T22:30:00Z"
  },
  {
    "title": "‘That’s Why I Made the Referrals’: Trump CIA Chief Drops Bomb – Brennan, Comey and Hillary Clinton Could Face Indictment",
    "description": "\"These people really did conspire to run a hoax,\" said CIA's Ratcliffe, telling Fox he'll make public new evidence of the alleged crimes for the first time.\nThe post ‘That’s Why I Made the Referrals’: Trump CIA Chief Drops Bomb – Brennan, Comey and Hillary Cl…",
    "link": "https://www.mediaite.com/politics/thats-why-i-made-the-referrals-trump-cia-chief-drops-bomb-brennan-comey-and-hillary-clinton-could-face-indictment/",
    "timestamp": "2025-07-27T22:29:06Z"
  },
  {
    "title": "Trump announces deal with E.U. imposing 15% tariffs, averting trade war",
    "description": "The U.S. and the European Union have agreed to a trade framework that will result in 15% tariffs on most imported European goods, President Donald Trump announced Sunday. The deal comes a week before Trump’s Aug. 1 deadline, averting an all-out trade war betw…",
    "link": "https://biztoc.com/x/7bc2c59bf0b51223",
    "timestamp": "2025-07-27T22:28:10Z"
  },
  {
    "title": "Trump’s Tariffs Are Already Stunting World Growth",
    "description": "“As Donald Trump barrels toward his latest tariff deadline, the damage to the global economy from American protectionism is becoming increasingly evident, even if financial markets seem to have decided they can live with it,”",
    "link": "https://politicalwire.com/2025/07/27/trumps-tariffs-are-already-stunting-world-growth/",
    "timestamp": "2025-07-27T22:25:42Z"
  },
  {
    "title": "US-EU trade deal wards off further escalation but will raise costs for companies and consumers",
    "description": "U.S. President Donald Trump and European Commission President Ursula von der Leyen have announced a sweeping trade deal.",
    "link": "https://www.news4jax.com/business/2025/07/27/us-eu-trade-deal-wards-off-further-escalation-but-will-raise-costs-for-companies-consumers/",
    "timestamp": "2025-07-27T22:24:56Z"
  },
  {
    "title": "US-EU trade deal wards off further escalation but will raise costs for companies, consumers",
    "description": "President Donald Trump and European Commission President Ursula von der Leyen have announced a sweeping trade deal that imposes 15% tariffs on most European ...",
    "link": "https://finance.yahoo.com/news/us-eu-trade-deal-wards-222456913.html",
    "timestamp": "2025-07-27T22:24:56Z"
  },
  {
    "title": "Trump Demands Beyoncé Be Prosecuted",
    "description": "The Wrap: “Donald Trump hit out at Beyoncé, Oprah, and Al Sharpton on Sunday, insisting without evidence that they were paid millions of dollars to endorse Kamala Harris ahead of the 2024 election — allegations",
    "link": "https://politicalwire.com/2025/07/27/trump-demands-beyonce-be-prosecuted/",
    "timestamp": "2025-07-27T22:24:33Z"
  },
  {
    "title": "The Democrats are heading for a mid-terms triumph. It’s the last thing they need",
    "description": "The first rule of understanding Donald Trump is to never write him off. It’s no exaggeration to say he’s the most remarkable comeback kid of my lifetime: every time his political fate seems to be sealed, he always pulls back from disaster in the 11th hour. I …",
    "link": "https://freerepublic.com/focus/f-chat/4331110/posts",
    "timestamp": "2025-07-27T22:23:39Z"
  },
  {
    "title": "Houthis threaten: We will target all shipping linked to Israel, regardless of flag",
    "description": "Houthi rebels announce plans to strike any vessel tied to Israeli ports, citing Gaza’s humanitarian crisis.",
    "link": "https://www.israelnationalnews.com/news/412340",
    "timestamp": "2025-07-27T22:21:04Z"
  },
  {
    "title": "I Asked Star Trek’s Robert Picardo If Skydance Merger Will Impact Starfleet Academy, And He Gave An A+ Answer",
    "description": "He was the perfect person to ask.",
    "link": "https://www.cinemablend.com/interviews/star-trek-robert-picardo-reveals-if-skydance-merger-will-impact-starfleet-academy",
    "timestamp": "2025-07-27T22:21:00Z"
  },
  {
    "title": "Hulk Hogan's son, Nick, shares touching tribute to his 'hero' following wrestling legend's death",
    "description": "Wrestling legend Hulk Hogan, who recently passed away at 71, was remembered by his son, Nick, in a heartfelt Instagram post featuring 20 photos and memories of their time together.",
    "link": "https://www.foxnews.com/sports/hulk-hogans-son-nick-shares-touching-tribute-his-hero-following-wrestling-legends-death",
    "timestamp": "2025-07-27T22:20:25Z"
  },
  {
    "title": "Horror Hit ’28 Years Later’ New On Streaming This Week, Report Says",
    "description": "Aaron Taylor-Johnson, Jodi Comer and Ralph Fiennes’ \"28 Years Later\" is reportedly coming to digital streaming this week. Find out when and where you can stream the movie at home.",
    "link": "https://www.forbes.com/sites/timlammers/2025/07/27/horror-hit-28-years-later-new-on-streaming-this-week-report-says/",
    "timestamp": "2025-07-27T22:17:41Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "President Donald Trump on Sunday announced a trade agreement with the European Union that would set tariffs at 15%, ending what had been months of uncertainty surrounding trade with the United States’ largest trade partner",
    "link": "https://biztoc.com/x/98b9d22d33a193db",
    "timestamp": "2025-07-27T22:16:57Z"
  },
  {
    "title": "Good riddance to UNESCO — a hate-America shouting gallery",
    "description": "This UN agency has plagued the United States for decades with its blame-America-first outlook.",
    "link": "https://nypost.com/2025/07/27/opinion/us-out-of-unesco-finally/",
    "timestamp": "2025-07-27T22:16:23Z"
  },
  {
    "title": "US, EU reach trade pact with 15% tariff cap, averting global economic jolt",
    "description": "US, EU agree to 15% tariffs on most goods, avoiding a 30% trade war. EU to invest $600 bn in US and buy $750 bn in energy over 3 years. Zero tariffs for key sectors.",
    "link": "https://www.thehindubusinessline.com/news/world/us-eu-reach-trade-pact-with-15-tariff-cap-averting-global-economic-jolt/article69863146.ece",
    "timestamp": "2025-07-27T22:11:55Z"
  },
  {
    "title": "Trump's Tariffs Are Already Stunting World Growth While Markets Shrug (Shawn Donnan/Bloomberg)",
    "description": "Shawn Donnan / Bloomberg:\nTrump's Tariffs Are Already Stunting World Growth While Markets Shrug  —  With the president's new trade deals, US protectionism is slowing investment and rewiring supply chains at the expense of the global economy  —  As Donald Trum…",
    "link": "https://www.memeorandum.com/250727/p53",
    "timestamp": "2025-07-27T22:10:00Z"
  },
  {
    "title": "Thai, Cambodian leaders set for peace talks nudged by Trump",
    "description": "The conflict, which escalated from months of simmering border tension, has killed more than 30 people and displaced over 150,000 civilians on both sides.",
    "link": "https://www.japantimes.co.jp/news/2025/07/28/asia-pacific/politics/thai-cambodia-peace-talks-trump/",
    "timestamp": "2025-07-27T22:10:00Z"
  },
  {
    "title": "Donald Trump Repeats False Claim Beyoncé Was Paid $11 Million To Endorse Kamala Harris; Calls To Prosecute Singer, Oprah & Al Sharpton",
    "description": "On Saturday, Donald Trump repeated false claims that Beyoncé was paid $11 million to endorse Kamala Harris on the campaign trail in October of last year. The Truth Social post comes as the president faces scrutiny from his own base over the release of the Jef…",
    "link": "http://deadline.com/2025/07/trump-beyonce-kamala-harris-endorsement-payment-1236471764/",
    "timestamp": "2025-07-27T22:08:18Z"
  },
  {
    "title": "Stock futures: U.S.-EU trade deal kicks off busy week: Live updates",
    "description": "Wall Street is coming off a winning week fueled by strong earnings and recent deals between the U.S. and its trading partners.",
    "link": "https://www.cnbc.com/2025/07/27/stock-market-today-live-updates.html",
    "timestamp": "2025-07-27T22:08:00Z"
  },
  {
    "title": "Muslim Brotherhood’s ‘grand jihad’ is growing— just over the US border",
    "description": "Brotherhood-affiliated organizations, often posing as benign religious or charitable entities, have proliferated in Canada, spreading radical Islamist ideology without repercussion.",
    "link": "https://nypost.com/2025/07/27/opinion/muslim-brotherhoods-grand-jihad-grows-north-of-the-border/",
    "timestamp": "2025-07-27T22:07:43Z"
  },
  {
    "title": "US, EU reach preliminary trade deal, Trump announces",
    "description": "The US and European Union reached a preliminary trade deal, President Donald Trump announced Sunday, averting a punishing tariff war.\nThe US will tax European goods, including automobiles, at a rate of 15%, while US exports to the bloc won’t face any duties, …",
    "link": "https://biztoc.com/x/04e44aa06a35bd18",
    "timestamp": "2025-07-27T22:06:12Z"
  },
  {
    "title": "Prepare your fainting couches as ethics watchdogs have found that Trump has been more corrupt regarding his private business opportunities in his second term so far than in his first [Obvious]",
    "description": "Prepare your fainting couches as ethics watchdogs have found that Trump has been more corrupt regarding his private business opportunities in his second term so far than in his first",
    "link": "https://www.fark.com/comments/13755752/Prepare-your-fainting-couches-as-ethics-watchdogs-have-found-that-Trump-has-been-more-corrupt-regarding-his-private-business-opportunities-in-his-second-term-so-far-than-in-his-first",
    "timestamp": "2025-07-27T22:05:03Z"
  },
  {
    "title": "'Daily Show' co-creator sounds off on cancellation of Colbert's show, accuses CBS of being 'afraid'",
    "description": "The co-creator of \"The Daily Show,\" Lizz Winstead, accused CBS of canceling liberal comedian Stephen Colbert's show due to fear of President Trump during an MSNBC interview.",
    "link": "https://www.foxnews.com/media/daily-show-co-creator-sounds-off-cbs-canceling-colbert-accuses-cbs-being-afraid",
    "timestamp": "2025-07-27T22:00:53Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "President Donald Trump on Sunday announced a trade agreement with the European Union that would set tariffs at 15%, ending what had been months of uncertainty surrounding trade with the United States’ largest trade partner",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-july-27-rcna220969",
    "timestamp": "2025-07-27T22:00:42Z"
  },
  {
    "title": "CIA director teases more files on alleged Russiagate links to Hillary: ‘Finally coming to light’",
    "description": "CIA Director John Ratcliffe on Sunday teased plans to publicly disclose additional files that allegedly help tie Hillary Clinton to the false claims of Russian interference in the 2016 presidential election.",
    "link": "https://nypost.com/2025/07/27/us-news/cia-director-teases-more-files-tying-russiagate-to-hillary-clinton/",
    "timestamp": "2025-07-27T21:51:41Z"
  },
  {
    "title": "US and EU agree on 15 percent tariffs to avert trade war",
    "description": "US president and his EU counterpart strike sweeping 15 percent tariff deal to stabilise transatlantic trade.",
    "link": "https://www.aljazeera.com/economy/2025/7/27/us-and-eu-agree-on-trade-tariffs-to-avert-economic-standoff",
    "timestamp": "2025-07-27T21:49:36Z"
  },
  {
    "title": "Why high fructose corn syrup, stevia are used in beverages",
    "description": "Trump teased the announcement, then Coca-Cola Co. confirmed it: a cane sugar-sweetened version of the beverage maker's trademark soda will be released in the U.S. this fall.",
    "link": "https://billingsgazette.com/life-entertainment/nation-world/wellness/article_4d8ff642-dce1-5867-b958-aea6c008e30a.html",
    "timestamp": "2025-07-27T21:48:13Z"
  },
  {
    "title": "U.S. Fed poised to hold off on rate cuts, defying Trump pressure",
    "description": "The U.S. central bank is widely expected to hold off slashing interest rates again at its upcoming meeting, as officials gather under the cloud of an intensifying pressure campaign by President Donald Trump. Policymakers at the independent Federal Reserve hav…",
    "link": "https://japantoday.com/category/business/us-fed-poised-to-hold-off-on-rate-cuts-defying-trump-pressure",
    "timestamp": "2025-07-27T21:41:32Z"
  },
  {
    "title": "What we know so far about the EU-US trade deal",
    "description": "EU chief Ursula von der Leyen clinched an agreement Sunday with US President Donald Trump to avoid crippling tariffs from hitting the bloc, with both leaders hailing a &quot;good deal&quot;. The stakes were high with a looming August 1 deadline and $1.9 trill…",
    "link": "https://japantoday.com/category/world/what-we-know-so-far-about-the-eu-us-trade-deal",
    "timestamp": "2025-07-27T21:36:34Z"
  },
  {
    "title": "Le Pen calls US, EU trade agreement a 'fiasco'",
    "description": "French politician Marine Le Pen called the trade agreement made by United States President Donald Trump and European Commission President Ursula von der Leyen a \"political, economic, and moral fiasco....",
    "link": "https://biztoc.com/x/37814432daeeafdc",
    "timestamp": "2025-07-27T21:32:23Z"
  },
  {
    "title": "Prime Minister to meet President Trump for wide ranging talks in Scotland",
    "description": "The Prime Minister will travel to Scotland today to meet the President for talks.",
    "link": "https://www.gov.uk/government/news/prime-minister-to-meet-president-trump-for-wide-ranging-talks-in-scotland",
    "timestamp": "2025-07-27T21:30:03Z"
  },
  {
    "title": "Starmer set for Trump trade talks as PM walks diplomatic line between EU allies and US on Gaza",
    "description": "Gaza and transatlantic trade are set to dominate talks between Donald Trump and Sir Keir Starmer when the pair meet in Scotland on Monday.",
    "link": "https://news.sky.com/story/sir-keir-starmer-set-for-donald-trump-trade-talks-as-pm-walks-diplomatic-line-between-eu-allies-and-us-on-gaza-13402794",
    "timestamp": "2025-07-27T21:30:00Z"
  },
  {
    "title": "Trump Voters Wanted Relief From Medical Bills — For Millions, the Bills Are About To Get Bigger",
    "description": "Ten million people are expected to lose health insurance coverage by 2034.",
    "link": "https://www.yahoo.com/news/articles/trump-voters-wanted-relief-medical-212911878.html",
    "timestamp": "2025-07-27T21:29:11Z"
  },
  {
    "title": "College Sports Is in Peril. President Trump and Republicans Are Trying to Save It.",
    "description": "Last week, President Donald Trump announced an executive order protecting college sports. This is an important step to end the pernicious assault on the industry by... Read More\nThe post College Sports Is in Peril. President Trump and Republicans Are Trying t…",
    "link": "https://www.dailysignal.com/2025/07/27/college-sports-are-in-peril-president-trump-and-republicans-are-trying-to-save-it/",
    "timestamp": "2025-07-27T21:29:00Z"
  },
  {
    "title": "Live: US and EU seal trade deal, Wall St has fifth record close, ASX response looks muted",
    "description": "The US and EU have agreed to deal that imposes a 15 per cent tariff on European imports, while the S&P 500 has hit its fifth record close in five days. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2025-07-28/asx-markets-business-news-live-updates-july-28/105578954",
    "timestamp": "2025-07-27T21:25:15Z"
  },
  {
    "title": "Both sides can claim victory in US-EU tariff deal, but devil may be in detail",
    "description": "This deal shows how serious President Trump is about renegotiating America's trading relationship with the rest of the world.",
    "link": "https://www.bbc.com/news/articles/czxpdv5x54ko",
    "timestamp": "2025-07-27T21:24:38Z"
  },
  {
    "title": "Ex-MSNBC host Chris Matthews says ‘country is moving towards Trump’ — refuting recent polls",
    "description": "\"[Former President Barack] Obama still has tremendous charisma — but Trump has strength,'' liberal former MSNBC host Chris Matthews said.",
    "link": "https://nypost.com/2025/07/27/us-news/ex-msnbc-host-chris-matthews-says-country-is-moving-towards-trump-refuting-recent-polls/",
    "timestamp": "2025-07-27T21:22:52Z"
  },
  {
    "title": "Donald Trump Announces 15% Tariff Trade Agreement With EU, Ending Months Of Trade Uncertainty",
    "description": "President Donald Trump has declared a 15% tariff trade deal with the European Union (EU), putting an end to several months of trade uncertainty with the U.S.’s biggest trade partner.\nWhat Happened: The tariff rate is a significant drop from the 30% Trump thre…",
    "link": "https://biztoc.com/x/31640af5fd2d2ae4",
    "timestamp": "2025-07-27T21:20:47Z"
  },
  {
    "title": "CIA Director John Ratcliffe to Declassify Explosive Classified Annex of Durham Report in the Coming Weeks",
    "description": "The Deep State is on notice.\nThe post CIA Director John Ratcliffe to Declassify Explosive Classified Annex of Durham Report in the Coming Weeks appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/cia-director-john-ratcliffe-declassify-explosive-classified-annex/",
    "timestamp": "2025-07-27T21:20:12Z"
  },
  {
    "title": "Jake Tapper And Oklahoma Senator Get In Heated Back-And-Forth Over Epstein's 'Sweetheart Deal'",
    "description": "The contentious discussion comes as the handling of files related to the disgraced financier is under renewed scrutiny.",
    "link": "https://www.huffpost.com/entry/jake-tapper-markwayne-mullin-epstein_n_688667ffe4b0fc2998fc446a",
    "timestamp": "2025-07-27T21:19:59Z"
  },
  {
    "title": "Trump created a 'weapon of mass destruction' to distract from his real problems: lawmaker",
    "description": "President Donald Trump appears to have created a new weapon to combat the unfolding Jeffrey Epstein drama, according to a new report. Rep. Jason Crow (D-CO) told Fox News host Shannon Bream on “Fox News Sunday\" that the Director of National Intelligence, Tuls…",
    "link": "https://www.rawstory.com/tulsi-gabbard-2673768768/",
    "timestamp": "2025-07-27T21:15:47Z"
  },
  {
    "title": "Crypto Lending Makes a Comeback With Wave of Short-Term Loans",
    "description": "Three years after the “crypto winter,” digital asset lending is making a comeback. [contact-form-7] That’s according to a report Saturday (July 26) by the Financial Times (FT), which cited the example of San Francisco lender Divine Research. That company said…",
    "link": "http://www.pymnts.com/cryptocurrency/2025/crypto-lending-makes-a-comeback-with-wave-of-short-term-loans/",
    "timestamp": "2025-07-27T21:14:22Z"
  },
  {
    "title": "Schweizer: Former CIA Director Gina Haspel Should Be Investigated",
    "description": "On this week's broadcast of Fox News Channel's \"Sunday Morning Futures,” GAI President Peter Schweizer said former CIA Director Gina Haspel should undergo further investigation regarding the alleged Russia collusion intelligence efforts by former President Ba…",
    "link": "https://www.breitbart.com/clips/2025/07/27/schweizer-former-cia-director-gina-haspel-should-be-investigated/",
    "timestamp": "2025-07-27T21:12:19Z"
  },
  {
    "title": "UK delivers AUKUS reassurance in the face of US review",
    "description": "The UK has thrown its full weight behind the controversial AUKUS program as it seeks to reassure Australia, and the US and EU have struck a tariff deal that avoids the worst of Trump's threats.\nThe post UK delivers AUKUS reassurance in the face of US review a…",
    "link": "http://www.crikey.com.au/2025/07/28/uk-aukus-defence-palestine-state-eu-us-tariffs/",
    "timestamp": "2025-07-27T21:09:53Z"
  },
  {
    "title": "Trump Demands Beyoncé Be Prosecuted Over Discredited Accusation She Was Paid $11 Million to Endorse Kamala Harris",
    "description": "The singer's production company was paid $165,000 to cover costs associated with her appearance at an October 2024 rally\nThe post Trump Demands Beyoncé Be Prosecuted Over Discredited Accusation She Was Paid $11 Million to Endorse Kamala Harris appeared first …",
    "link": "https://www.thewrap.com/trump-beyonce-prosecuted-accusation-paid-endorse-kamala-harris/",
    "timestamp": "2025-07-27T21:04:33Z"
  },
  {
    "title": "2nd LD Writethru: U.S., EU seal trade deal amid concerns over tariff imbalance",
    "description": "LONDON, July 27 (Xinhua) -- U.S. President Donald Trump and European Commission President Ursula von der Leyen claimed Sunday that they had reached a trade deal under which the United States would impose a baseline tariff of 15 percent on European Union (EU) …",
    "link": "https://www.thestar.com.my/news/world/2025/07/28/2nd-ld-writethru-us-eu-seal-trade-deal-amid-concerns-over-tariff-imbalance",
    "timestamp": "2025-07-27T21:03:00Z"
  },
  {
    "title": "Trump Scores Major Win with EU Trade Deal",
    "description": "\"We are agreeing that the tariff straight across for automobiles and everything else will be a straight-across tariff of 15%,\" Trump said.\nThe post Trump Scores Major Win with EU Trade Deal first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/trump-scores-major-win-with-eu-trade-deal/",
    "timestamp": "2025-07-27T21:00:05Z"
  },
  {
    "title": "Lutnick Confirms Tariffs Deadline Will Not Be Extended",
    "description": "Secretary of Commerce Howard Lutnick confirmed on “Fox News Sunday” that there will be no more “grace periods” come the Aug. 1 tariffs deadline. President... Read More\nThe post Lutnick Confirms Tariffs Deadline Will Not Be Extended appeared first on The Daily…",
    "link": "https://www.dailysignal.com/2025/07/27/lutnick-optimistic-about-trump-tariff/",
    "timestamp": "2025-07-27T21:00:00Z"
  },
  {
    "title": "Fox’s Joe Concha Says CBS Should Yank Colbert’s Show Now To ‘Save Face’",
    "description": "Joe Concha said CBS should pull the plug on The Late Show now rather than allow Stephen Colbert to continue hosting until May. \nThe post Fox’s Joe Concha Says CBS Should Yank Colbert’s Show Now To ‘Save Face’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/foxs-joe-concha-says-cbs-should-yank-colberts-show-now-to-save-face/",
    "timestamp": "2025-07-27T20:59:03Z"
  },
  {
    "title": "What We Know So Far About The EU-US Trade Deal",
    "description": "EU chief Ursula von der Leyen clinched an agreement Sunday with US President Donald Trump to avoid crippling tariffs from hitting the bloc, with both leaders hailing a \"good deal\".",
    "link": "https://www.ibtimes.com/what-we-know-so-far-about-eu-us-trade-deal-3779556",
    "timestamp": "2025-07-27T20:57:20Z"
  },
  {
    "title": "Colorado Prof Cheers ‘South Park’ Trump Mockery, Frustrated By Comics Not Doing Same",
    "description": "A Colorado professor says it was “funny as hell” the way \"South Park\" went after President Donald Trump in its Season 27 premiere episode, yet he’s frustrated that more comedians on the left aren’t taking the same approach.",
    "link": "https://www.forbes.com/sites/timlammers/2025/07/27/colorado-prof-cheers-south-park-trump-mockery-frustrated-by-comics-not-doing-same/",
    "timestamp": "2025-07-27T20:56:42Z"
  },
  {
    "title": "Euro gains as investors cautiously welcome US-EU trade deal",
    "description": "European Commission President Ursula von der Leyen said the deal includes \"cars, semiconductors and pharmas.\"",
    "link": "https://www.channelnewsasia.com/world/euro-gains-investors-cautiously-welcome-us-eu-trade-deal-5261616",
    "timestamp": "2025-07-27T20:53:04Z"
  },
  {
    "title": "VIDEO: Democrat Candidate Throws a Fit, Is Removed, Arrested in Texas Hearing",
    "description": "Video emerged over the weekend of a redistricting hearing in the Texas Capitol that resulted in a Democrat congressional candidate being forcibly removed and arrested after he refused to stop talking when his time was up.\nThe post VIDEO: Democrat Candidate Th…",
    "link": "https://www.breitbart.com/politics/2025/07/27/video-candidate-throws-a-fit-is-removed-arrested-in-texas-hearing/",
    "timestamp": "2025-07-27T20:50:55Z"
  },
  {
    "title": "U.S. Deal With EU Sets 15% Tariff On Most Goods, Averting Threat Of Trade War",
    "description": "The deal staves off, at least for now, far higher imports on both sides that might have sent shockwaves through economies around the globe.",
    "link": "https://www.huffpost.com/entry/us-deal-eu-15-percent-tariff-averting-trade-war_n_68868dace4b0034af9e69e80",
    "timestamp": "2025-07-27T20:50:20Z"
  },
  {
    "title": "Stock Investors Expect Rally as Europe Clinches US Trade Deal",
    "description": "Investors expect automakers and luxury goods makers to lead a relief rally in European stocks when the market reopens on Monday, after the US and European Union agreed to a trade deal.",
    "link": "https://financialpost.com/pmn/business-pmn/stock-investors-expect-rally-as-europe-clinches-us-trade-deal",
    "timestamp": "2025-07-27T20:44:53Z"
  },
  {
    "title": "Guess Who’s Paying $10 Million For Trump’s Scotland Junket?",
    "description": "While Donald “Grab ‘em by the pussy” Trump frantically tries to cover up his relationship with sex trafficker Jeffrey Epstein, that’s not stopping the sexual predator in the White House from continuing to grab the U.S. by the wallet.\nTrump and his lickspittle…",
    "link": "https://crooksandliars.com/2025/07/guess-who-s-paying-10-million-trump-s",
    "timestamp": "2025-07-27T20:43:54Z"
  },
  {
    "title": "U.S EU Trade deal: Who wins after tariff agreement - Donald Trump or Europe?",
    "description": "U.S EU Trade deal will provide big boost to President Donald Trump ahead of August 1 tariffs deadline.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-eu-trade-deal-who-wins-after-tariff-agreement-donald-trump-or-europe/articleshow/122940358.cms",
    "timestamp": "2025-07-27T20:38:48Z"
  },
  {
    "title": "The president went on a wild rant about the energy source, claiming wind turbines are a “con job” and drive whales “loco.”",
    "description": "President Donald Trump launched into a wild rant about windmills Sunday, repeating a grab bag of misinformed claims about his least favorite energy source...",
    "link": "https://www.thedailybeast.com/bizarre-moment-donald-trump-declares-windmills-are-killing-us/",
    "timestamp": "2025-07-27T20:36:19Z"
  },
  {
    "title": "WATCH: Trump and von der Leyen announce U.S.-EU trade framework",
    "description": "The United States and the European Union agreed on Sunday to a trade framework setting a 15% tariff on most goods, staving off — at least for now — far higher imports on both sides that might have sent shockwaves through economies around the globe.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-and-von-der-leyen-announce-u-s-eu-trade-framework",
    "timestamp": "2025-07-27T20:35:32Z"
  },
  {
    "title": "Trump Announces EU Trade Deal",
    "description": "U.S. President Donald Trump's administration reached a trade deal with the European Union Sunday in Scotland",
    "link": "https://dailycaller.com/2025/07/27/trump-european-union-trade-deal-15-tariff/",
    "timestamp": "2025-07-27T20:35:23Z"
  },
  {
    "title": "U.S. Reaches Trade Truce With EU, May Extend China Tariff Pause",
    "description": "President Trump and European Commission President Ursula von der Leyen revealed the trade framework from Scotland on Sunday.",
    "link": "http://wwd.com/business-news/government-trade/us-reaches-trade-truce-eu-may-extend-china-tariff-pause-1237996978/",
    "timestamp": "2025-07-27T20:25:51Z"
  },
  {
    "title": "Trump scores another big trade deal after securing promise of massive investment, but China will be less willing to cave, analyst says",
    "description": "President Donald Trump said the EU will invest $600 billion in the U.S., buy $750 billion of American energy products, and purchase “vast amounts” of weapons as part of a trade deal that sets a 15% tariff. It comes a week after a similar agreement with Japan,…",
    "link": "https://biztoc.com/x/dbc1dcda0ae9a302",
    "timestamp": "2025-07-27T20:25:20Z"
  },
  {
    "title": "EU and US agree trade deal, with 15% tariffs for European exports to America",
    "description": "US President Donald Trump and EU chief Ursula von der Leyen confirm the deal after \"tough negotiations\" in Scotland.",
    "link": "https://www.bbc.com/news/articles/cx2xylk3d07o",
    "timestamp": "2025-07-27T20:19:36Z"
  },
  {
    "title": "Oil Prices Caught Between a $70 Summer and Growing Surplus Fears",
    "description": "Oil traders are grappling with a tension — there’s a growing chorus of warnings about the market weakening later this year and into 2026, but for now prices are holding strong near $70 a barrel.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-prices-caught-between-a-70-summer-and-growing-surplus-fears",
    "timestamp": "2025-07-27T20:19:33Z"
  },
  {
    "title": "Rubio downplays 2028 talk, touts Vance as Trump's successor",
    "description": "Secretary of State Marco Rubio said Vice President JD Vance would make a great Republican presidential nominee in 2028.",
    "link": "https://www.foxnews.com/politics/rubio-downplays-rumors-hes-slated-next-republican-presidential-nominee",
    "timestamp": "2025-07-27T20:18:01Z"
  },
  {
    "title": "Azealia Banks Posts & Deletes Tweets Defending Donald Trump Allegedly Sleeping With Underage Girls",
    "description": "Azealia Banks might regret voting for Donald Trump, but still feels that he is catching too much flak for allegedly sleeping with underage girls, as his base continues to push for his administration to release files related to the Jeffrey Epstein case. In wha…",
    "link": "https://hiphopwired.com/playlist/azealia-banks-donald-trump-underage-sex-with-minors-jeffrey-epstein-reactions/",
    "timestamp": "2025-07-27T20:17:37Z"
  },
  {
    "title": "EU-U.S. tariff deal \"unsatisfactory,\" \"imbalanced\": senior EU lawmaker",
    "description": "BRUSSELS, July 27 (Xinhua) -- A senior European lawmaker has sharply criticized a draft trade agreement between the European Union (EU) and the United States, warning that it could undermine the bloc's economic stability and job security. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/28/eu-us-tariff-deal-unsatisfactory-imbalanced-senior-eu-lawmaker",
    "timestamp": "2025-07-27T20:16:00Z"
  },
  {
    "title": "Rep. Ralph Norman announces bid for South Carolina governor",
    "description": "Rep. Ralph Norman, a member of the hard-right Freedom Caucus, announced on Sunday that he is running for governor, looking to succeed GOP Gov. Henry McMaster.",
    "link": "https://www.nbcnews.com/politics/2026-election/ralph-norman-announces-bid-south-carolina-governor-gop-primary-rcna221378",
    "timestamp": "2025-07-27T20:15:21Z"
  },
  {
    "title": "Stock Investors Expect Rally as Europe Clinches US Trade Deal",
    "description": "(Bloomberg) -- Investors expect automakers and luxury goods makers to lead a relief rally in European stocks when the market reopens on Monday, after the US ...",
    "link": "https://finance.yahoo.com/news/stock-investors-expect-rally-europe-201439089.html",
    "timestamp": "2025-07-27T20:14:39Z"
  },
  {
    "title": "'Shoot Illegals': C-SPAN Caller Wants Trump To Go 'A Lot Further' On Immigration",
    "description": "A Massachusetts man called on President Donald Trump to go \"a lot further\" on immigration by shooting undocumented immigrants.\n\n\nDuring Sunday's Washington Journal program on C-SPAN, a man named Ryan called in to urge the president to be tougher on immigratio…",
    "link": "https://crooksandliars.com/2025/07/shoot-illegals-c-span-caller-wants-trump",
    "timestamp": "2025-07-27T20:13:04Z"
  },
  {
    "title": "Did Trump Get Caught Cheating at Golf? Viral Video Blows Up Social Media",
    "description": "And on Sunday, a video made the rounds on social media purporting to show Trump (and his caddy) caught in the act of cheating.\nThe post Did Trump Get Caught Cheating at Golf? Viral Video Blows Up Social Media first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/did-trump-get-caught-cheating-at-golf-viral-video-blows-up-social-media/",
    "timestamp": "2025-07-27T20:10:38Z"
  },
  {
    "title": "Barnaby Joyce wants Australia to abandon net zero – but his 4 central claims don’t stack up",
    "description": "If Australia is to take meaningful climate action, federal parliament must engage with the facts without distortion. Barnaby Joyce obviously didn’t get the memo.",
    "link": "https://theconversation.com/barnaby-joyce-wants-australia-to-abandon-net-zero-but-his-4-central-claims-dont-stack-up-261837",
    "timestamp": "2025-07-27T20:09:29Z"
  },
  {
    "title": "Barnaby Joyce wants Australia to abandon net zero – but his 5 central claims don’t stack up",
    "description": "If Australia is to take meaningful climate action, federal parliament must engage with the facts without distortion. Barnaby Joyce obviously didn’t get the memo.",
    "link": "https://theconversation.com/barnaby-joyce-wants-australia-to-abandon-net-zero-but-his-5-central-claims-dont-stack-up-261837",
    "timestamp": "2025-07-27T20:09:29Z"
  }
]