[
  {
    "title": "Donald Trump Brags About 'Not Easy' Cognitive Tests",
    "description": "Donald Trump Brags About 'Not Easy' Cognitive Testslittlethings.com",
    "link": "https://littlethings.com/entertainment/donald-trump-cognitive-tests-not-easy",
    "timestamp": "2025-12-24T19:43:35Z"
  },
  {
    "title": "Five Times Newt Gingrich Explained Something No One Else Noticed",
    "description": "Newt Gingrich has built a reputation for stepping back from the daily partisan scrum and identifying the strategic mistakes and pressure points others tend to miss.",
    "link": "https://dailycaller.com/2025/12/24/five-times-newt-gingrich-explained/",
    "timestamp": "2025-12-24T19:43:26Z"
  },
  {
    "title": "Nicki Minaj Deactives Her Instagram After Meeting With Erika Kirk Backlash",
    "description": "Nicki Minaj appears to be taking a step back from social media days after making a surprise appearance at Turning Point USA’s AmericaFest. Fans discovered on Wednesday, December 24, that the “Super Bass” rapper had seemingly deactivated her Instagram account.…",
    "link": "https://www.usmagazine.com/celebrity-news/news/nicki-minaj-deactives-her-instagram-after-meeting-with-erika-kirk-backlash/#article",
    "timestamp": "2025-12-24T19:43:20Z"
  },
  {
    "title": "Trump Goes on Tirade Against Stephen Colbert Again: ‘Pathetic Trainwreck’",
    "description": "President Trump went on a tirade against Stephen Colbert and late-night TV before wishing followers a 'Merry Christmas.'",
    "link": "http://www.rollingstone.com/culture/culture-news/trump-stephen-colbert-tirade-cbs-cancel-late-night-tv-1235490368/",
    "timestamp": "2025-12-24T19:40:43Z"
  },
  {
    "title": "Donald Trump in Epstein files: Key names, takeaways from latest release",
    "description": "Epstein files latest: The most concrete new detail is an internal email dated January 7, 2020, in which a New York prosecutor said flight records showed Trump took eight trips on Epstein's private jet between 1993 and 1996 -- more than investigators were awar…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-in-epstein-files-key-names-takeaways-from-latest-release/articleshow/126166170.cms",
    "timestamp": "2025-12-24T19:40:17Z"
  },
  {
    "title": "Trump’s $2,000 tariff dividend warning: Why experts predict grocery bills could rise in US",
    "description": "Trump’s $2,000 tariff dividend impact on grocery prices: President Trump plans a $2,000 tariff dividend for Americans. Economists worry this could raise grocery prices. The plan is still under consideration. Experts suggest increased demand from the payout co…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-2000-tariff-dividend-warning-why-experts-predict-grocery-bills-could-rise-in-us/articleshow/126166130.cms",
    "timestamp": "2025-12-24T19:39:56Z"
  },
  {
    "title": "Read Bari Weiss' new memo that defends pulling a '60 Minutes' segment and says Americans lack trust in the press",
    "description": "CBS News, Bari Weiss, and \"60 Minutes\" are at the center of a debate after a segment on El Salvador's CECOT prison was pulled.",
    "link": "https://www.businessinsider.com/bari-weiss-defends-decision-hold-60-minutes-segment-memo-2025-12",
    "timestamp": "2025-12-24T19:39:32Z"
  },
  {
    "title": "Alito rips Supreme Court majority as 'unwise' for blocking Trump's National Guard plan",
    "description": "Supreme Court temporarily blocks President Trump's National Guard deployment in Chicago as Justice Samuel Alito warns the decision could limit federal protection ability.",
    "link": "https://www.foxnews.com/politics/alito-rips-supreme-court-majority-unwise-blocking-trumps-national-guard-plan",
    "timestamp": "2025-12-24T19:36:52Z"
  },
  {
    "title": "The U.S. Navy under Trump: A Tool of Modern Piracy",
    "description": "The political West has been conducting an unprovoked aggression against the entire world for at least half a millennium at this point. \nWhether through direct attacks and occupation or various forms of colonialism (that lasts to this day), the world’s …\nThe p…",
    "link": "https://www.globalresearch.ca/the-u-s-navy-under-trump-a-tool-of-modern-piracy/5910234",
    "timestamp": "2025-12-24T19:34:34Z"
  },
  {
    "title": "In Trump's Economy, Santa Claus Only Comes for the Billionaires",
    "description": "The Washington Post published an article this week titled A Middle-Class Family’s Only Option: A $43,000 Health Insurance Premium about how the GOP’s refusal to extend ACA/Obamacare subsidies means that Stacy Newton’s family in Jackson Hole, Wyoming will have…",
    "link": "https://www.commondreams.org/opinion/santa-claus-for-billionaires",
    "timestamp": "2025-12-24T19:33:13Z"
  },
  {
    "title": "Rubio Shares How Trump Is ‘President of Peace’ Who Delivered on Promises",
    "description": "Marco Rubio underscored in a White House X post a series of national security, foreign policy, and immigration actions carried out under President Donald Trump’s administration.\nThe post Rubio Shares How Trump Is ‘President of Peace’ Who Delivered on Promises…",
    "link": "https://www.breitbart.com/politics/2025/12/24/rubio-shares-how-trump-is-president-peace-who-delivered-promises/",
    "timestamp": "2025-12-24T19:32:59Z"
  },
  {
    "title": "Officials discover a million more documents potentially related to Epstein case",
    "description": "The US Department of Justice says reviewing the material could delay release by a \"few more weeks\".",
    "link": "https://www.bbc.com/news/articles/czdgz84dn35o",
    "timestamp": "2025-12-24T19:32:22Z"
  },
  {
    "title": "WATCH LIVE: Trump takes part in NORAD Santa Tracker calls",
    "description": "The tradition started in 1955 when NORAD's predecessor, the Continental Air Defense Command, was on the lookout for any sign of a possible nuclear attack from the then-Soviet Union. NORAD says a child mistakenly called the combat operations center and asked t…",
    "link": "https://www.pbs.org/newshour/nation/watch-live-trump-takes-part-in-norad-santa-tracker-calls",
    "timestamp": "2025-12-24T19:31:38Z"
  },
  {
    "title": "Before Executing 2 Shipwrecked Sailors, US Admiral Consulted Top Military Lawyer: Report",
    "description": "The journalist who initially revealed that President Donald Trump's administration killed shipwrecked survivors of its first known boat bombing reported Tuesday that the admiral in charge consulted with a US military lawyer before ordering another strike on t…",
    "link": "https://www.commondreams.org/news/admiral-bradley",
    "timestamp": "2025-12-24T19:29:38Z"
  },
  {
    "title": "Which side is JD Vance taking in MAGA’s infighting?",
    "description": "GOP insiders are battling over antisemitism with an eye on 2028",
    "link": "https://theweek.com/politics/vance-maga-infighting-sides-antisemitism-fuentes-trump-2028",
    "timestamp": "2025-12-24T19:28:08Z"
  },
  {
    "title": "US discovers a million more possible Jeffrey Epstein files",
    "description": "The US Department of Justice says reviewing the material could delay the full release of Epstein documents by a \"few more weeks\".",
    "link": "https://www.bbc.co.uk/news/articles/czdgz84dn35o",
    "timestamp": "2025-12-24T19:22:41Z"
  },
  {
    "title": "US Set to See Largest One-Year Decline in Murders in History: Crime Expert",
    "description": "\"Here at DHS we’ve been operating by this radical idea that removing murderers from our country would bring down the murder rate...\"",
    "link": "https://www.westernjournal.com/us-set-see-largest-one-year-decline-murders-history-crime-expert/",
    "timestamp": "2025-12-24T19:18:36Z"
  },
  {
    "title": "A blast in Gaza wounds a soldier and Israel accuses Hamas of ceasefire violation",
    "description": "An explosive device has detonated in Gaza and wounded one Israeli soldier, prompting Israel to accuse Hamas of violating the U.S.-brokered ceasefire",
    "link": "https://abcnews.go.com/International/wireStory/blast-gaza-wounds-soldier-israel-accuses-hamas-ceasefire-128677005",
    "timestamp": "2025-12-24T19:17:41Z"
  },
  {
    "title": "DOJ says it has found over a million additional documents potentially related to Epstein | CNN Politics",
    "description": "The Justice Department on Wednesday said it has uncovered over a million more documents potentially related to the Jeffrey Epstein case and may need “a few more weeks” to process and release them to the public.",
    "link": "https://www.cnn.com/2025/12/24/politics/epstein-documents-doj-million",
    "timestamp": "2025-12-24T19:13:59Z"
  },
  {
    "title": "Judge blocks Trump effort to strip security clearance from attorney who represented whistleblowers",
    "description": "A federal judge has blocked the Trump administration from enforcing a March presidential memorandum to revoke the security clearance of prominent Washington attorney Mark Zaid, ruling that the order — which also targeted 14 other individuals — could not be ap…",
    "link": "https://www.pbs.org/newshour/politics/judge-blocks-trump-effort-to-strip-security-clearance-from-attorney-who-represented-whistleblowers",
    "timestamp": "2025-12-24T19:13:14Z"
  },
  {
    "title": "Crypto Acquisitions and IPOs Surged in 2025, Driven by Trump Administration Policies",
    "description": "The number and value of acquisitions and initial public offerings (IPOs) in the cryptocurrency sector surged in 2025, driven by the Trump administration’s favorable stance toward the industry. The number of acquisitions saw a year-over-year increase of 18%, r…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/crypto-acquisitions-and-ipos-surged-in-2025-driven-by-trump-administration-policies/",
    "timestamp": "2025-12-24T19:09:54Z"
  },
  {
    "title": "Campus security is in the public eye again after the Brown shooting",
    "description": "Questions surround a federal law called the Clery Act",
    "link": "https://theweek.com/crime/campus-security-brown-university-shooting",
    "timestamp": "2025-12-24T19:06:20Z"
  },
  {
    "title": "Latest Epstein Files Should ‘Take Down’ Trump, Argues Bulwark’s Sarah Longwell",
    "description": "\"The hypocrisy should take them down. The moral nihilism should take it down. The criminal content should take him down.\"\nThe post Latest Epstein Files Should ‘Take Down’ Trump, Argues Bulwark’s Sarah Longwell first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/latest-epstein-files-should-take-down-trump-argues-bulwarks-sarah-longwell/",
    "timestamp": "2025-12-24T19:04:37Z"
  },
  {
    "title": "Trump took Epstein's jet 'many more times than previously reported,' according to assistant US attorney",
    "description": "An email from an assistant U.S. attorney in New York said President Donald Trump had flown on the jet that belonged to late sex offender Jeffrey Epstein \"many more times than previously reported\" and \"on at least eight flights between 1993 and 1996.\"",
    "link": "https://www.snopes.com//fact-check/trump-epstein-jet/",
    "timestamp": "2025-12-24T19:04:00Z"
  },
  {
    "title": "Inside the White House Christmas card tradition – from Coolidge to Trump",
    "description": "The history of the White House Christmas card list is long, unique, with annual messages as unique as the former presidents themselves.",
    "link": "https://www.foxnews.com/politics/inside-white-house-christmas-card-tradition-from-coolidge-trump",
    "timestamp": "2025-12-24T19:00:54Z"
  },
  {
    "title": "Coffee Break: Going Beyond the MSM Name-Calling Narrative at TPUSA",
    "description": "The MSM covered the name-calling at TPUSA, but ignored the MAGA vs MIGA subtext driving the conflict between Ben Shapiro and Tucker Carlson.",
    "link": "https://www.nakedcapitalism.com/2025/12/tpusa-carlson-bannon-megyn-kelly-ben-shapiro-vance-israel.html",
    "timestamp": "2025-12-24T19:00:12Z"
  },
  {
    "title": "US rare earth buyers still see China curbs despite Trump deal",
    "description": "China is still limiting rare earth element supplies needed by the United States for permanent magnet manufacturing. This is happening even after a trade deal was reached in October. While China has increased deliveries of finished magnets, the US industry str…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-rare-earth-buyers-still-see-china-curbs-despite-trump-deal/articleshow/126165566.cms",
    "timestamp": "2025-12-24T18:54:33Z"
  },
  {
    "title": "Refusing To Let Trump Deploy the National Guard in Chicago, SCOTUS Adds a New Wrinkle To the Debate",
    "description": "The justices suggested the president is misinterpreting \"the regular forces,\" a key phrase in the statute on which he is relying.",
    "link": "https://reason.com/2025/12/24/refusing-to-let-trump-deploy-the-national-guard-in-chicago-scotus-adds-a-new-wrinkle-to-the-debate/",
    "timestamp": "2025-12-24T18:53:21Z"
  },
  {
    "title": "Epstein files: Senators call for audit into DOJ's release",
    "description": "A bipartisan group of Senators on Wednesday said the Trump administration violated the law by failing to release the records in full last week.",
    "link": "https://www.cnbc.com/2025/12/24/epstein-files-senators-call-for-audit-into-dojs-release.html",
    "timestamp": "2025-12-24T18:52:32Z"
  },
  {
    "title": "Trump Calls for Early Stephen Colbert Cancellation After Rerun Monologue: ‘Put Him To Sleep’",
    "description": "\"Stephen Colbert is a pathetic trainwreck,\" the president posts on Truth Social after a rerun episode about the Kennedy Center Honors\nThe post Trump Calls for Early Stephen Colbert Cancellation After Rerun Monologue: ‘Put Him To Sleep’ appeared first on TheWr…",
    "link": "https://www.thewrap.com/media-platforms/politics/donald-trump-stephen-colbert-cancellation-kennedy-center/",
    "timestamp": "2025-12-24T18:41:29Z"
  },
  {
    "title": "Most Ukrainians doubt elections would be fair – poll",
    "description": "There is widespread skepticism over the prospect of online voting in Ukraine due to fears of electoral fraud, a recent poll has suggested Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629942-poll-ukrainians-skeptical-online-voting/",
    "timestamp": "2025-12-24T18:41:20Z"
  },
  {
    "title": "Israel accuses Hamas of ceasefire violation as blast in Gaza wounds soldier",
    "description": "Hamas said the blast was caused by an Israeli \"war remnant,\" which Israel's military denied.",
    "link": "https://www.pbs.org/newshour/world/israel-accuses-hamas-of-ceasefire-violation-as-blast-in-gaza-wounds-soldier",
    "timestamp": "2025-12-24T18:39:00Z"
  },
  {
    "title": "Photographer reveals how White House Epstein panic scrambled now-infamous photo shoot",
    "description": "The photographer who illustrated last week's bombshell Vanity Fair profile of President Donald Trump's inner circle revealed that his photo shoot was scrambled by the Jeffrey Epstein scandal.The West Wing profile featured remarkably candid quotes from White H…",
    "link": "https://www.rawstory.com/vanity-fair-photos-wh-epstein-panic/",
    "timestamp": "2025-12-24T18:38:56Z"
  },
  {
    "title": "'Merry Christmas!' Declares Trump Moments After Threat to Destroy Broadcasters Who Air Criticism of Him",
    "description": "President Donald Trump sent out a cheery Christmas greeting early Wednesday morning just three minutes after threatening to shut down US broadcasters if their programs did not provide him with more positive coverage.In a Truth Social post sent out at 12:36 am…",
    "link": "https://www.commondreams.org/news/trump-threatens-broadcast-licenses",
    "timestamp": "2025-12-24T18:38:37Z"
  },
  {
    "title": "US Democrats urge Trump to reverse mass ambassador recalls",
    "description": "WASHINGTON: Democratic senators urged US President Donald Trump on Wednesday (Dec 24) to reverse the recall of nearly 30 career ambassadors, warning the move risks creating a leader",
    "link": "https://www.channelnewsasia.com/world/democrats-urge-trump-reverse-mass-ambassador-recalls-5708471",
    "timestamp": "2025-12-24T18:37:00Z"
  },
  {
    "title": "Trump Admin’s Crime Crackdown Helps Drive Historic Drop In Murders",
    "description": "The Trump administration’s crime initiatives have coincided with a historic, record-setting one-year drop in murders.",
    "link": "https://dailycaller.com/2025/12/24/murder-crime-crackdown-trump-administration-national-guard-washington-dc/",
    "timestamp": "2025-12-24T18:34:37Z"
  },
  {
    "title": "Trump's TV Tantrum: The Don Threatens to Terminate Networks That Don't Praise Him — After Offering to Leave the Presidency to Be a Full-time Host",
    "description": "Donald Trump cited overwhelmingly negative coverage on liberal network news and late night shows as reasons to pull their licenses.",
    "link": "https://radaronline.com/p/donald-trump-threatens-to-terminate-network-fcc-licenses/",
    "timestamp": "2025-12-24T18:30:00Z"
  },
  {
    "title": "Ed Forst sworn in as GSA administrator",
    "description": "Forst was sworn in on Christmas Eve in Florida while on jury duty.",
    "link": "https://www.nextgov.com/people/2025/12/ed-forst-sworn-gsa-administrator/410391/",
    "timestamp": "2025-12-24T18:26:00Z"
  },
  {
    "title": "“What are they hiding?”: Epstein files reveal “10 co-conspirators” investigated by DOJ, FBI",
    "description": "It is not clear what became of the investigation into some of the co-conspirators",
    "link": "https://www.salon.com/2025/12/24/what-are-they-hiding-epstein-files-reveal-10-co-conspirators-investigated-by-doj-fbi/",
    "timestamp": "2025-12-24T18:24:13Z"
  },
  {
    "title": "Top Republicans worry GOP will 'be cooked' if Mike Lindell wins nomination for governor",
    "description": "President Donald Trump's rhetoric and MyPillow CEO Mike Lindell's campaign for governor in Minnesota are testing Republicans' optimism in the state.\"We should be able to beat Tim Walz with a dog,\" House GOP Whip Tom Emmer (R-MN) told Politico recently.But man…",
    "link": "https://www.rawstory.com/mike-lindell-worries-republicans/",
    "timestamp": "2025-12-24T18:22:13Z"
  },
  {
    "title": "EXCLUSIVE: 17,500 illegal immigrants arrested under Laken Riley Act in Trump's second term (Fox News)",
    "description": "Fox News:\nEXCLUSIVE: 17,500 illegal immigrants arrested under Laken Riley Act in Trump's second term  —  EXCLUSIVE: More than 17,500 illegal immigrants in 2025 have been arrested for crimes requiring mandatory detention under the Laken Riley Act — the first l…",
    "link": "https://www.memeorandum.com/251224/p46",
    "timestamp": "2025-12-24T18:20:01Z"
  },
  {
    "title": "Israel says it will respond to Hamas 'violation' of Gaza truce, Hamas denies responsibility",
    "description": "Prime Minister Benjamin Netanyahu said on Wednesday that Israel would retaliate after a military officer was wounded by a blast in  Gaza , while Hamas denied responsibility, suggesting the explosive device had been left over from the conflict.",
    "link": "https://www.cbc.ca/news/world/gaza-israel-hamas-truce-9.7027660",
    "timestamp": "2025-12-24T18:17:28Z"
  },
  {
    "title": "CNN’s Dana Bash Reveals Betting Favorite to Win Democratic Nomination in 2028",
    "description": "CNN's Dana Bash led her panel discussion Wednesday to try to determine who had the best chance of securing the 2028 Democratic nomination for president.\nThe post CNN’s Dana Bash Reveals Betting Favorite to Win Democratic Nomination in 2028 first appeared on M…",
    "link": "https://www.mediaite.com/media/news/cnns-dana-bash-reveals-betting-favorite-to-win-democratic-nomination-in-2028/",
    "timestamp": "2025-12-24T18:16:42Z"
  },
  {
    "title": "As Gambling Apps Grow, Bettors are Slated to Owe More in Taxes This Year",
    "description": "Hope that 20-leg parlay was worth it.",
    "link": "https://gizmodo.com/as-gambling-apps-grow-bettors-are-slated-to-owe-more-in-taxes-this-year-2000703073",
    "timestamp": "2025-12-24T18:15:03Z"
  },
  {
    "title": "Democratic board member muted during Kennedy Center vote sues to remove Trump's name",
    "description": "US Representative Joyce Beatty, who says she was muted when the board voted to add Trump's name, argues the renaming is illegal.",
    "link": "https://www.bbc.com/news/articles/c79x0x7v70go",
    "timestamp": "2025-12-24T18:11:10Z"
  },
  {
    "title": "Whiskey Brands Are Declaring Bankruptcy As Industry Shifts",
    "description": "The latest whiskey company to announce bankruptcy was A.M. Scott Distillery in Ohio, adding to a growing number.",
    "link": "https://hiphopwired.com/2970743/whiskey-brands-are-declaring-bankruptcy-as-industry-shifts/",
    "timestamp": "2025-12-24T18:10:50Z"
  },
  {
    "title": "Sydney Sweeney’s Friends Encouraging Her To Stop Leaning On Her Physical Gifts, ‘Sad’ To See How Reliant She Is On Them: Source",
    "description": "After 2025 saw the actress wade into the culture wars due to her “controversial” American Eagle jeans campaign, those close to Sydney Sweeney are reportedly encouraging her to reshape her image as being less of a sex symbol and more of an actress. Despite sta…",
    "link": "https://brobible.com/culture/article/sydney-sweeney-friends-move-beyond-presenting-as-body/",
    "timestamp": "2025-12-24T18:10:44Z"
  },
  {
    "title": "Federal Judge Rules Against U.S. Department of Education, Orders Restoration of Mental Health Grants Following Multi-State Lawsuit - NewsBreak",
    "description": "Federal Judge Rules Against U.S. Department of Education, Orders Restoration of Mental Health Grants Following Multi-State Lawsuit - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4411028827886-federal-judge-rules-against-u-s-department-of-education-orders-restoration-of-mental-health-grants-following-multi-state-lawsuit?s=a2&amp;share_destination_id=MzUzNjc0MDM3LTE3NjY1OTk2MTE2MjY%3D&amp;pd=0Nvylxld&amp;hl=en_US&amp;send_time=1766599611&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.51.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-24T18:08:00Z"
  },
  {
    "title": "Zelensky Says Ukraine Open to Demilitarized Economic Free Zone With Russia",
    "description": "Ukrainian President Volodymyr Zelenskyy told reporters that he would be willing to withdraw troops from the country's eastern industrial heartland as part of a plan to end Russia's war, if Moscow also pulls back and the area becomes a demilitarized, free econ…",
    "link": "https://www.breitbart.com/europe/2025/12/24/zelensky-says-ukraine-open-to-demilitarized-economic-free-zone-with-russia/",
    "timestamp": "2025-12-24T18:01:39Z"
  },
  {
    "title": "Africa’s Year in Review",
    "description": "How the region responded to Trump—and more—in 2025.",
    "link": "http://foreignpolicy.com/2025/12/24/africa-year-review-trump-trade-protests-elections/",
    "timestamp": "2025-12-24T18:00:44Z"
  },
  {
    "title": "Golfweek Wrapped 2025 (LPGA): Emma Talley's retirement leads way",
    "description": "The year 2025 was an exciting one for the LPGA, which saw the addition of a new commissioner and a number of first-time winners on tour.",
    "link": "https://golfweek.usatoday.com/story/sports/golf/lpga/2025/12/24/golfweek-wrapped-2025-lpga-emma-talley-retirement/87907980007/",
    "timestamp": "2025-12-24T18:00:34Z"
  },
  {
    "title": "Why Has Comedy Become So Right-Wing?",
    "description": "The Atlantic’s Helen Lewis on the Riyadh Comedy Festival, why comedians are attracted to conspiracy theories, and the rise of the right-wing comedy podcast-industrial complex. Plus: the importance of NATO and David’s reflections on Edith Wharton’s Autres Temp…",
    "link": "https://www.theatlantic.com/podcasts/2025/12/david-frum-show-helen-lewis-comedy/685409/",
    "timestamp": "2025-12-24T18:00:00Z"
  },
  {
    "title": "From Jackie Kennedy’s ‘Nutcracker Suite’ Tree To Mr. T In A Santa Costume, See 33 Vintage Photos Of White House Christmases",
    "description": "These historic photos capture the holiday spirit of the White House — and show how Christmas celebrations there have changed over the years.\nThe post From Jackie Kennedy’s ‘Nutcracker Suite’ Tree To Mr. T In A Santa Costume, See 33 Vintage Photos Of White Hou…",
    "link": "https://allthatsinteresting.com/white-house-christmases",
    "timestamp": "2025-12-24T18:00:00Z"
  },
  {
    "title": "Here’s How Many Times Dems Sued To Stop Trump Education Agenda In Just One Year",
    "description": "Schools, teachers unions and state leaders have attempted to halt the Trump administration's education agenda at every opportunity.",
    "link": "https://dailycaller.com/2025/12/24/heres-how-many-times-dems-sued-to-stop-trump-education-agenda-in-just-one-year/",
    "timestamp": "2025-12-24T17:59:24Z"
  },
  {
    "title": "U.S. unemployment claims dropped again last week, remaining at a historically healthy level",
    "description": "U.S. applications for jobless claims for the week ending Dec. 20 fell by 10,000 to 214,000 from the previous week's 224,000, the Labor Department reported Wednesday.",
    "link": "https://www.pbs.org/newshour/economy/u-s-unemployment-claims-dropped-again-last-week-remaining-at-a-historically-healthy-level",
    "timestamp": "2025-12-24T17:57:09Z"
  },
  {
    "title": "Nicki Minaj Deactivates Instagram After Appearing With Erika Kirk",
    "description": "Nicki Minaj is stepping back from social media following her recent guest appearance at Turning Point USA’s AmericaFest.",
    "link": "http://www.billboard.com/music/music-news/nicki-minaj-deactivates-instagram-erika-kirk-americafest-1236145534/",
    "timestamp": "2025-12-24T17:51:56Z"
  },
  {
    "title": "Israel says it will respond to Hamas ‘violation’ of Gaza truce, Hamas denies responsibility",
    "description": "JERUSALEM: Israel will retaliate against Hamas for what it says are violations of the Gaza ceasefire, Prime Minister Benjamin Netanyahu said on Wednesday (Dec 24), after an Israeli military officer was wounded by",
    "link": "https://www.channelnewsasia.com/world/israel-says-it-will-respond-hamas-violation-gaza-truce-hamas-denies-responsibility-5708441",
    "timestamp": "2025-12-24T17:48:37Z"
  },
  {
    "title": "Stop Defending Bari Weiss",
    "description": "It is impossible to take her actions at face value given the context in which she is operating.",
    "link": "https://www.theatlantic.com/ideas/2025/12/bari-weiss-cecot-60-minutes/685450/",
    "timestamp": "2025-12-24T17:48:08Z"
  },
  {
    "title": "Justice Department Humiliated as People Find the Epstein Files Can Easily Be Un-Redacted",
    "description": "If you know how to copy-paste, congratulations: you have the tools to topple the Deep State.\nThe post Justice Department Humiliated as People Find the Epstein Files Can Easily Be Un-Redacted appeared first on Futurism.",
    "link": "http://futurism.com/future-society/eptein-files-easily-unredacted",
    "timestamp": "2025-12-24T17:48:02Z"
  },
  {
    "title": "Supreme Court rules on legality of Trump National Guard deployment to Illinois",
    "description": "The Supreme Court rejected the Trump administration's request to allow the president to proceed with immediately deploying National Guard troops to Chicago — delivering a blow, if temporary, to President Donald Trump as he seeks to expand his federalization p…",
    "link": "https://freerepublic.com/focus/f-news/4358862/posts",
    "timestamp": "2025-12-24T17:47:57Z"
  },
  {
    "title": "Ukraine and US agree new peace plan after Moscow hit by another deadly bombing",
    "description": "The plan also includes robust security guarantees for Ukraine, EU membership, and that the country would be able to keep its army at 800,000 personnel.",
    "link": "https://news.sky.com/story/ukraine-and-us-agree-updated-20-point-peace-plan-after-moscow-hit-by-another-deadly-bombing-13487290",
    "timestamp": "2025-12-24T17:47:00Z"
  },
  {
    "title": "Venezuela's Air Network Reduced to Around 20 Aging Aircraft Amid U.S. Campaign: Report",
    "description": "Passenger traffic has fallen sharply from about 15,000 passengers flying in and out each week to between 1,000 and 2,000 since the latest suspensions",
    "link": "https://www.ibtimes.com/venezuelas-air-network-reduced-around-20-aging-aircraft-amid-us-campaign-report-3793683",
    "timestamp": "2025-12-24T17:46:34Z"
  },
  {
    "title": "'Stressed' Trump Appears 'Worn Down' At Kennedy Honours After Beatty Lawsuit",
    "description": "Amid the scrutiny he faced after attending the Kennedy Centre Honours, observers claim that Donald Trump appears 'stressed' and 'worn down' during the event.",
    "link": "https://www.ibtimes.com/stressed-trump-appears-worn-down-kennedy-honours-after-beatty-lawsuit-3793676",
    "timestamp": "2025-12-24T17:45:02Z"
  },
  {
    "title": "Trump Calls Stephen Colbert a 'Dead Man Walking' and Urges CBS to 'Put Him to Sleep'",
    "description": "Donald Trump has launched a fresh attack on Stephen Colbert, calling the late-night host a 'dead man walking' and urging CBS to 'put him to sleep'. The comments come as Trump renews threats against major US networks over what he claims is consistently negativ…",
    "link": "https://www.ibtimes.com/trump-calls-stephen-colbert-dead-man-walking-urges-cbs-put-him-sleep-3793672",
    "timestamp": "2025-12-24T17:42:44Z"
  },
  {
    "title": "Obama’s former top economic advisor says he feels ‘a tiny bit bad’ for Trump because gas prices are low, but consumer confidence is still plummeting",
    "description": "“Consumers are just in this, whatever the highest price is, is the price they're going to focus on,” Harvard professor Jason Furman said.",
    "link": "https://finance.yahoo.com/news/obama-former-top-economic-advisor-173904661.html",
    "timestamp": "2025-12-24T17:39:04Z"
  },
  {
    "title": "Obama’s former top economic advisor says he feels ‘a tiny bit bad’ for Trump because gas prices are low, but consumer confidence is still plummeting",
    "description": "“Consumers are just in this, whatever the highest price is, is the price they're going to focus on,” Harvard professor Jason Furman said.",
    "link": "https://fortune.com/2025/12/24/obama-former-top-economic-advisor-jason-furman-trump-affordabilty-gas-prices/",
    "timestamp": "2025-12-24T17:39:04Z"
  },
  {
    "title": "Newly released Epstein file links Trump to murdered newborn baby dumped in Lake Michigan",
    "description": "Donald Trump's name appears on a newly released Epstein file in which a purported victim makes allegations about a newborn baby being murdered and dumped in Lake Michigan.The Justice Department released this file ahead of Christmas Eve in which an unnamed ind…",
    "link": "https://www.rawstory.com/trump-epstein-files-2674827578/",
    "timestamp": "2025-12-24T17:38:15Z"
  },
  {
    "title": "US uses visa bans to aid tech companies",
    "description": "It has long been the case, probably since the end World War II which saw the emergence of the US as the dominant world power largely unscathed by the destruction that had been wrought in Europe, that the US saw itself as the one true power and that other nati…",
    "link": "https://freethoughtblogs.com/singham/2025/12/24/us-uses-visa-bans-to-aid-tech-companies/",
    "timestamp": "2025-12-24T17:37:11Z"
  },
  {
    "title": "MAGA Legislators Want To Add Mercenaries To Trump’s Perverse Take On The ‘War On Drugs’",
    "description": "Yeah, the economy sucks and trade-war tariff agendas are only making things worse. But as Trump promised/threatened during a recent national address from the White House, things are turning around, even if you (MAGA voters especially) are too stupid to see it…",
    "link": "https://www.techdirt.com/2025/12/24/maga-legislators-want-to-add-mercenaries-to-trumps-perverse-take-on-the-war-on-drugs/",
    "timestamp": "2025-12-24T17:36:44Z"
  },
  {
    "title": "Suspect in national guard shooting faces new federal charges that allow death penalty discussions",
    "description": "A man accused of shooting two National Guard troops near the White House has been charged in a complaint with federal firearms charges in connection with the ambush on November 26 that fatally wounded one of the West Virginia National Guard members and seriou…",
    "link": "https://www.pbs.org/newshour/nation/suspect-in-national-guard-shooting-faces-new-federal-charges-that-allow-death-penalty-discussions",
    "timestamp": "2025-12-24T17:36:00Z"
  },
  {
    "title": "Diddy Destroys Judge for 'Draconian' Sentence in New Appeal After Disgraced Rapper Is Sent to Rot Behind Bars for 4 Years",
    "description": "Sean 'Diddy' Combs' legal team filed a new appeal, this time attacking the judge for a 'draconian' sentence.",
    "link": "https://radaronline.com/p/sean-diddy-combs-new-appeal-attacks-judge/",
    "timestamp": "2025-12-24T17:33:42Z"
  },
  {
    "title": "Judge upholds N.Y.'s Green Light Law, rejecting a Trump administration challenge",
    "description": "A federal judge gave a green light Tuesday to New York's so-called Green Light Law, rejecting the Trump administration's bid to stop the state from giving people driver's licenses without having them prove they are in the country legally. U.S. District Judge …",
    "link": "https://freerepublic.com/focus/f-news/4358860/posts",
    "timestamp": "2025-12-24T17:32:49Z"
  },
  {
    "title": "Trump Revamps Controversial H-1B Outsourcing Program",
    "description": "President Donald Trump's revamp of the H-1B white-collar outsourcing program has prompted cautious approval from advocates for American professionals and college graduates.\nThe post Trump Revamps Controversial H-1B Outsourcing Program appeared first on Breitb…",
    "link": "https://www.breitbart.com/economy/2025/12/24/trump-revamps-controversial-h-1b-outsourcing-program/",
    "timestamp": "2025-12-24T17:29:07Z"
  },
  {
    "title": "Gas prices crash below $2 in 9 states — Trump says it beats a tax cut. Is yours one of them?",
    "description": "US gas prices today: President Trump is celebrating falling gas prices in some parts of the country, a prediction he made earlier this year. While some stations have dipped below $2 per gallon, national averages remain closer to $3. Analysts attribute the pri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gas-prices-crash-below-2-in-9-states-trump-says-it-beats-a-tax-cut-is-yours-one-of-them/articleshow/126162778.cms",
    "timestamp": "2025-12-24T17:26:29Z"
  },
  {
    "title": "It's 'been a battle' for Canada's hemp industry, Alberta processor says",
    "description": "Industrial hemp has been commercially cultivated in Canada since 1998 — two decades before the legalization of recreational cannabis use — but data suggests recent years haven't been too kind to the industry. That includes hemp processing in Alberta, where mo…",
    "link": "https://www.cbc.ca/news/canada/calgary/canada-industrial-hemp-cannabis-9.7015067",
    "timestamp": "2025-12-24T17:25:59Z"
  },
  {
    "title": "‘They Have Just Whiffed’: CNN Reports Team Trump Is Frustrated by DOJ’s Handling of the Epstein Files",
    "description": "CNN's Kevin Liptak reported on Wednesday that the Trump White House has been frustrated by the Department of Justice's handling of the Epstein files.\nThe post ‘They Have Just Whiffed’: CNN Reports Team Trump Is Frustrated by DOJ’s Handling of the Epstein File…",
    "link": "https://www.mediaite.com/media/tv/they-have-just-whiffed-cnn-reports-team-trump-is-frustrated-by-dojs-handling-of-the-epstein-files/",
    "timestamp": "2025-12-24T17:25:15Z"
  },
  {
    "title": "Trump says “Humbug” to Colbert, threatens broadcast licenses",
    "description": "The president threatened broadcast licenses in an early Christmas Eve post.",
    "link": "https://www.salon.com/2025/12/24/trump-says-humbug-to-colbert-threatens-broadcast-licenses/",
    "timestamp": "2025-12-24T17:24:51Z"
  },
  {
    "title": "Trump order halts offshore wind projects for at least 90 days",
    "description": "The Trump administration has directed five large-scale wind projects under construction off the East Coast to suspend their activities.",
    "link": "https://www.boston.com/news/local-news/2025/12/24/trump-order-halts-offshore-wind-projects-for-at-least-90-days/",
    "timestamp": "2025-12-24T17:13:18Z"
  },
  {
    "title": "Zelenskyy says he's open to withdrawing troops and creating a free economic zone in Ukraine's east",
    "description": "The proposal marks the clearest indication yet of the compromises the Ukrainian leader would be willing to make on the Donbas region, control of which is a major sticking point in peace negotiations.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-says-hes-open-to-withdrawing-troops-and-creating-a-free-economic-zone-in-ukraines-east",
    "timestamp": "2025-12-24T17:13:16Z"
  },
  {
    "title": "SEC to Investigate Role of Alleged Activist Insiders in Corporate Voting",
    "description": "The left-wing environmental, social, and governance movement, which only a few years ago was deeply embedded in corporate America, is now facing an assault on... Read More\nThe post SEC to Investigate Role of Alleged Activist Insiders in Corporate Voting appea…",
    "link": "https://www.dailysignal.com/2025/12/24/sec-to-investigate-role-alleged-activist-insiders-in-corporate-voting/",
    "timestamp": "2025-12-24T17:10:00Z"
  },
  {
    "title": "EU, France, Germany slam US visa bans as 'censorship' dispute deepens",
    "description": "The European Union, France, and Germany have strongly condemned U.S. visa bans targeting European citizens. These individuals are involved in combating online hate and disinformation. The U.S. administration accuses them of censoring free speech and unfairly …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-france-germany-slam-us-visa-bans-as-censorship-dispute-deepens/articleshow/126163743.cms",
    "timestamp": "2025-12-24T17:09:23Z"
  },
  {
    "title": "EU Faces Renewed US Ire After ESG Cutbacks Fail to Calm Tensions",
    "description": "The European Union’s ESG framework — a shadow of its former self after a year of deep cuts — is drawing renewed threats from the US. At issue is the so-called extraterritoriality of the Corporate Sustainability Reporting Directive and the …",
    "link": "https://www.insurancejournal.com/news/international/2025/12/24/852292.htm",
    "timestamp": "2025-12-24T17:06:19Z"
  },
  {
    "title": "Trump Is Suddenly Looking a Lot Smaller (Jonathan Lemire/The Atlantic)",
    "description": "Jonathan Lemire / The Atlantic:\nTrump Is Suddenly Looking a Lot Smaller  —  The president is no longer dominating his party or the country in the way he once did.  —  Hey, remember april?  —  When President Donald Trump marked his 100th day in office at the e…",
    "link": "https://www.memeorandum.com/251224/p43",
    "timestamp": "2025-12-24T17:05:01Z"
  },
  {
    "title": "Gazans are taking matters into their own hands by launching community reconstruction efforts",
    "description": "With limited resources, Palestinians in Gaza and in exile are funding community reconstruction efforts amid the absence of international aid. “We have to keep trying to help Gaza rise again,” an organizer with the Sameer Project tells Mondoweiss.",
    "link": "https://mondoweiss.net/2025/12/gazans-are-taking-matters-into-their-own-hands-by-launching-community-reconstruction-efforts/",
    "timestamp": "2025-12-24T17:05:00Z"
  },
  {
    "title": "Trump’s $100,000 H-1B visa application fee upheld by judge",
    "description": "A federal judge said the Trump administration can move ahead with a $100,000 fee on new H-1B visa applications, providing a setback for US technology companies that rely on hiring skilled foreign w…",
    "link": "https://www.mercurynews.com/2025/12/24/trumps-100000-h-1b-visa-application-fee-upheld-by-judge/",
    "timestamp": "2025-12-24T17:02:12Z"
  },
  {
    "title": "Judge blocks Trump effort to strip security clearance from attorney who represented whistleblowers",
    "description": "A federal judge is halting the enforcement of a March presidential memorandum that revoked the security clearance of a prominent Washington attorney",
    "link": "https://abcnews.go.com/US/wireStory/judge-blocks-trump-effort-strip-security-clearance-attorney-128680628",
    "timestamp": "2025-12-24T17:01:46Z"
  },
  {
    "title": "Religious scholar explains how Christian nationalists use and abuse the Bible",
    "description": "Like Islam, Christianity is incredibly diverse, ranging from severe fundamentalists to people who are devout but have a more nuanced and complex view of their faith. President Donald Trump is not a Christian fundamentalist; he was raised Presbyterian in Queen…",
    "link": "https://www.rawstory.com/alternet-posts/dan-mcclellan-christian-nationalism/",
    "timestamp": "2025-12-24T17:00:10Z"
  },
  {
    "title": "South Asia’s Difficult Year",
    "description": "The stories that shaped the region in 2025, from India-Pakistan conflict to a deepening Afghan refugee crisis.",
    "link": "http://foreignpolicy.com/2025/12/24/south-asia-year-review-india-pakistan-conflict-nepal-afghanistan/",
    "timestamp": "2025-12-24T17:00:07Z"
  },
  {
    "title": "Intersectionality is all the Rage – Just Ask “Turtle Island Liberation Front”",
    "description": "Our Op-Ed in the NY Post: “Intersectionality” is the mother’s milk of the anti-American, anti-capitalist and anti-Western ideologues who have been ramping up their violence this year. But few Americans are focusing on this threat.\nThe post Intersectionality i…",
    "link": "https://legalinsurrection.com/2025/12/intersectionality-is-all-the-rage-just-ask-turtle-island-liberation-front/",
    "timestamp": "2025-12-24T17:00:02Z"
  },
  {
    "title": "How Should We Approach A.I. in 2026?",
    "description": "On The Political Scene Podcast: The rapid normalization of artificial intelligence is forcing a reckoning with how much of the future is being shaped by hype rather than utility.",
    "link": "https://www.newyorker.com/podcast/political-scene/how-should-we-approach-ai-in-2026",
    "timestamp": "2025-12-24T17:00:00Z"
  },
  {
    "title": "'Obnoxious': Kamala Harris Brutally Ridiculed for Giving Dating Advice — Despite Husband Doug Emhoff Famously Cheating on His First Wife With Children's Teacher",
    "description": "Kamala Harris was ridiculed and slammed as 'obnoxious' for giving dating advice during a recent podcast appearance.",
    "link": "https://radaronline.com/p/kamala-harris-dating-advice-doug-emhoff/",
    "timestamp": "2025-12-24T17:00:00Z"
  },
  {
    "title": "Israel says it will ‘respond’ to Hamas ‘violation’ of Gaza truce in escalation of tensions",
    "description": "Israeli Prime Minister Benjamin Netanyahu accused Hamas on Wednesday of violating the Gaza ceasefire by refusing to disarm, and said Israel would retaliate after a military officer was wounded by what the military described as a bomb.",
    "link": "https://www.independent.ie/world-news/israel-says-it-will-respond-to-hamas-violation-of-gaza-truce-in-escalation-of-tensions/a1330094573.html",
    "timestamp": "2025-12-24T16:59:08Z"
  },
  {
    "title": "Donald Trump Says Stephen Colbert Should Be “Put To Sleep” In Pre-Christmas Late-Night Tirade & Another Call For Broadcast License Terminations",
    "description": "The broadcast late-night shows are dark this week for the holiday but they were on President Donald Trump’s mind as he railed against the hosts again on Truth social Tuesday night before wishing everyone Merry Christmas. Stephen Colbert, host of CBS’ The Late…",
    "link": "http://deadline.com/2025/12/donald-trump-stephen-colbert-late-night-tirade-1236656464/",
    "timestamp": "2025-12-24T16:58:04Z"
  },
  {
    "title": "‘I Want to Follow Jesus Still, but I Want to Slap Somebody’: John Kennedy Seeks Grace and Gratitude in Hard Left DC",
    "description": "DAILY CALLER NEWS FOUNDATION—Republican Louisiana Sen. John Kennedy said Tuesday that navigating Washington’s hard-left culture requires a constant search for grace. The Trump administration has... Read More\nThe post ‘I Want to Follow Jesus Still, but I Want …",
    "link": "https://www.dailysignal.com/2025/12/24/i-want-to-follow-jesus-still-but-i-want-to-slap-somebody-john-kennedy-seeks-grace-and-gratitude-in-hard-left-dc/",
    "timestamp": "2025-12-24T16:53:01Z"
  }
]