[
  {
    "title": "War for Ukraine Day 1,369: Kyiv Is Burning",
    "description": "(Image by NEIVANMADE) The air raid alert maps reported at 5:39 AM local time/10:39 PM EST that another wave of drone swarms is heading towards Kyiv, which was already hammered earlier tonight/this morning. Telegram monitors claim Russia preparing one of its b…",
    "link": "https://balloon-juice.com/2025/11/24/war-for-ukraine-day-1369-kyiv-is-burning/",
    "timestamp": "2025-11-25T04:53:03Z"
  },
  {
    "title": "Binance founder Changpeng Zhao accused of facilitating payments to Hamas (Financial Times)",
    "description": "Financial Times:\nBinance founder Changpeng Zhao accused of facilitating payments to Hamas  —  Crypto tycoon pardoned by Donald Trump faces US court complaint from families of victims of October 7 attack  —  The billionaire Binance founder pardoned by Donald T…",
    "link": "https://www.memeorandum.com/251124/p129",
    "timestamp": "2025-11-25T04:45:01Z"
  },
  {
    "title": "Taiwan and Ukraine discussed by Xi Jinping and Trump",
    "description": "Chinese leader Xi Jinping pressed the ever-sensitive issue of Taiwan in a phone call with US President Donald Trump, as he stressed the need to build on a fragile trade truce between the two superpowers.",
    "link": "https://www.rte.ie/news/world/2025/1125/1545681-china-us-taiwan/",
    "timestamp": "2025-11-25T04:43:42Z"
  },
  {
    "title": "‘Like a Rock’: Trump’s 87% GOP Support Surges Past 21st-Century Presidents",
    "description": "Donald Trump continues to maintain overwhelming support from Republican voters, with CNN data confirming that 87 percent of Republicans currently approve of the president — unchanged from six months ago.\nThe post ‘Like a Rock’: Trump’s 87% GOP Support Surges …",
    "link": "https://www.breitbart.com/politics/2025/11/24/trumps-gop-support-surges-past-all-21st-century-presidents/",
    "timestamp": "2025-11-25T04:40:25Z"
  },
  {
    "title": "More Relief on the Way as Economic Wins Bring Savings to Gas Pump, Thanksgiving Table",
    "description": "As millions of American families prepare to gather for Thanksgiving, they’re seeing a dose of the economic relief President Donald J. Trump is fighting to deliver. After inheriting the worst inflation crisis in 40 years from Joe Biden and Democrats, the Trump…",
    "link": "https://biztoc.com/x/eb837e89cb80aecf",
    "timestamp": "2025-11-25T04:39:57Z"
  },
  {
    "title": "Taiwan PM sends 'clear' message to China after Xi's call with Trump",
    "description": "China has offered Taiwan a \"one country, two systems\" model, but this position is not supported by any mainstream political party. The US has not taken a side when it comes to Taiwan's sovereignty but is opposed to any use of force to seize the territory.",
    "link": "https://news.sky.com/story/return-to-china-not-an-option-taiwan-warns-as-xi-mentions-issue-in-phone-call-with-trump-13475103",
    "timestamp": "2025-11-25T04:39:00Z"
  },
  {
    "title": "Russia Attacks Ukraine’s Capital Hours After Trump Teases Hope for Peace",
    "description": "Russian forces attacked the Ukrainian capital of Kyiv early Tuesday, striking a residential building and wounding at least four people, the Associated Press (AP) reported, hours after U.S. President Donald Trump struck a cautiously optimistic tone on hopes fo…",
    "link": "https://biztoc.com/x/8d0afe7ea7ee92ea",
    "timestamp": "2025-11-25T04:27:58Z"
  },
  {
    "title": "'It's A Tinder Box': GOP Lawmaker Warns More 'Explosive' Resignations Coming After MTG",
    "description": "Other Republican figures are also sounding the alarm ahead of next year's midterm elections.",
    "link": "https://www.huffpost.com/entry/more-republicans-resignations-prediction_n_6925077ee4b05f521dda468c",
    "timestamp": "2025-11-25T04:23:01Z"
  },
  {
    "title": "Piyush Goyal meets pharma stakeholders to discuss growth, regulation amid global tariff concerns",
    "description": "Union Minister Piyush Goyal met with Indian pharmaceutical stakeholders. Discussions focused on strengthening regulatory frameworks and accelerating growth. The government is committed to a future-ready, innovation-led pharma sector. This meeting occurs as th…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/piyush-goyal-meets-pharma-stakeholders-to-discuss-growth-regulation-amid-global-tariff-concerns/articleshow/125555239.cms",
    "timestamp": "2025-11-25T04:17:22Z"
  },
  {
    "title": "Ukraine, Russia trade deadly strikes as negotiators hammer at deal",
    "description": "Ukraine and Russia counted casualties Tuesday after trading deadly overnight strikes, as negotiators scrambled to revise a framework to end the nearly four-year conflict ahead of a US-imposed deadline. US President Donald Trump has given Kyiv until November 2…",
    "link": "https://www.digitaljournal.com/world/ukraine-russia-trade-deadly-strikes-as-negotiators-hammer-at-deal/article",
    "timestamp": "2025-11-25T04:17:20Z"
  },
  {
    "title": "Final document has not been agreed upon, as officials seek common ground to present to Russia",
    "description": "Volodymyr Zelensky resisted any deal conceding occupied Ukrainian land.",
    "link": "https://www.washingtonpost.com/world/2025/11/24/ukraine-peace-plan-europe-russia/",
    "timestamp": "2025-11-25T04:11:09Z"
  },
  {
    "title": "Chad Wolf: H-1B Program Doesn't Work the Way Trump Is Describing",
    "description": "On Monday’s broadcast of NewsNation’s “On Balance,” former acting Secretary of Homeland Security Chad Wolf responded to President Donald Trump’s defense of the H-1B visa program by saying, “that is not the current H-1B system. They come over, they stay\nThe po…",
    "link": "https://www.breitbart.com/clips/2025/11/24/chad-wolf-h-1b-program-doesnt-work-the-way-trump-is-describing/",
    "timestamp": "2025-11-25T04:08:10Z"
  },
  {
    "title": "US says Myanmar 'safe', terminates nationals' protection status",
    "description": "The US government is ending the temporary legal status of thousands of Myanmar nationals arguing they can safely return to the war-torn South-East Asian country.",
    "link": "https://www.abc.net.au/news/2025-11-25/us-ends-temporary-status-myanmar-nationals-elections-progress/106050086",
    "timestamp": "2025-11-25T04:05:56Z"
  },
  {
    "title": "BBC may not be in 'safe hands' under its chair, says committee head",
    "description": "The most senior MP on the culture select committee says Samir Shah's evidence to MPs was \"wishy-washy\".",
    "link": "https://www.bbc.com/news/articles/cd74ne84lqdo",
    "timestamp": "2025-11-25T04:05:56Z"
  },
  {
    "title": "Trump and Takaichi speak by phone amid Japan-China spat",
    "description": "International relationsTrump and Takaichi speak by phone amid Japan-China spat\nTwo leaders reaffirm close cooperation, Japanese prime minister says\nFrom left: Japanese Prime Minister Sanae Takaichi, U.S. President Donald Trump and Chinese President Xi Jinping…",
    "link": "https://biztoc.com/x/48af091650e792c4",
    "timestamp": "2025-11-25T04:05:46Z"
  },
  {
    "title": "News from outside disappears in North Korea",
    "description": "Decades-long efforts to provide uncensored foreign news into North Korea are facing setbacks now",
    "link": "https://abcnews.go.com/Business/wireStory/news-disappears-north-korea-127847626",
    "timestamp": "2025-11-25T04:05:33Z"
  },
  {
    "title": "Takaichi speaks with Trump about China",
    "description": "Japan's Prime Minister Sanae Takaichi and President Donald Trump discussed China relations in a phone call on Tuesday, their first talks since the Japanese premier sparked a major diplomatic bust-up with Beijing over her remarks on Taiwan. Takaichi's response…",
    "link": "https://japantoday.com/category/politics/Takaichi-speaks-with-Trump-about-China",
    "timestamp": "2025-11-25T03:52:25Z"
  },
  {
    "title": "Mark Kelly: Pentagon Investigation of Me 'Almost Comical,' 'Absurd'",
    "description": "Monday on MS NOW's \"The Rachel Maddow Show,\" Sen. Mark Kelly (D-AZ) said the Department of War investigation into the propaganda video he did with several other Democratic lawmakers was \"almost comical.\"\nThe post Mark Kelly: Pentagon Investigation of Me ‘Almo…",
    "link": "https://www.breitbart.com/clips/2025/11/24/mark-kelly-pentagon-investigation-of-me-almost-comical-absurd/",
    "timestamp": "2025-11-25T03:51:42Z"
  },
  {
    "title": "Trump launches ‘Genesis Mission’ to harness AI for scientific breakthroughs",
    "description": "Trump signs order to integrate supercomputers and data assets in order to create 'AI experimentation platform'.",
    "link": "https://www.aljazeera.com/economy/2025/11/25/trump-launches-genesis-mission-to-harness-ai-for-scientific-breakthroughs",
    "timestamp": "2025-11-25T03:48:28Z"
  },
  {
    "title": "BBC Chairman refuses to quit amid Trump speech edit scandal",
    "description": "BBC Chairman Samir Shah tells MPs he will not resign over the Panorama Trump edit scandal, apologizing for mistakes but vowing to “fix it.”",
    "link": "https://www.israelnationalnews.com/news/418313",
    "timestamp": "2025-11-25T03:46:24Z"
  },
  {
    "title": "China-Russia aiming to corner US? Xi and Putin back Venezuela against America as Trump and Xi try to forge closer ties",
    "description": "China and Russia reaffirmed their support for Venezuelan President Maduro, condemning external interference amid US military deployments. Simultaneously, US President Trump and Chinese President Xi Jinping engaged in a phone call signaling a thaw in relations…",
    "link": "https://economictimes.indiatimes.com/news/international/us/china-russia-aiming-to-corner-us-xi-and-putin-back-venezuela-against-america-as-trump-and-xi-try-to-forge-closer-ties/articleshow/125554724.cms",
    "timestamp": "2025-11-25T03:46:17Z"
  },
  {
    "title": "Pentagon Threatens Unprecedented Recall After Sen. Kelly Questions Legality of Deadly Drug-Smuggler Strikes",
    "description": "The Pentagon on Monday threatened to recall U.S. Senator Mark Kelly, a retired Navy captain, to active duty status in order to prosecute him after what it described as seditious behavior by the former astronaut and decorated veteran.",
    "link": "https://gcaptain.com/pentagon-threatens-unprecedented-recall-after-sen-kelly-questions-legality-of-deadly-drug-smuggler-strikes/",
    "timestamp": "2025-11-25T03:46:15Z"
  },
  {
    "title": "Seth Meyers: MAGA Stunned After Zohran Mamdani Charms Donald Trump in the Oval Office",
    "description": "Seth takes a closer look at Donald Trump hosting Zohran Mamdani at the White House.",
    "link": "https://littlegreenfootballs.com/article/55088_Seth_Meyers-_MAGA_Stunned_Afte",
    "timestamp": "2025-11-25T03:36:32Z"
  },
  {
    "title": "Asia markets advance as odds for another Fed rate cut grow",
    "description": "Asian investors on Tuesday welcomed more dovish comments from Federal Reserve officials reinforcing hopes it will cut interest rates next month, while a tech-led rally on Wall Street soothed recent AI bubble worries. After a swoon in recent weeks, optimism ap…",
    "link": "https://www.digitaljournal.com/world/asia-markets-advance-as-odds-for-another-fed-rate-cut-grow/article",
    "timestamp": "2025-11-25T03:32:33Z"
  },
  {
    "title": "China’s Xi pushes Taiwan issue in call with Trump",
    "description": "Chinese leader Xi Jinping pressed the ever-sensitive issue of Taiwan in a phone call Monday with US President Donald Trump, as he stressed the need to build on a fragile trade truce between the two superpowers. China’s foreign ministry said the call touched o…",
    "link": "https://www.digitaljournal.com/world/chinas-xi-pushes-taiwan-issue-in-call-with-trump/article",
    "timestamp": "2025-11-25T03:32:21Z"
  },
  {
    "title": "Why Palestinian Statehood is a Prerequisite for Arab-Israeli Peace and Expansion of Abraham Accords",
    "description": "By Simon Mabon, Lancaster University (The Conversation) - Mohammed bin Salman wants to bring Saudi Arabia into the Abraham accords, the network of agreements to normalise relations between Israel with other countries in the Middle East and, increasingly, beyo…",
    "link": "https://www.juancole.com/2025/11/palestinian-statehood-prerequisite.html",
    "timestamp": "2025-11-25T03:30:55Z"
  },
  {
    "title": "Google’s compliance with EU’s Big Tech rules gets Italian redesign",
    "description": "Google’s Italian settlement on consent forms highlights the quiet power member states wield in 'gold-plating' EU rules.",
    "link": "https://www.politico.eu/article/google-compliance-eu-big-tech-rules-gets-italian-redesign/",
    "timestamp": "2025-11-25T03:30:00Z"
  },
  {
    "title": "Trump follows through on 'drill, baby, drill' pledge - and it could have huge consequences",
    "description": "The Trump administration say more oil drilling will help make the country energy independent, bringing new jobs and reducing petrol prices - but environmentalists say this will come at a cost in other ways.",
    "link": "https://news.sky.com/story/trump-follows-through-on-drill-baby-drill-pledge-and-it-could-have-huge-consequences-13475102",
    "timestamp": "2025-11-25T03:28:00Z"
  },
  {
    "title": "Binance Faces Fresh Lawsuit Over Alleged Hamas Transactions",
    "description": "A court filing claims Binance’s structure and controls let users tied to U.S.-designated terrorist groups move funds through its exchange.",
    "link": "https://decrypt.co/349919/binance-fresh-anti-terrorism-lawsuit-alleged-hamas-transactions",
    "timestamp": "2025-11-25T03:24:27Z"
  },
  {
    "title": "Mark Kelly Insists His Remarks Were ‘Non-Controversial’ as Pentagon Investigates His ‘Illegal Orders’ Comment",
    "description": "Sen. Mark Kelly insisted his controversial remarks to military personnel were \"non-controversial\" after the Pentagon announced it was investigating the senator.\nThe post Mark Kelly Insists His Remarks Were ‘Non-Controversial’ as Pentagon Investigates His ‘Ill…",
    "link": "https://www.mediaite.com/media/tv/mark-kelly-insists-his-remarks-were-non-controversial-as-pentagon-investigates-his-illegal-orders-comment/",
    "timestamp": "2025-11-25T03:23:03Z"
  },
  {
    "title": "Trump signs executive order for AI project called Genesis Mission to boost scientific discoveries",
    "description": "President Trump launched the “Genesis Mission”, ordering federal agencies, labs, tech firms and universities to pool government data on one platform and use AI to tackle national engineering, energy and security challenges. The initiative aims to boost US inn…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/trump-signs-executive-order-for-ai-project-called-genesis-mission-to-boost-scientific-discoveries/articleshow/125554622.cms",
    "timestamp": "2025-11-25T03:22:57Z"
  },
  {
    "title": "Trump avoids touching upon Taiwan issue after call with China's Xi",
    "description": "WASHINGTON -- U.S. President Donald Trump said on Monday that he had \"a very good telephone call\" with Chinese President Xi Jinping, but did not mention publicly the issue of Taiwan, a matter of contention between China and Japan.\nBeijing seeks support for it…",
    "link": "https://biztoc.com/x/ee7b635746cd8ad7",
    "timestamp": "2025-11-25T03:21:10Z"
  },
  {
    "title": "Brookline Town Meeting declares Trump unfit for office",
    "description": "The anonymous vote approved the resolution, which pointed to Trump's alleged violations of the Constitution and his \"unsoundness of mind.\"",
    "link": "https://www.boston.com/news/local-news/2025/11/24/brookline-town-meeting-declares-trump-unfit-for-office/",
    "timestamp": "2025-11-25T03:20:36Z"
  },
  {
    "title": "Monday, November 24. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,370.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/11/24/monday-november-24-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-11-25T03:16:03Z"
  },
  {
    "title": "No Plans for a Trump-Zelensky Meeting — White House",
    "description": "There are currently no plans for a meeting between US President Donald Trump and Volodymyr Zelensky, White House Press Secretary Karoline Leavitt said on Monday.",
    "link": "https://sputnikglobe.com/20251125/no-plans-for-a-trump-zelensky-meeting--white-house-1123167152.html",
    "timestamp": "2025-11-25T03:16:00Z"
  },
  {
    "title": "Trump moves to designate some Muslim Brotherhood chapters as terrorist groups",
    "description": "The executive order calls for a report into whether to label the group a terrorist organisation.",
    "link": "https://www.bbc.com/news/articles/c1w9j0jqj99o",
    "timestamp": "2025-11-25T03:15:46Z"
  },
  {
    "title": "Trump and Xi discuss trade, Taiwan, and Russia-Ukraine in second call",
    "description": "US President Donald Trump and Chinese President Xi Jinping held a phone call on November 24 to address issues including trade agreements, the Taiwan situation, and the Russia-Ukraine conflict, following their meeting last month in Busan, South Korea. The conv…",
    "link": "https://www.digitimes.com/news/a20251125PD225/us-china-trade-war-donald-trump-xi-jingping-taiwan.html&chid=10",
    "timestamp": "2025-11-25T03:15:10Z"
  },
  {
    "title": "Trump to visit Beijing in April, Xi to go to US next year",
    "description": "Kathmandu, Nov 25: US President Donald Trump said on Monday that he had a “very good” phone call with Chinese […]\nThe post Trump to visit Beijing in April, Xi to go to US next year appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/11/25/trump-to-visit-beijing-in-april-xi-to-go-to-us-next-year/",
    "timestamp": "2025-11-25T03:15:00Z"
  },
  {
    "title": "Dominant: New Hampshire Poll Shows JD Vance Towering over 2028 Field",
    "description": "Vice President JD Vance is holding a commanding lead over potential rivals in the early 2028 Republican presidential primary landscape, according to a newly released Saint Anselm College poll.\nThe post Dominant: New Hampshire Poll Shows JD Vance Towering over…",
    "link": "https://www.breitbart.com/politics/2025/11/24/dominant-new-hampshire-poll-shows-jd-vance-towering-2028-field/",
    "timestamp": "2025-11-25T03:13:26Z"
  },
  {
    "title": "Sudan’s RSF committing war crimes in Darfur, says Amnesty",
    "description": "The latest report came hours after the RSF agreed to a three-month humanitarian truce.",
    "link": "https://www.aljazeera.com/news/2025/11/25/sudans-rsf-committing-war-crimes-in-darfur-says-amnesty",
    "timestamp": "2025-11-25T03:11:32Z"
  },
  {
    "title": "BBC leaders grilled by lawmakers after Trump threatened to sue public broadcaster",
    "description": "The BBC's chairman acknowledged Monday that it was too slow in responding to allegations of bias over a misleading edit of a speech by U.S. President Donald Trump, but rejected claims that the broadcaster's impartiality was being undermined from within its ow…",
    "link": "https://www.cbc.ca/news/world/bbc-leaders-grilled-9.6991216",
    "timestamp": "2025-11-25T03:07:05Z"
  },
  {
    "title": "Bill Maher Says He Stopped the ‘Cheap Shots’ at Trump After Heated White House Meeting: ‘I Don’t Have to Go There’ | Video",
    "description": "\"We went into the little merch room after the Oval Office and he started yelling at me,\" the comedian adds\nThe post Bill Maher Says He Stopped the ‘Cheap Shots’ at Trump After Heated White House Meeting: ‘I Don’t Have to Go There’ | Video appeared first on Th…",
    "link": "https://www.thewrap.com/bill-maher-trump-cheap-shots-white-house-meeting/",
    "timestamp": "2025-11-25T03:06:50Z"
  },
  {
    "title": "Japan PM Takaichi holds call with Trump amid China dispute",
    "description": "This was the first conversation between Japan PM Sanae Takaichi and US President Donald Trump since her remarks on Taiwan.",
    "link": "https://www.channelnewsasia.com/east-asia/japan-pm-takaichi-call-trump-china-dispute-5488476",
    "timestamp": "2025-11-25T03:06:48Z"
  },
  {
    "title": "Trump nearly banished from his favorite TV channel for breaking its 'golden rule': report",
    "description": "President Donald Trump was nearly banned from appearing on his favorite television channel after he broke its \"golden rule,\" according to a new report. The Daily Beast reported on Monday that unsealed documents show Fox Corporation CEO Lachlan Murdoch telling…",
    "link": "https://www.rawstory.com/trump-2674339140/",
    "timestamp": "2025-11-25T03:04:52Z"
  },
  {
    "title": "Donald Trump Wants A “Rush Hour 4”",
    "description": "A surprising new report at Semafor claims that U.S. President Donald Trump wants Jackie Chan, Chris Tucker and filmmaker Brett Ratner to re-team for another “Rush Hour” movie. The report claims Trump aims to “revive the raucous comedies and action movies of t…",
    "link": "https://www.darkhorizons.com/donald-trump-wants-a-rush-hour-4/",
    "timestamp": "2025-11-25T03:04:03Z"
  },
  {
    "title": "Florida judge rules against Trump in lawsuit against major media company",
    "description": "President Donald Trump was recently handed another loss in court, after failing to convince a Florida judge that he was owed money by the Guardian newspaper for reporting on a federal investigation involving his company.Guardian reporter Hugo Lowell reported …",
    "link": "https://www.rawstory.com/alternet-posts/judge-rules-trump-media/",
    "timestamp": "2025-11-25T03:01:13Z"
  },
  {
    "title": "Texas is getting far less federal money for rural broadband expansion than expected",
    "description": "",
    "link": "https://biztoc.com/x/4beb07f81eb8189a",
    "timestamp": "2025-11-25T02:58:33Z"
  },
  {
    "title": "Maduro dances to his own peace track while US ramps up Caribbean show of force",
    "description": "Nicolás Maduro dances to electronic remix of his peace speeches while US warships patrol Venezuelan coast in escalating diplomatic standoff with America.",
    "link": "https://www.foxnews.com/world/maduro-dances-his-own-peace-track-while-us-ramps-up-caribbean-show-force",
    "timestamp": "2025-11-25T02:55:37Z"
  },
  {
    "title": "Prince Andrew Way to be renamed - but council warns it won't be straightforward",
    "description": "Residents on the road have been warned there will be a lot of admin, as they will need to change their bank details, driver's licence and utility bills. Councillors are planning for the new name to retain a royal theme.",
    "link": "https://news.sky.com/story/prince-andrew-way-to-be-renamed-but-council-warns-it-wont-be-straightforward-13475099",
    "timestamp": "2025-11-25T02:53:00Z"
  },
  {
    "title": "WSJ shreds Trump after his 'revenge lawfare' flops: 'Gang that couldn't indict straight'",
    "description": "President Donald Trump and his administration's Department of Justice got a brutal tongue-lashing by the conservative Wall Street Journal editorial board on Monday for the failure of their \"revenge lawfare\" scheme, branding them as the \"gang that couldn't ind…",
    "link": "https://www.rawstory.com/doj-failure/",
    "timestamp": "2025-11-25T02:50:02Z"
  },
  {
    "title": "Swalwell: Trump Has Made the United States 'Lawless'",
    "description": "Monday on MS NOW's \"The Weeknight,\" Rep. Eric Swalwell (D-CA) said President Donald Trump had turned the United States into a \"lawless\" country.\nThe post Swalwell: Trump Has Made the United States ‘Lawless’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/11/24/swalwell-trump-has-made-the-united-states-lawless/",
    "timestamp": "2025-11-25T02:46:28Z"
  },
  {
    "title": "Family reunited after a decade – now a Trump clampdown could tear them apart",
    "description": "Marven's mother and sister could be sent back to gang-ravaged Haiti as a US protection scheme ends.",
    "link": "https://www.bbc.com/news/articles/cly481gxwr8o",
    "timestamp": "2025-11-25T02:40:30Z"
  },
  {
    "title": "Thousands of undocumented immigrants in Colorado lose health care subsidies - NewsBreak",
    "description": "On Nov. 17, phones started lighting up at a first-floor office in north Denver. Hundreds of people wanted to know whether they had won the lottery, and if",
    "link": "https://www.newsbreak.com/share/4363872213065-thousands-of-undocumented-immigrants-in-colorado-lose-health-care-subsidies?_f=app_share&amp;pd=0GSQDV8h&amp;lang=en_US&amp;send_time=1764038240&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.47.0.44%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-25T02:38:17Z"
  },
  {
    "title": "Xi Jinping Says US-China Trade Relations Maintain Positive Momentum As Trump Considers Allowing Nvidia AI Chip Sales To Beijing",
    "description": "On Monday, Chinese President Xi Jinping highlighted the ongoing progress in U.S.-China trade ties after a phone call with President Donald Trump. This comes after it was reported that Washington is considering allowing Nvidia Corp (NASDAQ:NVDA) to resume AI c…",
    "link": "https://biztoc.com/x/a437b5afe1be3614",
    "timestamp": "2025-11-25T02:36:07Z"
  },
  {
    "title": "Trump Says He And Xi Are Making 'Significant Progress' After Call; Beijing Visit Set For April",
    "description": "US President Donald Trump said that he had a “very good” phone call with Chinese President Xi Jinping, discussing issues ranging from Ukraine and Russia to fentanyl and farm products. Trump said the two leaders have made “significant progress” since their rec…",
    "link": "https://www.ndtvprofit.com/world/trump-says-he-and-xi-are-making-significant-progress-after-call-beijing-visit-set-for-april",
    "timestamp": "2025-11-25T02:32:58Z"
  },
  {
    "title": "Oil Steadies As Traders Look To Risk-On Mood And Ukraine Talks",
    "description": "Oil steadied as investors tracked a risk-on mood in wider financial markets, which countered the impact of progress in peace talks over Ukraine that could pave the way for increased crude supplies.",
    "link": "https://www.ndtvprofit.com/markets/oil-steadies-as-traders-look-to-risk-on-mood-and-ukraine-talks",
    "timestamp": "2025-11-25T02:25:29Z"
  },
  {
    "title": "October 7 victims sue Binance, founder Zhao over terror financing allegations",
    "description": "Victims of Hamas’ October 7, 2023 attack sue Binance and founder Changpeng Zhao, alleging the crypto giant laundered over $1B for Hamas and other terror groups.",
    "link": "https://www.israelnationalnews.com/news/418310",
    "timestamp": "2025-11-25T02:25:26Z"
  },
  {
    "title": "White House delays expected release of proposal to lower health care costs",
    "description": "It was not clear what stance the president was expected to take regarding the expiration of subsidies, but a bipartisan group of House lawmakers proposed extending ACA subsidies for two years and placing an income cap for high earners.",
    "link": "https://justthenews.com/government/white-house/white-house-pushes-expected-unveiling-new-healthcare-cost-proposal-reports",
    "timestamp": "2025-11-25T02:22:32Z"
  },
  {
    "title": "Erika Kirk says Turning Point's support of JD Vance in 2028 is 'in the works'",
    "description": "Erika Kirk says Turning Point's support of JD Vance in 2028 is 'in the works'go.com",
    "link": "https://abcnews.go.com/Politics/erika-kirk-turning-points-support-jd-vance-2028/story?id=127847720",
    "timestamp": "2025-11-25T02:21:43Z"
  },
  {
    "title": "Trump Moves To Designate Muslim Brotherhood Chapters As Terrorist Organizations",
    "description": "Donald Trump on Monday signed an executive order opening the door for several chapters of the Muslim Brotherhood to be designated as terrorist groups.",
    "link": "https://dailycaller.com/2025/11/24/donald-trump-muslim-brotherhood-chapters-executive-order-terror/",
    "timestamp": "2025-11-25T02:18:40Z"
  },
  {
    "title": "India's economy likely grew 7.3% in July-September quarter",
    "description": "India's economy is projected to have grown 7.3 percent in the July-September quarter. Strong rural and government spending supported this growth. Household consumption also improved. However, private investment remained subdued. This indicates uneven economic…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/indias-economy-likely-grew-7-3-in-july-september-quarter/articleshow/125553651.cms",
    "timestamp": "2025-11-25T02:17:21Z"
  },
  {
    "title": "Tyson Foods plans to close a major Nebraska beef plant",
    "description": "Tyson Foods’ decision to close a beef plant in Lexington, Nebraska, could devastate the small city and undermine the profits of ranchers nationwide. The closure of the plant and one of two shifts at a plant in Texas will reduce beef processing capacity nation…",
    "link": "https://apnews.com/article/beef-prices-tyson-plant-closing-a47113754d3a2962970481153657a02f",
    "timestamp": "2025-11-25T02:13:46Z"
  },
  {
    "title": "Thanksgiving prices don't reflect bird flu's recent toll on turkeys",
    "description": "Bird flu and another disease have shrunk the U.S. turkey population to a 40-year low this year",
    "link": "https://www.wokv.com/news/business/stores-keep-prices/EGT5L3IP6QZ2XALEKSOVAA7TO4/",
    "timestamp": "2025-11-25T02:12:12Z"
  },
  {
    "title": "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed",
    "description": "A judge has thrown out cases against former FBI Director James Comey and New York Attorney General Letitia James. The prosecutor who brought the charges was illegally appointed. This ruling halts prosecutions against two political opponents. The decision focu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/judge-dismisses-comey-james-indictments-after-finding-that-prosecutor-was-illegally-appointed/articleshow/125553596.cms",
    "timestamp": "2025-11-25T02:11:46Z"
  },
  {
    "title": "Listen to The Country online: Fonterra’s $9.50 milk price midpoint forecast with CEO Miles Hurrell",
    "description": "Miles Hurrell, Michael Every, Richard Wyeth and Peter Newbold talk to The Country.",
    "link": "https://www.nzherald.co.nz/the-country/news/listen-to-the-country-online-fonterras-950-milk-price-midpoint-forecast-with-ceo-miles-hurrell/MKAWUEFRIBFRHCKCZQZIIJELNU/",
    "timestamp": "2025-11-25T02:11:25Z"
  },
  {
    "title": "Judge throws out case against ‘Russiagate’ ex-FBI chief",
    "description": "A US judge has dismissed the case against ex-FBI chief James Comey and New York Attorney General Letitia James Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628349-james-comey-fbi-case/",
    "timestamp": "2025-11-25T02:05:26Z"
  },
  {
    "title": "Schiff: 2025 Thanksgiving turkey price up ‘whopping 40 percent’",
    "description": "Sen. Adam Schiff (D-Calif.) said Sunday the price of this year’s Thanksgiving turkey is set to rise a “whopping 40 percent.” “So, we’re coming up on...",
    "link": "https://thehill.com/homenews/senate/5621301-schiff-trump-turkey-tariffs/",
    "timestamp": "2025-11-25T02:02:55Z"
  },
  {
    "title": "What to know about Trump's peace plan for Russia and Ukraine",
    "description": "The Trump administration's peace plan for Ukraine has drawn significant criticism. Initially seen as favoring Russia, the proposal has undergone revisions to incorporate Ukraine's concerns. This has made Russia less likely to accept the deal. Despite setbacks…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/what-to-know-about-trumps-peace-plan-for-russia-and-ukraine/articleshow/125553486.cms",
    "timestamp": "2025-11-25T01:58:56Z"
  },
  {
    "title": "Ruben Gallego warns military 'there will be consequences' going after congressmembers once Trump is gone",
    "description": "Arizona Democratic Senator Ruben Gallego said on CNN Monday that military members could face some consequences if they followed orders persecuting lawmakers.",
    "link": "https://www.foxnews.com/media/ruben-gallego-warns-military-there-consequences-going-after-congressmembers-once-trump-gone",
    "timestamp": "2025-11-25T01:58:38Z"
  },
  {
    "title": "US tags group 'linked' to Maduro terror outfit, to slap sanctions",
    "description": "US News: WASHINGTON: The US on Monday formally designated Cartel de los Soles a foreign terrorist organization, layering additional terrorism-related sanctions.",
    "link": "https://timesofindia.indiatimes.com/world/us/us-tags-group-linked-to-maduro-terror-outfit-to-slap-sanctions/articleshow/125553450.cms",
    "timestamp": "2025-11-25T01:56:53Z"
  },
  {
    "title": "Dollar unfazed even as Fed cut comes back into view",
    "description": "The US dollar holds steady as investors anticipate a Federal Reserve interest rate cut next month. Dovish comments from policymakers have increased the likelihood of a December reduction. Meanwhile, the Japanese yen remains weak and under scrutiny for potenti…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-unfazed-even-as-fed-cut-comes-back-into-view/articleshow/125553455.cms",
    "timestamp": "2025-11-25T01:55:50Z"
  },
  {
    "title": "Canada's top diplomat says Ottawa is working fast to advance India trade deal",
    "description": "Canadian Foreign Minister Anita Anand’s statement follows a meeting between Prime Minister Modi and his Canadian counterpart at the G20 summit in South Africa",
    "link": "https://www.thehindubusinessline.com/news/canadas-top-diplomat-says-ottawa-is-working-fast-to-advance-india-trade-deal/article70320054.ece",
    "timestamp": "2025-11-25T01:53:40Z"
  },
  {
    "title": "Trump Embraces Mamdani Socialism as 'Practical'",
    "description": "This week, editors Peter Suderman, Katherine Mangu-Ward, and Nick Gillespie are joined by Reason senior editor Robby Soave to discuss President Donald Trump's unexpectedly warm White House meeting with New York mayor-elect Zohran Mamdani and why he now descri…",
    "link": "https://biztoc.com/x/a1cf395c0d8d1a1f",
    "timestamp": "2025-11-25T01:51:05Z"
  },
  {
    "title": "Venezuela says US terrorist designation a 'ridiculous lie'",
    "description": "Venezuela on Monday rejected the US terrorist designation of an alleged drug cartel on its territory as a \"ridiculous lie\" aimed at paving the way for an \"illegitimate\" military intervention. Venezuela's foreign ministry on Monday rejected what it called \"the…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/venezuela-says-us-terrorist-designation-a-ridiculous-lie/articleshow/125553402.cms",
    "timestamp": "2025-11-25T01:49:13Z"
  },
  {
    "title": "Bill Maher Left Dumbfounded After Lara Trump Questions If Trump’s ‘Piggy’ Comment Is Real",
    "description": "The comedian argued that the president's inflammatory remarks makes it more challenging for him to convince liberals to interact with conservatives more.",
    "link": "https://www.huffpost.com/entry/lara-trump-defends-donald-trumps-piggy-outburst-bill-maher_n_69249194e4b04a88b45eeb52",
    "timestamp": "2025-11-25T01:48:41Z"
  },
  {
    "title": "Russia Bombards Kyiv Hours After Trump Voices Hope for Ukraine Deal",
    "description": "Russia launched a combined missile and drone attack on Ukraine, concentrated heavily on the capital Kyiv, just hours after President Donald Trump struck a positive tone on prospects for a ceasefire deal.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-bombards-kyiv-hours-after-trump-voices-hope-for-ukraine-deal",
    "timestamp": "2025-11-25T01:47:13Z"
  },
  {
    "title": "Minnesota Democrats Defend Somalis amid Massive Fraud Investigations",
    "description": "Minnesota Democrats have sided with the state's Somali community despite evidence of widespread Somali fraud of taxpayers' healthcare programs.\nThe post Minnesota Democrats Defend Somalis amid Massive Fraud Investigations appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/11/24/minnesota-democrats-defend-somalis-massive-fraud-investigations/",
    "timestamp": "2025-11-25T01:47:05Z"
  },
  {
    "title": "'They're using kids as bait': Trump's ICE ships record number of kids to federal shelters",
    "description": "ICE Sent 600 Immigrant Kids to Detention in Federal Shelters This Year. It’s a New Record.It was Friday, June 6, and the rent was due. As soon as she finished an errand, Imelda Carreto planned on joining her family as they gathered scrap metal to earn a littl…",
    "link": "https://www.rawstory.com/ice-raids-2674339073/",
    "timestamp": "2025-11-25T01:42:57Z"
  },
  {
    "title": "Trump Embraces Mamdani Socialism as 'Practical'",
    "description": "This week, The Reason Roundtable discuss President Trump's unexpectedly warm White House meeting with New York mayor-elect Zohran Mamdani.",
    "link": "https://reason.com/podcast/2025/11/24/trump-embraces-mamdani-socialism-as-practical/",
    "timestamp": "2025-11-25T01:40:18Z"
  },
  {
    "title": "Marjorie Taylor Greene's resignation shocked some in Georgia who say she could've won without Trump (Associated Press)",
    "description": "Associated Press:\nMarjorie Taylor Greene's resignation shocked some in Georgia who say she could've won without Trump  —  Rep. Marjorie Taylor Greene built a reputation in Congress as a fighter, first as a defender of President Donald Trump and more recently,…",
    "link": "https://www.memeorandum.com/251124/p113",
    "timestamp": "2025-11-25T01:40:00Z"
  },
  {
    "title": "Majority of Hispanic Republican voters say president’s policies are ‘harmful’ – up double-digits from first term: poll",
    "description": "Among just Hispanic Republicans, 55% said Trump’s policies have been harmful – a 17 percentage point increase from the president’s first term, when only 38% of Hispanic Republicans suggested Trump’s agenda was hurting Latinos.",
    "link": "https://nypost.com/2025/11/24/us-news/majority-of-hispanic-republicans-say-presidents-policies-are-harmful-up-double-digits-from-first-term-poll/",
    "timestamp": "2025-11-25T01:39:34Z"
  },
  {
    "title": "What happens next for Marjorie Taylor Greene after exit from Congress?",
    "description": "The former Trump ally has decided to end her time in Congress early after a public fallout with the president.",
    "link": "https://www.bbc.com/news/articles/cj4qvx08450o",
    "timestamp": "2025-11-25T01:38:33Z"
  },
  {
    "title": "QSR deals cooking; Prosus CEO on India bets",
    "description": "Happy Tuesday! Investors are lining up to invest in the quick service restaurant space. This and more in today’s ETtech Morning Dispatch.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/qsr-deals-cooking-prosus-ceo-on-india-bets/articleshow/125553150.cms",
    "timestamp": "2025-11-25T01:36:55Z"
  },
  {
    "title": "White House floats Obamacare subsidy plan",
    "description": "The White House is circulating a proposal that would extend subsidies to help consumers pay for coverage under the Affordable Care Act for two more years, as millions of Americans face spiking health care costs when the current tax credits are set to expire a…",
    "link": "https://www.bostonherald.com/2025/11/24/white-house-floats-obamacare-subsidy-plan/",
    "timestamp": "2025-11-25T01:36:49Z"
  },
  {
    "title": "Latinos report growing pessimism under Trump's administration, finds new survey; Major disapproval against US immigration and economic policies",
    "description": "A recent Pew Research Center survey reveals a significant increase in pessimism among Latinos regarding their personal situations and the nation's direction since the 2024 election. Many express strong disapproval of President Donald Trump's performance, part…",
    "link": "https://economictimes.indiatimes.com/news/international/us/latinos-report-growing-pessimism-under-trumps-administration-finds-new-survey-major-disapproval-against-us-immigration-and-economic-policies/articleshow/125553204.cms",
    "timestamp": "2025-11-25T01:28:54Z"
  },
  {
    "title": "Taylor Swift Eras Tour docuseries faces legal roadblock as plaintiff seeks to block Disney+ release",
    "description": "Taylor Swift&apos;s record-breaking &quot;Eras Tour&quot; filled stadiums, shaked ticket platforms, and became as much a cultural force as a sporting event, but its upcoming Disney",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/11/25/69250320268e3e0f2d8b45bc.html",
    "timestamp": "2025-11-25T01:26:51Z"
  },
  {
    "title": "Trump-pardoned CEO's firm accused of 'knowingly' enabling Hamas attacks",
    "description": "A new lawsuit against a cryptocurrency company whose billionaire founder was recently pardoned of federal crimes by President Donald Trump argued that the firm \"knowingly\" helped finance the Oct. 7, 2021, attack on Israel by Hamas, Reuters reported on Monday.…",
    "link": "https://www.rawstory.com/binance-hamas/",
    "timestamp": "2025-11-25T01:26:50Z"
  },
  {
    "title": "Trump begins process of labeling Muslim Brotherhood chapters as terrorist",
    "description": "US President Donald Trump has initiated steps to label certain Muslim Brotherhood groups as terrorist organizations. This move could lead to sanctions against the influential Islamist movement. The administration is reviewing chapters in Lebanon, Egypt, and J…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-begins-process-of-labeling-muslim-brotherhood-chapters-as-terrorist/articleshow/125553253.cms",
    "timestamp": "2025-11-25T01:26:09Z"
  },
  {
    "title": "Monday Night Open Thread",
    "description": "I see that Betty already noted that that DOJ indictments against James and Comey were dismissed, and while I am not up to speed on James I could see plain as day that the Comey shit was going to get tossed. Again, I do not think they actually care about putti…",
    "link": "https://balloon-juice.com/2025/11/24/monday-night-open-thread-117/",
    "timestamp": "2025-11-25T01:25:24Z"
  },
  {
    "title": "Two people killed in Kyiv strikes, three killed in Russia",
    "description": "Russian forces attacked the Ukrainian capital Kyiv early this morning, triggering fires in at least two residential buildings and killing two people, a senior official said.",
    "link": "https://www.rte.ie/news/ukraine/2025/1125/1545678-ukraine-russia/",
    "timestamp": "2025-11-25T01:25:10Z"
  },
  {
    "title": "Fix America’s trade-school crisis — and fill the jobs Trump is bringing home",
    "description": "If President Trump is serious about reindustrializing, we need a massive national effort to train American workers — because no tariff or tax incentive can conjure them out of thin air.",
    "link": "https://nypost.com/2025/11/24/opinion/how-congress-and-industry-can-fill-the-jobs-trump-is-bringing-home/",
    "timestamp": "2025-11-25T01:22:10Z"
  },
  {
    "title": "Jesse Watters Praises Investigation into Democratic Senator: ‘You Have To Make Examples Out of People’",
    "description": "Fox News host Jesse Watters praised the Department of Defense's investigation into Sen. Mark Kelly, declaring, \"You have to make examples out of people.\"\nThe post Jesse Watters Praises Investigation into Democratic Senator: ‘You Have To Make Examples Out of P…",
    "link": "https://www.mediaite.com/media/tv/jesse-watters-praises-investigation-into-democratic-senator-you-have-to-make-examples-out-of-people/",
    "timestamp": "2025-11-25T01:13:58Z"
  },
  {
    "title": "Drugs sneaked into Ohio prison soaked into the pages of JD Vance’s ‘Hillbilly Elegy’",
    "description": "'Hillbilly Elegy' was used to smuggle drugs into an Ohio prison in trafficking scheme.",
    "link": "https://apnews.com/article/hillbilly-elegy-drug-trafficking-ohio-prison-b5acc6e9e44431ca83760fa561942b0d",
    "timestamp": "2025-11-25T01:13:07Z"
  },
  {
    "title": "Talk to Trump: Gov deflects on health care costs",
    "description": "When it comes to preventing a spike in uninsured residents, Gov. Maura Healey is passing the buck back to President Donald Trump.",
    "link": "https://www.bostonherald.com/2025/11/24/talk-to-trump-gov-deflects-on-health-care-costs/",
    "timestamp": "2025-11-25T01:11:55Z"
  }
]