[
  {
    "title": "What to know about the attacks in Nigeria that killed over 160 people",
    "description": "Gunmen have killed at least 162 people in attacks on two villages in Western Nigeria, according to a lawmaker",
    "link": "https://abcnews.go.com/International/wireStory/attacks-nigeria-killed-160-people-129874583",
    "timestamp": "2026-02-05T07:57:28Z"
  },
  {
    "title": "Japan atomic bomb survivors fear war as US-Russia pact expires",
    "description": "Japanese atomic bomb survivors fear a new arms race and nuclear war as the last US-Russia nuclear arms control treaty, New START, officially expires.\n\nRead More: https://punchng.com/japan-atomic-bomb-survivors-fear-war-as-us-russia-pact-expires/",
    "link": "https://punchng.com/japan-atomic-bomb-survivors-fear-war-as-us-russia-pact-expires/",
    "timestamp": "2026-02-05T07:50:50Z"
  },
  {
    "title": "Japan atomic bomb survivors fear war as US-Russia pact expires",
    "description": "TOKYO: Japanese atomic bomb survivors said Thursday (Feb 5) they feared the world was marching towards nuclear war as the last US-Russian arms control treaty expired.The New START treaty end",
    "link": "https://www.channelnewsasia.com/east-asia/japan-atomic-bomb-survivors-fear-war-us-russia-pact-expires-5909321",
    "timestamp": "2026-02-05T07:50:05Z"
  },
  {
    "title": "Voltas bets on first-time buyers to drive summer demand rebound",
    "description": "Voltas expects strong double-digit revenue growth for its room air conditioners this summer. The company is banking on a surge of first-time buyers to boost demand. This follows a slower season last year. Voltas, India's AC market leader, is also expanding it…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/indias-top-ac-maker-bets-on-first-time-buyers-to-drive-summer-demand-rebound/articleshow/127927355.cms",
    "timestamp": "2026-02-05T07:49:25Z"
  },
  {
    "title": "The one number in the India–US trade deal that hurt Pakistan’s feelings",
    "description": "India-US trade deal: A single percentage point told a larger story. As Washington announced lower tariffs for India under a new trade deal, Pakistan -- left on the wrong side of the number -- found itself confronting an uncomfortable truth about influence, hi…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trade-deal-trump-tariffs-modi-asim-munir-shehbaz-sharif-pakistan-meltdown-one-number-that-hurt-islamabads-feelings/articleshow/127925100.cms",
    "timestamp": "2026-02-05T07:43:41Z"
  },
  {
    "title": "Donald Trump says he wants his blood 'nice and thin'",
    "description": "“I’ve been taking Aspirin for 30 years and I don’t want to change it,” Donald Trump said.",
    "link": "https://www.newsweek.com/donald-trump-says-he-wants-his-blood-nice-and-thin-11468447",
    "timestamp": "2026-02-05T07:40:28Z"
  },
  {
    "title": "A look at the violence flaring in Gaza months into an Israel-Hamas ceasefire",
    "description": "As Israeli strikes killed two dozen Palestinians on Wednesday, many in Gaza wondered what had become of the ceasefire reached between Israel and Hamas in October",
    "link": "https://abcnews.go.com/International/wireStory/violence-flaring-gaza-months-israel-hamas-ceasefire-129872860",
    "timestamp": "2026-02-05T07:34:01Z"
  },
  {
    "title": "Taiwan-US ties are ‘rock solid,’ the island’s president says after Trump-Xi call",
    "description": "Taiwan’s ties with the United States are “rock solid,” the island’s president said Thursday, hours after President Donald Trump and Chinese leader Xi Jinping spoke on the phone, including about the self-ruled island’s future",
    "link": "https://abcnews.go.com/US/wireStory/taiwan-us-ties-rock-solid-islands-president-after-129871759",
    "timestamp": "2026-02-05T07:33:48Z"
  },
  {
    "title": "What to know as Iran and US set for nuclear talks in Oman",
    "description": "Iran and the United States are set for talks Friday in Oman over Tehran's nuclear program",
    "link": "https://abcnews.go.com/Business/wireStory/iran-us-set-nuclear-talks-oman-129871076",
    "timestamp": "2026-02-05T07:33:34Z"
  },
  {
    "title": "US TV host posts message to mother’s kidnapper asking for proof 84-year-old woman is alive",
    "description": "US news anchor Savannah Guthrie has sent a public message to her 84-year-old mother’s kidnapper saying that her family is ready to talk but wants proof that she is alive.",
    "link": "https://www.independent.ie/world-news/north-america/us-tv-host-posts-message-to-mothers-kidnapper-asking-for-proof-84-year-old-woman-is-alive/a541418442.html",
    "timestamp": "2026-02-05T07:32:48Z"
  },
  {
    "title": "Germany news: Merz in Doha after talks in Saudi Arabia",
    "description": "Chancellor Friedrich Merz is on a three-day visit to the Gulf region as Germany seeks closer partnerships on business, energy and security. DW has the latest. Chancellor Friedrich Merz is in Doha on his second stop of a three-day visit to the Gulf region\nOn W…",
    "link": "https://www.dw.com/en/germany-news-merz-in-doha-after-talks-in-saudi-arabia/live-75812212",
    "timestamp": "2026-02-05T07:32:00Z"
  },
  {
    "title": "Germany news: Merz on Gulf tour talks arms deals in Doha",
    "description": "Chancellor Friedrich Merz is on a three-day visit to the Gulf region as Germany seeks closer partnerships on business, energy and security. DW has the latest.",
    "link": "https://www.dw.com/en/germany-news-merz-on-gulf-tour-talks-arms-deals-in-doha/live-75812212",
    "timestamp": "2026-02-05T07:32:00Z"
  },
  {
    "title": "CNBC Daily Open: Alphabet could more than double its capex in 2026, unsettling investors",
    "description": "Alphabet expects capital expenditure for 2026 to come in between $175 billion and $185 billion — at the higher end, capex will more than double from last year.",
    "link": "https://www.cnbc.com/2026/02/05/cnbc-daily-open-alphabet-could-more-than-double-its-capex-in-2026-unsettling-investors.html",
    "timestamp": "2026-02-05T07:30:01Z"
  },
  {
    "title": "Pro-Ukraine activist gets life sentence for Trump assassination attempt",
    "description": "Ryan Wesley Routh has been sentenced to life in prison after he stalked Donald Trump with a rifle during his 2024 presidential campaign Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632019-ukraine-activist-life-prison-trum-assassination-attempt/",
    "timestamp": "2026-02-05T07:28:48Z"
  },
  {
    "title": "China shuns calls to enter nuclear talks after US-Russia treaty lapses",
    "description": "Germany's foreign minister urged China on Thursday to show \"restraint\" in weapons development after the expiry of the last U.S.-Russian nuclear treaty.",
    "link": "https://www.hurriyetdailynews.com/germany-urges-china-to-join-arms-control-efforts-218621",
    "timestamp": "2026-02-05T07:28:00Z"
  },
  {
    "title": "ICE and Border Patrol in Minnesota − Accused of Violating 1st, 2nd, 4th and 10th Amendment Rights − Are Testing Whether the Constitution Can Survive",
    "description": "A law professor recaps ICE and DHS violations of the Constitution in Minnesota alone and their import in reversing Federal oversight.",
    "link": "https://www.nakedcapitalism.com/2026/02/ice-and-border-patrol-in-minnesota-−-accused-of-violating-1st-2nd-4th-and-10th-amendment-rights-−-are-testing-whether-the-constitution-can-survive.html",
    "timestamp": "2026-02-05T07:22:14Z"
  },
  {
    "title": "China’s Xi holds calls with Trump, and Putin, on same day",
    "description": "China's leader has held separate talks with Donald Trump and Vladimir Putin, stressing a need for closer ties with Moscow while urging \"mutual respect\" with Washington. Chinese President Xi Jinping discussed Iran and other major global issues in separate call…",
    "link": "https://www.dw.com/en/chinas-xi-holds-calls-with-trump-and-putin-on-same-day/a-75812442",
    "timestamp": "2026-02-05T07:19:00Z"
  },
  {
    "title": "Wall Street Journal Poses 1 Awkward Question About A Signature Trump Policy",
    "description": "The president's \"biggest successes have come despite\" and not because of it.",
    "link": "https://www.huffpost.com/entry/wall-street-journal-question-for-trump_n_69843671e4b03d97392665b9",
    "timestamp": "2026-02-05T07:14:38Z"
  },
  {
    "title": "Minneapolis group holds singing protests, urges ICE agents to quit their jobs",
    "description": "Following the fatal shootings of two US citizens in Minneapolis earlier this year, Singing Resistance has mobilised hundreds to perform songs calling on ICE agents to quit their jobs and for corporate partners to stop supporting federal enforcement actions.",
    "link": "https://www.channelnewsasia.com/world/minneapolis-group-singing-resistance-ice-agents-5909041",
    "timestamp": "2026-02-05T07:01:03Z"
  },
  {
    "title": "ART doesn't compel Malaysia to export rare earth elements to US, Dewan Rakyat told",
    "description": "KUALA LUMPUR: Malaysia's reciprocal trade agreement with the United States does not include any provision requiring the country to export rare earth elements (REE) exclusively to Washington, says Datuk Seri Arthur Joseph Kurup. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/02/05/art-doesn039t-compel-malaysia-to-export-rare-earth-elements-to-us-dewan-rakyat-told",
    "timestamp": "2026-02-05T07:01:00Z"
  },
  {
    "title": "Iran escalation could blow up entire Middle East – Lavrov",
    "description": "Tensions between the US and Iran pose a threat to the entire Middle East, which Russia seeks to deflate, Sergey Lavrov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632016-lavrov-iran-us-talks/",
    "timestamp": "2026-02-05T07:00:14Z"
  },
  {
    "title": "The US MFN clause: What could it mean for PE investment in healthcare?",
    "description": "The US MFN healthcare policy aims to cap US prescription drug prices at the lowest price paid in other developed countries.\nThe post The US MFN clause: What could it mean for PE investment in healthcare? appeared first on PE Hub.",
    "link": "https://www.pehub.com/the-us-mfn-clause-what-could-it-mean-for-pe-investment-in-healthcare/",
    "timestamp": "2026-02-05T07:00:04Z"
  },
  {
    "title": "Nike faces federal probe over allegations of discrimination against white workers",
    "description": "The federal agency for protecting workers' civil rights revealed Wednesday that it is investigating sportswear giant Nike for allegedly discriminating against white employees.",
    "link": "https://www.npr.org/2026/02/05/g-s1-108780/nike-federal-probe-discrimination-white-workers",
    "timestamp": "2026-02-05T06:59:54Z"
  },
  {
    "title": "Panama’s president hits back after China threat in canal ports row",
    "description": "President Mulino responds to China, insists his country upholds the rule of law and and has an independent court system.",
    "link": "https://www.aljazeera.com/news/2026/2/5/panamas-president-hits-back-after-china-threat-in-canal-ports-row",
    "timestamp": "2026-02-05T06:59:02Z"
  },
  {
    "title": "On the Road to Nuclear War",
    "description": "On January 27, 2026, the editors of the Bulletin of the Atomic Scientists moved the hands of their famous “Doomsday Clock” to 85 seconds to midnight―the closest setting, since the appearance of the clock in 1946, to nuclear annihilation. This grim appraisal h…",
    "link": "https://www.counterpunch.org/2026/02/05/on-the-road-to-nuclear-war/",
    "timestamp": "2026-02-05T06:56:18Z"
  },
  {
    "title": "Taiwan-US ties are ‘rock solid,’ the island’s president says after Trump-Xi call",
    "description": "Taiwan’s ties with the United States are “rock solid,” the island’s president said Thursday, hours after President Donald Trump and Chinese leader Xi Jinping spoke on the phone, including about the self-ruled island’s future",
    "link": "https://abcnews.go.com/International/wireStory/taiwan-us-ties-rock-solid-islands-president-after-129871760",
    "timestamp": "2026-02-05T06:54:56Z"
  },
  {
    "title": "Intelligence director Tulsi Gabbard’s office obtained and tested voting machines in Puerto Rico - CNN",
    "description": "Intelligence director Tulsi Gabbard’s office obtained and tested voting machines in Puerto RicoCNN Exclusive: US spy chief's office investigated voting machines in Puerto RicoReuters Tulsi Gabbard reportedly oversaw probe of Puerto Rico voting machines last y…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180733298",
    "timestamp": "2026-02-05T06:52:15Z"
  },
  {
    "title": "The Key Sticking Points To A US-Iran Deal Aimed At Averting War",
    "description": "White House special envoy Steve Witkoff and Iranian Foreign Minister Abbas Araqchi will meet on February 6 in a last-ditch attempt to strike a deal aimed at averting war.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260204-rferl01.htm",
    "timestamp": "2026-02-05T06:52:02Z"
  },
  {
    "title": "Top US news anchor pleads with kidnappers for mom’s life",
    "description": "US news anchor Savannah Guthrie tearfully pleads with kidnappers for proof of life after her 84-year-old mother, Nancy, was abducted from her Arizona home.\n\nRead More: https://punchng.com/top-us-news-anchor-pleads-with-kidnappers-for-moms-life/",
    "link": "https://punchng.com/top-us-news-anchor-pleads-with-kidnappers-for-moms-life/",
    "timestamp": "2026-02-05T06:42:14Z"
  },
  {
    "title": "비트코인 → 금 → 은 → 주식 → 환율 연타 맞고 뻗어",
    "description": "In a tense exchange during testimony before the House Financial Services Committee, US Representative Maxine Waters, a California Democrat, questions Treasury Secretary Scott Bessent about the inflationary impact of tariffs https://t.co/J0PTHjgwKu pic.twitter…",
    "link": "https://ryueyes11.tistory.com/512081",
    "timestamp": "2026-02-05T06:40:14Z"
  },
  {
    "title": "South Africa’s trade minister heads to China, seeking duty-free export access",
    "description": "JOHANNESBURG, Feb 5 (Reuters) - South Africa’s trade minister Parks Tau will travel to China from Thursday to Saturday to sign the China–Africa Economic Partnership Agree… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/south-africa-s-trade-minister-heads-to-china-seeking-duty-free-export-access",
    "timestamp": "2026-02-05T06:38:41Z"
  },
  {
    "title": "Trump’s Climate Policy Rollback Plan Relies on EPA Rescinding its 2009 Endangerment Finding, But Will Courts Allow It?",
    "description": "In 2009, the U.S. Environmental Protection Agency formally declared that greenhouse gas emissions, including from vehicles and fossil fuel power plants, endanger public health and welfare. The decision, known as the endangerment finding, was based on years of…",
    "link": "https://www.counterpunch.org/2026/02/05/trumps-climate-policy-rollback-plan-relies-on-epa-rescinding-its-2009-endangerment-finding-but-will-courts-allow-it/",
    "timestamp": "2026-02-05T06:36:26Z"
  },
  {
    "title": "Japan’s new prime minister is surfing a wave of popularity – can it last?",
    "description": "Excitement around Sanae Takaichi is a domestic phenomenon, but the ramifications of Sunday’s elections will be global",
    "link": "https://www.irishtimes.com/world/asia-pacific/2026/02/05/japans-new-prime-minister-is-surfing-a-wave-of-popularity-can-it-last/",
    "timestamp": "2026-02-05T06:34:41Z"
  },
  {
    "title": "EU and US look to reduce dependence on China",
    "description": "Near-monopoly on many critical minerals gives China powerful lever in trade disputes",
    "link": "https://www.irishtimes.com/world/2026/02/05/while-xi-and-trump-talk-us-and-eu-explore-ways-to-reduce-dependence-on-china/",
    "timestamp": "2026-02-05T06:30:00Z"
  },
  {
    "title": "China Trader Who Made $3 Billion On Gold Bets Big Against Silver",
    "description": "Bians big short comes with significant risk, and he has been forced to liquidate some positions at a loss in a volatile silver market.",
    "link": "https://www.ndtvprofit.com/markets/chinese-billionaire-trader-who-made-3-billion-on-gold-bets-big-against-silver-10950046",
    "timestamp": "2026-02-05T06:20:50Z"
  },
  {
    "title": "Moore meets with Mutfwang, pledges US support to protect Nigerian Christians",
    "description": "United States Congressman Riley Moore has met with the Governor of Plateau State, Caleb Mutfwang. The duo met during Mutfwang’s trade and security mission to the United States, where the US lawmaker pledged America’s continued support in addressing security a…",
    "link": "https://thechronicle.com.gh/moore-meets-with-mutfwang-pledges-us-support-to-protect-nigerian-christians/",
    "timestamp": "2026-02-05T06:19:04Z"
  },
  {
    "title": "Trump suggests 'softer touch' needed on immigration",
    "description": "U.S. President Donald Trump suggested Wednesday that a \"softer touch\" may be needed on immigration, as his administration said 700 federal officers would be pulled from Minnesota but that mass deportations would not stop.",
    "link": "https://www.hurriyetdailynews.com/trump-suggests-softer-touch-needed-on-immigration-218613",
    "timestamp": "2026-02-05T06:12:23Z"
  },
  {
    "title": "Indonesia to play balancing role in Trump's Board of Peace",
    "description": "Indonesia&rsquo;s inclusion in the Board of Peace (BoP), initiated by U.S. President Donald Trump, will position the country as a balancing power among major ...",
    "link": "https://en.antaranews.com/news/403014/indonesia-to-play-balancing-role-in-trumps-board-of-peace",
    "timestamp": "2026-02-05T06:10:25Z"
  },
  {
    "title": "Morning Rundown: The main headlines, best video and what will shape today's news",
    "description": "For more on this morning's main stories, listen to Cheat Sheet with Sophy Ridge and Wilfred Frost. For live updates throughout the day, download the Sky News app and follow us on WhatsApp.",
    "link": "https://news.sky.com/story/morning-rundown-starmer-warned-he-could-fall-iran-us-talks-to-begin-and-crotch-enhancements-13503918",
    "timestamp": "2026-02-05T06:05:00Z"
  },
  {
    "title": "Finn McRedmond: It’s ironic how it took a Corkman to teach UK’s Labour to sound like English patriots",
    "description": "It has been helpful for Ireland, too. But Morgan McSweeney’s reign could be coming to screeching halt",
    "link": "https://www.irishtimes.com/opinion/2026/02/05/finn-mcredmond-its-ironic-how-it-took-a-corkman-to-teach-uks-labour-to-sound-like-english-patriots/",
    "timestamp": "2026-02-05T06:00:01Z"
  },
  {
    "title": "French diplomats try out a new social media strategy: Mock the trolls",
    "description": "Europe letter: French foreign ministry ‘ups the volume’ in new combative response to online attacks",
    "link": "https://www.irishtimes.com/world/europe/2026/02/05/french-diplomats-try-out-a-new-social-media-strategy-mock-the-trolls/",
    "timestamp": "2026-02-05T06:00:01Z"
  },
  {
    "title": "A Kerryman in California: America thinks it’s a beacon for freedom. Freedom from what exactly? Reality?",
    "description": "I’ve seen more than three decades of shootings, assassinations, riots, wars and ‘thoughts and prayers’ in my time here",
    "link": "https://www.irishtimes.com/abroad/2026/02/05/a-kerryman-in-california-america-thinks-its-a-beacon-for-freedom-freedom-from-what-exactly-reality/",
    "timestamp": "2026-02-05T06:00:00Z"
  },
  {
    "title": "Venezuela defies U.S., vows continued alliance with Russia and China",
    "description": "Venezuela defiantly asserts its sovereign right to maintain alliances with Russia and China. Its ambassador to Moscow declared that no outside power can dictate Venezuela’s international relations. Venezuela also assured China that their critical oil and inve…",
    "link": "https://www.naturalnews.com/2026-02-05-venezuela-defies-us-vows-alliance-russia-china.html",
    "timestamp": "2026-02-05T06:00:00Z"
  },
  {
    "title": "Norway votes to RETAIN monarchy despite royal scandals",
    "description": "The Norwegian Parliament rejected a proposal to abolish the monarchy (141-26 vote), citing its role as a stabilizing institution above partisan politics. Newly released Epstein documents reveal extensive communications between Crown Princess Mette-Marit’ and …",
    "link": "https://www.naturalnews.com/2026-02-05-norway-votes-retain-monarchy-despite-royal-scandals.html",
    "timestamp": "2026-02-05T06:00:00Z"
  },
  {
    "title": "A stark red line: Moscow threatens to target western troops in Ukraine",
    "description": "Russia warns any Western troops deployed to Ukraine, even post-ceasefire, will be considered “legitimate combat targets.” The warning follows a UK-France-led declaration to form a multinational force for Ukraine after a potential peace deal. Moscow condemns t…",
    "link": "https://www.naturalnews.com/2026-02-05-moscow-threatens-to-target-western-troops-ukraine.html",
    "timestamp": "2026-02-05T06:00:00Z"
  },
  {
    "title": "Gold and silver markets in TURMOIL as Trump’s Fed nominee triggers historic sell-off",
    "description": "A major sell-off in gold and silver was triggered by President Trump’s nomination of Kevin Warsh as Federal Reserve chair, causing gold to drop 8% and silver 7% on Feb. 2, following a historic 30% crash in silver on Friday. The sell-off was driven by three ke…",
    "link": "https://www.naturalnews.com/2026-02-05-metals-markets-turmoil-over-trump-fed-nominee.html",
    "timestamp": "2026-02-05T06:00:00Z"
  },
  {
    "title": "Melinda Gates breaks silence on Bill Gates’ Epstein ties: “Unbelievable sadness” amid explosive allegations",
    "description": "Melinda Gates cited Bill’s “multiple affairs” and his ties to Jeffrey Epstein as key reasons for their divorce, expressing deep personal pain and betrayal. A leaked 2013 Epstein email alleges Bill Gates contracted an STI from encounters involving “Russian gir…",
    "link": "https://www.naturalnews.com/2026-02-05-melinda-gates-unbelievable-sadness-amid-explosive-allegations.html",
    "timestamp": "2026-02-05T06:00:00Z"
  },
  {
    "title": "Bitcoin plunge continues, erasing gains since Trump’s election",
    "description": "The world's most popular cryptocurrency has fallen nearly 20 percent in value since the start of 2026.",
    "link": "https://www.aljazeera.com/economy/2026/2/5/bitcoin-plunge-continues-erasing-gains-since-trumps-election",
    "timestamp": "2026-02-05T05:57:56Z"
  },
  {
    "title": "Democrat victory in Republican stronghold could spell trouble for Trump",
    "description": "The US has been gripped by cold weather in recent weeks, but pundits say it is in Texas where hell has truly frozen over. A blue wave just swept a GOP stronghold, and Republicans are very worried.",
    "link": "https://www.abc.net.au/news/2026-02-05/texas-special-runoff-election-results/106308914",
    "timestamp": "2026-02-05T05:54:36Z"
  },
  {
    "title": "White House adviser Michael Kratsios to lead US delegation to India's AI Impact Summit",
    "description": "Michael Kratsios, assistant to US President Donald Trump and director of the White House Office of Science and Technology Policy, will lead the US delegation to India's AI Impact Summit in New Delhi. The Global South's first major AI summit will focus on peop…",
    "link": "https://economictimes.indiatimes.com/tech/technology/white-house-adviser-michael-kratsios-to-lead-us-delegation-to-indias-ai-impact-summit/articleshow/127923570.cms",
    "timestamp": "2026-02-05T05:47:57Z"
  },
  {
    "title": "Today show host Savannah Guthrie asks for proof her mother is alive",
    "description": "The Today show host releases a video on Instagram asking for proof her mother is still alive.",
    "link": "https://www.abc.net.au/news/2026-02-05/savannah-guthrie-asks-kidnappers-for-proof-of-life-of-mother/106309080",
    "timestamp": "2026-02-05T05:44:26Z"
  },
  {
    "title": "ECB to Hold Rates Steady Despite Global Strains: Decision Guide",
    "description": "The European Central Bank is set to hold interest rates steady for a fifth meeting, judging that the latest bout of global tensions and euro strength haven’t thrown the economy off course yet.",
    "link": "https://financialpost.com/pmn/business-pmn/ecb-to-hold-rates-steady-despite-global-strains-decision-guide",
    "timestamp": "2026-02-05T05:41:17Z"
  },
  {
    "title": "Iran, US to hold nuclear talks Friday in Oman, says Iranian foreign minister",
    "description": "The announcement came after hours of indications that the anticipated talks were faltering over changes in the format and content of the talks",
    "link": "https://www.thehindubusinessline.com/news/world/iran-us-to-hold-nuclear-talks-friday-in-oman-says-iranian-foreign-minister/article70594295.ece",
    "timestamp": "2026-02-05T05:35:27Z"
  },
  {
    "title": "U.S. proposes critical minerals trade bloc aimed at countering China’s grip",
    "description": "The U.S. is mobilizing allies into a preferential trade bloc for critical minerals as part of efforts to counter China's dominance in the market.",
    "link": "https://www.cnbc.com/2026/02/05/us-allies-critical-minerals-price-floors-forge-china-rare-earths-ai-chips-pax-silicchina-.html",
    "timestamp": "2026-02-05T05:34:59Z"
  },
  {
    "title": "Ishaan Tharoor: Why using strong-arm tactics to prey on smaller nations will only weaken US in the long run",
    "description": "The impact of the slashing of foreign aid by US president Donald Trump can be measured in human lives. The dismantling a year ago of USAID, America’s key humanitarian agency, rocked the international humanitarian system and the supply of critical aid to some …",
    "link": "https://www.independent.ie/opinion/comment/ishaan-tharoor-why-using-strong-arm-tactics-to-prey-on-smaller-nations-will-only-weaken-us-in-the-long-run/a1224724604.html",
    "timestamp": "2026-02-05T05:30:00Z"
  },
  {
    "title": "Letters: Shame on all those hiding truth about Jeffrey Epstein and his political affiliations",
    "description": "Who would want to be a president, lord, ambassador or member of royalty, given the revelations from the US Department of Justice, which released more Epstein files that expose the good and the great and their sordid associations and pecadilloes with a serial …",
    "link": "https://www.independent.ie/opinion/letters/letters-shame-on-all-those-hiding-truth-about-jeffrey-epstein-and-his-political-affiliations/a438052740.html",
    "timestamp": "2026-02-05T05:30:00Z"
  },
  {
    "title": "Trump discusses Iran with Xi in attempt to further isolate Tehran",
    "description": "US president Donald Trump said yesterday that he and Chinese president Xi Jinping discussed the situation in Iran in a wide-ranging call as the US administration pushes Beijing and others to further isolate Tehran.",
    "link": "https://www.independent.ie/world-news/north-america/trump-discusses-iran-with-xi-in-attempt-to-further-isolate-tehran/a2028745646.html",
    "timestamp": "2026-02-05T05:30:00Z"
  },
  {
    "title": "Man sentenced to life for bid to assassinate Trump at golf club",
    "description": "Ryan Routh, the man accused of hiding in the bushes of a Florida golf course with a semi-automatic rifle to try to assassinate Donald Trump less than two months before the 2024 US election, was sentenced by a judge yesterday to life in prison.",
    "link": "https://www.independent.ie/world-news/north-america/man-sentenced-to-life-for-bid-to-assassinate-trump-at-golf-club/a494818022.html",
    "timestamp": "2026-02-05T05:30:00Z"
  },
  {
    "title": "Israeli strikes kill at least 23 Palestinians in response to soldier’s injury",
    "description": "Israeli tank shelling and airstrikes killed 23 Palestinians, including seven children, in Gaza yesterday, health officials said. It is the latest violence to undermine a truce in the enclave.",
    "link": "https://www.independent.ie/world-news/middle-east/israeli-strikes-kill-at-least-23-palestinians-in-response-to-soldiers-injury/a1469802596.html",
    "timestamp": "2026-02-05T05:30:00Z"
  },
  {
    "title": "America seeks to set up vital minerals trade bloc, in bid to counter Chinese dominance",
    "description": "US vice president JD Vance yesterday unveiled plans to marshal countries into a preferential trade bloc for critical minerals, proposing coordinated price floors as Washington escalates efforts to loosen China’s grip on materials crucial to advanced manufactu…",
    "link": "https://www.independent.ie/business/world/america-seeks-to-set-up-vital-minerals-trade-bloc-in-bid-to-counter-chinese-dominance/a537554393.html",
    "timestamp": "2026-02-05T05:30:00Z"
  },
  {
    "title": "Ukraine, Russia, US to start second day of war talks",
    "description": "Ukraine, Russia and the United States will start a second day of talks in Abu Dhabi on Thursday, seeking to end Moscow's nearly four-year invasion.",
    "link": "https://www.hurriyetdailynews.com/ukraine-russia-us-to-start-second-day-of-war-talks-218609",
    "timestamp": "2026-02-05T05:28:10Z"
  },
  {
    "title": "Russia will continue to supply oil to Cuba, RIA cites ambassador",
    "description": "MOSCOW, Feb 5 (Reuters) - Russia has repeatedly supplied oil to Cuba in recent years, and will continue to do so, Russia’s ambassador to Cuba Viktor Coronelli said in an … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/russia-will-continue-to-supply-oil-to-cuba-ria-cites-ambassador",
    "timestamp": "2026-02-05T05:25:24Z"
  },
  {
    "title": "Bullion bloodbath again: 3 reasons why gold, silver prices are crashing and should you buy the fear?",
    "description": "Precious metals suffered a brutal selloff on Thursday, with silver plunging nearly 17% in Asian trade and Indian ETFs collapsing up to 21% as a stronger dollar and easing geopolitical tensions shattered the months-long rally. Gold prices also tumbled, leaving…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/bullion-bloodbath-again-3-reasons-why-gold-silver-prices-are-crashing-and-should-you-buy-the-fear/articleshow/127924265.cms",
    "timestamp": "2026-02-05T05:23:23Z"
  },
  {
    "title": "Last US-Russia nuclear treaty ends in 'grave moment' for world",
    "description": "The last nuclear treaty between Russia and the United States expired Thursday, abruptly ending decades of restrictions on how many warheads the two top powers can deploy and triggering fears of a global arms race.",
    "link": "https://www.hurriyetdailynews.com/last-us-russia-nuclear-treaty-ends-in-grave-moment-for-world-218608",
    "timestamp": "2026-02-05T05:23:03Z"
  },
  {
    "title": "'Naked Corruption': Trump Ripped After Bragging He 'Won A Lot Of Money' From Taxpayers",
    "description": "Trump claimed he would give the money to charity, but his critics aren't buying it.",
    "link": "https://www.huffpost.com/entry/trump-irs-lawsuit-won_n_69840634e4b0926afe6ac951",
    "timestamp": "2026-02-05T05:21:08Z"
  },
  {
    "title": "China's Xi, Russia's Putin discuss their growing links, ties with US and global crises",
    "description": "Many of America's closest partners are exploring opportunities with China following clashes with President Donald Trump over tariffs and his demands to take over Greenland from NATO ally Denmark",
    "link": "https://www.thehindubusinessline.com/news/world/chinas-xi-russias-putin-discuss-their-growing-links-ties-with-us-and-global-crises/article70594291.ece",
    "timestamp": "2026-02-05T05:20:22Z"
  },
  {
    "title": "Ramadan Calendar 2026: Know Sehri and Iftar Timings",
    "description": "Ramadan 2026 is set to commence in India around February 19th, marking a month of spiritual reflection and fasting from sunrise to sunset for Muslims worldwide. This sacred period, steeped in history with the revelation of the Quran, emphasizes self-disciplin…",
    "link": "https://timesofindia.indiatimes.com/religion/festivals/ramadan-calendar-2026-know-sehri-and-iftar-timings/articleshow/127923445.cms",
    "timestamp": "2026-02-05T05:19:08Z"
  },
  {
    "title": "CTET 2026: CBSE issues guidelines for PwD candidates seeking scribe facility, notice here",
    "description": "CTET 2026 candidates with disabilities can now avail scribe and compensatory time facilities, as per CBSE's latest notice. Eligibility is determined by the RPWD Act, 2016, requiring specific certificates. Visually impaired candidates will receive large-print …",
    "link": "https://timesofindia.indiatimes.com/education/news/ctet-2026-cbse-issues-guidelines-for-pwd-candidates-seeking-scribe-facility-notice-here/articleshow/127924331.cms",
    "timestamp": "2026-02-05T05:18:47Z"
  },
  {
    "title": "‘The Daily Show’ Rips Trump’s ‘Construction Fetish’ as Epstein Files Questions Linger | Video",
    "description": "Host Michael Kosta also slams the president's \"messed up\" comment to Kaitlan Collins\nThe post ‘The Daily Show’ Rips Trump’s ‘Construction Fetish’ as Epstein Files Questions Linger | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/industry-news/business/the-daily-show-reacts-trump-construction-projects-epstein-files-sidestep/",
    "timestamp": "2026-02-05T05:13:57Z"
  },
  {
    "title": "Xi says ready to work with Trump to steer giant ship of China-U.S. ties steadily forward",
    "description": "Chinese President Xi Jinping said on Wednesday that he hopes to work with U.S. President Donald Trump in the new year to steer the giant ship of China-U.S. relations steadily forward through wind and storms, and accomplish more big things and good things.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2026/02/china-260205-prc-mnd01.htm",
    "timestamp": "2026-02-05T05:12:57Z"
  },
  {
    "title": "Voter swings raise midterm alarm bells for US Republicans",
    "description": "\"Today is the day!\" US President Donald Trump wrote on Truth Social, urging followers in Texas to \"GET OUT AND VOTE\" for the \"phenomenal\" Republican candidate in a state senate race.",
    "link": "https://www.rte.ie/news/world/2026/0205/1556841-us-election-change/",
    "timestamp": "2026-02-05T05:11:31Z"
  },
  {
    "title": "Iran-US talks back on, as Trump warns supreme leader",
    "description": "Iran and the United States said Wednesday they were going ahead with nuclear talks in Oman later this week, even as President Donald Trump piled pressure on Tehran's supreme leader by saying he should be \"very worried.\"",
    "link": "https://www.hurriyetdailynews.com/iran-us-talks-back-on-as-trump-warns-supreme-leader-218606",
    "timestamp": "2026-02-05T05:10:41Z"
  },
  {
    "title": "Read the extended transcript: President Donald Trump interviewed by 'NBC Nightly News' anchor Tom Llamas (NBC News)",
    "description": "NBC News:\nRead the extended transcript: President Donald Trump interviewed by ‘NBC Nightly News’ anchor Tom Llamas  —  Trump spoke about immigration, the Fed, artificial intelligence, the economy and more in the February 2026 interview.  — Add NBC News to Goo…",
    "link": "https://www.memeorandum.com/260205/p1",
    "timestamp": "2026-02-05T05:10:01Z"
  },
  {
    "title": "Prime Minister of Armenia, President of Azerbaijan meet in Abu Dhabi",
    "description": "On February 4, the Prime Minister of the Republic of Armenia, Nikol Pashinyan, met with the President of the Republic of Azerbaijan, Ilham Aliyev, in Abu Dhabi, United Arab Emirates.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260204-armenia-pm01.htm",
    "timestamp": "2026-02-05T05:08:55Z"
  },
  {
    "title": "What will a rebuilt Gaza look like? The competing visions for the Strip’s future",
    "description": "the Phoenix plan and the other Arab-led visions are at least a step forward.",
    "link": "https://www.juancole.com/2026/02/rebuilt-competing-visions.html",
    "timestamp": "2026-02-05T05:08:14Z"
  },
  {
    "title": "House probe targets WLFI after report of $500 Million UAE stake",
    "description": "Congressional investigators seek ownership records, payment trails and stablecoin documents from the Trump-linked crypto firm following reports of Emirati backing and its USD1 token’s role in a $2 Billion Binance transaction",
    "link": "https://www.coindesk.com/policy/2026/02/05/house-probe-targets-wlfi-after-report-of-usd500-million-uae-stake",
    "timestamp": "2026-02-05T05:05:09Z"
  },
  {
    "title": "US Olympic officials change name of hospitality space from ‘Ice House’ after protests",
    "description": "The venue has been billed by the United States Olympic and Paralympic Committee (USOPC) as an \"athlete-first space.\"",
    "link": "https://nypost.com/2026/02/05/sports/us-winter-olympic-officials-change-name-of-hospitality-space-from-ice-house-after-protests/",
    "timestamp": "2026-02-05T05:01:46Z"
  },
  {
    "title": "Megyn Kelly Gives Kaitlan Collins Advice From Roger Ailes, Whom Kelly Accused of Sexual Harassment",
    "description": "Megyn Kelly defended President Donald Trump against charges of sexism by favorably citing serial sexual harasser Roger Ailes, whom Kelly accused of making unwelcome sexual advances. \nThe post Megyn Kelly Gives Kaitlan Collins Advice From Roger Ailes, Whom Kel…",
    "link": "https://www.mediaite.com/media/you-have-to-smile-megyn-kelly-gives-kaitlan-collins-advice-from-roger-ailes-whom-kelly-accused-of-sexual-harassment/",
    "timestamp": "2026-02-05T04:58:50Z"
  },
  {
    "title": "UN warns of humanitarian collapse in Cuba as US seeks to block oil supplies",
    "description": "Warning comes as US threatens tariffs on any country that supplies oil to the Caribbean island.",
    "link": "https://www.aljazeera.com/news/2026/2/5/un-warns-of-humanitarian-collapse-in-cuba-as-us-seeks-to-block-oil-supplies",
    "timestamp": "2026-02-05T04:57:53Z"
  },
  {
    "title": "EU rethinks climate diplomacy after bruising COP30 summit, document shows",
    "description": "The 27-country EU is now assessing how to strengthen ⁠its strategy for future negotiations by using its trade, finance and development leverage in climate talks",
    "link": "https://www.thehindubusinessline.com/news/world/eu-rethinks-climate-diplomacy-after-bruising-cop30-summit-document-shows/article70594267.ece",
    "timestamp": "2026-02-05T04:55:42Z"
  },
  {
    "title": "China’s Xi Presses Trump on Taiwan in Phone Call - The New York Times",
    "description": "China’s Xi Presses Trump on Taiwan in Phone CallThe New York Times China's Xi reasserts Taiwan stance in call with Trump, while U.S. president pushes tradeCNBC Trump, Xi discuss Taiwan and soybeans in call aimed at easing China, US relationsReuters Donald Tru…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180733026",
    "timestamp": "2026-02-05T04:52:22Z"
  },
  {
    "title": "President Xi Jinping Speaks with U.S. President Donald J. Trump on the Phone",
    "description": "On the evening of February 4, 2026, President Xi Jinping spoke with U.S. President Donald J. Trump on the phone.",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2026/02/china-260204-prc-mofa01.htm",
    "timestamp": "2026-02-05T04:49:51Z"
  },
  {
    "title": "Ryan Wesley Routh Sentenced to Life in Prison for Attempted Assassination of President Donald J. Trump and Assault of a Federal Law Enforcement Officer",
    "description": "Today, Ryan Wesley Routh, 59, was sentenced to life plus 84 months in federal prison for the attempted assassination of then-presidential candidate Donald J. Trump and related violent and firearms offenses. U.S. District Judge Aileen M. Cannon for the Souther…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260204-doj01.htm",
    "timestamp": "2026-02-05T04:49:13Z"
  },
  {
    "title": "Trump Warns of 'Very Bad Things' If Iran Restarts Nuclear Program",
    "description": "President Donald Trump said he had heard Iran may be trying to restart its nuclear program, and warned that if it does, the US would “send them right back” and “do their job again.”",
    "link": "https://sputnikglobe.com/20260205/trump-warns-of-very-bad-things-if-iran-restarts-nuclear-program-1123591873.html",
    "timestamp": "2026-02-05T04:47:07Z"
  },
  {
    "title": "Oil falls 2% on easing supply concern after US, Iran agree to talks",
    "description": "Oil prices dipped as the U.S. and Iran agreed to hold talks in Oman, easing immediate fears of supply disruptions. Despite this, significant differences remain between the two nations regarding discussion topics, suggesting potential for renewed geopolitical …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-falls-2-on-easing-supply-concern-after-us-iran-agree-to-talks/articleshow/127923838.cms",
    "timestamp": "2026-02-05T04:45:17Z"
  },
  {
    "title": "Silver’s 17% plunge reignites market behaviour that once topped bitcoin liquidations",
    "description": "It is the same setup Michael Burry warned about this week, when he said falling crypto collateral can force metal selling in a feedback loop.",
    "link": "https://www.coindesk.com/markets/2026/02/05/silver-s-17-plunge-reignites-market-behaviour-that-once-topped-bitcoin",
    "timestamp": "2026-02-05T04:45:06Z"
  }
]