[
  {
    "title": "Wall Street selloff caps brutal week for markets as Trump tariffs rattle investors",
    "description": "Slumps on S&P 500, Dow and Nasdaq cap dismal day for global indices but US president doubles down on tariff plan\nWall Street suffered its worst week since the onset of the Covid-19 crisis five years ago as investors worldwide balked at Donald Trump’s risky bi…",
    "link": "https://biztoc.com/x/e0e0a7c8aac948e1",
    "timestamp": "2025-04-04T22:34:19Z"
  },
  {
    "title": "We just declared a trade war with the world",
    "description": "Nice economy you have there, said President Donald Trumpâ\u0080\u0099s administration. It would be a shame if something happened to it. The something, announced earlier this week, is a set of globally applied tariffs that make no sense on their face. No sane economist …",
    "link": "https://www.theverge.com/business/643970/trade-war-consequences-crazy",
    "timestamp": "2025-04-04T22:34:17Z"
  },
  {
    "title": "Tariffs Cause Another Stock Market Rout—Losses Approach $5 Trillion As Dow Plummets Another 2,200 Points - Forbes",
    "description": "Tariffs Cause Another Stock Market Rout—Losses Approach $5 Trillion As Dow Plummets Another 2,200 PointsForbes Live Updates: U.S. Job Report Shows Strong Growth Amid Trump Tariff FearsThe New York Times Donald Trump's tariffs have shaken the markets - how wor…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176928137",
    "timestamp": "2025-04-04T22:32:53Z"
  },
  {
    "title": "Cramer's week ahead: Banks kick off critical earnings season",
    "description": "After President Donald Trump's tariffs crushed stocks, CNBC's Jim Cramer said next week's earnings will provide a look at how CEOs are dealing with the fallout.",
    "link": "https://www.cnbc.com/2025/04/04/cramers-week-ahead-banks-kick-off-critical-earnings-season.html",
    "timestamp": "2025-04-04T22:32:43Z"
  },
  {
    "title": "Conan O’Brien explains why he went to the Kennedy Center for the Mark Twain Award | CNN",
    "description": "Conan O’Brien is opening up about his decision to honor a commitment he made to receive the Mark Twain Prize for American Humor at the Kennedy Center for Performing Arts.",
    "link": "https://www.cnn.com/2025/04/04/entertainment/conan-obrien-kennedy-center/index.html",
    "timestamp": "2025-04-04T22:31:37Z"
  },
  {
    "title": "FAIR: The Resistance Will Not Be Televised",
    "description": "If you relied on articles and broadcasts from the legacy national news media during early 2025, you wouldn’t know the extent of grassroots action.",
    "link": "https://fair.org/home/the-resistance-will-not-be-televised/",
    "timestamp": "2025-04-04T22:30:04Z"
  },
  {
    "title": "Trump Administration Cuts CDC's IVF Maternal Health Research",
    "description": "The departments were eliminated despite Trump's proclamations that he is the \"father of IVF.\"",
    "link": "https://www.huffpost.com/entry/trump-ivf-cdc-cuts-maternal-health_n_67f04e2ee4b0819fd435d372",
    "timestamp": "2025-04-04T22:29:28Z"
  },
  {
    "title": "The Trump Justice Department keeps hitting a roadblock: The rule of law",
    "description": "The dismissal of the Eric Adams case was the latest blow in court for the Trump administration, which keeps bumping into the rule of law.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/eric-adams-alina-habba-alien-enemies-act-deadline-newsletter-rcna199777",
    "timestamp": "2025-04-04T22:29:16Z"
  },
  {
    "title": "Crypto stocks down, IPOs punted amid tariff tumult",
    "description": "Cryptocurrency firms felt the heat from US President Donald Trump’s sweeping tariff rollout this week as market turbulence sent share prices tumbling and foiled initial public offering (IPO) plans. From exchanges to Bitcoin (BTC) miners, crypto stocks suffere…",
    "link": "https://cointelegraph.com/news/crypto-stocks-down-ipos-punted-amid-tariff-tumult",
    "timestamp": "2025-04-04T22:28:06Z"
  },
  {
    "title": "Trump’s TikTok delay is ‘against the law’ top Senate Intelligence Democrat says",
    "description": "President Donald Trump’s additional 75 day delay to TikTok’s sale-or-ban deadline leaves service providers like Apple, Google, and Oracle on shaky ground, and, according to one influential Democrat, is straight-up “against the law.” After Trump announced the …",
    "link": "https://www.theverge.com/news/643964/tiktok-trump-ban-delay-warner-congress-response",
    "timestamp": "2025-04-04T22:27:47Z"
  },
  {
    "title": "Judge Boasberg Laying Foundation to Hold Trump Administration in Contempt of Court",
    "description": "A federal judge appears ready to hold the Trump administration in contempt because it may not have done as he ordered it to do.",
    "link": "https://www.westernjournal.com/judge-boasberg-laying-foundation-hold-trump-administration-contempt-court/",
    "timestamp": "2025-04-04T22:27:38Z"
  },
  {
    "title": "Houthis 'Laughing Out Loud' at Claims Iran Leaving Yemen Amid US 'Failure'",
    "description": "\"The matter does not require denial, but rather laughing out loud,\" a senior Ansar Allah official told Newsweek.",
    "link": "https://www.newsweek.com/houthis-laughing-out-loud-claims-iran-leaving-yemen-amid-us-failure-2055714",
    "timestamp": "2025-04-04T22:27:15Z"
  },
  {
    "title": "Retailers Rush to the Tariff War Room, But Wait to See What Comes Next",
    "description": "Fashion retailers face uncertainty as Trump's tariffs reshape global trade. Leaders plan strategies to manage costs and consumer challenges.",
    "link": "http://wwd.com/business-news/financial/retailers-trump-tariff-trade-impact-1237075048/",
    "timestamp": "2025-04-04T22:26:05Z"
  },
  {
    "title": "Big Law's biggest players are absent from brief opposing Trump's attacks on law firms",
    "description": "None of America's top-earning corporate law firms signed on to oppose Donald Trump's executive orders targeting one of their peers.",
    "link": "https://www.businessinsider.com/trump-big-law-firms-didnt-sign-perkins-coie-brief-2025-4",
    "timestamp": "2025-04-04T22:25:52Z"
  },
  {
    "title": "House Democrats Slammed for Supporting Tariffs 'If Done Right' As Market Plunges: 'We're Being Governed By Morons'",
    "description": "As markets reel from Trump's newly imposed tariffs, Democrats are facing backlash after releasing a video backing tariffs — so long as they're \"done right.\"",
    "link": "https://www.ibtimes.com/house-democrats-slammed-supporting-tariffs-if-done-right-market-plunges-were-being-governed-3768889",
    "timestamp": "2025-04-04T22:25:45Z"
  },
  {
    "title": "US stock market today: Wall St tailspin worsens as S&P 500 plunges six per cent in wake of Trump tariffs",
    "description": "US stock market today: Wall St tailspin worsens as S&P 500 plunges six per cent in wake of Trump tariffsthenightly.com.au",
    "link": "https://thenightly.com.au/business/markets/us-stock-market-today-wall-st-tailspin-worsens-as-sp-500-plunges-six-per-cent-in-wake-of-trump-tariffs-c-18268828",
    "timestamp": "2025-04-04T22:24:09Z"
  },
  {
    "title": "Oil in Freefall Reorders Energy Landscape From US to Middle East",
    "description": "The plunge in oil prices over the past two days following the twin shocks of President Donald Trump’s tariffs and the surprise boost in production from OPEC+ has altered the global energy landscape with stunning speed.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-in-freefall-reorders-energy-landscape-from-us-to-middle-east",
    "timestamp": "2025-04-04T22:23:57Z"
  },
  {
    "title": "What are the implications of the US-China tariffs war?",
    "description": "Beijing hits back with its own set of tariffs on all US goods after Trump's latest levies.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/4/4/what-are-the-implications-of-the-us-china-tariffs-war",
    "timestamp": "2025-04-04T22:23:20Z"
  },
  {
    "title": "Donald Trump Pulls Plug on Nvidia’s (NVDA) Bullish Nirvana",
    "description": "Amid the market turmoil following Trump’s “Liberation Day” tariffs, Nvidia (NVDA) took a hit as a symbol of risk-on-stock investing and global trade. This week’s stock rout extends the GPU maker’s losses to almost 25% so far this year. While Nvidia’s long-ter…",
    "link": "https://biztoc.com/x/e5eeede878547210",
    "timestamp": "2025-04-04T22:23:07Z"
  },
  {
    "title": "Tariff concerns loom as food price hikes could be on the menu: ‘Costs will be passed along’",
    "description": "Car sales have made headlines as a potential consumer pinch-point when President Donald Trump’s global tariff plans take effect. But food prices are expected to rise as well.",
    "link": "https://www.local10.com/news/local/2025/04/04/tariff-concerns-loom-as-food-price-hikes-could-be-on-the-menu-costs-will-be-passed-along/",
    "timestamp": "2025-04-04T22:22:47Z"
  },
  {
    "title": "Why Canadians Are Better Than Americans at Protesting Trump Right Now",
    "description": "A unified movement like “Buy Canadian” is hard to find in America.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/04/buy-canadian-movement-trump-protests-america/682309/",
    "timestamp": "2025-04-04T22:22:00Z"
  },
  {
    "title": "Republican Lawmaker Ridiculed for Suggesting Ditching China's 'Cheap Goods' Will Help Families: 'Kids Don't Need Toys, They Need Tariffs'",
    "description": "Rep. Riley Moore defended Donald Trump's escalating trade war with China, claiming higher prices on imported goods will be worth it for American families.",
    "link": "https://www.ibtimes.com/republican-lawmaker-ridiculed-suggesting-ditching-chinas-cheap-goods-will-help-families-kids-3768885",
    "timestamp": "2025-04-04T22:20:02Z"
  },
  {
    "title": "Five things to know about the US$5 trillion market selloff that is roiling the globe",
    "description": "Fears over an escalating global trade war hit stocks as investors seek out safe havens from the carnage of Trump tariffs. Keep reading here.",
    "link": "https://financialpost.com/investing/five-things-about-market-selloff",
    "timestamp": "2025-04-04T22:19:15Z"
  },
  {
    "title": "Hip-Hop May Not Lose TikTok If One of These Potential Buyers Purc",
    "description": "Who's gonna buy TikTok? Continue reading…",
    "link": "https://www.xxlmag.com/tiktok-potential-buyers-ban-extended/",
    "timestamp": "2025-04-04T22:17:14Z"
  },
  {
    "title": "‘It Will Set Us Back Multiple Decades’: Why Public Health Experts Are Panicking About The HHS Overhaul",
    "description": "HHS underwent a sweeping restructuring this week, resulting in about 10,000 layoffs across various agencies. With critical programs for things like disease prevention and outbreak response already crumbling, experts believe the fallout from this decision coul…",
    "link": "https://medcitynews.com/2025/04/it-will-set-us-back-multiple-decades-why-public-health-experts-are-panicking-about-the-hhs-overhaul/",
    "timestamp": "2025-04-04T22:17:00Z"
  },
  {
    "title": "Global markets swoon as Trump heads to the golf course",
    "description": "Markets tumbled in Wall Street's worst crisis since pandemic as investors fled after China retaliated against tariffs.",
    "link": "https://www.aljazeera.com/economy/2025/4/4/global-markets-swoon-as-trump-heads-to-the-golf-course",
    "timestamp": "2025-04-04T22:15:13Z"
  },
  {
    "title": "Freshfields only large firm to sign on in support of legal fight against Donald Trump - Financial Times",
    "description": "Freshfields only large firm to sign on in support of legal fight against Donald TrumpFinancial Times More Than 500 Law Firms Back Perkins Coie in Fight With TrumpThe New York Times Munger, Tolles & Olson and Eimer Stahl File Amicus Brief on Behalf of More Tha…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176927959",
    "timestamp": "2025-04-04T22:13:35Z"
  },
  {
    "title": "Reagan, Romney, and Bush Go Viral For Past Tariff Takedowns: ‘Why Trump’s Economic Policies Will Hurt America’",
    "description": "As Reagan’s speech was shared online, so were past remarks from President George W. Bush and 2012 GOP presidential nominee Mitt Romney.\nThe post Reagan, Romney, and Bush Go Viral For Past Tariff Takedowns: ‘Why Trump’s Economic Policies Will Hurt America’ fir…",
    "link": "https://www.mediaite.com/politics/reagan-romney-and-bush-go-viral-for-past-tariff-takedowns-why-trumps-economic-policies-will-hurt-america/",
    "timestamp": "2025-04-04T22:12:08Z"
  },
  {
    "title": "How the Nintendo Switch 2 delay explains Trump’s tariffs",
    "description": "It was a big week for the global economy — and for gamers.\nOn Wednesday, President Donald Trump unveiled sweeping tariffs that have sent markets spiraling worldwide. On the same day, Nintendo also announced its much-anticipated handheld gaming console, the Sw…",
    "link": "https://biztoc.com/x/fcdf415b340e8839",
    "timestamp": "2025-04-04T22:11:42Z"
  },
  {
    "title": "Congress demands answers after Trump abruptly fires head of National Security Agency",
    "description": "President Donald Trump has abruptly fired the director of the National Security Agency, according to U.S. officials and members of Congress, but the White House and the Pentagon have provided no reasons for the move.",
    "link": "https://biztoc.com/x/6b351081e3cd4424",
    "timestamp": "2025-04-04T22:11:40Z"
  },
  {
    "title": "‘The record is voluminous … with allegations’: Trump-appointed judge slams brakes on president cutting billions in ‘critical public health funding’",
    "description": "‘The record is voluminous … with allegations’: Trump-appointed judge slams brakes on president cutting billions in ‘critical public health funding’newsbreak.com",
    "link": "https://www.newsbreak.com/share/3949090945925-the-record-is-voluminous-with-allegations-trump-appointed-judge-slams-brakes-on-president-cutting-billions-in-critical-public-health-funding?_f=app_share&pd=07OsjUTm&lang=en_US&send_time=1743804623&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.13.2.5%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v8%2Cns_foryou_blend_exp_25q1-v5%2Cns_foryou_recall_exp_25q2-v6%2Cns_local_strategy_25q1_exp-v15%2Cns_push_exp_rt_bucketv12-v5&s=i2",
    "timestamp": "2025-04-04T22:11:21Z"
  },
  {
    "title": "How the Nintendo Switch 2 delay explains Trump’s tariffs",
    "description": "It was a big week for the global economy — and for gamers. On Wednesday, President Donald Trump unveiled sweeping tariffs that have sent markets spiraling worldwide. On the same day, Nintendo also announced its much-anticipated handheld gaming console, the Sw…",
    "link": "https://www.vox.com/culture/407365/nintendo-switch-2-delay-preorder-tariff-trump-how-to",
    "timestamp": "2025-04-04T22:10:12Z"
  },
  {
    "title": "Roundup: Turkish experts say new tariffs reveal Washington's aggressiveness, unpredictability, erode global trade ties",
    "description": "ANKARA/ISTANBUL, April 4 (Xinhua) -- The new U.S. tariff policy has revealed Washington's aggressive protectionist stance and its unpredictable nature, and will erode global trade relationships and escalate global trade tensions, Turkish experts have said. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/04/05/roundup-turkish-experts-say-new-tariffs-reveal-washington039s-aggressiveness-unpredictability-erode-global-trade-ties",
    "timestamp": "2025-04-04T22:09:00Z"
  },
  {
    "title": "Markets plunge with S&P 500 down 6%, Dow down 2,200 after China retaliates against Trump tariffs",
    "description": "Wall Street’s worst crisis since COVID slammed into a higher gear, with not even better-than- expected jobs report enough to stop worries of recession.",
    "link": "https://www.pennlive.com/news/2025/04/markets-plunge-with-sp-500-down-6-dow-down-2200-after-china-retaliates-against-trump-tariffs.html",
    "timestamp": "2025-04-04T22:08:58Z"
  },
  {
    "title": "Trans activist clashes with Dr. Phil, claiming it is ‘dangerous’ to test athletes to ensure they aren’t males",
    "description": "'What you're showing me are male statistics and trans women are not males,' the transgender activist insisted.",
    "link": "https://nypost.com/2025/04/04/media/trans-activist-clashes-with-dr-phil-claiming-it-is-dangerous-to-test-athletes-to-ensure-they-arent-males/",
    "timestamp": "2025-04-04T22:08:57Z"
  },
  {
    "title": "RFK Jr.'s Full Family Tree: What to Know About the Kennedy Family",
    "description": "The Kennedy family has long been rooted in American politics. Here's what you need to know about the family tree.",
    "link": "https://www.newsweek.com/rfk-jr-kennedy-full-family-tree-explained-2055621",
    "timestamp": "2025-04-04T22:08:25Z"
  },
  {
    "title": "Vietnam Announces Anti-Dumping Tariffs on Chinese and South Korean Steel",
    "description": "The Vietnamese Trade Ministry said this week it will impose temporary anti-dumping tariffs on some galvanized steel products from China and South Korea. \nThe post Vietnam Announces Anti-Dumping Tariffs on Chinese and South Korean Steel appeared first on Breit…",
    "link": "https://www.breitbart.com/economy/2025/04/04/vietnam-announces-anti-dumping-tariffs-on-chinese-and-south-korean-steel/",
    "timestamp": "2025-04-04T22:07:24Z"
  },
  {
    "title": "Price of iPhones Could increase to $2,300 in the U.S. Due to Coming Tariffs, Says Analyst",
    "description": "U.S. President Donald Trump this week announced that steep tariffs will be applied to imports from numerous countries, including the iPhone.Read More...",
    "link": "https://www.mactrast.com/2025/04/price-of-iphones-could-increase-to-2300-in-the-u-s-due-to-coming-tariffs-says-analyst/",
    "timestamp": "2025-04-04T22:07:02Z"
  },
  {
    "title": "Columnist Quits 'Washington Post' Over Jeff Bezos' 'Significant Shift' in 'Mission'",
    "description": "Columnist Eugene Robinson has reportedly revealed to his colleagues at the Washington Post that he is quitting the newspaper due to its owner, Jeff Bezos, implementing a \"significant shift\" in the company's \"mission.\"\nThe post Columnist Quits ‘Washington Post…",
    "link": "https://www.breitbart.com/pre-viral/2025/04/04/columnist-quits-washington-post-jeff-bezos-significant-shift-mission/",
    "timestamp": "2025-04-04T22:06:40Z"
  },
  {
    "title": "FACT FOCUS: Warren Buffett did not praise Trump's recent economic policies",
    "description": "As the stock market reeled from President Donald Trump’s move to institute widespread global tariffs, Trump shared a video on Truth Social on Friday that erroneously claimed legendary investor Warren Buffet praised his recent economic policies",
    "link": "https://abcnews.go.com/US/wireStory/fact-focus-warren-buffett-praise-trumps-recent-economic-120504443",
    "timestamp": "2025-04-04T22:06:27Z"
  },
  {
    "title": "Trump Shares Video Claiming He's Crashing Stock Market on Purpose",
    "description": "As the global markets plummeted for a second consecutive day in reaction to Trump's tariffs announcement, he shared a video suggesting the crash is intentional.",
    "link": "https://www.newsweek.com/trump-shares-video-claiming-hes-crashing-stock-market-purpose-2055675",
    "timestamp": "2025-04-04T22:05:58Z"
  },
  {
    "title": "A stunning number of electric vehicle, battery factories are being canceled (Shannon Osaka/Washington Post)",
    "description": "Shannon Osaka / Washington Post:\nA stunning number of electric vehicle, battery factories are being canceled  —  Billions of dollars in clean energy projects have been canceled since Donald Trump took office again.  —  Just now  —  Over the past few years, el…",
    "link": "https://www.memeorandum.com/250404/p131",
    "timestamp": "2025-04-04T22:05:01Z"
  },
  {
    "title": "Tesla Drops Over 10%, Outpacing Market Bloodbath and Erasing $12 Billion of Musk’s Wealth in Just One Day",
    "description": "The bloodbath in the markets in the wake of President Donald Trump's new tariffs hit Elon Musk's Tesla especially hard Friday, knocking the price down over 10% and evaporating with it a chunk of the world's richest man's wealth.\nThe post Tesla Drops Over 10%,…",
    "link": "https://www.mediaite.com/news/tesla-drops-over-10-outpacing-market-bloodbath-and-erasing-12-billion-of-musks-wealth-in-just-one-day/",
    "timestamp": "2025-04-04T22:04:47Z"
  },
  {
    "title": "Trump tariffs hit Nintendo! Gamers across America are fuming after Switch 2 significant announcement",
    "description": "In an unexpected move, Nintendo announced on Friday that pre-orders for its highly anticipated new console, the Nintendo Switch 2, will not begin as planned in the United States on",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/04/05/67f0477e22601d78028b458f.html",
    "timestamp": "2025-04-04T22:04:39Z"
  },
  {
    "title": "'Did it start with F?' CNN's Tapper tries to guess Wall Street's reaction to market plunge",
    "description": "CNN's Jake Tapper began his Friday show by addressing the startling drop in the financial markets at the end of the week and the reaction of Wall Street experts. President Donald Trump said his tariff plan \"is already working,\" Tapper quoted. From the floor o…",
    "link": "https://www.rawstory.com/trump-tariffs-2671677184/",
    "timestamp": "2025-04-04T22:04:26Z"
  },
  {
    "title": "Three questions on Trump's tariffs: From the Politics Desk",
    "description": "Happy Friday, newsletter readers!",
    "link": "https://www.nbcnews.com/politics/politics-news/three-questions-trumps-tariffs-politics-desk-rcna199791",
    "timestamp": "2025-04-04T22:04:05Z"
  },
  {
    "title": "Iran is nervous about the Trump administration, but also defiant",
    "description": "President Trump will have to act soon on his threat to end Iran’s nuclear bomb program.",
    "link": "https://www.jpost.com/opinion/article-848794",
    "timestamp": "2025-04-04T22:03:55Z"
  },
  {
    "title": "Donald Trump’s Trade Parity ‘Golden Age’ Explained",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Donald Trump’s Trade Parity ‘Golden Age’ Explained appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/04/04/donald-trumps-trade-parity-golden-age-explained/",
    "timestamp": "2025-04-04T22:02:03Z"
  },
  {
    "title": "Roundup: California aims to forge its own path in global trade amid U.S. tariffs",
    "description": "SACRAMENTO, the United States, April 4 (Xinhua) -- California Governor Gavin Newsom announced a bold initiative on Friday to shield the state's economy from the impacts of the U.S. tariff policies by pursuing independent trade relationships with international…",
    "link": "https://www.thestar.com.my/news/world/2025/04/05/roundup-california-aims-to-forge-its-own-path-in-global-trade-amid-us-tariffs",
    "timestamp": "2025-04-04T22:02:00Z"
  },
  {
    "title": "MSNBC, Under Fire for Racism, Deliberately Fat-Shames Black Hosts, Analysis Finds",
    "description": "MSNBC has come under fire of late for its racist firing of Joy Reid, a proud black woman who wasn't afraid to speak her mind. Many have also criticized the alarming pay disparity between the network's prominent white hosts, such as Rachel Maddow, who makes $2…",
    "link": "https://freebeacon.com/media/msnbc-under-fire-for-racism-deliberately-fat-shames-black-hosts-analysis-finds/",
    "timestamp": "2025-04-04T22:01:22Z"
  },
  {
    "title": "The cracks in GOP support for Trump’s tariffs are already expanding",
    "description": "President Donald Trump holds up a chart while speaking during a \"Make America Wealthy Again\" trade announcement event in the Rose Garden at the White House on April 2, 2025.",
    "link": "https://biztoc.com/x/014d436655739003",
    "timestamp": "2025-04-04T22:00:57Z"
  },
  {
    "title": "Cincinnati church leaders rally in support of diversity, equity, inclusion programs",
    "description": "Cincinnati church leaders rally in support of diversity, equity, inclusion programswlwt.com",
    "link": "https://www.wlwt.com/article/cincinnati-church-leaders-support-diversity-equity-inclusion/64391256",
    "timestamp": "2025-04-04T22:00:49Z"
  },
  {
    "title": "Meghan McCain Gets Triggered By Carrie Coon After ‘White Lotus’ Star Said Former ‘View’ Co-Host Was “Gratified” For Conservative Character",
    "description": "Meghan McCain was triggered by The White Lotus star Carrie Coon after comments about the conservative character on the HBO series. The former View co-host took to social media to call out Coon over her usage of the word “gratified” in a recent interview. “Yes…",
    "link": "http://deadline.com/2025/04/meghan-mccain-triggered-carrie-coon-white-lotus-1236360097/",
    "timestamp": "2025-04-04T22:00:00Z"
  },
  {
    "title": "Jared Isaacman, Trump's pick for NASA chief, to get Senate confirmation hearing on April 9",
    "description": "Isaacman, a billionaire and private astronaut, has flown in space twice on SpaceX rockets and spacecraft.",
    "link": "https://www.space.com/space-exploration/jared-isaacman-trumps-pick-for-nasa-chief-to-get-senate-confirmation-hearing-on-april-9",
    "timestamp": "2025-04-04T22:00:00Z"
  },
  {
    "title": "Trump tariff tailspin worsens, Nasdaq tumbles 5.8% into bear market",
    "description": "The Nasdaq slid 5.82 per cent, to 15,587.79, confirming the tech-heavy index was in a bear market. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/nasdaq-confirms-it-is-in-bear-market-ending-more-than-20-below-record-close",
    "timestamp": "2025-04-04T21:58:46Z"
  },
  {
    "title": "Congress demands answers after Trump abruptly fires head of National Security Agency",
    "description": "President Donald Trump has abruptly fired the director of the National Security Agency, according to U.S. officials and members of Congress, but the White House and the Pentagon have provided no reasons for the move.",
    "link": "https://www.pbs.org/newshour/politics/congress-demands-answers-after-trump-abruptly-fires-head-of-national-security-agency",
    "timestamp": "2025-04-04T21:58:39Z"
  },
  {
    "title": "Trump in touch with India, Israel and Vietnam over trade deal talks, CNN reports",
    "description": "This comes after Prime Minister Benjamin Netanyahu talked to Trump about the tariffs.",
    "link": "https://www.jpost.com/breaking-news/article-848928",
    "timestamp": "2025-04-04T21:57:58Z"
  },
  {
    "title": "Loomer Confirms NSA Director/Cyber Command Commander 'Was Referred for Firing'",
    "description": "Laura Loomer, an investigative journalist and activist, confirmed on Friday that she \"referred\" National Security Agency/Cyber Command Commander Gen. Timothy Haugh for \"firing,\" and indicated she did so because he was handpicked by former Chairman of the Join…",
    "link": "https://www.breitbart.com/politics/2025/04/04/loomer-confirms-nsa-director-cyber-command-commander-was-referred-for-firing/",
    "timestamp": "2025-04-04T21:57:40Z"
  },
  {
    "title": "Former DNC Official-Turned-Republican Gets Put on Blast on Fox News: ‘Which Version of You Is the Real Version?’",
    "description": "Conservative radio host Wade Stotts launched a series of insults aimed at former DNC fundraising committee member Lindy Li on Fox News Friday afternoon. Li and Stotts joined The Will Cain Show to discuss topics that included tariffs and the cognitive health o…",
    "link": "https://www.mediaite.com/tv/former-dnc-official-turned-republican-gets-put-on-blast-on-fox-news-which-version-of-you-is-the-real-version/",
    "timestamp": "2025-04-04T21:54:51Z"
  },
  {
    "title": "Betts opts to join Dodgers for White House trip",
    "description": "Dodgers shortstop Mookie Betts said he will attend next week's World Series championship celebration at the White House after he declined to attend a previous ceremony with the Red Sox during President Donald Trump's first term.",
    "link": "https://www.espn.com/mlb/story/_/id/44536017/dodgers-betts-visit-white-house-saying-no-2019",
    "timestamp": "2025-04-04T21:52:23Z"
  },
  {
    "title": "Dominic LeBlanc says Trump is 'vandalizing' agreement between countries",
    "description": "U.S. President Donald Trump imposed a new 25 per cent auto tariff on Canada. Dominic LeBlanc is concerned about the reliability of the U.S. as a trading partner. One economic consultant says that Canada \"dodged a bullet\" as other countries face steeper tariff…",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/leblanc-says-trump-is-vandalizing-agreement-1.7502449",
    "timestamp": "2025-04-04T21:51:56Z"
  },
  {
    "title": "'Bad faith': Judges rip Trump administration for litigation tactics",
    "description": "Judges showed some frustration this week with how the Trump administration has been defending itself in court, with one saying it appeared to have used \"bad faith\" tactics, another accusing it of using \"disingenuous\" arguments and a third saying it was making…",
    "link": "https://www.nbcnews.com/politics/trump-administration/bad-faith-judges-rip-trump-administration-litigation-tactics-rcna199612",
    "timestamp": "2025-04-04T21:51:34Z"
  },
  {
    "title": "Trump order gives TikTok a 75-day extension after US buyer talks sour over China tariffs",
    "description": "The Chinese-owned platform was facing a ban in the US in January but Donald Trump granted an extension in order to broker new American ownership.",
    "link": "https://biztoc.com/x/6d740f556127dc83",
    "timestamp": "2025-04-04T21:49:42Z"
  },
  {
    "title": "Trump abruptly ousts the National Security Agency chief",
    "description": "President Donald Trump has abruptly fired the director of the National Security Agency, according to U.S. officials and members of Congress, but the White House and the Pentagon have provided no reasons for the move.\nSenior military leaders were informed Thur…",
    "link": "https://biztoc.com/x/c857fa0ddd79fc7f",
    "timestamp": "2025-04-04T21:49:42Z"
  },
  {
    "title": "Trump's Longtime Obsession With Trade Deficits Suggests His Tariffs Won't End Soon",
    "description": "The \"reciprocal\" tariffs that President Donald Trump announced this week are based on a flagrant fallacy: the idea that there is something inherently suspicious about trade deficits. Unlike many of the positions that Trump has adopted as a politician, this on…",
    "link": "https://biztoc.com/x/59ec9f8577792361",
    "timestamp": "2025-04-04T21:49:41Z"
  },
  {
    "title": "Billionaire Bill Ackman delivers frank 3-word message on tariff war",
    "description": "Markets sank further after China fired back at the U.S. with a sweeping 34% tariff on American goods, matching the import tax President Donald Trump imposed earlier. \nThe S&P 500 and the Nasdaq Composite both declined close to 5% on April 4. Year-to-date, the…",
    "link": "https://biztoc.com/x/96c37fc8769c41ea",
    "timestamp": "2025-04-04T21:49:35Z"
  },
  {
    "title": "Trump Claims Investors Can Get 'RICHER THAN EVER' Amid U.S. Stock Market Turmoil",
    "description": "President Donald Trump promised that his \"policies will never change\" as the market plunged following the announcement of massive tariffs.",
    "link": "https://www.huffpost.com/entry/trump-stock-market-tariff-truth_n_67f03b3ae4b06ba13d225b9d",
    "timestamp": "2025-04-04T21:49:25Z"
  },
  {
    "title": "Ten Items to Consider Buying Before Tariffs Kick In",
    "description": "These products may see prices increase once tariffs go into effect later this month.",
    "link": "https://www.newsweek.com/ten-items-consider-buying-tariffs-2055542",
    "timestamp": "2025-04-04T21:48:06Z"
  },
  {
    "title": "US stock markets continue slump as China hits back on Trump tariffs",
    "description": "Top indices see worst two-day stretch since COVID pandemic, as Fed chair warns of increased inflation and unemployment.",
    "link": "https://www.aljazeera.com/news/2025/4/4/us-stock-markets-continue-slump-as-china-hits-back-on-trump-tariffs",
    "timestamp": "2025-04-04T21:47:49Z"
  },
  {
    "title": "Trump whacks tiny agency that works to make the nation’s health care safer",
    "description": "The agency helped improve health care safety in a country where thousands die of medical errors each year.",
    "link": "https://www.bostonherald.com/2025/04/04/trump-ahrq-health-care/",
    "timestamp": "2025-04-04T21:47:04Z"
  },
  {
    "title": "China Fires Back at U.S. in Escalating Trade War",
    "description": "Beijing matches Trump’s 34 percent tariff and imposes other measures.",
    "link": "http://foreignpolicy.com/2025/04/04/china-fires-back-at-u-s-in-escalating-trade-war/",
    "timestamp": "2025-04-04T21:43:53Z"
  },
  {
    "title": "Biden’s ‘climate goals’ go down in flames by popular American beach",
    "description": "A major part of a first-of-its-kind green energy project, which the Biden administration bragged about, is now lying in ruins and polluting some of America’s beautiful ocean and seashore in Nantucket, Massachusetts.",
    "link": "https://nypost.com/2025/04/04/us-news/bidens-climate-goals-go-down-in-flames-by-popular-american-beach/",
    "timestamp": "2025-04-04T21:42:32Z"
  },
  {
    "title": "How U.S. Trade Policy With China Evolved",
    "description": "From Nixon’s overture to a full-blown trade war.",
    "link": "http://foreignpolicy.com/2025/04/04/trade-policy-trump-tariffs-economics-china/",
    "timestamp": "2025-04-04T21:41:53Z"
  },
  {
    "title": "Fact Check Friday: Did Trump endorse the Liberals? And more",
    "description": "Today's fact-check includes attacks on the Liberals and Conservatives regarding cuts, endorsements and more.",
    "link": "https://www.nationalobserver.com/2025/04/04/analysis/fact-check-friday-trump-poilievre-carney-singh",
    "timestamp": "2025-04-04T21:40:55Z"
  },
  {
    "title": "Trump's Longtime Obsession With Trade Deficits Suggests His Tariffs Won't End Soon",
    "description": "Although the president's pride in his negotiation skills could save us, it is hard to see what sort of deal would address his grievance about the consequences of economic freedom.",
    "link": "https://reason.com/2025/04/04/trumps-longtime-obsession-with-trade-deficits-suggests-his-tariffs-wont-end-soon/",
    "timestamp": "2025-04-04T21:40:44Z"
  },
  {
    "title": "China hit brakes on TikTok deal after Trump announced wide-ranging tariffs, AP Source says",
    "description": "China hit brakes on TikTok deal after Trump announced wide-ranging tariffs, AP source says\nChina hit brakes on TikTok deal after Trump announced wide-ranging tariffs, AP source says\nWEST PALM BEACH, Fla. (AP) — President Donald Trump on Friday said he is sign…",
    "link": "https://biztoc.com/x/c89daf19b013754a",
    "timestamp": "2025-04-04T21:39:04Z"
  },
  {
    "title": "Trump drops Biden's proposal for Medicare to cover obesity drugs like Wegovy and Zepbound",
    "description": "President Donald Trump on Friday dropped a Biden administration proposal to have Medicare cover obesity drugs, including popular but costly GLP-1 treatments such as Novo Nordisk's Wegovy and Eli Lilly's Zepbound.\nBut the Centers for Medicare and Medicaid Serv…",
    "link": "https://biztoc.com/x/fef81a99d9a0acfc",
    "timestamp": "2025-04-04T21:38:44Z"
  },
  {
    "title": "US defense chief to visit Panama next week: Pentagon",
    "description": "US Defense Secretary Pete Hegseth will visit Panama next week, the Pentagon said Friday, after President Donald Trump exerted significant pressure on the country to curb ties with Chinese interests.Hegseth will participate in the Central American Security Con…",
    "link": "https://www.rawstory.com/pete-hegseth-2671677236/",
    "timestamp": "2025-04-04T21:38:19Z"
  },
  {
    "title": "Trader’s $250 SOL Target In Doubt as Whales Offload Spikes",
    "description": "Crypto whales are offloading huge Solana (SOL) tokens as the aftermath of President Donald Trump’s tariffs kicks in.",
    "link": "https://zycrypto.com/traders-250-sol-target-in-doubt-as-whales-offload-spikes/",
    "timestamp": "2025-04-04T21:38:17Z"
  },
  {
    "title": "Judge orders return to US of Salvadoran man deported in error",
    "description": "A federal judge on Friday ordered the return to the United States of a Salvadoran migrant who was mistakenly deported last month to a notorious prison in El Salvador. Kilmar Abrego Garcia, 29, who was living in the eastern state of Maryland, was among a group…",
    "link": "https://www.digitaljournal.com/world/judge-orders-return-to-us-of-salvadoran-man-deported-in-error/article",
    "timestamp": "2025-04-04T21:38:16Z"
  },
  {
    "title": "New book details Obama's strained relationship with Democratic party: 'Obama destroyed that s---'",
    "description": "A new book claims that former President Barack Obama \"left the Democratic Party far weaker than he found it.\"",
    "link": "https://www.foxnews.com/politics/new-book-details-obamas-strained-relationship-democratic-party-obama-destroyed-s",
    "timestamp": "2025-04-04T21:38:09Z"
  },
  {
    "title": "Trump tariffs offer opportunity for China",
    "description": "by Shaun TANDONIn unleashing global tariffs, President Donald Trump has vowed to remake the world to benefit US workers. One beneficiary could be the country he sees as the primary adversary -- China.Asia's largest economy promptly slapped identical tariffs o…",
    "link": "https://www.rawstory.com/trump-tariffs-2671677234/",
    "timestamp": "2025-04-04T21:36:55Z"
  },
  {
    "title": "Trump's Tariffs Are Extremely Dumb, Just Not For The Reasons You Might Think",
    "description": "On April 2, Donald Trump declared a national emergency and announced sweeping tariffs\r\n on nearly all imported goods. The headlines were dramatic — tariffs on China, allies like Canada and Mexico, and everything from cars to coffee beans. His administration f…",
    "link": "https://www.commondreams.org/opinion/trump-s-tariffs-are-extremely-dumb-just-not-for-the-reasons-you-might-think",
    "timestamp": "2025-04-04T21:36:30Z"
  },
  {
    "title": "Judge Orders Return To US Of Salvadoran Man Deported In Error",
    "description": "A federal judge on Friday ordered the return to the United States of a Salvadoran migrant who was mistakenly deported last month to a notorious prison in El Salvador.",
    "link": "https://www.ibtimes.com/judge-orders-return-us-salvadoran-man-deported-error-3768888",
    "timestamp": "2025-04-04T21:36:21Z"
  },
  {
    "title": "There’s Nothing Conservative About Trump 2.0",
    "description": "The term ‘conservative’ should not be appled to Donald Trump and his MAGA movement. To an administration that regards destruction of existing institutions as  a worthty end in itself, there’s nothing worth conserving.",
    "link": "http://nymag.com/intelligencer/article/theres-nothing-conservative-about-trump-2-0.html",
    "timestamp": "2025-04-04T21:35:39Z"
  },
  {
    "title": "His way: Trump brushes off trade chaos with defiance and golf",
    "description": "by Danny KEMPDonald Trump hit the golf course ahead of a candlelight dinner Friday despite global turmoil over his tariff plans -- underscoring his desire to do things his way in an increasingly hardline second term.As he spent a long weekend at his Florida g…",
    "link": "https://www.rawstory.com/donald-trump-2671677214/",
    "timestamp": "2025-04-04T21:35:25Z"
  },
  {
    "title": "Hundreds of law firms back Perkins Coie in fight against Trump sanctions (Mark Berman/Washington Post)",
    "description": "Mark Berman / Washington Post:\nHundreds of law firms back Perkins Coie in fight against Trump sanctions  —  The largest U.S. firms did not join a court filing supporting Perkins Coie and denouncing President Trump's orders targeting firms.  —  just now  —  Mo…",
    "link": "https://www.memeorandum.com/250404/p122",
    "timestamp": "2025-04-04T21:35:01Z"
  },
  {
    "title": "President Trump Gives TikTok Another 75-Day Reprieve",
    "description": "U.S. President Donald Trump has given TikTok 75 more days to find a buyer before being banned in the United States.Read More...",
    "link": "https://www.mactrast.com/2025/04/president-trump-gives-tiktok-another-75-day-reprieve/",
    "timestamp": "2025-04-04T21:34:47Z"
  },
  {
    "title": "Shell-shocked markets brace for more tariff tumult",
    "description": "NEW YORK (Reuters) -Tariff-stunned markets face another week of potential tariff turmoil, with fallout from President Donald Trump's sweeping import levies...",
    "link": "https://finance.yahoo.com/news/shell-shocked-markets-brace-more-213414323.html",
    "timestamp": "2025-04-04T21:34:14Z"
  },
  {
    "title": "Feeling queasy about the stock market? Think twice before selling, financial advisers say",
    "description": "The huge swings rocking Wall Street and the global economy may feel far from normal. But, for investing at least, drops of this size have happened throughout history. Here's what experts advise investors young and old to consider.",
    "link": "https://www.pbs.org/newshour/economy/feeling-queasy-about-the-stock-market-think-twice-before-selling-financial-advisers-say",
    "timestamp": "2025-04-04T21:34:13Z"
  },
  {
    "title": "Trump drops Biden's proposal for Medicare to cover obesity drugs like Wegovy and Zepbound",
    "description": "The Biden administration proposal would have significantly expanded access to obesity to millions of Americans but would have cost the government billions.",
    "link": "https://www.cnbc.com/2025/04/04/trump-drops-biden-proposal-for-medicare-to-cover-obesity-drugs.html",
    "timestamp": "2025-04-04T21:34:12Z"
  },
  {
    "title": "Trump tariff tailspin worsens, Nasdaq confirms in bear market",
    "description": "NEW YORK: Wall Street nosedived for a second straight day on Friday (Apr 4), confirming the Nasdaq Composite was in a bear market and the Dow Jones Industrial Average was in a correction, as an escalating global trade war spurred the biggest losses since the …",
    "link": "https://www.channelnewsasia.com/business/trump-tariff-tailspin-worsens-nasdaq-confirms-bear-market-5045881",
    "timestamp": "2025-04-04T21:33:23Z"
  },
  {
    "title": "Trump tariffs wipe US$5 trillion off Wall Street",
    "description": "NEW YORK: Wall Street nosedived for a second straight day on Friday (Apr 4), confirming the Nasdaq Composite was in a bear market and the Dow Jones Industrial Average was in a correction, as an escalating global trade war spurred the biggest losses since the …",
    "link": "https://www.channelnewsasia.com/business/trump-tariffs-wipe-us5-trillion-wall-street-5045881",
    "timestamp": "2025-04-04T21:33:00Z"
  },
  {
    "title": "US stocks plunge, extending selloff on escalating trade war",
    "description": "The Dow Jones Industrial Average, S&P 500 and Nasdaq Composite posted their largest two-day declines since the emerging COVID-19 in 2020.",
    "link": "https://www.channelnewsasia.com/business/trump-tariffs-wall-street-selloff-financial-markets-5045881",
    "timestamp": "2025-04-04T21:33:00Z"
  },
  {
    "title": "Fox News didn't show live stocks ticker after Trump's tariffs announcement — markets were closed",
    "description": "Fox News removed a live stocks ticker from its broadcast for the first time in 28 years when the stock market crashed after Trump announced sweeping tariffs on April 2, 2025.",
    "link": "https://www.snopes.com//fact-check/fox-news-remove-stocks-ticker-trump-tariffs/",
    "timestamp": "2025-04-04T21:33:00Z"
  },
  {
    "title": "Stocks plunge as China retaliates to Trump tariffs",
    "description": "The US president, who has vowed to remake the global trade order, dismissed concerns, noting the US jobs market is strong.",
    "link": "https://www.bbc.com/news/articles/cx26v8x24w1o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-04T21:32:44Z"
  },
  {
    "title": "Trump is out to destroy the global economic order, and it will cost us all",
    "description": "Donald Trump's tariffs are not a negotiation tactic, they are a very deliberate plan to destroy the liberal global trading and financial system the US itself established. And all of us could pay a heavy price for his attempt to reshape the world order.",
    "link": "https://www.abc.net.au/news/2025-04-05/trump-tariffs-upend-80-year-old-world-economic-order/105139464",
    "timestamp": "2025-04-04T21:32:24Z"
  },
  {
    "title": "UK student visas revoked by Department of Homeland Security, university says",
    "description": "The University of Kentucky said late Friday afternoon “a small number of international graduate students at UK” had their F-1 student visas revoked.",
    "link": "https://www.kentucky.com/news/local/education/article303525201.html",
    "timestamp": "2025-04-04T21:32:20Z"
  },
  {
    "title": "Stock markets slump for second day running after Trump's tariffs",
    "description": "Worldwide stock markets have plummeted for the second day running as the fallout from Donald Trump's global tariffs continues.",
    "link": "https://news.sky.com/story/stock-markets-slump-for-second-day-running-after-trump-announces-tariffs-in-worst-day-for-indexes-since-covid-13342099",
    "timestamp": "2025-04-04T21:32:00Z"
  }
]