[
  {
    "title": "Missouri’s Eric Schmitt goes silent as a fight over Nazis and antisemitism roils the GOP",
    "description": "For several weeks now, the American right has been embroiled in a bitter internal fight about Nazis and antisemitism. Specifically, the fight has centered on...",
    "link": "https://missouriindependent.com/2025/11/18/eric-schmitt-nazis-antisemitism/",
    "timestamp": "2025-11-18T11:55:59Z"
  },
  {
    "title": "Rob Urie: American Decline in Three Parts",
    "description": "Rob Urie looks at a trifecta of failure: a looming Ukraine loss in Ukraine, desperation among workers, and the unfixable problems with generative AI",
    "link": "https://www.nakedcapitalism.com/2025/11/rob-urie-american-decline-in-three-parts.html",
    "timestamp": "2025-11-18T11:54:39Z"
  },
  {
    "title": "Is the US Trying to Set in Motion a Colour Revolution in Mexico?",
    "description": "For the moment there is no smoking gun. But the US is clearly, wilfully destabilising the country. And this effort predates Trump 2.0.",
    "link": "https://www.nakedcapitalism.com/2025/11/is-the-us-trying-to-organise-a-colour-revolution-in-mexico.html",
    "timestamp": "2025-11-18T11:45:01Z"
  },
  {
    "title": "Why Democrats can’t stay united — even in victory",
    "description": "Stagnant leadership and a culture of learned helplessness keep holding the party back",
    "link": "https://www.salon.com/2025/11/18/why-democrats-cant-stay-united-even-in-victory/",
    "timestamp": "2025-11-18T11:45:00Z"
  },
  {
    "title": "CNN Comedy Show Host Michael Ian Black Say 'I Kinda Think' Trump 'F**ked Around with Kids'",
    "description": "Michael Ian Black, comedian and host of CNN's \"Have I Got News for You,\" says he now believes President Donald Trump is guilty of having sexual relations with children.\nThe post CNN Comedy Show Host Michael Ian Black Say ‘I Kinda Think’ Trump ‘F**ked Around w…",
    "link": "https://www.breitbart.com/entertainment/2025/11/18/cnn-comedy-show-host-michael-ian-black-say-i-kinda-think-trump-fked-around-with-kids/",
    "timestamp": "2025-11-18T11:44:41Z"
  },
  {
    "title": "Glencore cuts Century Aluminum stake to 33% after tariff-driven rally",
    "description": "LONDON (Reuters) -Glencore has cut its stake in Century Aluminum by 10% to 33%, raking in millions following a share price rally ​triggered by U. tariffs on ...",
    "link": "https://finance.yahoo.com/news/glencore-cuts-century-aluminum-stake-114241356.html",
    "timestamp": "2025-11-18T11:42:41Z"
  },
  {
    "title": "How Trump's comments about Fuentes and Carlson could prolong a Republican rift over antisemitism",
    "description": "President Donald Trump is facing criticism for not condemning antisemitism within the conservative movement",
    "link": "https://abcnews.go.com/US/wireStory/trumps-comments-fuentes-carlson-prolong-republican-rift-antisemitism-127618844",
    "timestamp": "2025-11-18T11:41:29Z"
  },
  {
    "title": "Federal agents to begin immigration operations in Raleigh, mayor says",
    "description": "The mayor of Raleigh, North Carolina, said that federal agents will be continuing their operations in the area Tuesday.",
    "link": "https://abcnews.go.com/US/federal-agents-begin-immigration-operations-raleigh-mayor/story?id=127620994",
    "timestamp": "2025-11-18T11:41:06Z"
  },
  {
    "title": "How Donald Trump shifted on releasing the Jeffrey Epstein files",
    "description": "Trump called Epstein file demands a hoax but now urges Republicans to release them, saying he has nothing to hide.",
    "link": "https://www.aljazeera.com/news/2025/11/18/how-donald-trump-shifted-on-releasing-the-jeffrey-epstein-files",
    "timestamp": "2025-11-18T11:38:58Z"
  },
  {
    "title": "Morning Bid: Rattled tech stokes volatility",
    "description": "and global markets today , Editor-At-Large, Finance and Markets Persistent tech sector valuation and leverage jitters, a deepening crypto drawdown and...",
    "link": "https://finance.yahoo.com/news/morning-bid-rattled-tech-stokes-113643596.html",
    "timestamp": "2025-11-18T11:36:43Z"
  },
  {
    "title": "Ukraine’s Zelenskyy headed to Turkiye in bid to resuscitate peace talks",
    "description": "Meeting reportedly set up with US envoy, but Moscow says no Russian representatives will attend.",
    "link": "https://www.aljazeera.com/news/2025/11/18/ukraines-zelenskyy-headed-to-turkiye-in-bid-to-resuscitate-peace-talks",
    "timestamp": "2025-11-18T11:33:38Z"
  },
  {
    "title": "House expected to vote on bill forcing release of Jeffrey Epstein files",
    "description": "The House is expected to vote on legislation to force the Justice Department to publicly release its files on the late financier Jeffrey Epstein. It's the culmination of a monthslong effort that has overcome opposition from President Donald Trump and…",
    "link": "https://apnews.com/article/epstein-files-congress-trump-house-297a66ce48bd2a67c571bc643e32ef71",
    "timestamp": "2025-11-18T11:33:00Z"
  },
  {
    "title": "Senators seek probe of Trump crypto venture over alleged token sales linked to North Korea and Russia",
    "description": "A group of U.S. Senators have sent a letter asking officials to investigate a Trump family-linked crypto company over reported business ties to illicit actors.",
    "link": "https://www.cnbc.com/2025/11/18/senator-probe-warren-trump-crypto-world-liberty-financial-usd1-wlfi-ties-north-korea-russia-iran.html",
    "timestamp": "2025-11-18T11:31:02Z"
  },
  {
    "title": "Trump cites Walmart’s Thanksgiving deal as proof prices are falling, but the package shrank instead",
    "description": "Facing falling consumer confidence and widespread concern about inflation, President Donald Trump said a Walmart Thanksgiving dinner package shows his policies are lowering prices. Trump used the talking point in a Nov. 10 interview with Fox News’ […]\nThe pos…",
    "link": "https://www.poynter.org/fact-checking/2025/trump-walmart-thanksgiving-price-claim-fact-check/",
    "timestamp": "2025-11-18T11:30:25Z"
  },
  {
    "title": "Trump’s investment in MBS is a bad deal in the making",
    "description": "There are few parts of the presidency that Donald Trump appears to enjoy more than hosting world leaders at the White House. Between the allure of showing powerful people his increasingly golden Oval Office and presiding over lavish formal dinners in the even…",
    "link": "https://biztoc.com/x/267a769ee21e10ba",
    "timestamp": "2025-11-18T11:26:57Z"
  },
  {
    "title": "Nigerians reject Trump claims that Christians are being persecuted",
    "description": "Gunmen kidnapped more than two dozen schoolgirls in northern Nigeria this week, underscoring an ongoing variety of violence that is not — residents, analysts and officials there say — as simple as U.S. President Donald Trump recently made it sound.\nTrump thre…",
    "link": "https://biztoc.com/x/e3cea3ffdfa8f30f",
    "timestamp": "2025-11-18T11:26:50Z"
  },
  {
    "title": "Trump faces his biggest House rebellion yet — and pretends it’s his idea",
    "description": "The House of Representatives is on the verge of delivering its strongest rebuke of President Donald Trump during his second term, and the president’s public position is he hopes Republicans will vote with Democrats.\nThe vote is to compel the release of all un…",
    "link": "https://biztoc.com/x/f735a80a7a3ba741",
    "timestamp": "2025-11-18T11:26:44Z"
  },
  {
    "title": "The sinister rise of the ‘skinny BBL’",
    "description": "The subtle evolution of the BBL – the defining procedure of the Kardashian-maximalist beauty era – suggests we are truly in a new period of body ideals",
    "link": "https://www.dazeddigital.com/beauty/article/69092/1/are-skinnybbl-ultimate-symbol-of-the-beauty-vibe-shift-kardashian?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=the-sinister-rise-of-the-skinny-bbl",
    "timestamp": "2025-11-18T11:24:00Z"
  },
  {
    "title": "Trump to Host Saudi’s MBS With Eye Toward Defense, Tech Deals",
    "description": "Saudi Arabia’s Crown Prince Mohammed bin Salman will meet US President Donald Trump at the White House on Tuesday, cementing a burgeoning relationship that the oil-rich kingdom says will advance peace and stability in the Middle East.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-host-saudis-mbs-with-eye-toward-defense-tech-deals",
    "timestamp": "2025-11-18T11:19:01Z"
  },
  {
    "title": "How Trump's comments about Fuentes and Carlson could prolong a Republican rift over antisemitism - AP News",
    "description": "How Trump's comments about Fuentes and Carlson could prolong a Republican rift over antisemitismAP News Trump Defends Tucker Carlson After Nick Fuentes InterviewThe New York Times Donald Trump's defense for Tucker Carlson spells trouble for MAGA, Ted Cruz set…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180120055",
    "timestamp": "2025-11-18T11:12:37Z"
  },
  {
    "title": "Transcript: Trump Accidentally Shivs JD Vance as MAGA Civil War Erupts",
    "description": "The following is a lightly edited transcript of the November 18 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is the Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. A civil …",
    "link": "https://newrepublic.com/article/203334/transcript-trump-accidentally-shivs-jd-vance-maga-civil-war-erupts",
    "timestamp": "2025-11-18T11:08:34Z"
  },
  {
    "title": "EU probes Amazon and Microsoft's cloud services",
    "description": "The European Commission has launched three market investigations on cloud computing services by Amazon and Microsoft under the Digital Markets Act (DMA), which aims to curb the power of Big Tech and ensure a level playing field for smaller rivals.",
    "link": "https://www.rte.ie/news/business/2025/1118/1544582-eu-probes-amazon-and-microsofts-cloud-services/",
    "timestamp": "2025-11-18T11:08:22Z"
  },
  {
    "title": "Florida Lt. Gov. Jay Collins appears to take shots at Trump-backed gubernatorial candidate Byron Donalds",
    "description": "Sunshine State Lt. Gov. Jay Collins seemed to take shots at President Donald Trump-backed Florida gubernatorial candidate Rep. Byron Donalds",
    "link": "https://www.foxnews.com/politics/florida-lt-gov-jay-collins-appears-take-shots-trump-backed-gubernatorial-candidate-byron-donalds",
    "timestamp": "2025-11-18T11:07:16Z"
  },
  {
    "title": "After Donald Trump’s reversal, US House pushes forward on Epstein vote",
    "description": "The Republican-controlled U.S. House of Representatives will vote on Tuesday on forcing the release of investigative files on the late sex offender Jeffrey Epstein, with passage seen as all but guaranteed after President Donald Trump dropped his long-standing…",
    "link": "https://www.independent.ie/world-news/north-america/after-donald-trumps-reversal-us-house-pushes-forward-on-epstein-vote/a819620236.html",
    "timestamp": "2025-11-18T11:05:18Z"
  },
  {
    "title": "Jon Stewart explains why he ‘knows’ Trump-Epstein emails are ‘real’",
    "description": "Late-night host says president has been deflecting too much",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/donald-trump-epstein-files-jon-stewart-b2867237.html",
    "timestamp": "2025-11-18T11:05:04Z"
  },
  {
    "title": "U.N. Sounds Alarm On Catastrophic Hunger Crisis Following Trump Aid Cuts",
    "description": "Some 318 million people are expected to face crisis levels of hunger or worse next year, more than double the number in 2019.",
    "link": "https://www.huffpost.com/entry/united-nations-warning-hunger-crisis_n_691c4b41e4b0414d84d74e7b",
    "timestamp": "2025-11-18T11:03:35Z"
  },
  {
    "title": "US and Russia discussing prisoner swap, Axios reports",
    "description": "(Reuters) -Russia and the United States have discussed the possibility of conducting another prisoner exchange, Russian President Vladimir Putin's special envoy Kirill Dmitriev told Axios in an interview published on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/18/us-and-russia-discussing-prisoner-swap-axios-reports",
    "timestamp": "2025-11-18T11:03:00Z"
  },
  {
    "title": "EU probes Amazon, Microsoft's cloud services for potential curbs",
    "description": "The European Commission has launched three market investigations on cloud computing services by Amazon and Microsoft under the Digital Markets Act (DMA.)",
    "link": "https://www.cnbc.com/2025/11/18/eu-probes-amazon-microsofts-cloud-services-for-potential-curbs.html",
    "timestamp": "2025-11-18T11:02:55Z"
  },
  {
    "title": "Trump ‘ok’ with launching strikes in Mexico",
    "description": "US President Donald Trump has said he is open to ordering strikes in Mexico to fight drug smuggling Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627925-trump-ok-strikes-mexico/",
    "timestamp": "2025-11-18T11:02:00Z"
  },
  {
    "title": "Joe Gebbia confirms role as America's first chief design officer",
    "description": "Airbnb co-founder Joe Gebbia has confirmed to Dezeen that he has been appointed America's first chief design officer by president Donald Trump. Speaking to Dezeen in an exclusive interview, Gebbia confirmed that he was running the recently created National De…",
    "link": "https://www.dezeen.com/2025/11/18/joe-gebbia-america-chief-design-officer/",
    "timestamp": "2025-11-18T11:00:43Z"
  },
  {
    "title": "Marine veteran launches Senate campaign by invoking far-left radical to paint Dems as extreme",
    "description": "Political newcomer and former State Department expert David Williams enters race to unseat Democratic Sen. Mark Warner in Virginia's 2026 election.",
    "link": "https://www.foxnews.com/politics/marine-veteran-launches-senate-campaign-invoking-far-left-radical-target-dems",
    "timestamp": "2025-11-18T11:00:41Z"
  },
  {
    "title": "Patel waived FBI’s polygraph security screening for Bongino",
    "description": "As the FBI’s deputy director, Bongino receives some of the country’s most sensitive secrets.",
    "link": "https://www.salon.com/2025/11/18/patel-waived-fbis-polygraph-security-screening-for-bongino_partner/",
    "timestamp": "2025-11-18T11:00:35Z"
  },
  {
    "title": "William Watson: TikTok politics won’t fix the U.S. fiscal mess",
    "description": "A new study shows how stabilizing U.S. public debt requires big tax increases or spending cuts. Are lawmakers capable of such heavy lifting",
    "link": "https://financialpost.com/opinion/william-watson-tiktok-politics-wont-fix-the-u-s-fiscal-mess",
    "timestamp": "2025-11-18T11:00:34Z"
  },
  {
    "title": "House GOP braces for Epstein files vote as concerns remain despite Trump's green light",
    "description": "House Republicans express cautious support for bipartisan bill requiring DOJ to release Jeffrey Epstein files after President Donald Trump endorsed the measure Sunday.",
    "link": "https://www.foxnews.com/politics/house-gop-braces-epstein-files-vote-concerns-remain-despite-trumps-green-light",
    "timestamp": "2025-11-18T11:00:19Z"
  },
  {
    "title": "Trump rally gunman acted alone, FBI says — but questions about motive persist",
    "description": "FBI investigation into Thomas Crooks' Trump rally shooting finds no conspiracy, debunking theories about the attack that killed one and wounded three others.",
    "link": "https://www.foxnews.com/us/trump-rally-gunman-acted-alone-fbi-says-questions-about-motive-persist",
    "timestamp": "2025-11-18T11:00:13Z"
  },
  {
    "title": "Will more Epstein files be released? House vote adds pressure on Trump's DOJ.",
    "description": "The measure compelling the Justice Department to release materials related to Jeffrey Epstein is expected to pass the House. In a sudden reversal, President Trump told lawmakers they should vote for it.",
    "link": "https://www.cbsnews.com/news/will-more-jeffrey-epstein-files-be-released-house-vote-pressure-trump-doj/",
    "timestamp": "2025-11-18T11:00:08Z"
  },
  {
    "title": "Batman/Deadpool #1 Spoilers in The Daily LITG, 18th November, 2025",
    "description": "Batman/Deadpool #1 Spoilers were the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a histor…",
    "link": "https://bleedingcool.com/comics/batman-deadpool-1-spoilers-in-the-daily-litg-18th-november-2025/",
    "timestamp": "2025-11-18T11:00:03Z"
  },
  {
    "title": "Can We Find Cleaner Ways to Extract Rare Earth Elements?",
    "description": "These valuable but difficult-to-extract metals are increasingly important to modern life",
    "link": "https://www.scientificamerican.com/article/can-we-find-cleaner-ways-to-extract-rare-earth-elements/",
    "timestamp": "2025-11-18T11:00:00Z"
  },
  {
    "title": "Victor Davis Hanson: What President Trump Needs to Tell Americans About Prices",
    "description": "In this episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Jack Fowler discuss what President Donald Trump needs to tell Americans... Read More\nThe post Victor Davis Hanson: What President Trump Needs to Tell Americans About Prices ap…",
    "link": "https://www.dailysignal.com/2025/11/18/victor-davis-hanson-what-president-trump-needs-to-tell-americans-about-prices/",
    "timestamp": "2025-11-18T11:00:00Z"
  },
  {
    "title": "The Next Foreclosure Crisis Has Arrived",
    "description": "While President Donald Trump is scrambling to try to fix all of the economic problems he’s caused with his own policies, many American families may be heading toward a disaster. And the proximate cause may end up being not what the administration has done, bu…",
    "link": "https://newrepublic.com/article/203329/trump-economy-foreclosure-crisis-affordability",
    "timestamp": "2025-11-18T11:00:00Z"
  },
  {
    "title": "The American People Voted for Jeffrey Epstein",
    "description": "As I thumbed through the trove of Jeffrey Epstein emails released by Congress last week, I thought often of John Adams. The nation’s second president was not without his flaws, but they were typically outshone by his perceptive understanding of what republics…",
    "link": "https://newrepublic.com/article/203332/american-people-voted-jeffrey-epstein",
    "timestamp": "2025-11-18T11:00:00Z"
  },
  {
    "title": "Everything you need to know about Palantir’s wildly eccentric Alex Karp — and why he feels ‘left by the left’",
    "description": "“What’s critical to understanding Karp is the sense of vulnerability that stalks him ... ” author Michael Steinberger said. “You could say that Palantir exists to make the world safer for Alex Karp.”",
    "link": "https://nypost.com/2025/11/18/us-news/why-eccentric-palantir-ceo-alex-karp-feels-left-by-the-left/",
    "timestamp": "2025-11-18T11:00:00Z"
  },
  {
    "title": "Trump’s Nearly $2 Billion Postelection Windfall",
    "description": "Even though his campaign ended a year ago, the president hasn’t stopped fundraising.",
    "link": "https://www.theatlantic.com/politics/2025/11/trump-fundraising-ballroom/684963/",
    "timestamp": "2025-11-18T11:00:00Z"
  },
  {
    "title": "Trump Announces 'FIFA Pass' to Fast-Track U.S. Visas for 2026 World Cup Travelers",
    "description": "The Trump administration has launched a new \"FIFA Pass\" system to fast-track visa interviews for 2026 World Cup travelers, offering priority scheduling to fans who purchased tickets through FIFA.",
    "link": "https://www.ibtimes.com/trump-announces-fifa-pass-fast-track-us-visas-2026-world-cup-travelers-3790580",
    "timestamp": "2025-11-18T10:52:50Z"
  },
  {
    "title": "Satya Nadella relinquishes his role as Microsoft’s communicator-in-chief—right when he’s needed most",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/11/18/satya-nadella-microsoft-ignite-communicator-in-chief-ai-fears/",
    "timestamp": "2025-11-18T10:48:55Z"
  },
  {
    "title": "Trump, Saudi Crown Prince Mohammed bin Salman to meet at White House amid diplomatic shifts in region",
    "description": "Mohammed bin Salman arrives for first Washington visit in seven years as both nations seek upgraded security partnership",
    "link": "https://www.foxnews.com/world/trump-saudi-crown-prince-mohammed-bin-salman-meet-white-house-amid-diplomatic-shifts-region",
    "timestamp": "2025-11-18T10:45:41Z"
  },
  {
    "title": "Trump Is Stripping Some Service Members Of Their Retirement Benefits",
    "description": "The move raises questions about how far the administration will go to reshape the armed forces.",
    "link": "https://www.huffpost.com/entry/trump-is-stripping-some-service-members-of-their-retirement-benefits_n_691b96a8e4b085766d7e8235",
    "timestamp": "2025-11-18T10:45:17Z"
  },
  {
    "title": "The Michelin-Star System Is Slowly Taking Over the American Restaurant World. But There’s One City It Should Have Left Alone.",
    "description": "This ever-expanding pay-to-play scheme needs to stop.",
    "link": "https://slate.com/life/2025/11/michelin-star-restaurants-boston-philadelphia-reservations.html",
    "timestamp": "2025-11-18T10:45:00Z"
  },
  {
    "title": "Donald Trump Reacts To Ted Cruz Presidential Run Rumors",
    "description": "President Donald Trump has reacted to rumors that Texas Senator Ted Cruz is considering a presidential run in the 2028 election.\nAxios reported on Monday that Cruz was laying the groundwork for a future presidential run. But Cruz has not launched a formal bid…",
    "link": "https://biztoc.com/x/d78b1fbe6043fe2c",
    "timestamp": "2025-11-18T10:42:17Z"
  },
  {
    "title": "Trump Refuses to Rule Out Military Action Against Venezuela",
    "description": "2 min ago\nTrump Refuses to Rule Out Military Action Against Venezuela\nPresident Donald Trump said Monday that he will not rule out sending troops into Venezuela as the buildup of U.S. military near the South American country continued.\nTrump said he probably …",
    "link": "https://biztoc.com/x/de2061422d83eadb",
    "timestamp": "2025-11-18T10:42:08Z"
  },
  {
    "title": "Trump Says 'We'll Be Selling' F-35 Jets To Saudi Arabia, Ahead Of Crown Prince's White House Visit",
    "description": "President Donald Trump announced plans to sell Lockheed Martin‘s (NYSE:LMT) F-35 fighter jets to Saudi Arabia, potentially reshaping the military dynamics in the Middle East.\nTrump Calls Saudi Arabia ‘Great Ally’\nThe announcement came on Monday, just a day be…",
    "link": "https://biztoc.com/x/de384fed0dac102c",
    "timestamp": "2025-11-18T10:42:03Z"
  },
  {
    "title": "Novo Nordisk CEO's Bold Vow: Full Commitment to Weight-Loss Pill as Wegovy Price Falls",
    "description": "Novo Nordisk cuts Wegovy's price and commits fully to its upcoming weight-loss pill to stay competitive in the fast-growing obesity drug market.",
    "link": "https://www.ibtimes.com/novo-nordisk-ceos-bold-vow-full-commitment-weight-loss-pill-wegovy-price-falls-3790589",
    "timestamp": "2025-11-18T10:38:28Z"
  },
  {
    "title": "Epstein Latest: House To Vote on Files Today, Trump Says Will Sign Bill—Live Updates",
    "description": "Epstein vote takes place after Donald Trump reversed his position; though a DOJ investigation could potentially cause delays.",
    "link": "https://biztoc.com/x/bfceb33f42c32c4d",
    "timestamp": "2025-11-18T10:31:11Z"
  },
  {
    "title": "In 1988 Samsung Predicted Computer Dating by 2025",
    "description": "Finding romance with a computer was considered absurd in 1988.",
    "link": "https://gizmodo.com/in-1988-samsung-predicted-computer-dating-by-2025-2000687264",
    "timestamp": "2025-11-18T10:30:46Z"
  },
  {
    "title": "The White House Intervened on Behalf of Accused Sex Trafficker Andrew Tate During a Federal Investigation",
    "description": "Federal authorities were chided for seizing electronic devices from Tate and his brother, and told to return them, records and interviews show. Experts said the intervention was highly inappropriate.",
    "link": "http://www.propublica.org/article/andrew-tate-investigation-dhs-paul-ingrassia",
    "timestamp": "2025-11-18T10:30:00Z"
  },
  {
    "title": "Herzog: Adoption of US-drafted Security Council resolution is a historic landmark",
    "description": "President Isaac Herzog welcomed a German youth delegation in Jerusalem, praising President Donald Trump’s UN-backed Gaza peace plan as a historic path to peace and stability.",
    "link": "https://www.israelnationalnews.com/news/417968",
    "timestamp": "2025-11-18T10:28:49Z"
  },
  {
    "title": "Zohran Mamdani reaches out to White House to arrange meeting with Donald Trump",
    "description": "New York’s mayor-elect said he hopes to press US president to help ease affordability crisis",
    "link": "https://www.irishtimes.com/world/us/2025/11/18/zohran-mamdani-reaches-out-to-white-house-to-arrange-meeting-with-donald-trump/",
    "timestamp": "2025-11-18T10:23:23Z"
  },
  {
    "title": "$2K Stimulus Cheques 2025 Release: Financial Aid From Trump May Not Arrive Until Mid Next Year",
    "description": "Trump proposes $2,000 stimulus cheques funded by tariff revenues, but economists warn of inflation and officials say payments are unlikely before mid-2026.",
    "link": "https://www.ibtimes.com/2k-stimulus-cheques-2025-release-financial-aid-trump-may-not-arrive-until-mid-next-year-3790593",
    "timestamp": "2025-11-18T10:22:17Z"
  },
  {
    "title": "Have the Epstein Files Broken MAGA?",
    "description": "Is MAGA imagining a world after Trump?",
    "link": "https://slate.com/podcasts/what-next/2025/11/how-the-epstein-files-forced-trump-for-once",
    "timestamp": "2025-11-18T10:20:00Z"
  },
  {
    "title": "Trump Admin Revoking ‘Tens of Thousands of Visas’—Stephen Miller",
    "description": "Stephen Miller, a senior adviser to President Donald Trump, said that the State Department has already revoked “tens of thousands of visas” as the administration unleashes a sweeping crackdown on migration\n“The State Department has revoked tens of thousands o…",
    "link": "https://biztoc.com/x/f71ac5aa90f5c4ad",
    "timestamp": "2025-11-18T10:19:56Z"
  },
  {
    "title": "Donald Trump Issues H-1B Visa Update",
    "description": "President Donald Trump has defended his recent support for H-1B visas, arguing that the United States needs to bring in skilled foreign workers to bolster key industries, despite backlash from within his base.\nSpeaking to reporters at the Oval Office on Monda…",
    "link": "https://biztoc.com/x/7ff6d1ac411c47b6",
    "timestamp": "2025-11-18T10:19:53Z"
  },
  {
    "title": "House to vote on full Epstein files' release -- the move Johnson fought for months",
    "description": "The bill is expected to pass in the House with Republicans' support.",
    "link": "https://abcnews.go.com/Politics/house-vote-full-epstein-files-release-move-speaker/story?id=127593181",
    "timestamp": "2025-11-18T10:17:27Z"
  },
  {
    "title": "Battenfeld: Katherine Clark and Democrats’ obsession with Epstein the wrong message",
    "description": "Besides making missteps like calling the war against Hamas a “genocide” and poor people’s health care “leverage,” the 62-year-old Democratic Massachusetts congresswoman is part of the politics of the past – the Nancy Pelosi retread wing of the party.",
    "link": "https://www.bostonherald.com/2025/11/18/battenfeld-katherine-clark-and-democrats-obsession-with-epstein-the-wrong-message/",
    "timestamp": "2025-11-18T10:15:22Z"
  },
  {
    "title": "US Justice Department scolded by judge for 'profound investigative missteps' in Comey case",
    "description": "The US Justice Department engaged in a \"disturbing pattern of profound investigative missteps\" in the process of securing an indictment against former FBI director James Comey, a judge has said.",
    "link": "https://news.sky.com/story/us-justice-department-scolded-by-judge-for-profound-investigative-missteps-in-comey-case-13472148",
    "timestamp": "2025-11-18T10:15:00Z"
  },
  {
    "title": "Republicans Will Never Find a Health Care Replacement",
    "description": "The GOP is too wedded to free markets and scornful of the welfare state to ever make anything in health care work.\nThe post Republicans Will Never Find a Health Care Replacement appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/11/18/republicans-will-never-find-health-care-replacement/",
    "timestamp": "2025-11-18T10:15:00Z"
  },
  {
    "title": "US House expected to pass bill forcing Epstein files’ release",
    "description": "The House is expected to pass a bill today requiring the Justice Department to release its files on sex offender Jeffrey Epstein, with enough bipartisan support to override a veto.\nIt may be a moot point: President Donald Trump said Monday he would sign the l…",
    "link": "https://biztoc.com/x/775dd7991782aade",
    "timestamp": "2025-11-18T10:09:22Z"
  },
  {
    "title": "Democrats Let Kansas Governor Laura Kelly Lead—Now They’re Winning",
    "description": "It’s not often that when a journalist asks a sitting governor whether they plan to run for president, the answer is a definitive—“No, absolutely not.” It’s even rarer in today’s political climate that a Democratic governor holds that office in a state Preside…",
    "link": "https://biztoc.com/x/add61ff1748229c4",
    "timestamp": "2025-11-18T10:09:08Z"
  },
  {
    "title": "Hamas Rejects Vital Conditions of Donald Trump’s Gaza Peace Plan",
    "description": "After the United Nations Security Council endorsed the U.S. peace plan developed under President Donald Trump's leadership, Hamas rejected two of its vital conditions—the militant group's immediate disarmament and what it called the \"international guardianshi…",
    "link": "https://biztoc.com/x/e04a40b65cf0ec58",
    "timestamp": "2025-11-18T10:09:03Z"
  },
  {
    "title": "Donald Trump's MAGA Succession Plan Could Be Under Threat",
    "description": "U.S. President Donald Trump's succession plan could be under threat as candidates potentially step into the ring to become the Republican presidential nominee in 2028.\nTrump has previously floated Vice President JD Vance and Secretary of State Marco Rubio as …",
    "link": "https://biztoc.com/x/3928d76ea04656ff",
    "timestamp": "2025-11-18T10:09:02Z"
  },
  {
    "title": "Trump key to any health care negotiations in Senate",
    "description": "The News\nSenate Republicans see a potential deal with Democrats on lowering health care premiums for 2026 — if President Donald Trump gets involved.\nThe Senate will vote by mid-December on reviving enhanced premium Obamacare tax credits set to expire by year’…",
    "link": "https://biztoc.com/x/c8a4a19a131072ce",
    "timestamp": "2025-11-18T10:08:59Z"
  },
  {
    "title": "Charlotte’s Web: What’s happening with North Carolina immigration raids?",
    "description": "US immigration officers detained more than 130 people over the weekend in Charlotte.",
    "link": "https://www.aljazeera.com/news/2025/11/18/charlottes-web-whats-happening-with-north-carolina-immigration-raids",
    "timestamp": "2025-11-18T10:08:47Z"
  },
  {
    "title": "What to watch for as Trump welcomes Saudi crown prince",
    "description": "The White House expects President Donald Trump and Saudi Arabia’s Crown Prince Mohammed bin Salman to ink a slate of deals as they meet in Washington today — including on defense and artificial intelligence.\nAlso expected, per a senior administration official…",
    "link": "https://biztoc.com/x/70fdd0e212167058",
    "timestamp": "2025-11-18T10:08:39Z"
  },
  {
    "title": "Reaffirming a Strong Alliance and a Solid Combined Defense Posture at the 57th ROK-US Security Consultative Meeting",
    "description": "Key officials, including Defense Minister Ahn Gyu-back, third from right, and US Secretary of Defense Pete Hegseth, second from left, attend the 57th SCM at the Ministry of National Defense in Yongsan-gu, Seoul, on Nov. 4.",
    "link": "https://www.globalsecurity.org/wmd/library/news/rok/2025/rok-251117-rok-mnd10.htm",
    "timestamp": "2025-11-18T10:06:11Z"
  },
  {
    "title": "US naval chief calls S.Korea nuclear sub for counter China 'natural expectation'; experts warn of regional tensions",
    "description": "The US chief of naval operations' recent remarks suggesting that South Korea's future nuclear-powered submarine \"is a natural expectation\" to be used to counter China have raised concerns, with experts warning that the claim reveals Washington's intention to …",
    "link": "https://www.globalsecurity.org/wmd/library/news/rok/2025/rok-251117-globaltimes01.htm",
    "timestamp": "2025-11-18T10:05:50Z"
  },
  {
    "title": "South Korea to Launch an Indigenous Nuclear-Powered Submarine by the Mid to Late 2030s",
    "description": "The Ministry of National Defense reports to the Cabinet meeting on significant progress in ROK-US nuclear fuel consultations, laying the groundwork for project implementation.",
    "link": "https://www.globalsecurity.org/wmd/library/news/rok/2025/rok-251117-rok-mnd09.htm",
    "timestamp": "2025-11-18T10:05:37Z"
  },
  {
    "title": "Indian oil firms to import US LPG",
    "description": "India is under mounting pressure from the Trump administration to reduce its energy dependence on Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/india/627927-india-us-pressure-oil/",
    "timestamp": "2025-11-18T10:04:18Z"
  },
  {
    "title": "Trump says US will sell F-35 warplanes to Saudi Arabia as Israel ties sales to normalization",
    "description": "The US is preparing to move forward with the sales of advanced F-35 warplanes to Saudi Arabia amid reported pressure by the Israeli regime that the sales be tied to Riyadh's normalization of its ties with Tel Aviv and abandoning the Palestinian cause.",
    "link": "https://www.globalsecurity.org/wmd/library/news/saudi/2025/saudi-251118-presstv01.htm",
    "timestamp": "2025-11-18T10:03:03Z"
  },
  {
    "title": "Dem Rep. Moore: 'Obamacare Is on Life Support'",
    "description": "On Monday’s broadcast of Bloomberg’s “Balance of Power,” Rep. Gwen Moore (D-WI) criticized the health savings account proposal floated by President Donald Trump but said that “it looks like Obamacare is on life support right now.” Co-host Joe Mathieu asked,\nT…",
    "link": "https://www.breitbart.com/clips/2025/11/18/dem-rep-moore-obamacare-is-on-life-support/",
    "timestamp": "2025-11-18T10:01:19Z"
  },
  {
    "title": "LIZ PEEK: Why every 'affordable' promise from Democrats ends up costing you more",
    "description": "Democrat-run cities like New York and San Francisco rank among America's most expensive, while Republican-led areas maintain lower living costs. That is very telling about \"affordability.\"",
    "link": "https://www.foxnews.com/opinion/liz-peek-why-every-affordable-promise-from-democrats-ends-up-costing-you-more",
    "timestamp": "2025-11-18T10:00:36Z"
  },
  {
    "title": "MORNING GLORY: Israel is America’s most important ally",
    "description": "How Israel's role in the Western alliance has evolved to become indispensable for America's strategic interests against authoritarian threats worldwide.",
    "link": "https://www.foxnews.com/opinion/morning-glory-israel-americas-most-important-ally",
    "timestamp": "2025-11-18T10:00:29Z"
  },
  {
    "title": "How Public Education Failed in the Liberal Enclaves That Care About It Most",
    "description": "Something disastrous happened to public education in America, and academics nearly unanimously agree that the problem is not simply a product of the pandemic.",
    "link": "http://nymag.com/intelligencer/article/public-education-failure-american-test-scores-trump-pandemic-liberals.html",
    "timestamp": "2025-11-18T10:00:07Z"
  },
  {
    "title": "The Deliberate Decimation of the Federal Workforce",
    "description": "Sasha Abramsky\n\n\n\nSystems built up over the last 120 years are being either eliminated or corroded at warp speed, with the implicit blessing of the US Supreme Court.\r\n\n\r\n\n\nThe post The Deliberate Decimation of the Federal Workforce appeared first on The Natio…",
    "link": "https://www.thenation.com/article/society/deliberate-decimation-federal-workforce/",
    "timestamp": "2025-11-18T10:00:02Z"
  },
  {
    "title": "Ticked Off Over Preauthorization: Walk-In Patient Avoided Lyme Disease but Not a Surprise Bill",
    "description": "A Maine woman sought care at a clinic for a tick bite, then paid full price after her insurer denied coverage. Its reason? She didn't have preapproval for the walk-in visit, even though testing later detected the pathogen that causes Lyme disease.",
    "link": "https://kffhealthnews.org/news/article/prior-authorization-walk-in-clinic-tick-bite-coverage-denial/",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "What the U.S. Government Is Dismissing That Could Seed a Bird Flu Pandemic",
    "description": "Egg producers suspect bird flu is traveling through the air. After a disastrous Midwestern outbreak early this year, we tested that theory and found that where the wind blew, the virus followed. Vaccines could help, but the USDA hasn’t approved them.",
    "link": "http://www.propublica.org/article/bird-flu-airborne-usda-pandemic",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "Trump’s Poll Numbers Just Entered the Danger Zone",
    "description": "In November, for the first time in his second term, the president’s average job approval dropped below 45 percent. That spells trouble for the 2026 midterms. \nThe post Trump’s Poll Numbers Just Entered the Danger Zone  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/18/trump-poll-numbers-danger-zone-2026-midterms/",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "How Fossil-Fuel Companies Are Driving Plastic Production and Pollution",
    "description": "To keep profits rolling in, oil and gas companies want to turn fossil fuels into a mounting pile of packaging and other plastic products",
    "link": "https://www.scientificamerican.com/article/how-fossil-fuel-companies-are-driving-plastic-production-and-pollution/",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "Trump Accidentally Stabs Vance in the Back as MAGA Erupts in Civil War",
    "description": "A civil war is unfolding inside the MAGA movement over Nick Fuentes, the neo-Nazi and white supremacist, and President Donald Trump just made it worse. In an interview, Trump defended Fuentes in a way that will boost his standing inside MAGA. As it turns out,…",
    "link": "https://newrepublic.com/article/203333/trump-accidentally-stabs-vance-back-maga-erupts-civil-war",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "Personalized mRNA Vaccines Will Revolutionize Cancer Treatment—If Federal Funding Cuts Don’t Doom Them",
    "description": "Vaccines based on mRNA can be tailored to target a cancer patient’s unique tumor mutations. But crumbling support for cancer and mRNA vaccine research has endangered this promising therapy",
    "link": "https://www.scientificamerican.com/article/personalized-mrna-vaccines-will-revolutionize-cancer-treatment-if-federal/",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "U.S. firm set to launch 200mph flying taxis in Dubai",
    "description": "DUBAI, United Arab Emirates — It will work like any other ride-hailing app except that instead of a car, a battery-powered aircraft will swoop in and fly you.",
    "link": "https://www.nbcnews.com/world/middle-east/us-firm-set-launch-200mph-flying-taxis-dubai-rcna244381",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "Saudi crown prince returns to U.S. for first time after international isolation",
    "description": "Whether viewed as a visionary reformist or a murderous despot, Crown Prince Mohammed bin Salman, Saudi Arabia’s de facto leader, will be taking a huge step toward rejoining the international community when he meets with President Donald Trump at the White Hou…",
    "link": "https://www.nbcnews.com/world/saudi-arabia/trump-mohammed-bin-salman-white-house-visit-rcna244327",
    "timestamp": "2025-11-18T10:00:00Z"
  },
  {
    "title": "Jimmy Fallon Taunts Trump With Epstein-Themed Holiday Merch",
    "description": "It could be the “solution” to the president’s tariff-hiked decoration costs, joked “The Tonight Show” host.",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-donald-trump-holidays_n_691c3401e4b0b8c5ce72f62b",
    "timestamp": "2025-11-18T09:59:52Z"
  },
  {
    "title": "Trump Approves F-35 Jets for Saudi Arabia Ahead of MBS Visit",
    "description": "President Donald Trump said the US would sell F-35 fighter jets to Saudi Arabia, offering Crown Prince Mohammed bin Salman a prize he’s long cherished, ahead of a visit to the White House on Tuesday.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-approves-f-35-jets-for-saudi-arabia-ahead-of-mbs-visit",
    "timestamp": "2025-11-18T09:57:24Z"
  },
  {
    "title": "Israel hails Trump Gaza plan after UN Security Council vote",
    "description": "Israel on Tuesday hailed Donald Trump’s Gaza peace plan after its endorsement by the UN Security Council, as Hamas rejected the resolution which calls for the deployment of an international force in the Palestinian territory. The United Nations Security Counc…",
    "link": "https://www.digitaljournal.com/world/israel-hails-trump-gaza-plan-after-un-security-council-vote/article",
    "timestamp": "2025-11-18T09:57:22Z"
  },
  {
    "title": "US lawmakers set for explosive vote on Epstein files",
    "description": "US lawmakers are expected to advance a bill on Tuesday requiring the release of government records on sex offender Jeffrey Epstein, in defiance of President Donald Trump’s attempts to keep a lid on one of the country’s most notorious case files. After weeks o…",
    "link": "https://www.digitaljournal.com/world/us-lawmakers-set-for-explosive-vote-on-epstein-files/article",
    "timestamp": "2025-11-18T09:57:22Z"
  }
]