[
  {
    "title": "Vice President JD Vance's Wife Usha Addresses Wedding Ring Speculation",
    "description": "A spokesperson for Usha Vance is clarifying the status of the second lady’s marriage after she was spotted without her wedding ring. “[She is] a mother of three young children, who does a lot of dishes, gives lots of baths, and forgets her ring sometimes,” a …",
    "link": "https://www.usmagazine.com/celebrity-news/news/vice-president-jd-vances-wife-usha-addresses-wedding-ring-speculation/#article",
    "timestamp": "2025-11-23T17:16:26Z"
  },
  {
    "title": "\"Groceries,\" and Other Secrets of Managing Donald Trump (emptywheel)",
    "description": "emptywheel:\n“Groceries,” and Other Secrets of Managing Donald Trump  —  Three things happened in the last week that have befuddled a lot of observers, but which might best be understood as the kinds of developments we'll see increasingly as the power structur…",
    "link": "https://www.memeorandum.com/251123/p40",
    "timestamp": "2025-11-23T17:15:01Z"
  },
  {
    "title": "Mamdani stands by Trump criticism despite friendly White House meeting",
    "description": "New York City Mayor-elect Zohran Mamdani is standing by his past criticisms that President Donald Trump acted like a despot and a fascist",
    "link": "https://abcnews.go.com/US/wireStory/mamdani-stands-trump-criticism-despite-friendly-white-house-127803292",
    "timestamp": "2025-11-23T17:10:29Z"
  },
  {
    "title": "Mamdani on working with Trump: “I’m not coming into the Oval Office to make a stand”",
    "description": "The mayor said he's committed to working with Trump while still believing the president is a fascist.",
    "link": "https://www.salon.com/2025/11/23/mamdani-on-working-with-trump-im-not-coming-into-the-oval-office-to-make-a-stand/",
    "timestamp": "2025-11-23T17:09:24Z"
  },
  {
    "title": "When 'Harry' Trump met 'Sally' Mamdani",
    "description": "A curious rendezvous between Zohran Mamdani and Donald Trump caught everyone off guard, with pundits from across the spectrum weighing in on the friendly interaction. This unforeseen pairing has ignited vibrant discussions about its implications for the futur…",
    "link": "https://economictimes.indiatimes.com/opinion/just-in-jest/when-harry-trump-met-sally-mamdani/articleshow/125522692.cms",
    "timestamp": "2025-11-23T17:08:24Z"
  },
  {
    "title": "Congresswoman Maggie Goodlander response after office bomb threat",
    "description": "Congresswoman Maggie Goodlander speaks out after a potential bomb threat targeted her office in Concord on Friday.",
    "link": "https://www.wmur.com/article/nh-goodlander-bomb-threat-response-11232025/69521665",
    "timestamp": "2025-11-23T17:08:09Z"
  },
  {
    "title": "So What’s Next for MTG? Her Latest Social Posts Don’t Clarify Much.",
    "description": "What will Rep. Marjorie Taylor Greene (R-Ga.) do after her shock resignation from Congress in January, announced on Friday? Good question. President Donald Trump, for one, already seems to be reversing course on their breakup. Not long after (again) calling h…",
    "link": "https://www.motherjones.com/politics/2025/11/marjorie-taylor-greene-mtg-trump-2028/",
    "timestamp": "2025-11-23T17:07:54Z"
  },
  {
    "title": "Maria Shriver Supports Fellow Kennedy Tatiana Schlossberg Amid Terminal Cancer",
    "description": "Maria Shriver, niece of the late U.S. president John F. Kennedy, is supporting her family member Tatiana Schlossberg amid her terminal cancer diagnosis. “If you can only read one thing today, please make take the time for this extraordinary piece of writing b…",
    "link": "https://www.usmagazine.com/celebrity-news/news/maria-shriver-supports-tatiana-schlossberg-amid-terminal-cancer/#article",
    "timestamp": "2025-11-23T17:07:19Z"
  },
  {
    "title": "G20 summit boycotted by US closes in South Africa",
    "description": "South African President Cyril Ramaphosa says there is a \"renewed commitment to multilateral co-operation\".",
    "link": "https://www.bbc.com/news/articles/cvg130704zro",
    "timestamp": "2025-11-23T17:07:11Z"
  },
  {
    "title": "Vindman’s call to release Trump–MBS transcript reopens old questions in US–Saudi relationship",
    "description": "Trump grants Saudi Arabia major non-NATO ally status as crown prince pledges nearly $1 trillion in U.S. investments, creating new defense partnerships.",
    "link": "https://www.foxnews.com/politics/vindmans-call-release-trump-mbs-transcript-reopens-old-questions-us-saudi-relationship",
    "timestamp": "2025-11-23T17:05:31Z"
  },
  {
    "title": "How a J6 lawyer admitted Trump's own 'selective and vindictive' abuse of the law",
    "description": "Last week, the American Society of Criminology (ASC) held its 80th Annual Meetings in Washington, D.C\r\n. The theme was Criminology, Law, and the Democratic Ideal\r\n.On day two, I found myself in an impromptu debate with Roger Roots. The name may not be familia…",
    "link": "https://www.rawstory.com/raw-investigates/how-to-make-a-j6-lawyer-admit-trumps-own-prosecutions-are-selective-and-vindictive/",
    "timestamp": "2025-11-23T17:04:33Z"
  },
  {
    "title": "Mamdani stands by Trump criticism despite friendly White House meeting",
    "description": "WASHINGTON (AP) — New York City Mayor-elect Zohran Mamdani didn’t back down in an interview that aired Sunday from past criticism that President Donald Trump acted like a despot and a fascist after a surprisingly friendly White House meeting between the two m…",
    "link": "https://www.bostonherald.com/2025/11/23/mamdani-stands-by-trump-criticism-despite-friendly-white-house-meeting/",
    "timestamp": "2025-11-23T17:03:03Z"
  },
  {
    "title": "Zohran Mamdani Recounts Visit With Donald Trump",
    "description": "New York City Mayor-elect Zohran Mamdani on Sunday divulged some details of his visit with President Donald Trump.\nMany expected a tense and fractious meeting between the two New York natives, but instead they met the press with smiles and laughs, and Trump b…",
    "link": "https://biztoc.com/x/529fc48d1349823f",
    "timestamp": "2025-11-23T17:02:41Z"
  },
  {
    "title": "Made in America Again: Treasury Sec. Bessent Unveils First U.S.-Made Rare Earth Magnet in 25 Years",
    "description": "Sec. Bessent: \"We’re ending China’s chokehold on our supply chain.\"\nThe post Made in America Again: Treasury Sec. Bessent Unveils First U.S.-Made Rare Earth Magnet in 25 Years first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/made-in-america-again-treasury-sec-bessent-unveils-first-u-s-made-rare-earth-magnet-in-25-years/",
    "timestamp": "2025-11-23T17:00:47Z"
  },
  {
    "title": "Washington DC is Changing—And These Stats Prove It",
    "description": "Washington, D.C. has changed rapidly in 2025. President Donald Trump’s administration has sought to crack down on crime in the nation’s capital, and to great... Read More\nThe post Washington DC is Changing—And These Stats Prove It appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/11/23/washington-dc-is-changing-and-these-stats-prove-it/",
    "timestamp": "2025-11-23T17:00:00Z"
  },
  {
    "title": "Trump Goes On Unhinged Tirade Against Dem “Traitors”",
    "description": "President Donald Trump’s rage has not cooled for the six Democrats who posted a video reminding military and intelligence personnel that their duty is to the Constitution, not to him. The president fired off two Truth Social posts late Saturday night in an al…",
    "link": "https://newrepublic.com/post/203565/trump-seditious-democrat-lawmakers-video",
    "timestamp": "2025-11-23T16:59:43Z"
  },
  {
    "title": "Venezuela: A not-so-covert CIA disaster in the making",
    "description": "Venezuela doesn’t even produce fentanyl, but Washington is still going forward with regime change efforts in Caracas.",
    "link": "https://www.aljazeera.com/opinions/2025/11/23/venezuela-a-not-so-covert-cia-disaster-in-the-making",
    "timestamp": "2025-11-23T16:56:58Z"
  },
  {
    "title": "First G20 on African soil undermined by Trump administration",
    "description": "US boycott and Ukraine talks deflected attention from Cyril Ramaphosa’s agenda",
    "link": "https://www.irishtimes.com/world/2025/11/23/first-g20-on-african-soild-undermined-by-trump-administration/",
    "timestamp": "2025-11-23T16:54:26Z"
  },
  {
    "title": "STEVE MILLOY: We Are More Vulnerable Than Ever To China’s Ominous Threats",
    "description": "I recently warned about the need to assess our vulnerability to Communist China in order to expedite the decoupling of our economy this dangerous rival.",
    "link": "https://dailycaller.com/2025/11/23/opinion-we-are-more-vulnerable-than-ever-to-several-ominous-threats-from-china-steve-milloy/",
    "timestamp": "2025-11-23T16:51:15Z"
  },
  {
    "title": "Trump hits pause button on sending National Guard to New York after his meeting with Mamdani",
    "description": "President Donald Trump has decided to pause sending the National Guard to New York City after meeting with the city's Mayor-elect Zohran Mamdani. The Republican leader has been thinking about whether or not to deploy troops to the Big Apple, similar to what h…",
    "link": "https://freerepublic.com/focus/f-news/4354182/posts",
    "timestamp": "2025-11-23T16:48:39Z"
  },
  {
    "title": "No recession risk for US economy as a whole, Bessent tells NBC",
    "description": "U.S. Treasury Secretary Scott Bessent said the 43-day government shutdown resulted in a permanent economic loss of $11 billion, even as he expressed confidence about growth prospects in 2026. He said interest rate–sensitive sectors such as housing had slipped…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-recession-risk-for-us-economy-as-a-whole-bessent-tells-nbc/articleshow/125522394.cms",
    "timestamp": "2025-11-23T16:47:12Z"
  },
  {
    "title": "Russian envoy to US: Until Washington shifts policy, strategic dialogue can’t restart",
    "description": "Alexander Darchiev, the Russian Ambassador to Washington, discusses prospects for relations with the United States Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628247-were-still-talking-russia-us/",
    "timestamp": "2025-11-23T16:45:26Z"
  },
  {
    "title": "PM call with President Trump of the United States: 23 November 2025",
    "description": "The Prime Minister spoke to the President of the United States Donald Trump today.",
    "link": "https://www.gov.uk/government/news/pm-call-with-president-trump-of-the-united-states-23-november-2025",
    "timestamp": "2025-11-23T16:41:48Z"
  },
  {
    "title": "Chicago Opens Christmas Season with Multiple Shootings of Teenagers, One Dead",
    "description": "First Chicago lit its official Christmas tree, then the teens began falling from gunshot wounds, with one teen dead.",
    "link": "https://www.westernjournal.com/chicago-opens-christmas-season-multiple-shootings-teenagers-one-dead/",
    "timestamp": "2025-11-23T16:39:15Z"
  },
  {
    "title": "Donald Trump accuses Ukraine of ingratitude as US and Ukrainian officials hail ‘best talks so far’",
    "description": "Ukrainian, US and European officials met in Geneva on Sunday to discuss a draft plan presented by Washington to end the war in Ukraine, after Kyiv and its allies voiced alarm over what they saw as major concessions to the aggressor Russia.",
    "link": "https://www.independent.ie/world-news/europe/donald-trump-accuses-ukraine-of-ingratitude-as-us-and-ukrainian-officials-hail-best-talks-so-far/a970506468.html",
    "timestamp": "2025-11-23T16:37:16Z"
  },
  {
    "title": "Donald Trump accuses Ukraine of ingratitude as officials meet in Geneva on ‘US’ peace plan",
    "description": "Ukrainian, US and European officials met in Geneva on Sunday to discuss a draft plan presented by Washington to end the war in Ukraine, after Kyiv and its allies voiced alarm over what they saw as major concessions to the aggressor Russia.",
    "link": "https://www.independent.ie/world-news/europe/donald-trump-accuses-ukraine-of-ingratitude-as-officials-meet-in-geneva-on-us-peace-plan/a970506468.html",
    "timestamp": "2025-11-23T16:37:16Z"
  },
  {
    "title": "South Africa judges G20 summit a triumph of multilateralism despite US no-show",
    "description": "JOHANNESBURG (Reuters) -South Africa's President Cyril Ramaphosa said on Sunday that the declaration from this weekend's Group of 20 summit reflected a \"renewed commitment to multilateral cooperation\", concluding a meeting that pitted him against his U.S. cou…",
    "link": "https://www.thestar.com.my/news/world/2025/11/24/south-africa-judges-g20-summit-a-triumph-of-multilateralism-despite-us-no-show",
    "timestamp": "2025-11-23T16:37:00Z"
  },
  {
    "title": "Warner: Trump's Ukraine Peace Plan Is 'Almost Entirely from the Russians'",
    "description": "Sunday on ABC's \"This Week,\" Sen. Mark Warner (D-VA) said President Donald Trump's proposed peace plan to end the Ukraine war was \"almost entirely from the Russians.\"\nThe post Warner: Trump’s Ukraine Peace Plan Is ‘Almost Entirely from the Russians’ appeared …",
    "link": "https://www.breitbart.com/clips/2025/11/23/warner-trumps-ukraine-peace-plan-is-almost-entirely-from-the-russians/",
    "timestamp": "2025-11-23T16:35:28Z"
  },
  {
    "title": "Melania Trump Reportedly Told Eric To Be Quiet",
    "description": "Melania Trump Reportedly Told Eric To Be Quietlittlethings.com",
    "link": "https://littlethings.com/entertainment/melania-trump-eric-barron-comments",
    "timestamp": "2025-11-23T16:34:23Z"
  },
  {
    "title": "India, Brazil and Indonesia laid foundation for G20 Summit in South Africa: Ramaphosa",
    "description": "South African President Cyril Ramaphosa said the G20 Leaders’ Summit drew heavily on the groundwork laid by Indonesia, India and Brazil, as he closed the two-day meeting on Sunday. He said the G20 South Africa Leaders’ Declaration reflected a shared commitmen…",
    "link": "https://economictimes.indiatimes.com/news/india/india-brazil-and-indonesia-laid-foundation-for-g20-summit-in-south-africa-ramaphosa/articleshow/125522151.cms",
    "timestamp": "2025-11-23T16:30:28Z"
  },
  {
    "title": "Mamdani says he still believes Trump a ‘fascist’ after cordial White House meeting",
    "description": "NYC Mayor-elect Zohran Mamdani maintains Trump is a 'fascist' after White House meeting, where the two discussed affordability and public safety for New Yorkers.",
    "link": "https://www.foxnews.com/media/mamdani-says-he-still-believes-trump-fascist-after-cordial-white-house-meeting",
    "timestamp": "2025-11-23T16:28:51Z"
  },
  {
    "title": "Trump-Pardoned Ponzi Schemer Faces 37-Year Sentence For $44 Million COVID Scam",
    "description": "A previously convicted Ponzi schemer who had received a pardon from President Donald Trump is heading back to prison due to involvement in a new fraudulent scheme.\nWhat Happened: Eliyahu Weinstein, a resident of New Jersey, is facing a 37-year sentence for a …",
    "link": "https://biztoc.com/x/3d058c05bd5d123c",
    "timestamp": "2025-11-23T16:28:44Z"
  },
  {
    "title": "'Sedition Is a Major Crime': Trump Hammers Democrats Who Told Military to Defy 'Illegal Orders'",
    "description": "The group of Democrat lawmakers who told military members to disobey orders should be locked up, President Donald Trump proposed Saturday.\nThe post ‘Sedition Is a Major Crime’: Trump Hammers Democrats Who Told Military to Defy ‘Illegal Orders’ appeared first …",
    "link": "https://www.breitbart.com/politics/2025/11/23/sedition-is-a-major-crime-president-trump-hammers-democrats-who-told-military-to-defy-illegal-orders/",
    "timestamp": "2025-11-23T16:26:42Z"
  },
  {
    "title": "Behind the scenes at COP30: the all-nighter that secured the final deal",
    "description": "A deal that kept the Europeans, island states and Latin Americans happy - phrased in Saudi Arabia-friendly language - stopped the whole process from falling apart.",
    "link": "https://news.sky.com/story/behind-the-scenes-at-cop30-how-they-reached-the-final-deal-13474547",
    "timestamp": "2025-11-23T16:24:00Z"
  },
  {
    "title": "Trump trade official says $2K tariff payments won't fuel inflation as revenues climb",
    "description": "Trump's trade representative says $2,000 tariff revenue payments won't fuel inflation, dismissing concerns about the one-time checks for American families.",
    "link": "https://www.foxnews.com/politics/trump-trade-official-says-2k-tariff-payments-wont-fuel-inflation-revenues-climb",
    "timestamp": "2025-11-23T16:22:18Z"
  },
  {
    "title": "Merz 'sceptical' Ukraine deal can be reached by Trump's deadline",
    "description": "German Chancellor Friedrich Merz on Sunday voiced doubts over whether a deal on ending the war in Ukraine could be reached in the next few days as demanded...",
    "link": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:251123-99-723195/",
    "timestamp": "2025-11-23T16:20:32Z"
  },
  {
    "title": "Trump says Ukraine ungrateful as officials meet to convince Kyiv to accept peace proposals (Sean Dilley/BBC)",
    "description": "Sean Dilley / BBC:\nTrump says Ukraine ungrateful as officials meet to convince Kyiv to accept peace proposals  —  Summary  — US President Donald Trump says Ukraine's leaders have shown “zero gratitude” over US efforts to end the war  — Minutes before, Ukraine…",
    "link": "https://www.memeorandum.com/251123/p37",
    "timestamp": "2025-11-23T16:20:00Z"
  },
  {
    "title": "GOP Rep. McCaul Calls on Trump to 'Tone Down the Rhetoric'",
    "description": "Sunday on ABC's \"This Week,\" Rep. Michael McCaul (R-TX) said President Donald Trump should \"tone down the rhetoric\" against Democratic lawmakers over their video telling military members about refusing illegal orders.\nThe post GOP Rep. McCaul Calls on Trump t…",
    "link": "https://www.breitbart.com/clips/2025/11/23/gop-rep-mccaul-calls-on-trump-to-tone-down-the-rhetoric/",
    "timestamp": "2025-11-23T16:19:28Z"
  },
  {
    "title": "Carney: No 'burning issue' to bring up with Trump, talks to resume when 'appropriate'",
    "description": "\"When America wants to come back and have conversations on the trade side, we will have those discussions,\" said Prime Minister Mark Carney.",
    "link": "https://www.thestar.com/business/carney-no-burning-issue-to-bring-up-with-trump-talks-to-resume-when-appropriate/article_74ea86d2-c56c-5c4e-8274-1a1ac07578c9.html",
    "timestamp": "2025-11-23T16:12:26Z"
  },
  {
    "title": "The Irish Times view on Cop30: the summit fails to deliver",
    "description": "While the closing agreement does not contradict the scientific consensus and edges the world slightly forward, it is not nearly enough",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/11/23/the-irish-times-view-on-cop30-the-summit-fails-to-deliver/",
    "timestamp": "2025-11-23T16:10:48Z"
  },
  {
    "title": "Trump Blasts Ukraine ‘LEADERSHIP’ for Showing ‘ZERO GRATITUDE’ to US — As Critics Slam His Peace Plan as a Russian ‘Wish List’",
    "description": "Despite critics blasting his administration's Russia-Ukraine peace plan as overly favorable to the former, President Trump attacked Ukrainian leadership.\nThe post Trump Blasts Ukraine ‘LEADERSHIP’ for Showing ‘ZERO GRATITUDE’ to US — As Critics Slam His Peace…",
    "link": "https://www.mediaite.com/media/news/trump-blasts-ukraine-leadership-for-showing-zero-gratitude-to-us-as-critics-slam-his-peace-plan-as-a-russian-wish-list/",
    "timestamp": "2025-11-23T16:07:54Z"
  },
  {
    "title": "Crockett: MTG couldn’t ’take the heat’ from Trump",
    "description": "Crockett: MTG couldn’t ’take the heat’ from Trump\nRep. Jasmine Crockett mocked GOP Rep. Marjorie Taylor Greene’s decision to resign from Congress.\nRep. Jasmine Crockett (D-Texas) noted that she had long been the target of President Donald Trump's ire. | Win M…",
    "link": "https://biztoc.com/x/e07582e2ed4a08e6",
    "timestamp": "2025-11-23T16:06:29Z"
  },
  {
    "title": "'Cultural break.' U.S. senators say relations with Canadian neighbours are suffering",
    "description": "The tariffs imposed on Canada by U.S. President Donald Trump have clearly caused economic pain for Canada, but a U.S. senator from Maine says he's more worried about how Canadians are reacting on a personal level.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/cultural-break-u-s-senators-say-relations-with-canadian-neighbours-are-suffering-9.6989582",
    "timestamp": "2025-11-23T16:01:27Z"
  },
  {
    "title": "Fifty children escape after mass school abduction in Nigeria",
    "description": "The raid on a Christian school came amid a surge of attacks by armed groups in the African nation.",
    "link": "https://www.bbc.com/news/articles/cpwk5qzzppzo",
    "timestamp": "2025-11-23T16:00:45Z"
  },
  {
    "title": "India Turns to U.S. Energy to Shield Itself From Massive Tariffs",
    "description": "India has agreed to deepen its energy trade with the United States in a bid to avoid the introduction of higher tariffs on exports by President Donald Trump. In recent months, Trump has threatened several countries with tariffs if they do not import larger qu…",
    "link": "https://oilprice.com/Energy/Energy-General/India-Turns-to-US-Energy-to-Shield-Itself-From-Massive-Tariffs.html",
    "timestamp": "2025-11-23T16:00:00Z"
  },
  {
    "title": "PM: Not interfering, just facilitating",
    "description": "JOHANNESBURG: Rejecting accu­sations of meddling in Thai­land's border dispute with Cam­bodia, Prime Minister Datuk Seri Anwar Ibrahim said Malaysia remains committed to helping the two countries achieve a peaceful resolution. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/11/24/pm-not-interfering-just-facilitating",
    "timestamp": "2025-11-23T16:00:00Z"
  },
  {
    "title": "TACO Trump Backs Off Threat To Deploy National Guard To New York City",
    "description": "I don't know what went on during the closed doors portion of that meeting between Trump and mayor-elect Zohran Mamdani, but now it looks like Trump is backing down from his threats to deploy the National Guard to New York City:\nPresident Donald Trump has hit …",
    "link": "https://crooksandliars.com/2025/11/taco-trump-backs-threat-deploy-national",
    "timestamp": "2025-11-23T15:56:13Z"
  },
  {
    "title": "Is Donald Trump borrowing Zohran Mamdani’s style? His unexpected outfit sparks hilarious debate",
    "description": "Donald Trump's recent choice of a plush burgundy scarf over a black overcoat has sparked online comparisons to New York City mayor-elect Zohran Mamdani's signature style. This fashion observation followed a surprisingly warm meeting between the two, where Tru…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/is-donald-trump-borrowing-zohran-mamdanis-style-his-unexpected-outfit-sparks-hilarious-debate/articleshow/125521839.cms",
    "timestamp": "2025-11-23T15:55:04Z"
  },
  {
    "title": "Newsom, DeSantis join forces to blast ‘idiotic’ push to allow oil drilling off coasts of California, Florida",
    "description": "The Trump administration announced on Thursday new oil drilling off the California and Florida coasts for the first time in decades, advancing a project that critics say could harm coastal communities and ecosystems, as President Donald Trump seeks to expand …",
    "link": "https://biztoc.com/x/f87e11964f659f73",
    "timestamp": "2025-11-23T15:54:53Z"
  },
  {
    "title": "“American public isn’t stupid”: Slotkin says Trump’s “sedition” threats are a distraction",
    "description": "The senator said Trump's bluster is meant to draw eyes away from the Epstein files.",
    "link": "https://www.salon.com/2025/11/23/american-public-isnt-stupid-slotkin-says-trumps-sedition-threats-are-a-distraction/",
    "timestamp": "2025-11-23T15:51:22Z"
  },
  {
    "title": "Slotkin: My Primary Concern Is Trump Using Military 'Against American Citizens'",
    "description": "Sunday on ABC's \"This Week,\" Sen. Elissa Slotkin (D-MI) said she took part in a propaganda video featuring Democratic lawmakers because she was concerned President Donald Trump would use the military \"against American citizens.\"\nThe post Slotkin: My Primary C…",
    "link": "https://www.breitbart.com/clips/2025/11/23/slotkin-my-primary-concern-is-trump-using-military-against-american-citizens/",
    "timestamp": "2025-11-23T15:48:32Z"
  },
  {
    "title": "Trump White House prepares tariff fallback ahead of court ruling",
    "description": "President Donald Trump’s administration is working behind the scenes on fallback options if the Supreme Court strikes down one of his major tariff authorities, looking to replace the levies as quickly as possible.\nBoth the Commerce Department and the Office o…",
    "link": "https://biztoc.com/x/e43dae4e2fa0b6f0",
    "timestamp": "2025-11-23T15:43:34Z"
  },
  {
    "title": "Christian group in Nigeria says 50 students abducted by gunmen have escaped",
    "description": "Authorities look for missing students and teachers after two major incidents of kidnappings take place within days.",
    "link": "https://www.aljazeera.com/news/2025/11/23/christian-group-in-nigeria-says-50-students-abducted-by-gunmen-have-escaped",
    "timestamp": "2025-11-23T15:43:23Z"
  },
  {
    "title": "Newsom, DeSantis join forces to blast ‘idiotic’ push to allow oil drilling off coasts of California, Florida",
    "description": "The oil industry has been seeking access to new offshore areas, including Southern California and off the coast of Florida.",
    "link": "https://fortune.com/2025/11/23/oil-drilling-coast-california-florida-newsom-desantis/",
    "timestamp": "2025-11-23T15:38:27Z"
  },
  {
    "title": "Watchmen: It's Time for Lindelof, DC Studios to Revisit Emmy Winner",
    "description": "Earlier this month, word came down that writer Alan Moore and artist David Lloyd's comic series V for Vendetta was in series development over at HBO. Although all parties involved either declined to comment on the reporting or didn't respond in time before th…",
    "link": "https://bleedingcool.com/tv/watchmen-its-time-for-lindelof-dc-studios-to-revisit-emmy-winner/",
    "timestamp": "2025-11-23T15:37:04Z"
  },
  {
    "title": "Nicki Minaj issues bold warning over Ambassador Waltz",
    "description": "Nicki Minaj’s recent appearance at the United Nations has thrust the rapper into an unexpected political spotlight, as she partnered with U.S. Ambassador Mike Waltz to address religious persecution in Nigeria. The collaboration, which has sent ripples through…",
    "link": "https://rollingout.com/2025/11/23/nicki-minaj-issues-warning-over-waltz/",
    "timestamp": "2025-11-23T15:36:40Z"
  },
  {
    "title": "NFL's first transgender cheerleader makes claim about Panthers departure: 'I was cut because I’m trans'",
    "description": "The NFL's first transgender cheerleader Justine Lindsay made a wild claim about leaving the Carolina Panthers' organization in the summer.",
    "link": "https://www.foxnews.com/sports/nfls-first-transgender-cheerleader-makes-claim-about-panthers-departure-i-cut-because-im-trans",
    "timestamp": "2025-11-23T15:33:51Z"
  },
  {
    "title": "Treasury secretary says there won't be a recession in 2026",
    "description": "Treasury Secretary Scott Bessent said the U.S. is not at risk of entering a recession, saying he’s confident Americans will feel economic relief in 2026.",
    "link": "https://www.nbcnews.com/politics/trump-administration/treasury-secretary-bessent-us-wont-enter-recession-2026-economy-rcna245411",
    "timestamp": "2025-11-23T15:33:46Z"
  },
  {
    "title": "Carlson and MAGA Outraged By US Ambassador's Secret Meeting With Convited Spy Pollard",
    "description": "Supporters of President Donald Trump are seeking clarity on a covert meeting between U.S. Ambassador to Israel Mike Huckabee and convicted spy Jonathan Pollard.\nWhat Happened: Huckabee had a clandestine meeting in Jerusalem with Pollard, who had previously so…",
    "link": "https://biztoc.com/x/7ee1d05891cf4f62",
    "timestamp": "2025-11-23T15:32:32Z"
  },
  {
    "title": "Trump White House prepares tariff fallback ahead of court ruling",
    "description": "Both the Commerce Department and the Office of the US Trade Representative have studied Plan B options, according to officials familiar with the planning.",
    "link": "https://fortune.com/2025/11/23/what-will-trump-do-about-tariffs-supreme-court-ruling-plan-b/",
    "timestamp": "2025-11-23T15:31:37Z"
  },
  {
    "title": "Report: Trump to designate Muslim Brotherhood as terrorist organization",
    "description": "Just the News reported that US President Donald Trump said that he will designate the Muslim Brotherhood as a foreign terrorist organization.\"It will be done in the strongest and most powerful terms,\" Trump reportedly told Just the News. \"Final documents are …",
    "link": "https://www.israelnationalnews.com/flashes/671011",
    "timestamp": "2025-11-23T15:31:26Z"
  },
  {
    "title": "Why we call the good stuff “gravy”",
    "description": "How a simple sauce became a linguistic stand-in for luck, ease — and the moments that make us say, “It’s all gravy\"",
    "link": "https://www.salon.com/2025/11/23/why-we-call-the-good-stuff-gravy/",
    "timestamp": "2025-11-23T15:30:36Z"
  },
  {
    "title": "NYC mayor-elect stands firm after controversial Trump talk",
    "description": "New York City Mayor-elect Zohran Mamdani made waves during his first meeting with President Donald Trump at the White House, and his subsequent appearance on Meet the Press revealed he has no intention of softening his political stance despite the cordial enc…",
    "link": "https://rollingout.com/2025/11/23/nyc-mayor-elect-stands-firm-after-trump/",
    "timestamp": "2025-11-23T15:30:25Z"
  },
  {
    "title": "Cristiano Ronaldo's sister hits out at haters after meeting with Donald Trump",
    "description": "An unwritten truth says that soccer and politics are like water and oil, that they should not be mixed. Whether directly or indirectly, this combination is often frowned upon and r",
    "link": "https://www.marca.com/en/world-cup/2025/11/23/6923269322601d3c2a8b45a7.html",
    "timestamp": "2025-11-23T15:30:13Z"
  },
  {
    "title": "Trump agrees to Zohran Mamdani",
    "description": "The Overview Even though Trump and the newly elected New York Mayor Zohran Mamdani have different political views, Trump seems to like Mamdani. There could",
    "link": "https://knowyourmeme.com/memes/trump-agrees-to-zohran-mamdani",
    "timestamp": "2025-11-23T15:29:50Z"
  },
  {
    "title": "US-Ukraine talks: Why are European leaders opposing Trump’s peace plan?",
    "description": "Officials from the US, EU and Ukraine meet in Geneva to discuss Donald Trump's plan to end Russia's war with Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/23/us-ukraine-talks-why-are-european-leaders-opposing-trumps-peace-plan",
    "timestamp": "2025-11-23T15:29:44Z"
  },
  {
    "title": "Why is Saudi Arabia doubling down on its relations with the US?",
    "description": "Gulf expert Gregory Gause explains what Saudi Arabia wants from Washington and what Washington wants from Riyadh.",
    "link": "https://www.aljazeera.com/video/the-bottom-line/2025/11/23/why-is-saudi-arabia-doubling-down-on-its-relations-with-the-us",
    "timestamp": "2025-11-23T15:28:23Z"
  },
  {
    "title": "Mamdani Says He Still Thinks Trump Is a Fascist",
    "description": "Sunday on NBC's \"Meet the Press,\" New York City Mayor-elect Zohran Mamdani said he still believed President Donald Trump was a \"fascist\" after their Oval Office meeting.\nThe post Mamdani Says He Still Thinks Trump Is a Fascist appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/11/23/mamdani-says-he-still-thinks-trump-is-a-fascist/",
    "timestamp": "2025-11-23T15:27:01Z"
  },
  {
    "title": "Trump blasts Ukraine for 'zero gratitude' to US as talks start",
    "description": "President Trump criticized Ukraine for lacking gratitude for US support against Russia's invasion, while top US and Ukrainian officials met in Geneva to discuss a peace proposal. Trump expressed frustration over the war's human toll and attacked President Bid…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-blasts-ukraine-for-zero-gratitude-to-us-as-talks-start/articleshow/125521635.cms",
    "timestamp": "2025-11-23T15:26:01Z"
  },
  {
    "title": "‘You Can’t Take the Heat!’ Jasmine Crockett Trashes Longtime Rival Marjorie Taylor Greene for Resigning",
    "description": "Rep. Jasmine Crockett (D-TX) ripped longtime rival Rep. Marjorie Taylor Greene (R-GA) for announcing her sudden resignation from the House.\nThe post ‘You Can’t Take the Heat!’ Jasmine Crockett Trashes Longtime Rival Marjorie Taylor Greene for Resigning first …",
    "link": "https://www.mediaite.com/media/news/you-cant-take-the-heat-jasmine-crockett-trashes-longtime-rival-marjorie-taylor-greene-for-resigning/",
    "timestamp": "2025-11-23T15:24:15Z"
  },
  {
    "title": "Brazilian President Concerned About US Military Presence Off Venezuelan Coast",
    "description": "JOHANNESBURG (Sputnik) - Brazilian President Luiz Inacio Lula da Silva voiced concern on Sunday over US military presence in the Caribbean Sea, saying he wanted to discuss this issue with US President Donald Trump.",
    "link": "https://sputnikglobe.com/20251123/brazilian-president-concerned-about-us-military-presence-off-venezuelan-coast-1123159334.html",
    "timestamp": "2025-11-23T15:23:47Z"
  },
  {
    "title": "Zohran Mamdani says he still believes Trump is a 'fascist' and 'despot' after White House meeting",
    "description": "New York City Mayor-elect Zohran Mamdani said Saturday that he still believes President Donald Trump is a “fascist” and a “despot,” but he viewed their first face-to-face meeting at the White House on Friday as an “opportunity” to work together on lowering th…",
    "link": "https://freerepublic.com/focus/f-news/4354171/posts",
    "timestamp": "2025-11-23T15:23:21Z"
  },
  {
    "title": "Fannie, Freddie shares mimic meme-stock mania with wild swings",
    "description": "Bill Ackman lit the fire and Bill Pulte supercharged it. But now retail investors are fleeing.",
    "link": "https://fortune.com/2025/11/23/fannie-mae-freddie-mac-meme-stock-bill-ackman-pulte/",
    "timestamp": "2025-11-23T15:21:34Z"
  },
  {
    "title": "Donald Trump Blasts Ukraine Leaders Over Peace Talks—'ZERO GRATITUDE'",
    "description": "Ukraine and Russia's demands for a ceasefire deal have remained far apart, despite U.S.-led negotiations.",
    "link": "https://biztoc.com/x/3918fd0481a740ac",
    "timestamp": "2025-11-23T15:21:09Z"
  },
  {
    "title": "Mamdani Asked 'Is Trump a Fascist' in Oval Office Meeting",
    "description": "President Donald Trump said he wants to see Zohran Mamdani succeed, saying after a highly anticipated sitdown that he’d “feel very comfortable” living in a New York run by the mayor-elect and that he doesn’t anticipate cutting off funding for the country’s mo…",
    "link": "https://biztoc.com/x/35647e4de482223e",
    "timestamp": "2025-11-23T15:20:59Z"
  },
  {
    "title": "Accreditation of colleges, once low key, has gotten political",
    "description": "The accreditation process is critical to the survival of institutions of higher education.",
    "link": "https://www.bostonherald.com/2025/11/23/accreditation-of-colleges-once-low-key-has-gotten-political/",
    "timestamp": "2025-11-23T15:20:26Z"
  },
  {
    "title": "'SEDITION AT THE HIGHEST LEVEL!': Trump Doubles Down On Jailing Democrats",
    "description": "In late-night Truth Social posts, Donald J. Trump doubled down on his attacks against the six Democratic military veterans who made a video reminding military members that they do not have to follow \"illegal orders.\" Military members have a duty to refuse the…",
    "link": "https://crooksandliars.com/2025/11/sedition-highest-level-trump-doubles-down",
    "timestamp": "2025-11-23T15:14:36Z"
  },
  {
    "title": "Macron, who called NATO brain dead, warns of end to G-20",
    "description": "Hailing the \"important milestone\" of meeting in Africa, Macron added, \"we must also recognize that the G-20 may be reaching the end of a cycle.”",
    "link": "https://fortune.com/2025/11/23/macron-warns-end-of-g20-nato-brain-dead/",
    "timestamp": "2025-11-23T15:13:11Z"
  },
  {
    "title": "Dems’ ‘disobey!’ video: Letters to the Editor — Nov. 24, 2025",
    "description": "NY Post readers discuss a video with six congressional Democrats telling troops they can disobey “illegal” orders.",
    "link": "https://nypost.com/2025/11/23/opinion/dems-disobey-video-letters/",
    "timestamp": "2025-11-23T15:11:16Z"
  },
  {
    "title": "Trump’s grip on party he remade weakens after string of setbacks",
    "description": "President Donald Trump’s power to bend a compliant Republican Congress to his will has stalled amid a series of political setbacks that threaten to fracture the party heading into next year’s pivotal midterm elections.\nIn the last week, Trump capitulated to f…",
    "link": "https://biztoc.com/x/0661bfd53b3297e2",
    "timestamp": "2025-11-23T15:10:09Z"
  },
  {
    "title": "Trump says he’d ‘feel very comfortable’ in Mamdani’s NYC",
    "description": "President Donald Trump said he wants to see Zohran Mamdani succeed, saying after a highly anticipated sitdown that he’d “feel very comfortable” living in a New York run by the mayor-elect and that he doesn’t anticipate cutting off funding for the country’s mo…",
    "link": "https://biztoc.com/x/adbdf619a222b69a",
    "timestamp": "2025-11-23T15:10:04Z"
  },
  {
    "title": "Trump’s attacks push India, Brazil, South Africa closer together",
    "description": "Leaders met in Johannesburg on the sidelines of the G20 summit on Sunday to give greater importance to a trilateral grouping, the so-called IBSA forum.",
    "link": "https://fortune.com/2025/11/23/trump-pushes-brazil-india-south-africa-together-ibsa-forum-g20-tariffs/",
    "timestamp": "2025-11-23T15:08:04Z"
  },
  {
    "title": "A sheriff, a billionaire, a tinge of scandal. California governor's race packs drama, uncertainty",
    "description": "California’s 2026 governor’s race is shaping into an unusually crowded contest, with former presidential candidates, House members, ex-state and federal officials, a sheriff and multiple wealthy contenders entering the field ahead of Gov. Gavin Newsom’s exit …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-sheriff-a-billionaire-a-tinge-of-scandal-california-governors-race-packs-drama-uncertainty/articleshow/125521453.cms",
    "timestamp": "2025-11-23T15:05:45Z"
  },
  {
    "title": "US senators say Rubio told them Trump’s Ukraine peace plan is Russia's 'wish list'",
    "description": "HALIFAX, Nova Scotia (AP) — Lawmakers critical of President Donald Trump’s approach to ending the Russia-Ukraine war said Saturday they spoke with Secretary of State Marco Rubio who told them that the peace plan Trump is pushing Kyiv to accept is a “wish list…",
    "link": "https://freerepublic.com/focus/f-news/4354169/posts",
    "timestamp": "2025-11-23T15:04:17Z"
  },
  {
    "title": "Trump’s grip on party he remade weakens after string of setbacks",
    "description": "In the last week, he capitulated on the Epstein files, saw a chilly reception for his $2,000 stimulus idea and prompted a debate over midterm priorities.",
    "link": "https://fortune.com/2025/11/23/trump-republican-party-grip-weakens-stimulus-midterms-epstein/",
    "timestamp": "2025-11-23T15:03:35Z"
  },
  {
    "title": "Trump’s attacks push India, Brazil, South Africa closer together",
    "description": "Trump has punished India for its ties with Russia by imposing 50% tariffs on goods shipped to the US, and angered New Delhi with his repeated claims of brokering a ceasefire with Pakistan",
    "link": "https://www.bloomberg.com/news/articles/2025-11-23/trump-s-attacks-push-india-brazil-south-africa-closer-together",
    "timestamp": "2025-11-23T15:03:05Z"
  },
  {
    "title": "Trump Turns South Africa’s G-20 into Tale of Two Summits",
    "description": "If Donald Trump was bent on ruining South Africa’s Group of 20 Summit as part of his overarching attack on the multilateral order, let it be said that he didn’t succeed — but he widened the cracks.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-turns-south-africas-g-20-into-tale-of-two-summits",
    "timestamp": "2025-11-23T15:02:05Z"
  },
  {
    "title": "Ivanka Trump’s new water workout could promote healthy aging, expert says",
    "description": "Paddleboarding offers incredible health benefits, including core strength, balance training and stress relief. An expert explains why Ivanka Trump's water sport works.",
    "link": "https://www.foxnews.com/health/ivanka-trump-new-water-workout-could-promote-healthy-aging-expert-says",
    "timestamp": "2025-11-23T15:00:35Z"
  },
  {
    "title": "Obama wanted shutdown pain to be felt by Americans, while Trump kept focus on Washington, experts argue",
    "description": "Government shutdowns under President Donald Trump and former President Barack Obama both centered on Obamacare but featured opposing tactics for managing pressure.",
    "link": "https://www.foxnews.com/politics/obama-wanted-shutdown-pain-felt-americans-while-trump-kept-focus-washington-experts-argue",
    "timestamp": "2025-11-23T15:00:26Z"
  },
  {
    "title": "Demands Dems be jailed...",
    "description": "President continues to insist Democrats committed ‘sedition’ while avoiding another direct call for their deaths",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/trump-democrats-truth-social-military-b2870791.html",
    "timestamp": "2025-11-23T15:00:16Z"
  },
  {
    "title": "Quotes Of The Week: DWTS, NCIS: ﻿Origins, Elsbeth, The Simpsons And More",
    "description": "This week's best lines come from Dancing With the Stars, NCIS: Origins, Elsbeth and more!",
    "link": "https://www.tvline.com/2032949/dancing-with-the-stars-alfonso-ribeiro-skybox-joke-best-tv-quotes/",
    "timestamp": "2025-11-23T15:00:00Z"
  },
  {
    "title": "Trump Orders U.S. Embassies to “Take Note” of Countries Where Authorities Promote or Fund Abortions, Euthanasia, Gender Reassignment Surgeries on Minors, or Diversity Policies",
    "description": "This is a Gateway Hispanic article.\nThe post Trump Orders U.S. Embassies to “Take Note” of Countries Where Authorities Promote or Fund Abortions, Euthanasia, Gender Reassignment Surgeries on Minors, or Diversity Policies appeared first on The Gateway Pundit.",
    "link": "https://gatewayhispanic.com/2025/11/trump-orders-u-s-embassies-take-note-countries/",
    "timestamp": "2025-11-23T15:00:00Z"
  },
  {
    "title": "Bisignano Meeting the Urgency of Now in Running the Social Security Administration",
    "description": "WOODLAWN, Maryland—There is a pattern in the Trump administration that if you are very good at the first job you are appointed to, you are... Read More\nThe post Bisignano Meeting the Urgency of Now in Running the Social Security Administration appeared first …",
    "link": "https://www.dailysignal.com/2025/11/23/bisignano-meeting-urgency-now-running-social-security-administration/",
    "timestamp": "2025-11-23T15:00:00Z"
  },
  {
    "title": "Trump says he’d ‘feel very comfortable’ in Mamdani’s NYC",
    "description": "Asked if he was still considering cutting funding to New York, Trump said: “I don’t think that’s going to happen.”",
    "link": "https://fortune.com/2025/11/23/trump-zohran-mamdani-new-york-very-comfortable-agree-friendly-meeting/",
    "timestamp": "2025-11-23T14:58:53Z"
  },
  {
    "title": "GOP Rep. McCaul says he would advise Ukraine not to sign Trump's current peace plan",
    "description": "GOP Rep. McCaul says he would advise Ukraine not to sign Trump's current peace plango.com",
    "link": "https://abcnews.go.com/Politics/gop-rep-mccaul-advise-ukraine-sign-trumps-peace/story?id=127797940",
    "timestamp": "2025-11-23T14:55:44Z"
  },
  {
    "title": "Trump says Ukrainian leaders have shown 'zero gratitude' for US support",
    "description": "It comes after the US presented Ukraine with a 28-point peace plan and gave President Volodymyr Zelenskyy a week to accept its terms.",
    "link": "https://www.abc.net.au/news/2025-11-24/trump-says-ukraine-zero-gratitude-us-support/106043358",
    "timestamp": "2025-11-23T14:55:20Z"
  }
]