[
  {
    "title": "Ben & Jerry's board accuses Israel of 'genocide' in Gaza, deepening Unilever feud",
    "description": "Ben & Jerry's independent board escalates its feud with parent company Unilever, issuing a statement denouncing the Gaza conflict as \"genocide.\"",
    "link": "https://www.israelnationalnews.com/news/409220",
    "timestamp": "2025-05-30T02:23:12Z"
  },
  {
    "title": "Elon exiled, tariffs turfed: Welcome to the MAGA meltdown",
    "description": "The second Trump administration is reverting to type as the pain of actually having to govern kicks in.\nThe post Elon exiled, tariffs turfed: Welcome to the MAGA meltdown appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/05/30/elon-musk-tariffs-donald-trump-usa-recap/",
    "timestamp": "2025-05-30T02:22:51Z"
  },
  {
    "title": "Trump's Lawyers Claim Kamala Harris' '60 Minutes' Interview Caused Him 'Mental Anguish'",
    "description": "The president reportedly turned down a $15 million settlement offer from CBS because he's seeking millions more and an apology.",
    "link": "https://www.huffpost.com/entry/trump-claim-kamala-harris-60-minutes-interview-mental-anguish_n_6838ebe1e4b09b466de9b66f",
    "timestamp": "2025-05-30T02:22:46Z"
  },
  {
    "title": "Bernie Kerik, who served as NYPD commissioner during 9/11 attacks, dies at 69",
    "description": "Bernie Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died",
    "link": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
    "timestamp": "2025-05-30T02:19:06Z"
  },
  {
    "title": "US-Chinese trade talks ‘stalled’ – Treasury Secretary",
    "description": "Presidents Trump and Xi may need to get personally involved to accelerate US-Chinese trade talks, Treasury Secretary Scott Bessent has said Read Full Article at RT.com",
    "link": "https://www.rt.com/business/618338-us-china-trade-talks-stalled/",
    "timestamp": "2025-05-30T02:18:54Z"
  },
  {
    "title": "Ex-NY Police Commissioner Bernie Kerik, Who Pleaded Guilty To Federal Tax Fraud, Has Died",
    "description": "Bernie Kerik, who served as New York City’s police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died.",
    "link": "https://www.huffpost.com/entry/us-bernie-kerik-obit_n_68391443e4b03a503eaa4bb8",
    "timestamp": "2025-05-30T02:18:53Z"
  },
  {
    "title": "How Julie Chrisley Feels About Ditching Her Blonde Hair After Prison",
    "description": "Julie Chrisley has left prison a changed woman.\nA day after she and husband Todd Chrisley walked free thanks to presidential pardons from Donald Trump, the Chrisley Knows Best matriarch debuted a...",
    "link": "https://www.eonline.com/news/1418129/julie-chrisley-ditching-blonde-hair-for-good-after-prison",
    "timestamp": "2025-05-30T02:17:50Z"
  },
  {
    "title": "Heritage President Argues That America is Entering a ‘Golden Age’",
    "description": "Is America heading into a “golden age” in President Donald Trump’s second term? That was the question put up for discussion Thursday in a Munk... Read More\nThe post Heritage President Argues That America is Entering a ‘Golden Age’ appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/05/29/heritage-president-argues-that-america-is-entering-a-golden-age/",
    "timestamp": "2025-05-30T02:17:50Z"
  },
  {
    "title": "DOT Sec. Duffy Announces 'Great American Road Trip' to Stimulate Economy",
    "description": "WASHINGTON, DC — Transportation Secretary Sean Duffy announced his department's project to celebrate the United States' 250th birthday while also stimulating the economy — the Great American Road Trip.\nThe post DOT Sec. Duffy Announces ‘Great American Road Tr…",
    "link": "https://www.breitbart.com/economy/2025/05/29/dot-sec-duffy-announces-great-american-road-trip-to-stimulate-economy/",
    "timestamp": "2025-05-30T02:16:28Z"
  },
  {
    "title": "GM CEO Mary Barra backs Trump’s auto tariffs as a tool to help US manufacturers ‘level the playing field’",
    "description": "General Motors CEO Mary Barra is voicing support for the Trump administration’s automotive tariffs, arguing they allow U.S. automakers to compete more fairly in the international market.",
    "link": "https://nypost.com/2025/05/29/business/gm-ceo-mary-barra-backs-trumps-auto-tariffs-as-a-tool-to-help-us-manufacturers/",
    "timestamp": "2025-05-30T02:16:22Z"
  },
  {
    "title": "Trump's tariffs to remain in effect after appeals court grants stay",
    "description": "A federal appeals court temporarily reinstated the most sweeping of Trump's tariffs a day after a US trade court ruled that Trump had exceeded his authority in imposing the duties and ordered a block",
    "link": "https://www.jpost.com/international/article-856041",
    "timestamp": "2025-05-30T02:16:21Z"
  },
  {
    "title": "U.N. eyes budget and job cuts for 2026 as U.S. scales back aid",
    "description": "The U.N. Secretariat is preparing to cut its $3.7 billion budget by 20% and slash about 6,900 jobs, according to an internal memo.",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/world/un-job-cuts/",
    "timestamp": "2025-05-30T02:16:00Z"
  },
  {
    "title": "US SEC dismisses lawsuit against Binance crypto exchange",
    "description": "The SEC sued Binance and Zhao in June 2023, accusing the exchange of artificially inflating trading volumes, diverting customer funds and misleading investors about its surveillance controls. Binance was also accused of unlawfully facilitating trading of seve…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-sec-dismisses-lawsuit-against-binance-crypto-exchange/articleshow/121502060.cms",
    "timestamp": "2025-05-30T02:15:22Z"
  },
  {
    "title": "Trump's lost control of his tariff see-saw, making his aims even harder",
    "description": "Since Trump's \"Liberation Day\" tariffs were announced, they have been changing constantly. But does the escalating court battle to implement them give the president an off-ramp to soften his second-term trade agenda without facing political fallout?",
    "link": "https://www.abc.net.au/news/2025-05-30/donald-trump-tariff-trade-war-court-uncertainty/105356192",
    "timestamp": "2025-05-30T02:08:31Z"
  },
  {
    "title": "Dollar poised for fifth-straight monthly drop on trade, fiscal uncertainty",
    "description": "The U.S. dollar weakened, marking its fifth consecutive monthly drop. Trade and fiscal uncertainties loomed. Investors awaited a key inflation report. Trump's tariff policies added to market worries. Emerging market currencies gained. The Japanese yen rose af…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-poised-for-fifth-straight-monthly-drop-on-trade-fiscal-uncertainty/articleshow/121501980.cms",
    "timestamp": "2025-05-30T02:07:16Z"
  },
  {
    "title": "Trump administration reverses MSHA office closures",
    "description": "The Trump administration is dropping plans to terminate leases for 34 offices in the Mine Safety and Health Administration.",
    "link": "https://www.wcvb.com/article/trump-administration-reverses-msha-office-closures/64921687",
    "timestamp": "2025-05-30T02:06:07Z"
  },
  {
    "title": "Judge extends block on Harvard foreign student ban",
    "description": "Federal judge extends temporary order blocking the Trump administration's revocation of Harvard's ability to enroll international students.",
    "link": "https://www.israelnationalnews.com/news/409219",
    "timestamp": "2025-05-30T02:01:15Z"
  },
  {
    "title": "President Trump to Hold Press Conference With Elon Musk Friday",
    "description": "Contrary to gossipy media reports, it looks like the bromance between President Donald Trump and Elon Musk is not over.\nThe post President Trump to Hold Press Conference With Elon Musk Friday appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/president-trump-hold-press-conference-elon-musk-friday/",
    "timestamp": "2025-05-30T02:00:56Z"
  },
  {
    "title": "Op-Ed: Tariffs vs government powers – The courts will win eventually.",
    "description": "Now try and convince the rest of the world you’re not out of your minds. It won’t be easy.\nThe post Op-Ed: Tariffs vs government powers – The courts will win eventually. appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/op-ed-tariffs-vs-government-powers-the-courts-will-win-eventually/article",
    "timestamp": "2025-05-30T02:00:53Z"
  },
  {
    "title": "Between a smack and a hard place — Poland votes, Orbán provokes, and Brussels shows its teeth",
    "description": "Slaps were exchanged — some literal, some political — and suddenly Brussels isn’t just watching from the sidelines. This week on EU Confidential, we dive into a whirlwind of action across the continent: a presidential toss-up coming up this Sunday in Poland; …",
    "link": "https://www.politico.eu/podcast/eu-confidential/between-a-smack-and-a-hard-place-poland-votes-orban-provokes-and-brussels-shows-its-teeth/",
    "timestamp": "2025-05-30T02:00:00Z"
  },
  {
    "title": "Trump picks Paul Ingrassia to head U.S. Office of Special Counsel (Swapna Venugopal Ramaswamy/USA Today)",
    "description": "Swapna Venugopal Ramaswamy / USA Today:\nTrump picks Paul Ingrassia to head U.S. Office of Special Counsel  —  President Donald Trump announced Paul Ingrassia, who is currently a White House liaison for the Department of Homeland Security, as his pick to head …",
    "link": "https://www.memeorandum.com/250529/p150",
    "timestamp": "2025-05-30T01:55:01Z"
  },
  {
    "title": "Law Enforcement Titan Bernie Kerik Dead At 69",
    "description": "Former NYPD Commissioner Bernard Kerik died Thursday at the age of 69 after a private battle with cardiac illness, his family confirmed.",
    "link": "https://dailycaller.com/2025/05/29/bernie-kerik-dead-69/",
    "timestamp": "2025-05-30T01:54:15Z"
  },
  {
    "title": "Silk Road Founder Ross Ulbricht to Bitcoiners: ‘Freedom is Worth the Struggle’",
    "description": "Ulbright told the crowd a story from his youth about killing wasps in order to illustrate his point that, without unity and decentralization, there is no freedom.",
    "link": "https://www.coindesk.com/policy/2025/05/29/silk-road-founder-ross-ulbricht-to-bitcoiners-freedom-is-worth-the-struggle",
    "timestamp": "2025-05-30T01:53:34Z"
  },
  {
    "title": "Macron and Hegseth to address China and the Ukraine war at Singapore security forum",
    "description": "World leaders and defense officials are convening in Singapore for a security forum addressing China's assertiveness, the Ukraine war's global impact, and Asian conflicts. Emmanuel Macron's keynote will likely address these issues, including the pressure from…",
    "link": "https://economictimes.indiatimes.com/news/defence/macron-and-hegseth-to-address-china-and-the-ukraine-war-at-singapore-security-forum/articleshow/121501820.cms",
    "timestamp": "2025-05-30T01:52:37Z"
  },
  {
    "title": "Trump denounces court’s 'political' tariff decision, calls on Supreme Court to act quickly",
    "description": "President Trump criticized a recent court ruling on his tariff plan on Thursday. He directed criticism to the Federalist Society and expressed disappointment in judicial nominations.",
    "link": "https://www.foxnews.com/politics/trump-denounces-courts-political-tariff-decision-calls-supreme-court-act-quickly",
    "timestamp": "2025-05-30T01:52:34Z"
  },
  {
    "title": "Western businesses will not return to Russia",
    "description": "Russia’s much-touted “no-limits” partnership with China has proven an inadequate substitute for its largely severed ties to the West.",
    "link": "https://www.japantimes.co.jp/commentary/2025/05/30/world/western-businesses-russia-return/",
    "timestamp": "2025-05-30T01:50:00Z"
  },
  {
    "title": "U.S.-China talks 'a bit stalled' and need Trump and Xi to weigh in, Treasury Secretary Bessent says",
    "description": "U.S.-China trade talks are \"a bit stalled,\" requiring the two countries' leaders to speak directly, Treasury Secretary Scott Bessent told Fox News.",
    "link": "https://www.cnbc.com/2025/05/30/us-china-talks-bit-stalled-and-need-trump-and-xi-to-weigh-in-treasury-secretary-bessent-says.html",
    "timestamp": "2025-05-30T01:49:40Z"
  },
  {
    "title": "Republican Says US Should End All Military Aid to Israel",
    "description": "Representative Thomas Massie of Kentucky has previously voted against sending U.S. aid to Israel.",
    "link": "https://www.newsweek.com/thomas-massie-us-israel-military-aid-2078784",
    "timestamp": "2025-05-30T01:48:34Z"
  },
  {
    "title": "Utah Pharmacist Reacts to NBA YoungBoy’s Presidential Pardon",
    "description": "SALT LAKE CITY — A Utah pharmacist is upset the man who admitted to breaking into his pharmacy has been let off the hook. On May 28, President Donald Trump pardoned 25-year-old rapper NBA YoungBoy, who had been sentenced to nearly two years in jail in Utah ba…",
    "link": "https://freerepublic.com/focus/f-news/4319903/posts",
    "timestamp": "2025-05-30T01:47:52Z"
  },
  {
    "title": "What is Humphrey's Executor? A look at the 90-year-old Supreme Court decision",
    "description": "WASHINGTON (AP) — A month into President Donald Trump ‘s second term, lawyers for the Republican administration seem intent on provoking a legal fight to overturn a 90-year-old Supreme Court decision known as Humphrey’s Executor that has been critical to the …",
    "link": "https://www.theusconstitution.org/news/what-is-humphreys-executor-a-look-at-the-90-year-old-supreme-court-decision-trump-is-targeting/",
    "timestamp": "2025-05-30T01:47:00Z"
  },
  {
    "title": "FBI leaders say jail video shows that Jeffrey Epstein died by suicide",
    "description": "FBI leaders Kash Patel and Dan Bongino say surveillance video shows that convicted sex offenderJeffrey Epstein died by suicide in his jail cell in 2019.",
    "link": "https://www.nbcnews.com/politics/justice-department/dan-bongino-kash-patel-jeffrey-epstein-rcna209871",
    "timestamp": "2025-05-30T01:46:10Z"
  },
  {
    "title": "Rosie O’Donnell on Romancing Miranda in ‘And Just Like That’ and Moving to Ireland to Escape Trump: ‘When Would It Be Safe to Come Back?’",
    "description": "SPOILER ALERT: This story contains spoilers for “Outlook Good,” Season 3, Episode 1 of “And Just Like That,” now streaming on HBO Max. And just like that, Rosie O’Donnell has made a splashy return to comedy.  On the season premiere of “And Just Like That,” O’…",
    "link": "https://variety.com/2025/tv/news/rosie-odonnell-and-just-like-that-ireland-trump-1236399222/",
    "timestamp": "2025-05-30T01:44:00Z"
  },
  {
    "title": "Targeting Foreign Students, Trump Hits A US Lifeline",
    "description": "On the campaign trail last year, then-candidate Donald Trump proposed handing US residency cards automatically to international students when they earn diplomas, bemoaning that they were leaving to form successful companies in China and India.",
    "link": "https://www.ibtimes.com.au/targeting-foreign-students-trump-hits-us-lifeline-1859157",
    "timestamp": "2025-05-30T01:42:24Z"
  },
  {
    "title": "Targeting foreign students, Trump hits a US lifeline",
    "description": "On the campaign trail last year, then-candidate Donald Trump proposed handing US residency cards automatically to international students when they earn diplomas, bemoaning that they were leaving to form successful companies in China and India. Now back at the…",
    "link": "https://www.digitaljournal.com/world/targeting-foreign-students-trump-hits-a-us-lifeline/article",
    "timestamp": "2025-05-30T01:42:20Z"
  },
  {
    "title": "Rocket Lab signs $460 million deal to build missile defence system",
    "description": "The aim of the defence dome is to create a shield that can shoot down all sorts of missiles including nuclear warheads.",
    "link": "https://www.rnz.co.nz/news/business/562663/rocket-lab-signs-460-million-deal-to-build-missile-defence-system",
    "timestamp": "2025-05-30T01:42:16Z"
  },
  {
    "title": "Targeting Foreign Students, Trump Hits A US Lifeline",
    "description": "On the campaign trail last year, then-candidate Donald Trump proposed handing US residency cards automatically to international students when they earn diplomas, bemoaning that they were leaving to form successful companies in China and India.",
    "link": "https://www.ibtimes.com/targeting-foreign-students-trump-hits-us-lifeline-3774902",
    "timestamp": "2025-05-30T01:42:15Z"
  },
  {
    "title": "Trump admin said to be considering 15% tariffs for 150 days",
    "description": "United States President Donald Trump's administration is allegedly considering imposing 15% tariffs on large parts of the global economy for 150 days, invoking an existing trade law that would all...",
    "link": "https://biztoc.com/x/121a59a9af17dcb0",
    "timestamp": "2025-05-30T01:42:12Z"
  },
  {
    "title": "Trump Says He Is Having Elon Musk Over At The White House Tomorrow For A Press Conference As Billionaire Exits Government: 'This Will Be His Last Day, But Not Really…'",
    "description": "On Thursday night, President Donald Trump said that he will host Elon Musk at the White House on Friday to mark the Tesla Inc. (NASDAQ:TSLA) CEO's departure from his official role leading the administration's Department of Government Efficiency.\nWhat Happened…",
    "link": "https://biztoc.com/x/3409d022b0c60d25",
    "timestamp": "2025-05-30T01:41:30Z"
  },
  {
    "title": "DOGE is already catastrophic and will continue to be",
    "description": "As Elon at least formally (although not necessarily in terms of actual influence) steps away from his government role, it’s critical to accurately summarize what he’s done: The flood of encomiums and morality tales about Elon's turn in Washington cldn't be mo…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/doge-is-already-catastrophic-and-will-continue-to-be",
    "timestamp": "2025-05-30T01:41:12Z"
  },
  {
    "title": "Julie Chrisley Has No Plans to Return to Blonde Hair After Prison Stay",
    "description": "Julie Chrisley is not planning to return to her trademark blonde hairstyle now that she and husband Todd have been released from prison, according to her son Chase. Chase, 28, weighed in on his mom’s locks while speaking to Entertainment Tonight on Thursday, …",
    "link": "https://www.usmagazine.com/celebrity-news/news/julie-chrisley-hair-change-after-prison-chase-chrisley-reacts/#article",
    "timestamp": "2025-05-30T01:36:56Z"
  },
  {
    "title": "UN may cut staff by 20%, internal memo says",
    "description": "The United Nations plans to reduce its budget by 20 percent. Around 6,900 jobs may be cut. This is due to a financial crisis. The United States owes the UN $1.5 billion. The cuts are part of a review to ensure the UN is fit for purpose. Secretary General Anto…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/un-may-cut-staff-by-20-internal-memo-says/articleshow/121501696.cms",
    "timestamp": "2025-05-30T01:36:26Z"
  },
  {
    "title": "The US academic partnership with China, under strain for years, faces its biggest threat",
    "description": "America and China's academic relations face strain. The US plans to revoke visas for some Chinese students. This move worries universities, which benefit from Chinese tuition. Some fear a loss of talent and research collaboration. Critics cite security risks …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-us-academic-partnership-with-china-under-strain-for-years-faces-its-biggest-threat/articleshow/121501688.cms",
    "timestamp": "2025-05-30T01:35:17Z"
  },
  {
    "title": "Todd Chrisley smiles in first public outing since Trump pardon",
    "description": "Todd Chrisley looked happy as he went on his first public outing on Thursday following his release from prison.",
    "link": "https://nypost.com/2025/05/29/entertainment/todd-chrisley-smiles-in-first-public-outing-since-trump-pardon/",
    "timestamp": "2025-05-30T01:34:14Z"
  },
  {
    "title": "Top Japan shipper sees orders recovering as trade tensions ease",
    "description": "Nippon Yusen saw a robust recovery in container shipping orders following an easing in tensions between the United States and some of its trading partners this month.",
    "link": "https://www.japantimes.co.jp/business/2025/05/30/companies/japan-shipper-orders-recover/",
    "timestamp": "2025-05-30T01:34:00Z"
  },
  {
    "title": "Analysis: South Korea's presidential election set to reshape policies for key US ally",
    "description": "SEOUL: South Korean liberal candidate Lee Jae-myung is projected to win next week's",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-presidential-election-reshape-policies-us-ally-5159571",
    "timestamp": "2025-05-30T01:31:02Z"
  },
  {
    "title": "Someone Is Reportedly Impersonating Trump’s Chief of Staff in Texts to GOP Bigwigs and Business Titans",
    "description": "Federal officials are investigating an impersonation of White House Chief of Staff Susie Wiles, The Wall Street Journal reported on Thursday night.\nThe post Someone Is Reportedly Impersonating Trump’s Chief of Staff in Texts to GOP Bigwigs and Business Titans…",
    "link": "https://www.mediaite.com/politics/trump/someone-is-reportedly-impersonating-trumps-chief-of-staff-in-texts-to-gop-bigwigs-and-business-titans/",
    "timestamp": "2025-05-30T01:30:52Z"
  },
  {
    "title": "Drones, doubts as US allies look to NATO summit",
    "description": "Estonia focuses on advanced military tech amid Russian pressure. Baltic states and others boost defense spending. The US plans troop cuts in Europe, pushing NATO allies to increase defense spending. US shifts focus to homeland defense and China. Concerns aris…",
    "link": "https://economictimes.indiatimes.com/news/defence/drones-doubts-as-us-allies-look-to-nato-summit/articleshow/121501648.cms",
    "timestamp": "2025-05-30T01:30:25Z"
  },
  {
    "title": "Taoiseach Micheál Martin urges calm after Fianna Fáil TD says British Army never shot Irish civilians",
    "description": "There was “horrendous violence” in the North “perpetrated by the British state and other actors, but the emphasis now has to be on reconciliation”, Taoiseach Micheál Martin has said.",
    "link": "https://www.independent.ie/irish-news/taoiseach-micheal-martin-urges-calm-after-fianna-fail-td-says-british-army-never-shot-irish-civilians/a634554899.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Nandita Bose: The tumultuous tour of Trump’s tech-bro-in-chief comes to an end",
    "description": "Elon Musk’s White House exit  was quick and unceremonious. He did not have a formal conversation with Donald Trump before announcing his exit, according to a source with knowledge of the matter, who added that his departure was decided “at a senior staff leve…",
    "link": "https://www.independent.ie/world-news/north-america/nandita-bose-the-tumultuous-tour-of-trumps-tech-bro-in-chief-comes-to-an-end/a1107216876.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Donald Trump commutes notorious gang leader’s sentence after lobbying by Kanye West",
    "description": "US president Donald Trump has commuted the sentence of notorious former gang leader Larry Hoover after being lobbied for years by Kanye West.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-commutes-notorious-gang-leaders-sentence-after-lobbying-by-kanye-west/a1350246422.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Waterland eyes €150m of Irish deals despite Trump tariff uncertainty",
    "description": "Irish companies focused on European expansion are now a better investment bet than US-oriented ventures, according to Laura Dillon of Waterland Private Equity, which has emerged as a significant backer of SMEs here since 2019.",
    "link": "https://www.independent.ie/business/small-business/waterland-eyes-150m-of-irish-deals-despite-trump-tariff-uncertainty/a1237449011.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Irish fintech mogul Terry Clune won’t be bidding for UK currency group Argentex",
    "description": "Irish fintech entrepreneur Terry Clune does not now intend to make an offer to buy embattled listed UK currency management services minnow Argentex.",
    "link": "https://www.independent.ie/business/irish-fintech-mogul-terry-clune-wont-be-bidding-for-uk-currency-group-argentex/a978574967.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Musk said he's leaving the White House. Here's what we do (and don't) know about the departure",
    "description": "In an X post, the tech billionaire announced his \"scheduled time as a Special Government Employee\" had come to an end.",
    "link": "https://www.snopes.com//news/2025/05/30/musk-leaving-white-house/",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Nigel Farage’s ‘fantasies’ would ruin the UK economy, warns Keir Starmer",
    "description": "Reform UK leader Nigel Farage is attempting to woo younger voters by announcing a Donald Trump-style foray into cryptocurrency policy at a Bitcoin conference in Las Vegas late yesterday.",
    "link": "https://www.independent.ie/world-news/britain/nigel-farages-fantasies-would-ruin-the-uk-economy-warns-keir-starmer/a491679364.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Taoiseach Micheál Martin urges calm after Fianna Fáil TD says British Army never shot Irish civilians",
    "description": "There was “horrendous violence” in the North “perpetrated by the British state and other actors, but the emphasis now has to be on reconciliation”, Taoiseach Micheál Martin has said.",
    "link": "https://www.independent.ie/irish-news/politics/taoiseach-micheal-martin-urges-calm-after-fianna-fail-td-says-british-army-never-shot-irish-civilians/a634554899.html",
    "timestamp": "2025-05-30T01:30:00Z"
  },
  {
    "title": "Trump wins temporary relief as court allows tariffs under emergency powers",
    "description": "This comes after a lower federal trade court ruled that Trump had overstepped his authority by imposing sweeping tariffs on imports from multiple countries, citing a national emergency",
    "link": "https://www.thehindubusinessline.com/news/world/trump-wins-temporary-relief-as-court-allows-tariffs-under-emergency-powers/article69636284.ece",
    "timestamp": "2025-05-30T01:27:41Z"
  },
  {
    "title": "A bad wrap: An angry Trump blasts the ‘TACO Theory’",
    "description": "President Donald Trump made no pretense at hiding his irritation this week when he was asked by a reporter about “TACO” — an acronym that has been gaining traction among Wall Street traders who believe that “Trump Always Chickens Out.”  The so-called “TACO Th…",
    "link": "https://www.digitaljournal.com/world/a-bad-wrap-an-angry-trump-blasts-the-taco-theory/article",
    "timestamp": "2025-05-30T01:27:32Z"
  },
  {
    "title": "A Bad Wrap: An Angry Trump Blasts The 'TACO Theory'",
    "description": "President Donald Trump made no pretense at hiding his irritation this week when he was asked by a reporter about \"TACO\" -- an acronym that has been gaining traction among Wall Street traders who believe that \"Trump Always Chickens Out.\"",
    "link": "https://www.ibtimes.com/bad-wrap-angry-trump-blasts-taco-theory-3774900",
    "timestamp": "2025-05-30T01:27:11Z"
  },
  {
    "title": "Bernard Kerik, former New York police commissioner and 9/11 figure, dies at 69",
    "description": "Bernard Kerik, former NYC police commissioner and 9/11 hero, dies at 69. Known for his rise during 9/11, later faced legal issues, and was pardoned by Trump.",
    "link": "https://www.foxnews.com/us/bernard-kerik-former-new-york-police-commissioner-9-11-figure-dies-69",
    "timestamp": "2025-05-30T01:26:25Z"
  },
  {
    "title": "Trump administration weighs 15% tariffs for 150 days under existing law: Report",
    "description": "The Trump administration is reportedly considering a temporary plan to impose tariffs of up to 15% on goods from around the world, using an existing law that permits such measures for 150 days. According to The Wall Street Journal, this would act as a stopgap…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-weighs-15-tariffs-for-150-days-under-existing-law-report/articleshow/121501620.cms",
    "timestamp": "2025-05-30T01:26:02Z"
  },
  {
    "title": "Trump administration considers allowing tariffs of up to 15% for 150 days, WSJ reports",
    "description": "President Donald Trump's administration is considering a stopgap effort to impose tariffs on large parts of the global economy under an existing law that includes language allowing for tariffs of up to 15 per cent for 150 days, the Wall Street Journal reporte…",
    "link": "https://www.channelnewsasia.com/business/trump-administration-considers-allowing-tariffs-up-15-150-days-wsj-reports-5159601",
    "timestamp": "2025-05-30T01:23:36Z"
  },
  {
    "title": "Wall Street ends up with Nvidia, appeals court reinstates Trump tariffs",
    "description": "Trading was choppy for much of the day and indexes ended well off their highs of the session, however, with investors trying to digest the rulings and as shares of Salesforce fell 3.3%. Salesforce's stock was down even as the enterprise software provider rais…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-up-with-nvidia-appeals-court-reinstates-trump-tariffs/articleshow/121501603.cms",
    "timestamp": "2025-05-30T01:23:30Z"
  },
  {
    "title": "U.S. Probes Effort To Impersonate White House Chief Of Staff: Report",
    "description": "U.S. federal authorities are investigating an effort to impersonate White House Chief of Staff Susie Wiles, the Wall Street Journal reported.",
    "link": "https://www.huffpost.com/entry/us-probe-impersonate-white-house-chief-of-staff_n_683906e0e4b03a503eaa4695",
    "timestamp": "2025-05-30T01:23:30Z"
  },
  {
    "title": "Pam Bondi Ends ABA's Role In Vetting Trump's Judicial Nominees",
    "description": "\"The ABA no longer functions as a fair arbiter of nominees' qualifications,\" Trump's attorney general said. Did she forget how unqualified his past court picks were, though?",
    "link": "https://www.huffpost.com/entry/pam-bondi-american-bar-association-trump-judicial-nominees_n_6838c50ae4b0f6df876b1bab",
    "timestamp": "2025-05-30T01:21:56Z"
  },
  {
    "title": "Hamas says US ceasefire proposal means ‘continuation of killing’ in Gaza",
    "description": "Israel has agreed to the deal, according to the US, but Hamas said it does not meet its demands and is under discussion.",
    "link": "https://www.aljazeera.com/news/2025/5/30/hamas-says-us-ceasefire-proposal-means-continuation-of-killing-in-gaza",
    "timestamp": "2025-05-30T01:21:05Z"
  },
  {
    "title": "'Inflection point': Economic fears mount as Trump tariffs are snarled in court. (Politico)",
    "description": "Politico:\n‘Inflection point’: Economic fears mount as Trump tariffs are snarled in court.  —  The fear is that Trump will bristle at both adverse court rulings and perceptions on Wall Street that he's ready to bail on his protectionist agenda.  —  With Presid…",
    "link": "https://www.memeorandum.com/250529/p145",
    "timestamp": "2025-05-30T01:20:00Z"
  },
  {
    "title": "Trump's latest pardons benefit an array of political allies and public figures",
    "description": "The latest pardons by President Donald Trump are another example of him flexing his power to bestow clemency on political allies and prominent public officials, including those convicted of defrauding the public",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-latest-pardons-benefit-array-political-allies-public-122326940",
    "timestamp": "2025-05-30T01:18:24Z"
  },
  {
    "title": "If trade court ruling stands, Trump seen shifting to other options for tariff assault",
    "description": "Legal and trade experts' advice to foreign governments, companies and other clients: Assume the tariffs will resume in one form or another.",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/world/crime-legal/trump-tariff-assault-options/",
    "timestamp": "2025-05-30T01:18:00Z"
  },
  {
    "title": "Trump's tariff tally: $34 billion and counting, global companies say",
    "description": "SummaryCompanies face uncertainty, paralyzing decision-making and affecting profit forecasts Economists predict final costs will be much higher than disclosed Tariffs impact automakers, airlines, and consumer goods importers significantly SAN FRANCISCO/NEW YO…",
    "link": "https://freerepublic.com/focus/f-news/4319897/posts",
    "timestamp": "2025-05-30T01:17:21Z"
  },
  {
    "title": "\"Court should have no role here,\" White House on US court blocking Trump's tariffs",
    "description": "The White House criticizes a US court ruling against Donald Trump's tariff plans. Karoline Leavitt says the court overstepped its authority. She argues judges shouldn't interfere in presidential decisions. The administration has appealed the ruling. The court…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/court-should-have-no-role-here-white-house-on-us-court-blocking-trumps-tariffs/articleshow/121501565.cms",
    "timestamp": "2025-05-30T01:16:53Z"
  },
  {
    "title": "Trump blasts ‘backroom hustlers’ in legal battle over tariffs, says US will lose ‘trillions’",
    "description": "“The ruling by the U.S. Court of International Trade is so wrong, and so political! Hopefully, the Supreme Court will reverse this horrible, Country threatening decision, QUICKLY and DECISIVELY.”…",
    "link": "https://nypost.com/2025/05/29/us-news/trump-blasts-backroom-hustlers-in-legal-battle-over-tariffs/",
    "timestamp": "2025-05-30T01:16:45Z"
  },
  {
    "title": "CNN’s Fareed Zakaria skewers Trump's ‘one-sided romance' with foreign leader",
    "description": "CNN host Fareed Zakaria didn’t mince words when describing President Donald Trump’s longtime fascination with Russian President Vladimir Putin – a relationship that the foreign policy expert described as “the most one-sided romance in diplomatic history.”Spea…",
    "link": "https://www.rawstory.com/cnns-fareed-zakaria-skewers-trump-s-one-side-romance-with-putin/",
    "timestamp": "2025-05-30T01:16:33Z"
  },
  {
    "title": "California AG says he's monitoring Trump's threats over transgender athletes",
    "description": "In an interview with KCRA 3, Bonta would not say if his office is preparing legal action against the Trump administration.",
    "link": "https://www.kcra.com/article/california-ag-monitoring-trumps-threats-transgender-athletes/64922363",
    "timestamp": "2025-05-30T01:16:30Z"
  },
  {
    "title": "Day after being blocked by trade court, Trump's tariffs to remain in effect after appeals court grants stay",
    "description": "A US federal appeals court has temporarily reinstated President Donald Trump’s broad “Liberation Day” tariffs, just one day after a lower trade court ruled he had unlawfully invoked emergency powers to impose them. While the ruling restores the White House’s …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/day-after-being-blocked-by-trade-court-trumps-tariffs-to-remain-in-effect-after-appeals-court-grants-stay/articleshow/121501538.cms",
    "timestamp": "2025-05-30T01:15:25Z"
  },
  {
    "title": "Whitmer: Trump would break promise if he pardons kidnapping plotters (Rick Pluta/Michigan Public)",
    "description": "Rick Pluta / Michigan Public:\nWhitmer: Trump would break promise if he pardons kidnapping plotters  —  Governor Gretchen Whitmer says President Donald Trump would break a promise he made to her if he pardons two men who were convicted of conspiring to kidnap …",
    "link": "https://www.memeorandum.com/250529/p144",
    "timestamp": "2025-05-30T01:15:01Z"
  },
  {
    "title": "The Gaza deal Israel agreed to: Trump to guarantee there will be talks to end the war",
    "description": "According to the cease-fire agreement – a copy of which has been obtained by Haaretz – Hamas will provide full information about the condition of the remaining hostages after releasing 10 of the living hostages and 18 bodies ■ Israel has backed down from its …",
    "link": "https://www.haaretz.com/israel-news/2025-05-30/ty-article/the-gaza-deal-israel-agreed-to-trump-to-guarantee-there-will-be-talks-to-end-the-war/00000197-1e13-d392-a7f7-1f1f6cd80000",
    "timestamp": "2025-05-30T01:14:48Z"
  },
  {
    "title": "DOGE likely to fizzle out without Musk, says ex-staffer",
    "description": "Software engineer Sahil Lavingia, who spent almost two months working for the group of pro-Musk technologists, said he expects DOGE to quickly \"die a whimper.”",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/world/doge-ex-staffer-fizzle-out/",
    "timestamp": "2025-05-30T01:13:00Z"
  },
  {
    "title": "Trump's big plans on trade and more run up against laws of political gravity, separation of powers",
    "description": "President Donald Trump’s big plans on trade, deportations and more are running up against the laws of political gravity and the separation of powers",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-big-plans-trade-run-laws-political-gravity-122325364",
    "timestamp": "2025-05-30T01:10:16Z"
  },
  {
    "title": "The US Is Losing Its Technological Edge",
    "description": "From the Cold War of the twentieth century to today’s US-China rivalry, technology has been a prominent feature of superpower competition. This worked well for the United States in the past, but with Donald Trump’s administration apparently intent on destroyi…",
    "link": "https://www.project-syndicate.org/onpoint/the-us-is-losing-its-technological-edge",
    "timestamp": "2025-05-30T01:09:56Z"
  },
  {
    "title": "The Big Picture",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/the-us-is-losing-its-technological-edge-doc-2025-05",
    "timestamp": "2025-05-30T01:09:52Z"
  },
  {
    "title": "Trump announces press conference with Musk",
    "description": "United States President Donald Trump announced that he will hold a press conference in the Oval Office tomorrow at 1:30 pm EST, during which he will be accompanied by billionaire entrepreneur Elon Mus...",
    "link": "https://biztoc.com/x/91658fa33f39c46b",
    "timestamp": "2025-05-30T01:08:14Z"
  },
  {
    "title": "DHS Presents ‘Absolutely Staggering’ Statistics Of How Many Chinese Nationals Enroll At US Colleges",
    "description": "Assistant Secretary of Homeland Security for Public Affairs Tricia McLaughlin condemned American universities on Fox Business Thursday.",
    "link": "https://dailycaller.com/2025/05/29/tricia-mclaughlin-ccp-harvard/",
    "timestamp": "2025-05-30T01:07:16Z"
  },
  {
    "title": "Chase Chrisley Details Todd and Julie Chrisley's 'Beautiful' Reunion",
    "description": "Chase Chrisley is sharing what it’s like to have his parents, Todd and Julie Chrisley, back under the same roof following their prison release. “I’m emotional. It was a beautiful moment,” Chase said in an interview with Entertainment Tonight on Thursday, May …",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-and-julie-chrisley-reuniting-is-beautiful-says-chase/#article",
    "timestamp": "2025-05-30T01:06:11Z"
  },
  {
    "title": "GOP desperate to believe Trump is 'something that he is not': Conservative",
    "description": "President Donald Trump doesn't stand for true conservative principles, former Washington State Republican Party chair Chris Vance told an MSNBC roundtable on Thursday evening — and the GOP is deluding itself to believe that's the case.Vance was concurring wit…",
    "link": "https://www.rawstory.com/trump-gop-2672232177/",
    "timestamp": "2025-05-30T01:05:14Z"
  },
  {
    "title": "Trump administration pressures ‘sanctuary jurisdictions’ by publishing list of places ‘deliberately obstructing’ immigration enforcement",
    "description": "The department on Thursday published a list of the jurisdictions and said each one will receive formal notification that the government has deemed them noncompliant and if they're believed to be in violation of any federal criminal statutes.",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-pressures-sanctuary-jurisdictions-by-publishing-list-of-places-deliberately-obstructing-immigration-enforcement",
    "timestamp": "2025-05-30T01:05:11Z"
  },
  {
    "title": "CNBC Daily Open: Definite tariffs could be better for markets than on-and-off ones",
    "description": "If there was a concrete tariff of 10% — while it's undeniably still a tax — the surety of it could be better for markets and economies globally in the long run.",
    "link": "https://www.cnbc.com/2025/05/30/cnbc-daily-open-markets-would-prefer-definite-tariffs.html",
    "timestamp": "2025-05-30T01:05:03Z"
  },
  {
    "title": "The Chrisleys stole money. Then Trump pardoned them. That's not a witch hunt.",
    "description": "How much money did the Chrisleys steal? 36 million. The Trump administration pardon list got longer this week anyway as Todd and Julie Chrisley joined the list.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/chrisleys-money-trump-pardon-witch-hunt-rcna209375",
    "timestamp": "2025-05-30T01:04:59Z"
  },
  {
    "title": "Taiwan Says US Trade-Deal Push Still On Despite Court Ruling",
    "description": "Taiwan is continuing efforts to secure a trade deal with the US, a top official in Taipei said, even after a court blocked many of the tariffs that President Donald Trump has threatened to impose on other countries.",
    "link": "https://financialpost.com/pmn/business-pmn/taiwan-says-us-trade-deal-push-still-on-despite-court-ruling",
    "timestamp": "2025-05-30T01:01:24Z"
  },
  {
    "title": "Asian stocks set for weak start as US gains fade",
    "description": "US equity-index futures slipped 0.2% after the S&P 500 Index trimmed most of an advance that earlier approached 1%. Contracts for Australia, Japan and Hong Kong pointed to a loss. The dollar was steady in early trading Friday after a gauge of the currency’s s…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-set-for-weak-start-as-us-gains-fade/articleshow/121501476.cms",
    "timestamp": "2025-05-30T01:01:09Z"
  },
  {
    "title": "White House vows Supreme Court fight over Trump tariff ruling",
    "description": "WASHINGTON DC: The Trump administration has threatened to escalate its tariffs dispute to the Supreme Court after a court ruling overturned many of the president’s new import duties. The administration is demanding that the decision be suspended White House P…",
    "link": "https://english.khabarhub.com/2025/30/472295/",
    "timestamp": "2025-05-30T01:00:06Z"
  },
  {
    "title": "Germany eyes 10% digital tax on tech giants...",
    "description": "BERLIN (Reuters) -Germany is considering a 10% tax on large online platforms like Alphabet's Google and Meta's Facebook, its new minister of state for...",
    "link": "https://finance.yahoo.com/news/germany-seeks-levy-10-tax-115744506.html",
    "timestamp": "2025-05-30T01:00:03Z"
  },
  {
    "title": "Polish knife-edge presidential vote pits liberal mayor against conservative",
    "description": "Opinion polls say Rafal Trzaskowski and Karol Nawrocki are running neck and neck ahead of Sunday's vote.",
    "link": "https://www.bbc.com/news/articles/c0ln987g582o",
    "timestamp": "2025-05-30T00:58:35Z"
  },
  {
    "title": "Tokyo Prices Rising Most in Two Years Keeps BOJ on Hike Path",
    "description": "Prices in Tokyo jumped the most in two years on surging food costs, keeping the Bank of Japan on track for another rate hike in coming months.",
    "link": "https://financialpost.com/pmn/business-pmn/tokyo-prices-rising-most-in-two-years-keeps-boj-on-hike-path",
    "timestamp": "2025-05-30T00:56:18Z"
  },
  {
    "title": "Trump aims at Chinese students and tech in threat to truce with Xi",
    "description": "Just weeks after U.S. President Donald Trump declared a \"total reset” with China following a trade truce in Geneva, tensions are rising again between the world’s biggest economies.",
    "link": "https://www.japantimes.co.jp/news/2025/05/30/asia-pacific/politics/trump-xi-truce-upset/",
    "timestamp": "2025-05-30T00:56:00Z"
  },
  {
    "title": "Trump Announces Friday Will Be Musk’s ‘Last Day, But Not Really’",
    "description": "President Donald Trump said Elon Musk will exit the government on Friday, \"but not really, because he will, always be with us, helping all the way.\"\nThe post Trump Announces Friday Will Be Musk’s ‘Last Day, But Not Really’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump/trump-announces-friday-will-be-musks-last-day-but-not-really/",
    "timestamp": "2025-05-30T00:52:01Z"
  },
  {
    "title": "Puerto Rico’s governor pledges to improve island’s power grid and economy",
    "description": "SAN JUAN, Puerto Rico (AP) — Puerto Rico’s governor pledged Thursday to improve the island’s crumbling electric grid and boost the economy in her first address after being elected last year as anger intensifies over chronic power outages and an increase in co…",
    "link": "https://financialpost.com/pmn/puerto-ricos-governor-pledges-to-improve-islands-power-grid-and-economy",
    "timestamp": "2025-05-30T00:51:07Z"
  },
  {
    "title": "CNN's Leana Wen Upset That RFK Jr. Advises Against Blindly Trusting Health Officials",
    "description": "CNN's Leana Wen Upset That RFK Jr. Advises Against Blindly Trusting Health Officialstwitchy.com",
    "link": "https://twitchy.com/brettt/2025/05/29/cnns-leana-wen-upset-that-rfk-jr-advises-against-blindly-trusting-health-officials-n2413554",
    "timestamp": "2025-05-30T00:50:22Z"
  }
]