[
  {
    "title": "Pivot to Pakistan: Is Trump ditching Delhi for its enemy?",
    "description": "President Trump's surprising oil deal with Pakistan, following tariffs on India, raises questions about a strategic shift in US foreign policy. Driven by potential economic gains and regional leverage, this move risks alienating India, a key partner in contai…",
    "link": "https://economictimes.indiatimes.com/news/india/pivot-to-pakistan-is-trump-ditching-delhi-for-its-enemy/articleshow/123018177.cms",
    "timestamp": "2025-07-31T10:22:13Z"
  },
  {
    "title": "Mike's Blog Round Up",
    "description": "First Draft: Comedy versus fascism.\nBark Bark Woof Woof: Donald Trump, Ferengi. \nInformed Comment: The genocidal partnership of Israel and the United States. \nEconomic Policy Institute: Destroying the Fed's independence to make monetary policy decisions would…",
    "link": "https://crooksandliars.com/2025/07/mikes-blog-round-7",
    "timestamp": "2025-07-31T10:21:10Z"
  },
  {
    "title": "Cory Booker: 'The Democratic Party Needs A Wake Up Call'",
    "description": "Cory Booker took another stand on the Senate floor—but this time, he called out his fellow Democrats.\nDuring a heated exchange on Tuesday, the New Jersey senator clashed with Amy Klobuchar of Minnesota and Catherine Cortez Masto of Nevada, arguing that advanc…",
    "link": "https://crooksandliars.com/2025/07/cory-booker-democratic-party-needs-wake",
    "timestamp": "2025-07-31T10:20:55Z"
  },
  {
    "title": "Singer Jess Glynne Freaks on Trump for Using Her Song to Tout ICE Deportations",
    "description": "Thoughts and prayers for British singer Jess Glynne please. The delicate performer lashed out at President Donald Trump on Wednesday saying she feels \"sick\" after his administration repurposed one of her songs to tout ICE deportations.\nThe post Singer Jess Gl…",
    "link": "https://www.breitbart.com/entertainment/2025/07/31/singer-jess-glynne-freaks-on-trump-for-using-her-song-to-tout-ice-deportations/",
    "timestamp": "2025-07-31T10:20:23Z"
  },
  {
    "title": "Trump’s Use of Tariffs Faces Legal Test Ahead of Aug. 1 Deadline",
    "description": "The bulk of President Donald Trump’s global tariffs face their biggest test yet when a US appeals court weighs arguments on their legality Thursday, a day before higher rates against many countries are set to kick in.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-use-of-tariffs-faces-legal-test-ahead-of-aug-1-deadline",
    "timestamp": "2025-07-31T10:19:51Z"
  },
  {
    "title": "Exclusive-Indian state refiners pause Russian oil purchases, sources say",
    "description": "Indian state refiners have stopped buying Russian oil in the past week as discounts narrowed this month and U.S. President Donald Trump warned against...",
    "link": "https://finance.yahoo.com/news/exclusive-indian-state-refiners-pause-101920451.html",
    "timestamp": "2025-07-31T10:19:20Z"
  },
  {
    "title": "Pakistan and US reach a trade agreement to develop oil reserves and reduce tariffs",
    "description": "ISLAMABAD (AP) — The United States and Pakistan reached a trade agreement expected to allow Washington to help develop Pakistan’s largely untapped oil reserves and lower tariffs for the South Asian country, officials from both nations said Thursday. Officials…",
    "link": "https://financialpost.com/pmn/pakistan-and-us-reach-a-trade-agreement-to-develop-oil-reserves-and-reduce-tariffs",
    "timestamp": "2025-07-31T10:17:20Z"
  },
  {
    "title": "Queer singer Jess Glynne calls out ‘sick’ White House video using her Jet2 song for deportation video",
    "description": "Pop singer Jess Glynne has slammed a post by The White House which used her song “Hold My Hand” to soundtrack a video featuring ICE deportation flights. Glynne’s 2015 song is featured as part of the Jet2Holidays advert audio which has become a viral TikTok se…",
    "link": "https://www.thepinknews.com/2025/07/31/jess-glynne-hold-my-hand-white-house-deportation-jet2-holidays/",
    "timestamp": "2025-07-31T10:17:18Z"
  },
  {
    "title": "Trump, Jamie Dimon Reportedly Meet After President's Fed Visit, Ending Years-Long Rift: What Changed?",
    "description": "Jamie Dimon, the CEO of JPMorgan Chase & Co. (NYSE:JPM), has reportedly visited the White House twice in the past two months. This marks a significant shift in the relationship between the head of the largest American bank and President Donald Trump.\nDimon An…",
    "link": "https://biztoc.com/x/33ae6378a155f95b",
    "timestamp": "2025-07-31T10:16:04Z"
  },
  {
    "title": "Trump Administration Debt Strategy Is More Confusion And Uncertainty",
    "description": "The administration waits for more long-term bond sales until rates come down, but it’s not clear when that might happen, and that doesn’t help economic uncertainty.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/07/31/trump-administration-debt-strategy-is-more-confusion-and-uncertainty/",
    "timestamp": "2025-07-31T10:15:00Z"
  },
  {
    "title": "Powell didn’t just refuse to deliver a rate cut—he also hinted a raise could have been on the cards",
    "description": "Powell put a cat among the pigeons by suggesting he was minded to \"look through\" tariff-induced inflation by not increasing interest rates.",
    "link": "https://fortune.com/2025/07/31/powell-rate-cut-raise-fomc-market-reaction-september-plan/",
    "timestamp": "2025-07-31T10:14:49Z"
  },
  {
    "title": "When things fall apart",
    "description": "Against a backdrop of global collapse, one exhibition used Chinua Achebe’s classic to hold space for voices from the Global South—and asked who gets to imagine the future.",
    "link": "https://africasacountry.com/2025/07/when-things-fall-apart-2/",
    "timestamp": "2025-07-31T10:14:15Z"
  },
  {
    "title": "BMW Says Can Weather Tariff Storm Despite Profit Plunge",
    "description": "German carmaker BMW stuck to its 2025 targets Thursday despite quarterly profits tumbling a third due partly to US tariffs, insisting its large American operations meant it could weather the storm.",
    "link": "https://www.ibtimes.com/bmw-says-can-weather-tariff-storm-despite-profit-plunge-3779917",
    "timestamp": "2025-07-31T10:12:15Z"
  },
  {
    "title": "Trump tariffs face key test at US appeals court",
    "description": "A U.S. appeals court is reviewing President Trump's tariff powers after a lower court challenged his authority. The court will assess the legality of tariffs imposed on various trading partners and those targeting China, Canada, and Mexico.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-tariffs-face-key-test-at-us-appeals-court/articleshow/123018017.cms",
    "timestamp": "2025-07-31T10:11:31Z"
  },
  {
    "title": "Newsom, Eyeing Presidential Run, Repeals Own Law Decriminalizing Loitering, Which Had Led to Sex Trafficking",
    "description": "California Gov. Gavin Newsom signed a law Wednesday that repealed a law he signed in 2022 that decriminalized loitering and had enabled sex trafficking. The move came despite criticism from some Democrats.\nThe post Newsom, Eyeing Presidential Run, Repeals Own…",
    "link": "https://www.breitbart.com/politics/2025/07/31/newsom-eyeing-presidential-run-repeals-own-law-enabling-sex-trafficking-led/",
    "timestamp": "2025-07-31T10:11:31Z"
  },
  {
    "title": "Exclusive eyewitness testimony reveals horrific details of deadly church attack in African nation",
    "description": "Eyewitness testimony reveals horrific details of deadly church attack in the Democratic Republic of the Congo on Sunday, when 49 Christians, including nine children, were savagely murdered by jihadis.",
    "link": "https://www.foxnews.com/world/exclusive-eyewitness-testimony-reveals-horrific-details-deadly-church-attack-african-nation",
    "timestamp": "2025-07-31T10:09:26Z"
  },
  {
    "title": "BMW says can weather tariff storm despite profit plunge",
    "description": "German carmaker BMW stuck to its 2025 targets Thursday despite quarterly profits tumbling a third due partly to US tariffs, insisting its large American operations meant it could weather the storm. Their optimism stands in contrast to domestic rivals Volkswag…",
    "link": "https://www.digitaljournal.com/world/bmw-says-can-weather-tariff-storm-despite-profit-plunge/article",
    "timestamp": "2025-07-31T10:07:32Z"
  },
  {
    "title": "Seth Meyers Spots The Exact Moment Donald Trump Looked ‘Actually Broken’",
    "description": "\"I've seen him look upset before but I've never seen Trump look actually broken,\" said the \"Late Night\" comedian.",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-broken_n_688b349be4b0f5cda486ad94",
    "timestamp": "2025-07-31T10:05:14Z"
  },
  {
    "title": "US strikes oil deal with Pakistan – Trump",
    "description": "Pakistani Prime Minister Shehbaz Sharif has said the countries also finalized a trade deal Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622306-us-strikes-oil-deal-with/",
    "timestamp": "2025-07-31T10:04:43Z"
  },
  {
    "title": "US trading partners rush to sign deals before Donald Trump’s tariffs hit",
    "description": "Canada and Mexico lead diplomatic offensive in Washington as August 1st deadline looms",
    "link": "https://www.irishtimes.com/business/2025/07/31/us-trading-partners-rush-to-sign-deals-before-donald-trumps-tariffs-hit/",
    "timestamp": "2025-07-31T10:03:14Z"
  },
  {
    "title": "Politics: The FBI’s Leaders ‘Have No Idea What They’re Doing’",
    "description": "A casualty of Trump’s purge speaks out.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/the-fbi-s-leaders-have-no-idea-what-they-re-doing-e061506/",
    "timestamp": "2025-07-31T10:03:00Z"
  },
  {
    "title": "Zelensky thanks Finnish president for 'building connection' with Trump",
    "description": "The OSCE conference in Helsinki celebrated past triumphs, but attendees also examined how to address ongoing conflicts around the world.",
    "link": "https://yle.fi/a/74-20175248",
    "timestamp": "2025-07-31T10:02:16Z"
  },
  {
    "title": "Trump administration to launch private health tracking system to improve records access",
    "description": "Trump administration to launch private health tracking system to improve records accesswave3.com",
    "link": "https://www.wave3.com/2025/07/31/trump-administration-launch-private-health-tracking-system-improve-records-access/",
    "timestamp": "2025-07-31T10:02:06Z"
  },
  {
    "title": "Democrat moves to block Trump admin from using military drones to monitor protests after LA riots",
    "description": "A progressive House Democrat is introducing a bill to block the Trump administration from using military-grade drones to surveil protests.",
    "link": "https://www.foxnews.com/politics/democrat-moves-block-trump-admin-from-using-military-drones-monitor-protests-after-la-riots",
    "timestamp": "2025-07-31T10:00:32Z"
  },
  {
    "title": "Jack Mintz: Tariffs may trump income taxes but the GST beats both",
    "description": "U.S. tariffs are low and income taxes high so raising revenue with tariffs may make economic sense. A U.S. GST would make even more. Read on",
    "link": "https://financialpost.com/opinion/tariffs-trump-income-taxes-gst-beats-both",
    "timestamp": "2025-07-31T10:00:02Z"
  },
  {
    "title": "Trump’s Gaza “Food Centers” Miss the Real Problem: Israel’s Aid Blockade",
    "description": "As with many of Trump’s proposals, it’s unclear how serious he is about his vague call for further U.S. involvement in Gaza food aid.\nThe post Trump’s Gaza “Food Centers” Miss the Real Problem: Israel’s Aid Blockade appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/07/31/trump-gaza-aid-famine-israel-ghf/",
    "timestamp": "2025-07-31T10:00:00Z"
  },
  {
    "title": "“We’ll Smash the Fucking Window Out and Drag Him Out”",
    "description": "by Nicole Foy and McKenzie Funk \n \n\n \n This story contains videos and descriptions of violent arrests.\n\n \n\n \n\n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n…",
    "link": "https://projects.propublica.org/trump-ice-smashed-windows-deportation-arrests/",
    "timestamp": "2025-07-31T10:00:00Z"
  },
  {
    "title": "IT’S GENOCIDE: Top Israeli human rights groups accuse country of carrying out gravest crime",
    "description": "Netanyahu says Israel will not stop until it achieves its goals B’Tselem and Physicians for Human Rights-Israel, two top Israeli human rights groups, issued new reports on Monday that accused Tel Aviv of carrying out a genocide in Gaza – the first time these …",
    "link": "https://www.activistpost.com/its-genocide-top-israeli-human-rights-groups-accuse-country-of-carrying-out-gravest-crime/",
    "timestamp": "2025-07-31T10:00:00Z"
  },
  {
    "title": "Can San Francisco Be Saved?",
    "description": "Introducing No Easy Fix, a new three-part miniseries from Radio Atlantic, about the widespread addiction and homelessness that threaten the city’s future",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/07/can-san-francisco-be-saved/683594/",
    "timestamp": "2025-07-31T10:00:00Z"
  },
  {
    "title": "Trump's Texas power grab is happening — and Democrats have a choice to make",
    "description": "President Trump asked the Texas GOP to find five more congressional seats. Republicans proposed a redistricting map that would do just that.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/texas-republicans-gerrymander-trump-democrats-redistricting-rcna222099",
    "timestamp": "2025-07-31T10:00:00Z"
  },
  {
    "title": "Russian missile, drone attacks hit Kyiv, killing 7 people and wounding 82",
    "description": "Russia attacked Ukraine's capital with missiles and drones overnight, killing at least seven people, including a six-year-old boy, and wounding 82 others, Ukrainian authorities said Thursday.",
    "link": "https://www.cbc.ca/news/world/ukraine-russia-kyiv-missile-drone-attack-1.7598253",
    "timestamp": "2025-07-31T09:59:02Z"
  },
  {
    "title": "Tariff wars: Has Donald Trump killed the WTO?",
    "description": "In the wake of Trump’s global trade war, can the World Trade Organization reclaim its role as guardian of free trade?",
    "link": "https://www.aljazeera.com/news/2025/7/31/tariff-wars-has-donald-trump-killed-the-wto",
    "timestamp": "2025-07-31T09:56:44Z"
  },
  {
    "title": "Albanese won't be dictated to by other nations on Palestinian statehood",
    "description": "Australia won't be dictated to on when the nation will decide to recognise a Palestinian state, Prime Minister Anthony Albanese tells 7.30.",
    "link": "https://www.abc.net.au/news/2025-07-31/anthony-albanese-palestine-statehood-us-trump-un-timing/104852442",
    "timestamp": "2025-07-31T09:55:47Z"
  },
  {
    "title": "Fires and destruction as missile attacks rattle Ukraine’s capital",
    "description": "Missile strikes on Kyiv leave six dead, including a child, and injure 82 as fires engulf the capital overnight.",
    "link": "https://www.aljazeera.com/gallery/2025/7/31/fires-and-destruction-as-missile-attacks-rattle-ukraines-capital",
    "timestamp": "2025-07-31T09:54:22Z"
  },
  {
    "title": "S Korea to Invest $450bn in US Projects, Energy; Gets 15% Tariff",
    "description": "A $450-billion package of investments in US projects such as shipbuilding, nuclear power, energy, chips, and a range of other sectors has helped South Korea win a sizeable tariff cut.\nThe US will charge a 15% tariff on imports from South Korea, US President D…",
    "link": "https://biztoc.com/x/4b20783f4874a814",
    "timestamp": "2025-07-31T09:53:52Z"
  },
  {
    "title": "Russia kills six in drone, missile strikes on Ukraine’s Kyiv: Zelenskyy",
    "description": "Rescue teams search for people under the rubble after at least 52 people are wounded.",
    "link": "https://www.aljazeera.com/news/2025/7/31/russia-kills-six-in-drone-missile-strikes-on-ukraines-kyiv-zelenskyy",
    "timestamp": "2025-07-31T09:52:59Z"
  },
  {
    "title": "Iran slams new US sanctions targeting oil shipping network",
    "description": "The true aim of the sanctions is to cripple Iran’s economic development, Foreign Ministry spokesman Esmaeil Baghaei has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622302-iran-condemns-us-sanctions/",
    "timestamp": "2025-07-31T09:52:27Z"
  },
  {
    "title": "What Are Trump's Options If His Tariffs Are Ruled Unlawful? (Isabel Gottlieb/Bloomberg)",
    "description": "Isabel Gottlieb / Bloomberg:\nWhat Are Trump's Options If His Tariffs Are Ruled Unlawful?  —  In rolling out the most aggressive tariff regime in the US in nearly a century, President Donald Trump has leaned heavily on emergency powers that had never been used…",
    "link": "https://www.memeorandum.com/250731/p4",
    "timestamp": "2025-07-31T09:50:00Z"
  },
  {
    "title": "A Faustian Bargain for the Global South",
    "description": "The spotlight on US President Donald Trump’s tariffs is distracting attention from a broader strategic effort by the United States and other major powers to preserve their technological dominance at the expense of the developing world. Two recent trade deals …",
    "link": "https://www.project-syndicate.org/commentary/trade-deals-undermine-developing-countries-economic-prospects-by-jayati-ghosh-2025-07",
    "timestamp": "2025-07-31T09:49:49Z"
  },
  {
    "title": "Bitcoin price retargets $119K as treasuries buy 28K BTC in two days",
    "description": "Bitcoin market sentiment shrugs off a hawkish Fed FOMC meeting in an instant amid fresh promises of a US strategic Bitcoin reserve becoming a reality.",
    "link": "https://cointelegraph.com/news/bitcoin-price-retargets-119k-treasuries-buy-28k-btc",
    "timestamp": "2025-07-31T09:48:28Z"
  },
  {
    "title": "Russian strike on Kyiv kills 7, wounds more than 80",
    "description": "The Kremlin's bombardment follows Donald Trump’s 10-day ceasefire deadline to Moscow.",
    "link": "https://www.politico.eu/article/russia-strike-kyiv-ukraine-kill-wound-war/",
    "timestamp": "2025-07-31T09:47:29Z"
  },
  {
    "title": "Gold sees heavy profit booking amid trade deal jitters, US Fed’s unchanged interest rates. Should you sell?",
    "description": "Gold futures edged up slightly while silver tumbled over 1.6% amid profit-taking and a stronger dollar. Trade tensions, US GDP recovery, and stable interest rates pressured bullion prices in both domestic and global markets, triggering volatility and uncertai…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-sees-heavy-profit-booking-amid-trade-deal-jitters-us-feds-unchanged-interest-rates-should-you-sell/articleshow/123017418.cms",
    "timestamp": "2025-07-31T09:46:28Z"
  },
  {
    "title": "Trump Threatens Canada over Palestinian State: 'Hard for Us to Make a Trade Deal'",
    "description": "President Donald Trump threatened trade consequences for Canada if it goes ahead with Premier Mark Carney's plan to recognize a Palestinian state at the United Nations General Assembly in September.\nThe post Trump Threatens Canada over Palestinian State: ‘Har…",
    "link": "https://www.breitbart.com/middle-east/2025/07/31/trump-threatens-canada-over-palestinian-state-hard-for-us-to-make-a-trade-deal/",
    "timestamp": "2025-07-31T09:46:04Z"
  },
  {
    "title": "Despite Trump’s Pressure, Fed Holds Interest Rates Steady",
    "description": "This was the fifth consecutive meeting at which the Federal Open Markets Committee (FOMC) kept its benchmark Federal Funds rate unchanged at 4.25-4.5%.",
    "link": "https://www.forbes.com/sites/rohitarora/2025/07/31/despite-trumps-pressure-fed-holds-interest-rates-steady/",
    "timestamp": "2025-07-31T09:45:09Z"
  },
  {
    "title": "Democrats Need a Plan. Instead They’re Running for President.",
    "description": "There's a silver lining in these terrible polls (and more bad news inside the silver lining).",
    "link": "https://slate.com/news-and-politics/2025/07/democrats-pete-buttigieg-president-polling-2028.html",
    "timestamp": "2025-07-31T09:45:03Z"
  },
  {
    "title": "Trump's tariff on India to do little to upset iPhone manufacturing plans",
    "description": "US President Donald Trump's 25% tariffs on Indian imports are unlikely to derail Apple's India manufacturing plans. Nearly all $3.2 billion iPhones exported from India between March and May went to the U.S. Apple views India as a long-term hub, offering cost …",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/trumps-tariff-on-india-to-do-little-to-upset-iphone-manufacturing-plans/articleshow/123017307.cms",
    "timestamp": "2025-07-31T09:40:44Z"
  },
  {
    "title": "If Trump’s tariffs stick, five things could go wrong for India — fast",
    "description": "Business & Economy News: A 25% tariff, a vague penalty, and a trade tirade wrapped in geopolitics are unsettling Indian exporters",
    "link": "https://timesofindia.indiatimes.com/toi-plus/business-economy/if-trumps-tariffs-stick-five-things-could-go-wrong-for-india-fast/articleshow/123017162.cms",
    "timestamp": "2025-07-31T09:40:06Z"
  },
  {
    "title": "Bank of Japan holds rates, flags trade 'uncertainties'",
    "description": "The Bank of Japan kept its main interest rate unchanged today, hiking its inflation and growth forecasts while also flagging \"high uncertainties\" from US President Donald Trump's trade policies.",
    "link": "https://www.rte.ie/news/business/2025/0731/1526289-bank-of-japan-interest-rate-decision/",
    "timestamp": "2025-07-31T09:39:48Z"
  },
  {
    "title": "Trump's tariff on India to do little to upset iPhone manufacturing plans",
    "description": "BENGALURU (Reuters) -President Donald Trump's 25% tariffs on Indian goods will do little to slow the role of the Asian country as a key hub for manufacturing...",
    "link": "https://finance.yahoo.com/news/trumps-tariff-india-little-upset-093915609.html",
    "timestamp": "2025-07-31T09:39:15Z"
  },
  {
    "title": "Fed Keeps Rates on Hold; Canada to Recognize Palestine | Horizons Middle East & Africa 07/31/2025",
    "description": "The Federal Reserve kept rates unchanged citing inflation risks. Also on the show: US President Donald Trump hits South Korea ...",
    "link": "https://biztoc.com/x/275742ca707b1409",
    "timestamp": "2025-07-31T09:38:52Z"
  },
  {
    "title": "Big central bank rate cuts slow, tariffs and politics in focus",
    "description": "LONDON (Reuters) -The pace of global rate cuts is slowing as the European Central Bank nears the end of its easing cycle, the U.S. Federal Reserve stays...",
    "link": "https://finance.yahoo.com/news/big-central-bank-rate-cuts-093827888.html",
    "timestamp": "2025-07-31T09:38:27Z"
  },
  {
    "title": "Big central bank rate cuts slow, tariffs and politics in focus",
    "description": "LONDON :The pace of global rate cuts is slowing as the European Central Bank nears the end of its easing cycle, the U.S. Federal Reserve stays cautious about tariff-driven inflation and investors watch to see whether Britain speeds up from here.The Fed struck…",
    "link": "https://www.channelnewsasia.com/business/big-central-bank-rate-cuts-slow-tariffs-and-politics-in-focus-5269701",
    "timestamp": "2025-07-31T09:38:27Z"
  },
  {
    "title": "Virginia Giuffre's Family Speaks Out on Trump's Mar-a-Lago Comments",
    "description": "\"It makes us ask if he was aware of Jeffrey Epstein and Ghislaine Maxwell's criminal actions,\" the family said in a statement.",
    "link": "https://www.newsweek.com/virginia-giuffre-family-speak-out-donald-trump-2106779",
    "timestamp": "2025-07-31T09:37:20Z"
  },
  {
    "title": "Trump's new tariff on India could reshape bilateral ties",
    "description": "U.S. President Donald Trump's decision to slap harsh tariffs on Indian exports and a \"penalty\" on purchases of Russian weapons and energy will cost thousands of jobs and could fundamentally change the nature of bilateral ties, experts have said.",
    "link": "https://www.hurriyetdailynews.com/trumps-new-tariff-on-india-could-reshape-bilateral-ties-212045",
    "timestamp": "2025-07-31T09:36:28Z"
  },
  {
    "title": "How Rupert Murdoch helped to build brand Trump – podcast",
    "description": "Listen to Andrew Dodd on The Conversation Weekly podcast on the long, transactional relationship between Donald Trump and Rupert Murdoch.",
    "link": "https://theconversation.com/how-rupert-murdoch-helped-to-build-brand-trump-podcast-262158",
    "timestamp": "2025-07-31T09:35:02Z"
  },
  {
    "title": "Mikey Madison and Jeremy Allen White eye lead roles in Aaron Sorkin’s ‘Social Network’ sequel",
    "description": "Follow-up film will be based on a Wall Street Journal series about Facebook",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/jeremy-allen-white-mikey-madison-social-network-sequel-cast-b2799464.html",
    "timestamp": "2025-07-31T09:33:37Z"
  },
  {
    "title": "US hits copper with 50% tariff but India isn’t too worried",
    "description": "The United States, through a recent executive order, will impose a 50% tariff on semi-finished copper products starting August 1, citing national security concerns. While India's copper exports to the US, valued at $360 million in FY25, will become more expen…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/metals-mining/us-hits-copper-with-50-tariff-but-india-isnt-too-worried/articleshow/123016473.cms",
    "timestamp": "2025-07-31T09:33:00Z"
  },
  {
    "title": "Donald Trump aid cuts could push Nigerians into the arms of Boko Haram militants - UN",
    "description": "Donald Trump aid cuts could push Nigerians into the arms of Boko Haram militants - UNbbc.co.uk",
    "link": "https://www.bbc.co.uk/news/articles/cdxyv97rppro",
    "timestamp": "2025-07-31T09:32:29Z"
  },
  {
    "title": "US, India launch powerful Earth-monitoring satellite",
    "description": "Washington (AFP) July 30, 2025\n\n\n A formidable new radar satellite jointly developed by the United States and India launched Wednesday, designed to track subtle changes in Earth's land and ice surfaces and help predict both natural and human-caused hazards. \n…",
    "link": "https://www.spacedaily.com/reports/US_India_launch_powerful_Earth-monitoring_satellite_999.html",
    "timestamp": "2025-07-31T09:31:37Z"
  },
  {
    "title": "Ethel Cain readdresses ‘shameful’ past use of ‘racist language’",
    "description": "“F**k Me Eyes” singer Ethel Cain has further addressed her “deeply shameful” past use of “racist language”, explaining that she used to share social media posts to be “intentionally inflammatory”. Earlier this month, a number of old posts made by transgender …",
    "link": "https://www.thepinknews.com/2025/07/31/ethel-cain-addresses-racism-remarks/",
    "timestamp": "2025-07-31T09:30:39Z"
  },
  {
    "title": "Survival in times of predatory trade: Is Asia on to something?",
    "description": "One after another, Asian countries have swallowed lopsided trade deals with the US on the calculus that it’s better than losing access to US markets. With America acting as an apex predator, they had to make the best of bad options.",
    "link": "https://www.livemint.com/opinion/online-views/us-tariffs-trump-xi-jinping-ferdinand-marcos-ursula-von-der-leyen-vietnam-trade-philippines-economy-global-supply-chains-11753857000088.html",
    "timestamp": "2025-07-31T09:30:10Z"
  },
  {
    "title": "Trump knows GOP can use this scandal to end him",
    "description": "If you’re like me, you were kinda blindsided by the Epstein scandal, and that’s because, if you’re like me, you are not in thrall to conspiracy theories that claim to explain how reality “really” works, which is to say, “theories” about imaginary villains plo…",
    "link": "https://www.rawstory.com/raw-investigates/trump-epstein-2673781190/",
    "timestamp": "2025-07-31T09:30:02Z"
  },
  {
    "title": "US tariffs a temporary hurdle for rice exports, India retains price advantage, says IREF",
    "description": "An Indian rice exporters' body considers the 25% US tariff a temporary obstacle, emphasizing India's continued pricing advantage over competitors like Vietnam and Pakistan. Despite the tariff, India remains competitive in the US market, particularly for basma…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-tariffs-a-temporary-hurdle-for-rice-exports-india-retains-price-advantage-says-iref/articleshow/123017008.cms",
    "timestamp": "2025-07-31T09:29:44Z"
  },
  {
    "title": "Warren Buffett’s advice to Brooks CEO: ‘Make sure the brand is stronger at the end of the year than it was at the beginning’",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/07/31/warren-buffett-brooks-ceo-dan-sheridan-brand-advice/",
    "timestamp": "2025-07-31T09:29:41Z"
  },
  {
    "title": "EU states seek 127 bn euros under defence loan scheme",
    "description": "Brussels, Belgium (AFP) July 30, 2025\n\n\n The European Commission said Wednesday that 18 EU states are requesting loans worth at least 127 billion euros under a new scheme to help ramp up defence spending. \n\nThe programme is a key part of the EU's push to boos…",
    "link": "https://www.spacewar.com/reports/EU_states_seek_127_bn_euros_under_defence_loan_scheme_999.html",
    "timestamp": "2025-07-31T09:26:01Z"
  },
  {
    "title": "BAE Systems profit jumps as govts hike defence spend",
    "description": "London (AFP) July 30, 2025\n\n\n British military equipment maker BAE Systems on Wednesday lifted its full-year outlook after profits rose in the first half and as governments hike spending on defence. \n\nNet profit grew two percent to GBP969 million ($1.3 billio…",
    "link": "https://www.spacewar.com/reports/BAE_Systems_profit_jumps_as_govts_hike_defence_spend_999.html",
    "timestamp": "2025-07-31T09:26:01Z"
  },
  {
    "title": "Death toll from Russian strike on Kyiv rises to six: Ukraine",
    "description": "Kyiv, Ukraine (AFP) July 31, 2025\n\n The death toll from Russian missile and drone strikes on Ukraine's capital has risen to six, including a six-year-old boy, the city's military administration said on Thursday. \n\n\"As of now, the services have confirmed six d…",
    "link": "https://www.spacewar.com/reports/Death_toll_from_Russian_strike_on_Kyiv_rises_to_six_Ukraine_999.html",
    "timestamp": "2025-07-31T09:26:01Z"
  },
  {
    "title": "Chevron receives restricted US licence to resume limited operations in Venezuela",
    "description": "The licence comes with stringent conditions prohibiting any transfer of oil proceeds to the Venezuelan administration.",
    "link": "https://www.offshore-technology.com/news/chevron-restricted-us-license-limited-operations-venezuela/",
    "timestamp": "2025-07-31T09:23:16Z"
  },
  {
    "title": "Lukashenko: Trump's return chance for better ties with US",
    "description": "Belarusian President Aleksander Lukashenko said on Thursday that the return of Donald Trump to the White House may provide a chance for improving relations between the two countries. \"Recent meetings ...",
    "link": "https://biztoc.com/x/b094c11db71da0ff",
    "timestamp": "2025-07-31T09:20:33Z"
  },
  {
    "title": "Russian air strikes pound Kyiv, killing at least seven people",
    "description": "UKRAINE-CRISIS/ATTACK-KYIV (UPDATE 2, PIX, TV):UPDATE 2-Russian air strikes pound Kyiv, 6-year-old boy among dead, Zelenskiy says",
    "link": "https://www.irishtimes.com/world/europe/2025/07/31/russian-air-strikes-pound-kyiv-killing-at-least-seven-people/",
    "timestamp": "2025-07-31T09:14:56Z"
  },
  {
    "title": "Are Trump’s tariffs unlawful? A court case kicking off this week could reshape his trade strategy | CNN Business",
    "description": "For months President Donald Trump has been slapping higher tariffs on practically every country’s exports to the United States, citing emergency economic powers.",
    "link": "https://www.cnn.com/2025/07/31/business/tariff-court-case",
    "timestamp": "2025-07-31T09:14:31Z"
  },
  {
    "title": "Trump Goes On Wild Repost Rampage With Unhinged Memes Of Obama, Clinton And More",
    "description": "The president pounded the hell out of his Truth Social re-share button.",
    "link": "https://www.huffpost.com/entry/donald-trump-posting-spree_n_688b2d1ee4b0f5cda486a9ce",
    "timestamp": "2025-07-31T09:14:22Z"
  },
  {
    "title": "Nigel Farage: Epstein files should be released",
    "description": "Donald Trump's British ally says the affair has put the U.S. president \"into conflict with much of his own base.\"",
    "link": "https://www.politico.eu/article/nigel-farage-jeffrey-epstein-files-released/",
    "timestamp": "2025-07-31T09:12:51Z"
  },
  {
    "title": "Trump makes trade threat to Canada after Palestine move",
    "description": "Trump has said that Canada's move to recognize a Palestinian state could put a US-Canada trade agreement in jeopardy. DW has the latest.",
    "link": "https://www.dw.com/en/trump-makes-trade-threat-to-canada-after-palestine-move/live-73477363",
    "timestamp": "2025-07-31T09:12:00Z"
  },
  {
    "title": "Trump admin lifted sanctions on Israeli accused of killing Palestinian activist",
    "description": "President Joe Biden sanctioned Yinon Levi in 2024 for violence against Palestinians.",
    "link": "https://abcnews.go.com/Politics/trump-administration-lifted-sanctions-israeli-settler-accused-killing/story?id=124185259",
    "timestamp": "2025-07-31T09:09:47Z"
  },
  {
    "title": "Court in Washington to hear arguments on legality of Trump ‘reciprocal’ tariffs",
    "description": "A federal appeals court just steps from the White House could derail US President Donald Trump’s “reciprocal” tariffs before they take effect on Friday, a move that could weaken Washington’s leverage in trade talks with China and other key partners.\nThe US Co…",
    "link": "https://biztoc.com/x/ca18b314e1adad38",
    "timestamp": "2025-07-31T09:09:42Z"
  },
  {
    "title": "Trump's tariffs face crucial court test on eve of latest deadline",
    "description": "Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick look on as President Donald Trump speaks after having signed an executive order in the Oval Office of the White House on April 9.",
    "link": "https://biztoc.com/x/cbf0aa78774ef16f",
    "timestamp": "2025-07-31T09:09:11Z"
  },
  {
    "title": "Germany's gas imports entangled in EU-Qatar row",
    "description": "Qatar is due to supply 2 million tons of liquefied natural gas to Germany from next year. The deal is now under threat from an EU directive on rights and the climate that critics say is too costly and bureaucratic.",
    "link": "https://www.dw.com/en/germanys-gas-imports-entangled-in-eu-qatar-row/a-73460153",
    "timestamp": "2025-07-31T09:08:00Z"
  },
  {
    "title": "Why Qatar's gas lifeline to Germany is at risk",
    "description": "Qatar is due to supply 2 million tons of liquefied natural gas to Germany from next year. The deal is now under threat from an EU directive on rights and the climate that critics say is too costly and bureaucratic.",
    "link": "https://www.dw.com/en/why-qatars-gas-lifeline-to-germany-is-at-risk/a-73460153",
    "timestamp": "2025-07-31T09:08:00Z"
  },
  {
    "title": "Apple’s India exports to emerge unscathed from Trump tariffs",
    "description": "Apple's iPhone exports from India to the US are currently exempt from President Trump's tariffs due to an earlier exemption on electronics. India has become a major iPhone supplier to the US, surpassing China.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/apples-india-exports-to-emerge-unscathed-from-trump-tariffs/articleshow/123016524.cms",
    "timestamp": "2025-07-31T09:07:24Z"
  },
  {
    "title": "Why did the EU sign a tariff deal overwhelmingly favourable to the US?",
    "description": "The EU made many concessions in negotiations and got little in return",
    "link": "https://www.irishtimes.com/life-style/people/2025/07/31/why-did-the-eu-sign-a-tariff-deal-overwhelmingly-favourable-to-the-us/",
    "timestamp": "2025-07-31T09:06:32Z"
  },
  {
    "title": "Sean Combs Launches De Facto Appeal On Prostitution Guilty Verdicts In Sex-Trafficking Trial: “His Conviction Is Unconstitutional”",
    "description": "Seeking an acquittal or a brand new trial, the incarcerated Sean “Diddy” Combs has pretty much already launched an appeal on his conviction of the lesser counts in the ‘I Need A Girl’ performer’s sex-trafficking trial and he hasn’t even been sentenced yet. “S…",
    "link": "http://deadline.com/2025/07/sean-combs-appeal-new-trial-sex-trafficking-trump-1236475083/",
    "timestamp": "2025-07-31T09:05:01Z"
  },
  {
    "title": "India Weighs Options to Placate Trump After Shock 25% Tariff",
    "description": "India is weighing options to placate the White House, including boosting US imports, and has ruled out immediate retaliation to President Donald Trump’s surprise 25% tariff threat, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/india-weighs-options-to-placate-trump-after-shock-25-tariff",
    "timestamp": "2025-07-31T09:03:15Z"
  },
  {
    "title": "Cambodia urges Thailand to release detained soldiers",
    "description": "A ceasefire between Cambodia and Thailand continued into a third day, as the Cambodian government demanded the release of 20 of its soldiers from Thai captivity.",
    "link": "https://www.dw.com/en/cambodia-urges-thailand-to-release-detained-soldiers/a-73478011",
    "timestamp": "2025-07-31T09:03:00Z"
  },
  {
    "title": "Medvedev mocks Trump’s ‘nervous reaction’",
    "description": "Russia’s Dmitry Medvedev has mocked verbal attacks by US President Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622312-medvedev-trump-verbal-attack/",
    "timestamp": "2025-07-31T09:02:44Z"
  },
  {
    "title": "Beyond Test Scores: Helping Students Find Meaning",
    "description": "Student suicides are a global concern, often fueled by academic pressure and the outdated belief in the paramount importance of high test scores. The intense focus on grades creates unnecessary stress, impacting students' well-being. A shift towards holistic …",
    "link": "https://timesofindia.indiatimes.com/speaking-tree/daily-ecstasy/beyond-test-scores-helping-students-find-meaning/articleshow/123016420.cms",
    "timestamp": "2025-07-31T09:02:00Z"
  },
  {
    "title": "Labor well-placed to win three Bass seats in Tasmanian election, giving left a total of 20 of 35 MPs",
    "description": "As the preferences are distributed in the island state, Labor look likely to take half the seats in the northern electorate, despite a lower primary vote.",
    "link": "https://theconversation.com/labor-well-placed-to-win-three-bass-seats-in-tasmanian-election-giving-left-a-total-of-20-of-35-mps-261751",
    "timestamp": "2025-07-31T09:00:55Z"
  },
  {
    "title": "JPMorgan, Coinbase Forge Historic Pact For Direct Bank-Crypto Wallet Integration By 2026",
    "description": "JPMorgan Chase and crypto exchange Coinbase have announced a new partnership on Wednesday that marks a pivotal shift in the relationship between traditional finance and digital assets.  As the crypto industry experiences a bullish resurgence, fueled by a more…",
    "link": "http://www.newsbtc.com/news/coinbase/jpmorgan-coinbase-forge-historic-pact-for-direct-bank-crypto-wallet-integration-by-2026/",
    "timestamp": "2025-07-31T09:00:55Z"
  },
  {
    "title": "DAN GAINOR: Liberal media tried to destroy Trump. He crushed them instead",
    "description": "Trump has successfully defunded NPR and PBS, secured millions in media lawsuit settlements from CBS and ABC as liberal journalists flee Washington Post over editorial changes.",
    "link": "https://www.foxnews.com/opinion/dan-gainor-liberal-media-tried-destroy-trump-he-crushed-them-instead",
    "timestamp": "2025-07-31T09:00:48Z"
  },
  {
    "title": "Trump’s immigration reset is lifting wages and forcing real economic reform",
    "description": "Immigration enforcement under Trump reverses employment trends as native-born workers see significant job gains while foreign-born employment growth slows dramatically.",
    "link": "https://www.foxnews.com/opinion/trumps-immigration-reset-lifting-wages-forcing-real-economic-reform",
    "timestamp": "2025-07-31T09:00:43Z"
  },
  {
    "title": "MORNING GLORY: President Trump and the United States’ massive tariff haul in his first six months back",
    "description": "President Trump delivers on campaign promises with tariff revenue surging as new trade deals reshape global commerce.",
    "link": "https://www.foxnews.com/opinion/morning-glory-president-trump-united-states-massive-tariff-haul-his-first-six-months-back",
    "timestamp": "2025-07-31T09:00:42Z"
  },
  {
    "title": "Trump to host professional athletes for new order expanding on presidential sports council",
    "description": "President Donald Trump will be joined by professional athletes on Thursday to sign an executive order that will expand on his council on sports, fitness and nutrition, including by reviving the Presidential Fitness Test in public schools, White House official…",
    "link": "https://www.cnn.com/2025/07/31/politics/trump-order-expanding-presidential-sports-council",
    "timestamp": "2025-07-31T09:00:41Z"
  },
  {
    "title": "Donald Trump's Approval Rating Falls to New Low With White Voters",
    "description": "White voters have long been a crucial pillar of Donald Trump's political base, consistently providing him with strong support .",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-white-voters-2106407",
    "timestamp": "2025-07-31T09:00:01Z"
  },
  {
    "title": "Henry Ford vs. Elon Musk: A Century of Hate Speech",
    "description": "The 20th-century auto titan was all in on antisemitism, until falling car sales forced his hand. Now Tesla is tanking, X is in turmoil, and its South African-born mogul is doubling down.\nThe post Henry Ford vs. Elon Musk: A Century of Hate Speech appeared fir…",
    "link": "http://washingtonmonthly.com/2025/07/31/hate-speech/",
    "timestamp": "2025-07-31T09:00:00Z"
  }
]