[
  {
    "title": "Trans troops slam ‘horrific’ US military ban days before it goes into effect",
    "description": "Trans members of the US armed forces have publicly deplored a “horrific” ban on military service, which goes into full effect next week. In the wake of an executive order signed by president Donald Trump in January, the Pentagon issued a policy that military …",
    "link": "https://www.thepinknews.com/2025/07/01/trans-us-military-ban-deplore-horrific/",
    "timestamp": "2025-07-01T11:06:43Z"
  },
  {
    "title": "More than 150 groups call for U.S. and Israeli-backed Gaza aid distribution to be shut down",
    "description": "Charity and aid groups said in a joint statement that more than 500 Palestinians had been killed and almost 4,000 injured in less than four weeks while trying to access or distribute food in Gaza.",
    "link": "https://www.nbcnews.com/world/gaza/150-groups-call-us-israeli-backed-gaza-aid-distribution-shut-rcna212270",
    "timestamp": "2025-07-01T11:06:15Z"
  },
  {
    "title": "Trump tightens US policy on Cuba",
    "description": "President Trump says a statutory ban on tourism to Cuba will be enforced more strictly.",
    "link": "https://www.bbc.com/news/articles/cx24468drd1o",
    "timestamp": "2025-07-01T11:04:30Z"
  },
  {
    "title": "Trump Vs. Musk: \"Big, Beautiful Bill\" Feud Sparks Overnight Political Firestorm",
    "description": "Trump Vs. Musk: \"Big, Beautiful Bill\" Feud Sparks Overnight Political Firestorm\n \nTesla shares slid in premarket trading in New York following a late-night clash between CEO Elon Musk and President Donald Trump. The feud played out across their respective soc…",
    "link": "https://biztoc.com/x/b268eb49d6a20fee",
    "timestamp": "2025-07-01T11:02:26Z"
  },
  {
    "title": "As ‘Alligator Alcatraz’ nears opening, elected officials weigh in on funding, environmental impacts",
    "description": "President Trump is expected to arrive at a remote location in the Everglades on Tuesday. The site will serve as a new detention center to house undocumented immigrants arrested in the U.S.",
    "link": "https://www.wftv.com/news/local/alligator-alcatraz-nears-opening-elected-officials-weigh-funding-environmental-impacts/SXF3DX5FH5C6RO7YSRECVP4FN4/",
    "timestamp": "2025-07-01T11:01:08Z"
  },
  {
    "title": "‘A Human Rights Disaster Waiting To Happen':",
    "description": "Factors including the size and remoteness of its location could mean abysmal conditions and limited access to counsel.",
    "link": "https://www.huffpost.com/entry/trump-alligator-alcatraz-immigrant-detention_n_6863753fe4b0e78a60400d0b",
    "timestamp": "2025-07-01T11:00:44Z"
  },
  {
    "title": "Nelly Calls Out Supporters Of Kamala Harris",
    "description": "Nelly has called out supporters of Kamala Harris as he continues to deal with backlash from his decision to perform at Donald Trump's inauguration.",
    "link": "https://hiphopdx.com/news/nelly-calls-out-supporters-kamala-harris",
    "timestamp": "2025-07-01T11:00:35Z"
  },
  {
    "title": "Circle Moves To Establish National Trust Bank In US Following $18 Billion IPO",
    "description": "Circle (CRCL), issuer of the market’s second largest stablecoin, USDC, is applying to establish a national trust bank in the United States. This announcement follows Circle’s recent Initital Public Offering (IPO), which valued the company at nearly $18 billio…",
    "link": "https://bitcoinist.com/circle-moves-to-establish-national-trust-bank/",
    "timestamp": "2025-07-01T11:00:06Z"
  },
  {
    "title": "“Cops in the form of alligators”: Trump visits Florida’s “Alcatraz” in the Everglades",
    "description": "The detention center is designed to fast track the detainment and deportation of undocumented immigrants",
    "link": "https://www.salon.com/2025/07/01/cops-in-the-form-of-alligators-trump-visits-floridas-alcatraz-in-the-everglades/",
    "timestamp": "2025-07-01T11:00:04Z"
  },
  {
    "title": "Sierra Club: The Trump Admin's Toxic MAHA Contradiction | Opinion",
    "description": "To really make America healthy, the administration should strengthen, not weaken, air quality protections—and that starts with supporting clean manufacturing.",
    "link": "https://www.newsweek.com/sierra-club-trump-admins-toxic-maha-contradiction-opinion-2092684",
    "timestamp": "2025-07-01T11:00:01Z"
  },
  {
    "title": "The Most Overlooked Value of Political Protest",
    "description": "Small acts of staying quiet may seem merely polite or indifferent, but they can easily spiral.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/07/silence-spiral/683372/",
    "timestamp": "2025-07-01T11:00:00Z"
  },
  {
    "title": "‘MAHA Report’ calls for fighting chronic disease, but Trump and Kennedy have yanked funding | CNN",
    "description": "Scientists and public health advocates see disconnects between what the Trump administration says about health — notably, in its “MAHA Report” — and what it’s actually doing.",
    "link": "https://www.cnn.com/2025/07/01/health/maha-report-chronic-disease-funding-kff-health-news",
    "timestamp": "2025-07-01T10:54:59Z"
  },
  {
    "title": "Elon Musk’s xAI raises $10B as Trump threatens to unleash DOGE on him",
    "description": "Elon Musk’s xAI secures $10 billion to expand its AI operations as Musk’s clash with President Donald Trump over government spending heats up again.",
    "link": "https://cointelegraph.com/news/musk-xai-raises-10b-trump-feud-reignites",
    "timestamp": "2025-07-01T10:54:59Z"
  },
  {
    "title": "Trump Tells Musk to “Head Back Home to South Africa” in Escalating Feud",
    "description": "After Musk threatened to form a new political party, the president fired back with a nativist attack, accusing the billionaire of being a subsidy addict and threatening to have his own companies investigated.",
    "link": "https://gizmodo.com/trump-tells-musk-to-head-back-home-to-south-africa-in-escalating-feud-2000622639",
    "timestamp": "2025-07-01T10:54:52Z"
  },
  {
    "title": "Tariffs Propel US Customs Revenue To A Record $106 Billion Since Trump's Inauguration",
    "description": "The U.S. Customs and Border Protection (CBP) has collected more than $106 billion in customs revenue since Donald Trump assumed the presidency, with a significant portion attributed to the administration’s tariffs.\nWhat Happened: The Department of Homeland Se…",
    "link": "https://biztoc.com/x/9ca108702b827a5b",
    "timestamp": "2025-07-01T10:51:56Z"
  },
  {
    "title": "Capitol Hill all-nighter",
    "description": "Senators stayed up all night hashing out a major tax bill. Here is the news to know on Tuesday.",
    "link": "https://www.usatoday.com/story/news/2025/07/01/trump-tax-bill-senate-republicans-july-4-idaho-shooting-travel-diddy-glastonbury-messi-love-island/84427202007/",
    "timestamp": "2025-07-01T10:48:49Z"
  },
  {
    "title": "18 GOP Senators Vote To Raise Taxes On Millionaires",
    "description": "Eighteen Senate Republicans backed an amendment that would have let President Donald Trump's 2017 tax cuts expire for the highest-earning Americans.",
    "link": "https://dailycaller.com/2025/07/01/millionaire-tax-republicans-democrats-big-beautiful-bill/",
    "timestamp": "2025-07-01T10:48:47Z"
  },
  {
    "title": "Iranian Hackers Threaten to Leak 100GB of Stolen Trump Team Emails",
    "description": "An Iran-linked hacker group is threatening to release 100GB of stolen emails from Trump’s inner circle in what officials call as a \"calculated smear campaign.\"\nThe post Iranian Hackers Threaten to Leak 100GB of Stolen Trump Team Emails first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/iranian-hackers-threaten-to-leak-100gb-of-stolen-trump-team-emails/",
    "timestamp": "2025-07-01T10:48:14Z"
  },
  {
    "title": "Trump Explodes Over Botched Call With Thousands Of Faith Leaders, Slams AT&T As ‘Totally Incompetent’ – Company Fires Back, Blames Mystery Platform For The Glitch",
    "description": "Former President Trump had an important conference call intended to bring faith leaders cross the U.S., together for a series of dialogues and also to emphasize the outreach efforts being done for these groups. The call however was delayed due to some technic…",
    "link": "https://wccftech.com/trump-explodes-over-botched-call-with-thousands-of-faith-leaders-slams-att-as-totally-incompetent-company-fires-back-blames-mystery-platform-for-the-glitch/",
    "timestamp": "2025-07-01T10:48:09Z"
  },
  {
    "title": "Is Washington Trying to Provoke a Full-Blown Banking Crisis in Mexico?",
    "description": "This time round, it wouldn't be just US banks that would be heavily exposed to the resulting fallout; so, too, would European lenders.",
    "link": "https://www.nakedcapitalism.com/2025/07/is-washington-trying-to-provoke-a-financial-crisis-in-mexico.html",
    "timestamp": "2025-07-01T10:45:58Z"
  },
  {
    "title": "Public health expert: Trump’s “big, beautiful bill” will cause misery and death",
    "description": "51,000 deaths per year is just the starting point",
    "link": "https://www.salon.com/2025/07/01/public-health-expert-trumps-big-beautiful-bill-will-cause-misery-and-death/",
    "timestamp": "2025-07-01T10:45:17Z"
  },
  {
    "title": "Iran: The Things It Won’t Do to Say",
    "description": "In his unpublished preface\r\n to Animal Farm, George Orwell remarks that “the sinister fact about literary censorship in England is that it is largely voluntary. It is not exactly forbidden to say this, that, or the other, but it is ‘not done’ to say it, just …",
    "link": "https://www.commondreams.org/opinion/what-we-can-t-say-about-iran",
    "timestamp": "2025-07-01T10:42:03Z"
  },
  {
    "title": "Trump’s Iran Strikes Were Masterful. Now His Dealmaking Skills Are Critical",
    "description": "By Kevin Roberts via The Daily Signal | June 30, 2025\nPresident Donald Trump is not like his predecessors. Confronting a hostile regime in Tehran that has played American presidents for more than 35 years, the commander in chief took decisive action on June 2…",
    "link": "https://biztoc.com/x/d874a17b05d53b0e",
    "timestamp": "2025-07-01T10:41:00Z"
  },
  {
    "title": "Trump Learned The Lessons Of Iraq",
    "description": "By David Harsanyi via The Daily Signal | June 28, 2025\nPresident Donald Trump has finally moved the United States past the traumas of the Iraq War.\nWith the bombing of Iranian nuclear facilities in Fordow, Isfahan and Natanz, the U.S. made the world a safer p…",
    "link": "https://biztoc.com/x/d5caaf779ead3f0a",
    "timestamp": "2025-07-01T10:40:40Z"
  },
  {
    "title": "Trump Rolls Over For A New War",
    "description": "By Philip Giraldi, Ron Paul Institute for Peace and Prosperity | June 30, 2025\nIt is generally believed that American voters elected Donald Trump president at least in part due to their embracing his lies that he was a peacemaker who would not involve the Uni…",
    "link": "https://biztoc.com/x/99d999445f6927b0",
    "timestamp": "2025-07-01T10:40:36Z"
  },
  {
    "title": "The Republican tax bill, explained in 500 words",
    "description": "President Donald Trump speaks to members of the media as he departs a House Republican meeting at the US Capitol in May to promote his signature bill. | Andrew Harnik/Getty Images \nRepublicans are barreling ahead to try to pass President Donald Trump’s “one b…",
    "link": "https://biztoc.com/x/0eb21955a8f2176f",
    "timestamp": "2025-07-01T10:40:25Z"
  },
  {
    "title": "Netanyahu announces US Trip after Operation Rising Lion victory",
    "description": "PM to meet President Trump, top US officials, and lawmakers to advance key agreements following military operation success.",
    "link": "https://www.israelnationalnews.com/news/410953",
    "timestamp": "2025-07-01T10:39:29Z"
  },
  {
    "title": "'Vulgarian': How Trump paved the way for Jeff Bezos' 'tone deaf' wedding",
    "description": "Amazon founder Jeff Bezos' ultra-lavish, $55 million Venetian wedding to Lauren Sánchez became a stark symbol of wealth disparity, transforming from a private celebration into a provocative display of elite excess that exposed deep societal fractures.And the …",
    "link": "https://www.rawstory.com/bezos-wedding/",
    "timestamp": "2025-07-01T10:39:24Z"
  },
  {
    "title": "European Central Bank head: Frequent shocks to economy make inflation more unpredictable",
    "description": "The head of the European Central Bank said inflation has become more unpredictable due to shocks like the COVID-19 pandemic and Russia’s invasion of Ukraine — and that policymakers need to take the possibility of such extreme scenarios into account and...",
    "link": "https://abcnews.go.com/Business/wireStory/european-central-bank-head-frequent-shocks-economy-make-123352432",
    "timestamp": "2025-07-01T10:38:27Z"
  },
  {
    "title": "Trump Threatens Musk as Senate Pulls All-Nighter on Tax Bill | Bloomberg The Pulse 07/01",
    "description": "Donald Trump again threatened to withdraw government subsidies from Elon Musk's companies after the Tesla CEO ratcheted up ...",
    "link": "https://biztoc.com/x/dafdec7254270324",
    "timestamp": "2025-07-01T10:35:39Z"
  },
  {
    "title": "Playbook: Trump vs. Musk, Round II (Politico)",
    "description": "Politico:\nPlaybook: Trump vs. Musk, Round II  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  On the Playbook Podcast this morning, Jack and POLITICO's White House reporter — and resident immigration expert — Myah Ward discuss “Alligator Alcatra…",
    "link": "https://www.memeorandum.com/250701/p8",
    "timestamp": "2025-07-01T10:35:01Z"
  },
  {
    "title": "History Shows us Why a Non-Partisan U.S. Military is Essential",
    "description": "When partisanship threatened to politicize the military in the Clinton years, a moderate Republican helped maintain the military’s legitimacy.",
    "link": "https://time.com/7296041/non-partisan-military-is-essential/",
    "timestamp": "2025-07-01T10:34:00Z"
  },
  {
    "title": "Report: British Open Returning to Trump Turnberry Unlikely, per R&A Insider",
    "description": "Everything seems to indicate that the Open Championship will not be returning to Trump Turnberry anytime soon.",
    "link": "https://www.newsweek.com/sports/golf/british-open-news-trump-turnberry-return-unlikely-2091893",
    "timestamp": "2025-07-01T10:30:01Z"
  },
  {
    "title": "Japan Stocks Fall on Trump Tariff Threat",
    "description": "6 min ago\nJapan Stocks Fall on Trump Tariff Threat\nAsian markets traded mixed on Tuesday as investors weighed up solid manufacturing data out of China and fresh trade threats from President Donald Trump.\nChina's mainland CSI 300 index gained 0.2% after the Ca…",
    "link": "https://biztoc.com/x/4cf9b1ac45e2f084",
    "timestamp": "2025-07-01T10:29:11Z"
  },
  {
    "title": "Carney Gives Trump a Small Trade Victory in Hunt for Larger Deal",
    "description": "Canadian Prime Minister Mark Carney handed US President Donald Trump a win in the hope of making bigger gains in trade negotiations.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-gives-trump-a-small-trade-victory-in-hunt-for-larger-deal",
    "timestamp": "2025-07-01T10:21:28Z"
  },
  {
    "title": "Ukrainian drone strikes a Russian plant after record Russian drone attacks in June",
    "description": "Officials say a Ukrainian drone has struck an industrial plant deep inside Russia, injuring several people and causing a fire",
    "link": "https://abcnews.go.com/International/wireStory/ukrainian-drone-strikes-russian-plant-after-record-russian-123366038",
    "timestamp": "2025-07-01T10:20:12Z"
  },
  {
    "title": "American Bitcoin, Backed by Eric and Donald Trump Jr, Pulls In $220M to Accumulate BTC",
    "description": "American Bitcoin Corp, a Miami-based mining company majority owned by Hut 8 (HUT) and backed by the Trump family, has raised $220 million from accredited investors, according to a filing with the U.S. Securities and Exchange Commission.\nThe raise topped its t…",
    "link": "https://biztoc.com/x/db5861abdf7cb6e3",
    "timestamp": "2025-07-01T10:18:21Z"
  },
  {
    "title": "Over 14 million people could die from Trump administration cuts to U.S. foreign aid, study finds",
    "description": "The US Agency for International Development (USAID) had provided over 40% of global humanitarian funding until Donald Trump returned to the White House in January.",
    "link": "https://fortune.com/2025/07/01/14-million-people-die-trump-cuts-us-foreign-aid-study-finds/",
    "timestamp": "2025-07-01T10:17:49Z"
  },
  {
    "title": "What we know about ‘Alligator Alcatraz,’ Florida’s new controversial migrant detention facility",
    "description": "Deep in the marshy wetlands of the Florida Everglades – less than 50 miles west of President Donald Trump’s Doral resort in Miami – sits the latest battleground in his administration’s immigration enforcement efforts: A detention facility dubbed, “Alligator A…",
    "link": "https://www.cnn.com/2025/07/01/us/what-is-alligator-alcatraz-florida",
    "timestamp": "2025-07-01T10:16:52Z"
  },
  {
    "title": "Over 14 mln people ‘could die from US foreign aid cuts’",
    "description": "More than 14 million of the world's most vulnerable people, a third of them small children, could die because of the Trump administration's dismantling of U.S. foreign aid, a research projected Tuesday.",
    "link": "https://www.hurriyetdailynews.com/over-14-mln-people-could-die-from-us-foreign-aid-cuts-210968",
    "timestamp": "2025-07-01T10:15:04Z"
  },
  {
    "title": "Market Wrap: Sensex climbs 90 pts, Nifty tops 25,500 as investors eye U.S. trade talks",
    "description": "Indian indices closed marginally higher, mirroring Asian market optimism, as investors await developments in trade negotiations with the U.S. before the July 9 tariff deadline. Gains in Reliance Industries, driven by an upgraded target price, offset broader s…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/market-wrap-sensex-climbs-90-pts-nifty-tops-25500-as-investors-eye-u-s-trade-talks/articleshow/122180878.cms",
    "timestamp": "2025-07-01T10:14:15Z"
  },
  {
    "title": "Market Wrap: Sensex climbs 90 pts, Nifty tops 25,500 as investors eye U.S. trade talks",
    "description": "Indian indices closed marginally higher, mirroring Asian market optimism, as investors await developments in trade negotiations with the U.S. before the July 9 tariff deadline. Gains in Reliance Industries, driven by an upgraded target price, offset broader s…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-climbs-90-pts-nifty-tops-25500-as-investors-eye-u-s-trade-talks/articleshow/122180878.cms",
    "timestamp": "2025-07-01T10:14:15Z"
  },
  {
    "title": "Trump Threatens to Launch DOGE Investigation Into Elon Musk, Send Billionaire ‘Back Home to South Africa’",
    "description": "President Donald Trump threatened to launch a Department of Government Efficiency (DOGE) investigation into former DOGE head Elon Musk on Tuesday.\nThe post Trump Threatens to Launch DOGE Investigation Into Elon Musk, Send Billionaire ‘Back Home to South Afric…",
    "link": "https://www.mediaite.com/media/news/trump-threatens-to-launch-doge-investigation-into-elon-musk-and-send-billionaire-back-home-to-south-africa/",
    "timestamp": "2025-07-01T10:13:02Z"
  },
  {
    "title": "Let AI Explain Why Teslas Critics Are Losing",
    "description": "Plugging the question “Why is Tesla's market value four times Toyota's?” into Bloomberg’s artificial intelligence-driven search function proves enlightening.",
    "link": "https://www.livemint.com/companies/news/let-ai-explain-why-teslas-critics-are-losing-11751364774283.html",
    "timestamp": "2025-07-01T10:12:53Z"
  },
  {
    "title": "Bono Recites 'Emotional' Poem Mourning USAID Shutdown in Video with Bush & Obama",
    "description": "The dewy-eyed trio of former Presidents Barack Obama and George W. Bush alongside singer Bono all mourned the passing of USAID on Monday, with the U2 frontman embracing his inner Robert Frost and reciting a sad poem he wrote to lament the occasion.\nThe post B…",
    "link": "https://www.breitbart.com/entertainment/2025/07/01/so-sad-bono-recites-a-poem-as-bush-and-obama-despair-at-usaid-shutdown/",
    "timestamp": "2025-07-01T10:08:17Z"
  },
  {
    "title": "JPMorgan Guts Tesla Q2 Delivery Estimate, Stock Down By 4.5% Amidst 62% Sales Drop In Europe",
    "description": "Tesla continued to face delivery headwinds in the second quarter and should miss consensus estimates, believes investment bank JPMorgan. In a fresh investment note, the bank shares that Tesla's second quarter deliveries should be roughly 360,000 vehicles, whi…",
    "link": "https://wccftech.com/jpmorgan-guts-tesla-q2-delivery-estimate-stock-down-by-4-5-amidst-62-sales-drop-in-europe/",
    "timestamp": "2025-07-01T10:07:55Z"
  },
  {
    "title": "Map and List of Cities Hosting Anti-Trump Protests on Fourth of July",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDemonstrations, rallies and other events protesting President Donald Trump's administration are set to be held across the country throughout the Independence Day weekend.\nWhy It Matters\nThe upcoming events fol…",
    "link": "https://biztoc.com/x/8fccea8cd41430cd",
    "timestamp": "2025-07-01T10:07:41Z"
  },
  {
    "title": "Netanyahu confirms US visit for next week",
    "description": "Israeli Prime Minister Benjamin Netanyahu revealed on Tuesday that he will travel to the United States next week to meet with President Donald Trump and other senior Washington officials. Delivering o...",
    "link": "https://biztoc.com/x/d078fddf42228a2c",
    "timestamp": "2025-07-01T10:07:13Z"
  },
  {
    "title": "The Apprentice: Federal Reserve Edition",
    "description": "US President Donald Trump has made no secret of his disdain for Fed Chair Jerome Powell, whom he has repeatedly criticized for not cutting interest rates. But his plan to name Powell’s successor ten months early risks discrediting his own nominee, undermining…",
    "link": "https://www.project-syndicate.org/commentary/trump-misguided-plan-to-announce-new-fed-chair-early-by-kenneth-rogoff-2025-07",
    "timestamp": "2025-07-01T10:06:52Z"
  },
  {
    "title": "Stock Index Futures Slip With Focus on Trump’s Tax Bill and Trade Deals, U.S. JOLTs Report and Powell’s Remarks on Tap",
    "description": "September S&P 500 E-Mini futures (ESU25) are down -0.21%, and September Nasdaq 100 E-Mini futures (NQU25) are down -0.29% this morning, taking a breather...",
    "link": "https://www.barchart.com/story/news/33139600/stock-index-futures-slip-with-focus-on-trumps-tax-bill-and-trade-deals-u-s-jolts-report-and-powells-remarks-on-tap",
    "timestamp": "2025-07-01T10:06:13Z"
  },
  {
    "title": "\"Devastating consequences\": US bike industry may not recover from Trump tariffs until end of the decade, lobby group warns",
    "description": "\"We're pretty sober about the next four to five years,\" admits industry group, as bike brands warn they've \"never experienced a time like today\" as impact of Trump's tariffs compounds post-Covid troubles",
    "link": "https://road.cc/content/news/bike-industry-may-not-recover-trump-tariffs-until-2030-314737",
    "timestamp": "2025-07-01T10:04:50Z"
  },
  {
    "title": "Trump threatens Musk’s subsidies and contracts in latest social media spat",
    "description": "Former political allies Donald Trump and Elon Muisk have been bickering late at night again.",
    "link": "https://www.politico.eu/article/donald-trump-threatens-elon-musk-subsidies-contracts-social-media-spat-tesla-doge-debt/",
    "timestamp": "2025-07-01T10:02:45Z"
  },
  {
    "title": "Senate Republicans seek support for Trump’s big bill in overnight session",
    "description": "Senate Majority Leader John Thune says Republicans “got the job done” in passing President Donald Trump’s big bill of tax breaks and spending cuts.",
    "link": "https://www.news4jax.com/news/politics/2025/07/01/senate-republicans-search-for-support-trumps-big-bill-in-overnight-session/",
    "timestamp": "2025-07-01T10:02:36Z"
  },
  {
    "title": "EIA Sees USA Crude Oil Production Rising in 2025",
    "description": "The U.S. Energy Information Administration's latest short term energy outlook sees U.S. crude oil production rising this year.",
    "link": "https://www.rigzone.com/news/eia_sees_usa_crude_oil_production_rising_in_2025-01-jul-2025-181002-article/",
    "timestamp": "2025-07-01T10:01:18Z"
  },
  {
    "title": "Top Democrats, media demand Zohran Mamdani condemn 'globalize the intifada' phrase",
    "description": "Democratic lawmakers and members of the media have called on NYC mayoral candidate Zohran Mamdani to condemn the phrase \"globalize the intifada.\"",
    "link": "https://www.foxnews.com/media/top-democrats-media-demand-zohran-mamdani-condemn-globalize-intifada-phrase",
    "timestamp": "2025-07-01T10:00:26Z"
  },
  {
    "title": "VA hospital staff see plunging morale as shortages leave doctors prepping rooms and nurses chasing supplies | CNN Politics",
    "description": "VA hospital staff see plunging morale as shortages leave doctors prepping rooms and nurses chasing supplies | CNN Politicscnn.com",
    "link": "https://www.cnn.com/2025/07/01/politics/veterans-affairs-collins-cuts-shortages-morale",
    "timestamp": "2025-07-01T10:00:25Z"
  },
  {
    "title": "The Radical Past and Future of Christian Zionism",
    "description": "Sarah Jones speaks with the scholar Daniel G. Hummel about the history of Christian Zionism and its radical future.",
    "link": "http://nymag.com/intelligencer/article/christian-zionism-evangelicals-israel.html",
    "timestamp": "2025-07-01T10:00:12Z"
  },
  {
    "title": "SEN ALEX PADILLA: JD Vance and Trump personify political theater. And we're watching their biggest act yet",
    "description": "Let's take a look at VP JD Vance's recent LA visit, the Trump administration's military deployment and use of political theater to distract from policy failures.",
    "link": "https://www.foxnews.com/opinion/sen-alex-padilla-jd-vance-trump-personify-political-theater-were-watching-biggest-act-yet",
    "timestamp": "2025-07-01T10:00:09Z"
  },
  {
    "title": "Young Men Who Elected Trump Just Realized They Screwed Up",
    "description": "The young men who helped get Donald Trump back into the White House are now realizing they made a massive mistake, according to a Harvard polling expert...",
    "link": "https://www.thedailybeast.com/young-men-who-elected-trump-just-realized-they-scrwed-up/",
    "timestamp": "2025-07-01T10:00:06Z"
  },
  {
    "title": "Map and List of Cities Hosting Anti-Trump Protests on Fourth of July",
    "description": "Women's March is urging people to join or host block parties, marches and other events over the holiday weekend.",
    "link": "https://www.newsweek.com/map-lists-cities-trump-protests-2092556",
    "timestamp": "2025-07-01T10:00:01Z"
  },
  {
    "title": "“That’s new and disturbing”: Kristi Noem secretly took a cut of political donations",
    "description": "A dark money group paid $80,000 to Noem’s personal company when she was governor of South Dakota.",
    "link": "https://www.salon.com/2025/07/01/thats-new-and-disturbing-kristi-noem-secretly-took-a-cut-of-political-donations/",
    "timestamp": "2025-07-01T10:00:01Z"
  },
  {
    "title": "GOP Rep: 'Big Beautiful Bill' Would Secure Southern Border | Opinion",
    "description": "For four years, under the radical policies of the Biden administration, our southern border was opened and illegal immigration was encouraged.",
    "link": "https://www.newsweek.com/gop-rep-big-beautiful-bill-would-secure-southern-border-opinion-2092689",
    "timestamp": "2025-07-01T10:00:01Z"
  },
  {
    "title": "Ban on AI Regulations in Trump’s Tax Bill Carries a Huge Environmental Cost",
    "description": "This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration. Republicans are pushing to pass a major spending bill that includes provisions to prevent states from enacting regulations on artificial inte…",
    "link": "https://www.motherjones.com/politics/2025/07/big-beautiful-bill-ban-state-ai-regulations-environmental-energy-climate/",
    "timestamp": "2025-07-01T10:00:00Z"
  },
  {
    "title": "The Emoji Tongue",
    "description": "If  was a word, would that make emoji a language?",
    "link": "http://longreads.com/2025/07/01/emoji-language-keith-houston/",
    "timestamp": "2025-07-01T10:00:00Z"
  },
  {
    "title": "The Godfather Presidency: How Donald Trump’s Governing Style Mimics the Mob",
    "description": "Forget comparisons to autocrats. The most accurate model for understanding Trump is the politically connected underbelly of 1970s and ’80s New York real estate.",
    "link": "https://www.vanityfair.com/news/story/how-donald-trumps-governing-style-mimics-the-mob",
    "timestamp": "2025-07-01T10:00:00Z"
  },
  {
    "title": "Trump's 'Big Beautiful Bill' doesn't directly allow president to delay or cancel elections",
    "description": "H.R. 1, the One Big Beautiful Bill Act, contains a provision allowing the U.S. president to delay or cancel elections.",
    "link": "https://www.snopes.com//fact-check/trump-big-beautiful-bill-elections/",
    "timestamp": "2025-07-01T10:00:00Z"
  },
  {
    "title": "Is This How ICE Barbie Got Her $50,000 Rolex?",
    "description": "Competition is fierce to be the dumbest Trump Cabinet secretary. Health and Human Services Secretary Robert Kennedy Jr. is no rocket scientist, but is it fair to pick on a guy whose brain got eaten by a worm? Defense Secretary Pete Hegseth is a featherweight,…",
    "link": "https://newrepublic.com/article/197452/kristi-noem-watch-rolex-political-donations",
    "timestamp": "2025-07-01T10:00:00Z"
  },
  {
    "title": "That ‘One Big Beautiful Bill’ ties genAI deregulation to broadband funding",
    "description": "There is so much to hate about the “One Big Beautiful Bill” now making its way through Congress. And among the things near the top of my list is how it deals with various tech industry issues — especially the proposed freeze on state and local governments’ ab…",
    "link": "https://www.computerworld.com/article/4014984/that-one-big-beautiful-bill-ties-genai-deregulation-to-broadband-funding.html",
    "timestamp": "2025-07-01T10:00:00Z"
  },
  {
    "title": "Global shares are mixed after US shares rally into record heights",
    "description": "Global shares are mixed after U.S. stocks added to their records with the close of a second straight winning month",
    "link": "https://abcnews.go.com/US/wireStory/global-shares-mixed-after-us-shares-rally-record-123363422",
    "timestamp": "2025-07-01T09:58:22Z"
  },
  {
    "title": "Elon Musk indicates he'll donate to Rep. Thomas Massie, a Republican who has been excoriated by Trump",
    "description": "Elon Musk has indicated that he will donate to Rep. Thomas Massie, a Republican House lawmaker who President Donald Trump has repeatedly excoriated",
    "link": "https://www.foxnews.com/politics/elon-musk-indicates-hell-donate-rep-thomas-massie-republican-who-has-been-excoriated-trump",
    "timestamp": "2025-07-01T09:58:05Z"
  },
  {
    "title": "Democrat Colin Allred is running again for US Senate in Texas",
    "description": "Democrat Colin Allred is once again running for the U.S. Senate",
    "link": "https://abcnews.go.com/Politics/wireStory/democrat-colin-allred-running-us-senate-texas-123365248",
    "timestamp": "2025-07-01T09:50:30Z"
  },
  {
    "title": "Greenland has a message for the rest of the world: Come visit",
    "description": "Greenland's tourism industry is expected to see a boom this year following the launch of a new route between the island’s capital and Newark airport",
    "link": "https://abcnews.go.com/Business/wireStory/greenland-message-rest-world-visit-123364174",
    "timestamp": "2025-07-01T09:50:19Z"
  },
  {
    "title": "The Supreme Court Just Gave Trump a Free Template to Win by Losing",
    "description": "On Friday, the justices held that federal courts lack authority to issue universal injunctions.",
    "link": "https://slate.com/news-and-politics/2025/07/supreme-court-trump-win-winning-losing.html",
    "timestamp": "2025-07-01T09:45:00Z"
  },
  {
    "title": "Shuttering of USAID Will Lead to Millions of Deaths Around the World: Studies",
    "description": "Multiple studies have estimated millions will die annually as a result of the Trump Administration’s closure of the foreign-aid agency.",
    "link": "https://time.com/7298994/usaid-deaths-studies-estimates-foreign-aid-hiv-aids-malaria-sudan/",
    "timestamp": "2025-07-01T09:45:00Z"
  },
  {
    "title": "Gold, silver gain over 1% as tariff worries return",
    "description": "Gold and silver traded higher on Tuesday as the deadline for trade deals with the United States approached. US President Donald Trump set July 9 as the limit after which global tariffs will come into ...",
    "link": "https://biztoc.com/x/e57dabdcd8edaf99",
    "timestamp": "2025-07-01T09:44:59Z"
  },
  {
    "title": "'Does Trump want Zohran Mamdani deported?': White House's explosive reaction will leave you stunned",
    "description": "Ever since Indian-origin Zohran Mamdani scored a stunning victory over former New York Gov. Andrew Cuomo, there have speculation about him getting deported. Many Republicans have asked President Donald Trump to revoke his visa and get him deported. The White …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-does-trump-want-zohran-mamdani-deported-white-houses-explosive-reaction-will-leave-you-stunned/articleshow/122179895.cms",
    "timestamp": "2025-07-01T09:40:08Z"
  },
  {
    "title": "California Rolls Back Environmental Restrictions on Urban Housing",
    "description": "California legislators took a rare step in the right direction on Monday when they passed a law rolling back the California Environmental Quality Act (CEQA) restrictions on building housing in urban \"infill\" areas.\nThe post California Rolls Back Environmental…",
    "link": "https://www.breitbart.com/politics/2025/07/01/california-rolls-back-environmental-restrictions-on-urban-housing/",
    "timestamp": "2025-07-01T09:36:50Z"
  },
  {
    "title": "Trump will visit a remote immigration detention site in the Florida Everglades (Associated Press)",
    "description": "Associated Press:\nTrump will visit a remote immigration detention site in the Florida Everglades  —  President Donald Trump is making a day trip to Florida's Everglades on Tuesday for a firsthand look at a new immigration detention facility that the White Hou…",
    "link": "https://www.memeorandum.com/250701/p6",
    "timestamp": "2025-07-01T09:35:01Z"
  },
  {
    "title": "Following success against Iran: Amb. Huckabee gives thanks at the Western Wall",
    "description": "US Ambassador Mike Huckabee visits Western Wall ahead of Independence Day, offers prayers for Israel and President Trump, and receives letter of gratitude from site’s rabbi.",
    "link": "https://www.israelnationalnews.com/news/410949",
    "timestamp": "2025-07-01T09:34:00Z"
  },
  {
    "title": "Donald Trump Meeting His Handshake Match Goes Viral",
    "description": "U.S. President Donald Trump's handshake with Dutch King Willem-Alexander has gone viral on social media.",
    "link": "https://biztoc.com/x/5cbf20146d705f91",
    "timestamp": "2025-07-01T09:33:48Z"
  },
  {
    "title": "Trump vents that AT&T is ‘totally unable to make their equipment work properly’ after call with faith leaders marred by glitch",
    "description": "On Monday afternoon, the president of the United States was just another person complaining online about his service provider.\nDonald Trump wrote in a pair of posts on Truth Social that he was trying to hold a conference call with faith leaders from all over …",
    "link": "https://biztoc.com/x/9b15caff9d4ce3a6",
    "timestamp": "2025-07-01T09:33:43Z"
  },
  {
    "title": "Bessent Is Treating Treasury Like a Hedge Fund",
    "description": "Flouting the doctrine of “regular and predictable” issuance comes with long-term risks.",
    "link": "https://www.livemint.com/companies/news/bessent-is-treating-treasury-like-a-hedge-fund-11751362395378.html",
    "timestamp": "2025-07-01T09:33:14Z"
  },
  {
    "title": "3 times Trump’s tariffs worked",
    "description": "President Donald Trump’s tariffs are",
    "link": "https://www.cnn.com/2025/07/01/business/3-times-trumps-tariffs-worked",
    "timestamp": "2025-07-01T09:30:24Z"
  },
  {
    "title": "Hochul favorability remains underwater as she heads into reelection, new polls shows",
    "description": "Hochul remains underwater with 42% of New Yorkers rating her favorable compared with 47% who rate her unfavorable, per Siena.",
    "link": "https://nypost.com/2025/07/01/us-news/hochul-favorability-remains-underwater-as-she-heads-into-reelection-new-polls-shows/",
    "timestamp": "2025-07-01T09:30:23Z"
  },
  {
    "title": "Trump has his fat little foot on Lady Liberty’s throat",
    "description": "It’s been another brutal week in a brutal country. There’s no sense candy-coating it.Thanks to a loaded, radical-right Supreme Court that believes in monarchies, not democracy — a group of robed anti-Americans led around by the nose and on lavish vacations by…",
    "link": "https://www.rawstory.com/raw-investigates/supreme-court-trump/",
    "timestamp": "2025-07-01T09:30:03Z"
  },
  {
    "title": "Bezos Does Venice",
    "description": "Katrina vanden Heuvel\n\n\n\nBack in New York City, Mamdani’s win shows even billionaires don’t always get what they want.\r\n\n\r\n\n\nThe post Bezos Does Venice appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=561942",
    "timestamp": "2025-07-01T09:30:00Z"
  },
  {
    "title": "SEC set for summer crypto ETF approval wave including XRP, ADA and SOL amid $6B investment surge",
    "description": "June 2025 was a landmark month for US spot Bitcoin and Ethereum exchange-traded funds (ETFs), as they collectively secured nearly $6 billion in fresh inflows. This impressive performance marks one of their strongest showings this year, reflecting heightened i…",
    "link": "https://cryptoslate.com/landmark-6-billion-influx-boosts-bitcoin-and-ethereum-etfs/",
    "timestamp": "2025-07-01T09:28:20Z"
  },
  {
    "title": "American Bitcoin, Backed by Eric and Donald Trump Jr, Pulls In $220M to Accumulate BTC",
    "description": "The company said $10 million of the total amount raised came in the form of bitcoin, at a rate of $104,000 per BTC.",
    "link": "https://www.coindesk.com/markets/2025/07/01/american-bitcoin-backed-by-eric-and-donald-trump-jr-pulls-in-220m-to-accumulate-btc",
    "timestamp": "2025-07-01T09:27:40Z"
  },
  {
    "title": "Donald Trump Meeting His Handshake Match Goes Viral",
    "description": "U.S. President Donald Trump's handshake with Dutch King Willem-Alexander has gone viral on social media.",
    "link": "https://www.newsweek.com/donald-trump-handshake-dutch-king-willem-alexander-viral-tiktok-2092873",
    "timestamp": "2025-07-01T09:26:55Z"
  },
  {
    "title": "Thai PM suspended amid anger and protests over leaked phone call",
    "description": "Thailand's prime minister has been suspended after a leaked phone call with a senior Cambodian politician caused outrage.",
    "link": "https://news.sky.com/story/thai-pm-paetongtarn-shinawatra-suspended-amid-outrage-over-leaked-phone-call-13390861",
    "timestamp": "2025-07-01T09:26:00Z"
  },
  {
    "title": "Israeli settler and NGO launch legal bid to overturn UK sanctions",
    "description": "Challenge by Moshe Sharvit and Hashomer Yosh marks first Israeli response to Foreign Office designations since 2024",
    "link": "https://www.jewishnews.co.uk/israeli-settler-and-ngo-launch-legal-bid-to-overturn-uk-sanctions/",
    "timestamp": "2025-07-01T09:25:34Z"
  },
  {
    "title": "Trump vents that AT&T is ‘totally unable to make their equipment work properly’ after call with faith leaders marred by glitch",
    "description": "Donald Trump wrote on Truth Social that he was trying to hold a conference call with faith leaders from all over the country but was unable to start the call because of technical difficulties.",
    "link": "https://fortune.com/2025/07/01/trump-atandt-totally-unable-to-make-their-equipment-work-properly/",
    "timestamp": "2025-07-01T09:24:17Z"
  },
  {
    "title": "Conservative Pundit Spells Out Exactly Why Republicans Are ‘So Glum’ About Donald Trump’s Bill",
    "description": "Charlie Sykes also warned of what may happen if and when the legislation has been passed.",
    "link": "https://www.huffpost.com/entry/charlie-sykes-republicans-donald-trump-bill_n_6863a34be4b0f166350d2d1a",
    "timestamp": "2025-07-01T09:23:51Z"
  }
]