[
  {
    "title": "Erika Kirk and J.D. Vance Romance Rumors",
    "description": "The Erika Kirk and J.D. Vance Romance Rumors, also known as the Erika Kirk and J.D. Vance Romance Theory, refers to rumors and an online conspiracy theory",
    "link": "https://knowyourmeme.com/memes/erika-kirk-and-jd-vance-romance-rumors",
    "timestamp": "2025-10-31T20:44:16Z"
  },
  {
    "title": "SNAP payments on November 1 won't stop, rules court. Here's how much one will get",
    "description": "Donald Trump administration had maintained that it would not try to cover the shortfall, not even by using billions of dollars that Congress had previously set aside for SNAP to address possible emergencies.",
    "link": "https://economictimes.indiatimes.com/news/international/us/snap-payments-on-november-1-wont-stop-rules-court-heres-how-much-one-will-get/articleshow/125005415.cms",
    "timestamp": "2025-10-31T20:43:41Z"
  },
  {
    "title": "Waller says he would accept Fed chair role",
    "description": "Federal Reserve Governor Christopher Waller told Fox Business on Friday that he would accept the role of Fed chair if United States President Donald Trump offered it to him.Reflecting on the central b...",
    "link": "https://biztoc.com/x/dda2371c8c9165f3",
    "timestamp": "2025-10-31T20:43:40Z"
  },
  {
    "title": "Joy Reid Fumes over Trump's White House Ballroom: 'Raze Every Edifice He's Built'",
    "description": "Former MSNBC host Joy Reid wants every bit of President Donald Trump's legacy erased and his home in Florida turned into a leftist museum.\nThe post Joy Reid Fumes over Trump’s White House Ballroom: ‘Raze Every Edifice He’s Built’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2025/10/31/joy-reid-fumes-over-trumps-white-house-ballroom-raze-every-edifice-hes-built/",
    "timestamp": "2025-10-31T20:43:06Z"
  },
  {
    "title": "Trump Ripped Out Another Part Of The White House And Replaced It With Marble",
    "description": "The president felt that the old style was \"totally inappropriate.\"",
    "link": "https://www.huffpost.com/entry/trump-latest-white-house-renovation-lincoln_n_6905015fe4b0060501ac253b",
    "timestamp": "2025-10-31T20:42:34Z"
  },
  {
    "title": "Trump Cabinet Secretary Calls Food Stamps Program 'Extremely Corrupt,' Not Going To 'Truly Needy'",
    "description": "Brooke Rollins attacked SNAP a day before funding for the welfare program is set to lapse.",
    "link": "https://www.huffpost.com/entry/brooke-rollins-snap-corrupt_n_6904faece4b0b48d8a1c53bb",
    "timestamp": "2025-10-31T20:39:32Z"
  },
  {
    "title": "Trump says US, Canada will not restart trade talks",
    "description": "WASHINGTON: US President Donald Trump said on Friday (Oct 31) the United States and Canada will not restart trade talks, but Canadian Prime Minister Mark Carney apologized to him for an Ontario political ad u",
    "link": "https://www.channelnewsasia.com/world/trump-says-us-canada-will-not-restart-trade-talks-5438921",
    "timestamp": "2025-10-31T20:38:13Z"
  },
  {
    "title": "Federal judge rules Trump can’t require citizenship proof on the federal voting form",
    "description": "President Donald Trump’s request to add a documentary proof of citizenship requirement to the federal voter registration form cannot be enforced, a federal...",
    "link": "https://www.yahoo.com/news/articles/federal-judge-rules-trump-t-203801490.html",
    "timestamp": "2025-10-31T20:38:01Z"
  },
  {
    "title": "Trump rejects resuming Canada trade talks after ad dispute",
    "description": "WASHINGTON: US President Donald Trump on Friday (Oct 31) flatly rejected any resumption of trade negotiations with Canada, one week after interrupting talks amid a dispute over an anti-tariff advertisement.\"I really like him a lot,\" the president said of Cana…",
    "link": "https://www.channelnewsasia.com/world/us-canada-no-trade-talks-trump-5438921",
    "timestamp": "2025-10-31T20:38:00Z"
  },
  {
    "title": "Portland Prepares for Invasion",
    "description": "James Ross Gardner on the Trump Administration’s efforts to portray Oregon’s capital as a hotbed of insurrection and deploy federalized National Guard troops to intervene.",
    "link": "https://www.newyorker.com/news/the-lede/portland-prepares-for-invasion",
    "timestamp": "2025-10-31T20:37:07Z"
  },
  {
    "title": "Crypto’s big ‘Uptober’ ends with a whimper, Bitcoin down 4%",
    "description": "While October didn’t bring in big wins for Bitcoin, one analyst says there’s reason to be optimistic for the cryptocurrency’s growth.",
    "link": "https://fortune.com/crypto/2025/10/31/bitcoin-price-today-ethereum-price-october-slump-uptober/",
    "timestamp": "2025-10-31T20:35:51Z"
  },
  {
    "title": "RFK Jr. concedes administration lacks scientific evidence on Tylenol claims (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nRFK Jr. concedes administration lacks scientific evidence on Tylenol claims  —  Despite Trump's rants, the health secretary conceded there's “not sufficient” evidence to prove a connection between Tylenol and autism.  —  As the summer nea…",
    "link": "https://www.memeorandum.com/251031/p117",
    "timestamp": "2025-10-31T20:35:01Z"
  },
  {
    "title": "Joe Scarborough Shuts Down House Democrat Who Claimed Trump ‘Took Advantage of Young Girls With Epstein’",
    "description": "Joe Scarborough jumped on a Democratic lawmaker for declaring that Donald Trump \"took advantage of young girls\" when he was associated with Jeffrey Epstein.\nThe post Joe Scarborough Shuts Down House Democrat Who Claimed Trump ‘Took Advantage of Young Girls Wi…",
    "link": "https://www.mediaite.com/media/news/joe-scarborough-shuts-down-house-democrat-who-claimed-trump-took-advantage-of-young-girls-with-epstein/",
    "timestamp": "2025-10-31T20:33:27Z"
  },
  {
    "title": "Trump reveals renovated Lincoln Bedroom bathroom as his White House remodel continues - CNN",
    "description": "Trump reveals renovated Lincoln Bedroom bathroom as his White House remodel continuesCNN President Trump shows off White House's Lincoln Bathroom renovated entirely in marbleABC News Trump reveals marble-covered Lincoln Bathroom as White House remodels move f…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179924532",
    "timestamp": "2025-10-31T20:32:55Z"
  },
  {
    "title": "Chinese Factory Activity Contracts for Seven Consecutive Months Under Tariff Pressures",
    "description": "The Chinese National Bureau of Statistics reported on Friday that manufacturing activity contracted for the seventh consecutive month in October, posting even lower numbers than expected.\nThe post Chinese Factory Activity Contracts for Seven Consecutive Month…",
    "link": "https://www.breitbart.com/asia/2025/10/31/chinese-factory-activity-contracts-for-seven-consecutive-months-under-tariff-pressures/",
    "timestamp": "2025-10-31T20:32:33Z"
  },
  {
    "title": "Top Republican rebuffs Trump calls to axe filibuster rule in shutdown standoff",
    "description": "Ending the long-standing rule would allow Republicans in the Senate to pass a funding bill without Democratic support.",
    "link": "https://www.bbc.com/news/articles/c1d0qwx5z2vo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-31T20:31:29Z"
  },
  {
    "title": "Trump's Pardon Of Changpeng Zhao Reportedly Followed Binance's High Level Task Force, $2 Billion Stablecoin Deal",
    "description": "The controversial pardon of Binance CEO Changpeng Zhao by President Donald Trump has reportedly been linked to a substantial boost in the market...",
    "link": "https://finance.yahoo.com/news/trumps-pardon-changpeng-zhao-reportedly-203122515.html",
    "timestamp": "2025-10-31T20:31:22Z"
  },
  {
    "title": "US courts rule Trump cannot suspend food aid during government shutdown",
    "description": "Critics expressed alarm after government said it would totally suspend food aid programme utilised by 42 million people.",
    "link": "https://www.aljazeera.com/news/2025/10/31/us-courts-rule-trump-cannot-suspend-food-aid-during-government-shutdown",
    "timestamp": "2025-10-31T20:31:16Z"
  },
  {
    "title": "What's the filibuster and why does Trump want to get rid of it during the shutdown?",
    "description": "Majority Republicans have strongly resisted calls to eliminate the legislative filibuster, since it would dilute their power if and when they are in the minority again.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_0acc2fba-5fda-5296-a40d-b3d336b5e6d1.html",
    "timestamp": "2025-10-31T20:30:00Z"
  },
  {
    "title": "What's the filibuster and why does Trump want to get rid of it during the shutdown?",
    "description": "Majority Republicans have strongly resisted calls to eliminate the legislative filibuster, since it would dilute their power if and when they are in the minority again.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_9c1370e2-77ca-5f09-a770-0311763b9f09.html",
    "timestamp": "2025-10-31T20:30:00Z"
  },
  {
    "title": "Fox News Politics Newsletter: Johnson warns against Trump’s ‘nuclear’ shutdown demand",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-johnson-warns-against-trumps-nuclear-shutdown-demand",
    "timestamp": "2025-10-31T20:29:51Z"
  },
  {
    "title": "Cuomo: Democratic Party Is In A \"Civil War,\" The Party's Strategy Is Just Hoping Trump Makes A Mistake",
    "description": "In an interview on Stephen A. Smith's SiriusXM political show \"Straight Shooter with Stephen A.,\" former Governor Andrew Cuomo (D-NY) said the Democratic Party is fighting a civil war. STEPHEN A. SMITH, HOST: What about your thoughts about Governor Kathy Hoch…",
    "link": "https://freerepublic.com/focus/f-news/4349863/posts",
    "timestamp": "2025-10-31T20:28:39Z"
  },
  {
    "title": "Trump’s recklessness may call America’s nuclear capability into question",
    "description": "Jen Psaki says statements from Trump and Vance about nuclear weapons testing could call America's capability into question and undermine our strength abroad.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-nuclear-weapons-vance-china-russia-rcna241141",
    "timestamp": "2025-10-31T20:27:12Z"
  },
  {
    "title": "Xi Takes the Spotlight at APEC Summit in Trump’s Absence",
    "description": "China aims to portray itself as a champion of free trade amid high U.S. tariffs.",
    "link": "http://foreignpolicy.com/2025/10/31/xi-jinping-apec-trump-trade-takaichi-carney-south-korea/",
    "timestamp": "2025-10-31T20:26:38Z"
  },
  {
    "title": "Why Iridium (IRDM) Stock Is Up Today",
    "description": "Shares of satellite communications provider jumped 4.1% in the afternoon session after the stock's positive momentum continued as the company unveiled a new ...",
    "link": "https://finance.yahoo.com/news/why-iridium-irdm-stock-today-202540008.html",
    "timestamp": "2025-10-31T20:25:40Z"
  },
  {
    "title": "What it could look like if the US resumes testing nuclear weapons",
    "description": "The US has not conducted nuclear weapons testing for 33 years. Now Donald Trump is calling for a resumption, raising concerns about what that may involve.",
    "link": "https://www.abc.net.au/news/2025-11-01/what-donald-trump-us-nuclear-weapons-testing-would-mean/105955836",
    "timestamp": "2025-10-31T20:25:20Z"
  },
  {
    "title": "Photos: Halloween celebrated around the world",
    "description": "The U.S. Halloween tradition is celebrated around the world.",
    "link": "https://www.bostonherald.com/2025/10/31/halloween-around-the-world/",
    "timestamp": "2025-10-31T20:24:36Z"
  },
  {
    "title": "Is This Why Trump Has Been Flirting With Running in 2028?",
    "description": "Trump cannot be president again. But he and his loyal followers have every reason for wanting to make people think he can. Can Donald Trump legally run for a third term as president of the United States? No. Can Trump serve as president for a third term? No. …",
    "link": "https://freerepublic.com/focus/f-news/4349861/posts",
    "timestamp": "2025-10-31T20:23:52Z"
  },
  {
    "title": "All the U.S. military strikes against alleged drug boats",
    "description": "The U.S. military has killed dozens of people in targeted strikes on small vessels in waters off South America since early September.",
    "link": "https://www.pbs.org/newshour/world/all-the-u-s-military-strikes-against-alleged-drug-boats",
    "timestamp": "2025-10-31T20:23:07Z"
  },
  {
    "title": "Saudi billions poised for Syria but US sanctions remain a barrier",
    "description": "DOHA (Reuters) -Major Saudi Arabian firms are planning billion-dollar investments in Syria as part of the kingdom's business-forward approach to the country's recovery, but U.S. sanctions and a fractured Syrian state apparatus pose formidable obstacles. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/11/01/saudi-billions-poised-for-syria-but-us-sanctions-remain-a-barrier",
    "timestamp": "2025-10-31T20:22:00Z"
  },
  {
    "title": "Judges order Trump administration to keep paying for SNAP during the shutdown",
    "description": "Two federal judges ruled nearly simultaneously on Friday that President Donald Trump’s administration must continue to fund SNAP, the nation’s biggest food aid program, using contingency funds during the government shutdown.\nThe judges in Massachusetts and Rh…",
    "link": "https://biztoc.com/x/fd5e61cc03eef40e",
    "timestamp": "2025-10-31T20:21:58Z"
  },
  {
    "title": "Elon Musk Tells Joe Rogan ‘The Democratic Party Wants To Destroy Democracy’ In Marathon Interview",
    "description": "Elon Musk railed against the Democratic Party's immigration policy during a three-hour interview on \"The Joe Rogan Experience\" posted Friday.",
    "link": "https://dailycaller.com/2025/10/31/elon-musk-joe-rogan-democratic-party-destroy-democracy/",
    "timestamp": "2025-10-31T20:21:22Z"
  },
  {
    "title": "Eric Trump and Freedom of the (Cider) Press",
    "description": "It’s autumn in Virginia, and lawns are covered with two things: multicolored leaves and multicolored political yard signs. Some people go apple-picking, and others go... Read More\nThe post Eric Trump and Freedom of the (Cider) Press appeared first on The Dail…",
    "link": "https://www.dailysignal.com/2025/10/31/eric-trump-freedom-cider-press/",
    "timestamp": "2025-10-31T20:21:03Z"
  },
  {
    "title": "Trump's First Nine Months Compared to Biden's Four Years",
    "description": "The left wing and media rage hysterically from one Trump psychodrama to the next, while President Donald Trump trolls both on social media. But all that is verbiage. What matters is the data and facts of Trump's first nine months since January 20, 2025, in co…",
    "link": "https://freerepublic.com/focus/f-news/4349860/posts",
    "timestamp": "2025-10-31T20:20:36Z"
  },
  {
    "title": "Angry Kamala Harris Says 'Outrageous' Trump is 'Gaslighting' the Country Because He Lacks Policy",
    "description": "The former vice president claimed Donald Trump used 'outrageous' statements to deflect from his lack of policy.",
    "link": "https://radaronline.com/p/kamala-harris-trump-gaslighting-deflection-lack-policy/",
    "timestamp": "2025-10-31T20:20:00Z"
  },
  {
    "title": "Trump says his mega MAGA ballroom won't cost voters a dime. Here's why that's a lie",
    "description": "Donald Trump and his Republican sycophants have been busy telling us that we shouldn’t be bothered by Trump’s demolition of the White House East Wing and his plans for a now $350 million ballroom. (The price tag keeps rising, it had been $200 million.)While m…",
    "link": "https://www.rawstory.com/white-house-ballroom-2674253947/",
    "timestamp": "2025-10-31T20:18:03Z"
  },
  {
    "title": "Trump slams Nigeria for persecution of Christians, labels it ‘country of particular concern’",
    "description": "Orders investigation of Muslim atrocities, as 'the United States cannot stand by'",
    "link": "https://www.wnd.com/2025/10/trump-slams-nigeria-persecution-christians-labels-it-country/",
    "timestamp": "2025-10-31T20:17:26Z"
  },
  {
    "title": "Shutdown Puts SNAP Benefits At Risk, But Exposes Billions Lost To Fraud And Abuse",
    "description": "The Supplemental Nutrition Assistance Program, facing a funding lapse on Nov. 1 amid the ongoing government shutdown, is fraught with systemic fraud and abuse.",
    "link": "https://dailycaller.com/2025/10/31/shutdown-puts-snap-benefits-at-risk-but-exposes-billions-lost-to-fraud-and-abuse/",
    "timestamp": "2025-10-31T20:17:09Z"
  },
  {
    "title": "Exclusive -- Realignment: In-Depth Analysis Reveals How Democrats Have Become the Party of the Rich, Elites",
    "description": "A new in-depth analysis demonstrates how the Democrat party has become the party of the rich and the elite, a remarkable political realignment in recent years that has Democrats in Congress now representing more than 75 percent of the wealthiest congressional…",
    "link": "https://www.breitbart.com/politics/2025/10/31/exclusive-realignment-in-depth-analysis-reveals-how-democrats-have-become-the-party-of-the-rich-elites/",
    "timestamp": "2025-10-31T20:16:36Z"
  },
  {
    "title": "A ’Political Revolution’ Is Underway In US— Here's What That Means For The Midterms: Ian Bremmer",
    "description": "President of Eurasia Group Ian Bremmer joined Brittany Lewis on \"Forbes Newsroom\" to discuss the United States' position almost a year after Trump was reelected.",
    "link": "https://www.forbes.com/sites/forbestv/2025/10/31/a-political-revolution-is-underway-in-us--heres-what-that-means-for-the-midterms-ian-bremmer/",
    "timestamp": "2025-10-31T20:16:06Z"
  },
  {
    "title": "Donald Trump’s Granddaughter Dances To Nicki Minaj, Queen Approves",
    "description": "Nicki Minaj is loved worldwide, but seeing Donald Trump's granddaughter as a fan? That’s pretty random.",
    "link": "https://hiphopwired.com/2890273/donald-trumps-granddaughter-dances-to-nicki-minaj-queen-approves/",
    "timestamp": "2025-10-31T20:13:45Z"
  },
  {
    "title": "Trump Insider Anticipates Venezuelan Regime Will Be Deposed Soon: 'Within Days, Maduro Will Exist Only In The Past Tense'",
    "description": "A person close to the Trump administration said the Venezuelan regime will be deposed imminently, adding to reports claiming military action from the U.S. against the South American country is fast approaching.",
    "link": "https://www.ibtimes.com/trump-insider-anticipates-venezuelan-regime-will-deposed-soon-within-days-maduro-will-exist-3789092",
    "timestamp": "2025-10-31T20:12:42Z"
  },
  {
    "title": "Hillary Clinton Face Fiasco: Sources Claim She Underwent 'Vampire' Facelift As $90M Divorce Looms",
    "description": "Hillary Clinton's shocking new look has insiders claiming she underwent an extreme makeover to avoid a looming £74M ($90M) divorce from Bill Clinton.",
    "link": "https://www.ibtimes.com/hillary-clinton-face-fiasco-sources-claim-she-underwent-vampire-facelift-90m-divorce-looms-3789089",
    "timestamp": "2025-10-31T20:12:25Z"
  },
  {
    "title": "Senate Rebels Against Trump: Lawmakers Vote to Strip President of Power to Slap Tariffs on Foreign Goods",
    "description": "In a rare bipartisan move, the US Senate voted to revoke Donald Trump's emergency tariff powers, signalling renewed congressional pushback against unilateral trade policy.",
    "link": "https://www.ibtimes.com/senate-rebels-against-trump-lawmakers-vote-strip-president-power-slap-tariffs-foreign-goods-3789087",
    "timestamp": "2025-10-31T20:12:03Z"
  },
  {
    "title": "Trump eyes issuing $1,000-$2,000 ‘dividend’ checks for Americans — with the cash coming from $1T in tariff revenue",
    "description": "Can it happen and at what cost?",
    "link": "https://www.aol.com/finance/trump-eyes-issuing-1-000-201000479.html",
    "timestamp": "2025-10-31T20:10:00Z"
  },
  {
    "title": "How Trump Could End the Shutdown on His Own (Russell Berman/The Atlantic)",
    "description": "Russell Berman / The Atlantic:\nHow Trump Could End the Shutdown on His Own  —  Will he give a 19th-century law another look?  —  President Donald Trump's theory of executive power does not lend much weight to the views of his predecessors—especially those who…",
    "link": "https://www.memeorandum.com/251031/p113",
    "timestamp": "2025-10-31T20:10:00Z"
  },
  {
    "title": "‘Activist’ detained after Ryanair affair is KGB – Lukashenko",
    "description": "Belarusian journalist Roman Protasevich, who was arrested and later pardoned, was a KGB agent, President Alexander Lukashenko has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627210-activist-detained-ryanair-kgb-lukashenko/",
    "timestamp": "2025-10-31T20:09:52Z"
  },
  {
    "title": "2 federal judges order continuation of SNAP benefits",
    "description": "Those who receive Supplemental Nutrition Assistance Program benefits should continue to do so after two federal court rulings ordered program funding on...",
    "link": "https://www.upi.com/Top_News/US/2025/10/31/snap-benefits/5351761939643/",
    "timestamp": "2025-10-31T20:09:35Z"
  },
  {
    "title": "The Internet’s New “Babygirl” is Curtis Sliwa",
    "description": "The Republican New York City mayoral candidate may be polling last in the race, but on TikTok he's found many fans.",
    "link": "https://www.vanityfair.com/news/story/the-internets-new-babygirl-is-curtis-sliwa",
    "timestamp": "2025-10-31T20:08:45Z"
  },
  {
    "title": "Trump calls Nigeria 'country of particular concern' due to 'slaughter' of Christians",
    "description": "Nigeria joins North Korea, Saudi Arabia, Iran and China on a list of countries \"of particular concern\" due to violations of religious freedom.",
    "link": "https://news.sky.com/story/donald-trump-calls-nigeria-country-of-particular-concern-due-to-slaughter-of-christians-13461480",
    "timestamp": "2025-10-31T20:08:00Z"
  },
  {
    "title": "Trump Reveals Photos Of Remodeled Lincoln Bathroom—Latest White House Renovation",
    "description": "Trump posted dozens of photos of the Lincoln Bedroom’s remodeled bathroom, stating the prior art deco style was “totally inappropriate for the Lincoln Era.”",
    "link": "https://www.forbes.com/sites/conormurray/2025/10/31/trump-reveals-photos-of-remodeled-lincoln-bathroom-latest-white-house-renovation/",
    "timestamp": "2025-10-31T20:05:21Z"
  },
  {
    "title": "Oil Steadies Ahead of OPEC+ Talks",
    "description": "Oil prices ended the week steady as traders anticipated another modest OPEC+ output increase.",
    "link": "https://www.rigzone.com/news/wire/oil_steadies_ahead_of_opec_talks-31-oct-2025-182216-article/",
    "timestamp": "2025-10-31T20:05:15Z"
  },
  {
    "title": "Pentagon shifts to Pacific strikes seeking stronger link between targets and US drug trafficking | CNN Politics",
    "description": "The Pentagon has deliberately shifted its strategy in recent weeks to striking suspected narcotraffickers in the eastern Pacific Ocean rather than the Caribbean Sea because administration officials believe they have stronger evidence linking cocaine transport…",
    "link": "https://www.cnn.com/2025/10/31/politics/pentagon-strikes-pacific-drug-trafficking",
    "timestamp": "2025-10-31T20:03:53Z"
  },
  {
    "title": "Pete Hegseth Claims It’s ‘Very Responsible’ For the US To Resume Nuclear Testing",
    "description": "Pete Hegseth claimed Friday that it was \"very responsible\" for the United States to resume nuclear testing as President Donald Trump has ordered.\nThe post Pete Hegseth Claims It’s ‘Very Responsible’ For the US To Resume Nuclear Testing first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/pete-hegseth-claims-its-very-responsible-for-the-us-to-resume-nuclear-testing/",
    "timestamp": "2025-10-31T20:03:16Z"
  },
  {
    "title": "Russian forces cut Ukrainian military supply line – MOD (VIDEO)",
    "description": "An airstrike on a bridge in Dnepropetrovsk Region has disrupted Ukrainian military logistics, Moscow has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627211-ukrainian-military-supply-line-cut/",
    "timestamp": "2025-10-31T20:03:00Z"
  },
  {
    "title": "Tucker Carlson Rejects Claims Venezuela Drives U.S. Drug Crisis: 'They're Not Produced There, They're Not Trafficked Through There'",
    "description": "Political commentator Tucker Carlson is publicly disputing claims that Venezuela is a primary source of illegal drugs entering the United States, arguing that the substances fueling the country's overdose crisis originate elsewhere.",
    "link": "https://www.ibtimes.com/tucker-carlson-rejects-claims-venezuela-drives-us-drug-crisis-theyre-not-produced-there-3789100",
    "timestamp": "2025-10-31T20:02:39Z"
  },
  {
    "title": "Obama-Appointed Judges Rule Trump Admin Must Find Ways To Fund SNAP Benefits Amid Shutdown",
    "description": "Two federal judges ruled on Friday that President Donald Trump’s administration must tap into a contingency fund to continue to fund critical food aid. The Supplemental Nutrition Assistance Program (SNAP) is set to run out of money on Nov. 1 due to the now 31…",
    "link": "https://dailycaller.com/2025/10/31/judge-trump-administration-snap-benefits-shutdown/",
    "timestamp": "2025-10-31T20:01:42Z"
  },
  {
    "title": "Israeli Embassy hits back at Ben & Jerry’s co-founder with 'Am Yisrael Chai' flavor",
    "description": "Ben Cohen’s “Palestine” ice cream flavor plan meets a bold reply from Israel’s US Embassy: “Am Yisrael Chai.”",
    "link": "https://www.israelnationalnews.com/news/417124",
    "timestamp": "2025-10-31T20:01:05Z"
  },
  {
    "title": "U.S.-Venezuela Tensions Intensify Regional Energy Risks",
    "description": "U.S.-Venezuela tensions are again rippling through energy and security markets, prompting President Donald Trump to rule out immediate military strikes while maintaining a buildup of American naval assets in the Caribbean.  His comments followed reports of U.…",
    "link": "https://oilprice.com/Energy/Energy-General/US-Venezuela-Tensions-Intensify-Regional-Energy-Risks.html",
    "timestamp": "2025-10-31T20:00:00Z"
  },
  {
    "title": "Trump's 'Fascination' With 'Blowing Up Bombs' Left Staffers Terrified, Former Official Claims... as the Prez Orders Nuclear Weapons Be Tested",
    "description": "Donald Trump seems to be all about 'bombs, and 'blowing up bombs,' according to a former staffer.",
    "link": "https://radaronline.com/p/trumps-obsession-blowing-up-bombs-left-staffers-terrified/",
    "timestamp": "2025-10-31T20:00:00Z"
  },
  {
    "title": "James Austin Johnson Says Impersonating Trump “Used To Not Be As Terrifying”",
    "description": "Trump's second term is a lot less funny and a lot more frightening than the first one",
    "link": "https://www.cracked.com/article_48977_james-austin-johnson-says-impersonating-trump-used-to-not-be-as-terrifying.html",
    "timestamp": "2025-10-31T20:00:00Z"
  },
  {
    "title": "GOP Rep. Has Truly Nasty Advice For SNAP Recipients Whose Benefits Are About To Expire",
    "description": "Rep. Clay Higgins (R-La.) appeared to have little sympathy Thursday for the millions of Americans whose federal food benefits are set to expire Saturday.",
    "link": "https://www.huffpost.com/entry/clay-higgins-snap-cuts-post-stop-smoking-crack_n_6904e1f9e4b0b48d8a1c4841",
    "timestamp": "2025-10-31T19:59:50Z"
  },
  {
    "title": "Americans facing hunger as shutdown enters second month",
    "description": "WASHINGTON: The US government shutdown barreled towards its second month Friday (Oct 31) - and the pain is spreading fast - with federal workers broke, food aid vanishing, and",
    "link": "https://www.channelnewsasia.com/world/americans-facing-hunger-shutdown-enters-second-month-5438766",
    "timestamp": "2025-10-31T19:59:37Z"
  },
  {
    "title": "Trump reveals marble-covered Lincoln Bathroom as White House remodels move forward amid shutdown",
    "description": "First the Oval Office, then the East Wing — and now, the Lincoln Bedroom's bathroom.\nPresident Donald Trump is plowing ahead with his inside-and-out remodel of the White House, and he's happy to show off the changes — even as critics slam him as \"tone deaf\" f…",
    "link": "https://biztoc.com/x/2fd3c9d9d3413e3a",
    "timestamp": "2025-10-31T19:59:36Z"
  },
  {
    "title": "Trump Denies Considering Strikes Against Venezuela While More U.S. Warships and Troops Amass Near Its Coasts: What The Photos Show",
    "description": "While President Donald Trump declared that he isn't considering attacking Venezuela, the United States has concentrated a rare mix of naval, air, and special operations power across the southern Caribbean and the approaches to the Venezuelan coast, what the p…",
    "link": "https://www.ibtimes.com/trump-denies-considering-strikes-against-venezuela-while-more-us-warships-troops-amass-near-its-3789114",
    "timestamp": "2025-10-31T19:49:52Z"
  },
  {
    "title": "Shutdown freezes health projects for seniors as HUD chief blasts ‘Left’s healthcare hypocrisy’",
    "description": "Government shutdown affects 12,800 healthcare facility beds across 32 states, primarily affecting senior citizens and Medicare patients.",
    "link": "https://www.foxnews.com/politics/shutdown-freezes-health-projects-seniors-hud-chief-blasts-lefts-healthcare-hypocrisy",
    "timestamp": "2025-10-31T19:49:45Z"
  },
  {
    "title": "Harrison Ford blasts Trump as 'world goes to hell': 'I don't know of a greater criminal in history'",
    "description": "The actor offered a scathing assessment of the president, calling out his \"hubris,\" \"lies,\" and \"perfidy\" and saying his climate policies \"scare the s--- out...",
    "link": "https://ew.com/harrison-ford-blasts-donald-trump-calls-him-criminal-as-world-goes-to-hell-11841421",
    "timestamp": "2025-10-31T19:47:25Z"
  },
  {
    "title": "Donald Trump Posts Two Dozen Photos Of His Latest White House Makeover: The Lincoln Bathroom",
    "description": "Donald Trump announced the completion of his latest makeover project at the White House: A marbled and gold Lincoln bathroom. Trump posted on Truth Social, “It was renovated in the 1940s in an art deco green tile style, which was totally inappropriate for the…",
    "link": "http://deadline.com/2025/10/trump-lincoln-bathroom-white-house-1236604245/",
    "timestamp": "2025-10-31T19:47:16Z"
  },
  {
    "title": "Trump reveals marble-covered Lincoln Bathroom as White House remodels move forward amid shutdown",
    "description": "Trump said the new \"statuary marble\" decor \"was very appropriate for the time of Abraham Lincoln and, in fact, could be the marble that was originally there!\"",
    "link": "https://www.cnbc.com/2025/10/31/trump-bathroom-white-house-remodel-shutdown.html",
    "timestamp": "2025-10-31T19:46:07Z"
  },
  {
    "title": "Israel returns 30 bodies of slain Palestinians as new strikes hit Gaza",
    "description": "Bodies of prisoners returned by Israel show signs of torture, as 3 Palestinians killed in Israeli strikes despite truce.",
    "link": "https://www.aljazeera.com/news/2025/10/31/israel-returns-30-bodies-of-slain-palestinians-as-new-strikes-hit-gaza",
    "timestamp": "2025-10-31T19:45:09Z"
  },
  {
    "title": "Trump Adds Gold and Marble to Lincoln Bathroom, As Abe Would Have Wanted",
    "description": "Trump added marble and gold to Lincoln Bathroom, claiming it’s now Lincoln-era appropriate. Abe actually used an outhouse and was infuriated by decadent White House renovations. But Mary would have loved the remodel!",
    "link": "http://nymag.com/intelligencer/article/trump-lincoln-bathroom.html",
    "timestamp": "2025-10-31T19:45:08Z"
  },
  {
    "title": "WaPo Reports Kennedy Center Ticket Sales Collapse Under Trump",
    "description": "Nearly nine months after President Donald Trump installed himself as chair of the Kennedy Center and tapped loyalist Richard Grenell to run operations, ticket sales at the nation’s premier performing-arts venue have cratered, according to a Washington Post an…",
    "link": "https://www.mediaite.com/media/news/wapo-reports-kennedy-center-ticket-sales-collapse-under-trump/",
    "timestamp": "2025-10-31T19:44:08Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of Oct. 25: Hurricane Melissa batters the Caribbean, Argentina holds midterm elections, and Trump travels through Asia.",
    "link": "http://foreignpolicy.com/2025/10/31/news-quiz-hurricane-melissa-asia-summits-argentina-cameroon-tanzania-us-troops/",
    "timestamp": "2025-10-31T19:43:12Z"
  },
  {
    "title": "‘Ridiculousness’ canceled at MTV in aftermath of Paramount layoffs",
    "description": "The long-running MTV comedy clip series \"Ridiculousness\" has been canceled.",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/ridiculousness-canceled-mtv-rcna241200",
    "timestamp": "2025-10-31T19:41:46Z"
  },
  {
    "title": "Rep. Jasmine Crockett claims Republicans keep walking up to her saying, \"I love you!\"",
    "description": " JUST IN: Rep. Jasmine Crockett claims Republicans keep walking up to her saying, \"I love you!\"  \"Cities, airports, people walk up to me. They tell me they have a difference on politics, but they LOVE ME!\" ",
    "link": "https://freerepublic.com/focus/f-bloggers/4349856/posts",
    "timestamp": "2025-10-31T19:41:14Z"
  },
  {
    "title": "HOLY SMOKES! The Pipe Bomb HOAX Story Implodes — Rep. Loudermilk Blows the Lid Off the Biden J6 Narrative! WATCH FULL LENGTH INTERVIEW HERE!!",
    "description": "In an exclusive new interview, Rep.\nThe post HOLY SMOKES! The Pipe Bomb HOAX Story Implodes — Rep. Loudermilk Blows the Lid Off the Biden J6 Narrative! WATCH FULL LENGTH INTERVIEW HERE!! appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/holy-smokes-pipe-bomb-hoax-story-implodes-rep/",
    "timestamp": "2025-10-31T19:40:55Z"
  },
  {
    "title": "Kennedy Center Announces Massive Fundraising Haul After Trimming ‘Bloated’ Staff",
    "description": "The Kennedy Center launched massive fundraising efforts in support of the Kennedy Center after trimming the staff and introducing new programming.",
    "link": "https://dailycaller.com/2025/10/31/kennedy-center-fundraising-trimming-bloated-staff-richard-grenell-president-donald-trump-arts-constructon-programming/",
    "timestamp": "2025-10-31T19:40:23Z"
  },
  {
    "title": "Trump says Carney 'apologized' for Ontario's anti-tariff ad during Asia trip",
    "description": "Both leaders crossed paths at a dinner on Wednesday ahead of the Asia-Pacific Economic Co-Operation (APEC) Summit.",
    "link": "https://nationalpost.com/news/canada/trump-says-carney-apologized-for-ontarios-anti-tariff-ad-during-asia-trip",
    "timestamp": "2025-10-31T19:40:01Z"
  },
  {
    "title": "As SNAP Was About to Expire, Trump Sent Billions to Other Countries, Accepted a Crown, and Worked on a Ballroom",
    "description": "Barf Bag: It's never a good time to do these things, but certainly not when you're on the verge of sending even more people to food banks.",
    "link": "https://www.jezebel.com/as-snap-was-about-to-expire-trump-sent-billions-to-other-countries-accepted-a-crown-and-worked-on-a-ballroom",
    "timestamp": "2025-10-31T19:37:03Z"
  },
  {
    "title": "How to Make Art Out of Confederate Monuments",
    "description": "\"A new show featuring decommissioned statues forces a reckoning with American history at a moment when Donald Trump is trying to stop just that.\"",
    "link": "http://longreads.com/2025/10/31/monuments-art-race-america/",
    "timestamp": "2025-10-31T19:35:55Z"
  },
  {
    "title": "Virginia Giuffre's brother calls for Prince Andrew to be investigated",
    "description": "Sky Roberts also appealed to King Charles to pressure Donald Trump into putting \"big boy pants on\" over the release of the Epstein files.",
    "link": "https://www.abc.net.au/news/2025-11-01/virginia-giuffre-s-brother-wants-andrew-investigated/105960436",
    "timestamp": "2025-10-31T19:35:14Z"
  },
  {
    "title": "The DOJ Lied Its Way to Victory in a Key Trump Case. It Just Got Caught in Court.",
    "description": "The president’s Department of Justice keeps lying brazenly to judges, and more often than not, it refuses to correct the record.",
    "link": "https://slate.com/news-and-politics/2025/10/doj-trump-lie-portland-national-guard.html",
    "timestamp": "2025-10-31T19:35:05Z"
  },
  {
    "title": "Epstein Victim's Brother Urges Trump To Put His 'Big Boy Pants' On",
    "description": "Sky Roberts, the brother of Virginia Guiffre, praised King Charles for stripping Prince Andrew's royal titles but said there's more to be done.",
    "link": "https://www.huffpost.com/entry/sky-roberts-donald-trump-jeffrey-epstein-prince-andrew_n_6904f923e4b00c26f0716434",
    "timestamp": "2025-10-31T19:32:57Z"
  },
  {
    "title": "Even Fellow Liberal Supreme Court Justices Are Getting Fed Up with Ketanji Brown Jackson: Report",
    "description": "When you use skin color and chromosomes as criteria for filling positions of trust, as opposed to filling those positions with the best people regardless of skin color or chromosomes, you will not, unless by accident, get the best people for the job. No publi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4349854/posts",
    "timestamp": "2025-10-31T19:30:50Z"
  },
  {
    "title": "Nicolle Wallace blasts Trump’s ‘self-inflicted, manufactured’ SNAP cut crisis",
    "description": "Nicolle Wallace blasts Trump for refusing to tap into emergency funds to cover lapsing SNAP benefits, labeling it a \"self-inflicted, manufactured crisis.\"",
    "link": "https://www.msnbc.com/top-stories/latest/snap-food-assistance-cuts-trump-self-inflicted-crisis-shutdown-rcna241162",
    "timestamp": "2025-10-31T19:30:10Z"
  },
  {
    "title": "The Nation’s Largest Food Aid Program Is About To See Cuts. Here’s What You Should Know.",
    "description": "The federal government is making sweeping changes to SNAP, the program that helped feed about 42 million people in the U.S. last year. Here’s a breakdown of the changes to come and potential impacts.",
    "link": "https://kffhealthnews.org/news/article/snap-food-stamps-cuts-shutdown-states-lawsuits-groceries-healthy-eating/",
    "timestamp": "2025-10-31T19:29:14Z"
  },
  {
    "title": "George Santos Shocks Tucker Carlson by Revealing Prison Is Full of Trump-Hating Liberals",
    "description": "George Santos shocked Tucker Carlson by revealing his time in prison was filled with \"lots of liberals\" who hate President Donald Trump.\nThe post George Santos Shocks Tucker Carlson by Revealing Prison Is Full of Trump-Hating Liberals first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/podcasts/george-santos-shocks-tucker-carlson-by-revealing-prison-is-full-of-trump-hating-liberals/",
    "timestamp": "2025-10-31T19:28:13Z"
  },
  {
    "title": "COLLUSION: ZERO ‘Arctic Frost’ Scandal Coverage By ABC, CBS, NBC",
    "description": "National broadcasters dedicated zero air time to informing the public about the FBI’s “Arctic Frost” scandal, a sprawling surveillance operation after Jan. 6 that probed more than 150 Republican lawmakers and entities close to President Donald Trump. Accordin…",
    "link": "https://freerepublic.com/focus/f-news/4349853/posts",
    "timestamp": "2025-10-31T19:28:09Z"
  },
  {
    "title": "COLLUSION: ZERO ‘Arctic Frost’ Scandal Coverage By ABC, CBS, NBC",
    "description": "National broadcasters dedicated zero air time to informing the public about the FBI’s “Arctic Frost” scandal, a sprawling surveillance operation after Jan. 6 that probed more than 150 Republican lawmakers and entities close to President Donald Trump. Accordin…",
    "link": "https://freerepublic.com/focus/f-bloggers/4349853/posts",
    "timestamp": "2025-10-31T19:28:09Z"
  },
  {
    "title": "Bitcoin breaks October streak with first monthly loss since 2018",
    "description": "Bitcoin on Friday was on track for a monthly loss in October for the first time since 2018, snapping a seven-year streak of gains that had earned the month a lucky reputation among cryptocurrency traders. Bitcoin, the world's largest cryptocurrency, is set fo…",
    "link": "https://www.channelnewsasia.com/business/bitcoin-breaks-october-streak-first-monthly-loss-2018-5438841",
    "timestamp": "2025-10-31T19:27:33Z"
  }
]