[
  {
    "title": "‘Radical Leftist’: Byron Donalds Brushes Off Never Trumper Ex-GOP Rep Running For FL Gov As Dem",
    "description": "Former Republican Rep. David Jolly announced Thursday that he is jumping into the 2026 Florida gubernatorial race as a Democrat.",
    "link": "https://dailycaller.com/2025/06/05/david-jolly-runs-governor-florida-democrat/",
    "timestamp": "2025-06-05T14:57:27Z"
  },
  {
    "title": "New Trump Attack on Harvard and Foreign Students Denounced as 'Authoritarian Overreach'",
    "description": "U.S. President Donald Trump on Wednesday released a directive invoking national security powers to impose a six-month ban on international students from entering the United States to study at Harvard University—a move that was quickly panned by observers and …",
    "link": "https://www.commondreams.org/news/trump-harvard-international-students-national-security",
    "timestamp": "2025-06-05T14:56:34Z"
  },
  {
    "title": "Trump Media files for spot Bitcoin ETF approval from SEC",
    "description": "The SEC has received a filing from Trump Media & Technology Group, tied to US President Donald Trump, seeking approval for the Truth Social Bitcoin ETF.",
    "link": "https://cointelegraph.com/news/trump-media-files-spot-bitcoin-etf-sec",
    "timestamp": "2025-06-05T14:55:46Z"
  },
  {
    "title": "Here's what to know about Trump's new travel ban",
    "description": "President Donald Trump announced on Wednesday night that nationals from 12 countries would be banned from entering the United States.",
    "link": "https://www.nbcnews.com/news/us-news/know-trumps-new-travel-ban-rcna211153",
    "timestamp": "2025-06-05T14:55:29Z"
  },
  {
    "title": "Dear Dems, Don't Welcome Elon Back (The Bulwark)",
    "description": "The Bulwark:\nDear Dems, Don't Welcome Elon Back  —  Embracing Musk's attacks on Trump's agenda is an enemy-of-my-enemy temptation Democrats should resist.  —  You may think of Donald Trump as a reckless arsonist of federal bureaucracy, but you can't say the b…",
    "link": "https://www.memeorandum.com/250605/p51",
    "timestamp": "2025-06-05T14:55:01Z"
  },
  {
    "title": "United States Provides Lone Veto for UN's Vote on Ceasefire in Gaza",
    "description": "With a Wednesday vote, the United States showed how it still appears to be one of the only countries at the United Nations willing to stand by Israel. Thanks to a veto from the United States, the Security Council did not adopt a resolution calling for an imme…",
    "link": "https://freerepublic.com/focus/f-news/4321127/posts",
    "timestamp": "2025-06-05T14:54:39Z"
  },
  {
    "title": "Trump is increasingly hostile to China. He’s playing with fire",
    "description": "Despite widespread concerns that the trade war is dragging down America’s economy, President Donald Trump has notched quite a few wins on his economic belt in recent weeks.",
    "link": "https://www.cnn.com/2025/06/05/business/trump-china-economy-tariffs-trade-war",
    "timestamp": "2025-06-05T14:54:11Z"
  },
  {
    "title": "New German leader plans to discuss Ukraine and trade with Trump in Oval Office visit",
    "description": "Support for Ukraine and tariffs are topics to be discussed by the two leaders.",
    "link": "https://www.bostonherald.com/2025/06/05/german-leader-merz-meets-trump/",
    "timestamp": "2025-06-05T14:52:57Z"
  },
  {
    "title": "Here’s what to know about Trump’s ban on citizens of 12 countries from entering the U.S.",
    "description": "The Trump administration Wednesday said the U.S. also will restrict access for citizens of seven other nations, resurrecting a hallmark policy of his first term. The ban taking effect at 12:01 a.m.",
    "link": "https://www.pbs.org/newshour/politics/heres-what-to-know-about-trumps-ban-on-citizens-of-12-countries-from-entering-the-u-s",
    "timestamp": "2025-06-05T14:52:36Z"
  },
  {
    "title": "Live updates: Trump and Musk escalate public feud over agenda bill | CNN Politics",
    "description": "President Donald Trump and Elon Musk’s disagreements over Trump’s agenda bill have spilled into public view. Trump also held a long-awaited call with China’s leader Xi Jinping on trade. Follow for live news updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-president-administration-news-06-05-25",
    "timestamp": "2025-06-05T14:48:55Z"
  },
  {
    "title": "Trump Issues Tavel Restrictions on Predominantly Muslim Nations, Vowing To Prevent ‘What Happened in Europe To Happen To America’",
    "description": "President Donald Trump issued travel restrictions on 12 nations, saying he will not allow “what happened in Europe to happen to America.” The majority of the... Read More\nThe post Trump Issues Tavel Restrictions on Predominantly Muslim Nations, Vowing To Prev…",
    "link": "https://www.dailysignal.com/2025/06/05/trump-issues-tavel-restrictions-predominantly-muslim-nations-vowing-prevent-what-happened-in-europe-to-happen-to-america/",
    "timestamp": "2025-06-05T14:47:43Z"
  },
  {
    "title": "Golan rocket fire a test of reported Israel-Syria security talks",
    "description": "Experts weigh new Syrian regime's intentions versus its capability to control territory after the first cross-border attacks since Assad's fall.",
    "link": "https://www.israelnationalnews.com/news/409509",
    "timestamp": "2025-06-05T14:46:45Z"
  },
  {
    "title": "Trump Golf Club Rated The County’s Nastiest – And The Health Violations Are BEYOND Gross - New Deep Left Field",
    "description": "For a man who is reportedly a germophobe, Donald Trump certainly doesn't have a problem exposing others to some of the most disgusting conditions imaginable at his Bedford, New Jersey golf club, according to a report from Forbes, which reveals that the facili…",
    "link": "https://newdeepleftfield.com/2025/06/05/trump-golf-club-rated-the-countys-nastiest-and-the-health-violations-are-beyond-gross/",
    "timestamp": "2025-06-05T14:45:49Z"
  },
  {
    "title": "Texans Gain the Right To Try Individualized Medical Treatments",
    "description": "If you're so sick that you have nothing to lose and you're looking the Grim Reaper in the face, why shouldn't you be able to try experimental and",
    "link": "https://reason.com/2025/06/06/texans-gain-the-right-to-try-individualized-medical-treatments/",
    "timestamp": "2025-06-05T14:44:56Z"
  },
  {
    "title": "Federal Judge Gives Trump One Week to Provide Habeas Corpus Relief to Venezuelans in CECOT",
    "description": "The Trump administration has a week to resolve what a federal judge in Washington, D.C. said has become a Kafkaesque legal battle for more than 130 Venezuelan people who were summarily expelled from the United States, after the judge ruled late Wednesday that…",
    "link": "https://www.commondreams.org/news/habeas-corpus-trump",
    "timestamp": "2025-06-05T14:44:44Z"
  },
  {
    "title": "Trump Golf Club Dinged for Multiple Critical Health Violations After Inspectors Discover Expired Milk, Sinks Without Soap: Report",
    "description": "Trump's Bedminster golf club earned the county's lowest score following a May health inspection, prompting a rushed reinspection after critical violations.",
    "link": "https://www.ibtimes.com/trump-golf-club-dinged-multiple-critical-health-violations-after-inspectors-discover-expired-milk-3775201",
    "timestamp": "2025-06-05T14:43:14Z"
  },
  {
    "title": "MSNBC Host Bursts With Pride In Watching His Wife Own Josh Hawley At Hearing",
    "description": "\"All In\" anchor Chris Hayes even quoted his spouse's snappy comeback at the Missouri senator over accusations of court bias against Trump.",
    "link": "https://www.huffpost.com/entry/chris-hayes-kate-shaw-josh-hawley-injunction_n_684184dfe4b04981b63b4426",
    "timestamp": "2025-06-05T14:43:08Z"
  },
  {
    "title": "Trump And Xi Jinping Hold Highly Anticipated Call, China Says",
    "description": "Neither Trump nor the White House had yet to weigh in on the phone call.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/05/trump-and-xi-jinping-hold-highly-anticipated-call-china-says/",
    "timestamp": "2025-06-05T14:40:15Z"
  },
  {
    "title": "Hockey legend Ovechkin visits Russian Federation Council (VIDEO)",
    "description": "NHL great Alexander Ovechkin has visited his home country after a record-breaking season in North America Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618699-ovechkin-federation-council-visit/",
    "timestamp": "2025-06-05T14:40:13Z"
  },
  {
    "title": "Nvidia dumps $4.5 billion in chips amid US trade restrictions: Why are China-specific H20 chips unusable?",
    "description": "Nvidia dumps $4.5 billion in chips amid US trade restrictions: Why are China-specific H20 chips unusable?",
    "link": "https://www.livemint.com/companies/news/nvidia-dumps-4-5-billion-in-chips-amid-us-trade-restrictions-why-are-china-specific-h20-chips-unusable-11749133514634.html",
    "timestamp": "2025-06-05T14:40:10Z"
  },
  {
    "title": "Tesla stock falls again as Musk's 'KILL the BILL' screed hits Trump tax bill's progress",
    "description": "Tesla stock slumped again on Thursday as the very public policy blowout between President Trump and Tesla CEO Elon Musk rolls on.",
    "link": "https://finance.yahoo.com/news/tesla-stock-falls-again-as-musks-kill-the-bill-screed-hits-trump-tax-bills-progress-121409722.html",
    "timestamp": "2025-06-05T14:39:06Z"
  },
  {
    "title": "Europe’s Call for Tech Sovereignty Takes a Hit. European Commission to Adopt a More Collaborative Approach",
    "description": "The European Commission will introduce the new International Digital Strategy that will focus on tech collaboration with the US and other countries. This is in contradiction to the growing pressure in Europe that calls for tech sovereignty and reducing tech d…",
    "link": "https://techreport.com/news/europe-tech-sovereignty-collaborative-shift/",
    "timestamp": "2025-06-05T14:38:26Z"
  },
  {
    "title": "National Portrait Gallery Director Reports to Work After Trump Said He Fired Her",
    "description": "Kim Sajet, director of the National Portrait Gallery, returned to work after Trump said he fired her.",
    "link": "https://www.artnews.com/art-news/news/national-portrait-gallery-director-report-work-trump-firing-1234744385/",
    "timestamp": "2025-06-05T14:36:48Z"
  },
  {
    "title": "Tesla shares sink 5% as Musk continues to bash Trump's spending bill",
    "description": "The drop comes as shares of the EV maker saw a 22% rally in May with Musk wrapping his time as Trump's Department of Government Efficiency, or DOGE.",
    "link": "https://www.cnbc.com/2025/06/05/tesla-shares-musk-trump.html",
    "timestamp": "2025-06-05T14:36:28Z"
  },
  {
    "title": "Watch: Marjorie Taylor Greene has her Trump bill regret quote thrown in her face",
    "description": "A House committee hearing grew heated on Wednesday when Rep. Marjorie Taylor Greene (R-GA) denied she regrets voting for President Donald Trump's One Big Beautiful Bill Act — and Rep. Robert Garcia (D-CA) reminded her she said she regretted it just one day pr…",
    "link": "https://www.rawstory.com/mtg-robert-garcia-fight/",
    "timestamp": "2025-06-05T14:36:04Z"
  },
  {
    "title": "Longtime Alabama Insurance Agent Announces Run for Governor",
    "description": "Longtime Alabama insurance agent and former congressional candidate Ken McFeeters announced he is running for governor of Alabama next year, casting himself as a political outsider and accusing his opponent U.S. Sen. Tommy Tuberville of being a “part of the …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/06/05/826449.htm",
    "timestamp": "2025-06-05T14:32:30Z"
  },
  {
    "title": "BCE corta pela oitava vez a taxa de juro de referência para os 2%",
    "description": "<p></p>",
    "link": "https://expresso.pt/expresso-fundamental/2025-06-05-bce-corta-pela-oitava-vez-a-taxa-de-juro-de-referencia-para-os-2-bb8817a2",
    "timestamp": "2025-06-05T14:31:12Z"
  },
  {
    "title": "Supreme Court makes it easier to claim 'reverse discrimination' in employment, in a case from Ohio",
    "description": "A unanimous Supreme Court has made it easier to bring lawsuits over so-called reverse discrimination, siding with an Ohio woman who claims she didn’t get a job and was demoted because she's straight.",
    "link": "https://www.ksat.com/business/2025/06/05/supreme-court-makes-it-easier-to-claim-reverse-discrimination-in-employment-in-a-case-from-ohio/",
    "timestamp": "2025-06-05T14:30:39Z"
  },
  {
    "title": "Trump speaks with China’s Xi amid trade, student visa tensions",
    "description": "US president previously said it was 'hard to make a deal' with the Chinese leader as talks continue over trade.",
    "link": "https://www.aljazeera.com/news/2025/6/5/trump-speaks-with-chinas-xi-amid-trade-student-visa-tensions",
    "timestamp": "2025-06-05T14:30:37Z"
  },
  {
    "title": "‘Love Island’ Contestant Removed From Villa After Using N-Word in Viral Videos",
    "description": "Yulissa Escobar only made it through one episode of the reality dating series before it was announced that she wouldn't return for the remainder of the season",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/love-island-usa-yulissa-removed-from-villa-1235356114/",
    "timestamp": "2025-06-05T14:30:11Z"
  },
  {
    "title": "NATO set to approve military purchases; new grocery price concerns | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_3e157e8e-4aae-5fe6-89f4-b90ae2d881bb.html",
    "timestamp": "2025-06-05T14:30:00Z"
  },
  {
    "title": "PA Williams wants more public safety",
    "description": "“We need an independent voice,” Public Advocate Jumaane Williams told the Chronicle in a Zoom interview Monday as he makes a bid for re-election ahead of the June 24 primary.As public advocate, Williams said his job is to hear residents…",
    "link": "https://www.qchron.com/editions/queenswide/pa-williams-wants-more-public-safety/article_ec07c785-eb80-5368-8db4-bf348b90507e.html",
    "timestamp": "2025-06-05T14:30:00Z"
  },
  {
    "title": "NATO set to approve military purchases; new grocery price concerns | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_d2dd5f19-34bd-5f37-9874-2f8122740a2f.html",
    "timestamp": "2025-06-05T14:30:00Z"
  },
  {
    "title": "Two US DOE-Funded Lithium Projects Set for Streamlined Permitting",
    "description": "The Kings Mountain and Liberty Owl lithium projects have made it to a list of critical mineral production projects added to the Federal Permitting Dashboard, giving them a streamlined process.",
    "link": "https://www.rigzone.com/news/two_us_doefunded_lithium_projects_set_for_streamlined_permitting-05-jun-2025-180766-article/",
    "timestamp": "2025-06-05T14:29:44Z"
  },
  {
    "title": "Brazil’s Lula urges Macron to seal Mercosur trade deal",
    "description": "Brazil’s President Luiz Inacio Lula da Silva urged his French counterpart Emmanuel Macron on Thursday to “finalise” an EU trade deal with four South American countries, in a visit that underscored key policy differences between the two allies. France has oppo…",
    "link": "https://www.digitaljournal.com/world/brazils-lula-urges-macron-to-seal-mercosur-trade-deal-2/article",
    "timestamp": "2025-06-05T14:27:20Z"
  },
  {
    "title": "Denmark’s biggest cities say goodbye to Microsoft, citing concerns over Donald Trump's policies",
    "description": "Danish cities drop Microsoft due to high costs and political concerns under Donald Trump's policies, marking a big step toward digital independence. Both Copenhagen and Aarhus municipalities are switching to European alternatives after years of relying on Mic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/denmarks-biggest-cities-say-goodbye-to-microsoft-citing-concerns-over-donald-trumps-policies/articleshow/121649636.cms",
    "timestamp": "2025-06-05T14:27:12Z"
  },
  {
    "title": "Trump Orders Investigation into Biden’s Alleged Use of Autopen",
    "description": "President Donald Trump has ordered an investigation into the alleged use of an autopen to sign pardons under the Biden administration without the former president’s... Read More\nThe post Trump Orders Investigation into Biden’s Alleged Use of Autopen appeared …",
    "link": "https://www.dailysignal.com/2025/06/05/trump-orders-investigation-in-bidens-alleged-use-autopen/",
    "timestamp": "2025-06-05T14:26:08Z"
  },
  {
    "title": "Billionaire GOP megadonor Ken Griffin is confused: Why is the US trying to bring back 'jobs that'll never pay much'?",
    "description": "Citadel founder Ken Griffin said he was asked on a recent trip to Asia why the US was trying to be like China.",
    "link": "https://www.businessinsider.com/gop-megadonor-ken-griffin-tariffs-and-big-beautiful-bill-2025-6",
    "timestamp": "2025-06-05T14:26:01Z"
  },
  {
    "title": "US trade deficit narrowed significantly amid Trump's tariff escalation",
    "description": "US trade deficit narrowed significantly amid Trump's tariff escalation\nThe fresh data arrives days after a major swath of tariffs entered legal limbo.\nThe U.S. trade deficit narrowed significantly in April as President Donald Trump sharply escalated tariffs b…",
    "link": "https://biztoc.com/x/93c2fd3853b57d11",
    "timestamp": "2025-06-05T14:25:38Z"
  },
  {
    "title": "Trump-Musk Alliance Unravels in Split Over ‘Big Beautiful Bill’",
    "description": "From the moment Donald Trump and Elon Musk joined forces, betting in Washington held that the president’s bond with the First Buddy who bankrolled his comeback election win wouldn’t last.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-musk-alliance-unravels-in-split-over-big-beautiful-bill",
    "timestamp": "2025-06-05T14:24:54Z"
  },
  {
    "title": "This Creepy Study Proves Exactly Why Black Folks Are Wary of AI",
    "description": "None of us are prepared to be Will Smith in “I, Robot.”\nThe post This Creepy Study Proves Exactly Why Black Folks Are Wary of AI appeared first on The Root.",
    "link": "https://www.theroot.com/this-creepy-study-proves-exactly-why-black-folks-are-wa-2000043932",
    "timestamp": "2025-06-05T14:23:17Z"
  },
  {
    "title": "Trump and Elon Musk’s Bromance Is Circling the Drain Over Budget Bill",
    "description": "Tensions are rising between Donald Trump and his biggest 2024 campaign financier, Elon Musk.\r\nThe dynamic duo—who were practically inseparable after November—are driving apart over their differing opinions on Trump’s “big, beautiful bill,” an extension to his…",
    "link": "https://newrepublic.com/post/196164/donald-trump-elon-musk-bromance-budget-bill",
    "timestamp": "2025-06-05T14:23:17Z"
  },
  {
    "title": "Debate and AOC Endorsement Have Cuomo Feeling the Heat",
    "description": "After Cuomo fended off blows from his many challengers in the first mayoral debate, Representative Alexandria Ocasio-Cortez endorsed Zohran Mamdani, who is second to him in the polls.",
    "link": "http://nymag.com/intelligencer/article/debate-and-aoc-endorsement-have-cuomo-feeling-the-heat.html",
    "timestamp": "2025-06-05T14:23:00Z"
  },
  {
    "title": "'Bidenworld' Civil War: Insiders Unleash on Karine Jean-Pierre After She Ditches Democratic Party",
    "description": "\"Many quietly had fumed for years, believing she was incompetent at her job at the White House podium and more interested in ...\"",
    "link": "https://www.westernjournal.com/bidenworld-civil-war-insiders-unleash-karine-jean-pierre-ditches-democratic-party/",
    "timestamp": "2025-06-05T14:22:32Z"
  },
  {
    "title": "George Clooney Tells CNN They’ve Been ‘Picked Out’ as Targets by Trump: ‘Usually Happens with Demagogues’",
    "description": "George Clooney told CNN they are being targeted by President Donald Trump, though the filmmaker insisted \"Trumpism\" is quickly coming to an end.\nThe post George Clooney Tells CNN They’ve Been ‘Picked Out’ as Targets by Trump: ‘Usually Happens with Demagogues’…",
    "link": "https://www.mediaite.com/media/tv/george-clooney-tells-cnn-theyve-been-picked-out-as-targets-by-trump-usually-happens-with-demagogues/",
    "timestamp": "2025-06-05T14:21:58Z"
  },
  {
    "title": "Trump's travel ban: After restricting entry of people from 19 nations, President says this country is next",
    "description": "US President Donald Trump's sweeping travel ban, affecting 19 nations, may soon include Egypt following a Colorado attack by an Egyptian national. Trump, citing security concerns, insists on stringent vetting processes for foreign nationals. The ban already r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-travel-ban-after-restricting-entry-of-people-from-19-nations-president-says-this-country-is-next-donald-trump-news-us-travel-news/articleshow/121651565.cms",
    "timestamp": "2025-06-05T14:21:32Z"
  },
  {
    "title": "Supreme Court rules against Mexico in its lawsuit against U.S. gunmakers",
    "description": "The Mexican government had argued that U.S. companies were responsible for cartel violence caused with American-made military-style weapons.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-mexico-lawsuit-gunmakers-cartels-rcna194734",
    "timestamp": "2025-06-05T14:16:53Z"
  },
  {
    "title": "World reacts to Trump’s travel ban, hits several nations mired in conflict",
    "description": "Nationals from 12 countries have been banned from entering the US in Trump's latest immigration crackdown.",
    "link": "https://www.aljazeera.com/news/2025/6/5/world-reacts-to-trumps-travel-ban-hits-several-nations-mired-in-conflict",
    "timestamp": "2025-06-05T14:16:26Z"
  },
  {
    "title": "Germany updates: Merz in Washington for talks with Trump",
    "description": "Ukraine and tariffs are expected to be on the agenda as Germany's chancellor visits the White House for a meeting with Donald Trump. DW has more. German Chancellor Friedrich Merz is holding talks with US President Donald Trump in Washington, expected to focus…",
    "link": "https://www.dw.com/en/germany-updates-merz-in-washington-for-talks-with-trump/live-72794062",
    "timestamp": "2025-06-05T14:15:00Z"
  },
  {
    "title": "Supreme Court revives straight woman's workplace discrimination claim",
    "description": "Marlean Ames argued she faced too high a legal burden in pressing her claim after being passed over and demoted in favor of a lesbian and a gay man.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-ames-reverse-discrimination-jackson-rcna193895",
    "timestamp": "2025-06-05T14:14:09Z"
  },
  {
    "title": "Trump is aiming to stop Harvard University’s foreign students from entering the U.S",
    "description": "In an executive order signed Wednesday, President Donald Trump declared that it would jeopardize national security to allow Harvard to continue hosting foreign students on its campus in Cambridge, Massachusetts.",
    "link": "https://biztoc.com/x/f2b5364bf5155769",
    "timestamp": "2025-06-05T14:13:51Z"
  },
  {
    "title": "Trump's Bedminster Golf Club Earns Lowest Health Grade In County, Slew Of Violations",
    "description": "Overall, the club was given a \"conditionally satisfactory\" C grade following a health inspection last month, according to Forbes.",
    "link": "https://patch.com/new-jersey/baskingridge/trumps-bedminster-golf-club-earns-lowest-health-grade-county-slew-violations",
    "timestamp": "2025-06-05T14:13:01Z"
  },
  {
    "title": "Trump speaks with Chinese leader Xi Jinping as trade standoff intensifies",
    "description": "President Donald Trump and Chinese President Xi Jinping held their first known phone call of Trump’s term on Thursday morning, Chinese state media said.Read more...",
    "link": "https://qz.com/trump-xi-jinping-call-trade-war-tariff-tensions-1851783683",
    "timestamp": "2025-06-05T14:13:00Z"
  },
  {
    "title": "Supreme Court shuts down Mexico’s lawsuit against American gunmakers | CNN Politics",
    "description": "The Supreme Court on Thursday tossed out a lawsuit from the Mexican government that alleged American gun manufacturers should be held responsible for cartel violence on the Southwest border, a decision that shields the companies from a suit that had claimed b…",
    "link": "https://www.cnn.com/2025/06/05/politics/supreme-court-smith-wesson-mexico",
    "timestamp": "2025-06-05T14:12:06Z"
  },
  {
    "title": "Fury and resignation around the world as Trump's travel ban comes roaring back",
    "description": "Countries across the world were in shock after President Donald Trump announced a travel ban on nationals from a dozen countries and the cancellation of visa programs for seven more.",
    "link": "https://www.nbcnews.com/politics/immigration/fury-resignation-world-trumps-travel-ban-comes-roaring-back-rcna211115",
    "timestamp": "2025-06-05T14:11:19Z"
  },
  {
    "title": "Supreme Court rejects Mexico’s lawsuit against U.S. gun makers",
    "description": "he Supreme Court threw out the Mexican government's lawsuit against U.S. firearms manufacturers accusing them of aiding and abetting gun violence.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-mexicos-lawsuit-us-gun-makers-rcna202335",
    "timestamp": "2025-06-05T14:10:54Z"
  },
  {
    "title": "Trump announces travel ban on citizens of 12 countries, set to go into effect Monday",
    "description": "The travel ban issued Wednesday is a repeat of an order of his first administration that led to widespread confusion at airports.",
    "link": "https://www.pbs.org/newshour/politics/trump-announces-travel-ban-on-citizens-of-12-countries-set-to-go-into-effect-monday",
    "timestamp": "2025-06-05T14:09:55Z"
  },
  {
    "title": "‘We Don’t Want Them’: Trump Cracks Down on Foreign Nationals Coming to America",
    "description": "Donald Trump has banned nationals from 12 countries from entering the United States, and foreign students from entering to study at Harvard.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-issues-travel-ban-cracks-down-harvard-1235356182/",
    "timestamp": "2025-06-05T14:08:51Z"
  },
  {
    "title": "Trump, Xi speak amid renewed tensions over US-China trade talks",
    "description": "Trump and Xi spoke to revive stalled US-China trade talks as tariffs roil markets. Trump calls Xi “tough,” while key disagreements on tech and trade policy persist.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-xi-speak-amid-renewed-tensions-over-us-china-trade-talks/article69661452.ece",
    "timestamp": "2025-06-05T14:08:25Z"
  },
  {
    "title": "Trump orders inquiry into Biden's actions, alleging 'cognitive decline'",
    "description": "The US president accuses his predecessor's aides of covering up his \"mental state\" - a claim Biden says is \"ridiculous\".",
    "link": "https://www.bbc.com/news/articles/cvg9z9veyr1o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-05T14:08:24Z"
  },
  {
    "title": "Annecy Revs Up For 2025 Edition; Kicking Off With Michel Gondry & Matt Groening Honors & Shorts Selection Featuring New ‘Stars Wars: Visions’ Title",
    "description": "The Annecy International Animation Film Festival kicks-off this weekend with a masterclass by French filmmaker Michel Gondry, who will also receive a career award alongside The Simpsons creator Matt Groening and UK animation director Joanna Quinn at the openi…",
    "link": "http://deadline.com/2025/06/annecy-2025-michel-gondry-matt-groening-wars-visions-1236424268/",
    "timestamp": "2025-06-05T14:08:19Z"
  },
  {
    "title": "'Incredibly scary': Trump admin takes a huge step that could endanger lives of pregnant women",
    "description": "The Trump administration has rescinded a Biden-era policy that protected emergency room abortions. Trump's move strips  away a critical legal shield for doctors and pregnant women who live in states that ban the procedure. This decision reverses the Biden adm…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-admin-revokes-emergency-abortion-policy-biden-era-incredibly-scary-trump-admin-takes-a-huge-step-that-could-endanger-lives-of-pregnant-women/articleshow/121651832.cms",
    "timestamp": "2025-06-05T14:06:51Z"
  },
  {
    "title": "Dave Chappelle Revisits His 2016 Trump ‘SNL’ Speech — And Whether It’s Aged Well",
    "description": "The comedian recently sat down for a rare interview in which he recalled giving the MAGA leader \"a chance\" during his 2016 postelection monologue.",
    "link": "https://www.huffpost.com/entry/dave-chappelle-revisits-2016-trump-snl-speech_n_68416a47e4b04981b63b27e7",
    "timestamp": "2025-06-05T14:06:28Z"
  },
  {
    "title": "New Jobless Claims Climb To Eight-Month High Amid Trump Tariff Fallout",
    "description": "Unemployment claims rose to their highest level in eight months, with more workers across the Northeast filing for benefits as President Donald Trump's tariffs fuel economic uncertainty. \nThe number …",
    "link": "https://dailyvoice.com/virginia/arlington/new-jobless-claims-climb-to-eight-month-high-amid-trump-tariff-fallout/",
    "timestamp": "2025-06-05T14:06:12Z"
  },
  {
    "title": "Supreme Court sides with straight woman in decision that makes it easier to file ‘reverse discrimination’ suits | CNN Politics",
    "description": "The Supreme Court on Thursday sided with a straight woman in Ohio who filed a “reverse discrimination” lawsuit against her employer when her gay boss declined to promote her. The ruling will make it easier to file such suits in some parts of the country.",
    "link": "https://www.cnn.com/2025/06/05/politics/supreme-court-reverse-discrimination-suits",
    "timestamp": "2025-06-05T14:06:09Z"
  },
  {
    "title": "Rand Paul Rips Lindsey Graham Over Gargantuan Budget Bill",
    "description": "Kentucky Senator Rand Paul threw shade at his South Carolinian colleague Lindsey Graham while excoriating Donald Trump’s “big beautiful bill” on Fox Business.\r\nIn an appearance Wednesday night, Paul argued that Graham had his own reasons for rubber-stamping R…",
    "link": "https://newrepublic.com/post/196163/rand-paul-lindsey-graham-donald-trump-budget-bill",
    "timestamp": "2025-06-05T14:04:56Z"
  },
  {
    "title": "Musk Privately Complaining That His Immense Donations to Trump Didn't Even Buy Him Control of NASA",
    "description": "Billionaire Elon Musk's breakup with president Donald Trump, a feud that's been many months in the making, has become incredibly messy. The pair have butted heads over Trump's tax bill, which is expected to add trillions of dollars to an already colossal moun…",
    "link": "https://futurism.com/musk-donations-trump-control-nasa",
    "timestamp": "2025-06-05T14:04:42Z"
  },
  {
    "title": "Joni Ernst Introduces First Major DOGE Bill That Could Save Taxpayers Eye-Popping Amount",
    "description": "Republican Sen. Joni Ernst of Iowa introduced legislation Thursday to mandate policies implemented by DOGE that could save over $150 billion a year.",
    "link": "https://dailycaller.com/2025/06/05/joni-ernst-introduces-first-major-doge-bill-that-could-save-taxpayers-eye-popping-amount/",
    "timestamp": "2025-06-05T14:03:22Z"
  },
  {
    "title": "Biden Denies Claims As Trump Launches Investigation",
    "description": "President Donald Trump has ordered an investigation into whether aides to former President Joe Biden unlawfully concealed his mental decline and misused an autopen to sign key policy documents. \nIn a White House memo released Wednesday, Trump directed his cou…",
    "link": "https://biztoc.com/x/66e3007befbaebd6",
    "timestamp": "2025-06-05T14:03:20Z"
  },
  {
    "title": "Trump is aiming to stop Harvard University’s foreign students from entering the U.S.",
    "description": "In an executive order signed Wednesday, President Donald Trump declared that it would jeopardize national security to allow Harvard to continue hosting foreign students on its campus in Cambridge, Massachusetts.",
    "link": "https://www.pbs.org/newshour/politics/trump-is-aiming-to-stop-harvard-universitys-foreign-students-from-entering-the-u-s",
    "timestamp": "2025-06-05T14:03:18Z"
  },
  {
    "title": "CBO: Big Beautiful Blowies For Billionaires Bill Bigly Blows Up Budget Beficit!",
    "description": "What? Er, deficit. Also, American Anti-Asinine Alliteration Act will alleviate our agita.",
    "link": "https://www.wonkette.com/p/cbo-big-beautiful-blowies-for-billionaires",
    "timestamp": "2025-06-05T14:01:44Z"
  },
  {
    "title": "India respects US but did not seek mediation on Pakistan: Tharoor",
    "description": "India rejects US mediation in Indo-Pak tensions, focuses on trade talks; US eager for trade deal to reduce deficit.",
    "link": "https://www.thehindubusinessline.com/economy/india-respects-us-but-did-not-seek-mediation-on-pakistan-tharoor/article69661325.ece",
    "timestamp": "2025-06-05T14:01:17Z"
  },
  {
    "title": "Andrew Cuomo's Chances of Winning New York Mayoral Race",
    "description": "Cuomo is in the lead, weeks before the primary election.",
    "link": "https://www.newsweek.com/andrew-cuomo-new-york-mayor-race-odds-2081321",
    "timestamp": "2025-06-05T14:01:02Z"
  },
  {
    "title": "Virginia Municipalities Dispute Their ‘Sanctuary’ Designation",
    "description": "You may not know the word “truthiness” but you have, without question, experienced it. It first appeared on the opening graphics of the “Colbert Report”... Read More\nThe post Virginia Municipalities Dispute Their ‘Sanctuary’ Designation appeared first on The …",
    "link": "https://www.dailysignal.com/2025/06/05/virginia-municipalities-dispute-sanctuary-designation/",
    "timestamp": "2025-06-05T14:00:58Z"
  },
  {
    "title": "Joe Biden Breaks His Silence After President Trump Orders Investigation into Who Ran the White House While Old Joe Was in Office",
    "description": "Joe Biden has officially responded to President Trump launching an investigation into who ran the White House while Old Joe was in office.\nThe post Joe Biden Breaks His Silence After President Trump Orders Investigation into Who Ran the White House While Old …",
    "link": "https://www.thegatewaypundit.com/2025/06/joe-biden-breaks-his-silence-after-president-trump/",
    "timestamp": "2025-06-05T14:00:43Z"
  },
  {
    "title": "Central Europe's right-wing populist networks up their game",
    "description": "Bolstered by Donald Trump's reelection and their recent successes at the polls, Europe's right-wing populists are working together to push their narratives across Europe and build an international alliance.",
    "link": "https://www.dw.com/en/central-europes-right-wing-populist-networks-up-their-game/a-72802046",
    "timestamp": "2025-06-05T14:00:00Z"
  },
  {
    "title": "Jan Resseger: Trump Guts Civil Rights Laws",
    "description": "Jan Resseger reviews Trump’s vigorous crusade to eliminate civil rights laws by inverting their meaning. These laws were passed to break the monopoly held by white men in hiring and promotions. But now, any program that favors women and nonwhites is treated a…",
    "link": "https://dianeravitch.net/2025/06/05/jan-resseger-trump-guts-civil-rights-laws/",
    "timestamp": "2025-06-05T14:00:00Z"
  },
  {
    "title": "Trump decried crime in America, then gutted funding for gun violence prevention",
    "description": "The U.S. Department of Justice canceled $500 million in grants to public safety organizations nationwide, including some that address gun violence.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_fa9caaab-7c06-4ed7-9fc4-2e8033ab8938.html",
    "timestamp": "2025-06-05T14:00:00Z"
  },
  {
    "title": "Wall Street is on hold as the countdown ticks toward Friday’s jobs report",
    "description": "Wall Street remains listless, as the countdown ticks toward Friday’s highly anticipated jobs report.",
    "link": "https://www.bostonherald.com/2025/06/05/stock-market-today-waiting-game/",
    "timestamp": "2025-06-05T13:58:21Z"
  },
  {
    "title": "The Gattaca Future Is Here",
    "description": "Advances in the world of embryonic screening: The company Nucleus Genomics announced the launch of Nucleus Embryo yesterday, which they bill as \"the first",
    "link": "https://reason.com/2025/06/05/the-gattaca-future-is-here/",
    "timestamp": "2025-06-05T13:58:03Z"
  },
  {
    "title": "Why Did Yulissa Leave ‘Love Island USA’? Everything We Know About The MAGA-Friendly Contestant’s Controversial Exit",
    "description": "Escobar was mysteriously removed from the villa just minutes into Season 6, Episode 2.",
    "link": "https://decider.com/2025/06/05/yulissa-leave-love-island-usa-maga-friendly-contestants-controversial-exit/",
    "timestamp": "2025-06-05T13:57:49Z"
  },
  {
    "title": "Why JPMorgan Chase’s Jamie Dimon Could be the Right Candidate for President",
    "description": "Why JPMorgan Chase’s Jamie Dimon Could be the Right Candidate for Presidentbtm25@yale.edu\nThu, 06/05/2025 - 09:56\n Faculty Viewpoints\n <li>\n Jeffrey A. Sonnenfeld\n\n\n Senior Associate Dean for Leadership Studies & Lester Crown Professor in the Practice of Mana…",
    "link": "https://insights.som.yale.edu/insights/why-jpmorgan-chases-jamie-dimon-could-be-the-right-candidate-for-president",
    "timestamp": "2025-06-05T13:56:57Z"
  },
  {
    "title": "Russia vows retaliation against Ukraine at ‘appropriate time’",
    "description": "Russia has accused Ukraine of state terrorism following drone and rail attacks, vowing retaliation. Putin informed Trump of Russia’s intent, but no sanctions or summit talks were held",
    "link": "https://www.thehindubusinessline.com/news/world/russia-vows-retaliation-against-ukraine-at-appropriate-time/article69661349.ece",
    "timestamp": "2025-06-05T13:53:44Z"
  },
  {
    "title": "How Donald Trump made $1 billion in nine months through crypto",
    "description": "Donald Trump made about $1 billion in nine months from crypto projects. These include NFTs, memecoins, and a stablecoin. His net worth increased to $5.6 billion. The ventures helped him with legal costs. World Liberty Financial launched USD1, a stablecoin. Th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-donald-trump-made-1-billion-in-nine-months-through-crypto/articleshow/121651408.cms",
    "timestamp": "2025-06-05T13:53:07Z"
  },
  {
    "title": "As Trump targets Biden with new investigation, a Republican endgame comes into focus",
    "description": "The overarching question is why Donald Trump and Republicans are so desperate to investigate Joe Biden. They've already hinted at the answer.",
    "link": "https://biztoc.com/x/b84ea716d3381788",
    "timestamp": "2025-06-05T13:52:10Z"
  },
  {
    "title": "How Trump’s immigration crackdown is killing the American dream for these three students",
    "description": "To attract the brightest minds to America, President Donald Trump proposed a novel idea while campaigning: If elected, he would grant green cards to all foreign students who graduate from U.S. colleges.“It’s so sad when we lose people from Harvard, MIT, from …",
    "link": "https://biztoc.com/x/61a6cba0eaf716dd",
    "timestamp": "2025-06-05T13:52:02Z"
  },
  {
    "title": "Geostrategist Questions Trump's Move To Exclude Pakistan From Travel Ban, Links It To 'Rich Dividends' From Trump Family's Crypto Deal With The Nation",
    "description": "Brahma Chellaney, a prominent Indian author and geostrategic expert, noted that the cryptocurrency deal between Pakistan and a firm linked to President Donald Trump is yielding substantial gains, raising questions about the President's decision to exclude Pak…",
    "link": "https://biztoc.com/x/99f26bc820520c04",
    "timestamp": "2025-06-05T13:51:53Z"
  },
  {
    "title": "Americans filing for jobless benefits last week rises to highest level in months",
    "description": "Filings for U.S. unemployment benefits rose to their highest level in eight months last week but remain historically low despite growing uncertainty about how tariffs could impact the broader economy",
    "link": "https://abcnews.go.com/Business/wireStory/number-americans-filing-jobless-benefits-week-rises-highest-122529894",
    "timestamp": "2025-06-05T13:50:53Z"
  },
  {
    "title": "President Donald Trump Issues Travel Ban Against Disney Guests From 12 Different Countries",
    "description": "President Donald Trump has issued an official travel ban for 12 different countries around the globe, prohibiting millions from entering Disney World and Disneyland. President Donald Trump Prohibits Millions From Entering Disney World, Disneyland Parks For fa…",
    "link": "https://insidethemagic.net/2025/06/donald-trump-disney-parks-travel-ban-emd1/",
    "timestamp": "2025-06-05T13:48:21Z"
  },
  {
    "title": "Rob Manfred Admits Donald Trump's Role In MLB Decision on Pete Rose Reinstatement",
    "description": "The Major League Baseball commissioner surprised the baseball world with his Pete Rose decision after pressure from the president.",
    "link": "https://www.newsweek.com/sports/mlb/rob-manfred-admits-donald-trumps-role-mlb-decision-pete-rose-reinstatement-2081393",
    "timestamp": "2025-06-05T13:48:17Z"
  },
  {
    "title": "Can the U.S debt ceiling be scrapped as suggested by Donald Trump? Here's what the law says",
    "description": "Donald Trump and Elizabeth Warren find common ground. Both want to scrap the US debt ceiling. Trump expressed his agreement with Warren on Truth Social. He urges Republicans and Democrats to act together. The current debt ceiling suspension is ending. Treasur…",
    "link": "https://economictimes.indiatimes.com/news/international/us/can-the-u-s-debt-ceiling-be-scrapped-as-suggested-by-donald-trump-heres-what-the-law-says/articleshow/121650367.cms",
    "timestamp": "2025-06-05T13:48:14Z"
  },
  {
    "title": "‘Ridiculous And False’: Biden Responds To Trump Admin’s Autopen Investigation",
    "description": "Former President Joe Biden has come out swinging in defense of his use of the autopen, insisting he maintained full control of the WH throughout his term.",
    "link": "https://dailycaller.com/2025/06/05/autopen-joe-biden-aides-power-investigation-mental-decline-donald-trump/",
    "timestamp": "2025-06-05T13:47:10Z"
  },
  {
    "title": "Trump, Xi Spoke by Phone as Trade and Tech Disputes Strain Ties (Catherine Lucey/Bloomberg)",
    "description": "Catherine Lucey / Bloomberg:\nTrump, Xi Spoke by Phone as Trade and Tech Disputes Strain Ties  —  US President Donald Trump and Chinese President Xi Jinping spoke Thursday, according to China's Foreign Ministry, as trade tensions roil relations between the wor…",
    "link": "https://www.memeorandum.com/250605/p40",
    "timestamp": "2025-06-05T13:45:01Z"
  }
]