[
  {
    "title": "$5.3 billion Air Force One program: why is Trump repainting Air Force One now, and what will it cost taxpayers? — Timeline and overheating risks Explained",
    "description": "Trump Air Force One repaint: The $5.3 billion Air Force One replacement program is moving forward in 2026. President Donald Trump is updating the Air Force One paint scheme to a darker navy and red design. The U.S. Air Force says repainting is part of schedul…",
    "link": "https://economictimes.indiatimes.com/news/international/us/5-3-billion-air-force-one-program-why-is-trump-repainting-air-force-one-now-and-what-will-it-cost-taxpayers-in-2026-timeline-and-overheating-risks-explained/articleshow/128525446.cms",
    "timestamp": "2026-02-18T20:41:32Z"
  },
  {
    "title": "Vatican declines invitation to join Trump’s Board of Peace",
    "description": "Vatican declines invitation to join Trump’s Board of PeaceVatican Secretary of State Pietro Parolin said global crisis management ‘primarily’ belongs to the UN, which the cardinal said poses a ‘critical issue’ for Trump’s Board of Peace.The Holy See has decli…",
    "link": "https://freerepublic.com/focus/f-religion/4367359/posts",
    "timestamp": "2026-02-18T20:37:46Z"
  },
  {
    "title": "Markey to join Democrats boycotting Trump’s State of the Union address",
    "description": "U.S. Senator Ed Markey (D-MA) says he will be boycotting President Trump’s State of the Union address next week and will instead join “The People’s State of the Union,” with several fellow Democrats in a separate event.",
    "link": "https://www.bostonherald.com/2026/02/18/markey-to-join-democrats-boycotting-trumps-state-of-the-union-address/",
    "timestamp": "2026-02-18T20:36:54Z"
  },
  {
    "title": "Watch Live: Donald Trump Holds Black History Month Reception",
    "description": "President Donald Trump holds a reception to celebrate Black History Month at the White House on Wednesday, February 18.\nThe post Watch Live: Donald Trump Holds Black History Month Reception appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/02/18/watch-live-donald-trump-holds-black-history-month-reception/",
    "timestamp": "2026-02-18T20:36:32Z"
  },
  {
    "title": "The Carney Doctrine Can Be More Than a Davos Speech",
    "description": "Middle powers need real institutions to resist superpower gravity.",
    "link": "http://foreignpolicy.com/2026/02/18/canada-davos-carney-middle-powers/",
    "timestamp": "2026-02-18T20:34:21Z"
  },
  {
    "title": "Amid Obama Video Controversy, 1 in 2 Voters View Trump as Racist",
    "description": "Trump refuses to take responsibility for a racist video posted to his Truth Social account targeting the Obamas.",
    "link": "https://truthout.org/articles/amid-obama-video-controversy-1-in-2-voters-view-trump-as-racist/",
    "timestamp": "2026-02-18T20:33:01Z"
  },
  {
    "title": "Fashion Notes: Melania Trump's Herve Pierre Inaugural Gown Gets Showcase at Smithsonian",
    "description": "First Lady Melania Trump's inaugural gown, designed by longtime fashion confidant and stylist Hervé Pierre, for her husband's second inauguration, is set to be showcased at the First Ladies Gallery at the Smithsonian National Museum of American History. \nThe …",
    "link": "https://www.breitbart.com/entertainment/2026/02/18/fashion-notes-melania-trumps-herve-pierre-inaugural-gown-gets-showcase-at-smithsonian/",
    "timestamp": "2026-02-18T20:30:15Z"
  },
  {
    "title": "Ex-Victoria’s Secret CEO Les Wexner testifies that Jeffrey Epstein was an ‘Olympic con artist’",
    "description": "Federal prosecutors initially listed Wexner as a potential co-conspirator following Epstein's arrest in July 2019.",
    "link": "https://nypost.com/2026/02/18/us-news/ex-victorias-secret-ceo-les-wexner-says-jeffrey-epstein-was-an-olympic-con-artist/",
    "timestamp": "2026-02-18T20:29:51Z"
  },
  {
    "title": "How the FCC’s ‘equal time’ rule works",
    "description": "The law is at the heart of the Colbert-CBS conflict",
    "link": "https://theweek.com/politics/fcc-equal-time-rule-works-colbert-cbs",
    "timestamp": "2026-02-18T20:27:39Z"
  },
  {
    "title": "Leavitt: Trump concerned with Potomac River sewage stench, with America 250 celebrations planned for summer",
    "description": "A sewage pipe collapse just outside of Washington, D.C. that spilled 200 million gallons of wastewater into the Potomac River has caught Trump's attention.",
    "link": "https://www.cnbc.com/2026/02/18/trump-potomac-river-sewage-stench-america-250.html",
    "timestamp": "2026-02-18T20:27:13Z"
  },
  {
    "title": "State lawmakers offer partisan responses to Pritzker’s budget address",
    "description": "(The Center Square) – Illinois lawmakers are offering mixed reviews of Gov. J.",
    "link": "https://www.thecentersquare.com/illinois/article_0ef49c8d-534a-4b2a-834f-a222cb13a7d5.html",
    "timestamp": "2026-02-18T20:27:00Z"
  },
  {
    "title": "Leavitt scoffs at reporter who questioned when Trump has been 'falsely called racist': 'You're kidding?'",
    "description": "White House press secretary Karoline Leavitt vows to provide \"receipts\" after a reporter questions whether President Donald Trump was \"falsely called racist.\"",
    "link": "https://www.foxnews.com/politics/leavitt-scoffs-reporter-questioned-when-trump-been-falsely-called-racist-youre-kidding",
    "timestamp": "2026-02-18T20:26:09Z"
  },
  {
    "title": "Exclusive: Republican Challenging New York AG Letitia James Blasts Her for 'Playing Politics with the Law'",
    "description": "The Republican candidate running against New York Attorney General Letitia James for her role as the state's chief law enforcer accused the Democrat incumbent of abusing the powers of her office and \"playing politics with the law\" in an exclusive interview wi…",
    "link": "https://www.breitbart.com/politics/2026/02/18/exclusive-republican-challenging-new-york-ag-letitia-james-blasts-her-for-playing-politics-with-the-law/",
    "timestamp": "2026-02-18T20:25:53Z"
  },
  {
    "title": "The View hosts agree AOC had major gaffes in European summit, 'just didn't have a recovery'",
    "description": "While there was some debate, most of the co-hosts of \"The View\" agreed that Rep. Ocasio-Cortez had multiple major gaffes on the world stage at the summit in Munich.",
    "link": "https://www.foxnews.com/media/view-hosts-agree-aoc-had-major-gaffes-european-summit-just-didnt-have-recovery",
    "timestamp": "2026-02-18T20:25:51Z"
  },
  {
    "title": "EU elites driven by Nazi nostalgia – Lavrov",
    "description": "EU policies are partially driven by revanchism after the Nazi defeat in World War II, Russian Foreign Minister Sergey Lavrov has argued Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632707-lavrov-nato-eu-swappable/",
    "timestamp": "2026-02-18T20:21:55Z"
  },
  {
    "title": "Lara Trump Says ‘Many’ More Members of the Trump Family May Run for Office: ‘It May Not End Just with Donald Trump!’ (WATCH)",
    "description": "In a recent appearance on Miranda Devine’s Pod Force One podcast, Fox News host Lara Trump said the family’s political ambitions might extend far beyond President Donald Trump himself.\nThe post Lara Trump Says ‘Many’ More Members of the Trump Family May Run f…",
    "link": "https://www.thegatewaypundit.com/2026/02/lara-trump-says-many-more-members-trump-family/",
    "timestamp": "2026-02-18T20:20:51Z"
  },
  {
    "title": "German Interviewer Asks Hillary Clinton If She’s ‘Thinking About Running’ In 2028",
    "description": "Former Secretary of State Hillary Clinton said she was not considering launching a 2028 presidential bid.",
    "link": "https://dailycaller.com/2026/02/18/hillary-clinton-sadly-says-shes-not-considering-2028-run/",
    "timestamp": "2026-02-18T20:19:45Z"
  },
  {
    "title": "President Trump Delivers Biggest Regulatory Relief in History",
    "description": "This week, President Donald J. Trump announced the single largest deregulatory action in American history: the full revocation of the disastrous Obama-era “Endangerment Finding” and the consumer mandates that depended on it. This decisive action dismantles th…",
    "link": "https://freerepublic.com/focus/f-news/4367357/posts",
    "timestamp": "2026-02-18T20:17:35Z"
  },
  {
    "title": "FCC Confirms “Enforcement Action” Against Talk Shows",
    "description": "Carr also commented on CBS's decision to pull an interview off The Late Show with Stephen Colbert.\nFCC Confirms “Enforcement Action” Against Talk Shows\nWren Graves",
    "link": "https://consequence.net/2026/02/fcc-enforcement-action-the-view-late-night/",
    "timestamp": "2026-02-18T20:16:20Z"
  },
  {
    "title": "EXCLUSIVE: Steve Hilton speaks on his GOP rival, possible Trump endorsement in CA governor race",
    "description": "Steve Hilton says Chad Bianco should to drop out of the California governor’s race after new poll shows Hilton leading.",
    "link": "https://nypost.com/2026/02/18/us-news/steve-hilton-reacts-as-poll-shows-him-leading-ca-governors-race/",
    "timestamp": "2026-02-18T20:15:30Z"
  },
  {
    "title": "Democrats plot boycott of Trump’s State of the Union address with lefty rally",
    "description": "Democrats are plotting to boycott President Trump's State of the Union address next week and host an alternative rally instead after being widely panned for their rowdy behavior during his marquee speech last year.",
    "link": "https://nypost.com/2026/02/18/us-news/democrats-plot-boycott-of-trumps-state-of-the-union-address-with-alternative-rally/",
    "timestamp": "2026-02-18T20:15:01Z"
  },
  {
    "title": "Trust that U.S. elections are fair drops 17% in two years, UCSD study finds",
    "description": "When asked whether recent redistricting efforts such as those in California and Texas amount to attempts to \"rig\" the 2026 midterms, survey respondents most often blamed the opposing party. However, nearly 25% of members of each party also assigned responsibi…",
    "link": "https://www.kpbs.org/news/politics/2026/02/18/trust-that-u-s-elections-are-fair-drops-17-in-two-years-ucsd-study-finds",
    "timestamp": "2026-02-18T20:09:34Z"
  },
  {
    "title": "Trump’s Sons Say Their Open Corruption Is Our Fault",
    "description": "President Donald Trump’s sons are so far past trying to dispel accusations of corruption that they’re actually blaming everyone else for making them so crooked.Speaking to CNBC Wednesday from a gilded ballroom at their father’s Mar-a-Lago resort, Don Jr. and …",
    "link": "https://newrepublic.com/post/206737/donald-trump-sons-corruption-cryptocurrency",
    "timestamp": "2026-02-18T20:08:23Z"
  },
  {
    "title": "Federal Communications Commission chair backs Nexstar, Tegna merger",
    "description": "WASHINGTON, Feb 18 : The chair of the Federal Communications Commission said Wednesday he supports Nexstar's proposed $3.54 billion acquisition of Tegna that would make the combined entity the largest U.S. regional TV station operator.\"I support that transact…",
    "link": "https://www.channelnewsasia.com/business/federal-communications-commission-chair-backs-nexstar-tegna-merger-5938821",
    "timestamp": "2026-02-18T20:07:29Z"
  },
  {
    "title": "Judging the Alito Retirement Rumors",
    "description": "Rumors suggest that U.S. Supreme Court Justice Samuel Alito plans to retire when the Court's current term wraps up this summer.",
    "link": "https://reason.com/2026/02/19/judging-the-alito-retirement-rumors/",
    "timestamp": "2026-02-18T20:05:53Z"
  },
  {
    "title": "Trump Official Says US Did Not Censor Colbert Interview but Is Probing ABC’s ‘The View’",
    "description": "WASHINGTON, Feb 18 (Reuters) – The chair of the U.S. Federal Communications Commission on Wednesday denied the government had censored CBS Late Show host Stephen... Read More\nThe post Trump Official Says US Did Not Censor Colbert Interview but Is Probing ABC’…",
    "link": "https://www.dailysignal.com/2026/02/18/trump-official-says-us-did-not-censor-colbert-interview-but-is-probing-abcs-the-view/",
    "timestamp": "2026-02-18T20:05:00Z"
  },
  {
    "title": "White House tells Iran to do deal as Trump hints at US strikes",
    "description": "The White House warned on Wednesday that Iran would be “wise” to do a deal with the United States as President Donald Trump once again hinted at military action. The two sides recently resumed indirect talks, mediated by Oman, after Trump repeatedly threatene…",
    "link": "https://www.digitaljournal.com/world/white-house-tells-iran-to-do-deal-as-trump-hints-at-us-strikes/article",
    "timestamp": "2026-02-18T20:02:20Z"
  },
  {
    "title": "Illinois Gov. Pritzker Wants to Charge Social Media Accounts for Existing",
    "description": "Slash the budget. I mean, why did Illinois spend $4.4 million to podcasting and production studios?\nThe post Illinois Gov. Pritzker Wants to Charge Social Media Accounts for Existing first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/illinois-gov-pritzker-wants-to-charge-social-media-accounts-for-existing/",
    "timestamp": "2026-02-18T20:00:31Z"
  },
  {
    "title": "Lessons from Past Israeli-Palestinian Talks for Trump’s Negotiators",
    "description": "There is a long history of Israeli-Palestinian negotiations, often involving the United States as the primary negotiator. However, as the Oct. 7 attacks and war in Gaza demonstrated, neither Israelis nor Palestinians feel safe. As Israel’s recent moves to exp…",
    "link": "https://warontherocks.com/2026/02/lessons-from-past-israeli-palestinian-talks-for-trumps-negotiators/",
    "timestamp": "2026-02-18T20:00:13Z"
  },
  {
    "title": "Wright Downplays Interest in Greenland's Rare Earths",
    "description": "The Trump administration's primary interest in Greenland is on national security, not the development of its rare earths or energy resources, according to U.S. Energy Secretary Chris Wright.",
    "link": "https://www.rigzone.com/news/wire/wright_downplays_interest_in_greenlands_rare_earths-18-feb-2026-183015-article/",
    "timestamp": "2026-02-18T20:00:01Z"
  },
  {
    "title": "‘DO NOT GIVE AWAY DIEGO’: Trump Urges UK to Resist ‘Wokeism’ and Controversial Island Lease",
    "description": "President Trump urged Keir Starmer to abort a lease deal for the island of Diego Garcia, saying it is needed to \"eradicate a potential attack\" from Iran.\nThe post ‘DO NOT GIVE AWAY DIEGO’: Trump Urges UK to Resist ‘Wokeism’ and Controversial Island Lease firs…",
    "link": "https://www.mediaite.com/politics/do-not-give-away-diego-trump-urges-uk-to-resist-wokeism-and-controversial-island-lease/",
    "timestamp": "2026-02-18T19:58:48Z"
  },
  {
    "title": "WATCH: Democratic counterproposal on DHS funding 'very unserious,' Leavitt says",
    "description": "White House press secretary Karoline Leavitt said White House officials, but not President Donald Trump, have been in contact with Democratic leaders over the impasse, blaming Democrats for forcing some federal employees to work without paychecks.",
    "link": "https://www.pbs.org/newshour/politics/watch-democratic-counterproposal-on-dhs-funding-very-unserious-leavitt-says",
    "timestamp": "2026-02-18T19:58:36Z"
  },
  {
    "title": "Goldman Sachs CEO David Solomon reveals he owns Bitcoin (BTC USD) after years of calling it 'speculative' - what changed under Donald Trump?",
    "description": "Goldman Sachs CEO owns Bitcoin BTC USD: Goldman Sachs CEO David Solomon revealed he holds a \"very, very limited\" amount of Bitcoin, marking a cautious personal step into digital assets. While still an observer, Solomon noted that evolving regulations are maki…",
    "link": "https://economictimes.indiatimes.com/news/international/us/goldman-sachs-ceo-david-solomon-reveals-he-owns-bitcoin-btc-usd-after-years-of-calling-it-speculative-what-changed-under-donald-trump/articleshow/128524404.cms",
    "timestamp": "2026-02-18T19:58:32Z"
  },
  {
    "title": "US Justice Department issues new ‘Russiagate’ subpoenas – AP",
    "description": "The Justice Department has requested more documents relating to bogus claims of Russian interference in the 2016 election Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632749-trump-doj-russiagate-subpoenas/",
    "timestamp": "2026-02-18T19:58:32Z"
  },
  {
    "title": "Trump mocked over relationship with top loyalist: 'Late night calls are for side pieces'",
    "description": "Former Rep. Marjorie Taylor Greene (R-GA) suggested Tuesday that Laura Loomer was President Donald Trump's \"side piece\" because she had not been named an official adviser or been given a permanent White House press pass.Earlier this week, Greene lashed out af…",
    "link": "https://www.rawstory.com/laura-loomer-trump-2675281659/",
    "timestamp": "2026-02-18T19:57:02Z"
  },
  {
    "title": "Zelensky used raid to threaten me – Ukraine’s ex-army chief",
    "description": "Ex-Ukrainian commander Valery Zaluzhny has accused Vladimir Zelensky of trying to intimidate him using a security service raid in 2022 Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632745-ex-ukrainian-commander-zaluzhny-zelensky-raid-intimidation/",
    "timestamp": "2026-02-18T19:55:03Z"
  },
  {
    "title": "The End of Reagan-Era Republicanism",
    "description": "Mona Charen on how Trump transformed the conservative movement and what the right got wrong. Plus: Signs of life from America’s guardrails and John Maynard Keynes’s “My Early Beliefs.”",
    "link": "https://www.theatlantic.com/podcasts/2026/02/david-frum-show-mona-charen-conservatism/686036/",
    "timestamp": "2026-02-18T19:54:42Z"
  },
  {
    "title": "Karoline Leavitt Flabbergasted When Reporter Asks Her For Examples Of Trump Being Called Racist",
    "description": "Press secretary Karoline Leavitt appeared to be in disbelief when a reporter asked for examples of when President Donald Trump has been accused of racism.",
    "link": "https://dailycaller.com/2026/02/18/karoline-leavitt-ed-o-keefe-trump-racism/",
    "timestamp": "2026-02-18T19:53:59Z"
  },
  {
    "title": "Trump worries Potomac ‘will still stink’ during America250 celebration after massive sewage spill",
    "description": "President Donald Trump blames Maryland Governor Wes Moore for Potomac River sewage disaster, claims incompetence led to the millions of gallons to spill into river.",
    "link": "https://www.foxnews.com/politics/trump-worries-potomac-will-still-stink-during-america250-celebration-after-massive-sewage-spill",
    "timestamp": "2026-02-18T19:53:12Z"
  },
  {
    "title": "Democrats' positivity about the party still in the dumps since Trump victory, poll finds",
    "description": "A recent poll by The Associated Press-NORC indicated that only around 7 out of 10 Democrats hold a favorable view of their political party.",
    "link": "https://www.foxnews.com/politics/democrats-positivity-about-party-still-dumps-since-trump-victory-poll-finds",
    "timestamp": "2026-02-18T19:50:00Z"
  },
  {
    "title": "Fed Minutes Show Several Officials Nod to Rate-Hike Scenario",
    "description": "Federal Reserve officials signaled renewed worries over inflation with “several” policymakers suggesting the central bank may need to raise interest rates if inflation stays above their goal.",
    "link": "https://financialpost.com/pmn/business-pmn/fed-minutes-show-several-officials-nod-to-rate-hike-scenario",
    "timestamp": "2026-02-18T19:48:24Z"
  },
  {
    "title": "Trump's top economic advisor says Fed researchers should be punished for their recent views on tariffs",
    "description": "Kevin Hassett said Fed researchers should be disciplined for their views on tariffs, sparking fresh concern from commentators about Fed independence.",
    "link": "https://www.businessinsider.com/tariffs-impact-on-conumers-fed-research-kevin-hassett-discipline-trump-2026-2",
    "timestamp": "2026-02-18T19:48:02Z"
  },
  {
    "title": "U2 Attacks MAGA as 'People of the Lie' in Renee Good Protest Song 'American Obituary'",
    "description": "Irish rockers U2 have released a short album on Ash Wednesday with a track celebrating radical anti-ICE activist Renee Good and ripping Trump supporters.\nThe post U2 Attacks MAGA as ‘People of the Lie’ in Renee Good Protest Song ‘American Obituary’ appeared f…",
    "link": "https://www.breitbart.com/entertainment/2026/02/18/u2-attacks-maga-as-people-of-the-lie-in-renee-good-protest-song-american-obituary/",
    "timestamp": "2026-02-18T19:47:59Z"
  },
  {
    "title": "Everything you need to know about Donald Trump’s Board of Peace",
    "description": "What’s on the agenda of the inaugural meeting?",
    "link": "https://www.bbc.co.uk/sounds/play/p0n1wyl9",
    "timestamp": "2026-02-18T19:46:00Z"
  },
  {
    "title": "Donald Trump Jr. and Kimberly Guilfoyle are quietly shopping the Florida home they shared for $30M",
    "description": "The asking price of the \"whisper\" listing in Jupiter is around $30 million, sources said.",
    "link": "https://nypost.com/2026/02/18/real-estate/donald-trump-jr-looks-to-sell-his-florida-home-for-30m/",
    "timestamp": "2026-02-18T19:45:07Z"
  },
  {
    "title": "Justice Department fights back after federal judge blocks Trump’s wind energy freeze",
    "description": "Trump administration appeals federal judge's ruling that blocked his offshore wind pause order, setting up legal battle over renewable energy policy.",
    "link": "https://www.foxnews.com/politics/justice-department-fights-back-after-federal-judge-blocks-trumps-wind-energy-freeze",
    "timestamp": "2026-02-18T19:43:17Z"
  },
  {
    "title": "Fox’s Peter Doocy Straight-Up Asks if Trump Is Concerned the Potomac River Is Going to ‘Smell Like Poop’",
    "description": "Fox News's Peter Doocy asked White House Press Secretary Karoline Leavitt if President Donald Trump is concerned about the Potomac River smelling like poop.\nThe post Fox’s Peter Doocy Straight-Up Asks if Trump Is Concerned the Potomac River Is Going to ‘Smell…",
    "link": "https://www.mediaite.com/media/news/foxs-peter-doocy-straight-up-asks-if-trump-is-concerned-the-potomac-river-is-going-to-smell-like-poop/",
    "timestamp": "2026-02-18T19:36:28Z"
  },
  {
    "title": "Trump Tribute To Jesse Jackson Insulted Obama",
    "description": "\"He's lying as usual and making someone's death about him! Disgraceful!\"",
    "link": "https://cafemom.com/entertainment/trump-tribute-jesse-jackson-insult-obama",
    "timestamp": "2026-02-18T19:35:19Z"
  },
  {
    "title": "Minneapolis Mayor's Emotional Message to Trump: You Failed to Break Us (New Republic)",
    "description": "New Republic:\nMinneapolis Mayor's Emotional Message to Trump: You Failed to Break Us … In today's episode, we talk to Minneapolis Mayor Jacob Frey about the latest developments in his city.  Donald Trump and border czar Tom Homan have said they're winding dow…",
    "link": "https://www.memeorandum.com/260218/p75",
    "timestamp": "2026-02-18T19:35:01Z"
  },
  {
    "title": "Obama and Susan Rice Reportedly 'Broke Down and Cried' After Trump's 2016 Win",
    "description": "Trump's 2016 win over Hillary Clinton stunned Washington and sparked an effort to undermine him before he entered office.",
    "link": "https://www.westernjournal.com/obama-susan-rice-reportedly-broke-cried-trumps-2016-win/",
    "timestamp": "2026-02-18T19:34:08Z"
  },
  {
    "title": "Pritzker demands Trump, feds return funds withheld from Illinois",
    "description": "Illinois Gov. J.B. Pritzker blasted President Donald Trump’s administration for what he called “illegally confiscating” billions in federal funding…",
    "link": "https://www.nbcchicago.com/news/local/chicago-politics/pritzker-says-trump-illegally-confiscating-money-from-illinois-residents/3895951/",
    "timestamp": "2026-02-18T19:34:00Z"
  },
  {
    "title": "Takaichi and Trump Are Natural Fossil Fuel Buddies",
    "description": "The first fruits of a promised $550 billion investment agreement between the US and Japan are already tainted with pollution.",
    "link": "https://www.livemint.com/companies/takaichi-and-trump-are-natural-fossil-fuel-buddies-11771443023834.html",
    "timestamp": "2026-02-18T19:30:23Z"
  },
  {
    "title": "‘You’re Kidding, Right?’ Karoline Leavitt Gobsmacked After Reporter Asks for Examples of Trump Being ‘Falsely Called Racist’",
    "description": "White House Press Secretary Karoline Leavitt was stunned when CBS reporter Ed O'Keefe asked for examples of President Trump being \"falsely called racist\"\nThe post ‘You’re Kidding, Right?’ Karoline Leavitt Gobsmacked After Reporter Asks for Examples of Trump B…",
    "link": "https://www.mediaite.com/media/youre-kidding-right-karoline-leavitt-gobsmacked-after-reporter-asks-for-examples-of-trump-being-falsely-called-racist/",
    "timestamp": "2026-02-18T19:30:06Z"
  },
  {
    "title": "Fed minutes: Lower inflation needed before many officials will support rate cuts",
    "description": "The 'vast majority' said there were signs the job market has stabilized, the minutes said.",
    "link": "https://www.bostonherald.com/2026/02/18/fed-minutes-january-meeting/",
    "timestamp": "2026-02-18T19:29:08Z"
  },
  {
    "title": "White House: Some progress made in talks, but 'many arguments for Iran strike'",
    "description": "U.S. President Donald Trump has been 'very clear with respect to Iran, or any country, that diplomacy is always his first option,' Press Secretary Karoline Leavitt said, adding that 'Iran would be very wise to make a deal with this administration'",
    "link": "https://www.haaretz.com/israel-news/2026-02-18/ty-article/.premium/white-house-some-progress-made-in-talks-but-many-arguments-for-iran-strike/0000019c-7230-d759-a7bf-feba1f8d0000",
    "timestamp": "2026-02-18T19:27:08Z"
  },
  {
    "title": "Florida House Passes Bill to Rename Airport as Donald J. Trump International",
    "description": "Florida House approves bill to rename Palm Beach International Airport after Donald Trump. Proposal moves to Florida Senate for review.",
    "link": "https://www.wftv.com/news/local/florida-house-approves-bill-rename-airport-after-donald-trump/WRNR5Y3G75AOJP5Q3OMNGOBVSA/",
    "timestamp": "2026-02-18T19:25:55Z"
  },
  {
    "title": "Fed minutes: Lower inflation needed before many officials will support rate cuts",
    "description": "Many Federal Reserve officials want to see inflation fall further before they would support additional interest rate cuts this year, particularly if the job market continues to stabilize, minutes of last month’s meeting show",
    "link": "https://abcnews.com/US/wireStory/fed-minutes-lower-inflation-needed-officials-support-rate-130273557",
    "timestamp": "2026-02-18T19:25:51Z"
  },
  {
    "title": "Trump Boys Talk ‘Retribution’ as CEOs Kiss the Ring at Their Crypto Event",
    "description": "Donald Trump Jr. insists his father is \"not involved.\"",
    "link": "https://gizmodo.com/trump-boys-talk-retribution-as-ceos-kiss-the-ring-at-their-crypto-event-2000723430",
    "timestamp": "2026-02-18T19:25:46Z"
  },
  {
    "title": "Fed minutes: Most officials want more inflation progress before more rate cuts",
    "description": "Many Federal Reserve officials want to see inflation fall further before they would support additional interest rate cuts this year, particularly if the job market continues to stabilize, minutes of last month’s meeting show. The minutes underscored the deepl…",
    "link": "https://apnews.com/article/inflation-jobs-fed-trump-d7aabc066d5a3a330022963289abc0c0",
    "timestamp": "2026-02-18T19:24:44Z"
  },
  {
    "title": "U2 join Bruce Springsteen in releasing six surprise ‘songs of defiance’ in response to ICE shootings",
    "description": "Rock band is latest group to release new music in the wake of the deadly Minneapolis ICE shootings",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/u2-new-album-days-of-ash-ice-shootings-b2923109.html",
    "timestamp": "2026-02-18T19:24:30Z"
  },
  {
    "title": "Democrats Plot Boycott and Protests of Trump’s State of the Union",
    "description": "President Trump will be holding his State of the Union address next Tuesday evening, and some Democrats have decided to skip the event and hold a rival gathering instead. “The People’s State of the Union” will be held on the National Mall at the same time as …",
    "link": "https://newrepublic.com/post/206728/democrats-boycott-protests-trump-state-union",
    "timestamp": "2026-02-18T19:22:13Z"
  },
  {
    "title": "Newsmax Reporter Asks Karoline Leavitt Point-Blank: ‘Does the Trump Administration Believe Aliens Are Real?’",
    "description": "Karoline Leavitt was asked whether Donald Trump believes aliens are \"real\" or not following his daughter-in-law teasing an alleged speech on the subject.\nThe post Newsmax Reporter Asks Karoline Leavitt Point-Blank: ‘Does the Trump Administration Believe Alien…",
    "link": "https://www.mediaite.com/media/news/newsmax-reporter-asks-karoline-leavitt-point-blank-does-the-trump-administration-believe-aliens-are-real/",
    "timestamp": "2026-02-18T19:22:07Z"
  },
  {
    "title": "Who Will Be Next to Headline the Sphere? We Make Our Educated Guess",
    "description": "The people who run the Las Vegas Sphere keep their plans secret, but we're still speculating about Metallica, Tool, and others who may perform there.",
    "link": "http://www.rollingstone.com/music/music-features/sphere-las-vegas-metallica-tool-roger-waters-1235518839/",
    "timestamp": "2026-02-18T19:20:08Z"
  },
  {
    "title": "Rep. Tim Burchett on Democrats ‘Pathetic Agenda’ of ‘Protecting Rapists, Murderers and Child Molesters’ (Video)",
    "description": "While Democrats demonize ICE, comparing ICE to Nazis and the Secret Police, they continue to remove violent illegals from the streets and rescue vulnerable children.\nThe post Rep. Tim Burchett on Democrats ‘Pathetic Agenda’ of ‘Protecting Rapists, Murderers a…",
    "link": "https://www.thegatewaypundit.com/2026/02/rep-tim-burchett-democrats-pathetic-agenda-protecting-rapists/",
    "timestamp": "2026-02-18T19:20:03Z"
  },
  {
    "title": "Investigators Look for DNA Match, Claim the Search for Nancy Guthrie Is ‘Not Cold’",
    "description": "Eighteen days into the search for Nancy Guthrie, and hundreds of investigators are pursuing leads based off of tens of thousands of tips and are adamant that the case has... Read More\nThe post Investigators Look for DNA Match, Claim the Search for Nancy Guthr…",
    "link": "https://www.dailysignal.com/2026/02/18/new-dna-update-search-nancy-guthrie-not-cold/",
    "timestamp": "2026-02-18T19:20:00Z"
  },
  {
    "title": "Ukraine peace talks collapse in less than two hours as Zelensky says it is 'not fair' Trump wants him to compromise and not Putin",
    "description": "US-mediated peace talks on Ukraine collapsed in less than two hours after Ukrainian leader Volodymyr Zelensky claimed it was unfair that Donald Trump was placing more pressure on his country than on Russia.The second day of talks concluded on Wednesday, thoug…",
    "link": "https://freerepublic.com/focus/f-chat/4367353/posts",
    "timestamp": "2026-02-18T19:18:10Z"
  },
  {
    "title": "Jasmine Crockett Says FCC 'Did Not Shut Down' James Talarico's Colbert Interview",
    "description": "The Texas lawmaker said there are \"additional layers at play\" as to why CBS didn't air her Democratic opponent's interview with Stephen Colbert.",
    "link": "https://www.huffpost.com/entry/james-talarico-colbert-crockett_n_69960398e4b0f4c9ebbc2a51",
    "timestamp": "2026-02-18T19:17:09Z"
  },
  {
    "title": "Do not give away Diego Garcia, says Trump",
    "description": "The US president says \"it will be a blight on our great ally\" if the islands are handed over to Mauritius.",
    "link": "https://www.bbc.com/news/articles/c309qqyer8yo",
    "timestamp": "2026-02-18T19:13:08Z"
  },
  {
    "title": "Telling clues revealed that US war imminent: '90% chance'",
    "description": "As an adviser to President Donald Trump told Axios that “I think there is 90% chance we see kinetic action” against Iran in the next few weeks following nuclear talks in Switzerland, US military movement on Wednesday fueled fears of an imminent attack on the …",
    "link": "https://www.rawstory.com/trump-iran-2675281492/",
    "timestamp": "2026-02-18T19:13:02Z"
  },
  {
    "title": "Trump administration freezes new FEMA disaster deployments during DHS shutdown | CNN Politics",
    "description": "The Trump administration has ordered the Federal Emergency Management Agency to suspend the deployment of hundreds of aid workers to disaster-torn areas around the US while the Department of Homeland Security is shut down, according to sources and internal me…",
    "link": "https://www.cnn.com/2026/02/18/politics/trump-dhs-fema-travel-restriction",
    "timestamp": "2026-02-18T19:12:47Z"
  },
  {
    "title": "EXCLUSIVE: Powerful Conservative Orgs Think Trump Needs To Step Up His Deportation Game",
    "description": "A group of conservative organizations are launching the Mass Deportation Coalition to push President Trump to take his deportation agenda to the next level.",
    "link": "https://dailycaller.com/2026/02/18/coalition-tells-trump-to-up-deportations/",
    "timestamp": "2026-02-18T19:12:44Z"
  },
  {
    "title": "‘Mommy, I’m scared he’s going to come eat me!’ Trans teacher demands kids take part in his wolf-like fantasies",
    "description": "'It is the height of anti-Christian bias to tell parents with Christian religious convictions 'there's nothing we can do' when a man with overt sexual fetishes wants to inculcate those fetishes into children'",
    "link": "https://www.wnd.com/2026/02/mommy-im-scared-hes-going-come-eat-me/",
    "timestamp": "2026-02-18T19:11:34Z"
  },
  {
    "title": "Did JetBlue flight attendant thank Trump on Presidents Day? What we know",
    "description": "The claim stemmed from a Threads user's post that didn't include an audio or video recording of the flight attendant's purported announcement.",
    "link": "https://www.snopes.com//news/2026/02/18/jetblue-pilot-flight-attendant-thanks-trump/",
    "timestamp": "2026-02-18T19:11:00Z"
  },
  {
    "title": "A few weeks of X’s algorithm can make you more right-wing – and it doesn’t wear off quickly",
    "description": "Elon Musk’s social media platform is boosting conservative content – and it’s having long-lasting effects on how users see the world.",
    "link": "https://theconversation.com/a-few-weeks-of-xs-algorithm-can-make-you-more-right-wing-and-it-doesnt-wear-off-quickly-276153",
    "timestamp": "2026-02-18T19:08:51Z"
  },
  {
    "title": "Donald Trump? That Donald Trump?",
    "description": "Adam Bonin has some interesting nuggets from the latest Economist/ YouGov poll. Show me another poll where almost half the respondents have no opinion. People having opinions, often misguided, is the definition of polls. So yes, I think Bonin is right. It’s h…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/donald-trump-that-donald-trump",
    "timestamp": "2026-02-18T19:08:28Z"
  },
  {
    "title": "Who Leads In 2028 Presidential Race And In 2026 Midterm Elections? I&I/TIPP Poll",
    "description": "President Donald Trump has barely finished the first year of his second term in office, but already pollsters are looking to the midterm 2026 congressional battle and 2028 presidential election. That includes the I&I/TIPP Poll. Believe it or not, many voters …",
    "link": "https://freerepublic.com/focus/f-chat/4367352/posts",
    "timestamp": "2026-02-18T19:06:59Z"
  },
  {
    "title": "UN Security Council moves up session on Gaza, West Bank ahead of Trump’s inaugural Board of Peace meeting",
    "description": "The U.N. Security Council will hold a high-level meeting on Gaza’s fragile ceasefire and expanding Israeli operations in the West Bank, shifted earlier to avoid clashing with President Trump’s inaugural Board of Peace meeting.",
    "link": "https://www.foxnews.com/world/un-security-council-move-session-gaza-west-bank-ahead-trumps-inaugural-board-peace-meeting",
    "timestamp": "2026-02-18T19:06:22Z"
  },
  {
    "title": "What is the endgame in the DHS shutdown?",
    "description": "Democrats want to rein in ICE’s immigration crackdown",
    "link": "https://theweek.com/politics/dhs-shutdown-endgame-democrats-ice-republicans-immigration",
    "timestamp": "2026-02-18T19:04:35Z"
  },
  {
    "title": "Trump Misleads on Drug Pricing Deals",
    "description": "President Donald Trump has said that Americans are now paying or will pay \"the lowest price anywhere in the world for drugs,\" thanks to the administration’s negotiations with pharmaceutical companies. The administration has announced discounted cash prices fo…",
    "link": "https://www.factcheck.org/2026/02/trump-misleads-on-drug-pricing-deals/",
    "timestamp": "2026-02-18T19:04:17Z"
  },
  {
    "title": "Trump: Starmer Making “Big Mistake” With Chagos Deal",
    "description": "Donald Trump has just posted on Truth Social: “I have been telling Prime Minister Keir Starmer, of the United Kingdom, that Leases are no good when it comes to Countries, and that he is making a big mistake by entering a 100 Year Lease with whoever it is that…",
    "link": "https://order-order.com/2026/02/18/trump-starmer-making-big-mistake-with-chagos-deal/",
    "timestamp": "2026-02-18T19:03:24Z"
  },
  {
    "title": "Obama took on recession, health care and Iraq. What he didn’t see coming was Trump.",
    "description": "Obama and his team never saw Trump coming, as a new set of oral history interviews released Tuesday makes abundantly clear.",
    "link": "https://www.boston.com/news/politics/2026/02/18/obama-recession-health-care-iraq-trump/",
    "timestamp": "2026-02-18T19:02:30Z"
  },
  {
    "title": "Goldman Sachs CEO Solomon calls rule-based system for crypto 'very, very important'",
    "description": "David Solomon spoke weeks after a Senate panel advanced a cryptocurrency market bill to create a national regulatory structure for crypto.",
    "link": "https://www.cnbc.com/2026/02/18/goldman-sachs-david-solomon-crypto-trump-world-liberty.html",
    "timestamp": "2026-02-18T19:01:24Z"
  },
  {
    "title": "Trump official says US did not censor Colbert interview but is probing The View",
    "description": "The confirmation of a probe into the daytime talk show came after it interviewed the same Democratic candidate whose interview with Stephen Colbert was allegedly barred from airing.",
    "link": "https://www.abc.net.au/news/2026-02-19/fcc-confirms-investigation-into-the-view/106361394",
    "timestamp": "2026-02-18T19:01:04Z"
  },
  {
    "title": "Jasmine Crockett pushes back on Texas opponent's claim Trump FCC killed interview, puts blame on CBS",
    "description": "Rep. Jasmine Crockett responded Tuesday to CBS allegedly pulling Stephen Colbert's interview with Texas Senate rival James Talarico over FCC equal time concerns.",
    "link": "https://www.foxnews.com/media/jasmine-crockett-pushes-back-texas-opponents-claim-trump-fcc-killed-interview-puts-blame-cbs",
    "timestamp": "2026-02-18T19:00:57Z"
  },
  {
    "title": "Part 1: Why U.S. War Strategy Pushing Toward WWIII – Mike Adams Talks to Patrick Henningsen",
    "description": "We are now witnessing an empire in decline. Under the order of Israel, US President Trump is currently amassing large amount of US military assets around the Persian Gulf, and it seems he is intent on attacking on Iran—but what is the rationale for such an at…",
    "link": "https://www.activistpost.com/part-1-why-u-s-war-strategy-pushing-toward-wwiii-mike-adams-talks-to-patrick-henningsen/",
    "timestamp": "2026-02-18T19:00:00Z"
  },
  {
    "title": "China's Eileen Gu Triggered by Reporter's Question over 'Lost Gold' at Olympics: 'Ridiculous'",
    "description": "Eileen Gu laughed in a reporter's face over his \"ridiculous\" question about her missed opportunities for earning gold in this year's Games.\nThe post China’s Eileen Gu Triggered by Reporter’s Question over ‘Lost Gold’ at Olympics: ‘Ridiculous’ appeared first o…",
    "link": "https://www.breitbart.com/sports/2026/02/18/chinas-eileen-gu-triggered-reporters-question-lost-gold-olympics-ridiculous/",
    "timestamp": "2026-02-18T18:57:52Z"
  },
  {
    "title": "Starmer 'making a big mistake' over Diego Garcia, says Trump",
    "description": "Donald Trump has launched a fresh broadside on the UK's Chagos Islands deal with Mauritius, saying Sir Keir Starmer is \"making a big mistake\".",
    "link": "https://news.sky.com/story/donald-trump-tells-keir-starmer-do-not-give-away-diego-garcia-in-fresh-attack-on-chagos-islands-deal-13509245",
    "timestamp": "2026-02-18T18:56:00Z"
  },
  {
    "title": "Danish Prime Minister Squashes Lindsey Graham's Sexist Remark Like the Little Bug He Is",
    "description": "The South Carolina senator threw a tantrum because Trump hasn't been allowed to buy Greenland.",
    "link": "https://www.jezebel.com/danish-prime-minister-squashes-lindsey-grahams-sexist-remark-like-the-little-bug-he-is",
    "timestamp": "2026-02-18T18:53:53Z"
  },
  {
    "title": "Latin America's Carnival Parades Feature Donald Trump Arresting Maduro, Giant Nayib Bukele",
    "description": "President Donald Trump and Venezuela's deposed socialist dictator Nicolás Maduro became unwitting stars in several Carnival parade festivities this year.\nThe post Latin America’s Carnival Parades Feature Donald Trump Arresting Maduro, Giant Nayib Bukele appea…",
    "link": "https://www.breitbart.com/latin-america/2026/02/18/latin-americas-carnival-parades-feature-donald-trump-arresting-maduro-giant-nayib-bukele/",
    "timestamp": "2026-02-18T18:53:34Z"
  },
  {
    "title": "Republican blamed as claim that opponent had affair with staffer who died by suicide leaks",
    "description": "WASHINGTON — U.S. Rep. Tony Gonzales, R-San Antonio, blamed his GOP opponent Brandon Herrera for politicizing the death of his former staffer Wednesday, a day after the San Antonio Express-News reported on a text message from the woman admitting to having an …",
    "link": "https://www.rawstory.com/republican-blamed-as-claim-that-opponent-had-affair-with-staffer-who-died-by-leaks/",
    "timestamp": "2026-02-18T18:53:18Z"
  },
  {
    "title": "Crowd Erupts at Kaitlan Collins Clap-Back to Trump Meltdown Over Epstein Question",
    "description": "The Late Show crowd erupted in cheers when CNN's Kaitlan Collins clapped back at Trump's attack on her over a question about Epstein survivors.\nThe post Crowd Erupts at Kaitlan Collins Clap-Back to Trump Meltdown Over Epstein Question first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/crowd-erupts-at-kaitlan-collins-clap-back-to-trump-meltdown-over-epstein-question/",
    "timestamp": "2026-02-18T18:52:34Z"
  },
  {
    "title": "The Hawks Are Lying Us Into Yet Another Middle Eastern War",
    "description": "Like the Iraq War, the planned war with Iran is built on false premises. Unlike the Iraq War, there hasn’t even been a real public debate.",
    "link": "https://reason.com/2026/02/18/the-hawks-are-lying-us-into-yet-another-middle-eastern-war/",
    "timestamp": "2026-02-18T18:51:58Z"
  }
]