[
  {
    "title": "Trump Caught Red-Handed Lying in Crazy ’200 Deals’ Interview",
    "description": "Donald Trump sat down with TIME magazine for an extensive interview to mark the first 100 days of his second term and delivered a series of White House...",
    "link": "https://www.thedailybeast.com/trump-caught-red-handed-lying-in-crazy-200-deals-interview/",
    "timestamp": "2025-04-25T16:37:19Z"
  },
  {
    "title": "Fox’s Stuart Varney Asks Michigan Republican if Trump’s Policies Have Actually Created ‘Any New Manufacturing Jobs’",
    "description": "“Has the president's policies thus far brought any new manufacturing jobs to your district?” Varney asked.\nThe post Fox’s Stuart Varney Asks Michigan Republican if Trump’s Policies Have Actually Created ‘Any New Manufacturing Jobs’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/foxs-stuart-varney-asks-michigan-republican-if-trumps-policies-have-actually-created-any-new-manufacturing-jobs/",
    "timestamp": "2025-04-25T16:37:11Z"
  },
  {
    "title": "Trump says he wasn't 'trolling' about acquiring Greenland, Canada as 51st state",
    "description": "Trump has discussed acquiring Greenland, Canada and Panama for months — and regularly has referred to Canada as the 51st U.S. state.",
    "link": "https://www.foxnews.com/politics/trump-says-he-wasnt-trolling-about-acquiring-greenland-canada-51st-state",
    "timestamp": "2025-04-25T16:36:39Z"
  },
  {
    "title": "Mom Detained by ICE After US Citizen Husband Petitions for Her Green Card",
    "description": "Rosmery Alvarado, a mother living in Pittsburg, Kansas, has been detained by ICE agents.",
    "link": "https://www.newsweek.com/mom-detained-ice-after-us-citizen-husband-petitions-her-green-card-2064222",
    "timestamp": "2025-04-25T16:36:09Z"
  },
  {
    "title": "BofA says the latest stock rally will be short-lived — and 3 things need to happen for gains to continue",
    "description": "Stocks rallied this week but BofA says it's a selling opportunity until there's further progress  on key issues facing the market.",
    "link": "https://www.businessinsider.com/stock-market-oulook-rally-dollar-fed-rate-cuts-tariffs-recession-2025-4",
    "timestamp": "2025-04-25T16:35:39Z"
  },
  {
    "title": "Trump Fails to Answer Easy Question on Payments to El Salvador",
    "description": "Donald Trump doesn’t know, or at least isn’t revealing, how much he’s paying Savaldoran President Nayib Bukele to detain immigrants deported from the United States without due process.\r\nAfter reaffirming he hopes to soon deport American citizens to El Salvado…",
    "link": "https://newrepublic.com/post/194430/trump-question-payment-el-salvador-deported-immigrants",
    "timestamp": "2025-04-25T16:34:49Z"
  },
  {
    "title": "New financials from Musk’s X debt sale show changing company",
    "description": "Elon Musk’s X Holdings Corp. is evolving from ad-driven social media to betting on dollars generated from AI and subscriptions. Read on",
    "link": "https://financialpost.com/technology/tech-news/musks-x-debt-sale-show-changing-company",
    "timestamp": "2025-04-25T16:34:06Z"
  },
  {
    "title": "Ex-CISA boss says Trump actions risk 'dangerously degrading' US cyber defenses",
    "description": "WASHINGTON :U.S. President Donald Trump's purges and apparent acts of retribution aimed at top cyber officials put the nation's digital defenses at risk, the former head of the Cybersecurity and Infrastructure Security Agency (CISA) said in a post on Friday.T…",
    "link": "https://www.channelnewsasia.com/business/ex-cisa-boss-says-trump-actions-risk-dangerously-degrading-us-cyber-defenses-5090051",
    "timestamp": "2025-04-25T16:32:36Z"
  },
  {
    "title": "Here's Why Bitcoin Has Decoupled From Stocks According To Standard Chartered",
    "description": "Standard Chartered Head of Digital Assets Research Geoffrey Kendrick has weighed in on the catalyst for Bitcoin’s recent decoupling from stocks. Kendrick...",
    "link": "https://finance.yahoo.com/news/heres-why-bitcoin-decoupled-stocks-163132356.html",
    "timestamp": "2025-04-25T16:31:32Z"
  },
  {
    "title": "TRUMP KREMLIN TOWER®",
    "description": "“The energy sector bled nearly $150 billion in market value over the same 48‑hour whiplash… Global Energy News Update – April 25, 2025 All rights reserved by Germán & Co. Reproduction is strictly prohibited. “A symbolic skyscraper, constructed with rare earth…",
    "link": "https://energycentral.com/c/og/trump-kremlin-tower%C2%AE",
    "timestamp": "2025-04-25T16:30:50Z"
  },
  {
    "title": "Trump Signs Executive Order Boosting Deep-Sea Mining Industry",
    "description": "President Donald Trump on Thursday signed an executive order aimed at boosting the deep-sea mining industry, marking his latest attempt to boost U.S. access to nickel, copper and other critical minerals used widely across the economy.",
    "link": "https://gcaptain.com/trump-signs-executive-order-boosting-deep-sea-mining-industry/",
    "timestamp": "2025-04-25T16:29:39Z"
  },
  {
    "title": "Trump brands Harvard 'antisemitic' and a 'threat to democracy' amid funding battle",
    "description": "The tensions between Harvard and the Trump administration appear to be growing as the president calls the university an \"antisemitic, far-left institution\" and a \"threat to democracy.\"",
    "link": "https://www.foxnews.com/politics/trump-brands-harvard-antisemitic-threat-democracy-amid-funding-battle",
    "timestamp": "2025-04-25T16:28:30Z"
  },
  {
    "title": "New SNAP Benefit Guidance Announced by Trump Administration",
    "description": "President Donald Trump has made a series of efforts to clamp down on undocumented migrants accessing federal benefits.",
    "link": "https://biztoc.com/x/a3c96861b3f90456",
    "timestamp": "2025-04-25T16:28:26Z"
  },
  {
    "title": "As the Economy Tumbles, so Does Trump's Approval Rate",
    "description": "President Donald Trump's approval rating has dropped to 40 percent, lower than all other presidents at this point in their terms, new polling released by Pew Research Center on Wednesday shows. Americans want Trump to govern less by executive order, listen to…",
    "link": "https://biztoc.com/x/942750b638ad4754",
    "timestamp": "2025-04-25T16:28:22Z"
  },
  {
    "title": "Trump Admin, DOGE Are Turning Multiple Gov’t Components Into A Giant Racist Database",
    "description": "What could possibly go wrong? Operatives from Elon Musk’s so-called Department of Government Efficiency (DOGE) are building a master database at the Department of Homeland Security (DHS) that could track and surveil undocumented immigrants, two sources with d…",
    "link": "https://www.techdirt.com/2025/04/25/trump-admin-doge-are-turning-multiple-govt-components-into-a-giant-racist-database/",
    "timestamp": "2025-04-25T16:26:15Z"
  },
  {
    "title": "Pope Francis’s Funeral: Watch Live from St. Peter’s Basilica",
    "description": "Watch live from Vatican City as the world prepares to say goodbye to Pope Francis. The livestream will begin with views of St. Peter’s Square starting at 11:50 p.m. EST on April 25th as crowds gather, and will show the arrival of various world dignitaries, in…",
    "link": "https://nypost.com/video/pope-franciss-funeral-watch-live-from-st-peters-basilica/",
    "timestamp": "2025-04-25T16:24:27Z"
  },
  {
    "title": "Will 'Lead The Pack' On Iran Attack If No Nuclear Deal: Donald Trump",
    "description": "President Donald Trump said the United States will &quot;lead the pack&quot; in attacking Iran if talks over Tehran&#039;s nuclear program do not result in a new deal, according to a Time Magazine interview.",
    "link": "https://www.ndtv.com/world-news/will-lead-the-pack-on-iran-attack-if-no-nuclear-deal-us-president-donald-trump-8256868",
    "timestamp": "2025-04-25T16:24:09Z"
  },
  {
    "title": "China Waives Tariffs on Some U.S. Goods, but Denies Trump’s Claim That Talks are Underway",
    "description": "China exempted some U.S. imports from its steep tariffs in a sign on Friday that the trade war between the two countries could be easing, though China quickly knocked down U.S. President Donald Trump's assertion that negotiations were underway.",
    "link": "https://gcaptain.com/china-waives-tariffs-on-some-u-s-goods-but-denies-trumps-claim-that-talks-are-underway/",
    "timestamp": "2025-04-25T16:23:04Z"
  },
  {
    "title": "How the public’s shift on immigration paved the way for Trump’s crackdown",
    "description": "Immigration has emerged as one of Trump's strongest issues in public polling.",
    "link": "https://www.bostonherald.com/2025/04/25/trump-immigration-campaign/",
    "timestamp": "2025-04-25T16:22:55Z"
  },
  {
    "title": "How Tall Is Tulsi Gabbard? Find Out Her Height",
    "description": "Learn more about Gabbard's background, including details like her height, career milestones, and personal life here.",
    "link": "https://hollywoodlife.com/feature/how-tall-is-tulsi-gabbard-height-5383049/",
    "timestamp": "2025-04-25T16:22:52Z"
  },
  {
    "title": "Slotkin Panned Online After Claiming That Voters Don't Know What 'Oligarchy' Means",
    "description": "U.S. Sen. Bernie Sanders' tour headlined with this word has drawn more than 107,000 Americans in blue and deep-red states alike. Former President Joe Biden's use of it in his farewell speech prompted a spike in Google searches. And one recent poll found that …",
    "link": "https://www.commondreams.org/news/us-is-an-oligarchy",
    "timestamp": "2025-04-25T16:22:50Z"
  },
  {
    "title": "AI Supercomputers May Run Into Power Constraints by 2030",
    "description": "While companies building artificial intelligence (AI)-powered supercomputers are likely to be able to get the chips and capital they need, they may run into power constraints by 2030, according to research institute Epoch AI.  “If the observed trends continue…",
    "link": "https://www.pymnts.com/artificial-intelligence-2/2025/ai-supercomputers-may-run-into-power-constraints-by-2030/",
    "timestamp": "2025-04-25T16:21:54Z"
  },
  {
    "title": "As the Economy Tumbles, so Does Trump's Approval Rate",
    "description": "There isn't much public enthusiasm for the president's chaotic style.",
    "link": "https://reason.com/2025/04/25/as-the-economy-tumbles-so-does-trumps-approval-rate/",
    "timestamp": "2025-04-25T16:20:38Z"
  },
  {
    "title": "Alabama House Advances Bill to Let Police Enforce Immigration Laws",
    "description": "MONTGOMERY, Ala. (AP) — Alabama lawmakers advanced legislation last week that would allow local law enforcement to enforce immigration law, as conservative legislators push for increased alignment with the federal government’s crackdown on immigration. The bi…",
    "link": "https://www.insurancejournal.com/news/southeast/2025/04/25/821379.htm",
    "timestamp": "2025-04-25T16:18:30Z"
  },
  {
    "title": "Trump’s attacks on Fed Chair Jerome Powell and calls to cut interest rates could backfire, economists say",
    "description": "President Donald Trump is badgering the Federal Reserve to cut interest rates, but even if the Fed gave in to the pressure, it wouldn't necessarily lead to lower borrowing costs for consumers.\nIn fact, economists say, Trump's ongoing attacks on Fed Chair Jero…",
    "link": "https://biztoc.com/x/43f362ce58d8247f",
    "timestamp": "2025-04-25T16:17:42Z"
  },
  {
    "title": "Trump says he’d ‘love’ to tax rich Americans more, but worries a millionaire tax would be ‘used against me politically’",
    "description": "Why not tax the millionaires?\nAs Congress begins drafting a massive package for President Donald Trump’s “big, beautiful bill” with trillions of dollars in tax breaks and federal program cuts, it’s a question that won’t seem to go away.\nTrump himself has muse…",
    "link": "https://biztoc.com/x/9acdaab1795c1201",
    "timestamp": "2025-04-25T16:17:39Z"
  },
  {
    "title": "New SNAP Benefit Guidance Announced by Trump Administration",
    "description": "President Donald Trump has made a series of efforts to clamp down on undocumented migrants accessing federal benefits.",
    "link": "https://www.newsweek.com/new-snap-benefit-guidance-illegal-immigrants-trump-administration-2064182",
    "timestamp": "2025-04-25T16:17:39Z"
  },
  {
    "title": "Trump Sees Trade Deals Coming in Three to Four Weeks",
    "description": "President Donald Trump said he expected to wrap up trade deals with US partners looking for lower tariffs soon.\n“I would say, over the next three to four weeks, and we’re finished, by the way,” Trump said of the deals in an interview with Time magazine publis…",
    "link": "https://biztoc.com/x/3b9711d6687036dd",
    "timestamp": "2025-04-25T16:17:19Z"
  },
  {
    "title": "New poll shows roughly half of Americans believe Trump has gone too far on immigration",
    "description": "President Donald Trump’s handling of immigration remains a point of strength as he takes wide-ranging actions to ramp up deportations and target people in the U.S. illegally, according to a new poll.\nThe survey from The Associated Press-NORC Center for Public…",
    "link": "https://biztoc.com/x/da97e2919e21d70c",
    "timestamp": "2025-04-25T16:17:00Z"
  },
  {
    "title": "Harry Enten Declares Trump Foreign Policy Approval ‘Awful, Awful, Awful’: ‘Broken His Own Polling Record’",
    "description": "CNN chief data analyst Harry Enten declared on Friday that President Donald Trump's foreign policy approval has sunk to its lowest point ever.\nThe post Harry Enten Declares Trump Foreign Policy Approval ‘Awful, Awful, Awful’: ‘Broken His Own Polling Record’ f…",
    "link": "https://www.mediaite.com/tv/harry-enten-declares-trump-foreign-policy-approval-awful-awful-awful-broken-his-own-polling-record/",
    "timestamp": "2025-04-25T16:16:02Z"
  },
  {
    "title": "George Santos sentenced to more than 7 years in prison for fraud and theft per report",
    "description": "Former Rep. George Santos of New York appears outside federal court in Central Islip on Aug. 19, 2024.\n \n\nThe former New York congressional representative could be sentenced to more than seven years in prison Friday. [ more › ]",
    "link": "https://gothamist.com/news/george-santos-awaiting-sentencing-says-he-wants-solitary-confinement-for-his-safety",
    "timestamp": "2025-04-25T16:16:00Z"
  },
  {
    "title": "Former Rep. George Santos sentenced to more than 7 years in prison",
    "description": "A federal judge in New York sentenced former Rep. George Santos to over seven years in prison Friday.",
    "link": "https://www.today.com/news/politics/george-santos-sentenced-prison-rcna203023",
    "timestamp": "2025-04-25T16:15:39Z"
  },
  {
    "title": "Former President Joe Biden to Attend Pope Francis’s Funeral in Rome",
    "description": "Former President Joe Biden (D) plans to attend Pope Francis’s funeral in Rome. The news comes after President Donald Trump announced he will be in attendance. Former First Lady Jill Biden will accompany her husband to the funeral on Saturday to honor the late…",
    "link": "https://freerepublic.com/focus/f-news/4313202/posts",
    "timestamp": "2025-04-25T16:15:28Z"
  },
  {
    "title": "Trump: Netanyahu may go into war with Iran, but the U.S. won't be dragged in",
    "description": "In an interview with Time Magazine, Trump said he 'didn't stop' Israel from attacking Iran, adding that the U.S. wouldn't be dragged in to war, but rather 'may go in very willingly if we can't get a deal'",
    "link": "https://www.haaretz.com/us-news/2025-04-25/ty-article/trump-netanyahu-may-go-into-war-with-iran-but-the-u-s-wont-be-dragged-in/00000196-6d10-de13-add7-6f7bf1d80000",
    "timestamp": "2025-04-25T16:15:25Z"
  },
  {
    "title": "President Trump, First Lady Fly to Rome to Attend Pope Francis's Funeral",
    "description": "President Donald Trump and First Lady Melania Trump have departed the United States for Italy, where they will attend Pope Francis's funeral on Saturday morning.\nThe post President Trump, First Lady Fly to Rome to Attend Pope Francis’s Funeral appeared first …",
    "link": "https://www.breitbart.com/europe/2025/04/25/president-trump-first-lady-fly-to-rome-to-attend-pope-franciss-funeral/",
    "timestamp": "2025-04-25T16:14:57Z"
  },
  {
    "title": "Pricier appliances, snacks, and electronics: Amazon sellers are raising prices on some of the site's most popular items",
    "description": "Data reveals Amazon sellers have increased prices on top products by an average of 29%, with tariffs influencing costs from electronics to snacks.",
    "link": "https://www.businessinsider.com/amazon-sellers-hike-prices-amid-tariff-impacts-2025-4",
    "timestamp": "2025-04-25T16:14:32Z"
  },
  {
    "title": "George Santos Sentenced to 7 Years in Prison",
    "description": "On Friday, former representative George Santos was sentenced after the disgraced politician pled guilty to wire fraud and identity theft last summer.",
    "link": "http://nymag.com/intelligencer/article/george-santos-sentenced.html",
    "timestamp": "2025-04-25T16:14:00Z"
  },
  {
    "title": "Meghan McCain's Prediction About Alexandria Ocasio-Cortez and 2028 Election",
    "description": "McCain suggested that the Democratic congresswoman will be running for the 2028 presidential election.",
    "link": "https://www.newsweek.com/meghan-mccains-prediction-about-alexandria-ocasio-cortez-2028-election-2064176",
    "timestamp": "2025-04-25T16:13:58Z"
  },
  {
    "title": "The Brief – 25 April 2025: The Good, the Bad, and the Ugly",
    "description": "The Brief on Friday: The Good, the Bad and the Ugly of the week in news.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-brief-25-april-2025-the-good-the-bad-and-the-ugly/",
    "timestamp": "2025-04-25T16:12:03Z"
  },
  {
    "title": "Ex-congressman George Santos sentenced to seven years in prison",
    "description": "Santos' downfall included him being the first member of Congress to be expelled in more than 20 years.",
    "link": "https://www.bbc.com/news/articles/c3r838v4xddo",
    "timestamp": "2025-04-25T16:11:25Z"
  },
  {
    "title": "Former Rep. George Santos sentenced to more than 7 years in prison",
    "description": "A federal judge in New York sentenced former Rep.",
    "link": "https://www.nbcnews.com/politics/justice-department/former-rep-george-santos-sentenced-7-years-prison-rcna202397",
    "timestamp": "2025-04-25T16:10:58Z"
  },
  {
    "title": "Former GOP Rep. George Santos sentenced to more than 7 years in prison in fraud case",
    "description": "Last summer, former congressman George Santos pleaded guilty to two counts — wire fraud and aggravated identity theft — and agreed to pay restitution.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/george-santos-sentenced-wire-fraud-identity-theft-congress-ny-rcna202958",
    "timestamp": "2025-04-25T16:10:28Z"
  },
  {
    "title": "Donald Trump Asks DOJ To Do Him Little Favor, 'Investigate' ActBlue Ahead Of Midterms",
    "description": "Oh, hey, he's also making a bundle in a crypto scheme, no relation.",
    "link": "https://www.wonkette.com/p/donald-trump-asks-doj-to-do-him-little",
    "timestamp": "2025-04-25T16:08:56Z"
  },
  {
    "title": "Will Trump back India's military action against Pakistan?",
    "description": "Following the Pahalgam terror attack, the US has expressed solidarity with India, but stopped short of explicitly endorsing any military retaliation against Pakistan. While officials like Tulsi Gabbard have offered strong support, the US historically advocate…",
    "link": "https://economictimes.indiatimes.com/news/defence/will-trump-back-indias-military-action-against-pakistan/articleshow/120624793.cms",
    "timestamp": "2025-04-25T16:08:02Z"
  },
  {
    "title": "Israel's muted response to Pope Francis's death signals tensions over Gaza",
    "description": "Israeli Prime Minister Benjamin Netanyahu's office has sent condolences four days after the Pope's death.",
    "link": "https://www.bbc.com/news/articles/cm2ekk5kjzno",
    "timestamp": "2025-04-25T16:07:39Z"
  },
  {
    "title": "Why Trump keeps attacking the US central bank",
    "description": "The US central bank is one of Trump's favourite punching bags. But how serious is the threat?",
    "link": "https://www.bbc.com/news/articles/cx20lyg4385o",
    "timestamp": "2025-04-25T16:07:38Z"
  },
  {
    "title": "Why Donald Trump keeps attacking Federal Reserve boss Jerome Powell",
    "description": "The US central bank is one of Trump's favourite punching bags. But how serious is the threat?",
    "link": "https://www.bbc.co.uk/news/articles/cx20lyg4385o",
    "timestamp": "2025-04-25T16:07:38Z"
  },
  {
    "title": "‘Grim’ retail sales underbelly points to Bank of Canada restarting rate cuts, economists say",
    "description": "Wakening discretionary spending should convince the Bank of Canada to start cutting interest rates again, economists say. Find out more here",
    "link": "https://financialpost.com/news/retail-marketing/retail-sales-points-to-bank-of-canada-restarting-rate-cuts",
    "timestamp": "2025-04-25T16:06:54Z"
  },
  {
    "title": "FBI Arrests Milwaukee Judge for ‘Intentionally’ Blocking ICE Arrest, Kash Patel Says",
    "description": "President Donald Trump's FBI director says Judge Hannah Dugan helped a 30-year-old Mexican immigrant \"evade arrest\" at a state courthouse \nThe post FBI Arrests Milwaukee Judge for ‘Intentionally’ Blocking ICE Arrest, Kash Patel Says appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-fbi-arrests-milwaukee-judge-blocking-ice-arrest/",
    "timestamp": "2025-04-25T16:06:53Z"
  },
  {
    "title": "The market may be poised for a 'roaring 2020s' comeback, says a veteran analyst",
    "description": "Veteran analyst Ed Yardeni said the 'roaring 2020s' could resume after recent market gains.\n-\nThe stock markets have been posting wild swings as volatility surged after \"Liberation Day.\"\n-\nMarket volatility has eased as President Donald Trump softened his sta…",
    "link": "https://biztoc.com/x/9fbdee0dce5a0447",
    "timestamp": "2025-04-25T16:06:53Z"
  },
  {
    "title": "Trump Makes Bonkers Claim About All His Trade Deals",
    "description": "Donald Trump has made the outrageous claim that he’d struck a whopping 200 trade deals with foreign leaders during his 90-day pause on his “reciprocal tariff” policy. But when pressed, the president refused to say with what countries any of the deals had been…",
    "link": "https://newrepublic.com/post/194421/donald-trump-claim-200-trade-deals",
    "timestamp": "2025-04-25T16:06:41Z"
  },
  {
    "title": "Trump calls his promise to end the Russia-Ukraine war on day one 'an exaggeration'",
    "description": "President Donald Trump said in a new interview that he was joking when he promised to end the Russia-Ukraine war in the first 24 hours of his second term.",
    "link": "https://biztoc.com/x/00dc06bfa196ec2b",
    "timestamp": "2025-04-25T16:06:32Z"
  },
  {
    "title": "Trump and other heads of state among dignitaries traveling to Rome for Pope Francis funeral",
    "description": "U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday.",
    "link": "https://biztoc.com/x/9d6dc8ac666b5512",
    "timestamp": "2025-04-25T16:06:27Z"
  },
  {
    "title": "Should Democrats Become Pro-Voucher/ESA? Plus Pro-(school) choice Fish Porn.",
    "description": "Rick Hess and I check in with Nat Malkus on a new episode of his “Report Card” podcast. You can listen here or wherever you get your podcasts. We discuss why, even if you’re frustrated with what has happened at Harvard, we all have to be Crimson now given the…",
    "link": "https://www.eduwonk.com/2025/04/should-democrats-become-pro-voucher-esa-plus-pro-school-choice-fish-porn.html",
    "timestamp": "2025-04-25T16:06:19Z"
  },
  {
    "title": "Trump identifies Russia’s ‘concession’ in a proposed White House peace deal",
    "description": "President Donald Trump and Russia's President Vladimir Putin shake hands before attending a joint press conference after a meeting at the Presidential Palace in Helsinki, on July 16, 2018.",
    "link": "https://biztoc.com/x/1842593dd44fac2d",
    "timestamp": "2025-04-25T16:06:13Z"
  },
  {
    "title": "Putin, Witkoff discuss possible direct Russia-Ukraine talks, Kremlin says",
    "description": "Russia and Ukraine have not held direct talks since the early weeks of the war, which started in February 2022.",
    "link": "https://www.aljazeera.com/news/2025/4/25/putin-witkoff-discuss-possible-direct-russia-ukraine-talks-kremlin-says",
    "timestamp": "2025-04-25T16:05:33Z"
  },
  {
    "title": "In talking with Tehran, Trump is reversing course on Iran – could a new nuclear deal be next?",
    "description": "Nuclear experts from the US and Iran are due to meet in Oman. The turn to diplomacy indicates Trump is erring against reviving a maximum pressure strategy with Tehran.",
    "link": "https://theconversation.com/in-talking-with-tehran-trump-is-reversing-course-on-iran-could-a-new-nuclear-deal-be-next-254770",
    "timestamp": "2025-04-25T16:05:07Z"
  },
  {
    "title": "MyPillow CEO in Hot Water for Disastrous AI-Generated Legal Filing",
    "description": "The only legal representation available to MyPillow CEO and ardent election denier Mike Lindell is, apparently, completely fake.\r\nAttorneys for the longtime Donald Trump ally are facing possible discipline for filing an AI-generated brief with fabricated lega…",
    "link": "https://newrepublic.com/post/194427/mypillow-ceo-mike-lindell-ai-generated-legal-filing",
    "timestamp": "2025-04-25T16:04:13Z"
  },
  {
    "title": "How the Trump Administration Flipped on Kilmar Abrego Garcia",
    "description": "Officials were developing a plan to get him back to the United States. Why did they stop?",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/kilmar-abrego-garcia-plan-reversal/682594/",
    "timestamp": "2025-04-25T16:04:00Z"
  },
  {
    "title": "Scientists May Have Figured Out Why Young People Are Getting Colorectal Cancer More Often",
    "description": "New research has found a link between a toxin produced by certain E. coli bacteria and early onset colorectal cancer.",
    "link": "https://gizmodo.com/scientists-may-have-figured-out-why-young-people-are-getting-colorectal-cancer-more-often-2000594349",
    "timestamp": "2025-04-25T16:04:00Z"
  },
  {
    "title": "Nearly two-thirds of Americans disapprove of Trump tariffs: POLL",
    "description": "Seven in 10 Americans think Donald Trump’s tariffs on international trade will drive up U.S. inflation, according to an ABC News/Washington Post/Ipsos poll.",
    "link": "https://abcnews.go.com/Politics/thirds-americans-disapprove-trump-tariffs-inflation-broad-concern/story?id=121123815",
    "timestamp": "2025-04-25T16:03:55Z"
  },
  {
    "title": "Trump and other heads of state among dignitaries traveling to Rome for Pope Francis funeral",
    "description": "U.S. President Donald Trump and Argentine President Javier Milei are among the leaders arriving Friday.",
    "link": "https://www.pbs.org/newshour/world/trump-and-other-heads-of-state-among-dignitaries-traveling-to-rome-for-pope-francis-funeral",
    "timestamp": "2025-04-25T16:03:26Z"
  },
  {
    "title": "Catholics in secular Cuba hail Francis as ‘bridge’",
    "description": "Catholics and others in secular Cuba have been paying tribute to Pope Francis, praising in particular his efforts to reconcile the communist island with its powerful neighbor, the United States. The country, which was officially atheist for three decades, dec…",
    "link": "https://www.digitaljournal.com/world/catholics-in-secular-cuba-hail-francis-as-bridge/article",
    "timestamp": "2025-04-25T16:03:24Z"
  },
  {
    "title": "US Envoy Witkoff, Putin Discuss 'Possibility' Of Direct Russia-Ukraine Talks",
    "description": "US envoy Steve Witkoff and Vladimir Putin on Friday discussed the \"possibility\" of direct talks between Russia and Ukraine during a meeting in Moscow, the Kremlin said Friday.",
    "link": "https://www.ibtimes.com.au/us-envoy-witkoff-putin-discuss-possibility-direct-russia-ukraine-talks-1858257",
    "timestamp": "2025-04-25T16:03:17Z"
  },
  {
    "title": "Catholics In Secular Cuba Hail Francis As 'Bridge'",
    "description": "Catholics and others in secular Cuba have been paying tribute to Pope Francis, praising in particular his efforts to reconcile the communist island with its powerful neighbor, the United States.",
    "link": "https://www.ibtimes.com/catholics-secular-cuba-hail-francis-bridge-3771420",
    "timestamp": "2025-04-25T16:03:06Z"
  },
  {
    "title": "Carney pledges ’Made-in-Canada’ strategy to shield steel industry from U.S.",
    "description": "Investing.com -- On the campaign trail ahead of Canada’s April 28 federal election, Prime Minister Mark Carney laid out an aggressive industrial strategy...",
    "link": "https://www.yahoo.com/news/carney-pledges-made-canada-strategy-160006431.html",
    "timestamp": "2025-04-25T16:00:06Z"
  },
  {
    "title": "M’sia open to US trade deal",
    "description": "KUALA LUMPUR: Malaysia is open to negotiating with the United States on reducing the trade deficit, addressing non-­tariff barriers, strengthening technological safeguards and security, and exploring a potential bilateral trade agreement. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/26/msia-open-to-us-trade-deal",
    "timestamp": "2025-04-25T16:00:00Z"
  },
  {
    "title": "Today's news and jokes",
    "description": "The Wall at Intuit Dome has horse hats tonight as a distraction tactic with the Nuggets in town. pic.twitter.com/zja4oBV5ng\r\n— Katy Winge (@katywinge) April 25, 2025 \n\n\n\n\n\n\n\n\n\n\n\n\n\nHasbro on CNBC today speaking on upcoming cost increases. pic.twitter.com/315rx…",
    "link": "https://www.superpunch.net/2025/04/todays-news-and-jokes_01967156004.html",
    "timestamp": "2025-04-25T16:00:00Z"
  },
  {
    "title": "Poll: A sizeable chunk of Americans think neither party 'fights for people like you'",
    "description": "Both political parties have significant work to do to convince Americans that they are fighting for them, according to the new NBC News Stay Tuned Poll powered by SurveyMonkey, with Democrats struggling to rally their own base of supporters.",
    "link": "https://www.nbcnews.com/politics/elections/poll-sizeable-chunk-americans-think-neither-party-fights-people-rcna202884",
    "timestamp": "2025-04-25T16:00:00Z"
  },
  {
    "title": "Oil Muted as Trade Talk Buzz Fizzles",
    "description": "Oil prices slipped on Friday, heading for a weekly loss of more than 2%, weighed down by oversupply concerns and ongoing uncertainty surrounding U.S.-China tariff negotiations. The oil markets have seemingly tired of trying to anticipate the next move of US P…",
    "link": "https://oilprice.com/Energy/Energy-General/Oil-Muted-as-Trade-Talk-Buzz-Fizzles.html",
    "timestamp": "2025-04-25T16:00:00Z"
  },
  {
    "title": "Trump Says The Only Russia Concession For Peace Is To Stop The War Against Ukraine",
    "description": "Donald Trump is actively working for Russia and demanding Ukraine surrender to end the war.\nTrump was asked in the White House what concessions Russia is willing to make for actual peace deal with Ukraine\n\nREPORTER: What concessions, Mr President, and to your…",
    "link": "https://crooksandliars.com/2025/04/trump-says-only-russia-concession-peace",
    "timestamp": "2025-04-25T15:59:44Z"
  },
  {
    "title": "Trump calls his promise to end the Russia-Ukraine war on day one 'an exaggeration'",
    "description": "President Donald Trump said in a new interview that he was joking when he promised to end the Russia-Ukraine war in the first 24 hours of his second term.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-calls-promise-end-russia-ukraine-war-day-one-exaggeration-rcna202966",
    "timestamp": "2025-04-25T15:59:19Z"
  },
  {
    "title": "What do Donald Trump’s tariffs mean for cycling? We chat to an industry insider about price rises and why the tariffs present a post-Brexit opportunity for UK brands",
    "description": "On episode 102 of the road.cc Podcast, Dominic Loh of Funn and Granite Design discusses the reaction to the US president’s trade war, staying positive (and nimble) among the doom and gloom, and why the world is big enough to cushion the tariffs",
    "link": "https://road.cc/content/feature/what-do-donald-trumps-tariffs-mean-cycling-313713",
    "timestamp": "2025-04-25T15:59:01Z"
  },
  {
    "title": "The risks of recognizing Russia's annexation of Crimea",
    "description": "The United States has reportedly called on Ukraine to accept Russian control of Crimea as part of a peace agreement. However, Ukraine says doing so would violate the constitution.",
    "link": "https://www.dw.com/en/the-risks-of-recognizing-russias-annexation-of-crimea/a-72355406",
    "timestamp": "2025-04-25T15:59:00Z"
  },
  {
    "title": "Trump given 'third-tier' seat at pope funeral?",
    "description": "Donald Trump claimed 'location is everything' while mocking Biden for being in the 14th row at Queen Elizabeth II's funeral but the president may find himself in a similar situation at the Pope's service",
    "link": "https://www.irishstar.com/news/us-news/trump-third-tier-seat-popes-35117596",
    "timestamp": "2025-04-25T15:58:37Z"
  },
  {
    "title": "Vladimir Stop Memes: Trump Begs Putin To End War",
    "description": "In recent turn of events Donald Trump has written “Vladimir, STOP!” after Russia launched deadliest strikes on Kyiv since last summer. People around the world have not reacted kindly to such a display of weakness and are relentlessly making fun of Trump. Scro…",
    "link": "https://www.sadanduseless.com/vladimir-stop-memes/",
    "timestamp": "2025-04-25T15:58:09Z"
  },
  {
    "title": "How a controversy over Medicaid funds and marijuana complicate Casey DeSantis’ potential run for governor",
    "description": "One of the biggest potential hurdles to Casey DeSantis running for Florida governor in 2026 may have just been knocked down — for now.",
    "link": "https://www.nbcnews.com/politics/2026-election/hope-florida-casey-desantis-potential-run-governor-rcna202516",
    "timestamp": "2025-04-25T15:57:47Z"
  },
  {
    "title": "Judge Awards North Dakota Nearly $28M Over Dakota Access Pipeline Protests",
    "description": "A federal judge on Wednesday found the state of North Dakota entitled to nearly $28 million for responding to protests of the Dakota Access oil pipeline in 2016 and 2017 — a win for the state in its multiyear effort …",
    "link": "https://www.insurancejournal.com/news/midwest/2025/04/25/821365.htm",
    "timestamp": "2025-04-25T15:57:26Z"
  },
  {
    "title": "Wisconsin judge accused of helping a man avoid immigration agents has been arrested",
    "description": "The FBI arrested a Milwaukee judge accused of helping a man evade immigration authorities, escalating a clash between the Trump administration and the judiciary over the president’s sweeping immigration crackdown.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_89503624-8de5-5b4f-a755-db616797e6f4.html",
    "timestamp": "2025-04-25T15:57:00Z"
  },
  {
    "title": "“60 Minutes” Head Bill Owens Exits Role Amid Corporate Changes to the Show",
    "description": "Owens's departure comes amid a multibillion-dollar lawsuit against the company from President Donald Trump.",
    "link": "https://truthout.org/articles/60-minutes-head-bill-owens-exits-role-amid-corporate-changes-to-the-show/",
    "timestamp": "2025-04-25T15:56:01Z"
  },
  {
    "title": "Trump Is Selling 2028 Hats",
    "description": "Donald Trump is selling hats that signal a plan for a third term in 2028 despite its being prohibited by the 22nd Amendment.",
    "link": "http://www.thecut.com/article/trump-is-selling-2028-hats.html",
    "timestamp": "2025-04-25T15:55:50Z"
  },
  {
    "title": "Trump's 'Vladimir, STOP!' Plea Sparks Avalanche of Jokes, Memes",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAn avalanche of jokes and memes have flooded the internet after President Donald Trump took to Truth Social to tell Russian President Vladimir Putin to stop attacking Ukraine, writing \"Vladimir, STOP,\"—a rare …",
    "link": "https://biztoc.com/x/f3277b2c9587c5c7",
    "timestamp": "2025-04-25T15:55:11Z"
  },
  {
    "title": "Fox News’ Jennifer Griffin Torches Team Trump Over Russia Talks: Putin ‘Is Laughing’",
    "description": "Fox News' Jennifer Griffin torched the Trump administration over its approach to negotiating an end to Russia's war on Ukraine.\nThe post Fox News’ Jennifer Griffin Torches Team Trump Over Russia Talks: Putin ‘Is Laughing’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/fox-news-jennifer-griffin-torches-team-trump-over-russia-talks-putin-is-laughing/",
    "timestamp": "2025-04-25T15:55:03Z"
  },
  {
    "title": "Trump's 'Vladimir, STOP!' Plea Sparks Avalanche of Jokes, Memes",
    "description": "Social media users were quick to give the president's Truth Social post the meme treatment.",
    "link": "https://www.newsweek.com/trump-vladimir-stop-memes-jokes-ukraine-2064185",
    "timestamp": "2025-04-25T15:54:36Z"
  },
  {
    "title": "Donald Trump claims to have received call from Xi Jinping and to have cut ‘200 deals’ on trade - Financial Times",
    "description": "Donald Trump claims to have received call from Xi Jinping and to have cut ‘200 deals’ on tradeFinancial Times China Rejects Trump Claim of Tariff Talks With XiThe New York Times Trump and China can't even agree on if Trump and China are having trade talksqz.c…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177139083",
    "timestamp": "2025-04-25T15:53:44Z"
  },
  {
    "title": "Trump Says He Wouldn’t ‘100 Percent’ Agree America Should Be Ruled by Laws, Not Men",
    "description": "Donald Trump said in a wide-ranging interview with Time that he isn't \"100 percent\" in agreement that the United State is a nation of laws, not men.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-time-interview-us-nation-laws-1235325085/",
    "timestamp": "2025-04-25T15:53:35Z"
  },
  {
    "title": "EU, US should de-escalate and negotiate trade deal: IMF Europe director",
    "description": "The United States and European Union need to “de-escalate” and “negotiate a deal” to help boost lackluster growth on the continent, the International Monetary Fund’s Europe director said Friday. “In our discussions with European leaders, I don’t sense any dif…",
    "link": "https://www.digitaljournal.com/world/eu-us-should-de-escalate-and-negotiate-trade-deal-imf-europe-director/article",
    "timestamp": "2025-04-25T15:52:32Z"
  },
  {
    "title": "Proposed pharma tariffs may spike US drug prices by 12.9%: EY report",
    "description": "The pharmaceutical industry is warning that such tariffs could disrupt supply chains, raise production costs, hurt export competitiveness, and endanger up to 490,000 export-related jobs.",
    "link": "https://www.thehindubusinessline.com/news/world/proposed-pharma-tariffs-may-spike-us-drug-prices-by-129-ey-report/article69491910.ece",
    "timestamp": "2025-04-25T15:51:22Z"
  },
  {
    "title": "EU, US Should De-escalate And Negotiate Trade Deal: IMF Europe Director",
    "description": "The United States and European Union need to \"de-escalate\" and \"negotiate a deal\" to help boost lackluster growth on the continent, the International Monetary Fund's Europe director said Friday.",
    "link": "https://www.ibtimes.com/eu-us-should-de-escalate-negotiate-trade-deal-imf-europe-director-3771416",
    "timestamp": "2025-04-25T15:51:10Z"
  },
  {
    "title": "Mitch McConnell Cautions Trump of Previous 'America First' Policy That 'Did Not Work For Us' in Objection to Tariffs: 'Try Something Different'",
    "description": "Sen. Mitch McConnell listed reasons why Donald Trump's plan to implement tariffs, comparing the administration's economic goals to previous plans.",
    "link": "https://www.ibtimes.com/mitch-mcconnell-cautions-trump-previous-america-first-policy-that-did-not-work-us-objection-3771409",
    "timestamp": "2025-04-25T15:50:08Z"
  },
  {
    "title": "Vitol Steps Up Venezuela Crude Buying Before US License Expires",
    "description": "Vitol Group has stepped up oil purchases in Venezuela in the final weeks of a US license that allows the world’s largest independent oil trader to do business in the sanctioned nation.",
    "link": "https://financialpost.com/pmn/business-pmn/vitol-steps-up-venezuela-crude-buying-before-us-license-expires",
    "timestamp": "2025-04-25T15:49:54Z"
  },
  {
    "title": "Trump can’t decide who to blame for a failing peace deal that would only lead to further conflict",
    "description": "European counterproposals reject most of the terms of Trump’s suggested peace deal.",
    "link": "https://theconversation.com/trump-cant-decide-who-to-blame-for-a-failing-peace-deal-that-would-only-lead-to-further-conflict-254841",
    "timestamp": "2025-04-25T15:49:29Z"
  },
  {
    "title": "USDA Makes It Tougher for Illegals to Get Food Stamps",
    "description": "The Trump administration is cracking down on illegal immigrants using food stamps by instructing state agencies to increase verification.  Agriculture Secretary Brooke Rollins and Acting... Read More\nThe post USDA Makes It Tougher for Illegals to Get Food Sta…",
    "link": "https://www.dailysignal.com/2025/04/25/usda-makes-it-tougher-for-illegals-to-get-food-stamps/",
    "timestamp": "2025-04-25T15:49:14Z"
  },
  {
    "title": "Talk of raising taxes on millionaires swirls as Republicans draft Trump’s ‘big, beautiful bill’",
    "description": "Trump dismissed a tax hike on millionaires as “disruptive.”",
    "link": "https://www.bostonherald.com/2025/04/25/congress-tax-cuts/",
    "timestamp": "2025-04-25T15:49:02Z"
  },
  {
    "title": "SAP NetWeaver zero-day allegedly exploited by an initial access broker",
    "description": "A zero-day in SAP NetWeaver is potentially being exploited, putting thousands of internet-facing applications at risk. Researchers warn that a zero-day vulnerability, tracked as CVE-2025-31324 (CVSS score of 10/10), in SAP NetWeaver is potentially being explo…",
    "link": "https://securityaffairs.com/176983/hacking/sap-netweaver-zero-day-allegedly-exploited-by-an-initial-access-broker.html",
    "timestamp": "2025-04-25T15:48:27Z"
  },
  {
    "title": "Jon Voight plans to present Trump with ideas for boosting Hollywood production",
    "description": "Actor Jon Voight and his manager, Steven Paul, intend to present President Donald Trump with a suite of ideas to ramp up American film and television production.",
    "link": "https://www.nbcnews.com/pop-culture/movies/jon-voight-donald-trump-hollywood-production-boosting-ideas-rcna202982",
    "timestamp": "2025-04-25T15:47:47Z"
  }
]