[
  {
    "title": "McConnell rips Pentagon's 'isolationists and restrainers' after Trump restarts Ukraine aid",
    "description": "Sen. Mitch McConnell praised President Donald Trump for walking back a pause on weapons shipments to Ukraine while chastising \"isolationists and restrainers\" in his orbit for moves that he said undermine U.S. credibility abroad. \nThe latest broadside from the…",
    "link": "https://biztoc.com/x/49c05967f73a948f",
    "timestamp": "2025-07-08T17:49:15Z"
  },
  {
    "title": "Witkoff on hostage deal: Gaps have closed, hopeful for agreement by end of week",
    "description": "US Special envoy says the 4 main disagreements on a ceasefire deal with Hamas have been reduced to 1.",
    "link": "https://www.israelnationalnews.com/news/411343",
    "timestamp": "2025-07-08T17:48:47Z"
  },
  {
    "title": "Markets are ignoring the latest round of Trump’s tariffs, but ‘at some point the rubber has to hit the road,’ UBS strategist says",
    "description": "Since cratering in April, stocks have rebounded, even as the White House gears up for more tariffs.",
    "link": "https://fortune.com/2025/07/08/trump-tariffs-stock-prices/",
    "timestamp": "2025-07-08T17:48:36Z"
  },
  {
    "title": "Review of World Affairs",
    "description": "* Dalai Lama Announces Clear Succession Plan * The Supreme U.S. Leader By Shashi P.B.B. Malla Dalai Lama Not the […]\nThe post Review of World Affairs appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/07/08/review-of-world-affairs-56/",
    "timestamp": "2025-07-08T17:48:00Z"
  },
  {
    "title": "Medical students fret over the new student loan cap in the 'big, beautiful bill'",
    "description": "A provision tucked inside a sweeping bill signed into law by Trump last week will make it harder for aspiring doctors to finance their education as the country faces a growing shortage in that profession.",
    "link": "https://www.nbcnews.com/politics/congress/medical-students-fret-student-loan-cap-big-beautiful-bill-rcna217228",
    "timestamp": "2025-07-08T17:46:50Z"
  },
  {
    "title": "AI tech used to impersonate Rubio in messages to foreign and U.S. officials",
    "description": "The State Department is warning U.S. diplomats of attempts to impersonate Secretary of State Marco Rubio and possibly other officials using AI-driven technology.",
    "link": "https://www.pbs.org/newshour/nation/ai-tech-used-to-impersonate-rubio-in-messages-to-foreign-and-u-s-officials",
    "timestamp": "2025-07-08T17:46:12Z"
  },
  {
    "title": "Trump rolls out reciprocal tariffs for Japan, South Korea, others",
    "description": "The U.S. detailed the rates it will impose on imports from certain countries starting Aug. 1 in identical letters shared by the president Monday.",
    "link": "https://www.supplychaindive.com/news/trump-reciprocal-tariffs-return-aug-1-japan-korea-south-africa/752379/",
    "timestamp": "2025-07-08T17:46:00Z"
  },
  {
    "title": "Message in a bottle found in Kerry after 12 years at sea",
    "description": "A message in a bottle that spent nearly 13 years traversing the Atlantic Ocean has washed up on the shores of Co Kerry.",
    "link": "https://www.rte.ie/news/ireland/2025/0708/1522517-message-bottle-kerry/",
    "timestamp": "2025-07-08T17:45:51Z"
  },
  {
    "title": "60 Minutes Legend Tells Jon Stewart Paramount's $16 Million Trump Settlement Is a 'Tribute to the King' (Zachary Leeman/Mediaite)",
    "description": "Zachary Leeman / Mediaite:\n60 Minutes Legend Tells Jon Stewart Paramount's $16 Million Trump Settlement Is a ‘Tribute to the King’  —  Longtime 60 Minutes correspondent Steve Kroft blasted Paramount's $16 million settlement with President Donald Trump as a “t…",
    "link": "https://www.memeorandum.com/250708/p79",
    "timestamp": "2025-07-08T17:45:01Z"
  },
  {
    "title": "Trump Panics After Reporter Asks About Jeffrey Epstein",
    "description": "President Trump responded to a question about his administration’s closure of the Jeffrey Epstein case—something that has enraged his deepest base for days—with dismissiveness and indignation. At the president’s televised Cabinet meeting on Tuesday, a reporte…",
    "link": "https://newrepublic.com/post/197711/trump-panics-reporter-question-jeffrey-epstein",
    "timestamp": "2025-07-08T17:44:57Z"
  },
  {
    "title": "California Governor Newsom visits South Carolina",
    "description": "California Governor Gavin Newsom  launched a two-day tour of South Carolina. Here's where he plans to visit.",
    "link": "https://www.nbclosangeles.com/news/california-news/newsom-south-carolina/3740547/",
    "timestamp": "2025-07-08T17:44:31Z"
  },
  {
    "title": "Trump media files for 'crypto blue chip ETF' with SEC",
    "description": "Trump Media & Technology Group, a Florida company that operates the Truth Social media platform, announced Tuesday it had filed paperwork with the Securities and Exchange Commission for approval to launch the \"Crypto Blue Chip ETF\" later this year.",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-media-files-for-crypto-blue-chip-etf-with-sec/articleshow/122325914.cms",
    "timestamp": "2025-07-08T17:43:55Z"
  },
  {
    "title": "Gavin Newsom swings through South Carolina, where Democrats will play pivotal 2028 nominating role",
    "description": "California Gov. Gavin Newsom on Tuesday launched a two-day tour of South Carolina, meeting voters across rural areas — and some GOP strongholds — in the early-voting state, the latest signal that the Democrat is eyeing a 2028 run for president. Over the cours…",
    "link": "https://freerepublic.com/focus/f-news/4327537/posts",
    "timestamp": "2025-07-08T17:43:31Z"
  },
  {
    "title": "Trump threatens to impose up to 200% tariff on pharmaceuticals 'very soon'",
    "description": "Trump suggested that those levies would not go into effect immediately, saying he will \"give people about a year, year and a half\"",
    "link": "https://www.cnbc.com/2025/07/08/trump-threatens-pharmaceutical-tariffs-200.html",
    "timestamp": "2025-07-08T17:42:39Z"
  },
  {
    "title": "You May Want to Buy a Nintendo Switch 2 Before Tariffs Drive Up the Price",
    "description": "Higher tariffs are likely incoming, and Nintendo's Switch 2 may be caught in the storm this time.",
    "link": "https://gizmodo.com/you-may-want-to-buy-a-nintendo-switch-2-before-tariffs-drive-up-the-price-2000625679",
    "timestamp": "2025-07-08T17:41:34Z"
  },
  {
    "title": "Influencers urged to steer clear of hot topics during US immigration crackdown",
    "description": "Scrutiny from immigration authorities isn’t the only potential risk for politically outspoken influencers.",
    "link": "https://www.bostonherald.com/2025/07/08/influencers-steer-clear-hot-topics/",
    "timestamp": "2025-07-08T17:41:32Z"
  },
  {
    "title": "Trump Tariffs: Dr Reddy's To Lupin - Pharma Stocks To Be In Focus After Threat Of 200% Levies",
    "description": "Shares of companies like Gland Pharma Ltd., Aurobindo Pharma Ltd., Dr. Reddy's Laboratories Ltd., Zydus Lifesciences Ltd., Lupin Ltd., Glenmark Pharmaceuticals Ltd., Sun Pharmaceuticals Industries Ltd., Cipla Ltd. and Torrent Pharmaceuticals Ltd. will be in f…",
    "link": "https://www.ndtvprofit.com/markets/trump-tariffs-dr-reddys-to-lupin-pharma-stocks-to-be-in-focus-after-threat-of-200-levies",
    "timestamp": "2025-07-08T17:41:21Z"
  },
  {
    "title": "Macs and Apple Watches Face Price Pressure Under New U.S. Tariff",
    "description": "Starting August 1, the U.S. will impose a 36% tariff on products imported from Thailand, directly affecting Apple’s Macs and Apple Watch models manufactured there. The new rate marks one of the steepest increases in the latest round of reciprocal tariffs anno…",
    "link": "https://www.macobserver.com/news/macs-and-apple-watches-face-price-pressure-under-new-u-s-tariff/",
    "timestamp": "2025-07-08T17:41:05Z"
  },
  {
    "title": "Reporter Asks Pam Bondi About Missing Minute In Epstein Jail Footage",
    "description": "A reporter asked Attorney General Pam Bondi about the missing minute in the released footage of Jeffrey Epstein on the night that he died.",
    "link": "https://dailycaller.com/2025/07/08/pam-bondi-missing-minute-epstein-jail-footage/",
    "timestamp": "2025-07-08T17:40:59Z"
  },
  {
    "title": "Rubio imposter used AI to message high-level officials: report",
    "description": "An imposter posing as US Secretary of State Marco Rubio sent AI-generated voice and text messages to high-level officials and foreign ministers.\nThe post Rubio imposter used AI to message high-level officials: report appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/tech-science/rubio-imposter-used-ai-to-message-high-level-officials-report/article",
    "timestamp": "2025-07-08T17:39:05Z"
  },
  {
    "title": "Vance Rips NYC Mayoral Candidate’s ‘Bizarre Appeals’ to Identity Politics",
    "description": "Vice President JD Vance is criticizing New York City Democrat mayoral nominee Zohran Mamdani, accusing him of building a coalition of what Vance called “downwardly... Read More\nThe post Vance Rips NYC Mayoral Candidate’s ‘Bizarre Appeals’ to Identity Politics…",
    "link": "https://www.dailysignal.com/2025/07/08/vance-rips-nyc-mayoral-candidates-bizarre-appeals-to-identity-politics/",
    "timestamp": "2025-07-08T17:38:44Z"
  },
  {
    "title": "‘I Hear AOC’s Gonna Beat Him!’ Trump Taunts Chuck Schumer With Primary Challenge That Polls Show He’d Lose",
    "description": "\"I hear AOC is gonna beat him,\" mused President Donald Trump about Senate Minority Leader Chuck Schumer (D-NY) during a Cabinet meeting on Tuesday.\nThe post ‘I Hear AOC’s Gonna Beat Him!’ Trump Taunts Chuck Schumer With Primary Challenge That Polls Show He’d …",
    "link": "https://www.mediaite.com/media/news/i-hear-aocs-gonna-beat-him-trump-taunts-chuck-schumer-with-primary-challenge-that-polls-show-hed-lose/",
    "timestamp": "2025-07-08T17:38:41Z"
  },
  {
    "title": "Trump says ‘very nice’ EU will ‘probably’ receive new tariff rates on Thursday",
    "description": "The EU is “among the toughest” trade negotiators, Trump said on Tuesday.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/trump-says-very-nice-eu-will-probably-receive-new-tariff-rates-on-thursday/",
    "timestamp": "2025-07-08T17:38:39Z"
  },
  {
    "title": "The Dismantling of American Health Care",
    "description": "On July 4 President Donald Trump signed into law a piece of legislation that amounts to a declaration of war on the working-class and the sick. The “One Big Beautiful Bill Act” will slice more than $1 trillion from Medicaid over the next decade, stripping hea…",
    "link": "http://www.nybooks.com/online/2025/07/08/the-dismantling-of-american-health-care/",
    "timestamp": "2025-07-08T17:38:36Z"
  },
  {
    "title": "Jeffrey Epstein Referenced 'Personal Matters' in Emails Demanding Money",
    "description": "A D.O.J. and FBI memo said Jeffrey Epstein did not blackmail but a past probe found evidence he referenced \"personal matters.\"",
    "link": "https://www.newsweek.com/jeffrey-epstein-investigation-blackmail-evidence-doj-memo-2095838",
    "timestamp": "2025-07-08T17:38:18Z"
  },
  {
    "title": "'10 years in the making': Analyst marvels as Trump has Putin epiphany",
    "description": "CNN's Dana Bash played a \"very interesting\" clip on Inside Politics of President Donald Trump admitting that he's been jerked around by Vladimir Putin over ending the war in Ukraine.The clip was recorded during a cabinet meeting Tuesday, when Trump declared, …",
    "link": "https://www.rawstory.com/trump-putin-2672945153/",
    "timestamp": "2025-07-08T17:37:56Z"
  },
  {
    "title": "Trump says he will impose 50% tariff on copper imports",
    "description": "President Donald Trump said he will impose a 50% tariff on copper imports, and suggested more steep sector-specific duties are on the way",
    "link": "https://biztoc.com/x/0279cb53cb40d5ea",
    "timestamp": "2025-07-08T17:37:48Z"
  },
  {
    "title": "Former Bush Admin Official Slams Netanyahu’s Plan For Palestinians: ‘There’s A Word For This’",
    "description": "Israeli Prime Minister Benjamin Netanyahu recently told President Donald Trump that Palestinians have “a free choice” of relocating to other countries.",
    "link": "https://www.huffpost.com/entry/richard-haass-slams-benjamin-netanyahu-plan-palestinians_n_686d1926e4b0c11188c9b1ee",
    "timestamp": "2025-07-08T17:37:16Z"
  },
  {
    "title": "Samsung Forecasts 56% Drop in Profit Due to AI and Trade Woes",
    "description": "Trade and artificial intelligence-related headaches are reportedly behind a projected 56% drop in Samsung’s operating profits. [contact-form-7] That’s a steeper decline than market consensus, The Wall Street Journal reported Tuesday (July 8). Samsung is forec…",
    "link": "http://www.pymnts.com/earnings/2025/samsung-forecasts-56percent-drop-profit-ai-trade-woes/",
    "timestamp": "2025-07-08T17:36:19Z"
  },
  {
    "title": "Full List of Republicans Who Voted To Slash Weather Forecasting Funding",
    "description": "Republican votes to cut funding for weather forecasting have drawn criticism in the wake of deadly flooding in Texas.",
    "link": "https://www.newsweek.com/republicans-slash-weather-forecast-funding-big-beautiful-bill-2096027",
    "timestamp": "2025-07-08T17:35:37Z"
  },
  {
    "title": "In Rio, BRICS Tries to Play it Safe",
    "description": "The summit’s focus on economic development and climate still managed to provoke threats from Trump.",
    "link": "http://foreignpolicy.com/2025/07/08/brics-rio-summit-2025-brazil-lula-trump-tariffs-us/",
    "timestamp": "2025-07-08T17:35:34Z"
  },
  {
    "title": "Trump says US will announce semiconductor tariffs soon",
    "description": "Donald Trump declared upcoming tariffs on semiconductors. He also announced a 50% tariff on copper imports. Trump wants high tariffs on drug imports too. Warning letters were sent to 14 foreign leaders. He criticized wind power and defended coal. Trump reiter…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-will-announce-semiconductor-tariffs-soon/articleshow/122325648.cms",
    "timestamp": "2025-07-08T17:35:04Z"
  },
  {
    "title": "Trump dishes on Milley clash over leaving military equipment in Afghanistan: 'I knew he was an idiot",
    "description": "President Donald Trump disclosed he and former Chairman of the Joint Chiefs of Staff Gen. Mark Milley clashed over leaving equipment in Afghanistan as the U.S. withdrew troops in 2021. Trump, who historically has pushed to recover billions of dollars' worth o…",
    "link": "https://freerepublic.com/focus/f-news/4327535/posts",
    "timestamp": "2025-07-08T17:34:55Z"
  },
  {
    "title": "DOGE Cuts Contributed to Texas Flood Impact—Former NOAA Administrator",
    "description": "Former NOAA administrator Rick Spinrad said an NWS vacancy could have been why some people didn't receive flood warnings.",
    "link": "https://www.newsweek.com/doge-cuts-texas-floods-noaa-vacancy-2096151",
    "timestamp": "2025-07-08T17:34:28Z"
  },
  {
    "title": "Kristi Noem Paints Emotional Picture After Meeting Families at Flood-Ravaged Texas Camp: ‘My Little Girl Died in There’",
    "description": "A somber Homeland Security chief, Kristi Noem, recalled meeting family members of the youngest Texas flooding victims, including a devastated father who she said told her, “My little girl died in there” outside a ravaged Camp Mystic cabin. Noem admitted that …",
    "link": "https://www.mediaite.com/media/news/kristi-noem-paints-emotional-picture-after-meeting-families-at-flood-ravaged-texas-camp-my-little-girl-died-in-there/",
    "timestamp": "2025-07-08T17:34:22Z"
  },
  {
    "title": "Trump says he will impose 50% tariff on copper imports",
    "description": "President Donald Trump said he will impose a 50% tariff on copper imports, and suggested more steep sector-specific duties are on the way",
    "link": "https://www.cnbc.com/2025/07/08/trump-tariffs-copper-trade.html",
    "timestamp": "2025-07-08T17:34:03Z"
  },
  {
    "title": "Ted Cruz Was on Vacation During a Texas Disaster (Again)",
    "description": "The senator was spotted sightseeing in Athens on Saturday while the death toll from the Texas floods rose.",
    "link": "http://www.thecut.com/article/ted-cruz-vacation-during-texas-floods.html",
    "timestamp": "2025-07-08T17:33:37Z"
  },
  {
    "title": "The Great Cable TV Garage Sale continues: Now Lifetime, A&E, and the History Channel are on the block",
    "description": "Cable TV networks are declining, but they still generate profits, for now. The trick is figuring out what to do with them.",
    "link": "https://www.businessinsider.com/cable-tv-garage-sale-continues-lifetime-history-channels-2025-7",
    "timestamp": "2025-07-08T17:33:00Z"
  },
  {
    "title": "Trump supporters angry over Justice Department's Epstein memo",
    "description": "Some are calling for Attorney General Pam Bondi to resign.",
    "link": "https://abcnews.go.com/Politics/trump-supporters-angry-justice-departments-epstein-memo/story?id=123567461",
    "timestamp": "2025-07-08T17:32:38Z"
  },
  {
    "title": "Behind Dr. Phil’s Media Flameout",
    "description": "Even prior to Merit Street's bankruptcy filing, there were a number of indicators that Merit TV was undergoing a rocky start after its 2024 launch.",
    "link": "https://www.hollywoodreporter.com/business/business-news/dr-phil-merit-street-media-bankruptcy-2-1236309158/",
    "timestamp": "2025-07-08T17:30:58Z"
  },
  {
    "title": "Longtime '60 Minutes' Journalist Dubs Trump Settlement A 'Tribute To The King'",
    "description": "\"Yeah, it was a shakedown. That's what I'd call it,\" the now-retired Steve Kroft said.",
    "link": "https://www.huffpost.com/entry/steve-kroft-daily-show-60-minutes-trump-settlement_n_686d2be7e4b0dd2148c6f6fb",
    "timestamp": "2025-07-08T17:30:32Z"
  },
  {
    "title": "CNN panel rips 'partisans' for hijacking Texas flood tragedy for political gain",
    "description": "A \"CNN This Morning\" panel agreed that political finger-pointing distracts from addressing the real issues behind the deadly Texas flash flooding that's claimed more than 100 lives.",
    "link": "https://www.foxnews.com/media/cnn-panel-rips-partisan-voices-hijacking-texas-flood-tragedy-political-gain",
    "timestamp": "2025-07-08T17:30:25Z"
  },
  {
    "title": "'A Form of Torture': Detainees Allege Mistreatment at 'Alligator Alcatraz'",
    "description": "Detainees at the \"Alligator Alcatraz\" concentration camp in the Florida Everglades say they are enduring inhumane conditions, including inadequate and maggot-infested food, inability to bathe, flooding, and denial of religious practice, CBS News Miami reporte…",
    "link": "https://www.commondreams.org/news/alligator-alcatraz-human-rights",
    "timestamp": "2025-07-08T17:30:20Z"
  },
  {
    "title": "After Suspending Weapons Shipments to Ukraine, Trump Pivots AGAIN",
    "description": "Donald Trump is now promising to send more weapons to Ukraine after shipments were stopped last week, citing a decline in the United States' stockpile of weaponry. The public is continuing to get whiplash from this administration as it once again pivots on it…",
    "link": "https://www.shtfplan.com/headline-news/after-suspending-weapons-shipments-to-ukraine-trump-pivots-again",
    "timestamp": "2025-07-08T17:30:14Z"
  },
  {
    "title": "Trump Announces 50% Tariff on Imported Copper",
    "description": "President Donald Trump said Tuesday he plans to impose a fifty percent tariff on copper imports as part of a new wave of industry-specific trade measures, while suggesting pharmaceutical manufacturers may receive at least a year’s reprieve before facing steep…",
    "link": "https://www.breitbart.com/economy/2025/07/08/trump-announces-50-tariff-on-imported-copper/",
    "timestamp": "2025-07-08T17:30:09Z"
  },
  {
    "title": "Trump Maybe, Finally Realizes Putin Has Been Playing Him",
    "description": "President Donald Trump is growing increasingly frustrated with Russian President Vladimir Putin as the nation's war against Ukraine continues.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-realize-vladimir-putin-playing-him-1235380782/",
    "timestamp": "2025-07-08T17:30:08Z"
  },
  {
    "title": "Trump says he will impose 50% tariff on copper imports on Tuesday",
    "description": "WASHINGTON (Reuters) -President Donald Trump said he will announce a 50% tariff on imported copper on Tuesday, an effort to boost U.S. production of a metal ...",
    "link": "https://www.yahoo.com/news/trump-says-impose-50-tariff-172950808.html",
    "timestamp": "2025-07-08T17:29:50Z"
  },
  {
    "title": "Trump says he will impose 50% tariff on copper imports",
    "description": "\"Today, we're doing copper,\" U.S. President Donald Trump said, after listing a number of other tariffs the country has instituted. \"I believe the tariff on copper, we're going to make it 50 per cent.\"",
    "link": "https://www.cbc.ca/news/politics/trump-copper-tariffs-1.7579874",
    "timestamp": "2025-07-08T17:28:40Z"
  },
  {
    "title": "EU races to shield Airbus and German carmakers as US tariffs loom, Ferrari left out: Report",
    "description": "The European Union is scrambling to secure a trade deal with the US before 1 August to shield core industries from steep tariffs. Airbus stands to benefit most, while German carmakers like BMW and Mercedes could get a break through local US production. Howeve…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-races-to-shield-airbus-and-german-carmakers-as-us-tariffs-loom-ferrari-left-out-report/articleshow/122325293.cms",
    "timestamp": "2025-07-08T17:28:30Z"
  },
  {
    "title": "Macron urges UK to stand ‘shoulder to shoulder’ with EU in Westminster speech",
    "description": "The French president echoed a speech in the same venue by Jacques Chirac, calling for Europe to take greater responsibility for its own defence.",
    "link": "https://www.euractiv.com/section/politics/news/macron-urges-uk-to-stand-shoulder-to-shoulder-with-eu-in-westminster-speech/",
    "timestamp": "2025-07-08T17:28:05Z"
  },
  {
    "title": "Trump Admin Now Says It Wants To Deport Kilmar Abrego Garcia Before His Criminal Trial",
    "description": "District Judge Paula Xinis said getting answers out of the government has been like “nailing Jell-O to a wall.”",
    "link": "https://www.huffpost.com/entry/trump-admin-now-says-it-wants-to-deport-kilmar-abrego-garcia-before-his-criminal-trial_n_686d2c99e4b0c11188c9bf71",
    "timestamp": "2025-07-08T17:28:01Z"
  },
  {
    "title": "The 1600: Annoyance Politics",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-annoyance-politics-2096204",
    "timestamp": "2025-07-08T17:27:23Z"
  },
  {
    "title": "GOP congressman calls for Newsom to count illegal migrants getting state health benefits - NewsBreak",
    "description": "Texas Rep. Wesley Hunt sent a scathing letter to California's Gavin Newsom, calling on the governor to audit Medi-Cal provided to illegal immigrants.",
    "link": "https://www.newsbreak.com/share/4094991756362-gop-congressman-calls-for-newsom-to-count-illegal-migrants-getting-state-health-benefits?s=a2&amp;share_destination_id=MjMwNjE3ODUxLTE3NTE5OTU0OTc5MTQ%3D&amp;pd=0FbeElJW&amp;hl=en_US&amp;send_time=1751995497&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v1",
    "timestamp": "2025-07-08T17:27:13Z"
  },
  {
    "title": "Mass layoffs at Veteran Affairs dept soon? Thousands of jobs to be shed by end of this fiscal year",
    "description": "The United States Department of Veterans Affairs on Monday reversed course on its previously announced plans of reduction in force. The agency said department will lose 30,000' people through resignation and early retirement by October 2025. Earlier, pushed b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-mass-layoffs-at-veteran-affairs-dept-soon-thousands-of-jobs-to-be-shed-by-end-of-this-fiscal-year/articleshow/122325572.cms",
    "timestamp": "2025-07-08T17:27:03Z"
  },
  {
    "title": "Toyota and Honda play a giant role in US-Japan trade negotiations",
    "description": "President Donald Trump and his economic team are finding out that waging a one-sided trade war against the entire world may require more work than they initially thought.\nTrump declared Liberation Day on April 2, 2025, when he initiated a deluge of \"reciproca…",
    "link": "https://biztoc.com/x/0278708106aecee5",
    "timestamp": "2025-07-08T17:26:45Z"
  },
  {
    "title": "EU days away from tariff letter, says US President",
    "description": "President Donald Trump has said he is probably two days off from sending the European Union a letter disclosing the tariff rate on their exports to the US.",
    "link": "https://www.rte.ie/news/2025/0708/1522524-eu-us-tariffs/",
    "timestamp": "2025-07-08T17:24:01Z"
  },
  {
    "title": "Humanoid robot ‘graduates’ at Chinese high school ceremony as automation tech gains spotlight",
    "description": "Footage from the July 1 event shows Shuang Shuang marching toward the stage at the 25th Shuangshi High School graduation, carrying an empty tote bag.",
    "link": "https://nypost.com/2025/07/08/business/humanoid-robot-graduates-at-chinese-high-school-ceremony/",
    "timestamp": "2025-07-08T17:23:49Z"
  },
  {
    "title": "Trump admits Ukraine conflict difficult to tackle",
    "description": "The US president says he’s “unhappy” with his Russian counterpart, Vladimir Putin, and may consider imposing more sanctions on Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621206-trump-ukraine-difficult-tackle/",
    "timestamp": "2025-07-08T17:23:26Z"
  },
  {
    "title": "Trump Brushes Off Elon Musk’s Third Party, Insists ‘It’ll Help Us’ — Days After Slamming Musk’s ‘Disruption and Chaos’",
    "description": "Donald Trump dismissed Elon Musk's launch of a third political party, claiming it will only \"help\" him though he wasn't so sure about the Republican Party.\nThe post Trump Brushes Off Elon Musk’s Third Party, Insists ‘It’ll Help Us’ — Days After Slamming Musk’…",
    "link": "https://www.mediaite.com/media/news/trump-brushes-off-elon-musks-third-party-insists-itll-help-us-after-post-going-off-on-musk-creating-disruption-and-chaos/",
    "timestamp": "2025-07-08T17:23:07Z"
  },
  {
    "title": "State Department warns diplomats of AI impostor posing as Marco Rubio",
    "description": "The FBI has warned a “malicious text and voice messaging campaign” in which unidentified actors have impersonated senior U.S. government officials.",
    "link": "https://fortune.com/2025/07/08/marco-rubio-ai-impostor-state-department-diplomats/",
    "timestamp": "2025-07-08T17:22:08Z"
  },
  {
    "title": "Trump’s IRS says churches can now endorse political candidates from the pulpit",
    "description": "By allowing churches and other houses of worship to endorse candidates, the IRS is “fixing” a problem that doesn’t exist, while inviting new ones.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-irs-says-churches-can-now-endorse-political-candidates-pulpit-rcna217495",
    "timestamp": "2025-07-08T17:20:48Z"
  },
  {
    "title": "Trump slams reporter for asking about 'creep' Jeffrey Epstein during Cabinet meeting",
    "description": "President Trump criticized a reporter for asking about Jeffrey Epstein during a Cabinet meeting as Attorney General Pam Bondi addressed questions about the DOJ memo on Epstein's death.",
    "link": "https://www.foxnews.com/politics/trump-slams-reporter-asking-about-creep-jeffrey-epstein-during-cabinet-meeting",
    "timestamp": "2025-07-08T17:20:33Z"
  },
  {
    "title": "Trump threatens 200% tariff on foreign drugs",
    "description": "US President Donald Trump has confirmed a steep 50 percent tariff on copper imports and threatened up to 200 percent duties on pharmaceutical products. Speaking during a Cabinet meeting, he repeated his criticism of wind energy, pledged to defend the dollar’s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-threatens-200-tariff-on-foreign-drugs-copper-next/articleshow/122325455.cms",
    "timestamp": "2025-07-08T17:18:24Z"
  },
  {
    "title": "Trump Offers Mindboggling Definition of the Word “Skedaddle”",
    "description": "Step aside Merriam-Webster, Donald Trump is once again slinging definitions. If only they made any sense.  During a Cabinet meeting Tuesday, Trump lauded his own strike on three Iranian nuclear facilities last month as “a perfect military performance.” But as…",
    "link": "https://newrepublic.com/post/197707/donald-trump-definition-skedaddle-iran-cabinet",
    "timestamp": "2025-07-08T17:17:48Z"
  },
  {
    "title": "Analyst sends bold message on Nvidia stock amid Trump’s new tariffs",
    "description": "Here’s what could be next for Nvidia stock.",
    "link": "https://www.thestreet.com/investing/analyst-sends-bold-message-on-nvidia-stock-amid-trumps-new-tariffs",
    "timestamp": "2025-07-08T17:17:00Z"
  },
  {
    "title": "Netanyahu and Trump to meet again amid rising Gaza ceasefire hopes",
    "description": "Human rights groups condemn Israeli minister’s plan for ‘humanitarian city’",
    "link": "https://www.irishtimes.com/world/2025/07/08/netanyahu-and-trump-to-meet-again-amid-rising-gaza-ceasefire-hopes/",
    "timestamp": "2025-07-08T17:16:29Z"
  },
  {
    "title": "Trump threatens 'no extensions' on new Aug. 1 tariff deadline, warns of higher import taxes",
    "description": "Trump said Tuesday there would be “no extensions” granted to the new August 1 deadline for U.S. trading partners to negotiate new deals or face higher tariffs on goods imported from their countries.",
    "link": "https://www.nbcnews.com/business/business-news/trump-threatens-no-extensions-aug-1-tariff-deadline-what-countries-rcna217536",
    "timestamp": "2025-07-08T17:16:22Z"
  },
  {
    "title": "Trump says Musk's third party will 'help us' politically",
    "description": "United States President Donald Trump said during a Tuesday Cabinet meeting that Elon Musk's new political movement would benefit his administration.\n\"Third parties have always been good for ...",
    "link": "https://biztoc.com/x/73e7b6f0b063f355",
    "timestamp": "2025-07-08T17:15:47Z"
  },
  {
    "title": "Peter Schiff Says Trump's Tax Cuts 'Won't Grow The Economy.' Instead, He Warns They'll Lead To Higher Interest Rates And Inflation",
    "description": "Economist and market commentator Peter Schiff is cautioning against President Donald Trump's latest tax and spending package, saying it could do more harm than good for the U.S. economy.\nThe Wrong Direction\nA day after Trump signed the bill into law during a …",
    "link": "https://biztoc.com/x/2bfb0fdfad4f4b88",
    "timestamp": "2025-07-08T17:15:47Z"
  },
  {
    "title": "Trump Media furthers push into crypto with third ETF filing",
    "description": "Trump Media & Technology Group Corp. is plowing deeper into the cryptocurrencies space with a new filing for an exchange-traded fund that would hold a number of digital assets including Bitcoin, Ether, Solana and others. \nA Tuesday filing showed the social-me…",
    "link": "https://biztoc.com/x/d879e790f8546871",
    "timestamp": "2025-07-08T17:15:39Z"
  },
  {
    "title": "Trump unveils 50% copper, 200% pharma tariffs",
    "description": "United States President Donald Trump announced on Tuesday that tariffs on pharmaceuticals would be unveiled \"very soon,\" explaining that they will reach 200%. Moreover, he said a 50% duty will be impo...",
    "link": "https://biztoc.com/x/08cf77504450518c",
    "timestamp": "2025-07-08T17:15:33Z"
  },
  {
    "title": "Trump says 50% tariff on copper coming Tuesday | CNN Business",
    "description": "President Donald Trump said a new 50% tariff on all copper imports will come Tuesday. However, he did not specify when the new tariff would take effect.",
    "link": "https://www.cnn.com/2025/07/08/business/trump-copper-tariff",
    "timestamp": "2025-07-08T17:15:32Z"
  },
  {
    "title": "Netanyahu meets Trump – Could a Gaza ceasefire deal emerge?",
    "description": "What does Netanyahu’s latest US visit mean for Palestinians in Gaza?",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/7/8/aje-onl-usa_netanyahuvisit_av_v3-080725",
    "timestamp": "2025-07-08T17:15:20Z"
  },
  {
    "title": "Comedian Details ‘Weird’ Kamala Harris Interview That Was So Bad It Never Aired",
    "description": "Kareem Rahma, in a resurfaced March interview, detailed a strange interview with former Vice President Kamala Harris that went so badly he didn't release it.",
    "link": "https://dailycaller.com/2025/07/08/comedian-details-weird-kamala-harris-interview-never-aired/",
    "timestamp": "2025-07-08T17:14:35Z"
  },
  {
    "title": "Musk and Yang have connected on the billionaire’s third party threat",
    "description": "As Elon Musk moves to create a third party to upend America’s political system, he’s spoken with one-time Democratic presidential candidate Andrew Yang about the nascent effort. Yang, the 2020 White House contender and founder of the independent Forward Party…",
    "link": "https://freerepublic.com/focus/f-chat/4327532/posts",
    "timestamp": "2025-07-08T17:14:23Z"
  },
  {
    "title": "Comex Copper surges to record after Trump calls for 50% tariff",
    "description": "(Bloomberg) -- Copper futures on the Comex surged as much as 17% after US President Donald Trump said he planned to implement a 50% tariff on imports of the ...",
    "link": "https://finance.yahoo.com/news/comex-copper-surges-record-trump-171406126.html",
    "timestamp": "2025-07-08T17:14:06Z"
  },
  {
    "title": "Forced out because she’s transgender, Fairchild technical sergeant awaits ‘voluntary separation’",
    "description": "After President Donald Trump was elected, Tech. Sgt. Rylee Marcotte of the Air Force knew that despite almost 13 years of service, she would be a target.",
    "link": "https://www.idahostatejournal.com/news/local/forced-out-because-she-s-transgender-fairchild-technical-sergeant-awaits-voluntary-separation/article_eebba7f5-12c8-415a-b151-1d20707d24e7.html",
    "timestamp": "2025-07-08T17:13:34Z"
  },
  {
    "title": "Dan Osborn's Chances of Beating Republican Pete Ricketts in Nebraska",
    "description": "Osborn, an independent, made his 2026 Senate bid official on Tuesday.",
    "link": "https://www.newsweek.com/dan-osborn-chances-beating-pete-ricketts-nebraska-senate-2096186",
    "timestamp": "2025-07-08T17:12:57Z"
  },
  {
    "title": "FIFA Opens Office In Trump Tower",
    "description": "FIFA has strengthened their connection to President Donald Trump after opening an office in Trump Tower in New York City.",
    "link": "https://dailycaller.com/2025/07/08/fifa-trump-tower-office-gianni-infantino/",
    "timestamp": "2025-07-08T17:12:44Z"
  },
  {
    "title": "Noem says first responders in Texas ‘still looking for a lot of little girls’ missing after flood",
    "description": "Trump said he and his wife, Melania, will visit Texas on Friday.",
    "link": "https://www.bostonherald.com/2025/07/08/texas-floods-trump/",
    "timestamp": "2025-07-08T17:12:19Z"
  },
  {
    "title": "Furious Newsom Says He Won’t Stand Silently By While Trump Fixes California",
    "description": "SACRAMENTO, CA — As the federal government takes steps to attempt to solve a myriad of problems facing the Golden State, a furious Governor Gavin Newsom told reporters he won't stand silently by while Trump fixes California. While the Trump administration con…",
    "link": "https://freerepublic.com/focus/f-chat/4327531/posts",
    "timestamp": "2025-07-08T17:12:18Z"
  },
  {
    "title": "Israel outlines plans to pack Gaza’s population into a closed border zone. Here’s a closer look",
    "description": "Critics say it would amount to forcible displacement in violation of international law.",
    "link": "https://www.bostonherald.com/2025/07/08/mideast-wars-gaza-relocation-plan/",
    "timestamp": "2025-07-08T17:12:09Z"
  },
  {
    "title": "Israel outlines plans to pack Gaza’s population into a closed border zone. Here’s a closer look",
    "description": "Critics say it would amount to forcible displacement in violation of international law.",
    "link": "https://www.denverpost.com/2025/07/08/mideast-wars-gaza-relocation-plan/",
    "timestamp": "2025-07-08T17:12:09Z"
  },
  {
    "title": "Trump nominates 4 to Tennessee Valley Authority board after firing Biden picks",
    "description": "The selections follow Trump's firing of three Biden-nominated board members since late March. The board normally has nine members and requires five to make a quorum. It currently has three.",
    "link": "https://apnews.com/article/tennessee-valley-authority-tva-board-trump-nominees-e41de7e928884dc4dac8ab4f51027a3b?mc_cid=4dfb2fa052&mc_eid=12485be0da",
    "timestamp": "2025-07-08T17:12:09Z"
  },
  {
    "title": "What the Dollar’s Decline Reveals About America",
    "description": "Economist Kenneth Rogoff on a slow global shift away from the dollar.",
    "link": "http://foreignpolicy.com/2025/07/08/what-the-dollars-decline-reveals-about-america/",
    "timestamp": "2025-07-08T17:12:06Z"
  },
  {
    "title": "As Netanyahu meets Trump in Washington, what hope for peace in Gaza? Expert Q&A",
    "description": "While negotiators discuss the ‘framework’ for talks, the killing continues in Gaza.",
    "link": "https://theconversation.com/as-netanyahu-meets-trump-in-washington-what-hope-for-peace-in-gaza-expert-qanda-260722",
    "timestamp": "2025-07-08T17:11:54Z"
  },
  {
    "title": "Brics is sliding towards irrelevance – the Rio summit made that clear",
    "description": "Brics can only provide credible leadership in a changing global order when it addresses its many inner contradictions.",
    "link": "https://theconversation.com/brics-is-sliding-towards-irrelevance-the-rio-summit-made-that-clear-260653",
    "timestamp": "2025-07-08T17:11:24Z"
  },
  {
    "title": "Four reasons why many of us feel the global economy is not on our side",
    "description": "The global economic system is not set up for the good of all.",
    "link": "https://theconversation.com/four-reasons-why-many-of-us-feel-the-global-economy-is-not-on-our-side-252220",
    "timestamp": "2025-07-08T17:11:11Z"
  },
  {
    "title": "Trump again calls for Fed's Powell to 'resign immediately'",
    "description": "President Trump again said Jerome Powell should resign immediately, repeating a call he made last week, and noted that 'it’s OK with me' if Congress...",
    "link": "https://finance.yahoo.com/news/trump-again-calls-for-feds-powell-to-resign-immediately-171101223.html",
    "timestamp": "2025-07-08T17:11:01Z"
  },
  {
    "title": "How The New York Times is (still) getting gamed by the right",
    "description": "Lately, it has been difficult to ignore a tendency at The New York Times to make astonishingly bad news judgments. The paper's obsession with a view from nowhere is long-standing, but as Republicans increasingly circulate insane conspiracy theories and racist…",
    "link": "https://www.theverge.com/culture/700082/nyt-mamdani-news-judgment",
    "timestamp": "2025-07-08T17:10:44Z"
  },
  {
    "title": "Musk Is Struggling to Understand What's Happening Around Him, Says Former Tesla Exec",
    "description": "Investors are clearly worried Tesla CEO Elon Musk's promise to build a third US political party could do even more damage. The EV maker has been put through the wringer, from cratering sales worldwide to an enormous drop in year-over-year revenues. The compan…",
    "link": "https://futurism.com/musk-struggling-tesla",
    "timestamp": "2025-07-08T17:10:17Z"
  },
  {
    "title": "Florida moves to rename stretch of roadway 'President Donald J. Trump Boulevard' (Elizabeth Crisp/The Hill)",
    "description": "Elizabeth Crisp / The Hill:\nFlorida moves to rename stretch of roadway ‘President Donald J. Trump Boulevard’  —  A high-traffic stretch of roadway near President Trump's Mar-a-Lago resort in Palm Beach, Fla., could soon bear his name.  —  Palm Beach County co…",
    "link": "https://www.memeorandum.com/250708/p66",
    "timestamp": "2025-07-08T17:10:02Z"
  },
  {
    "title": "Trump Using Gitmo to Detain Migrants with Serious Criminal Histories, Including Crimes Against Children",
    "description": "President Donald Trump is using Guantanamo prison to detain migrants with \"serious\" criminal histories, according to the Department of Homeland Security (DHS).\nThe post Trump Using Gitmo to Detain Migrants with Serious Criminal Histories, Including Crimes Aga…",
    "link": "https://www.breitbart.com/immigration/2025/07/08/trump-using-gitmo-to-detain-migrants-with-serious-criminal-histories-including-crimes-against-children/",
    "timestamp": "2025-07-08T17:09:06Z"
  },
  {
    "title": "Trump Threatens 200% Tariff On Pharma Imports; Slaps 50% Levy On Copper",
    "description": "US President Donald Trump on Tuesday imposed 50% tariff on copper imports, while threatening to slap 200% tariff on pharmaceutical products. The announcement came in a press briefing following a Cabinet meeting.",
    "link": "https://www.ndtvprofit.com/global-economics/trump-threatens-200-tariff-on-pharma-imports-slaps-50-levy-on-copper",
    "timestamp": "2025-07-08T17:08:05Z"
  },
  {
    "title": "MSNBC’s Lawrence O’Donnell Torches Trump In Scathing Rant On Deadly Floods: ‘Doesn’t Know What He’s Doing’",
    "description": "Lawrence O’Donnell tore into Trump over the deadly Texas floods that have claimed more than 100 lives, telling viewers Trump \"doesn't know what he's doing.\"\nThe post MSNBC’s Lawrence O’Donnell Torches Trump In Scathing Rant On Deadly Floods: ‘Doesn’t Know Wha…",
    "link": "https://www.mediaite.com/media/news/msnbcs-lawrence-odonnell-torches-trump-in-scathing-rant-on-deadly-floods-doesnt-know-what-hes-doing/",
    "timestamp": "2025-07-08T17:07:51Z"
  },
  {
    "title": "German exports to US tumble as Berlin urges quick trade deal",
    "description": "German exports to the United States plummeted in May, official data showed.\nThe post German exports to US tumble as Berlin urges quick trade deal appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/german-exports-to-us-tumble-as-berlin-urges-quick-trade-deal/article",
    "timestamp": "2025-07-08T17:07:33Z"
  },
  {
    "title": "Trump calls China ‘fair’ while pushing tariffs to the brink",
    "description": "Trump Tariffs: Donald Trump insists China has been “very fair” on trade, despite record tariffs, strategic minerals warfare, and threats of new levies that could shake global supply chains. This piece unpacks what’s really at stake: minerals that run everythi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-china-fair-while-pushing-tariffs-to-the-brink/articleshow/122325352.cms",
    "timestamp": "2025-07-08T17:06:31Z"
  }
]