[
  {
    "title": "UN chief defends science and weather forecasting as Trump threatens both",
    "description": "The United Nations chief has delivered a strong defense of science and weather forecasting as the Trump administration threatens both",
    "link": "https://abcnews.go.com/US/wireStory/chief-defends-science-weather-forecasting-trump-threatens-126753529",
    "timestamp": "2025-10-22T13:17:44Z"
  },
  {
    "title": "Michael J Fox compares Parkinson’s to a bully: ‘It’s all about how you stand up to them’",
    "description": "The ‘Back to the Future’ actor was diagnosed with the disease when he was just 29",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/michael-j-fox-parkinsons-disease-health-latest-b2850030.html",
    "timestamp": "2025-10-22T13:16:39Z"
  },
  {
    "title": "White House responds to Kenny Loggins’ demand it stop using ‘Danger Zone’ with retort: ‘I FEEL THE NEED FOR SPEED’",
    "description": "\"Too many people are trying to tear us apart, and we need to find new ways to come together,” Loggins wrote on his website.",
    "link": "https://fortune.com/2025/10/22/kenny-loggins-white-house-danger-zone-video-no-kings-protest-trump/",
    "timestamp": "2025-10-22T13:14:46Z"
  },
  {
    "title": "Glamour profession",
    "description": "John Ganz has a very perceptive essay on the lumpen scum who make up the MAGA base, and prop up Trump’s thoroughly criminal regime: I’m sure by this point we’ve all seen some horrific videos of ICE abductions of migrants. Something looks off about those guys:…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/glamour-profession-2",
    "timestamp": "2025-10-22T13:14:32Z"
  },
  {
    "title": "Trump pick for religious freedom envoy visits Holy Land, cites strong US-Israel bond",
    "description": "Baptist pastor Mark Walker discusses U.S.-Israel spiritual bond and plans to combat global religious persecution after Trump nomination as international religious freedom ambassador.",
    "link": "https://www.foxnews.com/world/trump-pick-religious-freedom-envoy-visits-holy-land-cites-strong-us-israel-bond",
    "timestamp": "2025-10-22T13:11:25Z"
  },
  {
    "title": "Israel returns 30 Palestinian bodies to Gaza: health ministry in Hamas-run territory",
    "description": "On Wednesday, Israel handed over 30 Palestinian bodies to Gaza, marking a total of 195 returned as outlined in the ceasefire agreement. The identification of two more Israeli hostages' remains adds to the somber count, with 15 hostages' remains returned since…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-returns-30-palestinian-bodies-to-gaza-health-ministry-in-hamas-run-territory/articleshow/124741699.cms",
    "timestamp": "2025-10-22T13:10:45Z"
  },
  {
    "title": "Trump nominee embroiled in Nazi text message controversy withdraws from federal watchdog consideration",
    "description": "President Donald Trump ’s pick to lead a federal watchdog agency withdrew from consideration Tuesday evening, after his offensive text messages were made public and GOP senators revolted.\nPaul Ingrassia, who was nominated to lead the Office of Special Counsel…",
    "link": "https://biztoc.com/x/959b9d4f6553325b",
    "timestamp": "2025-10-22T13:10:10Z"
  },
  {
    "title": "Maine oyster farmer running for Senate in Maine tries to explain Marine tattoo that appears to be a Nazi SS ‘Totenkopf’ symbol",
    "description": "Graham Platner said he chose “a terrifying looking skull and crossbones\" because \"you know, skulls and crossbones are a pretty standard military thing.\"",
    "link": "https://fortune.com/2025/10/22/who-is-graham-platner-maine-senate-candidate-democrat-marine-tattoo/",
    "timestamp": "2025-10-22T13:09:58Z"
  },
  {
    "title": "Only Remaining Rape Gang Inquiry Chairman Candidate Withdraws From Running",
    "description": "The only candidate running to be chairman of Labour’s rape gang inquiry has withdrawn from the process, according to LBC. Former police chief Jim Gamble dropped out after another former candidate Annie Hudson withdrew yesterday. Labour hasn’t even set out the…",
    "link": "https://order-order.com/2025/10/22/only-remaining-rape-gang-inquiry-chairman-candidate-withdraws-from-running/",
    "timestamp": "2025-10-22T13:07:58Z"
  },
  {
    "title": "WATCH: New Jersey Democrat’s ad targeting Hispanic voters is so cringe, you almost have to look away",
    "description": "'My Spanish is not very good, but I want to speak directly to the Latina community'",
    "link": "https://www.wnd.com/2025/10/watch-new-jersey-democrats-ad-targeting-hispanic-voters/",
    "timestamp": "2025-10-22T13:07:19Z"
  },
  {
    "title": "A Cuban man deported by the US to Africa is on a hunger strike in prison, his lawyer says",
    "description": "A lawyer representing a Cuban man deported by the United States to Eswatini says he is on a hunger strike.",
    "link": "https://www.bostonherald.com/2025/10/22/us-deportee-eswatini-hunger-strike/",
    "timestamp": "2025-10-22T13:05:23Z"
  },
  {
    "title": "What Is Elon Musk’s Total Salary in 2025?",
    "description": "Elon Musk’s 2025 compensation is in the billions. Find out what's in the deal and what Musk has to do to take home is earnings.",
    "link": "https://finance.yahoo.com/news/elon-musk-total-salary-2025-130507630.html",
    "timestamp": "2025-10-22T13:05:07Z"
  },
  {
    "title": "Putin-Trump Hungary Meeting Reportedly Canceled After Poland Threatened to Intercept Russian Leader’s Plane",
    "description": "Reports surfaced late on Tuesday that Russia and America indefinitely postponed a proposed in-person meeting between President Donald Trump and Russian strongman Vladimir Putin in Budapest, Hungary.\nThe post Putin-Trump Hungary Meeting Reportedly Canceled Aft…",
    "link": "https://www.breitbart.com/europe/2025/10/22/putin-trump-hungary-meeting-reportedly-canceled-after-poland-threatened-to-intercept-russian-leaders-plane/",
    "timestamp": "2025-10-22T13:05:03Z"
  },
  {
    "title": "Gold extends rout in volatile pullback from historic surge",
    "description": "Gold extended losses in a choppy session, after suffering the worst rout in over 12 years on Tuesday. Read more.",
    "link": "https://financialpost.com/investing/gold-extends-volatile-pullback-historic-price",
    "timestamp": "2025-10-22T13:03:31Z"
  },
  {
    "title": "Trump nominee embroiled in Nazi text message controversy withdraws from federal watchdog consideration",
    "description": "President Donald Trump ’s pick to lead a federal watchdog agency withdrew from consideration Tuesday evening, after his offensive text messages were made public and GOP senators revolted. Paul Ingrassia, who was nominated to lead the Office of Special Counsel…",
    "link": "https://fortune.com/2025/10/22/who-is-paul-ingrassia-nazi-controversy-text-messages-trump-nominee/",
    "timestamp": "2025-10-22T13:03:26Z"
  },
  {
    "title": "Trump Jr. Makes Stunning Declaration on Fox Amid ‘No Kings’ Protest",
    "description": "Donald Trump Jr. made a stunning declaration on Fox News in an attempt to refute the premise of the massive No Kings protests that broke records this week.\nThe post Trump Jr. Makes Stunning Declaration on Fox Amid ‘No Kings’ Protest first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-jr-makes-stunning-declaration-on-fox-amid-no-kings-protest/",
    "timestamp": "2025-10-22T13:02:08Z"
  },
  {
    "title": "Trump puts China on notice with 155% tariff threat - is a November market crash coming?",
    "description": "President Donald Trump has threatened to impose a sweeping 155% tariff on Chinese imports starting November 1, 2025, if the US and China fail to reach a new trade deal by that date. This aggressive tariff stance comes amid China's tightening of rare earth min…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-puts-china-on-notice-with-155-tariff-threat-is-a-november-market-crash-coming/articleshow/124740282.cms",
    "timestamp": "2025-10-22T13:02:00Z"
  },
  {
    "title": "Firebrand former SC senator wins back Upstate seat in special election",
    "description": "A former South Carolina GOP senator appears to have reclaimed the Upstate seat he lost nine years ago. Firebrand Republican Lee Bright eked out a win — with ...",
    "link": "https://scdailygazette.com/2025/10/22/firebrand-former-sc-senator-wins-back-upstate-seat-in-special-election/",
    "timestamp": "2025-10-22T13:00:22Z"
  },
  {
    "title": "Spanberger uses SpongeBob to mock Sears-Trump relationship, as president praises GOP nom",
    "description": "Obama endorses Spanberger for Virginia governor while Trump praises Earle-Sears but stops short of formal endorsement in heated gubernatorial race.",
    "link": "https://www.foxnews.com/politics/spanberger-uses-spongebob-mock-sears-trump-relationship-president-praises-gop-nom",
    "timestamp": "2025-10-22T13:00:05Z"
  },
  {
    "title": "Leftist Meltdowns Commence After White House Ballroom Addition Gets Underway",
    "description": "\"No president should be able to do what trump is doing to the White House right now. He doesn’t own the place. WE do. It’s OUR house. We’re just letting him live there for four years. He can’t tear down walls and sh**. It’s OUR house.\"\nThe post Leftist Meltdo…",
    "link": "https://legalinsurrection.com/2025/10/leftist-meltdowns-commence-after-white-house-ballroom-addition-gets-underway/",
    "timestamp": "2025-10-22T13:00:01Z"
  },
  {
    "title": "BP, JERA Halt US Offshore Wind Activities",
    "description": "JERA and BP's offshore wind joint venture has indefinitely shelved the proposed Beacon Wind project in the U.S.",
    "link": "https://www.rigzone.com/news/bp_jera_halt_us_offshore_wind_activities-22-oct-2025-182136-article/",
    "timestamp": "2025-10-22T13:00:00Z"
  },
  {
    "title": "Nancy Bailey: Remembering Why There’s Special Education Law",
    "description": "Nancy Bailey understands the need for special education services. She spent many years in the classroom as a teacher of students with disabilities. She was a principal and has a Masters and Ph.D. in the field. She is a relentless crusader for students, teache…",
    "link": "https://dianeravitch.net/2025/10/22/nancy-bailey-its-time-to-remember-why-special-education-was-created-and-funded/",
    "timestamp": "2025-10-22T13:00:00Z"
  },
  {
    "title": "Inside Mission Daybreak: VA’s effort to support innovative suicide prevention",
    "description": "VA’s director of data and analytics innovation said the program “is looking for what is the right solution for the ways that we want to optimize care, and sometimes that's technology, and sometimes it isn't.”",
    "link": "https://www.nextgov.com/artificial-intelligence/2025/10/inside-mission-daybreak-vas-effort-support-innovative-suicide-prevention/408954/",
    "timestamp": "2025-10-22T13:00:00Z"
  },
  {
    "title": "'Wrong': Fact checker swats down Trump claims about the Insurrection Act",
    "description": "CNN's Daniel Dale thoroughly fact-checked President Donald Trump's false claims about the Insurrection Act, which he's threatened to invoke to deploy troops into cities across the country.A collection of laws passed early in American history grant presidents …",
    "link": "https://www.rawstory.com/insurrection-act-2674222148/",
    "timestamp": "2025-10-22T12:59:55Z"
  },
  {
    "title": "Trump-Putin Summit Put on Hold After Ceasefire Setback",
    "description": "A White House official says that talks on the planning of a potential summit between President Donald Trump and Russia’s Vladimir Putin has hit a setback after Russia’s foreign minister insisted that they would not agree to an immediate ceasefire without guar…",
    "link": "https://biztoc.com/x/47707b62c2fd5b59",
    "timestamp": "2025-10-22T12:58:01Z"
  },
  {
    "title": "Trump’s latest failed nominee makes the White House appear even more incompetent",
    "description": "Paul Ingrassia's nomination was an obvious debacle, but he's the latest edition to a growing list that makes the White House appear even more incompetent.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-latest-failed-nominee-makes-white-house-appear-even-incompetent-rcna239083",
    "timestamp": "2025-10-22T12:57:33Z"
  },
  {
    "title": "UN chief calls for 'fight' against climate disinformation",
    "description": "Geneva (AFP) – UN chief Antonio Guterres on Wednesday called for a fightback against climate disinformation ahead of next month's COP30 summit after US President Donald Trump branded climate change the \"greatest con job ever\". Guterres issued a robust defence…",
    "link": "https://freerepublic.com/focus/f-news/4347917/posts",
    "timestamp": "2025-10-22T12:56:17Z"
  },
  {
    "title": "Trump Demands DOJ Give Him $230 Million Prize For Getting Away With It",
    "description": "Sure why not, let's blow more taxpayer money up the clownfuck dictator's prolapsed asshole.",
    "link": "https://www.wonkette.com/p/trump-demands-doj-give-him-230-million",
    "timestamp": "2025-10-22T12:55:20Z"
  },
  {
    "title": "Mackenzie, Northleaf target retail with multi-asset private fund",
    "description": "Mackenzie Investments and Northleaf Capital are offering private assets to retail investors with a new multi-asset private fund. Read more.",
    "link": "https://financialpost.com/investing/mackenzie-northleaf-retail-multi-asset-private-fund",
    "timestamp": "2025-10-22T12:51:33Z"
  },
  {
    "title": "Mackenzie, Northleaf Target Retail With Multi-Asset Private Fund",
    "description": "Canadian fund managers Mackenzie Investments and Northleaf Capital Partners are extending their strategy of offering private assets to retail investors with a new product that aims to mimic a traditional growth and income portfolio.",
    "link": "https://financialpost.com/pmn/business-pmn/mackenzie-northleaf-target-retail-with-multi-asset-private-fund",
    "timestamp": "2025-10-22T12:51:33Z"
  },
  {
    "title": "Scott Jennings Warns Trump to Slow Down on Chasing That $230M Payout He’s Reportedly Seeking From DOJ",
    "description": "Jennings cautioned Trump to “table” his plan to sue the DOJ as he defended the president’s right to seek $230 million in damages for past legal battles.\nThe post Scott Jennings Warns Trump to Slow Down on Chasing That $230M Payout He’s Reportedly Seeking From…",
    "link": "https://www.mediaite.com/media/tv/scott-jennings-warns-trump-to-slow-down-on-chasing-that-230m-payout-hes-reportedly-seeking-from-doj/",
    "timestamp": "2025-10-22T12:51:27Z"
  },
  {
    "title": "For Salesforce, is Ohana over?",
    "description": "Benioff gets blasted by everyone -- except Elon Musk.",
    "link": "https://www.techtarget.com/searchcustomerexperience/opinion/For-Salesforce-is-Ohana-over",
    "timestamp": "2025-10-22T12:51:00Z"
  },
  {
    "title": "Gaza: After pressure and threats, Hamas says it is halting public executions, says WSJ",
    "description": "Gaza ceasefire on a tightrope, with the Americans trying to convince Israel and Hamas to stay on the path of diplomacy\nThe post Gaza: After pressure and threats, Hamas says it is halting public executions, says WSJ appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/22/gaza-after-pressure-and-threats-hamas-says-it-is-halting-public-executions-says-wsj/",
    "timestamp": "2025-10-22T12:49:00Z"
  },
  {
    "title": "Tesla's earnings report means another chance to transition it from EV to AI",
    "description": "Tesla has been subtly pivoting its strategy for years to be considered an AI company, but it's now reaching a tipping point.",
    "link": "https://www.businessinsider.com/teslas-earnings-preview-ai-strategy-robotaxis-humanoids-evs-2025-10",
    "timestamp": "2025-10-22T12:48:41Z"
  },
  {
    "title": "USTR Greer: Trump and Xi's meeting on schedule",
    "description": "United States Trade Representative (USTR) Jamieson Greer remarked on Wednesday that the meeting between President Donald Trump and Chinese leader Xi Jinping at the Asia-Pacific Economic Cooperation's ...",
    "link": "https://biztoc.com/x/442898496dabffab",
    "timestamp": "2025-10-22T12:47:20Z"
  },
  {
    "title": "Government Shutdown Enters Day 22 With No End in Sight",
    "description": "As the government shutdown enters Day 22, Oregon Democratic Sen. Jeff Merkley gave an all-night marathon speech on the Senate floor protesting President Donald Trump. Meanwhile, Trump is suggesting he would meet with Democratic leaders only after the shutdown…",
    "link": "https://biztoc.com/x/5ce0d39fb3648be9",
    "timestamp": "2025-10-22T12:47:14Z"
  },
  {
    "title": "Saudi Prince MBS To Meet Trump To Discuss Defense Pact, Trade Deals",
    "description": "Saudi Crown Prince Mohammed bin Salman will visit Washington, D.C., on November 18–19 for talks with President Donald Trump — his first U.S. trip since 2018.\nThe visit marks a major step in restoring his global image following the fallout from the murder of j…",
    "link": "https://biztoc.com/x/e089351a6873f6fe",
    "timestamp": "2025-10-22T12:46:58Z"
  },
  {
    "title": "Gold slide continues, stocks keep calm",
    "description": "LONDON/SINGAPORE (Reuters) -The shine was threatening to come off one of the year's best-performing trades on Wednesday as gold extended its sharpest drop in...",
    "link": "https://finance.yahoo.com/news/gold-slide-continues-stocks-keep-124523367.html",
    "timestamp": "2025-10-22T12:45:23Z"
  },
  {
    "title": "Oil Price Today: Prices rise due to geopolitical tensions. Here's Brent crude, WTI prices, US dollar index, FTSE 100, market analysts recommendations",
    "description": "Oil price today rose as supply concerns and geopolitical tensions impacted markets. Brent crude reached $62.21 per barrel, while WTI hit $58.12. Optimism over US–China trade talks and US strategic petroleum reserve refills also supported prices. Market analys…",
    "link": "https://economictimes.indiatimes.com/news/international/us/oil-price-today-prices-rise-due-to-geopolitical-tensions-heres-brent-crude-wti-prices-us-dollar-index-ftse-100-market-analysts-recommendations-supply-concerns-trade-negotiations-strategic-petroleum-reserves-us-crude-inventory-data-currency-and-equities/articleshow/124741073.cms",
    "timestamp": "2025-10-22T12:45:10Z"
  },
  {
    "title": "The US forces threatening Venezuela (Financial Times)",
    "description": "Financial Times:\nThe US forces threatening Venezuela  —  Donald Trump has made no secret of his desire to see Nicolás Maduro ousted.  Here are the forces he has sent to the region  —  Three US B-52 bombers took off from Barksdale Air Force Base in the state o…",
    "link": "https://www.memeorandum.com/251022/p25",
    "timestamp": "2025-10-22T12:45:00Z"
  },
  {
    "title": "Is JD Vance right in blaming left for political violence in the US?",
    "description": "Vance claims left-wing violence is on the rise, but long-term data show right-wing attacks have been far higher.",
    "link": "https://www.aljazeera.com/news/2025/10/22/is-jd-vance-right-in-blaming-left-for-political-violence-in-the-us",
    "timestamp": "2025-10-22T12:44:36Z"
  },
  {
    "title": "UN Chief Calls For 'Fight' Against Climate Disinformation",
    "description": "UN chief Antonio Guterres on Wednesday called for a fightback against climate disinformation ahead of next month's COP30 summit after US President Donald Trump branded climate change the \"greatest con job ever\".",
    "link": "https://www.ibtimes.com/un-chief-calls-fight-against-climate-disinformation-3788029",
    "timestamp": "2025-10-22T12:42:21Z"
  },
  {
    "title": "Putin directs drills of Russian nuclear forces as his summit with Trump is put on hold",
    "description": "Putin directed drills of Russia's strategic nuclear forces that featured practice missile launches.",
    "link": "https://www.bostonherald.com/2025/10/22/trump-putin-nuclear-forces-drills/",
    "timestamp": "2025-10-22T12:41:45Z"
  },
  {
    "title": "LIVE: Rayner Delivers Commons Resignation Speech",
    "description": "Angela Rayner is in the Commons to deliver her resignation speech. Her first big public appearance since that tax scandal...",
    "link": "https://order-order.com/2025/10/22/live-rayner-delivers-commons-resignation-speech/",
    "timestamp": "2025-10-22T12:40:41Z"
  },
  {
    "title": "Democrat Forces Unpaid Capitol Police To Stay Up All Night So He Can Rail Against Republicans",
    "description": "Democrats are refusing to pay support staff and Capitol Police during the government shutdown, but still forced them to work overnight Wednesday so two lawmakers could rail against the Trump administration from an empty Senate chamber. Democratic Oregon Sen. …",
    "link": "https://dailycaller.com/2025/10/22/jeff-merkley-floor-speech-government-shutdown/",
    "timestamp": "2025-10-22T12:39:00Z"
  },
  {
    "title": "Republican moderates press leadership on health credit extension - Roll Call",
    "description": "Moderate House Republicans are seeking a path forward on expiring health care tax credits.",
    "link": "https://rollcall.com/2025/10/22/republican-moderates-press-leadership-on-health-credit-extension/",
    "timestamp": "2025-10-22T12:36:18Z"
  },
  {
    "title": "Trump is adding a ballroom to the East Wing. Photos from the 1950s show the last major White House renovation.",
    "description": "Donald Trump isn't the first president to demolish parts of the White House. Harry Truman oversaw the last major renovation in the 1950s.",
    "link": "https://www.businessinsider.com/white-house-renovation-1950s-photos-history",
    "timestamp": "2025-10-22T12:36:02Z"
  },
  {
    "title": "Poland warns Putin: Enter our airspace and you will be forced down, sent to the Hague",
    "description": "Poland issued a stern warning to Russian President Vladimir Putin.  Polish officials stated his aircraft would be forcibly landed if he entered Polish airspace.  Putin would then be escorted to The Hague for war crimes prosecution.  This action stems from an …",
    "link": "https://economictimes.indiatimes.com/news/international/us/poland-warns-putin-enter-our-airspace-and-you-will-be-forced-down-sent-to-the-hague/articleshow/124740755.cms",
    "timestamp": "2025-10-22T12:33:15Z"
  },
  {
    "title": "Greg Gutfeld Commits Devastating Self-Own That Gets Crucified On Social Media",
    "description": "“The fact he can say this out loud without his head exploding is a marvel to behold,” one viewer said of the Fox News host.",
    "link": "https://www.huffpost.com/entry/greg-gutfeld-fox-news-the-five_n_68f8b0c9e4b077b8da433780",
    "timestamp": "2025-10-22T12:32:43Z"
  },
  {
    "title": "The XRP Shockwave Will Hit When No One’s Watching—Analyst",
    "description": "XRP flirted with stronger levels this week but slipped back as traders reassessed positions. According to a tweet by community figure Zach Rector, the next rally could arrive without much warning and push the token to a fresh all-time high. Related Reading: Y…",
    "link": "http://www.newsbtc.com/altcoin/the-xrp-shockwave-will-hit-when-no-ones-watching-analyst/",
    "timestamp": "2025-10-22T12:30:19Z"
  },
  {
    "title": "Trump says White House renovation is 'music to my ears' as criticism mounts",
    "description": "Preservation groups have called for a halt to plans for a new ballroom - but Trump says the work is a \"beautiful sound\".",
    "link": "https://www.bbc.com/news/articles/cy40lw22dyvo",
    "timestamp": "2025-10-22T12:30:00Z"
  },
  {
    "title": "Merkley holds overnight speech against 'Trump’s grave threats to democracy'",
    "description": "Sen. Jeff Merkley spoke overnight and is still delivering a marathon speech railing against President Donald Trump's \"grave threats to democracy.\"",
    "link": "https://www.foxnews.com/politics/dem-senator-continues-marathon-floor-speech-framing-trump-grave-threat-democracy",
    "timestamp": "2025-10-22T12:27:13Z"
  },
  {
    "title": "'It Must Stop': New Yorkers Protest After Violent ICE Raid on Canal Street Sparks Chaos",
    "description": "More scenes of chaos and community anger erupted Tuesday night in downtown New York City as federal agents under the orders of President Donald Trump targeted a popular area for street vendors, many of them immigrants struggling to get by, and shoppers lookin…",
    "link": "https://www.commondreams.org/news/ice-raid-canal-street",
    "timestamp": "2025-10-22T12:26:26Z"
  },
  {
    "title": "Herzog to Vance: ‘Your visit is a brick toward building peace’",
    "description": "President Isaac Herzog met US Vice President JD Vance in Jerusalem, thanking him and President Trump for their efforts to advance peace and expressing hope for the swift return of all hostages.",
    "link": "https://www.israelnationalnews.com/news/416644",
    "timestamp": "2025-10-22T12:26:23Z"
  },
  {
    "title": "UK removes Syria's HTS from 'terrorist' organizations list",
    "description": "The U.K. has removed Syria's Hayat Tahrir al-Sham (HTS) from its list of banned \"terrorist\" organizations, after the group ousted Bashar al-Assad last December and took control of government.",
    "link": "https://www.hurriyetdailynews.com/uk-removes-syrias-hts-from-terrorist-organizations-list-214919",
    "timestamp": "2025-10-22T12:25:26Z"
  },
  {
    "title": "Crypto trading firm FalconX to buy 21shares in ETF push",
    "description": "The Trump administration has aligned itself with the digital assets sector via long-awaited regulatory clarity, marking a stark turnaround from the years of ...",
    "link": "https://finance.yahoo.com/news/crypto-trading-firm-falconx-buy-122443431.html",
    "timestamp": "2025-10-22T12:24:43Z"
  },
  {
    "title": "Money-losing companies with colorful histories have pivoted to crypto",
    "description": "So far this year, billions of dollars have flowed into companies that have reinvented themselves by making the buying and holding of cryptocurrency their main focus",
    "link": "https://abcnews.go.com/Business/wireStory/money-losing-companies-colorful-histories-pivoted-crypto-126749813",
    "timestamp": "2025-10-22T12:20:53Z"
  },
  {
    "title": "White House Calls News Of Diddy Pardon “Fake News”",
    "description": "The White House has slammed a recent report claiming that President Donald Trump is seriously considering a pardon for Sean “Diddy” Combs. In a statement to Sky News US, a White House official claimed that there is “zero truth to the TMZ report, which we woul…",
    "link": "https://mediatakeout.com/white-house-calls-news-of-diddy-pardon-fake-news/",
    "timestamp": "2025-10-22T12:20:48Z"
  },
  {
    "title": "Zelensky launches Europe tour after Russia pummels Ukraine",
    "description": "Ukrainian President Volodymyr Zelensky visited Norway on Wednesday, the first leg of a European tour aimed at shoring up support for Kiev amid a string of deadly Russian attacks.",
    "link": "https://www.hurriyetdailynews.com/zelensky-launches-europe-tour-after-russia-pummels-ukraine-214916",
    "timestamp": "2025-10-22T12:18:37Z"
  },
  {
    "title": "Office of Space Commerce faces an uncertain future amid budget cuts and new oversight",
    "description": "While a recent executive order directed the Department of Commerce to elevate this office, budgetary actions threaten it.",
    "link": "https://theconversation.com/office-of-space-commerce-faces-an-uncertain-future-amid-budget-cuts-and-new-oversight-265710",
    "timestamp": "2025-10-22T12:18:12Z"
  },
  {
    "title": "Government Shutdown Enters Day 22 With No End in Sight",
    "description": "As the government shutdown enters Day 22, Oregon Democratic Sen. Jeff Merkley gave an all-night marathon speech on the Senate floor protesting President Donald Trump. Meanwhile, Trump is suggesting he would meet with Democratic leaders only after the shutdown…",
    "link": "https://www.today.com/video/democrat-protests-trump-with-marathon-speech-on-senate-floor-250366021637",
    "timestamp": "2025-10-22T12:16:33Z"
  },
  {
    "title": "Migrant Sent Back to France Under “One In, One Out” Scheme Returns to UK on Small Boat",
    "description": "A migrant returned to France under the laughable ‘one in, one out’ scheme is already back in Britain. According to the Guardian, he sailed across the channel again on a small boat because he “did not feel safe” in France. The latest figures showed 42 migrants…",
    "link": "https://order-order.com/2025/10/22/migrant-sent-back-to-france-under-one-in-one-out-scheme-returns-to-uk-on-small-boat/",
    "timestamp": "2025-10-22T12:16:06Z"
  },
  {
    "title": "Trump says he avoided a “wasted meeting” as plans for Putin talks on Ukraine are shelved",
    "description": "WASHINGTON DC: US President Donald Trump stated he did not want a “wasted meeting” after plans for face-to-face talks with Russian President Vladimir Putin about the war in Ukraine were postponed. Speaking at the White House on Tuesday, Trump suggested that a…",
    "link": "https://english.khabarhub.com/2025/22/502412/",
    "timestamp": "2025-10-22T12:15:39Z"
  },
  {
    "title": "Gold, Silver, Platinum and Palladium Price Today: Why has prices crashed and will it continue to fall? Here's price analysis and forecast",
    "description": "Gold, silver, platinum, and palladium prices fell sharply today as investors booked profits and the dollar strengthened. Spot gold fell to a near two-week low, while silver, platinum, and palladium also declined. Analysts expect volatility ahead due to U.S. i…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-silver-platinum-and-palladium-price-today-why-has-prices-crashed-and-will-it-continue-to-fall-wheres-price-analysis-and-forecast/articleshow/124740539.cms",
    "timestamp": "2025-10-22T12:15:36Z"
  },
  {
    "title": "College faculty are under pressure to say and do the right thing – the stress also trickles down to students",
    "description": "Faculty members say they are worried about job security but also whether they should be introducing certain topics, like gender, in their class or with colleagues.",
    "link": "https://theconversation.com/college-faculty-are-under-pressure-to-say-and-do-the-right-thing-the-stress-also-trickles-down-to-students-267400",
    "timestamp": "2025-10-22T12:15:28Z"
  },
  {
    "title": "NDP leadership contenders will make their pitches to voters in first forum",
    "description": "The five official candidates for the federal NDP leadership will get their first chance to sell themselves to party members at a forum in Ottawa on Wednesday evening.",
    "link": "https://www.nationalobserver.com/2025/10/22/news/ndp-leadership-contenders-will-make-their-pitches-voters-first-forum",
    "timestamp": "2025-10-22T12:15:03Z"
  },
  {
    "title": "Putin directs drills of Russian nuclear forces as his summit with Trump is put on hold",
    "description": "Russia conducted a significant test of its nuclear forces. The drills involved land, sea, and air components, demonstrating readiness and command capabilities. This exercise comes at a time of heightened global tensions. NATO also began its own annual nuclear…",
    "link": "https://economictimes.indiatimes.com/news/defence/vladimir-putin-oversees-readiness-test-of-russias-nuclear-forces/articleshow/124740790.cms",
    "timestamp": "2025-10-22T12:14:48Z"
  },
  {
    "title": "Trump-Putin Summit Put on Hold After Ceasefire Setback",
    "description": "A White House official says that talks on the planning of a potential summit between President Donald Trump and Russia’s Vladimir Putin has hit a setback after Russia’s foreign minister insisted that they would not agree to an immediate ceasefire without guar…",
    "link": "https://www.today.com/video/trump-putin-summit-put-on-hold-after-ceasefire-setback-250364485973",
    "timestamp": "2025-10-22T12:13:58Z"
  },
  {
    "title": "\"Nobody's Girl\": Virginia Giuffre's Memoir Details Sex Abuse by Epstein, Maxwell, Prince Andrew",
    "description": "Virginia Roberts Giuffre’s posthumous memoir has just been released, detailing how she was groomed by Jeffrey Epstein and his co-conspirator Ghislaine Maxwell, whom she met at Donald Trump’s Mar-A-Lago resort. In Nobody’s Girl: A Memoir of Surviving Abuse and…",
    "link": "https://www.democracynow.org/2025/10/22/virginia_giuffre",
    "timestamp": "2025-10-22T12:13:56Z"
  },
  {
    "title": "Capitol agenda: Ingrassia reveals the GOP’s red line",
    "description": "The collapse of Paul Ingrassia’s Office of Special Counsel nomination is exposing an exasperated Senate GOP, where even the MAGA faithful can be pushed only so far by a president demanding total fealty. \nHours after President Donald Trump hosted Senate Republ…",
    "link": "https://biztoc.com/x/8385f266fb76b568",
    "timestamp": "2025-10-22T12:13:49Z"
  },
  {
    "title": "Holy Warrior",
    "description": "Pete Hegseth is bringing his fundamentalist interpretation of Christianity into the Pentagon.",
    "link": "https://www.theatlantic.com/national-security/archive/2025/10/pete-hegseth-christianity-pentagon/684645/",
    "timestamp": "2025-10-22T12:13:00Z"
  },
  {
    "title": "GOP Senator From Bush Era To Run For Old Seat — But First Must Take Down Another Ex-Lawmaker",
    "description": "Former Republican New Hampshire Sen. John E. Sununu will make another run for his old seat which he held from 2003 to 2009, and the GOP hopes to flip in the midterms. Sununu, 61, declared his candidacy for New Hampshire’s 2026 Senate race on Wednesday morning…",
    "link": "https://dailycaller.com/2025/10/22/john-sununu-new-hampshire-senate-scott-brown/",
    "timestamp": "2025-10-22T12:12:20Z"
  },
  {
    "title": "There’s now mainstream political pressure to evict Prince Andrew from Royal Lodge",
    "description": "The British papers and politicians are piling pressure on Prince Andrew and King Charles in recent days. This hasn’t happened since 2019, when the palace completely misread the public reaction to Andrew’s BBC interview. The public and political backlash to th…",
    "link": "https://www.celebitchy.com/946451/theres_now_mainstream_political_pressure_to_evict_prince_andrew_from_royal_lodge/",
    "timestamp": "2025-10-22T12:10:16Z"
  },
  {
    "title": "Gold price prediction: Gold rate crashes today. Check analysts prediction for next few days after biggest daily fall since 2020",
    "description": "Gold rate prediction: On the technical front, gold price is supported by the 21-day moving average at $4,005.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-gold-rate-crashes-today-check-analysts-prediction-for-next-few-days-after-biggest-daily-fall-since-2020/articleshow/124740671.cms",
    "timestamp": "2025-10-22T12:10:12Z"
  },
  {
    "title": "Gold prices tumble 6%, silver cracks over 4% as US-China trade deal hopes spark profit booking. What should investors do?",
    "description": "Gold and silver futures on MCX slipped sharply on October 22 as easing US-China tensions triggered heavy profit booking. Gold fell 6% to Rs 1,20,600 per 10 gm, while silver dropped 4.2% amid global weakness and strong dollar trends.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/gold-prices-tumble-6-silver-cracks-over-4-as-us-china-trade-deal-hopes-spark-profit-booking-what-should-investors-do/articleshow/124740652.cms",
    "timestamp": "2025-10-22T12:09:08Z"
  },
  {
    "title": "Why planned Trump-Putin talks collapsed, and what it means for Ukraine",
    "description": "Trump proposed freezing Russian war on Ukraine at current front lines, and planned a meet with Putin. Then it collapsed.",
    "link": "https://www.aljazeera.com/news/2025/10/22/why-planned-trump-putin-talks-collapsed-and-what-it-means-for-ukraine",
    "timestamp": "2025-10-22T12:07:56Z"
  },
  {
    "title": "Forbes Daily: How Chatbots Respond To Concerns About An AI Bubble",
    "description": "Today’s Forbes Daily newsletter covers America’s Most Powerful Women In Sports, OpenAI's new browser, potential tariff checks, investors retreat from gold and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/10/22/forbes-daily-how-chatbots-respond-to-concerns-about-an-ai-bubble/",
    "timestamp": "2025-10-22T12:06:01Z"
  },
  {
    "title": "Ten-Oh tugboat pack more than 4,400 hydrogen fueled horsepower",
    "description": "Under the hood of the new “Ten-Oh” Japanese tugboat is the key is a novel marine engine system churning out more than 4,400 hp (!) from its dual, dual-fuel hydrogen-burning V12 engines. Is this – finally! – a great use case for hydrogen?\n\n\n\n more…",
    "link": "http://electrek.co/2025/10/22/ten-oh-tugboat-pack-more-than-4400-hydrogen-fueled-horsepower/",
    "timestamp": "2025-10-22T12:04:24Z"
  },
  {
    "title": "Cheryl Hines Left 'In A State of Shock and Distress' By Olivia Nuzzi's Tell-All Memoir Which 'Blindsided' Robert F. Kennedy Jr.",
    "description": "Cheryl Hines was left 'in a state of shock and distress' by release of Olivia Nuzzi's tell-all memoir which also 'blindsided' RFK Jr., according to new claims.",
    "link": "https://radaronline.com/p/robert-f-kennedy-jr-cheryl-hines-shock-distress-blindsided-release-tell-all-memoir-alleged-mistress-olivia-nuzzi/",
    "timestamp": "2025-10-22T12:02:54Z"
  },
  {
    "title": "Intel results to show if barrage of investments in chipmaker paying off",
    "description": "Intel's third-quarter results on Thursday will show whether a clutch of recent high-profile investments can shore up its strained finances as new CEO Lip-Bu Tan attempts to revive the ailing chipmaker. Multi billion-dollar investments from Nvidia and Japan's …",
    "link": "https://economictimes.indiatimes.com/tech/technology/intel-results-to-show-if-barrage-of-investments-in-chipmaker-paying-off/articleshow/124740550.cms",
    "timestamp": "2025-10-22T12:00:47Z"
  },
  {
    "title": "Stuck in Aurora ICE facility, more detainees are agreeing to leave the U.S. voluntarily",
    "description": "The government's goal, lawyers argue, is to create conditions inside ICE facilities that push immigrants to voluntarily leave or to accept a deportation order.",
    "link": "https://www.denverpost.com/2025/10/22/immigration-aurora-ice-deportation-trump/",
    "timestamp": "2025-10-22T12:00:42Z"
  },
  {
    "title": "Government enters longest full shutdown in US history with no end in sight",
    "description": "The ongoing government shutdown is breaking milestones as Democrats and Republicans are still far apart on federal spending.",
    "link": "https://www.foxnews.com/politics/government-enters-longest-full-shutdown-us-history-no-end-sight",
    "timestamp": "2025-10-22T12:00:24Z"
  },
  {
    "title": "Proud Boys Should Be Deputized to Hunt Migrants, Says GOP Candidate...",
    "description": "Jake Lang told Newsweek that the Proud Boys and other participants in the Capitol riot should carry out immigration enforcement.",
    "link": "https://www.newsweek.com/proud-boys-should-be-deputized-hunt-migrants-says-gop-candidate-10911466",
    "timestamp": "2025-10-22T12:00:03Z"
  },
  {
    "title": "Infiltrate The Deep State",
    "description": "<ul>\n<li>Thanks, John Roberts</li>\n<li>The New Pentagon Press Corps</li>\n<li>Open Up Your Eyes</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/infiltrate-deep-state",
    "timestamp": "2025-10-22T12:00:00Z"
  },
  {
    "title": "Obama Targets Hungary, Poland With ‘Organizing’ Campaign",
    "description": "Former President Barack Obama thinks nothing of trying to interfere in the internal politics of democratic U.S. allies in Europe, and in the process, thwarting his country’s... Read More\nThe post Obama Targets Hungary, Poland With ‘Organizing’ Campaign appear…",
    "link": "https://www.dailysignal.com/2025/10/22/obama-has-new-campaign-influence-foreign-elections/",
    "timestamp": "2025-10-22T12:00:00Z"
  },
  {
    "title": "Japan's New PM Pushes for Faster Nuclear Reactor Restarts",
    "description": "Japan’s newly elected Prime Minister, Sanae Takaichi, favors accelerating the restart of nuclear reactors as a way to reduce the G7 economy’s dependence on energy imports.   As part of its decarbonization plans, Japan has made a U-turn in nuclear energy polic…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Japans-New-PM-Pushes-for-Faster-Nuclear-Reactor-Restarts.html",
    "timestamp": "2025-10-22T12:00:00Z"
  },
  {
    "title": "Russia says Putin-Trump summit is still under preparation",
    "description": "MOSCOW (Reuters) -Russia said on Wednesday that it was still preparing for a potential summit between President Vladimir Putin and U.S. President Donald Trump, though no date had been set and that Putin - like Trump - did not want to waste his time. Read full…",
    "link": "https://www.thestar.com.my/news/world/2025/10/22/russia-says-putin-trump-summit-is-still-under-preparation",
    "timestamp": "2025-10-22T11:57:00Z"
  },
  {
    "title": "'First lady needs to hear': Concern raised that 'Putin is cynically using' Melania Trump",
    "description": "First lady Melania Trump has pledged to get Ukrainian children returned from Russian captivity, but her mission is fraught with high-stakes risks.President Donald Trump's wife last week hailed the return of eight Ukrainian children to their families, and whil…",
    "link": "https://www.rawstory.com/melania-trump-ukraine-children-use/",
    "timestamp": "2025-10-22T11:53:34Z"
  },
  {
    "title": "Intel results to show if barrage of investments in chipmaker paying off",
    "description": "Multi billion-dollar investments from Nvidia and Japan's SoftBank as well as an unprecedented U.S. government stake during the September quarter provided...",
    "link": "https://finance.yahoo.com/news/intel-results-show-barrage-investments-115313046.html",
    "timestamp": "2025-10-22T11:53:13Z"
  },
  {
    "title": "Netflix earnings, Anthropic's 'woke' problem, Travis Kelce's Six Flags stake and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/10/22/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-10-22T11:50:31Z"
  },
  {
    "title": "Gold Price Today: Why does Gold price continues to fall and will it rise again? Here's all about spot gold, gold futures, analysts insights, prediction and forecast",
    "description": "Gold price today declined as the dollar strengthened and traders booked profits after recent record highs. Spot gold fell to a near two-week low, extending Tuesday’s sharp losses. Investors await key U.S. inflation data and possible rate-cut signals from the …",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-today-why-does-gold-price-continues-to-fall-and-will-it-rise-again-heres-all-about-spot-gold-gold-futures-analysts-insights-prediction-and-forecast-u-s-dollar-global-economic-uncertainty-ftse-100-british-pound-brent-crude/articleshow/124739989.cms",
    "timestamp": "2025-10-22T11:48:49Z"
  }
]