[
  {
    "title": "US Private Sector Shed Jobs For First Time In Recent Years: ADP",
    "description": "The US private sector unexpectedly lost jobs in June, according to data from payroll firm ADP on Wednesday, a potential sign of labor market weakness amid uncertainty from President Donald Trump's tariffs.",
    "link": "https://www.ibtimes.com/us-private-sector-shed-jobs-first-time-recent-years-adp-3777453",
    "timestamp": "2025-07-02T13:36:13Z"
  },
  {
    "title": "How Democrat Mayors and Governors are unwittingly helping Trump deport illegal aliens",
    "description": "Dems are too clever by half. One cannot peruse X without reading a democrat whine about the treatment of illegal aliens. A host of democrat mayors and governors have pledged not to cooperate with ICE and the Feds but in so doing are actually helping Donald Tr…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326486/posts",
    "timestamp": "2025-07-02T13:35:52Z"
  },
  {
    "title": "'Alligator Alcatraz' Floods Within Day of Opening",
    "description": "Rainwater was seen seeping into the migrant detention center and onto cables on the floor after a rainstorm, according to video posted online.",
    "link": "https://www.newsweek.com/alligator-alcatraz-flooded-opening-day-donald-trump-migrant-detention-center-2093581",
    "timestamp": "2025-07-02T13:35:50Z"
  },
  {
    "title": "Maersk Estimates Effective US Tariffs Average 21% Currently",
    "description": "Maersk MAERSKb.CO estimates companies pay effective U.S. import tariffs of on average 21% relative to container load, the Danish shipping group said on Wednesday, less than half the rate before Washington paused its sweeping tariffs in April.",
    "link": "https://gcaptain.com/maersk-estimates-effective-us-tariffs-average-21-currently/",
    "timestamp": "2025-07-02T13:35:44Z"
  },
  {
    "title": "Trump pick to run federal watchdog: A 30-year-old who once shared a 9/11 conspiracy video and has ties to a Holocaust denier (CNN)",
    "description": "CNN:\nTrump pick to run federal watchdog: A 30-year-old who once shared a 9/11 conspiracy video and has ties to a Holocaust denier  —  The man President Donald Trump wants to put in charge of protecting whistleblowers - and rooting out government corruption - …",
    "link": "https://www.memeorandum.com/250702/p44",
    "timestamp": "2025-07-02T13:35:02Z"
  },
  {
    "title": "Paramount Global’s George Cheeks Defends CBS Settlement With Donald Trump",
    "description": "The morning after Paramount Global agreed to a $16 million payout to settle Donald Trump’s lawsuit against CBS and 60 Minutes, co-CEO George Cheeks stepped up to defend the move at the company’s annual shareholder meeting. In a brief Q&A, one stockholder aske…",
    "link": "http://deadline.com/2025/07/paramount-global-george-cheeks-defends-cbs-settlement-donald-trump-1236447662/",
    "timestamp": "2025-07-02T13:34:56Z"
  },
  {
    "title": "US private sector shed jobs for first time in recent years: ADP",
    "description": "The US private sector unexpectedly lost jobs in June, according to data from payroll firm ADP on Wednesday, a potential sign of labor market weakness amid...",
    "link": "https://www.yahoo.com/news/us-private-sector-shed-jobs-133403692.html",
    "timestamp": "2025-07-02T13:34:03Z"
  },
  {
    "title": "Trump administration withholds over $6 billion for after-school, summer programs and more",
    "description": "WASHINGTON (AP) — Day camp providers and schools are warning that a Trump administration funding freeze could wreck summer for low-income American families and wipe out some after-school programming next year",
    "link": "https://www.nbcnews.com/news/us-news/trump-administration-withholds-6-billion-school-summer-programs-rcna216456",
    "timestamp": "2025-07-02T13:32:27Z"
  },
  {
    "title": "Paramount Shareholders Approve Board Slate, Expanding to 7 Members",
    "description": "Mary Boies, Charles Ryan and Roanne Sragow Licht join the board as Judith McHale steps down\nThe post Paramount Shareholders Approve Board Slate, Expanding to 7 Members appeared first on TheWrap.",
    "link": "https://www.thewrap.com/paramount-shareholders-approve-board-slate/",
    "timestamp": "2025-07-02T13:30:41Z"
  },
  {
    "title": "Tesla sales fell 13% in the last three months as anti-Musk sentiment still has an effect",
    "description": "Sales of Tesla electric cars fell 13% in the last three months as boycotts over Elon Musk's political views continue to keep buyers away, a significant...",
    "link": "https://finance.yahoo.com/news/tesla-sales-fell-13-last-133012123.html",
    "timestamp": "2025-07-02T13:30:12Z"
  },
  {
    "title": "Colorado Capitol has new Trump portrait, after he railed over last one (Victoria Bisset/Washington Post)",
    "description": "Victoria Bisset / Washington Post:\nColorado Capitol has new Trump portrait, after he railed over last one  —  The White House donated a new portrait after President Donald Trump complained about the painting that had hung in Colorado's Capitol since 2019, the…",
    "link": "https://www.memeorandum.com/250702/p42",
    "timestamp": "2025-07-02T13:30:01Z"
  },
  {
    "title": "What's in the latest version of Trump's big bill that passed the Senate",
    "description": "Here's the latest on what's in the bill. There could be changes as GOP lawmakers continue to negotiate.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_2348d21f-b542-5a50-9d64-fb6e0ae15e06.html",
    "timestamp": "2025-07-02T13:30:00Z"
  },
  {
    "title": "Trump Says Lara Trump Should Replace Tillis in Senate",
    "description": "North Carolina Senator Thom Tillis said he won’t seek reelection following a primary threat from President Donald Trump.\n“As many of my colleagues have noticed over the last year, and at times even joked about, I haven’t exactly been excited about running for…",
    "link": "https://biztoc.com/x/5faa1b44ec826f96",
    "timestamp": "2025-07-02T13:29:24Z"
  },
  {
    "title": "CBS Chief George Cheeks Addresses Paramount’s Trump Lawsuit Settlement: Deal Allows Company Focus on ‘Core Objectives’",
    "description": "Nine hours after Paramount Global announced a $16 million payment to President Donald Trump to settle his “60 Minutes” lawsuit, Paramount co-CEO George Cheeks — who is the head of CBS — spoke about the deal at the media company’s 2025 annual shareholder meeti…",
    "link": "https://variety.com/2025/tv/news/cbs-george-cheeks-paramount-trump-lawsuit-settlement-core-objectives-1236446002/",
    "timestamp": "2025-07-02T13:28:59Z"
  },
  {
    "title": "6 Takeaways As Huge Student Loan Reforms Advance Through Congress",
    "description": "Major reforms to student loan repayment plans, loan forgiveness programs, and federal aid are on the cusp of enactment. Here are the big takeaways.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/07/02/6-takeaways-as-huge-student-loan-reforms-advance-through-congress/",
    "timestamp": "2025-07-02T13:28:25Z"
  },
  {
    "title": "July 4 a holiday in US? Check whether stock market, banks, FedEx are open or not",
    "description": "America commemorates its Independence Day every July 4th, marking the adoption of the Declaration of Independence in 1 776. In 2026, July 4 will mark the nation's 250th anniversary as an independent country. On this day, banks, stock market, FedEx services mi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-july-4-federal-holiday-check-whether-stock-market-banks-fedex-ups-are-open-or-not/articleshow/122207849.cms",
    "timestamp": "2025-07-02T13:28:02Z"
  },
  {
    "title": "Republican Holdouts",
    "description": "Plus: Zohran Mamdani doesn't understand what New York's families need, Lia Thomas titles revoked, and more...",
    "link": "https://reason.com/2025/07/02/republican-holdouts/",
    "timestamp": "2025-07-02T13:26:48Z"
  },
  {
    "title": "Grayscale Spot ETF Holding Ripple’s XRP, Solana, And Cardano Wins SEC Green Light",
    "description": "The SEC has approved Grayscale's Digital Large Cap Fund (GDLC) to convert into a spot crypto ETF, according to a Tuesday filing.",
    "link": "https://zycrypto.com/grayscale-spot-etf-holding-ripples-xrp-solana-and-cardano-wins-sec-green-light/",
    "timestamp": "2025-07-02T13:26:20Z"
  },
  {
    "title": "CBS Throws In Towel, Forks Over $16 Million To Trump Over Edited Harris ’60 Minutes’ Interview",
    "description": "Paramount agreed to pay $16 million to President Donald Trump to settle his lawsuit relating to the editing of a \"60 Minutes\" interview.",
    "link": "https://dailycaller.com/2025/07/02/cbs-throws-in-towel-forks-over-16-million-to-trump-over-edited-harris-60-minutes-interview/",
    "timestamp": "2025-07-02T13:24:20Z"
  },
  {
    "title": "Paramount to pay $16 million in settlement with Trump over ’60 Minutes’ interview",
    "description": "The parent company of CBS told media outlets that the money will go to Trump's future presidential library.",
    "link": "https://www.denverpost.com/2025/07/02/paramount-settles-trump-60-minutes-lawsuit/",
    "timestamp": "2025-07-02T13:23:57Z"
  },
  {
    "title": "Fact check: Trump lies again about gas prices, falsely claiming five states are at $1.99 | CNN Politics",
    "description": "Fact check: Trump lies again about gas prices, falsely claiming five states are at $1.99 | CNN Politicscnn.com",
    "link": "https://www.cnn.com/2025/07/02/politics/fact-check-trump-gas-prices",
    "timestamp": "2025-07-02T13:23:53Z"
  },
  {
    "title": "Tesla reports 14 percent drop in second-quarter vehicle deliveries",
    "description": "Tesla sales hit a new low, with the company reporting a 14 percent drop in second-quarter vehicle deliveries compared to a year ago.  The company said that it produced a total of 410,244 vehicles between April–June of this year, including 396,835 Model 3 and …",
    "link": "https://www.theverge.com/news/696473/tesla-q2-2025-sales-report-decrease-elon-musk-robotaxi",
    "timestamp": "2025-07-02T13:21:48Z"
  },
  {
    "title": "The bottom line: The bill is cruel. (Jennifer Rubin/The Contrarian)",
    "description": "Jennifer Rubin / The Contrarian:\nThe bottom line: The bill is cruel.  —  Republicans don't care about hurting people.  —  Senate Republicans certainly lack spine.  They are deathly afraid to cross Donald Trump, to put their cushy jobs at risk by provoking a p…",
    "link": "https://www.memeorandum.com/250702/p38",
    "timestamp": "2025-07-02T13:20:00Z"
  },
  {
    "title": "Students for Fair Admissions and Naval Academy File Motion to Vacate Opinion Allowing Academy to Use Race in Admissions",
    "description": "Imagine judging a trial, ruling for one party, and writing a 179-page opinion, only to find the same parties asking you to vacate your opinion and dismiss the case six months later! That’s exactly what happened to the federal district court judge who presided…",
    "link": "https://freerepublic.com/focus/f-news/4326484/posts",
    "timestamp": "2025-07-02T13:19:25Z"
  },
  {
    "title": "Leftover missile money? US Air Force spends ICBM funds to revamp Qatar’s gift jet to Trump",
    "description": "Trump Qatar jet Air Force upgrade sparks huge debate after the U.S. Air Force used leftover nuclear missile funds to retrofit a private Boeing 747-8 jet gifted by Qatar to Donald Trump. With nearly $400 million redirected from the Sentinel ICBM project, the j…",
    "link": "https://economictimes.indiatimes.com/news/international/us/leftover-missile-money-us-air-force-spends-icbm-funds-to-revamp-qatars-gift-jet-to-trump/articleshow/122206232.cms",
    "timestamp": "2025-07-02T13:18:46Z"
  },
  {
    "title": "MSNBC’s Jen Psaki Torches Trump ‘Alligator Alcatraz’ Tour in Blistering Commentary: ‘Cruelty Is the Priority!’",
    "description": "MSNBC host and former Biden White House press secretary Jen Psaki torched President Donald Trump over his \"Alligator Alcatraz\" tour.\nThe post MSNBC’s Jen Psaki Torches Trump ‘Alligator Alcatraz’ Tour in Blistering Commentary: ‘Cruelty Is the Priority!’ first …",
    "link": "https://www.mediaite.com/media/news/msnbcs-jen-psaki-torches-trump-alligator-alcatraz-tour-in-blistering-commentary-cruelty-is-the-priority/",
    "timestamp": "2025-07-02T13:18:27Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Deportation Setback Within Hours",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Trump administration suffered two deportation-related legal defeats in New York and Virginia on Tuesday.\nA New York judge blocked a proposal to strip thousands of Haitian migrants of legal protections, and…",
    "link": "https://biztoc.com/x/6830e4ec84b0f61a",
    "timestamp": "2025-07-02T13:18:26Z"
  },
  {
    "title": "Republicans say Medicaid work requirements target the lazy. It’s not that simple.",
    "description": "Republicans say Medicaid work requirements target the lazy. It’s not that simple.coloradosun.com",
    "link": "http://coloradosun.com/2025/07/02/republican-medicaid-work-requirements-hurt-eligible-coloradans/",
    "timestamp": "2025-07-02T13:18:01Z"
  },
  {
    "title": "ICE secretly funnels millions to private prison giant under Trump-era loophole",
    "description": "U.S. Immigration and Customs Enforcement used the pretense of a national emergency to justify a secret, no-bid contract with CoreCivic that would pay the company $4.2 million per month to house detained immigrants at its vacant Leavenworth prison.CoreCivic re…",
    "link": "https://www.rawstory.com/ice-secretly-funnels-millions-to-private-prison-giant-under-trump-era-loophole/",
    "timestamp": "2025-07-02T13:17:57Z"
  },
  {
    "title": "‘The pressure’s enormous’: Bill O’Reilly says one large hurdle remains with Big Beautiful Bill",
    "description": "'Any congressperson who wants to run again on the GOP ticket voting against the bill is done. So just keep that in mind'",
    "link": "https://www.wnd.com/2025/07/pressures-enormous-bill-oreilly-says-one-large-hurdle/",
    "timestamp": "2025-07-02T13:17:02Z"
  },
  {
    "title": "Paramount’s Giant Settlement With Trump Is Cause for Nationwide Alarm",
    "description": "Truckling to President Donald Trump, Paramount has agreed to settle the president’s frivolous lawsuit over the editing of CBS News’s 60 Minutes interview with Kamala Harris. \r\nSome executives at the media conglomerate reportedly desired this outcome, for it w…",
    "link": "https://newrepublic.com/post/197519/paramount-settlement-trump-60-minutes-interview",
    "timestamp": "2025-07-02T13:16:57Z"
  },
  {
    "title": "WATCH LIVE: House votes on Trump’s ‘big, beautiful’ tax and spending bill after Senate passage",
    "description": "Some House GOP members have voiced reservations about the bill. House Democrats are united in their opposition to the legislation.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-house-votes-on-trumps-big-beautiful-tax-and-spending-bill-after-senate-passage",
    "timestamp": "2025-07-02T13:16:18Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Deportation Setback Within Hours",
    "description": "President Donald Trump's administration suffered legal defeats in New York and Virginia on Tuesday.",
    "link": "https://www.newsweek.com/donald-trump-suffers-double-legal-deportation-setback-within-hours-2093490",
    "timestamp": "2025-07-02T13:16:17Z"
  },
  {
    "title": "Live updates: Sean ‘Diddy’ Combs trial, Jury to continue deliberating following partial verdict",
    "description": "The judge in Sean “Diddy” Combs’ federal criminal trial has asked jurors to continue deliberating after they said they are unable to reach a verdict on one of the five counts. Follow for live updates.",
    "link": "https://www.cnn.com/entertainment/live-news/sean-diddy-combs-trial-07-02-25",
    "timestamp": "2025-07-02T13:14:50Z"
  },
  {
    "title": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states say",
    "description": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states saynewsbreak.com",
    "link": "https://www.newsbreak.com/share/4084526627780-not-only-cruel-it-is-illegal-trump-admin-unlawfully-slashed-over-1b-in-youth-mental-health-funding-breached-grant-agreements-and-violated-federal-regulations-states-say?s=a2&amp;share_destination_id=MTg0MDQ1NzQ4LTE3NTE0NjIwMjY4MjI%3D&amp;pd=0CSEhoOK&amp;hl=en_US&amp;send_time=1751462026&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v9%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-v1%2Cns_foryou_recall_exp_25q3-control",
    "timestamp": "2025-07-02T13:14:17Z"
  },
  {
    "title": "'I hold all the levers': Trump hints he'll overturn election result in NYC",
    "description": "President Donald Trump vowed to be the savior of New York City as he declared war on the Democratic Party’s nominee for mayor — a man who won overwhelming support from primary voters in a democratic election.With no evidence, Trump declared Zohran Mamdani a “…",
    "link": "https://www.rawstory.com/zohran-mamdani-2672556247/",
    "timestamp": "2025-07-02T13:12:49Z"
  },
  {
    "title": "Israel's Top Diplomat Urges Seizing Chance After Trump Ceasefire Push",
    "description": "Israel's top diplomat on Wednesday said any chance to free hostages held in Gaza \"must not be missed\", after US President Donald Trump urged Palestinian group Hamas to agree to a 60-day ceasefire that he said had Israel's backing.",
    "link": "https://www.ibtimes.com.au/israels-top-diplomat-urges-seizing-chance-after-trump-ceasefire-push-1859507",
    "timestamp": "2025-07-02T13:12:05Z"
  },
  {
    "title": "OPEC’s Oil Output Climbs as Saudis Lead Pursuit of Market Share",
    "description": "OPEC bolstered crude production by the most in four months as Saudi Arabia led a surge of Middle East exports in a bid to reclaim market share, a Bloomberg survey shows.",
    "link": "https://financialpost.com/pmn/business-pmn/opecs-oil-output-climbs-as-saudis-lead-pursuit-of-market-share",
    "timestamp": "2025-07-02T13:11:12Z"
  },
  {
    "title": "Analysis shows Trump’s tariffs would cost US employers $82.3 billion",
    "description": "An analysis finds a critical group of U.S. employers would face a direct cost of $82.3 billion from Trump’s current tariff plans.",
    "link": "https://www.bostonherald.com/2025/07/02/trump-tariffs-analysis-employer-costs/",
    "timestamp": "2025-07-02T13:10:08Z"
  },
  {
    "title": "Analysis shows Trump’s tariffs would cost US employers $82.3 billion",
    "description": "An analysis finds a critical group of U.S. employers would face a direct cost of $82.3 billion from Trump’s current tariff plans.",
    "link": "https://www.denverpost.com/2025/07/02/trump-tariffs-analysis-employer-costs/",
    "timestamp": "2025-07-02T13:10:08Z"
  },
  {
    "title": "Paramount’s Deal With Trump ‘Threatens Journalists’ Ability to Do Their Jobs,’ WGA East Says",
    "description": "\"This settlement is a transparent attempt to curry favors with an administration in the hopes it will allow Paramount Global and Skydance Media merger to be cleared for approval,\" the WGAE says\nThe post Paramount’s Deal With Trump ‘Threatens Journalists’ Abil…",
    "link": "https://www.thewrap.com/paramount-trump-deal-writers-guild-response/",
    "timestamp": "2025-07-02T13:09:28Z"
  },
  {
    "title": "Trump voters in for a shock as $800 billion Medicaid cuts hit home in MAGA stronghold",
    "description": "Donald Trump plans Medicaid cuts to fund tax cuts. This could affect millions, especially in rural areas. Places like Knox County, Kentucky, heavily rely on Medicaid. New work rules and paperwork may cause coverage loss. Drug rehab programs also face potentia…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-voters-in-for-a-shock-as-800-billion-medicaid-cuts-hit-home-in-maga-stronghold/articleshow/122207458.cms",
    "timestamp": "2025-07-02T13:09:26Z"
  },
  {
    "title": "Jobs Crash? ADP Report Shows Private Payrolls Unexpectedly Shrank By 33,000 in June",
    "description": "The ADP report was expected to show a gain of 100,000. Instead, it showed a sharp contraction in employment for June.\nThe post Jobs Crash? ADP Report Shows Private Payrolls Unexpectedly Shrank By 33,000 in June appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/02/jobs-crash-adp-report-shows-private-payrolls-unexpectedly-shrank-by-33000-in-june/",
    "timestamp": "2025-07-02T13:09:14Z"
  },
  {
    "title": "Iran halts cooperation with UN nuclear watchdog",
    "description": "The decision follows Israeli and US strikes on Iranian soil.",
    "link": "https://www.politico.eu/article/iran-halts-cooperation-un-nuclear-watchdog/",
    "timestamp": "2025-07-02T13:08:45Z"
  },
  {
    "title": "Here Are the Cable News Ratings for June 2025",
    "description": "This was Fox News’ highest-rated June since 2020 in total viewers and the Adults 25-54 demo.",
    "link": "https://www.adweek.com/tvnewser/here-are-the-cable-news-ratings-for-june-2025/",
    "timestamp": "2025-07-02T13:07:42Z"
  },
  {
    "title": "New Study Reveals Brutal Hit That U.S. Employers Face From Trump Tariffs",
    "description": "An analysis finds that a critical group of U.S. employers would face a direct cost of $82.3 billion from President Donald Trump’s current tariff plans, a sum that could be potentially managed through price hikes, layoffs, hiring freezes or lower profit margin…",
    "link": "https://biztoc.com/x/a15037d881c33817",
    "timestamp": "2025-07-02T13:07:24Z"
  },
  {
    "title": "Trump, Paramount Settle: No \"60 Minutes\" Apology; $20B Drops to $16M",
    "description": "In a move that has nothing to do with the impending merger between Paramount Global and Skydance, Paramount Global and POtuS Donald Trump have reached a settlement in Trump's $20 billion lawsuit against award-winning news magazine 60 Minutes over what he clai…",
    "link": "https://bleedingcool.com/tv/trump-paramount-settle-no-60-minutes-apology-20b-drops-to-16m/",
    "timestamp": "2025-07-02T13:07:04Z"
  },
  {
    "title": "Former UK civil service chief calls Xi Jinping a ‘dictator’ over plans to reunify Taiwan",
    "description": "Comments from Simon Case come as UK defence review highlights military exercises around Taiwan as driver of global instability\nThe former head of the UK’s civil service has described the Chinese leader Xi Jinping as a “dictator” and said Donald Trump had put …",
    "link": "https://biztoc.com/x/2efafe904fbb33ed",
    "timestamp": "2025-07-02T13:06:58Z"
  },
  {
    "title": "Paramount settles with Trump over '60 Minutes' for $16m",
    "description": "CBS parent company Paramount has today settled a lawsuit filed by US President Donald Trump over an interview broadcast in October, the latest concession by a media company to a president who has targeted outlets over what he describes as false or misleading …",
    "link": "https://www.rte.ie/news/business/2025/0702/1521482-paramount-settles-with-trump-over-60-minutes-for-16m/",
    "timestamp": "2025-07-02T13:06:45Z"
  },
  {
    "title": "Trump Vows to Save NYC From ‘Communist Lunatic’ Zohran Mamdani and Make It ‘Hot’ and ‘Great’ Again",
    "description": "President Donald Trump has pledged to \"save\" New York City from \"Communist Lunatic\" Zohran Mamdani, saying in a social media post that he will \"save New York City.\"\nThe post Trump Vows to Save NYC From ‘Communist Lunatic’ Zohran Mamdani and Make It ‘Hot’ and …",
    "link": "https://www.mediaite.com/media/news/trump-vows-to-save-nyc-from-communist-lunatic-zohran-mamdani-and-make-it-hot-and-great-again/",
    "timestamp": "2025-07-02T13:05:55Z"
  },
  {
    "title": "As the One Big Boondoggle passes the Senate, Trump and Musk square off again",
    "description": "The issues involved are serious. But oh, the drama these boys bring to the office",
    "link": "https://www.salon.com/2025/07/02/as-the-one-big-boondoggle-passes-the-senate-trump-and-musk-square-off-again/",
    "timestamp": "2025-07-02T13:05:41Z"
  },
  {
    "title": "Trump family’s American Bitcoin mining company readies to go public with updated SEC S-4 filing",
    "description": "The Trump family’s American Bitcoin Corp. and Gryphon Digital Mining have filed an amended S-4 registration statement with the U.S. Securities and Exchange Commission, moving forward on the public listing for the combined entity. The filing advances a previou…",
    "link": "https://cryptoslate.com/trump-familys-american-bitcoin-mining-company-readies-to-go-public-with-updated-sec-s-4-filing/",
    "timestamp": "2025-07-02T13:05:04Z"
  },
  {
    "title": "From $20 billion to $15 million? CBS, Trump very close to settlement of lawsuit over 60 Minutes",
    "description": "Donald Trump's $20 billion lawsuit against CBS over a 60 Minutes interview with Kamala Harris is nearing resolution as both parties engage in advanced settlement talks. Trump alleges the interview was deceptively edited, harming his reputation and unfairly co…",
    "link": "https://economictimes.indiatimes.com/news/international/us/from-20-billion-to-15-million-cbs-trump-very-close-to-settlement-of-lawsuit-over-60-minutes/articleshow/122207241.cms",
    "timestamp": "2025-07-02T13:04:55Z"
  },
  {
    "title": "Tesla Vehicle Deliveries Shrank 13% Last Quarter — A Historic Decline As Elon Musk’s Troubles Mount",
    "description": "The worst year-over-year vehicle delivery decline on record came as Elon Musk fell out of favor with Donald Trump.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/07/02/tesla-vehicle-deliveries-shrank-13-last-quarter---a-historic-decline-as-elon-musks-troubles-mount/",
    "timestamp": "2025-07-02T13:04:33Z"
  },
  {
    "title": "The bizarre reason Trump and his team say they may try to ‘prosecute’ CNN",
    "description": "Donald Trump and his team are starting to talk about prosecuting journalists for running segments the White House doesn't like, the First Amendment be damned.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/bizarre-reason-trump-team-say-may-try-prosecute-cnn-rcna216447",
    "timestamp": "2025-07-02T13:03:22Z"
  },
  {
    "title": "Colorado Capitol Has New Trump Portrait",
    "description": "\"A new presidential portrait sits in the Colorado Capitol, after one that had hung in the building for six years drew the ire of Donald Trump, who claimed that it 'purposefully distorted' his image,\" the",
    "link": "https://politicalwire.com/2025/07/02/colorado-capitol-has-new-trump-portrait/",
    "timestamp": "2025-07-02T13:01:13Z"
  },
  {
    "title": "Paramount, CBS Bow to Trump: Agree to Hefty Payout, New Editorial Rules",
    "description": "Sen. Bernie Sanders (I-VT) and eight other senators, sent a letter to ... Paramount Global’s board urging them to not to settle the lawsuit.\" ... They claimed that a settlement would be a \"grave mistake\" and \"a blatant attempt to intimidate the media and thos…",
    "link": "https://legalinsurrection.com/2025/07/paramount-cbs-bow-to-trump-hefty-payout-new-editorial-rules/",
    "timestamp": "2025-07-02T13:00:35Z"
  },
  {
    "title": "Trump, Leakers and Journalists: The Assange Precedent and Revisiting the Espionage Act. Prof. Binoy Kampmark",
    "description": "When campaigning in 2016, presidential candidate Donald Trump was delighted by leaked, hacked or disclosed material that wound its way to the digital treasure troves of WikiLeaks. The online publisher of government secrets had become an invaluable resource fo…",
    "link": "https://www.globalresearch.ca/assange-precedent-espionage-act/5893478",
    "timestamp": "2025-07-02T13:00:26Z"
  },
  {
    "title": "The Keys to Trump’s Middle East Triumph",
    "description": "If you blinked, you just missed World War III.  President Donald Trump on June 23 announced a ceasefire between Israel and Iran. That came two... Read More\nThe post The Keys to Trump’s Middle East Triumph  appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/02/keys-trumps-middle-east-triumph/",
    "timestamp": "2025-07-02T13:00:00Z"
  },
  {
    "title": "Shooting down claim Trump warned he'd bomb Norway if he isn't awarded Nobel Peace Prize",
    "description": "The rumor circulated after U.S. President Donald Trump said he deserves the award for helping to hammer out peace deals between warring countries.",
    "link": "https://www.snopes.com//fact-check/trump-bomb-norway-nobel-peace-prize/",
    "timestamp": "2025-07-02T13:00:00Z"
  },
  {
    "title": "Public Knowledge Condemns CBS 60 Minutes Settlement with President Trump as Attack on Press Freedoms",
    "description": "Today, Paramount Global, which owns CBS News, announced it will pay $16 million to President Trump’s library fund to settle his lawsuit over the editing of a “60 Minutes” interview with then-Democratic presidential candidate Kamala Harris. The settlement also…",
    "link": "https://publicknowledge.org/public-knowledge-condemns-cbs-60-minutes-settlement-with-president-trump-as-attack-on-press-freedoms/",
    "timestamp": "2025-07-02T12:58:01Z"
  },
  {
    "title": "US Dollar has worst start since 1973 - key reasons behind the stunning slide",
    "description": "The US dollar faces a significant decline, hitting levels unseen since 1973. Donald Trump's trade policies are sparking global investor concerns. The dollar index has dropped over 10% this year. This marks the worst start since the end of the Bretton Woods sy…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-dollar-has-worst-start-since-1973-key-reasons-behind-the-stunning-slide-us-dollar-latest-news-currency-market-news/articleshow/122206204.cms",
    "timestamp": "2025-07-02T12:57:20Z"
  },
  {
    "title": "Trump: I'll save New York City",
    "description": "United States President Donald Trump declared in a Truth Social post on Wednesday that he will \"save New York City,\" adding he was not going to let a \"Communist lunatic destroy\" it, in a likely refere...",
    "link": "https://biztoc.com/x/f2c36afeab9b0091",
    "timestamp": "2025-07-02T12:56:13Z"
  },
  {
    "title": "Paramount will settle with Trump for $16 million over ’60 Minutes’ Kamala Harris interview",
    "description": "In a case seen as a challenge to free speech, Paramount has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “60 Minutes” interview with then-Vice President Kamala Harris in October.Paramount told media ou…",
    "link": "https://biztoc.com/x/0318a79111804a8f",
    "timestamp": "2025-07-02T12:55:50Z"
  },
  {
    "title": "Elon Musk loses $12,000,000,000 in one day amid Trump feud and Tesla crash — here’s what caused second-biggest wealth wipeout in human history",
    "description": "Elon Musk just lost a jaw-dropping $12,000,000,000 in one day, and the world is watching. The loss came after a heated Trump feud and a dramatic Tesla stock crash, shaking investor confidence. As Trump threatened to pull EV tax credits and SpaceX contracts, M…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-loses-12000000000-in-one-day-amid-trump-feud-and-tesla-crash-heres-what-caused-second-biggest-wealth-wipeout-in-human-history/articleshow/122206909.cms",
    "timestamp": "2025-07-02T12:52:51Z"
  },
  {
    "title": "Photos show Elon Musk and President Donald Trump's relationship before their feud reignited",
    "description": "Elon Musk’s feud with President Donald Trump has reignited, with the tech billionaire threatening to launch a new political party and Trump suggesting Musk could be punished for his opposition.\nThis is a photo gallery curated by AP photo editors.",
    "link": "https://biztoc.com/x/5e6bfc7ad39f4402",
    "timestamp": "2025-07-02T12:50:44Z"
  },
  {
    "title": "Operation Rising Lion…the movie",
    "description": "I say a movie, indeed a blockbuster, to tell the story of Israel as it is today, a nation of warriors desirous of peace. Opinion.",
    "link": "https://www.israelnationalnews.com/news/411021",
    "timestamp": "2025-07-02T12:50:42Z"
  },
  {
    "title": "Another Biden-Appointed Judge Tells Trump He Can’t Fire Exec Branch Employees",
    "description": "A Biden-appointed federal judge ruled on Tuesday that President Donald Trump must put a stop to the mass layoffs at the Department of Health and Human Services (HHS). U.S. District Judge Melissa DuBose granted 19 state attorneys general and the District of Co…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326476/posts",
    "timestamp": "2025-07-02T12:50:40Z"
  },
  {
    "title": "New FBI headquarters is a total slap in the face to Democrats",
    "description": "Kash Patel calls it 'the most cost effective and resource efficient way to carry out our mission to protect the American people and uphold the Constitution'",
    "link": "https://www.wnd.com/2025/07/new-fbi-headquarters-is-total-slap-face-democrats/",
    "timestamp": "2025-07-02T12:47:30Z"
  },
  {
    "title": "Japan's minority government faces a tough test in the upper house election",
    "description": "Japan’s Prime Minister Shigeru Ishiba faces a tough test in an upper house election this month as his minority government struggles after its major defeat in last year’s snap election",
    "link": "https://abcnews.go.com/International/wireStory/japans-minority-government-faces-tough-test-upper-house-123401127",
    "timestamp": "2025-07-02T12:46:17Z"
  },
  {
    "title": "Wall Street futures mixed ahead of crucial US jobs data and looming tariff deadline",
    "description": "Markets quietly await U.S. employment data due Thursday with another eye on next week’s tariff deadline.",
    "link": "https://www.bostonherald.com/2025/07/02/wall-street-jobs-data-tariffs/",
    "timestamp": "2025-07-02T12:45:46Z"
  },
  {
    "title": "What damage did the US do to Iran’s nuclear program? Why it’s so hard to know",
    "description": "A scholar of intelligence and strategy explains why battle damage assessments are so challenging – and why the process has become politicized.",
    "link": "https://theconversation.com/what-damage-did-the-us-do-to-irans-nuclear-program-why-its-so-hard-to-know-260058",
    "timestamp": "2025-07-02T12:44:30Z"
  },
  {
    "title": "Paramount Global Blasted For Settling Donald Trump’s ’60 Minutes’ Lawsuit: “Threatens Journalists’ Ability To Do Their Job,” WGAE Says",
    "description": "Paramount Global is already facing sharp criticism over its decision to settle Donald Trump’s lawsuit over the way that CBS’ 60 Minutes edited an interview with Kamala Harris. The $16 million settlement, announced late on Tuesday, came after months of wrangli…",
    "link": "http://deadline.com/2025/07/trump-60-minutes-lawsuit-paramount-settlement-1236447658/",
    "timestamp": "2025-07-02T12:42:11Z"
  },
  {
    "title": "Paramount Global Blasted For Settling Donald Trump’s ’60 Minutes’ Lawsuit: “Threatens Journalists’ Ability To Do Their Job,” WGAE Says",
    "description": "Paramount Global is already facing sharp criticism over its decision to settle Donald Trump’s lawsuit over the way that CBS’ 60 Minutes edited an interview...",
    "link": "https://deadline.com/2025/07/trump-60-minutes-lawsuit-paramount-settlement-1236447658/",
    "timestamp": "2025-07-02T12:42:11Z"
  },
  {
    "title": "Wednesday, July 2, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-july-2-2025/",
    "timestamp": "2025-07-02T12:39:40Z"
  },
  {
    "title": "US CISA agency extends Iran cyber alert, warns of CNI threat",
    "description": "The US Cybersecurity and Infrastructure Security Agency reiterates guidance for operators of critical national infrastructure as it eyes the possibility of cyber attacks from Iran",
    "link": "https://www.computerweekly.com/news/366627095/US-CISA-agency-extends-Iran-cyber-alert-warns-of-CNI-threat",
    "timestamp": "2025-07-02T12:39:00Z"
  },
  {
    "title": "Alligator Alcatraz: Inside the world’s deadliest prison surrounded by alligators and pythons - you won’t believe it’s real",
    "description": "Donald Trump's administration has inaugurated 'Alligator Alcatraz,' a controversial migrant detention center in Florida's Everglades, naturally guarded by alligators. This facility, modeled after a Salvadoran prison, aims to deter illegal immigration, sparkin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/alligator-alcatraz-inside-the-worlds-deadliest-prison-surrounded-by-alligators-and-pythons-you-wont-believe-its-real/articleshow/122206241.cms",
    "timestamp": "2025-07-02T12:38:58Z"
  },
  {
    "title": "A bare-bones deal is Europe's best hope in trade talks with the U.S., sources say",
    "description": "The U.S. and EU are down to the wire to strike a so-far elusive trade agreement by early July.",
    "link": "https://www.cnbc.com/2025/07/02/a-bare-bones-deal-is-europes-best-hope-in-trade-talks-with-the-us-sources-say.html",
    "timestamp": "2025-07-02T12:36:55Z"
  },
  {
    "title": "U.N. Chief Guterres Calls for $4 Trillion in Aid Donations to ‘Turn the World Around’",
    "description": "U.N. chief Antonio Guterres wants to “turn the world around” but is lacking in one thing: other people’s money. On Monday the veteran Portuguese socialist acknowledged the financial shortfall and demanded the world step up and give to the globalist organizati…",
    "link": "https://freerepublic.com/focus/f-news/4326472/posts",
    "timestamp": "2025-07-02T12:35:38Z"
  },
  {
    "title": "Scott Bessent Says Senators Not 'Threatened' By Elon Musk's Words, Bill Advancing Under Trump's Leadership 'More Than Anybody's Checkbook'",
    "description": "Treasury Secretary Scott Bessent commented on the ongoing feud between Tesla Inc. (NASDAQ:TSLA), Elon Musk and President Donald Trump, suggesting that the conflict is unlikely to affect the passing of a significant bill.\nWhat Happened: In a recent interview w…",
    "link": "https://biztoc.com/x/99ac593e17598ecf",
    "timestamp": "2025-07-02T12:34:02Z"
  },
  {
    "title": "Paramount will settle with Trump for $16 million over ’60 Minutes’ Kamala Harris interview",
    "description": "In a case seen as a challenge to free speech, Paramount has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “60 Minutes” interview with then-Vice President Kamala Harris in October.Paramount told media ou…",
    "link": "https://www.fastcompany.com/91362005/paramount-will-settle-with-trump-for-16-million-over-60-minutes-kamala-harris-interview",
    "timestamp": "2025-07-02T12:33:52Z"
  },
  {
    "title": "What is racketeering and why is Sean 'Diddy' Combs facing this charge?",
    "description": "The trial of American music mogul Sean \"Diddy\" Combs, who is accused of running a sprawling sex trafficking operation, is almost over. The 12 jurors at a federal court in New York have announced they have come to a decision on four of the five counts faced by…",
    "link": "https://freerepublic.com/focus/f-chat/4326471/posts",
    "timestamp": "2025-07-02T12:33:36Z"
  },
  {
    "title": "The One Big Beautiful Bill is one big disaster for AI",
    "description": "President Donald Trump, from left, Larry Ellison, co-founder and executive chairman of Oracle Corp., Masayoshi Son, chief executive officer of SoftBank Group Corp., and Sam Altman, chief executive officer of OpenAI Inc., in the Roosevelt Room of the White Hou…",
    "link": "https://biztoc.com/x/6914a2ec1b4a344a",
    "timestamp": "2025-07-02T12:33:33Z"
  },
  {
    "title": "Paramount, President Trump Reach $16 Million Settlement Over 60 Minutes Lawsuit",
    "description": "Paramount will settle President Donald Trump’s lawsuit over an October 60 Minutes interview with then-Vice President Kamala Harris, CBS’ parent company announced late Tuesday. The settlement, for $16 million, will be paid to Trump’s future presidential librar…",
    "link": "https://tvline.com/news/paramount-trump-60-minutes-lawsuit-settlement-1235469685/",
    "timestamp": "2025-07-02T12:33:17Z"
  },
  {
    "title": "Despite claims they’d move overseas after the election, most Americans are staying put",
    "description": "Even if they don’t support the current administration, most Americans are not actually making plans to leave the country.",
    "link": "https://theconversation.com/despite-claims-theyd-move-overseas-after-the-election-most-americans-are-staying-put-250728",
    "timestamp": "2025-07-02T12:31:40Z"
  },
  {
    "title": "This Is Going to Be Entertaining…",
    "description": "Kentucky’s GOP Senate primary is kicking into gear: Among the claims being made: Nate Morris has undergone an “embarrassing” political makeover, and Andy Barr is “bought by woke banks.” And “Fake Nate” Morris is the subject of a whole website created by Danie…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/this-is-going-to-be-entertaining",
    "timestamp": "2025-07-02T12:31:31Z"
  },
  {
    "title": "Elon Musk threatens war against the entire GOP (Zeeshan Aleem/MSNBC)",
    "description": "Zeeshan Aleem / MSNBC:\nElon Musk threatens war against the entire GOP  —  The Musk-Trump feud is heating up again, and Musk is warning about the possibility of political sabotage.  —  Elon Musk's feud with President Donald Trump is heating up again — and the …",
    "link": "https://www.memeorandum.com/250702/p32",
    "timestamp": "2025-07-02T12:30:00Z"
  },
  {
    "title": "Trump's racking up wins — and rewriting the book on diplomacy (Rich Lowry/New York Post)",
    "description": "Rich Lowry / New York Post:\nTrump's racking up wins — and rewriting the book on diplomacy  —  The least diplomatic president in US history is scoring diplomatic victories.  —  Over the last couple of days, Donald Trump has gotten NATO to agree to a defense sp…",
    "link": "https://www.memeorandum.com/250702/p33",
    "timestamp": "2025-07-02T12:30:00Z"
  },
  {
    "title": "Iran’s president orders country to suspend cooperation with UN nuclear watchdog IAEA",
    "description": "The order by President Masoud Pezeshkian included no timetables or details about what that suspension would entail.",
    "link": "https://www.bostonherald.com/2025/07/02/iran-suspends-cooperation-nuclear-watchdog/",
    "timestamp": "2025-07-02T12:29:17Z"
  },
  {
    "title": "USAID Programs for Ukraine Might Be Terminated This Year - Reports",
    "description": "MOSCOW (Sputnik) - The programs for Ukraine of the now-dismantled United States Agency for International Development (USAID), which have been transferred to the State Department, may be terminated by the end of the year, the Ukrainian media reported, citing o…",
    "link": "https://sputnikglobe.com/20250702/usaid-programs-for-ukraine-might-be-terminated-this-year---reports-1122385540.html",
    "timestamp": "2025-07-02T12:26:06Z"
  },
  {
    "title": "Trump Threatens to Prosecute CNN for Reporting on ICEBlock as App Hits No. 1",
    "description": "Kristi Noem said it was \"illegal.\"",
    "link": "https://gizmodo.com/trump-threatens-to-prosecute-cnn-for-reporting-on-iceblock-as-app-hits-no-1-2000623019",
    "timestamp": "2025-07-02T12:25:46Z"
  },
  {
    "title": "CBS News Parent Paramount To Pay $16 Million To Settle Trump 60 Minutes Lawsuit",
    "description": "The settlement over CBS News' cheap fake with Kamala Harris it the latest win for the president against Trump-hating corporate media,",
    "link": "https://thefederalist.com/2025/07/02/cbs-news-parent-paramount-to-pay-16-million-to-settle-trump-60-minutes-lawsuit/",
    "timestamp": "2025-07-02T12:25:40Z"
  },
  {
    "title": "Nippon Steel aiming to prove value of Japan-U.S. cooperation, chairman says",
    "description": "PM Ishiba explained that Tokyo is continuing to urge the administration of U.S. President Donald Trump to review its high tariffs.",
    "link": "https://biztoc.com/x/182f8d5e5ecaee2b",
    "timestamp": "2025-07-02T12:23:04Z"
  }
]