[
  {
    "title": "Musk\u0092s own AI censored",
    "description": "Grok, the AI assistant made by Elon [Roman Salute] Musk\u0092s artificial intelligence firm, was programmed not to use sources that said he and his bestie Donald [Hamburger Eating Surrender Monkey] Trump was responsible for spreading...",
    "link": "http://www.madshrimps.be/news/item/237122",
    "timestamp": "2025-02-26T06:14:32Z"
  },
  {
    "title": "Trump to sell 'gold card' US visas for $5 million",
    "description": "U.S. President Donald Trump has unveiled plans to sell new \"gold card\" residency permits for a price of $5 million each and said Russian oligarchs may be eligible.",
    "link": "https://www.hurriyetdailynews.com/trump-to-sell-gold-card-us-visas-for-5-million-206262",
    "timestamp": "2025-02-26T06:13:44Z"
  },
  {
    "title": "Cabinet officials caught off guard and frustrated by Musk’s directives to federal employees - CNN",
    "description": "Cabinet officials caught off guard and frustrated by Musk’s directives to federal employeesCNN February 25, 2025: Donald Trump presidency newsCNN Less than half of the federal workforce has responded to DOGE's 'what did you do' productivity emailYahoo Musk fi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176547725",
    "timestamp": "2025-02-26T06:13:35Z"
  },
  {
    "title": "Monica Lewinsky vows to reclaim the 'future that had been taken from me' in Call Her Daddy appearance",
    "description": "Monica Lewinsky spoke out about having 'lost her future' after becoming notoriously famous for her affair with Bill Clinton during an appearance on Call Her Daddy. The chat with host Alex Cooper, which will go live Wednesday, delves into what Lewinsky experie…",
    "link": "https://freerepublic.com/focus/f-chat/4300535/posts",
    "timestamp": "2025-02-26T06:08:17Z"
  },
  {
    "title": "Trump tariff turmoil casts a shadow over G-20 meeting",
    "description": "Global finance ministers and central bankers are convening in South Africa amid significant geopolitical turmoil and economic uncertainty. The Trump administration’s trade policies, including tariffs on Chinese imports and potential tariffs on Mexico, Canada,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-tariff-turmoil-casts-a-shadow-over-g-20-meeting/articleshow/118572863.cms",
    "timestamp": "2025-02-26T06:07:35Z"
  },
  {
    "title": "How the Zelensky-Trump deal for Ukraine’s natural resources was done – Express procedures in Kiev to get the signatures",
    "description": "The US president has argued that the deal would bring billions of dollars in revenue for his country - The final draft did not include a key US requirement\nThe post How the Zelensky-Trump deal for Ukraine’s natural resources was done – Express procedures in K…",
    "link": "https://en.protothema.gr/2025/02/26/how-the-zelensky-trump-deal-for-ukraines-natural-resources-was-done-express-procedures-in-kiev-to-get-the-signatures/",
    "timestamp": "2025-02-26T06:05:05Z"
  },
  {
    "title": "So far the grotesque reality of Trump’s ambitions has exceeded all the worst predictions",
    "description": "Trump’s hardly concealed hatred for the EU has not really had a chance to manifest itself yet",
    "link": "https://www.irishtimes.com/opinion/2025/02/26/so-far-the-grotesque-reality-of-trumps-ambitions-has-exceeded-all-the-worst-predictions/",
    "timestamp": "2025-02-26T06:05:00Z"
  },
  {
    "title": "SEC Acknowledges Grayscale's Revised Staking Proposal for its Ethereum ETF",
    "description": "The NYSE Arca filing details how the SEC could allow Grayscale's Ethereum funds to earn staking rewards while maintaining custody safeguards.",
    "link": "https://decrypt.co/307783/sec-acknowledges-grayscales-revised-staking-proposal-for-its-ethereum-etf",
    "timestamp": "2025-02-26T06:03:35Z"
  },
  {
    "title": "America is suffering from an epidemic of mass cowardice",
    "description": "The US is not yet a fascist society, but acting as if it is risks becoming a self-fulfilling prophecy",
    "link": "https://www.irishtimes.com/opinion/2025/02/26/america-is-suffering-from-an-epidemic-of-mass-cowardice/",
    "timestamp": "2025-02-26T06:00:52Z"
  },
  {
    "title": "Kathy Sheridan: Zelenskiy embodies the sacrifice of his people",
    "description": "Ukrainian leader has offered to step down in exchange for Nato membership or if it brings peace",
    "link": "https://www.irishtimes.com/opinion/2025/02/26/never-has-the-contrast-between-zelenskiys-spirit-and-trumps-snarling-ego-been-more-apparent/",
    "timestamp": "2025-02-26T06:00:52Z"
  },
  {
    "title": "Top Ryder Cup official warns hotels on price gouging ahead of 2027 tournament",
    "description": "Alan Evans notes prices already ‘elevated’ for  upcoming tournament",
    "link": "https://www.irishtimes.com/business/2025/02/26/top-ryder-cup-official-warns-hotels-on-price-gouging-ahead-of-2027-tournament/",
    "timestamp": "2025-02-26T06:00:01Z"
  },
  {
    "title": "From prisoner to pardon czar: Alice Johnson’s historic appointment signals a new era in criminal justice reform",
    "description": "President Donald Trump appointed Alice Johnson, a 69-year-old former inmate, as the nation’s first-ever “pardon czar.” Johnson will advise the president on clemency cases and offer recommendations for individuals deserving a second chance. Her journey from in…",
    "link": "https://www.naturalnews.com/2025-02-26-trump-appoints-alice-johnson-as-pardon-czar.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Mike Adams backs Trump and Muskâ\u0080\u0099s bold plan, calls for swift action",
    "description": "Health Ranger Mike Adams endorses Trump and Musk, urging them to keep fighting against corruption and remain relentless in exposing the deep state, ensuring a positive future. Adams views the current political moment as a once-in-a-lifetime opportunity to dis…",
    "link": "https://www.naturalnews.com/2025-02-26-mike-adams-backs-trump-and-musks-bold-plan.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Zelensky’s explosive outburst at Trump official signals growing tensions over Ukraine aid",
    "description": "Ukrainian President Zelensky clashed with U.S. Treasury Secretary Scott Bessent over a deal granting the U.S. 50% of Ukraine’s mineral resources in exchange for security guarantees. The confrontation strained U.S.-Ukraine relations, with the Trump administrat…",
    "link": "https://www.naturalnews.com/2025-02-26-zelensky-outburst-trump-official-ukraine.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Putin offers rare earth minerals deal to U.S. amid Ukraine war tensions",
    "description": "Putin proposes U.S.-Russia joint mining ventures for rare earth minerals in Russia and Russian-occupied Ukraine. The offer counters Trump’s push to access Ukraine’s mineral wealth, which Zelensky resists. Putin highlights Russia’s vast rare earth reserves and…",
    "link": "https://www.naturalnews.com/2025-02-26-putin-rare-earth-minerals-ukraine.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Is Fort Knoxâ\u0080\u0099s gold still there? Trump backs DOGE effort to find out",
    "description": "President Trump supports an audit of Fort Knox’s gold reserves, led by Elon Musk and DOGE, amid concerns over transparency and the lack of yearly audits. Fort Knox holds over 8,100 tonnes of gold, valued at $425 billion, but has only been opened to unauthoriz…",
    "link": "https://www.naturalnews.com/2025-02-26-fort-knox-gold-doge-effort-find-out.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Border crossings DROP BY 94% under Trump’s tough immigration policies",
    "description": "Illegal crossings at the U.S.-Mexico border have dropped by 94 percent since President Donald Trump took office, with daily apprehensions falling from 4,800 to fewer than 300. The second Trump administration replaced Biden-era policies like “catch and release…",
    "link": "https://www.naturalnews.com/2025-02-26-border-crossings-huge-drop-trump-immigration-policies.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s policies strike a chord: Approval soars as America First agenda gains momentum",
    "description": "President Trump’s approval rating has surpassed 50%, marking a significant increase in support for his America First agenda, including border security and tariffs. Trump’s policies on border control and traditional values have garnered widespread support, wit…",
    "link": "https://www.naturalnews.com/2025-02-26-trumps-approval-soars-america-first-agenda-gains-momentum.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Trump pushes for Keystone XL Pipeline revival, citing energy independence",
    "description": "President Trump urges the revival of the Keystone XL Pipeline, calling it a vital step for American energy independence. The $9 billion project, which was canceled by Biden in 2021, faced years of political and environmental opposition. TC Energy, the origina…",
    "link": "https://www.naturalnews.com/2025-02-26-trump-pushes-keystone-pipeline.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Apple announces $500 billion U.S. investment, including Texas AI server facility, amid Trump tariff pressure",
    "description": "Apple commits to a $500 billion U.S. investment, including a 250,000-square-foot AI server facility in Houston and 20,000 new jobs. The move aligns with Trump’s “America First” agenda and responds to 10% tariffs on Chinese imports. The Houston facility, devel…",
    "link": "https://www.naturalnews.com/2025-02-26-apple-investment-texas-facility-trump-tariff.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "GOP advances Trumpâ\u0080\u0099s tax cuts and border agenda in dramatic 217-215 House vote",
    "description": "The Republican-controlled House narrowly passed a $4.5 trillion tax-cut and border security bill, advancing Trump’s 2025 priorities in a 217-215 vote. The bill extends Trump’s 2017 tax cuts, proposes $2 trillion in spending cuts, and funds border security, de…",
    "link": "https://www.naturalnews.com/2025-02-26-gop-trump-tax-cut-house-vote.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s $5 million â\u0080\u009cgold cardâ\u0080\u009d visa plan could erase U.S. national debt",
    "description": "President Trump announced a $5 million “gold card” visa program to attract wealthy foreign investors and potentially eliminate the $35 trillion national debt. The program replaces the EB-5 visa, criticized for fraud, with stricter oversight and higher investm…",
    "link": "https://www.naturalnews.com/2025-02-26-trump-gold-card-visa-national-debt.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Texas rancher slain by cartel IED near border: A call for vigilance and action",
    "description": "Antonio Céspedes Saldierna, a 74-year-old Texas rancher, was killed when his vehicle triggered an IED in San Fernando, Tamaulipas, Mexico, reigniting concerns about cartel violence along the U.S.-Mexico border. The use of IEDs by cartels has become more commo…",
    "link": "https://www.naturalnews.com/2025-02-26-texas-rancher-slain-by-cartel-ied-near-border.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "The skyâ\u0080\u0099s the limit? Shanahan and Trump demand answers on geoengineering and public health",
    "description": "Nicole Shanahan and former President Donald Trump have demanded answers about chemical spraying in American skies, reigniting a debate over the ethics and secrecy surrounding geoengineering programs. Shanahan’s social media post highlighted visible trails in …",
    "link": "https://www.naturalnews.com/2025-02-26-shanahan-and-trump-demand-answers-geoengineering-public-health.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "George Clooney: ‘I told Amal, I can still do everything I did when I was 30. But in 30 years, I’m 90. That’s a real number’",
    "description": "The actor is making his Broadway debut in a stage adaptation of his 2005 movie Good Night, and Good Luck",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/02/20/theater/george-clooney-broadway-good-night-good-luck.html",
    "timestamp": "2025-02-26T05:56:00Z"
  },
  {
    "title": "Petition to strip Musk of Canadian citizenship gathers 280,000 signatures",
    "description": "Parliamentary petition accuses tech billionaire of acting against the national interest of Canada.",
    "link": "https://www.aljazeera.com/news/2025/2/26/petition-to-strip-musk-of-canadian-citizenship-gathers-280000-signatures",
    "timestamp": "2025-02-26T05:55:39Z"
  },
  {
    "title": "Trump to convene first cabinet meeting, including Musk",
    "description": "US President Donald Trump is set on Wednesday to convene his first Cabinet meeting since returning to office last month, in an effort to further his agenda with most of his nominees now having been confirmed by Congress.  Billionaire supporter and advisor Elo…",
    "link": "https://www.digitaljournal.com/world/trump-to-convene-first-cabinet-meeting-including-musk/article",
    "timestamp": "2025-02-26T05:55:32Z"
  },
  {
    "title": "Apple to invest $500 billion, create 20,000 US jobs; joins Meta, SoftBank in $1 trillion push",
    "description": "Tech giant Apple became the latest company to announce investments in the US, following similar promises made by its peers like Meta, Amazon and SoftBank.&nbsp;",
    "link": "https://www.livemint.com/companies/news/apple-to-invest-500-billion-create-20-000-us-jobs-joins-meta-softbank-in-1-trillion-push-11740540334531.html",
    "timestamp": "2025-02-26T05:49:41Z"
  },
  {
    "title": "Woke bishop Mariann Budde returns with message of defiance one month after lecturing Trump at prayer service",
    "description": "The woke bishop who last month pleaded with President Donald Trump to show 'mercy' to members of the LGBTQ+ community and illegal immigrants has re-emerged with a defiant message. The Right Reverend Mariann Edgar Budde took a break from social media following…",
    "link": "https://freerepublic.com/focus/f-religion/4300533/posts",
    "timestamp": "2025-02-26T05:45:17Z"
  },
  {
    "title": "Trump announces 'Gold Card' program for wealthy foreigners, offering US residency for $5 million",
    "description": "US President Trump introduces \"gold card\" for wealthy foreigners, offering citizenship for $5 million, CNN reports.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-announces-gold-card-program-for-wealthy-foreigners-offering-us-residency-for-5-million/article69265204.ece",
    "timestamp": "2025-02-26T05:45:16Z"
  },
  {
    "title": "What to Know About the Ruling Blocking Trump’s Refugee Ban",
    "description": "Trump’s effort to suspend refugee resettlement in the U.S. is on hold after a federal judge in Seattle ruled the President cannot nullify the law passed by Congress establishing the program.",
    "link": "https://time.com/7261831/seattle-federal-judge-whitehead-blocks-trump-refugee-ban-ruling-explainer/",
    "timestamp": "2025-02-26T05:45:00Z"
  },
  {
    "title": "Ukraine's earth riches are rare and difficult to reach",
    "description": "PARIS: Ukraine's soils hold some 5 per cent of the world's mineral resources, which US President Donald Trump is anxious to secure, but not all of them are yet exploited – or easily exploitable, according to e",
    "link": "https://www.channelnewsasia.com/world/ukraine-earth-riches-rare-difficult-reach-4960941",
    "timestamp": "2025-02-26T05:45:00Z"
  },
  {
    "title": "Trump Tariff Turmoil Casts a Shadow Over G-20 Meeting",
    "description": "The club of finance ministers and central bankers who’ve steered the global economy through a quarter century of market meltdowns, recessions, wars and the pandemic meet this week facing new headwinds to their goal of broader prosperity — tariffs and the immi…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tariff-turmoil-casts-a-shadow-over-g-20-meeting",
    "timestamp": "2025-02-26T05:44:50Z"
  },
  {
    "title": "Things to know about the ruling blocking President Trump's refugee ban",
    "description": "President Donald Trump’s effort to suspend the system for resettling refugees in the U.S. is on hold after a federal judge in Seattle blocked it",
    "link": "https://abcnews.go.com/US/wireStory/things-ruling-blocking-president-trumps-refugee-ban-119196794",
    "timestamp": "2025-02-26T05:42:16Z"
  },
  {
    "title": "US and Iraq Talk About ‘Quickly’ Resuming Key Oil Pipeline",
    "description": "The US and Iraq discussed the resumption a major pipeline that can transport oil from the Middle Eastern country to global markets, after the link was shut almost two years ago following regional cost disputes.",
    "link": "https://financialpost.com/pmn/business-pmn/us-and-iraq-talk-about-quickly-resuming-key-oil-pipeline",
    "timestamp": "2025-02-26T05:39:49Z"
  },
  {
    "title": "How Is Gold Card Different From Green Card In New Residency Permit Plan",
    "description": "US President Donald Trump has proposed a new &quot;gold card&quot; residency permit, priced at $5 million, as an alternative to the existing green card system.",
    "link": "https://www.ndtv.com/world-news/donald-trump-to-replace-green-card-with-gold-card-for-wealthy-immigrants-how-is-it-different-7796909",
    "timestamp": "2025-02-26T05:38:12Z"
  },
  {
    "title": "'If you think it's biased, it is biased': Albanese and Dutton turn to podcasts ahead of election",
    "description": "Podcast interviews were a key part of the US presidential campaign and now Australia's federal election is looming, Anthony Albanese and Peter Dutton are turning to audio to reach voters.",
    "link": "https://www.abc.net.au/news/2025-02-26/anthony-albanese-abbie-chatfield-podcasts-peter-dutton/104978668",
    "timestamp": "2025-02-26T05:35:35Z"
  },
  {
    "title": "Trump says \"OK\" with Zelensky's visit to U.S. to sign mineral deal",
    "description": "WASHINGTON, Feb. 26 (Xinhua) -- U.S. President Donald Trump said Tuesday he's",
    "link": "http://en.people.cn/n3/2025/0226/c90000-20281658.html",
    "timestamp": "2025-02-26T05:34:25Z"
  },
  {
    "title": "What we know about Amy Gleason the acting administrator of DOGE",
    "description": "Although billionaire Elon Musk and his associates have been championing DOGE's cuts, the White House has insisted that Mr Musk was a senior adviser and is not in charge.",
    "link": "https://www.abc.net.au/news/2025-02-26/who-is-amy-gleason-doge-administrator/104985004",
    "timestamp": "2025-02-26T05:33:53Z"
  },
  {
    "title": "The Frog or the Scorpion: Do Democrats Really Need to Ask Who Caused the Mess We’re In?",
    "description": "Yes, the Democrats really are hopeless.",
    "link": "https://www.nakedcapitalism.com/2025/02/the-frog-or-the-scorpion-do-democrats-really-need-to-ask-who-caused-the-mess-were-in.html",
    "timestamp": "2025-02-26T05:30:21Z"
  },
  {
    "title": "100 intelligence staffers to be fired for engaging in explicit chats: Gabbard",
    "description": "The participants must be dismissed from the National Security Agency by Friday, NSA Chief of Staff Alexa Henning wrote in a post on X on Tuesday.",
    "link": "https://abcnews.go.com/Politics/100-intelligence-staffers-fired-engaging-explicit-chats-gabbard/story?id=119195709",
    "timestamp": "2025-02-26T05:27:28Z"
  },
  {
    "title": "Inside US-Ukraine Minerals Deal Likely To Be Signed On Friday",
    "description": "The United States and Ukraine have agreed on the terms of a draft minerals deal to turn over Kyiv&#039;s revenue from some of its mineral resources to Washington, after an intense pressure campaign from President Donald Trump.",
    "link": "https://www.ndtv.com/world-news/inside-us-ukraine-minerals-deal-likely-to-be-signed-by-donald-trump-volodymyr-zelensky-on-friday-7797288",
    "timestamp": "2025-02-26T05:27:27Z"
  },
  {
    "title": "Stan Wars, The Fandom Menace",
    "description": "In this episode of Close All Tabs, host Morgan Sung examines the rise of “stan culture” in politics, where passionate supporters rally around political figures with the same fervor typically reserved for pop stars. Morgan is joined by tech and culture reporte…",
    "link": "https://www.kqed.org/news/12028658/stan-wars-the-fandom-menace",
    "timestamp": "2025-02-26T05:25:10Z"
  },
  {
    "title": "Private US company set for second Moon landing attempt",
    "description": "Intuitive Machines made history last year as the first private company to put a robot on the Moon.\nThe post Private US company set for second Moon landing attempt appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/tech-science/private-us-company-set-for-second-moon-landing-attempt/article",
    "timestamp": "2025-02-26T05:25:03Z"
  },
  {
    "title": "Stock market today: Asian shares are mixed, with Chinese markets gaining after declines on Wall St",
    "description": "Asian shares were mixed on Wednesday, with Chinese markets gaining after Wall Street extended its losses on worries over inflation and tariffs.  The rally in...",
    "link": "https://finance.yahoo.com/news/stock-market-today-asian-shares-052411544.html",
    "timestamp": "2025-02-26T05:24:11Z"
  },
  {
    "title": "Trump proposes 5 mln-dollar \"gold card\" to replace EB-5 investor visa",
    "description": "WASHINGTON, Feb. 25 (Xinhua) -- U.S. President Donald Trump said Tuesday that he plans to introduce",
    "link": "http://en.people.cn/n3/2025/0226/c90000-20281653.html",
    "timestamp": "2025-02-26T05:23:52Z"
  },
  {
    "title": "Ukraine agrees on US minerals deal, seeking Trump support",
    "description": "Ukraine has agreed on the terms of a minerals deal with the United States and could sign it Friday, the two countries said, a move Kyiv hopes will lead to future security guarantees from Washington.",
    "link": "https://www.hurriyetdailynews.com/ukraine-agrees-on-us-minerals-deal-seeking-trump-support-206256",
    "timestamp": "2025-02-26T05:23:01Z"
  },
  {
    "title": "Musk's new ultimatum spurs fresh confusion among U.S. government workers",
    "description": "President Donald Trump said workers who did not respond would be \"sort of semi-fired,\" adding to the uncertainty.",
    "link": "https://www.japantimes.co.jp/news/2025/02/26/world/politics/musk-confusion-us-government-workers/",
    "timestamp": "2025-02-26T05:23:00Z"
  },
  {
    "title": "The US lines up Latin American cooperation for migrant deportations",
    "description": "Venezuelan migrants handed over to Mexico like it’s a U.S. immigration detention facility",
    "link": "https://abcnews.go.com/International/wireStory/us-lines-latin-american-cooperation-migrant-deportations-119196801",
    "timestamp": "2025-02-26T05:18:18Z"
  },
  {
    "title": "Editorial: Ghanaian Visa Applicants Are Also Human Beings, Period!",
    "description": "The Ministry of Foreign Affairs, according to a myjoyonline.com report, is urging all Embassies and High Commissions in Ghana to put in place appropriate and humane conditions at their Embassies. According to the ministry, the move forms part of remedial meas…",
    "link": "https://thechronicle.com.gh/editorial-ghanaian-visa-applicants-are-also-human-beings-period/",
    "timestamp": "2025-02-26T05:18:05Z"
  },
  {
    "title": "Couch F***** Memes vs The Truth",
    "description": "In this episode of Close All Tabs, host Morgan Sung dives into the world of viral political memes with TechCrunch senior writer Amanda Silberling, unraveling the origins of the infamous JD Vance “couch rumor.” What began as a seemingly frivolous post on X abo…",
    "link": "https://www.kqed.org/news/12028616/couch-f-memes-vs-the-truth",
    "timestamp": "2025-02-26T05:15:37Z"
  },
  {
    "title": "'I really look up to you': Sukesh Chandrashekar writes to 'my man' Elon Musk, offers to invest $2 bn in X",
    "description": "In October 2022, Musk brought Twitter, whose name was later changed to X, for $44 billion.",
    "link": "https://www.businesstoday.in/latest/trends/story/i-really-look-up-to-you-sukesh-chandrashekar-writes-to-my-man-elon-musk-offers-to-invest-2-bn-in-x-465987-2025-02-26",
    "timestamp": "2025-02-26T05:08:40Z"
  },
  {
    "title": "'The White Lotus' star Patrick Schwarzenegger says he sometimes wishes he didn't have his last name",
    "description": "The \"White Lotus\" star says that people who criticize him for being a nepo baby don't see the work he puts into his acting career.",
    "link": "https://www.businessinsider.com/patrick-schwarzenegger-white-lotus-different-last-name-nepo-baby-2025-2",
    "timestamp": "2025-02-26T05:07:00Z"
  },
  {
    "title": "Surviving Hard Times: The Last Generation of Black Americans under Jim Crow and the Culture of Racism in America",
    "description": "By Douglas H. White ( Tomdispatch.com ) - Today, racism remains a poisonous force in America. Fascism and authoritarianism are on the rise and President Donald Trump is giving voice to such hate, making it state policy and central to his presidential agenda. …",
    "link": "https://www.juancole.com/2025/02/surviving-generation-americans.html",
    "timestamp": "2025-02-26T05:04:04Z"
  },
  {
    "title": "Whither Pro-Lifers?",
    "description": "If the movement wishes to advance its goals, it must start thinking in terms of votes.\nThe post Whither Pro-Lifers? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/whither-pro-lifers/",
    "timestamp": "2025-02-26T05:03:00Z"
  },
  {
    "title": "Utah Republicans move to overhaul election operations, starting with universal mail-in voting",
    "description": "Utah's Republican-controlled House has passed a bill requiring voters to opt in to receive their ballots in the mail",
    "link": "https://abcnews.go.com/Politics/wireStory/utah-republicans-move-overhaul-election-operations-starting-universal-119192128",
    "timestamp": "2025-02-26T05:02:11Z"
  },
  {
    "title": "Georgia bill passed in state Senate likened to 'DOGE Lite'",
    "description": "Georgia state Senators passed a bill on Monday that is likened to DOGE and will aim to reduce costs and increase accountability for state agencies.",
    "link": "https://www.foxnews.com/politics/georgia-bill-passed-state-senate-likened-doge-lite",
    "timestamp": "2025-02-26T05:02:04Z"
  },
  {
    "title": "Fire the Washington War Party",
    "description": "Reprinted with permission from EricMargolis.com. President Donald Trump gets a lot of things wrong. Chief among them is his crazy plan to ethnically cleanse two million Palestinians from the smoking ruins of Gaza. But he also gets some very important things v…",
    "link": "https://original.antiwar.com/eric_margolis/2025/02/25/fire-the-washington-war-party/",
    "timestamp": "2025-02-26T05:00:17Z"
  },
  {
    "title": "From the Dean Scream to Brat Memes",
    "description": "Welcome to Close All Tabs, a special KQED podcast series exploring the intersection of internet culture and politics. In episode, host Morgan Sung takes us through the evolution of online campaigning—from the early days of dial-up modems to today’s Twitch str…",
    "link": "https://www.kqed.org/news/12028570/from-the-dean-scream-to-brat-memes",
    "timestamp": "2025-02-26T05:00:02Z"
  },
  {
    "title": "Why Ukraine Is Cautious",
    "description": "By now, it seems that almost every global citizen has absorbed a prevailing belief: if Donald Trump had been president, Russia would never have invaded Ukraine.  This idea permeates discussions about the ongoing war, framing Trump as a figu...",
    "link": "https://www.americanthinker.com/articles/2025/02/why_ukraine_is_cautious.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "The DC mid-air crash: DEI everywhere",
    "description": "Much has been written about the mid-air collision of an airliner and an Army Blackhawk helicopter over the Potomac off Reagan Washington National Airport. This is among the most congested airspaces in America, yet the Army has, for decades, routed he...",
    "link": "https://www.americanthinker.com/blog/2025/02/the_dc_mid_air_crash_dei_everywhere.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "A deplorable implores Zuck to cede control of Meta",
    "description": "A recent interview reveals Mark Zuckerberg should not be in control of Meta.\r\n\r\nRemember the bezitted, bespectacled, algebra-loving, skinny, front-row-sitting, disheveled, geometry-loving, over-mommied, two-handed-set-shot-shooting, shoe-staring, bas...",
    "link": "https://www.americanthinker.com/blog/2025/02/a_deplorable_implores_zuck_to_cede_control_of_meta.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "IRS data leak scandal: Over 400,000 taxpayers affected",
    "description": "In a stunning development, House Judiciary chair Rep. Jim Jordan (R-Ohio) revealed new details about a massive leak of taxpayer information from the Internal Revenue Service (IRS) during the Biden administration.  According to the latest di...",
    "link": "https://www.americanthinker.com/blog/2025/02/irs_data_leak_scandal_over_400_000_taxpayers_affected.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "Democrats swear to swear",
    "description": "Much has been written about the coarsening of our society. Actions and images that would once have been thought beyond the pale are now so ubiquitous as to be unremarkable. The tastefully rendered airbrushed breasts of Playboy eventually ga...",
    "link": "https://www.americanthinker.com/blog/2025/02/democrats_swear_to_swear.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "Trump and the Art of Political Warfare",
    "description": "Photo Credit:Trump flag with superimposed over him\n \n picryl / pixabayTrump and his MAGA army are in the process of soundly routing the Ruling Class on the battlefield of political warfare and permanently replacing the current Republican Party Establishment.",
    "link": "https://www.americanthinker.com/articles/2025/02/trump_and_the_art_of_political_warfare.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "It’s time to investigate MSNBC for possible racism",
    "description": "Although it is a subsidiary of a subsidiary, MSNBC is ultimately a publicly traded company. And publicly traded or not, racism is a very serious charge… and Rachel Maddow made just that charge regarding the firing of Joy Reid.\r\n\r\nIf I were in ...",
    "link": "https://www.americanthinker.com/blog/2025/02/it_s_time_to_investigate_msnbc_for_possible_racism.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "Joy Reid is off the air: To celebrate, nor not celebrate?",
    "description": "While the conservative 52% of the American Internet — an estimate, based on Donald Trump winning the popular vote in November — is celebrating the removal of Joy Reid from the prime time lineup at MSNBC, reality bites.\r\n\r\nIt’s a lit...",
    "link": "https://www.americanthinker.com/blog/2025/02/joy_reid_is_off_the_air_to_celebrate_nor_not_celebrate.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "The Trump Cabinet meets; Elon Musk makes sense",
    "description": "The second Trump Cabinet had its first meeting on February 26, 2025. Unlike the Biden Handler’s Administration, this is expected to be a regular event, and the First Lady wasn’t in charge, not that a woman of Melania Trump’s abiliti...",
    "link": "https://www.americanthinker.com/blog/2025/02/the_trump_cabinet_meets_elon_musk_makes_sense.html",
    "timestamp": "2025-02-26T05:00:00Z"
  },
  {
    "title": "White House Kicks Out HuffPost Reporter From Press Pool",
    "description": "Breaking with decades of precedent, the Trump White House is insisting on the ability to choose which reporters cover the president.",
    "link": "https://www.huffpost.com/entry/white-house-kicks-out-huffpost-reporter-from-press-pool_n_67be9224e4b0d509934aa224",
    "timestamp": "2025-02-26T04:55:17Z"
  },
  {
    "title": "Tesla Board: “Elon Musk, what did you do last week? Provide 5 bullets of what you accomplished last week within 5 days.”",
    "description": "As you have probably seen, Elon Musk, in his dubious, potentially illegal, and not even official role as the head of a fake new government agency, the Department of Government Efficiency (DOGE), has put out an ultimatum to federal workers across the US to res…",
    "link": "https://cleantechnica.com/2025/02/25/tesla-board-elon-musk-what-did-you-do-last-week-provide-5-bullets-of-what-you-accomplished-last-week-within-5-days/",
    "timestamp": "2025-02-26T04:53:35Z"
  },
  {
    "title": "China says Taiwan seeks to give away chip industry to US",
    "description": "BEIJING: China said on Wednesday (Feb 26) that Taiwan was seeking to give away the island's semiconductor industry to the United States as a \"souvenir\" and leverage it to seek political support from Washington. US media have said Taiwan Semiconductor Manufact…",
    "link": "https://www.channelnewsasia.com/east-asia/china-taiwan-seek-give-away-chip-industry-united-states-4960601",
    "timestamp": "2025-02-26T04:50:00Z"
  },
  {
    "title": "BREAKING: House Passes Trump-GOP Budget",
    "description": "The House floor was the scene of some drama tonight—what else is new?—as Republicans launched a last-minute push to drag a few GOP holdouts over the finish line to pass the budget resolution. Earlier in the night, Republican leadership brought the resolution …",
    "link": "https://freerepublic.com/focus/f-news/4300526/posts",
    "timestamp": "2025-02-26T04:49:34Z"
  },
  {
    "title": "Former Democratic Rep Hits Biden’s Fmr Adviser For ‘Cover-Up’",
    "description": "Fmr Dem Rep. Phillips called ex-Biden adviser one of the \"ring leaders\" attempting to keep Biden in, warning people like him are want \"self-preservation.\"",
    "link": "https://dailycaller.com/2025/02/25/dean-phillips-joe-biden-democrat-party-mike-donilon/",
    "timestamp": "2025-02-26T04:45:55Z"
  },
  {
    "title": "5 key takeaways from the final Liberal leadership debate",
    "description": "The four candidates vying to replace Prime Minister Justin Trudeau took the debate stage for the final time as the Liberal leadership contest enters the home stretch. Here are five takeaways from Tuesday's debate.",
    "link": "https://www.cbc.ca/news/politics/liberal-leadership-debate-break-down-1.7468547",
    "timestamp": "2025-02-26T04:40:42Z"
  },
  {
    "title": "US representative introduces legislation to make $250 bill featuring Trump's face",
    "description": "Rep. Joe Wilson of South Carolina proposed creating \"the most valuable bill for the most valuable president!\"",
    "link": "https://www.jpost.com/american-politics/article-843777",
    "timestamp": "2025-02-26T04:38:15Z"
  },
  {
    "title": "Why Was Shashi Tharoor Named 'Shashi'? There's A Maha Shivratri Connection",
    "description": "Why was Shashi Tharoor named Shashi? The diplomat-turned-Congress MP, who is currently in the news over his praises for his rivals, has shared the reason while wishing his supporters on Maha Shivratri.",
    "link": "https://www.ndtv.com/india-news/why-was-shashi-tharoor-named-shashi-theres-a-maha-shivratri-connection-7797027",
    "timestamp": "2025-02-26T04:38:05Z"
  },
  {
    "title": "Florida Rep. Byron Donalds announces plans to run for governor",
    "description": "Rep. Byron Donalds, R-Fla., announced plans to run for Florida governor next year during an interview on Fox News' \"Hannity\" Tuesday night.",
    "link": "https://nypost.com/2025/02/25/us-news/florida-rep-byron-donalds-announces-plans-to-run-for-governor/",
    "timestamp": "2025-02-26T04:36:23Z"
  },
  {
    "title": "Under Trump, America's new friends: Russia, North Korea and Belarus",
    "description": "President Donald Trump realigned U.S. foreign policy by voting against a UN resolution condemning Russia's invasion of Ukraine, siding with countries like North Korea and Sudan. This move challenges America's traditional alliances with nations such as Britain…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/under-trump-americas-new-friends-russia-north-korea-and-belarus/articleshow/118571332.cms",
    "timestamp": "2025-02-26T04:32:56Z"
  },
  {
    "title": "ADDRESSING THE THREAT TO NATIONAL SECURITY FROM IMPORTS OF COPPER - The White House",
    "description": "ADDRESSING THE THREAT TO NATIONAL SECURITY FROM IMPORTS OF COPPERThe White House Trump orders copper probe in first step to tariffsBBC.com Trump orders investigation into copper imports, raising tariff prospectsThe Washington Post Donald Trump orders new tari…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176547245",
    "timestamp": "2025-02-26T04:32:07Z"
  },
  {
    "title": "DOGE’s Work Is Meaningless Unless Republicans Get Serious About Cutting Spending",
    "description": "The Trump administration’s Department of Government Efficiency (DOGE) has made commendable progress in identifying areas of waste, fraud, and abuse throughout the federal government. But failure by congressional Republicans to codify cuts to these items and o…",
    "link": "https://freerepublic.com/focus/f-news/4300519/posts",
    "timestamp": "2025-02-26T04:23:35Z"
  },
  {
    "title": "Hong Kong flags spending cut, AI push in bid to reverse booming deficit",
    "description": "HONG KONG: Hong Kong aims to cut public recurrent expenditure by 7 per cent from now till 2027/28 to rein in a rising deficit and plans a big AI push as it tries to mitigate headwinds from global economic uncertainty, geopolitical tensions and a weak property…",
    "link": "https://www.channelnewsasia.com/east-asia/hong-kong-annual-budget-2025-spending-cut-ai-push-4960766",
    "timestamp": "2025-02-26T04:23:00Z"
  },
  {
    "title": "CNN’s Scott Jennings Points Out That the Washington Bureaucracy Only Revolts When a Republican is President (VIDEO)",
    "description": "In a revealing analysis, CNN's Scott Jennings argues that the Washington bureaucracy's dissent is notably selective, often surfacing only during Republican administrations. This commentary sheds light on the complex dynamics of political accountability.\nThe p…",
    "link": "https://www.thegatewaypundit.com/2025/02/cnns-scott-jennings-points-that-washington-bureaucracy-only/",
    "timestamp": "2025-02-26T04:20:43Z"
  },
  {
    "title": "Trump says he will offer 'gold cards' for $5 million path to citizenship, replacing investor visas (Elliot Spagat/Associated Press)",
    "description": "Elliot Spagat / Associated Press:\nTrump says he will offer ‘gold cards’ for $5 million path to citizenship, replacing investor visas  —  President Donald Trump said Tuesday that he plans to offer a “gold card” visa with a path to citizenship for $5 million, r…",
    "link": "https://www.memeorandum.com/250225/p160",
    "timestamp": "2025-02-26T04:20:02Z"
  },
  {
    "title": "Why has bitcoin price crashed? Hacks, Fed fears and Trump’s broken promises",
    "description": "Crypto market is experiencing a ‘heliocentric reckoning’, industry experts tell The Independent",
    "link": "https://www.the-independent.com/tech/bitcoin-cryptocurrency-value-plunges-price-crash-b2704776.html",
    "timestamp": "2025-02-26T04:19:22Z"
  },
  {
    "title": "Ukraine Agrees to Mineral Deal with US",
    "description": "While President Trump has been trying to make progress on a deal to end the war in Ukraine, the US has also been negotiating a mineral rights deal designed to pay the US back for some of the support we've given Ukraine over the past three years since the Russ…",
    "link": "https://freerepublic.com/focus/f-news/4300517/posts",
    "timestamp": "2025-02-26T04:16:35Z"
  },
  {
    "title": "Apple shareholders vote to keep its diversity policies",
    "description": "Donald Trump has criticised corporate DEI programs as discriminatory and suggested the US Department of Justice could investigate whether such efforts violate the law.",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-shareholders-vote-to-keep-its-diversity-policies/articleshow/118571102.cms",
    "timestamp": "2025-02-26T04:15:36Z"
  },
  {
    "title": "US dockworkers approve 6-year contract, averting a strike",
    "description": "Dockworkers on the U.S. East and Gulf coasts have overwhelmingly approved a six-year contract, averting the threat of a strike that could have crippled the economy",
    "link": "https://abcnews.go.com/Business/wireStory/us-dockworkers-approve-6-year-contract-averting-strike-119193635",
    "timestamp": "2025-02-26T04:14:17Z"
  },
  {
    "title": "BREAKING: Republicans Clear Budget Resolution Hurdle on Largely Party-Line Vote",
    "description": "President Donald J. Trump's big, beautiful bill just mounted its first hurdle. Tuesday evening, the Congressional Budget Resolution (H. Con. Res. 14) establishing the congressional budget for the United States Government for fiscal year 2025 and setting forth…",
    "link": "https://freerepublic.com/focus/f-bloggers/4300514/posts",
    "timestamp": "2025-02-26T04:08:31Z"
  },
  {
    "title": "Tesla Shares Sink Below $1 Trillion As European Auto Sales Slump",
    "description": "Tesla sold less than 10,000 units in Europe last month, down around 45 per cent from a year earlier.",
    "link": "https://www.ndtv.com/world-news/tesla-shares-sink-below-1-trillion-as-european-auto-sales-slump-7796860",
    "timestamp": "2025-02-26T04:05:58Z"
  },
  {
    "title": "CNBC Daily Open: Trump’s policies are worrying investors and consumers",
    "description": "The \"Trump Bump\" — in which stocks and other assets, such as cryptocurrency, jumped after Donald Trump's election and inauguration — appears to have leveled off.\nNowhere is this clearer than in Tesla shares, which plunged on Tuesday, erasing most of a postele…",
    "link": "https://biztoc.com/x/a70545e2d5306d91",
    "timestamp": "2025-02-26T04:03:53Z"
  },
  {
    "title": "Mike Benz: How U.S. Taxpayers Funded Censorship And The CIA Manipulated Elections In Brazil",
    "description": "Patrick Bet-David sits down with Nikolas Ferreira and Mike Benz to dissect the deep connections between USAID, Brazilian corruption, and the political battle between Lula and Bolsonaro. \r\n\r\nPATRICK BET-DAVID: When you started talking about, I think it was the…",
    "link": "https://www.realclearpolitics.com/video/2025/02/25/mike_benz_how_us_taxpayers_funded_censorship_and_the_cia_manipulated_elections_in_brazil.html",
    "timestamp": "2025-02-26T04:03:03Z"
  },
  {
    "title": "Less than half of the federal workforce has responded to DOGE's 'what did you do' productivity email",
    "description": "White House press secretary Karoline Leavitt said more than one million federal workers sent in their list of accomplishments.",
    "link": "https://www.businessinsider.com/less-than-half-of-federal-workforce-replied-doge-productivity-email-2025-2",
    "timestamp": "2025-02-26T04:01:39Z"
  },
  {
    "title": "Feb. 25, 2025: DOT, DOI, DOE, FEMA Highlights",
    "description": "... Read more",
    "link": "https://www.wnd.com/2025/02/feb-25-2025-dot-doi-doe-fema-highlights/",
    "timestamp": "2025-02-26T04:00:54Z"
  }
]