[
  {
    "title": "Africa knew Trump’s ‘America First’ pledge meant it might be last. Then came the freeze on aid",
    "description": "JOHANNESBURG (AP) — Four days after President Donald Trump signed an executive order freezing almost all U.S. foreign aid, an email landed in Claris Madhuku’s inbox in rural Zimbabwe. Stop all activities immediately, it said. The message confirmed Madhuku’s f…",
    "link": "https://freerepublic.com/focus/f-news/4296150/posts",
    "timestamp": "2025-02-09T03:32:16Z"
  },
  {
    "title": "Trump strips security clearances from Anthony Blinken, Letitia James and Alvin Bragg",
    "description": "Donald Trump has stripped security clearances from several leading Democrats, including former Secretary of State Antony Blinken, Manhattan District Attorney Alvin Bragg and New York Attorney General Letitia James. The measure comes as the president continues…",
    "link": "https://freerepublic.com/focus/f-news/4296149/posts",
    "timestamp": "2025-02-09T03:31:22Z"
  },
  {
    "title": "Bitcoin Key Metric Signals Local Bottom – Price Rally On The Horizon?",
    "description": "As US President Donald Trump moved to impose new tariffs on Canada, Mexico, and China this past week, Bitcoin (BTC) prices fell to around $91,500 amidst fears of a global trade war. Although the maiden cryptocurrency quickly recovered from the flash crash, a …",
    "link": "https://bitcoinist.com/bitcoin-key-metric-signals-local-bottom-price-rally/",
    "timestamp": "2025-02-09T03:30:58Z"
  },
  {
    "title": "'The feel of a coup': Elon Musk said to be poised to 'defy' major judicial order",
    "description": "Elon Musk appears poised to defy a judicial order, according to observers.\n\nMusk, the richest man in the world and an appointee of Donald Trump, was dealt a blow over the weekend when a judge reportedly blocked Musk's Department of Government Efficiency (DOGE…",
    "link": "https://www.rawstory.com/trump-elon-coup-defy-order/",
    "timestamp": "2025-02-09T03:30:56Z"
  },
  {
    "title": "Unions lose fight to bar DOGE from Labor Department data",
    "description": "A federal judge rejected an attempt by some of the United States’s most powerful unions to block Elon Musk’s Department of Government Efficiency from accessing the Department of Labor’s data. On Friday, U.S. District Court for the District of Columbia Judge J…",
    "link": "https://freerepublic.com/focus/f-news/4296148/posts",
    "timestamp": "2025-02-09T03:26:31Z"
  },
  {
    "title": "Unions lose fight to bar DOGE from Labor Department data",
    "description": "A federal judge rejected an attempt by some of the United States’s most powerful unions to block Elon Musk’s Department of Government Efficiency from accessing the Department of Labor’s data. On Friday, U.S. District Court for the District of Columbia Judge J…",
    "link": "https://freerepublic.com/focus/f-chat/4296148/posts",
    "timestamp": "2025-02-09T03:26:31Z"
  },
  {
    "title": "Elon Musk says he has no plans to acquire TikTok's US operations",
    "description": "Elon Musk, the world's richest person and a top advisor to US President Donald Trump, said he has no interest in acquiring social media platform TikTok's operations in the United States, in comments released Saturday.",
    "link": "https://www.enca.com/business/elon-musk-says-he-has-no-plans-acquire-tiktoks-us-operations",
    "timestamp": "2025-02-09T03:23:28Z"
  },
  {
    "title": "Plummeting Tesla sales nothing to do with Musk, says consumer expert",
    "description": "A consumer research firm says plummeting Tesla sales in New Zealand have nothing to do with its chief executive's polarising views - but some local graffiti shows a different view.",
    "link": "https://www.rnz.co.nz/news/business/541345/plummeting-tesla-sales-nothing-to-do-with-musk-says-consumer-expert",
    "timestamp": "2025-02-09T03:22:47Z"
  },
  {
    "title": "Doctor Tells Journalist Mark Halperin That His Patients Are Still Experiencing Extreme Trauma Over the 2024 Election (VIDEO)",
    "description": "A recent interview highlights the profound psychological impact of the 2024 election, as a doctor reveals that many patients continue to grapple with severe trauma, shedding light on the election's lasting effects on mental health.\nThe post Doctor Tells Journ…",
    "link": "https://www.thegatewaypundit.com/2025/02/doctor-tells-journalist-mark-halperin-that-his-patients/",
    "timestamp": "2025-02-09T03:20:46Z"
  },
  {
    "title": "Hamas releases 3 Israeli hostages as ceasefire deal holds",
    "description": "GAZA: Hamas freed three more Israeli hostages Saturday and Israel responded with the release of 183 Palestinian prisoners in the latest exchange of hostages for prisoners as part of the first phase of a fragile ceasefire deal. This is the fifth exchange since…",
    "link": "https://english.khabarhub.com/2025/09/435159/",
    "timestamp": "2025-02-09T03:15:18Z"
  },
  {
    "title": "Donald Trump spares Harry! No deportation for Prince, but calls Meghan Markle ‘terrible’",
    "description": "US President Donald Trump has dismissed the possibility of deporting Prince Harry, despite legal scrutiny over the Duke of Sussex’s US visa. The Heritage Foundation has raised concerns that Harry may have misrepresented his past drug use during his applicatio…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-spares-harry-no-deportation-for-prince-but-calls-meghan-markle-terrible/articleshow/118080712.cms",
    "timestamp": "2025-02-09T03:11:57Z"
  },
  {
    "title": "North Korea slams US-South Korea-Japan partnership, vows to boost nuclear program",
    "description": "SEOUL, SOUTH KOREA — North Korean leader Kim Jong Un said an elevated U.S. security partnership with South Korea and Japan poses a grave threat to his country and vowed to bolster his nuclear weapons program, state media reported Sunday. \n\n\nKim has previously…",
    "link": "https://www.voanews.com/a/north-korea-slams-us-south-korea-japan-partnership-vows-to-boost-nuclear-program-/7968313.html",
    "timestamp": "2025-02-09T03:10:30Z"
  },
  {
    "title": "Modi’s Trump agenda to focus on trade, defense, Musk meeting",
    "description": "Prime Minister Narendra Modi is set to discuss reducing tariffs and increasing energy and defense purchases from the US during his meeting with President Trump. Additional meetings with US business leaders, including Elon Musk, are proposed. India seeks US in…",
    "link": "https://economictimes.indiatimes.com/news/india/modis-trump-agenda-to-focus-on-trade-defense-musk-meeting/articleshow/118081361.cms",
    "timestamp": "2025-02-09T03:06:23Z"
  },
  {
    "title": "DGA Awards Host Judd Apatow Takes Aim at Trump, Lively v. Baldoni and Himself: ‘I’m What Mel Brooks Would Look Like If He Took the Substance’",
    "description": "Judd Apatow took aim at President Donald Trump, Jeff Bezos, the “It Ends With Us” litigation spree and himself in his opening monologue Saturday at the 77th annual DGA Awards. Apatow, of course, riffed on how the country has taken a sharp turn to the right si…",
    "link": "https://variety.com/2025/film/news/judd-apatow-trump-musk-bezos-dga-awards-1236301563/",
    "timestamp": "2025-02-09T03:05:20Z"
  },
  {
    "title": "Musk risks putting EU buyers off Tesla: analysts",
    "description": "Elon Musk’s rapprochement with US President Donald Trump, his backing of European far-right parties and attacks on diversity policies could drive European buyers away from Tesla, analysts say. In both Germany and France, sales of the electric pioneer’s cars w…",
    "link": "https://www.digitaljournal.com/world/musk-risks-putting-eu-buyers-off-tesla-analysts/article",
    "timestamp": "2025-02-09T03:02:21Z"
  },
  {
    "title": "Trump policies on gender-affirming care and passports for transgender people challenged in court",
    "description": "Two of President Donald Trump’s executive orders targeting the rights of transgender and nonbinary people face court challenges filed Friday.",
    "link": "https://www.wave3.com/2025/02/08/trump-policies-gender-affirming-care-passports-transgender-people-challenged-court/",
    "timestamp": "2025-02-09T03:00:37Z"
  },
  {
    "title": "Unhinged Liberal Podcast Hosts Want Elon Musk’s DOGE Workers Put in Prison – Musk Responds (VIDEO)",
    "description": "In a heated exchange, Kara Swisher and Scott Galloway demand the imprisonment of Elon Musk's DOGE workers, igniting a fierce backlash from Musk himself. Their alarming rhetoric raises critical questions about power and accountability in today's political land…",
    "link": "https://www.thegatewaypundit.com/2025/02/unhinged-liberal-podcast-hosts-want-elon-musks-doge/",
    "timestamp": "2025-02-09T03:00:21Z"
  },
  {
    "title": "Musk Risks Putting EU Buyers Off Tesla: Analysts",
    "description": "Elon Musk's rapprochement with US President Donald Trump, his backing of European far-right parties and attacks on diversity policies could drive European buyers away from Tesla, analysts say.",
    "link": "https://www.ibtimes.com/musk-risks-putting-eu-buyers-off-tesla-analysts-3763001",
    "timestamp": "2025-02-09T03:00:11Z"
  },
  {
    "title": "Ishiba Echoes Trump That Nippon Steel Will Invest in US Steel",
    "description": "(Bloomberg) -- Japanese Prime Minister Shigeru Ishiba said that Nippon Steel Corp. will be investing in United States Steel Corp., which will remain an...",
    "link": "https://finance.yahoo.com/news/ishiba-echoes-trump-nippon-steel-025811839.html",
    "timestamp": "2025-02-09T02:58:11Z"
  },
  {
    "title": "Kennedy Center responds to Trump's announcement that he's taking over as chairman - WUSA9.com",
    "description": "Kennedy Center responds to Trump's announcement that he's taking over as chairmanWUSA9.com Trump says he's firing Kennedy Center board of trustees members and naming himself chairmanThe Associated Press Longtime member of the Kennedy Center reacts to Presiden…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176160855",
    "timestamp": "2025-02-09T02:52:36Z"
  },
  {
    "title": "'Massive damage': Trump ally teases 'very damaging receipts' against key President enemy",
    "description": "Donald Trump on Saturday promoted a comment from an ally who was criticizing New York Attorney General Letitia James, and shortly after another ally was seeking to release \"damaging receipts\" on James.\n\nTrump over the weekend took to his own social media site…",
    "link": "https://www.rawstory.com/trump-loomer-letitia-james-receipts/",
    "timestamp": "2025-02-09T02:48:19Z"
  },
  {
    "title": "‘Baffled’: NBC Reporter Says Ex-Officials Stunned Pam Bondi Disbanded DOJ Task Force Combating China And Russia",
    "description": "MSNBC anchor Ana Cabrera spoke to NBC News Justice and Intelligence Correspondent Ken Dilanian on Friday about the latest moves made by Trump’s new attorney general at the Department of Justice.“One of the first things Pam Bondi did as attorney general she’d …",
    "link": "https://freerepublic.com/focus/f-news/4296141/posts",
    "timestamp": "2025-02-09T02:45:55Z"
  },
  {
    "title": "Trump directs Secret Service to give him ‘every bit of information’ about his attempted assassins: report",
    "description": "President Trump said Friday he has ordered the Secret Service to provide him with all information related to the attempts on his life during the presidential campaign.",
    "link": "https://www.foxnews.com/politics/trump-directs-secret-service-give-him-every-bit-information-his-attempted-assassins",
    "timestamp": "2025-02-09T02:45:23Z"
  },
  {
    "title": "Russia says it sees no positive steps from US on disarmament, RIA reports",
    "description": "(Reuters) - Russia is yet to see any positive steps from the new U.S. administration on disarmament, Russia's permanent representative to the United Nations in Geneva said in an interview published on Sunday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/09/russia-says-it-sees-no-positive-steps-from-us-on-disarmament-ria-reports",
    "timestamp": "2025-02-09T02:44:00Z"
  },
  {
    "title": "Trump revokes security clearances for Biden's top diplomat, security official",
    "description": "WASHINGTON: President Donald Trump has revoked security clearances for Antony Blinken, the former secretary of state, and Jake Sullivan, the former national security adviser, White House officials said on Saturday (Feb 8). The move came a day after Trump said…",
    "link": "https://www.channelnewsasia.com/world/trump-revokes-security-clearance-blinken-biden-4926456",
    "timestamp": "2025-02-09T02:44:00Z"
  },
  {
    "title": "Patriots owner Robert Kraft opens up on Trump attending Super Bowl LIX, Tom Brady calling the game",
    "description": "\"It just shows you that maybe the NFL and the Super Bowl are important if we got the president of the United States coming as a guest.\"",
    "link": "https://nypost.com/2025/02/08/sports/patriots-owner-robert-kraft-opens-up-on-trump-attending-super-bowl-lix-tom-brady-calling-the-game/",
    "timestamp": "2025-02-09T02:42:41Z"
  },
  {
    "title": "Head of abductees' families relieved over Japan-U.S. talks",
    "description": "Takuya Yokota, 56, is a brother of Megumi Yokota, who was abducted by North Korea in 1977 when she was just 13 years old.",
    "link": "https://www.japantimes.co.jp/news/2025/02/09/japan/ishiba-trump-nk-abduction/",
    "timestamp": "2025-02-09T02:40:00Z"
  },
  {
    "title": "Japan prime minister voices optimism over averting US tariffs",
    "description": "TOKYO — Japanese Prime Minister Shigeru Ishiba expressed optimism on Sunday that his country could avoid higher U.S. tariffs, saying President Donald Trump had recognized Japan's huge investment in the U.S. and the American jobs that it creates.\n\n\nAt his firs…",
    "link": "https://www.voanews.com/a/japan-prime-minister-voices-optimism-over-averting-us-tariffs/7968310.html",
    "timestamp": "2025-02-09T02:38:36Z"
  },
  {
    "title": "Sources: President Donald Trump has tasked Vice President JD Vance and National Security Adviser Michael Waltz with overseeing a potential sale of TikTok US",
    "description": "Every issue of the Punchbowl News newsletter, including our special editions, right here at your fingertips.\nJoin the community, and get the morning edition delivered straight to your inbox.\nPRESENTED BY\nTHE TOP\nHappy Friday morning.\nNews: President Donald Tr…",
    "link": "https://biztoc.com/x/d85c44cdb7fb9a72",
    "timestamp": "2025-02-09T02:37:56Z"
  },
  {
    "title": "Ukraine NGOs, veterans scramble for funding after US aid freeze",
    "description": "Mykhailo received a flurry of messages when US President Donald Trump suspended international aid, a move that endangered the NGO where he works helping Ukrainian veterans. In January, Trump ordered the suspension of foreign assistance. Then on Friday he call…",
    "link": "https://www.digitaljournal.com/world/ukraine-ngos-veterans-scramble-for-funding-after-us-aid-freeze/article",
    "timestamp": "2025-02-09T02:37:20Z"
  },
  {
    "title": "Ukraine NGOs, Veterans Scramble For Funding After US Aid Freeze",
    "description": "Mykhailo received a flurry of messages when US President Donald Trump suspended international aid, a move that endangered the NGO where he works helping Ukrainian veterans.",
    "link": "https://www.ibtimes.com/ukraine-ngos-veterans-scramble-funding-after-us-aid-freeze-3762995",
    "timestamp": "2025-02-09T02:36:13Z"
  },
  {
    "title": "Trump Says He’ll Audit the Pentagon",
    "description": "Reprinted from Bracing Views with the author’s permission. President Donald Trump says he’s ready to tackle the Pentagon, which has failed seven audits in a row. He says America might save “trillions” after effective audits. Will it happen? The Pentagon budge…",
    "link": "https://www.antiwar.com/blog/2025/02/08/trump-says-hell-audit-the-pentagon/",
    "timestamp": "2025-02-09T02:36:09Z"
  },
  {
    "title": "Ukraine NGOs, Veterans Scramble For Funding After US Aid Freeze",
    "description": "Mykhailo received a flurry of messages when US President Donald Trump suspended international aid, a move that endangered the NGO where he works helping Ukrainian veterans.",
    "link": "https://www.ibtimes.com.au/ukraine-ngos-veterans-scramble-funding-after-us-aid-freeze-1856018",
    "timestamp": "2025-02-09T02:36:08Z"
  },
  {
    "title": "There is no need for Joe Biden to continue receiving access to classified information.",
    "description": "Therefore, we are immediately revoking Joe Biden’s Security Clearances, and stopping his daily Intelligence Briefings. He set this precedent in 2021, when he instructed the Intelligence Community (IC) to stop the 45th President of the United States (ME!) from…",
    "link": "https://freerepublic.com/focus/f-chat/4296139/posts",
    "timestamp": "2025-02-09T02:34:02Z"
  },
  {
    "title": "Trump tariff threat causing ‘paralysis and uncertainty’ in big employers, says Kildare chamber chief",
    "description": "There is a “palpable sense of uncertainty” and “paralysis” among some of Ireland’s biggest employers with US president Donald Trump set to hit Europe next with trade tariffs.",
    "link": "https://www.independent.ie/irish-news/trump-tariff-threat-causing-paralysis-and-uncertainty-in-big-employers-says-kildare-chamber-chief/a1883068208.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Irish charities hit by US aid freeze as life-saving work grinds to halt",
    "description": "Nadine Ferris France was in Nairobi when she read the email that brought international development aid to a shuddering halt.",
    "link": "https://www.independent.ie/irish-news/irish-charities-hit-by-us-aid-freeze-as-life-saving-work-grinds-to-halt/a1302189416.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "The Sunday Independent's View: We have to hold our nerve in face of bully Donald Trump",
    "description": "As Ireland waits anxiously to see if President Donald Trump will follow through on his threat to impose tariffs on the EU, the international situation is starting to feel reminiscent of the climactic showdown in the classic film The Good, the Bad and the Ugly.",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-we-have-to-hold-our-nerve-in-face-of-bully-donald-trump/a1347807159.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "David Quinn: Trading blows with ‘awful gowl’ Donald Trump in the past could come back to bite us now",
    "description": "Back in 2000, Mary Harney, then enterprise minister, famously told an American Bar Association meeting in Dublin that: “Geographically, we are closer to Berlin than Boston. Spiritually, we are probably a lot closer to Boston than Berlin.”",
    "link": "https://www.independent.ie/opinion/comment/david-quinn-trading-blows-with-awful-gowl-donald-trump-in-the-past-could-come-back-to-bite-us-now/a1308509020.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Barry O’Halloran: Trump’s bonkers Gaza plan is a WTF moment, but it’s also calling the Arab states’ bluff",
    "description": "Just when we thought Donald Trump had exhausted our capacity for shock, he does it again, nonchalantly announcing on live television that the United States was going to assume control of Gaza.",
    "link": "https://www.independent.ie/opinion/comment/barry-ohalloran-trumps-bonkers-gaza-plan-is-a-wtf-moment-but-its-also-calling-the-arab-states-bluff/a577922866.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Blame game kicks off, with first cracks starting to appear in the Coalition",
    "description": "Cracks are starting to appear in the newly formed Coalition, with Fine Gael blaming Fianna Fáil in a row over housing figures and the handling of Storm Éowyn and also for likening Donald Trump taking over the White House to Brexit.",
    "link": "https://www.independent.ie/irish-news/blame-game-kicks-off-with-first-cracks-starting-to-appear-in-the-coalition/a2095471504.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "‘Something’s got to give’ – Warning Trump factor could cause ‘much-needed correction’ in Irish housing market",
    "description": "The ‘Trump factor’ is poised to create a much-needed 'correction' in Ireland’s soaring housing market, an industry veteran has warned.",
    "link": "https://www.independent.ie/business/irish/somethings-got-to-give-warning-trump-factor-could-cause-much-needed-correction-in-irish-housing-market/a1798165031.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Richard Curran: Dense fog of Trump trade war could play into the hands of Conor McGregor’s former whiskey",
    "description": "You can’t accuse the new Government of doing nothing when it comes to the uncertainty wrought by the return of Donald Trump to the White House.",
    "link": "https://www.independent.ie/business/irish/richard-curran-dense-fog-of-trump-trade-war-could-play-into-the-hands-of-conor-mcgregors-former-whiskey/a1099401059.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Blame game kicks off, with first cracks starting to appear in the Coalition",
    "description": "Cracks are starting to appear in the newly formed Coalition, with Fine Gael blaming Fianna Fáil in a row over housing figures and the handling of Storm Éowyn and also for likening Donald Trump taking over the White House to Brexit.",
    "link": "https://www.independent.ie/irish-news/politics/blame-game-kicks-off-with-first-cracks-starting-to-appear-in-the-coalition/a2095471504.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "‘My sister was killed in a safe zone,’ says young Gazan woman in Ireland, branding Donald Trump plan as ‘insane’",
    "description": "A Gazan woman who was evacuated from the warzone last year and now lives and studies in Ireland, has said the recent intervention by US president Donald Trump is “insane”, and says she fears for the safety of her parents, who are still trapped in the enclave.",
    "link": "https://www.independent.ie/irish-news/my-sister-was-killed-in-a-safe-zone-says-young-gazan-woman-in-ireland-branding-donald-trump-plan-as-insane/a2110957253.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Brendan O’Connor: We’d like a bit of America’s momentum, but without its madness thanks",
    "description": "A lot of us made a decision after the whole tariff rollercoaster last weekend. It is a decision we had made many times in the past and that we will make many more times in the future. We decided we couldn’t be going up and down with Donald Trump for the next …",
    "link": "https://www.independent.ie/opinion/brendan-oconnor-wed-like-a-bit-of-americas-momentum-but-without-its-madness-thanks/a1994652114.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Colin Murphy: The tech ethos of ‘move fast and break things’ is now US government policy",
    "description": "“Do not obey in advance.” In On Tyranny, the short guide to preserving democracy by the historian Timothy Snyder, this is the first of 20 lessons. “Most of the power of authoritarianism is freely given,” he elaborates. “In times like these, individuals think …",
    "link": "https://www.independent.ie/opinion/colin-murphy-the-tech-ethos-of-move-fast-and-break-things-is-now-us-government-policy/a1458290587.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "Letters: Where there’s a will, there’s a long-lost friend or relative",
    "description": "Sir — I read with great interest Sara Colohan’s essay (‘Behind St Brigid’s walls: stories of hidden lives that mustn’t be forgotten’, Sunday Independent, February 2).",
    "link": "https://www.independent.ie/opinion/letters/letters-where-theres-a-will-theres-a-long-lost-friend-or-relative/a420553560.html",
    "timestamp": "2025-02-09T02:30:00Z"
  },
  {
    "title": "North Korea's Kim slams US-South Korea-Japan partnership and vows to boost his nuclear program",
    "description": "North Korean leader Kim Jong Un has said an elevated U.S. security partnership with South Korea and Japan poses a grave threat to his country and vowed to further bolster his nuclear weapons program",
    "link": "https://abcnews.go.com/International/wireStory/north-koreas-kim-slams-us-south-korea-japan-118614035",
    "timestamp": "2025-02-09T02:29:47Z"
  },
  {
    "title": "Trump revokes security clearances for Blinken, other Biden officials",
    "description": "US President rescinds security clearances for former Secretary of State Blinken, former National Security Adviser Jake Sullivan and other officials from the Biden administration, following his earlier revocation of security clearance for Biden.",
    "link": "https://www.israelnationalnews.com/news/403620",
    "timestamp": "2025-02-09T02:28:19Z"
  },
  {
    "title": "US judge declines to block Elon Musk's DOGE from Labor Department systems - NewsBreak",
    "description": "(Reuters) -A federal judge on Friday declined to block Elon Musk's government cost-cutting department from accessing the U.S. Department of Labor's systems",
    "link": "https://www.newsbreak.com/share/3796596022539-us-judge-declines-to-block-elon-musk-s-doge-from-labor-department-systems?s=a99&share_destination_id=MTI5MzEyMjE2LTE3MzkwNjgwMDI2Mjk%3D&pd=08ka0uBv&hl=en_US&send_time=1739068002&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-control%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v2",
    "timestamp": "2025-02-09T02:27:10Z"
  },
  {
    "title": "How Japan prime minister's homework on Trump paid off",
    "description": "The Japanese prime minister gets much needed reassurances that his country is still America's top ally.",
    "link": "https://www.bbc.com/news/articles/cy8pwd0p46wo",
    "timestamp": "2025-02-09T02:24:52Z"
  },
  {
    "title": "Trump revokes security clearances for Blinken, Sullivan",
    "description": "President Donald Trump has revoked security clearances for Antony Blinken, the former secretary of state, and Jake Sullivan, the former national security adviser, White House officials said on Saturday. The move came a day after Trump said he had revoked the …",
    "link": "https://japantoday.com/category/world/trump-revokes-security-clearances-for-biden%27s-top-diplomat-security-official",
    "timestamp": "2025-02-09T02:23:09Z"
  },
  {
    "title": "Middle East peace parliament: A Trump legacy for humanity",
    "description": "I hope a “Middle East Parliament for Peace\" will be realized under President Trump’s leadership to serve as a “nurturing mother” for emerging peace agreements.",
    "link": "https://www.jpost.com/opinion/article-841222",
    "timestamp": "2025-02-09T02:22:17Z"
  },
  {
    "title": "Judge Paul Engelmayer Completely Bans All Trump Appointees From Accessing All Data or Facilities (Satire / Vanity_",
    "description": "US District Court Judge Paul Engelmayer’s decided on Saturday to bar all Trump administration political appointees, including Treasury Secretary Scott Bessent, from accessing critical Treasury Department data. Following this decision, which was rendered ex pa…",
    "link": "https://freerepublic.com/focus/f-chat/4296138/posts",
    "timestamp": "2025-02-09T02:21:20Z"
  },
  {
    "title": "VOA immigration weekly recap, Feb. 2–8",
    "description": "Editor's note: Here is a look at immigration-related news around the U.S. this week. Questions? Tips? Comments? Email the VOA immigration team: ImmigrationUnit@voanews.com.\n\n\nHistorical precedent, legal questions swirl around Trump plan to detain migrants at …",
    "link": "https://www.voanews.com/a/voa-immigration-weekly-recap-feb-2-8/7968304.html",
    "timestamp": "2025-02-09T02:20:53Z"
  },
  {
    "title": "A careful examination of New Your Attorney General Letitia James financial disclosures shows she inflated the value of her assets in order to get mortgages on various commercial properties...",
    "description": "...EXACTLY what she falsely accused President Trump of doing!",
    "link": "https://freerepublic.com/focus/f-chat/4296137/posts",
    "timestamp": "2025-02-09T02:18:28Z"
  },
  {
    "title": "2025 Directors Guild Awards Winners List",
    "description": "The ceremony is taking place at the Beverly Hilton with Judd Apatow returning as host.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/2025-directors-guild-awards-winners-list-1236131036/",
    "timestamp": "2025-02-09T02:17:26Z"
  },
  {
    "title": "North Korea's Kim Jong Un slams US-South Korea-Japan partnership and vows to boost his nuclear program",
    "description": "North Korea's Kim Jong Un views the U.S. security partnership with South Korea and Japan as a threat and vows to strengthen his nuclear program. He criticized the trilateral alliance for disrupting regional security. Amid stalled diplomacy, Kim focuses on mil…",
    "link": "https://economictimes.indiatimes.com/news/defence/north-koreas-kim-jong-un-slams-us-south-korea-japan-partnership-and-vows-to-boost-his-nuclear-program/articleshow/118080776.cms",
    "timestamp": "2025-02-09T02:13:56Z"
  },
  {
    "title": "Trump says he’s firing Kennedy Center board of trustees members and naming himself chairman - KTLA Los Angeles",
    "description": "Trump says he’s firing Kennedy Center board of trustees members and naming himself chairmanKTLA Los Angeles Trump says he's firing Kennedy Center board of trustees members and naming himself chairmanThe Associated Press Longtime member of the Kennedy Center r…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176160723",
    "timestamp": "2025-02-09T02:13:07Z"
  },
  {
    "title": "Canada Makes Case to US States Against Return of Trump Tariffs - Bloomberg",
    "description": "Canada Makes Case to US States Against Return of Trump TariffsBloomberg Automakers say Trump tariffs on Canada and Mexico will cause U.S. car prices to riseCBS News Why Donald Trump’s protectionist zeal has only grownThe Economist The Early Verdict on Tariffs…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176160721",
    "timestamp": "2025-02-09T02:12:57Z"
  },
  {
    "title": "We Stand On Guard Sales Jump Amidst US/Canada Tariff Tensions",
    "description": "We Stand On Guard, Image Comics\nAn unexpected comic book series is topping Amazon Canada’s sales charts a decade after its publication — and current events may be playing a role for its resurgence. This week, Image Comics noted that We Stand On Guard, a 2015 …",
    "link": "http://comicbook.com/comics/news/we-stand-on-guard-sales-jump-amidst-us-canada-tariff-tensions/",
    "timestamp": "2025-02-09T02:09:42Z"
  },
  {
    "title": "Rapper feud, Trump's history and Becks: Things to watch out for at Super Bowl 59",
    "description": "Will Kendrick Lamar use his half-time show to beef with Drake and will Taylor Swift also get a ring?",
    "link": "https://www.bbc.com/news/articles/cqx9p9jj0vwo",
    "timestamp": "2025-02-09T02:08:06Z"
  },
  {
    "title": "Kevin Costner says making movies has ‘nothing to do with politics’",
    "description": "Kevin Costner voiced his opinion that politics shouldn't influence movie-making in Hollywood. He said that filmmakers should focus on keeping the \"audience in mind.\"",
    "link": "https://www.foxnews.com/entertainment/kevin-costner-making-movies-nothing-politics",
    "timestamp": "2025-02-09T02:07:35Z"
  },
  {
    "title": "Japan PM Ishiba, after meeting Trump, voices optimism over averting tariffs",
    "description": "Japanese Prime Minister Shigeru Ishiba expressed optimism that Japan might avoid higher U.S. tariffs, highlighting the significant investments Japan has made in the U.S. and the jobs created as a result. Ishiba believes that Japanese investments benefiting bo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/japan-pm-ishiba-after-meeting-trump-voices-optimism-over-averting-tariffs/articleshow/118080702.cms",
    "timestamp": "2025-02-09T02:07:32Z"
  },
  {
    "title": "Trump administration moves to send $8 billion in arms to Israel, bypassing some lawmakers",
    "description": "The State Department notified Congress of an $8 billion arms sale to Israel, bypassing an informal review process. Despite concerns from top Democrat Gregory W. Meeks, the sales will likely proceed as halting them requires a two-thirds vote in both houses. Pa…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-administration-moves-to-send-8-billion-in-arms-to-israel-bypassing-some-lawmakers/articleshow/118080631.cms",
    "timestamp": "2025-02-09T02:01:37Z"
  },
  {
    "title": "Japan PM Ishiba, after meeting Trump, voices optimism over averting tariffs",
    "description": "Japanese Prime Minister Shigeru Ishiba expressed optimism on Sunday that his country could avoid higher U.S. tariffs, saying President Donald Trump had...",
    "link": "https://www.yahoo.com/news/japan-pm-ishiba-meeting-trump-020048550.html",
    "timestamp": "2025-02-09T02:00:48Z"
  },
  {
    "title": "Trump Says He Will Meet Ukraine’s Zelensky Next Week To Discuss an End to the War",
    "description": "Trump's planned meeting with Ukraine’s Zelensky next week aims to address the ongoing conflict, signaling a potential shift in U.S. diplomatic strategy. Insights into their discussions could reshape international relations.\nThe post Trump Says He Will Meet Uk…",
    "link": "https://www.thegatewaypundit.com/2025/02/trump-says-he-will-meet-ukraines-zelensky-next/",
    "timestamp": "2025-02-09T02:00:30Z"
  },
  {
    "title": "Senator Chris Murphy just organized this massive protest of Donald Trump and Elon Musk’s seizure of power.",
    "description": "Democrats are organized and ready to fight back. Let’s go.",
    "link": "https://freerepublic.com/focus/f-chat/4296133/posts",
    "timestamp": "2025-02-09T01:59:16Z"
  },
  {
    "title": "‘There’s A Culture Of Corruption’: Former USAID Director Spills Agency’s Abuse And Waste That He Says Runs Deep",
    "description": "A former U.S. Agency for International Development (USAID) director appeared Wednesday on Fox News to reveal details on what he said were the agency’s misused resources and deeply rooted corruption. Dating back to the early days of the Trump administration, f…",
    "link": "https://freerepublic.com/focus/f-news/4296132/posts",
    "timestamp": "2025-02-09T01:52:37Z"
  },
  {
    "title": "\"He's Got Enough Problems With...\": Trump On Why He Won't Deport Prince Harry",
    "description": "US President Donald Trump has ruled out deporting Prince Harry from the United States, despite ongoing litigation questioning the Duke of Sussex&#039;s immigration status.",
    "link": "https://www.ndtv.com/world-news/hes-got-enough-problems-with-his-wife-trump-says-he-wont-deport-prince-harry-7668178",
    "timestamp": "2025-02-09T01:50:24Z"
  },
  {
    "title": "Dem Dan Goldman Torches ‘Trump’s Buffoons’ At Intel Agencies: ‘Double Agents’ Will Refuse To Work With Them (nutty Dems)",
    "description": "SNIPOn Thursday’s edition of The Dean Obeidallah Show, Obeidallah asked Rep. Goldman “Are you concerned he’s actually make our nation less safe?” — and got an emphatic response:DEAN OBEIDALLAH: Are you concerned he’s actually make our nation less safe?REP. DA…",
    "link": "https://freerepublic.com/focus/f-chat/4296131/posts",
    "timestamp": "2025-02-09T01:49:13Z"
  },
  {
    "title": "Trump, Swift join Super Bowl party as Chiefs chase 'three-peat'",
    "description": "<p>NEW ORLEANS - The Kansas City Chiefs aim for a historic hat-trick of Super Bowl titles on Sunday when they take on the Philadelphia Eagles in front of a star-studded crowd in New Orleans headed by US President Donald Trump.</p>",
    "link": "https://www.bangkokpost.com/world/2957246/trump-swift-join-super-bowl-party-as-chiefs-chase-three-peat",
    "timestamp": "2025-02-09T01:45:00Z"
  },
  {
    "title": "'Replacing human workforce': Federal insider spills about Elon Musk's 'end goal'",
    "description": "Elon Musk hopes to eventually replace the entire human workforce within the federal government, instead implementing machines and AI, a federal insider said, according to a new report.Musk, a Donald Trump appointee and the richest man in the world, has been a…",
    "link": "https://www.rawstory.com/musk-replace-machines-end-goal/",
    "timestamp": "2025-02-09T01:44:55Z"
  },
  {
    "title": "North Korean leader Kim Jong Un vows to further develop nuclear forces",
    "description": "<![CDATA[ Kim has criticised military cooperation among the US, Japan and South Korea for raising regional tensions, saying they \"posed a grave challenge to the security environment\".  ]]>",
    "link": "https://www.channelnewsasia.com/east-asia/north-korea-kim-military-tensions-japan-south-korea-us-4926471",
    "timestamp": "2025-02-09T01:44:05Z"
  },
  {
    "title": "Scientists deplore sharp US cut in medical research funding",
    "description": "WASHINGTON: The US agency overseeing medical research has announced a major cut in funding to universities and research centres, a move strongly condemned by scientists and academics who say work on cancer and other diseases will suffer. The National Institut…",
    "link": "https://www.channelnewsasia.com/world/scientists-deplore-sharp-us-cut-medical-research-funding-4926476",
    "timestamp": "2025-02-09T01:43:52Z"
  },
  {
    "title": "US consumer finance watchdog workers protest Musk's DOGE",
    "description": "Workers at the U.S. Consumer Finance Protection Bureau protested against Elon Musk's actions and potential threat to the bureau’s security. The union accused Musk’s DOGE agency of gaining improper access to sensitive systems, raising concerns over data safety…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-consumer-finance-watchdog-workers-protest-musks-doge/articleshow/118080444.cms",
    "timestamp": "2025-02-09T01:43:04Z"
  },
  {
    "title": "Fanatics Super Bowl Party 2025 - See Photos of the Attendees of Michael Rubin's Annual Bash",
    "description": "So many stars stepped out to attend Michael Rubin’s annual Fanatics Super Bowl Party ahead of the big game on Saturday night (February 8) in New Orleans, Louisiana. The big game takes place and Sunday and sees the Kansas City Chiefs facing off against the Phi…",
    "link": "https://www.justjared.com/2025/02/08/fanatics-super-bowl-party-2025-see-photos-of-the-attendees-of-michael-rubins-annual-bash/",
    "timestamp": "2025-02-09T01:42:18Z"
  },
  {
    "title": "\"Please Free My Brother\": Kanye West Asks Donald Trump To Release Diddy",
    "description": "Sean &#039;Diddy&#039; Combs is currently in jail at the Metropolitan Detention Center in Brooklyn, awaiting his criminal trial.",
    "link": "https://www.ndtv.com/world-news/kanye-west-asks-donald-trump-to-release-rapper-sean-diddy-combs-please-free-my-brother-7668132",
    "timestamp": "2025-02-09T01:39:24Z"
  },
  {
    "title": "Tuberville introduces bill to stop 'unjust double tax' on Social Security benefits",
    "description": "U.S. Sen. Tommy Tuberville (R-Auburn) introduced legislation to stop the \"unjust double tax\" on Social Security benefits this week. The bill, called the Senior Citizens Tax Elimination Act, would deliver on one of President Donald Trump's campaign promises an…",
    "link": "https://freerepublic.com/focus/f-news/4296128/posts",
    "timestamp": "2025-02-09T01:38:41Z"
  },
  {
    "title": "Trump Revokes Security Clearances Of Biden's Top Officials Blinken, Sullivan",
    "description": "After Joe Biden, US President Donald Trump has revoked the security clearances of his Secretary of State Antony Blinken and former national security adviser Jake Sullivan, White House officials said on Saturday.",
    "link": "https://www.ndtv.com/world-news/after-joe-biden-donald-trump-removes-security-clearances-for-antony-blinken-jake-sullivan-and-other-officials-who-tangled-with-him-7668124",
    "timestamp": "2025-02-09T01:31:53Z"
  },
  {
    "title": "Lasers aid river search for debris from plane-helicopter collision",
    "description": "Crews continuing to search for debris from the deadly collision of a passenger jet and Army helicopter near Washington used a plane outfitted with lasers to scan the bottom of the Potomac River early Saturday, the National Transportation Safety Board said. \n\n…",
    "link": "https://www.voanews.com/a/lasers-aid-river-search-for-debris-from-plane-helicopter-collision-/7968296.html",
    "timestamp": "2025-02-09T01:30:56Z"
  },
  {
    "title": "Where The Original Captain America Cast Are Now, 14 Years After The MCU's First Avenger",
    "description": "Captain America: The First Avenger boasts a pretty stacked cast of actors, and many of them have gone on to star in huge Hollywood productions.",
    "link": "https://screenrant.com/captain-america-first-avengers-cast-in-2025/",
    "timestamp": "2025-02-09T01:20:16Z"
  },
  {
    "title": "\"Not Chomping At The Bit\": Elon Musk On His Plans To Acquire TikTok",
    "description": "Elon Musk said that he was not interested in purchasing TikTok, the popular short-video app that the US has been trying to ban over national security concerns.",
    "link": "https://www.ndtv.com/world-news/not-chomping-at-the-bit-elon-musk-on-his-plans-to-acquire-tiktok-7668067",
    "timestamp": "2025-02-09T01:19:38Z"
  },
  {
    "title": "Russell Vought takes over as CFPB's acting head",
    "description": "Office of Management and Budget Director Russell Vought has taken on the role of acting head of the Consumer Financial Protection Bureau, according to an OMB spokesperson and a source familiar with the situation.",
    "link": "https://www.nbcnews.com/politics/doge/russell-vought-consumer-financial-protection-bureau-trump-rcna191356",
    "timestamp": "2025-02-09T01:19:25Z"
  },
  {
    "title": "Inside Trump’s hectic day-to-day schedule as prez begins to transform federal government",
    "description": "In the renewed vigor of the Oval Office, President Trump doesn’t take meetings in the traditional sense, where one guest leaves before another departs.",
    "link": "https://nypost.com/2025/02/08/us-news/inside-trumps-hectic-day-to-day-schedule-as-prez-begins-to-transform-federal-government/",
    "timestamp": "2025-02-09T01:18:53Z"
  },
  {
    "title": "Justin Trudeau Says on Hot Mic That Canda Becoming 51st U.S. State is a ‘Real Worry’",
    "description": "The Prime Minister added that Trump's administration knows \"how many critical minerals we have\" and that could be why \"they keep talking about absorbing us\"\nThe post Justin Trudeau Says on Hot Mic That Canda Becoming 51st U.S. State is a ‘Real Worry’ appeared…",
    "link": "https://www.thewrap.com/justin-trudeau-hot-mic-canada-51st-state-real-worry/",
    "timestamp": "2025-02-09T01:17:14Z"
  },
  {
    "title": "Harry and Meghan cheer from stands at Invictus Games in Canada",
    "description": "The couple watched from the stands, cheering and clapping for the UK's team.",
    "link": "https://www.bbc.com/news/articles/c6271nygd1jo",
    "timestamp": "2025-02-09T01:14:49Z"
  },
  {
    "title": "Elon Musk slams 'mean' podcast hosts for calling DOGE employees 'arrogant little pr---s' among other things",
    "description": "Elon Musk punches back at podcast hosts Kara Swisher and Scott Galloway for their abrasive and \"threatening\" comments about young DOGE employees.",
    "link": "https://www.foxnews.com/media/elon-musk-slams-mean-podcast-hosts-calling-doge-employees-arrogant-little-p-s-among-other-things",
    "timestamp": "2025-02-09T01:13:25Z"
  },
  {
    "title": "ICC condemns sanctions by Trump admn",
    "description": "The Hague (AP) -- The International Criminal Court on Friday called on its member states to stand up against sanctions imposed by US President Donald Trump, saying that the move was an attempt to “harm its independent and impartial judicial work”. And the emb…",
    "link": "https://freerepublic.com/focus/f-news/4296121/posts",
    "timestamp": "2025-02-09T01:11:19Z"
  },
  {
    "title": "'Trump is greatest friend Israel has ever had,' Netanyahu says in exclusive interview",
    "description": "Israel has no greater friend than America, \"especially under President Trump's leadership,\" he said.",
    "link": "https://www.jpost.com/israel-news/article-841243",
    "timestamp": "2025-02-09T01:07:44Z"
  },
  {
    "title": "US judge temporarily blocks Musk's DOGE from accessing payment systems",
    "description": "A federal judge early Saturday temporarily blocked billionaire Elon Musk's government efficiency team and Trump administration political appointees from accessing government systems used to process trillions of dollars in payments, citing a risk that sensitiv…",
    "link": "https://www.voanews.com/a/us-judge-temporarily-blocks-musk-s-doge-from-accessing-payment-systems/7968292.html",
    "timestamp": "2025-02-09T01:06:13Z"
  },
  {
    "title": "Trump freezes all South African assistance as standoff escalates",
    "description": "South Africa’s Foreign Ministry expressed \"great concern that the foundational premise of this order lacks factual accuracy,” in a statement Saturday.",
    "link": "https://www.japantimes.co.jp/news/2025/02/09/world/trump-freeze-aid-south-africa/",
    "timestamp": "2025-02-09T01:06:00Z"
  },
  {
    "title": "The Story Behind That Time A Home Alone Star Ran Up A $7000 Tab On Donald Trump's Dime",
    "description": "Talk about running a tab!",
    "link": "https://www.cinemablend.com/movies/story-behind-time-home-alone-star-daniel-stern-7000-tab-donald-trump-dime",
    "timestamp": "2025-02-09T01:06:00Z"
  },
  {
    "title": "Time to Cut ‘Red Tape’ in Way of Hurricane Recovery, Says DHS Secretary Noem",
    "description": "SWANNANOA, NORTH CAROLINA—Four months after Hurricane Helene devastated western North Carolina, Homeland Security Secretary Kristi Noem says the federal government will continue to provide support... Read More\nThe post Time to Cut ‘Red Tape’ in Way of Hurrica…",
    "link": "https://www.dailysignal.com/2025/02/08/time-cut-red-tape-way-hurricane-recovery-says-dhs-secretary-noem/",
    "timestamp": "2025-02-09T01:05:07Z"
  },
  {
    "title": "Trump Removes Security Clearances For His Former Criminal Prosecutors And ‘Bad Guy’ Antony Blinken: ‘Take Away His Passes’",
    "description": "Trump removed the security clearances for former Biden administration officials and the New York prosecutors who went after him during the election.\nThe post Trump Removes Security Clearances For His Former Criminal Prosecutors And ‘Bad Guy’ Antony Blinken: ‘…",
    "link": "https://www.mediaite.com/trump/trump-removes-security-clearances-for-his-former-criminal-prosecutors-and-bad-guy-antony-blinken-take-away-his-passes/",
    "timestamp": "2025-02-09T01:04:34Z"
  },
  {
    "title": "Katie Britt vows to work with RFK Jr. after NIH funding cuts cause concern in Alabama",
    "description": "Katie Britt vows to work with RFK Jr. after NIH funding cuts cause concern in Alabamaal.com",
    "link": "https://www.al.com/news/2025/02/katie-britt-vows-to-work-with-rfk-jr-after-nih-funding-cuts-cause-concern-in-alabama.html",
    "timestamp": "2025-02-09T01:03:27Z"
  },
  {
    "title": "Is NVIDIA Corporation (NVDA) the Best Long-term Stock to Invest In for High Returns?",
    "description": "We recently compiled a list of the 12 Best Long-term Stocks to Invest in for High Returns. In this article, we are going to take a look at where NVIDIA...",
    "link": "https://finance.yahoo.com/news/nvidia-corporation-nvda-best-long-010113809.html",
    "timestamp": "2025-02-09T01:01:13Z"
  },
  {
    "title": "Richard Gere calls Trump a 'bully' at Spain's top film awards",
    "description": "American actor Richard Gere called President Donald Trump a \"bully\" and a \"thug\" on Saturday during an awards ceremony in Spain, and said the United States was in a \"very dark place\".The 75-year-old, who received an International Goya Award at Spain's top fil…",
    "link": "https://www.rawstory.com/richard-gere-calls-trump-a-bully-at-spain-s-top-film-awards/",
    "timestamp": "2025-02-09T01:00:33Z"
  },
  {
    "title": "U.S. federal judge temporarily blocks Musk's DOGE from accessing payment systems",
    "description": "A federal judge temporarily blocks Elon Musk’s government efficiency team from accessing U.S. Treasury systems, citing risks of sensitive data leaks and cybersecurity threats.",
    "link": "https://www.japantimes.co.jp/news/2025/02/09/world/politics/judge-block-doge/",
    "timestamp": "2025-02-09T00:59:00Z"
  },
  {
    "title": "Trump plans Super Bowl visit after years of tumult with the NFL",
    "description": "Donald Trump plans to attend the Super Bowl, making him the first sitting president to do so, while continuing his long-running feud with the NFL and its stars.",
    "link": "https://www.japantimes.co.jp/sports/2025/02/09/more-sports/trump-nfl/",
    "timestamp": "2025-02-09T00:58:00Z"
  }
]