[
  {
    "title": "Trump requests Justice Department to investigate Epstein's ties with Bill Clinton and other Democrats amid ongoing controversy",
    "description": "The US Justice Department will investigate Jeffrey Epstein's alleged connections with Democrats, including Bill Clinton and Larry Summers, following a request from President Donald Trump. This move aims to shift focus from Trump's own past association with th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-requests-justice-department-to-investigate-epsteins-ties-with-bill-clinton-and-other-democrats-amid-ongoing-controversy/articleshow/125336526.cms",
    "timestamp": "2025-11-14T21:13:12Z"
  },
  {
    "title": "EXCLUSIVE: Administration Fires Back After Democrats Blame Trump for ‘Soaring Electricity’ Costs",
    "description": "The Trump administration is firing back after a group of Senate Democrats accused President Donald Trump of being responsible for “soaring electricity bills” and “failure” to prevent “consumers from being forced to... Read More\nThe post EXCLUSIVE: Administrat…",
    "link": "https://www.dailysignal.com/2025/11/14/exclusive-administration-fires-back-after-democrats-blame-trump-for-soaring-electricity-costs/",
    "timestamp": "2025-11-14T21:12:59Z"
  },
  {
    "title": "Katie Miller tells 'Ruthless' about threats against her family, says kids unsafe in front yard",
    "description": "Podcaster Katie Miller detailed how protesters posted fliers with her family's address and organized chalk protests outside their Arlington, Virginia home during a recent interview.",
    "link": "https://www.foxnews.com/media/katie-miller-tells-ruthless-about-threats-against-family-from-leftists-kids-unsafe-front-yard",
    "timestamp": "2025-11-14T21:11:53Z"
  },
  {
    "title": "Trump yanks nominee accused of saying resigning official should be 'shot'",
    "description": "President Donald Trump has dropped his support for a nominee for the Department of the Treasury who had apparently suggested a former IRS official should be shot. Trump made the announcement Friday afternoon via his Truth Social platform. \"Please be advised t…",
    "link": "https://www.rawstory.com/donald-trump-nominee/",
    "timestamp": "2025-11-14T21:11:06Z"
  },
  {
    "title": "Journalist Michael Wolff Claims He Advised Jeffrey Epstein On How To Manipulate Donald Trump",
    "description": "\"I think you should let him hang himself. If he says he hasn't been on the plane or to the house, then that gives you a valuable PR and political currency,\" Wolff told Epstein.",
    "link": "https://hiphopwired.com/2908081/michael-wolff-donald-trump-epstein-files/",
    "timestamp": "2025-11-14T21:10:30Z"
  },
  {
    "title": "A Surprise Flu Variant Threw Off the Vaccine. Get Ready for a Brutal Winter",
    "description": "Scientists are warning that this winter's flu vaccine will be less effective against an emerging variant of H3N2 flu named subclade K.",
    "link": "https://gizmodo.com/a-surprise-flu-variant-threw-off-the-vaccine-get-ready-for-a-brutal-winter-2000686095",
    "timestamp": "2025-11-14T21:10:23Z"
  },
  {
    "title": "Billie Eilish Says Elon Musk Is a 'Coward'",
    "description": "Billie Eilish Says Elon Musk Is a 'Coward'cafemom.com",
    "link": "https://cafemom.com/entertainment/billie-eilish-elon-musk",
    "timestamp": "2025-11-14T21:10:14Z"
  },
  {
    "title": "Bizarre Epstein files reference to Trump, Putin, and oral sex with ‘Bubba’ draws scrutiny in Congress",
    "description": "The latest tranche of emails from the estate of late convicted pedophile Jeffrey Epstein includes one that contains what appear to be references to President Donald Trump allegedly performing oral sex, raising questions the committee cannot answer until the D…",
    "link": "https://www.advocate.com/politics/trump-blowing-bubba-epstein",
    "timestamp": "2025-11-14T21:08:54Z"
  },
  {
    "title": "Xi Jinping to Skip G-20 Summit in South Africa, Joining Trump and Milei",
    "description": "The Foreign Ministry of China announced on Thursday that Premier Li Qiang will represent China at the upcoming G20 summit in Johannesburg, South Africa, confirming that communist dictator Xi Jinping is skipping the event.\nThe post Xi Jinping to Skip G-20 Summ…",
    "link": "https://www.breitbart.com/africa/2025/11/14/xi-jinping-to-skip-g-20-summit-in-south-africa-joining-trump-and-milei/",
    "timestamp": "2025-11-14T21:06:50Z"
  },
  {
    "title": "Rep. Eric Swalwell Mulls Gubernatorial Run to Win Back Heart of Chinese Spy",
    "description": "Rep. Eric Swalwell and Christine ‘Fang Fang’ were a beautiful couple. (Although Rep. Ro Khanna had a shot.) And then it all went wrong. But now, even as he faces an indictment for mortgage fraud, Swalwell may be trying to win her back. Swalwell is said to be …",
    "link": "https://freerepublic.com/focus/f-bloggers/4352581/posts",
    "timestamp": "2025-11-14T21:05:56Z"
  },
  {
    "title": "Why normalization between Israel and Saudi Arabia won’t happen now, regardless of what Trump wants",
    "description": "Donald Trump aims to push Israel-Saudi normalization next week during his meeting with Mohammed bin Salman. MBS favors a weapons deal and a defense pact, while Israel will be in the background, working to ensure its regional dominance remains intact.",
    "link": "https://mondoweiss.net/2025/11/why-normalization-between-israel-and-saudi-arabia-wont-happen-now-regardless-of-what-trump-wants/",
    "timestamp": "2025-11-14T21:05:10Z"
  },
  {
    "title": "The Trump Backlash Quietly Underway: Young Progressives Signing Up To Run For Office (Jennifer Bendery/HuffPost)",
    "description": "Jennifer Bendery / HuffPost:\nThe Trump Backlash Quietly Underway: Young Progressives Signing Up To Run For Office  —  In the past year, nearly 75,000 people have signed up to run for local and state office through Run for Something.  And its candidates are wi…",
    "link": "https://www.memeorandum.com/251114/p97",
    "timestamp": "2025-11-14T21:05:02Z"
  },
  {
    "title": "Trump seeks probe of Epstein ties to former US president Bill Clinton",
    "description": "The request comes two days after thousands of documents were released that raised new questions about Mr Trump's relationship with Epstein.",
    "link": "https://www.abc.net.au/news/2025-11-15/trump-orders-epstein-probe-into-clinton-jp-morgan-democrats/106013208",
    "timestamp": "2025-11-14T21:03:43Z"
  },
  {
    "title": "A Bearish Administration: Here’s How The Bitcoin Price Has Fared Since Donald Trump Became President",
    "description": "Bitcoin holders have been watching the market closely since Donald Trump returned to the White House, and initial bullishness surrounding Trump’s election has been quickly eroded by his policies. Over the first 300 days of Trump’s presidency, the market has b…",
    "link": "https://bitcoinist.com/bitcoin-price-donald-trump-2/",
    "timestamp": "2025-11-14T21:00:36Z"
  },
  {
    "title": "Bondi follows Trump’s directive, taps prosecutor to examine Epstein’s Democratic ties",
    "description": "Months ago, law enforcement officials agreed that there was no further need for investigations in the Epstein case. Then the president made a new demand.",
    "link": "https://www.ms.now/rachel-maddow-show/maddowblog/bondi-follows-trumps-directive-taps-prosecutor-examine-epsteins-democr-rcna244031",
    "timestamp": "2025-11-14T21:00:08Z"
  },
  {
    "title": "Bondi follows Trump’s directive, taps prosecutor to examine Epstein’s Democratic ties",
    "description": "Four months ago, federal law enforcement officials agreed that there was no further need for investigations in the Epstein case. Then Trump made a new demand.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/bondi-follows-trumps-directive-taps-prosecutor-examine-epsteins-democr-rcna244031",
    "timestamp": "2025-11-14T20:59:20Z"
  },
  {
    "title": "43-year-old democratic socialist who’s never held elected office unseats Seattle Mayor in another win for affordability politics",
    "description": "Katie Wilson is a renter herself, of a one-bedroom apartment in Capitol Hill, and says it shaped her understanding of Seattle’s affordability crisis.",
    "link": "https://fortune.com/2025/11/14/seattle-mayor-katie-wilson-43-year-old-democratic-socialist/",
    "timestamp": "2025-11-14T20:58:23Z"
  },
  {
    "title": "'The View' co-host warns that Zohran Mamdani may hit 'roadblocks' due to inexperience",
    "description": "On Friday, \"The View\" co-host Alyssa Farah Griffin questioned whether New York City mayor-elect Zohran Mamdani has the experience needed to run America's most populous city.",
    "link": "https://www.foxnews.com/media/the-view-co-host-warns-zohran-mamdani-may-hit-roadblocks-due-inexperience",
    "timestamp": "2025-11-14T20:57:30Z"
  },
  {
    "title": "Here's What Happened Today: Friday",
    "description": "Here’s what made the headlines today.",
    "link": "https://www.thejournal.ie/news-fix-470-6874674-Nov2025/",
    "timestamp": "2025-11-14T20:56:48Z"
  },
  {
    "title": "Stormy Daniels' Shocking Claims: 'Donald Trump Pursued Me and Called Repeatedly Asking to See Me for a Year' — After Their Alleged Affair",
    "description": "Stormy Daniels claimed Donald Trump purused her for a year in a new shocking reveal.",
    "link": "https://radaronline.com/p/stormy-daniels-donald-trump-affair-pursued-called-her-after/",
    "timestamp": "2025-11-14T20:56:43Z"
  },
  {
    "title": "FDA adds strongest warning to Sarepta gene therapy",
    "description": "The Food and Drug Administration is adding a new warning to a gene therapy linked to two patient deaths earlier this year",
    "link": "https://www.kcra.com/article/fda-sarepta-duchenne-therapy-liver-risk-warning/69441498",
    "timestamp": "2025-11-14T20:55:42Z"
  },
  {
    "title": "Report: Trump poised to approve F-35 sale to Saudi Arabia during MBS visit",
    "description": "Bloomberg reports that Trump is expected to approve a deal allowing Saudi Arabia to buy F-35 jets during MBS’s visit.",
    "link": "https://www.israelnationalnews.com/news/417803",
    "timestamp": "2025-11-14T20:55:13Z"
  },
  {
    "title": "Shorter Megyn\nKelly: F*cking 15-Year-Olds Isn’t So Bad. F*ck You.",
    "description": "Even before the spit hit the fan this\nweek regarding her unhinged screed about “barely legal” underage rape survivors,\nveteran news actress Megyn Kelly was already serially flirting with bad taste. Days\nbefore her pedophilia rant on “The Megyn Kelly Show” pod…",
    "link": "https://newrepublic.com/article/203198/megyn-kelly-trump-epstein-defense",
    "timestamp": "2025-11-14T20:54:20Z"
  },
  {
    "title": "Indiana Senate leader says there aren't enough GOP votes for Trump's redistricting push",
    "description": "The White House had pressured Indiana Republican lawmakers to redraw their congressional map ahead of the midterm elections.",
    "link": "https://www.nbcnews.com/politics/elections/indiana-senate-leader-says-arent-enough-gop-votes-trump-redistricting-rcna244025",
    "timestamp": "2025-11-14T20:53:46Z"
  },
  {
    "title": "After Trump Demand, Justice Department To Probe Epstein Ties With Democrats",
    "description": "The Epstein scandal has been a political thorn in Trump’s side for months, partly because he amplified conspiracy theories about Epstein to his own supporters.",
    "link": "https://www.huffpost.com/entry/trump-epstein-probe_n_69179561e4b0a2c1a92a1d28",
    "timestamp": "2025-11-14T20:53:39Z"
  },
  {
    "title": "Therapist Says 75 Percent of His Patients are Suffering From This Mental Health Condition",
    "description": "Ever since the 2016 presidential election, a troubling swath of Americans have developed a not-so-rare condition known as “Trump Derangement...",
    "link": "https://townhall.com/tipsheet/jeff-charles/2025/11/14/therapist-says-75-percent-of-his-patients-suffer-from-tds-n2666489",
    "timestamp": "2025-11-14T20:52:45Z"
  },
  {
    "title": "Trump’s efforts to suppress the Epstein files have backfired spectacularly",
    "description": "Chris Hayes breaks down how Trump's attempts to suppress the Epstein files have backfired, bringing more attention to the documents ahead of the House's vote.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-suppress-epstein-files-backfire-congress-rcna243975",
    "timestamp": "2025-11-14T20:51:24Z"
  },
  {
    "title": "Jen Psaki Shames White House for Outing Epstein Victim for ‘Political Gain’ to Cover for Leaked Emails | Video",
    "description": "The MSNBC host also slams Ghislaine Maxwell and former Prince Andrew Mountbatten-Windsor for claiming the viral photo of them with Virginia Giuffre was fake\nThe post Jen Psaki Shames White House for Outing Epstein Victim for ‘Political Gain’ to Cover for Leak…",
    "link": "https://www.thewrap.com/jen-psaki-virginia-giuffre-donald-trump-white-house-epstein-victim-ghislaine-maxwell-prince-andrew/",
    "timestamp": "2025-11-14T20:50:25Z"
  },
  {
    "title": "Hungary’s Sovereignty Renaissance: The Europe That Refused to Fall",
    "description": "Hungary’s closed borders have proven to be the right course.On Nov. 7, 2025, as Europe once again hid behind euphemisms about migration, Donald Trump sat opposite Viktor Orbán and delivered a truth now too indecent for Brussels: “Hungary keeps crime down beca…",
    "link": "https://freerepublic.com/focus/f-news/4352577/posts",
    "timestamp": "2025-11-14T20:49:04Z"
  },
  {
    "title": "Oil Rises as Geopolitics Heat Up",
    "description": "Oil climbed as attacks on Russian sites and Iran's tanker seizure added fresh risk premiums.",
    "link": "https://www.rigzone.com/news/wire/oil_rises_as_geopolitics_heat_up-14-nov-2025-182326-article/",
    "timestamp": "2025-11-14T20:48:25Z"
  },
  {
    "title": "How are these Epstein files so damaging to Trump?",
    "description": "As Republicans and Democrats release dueling tranches of Epstein-related documents, the White House finds itself caught in a mess partially of its own making",
    "link": "https://theweek.com/politics/epstein-trump-files-documents-damaging",
    "timestamp": "2025-11-14T20:44:02Z"
  },
  {
    "title": "The Bob Cesca Podcast: Evil Beyond Belief",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: Evil Beyond Belief -- The government shutdown is over. Republicans will likely get credit for ending it. Republican legal slush fund is now law. New Epstein files indicate that \"Trump knew abo…",
    "link": "https://littlegreenfootballs.com/article/55062_The_Bob_Cesca_Podcast-_Evil_Be",
    "timestamp": "2025-11-14T20:42:00Z"
  },
  {
    "title": "WATCH: Pete Buttigieg’s Shocking Answer After Being Asked if JD Vance Is a ‘Fascist’",
    "description": "Pete Buttigieg predicted Vice President JD Vance could go on to become a \"Silicon Valley Democrat\" after his time with President Donald Trump.\nThe post WATCH: Pete Buttigieg’s Shocking Answer After Being Asked if JD Vance Is a ‘Fascist’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/watch-pete-buttigiegs-shocking-answer-after-being-asked-if-jd-vance-is-a-fascist/",
    "timestamp": "2025-11-14T20:41:29Z"
  },
  {
    "title": "US seeks UN authorization for Gaza international force lasting through 2027 under Trump plan",
    "description": "U.S. pushes U.N. Security Council to authorize international force in Gaza through 2027 under Trump's 20-point plan, with deployment planned by January 2025.",
    "link": "https://www.foxnews.com/world/us-seeks-un-authorization-gaza-international-force-lasting-through-2027-under-trump-plan",
    "timestamp": "2025-11-14T20:41:19Z"
  },
  {
    "title": "\"This Country May Never Recover\": American Veterans And Military Members Are Confessing How They Honestly Feel About Donald Trump's Presidency, And YIKES",
    "description": "\"Morale was pretty bad back then, so I can only imagine how bad it must be now. I wouldn't advise anyone to enlist in today's military.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/dannicaramirez/us-military-members-thoughts-about-trump-november-2025",
    "timestamp": "2025-11-14T20:40:22Z"
  },
  {
    "title": "Marjorie Taylor Greene questions if Trump is still the 'America First' president (Katherine Doyle/NBC News)",
    "description": "Katherine Doyle / NBC News:\nMarjorie Taylor Greene questions if Trump is still the ‘America First’ president  —  Greene, who has long allied herself with Donald Trump, has been more critical of his policies in recent months.  But she dismisses speculation tha…",
    "link": "https://www.memeorandum.com/251114/p94",
    "timestamp": "2025-11-14T20:40:01Z"
  },
  {
    "title": "The age of AI-run cyberattacks has begun",
    "description": "Menu planning, therapy, essay writing, highly sophisticated global cyberattacks: People just keep coming up with innovative new uses for the latest AI chatbots.  An alarming new milestone was reached this week when the artificial intelligence company Anthropi…",
    "link": "https://www.vox.com/politics/468746/ai-cyber-attacks-china-claude-anthropic",
    "timestamp": "2025-11-14T20:39:56Z"
  },
  {
    "title": "America’s Next Big Weapons Deal Could End Up As Big Gift To China’s Arsenal",
    "description": "An imminent arms deal with Saudi Arabia could open the door to an intelligence leak to China, an internal report from the Pentagon's chief intel arm warned Friday.",
    "link": "https://dailycaller.com/2025/11/14/americas-next-big-weapons-deal-could-end-up-as-big-gift-to-chinas-arsenal/",
    "timestamp": "2025-11-14T20:36:51Z"
  },
  {
    "title": "MAGA is furious over Trump's immigration apostasy",
    "description": "In a Tuesday interview with Fox News’ Laura Ingraham, Trump defended the H-1B visa program, and MAGA conservatives are angry.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-fox-news-interview-h1-b-visas-rcna243931",
    "timestamp": "2025-11-14T20:35:57Z"
  },
  {
    "title": "Canary’s XRP ETF Outperforms All 2025 Launches With $58 Million In Day-One Trading Volume",
    "description": "Canary Capital’s spot XRP ETF (XRPC) had an impressive debut on Wall Street. XRPC generated $58 million in volume on the first trading day, the highest for any ETF launched this year.",
    "link": "https://zycrypto.com/canarys-xrp-etf-outperforms-all-2025-launches-with-58-million-in-day-one-trading-volume/",
    "timestamp": "2025-11-14T20:35:52Z"
  },
  {
    "title": "MAGA Rages at Kristi Noem Saying Trump Admin Has ‘Sped Up’ Legal Immigration Process",
    "description": "Trump Homeland Security Secretary Kristi Noem sparked a wave of anger on the MAGA right this week when she boasted on Fox News that the administration had “sped up” the legal immigration process. Noem...was asked by host Lawrence Jones to weigh in on the admi…",
    "link": "https://freerepublic.com/focus/f-chat/4352574/posts",
    "timestamp": "2025-11-14T20:35:45Z"
  },
  {
    "title": "Bob Rae, on his last day at the UN, says: ‘I think I helped make a difference’",
    "description": "On his very last day as Canada's ambassador to the United Nations, Bob Rae spoke to As It Happens host Nil Kӧksal.",
    "link": "https://www.cbc.ca/radio/asithappens/bob-rae-un-exit-9.6979613",
    "timestamp": "2025-11-14T20:35:22Z"
  },
  {
    "title": "Will we the people tolerate a brave new world of trillionaires?",
    "description": "Tech mogul Elon Musk is on course to be worth over a trillion dollars, while billions struggle to survive at the poverty line Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627792-brave-new-world-trillionaires/",
    "timestamp": "2025-11-14T20:34:08Z"
  },
  {
    "title": "'Don't Cross the Picket Line': No Kings Alliance Backs Starbucks Boycott During Workers Strike",
    "description": "The No Kings Alliance on Friday announced that it was mobilizing in support of Starbucks workers who went on strike this week to demand a fair contract.The alliance, which organized one of the largest demonstrations in US history last month with nationwide \"N…",
    "link": "https://www.commondreams.org/news/starbucks-workers-united-strike",
    "timestamp": "2025-11-14T20:33:41Z"
  },
  {
    "title": "Of the thousands of leaked Epstein emails, one name is mentioned 1628 times, more than anyone else,…",
    "description": "Donald Trump ‘blowing Bubba’ message in Epstein emails under scrutinyOf the thousands of leaked Epstein emails, one name is mentioned 1628 times, more than anyone else, and that name is Donald Trump.Before you MAGA cultists burst a blood vessel, yes, simply b…",
    "link": "https://thedaddycomplex.com/post/800223255602610176/donald-trump-blowing-bubba-message-in-epstein",
    "timestamp": "2025-11-14T20:32:46Z"
  },
  {
    "title": "Epstein Said He Lost Bet With Trump and Sent Truck Full of Baby Food",
    "description": "Donald Trump and Jeffrey Epstein were apparently so close that the billionaire child sex offender once paid the now-president a hefty bet.  Emails released by the House Oversight Committee show an exchange between Epstein and alternative medicine advocate Dee…",
    "link": "https://newrepublic.com/post/203236/epstein-lost-bet-trump-truck-full-baby-food-email",
    "timestamp": "2025-11-14T20:32:45Z"
  },
  {
    "title": "Trump Will Order DOJ To Investigate Epstein’s Links To Bill Clinton, Major Banks",
    "description": "President Donald Trump said he will order the Justice Department to investigate Jeffrey Epstein's ties to Bill Clinton and major financial institutions.",
    "link": "https://dailycaller.com/2025/11/14/donald-trump-jeffrey-epstein-russia-hoax-bill-clinton-major-banks-doj/",
    "timestamp": "2025-11-14T20:31:03Z"
  },
  {
    "title": "Trump says he's 'working to make things less expensive' (Salena Zito/Washington Examiner)",
    "description": "Salena Zito / Washington Examiner:\nTrump says he's ‘working to make things less expensive’  —  EXCLUSIVE — In a wide-ranging Oval Office interview, President Donald Trump said that for a U.S. president, “there is never a finish line” on major challenges, espe…",
    "link": "https://www.memeorandum.com/251114/p92",
    "timestamp": "2025-11-14T20:30:01Z"
  },
  {
    "title": "FDA adds strongest warning to Sarepta gene therapy linked to 2 patient deaths",
    "description": "The Food and Drug Administration is adding a new warning to a gene therapy linked to two patient deaths earlier this year",
    "link": "https://abcnews.go.com/Health/wireStory/fda-adds-strongest-warning-sarepta-gene-therapy-linked-127536732",
    "timestamp": "2025-11-14T20:29:55Z"
  },
  {
    "title": "Brazil’s top court backs putting Bolsonaro’s son on trial over obstruction charges",
    "description": "A Brazilian Supreme Court panel has ruled that Eduardo Bolsonaro, son of former President Jair Bolsonaro, should stand trial for obstructing justice",
    "link": "https://abcnews.go.com/International/wireStory/brazils-top-court-backs-putting-bolsonaros-son-trial-127536464",
    "timestamp": "2025-11-14T20:29:29Z"
  },
  {
    "title": "DNC Staff Object to Being Ordered Back to Work in the Office",
    "description": "Both Democrats and Republicans mocked Democratic National Committee (DNC) staffers this week after it was revealed the workers were not happy they’d been ordered to end remote work and show up next year at the office five days a week.\nThe post DNC Staff Objec…",
    "link": "https://www.breitbart.com/politics/2025/11/14/dnc-staff-defy-return-to-office-order-from-chairman-ken-martin/",
    "timestamp": "2025-11-14T20:28:41Z"
  },
  {
    "title": "Is JD Vance Running for President in 2028? These Are His Plans",
    "description": "The vice president revealed he's planning on 'talking' to Donald Trump about the possibility of him running for president in 2028.",
    "link": "https://hollywoodlife.com/2025/11/14/is-jd-vance-running-for-president-in-2028/",
    "timestamp": "2025-11-14T20:26:04Z"
  },
  {
    "title": "‘Donald Trump Is Still a Criminal Defendant’: CNN Reports on New Prosecutor in Georgia Election Case",
    "description": "A new prosecutor has been appointed to a Georgia criminal case involving President Donald Trump and multiple co-defendants just before a deadline, keeping the case alive.\nThe post ‘Donald Trump Is Still a Criminal Defendant’: CNN Reports on New Prosecutor in …",
    "link": "https://www.mediaite.com/crime/donald-trump-is-still-a-criminal-defendant-cnn-reports-on-new-prosecutor-in-georgia-election-case/",
    "timestamp": "2025-11-14T20:25:39Z"
  },
  {
    "title": "Supreme Court case on protecting women's sports set for oral arguments in January",
    "description": "The Supreme Court will hear oral arguments on Jan. 13, 2026 for Little vs. Hecox and West Virginia vs B.P.J. cases addressing transgender athletes in women's sports.",
    "link": "https://www.foxnews.com/sports/supreme-court-case-protecting-womens-sports-set-oral-arguments-january",
    "timestamp": "2025-11-14T20:22:28Z"
  },
  {
    "title": "FDA adds strongest warning to Sarepta gene therapy linked to 2 patient deaths",
    "description": "Sarepta Therapeutics' Elevidys will carry the FDA's strongest warning label about the risks of liver damage and liver failure.",
    "link": "https://www.bostonherald.com/2025/11/14/fda-warning-sarepta-gene-therapy/",
    "timestamp": "2025-11-14T20:22:19Z"
  },
  {
    "title": "FDA adds strongest warning to Sarepta gene therapy linked to 2 patient deaths",
    "description": "WASHINGTON (AP) — The Food and Drug Administration said Friday it will add a new warning and other limitations to a gene therapy for Duchenne’s muscular dystrophy that’s been linked to two patient deaths. The infused therapy from Sarepta Therapeutics will car…",
    "link": "https://financialpost.com/pmn/fda-adds-strongest-warning-to-sarepta-gene-therapy-linked-to-2-patient-deaths",
    "timestamp": "2025-11-14T20:18:19Z"
  },
  {
    "title": "J.D. Vance Dismisses Donald Trump's Growing Health Concerns While Ridiculing Joe Biden's Physical Decline: 'If I Served Under Him, I'd Worry Every Minute He Was Gonna Croak!'",
    "description": "J.D. Vance has ridiculed Joe Biden's declining health while playing down fears surrounding Donald Trump's own well-being by insisting president is 'healthy.'",
    "link": "https://radaronline.com/p/jd-vance-dismisses-donald-trump-health-concerns-ridicules-joe-biden-physical-decline-death/",
    "timestamp": "2025-11-14T20:15:54Z"
  },
  {
    "title": "“Be Brave”: Epstein Victims Beg Congress to Release the Files",
    "description": "Jeffrey Epstein’s victims are pleading with Congress to release the Epstein files.In a haunting letter, the family members of deceased abuse survivor Virginia Giuffre—along with several victims who have accused Donald Trump of participating in Epstein’s child…",
    "link": "https://newrepublic.com/post/203235/epstein-victims-beg-congress-release-files",
    "timestamp": "2025-11-14T20:15:40Z"
  },
  {
    "title": "FDA adds strongest warning to Sarepta gene therapy",
    "description": "The Food and Drug Administration is adding a new warning to a gene therapy linked to two patient deaths earlier this year. Sarepta Therapeutics' Elevidys will carry the FDA's strongest warning label about the risks of liver damage and liver failure, the agenc…",
    "link": "https://apnews.com/article/sarepta-fda-elevidys-warning-muscular-dystrophy-64453c1d19dd96236fcee667e6fe7b62",
    "timestamp": "2025-11-14T20:14:42Z"
  },
  {
    "title": "Pam Bondi complies as Trump demands she target Dems with new Epstein probe",
    "description": "Attorney General Pam Bondi said that the Department of Justice would open a new investigation into Jeffrey Epstein's ties to Democrats after President Donald Trump ordered her to on social media.After Democrats released emails in which Epstein said Trump \"kne…",
    "link": "https://www.rawstory.com/bondi-trump-epstein-investigation/",
    "timestamp": "2025-11-14T20:14:41Z"
  },
  {
    "title": "Emails reveal Epstein’s network of the rich and powerful despite sex offender status - PBS",
    "description": "Emails reveal Epstein’s network of the rich and powerful despite sex offender statusPBS Republicans Tried to Squelch the Epstein Furor. Instead, They Fed It.The New York Times ‘Evil,’ ‘nuts,’ ‘dangerous’: New Epstein emails detail his soured view of former cl…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180075928",
    "timestamp": "2025-11-14T20:13:04Z"
  },
  {
    "title": "Border czar Homan says ‘Catholic Church is wrong’ on immigration",
    "description": "U.S. Border czar Tom Homan defended the morality of the Trump administration’s enforcement policies. / Credit: “The World Over with Raymond Arroyo”/Screenshot\n\nWashington, D.C. Newsroom, Nov 14, 2025 / 15:13 pm (CNA).\nBorder czar Tom Homan strongly opposed th…",
    "link": "https://www.catholicnewsagency.com/news/267839/border-czar-homan-says-catholic-church-is-wrong-on-immigration",
    "timestamp": "2025-11-14T20:13:00Z"
  },
  {
    "title": "Transportation Secretary Sean Duffy: Thursday 'One of the Best Days Our Airspace Had in While'",
    "description": "Thursday was \"one of the best days\" U.S. airspace has had in a while, Transportation Secretary Sean Duffy said on Friday.\nThe post Transportation Secretary Sean Duffy: Thursday ‘One of the Best Days Our Airspace Had in While’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/14/transportation-secretary-sean-duffy-thursday-one-of-best-days-our-airspace-had-in-while/",
    "timestamp": "2025-11-14T20:12:09Z"
  },
  {
    "title": "'She can play at the highest level': Kai Trump caps LPGA debut with 75, near ace and positive impression",
    "description": "Trump, the 18-year-old granddaughter of President Donald Trump, shot 83-75 to miss the cut in her LPGA debut at The Annika, but, by all serious accounts, it was a win for the future Miami player and LPGA dreamer.",
    "link": "https://www.nbcsports.com/golf/news/she-can-play-at-the-highest-level-kai-trump-caps-lpga-debut-with-75-near-ace-and-positive-impression",
    "timestamp": "2025-11-14T20:11:59Z"
  },
  {
    "title": "‘Volatility is your friend’: Eric Trump not bothered by Bitcoin, crypto carnage",
    "description": "Eric Trump says crypto volatility is an opportunity as American Bitcoin adds 3,000 BTC, enters the top 25 holders list, and the market slides from its peak.",
    "link": "https://cointelegraph.com/news/eric-trump-bitcoin-volatility-american-bitcoin-btc-holdings",
    "timestamp": "2025-11-14T20:10:04Z"
  },
  {
    "title": "Trump holds calls on Thailand-Cambodia conflict, White House says",
    "description": "Trump's calls came after Thailand suspended a US-brokered ceasefire deal and demanded an apology over allegations that Cambodia laid fresh landmines, which Cambodia denies.",
    "link": "https://indianexpress.com/article/world/trump-holds-calls-on-thailand-cambodia-conflict-white-house-says-10366590/",
    "timestamp": "2025-11-14T20:09:29Z"
  },
  {
    "title": "‘It’s One Or The Other, Bit*H’: Joe Rogan, Adam Carolla Torch BBC For Manipulating Trump Speech",
    "description": "Joe Rogan and Adam Carolla denounced the BBC for a documentary that stitched President Donald Trump's speech together in a way that suggested he promoted violence.",
    "link": "https://dailycaller.com/2025/11/14/joe-rogan-adam-carolla-torch-biased-bbc-trump-speech/",
    "timestamp": "2025-11-14T20:06:08Z"
  },
  {
    "title": "Marjorie Taylor Greene Explains Why She Wants All the Epstein Files Released: ‘Government Will Not Protect the Predators’ | Video",
    "description": "The congresswoman adds that she thinks Donald Trump blocking their release is \"a huge miscalculation\"\nThe post Marjorie Taylor Greene Explains Why She Wants All the Epstein Files Released: ‘Government Will Not Protect the Predators’ | Video appeared first on …",
    "link": "https://www.thewrap.com/marjorie-taylor-greene-epstein-files-trump-miscalculation/",
    "timestamp": "2025-11-14T20:02:34Z"
  },
  {
    "title": "President Trump Clarifies Viral Heaven Comments: ‘I Was Being Funny’",
    "description": "Recently, President Donald Trump left many people concerned about the state of his eternal destination after stating that he was unsure if there was anything he could do to make it to heaven. In an interview with Fox News’ Laura Ingraham, Trump clarified what…",
    "link": "https://freerepublic.com/focus/f-religion/4352567/posts",
    "timestamp": "2025-11-14T20:01:26Z"
  },
  {
    "title": "Deep Staters Who Aided Jack Smith Case Helped Kill Clinton Investigation",
    "description": "DOJ attorneys who aided Jack Smith's case against President Donald Trump previously helped shutter an investigation into the Clinton campaign.",
    "link": "https://dailycaller.com/2025/11/14/deep-staters-shut-down-clinton-investigation-and-worked-with-jack-smith/",
    "timestamp": "2025-11-14T20:00:56Z"
  },
  {
    "title": "​​Joe Scarborough and Mika Brzezinski on Trump, Retirement Rumors and ‘Morning Joe’ on MS NOW: ‘Feel of a Start-Up’",
    "description": "On Monday, viewers in the White House and beyond will find “Morning Joe” on the newly rebranded MS NOW, part of a corporate split with NBC News that Scarborough, Brzezinski, and their colleagues are welcoming as chance to operate more independently and cohesi…",
    "link": "https://www.thewrap.com/ms-now-morning-joe-trump/",
    "timestamp": "2025-11-14T20:00:46Z"
  },
  {
    "title": "How Democrats Are Planning to Force House Republicans to Take Tough Votes",
    "description": "House Democrats, despite being in the minority, are making use of a procedural mechanism to bypass Republican leadership and force Republicans into tough votes. The... Read More\nThe post How Democrats Are Planning to Force House Republicans to Take Tough Vote…",
    "link": "https://www.dailysignal.com/2025/11/14/how-democrats-are-planning-to-force-house-republicans-to-take-tough-votes/",
    "timestamp": "2025-11-14T20:00:29Z"
  },
  {
    "title": "Ransomware gang leaks data on 10,000 WASHPOST employees, contractors...",
    "description": "Ex-national security advisor John Bolton is one of nearly 10,000 contributors who had data exposed after a hack of The Washington Post.",
    "link": "https://san.com/cc/john-bolton-among-washington-post-contributors-exposed-in-hack/",
    "timestamp": "2025-11-14T20:00:16Z"
  },
  {
    "title": "Has Chinese Power Peaked in Asia?",
    "description": "Beijing finds itself in a precarious geopolitical position.",
    "link": "http://foreignpolicy.com/2025/11/14/kausikan-myth-asian-century-china-geopolitics-asean-japan-india/",
    "timestamp": "2025-11-14T20:00:15Z"
  },
  {
    "title": "Trump just ripped a page from the Stalin–Hitler–Mussolini playbook with grotesque move",
    "description": "Trump has ordered the U.S. Treasury to draft a $1 coin featuring him on both sides, for the purpose of “honoring America’s 250th Birthday and @POTUS,” according to Treasury officials.Meanwhile, Trump wants the Washington Commanders NFL team to name their plan…",
    "link": "https://www.rawstory.com/trump-coin-2674294014/",
    "timestamp": "2025-11-14T20:00:02Z"
  },
  {
    "title": "Collateral Damage From the Epstein Files: Larry Summers",
    "description": "It’s long past time to jettison Summers as hopelessly contaminated. But there are far more serious reasons to dump Summers than his gross connections with Jeffrey Epstein.\nThe post Collateral Damage From the Epstein Files: Larry Summers appeared first on The …",
    "link": "http://prospect.org/2025/11/14/collateral-damage-epstein-files-larry-summers/",
    "timestamp": "2025-11-14T20:00:00Z"
  },
  {
    "title": "With a Tenuous Ceasefire in Gaza, Portland Councilors Pledge to Investigate the City's Links to Israel",
    "description": "Councilors say that a lack of action from US Congress has forced them to think locally to stop the flow of weapons and military aid to Israel. \n \n by Abe Asher\n \n \n \n Last month, the progressive block of the Portland City Council signed onto a pledge to inves…",
    "link": "https://www.portlandmercury.com/news/2025/11/14/48120998/with-a-tenuous-ceasefire-in-gaza-portland-councilors-pledge-to-investigate-the-citys-links-to-israel",
    "timestamp": "2025-11-14T20:00:00Z"
  },
  {
    "title": "Trump plots major tariff cuts to slash soaring grocery bills for millions of Americans",
    "description": "Trump tariff cuts 2025: President Trump is set to reduce tariffs on everyday food items like coffee and bananas. This move aims to ease the rising cost of groceries for millions of Americans. The proposed cuts are linked to new trade agreements with several c…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-plots-major-tariff-cuts-to-slash-soaring-grocery-bills-for-millions-of-americans/articleshow/125336362.cms",
    "timestamp": "2025-11-14T19:59:34Z"
  },
  {
    "title": "DeSantis World Goes To War With H1B Visas As Trump Faces Blowback From Base",
    "description": "One of President Donald Trump's old rivals is seemingly moving to seize on MAGA's dissatisfaction with the president's recent statements on H1-B visas.",
    "link": "https://dailycaller.com/2025/11/14/ron-desantis-trump-h1b-visas-byron-donalds-florida-immigration/",
    "timestamp": "2025-11-14T19:59:20Z"
  },
  {
    "title": "Times Are Tough, but Luxury Consumers Can’t Get Enough of Cartier, or Van Cleef & Arpels, Jewelry",
    "description": "Richemont’s jewelry division has proven relatively bulletproof in the face of geopolitical woes, U.S. tariffs and the rising price of gold.",
    "link": "http://wwd.com/business-news/business-features/luxury-shoppers-buying-richemont-cartier-jewelry-hard-times-1238349428/",
    "timestamp": "2025-11-14T19:59:04Z"
  },
  {
    "title": "3625 - Shut Down Ends, Epstein Barrage Begins; Republican Dummymander w/ Heather 'Digby' Parton",
    "description": "It's Casual Friday on the Majority Report On today's program: More Epstein emails continue to surface, and they're becoming a growing problem for Donald Trump. Pundits are working overtime to run interference. In 2018, Megyn Kelly said on NBC that there's no …",
    "link": "https://majorityfm.libsyn.com/3625-shut-down-ends-epstein-barrage-begins-republican-dummymander-w-heather-digby-parton",
    "timestamp": "2025-11-14T19:59:00Z"
  },
  {
    "title": "How Doug McMillon kept Walmart on top",
    "description": "Outgoing Walmart CEO Doug McMillon has steered the retailer through the e-commerce revolution, a pandemic, high inflation and political upheaval.",
    "link": "https://www.nbcnews.com/business/business-news/walmart-ceo-doug-mcmillon-american-retail-rcna243911",
    "timestamp": "2025-11-14T19:54:47Z"
  },
  {
    "title": "Experts Raise Doubts About Trump’s Dividend Payment Proposal",
    "description": "Q: Will U.S. citizens receive stimulus or tariff-based checks of $2,000 in November?\nA: No checks are being issued. President Donald Trump said he wants to use tariff revenue to give “dividend” payments of “at least $2,000″ to “middle-income people and lower-…",
    "link": "https://www.factcheck.org/2025/11/experts-raise-doubts-about-trumps-dividend-payment-proposal/",
    "timestamp": "2025-11-14T19:52:12Z"
  },
  {
    "title": "'Unheard Of': Ex-Trump Aide Talks Boebert Being Taken Into Situation Room Over Epstein",
    "description": "\"The View\" co-host Alyssa Farah Griffin said Thursday she's only been in that room at the White House for \"national security matters.\"",
    "link": "https://www.huffpost.com/entry/ex-trump-aide-says-its-unheard-of-lauren-boebert-to-be-taken-into-situation-room-over-epstein_n_69176072e4b0781acfd5f9ab",
    "timestamp": "2025-11-14T19:49:26Z"
  },
  {
    "title": "Data centers are concentrated in these states. Here's what's happening to electricity prices.",
    "description": "Residential utility bills rose 6% on average nationwide in August compared with the same period last year, according to the Energy Information Administration.",
    "link": "https://www.cnbc.com/2025/11/14/data-centers-are-concentrated-in-these-states-heres-whats-happening-to-electricity-prices-.html",
    "timestamp": "2025-11-14T19:49:08Z"
  },
  {
    "title": "Nearly two dozen arrested as faith leaders protest outside Chicago-area ICE facility",
    "description": "By Eric Cox and Diana Novak Jones CHICAGO (Reuters) -Nearly two dozen people were arrested as faith leaders protested on Friday outside a federal immigration...",
    "link": "https://www.yahoo.com/news/articles/nearly-two-dozen-arrested-faith-194747909.html",
    "timestamp": "2025-11-14T19:47:47Z"
  },
  {
    "title": "Rep. Eric Swalwell slams Trump over ‘false’ mortgage fraud allegations: ‘Connect the dots’",
    "description": "Rep. Eric Swalwell sat down with \"The Weeknight\" for his first TV interview after he became the latest Trump critic to be hit with a mortgage fraud probe.",
    "link": "https://www.msnbc.com/top-stories/latest/eric-swalwell-slams-trump-mortgage-fraud-probe-rcna243993",
    "timestamp": "2025-11-14T19:46:41Z"
  },
  {
    "title": "MAGA Rages at Kristi Noem Saying Trump Admin Has ‘Sped Up’ Legal Immigration Process",
    "description": "Steve Bannon’s White House Correspondent Natalie Winters hit back, “Not sure what is worse: this actually happening or the admin thinking this is a ‘win.’”\nThe post MAGA Rages at Kristi Noem Saying Trump Admin Has ‘Sped Up’ Legal Immigration Process first app…",
    "link": "https://www.mediaite.com/politics/maga-rages-at-kristi-noem-saying-trump-admin-has-sped-up-legal-immigration-process/",
    "timestamp": "2025-11-14T19:45:27Z"
  },
  {
    "title": "White House plans dinner for Saudi prince scrutinized in journalist's killing (Washington Post)",
    "description": "Washington Post:\nWhite House plans dinner for Saudi prince scrutinized in journalist's killing  —  Trump's formal dinner for Mohammed bin Salman marks a dramatic step in the public rehabilitation of a man once condemned as a pariah.  —  President Donald Trump…",
    "link": "https://www.memeorandum.com/251114/p85",
    "timestamp": "2025-11-14T19:45:02Z"
  },
  {
    "title": "Rollins: ‘Next Step’ Is to Make ‘Everyone Reapply’ for SNAP to Ensure Integrity",
    "description": "On Thursday’s broadcast of Newsmax TV’s “Rob Schmitt Tonight,” Agriculture Secretary Brooke Rollins discussed data on food stamps and said that data from blue states is “going to give us a platform and a trajectory to fundamentally rebuild this program, have …",
    "link": "https://freerepublic.com/focus/f-news/4352564/posts",
    "timestamp": "2025-11-14T19:43:26Z"
  },
  {
    "title": "Trump asks Justice Department to investigate Bill Clinton over Epstein ties",
    "description": "The Republican president has repeatedly called scrutiny over his own relationship with Epstein a 'Democratic hoax'.",
    "link": "https://www.aljazeera.com/news/2025/11/14/trump-asks-justice-department-to-investigate-bill-clinton-over-epstein-ties",
    "timestamp": "2025-11-14T19:41:36Z"
  },
  {
    "title": "The driving force for saving the Gaza peace plan: Donald Trump",
    "description": "Arab countries are leery about deploying troops in Gaza, and the U.S. proposal leaves many issues open. Washington will have to bend a few arms, including Israel's, but Trump has shown keen determination",
    "link": "https://www.haaretz.com/middle-east-news/palestinians/2025-11-14/ty-article/.premium/the-driving-force-for-saving-the-gaza-peace-plan-donald-trump/0000019a-8367-d3ce-a7de-f77f9a890000",
    "timestamp": "2025-11-14T19:40:06Z"
  },
  {
    "title": "Trump administration will require SNAP participants to reapply for benefits (Grace Yarrow/Politico)",
    "description": "Grace Yarrow / Politico:\nTrump administration will require SNAP participants to reapply for benefits … Her comment comes after funds for the Supplemental Nutrition Assistance Program ran out of federal funding during the government shutdown, leading many cons…",
    "link": "https://www.memeorandum.com/251114/p83",
    "timestamp": "2025-11-14T19:40:00Z"
  },
  {
    "title": "Trump shooter Thomas Crooks' hidden online history with years of assassination threats is finally exposed as Tucker Carlson blows up FBI's narrative",
    "description": "Tucker Carlson has revealed that the young man who attempted to assassinate Donald Trump in Butler, Pennsylvania last year had a long record of espousing political violence.Comments posted by Thomas Crooks to YouTube from 2019 to 2020 show a detailed digital …",
    "link": "https://freerepublic.com/focus/f-news/4352562/posts",
    "timestamp": "2025-11-14T19:39:16Z"
  }
]