[
  {
    "title": "Bill O’Reilly Corrected On-Air Over False Claim Biden Oversaw Epstein Conviction: ‘How Do You Convict a Guy That Is Dead?’ | Video",
    "description": "The former \"O'Reilly Factor\" host insists the disgraced financier was convicted by former Attorney General Merrick Garland\nThe post Bill O’Reilly Corrected On-Air Over False Claim Biden Oversaw Epstein Conviction: ‘How Do You Convict a Guy That Is Dead?’ | Vi…",
    "link": "https://www.thewrap.com/bill-oreilly-epstein-corrected-biden-merrick-garland/",
    "timestamp": "2025-07-15T21:32:41Z"
  },
  {
    "title": "Trump Trade Deal Revealed: Indonesia Shoe Imports to US Will Face 19 Percent Tariff Rate",
    "description": "US President Donald Trump said he has a \"trade deal\" with Indonesia, one that sets the tariff rate for shoe imports at 19 percent.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/tariff-trump-indonesia-trade-deal-shoe-imports-19-percent-1237981933/",
    "timestamp": "2025-07-15T21:31:14Z"
  },
  {
    "title": "Gavin Newsom's Warning to Donald Trump Over Plan for Texas Republicans",
    "description": "Newsom responded to Trump calling for a Texas Congressional map redraw.",
    "link": "https://biztoc.com/x/4fd8c28250acefde",
    "timestamp": "2025-07-15T21:31:07Z"
  },
  {
    "title": "Fairshake secures $141M to champion pro-crypto candidates",
    "description": "A powerful bipartisan crypto-focused political action committee, Fairshake, has secured $141 million in funding ahead of the 2026 US midterm elections, per a July 15 statement shared with CryptoSlate. According to the statement, the figure reflects significan…",
    "link": "https://cryptoslate.com/fairshake-secures-141m-to-champion-pro-crypto-candidates/",
    "timestamp": "2025-07-15T21:30:24Z"
  },
  {
    "title": "Bondi holds firm on Epstein files after Trump’s comments",
    "description": "Attorney General Pam Bondi found herself at the center of mounting pressure Tuesday, as questions swirled around her decision to withhold Jeffrey Epstein files despite President Donald Trump’s public suggestion that she could release additional documents. Dur…",
    "link": "https://rollingout.com/2025/07/15/bondi-hold-on-epstein-files-after-trumps/",
    "timestamp": "2025-07-15T21:27:05Z"
  },
  {
    "title": "Gavin Newsom Calls Donald Trump A ‘Son Of A Bitch’ In Blistering Interview",
    "description": "The governor shared his thoughts on the recent deployment of the National Guard in Los Angeles.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-donald-trump_n_6876a0b6e4b0d1f728023add",
    "timestamp": "2025-07-15T21:26:20Z"
  },
  {
    "title": "A look at the blockbuster deals announced at the Pa. Energy and Innovation Summit",
    "description": "U.S. Sen. Dave McCormick said Tuesday during the Pennsylvania Energy and Innovation Summit in Pittsburgh that companies are planning to invest more than $90 billion in data centers, energy and power infrastructure, and workforce and AI training projects acros…",
    "link": "https://triblive.com/business/technology/a-look-at-the-blockbuster-deals-announced-at-the-pa-energy-and-innovation-summit/",
    "timestamp": "2025-07-15T21:26:18Z"
  },
  {
    "title": "Rashford among targets Liverpool have considered - Paper Talk",
    "description": "The top stories and transfer rumours from Wednesday's newspapers...",
    "link": "https://www.skysports.com/football/news/11095/13397209/liverpool-add-manchester-united-forward-marcus-rashford-to-the-list-of-forward-targets-this-summer-paper-talk",
    "timestamp": "2025-07-15T21:26:00Z"
  },
  {
    "title": "Why Trump changed his mind on Ukraine",
    "description": "Listen to The World with Richard Engel and Yalda Hakim on your podcast app",
    "link": "https://news.sky.com/story/why-trump-changed-his-mind-on-ukraine-13397221",
    "timestamp": "2025-07-15T21:26:00Z"
  },
  {
    "title": "U.S. Appeals Court Blocks Trump from Ending 'Temporary' Amnesty for Biden's Afghan Migrants",
    "description": "The United States Court of Appeals for the Fourth Circuit has temporarily blocked President Donald Trump's Department of Homeland Security (DHS) from ending Temporary Protected Status (TPS) for Afghan migrants who were imported to the United States under form…",
    "link": "https://www.breitbart.com/politics/2025/07/15/u-s-appeals-court-blocks-trump-from-ending-temporary-amnesty-for-bidens-afghan-migrants/",
    "timestamp": "2025-07-15T21:25:15Z"
  },
  {
    "title": "Dems press Waltz on Hegseth sharing 'demonstrably sensitive information' in Signal chat",
    "description": "Former National Security Advisor Mike Waltz faced scrutiny over a Signal chat incident during his U.N. ambassador hearing before the Senate Foreign Relations Committee.",
    "link": "https://www.foxnews.com/politics/dems-press-waltz-hegseth-sharing-demonstrably-sensitive-information-signal-chat",
    "timestamp": "2025-07-15T21:25:04Z"
  },
  {
    "title": "Trump’s Big Crypto Bills Blocked By House Republicans — Here’s Why.",
    "description": "Trump urged the House to approve the three bills in a Truth Social post earlier Tuesday.",
    "link": "https://www.forbes.com/sites/saradorn/2025/07/15/trumps-big-crypto-bills-blocked-by-house-republicans---heres-why/",
    "timestamp": "2025-07-15T21:24:29Z"
  },
  {
    "title": "'It was a mirror': Trump's Epstein affair exposed something 'far more corrosive'",
    "description": "By the time the U.S. Justice Department released its memo in July 2025, the faithful were already starting to turn. There was no “client list,” no smoking gun, no perverted cabal of global elites laid bare for public vengeance. What they got instead was a col…",
    "link": "https://www.rawstory.com/trump-epstein-2673247624/",
    "timestamp": "2025-07-15T21:24:02Z"
  },
  {
    "title": "The new Republican populism",
    "description": "It’s the party of main street not Wall Street now: The lights are on at the Consumer Financial Protection Bureau across the street from the White House, and employees still get paid. But, in practice, the bureau has been mostly inoperable for nearly six month…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/the-new-republican-populism-2",
    "timestamp": "2025-07-15T21:23:29Z"
  },
  {
    "title": "Homeland Security Agents Stunned by Pro-Palestine Arrest Orders",
    "description": "Officers from the Department of Homeland Security who arranged the arrests of foreign university students over their pro-Palestinian speech claimed that the orders they received were so unusual, they weren’t sure if they were legal, Politico reported Tuesday.…",
    "link": "https://newrepublic.com/post/197999/donald-trump-homeland-security-pro-palestine-arrest-orders",
    "timestamp": "2025-07-15T21:23:28Z"
  },
  {
    "title": "Gavin Newsom's Warning to Donald Trump Over Plan for Texas Republicans",
    "description": "Newsom responded to Trump calling for a Texas Congressional map redraw.",
    "link": "https://www.newsweek.com/gavin-newsom-warning-donald-trump-texas-republican-redistricting-2099433",
    "timestamp": "2025-07-15T21:21:47Z"
  },
  {
    "title": "Whitmer administration mulls approval of double-digit health insurance rate hikes - The Midwesterner",
    "description": "Michigan health insurance companies are preparing to jack rates by double digits in 2026, according to the Michigan Department of Insurance and Financial Services. The department is accepting public comments through July 31 on proposed rate increases that ave…",
    "link": "https://www.themidwesterner.news/2025/07/whitmer-administration-mulls-approval-of-double-digit-health-insurance-rate-hikes/",
    "timestamp": "2025-07-15T21:21:16Z"
  },
  {
    "title": "Institutions Are Stocking Up on Bitcoin, Ethereum as Retail Interest Cools: Wintermute",
    "description": "The crypto market is maturing thanks to greater institutional adoption.",
    "link": "https://decrypt.co/330274/institutions-stocking-bitcoin-ethereum-retail-cools-wintermute",
    "timestamp": "2025-07-15T21:20:25Z"
  },
  {
    "title": "JP Morgan chief defends independence of Fed chair amid Trump attacks",
    "description": "The boss of JP Morgan Chase, Jamie Dimon, has defended the “absolutely critical” independence of the Federal Reserve chair, as Donald Trump continues to demand immediate cuts in interest rates.\nThe US treasury secretary, Scott Bessent, said on Tuesday that a …",
    "link": "https://biztoc.com/x/cc5a8fbb7d6cb271",
    "timestamp": "2025-07-15T21:19:58Z"
  },
  {
    "title": "America’s only rare earth producer gets a boost from Apple and Pentagon agreements",
    "description": "An unusual direct investment in the company makes the government the largest shareholder.",
    "link": "https://www.denverpost.com/2025/07/15/us-rare-earths/",
    "timestamp": "2025-07-15T21:19:36Z"
  },
  {
    "title": "America’s only rare earth producer gets a boost from Apple and Pentagon agreements",
    "description": "An unusual direct investment in the company makes the government the largest shareholder.",
    "link": "https://www.bostonherald.com/2025/07/15/us-rare-earths/",
    "timestamp": "2025-07-15T21:19:36Z"
  },
  {
    "title": "Trump Promised to End Inflation. He’s Bringing It Back Instead.",
    "description": "Donald Trump was elected president because he said he would end inflation. In exit polls, 76 percent of Trump voters reported that inflation caused them “severe hardship” over the previous year, and according to an Associated Press post-election survey, voter…",
    "link": "https://newrepublic.com/article/198003/trump-promised-end-inflation-tariffs",
    "timestamp": "2025-07-15T21:18:20Z"
  },
  {
    "title": "Guess Who Vacationed At 'Woke' Disneyland?",
    "description": "While on a trip to Disneyland in California on Saturday with his wife and children, Vice President JD Vance rode the theme park’s ride that’s most associated with racial reconciliation, despite Vance railing for years against “woke” culture.\nVance was caught …",
    "link": "https://crooksandliars.com/2025/07/guess-who-vacationed-woke-disneyland",
    "timestamp": "2025-07-15T21:16:59Z"
  },
  {
    "title": "Fyodor Lukyanov: Here’s the fundamental difference between Russian and US strategy towards Ukraine",
    "description": "Trump’s rhetoric masks a deeper instinct to disengage – and a refusal to confront Moscow on substance Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621540-fyodor-lukyanov-trump-ukraine/",
    "timestamp": "2025-07-15T21:16:01Z"
  },
  {
    "title": "US auto safety nominee calls for active oversight of self-driving cars",
    "description": "WASHINGTON :President Donald Trump's nominee to head the nation's auto safety regulator will argue on Wednesday that the agency must actively oversee self-driving vehicle technology, a potential sign of a tougher approach than some critics expected.Jonathan M…",
    "link": "https://www.channelnewsasia.com/business/us-auto-safety-nominee-calls-active-oversight-self-driving-cars-5240311",
    "timestamp": "2025-07-15T21:15:53Z"
  },
  {
    "title": "Democrats seize on Epstein files as a campaign issue and a chance to rile Trump’s base | CNN Politics",
    "description": "Democrats in Congress want to force votes to release the full Jeffrey Epstein files. The party’s candidates are bringing up the Epstein case in campaign speeches. And at least one potential 2028 contender is fundraising off the furor.",
    "link": "https://www.cnn.com/2025/07/15/politics/democrats-epstein-files-trump",
    "timestamp": "2025-07-15T21:14:40Z"
  },
  {
    "title": "EXCLUSIVE: Congressional Republicans To Unveil Bill Stripping National Education Association’s Federal Charter",
    "description": "Congressional Republicans will unveil a bill Wednesday aimed at revoking the federal charter of the National Education Association (NEA), the largest labor union in the United States, the Daily Caller has learned. Republicans Rep. Mark Harris of North Carolin…",
    "link": "https://freerepublic.com/focus/f-bloggers/4328861/posts",
    "timestamp": "2025-07-15T21:13:42Z"
  },
  {
    "title": "EXCLUSIVE: Congressional Republicans To Unveil Bill Stripping National Education Association’s Federal Charter",
    "description": "Congressional Republicans will unveil a bill Wednesday aimed at revoking the federal charter of the National Education Association (NEA), the largest labor union in the United States, the Daily Caller has learned. Republicans Rep. Mark Harris of North Carolin…",
    "link": "https://freerepublic.com/focus/f-news/4328861/posts",
    "timestamp": "2025-07-15T21:13:42Z"
  },
  {
    "title": "Trump Admin Demands University of Michigan Spill Beans On All Foreign Ties",
    "description": "The Department of Education announced it has opened an investigation into the University of Michigan's (UM) \"inaccurate and incomplete\" foreign funding reports.",
    "link": "https://dailycaller.com/2025/07/15/university-of-michigan-education-department-foreign-funding-reports/",
    "timestamp": "2025-07-15T21:13:37Z"
  },
  {
    "title": "‘Hang ’em publicly’: Republican in Congress urges gruesome death for anyone involved in Epstein crimes",
    "description": "'That's not over the top either. I'm ready. I'm over it. It disgusts me. I'm big on clarity and transparency and that's a good reason people don't trust government in either party'",
    "link": "https://www.wnd.com/2025/07/hang-em-publicly-republican-congress-urges-gruesome-death/",
    "timestamp": "2025-07-15T21:11:55Z"
  },
  {
    "title": "Federal agency shifts stance on transgender discrimination complaints, but hurdles remain",
    "description": "The EEOC will allow some complaints filed by transgender workers to move forward.",
    "link": "https://www.bostonherald.com/2025/07/15/eeoc-transgender-discrimination/",
    "timestamp": "2025-07-15T21:11:03Z"
  },
  {
    "title": "The Trump Administration's Surprising New Air-Traffic Control Proposal",
    "description": "The FAA is considering “international talent” for highly sensitive jobs keeping planes in the air.",
    "link": "https://www.theatlantic.com/politics/archive/2025/07/foreign-faa-controllers-trump-hired/683539/",
    "timestamp": "2025-07-15T21:11:00Z"
  },
  {
    "title": "‘Whatever She Thinks Is Credible’: Trump Says Pam Bondi Should Release Part of Epstein Files",
    "description": "Trump still claimed the files were \"made up\" by Democrats.",
    "link": "https://gizmodo.com/whatever-she-thinks-is-credible-trump-says-pam-bondi-should-release-part-of-epstein-files-2000629524",
    "timestamp": "2025-07-15T21:10:55Z"
  },
  {
    "title": "Biden assistant Annie Tomasini becomes third aide subpoenaed to answer questions on prez’s mental decline",
    "description": "\"With no forewarning, on July 14, your counsel requested a subpoena to compel your appearance on July 18,\" the subpoena's cover letter from House Oversight Committee Chairman James Comer (R-Ky.) to attorney Jonathan Su stated.",
    "link": "https://nypost.com/2025/07/15/us-news/biden-assistant-annie-tomasini-becomes-third-aide-subpoenaed-to-answer-questions-on-prezs-mental-decline/",
    "timestamp": "2025-07-15T21:10:02Z"
  },
  {
    "title": "EXCLUSIVE: Congressional Republicans To Unveil Bill Stripping Key Union’s Federal Charter",
    "description": "Congressional Republicans will unveil a bill Wednesday to revoke the National Education Association's (NEA) charter, the Daily Caller has learned.",
    "link": "https://dailycaller.com/2025/07/15/congress-bill-repeal-national-education-association-federal-charter-gop/",
    "timestamp": "2025-07-15T21:09:47Z"
  },
  {
    "title": "“Spineless creeps”: ICE lawyers are hiding their names in court",
    "description": "Legal experts say concealing the identity of someone in open court is unheard of and cause for concern",
    "link": "https://www.salon.com/2025/07/15/spineless-creeps-ice-lawyers-are-hiding-their-names-in-court/",
    "timestamp": "2025-07-15T21:09:40Z"
  },
  {
    "title": "Trump's Gilded Oval Office: Six Months of Gold in the White House",
    "description": "See how the most famous office in the world has changed over the first six months of Trump's second term.",
    "link": "https://www.newsweek.com/donald-trump-white-house-oval-office-gold-decorations-2099426",
    "timestamp": "2025-07-15T21:09:27Z"
  },
  {
    "title": "Donald Trump Jr. and Omeed Malik Still ‘Long on Elon’ After Feud",
    "description": "",
    "link": "https://biztoc.com/x/46a1c8cfcf151a21",
    "timestamp": "2025-07-15T21:08:42Z"
  },
  {
    "title": "Metadata Shows That Critical Minutes Were Deleted From the Epstein Video",
    "description": "Try as he might, but president Donald Trump is failing miserably to get the world to move on from the still ongoing Epstein crisis. Trump's loyal MAGA fan base devolved into a cesspool of conspiracy theories after the White House walked back claims about the …",
    "link": "https://futurism.com/metadata-critical-minutes-deleted-epstein-video",
    "timestamp": "2025-07-15T21:08:36Z"
  },
  {
    "title": "Xi Jinping reinforces China’s military rights in meeting with Albanese",
    "description": "During his meeting with the Chinese president, Anthony Albanese raised concerns about China's live-fire exercises near Australia. Plus, Australia's environmental laws are coming under scrutiny from a former Treasury secretary.\nThe post Xi Jinping reinforces C…",
    "link": "http://www.crikey.com.au/2025/07/16/xi-jinping-anthony-albanese-live-fire-china-epbc-trump-russia/",
    "timestamp": "2025-07-15T21:05:21Z"
  },
  {
    "title": "Trump Says Epstein Files 'Were Made Up' by Comey, Obama, Biden",
    "description": "\"The attorney general has handled that very well. I think that when you look at it, you’ll understand that,\" President Donald Trump said.",
    "link": "https://www.westernjournal.com/trump-says-epstein-files-made-comey-obama-biden/",
    "timestamp": "2025-07-15T21:05:08Z"
  },
  {
    "title": "Did Adam Schiff Commit Mortgage Fraud? (Katie Pavlich/Townhall)",
    "description": "Katie Pavlich / Townhall:\nDid Adam Schiff Commit Mortgage Fraud?  —  Posting on Truth Social Tuesday morning, President Donald Trump accused California Democratic Senator Adam Schiff of committing mortgage fraud.  —  “I have always suspected Shifty Adam Shiff…",
    "link": "https://www.memeorandum.com/250715/p100",
    "timestamp": "2025-07-15T21:05:01Z"
  },
  {
    "title": "House NDAA draft mandates database of contractors used in covert operations",
    "description": "The early stage defense bill draft would create an internal list of contractor clients that assist the U.S. military in its secret operations “to facilitate deconfliction and risk assessment.”",
    "link": "https://www.nextgov.com/policy/2025/07/house-ndaa-draft-mandates-database-contractors-used-covert-operations/406744/",
    "timestamp": "2025-07-15T21:04:00Z"
  },
  {
    "title": "Thousands of Afghans relocated to UK in secret scheme",
    "description": "The British Government has revealed it has secretly moved thousands of Afghans to the UK, after a data leak by a defence official. We'll hear from the journalist who fought to reveal the story and an Afghan who says his family's safety has been threatened. \n\n…",
    "link": "https://www.bbc.co.uk/programmes/w172zss58g56w7z",
    "timestamp": "2025-07-15T21:04:00Z"
  },
  {
    "title": "Bond blues mar stocks' joy",
    "description": "The S&P 500 and Nasdaq leaped to new highs on Tuesday thanks to a surge in Nvidia shares, but closed mixed as investors digested a pick-up in U.S. inflation,...",
    "link": "https://finance.yahoo.com/news/trading-day-bond-blues-mar-210300940.html",
    "timestamp": "2025-07-15T21:03:00Z"
  },
  {
    "title": "Joe Rogan Breaks Silence on Epstein, Hammers Trump Admin For Lies: ‘Just Bomb Iran and Everybody Forgets!’",
    "description": "Joe Rogan tore into President Donald Trump's administration for previous statements officials made regarding the case of Jeffrey Epstein.\nThe post Joe Rogan Breaks Silence on Epstein, Hammers Trump Admin For Lies: ‘Just Bomb Iran and Everybody Forgets!’ first…",
    "link": "https://www.mediaite.com/media/podcasts/joe-rogan-breaks-silence-on-epstein-hammers-trump-admin-for-lies-just-bomb-iran-and-everybody-forgets/",
    "timestamp": "2025-07-15T21:00:44Z"
  },
  {
    "title": "Zohran Mamdani continues to dodge questions about 'globalize the intifada'",
    "description": "New York City's democratic socialist mayoral candidate Zohran Mamdani refused to address \"globalize the intifada\" rhetoric while taking questions during a Monday event.",
    "link": "https://www.foxnews.com/media/zohran-mamdani-continues-dodge-questions-about-globalize-intifada",
    "timestamp": "2025-07-15T21:00:42Z"
  },
  {
    "title": "Churches, now allowed to endorse candidates, could transform campaign finances",
    "description": "Churches, now allowed to endorse candidates, could transform campaign financesgo.com",
    "link": "https://abcnews.go.com/Politics/churches-now-allowed-endorse-candidates-transform-campaign-finances/story?id=123766327",
    "timestamp": "2025-07-15T21:00:18Z"
  },
  {
    "title": "Charlie Kirk says 'Woodstock in reverse' phenomenon is sweeping America as young people embrace conservatism",
    "description": "Charlie Kirk claims a conservative wave among Gen Z represents the 'greatest generational realignment' in decades, with 7,000 students attending TPUSA's Student Action Summit in Florida.",
    "link": "https://www.foxnews.com/media/charlie-kirk-says-woodstock-reverse-phenomenon-rapidly-transforming-americas-youth",
    "timestamp": "2025-07-15T21:00:05Z"
  },
  {
    "title": "World Energy Report Exposes Looming Resource Crises",
    "description": "The Energy Institute recently published its updated energy report, the 2025 Statistical Review of World Energy, showing data through the year 2024. In this post, I identify trends in the new data that I consider worrying. These trends help explain the strange…",
    "link": "https://oilprice.com/Energy/Energy-General/World-Energy-Report-Exposes-Looming-Resource-Crises.html",
    "timestamp": "2025-07-15T21:00:00Z"
  },
  {
    "title": "SPY Attracts $1.8B as S 500 Edges Higher on Tariff Hopes",
    "description": "- SPY led ETF inflows as traders hoped for lower tariffs before the Aug. 1 deadline. - Bitcoin ETFs gained, while QQQ and LQD saw outflows.",
    "link": "http://www.etf.com/sections/daily-etf-flows/spy-attracts-18b-sp-500-edges-higher-tariff-hopes?utm_source=yahoo-financeutm_medium=rssutm_campaign=yahoo-finance-rss",
    "timestamp": "2025-07-15T21:00:00Z"
  },
  {
    "title": "Trump announces 19 percent tariff on Indonesia",
    "description": "The new deal comes as the Southeast Asian country plans to buy 50 Boeing jets, according to US President Donald Trump.",
    "link": "https://www.aljazeera.com/economy/2025/7/15/trump-announces-19-percent-tariff-on-indonesia",
    "timestamp": "2025-07-15T20:59:29Z"
  },
  {
    "title": "Trump mocked after blurting out wild boast: 'LARPing as the ghost of FDR'",
    "description": "President Donald Trump issued a rambling boast about his contributions to the U.S. economy during a speech at the Pennsylvania Energy and Innovation Summit on Tuesday, seeming to pull a bizarre number out of thin air.“So in six months, but really three months…",
    "link": "https://www.rawstory.com/trump-economy-2673245676/",
    "timestamp": "2025-07-15T20:59:03Z"
  },
  {
    "title": "Man Indicted For Killing Former Minnesota House Speaker Melissa Hortman",
    "description": "A federal grand jury has indicted Vance Boelter, who is accused of shooting prominent Minnesota Democratic politicians.",
    "link": "https://www.huffpost.com/entry/federal-grand-jury-charges-man-with-melissa-hortmans-murder-vance-boelter_n_6876be84e4b0bdf6e2f0d4ce",
    "timestamp": "2025-07-15T20:57:19Z"
  },
  {
    "title": "Trump's Approval Rating With Hispanics Surges, New Poll Shows",
    "description": "Hispanic voters have long served as a crucial and growing demographic in national elections, traditionally supporting Democratic candidates.",
    "link": "https://www.newsweek.com/trump-approval-rating-hispanics-surge-poll-2099419",
    "timestamp": "2025-07-15T20:55:01Z"
  },
  {
    "title": "CNN Reporter Reveals Awkward Text She Got From Trump Aides About Dan Bongino’s Whereabouts",
    "description": "The FBI deputy director apparently went MIA after the Jeffrey Epstein files were shelved.",
    "link": "https://www.huffpost.com/entry/cnn-reporter-reveals-awkward-text-she-got-from-trump-aides-about-dan-bonginos-whereabouts_n_687676bfe4b079daaebc4784",
    "timestamp": "2025-07-15T20:54:35Z"
  },
  {
    "title": "Of course The Boys is mocking the newest turn in the Epstein scandal",
    "description": "\"Herogasm confirmed not to exist\"",
    "link": "https://winteriscoming.net/of-course-the-boys-is-mocking-the-newest-turn-in-the-epstein-scandal",
    "timestamp": "2025-07-15T20:54:25Z"
  },
  {
    "title": "Trump just handed China a major advantage on on AI",
    "description": "Late on Monday night, July 14, 2025, the ninth richest man in the world broke some momentous news: The US government would allow him, Nvidia CEO Jensen Huang, to sell H20 processors to Chinese customers again. To people following the Trump administration and …",
    "link": "https://www.vox.com/future-perfect/419791/trump-nvidia-h20-china-ai-chip",
    "timestamp": "2025-07-15T20:54:11Z"
  },
  {
    "title": "Democrats are rightfully trolling Trump over his U-turn on the Epstein files",
    "description": "Democrats are wisely attacking Trump over his flip-flop on releasing the Epstein files, which has infuriated some of his own base.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-epstein-files-democrats-response-rcna218675",
    "timestamp": "2025-07-15T20:53:56Z"
  },
  {
    "title": "ICE bars detained immigrants from getting bond hearings",
    "description": "Under new Trump administration guidance, millions of immigrants who entered the U.S. without legal authorization would have to fight their deportation cases in detention.",
    "link": "https://www.nbcnews.com/news/latino/ice-bars-detained-immigrants-from-getting-bond-hearings-rcna218944",
    "timestamp": "2025-07-15T20:53:45Z"
  },
  {
    "title": "Trump Approval Rating Drops as Americans Weigh in on FBI's Epstein Report",
    "description": "A furious base and an embattled administration have contributed to surprisingly bad news for President Donald Trump.",
    "link": "https://www.westernjournal.com/trump-approval-rating-drops-americans-weigh-fbis-epstein-report/",
    "timestamp": "2025-07-15T20:52:25Z"
  },
  {
    "title": "Trump Says Comey, Biden And Obama 'Made Up' The Epstein Files",
    "description": "He said more information could be released if it's deemed \"credible\" by his attorney general.",
    "link": "https://www.huffpost.com/entry/trump-says-comey-biden-and-obama-made-up-the-epstein-files_n_68769687e4b01cc07834caec",
    "timestamp": "2025-07-15T20:51:22Z"
  },
  {
    "title": "Majority don't believe FBI report on Epstein: Poll",
    "description": "A majority of voters don't believe what the government has to say about the Jeffrey Epstein case in what could prove bad news for President Donald Trump as he tries to move past the scandal, a recent poll found. Overall, 56% of voters do not believe the FBI's…",
    "link": "https://freerepublic.com/focus/f-news/4328858/posts",
    "timestamp": "2025-07-15T20:51:08Z"
  },
  {
    "title": "Justin Sun, Billionaire Buyer of Maurizio Cattelan’s Banana, Is Purchasing $100 M. of Trump’s Memecoin",
    "description": "Last week, crypto billionaire Justin Sun announced that he was purchasing $100 million worth of President Donald Trump's memecoin, $TRUMP.",
    "link": "https://www.artnews.com/art-news/news/justin-sun-maurizio-cattelan-banana-trump-memecoin-1234747455/",
    "timestamp": "2025-07-15T20:50:45Z"
  },
  {
    "title": "Tech and energy giants pour billions to turn Pennsylvania into an AI hub as part of Trump’s tech push",
    "description": "President Donald Trump on Tuesday announced an investment of more than $90 billion from private companies across tech, energy and finance to turn Pennsylvania into a hub for artificial intelligence — a technology that’s expected to upend everything from the e…",
    "link": "https://www.cnn.com/2025/07/15/tech/ai-energy-summit-90-billion-trump-anthropic-meta-google",
    "timestamp": "2025-07-15T20:49:32Z"
  },
  {
    "title": "Democrats capitalize on GOP Jeffrey Epstein fallout with new demands for Jim Jordan",
    "description": "House Democrats demand a public hearing on the Jeffrey Epstein case, seeking testimony from AG Bondi and FBI officials amid Republican divisions over released memo.",
    "link": "https://www.foxnews.com/politics/democrats-capitalize-gop-jeffrey-epstein-fallout-new-demands-jim-jordan",
    "timestamp": "2025-07-15T20:48:39Z"
  },
  {
    "title": "China Gets NVIDIA AI Chips Again as US Approves Sales",
    "description": "NVIDIA can now resume selling its H20 AI chips to China, following the US government's decision to lift previous restrictions.",
    "link": "https://www.androidheadlines.com/2025/07/nvidia-ai-chips-sales-shipping-china.html",
    "timestamp": "2025-07-15T20:48:38Z"
  },
  {
    "title": "Colorado’s Roger Hutson tried to keep Trump from a second term. But six months in, he’s ‘very impressed.’ (Opinion)",
    "description": "Roger Hutson was never a huge fan of Donald Trump. In 2016, he supported Marco Rubio for president, helping raise hundreds of thousands of dollars for his Republican primary bid. In 2024, Hutson worked with \"No Labels,\" a group of Democrats, Republicans and i…",
    "link": "https://www.denverpost.com/2025/07/15/mark-z-barabak-he-tried-to-keep-trump-from-a-second-term-but-six-months-in-im-very-impressed-2/",
    "timestamp": "2025-07-15T20:47:18Z"
  },
  {
    "title": "Israeli strike in Gaza kills 19 members of a family, health officials say | CBC News",
    "description": "Israeli strikes overnight and into Tuesday killed more than 90 Palestinians across the Gaza Strip, including dozens of women and children, health officials said, as U.S. President Donald Trump's timeline to land a ceasefire between Hamas and Israel keeps drif…",
    "link": "https://www.cbc.ca/news/world/israel-hamas-gaza-1.7585446",
    "timestamp": "2025-07-15T20:47:04Z"
  },
  {
    "title": "House GOP hard-liners defy Trump, Speaker Johnson by crippling crypto measures",
    "description": "The intraparty rebellion comes after Trump urged the GOP to vote in favor of it.",
    "link": "https://abcnews.go.com/Politics/house-republican-hard-liners-defy-trump-speaker-johnson/story?id=123780190",
    "timestamp": "2025-07-15T20:46:55Z"
  },
  {
    "title": "Trump announces billions in investments to make Pennsylvania an AI hub",
    "description": "President Donald Trump helped announce more than $90 billion in investments in AI and energy at an event in Pennsylvania on Tuesday. Among those investments include some multi-billion dollar commitments from Google. The company is planning to invest $25 billi…",
    "link": "https://www.theverge.com/news/707369/trump-ai-energy-investments-pennsylvania-billions",
    "timestamp": "2025-07-15T20:46:41Z"
  },
  {
    "title": "Mike Johnson's Message to Pam Bondi Over Jeffrey Epstein Files",
    "description": "The Justice Department's alleged lack of transparency in its Epstein memo has sparked frustration among many Trump supporters.",
    "link": "https://www.newsweek.com/mike-johnson-trump-ghislaine-maxwell-testify-epstein-files-2099432",
    "timestamp": "2025-07-15T20:46:29Z"
  },
  {
    "title": "Trump joins tech, energy executives for summit as administration pushes AI expansion",
    "description": "President Donald Trump joined executives from some of the largest U.S. tech and energy companies for a summit in Pittsburgh on Tuesday as the administration prepares more measures to power the U.S. expansion of artificial intelligence.\nTop economic rivals, th…",
    "link": "https://biztoc.com/x/6f7401e4c87d0d27",
    "timestamp": "2025-07-15T20:46:25Z"
  },
  {
    "title": "Senate Republicans shrink Trump's spending cut package ahead of a key vote",
    "description": "WASHINGTON — Senate Republicans are making changes to a $9.4 billion package of spending cuts proposed by President Donald Trump as they race to pass the measure by a Friday deadline",
    "link": "https://biztoc.com/x/f11bc14df7e041b0",
    "timestamp": "2025-07-15T20:46:07Z"
  },
  {
    "title": "Ukranians Praise “Agent Melania” for Trump’s Sudden Russia Pivot",
    "description": "Ukrainians have begun to credit First Lady Melania Trump for her husband’s 180 on support for Russia and President Vladimir Putin in their all out war on Ukraine. “My conversations with [Putin] are always very pleasant. I say, isn’t that a very lovely convers…",
    "link": "https://newrepublic.com/post/197998/ukranians-praise-agent-melania-trump-russia-pivot",
    "timestamp": "2025-07-15T20:45:25Z"
  },
  {
    "title": "Texas sheriff didn't promise to help Mexican rescuers get green cards",
    "description": "In mid-July 2025, Kerr County Sheriff Larry L. Leitha said he would apply for a green card for the Mexican rescue team that saved his family during deadly Texas flooding..",
    "link": "https://www.snopes.com//fact-check/texas-sheriff-mexican-rescuers-green-cards/",
    "timestamp": "2025-07-15T20:45:00Z"
  },
  {
    "title": "'Ludicrous as can be!' Nicolle Wallace mocks MAGA ally's head-spinning reversals",
    "description": "Far-right conservative Charlie Kirk has been spinning in a circle for 48 hours, and it has left MSNBC host Nicolle Wallace shaking her head. Over the weekend, Kirk noted at his Turning Point USA conference that all of the new, young, male supporters among the…",
    "link": "https://www.rawstory.com/charlie-kirk-epstein/",
    "timestamp": "2025-07-15T20:44:29Z"
  },
  {
    "title": "Trump reshaped the Supreme Court. Now emergency appeals are helping him reshape the government",
    "description": "The court has supported his administration on issues like immigration, federal employee dismissals and military policies.",
    "link": "https://www.bostonherald.com/2025/07/15/supreme-court-trump/",
    "timestamp": "2025-07-15T20:44:10Z"
  },
  {
    "title": "Exclusive -- Rep. Byron Donalds on Gubernatorial Run: Vision Is to Take Florida 'To the Next Level'",
    "description": "TAMPA, Florida -- The vision is to take Florida \"to the next level,\" Rep. Byron Donalds (R-FL) told Breitbart News during an interview at the Turning Point USA Student Action Summit.\nThe post Exclusive — Rep. Byron Donalds on Gubernatorial Run: Vision Is to T…",
    "link": "https://www.breitbart.com/politics/2025/07/15/exclusive-rep-byron-donalds-on-gubernatorial-run-vision-is-to-take-florida-to-the-next-level/",
    "timestamp": "2025-07-15T20:40:55Z"
  },
  {
    "title": "The police militarization debate is over (Radley Balko/The Watch)",
    "description": "Radley Balko / The Watch:\nThe police militarization debate is over  —  Quaint disputes about the proper role of police and military have been superseded by a more urgent threat: Donald Trump is creating his own, personal paramilitary force … For about 40 year…",
    "link": "https://www.memeorandum.com/250715/p94",
    "timestamp": "2025-07-15T20:40:00Z"
  },
  {
    "title": "Lefties Devolve Into Civil War Over How To Respond To Epstein Story",
    "description": "The left is quickly devolving into a civil war of their own as they strategize a response to Republicans and the Jeffrey Epstein drama.",
    "link": "https://dailycaller.com/2025/07/15/epstein-files-trump-admin-democrats-ro-khanna-hakeem-jeffries/",
    "timestamp": "2025-07-15T20:39:28Z"
  },
  {
    "title": "British Open 101: History, qualifications, course rota, most titles",
    "description": "You've got Open questions, we've got Open answers. Take a look at some answers to frequently asked questions about The Open.",
    "link": "https://www.nbcsports.com/golf/news/british-open-101-history-qualifications-course-rota-most-titles",
    "timestamp": "2025-07-15T20:37:00Z"
  },
  {
    "title": "Trump claims tariff deal with Indonesia",
    "description": "Trump claims tariff deal with Indonesia\nUS President Donald Trump said he has settled on another tariff deal - this time with Indonesia.\nTrump said he had agreed to lower tariffs he had threatened on goods entering the US from Indonesia to 19%, in exchange fo…",
    "link": "https://biztoc.com/x/70cd3bfde690a2c0",
    "timestamp": "2025-07-15T20:35:33Z"
  },
  {
    "title": "Inflation concerns trigger a market dip as new data shows impact of Trump tariffs in June",
    "description": "Stocks dipped on Tuesday as new consumer price index data showed rising inflation and the Aug. 1 deadline for Trump’s tariff campaign loomed. \nPresident Donald Trump’s tariff campaign is coming for your price tags. On Tuesday, the Labor Department released ne…",
    "link": "https://biztoc.com/x/2d6c2b99aa773951",
    "timestamp": "2025-07-15T20:35:04Z"
  },
  {
    "title": "Trump Hails $92 Billion in Investments for AI, Energy Projects",
    "description": "President Donald Trump hailed more than $92 billion in investments in artificial intelligence and energy infrastructure during a visit to Pennsylvania, highlighting his efforts to bolster US competitiveness in the AI field.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-hails-92-billion-in-investments-for-ai-energy-projects",
    "timestamp": "2025-07-15T20:30:45Z"
  },
  {
    "title": "Mike Waltz grilled over Signal leak at UN ambassador hearing",
    "description": "President Trump's former national security adviser was pressed on the inclusion of a journalist on a sensitive group chat discussing war plans.",
    "link": "https://www.bbc.com/news/articles/c4gdyx8v5y5o",
    "timestamp": "2025-07-15T20:29:15Z"
  },
  {
    "title": "Agriculture Secretary Brooke L. Rollins: A Common-Sense Plan to Strengthen America's Food Safety | Opinion",
    "description": "We're modernizing our inspection system. We're embracing science. We're removing needless bureaucracy that doesn't make food safer while strengthening the oversight that does.",
    "link": "https://www.newsweek.com/agriculture-secretary-brooke-l-rollins-common-sense-plan-strengthen-americas-food-safety-2099338",
    "timestamp": "2025-07-15T20:29:10Z"
  },
  {
    "title": "GOP Derails Second Democrat Effort To Unearth Epstein Files",
    "description": "House Republicans moved to block a second effort from the chamber's Democrats to force a vote on releasing materials related to Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/07/15/house-republicans-democrats-epstein-files-block/",
    "timestamp": "2025-07-15T20:28:49Z"
  },
  {
    "title": "Senate Republicans shrink Trump's spending cut package ahead of a key vote",
    "description": "WASHINGTON — Senate Republicans are making changes to a $9.4 billion package of spending cuts proposed by President Donald Trump as they race to pass the measure by a Friday deadline",
    "link": "https://www.nbcnews.com/politics/congress/senate-republicans-shrink-trumps-spending-cut-package-ahead-key-vote-rcna218962",
    "timestamp": "2025-07-15T20:27:56Z"
  },
  {
    "title": "What Trump knows about ‘Superman’ — that Hollywood can’t comprehend",
    "description": "In James Gunn’s new film, America is nothing special. Neither, for that matter, is Superman. It's a bland and demoralizing vision all too typical of the left today.",
    "link": "https://nypost.com/2025/07/15/opinion/what-trump-knows-about-superman-that-hollywood-doesnt/",
    "timestamp": "2025-07-15T20:26:45Z"
  }
]