[
  {
    "title": "Malta condemns killing of Iran protesters, warns tensions could escalate",
    "description": "Malta condemns killing of Iran protesters, warns tensions could escalatetimesofmalta.com",
    "link": "https://timesofmalta.com/article/malta-condemns-killing-iran-protesters-warns-tensions-escalate.1122984",
    "timestamp": "2026-01-23T13:59:00Z"
  },
  {
    "title": "Working with Board of Peace is going to be 'good thing' for UN: Trump",
    "description": "President Donald Trump has launched the Board of Peace, an international organization formed in Davos. He believes this new body will help the United Nations achieve its potential, particularly in Gaza. Several countries have joined the Charter of the Board o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/working-with-board-of-peace-is-going-to-be-good-thing-for-un-trump/articleshow/127289939.cms",
    "timestamp": "2026-01-23T13:58:16Z"
  },
  {
    "title": "US completes withdrawal from World Health Organization - WSVN 7News | Miami News, Weather, Sports | Fort Lauderdale",
    "description": "NEW YORK (AP) — The U.S. has finalized its withdrawal from the World Health Organization, one year after President Donald Trump announced America was ending<a class=\"excerpt-read-more\" href=\"https://wsvn.com/news/us-world/us-completes-withdrawal-from-world-he…",
    "link": "https://wsvn.com/news/us-world/us-completes-withdrawal-from-world-health-organization/",
    "timestamp": "2026-01-23T13:57:21Z"
  },
  {
    "title": "‘Imperial’ agenda: What’s Trump’s Gaza development plan, unveiled in Davos?",
    "description": "The plan promises coastal tourism, free trade, skyscrapers and jobs. But the people of Gaza have not been consulted.",
    "link": "https://www.aljazeera.com/news/2026/1/23/imperial-agenda-whats-trumps-gaza-development-plan-unveiled-in-davos",
    "timestamp": "2026-01-23T13:56:51Z"
  },
  {
    "title": "Jack Smith Was Great But Did Y'all See Michael Fanone Almost Beat The Sh*t Out Of That Guy?",
    "description": "Also when Fanone coughed 'GO FUCK YOURSELF' at Troy Nehls? Congress is fun!",
    "link": "https://www.wonkette.com/p/jack-smith-was-great-but-did-yall",
    "timestamp": "2026-01-23T13:55:34Z"
  },
  {
    "title": "Who controls TikTok’s US platform under new deal?",
    "description": "It comes after TikTok faced years of intense scrutiny in the US due to concerns about user data privacy.",
    "link": "https://www.aljazeera.com/news/2026/1/23/who-controls-tiktoks-us-platform-under-new-deal",
    "timestamp": "2026-01-23T13:55:21Z"
  },
  {
    "title": "I was in the room when Trump addressed leaders in Davos. Here are my top takeaways",
    "description": "This week in Davos has been about many things: AI, geopolitics and markets. But President Donald Trump has been firmly at the front of everyone’s mind. His much-anticipated address at the World Economic Forum drew thousands, with attendees queuing for hours t…",
    "link": "https://freerepublic.com/focus/f-news/4363561/posts",
    "timestamp": "2026-01-23T13:53:33Z"
  },
  {
    "title": "Crypto takeaways from Davos: Politics and money collide",
    "description": "Crypto is shedding its illicit money image, but central bankers at the World Economic Forum in Davos 2026 warned it threatens monetary sovereignty.",
    "link": "https://cointelegraph.com/news/crypto-takeaways-davos-politics-money-collide",
    "timestamp": "2026-01-23T13:53:08Z"
  },
  {
    "title": "American Psycho: How Donald Trump Brought the “Bateman Doctrine” to the World",
    "description": "There is a moment in American Psycho when Patrick Bateman realizes that the rules do not apply to him. Not because he has outsmarted the system, and not because the system has collapsed, but because it never truly existed for",
    "link": "https://lithub.com/american-psycho-how-donald-trump-brought-the-bateman-doctrine-to-the-world/",
    "timestamp": "2026-01-23T13:52:59Z"
  },
  {
    "title": "Homicide in the U.S. Is the Lowest Ever Measured. No One Person Gets to Take Credit.",
    "description": "Crimes like homicide have been falling sharply ever since the pandemic and have reached historic lows, despite Republican fearmongering.",
    "link": "https://www.jezebel.com/us-homicide-rate-murders-crime-decreases-cities-republicans-trump-immigration-national-guard",
    "timestamp": "2026-01-23T13:51:07Z"
  },
  {
    "title": "Is it time to START worrying? Nuclear restraint is about to fade without a fight",
    "description": "As the collapse of New START ends half a century of nuclear arms control, Russia and the US approach a world without limits on arsenals Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631408-silence-before-arms-race-start/",
    "timestamp": "2026-01-23T13:49:27Z"
  },
  {
    "title": "Merz, Meloni rally behind disinfo-fighting center that Trump thinks is ‘wasteful’",
    "description": "German and Italian leaders want to hold the line against Russia's hybrid threats.",
    "link": "https://www.politico.eu/article/merz-meloni-rally-behind-disinfo-center-that-trump-thinks-is-wasteful/",
    "timestamp": "2026-01-23T13:47:57Z"
  },
  {
    "title": "Trump steals the show in Davos with a mixed bag of rhetoric and results at elite gathering",
    "description": "Trump's Davos trip overshadowed discussions on AI and renewable energy at the World Economic Forum.",
    "link": "https://www.bostonherald.com/2026/01/23/trump-steals-show-davos-2026/",
    "timestamp": "2026-01-23T13:47:36Z"
  },
  {
    "title": "McEntee says the government is 'at one' when it comes to Trump's 'Board of Peace'",
    "description": "So far, France, Denmark, Sweden, Norway and Slovenia have all confirmed they will not join the board.",
    "link": "https://www.thejournal.ie/board-of-peace-ireland-helen-mcentee-6936188-Jan2026/",
    "timestamp": "2026-01-23T13:47:22Z"
  },
  {
    "title": "Virginia Democrats May Not Have Hit Bottom Yet",
    "description": "Regarding Virginia, at least the situation couldn’t get any worse, right? Wrong. Progressives can always progress from bad to still worse. Via Daily Caller: Former Space Force Col. Bree Fram, a transgender military officer booted by President Donald Trump’s J…",
    "link": "https://moonbattery.com/virginia-democrats-may-not-have-hit-bottom-yet/",
    "timestamp": "2026-01-23T13:46:50Z"
  },
  {
    "title": "Trump loves the 'gruesome pictures' of ICE brutality: former adviser",
    "description": "A discussion on the damage Department of Homeland Security head Kristi Noem and Donald Trump adviser Stephen Miller are doing to the administration with their extremist anti-immigrant policies led a former adviser to the president to claim that Trump accepts …",
    "link": "https://www.rawstory.com/trump-ice-2675008429/",
    "timestamp": "2026-01-23T13:46:08Z"
  },
  {
    "title": "J6 Cop Coughs Vulgar Curse to Republican Rep During Jack Smith Hearing",
    "description": "During questioning, Texas Rep. Troy Nehls blamed U.S. Capitol Police leadership for the Jan. 6, 2021, incursion, prompting Fanone’s outburst.",
    "link": "https://www.westernjournal.com/j6-cop-coughs-vulgar-curse-republican-rep-jack-smith-hearing/",
    "timestamp": "2026-01-23T13:42:28Z"
  },
  {
    "title": "Russia, Ukraine and US set to hold 1st trilateral talks since start of war",
    "description": "Delegations from Russia, Ukraine and the U.S. will hold trilateral talks in United Arab Emirates on Friday in what officials say will be their first trilateral meeting.",
    "link": "https://abcnews.go.com/International/russia-ukraine-us-set-hold-1st-trilateral-talks/story?id=129483451",
    "timestamp": "2026-01-23T13:42:04Z"
  },
  {
    "title": "Trump steals the show in Davos with a mixed bag of rhetoric and results at elite gathering",
    "description": "U.S. President Donald Trump has taken center stage at the World Economic Forum in Davos, overshadowing discussions on AI and renewable energy",
    "link": "https://abcnews.go.com/Business/wireStory/trump-steals-show-davos-mixed-bag-rhetoric-results-129486607",
    "timestamp": "2026-01-23T13:41:56Z"
  },
  {
    "title": "Will Princess Kate go on her ‘first foreign trip since 2022’ this year?",
    "description": "The current Prince and Princess of Wales are handled with kid gloves across the board. Kate has been infantilized by the Windsors and the British media for the past two decades, and every outlet still writes about her like she’s a big girl who should be appla…",
    "link": "https://www.celebitchy.com/956276/will_princess_kate_go_on_her_first_foreign_trip_since_2022_this_year/",
    "timestamp": "2026-01-23T13:40:38Z"
  },
  {
    "title": "Trump Fans on CNN Revolt Over Trump Demand to Go After Jack Smith for ‘Large Scale Perjury!’",
    "description": "Trump supporters on CNN revolted over Trump’s demand to prosecute Jack Smith for \"large scale perjury\" while still defending the president.\nThe post Trump Fans on CNN Revolt Over Trump Demand to Go After Jack Smith for ‘Large Scale Perjury!’ first appeared on…",
    "link": "https://www.mediaite.com/media/tv/trump-fans-on-cnn-revolt-over-trump-demand-to-go-after-jack-smith-for-large-scale-perjury/",
    "timestamp": "2026-01-23T13:38:14Z"
  },
  {
    "title": "Officer Beaten In Capitol Riot Coughs Obscene Message To GOP Rep During Hearing",
    "description": "Michael Fanone watched the proceedings but couldn't stay silent when Rep. Troy Nehls gabbed on about who he thought was to blame for the siege.",
    "link": "https://www.huffpost.com/entry/michael-fanone-fuck-yourself_n_69735f95e4b0a02ab3a0d7a8",
    "timestamp": "2026-01-23T13:34:10Z"
  },
  {
    "title": "World order changing, not rupturing, finance chiefs say",
    "description": "Global finance leaders at Davos pushed back on Mark Carney's narrative of a world order rupture, suggesting instead a period of change and adaptation. While acknowledging increased uncertainty and the need for national resilience, they emphasized identifying …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/world-order-changing-not-rupturing-finance-chiefs-say/articleshow/127287986.cms",
    "timestamp": "2026-01-23T13:33:30Z"
  },
  {
    "title": "EU to suspend 93 billion euro retaliatory trade package against US for 6 months",
    "description": "The European Commission plans to extend a six-month suspension on a 93-billion-euro retaliatory trade package against the U.S. This move comes after the U.S. removed tariff threats, allowing the EU to focus on implementing a joint trade statement. The suspend…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eu-to-suspend-93-billion-euro-retaliatory-trade-package-against-us-for-6-months/articleshow/127287921.cms",
    "timestamp": "2026-01-23T13:32:51Z"
  },
  {
    "title": "Why ‘ghost growth’ is reshaping how US workers measure career success",
    "description": "Modern workplaces are increasingly shaped by “ghost growth,” a trend where employees feel pressured to appear successful despite stagnant pay or roles. A MyPerfectResume survey found 52% experience this strain, driven largely by peers and social media. The ph…",
    "link": "https://timesofindia.indiatimes.com/education/careers/news/why-ghost-growth-is-reshaping-how-us-workers-measure-career-success/articleshow/127286811.cms",
    "timestamp": "2026-01-23T13:31:37Z"
  },
  {
    "title": "Italy rebukes Zelensky for lack of gratitude",
    "description": "Italian Foreign Minister Antonio Tajani has blasted Vladimir Zelensky for his criticism of Ukraine’s European supporters Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631416-zelensky-ungreatful-italy-davos/",
    "timestamp": "2026-01-23T13:31:30Z"
  },
  {
    "title": "How a smaller IRS, budget cuts may impact 2026 tax filing: 'Buckle your seatbelts,' one expert says",
    "description": "IRS staffing and budget cuts could impact the 2026 tax filing season. Here's what taxpayers need to know.",
    "link": "https://www.cnbc.com/2026/01/23/smaller-irs-budget-cuts-impact-2026-tax-season.html",
    "timestamp": "2026-01-23T13:30:01Z"
  },
  {
    "title": "Iranian cleric says Iran may target US investments in region if attacked",
    "description": "DUBAI, Jan 23 (Reuters) - An ‌influential Iranian cleric warned on Friday that Iran may target ‌U.S.-linked investments in the region in retaliation for any U.S. ‌attack on the Islamic Republic, Iranian news agencies reported. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/23/iranian-cleric-says-iran-may-target-us-investments-in-region-if-attacked",
    "timestamp": "2026-01-23T13:28:00Z"
  },
  {
    "title": "Do ICE agents get bonuses for arrests even if people are released? Inspecting the claim",
    "description": "The rumor spread following a Wall Street Journal report about ICE's actions in Minneapolis.",
    "link": "https://www.snopes.com//news/2026/01/25/ice-arrest-bonuses/",
    "timestamp": "2026-01-23T13:28:00Z"
  },
  {
    "title": "Trump warns U.S. 'armada' heading to Iran; Death toll in protest crackdown tops 5,000, activists say",
    "description": "President Donald Trump has said that an American \"armada\" is heading toward Iran, as the death toll from the regime's crackdown on nationwide unrest rose past at least 5,000 people, activists said",
    "link": "https://www.nbcnews.com/world/iran/trump-armada-iran-death-toll-protest-crackdown-executions-rcna255547",
    "timestamp": "2026-01-23T13:27:45Z"
  },
  {
    "title": "5 Democratic states asking judge to keep Trump from withholding money for child care",
    "description": "The states say the move was instead intended to damage Trump’s political adversaries.",
    "link": "https://www.bostonherald.com/2026/01/23/states-social-service-funds-hearing/",
    "timestamp": "2026-01-23T13:27:13Z"
  },
  {
    "title": "TikTok Secures Its US Future by Creating New Joint Venture",
    "description": "TikTok has completed a deal to create a new U.S.-based joint venture, resolving years of uncertainty over whether the app would be banned in the United States.\n[Read More]",
    "link": "https://petapixel.com/2026/01/23/tiktok-secures-its-us-future-by-creating-new-joint-venture/",
    "timestamp": "2026-01-23T13:26:13Z"
  },
  {
    "title": "US–EU economic ties show why neither side can decouple",
    "description": "Despite a pause in tariff escalation, US–EU trade remains volatile under Donald Trump. From deficits and energy to services and the dollar, the transatlantic relationship reveals deep ties — and clear vulnerabilities. US President Donald Trump argues that the…",
    "link": "https://www.dw.com/en/useu-economic-ties-show-why-neither-side-can-decouple/a-75610955",
    "timestamp": "2026-01-23T13:26:00Z"
  },
  {
    "title": "Trump vs. Powell: The War for the Federal Reserve Escalates",
    "description": "The long-simmering tension between US President Donald Trump and Federal Reserve Chairman Jerome Powell has erupted into a full-blown constitutional crisis. What began as a series of vitriolic tweets and campaign trail insults has mutated into a direct execut…",
    "link": "https://www.fairobserver.com/politics/trump-vs-powell-the-war-for-the-federal-reserve-escalates/",
    "timestamp": "2026-01-23T13:24:48Z"
  },
  {
    "title": "U.S., in control of oil dollars, heaps pressure on Iraq over Iranian influence",
    "description": "By Maha El Dahan, Timour Azhari and Humeyra PamukDUBAI/WASHINGTON, Jan 23 - Washington has threatened senior Iraqi politicians with sanctions targeting the Iraqi state — … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/23/u-s-in-control-of-oil-dollars-heaps-pressure-on-iraq-over-iranian-influence",
    "timestamp": "2026-01-23T13:23:26Z"
  },
  {
    "title": "It’s Time to Call The Baby Ugly – Someone Needs to Tell President Donald Trump",
    "description": "It’s Time to Call The Baby Ugly – Someone Needs to Tell President Donald TrumpJanuary 22, 2026 | Sundance As most of you know for several years, I have been on the trail of the intelligence community role in the targeting of President Trump. Part of that rese…",
    "link": "https://freerepublic.com/focus/f-bloggers/4363555/posts",
    "timestamp": "2026-01-23T13:22:00Z"
  },
  {
    "title": "Ukraine, US and Russia: do rare trilateral talks mean peace is possible?",
    "description": "Rush to meet signals potential agreement but scepticism of Russian motives remain",
    "link": "https://theweek.com/world-news/ukraine-us-russia-trilateral-talks-uae-peace",
    "timestamp": "2026-01-23T13:19:22Z"
  },
  {
    "title": "‘The ultimate insult’: Trump downplaying NATO’s Afghanistan involvement causes distress in UK",
    "description": "Donald Trump provoked outrage and distress in the U.K. with his suggestion that troops from NATO countries stayed away from the frontline.",
    "link": "https://www.bostonherald.com/2026/01/23/trump-nato-afghanistan-uk-distress/",
    "timestamp": "2026-01-23T13:14:41Z"
  },
  {
    "title": "Trump sues JPMorgan, Intel's soft guidance, TikTok's joint venture and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2026/01/23/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2026-01-23T13:13:58Z"
  },
  {
    "title": "\"Emperor\" Trump's So-Called Board of Peace Erases Palestinians from Gaza Governance",
    "description": "As President Donald Trump formally inaugurated his so-called Board of Peace at the World Economic Forum in Davos, Switzerland, on Thursday, his son-in-law Jared Kushner presented his vision of turning the Gaza Strip into an upscale seaside resort with gleamin…",
    "link": "https://www.democracynow.org/2026/1/23/trump_kushner_gaza_plan_catastrophic_success",
    "timestamp": "2026-01-23T13:13:33Z"
  },
  {
    "title": "TikTok Finalizes Deal With US to Avoid Ban: What to Know",
    "description": "The United States and China have signed off on a deal that hands control of TikTok’s U.S. operations to a group of American investors. It’s a milestone moment for TikTok after years of battles that began in 2020 when President Donald Trump wanted to ban the a…",
    "link": "https://www.today.com/video/us-and-china-finalize-tiktok-deal-here-s-what-you-need-to-know-256450117768",
    "timestamp": "2026-01-23T13:12:06Z"
  },
  {
    "title": "Outrage after Trump claims NATO troops avoided Afghan front line",
    "description": "Britain has strongly criticized Donald Trump for his remarks about NATO troops in Afghanistan. Trump claimed allied soldiers did not fight on the front lines. This statement angered Britain, which lost 457 soldiers in the conflict. Prime Minister Keir Starmer…",
    "link": "https://economictimes.indiatimes.com/news/defence/outrage-after-trump-claims-nato-troops-avoided-afghan-front-line/articleshow/127285718.cms",
    "timestamp": "2026-01-23T13:11:59Z"
  },
  {
    "title": "Economic leaders say global growth is resilient despite disruption from Trump",
    "description": "The global economy is growing and showing unexpected resilience despite the noise from Donald Trump.",
    "link": "https://www.twincities.com/2026/01/23/economic-leaders-economy-resilient-trump/",
    "timestamp": "2026-01-23T13:11:46Z"
  },
  {
    "title": "US Murder Rate Plunges to Lowest Level in Over a Century Under Trump",
    "description": "The average reported homicide rate declined 21 percent in 35 major U.S. cities in 2025, marking the largest one-year drop of all time.",
    "link": "https://www.westernjournal.com/us-murder-rate-plunges-lowest-level-century-trump/",
    "timestamp": "2026-01-23T13:11:45Z"
  },
  {
    "title": "Purdue blocks admission of many Chinese grad students in unwritten policy",
    "description": "In an unprecedented step for a major research university, Purdue University has begun to curb the flow of Chinese graduate students to its Indiana campuses. The policy follows pressure from Congress and President Donald Trump for U.S. institutions to monitor …",
    "link": "https://freerepublic.com/focus/f-chat/4363553/posts",
    "timestamp": "2026-01-23T13:11:07Z"
  },
  {
    "title": "Taiwan looks forward to more chip investment in Arizona, president says",
    "description": "Taiwan's President Lai Ching-te met with US Senator Ruben Gallego. He expressed anticipation for more semiconductor investment in Arizona. This move aims to bolster ties with the United States. TSMC is already investing significantly in Phoenix. Taiwan and th…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/taiwan-looks-forward-to-more-chip-investment-in-arizona-president-says/articleshow/127285176.cms",
    "timestamp": "2026-01-23T13:09:55Z"
  },
  {
    "title": "Journalist unpacks Stephen Miller’s chilling message to ICE agents: 'It's very striking'",
    "description": "Instances of federal immigration officers firing or drawing guns have surged\r\n under President Donald Trump’s second term, a trend investigative journalist Caitlin Dickerson linked to a recent chilling message from top Trump aide Stephen Miller.Appearing on T…",
    "link": "https://www.rawstory.com/ice-2675008440/",
    "timestamp": "2026-01-23T13:09:15Z"
  },
  {
    "title": "Texas and Oklahoma brace for heavy snow and crippling ice",
    "description": "Forecasters say over half the U.S. population could be affected by snow, ice or bitter cold as a winter storm sweeps across the county",
    "link": "https://www.wsbradio.com/news/texas-oklahoma-brace/OILGWZCZWIYJVEGFJ4SF6OZ6IM/",
    "timestamp": "2026-01-23T13:07:52Z"
  },
  {
    "title": "The Download: chatbots for health, and US fights over AI regulation",
    "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. “Dr. Google” had its issues. Can ChatGPT Health do better?   For the past two decades, there’s been a clear first step fo…",
    "link": "https://www.technologyreview.com/2026/01/23/1131708/the-download-chatbots-for-health-and-us-fights-over-ai-regulation/",
    "timestamp": "2026-01-23T13:07:00Z"
  },
  {
    "title": "Trump claim on NATO role in Afghanistan draws UK condemnation",
    "description": "UK politicians have accused Trump of avoiding military service during the Vietnam War.",
    "link": "https://www.aljazeera.com/news/2026/1/23/trump-claim-on-nato-role-in-afghanistan-draws-condemnation",
    "timestamp": "2026-01-23T13:04:39Z"
  },
  {
    "title": "Economic leaders at Davos say global growth is resilient despite disruption from Trump",
    "description": "The global economy is growing and showing unexpected resilience despite the noise from Donald Trump.",
    "link": "https://www.bostonherald.com/2026/01/23/economic-leaders-economy-resilient-trump/",
    "timestamp": "2026-01-23T13:02:33Z"
  },
  {
    "title": "‘Makes No Political Sense!’ Joe Scarborough Warns Republicans Will ‘Lose’ Against Jack Smith ‘Every Time’",
    "description": "Scarborough argued there were other cases brought against Trump that Republicans could challenge, but Smith was a bad call.\nThe post ‘Makes No Political Sense!’ Joe Scarborough Warns Republicans Will ‘Lose’ Against Jack Smith ‘Every Time’ first appeared on Me…",
    "link": "https://www.mediaite.com/media/tv/makes-no-political-sense-joe-scarborough-warns-republicans-will-lose-against-jack-smith-every-time/",
    "timestamp": "2026-01-23T13:02:12Z"
  },
  {
    "title": "The future of Greenland is America",
    "description": "Europe cannot be trusted to keep out Russia and China from Greenland. Opinion.",
    "link": "https://www.israelnationalnews.com/news/421373",
    "timestamp": "2026-01-23T13:02:06Z"
  },
  {
    "title": "Voltaire, International Newsletter N°159",
    "description": "Our director of publication and editor-in-chief directed French magazines several years ago, and has won journalism awards abroad. He has regularly contributed to some fifteen major dailies and magazines around the world. \nVoltaire, International Newsletter i…",
    "link": "https://www.voltairenet.org/article223560.html",
    "timestamp": "2026-01-23T13:01:00Z"
  },
  {
    "title": "Why Latin America Has Been Demure in Davos",
    "description": "U.S. aggression is nothing new for the region.",
    "link": "http://foreignpolicy.com/2026/01/23/latin-america-davos-carney-global-order-us-trump-economy/",
    "timestamp": "2026-01-23T13:00:51Z"
  },
  {
    "title": "Posthaste: Stock markets digest another TACO in high-wire week that leaves world breathing easier — for now",
    "description": "Investors found their feet again as Trump backed down on Greenland and tariff threats and took some hits in his attacks on the Fed. Read on.",
    "link": "https://financialpost.com/news/stock-markets-digest-another-taco-high-wire-week",
    "timestamp": "2026-01-23T13:00:37Z"
  },
  {
    "title": "'Armada' Heading Toward Iran...",
    "description": "The U.S. president said a “massive“ naval force is going towards Islamic Republic.",
    "link": "https://www.newsweek.com/donald-trump-warns-of-armada-heading-to-iran-11404867",
    "timestamp": "2026-01-23T13:00:12Z"
  },
  {
    "title": "Military Buildup In Middle East Continues...",
    "description": "The aircraft carrier USS Abraham Lincoln is on its way to the Middle East while additional air defenses are flowing into the region as well.",
    "link": "http://www.twz.com/news-features/military-buildup-in-the-middle-east-continues-including-what-trump-describes-as-a-big-flotilla",
    "timestamp": "2026-01-23T13:00:12Z"
  },
  {
    "title": "Trump’s new Board of Peace logo feels like a parody",
    "description": "Critics claim it’s \"AI slop”.",
    "link": "https://www.creativebloq.com/design/logos-icons/trumps-new-board-of-peace-logo-feels-like-a-parody",
    "timestamp": "2026-01-23T13:00:00Z"
  },
  {
    "title": "Guess When Catholic Cardinals Are Touted for Their Moral Authority?",
    "description": "Leftist media outlets take an extremely opportunistic approach to covering the intersection of religion and politics. They’re appalled at religion when it impedes their agenda,... Read More\nThe post Guess When Catholic Cardinals Are Touted for Their Moral Aut…",
    "link": "https://www.dailysignal.com/2026/01/23/guess-when-catholic-cardinals-are-touted-for-their-moral-authority/",
    "timestamp": "2026-01-23T13:00:00Z"
  },
  {
    "title": "Trump’s Greenland Takeover Could Be Silicon Valley’s Libertarian Dream Come True",
    "description": "Tech billionaires have long dreamed of creating industrial colonies with no government oversight, and they see opportunity in Trump's expansionism.",
    "link": "http://www.rollingstone.com/culture/culture-features/greenland-silicon-valley-libertarian-trump-1235502736/",
    "timestamp": "2026-01-23T13:00:00Z"
  },
  {
    "title": "British troops were in Afghanistan from start to finish - despite what Trump says",
    "description": "Despite Donald Trump's comments over troops from NATO countries in Afghanistan, it was British troops who were there alongside the US until the end.",
    "link": "https://news.sky.com/story/british-troops-were-in-afghanistan-from-start-to-finish-despite-what-trump-says-13498041",
    "timestamp": "2026-01-23T12:57:00Z"
  },
  {
    "title": "Trump Baselessly Claims NATO Troops Stayed ‘Off The Frontlines’ In Afghanistan",
    "description": "The president also suggested the U.S. should have “put NATO to the test” to advance his domestic agenda.",
    "link": "https://www.huffpost.com/entry/donald-trump-questions-nato-troops-sacrifice_n_69735afae4b0283a09774fbe",
    "timestamp": "2026-01-23T12:55:42Z"
  },
  {
    "title": "Greenland galvanises Europe to confront new US reality",
    "description": "Europe may have rallied to see off President Donald Trump over Greenland, but its leaders recognise the confrontation is unlikely to be the last in dealings with his increasingly strident version of the US.",
    "link": "https://www.rte.ie/news/business/2026/0123/1554709-greenland-galvanises-europe-to-confront-new-us-reality/",
    "timestamp": "2026-01-23T12:55:34Z"
  },
  {
    "title": "TikTok Deal Will Keep It Online in the US, but Your Experience of the App Might Change",
    "description": "TikTok has secured its future by agreeing to split the US app from the global business. But the deal will spark changes to how the app's algorithm works.",
    "link": "https://www.cnet.com/tech/services-and-software/tiktok-strikes-deal-with-white-house-to-split-off-us-app/",
    "timestamp": "2026-01-23T12:54:40Z"
  },
  {
    "title": "Trump angers allies with claim NATO troops ‘stayed a little back’ from frontlines in Afghanistan | CNN",
    "description": "US President Donald Trump has once again questioned whether NATO allies would “be there” if the United States “ever needed them,” claiming that the alliance’s troops “stayed a little back” from the frontlines in Afghanistan.",
    "link": "https://www.cnn.com/2026/01/23/world/trump-nato-afghanistan-frontlines-intl",
    "timestamp": "2026-01-23T12:53:17Z"
  },
  {
    "title": "The underside of the Chagos Islands retrocession",
    "description": "• British Prime Minister Keir Starmer announced the return of the Chagos Islands to the archipelago of Mauritius (cf. VIN 2252). A $139 million annual lease has been signed for the Diego Garcia military base, for 99 years. According to Starmer, it is essentia…",
    "link": "https://www.voltairenet.org/article223559.html",
    "timestamp": "2026-01-23T12:49:31Z"
  },
  {
    "title": "This Trump ploy isn't just scandalously unethical: it's yet another impeachable offense",
    "description": "This isn’t merely scandalous or unethical: it’s impeachable on its face and dangerous to the survival of democracy worldwide.Donald Trump is trying to use a United Nations resolution to justify making himself King of the World via a new “Board of Peace” that …",
    "link": "https://www.rawstory.com/raw-investigates/this-trump-gambit-isn-t-just-scandalously-unethical-it-s-yet-another-impeachable-offense/",
    "timestamp": "2026-01-23T12:48:45Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to Friday, January 23, 2026—the end of the coldest work week of the past year.  Here’s today’s weather, with temperatures in Fahrenheit (!) and the prediction for the next week: And it’s National Pie Day, celebrating another contribution of America to…",
    "link": "https://whyevolutionistrue.com/2026/01/23/friday-hili-dialogue-560/",
    "timestamp": "2026-01-23T12:45:50Z"
  },
  {
    "title": "Meloni joins Merz in urging ‘swift implementation’ of EU-Mercosur trade deal",
    "description": "More than 20 ministers from Italy and Germany are meeting at an opulent Roman villa to discuss closer cooperation.",
    "link": "https://www.politico.eu/article/meloni-joins-merz-in-calling-for-swift-implementation-of-eu-mercosur-trade-deal/",
    "timestamp": "2026-01-23T12:45:07Z"
  },
  {
    "title": "Trump 0, Europe 1 — Ignorance and contempt lose a round — As I wrote yesterday ... (Paul Krugman)",
    "description": "Paul Krugman:\nTrump 0, Europe 1  —  Ignorance and contempt lose a round  —  As I wrote yesterday, Donald Trump and his team clearly went to Davos determined to demean and insult their hosts.  It was, one might say, a novel approach to diplomacy: “You're pathe…",
    "link": "https://www.memeorandum.com/260123/p12",
    "timestamp": "2026-01-23T12:45:00Z"
  },
  {
    "title": "US-EU ties have taken ‘a big blow’ – Kallas",
    "description": "US-EU relations have “taken a big blow” amid Donald Trump’s insistence on acquiring Greenland, top diplomat Kaja Kallas has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631395-us-eu-ties-blow-kallas/",
    "timestamp": "2026-01-23T12:44:51Z"
  },
  {
    "title": "US residents could be justified in shooting federal agents – Democratic official",
    "description": "Arizona’s top prosecutor claims that state law could justify lethal force against masked ICE agents Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631411-us-democrat-shoot-ice/",
    "timestamp": "2026-01-23T12:41:50Z"
  },
  {
    "title": "More than 5,000 killed in recent protests in Iran, rights group says, as regime rejects Trump claims",
    "description": "Iran's top prosecutor on Friday called U.S. President Donald Trump's repeated claims that he halted the hangings of 800 detained protesters there \"completely false.\" Meanwhile, the overall death toll from a bloody crackdown on nationwide demonstrations rose t…",
    "link": "https://www.cbc.ca/news/world/iran-protests-death-toll-trump-claims-9.7057574",
    "timestamp": "2026-01-23T12:41:07Z"
  },
  {
    "title": "Trump says Greenland framework includes mineral rights. What minerals does the island have?",
    "description": "Donald Trump says a possible deal over Greenland could involve mineral rights.",
    "link": "https://www.bbc.com/news/articles/cly9230yw15o",
    "timestamp": "2026-01-23T12:39:51Z"
  },
  {
    "title": "Militarising the Sahel will not defeat terrorism",
    "description": "Escalating force and rival security blocs are turning counterterrorism into a recipe for conflict.",
    "link": "https://www.aljazeera.com/opinions/2026/1/23/militarising-the-sahel-will-not-defeat-terrorism",
    "timestamp": "2026-01-23T12:39:00Z"
  },
  {
    "title": "US completes withdrawal from World Health Organization",
    "description": "The decision follows President Donald Trump's announcement a year ago.",
    "link": "https://www.weau.com/2026/01/23/us-completes-withdrawal-world-health-organization/",
    "timestamp": "2026-01-23T12:38:53Z"
  },
  {
    "title": "'The ultimate insult': Trump downplaying NATO's Afghanistan involvement causes distress in UK",
    "description": "U.S. President Donald Trump has provoked outrage and distress in the U.K. with his suggestion that troops from NATO countries stayed away from the frontline during the war in Afghanistan",
    "link": "https://abcnews.go.com/International/wireStory/ultimate-insult-trump-downplaying-natos-afghanistan-involvement-causes-129485391",
    "timestamp": "2026-01-23T12:37:47Z"
  },
  {
    "title": "Kash Patel purges more FBI agents hours after volatile Jack Smith hearing: report",
    "description": "Hours after the contentious House Judiciary Committee hearing, where former special counsel Jack Smith testified as Democrats and Republicans battled each other over Donald Trump’s incitement of the Jan. 6 insurrection, FBI Director Kash Patel once again went…",
    "link": "https://www.rawstory.com/patel-agent-purge-jack-smith/",
    "timestamp": "2026-01-23T12:37:37Z"
  },
  {
    "title": "Economic leaders at Davos say global growth is resilient despite disruption from Trump",
    "description": "Leading global economic policymakers at the World Economic Forum in Davos urged countries and businesses to filter out the turmoil from a week of clashes with the Trump administration and focus on boosting growth and fighting inequality in a world wher...",
    "link": "https://abcnews.go.com/Business/wireStory/economic-leaders-davos-global-growth-resilient-despite-disruption-129485660",
    "timestamp": "2026-01-23T12:37:26Z"
  },
  {
    "title": "Donald Trump had a huge bruise on his left hand at the ‘Board of Peace’ event",
    "description": "Embed from Getty Images The photos in this post are from Thursday in Davos. Donald Trump attended an event for the “Board of Peace” for Gaza. Jared Kushner did a big-boy presentation for his “New Gaza” plans, which include putting up skyscraper hotels and cas…",
    "link": "https://www.celebitchy.com/958544/donald_trump_had_a_huge_bruise_on_his_left_hand_at_the_board_of_peace_event/",
    "timestamp": "2026-01-23T12:35:50Z"
  },
  {
    "title": "Qatari 747 Will Fly as Air Force One in Summer 2026",
    "description": "The Qatari-donated Boeing 747-8 is set to fly as “VC-25 bridge aircraft” by summer 2026, as delays continue to plague Boeing’s VC-25B presidential aircraft program. The U.S. Air Force expects the Boeing 747 gifted by the government of Qatar to begin flying as…",
    "link": "https://theaviationist.com/2026/01/23/qatari-747-interim-air-force-one-vc-25-bridge/",
    "timestamp": "2026-01-23T12:35:00Z"
  },
  {
    "title": "Doctor Makes Concerning Claims About Donald Trump’s Cognitive Health, Says Symptoms Are Worsening",
    "description": "Doctor Makes Concerning Claims About Donald Trump’s Cognitive Health, Says Symptoms Are Worseninginquisitr.com",
    "link": "https://www.inquisitr.com/doctor-makes-concerning-claims-about-donald-trumps-cognitive-health-says-symptoms-are-worsening",
    "timestamp": "2026-01-23T12:34:40Z"
  },
  {
    "title": "Greenland galvanizes Europe to confront new US reality",
    "description": "Europe learns to confront U.S. challenges post-Trump, emphasizing unity and strategic independence amid rising geopolitical tensions.",
    "link": "https://www.thehindubusinessline.com/news/world/greenland-galvanizes-europe-to-confront-new-us-reality/article70542539.ece",
    "timestamp": "2026-01-23T12:33:18Z"
  },
  {
    "title": "US Officially Exits World Health Organization",
    "description": "The United States officially left the World Health Organization on Thursday. President Donald Trump began the year-long process on his first day back in office.",
    "link": "https://www.ntd.com/us-officially-exits-world-health-organization_1121292.html",
    "timestamp": "2026-01-23T12:30:37Z"
  },
  {
    "title": "Elon Musk Isn’t an Optimist, He’s a Salesman",
    "description": "At Davos, Musk sold a vision of himsel that doesn't align with reality.",
    "link": "https://gizmodo.com/elon-musk-isnt-an-optimist-hes-a-salesman-2000713014",
    "timestamp": "2026-01-23T12:30:35Z"
  },
  {
    "title": "Jack Smith Defends Investigation Into Trump: Key Takeaways",
    "description": "Former Special Counsel Jack Smith on Thursday testified publicly for the first time in a tense hearing before Congress, defending the two criminal cases he had brought against President Donald Trump. NBC’s Kelly O’Donnell reports for TODAY.",
    "link": "https://www.today.com/video/key-takeaways-from-jack-smith-s-testimony-before-congress-256448581723",
    "timestamp": "2026-01-23T12:27:39Z"
  }
]