[
  {
    "title": "Zelenskyy rallies Trump, European allies in setting red lines for Putin summit",
    "description": "Ukrainian President Volodymyr Zelenskyy met with British Prime Minister Keir Starmer in London on Thursday as he continued diplomatic maneuvers.",
    "link": "https://abcnews.go.com/International/zelenskyy-rallies-trump-european-allies-setting-red-lines/story?id=124637288",
    "timestamp": "2025-08-14T09:11:49Z"
  },
  {
    "title": "House Rep. Anna Paulina Luna details strange UFO experience while serving in the Air Force",
    "description": "“It essentially outperformed them.”",
    "link": "https://nypost.com/2025/08/14/us-news/house-rep-anna-paulina-luna-details-strange-ufo-experience-while-serving-in-the-air-force-to-joe-rogan/",
    "timestamp": "2025-08-14T09:10:26Z"
  },
  {
    "title": "Government data is now in question. Here's where macro investors are turning to fill the gaps",
    "description": "Donald Trump looks down at a phone while visiting the Miami Grand Prix\nClive Mason/Getty Images\nThe firing of the BLS head by President Donald Trump has spooked some macro investors.\nTrump's nomination of a partisan economist may push investors to rely more h…",
    "link": "https://biztoc.com/x/98b8385bdbec1764",
    "timestamp": "2025-08-14T09:05:54Z"
  },
  {
    "title": "Trump-Putin meeting: How much territory does Russia control in Ukraine?",
    "description": "Russia controls about 20 percent of Ukraine’s territory and wants full control of four eastern and southern regions.",
    "link": "https://www.aljazeera.com/news/2025/8/14/trump-putin-meeting-how-much-territory-does-russia-control-in-ukraine",
    "timestamp": "2025-08-14T09:05:51Z"
  },
  {
    "title": "Gavin Newsom Tries Impersonating Trump in ALL CAPS Rants; Threatens Impeachment",
    "description": "California Gov. Gavin Newsom (D) is trying to win a fight over redistricting by impersonating President Donald Trump, posting rants on X in ALL CAPS that are meant to echo posts on Trump's Truth Social.\nThe post Gavin Newsom Tries Impersonating Trump in ALL C…",
    "link": "https://www.breitbart.com/politics/2025/08/14/gavin-newsom-tries-impersonating-trump-in-all-caps-rants-on-x-impeachment/",
    "timestamp": "2025-08-14T09:05:30Z"
  },
  {
    "title": "Bayern Munich and Rwanda: A strategic climbdown?",
    "description": "At first glance, Bayern Munich's decision to end its commercial deal with Rwanda appears a rare moment of football morality. But dig a little deeper and the club's motivations seem not so straightforward.",
    "link": "https://www.dw.com/en/bayern-munich-and-rwanda-a-strategic-climbdown/a-73630410",
    "timestamp": "2025-08-14T09:05:00Z"
  },
  {
    "title": "DEA head says phone calls are coming from ‘all over the country’ from fed agents wanting to help in DC",
    "description": "Drug Enforcement Administration (DEA) head and new overseer of DC police Terry Cole outlined the Trump administration’s “unified effort” for reducing violent crime in the nation’s capital after meeting with the police chief Tuesday. “We cannot afford to turn …",
    "link": "https://freerepublic.com/focus/f-chat/4334503/posts",
    "timestamp": "2025-08-14T09:02:11Z"
  },
  {
    "title": "Republicans pitch Trump’s domestic policy agenda in Iowa, but some entrepreneurs aren’t yet sold",
    "description": "When Small Business Administrator Kelly Loeffler touted that her agency guarantees approximately 2,000 small business loans every week, Laura Pager, a small ...",
    "link": "https://www.cnn.com/2025/08/14/politics/republicans-iowa-trump-agenda-small-businesses",
    "timestamp": "2025-08-14T09:00:42Z"
  },
  {
    "title": "Trump could end the Ukraine war, but a larger threat still looms",
    "description": "The China-Russia alliance has grown since 2019 with joint military exercises, weapons technology sharing and coordinated strategy that could potentially create a two-front crisis risk for America.",
    "link": "https://www.foxnews.com/opinion/trump-could-end-ukraine-war-larger-threat-still-looms",
    "timestamp": "2025-08-14T09:00:40Z"
  },
  {
    "title": "I've worked with 4 presidents — Trump's Putin strategy shows his negotiation genius",
    "description": "Washington elites are already attacking Trump’s planned Putin summit. But his flexible, results-first style may succeed in ending the war in Ukraine where other leaders have failed.",
    "link": "https://www.foxnews.com/opinion/ive-worked-4-presidents-trumps-putin-strategy-shows-negotiation-genius",
    "timestamp": "2025-08-14T09:00:30Z"
  },
  {
    "title": "All about Trump Jr.-linked firm raising $50M to expand into crypto",
    "description": "Thumzup Media to invest $50M into mining as Trump eyes Jerome Powell’s replacement.",
    "link": "https://ambcrypto.com/all-about-trump-jr-linked-firm-raising-50m-to-expand-into-crypto/",
    "timestamp": "2025-08-14T09:00:29Z"
  },
  {
    "title": "The Strange Espionage Case of Sue Mi Terry",
    "description": "How Sue Mi Terry, a high-flying former CIA analyst married to Max Boot, was charged with being an unregistered foreign agent.",
    "link": "http://nymag.com/intelligencer/article/the-strange-espionage-case-of-sue-mi-terry.html",
    "timestamp": "2025-08-14T09:00:26Z"
  },
  {
    "title": "MORNING GLORY: President Trump should go far and fast in reforming the DC police",
    "description": "President Trump gains 30-day authority over the DC police force under Home Rule Act, with power to hire and fire department leadership amid public safety and crime concerns.",
    "link": "https://www.foxnews.com/opinion/morning-glory-president-trump-should-go-far-fast-reforming-dc-police",
    "timestamp": "2025-08-14T09:00:19Z"
  },
  {
    "title": "Former Capitol Police Chief says crime by ‘gangs of youth’ in DC has spiked, escaped ‘certain neighborhoods’",
    "description": "Former Capitol Police Chief Steven Sund warned that the homicide rate in the nation's capital is five to six times higher than other major US cities.",
    "link": "https://www.foxnews.com/media/former-capitol-police-chief-says-crime-gangs-youth-dc-has-spiked-escaped-certain-neighborhoods",
    "timestamp": "2025-08-14T09:00:03Z"
  },
  {
    "title": "When Hospitals Act Like ICE",
    "description": "Liset Cruz\n\n\n\nThese patients needed long-term care. Instead, the hospitals pushed for them to be deported.\r\n\n\r\n\n\nThe post When Hospitals Act Like ICE appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/hospitals-medical-deportation-undocumented-immigration/",
    "timestamp": "2025-08-14T09:00:01Z"
  },
  {
    "title": "Eric Foner’s Personal History",
    "description": "Eric Foner\n\n\n\nReflecting on his decades-long career, the historian considers what his field of study owes to the public.\r\n\n\r\n\n\nThe post Eric Foner’s Personal History appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/eric-foner-our-fragile-freedom-essay/",
    "timestamp": "2025-08-14T09:00:01Z"
  },
  {
    "title": "The Case Against E.J. Antoni",
    "description": "Chris Lehmann\n\n\n\nOpposing his nomination to head the Bureau of Labor Statistics is the one thing the left and right can agree on. \r\n\n\r\n\n\nThe post The Case Against E.J. Antoni appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=566751",
    "timestamp": "2025-08-14T09:00:00Z"
  },
  {
    "title": "I’m a Teenager In Gaza. And I Am Starving.",
    "description": "Lujayn\n\n\n\nWhat hits you first is the exhaustion carved into every face. The sickly pallor. The terrifying weight loss ravaging everyone—yes, including me.\r\n\n\r\n\n\nThe post I’m a Teenager In Gaza. And I Am Starving. appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=566713",
    "timestamp": "2025-08-14T09:00:00Z"
  },
  {
    "title": "What’s Next for Covering Climate Now’s 89 Percent Project",
    "description": "Mark Hertsgaard\n\n\n\nAn overwhelming global majority supports stronger climate action. Who are the people behind the numbers?\r\n\n\r\n\n\nThe post What’s Next for Covering Climate Now’s 89 Percent Project appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=566644",
    "timestamp": "2025-08-14T09:00:00Z"
  },
  {
    "title": "Cassidy to play key role in confirmation of Trump's controversial pick to oversee job numbers",
    "description": "U.S. Sen. Bill Cassidy of Louisiana will once again play a key role in the confirmation of a controversial nominee of President Donald Trump.",
    "link": "https://www.theadvocate.com/baton_rouge/news/cassidy-to-play-key-role-in-antoni-confirmation/article_46ccb8f6-8844-5454-b283-3ac80e7be6b5.html",
    "timestamp": "2025-08-14T09:00:00Z"
  },
  {
    "title": "The Volunteers Fighting Greece’s Intensifying Wildfires",
    "description": "Megan Cameron, Annalisa Jenkins, Maggie Stewart\n\n\n\nAs climate change brings unprecedented levels of heat and drought, the country’s unpaid fire brigades are bracing for the worst in the absence of state support.\r\n\n\r\n\n\nThe post The Volunteers Fighting Greece’s…",
    "link": "https://www.thenation.com/?post_type=article&p=566715",
    "timestamp": "2025-08-14T09:00:00Z"
  },
  {
    "title": "‘Alternative Facts’ Aren’t a Reason To Skip Vaccines",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr.'s decision to defund mRNA research is just the latest to put ideology above public health.",
    "link": "https://kffhealthnews.org/news/article/vaccines-misinformation-rfk-jr-alternative-facts-deadly/",
    "timestamp": "2025-08-14T09:00:00Z"
  },
  {
    "title": "‘A Fear Pandemic’: Immigration Raids Push Patients Into Telehealth",
    "description": "With intensified immigration enforcement in California, community clinics serving Latino and immigrant populations say they’ve noticed an increase in appointment cancellations and telehealth usage. But, as the covid-19 pandemic showed, accessing the necessary…",
    "link": "https://kffhealthnews.org/news/article/immigration-customs-enforcement-raids-fear-california-latino-telehealth/",
    "timestamp": "2025-08-14T09:00:00Z"
  },
  {
    "title": "On eve of Trump–Putin Summit, Russians share hopes — and doubts — for Peace",
    "description": "Russian President Vladimir Putin has praised Donald Trump's \"energetic and sincere\" efforts to end the war in Ukraine. But on the streets of Moscow while many hope for an end to the war, they disagree on how to get there.",
    "link": "https://www.npr.org/2025/08/14/nx-s1-5501519/trump-russia-putin-ukraine-alaska",
    "timestamp": "2025-08-14T08:57:06Z"
  },
  {
    "title": "UK PM hosts Zelensky in London on eve of US-Russia summit",
    "description": "Ukrainian President Volodymyr Zelensky met Thursday in London with UK Prime Minister Keir Starmer in a strong show of support on the eve of a key US-Russia...",
    "link": "https://www.yahoo.com/news/articles/zelensky-london-meet-pm-ahead-064903094.html",
    "timestamp": "2025-08-14T08:56:42Z"
  },
  {
    "title": "Why the Trump-Putin Alaska meeting may not ease tensions between India, US, and Russia",
    "description": "President Trump is set to meet with Vladimir Putin in Alaska, a symbolic location from the Cold War era, primarily to discuss the ongoing conflict in Ukraine. This meeting occurs amidst geopolitical shifts involving India, Russia, and the US, triggered by tar…",
    "link": "https://economictimes.indiatimes.com/news/india/why-the-trump-putin-alaska-meeting-may-not-ease-tensions-between-india-us-and-russia/articleshow/123299806.cms",
    "timestamp": "2025-08-14T08:55:05Z"
  },
  {
    "title": "D.C. Residents Protest As White House Says Federal Agents Will Be On Patrol 24/7",
    "description": "After law enforcement set up a vehicle checkpoint along the 14th Street Northwest corridor, hecklers shouted, \"Go home, fascists.\"",
    "link": "https://www.huffpost.com/entry/dc-residents-protest-federal-intervention_n_689da239e4b0ba345d6638fc",
    "timestamp": "2025-08-14T08:54:27Z"
  },
  {
    "title": "Pro-AUKUS congress members say Albanese must secure Trump sit-down",
    "description": "Members of a visiting delegation of US Congress members from both sides of politics have stressed the importance of a face-to-face meeting between President Donald Trump and Prime Minister Anthony Albanese.",
    "link": "https://www.abc.net.au/news/2025-08-14/albanese-must-secure-sit-down-with-trump/105655724",
    "timestamp": "2025-08-14T08:53:52Z"
  },
  {
    "title": "Bitcoin all-time high surge decoded: What's fueling the rise in cryptocurrency, could it hit $150,000, and what's next?",
    "description": "Bitcoin reached a new record high, surpassing $124,000. Strong US markets and policy changes boosted investor confidence. Regulatory shifts under President Trump encouraged digital asset adoption. Institutional investors like Trump's media group and Tesla inc…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/bitcoin-all-time-high-surge-decoded-whats-fueling-the-rise-in-cryptocurrency-could-it-hit-150000-and-whats-next/articleshow/123300086.cms",
    "timestamp": "2025-08-14T08:53:28Z"
  },
  {
    "title": "Zelensky to meet UK PM in London ahead of Trump-Putin summit",
    "description": "Ukrainian President Volodymyr Zelensky's trip to London comes one day before President Trump and Russian President Vladimir Putin will meet in Alaska.",
    "link": "https://nypost.com/2025/08/14/world-news/ukraines-zelensky-to-meet-uk-pm-in-london-ahead-of-trump-putin-summit/",
    "timestamp": "2025-08-14T08:52:43Z"
  },
  {
    "title": "Video: Russia Says Ukraine Drone Struck Rostov Apartment Building",
    "description": "The governor said more than a dozen people were hurt.",
    "link": "https://www.newsweek.com/russia-drone-rostov-ukraine-war-video-2113333",
    "timestamp": "2025-08-14T08:51:59Z"
  },
  {
    "title": "Former NITI Aayog VC Rajiv Kumar urges lifting curbs on Chinese investments in India",
    "description": "Rajiv Kumar advocates for lifting restrictions on Chinese investments to boost Indian manufacturing and employment, highlighting China's significant role as a global investor. Despite strained relations, India and China are taking steps to improve bilateral t…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/former-niti-aayog-vc-rajiv-kumar-urges-lifting-curbs-on-chinese-investments-in-india/articleshow/123300138.cms",
    "timestamp": "2025-08-14T08:50:20Z"
  },
  {
    "title": "Melania Trump threatens to sue Hunter Biden for $1bn over Epstein comments",
    "description": "Mr Biden, who is the son of former US president Joe Biden, alleged in an interview this month that sex trafficker Epstein introduced the first lady to President Donald Trump.",
    "link": "https://news.sky.com/story/melania-trump-threatens-to-sue-hunter-biden-for-1bn-over-epstein-comments-13411509",
    "timestamp": "2025-08-14T08:44:00Z"
  },
  {
    "title": "Strictly Come Dancing announces Apprentice star Thomas Skinner as tenth contestant for 2025 series",
    "description": "Announcement comes just days after Skinner was pictured with US vice president JD Vance",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/strictly-come-dancing-thomas-skinner-b2807498.html",
    "timestamp": "2025-08-14T08:43:40Z"
  },
  {
    "title": "Russian officials say at least 16 wounded in Ukrainian drone attacks on two cities",
    "description": "MOSCOW (Reuters) -Ukrainian drones struck two Russian cities on Thursday in attacks that injured at least 16 people, local authorities said, a day before a U.S.-Russia summit on the war in Ukraine. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/14/russian-officials-say-at-least-16-wounded-in-ukrainian-drone-attacks-on-two-cities",
    "timestamp": "2025-08-14T08:39:00Z"
  },
  {
    "title": "India's growth trajectory remains unaffected from 'War or No War' outcome of Putin-Trump meeting: CareEdge CEO",
    "description": "Apart from US tariffs, Mehul Pandya, MD and Group CEO of CareEdge Ratings, points out that the revival of private sector capex is a key challenge for the Indian economy",
    "link": "https://www.thehindubusinessline.com/economy/indias-growth-trajectory-remains-unaffected-from-war-or-no-war-outcome-of-putin-trump-meeting-careedge-ceo/article69932082.ece",
    "timestamp": "2025-08-14T08:38:40Z"
  },
  {
    "title": "US futures flat with Alaska summit in focus",
    "description": "Wall Street futures traded flat during premarket hours on Thursday, ahead of highly anticipated meeting between United States President Donald Trump and Russian President Vladimir Putin, which will ta...",
    "link": "https://biztoc.com/x/9fa1311e250c841d",
    "timestamp": "2025-08-14T08:33:06Z"
  },
  {
    "title": "Harsh Pant: India’s White House pushback is necessary but don’t let US ties rupture",
    "description": "While New Delhi cannot afford to give in to Trump’s outlandish demands, we must recognize the value of the India-US relationship. Much has been invested in it and its potential remains high. A Brics tilt would be foolhardy.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-india-us-relations-pakistan-narendra-modi-trade-agreement-china-comcasa-beca-quad-asim-munir-xi-jinping-11755067423487.html",
    "timestamp": "2025-08-14T08:30:11Z"
  },
  {
    "title": "India's growth trajectory remains unaffected from 'War or No War' outcome of Putin-Trump meeting: CareEdge CEO",
    "description": "India’s growth trajectory will remain strong regardless of the outcome of the upcoming Trump-Putin meeting, says Mehul Pandya, MD & Group CEO of CareEdge Ratings. While a resolution to the war could ease tariff pressures—especially on oil—India remains resili…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/indias-growth-trajectory-remains-unaffected-from-war-or-no-war-outcome-of-putin-trump-meeting-careedge-ceo/articleshow/123299697.cms",
    "timestamp": "2025-08-14T08:29:38Z"
  },
  {
    "title": "Thoughts that Unify & Produce Peace—Reflections for 79th India’s Independence Day Celebration",
    "description": "As India celebrates its 79th Independence Day, the article urges embracing positivity and harmony, drawing upon ancient wisdom and the Baháʼi Faith. It explores the human condition, questioning the prevalence of greed and self-centeredness, while emphasizing …",
    "link": "https://timesofindia.indiatimes.com/speaking-tree/daily-ecstasy/thoughts-that-unify-produce-peacereflections-for-79th-indias-independence-day-celebration/articleshow/123299657.cms",
    "timestamp": "2025-08-14T08:28:10Z"
  },
  {
    "title": "India among fastest growing economies, doesn't matter what Trump says: JSW Group chairman Sajjan Jindal",
    "description": "JSW Group chairman Sajjan Jindal refuted Donald Trump's remarks about India's economy, emphasizing its rapid growth and potential. He highlighted India's position as the fastest-growing large economy globally, dismissing Trump's negative assessment. JSW Cemen…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/cement/india-among-fastest-growing-economies-doesnt-matter-what-trump-says-jsw-group-chairman-sajjan-jindal/articleshow/123299569.cms",
    "timestamp": "2025-08-14T08:22:26Z"
  },
  {
    "title": "How Arctic Could Form Key Part of Ukraine Ceasefire Talks",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA ceasefire in Ukraine will be the focus for Presidents Vladimir Putin and Donald Trump when they meet in Alaska, but cooperation between Russia and the United States in the Arctic would also be a salient topi…",
    "link": "https://biztoc.com/x/11edbbe11630b061",
    "timestamp": "2025-08-14T08:11:10Z"
  },
  {
    "title": "Forget tequila, cellphone plans are the hot way for celebrities to capitalize on their fame",
    "description": "Everybody wants to be Ryan Reynolds. Donald Trump wants to be Ryan Reynolds. The \"SmartLess\" podcast guys want to be Ryan Reynolds. Even Klarna wants to be Ryan Reynolds. I don't mean they want to star in \"Deadpool\" or marry Blake Lively (though neither of th…",
    "link": "https://biztoc.com/x/662d7cf271c7737d",
    "timestamp": "2025-08-14T08:10:51Z"
  },
  {
    "title": "Is Putin Ready to Make a Ukraine Peace Deal?",
    "description": "In the 1980s, Mikhail Gorbachev and Ronald Reagan held a series of momentous summits that set the stage for the end of the Cold War. Vladimir Putin’s upcoming meeting with Donald Trump in Alaska can prove similarly historic, but only if Putin accepts that esc…",
    "link": "https://www.project-syndicate.org/commentary/putin-motivated-to-make-ukraine-peace-deal-with-trump-in-alaska-by-nina-l-khrushcheva-2025-08",
    "timestamp": "2025-08-14T08:10:25Z"
  },
  {
    "title": "Starmer hosts Ukraine’s Zelenskyy ahead of high-stakes Trump-Putin meeting",
    "description": "The UK is ready to ‘increase pressure’ on Russia over its continuing war on Ukraine, says Prime Minister Keir Starmer.",
    "link": "https://www.aljazeera.com/news/2025/8/14/starmer-hosts-zelenskyy-ahead-of-high-stakes-trump-putin-meeting",
    "timestamp": "2025-08-14T08:08:53Z"
  },
  {
    "title": "Now Fallon Is Using Taylor Swift To Suggest Trump Had Sinister Ties To Epstein",
    "description": "The \"Tonight Show\" leaned on his comic license to bait the president again on sexual matters.",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-taylor-swift-22-donald-trump-epstein_n_689d86d7e4b0185e8848af97",
    "timestamp": "2025-08-14T08:07:44Z"
  },
  {
    "title": "Bolsonaro's lawyers call for acquittal in alleged coup trial",
    "description": "BRASILIA: Defence lawyers for former president Jair Bolsonaro asked Brazil's Supreme Court for an acquittal during Wednesday's (Aug 13) closing arguments in a trial in which he is accused of attempting a coup. Bolsonaro's lawyers argued in a 197-page document…",
    "link": "https://www.channelnewsasia.com/world/former-brazil-president-jair-bolsonaro-lawyers-call-aquittal-coup-trial-5294196",
    "timestamp": "2025-08-14T08:07:20Z"
  },
  {
    "title": "Failed GOP candidate gets 80-year sentence for politically motivated shooting plot",
    "description": "Solomon Peña wanted to terrorize people with different political views, say prosecutors",
    "link": "https://www.the-independent.com/news/world/americas/crime/solomon-pena-shooting-sentence-albuquerque-b2807459.html",
    "timestamp": "2025-08-14T08:06:54Z"
  },
  {
    "title": "India scours the globe for more oil ahead of Trump-Putin summit",
    "description": "India's refiners are diversifying crude oil sources amid potential US pressure to curb Russian imports, spurred by President Trump's demands and tariff hikes. State processors are actively purchasing non-Russian crude from various global markets for September…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-scours-the-globe-for-more-oil-ahead-of-trump-putin-summit/articleshow/123299305.cms",
    "timestamp": "2025-08-14T08:05:20Z"
  },
  {
    "title": "More student-loan borrowers are falling behind on payments — and their paychecks are at risk",
    "description": "Borrowers in default should know about three options to return to good standing, along with Trump's repayment plan overhaul.",
    "link": "https://www.businessinsider.com/student-loan-borrowers-wage-garnishment-paychecks-at-risk-default-collections-2025-8",
    "timestamp": "2025-08-14T08:05:02Z"
  },
  {
    "title": "Oil price structure narrows, premiums fall as supplies rise, summer demand ends",
    "description": "SINGAPORE/HOUSTON/LONDON (Reuters) -Premiums for prompt benchmark oil prices globally are falling compared with those in future months on rising output from ...",
    "link": "https://finance.yahoo.com/news/oil-price-structure-narrows-premiums-080426988.html",
    "timestamp": "2025-08-14T08:04:26Z"
  },
  {
    "title": "Forget tequila, cellphone plans are the hot way for celebrities to capitalize on their fame",
    "description": "",
    "link": "https://www.businessinsider.com/new-celebrity-side-hustle-cellphone-plans-smartless-trump-ryan-reynolds-2025-8",
    "timestamp": "2025-08-14T08:02:01Z"
  },
  {
    "title": "Las Vegas is hurting as tourism drops. Are Canadians behind the Sin City slump?",
    "description": "After doing gangbuster business in the post-COVID era, Las Vegas is in the midst of a slump, with the number of tourists down sharply as Canadians in particular avoid Sin City amid bilateral bad blood over trade.",
    "link": "https://www.cbc.ca/news/world/las-vegas-tourism-canadian-slump-1.7607707",
    "timestamp": "2025-08-14T08:00:27Z"
  },
  {
    "title": "How Arctic Could Form Key Part of Ukraine Ceasefire Talks",
    "description": "An arctic expert told Newsweek that Russian and U.S. interests in oil, gas, shipping and fishing could be talking points in Alaska.",
    "link": "https://www.newsweek.com/ukraine-talks-arctic-trump-putin-2112843",
    "timestamp": "2025-08-14T08:00:02Z"
  },
  {
    "title": "Canada's national parks are free for everyone this summer. Should they be?",
    "description": "Free admission to Canada's national parks this summer has helped draw visitors to the country's most popular parks, fuelling traffic jams and raising environmental concerns.",
    "link": "https://www.cbc.ca/news/business/free-national-parks-canada-1.7607702",
    "timestamp": "2025-08-14T08:00:00Z"
  },
  {
    "title": "Trump signs order to ease commercial spaceflight regulations",
    "description": "US News: US President Donald Trump signed an executive order on Wednesday that he claimed would ease regulations that govern commercial rocket launches.The ord.",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-signs-order-to-ease-commercial-spaceflight-regulations/articleshow/123299107.cms",
    "timestamp": "2025-08-14T07:59:55Z"
  },
  {
    "title": "CNBC Daily Open: Trump says tariffs haven't caused inflation — economists think they will soon",
    "description": "Don't mess with DJ D-Sol — Goldman Sachs CEO David Solomon's stage name when he's rocking the clubs in his other life as a DJ.\nU.S. President Donald Trump criticized Goldman on Tuesday for predicting that tariffs would push up inflation, and said Solomon \"sho…",
    "link": "https://biztoc.com/x/bb2c4eebdd79f3ce",
    "timestamp": "2025-08-14T07:59:49Z"
  },
  {
    "title": "Trump orders space regulations eased in win for Musk",
    "description": "US President Donald Trump signed an executive order Wednesday easing regulations for the private space industry, including eliminating some environmental reviews, in a move likely to please his erstwhile advisor Elon Musk.",
    "link": "https://phys.org/news/2025-08-trump-space-eased-musk.html",
    "timestamp": "2025-08-14T07:51:42Z"
  },
  {
    "title": "Lucas: Foley goes to bat for Bay State, AG should too",
    "description": "Heads up: there’s a new “sheriff” in town. But she's no rookie. She is U.S. Attorney Leah Foley and she is doing the job that Attorney General Andrea Campbell won’t do.",
    "link": "https://www.bostonherald.com/2025/08/14/lucas-foley-goes-to-bat-for-bay-state-ag-should-too/",
    "timestamp": "2025-08-14T07:51:37Z"
  },
  {
    "title": "Congress President: We stand ready to work with de-occupied Ukrainian territories after a peace agreement",
    "description": "Ahead of the Alaska meeting between US President Donald Trump and Russian President Vladimir Putin, the President of the Congress of Local and Regional Authorities of the Council of Europe, Marc Cools, has made the following statement on behalf of the Congres…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250813-coe01.htm",
    "timestamp": "2025-08-14T07:47:57Z"
  },
  {
    "title": "China-US-Pakistan: Why questions need to be asked about India’s diplomacy",
    "description": "Modi’s  151 foreign visits to 72 countries, including 10 to the US, in the last 11 years,  have certainly improved bilateral ties with some of those countries. However, many foreign policy-related challenges remain unsettled",
    "link": "https://indianexpress.com/article/opinion/columns/china-us-pakistan-why-questions-need-to-be-asked-about-indias-diplomacy-10188629/",
    "timestamp": "2025-08-14T07:47:56Z"
  },
  {
    "title": "Trump Hints at Quick Second Meeting With Putin If First Goes Well",
    "description": "US President Donald Trump told reporters on Wednesday that there is a good chance of a prompt second meeting with Russian President Vladimir Putin if the first one \"goes okay.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250813-sputnik01.htm",
    "timestamp": "2025-08-14T07:47:24Z"
  },
  {
    "title": "Summit with Putin: Litmus test for Trump’s deal-making caliber",
    "description": "WASHINGTON, Aug. 14: Among the constants in Donald Trump’s turbulent career have been a flair for drama and a belief […]\nThe post Summit with Putin: Litmus test for Trump’s deal-making caliber appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/14/summit-with-putin-litmus-test-for-trumps-deal-making-caliber/",
    "timestamp": "2025-08-14T07:45:00Z"
  },
  {
    "title": "Ukraine Deploys Azov Battalion Reserves to Krasnoarmeysk Ahead of US-Russia Summit",
    "description": "The Ukrainian armed forces are transferring reserves to the Krasnoarmeysk direction, including a unit of the ultranationalist Azov* battalion ahead of the Russia-US summit in Alaska, head of the Donetsk People's Republic (DPR) Denis Pushilin said on Wednesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250813-sputnik04.htm",
    "timestamp": "2025-08-14T07:43:37Z"
  },
  {
    "title": "FBI agents are again pulled from their day jobs to address a Trump priority | CNN Politics",
    "description": "FBI agents – thrust into yet another role for which they are not trained – have been put on patrol duties with local police as part of President Donald Trump’s declaration of a crime emergency in Washington, DC.",
    "link": "https://www.cnn.com/2025/08/14/politics/fbi-washington-immigration-epstein",
    "timestamp": "2025-08-14T07:43:26Z"
  },
  {
    "title": "'Nominate Trump for Nobel Twice': Former US NSA John Bolton offers India a sarcastic fix to end trade dispute",
    "description": "John Bolton has criticised Donald Trump's India policy, particularly the steep tariffs imposed on New Delhi, deeming them a \"mistake.\" He suggested Modi could humorously nominate Trump for the Nobel Peace Prize twice, referencing Pakistan's similar approach. …",
    "link": "https://economictimes.indiatimes.com/news/india/nominate-trump-for-nobel-twice-former-us-nsa-john-bolton-offers-india-a-sarcastic-fix-to-end-trade-dispute/articleshow/123298546.cms",
    "timestamp": "2025-08-14T07:43:14Z"
  },
  {
    "title": "Ukraine Open to Territory Talks With 'Contact Line' as Starting Point — Merz",
    "description": "Ukraine is ready for negotiations on territorial issues, and the so-called \"contact line\" should become the starting point, German Chancellor Friedrich Merz said on Wednesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250813-sputnik02.htm",
    "timestamp": "2025-08-14T07:41:36Z"
  },
  {
    "title": "CNN's Honig: 'Cannot Deny' D.C. 'Is Dangerous', What Trump's Doing Is Common Tactic That's Usually Universally Praised",
    "description": "CNN Senior Legal Analyst Elie Honig admits that \"It is dangerous\" in Washington, D.C., even if the crime rate is improving, and \"You cannot deny that.\"\nThe post CNN’s Honig: ‘Cannot Deny’ D.C. ‘Is Dangerous’, What Trump’s Doing Is Common Tactic That’s Usually…",
    "link": "https://www.breitbart.com/clips/2025/08/14/cnns-honig-cannot-deny-d-c-is-dangerous-what-trumps-doing-is-common-tactic-thats-usually-universally-praised/",
    "timestamp": "2025-08-14T07:40:50Z"
  },
  {
    "title": "Israeli military says approved plan for new Gaza offensive",
    "description": "Jerusalem (AFP) Aug 13, 2025\n\n\n />\nThe Israeli military said on Wednesday that it had approved the framework for a new offensive in the Gaza Strip, as Hamas condemned what it called \"aggressive\" Israeli ground incursions in Gaza City. \n\nThe approved plan for …",
    "link": "https://www.spacewar.com/reports/Israeli_military_says_approved_plan_for_new_Gaza_offensive_999.html",
    "timestamp": "2025-08-14T07:40:46Z"
  },
  {
    "title": "Another baked Alaska -- Trump and Putin",
    "description": "Washington DC (UPI) Aug 13, 2025 \n\n\n Presidents Donald Trump and Vladimir Putin will hold an Alaskan summit over Ukraine on Friday. \n The last U.S. summit held in Anchorage was between U.S. Secretary of State Antony Blinken and Chinese Foreign Minister Wang Y…",
    "link": "https://www.spacewar.com/reports/Another_baked_Alaska_Trump_and_Putin_999.html",
    "timestamp": "2025-08-14T07:40:46Z"
  },
  {
    "title": "Trump orders space regulations eased in win for Musk",
    "description": "Washington (AFP) Aug 14, 2025\n\n\n />\nUS President Donald Trump signed an executive order Wednesday easing regulations for the private space industry, including eliminating some environmental reviews, in a move likely to please his erstwhile advisor Elon Musk. …",
    "link": "https://www.spacedaily.com/reports/Trump_orders_space_regulations_eased_in_win_for_Musk_999.html",
    "timestamp": "2025-08-14T07:40:46Z"
  },
  {
    "title": "Hillbilly Elegy director Ron Howard says he’s ‘surprised’ by JD Vance controversy",
    "description": "’The strategy he’s chosen to follow are not what I would’ve expected,’ filmmaker who unleashed Trump’s vice president upon the world said",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/jd-vance-trump-hillbilly-elegy-ron-howard-b2807432.html",
    "timestamp": "2025-08-14T07:37:10Z"
  },
  {
    "title": "Israel in talks with South Sudan to forcibly transfer Palestinians from Gaza: Report",
    "description": "Israel is reportedly negotiating with the war-torn South Sudan to forcibly transfer Palestinians from Gaza, advancing its mass expulsion agenda as Gaza lies in ruins after months of bombardment.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/08/mil-250813-presstv13.htm",
    "timestamp": "2025-08-14T07:35:59Z"
  },
  {
    "title": "India Scours the Globe for More Oil Ahead of Trump-Putin Summit",
    "description": "Refiners in India, the world’s top importer of seaborne Russian crude, are scouring the globe for alternative supplies, hedging their bets ahead of a summit between the US and Russian leaders.",
    "link": "https://financialpost.com/pmn/business-pmn/india-scours-the-globe-for-more-oil-ahead-of-trump-putin-summit",
    "timestamp": "2025-08-14T07:33:18Z"
  },
  {
    "title": "Ukraine's Zelenskiy to meet UK PM in London ahead of Trump-Putin summit",
    "description": "Trump has threatened \"severe consequences\" if Putin does not agree to peace in Ukraine and while he did not specify what the consequences could be, he has warned of economic sanctions if his meeting on Friday proves fruitless",
    "link": "https://www.thehindubusinessline.com/news/world/ukraines-zelenskiy-to-meet-uk-pm-in-london-ahead-of-trump-putin-summit/article69931971.ece",
    "timestamp": "2025-08-14T07:32:56Z"
  },
  {
    "title": "UNRWA chief: Israel killed or wounded over 40,000 children in Gaza",
    "description": "The head of the UN Relief and Works Agency for Palestinian Refugees (UNRWA) says more than 40,000 children have either been killed or injured following Israel's genocidal war and an all-out blockade of Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/08/mil-250813-presstv06.htm",
    "timestamp": "2025-08-14T07:30:39Z"
  },
  {
    "title": "Nvidia Partner Hon Hai Sees AI Server Sales More Than Doubling",
    "description": "Hon Hai Precision Industry Co. posted a better-than-projected 27% rise in profit over the June quarter and projected accelerating sales growth from its key AI server business.",
    "link": "https://www.livemint.com/companies/news/nvidia-partner-hon-hai-sees-ai-server-sales-more-than-doubling-11755156476809.html",
    "timestamp": "2025-08-14T07:27:56Z"
  },
  {
    "title": "Ukraine's Zelenskiy to meet UK PM in London ahead of Trump-Putin summit",
    "description": "LONDON (Reuters) -Ukrainian President Volodymyr Zelenskiy is due in London to meet British Prime Minister Keir Starmer on Thursday, to take stock ahead of U.S. President Donald Trump's key talks with Russian President Vladimir Putin in Alaska on Friday. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/08/14/ukraine039s-zelenskiy-to-meet-uk-pm-in-london-ahead-of-trump-putin-summit",
    "timestamp": "2025-08-14T07:25:00Z"
  },
  {
    "title": "Sydney Sweeney controversial American Eagle jeans ad has a Republican vs Democrat divide",
    "description": "Sydney Sweeney's American Eagle jeans ad has triggered a debate. A poll reveals partisan and gender splits in reactions. Democrats find the ad out of touch. Republicans view it as authentic. Many women are less likely to buy the jeans. A small percentage see …",
    "link": "https://economictimes.indiatimes.com/news/international/us/sydney-sweeney-controversial-american-eagle-jeans-ad-has-a-republican-vs-democrat-divide/articleshow/123298400.cms",
    "timestamp": "2025-08-14T07:21:39Z"
  },
  {
    "title": "Those loud smacking and slurping sounds you heard? That was the entire White House press corps clamoring to kiss Cheetolini's saggy ass [Fail]",
    "description": "Those loud smacking and slurping sounds you heard? That was the entire White House press corps clamoring to kiss Cheetolini's saggy ass",
    "link": "https://www.fark.com/comments/13775482/Those-loud-smacking-slurping-sounds-you-heard-That-was-entire-White-House-press-corps-clamoring-to-kiss-Cheetolinis-saggy-ass",
    "timestamp": "2025-08-14T07:20:00Z"
  },
  {
    "title": "Oil & Gas Market Size to Surpass USD 8.79 Trillion by 2034",
    "description": "According to Towards Chemical and Materials, the global Oil & Gas market size was estimated at USD 6.10 Trillion in 2024 and is expected to surpass around USD 8.79 Trillion by 2034, growing at a compound annual growth rate (CAGR) of 3.72% over the forecast pe…",
    "link": "https://www.globenewswire.com/news-release/2025/08/14/3133185/0/en/Oil-Gas-Market-Size-to-Surpass-USD-8-79-Trillion-by-2034.html",
    "timestamp": "2025-08-14T07:18:00Z"
  },
  {
    "title": "Trump’s 50% tariff threatens India’s manufacturing ambitions",
    "description": "India’s largest shoemaker Farida Group had already staked out the land — a 150-acre plot in southern Tamil Nadu — for a sprawling new export facility. Then came the blow from Washington: President Donald Trump announced he was doubling tariffs on Indian expor…",
    "link": "https://biztoc.com/x/30718302826cf140",
    "timestamp": "2025-08-14T07:15:15Z"
  },
  {
    "title": "12 Hot Picks! HTX Crypto Gem Hunt (12th Anniversary Special Edition): Discover Premium Assets and Wealth Opportunities for the Next Crypto Cycle",
    "description": "PANAMA CITY, Aug. 14, 2025 (GLOBE NEWSWIRE) -- HTX, a leading global crypto exchange, is celebrating its 12th anniversary with a landmark initiative, the Crypto Gem Hunt: Special Edition. As the crypto market enters a new value discovery cycle in 2025—driven …",
    "link": "https://www.globenewswire.com/news-release/2025/08/14/3133184/0/en/12-Hot-Picks-HTX-Crypto-Gem-Hunt-12th-Anniversary-Special-Edition-Discover-Premium-Assets-and-Wealth-Opportunities-for-the-Next-Crypto-Cycle.html",
    "timestamp": "2025-08-14T07:14:00Z"
  },
  {
    "title": "Private credit is a booming business. Where one pro sees risks and opportunities now.",
    "description": "Brad Marshall, global head of private credit strategies at Blackstone, says he owes his family and career to this asset class. How he manages default risk.",
    "link": "https://www.livemint.com/companies/private-credit-is-a-booming-business-where-one-pro-sees-risks-and-opportunities-now-11755155108364.html",
    "timestamp": "2025-08-14T07:08:47Z"
  },
  {
    "title": "US’ Independence Day wish for Pakistan may have a hidden message for India",
    "description": "The US extended Independence Day greetings to Pakistan, appreciating its counterterrorism and trade cooperation, while eyeing new economic ties in minerals and hydrocarbons. Pakistan Army Chief Asim Munir has leveraged diplomacy and mineral wealth to regain U…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-independence-day-wish-for-pakistan-may-have-a-hidden-message-for-india/articleshow/123298060.cms",
    "timestamp": "2025-08-14T07:08:27Z"
  },
  {
    "title": "Why does the US keep doling out secondary sanctions?",
    "description": "Will Donald Trump's threat to use secondary sanctions slow Russian aggression or dampen its economy? Some see them as a powerful deterrent, while others think they are impossible to effectively enforce. After Russia launched a full-scale invasion of Ukraine i…",
    "link": "https://www.dw.com/en/what-are-us-secondary-sanctions-and-how-do-they-work/a-73599628",
    "timestamp": "2025-08-14T07:07:00Z"
  },
  {
    "title": "DC residents protest as White House says federal agents will be on patrol 24/7",
    "description": "The action intensified a few days after President Donald Trump’s unprecedented announcement that his administration would take over the city’s police department for at least a month.",
    "link": "https://nypost.com/2025/08/14/us-news/washington-dc-residents-protest-white-house-on-trump-federal-agents-deployment/",
    "timestamp": "2025-08-14T07:05:51Z"
  }
]