[
  {
    "title": "Venezuelan Workers at Disney Put on Leave After Losing Protective Status",
    "description": "ORLANDO, Fla. (AP) — Almost four dozen Venezuelan workers who had temporary protected status have been put on leave by Disney after the U.S. Supreme Court allowed the Trump administration to strip them of legal protections. The move was made …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/05/27/825133.htm",
    "timestamp": "2025-05-27T13:07:55Z"
  },
  {
    "title": "Drone war, ground offensive continue despite new Russia-Ukraine peace push",
    "description": "Tit-for-tat drone attacks as Russia blames Ukraine and Europe for efforts to disrupt diplomacy.",
    "link": "https://www.aljazeera.com/news/2025/5/27/drone-war-ground-offensive-continue-despite-new-russia-ukraine-peace-push",
    "timestamp": "2025-05-27T13:04:30Z"
  },
  {
    "title": "Banking restrictions? Trump to sanction Russia this week as Putin continues to attack Ukraine",
    "description": "Donald Trump may soon announce new sanctions against Russia. This action follows increased Russian attacks on Ukraine and stalled peace talks. The sanctions might exclude banking restrictions. The US Senate is also pushing for more sanctions and tariffs on co…",
    "link": "https://economictimes.indiatimes.com/news/international/us/banking-restrictions-trump-to-sanction-russia-this-week-as-putin-continues-to-attack-ukraine-donald-trump-news-russia-ukraine-news/articleshow/121438846.cms",
    "timestamp": "2025-05-27T13:04:07Z"
  },
  {
    "title": "U.S. stocks rally on President Trump’s tariff reprieve",
    "description": "U.S. stocks jumped Tuesday as traders returned from the Memorial Day break, buoyed by easing tensions after President Donald Trump…\nThe post U.S. stocks rally on President Trump’s tariff reprieve appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/05/27/u-s-stocks-rally-on-president-trumps-tariff-reprieve/",
    "timestamp": "2025-05-27T13:02:57Z"
  },
  {
    "title": "Tommy Robinson Released from Prison But Faces Fresh Charges That May Send Him Back",
    "description": "English activist and citizen journalist Tommy Robinson was released from prison on Tuesday, but faces a potential return to incarceration after fresh criminal charges were levied against him this month.\nThe post Tommy Robinson Released from Prison But Faces F…",
    "link": "https://www.breitbart.com/europe/2025/05/27/tommy-robinson-released-from-prison-but-faces-fresh-charges/",
    "timestamp": "2025-05-27T13:02:47Z"
  },
  {
    "title": "Joe Biden was begged by his son Hunter to ‘take a nap’ during his busy trip to Ireland in 2023",
    "description": "‘You know you can’t handle all this,’ the book reports Hunter as telling the US president in Dublin.",
    "link": "https://www.thejournal.ie/joe-biden-health-book-ireland-6715944-May2025/",
    "timestamp": "2025-05-27T13:00:52Z"
  },
  {
    "title": "Battle over Space Command HQ location heats up as lawmakers press new Air Force secretary",
    "description": "Space Command headquarters' future is uncertain as Alabama and Colorado lawmakers debate its location, impacting military readiness and financial costs.",
    "link": "https://www.foxnews.com/politics/battle-over-space-command-hq-heats-up-lawmakers-press-new-air-force-secretary",
    "timestamp": "2025-05-27T13:00:09Z"
  },
  {
    "title": "Don't Use",
    "description": "Rep. Marjorie Taylor Greene (R-Ga.) has learned why you should never come for a Black woman. On Monday, Greene posted her workout routine on X following a scathing insult from Rep. Jasmine Crockett (D-Texas), who simply returned the favor after Greene attacke…",
    "link": "https://www.theroot.com/dont-use-1851499585",
    "timestamp": "2025-05-27T13:00:00Z"
  },
  {
    "title": "How lower China tariffs will affect direct-to-consumer imports",
    "description": "Temporarily reduced duties likely won't be enough to stop ongoing shifts among de minimis-reliant supply chains, experts said.",
    "link": "https://www.supplychaindive.com/news/china-tariffs-lowered-de-minimis-shipping-impact/748225/",
    "timestamp": "2025-05-27T13:00:00Z"
  },
  {
    "title": "Family ordeal highlights importance of Habeas Corpus in immigration cases",
    "description": "As the Trump administration considers abandoning constitutional protection for immigrants without legal status, a San Diego immigration lawyer used it to free her client.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/05/27/family-ordeal-highlights-importance-of-habeas-corpus-in-immigration-cases",
    "timestamp": "2025-05-27T13:00:00Z"
  },
  {
    "title": "No, Pope Leo XIV did not say, 'You cannot follow both Christ and the cruelty of kings'",
    "description": "Pope Leo XIV said, \"You cannot follow both Christ and the cruelty of kings. A leader who mocks the weak, exalts himself, and preys on the innocent is not sent by God. He is sent to test you. And many are failing.\"",
    "link": "https://www.snopes.com//fact-check/pope-leo-christ-kings-quote/",
    "timestamp": "2025-05-27T13:00:00Z"
  },
  {
    "title": "White House Cocaine, J6 Pipe Bomber and Dobbs Leak: FBI Reviewing Three Unsolved Biden-Era Cases",
    "description": "DAILY CALLER NEWS FOUNDATION—FBI Deputy Director Dan Bongino said his agency is reviewing three “cases of potential public corruption” that went unsolved by the Biden... Read More\nThe post White House Cocaine, J6 Pipe Bomber and Dobbs Leak: FBI Reviewing Thre…",
    "link": "https://www.dailysignal.com/2025/05/27/white-house-cocaine-j6-pipe-bomber-and-dobbs-leak-fbi-reviewing-three-unsolved-biden-era-cases/",
    "timestamp": "2025-05-27T13:00:00Z"
  },
  {
    "title": "As Putin’s Russia brutally hammers Ukraine, Trump confronts put-up-or-shut-up test",
    "description": "Donald Trump said he's \"not happy\" with Russia's Vladimir Putin, but he's said this before — and the rhetoric usually amounts to nothing.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/putins-russia-brutally-hammers-ukraine-trump-confronts-put-shut-test-rcna209162",
    "timestamp": "2025-05-27T12:59:39Z"
  },
  {
    "title": "Russian 'doomsday professor' says UK 'should be nuked off the map' in chilling threat",
    "description": "A Russian man known as a 'doomsday professor' has claimed that the UK could be wiped off the map if they continue to support Ukraine",
    "link": "https://www.ladbible.com/news/world-news/russia-ukraine-uk-putin-trump-doomsday-nuclear-748127-20250527",
    "timestamp": "2025-05-27T12:59:19Z"
  },
  {
    "title": "More bad news for people looking for a job",
    "description": "Companies are taking much longer to fill their open roles, and there's one big reason why.",
    "link": "https://www.businessinsider.com/job-market-bad-interviews-tech-white-collar-rejection-economic-uncertainty-2025-5",
    "timestamp": "2025-05-27T12:58:58Z"
  },
  {
    "title": "NPR sues Trump over executive order cutting federal funding",
    "description": "National Public Radio sued President Donald Trump over his executive order to cease all federal funding for the nonprofit broadcaster.",
    "link": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
    "timestamp": "2025-05-27T12:57:37Z"
  },
  {
    "title": "Trump may unveil new Russia sanctions in coming days",
    "description": "United States President Donald Trump could introduce a new set of sanctions against Russia in the coming days, CNN reported on Tuesday.According to the channel's White House correspondent Kevin Liptak...",
    "link": "https://biztoc.com/x/fe01d57fe1586937",
    "timestamp": "2025-05-27T12:55:18Z"
  },
  {
    "title": "Trump’s War With The Media: NPR Sues Trump",
    "description": "Trump signed an executive order May 1 to revoke federal funding for NPR and PBS.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/27/trumps-war-with-the-media-npr-sues-trump/",
    "timestamp": "2025-05-27T12:55:06Z"
  },
  {
    "title": "NPR And Colorado Public Radio Stations Sue Donald Trump Over Order To Cease Federal Funding",
    "description": "NPR and three Colorado public radio entities filed suit against Donald Trump and other administration officials today over the president’s executive order to cease federal funding for the media outlets. “The Executive Order is a clear violation of the Constit…",
    "link": "http://deadline.com/2025/05/npr-trump-lawsuit-1236411484/",
    "timestamp": "2025-05-27T12:54:42Z"
  },
  {
    "title": "JUST IN: NPR, Public Radio Stations Sue Trump Over Defunding: ‘This Wolf Comes as a Wolf’",
    "description": "NPR and three Colorado public radio stations filed suit against President Donald Trump over an executive order taking away public funds for NPR and PBS.\nThe post JUST IN: NPR, Public Radio Stations Sue Trump Over Defunding: ‘This Wolf Comes as a Wolf’ first a…",
    "link": "https://www.mediaite.com/media/news/just-in-npr-public-radio-stations-sue-trump-over-defunding-this-wolf-comes-as-a-wolf/",
    "timestamp": "2025-05-27T12:52:37Z"
  },
  {
    "title": "Democrat’s AI Campaign Ad Mocks GOP Rival for Taking Policy ‘Prompts’ From Trump: ‘As Fake as I Am!’",
    "description": "Varet's AI-generated avatars accused Rep. Kim of following policy \"prompts\" dictated Trump and corporate interests in a mocking tech-savvy ad.\nThe post Democrat’s AI Campaign Ad Mocks GOP Rival for Taking Policy ‘Prompts’ From Trump: ‘As Fake as I Am!’ first …",
    "link": "https://www.mediaite.com/media/news/democrats-ai-campaign-ad-mocks-gop-rival-for-taking-policy-prompts-from-trump-as-fake-as-i-am/",
    "timestamp": "2025-05-27T12:50:41Z"
  },
  {
    "title": "Russia requests UN meeting on ‘threats’ by Ukraine’s backers",
    "description": "German Chancellor Friedrich Merz earlier said Kiev is not bound by range restrictions on weapons supplied to the country Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618210-russia-requests-un-meeting-ukraine/",
    "timestamp": "2025-05-27T12:49:14Z"
  },
  {
    "title": "Europeans are concerned that the US will withdraw support from NATO. They are right to worry − Americans should, too",
    "description": "The Trump administration has signaled that its support for NATO countries might not be absolute. This worries European observers, who have long looked to the US for military leadership.",
    "link": "https://theconversation.com/europeans-are-concerned-that-the-us-will-withdraw-support-from-nato-they-are-right-to-worry-americans-should-too-253907",
    "timestamp": "2025-05-27T12:47:25Z"
  },
  {
    "title": "NATO chief fears Trump-Zelensky conflict could derail summit – NYT",
    "description": "Mark Rutte reportedly wants upcoming NATO summit to be short to avoid discord over continued Ukraine support Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618213-nato-summit-trump-zelensky/",
    "timestamp": "2025-05-27T12:46:13Z"
  },
  {
    "title": "Fox’s Lawrence Jones: Putin ‘Slapped’ Trump Over Failed Ceasefire Talks",
    "description": "President Donald Trump is \"extremely angry\" with Russian President Vladimir Putin, according to Fox & Friends' Lawrence Jones.\nThe post Fox’s Lawrence Jones: Putin ‘Slapped’ Trump Over Failed Ceasefire Talks first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/foxs-lawrence-jones-putin-slapped-trump-over-failed-ceasefire-talks/",
    "timestamp": "2025-05-27T12:45:47Z"
  },
  {
    "title": "Trump administration moves to cut rest of Harvard contracts with federal government",
    "description": "President Donald Trump in a social media post suggested taking $3 billion in frozen grant money to Harvard and and give it to trade schools.",
    "link": "https://biztoc.com/x/1cd47a336650be97",
    "timestamp": "2025-05-27T12:44:10Z"
  },
  {
    "title": "Cathie Wood Sold These Nuclear Stocks As Trump's Executive Orders Sent The Sector Soaring",
    "description": "President Donald Trump signed executive orders on Friday to support the nuclear industry.\nThe post Cathie Wood Sold These Nuclear Stocks As Trump's Executive Orders Sent The Sector Soaring appeared first on Investor's Business Daily.",
    "link": "https://biztoc.com/x/2941b67a3815c833",
    "timestamp": "2025-05-27T12:43:59Z"
  },
  {
    "title": "Stocks set to surge after Trump resets E.U. tariff deadline",
    "description": "Stocks were poised for large gains after President Donald Trump said he was resetting a deadline for imposing tariffs on the European Union.",
    "link": "https://biztoc.com/x/c678d576d608c6a2",
    "timestamp": "2025-05-27T12:43:58Z"
  },
  {
    "title": "King Charles To Back Canada Amid Trump's Annexation Threats: Live Updates",
    "description": "King Charles III will open the Canadian Parliament on Tuesday in a historic ceremony, amid President Donald Trump's repeatedly threats to annex its neighbor.",
    "link": "https://www.newsweek.com/king-charles-back-canada-amid-trumps-annexation-threats-live-updates-2077438",
    "timestamp": "2025-05-27T12:42:02Z"
  },
  {
    "title": "Canceled MSNBC star shreds Trump over new 'dementia-ridden' rant",
    "description": "President Donald Trump's rambling commencement speech to West Point cadets on Saturday underscored his mental infirmity, former MSNBC star Katie Phang proclaimed on her YouTube channel, per the Daily Beast.“You have these young, bright, incredibly smart, very…",
    "link": "https://www.rawstory.com/trump-katie-phang/",
    "timestamp": "2025-05-27T12:38:56Z"
  },
  {
    "title": "In 'big, beautiful bill ', Trump accounts just a political stunt to boost baby boom?",
    "description": "The Republican tax bill has proposed Trump Accounts, savings accounts for children seeded by the Treasury, aiming for a baby boom. However, experts suggest child care and paid leave are more effective incentives. While the bill includes a temporary Child Tax …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-big-beautiful-bill-trump-accounts-just-a-political-stunt-to-boost-baby-boom/articleshow/121439035.cms",
    "timestamp": "2025-05-27T12:37:38Z"
  },
  {
    "title": "ASEAN leaders agree tariff deals with US should not harm members",
    "description": "KUALA LUMPUR (Reuters) -Southeast Asian leaders reached an understanding on Tuesday that any bilateral agreements they might strike with the United States on...",
    "link": "https://ca.finance.yahoo.com/news/asean-leaders-agree-tariff-deals-123730064.html",
    "timestamp": "2025-05-27T12:37:30Z"
  },
  {
    "title": "Dow surges by more than 700 points after Trump hits pause on his EU tariff threat (again) | CNN Business",
    "description": "Dow surges by more than 700 points after Trump hits pause on his EU tariff threat (again) | CNN Businesscnn.com",
    "link": "https://www.cnn.com/2025/05/27/investing/stock-market-dow-trade-trump",
    "timestamp": "2025-05-27T12:37:27Z"
  },
  {
    "title": "CBS Anchor Scott Pelley’s Anti-Trump Graduation Speech Goes Viral — MAGA Fans Lash Out",
    "description": "CBS News anchor Scott Pelley's anti-Trump graduation speech went viral over the weekend as supporters of President Donald Trump lashed out.\nThe post CBS Anchor Scott Pelley’s Anti-Trump Graduation Speech Goes Viral — MAGA Fans Lash Out first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/cbs-anchor-scott-pelleys-anti-trump-graduation-speech-goes-viral-maga-fans-lash-out/",
    "timestamp": "2025-05-27T12:37:17Z"
  },
  {
    "title": "The Form of DEI That’s Alive and Well on Campus",
    "description": "In an effort to attract more conservative faculty, some elite universities are borrowing tactics long used to promote racial diversity.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/05/conservative-professors-dei-initiatives/682944/",
    "timestamp": "2025-05-27T12:36:00Z"
  },
  {
    "title": "Trump administration moves to cut rest of Harvard contracts with federal government",
    "description": "President Donald Trump in a social media post suggested taking $3 billion in frozen grant money to Harvard and and give it to trade schools.",
    "link": "https://www.cnbc.com/2025/05/27/harvard-trump-administration-cut-federal-contracts.html",
    "timestamp": "2025-05-27T12:35:15Z"
  },
  {
    "title": "NPR sues Trump over executive order cutting federal funding",
    "description": "National Public Radio sued President Donald Trump over his executive order to cease all federal funding for the broadcaster.",
    "link": "https://www.cnbc.com/2025/05/27/trump-npr-lawsuit-funding-order.html",
    "timestamp": "2025-05-27T12:34:46Z"
  },
  {
    "title": "Tom Morello Rages Against Donald Trump During Festival Set",
    "description": "Tom Morello joined Bruce Springsteen in railing against Donald Trump, performing in front of a 'f--k Trump' backdrop during his Boston Calling set.",
    "link": "http://www.billboard.com/music/rock/tom-morello-rages-against-donald-trump-boston-calling-1235981445/",
    "timestamp": "2025-05-27T12:33:14Z"
  },
  {
    "title": "What Has Nancy Mace Said About Her Ex-Fiancé?",
    "description": "At a congressional hearing, Republican Representative Nancy Mace shared a nude photo she claims was taken without her consent by her ex-fiancé Patrick Bryant. It’s not her only allegation.",
    "link": "http://www.thecut.com/article/nancy-mace-allegations-against-patrick-bryant-explained.html",
    "timestamp": "2025-05-27T12:33:13Z"
  },
  {
    "title": "NPR sues Trump admin. over funding halt",
    "description": "The National Public Radio filed a lawsuit on Tuesday against the administration of United States President Donald Trump over his executive order seeking to defund the broadcaster.NPR was joined by oth...",
    "link": "https://biztoc.com/x/5e7242d95851f7c4",
    "timestamp": "2025-05-27T12:33:11Z"
  },
  {
    "title": "NPR sues Trump over executive order cutting federal funding",
    "description": "National Public Radio sued President Donald Trump over his executive order to cease all federal funding for the broadcaster.",
    "link": "https://biztoc.com/x/fb572bdcf03eaee6",
    "timestamp": "2025-05-27T12:32:47Z"
  },
  {
    "title": "'Kids cannot read!' Trump slammed for abandoning 'roots' with new family plan",
    "description": "The United States has “chronically underinvested” in young people — and President Donald Trump’s newly announced kids' savings accounts are no different, according to Bloomberg columnist \r\nAbby McCloskey\r\n.“There are better ways to promote familial financial …",
    "link": "https://www.rawstory.com/trump-baby/",
    "timestamp": "2025-05-27T12:31:29Z"
  },
  {
    "title": "Stocks set to surge after Trump resets E.U. tariff deadline",
    "description": "Stocks were poised for large gains after President Donald Trump said he was resetting a deadline for imposing tariffs on the European Union.",
    "link": "https://www.nbcnews.com/business/markets/stock-market-updates-tuesday-rcna209153",
    "timestamp": "2025-05-27T12:31:02Z"
  },
  {
    "title": "Trump Effect: Europe Splashes $170+ Billion on Urgent Rearmament",
    "description": "European Union (E.U.) members on Tuesday agreed the urgent outlay of a new 170-billion-dollar (150-billion-euro) loan programme to help rearmament and respond to President Donald Trump's demand the zone begin to rely more on its own resources and less on U.S.…",
    "link": "https://www.breitbart.com/europe/2025/05/27/trump-effect-europe-splashes-170-billion-on-urgent-rearmament/",
    "timestamp": "2025-05-27T12:28:00Z"
  },
  {
    "title": "Trump administration moves to cut $100 million in federal contracts for Harvard",
    "description": "The Trump administration is asking federal agencies to cancel contracts with Harvard University worth about $100 million, a senior administration official said Tuesday.",
    "link": "https://www.bostonherald.com/2025/05/27/trump-administration-moves-to-cut-100-million-in-federal-contracts-for-harvard/",
    "timestamp": "2025-05-27T12:26:09Z"
  },
  {
    "title": "Joe Exotic’s Husband Jorge Says He’s ‘Scared’ After Sudden Deportation to Mexico",
    "description": "Joe Exotic’s husband is breaking his silence following his recent deportation. The Tiger King personality, real name Joseph Maldonado-Passage, confirmed earlier this month that his partner, Jorge Flores Maldonado, was deported to Mexico on May 19. Now, Jorge …",
    "link": "https://mediatakeout.com/joe-exotics-husband-jorge-says-hes-scared-after-sudden-deportation-to-mexico/",
    "timestamp": "2025-05-27T12:25:23Z"
  },
  {
    "title": "Russia Attacks Trump's Golden Dome Project",
    "description": "Russia criticized the U.S. for its Golden Dome anti-missile system, announced recently by President Donald Trump, saying it undermines strategic stability. Maria Zakharova, spokeswoman for the Russian Foreign Ministry, told Washington to abandon the deploymen…",
    "link": "https://freerepublic.com/focus/f-chat/4319296/posts",
    "timestamp": "2025-05-27T12:22:22Z"
  },
  {
    "title": "Ernie Els and Retief Goosen's Trump Visit Sparks Backlash—'Quite Troubling'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSouth African President Cyril Ramaphosa took golfers Ernie Els and Retief Goosen to his White House meeting with Donald Trump but there has been some backlash to what they said there.\nTrump had asked Ramaphosa…",
    "link": "https://biztoc.com/x/e52e8fbefea3d994",
    "timestamp": "2025-05-27T12:22:18Z"
  },
  {
    "title": "Trump hates wind power. But these Texas Republicans are embracing it",
    "description": "Wind turbines have become a financial lifeline in rural areas, but state legislators are now targeting them\nAs a Republican state lawmaker for 16 years, a Texas rancher and a staunch supporter of Donald Trump, John Davis’s conservative credentials are impecca…",
    "link": "https://biztoc.com/x/c3c3ea888b2d8d7c",
    "timestamp": "2025-05-27T12:21:55Z"
  },
  {
    "title": "As Trump reignites a trade war and faces a bond market revolt, the economy is about to go through the ringer this week",
    "description": "By week’s end, it’ll be much clearer how the US economy is holding up amid President Donald Trump’s sweeping policy changes.\nTrump’s erratic trade war has already unsettled consumers and taken a toll on economic growth — mostly due to American businesses rush…",
    "link": "https://biztoc.com/x/9bcddef033d5d14d",
    "timestamp": "2025-05-27T12:21:54Z"
  },
  {
    "title": "Syria, Israel in direct talks focused on security, sources say",
    "description": "The two sides have held face-to-face meetings aimed at calming tensions and preventing conflict in the border region.",
    "link": "https://www.jpost.com/israel-news/article-855630",
    "timestamp": "2025-05-27T12:21:21Z"
  },
  {
    "title": "Argentina ratifies WHO withdrawal during US health chief's visit",
    "description": "Argentina has ratified its decision to withdraw from the World Health Organization (WHO) and reaffirmed its collaboration with Washington, during a visit",
    "link": "https://insiderpaper.com/argentina-ratifies-who-withdrawal-during-us-health-chiefs-visit/",
    "timestamp": "2025-05-27T12:20:24Z"
  },
  {
    "title": "Israel must convince the world to direct its pressure on the sponsors of terror - opinion",
    "description": "Israel deserves support and ethical defense; criticism is valid. Peace needs strength, wisdom, and diplomacy to end Hamas.",
    "link": "https://www.jpost.com/opinion/article-855629",
    "timestamp": "2025-05-27T12:20:07Z"
  },
  {
    "title": "Moscow shares update on Ukraine peace memorandum",
    "description": "Russia is developing a roadmap outlining the details and timeline of a future Ukraine peace deal, the Foreign Ministry has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618202-moscow-update-ukraine-memorandum/",
    "timestamp": "2025-05-27T12:18:32Z"
  },
  {
    "title": "Ernie Els and Retief Goosen's Trump Visit Sparks Backlash—'Quite Troubling'",
    "description": "Some South Africans have criticized comments the golfers made on a trip to the White House.",
    "link": "https://www.newsweek.com/ernie-els-retief-goosen-donald-trump-south-africa-2076439",
    "timestamp": "2025-05-27T12:17:38Z"
  },
  {
    "title": "U.S. stock market futures today: Dow surges over 500 points, S&P 500 and Nasdaq rally as Trump delays EU tariffs; tech giants like Apple, Microsoft, and Nvidia lead gains",
    "description": "U.S. stock market update for May 27, 2025, opens with strong gains after President Donald Trump delayed the 50% EU tariff until July 9. This move lifted investor confidence, pushing the Dow Jones, S&P 500, and Nasdaq futures significantly higher. Big tech nam…",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-stock-market-futures-today-dow-surges-over-500-points-sp-500-and-nasdaq-rally-as-trump-delays-eu-tariffs-tech-giants-like-apple-microsoft-and-nvidia-lead-gains/articleshow/121438256.cms",
    "timestamp": "2025-05-27T12:16:35Z"
  },
  {
    "title": "SNAP Benefit Cut Warning Issued in State Trump Won by 1%",
    "description": "The Wisconsin Department of Health Services has said the Badger State could lose some $314 million in food assistance from the federal government.",
    "link": "https://www.newsweek.com/snap-benefit-cut-warning-wisconsin-donald-trump-2077343",
    "timestamp": "2025-05-27T12:16:35Z"
  },
  {
    "title": "Is Trump targeting Harvard because the elite university rejected his youngest son Barron? What you need to know",
    "description": "Social media posts allege Donald Trump has been targeting Ivy League schools after Barron's rejection. Tensions have escalated between the Trump administration and universities like Harvard. Trump has threatened to cut federal funding due to DEI disputes and …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-trump-targeting-harvard-because-the-elite-university-rejected-his-youngest-son-barron-what-you-need-to-know/articleshow/121437430.cms",
    "timestamp": "2025-05-27T12:16:27Z"
  },
  {
    "title": "They’re Losing Their Own Voters to Trump: Latest Polls Take Surprising Turn for Dem Voters",
    "description": "President Donald Trump saw a surprising increase in his support among Democrats, according to one new poll.\nThe post They’re Losing Their Own Voters to Trump: Latest Polls Take Surprising Turn for Dem Voters appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/losing-voters-trump-latest-polls-take-surprising-turn/",
    "timestamp": "2025-05-27T12:15:32Z"
  },
  {
    "title": "Reports say Trump hit Apple with surprise tax after Tim Cook refused to join presidential trip to Middle East",
    "description": "Donald Trump threatens a 25% tariff on Apple, claiming it's due to Tim Cook's absence from a recent Middle East trip. This surprising move may be driven by personal frustration rather than policy. Read more to uncover the background and implications of this s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/reports-say-trump-hit-apple-with-surprise-tax-after-tim-cook-refused-to-join-presidential-trip-to-middle-east-donald-trump-apple-news/articleshow/121438342.cms",
    "timestamp": "2025-05-27T12:15:09Z"
  },
  {
    "title": "Harvard's Kennedy School Could Lose 60% of Students Under International Ban",
    "description": "Harvard University's Kennedy School of Government could lose nearly 60% of its student body if the Trump administration's attempted ban on international enrollment, temporarily blocked by a judge, takes effect.\nThe post Harvard’s Kennedy School Could Lose 60%…",
    "link": "https://www.breitbart.com/politics/2025/05/27/harvards-kennedy-school-could-lose-60-of-students-under-international-ban/",
    "timestamp": "2025-05-27T12:12:37Z"
  },
  {
    "title": "Tapper claims Biden decline cover-up 'maybe even worse than Watergate'",
    "description": "CNN's Jake Tapper said Sunday that the cover-up of Joe Biden's decline was in many ways, \"worse\" than the Watergate scandal during Nixon's presidency.",
    "link": "https://www.foxnews.com/media/tapper-claims-biden-decline-cover-up-maybe-even-worse-than-watergate",
    "timestamp": "2025-05-27T12:12:15Z"
  },
  {
    "title": "Asia-Pacific markets trade mixed as investors assess Trump's tariff plans",
    "description": "Asia-Pacific markets traded mixed Tuesday as investors continued to assess the global trade climate after U.S. President Donald Trump deferred 50% tariffs on European Union imports.\nJapan's benchmark Nikkei 225 ended the day 0.51% higher at 37,724.11 while th…",
    "link": "https://biztoc.com/x/47d2dfe68b60d450",
    "timestamp": "2025-05-27T12:10:53Z"
  },
  {
    "title": "Trump App Scam: Over 200 investors from Bengaluru, Mangaluru, Hubballi and other Karnataka districts defrauded of over Rs 2 crore",
    "description": "A fraudulent app named 'Trump Hotel Rental,' featuring AI-generated content of Donald Trump, has defrauded over 200 investors in Karnataka of nearly Rs 2 crore. The scammers promised high returns, luring victims to invest significant amounts. Police investiga…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/trump-app-scam-over-200-investors-from-bengaluru-mangaluru-hubballi-and-other-karnataka-districts-defrauded-of-over-rs-2-crore/articleshow/121438582.cms",
    "timestamp": "2025-05-27T12:10:00Z"
  },
  {
    "title": "Kremlin: Russia, US can't agree on everything",
    "description": "Kremlin spokesperson Dmitry Peskov said on Tuesday that Russia and the United States \"cannot agree on everything\" after US President Donald Trump called Russian President Vladimir Putin \"absolutely crazy\" and criticized strikes on Ukrainian cities. \"But the p…",
    "link": "https://freerepublic.com/focus/f-chat/4319295/posts",
    "timestamp": "2025-05-27T12:07:18Z"
  },
  {
    "title": "Pressure building for homeowners as renovation industry gets hammered by supply chain chaos thanks to tariffs",
    "description": "“Just like everything, you have to pass that cost along if you want to stay profitable.”",
    "link": "https://finance.yahoo.com/news/pressure-building-homeowners-renovation-industry-120700123.html",
    "timestamp": "2025-05-27T12:07:00Z"
  },
  {
    "title": "5 things to know before the stock market opens Tuesday",
    "description": "Here are the most important news items that investors need to start their trading day.",
    "link": "https://www.cnbc.com/2025/05/27/5-things-to-know-before-the-stock-market-opens-tuesday.html",
    "timestamp": "2025-05-27T12:02:59Z"
  },
  {
    "title": "Does Trump Really Want to Sacrifice Dollar Dominance?",
    "description": "From suddenly announcing much higher trade tariffs against the European Union to escalating his administration's war against Harvard University, Donald Trump is rapidly undermining both the cyclical and the structural outlook for the US dollar. The implicatio…",
    "link": "https://www.project-syndicate.org/commentary/trump-sacrificing-dollar-dominance-to-tariffs-and-war-on-harvard-by-jim-o-neill-2025-05",
    "timestamp": "2025-05-27T12:02:41Z"
  },
  {
    "title": "Is Elon Musk now a liability for Tesla? Data reveals shocking picture for luxury automaker",
    "description": "Tesla's prior success did become a synonymous with Elon Musk. However, the billionaire's association with Donald Trump administration has not gone down well with a section of market.",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-elon-musk-now-a-liability-for-tesla-data-reveals-shocking-picture-for-luxury-automaker/articleshow/121438459.cms",
    "timestamp": "2025-05-27T12:02:37Z"
  },
  {
    "title": "The Right Isn’t the Only Side We Need To Fight When It Comes to Trans Sports Inclusion",
    "description": "We all know that this sports issue has nothing to do with sports, and it has nothing to do with protecting female athletes. This topic has been a roundabout way to erode rights for transgender people.\nThe post The Right Isn’t the Only Side We Need To Fight Wh…",
    "link": "http://www.autostraddle.com/the-right-isnt-the-only-side-we-need-to-fight-when-it-comes-to-trans-sports-inclusion/",
    "timestamp": "2025-05-27T12:00:43Z"
  },
  {
    "title": "Jasmine Crockett mocks Trump West Point speech quipping 'get him some ADHD medicine'",
    "description": "Rep. Jasmine Crockett, D-Texas., attacked President Donald Trump’s recent commencement address to the United States Military Academy at West Point graduates.",
    "link": "https://www.foxnews.com/media/jasmine-crockett-mocks-trump-west-point-speech-quipping-get-him-some-adhd-medicine",
    "timestamp": "2025-05-27T12:00:34Z"
  },
  {
    "title": "This Ethiopian Woman Was Tortured by Her Government. The US is Sending Her Home Anyway",
    "description": "The Trump Administration has turned the remaining sliver of hope for people fleeing torture into what experts fear is a fast track to deportation. And it’s trying to keep it a secret.",
    "link": "https://www.kqed.org/news/12041326/this-ethiopian-woman-was-tortured-by-her-government-the-us-is-sending-her-home-anyway",
    "timestamp": "2025-05-27T12:00:18Z"
  },
  {
    "title": "From Oil To Technology: The UAE’s Rise To Web3 And AI Leadership",
    "description": "look differently through the lens of Dubai and Abu Dhabi, the two iconic sites that share responsibility for the nation’s strategic ascent to leadership in Web3 and AI.",
    "link": "https://www.forbes.com/sites/digital-assets/2025/05/27/from-oil-to-technology-the-uaes-rise-to-web3-and-ai-leadership/",
    "timestamp": "2025-05-27T12:00:12Z"
  },
  {
    "title": "The State Of Arab Luxury: The Major Players Behind The Brands",
    "description": "Trump’s Gulf tour highlighted the booming Arab luxury GCC sector that's worth $16.9B. Riyadh’s mega malls challenge Dubai’s luxury brand dominance, second only to London's.",
    "link": "https://www.forbes.com/sites/rdaniel-foster/2025/05/27/the-state-of-arab-luxury-the-major-players-behind-the-brands/",
    "timestamp": "2025-05-27T12:00:00Z"
  },
  {
    "title": "Ukraine’s New Way of War",
    "description": "American weapons are important, but Ukrainian drones have changed everything.",
    "link": "https://www.theatlantic.com/international/archive/2025/05/ukraine-troops-front-lines/682910/",
    "timestamp": "2025-05-27T12:00:00Z"
  },
  {
    "title": "Tying U.S. Drug Prices To Foreign Markets Risks Innovation And Lives",
    "description": "Pegging drug prices here to those in other countries would yield minimal savings for the United States and devastate funding for biomedical research.",
    "link": "https://www.forbes.com/sites/sallypipes/2025/05/27/tying-us-drug-prices-to-foreign-markets-risks-innovation-and-lives/",
    "timestamp": "2025-05-27T12:00:00Z"
  },
  {
    "title": "Pardon The Corruption",
    "description": "<ul>\n<li>Scum And Monsters</li>\n<li>MAHA In Disarray</li>\n<li>Debunking Charlie Kirk</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/pardon-corruption",
    "timestamp": "2025-05-27T12:00:00Z"
  },
  {
    "title": "US, European bond yields decline after tariff delay",
    "description": "Yields on government bonds declined in both the United States and several European countries, as investors' confidence in the easing of trade tensions was boosted by US President Donald Trump delaying...",
    "link": "https://biztoc.com/x/9b05a6a8ef9b856a",
    "timestamp": "2025-05-27T11:59:32Z"
  },
  {
    "title": "Inside the Oval Office, Trump’s new Lair",
    "description": "The world has never been short of demagogues and fools, but the remedies have often matched the supply. In 1990, during President Nelson Mandela’s thank-you tour of the world, he was asked at a joint sitting of the US Congress why he remained friends with Mua…",
    "link": "https://thechronicle.com.gh/inside-the-oval-office-trumps-new-lair/",
    "timestamp": "2025-05-27T11:59:20Z"
  },
  {
    "title": "Posthaste: Burning your mortgage is going the way of rotary phones and station wagons",
    "description": "Royal LePage survey finds that millennials and gen z are not the only generations struggling with housing affordability in Canada. Read more",
    "link": "https://financialpost.com/news/almost-third-canadians-retire-with-mortgage",
    "timestamp": "2025-05-27T11:59:05Z"
  },
  {
    "title": "Outgoing US Capitol Police chief criticizes Trump pardons for Jan. 6 defendants",
    "description": "Outgoing US Capitol Police Chief Manger haas expressing frustration and anger at President Donald Trump’s pardons of the Jan. 6 defendants.",
    "link": "https://www.foxnews.com/politics/outgoing-us-capitol-police-chief-criticizes-trump-pardons-jan-6-defendants",
    "timestamp": "2025-05-27T11:58:59Z"
  },
  {
    "title": "Donald Trump's Approval Rating Skyrockets With Hispanics",
    "description": "A new poll has revealed that the president is gaining traction among Hispanic voters.",
    "link": "https://www.newsweek.com/trump-approval-rating-hispanic-voters-poll-2077324",
    "timestamp": "2025-05-27T11:58:23Z"
  },
  {
    "title": "Buy 5 Aerospace Defense Stocks for Second-Half 2025 on Growing Demand",
    "description": "Buy-rated aerospace defense stocks like GE, HWM, LDOS, HII & EVTL are likely to surge in second-half 2025 amid rising budget and air travel demand.",
    "link": "https://finance.yahoo.com/news/buy-5-aerospace-defense-stocks-115700076.html",
    "timestamp": "2025-05-27T11:57:00Z"
  },
  {
    "title": "Forbes Daily: How Elon Musk’s 2024 Political Donations Have Paid Off",
    "description": "Today’s Forbes Daily newsletter covers annual Midas List of venture capitalists, Musk’s ROI, Trump extends EU tariffs, Southwest checked bag policy update and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/05/27/forbes-daily-how-elon-musks-2024-political-donations-have-paid-off/",
    "timestamp": "2025-05-27T11:56:23Z"
  },
  {
    "title": "\"Original Sin\" authors claim Biden health coverup worse than Watergate... but of course, now comes their anti-Trump pivot",
    "description": "\"Original Sin\" authors claim Biden health coverup worse than Watergate... but of course, now comes their anti-Trump pivotlouderwithcrowder.com",
    "link": "https://www.louderwithcrowder.com/original-sin-biden-watergate",
    "timestamp": "2025-05-27T11:54:40Z"
  },
  {
    "title": "Russia warns US about Golden Dome scheme",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova has criticized the US for an “reckless” attitude toward global stability Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618203-zakharova-golden-dome-china/",
    "timestamp": "2025-05-27T11:53:39Z"
  },
  {
    "title": "King Charles to outline Canada’s priorities in Parliament amid Trump annexation threat",
    "description": "Trump’s repeated suggestion that the U.S. annex Canada prompted Canada's Prime Minister to invite Charles to give the speech.",
    "link": "https://www.bostonherald.com/2025/05/27/king-charles-iii-speech-canada/",
    "timestamp": "2025-05-27T11:52:54Z"
  },
  {
    "title": "WATCH: South Africa's Ramaphosa Defends 'Kill the Boer': It's a 'Liberation Chant'",
    "description": "South African President Cyril Ramaphosa defended the \"Kill the Boer\" slogan as a \"liberation chant\" Tuesday, refusing U.S. President Donald Trump's demand to arrest opposition figure Julius Malema for using it.\nThe post WATCH: South Africa’s Ramaphosa Defends…",
    "link": "https://www.breitbart.com/politics/2025/05/27/watch-south-africas-ramaphosa-defends-kill-the-boer-its-a-liberation-chant/",
    "timestamp": "2025-05-27T11:51:31Z"
  },
  {
    "title": "Trump’s New Middle East Vision: From Ceasefires to Regional Partnerships",
    "description": "President Trump’s evolving Middle East policy, highlighting a strategic shift from traditional Western intervention toward fostering regional partnerships, diplomacy, and sustainable peace.",
    "link": "https://www.jpost.com/middle-east/article-855627",
    "timestamp": "2025-05-27T11:50:09Z"
  },
  {
    "title": "Shares gain as markets weigh Trump's tariff policies; long-dated bond yields fall",
    "description": "LONDON :World shares gained on Tuesday as investors weighed up the latest tariff-related news, while long-dated U.S. Treasury yields were set for their biggest one-day fall since mid-April, mirroring a steep price rally in super-long Japanese debt.After a wee…",
    "link": "https://www.channelnewsasia.com/business/shares-gain-markets-weigh-trumps-tariff-policies-long-dated-bond-yields-fall-5154591",
    "timestamp": "2025-05-27T11:47:52Z"
  },
  {
    "title": "US-backed Kurds strike deal with Syrian gov't to clear ISIS camps",
    "description": "Syria’s new government will relocate ISIS families from camps, with Kurdish and US support. The new Syrian transitional government is seeking to find a way to deal with thousands of ISIS families who have been housed at camps in eastern Syria since ISIS was d…",
    "link": "https://freerepublic.com/focus/f-news/4319293/posts",
    "timestamp": "2025-05-27T11:46:07Z"
  },
  {
    "title": "The Big Beautiful Bill is a joke",
    "description": "The only BBB I might appreciate is the Better Business Bureau. This new bill the Republicans are foisting off on us is a blatant grift, and we’re just sitting here watching it pass. What the Big Beautiful Bill contains is a give-away for the rich, while takin…",
    "link": "https://freethoughtblogs.com/pharyngula/2025/05/27/the-big-beautiful-bill-is-a-joke/",
    "timestamp": "2025-05-27T11:45:53Z"
  },
  {
    "title": "‘No one should underestimate the significance’ of King Charles’s Canada visit",
    "description": "Embed from Getty Images Here are some photos of King Charles and Queen Camilla in Ottawa on Monday, which was Memorial Day here in the US. C&C traveled on Monday and then did a handful of quick events and meetings, most of which were organized by Prime Minist…",
    "link": "https://www.celebitchy.com/924018/no_one_should_underestimate_the_significance_of_king_charless_canada_visit/",
    "timestamp": "2025-05-27T11:45:31Z"
  },
  {
    "title": "Russia seizes Ukrainian border villages as its massive bombing campaign slows",
    "description": "The conflict has shown no signs of stopping despite intense U.S.-led efforts in recent months to secure a ceasefire.",
    "link": "https://www.bostonherald.com/2025/05/27/russia-seizes-ukraine-border-villages/",
    "timestamp": "2025-05-27T11:45:25Z"
  }
]