[
  {
    "title": "Trump Says US Will Have a Fair Trade Deal With China",
    "description": "President Donald Trump said he plans to be “very nice” to China in any trade talks and that tariffs will drop if the two countries can reach a deal, a sign he may be backing down from his tough stance on Beijing amid market volatility.\n#politics #trump #china…",
    "link": "https://biztoc.com/x/32546df50f1013de",
    "timestamp": "2025-04-26T14:24:34Z"
  },
  {
    "title": "Reason Volodymyr Zelenskyy did not wear a suit at Pope Francis' funeral",
    "description": "The fashion sense of Ukrainian leader Volodymyr Zelenskyy has been called into question again after he swerved a suit while attending Pope Francis' funeral.",
    "link": "https://www.ladbible.com/news/world-news/pope-francis-funeral-why-zelenskyy-didnt-wear-suit-ukraine-war-771467-20250426",
    "timestamp": "2025-04-26T14:23:56Z"
  },
  {
    "title": "Donald Trump blasts Vladimir Putin. Are Volodymyr Zelenskyy, Ukraine having the upper hand over Russia?",
    "description": "Donald Trump has pressed both sides to quickly come to an agreement to end the war, but while Volodymyr Zelenskyy agreed to an American plan for an initial 30-day halt to hostilities, Vladimir Putin's Russia has not signed on and has continued to strike at ta…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-blasts-vladimir-putin-are-volodymyr-zelenskyy-ukraine-having-the-upper-hand-over-russia/articleshow/120648114.cms",
    "timestamp": "2025-04-26T14:22:04Z"
  },
  {
    "title": "Pope Francis laid to rest in Rome",
    "description": "Pope Francis was laid to rest in private in St. Mary Major Basilica. Security was tightened in Rome as world leaders attended the funeral ceremonies. DW has the latest. Pope Francis was laid to rest in private in a simple underground tomb in keeping with his …",
    "link": "https://www.dw.com/en/pope-francis-laid-to-rest-in-rome/live-72358639",
    "timestamp": "2025-04-26T14:20:00Z"
  },
  {
    "title": "Canadians Really Don’t Like Donald Trump",
    "description": "Three quarters of Canadians dislike President Donald Trump — and Conservatives appear likely to pay a painful price for it in the country’s Monday election, according to a Politico/Focaldata poll of Canadian voters.",
    "link": "https://politicalwire.com/2025/04/26/canadians-really-dont-like-donald-trump/",
    "timestamp": "2025-04-26T14:19:26Z"
  },
  {
    "title": "\"Maybe He Doesn't Want To Stop War\": Trump Slams Putin After Zelensky Meet",
    "description": "US President Donald Trump on Saturday criticised Russian President Vladimir Putin for attacks on civilian areas of Ukraine in recent days, and said, &quot;Maybe he doesn&#039;t want to stop the war.&quot;",
    "link": "https://www.ndtv.com/world-news/donald-trump-on-russia-ukraine-war-maybe-he-doesnt-want-to-stop-war-trump-slams-putin-after-zelensky-meet-8263661",
    "timestamp": "2025-04-26T14:18:57Z"
  },
  {
    "title": "As the Economy Tumbles, so Does Trump's Approval Rate",
    "description": "President Donald Trump's approval rating has dropped to 40 percent, lower than all other presidents at this point in their terms, new polling released by Pew Research Center on Wednesday shows. Americans want Trump to govern less by executive order, listen to…",
    "link": "https://freerepublic.com/focus/f-news/4313395/posts",
    "timestamp": "2025-04-26T14:18:20Z"
  },
  {
    "title": "Rome and the world bid farewell to Pope Francis",
    "description": "VATICAN CITY - Presidents, royalty and simple mourners bade farewell to  Pope Francis  on Saturday at a solemn funeral ceremony, where a cardinal appealed for the pontiff&rsquo;s legacy of caring for migrants, the downtrodden and the environment to be kept al…",
    "link": "https://www.bangkokpost.com/world/3011901/rome-and-the-world-bid-farewell-to-pope-francis",
    "timestamp": "2025-04-26T14:18:00Z"
  },
  {
    "title": "Bloc wants power in 'foreign parliament' before fulfilling Quebec independence",
    "description": "Even if nationalist voters don't want secession, they are proud of their representatives who defend them at every opportunity, particularly on issues of language",
    "link": "https://nationalpost.com/news/politics/federal_election/blanchet-bloc-wants-power-in-foreign-parliament-before-fulfilling-quebec-independence",
    "timestamp": "2025-04-26T14:17:27Z"
  },
  {
    "title": "China hits out at 'extreme selfishness' of tariffs",
    "description": "China's foreign minister has hit out at the \"extreme selfishness\" of tariffs, hinting at the steep levies imposed on Beijing by US President Donald Trump. This will \"only undermine their credibility\", added Wang, who was speaking on Friday on the sidelines of…",
    "link": "https://economictimes.indiatimes.com/tech/technology/china-hits-out-at-extreme-selfishness-of-tariffs/articleshow/120648086.cms",
    "timestamp": "2025-04-26T14:17:25Z"
  },
  {
    "title": "U.S. military stunned as Houthi rebels down 7 high-tech Reaper drones in weeks, costing over $300 million and raising eyebrows",
    "description": "Houthi rebels in Yemen downed seven US drones recently. These drones cost the Pentagon millions of dollars. The US military increased its strikes against the Houthis last month. This was after Houthi attacks on Red Sea shipping. The US has two aircraft carrie…",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-military-stunned-as-houthi-rebels-down-7-high-tech-reaper-drones-in-weeks-costing-over-300-million-and-raising-eyebrows/articleshow/120647451.cms",
    "timestamp": "2025-04-26T14:15:35Z"
  },
  {
    "title": "Bill Maher Confronts Al Gore For Comparing Trump Administration To Nazis On ‘Real Time’",
    "description": "The former VP invoked 'Adolf Hitler's Third Reich' in a keynote speech this week.",
    "link": "https://decider.com/2025/04/26/bill-maher-al-gore-trump-nazis-real-time/",
    "timestamp": "2025-04-26T14:14:57Z"
  },
  {
    "title": "Trump says Putin may not want to end the war",
    "description": "US President Donald Trump voiced doubts about Russian President Vladimir Putin's intentions after Russia launched fresh missile strikes on civilian areas. Taking on Truth social on Saturday, Trump sai...",
    "link": "https://biztoc.com/x/c23496941bc304dd",
    "timestamp": "2025-04-26T14:13:30Z"
  },
  {
    "title": "Shedeur Sanders' NFL Draft freefall has sports world in shock: 'This is disgusting'",
    "description": "As Shedeur Sanders remained on the 2025 NFL Draft big board after Day 2, the opinions and concerns flew in from all over the sports world, as many can't fathom why he's still available.",
    "link": "https://www.foxnews.com/sports/shedeur-sanders-nfl-draft-freefall-has-sports-world-shock-this-disgusting",
    "timestamp": "2025-04-26T14:12:32Z"
  },
  {
    "title": "Trump says maybe Putin 'doesn't want to stop the war' in Ukraine",
    "description": "Donald Trump criticized Vladimir Putin for recent attacks on Ukrainian civilian areas, suggesting Putin may not want to end the war. Trump proposed dealing with Putin differently, possibly through banking sanctions. Putin stated readiness for talks with Ukrai…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-maybe-putin-doesnt-want-to-stop-the-war-in-ukraine/articleshow/120647981.cms",
    "timestamp": "2025-04-26T14:10:53Z"
  },
  {
    "title": "Trump Tells Reporters ‘We’re Going For a Good Reason’ En Route To Pope’s Funeral — Reacts Glumly When Told Biden Will Be There",
    "description": "Trump told reporters aboard AF1 that \"We're going for a good reason\" as they flew toRome and reacted glumly when he was told Biden would be there.\nThe post Trump Tells Reporters ‘We’re Going For a Good Reason’ En Route To Pope’s Funeral — Reacts Glumly When T…",
    "link": "https://www.mediaite.com/news/trump-tells-reporters-were-going-for-a-good-reason-en-route-to-popes-funeral-reacts-glumly-when-told-biden-will-be-there/",
    "timestamp": "2025-04-26T14:10:18Z"
  },
  {
    "title": "Billy Ray Cyrus opens up about the post-divorce text that sparked his relationship with Elizabeth Hurley",
    "description": "‘It's been a long time since I've been this happy,’ said country musician",
    "link": "https://www.the-independent.com/life-style/elizabeth-hurley-billy-ray-cyrus-dating-text-b2740056.html",
    "timestamp": "2025-04-26T14:06:15Z"
  },
  {
    "title": "Trump delivers different message on Gaza when recapping call with Netanyahu",
    "description": "President Donald Trump told reporters that he recently pressed Israeli Prime Minister Benjamin Netanyahu on allowing more aid to flow into the Gaza Strip.",
    "link": "https://www.foxnews.com/world/trump-delivers-different-message-gaza-when-recapping-call-netanyahu",
    "timestamp": "2025-04-26T14:05:37Z"
  },
  {
    "title": "Who are the Romanian “sovereignists”?",
    "description": "Nationalists, Eurosceptics, anti-NATO, MAGA caps, Trump (but not Putin) supporters, and Călin Georgescu. What is on the minds of the voters supporting Romania's far-right and sovereignists?",
    "link": "https://voxeurop.eu/en/romania-sovereignists-far-right-elections/",
    "timestamp": "2025-04-26T14:05:22Z"
  },
  {
    "title": "Pope Francis’s funeral: World leaders join thousands of mourners as pope is laid to rest",
    "description": "Francis is the first pope to be buried outside of the Vatican in 100 years",
    "link": "https://www.irishtimes.com/world/europe/2025/04/26/pope-franciss-funeral-world-leaders-join-thousands-of-mourners-as-pope-is-laid-to-rest/",
    "timestamp": "2025-04-26T14:01:42Z"
  },
  {
    "title": "Billionaire Mindset: 12 Traits From Mark Cuban, Warren Buffett and More",
    "description": "Looking to become a huge success? Take a note from successful wealth growers and think like a billionaire. Hacking through the jungle of life can leave you...",
    "link": "https://finance.yahoo.com/news/billionaire-mindset-12-traits-mark-140117801.html",
    "timestamp": "2025-04-26T14:01:17Z"
  },
  {
    "title": "First lady Melania Trump turns 55: Her life in photos, from Slovenia to White House",
    "description": "In celebration of first lady Melania Trump's 55th birthday, Fox News Digital reflects on her journey from her upbringing in Slovenia to her time in the White House, captured in photos.",
    "link": "https://www.foxnews.com/travel/first-lady-melania-trump-turns-55-life-photos-slovenia-white-house",
    "timestamp": "2025-04-26T14:00:46Z"
  },
  {
    "title": "How Your Showerhead and Fridge Became Political Statements",
    "description": "Efficient appliances used to have bipartisan support. What happened?",
    "link": "https://gizmodo.com/how-your-showerhead-and-fridge-became-political-statements-2000593821",
    "timestamp": "2025-04-26T14:00:27Z"
  },
  {
    "title": "CNN’s Jennings says all the ‘Clinton guys from the 90s’ have left the Democratic Party for Trump",
    "description": "CNN political commentator Scott Jennings marveled at how working-class men who voted for former President Bill Clinton in the 90s, have become supporters of President Donald Trump.",
    "link": "https://www.foxnews.com/media/cnns-jennings-says-clinton-guys-90s-left-democratic-party-trump",
    "timestamp": "2025-04-26T14:00:10Z"
  },
  {
    "title": "What student loan forgiveness opportunities still remain under Trump",
    "description": "Here's what to know about the current status of the different federal student loan forgiveness opportunites under the Trump administration.",
    "link": "https://www.cnbc.com/2025/04/26/what-student-loan-forgiveness-opportunities-still-remain-under-trump.html",
    "timestamp": "2025-04-26T14:00:01Z"
  },
  {
    "title": "Trump, Zelenskyy discuss hopes for ‘lasting peace’ amid pope’s funeral",
    "description": "U.S. President Donald Trump and Ukrainian President Volodymyr Zelenskyy hold a one-on-one meeting at the Vatican prior to Pope Francis’ funeral, Saturday, April 26, 2025. / Credit: Office of the President of Ukraine via Getty Images\n\nCNA Staff, Apr 26, 2025 /…",
    "link": "https://www.catholicnewsagency.com/news/263685/trump-zelenskyy-discuss-hopes-for-lasting-peace-ahead-of-popes-funeral",
    "timestamp": "2025-04-26T14:00:00Z"
  },
  {
    "title": "The Sleeping Giant That Could Stop Trump’s Agenda in Its Tracks",
    "description": "A secret weapon is hiding in plain sight.",
    "link": "https://slate.com/news-and-politics/2025/04/general-strike-protest-trump-immigration-deportations-tariffs-unions.html",
    "timestamp": "2025-04-26T14:00:00Z"
  },
  {
    "title": "Tax Breaks: The Not So Many Rules And Regulations Edition",
    "description": "Another IRS Commissioner, Pope Francis, partnership tax, fast fashion and tariffs, a new reporting rule gets a legal challenge, Social Security and Medicare, tax trivia and more.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/04/26/tax-breaks-the-not-so-many-rules-and-regulations-edition/",
    "timestamp": "2025-04-26T14:00:00Z"
  },
  {
    "title": "'It was a joke!' Trump melts down over NYT report in tirade after pope funeral",
    "description": "Following his appearance at the funeral of Pope Francis on Saturday, where he was called out in a homily, Donald Trump jumped onto Truth Social to lash out at the New York Times and, in. particular, reporter Peter Baker.In his long tirade, the president took …",
    "link": "https://www.rawstory.com/trump-rages-at-nyt/",
    "timestamp": "2025-04-26T13:59:20Z"
  },
  {
    "title": "Crypto sentiment recovers, but weekend liquidity risks remain",
    "description": "Crypto investor sentiment has seen a significant recovery from global tariff concerns, but analysts warn that the market’s structural weaknesses may still result in downside momentum during periods of weekend illiquidity.Risk appetite appeared to return among…",
    "link": "https://cointelegraph.com/news/crypto-market-structural-weekend-risks-tariff-calm",
    "timestamp": "2025-04-26T13:57:06Z"
  },
  {
    "title": "Ukraine denies Putin's claim that Russian forces regained Kursk",
    "description": "Ukraine denies Putin's claim that Russian forces regained Kurskgo.com",
    "link": "https://abcnews.go.com/International/ukraine-denies-putins-claim-russian-forces-regained-kursk/story?id=121195212",
    "timestamp": "2025-04-26T13:57:00Z"
  },
  {
    "title": "Trump and Zelenskyy met ahead of the Pope's funeral — their first encounter since their White House clash",
    "description": "Donald Trump and Volodymyr Zelenskyy met before Pope Francis' funeral, their first face-to-face since a tense February meeting.",
    "link": "https://www.businessinsider.com/trump-zelenskyy-ukraine-russia-first-encounter-white-house-clash-2025-4",
    "timestamp": "2025-04-26T13:56:05Z"
  },
  {
    "title": "Putin Says Russia Ready To Resume Talks With Ukraine \"Without Preconditions\"",
    "description": "&quot;During yesterday&#039;s talks with Trump&#039;s envoy Witkoff, Vladimir Putin reiterated that Russia is ready to resume negotiations with Ukraine without any preconditions,&quot; said Kremlin spokesperson Dmitry Peskov.",
    "link": "https://www.ndtv.com/world-news/russia-ready-to-resume-talks-with-ukraine-without-preconditions-kremlin-8263436",
    "timestamp": "2025-04-26T13:43:04Z"
  },
  {
    "title": "Prince William Attends Pope Francis Funeral in Vatican City - See Which World Leaders He Sat With & Spoke To",
    "description": "Prince William is mourning. The 42-year-old Prince of Wales was seen arriving at the funeral of Pope Francis in St. Peter’s Square on Saturday (April 26) in Vatican City, Vatican. Pope Francis sadly passed away at the age of 88 on April 21. Find out the cause…",
    "link": "https://www.justjared.com/2025/04/26/prince-william-attends-pope-francis-funeral-in-vatican-city-see-which-world-leaders-he-sat-with-spoke-to/",
    "timestamp": "2025-04-26T13:41:18Z"
  },
  {
    "title": "Poilievre promises 100-day legislative blitz, to cancel MPs' summer break",
    "description": "Conservative Leader Poilievre vowed to keep Parliament open all summer if elected, pushing three bills on affordability, crime, and economy within 100 days. He aims to reverse Liberal policies, promising tax cuts, crime crackdown, and resource project approva…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/poilievre-promises-100-day-legislative-blitz-to-cancel-mps-summer-break/articleshow/120647526.cms",
    "timestamp": "2025-04-26T13:40:57Z"
  },
  {
    "title": "Today's major stories must be seen in the context of President Donald Trump's dramatic losses ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nToday's major stories must be seen in the context of President Donald Trump's dramatic losses in court and his plummeting poll numbers.  —  Yesterday, Trump told the Department of Justice to investigate ActBl…",
    "link": "https://www.memeorandum.com/250426/p13",
    "timestamp": "2025-04-26T13:40:01Z"
  },
  {
    "title": "Trump’s First 100 Days",
    "description": "Panelists discuss the president’s most consequential actions—and the biggest changes to American governance.",
    "link": "https://www.theatlantic.com/national/archive/2025/04/trumps-first-100-days/682614/",
    "timestamp": "2025-04-26T13:38:27Z"
  },
  {
    "title": "Trump Held Court at Pope’s Funeral as Politics, Ritual Collided",
    "description": "St. Peter’s Square erupted in applause for Ukraine’s Volodymyr Zelenskiy. Inside the Basilica, he and Donald Trump huddled with France’s Emmanuel Macron and Britain’s Keir Starmer. The occasion was the funeral of Pope Francis — but the optics were all about t…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-held-court-at-popes-funeral-as-politics-ritual-collided",
    "timestamp": "2025-04-26T13:37:42Z"
  },
  {
    "title": "Trump and Zelensky hold war talks inside St. Peter's Basilica...",
    "description": "US President Donald Trump and Ukrainian President Volodymyr Zelensky held crunch war talks in the heart of the Vatican minutes before the start of the funeral of Pope Francis on Saturday, as the White House mounts an increasingly urgent push to strike a peace…",
    "link": "https://www.cnn.com/2025/04/26/europe/zelensky-trump-talks-pope-funeral-intl/index.html",
    "timestamp": "2025-04-26T13:37:37Z"
  },
  {
    "title": "Thousands line streets for Francis final journey...",
    "description": "THE Pope has been laid to rest in a private ceremony after an historic funeral service and procession through the streets. Hundreds of thousands of people including world leaders descended on The V…",
    "link": "https://www.the-sun.com/news/14103213/pope-francis-funeral-updates-news-vatican/",
    "timestamp": "2025-04-26T13:37:36Z"
  },
  {
    "title": "Trump, Zelenskyy meet privately at St. Peter’s Basilica while in Rome for Pope Francis’ funeral",
    "description": "Zelenskyy: 'We discussed a lot one-on-one. Hoping for results on everything we covered'",
    "link": "https://www.wnd.com/2025/04/trump-zelenskyy-meet-privately-at-st-peters-basilica-while-in-rome-for-pope-francis-funeral/",
    "timestamp": "2025-04-26T13:32:01Z"
  },
  {
    "title": "See photos of Pope Francis' funeral and procession",
    "description": "Pope Francis requested simplicity in his wooden coffin and final resting place​, but his funeral Mass still reflected the grandeur and traditions of the Vatican.",
    "link": "https://www.cbsnews.com/news/pope-francis-funeral-photos/",
    "timestamp": "2025-04-26T13:31:59Z"
  },
  {
    "title": "Bitcoin Sees Highest Exchange Outflows In 2 Years, What This Means For Price",
    "description": "Bitcoin has been on the rise again with positive sentiment returning after Donald Trump revealed plans to reduce tariffs on China. This suggests that an end to the tariff wars which began in January 2025 could be drawing to an end. Taking this as a sign, Bitc…",
    "link": "http://www.newsbtc.com/bitcoin-news/bitcoin-exchange-outflows/",
    "timestamp": "2025-04-26T13:30:55Z"
  },
  {
    "title": "Zelensky Urges Trump Not to Surrender to Russia",
    "description": "The presidents of Ukraine and America met at the pope’s funeral, as the White House says its latest pro-Russia peace plan is its “final offer.”",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-zelensky-surrender-ukraine-russia-1235325789/",
    "timestamp": "2025-04-26T13:30:00Z"
  },
  {
    "title": "The case against Anasse Kazib is just the French government’s latest act of repression against Palestine solidarity",
    "description": "More than 1,000 activists, intellectuals, and writers have signed a letter against the crackdown on Palestine solidarity in France, including the targeting of union organizer Anasse Kazib.",
    "link": "https://mondoweiss.net/2025/04/the-case-against-anasse-kazib-is-just-the-french-governments-latest-act-of-repression-against-palestine-solidarity/",
    "timestamp": "2025-04-26T13:30:00Z"
  },
  {
    "title": "How Trump’s 145% China tariffs could crush American small businesses: ‘There’s no facility here that makes what we need’",
    "description": "Small businesses will have no choice but to raise prices, cut staff, delay growth plans or shut down entirely just to keep up with the rising costs of imports they can’t source domestically, one expert said.",
    "link": "https://www.cnn.com/2025/04/26/business/trump-tariffs-small-businesses/index.html",
    "timestamp": "2025-04-26T13:29:59Z"
  },
  {
    "title": "Body language expert points out gesture Donald Trump made during meeting with Zelenskyy",
    "description": "Trump and Zelenskyy had a meeting before the funeral of Pope Francis, and a body language expert has explained what might have been going on.",
    "link": "https://www.ladbible.com/news/world-news/trump-zelenskyy-pope-francis-funeral-meeting-body-language-257996-20250426",
    "timestamp": "2025-04-26T13:27:33Z"
  },
  {
    "title": "Zelensky and Trump meet inside St Peter's Basilica",
    "description": "Ukrainian President Volodymyr Zelensky and US President Donald Trump have met inside St Peter's Basilica ahead of Pope Francis' funeral. The White House described the 15-minute meeting as \"very productive\" and Zelensky later called it \"very symbolic\" with the…",
    "link": "https://freerepublic.com/focus/f-news/4313385/posts",
    "timestamp": "2025-04-26T13:27:10Z"
  },
  {
    "title": "A simple ceremony and a powerful homily: Pope Francis funeral held a moral mirror to modern politics",
    "description": "Even in death, Pope Francis’ moral voice rang out across the world.",
    "link": "https://www.nbcnews.com/world/the-vatican/simple-ceremony-powerful-homily-pope-francis-funeral-morality-politics-rcna203132",
    "timestamp": "2025-04-26T13:25:36Z"
  },
  {
    "title": "Latino voters abandon Donald Trump in droves as immigration crackdown sparks feelings of betrayal across communities",
    "description": "As Trump nears 100 days back in office, his Latino support collapses due to immigration policies. A recent Pew poll reveals a 72% disapproval rate among Latinos, fueled by actions like revoking TPS for Venezuelans. Despite past gains in Florida, many Latinos …",
    "link": "https://economictimes.indiatimes.com/news/international/us/latino-voters-abandon-donald-trump-in-droves-as-immigration-crackdown-sparks-feelings-of-betrayal-across-communities/articleshow/120647029.cms",
    "timestamp": "2025-04-26T13:20:44Z"
  },
  {
    "title": "Sen. Chris Murphy's 'emergency' message about Trump is connecting with Democratic voters",
    "description": "Chris Murphy has been touring the country talking to voters, and some people are starting to view the Democratic senator from Connecticut as worthy of the national spotlight",
    "link": "https://abcnews.go.com/US/wireStory/sen-chris-murphys-emergency-message-trump-connecting-democratic-121194847",
    "timestamp": "2025-04-26T13:18:26Z"
  },
  {
    "title": "Woman who said she survived Jeffrey Epstein abuse commits suicide",
    "description": "Became a leading voice against the billionaire",
    "link": "https://www.wnd.com/2025/04/woman-who-said-she-survived-jeffrey-epstein-abuse-commits-suicide/",
    "timestamp": "2025-04-26T13:18:17Z"
  },
  {
    "title": "Mark Cuban Lays Out a Best-Case Scenario for Tariffs and the Economy — What Americans Should Know",
    "description": "The last two months have seen tariff policies changing so fast that most Americans just can’t keep up with them.\nAs of this writing, President Donald Trump has imposed blanket 10% tariffs on imports from most countries. China remains an exception, with tariff…",
    "link": "https://biztoc.com/x/bdde8c18a46dcef8",
    "timestamp": "2025-04-26T13:18:09Z"
  },
  {
    "title": "Nuclear talks may empower, embolden Iran if US isn't careful",
    "description": "Without these considerations, the US risks unintentionally accelerating a new Cold War in the Middle East.",
    "link": "https://www.jpost.com/opinion/article-851442",
    "timestamp": "2025-04-26T13:11:45Z"
  },
  {
    "title": "Trump gets front row seat to humiliation as attacked in Pope's homily",
    "description": "Donald Trump got a front row seat to his own humiliation Saturday as he was verbally attacked in a homily at Pope Francis’ funeral.Trump, who traveled to Rome Friday, sat with world leaders at the service as his signature policy was rebuked to an audience of …",
    "link": "https://www.rawstory.com/trump-pope-2671849474/",
    "timestamp": "2025-04-26T13:11:07Z"
  },
  {
    "title": "Amazon and Nvidia say all options are on the table to power AI including fossil fuels",
    "description": "The tech companies have invested mostly in renewable power, but they are now navigating a changed political environment.",
    "link": "https://www.cnbc.com/2025/04/26/amazon-nvidia-say-all-options-on-the-table-to-power-ai-including-fossil-fuels.html",
    "timestamp": "2025-04-26T13:08:15Z"
  },
  {
    "title": "Russia says retook Kursk from Ukraine with North Korean help",
    "description": "The Russian army has fully liberated the border Kursk region from Ukrainian control with the help of North Korean soldiers, Chief of Staff Valery Gerasimov said on Saturday, admitting their participation in the conflict for the first time. Gerasimov especiall…",
    "link": "https://www.digitaljournal.com/world/russia-says-retook-kursk-from-ukraine-with-north-korean-help/article",
    "timestamp": "2025-04-26T13:07:20Z"
  },
  {
    "title": "Bill Maher calls out Al Gore for comparing Trump administration to Nazis",
    "description": "\"Real Time\" host Bill Maher pressed former Vice President Al Gore for comparing the Trump administration to Nazis, telling him it's a \"hard word to use with nuance.\"",
    "link": "https://www.foxnews.com/media/bill-maher-calls-out-al-gore-comparing-trump-administration-nazis",
    "timestamp": "2025-04-26T13:06:49Z"
  },
  {
    "title": "Melania Trump Favors Dolce & Gabbana for Pope Francis’ Funeral",
    "description": "Dozens of world dignitaries attended the funeral in Rome Saturday, which attracted an estimated crowd of 250,000 people.",
    "link": "http://wwd.com/fashion-news/fashion-scoops/melania-trump-pope-francis-funeral-dolce-gabbana-1237104903/",
    "timestamp": "2025-04-26T13:06:27Z"
  },
  {
    "title": "Carney vows \"Fight\" as Trump floats Canada as 51st state",
    "description": "Liberal Leader Carney fiercely rejected Trump's suggestion of Canada becoming a U.S. state, pledging resistance. Trump's comments, claiming U.S. \"support\" and dismissing Canadian trade, sparked outrage. Carney emphasized Canadian sovereignty, highlighting a s…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/carney-vows-fight-as-trump-floats-canada-as-51st-state/articleshow/120647106.cms",
    "timestamp": "2025-04-26T13:05:04Z"
  },
  {
    "title": "Exclusive: Rep. Derrick Van Orden — 'Constitutional Crisis' Looms over Rogue Judges",
    "description": "The U.S. is \"rapidly closing in on a very serious constitutional crisis\" as judges and courts swoop in to halt the Trump agenda, Rep. Derrick Van Orden (R-WI) said during an appearance on Breitbart News Daily.\nThe post Exclusive: Rep. Derrick Van Orden — ‘Con…",
    "link": "https://www.breitbart.com/radio/2025/04/26/exclusive-rep-derrick-van-orden-were-rapidly-closing-in-on-a-very-serious-constitutional-crisis-as-courts-block-progress/",
    "timestamp": "2025-04-26T13:04:37Z"
  },
  {
    "title": "Maggie Haberman Says Trump Not ‘Especially Well-Versed’ In Christianity Ahead Of Pope Funeral",
    "description": "Maggie Haberman told Anderson Cooper that Trump is not \"especially well versed\" in Christianity ahead of his attendance at the funeral of Pope Francis.\nThe post Maggie Haberman Says Trump Not ‘Especially Well-Versed’ In Christianity Ahead Of Pope Funeral firs…",
    "link": "https://www.mediaite.com/news/maggie-haberman-says-trump-not-especially-well-versed-in-christianity-ahead-of-pope-funeral/",
    "timestamp": "2025-04-26T13:03:53Z"
  },
  {
    "title": "Trump Just Gave A Middle Finger To The U.S. Tourism Industry",
    "description": "Donald Trump was asked this week by a reporter about the steep drop-off in international travel to the United States. As NBC reported, Goldman Sachs “recently estimated that under a worst-case scenario, the U.S. stands to lose as much as $90 billion in revenu…",
    "link": "https://crooksandliars.com/2025/04/trump-just-gave-middle-finger-us-tourism",
    "timestamp": "2025-04-26T13:02:59Z"
  },
  {
    "title": "World Bank President Urges Developing Nations to Sign Trade Deals With Trump",
    "description": "(AFP) — Developing countries should strike swift trade deals with the United States at the “earliest possible” opportunity, the president of the World Bank told AFP Friday, after a busy week with global financial leaders in Washington. Ajay Banga was intervie…",
    "link": "https://freerepublic.com/focus/f-news/4313379/posts",
    "timestamp": "2025-04-26T13:02:35Z"
  },
  {
    "title": "Mutual Funds line up passive NFOs to beat bearish market sentiments",
    "description": "One of the top five fund houses, Nippon India MF has lined up two NFOs on Nifty 500 Low Volatility 50 index and Nifty 500 Quality 50 index",
    "link": "https://www.thehindubusinessline.com/markets/mutual-funds-line-up-passive-nfos-to-beat-bearish-market-sentiments/article69494332.ece",
    "timestamp": "2025-04-26T13:01:36Z"
  },
  {
    "title": "California’s economy overtakes Japan",
    "description": "California’s economy has surged past Japan’s, fueled by tech and clean energy, while the Asian nation faces headwinds Read Full Article at RT.com",
    "link": "https://www.rt.com/business/616351-california-replaces-japan-gdp/",
    "timestamp": "2025-04-26T13:01:13Z"
  },
  {
    "title": "Are These Disney World Attractions in Danger of Closing?",
    "description": "Will these iconic Disney World rides be next up on the chopping block? Related: Why We Always Skip These Popular Disney World Rides The Disney theme parks are full of incredible rides and attractions, some of which have become larger than the parks themselves…",
    "link": "https://insidethemagic.net/2025/04/are-these-disney-world-rides-in-danger-of-closing-ld1/",
    "timestamp": "2025-04-26T13:00:51Z"
  },
  {
    "title": "Here’s what happened during Trump’s 14th week in office",
    "description": "Trump met with Norwegian Prime Minister Jonas Gahr Store at the White House on Thursday, where he said that he and other allies are trying to wrap up a deal between Moscow and Kyiv in the near future.",
    "link": "https://www.foxnews.com/politics/heres-what-happened-during-trumps-14th-week-office",
    "timestamp": "2025-04-26T13:00:21Z"
  },
  {
    "title": "No $300,000 Requirement: TRUMP Memecoin Team Clarifies Dinner Invite Misunderstanding",
    "description": "The TRUMP Memecoin team has clarified some misconceptions about the potential surprises at an upcoming dinner hosted by US President Donald Trump and addressed rumors about the alleged requirements for an invitation to the event. Related Reading: Linked To IC…",
    "link": "https://bitcoinist.com/no-300000-requirement-trump-memecoin-team-clarifies-dinner-invite-misunderstanding/",
    "timestamp": "2025-04-26T13:00:08Z"
  },
  {
    "title": "Why is Trump Going to the Funeral of a Pope He Didn’t Like?",
    "description": "Kevin Cullen of the Boston Globe asked why Trump and Melania are attending the funeral of Pope Francis, since the two men disagreed about almost everything. He thinks it is Trump’s way of consoling his Catholic base. The Pope and Trump exchanged harsh words. …",
    "link": "https://dianeravitch.net/2025/04/26/why-is-trump-going-to-the-funeral-of-a-pope-he-didnt-like/",
    "timestamp": "2025-04-26T13:00:00Z"
  },
  {
    "title": "Yes, Bernie Sanders and AOC used private plane for part of 'Fighting Oligarchy' tour",
    "description": "U.S. Sen. Bernie Sanders and U.S. Rep. Alexandria Ocasio-Cortez used a private jet to travel between Bakersfield and Sacramento, California, during their \"Fighting Oligarchy tour.\"",
    "link": "https://www.snopes.com//fact-check/bernie-sanders-aoc-private-plane-oligarchy-tour/",
    "timestamp": "2025-04-26T13:00:00Z"
  },
  {
    "title": "‘I Was Taken Hostage’: How an American Metal Rocker Landed in Russian Prison",
    "description": "Travis Leake left California for a new life in Moscow. Then he was arrested, accused of dealing drugs. Over the last few months, he's written letters to Rolling Stone telling his side of the story",
    "link": "http://www.rollingstone.com/music/music-features/travis-leake-american-rocker-in-russian-prison-1235323629/",
    "timestamp": "2025-04-26T13:00:00Z"
  },
  {
    "title": "Trump's Attorney General Declares War On The Courts",
    "description": "Attorney General Pam Bondi performed like a Newsmax host on Fox News, claiming judges ruling against Trump are deranged. \nThat was the message Pam Bondi sent out to all judges that dare to rule against Demented Donald.\nThe Attorney General is supposed to repr…",
    "link": "https://crooksandliars.com/2025/04/trumps-attorney-general-declares-war",
    "timestamp": "2025-04-26T12:58:52Z"
  },
  {
    "title": "'Everything is stuck': US companies say 'buyers disappeared overnight' due to Trump policy",
    "description": "'Everything is stuck': US companies say 'buyers disappeared overnight' due to Trump policy\nThe New York Times reports American businesses like Ramper Innovations, a manufacturer of airplane equipment, are paralyzed under President Donald Trump’s self-inflicte…",
    "link": "https://biztoc.com/x/9336221989070b34",
    "timestamp": "2025-04-26T12:55:39Z"
  },
  {
    "title": "Fears Trump’s deep-sea mining order will irreparably harm ecosystems",
    "description": "Environment groups say Thursday order ignores effort to adopt rules to prevent harmful mining of ocean floor\nEnvironmental groups are decrying an executive order signed by Donald Trump to expedite deep-sea mining for minerals, saying it could irreparably harm…",
    "link": "https://biztoc.com/x/8dd2d853475595f1",
    "timestamp": "2025-04-26T12:55:34Z"
  },
  {
    "title": "Trump Unleashes More Anger, Frustration At Zelensky For Not Signing Rare Earths Deal",
    "description": "Trump Unleashes More Anger, Frustration At Zelensky For Not Signing Rare Earths Deal\n \nOn Friday there's been more public, out in the open tension on display between Presidents Donald Trump and Volodymyr Zelensky. Trump once again chastised the Ukrainian lead…",
    "link": "https://biztoc.com/x/6e206fa14d002f26",
    "timestamp": "2025-04-26T12:55:33Z"
  },
  {
    "title": "Key moments from Pope Francis' funeral",
    "description": "Pope Francis was laid to rest Saturday in Rome, with more than 250,000 people -- including President Donald Trump -- mourning his passing.",
    "link": "https://abcnews.go.com/International/key-moments-pope-francis-funeral-mourners-bid-farewell/story?id=121188864",
    "timestamp": "2025-04-26T12:52:34Z"
  },
  {
    "title": "Trump-Zelensky follow-up meeting in Rome did not happen: Zelenskiy's office",
    "description": "U.S. President Donald Trump and Ukrainian leader Volodymyr Zelenskiy did not have a second meeting in Rome after their encounter in the Vatican on Saturday, a spokesman for Zelenskiy said. Earlier, the spokesman said the leaders agreed when they met to have a…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-zelenskiy-follow-up-meeting-in-rome-did-not-happen-zelenskiys-office/articleshow/120646954.cms",
    "timestamp": "2025-04-26T12:52:24Z"
  },
  {
    "title": "China hits out at 'extreme selfishness' of tariffs",
    "description": "BEIJING: China's foreign minister has hit out at the \"extreme selfishness\" of tariffs, hinting at the steep levies imposed on Beijing by US President Donald Trump. \"Certain countries\" resort to \"pressure and coercion, and trigger unjustified trade wars ... Th…",
    "link": "https://www.channelnewsasia.com/east-asia/trade-war-tariffs-china-hits-out-extreme-selfishness-us-trump-5091491",
    "timestamp": "2025-04-26T12:50:57Z"
  },
  {
    "title": "Russia says retook Kursk from Ukraine with North Korean help",
    "description": "The Russian army has fully liberated the border Kursk region from Ukrainian control with the help of North Korean soldiers, Chief of Staff Valery Gerasimov...",
    "link": "https://www.yahoo.com/news/russia-says-retook-kursk-ukraine-125020455.html",
    "timestamp": "2025-04-26T12:50:20Z"
  },
  {
    "title": "Where Trump, other leaders sat at Pope Francis' funeral",
    "description": "With delegations from about 130 countries present at Pope Francis' funeral, the seating chart needed to be organized accordingly.",
    "link": "https://www.cbsnews.com/news/where-trump-world-leaders-seated-pope-francis-funeral/?ftag=YHF4eb9d17",
    "timestamp": "2025-04-26T12:49:53Z"
  },
  {
    "title": "Trump, Zelensky Meet On Sidelines Of Pope's Funeral",
    "description": "Donald Trump and Volodymyr Zelensky met briefly in the hush of St Peter's basilica on the sidelines of Pope Francis's funeral on Saturday in their first encounter since a noisy White House clash, as the US president pushes the Ukrainian leader to make a peace…",
    "link": "https://www.ibtimes.com/trump-zelensky-meet-sidelines-popes-funeral-3771499",
    "timestamp": "2025-04-26T12:48:23Z"
  },
  {
    "title": "Trump, Zelensky Meet On Sidelines Of Pope's Funeral",
    "description": "Donald Trump and Volodymyr Zelensky met briefly in the hush of St Peter's basilica on the sidelines of Pope Francis's funeral on Saturday in their first encounter since a noisy White House clash, as the US president pushes the Ukrainian leader to make a peace…",
    "link": "https://www.ibtimes.com.au/trump-zelensky-meet-sidelines-popes-funeral-1858266",
    "timestamp": "2025-04-26T12:48:17Z"
  },
  {
    "title": "Trump and EU's von der Leyen agree to meet, says European Commission",
    "description": "BRUSSELS (Reuters) - U.S President Donald Trump and European Commission President Ursula von der Leyen agreed on Saturday during a short exchange on the sidelines of Pope Francis' funeral to meet at a later stage, von der Leyen's spokesperson said. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/04/26/trump-and-eu039s-von-der-leyen-agree-to-meet-says-european-commission",
    "timestamp": "2025-04-26T12:47:00Z"
  },
  {
    "title": "3 House Republicans from Florida with Cuban roots carefully navigate Trump's immigration policies",
    "description": "Three House Republicans from Florida with Cuban roots are carefully navigating President Donald Trump’s immigration policies",
    "link": "https://abcnews.go.com/Politics/wireStory/3-house-republicans-florida-cuban-roots-carefully-navigate-121194319",
    "timestamp": "2025-04-26T12:46:27Z"
  },
  {
    "title": "Zelensky Says Meeting With Trump in Vatican Potentially ‘Historic’",
    "description": "Ukrainian leader Volodymyr Zelensky proclaimed that his meeting with U.S. President Donald Trump on the sidelines of the funeral for Pope Francis has the “potential to become historic”. Zelensky met with President Trump in St Peter’s Basilica in the Vatican a…",
    "link": "https://freerepublic.com/focus/f-news/4313375/posts",
    "timestamp": "2025-04-26T12:45:57Z"
  },
  {
    "title": "Gold price prediction: Gold rate to crash soon, claims top gold miner",
    "description": "Gold rate has gained nearly 26 per cent so far this year. The US dollar, meanwhile, rose and was on track for its first weekly gain since March.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-gold-rate-to-crash-soon-claims-top-gold-miner/articleshow/120646837.cms",
    "timestamp": "2025-04-26T12:44:04Z"
  },
  {
    "title": "Trump and Zelenskyy meet at Vatican ahead of pope's funeral",
    "description": "President Donald Trump and Ukrainian President Volodymyr Zelenskyy met ahead of the ceremony for Pope Francis' funeral to discuss the Russian-Ukrainian war. It was the first in-person encounter since their clash in the Oval Office in February. NBC’s Anne Thom…",
    "link": "https://www.today.com/video/trump-zelenskyy-meet-at-vatican-before-pope-francis-funeral-238400069719",
    "timestamp": "2025-04-26T12:42:12Z"
  },
  {
    "title": "Zelensky Says Meeting With Trump in Vatican Potentially 'Historic'",
    "description": "Ukrainian leader Volodymyr Zelensky proclaimed that his meeting with U.S. President Donald Trump on the sidelines of the funeral for Pope Francis has the \"potential to become historic”.\nThe post Zelensky Says Meeting With Trump in Vatican Potentially ‘Histori…",
    "link": "https://www.breitbart.com/europe/2025/04/26/zelensky-says-meeting-with-trump-in-vatican-potentially-historic/",
    "timestamp": "2025-04-26T12:39:59Z"
  },
  {
    "title": "Donald Trump Meets With Volodymyr Zelenskyy At Pope Francis’ Funeral",
    "description": "It was the first face-to-face conversation between Trump and the Ukrainian leader since the two, along with JD Vance, argued during a heated Oval Office meeting in late February.",
    "link": "https://www.huffpost.com/entry/donald-trump-meets-volodymyr-zelenskyy-pope-francis-funeral_n_680cd19ce4b02c05f6f39f7b",
    "timestamp": "2025-04-26T12:39:42Z"
  },
  {
    "title": "Trump, Macron exchange firm handshake during ‘sign of peace’ at Pope Francis’ funeral",
    "description": "President Trump and French President Emmanuel Macron exchanged their infamous, firm handshake during Pope Francis' funeral on Saturday.",
    "link": "https://nypost.com/2025/04/26/us-news/trump-and-macron-shake-hands-at-pope-francis-funeral/",
    "timestamp": "2025-04-26T12:38:45Z"
  }
]