[
  {
    "title": "Dem Rep. Gomez: 'Not Acceptable' to Have $175 Billion to Boost ICE, CBP, We're Going to Try to 'Take That Money Away'",
    "description": "On Wednesday’s “CNN News Central,” Rep. Jimmy Gomez (D-CA) stated that President Donald Trump “passed $175 billion in his one big, beautiful bill, which is basically a slush fund that he’s going to use to build up ICE and CBP\nThe post Dem Rep. Gomez: ‘Not Acc…",
    "link": "https://www.breitbart.com/clips/2025/10/22/dem-rep-gomez-not-acceptable-to-have-175-billion-to-boost-ice-cbp-were-going-to-try-to-take-that-money-away/",
    "timestamp": "2025-10-23T02:48:40Z"
  },
  {
    "title": "Kaitlan Collins Confronts Speaker Johnson With Brutal Comment About Him From Marjorie Taylor Greene",
    "description": "CNN's Kaitlan Collins read some unflattering comments to Speaker Mike Johnson from Rep. Marjorie Taylor Greene about the ongoing government shutdown.\nThe post Kaitlan Collins Confronts Speaker Johnson With Brutal Comment About Him From Marjorie Taylor Greene …",
    "link": "https://www.mediaite.com/media/news/kaitlan-collins-confronts-speaker-johnson-with-brutal-comment-about-him-from-marjorie-taylor-greene/",
    "timestamp": "2025-10-23T02:47:10Z"
  },
  {
    "title": "Mamdani, Cuomo clash in final NYC mayoral debate: Key takeaways",
    "description": "Mamdani attacked over affordability platform, support for Palestine; Cuomo challenged on sexual harassment.",
    "link": "https://www.aljazeera.com/news/2025/10/23/mamdani-cuomo-clash-in-final-nyc-mayoral-debate-key-takeaways",
    "timestamp": "2025-10-23T02:37:57Z"
  },
  {
    "title": "'That's not how ethics works!' Dem erupts at GOP strategist on CNN over Trump ballroom",
    "description": "A pair of Democrats bashed a GOP strategist on CNN on Tuesday night after the strategist defended President Donald Trump's ballroom renovation project at the White House, which they argued needed more oversight. Rep. Sara Jacobs (D-CA) and Rep. Tom Suozzi (D-…",
    "link": "https://www.rawstory.com/trump-ballroom-2674224701/",
    "timestamp": "2025-10-23T02:37:56Z"
  },
  {
    "title": "A New Energy Storage Solution For Wind & Solar: Floating “Water Batteries”",
    "description": "A new, floating pumped hydropower system aims to cut the cost of utility-scale energy storage for wind and solar farms.\nThe post A New Energy Storage Solution For Wind & Solar: Floating “Water Batteries” appeared first on CleanTechnica.",
    "link": "https://cleantechnica.com/2025/10/22/a-new-energy-storage-solution-for-wind-solar-floating-water-batteries/",
    "timestamp": "2025-10-23T02:35:32Z"
  },
  {
    "title": "Trump, Colombia leader trade threats as US strikes boats in Pacific",
    "description": "WASHINGTON: President Donald Trump and his Colombian counterpart Gustavo Petro traded angry threats on Wednesday (Oct 22) as the United States announced strikes on two alleged drug-smuggling boats in the Pacific Ocean that left five people dead.Trump branded …",
    "link": "https://www.channelnewsasia.com/world/trump-colombia-leader-trade-threats-us-strikes-boats-in-pacific-5418571",
    "timestamp": "2025-10-23T02:35:00Z"
  },
  {
    "title": "Oil Jumps as Trump Steps Up Pressure on Russia With Sanctions",
    "description": "Oil surged after the US announced sanctions on Russia’s biggest producers, as President Donald Trump ramps up pressure on his counterpart Vladimir Putin to negotiate an end to the war in Ukraine.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-jumps-as-trump-steps-up-pressure-on-russia-with-sanctions",
    "timestamp": "2025-10-23T02:33:50Z"
  },
  {
    "title": "John Fetterman Slams Kamala Harris on Fox News: ‘Lost the Plot’ When She Called Trump a ‘Fascist’",
    "description": "Sen. John Fetterman (D-PA) said former Vice President Kamala Harris \"lost the plot\" and made a big mistake when she called Donald Trump a \"fascist\" in 2024\nThe post John Fetterman Slams Kamala Harris on Fox News: ‘Lost the Plot’ When She Called Trump a ‘Fasci…",
    "link": "https://www.mediaite.com/media/john-fetterman-slams-kamala-harris-on-fox-news-lost-the-plot-when-she-called-trump-a-fascist/",
    "timestamp": "2025-10-23T02:29:41Z"
  },
  {
    "title": "Celebrating 250 years of Lucknow’s legacy: Stone, steel and struggle; iconic bridges on Gomti",
    "description": "Lucknow's bridges over the Gomti river are more than just crossings; they are silent witnesses to the city's rich history, from nawabi grandeur to British rule and modern resilience. These structures, like the Stone Bridge and Pucca Pul, have facilitated conn…",
    "link": "https://timesofindia.indiatimes.com/city/lucknow/celebrating-250-years-of-lucknows-legacy-stone-steel-and-struggle-iconic-bridges-on-gomti/articleshow/124751164.cms",
    "timestamp": "2025-10-23T02:29:32Z"
  },
  {
    "title": "Barbs fly as Mamdani and Cuomo meet in final, furious New York mayoral debate",
    "description": "There was no holding back as the three leading candidates for mayor met in a final push to win votes.",
    "link": "https://www.bbc.com/news/articles/cwy1nyj7j21o",
    "timestamp": "2025-10-23T02:28:27Z"
  },
  {
    "title": "Cleveland Cavaliers vs New York Knicks (22-10-2025): Box score, player stats, game summary and more",
    "description": "The New York Knicks secured an 8-point victory over the Cleveland Cavaliers with a final score of 119-111. Despite a strong third-quarter comeback by the Cavaliers, led by Donovan Mitchell's 31 points, the Knicks dominated the fourth quarter to clinch the win…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/cleveland-cavaliers-vs-new-york-knicks-22-10-2025-box-score-player-stats-game-summary-and-more/articleshow/124751067.cms",
    "timestamp": "2025-10-23T02:21:50Z"
  },
  {
    "title": "Gold eases as dollar firms, focus on US inflation data",
    "description": "Gold prices dipped slightly on Thursday as a stronger dollar and anticipation of key U.S. inflation data influenced investor sentiment. Markets are closely watching the upcoming CPI report for clues on the Federal Reserve's interest rate trajectory, with a ra…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-eases-as-dollar-firms-focus-on-us-inflation-data/articleshow/124751106.cms",
    "timestamp": "2025-10-23T02:21:02Z"
  },
  {
    "title": "Democratic National Committee STILL Struggling to Pay Off Kamala Harris Campaign Debt Nearly a Year Later",
    "description": "The Democratic National Committee (DNC) is still struggling to repay Kamala Harris’s campaign debt almost a year after the 2024 election.\nThe post Democratic National Committee STILL Struggling to Pay Off Kamala Harris Campaign Debt Nearly a Year Later appear…",
    "link": "https://www.thegatewaypundit.com/2025/10/democratic-national-committee-still-struggling-pay-kamala-harris/",
    "timestamp": "2025-10-23T02:20:54Z"
  },
  {
    "title": "Mamdani attacked for refusing to take position on housing questions in NYC mayor debate",
    "description": "Independent candidate Andrew Cuomo, Democrat Zohran Mamdani and Republican Curtis Sliwa participated in the final debate of the general election for mayor.\n \n\nRepublican Curtis Sliwa and independent Andrew Cuomo pounced when the Democratic frontrunner said he…",
    "link": "https://gothamist.com/news/mamdani-attacked-for-refusing-to-take-position-on-housing-questions-in-nyc-mayor-debate",
    "timestamp": "2025-10-23T02:19:00Z"
  },
  {
    "title": "Woman arrested at 'No Kings' protest; accused of snatching man's flag, deputy says [TDS AWFL got triggered]",
    "description": "INDIAN RIVER COUNTY – A St. Lucie County woman was arrested and charged with robbery by sudden snatching without a firearm or weapon at a weekend 'No Kings' protest near Vero Beach. Deputies said the 73-year-old approached a pro-Trump protester and attempted …",
    "link": "https://freerepublic.com/focus/f-chat/4348064/posts",
    "timestamp": "2025-10-23T02:18:28Z"
  },
  {
    "title": "Prime Minister Mark Carney says Canada will double its non-US exports as Canadians can’t rely on US",
    "description": "Prime Minister Mark Carney set a goal for Canada to double its non-U.S. exports in the next decade, saying American tariffs are causing a chill in investment. Carney, who will release his government’s budget on Nov. 4, said Wednesday many of Canada’s former s…",
    "link": "https://freerepublic.com/focus/f-news/4348063/posts",
    "timestamp": "2025-10-23T02:17:43Z"
  },
  {
    "title": "Trump administration in talks to take stakes in quantum-computing firms: Report",
    "description": "Companies including IonQ, Rigetti Computing and D-Wave Quantum are discussing the government becoming a shareholder as part of the agreements.",
    "link": "https://indianexpress.com/article/world/trump-administration-talks-take-stakes-in-quantum-computing-firms-10321750/",
    "timestamp": "2025-10-23T02:17:32Z"
  },
  {
    "title": "Oil prices extend gains as US sanctions Russia's Rosneft, Lukoil",
    "description": "Oil prices surged over $1 per barrel as the U.S. imposed sanctions on Russian oil giants Rosneft and Lukoil, citing their funding of the Ukraine war. This action follows similar measures by Britain and a new EU sanctions package banning Russian LNG imports.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-extend-gains-as-us-sanctions-russias-rosneft-lukoil/articleshow/124751056.cms",
    "timestamp": "2025-10-23T02:16:13Z"
  },
  {
    "title": "Elon Musk said Tesla's robot will be 'incredible surgeon,' left Wall Street with no guidance on EVs",
    "description": "In Tesla's quarter earnings call, Elon Musk and other executives talked a lot about the future but said little about the core business.",
    "link": "https://www.cnbc.com/2025/10/22/elon-musk-touted-robotaxi-optimus-not-ev-demand-in-tesla-earnings.html",
    "timestamp": "2025-10-23T02:14:28Z"
  },
  {
    "title": "Wall Street ends lower on mixed earnings, revived US-China trade tensions",
    "description": "Wall Street dipped as mixed earnings, notably Netflix's miss, and potential U.S. export curbs on China-bound tech goods soured investor mood. Tech and communication stocks led the decline. Despite some disappointing corporate results, overall earnings season …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-on-mixed-earnings-revived-us-china-trade-tensions/articleshow/124751038.cms",
    "timestamp": "2025-10-23T02:13:42Z"
  },
  {
    "title": "The clock is ticking for Rohit Sharma and Virat Kohli in India’s must-win Adelaide ODI",
    "description": "India faces a must-win ODI in Adelaide amidst rain disruptions and bowling concerns due to Bumrah and Pandya's absence. Rohit Sharma's form is under scrutiny, but batting coach Kotak expresses confidence. The team grapples with finding the right bowling combi…",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/india-vs-australia/the-clock-is-ticking-for-rohit-sharma-and-virat-kohli-in-indias-must-win-adelaide-odi/articleshow/124751014.cms",
    "timestamp": "2025-10-23T02:12:45Z"
  },
  {
    "title": "Celebrating 250 years of Lucknow’s legacy: Kothis & Mahals with window to the world",
    "description": "Lucknow's architecture showcases a rich tapestry of global influences, from Mughal grandeur and Nawabi elegance to French Gothic and British colonial styles. Claude Martin and Walter Burley Griffin left significant imprints, blending European designs with loc…",
    "link": "https://timesofindia.indiatimes.com/city/lucknow/celebrating-250-years-of-lucknows-legacy-kothis-mahals-with-window-to-the-world/articleshow/124750827.cms",
    "timestamp": "2025-10-23T02:09:37Z"
  },
  {
    "title": "NATO Secretary-General Mark Rutte endorses Trump's approach to ending Ukraine war after White House talks",
    "description": "Nato Secretary-General Mark Rutte says pressure and sanctions are changing Vladimir Putin's calculus as Russia deals with heavy military losses in Ukraine as the war continues.",
    "link": "https://www.foxnews.com/media/nato-secretary-general-mark-rutte-endorses-trumps-approach-ending-ukraine-war-after-white-house-talks",
    "timestamp": "2025-10-23T02:07:33Z"
  },
  {
    "title": "Trump administration in talks to take stakes in quantum-computing firms, WSJ reports",
    "description": "U.S. President Donald Trump's administration is in talks with several quantum-computing companies to take equity stakes in exchange for federal funding, the Wall Street Journal reported on Wednesday, citing people familiar with the matter. Companies including…",
    "link": "https://www.channelnewsasia.com/business/trump-administration-in-talks-take-stakes-in-quantum-computing-firms-wsj-reports-5419356",
    "timestamp": "2025-10-23T02:07:29Z"
  },
  {
    "title": "Trump administration in talks to take stakes in quantum-computing firms, WSJ reports",
    "description": "President Donald Trump's administration is in talks with several quantum-computing companies to take equity stakes in exchange for federal funding, the Wall ...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-talks-stakes-quantum-020729894.html",
    "timestamp": "2025-10-23T02:07:29Z"
  },
  {
    "title": "6 Takeaways From Second NYC Mayoral Debate",
    "description": "Three candidates entered the ring for the second time in the New York City mayoral race Wednesday night in one of the most closely watched... Read More\nThe post 6 Takeaways From Second NYC Mayoral Debate appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/22/6-takeaways-from-second-nyc-mayoral-debate/",
    "timestamp": "2025-10-23T02:05:18Z"
  },
  {
    "title": "Trump says US has not approved Ukraine's use of long-range missiles",
    "description": "Former President Donald Trump refuted a Wall Street Journal report claiming the U.S. approved Ukraine's use of long-range missiles deep into Russia. Trump stated on Truth Social that the U.S. has no involvement with these missiles or Ukraine's actions concern…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-us-has-not-approved-ukraines-use-of-long-range-missiles/articleshow/124750958.cms",
    "timestamp": "2025-10-23T02:05:13Z"
  },
  {
    "title": "Tesla's Profit Tumbles After Costs Undermine Record EV Sales",
    "description": "Tesla Inc.’s profit plunged as rising costs undercut a record quarter of vehicle sales, exposing strains on its operations while Chief Executive Officer Elon Musk shifts focus away from the automotive business.",
    "link": "https://www.ndtvprofit.com/auto/teslas-profit-tumbles-after-costs-undermine-record-ev-sales-2",
    "timestamp": "2025-10-23T02:04:30Z"
  },
  {
    "title": "Indiana Senate Republicans short of votes to redraw congressional maps",
    "description": "Indiana Senate Republicans say they do not have the votes to redraw the state congressional maps. That is according to a spokesperson for the Indiana Senate president pro tempore Rodric Bray. The statement came after months of debate on whether Indiana would …",
    "link": "https://freerepublic.com/focus/f-news/4348057/posts",
    "timestamp": "2025-10-23T02:03:25Z"
  },
  {
    "title": "How Israel won the war – and lost the PR battle",
    "description": "Regardless of the ultimate outcome of the Gaza peace deal brokered by Donald Trump, the past two years have seen Israel achieve an unprecedented litany of military accomplishments in the Middle East. The level of damage done to Hamas, Hezbollah and the Houthi…",
    "link": "https://freerepublic.com/focus/f-news/4348056/posts",
    "timestamp": "2025-10-23T02:02:12Z"
  },
  {
    "title": "Zohran Mamdani and Andrew Cuomo trade insults in final NYC mayoral debate",
    "description": "Zohran Mamdani and Andrew Cuomo clashed Wednesday in a final New York City mayoral debate that put on full display their personal animosity and their array of disagreements on both city and national issues",
    "link": "https://www.nbcnews.com/politics/elections/zohran-mamdani-andrew-cuomo-trade-insults-final-nyc-mayoral-debate-rcna238680",
    "timestamp": "2025-10-23T02:00:14Z"
  },
  {
    "title": "Liz Truss thinks Green Party could be Britain’s next official opposition",
    "description": "The former PM says Britain must learn from America's MAGA movement — but insists she won't be joining Reform UK, for now.",
    "link": "https://www.politico.eu/article/liz-truss-politics-uk-reform-party-labour-rachel-reeves-nigel-farage/",
    "timestamp": "2025-10-23T02:00:00Z"
  },
  {
    "title": "Federal agents sent to San Francisco area and mayor says it's meant to incite 'chaos and violence'",
    "description": "The U.S. Coast Guard has announced it is providing a base for U.S. Customs and Border Protection agents in the San Francisco area",
    "link": "https://abcnews.go.com/Politics/wireStory/federal-agents-san-francisco-area-mayor-meant-incite-126780927",
    "timestamp": "2025-10-23T01:57:30Z"
  },
  {
    "title": "Flush With Cash, US Immigration Agency Expands Weaponry And Surveillance",
    "description": "The agency overseeing Donald Trump's aggressive immigration crackdown is spending tens of millions of dollars on guns, ammunition, body armor and surveillance technology, according to procurement records reviewed by AFP.\nSpending across the categories is vast…",
    "link": "https://www.ibtimes.com/flush-cash-us-immigration-agency-expands-weaponry-surveillance-3788096",
    "timestamp": "2025-10-23T01:57:10Z"
  },
  {
    "title": "Blumenthal Calls White House Ballroom Construction 'Lawlessness'",
    "description": "Wednesday on MSNBC's \"Deadline,\" Sen. Richard Blumenthal (D-CT) said President Donald Trump's construction of a ballroom at the White House was \"lawlessness\" that warranted an investigation.\nThe post Blumenthal Calls White House Ballroom Construction ‘Lawless…",
    "link": "https://www.breitbart.com/clips/2025/10/22/blumenthal-calls-white-house-ballroom-construction-lawlessness/",
    "timestamp": "2025-10-23T01:56:50Z"
  },
  {
    "title": "Hegseth says US conducted another strike in Eastern Pacific targeting alleged narco-traffickers",
    "description": "Pentagon chief Pete Hegseth said on Wednesday that the U.S. military has carried out another strike in the Eastern Pacific targeting alleged narco-terrorists.",
    "link": "https://www.foxnews.com/world/hegseth-says-us-conducted-another-strike-eastern-pacific-targeting-alleged-narco-traffickers",
    "timestamp": "2025-10-23T01:56:36Z"
  },
  {
    "title": "Trump set to meet Chinese President Xi Jinping in South Korea; discuss Russia-Ukraine war",
    "description": "Trump announced an upcoming diplomatic trip to Malaysia, South Korea, and Japan, including a significant meeting with Chinese President Xi Jinping. Trump also cancelled a planned summit with Russian President Vladimir Putin, citing a lack of progress and expr…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-set-to-meet-chinese-president-xi-jinping-in-south-korea-discuss-russia-ukraine-war/articleshow/124750902.cms",
    "timestamp": "2025-10-23T01:56:21Z"
  },
  {
    "title": "Taiwan is courting MAGA influencers to get Trump’s attention",
    "description": "Officials have grown worried that Trump could undermine the self-ruled democracy’s interests during talks with China.",
    "link": "https://www.japantimes.co.jp/news/2025/10/23/asia-pacific/politics/taiwan-maga-influencers-trump/",
    "timestamp": "2025-10-23T01:56:00Z"
  },
  {
    "title": "Brennan: MAGA Base Being 'Hoodwinked' by 'World-Class Charlatan' Trump",
    "description": "Wednesday on MSNBC's \"Deadline,\" former CIA Director John Brennan claimed the MAGA base was being hoodwinked by President Donald Trump, who he called a \"world-class charlatan.\"\nThe post Brennan: MAGA Base Being ‘Hoodwinked’ by ‘World-Class Charlatan’ Trump ap…",
    "link": "https://www.breitbart.com/clips/2025/10/22/brennan-maga-base-being-hoodwinked-by-world-class-charlatan-trump/",
    "timestamp": "2025-10-23T01:54:50Z"
  },
  {
    "title": "President Trump levies new sanctions on Russian oil giants in a push on Vladimir Putin to end the Ukraine war",
    "description": "WASHINGTON — President Donald Trump’s administration announced Wednesday new “massive sanctions” against Russia’s oil industry that are aimed at moving Russian President Vladimir Putin to the negotiating table and bringing an end to Moscow’s brutal war on Ukr…",
    "link": "https://biztoc.com/x/31677cc5bd756ef5",
    "timestamp": "2025-10-23T01:54:42Z"
  },
  {
    "title": "Trump tells Rutte: Spain is not a team player",
    "description": "United States President Donald Trump took aim at Spain's defense spending during talks with NATO Secretary General Mark Rutte at the White House.\nTrump said most allies had agreed to lift their t...",
    "link": "https://biztoc.com/x/034990056e855edd",
    "timestamp": "2025-10-23T01:54:29Z"
  },
  {
    "title": "Entire East Wing of White House will be demolished for ballroom - as Trump urged to pause project",
    "description": "The entire East Wing of the White House will be demolished \"within days\" - much more bulldozing than initially expected for Donald Trump's new ballroom construction project.",
    "link": "https://news.sky.com/story/entire-east-wing-of-white-house-will-be-demolished-for-ballroom-as-trump-urged-to-pause-project-13455570",
    "timestamp": "2025-10-23T01:52:00Z"
  },
  {
    "title": "Alan Dershowitz Breaks Down What Trump Is Really ‘Looking For’ In His New Legal Fight",
    "description": "Alan Dershowitz said Wednesday that President Donald Trump isn’t chasing financial gain in his latest round of lawsuits but rather seeking vindication.",
    "link": "https://dailycaller.com/2025/10/22/alan-dershowitz-trump-doj-vindication/",
    "timestamp": "2025-10-23T01:50:44Z"
  },
  {
    "title": "Prime Minister Mark Carney says Canada will double its non-US exports as Canadians can't rely on US",
    "description": "Canadian Prime Minister Mark Carney says he's setting a goal for the country to double its non-U.S. exports in the next decade, saying Canada’s former strengths based on close ties to the United States have become vulnerabilities",
    "link": "https://abcnews.go.com/Business/wireStory/prime-minister-mark-carney-canada-double-us-exports-126780000",
    "timestamp": "2025-10-23T01:49:44Z"
  },
  {
    "title": "TikTok creator and US marshal shot during LA immigration raid",
    "description": "Officials say the incident unfolded when a man allegedly rammed officers' vehicles  while trying to flee immigration arrest.",
    "link": "https://www.bbc.com/news/articles/cjw9252d9vxo",
    "timestamp": "2025-10-23T01:48:50Z"
  },
  {
    "title": "NYC mayoral candidates clash over Trump and political experience",
    "description": "Zohran Mamdani, Andrew Cuomo and Curtis Sliwa took the debate stage for the final time ahead of Election Day in early November.",
    "link": "https://www.bbc.com/news/videos/cy8v30p5lp7o",
    "timestamp": "2025-10-23T01:47:42Z"
  },
  {
    "title": "Can the White House's flood-the-zone social strategy win the shutdown?",
    "description": "President Trump’s team is trolling Democrats harder than ever during the shutdown. It's a page stolen from his campaign and his own online habits.White House digital staffers have unleashed a social media strategy full of taunting memes and fake videos, follo…",
    "link": "https://freerepublic.com/focus/f-news/4348050/posts",
    "timestamp": "2025-10-23T01:47:06Z"
  },
  {
    "title": "Fired prosecutors who investigated Trump burst back on scene with new anti-corruption firm",
    "description": "A pair of Justice Department prosecutors who lost their jobs after working on special counsel Jack Smith's legal team investigating and charging President Donald Trump are back, having founded a new law firm to take on corruption, CBS News reported on Wednesd…",
    "link": "https://www.rawstory.com/trump-prosecutors-2674224639/",
    "timestamp": "2025-10-23T01:46:40Z"
  },
  {
    "title": "PM Modi Unlikely To Travel To Malaysia For ASEAN Summit; EAM Jaishankar May Represent India",
    "description": "Prime Minister Narendra Modi is unlikely to travel to Malaysia to participate in the meetings related to the ASEAN summit beginning Sunday due to scheduling issues, people familiar with the matter said on Wednesday. It is learnt that External Affairs Minister…",
    "link": "https://www.ndtvprofit.com/nation/pm-modi-unlikely-to-travel-to-malaysia-for-asean-summit-eam-jaishankar-may-represent-india",
    "timestamp": "2025-10-23T01:46:27Z"
  },
  {
    "title": "Samvat 2082: Markets to open firm amid expectations for US-India trade deal soon",
    "description": "Domestic markets are set for a strong opening in Samvat 2082, driven by optimism for a US-India trade deal.",
    "link": "https://www.thehindubusinessline.com/markets/samvat-2082-markets-to-open-firm-amid-expectations-for-us-india-trade-deal-soon/article70192099.ece",
    "timestamp": "2025-10-23T01:45:20Z"
  },
  {
    "title": "SOM, CPR meetings begin today ahead of 47th Asean Summit",
    "description": "KUALA LUMPUR: The Asean Senior Officials' Meetings (SOM) and related preparatory sessions kick off on Thursday (Oct 23), setting the stage for the 47th Asean Summit and Related Summits to be held at the Kuala Lumpur Convention Centre here from Oct 26 to 28. R…",
    "link": "https://www.thestar.com.my/news/nation/2025/10/23/som-cpr-meetings-begin-today-ahead-of-47th-asean-summit",
    "timestamp": "2025-10-23T01:45:00Z"
  },
  {
    "title": "Celebrating 250 years of Lucknow’s legacy: Lucknow before the nawabs",
    "description": "Discover Lucknow's rich past predating the Nawabs. Evidence suggests human settlements over 4,000 years old, with ancient religious connections and early rulers. Archaeological finds and historical records reveal a prosperous trading center and administrative…",
    "link": "https://timesofindia.indiatimes.com/city/lucknow/celebrating-250-years-of-lucknows-legacy-lucknow-before-the-nawabs/articleshow/124750738.cms",
    "timestamp": "2025-10-23T01:42:50Z"
  },
  {
    "title": "Jeffries on if ACA Is Broken if It Needs Subsidies: 'Healthcare System Is Broken'",
    "description": "On Wednesday’s broadcast of MSNBC’s “All In,” House Minority Leader Rep. Hakeem Jeffries (D-NY) responded to a question on whether Obamacare or the entire system don’t work if they need massive subsidies to be affordable by saying that “we believe\nThe post Je…",
    "link": "https://www.breitbart.com/clips/2025/10/22/jeffries-on-if-aca-is-broken-if-it-needs-subsidies-healthcare-system-is-broken/",
    "timestamp": "2025-10-23T01:39:47Z"
  },
  {
    "title": "Rubio: Knesset sovereignty bill threatens Trump’s Gaza peace plan",
    "description": "Ahead of Israel visit, Secretary of State warns that Israel’s sovereignty bill, approved in a preliminary reading by the Knesset, endangers Trump’s Gaza peace plan.",
    "link": "https://www.israelnationalnews.com/news/416674",
    "timestamp": "2025-10-23T01:39:09Z"
  },
  {
    "title": "Man wearing inflatable Trump costume allegedly attacked on camera at blue state ‘No Kings’ protest: police",
    "description": "A Massachusetts man was charged after attacking a Trump supporter in an inflatable costume at a “No Kings\" protest, police and video footage confirmed.",
    "link": "https://www.foxnews.com/us/man-wearing-inflatable-trump-costume-allegedly-attacked-camera-blue-state-no-kings-protest-police",
    "timestamp": "2025-10-23T01:39:05Z"
  },
  {
    "title": "India's Russian Oil Imports Will Be 'Down To Nothing' By Year-End, Claims Trump",
    "description": "India will slash its Russian oil imports \"down to nothing\" by  the end of the year, US President Donald Trump claimed on Thursday. \"India, as you know, has told me they are going to stop... It's a process. You can't just stop (buying oil from Russia). By the …",
    "link": "https://www.ndtvprofit.com/world/india-russian-oil-imports-will-be-down-to-nothing-by-year-end-claims-trump",
    "timestamp": "2025-10-23T01:38:49Z"
  },
  {
    "title": "Trump is 'tearing down the human infrastructure' of federal gov't: Obama-era ambassador",
    "description": "Donald Trump is demolishing the entire East Wing of the White House instead of focusing on families struggling to make ends ...",
    "link": "https://biztoc.com/x/d0b90b38ac0131da",
    "timestamp": "2025-10-23T01:34:32Z"
  },
  {
    "title": "Trump: Chicago needs to bring in the federal government",
    "description": "United States President Donald Trump stated that it was time to bring in the federal government into Chicago after 14 people were shot and four killed over the weekend.In a post on Truth Social, Trump...",
    "link": "https://biztoc.com/x/b83b815e777515cc",
    "timestamp": "2025-10-23T01:32:46Z"
  },
  {
    "title": "'Too poor to buy crackers': Punjab family makes bomb at home; explosion kills 1, injures 6",
    "description": "During the lively Bandi Chhor Divas festivities in Dharmabad village, Gurdaspur, a heart-wrenching event transpired as a homemade explosive detonated, tragically taking one life and injuring six others. The device, reportedly constructed from an iron pipe and…",
    "link": "https://timesofindia.indiatimes.com/city/amritsar/too-poor-to-buy-crackers-punjab-family-makes-bomb-at-home-explosion-kills-1-injures-6/articleshow/124750674.cms",
    "timestamp": "2025-10-23T01:32:37Z"
  },
  {
    "title": "Trump administration reverses course: 2.5 million borrowers set to receive student loan forgiveness, ending months of limbo",
    "description": "The Trump administration has agreed to resume student loan forgiveness for roughly 2.5 million borrowers enrolled in income-driven repayment plans, following a lawsuit by the American Federation of Teachers (AFT). The settlement restores programs like ICR, PA…",
    "link": "https://timesofindia.indiatimes.com/education/news/trump-administration-reverses-course-2-5-million-borrowers-set-to-receive-student-loan-forgiveness-ending-months-of-limbo/articleshow/124750629.cms",
    "timestamp": "2025-10-23T01:31:12Z"
  },
  {
    "title": "Former White House Ethics Lawyer Calls Out Trump Over This 'Profit-Grabbing Exploitation'",
    "description": "Norm Eisen warned that the president could face \"legal accountability\" following the reported demand.",
    "link": "https://www.huffpost.com/entry/norm-eisen-trump-doj-payment-demand_n_68f96022e4b0d0ec549cc384",
    "timestamp": "2025-10-23T01:31:09Z"
  },
  {
    "title": "Israel's parliament gives initial nod to occupied West Bank annexation",
    "description": "Prime Minister Benjamin Netanyahu's Likud party did not support the bill put forth by lawmakers outside his ruling coalition.",
    "link": "https://www.japantimes.co.jp/news/2025/10/23/world/politics/israel-parliament-west-bank-annex/",
    "timestamp": "2025-10-23T01:31:00Z"
  },
  {
    "title": "US hits top Russian oil companies with sanctions, EU bans Russian LNG",
    "description": "America has imposed sanctions on Russia's two largest oil companies, Lukoil and Rosneft. This action follows similar moves by the European Union and Britain. The US Treasury stated these sanctions target companies funding Russia's war in Ukraine. Oil prices s…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-hits-top-russian-oil-companies-with-sanctions-eu-bans-russian-lng/articleshow/124750659.cms",
    "timestamp": "2025-10-23T01:25:57Z"
  },
  {
    "title": "US Considers Broad Software Curbs on China, White House Says",
    "description": "The Trump administration is weighing export restrictions against China that would bar the purchase of a wide swath of critical software, a White House official said Wednesday.",
    "link": "https://financialpost.com/pmn/business-pmn/us-considers-broad-software-curbs-on-china-white-house-says",
    "timestamp": "2025-10-23T01:22:22Z"
  },
  {
    "title": "U.S. military strikes suspected drug vessel in the Pacific",
    "description": "The strike is the first known U.S. military operation in the Pacific since Trump started a new military offensive against the drug trade.",
    "link": "https://www.japantimes.co.jp/news/2025/10/23/asia-pacific/politics/us-strikes-drug-vessel-pacific/",
    "timestamp": "2025-10-23T01:22:00Z"
  },
  {
    "title": "Mamdani, Cuomo Each Say With Straight Face That Vote For The Other Is Vote For Trump",
    "description": "Mamdani and Cuomo each claimed during Wednesday evening’s debate that the other supports President Donald Trump.",
    "link": "https://dailycaller.com/2025/10/22/zohran-mamdani-andrew-cuomo-new-york-city-mayor-debate-donald-trump/",
    "timestamp": "2025-10-23T01:20:37Z"
  },
  {
    "title": "Jesse Watters Issues Truly Childish Defense Of Trump 'Strafing Feces Over Everybody'",
    "description": "The president shared an artificial intelligence-generated video Saturday that showed him dumping feces on American protesters.",
    "link": "https://www.huffpost.com/entry/jesse-watters-childish-defense-memelord-trump-poop-video_n_68f95982e4b0d0ec549cc1e3",
    "timestamp": "2025-10-23T01:20:03Z"
  },
  {
    "title": "Tesla, Toyota and other major automakers urge Trump not to impose tariffs on factory robots, machinery",
    "description": "Automakers, including GM and Toyota, are urging the Trump administration not to impose tariffs on factory robots and machinery. They warn that increased equipment costs could lead to production delays, vehicle shortages, and higher prices for consumers. Tesla…",
    "link": "https://economictimes.indiatimes.com/news/international/business/tesla-toyota-and-other-major-automakers-urge-trump-not-to-impose-tariffs-on-factory-robots-machinery/articleshow/124750603.cms",
    "timestamp": "2025-10-23T01:18:07Z"
  },
  {
    "title": "Author Michael Wolff files suit against Melania Trump over Jeffrey Epstein threat",
    "description": "Author Michael Wolff has filed suit against first lady Melania Trump, charging that she threatened a $1 billion legal action against him in order to stop him from reporting and writing on her alleged ties to Jeffrey Epstein.\"Mrs.",
    "link": "https://www.nbcnews.com/politics/donald-trump/author-michael-wolff-files-suit-melania-trump-jeffrey-epstein-threat-rcna239257",
    "timestamp": "2025-10-23T01:13:12Z"
  },
  {
    "title": "'They are going to stop...it's a process': Trump repeats claims India will significantly reduce Russian oil imports by year-end",
    "description": "US President Donald Trump claimed India will significantly reduce Russian oil imports by year-end, citing Prime Minister Modi's assurance. However, India denies any such agreement, emphasizing its priority to safeguard consumer interests and maintain stable e…",
    "link": "https://economictimes.indiatimes.com/news/india/they-are-going-to-stop-its-a-process-trump-repeats-claims-india-will-significantly-reduce-russian-oil-imports-by-year-end/articleshow/124750580.cms",
    "timestamp": "2025-10-23T01:12:36Z"
  },
  {
    "title": "How We Got Mamdani: The Left “understood that if they can get control of the educational system, they can change the country”",
    "description": "How NYC is on the verge of electing a socialist jihadist: \"The left was very savvy and very strategic. They identified the weakness in our society and the weakness in our society is the educational system.\"\nThe post How We Got Mamdani: The Left “understood th…",
    "link": "https://legalinsurrection.com/2025/10/how-we-got-mamdani-the-left-understood-that-if-they-can-get-control-of-the-educational-system-they-can-change-the-country/",
    "timestamp": "2025-10-23T01:11:07Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,337",
    "description": "Here are the key events from day 1,337 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/10/23/russia-ukraine-war-list-of-key-events-day-1337",
    "timestamp": "2025-10-23T01:10:46Z"
  },
  {
    "title": "Nuclear power at heart of new prime minister's energy policy",
    "description": "Imported fossil fuels cover 60% to 70% of Japan's electricity generation and are a source of inflation that has undermined support for the ruling Liberal Democratic Party.",
    "link": "https://www.japantimes.co.jp/business/2025/10/23/economy/new-pm-takaichi-nuclear-power/",
    "timestamp": "2025-10-23T01:09:00Z"
  },
  {
    "title": "North Carolina Republicans pass new US House map, expanding Trump's redistricting campaign",
    "description": "North Carolina Republicans enacted a new congressional map, aiming to secure an additional House seat and bolster their party's control. This move follows similar redistricting efforts in Texas and Missouri, as Republicans leverage their state-level power. De…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/north-carolina-republicans-pass-new-us-house-map-expanding-trumps-redistricting-campaign/articleshow/124750565.cms",
    "timestamp": "2025-10-23T01:08:15Z"
  },
  {
    "title": "Stock Market Live Updates 23 October 2025: Markets surge up on first full trading day of Samvat 2082; Sensex scales 85,000 mark",
    "description": "Sensex, Nifty, Share Prices LIVE: After opening above the 85,000 mark, Sensex traded 527.32 points or 0.62 per cent higher at 84,953.66 at 9.20 am. Nifty 50 climbed 137.75 points or 0.53 per cent to 26,006.35",
    "link": "https://www.thehindubusinessline.com/markets/stock-market-live-updates-23-october-2025-markets-surge-up-on-first-full-trading-day-of-samvat-2082-sensex-scales-85000-mark/article70187388.ece",
    "timestamp": "2025-10-23T01:08:10Z"
  },
  {
    "title": "JD Vance held back from achieving most 'dangerous' goals by Trump himself: ex-GOP analyst",
    "description": "President Donald Trump appears to be holding his vice president back from achieving his most \"dangerous\" goals, according to a former Republican analyst. Ex-Republican analyst Tim Miller, host of \"The Bulwark Podcast,\" said during a new podcast episode on Wed…",
    "link": "https://www.rawstory.com/jd-vance-2674224599/",
    "timestamp": "2025-10-23T01:07:01Z"
  },
  {
    "title": "Trump’s Granddaughter Accidentally Reveals How Long He’s Had Hand Issues",
    "description": "Clues about Donald Trump’s health were in his granddaughter’s YouTube vlogs all along. Kai Trump, 18, unintentionally revealed through an Instagram post on...",
    "link": "https://www.thedailybeast.com/donald-trumps-granddaughter-kai-accidentally-reveals-how-long-hes-had-hand-issues/",
    "timestamp": "2025-10-23T01:04:54Z"
  },
  {
    "title": "Indiana state Senate Republicans don't have the votes to push gerrymandering, yet",
    "description": "Republican Gov. Mike Braun is still confident he can pass new maps to help his party hold control of Congress.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/22/indiana-republicans-dont-yet-have-votes-redraw-districts/86844492007/",
    "timestamp": "2025-10-23T01:02:57Z"
  },
  {
    "title": "Mark Carney unveils immigration plan to attract workers hit by US visa fee hikes - Here’s what Canadians can expect in federal budget",
    "description": "Mark Carney: Canadian Prime Minister Mark Carney unveiled a new immigration plan in the upcoming budget, aiming to attract skilled talent and boost the workforce. The strategy includes a focus on scientists and innovators, potentially drawing tech workers det…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/mark-carney-unveils-immigration-plan-to-attract-workers-hit-by-us-visa-fee-hikes-heres-what-canadians-can-expect-in-federal-budget/articleshow/124750465.cms",
    "timestamp": "2025-10-23T01:02:21Z"
  },
  {
    "title": "Hawaii teacher punished for Constitution Day lesson on free speech, Charlie Kirk, legal group says",
    "description": "Hawaii school administrators allegedly disciplined a history teacher for allowing student discussion of Charlie Kirk's killing during a Bill of Rights lesson.",
    "link": "https://www.foxnews.com/media/hawaii-teacher-punished-constitution-day-lesson-free-speech-charlie-kirk-legal-group-says",
    "timestamp": "2025-10-23T01:00:55Z"
  },
  {
    "title": "Frustrated Federal Employees Line Up For Food As US Shutdown Wears On",
    "description": "Standing in the middle of a parking lot in suburban Washington, surrounded by hundreds of federal employees waiting for food handouts amid the US government shutdown, Diane Miller summed it up simply.",
    "link": "https://www.ibtimes.com/frustrated-federal-employees-line-food-us-shutdown-wears-3788094",
    "timestamp": "2025-10-23T01:00:24Z"
  },
  {
    "title": "'We hope war will be settled': Trump calls sanctions on Russian oil companies 'tremendous'",
    "description": "America has imposed new sanctions on Russia's top oil firms, Rosneft and Lukoil. This move aims to pressure Moscow to cease its actions in Ukraine. President Trump stated the sanctions are significant and hopes for a swift resolution. The US Treasury Departme…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/we-hope-war-will-be-settled-trump-calls-sanctions-on-russian-oil-companies-tremendous/articleshow/124750514.cms",
    "timestamp": "2025-10-23T00:58:44Z"
  },
  {
    "title": "Trading barbs from light-hearted to vicious, mayoral candidates make final appeal to New Yorkers",
    "description": "New York City mayoral candidates Zohran Mamdani, former Gov. Andrew Cuomo and Curtis Sliwa faced off in their last debate as billionaires call for Sliwa to drop out.",
    "link": "https://www.foxnews.com/politics/trading-barbs-from-light-hearted-vicious-mayoral-candidates-make-final-appeal-new-yorkers",
    "timestamp": "2025-10-23T00:55:17Z"
  },
  {
    "title": "“Never thought of as much”: Trump downplays demolition of White House’s East Wing",
    "description": "The president unveiled a model of his planned ballroom and an adjusted price tag of $300 million.",
    "link": "https://www.salon.com/2025/10/22/never-thought-of-as-much-trump-downplays-demolition-of-white-houses-east-wing/",
    "timestamp": "2025-10-23T00:53:04Z"
  },
  {
    "title": "US military strikes suspected drug vessel in the Pacific",
    "description": "The U.S. military conducted a strike in the Eastern Pacific, killing two alleged drug smugglers. This marks the first Pacific operation in President Trump's expanded counter-narcotics campaign, which has seen at least seven strikes in the Caribbean. Legal exp…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-military-strikes-suspected-drug-vessel-in-the-pacific/articleshow/124750483.cms",
    "timestamp": "2025-10-23T00:52:37Z"
  },
  {
    "title": "Sean 'Diddy' Combs’ life under threat inside prison? Mogul’s friend says he woke up with ‘weapon to his neck,’ check shocking details",
    "description": "Sean 'Diddy' Combs' friend Charlucci Finney claims the mogul woke up in MDC Brooklyn with a knife to his throat. Finney expressed concern for Diddy's safety in prison, especially given the nature of his conviction. Diddy's lawyer previously stated a guard had…",
    "link": "https://economictimes.indiatimes.com/news/international/us/sean-diddy-combs-life-under-threat-inside-prison-moguls-friend-says-he-woke-up-with-weapon-to-his-neck-check-shocking-details/articleshow/124750436.cms",
    "timestamp": "2025-10-23T00:50:19Z"
  },
  {
    "title": "US hits Russia's biggest oil firms with sanctions over Ukraine",
    "description": "The White House makes a sharp move to pressure Moscow to secure peace in Ukraine just one day after a summit between US President Donald Trump and Russian President Vladimir Putin falls apart.",
    "link": "https://www.abc.net.au/news/2025-10-23/us-announces-sanctions-against-russia-s-two-biggest-oil-firms/105923888",
    "timestamp": "2025-10-23T00:45:59Z"
  },
  {
    "title": "US hits Russia's biggest oil firms with sanctions over Ukraine",
    "description": "The White House makes a sharp move to pressure Moscow to secure peace in Ukraine just one day after a summit between US President Donald Trump and Russian President Vladimir Putin falls apart.",
    "link": "https://www.abc.net.au/news/2025-10-23/us-announces-sanctions-against-russias-two-biggest-oil-firms/105923888",
    "timestamp": "2025-10-23T00:45:59Z"
  },
  {
    "title": "University of Virginia reaches settlement over admissions and hiring policies: Is federal oversight redefining campus diversity?",
    "description": "The University of Virginia has reached a settlement with the Justice Department to resolve allegations of racial discrimination in admissions and hiring. Following President Jim Ryan’s resignation, UVA pledged to comply with anti-discrimination rules and subm…",
    "link": "https://timesofindia.indiatimes.com/education/news/university-of-virginia-reaches-settlement-over-admissions-and-hiring-policies-is-federal-oversight-redefining-campus-diversity/articleshow/124750400.cms",
    "timestamp": "2025-10-23T00:41:54Z"
  },
  {
    "title": "Bengaluru weather: Rain exoected today; AQI improves",
    "description": "Bengaluru braces for a wet October 23, 2025, with a 91% chance of moderate rain and temperatures between 18.9°C and 23.5°C. The downpour is expected to improve air quality, which stood at a moderate 65 AQI yesterday. Morning hours are ideal for outdoor activi…",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/bangalore-weather-forecast-rainy-day-with-moderate-air-quality-pleasant-temperatures/articleshow/124750422.cms",
    "timestamp": "2025-10-23T00:39:42Z"
  },
  {
    "title": "Mumbai weather: High humidity with rain expected today; AQI remains moderate",
    "description": "Mumbai anticipates a warm, humid day today, October 23, 2025, with moderate rain expected later, urging residents to carry umbrellas. Temperatures will range from 26.3°C to 33.4°C. Yesterday's air quality was 'moderate' at 119 AQI, the lowest in a week, with …",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-weather-update-rain-and-humidity-expected-today-aqi-improves-slightly/articleshow/124750419.cms",
    "timestamp": "2025-10-23T00:39:37Z"
  },
  {
    "title": "Joe Rogan Suggests Trump Do The Ultimate Troll Move — Become California Governor After Newsom: ‘Would Be F*cking Hilarious!’",
    "description": "Joe Rogan kicked off his podcast on Wednesday with a suggestion for President Donald Trump: run for governor of California after exiting the White House in 2028\nThe post Joe Rogan Suggests Trump Do The Ultimate Troll Move — Become California Governor After Ne…",
    "link": "https://www.mediaite.com/media/joe-rogan-suggests-trump-do-the-ultimate-troll-move-become-california-governor-after-newsom-would-be-fcking-hilarious/",
    "timestamp": "2025-10-23T00:36:10Z"
  },
  {
    "title": "Trump assault on offshore wind wipes out vessel orders with Seatrium contract among the casualties",
    "description": "Danish shipping giant Maersk in October cancelled a US$475 million contract with Seatrium to build a vessel. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/trump-assault-on-offshore-wind-wipes-out-vessel-orders-with-seatrium-contract-among-the-casualties",
    "timestamp": "2025-10-23T00:35:15Z"
  },
  {
    "title": "15 serving army officers jailed for ‘atrocities’ during Hasina tenure",
    "description": "South Asia News: DHAKA: Bangladesh International Crimes Tribunal (ICT) on Wednesday sent 15 serving army officers to jail to face trial on charges of enforced disappea.",
    "link": "https://timesofindia.indiatimes.com/world/south-asia/15-serving-army-officers-jailed-for-atrocities-during-hasina-tenure/articleshow/124750367.cms",
    "timestamp": "2025-10-23T00:35:01Z"
  }
]