[
  {
    "title": "World Series champion LA Dodgers say they'll visit Trump at the White House on April 7",
    "description": "The Los Angeles Dodgers say they have accepted President Donald Trump's invitation to the White House to celebrate their World Series title",
    "link": "https://abcnews.go.com/Politics/wireStory/world-series-champion-la-dodgers-visit-trump-white-120177281",
    "timestamp": "2025-03-26T15:18:33Z"
  },
  {
    "title": "Europe Should Dust Off Multilateral Nuclear Plans",
    "description": "A Kennedy-era initiative may be a necessity in the age of Trump.",
    "link": "http://foreignpolicy.com/2025/03/26/multilateral-europe-nuclear-weapons/",
    "timestamp": "2025-03-26T15:18:22Z"
  },
  {
    "title": "JD Vance Scales Back Greenland Trip After Danish Criticism",
    "description": "Apparently, the Greenlanders were well-stocked with eggs to pelt the foreign invader.\nSource: BBC\nDenmark has welcomed changes to a Greenland trip by US Vice-President JD Vance and his wife Usha, which has been reduced to a visit of just a US space base.\r\n\nEa…",
    "link": "https://crooksandliars.com/2025/03/jd-vance-scales-back-greenland-trip",
    "timestamp": "2025-03-26T15:17:41Z"
  },
  {
    "title": "Supreme Court sides with Biden and upholds regulations of ghost guns to make them traceable",
    "description": "The Supreme Court has upheld a regulation by the Biden administration that mandates serial numbers, background checks, and age verification for buying nearly untraceable ghost gun kits online. Ghost guns have been increasingly used in crimes across the US. Th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/supreme-court-sides-with-biden-and-upholds-regulations-of-ghost-guns-to-make-them-traceable/articleshow/119546633.cms",
    "timestamp": "2025-03-26T15:17:40Z"
  },
  {
    "title": "Trump Signs Order to Toughen Voter Registration Standards",
    "description": "President Donald Trump signed an executive order Tuesday that would seek to cut federal grants to states who don’t adopt tougher standards for voter registration, the latest Republican step in the political fight over access to the voter rolls.\nThe executive …",
    "link": "https://biztoc.com/x/de6dcdb92f8c6d28",
    "timestamp": "2025-03-26T15:17:36Z"
  },
  {
    "title": "‘Cheat sheet’ recording Donald Trump’s entire conviction record surfaces on Reddit. Netizens react",
    "description": "A viral 'cheat sheet' detailing Donald Trump's legal and ethical history has shocked social media. It includes criminal convictions, sexual misconduct allegations, business failures and impeachment records. The document raised discussions about having a convi…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/cheat-sheet-recording-donald-trumps-entire-conviction-record-surfaces-on-reddit-netizens-react/articleshow/119546163.cms",
    "timestamp": "2025-03-26T15:17:23Z"
  },
  {
    "title": "How The IRS Picks Tax Returns To Audit: A Tax-Law Expert Explains",
    "description": "We all fear IRS audits. But what is the IRS process of choosing tax returns to audit? In this Q&A series, I asked a tax-law professor and former IRS lawyer to explain.",
    "link": "https://www.forbes.com/sites/brucebrumberg/2025/03/26/how-the-irs-picks-tax-returns-to-audit-a-tax-law-expert-explains/",
    "timestamp": "2025-03-26T15:16:45Z"
  },
  {
    "title": "'Walked into his girlfriend's building': Inside Vance, Mike Waltz's leaked group chat after Houthi commander's demise",
    "description": "Amid the US 'war plan leak' row, chats of JD Vance and Mike Waltz have emerged that shows them celebrating the demise of Houthi commander. The strike was part of a broader US military operation to restore freedom of navigation in the Red Sea and respond to Ho…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-military-war-plan-leak-pete-hegseth-yemen-houthis-walked-into-his-girlfriends-building-inside-vance-mike-waltzs-leaked-group-chat-after-houthi-commanders-demise/articleshow/119546428.cms",
    "timestamp": "2025-03-26T15:16:34Z"
  },
  {
    "title": "US-India to speed up tariff cut talks through ‘fast-track mechanism’",
    "description": "India and US accelerate trade talks to avoid reciprocal tariffs, focusing on key market access interests for early results.",
    "link": "https://www.thehindubusinessline.com/economy/us-india-to-speed-up-tariff-cut-talks-through-fast-track-mechanism/article69378284.ece",
    "timestamp": "2025-03-26T15:16:06Z"
  },
  {
    "title": "Companies Backing Out Of Supporting Several Major Gay Pride Events Amid Trump’s DEI Crackdown",
    "description": "Several pride organizations are falling behind on their funding goals after some companies have begun to scale back support, according to The New York Times.",
    "link": "https://dailycaller.com/2025/03/26/companies-backing-out-of-supporting-several-major-gay-pride-events-amid-trumps-dei-crackdown/",
    "timestamp": "2025-03-26T15:15:43Z"
  },
  {
    "title": "'People will die based on these decisions': Trump administration cuts funding for dozens of HIV studies",
    "description": "'People will die based on these decisions': Trump administration cuts funding for dozens of HIV studies6abc.com",
    "link": "https://6abc.com/post/people-will-die-based-decisions-trump-administration-cuts-funding-dozens-hiv-studies/16085314/",
    "timestamp": "2025-03-26T15:15:39Z"
  },
  {
    "title": "Trump to Newsmax: 'Very Comfortable' With Leak Resolution (Mark Swanson/Newsmax)",
    "description": "Mark Swanson / Newsmax:\nTrump to Newsmax: ‘Very Comfortable’ With Leak Resolution  —  President Donald Trump told Newsmax on Tuesday that he's “very comfortable” with the explanation and resolution of how an editor with a magazine ended up on a group thread w…",
    "link": "https://www.memeorandum.com/250326/p51",
    "timestamp": "2025-03-26T15:15:00Z"
  },
  {
    "title": "The global leaders rising in the polls as they battle Donald Trump",
    "description": "From Canada to Ukraine, populations rally behind leaders seeking to fend off the US president’s threats",
    "link": "https://www.irishtimes.com/world/2025/03/26/the-global-leaders-rising-in-the-polls-as-they-battle-donald-trump/",
    "timestamp": "2025-03-26T15:14:29Z"
  },
  {
    "title": "UK's Royal Society Decides Not To Take Action Against Elon Musk",
    "description": "Britain&#039;s Royal Society has decided the scientific academy will not take any action against a famous member, U.S. tech entrepreneur Elon Musk, after fellows met to discuss potential disciplinary measures, British media reported on Wednesday.",
    "link": "https://www.ndtv.com/world-news/uks-royal-society-decides-not-to-take-action-against-elon-musk-8017597",
    "timestamp": "2025-03-26T15:13:39Z"
  },
  {
    "title": "Trump Envoy Steve Witkoff Breaks Silence on Signal War Plan Texts",
    "description": "Witkoff and the White House said that he was provided a secure line of communication by the US government while in Moscow.",
    "link": "https://www.newsweek.com/trump-envoy-steve-witkoff-breaks-silence-signal-war-plan-texts-2050843",
    "timestamp": "2025-03-26T15:10:59Z"
  },
  {
    "title": "US could run short of money to pay its bills by August without a debt limit deal: CBO",
    "description": "The United States is on track to hit its statutory debt ceiling — the so-called X-date when the country runs short of money to pay its bills— as early as August without a deal between lawmakers and the White House",
    "link": "https://abcnews.go.com/Business/wireStory/us-run-short-money-pay-bills-august-debt-120175964",
    "timestamp": "2025-03-26T15:10:11Z"
  },
  {
    "title": "Carney announces $2B fund to protect tariff-threatened auto industry",
    "description": "Homing in once again on the fractured Canada-U.S. relationship, Liberal Leader Mark Carney unveiled a $2-billion proposal to protect Canada's auto industry while in Windsor, Ont., on Wednesday — one of the front lines of the tariff war.",
    "link": "https://www.cbc.ca/news/politics/carney-auto-sector-trump-tariffs-1.7493714",
    "timestamp": "2025-03-26T15:09:12Z"
  },
  {
    "title": "Elon Musk jumps into 2 closer-than-expected House elections in Florida",
    "description": "Musk's super PAC has begun spending on \"texting services\" in two House special elections in Florida that have become more competitive than expected.",
    "link": "https://www.businessinsider.com/elon-musk-america-pac-special-elections-florida-2025-3",
    "timestamp": "2025-03-26T15:09:04Z"
  },
  {
    "title": "Tiger Woods' headline-making, Rory McIlroy's roar towards Masters earn awards from PGA Tour's Florida Swing",
    "description": "The PGA Tour's Florida Swing has come and gone, which means its time to dish out awards",
    "link": "https://www.cbssports.com/golf/news/tiger-woods-headline-making-rory-mcilroys-roar-towards-masters-earn-awards-from-pga-tours-florida-swing/",
    "timestamp": "2025-03-26T15:08:39Z"
  },
  {
    "title": "Trump’s purported ‘Art of the Deal’ negotiating skills aren’t likely to end the Russia-Ukraine war",
    "description": "Donald Trump’s supposed negotiating skills are probably not enough to broker sustainable peace between Russia and Ukraine given the protagonists’ enmity and his own history.",
    "link": "https://theconversation.com/trumps-purported-art-of-the-deal-negotiating-skills-arent-likely-to-end-the-russia-ukraine-war-252666",
    "timestamp": "2025-03-26T15:08:24Z"
  },
  {
    "title": "Citing India, Trump calls for election reform in US through executive order",
    "description": "US News: TOI Correspondent from Washington: Approvingly citing the conduct of elections in India among other countries, President Donald Trump on Tuesday issue.",
    "link": "https://timesofindia.indiatimes.com/world/us/citing-india-trump-calls-for-election-reform-in-us-through-executive-order/articleshow/119546162.cms",
    "timestamp": "2025-03-26T15:08:11Z"
  },
  {
    "title": "World Series champion LA Dodgers say they'll visit Trump at the White House on April 7",
    "description": "The Los Angeles Dodgers say they have accepted President Donald Trump’s invitation to the White House to celebrate their World Series title. The Dodgers confirmed in a social media post on Tuesday night that “in keeping with long-standing baseball tradition,”…",
    "link": "https://sports.yahoo.com/article/world-series-champion-la-dodgers-150727146.html",
    "timestamp": "2025-03-26T15:07:27Z"
  },
  {
    "title": "'Well Deserving' Media Given Intimate Access To Trump, White House Tells Judge",
    "description": "Well deserving journalists are allowed special access to President Donald Trump, White House deputy chief of staff Taylor Budowich has told a judge.\nWhy It Matters\nNews agency, The Associated Press (AP), is fighting to have access to the president in the Oval…",
    "link": "https://biztoc.com/x/d3c08bbdf7a9bf4e",
    "timestamp": "2025-03-26T15:06:38Z"
  },
  {
    "title": "US allegedly to cut support for vaccine aid organization",
    "description": "The administration of United States President Donald Trump intends to end financial support for Gavi, an international organization that acquires vaccines for children in developing nations, the New Y...",
    "link": "https://biztoc.com/x/881d4dcc57cc4b35",
    "timestamp": "2025-03-26T15:06:19Z"
  },
  {
    "title": "I'm a veteran and military spouse. Getting fired by the government makes me feel like the US doesn't care about us who've served.",
    "description": "Kira Carrigan said her sudden firing has done more than scramble her plans — it's made her question the US's appreciation for military families.",
    "link": "https://www.businessinsider.com/veteran-military-spouse-government-job-doge-fired-devastated-2025-3",
    "timestamp": "2025-03-26T15:05:34Z"
  },
  {
    "title": "MAGA Influencers Got Caught Defending Diet Coke",
    "description": "Robert F. Kennedy Jr. is an idiot and has no idea what the hell he's doing as Health and Human Services Secretary, but I don't particularly hate his campaign against Big Soda. Fun fact: Not only am I the first...\nRead more...",
    "link": "https://www.pajiba.com/news/maga-influencers-exposed-for-taking-money-to-defend-big-soda.php",
    "timestamp": "2025-03-26T15:05:16Z"
  },
  {
    "title": "‘I am going through hell’: Job loss, mental health and the fate of federal workers",
    "description": "The National Institutes of Health employee said she knew things would be difficult for federal workers after Donald Trump was elected. But she never imagined it would be like this.\nFocused on Alzheimer’s and other dementia research, the worker is among thousa…",
    "link": "https://www.rawstory.com/i-am-going-through-hell-job-loss-mental-health-and-the-fate-of-federal-workers/",
    "timestamp": "2025-03-26T15:05:05Z"
  },
  {
    "title": "FEMA already in turmoil as Trump officials vow to eliminate the agency",
    "description": "As Homeland Security Secretary Kristi Noem vows to “eliminate FEMA,” the agency is in turmoil, with disaster assistance, grant money, and hiring largely stalled, threatening its ability to respond to major disasters, multiple FEMA officials tell CNN.",
    "link": "https://www.cnn.com/2025/03/26/politics/fema-payments-staffing-stalled-turmoil/index.html",
    "timestamp": "2025-03-26T15:04:47Z"
  },
  {
    "title": "Elon Musk’s DOGE closes US Fish and Wildlife office in Michigan",
    "description": "DOGE claims the lease cancelation will save the federal government $336,220.",
    "link": "https://www.mlive.com/news/2025/03/elon-musks-doge-closes-us-fish-and-wildlife-office-in-michigan.html",
    "timestamp": "2025-03-26T15:04:25Z"
  },
  {
    "title": "The U.S. Judicial Crisis Is Uniquely Dangerous",
    "description": "But other democracies provide a roadmap for courts to prevail over attacks from the executive branch.",
    "link": "http://foreignpolicy.com/2025/03/26/trump-judiciary-courts-constitutional-crisis-executive/",
    "timestamp": "2025-03-26T15:04:19Z"
  },
  {
    "title": "Chris LaCivita Sues Daily Beast for Defamation",
    "description": "Chris LaCivita, senior adviser for President Donald Trump’s 2024 campaign, sued The Daily Beast Monday, alleging defamation for an article claiming that he personally profited... Read More\nThe post Chris LaCivita Sues Daily Beast for Defamation appeared first…",
    "link": "https://www.dailysignal.com/2025/03/26/chris-lacivita-sues-daily-beast-defamation/",
    "timestamp": "2025-03-26T15:04:08Z"
  },
  {
    "title": "Pentagon’s Hegseth texted planned time of targeted killing of Yemeni militant, Signal messages show",
    "description": "The Atlantic releases chat details after US secretary of defence repeatedly denied texting war plans",
    "link": "https://www.irishtimes.com/world/us/2025/03/26/pentagons-hegseth-texted-planned-time-of-targeted-killing-of-yemeni-militant-signal-messages-show/",
    "timestamp": "2025-03-26T15:03:03Z"
  },
  {
    "title": "CIA gives verdict on White House Signal chat leak",
    "description": "The agency routinely relies on the encrypted messaging app, its head John Ratcliffe has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614813-cia-signal-trump-waltz/",
    "timestamp": "2025-03-26T15:02:03Z"
  },
  {
    "title": "Top Republicans say they're out of the loop as DOGE downsizes Social Security Administration",
    "description": "Elon Musk’s Department of Government Efficiency is moving to downsize the Social Security Administration with office closures, cutbacks on phone services and new rules requiring in-person visits for some prospective beneficiaries to register.",
    "link": "https://www.nbcnews.com/politics/congress/republicans-loop-doge-social-security-administration-rcna198102",
    "timestamp": "2025-03-26T15:01:36Z"
  },
  {
    "title": "Democrats’ Circular Firing Squad: Infighting and Purity Tests Are Handing Republicans 2026",
    "description": "In November 2008, during the peak of the Great Recession, incoming White House Chief of Staff Rahm Emanuel uttered one of the most politically savvy... Read More\nThe post Democrats’ Circular Firing Squad: Infighting and Purity Tests Are Handing Republicans 20…",
    "link": "https://www.dailysignal.com/2025/03/26/democrats-circular-firing-squad-infighting-purity-tests-are-handing-republicans-2026/",
    "timestamp": "2025-03-26T15:01:19Z"
  },
  {
    "title": "Atlantic Publishes Signal Chat ‘War Plans’ After Trump Administration Denied Their Existence",
    "description": "The Atlantic published the war plans it originally withheld in its article revealing that its editor had been accidentally added to a chat with cabinet leaders.",
    "link": "https://dailycaller.com/2025/03/26/atlantic-donald-trump-signal-chat-war-plans-administration-response/",
    "timestamp": "2025-03-26T15:00:52Z"
  },
  {
    "title": "US reciprocal tariffs could cut British economic growth by 1%, OBR says",
    "description": "U.S. President Donald Trump's threats to impose new reciprocal tariffs could reduce British economic growth by up to 1%, according to the Office for Budget Responsibility. The British government is seeking to negotiate a new deal with the United States to avo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-reciprocal-tariffs-could-cut-british-economic-growth-by-1-obr-says/articleshow/119546102.cms",
    "timestamp": "2025-03-26T15:00:52Z"
  },
  {
    "title": "'Well Deserving' Media Given Intimate Access To Trump, White House Tells Judge",
    "description": "The White House claims journalists are celebrating after the \"self important\" White House Correspondents Association was stripped of its power",
    "link": "https://www.newsweek.com/associated-press-president-donald-trump-white-house-access-gulf-mexico-air-force-1-oval-office-2050776",
    "timestamp": "2025-03-26T15:00:30Z"
  },
  {
    "title": "Rural California Schools and Roads Lose Millions in Federal Funding After Latest Cuts",
    "description": "For the last century, the money has gone to counties with large amounts of federal land that can’t be taxed. Congress failed to include it in the upcoming budget.",
    "link": "https://www.kqed.org/news/12033035/rural-california-schools-and-roads-lose-millions-in-federal-funding-after-latest-cuts",
    "timestamp": "2025-03-26T15:00:27Z"
  },
  {
    "title": "Colorado Capitol Takes Down Trump Portrait He Branded ‘Purposely Distorted’",
    "description": "The Colorado State Capitol removed a portrait of President Donald Trump that he claimed was “purposely distorted.”",
    "link": "https://dailycaller.com/2025/03/26/colorado-capitol-takes-down-trump-portrait-he-called-purposely-distorted/",
    "timestamp": "2025-03-26T15:00:27Z"
  },
  {
    "title": "James Fadiman and Jordan Gruber: Psychedelics Legalization Will Continue No Matter Who Is President",
    "description": "Authors James Fadiman and Jordan Gruber discuss their new book \"Microdosing for Health, Healing, and Enhanced Performance.\"",
    "link": "https://reason.com/podcast/2025/03/26/james-fadiman-and-jordan-gruber-psychedelics-legalization-will-continue-no-matter-who-is-president/",
    "timestamp": "2025-03-26T15:00:23Z"
  },
  {
    "title": "Trump’s Black Sea truce plan is a ‘gift to Russia’ that risks undermining sanctions, analysts warn",
    "description": "The deal for a maritime truce between Russia and Ukraine looks like a Kremlin wish-list and an example of Trump handing concessions to Putin, analysts warn.",
    "link": "https://www.nbcnews.com/news/world/trump-black-sea-russia-ukraine-putin-ceasefire-zelenskyy-europe-deal-rcna198132",
    "timestamp": "2025-03-26T15:00:14Z"
  },
  {
    "title": "Trump Pick for Panama Envoy: Chinese Influence Goes Beyond the Canal",
    "description": "Kevin Cabrera, President Donald Trump's nomination as the next U.S. ambassador to Panama, said Tuesday during his confirmation hearing in Congress that China's influence in Panama extends beyond the canal's ports.\nThe post Trump Pick for Panama Envoy: Chinese…",
    "link": "https://www.breitbart.com/national-security/2025/03/26/trump-pick-for-panama-envoy-chinese-influence-goes-beyond-the-canal/",
    "timestamp": "2025-03-26T15:00:09Z"
  },
  {
    "title": "Investment Banks Reportedly Weigh Job Cuts as Dealmaking Stagnates",
    "description": "Wall Street banks are reportedly gearing up to cut staff amid ongoing economic uncertainty. Recruiters and analysts discussed the state of dealmaking in a Wednesday (March 26) Reuters report. Tariff threats by President Donald Trump have upset the stock marke…",
    "link": "https://www.pymnts.com/economy/2025/investment-banks-weigh-job-cuts-dealmaking-stagnates/",
    "timestamp": "2025-03-26T14:59:18Z"
  },
  {
    "title": "Change in itinerary for Vice President Vance brings cautious relief for Greenland and Denmark",
    "description": "Greenland and Denmark appeared cautiously relieved early Wednesday by the news that U.S. Vice President JD Vance and his wife are changing their itinerary for their visit to Greenland Friday",
    "link": "https://www.pbs.org/newshour/world/change-in-itinerary-for-vice-president-vance-brings-cautious-relief-for-greenland-and-denmark",
    "timestamp": "2025-03-26T14:59:07Z"
  },
  {
    "title": "Declassified CIA Documents Claim To Have Located Ark Of The Covenant",
    "description": "According to recently declassified CIA documents, the Ark of the Covenant — one of history’s most significant religious artifacts — was allegedly located in the 1980s.",
    "link": "https://coed.com/2025/03/26/declassified-cia-documents-claim-to-have-located-ark-of-the-covenant/",
    "timestamp": "2025-03-26T14:58:43Z"
  },
  {
    "title": "Moscow backs ceasefire despite Kiev’s breaches – Kremlin",
    "description": "Russia remains committed to the moratorium it negotiated with the US, despite concerns over Kiev’s reliability, according to Dmitry Peskov Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614811-kremlin-ukraine-unreliable-energy/",
    "timestamp": "2025-03-26T14:58:16Z"
  },
  {
    "title": "Smart as Elon Musk: Tesla floods Canada’s EV rebate program with thousands of claims in final days, equivalent to selling two cars per minute",
    "description": "Tesla has submitted numerous claims to Canada’s EV rebate program just before it ended. This has led to a government investigation to verify its legitimacy. Payments to Tesla are on hold until the review is complete. There is scrutiny from Canadian authoritie…",
    "link": "https://economictimes.indiatimes.com/news/international/us/smart-as-elon-musk-tesla-floods-canadas-ev-rebate-program-with-thousands-of-claims-in-final-days-equivalent-to-selling-two-cars-per-minute/articleshow/119544477.cms",
    "timestamp": "2025-03-26T14:58:15Z"
  },
  {
    "title": "The Atlantic releases strike group chat messages",
    "description": "On March 24th, The Atlantic’s editor-in-chief Jeffrey Goldberg published a damning story about being added to the ‘Houthi PC Small Group’ on Signal by Trump’s national security adviser Mike Waltz. In it, he described inadvertently becoming privy to high-level…",
    "link": "https://www.theverge.com/tech/636270/war-signal-group-chat",
    "timestamp": "2025-03-26T14:58:12Z"
  },
  {
    "title": "Trump’s USD1 stablecoin deepens concerns over conflicts of interest",
    "description": "World Liberty Financial (WLFI), the Trump family’s crypto project, is planning to release a stablecoin, raising concern over the US president’s exposure to the digital asset industry.The project released a memecoin immediately prior to President Donald Trump’…",
    "link": "https://cointelegraph.com/news/trump-stablecoin-usd1-conflicts-of-interest",
    "timestamp": "2025-03-26T14:57:24Z"
  },
  {
    "title": "The TikTok ban is losing support among Americans, study says | TechCrunch",
    "description": "Americans' support for a TikTok ban is declining, according to a study from the Pew Research Center. This survey of over 5,000 U.S. adults found that just",
    "link": "https://techcrunch.com/2025/03/26/the-tiktok-ban-is-losing-support-among-americans-study-says/",
    "timestamp": "2025-03-26T14:56:18Z"
  },
  {
    "title": "Experts Are Alarmed By DOGE's Latest Grab At Sensitive Data",
    "description": "Experts fear the Trump administration will wield the information – including workers’ addresses and Social Security numbers – in its immigration crackdown.",
    "link": "https://www.huffpost.com/entry/doge-unemployment-data_n_67e4019be4b077d23da21ff8",
    "timestamp": "2025-03-26T14:55:53Z"
  },
  {
    "title": "Elon Musk Probing 'Embarrassing' War Plan Leak—Mike Waltz",
    "description": "\"We've got the best technical minds looking at how this happened,\" Waltz said.",
    "link": "https://www.newsweek.com/war-plan-leak-mike-waltz-elon-musk-2050728",
    "timestamp": "2025-03-26T14:55:29Z"
  },
  {
    "title": "With his elections executive order, Trump claims powers he does not have",
    "description": "In a brazen power-grab, Donald Trump is trying to assert new powers over federal election policies. Court fights, which he's likely to lose, appear inevitable.",
    "link": "https://biztoc.com/x/59c7452cdf66dc3f",
    "timestamp": "2025-03-26T14:55:16Z"
  },
  {
    "title": "Trump wants Small Business Administration to handle student loans. Here's what borrowers need to know",
    "description": "President Donald Trump says he wants to \"immediately\" transfer federal student loans to the Small Business Administration. Here's what borrowers need to know.",
    "link": "https://biztoc.com/x/8f31f9c0eefc8c24",
    "timestamp": "2025-03-26T14:55:09Z"
  },
  {
    "title": "US tech companies plunge amid tariff concerns",
    "description": "Various technology companies trading in the United States observed a significant decline in the price of their shares after President Donald Trump insisted that the tariffs scheduled to take effect on...",
    "link": "https://biztoc.com/x/be910943f3699ca2",
    "timestamp": "2025-03-26T14:55:02Z"
  },
  {
    "title": "NATO to Putin: Attack Poland and our response will be ‘devastating’",
    "description": "European allies are increasingly worried about the U.S. commitment to NATO.",
    "link": "https://www.politico.eu/article/nato-vladimir-putin-attack-poland-response-devastating/",
    "timestamp": "2025-03-26T14:55:02Z"
  },
  {
    "title": "Rachel Zegler Reportedly Blamed for ‘Snow White’ Backlash and Death Threats Against Co-Star",
    "description": "Few Disney releases have been as divisive as Snow White, with both of the film’s stars embroiled in controversy. Related: ‘Harry Potter’: The Wizarding World’s Easter Bunny Explained The Walt Disney Company’s focus has certainly shifted over the last decade w…",
    "link": "https://insidethemagic.net/2025/03/rachel-zegler-reportedly-blamed-for-snow-white-backlash-and-death-threats-against-co-star-ld1/",
    "timestamp": "2025-03-26T14:53:48Z"
  },
  {
    "title": "Hot Emerging ETF Sees Record Outflows as China Gains",
    "description": "(Bloomberg) -- One of the most popular ETFs in emerging markets is quickly falling out of favor after a stellar two-year run as investors reassess the...",
    "link": "https://finance.yahoo.com/news/hottest-emerging-etf-sees-record-134237087.html",
    "timestamp": "2025-03-26T14:52:50Z"
  },
  {
    "title": "Dodgers' Trump visit decision sends fans spiraling",
    "description": "Los Angeles Dodgers fans on Tuesday were upset with the team's decision to visit President Donald Trump and celebrate their 2024 World Series win at the White House.",
    "link": "https://www.foxnews.com/sports/dodgers-trump-visit-decision-sends-fans-spiraling",
    "timestamp": "2025-03-26T14:52:09Z"
  },
  {
    "title": "Canada freezes Tesla rebates worth $43 million to check each one is valid",
    "description": "Tesla rebate claims spiked from 300 to about 5,800 a day in late January, shortly before the Canadian scheme ended, sparking concern of potential abuse.",
    "link": "https://www.businessinsider.com/canada-freezes-tesla-rebates-ev-check-validity-elon-musk-freeland-2025-3",
    "timestamp": "2025-03-26T14:50:55Z"
  },
  {
    "title": "China Market Update: Vice Premier Promotes Internet Companies",
    "description": "Asian equities rebounded except for Mainland China and India as President Trump appeared to soften his tariff talk, though folks might be getting tariff PTSD or started to ignore it.",
    "link": "https://www.forbes.com/sites/brendanahern/2025/03/26/china-market-update-vice-premier-promotes-internet-companies/",
    "timestamp": "2025-03-26T14:49:15Z"
  },
  {
    "title": "No application can eliminate human error: Signal’s head defends the app",
    "description": "When the editor-in-chief of The Atlantic, Jeff Goldberg, was accidentally added to a Signal conversation, things took a surprising turn. The journalist could not initially believe the authenticity of the invitation, but the chat apparently involving high-rank…",
    "link": "https://www.computerworld.com/article/3854448/j-d-vance-and-other-politicians-have-acted-irresponsibly-signals-head-defends-the-app.html",
    "timestamp": "2025-03-26T14:48:59Z"
  },
  {
    "title": "Tesla Launches in Saudi Arabia as Elon Musk Faces Attacks",
    "description": "Tesla's launch is another sign of the strengthening bond between Saudi Arabia and the Trump administration",
    "link": "https://www.newsweek.com/elon-musk-tesla-trump-doge-saudi-2050795",
    "timestamp": "2025-03-26T14:48:35Z"
  },
  {
    "title": "Trump wants Small Business Administration to handle student loans. Here's what borrowers need to know",
    "description": "President Donald Trump says he wants to \"immediately\" transfer federal student loans to the Small Business Administration. Here's what borrowers need to know.",
    "link": "https://www.cnbc.com/2025/03/26/student-loans-could-be-managed-by-the-small-business-administration-.html",
    "timestamp": "2025-03-26T14:48:01Z"
  },
  {
    "title": "Lawmakers were set to bring over $15 billion back to their home states. Then Congress passed the GOP's government funding bill.",
    "description": "Over $15 billion in earmarked funding won't be spent this year. It's vulnerable Republicans and their districts who stand to lose the most.",
    "link": "https://www.businessinsider.com/gop-spending-bill-continuing-resolution-earmarks-2025-3",
    "timestamp": "2025-03-26T14:47:26Z"
  },
  {
    "title": "Who is Pakistan's Army Chief Asim Munir? The general could be sanctioned by Donald Trump within the next few months; here's what could happen to him next",
    "description": "Pakistan's Army chief General Asim Munir is facing the unprecedented heat after the US lawmakers have sought sanctions against him.",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-pakistans-army-chief-asim-munir-the-general-could-be-sanctioned-by-donald-trump-within-the-next-few-months-heres-what-could-happen-to-him-next/articleshow/119545438.cms",
    "timestamp": "2025-03-26T14:46:44Z"
  },
  {
    "title": "US could run short of money to pay its bills by August without a debt limit deal, CBO says",
    "description": "The United States is on track to hit its statutory debt ceiling — the so-called X-date when the country runs short of money to pay its bills— as early as August.",
    "link": "https://www.bostonherald.com/2025/03/26/us-debt-ceiling-x-date/",
    "timestamp": "2025-03-26T14:45:00Z"
  },
  {
    "title": "BlackLock Ransomware Targeted by Cybersecurity Firm",
    "description": "Resecurity found an LFI flaw in the leak site of BlackLock ransomware, exposing clearnet IPs and server details. Resecurity has identified a Local File Include (LFI) vulnerability in Data Leak Site (DLS) of BlackLock Ransomware.  Cybersecurity experts were ab…",
    "link": "https://securityaffairs.com/175877/cyber-crime/blacklock-ransomware-targeted-by-cybersecurity-firm.html",
    "timestamp": "2025-03-26T14:44:58Z"
  },
  {
    "title": "Judge Boasberg Assigned to Lawsuit Over Trump Admin Signal Messages",
    "description": "Judge James Boasberg, whose impeachment President Donald Trump called for in a spat over his temporary halting of deportation flights, has been assigned a lawsuit relating to the Signal messages controversy.\nThis is a developing story and more information wil…",
    "link": "https://biztoc.com/x/b2ec67706f72ea2f",
    "timestamp": "2025-03-26T14:44:31Z"
  },
  {
    "title": "Trump open to possible ‘compensation fund’ for pardoned Jan. 6 criminals",
    "description": "Would Donald Trump reward Jan. 6 rioters with some kind of reparations? “There’s talk about that” in the administration, the president said.",
    "link": "https://biztoc.com/x/553e11cf49b366ca",
    "timestamp": "2025-03-26T14:44:25Z"
  },
  {
    "title": "Donald Trump Envoy's Ukraine Nukes Comment Sparks Anger",
    "description": "U.S. President Donald Trump's envoy for special missions, Richard Grenell, sparked backlash after claiming nuclear weapons in Ukraine after the fall of the Soviet Union were \"leftovers\" returned to Moscow.\nWhy It Matters\nUkraine had a stockpile of nuclear wea…",
    "link": "https://biztoc.com/x/45d17280cf9fcdf9",
    "timestamp": "2025-03-26T14:44:13Z"
  },
  {
    "title": "CFO optimism dropped as Trump tariff plans unfolded, survey says",
    "description": "By Howard Schneider\nWASHINGTON (Reuters) - Optimism among company chief financial officers dropped in the first quarter as tariff risks and uncertainty began to cloud an outlook among business executives that had been buoyed by President Donald Trump's electi…",
    "link": "https://biztoc.com/x/545380c986919bd9",
    "timestamp": "2025-03-26T14:44:12Z"
  },
  {
    "title": "US could run short of money to pay its bills by August without a debt limit deal, CBO says",
    "description": "WASHINGTON (AP) — The United States is on track to hit its statutory debt ceiling — the so-called X-date when the country runs short of money to pay its bills_ as early as August without a deal between lawmakers and the White House, according to a Congression…",
    "link": "https://financialpost.com/pmn/us-could-run-short-of-money-to-pay-its-bills-by-august-without-a-debt-limit-deal-cbo-says",
    "timestamp": "2025-03-26T14:43:03Z"
  },
  {
    "title": "ABA, more than 50 bar associations condemn ‘government actions that seek to twist the scales of justice’",
    "description": "More than 50 state, local and specialty bar associations have joined with the ABA to “defend the rule of law and reject efforts to undermine the courts and the legal profession.”",
    "link": "https://www.abajournal.com/news/article/aba-and-more-than-50-bar-associations-condemn-government-actions-that-seek-to-twist-the-scales-of-justice",
    "timestamp": "2025-03-26T14:43:00Z"
  },
  {
    "title": "Judge Boasberg Assigned to Lawsuit Over Trump Admin Signal Messages",
    "description": "President Donald Trump has sharply criticized Judge James Boasberg.",
    "link": "https://www.newsweek.com/judge-boasberg-assigned-lawsuit-over-trump-admin-signal-messages-2050814",
    "timestamp": "2025-03-26T14:42:58Z"
  },
  {
    "title": "MAGA melts down as judge who ruled against Trump is assigned leaked war plans lawsuit",
    "description": "U.S. District Court Judge James Boasberg was randomly chosen Wednesday to preside over the scandal some are beginning to call \"Signalgate.\" On Monday, a bombshell piece in The Atlantic reported that Secretary of Defense Pete Hegseth shared secret war plans in…",
    "link": "https://www.rawstory.com/signal-scandal-2671494591/",
    "timestamp": "2025-03-26T14:42:35Z"
  },
  {
    "title": "Academic groups sue Trump administration for arresting students and faculty linked to pro-Palestinian protests",
    "description": "Academic groups of professors and scholars have filed a lawsuit against the Trump administration, claiming the arrests of noncitizen students and faculty who participate in pro-Palestinian protests are unconstitutional.",
    "link": "https://www.nbcnews.com/news/us-news/academic-groups-sue-trump-administration-arresting-students-faculty-li-rcna198139",
    "timestamp": "2025-03-26T14:39:21Z"
  },
  {
    "title": "What Tulsi Gabbard Said About North Korea's Nuclear Weapons",
    "description": "Gabbard said that Kim Jong Un is likely preparing to order North Korea's first nuclear test in over six years.",
    "link": "https://www.newsweek.com/dni-tulsi-gabbard-senate-intelligence-hearing-north-korea-nuclear-weapons-2050702",
    "timestamp": "2025-03-26T14:39:11Z"
  },
  {
    "title": "Trump signs sweeping executive order targeting mail-in voting, proof of citizenship, and federal election rules: Will it secure elections or lead to voter suppression? Here’s everything you need to know",
    "description": "Trump signs sweeping executive order aimed at changing U.S. election rules, introducing stricter deadlines for mail-in ballots and adding proof of citizenship for voter registration. The order mandates that all ballots must be received by Election Day, which …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-signs-sweeping-executive-order-targeting-mail-in-voting-proof-of-citizenship-and-federal-election-rules-will-it-secure-elections-or-lead-to-voter-suppression-heres-everything-you-need-to-know/articleshow/119541959.cms",
    "timestamp": "2025-03-26T14:38:41Z"
  },
  {
    "title": "Donald Trump Envoy's Ukraine Nukes Comment Sparks Anger",
    "description": "The remarks were \"totally disgraceful,\" Oleksandr Merezkho, the chair of Ukraine's parliamentary Foreign Affairs Committee told Newsweek.",
    "link": "https://www.newsweek.com/donald-trump-richard-grenell-outrage-ukraine-nuclear-weapons-russia-budapest-memorandum-2050634",
    "timestamp": "2025-03-26T14:38:39Z"
  },
  {
    "title": "Judge Trump Said Should Be Impeached for Suspending Deportations Just Got Assigned to New Signal Chat Lawsuit",
    "description": "Judge James Boasberg has now been assigned to preside over a new lawsuit filed regarding the Trump administration's Signalgate scandal.\nThe post Judge Trump Said Should Be Impeached for Suspending Deportations Just Got Assigned to New Signal Chat Lawsuit firs…",
    "link": "https://www.mediaite.com/news/judge-trump-said-should-be-impeached-for-suspending-deportations-just-got-assigned-to-new-signal-chat-lawsuit/",
    "timestamp": "2025-03-26T14:36:06Z"
  },
  {
    "title": "Victoria's Secret and Tesla face French boycott as anti-Trump feeling surges (Giorgio Leali/Politico)",
    "description": "Giorgio Leali / Politico:\nVictoria's Secret and Tesla face French boycott as anti-Trump feeling surges  —  PARIS ― Donald Trump is fueling France's famous economic patriotism.  —  A majority of the French population is considering boycotting United States bra…",
    "link": "https://www.memeorandum.com/250326/p41",
    "timestamp": "2025-03-26T14:35:03Z"
  },
  {
    "title": "Stocks Are Not Out Of The Tariff Woods Yet, Wall Street Warns",
    "description": "Barclays strategists slashed their S&P 500 price target by more than 10% Wednesday, citing the potential for tariffs to cause a “material slowing” in economic activity.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/26/stocks-are-not-out-of-the-tariff-woods-yet-wall-street-warns/",
    "timestamp": "2025-03-26T14:34:59Z"
  },
  {
    "title": "Dollar Tree says it's winning over higher-income shoppers and may offset tariffs with price hikes",
    "description": "Dollar Tree said it could use negotiations, manufacturing changes and price increases to mitigate the effects of Trump's tariffs.",
    "link": "https://www.cnbc.com/2025/03/26/dollar-tree-family-dollar-sale-earnings-tariffs.html",
    "timestamp": "2025-03-26T14:34:28Z"
  },
  {
    "title": "Trump: We need Greenland for intl. security",
    "description": "United States President Donald Trump reiterated on Wednesday that his country needs to acquire Greenland for \"international security.\"\"We have to have it,\" the US president told reporters. His comment...",
    "link": "https://biztoc.com/x/8675ecfb1b6e71ec",
    "timestamp": "2025-03-26T14:33:05Z"
  },
  {
    "title": "Could Trump force us to pay more for our medicines? - podcast",
    "description": "Big pharma is eyeing Australia’s Pharmaceutical Benefits Scheme, as they lobby Donald Trump to demand higher prices for their medicines. Anthony Albanese has promised to bring down the price of PBS-listed medicines to no more than $25 a script, while the Coal…",
    "link": "https://biztoc.com/x/c8cd62f9ae411431",
    "timestamp": "2025-03-26T14:32:37Z"
  },
  {
    "title": "'Not constitutionally permissible': Ex-Trump lawyer says GOP judge impeachment will 'fail'",
    "description": "Law professor Alan Dershowitz, a defender of President Donald Trump, insisted Republican attempts to impeach judges ruling against the Trump administration were \"not constitutionally permissible\" and would eventually fail.During a Wednesday interview on Real …",
    "link": "https://www.rawstory.com/alan-dershowitz-judge-impeachment/",
    "timestamp": "2025-03-26T14:31:40Z"
  },
  {
    "title": "Trump ‘would love to’ stop NPR and PBS from receiving federal funding",
    "description": "President Donald Trump said he \"would love to\" remove federal funding for mainstream news outlets NPR and PBS during a meeting at the White House on Tuesday.",
    "link": "https://nypost.com/2025/03/26/us-news/trump-says-he-would-be-honored-to-see-npr-and-pbs-end/",
    "timestamp": "2025-03-26T14:30:53Z"
  },
  {
    "title": "Immutable Exonerated: SEC Drops Investigation Into Web3 Gaming Company",
    "description": "On Tuesday, crypto company Immutable announced that the US Securities and Exchange Commission (SEC) has officially closed its inquiry into the company and its associated parties.  This comes after the SEC previously issued a Wells notice, which signaled its i…",
    "link": "https://bitcoinist.com/immutable-exonerated-sec-drops-investigation/",
    "timestamp": "2025-03-26T14:30:43Z"
  },
  {
    "title": "Researchers in limbo as Columbia bows to Trump’s demands in bid to restore $400M federal funding",
    "description": "Researchers at Columbia University remain in limbo after the Ivy League institution bowed to the Trump administration’s demands for unprecedented changes in a bid to restore some $400 million in federal funds cut.",
    "link": "https://www.click2houston.com/news/politics/2025/03/26/researchers-in-limbo-as-columbia-bows-to-trumps-demands-in-bid-to-restore-400m-federal-funding-cut/",
    "timestamp": "2025-03-26T14:30:37Z"
  },
  {
    "title": "Bitcoin price just ditched a 3-month downtrend as 'key shift' begins",
    "description": "Bitcoin (BTC) saw the return of US selling pressure at the March 26 Wall Street open as analysis eyed a “key shift in market structure.”BTC/USD 1-hour chart. Source: Cointelegraph/TradingView\r\nBitcoin sees classic US dip as dollar gains\r\nData from Cointelegra…",
    "link": "https://cointelegraph.com/news/bitcoin-price-just-ditched-3-month-downtrend-key-shift-begins",
    "timestamp": "2025-03-26T14:30:03Z"
  }
]