[
  {
    "title": "How U.S. Tariffs Will Impact the French Beauty Industry in 2026",
    "description": "Export sales of 620 million euros could be lost and 10,900 jobs directly or indirectly threatened.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/how-us-tariffs-will-impact-french-beauty-industry-2026-1238331555/",
    "timestamp": "2025-10-31T16:46:22Z"
  },
  {
    "title": "Theo Von 'Scared' After DHS Used Video of Him in Immigration Promo",
    "description": "Comedian Theo Von is once again addressing the Department of Homeland Security using a video of him to promote ongoing deportations ... vulnerably revealing he was \"scared\" after DHS published the clip. Theo speaks about the situation on Friday's…",
    "link": "https://www.tmz.com/2025/10/31/theo-von-scared-dhs-immigration-promo/",
    "timestamp": "2025-10-31T16:46:07Z"
  },
  {
    "title": "‘Morning Joe’ Says Trump Is Turning the White House Into a ‘Country Club for the Wealthy and Rich’ | Video",
    "description": "\"No average American will ever see the inside of that ballroom,\" co-anchor Willie Geist says\nThe post ‘Morning Joe’ Says Trump Is Turning the White House Into a ‘Country Club for the Wealthy and Rich’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/morning-joe-trump-white-house-ballroom-wealthy-country-club-segment-video/",
    "timestamp": "2025-10-31T16:45:38Z"
  },
  {
    "title": "South Africa hits back at US refugee plan to favour white Afrikaners",
    "description": "Pretoria rubbishes claims of a white genocide and quotes prominent Afrikaners who dub Trump's plans racist.",
    "link": "https://www.bbc.com/news/articles/c1e3de5ny14o",
    "timestamp": "2025-10-31T16:45:28Z"
  },
  {
    "title": "Syria's Jihadi President Says Syria Has Raised $28 Billion in Investment in 6 Months",
    "description": "Syrian President Ahmed al-Sharaa boasted that his nascent government has attracted $28 billion in investment for post-war reconstruction.\nThe post Syria’s Jihadi President Says Syria Has Raised $28 Billion in Investment in 6 Months appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/10/31/syrias-jihadi-president-says-syria-has-raised-28-billion-investment-6-months/",
    "timestamp": "2025-10-31T16:44:07Z"
  },
  {
    "title": "JUST IN: Trump Denies He’s Already Made Decision to Attack Venezuela",
    "description": "President Donald Trump shot down reports that he has made the decision to attack Venezuela on Friday.\nThe post JUST IN: Trump Denies He’s Already Made Decision to Attack Venezuela first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/just-in-trump-denies-hes-already-made-decision-to-attack-venezuela/",
    "timestamp": "2025-10-31T16:43:55Z"
  },
  {
    "title": "Trump got a short-term win in Argentina. The long term is much harder.",
    "description": "President Donald Trump helped Argentinian president Javier Milei with a bailout, but questions remain about the future of the country's economic reforms.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/argentina-milei-trump-bailout-economy-rcna240781",
    "timestamp": "2025-10-31T16:41:43Z"
  },
  {
    "title": "J. D. Vance Needs Better Answers to the Right’s Anti-Semites",
    "description": "Does he want them?",
    "link": "https://www.theatlantic.com/politics/archive/2025/10/jd-vance-answer-anti-semitism/684780/",
    "timestamp": "2025-10-31T16:41:41Z"
  },
  {
    "title": "J. D. Vance’s Bad Answer to an Anti-Semitic Question",
    "description": "The vice president will need to choose between accommodating and rejecting the right’s anti-Semites.",
    "link": "https://www.theatlantic.com/politics/archive/2025/10/jd-vance-answer-anti-semitism/684780/?utm_source=yahoo-news",
    "timestamp": "2025-10-31T16:41:41Z"
  },
  {
    "title": "Exclusive Interview: “Germany Is No Longer a Democracy”: AfD’s Deputy Parliamentary Leader Beatrix von Storch Blasts Political Persecution and EU Censorship",
    "description": "This interview was conducted by Alexander Junger and originally published by Eagle Eye Explore on October 2nd, 2025.\nThe post Exclusive Interview: “Germany Is No Longer a Democracy”: AfD’s Deputy Parliamentary Leader Beatrix von Storch Blasts Political Persec…",
    "link": "https://www.thegatewaypundit.com/2025/10/exclusive-interview-germany-is-no-longer-democracy-afds/",
    "timestamp": "2025-10-31T16:40:42Z"
  },
  {
    "title": "The Big Lie Behind Trump’s Boat Strikes",
    "description": "The Trump administration is training the press and the American people to associate the military strikes on small boats in international waters with stopping the flow of fentanyl and other drugs. This mendacity is a prime example of the falsehoods that imperi…",
    "link": "https://www.project-syndicate.org/commentary/trump-big-lies-drug-boat-strikes-venezuela-by-timothy-snyder-2025-10",
    "timestamp": "2025-10-31T16:40:35Z"
  },
  {
    "title": "These cowards can still stop Trump — and history will condemn them if they don't",
    "description": "Dear Majority Leader Thune and House Speaker Johnson,Under your leaderships, the wholesale surrender of constitutional powers of Congress to the White House has been appalling. You both took oaths to defend and preserve the Constitution under Article VI. In v…",
    "link": "https://www.rawstory.com/mike-johnson-2674253856/",
    "timestamp": "2025-10-31T16:40:16Z"
  },
  {
    "title": "Big-Tech Winning Streak Eyes History Books Amid Blowout Earnings",
    "description": "The benchmark is poised to notch its sixth-straight month of gains after soaring nearly 40% from its April nadir in one of the fastest recoveries in stock...",
    "link": "https://finance.yahoo.com/news/big-tech-winning-streak-eyes-143900725.html",
    "timestamp": "2025-10-31T16:39:04Z"
  },
  {
    "title": "Embarrassed Democrats Admit They Can't Remember Why They Shut The Government Down",
    "description": "WASHINGTON, D.C. — Democratic lawmakers quietly admitted on Friday that they can't seem to remember why they shut down the government in the first place. Washington insiders confirmed that the party had held several closed-door meetings to try and figure out …",
    "link": "https://freerepublic.com/focus/f-bloggers/4349821/posts",
    "timestamp": "2025-10-31T16:36:32Z"
  },
  {
    "title": "Trump rules out restarting US-Canada trade talks after Ontario ad row",
    "description": "Speaking on Friday, Trump reiterated that the United States “will not restart” discussions with Ottawa, despite growing pressure from within Congress and a Senate resolution passed Thursday seeking to roll back his Canada tariffs.",
    "link": "https://indianexpress.com/article/world/trump-rules-out-restarting-us-canada-trade-talks-after-ontario-ad-row-10338745/",
    "timestamp": "2025-10-31T16:36:13Z"
  },
  {
    "title": "Coinbase defends funding of White House ballroom after East Wing demolished",
    "description": "Coinbase's chief policy officer pushed back against many of the claims leveled by Senator Chris Murphy, including a quid pro quo relationship between Donald Trump and the exchange.",
    "link": "https://cointelegraph.com/news/coinbase-white-house-ballroom-demolition",
    "timestamp": "2025-10-31T16:36:03Z"
  },
  {
    "title": "Trump Says Canada Trade Talks Won’t Resume, Contradicting Wright",
    "description": "US President Donald Trump said he received an apology from Canadian Prime Minister Mark Carney over a television ad that opposed tariffs, but suggested that trade talks between the two countries won’t restart.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-canada-trade-talks-wont-resume-contradicting-wright",
    "timestamp": "2025-10-31T16:35:26Z"
  },
  {
    "title": "Venezuela opposition split over possible U.S. action",
    "description": "(Reuters) -The two main leaders of Venezuela's opposition are increasingly divided over looming U.S. actions targeting the country, even as a crackdown against opposition figures continues, politicians and analysts say. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/01/venezuela-opposition-split-over-possible-us-action",
    "timestamp": "2025-10-31T16:34:00Z"
  },
  {
    "title": "Trump and Xi skip Taiwan talk despite years of war preparations",
    "description": "Trump and Xi Jinping avoided discussing Taiwan during their recent meeting, despite escalating military tensions and China's increased pressure on the island.",
    "link": "https://www.foxnews.com/politics/trump-xi-skip-taiwan-talk-despite-growing-war-risk",
    "timestamp": "2025-10-31T16:33:37Z"
  },
  {
    "title": "MAGA Splits Over Trump’s Calls to End Filibuster: ‘Tread Lightly’",
    "description": "President Donald Trump’s MAGA supporters appeared split after he called on the Senate to scrap the filibuster to clear the way for the end of the federal government shutdown.\n\"THE CHOICE IS CLEAR—INITIATE THE ‘NUCLEAR OPTION,’ GET RID OF THE FILIBUSTER,\" Trum…",
    "link": "https://biztoc.com/x/2bc1b5c3d2a417ec",
    "timestamp": "2025-10-31T16:30:56Z"
  },
  {
    "title": "Less talk of Trump, more focus on economy is part of the Democrats’ playbook for Tuesday’s election",
    "description": "Democrat Abigail Spanberger is more eager to talk about struggling soybean farmers than President Donald Trump’s attack on American institutions.",
    "link": "https://biztoc.com/x/2687774996535716",
    "timestamp": "2025-10-31T16:30:20Z"
  },
  {
    "title": "Donald Trump Gives Update on Possible Strikes Inside Venezuela",
    "description": "Trump's admin has recently conducted a series of strikes on boats in the Pacific Ocean that officials said were carrying drugs.",
    "link": "https://biztoc.com/x/db8523dedac29422",
    "timestamp": "2025-10-31T16:30:12Z"
  },
  {
    "title": "Venezuela Begs Moscow for Military Assistance & Missiles in Face of Trump Threats",
    "description": "Venezuelan socialist dictator Nicolas Maduro is begging Putin for help as pressure from Donald Trump ramps up on his regime. A dog appeals to its owner… According to a US intelligence briefing given to the Washington Post, Maduro has requested from Russia: He…",
    "link": "https://order-order.com/2025/10/31/venezuela-begs-moscow-for-military-assistance-missiles-in-face-of-trump-threats/",
    "timestamp": "2025-10-31T16:28:46Z"
  },
  {
    "title": "The US-China rare earths deal shows the importance of critical materials in a new era of strategic interdependence",
    "description": "The accelerating shift to clean energy and advanced technologies is redrawing the map of global economic power. As nations and firms race to secure critical minerals, rare earths – small in trade value but high in strategic impact – have emerged as chokepoint…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/10/31/the-us-china-rare-earths-deal-shows-the-importance-of-critical-materials-in-a-new-era-of-strategic-interdependence/",
    "timestamp": "2025-10-31T16:28:45Z"
  },
  {
    "title": "'There Is No Ceasefire' Say Gazans as Israeli Strikes Kill, Wound Hundreds",
    "description": "More than 800 Palestinians have been killed or wounded since the October 10 truce between Israel and Hamas, leaving many residents of the still-embattled, still-starved strip to question whether there is actually any \"ceasefire\" at all.“There is no ceasefire,…",
    "link": "https://www.commondreams.org/news/israel-violates-gaza-ceasefire",
    "timestamp": "2025-10-31T16:28:13Z"
  },
  {
    "title": "Joe Scarborough Drops Fact Check On Democrat After He Pushes Baseless Theory About Trump-Epstein",
    "description": "Joe Scarborough told Seth Moulton to make his allegations about Donald Trump’s supposed ties with Jeffrey Epstein on the floor of the House of Representatives.",
    "link": "https://dailycaller.com/2025/10/31/joe-scarborough-drops-fact-check-on-democrat-after-he-pushes-baseless-theory-about-trump-epstein/",
    "timestamp": "2025-10-31T16:27:39Z"
  },
  {
    "title": "White House responds to reports of Trump preparing to hit military targets inside Venezuela",
    "description": "The White House cast doubt on media reports suggesting President Donald Trump's administration is poised to strike military targets in Venezuela imminently.",
    "link": "https://www.foxnews.com/politics/white-house-responds-reports-trump-preparing-hit-military-targets-inside-venezuela",
    "timestamp": "2025-10-31T16:27:35Z"
  },
  {
    "title": "Less talk of Trump, more focus on economy is part of the Democrats’ playbook for Tuesday’s election",
    "description": "Democrat Abigail Spanberger is more eager to talk about struggling soybean farmers than President Donald Trump’s attack on American institutions.",
    "link": "https://www.pbs.org/newshour/politics/less-talk-of-trump-more-focus-on-economy-is-part-of-the-democrats-playbook-for-tuesdays-election",
    "timestamp": "2025-10-31T16:26:34Z"
  },
  {
    "title": "Ohio Unanimously Approves New GOP-Leaning Map As Redistricting Battle Escalates Nationwide",
    "description": "Ohio approved a new congressional map on Friday that could hand Republicans two additional seats in the 2026 midterms.",
    "link": "https://dailycaller.com/2025/10/31/ohio-unanimously-approves-new-gop-leaning-map-as-redistricting-battle-escalates-nationwide/",
    "timestamp": "2025-10-31T16:26:33Z"
  },
  {
    "title": "Mamdani Is Winning Because Democrats Hate Their Party’s Leaders",
    "description": "Former Obama adviser Patrick Gaspard is aiding Zohran Mamdani’s campaign and sees many similarities in their political rises.",
    "link": "https://newrepublic.com/article/202540/mamdani-winning-democrats-hate-party-leaders",
    "timestamp": "2025-10-31T16:22:32Z"
  },
  {
    "title": "AbbVie says Trump pressing for larger Medicare drug price cuts",
    "description": "(Reuters) -AbbVie said on Friday the Trump administration was pushing for steeper cuts in this year's Medicare drug price negotiations, which in 2024 yielded...",
    "link": "https://finance.yahoo.com/news/abbvie-says-trump-pressing-larger-161947842.html",
    "timestamp": "2025-10-31T16:19:47Z"
  },
  {
    "title": "Trump’s Move to Resume Nuke Testing ‘Is Weakness Masquerading in Strength,’ Newsom Tells Meet the Press",
    "description": "California Governor Gavin Newsom (D) went off on President Donald Trump's nuclear testing announcement in an upcoming interview with Meet the Press.\nThe post Trump’s Move to Resume Nuke Testing ‘Is Weakness Masquerading in Strength,’ Newsom Tells Meet the Pre…",
    "link": "https://www.mediaite.com/media/tv/trumps-move-to-resume-nuke-testing-is-weakness-masquerading-in-strength-newsom-tells-meet-the-press/",
    "timestamp": "2025-10-31T16:19:16Z"
  },
  {
    "title": "Hegseth On Fentanyl, Narco-Terrorists, And America’s Response: ‘It’s Self-Defense’",
    "description": "By Steve Yates via The Daily Signal | October 30, 2025\nSince President Donald Trump returned to office in January, his administration has taken a number of decisive actions to reduce the flow of illicit fentanyl into America and eliminate the devastation it w…",
    "link": "https://biztoc.com/x/3b75bfae3ec5d09d",
    "timestamp": "2025-10-31T16:19:12Z"
  },
  {
    "title": "The One Thing Republicans Will Deny Trump",
    "description": "Trump is asking Republicans to give him the one thing they will likely deny him: an end to the filibuster.",
    "link": "http://nymag.com/intelligencer/article/why-republicans-will-deny-trumps-filibuster-demand.html",
    "timestamp": "2025-10-31T16:18:56Z"
  },
  {
    "title": "DHS, White House Shrug Off Having Their Social Media Lies Pointed Out To Them",
    "description": "It surprises absolutely no one that the Trump administration lies. Trump himself has been lying constantly ever since his first spin in the resolute desk chair. His new administration is right there with him this time around, ensuring we see nothing but a flo…",
    "link": "https://www.techdirt.com/2025/10/31/dhs-white-house-shrug-off-having-their-social-media-lies-pointed-out-to-them/",
    "timestamp": "2025-10-31T16:18:34Z"
  },
  {
    "title": "POLL: Trump’s Support Among Gen Z Voters Collapsing Not Long After 2024",
    "description": "Trump's support among young people has collapsed since his honeymoon phase, according to an Economist/YouGov poll of over 1,600 Americans conducted Oct. 24-27.",
    "link": "https://dailycaller.com/2025/10/31/donald-trump-support-young-americans-generations-gen-z-down-yougov-poll-economy-inflation/",
    "timestamp": "2025-10-31T16:16:43Z"
  },
  {
    "title": "Harrison Ford Slams Trump on Climate: ‘I Don’t Know of a Greater Criminal in History’",
    "description": "\"He’s an instrument of the status quo and he’s making money, hand over fist, while the world goes to hell in a hand basket,\" actor says of the president",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/harrison-ford-slams-trump-climate-change-1235457726/",
    "timestamp": "2025-10-31T16:16:09Z"
  },
  {
    "title": "Kamala Harris surprises Jon Stewart with claim that Biden was competent to serve second term",
    "description": "Former Vice President Kamala Harris surprised Jon Stewart by defending Joe Biden's fitness for a second term, distinguishing between campaigning abilities and presidential competence.",
    "link": "https://www.foxnews.com/media/kamala-harris-surprises-jon-stewart-claim-biden-competent-serve-second-term",
    "timestamp": "2025-10-31T16:15:09Z"
  },
  {
    "title": "Senate rebukes Trump’s trade agenda in a series of rare, bipartisan votes",
    "description": "Given how low standards have fallen, this week's bipartisan Senate votes against the White House's trade policies represent a modest breakthrough.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/senate-rebukes-trumps-trade-agenda-series-rare-bipartisan-votes-rcna241137",
    "timestamp": "2025-10-31T16:14:25Z"
  },
  {
    "title": "ICE Being ICE Again, Noem Lying About Everything Again",
    "description": "Must be a day that ends in heavy drinking, huh?",
    "link": "https://www.wonkette.com/p/ice-being-ice-again-noem-lying-about",
    "timestamp": "2025-10-31T16:13:50Z"
  },
  {
    "title": "Good Morning, News: Portland City Council Scandals, Non-Scandals, and Nothing-to-See-Heres",
    "description": "by Suzette Smith\n \n \n \n If you appreciate the Mercury's interesting and useful news & culture reporting, consider making a small monthly contribution to support our editorial team. Your donation is tax-deductible. You can also subscribe and have our papers de…",
    "link": "https://www.portlandmercury.com/good-morning-news/2025/10/31/48097484/good-morning-news-portland-city-council-scandals-non-scandals-and-nothing-to-see-heres",
    "timestamp": "2025-10-31T16:12:00Z"
  },
  {
    "title": "Brawl Breaks Out on The View Over Gavin Newsom’s Claim Midterm Elections Could Be Rigged",
    "description": "The View co-hosts played comments from Gov. Gavin Newsom (D-CA) Friday that kicked off a brawl over the upcoming elections.\nThe post Brawl Breaks Out on The View Over Gavin Newsom’s Claim Midterm Elections Could Be Rigged first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/brawl-breaks-out-on-the-view-over-gavin-newsoms-claim-midterm-elections-could-be-rigged/",
    "timestamp": "2025-10-31T16:11:46Z"
  },
  {
    "title": "Seth Moulton Talks About Trump And Epstein Files, Scarborough Gets Spooked",
    "description": "The Morning Joe panel was talking about the next election cycle with Rep. Seth Moulton and what he thought were the big issues.\n\"Subsidies for the Affordable Care Act, taking away people's health care with the so-called big beautiful bill. Hospitals closing i…",
    "link": "https://crooksandliars.com/2025/10/seth-moulton-talks-about-trump-and-epstein",
    "timestamp": "2025-10-31T16:11:06Z"
  },
  {
    "title": "Jebus Johnson: Saving Healthcare And SNAP Are 'Little Things' Dems Want",
    "description": "Mike Johnson continues to downplay the significance of SNAP benefits, cuts to Medicaid, and expiring ACA subsides by claiming they are \"little things\" the Democrats want to make passed to feel better during the shutdown.\nTrump went MIA during the shutdown and…",
    "link": "https://crooksandliars.com/2025/10/jebus-johnson-calls-saving-medicaid-and",
    "timestamp": "2025-10-31T16:10:50Z"
  },
  {
    "title": "Disney Executives Blast YouTube TV, Google for Not Being Interested in ‘a Fair Deal’ Amid Programming Blackout",
    "description": "Dana Walden, Alan Bergman and Jimmy Pitaro argue the tech giant wants to \"use their power and extraordinary resources to eliminate competition\"\nThe post Disney Executives Blast YouTube TV, Google for Not Being Interested in ‘a Fair Deal’ Amid Programming Blac…",
    "link": "https://www.thewrap.com/disney-executives-blast-youtube-tv-google-amid-programming-blackout/",
    "timestamp": "2025-10-31T16:09:22Z"
  },
  {
    "title": "Trump grants temporary relief on EPA copper rule",
    "description": "United States President Donald Trump approved a two-year exemption for domestic copper smelters from compliance with new Environmental Protection Agency (EPA) emissions standards, according to a procl...",
    "link": "https://biztoc.com/x/ac2400db6d65ad74",
    "timestamp": "2025-10-31T16:08:58Z"
  },
  {
    "title": "Trump won't restart trade talks with Canada",
    "description": "United States President Donald Trump said on Friday that he does not intend to restart tariff negotiations with Canada. More to come......",
    "link": "https://biztoc.com/x/95478b738932d82a",
    "timestamp": "2025-10-31T16:08:46Z"
  },
  {
    "title": "Trump denies Venezuela strike plans",
    "description": "United States President Donald Trump denied reports that he is planning strikes against Venezuela.Aboard Air Force One on Friday, the American head of state responded to a question about whether he wa...",
    "link": "https://biztoc.com/x/45266a4382c4e2e9",
    "timestamp": "2025-10-31T16:08:44Z"
  },
  {
    "title": "Trump: Deal with China to be 'long-lasting'",
    "description": "United States President Donald Trump told reporters on board Air Force One on Friday that the recently struck deal with China will be \"long-lasting.\"Further talking about Washington-Beijing relations,...",
    "link": "https://biztoc.com/x/60decb252e58ce41",
    "timestamp": "2025-10-31T16:08:28Z"
  },
  {
    "title": "China’s Xi promises to protect free trade at APEC as Trump snubs major summit",
    "description": "“The more turbulent the times, the more we must work together,” Chinese leader Xi Jinping said during APEC's opening session.",
    "link": "https://www.pbs.org/newshour/world/chinas-xi-promises-to-protect-free-trade-at-apec-as-trump-snubs-major-summit",
    "timestamp": "2025-10-31T16:07:31Z"
  },
  {
    "title": "At MOCA Geffen and The Brick, “Monuments” Probes the Line Between History and Propaganda",
    "description": "The exhibition confronts the mythology of the Confederacy by placing toppled monuments in dialogue with contemporary works about race, history and memory.",
    "link": "https://observer.com/2025/10/art-exhibition-review-monuments-at-moca-geffen-and-the-brick/",
    "timestamp": "2025-10-31T16:06:35Z"
  },
  {
    "title": "Filibuster Fatigue: Amid Shutdown, Trump Calls for End of Senate Hurdle",
    "description": "President Donald Trump on social media Thursday night called for an end to the filibuster, a longtime procedural hurdle that prevents legislation from passing the... Read More\nThe post Filibuster Fatigue: Amid Shutdown, Trump Calls for End of Senate Hurdle ap…",
    "link": "https://www.dailysignal.com/2025/10/31/filibuster-fatigue-trump-calls-end-senate-hurdle/",
    "timestamp": "2025-10-31T16:05:00Z"
  },
  {
    "title": "DOT vows 'serious consequences' for CDL mills, carriers, shippers hiring 'illegal alien' drivers",
    "description": "After news of 40 \"illegal alien\" CDL drivers caught in an ICE raid in Indiana, DOT's Duffy and FMCSA Administrator Barrs vow to \"stop at nothing\" to keep dangerous drivers off the road.",
    "link": "https://www.overdriveonline.com/business/article/15770726/dot-to-go-after-cdl-mills-companies-that-hire-illegal-alien-drivers-along-with-more-ice-raids",
    "timestamp": "2025-10-31T16:04:57Z"
  },
  {
    "title": "Israel hands over bodies of 30 Palestinians, Gaza hospital officials say",
    "description": "The ceasefire is moving forward, despite deadly Israeli strikes on Gaza this week.",
    "link": "https://www.bostonherald.com/2025/10/31/israel-hamas-war-bodies-exchanged/",
    "timestamp": "2025-10-31T16:04:56Z"
  },
  {
    "title": "US says 'non-market' tactics needed to counter China's rare earth dominance",
    "description": "G7 countries will have to use \"non-market\" tactics to curb China's dominance in rare earth production, the US energy secretary said Friday, calling the...",
    "link": "https://finance.yahoo.com/news/us-says-non-market-tactics-160450420.html",
    "timestamp": "2025-10-31T16:04:50Z"
  },
  {
    "title": "Embarrassed Democrats Admit They Can't Remember Why They Shut The Government Down",
    "description": "WASHINGTON, D.C. — Democratic lawmakers quietly admitted on Friday that they can't seem to remember why they shut down the government in the first place.",
    "link": "https://babylonbee.com/news/embarrassed-democrats-admit-they-cant-remember-why-they-shut-the-government-down",
    "timestamp": "2025-10-31T16:03:45Z"
  },
  {
    "title": "VICTOR DAVIS HANSON: Are Americans Better Or Worse Off Since January?",
    "description": "The left wing and media rage hysterically, but what matters is the data and facts of Trump's first nine months since January 20, 2025.",
    "link": "https://dailycaller.com/2025/10/31/americans-better-worse-off-donald-trump-january-victor-davis-hanson/",
    "timestamp": "2025-10-31T16:03:23Z"
  },
  {
    "title": "Trump says US, Canada will not restart trade talks",
    "description": "President Donald Trump said on Friday the United States and Canada will not restart trade talks, a week after he called off negotiations over an...",
    "link": "https://www.yahoo.com/news/articles/trump-says-us-canada-not-160309284.html",
    "timestamp": "2025-10-31T16:03:09Z"
  },
  {
    "title": "‘Gave the game away’: GOP accused of revealing 'inhumane' plan with unintentional slip",
    "description": "Recent comments by House Speaker Mike Johnson (R-LA) revealed that the Donald Trump administration had let slip its intention to starve tens of millions of Americans who rely on federal food assistance, columnist Peter Rothpletz argued Friday in an analysis o…",
    "link": "https://www.rawstory.com/snap-2674254120/",
    "timestamp": "2025-10-31T16:02:18Z"
  },
  {
    "title": "‘I Was Angry!’ Kamala Harris Gripes Biden Call Just Before Trump Debate Showed He’s ‘All About Himself’",
    "description": "Kamala Harris told podcast host Steven Bartlett that she was \"angry\" after a phone call from Biden just before she was about to debate Trump,\nThe post ‘I Was Angry!’ Kamala Harris Gripes Biden Call Just Before Trump Debate Showed He’s ‘All About Himself’ firs…",
    "link": "https://www.mediaite.com/media/podcasts/i-was-angry-kamala-harris-gripes-biden-call-just-before-trump-debate-showed-hes-all-about-himself/",
    "timestamp": "2025-10-31T16:01:57Z"
  },
  {
    "title": "Alyssa Farah Griffin Slams Gavin Newsom’s ‘Wholly Irresponsible’ Fear Mongering About Future Elections",
    "description": "\"The View\" co-host Alyssa Farah Griffin criticized Democratic California Gov. Gavin Newsom's dire claims about future elections under President Donald Trump.",
    "link": "https://dailycaller.com/2025/10/31/the-view-alyssa-farah-griffin-gavin-newsom-elections/",
    "timestamp": "2025-10-31T16:01:37Z"
  },
  {
    "title": "Viral on X: Donald Trump and Melania recreated the iconic 2019 candy meme at White House Halloween bash",
    "description": "The White House celebrated Halloween with President Donald Trump and First Lady Melania Trump hosting children. Children received candy from the President and First Lady. President Trump recreated a viral moment by placing candy on a child's head. The event f…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/viral-on-x-donald-trump-and-melania-recreated-the-iconic-2019-candy-meme-at-white-house-halloween-bash/articleshow/124998824.cms",
    "timestamp": "2025-10-31T16:01:17Z"
  },
  {
    "title": "Trump just kneecapped the GOP’s shutdown strategy",
    "description": "After the government had been shut down for nearly a month, a conspicuously quiet President Donald Trump finally weighed in with a prescription for how to...",
    "link": "https://www.cnn.com/2025/10/31/politics/donald-trump-end-shutdown-filibuster",
    "timestamp": "2025-10-31T16:00:59Z"
  },
  {
    "title": "Introducing ‘Love You for You:’ Conversations Between Trans Kids and Their Loved Ones",
    "description": "KQED's new series, \"Love You for You,\" features trans and nonbinary youth from across California in conversation with people in their lives who love, support and mentor them so they can thrive.",
    "link": "https://www.kqed.org/news/12061805/introducing-love-you-for-you-conversations-between-trans-kids-and-their-loved-ones",
    "timestamp": "2025-10-31T16:00:20Z"
  },
  {
    "title": "Heather Cox Richardson: Ominous Signs of Trump’s Use of the Military in Cities",
    "description": "Heather Cox Richardson draws together the seams of a story that is unfolding piece by piece. Trump’s popularity is plummeting; he is obsessed with his poll numbers. At the same time, he is assembling military forces to control Democratic-run cities where ther…",
    "link": "https://dianeravitch.net/2025/10/31/heather-cox-richardson-ominous-signs-of-trumps-use-of-the-military-in-cities/",
    "timestamp": "2025-10-31T16:00:00Z"
  },
  {
    "title": "Pentagon reportedly prepping thousands of National Guard for nationwide crackdown",
    "description": "Newly unearthed Pentagon documents show the Trump administration is training more than 20,000 National Guard troops as “quick reaction forces” with “civil unrest training,” ready to deploy by April 1.",
    "link": "https://www.msnbc.com/top-stories/latest/pentagon-national-guard-quick-reaction-force-rcna240966",
    "timestamp": "2025-10-31T15:59:13Z"
  },
  {
    "title": "Judges could rule on the fate of SNAP food aid as deadline nears for shutdown to end payments",
    "description": "The Trump administration says debit cards will not be loaded for November.",
    "link": "https://www.bostonherald.com/2025/10/31/snap-benefits-lawsuit/",
    "timestamp": "2025-10-31T15:58:30Z"
  },
  {
    "title": "Judges could rule on the fate of SNAP food aid as deadline nears for shutdown to end payments",
    "description": "The Trump administration says debit cards will not be loaded for November.",
    "link": "https://www.denverpost.com/2025/10/31/snap-benefits-lawsuit/",
    "timestamp": "2025-10-31T15:58:30Z"
  },
  {
    "title": "Reps.: Federal Funding Is a Lifeline for Domestic Violence Survivors. The Trump Admin Is Quietly Trying To End It | Opinion",
    "description": "Domestic violence is a painful reality afflicting too many households in this country, which makes the words and actions of the current administration so egregious and hurtful.\nLast month, President Donald Trump callously, almost jokingly, dismissed domestic …",
    "link": "https://biztoc.com/x/58525c500a19d407",
    "timestamp": "2025-10-31T15:57:48Z"
  },
  {
    "title": "Trump: Deal with China to be long-lasting",
    "description": "United States President Donald Trump told reporters on board Air Force One on Friday that the recently struck deal with China will be \"long-lasting.\"More to come......",
    "link": "https://biztoc.com/x/102eca408b30454b",
    "timestamp": "2025-10-31T15:57:26Z"
  },
  {
    "title": "WATCH: Johnson says Trump’s demand to end filibuster ‘not my call’",
    "description": "House Speaker Mike Johnson said he texted with President Donald Trump after his late night demand to change the Senate rules to end the government shutdown.",
    "link": "https://biztoc.com/x/be543a3cf5090a57",
    "timestamp": "2025-10-31T15:57:16Z"
  },
  {
    "title": "Trump's Tariff Chaos Crushes Board Game Makers: 'The U.S. Is Our Least Trustworthy Trading Partner'",
    "description": "The Supreme Court will hear a case next week challenging the legality of President Donald Trump's \"emergency\" tariffs.",
    "link": "https://reason.com/2025/10/31/trumps-tariff-chaos-crushes-board-game-makers-the-u-s-is-our-least-trustworthy-trading-partner/",
    "timestamp": "2025-10-31T15:56:10Z"
  },
  {
    "title": "Republicans Claimed Biden Censored YouTube. 20 Employees Seem to Say Otherwise",
    "description": "Lawyers for Alphabet, Youtube's parent company, recently alleged that the Biden administration tried to “influence” the company. Interviews with employees don't appear to support their claim.",
    "link": "https://www.wired.com/story/republicans-claim-biden-censored-youtube/",
    "timestamp": "2025-10-31T15:55:19Z"
  },
  {
    "title": "Lebanon slams Israel for intensifying attacks despite calls to negotiate",
    "description": "Lebanese President Joseph Aoun says ready to negotiate despite Israeli refusal, as new strikes kill one in the south.",
    "link": "https://www.aljazeera.com/news/2025/10/31/lebanon-slams-israel-for-intensifying-attacks-despite-calls-to-negotiate",
    "timestamp": "2025-10-31T15:55:16Z"
  },
  {
    "title": "Supreme Court expert writes John Roberts' legacy: 'Worst in history'",
    "description": "In her new book, legal scholar Lisa Graves walks through all the ways that Chief Justice John Roberts \"betrayed\" Americans and \"delegitimized the once-trusted institution\" — all for President Donald Trump. Speaking to Salon for a piece on Friday, Grave noted …",
    "link": "https://www.rawstory.com/chief-justice-john-roberts-2674253959/",
    "timestamp": "2025-10-31T15:50:28Z"
  },
  {
    "title": "UK Seeks to Turn Page on Mandelson Scandal With US Envoy Pick",
    "description": "The UK government is leaning toward a career diplomat as its next ambassador to the US, as Keir Starmer seeks to move on from Peter Mandelson’s resignation.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-seeks-to-turn-page-on-mandelson-scandal-with-us-envoy-pick",
    "timestamp": "2025-10-31T15:49:56Z"
  },
  {
    "title": "Penny production shut down by Trump; now shortages creep into NJ supermarkets",
    "description": "Pennies, which cost more to make than their face value, are no longer being made, and New Jersey supermarkets are starting to struggle to find them.",
    "link": "https://www.mycentraljersey.com/story/news/2025/10/31/penny-shortage-hits-nj-supermarkets-will-rounding-become-standard/87009563007/",
    "timestamp": "2025-10-31T15:49:14Z"
  },
  {
    "title": "Rule Change Rumblings: Filibuster Under Fire As Shutdown Drags On",
    "description": "Donald Trump has reignited the fight over the Senate filibuster as the US government shutdown enters its fourth week, calling on Republicans to abolish the rule and pass funding without Democratic votes.",
    "link": "https://www.ibtimes.com/rule-change-rumblings-filibuster-under-fire-shutdown-drags-3789080",
    "timestamp": "2025-10-31T15:48:17Z"
  },
  {
    "title": "SNAP Benefits for 42 Million People Could Still Be Saved During the Shutdown",
    "description": "The critical safety net program has never been disrupted since it began in its current form in the 1960s.",
    "link": "https://19thnews.org/2025/10/saving-snap-benefits-government-shutdown/",
    "timestamp": "2025-10-31T15:47:54Z"
  },
  {
    "title": "China welcomes Trump's 'G-2' remark: Says two countries can jointly work for global stability",
    "description": "China welcomed President Trump's 'G-2' label for their recent summit, highlighting a mutual interest in tackling global challenges together. The leaders struck deals on trade matters, addressing tariffs and export regulations. Furthermore, President Xi engage…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-welcomes-trumps-g-2-remark-says-two-countries-can-jointly-work-for-global-stability/articleshow/124998923.cms",
    "timestamp": "2025-10-31T15:47:15Z"
  },
  {
    "title": "“Lifetime ban from Petco”: Gavin Newsom mocks Trump administration with Spirit Halloween costume memes",
    "description": "California Governor Gavin Newsom is unleashing an amusing line-up of Trump administration-themed costumes on social media just in time for Halloween.\n\n\nNewsom has made it part of his job to constantly ridicule both President Donald Trump and all of his variou…",
    "link": "https://www.dailydot.com/viral-politics/gavin-newsom-trump-administration-halloween-costumes/",
    "timestamp": "2025-10-31T15:46:23Z"
  },
  {
    "title": "Republicans quickly push back on Trump’s call to nix filibuster",
    "description": "Republicans are quickly tamping down President Donald Trump’s call to eliminate the Senate filibuster as they try to keep pressure on Democrats to end the 31-day government shutdown. \nGOP leaders believed Thursday they were on track to reopen agencies as soon…",
    "link": "https://biztoc.com/x/c28ee76465b1dfd6",
    "timestamp": "2025-10-31T15:46:15Z"
  },
  {
    "title": "Lifelong Democrat C-SPAN Caller Says Party ‘Makes’ Him ‘Sick,’ Announces He’s Leaving",
    "description": "An Oklahoma C-SPAN caller who said he was a lifelong Democrat and voted for Kamala Harris in 2024 declared he was sickened by his party and plans to leave it.",
    "link": "https://dailycaller.com/2025/10/31/lifelong-democrat-c-span-caller-says-party-makes-him-sick-announces-hes-leaving/",
    "timestamp": "2025-10-31T15:46:06Z"
  },
  {
    "title": "What to know about the Senate filibuster as Trump calls on GOP to eliminate it",
    "description": "Senate Republicans are resisting his demand to end the long-standing filibuster rule in order to end the government shutdown.",
    "link": "https://abcnews.go.com/Politics/senate-filibuster-trump-calls-gop-eliminate/story?id=127059067",
    "timestamp": "2025-10-31T15:45:40Z"
  },
  {
    "title": "Analysis-Trump's big nuclear reactor push raises safety concerns",
    "description": "(Reuters) -A huge nuclear deal announced by the Trump administration earlier this week provides a multi-billion-dollar incentive for the U. government to...",
    "link": "https://www.yahoo.com/news/articles/analysis-trumps-big-nuclear-reactor-154535860.html",
    "timestamp": "2025-10-31T15:45:35Z"
  },
  {
    "title": "WATCH — Halloween at the White House: Trump and Melania Give Candy and Hugs",
    "description": "Halloween celebrations at the White House were a jolly success Thursday evening as President Donald Trump, alongside First Lady Melania Trump, handed out candy and hugs at the annual event on the South Lawn.\nThe post WATCH — Halloween at the White House: Trum…",
    "link": "https://www.breitbart.com/politics/2025/10/31/watch-halloween-at-the-white-house-trump-and-melania-give-candy-and-hugs/",
    "timestamp": "2025-10-31T15:45:15Z"
  },
  {
    "title": "WATCH: Johnson says Trump’s demand to end filibuster ‘not my call’",
    "description": "House Speaker Mike Johnson said he texted with President Donald Trump after his late night demand to change the Senate rules to end the government shutdown.",
    "link": "https://www.pbs.org/newshour/politics/watch-johnson-says-trumps-demand-to-end-filibuster-not-my-call",
    "timestamp": "2025-10-31T15:45:10Z"
  },
  {
    "title": "Trump Says Canada Trade Talks Won't Resume, Contradicting Energy Sec",
    "description": "U.S. President Donald Trump  suggested that trade talks between the U.S. and Canada won't restart.",
    "link": "https://www.rigzone.com/news/wire/trump_says_canada_trade_talks_wont_resume_contradicting_energy_sec-31-oct-2025-182215-article/",
    "timestamp": "2025-10-31T15:45:05Z"
  },
  {
    "title": "Tricky times",
    "description": "Hawkish Fed tone takes markets by surprise",
    "link": "https://www.thehindubusinessline.com/opinion/editorial/tricky-times/article70226099.ece",
    "timestamp": "2025-10-31T15:45:01Z"
  },
  {
    "title": "China emerges as US 'peer rival' at Xi Jinping-Donald Trump summit (Financial Times)",
    "description": "Financial Times:\nChina emerges as US ‘peer rival’ at Xi Jinping-Donald Trump summit  —  Beijing shows it can force Washington to compromise on trade issues  —  Joe Leahy in Beijing and Demetri Sevastopulo in Gyeongju  —  China's President Xi Jinping sought to…",
    "link": "https://www.memeorandum.com/251031/p55",
    "timestamp": "2025-10-31T15:45:00Z"
  },
  {
    "title": "As Trump touts international force to stabilize Gaza, key questions remain",
    "description": "President Donald Trump is touting an international force to help bring peace to the shattered Gaza Strip and see that all deceased hostages held by Hamas are returned to Israel.",
    "link": "https://www.nbcnews.com/world/gaza/trump-touts-international-force-stabilize-gaza-key-questions-remain-rcna238982",
    "timestamp": "2025-10-31T15:43:20Z"
  },
  {
    "title": "Xi: China’s development aligns with Trump’s vision",
    "description": "Chinese President Xi Jinping said here Thursday that China&#39;s development and revitalization goes hand in hand with U.S. President Donald Trump&#39;s ...",
    "link": "https://en.antaranews.com/news/389353/xi-chinas-development-aligns-with-trumps-vision",
    "timestamp": "2025-10-31T15:41:43Z"
  },
  {
    "title": "Turkey to hold Gaza peace plan meeting for Muslim states",
    "description": "Egypt, Indonesia, Jordan, Pakistan, Qatar, Saudi Arabia, and the United Arab Emirates have all been invited",
    "link": "https://www.euractiv.com/news/turkey-to-hold-gaza-peace-plan-meeting-for-muslim-states/",
    "timestamp": "2025-10-31T15:38:39Z"
  },
  {
    "title": "Johnson warns against Trump's demand for Senate to go 'nuclear' to end shutdown",
    "description": "House Speaker Mike Johnson distanced himself from demands to get rid of the filibuster, warning it could backfire if Democrats took back Senate control.",
    "link": "https://www.foxnews.com/politics/johnson-warns-against-trumps-demand-senate-go-nuclear-end-shutdown",
    "timestamp": "2025-10-31T15:37:09Z"
  },
  {
    "title": "Alvin Bragg dodges mentioning signature Trump case as he campaigns for district attorney re-election",
    "description": "Manhattan District Attorney Alvin Bragg distances himself from Trump conviction on 34 felony counts while campaigning for re-election as Manhattan's top prosecutor.",
    "link": "https://www.foxnews.com/politics/alvin-bragg-dodges-mentioning-signature-trump-case-he-campaigns-da-re-election",
    "timestamp": "2025-10-31T15:36:42Z"
  },
  {
    "title": "Grounded by Bureaucracy: Another Wake Up Call To Privatize Air Traffic Control",
    "description": "When air traffic control is held hostage by federal budget fights, American travelers lose. The shutdown-induced mess at U.S. airports demonstrates yet another consequence of... Read More\nThe post Grounded by Bureaucracy: Another Wake Up Call To Privatize Air…",
    "link": "https://www.dailysignal.com/2025/10/31/grounded-by-bureaucracy-another-wake-up-call-to-privatize-air-traffic-control/",
    "timestamp": "2025-10-31T15:34:30Z"
  }
]