[
  {
    "title": "Hillary Clinton Immediately Starts Attacking Republicans After Telling Everyone To Stop ‘Demonizing’ Each Other",
    "description": "Hillary Clinton attacked Republicans right after stating that everyone must \"stop demonizing\" one another for their political differences.",
    "link": "https://dailycaller.com/2025/09/24/hillary-clinton-republicans-demonizing-republicans-morning-joe/",
    "timestamp": "2025-09-24T14:40:19Z"
  },
  {
    "title": "Jesse Watters Makes Fox Co-Hosts Cringe With Revenge Plan Against U.N.",
    "description": "Fox News’s Jesse Watters joined the MAGA outrage Tuesday over a mishap that occurred during Donald Trump’s arrival at the United Nations earlier that day. Watters mused about the appropriate response to an escalator halting as the president stepped onto it, i…",
    "link": "https://newrepublic.com/post/200848/jesse-watters-fox-news-bomb-un-revenge-plan-trump-escalator",
    "timestamp": "2025-09-24T14:39:29Z"
  },
  {
    "title": "Europe would accept Ryder Cup trophy from Trump - Rose",
    "description": "If Donald Trump hangs around for a trophy presentation and Europe defends its Ryder Cup title at Bethpage Black this week, Justin Rose says would gladly accept the spoils from the President of the United States.",
    "link": "https://www.rte.ie/sport/golf/2025/0924/1535131-europe-would-accept-ryder-cup-trophy-from-trump-rose/",
    "timestamp": "2025-09-24T14:38:39Z"
  },
  {
    "title": "Trump turns against Putin, says Ukraine can win with Nato support",
    "description": "In a surprising shift, US President Donald Trump now believes Ukraine can reclaim its territory with EU and NATO support, following a meeting with President Zelenskyy. Trump criticized Russia's prolonged war effort and hinted at potential tariffs. Zelenskyy, …",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-turns-against-putin-says-ukraine-can-win-with-nato-support/articleshow/124094638.cms",
    "timestamp": "2025-09-24T14:38:14Z"
  },
  {
    "title": "‘Absolutely Huge!’ Jimmy Kimmel’s Return Breaks Record, Reports CNN’s Harry Enten",
    "description": "\"So if Donald Trump's idea was to give Jimmy Kimmel more press and more viewership, he absolutely did so,\" Enten said on CNN\nThe post ‘Absolutely Huge!’ Jimmy Kimmel’s Return Breaks Record, Reports CNN’s Harry Enten first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/absolutely-huge-jimmy-kimmels-return-breaks-record-reports-cnns-harry-enten/",
    "timestamp": "2025-09-24T14:37:35Z"
  },
  {
    "title": "Black pastors say Charlie Kirk is not a martyr, while decrying racism and political violence",
    "description": "The reactions to Kirk’s death marked a notable split-screen moment in America’s racial divide.",
    "link": "https://www.bostonherald.com/2025/09/24/charlie-kirk-black-pastors-react/",
    "timestamp": "2025-09-24T14:36:14Z"
  },
  {
    "title": "Calling Mark Zuckerberg’s bluff on safety for Meta users",
    "description": "The CEO has caved to Donald Trump on fact-checking and hate speech",
    "link": "https://www.salon.com/2025/09/24/calling-mark-zuckerbergs-bluff-on-safety-for-meta-users/",
    "timestamp": "2025-09-24T14:35:52Z"
  },
  {
    "title": "Donald Trump: Crazy Like a Fox or Just Plain Crazy?",
    "description": "If you read the latest Trump Truth (that is what he calls his posts on Truth Social) that is posted above, you will come to the reasonable conclusion that Trump has either changed his position on the war in Ukraine and accepted the delusional beliefs of Gener…",
    "link": "https://freerepublic.com/focus/f-bloggers/4342376/posts",
    "timestamp": "2025-09-24T14:33:46Z"
  },
  {
    "title": "Donald Trump: Crazy Like a Fox or Just Plain Crazy?",
    "description": "If you read the latest Trump Truth (that is what he calls his posts on Truth Social) that is posted above, you will come to the reasonable conclusion that Trump has either changed his position on the war in Ukraine and accepted the delusional beliefs of Gener…",
    "link": "https://freerepublic.com/focus/f-news/4342376/posts",
    "timestamp": "2025-09-24T14:33:46Z"
  },
  {
    "title": "Nuclear threats from North Korea loom quietly behind wars in Gaza and Ukraine at UNGA",
    "description": "Kim Jong Un says North Korea will only engage in talks if the U.S. drops denuclearization demands, creating a diplomatic stalemate with the Trump administration.",
    "link": "https://www.foxnews.com/politics/unga-nuclear-threats-from-north-korea-loom-quietly-behind-wars-gaza-ukraine",
    "timestamp": "2025-09-24T14:30:51Z"
  },
  {
    "title": "Ticketmaster and Live Nation sued by FTC over alleged illegal ticket resale tactics",
    "description": "The suit accuses Live Nation of charging exorbitant fees and allowing bots to buy tickets in bulk and resell them at a markup, sometimes as high as 500%.",
    "link": "https://djmag.com/news/ticketmaster-and-live-nation-sued-ftc-over-alleged-illegal-ticket-resale-tactics",
    "timestamp": "2025-09-24T14:30:48Z"
  },
  {
    "title": "Hegseth, Noem on board with ‘vital step’ to create Coast Guard secretary amid Trump’s drug smuggling crackdown",
    "description": "EXCLUSIVE: Secretary of War Pete Hegseth and Secretary of Homeland Security Kristi Noem endorse establishing a Coast Guard secretary as part of broader service reforms.",
    "link": "https://www.foxnews.com/politics/hegseth-noem-board-vital-step-create-coast-guard-secretary-amid-trumps-drug-smuggling-crackdown",
    "timestamp": "2025-09-24T14:30:43Z"
  },
  {
    "title": "Iran Defies UN Sanctions, Vows Continued Oil Exports to China",
    "description": "Iran appears unfazed by the prospect of UN snapback sanctions coming into effect this weekend, saying that it will continue to sell its oil to its biggest and nearly only buyer, China.  The biggest European powers which are party to the so-called Iranian nucl…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Iran-Defies-UN-Sanctions-Vows-Continued-Oil-Exports-to-China.html",
    "timestamp": "2025-09-24T14:30:00Z"
  },
  {
    "title": "London Mayor Calls Donald Trump Racist",
    "description": "The mayor of London, Sadiq Khan, has called Donald Trump \"racist\" and \"Islamophobic\" in response to a swipe by the U.S. president at the leader of the British capital.\nKhan’s remarks followed Trump telling the United Nations that the U.K. capital had a \"terri…",
    "link": "https://biztoc.com/x/cb4220b24cbc272b",
    "timestamp": "2025-09-24T14:29:56Z"
  },
  {
    "title": "Tennessee man arrested for posting meme ‘threatening violence’ in Facebook group for Charlie Kirk vigil",
    "description": "Members of the Perry County community reportedly believed he was making threats against local schools",
    "link": "https://www.the-independent.com/news/world/americas/crime/tennessee-facebook-arrest-trump-charlie-kirk-b2832831.html",
    "timestamp": "2025-09-24T14:28:27Z"
  },
  {
    "title": "Ukraine's president says the world is in 'the most destructive arms race in history'",
    "description": "Volodymyr Zelenskyy addressed world leaders at the UN General Assembly. He stated the world faces a destructive arms race. Zelenskyy urged international action against Russia. He claimed Vladimir Putin aims to expand the war in Europe. This follows a meeting …",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraines-president-says-the-world-is-in-the-most-destructive-arms-race-in-history/articleshow/124094547.cms",
    "timestamp": "2025-09-24T14:27:13Z"
  },
  {
    "title": "Trump’s $100K H-1B visa overhaul could hit tech giants like Amazon and Microsoft hardest",
    "description": "The Trump administration’s $100K H-1B visa fee proposal puts new pressure on Amazon and other tech giants reliant on highly skilled foreign workers.",
    "link": "https://www.foxnews.com/politics/trumps-100k-h-1b-visa-overhaul-could-hit-tech-giants-like-amazon-microsoft-hardest",
    "timestamp": "2025-09-24T14:26:35Z"
  },
  {
    "title": "Putin forced to raise taxes again as Ukraine war drains finances",
    "description": "The costs of running a war economy are slowly coming home to roost.",
    "link": "https://www.politico.eu/article/vladimir-putin-raise-taxes-ukraine-war-drain-finance/",
    "timestamp": "2025-09-24T14:26:33Z"
  },
  {
    "title": "Rosenberg: Russia brushes off Trump's claim of 'paper tiger' in aimless war",
    "description": "The BBC's Steve Rosenberg says far from being riled by Trump's comments, Russia's response has so far been restrained.",
    "link": "https://www.bbc.com/news/articles/c3e70n4keyjo",
    "timestamp": "2025-09-24T14:26:28Z"
  },
  {
    "title": "Jimmy Kimmel Savages Trump On First Night Of Return To His Show",
    "description": "Jimmy Kimmel took a shot at Donald Trump as he returned to his late-night show on Wednesday night, and he also clarified his comments about slain conservative Charlie Kirk. “He tried his best to cancel me; instead, he forced millions of people to watch the sh…",
    "link": "https://crooksandliars.com/2025/09/jimmy-kimmel-savages-trump-first-night",
    "timestamp": "2025-09-24T14:26:22Z"
  },
  {
    "title": "Lindsey Graham Reveals He’s All in on Trump Fascism",
    "description": "Senator Lindsey Graham said he hopes the president runs for an illegal third term. Speaking on Fox New’s Hannity Tuesday night, the South Carolina Republican fawned over Donald Trump’s supposedly tough talk at the United Nations General Assembly.“Trump 2028. …",
    "link": "https://newrepublic.com/post/200855/lindsey-graham-donald-trump-third-term-2028",
    "timestamp": "2025-09-24T14:26:16Z"
  },
  {
    "title": "Lindsey Graham Again Endorses 'Lawless' Third Term Run for Trump",
    "description": "International leaders and diplomats gasped and were seen shaking their heads as US President Donald Trump gave his address at the United Nations General Assembly—attacking the UN itself, migration, and climate action—but Sen. Lindsey Graham gave the speech an…",
    "link": "https://www.commondreams.org/news/lindsey-graham-on-trump",
    "timestamp": "2025-09-24T14:25:42Z"
  },
  {
    "title": "The Forced Sale of TikTok Is Crony Capitalist at the Core",
    "description": "Forcing the sale of a social media company for political reasons was always going to be a power grab for the White House—whether its occupant was Democratic or Republican.",
    "link": "https://reason.com/2025/09/24/the-forced-sale-of-tiktok-is-crony-capitalist-at-the-core/",
    "timestamp": "2025-09-24T14:25:15Z"
  },
  {
    "title": "Charlie Kirk Sparked a Faith Revival. He was Right: New Data Shows Religious People Are Happier Than Non-Believers.",
    "description": "Charlie Kirk knew the keys to happiness in life are simple: faith, family, and freedom. New data on religious practice confirms Charlie was right: People... Read More\nThe post Charlie Kirk Sparked a Faith Revival. He was Right: New Data Shows Religious People…",
    "link": "https://www.dailysignal.com/2025/09/24/charlie-kirk-sparked-a-faith-revival-he-was-right-new-data-shows-religious-people-are-happier-than-non-believers/",
    "timestamp": "2025-09-24T14:25:08Z"
  },
  {
    "title": "Wall Street drifts as it hits a lull following its big rally",
    "description": "U.S. stocks are drifting as Wall Street takes a pause from what seemed like a relentless rally.",
    "link": "https://www.bostonherald.com/2025/09/24/wall-street-lull-after-rally/",
    "timestamp": "2025-09-24T14:25:01Z"
  },
  {
    "title": "White House rehires hundreds of employees fired by Musk’s DOGE – AP",
    "description": "Federal workers were dismissed in the government efficiency czar’s cost-cutting push Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625190-musk-fired-employees-rehired/",
    "timestamp": "2025-09-24T14:24:09Z"
  },
  {
    "title": "How Europe Is Navigating Trump",
    "description": "EU foreign-policy chief Kaja Kallas: “We are trying to have more friends around the world.”",
    "link": "http://foreignpolicy.com/2025/09/24/kallas-how-europe-is-navigating-trump/",
    "timestamp": "2025-09-24T14:24:08Z"
  },
  {
    "title": "Stephen Colbert to Receive Ripple of Hope Award From RFK Human Rights Center",
    "description": "\"Humor can be a catalyst for change, and Stephen stands as a shining example of how speaking truth to power, boldly, wisely and with heart, can ignite change,\" Kerry Kennedy shares\nThe post Stephen Colbert to Receive Ripple of Hope Award From RFK Human Rights…",
    "link": "https://www.thewrap.com/stephen-colbert-rfk-human-rights-ripple-of-hope-award-kennedy/",
    "timestamp": "2025-09-24T14:23:47Z"
  },
  {
    "title": "The Case for Democrats Recognizing Palestinian Statehood",
    "description": "Democratic efforts to undercut the Israeli war on Gaza are fine, but soon the war will end and the idea of a negotiated two-state solution will die. Recognition of a demilitarized and post-Hamas Palestinian state is the next logical step.",
    "link": "http://nymag.com/intelligencer/article/the-case-for-democrats-recognizing-palestinian-statehood.html",
    "timestamp": "2025-09-24T14:23:32Z"
  },
  {
    "title": "Ukraine’s president says the world is in `the most destructive arms race in history’",
    "description": "Ukrainian President Volodymyr Zelenskyy is telling world leaders that the world is in “the most destructive arms race in history.\"",
    "link": "https://abcnews.go.com/US/wireStory/ukraines-president-world-destructive-arms-race-history-125891834",
    "timestamp": "2025-09-24T14:22:24Z"
  },
  {
    "title": "'Let's start the day': Stephen Miller's wife shares his angry wake-up routine",
    "description": "Stephen Miller's wife revealed Donald Trump's deputy chief of staff's bizarre wake-up routine in a cringeworthy interview on Fox.Katie Miller, a former Elon Musk employee, appeared on Jesse Watters Primetime Tuesday in an interview that took an unexpected tur…",
    "link": "https://www.rawstory.com/katie-miller-2674028820/",
    "timestamp": "2025-09-24T14:21:44Z"
  },
  {
    "title": "Ideas: Does Trump Really Think Ukraine Can Win?",
    "description": "The president abruptly turned on Putin, but the epiphany may not last.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/does-trump-really-think-ukraine-can-win-e582817/",
    "timestamp": "2025-09-24T14:21:00Z"
  },
  {
    "title": "Ideas: Why Trump Changed His Mind on Ukraine",
    "description": "And why he still might change it again",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/why-trump-changed-his-mind-on-ukraine-e582817/",
    "timestamp": "2025-09-24T14:21:00Z"
  },
  {
    "title": "Trump Immigration Rule Shifts H-1B Lottery To Favor Older Visa Holders",
    "description": "The Trump administration has proposed a new immigration rule to change the H-1B selection process to favor people in senior positions.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/09/24/trump-immigration-rule-shifts-h-1b-lottery-to-favor-older-visa-holders/",
    "timestamp": "2025-09-24T14:19:08Z"
  },
  {
    "title": "Jimmy Kimmel Returned To ‘Live’ Last Night As Donald Trump Threatened More Government Crackdowns: “A True Bunch Of Losers!”",
    "description": "Kimmel also accused the FCC of \"using mob tactics to suppress free speech\" during his monologue.",
    "link": "https://decider.com/2025/09/24/jimmy-kimmel-returned-live-donald-trump/",
    "timestamp": "2025-09-24T14:18:27Z"
  },
  {
    "title": "Zelenskyy's UN speech was a warning and a plea - as he knows Trump can turn on a dime",
    "description": "The Ukrainian president cited history in warning that Russia won't stop unless it is defeated. He said: \"Georgia is dependent on Russia and... Belarus has also been moving towards dependence on Russia.\"",
    "link": "https://news.sky.com/story/zelenskyys-un-speech-was-a-warning-and-a-plea-as-he-knows-trump-can-turn-on-a-dime-13437317",
    "timestamp": "2025-09-24T14:18:00Z"
  },
  {
    "title": "For a generation of Black conservatives, Charlie Kirk built more than politics -- he built community",
    "description": "For a generation of Black conservatives, Charlie Kirk built more than politics -- he built communitygo.com",
    "link": "https://abcnews.go.com/US/generation-black-conservatives-charlie-kirk-built-politics-built/story?id=125765387",
    "timestamp": "2025-09-24T14:17:24Z"
  },
  {
    "title": "'Irresponsible and sick': JD Vance ripped for trying to 'score' points using deaths at ICE",
    "description": "Vice President JD Vance’s knee-jerk response to a report that multiple detainees at an ICE facility in Dallas were gunned down by a white sniper set off an avalanche of criticism on social media.Linking to an X post on tragedy unfolding in Dallas from DHS Sec…",
    "link": "https://www.rawstory.com/vance-dallas-ice-sick-response/",
    "timestamp": "2025-09-24T14:16:08Z"
  },
  {
    "title": "Luigi Mangione's lawyers slam Charlie Kirk comparisons made by Trump administration",
    "description": "Lawyers for Luigi Mangione are accusing the Trump administration of violating their client's right to a fair trial in the wake of Charlie Kirk's assassination",
    "link": "https://www.nbcnews.com/news/us-news/luigi-mangione-lawyers-slam-charlie-kirk-comparisons-trump-admini-rcna233382",
    "timestamp": "2025-09-24T14:15:54Z"
  },
  {
    "title": "Justin Rose would welcome Trump on stage if Team Europe wins Ryder Cup",
    "description": "“Listen, I'm not sure he's going to want to be on the stage congratulating the team that sort of wins in his backyard. But listen, of course, he's the President, ultimate respect, and that would be a great opportunity.”",
    "link": "https://nypost.com/2025/09/24/sports/justin-rose-would-welcome-trump-on-stage-if-europe-wins-ryder-cup/",
    "timestamp": "2025-09-24T14:15:31Z"
  },
  {
    "title": "Trump and RFK Jr.’s Autism Fixation Is Becoming a Public Health Risk",
    "description": "Donald Trump and Robert F. Kennedy Jr.'s advised pregnant women against taking Tylenol, claiming without real evidence that it can lead to autism.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-rfk-jr-autism-fixation-dangerous-1235433811/",
    "timestamp": "2025-09-24T14:15:00Z"
  },
  {
    "title": "Republicans move to cut DEI from federal contracts as Duffy cries foul on equity in Key Bridge rebuild",
    "description": "House and Senate Republicans target Biden-era DEI rules in federal contracting as Trump administration questions Maryland's Francis Scott Key Bridge reconstruction approach.",
    "link": "https://www.foxnews.com/politics/republicans-move-cut-dei-from-federal-contracts-duffy-cries-foul-equity-key-bridge-rebuild",
    "timestamp": "2025-09-24T14:14:51Z"
  },
  {
    "title": "Disney sure picked a terrible time to raise prices",
    "description": "Disney is in a tangled web of its own making. In just one week, the entertainment giant managed to anger both sides of the political spectrum, and then topped it all off with a Disney Plus price hike that made just about everyone mad. Now, Disney's facing cri…",
    "link": "https://www.theverge.com/report/784594/disney-jimmy-kimmel-backlash-price-hikes",
    "timestamp": "2025-09-24T14:14:51Z"
  },
  {
    "title": "Automakers Want The EPA To Let Them Build Dirty Cars",
    "description": "Also: If you were excited for the next Ford recall, we've got good news.",
    "link": "https://www.jalopnik.com/1977520/automakers-want-epa-weaker-car-emissions-rules/",
    "timestamp": "2025-09-24T14:14:08Z"
  },
  {
    "title": "Trump Wants to Fire People Over U.N. Escalator. Who Wants to Tell Him?",
    "description": "Donald Trump’s flubdub at the United Nations is apparently going to get people fired.The president and his administration are still fuming over two technical difficulties that Trump experienced at the U.N.’s New York City headquarters, including a teleprompte…",
    "link": "https://newrepublic.com/post/200850/donald-trump-fire-people-un-escalator-teleprompter",
    "timestamp": "2025-09-24T14:13:04Z"
  },
  {
    "title": "Jimmy Kimmel Monologue Last Night: From Charlie Kirk to Donald Trump, emotional Disney-ABC-Hulu talk-show host makes powerful statement",
    "description": "Jimmy Kimmel Monologue Last Night on ABC highlighted on Charlie Kirk death and U.S. President Donald Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/us/jimmy-kimmel-monologue-last-night-from-charlie-kirk-to-donald-trump-emotional-disney-abc-hulu-talk-show-host-makes-powerful-statement/articleshow/124094289.cms",
    "timestamp": "2025-09-24T14:11:07Z"
  },
  {
    "title": "EU weighs tariffs on Russian oil imports",
    "description": "The European Commission is considering tariffs on Russian oil imports under pressure from US President Trump, who urged Europe to end energy imports from Moscow. The EU has cut about 90% of Russian oil since 2022 and plans to phase out the rest by 2027. EU ch…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/eu-weighs-tariffs-on-russian-oil-imports/articleshow/124094305.cms",
    "timestamp": "2025-09-24T14:09:20Z"
  },
  {
    "title": "Theo Von Demands DHS Remove His Video From ‘Banger’ Deportation Promo: ‘I Didn’t Approve’",
    "description": "Theo Von tells DHS to remove his video clips from the videos they upload to social media about deportation, saying he never approved the usage.",
    "link": "http://www.rollingstone.com/culture/culture-news/theo-von-dhs-video-clips-deportation-1235434202/",
    "timestamp": "2025-09-24T14:09:06Z"
  },
  {
    "title": "Trump slams Jimmy Kimmel’s return, says ‘we’re going to test ABC out on this’ because ‘last time I went after them, they gave me $16 million’",
    "description": "President Donald Trump launched a fresh attack on ABC and Jimmy Kimmel following the network’s decision to bring the late-night host back on air after a contentious six-day suspension, threatening new legal action against the Disney-owned broadcaster while re…",
    "link": "https://biztoc.com/x/a2c3c11abb0034a1",
    "timestamp": "2025-09-24T14:07:39Z"
  },
  {
    "title": "Rose would welcome Trump on stage if Europe keeps Ryder Cup",
    "description": "Justin Rose said he would welcome US President Donald Trump on the stage if Europe win this week's Ryder Cup and he expects Trump's visit Friday to create an intense atmosphere.American supporters are expected to create a raucous and intense setting for the m…",
    "link": "https://sports.yahoo.com/article/rose-welcome-trump-stage-europe-140625461.html",
    "timestamp": "2025-09-24T14:06:25Z"
  },
  {
    "title": "Jimmy Kimmel’s First Words Back on Air Were a Nod to Another Late Night Host Embroiled in Controversy",
    "description": "The ABC host's opening remarks were a sly easter egg for late night comedy fans\nThe post Jimmy Kimmel’s First Words Back on Air Were a Nod to Another Late Night Host Embroiled in Controversy appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-monologue-as-i-was-saying-jack-paar/",
    "timestamp": "2025-09-24T14:05:21Z"
  },
  {
    "title": "Trump threatens to sue ABC over Jimmy Kimmel’s sudden return to air: ‘A true bunch of losers!’",
    "description": "President Trump has threatened to sue ABC over Jimmy Kimmel's sudden return to air -- insisting the network should have let the embattled late-night host \"rot\" after his inflammatory Charlie Kirk comments.",
    "link": "https://nypost.com/2025/09/24/us-news/trump-threatens-to-sue-abc-over-jimmy-kimmels-sudden-return-to-air-a-true-bunch-of-losers/",
    "timestamp": "2025-09-24T14:05:20Z"
  },
  {
    "title": "Trump's UN speech no laughing matter as body language shows",
    "description": "When Donald Trump first took to the global political stage, not everyone took him seriously. The reaction of world leaders to his speech at the UN General Assembly shows a change in attitude, says a body language expert.",
    "link": "https://www.dw.com/en/trumps-un-speech-no-laughing-matter-as-body-language-shows/a-74121719",
    "timestamp": "2025-09-24T14:03:00Z"
  },
  {
    "title": "Trump's tennis invite from Rolex echoes Apple, Nvidia playbook for currying favor, Warren says",
    "description": "Trump placed a 39% levy on Switzerland's exports, and Warren questioned if Rolex was vying for an exemption from the tariffs.",
    "link": "https://www.cnbc.com/2025/09/24/elizabeth-warren-trump-rolex-tennis-invite-apple-nvidia.html",
    "timestamp": "2025-09-24T14:02:57Z"
  },
  {
    "title": "Medicaid cuts are coming: 4 ways Americans with disabilities can start protecting their finances",
    "description": "People with disabilities often face financial pressure from two sides.",
    "link": "https://www.bostonherald.com/2025/09/24/medicaid-disabled-americans/",
    "timestamp": "2025-09-24T14:00:39Z"
  },
  {
    "title": "Trump Loses It Over Jimmy Kimmel's Return In Unhinged New Rant, Then Threatens ABC (Ed Mazza/HuffPost)",
    "description": "Ed Mazza / HuffPost:\nTrump Loses It Over Jimmy Kimmel's Return In Unhinged New Rant, Then Threatens ABC  —  The president warned of legal action against the network for allowing the host back on TV.  —  President Donald Trump threw a fit on social media on Tu…",
    "link": "https://www.memeorandum.com/250924/p38",
    "timestamp": "2025-09-24T14:00:30Z"
  },
  {
    "title": "Charlie Kirk’s Group Held Its First Post-Assassination Campus Tour Event. It Was Extreme—and Revealing.",
    "description": "Revenge against “the left” is on the near-term agenda, but even the group’s leaders are concerned about what comes after that.",
    "link": "https://slate.com/news-and-politics/2025/09/charlie-kirk-murder-turning-point-usa-campus-tour-event.html",
    "timestamp": "2025-09-24T14:00:00Z"
  },
  {
    "title": "Trump's Radical Ukraine Pivot",
    "description": "In an abrupt change showing his frustration with Russian President Vladimir Putin, US President Donald Trump said Ukraine could win back all of its territory from Russia with the help of its European allies. Trump has previously said both sides would have to …",
    "link": "https://oilprice.com/Geopolitics/Europe/Trumps-Radical-Ukraine-Pivot.html",
    "timestamp": "2025-09-24T14:00:00Z"
  },
  {
    "title": "‘What should we expect? Nothing’: Ukrainians find cold comfort in Trump’s warm words",
    "description": "US president’s claim that Kyiv could win back all its territory from Russia came with no economic or military help",
    "link": "https://www.irishtimes.com/world/europe/2025/09/24/what-should-we-expect-nothing-ukrainians-find-cold-comfort-in-trumps-warm-words/",
    "timestamp": "2025-09-24T14:00:00Z"
  },
  {
    "title": "Trump slams Jimmy Kimmel’s return, says ‘we’re going to test ABC out on this’ because ‘last time I went after them, they gave me $16 million’",
    "description": "\"The president of the United States made it very clear he wants to see me and the hundreds of people who work here fired from our jobs,\" Kimmel said in his return to late night.",
    "link": "https://fortune.com/2025/09/24/trump-slams-jimmy-kimmel-return-abc/",
    "timestamp": "2025-09-24T13:57:52Z"
  },
  {
    "title": "A jury will look at whether Amazon tricked customers into joining Prime — and made it hard to leave",
    "description": "The Federal Trade Commission sued Amazon in U.S. District Court in Seattle two years ago and has alleged more than a decade of legal violations, including of the Restore Online Shoppers' Confidence Act, a 2010 law designed to help ensure that people know what…",
    "link": "https://www.pbs.org/newshour/nation/a-jury-will-look-at-whether-amazon-tricked-customers-into-joining-prime-and-made-it-hard-to-leave",
    "timestamp": "2025-09-24T13:57:40Z"
  },
  {
    "title": "'My goodness gracious': Numbers show Trump's latest attacks have blown up in his face",
    "description": "CNN's Harry Enten showed evidence that President Donald Trump's attacks on Jimmy Kimmel may have backfired.The late night talk show host was suspended last week after the administration threatened to pull broadcast licenses for ABC affiliates that aired his p…",
    "link": "https://www.rawstory.com/what-time-is-jimmy-kimmel-on-enten/",
    "timestamp": "2025-09-24T13:57:08Z"
  },
  {
    "title": "Jimmy Kimmel Doesn’t Back Down in Funny, Emotional Return—Watch His Monologue",
    "description": "A grateful Jimmy Kimmel didn't back down from the government or his critics in an emotional, funny return to his late night show on ABC.\nThe post Jimmy Kimmel Doesn’t Back Down in Funny, Emotional Return—Watch His Monologue appeared first on Nerdist.",
    "link": "https://nerdist.com/article/jimmy-kimmel-return-opening-monologue-video/",
    "timestamp": "2025-09-24T13:57:06Z"
  },
  {
    "title": "Medvedev: Trump has fallen into an alternate reality",
    "description": "Russian Security Council Deputy Chairman Dmitry Medvedev responded on Wednesday to United States President Donald Trump's comments about the Ukraine conflict by stating that he \"has once again fallen into an alternate reality.\" The US president \"issued a seri…",
    "link": "https://freerepublic.com/focus/f-chat/4342368/posts",
    "timestamp": "2025-09-24T13:56:49Z"
  },
  {
    "title": "Kimmel’s Returning Monologue Is His Most-Viewed On YouTube In Nearly One Year—Since Election Show",
    "description": "Jimmy Kimmel’s YouTube numbers may have spiked because nearly one-third of ABC stations, those owned by Nexstar and Sinclair, refused to air his return.",
    "link": "https://www.forbes.com/sites/conormurray/2025/09/24/kimmels-returning-monologue-is-his-most-viewed-on-youtube-in-nearly-one-year-since-election-show/",
    "timestamp": "2025-09-24T13:56:47Z"
  },
  {
    "title": "Jimmy Kimmel's return represents a big, final test for Disney's Bob Iger before he heads for the exits",
    "description": "Disney CEO Bob Iger is set to step down at the end of next year, but the Jimmy Kimmel drama has created one final challenge for me.",
    "link": "https://www.businessinsider.com/bob-iger-disney-ceo-navigating-jimmy-kimmel-suspension-legacy-2025-9",
    "timestamp": "2025-09-24T13:56:44Z"
  },
  {
    "title": "New $100K Fee For H-1B Visas Causes Travel Chaos",
    "description": "Plus, Jimmy Kimmel returns, a look at the ultimate September Surge checklist and how small businesses are using AI in this week's Careers newsletter.",
    "link": "https://www.forbes.com/sites/mariagraciasantillanalinares/2025/09/24/new-100k-fee-for-h-1b-visas-causes-travel-chaos/",
    "timestamp": "2025-09-24T13:56:37Z"
  },
  {
    "title": "Marjorie Taylor Greene calls for George Santos to be pardoned",
    "description": "Firebrand Georgia Republican Marjorie Taylor Greene is once again calling for the seven year prison sentence of disgraced congressman George Santos to be commuted, citing his conditions in solitary confinement. MAGA Republican Greene, known for her inflammato…",
    "link": "https://www.thepinknews.com/2025/09/24/marjorie-taylor-greene-george-santos-prison-commuted-us/",
    "timestamp": "2025-09-24T13:56:17Z"
  },
  {
    "title": "As Jimmy Kimmel returns to the air, Trump threatens to go after ABC (again)",
    "description": "Shortly before Jimmy Kimmel returned, Donald Trump said he's prepared to file another civil suit against ABC for airing speech he doesn't like.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jimmy-kimmel-returns-air-trump-threatens-go-abc-rcna233395",
    "timestamp": "2025-09-24T13:54:38Z"
  },
  {
    "title": "Bessent Says US, Argentina Discussing $20 Billion Swap Line",
    "description": "The US is discussing a $20 billion swap line with Argentina and is ready to buy the country’s dollar bonds, Treasury Secretary Scott Bessent said, giving...",
    "link": "https://finance.yahoo.com/news/bessent-says-us-negotiating-20-124122527.html",
    "timestamp": "2025-09-24T13:54:14Z"
  },
  {
    "title": "Jimmy Kimmel Addresses His Suspension in Return to Air: \"That's Not Legal\"",
    "description": "Jimmy Kimmel has returned to the air and addressed his suspension, saying that \"it was never my intention to make light of the murder of a",
    "link": "https://exclaim.ca/film/article/jimmy-kimmel-addresses-his-suspension-in-return-to-air-that-s-not-legal",
    "timestamp": "2025-09-24T13:52:41Z"
  },
  {
    "title": "Jimmy Kimmel Ratings last night: Here’s how the audience reacted to his ABC return and the emotional monologue",
    "description": "Following a week-long suspension that ignited intense political debate, Jimmy Kimmel Live! returned on Tuesday night, with both the show’s ratings and the Jimmy Kimmel monologue last night drawing significant attention.",
    "link": "https://economictimes.indiatimes.com/news/international/us/jimmy-kimmel-ratings-last-night-heres-how-the-audience-reacted-to-his-abc-return-and-the-emotional-monologue/articleshow/124093978.cms",
    "timestamp": "2025-09-24T13:52:08Z"
  },
  {
    "title": "After Trump’s U-turn, can Ukraine restore its pre-war borders?",
    "description": "The US president, in a first, said Kyiv could win the war, but experts doubt a return to Ukraine's 1991 territory.",
    "link": "https://www.aljazeera.com/news/2025/9/24/after-trumps-u-turn-can-ukraine-restore-its-pre-war-borders",
    "timestamp": "2025-09-24T13:49:01Z"
  },
  {
    "title": "NATO and European Defense in the Face of Russian Resurgence and America First",
    "description": "Lord Hastings Ismay, before he took up office as NATO’s first Secretary General, said that the purpose of the alliance was, “to keep the Soviet Union out, the Americans in, and the Germans down.” These words, spoken in the immediate aftermath of World War II,…",
    "link": "https://www.fairobserver.com/region/europe/nato-and-european-defense-in-the-face-of-russian-resurgence-and-america-first/",
    "timestamp": "2025-09-24T13:48:21Z"
  },
  {
    "title": "Corporate Media Still Too Scared Of Pronoun Mafia To Admit Only Women Get Pregnant",
    "description": "The corporate media omitted the term \"pregnant women\" from its coverage on the alleged link between Tylenol use and autism to satisfy the pro-transgender mob.",
    "link": "https://dailycaller.com/2025/09/24/corporate-media-pronoun-women-pregnant-tylenol/",
    "timestamp": "2025-09-24T13:46:57Z"
  },
  {
    "title": "Economy was strength for Trump in his first term, not anymore, according to recent polling",
    "description": "President Trump's second term sees a shift in his strengths, now emphasizing border security and crime, while facing weakness on the economy, especially among independents. Approval on immigration has slightly decreased, though it remains a relative strength.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/economy-was-strength-for-trump-in-his-first-term-not-anymore-according-to-recent-polling/articleshow/124093947.cms",
    "timestamp": "2025-09-24T13:46:53Z"
  },
  {
    "title": "Jimmy Kimmel Returns With Defiant Monologue After Suspension",
    "description": "Jimmy Kimmel made his highly anticipated return to Jimmy Kimmel Live! on September 23, 2025. He addressed his recent suspension with a fiery opening monologue. The late-night host wasted no time pushing back against critics. Kimmel framed his absence as a bro…",
    "link": "https://www.buddytv.com/jimmy-kimmel-returns-with-defiant-monologue-after-suspension/",
    "timestamp": "2025-09-24T13:46:37Z"
  },
  {
    "title": "Trump Gets Instant Fact Check Over 'Proud' Brag At The UN: 'Does He Just Not Know?'",
    "description": "President Donald Trump on Tuesday delivered a rambling speech at the United Nations headquarters and made one particularly egregious claim.",
    "link": "https://www.huffpost.com/entry/trump-fact-check-approval-ratings-social-media_n_68d3c55de4b0ae58bfe9e662",
    "timestamp": "2025-09-24T13:45:53Z"
  },
  {
    "title": "How Much Ukrainian Land Russia Would Lose As Trump Shifts Stance",
    "description": "Newsweek has produced a map that the shows the territory President Donald Trump said he believes Ukraine would be able to take back from Russia in comments made on Truth Social.\nWhy It Matters\nThe U.S. president’s comments on Tuesday signaled a shift from his…",
    "link": "https://biztoc.com/x/cb7b2c62eea647d4",
    "timestamp": "2025-09-24T13:45:35Z"
  },
  {
    "title": "Trump Dares the United Nations to Mock Him Now (The Atlantic)",
    "description": "The Atlantic:\nTrump Dares the United Nations to Mock Him Now  —  The president made clear that he's done “standing up for the world.”  —  The world laughed at Donald Trump.  —  Seven years ago, Trump was just a few sentences into his annual United Nations Gen…",
    "link": "https://www.memeorandum.com/250924/p36",
    "timestamp": "2025-09-24T13:45:00Z"
  },
  {
    "title": "Trump’s Slumlord Administration Is Gutting the Fair Housing Act",
    "description": "Elie Mystal\n\n\n\nThere can’t be true desegregation without ending discrimination in housing—which is precisely why the administration is rolling back enforcement of the FHA.\r\n\n\r\n\n\nThe post Trump’s Slumlord Administration Is Gutting the Fair Housing Act appeared…",
    "link": "https://www.thenation.com/article/politics/trump-fair-housing-act/",
    "timestamp": "2025-09-24T13:43:49Z"
  },
  {
    "title": "Disney sends stern warning to customers amid boycott threats (My note: THIS IS WHY AI NEWS WRITING WILL NEVER BE ACCEPTABLE)",
    "description": "Disney (DIS) has had a rough week. It faced a massive boycott from customers after briefly pulling the plug on “Jimmy Kimmel Live,” a late-night talk show on ABC. The decision to suspend the show came after comedian Jimmy Kimmel made jokes relating to Preside…",
    "link": "https://freerepublic.com/focus/f-news/4342364/posts",
    "timestamp": "2025-09-24T13:43:00Z"
  },
  {
    "title": "Three wounded in shooting at US immigration facility in Dallas, Texas",
    "description": "US officials say the suspected shooter is dead from a 'self-inflicted gunshot wound'",
    "link": "https://www.aljazeera.com/news/2025/9/24/three-wounded-in-shooting-at-us-immigration-facility-in-dallas-texas",
    "timestamp": "2025-09-24T13:40:06Z"
  },
  {
    "title": "Fox News Guest Suggests Jimmy Kimmel Must Have Blackmailed ABC Execs With ‘Tapes’",
    "description": "Federalist CEO and co-founder Sean Davis suggested Jimmy Kimmel must have decent \"blackmail\" against ABC and Disney executives to land back on TV.\nThe post Fox News Guest Suggests Jimmy Kimmel Must Have Blackmailed ABC Execs With ‘Tapes’ first appeared on Med…",
    "link": "https://www.mediaite.com/media/tv/greg-gutfeld-agrees-with-guest-saying-jimmy-kimmel-must-have-blackmailed-abc-execs-with-tapes/",
    "timestamp": "2025-09-24T13:39:58Z"
  },
  {
    "title": "Joe Rogan Defies Trump Yet Again With Profanity-Laced Kimmel Rant",
    "description": "The podcaster also had a surprising comment about the line that got the talk show host suspended.",
    "link": "https://www.huffpost.com/entry/joe-rogan-government-comedian-monologue-jimmy-kimmel_n_68d3cf95e4b02b5b9fb3b228",
    "timestamp": "2025-09-24T13:38:19Z"
  },
  {
    "title": "Tylenol maker Kenvue faces mounting crisis after Trump blast",
    "description": "Trump’s warnings about the unproven link between Tylenol use during pregnancy to autism in children risks reinvigorating a barrage of litigation over the...",
    "link": "https://finance.yahoo.com/news/tylenol-maker-kenvue-faces-mounting-133725508.html",
    "timestamp": "2025-09-24T13:37:25Z"
  },
  {
    "title": "How much do eggs cost near me? A look at egg prices in three Louisville grocery stores",
    "description": "After being a major concern for consumers at the start of 2025, egg prices have started to plateau. Check out egg prices around Louisville",
    "link": "https://www.courier-journal.com/story/money/personal-finance/2025/09/24/egg-prices-near-me-egg-costs-in-louisville-continue-to-stay-steady/86315458007/",
    "timestamp": "2025-09-24T13:35:31Z"
  },
  {
    "title": "Oil Stretches Gain as Market Tracks Russia Tensions, Supply Risk",
    "description": "Oil extended its biggest gain in more than a week, as US President Donald Trump ramped up his rhetoric against Russia and traders watched for supply disruptions from the OPEC+ member.\nBrent traded above $68 a barrel after gaining 1.6% on Tuesday, while West T…",
    "link": "https://biztoc.com/x/710700ccba32c33b",
    "timestamp": "2025-09-24T13:34:58Z"
  },
  {
    "title": "WATCH LIVE: Ukraine’s Zelenskyy addresses U.N. General Assembly",
    "description": "Ukrainian President Volodymyr Zelenskyy described his Tuesday meeting with President Donald Trump as a \"good one.\"",
    "link": "https://biztoc.com/x/d12742fd618c8cb0",
    "timestamp": "2025-09-24T13:34:14Z"
  },
  {
    "title": "Ukraine's Zelenskyy appears to have used a 'game changer' to manipulate Trump: expert",
    "description": "Donald Trump's abrupt reversal at the United Nations, where he appeared to throw his full support behind Ukraine, while harshly criticizing Russian President Vladimir Putin caught observers by surprise at his sudden change of teams.Trump, long allied with Put…",
    "link": "https://www.rawstory.com/trump-zelenskyy-2674028501/",
    "timestamp": "2025-09-24T13:33:36Z"
  },
  {
    "title": "Theo Von Slams Trump Administration for Using Him in ICE Deportation Video",
    "description": "Theo Von's support for Donald Trump might be waning ... he's pissed the administration used his face to promote Immigration Customs Enforcement deportation videos! The popular podcaster specifically targeted Trump's Department of Homeland Security…\n Permalink",
    "link": "https://www.tmz.com/2025/09/24/theo-von-trump-ice-dhs/",
    "timestamp": "2025-09-24T13:33:17Z"
  }
]