[
  {
    "title": "Gold slumps 1% as US-China trade tensions ease",
    "description": "Gold prices fell over 1% on Monday as easing trade relations between the US and China increased market confidence and reduced safe-haven demand.Last week, US President Donald Trump indicated a possibl...",
    "link": "https://biztoc.com/x/c211a7f7ecb39a2f",
    "timestamp": "2025-04-28T09:40:15Z"
  },
  {
    "title": "PoC rootkit Curing evades traditional Linux detection systems",
    "description": "Researchers created a PoC rootkit called Curing that uses Linux’s io_uring feature to evade traditional system call monitoring. Armo researchers have demonstrated a proof-of-concept (PoC) rootkit named Curing that relies on Linux asynchronous I/O mechanism io…",
    "link": "https://securityaffairs.com/177098/hacking/poc-rootkit-curing-evades-traditional-linux-detection-systems.html",
    "timestamp": "2025-04-28T09:38:36Z"
  },
  {
    "title": "The $160 Billion Fund Behind Novo Nordisk Puts Investing on Hold",
    "description": "The $160 billion fund behind Ozempic-maker Novo Nordisk A/S says President Donald Trump’s tariff war has created so much economic uncertainty that it now sees little likelihood it will move ahead with any big investments.",
    "link": "https://financialpost.com/pmn/business-pmn/the-160-billion-fund-behind-novo-nordisk-puts-investing-on-hold",
    "timestamp": "2025-04-28T09:37:58Z"
  },
  {
    "title": "Aging army tanks donated to Ukraine are yet to leave Australia",
    "description": "A fleet of retired tanks the Albanese government pledged to Ukraine last year remain stuck in Australia, with defence figures in part blaming resistance from the United States for their delayed transfer.",
    "link": "https://www.abc.net.au/news/2025-04-28/aging-tanks-donated-to-ukraine-are-yet-to-leave-australia/105226280",
    "timestamp": "2025-04-28T09:32:45Z"
  },
  {
    "title": "Trump's Next Steps with China Trade War; Canada Election Day",
    "description": "On today's podcast: 1) President Donald Trump’s tariff onslaught has roiled Washington and Wall Street for nearly a month. If the trade war persists, the next upheaval will hit much closer to home. 2) Donald Trump promised Americans a “boom like no other” if …",
    "link": "https://omny.fm/shows/bloomberg-daybreak/trumps-next-steps-with-china-trade-war-canada-election-day",
    "timestamp": "2025-04-28T09:30:19Z"
  },
  {
    "title": "Did You Know Consumer Debt Has Reached an All-Time High?",
    "description": "Katrina vanden Heuvel\n\n\n\nAnd total household debt now exceeds $18 trillion.\r\n\n\r\n\n\nThe post Did You Know Consumer Debt Has Reached an All-Time High? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/economy/consumer-debt-spending-trump-budget/",
    "timestamp": "2025-04-28T09:30:00Z"
  },
  {
    "title": "President Trump is about to complete his first 100 days—here’s what he’s done",
    "description": "In his first 100 days, President Donald Trump exerted his power in a sweep and scale that has no easy historical comparison.\nHis actions target the architecture of the New Deal, the Great Society, and the Reagan Republican orthodoxy of free trade and strong i…",
    "link": "https://biztoc.com/x/018c4baa8440dee9",
    "timestamp": "2025-04-28T09:29:16Z"
  },
  {
    "title": "Trump said to demand a list of 'sanctuary' cities",
    "description": "US President Donald Trump will sign an executive order Monday targeting Democratic-led states and cities that don't fully cooperate with federal immigration authorities, the Wall Street Journal report...",
    "link": "https://biztoc.com/x/6a4274a982bcc895",
    "timestamp": "2025-04-28T09:29:08Z"
  },
  {
    "title": "Thanks to Trump, Chinese firms are warming up to India",
    "description": "Chinese companies are now more open to diluting stakes in favour of Indian entities due to Trump's tariffs. Reliance Industries is a key contender for a stake in Haier India. Shanghai Highly Group has revived talks with Tata-owned Voltas for a joint venture. …",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/thanks-to-trump-chinese-firms-are-warming-up-to-india-reliance-likely-enters-race-for-haier-stake/articleshow/120692015.cms",
    "timestamp": "2025-04-28T09:27:15Z"
  },
  {
    "title": "Thanks to Trump, Chinese firms are warming up to India",
    "description": "Chinese companies are now more open to diluting stakes in favour of Indian entities due to Trump's tariffs. Reliance Industries is a key contender for a stake in Haier India. Shanghai Highly Group has revived talks with Tata-owned Voltas for a joint venture. …",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/thanks-to-trump-chinese-firms-are-warming-up-to-india-reliance-likely-enters-race-for-haier-stake/articleshow/120691611.cms",
    "timestamp": "2025-04-28T09:27:15Z"
  },
  {
    "title": "US Says Houthi Capabilities Degraded",
    "description": "Concerns about civilian impact in Yemen grow as Houthis report dozens killed in airstrike on prison holding African migrants.",
    "link": "https://www.newsweek.com/us-says-houthi-capabilities-degraded-2064851",
    "timestamp": "2025-04-28T09:24:11Z"
  },
  {
    "title": "Houthi rebels say 68 killed by US air strike that hit Yemen detention centre",
    "description": "Yemen's Iran-aligned Houthis has alleged that a US air strike has hit a prison in Saada that holds African migrants.",
    "link": "https://www.abc.net.au/news/2025-04-28/africn-migrants-in-yemen-killed-by-us-airstrike/105225732",
    "timestamp": "2025-04-28T09:23:17Z"
  },
  {
    "title": "Houthi rebels say 68 killed by US air strike that hit Yemen detention centre",
    "description": "Yemen's Iran-aligned Houthis has alleged that a US air strike has hit a detention centre in Saada that holds African migrants.",
    "link": "https://www.abc.net.au/news/2025-04-28/african-migrants-in-yemen-killed-by-us-airstrike/105225732",
    "timestamp": "2025-04-28T09:23:17Z"
  },
  {
    "title": "Philadelphia Eagles to visit Trump at White House today. Here's what to know.",
    "description": "The Philadelphia Eagles will visit President Trump at the White House today to celebrate their Super Bowl win. Here's everything you need to know.",
    "link": "https://www.cbsnews.com/philadelphia/news/eagles-white-house-visit-2025/",
    "timestamp": "2025-04-28T09:19:00Z"
  },
  {
    "title": "What the polls say about Trump's presidency at 100 days",
    "description": "As President Donald Trump hits the 100-day mark of his presidency, a spate of new polling shows significant warning signs on signature issues like the economy and cutting the size of government.",
    "link": "https://biztoc.com/x/332512dcd33a07e2",
    "timestamp": "2025-04-28T09:18:01Z"
  },
  {
    "title": "As China Downplays Trump Tariffs With 5% Growth Target, Top Economist Warns Of '90% Chance Of A US Recession' Amid Trade War",
    "description": "China's National Development and Reform Commission (NDRC), the country's top economic planning agency, is downplaying the impact of President Donald Trump's tariffs and projecting strong growth despite mounting macroeconomic headwinds.\nWhat Happened: On Monda…",
    "link": "https://biztoc.com/x/d66dbf2cdd1bdad5",
    "timestamp": "2025-04-28T09:18:01Z"
  },
  {
    "title": "Carney’s Edge Slips as Canada’s Election Comes to a Hectic End",
    "description": "The Conservative Party chipped away at the lead held by Mark Carney’s Liberals in the final days of Canada’s election campaign, though surveys still point to a probable Liberal victory in Monday’s vote.",
    "link": "https://financialpost.com/pmn/business-pmn/carneys-edge-slips-as-canadas-election-comes-to-a-hectic-end",
    "timestamp": "2025-04-28T09:17:19Z"
  },
  {
    "title": "'That Is Just A Fact': Jen Psaki Hits Trump With Raw Reality Of How Unpopular He Is",
    "description": "She said the president \"badly\" overplayed his hand -- and is now paying the price.",
    "link": "https://www.huffpost.com/entry/jen-psaki-trump-polls_n_680f0cd8e4b049bc73d557a3",
    "timestamp": "2025-04-28T09:17:08Z"
  },
  {
    "title": "Canadians Are Set To Vote In An Election Dominated By Trump's Trade War And Bluster",
    "description": "Canadians will decide whether to extend the Liberal Party’s decade in power or instead hand control to the Conservatives.",
    "link": "https://www.huffpost.com/entry/canadian-election-dominated-by-trump_n_680f451fe4b049bc73d57bf6",
    "timestamp": "2025-04-28T09:17:00Z"
  },
  {
    "title": "Did international trade really kill American manufacturing?",
    "description": "By Donald Trump's telling it did. The data suggest otherwise.",
    "link": "https://www.livemint.com/opinion/online-views/did-international-trade-really-kill-american-manufacturing-11745829227975.html",
    "timestamp": "2025-04-28T09:15:51Z"
  },
  {
    "title": "Trump claims just ‘3’ people crossed the border illegally in the last month",
    "description": "Illegal U.S. border crossings have fallen to their lowest level ever recorded, according to U.S. President Donald Trump.",
    "link": "https://www.bostonherald.com/2025/04/28/trump-claims-just-3-people-crossed-the-border-illegally-in-the-last-month/",
    "timestamp": "2025-04-28T09:15:48Z"
  },
  {
    "title": "FBI Asks for Help Tracking Chinese Salt Typhoon Actors",
    "description": "The US authorities have asked the public to help them unmask China’s Salt Typhoon threat actors",
    "link": "https://www.infosecurity-magazine.com/news/fbi-help-tracking-chinese-salt/",
    "timestamp": "2025-04-28T09:15:00Z"
  },
  {
    "title": "'Trump Coins' lauds Trump for soaring gold prices. Experts point to economic unease",
    "description": "A marketing email for Trump Coins ascribes gold's soaring value to the president's \"strong leadership\" -- but some experts say the surge reflects economic uncertainty.",
    "link": "https://abcnews.go.com/US/trump-coins-lauds-trump-soaring-gold-prices-experts/story?id=121175329",
    "timestamp": "2025-04-28T09:14:20Z"
  },
  {
    "title": "As towns burn and reefs bleach, whither are we bound?",
    "description": "Whether it’s the loss of tropical reefs or ice, towns or forests, it all comes back to the burning of oil, gas and coal.",
    "link": "https://www.nationalobserver.com/2025/04/28/opinion/climate-crisis-federal-election-2025",
    "timestamp": "2025-04-28T09:09:04Z"
  },
  {
    "title": "In Saint John, the city most vulnerable to Trump's tariffs, voters are anxious",
    "description": "Canada's oldest incorporated city exports most of its goods to the United States, which is why it's the one most threatened by the president's erratic trade policy. It is also deeply divided between the Liberals and Conservatives, who are offering wildly diff…",
    "link": "https://www.nationalobserver.com/2025/04/28/news/saint-john-federal-election-2025-tariffs",
    "timestamp": "2025-04-28T09:09:03Z"
  },
  {
    "title": "Putin critic Johann Wadephul, Germany’s incoming foreign minister",
    "description": "Germany’s next foreign minister, Johann Wadephul, is a former soldier, trained lawyer and conservative MP who has long been a strong supporter of military backing for Ukraine as it fights Russia’s invasion. A close confidant of incoming chancellor Friedrich M…",
    "link": "https://www.digitaljournal.com/world/putin-critic-johann-wadephul-germanys-incoming-foreign-minister/article",
    "timestamp": "2025-04-28T09:07:20Z"
  },
  {
    "title": "Putin Critic Johann Wadephul, Germany's Incoming Foreign Minister",
    "description": "Germany's next foreign minister, Johann Wadephul, is a former soldier, trained lawyer and conservative MP who has long been a strong supporter of military backing for Ukraine as it fights Russia's invasion.",
    "link": "https://www.ibtimes.com/putin-critic-johann-wadephul-germanys-incoming-foreign-minister-3771630",
    "timestamp": "2025-04-28T09:06:08Z"
  },
  {
    "title": "Russia says claims over annexed Ukraine regions 'imperative' in talks",
    "description": "Russia said on Monday it was ready to negotiate with Ukraine but that recognition of Moscow's claims over five Ukrainian regions including Crimea were \"imperative\" to resolving the conflict.",
    "link": "https://www.hurriyetdailynews.com/russia-says-claims-over-annexed-ukraine-regions-imperative-in-talks-208559",
    "timestamp": "2025-04-28T09:04:16Z"
  },
  {
    "title": "Made-for-TV presidency: How Trump's past brings reality show vibe to first 100 days",
    "description": "From 'The Apprentice' to the White House, Donald Trump is using the skills he honed as a TV reality star and applying them to the presidency.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/28/trump-made-for-tv-presidency/82756251007/",
    "timestamp": "2025-04-28T09:02:33Z"
  },
  {
    "title": "FIRST 100 DAYS: Here’s what Americans want President Trump to focus on next",
    "description": "Everyday Americans spoke to Fox News Digital this month about what they'd like to see President Trump focus on next as he marks 100 days in office this week.",
    "link": "https://www.foxnews.com/media/first-100-days-heres-americans-president-trump-focus-next",
    "timestamp": "2025-04-28T09:00:52Z"
  },
  {
    "title": "First on CNN: Harris to give remarks as President Trump marks 100th day in office | CNN Politics",
    "description": "Former Vice President Kamala Harris will make a rare public appearance this week in California, addressing an annual gathering of one of the nation’s largest networks of Democratic women elected officials just one day after President Donald Trump marks his fi…",
    "link": "https://www.cnn.com/2025/04/28/politics/harris-remarks-trump-100-days/index.html",
    "timestamp": "2025-04-28T09:00:51Z"
  },
  {
    "title": "US Universities Don't Like Unmasking Their Foreign Donors. A New Trump Order Aims To Make Them.",
    "description": "For decades, federal law has required U.S. universities to disclose the sources of large foreign donations to the federal government. But the Biden administration sparsely enforced the law, allowing foreign nationals from adversarial countries to funnel cash …",
    "link": "https://freebeacon.com/campus/us-universities-dont-like-unmasking-their-foreign-donors-a-new-trump-order-aims-to-make-them/",
    "timestamp": "2025-04-28T09:00:41Z"
  },
  {
    "title": "ABC, NBC and CBS slap Trump with 92% negative coverage as 100th day of second term approaches, study finds",
    "description": "The Media Research Center analyzed ABC’s \"World News Tonight,\" \"NBC Nightly News\" and \"CBS Evening News\" and found largely negative coverage.",
    "link": "https://www.foxnews.com/media/abc-nbc-cbs-slap-trump-92-negative-coverage-100th-day-second-term-approaches-study-finds",
    "timestamp": "2025-04-28T09:00:41Z"
  },
  {
    "title": "Accident or Attack? Explosion at Iran’s Busiest Commercial Port Will Reverberate Beyond Bandar Abbas Either Way",
    "description": "Explosion likely to exacerbate existing problems with the Iranian economy, which include high inflation that is hitting food prices particularly hard and weak economic growth due to sanctions",
    "link": "https://www.nakedcapitalism.com/2025/04/accident-or-attack-explosion-at-irans-busiest-commercial-port-will-reverberate-beyond-bandar-abbas-either-way.html",
    "timestamp": "2025-04-28T09:00:39Z"
  },
  {
    "title": "Trump should meet with Main Street businessmen. They deserve it",
    "description": "Small businesses are essential to the US economy -- all 35 million of them. If the White House wants to show it cares about Main Street, then Trump should meet with small business owners.",
    "link": "https://www.foxnews.com/opinion/trump-should-meet-main-street-businessmen-deserve",
    "timestamp": "2025-04-28T09:00:38Z"
  },
  {
    "title": "The White House and the courts must come to a common sense understanding of their obligations",
    "description": "The White House and the courts owe it to the Constitution to reach an understanding of their respective obligations for the sake of national security.",
    "link": "https://www.foxnews.com/opinion/white-house-courts-must-come-common-sense-understanding-obligations",
    "timestamp": "2025-04-28T09:00:35Z"
  },
  {
    "title": "Swiss Agree to Tariff Negotiations With Trump Administration",
    "description": "Switzerland said it’s one of 15 countries that will get “somewhat preferential treatment,” after agreeing to tariff negotiations with the Trump administration.",
    "link": "https://www.livemint.com/companies/news/swiss-agree-to-tariff-negotiations-with-trump-administration-11745830831873.html",
    "timestamp": "2025-04-28T09:00:31Z"
  },
  {
    "title": "Former FCC Chairs: In the Name of the First Amendment, Trump's FCC Attacks Its Principles | Opinion",
    "description": "Using vague government policy as a tool of political coercion is a tactic historically associated with authoritarian regimes.",
    "link": "https://www.newsweek.com/former-fcc-chairs-name-first-amendment-trumps-fcc-attacks-its-principles-opinion-2064286",
    "timestamp": "2025-04-28T09:00:02Z"
  },
  {
    "title": "The future of America's biggest safety net is in the hands of a career bureaucrat and a hard-charging finance titan",
    "description": "Acting commissioner Leland Dudek helms the nearly 60,000-person federal agency. Frank Bisignano, a former JPMorgan Chase and Citigroup executive, waits in the wings.",
    "link": "https://www.businessinsider.com/social-security-administration-leland-dudek-frank-bisignano-transition-2024-4",
    "timestamp": "2025-04-28T09:00:02Z"
  },
  {
    "title": "Trump's Mass Deportations Are Pushing US Farms to Breaking Point",
    "description": ".\"We are dangerously close to a breaking point,\" Martin Casanova, founder of THX, told Newsweek.",
    "link": "https://www.newsweek.com/trump-mass-deportation-farms-breaking-point-2064190",
    "timestamp": "2025-04-28T09:00:01Z"
  },
  {
    "title": "BYD is coming for Tesla's lunch",
    "description": "A version of this article originally appeared in Quartz’s members-only Weekend Brief newsletter. Quartz members get access to exclusive newsletters and more. Sign up here.Read more...",
    "link": "https://qz.com/tesla-byd-ford-elon-musk-china-evs-1851777820",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Defending Jan. 6 Rioters, Investigating Democrats: How Ed Martin Is Weaponizing the DOJ for Trump",
    "description": "by Andy Kroll and Jeremy Kohler \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nWhen President Donald Trump chose Ed Martin, the Missouri lawye…",
    "link": "https://www.propublica.org/article/who-is-ed-martin-career-dc-us-attorney",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "5 policy issues Republicans are clashing over in a massive bill for Trump's agenda",
    "description": "There are major unresolved questions over Medicaid spending, tax cuts and clean energy rollbacks as Republican lawmakers begin crafting the legislation.",
    "link": "https://www.nbcnews.com/politics/congress/5-policy-issues-republicans-are-clashing-massive-bill-trumps-agenda-rcna202364",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Visa’s Earnings Could Impress, But Tariff Risks Loom Large",
    "description": "Visa (NYSE:V) is scheduled to announce its earnings on April 29. According to consensus estimates, revenues are anticipated to increase by roughly 9% compared...",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/04/28/visas-earnings-could-impress-but-tariff-risks-loom-large/",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Canada's election: all you need to know",
    "description": "Canada's snap election has been dominated by one politician — who's not even in the race — President Trump.",
    "link": "https://www.npr.org/2025/04/28/nx-s1-5371658/canada-election-carney-trump-tariffs",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "What the polls say about Trump's presidency at 100 days",
    "description": "As President Donald Trump hits the 100-day mark of his presidency, a spate of new polling shows significant warning signs on signature issues like the economy and cutting the size of government.",
    "link": "https://www.nbcnews.com/politics/trump-administration/polls-say-trumps-presidency-100-days-rcna202146",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Why the Right Fantasizes About Death and Destruction",
    "description": "Nathan Taylor Pemberton\n\n\n\nIn Richard Seymour’s Disaster Nationalism, he attempts to diagnose the apocalyptic nature of conservatism around the world. \r\n\n\r\n\n\nThe post Why the Right Fantasizes About Death and Destruction appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=552791",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Weekly Climate and Energy News Roundup #640",
    "description": "Quote of the Week: “In framing a government which is to be administered by men over men, the great difficulty lies in this: you must first enable the government to control the governed; and in the next place, oblige it to control itself.” — James Madison (178…",
    "link": "https://wattsupwiththat.com/2025/04/28/weekly-climate-and-energy-news-roundup-640/",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Trump traveled little in his first 100 days, preferring to spend time at Mar-a-Lago",
    "description": "According to an NBC News analysis, Trump has spent 12 of the 14 past weekends at his own properties, and he's traveled far less than he did during this same period in his first term.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-traveled-little-first-100-days-mar-lago-golf-rcna201160",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Trump needs unity among Republicans to pass his budget bill. Can he get it?",
    "description": "Congress returns from a two-week recess with a massive item on its to-do list: budget reconciliation. Lawmakers barely passed the plan's framework along party lines and now face an uphill battle on reaching consensus.",
    "link": "https://www.npr.org/2025/04/28/g-s1-62678/trump-needs-unity-among-republicans-to-pass-his-budget-bill-can-he-get-it",
    "timestamp": "2025-04-28T09:00:00Z"
  },
  {
    "title": "Donald Trump Is Following the Sam Brownback Playbook",
    "description": "The former Kansas governor’s radical economic agenda undermined the state’s prosperity, decimated vital government services, tanked his popularity, and put a Democrat in power. Could the same fate await the current president? \nThe post Donald Trump Is Followi…",
    "link": "http://washingtonmonthly.com/2025/04/28/donald-trump-is-following-the-sam-brownback-playbook/",
    "timestamp": "2025-04-28T08:59:00Z"
  },
  {
    "title": "Greenland's New Prime Minister Has A Message For Trump",
    "description": "Donald Trump has shown interest taking control of the strategic territory.",
    "link": "https://www.huffpost.com/entry/greenland-prime-minister-message-to-trump_n_680f3ee4e4b049bc73d572dd",
    "timestamp": "2025-04-28T08:58:01Z"
  },
  {
    "title": "China rejects Trump’s claim that Xi has called him by phone | CNN",
    "description": "Chinese leader Xi Jinping has not spoken to US President Donald Trump on the phone recently, Beijing said Monday, reiterating that no talks are taking place between the two countries to resolve their tariff war.",
    "link": "https://www.cnn.com/2025/04/28/china/china-rejects-trump-claim-xi-call-intl-hnk/index.html",
    "timestamp": "2025-04-28T08:53:10Z"
  },
  {
    "title": "How to avoid credit card late fees after a court threw out a proposed cap",
    "description": "A Texas judge earlier this month threw out a federal rule that would have capped credit card late fees at $8.  The Consumer Finance Protection Bureau...",
    "link": "https://finance.yahoo.com/news/avoid-credit-card-fees-court-085242141.html",
    "timestamp": "2025-04-28T08:52:42Z"
  },
  {
    "title": "FIIs are back but retail has started selling; stay cautious on auto, IT & FMCG: Dinshaw Irani",
    "description": "Foreign Institutional Investors are back in the Indian market. They have invested significantly, around $3.5-4 billion. This signals active investment. Dinshaw Irani expresses caution about high valuations. He notes retail selling impacts mid and small-cap pe…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/fiis-are-back-but-retail-has-started-selling-stay-cautious-on-auto-it-fmcg-dinshaw-irani/articleshow/120690852.cms",
    "timestamp": "2025-04-28T08:51:01Z"
  },
  {
    "title": "Why Crimea is so important to Russia and Ukraine",
    "description": "The strategic peninsula of Crimea is crucial in US-led efforts to end Russia's war in Ukraine.",
    "link": "https://news.sky.com/story/why-crimea-is-so-important-to-russia-and-ukraine-13357440",
    "timestamp": "2025-04-28T08:51:00Z"
  },
  {
    "title": "Canada's election set to define relationship with Trump's US",
    "description": "US tariffs and Donald Trump's \"51st state\" antagonism have shaken up Canada's election. Here's what to know ahead of the vote.",
    "link": "https://www.dw.com/en/canadas-election-set-to-define-relationship-with-trumps-us/a-72369042",
    "timestamp": "2025-04-28T08:49:00Z"
  },
  {
    "title": "In Trump's immigration crackdown, nightclubs targeted and over 100 'illegal aliens' arrested",
    "description": "US authorities arrested over 100 undocumented migrants in a Colorado nightclub raid, part of President Trump's intensified immigration crackdown targeting gangs like Tren de Aragua and MS-13. The DEA operation, which also seized drugs and weapons, drew praise…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-trumps-immigration-crackdown-nightclubs-targeted-and-over-100-illegal-aliens-arrested/articleshow/120690977.cms",
    "timestamp": "2025-04-28T08:47:40Z"
  },
  {
    "title": "JB Pritzker Strikes Gavin Newsom Contrast as Democrats Eye 2028",
    "description": "The Illinois governor called out \"do-nothing Democrats\" and called for \"mass protests, for mobilization, for disruption.\"",
    "link": "https://www.newsweek.com/jb-pritzker-strikes-gavin-newsom-contrast-democrats-eye-2028-2064871",
    "timestamp": "2025-04-28T08:47:38Z"
  },
  {
    "title": "China, HK stocks flat; rebound fades amid no new stimulus to counter US tariffs",
    "description": "China and Hong Kong stocks barely moved on Monday after Beijing pledged to stabilise capital markets without announcing fresh stimulus to counter the hefty U.S. tariffs.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-hk-stocks-flat-rebound-fades-amid-no-new-stimulus-to-counter-us-tariffs/articleshow/120690975.cms",
    "timestamp": "2025-04-28T08:47:35Z"
  },
  {
    "title": "Ukraine Says It Detained Grain Ship From Russia’s ‘Shadow Fleet’",
    "description": "Kyiv detained a ship it says was part of Moscow’s “shadow fleet” which illegally exports grain from areas of Ukraine occupied by Russian forces. A dry cargo ship was detained in Ukrainian territorial waters as it headed from Moldova along …",
    "link": "https://www.insurancejournal.com/news/international/2025/04/28/821469.htm",
    "timestamp": "2025-04-28T08:47:30Z"
  },
  {
    "title": "A siege on science: How Trump is undoing an American legacy",
    "description": "In its first 100 days, the Trump administration has slashed federal agencies, canceled national reports, and yanked funding from universities. The shockwaves will be felt worldwide.",
    "link": "http://grist.org/science/american-climate-research-agencies-universities-trump-100-days/",
    "timestamp": "2025-04-28T08:45:40Z"
  },
  {
    "title": "China says on 'right side of history' in trade standoff with US",
    "description": "A top Chinese economic official asserted that Beijing is on the \"right side of history\" amidst its trade war with the United States, condemning Washington's \"unilateralism and bullying.\" China vowed to fight \"to the end\" while acknowledging the strain on its …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-says-on-right-side-of-history-in-trade-standoff-with-us/articleshow/120690924.cms",
    "timestamp": "2025-04-28T08:44:34Z"
  },
  {
    "title": "U.S. Treasury yields: investors look ahead to key inflation report",
    "description": "U.S. Treasury yields were little changed on Monday as investors look ahead to economic data, including the Federal Reserve's preferred inflation gauge.",
    "link": "https://www.cnbc.com/2025/04/28/us-treasury-yields-investors-look-ahead-to-key-inflation-report.html",
    "timestamp": "2025-04-28T08:43:57Z"
  },
  {
    "title": "'What's Israel's strategy?': U.S. hostage families call on Trump to negotiate directly with Hamas",
    "description": "At the annual American Jewish Committee gathering, the families criticized the government's refusal to sign a hostage deal that would end the war. Netanyahu isn't expected to speak at the Forum, highlighting a growing ideological rift with the committee",
    "link": "https://www.haaretz.com/us-news/2025-04-28/ty-article/.premium/whats-the-strategy-u-s-hostage-families-urge-trump-to-negotiate-directly-with-hamas/00000196-7b38-de13-add7-7b7b9dea0000",
    "timestamp": "2025-04-28T08:43:34Z"
  },
  {
    "title": "Nexo back in the United States as Trump Jr. attends exclusive event",
    "description": "Cryptocurrency services platform Nexo announced that it is reentering the US market after facing previous regulatory challenges.According to an April 28 announcement, Nexo’s reentry event featured Donald Trump Jr., who said that he thinks “crypto is the futur…",
    "link": "https://cointelegraph.com/news/nexo-is-back-in-the-united-states-trump-jr-comments-on-the-event",
    "timestamp": "2025-04-28T08:42:09Z"
  },
  {
    "title": "Kiev has escalated attacks on civilians – Moscow",
    "description": "Moscow has accused Kiev of escalating attacks against civilians in response to US-Russian diplomatic reengagement Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616421-kiev-attack-russian-civilians/",
    "timestamp": "2025-04-28T08:40:09Z"
  },
  {
    "title": "Moscow unveils details of latest phone call with US",
    "description": "Russian FM Lavrov and his US counterpart Rubio continued “a productive exchange of opinions,” Moscow’s Foreign Ministry has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616414-lavrov-rubio-ukraine-talks/",
    "timestamp": "2025-04-28T08:39:35Z"
  },
  {
    "title": "Palestine to testify, Israel to hold separate presser as ICJ hearings begin",
    "description": "The hearings will focus on the question of whether Israel acted against its commitments in banning UNRWA in November.",
    "link": "https://www.jpost.com/israel-news/article-851813",
    "timestamp": "2025-04-28T08:38:46Z"
  },
  {
    "title": "‘Flattering’ Portrait that Putin Gifted to Trump Last Month Finally Unveiled",
    "description": "The painting shows Trump with blood streaming from his ear after his assassination attempt",
    "link": "https://www.artnews.com/art-news/news/portrait-that-putin-gifted-to-trump-last-month-finally-revealed-1234739969/",
    "timestamp": "2025-04-28T08:36:50Z"
  },
  {
    "title": "'Conclave': Pope's election turned into political thriller",
    "description": "Some 120 Cardinals will join a Vatican conclave to elect Pope Francis' successor. The subject of an Oscar-winning film and best-selling book, papal elections are now a pop culture sensation. In the wake of Pope Francis' passing on April 21, the Vatican has th…",
    "link": "https://www.dw.com/en/conclave-popes-election-turned-into-political-thriller/a-72354684",
    "timestamp": "2025-04-28T08:36:00Z"
  },
  {
    "title": "Attackers chained Craft CMS zero-days attacks in the wild",
    "description": "Orange Cyberdefense’s CSIRT reported that threat actors exploited two vulnerabilities in Craft CMS to breach servers and steal data. Orange Cyberdefense’s CSIRT warns that threat actors chained two Craft CMS vulnerabilities in recent attacks. Orange experts d…",
    "link": "https://securityaffairs.com/177085/hacking/attackers-chained-craft-cms-zero-days-attacks-in-the-wild.html",
    "timestamp": "2025-04-28T08:34:17Z"
  },
  {
    "title": "Trump says Virginia Giuffre's death is 'a horrible thing'",
    "description": "Donald Trump has said the death of Virginia Giuffre, who accused Prince Andrew of sexual assault, is \"a horrible thing\".",
    "link": "https://news.sky.com/story/trump-says-death-of-virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-is-a-horrible-thing-13357433",
    "timestamp": "2025-04-28T08:31:00Z"
  },
  {
    "title": "Crypto Bettors Boost India's Odds In Polymarket Bet On Trump Trade Deal",
    "description": "Crypto bettors have placed India on top of the list of countries that they believe will get a trade deal with the U.S. before July, pushing Japan and Israel in second place in the rankings.",
    "link": "https://www.ibtimes.com/crypto-bettors-boost-indias-odds-polymarket-bet-trump-trade-deal-3771620",
    "timestamp": "2025-04-28T08:23:46Z"
  },
  {
    "title": "Japan supermarket rice prices up for 16th straight week, imports seen jumping",
    "description": "TOKYO :Japanese supermarket rice prices rose for the 16th straight week and doubled from a year ago, the agriculture ministry said on Monday, despite the government's release of the staple grain from its emergency stockpile to lower prices. In the week to Apr…",
    "link": "https://www.channelnewsasia.com/business/japan-supermarket-rice-prices-up-16th-straight-week-imports-seen-jumping-5094386",
    "timestamp": "2025-04-28T08:20:33Z"
  },
  {
    "title": "Melania memecoin team sells $1.5M tokens as price pumps 21%",
    "description": "The team behind the Official Melania Meme (MELANIA) token sold more than $1.5 million of tokens over the past three days, suggesting a programmatic selling strategy that may add downside pressure to the token.The team behind the Melania memecoin sold another …",
    "link": "https://cointelegraph.com/news/melania-memecoin-team-sells-1-5m-tokens-price-pumps-21",
    "timestamp": "2025-04-28T08:19:49Z"
  },
  {
    "title": "Mike Myers says SNL Canada protest was ‘angry’ response to Donald Trump",
    "description": "‘It was not about me – it was about my country,’ ‘Austin Powers’ actor said",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/mike-myers-snl-trump-elon-musk-b2740613.html",
    "timestamp": "2025-04-28T08:17:58Z"
  },
  {
    "title": "China says on ‘right side of history’ in trade standoff with US",
    "description": "A top Chinese economic official on Monday said Beijing was on the “right side of history” in its gruelling trade war with the United States. Since returning to the White House in January, US President Donald Trump has imposed 10 percent tariffs on most US tra…",
    "link": "https://www.digitaljournal.com/world/china-says-on-right-side-of-history-in-trade-standoff-with-us/article",
    "timestamp": "2025-04-28T08:17:20Z"
  },
  {
    "title": "Campus crackdown: Protest encampments prevented amid Trump admin action",
    "description": "Antisemitism and diaspora affairs correspondent Michael Starr is in the 'Post' Studio for an update on all things campus protests and antisemitism.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-851805",
    "timestamp": "2025-04-28T08:15:46Z"
  },
  {
    "title": "Kremlin 'Ready' for Ukraine Talks as Trump Criticizes Putin Again",
    "description": "Trump had expressed disappointment in Putin after urging him to stop attacking Ukraine and agree on a peace deal.",
    "link": "https://www.newsweek.com/kremlin-ready-ukraine-talks-trump-criticizes-putin-again-2064891",
    "timestamp": "2025-04-28T08:15:35Z"
  },
  {
    "title": "With climate action at stake, pro-Trump statement at UNPFII met with silence",
    "description": "Indigenous women are among those most impacted by climate change while the Trump administration promotes entrepreneurship in Indian Country.",
    "link": "http://grist.org/indigenous/with-climate-action-at-stake-pro-trump-statement-at-unpfii-met-with-silence/",
    "timestamp": "2025-04-28T08:15:00Z"
  },
  {
    "title": "BRICS set to meet over Trump trade policies",
    "description": "Senior diplomats from BRICS countries were set to meet yesterday in Brazil to present a united front in the face of threats emerging from U.S. President Donald Trump's aggressive trade policies.",
    "link": "https://www.hurriyetdailynews.com/brics-set-to-meet-over-trump-trade-policies-208555",
    "timestamp": "2025-04-28T08:13:53Z"
  },
  {
    "title": "A List of Companies Still Committed To DEI Initiatives",
    "description": "Photo: Justin Sullivan (Getty Images)\r\nSince Donald Trump attacked diversity, equity, and inclusion initiatives, companies such as Walmart have turned its back on their DEI initiatives. However, not all businesses have decided to follow Donald Trump’s guidanc…",
    "link": "https://www.theroot.com/a-llist-of-companies-still-committed-to-dei-initiatives-1851778015",
    "timestamp": "2025-04-28T08:12:00Z"
  },
  {
    "title": "More than 100 immigrants detained at illegal after-hours nightclub",
    "description": "More than 100 immigrants have been taken into custody following a federal raid at an illegal after-hours nightclub in Colorado.",
    "link": "https://news.sky.com/story/more-than-100-immigrants-detained-at-illegal-after-hours-nightclub-in-colorado-13357424",
    "timestamp": "2025-04-28T08:08:00Z"
  },
  {
    "title": "How America loses its edge",
    "description": "Trump's funding cuts at universities are jeopardizing his \"America First\" mission. The US, a leader in Nobel prizes, could start to slip.",
    "link": "https://www.businessinsider.com/trump-research-funding-cuts-nobel-prizes-brain-drain-medicine-ai-2025-4",
    "timestamp": "2025-04-28T08:06:01Z"
  },
  {
    "title": "Trump says 'disruptors' at GOP town hall events should be 'immediately ejected': 'Troublemakers'",
    "description": "President Donald Trump called on Republicans to respond to \"disruptors and troublemakers\" at town hall events by having them \"immediately ejected.\"",
    "link": "https://www.foxnews.com/politics/trump-says-disruptors-gop-town-hall-events-should-immediately-ejected-troublemakers",
    "timestamp": "2025-04-28T08:04:09Z"
  },
  {
    "title": "European shares edge higher as investors await tariff updates, economic data",
    "description": "European shares nudged higher on Monday, after registering a second consecutive weekly gain, as investors looked ahead to potential tariff developments and a busy week of earnings and economic data.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-higher-as-investors-await-tariff-updates-economic-data/articleshow/120690053.cms",
    "timestamp": "2025-04-28T08:03:13Z"
  },
  {
    "title": "Trump claims Zelensky ready to ‘give up’ Crimea",
    "description": "The Ukrainian leader has repeatedly insisted that he would never formally recognize the peninsula as Russian territory Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616418-trump-zelensky-ukraine-crimea/",
    "timestamp": "2025-04-28T08:02:02Z"
  },
  {
    "title": "CBS Poll: Trump Deportation Policy Gets 56 Percent Support",
    "description": "A CBS poll of 2,365 adults reveals that 56 percent approve of President Donald Trump's \"program to find and deport immigrants who are in the U.S. illegally.\"\nThe post CBS Poll: Trump Deportation Policy Gets 56 Percent Support appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/04/28/cbs-poll-trump-deportion-policy-gets-56-percent-support/",
    "timestamp": "2025-04-28T08:01:54Z"
  },
  {
    "title": "Is Gen Z Abandoning Donald Trump?",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOnce seen as a wild card with surprising appeal among disillusioned young voters, President Donald Trump is now facing a sharp decline in support from Generation Z, according to new polling.\nNewsweek analyzed …",
    "link": "https://biztoc.com/x/9ba8bb4eb836ff76",
    "timestamp": "2025-04-28T08:00:37Z"
  },
  {
    "title": "Trump Jr. Leans On His Czech Roots To Boost US-Eastern Europe Ties While 'Pulling Away' From China: 'It's Not The Evil Boogeyman Of Russia, But Likely China'",
    "description": "In a recent private event, Donald Trump Jr., son of the U.S. President, voiced his support for enhanced business cooperation with Eastern Europe.\nWhat Happened: Trump Jr. underscored his close connections to the region during his address at the Trump Business…",
    "link": "https://biztoc.com/x/1074f3905529ff66",
    "timestamp": "2025-04-28T08:00:35Z"
  },
  {
    "title": "Canadians vote today after fierce campaign shaped by Trump",
    "description": "Millions of Canadians are expected to cast their ballots today in a pivotal election that will decide who will lead the country through a trade battle with the United States.",
    "link": "https://www.cbc.ca/news/politics/carney-poilievre-federal-election-vote-1.7518649",
    "timestamp": "2025-04-28T08:00:04Z"
  },
  {
    "title": "Are things finally about to be normal again for investors?",
    "description": "Investors' fever dream could soon be over",
    "link": "https://www.businessinsider.com/stock-market-normal-again-for-investors-tariffs-trade-war-trump-2025-4",
    "timestamp": "2025-04-28T08:00:02Z"
  },
  {
    "title": "Is Gen Z Abandoning Donald Trump?",
    "description": "Donald Trump made significant inroads among Gen Z voters in 2024, but recent polls suggest his support among them may be crumbling.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-gen-z-polling-2060330",
    "timestamp": "2025-04-28T08:00:01Z"
  },
  {
    "title": "Most Americans Skeptical About Benefits of Tariffs",
    "description": "Most Americans expect their country's new tariffs to result in higher prices in the U.S. and to cost more than they raise, with about half believing that job gains will result.",
    "link": "https://news.gallup.com/poll/660002/americans-skeptical-benefits-tariffs.aspx",
    "timestamp": "2025-04-28T08:00:00Z"
  },
  {
    "title": "What's at stake for Ontario in today's federal election",
    "description": "For 14 of the last 15 federal elections, the party taking the most seats in Ontario has also formed government. Tonight we'll learn whether that trend continues.",
    "link": "https://www.cbc.ca/news/canada/toronto/federal-election-setup-ontario-1.7516853",
    "timestamp": "2025-04-28T08:00:00Z"
  }
]