[
  {
    "title": "‘Holy Bazinga!’ Stephen Colbert Roasts His CBS Bosses for Considering ‘Shady’ $50M Trump Payoff",
    "description": "Comedian Stephen Colbert turned his fire inwards on The Late Show Tuesday night and unloaded on CBS’s parent company, Paramount, over reports it may pay President Donald Trump a hefty settlement – just as the company awaits regulatory approval from his admini…",
    "link": "https://www.mediaite.com/media/news/holy-bazinga-stephen-colbert-roasts-his-cbs-bosses-for-considering-shady-50m-trump-payoff/",
    "timestamp": "2025-05-21T14:35:08Z"
  },
  {
    "title": "Trump helps Gulf states become AI powers amid looming China fears",
    "description": "Donald Trump's recent visit to the Middle East was defined by a flurry of artificial intelligence investment deals involving Saudi Arabia and the UAE. Critics say it could help China gain access to critical technology.",
    "link": "https://biztoc.com/x/13fa052a484efeb4",
    "timestamp": "2025-05-21T14:34:55Z"
  },
  {
    "title": "Jimmy Kimmel Can’t Resist Attacking Donald Trump Even While Announcing The Birth Of His First Granddaughter: “You Are NOT Dating Her In 21 Years”",
    "description": "The late night host was quick to lay down the law with President Trump.",
    "link": "https://decider.com/2025/05/21/jimmy-kimmel-cant-resist-attacking-donald-trump-even-while-announcing-the-birth-of-his-first-granddaughter-you-are-not-dating-her-in-21-years/",
    "timestamp": "2025-05-21T14:32:42Z"
  },
  {
    "title": "Trump Trade: Conservatives fight to end IRA tax credits sooner",
    "description": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald...",
    "link": "https://finance.yahoo.com/news/trump-trade-conservatives-fight-end-143018383.html",
    "timestamp": "2025-05-21T14:30:18Z"
  },
  {
    "title": "The Latest: House Republicans grinding through Trump's tax breaks bill",
    "description": "House Republicans are grinding out last-minute deal-making to shore up wavering GOP support and deliver on Trump’s top legislative priority, a multi-trillion-dollar tax breaks package, as soon as Wednesday",
    "link": "https://abcnews.go.com/US/wireStory/latest-house-republicans-grinding-trumps-tax-breaks-bill-122026235",
    "timestamp": "2025-05-21T14:30:17Z"
  },
  {
    "title": "Transgender athlete's win at Illinois middle school track meet sparks heated debate",
    "description": "Debate over a transgender student’s win in a middle school girls track meet grew heated at a school board meeting in suburban Illinois this week.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/transgender-athletes-win-illinois-middle-school-track-meet-sparks-heat-rcna208197",
    "timestamp": "2025-05-21T14:29:02Z"
  },
  {
    "title": "CNN Anchor Flat-Out Asks Comey About 86 Trump Pic: ‘Maybe I Just Shouldn’t Post This?”",
    "description": "CNN anchor John Berman flat-out asked Comey whether he ever thought \"maybe I just shouldn't post\" a photo that Trump construed as an “assassination threat.”\nThe post CNN Anchor Flat-Out Asks Comey About 86 Trump Pic: ‘Maybe I Just Shouldn’t Post This?” first …",
    "link": "https://www.mediaite.com/media/news/cnn-anchor-flat-out-asks-comey-about-86-trump-pic-maybe-i-just-shouldnt-post-this/",
    "timestamp": "2025-05-21T14:29:00Z"
  },
  {
    "title": "‘Got Worse Overnight’: Freedom Caucus Chair Says There’s ‘No Way’ Trump’s ‘Beautiful Bill’ Will Pass Immediately",
    "description": "House Freedom Caucus chairman Andy Harris expressed no hope that the sweeping tax and spending package backed by President Donald Trump will pass.",
    "link": "https://dailycaller.com/2025/05/21/house-freedom-caucus-chair-andy-harris-bill-not-pass/",
    "timestamp": "2025-05-21T14:28:18Z"
  },
  {
    "title": "Nvidia CEO calls Biden's AI chip curbs on China 'a failure' and praises Trump's changes",
    "description": "U.S. efforts to curtail China’s access to advanced artificial intelligence chips have backfired, Nvidia (NVDA) CEO Jensen Huang said Wednesday, adding that the Biden administration’s export restrictions didn’t slow China’s AI ambitions — they accelerated them…",
    "link": "https://qz.com/nvidia-jensen-huang-ai-chips-trump-biden-u-s-china-1851781680",
    "timestamp": "2025-05-21T14:28:08Z"
  },
  {
    "title": "‘Bringing Christianity BACK to America!’ Trump kills $38 million fine Biden imposed on Christian school",
    "description": "'The facts clearly support our contention that we were wrongly accused of misleading our doctoral students'",
    "link": "https://www.wnd.com/2025/05/bringing-christianity-back-to-america-trump-kills-38-million-fine-biden-imposed-on-christian-school/",
    "timestamp": "2025-05-21T14:27:42Z"
  },
  {
    "title": "Justin Sun Emerges as Donald Trump Memecoin's Top Holder With $21.9M Stake",
    "description": "Sun had previously invested $75 million in World Liberty Financial, a decentralized finance project backed by the Trump family.",
    "link": "https://www.coindesk.com/business/2025/05/21/justin-sun-emerges-as-donald-trump-memecoins-top-holder-with-219m-stake",
    "timestamp": "2025-05-21T14:26:49Z"
  },
  {
    "title": "Trump fires golf balls at Bruce Springsteen in bizarre feud video",
    "description": "President Donald Trump teed off against Bruce Springsteen in a Truth Social post Wednesday.A video on the network shows the president hitting a golf ball, with onlookers shouting \"very nice\" and \"good shot.\" The video then cuts to show an animated golf ball s…",
    "link": "https://www.rawstory.com/bruce-springsteen-trump-2672180377/",
    "timestamp": "2025-05-21T14:26:21Z"
  },
  {
    "title": "Stream Bruce Springsteen’s Great New Live EP to Anger Donald Trump",
    "description": "Live recording from Manchester earlier this month includes the artist's comments about Trump's \"corrupt, incompetent, and treasonous administration\"",
    "link": "http://www.rollingstone.com/music/music-news/bruce-springsteen-donald-trump-land-hope-dreams-1235344683/",
    "timestamp": "2025-05-21T14:25:35Z"
  },
  {
    "title": "It’s not just Microsoft, Google, or Amazon — top European companies have also laid off a massive number of employees since April; here’s what you need to know",
    "description": "European firms are reducing workforce due to economic challenges. Several companies including Stellantis, Volkswagen, and Volvo Trucks have announced layoffs. Banks such as Commerzbank, HSBC, and UBS are also cutting jobs. Industrial companies like STMicroele…",
    "link": "https://economictimes.indiatimes.com/news/international/us/its-not-just-microsoft-google-or-amazon-top-european-companies-have-also-laid-off-a-massive-number-of-employees-since-april-heres-what-you-need-to-know/articleshow/121318288.cms",
    "timestamp": "2025-05-21T14:25:27Z"
  },
  {
    "title": "South Africa's President Could Use Golf Stars to Woo Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSouth African President Cyril Ramaphosa is set to take South African golfers Ernie Els and Retief Goosen with him to his meeting with President Donald Trump.\nRamaphosa will visit Trump, an avid golfer, at the …",
    "link": "https://biztoc.com/x/edc31ed550af3e37",
    "timestamp": "2025-05-21T14:24:13Z"
  },
  {
    "title": "Laura Loomer Says People Are Trying to Turn Trump Against Her",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFar-right media personality Laura Loomer has said there is a \"coordinated effort taking place to try to turn President Donald Trump against\" her.\nWhy It Matters\nLoomer, a dedicated supporter of Trump, has at t…",
    "link": "https://biztoc.com/x/1c56b60308106939",
    "timestamp": "2025-05-21T14:24:02Z"
  },
  {
    "title": "House Dem Scorches ‘Unbelievably Cynical’ GOP Move As ‘Why People Hate Washington’",
    "description": "Rep. Jim McGovern (D-Mass.) was wide awake during Wednesday's 1 a.m. hearing to scold Republican supporters of the president's exorbitant tax-cut package.",
    "link": "https://www.huffpost.com/entry/jim-mcgovern-scorches-cynical-gop-move-hate-washington_n_682da4ade4b0c95f733600f1",
    "timestamp": "2025-05-21T14:23:58Z"
  },
  {
    "title": "EU Prepares Trade Proposal for US to Steer Momentum Into Talks",
    "description": "The European Union was expected to share a revised trade proposal with the US, as it aims to inject momentum in talks with President Donald Trump’s administration amid lingering skepticism that a transatlantic deal can be reached.",
    "link": "https://financialpost.com/pmn/business-pmn/eu-prepares-trade-proposal-for-us-to-steer-momentum-into-talks",
    "timestamp": "2025-05-21T14:23:23Z"
  },
  {
    "title": "Laura Loomer Says People Are Trying to Turn Trump Against Her",
    "description": "The right-wing media personality has said people are \"lying\" about her \"attacking\" Trump.",
    "link": "https://www.newsweek.com/laura-loomer-donald-trump-turn-people-against-her-2075139",
    "timestamp": "2025-05-21T14:23:20Z"
  },
  {
    "title": "Elon Musk Says Tesla Robotaxi Service Is Starting Next Month, But It'll Be Extremely Limited",
    "description": "Today, we're looking at Elon Musk says robotaxis are starting in Austin, Texas next month, EV charger installation is drastically down thanks to Trump.",
    "link": "https://www.jalopnik.com/1865786/elon-musk-tesla-robotaxi-starts-next-month/",
    "timestamp": "2025-05-21T14:21:33Z"
  },
  {
    "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
    "description": "Target’s challenge to revive sales and its status as a cheap chic retailer just got more complicated.",
    "link": "https://www.bostonherald.com/2025/05/21/target-sales-drop-tariffs-impact/",
    "timestamp": "2025-05-21T14:21:32Z"
  },
  {
    "title": "Pete Hegseth Orders 'Comprehensive Review' of Biden Afghanistan Debacle",
    "description": "Secretary of State Pete Hegseth on Tuesday that he would order the Pentagon to engage in a \"comprehensive review\" of former President Joe Biden's abrupt withdrawal from Afghanistan – with a particular focus on the failures that led to a suicide bombing at Kab…",
    "link": "https://www.breitbart.com/asia/2025/05/21/pete-hegseth-orders-comprehensive-review-of-biden-afghanistan-debacle/",
    "timestamp": "2025-05-21T14:20:24Z"
  },
  {
    "title": "Why was St-Pierre-Miquelon targeted by both Donald Trump and a French politician?",
    "description": "Recent events have cast an unexpected spotlight on the French territory St-Pierre-Miquelon and serve as a good reminder of the complex historical and geopolitical entanglements of these islands.",
    "link": "https://theconversation.com/why-was-st-pierre-miquelon-targeted-by-both-donald-trump-and-a-french-politician-256662",
    "timestamp": "2025-05-21T14:20:13Z"
  },
  {
    "title": "Two California Counties Battle Trump Administration Over Homelessness Funding",
    "description": "The Trump administration has moved to impose new conditions on the federal money.",
    "link": "https://www.kqed.org/news/12041080/two-california-counties-battle-trump-administration-over-homelessness-funding",
    "timestamp": "2025-05-21T14:19:59Z"
  },
  {
    "title": "South Africa's President Could Use Golf Stars to Woo Trump",
    "description": "South African President Cyril Ramaphosa will bring golfers Ernie Els and Retief Goosen to his meeting with Trump.",
    "link": "https://www.newsweek.com/donald-trump-cyril-ramaphosa-golfers-south-africa-enrie-els-2075232",
    "timestamp": "2025-05-21T14:19:01Z"
  },
  {
    "title": "Fyodor Lukyanov: Trump moves toward Moscow’s view on Ukraine talks",
    "description": "With Washington leaning toward bilateral diplomacy, Brussels risks becoming an irrelevant – and obstructive – actor Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617970-lukyanov-trump-russia-ukraine/",
    "timestamp": "2025-05-21T14:18:48Z"
  },
  {
    "title": "THE TWO FACES OF RUSSIA: Moscow Between Dialogue With the US and Maximalist Goals in Ukraine",
    "description": "We have been reporting on the two different mindsets in Russian society these days: on the one hand, there’s a real engagement from the Vladimir Putin Government to rebuild diplomatic and commercial ties with the US administration of Donald J. Trump – this is…",
    "link": "https://freerepublic.com/focus/f-news/4318264/posts",
    "timestamp": "2025-05-21T14:18:43Z"
  },
  {
    "title": "Target’s problems are escalating with continued sales decline",
    "description": "Target was already facing a very public revolt from some of its most loyal customers. Now it's warning about tariffs.",
    "link": "https://www.abc12.com/news/business/target-s-problems-are-escalating-with-continued-sales-decline/article_3da30915-eae4-5e75-bdc5-28ec0b55530e.html",
    "timestamp": "2025-05-21T14:18:09Z"
  },
  {
    "title": "House Republicans press ahead on Trump agenda bill with key issues up in the air",
    "description": "House Republican leaders are racing to drag a sweeping bill for President Donald Trump's agenda across the finish line even as some holdouts are dug in and key issues remain unresolved.",
    "link": "https://www.nbcnews.com/politics/congress/house-republicans-press-ahead-trump-agenda-bill-rcna208109",
    "timestamp": "2025-05-21T14:17:24Z"
  },
  {
    "title": "“He’s Just Going To Keep Coming Back For More”: Stephen Colbert Mocks Paramount’s Potential Settlement Of Donald Trump’s ’60 Minutes’ Lawsuit",
    "description": "Stephen Colbert addressed the possibility that Paramount Global will settle with Donald Trump over his $20 billion lawsuit against CBS News over the way that 60 Minutes edited an interview with Kamala Harris. On Thursday’s The Late Show, Colbert noted that AB…",
    "link": "http://deadline.com/2025/05/stephen-colbert-trump-cbs-60-minutes-lawsuit-1236407208/",
    "timestamp": "2025-05-21T14:17:08Z"
  },
  {
    "title": "The Meaning of the First Augustinian Pope",
    "description": "Pope Leo’s politics will be shaped less by his American nationality than his tradition of Catholic thought.",
    "link": "http://foreignpolicy.com/2025/05/21/pope-leo-augustinian-trump-vatican/",
    "timestamp": "2025-05-21T14:16:21Z"
  },
  {
    "title": "House GOP works to push through bill advancing Trump's agenda",
    "description": "House Republicans have worked through the night to move a megabill advancing President Donald Trump's legislative agenda through a key committee.",
    "link": "https://abcnews.go.com/Politics/house-gop-works-push-bill-advancing-trumps-agenda/story?id=122028665",
    "timestamp": "2025-05-21T14:16:20Z"
  },
  {
    "title": "GOP lawmaker snaps back at Trump after being to told to 'drop it' during tense meeting",
    "description": "Donald Trump's meeting with House Republicans in a basement room where the budget reconciliation bill is being hammered out did not go as smoothly as the president told reporters later in the day with House Speaker Mike Johnson (R-LA) at his side.After the me…",
    "link": "https://www.rawstory.com/gop-lawmaker-snaps-back-at-trump-after-being-to-told-to-drop-it-during-tense-meeting/",
    "timestamp": "2025-05-21T14:16:07Z"
  },
  {
    "title": "North America Energy Transition Report and the Leading Companies Driving Developments",
    "description": "Dublin, May 21, 2025 (GLOBE NEWSWIRE) -- The \"North America Energy Transition - Sector and Companies Driving Development\" report has been added to ResearchAndMarkets.com's offering.North American climate targets, CO2 emissions, Trump's recent tariffs, renewab…",
    "link": "https://www.globenewswire.com/news-release/2025/05/21/3085903/28124/en/North-America-Energy-Transition-Report-and-the-Leading-Companies-Driving-Developments.html",
    "timestamp": "2025-05-21T14:15:00Z"
  },
  {
    "title": "Gerry Connolly, a fiery Democrat and fixture of Virginia politics, dies after battling cancer: Key points",
    "description": "Democratic Rep. Gerry Connolly of Virginia died on Wednesday morning, according to a statement from his family. He was 75. Last month, Connolly announced that he would not seek reelection and would soon step down from his leadership position on the powerful H…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/gerry-connolly-a-fiery-democrat-and-fixture-of-virginia-politics-dies-after-battling-cancer-key-points/articleshow/121319470.cms",
    "timestamp": "2025-05-21T14:14:59Z"
  },
  {
    "title": "Why South Africa’s president could be walking into an Oval Office ‘buzzsaw’ - Politico",
    "description": "Why South Africa’s president could be walking into an Oval Office ‘buzzsaw’Politico Trump fast-tracked processing of White South African refugees. But not everyone wants to leaveCNN Trump hosts South African president at White House amid tensions: Live update…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177676221",
    "timestamp": "2025-05-21T14:13:37Z"
  },
  {
    "title": "Donald Trump Takes Swing at Bruce Springsteen in Golf Meme",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump has taken a swing at Bruce Springsteen with a golf meme, as their spat continues.\nThe U.S. President posted the clip on his Truth Social platform, showing him hitting a drive and then cutting to a…",
    "link": "https://biztoc.com/x/8fb58e2eac3de190",
    "timestamp": "2025-05-21T14:12:50Z"
  },
  {
    "title": "Donald Trump Gives Up on One of His Major Promises",
    "description": "The U.S. president says the onus is on Russia and Ukraine, not Washington, to end the war, according to a report.",
    "link": "https://biztoc.com/x/5be600a90db8cb8f",
    "timestamp": "2025-05-21T14:12:44Z"
  },
  {
    "title": "Canada in negotiations with the US to participate in Trump’s “Golden Dome” missile shield",
    "description": "The new defence system will include sensors and in-orbit interceptors to intercept missiles even from space launches or from the other side of the planet\nThe post Canada in negotiations with the US to participate in Trump’s “Golden Dome” missile shield appear…",
    "link": "https://en.protothema.gr/2025/05/21/canada-in-negotiations-with-the-us-to-participate-in-trumps-golden-dome-missile-shield/",
    "timestamp": "2025-05-21T14:11:51Z"
  },
  {
    "title": "Top Democrat Reveals the Sick Math of Republicans’ Budget Bill",
    "description": "Republicans are forcing through the president’s “big, beautiful” reconciliation bill despite opposition from within their party, and despite opposition from the American public.\r\nWhile debating the details of the Medicaid-slashing tax cuts late Tuesday, Democ…",
    "link": "https://newrepublic.com/post/195548/donald-trump-budget-bill-top-democrat-reveals-cuts",
    "timestamp": "2025-05-21T14:11:36Z"
  },
  {
    "title": "Unicoin Crypto Exchange Charged in $100 Million Fraud",
    "description": "Federal regulators charged cryptocurrency exchange Unicoin for defrauding investors. The Securities and Exchange Commission charged the company and three of its main executives for making false and misleading statements to its investors, according to a Tuesda…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/unicoin-crypto-exchange-charged-100-million-fraud/",
    "timestamp": "2025-05-21T14:10:52Z"
  },
  {
    "title": "Donald Trump Takes Swing at Bruce Springsteen in Golf Meme",
    "description": "US President continues spat with Springsteen, with meme showing Trump hitting the star with a golf ball.",
    "link": "https://www.newsweek.com/donald-trump-takes-swing-bruce-springsteen-golf-meme-2075251",
    "timestamp": "2025-05-21T14:10:33Z"
  },
  {
    "title": "Dems warn House Republicans will pay price at ballot box for passing Trump's 'big beautiful bill'",
    "description": "President Donald Trump's bill faces backlash over Medicaid cuts, with Democrats highlighting risks to healthcare. Republicans defend reforms as midterm elections approach.",
    "link": "https://www.foxnews.com/politics/democrats-warn-house-republicans-pay-price-ballot-box-passing-trumps-big-budget",
    "timestamp": "2025-05-21T14:09:48Z"
  },
  {
    "title": "‘He Was a Zombie!’ Bill O’Reilly and Chris Cuomo Throw Down in Heated Biden Decline Debate",
    "description": "Chris Cuomo and Bill O'Reilly threw down in a heated debate as Cuomo dismissed accusations of a \"coverup\" in former President Joe Biden's administration.\nThe post ‘He Was a Zombie!’ Bill O’Reilly and Chris Cuomo Throw Down in Heated Biden Decline Debate first…",
    "link": "https://www.mediaite.com/media/tv/he-was-a-zombie-bill-oreilly-and-chris-cuomo-throw-down-in-heated-biden-decline-debate/",
    "timestamp": "2025-05-21T14:09:27Z"
  },
  {
    "title": "Mark Cuban makes dire prediction, says consumers could see empty shelves, higher costs, and rising inflation as a result of Trump's tariffs",
    "description": "Mark Cuban warned that U.S. tariffs could raise prices and cause inflation. Big companies like Sony and Walmart may raise prices too.",
    "link": "https://economictimes.indiatimes.com/news/international/us/mark-cuban-makes-dire-prediction-says-consumers-could-see-empty-shelves-higher-costs-and-rising-inflation-as-a-result-of-trumps-tariffs/articleshow/121319007.cms",
    "timestamp": "2025-05-21T14:06:45Z"
  },
  {
    "title": "Trump helps Gulf states become AI powers amid looming China fears",
    "description": "Donald Trump's recent visit to the Middle East was defined by a flurry of artificial intelligence investment deals involving Saudi Arabia and the UAE. Critics say it could help China gain access to critical technology.",
    "link": "https://www.dw.com/en/trump-helps-gulf-states-become-ai-powers-amid-looming-china-fears/a-72616663",
    "timestamp": "2025-05-21T14:06:00Z"
  },
  {
    "title": "Trump helps Gulf states become AI powers amid China fears",
    "description": "Donald Trump's recent visit to the Middle East was defined by a flurry of artificial intelligence investment deals involving Saudi Arabia and the UAE. Critics say it could help China gain access to critical technology.",
    "link": "https://www.dw.com/en/gulf-states-trump-china-artificial-intelligence-chatgpt-semiconductors-big-tech/a-72616663",
    "timestamp": "2025-05-21T14:06:00Z"
  },
  {
    "title": "Donald Trump Gives Up on One of His Major Promises",
    "description": "The U.S. president says the onus is on Russia and Ukraine, not Washington, to end the war, according to a report.",
    "link": "https://www.newsweek.com/russia-ukraine-trump-putin-zelensky-promises-2075085",
    "timestamp": "2025-05-21T14:04:48Z"
  },
  {
    "title": "SEC charges Unicoin and executives with $100 million fraud: Report",
    "description": "The US Securities and Exchange Commission has charged New York-based Unicoin Inc. and its executives with orchestrating a $100 million fraud.",
    "link": "https://www.livemint.com/companies/news/sec-charges-unicoin-and-executives-with-100-million-fraud-report-11747836060214.html",
    "timestamp": "2025-05-21T14:04:00Z"
  },
  {
    "title": "Begala: Democrats’ Credibility Isn’t Hurt at All by Biden Decline, They Were ‘Hoping That He Was Doing Fine’",
    "description": "On Tuesday’s broadcast of NPR’s “All Things Considered,” CNN Contributor and Democratic strategist Paul Begala said that the revelations about then-President Joe Biden’s mental fitness don’t impact the credibility of the Democratic Party at all and “I don’t t…",
    "link": "https://freerepublic.com/focus/f-chat/4318262/posts",
    "timestamp": "2025-05-21T14:02:25Z"
  },
  {
    "title": "Why Donald Trump Including Cardano In The Crypto Reserve Suprised Even The Founder: 'Nice To See Progress'",
    "description": "Cardano founder Charles Hoskinson said he was blindsided by former U.S. President Donald Trump's decision to include (CRYPTO: ADA) in his personal crypto holdings, calling the endorsement a \"pleasant surprise\" that signals Washington's changing stance on digi…",
    "link": "https://biztoc.com/x/6ebce62b0dd1d987",
    "timestamp": "2025-05-21T14:01:21Z"
  },
  {
    "title": "I’m Challenging The Most Endangered US Senator For His Seat — And I Will Win",
    "description": "America is at a crossroads: Will we cave to the radical left’s vision for our nation...or do we stand with President Trump in his mission to Make America Great Again through America First policies?",
    "link": "https://dailycaller.com/2025/05/21/buddy-carter-georgia-election-senate-race-jon-ossoff/",
    "timestamp": "2025-05-21T14:01:21Z"
  },
  {
    "title": "Donald Trump issued chilling warning to rest of the world as he announced $175 billion Golden Dome",
    "description": "The US has sent a simple message out to nations across the world ahead of their Golden Dome project",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-golden-dome-missile-system-worldwide-warning-751512-20250521",
    "timestamp": "2025-05-21T14:00:55Z"
  },
  {
    "title": "Trump ambushes South African president in Oval Office with claims of 'white persecution': live updates",
    "description": "President Ramaphosa pushes back against discredited claims from the US president that white South Africans are facing \"genocide\".",
    "link": "https://www.bbc.com/news/live/cpqe7rp388vt",
    "timestamp": "2025-05-21T14:00:17Z"
  },
  {
    "title": "Live Around the Planet: Wednesday May 21st",
    "description": "UPPESTDATE! If you missed today's edition of Mark's Clubland Q&A live around the planet, the action replay can be heard in full here. UPPERDATE! We're live now, so let's have at it! UPDATE! We'll be going live in about fifteen minutes, so do get ready",
    "link": "https://www.steynonline.com/15329/live-around-the-planet-wednesday-may-21st",
    "timestamp": "2025-05-21T14:00:00Z"
  },
  {
    "title": "Jimmy Kimmel Jokes ‘It’s About Time’ Trump Made Gun Suppressors More Affordable: ‘No Gun Violence If We Can’t Hear the Shots!’ | Video",
    "description": "\"One thing I think we can all agree on is that the gun violence in this country is too loud,\" the ABC host jokes\nThe post Jimmy Kimmel Jokes ‘It’s About Time’ Trump Made Gun Suppressors More Affordable: ‘No Gun Violence If We Can’t Hear the Shots!’ | Video ap…",
    "link": "https://www.thewrap.com/trump-spending-bill-gun-suppressors-affordable-jimmy-kimmel-reaction/",
    "timestamp": "2025-05-21T13:58:52Z"
  },
  {
    "title": "After divorce from Ben Affleck and possible testimony in Diddy case, Jennifer Lopez is sued in copyright infringement case; here's what she did",
    "description": "Jennifer Lopez faces a lawsuit from photographer Edwin Blanco and Backgrid USA for copyright infringement. The images, taken at a pre-Golden Globes event, reportedly promoted fashion brands. The plaintiffs seek damages and a jury trial, claiming Lopez used th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-divorce-from-ben-affleck-and-possible-testimony-in-diddy-case-jennifer-lopez-is-sued-in-copyright-infringement-case-heres-what-she-did/articleshow/121319212.cms",
    "timestamp": "2025-05-21T13:57:52Z"
  },
  {
    "title": "Trump Effect: U.S. Senate Unanimously Approves ‘No Tax on Tips’ Bill",
    "description": "Hard working Americans can now keep more of the money they earn thanks to the No Tax on Tips Act as passed Tuesday by the U.S. Senate.\nThe post Trump Effect: U.S. Senate Unanimously Approves ‘No Tax on Tips’ Bill appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/21/trump-effect-u-s-senate-unanimously-approves-no-tax-on-tips-bill/",
    "timestamp": "2025-05-21T13:57:30Z"
  },
  {
    "title": "The little-known group poised to take over Gaza’s aid",
    "description": "US and Israel-backed plan to hand control to the Gaza Humanitarian Foundation has provoked fierce criticism",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/21/the-little-known-group-poised-to-take-over-gazas-aid/",
    "timestamp": "2025-05-21T13:57:28Z"
  },
  {
    "title": "Rising Seas From Fossil Fuels Threaten Inland Migration ‘Never Witnessed in Modern Civilization’",
    "description": "A new study in Nature looks at one of the baked-in effects from just our current level of temperature increases: mass migration.",
    "link": "https://www.nakedcapitalism.com/2025/05/rising-seas-from-fossil-fuels-threaten-inland-migration-never-witnessed-in-modern-civilization.html",
    "timestamp": "2025-05-21T13:55:53Z"
  },
  {
    "title": "Trump Administration Allows NY Offshore Wind Project to Resume",
    "description": "The Interior Department retracted a stop order against Empire Wind, allowing Equinor to resume construction of the project's first phase, which is expected to power 500,000 homes in New York.",
    "link": "https://www.rigzone.com/news/trump_administration_allows_ny_offshore_wind_project_to_resume-21-may-2025-180597-article/",
    "timestamp": "2025-05-21T13:55:20Z"
  },
  {
    "title": "Five Reasons Trump Should Dump Ukraine and Normalize With Russia",
    "description": "Trump is trying to strike a Russia-Ukraine peace deal. But if it doesn’t work out, he’d better just dump Ukraine and normalize ties with Russia.",
    "link": "https://sputnikglobe.com/20250521/five-reasons-trump-should-dump-ukraine-and-normalize-with-russia-1122103259.html",
    "timestamp": "2025-05-21T13:54:24Z"
  },
  {
    "title": "Bruce Springsteen Releases New Anti-Trump EP",
    "description": "The Land of Hope and Dreams EP contains live tracks and recordings of Springsteen's speeches against the president.\nBruce Springsteen Releases New Anti-Trump EP\nScoop Harrison",
    "link": "https://consequence.net/2025/05/bruce-springsteen-land-of-hope-and-dreams-ep/",
    "timestamp": "2025-05-21T13:54:00Z"
  },
  {
    "title": "China accuses US of 'turning space into a warzone' with Trump's Golden Dome missile defense project",
    "description": "President Donald Trump's Golden Dome missile defense system faces backlash from China, which has cited concerns over space militarization and urges the U.S. to halt its development.",
    "link": "https://www.foxnews.com/politics/china-accuses-us-turning-space-warzone-trumps-golden-dome-missile-defense-project",
    "timestamp": "2025-05-21T13:53:35Z"
  },
  {
    "title": "Don Trump Jr. hints at run for president after dad steps down: 'That calling is there'",
    "description": "Donald Trump Jr. hinted that he has an eye on the presidency after his father left office.At an event on Wednesday, Bloomberg's Joumanna Nasr Bercetche asked the president's son about a possible run for the presidency.\"After President Trump steps down, would …",
    "link": "https://www.rawstory.com/donald-trump-jr-for-president/",
    "timestamp": "2025-05-21T13:53:26Z"
  },
  {
    "title": "Trump Gets the Middle East Right",
    "description": "The U.S. president has correctly abandoned decades of tradition in the region.",
    "link": "http://foreignpolicy.com/2025/05/21/trump-speech-middle-east-saudi-arabia/",
    "timestamp": "2025-05-21T13:52:54Z"
  },
  {
    "title": "DOJ Investigating Cuomo for Allegedly Lying About COVID Nursing Home Deaths",
    "description": "Rep. Comer said \"that there was 'overwhelming evidence' that Cuomo, 67, presided over a July 6, 2020, audit that undercounted the total number of deaths in New York senior care facilities during the pandemic by 46%.\"\nThe post DOJ Investigating Cuomo for Alleg…",
    "link": "https://legalinsurrection.com/2025/05/doj-investigating-cuomo-for-allegedly-lying-about-covid-nursing-home-deaths/",
    "timestamp": "2025-05-21T13:52:16Z"
  },
  {
    "title": "'Worst Nightmare': Woman Responds After Trump Meeting Goes Viral",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAlexandria Diaz, the daughter of an American police officer killed in the line of duty, has spoken out after a clip of her meeting with President Donald Trump went viral online, saying that this is her \"worst …",
    "link": "https://biztoc.com/x/a664edf79ff606fc",
    "timestamp": "2025-05-21T13:50:43Z"
  },
  {
    "title": "Elon Musk Attending Trump, Ramaphosa Meeting at White House",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nElon Musk will attend the White House meeting between U.S. President Donald Trump and South African President Cyril Ramaphosa.\nMusk, who was born and raised in South Africa, was listed as part of the U.S. dele…",
    "link": "https://biztoc.com/x/5951b6b07eb1f2ff",
    "timestamp": "2025-05-21T13:50:28Z"
  },
  {
    "title": "'Trump Is An Ageist,' Says Anthony Scaramucci. He Claims Saudi Prince MBS Used Trump's Disregard For Younger People To Play Him",
    "description": "In the latest episode of “The Rest Is Politics US” podcast, Anthony Scaramucci shared his unfiltered view of Donald Trump's recent diplomatic push in the Middle East. \nAccording to the former White House communications director, Trump's foreign policy tour ma…",
    "link": "https://biztoc.com/x/924a683b258dafbe",
    "timestamp": "2025-05-21T13:50:21Z"
  },
  {
    "title": "WATCH LIVE: Education Secretary McMahon testifies on 2026 budget request in House hearing",
    "description": "Education Secretary Linda McMahon will testify Wednesday on the White House’s budget request for the agency that President Donald Trump has ordered to be dismantled.",
    "link": "https://biztoc.com/x/947014faf6931053",
    "timestamp": "2025-05-21T13:50:17Z"
  },
  {
    "title": "Spike Lee on the collision of his two passions, the Knicks and cinema, in Cannes",
    "description": "Some of Spike Lee’s most deeply felt passions — filmmaking and the New York Knicks — have collided at the Cannes Film Festival",
    "link": "https://abcnews.go.com/Entertainment/wireStory/spike-lee-collision-passions-knicks-cinema-cannes-122025600",
    "timestamp": "2025-05-21T13:50:17Z"
  },
  {
    "title": "The Off-Boarding of Elon Musk",
    "description": "How the tech billionaire came to Washington and turned potential allies into irritated foes",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/elon-musk-doge-opponents-dc/682866/",
    "timestamp": "2025-05-21T13:50:00Z"
  },
  {
    "title": "'Worst Nightmare': Woman Responds After Trump Meeting Goes Viral",
    "description": "Alexandria Diaz's neutral expression during a meeting with Trump has taken off online.",
    "link": "https://www.newsweek.com/alexandria-diaz-tiktok-video-trump-meeting-response-2075171",
    "timestamp": "2025-05-21T13:49:18Z"
  },
  {
    "title": "TikTok layoff watch: Read the cryptic memo telling staff to work from home",
    "description": "TikTok staffers are bracing for layoffs after the company said it's making \"organizational and personnel changes,\" in a memo to employees.",
    "link": "https://www.businessinsider.com/tiktok-layoff-watch-read-memo-to-shop-staff-2025-5",
    "timestamp": "2025-05-21T13:49:02Z"
  },
  {
    "title": "Gold soars over 3%—why is the gold price rallying, and could it surpass $3,350 resistance to ignite a powerful new bull run? here’s what the future look like",
    "description": "Gold price surge grabs headlines as tensions spike in the Middle East and US politics face major roadblocks. Trading near $3,310, gold is reacting to news that Israel may strike Iran’s nuclear sites, while Trump’s fiscal bill faces strong opposition in Congre…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-soars-over-3why-is-the-gold-price-rallying-and-could-it-surpass-3350-resistance-to-ignite-a-powerful-new-bull-run-heres-what-the-future-look-like/articleshow/121318754.cms",
    "timestamp": "2025-05-21T13:48:53Z"
  },
  {
    "title": "‘Empty Noise’: Alyssa Farah Griffin Dismisses Democrats’ Attacks on Trump’s ‘Big, Beautiful Bill’",
    "description": "Alyssa Farah Griffin dismissed Democrats' messaging strategy to tank Trump's \"Big, Beautiful Bill\" on CNN Wednesday morning.\nThe post ‘Empty Noise’: Alyssa Farah Griffin Dismisses Democrats’ Attacks on Trump’s ‘Big, Beautiful Bill’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/empty-noise-alyssa-farah-griffin-dismisses-democrats-attacks-on-trumps-big-beautiful-bill/",
    "timestamp": "2025-05-21T13:47:56Z"
  },
  {
    "title": "Elon Musk Attending Trump, Ramaphosa Meeting at White House",
    "description": "The billionaire CEO of Tesla and SpaceX has accused Ramaphosa's government of overseeing the persecution of white people.",
    "link": "https://www.newsweek.com/elon-musk-attending-trump-ramaphosa-meeting-white-house-2075234",
    "timestamp": "2025-05-21T13:46:28Z"
  },
  {
    "title": "'Trump Is An Ageist,' Says Anthony Scaramucci. He Claims Saudi Prince MBS Used Trump's Disregard For Younger People To Play Him",
    "description": "In the latest episode of “The Rest Is Politics US” podcast, Anthony Scaramucci shared his unfiltered view of Donald Trump's recent diplomatic push in the...",
    "link": "https://finance.yahoo.com/news/trump-ageist-says-anthony-scaramucci-134521625.html",
    "timestamp": "2025-05-21T13:45:21Z"
  },
  {
    "title": "WATCH LIVE: Education Secretary McMahon testifies on 2026 budget request in House hearing",
    "description": "Education Secretary Linda McMahon will testify Wednesday on the White House’s budget request for the agency that President Donald Trump has ordered to be dismantled.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-education-secretary-mcmahon-testifies-on-2026-budget-request-in-house-hearing",
    "timestamp": "2025-05-21T13:39:30Z"
  },
  {
    "title": "Chris Cuomo Says Jake Tapper’s ‘Original Sin’ Book Is Itself A Cover-Up For Something ‘Much More Serious’",
    "description": "Chris Cuomo said that \"Original Sin\" is a cover-up of the media’s political bias in favor of President Joe Biden over former President Donald Trump.",
    "link": "https://dailycaller.com/2025/05/21/chris-cuomo-jake-tappers-original-sin-book-cover-up/",
    "timestamp": "2025-05-21T13:38:47Z"
  },
  {
    "title": "Trump urges GOP to stop negotiating and pass spending bill",
    "description": "House Republicans are still battling over President Donald Trump’s massive multitrillion dollar tax and border bill, which is opposed by all Democrats. The legislation includes major boosts in funding for immigration enforcement and the military as well as ex…",
    "link": "https://biztoc.com/x/2ea2d18c49fed5a1",
    "timestamp": "2025-05-21T13:38:46Z"
  },
  {
    "title": "Republicans proposing nearly $1 trillion in cuts to Medicaid and food stamps. Will you be impacted?",
    "description": "House Republicans are proposing significant cuts to Medicaid and SNAP, totaling nearly $1 trillion, to advance President Trump's policy goals. These cuts could lead to millions of Americans losing access to critical benefits, shifting costs to states and pote…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/republicans-proposing-nearly-1-trillion-in-cuts-to-medicaid-and-food-stamps-will-you-be-impacted/articleshow/121318731.cms",
    "timestamp": "2025-05-21T13:38:10Z"
  },
  {
    "title": "A Letter to Bruce Springsteen from a Fan—You’re Out of Touch with Your NJ Neighbors and the Factory Workers You Care About",
    "description": "Dear Bruce, I’ve been a fan for as long as I can remember. From “Born to Run” to “The Rising,” from your orchestral country masterpiece... Read More\nThe post A Letter to Bruce Springsteen from a Fan—You’re Out of Touch with Your NJ Neighbors and the Factory W…",
    "link": "https://www.dailysignal.com/2025/05/21/a-letter-to-bruce-springsteen-from-a-fan-youre-out-of-touch-with-your-nj-neighbors-and-the-factory-workers-you-care-about/",
    "timestamp": "2025-05-21T13:37:59Z"
  },
  {
    "title": "Coinbase data breach impacted 69,461 individuals",
    "description": "Cryptocurrency exchange Coinbase announced that the recent data breach exposed data belonging to 69,461 individuals. Coinbase disclosed that a data breach impacted 69,461 individuals after overseas support staff improperly accessed customer and corporate data…",
    "link": "https://securityaffairs.com/178151/data-breach/coinbase-data-breach-impacted-69461-individuals.html",
    "timestamp": "2025-05-21T13:36:00Z"
  },
  {
    "title": "‘I Was Obviously Wrong!’ Joe Scarborough Admits to Jake Tapper His Biden ‘At His Best’ Remark Was a Mistake",
    "description": "Joe Scarborough admitted to Jake Tapper he was \"obviously wrong\" about his \"Biden at his Best\" comment in April of 2024 during a spirited Morning Joe segment.\nThe post ‘I Was Obviously Wrong!’ Joe Scarborough Admits to Jake Tapper His Biden ‘At His Best’ Rema…",
    "link": "https://www.mediaite.com/media/tv/i-was-obviously-wrong-joe-scarborough-admits-to-jake-tapper-his-biden-at-his-best-remark-was-a-mistake/",
    "timestamp": "2025-05-21T13:35:50Z"
  },
  {
    "title": "Trump’s ‘Golden Dome’ missile defense plan was inspired by Israel’s multitiered defenses",
    "description": "Israeli leaders say the system isn’t 100% guaranteed, but credit it with preventing serious damage and countless casualties.",
    "link": "https://www.bostonherald.com/2025/05/21/trump-golden-dome-israeli-inspiration/",
    "timestamp": "2025-05-21T13:35:38Z"
  },
  {
    "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
    "description": "Sales at Target fell more than expected in the first quarter, and the retailer warned they will slip for all of 2025 year as its customers, worried over the impact of tariffs and the economy, pull …",
    "link": "https://www.twincities.com/2025/05/21/target-sales-drop-in-1st-quarter-and-retailer-warns-they-will-slip-for-all-of-2025/",
    "timestamp": "2025-05-21T13:33:21Z"
  },
  {
    "title": "Positive signals after two-hour Trump-Putin call?",
    "description": "Not wanting to involve itself indefinitely in a ‘European situation’, the US is keen on a quick end to the Russia-Ukraine conflict",
    "link": "https://www.thehindubusinessline.com/opinion/positive-signals-after-two-hour-trump-putin-call/article69602097.ece",
    "timestamp": "2025-05-21T13:32:38Z"
  },
  {
    "title": "An End to Tax on Tips",
    "description": "Passed the Senate: Yesterday, the Senate passed the No Tax on Tips Act 100–0, which \"creates a federal income tax deduction of up to $25,000 a year for",
    "link": "https://reason.com/2025/05/21/an-end-to-tax-on-tips/",
    "timestamp": "2025-05-21T13:30:10Z"
  },
  {
    "title": "Eagles’ Jalen Hurts Speaks After Skipping Super Bowl Celebration At Trump’s White House",
    "description": "Recently, the Philadelphia Eagles paid a visit to the White House to celebrate their Super Bowl LIX championship with President Donald Trump.",
    "link": "https://dailycaller.com/2025/05/21/philadelphia-eagles-jalen-hurts-super-bowl-trump-white-house/",
    "timestamp": "2025-05-21T13:29:58Z"
  },
  {
    "title": "What is the Golden Dome defence system Trump announced?",
    "description": "The $175bn ambitious space proposal aims to counter aerial threats but China says it would prompt an arms race.",
    "link": "https://www.aljazeera.com/news/2025/5/21/what-is-the-golden-dome-defence-system-trump-announced",
    "timestamp": "2025-05-21T13:27:22Z"
  },
  {
    "title": "Factcheck: Why expensive gas – not net-zero – is keeping UK electricity prices so high",
    "description": "The UK’s high electricity prices have become intensely political, with competing claims over the cause of rocketing bills and how best to get them down.",
    "link": "https://www.resilience.org/stories/2025-05-21/factcheck-why-expensive-gas-not-net-zero-is-keeping-uk-electricity-prices-so-high/",
    "timestamp": "2025-05-21T13:27:18Z"
  },
  {
    "title": "TikTok’s US Ecommerce Employees Told to Work From Home as Layoff Fears Grow",
    "description": "Employees are awaiting “difficult decisions” being made by TikTok.",
    "link": "https://www.adweek.com/commerce/tiktoks-us-ecommerce-employees-told-to-work-from-home-as-layoff-fears-grow/",
    "timestamp": "2025-05-21T13:26:53Z"
  },
  {
    "title": "What is the 'No Tax on Tips Act'? Here's how the new bill could impact workers and businesses",
    "description": "The U.S. Senate has passed the &quot;No Tax on Tips Act,&quot; a cornerstone of President Donald Trump&apos;s economic agenda, with rare bipartisan unity. In a unanimous 100-0 vote",
    "link": "https://www.marca.com/en/lifestyle/us-news/personal-finance/2025/05/21/682d93cbe2704e2c228b461f.html",
    "timestamp": "2025-05-21T13:26:43Z"
  },
  {
    "title": "Bitcoin closes above $106k for first time and without retail frenzy",
    "description": "Bitcoin closed above $106,000 for the first time in its history on May 20, according to CryptoSlate’s data. The milestone followed several failed attempts earlier in the year, when that price level acted as strong resistance. This time, however, the rally pus…",
    "link": "https://cryptoslate.com/insights/bitcoin-closes-above-106k-for-first-time-without-retail-frenzy/",
    "timestamp": "2025-05-21T13:26:09Z"
  }
]