[
  {
    "title": "Americans are being conditioned to accept 'violence beyond anything imagined': experts",
    "description": "The increasingly hostile political climate is showing no signs of abating, and some political scientists are worried about what that could mean for Americans in the near future.That's according to a Tuesday essay by the New York Times' Thomas B. Edsall, who s…",
    "link": "https://www.rawstory.com/extremism-2674000905/",
    "timestamp": "2025-09-17T01:18:18Z"
  },
  {
    "title": "Images of Trump and Jeffrey Epstein projected on Windsor Castle as U.S. president visits the UK (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nImages of Trump and Jeffrey Epstein projected on Windsor Castle as U.S. president visits the UK … Four people were arrested Tuesday night in the United Kingdom in connection with the projection of an image onto Windsor Castle showing Presid…",
    "link": "https://www.memeorandum.com/250916/p162",
    "timestamp": "2025-09-17T01:15:03Z"
  },
  {
    "title": "CNBC Daily Open: Nearly everything slows down the day before the Fed meeting",
    "description": "A 25 basis point cut is almost certain. A 50 point slash is unlikely, unless the \"outies\" of some Fed officials overpower their independent \"innies.\"",
    "link": "https://www.cnbc.com/2025/09/17/cnbc-daily-open-nearly-everything-slows-down-the-day-before-the-fed-meeting.html",
    "timestamp": "2025-09-17T01:13:52Z"
  },
  {
    "title": "FBI chief Kash Patel spars with Democrats in heated Senate hearing",
    "description": "Patel has been lambasted from both the right and the left since being named by Trump to head the Federal Bureau of Investigation.",
    "link": "https://www.channelnewsasia.com/world/fbi-chief-kash-patel-senate-hearing-democrats-5353176",
    "timestamp": "2025-09-17T01:13:00Z"
  },
  {
    "title": "Trump's 'dangerous' move alarms national security expert: 'Classic authoritarian playbook'",
    "description": "The Trump administration's \"dangerous\" tactics armed one analyst on Tuesday. Ben Rhodes, the former deputy national security advisor during the Obama administration, discussed the administration's new stance on free speech during a new episode of the podcast …",
    "link": "https://www.rawstory.com/trump-2674000853/",
    "timestamp": "2025-09-17T01:10:00Z"
  },
  {
    "title": "Charlie Kirk Shooting Suspect Faces Murder Charge In Utah Court",
    "description": "The suspect in the assassination of political commentator Charlie Kirk made his first appearance in a Utah court after being charged with murder in a case that’s galvanized President Donald Trump and his allies over what they see as rampant political violence…",
    "link": "https://www.ndtvprofit.com/world/charlie-kirk-shooting-suspect-faces-murder-charge-in-utah-court",
    "timestamp": "2025-09-17T01:07:33Z"
  },
  {
    "title": "MAGA has its martyr in Charlie Kirk. Here’s exactly how Trump could use it to seize ultimate power",
    "description": "In the murder of right-wing figure Charlie Kirk, Donald Trump's MAGA movement has its martyr. There's now just a few steps between him and the seizing of American democracy.\nThe post MAGA has its martyr in Charlie Kirk. Here’s exactly how Trump could use it t…",
    "link": "http://www.crikey.com.au/2025/09/17/donald-trump-charlie-kirk-maga-martyr-power/",
    "timestamp": "2025-09-17T01:07:24Z"
  },
  {
    "title": "MAGA has its martyr in Charlie Kirk. Here’s how Trump could capitalise on it to seize ultimate power",
    "description": "There are only a few steps left for the US president to dismantle American democracy.\nThe post MAGA has its martyr in Charlie Kirk. Here’s how Trump could capitalise on it to seize ultimate power appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/09/17/charlie-kirk-death-donald-trump-maga-martyr-america-united-states-tyler-robinson/",
    "timestamp": "2025-09-17T01:07:24Z"
  },
  {
    "title": "Security analysts flag rise in Russian-created misinformation posts on social media following Kirk shooting",
    "description": "Security analysts flag rise in Russian-created misinformation posts on social media following Kirk shootinggo.com",
    "link": "https://abcnews.go.com/Politics/security-analysts-flag-rise-russian-created-misinformation-posts/story?id=125640078",
    "timestamp": "2025-09-17T01:05:06Z"
  },
  {
    "title": "A brief history of Bella Ciao, the anti-fascist Italian song cited in the Charlie Kirk shooting",
    "description": "Bella Ciao is a traditional Italian folk song known for its association with the anti-fascist resistance in Italy during the second world war.",
    "link": "https://theconversation.com/a-brief-history-of-bella-ciao-the-anti-fascist-italian-song-cited-in-the-charlie-kirk-shooting-265277",
    "timestamp": "2025-09-17T01:04:50Z"
  },
  {
    "title": "Stacey Abrams says Trump administration is using Kirk assassination to advance 'authoritarian rule'",
    "description": "Stacey Abrams claimed that the Trump administration is using the assassination of TPUSA founder Charlie Kirk as an \"excuse\" to \"advance authoritarian rule\" on CNN Tuesday.",
    "link": "https://www.foxnews.com/media/stacey-abrams-says-trump-administration-using-kirk-assassination-advance-authoritarian-rule",
    "timestamp": "2025-09-17T01:00:26Z"
  },
  {
    "title": "Leftist Commentator ‘Destiny’: If You Wanted Charlie Kirk Alive, You Shouldn’t Have Elected Trump",
    "description": "Like Democrats, Destiny also has a long, documented history of encouraging and even celebrating political violence against conservatives.A leftist commentator known for celebrating political violence against Christians and conservatives suggested on-air this …",
    "link": "https://freerepublic.com/focus/f-news/4340940/posts",
    "timestamp": "2025-09-17T00:58:44Z"
  },
  {
    "title": "DOJ sues Maine and Oregon for voter rolls | CNN Politics",
    "description": "The Justice Department said Tuesday that is suing two states over their refusal to turn over complete voters rolls to the Trump administration – in an escalation of a conflict between the federal government and some state election officials that has been buil…",
    "link": "https://www.cnn.com/2025/09/16/politics/department-of-justice-sues-maine-and-oregon-for-voter-rolls",
    "timestamp": "2025-09-17T00:57:29Z"
  },
  {
    "title": "DOJ Quietly Deletes Study After Charlie Kirk's Death That Says Right-Wing Extremists Engage in 'Far More' Political Violence",
    "description": "\"Far-right extremists have committed far more ideologically motivated homicides than far-left or radical Islamist extremists,\" an archived version of the...",
    "link": "https://people.com/department-of-justice-quietly-deletes-study-after-charlie-kirk-death-that-says-right-wing-extremists-engage-in-far-more-political-violence-11811580",
    "timestamp": "2025-09-17T00:56:26Z"
  },
  {
    "title": "Under U.S. pressure, Syria and Israel inch toward security deal",
    "description": "Washington is pushing for enough progress to be made by the time of the U.N. General Assembly at the end of this month to allow President Donald Trump to announce a breakthrough.",
    "link": "https://www.japantimes.co.jp/news/2025/09/17/world/politics/us-pressure-syria-israel-deal/",
    "timestamp": "2025-09-17T00:56:00Z"
  },
  {
    "title": "South Korea Foreign Minister says to discuss Xi's APEC attendance during China visit",
    "description": "SEOUL (Reuters) -South Korean Foreign Minister Cho Hyun said on Wednesday he will be discussing Chinese President Xi Jinping's attendance at the summit of...",
    "link": "https://www.yahoo.com/news/articles/south-korea-foreign-minister-says-005010077.html",
    "timestamp": "2025-09-17T00:50:10Z"
  },
  {
    "title": "Raw emotion rages on Capitol Hill as lawmakers grapple with Charlie Kirk's killing",
    "description": "Nearly a week after Charlie Kirk's assassination, many Republican members of Congress are publicly grieving and casting blame on Democrats and the media.",
    "link": "https://www.nbcnews.com/politics/congress/raw-emotion-rages-capitol-hill-lawmakers-grapple-charlie-kirks-killing-rcna231666",
    "timestamp": "2025-09-17T00:48:32Z"
  },
  {
    "title": "Susan Monarez, former CDC director, to testify before Senate about her ouster and RFK Jr.",
    "description": "Susan Monarez, former CDC director, to testify before Senate about her ouster and RFK Jr.go.com",
    "link": "https://abcnews.go.com/Politics/susan-monarez-former-cdc-director-testify-senate-ouster/story?id=125628812",
    "timestamp": "2025-09-17T00:48:13Z"
  },
  {
    "title": "DOJ Deletes Study Documenting Frequency Of Far-Right Violence: Report",
    "description": "“The number of far-right attacks continues to outpace all other types of terrorism and domestic violent extremism,” the study reads.",
    "link": "https://www.huffpost.com/entry/justice-department-study-far-right-violence_n_68c9e82fe4b0e64fe309e223",
    "timestamp": "2025-09-17T00:47:42Z"
  },
  {
    "title": "China says US TikTok deal a 'win-win', will review app's technology and IP transfers",
    "description": "BEIJING (Reuters) -China on Wednesday called the framework deal reached in Madrid to switch short-video app TikTok to U.S.-controlled ownership a \"win-win...",
    "link": "https://tech.yahoo.com/social-media/articles/china-says-us-tiktok-deal-004021475.html",
    "timestamp": "2025-09-17T00:40:21Z"
  },
  {
    "title": "Kathmandu’s Gen Z protests: A tale of peaceful uprising, vicious fire and interference",
    "description": "By Dr Upendra Gautam The quiet streets of Kathmandu on 7 September 2025 witnessed something remarkable. A new generation—Gen Z—rose […]\nThe post Kathmandu’s Gen Z protests: A tale of peaceful uprising, vicious fire and interference appeared first on Peoples' …",
    "link": "https://mypeoplesreview.com/2025/09/17/kathmandus-gen-z-protests-a-tale-of-peaceful-uprising-vicious-fire-and-interference/",
    "timestamp": "2025-09-17T00:39:54Z"
  },
  {
    "title": "Four arrested after Trump, Epstein images projected onto Britain's Windsor Castle",
    "description": "Four people were arrested on Tuesday following a projection of images of Donald Trump alongside sex offender Jeffrey Epstein onto the royal Windsor Castle, where the U.S. President is set to be hosted by King Charles during his state visit to Britain. Trump a…",
    "link": "https://japantoday.com/category/world/four-arrested-after-trump-epstein-images-projected-onto-britain%27s-windsor-castle",
    "timestamp": "2025-09-17T00:38:52Z"
  },
  {
    "title": "Posobiec: Popular Leftwing Streamers Calling for More Violence Right Now",
    "description": "On Tuesday’s “Alex Marlow Show,” Human Events Senior Editor Jack Posobiec talked about the streamer Destiny. Posobiec stated that at first, from Destiny, “there was no support for violence, but I think he took this turn after Butler. And I\nThe post Posobiec: …",
    "link": "https://www.breitbart.com/clips/2025/09/16/posobiec-popular-leftwing-streamers-calling-for-more-violence-right-now/",
    "timestamp": "2025-09-17T00:37:19Z"
  },
  {
    "title": "Trumpworld Turns On Pam Bondi Over Talk Of 'Hate Speech' Crackdown",
    "description": "Bondi found herself in hot water after seeming to say she wanted the Department of Justice to disregard the First Amendment.",
    "link": "https://www.huffpost.com/entry/pam-bondi-hate-speech-backlash_n_68c99defe4b0bf99dd25608b",
    "timestamp": "2025-09-17T00:36:42Z"
  },
  {
    "title": "Japan’s exports fall for fourth month as U.S. shipments tumble",
    "description": "Exports slipped 0.1% in August from a year earlier, led by cars and steel, the Finance Ministry reported Wednesday.",
    "link": "https://www.japantimes.co.jp/business/2025/09/17/economy/japan-august-exports-fall/",
    "timestamp": "2025-09-17T00:33:00Z"
  },
  {
    "title": "Eric Trump Announces American Bitcoin Launch, Lauds BTC As 'Modern-Day Gold'",
    "description": "Eric Trump, co-founder and chief strategy officer at American Bitcoin Corp. (NASDAQ:ABTC) has lauded blockchain adoption as the future of traditional finance...",
    "link": "https://finance.yahoo.com/news/eric-trump-announces-american-bitcoin-003112111.html",
    "timestamp": "2025-09-17T00:31:12Z"
  },
  {
    "title": "Trump's public shrug over drone incursion in Poland fuels unease in Europe",
    "description": "Many NATO members already question U.S. President Donald Trump's commitment to their defense in the event of an actual Russian attack.",
    "link": "https://www.japantimes.co.jp/news/2025/09/17/world/politics/trump-drone-poland-europe/",
    "timestamp": "2025-09-17T00:23:00Z"
  },
  {
    "title": "Trump, Melania Arrive in London for UK State Visit",
    "description": "President Donald Trump and First Lady Melania Trump arrived in the United Kingdom Tuesday for a two-day state visit that aims to show the trans-Atlantic bond remains strong, despite differences over Ukraine, the Middle East and the future of the Western allia…",
    "link": "https://biztoc.com/x/ffec782e00e7aa72",
    "timestamp": "2025-09-17T00:20:14Z"
  },
  {
    "title": "Images of Trump and Jeffrey Epstein projected on Windsor Castle as U.S. president visits the UK",
    "description": "President Donald Trump for months has faced criticism over a decision by the Justice Department not to release law enforcement files about Jeffrey Epstein.",
    "link": "https://biztoc.com/x/6ab2645b18de9159",
    "timestamp": "2025-09-17T00:19:55Z"
  },
  {
    "title": "Images of Trump and Jeffrey Epstein projected on Windsor Castle as U.S. president visits the UK",
    "description": "President Donald Trump for months has faced criticism over a decision by the Justice Department not to release law enforcement files about Jeffrey Epstein.",
    "link": "https://www.cnbc.com/2025/09/16/trump-jeffrey-epstein-windsor-castle-us-uk.html",
    "timestamp": "2025-09-17T00:18:18Z"
  },
  {
    "title": "Amanda Seyfried under fire for calling Charlie Kirk ‘hateful’ after his murder",
    "description": "Amanda Seyfried is facing backlash for being critical of Charlie Kirk following his shocking murder. The actress, 39, called him “hateful” in response to an Instagram post Sunday. The post highlighted controversial statements Kirk made about abortion, immigra…",
    "link": "https://freerepublic.com/focus/f-news/4340933/posts",
    "timestamp": "2025-09-17T00:15:37Z"
  },
  {
    "title": "Justice Department says it's suing Oregon and Maine as it seeks voter data in multiple states",
    "description": "The Justice Department says it has sued Oregon and Maine for failing to provide their voter registration lists",
    "link": "https://abcnews.go.com/Politics/wireStory/justice-department-suing-oregon-maine-seeks-voter-data-125644979",
    "timestamp": "2025-09-17T00:14:17Z"
  },
  {
    "title": "Trump DOJ scrubs report naming far-right extremists as top domestic terror threat",
    "description": "President Donald Trump's Justice Department has quietly removed a study that found white supremacist and far-right violence are the leading types of terrorism and domestic violent extremism in the United States, according to a report.The report said \"militant…",
    "link": "https://www.rawstory.com/trump-terrorism-2674000815/",
    "timestamp": "2025-09-17T00:13:43Z"
  },
  {
    "title": "Always partisan, the Supreme Court has contorted itself into the shape dictated by Donald Trump",
    "description": "The Supreme Court is not just supine in the face of political attacks. It positively endorses them. \nThe post Always partisan, the Supreme Court has contorted itself into the shape dictated by Donald Trump appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/09/17/us-supreme-court-partisan-donald-trump/",
    "timestamp": "2025-09-17T00:12:32Z"
  },
  {
    "title": "UK to strengthen ties with US on crypto matters: Report",
    "description": "The UK will deepen ties with the US on digital assets and adopt a more crypto-friendly stance to boost innovation and attract more investment, the Financial Times reports.",
    "link": "https://cointelegraph.com/news/uk-strengthen-ties-us-crypto-matters-financial-times",
    "timestamp": "2025-09-17T00:11:59Z"
  },
  {
    "title": "Robert Redford’s Activism Influenced The Environmental Movement, But He Pursued Politics His Own Way",
    "description": "When Robert Redford was promoting the movie The Candidate in 1972, he went on a mock whistle-stop tour through Florida, drawing larger crowds than actual presidential candidates got that year. The actor would emerge from the back of the train, flash a “V” for…",
    "link": "http://deadline.com/2025/09/robert-redford-politics-activism-1236545599/",
    "timestamp": "2025-09-17T00:10:31Z"
  },
  {
    "title": "US, Canada and Mexico Kick Off Trade Pact Consultations",
    "description": "The US, Canada and Mexico are set to formally begin consultations ahead of the high-stakes review of their regional USMCA trade accord next year, the US and Mexico announced Tuesday.",
    "link": "https://financialpost.com/pmn/business-pmn/us-canada-and-mexico-kick-off-trade-pact-consultations",
    "timestamp": "2025-09-17T00:09:45Z"
  },
  {
    "title": "Trump Spars With Australian Reporter, Hints at Albanese Visit",
    "description": "President Donald Trump sparred with an Australian journalist over his personal wealth during an exchange on the White House lawn, where he also appeared to confirm plans to meet Prime Minister Anthony Albanese at next week’s United Nations summit.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-spars-with-australian-reporter-hints-at-albanese-visit",
    "timestamp": "2025-09-17T00:09:30Z"
  },
  {
    "title": "Social media has us in its grip and won't let go. The Charlie Kirk killing is a case study",
    "description": "Charlie Kirk's mastery of social media was key to his becoming a force in conservative politics",
    "link": "https://abcnews.go.com/Technology/wireStory/social-media-us-grip-charlie-kirk-killing-case-125632084",
    "timestamp": "2025-09-17T00:06:33Z"
  },
  {
    "title": "‘Take Your Dementia Meds, Grandpa’: Newsom Hits Back at Trump’s ‘LIE’ About California’s Wildfire Rebuild",
    "description": "California Gavin Newsom fired back at a social media post from President Donald Trump in a tweet from his office calling the accusations a \"LIE\" and another one he posted directly calling the president's claims a \"straight up lie.\"\nThe post ‘Take Your Dementi…",
    "link": "https://www.mediaite.com/online/take-your-dementia-meds-grandpa-newsom-hits-back-at-trumps-lie-about-californias-wildfire-rebuild/",
    "timestamp": "2025-09-17T00:03:34Z"
  },
  {
    "title": "Dem Rep Flees From Reporter When Asked About Post Calling Alleged Charlie Kirk Assassin ‘MAGA’",
    "description": "California Democratic Rep. Dave Min fled down a U.S. Capitol staircase when pressed by a reporter on Tuesday evening about his viral tweet falsely claiming the suspect in the assassination of Charlie Kirk was “MAGA.” In a Friday evening X post, Min appeared t…",
    "link": "https://dailycaller.com/2025/09/16/dave-min-flees-reporter-charlie-kirk-assassin-maga/",
    "timestamp": "2025-09-17T00:02:35Z"
  },
  {
    "title": "'We cannot be bystanders': Starmer urged to raise Israel's Gaza offensive with Trump",
    "description": "Sir Keir Starmer is under mounting pressure to raise Israel's bombardment of Gaza with Donald Trump during his UK state visit, after a UN Commission said a genocide was taking place.",
    "link": "https://news.sky.com/story/pressure-mounts-on-pm-to-raise-israels-gaza-offensive-with-trump-13432530",
    "timestamp": "2025-09-17T00:02:00Z"
  },
  {
    "title": "Shooting Down Russian Drones Over Poland: Who Is Trying To Start World War 3?",
    "description": "The world is now closer to a full-scale war between NATO and Russia than at any time since the 1962 Cuban Missile Crisis.  In the early morning hours of September 10, 2025, Western air defenses spotted a fleet of Russian drones that had entered Poland’s airsp…",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/09/16/shooting-down-russian-drones-over-poland-who-is-trying-to-start-world-war-3/",
    "timestamp": "2025-09-17T00:00:44Z"
  },
  {
    "title": "Four People Arrested in the UK for Projecting Images of Trump and Epstein on the Walls of Windsor Castle as the State Visit Begins (VIDEO)",
    "description": "The left is ‘projecting’ their own issues on Trump.\nThe post Four People Arrested in the UK for Projecting Images of Trump and Epstein on the Walls of Windsor Castle as the State Visit Begins (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/09/four-people-arrested-uk-projecting-images-trump-epstein/",
    "timestamp": "2025-09-17T00:00:25Z"
  },
  {
    "title": "Trust . . . But How to Verify?",
    "description": "If recent California political history is any indication—a “temporary” tax increase approved by voters a dozen years ago renewed into potentially permanent status—Proposition 50’s promise of restoring independent congressional redistricting after Donald Trump…",
    "link": "https://www.hoover.org/research/trust-how-verify",
    "timestamp": "2025-09-17T00:00:00Z"
  },
  {
    "title": "Hochul argues Zohran Mamdani would be best candidate to ‘stand up’ to Trump — as she defends shock endorsement in NYC mayoral race",
    "description": "She’s standing by her Mam. Gov. Kathy Hochul defended her shocking endorsement of Zohran Mamdani, arguing Tuesday the socialist mayoral contender is the best candidate to fight Donald Trump",
    "link": "https://freerepublic.com/focus/f-news/4340930/posts",
    "timestamp": "2025-09-16T23:57:49Z"
  },
  {
    "title": "US tech firms pour £30 billion into UK as Trump lands",
    "description": "LONDON — U.S. tech companies unveiled £31 billion of investments in Britain Tuesday, timed for the arrival of President Donald Trump on his second state visit to the country.\nOpenAI, Nscale and Nvidia announced a U.K. version of Stargate — a massive AI infras…",
    "link": "https://biztoc.com/x/94470e858a1632b4",
    "timestamp": "2025-09-16T23:57:41Z"
  },
  {
    "title": "White House Puts Donald Trump’s Makeup-Covered Hand on Full Display",
    "description": "Trump, 79, the oldest person ever inaugurated as president, has often tried to keep his bruised hand hidden.",
    "link": "https://www.thedailybeast.com/white-house-puts-donald-trumps-makeup-covered-hand-on-full-display/",
    "timestamp": "2025-09-16T23:56:38Z"
  },
  {
    "title": "Amanda Seyfried Calls Charlie Kirk ‘Hateful’ After His Assassination",
    "description": "Amanda Seyfried is sharing her feelings about Charlie Kirk after his assassination last week. “He was hateful,” Seyfried, 39, wrote in the comments section of a Tuesday, September 16, Instagram video from the account @So.Informed, which pointed out controvers…",
    "link": "https://www.usmagazine.com/celebrity-news/news/amanda-seyfried-calls-charlie-kirk-hateful-after-his-death/#article",
    "timestamp": "2025-09-16T23:52:35Z"
  },
  {
    "title": "Death penalty charge faced by suspect in Charlie Kirk assassination",
    "description": "Prosecutors brought a murder charge Tuesday against the man accused of assassinating Charlie Kirk and outlined evidence, including a text message confession to his partner and a note left beforehand saying he had the opportunity to kill one of the nation's le…",
    "link": "https://www.bostonherald.com/2025/09/16/death-penalty-charge-faced-by-suspect-in-charlie-kirk-assassination/",
    "timestamp": "2025-09-16T23:51:30Z"
  },
  {
    "title": "Texts Between Accused Charlie Kirk Shooter and Roommate Hint at Motive",
    "description": "Alleged text messages sent between accused shooter Tyler Robinson and his roommate reveal a potential motive for the murder of political commentator Charlie Kirk. During a Tuesday, September 16, press conference, prosecutors shared details of the official cha…",
    "link": "https://www.usmagazine.com/celebrity-news/news/accused-charlie-kirk-shooters-possible-motive-revealed-via-alleged-texts/#article",
    "timestamp": "2025-09-16T23:50:03Z"
  },
  {
    "title": "The White House triples down on ousting Lisa Cook as a major Fed meeting kicks off",
    "description": "The White House triples down on ousting Lisa Cook as a major Fed meeting kicks off\nA move to keep pursuing the matter virtually guarantees a major decision from the Supreme Court that will determine Cook's fate at the central bank\nPresident Donald Trump speak…",
    "link": "https://biztoc.com/x/bac7bcada037e765",
    "timestamp": "2025-09-16T23:47:05Z"
  },
  {
    "title": "Ex-BLS chief says her firing by Trump marked ’dangerous step’ for economy",
    "description": "Stock market today: S&P 500 retreats from record levels as Fed rate decision looms\n(Reuters) -Former Bureau of Labor Statistics Commissioner Erika McEntarfer, in her first public remarks since getting abruptly dismissed last month by President Donald Trump, s…",
    "link": "https://biztoc.com/x/6d74781bcc24db04",
    "timestamp": "2025-09-16T23:47:01Z"
  },
  {
    "title": "More details emerge on potential TikTok deal between U.S., China",
    "description": "New details about a deal with China over the future of TikTok in the United States emerged Tuesday.\nAfter Treasury Secretary Scott Bessent met with a Chinese delegation in Madrid on Monday, he said the two countries had agreed on a deal “framework.” President…",
    "link": "https://biztoc.com/x/8aa39f40e7ddf3a2",
    "timestamp": "2025-09-16T23:46:48Z"
  },
  {
    "title": "President Donald Trump’s $15B lawsuit claims New York Times disparaged his crypto project",
    "description": "US President Donald Trump has launched a $15 billion lawsuit against The New York Times, claiming the newspaper and several reporters intentionally harmed his reputation and the TRUMP memecoin project. In a statement posted on Truth Social, Trump accused the …",
    "link": "https://cryptoslate.com/president-donald-trumps-15b-lawsuit-claims-new-york-times-disparaged-his-crypto-project/",
    "timestamp": "2025-09-16T23:45:44Z"
  },
  {
    "title": "EXCLUSIVE: Arizona Cops on High Alert and Bracing for Charlie Kirk Funeral Chaos at State Farm Stadium — 'Same Ordeal' as Super Bowl Planning",
    "description": "Glendale, Arizona, police will be on high alert for Charlie Kirk's funeral, revealing it will be an 'ordeal' like the Super Bowl.",
    "link": "https://radaronline.com/p/charlie-kirk-funeral-preparations-glendale-police-high-alert/",
    "timestamp": "2025-09-16T23:45:00Z"
  },
  {
    "title": "Fani Willis permanently removed from prosecuting Trump election interference case after losing appeal",
    "description": "Fulton County District Attorney Fani Willis has been permanently sidelined from prosecuting President Donald Trump’s election interference case in Georgia after she lost an appeal at the state’s highest court. The Georgia Court of Appeals in December ruled th…",
    "link": "https://freerepublic.com/focus/f-news/4340928/posts",
    "timestamp": "2025-09-16T23:44:15Z"
  },
  {
    "title": "More details emerge on potential TikTok deal between U.S., China",
    "description": "New details about a deal with China over the future of TikTok in the United States emerged Tuesday",
    "link": "https://www.msnbc.com/top-stories/latest/tiktok-deal-trump-china-bessent-algorithm-rcna231754",
    "timestamp": "2025-09-16T23:40:29Z"
  },
  {
    "title": "Prince Andrew makes rare public appearance at Duchess of Kent funeral",
    "description": "King Charles, Prince William and Kate joined mourners at Westminster Cathedral.",
    "link": "https://www.nzherald.co.nz/lifestyle/prince-andrew-makes-rare-public-appearance-at-duchess-of-kent-funeral/A334XBX2OVBHVN5GN4XHJSU2RE/",
    "timestamp": "2025-09-16T23:40:29Z"
  },
  {
    "title": "Jane Fonda Says Friend Robert Redford ‘Stood’ For 1 Thing ‘We Have To Keep Fighting For’",
    "description": "The two actors shared a friendship that spanned over six decades, and worked together on numerous projects like “The Chase” and “Barefoot in the Park.”",
    "link": "https://www.huffpost.com/entry/jane-fonda-robert-redford-patriotism_n_68c9c0ece4b0765c8250b3b4",
    "timestamp": "2025-09-16T23:40:26Z"
  },
  {
    "title": "'I've Never Seen Anything Like It': Trump Policies Leave US Farmers in Dire Straits",
    "description": "As anticipated, US President Donald Trump's economic and immigration policies are harming American farmers' ability to earn a living—and testing the loyalty of one of the president's staunchest bases of support, according to reports published this week.After …",
    "link": "https://www.commondreams.org/news/farmers-harmed-by-trump-policies",
    "timestamp": "2025-09-16T23:39:19Z"
  },
  {
    "title": "Leaked Chats Show Alleged Kirk Killer 'Doesn't Fit Into Any Tidy Narrative'",
    "description": "Independent journalist Ken Klippenstein on Tuesday challenged conflicting narratives circulating about Tyler Robinson by obtaining online chats and speaking with a childhood friend of the 22-year-old man accused of assassinating far-right activist Charlie Kir…",
    "link": "https://www.commondreams.org/news/tyler-robinson",
    "timestamp": "2025-09-16T23:38:39Z"
  },
  {
    "title": "Trump arrives in London for second state visit to the UK",
    "description": "US President Donald Trump and First Lady Melania Trump arrived in London &#111;n Tuesday evening for their second state visit to the United Kingdom.They were greeted at London Stansted Airport by members of the Royal Air Force and British officials, including…",
    "link": "https://www.israelnationalnews.com/flashes/666652",
    "timestamp": "2025-09-16T23:37:22Z"
  },
  {
    "title": "Four arrested after Trump, Epstein images projected onto Britain's Windsor Castle",
    "description": "LONDON (Reuters) -Four people were arrested on Tuesday following a projection of images of Donald Trump alongside sex offender Jeffrey Epstein onto the royal Windsor Castle, where the U.S. President is set to be hosted by King Charles during his state visit t…",
    "link": "https://www.thestar.com.my/news/world/2025/09/17/four-arrested-after-trump-epstein-images-projected-onto-britain039s-windsor-castle",
    "timestamp": "2025-09-16T23:37:00Z"
  },
  {
    "title": "Trump administration clears first Ukraine arms aid paid for by allies, sources say",
    "description": "Since taking office, the Trump administration has only sold weapons to Ukraine or shipped donations which were authorized by former President Joe Biden.",
    "link": "https://www.japantimes.co.jp/news/2025/09/17/world/politics/trump-ukraine-arms-aid-allies/",
    "timestamp": "2025-09-16T23:35:00Z"
  },
  {
    "title": "Trump administration sued over actions against University of California",
    "description": "WASHINGTON (Reuters) -Labor unions, faculty and students in the University of California education system sued President Donald Trump's administration on...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-sued-over-actions-233417586.html",
    "timestamp": "2025-09-16T23:34:17Z"
  },
  {
    "title": "Fox News Contributor Criticizes Trump’s Venezuelan Boat Bombings: ‘Things Can Go Very Badly Here’",
    "description": "Fox News contributor Kennedy criticized President Donald Trump for blowing up ships allegedly carrying drugs in the Caribbean. \nThe post Fox News Contributor Criticizes Trump’s Venezuelan Boat Bombings: ‘Things Can Go Very Badly Here’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/fox-news-contributor-criticizes-trumps-venezuelan-boat-bombings-things-can-go-very-badly-here/",
    "timestamp": "2025-09-16T23:33:16Z"
  },
  {
    "title": "South Park Season 27 Episode 5: Why new episode faced delays? Here's release date, time, where to watch, plot and what to expect",
    "description": "South Park Season 27 Episode 5 will air on Comedy Central on September 17, 2025, at 10 PM ET, followed by its streaming release on Paramount+ the next day. The show’s delay comes from production needs, with creators adjusting schedules while fans await what s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/south-park-season-27-episode-5-release-date-time-where-to-watch-plot-what-to-expect-streaming-details-delay-explained-paramount-plus-comedy-central-why-new-episode-faced-delays-how-to-watch/articleshow/123932666.cms",
    "timestamp": "2025-09-16T23:32:32Z"
  },
  {
    "title": "UK protesters arrested after beaming Epstein video ahead of Trump visit",
    "description": "The shots included Donald Trump's mugshot, portraits of Epstein, newspaper headlines, and footage of the two men dancing together.",
    "link": "https://www.abc.net.au/news/2025-09-17/protesters-beam-epstein-video-as-trump-visits-uk/105782420",
    "timestamp": "2025-09-16T23:32:29Z"
  },
  {
    "title": "The way we live now",
    "description": "Speaking of things that would destroy any normal (work with me here) presidency, the $15 billion dollar “lawsuit” three members of the bar — one who is named Epstein, come on now — filed against the New York Times, Penguin RandomHouse, and several individual …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/the-way-we-live-now-2",
    "timestamp": "2025-09-16T23:30:57Z"
  },
  {
    "title": "Who Is Howard-John Wesley? Pastor Goes Viral for Anti-Charlie Kirk Sermon",
    "description": "Wesley's sermon has been viewed millions of times online and has invited a mixed response.",
    "link": "https://www.newsweek.com/howard-john-wesley-charlie-kirk-sermon-viral-2130614",
    "timestamp": "2025-09-16T23:29:33Z"
  },
  {
    "title": "A female president leads Mexican Independence celebrations for the first time",
    "description": "Mexican President Claudia Sheinbaum has become the first female leader to preside over the country’s independence celebrations in 215 years",
    "link": "https://abcnews.go.com/International/wireStory/female-president-leads-mexican-independence-celebrations-time-125643952",
    "timestamp": "2025-09-16T23:29:21Z"
  },
  {
    "title": "Trump Hits The New York Times With $15B Libel Lawsuit",
    "description": "U.S. President Donald Trump sued The New York Times, four of its reporters, and publisher Penguin Random House for at least $15 billion, claiming defamation and libel, and citing reputational damage, a Florida court filing showed. Trump's suit cites a series …",
    "link": "https://freerepublic.com/focus/f-news/4340927/posts",
    "timestamp": "2025-09-16T23:29:01Z"
  },
  {
    "title": "America’s enemies want us at each other’s throats over Charlie Kirk — don’t take the bait",
    "description": "Russian officials, the Kremlin’s state news outlet and Chinese bots pounced to manipulate Americans’ heightened emotions as a way to incite further domestic conflict.",
    "link": "https://nypost.com/2025/09/16/opinion/americas-enemies-aim-to-divide-us-over-charlie-kirks-murder-dont-take-the-bait/",
    "timestamp": "2025-09-16T23:28:05Z"
  },
  {
    "title": "Rebel Republican rips GOP bid to charge teens as adults — while ignoring Epstein abusers",
    "description": "Rep. Thomas Massie (R-KY), a frequent thorn in the side of President Donald Trump and his Republican colleagues on major issues, took to X on Tuesday to criticize his party's current priorities — particularly with regard to an upcoming bill that would impose …",
    "link": "https://www.rawstory.com/thomas-massie-2674000620/",
    "timestamp": "2025-09-16T23:27:02Z"
  },
  {
    "title": "Al Gore Says Trump’s Energy Policies Are a ‘Tragedy’ for the US",
    "description": "The Trump administration’s desire to amp up the production of oil, gas and coal while dismantling policies that back clean energy is hurting US competitiveness, according to Al Gore.",
    "link": "https://financialpost.com/pmn/business-pmn/al-gore-says-trumps-energy-policies-are-a-tragedy-for-the-us",
    "timestamp": "2025-09-16T23:23:50Z"
  },
  {
    "title": "Here Are The Biggest Lies Leftists Keep Repeating About Charlie Kirk",
    "description": "In the wake of Charlie Kirk's assassination, high-profile individuals with large social media followings have spread lies about the late conservative activist.",
    "link": "https://dailycaller.com/2025/09/16/biggest-lies-said-about-charlie-kirk/",
    "timestamp": "2025-09-16T23:21:37Z"
  },
  {
    "title": "Microsoft Announces $30 Billion Investment In AI Infrastructure, Operations In UK",
    "description": "Microsoft will invest $30 billion in the U.K. through 2028 to expand AI infrastructure and operations, including building the country's largest supercomputer with 23,000 GPUs in partnership with Nscale. CNBC reports: On a call with reporters on Tuesday, Micro…",
    "link": "https://news.slashdot.org/story/25/09/16/2032219/microsoft-announces-30-billion-investment-in-ai-infrastructure-operations-in-uk",
    "timestamp": "2025-09-16T23:20:00Z"
  },
  {
    "title": "5 Takeaways From FBI Director Patel’s Senate Panel Hearing",
    "description": "FBI Director Kash Patel’s testimony to the Senate Judiciary Committee on Tuesday was testy at times, as topics of the Charlie Kirk assassination, the Jeffrey... Read More\nThe post 5 Takeaways From FBI Director Patel’s Senate Panel Hearing appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/09/16/5-takeaways-from-fbi-director-patels-senate-panel-hearing/",
    "timestamp": "2025-09-16T23:17:13Z"
  },
  {
    "title": "Why the US is expected to cut interest rates",
    "description": "Why the US is expected to cut interest rates\nIt's finally happening.\nAfter months of economic debate and mounting attacks from US President Donald Trump, the US central bank is poised to cut interest rates on Wednesday.\nThe Federal Reserve is widely expected …",
    "link": "https://biztoc.com/x/effb367467b649f3",
    "timestamp": "2025-09-16T23:13:25Z"
  },
  {
    "title": "Trump's Former AG Reveals President's Response to Jeffrey Epstein's Death",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFormer Attorney General William Barr told a House committee he spoke twice with Donald Trump about Jeffrey Epstein during Trump's first term, including after the financier died by suicide in a New York jail ce…",
    "link": "https://biztoc.com/x/b06540d4049b80db",
    "timestamp": "2025-09-16T23:13:07Z"
  },
  {
    "title": "Trump's Former AG Reveals President's Response to Jeffrey Epstein's Death",
    "description": "Barr said in a deposition released by the House Oversight Committee that he called Trump immediately after learning of Epstein's death.",
    "link": "https://www.newsweek.com/epstein-update-barr-trump-attorney-general-2130936",
    "timestamp": "2025-09-16T23:10:42Z"
  },
  {
    "title": "DNA on rifle, other items matches man accused of trying to assassinate Trump, FBI analyst testifies",
    "description": "An FBI analyst has testified that DNA sampled from a rifle, as well as multiple other items, found near where President Donald Trump was playing golf in South Florida last year matches that of a man accused of trying to assassinate Trump that day",
    "link": "https://abcnews.go.com/US/wireStory/dna-rifle-items-matches-man-accused-assassinate-trump-125644228",
    "timestamp": "2025-09-16T23:10:29Z"
  },
  {
    "title": "Deal reached to keep TikTok operating in the U.S., Trump says",
    "description": "U.S. President Donald Trump on Tuesday announced an agreement between the U.S. and China to keep TikTok operating in the United States, with three sources familiar with the matter saying the deal was similar to one discussed earlier this year.",
    "link": "https://www.cbc.ca/news/world/us-china-tiktok-deal-1.7635620",
    "timestamp": "2025-09-16T23:10:28Z"
  },
  {
    "title": "Trump just exposed his 'deep bottomless hole of insecurity' with massive threat: analyst",
    "description": "A former senior advisor to President Barack Obama slammed President Donald Trump's latest lawsuit during a podcast interview on Tuesday. Dan Pfeiffer, who worked with Obama from 2013 to 2015, discussed Trump's lawsuit against The New York Times, alleging the …",
    "link": "https://www.rawstory.com/trump-2674000654/",
    "timestamp": "2025-09-16T23:10:02Z"
  },
  {
    "title": "GSK plans $30 billion US investment as pharma tariff threat looms",
    "description": "(Reuters) -GSK said on Wednesday it plans to invest $30 billion in research and development and supply chain infrastructure in the United States over the...",
    "link": "https://finance.yahoo.com/news/gsk-plans-30-billion-us-230754541.html",
    "timestamp": "2025-09-16T23:07:54Z"
  },
  {
    "title": "Why the US is expected to cut interest rates",
    "description": "The Federal Reserve is expected to make its first cut to interest rates since 2024.",
    "link": "https://www.bbc.com/news/articles/c3e75y90pw0o",
    "timestamp": "2025-09-16T23:04:14Z"
  },
  {
    "title": "Why the US is expected to cut interest rates",
    "description": "The Federal Reserve is expected to make its first cut to interest rates since 2024.",
    "link": "https://www.bbc.com/news/articles/c3e75y90pw0o",
    "timestamp": "2025-09-16T23:04:01Z"
  },
  {
    "title": "'No credible information' Epstein trafficked victims to other players: FBI boss",
    "description": "FBI Director Kash Patel told a U.S. Senate panel on Tuesday there was no credible information that Jeffrey Epstein trafficked women and underage girls to anyone but himself, seeking to defuse criticism of the Trump administration's move to end its review of t…",
    "link": "https://www.cbc.ca/news/world/kash-patel-fbi-epstein-senate-panel-1.7635660",
    "timestamp": "2025-09-16T23:02:44Z"
  },
  {
    "title": "Trump brings tech CEOs on UK state visit",
    "description": "US President Donald Trump will be joined by Silicon Valley top brass on his state visit to the UK beginning today, highlighting a wave of tech investments in Washington’s leading European ally.\nGoogle’s president is accompanying Trump, and announced $6.8 bill…",
    "link": "https://biztoc.com/x/af2d0b04f778c8df",
    "timestamp": "2025-09-16T23:02:00Z"
  },
  {
    "title": "Why is Trump suing the New York Times?",
    "description": "President Donald Trump is seen on the South Lawn of the White House on September 14, 2025. | Francis Chung/Politico/Bloomberg via Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration w…",
    "link": "https://biztoc.com/x/f35a0af5681b3502",
    "timestamp": "2025-09-16T23:01:42Z"
  },
  {
    "title": "Record-Low 35% in U.S. Satisfied With K-12 Education Quality",
    "description": "Americans' satisfaction with the quality of K-12 education in the U.S. is at a record-low 35%, and just 26% say it is headed in the right direction.",
    "link": "https://news.gallup.com/poll/695174/record-low-satisfied-education-quality.aspx",
    "timestamp": "2025-09-16T23:01:00Z"
  },
  {
    "title": "Patel: ‘No credible information’ others involved in Epstein crimes | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> FBI Director Kash Patel told a U.S. Senate panel on Tuesday there was no credible information that Jeffrey Epstein trafficked women and underage girls to anyone but himself, seeking to defuse criticism of the Trump administration’s move to end i…",
    "link": "https://www.staradvertiser.com/2025/09/16/breaking-news/patel-no-credible-information-others-involved-in-epstein-crimes/",
    "timestamp": "2025-09-16T23:00:56Z"
  },
  {
    "title": "Jimmy Kimmel suggests Charlie Kirk assassin was one of the 'MAGA gang' despite reports of leftist leanings",
    "description": "ABC late-night host Jimmy Kimmel implied during his show that Charlie Kirk’s alleged assassin was a Republican despite reports of him having a “leftist ideology.\"",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-suggests-charlie-kirk-assassin-one-maga-gang-despite-reports-leftist-leanings",
    "timestamp": "2025-09-16T23:00:11Z"
  },
  {
    "title": "Chevron’s Comeback Faces the Heat of U.S.–Venezuela Conflict",
    "description": "Chevron has returned to Venezuela, but the move may prove problematic given the frictions in the US–Venezuela relations. What appears at first as an oil company regaining lost ground could be in fact another failed attempt to normalize oil production in Venez…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Chevrons-Comeback-Faces-the-Heat-of-USVenezuela-Conflict.html",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "Royal engagements planned for second day of Trump visit",
    "description": "The first full day of US President Donald Trump's state visit to the UK gets underway this morning.",
    "link": "https://www.rte.ie/news/uk/2025/0917/1533865-trump-uk/",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "What's on? Top 10 TV and streaming tips for Wednesday",
    "description": "Who's Building Ireland? meets the tradespeople doing just that, Trump v The Truth looks at the US president's proclivity for porkies, Molly Parker stars in US medical drama Doc, and The Morning Show returns . . .",
    "link": "https://www.rte.ie/entertainment/2025/0917/1533736-whats-on-top-10-tv-and-streaming-tips-for-wednesday/",
    "timestamp": "2025-09-16T23:00:00Z"
  },
  {
    "title": "Royal engagements planned for second day of Trump visit",
    "description": "The first full day of US President Donald Trump's state visit to the UK gets under way this morning.",
    "link": "https://www.rte.ie/news/uk/2025/0917/1533865-donald-trump-uk/",
    "timestamp": "2025-09-16T23:00:00Z"
  }
]