[
  {
    "title": "Exclusive -- Steve Witkoff Shreds His ‘Total Fake News’ Critics: ‘The Neocon Element Believes That War Is the Only Way to Solve Things’",
    "description": "WASHINGTON — Steve Witkoff, a senior adviser to President Donald Trump and key negotiator for the president on a number of fronts worldwide, told Breitbart News exclusively this week that the president prefers diplomacy over military intervention when availab…",
    "link": "https://www.breitbart.com/politics/2025/05/09/exclusive-steve-witkoff-shreds-his-total-fake-news-critics-the-neocon-element-believes-that-war-is-the-only-way-to-solve-things/",
    "timestamp": "2025-05-09T13:29:12Z"
  },
  {
    "title": "Melania Trump is keeping a low profile. Her outfits are helping.",
    "description": "Melania Trump's style during Donald Trump's second term is as low-profile as her White House presence.",
    "link": "https://www.businessinsider.com/melania-trump-white-house-style-2025-5",
    "timestamp": "2025-05-09T13:29:12Z"
  },
  {
    "title": "Government agency quietly advances controversial plan that could endanger millions of lives: 'This will increase health risks' - NewsBreak",
    "description": "\"It also allows the market for toxic chemicals to continue.\" Government agency quietly advances controversial plan that could endanger millions of lives:",
    "link": "https://www.newsbreak.com/news/3998599736135-government-agency-quietly-advances-controversial-plan-that-could-endanger-millions-of-lives-this-will-increase-health-risks?noAds=1&_f=app_share&s=a2&share_destination_id=Mjg0MjI3ODEyLTE3NDY3OTcyNTcyNTQ%3D",
    "timestamp": "2025-05-09T13:28:44Z"
  },
  {
    "title": "UK, Northern European Nations Support Ukraine 30-day Ceasefire: Norway PM",
    "description": "The UK, France and a group of northern European nations said Friday they supported a US proposal for an unconditional 30-day ceasefire between Russia and Ukraine.",
    "link": "https://www.ibtimes.com/uk-northern-european-nations-support-ukraine-30-day-ceasefire-norway-pm-3773072",
    "timestamp": "2025-05-09T13:27:10Z"
  },
  {
    "title": "Canada and Europe collaborate on defence. What that might look like?",
    "description": "As US President Donald Trump continues to cast doubt on the future of the NATO military alliance, Canada is looking to partner with the European Union on defence.",
    "link": "https://www.nationalobserver.com/2025/05/09/news/canada-europe-collaborate-defence-what-might-look",
    "timestamp": "2025-05-09T13:27:09Z"
  },
  {
    "title": "Why it matters that Trump is adding Fox News’ Jeanine Pirro to his made-for-TV team",
    "description": "Ed Martin's tenure as an interim U.S. attorney was a disaster. His successor — Fox News' Jeanine Pirro — is unlikely to be an improvement.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jeanine-pirro-us-attorney-nomination-donald-trump-rcna205791",
    "timestamp": "2025-05-09T13:26:09Z"
  },
  {
    "title": "Trump Flirts With Raising Taxes on the Rich in Stream-of-Consciousness Rant: ‘Probably Not… But I’m OK If They Do!!!’",
    "description": "President Donald Trump flirted with raising taxes on the rich in a stream-of-consciousness rant on Truth Social Friday morning.\nThe post Trump Flirts With Raising Taxes on the Rich in Stream-of-Consciousness Rant: ‘Probably Not… But I’m OK If They Do!!!’ firs…",
    "link": "https://www.mediaite.com/news/trump-flirts-with-raising-taxes-on-the-rich-in-stream-of-consciousness-rant-probably-not-but-im-ok-if-they-do/",
    "timestamp": "2025-05-09T13:26:01Z"
  },
  {
    "title": "UK-US trade deal welcomed with enthusiasm but with a touch of apprehension",
    "description": "Tariff agreement has been welcomed by US beef exporters but received with some nervousness by the UK agri-food industry.",
    "link": "https://www.just-food.com/features/uk-us-trade-deal-welcomed-with-enthusiasm-but-with-a-touch-of-apprehension/",
    "timestamp": "2025-05-09T13:25:53Z"
  },
  {
    "title": "Nintendo Doesn’t Rule Out Switch 2 Price Hike After Soft Outlook",
    "description": "Nintendo expects shipments of the Switch 2 to reach 15 million units in the year to March, shy of the 16.8 million average of analyst estimates compiled by Bloomberg. The company may hike prices for the Switch 2 in the US, depending on how Trump administratio…",
    "link": "https://www.gadgets360.com/games/news/nintendo-doesnt-rule-out-switch-price-hike-soft-outlook-8372937",
    "timestamp": "2025-05-09T13:25:29Z"
  },
  {
    "title": "MOVIES: Rust with Alec Baldwin finally arrives but can’t shake the accident he caused",
    "description": "Alternatives include gambling addiction, Italian food, a big TV win, organ trafficking and a killer clown",
    "link": "https://www.nationalobserver.com/2025/05/08/reviews/movies-rust-alec-baldwin-finally-arrives-cant-shake-accident-he-caused",
    "timestamp": "2025-05-09T13:24:39Z"
  },
  {
    "title": "Trump Says He’s Ok With Tax Hike On The Rich",
    "description": "President Donald Trump said he is “Ok” with Republicans raising taxes on the wealthy, though he warned it could backfire politically. In a Truth Social post, Trump wrote: “Republicans should probably not do it, but I’m ok if they do!!!” He added that even a s…",
    "link": "https://biztoc.com/x/ab8effe201b54c06",
    "timestamp": "2025-05-09T13:23:42Z"
  },
  {
    "title": "Trump's new threat 'will keep the internet out of reach for millions': nonpartisan group",
    "description": "Free Press Action Co-CEO Craig Aaron is clapping back at President Donald Trump's claim that the Digital Equity Act is “UNCONSTITUTIONAL” and “RACIST.”“The Trump administration is spiking plans states spent years developing to help their own residents, in fav…",
    "link": "https://www.rawstory.com/trump-2671923800/",
    "timestamp": "2025-05-09T13:20:35Z"
  },
  {
    "title": "Tiger Woods makes White House appearance after Vanessa Trump romance reveal",
    "description": "The 15-time major champion was seen smiling at 1600 Pennsylvania Avenue in a social media photo Thursday.",
    "link": "https://nypost.com/2025/05/09/sports/tiger-woods-spotted-at-white-house-after-vanessa-trump-relationship-reveal/",
    "timestamp": "2025-05-09T13:20:27Z"
  },
  {
    "title": "Fishermen battle with changing oceans chart new course after Trump's push to deregulate",
    "description": "Virginia Olsen has pulled lobsters from Maine's chilly Atlantic waters for decades while watching threats to the state's lifeblood industry mount.",
    "link": "https://www.nationalobserver.com/2025/05/09/news/fishermen-battle-changing-oceans-chart-new-course-after-trumps-push-deregulate",
    "timestamp": "2025-05-09T13:20:10Z"
  },
  {
    "title": "Trump Picks Most Unhinged Fox News Host for Top D.C. Job",
    "description": "Donald Trump has decided to appoint one of his favorite Fox News hosts, Jeanine Pirro, as interim U.S. attorney for Washington, D.C., and she has quite a history. \r\nPirro has spent the last two decades with the conservative TV network as a legal analyst and h…",
    "link": "https://newrepublic.com/post/195052/trump-fox-news-host-jeanine-pirro-dc-attorney",
    "timestamp": "2025-05-09T13:19:08Z"
  },
  {
    "title": "US government no longer monitoring violent crime against trans people, leaked documents suggest",
    "description": "The US government is reportedly planning to stop monitoring violence against trans people in its latest act of trans erasure. Leaked document revisions obtained in April revealed that the federal Bureau of Justice Statistics, an arm of the Department of Justi…",
    "link": "https://www.thepinknews.com/2025/05/09/trans-violent-crime-us-government/",
    "timestamp": "2025-05-09T13:17:41Z"
  },
  {
    "title": "Michael Milken summit rival has unique ties to famed ‘Junk Bond King’",
    "description": "The son of Milken's partner in building Drexel into a powerhouse investment bank has been quietly making a name for himself in the burgeoning crypto business.",
    "link": "https://nypost.com/2025/05/09/business/michael-milken-summit-rival-has-unique-ties-to-famed-junk-bond-king/",
    "timestamp": "2025-05-09T13:17:37Z"
  },
  {
    "title": "Retired Supreme Court Justice David Souter dies at age 85",
    "description": "Retired Supreme Court Justice David Souter was a steady member of the high court's liberal wing during his tenure despite being appointed by a Republican president.",
    "link": "https://www.cbsnews.com/news/david-souter-dies-age-85-retired-supreme-court-justice/",
    "timestamp": "2025-05-09T13:16:42Z"
  },
  {
    "title": "Resistance media can't handle the truth (Hugo Gurdon/Washington Examiner)",
    "description": "Hugo Gurdon / Washington Examiner:\nResistance media can't handle the truth  —  President Donald Trump wants to boost domestic manufacturing, but one sector has already massively increased output — of bogus news stories by hostile and biased media.  —  High pr…",
    "link": "https://www.memeorandum.com/250509/p31",
    "timestamp": "2025-05-09T13:15:00Z"
  },
  {
    "title": "Whistleblower Documents Implicate NARA In Second Get-Trump Criminal Case",
    "description": "The documents requested by Johnson and Grassley should provide the necessary transparency to understand which players at NARA were involved. ens. Ron Johnson, R-Wis., and Chuck Grassley, R-Iowa, have launched an inquiry into the National Archives and Records …",
    "link": "https://freerepublic.com/focus/f-chat/4315910/posts",
    "timestamp": "2025-05-09T13:13:46Z"
  },
  {
    "title": "Paramount, Skydance must scrap DEI to pass FCC’s ‘public interest’ litmus test: sources",
    "description": "Getting rid of so-called DEI will be a prerequisite for any media deal that needs FCC approval, sources tell On The Money.",
    "link": "https://nypost.com/2025/05/09/media/paramount-skydance-must-scrap-dei-to-pass-fccs-public-interest-litmus-test-sources/",
    "timestamp": "2025-05-09T13:13:30Z"
  },
  {
    "title": "Woman Spits on Failed Trump Nominee Ed Martin During TV Interview",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA woman was filmed spitting on Donald Trump's former pick for Prosecutor for the Department of Justice in Washington, D.C., Ed Martin, while he was participating in a TV interview.\nNewsweek contacted Martin vi…",
    "link": "https://biztoc.com/x/658ccd58b70bd118",
    "timestamp": "2025-05-09T13:13:19Z"
  },
  {
    "title": "Trump floats cutting China tariffs to 80% ahead of meeting as he looks to deescalate trade war",
    "description": "By SEUNG MIN KIM and JOSH BOAK, Associated Press\nWASHINGTON (AP) — President Donald Trump on Friday floated cutting tariffs on China from 145% to 80% ahead of a weekend meeting among top U.S. and Chinese trade officials as he looks to deescalate the trade war…",
    "link": "https://biztoc.com/x/f510de20f8e5bca0",
    "timestamp": "2025-05-09T13:12:45Z"
  },
  {
    "title": "One of Hollywood’s top talent agents on this summer’s promising box office lineup",
    "description": "Good morning! OpenAI taps Instacart CEO Fidji Simo for leadership role, where the new Pope stands, and CAA's Maha Dakhil is optimistic about this summer's box office.- Summer Smash. News that President Donald Trump wants to put a 100% tariff on films made out…",
    "link": "https://biztoc.com/x/8b430db9f12dc973",
    "timestamp": "2025-05-09T13:12:41Z"
  },
  {
    "title": "Woman Spits on Failed Trump Nominee Ed Martin During TV Interview",
    "description": "A woman spat at Martin and called him \"disgusting\" as he was being interviewed after the president rescinded his nomination as Washington's top prosecutor.",
    "link": "https://www.newsweek.com/ed-martin-trump-nomination-interview-2070048",
    "timestamp": "2025-05-09T13:10:22Z"
  },
  {
    "title": "The Hypocrisy of Fetterman’s Defenders",
    "description": "Dismissing evidence that a politician might be unfit for office is as much a mistake for the right as it was for the left.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/hypocrisy-fetterman-defenders/682753/",
    "timestamp": "2025-05-09T13:10:00Z"
  },
  {
    "title": "US industry optimistic about getting Indian market access for its soyabean",
    "description": "US soyabean industry optimistic about India market access, focusing on exports and GMO acceptance, aiming for low import duty.",
    "link": "https://www.thehindubusinessline.com/economy/agri-business/us-industry-optimistic-about-getting-indian-market-access-for-its-soyabean/article69557233.ece",
    "timestamp": "2025-05-09T13:08:18Z"
  },
  {
    "title": "Charles Barkley stands firm on controversial opinion about transgender athletes in sports",
    "description": "NBA Hall of Famer Charles Barkley is known for speaking his mind, and his latest comments on the ongoing debate around transgender athletes in sports are no exception. \nDuring a re",
    "link": "https://www.marca.com/en/basketball/nba/2025/05/09/681dfdb622601d73218b459d.html",
    "timestamp": "2025-05-09T13:07:43Z"
  },
  {
    "title": "Putin and Trump exchanged World War Two anniversary greetings via aides, Kremlin says",
    "description": "Vladimir Putin and Donald Trump exchanged greetings. They marked the 80th anniversary of the Soviet and allied victory in World War Two. The exchange occurred through their aides. Yuri Ushakov shared the news on state TV. Russia observed the anniversary with …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/putin-and-trump-exchanged-world-war-two-anniversary-greetings-via-aides-kremlin-says/articleshow/121032711.cms",
    "timestamp": "2025-05-09T13:04:57Z"
  },
  {
    "title": "US confirms plan for private firms to deliver Gaza aid despite UN alarm",
    "description": "UN agencies say they will not co-operate with the proposed system because it appears to \"weaponise\" aid.",
    "link": "https://www.bbc.com/news/articles/cp92rlm300mo",
    "timestamp": "2025-05-09T13:04:52Z"
  },
  {
    "title": "In a world dominated by loud, divisive politics, the Cardinals found an antidote in Pope Leo XIV",
    "description": "In a world dominated by loud, divisive politics, the Cardinals found an antidote in Pope Leo XIV",
    "link": "https://www.irishtimes.com/opinion/2025/05/09/in-a-world-dominated-by-loud-divisive-politics-the-cardinals-found-an-antidote-in-pope-leo-xiv/",
    "timestamp": "2025-05-09T13:03:22Z"
  },
  {
    "title": "In a world dominated by loud, divisive politics, the Cardinals found an antidote in Pope Leo XIV",
    "description": "In a world dominated by loud, divisive politics, the Cardinals found an antidote in Pope Leo XIV",
    "link": "https://www.irishtimes.com/opinion/2025/05/09/pope-leo-xiv-catholic/",
    "timestamp": "2025-05-09T13:03:22Z"
  },
  {
    "title": "'No more dudes in dresses': Hegseth gives multitudes of trans-identifying service members the boot",
    "description": "Defense Secretary Pete Hegseth issued a memo to senior Pentagon leaders on Thursday notifying them that the time has come to begin kicking trans-identifying service members to the curb.\n\nIn a corresponding video on X captioned, \"TRANS is out at the DOD,\" Hegs…",
    "link": "https://www.theblaze.com/news/no-more-dudes-in-dresses-hegseth-gives-multitudes-of-trans-identifying-members-the-boot",
    "timestamp": "2025-05-09T13:03:00Z"
  },
  {
    "title": "India Seeks Justice for Islamist Terror Attack | Opinion",
    "description": "After the terrorist attack in Pahalgam, the world community was expecting retaliation by India.",
    "link": "https://www.newsweek.com/india-seeks-justice-islamist-terror-attack-opinion-2069647",
    "timestamp": "2025-05-09T13:02:28Z"
  },
  {
    "title": "Trump: Many good trade deals in the hopper",
    "description": "United States President Donald Trump announced on Friday that the country is about to conclude many new trade agreements, all beneficial.\"Many Trade Deals in the hopper, all good (GREAT!) ones!\" Trump...",
    "link": "https://biztoc.com/x/0234fea74f886a24",
    "timestamp": "2025-05-09T13:02:00Z"
  },
  {
    "title": "Xi meets Putin as China, Russia strive for new world order",
    "description": "China's leader is in Russia for celebrations marking the 80th anniversary of the end of World War II. Both Xi Jinping and Vladimir Putin want to challenge US dominance in global affairs and reshape the world order.",
    "link": "https://www.dw.com/en/xi-meets-putin-as-china-russia-strive-for-new-world-order/a-72491824",
    "timestamp": "2025-05-09T13:02:00Z"
  },
  {
    "title": "Going Around. . . Coming Back Around",
    "description": "\"I hope Ed Martin’s 1st assignment at DOJ is to investigate Thom Tillis’ corruption.\" — Rogan O'Handley (aka' DC Draino' on X)",
    "link": "https://www.kunstler.com/p/going-around-coming-back-around",
    "timestamp": "2025-05-09T13:01:48Z"
  },
  {
    "title": "Commerce secretary says more deals to come following US-UK trade agreement: 'Going to drive our economy'",
    "description": "Commerce Secretary Howard Lutnick said on Thursday that the newly announced trade deal between the U.S. and the U.K. is just the beginning, as more agreements are expected in the coming weeks.\n\"This is Donald Trump at his best creating the opportunity for som…",
    "link": "https://biztoc.com/x/745b8b2c43bc742d",
    "timestamp": "2025-05-09T13:01:36Z"
  },
  {
    "title": "Blue state governor touts meeting with CCP official cozying up to Dems: 'Grateful for the opportunity'",
    "description": "A Democratic governor enthusiastically posted photos with a CCP diplomat on Wednesday evening, saying she was \"grateful for the opportunity\" to meet with him.",
    "link": "https://www.foxnews.com/politics/blue-state-governor-touts-meeting-ccp-official-cozying-up-dems-grateful-opportunity",
    "timestamp": "2025-05-09T13:00:58Z"
  },
  {
    "title": "Missing Heirs and Mental Illness: The Bizarre Case of Letitia James’s Father’s Estate",
    "description": "Guest post by Joel Gilbert New York Attorney General Letitia James has long portrayed herself as a crusader for justice, particularly when it comes to holding powerful figures accountable for financial misconduct.\nThe post Missing Heirs and Mental Illness: Th…",
    "link": "https://www.thegatewaypundit.com/2025/05/missing-heirs-mental-illness-bizarre-case-letitia-jamess/",
    "timestamp": "2025-05-09T13:00:56Z"
  },
  {
    "title": "Trump's deal with the UK sends a clear message: 10% tariffs are here to stay (CNBC)",
    "description": "CNBC:\nTrump's deal with the UK sends a clear message: 10% tariffs are here to stay … The U.K. and U.S. agreed to a landmark trade deal on Thursday — yet the agreement appears to be far from free of tariffs.  —  The deal is the first made by the United States …",
    "link": "https://www.memeorandum.com/250509/p30",
    "timestamp": "2025-05-09T13:00:44Z"
  },
  {
    "title": "Ukrainian Parliament Ratifies Natural Resources Deal With USA",
    "description": "Ukraine's parliament ratified a deal with the U.S. over access to the country's natural resources.",
    "link": "https://www.rigzone.com/news/wire/ukrainian_parliament_ratifies_natural_resources_deal_with_usa-09-may-2025-180485-article/",
    "timestamp": "2025-05-09T13:00:01Z"
  },
  {
    "title": "Unpacking claim Time magazine cover shows Mark Carney giving Trump the middle finger",
    "description": "An image circulating online in late April and early May 2025 authentically showed a Time magazine cover featuring the words, \"Hey, Donald\" and Canadian Prime Minister Mark Carney holding up his middle finger.",
    "link": "https://www.snopes.com//fact-check/mark-carney-trump-middle-finger-time/",
    "timestamp": "2025-05-09T13:00:00Z"
  },
  {
    "title": "Heather Cox Richardson: The New Pope’s Clash with MAGA",
    "description": "Heather Cox Richardson recounts the important exchanges between the new Pope, Leo XIV, and JD Vance, on the subject of immigrants. Vance, a convert to Catholicism, described Catholic doctrine and was quickly rebuffed at the time both by Pope Francis and by th…",
    "link": "https://dianeravitch.net/2025/05/09/heather-cox-richardson-the-new-popes-clash-with-maga/",
    "timestamp": "2025-05-09T13:00:00Z"
  },
  {
    "title": "Trump and Jasmine Crockett Spar on Socials, Biden Reads Trump for Filth, Candace Owens Calls out T.I. For Fakery, Why Atlanta Hasn't Had a White Mayor in 50 Years and Other Political News",
    "description": "Photo: Jemal Countess, Andrew Harnik (Getty Images), David McNew (Getty Images), Jason Davis, Paras Griffin (Getty Images), Marcus Ingram, Rick Friedman, Paras Griffin (Getty Images), Screenshot: BBC News (YouTube), Image: Central Press/Hulton Archive (Getty …",
    "link": "https://www.theroot.com/trump-and-jasmine-crockett-spar-on-socials-biden-reads-1851779972",
    "timestamp": "2025-05-09T13:00:00Z"
  },
  {
    "title": "Answerman - How Will President Trump's Proposed Foreign Film Tariff Affect Anime?",
    "description": "If you need answers about this developing story, Jerome lays out if anime will likely be affected and, if it is, the potential economic fallout for the anime industry.",
    "link": "https://www.animenewsnetwork.com/answerman/2025-05-09/.224282",
    "timestamp": "2025-05-09T13:00:00Z"
  },
  {
    "title": "Trump floats cutting China tariffs to 80% ahead of meeting as he looks to deescalate trade war",
    "description": "President Trump has floated cutting tariffs on China from 145% to 80% ahead of a weekend meeting as he looks to deescalate the trade war.",
    "link": "https://www.denverpost.com/2025/05/09/trump-tariffs-china-deescalation/",
    "timestamp": "2025-05-09T12:58:50Z"
  },
  {
    "title": "Trump floats cutting China tariffs to 80% ahead of meeting as he looks to deescalate trade war",
    "description": "President Trump has floated cutting tariffs on China from 145% to 80% ahead of a weekend meeting as he looks to deescalate the trade war.",
    "link": "https://www.bostonherald.com/2025/05/09/trump-tariffs-china-deescalation/",
    "timestamp": "2025-05-09T12:58:50Z"
  },
  {
    "title": "Trump Gives China Major Concession on Tariffs Before Talks Even Begin",
    "description": "Donald Trump is so desperate to get a trade deal with China that he’s already backing down.",
    "link": "https://newrepublic.com/post/195049/trump-china-concession-tariffs-talks-trade-deal",
    "timestamp": "2025-05-09T12:58:18Z"
  },
  {
    "title": "China, America, And India Compete Over Gulf Energy",
    "description": "For a decade, China has surpassed the United States as the largest consumer of Arab Gulf energy. Now China, India, and America compete over energy in the Middle East.",
    "link": "https://www.forbes.com/sites/wesleyhill/2025/05/09/china-america-and-india-compete-over-gulf-energy/",
    "timestamp": "2025-05-09T12:57:44Z"
  },
  {
    "title": "BOOM! President Trump Appoints Ed Martin to Be Director of DOJ’s Weaponization Working Group and Pardon Attorney",
    "description": "President Donald Trump announced Thursday evening he is appointing Ed Martin to be an Associate Deputy Attorney General at the Department of Justice with two jobs, Pardon Attorney and Director of Attorney General Pam Bondi’s Weaponization Working Group. The a…",
    "link": "https://freerepublic.com/focus/f-news/4315907/posts",
    "timestamp": "2025-05-09T12:57:34Z"
  },
  {
    "title": "Trump Suggests Lower China Tariff, Says 80% 'Seems Right!'",
    "description": "US President Donald Trump signaled on Friday that he could lower tariffs on Chinese imports, as the rival superpowers prepare for trade talks over the weekend.",
    "link": "https://www.ibtimes.com/trump-suggests-lower-china-tariff-says-80-seems-right-3773068",
    "timestamp": "2025-05-09T12:57:11Z"
  },
  {
    "title": "Taiwan announces special budget amid global tariff row",
    "description": "The Taiwan economy is expected to face downside risks in 2025 due to the ongoing tariff imposition between Taiwan and the US.",
    "link": "https://www.worldconstructionnetwork.com/analyst-comment/taiwan-announces-special-budget-amid-global-tariff-row/",
    "timestamp": "2025-05-09T12:56:58Z"
  },
  {
    "title": "THAT’S INTERIM US ATTORNEY [HIC!] BOXWINE TO YOU, MISTER!",
    "description": "Jeanine Pirro, go home. No, just go home.",
    "link": "https://www.wonkette.com/p/thats-interim-us-attorney-hic-boxwine",
    "timestamp": "2025-05-09T12:55:15Z"
  },
  {
    "title": "Pritzker signs order to protect personal autism data in response to federal action",
    "description": "Gov. JB Pritzker issued an executive order that bars state agencies from collecting and disclosing data about autism to the federal government unless it’s medically or legally necessary",
    "link": "https://www.shawlocal.com/news/2025/05/09/pritzker-signs-order-to-protect-personal-autism-data-in-response-to-federal-action/",
    "timestamp": "2025-05-09T12:54:23Z"
  },
  {
    "title": "HuffPost Turns 20 This Year. Here's A Look Back At Our Most Iconic Moments.",
    "description": "From *THAT* Jennifer Aniston blog post to the time we lit up the Empire State Building in HuffPost green, take a walk down memory lane with us.",
    "link": "https://www.huffpost.com/entry/huffpost-20th-anniversary-history_n_67f68904e4b0c3f52685d549",
    "timestamp": "2025-05-09T12:52:21Z"
  },
  {
    "title": "How California's High-Speed Rail Progress Compares To Texas",
    "description": "Governor Gavin Newsom's office put out a graphic criticizing the Texas project for failing to start construction.",
    "link": "https://www.newsweek.com/how-california-high-speed-rail-compares-texas-gavin-newsom-2070091",
    "timestamp": "2025-05-09T12:51:55Z"
  },
  {
    "title": "Science requires ethical oversight – without federal dollars, society’s health and safety are at risk",
    "description": "There are several steps between research on seemingly esoteric subjects and breakthrough medical treatments. Ethical oversight at every stage ensures science and society ultimately benefit.",
    "link": "https://theconversation.com/science-requires-ethical-oversight-without-federal-dollars-societys-health-and-safety-are-at-risk-252794",
    "timestamp": "2025-05-09T12:51:16Z"
  },
  {
    "title": "Gavin Newsom, California Face Another Budget Shortfall; $10-$20 Billion",
    "description": "California Governor Gavin Newsom and state lawmakers are bracing for a $10 billion budget shortfall — even before federal spending cuts undertaken by the Trump administration and the Department of Government Efficiency (DOGE). Newsom and the Democrats took a …",
    "link": "https://freerepublic.com/focus/f-news/4315905/posts",
    "timestamp": "2025-05-09T12:49:53Z"
  },
  {
    "title": "US considering lowering China tariffs to 50% – media",
    "description": "The 145% tariff on Chinese imports could reportedly be cut while negotiations to clinch a trade agreement are ongoing Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617157-us-low-tariffs-china-talks/",
    "timestamp": "2025-05-09T12:49:33Z"
  },
  {
    "title": "Jensen Huang's big decision: Reports say Nvidia will tweak H20 chip for China to overcome U.S. ban, will Donald Trump allow it?",
    "description": "Nvidia plans to launch a downgraded version of its H20 chip for China to comply with US export restrictions. This strategic decision, announced by CEO Jensen Huang, aims to maintain a strong presence in the Chinese market, which accounts for a significant por…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jensen-huangs-big-decision-reports-say-nvidia-will-tweak-h20-chip-for-china-to-overcome-u-s-ban-will-donald-trump-allow-it/articleshow/121031551.cms",
    "timestamp": "2025-05-09T12:49:09Z"
  },
  {
    "title": "I watched the Kremlin’s new Putin documentary (so you don’t have to) − here’s what it says about how the Russian leader views himself",
    "description": "The 90-minute film depicts Vladimir Putin in the gym, the kitchen and musing about how the West is responsible for trying to bring down Russia.",
    "link": "https://theconversation.com/i-watched-the-kremlins-new-putin-documentary-so-you-dont-have-to-heres-what-it-says-about-how-the-russian-leader-views-himself-256159",
    "timestamp": "2025-05-09T12:48:11Z"
  },
  {
    "title": "Can Trump strip Harvard of its charitable status? Scholars of nonprofit law and accounting describe the obstacles in his way",
    "description": "The IRS would need to conduct an audit first. And presidents aren’t allowed to make the IRS do that.",
    "link": "https://theconversation.com/can-trump-strip-harvard-of-its-charitable-status-scholars-of-nonprofit-law-and-accounting-describe-the-obstacles-in-his-way-255072",
    "timestamp": "2025-05-09T12:47:42Z"
  },
  {
    "title": "Wall Street points modestly higher as Trump floats lighter China tariffs ahead of weekend talks",
    "description": "Wall Street pointed modestly higher ahead of weekend trade talks between China and the U.S.",
    "link": "https://www.bostonherald.com/2025/05/09/stock-market-today-trump-china/",
    "timestamp": "2025-05-09T12:46:41Z"
  },
  {
    "title": "Germany's DAX scales record high on trade deal optimism",
    "description": "European shares ticked higher on Friday, with Germany's benchmark index notching an all-time high, as investors bet on de-escalation in the trade war ahead of discussions between the U.S. and China over the weekend.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/germanys-dax-scales-record-high-on-trade-deal-optimism/articleshow/121032299.cms",
    "timestamp": "2025-05-09T12:46:25Z"
  },
  {
    "title": "Commuted But Not Pardoned: Proud Boy Zach Rehl’s Punishment for Being American",
    "description": "Guest post by Patriot Legal Defense The freezing windowless 6×8 steel box was barely wide enough for a man to stretch his arms.\nThe post Commuted But Not Pardoned: Proud Boy Zach Rehl’s Punishment for Being American appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/commuted-not-pardoned-zach-rehls-punishment-being-american/",
    "timestamp": "2025-05-09T12:45:47Z"
  },
  {
    "title": "How William Howard Taft’s approach to government efficiency differed from Elon Musk’s slash-and-burn tactics",
    "description": "Musk’s slashing of government jobs, programs and departments isn’t the first effort by a president’s appointee to streamline government. William Howard Taft tried to do it − but very differently.",
    "link": "https://theconversation.com/how-william-howard-tafts-approach-to-government-efficiency-differed-from-elon-musks-slash-and-burn-tactics-249891",
    "timestamp": "2025-05-09T12:45:29Z"
  },
  {
    "title": "See how many auto dealers there are in every NY county as Trump auto tariffs kick in",
    "description": "See how many auto dealers there are in every NY county as Trump auto tariffs kick insyracuse.com",
    "link": "https://www.syracuse.com/business/2025/05/trump-car-tariffs-are-kicking-in-heres-how-big-the-auto-sales-industry-is-in-every-ny-county.html",
    "timestamp": "2025-05-09T12:43:45Z"
  },
  {
    "title": "Trump's transgender ban is forcing this Kansas officer out of the Army",
    "description": "A memo from President Trump earlier this year revealed plans to remove transgender service members from the military — a plan the Supreme Court has allowed to be enforced while the legal battle plays out. Thousands of transgender service members now face the …",
    "link": "https://www.kcur.org/health/2025-05-09/trumps-transgender-ban-is-forcing-this-kansas-officer-out-of-the-army",
    "timestamp": "2025-05-09T12:43:27Z"
  },
  {
    "title": "Putin and Trump exchange greetings on Victory Day – Moscow",
    "description": "Russian President Vladimir Putin and his US counterpart Donald Trump have exchanged greetings on Victory Day through their aides Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617180-putin-trump-exchange-greetings/",
    "timestamp": "2025-05-09T12:42:18Z"
  },
  {
    "title": "Swiss Seize Window Of Opportunity On Trump Tariffs",
    "description": "Switzerland will once again Friday try to talk its way out of punitive tariffs on its exports to the United States, which would have serious ramifications for Swiss jobs and businesses.",
    "link": "https://www.ibtimes.com/swiss-seize-window-opportunity-trump-tariffs-3773067",
    "timestamp": "2025-05-09T12:42:13Z"
  },
  {
    "title": "Trump Says 80% China Tariff ‘Seems Right’",
    "description": "President Donald Trump indicated that he would approve an 80 percent tariff on China but said the path of the negotiations would be up to Treasury Secretary Scott Bessent. “80% Tariff on China seems right! Up to Scott B,” Trump said in\nThe post Trump Says 80%…",
    "link": "https://www.breitbart.com/economy/2025/05/09/china-tariffs-80/",
    "timestamp": "2025-05-09T12:42:05Z"
  },
  {
    "title": "Jemele Hill returns to ESPN's 'Around the Horn' before show's cancellation, jokes about previous firing",
    "description": "Jemele Hill was back on ESPN on Thursday and could not help but joke about her firing from the network when \"Around the Horn\" unearthed old posts.",
    "link": "https://www.foxnews.com/sports/jemele-hill-returns-espns-around-horn-before-shows-cancellation-jokes-about-previous-firing",
    "timestamp": "2025-05-09T12:41:07Z"
  },
  {
    "title": "What Role for China in Ukraine?",
    "description": "China presents itself as a peacemaker, but it has benefited strategically from the Russia's war. For the Chinese government's calculus to change, it would need to conclude that active engagement in postwar reconstruction would bring even greater benefits than…",
    "link": "https://www.project-syndicate.org/commentary/china-backing-russia-but-could-be-given-a-stake-in-ukraines-reconstruction-by-thomas-graham-2-and-zongyuan-zoe-liu-2025-05",
    "timestamp": "2025-05-09T12:40:22Z"
  },
  {
    "title": "Trump’s Approval Rate Is In ‘Blue Wave’ Territory",
    "description": "G. Elliot Morris: \"According to my average of polls, 43.5% of Americans approve of the job Donald Trump is doing as president today, while 51.8% disapprove — for a net rating of -8 (when rounding).\"",
    "link": "https://politicalwire.com/2025/05/09/trumps-approval-rate-is-in-blue-wave-territory/",
    "timestamp": "2025-05-09T12:40:21Z"
  },
  {
    "title": "‘Hollywood is back’, Cannes boss declares—but Trump’s movie tariffs could devastate Europe’s film industry",
    "description": "President Donald Trump made no secret about “tariff” being “the most beautiful word in the dictionary,” but no one ever saw it coming to the film industry. \nBut that’s what seems to be in the works, according to Trump’s Truth Social post earlier this week, an…",
    "link": "https://biztoc.com/x/5b43e10aa3b59f9f",
    "timestamp": "2025-05-09T12:39:26Z"
  },
  {
    "title": "The Trump Administration’s Biggest Wins And Biggest Fails So Far, by Brandon Smith",
    "description": "Back in 2016 I predicted a resounding win for Donald Trump in his election campaign against Hillary Clinton despite a chorus of voices telling me I was crazy. The argument from skeptics was that the establishment would never allow Trump into office. My positi…",
    "link": "https://survivalblog.com/2025/05/10/trump-administrations-biggest-wins-biggest-fails-far-brandon-smith/",
    "timestamp": "2025-05-09T12:38:39Z"
  },
  {
    "title": "You're Fired: Trump Dismisses Librarian of Congress Carla Hayden",
    "description": "Carla Hayden, the Librarian of Congress, was fired Thursday by President Donald Trump and informed of her demise courtesy of a terse, two-sentence email.\nThe post You’re Fired: Trump Dismisses Librarian of Congress Carla Hayden appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/05/09/youre-fired-trump-dismisses-librarian-of-congress-carla-hayden/",
    "timestamp": "2025-05-09T12:38:11Z"
  },
  {
    "title": "Swiss seize window of opportunity on Trump tariffs",
    "description": "Switzerland will once again Friday try to talk its way out of punitive tariffs on its exports to the United States, which would have serious ramifications for Swiss jobs and businesses. US Treasury Secretary Scott Bessent and China’s Vice Premier He Lifeng ar…",
    "link": "https://www.digitaljournal.com/world/swiss-seize-window-of-opportunity-on-trump-tariffs/article",
    "timestamp": "2025-05-09T12:37:32Z"
  },
  {
    "title": "Dropped Trump Nominee Spat At During Live TV Interview",
    "description": "The dog walker told Ed Martin has was a \"disgusting man.\"",
    "link": "https://www.huffpost.com/entry/ed-martin-spat-at-on-live-tv_n_681dd8efe4b02fbba8e81824",
    "timestamp": "2025-05-09T12:37:26Z"
  },
  {
    "title": "Leo XIV vs. Trump: what will first American Pope mean for US Catholics?",
    "description": "New pope has frequently criticised the president, especially on immigration policy, but is more socially conservative than his predecessor",
    "link": "https://theweek.com/religion/leo-xiv-vs-trump-what-will-first-american-pope-mean-for-us-catholics",
    "timestamp": "2025-05-09T12:37:02Z"
  },
  {
    "title": "Most Americans disapprove of Trump’s treatment of colleges",
    "description": "A new poll shows a majority of U.S. adults disapprove of President Donald Trump’s handling of issues related to colleges and universities, as his Republican administration ramps up threats to cut federal funding unless schools comply with his political agenda.",
    "link": "https://www.mlive.com/news/2025/05/most-americans-disapprove-of-trumps-treatment-of-colleges.html",
    "timestamp": "2025-05-09T12:35:29Z"
  },
  {
    "title": "Ford hikes prices on Mexico-produced models, citing tariffs",
    "description": "Ford Motor has hiked prices on three of its Mexico-produced models effective May 2, becoming one of the first major automakers to adjust sticker prices following U.S. President Donald Trump's tariffs. Prices on the Mustang Mach-E electric SUV, Maverick pickup…",
    "link": "https://freerepublic.com/focus/f-news/4315901/posts",
    "timestamp": "2025-05-09T12:35:16Z"
  },
  {
    "title": "Major brands don’t need to kowtow to Trump: they have the power to bring people together",
    "description": "Whatever you think of his personality or politics, it’s impossible to deny the success of Donald Trump as a brand. Supporters and detractors across the world are transfixed by his second term as US president…",
    "link": "https://theconversation.com/major-brands-dont-need-to-kowtow-to-trump-they-have-the-power-to-bring-people-together-249401",
    "timestamp": "2025-05-09T12:34:00Z"
  },
  {
    "title": "Trump Tries to Pass the Buck on China Tariffs: ‘Up to Scott B.’",
    "description": "President Donald Trump threw out an 80% tariff on China on Friday morning just ahead of high-level trade talks with the country set to begin this weekend, putting a very public demand on what Treasury Secretary Scott Bessent should aim to deliver. “80% Tariff…",
    "link": "https://www.mediaite.com/news/trump-tries-to-pass-the-buck-on-china-tariffs-up-to-scott-b/",
    "timestamp": "2025-05-09T12:33:37Z"
  },
  {
    "title": "AMERICA PRAYER VIGIL, May 10,2025",
    "description": "Posted on 5/7/2025, 4:39:26 PM by spirited irish Join with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Agri-Business; End to Sex Slavery; Healthcare, Education, Churches, and the Media. This is the co…",
    "link": "https://freerepublic.com/focus/f-religion/4315900/posts",
    "timestamp": "2025-05-09T12:30:37Z"
  },
  {
    "title": "The GOP’s Obsession With Women Having Babies Looks A Lot Like The Past",
    "description": "The Trump administration's policy ideas to incentivize women to have more kids resemble those pushed by authoritarian regimes throughout history.",
    "link": "https://www.huffpost.com/entry/gop-pro-natalism-fascism-eugenics_n_681bc59ee4b07abf7dea4fc8",
    "timestamp": "2025-05-09T12:30:05Z"
  },
  {
    "title": "Report: US Defense Secretary Hegseth cancels visit to Israel",
    "description": "US Defense Secretary Pete Hegseth reportedly cancelled his trip to Israel so he could accompany President Trump on his trip to the region.",
    "link": "https://www.israelnationalnews.com/news/408106",
    "timestamp": "2025-05-09T12:29:45Z"
  },
  {
    "title": "Trump Appoints Judge Jeanine Pirro As Interim US Attorney For DC",
    "description": "Trump Appoints Judge Jeanine Pirro As Interim US Attorney For DC\n \nAuthored by Joseph Lord via The Epoch Times,\nPresident Donald Trump announced on May 8 that Judge Jeanine Pirro, best known for her role as a Fox News commentator, had been tapped to serve as …",
    "link": "https://biztoc.com/x/09bb6df397a1ac2d",
    "timestamp": "2025-05-09T12:28:29Z"
  },
  {
    "title": "Trump claims 'I don't know her' and 'listened to' RFK Jr about surgeon general pick getting MAGA pushback",
    "description": "President Donald Trump said he does not know his new nominee for U.S. surgeon general, Dr. Casey Means, telling reporters on Thursday he relied upon the recommendation of Health and Human Services Secretary Robert F. Kennedy Jr.",
    "link": "https://www.foxnews.com/politics/trump-claims-i-dont-know-her-listened-to-rfk-jr-about-surgeon-general-pick-getting-maga-pushback",
    "timestamp": "2025-05-09T12:28:25Z"
  },
  {
    "title": "Trump floats cutting tariffs on China to 80% ahead of weekend trade talks",
    "description": "President Donald Trump on Friday floated cutting tariffs on China from 145 per cent to 80 per cent ahead of a weekend meeting among top U.S. and Chinese trade officials as he looks to de-escalate the trade war.\nTop U.S. officials are set to meet with a high-l…",
    "link": "https://biztoc.com/x/3124cb734e25868f",
    "timestamp": "2025-05-09T12:28:21Z"
  },
  {
    "title": "JD Vance Doubles Down On Trump's Relentless Attacks On Jerome Powell",
    "description": "The vice president said the Federal Reserve chair has \"been wrong about almost everything.\"",
    "link": "https://www.huffpost.com/entry/jd-vance-trump-attacks-jerome-powell_n_681dc509e4b02fbba8e80148",
    "timestamp": "2025-05-09T12:28:15Z"
  },
  {
    "title": "Trump signals he is open to cutting China tariffs to 80% ahead of trade negotiations",
    "description": "President Donald Trump has signaled a willingness to drastically cut the U.S. current 145% tariff rate on China ahead of trade talks between the two countries.",
    "link": "https://biztoc.com/x/810528b0e6f6264a",
    "timestamp": "2025-05-09T12:28:03Z"
  },
  {
    "title": "Kyiv’s EU allies endorse tribunal to try Russian leaders",
    "description": "Ukraine’s EU allies on Friday endorsed the creation of a tribunal to try Russia’s top leaders over the invasion, as Kyiv pushes for Vladimir Putin himself to be brought to justice. EU foreign ministers were gathering in the western Ukrainian city of Lviv in a…",
    "link": "https://www.digitaljournal.com/world/kyivs-eu-allies-endorse-tribunal-to-try-russian-leaders/article",
    "timestamp": "2025-05-09T12:27:20Z"
  },
  {
    "title": "EXCLUSIVE: Southern Border Migrant Apprehensions Continue Record-Shattering Decline",
    "description": "Enforcement actions by the Trump administration continue to yield record-shattering declines in the number of migrants attempting to enter the United States from Mexico. The number of apprehensions in April fell by nearly 13 percent from the previous month an…",
    "link": "https://www.breitbart.com/border/2025/05/09/exclusive-southern-border-migrant-apprehensions-continue-record-shattering-decline/",
    "timestamp": "2025-05-09T12:26:32Z"
  },
  {
    "title": "The last march of the moderates",
    "description": "Blue-state Republicans are ready for battle. Their goal is to restore the state and local tax deductions, or SALT, that allow Americans in high-tax states and localities to deduct what they pay locally from the amount of taxes they owe the federal government.…",
    "link": "https://www.theblaze.com/columns/opinion/the-last-march-of-the-moderates",
    "timestamp": "2025-05-09T12:26:18Z"
  }
]