[
  {
    "title": "John Hudson: Trump pushing for a peace deal with Netanyahu in Washington",
    "description": "Donald Trump hopes to strike a ceasefire deal in Gaza next week as he hosts Israeli prime minister Benjamin Netanyahu at the White House.",
    "link": "https://www.independent.ie/opinion/analysis/john-hudson-trump-pushing-for-a-peace-deal-with-netanyahu-in-washington/a1332453925.html",
    "timestamp": "2025-07-05T04:30:00Z"
  },
  {
    "title": "Another 20 killed in Gaza as deal on ceasefire expected",
    "description": "At least 20 Palestinians were killed yesterday in an Israeli airstrike in Gaza, according to local health officials, as US president Donald Trump said he expected Hamas to respond to his “final proposal” for a ceasefire in Gaza in the next 24 hours.",
    "link": "https://www.independent.ie/world-news/middle-east/another-20-killed-in-gaza-as-deal-on-ceasefire-expected/a1930227567.html",
    "timestamp": "2025-07-05T04:30:00Z"
  },
  {
    "title": "Letters: Europe needs to act more like a bloc and less like a club of hopeful partners",
    "description": "Donald Trump’s return reminds us that old alliances can no longer rest on sentiment (‘In Trumpian world, our rich ties to US need to be solidified’, Irish Independent, July 4).",
    "link": "https://www.independent.ie/opinion/letters/letters-europe-needs-to-act-more-like-a-bloc-and-less-like-a-club-of-hopeful-partners/a1665843991.html",
    "timestamp": "2025-07-05T04:30:00Z"
  },
  {
    "title": "‘If Ed Walsh phones, Donald Trump answers’: Will the US president’s golf buddy be his Irish enforcer as ambassador?",
    "description": "The new US ambassador to Ireland, Edward Walsh, has arrived in his palatial residence in the Phoenix Park with a welcome from the powers-that-be. But it is a reception tinged with awkwardness, and in certain quarters, the policies of his government will be me…",
    "link": "https://www.independent.ie/irish-news/if-ed-walsh-phones-donald-trump-answers-will-the-us-presidents-golf-buddy-be-his-irish-enforcer-as-ambassador/a1105992552.html",
    "timestamp": "2025-07-05T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Donald Trump’s real power play would be ending brutal war in Gaza",
    "description": "US president Donald Trump will meet Israeli prime minister Benjamin Netanyahu on Monday, when he will “press very hard” to end the war in Gaza.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-donald-trumps-real-power-play-would-be-ending-brutal-war-in-gaza/a1448563693.html",
    "timestamp": "2025-07-05T04:30:00Z"
  },
  {
    "title": "No breakthrough yet as EU negotiators work to avoid worst of Trump tariffs ahead of next week’s deadline",
    "description": "European Union negotiators have failed so far to achieve a breakthrough in trade negotiations with the Trump administration and may now seek to extend the status quo to avoid tariff hikes, six EU diplomats briefed on the talks said yesterday.",
    "link": "https://www.independent.ie/world-news/north-america/no-breakthrough-yet-as-eu-negotiators-work-to-avoid-worst-of-trump-tariffs-ahead-of-next-weeks-deadline/a716360223.html",
    "timestamp": "2025-07-05T04:30:00Z"
  },
  {
    "title": "Ukraine suffers ‘harsh, sleepless night’ as Russian barrage kills 26 people",
    "description": "Waves of drones and missiles targeted Kyiv overnight in the largest aerial assault since Russia’s invasion of Ukraine began more than three years ago, officials said yesterday, amid a renewed Russian push to capture more of its neighbour’s land.",
    "link": "https://www.independent.ie/world-news/europe/ukraine-suffers-harsh-sleepless-night-as-russian-barrage-kills-26-people/a369457115.html",
    "timestamp": "2025-07-05T04:30:00Z"
  },
  {
    "title": "Trump voices disappointment after Putin call",
    "description": "United States President Donald Trump said he felt \"disappointed\" after a phone call with Russian President Vladimir Putin earlier this week.\nTrump spoke to reporters aboard Air Force One, s...",
    "link": "https://biztoc.com/x/c16fd303ea1affb9",
    "timestamp": "2025-07-05T04:23:37Z"
  },
  {
    "title": "Trump says 'could be' Gaza deal by next week",
    "description": "Donald Trump indicated a potential Gaza deal next week. He expressed optimism, but noted the situation's fluidity. Trump acknowledged reports of Hamas' positive response to truce talks. He emphasized the need to finalize the deal. Trump stressed the urgency o…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-could-be-gaza-deal-by-next-week/articleshow/122261274.cms",
    "timestamp": "2025-07-05T04:22:08Z"
  },
  {
    "title": "Texas Flash Flood Death Toll Rises To 24",
    "description": "The death toll from flash floods in south-central Texas rose to 24 on Friday, officials said, as the search for at least 20 girls missing from a summer camp continued.",
    "link": "https://www.ibtimes.com/texas-flash-flood-death-toll-rises-24-3777701",
    "timestamp": "2025-07-05T04:21:19Z"
  },
  {
    "title": "BRICS set to condemn ‘coercive’ tariffs, adopt position at odds with Trump on trade taxes",
    "description": "BRICS leaders are set to challenge US President Trump's policies on trade tariffs, Middle East conflicts, and climate change during their meeting in Brazil. They express \"serious concern\" over unilateral tariffs and coercive measures, implicitly criticizing t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/brics-set-to-condemn-coercive-tariffs-adopt-position-at-odds-with-trump-on-trade-taxes/articleshow/122261214.cms",
    "timestamp": "2025-07-05T04:20:16Z"
  },
  {
    "title": "Russia launches largest missile, drone barrage on Kyiv since war in Ukraine began",
    "description": "Hours after the barrage that killed one person and wounded at least 26 others, including a child, Ukrainian President Volodymyr Zelenskyy said he had a “very important and productive” phone call with US President Donald Trump.",
    "link": "https://www.thehindubusinessline.com/news/world/russia-launches-largest-missile-drone-barrage-on-kyiv-since-war-in-ukraine-began/article69775500.ece",
    "timestamp": "2025-07-05T04:14:08Z"
  },
  {
    "title": "Trump to notify 12 countries of tariff hikes on Monday",
    "description": "United States President Donald Trump said aboard Air Force One that he signed 12 letters to trading partners and will send them Monday to announce new tariff rates starting August 1.\nHe described the...",
    "link": "https://biztoc.com/x/fb0876c2031a3509",
    "timestamp": "2025-07-05T04:12:27Z"
  },
  {
    "title": "President Trump's spending cuts bill to impact healthcare in Washington State",
    "description": "WASHINGTON STATE – President Donald Trump signed a significant bill into law today from the White House lawn. Dubbed his \"Big, Beautiful Bill,\" it extends and adds tax cuts totaling",
    "link": "https://www.khq.com/news/president-trumps-spending-cuts-bill-to-impact-healthcare-in-washington-state/article_c99c9990-4150-4db9-9ffe-af0b8aaf8cfb.html",
    "timestamp": "2025-07-05T04:08:53Z"
  },
  {
    "title": "Wall Street Week Ahead: Investors eye tariff deadline as US stocks rally",
    "description": "Investors are keenly observing tariff-related news from Washington next week. A temporary suspension of import taxes is about to expire. Deals with Vietnam and India are anticipated. Talks with Japan face hurdles. The stock market has recently reached record …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-eye-tariff-deadline-as-us-stocks-rally/articleshow/122261152.cms",
    "timestamp": "2025-07-05T04:08:31Z"
  },
  {
    "title": "At least 27 people are dead in Texas floods as the search continues for the many missing",
    "description": "By JOHN SEEWER and JIM VERTUNO KERRVILLE, Texas (AP) — Rescuers were searching Saturday for more than two dozen children from a girls’ camp and many others still missing after a wall of water rushed down a river in the Texas Hill Country during a powerful sto…",
    "link": "https://www.denverpost.com/2025/07/04/at-least-27-people-are-dead-in-texas-floods-as-the-search-continues-for-the-many-missing/",
    "timestamp": "2025-07-05T04:08:25Z"
  },
  {
    "title": "Denmark has long been Euroskeptic. Donald Trump helped change that | CNN",
    "description": "As Denmark takes over the presidency of the European Union, Danes are more strongly pro-European than at any time in the past two decades – a shift in sentiment that can at least partly be attributed to US President Donald Trump.",
    "link": "https://www.cnn.com/2025/07/05/europe/denmark-less-euroskeptic-donald-trump-intl-cmd",
    "timestamp": "2025-07-05T04:01:25Z"
  },
  {
    "title": "Fast-track to the Peace Prize",
    "description": "Hello BeBe, this is the Peace President. I want to remind you of The Golden Rule — “He who has the gold makes the rules.” The gold is still the US dollar and we’ve been providing you with $3.8 billion in US taxpayer gold every year. The new rule is, you now h…",
    "link": "https://www.lewrockwell.com/2025/07/l-reichard-white/fast-track-to-the-peace-prize/",
    "timestamp": "2025-07-05T04:01:00Z"
  },
  {
    "title": "A Big, Beautiful Bill...if you can keep it",
    "description": "On September 17, 1787, Benjamin Franklin was asked by Elizabeth Willing Powell, “Well, Doctor, what have we got: a republic or a monarchy?”  Franklin replied, “A republic, if you can keep it.” \r\n\r...",
    "link": "https://www.americanthinker.com/blog/2025/07/a_big_beautiful_bill_if_you_can_keep_it.html",
    "timestamp": "2025-07-05T04:00:00Z"
  },
  {
    "title": "Zeldin cleans up the EPA",
    "description": "During his first term, one of Donald Trump’s mistakes was not promptly removing bureaucrats and appointed apparatchiks that undermined him, his policies, and the will of the American people. It’s a mistake he has corrected in his second t...",
    "link": "https://www.americanthinker.com/blog/2025/07/zeldin_cleans_up_the_epa.html",
    "timestamp": "2025-07-05T04:00:00Z"
  },
  {
    "title": "Donald Trump is not an antisemite, even if he uses the word ‘shylock’",
    "description": "The usual suspects are up in arms because President Trump used the word “shylock” in connection with moneylenders. However, as always, context matters, and I’m willing to give him a huge pass.\r\n\r\nTrump was touting his Big Beautiful ...",
    "link": "https://www.americanthinker.com/blog/2025/07/donald_trump_is_not_an_antisemite_even_if_he_uses_the_word_shylock.html",
    "timestamp": "2025-07-05T04:00:00Z"
  },
  {
    "title": "Trump's tough Vietnam tariff deal",
    "description": "Just one week before the July 9 deadline in the ongoing trade standoff with the EU, the United States and Vietnam have reached a sweeping agreement. President Donald Trump’s tough stance appears to be paying off. For European negotiators, a dif...",
    "link": "https://www.americanthinker.com/blog/2025/07/trump_s_tough_vietnam_tariff_deal.html",
    "timestamp": "2025-07-05T04:00:00Z"
  },
  {
    "title": "Massad Boulos: The Key Architect Behind the Historic DRC-Rwanda Peace Agreement",
    "description": "In what may become one of the most significant diplomatic moments in recent African history, the Democratic Republic of Congo (DRC) and Rwanda signed a sweeping peace agreement on June 27, 2025—and they did it in the Oval Office, no less, hoste...",
    "link": "https://www.americanthinker.com/articles/2025/07/massad_boulos_the_key_architect_behind_the_historic_drc_rwanda_peace_agreement.html",
    "timestamp": "2025-07-05T04:00:00Z"
  },
  {
    "title": "Putin Has Been 'Able to Handle Sanctions' - Trump",
    "description": "US President Donald Trump admitted that the Russian leadership has been able to cope with Western sanctions.",
    "link": "https://sputnikglobe.com/20250705/putin-has-been-able-to-handle-sanctions---trump-1122397022.html",
    "timestamp": "2025-07-05T03:58:00Z"
  },
  {
    "title": "Some Social Security Recipients Will See Wage Garnishment in Just Weeks",
    "description": "Roughly 2 million Americans owed money to the Social Security Administration due to overpayments in 2023.",
    "link": "https://www.newsweek.com/social-security-update-recipients-wage-garnishment-weeks-2094932",
    "timestamp": "2025-07-05T03:52:37Z"
  },
  {
    "title": "Trump says US will start talks with China on TikTok deal this week",
    "description": "\"I think we're gonna start Monday or Tuesday...talking to China, perhaps President Xi or one of his representatives, but we would we pretty much have a deal,\" Trump told reporters on Air Force One. Last month, Trump extended to September 17 a deadline for Chi…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-says-us-will-start-talks-with-china-on-tiktok-deal-this-week/articleshow/122261014.cms",
    "timestamp": "2025-07-05T03:51:00Z"
  },
  {
    "title": "Opinion: Talking Point This Week - Opposing Forces",
    "description": "Despite opposition, Donald Trump's 'Big Beautiful Bill' passed the US Congress. Now all eyes will be on the trade deals that the United States signs with various nations. On his part, Trump has mentioned that the tariff letters would start going out to variou…",
    "link": "https://www.ndtvprofit.com/opinion/talking-point-this-week-opposing-forces",
    "timestamp": "2025-07-05T03:29:24Z"
  },
  {
    "title": "Trump: Gaza deal possible next week",
    "description": "United States President Donald Trump told reporters onboard his Air Force One that there could be a ceasefire deal reached on Gaza as soon as next week.Additionally, he said that it was good that Hama...",
    "link": "https://biztoc.com/x/36a48aa25f06cf2f",
    "timestamp": "2025-07-05T03:28:02Z"
  },
  {
    "title": "Trump says 10 to 12 countries will get letters on tariff rate on Friday",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump said on Friday his administration later in the day will begin sending letters to 10 to 12 countries informing them of the tariff rate their products will face in the United States. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/05/trump-says-10-to-12-countries-will-get-letters-on-tariff-rate-on-friday",
    "timestamp": "2025-07-05T03:26:00Z"
  },
  {
    "title": "Trump signs sweeping tax and spending bill; welfare cuts, deficit surge trigger backlash",
    "description": "Passed with near-unanimous Republican support, the legislation was fiercely opposed by Democrats, who warned it would strip health coverage from nearly 12 million Americans.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-tax-bill-2025-welfare-cuts-deficit-backlash/article69775440.ece",
    "timestamp": "2025-07-05T03:24:26Z"
  },
  {
    "title": "Trump says tariff letters to 12 countries signed, going out Monday",
    "description": "U.S. President Donald Trump said he had signed letters to 12 countries outlining the various tariff levels they would face on goods they export to the United...",
    "link": "https://www.yahoo.com/news/trump-says-tariff-letters-12-031719055.html",
    "timestamp": "2025-07-05T03:17:19Z"
  },
  {
    "title": "Trump's Brazen New Lie Leads To Instant Fact-Check On Social Media",
    "description": "The president called on \"somebody\" to check his claim... and lots of people did.",
    "link": "https://www.huffpost.com/entry/donald-trump-wind-power-china_n_68687ae7e4b079fbbcb468f2",
    "timestamp": "2025-07-05T03:11:10Z"
  },
  {
    "title": "Jon Jones’ retirement lasted just 14 days; is he back for Aspinall or white house glory?",
    "description": "Jon Jones, after a brief two-week retirement, has announced his return to the UFC by re-entering the testing pool, fueling speculation about a comeback fight. The potential for a historic championship event at the White House in 2026, possibly against Tom Asp…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jon-jones-retirement-lasted-just-14-days-is-he-back-for-aspinall-or-white-house-glory/articleshow/122260604.cms",
    "timestamp": "2025-07-05T03:01:58Z"
  },
  {
    "title": "UFC confirms it's planning White House fight card after President Trump proposes idea",
    "description": "The Dana White House card is officially in the works.",
    "link": "https://sports.yahoo.com/mma/breaking-news/article/ufc-confirms-its-planning-white-house-fight-card-after-president-trump-proposes-idea-025352294.html",
    "timestamp": "2025-07-05T02:53:52Z"
  },
  {
    "title": "Trump administration asserted sweeping power in seeking to bypass TikTok ban",
    "description": "In letters to companies including Apple and Google, Attorney General Pam Bondi wrote that Trump had decided that shutting down TikTok would interfere with his \"constitutional duties,\" so the law banning the social media app must give way to his \"core presiden…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-administration-asserted-sweeping-power-in-seeking-to-bypass-tiktok-ban/articleshow/122260553.cms",
    "timestamp": "2025-07-05T02:48:07Z"
  },
  {
    "title": "Donald Trump's team sound alarm over president's health after 6 worrying signs - NewsBreak",
    "description": "Members of Donald Trump's inner circle have said they 'don’t think he’s in good physical health' as several White House insiders have pointed to key behavi",
    "link": "https://www.newsbreak.com/share/4088939814186-donald-trump-s-team-sound-alarm-over-president-s-health-after-6-worrying-signs?_f=app_share&amp;pd=0EyVfioh&amp;lang=en_US&amp;send_time=1751683201&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.27.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v2%2Cns_foryou_blend_exp_25q2-v6%2Cns_foryou_rank_exp_25q2-v8%2Cns_foryou_recall_exp_25q3-v4&amp;s=i2",
    "timestamp": "2025-07-05T02:40:34Z"
  },
  {
    "title": "Deep-sea mining negotiators to meet under Donald Trump shadow",
    "description": "The International Seabed Authority (ISA) meets next week to continue debating rules for ocean floor mining in international waters, after the United States moved to unilaterally kick-start the controversial industry. The United States, which is not a signator…",
    "link": "https://timesofindia.indiatimes.com/home/environment/deep-sea-mining-negotiators-to-meet-under-donald-trump-shadow/articleshow/122260412.cms",
    "timestamp": "2025-07-05T02:32:12Z"
  },
  {
    "title": "‘Tone deaf’ Gia Giudice slammed for asking Trump to pardon dad Joe: ‘Privilege at its finest’",
    "description": "\"Mind u, this is an ACTUAL convicted felon. but go off,\" one commenter wrote of Joe who served 41 months behind bars for fraud and failure to pay taxes.",
    "link": "https://pagesix.com/2025/07/04/celebrity-news/tone-deaf-gia-giudice-slammed-for-asking-trump-to-pardon-dad-joe/",
    "timestamp": "2025-07-05T02:30:16Z"
  },
  {
    "title": "'She's outta here': Joy Reid reveals how Melania may be deported in Trump's plan",
    "description": "On multiple occasions, President Donald Trump has floated the idea of deporting naturalized U.S. citizens, including during a recent visit to a Florida detention camp for immigrants. But that policy could end up being used against his own family.That's accord…",
    "link": "https://www.rawstory.com/she-s-outta-here-joy-reid-reveals-how-melania-may-be-deported-in-trump-s-plan/",
    "timestamp": "2025-07-05T02:22:21Z"
  },
  {
    "title": "Congress' Newly Passed Bill Means Homeowners Could Save Thousands In Taxes",
    "description": "A key provision included in the law will raise the cap on the State and Local Tax (SALT) deduction to $40,000.",
    "link": "https://www.newsweek.com/congress-newly-passed-bill-means-homeowners-could-save-thousands-taxes-2094931",
    "timestamp": "2025-07-05T02:11:26Z"
  },
  {
    "title": "Trump Signs His Tax Bill at White House Ceremony",
    "description": "President Donald Trump signed his $3.4 trillion budget bill into law Friday, enshrining an extension of tax cuts, temporary new breaks for tipped workers and funding to crack down on illegal immigration. The package encompasses a suite of priorities Trump cam…",
    "link": "https://biztoc.com/x/ea7da8cfaec75462",
    "timestamp": "2025-07-05T02:09:58Z"
  },
  {
    "title": "Macron reveals topics he discussed with Putin",
    "description": "French President Emmanuel Macron said his phone call with Russian counterpart Vladimir Putin focused mostly on nuclear non-proliferation Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621023-macron-putin-call-details/",
    "timestamp": "2025-07-05T02:08:30Z"
  },
  {
    "title": "Critics slam Kamala Harris for gloomy July 4 post — with photo that crops out Biden",
    "description": "\"[W]hose elbow is that at the right[?]\" jeered one X user.",
    "link": "https://nypost.com/2025/07/04/us-news/critics-slam-kamala-harris-for-gloomy-july-4-post-with-pic-that-crops-out-biden/",
    "timestamp": "2025-07-05T02:00:56Z"
  },
  {
    "title": "Aww! GOP Already Facing Major Voter Blowback On Trump Bill",
    "description": "As Senate Republicans rushed to pass a massive budget package known as the “big, beautiful bill,” the political consequences of pushing for the deepest cuts in decades to Medicaid and other safety net programs serving millions of people were already becoming …",
    "link": "https://crooksandliars.com/2025/07/aww-gop-already-facing-major-voter",
    "timestamp": "2025-07-05T02:00:01Z"
  },
  {
    "title": "Trump and Zelenskyy discuss US weapons for Ukrainian defence",
    "description": "Ukrainian President Volodymyr Zelenskyy says he has discussed air defences with his US counterpart, agreeing to work on increasing Kyiv's capability to \"defend the sky\" as Russian attacks escalate.",
    "link": "https://www.abc.net.au/news/2025-07-05/trump-zelenskyy-discuss-weapons-after-us-pause/105498026",
    "timestamp": "2025-07-05T01:58:12Z"
  },
  {
    "title": "Deal Or No Deal? India Talks Tough On Trade Pact With US While Bracing For Trump Tariffs",
    "description": "Sources say that India is very clear that it cannot afford to bend under pressure from the Americans",
    "link": "https://www.news18.com/business/deal-or-no-deal-india-talks-tough-on-trade-pact-with-us-while-bracing-for-trump-tariffs-9421996.html",
    "timestamp": "2025-07-05T01:55:50Z"
  },
  {
    "title": "Federal Reserve Rates Are Too High, Says Former World Bank Chief",
    "description": "Former World Bank President David Malpass criticized the U.S. Federal Reserve for keeping its benchmark interest rate elevated, during a July 2 interview with CNBC. The Fed began raising rates from near zero in 2022 in a bid to rein in inflation. They peaked …",
    "link": "https://freerepublic.com/focus/f-news/4326947/posts",
    "timestamp": "2025-07-05T01:48:41Z"
  },
  {
    "title": "'Please run again': Kamala Harris comment sets off MAGA firestorm",
    "description": "Former U.S. Vice President Kamala Harris came under fire from Donald Trump's allies on Friday, after a simple holiday comment.Harris, who lost to Trump in 2024, took to X on the Fourth of July holiday to write, \"This Fourth of July, I am taking a moment to re…",
    "link": "https://www.rawstory.com/run-again-kamala-harris-firestorm/",
    "timestamp": "2025-07-05T01:42:11Z"
  },
  {
    "title": "New York Times Responds After Zohran Mamdani Story Stirs Liberal Backlash",
    "description": "The Times published a report citing hacked documents that show Mamdani identified as \"Black or African American\" on his application.",
    "link": "https://www.newsweek.com/new-york-times-mamdani-article-healy-responds-2094926",
    "timestamp": "2025-07-05T01:27:54Z"
  },
  {
    "title": "Watch Live: Donald and Melania Trump Hold White House Fourth of July Celebration",
    "description": "President Donald Trump and First Lady Melania Trump hold a Fourth of July celebration at the White House on Friday, July 4.\nThe post Watch Live: Donald and Melania Trump Hold White House Fourth of July Celebration appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/07/04/watch-live-donald-and-melania-trump-hold-white-house-fourth-of-july-celebration/",
    "timestamp": "2025-07-05T01:15:59Z"
  },
  {
    "title": "Powell silence on his future complicates Trump Fed chair search",
    "description": "The Fed chief has repeatedly declined to say whether he will step down when his four-year term as chair expires in May, or remain on the Fed board.",
    "link": "https://www.japantimes.co.jp/business/2025/07/05/economy/powell-silence-trump-frustration/",
    "timestamp": "2025-07-05T01:14:00Z"
  },
  {
    "title": "Fourth of July: Songs that celebrate, define the essence of America",
    "description": "From sea to shining sea, music has defined how Americans see themselves -- and their country. On the Fourth of July, these songs and artists have captured the essence of the United States.",
    "link": "https://www.wsbtv.com/news/trending/fourth-july-songs-that-celebrate-define-essence-america/OI4S3WR7DNFCHFVK6JTMLKVMBU/",
    "timestamp": "2025-07-05T01:04:29Z"
  },
  {
    "title": "Inter-American Court Rules Nations Must Reduce Emissions and Censor Skeptics",
    "description": "An international body which thinks it can dictate climate policy and free speech policy to the United States.",
    "link": "https://wattsupwiththat.com/2025/07/04/inter-american-court-rules-states-must-reduce-emissions-and-censor-skeptics/",
    "timestamp": "2025-07-05T01:00:00Z"
  },
  {
    "title": "The Fourth of July",
    "description": "\"I can negotiate with a man who wants to make money. I can't negotiate with a communist who wants to kill me.\" — Josh Lippincott on \"X\" O, Norman Rockwell, where are you when we really need you? Forgive us, Emma Lazarus, our second thoughts about those huddle…",
    "link": "https://freerepublic.com/focus/f-news/4326945/posts",
    "timestamp": "2025-07-05T00:59:05Z"
  },
  {
    "title": "Trump set to start notifying countries of tariffs up to 70%",
    "description": "Trump’s latest threat, which fits his pattern of issuing ultimatums, aligns with earlier statements that some nations won’t have a say in their tariff level.",
    "link": "https://www.japantimes.co.jp/news/2025/07/05/world/politics/trump-tariffs-notify-letter/",
    "timestamp": "2025-07-05T00:56:00Z"
  },
  {
    "title": "Washington Week with The Atlantic, 7/4/25",
    "description": "For Washington media, the decade of Donald Trump has proved to be challenging, unnerving and rewarding. On a special edition of Washington Week with The Atlantic, Jeffrey Goldberg speaks with Kara Swisher, one of the great analysts and interpreters of our com…",
    "link": "https://www.pbs.org/weta/washingtonweek/video/2025/07/washington-week-with-the-atlantic-7425",
    "timestamp": "2025-07-05T00:53:22Z"
  },
  {
    "title": "Russia launches largest missile, drone barrage on Kyiv since war in Ukraine began",
    "description": "Kyiv endured its largest aerial assault since the start of the war, with waves of drones and missiles targeting the capital. One person was killed and at least 26 others were wounded. President Zelenskyy discussed strengthening air defenses and joint weapons …",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-launches-largest-missile-drone-barrage-on-kyiv-since-war-in-ukraine-began/articleshow/122259910.cms",
    "timestamp": "2025-07-05T00:48:35Z"
  },
  {
    "title": "Trump signs his landmark bill at Fourth of July picnic; his historic, divisive policy win now cast in stone",
    "description": "President Trump signed a divisive tax and spending bill into law amid Fourth of July celebrations, marking a significant legislative victory. The bill extends tax cuts, reduces social programs, and increases immigration enforcement, sparking criticism over it…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-his-landmark-bill-at-fourth-of-july-picnic-his-historic-divisive-policy-win-now-cast-in-stone/articleshow/122259899.cms",
    "timestamp": "2025-07-05T00:47:53Z"
  },
  {
    "title": "Hamas says it responds to Gaza ceasefire proposal in 'a positive spirit'",
    "description": "The U.S.-brokered Gaza ceasefire proposal envisages a release of hostages and negotiations on ending the conflict.",
    "link": "https://www.japantimes.co.jp/news/2025/07/05/world/hamas-ceasefire-positive-spirit/",
    "timestamp": "2025-07-05T00:46:00Z"
  },
  {
    "title": "Trump signs tax and spending bill at White House picnic in photos",
    "description": "At a Fourth of July White House picnic, President Donald Trump signed a major tax and spending bill, celebrating its passage through the Republican-led...",
    "link": "https://www.yahoo.com/news/trump-signs-tax-spending-bill-004543007.html",
    "timestamp": "2025-07-05T00:45:43Z"
  },
  {
    "title": "Trump is Putting the American Dream Out of Reach (Adrianna Tomasello/Democrats)",
    "description": "Adrianna Tomasello / Democrats:\nTrump is Putting the American Dream Out of Reach  —  RE: Trump is Putting the American Dream Out of Reach  —  Donald Trump promised Americans that he would usher in a “golden age” and put “America first.”  But in the 165 days s…",
    "link": "https://www.memeorandum.com/250704/p71",
    "timestamp": "2025-07-05T00:45:00Z"
  },
  {
    "title": "Ukrainian spies infiltrated NATO state – media",
    "description": "The Ukrainian domestic security agency reportedly monitored the local diaspora in Türkiye for “threats and opposition” for years Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621021-ukraine-spied-nato-state/",
    "timestamp": "2025-07-05T00:44:11Z"
  },
  {
    "title": "The Bulwark's top editor shares how the anti-Trump site tripled its subscriber base in a year — and why it's betting on YouTube (James Faris/Business Insider)",
    "description": "James Faris / Business Insider:\nThe Bulwark's top editor shares how the anti-Trump site tripled its subscriber base in a year — and why it's betting on YouTube  — The Bulwark, a news website that's fiercely critical of President Donald Trump, has grown rapidl…",
    "link": "https://www.memeorandum.com/250704/p68",
    "timestamp": "2025-07-05T00:40:02Z"
  },
  {
    "title": "Trump signs 'Big Beautiful Bill' into law",
    "description": "The signature policy enacts key parts of Donald Trump's agenda and could cement his second-term legacy. US President Donald Trump signed a sweeping tax and spending bill into law on Friday, a day after Congress narrowly passed it.\n\nIt makes his 2017 tax cuts …",
    "link": "https://www.dw.com/en/trump-signs-big-beautiful-bill-into-law/a-73163263",
    "timestamp": "2025-07-05T00:36:00Z"
  },
  {
    "title": "Trump signs 'big, beautiful' bill on U.S. Independence Day",
    "description": "\"America is winning, winning, winning like never before,\" Trump said at the event where he signed the bill flanked by Republican lawmakers.",
    "link": "https://www.japantimes.co.jp/news/2025/07/05/world/politics/trump-signs-big-beautiful-bill/",
    "timestamp": "2025-07-05T00:36:00Z"
  },
  {
    "title": "Undocumented migrants in the USA",
    "description": "Donald Trump campaigned hard on illegal immigration ahead of the presidential election and promised voters a major crackdown if they backed him. Since he came to power, the president has issued executive orders to fortify the country’s borders and suspend the…",
    "link": "https://www.bbc.co.uk/programmes/p0ln80d0",
    "timestamp": "2025-07-05T00:30:00Z"
  },
  {
    "title": "Biden struggles to set up beach chair in Malibu during first Fourth of July weekend since leaving office",
    "description": "What a difference a year makes. Former President Joe Biden was snapped struggling to set up a beach chair Thursday before catching some rays with family near his son Hunter’s home in Malibu, Calif., to kick off his first Independence Day weekend since leaving…",
    "link": "https://freerepublic.com/focus/f-chat/4326944/posts",
    "timestamp": "2025-07-05T00:23:20Z"
  },
  {
    "title": "In July 4 ceremony, Trump signs tax and spending bill into law",
    "description": "U.S. President Donald Trump signed into law a massive package of tax and spending cuts at the White House on Friday, staging an outdoor ceremony on the Fourth of July holiday that took on the air of a Trump political rally. With military jets flying overhead …",
    "link": "https://japantoday.com/category/world/in-july-4-ceremony-trump-signs-tax-and-spending-bill-into-law",
    "timestamp": "2025-07-05T00:13:24Z"
  },
  {
    "title": "'Despicable and illegal': DOJ prosecutor has 'no regrets' after firing by Trump",
    "description": "One career prosecutor at the U.S. Department of Justice (DOJ) who worked on cases involving defendants who attacked the U.S. Capitol on January 6, 2021 was recently fired by Attorney General Pam Bondi. Before leaving his position, the prosecutor wrote a scath…",
    "link": "https://www.rawstory.com/despicable-trump-no-regrets-firing/",
    "timestamp": "2025-07-05T00:08:52Z"
  },
  {
    "title": "Israeli strike kills 20 in Gaza; Trump says expects Hamas reply to truce proposal soon",
    "description": "An Israeli airstrike in Gaza resulted in at least 20 Palestinian deaths, according to local health officials. The strike targeted a tent encampment in Khan Younis and Jabalia. Amidst the violence, US President Donald Trump stated he anticipates a response fro…",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/israeli-strike-kills-20-in-gaza-trump-says-expects-hamas-reply-to-truce-proposal-soon/articleshow/122259364.cms",
    "timestamp": "2025-07-05T00:05:21Z"
  },
  {
    "title": "Vladimir Putin Abrupty Ends Public Appearance to Take Call from President Trump, Says He “Doesn’t Want to Offend Him by Keeping Him Waiting” (VIDEO)",
    "description": "The Kremlin’s Vladimir Putin cut short his public forum on July 4, 2025, all to take a call from none other than President Donald J.\nThe post Vladimir Putin Abrupty Ends Public Appearance to Take Call from President Trump, Says He “Doesn’t Want to Offend Him …",
    "link": "https://www.thegatewaypundit.com/2025/07/vladimir-putin-abrupty-ends-public-appearance-take-call/",
    "timestamp": "2025-07-05T00:00:56Z"
  },
  {
    "title": "EPA Suspends over 140 Toxic Employees Who Wrote Letter Denouncing Trump Policies",
    "description": "Team Trump's swift removal of potentially toxic bureaucrats is certainly the right move to make.\nThe post EPA Suspends over 140 Toxic Employees Who Wrote Letter Denouncing Trump Policies first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/epa-suspends-over-140-toxic-employees-who-wrote-letter-denouncing-trump-policies/",
    "timestamp": "2025-07-05T00:00:17Z"
  },
  {
    "title": "‘No trade deal under pressure of deadline’: Piyush Goyal",
    "description": "India prioritizes mutual benefits and national interests over deadlines in trade agreements, according to Minister Piyush Goyal. He emphasized fairness and a win-win approach, especially with the US, amidst looming reciprocal tariffs. While negotiations conti…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/no-trade-deal-under-pressure-of-deadline-piyush-goyal/articleshow/122256735.cms",
    "timestamp": "2025-07-05T00:00:00Z"
  },
  {
    "title": "Black New Yorkers rage over Zohran Mamdani’s ‘African American’ claim: ‘He’s a fraud’",
    "description": "Black New York isn’t buying it. A slew of black Big Apple residents fumed Friday over mayoral front-runner Zohran Mamdani’s claim on an Ivy League college application that he is African American — with them raging the socialist pol is a “fraud” and “trickster…",
    "link": "https://freerepublic.com/focus/f-chat/4326942/posts",
    "timestamp": "2025-07-04T23:54:25Z"
  },
  {
    "title": "In July 4 ceremony, Trump signs tax and spending bill into law",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump signed into law a massive package of tax and spending cuts at the White House on Friday, staging an outdoor ceremony on the Fourth of July holiday that took on the air of a Trump political rally. Read full sto…",
    "link": "https://www.thestar.com.my/news/world/2025/07/05/in-july-4-ceremony-trump-signs-tax-and-spending-bill-into-law",
    "timestamp": "2025-07-04T23:51:00Z"
  },
  {
    "title": "Migrants in US detention lose appeal against deportation to South Sudan",
    "description": "The US Supreme Court has twice upheld Donald Trump's ability to deport foreign nationals to countries outside their own.",
    "link": "https://www.aljazeera.com/news/2025/7/4/migrants-in-us-detention-lose-appeal-against-deportation-to-south-sudan",
    "timestamp": "2025-07-04T23:48:53Z"
  },
  {
    "title": "Gold gains on Trump's latest tariff salvo",
    "description": "International Business News: Gold rose - putting it on track for a 2% weekly gain - as President Donald Trump said some US trading partners would face tariffs from Aug 1. Bullion .",
    "link": "https://timesofindia.indiatimes.com/business/international-business/gold-gains-on-trumps-latest-tariff-salvo/articleshow/122259086.cms",
    "timestamp": "2025-07-04T23:46:29Z"
  },
  {
    "title": "Trump signs controversial spending bill during White House 4th of July celebrations (Reuters)",
    "description": "Reuters:\nTrump signs controversial spending bill during White House 4th of July celebrations  —  The president pushed Congress to get the bill passed before the holiday.  —  President Donald Trump presents a sweeping spending and tax legislation, known as the…",
    "link": "https://www.memeorandum.com/250704/p67",
    "timestamp": "2025-07-04T23:45:00Z"
  },
  {
    "title": "Social Security Administration sends misleading email lauding Trump's new tax cuts law",
    "description": "The Social Security Administration has sent a misleading email to beneficiaries stating President Donald Trump's sweeping tax-cuts and spending law eliminates taxes on Social Security benefits for most recipients.",
    "link": "https://www.nbcnews.com/politics/trump-administration/social-security-administration-sends-misleading-email-lauding-trumps-n-rcna216990",
    "timestamp": "2025-07-04T23:44:31Z"
  },
  {
    "title": "Now that the megabill has passed, expect a ton of short-term debt to be sold to finance the government’s deficit",
    "description": "Wall Street will be watching to see how new Treasury supply to fund the U.S. deficit will be absorbed.",
    "link": "https://www.marketwatch.com/story/now-that-the-megabill-has-passed-expect-a-ton-of-short-term-treasury-bills-to-be-auctioned-to-finance-the-governments-deficit-900681f3",
    "timestamp": "2025-07-04T23:43:00Z"
  },
  {
    "title": "Unilever pulls plug on Ben & Jerry's charity funding",
    "description": "Unilever has frozen millions in funding for the Ben & Jerry's charitable foundation, citing the foundation's refusal to provide audit documents.",
    "link": "https://www.israelnationalnews.com/news/411158",
    "timestamp": "2025-07-04T23:39:12Z"
  },
  {
    "title": "China's Trade Collapse Sparks a New Asian Power Shift--Investors Are Watching Closely",
    "description": "Vietnam and Taiwan are racing up the U.S. import charts as tariffs hammer China's dominance.",
    "link": "https://finance.yahoo.com/news/chinas-trade-collapse-sparks-asian-233739075.html",
    "timestamp": "2025-07-04T23:37:39Z"
  },
  {
    "title": "Fact check: Trump falsely claims his highly unpopular big bill is the ‘single most popular bill ever signed’",
    "description": "On Friday, before signing his massive domestic policy bill, President Donald Trump proclaimed at the White House that “it’s the most popular bill ever signed in the history of our country,” adding for emphasis that “this is the single most popular bill ever s…",
    "link": "https://www.cnn.com/2025/07/04/politics/fact-check-trump-bill-unpopular",
    "timestamp": "2025-07-04T23:31:34Z"
  },
  {
    "title": "Hamas says it has given a ‘positive’ response to the latest ceasefire proposal in Gaza",
    "description": "It's not clear if it meant Hamas accepted the proposal for a 60-day ceasefire.",
    "link": "https://www.bostonherald.com/2025/07/04/hamas-positive-response-latest-ceasefire/",
    "timestamp": "2025-07-04T23:30:03Z"
  },
  {
    "title": "US Ambassador Says ‘Win-Win’ Trade Deal With Canada Is Within Reach",
    "description": "The US ambassador to Canada gave an optimistic assessment of trade talks between the countries, playing up the odds that a fair deal will emerge soon from negotiations between Donald Trump and Mark Carney.",
    "link": "https://financialpost.com/pmn/business-pmn/us-ambassador-says-win-win-trade-deal-with-canada-is-within-reach",
    "timestamp": "2025-07-04T23:15:51Z"
  },
  {
    "title": "US debt is now $37trn – should we be worried?",
    "description": "US debt is now $37trn – should we be worried?\nAs Donald Trump cheered the passage of his self-styled, and officially named, Big Beautiful Budget Bill through Congress this week, long-sown seeds of doubt about the scale and sustainability of US borrowing from …",
    "link": "https://biztoc.com/x/9f875b5a93240725",
    "timestamp": "2025-07-04T23:12:26Z"
  },
  {
    "title": "Hamas gives 'positive' response to ceasefire proposal but asks for amendments",
    "description": "Hamas has said it has \"submitted its positive response\" to the latest proposal for a ceasefire in Gaza to mediators.",
    "link": "https://news.sky.com/story/hamas-gives-positive-response-to-ceasefire-proposal-but-asks-for-amendments-13392602",
    "timestamp": "2025-07-04T23:12:00Z"
  },
  {
    "title": "‘Our Country Is More Proud Right Now than It's Been in Many, Many Years’: Trump Hails Flyover, Military Surge, and Operation Midnight Hammer",
    "description": "Ahead of President Donald Trump’s signing ceremony for the One Big Beautiful Bill, a flyover featuring a B-2 bomber and two F-35s took place in honor of U.S. military personnel, including those involved in Operation Midnight Hammer.\nThe post ‘Our Country Is M…",
    "link": "https://www.breitbart.com/politics/2025/07/04/our-country-is-more-proud-right-now-than-its-been-in-many-many-years-trump-hails-flyover-military-surge-and-operation-midnight-hammer/",
    "timestamp": "2025-07-04T23:08:26Z"
  },
  {
    "title": "Trump Signs Big, Beautiful Bill Into Law: \"We're Back Like Nobody Thought Possible This Quickly\"",
    "description": "President Donald Trump made remarks at a White House July 4th event before signing the \"Big, Beautiful Bill\" into law.\n\nPRESIDENT DONALD TRUMP: And stick around for the fireworks. And our country's had so much to celebrate this Independence Day. As we enter o…",
    "link": "https://www.realclearpolitics.com/video/2025/07/04/trump_signs_big_beautiful_bill_into_law_were_back_like_nobody_thought_possible_this_quickly.html",
    "timestamp": "2025-07-04T23:08:00Z"
  },
  {
    "title": "Saudi FM: Gaza ceasefire top priority, not ties with Israel",
    "description": "Saudi FM Prince Faisal bin Farhan says that normalization with Israel is not Riyadh’s current focus, citing the need for an immediate ceasefire in Gaza.",
    "link": "https://www.israelnationalnews.com/news/411157",
    "timestamp": "2025-07-04T23:04:25Z"
  },
  {
    "title": "Jason Johnson: 'Authoritarian' Trump Trying to Make 'Political Opposition' Illegal",
    "description": "Political commentator Jason Johnson said Friday on MSNBC's \"Deadline\" that President Donald Trump is acting like an \"authoritarian\" by trying to make \"political opposition\" to him illegal.\nThe post Jason Johnson: ‘Authoritarian’ Trump Trying to Make ‘Politica…",
    "link": "https://www.breitbart.com/clips/2025/07/04/jason-johnson-authoritarian-trump-trying-to-make-political-opposition-illegal/",
    "timestamp": "2025-07-04T23:04:06Z"
  },
  {
    "title": "The New ‘Schlonged’: Media Claim (Again) Trump, Savior of Israel, Used Antisemitic Slur",
    "description": "The media claim that President Donald Trump — who bombed Iran’s nuclear sites and is busy deporting antisemitic foreign students — used an antisemitic slur in a speech Thursday when he referred to “shylocks.” Trump used the term in a speech to supporters in I…",
    "link": "https://freerepublic.com/focus/f-news/4326936/posts",
    "timestamp": "2025-07-04T23:03:00Z"
  },
  {
    "title": "Ken Burns Condemns Republican Plan to Defund PBS: ‘I Couldn’t Do Any of My Films Without Them’",
    "description": "The documentary filmmaker called PBS the \"Declaration of Independence applied to the communications world\" \nThe post Ken Burns Condemns Republican Plan to Defund PBS: ‘I Couldn’t Do Any of My Films Without Them’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/ken-burns-pbs-american-revolution/",
    "timestamp": "2025-07-04T23:02:53Z"
  },
  {
    "title": "Gaza: The man in the room acting as backchannel for Hamas in negotiations with US",
    "description": "Behind the efforts to secure the Gaza ceasefire and hostage release is the remarkable story of one man's unlikely involvement.",
    "link": "https://news.sky.com/story/gaza-the-man-in-the-room-acting-as-backchannel-for-hamas-in-negotiations-with-us-13390626",
    "timestamp": "2025-07-04T23:01:00Z"
  },
  {
    "title": "Hamas responds in 'positive spirit' to Gaza ceasefire proposal",
    "description": "Hamas says it has responded in \"a positive spirit\" to a US-brokered Gaza ceasefire proposal and is prepared to enter talks about implementing the deal.",
    "link": "https://www.abc.net.au/news/2025-07-05/hamas-gives-positive-response-to-gaza-ceasefire-proposal/105497768",
    "timestamp": "2025-07-04T23:00:22Z"
  },
  {
    "title": "Trump claims victory as he signs controversial budget and tax bill into law",
    "description": "The bill extends tax cuts, slices welfare programmes and surges immigration funds in a victory for Trump's agenda.",
    "link": "https://www.aljazeera.com/news/2025/7/4/trump-claims-victory-as-he-signs-controversial-budget-and-tax-bill-into-law",
    "timestamp": "2025-07-04T22:53:07Z"
  },
  {
    "title": "Controversial US budget bill is now law; here’s what it means for tech",
    "description": "US President Donald Trump today signed what he called his “One Big Beautiful Bill” during Fourth of July celebrations at the White House, after it squeaked through the House of Representatives Thursday afternoon in a 218 – 214 vote.\r\n\n\n\n\nBut the bill was miss…",
    "link": "https://www.computerworld.com/article/4017551/controversial-us-budget-bill-is-now-law-heres-what-it-means-for-tech.html",
    "timestamp": "2025-07-04T22:51:47Z"
  },
  {
    "title": "Trump signs 'big, beautiful' tax, spending bill into law",
    "description": "US President Donald Trump signed into law a massive package of tax and spending cuts at the White House during an outdoor ceremony on the Fourth of July holiday.",
    "link": "https://www.rte.ie/news/us/2025/0704/1521959-trump-bill/",
    "timestamp": "2025-07-04T22:47:20Z"
  },
  {
    "title": "Trump Administration Cuts Funding For Black Infant Health Research, Labeling It A DEI Initiative - NewsBreak",
    "description": "A study exploring why Black babies in Detroit are disproportionately born prematurely has been abruptly terminated by the NIH.",
    "link": "https://www.newsbreak.com/share/4087820406608-trump-administration-cuts-funding-for-black-infant-health-research-labeling-it-a-dei-initiative?s=a7&amp;share_destination_id=MjU2OTExNjA0LTE3NTE2Njc4MjQ1MDU%3D&amp;pd=0HNyRYcY&amp;hl=en_US&amp;send_time=1751667824&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v7%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-control",
    "timestamp": "2025-07-04T22:47:17Z"
  }
]