[
  {
    "title": "Luigi Mangione Indicted On Death Penalty-Eligible Federal Charges",
    "description": "U.S. Attorney General Pam Bondi announced this month that she had directed federal prosecutors in Manhattan to seek the death penalty.",
    "link": "https://www.huffpost.com/entry/luigi-mangione-indicted-federal-charges_n_6801834fe4b0b87197a6fba4",
    "timestamp": "2025-04-17T22:44:14Z"
  },
  {
    "title": "Activist ‘Minister’ Compares Karmelo Anthony to Kyle Rittenhouse, Daniel Penny",
    "description": "The mother of Texas teen murder suspect Karmelo Anthony broke down in tears on Thursday over the death threats she claims her family has suffered and the “false information” about the family flooding social media.Kayla Hays, the suspect’s mother, told reporte…",
    "link": "https://freerepublic.com/focus/f-news/4311667/posts",
    "timestamp": "2025-04-17T22:44:06Z"
  },
  {
    "title": "'Outlast the bully': Retired law prof vows Harvard will beat 'vindictive' Trump",
    "description": "Retired Harvard Law professor Laurence Tribe applauded his institution for standing firm in the face of President Donald Trump's efforts to shake it down on Thursday — and said Trump will lose this fight badly in court.Trump demanded that Harvard University c…",
    "link": "https://www.rawstory.com/laurence-tribe-2671795252/",
    "timestamp": "2025-04-17T22:44:03Z"
  },
  {
    "title": "Trump rolls back regulations aimed at curbing arsenic and mercury pollution",
    "description": "President Donald Trump shakes hands with coal miner Jeff Crowe during an event on energy production in the East Room of the White House, on April 8, 2025.",
    "link": "https://biztoc.com/x/06ddc9c77d8bc85f",
    "timestamp": "2025-04-17T22:43:47Z"
  },
  {
    "title": "Trump chides Italy’s Meloni over military spending",
    "description": "US President Donald Trump has said that Italy needs to radically increase its defense budget Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615917-trump-italy-meloni-nato-defense-spending/",
    "timestamp": "2025-04-17T22:41:18Z"
  },
  {
    "title": "UnitedHealthcare killing suspect Luigi Mangione indicted on death penalty-eligible charges",
    "description": "The indictment also charges Mangione with two counts of stalking and a firearms count.",
    "link": "https://www.denverpost.com/2025/04/17/unitedhealthcare-killing-death-penalty-indictment/",
    "timestamp": "2025-04-17T22:40:48Z"
  },
  {
    "title": "UnitedHealthcare killing suspect Luigi Mangione indicted on death penalty-eligible charges",
    "description": "The indictment also charges Mangione with two counts of stalking and a firearms count.",
    "link": "https://www.bostonherald.com/2025/04/17/unitedhealthcare-killing-death-penalty-indictment/",
    "timestamp": "2025-04-17T22:40:48Z"
  },
  {
    "title": "UnitedHealthcare killing suspect Luigi Mangione indicted on death penalty-eligible charges",
    "description": "Luigi Mangione was indicted Thursday on a federal murder charge in the killing of UnitedHealthcare CEO Brian Thompson, a necessary step for prosecutors to seek the death penalty.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_71c20f4c-90f6-5e42-bb01-832436cf793a.html",
    "timestamp": "2025-04-17T22:39:00Z"
  },
  {
    "title": "Trump's attacks on Powell threaten the Fed's independence. Here's why it matters",
    "description": "Donald Trump has stepped up his attacks on Federal Reserve Chair Jerome Powell at the same time that the Supreme Court is considering a case that could make it easier for the president to fire him.",
    "link": "https://www.news4jax.com/news/politics/2025/04/17/trumps-attacks-on-powell-threaten-the-feds-independence-heres-why-it-matters/",
    "timestamp": "2025-04-17T22:38:27Z"
  },
  {
    "title": "Afghan man living in Oklahoma admits to plotting Election Day ISIS terror attack",
    "description": "Abdullah Haji Zada, 18, a citizen of Afghanistan who was living in Moore, Oklahoma, pleaded guilty to knowingly receiving and conspiring to receive a firearm and ammunition to be used in a terrorist attack.",
    "link": "https://nypost.com/2025/04/17/us-news/afghan-teenager-charged-in-oklahoma-plot-for-election-day-attack-pleads-guilty/",
    "timestamp": "2025-04-17T22:37:39Z"
  },
  {
    "title": "Hillary Clinton Has Blunt Message For The American People Regarding Trump's Administration",
    "description": "The former secretary of state delivered a call-to-action to Americans.",
    "link": "https://www.huffpost.com/entry/hillary-clinton-donald-trump-message_n_68013e60e4b0b87197a6e3dd",
    "timestamp": "2025-04-17T22:36:48Z"
  },
  {
    "title": "EXCLUSIVE: Unpacking the Saks Global Plan to ‘Reset’ the Luxury Experience",
    "description": "CEO Marc Metrick discusses progress on the Saks and Neiman Marcus integration at Saks Global, what lies ahead there, and dealing with issues surrounding vendors, tariffs and macro uncertainties.",
    "link": "http://wwd.com/business-news/retail/dissecting-the-saks-global-plan-to-reset-luxury-retail-1237091657/",
    "timestamp": "2025-04-17T22:35:38Z"
  },
  {
    "title": "Ukraine and US sign memorandum on minerals deal, Kyiv says",
    "description": "Ukraine offiical Yulia Svyrydenko did not publish details of the memorandum, says work continues towards securing deal.",
    "link": "https://www.aljazeera.com/news/2025/4/17/ukraine-and-us-sign-memorandum-on-minerals-deal-kyiv-says",
    "timestamp": "2025-04-17T22:32:19Z"
  },
  {
    "title": "FIRST READING: The weird minutia you missed from the French leaders' debate",
    "description": "From Poilievre's weak attempts at humour and Blanchet's gunslinger stance to Carney's use of obscure French words.",
    "link": "https://nationalpost.com/opinion/first-reading-the-weird-minutia-you-missed-from-the-french-leaders-debate",
    "timestamp": "2025-04-17T22:30:36Z"
  },
  {
    "title": "US-Ukraine mineral deal is back on, to be signed next week, Trump says",
    "description": "Treasury Secretary Scott Bessent told reporters the reported arrangement is \"substantially what we agreed upon previously.\"",
    "link": "https://nypost.com/2025/04/17/world-news/us-ukraine-mineral-deal-is-back-on-to-be-signed-next-week-trump-says/",
    "timestamp": "2025-04-17T22:30:29Z"
  },
  {
    "title": "Is Israel Preparing for a Long-term Occupation of Gaza?",
    "description": "Palestinian American peace activist Ahmed Fouad Alkhatib discusses where he thinks the war is heading.",
    "link": "http://foreignpolicy.com/2025/04/17/israel-gaza-war-hamas-cease-fire-occupation-annexation/",
    "timestamp": "2025-04-17T22:30:19Z"
  },
  {
    "title": "Trade war heats up: Which ASX ETFs are most exposed to China?",
    "description": "These China-focused funds could be in the firing line. \nThe post Trade war heats up: Which ASX ETFs are most exposed to China? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/18/trade-war-heats-up-which-asx-etfs-are-most-exposed-to-china/",
    "timestamp": "2025-04-17T22:30:00Z"
  },
  {
    "title": "Silicon Valley got Trump completely wrong",
    "description": "Last year, a coterie of tech billionaires rallied behind Donald Trump’s candidacy. Many had not been lifelong Republicans. In 2016, the venture capitalist Marc Andreessen declared Hillary Clinton the “obvious choice” for president, saying Trump’s immigration …",
    "link": "https://www.vox.com/technology/409256/trump-tariffs-student-visas-andreessen-horowitz",
    "timestamp": "2025-04-17T22:29:50Z"
  },
  {
    "title": "Former Pentagon spokesman tied to online DEI purge was asked to resign, official says",
    "description": "John Ullyot’s departure is the fourth this week among Hegseth’s former inner circle.",
    "link": "https://www.bostonherald.com/2025/04/17/pentagon-spokesman-ousted/",
    "timestamp": "2025-04-17T22:29:02Z"
  },
  {
    "title": "Rosie O'Donnell Reveals Her Therapist Helped Plan Her Move from America; Fears Her Irish Citizenship Application May Be in Jeopardy",
    "description": "Rosie O'Donnell said she never thought President Donald Trump would win another election, and lamented over her Irish citizenship application having not yet been approved.\nThe post Rosie O’Donnell Reveals Her Therapist Helped Plan Her Move from America; Fears…",
    "link": "https://www.breitbart.com/entertainment/2025/04/17/rosie-odonnell-reveals-her-therapist-helped-plan-her-move-from-america-fears-her-irish-citizenship-application-may-be-in-jeopardy/",
    "timestamp": "2025-04-17T22:24:40Z"
  },
  {
    "title": "Italy's prime minister meets with Trump to discuss tariffs on EU",
    "description": "Italy's Prime Minister Giorgia Meloni met with President Donald Trump at the White House to discuss a potential trade deal amid tensions over tariffs.",
    "link": "https://www.wdsu.com/article/italy-prime-minister-us-meeting/64516153",
    "timestamp": "2025-04-17T22:24:09Z"
  },
  {
    "title": "Trump claims he can fire Federal Reserve chair 'if I want him out'",
    "description": "U.S. President Donald Trump attacked U.S. Federal Reserve Chair Jerome Powell on Thursday for not cutting interest rates and said he could fire him if he wanted to, renewing a threat from his first term that could cause a major legal showdown over the issue o…",
    "link": "https://www.cbc.ca/news/world/trump-federal-reserve-chair-powell-threat-1.7513538",
    "timestamp": "2025-04-17T22:23:18Z"
  },
  {
    "title": "U.S. action led to reopening of Toronto-listed company’s tin mine in Congo, Trump adviser says",
    "description": "The Trump administration obtained help from Rwanda to secure a rebel retreat and allow Toronto-listed Alphamin Resources Corp. AFM-X to reopen a shuttered tin mine in eastern Congo, a U.S. official says.\nMassad Boulos, senior Africa adviser to President Donal…",
    "link": "https://biztoc.com/x/d3de6a7d5947e452",
    "timestamp": "2025-04-17T22:21:32Z"
  },
  {
    "title": "Sen. Warren: Tariff Authority Vote Will Be Crack In The Wall",
    "description": "Liz Warren was describing how Democrats plan to box in Republicans on the tariffs by using a vote on the emergency authority for Trump's tariffs -- which, as she points out, is supposed to be with Congress.\n\"Well, the power he's using is an emergency authorit…",
    "link": "https://crooksandliars.com/2025/04/sen-warren-tariff-authority-vote-will-be",
    "timestamp": "2025-04-17T22:21:17Z"
  },
  {
    "title": "Supreme Court poised to make major decision that could set limits on the power of district judges",
    "description": "The Supreme Court has agreed to examine the Trump administration’s challenge to judges issuing nationwide injunctions.",
    "link": "https://www.foxnews.com/politics/supreme-court-poised-make-major-decision-limits-power-district-judges",
    "timestamp": "2025-04-17T22:20:51Z"
  },
  {
    "title": "Feds confirm illegal alien Dems want returned was suspected of human trafficking",
    "description": "DHS documents also show gang affiliation, accusations of domestic abuse",
    "link": "https://www.wnd.com/2025/04/feds-confirm-illegal-alien-dems-want-returned-was-suspected-of-human-trafficking/",
    "timestamp": "2025-04-17T22:20:00Z"
  },
  {
    "title": "Trump Media Calls for SEC to Investigate 'Suspicious' Trading of DJT Stock",
    "description": "Truth Social parent company Trump Media & Technology Group alleged that UK-based Qube might be shorting DJT stock without disclosing its positions properly.",
    "link": "https://decrypt.co/315309/trump-media-sec-investigate-suspicious-trading",
    "timestamp": "2025-04-17T22:18:51Z"
  },
  {
    "title": "Trump Says US \"Talking\" To China On Tariffs",
    "description": "President Donald Trump said Thursday that the United States was in talks with China on tariffs, adding that he was confident the world&#039;s largest economies could make a deal to end a bitter trade war.",
    "link": "https://www.ndtv.com/world-news/trump-says-us-talking-to-china-on-tariffs-8191868",
    "timestamp": "2025-04-17T22:17:55Z"
  },
  {
    "title": "Trade wars already looming large in NC's 26 US Senate race",
    "description": "Senator Tillis joined a bipartisan group of senators, which included seven Republicans, that sponsored a bill to require the White House give Congress two days prior notice, including detailed justification, before implementing any new tariffs.",
    "link": "https://www.ncspin.com/trade-wars-already-looming-large-in-ncs-26-us-senate-race",
    "timestamp": "2025-04-17T22:16:59Z"
  },
  {
    "title": "'True recklessness': Boston-born attorney stunned as Trump admin. orders her to leave US",
    "description": "An Arizona immigration attorney who was born in Boston and is an American citizen expressed astonishment after receiving a letter from the Department of Homeland Security telling her she must leave the United States.Pamela Rioles Saeed told KNXV-TV she receiv…",
    "link": "https://www.rawstory.com/trump-immigration-2671795416/",
    "timestamp": "2025-04-17T22:14:50Z"
  },
  {
    "title": "U.S Chamber of Commerce Decides Not to Join any Lawsuits Over Trump Tariffs",
    "description": "The U.S. Chamber of Commerce has decided against joining any lawsuits targeting the tariffs put into place by President Trump, Commerce Secretary Lutnick and the National Economic Council. This is quite a new shift in tone from the generally hostile CoC.In th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311659/posts",
    "timestamp": "2025-04-17T22:14:17Z"
  },
  {
    "title": "U.S Chamber of Commerce Decides Not to Join any Lawsuits Over Trump Tariffs",
    "description": "The U.S. Chamber of Commerce has decided against joining any lawsuits targeting the tariffs put into place by President Trump, Commerce Secretary Lutnick and the National Economic Council. This is quite a new shift in tone from the generally hostile CoC.In th…",
    "link": "https://freerepublic.com/focus/f-news/4311659/posts",
    "timestamp": "2025-04-17T22:14:17Z"
  },
  {
    "title": "Trump: Harvard is a disgrace, they're obviously antisemitic",
    "description": "US President calls Harvard a “disgrace” and “antisemitic,” warns the university’s tax-exempt status is under legal scrutiny.",
    "link": "https://www.israelnationalnews.com/news/407003",
    "timestamp": "2025-04-17T22:11:00Z"
  },
  {
    "title": "NBA legend Kareem Abdul-Jabbar rips Trump's DEI policies on Jackie Robinson Day: 'Ruse to discriminate'",
    "description": "NBA great Kareem Abdul-Jabbar call out President Trump for his DEI policies during his speech at Dodger Stadium on Jackie Robinson Day.",
    "link": "https://www.foxnews.com/sports/nba-legend-kareem-abdul-jabbar-rips-trumps-dei-policies-jackie-robinson-day-ruse-discriminate",
    "timestamp": "2025-04-17T22:10:33Z"
  },
  {
    "title": "Trump Media urges regulators to investigate hedge fund's vast bet against stock (The Guardian)",
    "description": "The Guardian:\nTrump Media urges regulators to investigate hedge fund's vast bet against stock  —  Company behind Truth Social accuses London-based hedge fund Qube of alleged ‘suspicious trading activity’  —  Callum Jones in New York and Joanna Partridge in Lo…",
    "link": "https://www.memeorandum.com/250417/p128",
    "timestamp": "2025-04-17T22:10:00Z"
  },
  {
    "title": "Baht likely to surpass 33 to dollar in Q2",
    "description": "<p>The baht could appreciate past the key psychological level of 33 to the dollar in the second quarter after the currency strengthened to a six-month high yesterday, amid the intensifying US-China trade war, says Kasikorn Research Center (K-Research).</p>",
    "link": "https://www.bangkokpost.com/business/general/3005547/baht-likely-to-surpass-33-to-dollar-in-q2",
    "timestamp": "2025-04-17T22:10:00Z"
  },
  {
    "title": "Hundreds of universities defy Trump order to stop promoting discrimination",
    "description": "DEI agendas still found in law schools, colleges of education, engineering, nursing, more",
    "link": "https://www.wnd.com/2025/04/hundreds-of-universities-defy-trump-order-to-stop-promoting-discrimination/",
    "timestamp": "2025-04-17T22:09:38Z"
  },
  {
    "title": "How Trump has paved the way for new GOP policy fights: From the Politics Desk",
    "description": "Trump has paved the way for a sprawling, animated and consequential set of policy fights within the Republican Party over taxes, tariffs and more.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-paved-way-new-gop-policy-fights-politics-desk-rcna201814",
    "timestamp": "2025-04-17T22:09:08Z"
  },
  {
    "title": "University protests blast Trump’s attacks on funding, speech and international students",
    "description": "The protests were organized by the Coalition for Action in Higher Education.",
    "link": "https://www.bostonherald.com/2025/04/17/education-day-of-action/",
    "timestamp": "2025-04-17T22:07:39Z"
  },
  {
    "title": "Don Jr. And Eric Trump Landed $3 Million In Stock For Joining Firm’s Advisory Board That Had Little Public Presence Before Their Appointment",
    "description": "New SEC filings show the Trumps were granted 750,000 shares for joining the advisory board and helping the stock reach a 52-week high.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/04/17/donald-trump-eric-dominari-holdings-advisory-board-3-million-stock/",
    "timestamp": "2025-04-17T22:07:32Z"
  },
  {
    "title": "Associated Press Is Expected To Receive A Spot In Print Pool By Sunday, White House Official Says In Court Filing",
    "description": "An Associated Press print reporter is expected to have a spot in the White House pool by Sunday, following a court order to end Donald Trump’s ban on the wire service for failing to conform to his renaming of the Gulf of Mexico, an administration official sai…",
    "link": "http://deadline.com/2025/04/trump-associated-press-gulf-of-mexico-3-1236371333/",
    "timestamp": "2025-04-17T22:06:59Z"
  },
  {
    "title": "Steve Bannon Rips Netanyahu’s ‘Arrogance’ For Trying to ‘Force the Issue’ With Trump And Bomb Iran",
    "description": "\"They're trying to say, hey, we have these battle plans ready to go and we've knocked their air defenses out and we have to go.\"\nThe post Steve Bannon Rips Netanyahu’s ‘Arrogance’ For Trying to ‘Force the Issue’ With Trump And Bomb Iran first appeared on Medi…",
    "link": "https://www.mediaite.com/politics/steve-bannon-rips-netanyahus-arrogance-for-trying-to-force-the-issue-with-trump-and-bomb-iran/",
    "timestamp": "2025-04-17T22:04:54Z"
  },
  {
    "title": "Trump rolls back regulations aimed at curbing arsenic and mercury pollution",
    "description": "Trump’s deregulatory agenda is putting Americans at risk and completely trampling on his vow to “Make America Healthy Again.”",
    "link": "https://www.msnbc.com/top-stories/latest/trump-coal-plants-mercury-arsenic-regulation-rcna201798",
    "timestamp": "2025-04-17T22:04:47Z"
  },
  {
    "title": "Cannabis Industry Cautiously Optimistic It Won't Be Burned By Trump",
    "description": "Many marijuana business insiders think that the industry is too big to roll back.",
    "link": "https://www.huffpost.com/entry/cannabis-industry-420-trump_n_68014b05e4b0b87197a6ec63",
    "timestamp": "2025-04-17T22:04:19Z"
  },
  {
    "title": "Trump vs. the Fed, briefly explained",
    "description": "This story appeared in the Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: Today I want to add a little perspective to President …",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/409383/trump-vs-the-fed-briefly-explained",
    "timestamp": "2025-04-17T22:04:16Z"
  },
  {
    "title": "Nearly 90% of Consumer Financial Protection Bureau Cut",
    "description": "“President Donald Trump is drastically shrinking the size and the mission of the Consumer Financial Protection Bureau, the latest step in an extraordinary reshaping of the federal government,” the AP reports. “Roughly 1,500 employees will",
    "link": "https://politicalwire.com/2025/04/17/nearly-90-of-consumer-financial-protection-bureau-cut/",
    "timestamp": "2025-04-17T22:03:07Z"
  },
  {
    "title": "Trump teases date for 'even more important' second UK state visit",
    "description": "Donald Trump has said his second state visit to the UK could take place in September.",
    "link": "https://news.sky.com/story/donald-trump-says-second-uk-state-visit-could-happen-in-september-13350897",
    "timestamp": "2025-04-17T22:01:00Z"
  },
  {
    "title": "What Trump’s Executive Order Could Mean For Healthcare",
    "description": "Trump's EO is ambitious in scope, and highlights actions taken during his first administration that were aimed at reducing the cost of prescription drugs.",
    "link": "https://www.forbes.com/sites/ritanumerof/2025/04/17/what-trumps-executive-order-could-mean-for-healthcare/",
    "timestamp": "2025-04-17T22:00:44Z"
  },
  {
    "title": "Donald Trump, You Will Not Erase Us",
    "description": "by James E. Garcia, Arizona Mirror April 9, 2025\nIf there’s a through line to the first months of Trump 2.0 it’s the president’s penchant for trying to disappear his critics, enemies and the fast-multiplying targets of his disdain.\nIt’s classic authoritarian …",
    "link": "https://crooksandliars.com/2025/04/donald-trump-you-will-not-erase-us",
    "timestamp": "2025-04-17T22:00:01Z"
  },
  {
    "title": "Commentary: The US-China trade war is a huge game of chicken - who will blink first?",
    "description": "While Donald Trump threatens more tariffs and Xi Jinping turns on the charm, Southeast Asian nations will have to navigate between the two while preserving as much autonomy as possible, says Enodo Economics’ Diana Choyleva.",
    "link": "https://www.channelnewsasia.com/commentary/china-us-winning-trade-war-xi-trump-tariff-5072416",
    "timestamp": "2025-04-17T22:00:00Z"
  },
  {
    "title": "Pete Buttigieg warns of ‘dangerous moment’ as Trump defies courts and threatens to disappear U.S. citizens",
    "description": "Pete Buttigieg is raising the alarm about what he calls a “dangerous moment” for democracy, warning that President Donald Trump’s defiance of court orders and targeting of migrants without due process threatens the rule of law in America.",
    "link": "https://www.advocate.com/politics/pete-buttigieg-warns-trump-lawlessness",
    "timestamp": "2025-04-17T21:59:53Z"
  },
  {
    "title": "Appeals court backs judge in Abrego Garcia case, saying Trump DOJ ‘would reduce the rule of law to lawlessness’",
    "description": "A federal appeals court rejected the Trump administration’s request that it halt the next steps Judge Paula Xinis is seeking to take in the case concerning a migrant who was wrongly deported to El Salvador, with a strident warning about the rule of law and th…",
    "link": "https://freerepublic.com/focus/f-news/4311655/posts",
    "timestamp": "2025-04-17T21:59:46Z"
  },
  {
    "title": "Trump’s trade policies threaten to strengthen China, not weaken it",
    "description": "President Donald Trump stands in the presidential box as he tours the John F. Kennedy Center for the Performing Arts in Washington, on March 17, 2025.",
    "link": "https://biztoc.com/x/94476fe65e226ae6",
    "timestamp": "2025-04-17T21:59:23Z"
  },
  {
    "title": "IRS decision on Harvard's tax-exempt status could come in days: Sources",
    "description": "The IRS is considering revoking Harvard University’s tax-exempt status and a decision could be made in the coming days, sources told ABC News on Thursday.",
    "link": "https://abcnews.go.com/Politics/irs-decision-harvards-tax-exempt-status-days-sources/story?id=120924793",
    "timestamp": "2025-04-17T21:57:12Z"
  },
  {
    "title": "Federal Appeals Court Rejects Trump Administration's Attempt To Block Return of Kilmar Abrego Garcia",
    "description": "\"This should be shocking not only to judges, but to the intuitive sense of liberty that Americans far removed from courthouses still hold dear,\" Judge J. Harvie Wilkinson warned.",
    "link": "https://reason.com/2025/04/17/federal-appeals-court-rejects-trump-administrations-attempt-to-block-return-of-kilmar-abrego-garcia/",
    "timestamp": "2025-04-17T21:56:06Z"
  },
  {
    "title": "‘I Love it!’ Trump Celebrates After Being Officially Designated as ‘Royalty’ in American Samoa",
    "description": "President Donald Trump reacted warmly on Thursday in the Oval Office after he was officially declared “royalty” in the US territory of American Samoa. After Trump signed an executive order on “Unleashing American Commercial Fishing in the Pacific,” a delegati…",
    "link": "https://www.mediaite.com/trump/i-love-it-trump-celebrates-after-being-officially-designated-as-royalty-in-american-samoa/",
    "timestamp": "2025-04-17T21:54:42Z"
  },
  {
    "title": "Law Enforcement Rallies Around Virginia Sheriff Caught in Sting Operation After Defying Democrats",
    "description": "A former sheriff, out of money to appeal a conviction in a federal bribery case, faces 10 years in jail and is throwing, in the... Read More\nThe post Law Enforcement Rallies Around Virginia Sheriff Caught in Sting Operation After Defying Democrats appeared fi…",
    "link": "https://www.dailysignal.com/2025/04/17/law-enforcement-rallies-around-virginia-sheriff-caught-sting-operation-defying-democrats/",
    "timestamp": "2025-04-17T21:53:48Z"
  },
  {
    "title": "Bonds struggle since ‘liberation day’ tariffs, but Fed is in no rush to cut rates",
    "description": "The U.S. bond market has been in rough patch since President Donald Trump announced “Liberation Day” tariffs.",
    "link": "https://www.marketwatch.com/story/bonds-struggle-since-liberation-day-tariffs-but-fed-is-in-no-rush-to-cut-rates-0a3750c3",
    "timestamp": "2025-04-17T21:51:00Z"
  },
  {
    "title": "Europe Pushes U.S. to Take Tougher Stance on Russia",
    "description": "U.S., French, and Ukrainian officials meet in Paris for discussions on how to end the Russia-Ukraine war.",
    "link": "http://foreignpolicy.com/2025/04/17/russia-ukraine-war-paris-macron-rubio-witkoff/",
    "timestamp": "2025-04-17T21:50:32Z"
  },
  {
    "title": "White House memo outlines plans to eliminate dozens of federal health programs - NewsBreak",
    "description": "The Trump administration is proposing to cut the federal health budget by 40%, eliminate dozens of programs, and restructure health agencies into a new ent",
    "link": "https://www.newsbreak.com/share/3966570979437-white-house-memo-outlines-plans-to-eliminate-dozens-of-federal-health-programs?s=a2&share_destination_id=MjAxMzI2MDQzLTE3NDQ5MjY1MzczNDk%3D&pd=0Dck6FDg&hl=en_US&send_time=1744926537&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.16.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v1%2Cns_foryou_recall_exp_25q2-control%2Cns_local_strategy_25q1_exp-v10%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_model_exp_25q1-v9",
    "timestamp": "2025-04-17T21:50:21Z"
  },
  {
    "title": "Italian PM Meloni to Trump: We Can 'Make the West Great Again'",
    "description": "Italy's populist prime minister, Giorgia Meloni, told President Donald Trump on Thursday that she believes, together, they can \"make the West great again.\"\nThe post Italian PM Meloni to Trump: We Can ‘Make the West Great Again’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/17/italian-pm-meloni-to-trump-we-can-make-the-west-great-again/",
    "timestamp": "2025-04-17T21:49:49Z"
  },
  {
    "title": "Meet Xi’s Puppet, Mustachio! Tom Friedman Simps for the Chi-Coms to Get Trump … Again",
    "description": "The New York Times’s mustachioed “China for a Day” propagandist Thomas Friedman is having a nervous breakdown because President Donald Trump isn’t a climate change nut like he is. And true-to-form, he’s simping for the Chi-Coms to get Trump… Again. “I Have Ne…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311653/posts",
    "timestamp": "2025-04-17T21:49:48Z"
  },
  {
    "title": "Bitcoin in Standstill at $85K as Trump Increases Pressure on Fed's Powell",
    "description": "was treading water just below $85,000 late Thursday as tensions between U.S. President Donald Trump and Federal Reserve Chair Jerome Powell added another layer of uncertainty for investors.\nMarkets dipped on Wednesday after hawkish comments from Powell, who c…",
    "link": "https://biztoc.com/x/93f9db871b435d2d",
    "timestamp": "2025-04-17T21:48:17Z"
  },
  {
    "title": "TRUMP token slides ahead of massive unlock",
    "description": "This is a segment from the Lightspeed newsletter. To read full editions, subscribe.\nIt’s a good old Trump and dump.\nTokens worth 20% of the current supply of the TRUMP memecoin launched by Donald Trump are set to be unlocked tomorrow, according to data from T…",
    "link": "https://biztoc.com/x/5a751d7ee4c780f6",
    "timestamp": "2025-04-17T21:48:13Z"
  },
  {
    "title": "Here’s How Tim Cook Convinced Trump to Exempt Apple From His Heavy Tariffs",
    "description": "When United States President Donald Trump hit goods imported from China with a 145% tariff, Apple CEO Tim Cook Sprung into action.Read More...",
    "link": "https://www.mactrast.com/2025/04/heres-how-tim-cook-convinced-trump-to-give-apple-exemptions-from-his-tariffs/",
    "timestamp": "2025-04-17T21:48:00Z"
  },
  {
    "title": "U.S. tariffs will weaken global economy and trigger inflation but not a global recession, IMF says",
    "description": "Surging U.S. tariffs will weaken the global economy and push up inflation this year, according to projections to be released next week by the International Monetary Fund. The IMF’s Managing Director, Kristalina Georgieva, said Thursday that the Trump administ…",
    "link": "https://japantoday.com/category/business/us-tariffs-will-weaken-global-economy-and-trigger-inflation-but-not-a-global-recession-imf-says",
    "timestamp": "2025-04-17T21:47:41Z"
  },
  {
    "title": "Hermes to hike U.S. prices to offset tariff impact",
    "description": "French luxury group Hermes said Thursday it would hike its prices in the United States to offset the impact of 10-percent import tariffs imposed by President Donald Trump. Famous for its Birkin handbag, silk scarves and leather goods, the increases would take…",
    "link": "https://japantoday.com/category/business/hermes-to-hike-us-prices-to-offset-tariff-impact",
    "timestamp": "2025-04-17T21:47:32Z"
  },
  {
    "title": "America's Mad King (Peter Wehner/The Atlantic)",
    "description": "Peter Wehner / The Atlantic:\nAmerica's Mad King … Last monday, Donald Trump, seeking to fortify public support for his massive, across-the-board tariffs, posted: “The United States has a chance to do something that should have been done DECADES AGO.  Don't be…",
    "link": "https://www.memeorandum.com/250417/p126",
    "timestamp": "2025-04-17T21:45:00Z"
  },
  {
    "title": "Japan 'deeply concerned' about global economic fallout from Trump's trade tariffs: Kato",
    "description": "Japan is &quot;deeply concerned&quot; about global economic fallout from U.S. President Donald Trump's trade tariffs, Finance Minister Katsunobu Kato said on Thursday in the government's strongest warning yet as the two nations began trade talks. In an interv…",
    "link": "https://japantoday.com/category/politics/exclusive-japan-finance-minister-%27deeply-concerned%27-over-trump-tariff-impact",
    "timestamp": "2025-04-17T21:44:09Z"
  },
  {
    "title": "Trump says Federal Reserve Chair Powell’s 'termination cannot come fast enough'",
    "description": "President Donald Trump slammed Federal Reserve Chair Jerome Powell on Thursday, reiterating his frustration that the Fed has not aggressively cut interest rates and saying that the central bank leader's &quot;termination cannot come fast enough.” Trump hinted…",
    "link": "https://japantoday.com/category/world/trump-says-federal-reserve-chair-powell%E2%80%99s-%27termination-cannot-come-fast-enough%27",
    "timestamp": "2025-04-17T21:43:42Z"
  },
  {
    "title": "Donald Trump suggests UK state visit set for September",
    "description": "Earlier this year, King Charles III invited Donald Trump for an unprecedented second state visit.",
    "link": "https://www.bbc.co.uk/news/articles/cp8k5n33y41o",
    "timestamp": "2025-04-17T21:43:26Z"
  },
  {
    "title": "Trump suggests UK state visit set for September",
    "description": "Earlier this year, King Charles III invited Donald Trump for an unprecedented second state visit.",
    "link": "https://www.bbc.com/news/articles/cp8k5n33y41o",
    "timestamp": "2025-04-17T21:43:26Z"
  },
  {
    "title": "Supreme Court to hear Trump bid to enforce birthright citizenship order",
    "description": "The U.S. Supreme Court said on Thursday it will hear arguments next month over Donald Trump's bid to broadly enforce his executive order to restrict automatic birthright citizenship, a key pillar of the Republican president's hardline approach toward immigrat…",
    "link": "https://japantoday.com/category/world/us-supreme-court-to-hear-trump-bid-to-enforce-birthright-citizenship-order",
    "timestamp": "2025-04-17T21:43:13Z"
  },
  {
    "title": "Judges warn Trump risks public perception of lawlessness in his fight with courts",
    "description": "A U.S. appeals court urged the Trump administration on Thursday to back off from its escalating confrontation with the judiciary, warning that both the executive and judicial branches risk losing public confidence. In a strongly worded unanimous opinion, a th…",
    "link": "https://japantoday.com/category/world/judges-warn-trump-risks-public-perception-of-lawlessness-in-his-fight-with-courts2",
    "timestamp": "2025-04-17T21:42:58Z"
  },
  {
    "title": "Russia strikes Ukrainian city of Dnipro as Kyiv seeks security pledges in Paris",
    "description": "Russian forces launched a massive drone attack on the southeastern Ukrainian city of Dnipro, killing three people, including a child, and wounding dozens, officials said Thursday. The strike late Wednesday was the latest in a string of Russian attacks that ha…",
    "link": "https://japantoday.com/category/world/russia-strikes-ukrainian-city-of-dnipro-as-kyiv-seeks-security-pledges-in-paris",
    "timestamp": "2025-04-17T21:42:51Z"
  },
  {
    "title": "US manufacturing surge: Foxconn's NAM board role amplifies strategic ambitions",
    "description": "US President Donald Trump has introduced a series of policies designed to revitalize American manufacturing and attract industries such as semiconductors to return to the US. While Taiwanese manufacturers have long pursued global diversification, recent polic…",
    "link": "https://www.digitimes.com/news/a20250416PD216/foxconn-usa-manufacturing-policy.html",
    "timestamp": "2025-04-17T21:42:37Z"
  },
  {
    "title": "Trump says he's in 'no rush' to end tariffs as he meets with Italy's Meloni",
    "description": "President Donald Trump said Thursday he is in “no rush” to reach any trade deals because he views tariffs as making the United States wealthy. But he suggested while meeting with Italian Premier Giorgia Meloni that it would be easy to find an agreement with t…",
    "link": "https://japantoday.com/category/world/Trump-says-he%27s-in-%27no-rush%27-to-end-tariffs-as-he-meets-with-Italy%27s-Meloni",
    "timestamp": "2025-04-17T21:42:24Z"
  },
  {
    "title": "2 killed, at least 6 wounded in shooting at Florida State University",
    "description": "A gunman opened fire Thursday at Florida State University, killing two people and wounded at least six others, police said. The 20-year-old gunman is the son of a sheriff’s deputy whose former service weapon was used in the shooting, authorities said. The two…",
    "link": "https://japantoday.com/category/world/2-killed-at-least-6-wounded-in-shooting-at-Florida-State-University",
    "timestamp": "2025-04-17T21:42:16Z"
  },
  {
    "title": "Trump Says Set To Visit UK's King Charles in September",
    "description": "US President Donald Trump said Thursday he expected to meet King Charles III in Britain in September, on an unprecedented second state visit that London hopes will boost transatlantic ties.",
    "link": "https://www.ndtv.com/world-news/trump-says-set-to-visit-uks-king-charles-in-september-8191752",
    "timestamp": "2025-04-17T21:42:10Z"
  },
  {
    "title": "‘We’re all afraid’: Sen. Lisa Murkowski says GOP fears retaliation if they cross Trump",
    "description": "Moderate Alaska Sen. Lisa Murkowski made a chilling admission this week that she and other lawmakers are worried are retaliation for speaking out against some of the Trump administration's policies.",
    "link": "https://nypost.com/2025/04/17/us-news/were-all-afraid-sen-lisa-murkowski-says-gop-fears-retaliation-if-they-cross-trump/",
    "timestamp": "2025-04-17T21:42:04Z"
  },
  {
    "title": "Science caught in crossfire of Trump's fight with universities",
    "description": "Harvard scientist Dr. Donald Ingber, who works where medicine and engineering meet, saw federal funding for some of his projects frozen this week as his university clashed with the administration of U.S. President Donald Trump. While Trump and his advisers po…",
    "link": "https://japantoday.com/category/features/opinions/science-caught-in-crossfire-of-trump%27s-fight-with-universities",
    "timestamp": "2025-04-17T21:39:20Z"
  },
  {
    "title": "2 killed, at least 5 wounded in mass shooting at Florida State University",
    "description": "The 20-year-old gunman was the son of a sheriff's deputy whose former service weapon was used in the shooting, authorities said.",
    "link": "https://www.cbc.ca/news/world/florida-state-shooting-1.7513544",
    "timestamp": "2025-04-17T21:39:01Z"
  },
  {
    "title": "Denver’s investment in the new soccer stadium will help South Broadway (Letters)",
    "description": "\"We’re thrilled the team is spending its own money on a stadium. But we do expect the city to invest to get this right too, and ensure the site is connected to the surrounding area for a year-round attraction.\" -- Victor Ayala, Denver",
    "link": "https://www.denverpost.com/2025/04/17/denver-womens-soccer-stadium-nwsl-neighborhood/",
    "timestamp": "2025-04-17T21:38:03Z"
  },
  {
    "title": "About $300 million in Trump meme coins unlock Thursday — with the crypto down 90% from its all-time high",
    "description": "President Donald Trump’s namesake meme coin traded lower on Thursday, when 40 million of the tokens — recently worth about $300 million — are scheduled to be unlocked, giving the owners of the cryptocurrency the ability to sell it for the first time since it …",
    "link": "https://biztoc.com/x/55f2f99b71a2b584",
    "timestamp": "2025-04-17T21:37:58Z"
  },
  {
    "title": "Trump Station? Feds take control of Penn Station rebuild, kick MTA off the project",
    "description": "President Donald Trump is taking over the reconstruction of Penn Station and kicking the MTA off the project, federal transportation officials announced Thursday.\nThe move was laid out in a letter to MTA Chair Janno Lieber from Federal Railroad Administration…",
    "link": "https://biztoc.com/x/53b431dd7b80051c",
    "timestamp": "2025-04-17T21:37:39Z"
  },
  {
    "title": "EXCLUSIVE: Trump’s Broad Ban On Risky Gain-Of-Function Research Nears Completion",
    "description": "'If not stopped, gain-of-function research on potential pandemic pathogens likely will cause future lab-generated pandemics'",
    "link": "https://dailycaller.com/2025/04/17/trump-executive-order-broad-ban-gain-of-function-research/",
    "timestamp": "2025-04-17T21:33:01Z"
  },
  {
    "title": "Trump says US ‘talking’ to China on tariffs",
    "description": "President Donald Trump said Thursday that the United States was in talks with China on tariffs, adding that he was confident the world’s largest economies could make a deal to end a bitter trade war. “Yeah, we’re talking to China,” Trump told reporters in the…",
    "link": "https://www.digitaljournal.com/world/trump-says-us-talking-to-china-on-tariffs/article",
    "timestamp": "2025-04-17T21:32:34Z"
  },
  {
    "title": "Trump Distances Himself From Abrego Garcia’s Imprisonment: ‘I’m Not Involved In It’",
    "description": "“Well, I'm not involved in it... I've heard many things about him, and we'll have to find out what the truth is,” Trump told reporters\nThe post Trump Distances Himself From Abrego Garcia’s Imprisonment: ‘I’m Not Involved In It’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-distances-his-himself-from-abrego-garcias-imprisonment-im-not-involved-in-it/",
    "timestamp": "2025-04-17T21:32:31Z"
  },
  {
    "title": "Can the IRS revoke Harvard’s tax-exempt status?",
    "description": "For over a century, the majority of colleges and universities have not paid most taxes.",
    "link": "https://www.bostonherald.com/2025/04/17/irs-harvard-tax-exempt-status/",
    "timestamp": "2025-04-17T21:32:11Z"
  },
  {
    "title": "Italy's Meloni says Trump will visit Rome and consider meeting EU",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump has agreed to an official visit to Rome and will consider also meeting representatives of the European Union while there, Italy's Prime Minister Giorgia Meloni said on Thursday in the Oval Office. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/04/18/italy039s-meloni-says-trump-will-visit-rome-and-consider-meeting-eu",
    "timestamp": "2025-04-17T21:32:00Z"
  },
  {
    "title": "Biden’s Social Security Spin",
    "description": "In his first speech since leaving office, former President Joe Biden criticized the Trump administration's staffing cuts and other changes at the Social Security Administration, but he made several misleading claims in the process.\nThe post Biden’s Social Sec…",
    "link": "https://www.factcheck.org/2025/04/bidens-social-security-spin/",
    "timestamp": "2025-04-17T21:31:55Z"
  },
  {
    "title": "Kimmel Jokes Elon Musk Loves Having Babies So Much, He Spent $300 Million to Get One in the White House | Video",
    "description": "The late night host riffs on rumors that the tech billionaire has fathered dozens of unknown children\nThe post Kimmel Jokes Elon Musk Loves Having Babies So Much, He Spent $300 Million to Get One in the White House | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/kimmel-elon-musk-baby-rumors-trump-white-house-joke-abc/",
    "timestamp": "2025-04-17T21:31:13Z"
  },
  {
    "title": "Trump Station? Feds take control of Penn Station rebuild, kick MTA off the project",
    "description": "The Trump administration is taking control of the Penn Station reconstruction.\n \n\nThe reconstruction of the troubled Midtown train hub will be led by the federal government, not the state-run MTA, the Trump administration announced Thursday. [ more › ]",
    "link": "https://gothamist.com/news/trump-station-feds-take-control-of-penn-station-rebuild-kick-mta-off-the-project",
    "timestamp": "2025-04-17T21:31:00Z"
  },
  {
    "title": "Ukraine and the US sign 'memorandum of intent' on minerals deal",
    "description": "The deal will give the US royalty payments on profits from Ukrainian mining of resources and rare minerals.",
    "link": "https://www.thejournal.ie/ukraine-and-us-sign-minerals-deal-6681787-Apr2025/",
    "timestamp": "2025-04-17T21:30:39Z"
  },
  {
    "title": "‘The Gun Doesn’t Do the Shooting’: Trump Says ‘I Have an Obligation To Protect the 2nd Amendment’ After FSU Killings",
    "description": "President Donald Trump said the firearm used in Thursday’s mass shooting at Florida State University is not responsible for the deadly rampage, and he vowed to defend the Second Amendment. Two people were killed at least six were wounded. Police say 20-year-o…",
    "link": "https://www.mediaite.com/trump/the-gun-doesnt-do-the-shooting-trump-says-i-have-an-obligation-to-protect-the-2nd-amendment-after-fsu-killings/",
    "timestamp": "2025-04-17T21:30:37Z"
  },
  {
    "title": "Trump rips into Fed Chair Jerome Powell for not lowering interest rates and suggests he'll be fired soon",
    "description": "President Donald Trump took shots at the chair of the Federal Reserve after his comments appeared to lead to a drop in the stock market. Trump lambasted Jerome Powell for announcing Wednesday that the Fed would not be cutting interest rates because of signs o…",
    "link": "https://www.theblaze.com/news/trump-fed-chair-powell-fire",
    "timestamp": "2025-04-17T21:30:00Z"
  },
  {
    "title": "Europe, You Can’t Sit on the Sidelines Anymore",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Europe, You Can’t Sit on the Sidelines Anymore appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/04/17/europe-you-cant-sit-on-the-sidelines-anymore/",
    "timestamp": "2025-04-17T21:30:00Z"
  },
  {
    "title": "Trump's tariffs leave China's neighbours with an impossible choice",
    "description": "Ambitious economies like Vietnam and Indonesia are stuck between China and the US as the trade war escalates.",
    "link": "https://www.bbc.com/news/articles/c0455k6g71eo",
    "timestamp": "2025-04-17T21:29:36Z"
  }
]