[
  {
    "title": "'A Big F-A-I-L': CNN's Harry Enten Says Trump Made History In This Abysmal Way",
    "description": "The network's data chief flagged how the president's polling numbers are \"even worse\" than one of his predecessors.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-polling-first-year-second-term_n_696acb79e4b018dc941dd204",
    "timestamp": "2026-01-17T01:38:11Z"
  },
  {
    "title": "Illegal alien with 24 convictions among ‘worst of the worst’ arrested in Minnesota ICE operation: DHS",
    "description": "Federal agents arrested criminal illegal aliens as the DHS blasted Minnesota Gov. Tim Walz for allegedly protecting dangerous offenders through sanctuary policies.",
    "link": "https://www.foxnews.com/us/illegal-alien-24-convictions-among-worst-of-worst-arrested-minnesota-ice-operation-dhs",
    "timestamp": "2026-01-17T01:37:13Z"
  },
  {
    "title": "More Missouri law enforcement agencies have joined ICE immigration partnership since April 2025",
    "description": "COLUMBIA, Mo. (KMIZ) Missouri law enforcement agencies continue to expand their participation in a federal immigration enforcement partnership more than nine months after the state first moved to align itself with President Donald Trump’s directive to broaden…",
    "link": "https://abc17news.com/news/missouri/2026/01/16/more-missouri-law-enforcement-agencies-have-joined-ice-immigration-partnership-since-april-2025/",
    "timestamp": "2026-01-17T01:35:17Z"
  },
  {
    "title": "MLK Day 2026 in USA: California offers free entry to over 200 state parks on Martin Luther King Jr. Day, goes against Trump admin's new national parks rulings",
    "description": "Other days of free park admission in 2026 are Donald Trump's birthday, Presidents Day, Memorial Day, Independence Day, Constitution Day, Veterans Day, President Theodore Roosevelt's birthday (October 27) and the anniversary of the creation of the Park Service…",
    "link": "https://economictimes.indiatimes.com/news/international/us/mlk-day-2026-in-usa-california-offers-free-entry-to-over-200-state-parks-on-martin-luther-king-jr-day-goes-against-trump-admins-new-national-parks-rulings/articleshow/126598799.cms",
    "timestamp": "2026-01-17T01:35:08Z"
  },
  {
    "title": "Cops probe poison plot as pedas kill 3",
    "description": "BHOPAL: A box of pedas left outside a govt office in a small Madhya Pradesh town has unpacked a chilling mystery that has claimed three lives, leaving.",
    "link": "https://timesofindia.indiatimes.com/city/bhopal/cops-probe-poison-plot-as-pedas-kill-3/articleshow/126598773.cms",
    "timestamp": "2026-01-17T01:34:55Z"
  },
  {
    "title": "Democratic Rep Jason Crow Floats Government Shutdown To Punish ICE",
    "description": "Democratic Colorado Rep. Jason Crow said Friday that Congress should consider using funding fights to rein in U.S. Immigration and Customs Enforcement.",
    "link": "https://dailycaller.com/2026/01/16/democratic-rep-jason-crow-government-shutdown-punish-ice/",
    "timestamp": "2026-01-17T01:34:54Z"
  },
  {
    "title": "‘Horrific’: Democrats Drag Dr. Oz for Saying It’s ‘Cool’ That Robots Are Doing Ultrasounds Amid Dearth of Doctors",
    "description": "Dr. Mehmet Oz was loudly condemned for referring to robot ultrasounds as “pretty cool” on Friday, with many Democrats highlighting a lack of doctors that forced the use of machines in healthcare. Oz, who runs the nation’s Medicare and Medicaid programs, joine…",
    "link": "https://www.mediaite.com/media/news/horrific-democrats-drag-dr-oz-for-saying-its-cool-that-robots-are-doing-ultrasounds-amid-dearth-of-doctors/",
    "timestamp": "2026-01-17T01:33:54Z"
  },
  {
    "title": "Justice Department Investigating Whether Minnesota's Walz And Frey Impeded Immigration Enforcement",
    "description": "The Justice Department is investigating whether Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey have impeded federal immigration enforcement through public statements they have made, according to two people familiar with the matter.",
    "link": "https://www.huffpost.com/entry/immigration-minneapolis-minnesota_n_696ae449e4b018dc941ddf9b",
    "timestamp": "2026-01-17T01:31:49Z"
  },
  {
    "title": "Trump taps Blair, Rubio for Gaza 'Board of Peace'",
    "description": "US President Donald Trump boasted it is the \"Greatest and Most Prestigious Board ever assembled at any time, any place.\" The body will oversee the transitional government in the war-ravaged Palestinian territory. US President Donald Trump on Friday announced …",
    "link": "https://www.dw.com/en/trump-taps-blair-rubio-for-gaza-board-of-peace/a-75544950",
    "timestamp": "2026-01-17T01:30:00Z"
  },
  {
    "title": "US names leaders Rubio, Blair and Kushner in Gaza 'Board of Peace'",
    "description": "The White House has released the names of leaders who will play a role in overseeing the next steps in Gaza, under the so-called \"Board of Peace\".",
    "link": "https://www.abc.net.au/news/2026-01-17/us-white-house-gaza-board-of-peace-leaders/106240316",
    "timestamp": "2026-01-17T01:27:31Z"
  },
  {
    "title": "Nadda's successor to be declared on Jan 20, says BJP",
    "description": "India News: NEW DELHI: Announcing the schedule for the election of its national president, BJP said on Friday that nomination will be filed on Jan 19 and the repl.",
    "link": "https://timesofindia.indiatimes.com/india/naddas-successor-to-be-declared-on-jan-20-says-bjp/articleshow/126598702.cms",
    "timestamp": "2026-01-17T01:27:12Z"
  },
  {
    "title": "US Justice Department probing Minnesota Governor Walz, other officials, source says",
    "description": "The U.S. Justice Department has launched a criminal investigation into Minnesota officials, including Governor Tim Walz and Minneapolis Mayor Jacob Frey, for allegedly impeding immigration agents. Subpoenas have been prepared for both officials as part of the…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-justice-department-probing-minnesota-governor-walz-other-officials-source-says/articleshow/126598711.cms",
    "timestamp": "2026-01-17T01:25:22Z"
  },
  {
    "title": "Trump Voter Tells President to ‘Hurry Up’ on the Economy Because ‘We Can’t Stand This’",
    "description": "On Friday’s edition of Erin Burnett OutFront, CNN’s Jeff Zeleny spoke with Franz Rowland, a farmer in Southern Georgia who voted for President Donald Trump in 2024, as he urged the president to “hurry up” on aiding the economy because “we can’t stand this muc…",
    "link": "https://www.mediaite.com/media/tv/trump-voter-tells-president-to-hurry-up-on-the-economy-because-we-cant-stand-this/",
    "timestamp": "2026-01-17T01:22:40Z"
  },
  {
    "title": "Trump quietly appoints 4 members to commission that will review his White House ballroom plan",
    "description": "President Trump has appointed four new members to the Commission of Fine Arts, including former ballroom project lead James McCrery. This move aims to establish a quorum for the commission to review the proposed 90,000-square-foot White House ballroom. The Na…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-quietly-appoints-4-members-to-commission-that-will-review-his-white-house-ballroom-plan/articleshow/126598643.cms",
    "timestamp": "2026-01-17T01:21:14Z"
  },
  {
    "title": "Is Trump exploiting Iran’s crisis to push out Hamas and allow for Gaza peace?",
    "description": "Progress on President Donald Trump’s Gaza peace plan certainly sounds encouraging, but you might not want to uncork your champagne quite yet.",
    "link": "https://nypost.com/2026/01/16/opinion/trumps-gaza-peace-plan-moves-ahead-as-israel-hamas-prep-for-new-war/",
    "timestamp": "2026-01-17T01:18:31Z"
  },
  {
    "title": "Trump taps Tony Blair for post-war Gaza role, names US general to lead security force",
    "description": "President Donald Trump is shaping Gaza's future.  Former British Prime Minister Tony Blair will play a key role.  A US officer will lead a new security force.  A board will oversee reconstruction and investment.  A Palestinian committee has begun its work.  T…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-taps-tony-blair-for-post-war-gaza-role-names-us-general-to-lead-security-force/articleshow/126598527.cms",
    "timestamp": "2026-01-17T01:14:02Z"
  },
  {
    "title": "Justice Department investigates Minnesota Gov. Walz and Minneapolis Mayor Frey",
    "description": "The Justice Department is investigating whether Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey have impeded federal immigration enforcement through public statements they have made, according to two people familiar with the matter.",
    "link": "https://www.pbs.org/newshour/politics/justice-department-investigates-minnesota-gov-walz-and-minneapolis-mayor-frey",
    "timestamp": "2026-01-17T01:13:22Z"
  },
  {
    "title": "Donald Trump Could Have 'Suffered a Secret Stroke' While in Office, Top Expert Claims — as Prez, 79, Shows Troubling Signs Including 'Shuffling His Feet'",
    "description": "A top doctor has claimed President Donald Trump could have 'suffered a stroke' and hid the medical episode from the public.",
    "link": "https://radaronline.com/p/donald-trump-suffered-stroke-evidence-claims-medical-expert/",
    "timestamp": "2026-01-17T01:13:12Z"
  },
  {
    "title": "Trump taps Tony Blair, US military head for Gaza",
    "description": "US President Donald Trump on Friday gave a key role in post-war Gaza to former British prime minister Tony Blair and appointed a US officer to lead a nascent security force. Trump named members of a board to help supervise Gaza that was dominated by Americans…",
    "link": "https://www.digitaljournal.com/world/trump-taps-tony-blair-us-military-head-for-gaza/article",
    "timestamp": "2026-01-17T01:12:20Z"
  },
  {
    "title": "BMC election results 2026: BJP to decide who will be mayor of Mumbai; contested 137 seats compared to 227 in 2017",
    "description": "The BJP has officially secured the mayoral position in Mumbai for the first time, showcasing a notable political triumph. With a slight gain in seats, the party, along with its allies, now holds sway over multiple municipal councils.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/bmc-election-results-2026-bjp-to-decide-who-will-be-mayor-of-mumbai/articleshow/126598330.cms",
    "timestamp": "2026-01-17T01:12:03Z"
  },
  {
    "title": "White House names some leaders with roles in next steps in Gaza, while Palestinian committee meets",
    "description": "CAIRO — The White House released the names of some of the leaders who will play a role in overseeing next steps in Gaza after the Palestinian committee set to govern the territory under U.S. supervision met for the first time Friday in Cairo",
    "link": "https://www.nbcnews.com/world/gaza/white-house-names-leaders-roles-steps-gaza-palestinian-committee-meets-rcna254507",
    "timestamp": "2026-01-17T01:10:35Z"
  },
  {
    "title": "Ross Raihala: How four small businesses are speaking out about ICE",
    "description": "Ross Raihala: How four small businesses are speaking out about ICEtwincities.com",
    "link": "https://www.twincities.com/2026/01/16/ross-raihala-how-four-small-businesses-are-speaking-out-about-ice/",
    "timestamp": "2026-01-17T01:08:10Z"
  },
  {
    "title": "Trump issues a flurry of pardons, including for a woman whose sentence he commuted in his first term",
    "description": "Many of the president's clemencies have been targeted at criminal cases touted by federal prosecutors.",
    "link": "https://www.bostonherald.com/2026/01/16/trump-pardons-flurry/",
    "timestamp": "2026-01-17T01:05:00Z"
  },
  {
    "title": "Trump’s health care plan excludes those with preexisting conditions - NewsBreak",
    "description": "Trump is rolling out what he's calling the \"Great Healthcare Plan,\" in efforts to make health care more affordable — but not everyone is included.",
    "link": "https://www.newsbreak.com/share/4445281642154-trump-s-health-care-plan-excludes-those-with-preexisting-conditions?_f=app_share&amp;pd=01kdNYD5&amp;lang=en_US&amp;send_time=1768611891&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.0.49%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-17T01:04:55Z"
  },
  {
    "title": "Kin of many Shinde Sena netas lose",
    "description": "Mumbai: Many of Eknath Shinde-led Shiv Sena's former and sitting MLAs and MPs fared badly as their kin lost the BMC polls. Despite contesting only 90 .",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/kin-of-many-shinde-sena-netas-lose/articleshow/126590188.cms",
    "timestamp": "2026-01-17T01:02:00Z"
  },
  {
    "title": "Mumbai: In alliance face-offs, BJP emerges stronger over Shinde-led Sena in civic wards",
    "description": "Mumbai: In corporator wards that witnessed a \\\"friendly fight\\\" between alliance partners BJP and the Eknath Shinde-led Shiv Sena, the BJP appears to ha.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-in-alliance-face-offs-bjp-emerges-stronger-over-shinde-led-sena-in-civic-wards/articleshow/126590134.cms",
    "timestamp": "2026-01-17T01:01:00Z"
  },
  {
    "title": "UBT-MNS wins Worli bastion 5-1 despite rebel candidates",
    "description": "Mumbai: Despite several rebels in the fray, the Shiv Sena (UBT)-MNS retained MLA Aaditya Thackeray's bastion of Worli. The Sena (UBT)-Maharashtra Navn.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/ubt-mns-wins-worli-bastion-5-1-despite-rebel-candidates/articleshow/126590131.cms",
    "timestamp": "2026-01-17T01:01:00Z"
  },
  {
    "title": "Trump warned chaos echoes 1968 event that destroyed Dems — and he'll 'punch himself out'",
    "description": "President Donald Trump's heavy-handed tactics in Minneapolis as people gather to protest Immigration and Customs Enforcement and defend their communities, are only going to make things worse for him and turn people further against his agenda, MS NOW analyst C…",
    "link": "https://www.rawstory.com/trump-ice-2674903992/",
    "timestamp": "2026-01-17T01:00:01Z"
  },
  {
    "title": "China bids to host secretariat of new high seas treaty",
    "description": "China on Friday proposed to host the secretariat of a new treaty governing the high seas, a surprise bid that underscores Beijing’s desire to have greater influence over global environmental governance. China “has decided to present its candidature of the cit…",
    "link": "https://www.digitaljournal.com/world/china-bids-to-host-secretariat-of-new-high-seas-treaty/article",
    "timestamp": "2026-01-17T00:57:20Z"
  },
  {
    "title": "\"Pakistan PM said I saved at least 10 million people\": Trump repeats claims of ending India-Pakistan conflict",
    "description": "US President Donald Trump claims he brokered peace between India and Pakistan. He stated Pakistan's Prime Minister thanked him for saving millions of lives. India, however, maintains the ceasefire was agreed upon directly between the two nations' military ope…",
    "link": "https://economictimes.indiatimes.com/news/india/pakistan-pm-said-i-saved-at-least-10-million-people-trump-repeats-claims-of-ending-india-pakistan-conflict/articleshow/126598279.cms",
    "timestamp": "2026-01-17T00:57:11Z"
  },
  {
    "title": "US tells UN all options on table, Iran warns will respond to any aggression",
    "description": "US News: UNITED NATIONS: The US stands by the \\\"brave people of Iran,\\\" and President Trump \\\"has made it clear all options are on the table to stop the slaughter.",
    "link": "https://timesofindia.indiatimes.com/world/us/us-tells-un-all-options-on-table-iran-warns-will-respond-to-any-aggression/articleshow/126598190.cms",
    "timestamp": "2026-01-17T00:56:31Z"
  },
  {
    "title": "BMC election results 2026: Thank you Maharashtra, says PM Narendra Modi; People voted for development, says CM Devendra Fadnavis; It's an ideological battle, says Congress",
    "description": "In a resounding affirmation of their governance, the BJP-led Mahayuti alliance triumphed in Maharashtra's civic elections, clinching victories in 24 out of the 29 municipal corporations. Prime Minister Modi praised the outcome, crediting it to the NDA's commi…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/bmc-election-results-2026-thank-you-maharashtra-says-pm-narendra-modi-people-voted-for-development-says-cm-devendra-fadnavis-its-an-ideological-battle-says-congress/articleshow/126598120.cms",
    "timestamp": "2026-01-17T00:52:57Z"
  },
  {
    "title": "Anthony Scaramucci thinks Trump’s ‘hard-left’ move to cap credit-card fees is because he’s ‘texting back and forth with Mayor Mamd",
    "description": "Anthony Scaramucci thinks Trump’s ‘hard-left’ move to cap credit-card fees is because he’s ‘texting back and forth with Mayor Mamdani’Yahoo Hassett pivots to possible 'Trump cards' amid credit card interest rate battle with banksCNBC Trump's proposed credit c…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180603428",
    "timestamp": "2026-01-17T00:52:31Z"
  },
  {
    "title": "No sign of new protests in Iran as a hard-line cleric calls for executions and threatens Trump",
    "description": "Iran faces uneasy calm after deadly protests, with a hard-line cleric demanding death for detainees and threatening President Trump. Trump, however, expressed gratitude for canceled executions, signaling a potential de-escalation. Thousands have reportedly di…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-sign-of-new-protests-in-iran-as-a-hard-line-cleric-calls-for-executions-and-threatens-trump/articleshow/126598166.cms",
    "timestamp": "2026-01-17T00:50:18Z"
  },
  {
    "title": "Tony Blair to oversee Gaza's future as part of Trump's 'greatest and most prestigious' Board of Peace",
    "description": "Sir Tony and his fellow members will each have \"a defined portfolio critical to Gaza's stabilization and long-term success\", the White House has said.",
    "link": "https://news.sky.com/story/tony-blair-to-oversee-gazas-future-as-part-of-trumps-greatest-and-most-prestigious-board-of-peace-13495223",
    "timestamp": "2026-01-17T00:49:00Z"
  },
  {
    "title": "Minnesota wants to win a war of attrition",
    "description": "As masked and armed men in combat armor swarmed throughout the Twin Cities, Gov. Tim Walz took to primetime television to ask Minnesotans to film ICE. The videos, he said, would \"create a database of the atrocities against Minnesotans - not just to establish …",
    "link": "https://www.theverge.com/policy/863632/minnesota-walz-trump-sousveillance-ice",
    "timestamp": "2026-01-17T00:47:14Z"
  },
  {
    "title": "Rebels fail to make an impact in key wards",
    "description": "Mumbai: Some of the rebel candidates who entered the fray after being denied party tickets failed to make an impact in several key wards, with officia.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/rebels-fail-to-make-an-impact-in-key-wards/articleshow/126590099.cms",
    "timestamp": "2026-01-17T00:46:00Z"
  },
  {
    "title": "Trump offers to restart US mediation in Nile River dispute between Egypt and Ethiopia",
    "description": "Mediation efforts began during Trump's first term but collapsed in 2020 when Ethiopia withdrew.",
    "link": "https://www.bostonherald.com/2026/01/16/trump-egypt-ethiopia/",
    "timestamp": "2026-01-17T00:45:22Z"
  },
  {
    "title": "Humans broke one of evolution’s basic rules by losing fur — and survived",
    "description": "For most mammals, fur is essential for survival. Humans lost it anyway and didn’t just survive, they adapted. Fossil and biological evidence shows this wasn’t accidental but a major evolutionary shift, one that reshaped how our bodies work and quietly set hum…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/humans-broke-one-of-evolutions-basic-rules-by-losing-fur-and-survived/articleshow/126597838.cms",
    "timestamp": "2026-01-17T00:45:14Z"
  },
  {
    "title": "Kaptan Malik loses, 2 family members win in stronghold",
    "description": "Mumbai: Among the wards that political observers keenly watched was 165, as two seasoned corporators —Congress candidate Ashraf Azmi and Ajit Pawar-le.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/kaptan-malik-loses-2-family-members-win-in-stronghold/articleshow/126590091.cms",
    "timestamp": "2026-01-17T00:45:00Z"
  },
  {
    "title": "US justice department investigates Minnesota Democrats over alleged obstruction of ICE",
    "description": "It comes as fresh details emerged in the death of a Minneapolis woman shot last week by an ICE agent in the city.",
    "link": "https://www.bbc.com/news/articles/czx1wgvpr1zo",
    "timestamp": "2026-01-17T00:44:08Z"
  },
  {
    "title": "Republicans vouch for Fed chair, creating a rare schism with Trump",
    "description": "President Donald Trump has spent his second term bulldozing elected and appointed officials who resist him or refuse to bend to his demands. But he may have met his match in Federal Reserve Chair Jerome Powell. As the Trump administration ramps up its pressur…",
    "link": "https://japantoday.com/category/world/republicans-vouch-for-fed-chair-creating-a-rare-schism-with-trump",
    "timestamp": "2026-01-17T00:44:05Z"
  },
  {
    "title": "'Huge problem': Damning new WSJ poll spells trouble for Trump",
    "description": "A damning new Wall Street Journal poll on Friday delivered a another devastating blow to President Donald Trump's economic boasts, revealing crumbling voter confidence just weeks into 2026.By a crushing 15-point margin, voters now rate the economy as weak rat…",
    "link": "https://www.rawstory.com/wall-street-journal-2674904069/",
    "timestamp": "2026-01-17T00:44:05Z"
  },
  {
    "title": "BMC election results 2026: Shinde Sena makes dent in UBT-MNS tally, but only just",
    "description": "Eknath Shinde's Shiv Sena marked its presence in Mumbai's BMC elections by winning 29 seats, but the Thackeray clan's traditional grip on Marathi heartlands proved elusive. Although Shinde's party didn’t achieve as high a strike rate as the BJP, its role is c…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/bmc-election-results-2026-shinde-sena-makes-dent-in-ubt-mns-tally-but-only-just/articleshow/126597898.cms",
    "timestamp": "2026-01-17T00:42:23Z"
  },
  {
    "title": "After a meeting and a Nobel Prize, Trump praises Venezuela's Machado",
    "description": "President Donald Trump said he was 'impressed' by Venezuelan opposition leader María Corina Machado after a meeting in which she gave him her Nobel Peace Prize.",
    "link": "https://www.nbcnews.com/politics/donald-trump/nobel-prize-trump-praises-venezuela-opposition-machado-meeting-rcna254459",
    "timestamp": "2026-01-17T00:40:48Z"
  },
  {
    "title": "Trump's proposed credit card cap spotlights Americans' debt. Would it help?",
    "description": "President Trump's proposal to cap credit card interest rates at 10% - an idea with bipartisan support - received swift backlash from bank executives.",
    "link": "https://www.bbc.com/news/articles/cp37eerlql1o",
    "timestamp": "2026-01-17T00:39:26Z"
  },
  {
    "title": "Trump Floats Tariff for Countries Against US Acquisition of Greenland as Congressional Delegation Travels to Denmark",
    "description": "President Donald Trump has his eyes set on Greenland and may tariff countries opposed to the US acquisition of the island. But Congress is skeptical of Trump’s designs for... Read More\nThe post Trump Floats Tariff for Countries Against US Acquisition of Green…",
    "link": "https://www.dailysignal.com/2026/01/16/congress-travels-denmark-europe-sends-troops-greenland/",
    "timestamp": "2026-01-17T00:39:11Z"
  },
  {
    "title": "Many women and doctors dismiss Trump’s Tylenol claim as more research suggests no autism link | CNN",
    "description": "When President Donald Trump claimed last year that taking Tylenol during pregnancy can be linked with an increased risk of autism, ob-gyn Dr. Nathaniel DeNicola’s office saw an influx of questions and confusion – but only for about a week.",
    "link": "https://www.cnn.com/2026/01/16/health/tylenol-autism-new-research-review-wellness",
    "timestamp": "2026-01-17T00:34:59Z"
  },
  {
    "title": "Trump's worldview and a rapidly changing global order",
    "description": "Donald Trump, the disruptor. The president's first year back in office has been a year of breaking norms, snatching and bombing adversaries, pushing peace and threatening allies. Compass Points moderator Nick Schifrin discusses Trump's worldview and the rapid…",
    "link": "https://www.pbs.org/newshour/podcasts/compass-points-with-pbs-news/trumps-worldview-and-a-rapidly-changing-global-order",
    "timestamp": "2026-01-17T00:30:47Z"
  },
  {
    "title": "‘Big surprise!’ Backlash grows over Trump’s major ballroom move",
    "description": "Social media lit up Friday after reports that Donald Trump installed a group of loyalists to a federal review panel set to take up his controversial White House ballroom project – a move critics slammed as an attempt by the president to two-step around the ap…",
    "link": "https://www.rawstory.com/trump-ballroom-2674904004/",
    "timestamp": "2026-01-17T00:29:22Z"
  },
  {
    "title": "Slain Osman Hadi's brother appointed to Bangladesh's UK mission",
    "description": "South Asia News: The Muhammad Yunus-led Bangladesh interim govt has appointed slain radical Islamist leader Sharif Osman Hadi's brother Omar Hadi as second secretary a.",
    "link": "https://timesofindia.indiatimes.com/world/south-asia/slain-osman-hadis-brother-appointed-to-bangladeshs-uk-mission/articleshow/126597718.cms",
    "timestamp": "2026-01-17T00:28:18Z"
  },
  {
    "title": "New research adds to evidence that Tylenol doesn't raise autism risk",
    "description": "A new review of studies has found that taking Tylenol during pregnancy doesn’t increase the risk of autism, ADHD or intellectual disabilities. The latest work adds to the growing body of research refuting claims made by the Trump administration last year when…",
    "link": "https://apnews.com/article/trump-autism-tylenol-adhd-a9854203a8474c58654313ba93e48a67",
    "timestamp": "2026-01-17T00:24:13Z"
  },
  {
    "title": "Run without thinking of travel, bookings, expenses: Marathon in Mumbai, virtual runners in Gurgaon, Hyderabad, Darjeeling...",
    "description": "In a remarkable display of resilience, countless individuals are taking part in the Tata Mumbai Marathon from the comfort of their homes, spanning various locations throughout India. This innovative hybrid format, a product of the pandemic's challenges, has e…",
    "link": "https://timesofindia.indiatimes.com/city/delhi/run-without-thinking-oftravel-bookings-expenses-marathon-in-mumbai-runners-in-gurgaon-hyderabad-darjeeling-/articleshow/126597514.cms",
    "timestamp": "2026-01-17T00:24:04Z"
  },
  {
    "title": "Defendant in Charlie Kirk's killing asks judge to disqualify prosecution team",
    "description": "The Utah man charged with killing conservative activist Charlie Kirk returned to court Friday, as his attorneys sought to disqualify prosecutors because the daughter of a deputy county attorney involved in the case attended the rally where Kirk was shot.",
    "link": "https://www.pbs.org/newshour/nation/defendant-in-charlie-kirks-killing-asks-judge-to-disqualify-prosecution-team",
    "timestamp": "2026-01-17T00:23:14Z"
  },
  {
    "title": "Jamaat-e-Islami-led grand alliance sees rift ahead of Bangladesh general elections",
    "description": "South Asia News: DHAKA: A major Islamic political party announced its exit from the Jamaat-e-Islami-led grand alliance Friday, effectively ending an initiative to cons.",
    "link": "https://timesofindia.indiatimes.com/world/south-asia/jamaat-e-islami-led-grand-alliance-sees-rift-ahead-of-bangladesh-general-elections/articleshow/126597594.cms",
    "timestamp": "2026-01-17T00:21:56Z"
  },
  {
    "title": "Sharpton: Trump Is 'No Longer Dealing with Reality'",
    "description": "Friday on MS NOW's \"Deadline,\" network host Al Sharpton said President Donald Trump was \"no longer dealing with reality.\"\nThe post Sharpton: Trump Is ‘No Longer Dealing with Reality’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/01/16/sharpton-trump-is-no-longer-dealing-with-reality/",
    "timestamp": "2026-01-17T00:20:44Z"
  },
  {
    "title": "‘As a Muslima’: Rashida Tlaib blows gasket over ‘neo-Nazi’ DHS recruitment post",
    "description": "At Minnesota hearing: 'I see that this is something that is evoking like I’m not welcome here'",
    "link": "https://www.wnd.com/2026/01/as-muslima-rashida-tlaib-blows-gasket-neo-nazi/",
    "timestamp": "2026-01-17T00:20:10Z"
  },
  {
    "title": "Dem. Rep. Crow: Trump 'Is in Chapter One of the Autocrat’s Playbook'",
    "description": "Friday on CNN's \"The Arena,\" Rep. Jason Crow (D-CO) said President Donald Trump was \"in chapter one of the autocrat’s playbook.\"\nThe post Dem. Rep. Crow: Trump ‘Is in Chapter One of the Autocrat’s Playbook’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/01/16/dem-rep-crow-trump-is-in-chapter-one-of-the-autocrats-playbook/",
    "timestamp": "2026-01-17T00:18:54Z"
  },
  {
    "title": "Bad Bunny’s Super Bowl teaser sends powerful message after MAGA backlash over halftime show",
    "description": "The star’s video ends with the caption: ‘The world will dance’",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/bad-bunny-super-bowl-trailer-reactions-b2902255.html",
    "timestamp": "2026-01-17T00:16:18Z"
  },
  {
    "title": "GOP Rep. Bacon: Trump Invading Greenland Would End His Presidency",
    "description": "On Friday, on CNN's \"The Situation Room,\" Rep. Don Bacon (R-NE) said that if President Donald Trump invaded Greenland, it would end his presidency.\nThe post GOP Rep. Bacon: Trump Invading Greenland Would End His Presidency appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/01/16/gop-rep-bacon-trump-invading-greenland-would-end-his-presidency/",
    "timestamp": "2026-01-17T00:14:42Z"
  },
  {
    "title": "Some Mainers welcoming potential increase in ICE",
    "description": "As rumors about a potential uptick in ICE enforcement continue, Mainers are split on how they feel about it.",
    "link": "https://www.wmtw.com/article/mainers-welcoming-potential-increase-federal-police/70027673",
    "timestamp": "2026-01-17T00:14:15Z"
  },
  {
    "title": "Paracetamol is safe in pregnancy, says study refuting Trump autism claims",
    "description": "Researchers say their gold-standard review should put an end to the debate over use of the common painkiller during pregnancy.",
    "link": "https://www.bbc.com/news/articles/c74vdgkw1kzo",
    "timestamp": "2026-01-17T00:13:47Z"
  },
  {
    "title": "'Is She Even Real?': Melania Trump's 'Robotic' Video Appearance at AI Event Sparks Wild 'Deepfake' Speculation",
    "description": "Melania Trump shared a pre-tapred video address at an AI conference and some viewers thought the first lady looked like an AI creation.",
    "link": "https://radaronline.com/p/melania-trump-robotic-video-appearance-sparks-ai-speculation/",
    "timestamp": "2026-01-17T00:12:13Z"
  },
  {
    "title": "National Guard Troops To Remain In Washington D.C. Through End Of 2026",
    "description": "National Guard troops will remain in Washington, D.C. through the end of 2026, marking the third extension for the deployment of troops in the capital. President Donald Trump first deployed the National Guard to Washington, D.C. in August, as part of a promis…",
    "link": "https://www.mediaite.com/media/news/national-guard-troops-to-remain-in-washington-d-c-through-end-of-2026/",
    "timestamp": "2026-01-17T00:11:13Z"
  },
  {
    "title": "Trumps threatens to impose tariffs on countries ‘if they don’t go along’ with his Greenland takeover plans",
    "description": "Trump for months has insisted that the U.S. should control Greenland, a semiautonomous territory of NATO ally Denmark.",
    "link": "https://fortune.com/2026/01/16/trump-threat-tariffs-greenland-takeover-plans-denmark-nato/",
    "timestamp": "2026-01-17T00:10:50Z"
  },
  {
    "title": "Trump Holds Oval Office Summit With Prominent Muslim Leader",
    "description": "WASHINGTON, D.C — According to sources, President Donald Trump met with a prominent Muslim leader in the Oval Office on Friday to discuss the ongoing protests and unrest in Iran.",
    "link": "https://babylonbee.com/news/trump-holds-oval-office-summit-with-prominent-muslim-leader",
    "timestamp": "2026-01-17T00:07:49Z"
  },
  {
    "title": "DOJ didn't sell Bitcoin forfeited from Samourai case: White House advisor",
    "description": "Selling the Bitcoin would have violated President Donald Trump’s Executive Order 14233, which mandates that any Bitcoin obtained through criminal or civil forfeiture “shall not be sold.”",
    "link": "https://cointelegraph.com/news/doj-didnt-sell-any-bitcoin-tied-to-samourai-case",
    "timestamp": "2026-01-17T00:05:47Z"
  },
  {
    "title": "Rand Paul to Joe Rogan: DOJ Won't Prosecute Anthony Fauci for Lying",
    "description": "\"They ought to take it to court,\" the Kentucky senator said.Making an appearance on The Joe Rogan Experience Tuesday, Sen. Rand Paul (R–Ky.) expressed his frustration that the Trump administration has failed to refer Anthony Fauci for criminal prosecution for…",
    "link": "https://freerepublic.com/focus/f-news/4362518/posts",
    "timestamp": "2026-01-17T00:05:41Z"
  },
  {
    "title": "Keir Starmer goes big on wind power — even as Trump trashes it",
    "description": "Prime Minister Keir Starmer usually goes out of his way not to annoy Donald Trump. So he better hope the windmill-hating U.S. president doesn’t notice what the U.K. just did. In a fillip for the global offshore wind industry, Starmer’s government on Wednesday…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362517/posts",
    "timestamp": "2026-01-17T00:05:34Z"
  },
  {
    "title": "Trump Bought Netflix and Warner Bros. Discovery Bonds In Days After Megadeal Was Announced (Alex Weprin/The Hollywood Reporter)",
    "description": "Alex Weprin / The Hollywood Reporter:\nTrump Bought Netflix and Warner Bros. Discovery Bonds In Days After Megadeal Was Announced  —  A financial disclosure form released by the White House showed that he acquired at least $500,000 in debt securities from each…",
    "link": "https://www.memeorandum.com/260116/p130",
    "timestamp": "2026-01-17T00:05:00Z"
  },
  {
    "title": "Republican lawmakers close ranks around Powell, who spent years building ties in Congress. ‘He gets in there, pets the dog, shoots the breeze’",
    "description": "“He knows his way around Congress,” said Robert Tetlow, a former senior policy adviser at the Fed.",
    "link": "https://fortune.com/2026/01/16/senate-republicans-jerome-powell-doj-investigation-trump-congress-relationships/",
    "timestamp": "2026-01-17T00:02:04Z"
  },
  {
    "title": "'Triple-engine sarkar mumkeen hai': BJP takes control of Mumbai for first time, but needs Shinde Sena for majority",
    "description": "In a stunning political shift, the BJP has taken control of Mumbai's Municipal Corporation (BMC), effectively ending the Thackeray family's nearly thirty-year dominance over the city's civic governance. The Mahayuti coalition, spearheaded by the BJP alongside…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/triple-engine-sarkar-mumkeen-hai-bjp-takes-control-of-mumbai-for-first-time-but-needs-shinde-sena-for-majority/articleshow/126597227.cms",
    "timestamp": "2026-01-17T00:01:49Z"
  },
  {
    "title": "No autism link to paracetamol in pregnancy - study",
    "description": "Current evidence does not link paracetamol use in pregnancy to autism, experts have said after a new review of studies on the topic.",
    "link": "https://www.rte.ie/news/2026/0117/1553550-paracetamol-study-pregnancy/",
    "timestamp": "2026-01-17T00:01:00Z"
  },
  {
    "title": "No autism link to paracetamol use in pregnancy - study",
    "description": "Current evidence does not link paracetamol use in pregnancy to autism, experts have said after a new review of studies on the topic.",
    "link": "https://www.rte.ie/news/health/2026/0117/1553550-paracetamol-study-pregnancy/",
    "timestamp": "2026-01-17T00:01:00Z"
  },
  {
    "title": "Game of Tariffs: Trump Incentivizes European Support for His Greenland Acquisition",
    "description": "With tariffs rattling the markets, European troops on the ice, grandiose U.S. senators trying to play peacemaker, and Trump’s envoys vowing that a deal is within reach, the next episode in this Arctic saga promises even more intrigue.\nThe post Game of Tariffs…",
    "link": "https://legalinsurrection.com/2026/01/game-of-tariffs-trump-incentivizes-european-support-for-his-greenland-acquisition/",
    "timestamp": "2026-01-17T00:00:59Z"
  },
  {
    "title": "Pam Bondi Lashes Out",
    "description": "Attorney General Pam Bondi was visibly angry on Sean Hannity's Fox News show over the six federal prosecutors who resigned after refusing to investigate the widow of Renee Nicole Good, the Minnesota woman killed last week by ICE agent Jonathan Ross, HuffPost …",
    "link": "https://crooksandliars.com/2026/01/bondi-lashes-out-federal-prosecutors-who",
    "timestamp": "2026-01-17T00:00:02Z"
  },
  {
    "title": "Lawmakers Tell Trump to Keep Pressuring Iran",
    "description": "A group of bi-partisan legislators are expressing their support for aggressive action against Iran as President Donald Trump and his administration consider military action. The... Read More\nThe post Lawmakers Tell Trump to Keep Pressuring Iran appeared first…",
    "link": "https://www.dailysignal.com/2026/01/16/lawmakers-tell-trump-to-keep-pressuring-iran/",
    "timestamp": "2026-01-16T23:59:09Z"
  },
  {
    "title": "WATCH: Trump unveils long-awaited health care plan",
    "description": "President Donald Trump unveiled his “Great Health Care Plan,” but details remain scarce, raising questions about congressional support and its impact as premiums rise.",
    "link": "https://abcnews.go.com/US/video/trump-unveils-long-awaited-health-care-plan-129290320",
    "timestamp": "2026-01-16T23:58:42Z"
  },
  {
    "title": "Electric Rate Shock Triggers White House Crackdown on Data Centers",
    "description": "The explosive growth of artificial intelligence (AI) has also led to explosive growth in electricity demand. Infrastructure is straining under the weight of that demand, and nowhere is the strain more visible than in the PJM Interconnection region. Data cente…",
    "link": "https://www.pymnts.com/news/artificial-intelligence/2026/electric-rate-shock-triggers-white-house-crackdown-on-data-centers/",
    "timestamp": "2026-01-16T23:57:24Z"
  },
  {
    "title": "Michael Cohen claims he was ‘coerced’ by Letitia James to turn on Trump",
    "description": "Ex-legal fixer Michael Cohen on Friday accused New York Attorney General Letitia James and Manhattan District Attorney Alvin Bragg of forcing him to testify against his former client, Donald Trump, as part of their civil fraud and \"hush money\" cases against t…",
    "link": "https://nypost.com/2026/01/16/us-news/michael-cohen-claims-he-was-coerced-by-letitia-james-to-turn-on-trump/",
    "timestamp": "2026-01-16T23:53:27Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn’t raise the risk of autism despite Trump’s claims",
    "description": "New research bolsters evidence that Tylenol doesn’t raise the risk of autism despite Trump’s claimsmercurynews.com",
    "link": "https://www.mercurynews.com/2026/01/16/autism-tylenol-research/",
    "timestamp": "2026-01-16T23:52:43Z"
  },
  {
    "title": "White House announces members of Gaza ‘Board of Peace’",
    "description": "President Donald Trump has unveiled the leadership structure for a committee to oversee the reconstruction and governance of Gaza Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631066-gaza-peace-board-trump/",
    "timestamp": "2026-01-16T23:48:45Z"
  },
  {
    "title": "Bond yields jump after Trump hints Hassett won’t be named Fed chair as Wall Street sees hawkish Warsh having easier path to replace Powell",
    "description": "“I actually want to keep you where you are, if you want to know the truth,” Trump said at a White House event.",
    "link": "https://fortune.com/2026/01/16/bond-yields-trump-kevin-hassett-fed-chair-hawkish-warsh-powell/",
    "timestamp": "2026-01-16T23:45:36Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn't raise the risk of autism despite Trump's claims",
    "description": "A new review of studies has found that taking Tylenol during pregnancy doesn’t increase the risk of autism, ADHD or intellectual disabilities.",
    "link": "https://www.news4jax.com/health/2026/01/16/new-research-bolsters-evidence-that-tylenol-doesnt-raise-the-risk-of-autism-despite-trumps-claims/",
    "timestamp": "2026-01-16T23:45:11Z"
  },
  {
    "title": "New research bolsters evidence that Tylenol doesn’t raise the risk of autism despite Trump’s claims",
    "description": "Tylenol during pregnancy doesn’t increase the risk of autism, ADHD or intellectual disabilities.",
    "link": "https://www.bostonherald.com/2026/01/16/autism-tylenol-research/",
    "timestamp": "2026-01-16T23:44:28Z"
  },
  {
    "title": "인간쓰레기 테슬라의 일론 머스크",
    "description": "US regulators granted Tesla a five-week extension to start addressing a defect investigation into cars violating traffic laws while the company’s Full Self-Driving system is engaged https://t.co/58SMyuTq44— Bloomberg (@business) January 16, 2026 정신적으로 위험한 상황을…",
    "link": "https://ryueyes11.tistory.com/512050",
    "timestamp": "2026-01-16T23:43:53Z"
  },
  {
    "title": "Trump Pardons Outhouse Kingpin Convicted of Illegally Dumping Raw Sewage",
    "description": "On Thursday, President Donald Trump signed a “full and unconditional pardon” for Diamond Environmental Services owner Arie Eric De Jong III, who was sentenced in 2018 to five months in prison for illegally dumping raw sewage into municipal sewer systems. Acco…",
    "link": "https://www.mediaite.com/media/news/trump-pardons-outhouse-kingpin-convicted-of-illegally-dumping-raw-sewage/",
    "timestamp": "2026-01-16T23:41:38Z"
  },
  {
    "title": "Some Trump administration social media posts mirror extremist rhetoric",
    "description": "A series of recent social media posts from the Trump administration’s official government accounts have echoed terminology used by far-right extremists, experts said, adding that the posts offer no doubt that they are references to white supremacist rhetoric.",
    "link": "https://www.nbcnews.com/tech/internet/trump-administration-social-media-posts-extremist-rhetoric-rcna254372",
    "timestamp": "2026-01-16T23:40:49Z"
  },
  {
    "title": "Toward strategic self-reliance: Israel beyond US military aid - analysis",
    "description": "A memorandum of understanding (MoU) serves as the framework through which the United States commits to long-term military assistance to Israel, typically in 10-year increments. These funds must be spent in the US to support American defense manufacturing and …",
    "link": "https://freerepublic.com/focus/f-news/4362513/posts",
    "timestamp": "2026-01-16T23:38:14Z"
  }
]