[
  {
    "title": "Trump Says US Oversight of Venezuela Could Last Years",
    "description": "REUTERS–The United States could oversee Venezuela and control its oil revenue for years, President Donald Trump said in an interview published on Thursday. During what... Read More\nThe post Trump Says US Oversight of Venezuela Could Last Years appeared first …",
    "link": "https://www.dailysignal.com/2026/01/08/trump-says-us-oversight-of-venezuela-could-last-years/",
    "timestamp": "2026-01-08T16:55:09Z"
  },
  {
    "title": "Senate advances war powers resolution to rein in Trump on Venezuela",
    "description": "The measure seeks to block Trump from further military action against Caracas.",
    "link": "https://abcnews.go.com/Politics/senate-advances-war-powers-resolution-rein-trump-venezuela/story?id=129018473",
    "timestamp": "2026-01-08T16:54:45Z"
  },
  {
    "title": "Minneapolis Schools Shut Down As Unrest Rises After ICE Shooting",
    "description": "Minneapolis Public Schools has closed schools on Thursday and Friday \"due to safety concerns\" following the ICE shooting in the city on Wednesday.",
    "link": "https://dailycaller.com/2026/01/08/minneapolis-schools-shut-down-as-unrest-rises-after-ice-shooting/",
    "timestamp": "2026-01-08T16:54:09Z"
  },
  {
    "title": "Senate advances war powers resolution to rein in Trump on Venezuela",
    "description": "In a rare bipartisan rebuke of President Donald Trump on Thursday, the Senate narrowly advanced a war powers resolution aimed at reining in U.S. military actions in Venezuela — an early sign that Trump may not have the congressional backing he anticipated for…",
    "link": "https://biztoc.com/x/3f94c95b3690f561",
    "timestamp": "2026-01-08T16:53:05Z"
  },
  {
    "title": "Handful of Republicans join Democrats to force Senate check on Trump’s war powers in Venezuela | CNN Politics",
    "description": "A small bloc of Senate Republicans has delivered a notable rebuke of President Donald Trump just days after his operation ousting Venezuela’s leader, voting to advance a resolution that would limit future US military force in the nation without Congress’ appr…",
    "link": "https://www.cnn.com/2026/01/08/politics/war-powers-vote-trump-venezuela-senate",
    "timestamp": "2026-01-08T16:52:23Z"
  },
  {
    "title": "The Major Economies’ Prospects in 2026",
    "description": "Political leaders tend to claim credit when the economy performs well and to pursue frantic reforms when it does not. But short-term policy measures will have little impact on the forces shaping the prospects of the world’s major economies today.",
    "link": "https://www.project-syndicate.org/commentary/policy-will-have-little-impact-on-the-performance-of-china-the-us-and-europe-in-2026-by-daniel-gros-2026-01",
    "timestamp": "2026-01-08T16:52:18Z"
  },
  {
    "title": "What does the footage of the fatal Minneapolis ICE shooting show?",
    "description": "Sky News has been reviewing footage from before, during and after Renee Nicole Good was shot dead to determine how the incident unfolded.",
    "link": "https://news.sky.com/story/what-does-the-footage-of-the-fatal-minneapolis-ice-shooting-show-13492129",
    "timestamp": "2026-01-08T16:51:00Z"
  },
  {
    "title": "Amid search for answers in Minneapolis ICE shooting, Trump says woman killed tried to 'run over' agent",
    "description": "Amid search for answers in Minneapolis ICE shooting, Trump says woman killed tried to 'run over' agentgo.com",
    "link": "https://abcnews.go.com/US/amid-search-answers-minneapolis-ice-shooting-trump-woman/story?id=129011690",
    "timestamp": "2026-01-08T16:50:55Z"
  },
  {
    "title": "‘President Trump is the Commander in Chief’: Congresswoman calls for arrest of Gov. Tim Walz",
    "description": "Minnesota leader rocked by billions in social services fraud threatens to activate National Guard",
    "link": "https://www.wnd.com/2026/01/president-trump-is-commander-chief-congresswoman-calls-arrest/",
    "timestamp": "2026-01-08T16:49:46Z"
  },
  {
    "title": "Federal prosecutor calls Newsom 'king of fraud' as Trump launches California corruption probe",
    "description": "Federal prosecutors are investigating California's spending as the Trump administration ramps up a nationwide fraud crackdown.",
    "link": "https://www.foxnews.com/media/federal-prosecutor-calls-newsom-king-fraud-trump-launches-california-corruption-probe",
    "timestamp": "2026-01-08T16:49:45Z"
  },
  {
    "title": "Pence Has Dire Prediction About Trump’s Future",
    "description": "Former Vice President Mike Pence has issued a dire warning that Donald Trump will be impeached if Democrats win this year’s midterm elections. Speaking to...",
    "link": "https://www.thedailybeast.com/mike-pence-has-dire-prediction-about-donald-trumps-future/",
    "timestamp": "2026-01-08T16:49:13Z"
  },
  {
    "title": "Senate Votes To Limit Trump's Power To Wage War In Venezuela",
    "description": "Lawmakers dealt a symbolic rebuke to an emboldened president who is threatening further military force in Venezuela and other countries in the world.",
    "link": "https://www.huffpost.com/entry/senate-limit-trump-venezuela_n_695fb485e4b0b3db6e4e01fe",
    "timestamp": "2026-01-08T16:49:03Z"
  },
  {
    "title": "Gurmeet Chadha warns of systemic market risks from source-based news. Suggests remedy to tackle \"disinformation\"",
    "description": "Market expert Gurmeet Chadha has raised concerns about unverified news spreading on social media. He warns that such information, especially around market expiry days, can lead to chaotic trading and pose risks to the entire financial system. Chadha highlight…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/gurmeet-chadha-warns-of-systemic-market-risks-from-source-based-news-suggests-remedy-to-tackle-disinformation/articleshow/126418963.cms",
    "timestamp": "2026-01-08T16:48:51Z"
  },
  {
    "title": "Senate advances war powers resolution restraining Trump in Venezuela",
    "description": "The Senate moved Thursday to block President Trump from taking military action in Venezuela, just five days after the capture of Caracas strongman Nicolas Maduro.",
    "link": "https://nypost.com/2026/01/08/us-news/senate-advances-war-powers-resolution-restraining-trump-in-venezuela/",
    "timestamp": "2026-01-08T16:47:54Z"
  },
  {
    "title": "MAGA’s Response to Minnesota ICE Killing: Don’t Believe Your Eyes",
    "description": "Close analysis of video footage shows Renee Nicole Good attempting to drive away from ICE agents before one of them shoots her. But that doesn’t fit Trump, Kristi Noem, and JD Vance’s narrative.",
    "link": "https://www.vanityfair.com/news/story/minnesota-ice-shooting-renee-nicole-good-footage",
    "timestamp": "2026-01-08T16:47:24Z"
  },
  {
    "title": "Jerry Jones Makes Bizarre Reference to Donald Trump While Discussing Cowboys' Coaching Plans and Super Bowl Goals",
    "description": "The owner, president and general manager of the Dallas Cowboys said he is optimistic about the franchise's future",
    "link": "https://people.com/jerry-jones-makes-bizarre-reference-donald-trump-while-discussing-cowboys-plans-11881519",
    "timestamp": "2026-01-08T16:46:54Z"
  },
  {
    "title": "FBI shuts down Minnesota's investigation into ICE shooting and blocks access to evidence...",
    "description": "FBI shuts down Minnesota's investigation into ICE shooting and blocks access to evidence...\r\n\n \n \n \n (Top headline, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:City on edge... Developing...\r\nSchools cancel classes...\r\nWeeks of Turmoil...\r\nTrump Cornered on …",
    "link": "https://www.themirror.com/news/us-news/breaking-fbi-shuts-down-minnesotas-1606462",
    "timestamp": "2026-01-08T16:46:37Z"
  },
  {
    "title": "GOP senators join Democrats to stop Trump from policing Venezuela",
    "description": "President Donald Trump's military authority in Venezuela was challenged on Thursday when Senate Republicans rebelled and supported a bipartisan attempt to rein them in.",
    "link": "https://www.foxnews.com/politics/gop-senators-join-democrats-stop-trump-from-policing-venezuela",
    "timestamp": "2026-01-08T16:46:17Z"
  },
  {
    "title": "Senate advances resolution to limit Trump’s war powers after Venezuela raid",
    "description": "The vote was a disapproval of Trump's expanding ambitions in the Western Hemisphere.",
    "link": "https://www.denverpost.com/2026/01/08/senate-war-powers-resolution/",
    "timestamp": "2026-01-08T16:44:54Z"
  },
  {
    "title": "Senate advances resolution to limit Trump’s war powers after Venezuela raid",
    "description": "The vote was a disapproval of Trump's expanding ambitions in the Western Hemisphere.",
    "link": "https://www.bostonherald.com/2026/01/08/senate-war-powers-resolution/",
    "timestamp": "2026-01-08T16:44:54Z"
  },
  {
    "title": "Senate advances resolution to curb Trump’s military authority in Venezuela",
    "description": "This is a breaking news story.",
    "link": "https://www.aljazeera.com/news/2026/1/8/us-senate-passes-measure-to-restrict-trumps-military-actions-in-venezuela",
    "timestamp": "2026-01-08T16:44:32Z"
  },
  {
    "title": "Why Trump is going after institutional homebuyers: They dominate markets like Atlanta, Jacksonville",
    "description": "President Donald Trump's renewed focus on housing affordability has found a clear villain: institutional investors that own large swaths of single-family homes in fast-growing Sun Belt cities, where would-be homeowners increasingly find themselves bidding aga…",
    "link": "https://biztoc.com/x/3827ea1af80c737b",
    "timestamp": "2026-01-08T16:42:22Z"
  },
  {
    "title": "Senate advances measure to restrict Trump's power to use military force in Venezuela",
    "description": "The Senate advanced a resolution to block Donald Trump from using military force “within or against Venezuela” unless he gets prior approval from Congress.",
    "link": "https://www.nbcnews.com/politics/congress/senate-advances-measure-restrict-trumps-power-use-military-force-venez-rcna252892",
    "timestamp": "2026-01-08T16:42:21Z"
  },
  {
    "title": "Oil or nothing: will Trump’s Venezuela gamble pay off?",
    "description": "Oil or nothing: will Trump’s Venezuela gamble pay off?\nOur podcast on markets, the economy and business. This week, why it doesn’t always make sense to “drill, baby, drill”\nDonald Trump had oil on his mind when he declared America would “run” Venezuela, in th…",
    "link": "https://biztoc.com/x/d67c0a2b4f29e95c",
    "timestamp": "2026-01-08T16:42:10Z"
  },
  {
    "title": "Exclusive-Trump administration mulls payments to sway Greenlanders to join US",
    "description": "By Gram SlatteryJan 8 (Reuters) - U.S. officials have discussed sending lump sum payments to Greenlanders as part of a bid to convince them to secede from Denmark and pot… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/08/exclusive-trump-administration-mulls-payments-to-sway-greenlanders-to-join-us",
    "timestamp": "2026-01-08T16:42:04Z"
  },
  {
    "title": "Trump Takes Hatchet to Globalists: Ends Funding and Withdraws US for Dozens of UN and Dozens More Non-UN Bodies",
    "description": "Trump Takes Hatchet to Globalists: Ends Funding and Withdraws US for Dozens of UN and Dozens More Non-UN Bodieswesternjournal.com",
    "link": "https://www.westernjournal.com/trump-takes-hatchet-globalists-ends-funding-withdraws-us-dozens-un-dozens-non-un-bodies/",
    "timestamp": "2026-01-08T16:41:43Z"
  },
  {
    "title": "Gubernatorial candidate in key 2028 White House election cycle state announces record fundraising haul",
    "description": "Iowa Rep. Randy Feenstra raises record $4.3 million for governor race in just seven months, setting new GOP fundraising milestone in off-election year.",
    "link": "https://www.foxnews.com/politics/gubernatorial-candidate-key-2028-white-house-election-cycle-state-announces-record-fundraising-haul",
    "timestamp": "2026-01-08T16:40:08Z"
  },
  {
    "title": "Nancy Mace Shocks Maria Bartiromo With Claim ICE Agent Who Shot Renee Good Was Limping",
    "description": "Nancy Mace claimed Thursday that the ICE agent who shot and killed a Minneapolis mother was seen on video \"limping\" as he backed away from her van.\nThe post Nancy Mace Shocks Maria Bartiromo With Claim ICE Agent Who Shot Renee Good Was Limping first appeared …",
    "link": "https://www.mediaite.com/media/news/nancy-mace-shocks-maria-bartiromo-with-claim-ice-agent-who-shot-renee-good-was-limping/",
    "timestamp": "2026-01-08T16:40:04Z"
  },
  {
    "title": "Why Trump says getting Greenland is about defence",
    "description": "President Donald Trump insists the US needs to take over Greenland as a matter of national security. Here’s why.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/8/why-trump-says-getting-greenland-is-about-defence",
    "timestamp": "2026-01-08T16:39:55Z"
  },
  {
    "title": "Kai Trump Goes Under the Knife: Prez's Granddaughter, 18, Reveals Surgery Details In Shocking Social Media Announcement",
    "description": "Kai Trump revealed she had surgery on her left wrist in a shocking social media post.",
    "link": "https://radaronline.com/p/kai-trump-surgery-golf-wrist-announcement/",
    "timestamp": "2026-01-08T16:39:52Z"
  },
  {
    "title": "Senate Dem John Fetterman supports prospect of US Greenland purchase, citing 'massive strategic benefits'",
    "description": "Sen. John Fetterman, D-Pa., said he supports the U.S. acquisition of Greenland, saying the territory has \"massive strategic benefits for the United States.\"",
    "link": "https://www.foxnews.com/politics/senate-dem-john-fetterman-supports-prospect-us-greenland-purchase-citing-massive-strategic-benefits",
    "timestamp": "2026-01-08T16:39:14Z"
  },
  {
    "title": "U.S. considering investing in critical minerals mining in Greenland, Amaroq's CEO tells CNBC",
    "description": "While talks haven't been finalised, deals could involve offtake agreements, infrastructure support and credit lines, CEO of mining firm Amaroq told CNBC.",
    "link": "https://www.cnbc.com/2026/01/08/-greenland-critical-minerals-mining-amaroq-us-government.html",
    "timestamp": "2026-01-08T16:38:58Z"
  },
  {
    "title": "Stocks mixed, yields rise ahead of US jobs data; defense shares climb",
    "description": "NEW YORK, ‌Jan 8 : Major stock indexes were mixed and Treasury yields rose on Thursday ahead of Friday's key U.S. jobs report, while defense company shares gained amid U.S. President Donald Trump's plans for a $1.5 trillion military budget.An aerospace and de…",
    "link": "https://www.channelnewsasia.com/business/stocks-mixed-yields-rise-ahead-us-jobs-data-defense-shares-climb-5837881",
    "timestamp": "2026-01-08T16:38:16Z"
  },
  {
    "title": "Stocks mixed, yields rise ahead of US jobs report; defense shares gain",
    "description": "NEW YORK, ‌Jan 8 : Major stock indexes were mixed and Treasury yields rose on Thursday ahead of Friday's key U.S. jobs report, while defense company shares gained amid U.S. President Donald Trump's plans for a $1.5 trillion military budget.An aerospace and de…",
    "link": "https://www.channelnewsasia.com/business/stocks-mixed-yields-rise-ahead-us-jobs-report-defense-shares-gain-5837881",
    "timestamp": "2026-01-08T16:38:16Z"
  },
  {
    "title": "Wisconsin man accused of killing parents to fund Trump assassination plot pleads guilty to homicide",
    "description": "Prosecutors dropped other charges, including two counts of hiding a corpse and theft.",
    "link": "https://www.bostonherald.com/2026/01/08/wisconsin-deaths-plot/",
    "timestamp": "2026-01-08T16:36:34Z"
  },
  {
    "title": "Why is Donald Trump’s World Liberty Financial (WLFI) is applying for a banking license right now?",
    "description": "On Jan. 7, Donald Trump’s World Liberty Financial (WLFI) formally applied for a national banking charter to establish the “World Liberty Trust Company.” This is a proposed national trust bank specifically designed to handle USD1 stablecoin issuance, custody, …",
    "link": "https://cryptoslate.com/world-liberty-financial-seeks-charter-for-usd1-stablecoin-evolution/",
    "timestamp": "2026-01-08T16:35:29Z"
  },
  {
    "title": "Trump’s ‘beautiful’ new law means states have big decisions this year on Medicaid, SNAP and taxes",
    "description": "The measure imposes new work requirements for some people with Medicaid health coverage.",
    "link": "https://www.bostonherald.com/2026/01/08/state-legislatures-2026/",
    "timestamp": "2026-01-08T16:35:09Z"
  },
  {
    "title": "Trump’s ‘beautiful’ new law means states have big decisions this year on Medicaid, SNAP and taxes",
    "description": "The measure imposes new work requirements for some people with Medicaid health coverage.",
    "link": "https://www.denverpost.com/2026/01/08/state-legislatures-2026/",
    "timestamp": "2026-01-08T16:35:09Z"
  },
  {
    "title": "President Trump and Wife Melania Reportedly Have ‘Little Interaction’ With Each Other, But Share One Hobby",
    "description": "President Donald Trump and his wife, Melania Trump, don’t spend much time together, but they apparently connect over a shared interest. In a People article...",
    "link": "https://nationalenquirer.com/president-trump-and-wife-melania-reportedly-have-little-interaction-with-each-other-but-share-one-hobby/",
    "timestamp": "2026-01-08T16:32:52Z"
  },
  {
    "title": "Donald Trump's Patriot Games; what to know about America250 tournament",
    "description": "The Patriot Games are one of the key events celebrating America's 250th birthday this year. Here's what we know about the youth-oriented tournament.",
    "link": "https://www.delawareonline.com/story/sports/2026/01/08/donald-trumps-patriot-games-what-to-know-about-america250-tournament/88082949007/",
    "timestamp": "2026-01-08T16:32:10Z"
  },
  {
    "title": "Trump pulls US from key climate pact, other bodies",
    "description": "What happened\nPresident Donald Trump on Wednesday signed an executive order suspending U.S. participation in dozens of international organizations, including the landmark United Nations Framework Convention on Climate Change and the Intergovernmental Panel on…",
    "link": "https://biztoc.com/x/2094bc93fc053614",
    "timestamp": "2026-01-08T16:31:09Z"
  },
  {
    "title": "Trump media company announces plans for first fusion power plant",
    "description": "US President Donald Trump’s social media company said that construction of the country’s first fusion power plant will begin in 2026, less than a month after his firm announced a controversial merger with fusion energy company TEA Technologies.\nThe two compan…",
    "link": "https://biztoc.com/x/ec58c929666cd703",
    "timestamp": "2026-01-08T16:31:01Z"
  },
  {
    "title": "Jimmy Kimmel Sends Message to Donald Trump After ICE Shooting",
    "description": "The incident has sparked outrage online, and Kimmel hit back against Trump’s claim that ICE killed the woman in self defense.",
    "link": "https://biztoc.com/x/a7fc3d13bd7ebca2",
    "timestamp": "2026-01-08T16:30:54Z"
  },
  {
    "title": "Macron accuses US of 'turning away' from allies",
    "description": "French President Emmanuel Macron warned the United States was \"gradually turning away\" from some of its allies and \"breaking free from international rules\", offering some of his strongest criticism yet of Washington's policies under Donald Trump.",
    "link": "https://www.rte.ie/news/world/2026/0108/1552161-macron-us-allies/",
    "timestamp": "2026-01-08T16:28:12Z"
  },
  {
    "title": "Brazil’s Lula vetoes law reducing Bolsonaro’s sentence",
    "description": "Brazil’s left-wing President Luiz Inacio Lula da Silva on Thursday vetoed a law dramatically reducing the prison sentence of former far-right leader Jair Bolsonaro, convicted last year of coup plotting. Lula vetoed the law adopted by Congress late last year o…",
    "link": "https://www.digitaljournal.com/world/brazils-lula-vetoes-law-reducing-bolsonaros-sentence/article",
    "timestamp": "2026-01-08T16:27:20Z"
  },
  {
    "title": "‘Jeopardy!’ Host Ken Jennings Calls on Democrats to Prosecute Trump White House Staff ‘At Every Level’",
    "description": "Ken Jennings, host of Jeopardy!, took to his Bluesky account on Wednesday and said any Democrat candidate who prosecutes “former” members of President Donald Trump’s White House “regime” has his vote in 2028. “The ‘prosecute the former regime at every level’ …",
    "link": "https://freerepublic.com/focus/f-bloggers/4361029/posts",
    "timestamp": "2026-01-08T16:24:58Z"
  },
  {
    "title": "Steny Hoyer Announces Retirement From Congress After 45 Years",
    "description": "The Maryland Democrat, 86, served as House majority leader for eight years.",
    "link": "https://www.huffpost.com/entry/steny-hoyer-retirement-house_n_695fbee2e4b0b3db6e4e0778",
    "timestamp": "2026-01-08T16:24:20Z"
  },
  {
    "title": "Minnesota Investigators Barred From Taking Part In Probe Into Fatal ICE Shooting",
    "description": "“Without complete access to the evidence, witnesses and information collected, we cannot meet the investigative standards that Minnesota law and the public demands,\" Minnesota Bureau of Criminal Apprehension Superintendent Drew Evans said.",
    "link": "https://www.huffpost.com/entry/minnesota-investigators-barred-taking-part-investigation-womans-killing-ice-officer_n_695fd904e4b07c500938d466",
    "timestamp": "2026-01-08T16:23:52Z"
  },
  {
    "title": "'Stoking the Grievance Industry': Leftist Groups Mobilize After ICE Shooting in Minneapolis",
    "description": "Leftist groups quickly mobilized to protest Wednesday after a woman was fatally shot during an incident involving ICE agents in Minneapolis.\nThe post ‘Stoking the Grievance Industry’: Leftist Groups Mobilize After ICE Shooting in Minneapolis appeared first on…",
    "link": "https://www.breitbart.com/politics/2026/01/08/stoking-grievance-industry-leftist-groups-mobilize-after-ice-shooting-minneapolis/",
    "timestamp": "2026-01-08T16:23:22Z"
  },
  {
    "title": "Jeopardy! Host Vows to Vote for Any 2028 Candidate Who Will ‘Prosecute’ Trump ‘Regime at Every Level’",
    "description": "The host’s online outburst came just hours after ICE agents fatally shot 37-year-old Renee Nicole Good in Minneapolis.\nThe post Jeopardy! Host Vows to Vote for Any 2028 Candidate Who Will ‘Prosecute’ Trump ‘Regime at Every Level’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/online/jeopardy-host-vows-to-vote-for-any-2028-candidate-who-will-prosecute-trump-regime-at-every-level/",
    "timestamp": "2026-01-08T16:22:54Z"
  },
  {
    "title": "US and Colombia agree on joint fight against guerrillas",
    "description": "Colombia's leftist President Gustavo Petro agreed with his US counterpart Donald Trump to take \"joint action\" against cocaine-smuggling guerrillas on the border with Venezuela, Bogota's interior minister has said.",
    "link": "https://www.rte.ie/news/world/2026/0108/1552160-us-colombia/",
    "timestamp": "2026-01-08T16:22:22Z"
  },
  {
    "title": "Cuban soldiers killed in US raid expose years of denial over Havana’s role in Venezuela",
    "description": "Foreign soldiers have long bolstered Maduro’s repressive regime and helped suppress citizen protests, say analysts",
    "link": "https://www.irishtimes.com/world/americas/2026/01/08/cuban-soldiers-killed-in-us-raid-expose-years-of-denial-over-hanavas-role-in-venezuela/",
    "timestamp": "2026-01-08T16:21:49Z"
  },
  {
    "title": "Colombian President Petro Said He Feared Being Captured Like Maduro Before Having a Friendly Call With Trump",
    "description": "Colombian President Gustavo Petro said he feared being captured like Venezuela's authoritarian leader Nicolas Maduro in Venezuela and was set to begin sleeping in the presidential palace before having a friendly phone call with Donald Trump that helped to def…",
    "link": "https://www.ibtimes.com/colombian-president-petro-said-he-feared-being-captured-like-maduro-before-having-friendly-call-3794792",
    "timestamp": "2026-01-08T16:21:46Z"
  },
  {
    "title": "Senate to vote on barring Trump from further military strikes in Venezuela after Maduro capture",
    "description": "The Trump administration used to military to snatch Venezuelan President Nicolas Maduro last week.",
    "link": "https://www.cnbc.com/2026/01/08/venezuela-senate-voting-on-halting-military-action-after-maduro-capture.html",
    "timestamp": "2026-01-08T16:20:17Z"
  },
  {
    "title": "Barack Obama More Popular with Young Men Than Joe Rogan or Donald Trump",
    "description": "Former President Barack Obama remains the most popular political figure among young men, and is viewed more favorably than people including President Donald Trump and Joe Rogan, according to a new poll.\nNewsweek reached out to the White House, a spokesperson …",
    "link": "https://biztoc.com/x/6e59d26cbeccdae9",
    "timestamp": "2026-01-08T16:20:09Z"
  },
  {
    "title": "Why Trump is going after institutional homebuyers: They dominate markets like Atlanta, Jacksonville",
    "description": "President Donald Trump's renewed focus on housing affordability has found a clear villain: institutional investors that own large swaths of single-family homes in fast-growing Sun Belt cities, where would-be homeowners increasingly find themselves bidding aga…",
    "link": "https://biztoc.com/x/d53fed7efb226741",
    "timestamp": "2026-01-08T16:19:56Z"
  },
  {
    "title": "9 Republican Senators Rebuke Donald Trump's Greenland Threats",
    "description": "President Donald Trump may be losing some support in his party amid his continued threats to take over Greenland.\nNine Republican senators have so far spoken publicly against the idea, including Kentucky’s Mitch McConnell and Louisiana’s John Kennedy.\n“Threat…",
    "link": "https://biztoc.com/x/166aaa6ccbd3ed91",
    "timestamp": "2026-01-08T16:19:52Z"
  },
  {
    "title": "Minneapolis protesters vent their outrage after an ICE officer kills a woman",
    "description": "An unidentified ICE officer shot Renee Nicole Macklin Good in the head on Wednesday.",
    "link": "https://www.bostonherald.com/2026/01/08/minneapolis-immigration-enforcement/",
    "timestamp": "2026-01-08T16:18:52Z"
  },
  {
    "title": "Minneapolis protesters vent their outrage after an ICE officer kills a woman",
    "description": "An unidentified ICE officer shot Renee Nicole Macklin Good in the head on Wednesday.",
    "link": "https://www.denverpost.com/2026/01/08/minneapolis-immigration-enforcement/",
    "timestamp": "2026-01-08T16:18:52Z"
  },
  {
    "title": "Jimmy Kimmel displays t-shirt with Minneapolis mayor's call for ICE to 'get the f--- out' of city",
    "description": "Late-night host Jimmy Kimmel backed Minnesota Mayor Jacob Frey's profanity-laced response to the fatal shooting of a woman in Minneapolis by an ICE agent.",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-displays-t-shirt-minneapolis-mayors-call-ice-get-f-out-city",
    "timestamp": "2026-01-08T16:18:45Z"
  },
  {
    "title": "Your Lying Eyes (Open Thread)",
    "description": "This NYT article on the murder in Minneapolis yesterday is good journalism. It breaks down video clips frame-by-frame from multiple angles and provides indisputable evidence that Trump, Noem, Fox News, et al., lied about what happened. Here’s how Trump lied a…",
    "link": "https://balloon-juice.com/2026/01/08/your-lying-eyes-open-thread/",
    "timestamp": "2026-01-08T16:15:55Z"
  },
  {
    "title": "Today’s News in a Nutshell",
    "description": "KATHMANDU: Khabarhub brings you a glimpse of major developments of the day in Nepal, including politics, business/economy, sports, entertainment, and more. Special convention faction accuses NC establishment of provoking confrontation The faction advocating f…",
    "link": "https://english.khabarhub.com/2026/08/515031/",
    "timestamp": "2026-01-08T16:15:43Z"
  },
  {
    "title": "House GOP prioritizes Trump's changes to showerheads (Washington Post)",
    "description": "Washington Post:\nHouse GOP prioritizes Trump's changes to showerheads  —  President Donald Trump has made no secret of his distaste for low-pressure showers.  —  House Republicans are hoping to soon deliver a win for President Donald Trump's agenda — or at le…",
    "link": "https://www.memeorandum.com/260108/p59",
    "timestamp": "2026-01-08T16:15:01Z"
  },
  {
    "title": "Abduction of Venezuela’s Maduro illegal despite US charges, experts say",
    "description": "A country 'cannot enforce its law on the territory of another state' without consent, UN rapporteur tells Al Jazeera.",
    "link": "https://www.aljazeera.com/news/2026/1/8/abduction-of-venezuelas-maduro-illegal-despite-us-charges-experts-say",
    "timestamp": "2026-01-08T16:13:54Z"
  },
  {
    "title": "Why Trump is going after institutional homebuyers: They dominate markets like Atlanta, Jacksonville",
    "description": "Trump's message may be aimed at places like Atlanta and Jacksonville, metropolitan areas  where investor ownership is more visible than elsewhere.",
    "link": "https://www.cnbc.com/2026/01/08/trump-goes-after-institutional-home-buyers-who-dominate-some-sun-belt-markets.html",
    "timestamp": "2026-01-08T16:11:05Z"
  },
  {
    "title": "Secretary Bessent drops U.S. auto loan deduction bombshell",
    "description": "On Wednesday, January 7, U.S. Treasury Secretary Scott Bessent addressed a major headwind to the U.S. auto industry -- affordability -- saying the administration is working on a significant tax break that could help many buyers.\nThe move is surprising, given …",
    "link": "https://biztoc.com/x/de0aa335556df160",
    "timestamp": "2026-01-08T16:09:12Z"
  },
  {
    "title": "Exclusive: Troy Nehls, Roger Marshall Issue Bill to Permanently Ban Welfare-Dependent Immigration",
    "description": "Rep. Troy Nehls (R-TX) and Sen. Roger Marshall (R-KS) are introducing legislation that will codify into law a fortified \"public charge\" rule to prevent welfare-dependent legal immigrants from resettling in the United States.\nThe post Exclusive: Troy Nehls, Ro…",
    "link": "https://www.breitbart.com/politics/2026/01/08/exclusive-troy-nehls-roger-marshall-issue-bill-to-permanently-ban-welfare-dependent-immigration/",
    "timestamp": "2026-01-08T16:09:04Z"
  },
  {
    "title": "Why Spain’s prime minister is most vociferous EU leader criticising US on Venezuela",
    "description": "Pedro Sánchez warns that Donald Trump’s actions push Latin America towards ‘uncertainty, warmongering’",
    "link": "https://www.irishtimes.com/world/europe/2026/01/08/why-spains-prime-minister-is-most-vociferous-eu-leader-criticising-us-on-venezuela/",
    "timestamp": "2026-01-08T16:08:47Z"
  },
  {
    "title": "Trump looks to collect $6 million in legal fees from dismissed Georgia election case",
    "description": "The president seeks to use a new Georgia law allowing defendants to collect on dismissed cases",
    "link": "https://www.salon.com/2026/01/08/trump-looks-to-collect-6-million-in-legal-fees-from-dismissed-georgia-election-case/",
    "timestamp": "2026-01-08T16:07:51Z"
  },
  {
    "title": "Trump officials, Louisiana put end to another decades-old school desegregation order",
    "description": "The Trump administration and Louisiana officials have lifted another decades-old school desegregation order, part of a campaign to end court orders they describe as outdated",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-officials-louisiana-put-end-decades-school-desegregation-129021079",
    "timestamp": "2026-01-08T16:04:25Z"
  },
  {
    "title": "Did Trump Actually See Minnesota ICE Shooting Video Before Posting?",
    "description": "Did President Donald Trump even watch a video of the ICE shooting in Minnesota before he started spreading lies about the victim?Speaking to a group of New York Times reporters Wednesday, Trump claimed that Renee Good, a driver who was shot and killed by a fe…",
    "link": "https://newrepublic.com/post/205066/donald-trump-watch-minnesota-ice-shooting-video",
    "timestamp": "2026-01-08T16:03:18Z"
  },
  {
    "title": "Democrats Reach Verdict in Minneapolis ICE Shooting",
    "description": "\"At the end of the day, what we saw today was a murder, and murders in cold blood need to be prosecuted.\"\nThe post Democrats Reach Verdict in Minneapolis ICE Shooting first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/democrats-reach-verdict-in-minneapolis-ice-shooting/",
    "timestamp": "2026-01-08T16:00:02Z"
  },
  {
    "title": "Look out for image of handcuffed Maduro in bloodied shirt",
    "description": "An image that circulated online in January 2026 authentically showed Venezuelan President Nicolás Maduro being held by U.S. military personnel while in a bloodied shirt.",
    "link": "https://www.snopes.com//fact-check/maduro-image-bloodied-shirt/",
    "timestamp": "2026-01-08T16:00:00Z"
  },
  {
    "title": "Letters: Trump’s rhetoric signals dangerous imperial ambitions",
    "description": "OPINION: The President's actions could be seen as empire-building.",
    "link": "https://www.nzherald.co.nz/nz/letters-trumps-rhetoric-signals-dangerous-imperial-ambitions/premium/3WIEQX3BHVGSNO3QVHE2KVFL3U/",
    "timestamp": "2026-01-08T16:00:00Z"
  },
  {
    "title": "'Because they're stupid': Trump admin called out for 'screwing' GOP lawmakers on childcare",
    "description": "Donald Trump’s decision to withhold childhood care funds from the multiple jurisdictions, which will hurt his own supporters, was pilloried by New York Gov. Kathy Hochul during an appearance on MS NOW Thursday morning.Brought on to discuss her proposal to exp…",
    "link": "https://www.rawstory.com/trump-childcare-2674861172/",
    "timestamp": "2026-01-08T15:59:43Z"
  },
  {
    "title": "WATCH LIVE: Noem holds news conference after deadly shooting by ICE in Minneapolis",
    "description": "State and local officials demanded ICE leave Minnesota after the unidentified ICE officer shot 37-year-old Renee Nicole Macklin Good in the head Wednesday morning. But Homeland Security Secretary Kristi Noem said agents won't be going anywhere.",
    "link": "https://www.pbs.org/newshour/nation/watch-live-noem-holds-news-conference-after-deadly-shooting-by-ice-in-minneapolis",
    "timestamp": "2026-01-08T15:58:23Z"
  },
  {
    "title": "Donald Trump Issues Ultimatum To California Amid Major Fraud Probe",
    "description": "The Trump administration has frozen federal funding for California’s child care and social services programs until the state proves that \"extensive and systemic fraud” is not being committed within its system.\nIn a letter addressed to Governor Gavin Newsom an…",
    "link": "https://biztoc.com/x/1a9dba20e56fbd6a",
    "timestamp": "2026-01-08T15:57:51Z"
  },
  {
    "title": "The glaring flaw in Trump’s plan to boost military spending to $1.5 trillion",
    "description": "As this week got underway, Donald Trump whined online that the “Fake News Media refuses to talk about” the $600 billion in revenue generated by his trade tariffs. And later the president, who’s earned a reputation for making up numbers that make him happy, to…",
    "link": "https://biztoc.com/x/7e4b3ad9b21fb33e",
    "timestamp": "2026-01-08T15:57:24Z"
  },
  {
    "title": "Protest planned at downtown federal building following Minneapolis ICE shooting",
    "description": "A labor-led coalition plans a protest outside the Edward J. Schwartz Federal Building today to \"demand an end to the bloodshed and inhumane treatment of immigrants by\" Immigrations and Customs Enforcement.",
    "link": "https://www.kpbs.org/news/border-immigration/2026/01/08/protest-planned-at-downtown-federal-building-following-minneapolis-ice-shooting",
    "timestamp": "2026-01-08T15:57:15Z"
  },
  {
    "title": "DeSantis Calls Special Session to Redraw Congressional Map",
    "description": "Florida's governor is pushing the congressional map fight right up to the wire. Ron DeSantis on Wednesday ordered a special legislative session for April 20-24 to redraw Florida's US House districts, timing it just days before the current April 24 candidate f…",
    "link": "https://www.newser.com/story/381579/desantis-calls-special-session-to-redraw-congressional-map.html",
    "timestamp": "2026-01-08T15:56:00Z"
  },
  {
    "title": "Why Maduro’s Ouster Scares Tehran",
    "description": "Could the Trump administration come for the Islamic Republic next?",
    "link": "https://www.theatlantic.com/international/2026/01/maduro-venezuela-iran/685551/",
    "timestamp": "2026-01-08T15:55:20Z"
  },
  {
    "title": "Donald Trump orders mass US pullout from international organisations (Financial Times)",
    "description": "Financial Times:\nDonald Trump orders mass US pullout from international organisations  —  Bodies targeted include key UN climate treaty and those promoting development, democracy and human rights  —  Donald Trump has decided to withdraw the US from the world'…",
    "link": "https://www.memeorandum.com/260108/p52",
    "timestamp": "2026-01-08T15:55:01Z"
  },
  {
    "title": "The Maduro Indictment Appears Legally Solid",
    "description": "Although the former Venezuelan leader has a number of options for challenging his prosecution, none of them is a sure bet.",
    "link": "https://www.theatlantic.com/ideas/2026/01/maduro-indictment-legal-analysis-noriega-precedent/685550/",
    "timestamp": "2026-01-08T15:54:39Z"
  },
  {
    "title": "Zelenskyy says US security guarantee text ready to be finalised with Trump",
    "description": "The comments come as the Kremlin slammed a plan for France and the UK to send peacekeepers to Ukraine after a ceasefire.",
    "link": "https://www.aljazeera.com/news/2026/1/8/zelenskyy-says-us-security-guarantee-text-ready-to-be-finalised-with-trump",
    "timestamp": "2026-01-08T15:53:50Z"
  },
  {
    "title": "Trump Team Races to Find Deals for His Greenland Vision",
    "description": "US officials are rushing to come up with options for business deals and other ways to step up links to Greenland, taken by surprise by President Donald Trump’s renewed demand to take over the island, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-team-races-to-find-deals-for-his-greenland-vision",
    "timestamp": "2026-01-08T15:53:48Z"
  },
  {
    "title": "Trump Calls Colombian President Gustavo Petro, Invites Him to White House During Petro's Anti-Trump Rally",
    "description": "President Donald Trump revealed on Wednesday evening that he held a conversation with radical Marxist Colombian President Gustavo Petro and invited him to the White House — while an anti-Trump protest organized by Petro was underway in Bogotá.\nThe post Trump …",
    "link": "https://www.breitbart.com/latin-america/2026/01/08/trump-calls-colombian-president-gustavo-petro-invites-him-to-white-house-during-petros-anti-trump-rally/",
    "timestamp": "2026-01-08T15:51:25Z"
  },
  {
    "title": "Defense Stocks Soar Again as Trump Plans Military Budget Boost (Lisa Pham/Bloomberg)",
    "description": "Lisa Pham / Bloomberg:\nDefense Stocks Soar Again as Trump Plans Military Budget Boost  —  President Donald Trump's plans to request an increase in the US military budget is giving a fresh boost to defense stocks around the world, with those in Europe having a…",
    "link": "https://www.memeorandum.com/260108/p51",
    "timestamp": "2026-01-08T15:50:01Z"
  },
  {
    "title": "Trump’s Hobbesian World Order",
    "description": "With its Venezuela operation, the US has effectively given China an open invitation to invade Taiwan, vindicated Russia’s invasion of Ukraine, and set the stage for more illegal US military actions. Large and rising powers – such as Germany, India, and Japan …",
    "link": "https://www.project-syndicate.org/commentary/us-attack-on-venezuela-implies-a-shift-toward-hobbesian-power-politics-by-shlomo-ben-ami-2026-01",
    "timestamp": "2026-01-08T15:49:16Z"
  },
  {
    "title": "El orden mundial hobbesiano de Trump",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/us-attack-on-venezuela-implies-a-shift-toward-hobbesian-power-politics-by-shlomo-ben-ami-2026-01/spanish",
    "timestamp": "2026-01-08T15:49:16Z"
  },
  {
    "title": "Jesse Watters: Woman ICE Killed Had 'Pronouns In Her Bio!'",
    "description": "Jesse Bailey Watters, who has genderfluid names (since he's being judgy, we can be petty), and divorced his first wife over his affair with a younger Fox News employee, Emma DiGiovine, who later became his second wife, and wonders if he's adopted since his mo…",
    "link": "https://crooksandliars.com/2026/01/jesse-watters-woman-ice-killed-had",
    "timestamp": "2026-01-08T15:49:00Z"
  },
  {
    "title": "US Trade Gap Shrinks to Smallest Since 2009 on Imports Drop",
    "description": "The US trade deficit unexpectedly narrowed in October to the smallest since 2009 on a sharp pullback in imports, notably pharmaceuticals.",
    "link": "https://financialpost.com/pmn/business-pmn/us-trade-gap-shrinks-to-smallest-since-2009-on-imports-drop",
    "timestamp": "2026-01-08T15:48:40Z"
  },
  {
    "title": "Two Pune engineering firms - KPIT and Persistent - are the stars of India’s tech services business",
    "description": "Their shares have surged 700% in the last five years, when those of the biggest IT services companies have risen less than 30%; these two companies are showing the path to a new model of growth",
    "link": "https://timesofindia.indiatimes.com/technology/times-techies/two-pune-engineering-firms-kpit-and-persistent-are-the-stars-of-indias-tech-services-business/articleshow/126417630.cms",
    "timestamp": "2026-01-08T15:48:39Z"
  },
  {
    "title": "Will the SCOTUS ruling on Trump tariffs jolt markets? What to know as the case comes up tomorrow",
    "description": "Trump tariff ruling impact on markets: Investors are on edge as the US Supreme Court prepares to rule on President Trump's emergency tariff powers. The decision, expected soon, could significantly impact stocks and bonds. A ruling against the tariffs might bo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-the-scotus-ruling-on-trump-tariffs-jolt-markets-what-to-know-as-the-case-comes-up-tomorrow/articleshow/126417820.cms",
    "timestamp": "2026-01-08T15:48:05Z"
  },
  {
    "title": "FNC's Ingraham: MN Democrats 'Will Incite More Violence, Especially Against ICE Agents'",
    "description": "Wednesday during her show's opening monologue, FNC's \"The Ingraham Angle\" host Laura Ingraham warned that overheated rhetoric from Minnesota Democrats could cause more violence, especially aimed at Immigration and Customs Enforcement (ICE) agents.\nThe post FN…",
    "link": "https://www.breitbart.com/clips/2026/01/08/fncs-ingraham-mn-democrats-will-incite-more-violence-especially-against-ice-agents/",
    "timestamp": "2026-01-08T15:47:36Z"
  }
]