[
  {
    "title": "Trump floats cutting China tariffs ‘substantially’ in trade deal",
    "description": "President Donald Trump said he plans to be “very nice” to China in any trade talks and that tariffs will drop if the two countries can reach a deal, a sign he may be backing down from his tough stance on Beijing amid market volatility.\n“It will come down subs…",
    "link": "https://biztoc.com/x/446167c3cb96d95f",
    "timestamp": "2025-04-23T03:48:56Z"
  },
  {
    "title": "The similarity in Donald Trump and Elon Musk’s family names: Two Kais. What does the name signify?",
    "description": "A Twitter post featuring Elon Musk dining with one of his sons sparked online discussion when the child was misidentified. Eva McMillan initially thought the boy was Griffin, Musk's eldest son, but Musk clarified it was Kai, one of his triplets. Kai, born in …",
    "link": "https://economictimes.indiatimes.com/magazines/panache/the-similarity-in-donald-trump-and-elon-musks-family-names-two-kais-what-does-the-name-signify/articleshow/120537362.cms",
    "timestamp": "2025-04-23T03:46:17Z"
  },
  {
    "title": "UK hosting new round of Ukraine talks",
    "description": "LONDON - Britain hosts a new round of talks on Wednesday involving the United States, Ukraine, and European nations amid a new US effort to end Russia's war in Ukraine.",
    "link": "https://www.bangkokpost.com/world/3009397/uk-hosting-new-round-of-ukraine-talks",
    "timestamp": "2025-04-23T03:45:00Z"
  },
  {
    "title": "Trump says won't fire Fed chief, signals China tariffs will come down",
    "description": "WASHINGTON &mdash; United States President Donald Trump said Tuesday he had no intention of firing the chair of the US Federal Reserve and signalled a \"substantial\" lowering of tariffs on China -- moves that brought relief to global markets spooked by his agg…",
    "link": "https://www.bangkokpost.com/business/general/3009402/trump-says-wont-fire-fed-chief-signals-china-tariffs-will-come-down",
    "timestamp": "2025-04-23T03:45:00Z"
  },
  {
    "title": "Pilgrims gather as Pope Francis' body moved to Basilica",
    "description": "VATICAN CITY - Pope Francis's coffin will be transferred to St Peter's Basilica Wednesday for three days of lying in state, with scores of Catholics and well-wishers expected to pay their respects to the beloved spiritual leader before he is laid to rest.",
    "link": "https://www.bangkokpost.com/world/3009392/pilgrims-gather-as-pope-francis-body-moved-to-basilica",
    "timestamp": "2025-04-23T03:45:00Z"
  },
  {
    "title": "Ryan Lizza Says Politico Hit Him With a Cease and Desist Over Substack Criticizing Trump Coverage",
    "description": "Politico's former Chief Washington Correspondent wrote on Monday that he \"saw up close how easy it was for a media conglomerate to grovel before the Trump administration\"\nThe post Ryan Lizza Says Politico Hit Him With a Cease and Desist Over Substack Criticiz…",
    "link": "https://www.thewrap.com/ryan-lizza-says-he-got-cease-and-desist-over-politico-criticism/",
    "timestamp": "2025-04-23T03:43:43Z"
  },
  {
    "title": "Dershowitz: Harvard Law Doesn't Focus on Principle and Produces People Like Schiff, Raskin, and Warren",
    "description": "On Tuesday’s broadcast of Newsmax TV’s “The Record,” Harvard Law Professor Emeritus Alan Dershowitz stated that “places like Harvard Law School don’t emphasize principle, morality, and neutrality. It’s all about who wins today.” And that produces people like …",
    "link": "https://www.breitbart.com/clips/2025/04/22/dershowitz-harvard-law-doesnt-focus-on-principle-and-produces-people-like-schiff-raskin-and-warren/",
    "timestamp": "2025-04-23T03:41:33Z"
  },
  {
    "title": "'60 Minutes' chief resigns in emotional meeting: 'The company is done with me'",
    "description": "Bill Owens, the executive producer of \"60 Minutes,\" resigned, citing encroachments on his journalistic independence due to pressure from both President Trump and Paramount leadership. Owens expressed concern over increased oversight and potential compromises …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/60-minutes-chief-resigns-in-emotional-meeting-the-company-is-done-with-me/articleshow/120538023.cms",
    "timestamp": "2025-04-23T03:40:55Z"
  },
  {
    "title": "Japan mulls expanding imports of LNG from the U.S. for tariff negotiations",
    "description": "In 2024, Japan imported ¥542.6 billion of LNG from the U.S.",
    "link": "https://www.japantimes.co.jp/business/2025/04/23/japan-lng-imports-us/",
    "timestamp": "2025-04-23T03:38:00Z"
  },
  {
    "title": "China tariffs will ‘come down substantially,’ Trump says, hinting at major U-turn on trade war",
    "description": "US President Donald Trump has signaled a major U-turn on his trade war with China, saying the high tariffs on Chinese goods will “come down substantially, but it won’t be zero.”",
    "link": "https://www.cnn.com/2025/04/22/business/trump-china-trade-war-reduction-hnk-intl/index.html",
    "timestamp": "2025-04-23T03:35:04Z"
  },
  {
    "title": "Trump says he has 'no intention of firing' Fed boss",
    "description": "Trump also expressed optimism that trade relations with China can be improved and a deal can be reached.",
    "link": "https://www.bbc.com/news/articles/c86jyw5jp6go?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-23T03:33:35Z"
  },
  {
    "title": "IISc, French scientists study droplets in microgravity, to aid bio printing in space",
    "description": "Indian and French scientists collaborated on microgravity experiments during the 68th CNES parabolic flight campaign, potentially revolutionizing material fabrication in space. IISc Professors Saptarshi Basu and Aloke Kumar, along with French counterparts, st…",
    "link": "https://timesofindia.indiatimes.com/science/iisc-french-scientists-study-droplets-in-microgravity-to-aid-bio-printing-in-space/articleshow/120537504.cms",
    "timestamp": "2025-04-23T03:30:48Z"
  },
  {
    "title": "Trump says won't fire Fed chief; signals China tariffs will come down",
    "description": "Donald Trump said Tuesday he had no intention of firing the chair of the US Federal Reserve and signalled a &quot;substantial&quot; lowering of tariffs on China -- moves that brought relief to global markets spooked by his aggressive policies. Trump's recent …",
    "link": "https://japantoday.com/category/business/trump-says-won%27t-fire-fed-chief-signals-china-tariffs-will-come-down",
    "timestamp": "2025-04-23T03:30:47Z"
  },
  {
    "title": "Elon Musk's late and unfulfilled Tesla promises",
    "description": "Musk’s Tesla promises face repeated delays: full self-driving remains incomplete, affordable EVs postponed to 2025, Cybercab robotaxis delayed to 2026 amid tariff issues, Cybertruck production started late in 2023, and the next-generation Roadster, initially …",
    "link": "https://economictimes.indiatimes.com/tech/technology/elon-musks-late-and-unfulfilled-tesla-promises/articleshow/120537584.cms",
    "timestamp": "2025-04-23T03:29:41Z"
  },
  {
    "title": "Trump signals softer trade stance with China, floats tariff reduction",
    "description": "US President Donald Trump has signaled a shift in his administration's trade approach toward China, indicating openness to a more conciliatory tone while maintaining leverage through high tariffs.",
    "link": "https://www.digitimes.com/news/a20250423VL205/donald-trump-language-bloomberg.html",
    "timestamp": "2025-04-23T03:29:37Z"
  },
  {
    "title": "John Bolton Predicts Exactly When Trump Will Boot Hegseth From Pentagon",
    "description": "Trump's former national security adviser shared a blunt reminder on when to \"take the garbage out.\"",
    "link": "https://www.huffpost.com/entry/cnn-john-bolton-trump-fire-pete-hegseth-signal-chats_n_68084347e4b0bd520808b1c2",
    "timestamp": "2025-04-23T03:28:23Z"
  },
  {
    "title": "Trump Says He’ll ‘Play Nice’ With China on Tariffs",
    "description": "President Donald Trump has pledged to be \"very nice\" to China in any trade talks. Trump told reporters in the White House that he ...",
    "link": "https://biztoc.com/x/0c6b02d66f787bb7",
    "timestamp": "2025-04-23T03:24:23Z"
  },
  {
    "title": "Sri Sri Ravishankar calls for action after Pahalgam terror attack; says 'not just enough to condemn'",
    "description": "Following the tragic terror attack in Pahalgam, spiritual leader Sri Sri Ravishankar urged global action against terrorism, emphasizing that condemnation alone is insufficient. Prime Minister Modi and Finance Minister Sitharaman cut short foreign visits, whil…",
    "link": "https://economictimes.indiatimes.com/news/india/sri-sri-ravishankar-calls-for-action-after-pahalgam-terror-attack-says-not-just-enough-to-condemn/articleshow/120537376.cms",
    "timestamp": "2025-04-23T03:23:50Z"
  },
  {
    "title": "The world leaders set to attend Pope Francis's funeral",
    "description": "World leaders are converging in Rome this Saturday for Pope Francis's funeral, drawing a massive crowd to St. Peter's Square. Dignitaries from the Americas, Europe, and Asia, including US President Donald Trump, Argentina's President Milei, and numerous Europ…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-world-leaders-set-to-attend-pope-franciss-funeral/articleshow/120537361.cms",
    "timestamp": "2025-04-23T03:23:27Z"
  },
  {
    "title": "Musk says he’ll spend less time working with Trump after Tesla profits sink",
    "description": "Tesla CEO says he will spend 'far more' of his time running carmaker after putting cost-cutting team in place.",
    "link": "https://www.aljazeera.com/economy/2025/4/23/musk-to-spend-more-time-running-tesla-after-profit-plunge",
    "timestamp": "2025-04-23T03:22:40Z"
  },
  {
    "title": "Trump Media inks deal with Crypto.com for ‘Made in America’ ETFs",
    "description": "US President Donald Trump’s media conglomerate, Trump Media and Technology Group, has signed an agreement with crypto exchange Crypto.com to launch exchange-traded funds “with a Made in America focus.”Trump Media, which operates the social media site Truth So…",
    "link": "https://cointelegraph.com/news/trump-media-inks-deal-cryptocom-made-in-america-etfs",
    "timestamp": "2025-04-23T03:21:46Z"
  },
  {
    "title": "President Trump Rains Down Praise On Granddaughter’s Golf Game, Says She Might Beat Him ‘Someday’",
    "description": "President Donald Trump rained down praise on his granddaughter Kai for her golf game in a new clip Monday that recapped her experience at UFC 314.",
    "link": "https://dailycaller.com/2025/04/22/donald-trump-kai-golf-miami-hurricanes-ufc-314/",
    "timestamp": "2025-04-23T03:21:10Z"
  },
  {
    "title": "Asian shares jump on hopes tariff war may subside and Trump won’t fire Federal Reserve chief",
    "description": "TOKYO (AP) — Asian shares mostly rose Wednesday, with markets showing relief after President Donald Trump indicated he won’t dismiss the head of the U.S. Federal Reserve. Japan’s benchmark Nikkei 225 gained 1.7% in morning trading to 34,797.22. Australia’s S&…",
    "link": "https://financialpost.com/pmn/asian-shares-jump-on-hopes-tariff-war-may-subside-and-trump-wont-fire-federal-reserve-chief",
    "timestamp": "2025-04-23T03:15:44Z"
  },
  {
    "title": "Shari Redstone kept tabs on '60 Minutes' segments on Trump (Max Tani/Semafor)",
    "description": "Max Tani / Semafor:\nShari Redstone kept tabs on ‘60 Minutes’ segments on Trump  —  THE SCOOP  —  Paramount owner Shari Redstone in recent days sought to know which upcoming 60 Minutes stories were about President Donald Trump, according to two people familiar…",
    "link": "https://www.memeorandum.com/250422/p151",
    "timestamp": "2025-04-23T03:15:00Z"
  },
  {
    "title": "Pilgrims Gather As Pope Francis Begins Lying In State",
    "description": "Pope Francis's coffin will be transferred to St Peter's Basilica Wednesday for three days of lying in state, with scores of Catholics and well-wishers expected to pay their respects to the beloved spiritual leader before he is laid to rest.",
    "link": "https://www.ibtimes.com/pilgrims-gather-pope-francis-begins-lying-state-3771030",
    "timestamp": "2025-04-23T03:12:21Z"
  },
  {
    "title": "Trump floats cutting China tariffs 'substantially' in trade deal",
    "description": "WASHINGTON &mdash; United States President Donald Trump said he plans to be \"very nice\" to China in any trade talks and that tariffs will drop if the two countries can reach a deal, a sign he may be backing down from his tough stance on Beijing amid market vo…",
    "link": "https://www.bangkokpost.com/business/general/3009370/trump-floats-cutting-china-tariffs-substantially-in-trade-deal",
    "timestamp": "2025-04-23T03:12:00Z"
  },
  {
    "title": "Pilgrims gather as Pope Francis begins lying in state",
    "description": "Pope Francis’s coffin will be transferred to St Peter’s Basilica Wednesday for three days of lying in state, with scores of Catholics and well-wishers expected to pay their respects to the beloved spiritual leader before he is laid to rest.  The body of the A…",
    "link": "https://www.digitaljournal.com/world/pilgrims-gather-as-pope-francis-begins-lying-in-state/article",
    "timestamp": "2025-04-23T03:07:20Z"
  },
  {
    "title": "Why markets are on edge and what could come next? Mark Mobius explains",
    "description": "Veteran emerging markets investor Mark Mobius has cautioned that market volatility is far from over, citing rising uncertainty around U.S. trade negotiations. In an interview with ET, Mobius said investors should brace themselves as the market is likely to ge…",
    "link": "https://m.economictimes.com/markets/stocks/news/why-markets-are-on-edge-and-what-could-come-next-mark-mobius-explains/global-uncertainty-builds/slideshow/120537222.cms",
    "timestamp": "2025-04-23T03:06:01Z"
  },
  {
    "title": "Netanyahu and Trump are in perfect harmony and there's no end in sight to Gaza war",
    "description": "Since Israel resumed fighting in Gaza, Washington and Jerusalem appear to have been coordinating their messaging. Sources in Washington say that the White House is not pressuring Netanyahu to end the war – in part because it does not want to jeopardize his co…",
    "link": "https://www.haaretz.com/israel-news/2025-04-23/ty-article/.premium/netanyahu-and-trump-are-in-perfect-harmony-and-theres-no-end-in-sight-to-gaza-war/00000196-5ee4-da53-a3fe-deeeb3ec0000",
    "timestamp": "2025-04-23T03:00:43Z"
  },
  {
    "title": "Asian Markets Rally As Trump Comments Ease Fed, China Trade Fears",
    "description": "Asian stocks rallied with Wall Street on Wednesday after Donald Trump said he had \"no intention\" of firing the head of the Federal Reserve and that eye-watering tariffs on China would be slashed drastically.",
    "link": "https://www.ibtimes.com/asian-markets-rally-trump-comments-ease-fed-china-trade-fears-3771025",
    "timestamp": "2025-04-23T03:00:22Z"
  },
  {
    "title": "China unlikely to fill void left by U.S. aid pullback, data shows",
    "description": "Observers say Beijing often ties access to assistance to backing China’s preferred policy positions.",
    "link": "https://www.japantimes.co.jp/news/2025/04/23/asia-pacific/politics/china-usaid-void-long-way/",
    "timestamp": "2025-04-23T02:58:00Z"
  },
  {
    "title": "Asian markets rally as Trump comments ease Fed, China trade fears",
    "description": "Asian stocks rallied with Wall Street on Wednesday after Donald Trump said he had “no intention” of firing the head of the Federal Reserve and that eye-watering tariffs on China would be slashed drastically. Global markets, already upended by a trade war, wer…",
    "link": "https://www.digitaljournal.com/world/asian-markets-rally-as-trump-comments-ease-fed-china-trade-fears/article",
    "timestamp": "2025-04-23T02:57:32Z"
  },
  {
    "title": "Asian markets rally as Trump comments ease Fed, China trade fears",
    "description": "Asian stocks rallied with Wall Street on Wednesday after Donald Trump said he had “no intention” of firing the head of the Federal Reserve and that eye-watering tariffs on China would be slashed drastically. Global markets, already upended by a trade war, wer…",
    "link": "https://www.digitaljournal.com/news/asian-markets-rally-as-trump-comments-ease-fed-china-trade-fears/article",
    "timestamp": "2025-04-23T02:57:32Z"
  },
  {
    "title": "Trump says won’t fire Fed chief, signals China tariffs will come down",
    "description": "Donald Trump said Tuesday he had no intention of firing the chair of the US Federal Reserve and signalled a “substantial” lowering of tariffs on China — moves that brought relief to global markets spooked by his aggressive policies. Trump’s recent outbursts a…",
    "link": "https://www.digitaljournal.com/world/trump-says-wont-fire-fed-chief-signals-china-tariffs-will-come-down/article",
    "timestamp": "2025-04-23T02:57:21Z"
  },
  {
    "title": "‘They’ve Reduced The Smear To Just People They Don’t Like’: Gutfeld Rips Democrats For Giving ‘Hitler A Makeover’",
    "description": "Fox News' Greg Gutfeld slammed Democrats Tuesday evening for \"giving Hitler a makeover\" as they continue comparing President Donald Trump to the Nazi leader.",
    "link": "https://dailycaller.com/2025/04/22/greg-gutfeld-democrats-donald-trump-compare-hitler/",
    "timestamp": "2025-04-23T02:57:18Z"
  },
  {
    "title": "Tesla's first-quarter gross margin beats estimates",
    "description": "Tesla’s Q1 gross margin beat expectations at 16.3% versus the 15.82% forecast, despite falling from 17.4% a year earlier. Strong growth in services and energy storage offset weaker EV sales. Revenue missed estimates, deliveries dropped 13%, and ongoing discou…",
    "link": "https://economictimes.indiatimes.com/tech/technology/teslas-first-quarter-gross-margin-beats-estimates/articleshow/120536296.cms",
    "timestamp": "2025-04-23T02:55:06Z"
  },
  {
    "title": "IMF Cuts Global Growth Outlook Amid Trump Tariffs, Has Warning For India Too",
    "description": "The global economic growth is set to slow down in the coming months, largely due to the trade war sparked by US President Donald Trump&#039;s steep tariffs on virtually all trading partners, the International Monetary Fund (IMF) said on Wednesday.",
    "link": "https://www.ndtv.com/world-news/imf-cuts-global-growth-outlook-amid-trump-tariffs-has-warning-for-india-too-8232366",
    "timestamp": "2025-04-23T02:52:47Z"
  },
  {
    "title": "Trump Says Won't Fire Fed Chief, Signals China Tariffs Will Come Down",
    "description": "Donald Trump said Tuesday he had no intention of firing the chair of the US Federal Reserve and signalled a \"substantial\" lowering of tariffs on China -- moves that brought relief to global markets spooked by his aggressive policies.",
    "link": "https://www.ibtimes.com/trump-says-wont-fire-fed-chief-signals-china-tariffs-will-come-down-3771024",
    "timestamp": "2025-04-23T02:51:09Z"
  },
  {
    "title": "Tiger King’s Joe Exotic Announces Marriage to Fellow Inmate",
    "description": "Joe Exotic's new husband is set to be released from prison in mid-2025 and then deported back to Mexico.\nTiger King’s Joe Exotic Announces Marriage to Fellow Inmate\nJo Vito",
    "link": "https://consequence.net/2025/04/tiger-king-joe-exotic-new-marriage/",
    "timestamp": "2025-04-23T02:49:55Z"
  },
  {
    "title": "Bullish trend to continue for Nifty, Sensex amid global turnaround",
    "description": "Positive global cues boost domestic markets, with US stocks surging after Trump's reassurance on Fed and China deal.",
    "link": "https://www.thehindubusinessline.com/markets/bullish-trend-to-continue-for-nifty-sensex-amid-global-turnaround/article69481074.ece",
    "timestamp": "2025-04-23T02:49:16Z"
  },
  {
    "title": "Oil Pushes Higher as Trump Signals No Intention to Ax Powell",
    "description": "Oil extended gains as President Donald Trump said he had no intention of firing Federal Reserve Chair Jerome Powell, while an industry report pointed to a large decline in US crude stockpiles.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-pushes-higher-as-trump-signals-no-intention-to-ax-powell",
    "timestamp": "2025-04-23T02:49:00Z"
  },
  {
    "title": "Ukraine presses for ceasefire as Russia reported to offer concession",
    "description": "Both sides are trying to demonstrate progress toward ending the war after U.S. President Donald Trump said he could walk away from peace talks if there is no breakthrough.",
    "link": "https://www.japantimes.co.jp/news/2025/04/23/world/politics/russia-ukraine-us-peace/",
    "timestamp": "2025-04-23T02:49:00Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,154",
    "description": "These are the key events on day 1,154 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/4/23/russia-ukraine-war-list-of-key-events-day-1154",
    "timestamp": "2025-04-23T02:48:34Z"
  },
  {
    "title": "India Hunts Gunmen Who Massacred 26 In Kashmir Tourist Hotspot",
    "description": "Indian security forces in Kashmir carried out a major manhunt Wednesday, a day after gunmen opened fire on tourists, slaughtering at least 26 people in the region's deadliest attack on civilians since 2000.",
    "link": "https://www.ibtimes.com/india-hunts-gunmen-who-massacred-26-kashmir-tourist-hotspot-3771018",
    "timestamp": "2025-04-23T02:48:19Z"
  },
  {
    "title": "India Hunts Gunmen Who Massacred 26 In Kashmir Tourist Hotspot",
    "description": "Indian security forces in Kashmir carried out a major manhunt Wednesday, a day after gunmen opened fire on tourists, slaughtering at least 26 people in the region's deadliest attack on civilians since 2000.",
    "link": "https://www.ibtimes.com.au/india-hunts-gunmen-who-massacred-26-kashmir-tourist-hotspot-1858130",
    "timestamp": "2025-04-23T02:48:17Z"
  },
  {
    "title": "India hunts gunmen who massacred 26 in Kashmir tourist hotspot",
    "description": "Indian security forces in Kashmir carried out a major manhunt Wednesday, a day after gunmen opened fire on tourists, slaughtering at least 26 people in the region’s deadliest attack on civilians since 2000. Prime Minister Narendra Modi decried the “heinous ac…",
    "link": "https://www.digitaljournal.com/world/india-hunts-gunmen-who-massacred-26-in-kashmir-tourist-hotspot/article",
    "timestamp": "2025-04-23T02:48:16Z"
  },
  {
    "title": "\"Undue Government Intrusion\": US After Colleges Unite Against Trump",
    "description": "More than 100 educational institutions issued a joint letter earlier Tuesday condemning President Donald Trump&#039;s undue &quot;intrusion.&quot;",
    "link": "https://www.ndtv.com/world-news/undue-government-intrusion-us-after-colleges-unite-against-trump-8232323",
    "timestamp": "2025-04-23T02:45:39Z"
  },
  {
    "title": "India hunts gunmen who massacred 26 in Kashmir tourist hotspot",
    "description": "PAHALGAM - Indian security forces in Kashmir carried out a major manhunt Wednesday, a day after gunmen opened fire on tourists, slaughtering at least 26 people in the region's deadliest attack on civilians since 2000.",
    "link": "https://www.bangkokpost.com/world/3009346/india-hunts-gunmen-who-massacred-26-in-kashmir-tourist-hotspot",
    "timestamp": "2025-04-23T02:45:00Z"
  },
  {
    "title": "China Turns to Middle East LPG to Replace Tariff-Hit US Flows",
    "description": "Chinese plastics plants that buy liquefied petroleum gas are turning to the Middle East to replace tariff-hit imports from the US, disrupting global flows and reviving moribund freight rates.",
    "link": "https://financialpost.com/pmn/business-pmn/china-turns-to-middle-east-lpg-to-replace-tariff-hit-us-flows",
    "timestamp": "2025-04-23T02:43:56Z"
  },
  {
    "title": "Yemeni official: US airstrikes in Yemen have killed 500 Houthis, including top commanders",
    "description": "At least 500 Houthi terrorists, including senior figures behind maritime attacks, have been killed by recent US strikes in Yemen, according to Yemeni officials.",
    "link": "https://www.israelnationalnews.com/news/407243",
    "timestamp": "2025-04-23T02:39:13Z"
  },
  {
    "title": "Trump Softens Tone on Jerome Powell, and the Federal Reserve Chair May Have Senator Kennedy to Thank for It",
    "description": "As RedState reported earlier, Sen. John Kennedy (R-LA) did an interview on \"Meet the Press\" Sunday, where he dropped facts on Sen. Chris Van Hollen (D-MD) on the issue of whether suspected MS-13 gang member Kilmar Abrego Garcia, who was deported to El Salvado…",
    "link": "https://freerepublic.com/focus/f-news/4312689/posts",
    "timestamp": "2025-04-23T02:38:16Z"
  },
  {
    "title": "Tesla profit plummets, Musk vows to devote more time to EV firm",
    "description": "Tesla boss Elon Musk will cut back on his commitment to the Trump administration's DOGE and recommit to the carmaker, in a move cheered by investors after what analysts have called a \"disaster\" result.",
    "link": "https://www.abc.net.au/news/2025-04-23/tesla-profit-sales-plunge-elon-musk-cuts-back-on-doge/105205320",
    "timestamp": "2025-04-23T02:37:51Z"
  },
  {
    "title": "Trump says he has 'no intention' of firing Fed Chair Jerome Powell",
    "description": "President Donald Trump appeared late Tuesday to lower the temperature following days of attacks against Federal Reserve Chair Jerome Powell, saying he wouldn’t seek to oust the central bank chief.Read more...",
    "link": "https://qz.com/trump-fed-chair-jerome-powell-fire-stocks-markets-1851777403",
    "timestamp": "2025-04-23T02:35:14Z"
  },
  {
    "title": "'Reconsider': Tom Cotton begs Trump for disaster relief — after opposing it for Dem states (David Edwards/Raw Story)",
    "description": "David Edwards / Raw Story:\n‘Reconsider’: Tom Cotton begs Trump for disaster relief — after opposing it for Dem states  —  Sen. Tom Cotton (R-AR) pleaded with President Donald Trump to “reconsider” his denial of disaster relief after tornadoes hit Arkansas.  —…",
    "link": "https://www.memeorandum.com/250422/p147",
    "timestamp": "2025-04-23T02:35:00Z"
  },
  {
    "title": "Pahalgam terror attack: Rahul Gandhi speaks to HM Amit Shah, calls for justice after 28 killed in Kashmir",
    "description": "Following the deadly terror attack in Pahalgam, J&K, which claimed numerous lives, Rahul Gandhi contacted Amit Shah, Omar Abdullah, and Tariq Karra to get updates. The attack, which targeted tourists in Anantnag, has sparked widespread condemnation and protes…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/pahalgam-terror-attack-rahul-gandhi-speaks-to-hm-amit-shah-calls-for-justice-after-28-killed-in-kashmir/articleshow/120535295.cms",
    "timestamp": "2025-04-23T02:34:04Z"
  },
  {
    "title": "UK hosts new round of Ukraine talks",
    "description": "Britain hosts a new round of talks on Wednesday involving the United States, Ukraine, and European nations amid a new US effort to end Russia’s war in Ukraine. US presidential envoy Steve Witkoff is to visit Moscow this week, the White House has confirmed, in…",
    "link": "https://www.digitaljournal.com/world/uk-hosts-new-round-of-ukraine-talks/article",
    "timestamp": "2025-04-23T02:33:19Z"
  },
  {
    "title": "'Repulsed': MSNBC's Rachel Maddow tears into Elon Musk after Tesla's 'disastrous day'",
    "description": "Tech billionaire Elon Musk is suffering the consequences of the growing unpopularity of President Donald Trump’s policies, which the head of the Department of Government Efficiency has become deeply associated with, according to MSNBC’s Rachel Maddow. The pri…",
    "link": "https://www.rawstory.com/rachel-maddow-show-2671825680/",
    "timestamp": "2025-04-23T02:30:34Z"
  },
  {
    "title": "UK Hosts New Round Of Ukraine Talks",
    "description": "Britain hosts a new round of talks on Wednesday involving the United States, Ukraine, and European nations amid a new US effort to end Russia's war in Ukraine.",
    "link": "https://www.ibtimes.com/uk-hosts-new-round-ukraine-talks-3771016",
    "timestamp": "2025-04-23T02:30:21Z"
  },
  {
    "title": "Japan must correct Trump’s false data for trade talks, says Kono",
    "description": "Kono said matters related to regional security shouldn’t be discussed as part of the trade talks, nor should the question of how best to manage relationships with China.",
    "link": "https://www.japantimes.co.jp/business/2025/04/23/taro-kono-us-japan-trade-talks/",
    "timestamp": "2025-04-23T02:29:00Z"
  },
  {
    "title": "Ex-Giants, Jets kicker Jay Feely reveals how Trump assassination attempt inspired him to run for Congress",
    "description": "Feely, 48, is running in the 2026 election for the congressional seat currently occupied by former House Freedom Caucus Chairman Andy Biggs, who is a gubernatorial candiate in the Grand Canyon State.",
    "link": "https://nypost.com/2025/04/22/us-news/ex-giants-jets-kicker-jay-feely-runs-for-congress-in-arizona/",
    "timestamp": "2025-04-23T02:27:49Z"
  },
  {
    "title": "Yemen's Houthi rebels fire a missile targeting northern Israel, a rare target for the group",
    "description": "Yemen’s Houthi rebels have launched a missile toward northern Israel, a rare target for the group as a monthlong intense U.S. airstrike campaign continues to target them",
    "link": "https://abcnews.go.com/International/wireStory/yemens-houthi-rebels-fire-missile-targeting-northern-israel-121071153",
    "timestamp": "2025-04-23T02:22:47Z"
  },
  {
    "title": "NYC mayor and Trump border czar tout charges against 27 people in Tren de Aragua case",
    "description": "President Donald Trump’s border czar joined New York City’s mayor on Tuesday to tout new federal charges against 27 people accused of being Tren de Aragua gang members and associates",
    "link": "https://abcnews.go.com/Politics/wireStory/nyc-mayor-trump-border-czar-tout-charges-27-121066462",
    "timestamp": "2025-04-23T02:22:28Z"
  },
  {
    "title": "EPA chief demands that Mexico stop Tijuana sewage from flowing into California",
    "description": "The head of the Environmental Protection Agency says his agency will be providing Mexico a list to complete to stop the flow of sewage from Tijuana",
    "link": "https://abcnews.go.com/Health/wireStory/epa-chief-demands-mexico-stop-tijuana-sewage-flowing-121066106",
    "timestamp": "2025-04-23T02:22:15Z"
  },
  {
    "title": "Russia resumes attacks on Ukraine after Easter truce",
    "description": "Kyiv, Ukraine (AFP) April 21, 2025 -\n\n Russia launched a wave of aerial attacks at Ukraine on Monday in an abrupt end to a fragile 30-hour Easter truce between the two sides.\n\nThe renewed strikes, confirmed by both Moscow and Kyiv, cast doubt on Donald Trump'…",
    "link": "https://www.spacewar.com/reports/Russia_resumes_attacks_on_Ukraine_after_Easter_truce_999.html",
    "timestamp": "2025-04-23T02:18:52Z"
  },
  {
    "title": "UK hosts new Ukraine talks after Russian strikes shatter brief truce",
    "description": "London (AFP) April 23, 2025 -\n\n Envoys from Washington, Kyiv and European nations gathered for talks in Britain on Wednesday amid a new US push to end Russia's war in Ukraine, where a brief Easter truce was shattered by fresh air strikes.\n\nUS presidential env…",
    "link": "https://www.spacewar.com/reports/UK_hosts_new_Ukraine_talks_after_Russian_strikes_shatter_brief_truce_999.html",
    "timestamp": "2025-04-23T02:18:52Z"
  },
  {
    "title": "Nordics, Lithuania plan joint purchase of combat vehicles",
    "description": "Stockholm (AFP) April 22, 2025 -\n\n Sweden, Finland, Norway and Lithuania plan to beef up military capabilities around the Baltic Sea with a joint order for several hundred CV90 combat vehicles, Swedish Prime Minister Ulf Kristersson said Tuesday.\n\nKristersson…",
    "link": "https://www.spacewar.com/reports/Nordics_Lithuania_plan_joint_purchase_of_combat_vehicles_999.html",
    "timestamp": "2025-04-23T02:18:25Z"
  },
  {
    "title": "Pedro Pascal Advocates For Trans Rights At ‘Thunderbolts’ London Premiere With “Protect The Dolls” T-Shirt",
    "description": "Pedro Pascal is expressing his support for the transgender community and made a big statement at the Thunderbolts premiere in London. The Last of Us actor made an appearance at the Cineworld Leicester Square in support of the Marvel film, sporting the viral “…",
    "link": "http://deadline.com/2025/04/pedro-pascal-trans-rights-thunderbolts-protect-the-dolls-t-shirt-1236374582/",
    "timestamp": "2025-04-23T02:18:09Z"
  },
  {
    "title": "[Josh Blackman] A Tale Of Two Shadow Dockets",
    "description": "The Supreme Court moves heaven and earth to block removal of alleged gang members who are almost certainly removable, but says nothing about Ohio initiative process being declared unconstitutional.",
    "link": "https://reason.com/volokh/2025/04/22/a-tale-of-two-shadow-dockets/",
    "timestamp": "2025-04-23T02:17:23Z"
  },
  {
    "title": "The MAGA crew is waving white flags towards the Fed, China and Tesla investors",
    "description": "Tuesday wasn’t a great day for Donald Trump and his MAGA mates. But it was a great day for financial markets.",
    "link": "https://www.smh.com.au/business/companies/the-maga-crew-is-waving-white-flags-towards-the-fed-china-and-tesla-investors-20250423-p5ltll.html",
    "timestamp": "2025-04-23T02:16:37Z"
  },
  {
    "title": "Paramount’s Shari Redstone Says Freedom of the Press Means ‘Giving the Facts, Not Opinions’",
    "description": "The non-executive chairwoman spoke with TheWrap at the premiere of the documentary \"Children of October 7,\" hours after \"60 Minutes\" EP Bill Owens quit the newsmagazine show\nThe post Paramount’s Shari Redstone Says Freedom of the Press Means ‘Giving the Facts…",
    "link": "https://www.thewrap.com/shari-redstone-freedom-of-the-press-paramount-60-minutes/",
    "timestamp": "2025-04-23T02:15:53Z"
  },
  {
    "title": "Pahalgam Terror Attack Updates: PM Modi Holds Brief Meeting At Airport After Saudi Visit",
    "description": "Pahalgam terror attack updates: The attack took place at Baisaran, a meadow accessible only on foot or by pony. 1 minute agoKashmir terror attack updates: At least 26 civilians, mostly tourists, were killed in a terror attack in Pahalgam in Jammu and Kashmir'…",
    "link": "https://freerepublic.com/focus/f-news/4312685/posts",
    "timestamp": "2025-04-23T02:13:03Z"
  },
  {
    "title": "Trump Signals Step Back On China Tariffs, Says They’ll ‘Come Down Substantially’",
    "description": "President Donald Trump signaled Tuesday evening from the Oval Office that the U.S. will ease tariffs on China, saying they’ll “come down substantially” but won’t be eliminated entirely.",
    "link": "https://dailycaller.com/2025/04/22/donald-trump-china-tariffs/",
    "timestamp": "2025-04-23T02:12:02Z"
  },
  {
    "title": "South Korea to seek speedy solution on auto tariffs in US trade talks",
    "description": "SEOUL :South Korea's Industry Minister Ahn Duk-geun said on Wednesday that Seoul will seek a speedy solution over auto tariffs in trade talks with U.S. counterparts and is also prepared for the prospect of Washington bringing up the issue of defence costs. U.…",
    "link": "https://www.channelnewsasia.com/business/south-korea-seek-speedy-solution-auto-tariffs-us-trade-talks-5082366",
    "timestamp": "2025-04-23T02:10:39Z"
  },
  {
    "title": "Sarah Palin Loses Defamation Suit Retrial Against the New York Times",
    "description": "Former Republican Alaska Gov. Sarah Palin has lost her defamation suit retrial against the New York Times.\nThe post Sarah Palin Loses Defamation Suit Retrial Against the New York Times appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/22/sarah-palin-loses-defamation-suit-retrial-new-york-times/",
    "timestamp": "2025-04-23T02:10:23Z"
  },
  {
    "title": "Tesla Q1 Falls Far Short, Musk to Scale Back DOGE Involvement",
    "description": "Tesla CEO Elon Musk said Tuesday (April 22) that the time he spends with the Department of Government Efficiency, or DOGE, will “drop significantly” starting in May. During Tesla’s Q1 earnings call, Musk said and he will be devoting “far more” of his time to …",
    "link": "https://www.pymnts.com/transportation/2025/tesla-q1-falls-far-short-musk-to-scale-back-doge-involvement/",
    "timestamp": "2025-04-23T02:10:18Z"
  },
  {
    "title": "Fed's Kashkari says 'too soon to judge' interest rate path",
    "description": "Neel Kashkari, President of the Federal Reserve Bank of Minnesota, stated that it's premature to determine how tariffs will impact interest rates, inflation, and the economy. He acknowledged the uncertainty surrounding trade policy is causing anxiety and hind…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-kashkari-says-too-soon-to-judge-interest-rate-path/articleshow/120535134.cms",
    "timestamp": "2025-04-23T02:08:00Z"
  },
  {
    "title": "The Fourth Circuit's Opinion in the Abrego García Case",
    "description": "a line-by-line reading",
    "link": "https://writing.kemitchell.com/2025/04/20/Fourth-Circuit-Abrego-Garcia",
    "timestamp": "2025-04-23T02:06:37Z"
  },
  {
    "title": "Ryan Lizza’s Exit from Politico Gets Hostile After Company Lawyers Demand He Delete Substack Post",
    "description": "Ryan Lizza's brand new Substack, Telos, is barely a day old and it's already sparked a conflict with his former employer, Politico.\nThe post Ryan Lizza’s Exit from Politico Gets Hostile After Company Lawyers Demand He Delete Substack Post first appeared on Me…",
    "link": "https://www.mediaite.com/media/ryan-lizzas-exit-from-politico-gets-hostile-after-company-lawyers-demand-he-delete-substack-post/",
    "timestamp": "2025-04-23T02:06:20Z"
  },
  {
    "title": "Trump says crypto needs regulatory certainty",
    "description": "WASHINGTON :U.S. President Donald Trump said on Tuesday that the crypto industry needs regulatory certainty and clear rules of the road that Securities and Exchange Commission Chairman Paul Atkins will work on providing.\"He's the perfect man to lead this agen…",
    "link": "https://www.channelnewsasia.com/business/trump-says-crypto-needs-regulatory-certainty-5082356",
    "timestamp": "2025-04-23T02:05:58Z"
  },
  {
    "title": "Trump says he has no plans to fire Fed's Powell; market jumps",
    "description": "President Trump has softened his stance on firing Federal Reserve Chair Jerome Powell, reassuring markets after previous threats rattled investors. While stating he has no intention of firing Powell, Trump still wants the Fed to cut interest rates. This devel…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-says-he-has-no-plans-to-fire-feds-powell-market-jumps/articleshow/120535114.cms",
    "timestamp": "2025-04-23T02:05:15Z"
  },
  {
    "title": "Peter Dutton’s run of terrible, horrible, no good, very bad luck",
    "description": "There's a whole lot of excuses for Peter Dutton's historically bad polling figures as early voting opens. We rounded up as many as we could. \nThe post Peter Dutton’s run of terrible, horrible, no good, very bad luck appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/04/23/peter-duttons-federal-election-campaign-francis-trump-petrol/",
    "timestamp": "2025-04-23T02:05:15Z"
  },
  {
    "title": "JD Vance says US-India ties can prevent 'dark time for all humanity'",
    "description": "Despite warm relations with Indian Prime Minister Narendra Modi, US President Donald Trump has slammed the South Asian country as a \"tariff abuser\".",
    "link": "https://www.abc.net.au/news/2025-04-23/jd-vance-warns-dark-times-without-close-us-india-relations/105200682",
    "timestamp": "2025-04-23T02:04:48Z"
  },
  {
    "title": "Trump Admin Handed New Deadline in Kilmar Garcia Case Amid Scathing Order",
    "description": "Judge Xinis blasted the Trump administration in the order on Tuesday night.",
    "link": "https://www.newsweek.com/trump-admin-handed-new-deadline-kilmar-garcia-case-amid-scathing-order-2062824",
    "timestamp": "2025-04-23T02:04:15Z"
  },
  {
    "title": "Tapper Rips CBS Owner for 60 Minutes Shakeup Amid Trump Pressure: ‘Hope the Money’s Worth It, Shari’",
    "description": "\"Now, Shari Redstone is the majority owner of paramount, and she stands to make a fortune if this multibillion dollar deal, this merger goes through.\"\nThe post Tapper Rips CBS Owner for 60 Minutes Shakeup Amid Trump Pressure: ‘Hope the Money’s Worth It, Shari…",
    "link": "https://www.mediaite.com/tv/tapper-rips-cbs-owner-after-60-minutes-shakeup-amid-trump-pressure-hope-the-moneys-worth-it-shari/",
    "timestamp": "2025-04-23T02:04:10Z"
  },
  {
    "title": "\"Sudden Drop In Income\": WHO Announces Layoffs Amid US Funding Cuts",
    "description": "The United Nations health agency has been bracing for President Donald Trump&#039;s planned full withdrawal of the United States -- by far its largest donor -- next January.",
    "link": "https://www.ndtv.com/world-news/sudden-drop-in-income-who-announces-layoffs-amid-us-funding-cuts-8232157",
    "timestamp": "2025-04-23T02:02:28Z"
  },
  {
    "title": "Left Wing Podcaster Explodes on Rahm Emanuel, Claims MAGA is Obsessed With Gender Issues and Trans People (VIDEO)",
    "description": "In a fiery exchange, podcaster Jennifer Welch challenges Rahm Emanuel on the Democratic Party's stance toward gender issues, asserting that MAGA's obsession with these topics undermines key values. This clash raises critical questions about party priorities.\n…",
    "link": "https://www.thegatewaypundit.com/2025/04/left-wing-podcaster-explodes-rahm-emanuel-claims-maga/",
    "timestamp": "2025-04-23T02:00:26Z"
  },
  {
    "title": "'Karma': Fiery Trump spokesman celebrates '60 Minutes' resignation with profane post",
    "description": "A spokesman for President Donald Trump, known for his inflammatory statements, took the opportunity late Tuesday to publicly jab a former executive producer for \"60 Minutes,\" who resigned Tuesday due to concerns the company was interfering with their editoria…",
    "link": "https://www.rawstory.com/60-minutes/",
    "timestamp": "2025-04-23T01:59:52Z"
  },
  {
    "title": "Oil rises 1% on Iran sanctions, drop in US crude stocks",
    "description": "Oil prices saw a rise on Wednesday. This happened because of new Iran sanctions. Also, US crude stocks dropped. Donald Trump's comments on the Federal Reserve also helped. Brent crude futures increased. US West Texas Intermediate crude also went up. The US im…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-rises-1-on-iran-sanctions-drop-in-us-crude-stocks/articleshow/120535072.cms",
    "timestamp": "2025-04-23T01:58:45Z"
  },
  {
    "title": "Scientists sound alarm as Trump reshapes US research landscape",
    "description": "From cancer cures to climate change, President Donald Trump's administration has upended the American research landscape, threatening the United States' standing as a global science leader and sowing fear over jobs and funding. Some will leave, but many may s…",
    "link": "https://timesofindia.indiatimes.com/world/us/scientists-sound-alarm-as-trump-reshapes-us-research-landscape/articleshow/120534991.cms",
    "timestamp": "2025-04-23T01:58:15Z"
  },
  {
    "title": "Dollar surges as Trump backs down from threat to fire Fed's Powell",
    "description": "The U.S. dollar surged against major currencies after President Trump eased concerns about firing Federal Reserve Chair Jerome Powell. This followed Trump's earlier attacks on Powell for not cutting interest rates. Optimism regarding U.S.-China trade relation…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-surges-as-trump-backs-down-from-threat-to-fire-feds-powell/articleshow/120535047.cms",
    "timestamp": "2025-04-23T01:56:50Z"
  },
  {
    "title": "Zelenskyy pushes back on ceding Ukrainian land in potential peace deal ahead of London talks",
    "description": "President Zelenskyy firmly rejected ceding Ukrainian territory to Russia amid U.S. proposals for a peace deal, as high-level talks are set to occur in London. While some allies are wary of the U.S. proposal, Russia continues attacks, and negotiations face hur…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskyy-pushes-back-on-ceding-ukrainian-land-in-potential-peace-deal-ahead-of-london-talks/articleshow/120535046.cms",
    "timestamp": "2025-04-23T01:56:49Z"
  },
  {
    "title": "This election, Gen Z and Millennials hold most of the voting power. How might they wield it?",
    "description": "Young voters will decide who makes up Australia’s next government. Here’s how they might vote.",
    "link": "https://theconversation.com/this-election-gen-z-and-millennials-hold-most-of-the-voting-power-how-might-they-wield-it-252803",
    "timestamp": "2025-04-23T01:55:41Z"
  },
  {
    "title": "Gold eases as Trump backs off from threats to fire Fed Chair",
    "description": "Gold prices saw a decline. This happened after US President Donald Trump softened his stance on the Federal Reserve chair. Treasury Secretary Scott Bessent hinted at easing trade tensions. This reduced gold's appeal as a safe investment. Silver saw a slight i…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-eases-as-trump-backs-off-from-threats-to-fire-fed-chair/articleshow/120535031.cms",
    "timestamp": "2025-04-23T01:54:47Z"
  },
  {
    "title": "Wall Street ends higher on earnings, hopes of easing tariff tensions",
    "description": "U.S. stocks surged on Tuesday, fueled by encouraging earnings reports and signals of easing U.S.-China trade tensions. President Trump's remarks about potential tariff reductions and his support for Federal Reserve Chair Jerome Powell further boosted investor…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-on-earnings-hopes-of-easing-tariff-tensions/articleshow/120535004.cms",
    "timestamp": "2025-04-23T01:52:41Z"
  },
  {
    "title": "Sebastian Stan Names 1 Thing He Thinks Trump Liked About 'The Apprentice'",
    "description": "The actor, who stars as a younger Trump in the film, revealed why he'd \"put money down\" that the president has seen his Oscar-nominated performance.",
    "link": "https://www.huffpost.com/entry/sebastian-stan-donald-trump-the-apprentice-seen-100-times_n_6808313be4b05f43aef27b05",
    "timestamp": "2025-04-23T01:52:41Z"
  },
  {
    "title": "Only a third of Australians support increasing defence spending: new research",
    "description": "The major parties have made defence a central part of their election campaigns. A new survey suggests, however, this is not cutting through with the public.",
    "link": "https://theconversation.com/only-a-third-of-australians-support-increasing-defence-spending-new-research-253943",
    "timestamp": "2025-04-23T01:51:42Z"
  }
]