[
  {
    "title": "Over 40 million student-loan borrowers' accounts will be transferred to the SBA 'immediately,' Trump says",
    "description": "President Donald Trump said the SBA will handle student loans.\nROBERTO SCHMIDT/AFP via Getty Images\nTrump said student loans are moving out of the Department of Education and into the Small Business Administration.\nHe also said that HHS will be taking over \"s…",
    "link": "https://biztoc.com/x/8b0d5a15051616d3",
    "timestamp": "2025-03-21T16:49:27Z"
  },
  {
    "title": "Did Trump Just Abolish the Department of Education?",
    "description": "While he can't get rid of the department outright, a new executive order attempts the next best thing.",
    "link": "https://reason.com/2025/03/21/did-trump-just-abolish-the-department-of-education/",
    "timestamp": "2025-03-21T16:49:00Z"
  },
  {
    "title": "Trump asks the Supreme Court to stop judges from blocking his policies",
    "description": "President Donald Trump has railed in recent weeks against federal judges who have ruled against his administration, painting them as threats to the country and demanding that the Supreme Court halt all nationwide injunctions.",
    "link": "https://biztoc.com/x/0ca009ec9e28037d",
    "timestamp": "2025-03-21T16:48:57Z"
  },
  {
    "title": "Trump says student loans will be handled by Small Business Administration",
    "description": "President Donald Trump said Friday that the Small Business Administration, instead of the Education Department, would handle the country's student loans.",
    "link": "https://biztoc.com/x/33f74ceda7c7d425",
    "timestamp": "2025-03-21T16:48:55Z"
  },
  {
    "title": "Mixxy Mayor Adams Overshares On Dating, Xitter Is In Disbelief",
    "description": "New York City Mayor Eric Adams created another viral moment when he led off a town hall meeting in the Rockaways section of Queens by reflecting on a former girlfriend he dated there, leading social media users to respond in disbelief.",
    "link": "https://hiphopwired.com/playlist/mixxy-mayor-adams-overshares-on-dating-xitter-is-in-disbelief/",
    "timestamp": "2025-03-21T16:48:54Z"
  },
  {
    "title": "Over 40 million student-loan borrowers' accounts will be transferred to the SBA 'immediately,' Trump says",
    "description": "Trump said \"special needs\" education and nutrition programs will be handled by HHS and the Small Business Administration will handle student loans.",
    "link": "https://www.businessinsider.com/trump-student-loans-moving-to-sba-away-from-education-department-2025-3",
    "timestamp": "2025-03-21T16:45:54Z"
  },
  {
    "title": "Tennessee Mayor and Former WWE Legend Challenges Tampon Tim to “Tennessee Walz” Charity Wrestling Match",
    "description": "Tennessee Mayor and former WWE star takes aim at Tim Walz's audacious remarks, calling for accountability on his brash claims against Trump supporters. The confrontation highlights a growing divide in political rhetoric.\nThe post Tennessee Mayor and Former WW…",
    "link": "https://www.thegatewaypundit.com/2025/03/tennessee-mayor-former-wwe-legend-challenges-tampon-tim/",
    "timestamp": "2025-03-21T16:45:29Z"
  },
  {
    "title": "Trump Awards Next-generation F-47 Fighter Jet Contract To Boeing",
    "description": "Donald Trump announced Friday that Boeing has been awarded the contract for the Air Force's next-generation stealth fighter plane, which the 47th US president said would be named the F-47.",
    "link": "https://www.ibtimes.com/trump-awards-next-generation-f-47-fighter-jet-contract-boeing-3767226",
    "timestamp": "2025-03-21T16:45:17Z"
  },
  {
    "title": "A Note On Strategy",
    "description": "Toward the end of Ezra Klein’s interview with Gillian Tett, a more general strategic point comes up  [The previous Washington consensus] is that America was made stronger by being the dominant or strongest figure in these various global alliances and institut…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/a-note-on-strategy-2",
    "timestamp": "2025-03-21T16:45:12Z"
  },
  {
    "title": "‘Completely Fake’: Trump Admin Shoots Down NYT Report That Musk Would Get China War Briefing",
    "description": "President Donald Trump's administration shot down a report by The New York Times that Elon Musk visited the Pentagon Friday for a briefing on China.",
    "link": "https://dailycaller.com/2025/03/21/trump-admin-shoots-down-nyt-report-musk-china-briefing/",
    "timestamp": "2025-03-21T16:44:45Z"
  },
  {
    "title": "Trump says student loans will be handled by Small Business Administration",
    "description": "President Donald Trump said Friday that the Small Business Administration, instead of the Education Department, would handle the country's student loans.",
    "link": "https://www.cnbc.com/2025/03/21/student-loans-will-be-handled-by-small-business-administration-trump.html",
    "timestamp": "2025-03-21T16:44:40Z"
  },
  {
    "title": "‘Such garbage!’ Trump question time goes off rails as he melts down over Musk report",
    "description": "A White House press conference went off the rails Friday as President Donald Trump was asked about a New York Times report — and he descended into a furious rant.Trump was asked by Fox News’ Peter Doocy about the Times’ story, published late Thursday, that cl…",
    "link": "https://www.rawstory.com/trump-china-musk/",
    "timestamp": "2025-03-21T16:44:18Z"
  },
  {
    "title": "Iraq’s former PM visits Houthis amid US strikes and Houthi attacks on ships, Israel",
    "description": "Former Iraqi Prime Minister Adil Abdul-Mahdi traveled to Houthi-controlled Sanaa in Yemen on March 20, according to reports in Iranian and Yemeni media. His visit occurred as the US continued its campaign of airstrikes against the Iranian-backed Houthis. Sour…",
    "link": "https://www.longwarjournal.org/archives/2025/03/iraqs-former-pm-visits-houthis-amid-us-strikes-and-houthi-attacks.php",
    "timestamp": "2025-03-21T16:44:02Z"
  },
  {
    "title": "‘He’s A Loser’: Trump Says He Thinks Tim Walz Was Rare VP Candidate That ‘Played A Part’ In Presidential Ticket’s Loss",
    "description": "Donald Trump said that he believes Democratic Minnesota Gov. Tim Walz unusually influenced former Vice President Kamala Harris' November election loss.",
    "link": "https://dailycaller.com/2025/03/21/trump-walz-was-rare-vp-candidate-part-presidential-tickets-loss/",
    "timestamp": "2025-03-21T16:43:10Z"
  },
  {
    "title": "America Looks Like a Troubled Emerging-Market Economy",
    "description": "Under US President Donald Trump’s erratic rule, the United States is now exhibiting all the symptoms, from high import tariffs and fiscal deficits, to oligarchy and flagrant corruption. Worse, the fallout cannot be confined to the US, and no multilateral bail…",
    "link": "https://www.project-syndicate.org/commentary/trump-america-looks-like-emerging-economy-in-trouble-by-desmond-lachman-2025-03",
    "timestamp": "2025-03-21T16:43:03Z"
  },
  {
    "title": "Neil Gorsuch Says Supreme Court Has 'Serious Misfit' With Its Own Decision",
    "description": "Justice Gorsuch broke from the Supreme Court majority on a decision about whether a failure to act is considered a violent crime.",
    "link": "https://www.newsweek.com/neil-gorsuch-says-supreme-court-has-serious-misfit-its-own-decision-2048666",
    "timestamp": "2025-03-21T16:41:02Z"
  },
  {
    "title": "Elon Musk Goes to the Pentagon as Trump Insists He’s Not Being Briefed on China War Plans",
    "description": "The billionaire was supposed to originally get briefed on top secret war plans with China.",
    "link": "https://gizmodo.com/elon-musk-goes-to-the-pentagon-as-trump-insists-hes-not-being-briefed-on-china-war-plans-2000579105",
    "timestamp": "2025-03-21T16:40:56Z"
  },
  {
    "title": "Can we make it official? Language in the age of Trump.",
    "description": "The United States made English its main language, but in Japan things seem to be heading in a different way.",
    "link": "https://www.japantimes.co.jp/life/2025/03/22/language/official-languages-japanese/",
    "timestamp": "2025-03-21T16:40:00Z"
  },
  {
    "title": "Nvidia death cross has traders on high alert",
    "description": "Nvidia Corp. investors used to big announcements and equally large gains at the GTC conference were left wanting this go around. Read on",
    "link": "https://financialpost.com/investing/nvidia-death-cross-has-traders-on-high-alert",
    "timestamp": "2025-03-21T16:39:30Z"
  },
  {
    "title": "Jimmy Kimmel presses Adam Schiff on why California can't permanently cut red tape in wake of LA Fires",
    "description": "Sen. Adam Schiff agreed with California Gov. Gavin Newsom's decision to cut government red tape to recover from the Los Angeles fires, after being pressed by Jimmy Kimmel.",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-presses-adam-schiff-why-california-cant-permanently-cut-red-tape-wake-la-fires",
    "timestamp": "2025-03-21T16:38:42Z"
  },
  {
    "title": "Trump rescinds order targeting law firm after it makes $40m promise",
    "description": "Paul, Weiss promised $40 million of free legal work to the White House and to change its diversity policies.",
    "link": "https://www.bbc.com/news/articles/c2d4kex0w2ro",
    "timestamp": "2025-03-21T16:37:58Z"
  },
  {
    "title": "Trump says 'there'll be flexibility' on reciprocal tariffs",
    "description": "President Donald Trump seemed to oppose the idea of making exceptions for the forthcoming duties.",
    "link": "https://biztoc.com/x/b1bdbd8b9fbaed41",
    "timestamp": "2025-03-21T16:37:12Z"
  },
  {
    "title": "Germany says it's committed to order of US F-35 fighter jets",
    "description": "Germany said on Friday it was committed to buying F-35 fighter jets despite reports that it was reconsidering due to worries about an over-reliance on American defence supplies.",
    "link": "https://www.thelocal.de/20250321/germany-says-its-committed-to-order-of-us-f-35-fighter-jets",
    "timestamp": "2025-03-21T16:36:39Z"
  },
  {
    "title": "$5,000 DOGE dividend checks another empty promise? Check latest update on qualification",
    "description": "James Fishback, the CEO who came up with the idea of a DOGE stimulus check, has revealed the payout might not be the $5,000 originally proposed. US President Donald Trump and his close ally Elon Musk have supported a proposal to use a proportion of these savi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-doge-stimulus-check-dividend-5000-elon-musk-trump-millions-wont-qualify-doge-dividend-checks-another-empty-promise-check-latest-update-on-qualification/articleshow/119310966.cms",
    "timestamp": "2025-03-21T16:36:07Z"
  },
  {
    "title": "Ocean dumping – or a climate solution? A growing industry bets on the ocean to capture carbon",
    "description": "Efforts to capture carbon dioxide have exploded in recent years.",
    "link": "https://www.bostonherald.com/2025/03/21/ocean-fisheries-capturing-carbon/",
    "timestamp": "2025-03-21T16:36:05Z"
  },
  {
    "title": "Trump Admits Elon Musk ‘Would Be Susceptible Perhaps’ to Pressure From China On His Businesses",
    "description": "\"But I certainly wouldn't want, you know, Elon has businesses in China, and he would be susceptible, perhaps, to that. But it was such a fake story.\"\nThe post Trump Admits Elon Musk ‘Would Be Susceptible Perhaps’ to Pressure From China On His Businesses first…",
    "link": "https://www.mediaite.com/politics/trump-admits-elon-musk-would-be-susceptible-perhaps-to-pressure-from-china-on-his-businesses/",
    "timestamp": "2025-03-21T16:36:03Z"
  },
  {
    "title": "Ask Jordan: How can Trump appeal to the Supreme Court so quickly?",
    "description": "How can the Trump administration appeal birthright citizenship to the Supreme Court when lower courts aren't done with the case?",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-supreme-court-birthright-citizenship-appeal-ask-jordan-rcna197451",
    "timestamp": "2025-03-21T16:35:52Z"
  },
  {
    "title": "Trump suggests US could be ‘associate member’ of British Commonwealth: ‘I love King Charles’",
    "description": "Reports in the British press indicate an offer could be made by the monarch when Trump makes a state visit to the UK later this year.",
    "link": "https://nypost.com/2025/03/21/us-news/trump-suggests-us-could-be-associate-member-of-british-commonwealth-i-love-king-charles/",
    "timestamp": "2025-03-21T16:34:41Z"
  },
  {
    "title": "Trump Kickstarts Military Revitalization With New 6th Generation Fighter Jet Program",
    "description": "The president described the new program as 'something, the likes of which, nobody has seen before in all of the attributes of a fighter jet.'",
    "link": "https://thefederalist.com/2025/03/21/trump-kickstarts-military-revitalization-with-new-6th-generation-fighter-jet-program/",
    "timestamp": "2025-03-21T16:34:02Z"
  },
  {
    "title": "Sanctuary Mayor Used Encryption App To Discuss Migrant Crisis With Staff",
    "description": "Denver Mayor Mike Johnston used an encryption app to discuss Denver's illegal migrant crisis with staff members, a scheme that allowed them to avoid oversight.",
    "link": "https://dailycaller.com/2025/03/21/mike-johnston-denver-using-signal-to-message/",
    "timestamp": "2025-03-21T16:33:40Z"
  },
  {
    "title": "Trump Says Jan. 6 Rioters Were Nothing Like Those 'Terrorist' Tesla Vandals",
    "description": "“You didn’t have anything like that Jan. 6,” Trump said, referring to the 2021 riot that left several people dead.",
    "link": "https://www.huffpost.com/entry/trump-jan-6-rioters-terrorist-tesla-vandals_n_67dd90a0e4b0087232531749",
    "timestamp": "2025-03-21T16:33:13Z"
  },
  {
    "title": "Egg Prices: Trump Touts Prices Are ‘Way Down’—But Consumers May Still Feel High Prices",
    "description": "The Department of Agriculture warned egg prices may increase more than 40% this year.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/03/21/egg-prices-trump-touts-prices-are-way-down-but-consumers-may-still-feel-high-prices/",
    "timestamp": "2025-03-21T16:33:10Z"
  },
  {
    "title": "'That's what the law says': Trump snaps back at reporter over his authority to skip courts",
    "description": "President Donald Trump claimed Friday that \"the law\" gave him the authority to deport undocumented migrants without having to explain himself to a judge.\n\nOn Friday morning, Trump continued his attack on the judiciary, posting to Truth Social, writing, \"No Di…",
    "link": "https://www.rawstory.com/trump-judge-order-2671379615/",
    "timestamp": "2025-03-21T16:32:25Z"
  },
  {
    "title": "Elon Musk Is Said To Be Getting The War Plan Against China",
    "description": "Update: After the NY Times reported this story last night, Donald Trump denied that Musk would be getting the China war plan, and now the NY Times is reporting that, while that was the original plan, it was scrapped because of the public outcry The Wall Stree…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176785067",
    "timestamp": "2025-03-21T16:32:05Z"
  },
  {
    "title": "Trump says 'there'll be flexibility' on reciprocal tariffs",
    "description": "President Donald Trump seemed to oppose the idea of making exceptions for the forthcoming duties.",
    "link": "https://www.cnbc.com/2025/03/21/trump-says-therell-be-flexibility-on-reciprocal-tariffs.html",
    "timestamp": "2025-03-21T16:31:43Z"
  },
  {
    "title": "In the Trump era, Europe should shift its gaze towards China – Joseph Stiglitz",
    "description": "Nobel prize-winning economist says defence spending move by EU is sound economic policy",
    "link": "https://www.irishtimes.com/business/2025/03/21/in-the-trump-era-europe-should-shift-its-gaze-towards-china-joseph-stiglitz/",
    "timestamp": "2025-03-21T16:31:24Z"
  },
  {
    "title": "How Europe Should Navigate Trump",
    "description": "Two former foreign ministers of NATO countries on the difficult path ahead for European nations.",
    "link": "http://foreignpolicy.com/2025/03/21/europe-navigate-trump-ukraine-trade-putin/",
    "timestamp": "2025-03-21T16:31:19Z"
  },
  {
    "title": "Trump Predicts ‘Enemy of the People’ CNN, MSNBC Will Be ‘Turned Off’ in Oval Office Tirade Against the ‘Fake News’",
    "description": "Donald Trump went on a tear against multiple media outlets he accused of completely fabricating stories as he predicted both CNN and MSNBC will be \"turned off.\"\nThe post Trump Predicts ‘Enemy of the People’ CNN, MSNBC Will Be ‘Turned Off’ in Oval Office Tirad…",
    "link": "https://www.mediaite.com/politics/trump-predicts-enemy-of-the-people-cnn-msnbc-will-be-turned-off-in-oval-office-tirade-against-the-fake-news/",
    "timestamp": "2025-03-21T16:31:08Z"
  },
  {
    "title": "Taoiseach taps ESRI’s McQuinn as economic advisor",
    "description": "Economics professor Alan Ahearne had previously served as advisor to Micheal Martin",
    "link": "https://www.irishtimes.com/business/2025/03/21/taoiseach-taps-esris-mcquinn-as-economic-advisor/",
    "timestamp": "2025-03-21T16:31:02Z"
  },
  {
    "title": "Donald Trump Seeking a 3rd Term Triggers Blowup on '2 Angry Men' Podcast",
    "description": "Donald Trump may not leave the White House at the end of his term -- so says Steve Bannon -- and it triggered a fairly furious argument on our \"2 Angry Men\" podcast. Harvey got into it with former Utah congressman and current FOX news contributor…",
    "link": "https://www.tmz.com/2025/03/21/2-angry-men-trump-third-term-jason-chaffetz/",
    "timestamp": "2025-03-21T16:30:57Z"
  },
  {
    "title": "'Revolt': Dem Voters Turning on Their Leaders in Record Numbers, Polls Find",
    "description": "Democratic voters are \"on the verge of a Tea Party-style, intra-party revolt\" against their party's leaders in Congress, Politico reported Friday based on recent polls.\nThe post 'Revolt': Dem Voters Turning on Their Leaders in Record Numbers, Polls Find appea…",
    "link": "https://freebeacon.com/latest-news/revolt-dem-voters-turning-on-their-leaders-in-record-numbers-polls-find/",
    "timestamp": "2025-03-21T16:30:36Z"
  },
  {
    "title": "Klarna and DoorDash: Is Buy Now, Pay Later on Food a 'Recession Indicator'?",
    "description": "\"If you have to finance your DoorDash with Klarna, that's not convenience—that's a crisis,\" personal finance expert George Kamel told Newsweek.",
    "link": "https://www.newsweek.com/klarna-doordash-buy-now-pay-later-recession-2048600",
    "timestamp": "2025-03-21T16:30:36Z"
  },
  {
    "title": "Trump awards Boeing much-needed win with fighter jet contract (Mike Stone/Reuters)",
    "description": "Mike Stone / Reuters:\nTrump awards Boeing much-needed win with fighter jet contract  —  U.S. President Donald Trump on Friday awarded Boeing (BA.N) the contract to build the U.S. Air Force's most sophisticated fighter jet, handing the company a much-needed wi…",
    "link": "https://www.memeorandum.com/250321/p59",
    "timestamp": "2025-03-21T16:30:02Z"
  },
  {
    "title": "Trump Invokes Wartime Powers to Boost U.S. Critical Minerals Output",
    "description": "President Donald Trump invoked emergency powers to increase U.S. critical minerals production in a bid to reduce reliance on “hostile foreign powers’ mineral production.” In an executive order, the U.S. President invoked the Defense Production Act (DPA), whic…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Invokes-Wartime-Powers-to-Boost-US-Critical-Minerals-Output.html",
    "timestamp": "2025-03-21T16:30:00Z"
  },
  {
    "title": "People are ditching their Teslas in huge numbers as the Elon Musk backlash grows",
    "description": "Tesla (TSLA) owners are ditching their vehicles in record numbers, as consumer interest in the brand appears to be waning.Read more...",
    "link": "https://qz.com/tesla-trade-in-record-elon-musk-1851771576",
    "timestamp": "2025-03-21T16:30:00Z"
  },
  {
    "title": "LIVE: Trump, Defense Secretary Pete Hegseth deliver remarks from the Oval Office",
    "description": "President Donald Trump and Defense Secretary Pete Hegseth are scheduled to deliver remarks Friday morning from the Oval ...",
    "link": "https://biztoc.com/x/94002d40c6dbbbea",
    "timestamp": "2025-03-21T16:29:38Z"
  },
  {
    "title": "President Donald Trump delivers remarks from the Oval Office — 3/21/2025",
    "description": "President Donald Trump delivers remarks from the Oval Office on Friday. For access to live and exclusive video from CNBC ...",
    "link": "https://biztoc.com/x/e789d1d763ca301b",
    "timestamp": "2025-03-21T16:29:22Z"
  },
  {
    "title": "Trump Awards Boeing Next-Generation Fighter Jet Contract",
    "description": "President Donald Trump announces Boeing has been awarded a contract to design and build the US's next-generation fighter jet.",
    "link": "https://biztoc.com/x/37018ab0efc8b0d4",
    "timestamp": "2025-03-21T16:29:17Z"
  },
  {
    "title": "Trump Reveals He Has a Special Destination in Mind for 'Sick Terrorist Thugs' Targeting Tesla",
    "description": "President Donald Trump suggests he knows the perfect place where anyone convicted of terrorist attacks on Tesla should spend prison time.",
    "link": "https://www.westernjournal.com/trump-reveals-special-destination-mind-sick-terrorist-thugs-targeting-tesla/",
    "timestamp": "2025-03-21T16:28:41Z"
  },
  {
    "title": "French first lady and Emanuel Macron's wife Brigitte caught in yet another ridiculous conspiracy theory as fake gender rumors spread in U.S",
    "description": "Brigitte Macron, wife of French president Emmanuel Macron, faces baseless claims promoted by American far-right pundits suggesting she was born male. Despite winning a libel case in 2024, the rumors persist, primarily fueled by Candace Owens and Tucker Carlso…",
    "link": "https://economictimes.indiatimes.com/news/international/us/french-first-lady-and-emanuel-macrons-wife-brigitte-caught-in-yet-another-ridiculous-conspiracy-theory-as-fake-gender-rumors-spread-in-u-s/articleshow/119310841.cms",
    "timestamp": "2025-03-21T16:28:24Z"
  },
  {
    "title": "Trump Awards Next-Generation F-47 Fighter Jet Contract To Boeing",
    "description": "US President Donald Trump announced Friday that Boeing has been awarded a major contract for the Air Force&#039;s high-tech next-generation F-47 fighter plane.",
    "link": "https://www.ndtv.com/world-news/us-president-donald-trump-awards-next-generation-f-47-fighter-jet-contract-to-boeing-7978951",
    "timestamp": "2025-03-21T16:27:58Z"
  },
  {
    "title": "ICE Scammers Are On The Rise: What To Do",
    "description": "Attorney General Rob Bonta has shared legal guidance to help immigrants understand their rights amid a rise in ICE impersonators.",
    "link": "https://www.newsweek.com/ice-scammers-rise-what-do-immigration-2048631",
    "timestamp": "2025-03-21T16:27:02Z"
  },
  {
    "title": "Trump 'pretty sure' full Ukraine ceasefire comes soon",
    "description": "United States President Donald Trump said on Friday he believes a full ceasefire in Ukraine is likely to happen soon.\"We are going to have full ceasefire very soon in the Russia-Ukraine war,\" the Amer...",
    "link": "https://biztoc.com/x/d5223c819eeff11a",
    "timestamp": "2025-03-21T16:26:20Z"
  },
  {
    "title": "Trump blasts EU over 'non monetary tariffs'",
    "description": "United States President Donald Trump on Friday commented on the European Union's decision to lower tariffs on automobiles imported from the US to 2.5%, calling it \"nice\" while adding that the EU still...",
    "link": "https://biztoc.com/x/095ad29f49bb6b6d",
    "timestamp": "2025-03-21T16:26:11Z"
  },
  {
    "title": "Trump: People targeting Tesla are terrorists",
    "description": "United States President Donald Trump said on Friday that the people who were accused of targeting Tesla dealerships are \"terrorists\" and noted that there will be no pardons for them.\"I view these peop...",
    "link": "https://biztoc.com/x/fcea24448ee52f29",
    "timestamp": "2025-03-21T16:26:00Z"
  },
  {
    "title": "Social Democracies Keep Top Spots on World Happiness Report as US Falls to Record Low",
    "description": "For the eighth consecutive year, the World Happiness Report on Thursday found that the countries with the happiest people are those that use their resources to invest in social welfare—and documented a precipitous drop in satisfaction among people in the Unit…",
    "link": "https://www.commondreams.org/news/finland-happiest-country",
    "timestamp": "2025-03-21T16:25:38Z"
  },
  {
    "title": "Trump’s targeting New York City and its institutions in his retribution rampage",
    "description": "President Donald Trump is launching an assault on liberal cities and states, and so far there’s no sign that Democrats are up to protecting their institutions from Trump when needed.",
    "link": "https://biztoc.com/x/ebaa069a8f7034de",
    "timestamp": "2025-03-21T16:25:31Z"
  },
  {
    "title": "US-Congo Minerals, Security Talks in Early Stages, Minister Says",
    "description": "Talks between the Democratic Republic of Congo and the Trump administration over a possible minerals and security deal are in the early stages, the central African country’s foreign minister said.",
    "link": "https://financialpost.com/pmn/business-pmn/us-congo-minerals-security-talks-in-early-stages-minister-says",
    "timestamp": "2025-03-21T16:24:57Z"
  },
  {
    "title": "Elon Musk Is Said To Be Getting The War Plan Against China",
    "description": "Update: After the NY Times reported this story last night, Donald Trump denied that Musk would be getting the China war plan, and now the NY Times is reporting that, while that was the original plan, it was scrapped because of the public outcry The Wall Stree…",
    "link": "https://www.techdirt.com/2025/03/21/elon-musk-is-getting-the-war-plan-against-china/",
    "timestamp": "2025-03-21T16:24:38Z"
  },
  {
    "title": "Obama-Appointed Judge Decides DOGE Can’t Access Social Security Data To Uncover Fraud",
    "description": "A federal judge blocked Elon Musk's Department of Government Efficiency (DOGE) from accessing Social Security Administration (SSA) data.",
    "link": "https://dailycaller.com/2025/03/21/obama-appointed-judge-decides-doge-cant-access-social-security-data-to-uncover-fraud/",
    "timestamp": "2025-03-21T16:24:23Z"
  },
  {
    "title": "Trump Signs Illegal Executive Order To Destroy The Dept. Of Education",
    "description": "Grand Pappy MAGA claims destroying the Dept. of Education and turning it back over to the states will make America smarter. \nYes, I'm laughing too. \nTrump gets a stiffy when he signs one of his MAGA menus of destruction with that silly signature. \n\nWe want th…",
    "link": "https://crooksandliars.com/2025/03/trump-signs-illegal-executive-order-trying",
    "timestamp": "2025-03-21T16:23:12Z"
  },
  {
    "title": "Trump asks the Supreme Court to stop judges from blocking his policies",
    "description": "President Donald Trump has railed in recent weeks against federal judges who have ruled against his administration, painting them as threats to the country and demanding that the Supreme Court halt all nationwide injunctions.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-supreme-court-injunctions-judges-rcna197457",
    "timestamp": "2025-03-21T16:22:56Z"
  },
  {
    "title": "Trump’s Justice Department seeks to shield president in Jan. 6 civil cases",
    "description": "Donald Trump is still facing several civil suits related to Jan. 6, though his Justice Department is trying to prevent this approach to accountability.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-justice-department-seeks-shield-president-jan-6-civil-cases-rcna197505",
    "timestamp": "2025-03-21T16:22:43Z"
  },
  {
    "title": "Boeing wins Air Force’s next-gen fighter contract",
    "description": "The company beat out Lockheed to build NGAD, which has been named the F-47.",
    "link": "https://www.defenseone.com/defense-systems/2025/03/boeing-wins-air-forces-next-gen-fighter-contract/403951/",
    "timestamp": "2025-03-21T16:19:31Z"
  },
  {
    "title": "Musk Meets With Hegseth at the Pentagon and Says He’s Ready to ‘Be Helpful’",
    "description": "The Pentagon is in the middle of identifying personnel and programs it can cut to save between 5% and 8% of its budget.",
    "link": "https://time.com/7270622/elon-musk-pete-hegseth-pentagon-meeting-doge-defense-department/",
    "timestamp": "2025-03-21T16:19:04Z"
  },
  {
    "title": "Poll: Kamala Harris Leads Democrat 2028 Presidential Field",
    "description": "Former Vice President Kamala Harris is leading the Democrat Party's 2028 potential presidential primary field, a Morning Consult survey found.\nThe post Poll: Kamala Harris Leads Democrat 2028 Presidential Field appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/21/poll-kamala-harris-leads-democrat-2028-presidential-field/",
    "timestamp": "2025-03-21T16:18:34Z"
  },
  {
    "title": "‘He’s a Loser’: Trump Roasts Tim Walz in Brutal Fashion for Declaring He Could Kick His Supporters’ Asses",
    "description": "President Donald Trump reacted to former Democratic vice presidential nominee Tim Walz's assertion that he could kick the ass of most Trump supporters.\nThe post ‘He’s a Loser’: Trump Roasts Tim Walz in Brutal Fashion for Declaring He Could Kick His Supporters…",
    "link": "https://www.mediaite.com/tv/hes-a-loser-trump-reacts-to-tim-walz-declaring-he-could-kick-his-supporters-asses/",
    "timestamp": "2025-03-21T16:17:01Z"
  },
  {
    "title": "Trump Hints U.S. Could Go to War With Allies Someday in Wild Presser",
    "description": "Donald Trump announced a new investment in military aircraft production Friday, revealing that he had contracted Boeing to develop “the world’s first sixth-generation” fighter jet, named the F-47. And he managed to threaten America’s allies in the process.\r\n“…",
    "link": "https://newrepublic.com/post/193028/donald-trump-threat-allies-fighter-jet",
    "timestamp": "2025-03-21T16:16:31Z"
  },
  {
    "title": "US scraps sanctions on Tornado Cash, crypto ‘mixer’ accused of laundering North Korea money",
    "description": "The U.S. Treasury on Friday lifted economic sanctions against Tornado Cash, a firm that makes cryptocurrency transactions harder to track, which the Biden administration had accused of helping launder more than $7 billion for North Korean and other cyber hack…",
    "link": "https://www.channelnewsasia.com/business/us-scraps-sanctions-tornado-cash-crypto-mixer-accused-laundering-north-korea-money-5016561",
    "timestamp": "2025-03-21T16:15:48Z"
  },
  {
    "title": "Hegseth Orders Elimination of Pentagon Climate Planning, but Wants Extreme Weather Preparation",
    "description": "The Defense secretary aims to purge climate work from the Pentagon. But critics say his carve-out for weather resiliency misses the point",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/03/21/hegseth-ditch-climate-distraction-but-still-prepare-for-extreme-weather-00241730",
    "timestamp": "2025-03-21T16:15:00Z"
  },
  {
    "title": "Gov’t can realize gains on gold certificates to buy Bitcoin: Bo Hines",
    "description": "The Trump administration appears poised to grow its Strategic Bitcoin Reserve after the White House’s crypto council head suggested budget-neutral ways for acquiring the digital asset. “There’s been countless ideas” about how the government can acquire more B…",
    "link": "https://cointelegraph.com/news/govt-realize-gains-gold-certificates-buy-bitcoin-bo-hines",
    "timestamp": "2025-03-21T16:15:00Z"
  },
  {
    "title": "Gabbard's India visit: New Delhi called for action against anti-India elements in US",
    "description": "India has communicated to the US its concerns regarding secessionist elements conducting anti-India activities from American soil. During meetings with US Director of Intelligence Tulsi Gabbard, officials discussed bilateral cooperation on intelligence-sharin…",
    "link": "https://economictimes.indiatimes.com/news/india/gabbards-india-visit-new-delhi-called-for-action-against-anti-india-elements-in-us/articleshow/119310604.cms",
    "timestamp": "2025-03-21T16:14:41Z"
  },
  {
    "title": "Grant Cardone Says Newsom Should Focus On California's Economy, Fires, Homelessness And Housing Affordability—Not Posting About Trump",
    "description": "Real estate investor and entrepreneur Grant Cardone took aim at California Gov. Gavin Newsom on social media, criticizing him for posting about President Donald Trump instead of addressing pressing issues in the state.\nCardone Calls Out Newsom\n“Newsom posting…",
    "link": "https://biztoc.com/x/9dded1f4d7b00bb7",
    "timestamp": "2025-03-21T16:14:21Z"
  },
  {
    "title": "Trump on tariffs: Exemptions for one mean exemptions for all",
    "description": "United States President Donald Trump dismissed Friday the possibility of rolling back tariffs imposed on China and other countries, emphasizing that offering exemptions to individual countries would c...",
    "link": "https://biztoc.com/x/3fc21cd7f6f6487b",
    "timestamp": "2025-03-21T16:14:06Z"
  },
  {
    "title": "European visitors to U.S. surprised by denial of entry, dayslong detentions",
    "description": "Since U.S. President Donald Trump took office, there have been several high-profile incidents of tourists and visa holders being stopped at U.S. border crossings, or being held for weeks at American immigration detention facilities.",
    "link": "https://www.cbc.ca/news/world/us-travel-detentions-1.7489525",
    "timestamp": "2025-03-21T16:13:07Z"
  },
  {
    "title": "Trump delivers on Reagan’s promise to dismantle Education Department",
    "description": "When Dems claim it will hurt kids, White House notes the bureaucracy 'isn't helping them'",
    "link": "https://www.wnd.com/2025/03/trump-delivers-on-reagans-promise-to-dismantle-education-department/",
    "timestamp": "2025-03-21T16:12:39Z"
  },
  {
    "title": "Economic Watch: Trump's trade tariffs chill markets, upset businesses, consumers",
    "description": "by Xinhua writers Qu Junya, Wang Zongnan Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/22/economic-watch-trump039s-trade-tariffs-chill-markets-upset-businesses-consumers",
    "timestamp": "2025-03-21T16:11:00Z"
  },
  {
    "title": "Meet Kai Trump, the eldest granddaughter of US President Donald Trump, a rising social media star",
    "description": "Kai Madison Trump, Donald Trump’s eldest grandchild, is a 17-year-old social media sensation and competitive golfer. With millions of followers on TikTok, Instagram, and YouTube, she shares glimpses of her unique life, blending family moments and teenage expe…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/meet-kai-trump-the-eldest-granddaughter-of-us-president-donald-trump-a-rising-social-media-star/articleshow/119308796.cms",
    "timestamp": "2025-03-21T16:10:37Z"
  },
  {
    "title": "Tesla’s fans buy up stock at pace never seen before",
    "description": "Tesla Inc.’s stock is in freefall. But one group is buying the electric-vehicle maker’s shares like never before: Elon Musk’s fans. Read on",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/teslas-fans-buy-up-stock",
    "timestamp": "2025-03-21T16:10:16Z"
  },
  {
    "title": "Incoming IOC president to open talks on Russia's potential return to Olympics",
    "description": "The incoming IOC president has revealed to Sky News she is against banning countries from the Olympics over wars and will open talks on Russia's potential return to the Games.",
    "link": "https://news.sky.com/story/incoming-ioc-president-to-open-talks-on-russias-potential-return-to-olympics-13333288",
    "timestamp": "2025-03-21T16:10:00Z"
  },
  {
    "title": "Trump Wants To Send Tesla Vandals To Prison In El Salvador",
    "description": "Donald Trump has already promised to treat any alleged Tesla vandal as a domestic terrorist and send them to prisons in El Salvador.",
    "link": "https://www.jalopnik.com/1816147/trump-tesla-vanadals-el-salvador/",
    "timestamp": "2025-03-21T16:08:45Z"
  },
  {
    "title": "Trump’s targeting New York City and its institutions in his retribution rampage",
    "description": "President Donald Trump is launching an assault on liberal cities and states, and so far there’s no sign that Democrats are up to protecting their institutions from Trump when needed.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-new-york-city-columbia-hochul-congestion-pricing-rcna197178",
    "timestamp": "2025-03-21T16:08:29Z"
  },
  {
    "title": "Trans model Alex Consani claps back at anti-trans trolls: ‘We’re never going to go away’",
    "description": "Trans model Alex Consani has hit out at anti-trans trolls and the oppressive policies enacted by the Trump administration targeting trans people. President Donald Trump has signed multiple executive orders targeting trans rights since his inauguration in Janu…",
    "link": "https://www.thepinknews.com/2025/03/21/alex-consani-donald-trump/",
    "timestamp": "2025-03-21T16:07:22Z"
  },
  {
    "title": "Germany approves $3 billion in military aid for Ukraine",
    "description": "The €3 billion package approved by the Bundestag Budget Committee comes on top of the €4 billion in military aid to Ukraine already planned in the 2025 budget. The Budget Committee of the Bundestag, Germany's lower house of parliament, has approved €3 billion…",
    "link": "https://www.dw.com/en/germany-approves-3-billion-in-military-aid-for-ukraine/a-72001265",
    "timestamp": "2025-03-21T16:07:00Z"
  },
  {
    "title": "Students launch “Study-in” at Dept of Education, protesting Trump’s plan to abolish the Department",
    "description": "At 10am, Students and allies kicked off a “study-in” at the Department of Education to protest Trump and order yesterday calling for the abolition of the Department. Students sat at desks with homework and books to draw attention to how ending the Department …",
    "link": "https://www.commondreams.org/newswire/students-launch-study-in-at-dept-of-education-protesting-trumps-plan-to-abolish-the-department",
    "timestamp": "2025-03-21T16:06:38Z"
  },
  {
    "title": "Exclusive — Education Secretary Linda McMahon Talks Possibility of Moving Student Loans to Treasury, Private Sector",
    "description": "McMahon said on Friday, \"There's absolutely no reason, as far as I can determine, that there should be student loans housed in the Department of Education.\"\nThe post Exclusive — Education Secretary Linda McMahon Talks Possibility of Moving Student Loans to Tr…",
    "link": "https://www.breitbart.com/politics/2025/03/21/exclusive-education-secretary-linda-mcmahon-talks-possibility-moving-student-loans-treasury-private-sector/",
    "timestamp": "2025-03-21T16:06:25Z"
  },
  {
    "title": "Shuttering the Department of Education Is a Political Loser",
    "description": "Donald Trump is once again threatening to eliminate the Department of Education — a longtime dream of the GOP’s right flank — but the idea has never gained traction, even under Republican presidents. Ronald Reagan",
    "link": "https://politicalwire.com/2025/03/21/dismantling-the-department-of-education-is-a-political-loser/",
    "timestamp": "2025-03-21T16:04:25Z"
  },
  {
    "title": "Trump Announces Boeing Wins Contract For Secretive Future Fighter Jet",
    "description": "The Pentagon says it will have stealth and penetration capabilities that far exceed those of its current fleet and is essential in a potential conflict with China.",
    "link": "https://www.huffpost.com/entry/trump-fighter-jet-air-force_n_67dd8ce4e4b0ae8ea296e842",
    "timestamp": "2025-03-21T16:04:18Z"
  },
  {
    "title": "Trump denies Musk was briefed on China war plans",
    "description": "United States President Donald Trump denied on Friday the allegations that billionaire entrepreneur had access to the US war plans regarding a potential future conflict against China. More to come......",
    "link": "https://biztoc.com/x/6b300dda34ea2d7c",
    "timestamp": "2025-03-21T16:03:19Z"
  },
  {
    "title": "Trump: Putin wouldn't fear NATO without US",
    "description": "United States President Donald Trump argued on Friday that his Russian counterpart Vladimir Putin would not be worried about NATO if Washington were to exit the alliance.\"President Putin will tell you...",
    "link": "https://biztoc.com/x/886d0236e495ab54",
    "timestamp": "2025-03-21T16:03:07Z"
  },
  {
    "title": "Will Trump Destroy the Dollar’s Primacy?",
    "description": "Within its first two months, President Donald Trump’s second administration has attacked US institutions, alienated trade partners and allies, decimated consumer and investor confidence, and sent the stock market plummeting. Can the dollar’s status as the wor…",
    "link": "https://www.project-syndicate.org/onpoint/will-trump-destroy-the-dollar-s-primacy",
    "timestamp": "2025-03-21T16:02:59Z"
  },
  {
    "title": "The Big Picture",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/will-trump-destroy-the-dollar-s-primacy-doc-2025-03",
    "timestamp": "2025-03-21T16:02:55Z"
  },
  {
    "title": "Trump Can’t Answer When Peter Doocy Asks Simple Question: ‘Who Killed Kennedy?’",
    "description": "Trump was flat out asked by Fox News' Peter Doocy, \"Who killed Kennedy?\" at the end of an Oval Office press gathering to announce a new fighter jet.\nThe post Trump Can’t Answer When Peter Doocy Asks Simple Question: ‘Who Killed Kennedy?’ first appeared on Med…",
    "link": "https://www.mediaite.com/tv/trump-cant-answer-when-peter-doocy-asks-simple-question-who-killed-kennedy/",
    "timestamp": "2025-03-21T16:02:14Z"
  },
  {
    "title": "War Correspondent: China Likely Could Disable Panama Canal, But Not the Way You Might Think",
    "description": "PANAMA CITY, Panama—If China wanted to disable the Panama Canal to stop the flow of military or cargo ships through it, it likely could do... Read More\nThe post War Correspondent: China Likely Could Disable Panama Canal, But Not the Way You Might Think appear…",
    "link": "https://www.dailysignal.com/2025/03/21/war-correspondent-china-likely-could-disable-panama-canal-not-way-you-might-think/",
    "timestamp": "2025-03-21T16:01:05Z"
  },
  {
    "title": "UAE commits to $1.4 trillion investment framework in US, White House says (Steve Holland/Reuters)",
    "description": "Steve Holland / Reuters:\nUAE commits to $1.4 trillion investment framework in US, White House says  —  The United Arab Emirates has committed to a 10-year, $1.4 trillion investment framework in the United States after top UAE officials met President Donald Tr…",
    "link": "https://www.memeorandum.com/250321/p55",
    "timestamp": "2025-03-21T16:00:41Z"
  },
  {
    "title": "To Perform or Not to Perform at Trump’s Kennedy Center",
    "description": "To perform or not to perform at Trump’s Kennedy Center. Ahead of the organization’s big Mark Twain Prize ceremony, A-listers and working artists are struggling to make the right call.",
    "link": "http://www.vulture.com/article/who-is-performing-at-trumps-kennedy-center.html",
    "timestamp": "2025-03-21T16:00:36Z"
  },
  {
    "title": "Letters: Turning teachers into parents; the real value of education",
    "description": "OPINION: 'School is about creating an atmosphere where students enjoy learning.'",
    "link": "https://www.nzherald.co.nz/nz/letters-turning-teachers-into-parents-the-real-value-of-education/PBK4HCMT3FAFBLARFYXEHAOLR4/",
    "timestamp": "2025-03-21T16:00:00Z"
  },
  {
    "title": "Progressives rally as pressure mounts to primary Schumer",
    "description": "Progressive lawmakers have hit the ground running, with Democrat Rep. Alexandria Ocasio-Cortez of New York rallying alongside independent Sen. Bernie Sanders of Vermont in the swing state of Nevada. However, their efforts are being overshadowed by the most re…",
    "link": "https://www.theblaze.com/news/progressives-rally-as-pressure-mounts-to-primary-schumer",
    "timestamp": "2025-03-21T16:00:00Z"
  },
  {
    "title": "PM in India: US trade, defence and new ferries loom large over India FTA progress",
    "description": "ANALYSIS: It isn't about to let up for Luxon after a tiring but successful week in India.",
    "link": "https://www.nzherald.co.nz/nz/politics/pm-in-india-us-trade-defence-and-new-ferries-loom-large-over-india-fta-progress/ON4K6N4OIZB7VLH4VBDME37VK4/",
    "timestamp": "2025-03-21T16:00:00Z"
  }
]