[
  {
    "title": "Alaska's senators welcome Trump-Putin meeting",
    "description": "United States Senators Dan Sullivan and Lisa Murkowski, Alaska's only two senators, said the state would be honored to host the planned August 15 meeting between US President Donald Trump and Russ...",
    "link": "https://biztoc.com/x/cf54bf027d9ffaab",
    "timestamp": "2025-08-09T05:07:39Z"
  },
  {
    "title": "Trump Warned Courts Not to Strike Down Tariffs. What Could Happen If They Do",
    "description": "",
    "link": "https://biztoc.com/x/c36c2e5f42ab8d66",
    "timestamp": "2025-08-09T05:07:13Z"
  },
  {
    "title": "Ram Madhav writes: Countering Trump’s transactionalism",
    "description": "He understands that India is an indispensable ally in achieving three of his main goals",
    "link": "https://indianexpress.com/article/opinion/columns/ram-madhav-donald-trump-tariff-india-10178988/",
    "timestamp": "2025-08-09T05:06:39Z"
  },
  {
    "title": "Trump may use military against drug cartels",
    "description": "US President Donald Trump has directed the Pentagon to prepare military options against Latin American drug cartels designated as terrorist organizations, US media reported. The New York Times said the plan involves using military force, while The Wall Street…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-may-use-military-against-drug-cartels/articleshow/123200792.cms",
    "timestamp": "2025-08-09T05:04:26Z"
  },
  {
    "title": "Cliff Taylor: How Ireland’s economic future is being carved up in talks in the White House",
    "description": "The big tech and pharma multinationals are trying to reach accommodations with Trump, with vital implications for us",
    "link": "https://www.irishtimes.com/opinion/2025/08/09/how-irelands-economic-future-is-being-carved-up-in-talks-in-the-white-house/",
    "timestamp": "2025-08-09T05:00:01Z"
  },
  {
    "title": "Ken Early: Liverpool title stroll fuels hunger for Premier League return, but it might be more of the same",
    "description": "Champions spend big to consolidate position as Arsenal and Manchester United attempt to take giant leap",
    "link": "https://www.irishtimes.com/sport/soccer/2025/08/09/ken-early-liverpool-title-stroll-fuels-hunger-for-premier-league-return-but-it-might-be-more-of-the-same/",
    "timestamp": "2025-08-09T05:00:01Z"
  },
  {
    "title": "Could AI help America out of its debt hole?",
    "description": "Some investors believe the technology’s productivity benefits will put the US on a better fiscal path",
    "link": "https://www.irishtimes.com/business/2025/08/09/could-ai-help-america-out-of-its-debt-hole/",
    "timestamp": "2025-08-09T05:00:00Z"
  },
  {
    "title": "Putin-Trump Summit to Take place in Alaska on August 15",
    "description": "Trump wrote on Truth Social on Friday that his meeting with Putin will take place in Alaska on August 15. Kremlin aide Yury Ushakov later confirmed this information.",
    "link": "https://sputnikglobe.com/20250809/putin-trump-summit-to-take-place-in-alaska-on-aug-15-1122581051.html",
    "timestamp": "2025-08-09T04:44:57Z"
  },
  {
    "title": "NSA Doval meets Russia's First Dy PM, discusses military-technical ties",
    "description": "Doval is in Russia to hold crucial talks on bilateral energy and defence ties and to prepare the ground for President Putin's visit to India later this year",
    "link": "https://www.thehindubusinessline.com/news/world/nsa-doval-meets-russias-first-dy-pm-discusses-military-technical-ties/article69912540.ece",
    "timestamp": "2025-08-09T04:43:48Z"
  },
  {
    "title": "Rosie O’Donnell claims ABC will cancel ‘The View’ to appease ‘orange messiah’ Trump",
    "description": "O’Donnell urged women to \"speak louder\" and \"take up space.\"",
    "link": "https://www.foxnews.com/media/rosie-odonnell-claims-abc-cancel-the-view-appease-orange-messiah-trump?intcmp=tw_fnc&#038;taid=6896a24314f55800011d7c66&#038;utm_campaign=trueanthem&#038;utm_medium=social&#038;utm_source=twitter",
    "timestamp": "2025-08-09T04:41:32Z"
  },
  {
    "title": "Ceasefire To Tariffs: How A Modi-Trump Call Post India-Pakistan Clash Sparked A Rift",
    "description": "When India and Pakistan agreed to a ceasefire in May, US President Donald Trump repeatedly claimed credit for brokering the peace and this prompted a public pushback from New Delhi. In a tense June 17 call, Prime Minister Narendra Modi told Trump India “will …",
    "link": "https://www.ndtvprofit.com/world/how-a-modi-trump-call-post-india-pakistan-clash-sparked-a-india-us-trade-rift",
    "timestamp": "2025-08-09T04:41:07Z"
  },
  {
    "title": "Why Trump's tariffs could be disaster for Brazil's acai industry, American consumers",
    "description": "US tariffs on Brazilian acai exports, linked to political tensions, threaten the livelihoods of Amazonian producers. With the US being the largest importer, the tariffs have already led to suspended negotiations and significant financial losses for exporters.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/why-trumps-tariffs-could-be-disaster-for-brazils-acai-industry-american-consumers/articleshow/123200528.cms",
    "timestamp": "2025-08-09T04:35:05Z"
  },
  {
    "title": "Alaska gov. calls state 'most strategic' place for Trump-Putin talks",
    "description": "Alaskan Governor Michael Dunleavy (pictured) welcomed the upcoming August 15 meeting between United States President Donald Trump and Russian President Vladimir Putin, which will take place in Alaska....",
    "link": "https://biztoc.com/x/7d81d5957ff5a299",
    "timestamp": "2025-08-09T04:34:06Z"
  },
  {
    "title": "Surprise tariff on gold sends shock waves through financial world",
    "description": "A Trump administration ruling that gold bars will be subject to tariffs entering the US stunned traders who had assumed they would be exempted, throwing bullion markets into turmoil.",
    "link": "https://www.independent.ie/business/surprise-tariff-on-gold-sends-shock-waves-through-financial-world/a854178292.html",
    "timestamp": "2025-08-09T04:30:00Z"
  },
  {
    "title": "Germany halts weapons exports to Israel as outrage grows over Gaza City plan",
    "description": "Israel’s security cabinet yesterday approved a plan to take control of Gaza City – a move that expands military operations in the shattered Palestinian territory and which drew fresh criticism over the country’s pursuit of the almost two-year-old war.",
    "link": "https://www.independent.ie/world-news/middle-east/germany-halts-weapons-exports-to-israel-as-outrage-grows-over-gaza-city-plan/a1181363223.html",
    "timestamp": "2025-08-09T04:30:00Z"
  },
  {
    "title": "Letters: World leaders must strive to prevent repeat of Hiroshima and Nagasaki",
    "description": "As the world remembers the devastation rendered on the Japanese cities of Hiroshima and Nagasaki in August 1945, where people were killed and injured in their hundreds of thousands by the dropping of two atomic bombs by the US, all governments across the glob…",
    "link": "https://www.independent.ie/opinion/letters/letters-world-leaders-must-strive-to-prevent-repeat-of-hiroshima-and-nagasaki/a1831784015.html",
    "timestamp": "2025-08-09T04:30:00Z"
  },
  {
    "title": "NSA Ajit Doval meets Russia's First Dy PM, discusses military-technical ties",
    "description": "National Security Advisor Ajit Doval met with Russia's First Deputy Prime Minister Denis Manturov. They discussed military-technical cooperation and joint projects in strategic sectors. These sectors included civil aircraft manufacturing, metallurgy, and the …",
    "link": "https://economictimes.indiatimes.com/news/defence/nsa-ajit-doval-meets-russias-first-dy-pm-discusses-military-technical-ties/articleshow/123200470.cms",
    "timestamp": "2025-08-09T04:28:37Z"
  },
  {
    "title": "Alaska gov. calls state 'most strategic' place for Trump-Putin summit",
    "description": "Alaskan Governor Michael Dunleavy (pictured) welcomed the upcoming August 15 meeting between United States President Donald Trump and Russian President Vladimir Putin, which will take place in Alaska....",
    "link": "https://biztoc.com/x/c3fda391610fa23a",
    "timestamp": "2025-08-09T04:23:04Z"
  },
  {
    "title": "Intel CEO Lip-Bu Tan breaks his silence after Trump calls for his resignation",
    "description": "* Donald Trump called on Intel CEO Lip-Bu Tan to resign over China-linked investments. * Tan told employees he's staying and operating with the \"highest legal and ethical standards.\" * Intel stock fell 3% as political pressure mounted over Tan's past business…",
    "link": "https://freerepublic.com/focus/f-news/4333552/posts",
    "timestamp": "2025-08-09T04:16:43Z"
  },
  {
    "title": "The tycoons who profit from India's thirst for Russian oil",
    "description": "Tensions between the US and India have risen due to India's continued purchase of discounted Russian oil, a move the US sees as aiding Russia's war in Ukraine. Trump imposed tariffs on India, targeting companies like Reliance Industries, whose Jamnagar refine…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/the-tycoons-who-profit-from-indias-thirst-for-russian-oil/articleshow/123200345.cms",
    "timestamp": "2025-08-09T04:14:31Z"
  },
  {
    "title": "As federal takeover threats loom, the city of Washington waits for the White House to make its move",
    "description": "President Donald Trump's promised law enforcement surge in Washington, D",
    "link": "https://abcnews.go.com/Politics/wireStory/federal-takeover-threats-loom-city-washington-waits-white-124503506",
    "timestamp": "2025-08-09T04:14:29Z"
  },
  {
    "title": "Global trade to grow 0.9% this year; high tariffs to impact in 2026: WTO forecast",
    "description": "It said higher tariffs will weigh on trade and it will bring next year's expected trade volume growth down to 1.8% from 2.5% projected earlier",
    "link": "https://www.thehindubusinessline.com/news/world/global-trade-to-grow-09-this-year-high-tariffs-to-impact-in-2026-wto-forecast/article69912490.ece",
    "timestamp": "2025-08-09T04:13:19Z"
  },
  {
    "title": "Why Trump's tariffs could be a disaster for Brazil's acai industry and American consumers",
    "description": "Prices of acai smoothies and bowls look certain to go up in the U.S. as President Donald Trump imposed 50% tariffs on Brazilian exports in July and threatened the delicate balance of supply and demand that holds the industry",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-tariffs-disaster-brazils-acai-industry-american-consumers-124503522",
    "timestamp": "2025-08-09T04:07:38Z"
  },
  {
    "title": "Nasdaq Hits Highs As Apple Has Best Week Since '20: Markets Wrap",
    "description": "Stocks saw their best week since June, with a rally in big tech driving the Nasdaq 100 to all-time highs. Also buoying sentiment were hopes the US and Russia will reach a deal to halt the war in Ukraine. Gold whips",
    "link": "https://www.ndtvprofit.com/global-economics/nasdaq-hits-highs-as-apple-has-best-week-since-20-markets-wrap",
    "timestamp": "2025-08-09T04:07:26Z"
  },
  {
    "title": "5 world market themes for the week ahead",
    "description": "Global markets are keenly awaiting key events. A potential meeting between US President Donald Trump and Russian President Vladimir Putin is on the cards. Trade talks between the US and China are ongoing. Investors are watching US inflation data closely. Aust…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/123200270.cms",
    "timestamp": "2025-08-09T04:06:53Z"
  },
  {
    "title": "Why Trump’s tariffs could be a disaster for Brazil’s acai industry and American consumers",
    "description": "BELEM, Brazil (AP) — When U.S. President Donald Trump imposed tariffs of 50% on Brazilian exports in July, acai producer Ailson Ferreira Moreira felt immediately concerned. After all, who was going to eat all of that Amazon berry, globally famous as a delicio…",
    "link": "https://financialpost.com/pmn/why-trumps-tariffs-could-be-a-disaster-for-brazils-acai-industry-and-american-consumers",
    "timestamp": "2025-08-09T04:06:48Z"
  },
  {
    "title": "As Netanyahu moves toward full Takeover of Gaza, Israel faces a Crisis of international Credibility",
    "description": "By Amin Saikal, The University of Western Australia For all its claims of being a democracy that adheres to international law and the rules of war, Israel’s global reputation is in tatters. Prime Minister Benjamin Netanyahu’s latest plan for a full military t…",
    "link": "https://www.juancole.com/2025/08/netanyahu-international-credibility.html",
    "timestamp": "2025-08-09T04:06:35Z"
  },
  {
    "title": "J.P.Morgan brings forward Fed rate cut forecast to September",
    "description": "J.P.Morgan anticipates a U.S. Federal Reserve interest rate cut of 25 basis points in September, influenced by a weakening labor market and uncertainty surrounding President Trump's Fed nomination. Trump's nomination of Stephen Miran and the potential replace…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/j-p-morgan-brings-forward-fed-rate-cut-forecast-to-september/articleshow/123200236.cms",
    "timestamp": "2025-08-09T04:02:24Z"
  },
  {
    "title": "The U.S. Intervenes Against EU Digital Surveillance",
    "description": "U.S. Secretary of State Marco Rubio has launched a lobbying campaign against the EU’s Digital Services Act. With this step, Americans have become the last line of defense for the free speech rights of EU citizens.\r\n\r\nIf, in the past, President ...",
    "link": "https://www.americanthinker.com/articles/2025/08/the_u_s_intervenes_against_eu_digital_surveillance.html",
    "timestamp": "2025-08-09T04:00:00Z"
  },
  {
    "title": "Democrats sleepless in Seattle",
    "description": "We've been watching the mayoral election in New York City, i.e. the charming and telegenic socialist who wants to open state grocery stores. Something similar is happening in Minneapolis and perhaps Seattle. Let's check the story from the Pac...",
    "link": "https://www.americanthinker.com/blog/2025/08/democrats_sleepless_in_seattle.html",
    "timestamp": "2025-08-09T04:00:00Z"
  },
  {
    "title": "'Irony' Can Mean The Moment When Reality Catches Up With You",
    "description": "(This essay originally appeared in the American Thinker weekly enewsletter, one of the perks of subscribing to American Thinker. In addition to helping support our work, a subscription will also provide (a) an ad-free experience; (b) the ability...",
    "link": "https://www.americanthinker.com/articles/2025/08/irony_can_mean_the_moment_when_reality_catches_up_with_you.html",
    "timestamp": "2025-08-09T04:00:00Z"
  },
  {
    "title": "Texas GOP unleashes hellfire on Democrat deserters",
    "description": "Texas is under siege, not by invaders, but by gutless Democrats who fled like rats from a sinking ship, abandoning their posts to sabotage a righteous redistricting mission.\r\n\r\n \r\n\r\nMore than 50 Democrat lawmakers bolted the state, cowering in I...",
    "link": "https://www.americanthinker.com/blog/2025/08/texas_gop_unleashes_hellfire_on_democrat_deserters.html",
    "timestamp": "2025-08-09T04:00:00Z"
  },
  {
    "title": "Newsom kibbitzes with Texas's runaway Democrats as 15 wildfires burn across California",
    "description": "What is it about wildfires that prompts Democrats not be around when their cities and states need them?\r\n\r\nWhen Altadena and Pacific Palisades burned to the ground six month ago, Los Angeles mayor Karen Bass had more important things to do ...",
    "link": "https://www.americanthinker.com/blog/2025/08/newsom_kibbitzes_with_texas_s_runaway_democrats_as_15_wildfires_burn_across_california.html",
    "timestamp": "2025-08-09T04:00:00Z"
  },
  {
    "title": "News Summary-Intelligence Report 8/8/2025*Newsdump Friday*Trump-Putin To Meet In Alaska*Russian, Indian Leaders Reaffirm Strategic Partnership*Trump Justice Department Targets NY Democrat AG*",
    "description": "Germany deciding to suspend arms exports to Israel... A Tunisian man acquitted by a US court on terrorism charges...now back in Belgium... The suspect captured in the killing of four people in a Montana bar... US Vice President JD Vance socializing this weeke…",
    "link": "https://freerepublic.com/focus/f-bloggers/4333551/posts",
    "timestamp": "2025-08-09T03:59:07Z"
  },
  {
    "title": "Wall St Week Ahead Inflation data to test stocks as some investors brace for rally to pause",
    "description": "U.S. stock market's rally faces a test as investors brace for potential pullback amid high valuations and seasonal weakness. The upcoming CPI report could trigger volatility, influencing expectations for Federal Reserve rate cuts. Concerns over tariffs and th…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-inflation-data-to-test-stocks-as-some-investors-brace-for-rally-to-pause/articleshow/123200185.cms",
    "timestamp": "2025-08-09T03:57:00Z"
  },
  {
    "title": "Nasdaq posts record closing high with tech gains, rate cut optimism",
    "description": "U.S. stocks surged, with the Nasdaq hitting a record high, fueled by tech gains, particularly Apple's 13.3% weekly jump after Trump announced a $600 billion U.S. investment commitment. Rate cut optimism, spurred by weak economic data and Trump's Fed nominee, …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-posts-record-closing-high-with-tech-gains-rate-cut-optimism/articleshow/123200175.cms",
    "timestamp": "2025-08-09T03:55:26Z"
  },
  {
    "title": "Apple’s $2.5B investment set to transform Harrodsburg, Mercer County",
    "description": "At the heart of this investment is a manufacturing facility producing key components for Apple products right here in Kentucky.",
    "link": "https://www.wdrb.com/news/business/apple-s-2-5b-investment-set-to-transform-harrodsburg-mercer-county/article_7a998add-2f45-4b07-b400-70fb9a56e003.html",
    "timestamp": "2025-08-09T03:45:25Z"
  },
  {
    "title": "Steve Moore Says GOP Has Perfect Response To Democrats’ Vote Against Trump’s BBB",
    "description": "Moore said GOP should go on the \"offensive\" and say congressional Dems \"voted for a $4 trillion tax increase\" by voting against Trump’s \"big, beautiful bill.\"",
    "link": "https://dailycaller.com/2025/08/08/steve-moore-gop-congress-response-democrats-vote-trump-big-beautiful-bill/",
    "timestamp": "2025-08-09T03:44:56Z"
  },
  {
    "title": "A look at what happened in the US government this week",
    "description": "Here are the top stories involving the U.S. government this past week.",
    "link": "https://www.wcvb.com/article/politics-recap-august-8-2025/65640850",
    "timestamp": "2025-08-09T03:44:34Z"
  },
  {
    "title": "Bill Maher Compares ICE Agents, Unfavorably, to Child Molesters, Jokes ‘America Is United Behind One Thing: Fleeing’ | Video",
    "description": "Also, in Maher says the reason Trump's chaotic policies seems confusion to you is that \"Jeffrey Epstein wasn't at your wedding\"\nThe post Bill Maher Compares ICE Agents, Unfavorably, to Child Molesters, Jokes ‘America Is United Behind One Thing: Fleeing’ | Vid…",
    "link": "https://www.thewrap.com/bill-maher-monologue-trump-tariffs-ice-agents-child-molesters/",
    "timestamp": "2025-08-09T03:34:19Z"
  },
  {
    "title": "Mint Snapview: India must flex its digital-market muscle to counter Trump tariffs",
    "description": "India’s openness is the prize. We act as if this makes us vulnerable; in reality, it makes us indispensable.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-tariffs-india-digital-market-it-services-big-tech-gccs-ai-training-chatgpt-google-tax-equalization-levy-11754654516373.html",
    "timestamp": "2025-08-09T03:30:02Z"
  },
  {
    "title": "Trump Announces He'll Meet With Putin In Alaska Next Friday",
    "description": "Donald Trump announced that he plans to meet with Russian President Vladimir Putin next Friday in Alaska, as the US president looks to broker a ceasefire agreement in hopes of bringing an end to the war in Ukraine.",
    "link": "https://www.ndtvprofit.com/world/trump-announces-hell-meet-with-putin-in-alaska-next-friday",
    "timestamp": "2025-08-09T03:29:46Z"
  },
  {
    "title": "Trump again claims helping 'settle' tensions between India, Pakistan",
    "description": "Donald Trump claimed he settled issues between India and Pakistan. He mentioned a potential nuclear conflict and shot down planes. Trump linked trade to resolving the conflict. India maintains direct military talks led to de-escalation. Trump highlighted his …",
    "link": "https://economictimes.indiatimes.com/news/india/trump-again-claims-helping-settle-tensions-between-india-pakistan/articleshow/123199938.cms",
    "timestamp": "2025-08-09T03:29:08Z"
  },
  {
    "title": "Wall Street clocks another winning week",
    "description": "Stocks rose on Wall Street, marking their third winning week in the last four.",
    "link": "https://www.newsday.com/business/asia-japan-trump-tariffs-wall-street-n36426",
    "timestamp": "2025-08-09T03:26:54Z"
  },
  {
    "title": "Trump Says He Will Meet Putin Next Friday In Alaska To Discuss Ending The Ukraine War",
    "description": "President Donald Trump says he will meet with Russian President Vladimir Putin next Friday in Alaska to discuss ending the war in Ukraine.",
    "link": "https://www.huffpost.com/entry/trump-putin-meeting-russia-ukraine-war_n_6896bdd6e4b05bc4a489ddd9",
    "timestamp": "2025-08-09T03:24:58Z"
  },
  {
    "title": "Trump & Putin’s SECRET Alaskan Summit!  Will They END the Ukraine War? ",
    "description": "Trump and Putin to Meet in Alaska: US-Russia Relations in the Spotlight Hello, world news enthusiasts! Get ready for a major development! President Donald Trump is set to meet with Russian President Vladimir Putin this coming Friday, August 15th, in Alaska. T…",
    "link": "https://nep123.com/pstrongtrump-amp-putins-secret-alaskan-summit-will-they-end-the-ukraine-war-strongp/",
    "timestamp": "2025-08-09T03:22:50Z"
  },
  {
    "title": "How Texas Democrats' walkout has launched a fight across the US over political maps",
    "description": "Texas Republicans have escalated the penalties against Democrats as they enter a second week camped out in states across the country to block new U.S. House maps pushed for by President Donald Trump to win more seats ahead of the 2026 midterm elections",
    "link": "https://abcnews.go.com/Politics/wireStory/texas-democrats-walkout-launched-fight-us-political-maps-124502388",
    "timestamp": "2025-08-09T03:18:28Z"
  },
  {
    "title": "Before Intel, which CEOs drew Trump's ire?",
    "description": "Donald Trump has publicly criticised several major CEOs, including Intel's Lip-Bu Tan, Apple’s Tim Cook, and Tesla’s Elon Musk, over issues ranging from China ties to production choices. His interventions reflect a pattern of pressuring corporations on politi…",
    "link": "https://economictimes.indiatimes.com/tech/technology/before-intel-which-ceos-drew-trumps-ire/articleshow/123199820.cms",
    "timestamp": "2025-08-09T03:10:51Z"
  },
  {
    "title": "Three Years Later, The American People Deserve The Truth About Mar-a-Lago Raid",
    "description": "Three Years Later, The American People Deserve The Truth About Mar-a-Lago Raid\n \nAuthored by Julie Kelly via declassified.live,\nNo photo other than his mugshot is more representative of the unprecedented lawfare against Donald Trump than the photo of alleged …",
    "link": "https://biztoc.com/x/a7e67136b166b1af",
    "timestamp": "2025-08-09T03:05:05Z"
  },
  {
    "title": "REPORT: Bill Barr Teamed Up With Fani Willis On Trump RICO Case",
    "description": "In a case of strange bedfellows, William Barr, former U.S. attorney general to President Donald Trump, has teamed up with Fani Willis, the Democratic prosecutor who tried the president before being tossed off the case, to try and take Trump down. A whistleblo…",
    "link": "https://freerepublic.com/focus/f-news/4333548/posts",
    "timestamp": "2025-08-09T03:02:50Z"
  },
  {
    "title": "Trump executive order gives politicians control over all federal grants, alarming researchers",
    "description": "An executive order signed by President Donald Trump aims to give political appointees power over the billions of dollars of grants that are awarded by federal agencies.",
    "link": "https://www.news4jax.com/health/2025/08/08/trump-executive-order-gives-politicians-control-over-all-federal-grants-alarming-researchers/",
    "timestamp": "2025-08-09T03:00:40Z"
  },
  {
    "title": "Appeals court denies Trump bid to make federal government defendant in E. Jean Carroll case (Kaelan Deese/Washington Examiner)",
    "description": "Kaelan Deese / Washington Examiner:\nAppeals court denies Trump bid to make federal government defendant in E. Jean Carroll case  —  A federal appeals court on Friday rejected President Donald Trump's attempt to make the United States government the defendant …",
    "link": "https://www.memeorandum.com/250808/p137",
    "timestamp": "2025-08-09T03:00:38Z"
  },
  {
    "title": "Trump FBI Director Fires Combat Vet Whose Wife Died Last Month, Accusing Him of ‘Poor Judgment’",
    "description": "FBI Director Kash Patel fired an agent with the bureau while accusing him of \"poor judgment\" and \"political weaponization.\"\nThe post Trump FBI Director Fires Combat Vet Whose Wife Died Last Month, Accusing Him of ‘Poor Judgment’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-fbi-director-fires-combat-vet-whose-wife-died-last-month-accusing-him-of-poor-judgment/",
    "timestamp": "2025-08-09T02:54:47Z"
  },
  {
    "title": "Ukraine conflict could have become ‘world war’ – Trump",
    "description": "The US president once again criticized his predecessor Joe Biden for allowing the hostilities to escalate Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622686-ukraine-conflict-world-war-trump/",
    "timestamp": "2025-08-09T02:46:39Z"
  },
  {
    "title": "Matt Towery Shares What Two Things Can Hurt Republicans Most In 2026",
    "description": "Pollster Matt Towery shared on Fox News Friday the biggest threats to Republicans heading into the 2026 elections.",
    "link": "https://dailycaller.com/2025/08/08/matt-towery-gop-threats-2026/",
    "timestamp": "2025-08-09T02:45:53Z"
  },
  {
    "title": "US allowed Nvidia chip sales after Trump-Huang meeting",
    "description": "The United States has started granting Nvidia Corp. licenses to export its H20 chips to China directly after Nvidia CEO Jensen Huang (pictured) met with US President Donald Trump at the White House, w...",
    "link": "https://biztoc.com/x/66b4f8ce50e832c5",
    "timestamp": "2025-08-09T02:42:48Z"
  },
  {
    "title": "It's been four years since a US president met Putin - and Trump will have a lot of ice to break",
    "description": "A US-Russia summit in Alaska is geography as metaphor and message. Choosing this location signals strategic parity - with both leaders face to face in a place where their interests literally meet.",
    "link": "https://news.sky.com/story/its-been-four-years-since-a-us-president-met-putin-and-trump-will-have-a-lot-of-ice-to-break-13408894",
    "timestamp": "2025-08-09T02:40:00Z"
  },
  {
    "title": "\"Hope India will use influence to end war,\" US Senator Lindsey Graham urges India to help end Ukraine conflict",
    "description": "US Senator Lindsey Graham requested India to leverage its influence with Russia to help end the Ukraine war. Graham highlighted India's purchase of Russian oil, which funds Russia's war efforts. He hoped Prime Minister Modi discussed ending the war with Putin…",
    "link": "https://economictimes.indiatimes.com/news/india/hope-india-will-use-influence-to-end-war-us-senator-lindsey-graham-urges-india-to-help-end-ukraine-conflict/articleshow/123199530.cms",
    "timestamp": "2025-08-09T02:29:06Z"
  },
  {
    "title": "Putin-Trump summit: What we know so far",
    "description": "President Trump and Vladimir Putin are set to meet in Alaska on August 15th to discuss ending the war in Ukraine. Trump aims to broker peace, despite previous unsuccessful attempts. The meeting location in Alaska is strategically chosen due to its proximity t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/putin-trump-summit-what-we-know-so-far/articleshow/123199503.cms",
    "timestamp": "2025-08-09T02:24:45Z"
  },
  {
    "title": "$105M Ether shorts got 'smoked,' Eric Trump throws shade at bears",
    "description": "Ether had $105 million in short positions liquidated on Friday as its price topped $4,000 for the first time in eight months — a move that, in Eric Trump’s words, “put a smile” on his face.",
    "link": "https://cointelegraph.com/news/ether-short-wipeout-eric-trump-bullish-eth",
    "timestamp": "2025-08-09T02:23:05Z"
  },
  {
    "title": "MAGA Economist Rails Against ‘Corrupted’ Jobs Numbers He Gleefully Touted Three Months Ago",
    "description": "Economist Steve Moore, a former adviser to President Donald Trump, said the government's official jobs numbers have been \"corrupted.\" But he was singing a different tune when those figures were more favorable to Trump.\nThe post MAGA Economist Rails Against ‘C…",
    "link": "https://www.mediaite.com/media/tv/maga-economist-rails-against-corrupted-jobs-numbers-he-gleefully-touted-three-months-ago/",
    "timestamp": "2025-08-09T02:17:45Z"
  },
  {
    "title": "GOP Senator Bill Cassidy, Who Was Key Vote to Confirm RFK Jr., Blasts Health Honcho for Massive Cuts to Vaccine Funding",
    "description": "Sen. Bill Cassidy (R-LA) criticized Health and Human Services (HHS) Secretary Robert F. Kennedy’s decision to cut vaccine funding months after being a key",
    "link": "https://www.newsbreak.com/share/4161769551554-gop-senator-bill-cassidy-who-was-key-vote-to-confirm-rfk-jr-blasts-health-honcho-for-massive-cuts-to-vaccine-funding?s=a2&amp;share_destination_id=MjYxNTY5OTk4LTE3NTQ3MDU2NjkyNjE%3D&amp;pd=0HhWIwil&amp;hl=en_US&amp;send_time=1754705669&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.31.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q3-v2%2Cns_foryou_model_exp_25q3-v9%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_rank_exp_25q3-v8",
    "timestamp": "2025-08-09T02:16:22Z"
  },
  {
    "title": "Ex-Trump Adviser Drops Brutal Comparison On CNN Over Bombshell Putin Meeting",
    "description": "John Bolton dropped a brutal comparison on President Donald Trump over his just-announced meeting with Russian President Vladimir Putin in Alaska.\nThe post Ex-Trump Adviser Drops Brutal Comparison On CNN Over Bombshell Putin Meeting first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/ex-trump-adviser-drops-brutal-comparison-on-cnn-over-bombshell-putin-meeting/",
    "timestamp": "2025-08-09T02:10:16Z"
  },
  {
    "title": "Foreign Leaders Agree: Trump Should Win Nobel Peace Prize",
    "description": "Azerbaijani President Ilham Aliyev agreed with Armenian Prime Minister Nikol Pashinyan saying Trump should win the Nobel Peace Prize.",
    "link": "https://dailycaller.com/2025/08/08/foreign-leaders-agree-trump-win-nobel-peace-prize-armenia-azerbaijani/",
    "timestamp": "2025-08-09T02:07:43Z"
  },
  {
    "title": "Putin-Trump summit: what we know so far",
    "description": "Trump and his Russian counterpart Putin will hold talks in Alaska next Friday in a bid to end the war in Ukraine.\nThe post Putin-Trump summit: what we know so far appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/putin-trump-summit-what-we-know-so-far/article",
    "timestamp": "2025-08-09T02:07:20Z"
  },
  {
    "title": "Putin-Trump Summit: What We Know So Far",
    "description": "US President Donald Trump and his Russian counterpart Vladimir Putin will hold talks in Alaska next Friday in a bid to end the war in Ukraine, which was triggered by Russia's February 2022 invasion.",
    "link": "https://www.ibtimes.com.au/putin-trump-summit-what-we-know-so-far-1860040",
    "timestamp": "2025-08-09T02:06:19Z"
  },
  {
    "title": "Putin-Trump Summit: What We Know So Far",
    "description": "US President Donald Trump and his Russian counterpart Vladimir Putin will hold talks in Alaska next Friday in a bid to end the war in Ukraine, which was triggered by Russia's February 2022 invasion.",
    "link": "https://www.ibtimes.com/putin-trump-summit-what-we-know-so-far-3780563",
    "timestamp": "2025-08-09T02:06:15Z"
  },
  {
    "title": "It's Now The 'Environmental Pollution Agency'",
    "description": "A renaming ceremony for the U.S. Environmental Protection Agency was held at its Washington, D.C. headquarters on Thursday to give the EPA a name that reflects its priorities under Administrator Lee Zeldin and Republican President Donald Trump.\nOn the heels o…",
    "link": "https://crooksandliars.com/2025/08/its-now-environmental-pollution-agency",
    "timestamp": "2025-08-09T02:00:01Z"
  },
  {
    "title": "Clear-Cut Reasons For Last Month’s Disastrous Jobs Report",
    "description": "Trump sould know better.",
    "link": "https://www.forbes.com/sites/eliamdur/2025/08/08/clear-cut-reasons-for-last-months-disastrous-jobs-report/",
    "timestamp": "2025-08-09T01:59:48Z"
  },
  {
    "title": "Trump executive order gives political appointees authority to approve, freeze, or terminate federal research grants",
    "description": "President Donald Trump’s executive order hands political appointees sweeping control over federal research grants, allowing them to approve, freeze, or terminate funding. Critics warn it could replace the merit-based system with politically driven oversight, …",
    "link": "https://timesofindia.indiatimes.com/education/news/trump-executive-order-gives-political-appointees-authority-to-approve-freeze-or-terminate-federal-research-grants/articleshow/123199305.cms",
    "timestamp": "2025-08-09T01:58:43Z"
  },
  {
    "title": "US-Israel attack tried to cripple Iran but ended up strengthening it",
    "description": "The Iranian people, who had previously questioned the benefits of nuclear energy due to illegal US sanctions, are now more united and determined than ever",
    "link": "https://indianexpress.com/article/opinion/columns/us-israel-attack-tried-to-cripple-iran-but-ended-up-strengthening-it-10178636/",
    "timestamp": "2025-08-09T01:55:27Z"
  },
  {
    "title": "Trump is privately mulling how to declare pot a less dangerous drug | CNN Politics",
    "description": "Over a recent dinner at his private Bedminster, New Jersey, club, as President Donald Trump recounted his move against the country’s top economic statistician and riffed on New York City politics, the conversation turned to a politically potent issue still in…",
    "link": "https://www.cnn.com/politics/trump-marijuana-reclassify-dea",
    "timestamp": "2025-08-09T01:55:00Z"
  },
  {
    "title": "Trump and Putin to meet in Alaska for Ukraine talks next week",
    "description": "The announcement comes hours after the US leader signals Ukraine may have to cede territory to end the war.",
    "link": "https://www.bbc.com/news/articles/c1dxed639n7o",
    "timestamp": "2025-08-09T01:40:13Z"
  },
  {
    "title": "Breaking News Live Updates: Trump again touts global peace efforts during Armenia-Azerbaijan accord signing",
    "description": "Breaking News Live Updates: US President Donald Trump on Friday used the signing of a peace accord between Armenia and Azerbaijan at the White House to highlight once again his role in brokering peace accords, recalling earlier interventions in conflicts arou…",
    "link": "https://m.economictimes.com/news/newsblogs/india-news-live-updates-weather-today-uttarkashi-cloudburst-rains-raksha-bandhan-us-india-trade-talks-50-percent-tariffs-pm-modi-monsoon-parliament-session-donald-trump-russia-trade-ukraine-russia-war-august-9/liveblog/123199238.cms",
    "timestamp": "2025-08-09T01:40:12Z"
  },
  {
    "title": "In the face of Trump’s tariffs, India must secure oil supply chains, assert sovereignty",
    "description": "Despite the naivete he has displayed in his dealings with Trump, PM Modi is not responsible for his perfidy",
    "link": "https://indianexpress.com/article/opinion/columns/in-the-face-of-trumps-tariffs-india-must-secure-oil-supply-chains-assert-sovereignty-10178625/",
    "timestamp": "2025-08-09T01:31:58Z"
  },
  {
    "title": "Ken Paxton Says ‘Beto Bribes’ No Longer Helping Democrats Who Fled Texas",
    "description": "Ken Paxton scored a legal victory Friday, securing a court order to block what he called \"Beto Bribes\"",
    "link": "https://dailycaller.com/2025/08/08/ken-paxton-beto-bribes-democrats/",
    "timestamp": "2025-08-09T01:29:59Z"
  },
  {
    "title": "Dem TX State Rep. Wu: Trump Has Made Open Racism 'Acceptable'",
    "description": "Friday on MSNBC's \"The Weeknight,\" Texas State Rep. Gene Wu (D), one of several lawmakers who left the state to avoid a quorum, said he has faced open racism in his state because President Donald Trump had made it \"acceptable.\"\nThe post Dem TX State Rep. Wu: …",
    "link": "https://www.breitbart.com/clips/2025/08/08/dem-tx-state-rep-wu-trump-has-made-open-racism-acceptable/",
    "timestamp": "2025-08-09T01:28:50Z"
  },
  {
    "title": "Raskin: Trump Is Weaponizing the DOJ for His 'Political Revenge Tour'",
    "description": "Representative Jamie Raskin (D-MD) said Thursday on CNN's \"OutFront\" that President Donald Trump is weaponizing the Justice Department by conducting a criminal investigation into New York State Attorney General Letitia James’ office.\nThe post Raskin: Trump Is…",
    "link": "https://www.breitbart.com/clips/2025/08/08/raskin-trump-is-weaponizing-the-doj-for-his-political-revenge-tour/",
    "timestamp": "2025-08-09T01:27:00Z"
  },
  {
    "title": "Watch: Colbert Calls Trump's Immigration Crackdown 'Brutality and Cruelty,' While Cheerleading Sen. Padilla's Amnesty Plan",
    "description": "Stephen Colbert joined Sen. Alex Padilla (CA-D) on Thursday to push amnesty for illegal aliens, while the canceled \"Late Show\" host called President Donald Trump's illegal alien crackdown “brutality and cruelty.”\nThe post Watch: Colbert Calls Trump’s Immigrat…",
    "link": "https://www.breitbart.com/entertainment/2025/08/08/watch-colbert-calls-trumps-immigration-crackdown-brutality-and-cruelty-while-sen-padilla-pushes-amnesty/",
    "timestamp": "2025-08-09T01:26:42Z"
  },
  {
    "title": "Leaders of Armenia and Azerbaijan shake hands and sign deal at White House peace summit",
    "description": "WASHINGTON — The leaders of Armenia and Azerbaijan shook hands Friday at a White House peace summit before signing an agreement aimed at ending decades of conflict",
    "link": "https://www.nbcnews.com/world/asia/leaders-armenia-azerbaijan-shake-hands-sign-deal-rcna224004",
    "timestamp": "2025-08-09T01:18:49Z"
  },
  {
    "title": "Gold, Frankincense, and Silicon",
    "description": "It is disturbing to think that the leader of a beloved, trusted, and widely believed-to-be-ethical company like Apple has succumbed to avarice. That Tim Cook feels no qualms about — or perhaps even delights in — participating in a quid-pro-quo-driven corrupt …",
    "link": "https://daringfireball.net/2025/08/gold_frankincense_and_silicon",
    "timestamp": "2025-08-09T01:16:37Z"
  },
  {
    "title": "DHS Secretary Kristi Noem defends ICE tactics in second Illinois visit",
    "description": "While Kristi Noem touted the thousands of people who have been deported since President Donald Trump took office in January, ICE’s methods for detaining people have generated controversy.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_64c28b94-107d-4760-8f62-7ae360f57a0d.html",
    "timestamp": "2025-08-09T01:15:00Z"
  },
  {
    "title": "Trump to meet Putin in Alaska on Aug 15 in push for Ukraine peace",
    "description": "Trump will meet Putin in Alaska on Aug 15 to discuss ending the Ukraine war, with a possible territory swap on the table amid European fears of sidelining Kyiv.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-to-meet-putin-in-alaska-on-aug-15-in-push-for-ukraine-peace/article69912401.ece",
    "timestamp": "2025-08-09T01:07:40Z"
  },
  {
    "title": "Jimmy Kimmel admits 'repulsive' liberal scolds are driving people away from the Democratic Party",
    "description": "Late-night host and Trump critic Jimmy Kimmel blamed loud liberal voices for scaring people from the Democratic Party during a podcast appearance this week.",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-admits-repulsive-liberal-scolds-driving-people-away-from-democratic-party",
    "timestamp": "2025-08-09T01:00:13Z"
  },
  {
    "title": "Trump, Pirro Want Epstein-Friendly Law Turning Minors Into Adults",
    "description": "Yes, I know DOGE Bro “Big Balls” was robbed and assaulted in Washington, D.C., allegedly by 15-year-olds. But it seems rather telling that instead of looking at ways to make the district safer with more police or crime-fighting policies, Donald “Grab Them By …",
    "link": "https://crooksandliars.com/2025/08/trump-and-pirro-are-trying-turn-epstein",
    "timestamp": "2025-08-09T01:00:01Z"
  },
  {
    "title": "Moscow becomes centre of global diplomacy amid global geoeconomics turmoil",
    "description": "Amidst global geopolitical shifts, Moscow hosted a flurry of diplomatic activity this week. Vladimir Putin engaged with envoys from the US, India, and the UAE, addressing bilateral ties, the Ukraine crisis, and expanded cooperation in trade, investment, energ…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/moscow-becomes-centre-of-global-diplomacy-amid-global-geoeconomics-turmoil/articleshow/123198771.cms",
    "timestamp": "2025-08-09T00:59:24Z"
  },
  {
    "title": "Pam Bondi Names Ed Martin Special Attorney To Investigate Letitia James, Adam Schiff Mortgage Fraud Allegations",
    "description": "Attorney General Pam Bondi named Ed Martin special attorney.",
    "link": "https://dailycaller.com/2025/08/08/pam-bondi-names-ed-martin-special-attorney-to-investigate-letitia-james-adam-schiff-mortgage-fraud-allegations/",
    "timestamp": "2025-08-09T00:56:59Z"
  },
  {
    "title": "Nancy Pelosi laments cuts to health care, VA jobs in SF trip",
    "description": "Nancy Pelosi laments cuts to health care, VA jobs in SF tripsfexaminer.com",
    "link": "https://www.sfexaminer.com/news/politics/nancy-pelosi-laments-cuts-to-health-care-va-jobs-in-sf-trip/article_260d9a16-901c-4742-b604-57bbae0297ff.html",
    "timestamp": "2025-08-09T00:55:42Z"
  },
  {
    "title": "Trump and Putin to hold Ukraine war talks in Alaska next Friday",
    "description": "WASHINGTON DC: US President Donald Trump announced that he will meet with Russian President Vladimir Putin on August 15 in Alaska to discuss the ongoing war in Ukraine. This will be their first in-person meeting on US soil since 2019. The talks come shortly a…",
    "link": "https://english.khabarhub.com/2025/09/489911/",
    "timestamp": "2025-08-09T00:54:18Z"
  },
  {
    "title": "What we know about ICE arrest of a parent outside a Chula Vista elementary school",
    "description": "Immigration agents arrested Kyungjin Yu, an immigrant from South Korea, because she overstayed her visa, Department of Homeland Security officials told KPBS.",
    "link": "https://www.kpbs.org/news/border-immigration/2025/08/08/what-we-know-about-ice-arrest-of-a-parent-outside-a-chula-vista-elementary-school",
    "timestamp": "2025-08-09T00:52:52Z"
  },
  {
    "title": "Private Equity Firms Celebrate Trump’s Executive Order Giving Them The Keys To Retirement",
    "description": "President Donald Trump signed his long-awaited executive order paving the way for 401(k) providers to offer access to private equity investments on Thursday, opening the floodgates to what the private equity industry has long salivated over, as a huge untappe…",
    "link": "https://biztoc.com/x/58e090cf2d577b1b",
    "timestamp": "2025-08-09T00:50:57Z"
  },
  {
    "title": "Trump removes Billy Long as IRS commissioner, giving him the shortest-ever tenure in the role",
    "description": "Billy Long is no longer the IRS commissioner. President Donald Trump removed him after a short tenure. He is now nominated as ambassador to Iceland. Treasury Secretary Scott Bessent will be the acting IRS commissioner. The IRS has faced much turnover recently…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-removes-billy-long-as-irs-commissioner-giving-him-the-shortest-ever-tenure-in-the-role/articleshow/123198675.cms",
    "timestamp": "2025-08-09T00:50:05Z"
  },
  {
    "title": "Trump and Putin to meet in Alaska on August 15 to discuss Ukraine peace deal",
    "description": "US President Donald Trump and Russian President Vladimir Putin will meet in Alaska on 15 August to discuss ending the war in Ukraine. The meeting, confirmed by both Washington and the Kremlin, comes amid signs of progress toward a possible ceasefire. Trump ha…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-and-putin-to-meet-in-alaska-on-august-15-to-discuss-ukraine-peace-deal/articleshow/123198627.cms",
    "timestamp": "2025-08-09T00:47:35Z"
  },
  {
    "title": "Trump tariffs | Triangle small business owners say they feel effects of tariff battles",
    "description": "Trump tariffs | Triangle small business owners say they feel effects of tariff battlesabc11.com",
    "link": "https://abc11.com/post/trump-tariffs-triangle-small-business-owners-say-feel-effects-tariff-battles/17475339/",
    "timestamp": "2025-08-09T00:46:29Z"
  },
  {
    "title": "Trump rattles Latin America by eyeing military force against drug cartels",
    "description": "The approach discards the previous administration's preference for carrots over sticks to coax countries into alignment with U.S. interests.",
    "link": "https://www.japantimes.co.jp/news/2025/08/09/world/politics/trump-military-drug-cartels/",
    "timestamp": "2025-08-09T00:33:00Z"
  },
  {
    "title": "California GOP Congressman — Sweating Being Able to Keep His Own Seat — Files Bill to Block Mid-Decade Redistricting",
    "description": "Amid efforts in multiple states to initiate an unusual mid-decade congressional redistricting, Rep. Kevin Kiley (R-CA) filed a bill to block it nationwide -- and also protect his own reelection hopes.\nThe post California GOP Congressman — Sweating Being Able …",
    "link": "https://www.mediaite.com/media/news/california-gop-congressman-sweating-being-able-to-keep-his-own-seat-files-bill-to-block-mid-decade-redistricting/",
    "timestamp": "2025-08-09T00:30:50Z"
  }
]