[
  {
    "title": "Asian shares are mostly lower and oil sinks $2 after Trump says Iran stopped killings",
    "description": "Asian shares are mostly lower after Wall Street retreated on Big Tech losses",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-lower-oil-sinks-2-after-trump-129229811",
    "timestamp": "2026-01-15T05:09:45Z"
  },
  {
    "title": "Israel’s assaults on Palestinian Universities and targeting the Academic Sector",
    "description": "Protesting Israel’s assaults on Palestinian universities and its targeting of students and faculty in the occupied West Bank and Gaza",
    "link": "https://www.juancole.com/2026/01/palestinian-universities-targeting.html",
    "timestamp": "2026-01-15T05:06:40Z"
  },
  {
    "title": "US federal agent shoots Venezuelan man in Minneapolis",
    "description": "A Venezuelan national ⁠pursued by US immigration agents during a \"targeted\" traffic stop in Minneapolis was shot in the leg by a federal officer, authorities said.",
    "link": "https://www.rte.ie/news/us/2026/0115/1553182-minneapolis-us/",
    "timestamp": "2026-01-15T05:06:35Z"
  },
  {
    "title": "On Foreign Policy, Trump 2.0 Is Dangerously Unrestrained",
    "description": "The president still has time to put America first.\nThe post On Foreign Policy, Trump 2.0 Is Dangerously Unrestrained  appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/on-foreign-policy-trump-2-0-is-dangerously-unrestrained/",
    "timestamp": "2026-01-15T05:05:00Z"
  },
  {
    "title": "Beyond Boiling Point: Historic Iranian Protests Continue Despite Blackouts, Repression",
    "description": "Unverified reports suggest thousands of people may have been killed, while Trump threatens the country with military intervention",
    "link": "https://www.juancole.com/2026/01/historic-blackouts-repression.html",
    "timestamp": "2026-01-15T05:04:16Z"
  },
  {
    "title": "How Letitia James found her courage only when Jews fought back",
    "description": "In New York City, synagogues require police barricades and families hide Stars of David under their coats due to violent anti-Israel protestors, but NY's attorney general acted only against Betar, the group which fought back. Opinion.",
    "link": "https://www.israelnationalnews.com/news/420939",
    "timestamp": "2026-01-15T05:01:00Z"
  },
  {
    "title": "Visa Brings Stablecoins To $1.7 Trillion Platform In BVNK Partnership",
    "description": "Visa has partnered with BVNK to bring stablecoin payments to the Visa Direct platform, expanding its digital payments infrastructure. BVNK Will Power Visa Direct’s Stablecoin Infrastructure As announced in a Wednesday press release, BVNK and Visa have formed …",
    "link": "https://bitcoinist.com/visa-stablecoins-1-7-trillion-bvnk-partnership/",
    "timestamp": "2026-01-15T05:00:37Z"
  },
  {
    "title": "Trump says Iran has 'no plan' to execute protesters",
    "description": "The US president does not rule out military action in Iran, as Tehran temporarily shuts its airspace to nearly all flights.",
    "link": "https://www.bbc.com/news/articles/c07xpndjdd8o",
    "timestamp": "2026-01-15T04:57:26Z"
  },
  {
    "title": "Stunned RFK Jr. ‘doesn’t know how Donald Trump is alive’ with ‘unhinged’ diet of McDonald’s and Coke - NewsBreak",
    "description": "THE man tasked with keeping America healthy has a blunt verdict on the president’s menu. Robert F Kennedy Jr. says he can’t figure out how Donald Trump is",
    "link": "https://www.newsbreak.com/share/4442308839381-stunned-rfk-jr-doesn-t-know-how-donald-trump-is-alive-with-unhinged-diet-of-mcdonald-s-and-coke?_f=app_share&amp;pd=00SmdxYs&amp;lang=en_US&amp;send_time=1768452824&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.1.1.6%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-15T04:56:01Z"
  },
  {
    "title": "Trump questions Reza Pahlavi’s ability to garner support in Iran",
    "description": "President Donald Trump said Iranian opposition figure Reza Pahlavi \"seems very nice\" while also expressing uncertainty as to whether he could lead Iran.",
    "link": "https://nypost.com/2026/01/14/world-news/trump-questions-reza-pahlavis-ability-to-garner-support-in-iran/",
    "timestamp": "2026-01-15T04:55:30Z"
  },
  {
    "title": "WJC backs Phase Two of Trump’s Gaza plan, urges action to recover Ran Gvili",
    "description": "WJC praises US-led progress on hostage returns and Gaza ceasefire but says closure is impossible until Ran Gvili is brought home, urging continued pressure on Hamas as Phase Two of the plan begins.",
    "link": "https://www.israelnationalnews.com/news/420930",
    "timestamp": "2026-01-15T04:53:28Z"
  },
  {
    "title": "Trump Imposes 25% Tariff on Certain Advanced Microchips - White House",
    "description": "MOSCOW (Sputnik) - US President Donald Trump imposed a 25% tariff on the import of certain advanced microchips, according to an executive order published by the White House.",
    "link": "https://sputnikglobe.com/20260115/trump-imposes-25-tariff-on-certain-advanced-microchips---white-house-1123464555.html",
    "timestamp": "2026-01-15T04:51:30Z"
  },
  {
    "title": "Minneapolis: Officer shoots person in leg during arrest",
    "description": "An officer was allegedly attacked with a shovel and broom handle while trying to arrest the person, DHS said. The shooting took place a few kilometers from where an immigration agent fatally shot Renee Good. A federal officer shot a person in the leg in Minne…",
    "link": "https://www.dw.com/en/minneapolis-officer-shoots-person-in-leg-during-arrest/a-75511317",
    "timestamp": "2026-01-15T04:49:00Z"
  },
  {
    "title": "UN Security Council to meet on Iran - presidency",
    "description": "The UN Security Council is slated to meet for \"a briefing on the situation in Iran,\" according to a spokesperson for the Somali presidency.",
    "link": "https://www.rte.ie/news/world/2026/0115/1553181-iran-protests/",
    "timestamp": "2026-01-15T04:45:44Z"
  },
  {
    "title": "JD Vance Blocks Venezuela War Powers Bill With Decisive Senate Vote — Reports",
    "description": "WASHINGTON (Sputnik) - US Vice President JD Vance cast the tie-breaking vote in the US Senate to defeat a resolution banning American troops from taking part in operations against Venezuela 51-50, according to a C-SPAN broadcast.",
    "link": "https://sputnikglobe.com/20260115/jd-vance-blocks-venezuela-war-powers-bill-with-decisive-senate-vote--reports-1123464309.html",
    "timestamp": "2026-01-15T04:43:32Z"
  },
  {
    "title": "House Democrat Pounces On GOP For Giving Special Treatment To This Jan. 6 Rioter",
    "description": "Jared Moskowitz clowned the convicted seditionist by questioning if he'd reveal the location of the \"treehouse\" where his far-right violent militia group meets.",
    "link": "https://www.huffpost.com/entry/jared-moskowitz-republicans-seating-jan-6-oath-keepers-stewart-rhodes_n_6968547ae4b09fa9c7975587",
    "timestamp": "2026-01-15T04:42:24Z"
  },
  {
    "title": "Justice Department probe of Fed reignites autonomy debate",
    "description": "Neel Kashkari said the Trump administration’s actions against the Federal Reserve reflect monetary policy disagreements. He backed Jerome Powell after a Justice Department investigation, warning that political pressure threatens central bank independence. Des…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/justice-department-probe-of-fed-reignites-autonomy-debate/articleshow/126538239.cms",
    "timestamp": "2026-01-15T04:39:55Z"
  },
  {
    "title": "Silver just tumbled 5% today. What on earth is going on?",
    "description": "Silver fell 5% after record highs as profit taking hit demand.\nThe post Silver just tumbled 5% today. What on earth is going on? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2026/01/15/silver-just-tumbled-5-today-what-on-earth-is-going-on/",
    "timestamp": "2026-01-15T04:37:32Z"
  },
  {
    "title": "HHS reverses decision to cut $2 billion for mental health and addiction services - The Boston Globe",
    "description": "HHS reverses decision to cut $2 billion for mental health and addiction services - The Boston Globebostonglobe.com",
    "link": "https://www.bostonglobe.com/2026/01/14/nation/trump-administration-mental-health-addiction-services-funding/",
    "timestamp": "2026-01-15T04:35:05Z"
  },
  {
    "title": "Trump blames Zelensky for stalling peace talks",
    "description": "President Donald Trump has singled out Ukraine’s Vladimir Zelensky as the primary obstacle to a peace agreement to end the ongoing conflict Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630983-trump-zelensky-stalling-talks/",
    "timestamp": "2026-01-15T04:32:32Z"
  },
  {
    "title": "Oil Tanker Rates Spike as US Push Into Venezuela Redraws Flows",
    "description": "The shipping market is being shaken up by Washington’s intervention in Venezuela, as the prospect of more oil being exported to the US boosts regional tanker rates to their highest level in almost two years.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-tanker-rates-spike-as-us-push-into-venezuela-redraws-flows",
    "timestamp": "2026-01-15T04:31:27Z"
  },
  {
    "title": "Trump Names Zelensky Main Obstacle to Ukraine Deal — Reports",
    "description": "MOSCOW (Sputnik) - US President Donald Trump said Zelensky is the main impediment to reaching a settlement in the Ukraine conflict, according to Reuters.",
    "link": "https://sputnikglobe.com/20260115/trump-names-zelensky-main-obstacle-to-ukraine-deal--reports-1123464156.html",
    "timestamp": "2026-01-15T04:24:25Z"
  },
  {
    "title": "Seizing Greenland risks 'monumental' fallout, ex-Iceland president warns, as Trump sharpens rhetoric",
    "description": "A U.S. attempt to seize Greenland by force would trigger \"monumental consequences\" for the Western alliance and the global order, said former Icelandic President Olafur Grimsson.",
    "link": "https://www.cnbc.com/2026/01/15/us-greenland-trump-takeover-iceland-president.html",
    "timestamp": "2026-01-15T04:23:23Z"
  },
  {
    "title": "The ICE uproar is a conspiracy calculated to fool Americans",
    "description": "When elected officials make false claims while activist groups organize crowds to provoke obstruction of the law, the line between protest and conspiracy collapses.",
    "link": "https://nypost.com/2026/01/14/opinion/the-ice-uproar-is-a-conspiracy-calculated-to-fool-americans/",
    "timestamp": "2026-01-15T04:22:38Z"
  },
  {
    "title": "Trump DOJ Says In Court Maduro Removed Due To Illegal Mining",
    "description": "The DOJ told a federal court in a filing that U.S. force against Venezuelan dictator Nicolás Maduro was justified in part by humanitarian harms tied to illegal mining.",
    "link": "https://dailycaller.com/2026/01/14/trump-doj-maduro-removed-illegal-mining/",
    "timestamp": "2026-01-15T04:18:51Z"
  },
  {
    "title": "Trump says Iran has 'stopped' killing protesters. Is he right?",
    "description": "Washington could intervene militarily in Iran, the Trump administration has suggested, but it remains unclear whether that will happen.",
    "link": "https://www.abc.net.au/news/2026-01-15/trump-claims-violence-in-iran-has-stopped/106231934",
    "timestamp": "2026-01-15T04:18:11Z"
  },
  {
    "title": "Trump Is Reportedly Funneling Money From Venezuelan Oil Sales To a Bank Account in Qatar",
    "description": "President Donald Trump is funneling proceeds from the sale of Venezuelan oil to a bank account in Qatar, Semafor reported on Wednesday.\nThe post Trump Is Reportedly Funneling Money From Venezuelan Oil Sales To a Bank Account in Qatar first appeared on Mediait…",
    "link": "https://www.mediaite.com/politics/trump/trump-is-reportedly-funneling-money-from-venezuelan-oil-sales-to-a-bank-account-in-qatar/",
    "timestamp": "2026-01-15T04:14:30Z"
  },
  {
    "title": "Analysis: Scale of protests and violence in Iran echoes chaos around its 1979 Islamic Revolution",
    "description": "In just a few days, nationwide protests challenging Iran’s theocracy exploded into a crackdown and bloodshed that blew past reported casualty figures of decades of previous demonstrations",
    "link": "https://abcnews.go.com/Business/wireStory/analysis-scale-protests-violence-iran-echoes-chaos-1979-129229099",
    "timestamp": "2026-01-15T04:13:48Z"
  },
  {
    "title": "Feds: Over $1.8 Billion in Medicaid Funds Spent on Health Care for Illegal Aliens in 8 States - NewsBreak",
    "description": "Almost $2 billion in potential Medicaid fraud has been uncovered by the Centers for Medicare & Medicaid Services (CMS) across eight states, including the s",
    "link": "https://www.newsbreak.com/share/4442398804775-feds-over-1-8-billion-in-medicaid-funds-spent-on-health-care-for-illegal-aliens-in-8-states?s=a2&amp;share_destination_id=MjEyMzE4NDE5LTE3Njg0NTAyNTkwNjA%3D&amp;pd=0EMridjD&amp;hl=en_US&amp;send_time=1768450259&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.1.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-15T04:11:43Z"
  },
  {
    "title": "Elizabeth Warren Triggered As CNBC hosts Confront Her With Brutal Facts",
    "description": "The video is a reaction/commentary piece analyzing a recent CNBC interview clip featuring Joe Kernen interviewing Senator Elizabeth Warren (D-MA). Key points covered: Warren criticizes Donald Trump for allegedly trying to exert political control over the Fede…",
    "link": "https://freerepublic.com/focus/f-news/4362214/posts",
    "timestamp": "2026-01-15T04:09:17Z"
  },
  {
    "title": "Elizabeth Warren Triggered As CNBC hosts Confront Her With Brutal Facts",
    "description": "The video is a reaction/commentary piece analyzing a recent CNBC interview clip featuring Joe Kernen interviewing Senator Elizabeth Warren (D-MA). Key points covered: Warren criticizes Donald Trump for allegedly trying to exert political control over the Fede…",
    "link": "https://freerepublic.com/focus/f-bloggers/4362214/posts",
    "timestamp": "2026-01-15T04:09:17Z"
  },
  {
    "title": "Greenlanders torn between anxiety and relief after White House talks",
    "description": "Greenland’s residents expressed a mix of anxiety and relief after a meeting was held Wednesday in the White House between officials from the United States, Denmark and the island at the centre of President Donald Trump’s focus. The foreign ministers of Denmar…",
    "link": "https://www.digitaljournal.com/world/greenlanders-torn-between-anxiety-and-relief-after-white-house-talks/article",
    "timestamp": "2026-01-15T04:07:21Z"
  },
  {
    "title": "Why Australia is investing in military bases in the Philippines",
    "description": "Experts say these agreements are clear signs of how important an ally the Philippines is becoming in the Indo-Pacific region amid jitters of US security guarantees.",
    "link": "https://www.abc.net.au/news/2026-01-15/australia-defence-investment-bases-philippines-us-china/106220666",
    "timestamp": "2026-01-15T04:02:21Z"
  },
  {
    "title": "Iran reopens airspace after temporary closure forced flights to reroute",
    "description": "Iran's airspace reopened after a five-hour closure due to U.S.-Iran tensions. This closure impacted flights, causing cancellations and reroutes. Indian airlines like IndiGo and Air India faced disruptions. Germany also cautioned its airlines. The situation he…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-reopens-airspace-after-temporary-closure-forced-flights-to-reroute/articleshow/126537825.cms",
    "timestamp": "2026-01-15T04:01:17Z"
  },
  {
    "title": "Iran reopens airspace after temporary closure forced flights to reroute",
    "description": "Iran's airspace reopened after a five-hour closure due to U.S.-Iran tensions. This closure impacted flights, causing cancellations and reroutes. Indian airlines like IndiGo and Air India faced disruptions. Germany also cautioned its airlines. The situation he…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-reopens-airspace-after-temporary-closure-forced-flights-to-reroute/articleshow/126537793.cms",
    "timestamp": "2026-01-15T04:01:17Z"
  },
  {
    "title": "Analysis: Scale of Iran protests echoes chaos around 1979 revolution",
    "description": "In just a few days, nationwide protests challenging Iran’s theocracy exploded into a crackdown and bloodshed that blew past reported casualty figures of decades of previous demonstrations. This new level of mayhem instead resembles the chaotic days surroundin…",
    "link": "https://apnews.com/article/iran-protests-1979-revolution-analysis-c06cfb0df138c78f00641324bf74ffe8",
    "timestamp": "2026-01-15T04:00:47Z"
  },
  {
    "title": "Whole milk back on school menus as Trump overturns Obama-era rules",
    "description": "The law allows schools in the National School Lunch Program to offer a wider range of milk options, including nondairy alternatives, and affects meals served to nearly 30 million students.",
    "link": "https://www.thehindubusinessline.com/news/world/whole-milk-back-on-school-menus-as-trump-overturns-obama-era-rules/article70512126.ece",
    "timestamp": "2026-01-15T04:00:06Z"
  },
  {
    "title": "Federal officer shoots man in the leg in Minneapolis after alleged attack during arrest, DHS says",
    "description": "MINNEAPOLIS, Minn. — A federal officer shot a man in the leg during an arrest attempt on Wednesday night, the Department of Homeland Security said as a crowd of protesters gathered near the shooting site, just miles from where an ICE agent fatally shot Renee …",
    "link": "https://www.nbcnews.com/news/us-news/minneapolis-shooting-dhs-rcna254150",
    "timestamp": "2026-01-15T03:53:04Z"
  },
  {
    "title": "Watch This 2016 CNN Report on ICE When Obama Was Still President and See if You Notice a Difference in Tone (VIDEO)",
    "description": "In 2016, when Obama was still president, CNN did a ride-along with ICE agents as they carried out a series of arrests and deportations in the blue city of Chicago and the difference in the tone of the report is remarkable.\nThe post Watch This 2016 CNN Report …",
    "link": "https://www.thegatewaypundit.com/2026/01/watch-this-2016-cnn-report-ice-when-obama/",
    "timestamp": "2026-01-15T03:40:32Z"
  },
  {
    "title": "US judge blocks Trump administration from cutting Minnesota's food stamp funding",
    "description": "A federal judge on Wednesday blocked President Donald Trump's administration from withholding $80 million to administer Minnesota's food stamp program while the state reviews the eligibility of 100,000 households amid claims ​of widespread fraud.",
    "link": "https://freerepublic.com/focus/f-news/4362210/posts",
    "timestamp": "2026-01-15T03:40:21Z"
  },
  {
    "title": "Trump claims execution of Iran protesters ‘has stopped’ as US weighs military intervention",
    "description": "Trump's remarks came after he put out a post on his Truth Social account stating \"help was on its way\", triggering massive speculations of a strike on Tehran.",
    "link": "https://indianexpress.com/article/world/trump-execution-of-iran-protesters-stopped-us-military-intervention-10474389/",
    "timestamp": "2026-01-15T03:37:53Z"
  },
  {
    "title": "Asia markets mixed, oil falls after Trump’s Iran comments",
    "description": "Oil and precious metals slid Thursday after US President Donald Trump appeared to dial down threats of imminent military action on Iran, while Asian markets were mixed after Wall Street edged lower the previous day. Oil prices dropped three percent after Trum…",
    "link": "https://www.digitaljournal.com/world/asia-markets-mixed-oil-falls-after-trumps-iran-comments/article",
    "timestamp": "2026-01-15T03:37:32Z"
  },
  {
    "title": "War for Ukraine Day 1,420: Russia Continues to Escalate In Europe",
    "description": "Russia continues to escalate its campaign against the EU and its member states. Russia continues to expand their hybrid warfare in Europe: Track damage in Germany caused a freight train derailment around the time a US military convoy was scheduled to pass t…",
    "link": "https://balloon-juice.com/2026/01/14/war-for-ukraine-day-1420-russia-continues-to-escalate-in-europe/",
    "timestamp": "2026-01-15T03:35:57Z"
  },
  {
    "title": "Iran temporarily closes airspace to most flights, forcing airlines to reroute",
    "description": "Iran's airspace closure disrupts flights globally, affecting major airlines amid rising tensions with the U.S. and military concerns.",
    "link": "https://www.thehindubusinessline.com/economy/logistics/iran-temporarily-closes-airspace-to-most-flights-forcing-airlines-to-reroute/article70512096.ece",
    "timestamp": "2026-01-15T03:32:02Z"
  },
  {
    "title": "Medical groups will ask court to block new CDC vaccine recommendations | CNN",
    "description": "Six prominent medical associations say they will ask the courts to reverse the US Centers for Disease Control and Prevention’s new recommendations for what vaccines children should get.",
    "link": "https://www.cnn.com/2026/01/14/health/vaccine-recommendations-aap-block",
    "timestamp": "2026-01-15T03:30:11Z"
  },
  {
    "title": "Trump warns Iran regime could fall, but withholds support for Pahlavi",
    "description": "In an interview with Reuters, Trump says Iran’s regime could fall amid deadly protests but hesitates to back Crown Prince Reza Pahlavi, questioning whether Iranians would accept him as a leader.",
    "link": "https://www.israelnationalnews.com/news/420926",
    "timestamp": "2026-01-15T03:26:35Z"
  },
  {
    "title": "Jeff Bezos Criticized by Countless Washington Post Readers Amid Silence on FBI Raid: ‘You Hastened the Death of Democracy’",
    "description": "\"Our 250th birthday is actually a farewell party,\" one commenter said after the FBI searched a reporter's home for classified documents\nThe post Jeff Bezos Criticized by Countless Washington Post Readers Amid Silence on FBI Raid: ‘You Hastened the Death of De…",
    "link": "https://www.thewrap.com/media-platforms/journalism/jeff-bezos-criticized-washington-post-comments-section-fbi-raid/",
    "timestamp": "2026-01-15T03:20:58Z"
  },
  {
    "title": "Report: Donald Trump set to attend College Football Playoff national championship",
    "description": "POTUS might make the trip over to Miami.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_a31fe574-4d89-4a94-921b-2484b6ecc29a",
    "timestamp": "2026-01-15T03:16:42Z"
  },
  {
    "title": "Iran temporarily shuts airspace as U.K. advises against all but essential travel to Israel",
    "description": "Invitations Sent for Trump's 'Board of Peace' for Gaza, U.S. Officials Say. U.K. Foreign Office Advises Against All but Essential Travel to Israel. Iran Temporarily Closes Airspace to Most Flights, Forcing Airlines to Reroute",
    "link": "https://www.haaretz.com/israel-news/2026-01-15/ty-article-live/iran-temporarily-shuts-airspace-as-u-k-advises-against-all-but-essential-travel-to-israel/0000019b-bf97-d810-a99f-fff765b70000",
    "timestamp": "2026-01-15T03:13:13Z"
  },
  {
    "title": "Clashes in US city after second ICE shooting in space of week",
    "description": "Minneapolis has become a major flashpoint in the backlash to Donald Trump's immigration enforcement, with the fatal shooting of a woman in the city having led to competing narratives about the conduct of ICE agents.",
    "link": "https://news.sky.com/story/minneapolis-clashes-in-us-city-after-second-ice-shooting-in-space-of-week-13494453",
    "timestamp": "2026-01-15T03:07:00Z"
  },
  {
    "title": "'Isn't The Flex You Think It Is': Critics Pour Trump's Weird Milk Brag Down The Drain",
    "description": "Social media users tossed a \"real question\" to the president following his cognitive comments in the Oval Office.",
    "link": "https://www.huffpost.com/entry/trump-milk-ace-cognitive-test-claim_n_69683dc7e4b09fa9c79746fb",
    "timestamp": "2026-01-15T03:02:32Z"
  },
  {
    "title": "Venezuela’s Rodriguez vows release of more prisoners, holds call with Trump",
    "description": "Trump showers acting Venezuelan president with praise after first phone call since US abduction of President Maduro.",
    "link": "https://www.aljazeera.com/news/2026/1/15/venezuelas-rodriguez-vows-release-of-more-prisoners-holds-call-with-trump",
    "timestamp": "2026-01-15T03:01:55Z"
  },
  {
    "title": "Iran extends the closure of its airspace to commercial aircraft",
    "description": "Iran further extended an order closing its airspace to commercial aircraft without explanation as tensions remained high with the United States over Tehran’s bloody crackdown on nationwide protests. A notice to pilot said the closure was estimated to last unt…",
    "link": "https://apnews.com/article/iran-protests-crackdown-trump-us-flights-airspace-cba8a40c366f5bca855f465b6c717b25",
    "timestamp": "2026-01-15T03:01:27Z"
  },
  {
    "title": "Donald Trump says no tariffs on rare earths, critical minerals for now; will seek overseas supplies",
    "description": "President Trump has decided against imposing tariffs on critical minerals for now. Instead, his administration will negotiate with international partners to secure these vital supplies. This move aims to address national security vulnerabilities linked to for…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-says-no-tariffs-on-rare-earths-critical-minerals-for-now-will-seek-overseas-supplies/articleshow/126537307.cms",
    "timestamp": "2026-01-15T03:01:22Z"
  },
  {
    "title": "‘Vance hates us’: Europe’s Greenland fears grow as US vice president dives into talks",
    "description": "Diplomats worry there can be no compromise with the U.S. if President Trump wants to \"conquer\" the Danish island.",
    "link": "https://www.politico.eu/article/jd-vance-europe-greenland-us-vice-president-washington-marco-rubio/",
    "timestamp": "2026-01-15T03:00:00Z"
  },
  {
    "title": "Trump imposes 25% tariff on imports of some AI chips",
    "description": "The proclamation follows a nine-month investigation under Section 232 of the Trade Expansion Act of 1962 and targets a number of high-end semiconductors meeting certain performance benchmarks and devices containing them for import duties.",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-imposes-25-tariff-on-imports-of-some-ai-chips/articleshow/126537299.cms",
    "timestamp": "2026-01-15T02:59:58Z"
  },
  {
    "title": "An emerging markets supercycle has just begun: Shuli Ren",
    "description": "Emerging markets are set for a long growth period. A weak dollar and global growth continue to support this trend. New opportunities are emerging in commodities like gold and copper. Countries like Venezuela and Saudi Arabia are opening up for investment. The…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/an-emerging-markets-supercycle-has-just-begun-shuli-ren/articleshow/126537289.cms",
    "timestamp": "2026-01-15T02:58:29Z"
  },
  {
    "title": "US government confirms no plan to remove Fed Chair Powell despite ongoing investigation",
    "description": "The decision to retain Powell amid the investigation may impact perceptions of Fed independence and influence future monetary policy dynamics.\nThe post US government confirms no plan to remove Fed Chair Powell despite ongoing investigation appeared first on C…",
    "link": "https://cryptobriefing.com/us-government-no-plan-remove-powell-investigation/",
    "timestamp": "2026-01-15T02:53:24Z"
  },
  {
    "title": "Man shot in Minneapolis during federal immigration operation, local media reports",
    "description": "MINNEAPOLIS, Jan 14 (Reuters) - A ‌man was shot in the leg on Wednesday night ‌during a federal immigration enforcement operation in north Minneapolis, the ‌Minnesota Star Tribune reported, citing multiple sources with knowledge of the situation. Read full st…",
    "link": "https://www.thestar.com.my/news/world/2026/01/15/man-shot-in-minneapolis-during-federal-immigration-operation-local-media-reports",
    "timestamp": "2026-01-15T02:51:00Z"
  },
  {
    "title": "Oil Prices Plunge as Trump Plays Down Prospect of War With Iran",
    "description": "Oil prices fell sharply in early Asian trade on Thursday, with both major crude benchmarks retreating by close to 3 percent as markets reacted to comments from U.S. President Donald Trump that appeared to lessen the likelihood of an imminent U.S. military str…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Plunge-as-Trump-Plays-Down-Prospect-of-War-With-Iran.html",
    "timestamp": "2026-01-15T02:49:47Z"
  },
  {
    "title": "Trump Tells Reuters He Sees Zelenskiy as Key Impediment to Peace",
    "description": "President Donald Trump faulted Ukraine’s leader Volodymyr Zelenskiy as the main obstacle to an agreement to end the war Russia launched against his country four years ago.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-tells-reuters-he-sees-zelenskiy-as-key-impediment-to-peace",
    "timestamp": "2026-01-15T02:49:20Z"
  },
  {
    "title": "AI-created Iran protest videos gain traction",
    "description": "AI-generated videos purportedly depicting protests in Iran have flooded the web, researchers said Wednesday, as social media users push hyper-realistic deepfakes to fill an information void amid the country’s internet restrictions. US disinformation watchdog …",
    "link": "https://www.digitaljournal.com/world/ai-created-iran-protest-videos-gain-traction/article",
    "timestamp": "2026-01-15T02:47:49Z"
  },
  {
    "title": "Wells Fargo misses profit estimates on severance costs, shares fall",
    "description": "Wells Fargo reported lower profits, impacted by severance costs for operational streamlining. The bank's shares saw a significant drop. Despite missing some profit targets, Wells Fargo is focusing on growth initiatives, including new credit card products and …",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/wells-fargo-misses-profit-estimates-on-severance-costs-shares-fall/articleshow/126537193.cms",
    "timestamp": "2026-01-15T02:46:41Z"
  },
  {
    "title": "The principles of Josh Hawley, man of principle",
    "description": "You’ll never guess who caved after making noises about being willing to check the power of the president to take unauthorized military action: The US Senate has voted against a war powers resolution that would have prevented Donald Trump from taking further m…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/the-principles-of-josh-hawley-man-of-principle",
    "timestamp": "2026-01-15T02:40:39Z"
  },
  {
    "title": "Key quotes from President Trump's interview with Reuters (Reuters)",
    "description": "Reuters:\nKey quotes from President Trump's interview with Reuters  —  U.S. President Donald Trump sat for an interview with Reuters in the Oval Office on Wednesday.  Here are some key quotes:  —  FEDERAL RESERVE INDEPENDENCE  —  “A president should have somet…",
    "link": "https://www.memeorandum.com/260114/p159",
    "timestamp": "2026-01-15T02:40:01Z"
  },
  {
    "title": "Gold slips as profit-taking, softer geopolitical tone hit safe-haven demand",
    "description": "Gold prices eased on Thursday after reaching record highs. Investors took profits as U.S. President Donald Trump softened his stance on the Federal Reserve chair and Iran. This reduced demand for gold as a safe haven. Other precious metals like silver, platin…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-slips-as-profit-taking-softer-geopolitical-tone-hit-safe-haven-demand/articleshow/126537137.cms",
    "timestamp": "2026-01-15T02:39:17Z"
  },
  {
    "title": "Yen steadies as traders gird for election, intervention fears lurk",
    "description": "The yen hovered near 18-month lows as traders anticipated intervention following strong warnings ahead of a Japanese election that could spur fiscal stimulus. Meanwhile, the dollar recovered from initial weakness after Federal Reserve Chair Powell addressed s…",
    "link": "https://economictimes.indiatimes.com/markets/forex/yen-steadies-as-traders-gird-for-election-intervention-fears-lurk/articleshow/126537113.cms",
    "timestamp": "2026-01-15T02:37:16Z"
  },
  {
    "title": "Oil drops as Trump calms Iran fears; tech stocks slide in Asia",
    "description": "TOKYO, Jan 15 : Oil prices retreated from multi-month highs on Thursday and safe-haven gold eased back from a record peak after U.S. President Donald Trump calmed market anxiety about potential U.S. military action against Iran.A selloff in tech stocks extend…",
    "link": "https://www.channelnewsasia.com/business/oil-drops-trump-calms-iran-fears-tech-stocks-slide-in-asia-5860431",
    "timestamp": "2026-01-15T02:37:16Z"
  },
  {
    "title": "Trump embraces AI deepfakes in political messaging",
    "description": "From playing football in the Oval Office to sipping cocktails on a sun lounger in Gaza and attacking critics from a fighter jet, Donald Trump has become the first US president to deploy AI-generated imagery as a key tool of political communications. \"While it…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-embraces-ai-deepfakes-in-political-messaging/articleshow/126537108.cms",
    "timestamp": "2026-01-15T02:37:06Z"
  },
  {
    "title": "Oil prices sink more than 2% as Trump remarks calm concern about Iran",
    "description": "Oil prices dropped significantly as President Trump indicated a halt to killings in Iran, easing fears of military action and supply disruptions.  Adding to the bearish sentiment, U.S. crude and gasoline inventories saw a sharp rise, while Venezuela resumed o…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-sink-more-than-2-as-trump-remarks-calm-concern-about-iran/articleshow/126537090.cms",
    "timestamp": "2026-01-15T02:34:50Z"
  },
  {
    "title": "A California NGO called Community Forward SF is running San Francisco’s Managed Alcohol Program",
    "description": "A California NGO called Community Forward SF is running San Francisco’s Managed Alcohol Program The NGO is supposed to provide free alcohol shots for homeless alcoholics They’ve got $16 million per year for 5 years and have ONLY SERVED 55 CLIENTS $80 MILLION …",
    "link": "https://freerepublic.com/focus/f-chat/4362198/posts",
    "timestamp": "2026-01-15T02:30:52Z"
  },
  {
    "title": "Ukraine war: Trump says Zelenskiy, not Putin, is holding up peace deal",
    "description": "Ukraine peace plan: Trump's comments suggested renewed frustration with the Ukrainian leader. The two presidents have long had a volatile relationship, though their interactions seem to have improved over ​Trump's first year back in office.",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-war-trump-says-zelenskiy-not-putin-is-holding-up-peace-deal/articleshow/126537063.cms",
    "timestamp": "2026-01-15T02:30:47Z"
  },
  {
    "title": "Venezuela's acting president vows to continue releasing prisoners detained under Maduro",
    "description": "Venezuela’s acting President Delcy Rodríguez vows to continue releasing prisoners detained under former President Nicolás Maduro",
    "link": "https://abcnews.go.com/International/wireStory/venezuelas-acting-president-vows-continue-releasing-prisoners-detained-129211691",
    "timestamp": "2026-01-15T02:30:03Z"
  },
  {
    "title": "Trump is making China - not America - great again, global survey suggests (Jon Henley/The Guardian)",
    "description": "Jon Henley / The Guardian:\nTrump is making China - not America - great again, global survey suggests  —  Exclusive: US is less feared by its traditional adversaries, while its allies feel ever more distant, results show  —  A year after Donald Trump's return …",
    "link": "https://www.memeorandum.com/260114/p157",
    "timestamp": "2026-01-15T02:30:02Z"
  },
  {
    "title": "The US has officially started selling Venezuelan oil | CNN Business",
    "description": "The US has completed its first sale of Venezuelan oil since the US attached Venezuela and captured its president, Nicolás Maduro, earlier this month, according to an administration official.",
    "link": "https://www.cnn.com/2026/01/14/business/venezuelan-oil-us-sell-trump",
    "timestamp": "2026-01-15T02:29:34Z"
  },
  {
    "title": "CNBC Daily Open: Gold and silver pop over geopolitical turmoil, including U.S.-Denmark rift over Greenland",
    "description": "Global geopolitical turmoil, as well as Trump's apparent attack on the Fed, is pushing up the prices of gold and silver.",
    "link": "https://www.cnbc.com/2026/01/15/gold-and-silver-surge-as-geopolitics-heat-up-from-greenland-to-iran.html",
    "timestamp": "2026-01-15T02:28:54Z"
  },
  {
    "title": "Dreams on hold for Rohingya children in Bangladesh camps",
    "description": "Books tucked under their arms, children file into a small classroom in Bangladesh’s vast refugee camps, home to more than a million Rohingya who have fled neighbouring Myanmar. “They still dream of becoming pilots, doctors or engineers,” said their teacher Mo…",
    "link": "https://www.digitaljournal.com/world/dreams-on-hold-for-rohingya-children-in-bangladesh-camps/article",
    "timestamp": "2026-01-15T02:27:20Z"
  },
  {
    "title": "Senate Republicans Kill War Powers Measure on Venezuela",
    "description": "Senate Republicans voted to dismiss a war powers resolution Wednesday that would have limited President Donald Trump's ability to conduct further attacks on Venezuela after two GOP senators reversed course on supporting the legislation. Trump put intense pres…",
    "link": "https://freerepublic.com/focus/f-news/4362197/posts",
    "timestamp": "2026-01-15T02:26:24Z"
  },
  {
    "title": "'Tragedy is underway': Comedian uncorks dark warning about Trump's latest move",
    "description": "President Donald Trump may soon prove one of America's founding fathers right, that a government that attacks the press is a \"prologue to a tragedy or a farce,\" according to a new column. Comedian and actor Michael Ian Black argued in a new piece for The Dail…",
    "link": "https://www.rawstory.com/trump-2674896389/",
    "timestamp": "2026-01-15T02:26:02Z"
  },
  {
    "title": "Democrat Rep. Shri Thanedar to Introduce Bill to ‘Abolish ICE’: ‘ICE Is Beyond Reform’",
    "description": "Rep. Shri Thanedar (D-MI) revealed that he was going to be introducing a bill that would abolish U.S. Immigration and Customs Enforcement (ICE), claiming that ICE was “beyond reform.”",
    "link": "https://freerepublic.com/focus/f-news/4362196/posts",
    "timestamp": "2026-01-15T02:25:35Z"
  },
  {
    "title": "Macron Sends Troops to Greenland as Trump Ramps Up Pressure: ‘Already on Their Way’",
    "description": "Emmanuel Macron announced he is sending troops to Greenland to participate in military exercises, as Donald Trump's threats against the Danish territory have intensified.\nThe post Macron Sends Troops to Greenland as Trump Ramps Up Pressure: ‘Already on Their …",
    "link": "https://www.mediaite.com/politics/macron-sends-troops-to-greenland-as-trump-ramps-up-pressure-already-on-their-way/",
    "timestamp": "2026-01-15T02:22:27Z"
  },
  {
    "title": "House GOP's new Jan. 6 committee questions what happened that day",
    "description": "The House GOP’s new Select Committee on the Jan. 6, 2021, Capitol attack has held its first hearing, but it's clear the trauma of that day still lingers",
    "link": "https://abcnews.go.com/Politics/wireStory/house-gops-new-jan-6-committee-questions-happened-129226566",
    "timestamp": "2026-01-15T02:21:37Z"
  },
  {
    "title": "Long-awaited EU-Mercosur trade pact set for signing",
    "description": "The European Union and South American bloc Mercosur are set to sign an agreement, more than 25 years in the making, to create one of the world's largest free trade areas.",
    "link": "https://www.rte.ie/news/world/2026/0115/1553179-mercosur-trade-pact/",
    "timestamp": "2026-01-15T02:20:43Z"
  },
  {
    "title": "Coinbase CEO Pulls Support for Senate Crypto Bill Over Tokenized Equities Ban",
    "description": "Cryptocurrency exchange Coinbase has withdrawn its support for the Senate Banking Committee’s draft of a market structure bill for digital assets. “We’d rather have no bill than a bad bill,” Coinbase CEO Brian Armstrong said in a Wednesday (Jan. 14) post on X…",
    "link": "https://www.pymnts.com/cryptocurrency/2026/coinbase-ceo-pulls-support-for-senate-crypto-bill-over-tokenized-equities-ban/",
    "timestamp": "2026-01-15T02:17:24Z"
  },
  {
    "title": "Trump's legal losing streak continues as judge blocks $130M food stamp cut",
    "description": "President Donald Trump added yet another notch to his belt of legal losses on Wednesday, as a federal judge ruled his Department of Agriculture cannot cut back nutrition assistance payments to Minnesota.The preliminary injunction was first flagged by Politico…",
    "link": "https://www.rawstory.com/trump-minnesota-2674896334/",
    "timestamp": "2026-01-15T02:16:39Z"
  },
  {
    "title": "Asian shares set for weaker open, crude oil falls",
    "description": "Asia's benchmark share index is poised to dip from a record high following Wall Street's decline, driven by a rotation out of expensive technology stocks. Futures for Japan, Hong Kong, and China fell as the Nasdaq 100 dropped. Oil prices also decreased after …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-set-for-weaker-open-crude-oil-falls/articleshow/126536949.cms",
    "timestamp": "2026-01-15T02:13:52Z"
  },
  {
    "title": "Trump questions Reza Pahlavi's ability to garner support in Iran (Steve Holland/Reuters)",
    "description": "Steve Holland / Reuters:\nTrump questions Reza Pahlavi's ability to garner support in Iran  —  U.S. President Donald Trump said on Wednesday that Iranian opposition figure Reza Pahlavi “seems very nice” but expressed uncertainty over whether Pahlavi would be a…",
    "link": "https://www.memeorandum.com/260114/p155",
    "timestamp": "2026-01-15T02:10:01Z"
  },
  {
    "title": "Vanessa and Kai Trump dress to the nines for Tiger Woods’ lavish 50th birthday bash",
    "description": "Kai previously attended the Ryder Cup with her grandfather, President Donald Trump.",
    "link": "https://pagesix.com/2026/01/14/celebrity-news/vanessa-kai-trump-attend-tiger-woods-50th-birthday-party/",
    "timestamp": "2026-01-15T02:09:04Z"
  },
  {
    "title": "Canada’s Mark Carney seeks reset on pivotal trip to China",
    "description": "Canadian leader's visit comes after nearly a decade of strained ties between Ottawa and Beijing.",
    "link": "https://www.aljazeera.com/economy/2026/1/15/canadas-mark-carney-seeks-reset-on-pivotal-trip-to-china",
    "timestamp": "2026-01-15T02:08:26Z"
  },
  {
    "title": "Ted Cruz Declares, ‘Jews Didn’t Kill Jesus – I Did’",
    "description": "Sen. Ted Cruz (R-TX) made a startling confession on his podcast 'The Verdict' on Wednesday, declaring, \"Jews didn't kill Jesus – I did.\"\nThe post Ted Cruz Declares, ‘Jews Didn’t Kill Jesus – I Did’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/ted-cruz-declares-jews-didnt-kill-jesus-i-did/",
    "timestamp": "2026-01-15T02:08:25Z"
  },
  {
    "title": "Watch Bret Baier And Iran’s Foreign Minister Share Heated Exchange Over Ayatollah’s Threat To Trump",
    "description": "Baier clashed with Iranian Foreign Minister Abbas Araghchi during an interview Wednesday over Supreme Leader Ayatollah public threats toward President Donald Trump.",
    "link": "https://dailycaller.com/2026/01/14/bret-bairer-abbas-araghchi-ayatollah-ali-khamenei-threat-trump/",
    "timestamp": "2026-01-15T02:05:41Z"
  },
  {
    "title": "Medical expert claims Trump had a stroke — and Air Force One stairs video tells the story",
    "description": "Donald Trump has had a stroke, a prominent clinical professor of medicine said, listing evidence he said he saw in the president's behavior.\"My impression is that President Trump has had a stroke, and I think there's several lines of evidence supporting that,…",
    "link": "https://www.rawstory.com/trump-health-2674896382/",
    "timestamp": "2026-01-15T02:04:39Z"
  },
  {
    "title": "Trump administration slashes funding for substance abuse and mental health programs nationwide - NewsBreak",
    "description": "A top Democrat slammed the Trump administration late Wednesday for creating “uncertainty and confusion” in cutting thousands of substance abuse and mental",
    "link": "https://www.newsbreak.com/share/4442674659535-trump-administration-slashes-funding-for-substance-abuse-and-mental-health-programs-nationwide?s=a2&amp;share_destination_id=MzE0Njg5MTUyLTE3Njg0NDI0OTE3MDQ%3D&amp;pd=0LIP1Ubv&amp;hl=en_US&amp;send_time=1768442491&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.3.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-15T02:04:35Z"
  },
  {
    "title": "Trump administration slashes funding for substance abuse and mental health programs nationwide - NewsBreak",
    "description": "A top Democrat slammed the Trump administration late Wednesday for creating “uncertainty and confusion” in cutting thousands of substance abuse and mental",
    "link": "https://www.newsbreak.com/news/4442674659535-trump-administration-slashes-funding-for-substance-abuse-and-mental-health-programs-nationwide?noAds=1&amp;_f=app_share&amp;s=a2&amp;share_destination_id=MzE5MjE0NDcwLTE3Njg0NDIzNTcyNzA%3D",
    "timestamp": "2026-01-15T01:59:47Z"
  },
  {
    "title": "Trump Talks Oil, Trade in ‘Good Call’ With Venezuela’s Rodriguez",
    "description": "President Donald Trump said he had a “very good call” with acting Venezuelan President Delcy Rodriguez on Wednesday, hailing her cooperation with his administration a day before he is scheduled to meet with the country’s opposition leader.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-talks-oil-trade-in-good-call-with-venezuelas-rodriguez",
    "timestamp": "2026-01-15T01:58:16Z"
  }
]