[
  {
    "title": "Amnesty says US strike on a Yemen prison that killed dozens of African migrants may be a war crime",
    "description": "Amnesty International says a U.S. airstrike in April that killed 60 detained African migrants should be investigated as a possible war crime",
    "link": "https://abcnews.go.com/International/wireStory/amnesty-us-strike-yemen-prison-killed-dozens-african-126960513",
    "timestamp": "2025-10-29T01:25:46Z"
  },
  {
    "title": "“Get Out There and Ravish!”: Woman “Out of Food Stamps” Shows Off Stolen Goods, Urges Others to Steal at Will and “Infiltrate” Churches for Cash",
    "description": "(WARNING: Graphic language in some videos in this story) (WND News Center)—Four weeks into the federal government shutdown, a woman claiming she’s out of food stamps is bragging online about stealing from a grocery store while urging others to steal at will a…",
    "link": "https://freerepublic.com/focus/f-chat/4349295/posts",
    "timestamp": "2025-10-29T01:23:52Z"
  },
  {
    "title": "Stock Market Highlights 29th October 2025: Sensex ended 368.97 pts or 0.44% positive at 84,997.13, Nifty 50 gained 117.70 pts or 0.45% to close at 26,053.90",
    "description": "Sensex, Nifty, Share Prices highlights: Indian equity benchmarks traded with a positive bias on Wednesday, buoyed by firm global cues and optimism ahead of the US Federal Reserve’s policy decision. At 1:17 p.m., the Sensex climbed 411 points to 85,039, while …",
    "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-29th-oct-2025/article70213908.ece",
    "timestamp": "2025-10-29T01:23:48Z"
  },
  {
    "title": "Trump Makes 'Emergency' Supreme Court Power Grab Amid AI Coup By Billionaire Pals",
    "description": "President Donald Trump's administration filed an \"emergency\" Supreme Court plea to remove the register of copyrights at the Library of Congress, which had refused to support the plans of AI companies owned by his billionaire supporters.\n\n\nIn September, the U.…",
    "link": "https://crooksandliars.com/2025/10/trump-makes-emergency-supreme-court-power",
    "timestamp": "2025-10-29T01:21:49Z"
  },
  {
    "title": "Trump fires board that oversees D.C. construction projects",
    "description": "President Trump fired all six sitting members of a board that oversees architecture in D.C., as he plans a slate of major building projects — including a massive White House ballroom.",
    "link": "https://www.cbsnews.com/news/trump-fires-board-that-oversees-d-c-construction-projects-as-he-plans-major-changes-to-white-house/",
    "timestamp": "2025-10-29T01:17:44Z"
  },
  {
    "title": "Dutch vote in elections in test of European populism's reach",
    "description": "THE HAGUE (Reuters) -The Dutch vote in a national election on Wednesday with a choice between doubling down on the anti-immigration nationalism of populist Geert Wilders, who sank the last conservative coalition after a fractious two years, or a return to the…",
    "link": "https://www.thestar.com.my/news/world/2025/10/29/dutch-vote-in-elections-in-test-of-european-populism039s-reach",
    "timestamp": "2025-10-29T01:17:00Z"
  },
  {
    "title": "Asian stocks open higher as AI, Fed lift sentiment",
    "description": "Asian markets opened higher today. Investors are optimistic about artificial intelligence driving profits for tech giants. Bets on a Federal Reserve interest rate cut are also boosting sentiment. Major tech companies are set to report earnings, with investors…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-open-higher-as-ai-fed-lift-sentiment/articleshow/124886377.cms",
    "timestamp": "2025-10-29T01:16:31Z"
  },
  {
    "title": "The End Is Near! MSNBC Announces When It Will Go Dark, Turn into MSNOW",
    "description": "Cue the Sinatra music!On Monday, MSNBC’s parent company Versant — the name of the company consisting of seven cable news channels Comcast no longer wanted to be tied down to — decreed the much-lampooned name-change for the far-left hot take factory to MS NOW …",
    "link": "https://freerepublic.com/focus/f-chat/4349290/posts",
    "timestamp": "2025-10-29T01:11:56Z"
  },
  {
    "title": "North Korea touts missile tests as Trump visits South Korea",
    "description": "North Korea announced successful sea-to-surface cruise missile tests. These firings occurred as U.S. President Donald Trump visited South Korea. The missiles flew for over two hours, hitting targets accurately. This demonstration highlights North Korea's expa…",
    "link": "https://economictimes.indiatimes.com/news/defence/north-korea-touts-missile-tests-as-trump-visits-south-korea/articleshow/124886352.cms",
    "timestamp": "2025-10-29T01:11:54Z"
  },
  {
    "title": "Can Trump charm President Xi?",
    "description": "Donald Trump is a creative fellow with a pronounced tendency to personalise his inventions — see his eponymous tower. Yet as he tours East Asia this week, it is worth recalling that he did not invent the hyper-personalised approach to diplomacy that overrides…",
    "link": "https://biztoc.com/x/13e092db56ec77e3",
    "timestamp": "2025-10-29T01:11:41Z"
  },
  {
    "title": "Trump Admin. Ends Biden-Era Abortion Rule Likely Linked to Child Sex Trafficking",
    "description": "President Donald Trump and his administration are undoing a Biden-era immigration provision that would have facilitated abortions for children. The Daily Signal reported that the U.S. Department of Health and Human Services (HHS) is terminating rules and prog…",
    "link": "https://freerepublic.com/focus/f-chat/4349289/posts",
    "timestamp": "2025-10-29T01:11:07Z"
  },
  {
    "title": "14 people killed as US destroys four more alleged drug boats",
    "description": "Mexican authorities are searching for a lone survivor seen clinging to wreckage following the strikes in the eastern Pacific Ocean.",
    "link": "https://www.abc.net.au/news/2025-10-29/14-people-killed-as-us-strikes-four-more-alleged-drug-boats/105946298",
    "timestamp": "2025-10-29T01:10:14Z"
  },
  {
    "title": "Trump heads to South Korea for key China meet",
    "description": "President Donald Trump departed Japan for South Korea on Wednesday, with a crucial meeting with Chinese leader Xi Jinping on the horizon. This encounter could potentially lead to a truce in the ongoing trade war between the United States and China.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-heads-to-south-korea-for-key-china-meet/articleshow/124886328.cms",
    "timestamp": "2025-10-29T01:08:33Z"
  },
  {
    "title": "Canada Rebuilds Asia Trade Ties to Counter Trump Tariff Pain",
    "description": "President Donald Trump’s latest tariff salvo against Canada landed just as Mark Carney was setting out on a mission to insulate his country from the fallout of the trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-rebuilds-asia-trade-ties-to-counter-trump-tariff-pain",
    "timestamp": "2025-10-29T01:07:44Z"
  },
  {
    "title": "White House fires fine arts advisers as Trump's $300 million ballroom plans whirl",
    "description": "The commission is charged with giving expert advice to the president, Congress and the heads of departments on matters of design and aesthetics.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/28/white-house-arts-commission-ballroom-trump/86954583007/",
    "timestamp": "2025-10-29T01:05:00Z"
  },
  {
    "title": "Nvidia nears $5 trillion valuation as AI chip orders top $500 billion",
    "description": "Nvidia nears $5 trillion market value after $500 billion AI chip bookings and plans for seven U.S. supercomputers, cementing its lead in the global AI race.",
    "link": "https://www.thehindubusinessline.com/info-tech/nvidia-nears-5-trillion-valuation-as-ai-chip-orders-top-500-billion/article70215214.ece",
    "timestamp": "2025-10-29T01:04:22Z"
  },
  {
    "title": "Trump in Japan live: US president departs for South Korea",
    "description": "TOKYO -- U.S. President Donald Trump is on a whirlwind trip to Asia, reconnecting with partners shaken by his global tariff policies and maneuvering in his trade war with China.\nAfter a stop in Malaysia for the ASEAN Summit, Trump arrived in Japan on Monday. …",
    "link": "https://biztoc.com/x/6367f3319f0bda2e",
    "timestamp": "2025-10-29T01:00:23Z"
  },
  {
    "title": "GRINCH: Christmas Festival Canceled Due To Trump",
    "description": "Donald Trump is officially the Grinch Who Stole Christmas (due to his tariffs!). \nAn annual Christmas celebration in Rhinebeck, New York has officially been cancelled due to Donald Trump's tariffs. The Hudson Valley event cannot go on due to rising costs that…",
    "link": "https://crooksandliars.com/2025/10/grinch-christmas-festival-canceled-due",
    "timestamp": "2025-10-29T01:00:01Z"
  },
  {
    "title": "Tell the Truth, The Guardian and NBC, High Weather Disaster Costs Aren’t Due to Climate Change",
    "description": "As should be obvious to any honest observer exercising the least bit of common sense, the reason for rising disaster costs is clear, the expanding bullseye effect.",
    "link": "https://wattsupwiththat.com/2025/10/28/tell-the-truth-the-guardian-and-nbc-high-weather-disaster-costs-arent-due-to-climate-change/",
    "timestamp": "2025-10-29T01:00:00Z"
  },
  {
    "title": "Transcript: The GOP May Lose Next Week’s Elections—Thanks to Trump",
    "description": "This is a lightly edited transcript of the October 28 edition of Right Now With Perry Bacon. You can watch the video here or by following this show on YouTube or Substack.Perry Bacon: Good afternoon. This is the Right Now podcast by The New Republic and I’m t…",
    "link": "https://newrepublic.com/article/202389/transcript-gop-may-lose-next-week-elections-thanks-trump",
    "timestamp": "2025-10-29T00:59:41Z"
  },
  {
    "title": "Trump says he'd love a third term. House Speaker Johnson says there's 'no path'",
    "description": "House Speaker Mike Johnson stated that President Trump's musings about a third-term bid face constitutional hurdles, specifically the 22nd Amendment, which would require a lengthy amendment process. Johnson believes Trump understands these limitations and emp…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-hed-love-a-third-term-house-speaker-johnson-says-theres-no-path/articleshow/124886262.cms",
    "timestamp": "2025-10-29T00:58:44Z"
  },
  {
    "title": "Democrat Cities Better Prepare for More Troops After What Trump Just Said",
    "description": "President Donald Trump declared that he will escalate his military deployments in major cities to curb crime, a move that has met with controversy. The president addressed American service members in Japan on Monday, touting the strength of the U.S. military …",
    "link": "https://freerepublic.com/focus/f-news/4349284/posts",
    "timestamp": "2025-10-29T00:56:56Z"
  },
  {
    "title": "The Republicans thwarting the White House’s redistricting hopes",
    "description": "Efforts to remap red states before the midterms are hitting roadblocks from state-level Republicans. Efforts to remap red states before the midterms are hitting roadblocks from state-level Republicans. Protesters cheer during a rally against redistricting at …",
    "link": "https://freerepublic.com/focus/f-news/4349283/posts",
    "timestamp": "2025-10-29T00:56:16Z"
  },
  {
    "title": "Senate passes bipartisan resolution that would block Trump's tariffs on Brazil",
    "description": "The rebuke of Trump is largely symbolic, for now, since the House is not allowing votes on measures challenging Trump's tariffs until at least next year.",
    "link": "https://www.nbcnews.com/politics/congress/senate-passes-bipartisan-resolution-block-trump-tariffs-brazil-rcna240393",
    "timestamp": "2025-10-29T00:50:28Z"
  },
  {
    "title": "Nvidia CEO expects to make announcements with South Korean partners this week",
    "description": "(Reuters) -Nvidia CEO Jensen Huang said on Tuesday he expects to make announcements with South Korean companies that will please U.S.",
    "link": "https://finance.yahoo.com/news/nvidia-ceo-expects-announcements-south-005017998.html",
    "timestamp": "2025-10-29T00:50:17Z"
  },
  {
    "title": "Trump Offers Little Relief for Asean, Bloomberg Economics Says",
    "description": "US President Donald Trump’s latest trade deals with members of the Association of Southeast Asian Nations risks seeing them receive less than Washington gets in return, according to Bloomberg Economics.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-offers-little-relief-for-asean-bloomberg-economics-says",
    "timestamp": "2025-10-29T00:47:25Z"
  },
  {
    "title": "Nvidia CEO expects to make announcements with South Korean partners this week",
    "description": "Huang plans to meet global leaders and top Korean executives when he attends the Asia-Pacific Economic Cooperation CEO Summit in South Korea, the U.S...",
    "link": "https://finance.yahoo.com/news/nvidia-ceo-expects-announcements-south-004712025.html",
    "timestamp": "2025-10-29T00:47:12Z"
  },
  {
    "title": "Why Israel can’t stop fighting everyone",
    "description": "The far-right authorities in depend on nationalistic warmongering to maintain their legitimacy – even at the cost of a key alliance Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627071-israel-cant-stop-fighting-everyone/",
    "timestamp": "2025-10-29T00:45:50Z"
  },
  {
    "title": "Israel strikes Gaza after accusing Hamas of violating US-brokered ceasefire",
    "description": "Israeli warplanes struck Gaza after accusing Hamas of breaking a ceasefire. The attacks killed at least 26 people. Prime Minister Netanyahu ordered powerful strikes. The US-backed ceasefire, brokered by President Trump, is facing its latest test. Both sides h…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-strikes-gaza-after-accusing-hamas-of-violating-us-brokered-ceasefire/articleshow/124886191.cms",
    "timestamp": "2025-10-29T00:45:20Z"
  },
  {
    "title": "North Korea says it test-fired cruise-missiles hours ahead of Trump's arrival in South Korea",
    "description": "North Korea said Wednesday it fired sea-to-surface cruise missiles into its western waters, in another display of its growing military capabilities as U.S. President Donald Trump travels to South Korea for a regional summit.",
    "link": "https://www.cbc.ca/news/world/north-korea-missiles-trump-visit-9.6957701",
    "timestamp": "2025-10-29T00:39:18Z"
  },
  {
    "title": "‘Last-ditch push’: Pakistan-Afghanistan talks falter amid deep mistrust",
    "description": "A wider conflict looms as neighbours fail to agree on dismantling the TTP armed group, warn analysts.",
    "link": "https://www.aljazeera.com/news/2025/10/29/last-ditch-push-pakistan-afghanistan-talks-falter-amid-deep-mistrust",
    "timestamp": "2025-10-29T00:38:36Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Drives Forward Billions in Investments from Japan",
    "description": "",
    "link": "https://biztoc.com/x/f32fba7911c6b695",
    "timestamp": "2025-10-29T00:38:07Z"
  },
  {
    "title": "Defense Department takes steps to fire civilian employees with 'speed and conviction'",
    "description": "The policy, which has been in effect for about a month, essentially accelerates the turnaround time for dismissing a civilian employee at the Defense Department.",
    "link": "https://www.nbcnews.com/politics/national-security/pentagon-takes-steps-fire-civilian-workers-speed-conviction-rcna240384",
    "timestamp": "2025-10-29T00:35:40Z"
  },
  {
    "title": "PM Wong to make introductory visit to South Korea, meet with President Lee Jae Myung",
    "description": "The prime minister will attend the Asia-Pacific Economic Cooperation (APEC) Economic Leaders’ Meeting in Gyeongju before meeting the South Korean president in Seoul.",
    "link": "https://www.channelnewsasia.com/singapore/lawrence-wong-lee-jae-myung-apec-seoul-gyeongju-5427446",
    "timestamp": "2025-10-29T00:34:21Z"
  },
  {
    "title": "Israel strikes Gaza after accusing Hamas of violating U.S.-brokered ceasefire",
    "description": "The development is the latest test of the fragile deal brokered earlier this month.",
    "link": "https://www.japantimes.co.jp/news/2025/10/29/world/politics/israel-gaza-hamas-us-ceasefire/",
    "timestamp": "2025-10-29T00:33:00Z"
  },
  {
    "title": "Strange way of dealing with uncertainty",
    "description": "In the wake of the Trump shocks, the bureaucracy will typically play up the risks and persuade the political leadership to shelve reforms",
    "link": "https://www.thehindubusinessline.com/opinion/strange-way-of-dealing-with-uncertainty/article70213738.ece",
    "timestamp": "2025-10-29T00:30:00Z"
  },
  {
    "title": "White House Urged Firing Live Bombs, Not Dummies, For Trump's Visit To Navy Celebration: AP Sources",
    "description": "The White House pressed Navy officials to launch 2,000-pound live bombs instead of dummy explosives during a recent military demonstration for the service’s 250th anniversary celebration that President Donald Trump attended.",
    "link": "https://www.huffpost.com/entry/white-house-live-bombs-trump-navy-celebration_n_69015d74e4b074fca218c41c",
    "timestamp": "2025-10-29T00:28:42Z"
  },
  {
    "title": "Trump's true 'goal' is 'worse' than a dictatorship: expert",
    "description": "In an article for the Los Angeles Times published Tuesday, columnist Jonah Goldberg argued that President Donald Trump’s claims of emergency powers to impose tariffs reflect a dangerous strain of “Caesarism” – the age-old tendency of republics to surrender ex…",
    "link": "https://www.rawstory.com/trump-dictator-2674244447/",
    "timestamp": "2025-10-29T00:28:12Z"
  },
  {
    "title": "Trump in Japan live: US president set to depart for South Korea",
    "description": "TOKYO -- U.S. President Donald Trump is on a whirlwind trip to Asia, reconnecting with partners shaken by his global tariff policies and maneuvering in his trade war with China.\nAfter a stop in Malaysia for the ASEAN Summit, Trump arrived in Japan on Monday. …",
    "link": "https://biztoc.com/x/e02db311bc7c50f0",
    "timestamp": "2025-10-29T00:27:13Z"
  },
  {
    "title": "Jay-Z defends controversial Super Bowl halftime show choice",
    "description": "Jay-Z has once again addressed the controversy surrounding his choice of Bad Bunny as the performer for the 2026 Super Bowl Halftime Show. \n\nThe hip-hop mogul&apos;s Roc Nation lab",
    "link": "https://www.marca.com/en/nfl/super-bowl/2025/10/29/6901460eca47418d5b8b4583.html",
    "timestamp": "2025-10-29T00:25:31Z"
  },
  {
    "title": "Fact Check: MSNBC Host Nicole Wallace Claims Democrats Have Not Called Trump Hitler",
    "description": "CLAIM: MSNBC host Nicolle Wallace claimed she didn't think \"any Democrat\" had called President Donald Trump Adolf Hitler.\nVERDICT: False. Several Democrats have used rhetoric comparing Trump to Hitler, and have suggested that he is a \"wannabe Hitler.\"\nThe pos…",
    "link": "https://www.breitbart.com/politics/2025/10/28/ffact-check-msnbc-host-nicole-wallace-claims-democrats-have-not-called-trump-hitler/",
    "timestamp": "2025-10-29T00:23:43Z"
  },
  {
    "title": "Trump’s Media Company Set To Roll Out Polymarket-Like Prediction Market on Truth Social",
    "description": "\"Truth Predict” will enable Truth Social users to bet on a wide range of future events.",
    "link": "https://gizmodo.com/truth-social-prediction-market-2000677813",
    "timestamp": "2025-10-29T00:23:17Z"
  },
  {
    "title": "Italian firms to lose €140 million from Russian toilet sanctions – union chief",
    "description": "Italian companies will suffer major losses from the ban on exporting toilets to Russia, according to a regional union chief Read Full Article at RT.com",
    "link": "https://www.rt.com/business/627084-italy-losses-russia-toilet-ban/",
    "timestamp": "2025-10-29T00:21:59Z"
  },
  {
    "title": "Laura Ingraham Confronts Trump Border Czar on Report He’s Clashing With DHS Boss: ‘Is That Report in Any Way Accurate?’",
    "description": "Laura Ingraham confronted Tom Homan about a report on \"growing friction\" with Kristi Noem on current deportation tactics.\nThe post Laura Ingraham Confronts Trump Border Czar on Report He’s Clashing With DHS Boss: ‘Is That Report in Any Way Accurate?’ first ap…",
    "link": "https://www.mediaite.com/media/tv/laura-ingraham-confronts-trump-border-czar-on-report-hes-clashing-with-dhs-boss-is-that-report-in-any-way-accurate/",
    "timestamp": "2025-10-29T00:20:04Z"
  },
  {
    "title": "Gallego: Dems Changed to Think Shutdowns for Policy Are Okay Because 'It's Donald Trump'",
    "description": "On Tuesday’s broadcast of CNN’s “The Arena,” Sen. Ruben Gallego (D-AZ) said that Democrats are okay with shutting down the government to get policy concessions after opposing doing so before because “it’s Donald Trump.” And “It’s also normal not to\nThe post G…",
    "link": "https://www.breitbart.com/clips/2025/10/28/gallego-dems-changed-to-think-shutdowns-for-policy-are-okay-because-its-donald-trump/",
    "timestamp": "2025-10-29T00:19:56Z"
  },
  {
    "title": "Red state shocks with massive ‘internment camp' to fulfill Trump order",
    "description": "In an effort to fulfill President Donald Trump’s executive order on homelessness, Utah is building a massive facility that housing advocates warn will function as an “internment camp” where the unhoused will be subject to forced labor.Last month, Utah’s homel…",
    "link": "https://www.rawstory.com/trump-homeless/",
    "timestamp": "2025-10-29T00:19:53Z"
  },
  {
    "title": "Can America Really Afford a Gavin Newsom Presidency?",
    "description": "To the surprise of no one this side of the Sierras, Gavin Newsom is gearing up for a presidential run — a move he’s been rehearsing since succeeding Jerry Brown as California governor in 2019.\nNewsom can often come across as a caricature of the opportunistic …",
    "link": "http://www.newgeography.com/content/008702-can-america-really-afford-a-gavin-newsom-presidency",
    "timestamp": "2025-10-29T00:18:38Z"
  },
  {
    "title": "U.S. Senate passes bill to terminate Trump tariffs against Brazil",
    "description": "The Republican-led U.S. Senate passed legislation on Tuesday that would overturn President Donald Trump's tariffs against Brazil by terminating the national emergency he declared in July in retaliation for Brazil's prosecution of its former president, Jair Bo…",
    "link": "https://japantoday.com/category/world/us-senate-passes-bill-to-terminate-trump-tariffs-against-brazil2",
    "timestamp": "2025-10-29T00:18:20Z"
  },
  {
    "title": "The Latest: Trump continues trip throughout Asia",
    "description": "U.S. President Donald Trump continues his trip throughout Asia Wednesday where he’s set to meet with South Korean President Lee Jae Myung in Gyeongju, a...",
    "link": "https://www.yahoo.com/news/articles/latest-trump-continues-trip-throughout-001815399.html",
    "timestamp": "2025-10-29T00:18:15Z"
  },
  {
    "title": "North Korea fires cruise missiles as Trump eyes meeting with Kim",
    "description": "North Korea launches cruise missiles from the Yellow Sea ahead of President Donald Trump’s visit to South Korea.",
    "link": "https://www.israelnationalnews.com/news/416975",
    "timestamp": "2025-10-29T00:16:32Z"
  },
  {
    "title": "Lawsuit aims to block SNAP suspension",
    "description": "Attorney General Andrea Campbell and 22 of her counterparts filed a lawsuit Tuesday against the U.S. Department of Agriculture, alleging the agency is using the ongoing federal government shutdown to unlawfully suspend the Supplemental Nutrition Assistance Pr…",
    "link": "https://www.bostonherald.com/2025/10/28/lawsuit-aims-to-block-snap-suspension/",
    "timestamp": "2025-10-29T00:15:56Z"
  },
  {
    "title": "Ahead of Xi meeting, White House aides worry what Trump will say about Taiwan (NBC News)",
    "description": "NBC News:\nAhead of Xi meeting, White House aides worry what Trump will say about Taiwan  —  Chinese President Xi Jinping is expected to press the U.S. to shift its policy toward Taiwan when he meets this week with President Donald Trump, who is pushing for a …",
    "link": "https://www.memeorandum.com/251028/p146",
    "timestamp": "2025-10-29T00:15:00Z"
  },
  {
    "title": "Western Union picks Solana for its stablecoin and crypto network",
    "description": "Western Union has selected Solana for its Digital Asset Network and USDPT stablecoin, which it expects to be rolled out in the first half of 2026.",
    "link": "https://cointelegraph.com/news/western-union-stablecoin-crypto-network-solana",
    "timestamp": "2025-10-29T00:13:23Z"
  },
  {
    "title": "Rudd responds to Trump criticism following awkward White House exchange",
    "description": "Australia’s Ambassador to the United States was called out for previously branding the president a ‘village idiot’.",
    "link": "https://7news.com.au/news/rudd-responds-to-trump-criticism-following-awkward-white-house-exchange-c-20503971",
    "timestamp": "2025-10-29T00:11:24Z"
  },
  {
    "title": "Democratic Rep Melanie Stansbury Claims Trump Starving Americans While Her Party Blocks Reopening The Government",
    "description": "Democrat New Mexico Rep. Melanie Stansbury said Tuesday on CNN that President Donald Trump is \"starving Americans\" as the government shutdown continues.",
    "link": "https://dailycaller.com/2025/10/28/melanie-stansbury-claims-trump-starving-americans/",
    "timestamp": "2025-10-29T00:09:58Z"
  },
  {
    "title": "E-khata now mandatory for obtaining A-khata in Bengaluru",
    "description": "Bengaluru: B-khata property owners looking to get their holdings converted into A-khata units under a govt initiative that begins on November 1 will f.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/e-khata-now-mandatory-for-obtaining-a-khata-in-bengaluru/articleshow/124880450.cms",
    "timestamp": "2025-10-29T00:09:23Z"
  },
  {
    "title": "Harvard and its A story: Why professors are reluctant to give anything less than perfection",
    "description": "Harvard University is facing renewed scrutiny as a new report reveals that nearly 60% of all undergraduate grades are now A’s, marking a sharp rise in grade inflation over two decades. Dean Amanda Claybaugh warned that this trend undermines academic rigor, dr…",
    "link": "https://timesofindia.indiatimes.com/education/news/why-is-harvard-handing-out-so-many-as-the-grade-inflation-crisis-leading-to-a-poor-academic-performance/articleshow/124885995.cms",
    "timestamp": "2025-10-29T00:09:14Z"
  },
  {
    "title": "'President Is Losing Support': MTG in Heated Clash Over Government Shutdown",
    "description": "\"I have not and will not take a paycheck during the government shutdown. Again, as I’ve been saying from the beginning ...\"",
    "link": "https://www.westernjournal.com/president-losing-support-mtg-heated-clash-government-shutdown/",
    "timestamp": "2025-10-29T00:07:00Z"
  },
  {
    "title": "Pakistan says peace talks with Afghanistan’s Taliban government in Istanbul failed after four days",
    "description": "Both sides say the ceasefire is still holding despite the stalemate in Istanbul.",
    "link": "https://www.bostonherald.com/2025/10/28/pakistan-afghanistan-peace-talks/",
    "timestamp": "2025-10-29T00:04:26Z"
  },
  {
    "title": "Congress Enjoys Ultraluxe Health Care as It Fights to Gut Yours - NewsBreak",
    "description": "If the republic were the Titanic and the government’s end-of-year shutdown over health care the iceberg, Congress would be the first-class passengers alrea",
    "link": "https://www.newsbreak.com/share/4316413102666-congress-enjoys-ultraluxe-health-care-as-it-fights-to-gut-yours?_f=app_share&amp;pd=04jUeKTH&amp;lang=en_US&amp;send_time=1761696170&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.42.1.12%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-10-29T00:03:24Z"
  },
  {
    "title": "White House Fires Entire Fine Arts Board In Charge Of Reviewing Construction Projects—Including Ballroom, Report Says",
    "description": "The agency was expected to review the president’s construction projects, including a recently announced “Independence Arch” near the Lincoln Memorial.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/28/white-house-fires-entire-fine-arts-board-in-charge-of-reviewing-construction-projects-including-ballroom-report-says/",
    "timestamp": "2025-10-29T00:02:43Z"
  },
  {
    "title": "At least 30 killed in Israeli strikes - Gaza",
    "description": "Gaza's civil defence agency said Israel carried out air strikes yesterday despite an ongoing ceasefire, after the Israeli military accused Hamas of attacking its troops and violating the US-brokered truce.",
    "link": "https://www.rte.ie/news/2025/1029/1541046-middle-east/",
    "timestamp": "2025-10-29T00:02:42Z"
  },
  {
    "title": "Peace in Gaza Depends on Palestinians’ Right to Remain – and Return",
    "description": "Amid some extremely cautious optimism for peace following a tenuous and incomplete ceasefire in Gaza, any hope for Gaza’s future depends significantly on a little-noticed point in President Donald Trump’s original 20-point peace plan. The plan’s twelfth point…",
    "link": "https://original.antiwar.com/david-vine/2025/10/28/peace-in-gaza-depends-on-palestinians-right-to-remain-and-return/",
    "timestamp": "2025-10-29T00:00:57Z"
  },
  {
    "title": "Don's Social Media Platform To Allow Betting...",
    "description": "",
    "link": "https://www.barrons.com/articles/trump-s-social-media-platform-to-allow-betting-a63b2547",
    "timestamp": "2025-10-29T00:00:03Z"
  },
  {
    "title": "7 basic science discoveries that changed the world",
    "description": "Ozempic, MRI machines and flat screen televisions all emerged out of fundamental research decades earlier — the very types of study being slashed by the US government.",
    "link": "https://www.nature.com/articles/d41586-025-03474-x",
    "timestamp": "2025-10-29T00:00:00Z"
  },
  {
    "title": "Policed and censored: professors in the southern US feel under siege",
    "description": "Politics trumps salary as the main reason academics are looking for jobs in other states, a survey of university educators shows.",
    "link": "https://www.nature.com/articles/d41586-025-03290-3",
    "timestamp": "2025-10-29T00:00:00Z"
  },
  {
    "title": "Whither a Bellwether in California?",
    "description": "California’s special election isn’t the only statewide vote on the first Tuesday in November. Gubernatorial contests in New Jersey and Virginia are likewise garnering attention, as well as New York City’s mayoral race, which has national overtones. The questi…",
    "link": "https://www.hoover.org/research/whither-bellwether-california",
    "timestamp": "2025-10-29T00:00:00Z"
  },
  {
    "title": "From MRI to Ozempic: breakthroughs that show why fundamental research must be protected",
    "description": "In these financially straitened times, funders must recognize that great discoveries often arise from work that was looking for something completely different.",
    "link": "https://www.nature.com/articles/d41586-025-03470-1",
    "timestamp": "2025-10-29T00:00:00Z"
  },
  {
    "title": "Trump to speak at summit in South Korea ahead of meeting with China's Xi Jinping",
    "description": "President Trump's final stop of his Asia tour will be focused on trade with China and the Pacific.",
    "link": "https://www.cbsnews.com/news/trump-south-korea-apec-summit-xi-meeting/",
    "timestamp": "2025-10-28T23:59:23Z"
  },
  {
    "title": "As some DEI critics say victory is near, companies face new pushback over rollbacks",
    "description": "When the nation’s largest group of HR professionals invited anti-DEI activist Robby Starbuck to a marquee conference for a talk on workplace diversity...",
    "link": "https://washingtonpost.com/business/2025/10/28/dei-companies-trump-doj/",
    "timestamp": "2025-10-28T23:56:14Z"
  },
  {
    "title": "'This is not normal': Analysts astounded by Trump's 'obscene' new ballroom move",
    "description": "Political analysts were stunned Tuesday after The Washington Post reported that President Donald Trump had fired an entire independent commission tasked with overseeing his ballroom project. The Post reported that Trump fired the entire six-member Commission …",
    "link": "https://www.rawstory.com/trump-ballroom-2674244399/",
    "timestamp": "2025-10-28T23:53:27Z"
  },
  {
    "title": "Virginia teacher shot by 6-year-old student takes $40 million lawsuit to trial",
    "description": "A Virginia court has begun hearing teacher Abby Zwerner’s $40 million lawsuit after she was shot by a six-year-old pupil at Richneck Elementary School in 2023. Zwerner accuses former assistant principal Ebony Parker of ignoring warnings that the boy had a gun…",
    "link": "https://timesofindia.indiatimes.com/education/news/virginia-teacher-shot-by-6-year-old-student-takes-40-million-lawsuit-to-trial/articleshow/124885916.cms",
    "timestamp": "2025-10-28T23:51:18Z"
  },
  {
    "title": "Comer Says Trump Family Making Millions From Crypto Business Is Ok Because ‘They’re Admitting They’re Doing This’",
    "description": "Rep. James Comer said the mind-boggling amount of money that President Donald Trump and his family have made this year off of cryptocurrency is above board because \"they're admitting they're doing this.\" \nThe post Comer Says Trump Family Making Millions From …",
    "link": "https://www.mediaite.com/media/tv/comer-says-trump-family-making-millions-from-crypto-business-is-ok-because-theyre-admitting-theyre-doing-this/",
    "timestamp": "2025-10-28T23:49:57Z"
  },
  {
    "title": "In a California GOP stronghold, voters are not happy with Newsom's plan to help Democrats",
    "description": "Conservative voters in Northern California are alarmed that a ballot measure designed to diminish Republican representation could pass in November",
    "link": "https://abcnews.go.com/Politics/wireStory/california-gop-stronghold-voters-happy-newsoms-plan-democrats-126931133",
    "timestamp": "2025-10-28T23:49:39Z"
  },
  {
    "title": "Retirees and students in Florida are seeking to defend 2020 census results against a GOP challenge",
    "description": "The students and retirees say they are concerned the Trump administration won't defend the census.",
    "link": "https://www.bostonherald.com/2025/10/28/2020-census-challenges/",
    "timestamp": "2025-10-28T23:49:16Z"
  },
  {
    "title": "South Park Season 28 Halloween Special: Satan & Trump Destroy White House",
    "description": "South Park season 28 takes on Donald Trump and the White House construction controversy with a special Halloween episode featuring Satan.",
    "link": "https://screenrant.com/south-park-season-28-halloween-episode-satan-trump-white-house/",
    "timestamp": "2025-10-28T23:47:18Z"
  },
  {
    "title": "US Senate passes bill to terminate Trump tariffs against Brazil",
    "description": "By David Morgan WASHINGTON (Reuters) -The Republican-led U.S.",
    "link": "https://www.yahoo.com/news/articles/us-senate-passes-bill-terminate-234658279.html",
    "timestamp": "2025-10-28T23:46:58Z"
  },
  {
    "title": "“Don’t close the book on him”: Tuberville says Trump could serve third term",
    "description": "Alabama's Tommy Tuberville said Trump could \"go around the Constitution.\"",
    "link": "https://www.salon.com/2025/10/28/dont-close-the-book-on-him-tuberville-says-trump-could-serve-third-term/",
    "timestamp": "2025-10-28T23:45:48Z"
  },
  {
    "title": "DHS Disputes MSNBC Writer’s Claim ICE Lowered Hiring Standards",
    "description": "The Department of Homeland Security says it is working “at turbo speed” to deport criminal illegal aliens after MSNBC ran a commentary piece outlining the... Read More\nThe post DHS Disputes MSNBC Writer’s Claim ICE Lowered Hiring Standards appeared first on T…",
    "link": "https://www.dailysignal.com/2025/10/28/dhs-responds-msnbc-column-claiming-ice-lowered-hiring-standards/",
    "timestamp": "2025-10-28T23:45:16Z"
  },
  {
    "title": "Police report omits a federal agent’s shooting at a DC driver. The man’s lawyers suspect a cover-up",
    "description": "The Oct. 17 shooting by a Homeland Security Investigations agent is under investigation.",
    "link": "https://www.bostonherald.com/2025/10/28/dc-shooting-federal-agent/",
    "timestamp": "2025-10-28T23:43:51Z"
  },
  {
    "title": "Ghazals echo through Safdarjung’s Tomb",
    "description": "The event, organised by the Sabhyata Foundation – a Smarak Sarathi under the ‘Adopt a Heritage 2.0’ initiative – in collaboration with Serendipity Arts, was curated by tabla maestro Bickram Ghosh.",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/ghazals-echo-through-safdarjungs-tomb/articleshow/124885928.cms",
    "timestamp": "2025-10-28T23:42:49Z"
  },
  {
    "title": "Exclusive - Anupamaa actor Shivam Khajuria hints at major twist in the show; says 'When temptation and trust collide'",
    "description": "Shivam Khajuria, who plays Prem in Anupamaa, has teased an intense upcoming storyline for his character. He hinted that a new female friend will test Prem and Rahi's bond, potentially leading to misunderstandings and emotional conflicts. The actor promises dr…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/exclusive-anupamaa-actor-shivam-khajuria-hints-at-major-twist-in-the-show-says-when-temptation-and-trust-collide/articleshow/124885938.cms",
    "timestamp": "2025-10-28T23:42:17Z"
  },
  {
    "title": "Karnataka govt clarifies no plans to cut trees in Lalbagh for twin tunnel road project in Bengaluru",
    "description": "Bengaluru: The state govt Tuesday clarified to the high court that until the next date of hearing on the pending public interest litigations (PILs), t.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/karnataka-govt-clarifies-no-plans-to-cut-trees-in-lalbagh-for-twin-tunnel-road-project-in-bengaluru/articleshow/124880432.cms",
    "timestamp": "2025-10-28T23:41:54Z"
  },
  {
    "title": "Senate votes to block tariffs on Brazil. It shows some pushback to Trump trade policy",
    "description": "The Senate approved a resolution Tuesday evening that would nullify President Donald Trump’s tariffs on Brazil, including oil, coffee and orange juice, as Democrats test GOP senators’ support for Trump’s trade policy",
    "link": "https://abcnews.go.com/Business/wireStory/senate-votes-block-tariffs-brazil-shows-pushback-trump-126955982",
    "timestamp": "2025-10-28T23:41:51Z"
  },
  {
    "title": "Who really broke the Israel-Hamas ceasefire? Here's what we know",
    "description": "Israel has launched three waves of airstrikes on Gaza since the Trump-brokered ceasefire went into effect.",
    "link": "https://www.snopes.com//news/2025/10/28/hamas-ceasefire-violation-claim/",
    "timestamp": "2025-10-28T23:41:00Z"
  },
  {
    "title": "CM: 8k cr of 31,628cr relief given to 40 lakh flood-affected farmers",
    "description": "Mumbai: The state govt has distributed Rs 8,000 crore as relief so far to around 40 lakh farmers whose kharif crops were washed away by heavy rain and.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/cm-8k-cr-of-31628cr-relief-given-to-40-lakh-flood-affected-farmers/articleshow/124879936.cms",
    "timestamp": "2025-10-28T23:38:31Z"
  },
  {
    "title": "Christopher Luxon flies into South Korea for Apec, ahead of Donald Trump dinner",
    "description": "The Prime Minister is in Gyeongju for Apec.",
    "link": "https://www.nzherald.co.nz/nz/politics/christopher-luxon-flies-into-south-korea-for-apec-ahead-of-donald-trump-dinner/ACCEFDSRFFDO5A4JPIEFZKTMX4/",
    "timestamp": "2025-10-28T23:37:10Z"
  },
  {
    "title": "Senate narrowly passes bill to repeal Trump's tariffs on Brazil",
    "description": "Five Republicans voted with Democrats but it likely won't pass in the House.",
    "link": "https://abcnews.go.com/Politics/senate-narrowly-passes-bill-repeal-trumps-tariffs-brazil/story?id=126955639",
    "timestamp": "2025-10-28T23:35:12Z"
  },
  {
    "title": "'Irresponsible': Conservative ex-judge believes Republicans bought in on 3rd Trump term",
    "description": "A conservative former federal judge warned MSNBC viewers on Tuesday that Republicans appear to have wrongly bought into the idea that President Donald Trump can run for a third term.J. Michael Luttig joined host Alicia Menendez on \"Deadline: White House\" to d…",
    "link": "https://www.rawstory.com/trump-third-term-2674244308/",
    "timestamp": "2025-10-28T23:34:19Z"
  },
  {
    "title": "Bloody blue city crime wave shatters college homecoming in one of year’s most violent stretches: report",
    "description": "A wave of reported shootings in Washington, D.C., left 12 victims, including a 5-year-old boy, with police arresting two suspects and recovering three guns near Howard University.",
    "link": "https://www.foxnews.com/us/bloody-blue-city-crime-wave-shatters-college-homecoming-one-years-most-violent-stretches-report",
    "timestamp": "2025-10-28T23:32:39Z"
  },
  {
    "title": "Senate votes against Trump’s 50 percent tariff on Brazil",
    "description": "The Senate once again rebuked President Donald Trump on tariffs, a vote that comes as the president is in Asia touting tariffs and notching progress on trade agreements. \nSenators on Tuesday voted 52-48 to terminate the national emergency Trump declared in or…",
    "link": "https://biztoc.com/x/ebca4ae009898763",
    "timestamp": "2025-10-28T23:32:10Z"
  },
  {
    "title": "'Don't Stream Fascism': ICE Recruitment Ads Spark Calls to Cancel Spotify Subscriptions",
    "description": "Outrage over Spotify running advertisements for US Immigration and Customs Enforcement ramped up on Tuesday, with the progressive advocacy group Indivisible urging users to cancel their subscriptions until the ICE ads are removed, engage in peaceful protests …",
    "link": "https://www.commondreams.org/news/cancel-spotify",
    "timestamp": "2025-10-28T23:32:02Z"
  },
  {
    "title": "Election Shenanigans Are Coming",
    "description": "Americans don’t have to imagine what attempts to subvert an election could look like, because it’s already happening in North Carolina.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/10/north-carolina-election-shenanigans/684746/",
    "timestamp": "2025-10-28T23:32:00Z"
  },
  {
    "title": "More than 160 Republicans potentially investigated in FBI’s Arctic Frost probe, House panel says",
    "description": "The size and scope of the Biden-era Arctic Frost investigation continues to be revealed to be larger than known as more internal DOJ & FBI records are released.The GOP-led House Judiciary Committee disclosed Tuesday that more than 160 Republicans – including …",
    "link": "https://freerepublic.com/focus/f-news/4349268/posts",
    "timestamp": "2025-10-28T23:31:05Z"
  },
  {
    "title": "Monster Hurricane Melissa Is Ominous Reminder of Trump's Perilous Climate Policy, Aid Cuts",
    "description": "As Jamaica was flogged Tuesday by Hurricane Melissa, a Category 5 monster, climate defenders highlighted how US President Donald Trump's policies—including reckless fossil fuel expansion, eviscerating federal agencies, and slashing international aid—will deep…",
    "link": "https://www.commondreams.org/news/trump-hurricane-melissa",
    "timestamp": "2025-10-28T23:30:33Z"
  },
  {
    "title": "Trump has forgotten why he won in 2024 (Andrew Prokop/Vox)",
    "description": "Andrew Prokop / Vox:\nTrump has forgotten why he won in 2024  —  For years, voters believed that, despite all of President Donald Trump's chaos and controversies, he'd still do a good job with the economy.  —  Not anymore.  —  Trump's economic approval numbers…",
    "link": "https://www.memeorandum.com/251028/p143",
    "timestamp": "2025-10-28T23:30:01Z"
  }
]