[
  {
    "title": "In anti-Trump protest, millions to hit streets at Washington Park, Chicago this Saturday: 10-point explainer",
    "description": "The anger against Donald Trump and Elon Musk is mounting in the United States. After the successful 'Hands Off' protest, anti-Trump groups have planned another protest. The 50501 group, which stands for \"50 protests in 50 states, 1 movement,\" is planning simu…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/in-anti-trump-protest-millions-to-hit-streets-at-washington-park-chicago-this-saturday-10-point-explainer/articleshow/120383073.cms",
    "timestamp": "2025-04-17T13:27:36Z"
  },
  {
    "title": "Fed's Williams sees no looming need to change monetary policy - Fox Business",
    "description": "NEW YORK (Reuters) -Federal Reserve Bank of New York President John Williams said Thursday he sees no imminent need for a change in central bank interest...",
    "link": "https://finance.yahoo.com/news/feds-williams-sees-no-looming-132649986.html",
    "timestamp": "2025-04-17T13:26:49Z"
  },
  {
    "title": "If the stock market plummets, will you intervene? Here's why Fed's Powell gave a strong 'No'",
    "description": "Jerome Powell dismissed hopes of Fed intervention amid market turmoil, calling volatility a normal response to uncertainty. His comments triggered a market crash, with Nasdaq down 3% and Nvidia plunging 7%, as Trump renewed calls for rate cuts.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/if-the-stock-market-plummets-will-you-intervene-heres-why-feds-powell-gave-a-strong-no/articleshow/120383254.cms",
    "timestamp": "2025-04-17T13:26:19Z"
  },
  {
    "title": "'Never waste a good crisis': How Sweden wants to attract US talent fleeing Trump",
    "description": "US President Donald Trump has targeted businesses and academia since he was sworn in for a second term, cracking down on diversity programmes and effectively banning some types of research. Now, Sweden hopes to attract the American talent Trump is pushing awa…",
    "link": "https://www.thelocal.se/20250417/never-waste-a-good-crisis-how-sweden-wants-to-attract-us-talent-fleeing-trump",
    "timestamp": "2025-04-17T13:25:30Z"
  },
  {
    "title": "ECB rate cut: What does it mean for mortgage borrowers on trackers, fixed and variable rates?",
    "description": "Drop of a quarter of a percentage point will benefit some consumers more than others",
    "link": "https://www.irishtimes.com/your-money/2025/04/17/ecb-rate-cut-what-does-it-mean-for-mortgage-borrowers-on-trackers-fixed-and-variable-rates/",
    "timestamp": "2025-04-17T13:23:31Z"
  },
  {
    "title": "Indian official team likely to visit Washington next week for trade talks",
    "description": "An Indian official team is set to visit Washington next week to resolve outstanding issues before formally launching negotiations for a proposed India-US bilateral trade agreement (BTA). This visit, following a recent US team visit to India, signals growing m…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-official-team-likely-to-visit-washington-next-week-for-trade-talks/articleshow/120383181.cms",
    "timestamp": "2025-04-17T13:21:55Z"
  },
  {
    "title": "Is Donald Trump Ignoring Supreme Court's Abrego Garcia Order? What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA federal judge has ordered an inquiry into the Trump administration's refusal to seek the return of Kilmar Abrego Garcia, who was wrongly deported to a notorious El Salvador prison.\nU.S. District Judge Paula …",
    "link": "https://biztoc.com/x/43125fc1584749c3",
    "timestamp": "2025-04-17T13:21:00Z"
  },
  {
    "title": "Trump's Tariffs and the Renaissance of American Manufacturing | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn April 2, \"Liberation Day,\" President Donald Trump raised tariffs and effectively ended the world's post-war liberal trading order. By the time the sun had set that evening, he had imposed, with the stroke o…",
    "link": "https://biztoc.com/x/2b845b2f66f5ec4c",
    "timestamp": "2025-04-17T13:20:42Z"
  },
  {
    "title": "Trump Ramps Up Foreign Meetings: Mexico, Japan, and Now Italy",
    "description": "President Donald Trump will meet Italian Prime Minister Giorgia Meloni at the White House today, marking the first visit by a European leader since he announced reciprocal tariffs. The visit comes at a tense moment for EU-U.S. relations. \nMeloni, leader of It…",
    "link": "https://biztoc.com/x/10e79754e34dc2ca",
    "timestamp": "2025-04-17T13:20:37Z"
  },
  {
    "title": "Fast fashion e-commerce sites Temu and Shein say they're raising prices because of tariffs",
    "description": "Both of the China-founded sites say U.S. customers will see higher prices starting next week, and industry data shows they're pulling back on U.S. advertising, too.",
    "link": "https://www.cbc.ca/news/business/temu-shein-raising-prices-1.7512710",
    "timestamp": "2025-04-17T13:20:34Z"
  },
  {
    "title": "Trump pushes Powell to cut rates, renewing debate over Fed independence",
    "description": "President Donald Trump renewed his attack on Jerome Powell Thursday, declaring in a social media post that the Federal Reserve chairman's \"termination can't come fast enough.\"\nThe strongly worded message marks the latest in a series of criticisms the presiden…",
    "link": "https://biztoc.com/x/5ebaf6a54b0592ae",
    "timestamp": "2025-04-17T13:20:30Z"
  },
  {
    "title": "Trump Launches Critical Minerals Probe to Weigh New Tariffs",
    "description": "President Donald Trump has launched a probe into the need for tariffs on critical minerals, the latest action in an expanding trade war that has targeted key sectors of the global economy.\nThe order, which Trump signed on Tuesday, calls for the commerce secre…",
    "link": "https://biztoc.com/x/58b9a858ec64aff4",
    "timestamp": "2025-04-17T13:20:29Z"
  },
  {
    "title": "Trump Yet to Reach Out to Pennsylvania Governor After Arson Attack, Shapiro Says",
    "description": "Pennsylvania Governor Josh Shapiro said he has not heard from President Trump since an arsonist tried to ignite his residence, where he was sleeping with his family",
    "link": "https://www.ibtimes.com/trump-yet-reach-out-pennsylvania-governor-after-arson-attack-shapiro-says-3770478",
    "timestamp": "2025-04-17T13:20:27Z"
  },
  {
    "title": "Japan reports a $63 billion trade surplus with the US as it talks with Trump on tariffs",
    "description": "Japan recorded a trade deficit for the fiscal year that just ended but racked up a $63 billion surplus with the United States.",
    "link": "https://www.ksat.com/business/2025/04/17/japan-reports-a-63-billion-trade-surplus-with-the-us-as-it-talks-with-trump-on-tariffs/",
    "timestamp": "2025-04-17T13:20:22Z"
  },
  {
    "title": "Former state health officer Abdul El-Sayed enters Democratic US Senate race",
    "description": "Abdul El-Sayed is the second Democrat to put his name in the running in what could be one of the most watched races in the 2026 midterm elections.",
    "link": "https://www.fox17online.com/news/national-politics/america-votes/former-state-health-officer-abdul-el-sayed-enters-democratic-us-senate-race",
    "timestamp": "2025-04-17T13:19:30Z"
  },
  {
    "title": "Temu and Shein are raising their US prices next week",
    "description": "Shein and Temu are preparing to raise their prices in the US. In almost the same notice to customers, the ultra-cheap retailers warn that they will start adjusting their prices on April 25th due to changes to “global trade rules and tariffs.” President Donald…",
    "link": "https://www.theverge.com/news/650556/temu-shein-us-price-increase-tariffs",
    "timestamp": "2025-04-17T13:18:47Z"
  },
  {
    "title": "Is Donald Trump Ignoring Supreme Court's Abrego Garcia Order? What to Know",
    "description": "The Supreme Court ordered the Trump administration to \"facilitate\" his return of Abrego Garcia after he was mistakenly deported to El Salvador.",
    "link": "https://www.newsweek.com/donald-trump-ignoring-supreme-court-order-2060919",
    "timestamp": "2025-04-17T13:18:15Z"
  },
  {
    "title": "Is Trump Destroying Science or Saving It?",
    "description": "Apparently, some 75 percent of U.S. scientists are planning to emigrate to Canada and Europe “in light of President Donald Trump’s sweeping changes to federal science policy.” Is this a joke or just a bad poll? According to my omniscient AI “Copilot,” the U.S…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311542/posts",
    "timestamp": "2025-04-17T13:18:07Z"
  },
  {
    "title": "Southeast Asia walks tightrope between China and US",
    "description": "Chinese President Xi Jinping is staging a charm offensive in the region while US President Donald Trump inflicts massive tariff pain.",
    "link": "https://www.dw.com/en/southeast-asia-walks-tightrope-between-china-and-us/a-72275663",
    "timestamp": "2025-04-17T13:18:00Z"
  },
  {
    "title": "Trump's Tariffs and the Renaissance of American Manufacturing | Opinion",
    "description": "Like them or hate them, high tariff walls are necessary for the U.S. factory sector to recover.",
    "link": "https://www.newsweek.com/trumps-tariffs-renaissance-american-manufacturing-opinion-2061022",
    "timestamp": "2025-04-17T13:17:33Z"
  },
  {
    "title": "Good Friday 2025: Is it a Federal Holiday? What is closed, open in the USA",
    "description": "Good Friday 2025, observed on April 18th, holds deep religious significance for Christians, commemorating the crucifixion of Jesus Christ. While not a federal holiday in the U.S., ten states recognize it as a state holiday. Most banks, FedEx, UPS, and USPS wi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/good-friday-2025-us-here-what-open-and-closed-across-the-united-states-of-america/articleshow/120383037.cms",
    "timestamp": "2025-04-17T13:16:31Z"
  },
  {
    "title": "Gov. Newsom to cut California budget as Trump’s trade war crimps economic outlook",
    "description": "“President Trump’s unlawful tariffs are wreaking chaos on California families, businesses, and our economy — driving up prices and threatening jobs,” said Newsom.",
    "link": "https://www.mercurynews.com/2025/04/17/newsom-to-cut-california-budget-as-trumps-trade-war-crimps-economic-outlook/",
    "timestamp": "2025-04-17T13:16:15Z"
  },
  {
    "title": "Trump Melts Down Over Fed Chair’s Dark Warning About Tariffs",
    "description": "Donald Trump isn’t too happy after Federal Reserve Chair Jerome Powell said the president’s tariff policy would cause more inflation and slow growth.\r\nIn a post on Truth Social Thursday morning, Trump furiously blamed Powell for not lowering interest rates. T…",
    "link": "https://newrepublic.com/post/194096/donald-trump-federal-reserve-jerome-powell-warning-tariffs",
    "timestamp": "2025-04-17T13:15:45Z"
  },
  {
    "title": "European Central Bank cuts interest rates for the seventh time as global trade tensions escalate",
    "description": "FRANKFURT, Germany (AP) — The European Central Bank cut interest rates Thursday for the seventh time to counter worries about economic growth fueled by President Donald Trump’s tariff onslaught. The bank’s move should support economic activity in the 20 count…",
    "link": "https://financialpost.com/pmn/european-central-bank-cuts-interest-rates-for-the-seventh-time-as-global-trade-tensions-escalate",
    "timestamp": "2025-04-17T13:14:07Z"
  },
  {
    "title": "Thai PM backs Asean united front on tariffs",
    "description": "<p>Thailand is ready to support Asean&rsquo;s collective approach in negotiating with the United States over its reciprocal <strong>tariffs</strong> on imports from countries in the region, Prime Minister Paetongtarn Shinawatra said on Thursday.</p>",
    "link": "https://www.bangkokpost.com/thailand/general/3005307/thai-pm-backs-asean-united-front-on-tariffs",
    "timestamp": "2025-04-17T13:12:00Z"
  },
  {
    "title": "TRUMP EFFECT: ICE Touts Highest Worksite Arrests in Agency History",
    "description": "U.S. Immigration and Customs Enforcement agents arrested more than 1,000 illegal alien workers and have uncovered sufficient evidence of immigration employment violations to justify the proposal of $1 million during the first 100 days of President Donald Trum…",
    "link": "https://www.breitbart.com/border/2025/04/17/trump-effect-ice-touts-highest-worksite-arrests-in-agency-history/",
    "timestamp": "2025-04-17T13:10:16Z"
  },
  {
    "title": "Secret plans for Trump's 'Golden Dome' missile shield revealed",
    "description": "Elon Musk has emerged as a frontrunner in President Donald Trump's plans to build a 'Golden Dome' missile defense shield. Musk's SpaceX company is partnering with software maker Palantir and drone builder Anduril to build key parts of Golden Dome, six sources…",
    "link": "https://freerepublic.com/focus/f-news/4311538/posts",
    "timestamp": "2025-04-17T13:09:58Z"
  },
  {
    "title": "Trump says Federal Reserve Chair Powell’s ‘termination cannot come fast enough’",
    "description": "By AAMER MADHANI and JOSH BOAK, Associated Press\nWASHINGTON (AP) — President Donald Trump slammed Federal Reserve Chair Jerome Powell on Thursday, reiterating his frustration that the Fed has not aggressively cut interest rates and saying that the central ban…",
    "link": "https://biztoc.com/x/b940badd7ef5bd23",
    "timestamp": "2025-04-17T13:09:28Z"
  },
  {
    "title": "Trump says Fed chair is ‘too late’ on interest rates: ‘Powell’s termination cannot come fast enough!’",
    "description": "President Donald Trump called Federal Reserve chair Jerome Powell “wrong” for his decision to not further cut interest rates. Powell had previously said Trump’s tariff policy would lead to higher inflation and lower growth. \nPresident Donald Trump continued h…",
    "link": "https://biztoc.com/x/eea374cbce5a2dce",
    "timestamp": "2025-04-17T13:09:24Z"
  },
  {
    "title": "Node.js malvertising campaign targets crypto users",
    "description": "Microsoft warns of a malvertising campaign using Node.js to deliver info-stealing malware via fake crypto trading sites like Binance and TradingView. Microsoft has observed Node.js increasingly used in malware campaigns since October 2024, including an ongoin…",
    "link": "https://securityaffairs.com/176651/hacking/node-js-malvertising-campaign-targets-crypto-users.html",
    "timestamp": "2025-04-17T13:07:20Z"
  },
  {
    "title": "China’s Xi, seeking to build regional ties, meets Cambodian leader",
    "description": "Chinese President Xi Jinping met the Cambodian premier in Phnom Penh on Thursday on the final leg of a Southeast Asia tour in which he sought to strengthen regional trade ties. Xi arrived in the Cambodian capital after visiting Vietnam and Malaysia as Beijing…",
    "link": "https://www.digitaljournal.com/world/chinas-xi-seeking-to-build-regional-ties-meets-cambodian-leader/article",
    "timestamp": "2025-04-17T13:07:20Z"
  },
  {
    "title": "The everyday electronics that won’t survive Trump’s trade war",
    "description": "Less than six months ago, after an inappropriate amount of research, I bought a new toaster for $30. My old toaster had died, as old toasters do, and I wanted to buy one cheap enough that I wouldn’t be mad when I had to replace it. If President Donald Trump’s…",
    "link": "https://www.vox.com/technology/409105/trump-tariffs-smartphones-laptops-appliances-electronics",
    "timestamp": "2025-04-17T13:07:07Z"
  },
  {
    "title": "China's Xi, Seeking To Build Regional Ties, Meets Cambodian Leader",
    "description": "Chinese President Xi Jinping met the Cambodian premier in Phnom Penh on Thursday on the final leg of a Southeast Asia tour in which he sought to strengthen regional trade ties.",
    "link": "https://www.ibtimes.com/chinas-xi-seeking-build-regional-ties-meets-cambodian-leader-3770476",
    "timestamp": "2025-04-17T13:06:14Z"
  },
  {
    "title": "Trump HHS eliminates office that sets poverty levels tied to benefits for at least 80 million people | CNN",
    "description": "President Donald Trump’s firings at the Department of Health and Human Services included the entire office that sets federal poverty guidelines, which determine whether tens of millions of Americans are eligible for health programs such as Medicaid, food assi…",
    "link": "https://www.cnn.com/2025/04/17/health/hhs-poverty-levels-benefits-kff-health-news/index.html",
    "timestamp": "2025-04-17T13:05:38Z"
  },
  {
    "title": "Elon Musk's company the 'frontrunner' to build widely criticized Trump project: report",
    "description": "President Donald Trump's determination to build a nationwide missile shield on par with the Iron Dome in Israel may be about to become even more controversial.Reuters reports that Elon Musk's SpaceX, along with software maker Palantir and drone builder Anduri…",
    "link": "https://www.rawstory.com/trump-golden-dome-spacex-2671791023/",
    "timestamp": "2025-04-17T13:03:14Z"
  },
  {
    "title": "Can Trump Fire Powell? Find Out What the President Has Said",
    "description": "In a Truth Social post, the president said Powell's 'termination cannot come fast enough.'",
    "link": "https://hollywoodlife.com/feature/can-trump-fire-powell-5381146/",
    "timestamp": "2025-04-17T13:02:13Z"
  },
  {
    "title": "Cities are missing topic in the 2025 federal election campaign",
    "description": "There’s nothing even the least bit surprising about the fact that cities, or urban affairs more generally, have had so little play in the federal election. Yes, all three major parties talk about housing and housing affordability. Both the Conservative and th…",
    "link": "https://spacing.ca/toronto/2025/04/17/cities-are-missing-topic-in-the-2025-federal-election-campaign/",
    "timestamp": "2025-04-17T13:00:58Z"
  },
  {
    "title": "Trump says Federal Reserve Chair Powell’s ‘termination cannot come fast enough’",
    "description": "Trump slammed the Federal Reserve's Powell, reiterating his frustration the Fed has not aggressively cut interest rates",
    "link": "https://www.bostonherald.com/2025/04/17/trump-criticism-federal-reserve-powell/",
    "timestamp": "2025-04-17T13:00:37Z"
  },
  {
    "title": "California Gov. Gavin Newsom Makes Desperate Bid for Relevancy and Money",
    "description": "Newsom is suing Trump over tariffs, asking for massive loans to cover the healthcare costs for illegal aliens, and trying to woo Canadians to tour the state.\nThe post California Gov. Gavin Newsom Makes Desperate Bid for Relevancy and Money first appeared on L…",
    "link": "https://legalinsurrection.com/2025/04/california-gov-gavin-newsom-makes-desperate-bid-for-relevancy-and-money/",
    "timestamp": "2025-04-17T13:00:16Z"
  },
  {
    "title": "US health chief Kennedy targets 'environmental toxins' as cause of autism",
    "description": "Robert F. Kennedy contradicted both developing and established science on autism in his first press conference since becoming Secretary of Health and Human Services.",
    "link": "https://www.jpost.com/health-and-wellness/article-850462",
    "timestamp": "2025-04-17T13:00:10Z"
  },
  {
    "title": "Port Of L.A. To Get First Electric Tug Via Diesel Conversion",
    "description": "The Port of Los Angeles will soon have its first electric tug as electric boat company Arc Boat makes its first foray into commercial marine.",
    "link": "https://www.forbes.com/sites/edgarsten/2025/04/17/port-of-la-to-get-first-electric-tug-via-diesel-conversion/",
    "timestamp": "2025-04-17T13:00:00Z"
  },
  {
    "title": "‘American Psycho’ At 25: Is This Portrait of ‘80s Era Wall Street Excess Weirdly Aspirational or a Total Horrorshow?",
    "description": "American Psycho understands that it’s too much to hope that these people will be caught or stopped.",
    "link": "https://decider.com/2025/04/17/american-psycho-at-25-is-this-portrait-of-80s-era-wall-street-excess-weirdly-aspirational-or-a-total-horrorshow/",
    "timestamp": "2025-04-17T13:00:00Z"
  },
  {
    "title": "Mississippi officials refused to air 'Sesame Street' in 1970 because of multiracial cast",
    "description": "\"Sesame Street,\" which premiered in November 1969, faced a rough road to air in the state of Mississippi. This is that story.",
    "link": "https://www.snopes.com//articles/469729/mississippi-sesame-street-multiracial-cast/",
    "timestamp": "2025-04-17T13:00:00Z"
  },
  {
    "title": "Russian barriers to re-entry stymie prospects of Western companies' return",
    "description": "By Elena Fabrichnaya, Alexander Marrow and Gleb Stolyarov\nMOSCOW (Reuters) - Three months after U.S. President Donald Trump returned to the White House promising a swift end to the conflict in Ukraine and sparking an early flurry of excitement that Western co…",
    "link": "https://biztoc.com/x/d9e0d797d1594032",
    "timestamp": "2025-04-17T12:59:15Z"
  },
  {
    "title": "With Recession Chances Higher After Trump's Tariffs, Here Are 2 Dividend Stocks I'm Loading Up On",
    "description": "In This Article:\n\"Tariff\" has probably been the most used word in the business and investing world since U.S. President Donald Trump announced his new tariff plan on April 2.\nThe newly announced tariffs caused the stock market to plummet in the following days…",
    "link": "https://biztoc.com/x/fdae6d8b598c6bd0",
    "timestamp": "2025-04-17T12:59:10Z"
  },
  {
    "title": "Commentary: Trump fired a tariff torpedo at China — and hit Boeing right between the eyes",
    "description": "Trump fired a tariff torpedo at China — and hit Boeing right between the eyes\nWe keep hearing about all the goods that will become more expensive for Americans thanks to Donald Trump’s tariff policy, such as it is: clothing, shoes, cars, food, especially anyt…",
    "link": "https://biztoc.com/x/2f1b8417f1433062",
    "timestamp": "2025-04-17T12:58:23Z"
  },
  {
    "title": "Europe seeking ‘direct line’ with Trump – NYT",
    "description": "European officials believe that even the US president’s closest aides lack decision-making power, the report says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615891-europe-direct-line-trump/",
    "timestamp": "2025-04-17T12:57:53Z"
  },
  {
    "title": "Sanity Returns To The Appliance Aisle",
    "description": "Acting to please a constituency that prefers scarcity over abundance, Joe Biden ordered up a list of federal rules that restricted consumer choice. Given the exhaustive White House agenda that began when Donald Trump took office on Jan. 20, it would have been…",
    "link": "https://freerepublic.com/focus/f-news/4311536/posts",
    "timestamp": "2025-04-17T12:57:50Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.ketv.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:55:53Z"
  },
  {
    "title": "Europeans and Ukrainians make their case as Rubio and Witkoff visit Paris",
    "description": "High level diplomacy reflects Europe’s mounting concern over the US administration’s overtures towards Moscow",
    "link": "https://www.irishtimes.com/world/europe/2025/04/17/europeans-and-ukrainians-make-their-case-as-rubio-and-witkoff-visit-paris/",
    "timestamp": "2025-04-17T12:55:37Z"
  },
  {
    "title": "Y'all Hear What Seth Rogen Said Right To Bezos's And Zuck's Little Fascist Trump-Sucking Faces?",
    "description": "We think you should hear what Seth Rogen said right to Bezos's and Zuck's little fascist Trump-sucking faces.",
    "link": "https://www.wonkette.com/p/yall-hear-what-seth-rogen-said-right",
    "timestamp": "2025-04-17T12:55:22Z"
  },
  {
    "title": "Ex-OneRepublic bassist Tim Myers to challenge veteran Republican congressman",
    "description": "“Ken Calvert has been in Washington for 30 years,” Myers says in a video announcing his campaign. The “status quo isn’t working.”",
    "link": "https://nypost.com/2025/04/17/entertainment/ex-onerepublic-bassist-tim-myers-to-challenge-veteran-republican-congressman/",
    "timestamp": "2025-04-17T12:55:19Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.wtae.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:55:11Z"
  },
  {
    "title": "ECB Cuts Interest Rates Again as Trump Tariff Fears Threaten Recovery",
    "description": "The European Central Bank lowered interest rates for the seventh time since last June as global trade tensions threaten to derail the region’s economic recovery.",
    "link": "https://financialpost.com/pmn/business-pmn/ecb-cuts-interest-rates-again-as-trump-tariff-fears-threaten-recovery",
    "timestamp": "2025-04-17T12:54:37Z"
  },
  {
    "title": "U.S., European officials meet in Paris to discuss Ukraine war",
    "description": "A Ukrainian delegation arrived in Paris on Thursday, a development not previously announced, ahead of what Washington had described as planned talks between top U.S. officials and French counterparts toward brokering an end to the Russia-Ukraine war.",
    "link": "https://www.cbc.ca/news/world/paris-talks-ukraine-war-1.7512680",
    "timestamp": "2025-04-17T12:54:29Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.wcvb.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:54:06Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.kcra.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:54:03Z"
  },
  {
    "title": "European Central Bank cuts interest rates for the seventh time",
    "description": "The European Central Bank cut interest rates Thursday for the seventh time to counter worries about economic growth fueled by President Donald Trump’s tariff onslaught",
    "link": "https://abcnews.go.com/Business/wireStory/european-central-bank-cuts-interest-rates-seventh-time-120900937",
    "timestamp": "2025-04-17T12:52:49Z"
  },
  {
    "title": "Ukrainian drone downed 300m from Europe’s largest nuclear power plant",
    "description": "Kiev “intentionally” staged the attack amid the looming expiry of a US-mediated moratorium on strikes, the facility’s spokeswoman has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615882-zaporozhye-plant-ukrainian-attack/",
    "timestamp": "2025-04-17T12:52:20Z"
  },
  {
    "title": "Map Shows Where US Army to Take Control of Mexico Border",
    "description": "The U.S. Army will take control of almost 110,000 acres of federal land along the U.S.-Mexico border to support Border Patrol operations.",
    "link": "https://www.newsweek.com/map-us-army-control-110000-acres-mexico-border-federal-land-department-interior-trump-2060976",
    "timestamp": "2025-04-17T12:51:59Z"
  },
  {
    "title": "Hundreds of Israeli academics condemn Trump for exploiting antisemitism to target universities",
    "description": "Citing arrests, deportation threats, and funding cuts, the letter denounces the White House's politicized fight against antisemitism: 'We condemn using Jewish students' safety to silence or punish pro-Palestinian voices in U.S. academia'",
    "link": "https://www.haaretz.com/israel-news/2025-04-17/ty-article/.premium/over-200-israeli-academics-accuse-trump-of-exploiting-antisemitism-to-target-universities/00000196-4384-ddef-a5df-dfffc8960000",
    "timestamp": "2025-04-17T12:51:04Z"
  },
  {
    "title": "Binance is advising nations on Bitcoin reserves as global interest grows",
    "description": "Binance is reportedly guiding several governments on establishing strategic Bitcoin reserves and developing clear crypto regulations. In an April 17 interview on Financial Times, Binance CEO Richard Teng disclosed that multiple countries have approached the e…",
    "link": "https://cryptoslate.com/binance-is-advising-nations-on-bitcoin-reserves-as-global-interest-grows/",
    "timestamp": "2025-04-17T12:48:33Z"
  },
  {
    "title": "Stock Futures Trim Gains as Trump Rebukes Powell: Markets Wrap",
    "description": "In This Article:\n(Bloomberg) -- US stock futures trimmed an advance after President Donald Trump berated Federal Reserve Chair Jerome Powell for being slow to cut interest rates.\nMost Read from Bloomberg\nS&P 500 contracts were 0.5% higher, well off their high…",
    "link": "https://biztoc.com/x/276226f3ec673de3",
    "timestamp": "2025-04-17T12:47:57Z"
  },
  {
    "title": "US weekly jobless claims fall as labor market remains stable",
    "description": "New applications for unemployment benefits in the U.S. decreased last week, indicating stable labor market conditions in April. However, businesses are hesitant to increase hiring due to uncertainty surrounding tariffs imposed by President Trump, which have s…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-weekly-jobless-claims-fall-as-labor-market-remains-stable/articleshow/120382406.cms",
    "timestamp": "2025-04-17T12:46:57Z"
  },
  {
    "title": "Karoline Leavitt’s 'Made in China' dress sets off international backlash as Beijing uses moment to publicly embarrass Donald Trump, Chinese envoy trolls her",
    "description": "White House Press Secretary Karoline Leavitt's red dress has ignited a social media firestorm. Chinese officials and users allege the dress was made in China, calling it hypocritical given the U.S.'s trade war stance. A Chinese diplomat shared claims of the d…",
    "link": "https://economictimes.indiatimes.com/news/international/us/karoline-leavitts-made-in-china-dress-sets-off-international-backlash-as-beijing-uses-moment-to-publicly-embarrass-donald-trump-chinese-envoy-trolls-her/articleshow/120382390.cms",
    "timestamp": "2025-04-17T12:46:30Z"
  },
  {
    "title": "Russia says certain countries trying to 'derail' its talks with US",
    "description": "Russia's top economic negotiator said Thursday that certain countries were trying to \"derail\" Moscow's talks with the United States, as the two sides work towards normalising ties. \"There are a lot of people, structures, countries trying to derail our dialogu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-says-certain-countries-trying-to-derail-its-talks-with-us/articleshow/120382394.cms",
    "timestamp": "2025-04-17T12:46:07Z"
  },
  {
    "title": "Trump says Federal Reserve Chair Powell’s 'termination cannot come fast enough'",
    "description": "President Donald Trump has slammed Federal Reserve Chair Jerome Powell, reiterating his frustration the Fed has not aggressively cut interest rates and saying the central bank leader’s “termination cannot come fast enough.”.",
    "link": "https://www.clickondetroit.com/business/2025/04/17/trump-says-federal-reserve-chair-powells-termination-cannot-come-fast-enough/",
    "timestamp": "2025-04-17T12:45:29Z"
  },
  {
    "title": "Thursday, April 17, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/thursday-april-17-2025/",
    "timestamp": "2025-04-17T12:45:15Z"
  },
  {
    "title": "El Salvador’s President Plans to Double Size of Megaprison Holding Trump Deportees: Report",
    "description": "El Salvador’s President Nayib Bukele is reportedly planning to double the size of the world’s largest prison to house more alleged deportees sent by President Donald Trump. The expansion underscores the emerging partnership between Trump administration and Bu…",
    "link": "https://www.mediaite.com/news/el-salvadors-president-plans-to-double-size-of-megaprison-holding-trump-deportees-report/",
    "timestamp": "2025-04-17T12:43:48Z"
  },
  {
    "title": "Trump to meet Italy's prime minister amid tariff tensions",
    "description": "President Donald Trump will meet with Italian Prime Minister Georgia Meloni at the White House Thursday to discuss new tariffs on the European Union.",
    "link": "https://www.wesh.com/article/trump-to-meet-italy-prime-minister-amid-tariff-tensions/64509976",
    "timestamp": "2025-04-17T12:43:00Z"
  },
  {
    "title": "Appliance efficiency standards save consumers billions, reduce pollution and fight climate change",
    "description": "About 40% of total US energy consumption is used by household and industrial appliances, such as heating and cooling systems, refrigerators and lighting.",
    "link": "https://theconversation.com/appliance-efficiency-standards-save-consumers-billions-reduce-pollution-and-fight-climate-change-253673",
    "timestamp": "2025-04-17T12:41:15Z"
  },
  {
    "title": "Group that helped reverse Roe sets sights on birth control",
    "description": "Nearly three years after U.S. Supreme Court Justice Clarence Thomas\r\n' 2022 concurring opinion for the reversal\r\n of Roe v. Wade elevated\r\n fears of Americans losing the right to contraception, a far-right legal group is working to limit access to birth contr…",
    "link": "https://www.rawstory.com/group-that-helped-reverse-roe-sets-sights-on-birth-control/",
    "timestamp": "2025-04-17T12:40:24Z"
  },
  {
    "title": "Trump's tariff storm a threat to dollar's dominance?",
    "description": "President Trump's tariffs are casting shadows on the US dollar's reign as the world's primary currency, prompting questions about its long-term dominance. While the dollar remains a preferred safe haven, its share of global reserves has declined amid rising c…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trumps-tariff-storm-a-threat-to-dollars-dominance/articleshow/120382225.cms",
    "timestamp": "2025-04-17T12:38:29Z"
  },
  {
    "title": "Myanmar's military leader is in Thailand for talks on earthquake relief",
    "description": "Malaysian Prime Minister Anwar Ibrahim and the leader of Myanmar’s military government, Senior Gen. Min Aung Hlaing, have visited the Thai capital for diplomatic talks widely assumed to focus on efforts to restore peace in war-torn Myanmar",
    "link": "https://abcnews.go.com/International/wireStory/myanmars-military-leader-thailand-talks-earthquake-relief-120901604",
    "timestamp": "2025-04-17T12:38:21Z"
  },
  {
    "title": "Dow Jones Dives 600 Points On UnitedHealth Crash; Trump Calls For Powell's Exit",
    "description": "Futures on the Dow Jones Industrial Average and other major stock indexes traded sharply mixed in premarket action Thursday as President Donald Trump called for Federal Reserve Chairman Jerome Powell's termination. Up ahead, weekly unemployment claims are due…",
    "link": "https://biztoc.com/x/518c8d172ed0519f",
    "timestamp": "2025-04-17T12:37:25Z"
  },
  {
    "title": "ECB cuts rates for third time this year as Europe braces for Trump tariffs",
    "description": "The cost of borrowing fell across the 20-member euro area for the third time this year on Thursday when the European Central Bank cut its main interest rate to 2.25% in response to slowing growth and Donald Trump’s tariffs.\nThe Frankfurt-based bank cut its be…",
    "link": "https://biztoc.com/x/412d1baf4e1aea0c",
    "timestamp": "2025-04-17T12:37:11Z"
  },
  {
    "title": "Trump says ‘termination’ of Fed’s Powell can’t ‘come fast enough’",
    "description": "A peeved President Donald Trump posted today Fed Chairman Jerome Powell’s “termination” can’t come “fast enough” after the European Central Bank cut interest rates.\nThe Wall Street Journal reported Powell could even be dismissed by Trump.\n“Powell’s terminatio…",
    "link": "https://biztoc.com/x/2aa0353899f2da95",
    "timestamp": "2025-04-17T12:36:32Z"
  },
  {
    "title": "Trump's Tariff Storm A Threat To Dollar's Dominance?",
    "description": "As President Donald Trump's tariffs threaten the US economy, questions are being asked about how long the dollar can maintain its status as the world's key trading and reserve currency.",
    "link": "https://www.ibtimes.com.au/trumps-tariff-storm-threat-dollars-dominance-1857981",
    "timestamp": "2025-04-17T12:36:15Z"
  },
  {
    "title": "Trump's Tariff Storm A Threat To Dollar's Dominance?",
    "description": "As President Donald Trump's tariffs threaten the US economy, questions are being asked about how long the dollar can maintain its status as the world's key trading and reserve currency.",
    "link": "https://www.ibtimes.com/trumps-tariff-storm-threat-dollars-dominance-3770470",
    "timestamp": "2025-04-17T12:36:10Z"
  },
  {
    "title": "UK-US trade deal: can Keir Starmer trust Donald Trump?",
    "description": "There is a \"good chance\" that the UK and the US could reach a \"great\" trade agreement, said US Vice President J.D. Vance in an interview with UnHerd. Donald Trump \"really loves the United Kingdom\".\nOf course, the UK has heard this story before but there might…",
    "link": "https://biztoc.com/x/8ee8826112899ef0",
    "timestamp": "2025-04-17T12:36:10Z"
  },
  {
    "title": "Unusual Machines, Dominari Holdings Share Volume Spiked Ahead Of Trump Family Appointments: Here's What Happened",
    "description": "Shares of Unusual Machines Inc. (NYSE:UMAC) and Dominari Holdings Inc. (NASDAQ:DOMH) surged ahead of the appointments of President Donald Trump‘s sons, Donald Trump Jr. and Eric Trump, to their advisory boards.\nWhat Happened: The drone maker, Unusual Machines…",
    "link": "https://biztoc.com/x/2ea8c73ad832761a",
    "timestamp": "2025-04-17T12:36:07Z"
  },
  {
    "title": "Trump says ‘termination’ of Fed’s Powell can’t ‘come fast enough’",
    "description": "A peeved President Donald Trump posted today Fed Chairman Jerome Powell's \"termination\" can't come \"fast enough\" after the European Central Bank cut interest rates.",
    "link": "https://www.bostonherald.com/2025/04/17/trump-says-termination-of-feds-powell-cant-come-fast-enough/",
    "timestamp": "2025-04-17T12:35:40Z"
  },
  {
    "title": "Trump’s Insistence on Real ID Has Become a Flashpoint for His Tinfoil Hat Fans",
    "description": "Alex Jones is twisting himself into knots to explain why his buddy Trump would support Real ID.",
    "link": "https://gizmodo.com/trumps-insistence-on-real-id-has-become-a-flashpoint-for-his-tinfoil-hat-fans-2000589821",
    "timestamp": "2025-04-17T12:35:35Z"
  },
  {
    "title": "FNC's Hannity Takes on Taylor Lorenz: You Are 'Putting a Smiley Face on Assassination'",
    "description": "Wednesday, during FNC's \"Hannity,\" host Sean Hannity confronted left-wing journalist Taylor Lorenz over her depictions of Luigi Mangione, the alleged killer of UnitedHealthcare CEO Brian Thompson.\nThe post FNC’s Hannity Takes on Taylor Lorenz: You Are ‘Puttin…",
    "link": "https://www.breitbart.com/clips/2025/04/17/fncs-hannity-takes-on-taylor-lorenz-you-are-putting-a-smiley-face-on-assassination/",
    "timestamp": "2025-04-17T12:35:10Z"
  },
  {
    "title": "The National Security Implications of Starlink’s Entry Into India",
    "description": "India’s uncritical and pernicious reliance on U.S. tech companies may serve to undermine its own national and technological visions.",
    "link": "https://thediplomat.com/2025/04/the-national-security-implications-of-starlinks-entry-into-india/",
    "timestamp": "2025-04-17T12:35:00Z"
  },
  {
    "title": "Takeaways for Quebec from last night's debate",
    "description": "Missed last night's debate? While the Habs were in the midst of securing a playoff spot, the four leaders drew clear lines on issues related to Quebec.",
    "link": "https://www.cbc.ca/news/canada/montreal/quebec-federal-debate-1.7512683",
    "timestamp": "2025-04-17T12:35:00Z"
  },
  {
    "title": "Why is Donald Trump failing to bring peace to Ukraine like he promised?",
    "description": "Negotiations for peace in Ukraine are struggling to get off the ground, despite numerous meetings between US and Russian officials.",
    "link": "https://theconversation.com/why-is-donald-trump-failing-to-bring-peace-to-ukraine-like-he-promised-254546",
    "timestamp": "2025-04-17T12:34:43Z"
  },
  {
    "title": "Finland Responds to Russia Building Military Facilities Along Border",
    "description": "\"They are reorganizing themselves,\" the deputy chief of Finland's armed forces said of Moscow's buildup.",
    "link": "https://www.newsweek.com/finland-russia-military-building-vesa-virtanen-nato-western-military-district-baltic-2060879",
    "timestamp": "2025-04-17T12:34:33Z"
  },
  {
    "title": "Trump says Fed Chair Jerome Powell's 'termination cannot come fast enough'",
    "description": "President Donald Trump on Thursday escalated his pressure campaign on Federal Reserve Chair Jerome Powell, calling him “always too late and wrong” and calling for him to be fired.Read more...",
    "link": "https://qz.com/trump-fed-chair-jerome-powell-tariffs-interest-rates-1851776525",
    "timestamp": "2025-04-17T12:34:00Z"
  },
  {
    "title": "New bruise ‘reappears’ on Donald Trump’s hand after large mark sparked health fears",
    "description": "The US President's right hand had sparked health concerns earlier this year",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-health-hand-bruise-reappears-575322-20250417",
    "timestamp": "2025-04-17T12:31:57Z"
  },
  {
    "title": "UK-US trade deal: can Keir Starmer trust Donald Trump?",
    "description": "White House insiders say an agreement is 'two weeks' away but can Britain believe it?",
    "link": "https://theweek.com/politics/uk-us-trade-deal-can-keir-starmer-trust-donald-trump",
    "timestamp": "2025-04-17T12:31:46Z"
  },
  {
    "title": "Nvidia CEO in Beijing as US tech curbs, trade war threaten sales",
    "description": "Nvidia CEO Jensen Huang arrived in Beijing on Thursday, state media said, days after the United States curbed sales of its H20 artificial intelligence chips to China. In Beijing on Thursday, Huang met with Ren Hongbin, head of the China Council for the Promot…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/nvidia-ceo-in-beijing-as-us-tech-curbs-trade-war-threaten-sales/articleshow/120381984.cms",
    "timestamp": "2025-04-17T12:31:17Z"
  },
  {
    "title": "India to navigate global disruptions with policy agility and investments, says Nirmala Sitharaman as trade war escalates",
    "description": "Finance Minister Nirmala Sitharaman acknowledged the potential disruption of global supply chains due to rising protectionist policies. She affirmed India's commitment to navigating these challenges through policy agility and long-term investments, emphasizin…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-to-navigate-global-disruptions-with-policy-agility-and-investments-says-nirmala-sitharaman-as-trade-war-escalates/articleshow/120381967.cms",
    "timestamp": "2025-04-17T12:30:52Z"
  },
  {
    "title": "Italy’s Meloni Bound for White House and Tariff Talks with Trump",
    "description": "Italy’s Prime Minister Giorgia Meloni is due in Washington on Thursday to meet with President Donald Trump. She is expected to make a personal appeal for less punitive tariffs on European Union (E.U.) trade with the world’s biggest economy. Meloni is the firs…",
    "link": "https://freerepublic.com/focus/f-news/4311530/posts",
    "timestamp": "2025-04-17T12:30:28Z"
  }
]