[
  {
    "title": "Trump Says He's Inclined to Exclude XOM From Venezuela",
    "description": "President Donald Trump signaled he's leaning toward excluding Exxon Mobil Corp. from his push for U.S. oil majors to rebuild Venezuela's petroleum industry.",
    "link": "https://www.rigzone.com/news/wire/trump_says_hes_inclined_to_exclude_xom_from_venezuela-12-jan-2026-182741-article/",
    "timestamp": "2026-01-12T14:46:51Z"
  },
  {
    "title": "What is Autistic Barbie? Mattel’s new doll sparks conversation on Autism",
    "description": "Mattel has launched its first autistic Barbie doll. This new doll features sensory-friendly accessories and design elements. It aims to represent neurodivergent experiences better. The company states this is part of its commitment to inclusion. The doll joins…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-autistic-barbie-mattels-new-doll-sparks-conversation-on-autism/articleshow/126486486.cms",
    "timestamp": "2026-01-12T14:45:04Z"
  },
  {
    "title": "Smithsonian Drops Text About Trump’s Impeachments, Legendary Painter Beatriz González Dies at 93: Morning Links for January 12, 2025",
    "description": "Here's what we're reading this morning, folks.",
    "link": "https://www.artnews.com/art-news/news/smithsonian-drops-text-about-trumps-impeachments-legendary-painter-beatriz-gonzalez-dies-at-93-morning-links-for-january-12-2025-1234769447/",
    "timestamp": "2026-01-12T14:44:42Z"
  },
  {
    "title": "Meta Sets Former Trump Advisor Dina Powell McCormick as President and Vice Chairman",
    "description": "\"She is a fantastic, and very talented, person, who served the Trump Administration with strength and distinction,\" President Trump celebrates\nThe post Meta Sets Former Trump Advisor Dina Powell McCormick as President and Vice Chairman appeared first on TheWr…",
    "link": "https://www.thewrap.com/industry-news/business/meta-president-vice-chair-former-trump-advisor-dina-powell-mccormick/",
    "timestamp": "2026-01-12T14:43:49Z"
  },
  {
    "title": "Republican Strikes Bombshell Blow Against Trump’s Petty Revenge Plot",
    "description": "Republican North Carolina Sen. Thom Tillis has said he will oppose any of President Donald Trump’s future nominees to the Federal Reserve Board of Governors ...",
    "link": "https://www.thedailybeast.com/republican-thom-tillis-strikes-bombshell-blow-against-trumps-petty-revenge-plot/",
    "timestamp": "2026-01-12T14:43:35Z"
  },
  {
    "title": "Former Trump adviser Dina Powell McCormick joins Meta as president and vice chairman",
    "description": "Dina Powell McCormick, who has worked with both US President Donald Trump and former President George W Bush, is expected to join Meta’s management team, where she will work closely with its compute and infrastructure teams to oversee large-scale, multi-billi…",
    "link": "https://economictimes.indiatimes.com/tech/technology/meta-appoints-former-trump-adviser-dina-powell-as-president-and-vice-chair/articleshow/126486952.cms",
    "timestamp": "2026-01-12T14:43:05Z"
  },
  {
    "title": "Meta names Trump's former advisor Dina Powell McCormick as new President and Vice Chairman — What you need to know",
    "description": "Meta names Trump's former advisor Dina Powell McCormick as new President and Vice Chairman — What you need to know",
    "link": "https://www.livemint.com/companies/news/meta-names-trumps-former-advisor-dina-powell-mccormick-as-new-president-and-vice-chairman-what-you-need-to-know-11768228124348.html",
    "timestamp": "2026-01-12T14:42:28Z"
  },
  {
    "title": "Sen. Thom Tillis Vows To Block All Fed Nominees After DOJ Probe Into Jerome Powell",
    "description": "'is now the independence and credibility of the Department of Justice that are in question'",
    "link": "https://dailycaller.com/2026/01/12/thom-tillis-trump-federal-reserve-nominees-jerome-powell/",
    "timestamp": "2026-01-12T14:41:00Z"
  },
  {
    "title": "Cuba's president says no current talks with the US after Trump threatens it",
    "description": "Cuban President Miguel Díaz-Canel says his administration is currently not in talks with the U.S. government",
    "link": "https://abcnews.go.com/International/wireStory/cubas-president-current-talks-us-after-trump-threatens-129130365",
    "timestamp": "2026-01-12T14:40:18Z"
  },
  {
    "title": "Trump Wisely Chooses Limited Goals Over Maria Corina Machado’s Ambitions",
    "description": "In the immediate aftermath of the U.S. operation that led to Nicolás Maduro’s capture, much of Washington made a familiar assumption: that Donald Trump would now formally embrace the Venezuelan opposition and usher in a U.S.-backed political transition. Withi…",
    "link": "https://freerepublic.com/focus/f-news/4361693/posts",
    "timestamp": "2026-01-12T14:40:14Z"
  },
  {
    "title": "Who’s Really Running Venezuela?",
    "description": "As the Senate voted to advance a War Powers Resolution on Venezuela on January 8th, Republican Senator Susan Collins declared that she did not agree with “a sustained engagement “running” Venezuela.”\nThe world was mystified when President Trump first said …\nT…",
    "link": "https://www.globalresearch.ca/who-really-running-venezuela/5911836",
    "timestamp": "2026-01-12T14:38:15Z"
  },
  {
    "title": "Mexico’s Sheinbaum says had 'good conversation' with Trump on security, drugs",
    "description": "MEXICO CITY, Jan 12 (Reuters) - Mexican President Claudia Sheinbaum said on Monday she had a “good conversation” with U.S. President Donald Trump on security...",
    "link": "https://www.yahoo.com/news/articles/mexico-sheinbaum-says-had-good-142558951.html",
    "timestamp": "2026-01-12T14:37:51Z"
  },
  {
    "title": "'What a stupid question': Trump demeans reporter in latest insult aimed at females",
    "description": "President Donald Trump fired off yet another attack on a female reporter Sunday night, attacking her question about his plans in Iraq as a 'stupid question.\"Speaking aboard Air Force One on Sunday, Trump demeaned the CNN reporter for asking about Iran's respo…",
    "link": "https://www.rawstory.com/quiet-piggy/",
    "timestamp": "2026-01-12T14:37:25Z"
  },
  {
    "title": "ICE Shooting Video, White House Spin, and the World We’re In",
    "description": "The Media Front newsletter aims to cut through the outrage and misleading narratives, and interrogate how power, politics and technology converge to shape the media today\nThe post ICE Shooting Video, White House Spin, and the World We’re In appeared first on …",
    "link": "https://www.thewrap.com/media-platforms/journalism/ice-shooting-video-media-front-newsletter/",
    "timestamp": "2026-01-12T14:37:17Z"
  },
  {
    "title": "Mexico’s Sheinbaum says had 'good conversation' with Trump on security, drugs",
    "description": "MEXICO CITY, ‌Jan 12 (Reuters) - Mexican President ‌Claudia Sheinbaum said on ‌Monday she had a \"good conversation\" with U.S. President Donald Trump ‍on security and ‍efforts to reduce ‌drug trafficking. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/12/mexicos-sheinbaum-says-had-039good-conversation039-with-trump-on-security-drugs",
    "timestamp": "2026-01-12T14:37:00Z"
  },
  {
    "title": "Should The Government Be Able To Shoot People In The Face For Doing Free Speech?",
    "description": "America is undecided!",
    "link": "https://www.wonkette.com/p/should-the-government-be-able-to",
    "timestamp": "2026-01-12T14:35:55Z"
  },
  {
    "title": "What are Donald Trump’s options in Iran?",
    "description": "Military strikes? Regime overthrow? Cyberattacks? Sanctions? How can the US help Iranian protesters?",
    "link": "https://theweek.com/politics/options-donald-trump-iran",
    "timestamp": "2026-01-12T14:35:27Z"
  },
  {
    "title": "Stocks fall after Trump's DOJ opens criminal probe into Fed Chair Powell",
    "description": "Powell rebuked the probe as an effort to undermine the Fed's independence.",
    "link": "https://abcnews.go.com/Business/stocks-fall-after-trumps-doj-opens-criminal-probe/story?id=129127081",
    "timestamp": "2026-01-12T14:34:55Z"
  },
  {
    "title": "Trump’s Desperate Attempt to Bully the Fed",
    "description": "A criminal investigation of Federal Reserve Chair Jerome Powell will test whether Republican loyalty to the president has any limits.",
    "link": "https://www.theatlantic.com/ideas/2026/01/trump-desperate-powell-investigation/685583/",
    "timestamp": "2026-01-12T14:34:54Z"
  },
  {
    "title": "Ilhan Omar Barely Brings Herself To Tepidly Condemn Violence Against ICE Agents",
    "description": "'I’m at a loss of words'",
    "link": "https://dailycaller.com/2026/01/12/ilhan-omar-barely-brings-herself-to-tepidly-condemn-violence-against-ice-agents/",
    "timestamp": "2026-01-12T14:34:49Z"
  },
  {
    "title": "Forensic expert shares ‘significant’ detail in Renee Good’s hands before she was fatally shot by ICE officer",
    "description": "There's a bit of information many of us may have missed",
    "link": "https://www.ladbible.com/news/us-news/renee-nicole-good-hands-detail-shooting-ice-officer-495695-20260112",
    "timestamp": "2026-01-12T14:30:15Z"
  },
  {
    "title": "Who is Reza Pahlavi? Exiled prince has long pushed for end to Iran's theocratic rule",
    "description": "Reza Pahlavi has sought to speak as an Iranian leader despite living outside the country since protests against the clerical regime erupted late last month. Here is a closer look at the 65-year-old exiled son of royalty, whose support within Iran is open to q…",
    "link": "https://www.cbc.ca/news/world/iran-pahlavi-profile-9.7041837",
    "timestamp": "2026-01-12T14:29:20Z"
  },
  {
    "title": "Venezuela says 116 prisoners released as rights group cites lower figure",
    "description": "Release of ⁠political prisoners ⁠is a long-running demand of human rights groups, international bodies and opposition figures",
    "link": "https://www.irishtimes.com/world/americas/2026/01/12/venezuela-says-116-prisoners-released-as-rights-group-cites-lower-figure/",
    "timestamp": "2026-01-12T14:26:31Z"
  },
  {
    "title": "Germany's Klingbeil, on Powell probe, says central bank independence is 'clear line'",
    "description": "WASHINGTON, ‌Jan 12 (Reuters) - German Finance Minister Lars Klingbeil on ‌Monday said that central bank independence was a \"clear ‌line\" for him, when asked about the U.S. Justice Department's probe into Federal Reserve Chair Jerome Powell.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/12/germany039s-klingbeil-on-powell-probe-says-central-bank-independence-is-039clear-line039",
    "timestamp": "2026-01-12T14:25:00Z"
  },
  {
    "title": "Finland, Sweden propose new, tougher economic sanctions on Russia",
    "description": "The countries have also proposed new export restrictions to Russia, for example on luxury items.",
    "link": "https://yle.fi/a/74-20203817",
    "timestamp": "2026-01-12T14:24:17Z"
  },
  {
    "title": "Germany seeks to boost defence industry ties with India",
    "description": "India and Germany are looking to boost defence industry cooperation, Prime Minister Narendra Modi said Monday after hosting Chancellor Friedrich Merz in his home state of Gujarat.",
    "link": "https://www.thelocal.de/20260112/germany-seeks-to-boost-defence-industry-ties-with-india",
    "timestamp": "2026-01-12T14:21:03Z"
  },
  {
    "title": "Federal Reserve Chair Jerome Powell Under Criminal Investigation",
    "description": "Federal Reserve Chair Jerome Powell blamed President Donald Trump for a criminal investigation centered around him.",
    "link": "https://www.westernjournal.com/federal-reserve-chair-jerome-powell-criminal-investigation/",
    "timestamp": "2026-01-12T14:20:02Z"
  },
  {
    "title": "Cuba's Diaz-Canel says there are no current talks with US government",
    "description": "HAVANA, Jan ‌12 (Reuters) - Cuban President Miguel Diaz-Canel ‌said on Monday there are no ‌talks with the United States government in an apparent response to comments the day before ‍by U.S. President Donald ‍Trump suggesting the ‌two longtime rivals were in…",
    "link": "https://www.thestar.com.my/news/world/2026/01/12/cuba039s-diaz-canel-says-there-are-no-current-talks-with-us-government",
    "timestamp": "2026-01-12T14:19:00Z"
  },
  {
    "title": "EU-Mercosur mega trade deal: 25 years in the making",
    "description": "Despite opposition from France and Ireland among others, the ‘significant’ agreement with the South American bloc is set to finally go ahead",
    "link": "https://theweek.com/politics/eu-mercosur-mega-trade-deal-25-years-in-the-making",
    "timestamp": "2026-01-12T14:18:07Z"
  },
  {
    "title": "Trump Says: “I Do Not Need International Law” to Advance American Interests. “I’m Not Looking to Hurt People.”",
    "description": "The opinions expressed by Donald Trump in an interview with The New York Times on international law, NATO, and Greenland reflect a wider American perspective. Most Americans, regardless of their political beliefs, share similar views on these issues but are ……",
    "link": "https://www.globalresearch.ca/trump-says-international-law-not-needed-advance-american-interests/5911884",
    "timestamp": "2026-01-12T14:17:31Z"
  },
  {
    "title": "George Floyd and Renee Good: 5 years between Minneapolis videos, and confusion has increased",
    "description": "George Floyd and Renee Good: 5 years between Minneapolis videos, and confusion has increasedlocal10.com",
    "link": "https://www.local10.com//tech/2026/01/12/george-floyd-and-renee-good-5-years-between-minneapolis-videos-and-confusion-has-increased/",
    "timestamp": "2026-01-12T14:17:26Z"
  },
  {
    "title": "The Revenge of Global Imbalances",
    "description": "Under France’s presidency of the G7, the club of rich countries will focus on major economies’ external deficits and surpluses. While the agenda makes sense politically, the economic case remains to be made.",
    "link": "https://www.project-syndicate.org/commentary/the-revenge-of-global-imbalances-by-barry-eichengreen-2026-01",
    "timestamp": "2026-01-12T14:16:16Z"
  },
  {
    "title": "Smithsonian Strips Mention of Trump’s Impeachments in New Portrait Display",
    "description": "The Smithsonian’s National Portrait Gallery removed text referring to President Donald Trump’s impeachments when it replaced his portrait in an exhibition of U.S. presidents last week. The previous portrait of Trump shown in the gallery’s “America’s President…",
    "link": "https://www.mediaite.com/media/news/smithsonian-strips-mention-of-trumps-impeachments-in-new-portrait-display/",
    "timestamp": "2026-01-12T14:15:27Z"
  },
  {
    "title": "'Frantic' first days as Atlantic Canada sells off U.S. booze; wine, bourbon dominate",
    "description": "Liquor corporations in Nova Scotia and Newfoundland and Labrador say they have sold roughly half their inventory of American booze since putting it back on shelves last month to sell off for charity.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/atlantic-us-booze-9.7041884",
    "timestamp": "2026-01-12T14:15:06Z"
  },
  {
    "title": "Mark Zuckerberg's Meta Names Dina Powell McCormick President",
    "description": "The former Goldman Sachs executive and deputy national security adviser is also married to Pennsylvania Senator Dave McCormick.",
    "link": "http://www.hollywoodreporter.com/business/digital/mark-zuckerberg-meta-names-dina-powell-mccormick-president-1236470889/",
    "timestamp": "2026-01-12T14:14:08Z"
  },
  {
    "title": "Could you get a $2,000 stimulus check? Trump proposal would cover only 58% of Americans",
    "description": "Trump has suggested a $2,000 stimulus-style payment funded by tariff money. The check would likely go only to people earning under $100,000, leaving many Americans out. About 58% of households may qualify. The plan still needs approval from Congress, and expe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/could-you-get-a-2000-stimulus-check-trump-proposal-would-cover-only-58-of-americans/articleshow/126485945.cms",
    "timestamp": "2026-01-12T14:11:21Z"
  },
  {
    "title": "Zelensky makes another move to avoid election",
    "description": "The Ukrainian leader has submitted a bill to prolong martial law, effectively postponing elections once again Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630856-zelensky-election-martial-law/",
    "timestamp": "2026-01-12T14:11:10Z"
  },
  {
    "title": "Olympic tensions flare as US skeleton star alleges Canadian coach rigged qualifying event",
    "description": "Sporting tensions between the USA and Canada have erupted once again, this time in skeleton as next month’s Winter Olympics approach. USA’s Katie Uhlaender, a five-time Winter Olympian in skeleton, has accused the Canadian team of depriving her of a place at …",
    "link": "https://sports.yahoo.com/articles/olympic-tensions-flare-us-skeleton-141037448.html",
    "timestamp": "2026-01-12T14:10:37Z"
  },
  {
    "title": "Meta Taps Former Trump Adviser for New Role Driving AI Buildout",
    "description": "Meta Platforms Inc. has appointed a former top adviser to US President Donald Trump to a newly created senior management role focused on partnering with governments and investors on AI.",
    "link": "https://financialpost.com/pmn/business-pmn/meta-taps-former-trump-adviser-for-new-role-driving-ai-buildout",
    "timestamp": "2026-01-12T14:09:00Z"
  },
  {
    "title": "‘Married To Medicine’ Star Dr. Contessa Metcalfe Says Nicki Minaj’s Turn To MAGA Is “Heartbreaking”",
    "description": "\"I feel like she broke our hearts.\"",
    "link": "https://decider.com/2026/01/12/married-medicine-contessa-metcalfe-nicki-minajs-maga-heartbreaking/",
    "timestamp": "2026-01-12T14:08:55Z"
  },
  {
    "title": "“The Empire is Out of the Closet”: Donald Trump in Power, Racketeering and Venezuelan Oil",
    "description": "It usually takes archival digging, the golden gaffe, an ill-considered remark and occasional spells of candour by those in power, to admit that the United States has, in common with other imperial powers, brutal ambitions. An example of the latter …\nThe post …",
    "link": "https://www.globalresearch.ca/imperialism-trump-racketeering-venezuelan-oil/5911834",
    "timestamp": "2026-01-12T14:08:54Z"
  },
  {
    "title": "A Breakable Regime",
    "description": "Plus: Wealth tax barely understood by its proponents, Jerome Powell investigated, why sobriety sucks, and more...",
    "link": "https://reason.com/2026/01/12/a-breakable-regime/",
    "timestamp": "2026-01-12T14:08:14Z"
  },
  {
    "title": "Zelensky ‘had no cards from day one’ – Trump",
    "description": "Ukraine’s Vladimir Zelensky “has no cards” to negotiate peace with Russia, US President Donald Trump has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630849-trump-zelensky-no-cards/",
    "timestamp": "2026-01-12T14:05:09Z"
  },
  {
    "title": "What Does Venezuela Have to Do with Israel?",
    "description": "It is interesting to observe how United States foreign policy, such as it is, often appears to have an Israeli back story.\nThe post What Does Venezuela Have to Do with Israel? appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/what-does-venezuela-have-to-do-with-israel/5911785",
    "timestamp": "2026-01-12T14:05:08Z"
  },
  {
    "title": "Motorcade rerouted due to 'suspicious object'...",
    "description": "President Donald Trump's motorcade took an unusual route to the airport in Florida due to a \"suspicious object. That's according to the White House. The object was found during security sweeps Sunday before Trump's arrival at Palm Beach International Airport.…",
    "link": "https://apnews.com/article/donald-trump-airport-motorcade-98b36c698dfdc52e7eaa4c92613d3e8b",
    "timestamp": "2026-01-12T14:04:36Z"
  },
  {
    "title": "The Trump-based International Order",
    "description": "The rules-based order is dead. Long live the Trump-based order. \nIndeed, the Trump-bases order is THE future. And that is erratic, can change from day to day, as circumstances dictate. If President Trump and his handlers have their way, only …\nThe post The Tr…",
    "link": "https://www.globalresearch.ca/trump-based-international-order/5911870",
    "timestamp": "2026-01-12T14:04:22Z"
  },
  {
    "title": "India and Germany seek to boost defence industry ties",
    "description": "Merz said Berlin also wants a closer security partnership with New Delhi, including deeper \"cooperation between our defence industries\" to cut India's traditional dependence on Russia for military hardware.",
    "link": "https://economictimes.indiatimes.com/news/defence/india-and-germany-seek-to-boost-defence-industry-ties/articleshow/126486318.cms",
    "timestamp": "2026-01-12T14:04:10Z"
  },
  {
    "title": "Jerome Powell Warns 'Pretext' Investigation Is a Power Play That Could Undermine Fed Independence",
    "description": "Federal Reserve chair Jerome Powell says a 'pretext' investigation risks politicising interest rate decisions and weakening Fed independence.",
    "link": "https://www.ibtimes.com/jerome-powell-warns-pretext-investigation-power-play-that-could-undermine-fed-independence-3795064",
    "timestamp": "2026-01-12T14:02:48Z"
  },
  {
    "title": "Gold and Silver Storm to Records as Fed Hit With Subpoenas",
    "description": "The yellow metal spiked above $4,600 an ounce, while silver surpassed $85 after Fed Chair Jerome Powell said the potential indictment comes amid “threats and...",
    "link": "https://finance.yahoo.com/news/gold-flirts-record-high-soft-234030780.html",
    "timestamp": "2026-01-12T14:02:29Z"
  },
  {
    "title": "Trump's fear of midterm election loss could spark 'Civil War'-like response: expert",
    "description": "Fears of a midterm blowout could push President Donald Trump into a \"Civil War\"-like response, a political expert has warned. The president is already pushing ICE agents onto the streets of blue states, which some Democratic Party representatives have denounc…",
    "link": "https://www.rawstory.com/trump-midterms-2674874546/",
    "timestamp": "2026-01-12T14:01:47Z"
  },
  {
    "title": "What we know about the protests sweeping Iran",
    "description": "Crackdown on protests in Iran has resulted in multiple deaths and an internet blackout.",
    "link": "https://www.aljazeera.com/news/2026/1/12/what-we-know-about-the-protests-sweeping-iran",
    "timestamp": "2026-01-12T14:01:39Z"
  },
  {
    "title": "‘Manipulate’: Jerome Powell claims Trump’s DOJ probe of him is retaliation for interest rates",
    "description": "'The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president'",
    "link": "https://www.wnd.com/2026/01/manipulate-jerome-powell-claims-trumps-doj-probe-him/",
    "timestamp": "2026-01-12T14:00:56Z"
  },
  {
    "title": "Mark Ruffalo blasts Trump as ‘worst human being’ and joins Golden Globes attendees in making red carpet statement",
    "description": "Golden Globes attendees including Ruffalo, Ariana Grande, Jean Smart, and Wanda Sykes protested Trump at the 2026 ceremony",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/mark-ruffalo-golden-globes-pin-trump-b2898805.html",
    "timestamp": "2026-01-12T14:00:50Z"
  },
  {
    "title": "Trump administration revokes more than 100,000 visas in first year back",
    "description": "More than 100,000 visas have been revoked under the Trump administration in less than a year, as the State Department steps up enforcement tied to crime, overstays and public safety threats.",
    "link": "https://www.foxnews.com/politics/trump-administration-revokes-more-than-100000-visas-first-year-back",
    "timestamp": "2026-01-12T14:00:17Z"
  },
  {
    "title": "Marco Rubio emerges as key Trump power player after Venezuela operation",
    "description": "Marco Rubio emerges as Trump's most influential foreign policy figure, reportedly holding three key roles in the new administration's leadership structure.",
    "link": "https://www.foxnews.com/politics/marco-rubio-emerges-key-trump-power-player-after-venezuela-operation",
    "timestamp": "2026-01-12T14:00:14Z"
  },
  {
    "title": "DJI and other drone companies get a partial reprieve in the US – but the ban on new models still stands",
    "description": "The Department of Commerce has decided not to make the US's worrying \"DJI ban\" even worse.",
    "link": "https://www.techradar.com/cameras/drones/dji-and-other-drone-companies-get-a-partial-reprieve-in-the-us-but-the-ban-on-new-models-still-stands",
    "timestamp": "2026-01-12T14:00:00Z"
  },
  {
    "title": "How a SANDAG database might be aiding Trump’s deportation campaign",
    "description": "The database, known as ARJIS, is a clearinghouse for records collected by San Diego area police departments. Federal immigration enforcement agencies pay SANDAG for access to ARJIS, which advocates said could be a violation of immigrant sanctuary laws.",
    "link": "https://www.kpbs.org/news/border-immigration/2026/01/12/how-a-sandag-database-might-be-aiding-trumps-deportation-campaign",
    "timestamp": "2026-01-12T14:00:00Z"
  },
  {
    "title": "Pope Leo XIV meets with Venezuelan opposition leader María Corina Machado in a surprise audience",
    "description": "The Pope expresses deep concern over the situation and urges the protection of human rights.",
    "link": "https://www.bostonherald.com/2026/01/12/pope-meets-venezuela-opposition-machado/",
    "timestamp": "2026-01-12T13:59:48Z"
  },
  {
    "title": "Charles Hoskinson doubts CLARITY Act timeline, says Trump crypto czar should quit",
    "description": "Cardano founder Charles Hoskinson said Trump’s crypto adviser David Sacks has failed the industry and called on him to resign if the CLARITY Act does not pass this quarter.",
    "link": "https://cointelegraph.com/news/charles-hoskinson-doubts-clarity-act-urges-david-sacks-exit",
    "timestamp": "2026-01-12T13:59:43Z"
  },
  {
    "title": "Iran protests: Death toll surpasses 500 as Micheál Martin says ‘brutal repression’ of Iranians must end",
    "description": "President Donald Trump said the US may meet Iranian officials and was in contact with the opposition, as he weighed a range of strong responses including military options to escalating unrest posing one of the biggest challenges to clerical rule since the 197…",
    "link": "https://www.independent.ie/world-news/middle-east/iran-protests-death-toll-surpasses-500-as-micheal-martin-says-brutal-repression-of-iranians-must-end/a504370353.html",
    "timestamp": "2026-01-12T13:58:27Z"
  },
  {
    "title": "EU defense chief calls for permanent 100,000-strong ‘European army’",
    "description": "The EU should establish a unified military force to cut reliance on the US and NATO, Andrius Kubilius has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630832-kubilius-united-european-army/",
    "timestamp": "2026-01-12T13:57:18Z"
  },
  {
    "title": "Republican senator vows to block Trump Fed nominee over Powell investigation",
    "description": "Federal Reserve Chair Jerome Powell faces criminal investigation over testimony regarding Fed headquarters renovation as President Donald Trump seeks replacement.",
    "link": "https://www.foxnews.com/politics/republican-senator-vows-block-trump-fed-nominee-over-powell-investigation",
    "timestamp": "2026-01-12T13:56:23Z"
  },
  {
    "title": "Meta appoints former Trump adviser Dina Powell McCormick as president",
    "description": "Jan 12 : Meta Platforms on Monday named Dina Powell McCormick, a former senior official in U.S. President Donald Trump’s first administration, as its president and vice chairman.Powell McCormick, who spent 16 years in senior leadership roles at Goldman Sachs,…",
    "link": "https://www.channelnewsasia.com/business/meta-appoints-former-trump-adviser-dina-powell-mccormick-president-5853401",
    "timestamp": "2026-01-12T13:56:10Z"
  },
  {
    "title": "Former Trump adviser Dina Powell McCormick named Meta's president",
    "description": "Jan 12 : Meta Platforms on Monday named former Trump administration official Dina Powell McCormick as its president and vice chairman, boosting the company's lobbying efforts in the U.S. capital.President Donald Trump congratulated Powell McCormick in a post …",
    "link": "https://www.channelnewsasia.com/business/former-trump-adviser-dina-powell-mccormick-named-metas-president-5853401",
    "timestamp": "2026-01-12T13:56:10Z"
  },
  {
    "title": "Former Trump adviser Dina Powell McCormick joins Meta as president and vice chairman",
    "description": "Jan 12 : Meta Platforms on Monday named Dina Powell McCormick as its president and vice chairman, weeks after the former top adviser to U.S. President Donald Trump resigned from the social media company's board.Powell McCormick, who spent 16 years in senior l…",
    "link": "https://www.channelnewsasia.com/business/former-trump-adviser-dina-powell-mccormick-joins-meta-president-and-vice-chairman-5853401",
    "timestamp": "2026-01-12T13:56:10Z"
  },
  {
    "title": "Why Jerome Powell Thinks Trump DOJ is Investigating Him",
    "description": "President Donald Trump’s Department of Justice has launched a criminal investigation into Federal Reserve Chair Jerome Powell over his $2.5 billion renovations to the Fed... Read More\nThe post Why Jerome Powell Thinks Trump DOJ is Investigating Him appeared f…",
    "link": "https://www.dailysignal.com/2026/01/12/why-jerome-powell-thinks-trump-doj-is-investigating-him/",
    "timestamp": "2026-01-12T13:55:53Z"
  },
  {
    "title": "Lindsey Graham Urges Trump To 'Kill' Iran's Leaders As Nationwide Protests Turn Deadly",
    "description": "Republican Senator Lindsey Graham urged US President Trump to assassinate Iran's Supreme Leader Ayatollah Ali Khamenei amid nationwide protests and lethal government crackdowns.",
    "link": "https://www.ibtimes.com/lindsey-graham-urges-trump-kill-irans-leaders-nationwide-protests-turn-deadly-3795057",
    "timestamp": "2026-01-12T13:55:09Z"
  },
  {
    "title": "Marco Rubio Highlights U.S.'s Need For 'Tangible Results' In The Dismantling Mexico's 'Violent Narcoterrorists Networks'",
    "description": "Secretary of State Marco Rubio highlighted the Trump administration's need for \"tangible results\" when countering criminal organizations in Mexico in a call with counterpart Juan Ramon de la Fuente.",
    "link": "https://www.ibtimes.com/marco-rubio-highlights-uss-need-tangible-results-dismantling-mexicos-violent-3795004",
    "timestamp": "2026-01-12T13:53:08Z"
  },
  {
    "title": "US futures slip while world shares are mixed as Fed chair Powell faces legal threat",
    "description": "The threat of a criminal indictment has renewed fears that the Fed’s independence will be compromised.",
    "link": "https://www.bostonherald.com/2026/01/12/stock-market-fed-independence-fears/",
    "timestamp": "2026-01-12T13:52:09Z"
  },
  {
    "title": "Trump's credit card rate cap plan has unclear path, 'devastating' risks, bank insiders say",
    "description": "A 10% rate cap would make large swaths of the credit card industry unprofitable, especially tied to customers with less-than-ideal credit, banks say.",
    "link": "https://www.cnbc.com/2026/01/12/trump-credit-card-rate-cap-enforcement-path-risks.html",
    "timestamp": "2026-01-12T13:49:44Z"
  },
  {
    "title": "'Horrifying' leak reveals ICE 'stalkers' have access to Americans' cell phone data",
    "description": "A bombshell report\r\n from 404 Media revealed that Immigration and Customs Enforcement has acquired new technology that allows the agency to monitor entire city neighborhoods by tracking the movements of its residents without a warrant, sparking widespread fea…",
    "link": "https://www.rawstory.com/ice-2674874634/",
    "timestamp": "2026-01-12T13:47:10Z"
  },
  {
    "title": "US accused of using 'sonic' weapons in Venezuela - Trump names acting president there",
    "description": "Serious allegations have been made that the American military used a secret weapon emitting 'Sonic' or high-powered sound waves during an operation launched to arrest Venezuelan President Nicolas Maduro. According to the New York Times, the American military …",
    "link": "https://english.gossiplankanews.com/2026/01/us-accused-of-using-sonic-weapons-in.html",
    "timestamp": "2026-01-12T13:46:56Z"
  },
  {
    "title": "Plunging Into the Abyss: Will the US and Russia Abandon All Nuclear Restraints?",
    "description": "For most of us, Friday, February 6, 2026, is likely to feel no different than Thursday, February 5. It will be a work or school day for many of us. It might involve shopping for the weekend or an evening get-together with friends, or any of the other mundane …",
    "link": "https://www.fairobserver.com/world-news/us-news/plunging-into-the-abyss-will-the-us-and-russia-abandon-all-nuclear-restraints/",
    "timestamp": "2026-01-12T13:45:12Z"
  },
  {
    "title": "Dina Powell McCormick Joins Meta as President and Vice Chairman",
    "description": "Dina will be a member of Meta’s management team, helping guide the company’s overall strategy and execution.\nThe post Dina Powell McCormick Joins Meta as President and Vice Chairman appeared first on Meta Newsroom.",
    "link": "https://about.fb.com/news/2026/01/dina-powell-mccormick-joins-meta-as-president-and-vice-chairman/",
    "timestamp": "2026-01-12T13:45:07Z"
  },
  {
    "title": "‘Do Less!’ Bill Maher Glares at Wanda Sykes as She Mocks Him at Golden Globes",
    "description": "Sykes was presenting the award for Best Performance in Stand-Up Comedy on Television when she pointedly opened up on some of the nominees.\nThe post ‘Do Less!’ Bill Maher Glares at Wanda Sykes as She Mocks Him at Golden Globes first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/entertainment/do-less-bill-maher-glares-at-wanda-sykes-as-she-mocks-him-at-golden-globes/",
    "timestamp": "2026-01-12T13:44:04Z"
  },
  {
    "title": "Donald Trump Blames Photographers For Heavy Appearance in Latest Viral Outburst",
    "description": "Donald Trump sparked a viral meme storm after asking photographers to make him look thinner at a public event, blaming image capture rather than personal lifestyle choices and drawing widespread mockery over vanity.",
    "link": "https://www.ibtimes.com/donald-trump-blames-photographers-heavy-appearance-latest-viral-outburst-3795008",
    "timestamp": "2026-01-12T13:42:52Z"
  },
  {
    "title": "Selected Articles: The “Drug Cartels” and The Laundering of “Dirty Money”",
    "description": "The “Drug Cartels” and The Laundering of “Dirty Money” By Prof Michel Chossudovsky, January 11, 2026 In December 2019, President Donald Trump offered to intervene in Mexico, i.e. “to go after the Drug Cartels.” Mexico’s president AMLO turned down Trump’s “gen…",
    "link": "https://www.globalresearch.ca/selected-articles-drug-cartels-laundering-dirty-money/5911888",
    "timestamp": "2026-01-12T13:41:01Z"
  },
  {
    "title": "China Issues Blunt Warning Over Trump's Greenland Talk",
    "description": "The U.S. shouldn't use other countries as a “pretext” to pursue its interests in the semiautonomous region of Denmark, said a Chinese Foreign Ministry spokesperson.",
    "link": "https://www.huffpost.com/entry/china-greenland-us-warning_n_6964f7b9e4b0db619f4b26a3",
    "timestamp": "2026-01-12T13:40:00Z"
  },
  {
    "title": "This morning in creeping presidential dementia (or whatever)",
    "description": "I know it’s almost impossible to be shocked or even surprised any more, but this was Friday: Donald J. Trump @realDonaldTrump Please be informed that we will no longer let the American Public be “ripped off” by Credit Card Companies that are charging Interest…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/this-morning-in-creeping-presidential-dementia-or-whatever",
    "timestamp": "2026-01-12T13:39:47Z"
  },
  {
    "title": "‘We don’t need them. We don’t like them’: Trump says MAGA has no room for antisemites",
    "description": "In wide-ranging interview with the NYT, US president claims he is probably the least antisemitic person in the world and says he does not know who Nick Fuentes is US President Donald Trump said there is no room in his MAGA movement or the Republican Party for…",
    "link": "https://freerepublic.com/focus/f-news/4361684/posts",
    "timestamp": "2026-01-12T13:38:10Z"
  },
  {
    "title": "\"We Had Whistles. They Had Guns\": Nationwide Protests Held over ICE Killing of Renee Good",
    "description": "We speak with civil rights attorney Nekima Levy Armstrong in Minneapolis as protests continue in the city following the killing of activist Renee Good last week. The ICE agent who fatally shot Good in her car has been identified as Jonathan Ross, an Iraq War …",
    "link": "https://www.democracynow.org/2026/1/12/minneapolis_protests",
    "timestamp": "2026-01-12T13:35:58Z"
  },
  {
    "title": "Trump says Iran wants to negotiate as the death toll in protests rises to at least 544",
    "description": "President Donald Trump says Iran wants to negotiate with the U.S. after his threat to strike the country over its crackdown on protesters. Activists said Monday the death toll in the demonstrations has risen to at least 544. Iran has…",
    "link": "https://apnews.com/article/iran-protests-us-israel-war-nuclear-economy-53f2b79c8a0de827b1b8602ac9f0a57b",
    "timestamp": "2026-01-12T13:35:15Z"
  },
  {
    "title": "Why George Clooney spoke French at the Golden Globes after Trump’s citizenship comments",
    "description": "George Clooney surprised audiences by speaking French at the Golden Globe Awards. He recently gained French citizenship along with his family. This move sparked reactions from former President Donald Trump and the French Ministry for Europe and Foreign Affair…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-george-clooney-spoke-french-at-the-golden-globes-after-trumps-citizenship-comments/articleshow/126485283.cms",
    "timestamp": "2026-01-12T13:34:00Z"
  },
  {
    "title": "Mary Peltola, barrier-breaking ex-Alaska congresswoman, is challenging Dan Sullivan in Senate race",
    "description": "Democratic former Alaska congresswoman Mary Peltola has announced a Senate run to challenge Republican Sen. Dan Sullivan",
    "link": "https://abcnews.go.com/Politics/wireStory/mary-peltola-barrier-breaking-alaska-congresswoman-challenging-dan-129126805",
    "timestamp": "2026-01-12T13:33:31Z"
  },
  {
    "title": "Tehran regime fears defections as Iran’s nationwide movement defies containment",
    "description": "Iran’s protest movement has now entered its third week, and the regime is struggling to contain the unrest. Islamic Republic authorities fear disobedience within the ranks, and reports of potential defections point to growing anxiety inside the security appar…",
    "link": "https://www.longwarjournal.org/archives/2026/01/tehran-regime-fears-defections-as-irans-nationwide-movement-defies-containment.php",
    "timestamp": "2026-01-12T13:31:10Z"
  },
  {
    "title": "Trump purges 'lame duck' claims with brute force, retribution and play for global domination (Stephen Collinson/CNN)",
    "description": "Stephen Collinson / CNN:\nTrump purges ‘lame duck’ claims with brute force, retribution and play for global domination  —  Donald Trump The Middle East South America Immigration  —  So much for that lame duck in the White House.  —  President Donald Trump is d…",
    "link": "https://www.memeorandum.com/260112/p18",
    "timestamp": "2026-01-12T13:30:00Z"
  },
  {
    "title": "Greenland faces 'fateful moment' as Trump says U.S. will take it 'one way or the other'",
    "description": "President Donald Trump renewed his threat to seize Greenland \"one way or the other\" from Denmark, as Europe and NATO scrambled to prioritize Arctic security against China and Russia.",
    "link": "https://www.nbcnews.com/world/greenland/trump-us-take-greenland-denmark-china-russia-europe-arctic-defense-rcna253546",
    "timestamp": "2026-01-12T13:29:18Z"
  },
  {
    "title": "Trump Could Ban Premier League Stars from World Cup: Fury as 'High-Risk' Rule Threatens Tournament",
    "description": "Premier League stars and fans face World Cup travel chaos as strict new US border rules and social media checks threaten entry for crucial tournament matches.",
    "link": "https://www.ibtimes.com/trump-could-ban-premier-league-stars-world-cup-fury-high-risk-rule-threatens-tournament-3795030",
    "timestamp": "2026-01-12T13:28:56Z"
  },
  {
    "title": "Aleppo under Attack from Kurdish Militias Supported by the US Military",
    "description": "The Syrian government held the SDF responsible for the recent escalation, asserting that the violation of an agreement signed on April 1 directly triggered the unrest.\nThe post Aleppo under Attack from Kurdish Militias Supported by the US Military appeared fi…",
    "link": "https://www.globalresearch.ca/aleppo-attack-kurdish-militias-supported-us-military/5911691",
    "timestamp": "2026-01-12T13:28:01Z"
  },
  {
    "title": "Iran has evidence US and Israel had ‘big hand’ in unrest – Tehran",
    "description": "Iran has evidence showing the US and Israel had a “big hand” in recent unrest in the country, foreign minister Abbas Araghchi has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630838-iran-us-israel-interference/",
    "timestamp": "2026-01-12T13:26:48Z"
  },
  {
    "title": "Mexico’s Sheinbaum says had ‘good conversation’ with Trump on security, drugs",
    "description": "MEXICO CITY, Jan 12 (Reuters) - Mexican President Claudia Sheinbaum said on Monday she had a “good conversation” with U.S. President Donald Trump on security and efforts … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/12/mexico-s-sheinbaum-says-had-good-conversation-with-trump-on-security-drugs",
    "timestamp": "2026-01-12T13:25:58Z"
  },
  {
    "title": "In Delhi, Trump’s point man Sergio Gor takes the hot seat to push India-US partnership",
    "description": "US envoy Sergio Gor has arrived in New Delhi, signaling a strong commitment to strengthening US-India relations. He expressed optimism about advancing President Trump's agenda and deepening bilateral ties. Trade discussions are set to continue, with a potenti…",
    "link": "https://economictimes.indiatimes.com/news/india/in-delhi-trumps-point-man-sergio-gor-takes-the-hot-seat-to-push-india-us-partnership/articleshow/126485535.cms",
    "timestamp": "2026-01-12T13:25:43Z"
  },
  {
    "title": "Trump Has '2 to 4 Months Left' Claims Physical Therapist After President Wanders Off Mid-Meeting",
    "description": "A physical therapist with a doctorate claims Trump has '2 to 4 months left' after analysing bizarre behaviour during an oil executives meeting where he wandered off to stare at construction.",
    "link": "https://www.ibtimes.com/trump-has-2-4-months-left-claims-physical-therapist-after-president-wanders-off-mid-meeting-3795047",
    "timestamp": "2026-01-12T13:25:08Z"
  },
  {
    "title": "Trump's Greenland Invasion Plot Sparks Pentagon Revolt As Senior Military Chiefs Resist Orders",
    "description": "Senior US military figures are resisting Donald Trump's directive to prepare an invasion plan for Greenland, citing illegality and lack of Congressional support.",
    "link": "https://www.ibtimes.com/trumps-greenland-invasion-plot-sparks-pentagon-revolt-senior-military-chiefs-resist-orders-3795051",
    "timestamp": "2026-01-12T13:24:38Z"
  },
  {
    "title": "International Gangsters. Donald Trump’s Criminal Regime",
    "description": "As the world is shocked, America’s gangster-ism has struck again on Venezuela, a small country of 30 million people. A country which has done no harm to America. \nThe post International Gangsters. Donald Trump’s Criminal Regime appeared first on Global Resear…",
    "link": "https://www.globalresearch.ca/international-gangsters/5911855",
    "timestamp": "2026-01-12T13:24:24Z"
  },
  {
    "title": "Trump Administration to Begin FEMA Cuts, Dozens of Disaster Response Workers to Be Terminated",
    "description": "According to a report, FEMA employees received emails on New Year's Eve informing them their positions would not be renewed and that their services would no longer be needed once their contracts expire in early January.",
    "link": "https://www.ibtimes.com/trump-administration-begin-fema-cuts-dozens-disaster-response-workers-terminated-3795052",
    "timestamp": "2026-01-12T13:24:22Z"
  }
]