[
  {
    "title": "Judge says Pete Hegseth is unlawfully retaliating against Sen. Mark Kelly over ‘illegal orders’ video | CNN Politics",
    "description": "A federal judge on Thursday shut down Defense Secretary Pete Hegseth’s attempts to punish Democratic Sen. Mark Kelly over his urging of US service members to refuse illegal orders, ruling that the Pentagon chief’s actions were unconstitutionally retaliatory.",
    "link": "https://www.cnn.com/2026/02/12/politics/mark-kelly-pentagon-lawsuit-ruling",
    "timestamp": "2026-02-12T17:42:14Z"
  },
  {
    "title": "Top DOJ antitrust enforcer is out weeks before Live Nation trial",
    "description": "Gail Slater, the top antitrust enforcer at the Justice Department, announced Thursday that she has left her post, just weeks before the agency's next major tech monopoly trial against entertainment giant Live Nation is set to begin. \"It is with great sadness …",
    "link": "https://www.theverge.com/policy/878163/doj-antitrust-chief-gail-slater-departs",
    "timestamp": "2026-02-12T17:38:22Z"
  },
  {
    "title": "Democrat Rep. Jayapal Claims Attorney General Pam Bondi Monitored Her Epstein File Searches: 'Outrageous'",
    "description": "Rep. Pramila Jayapal claimed Attorney General Pam Bondi spied on her search history as she viewed Epstein files on a government computer.\nThe post Democrat Rep. Jayapal Claims Attorney General Pam Bondi Monitored Her Epstein File Searches: ‘Outrageous’ appear…",
    "link": "https://www.breitbart.com/politics/2026/02/12/democrat-rep-jayapal-claims-attorney-general-pam-bondi-monitored-her-epstein-file-searches-outrageous/",
    "timestamp": "2026-02-12T17:38:19Z"
  },
  {
    "title": "Americans shouldered bulk of Trump tariff burden, says NY Fed report",
    "description": "The bank said 90 per cent of the tariffs imposed by the president on imported goods are borne by American consumers and companies",
    "link": "https://www.business-standard.com/world-news/americans-shouldered-bulk-of-trump-tariff-burden-ny-fed-report-126021201886_1.html",
    "timestamp": "2026-02-12T17:37:58Z"
  },
  {
    "title": "Senator has blunt warning for Trump prosecutor Jeanine Pirro: 'Preserve your records'",
    "description": "A Democratic lawmaker Thursday had a serious warning for former Fox News host and current U.S. Attorney for the District of Columbia Jeanine Pirro. Sen. Elissa Slotkin (D-MI) announced that she declined an interview with Pirro and Attorney General Pam Bondi, …",
    "link": "https://www.rawstory.com/lawmaker-has-a-warning-for-jeanine-pirro-preserve-your-records/",
    "timestamp": "2026-02-12T17:37:45Z"
  },
  {
    "title": "AEW Dynamite Review: New Champions Crowned, Bloody Brawls Ensue",
    "description": "Greetings, comrades! It is I, your El Presidente, reporting to you live from my luxury bunker in an undisclosed location (the CIA tried to interfere with my satellite feed tonight, but joke's on them—I have seventeen backup dishes hidden throughout my palace …",
    "link": "https://bleedingcool.com/tv/aew-dynamite-review-new-champions-crowned-bloody-brawls-ensue/",
    "timestamp": "2026-02-12T17:37:07Z"
  },
  {
    "title": "2 Mexican Navy ships laden with humanitarian aid dock in Cuba as US blockade sparks energy crisis",
    "description": "Trump has threatened tariffs on countries supplying oil to Cuba.",
    "link": "https://www.bostonherald.com/2026/02/12/cuba-mexico-aid/",
    "timestamp": "2026-02-12T17:37:07Z"
  },
  {
    "title": "Trump agrees to end deportation surge in Minnesota, White House border czar says",
    "description": "WASHINGTON, Feb 12 (Reuters) - ⁠U.S. President Donald Trump's border czar Tom Homan said on Thursday that a significant drawdown of immigration enforcement ⁠agents in Minnesota was underway and that he had proposed and Trump had agreed that the surge ‌there s…",
    "link": "https://www.thestar.com.my/news/world/2026/02/13/trump-agrees-to-end-deportation-surge-in-minnesota-white-house-border-czar-says",
    "timestamp": "2026-02-12T17:35:00Z"
  },
  {
    "title": "EU leaders meet to counter pressure from Russia, China and Trump",
    "description": "German and Italian leaders are pushing deregulation, rebooted ties with Washington and more trade deals.",
    "link": "https://www.bostonherald.com/2026/02/12/rethinking-europe/",
    "timestamp": "2026-02-12T17:33:26Z"
  },
  {
    "title": "The Prediction-Market Scandals Are Getting Bleaker",
    "description": "An arrest of an IDF reservist for allegedly using insider information on a military wager on Polymarket shows the dark side of letting everyone bet on everything.",
    "link": "http://nymag.com/intelligencer/article/prediction-market-insider-trading-polymarket-kalshi-idf-venezuela-maduro-half-time.html",
    "timestamp": "2026-02-12T17:32:04Z"
  },
  {
    "title": "RFK Jr. promised to restore trust in health agencies. It’s eroding",
    "description": "RFK Jr. promised to restore trust in health agencies. It’s erodingtwincities.com",
    "link": "https://www.twincities.com/2026/02/12/kennedy-health-trust/",
    "timestamp": "2026-02-12T17:30:41Z"
  },
  {
    "title": "Trump administration can't move former death row inmates to 'Supermax' prison for now, judge rules",
    "description": "A federal judge has temporarily blocked the Trump administration from transferring 20 inmates with commuted death sentences to the nation's highest security federal prison, warning that officials cannot employ a \"sham\" process for deciding where to incarcerat…",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-cant-move-former-death-row-inmates-to-supermax-prison-for-now-judge-rules",
    "timestamp": "2026-02-12T17:29:56Z"
  },
  {
    "title": "President Donald Trump Employs “I Have Black Friends” Trope",
    "description": "Conservative commentator Mila Joy shared a video of President Donald Trump alongside Black stars to decry claims of bigotry",
    "link": "https://hiphopwired.com/3041134/president-donald-trump-black-friends-video-bigotry/",
    "timestamp": "2026-02-12T17:28:45Z"
  },
  {
    "title": "Trump agrees to end deportation surge in Minnesota, White House border czar says",
    "description": "By Susan Heavey and Jonathan AllenWASHINGTON, Feb 12 (Reuters) - U.S. President Donald Trump’s border czar Tom Homan said on Thursday that a significant drawdown of immig… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/trump-agrees-to-end-deportation-surge-in-minnesota-white-house-border-czar-says",
    "timestamp": "2026-02-12T17:28:40Z"
  },
  {
    "title": "Joseph Gordon-Levitt Goes To Washington DC, Gets Section 230 Completely Backwards",
    "description": "You may have heard last week that actor Joseph Gordon-Levitt went to Washington DC and gave a short speech at an event put on by Senator Dick Durbin calling for the sunsetting of Section 230. It’s a short speech, and it gets almost everything wrong about Sect…",
    "link": "https://www.techdirt.com/2026/02/12/joseph-gordon-levitt-goes-to-washington-dc-gets-section-230-completely-backwards/",
    "timestamp": "2026-02-12T17:26:00Z"
  },
  {
    "title": "RFK Jr. promised to restore trust in US health agencies. One year later, it’s eroding",
    "description": "Survey results show Americans' confidence keeps sliding, not rising.",
    "link": "https://www.bostonherald.com/2026/02/12/kennedy-health-trust/",
    "timestamp": "2026-02-12T17:23:23Z"
  },
  {
    "title": "RFK Jr. promised to restore trust in US health agencies. One year later, it’s eroding",
    "description": "Survey results show Americans' confidence keeps sliding, not rising.",
    "link": "https://www.denverpost.com/2026/02/12/kennedy-health-trust/",
    "timestamp": "2026-02-12T17:23:23Z"
  },
  {
    "title": "Israel Destroyed Gaza’s Hospitals. Now It’s Banning Doctors Without Borders.",
    "description": "Israel says it will start enforcing its ban on 37 aid groups in Gaza in March, putting more Palestinian lives at risk.",
    "link": "https://truthout.org/articles/israel-destroyed-gazas-hospitals-now-its-banning-doctors-without-borders/",
    "timestamp": "2026-02-12T17:23:00Z"
  },
  {
    "title": "‘Absolutely absurd’: Senate forces District of Columbia to fully adopt Trump’s signature policy",
    "description": "Dems in D.C. tried to block tax provisions of federal law",
    "link": "https://www.wnd.com/2026/02/absolutely-absurd-senate-forces-district-columbia-fully-adopt/",
    "timestamp": "2026-02-12T17:22:44Z"
  },
  {
    "title": "JD Vance issues warning to US Olympians after he was booed at opening ceremony",
    "description": "JD Vance issued warning to US olympians after he and his wife Usha were booed in Milan",
    "link": "https://www.ladbible.com/news/politics/jd-vance-us-olympians-booed-opening-speaks-out-313932-20260212",
    "timestamp": "2026-02-12T17:22:22Z"
  },
  {
    "title": "DHS Said It Was Targeting the 'Worst of the Worst' in Maine. It Swept Up Asylum Seekers and Noncriminals.",
    "description": "News outlets, civil rights groups, and court records tell a much different story than the government's claims about \"Operation Catch of the Day.\"",
    "link": "https://reason.com/2026/02/12/dhs-said-it-was-targeting-the-worst-of-the-worst-in-maine-it-swept-up-asylum-seekers-and-noncriminals/",
    "timestamp": "2026-02-12T17:21:56Z"
  },
  {
    "title": "'CBS Evening News' producer quits in widely panned farewell note, defends liberal label by quoting Cronkite",
    "description": "CBS News producer Alicia Hastey left with a scathing farewell note implicitly criticizing editor-in-chief Bari Weiss and alleged ideological shifts.",
    "link": "https://www.foxnews.com/media/cbs-news-producer-says-network-has-shifting-ideological-expectations-in-mocked-unhinged-farewell-note",
    "timestamp": "2026-02-12T17:20:18Z"
  },
  {
    "title": "Slog AM: ICE Out of MN, Seattle Hosts Big-Ass Parade, Bondi Snubs Epstein Survivors",
    "description": "The Stranger's morning news roundup.\n \n by Micah Yip\n \n \n \n Thank Fuck: After two months of federal officers terrorizing, brutalizing, arresting, and killing people in Minneapolis, the Trump administration will end its “largest immigration enforcement operati…",
    "link": "https://www.thestranger.com/slog-am/2026/02/12/80472172/slog-am-ice-out-of-mn-seattle-hosts-big-ass-parade-bondi-snubs-epstein-survivors",
    "timestamp": "2026-02-12T17:20:00Z"
  },
  {
    "title": "Slog AM: ICE Out of MN, Seattle Hosts Big-Ass Parade, Bondi Snubs Epstein Survivors",
    "description": "The Stranger's morning news roundup.\n \n by Micah Yip\n \n \n \n Thank Fuck: After two months of federal officers terrorizing, brutalizing, arresting, and killing people in Minneapolis, the Trump administration will end its “largest immigration enforcement operati…",
    "link": "https://www.thestranger.com/news/2026/02/12/80472172/slog-am-ice-out-of-mn-seattle-hosts-big-ass-parade-bondi-snubs-epstein-survivors",
    "timestamp": "2026-02-12T17:20:00Z"
  },
  {
    "title": "Trump Goes to Bat Hard for Pam Bondi Despite MAGA Blowback from Wild Hearing: She ‘Was Fantastic!’",
    "description": "Donald Trump posted a full-throated defense of Pam Bondi Thursday following her combative congressional hearing that had even MAGA stalwarts calling for blood.\nThe post Trump Goes to Bat Hard for Pam Bondi Despite MAGA Blowback from Wild Hearing: She ‘Was Fan…",
    "link": "https://www.mediaite.com/media/news/trump-goes-to-bat-hard-for-pam-bondi-despite-maga-blowback-from-wild-hearing-she-was-fantastic/",
    "timestamp": "2026-02-12T17:19:53Z"
  },
  {
    "title": "Epstein files: why the Trump administration is taking a big gamble by releasing millions of documents",
    "description": "Despite the release of millions of documents, a growing number of people on each side of US politics believe a cover-up is taking place.",
    "link": "https://theconversation.com/epstein-files-why-the-trump-administration-is-taking-a-big-gamble-by-releasing-millions-of-documents-275827",
    "timestamp": "2026-02-12T17:19:35Z"
  },
  {
    "title": "The US is starving Cuba of fuel – here’s what a deal between them could look like",
    "description": "The Trump administration’s message to Havana is blunt: negotiate a deal on US terms or face collapse.",
    "link": "https://theconversation.com/the-us-is-starving-cuba-of-fuel-heres-what-a-deal-between-them-could-look-like-275765",
    "timestamp": "2026-02-12T17:19:12Z"
  },
  {
    "title": "Five reasons Trump’s plan for Ukrainian elections and a peace referendum will only prolong the war",
    "description": "The US president’s plan for Ukraine looks far-fetched and one-sided – but it might buy Volodymyr Zelensky and his allies valuable time.",
    "link": "https://theconversation.com/five-reasons-trumps-plan-for-ukrainian-elections-and-a-peace-referendum-will-only-prolong-the-war-275698",
    "timestamp": "2026-02-12T17:18:58Z"
  },
  {
    "title": "Trump attacked this GOP governor while claiming Democrats were always included in annual meeting",
    "description": "In a social media post, Trump blasted Oklahoma Gov. Kevin Stitt, a Republican who chairs the NGA, as a \"RINO,\" meaning Republican in Name Only. Trump said Stitt \"incorrectly stated my position on the very exclusive Governors Annual Dinner and Meeting at the W…",
    "link": "https://www.pbs.org/newshour/politics/trump-attacked-this-gop-governor-while-claiming-democrats-were-always-included-in-annual-meeting",
    "timestamp": "2026-02-12T17:18:45Z"
  },
  {
    "title": "Remember the Epstein Binder Photo Op? MAGA Influencers Hope You Don’t.",
    "description": "Fifteen influencers waved “Epstein Files” binders at the White House. When scrutiny widened to Trump, the outrage narrowed just as quickly.\nThe post Remember the Epstein Binder Photo Op? MAGA Influencers Hope You Don’t. first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/remember-the-epstein-binder-photo-op-maga-influencers-hope-you-dont/",
    "timestamp": "2026-02-12T17:18:44Z"
  },
  {
    "title": "Justice Department’s antitrust chief has been fired, sources say | CNN Politics",
    "description": "Gail Slater, who ran the antitrust division for the Justice Department for nearly a year, was forced out by the Trump administration this week, two people familiar with the matter told CNN.",
    "link": "https://www.cnn.com/2026/02/12/politics/doj-antitrust-chief-fired",
    "timestamp": "2026-02-12T17:16:40Z"
  },
  {
    "title": "Europe warily awaits Rubio at Munich Security Conference as Trump roils transatlantic ties",
    "description": "Secretary of State Marco Rubio is leading a U.S. delegation to the Munich Security Conference.",
    "link": "https://www.bostonherald.com/2026/02/12/munich-security-conference-rubio/",
    "timestamp": "2026-02-12T17:16:08Z"
  },
  {
    "title": "Donald Trump Orders Pentagon: Buy Coal Power, To Whip The Kaiser!",
    "description": "Also, the industry gave him its new Coalpile Peace Prize.",
    "link": "https://www.wonkette.com/p/donald-trump-orders-pentagon-buy",
    "timestamp": "2026-02-12T17:15:27Z"
  },
  {
    "title": "Trump family's WLFI plans FX and remittance platform: Report",
    "description": "World Liberty Financial, a DeFi platform co-founded by US President Donald Trump and his family, is branching out into the foreign exchange market.",
    "link": "https://cointelegraph.com/news/trump-wlfi-foreign-exchange-remittance",
    "timestamp": "2026-02-12T17:14:11Z"
  },
  {
    "title": "Israel’s Netanyahu says Trump may be creating conditions for Iran deal",
    "description": "JERUSALEM, Feb 12 (Reuters) - Israeli Prime Minister Benjamin Netanyahu on Thursday expressed hope that U.S. President Donald Trump may be creating the conditions to reac… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/israel-s-netanyahu-says-trump-may-be-creating-conditions-for-iran-deal",
    "timestamp": "2026-02-12T17:13:16Z"
  },
  {
    "title": "Trump just gave MAGA a million reasons to walk away",
    "description": "With apologies to Lady Gaga (who managed to be overshadowed by Bad Bunny at the Super Bowl), Donald Trump’s million reasons are a lot different than hers\r\n. Seems pretty sus to me, but then again, I’m not in the world’s dumbest death cult. And yet MAGA is sti…",
    "link": "https://www.rawstory.com/raw-investigates/maga-2675260550/",
    "timestamp": "2026-02-12T17:12:27Z"
  },
  {
    "title": "India at a Crossroads: How the US Is Forcing Delhi to Abandon Russian Oil",
    "description": "In the shadowy corridors of global power, where economic leverage masquerades as diplomacy, India is caught up in a high-stakes game orchestrated by Washington. The recent ‘trade deal’ announced by US President Donald Trump on 2 February 2026, which saw …\nThe…",
    "link": "https://www.globalresearch.ca/india-us-forcing-delhi-abandon-russian-oil/5915665",
    "timestamp": "2026-02-12T17:07:49Z"
  },
  {
    "title": "Department of Justice Antitrust Chief Gail Slater to Exit Role Amid Netflix-WB Deal Review",
    "description": "The agency is also reviewing Paramount's $108.4 billion hostile takeover bid\nThe post Department of Justice Antitrust Chief Gail Slater to Exit Role Amid Netflix-WB Deal Review appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/department-of-justice-antitrust-chief-gail-slater-exit/",
    "timestamp": "2026-02-12T17:06:03Z"
  },
  {
    "title": "Trump denies report that golfing buddy is carving up Venezuela for himself in frantic post",
    "description": "President Donald Trump denounced one of his purported golfing buddies who's being credited with steering U.S. efforts to revive Venezuela's oil industry.The Wall Street Journal reported Wednesday night that energy magnate Harry Sargeant III, who the paper des…",
    "link": "https://www.rawstory.com/trump-venezuela-2675263368/",
    "timestamp": "2026-02-12T17:03:36Z"
  },
  {
    "title": "First lady Melania Trump achieves third reunification of Ukrainian children with 'unwavering commitment'",
    "description": "First lady Melania Trump continues her global children's advocacy with the Ukrainian reunification program after visiting NIH Children's Inn for Valentine's Day.",
    "link": "https://www.foxnews.com/lifestyle/first-lady-melania-trump-achieves-third-reunification-ukrainian-children-unwavering-commitment",
    "timestamp": "2026-02-12T17:02:32Z"
  },
  {
    "title": "Syria retakes strategic military base after American pullout",
    "description": "The Syrian Defense Ministry has announced receiving the strategic Al-Tanf garrison from US forces and beginning deployment Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632361-syria-military-base-us/",
    "timestamp": "2026-02-12T17:02:32Z"
  },
  {
    "title": "Fed chair drama: Tillis pours cold water on off-ramp for Powell criminal probe",
    "description": "Sen. Thom Tillis says handing off the DOJ's criminal probe of Fed Chair Jerome Powell to the Senate Banking Committee wouldn't satisfy his concerns.",
    "link": "https://www.cnbc.com/2026/02/12/fed-tillis-powell-senate-trump-warsh.html",
    "timestamp": "2026-02-12T17:01:10Z"
  },
  {
    "title": "NEWSOM: TRUMP 'SUNDOWNING'",
    "description": "Gavin Newsom accused President Donald Trump of sundowning amid growing health concerns about Dementia.",
    "link": "https://www.inquisitr.com/gavin-newsom-accused-donald-trump-of-sundowning-amid-dementia-concerns",
    "timestamp": "2026-02-12T17:01:00Z"
  },
  {
    "title": "LEBOWITZ: 'This is not kind of like what Nazis did. This is precisely what Nazis did'...",
    "description": "The writer and commentator comes to the Emerson Colonial for a speaking engagement on Feb. 19.",
    "link": "https://www.bostonglobe.com/2026/02/11/arts/fran-lebowitz-emerson-colonial/",
    "timestamp": "2026-02-12T17:01:00Z"
  },
  {
    "title": "Chile Agrees to Send Humanitarian Aid to Cuba, Joining Mexico",
    "description": "Chile’s outgoing government will give humanitarian aid to Cuba, the nation’s top diplomat said Thursday, days after Mexico sent two ships filled with tons of food to the struggling communist-run island.",
    "link": "https://financialpost.com/pmn/business-pmn/chile-agrees-to-send-humanitarian-aid-to-cuba-joining-mexico",
    "timestamp": "2026-02-12T17:00:53Z"
  },
  {
    "title": "Trump's Justice Department antitrust head Gail Slater stepping down (Reuters)",
    "description": "Reuters:\nTrump's Justice Department antitrust head Gail Slater stepping down  —  The Trump administration's head of the Justice Department's antitrust division said Thursday she is stepping down less than a year after being appointed by President Donald Trump…",
    "link": "https://www.memeorandum.com/260212/p50",
    "timestamp": "2026-02-12T17:00:39Z"
  },
  {
    "title": "REVEALED: The Guy Jeffrey Epstein Thought Was The Baddest Man In The Whole Damn Town…",
    "description": "Here’s a clue:  He is/was Epstein’s best friend.  He denied the existence of an Epstein client list and called it a demo-rat hoax.   He’s mentioned in the ‘new’ Epstein files up to 10,000 times…  But… It’s all a conspiracy! “I did not have sexual relations wi…",
    "link": "https://www.activistpost.com/revealed-the-guy-jeffrey-epstein-thought-was-the-baddest-man-in-the-whole-damn-town/",
    "timestamp": "2026-02-12T17:00:00Z"
  },
  {
    "title": "Ben Shapiro Is Waging Battle Inside the MAGA Movement | The New Yorker Interview",
    "description": "The conservative commentator talks with David Remnick about the antisemitism in MAGA media and why he condemns President Trump as corrupt yet sticks with him.",
    "link": "https://www.newyorker.com/video/watch/ben-shapiro-is-waging-battle-inside-the-maga-movement",
    "timestamp": "2026-02-12T17:00:00Z"
  },
  {
    "title": "Trump and Xi Seek Short Term Wins as Summit Nears",
    "description": "The United States and China are seeking to preserve their fragile trade truce before President Donald Trump visits Chinese President Xi Jinping for a high-stakes summit in Beijing this spring, according to the South China Morning Post. On the sidelines of the…",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-and-Xi-Seek-Short-Term-Wins-as-Summit-Nears.html",
    "timestamp": "2026-02-12T17:00:00Z"
  },
  {
    "title": "Trump's Justice Department antitrust head Gail Slater stepping down",
    "description": "Trump appointed Slater to head the Justice Department's antitrust unit, which enforces laws against illegal monopolies and anticompetitive business behavior.",
    "link": "https://www.cnbc.com/2026/02/12/gail-slater-trump-antitrust-justice-department-bondi.html",
    "timestamp": "2026-02-12T16:59:34Z"
  },
  {
    "title": "Government Gun Agency Backtracks On Permit Denials After Backlash From Pro-Second Amendment Group",
    "description": "ATF backtracked Tuesday after GOA posted screenshots of the denial of an application for items covered by the National Firearms Act of 1934 (NFA) on X.",
    "link": "https://dailycaller.com/2026/02/12/government-gun-agency-backtracks-on-permit-denials-after-backlash-from-pro-second-amendment-group/",
    "timestamp": "2026-02-12T16:56:54Z"
  },
  {
    "title": "Good Morning, News: US Border Czar Announces Minnesota Surge Wind Down, Washington DC Guard Troops to Stay Another Year, and Republican Lawmakers Want to Increase Voter Paperwork",
    "description": "by Suzette Smith\n \n \n \n If you appreciate the Mercury's interesting and useful news & culture reporting, consider making a small monthly contribution to support our editorial team. Your donation is tax-deductible. You can also subscribe and have our papers de…",
    "link": "https://www.portlandmercury.com/good-morning-news/2026/02/12/48309798/good-morning-news-us-border-czar-announces-minnesota-surge-wind-down-washington-dc-guard-troops-to-stay-another-year-and-republican-lawmak",
    "timestamp": "2026-02-12T16:56:00Z"
  },
  {
    "title": "Report: Warner Bros. Discovery Blocks Brody King From AEW Dynamite Following \"F*ck ICE\" Chants (Aidan Gibbons/Cultaholic Wrestling)",
    "description": "Aidan Gibbons / Cultaholic Wrestling:\nReport: Warner Bros. Discovery Blocks Brody King From AEW Dynamite Following “F*ck ICE” Chants  —  WBD looking to keep Donald Trump on side leads to Brody King off AEW TV  —  Brody King was absent from Wednesday night's e…",
    "link": "https://www.memeorandum.com/260212/p49",
    "timestamp": "2026-02-12T16:55:03Z"
  },
  {
    "title": "Nolte: Washington Post Beclowns Itself (Twice) with Trump National Guard Story",
    "description": "The failing, far-left Washington Post once again covered itself in disgrace with a story so remarkably wrong it beggars belief.\nThe post Nolte: Washington Post Beclowns Itself (Twice) with Trump National Guard Story appeared first on Breitbart.",
    "link": "https://www.breitbart.com/the-media/2026/02/12/nolte-washington-post-beclowns-itself-twice-with-trump-national-guard-story/",
    "timestamp": "2026-02-12T16:53:40Z"
  },
  {
    "title": "India-US joint statement remains basis for interim trade agreement: New Delhi",
    "description": "India on Thursday said the February 7 joint statement with the US remains the basis for the proposed interim trade agreement and that recent changes in the White House fact sheet reflect shared understandings between the two sides.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-joint-statement-remains-basis-for-interim-trade-agreement-new-delhi/articleshow/128267973.cms",
    "timestamp": "2026-02-12T16:53:34Z"
  },
  {
    "title": "Trump Signs the Planet's Death Warrant, Revoking EPA's Ability to Regulate Greenhouse Gases",
    "description": "As of today, the federal government no longer even acknowledges that greenhouse gases are linked to climate change and associated dangers.",
    "link": "https://www.jezebel.com/trump-epa-deregulation-endangerment-finding-greenhouse-gases-regulation-climate-change-warming",
    "timestamp": "2026-02-12T16:53:12Z"
  },
  {
    "title": "Kathy Griffin declares herself 'uncanceled,' says she was ahead of her time with bloody Trump photo",
    "description": "Comedian Kathy Griffin declares herself \"uncanceled\" after 2017 Trump photo controversy, saying she's \"very proud\" of the controversial image.",
    "link": "https://www.foxnews.com/media/kathy-griffin-declares-herself-uncanceled-says-she-ahead-her-time-bloody-trump-photo",
    "timestamp": "2026-02-12T16:51:14Z"
  },
  {
    "title": "Trump just blew up a load-bearing pillar of climate regulation in the US. What happens now?",
    "description": "The Trump administration is about to tear down a load-bearing ruling that considers climate change as a threat to Americans’ health.  Today, the Environmental Protection Agency is announcing that it will publish its final rule to dismantle the endangerment fi…",
    "link": "https://www.vox.com/climate/478950/epa-climate-endangerment-finding-trump-coal-fuel-economy",
    "timestamp": "2026-02-12T16:49:55Z"
  },
  {
    "title": "After his meeting with Trump, Netanyahu skeptical about an agreement with Iran",
    "description": "Prime Minister Benjamin Netanyahu said as he boarded his plane that he had just concluded a brief visit to Washington, during which he met with U.S. President Donald Trump. He said the two discussed several issues, with a particular focus on negotiations with…",
    "link": "https://www.israelnationalnews.com/flashes/676188",
    "timestamp": "2026-02-12T16:48:23Z"
  },
  {
    "title": "FTC tells Tim Cook to look into reports Apple News is censoring conservatives",
    "description": "Ferguson cited a study from the conservative Media Research Center that said Apple News did not feature right-leaning news during high-traffic windows.",
    "link": "https://www.cnbc.com/2026/02/12/ftc-tim-cook-apple-news-censorship.html",
    "timestamp": "2026-02-12T16:48:15Z"
  },
  {
    "title": "Trump coin and other meme tokens are to blame for the crypto winter, famed investor Ross Gerber says",
    "description": "Bitcoin's struggles are rooted in the wild world of meme coins, with investors fatigued by constant celebrity-backed tokens that quickly plunge, Gerber said.",
    "link": "https://www.businessinsider.com/bitcoin-donald-trump-meme-coins-crypto-market-investing-btc-wlfi-2026-2",
    "timestamp": "2026-02-12T16:48:12Z"
  },
  {
    "title": "Republicans in lock-step behind Trump immigration crackdown as independent support shrinks, poll finds",
    "description": "A poll reveals Republicans stand firm behind Trump's immigration crackdown, but independent support dropped and 6 in 10 U.S. adults say he's \"gone too far.\"",
    "link": "https://www.foxnews.com/politics/republicans-lock-step-behind-trump-immigration-crackdown-independent-support-shrinks-poll-finds",
    "timestamp": "2026-02-12T16:46:13Z"
  },
  {
    "title": "Democratic Governor Bans ICE From State Property",
    "description": "New Jersey’s newly elected Governor Mikie Sherill is the latest Democratic state leader to take action to protect her state’s residents from President Donald Trump’s deadly federal immigration crackdown. Sherill signed an executive order Wednesday barring Imm…",
    "link": "https://newrepublic.com/post/206525/democratic-governor-bans-ice-state-property-new-jersey",
    "timestamp": "2026-02-12T16:44:44Z"
  },
  {
    "title": "Make America Trustworthy Again",
    "description": "The international order could still avoid a full rupture, but even temporary breaks leave lasting scars. By weaponizing tools designed to manage the global economy through international coordination, President Donald Trump is undermining US credibility and pu…",
    "link": "https://www.project-syndicate.org/commentary/america-credibility-problem-could-lead-to-rupture-if-not-addressed-by-ricardo-hausmann-2026-02",
    "timestamp": "2026-02-12T16:43:44Z"
  },
  {
    "title": "Trump to undo legal basis for US climate rules",
    "description": "US President Donald Trump is poised to revoke a landmark scientific finding that greenhouse gases endanger public health by driving climate change - a determination that underpins US regulations aimed at curbing planet-warming pollution.",
    "link": "https://www.rte.ie/news/us/2026/0212/1558193-us-climate-rules/",
    "timestamp": "2026-02-12T16:43:36Z"
  },
  {
    "title": "Justice Department's antitrust chief says she's leaving, effective today",
    "description": "The head of the Justice Department's antitrust unit said Thursday she is leaving the role, effective immediately, at a critical moment for corporate mergers in America",
    "link": "https://www.nbcnews.com/business/business-news/justice-antitrust-chief-slater-leaving-rcna258759",
    "timestamp": "2026-02-12T16:42:38Z"
  },
  {
    "title": "Ana Navarro Slams AG Pam Bondi On ‘The View,’ Says Trump’s Cabinet “Sold Their Souls To Be In The Circle Of Power”",
    "description": "\"They know that what they are doing is not right,\" she said of the Trump administration.",
    "link": "https://decider.com/2026/02/12/ana-navarro-pam-bondi-the-view-trumps/",
    "timestamp": "2026-02-12T16:41:45Z"
  },
  {
    "title": "Reports: Russia Wants to Send Cuba Oil, but Fears Trump Seizing Its Tankers",
    "description": "A report in a Kremlin-friendly publication claimed that the Russian government is \"expected\" to send oil to Cuba.\nThe post Reports: Russia Wants to Send Cuba Oil, but Fears Trump Seizing Its Tankers appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2026/02/12/reports-russia-wants-send-cuba-oil-fears-trump-seizing-its-tankers/",
    "timestamp": "2026-02-12T16:39:44Z"
  },
  {
    "title": "Islam Makhachev welcomes Ilia Topuria fight at UFC White House",
    "description": "Islam Makhachev has once again stated an interest in facing Ilia Topuria at the UFC White House. Since the announcement of the White House card, there has been much speculation as to who will be selected to represent the company on the grandest stage of all. …",
    "link": "https://sports.yahoo.com/articles/islam-makhachev-welcomes-ilia-topuria-163855148.html",
    "timestamp": "2026-02-12T16:38:55Z"
  },
  {
    "title": "'Nobody cared about Epstein': Trump complains about 'never ending saga' in Bondi defense",
    "description": "President Donald Trump praised Pam Bondi's combative House hearing while complaining about \"the never ending saga of Jeffrey Epstein.\"\"AG Pam Bondi, under intense fire from the Trump Deranged Radical Left Lunatics, was fantastic at yesterday's Hearing on the …",
    "link": "https://www.rawstory.com/trump-epstein-never-ending-saga/",
    "timestamp": "2026-02-12T16:38:44Z"
  },
  {
    "title": "Trump Orders Defense, Energy Departments to Reinvest in Coal",
    "description": "One study showed that coal power plants led to nearly half a million U.S. deaths over a 20-year period.",
    "link": "https://truthout.org/articles/trump-orders-defense-energy-departments-to-reinvest-in-coal/",
    "timestamp": "2026-02-12T16:38:10Z"
  },
  {
    "title": "“We can outlast an occupation”: Frey celebrates as Minneapolis ICE surge ends",
    "description": "The Minneapolis mayor celebrated his constituents after Tom Homan announced a drawdown of ICE agents in Minnesota",
    "link": "https://www.salon.com/2026/02/12/we-can-outlast-an-occupation-frey-celebrates-as-minneapolis-ice-surge-ends/",
    "timestamp": "2026-02-12T16:37:50Z"
  },
  {
    "title": "Cardi B Tells Concert Crowd She's Ready to Beat and Mace ICE Agents: 'They Ain’t Taking My Fans, Bitch'",
    "description": "Rap star Cardi B kicked off her \"Little Miss Drama Tour\" on Wednesday by firing off an unhinged rant threatening Immigration and Customs Enforcement (ICE) agents, telling the sold-out audience at the Acrisure Arena in Palm Desert, California, that she would \"…",
    "link": "https://www.breitbart.com/entertainment/2026/02/12/cardi-b-tells-concert-crowd-shes-ready-to-beat-and-mace-ice-agents-they-aint-taking-my-fans-bitch/",
    "timestamp": "2026-02-12T16:37:44Z"
  },
  {
    "title": "Report: WBD Blocked Brody King From AEW Dynamite Over Anti-ICE Chant",
    "description": "The intersection of professional wrestling and political expression has once again produced consequential reverberations, though this time the controversy stems not from what transpired on screen, but rather from what was conspicuously absent. According to ve…",
    "link": "https://bleedingcool.com/tv/report-wbd-blocked-brody-king-from-aew-dynamite-over-ice-chant/",
    "timestamp": "2026-02-12T16:37:08Z"
  },
  {
    "title": "Stock Market Today, Feb. 12: Stocks moderate as initial claims fall, continuing claims rise",
    "description": "This live blog is refreshed periodically throughout the day with the latest updates from the market.To find the latest Stock Market Today threads, click here...",
    "link": "https://www.thestreet.com/latest-news/stock-market-today-feb-12-stocks-moderate-as-initial-claims-fall-continuing-claims-rise",
    "timestamp": "2026-02-12T16:35:01Z"
  },
  {
    "title": "Abigail Slater Says She’s Departing As Justice Department’s Antitrust Chief; Exit Comes As Division Reviews Netflix-Warner Bros. Merger",
    "description": "Gail Slater, who has served as the head of the Justice Department’s Antitrust Division in Donald Trump’s second term, announced her departure on Thursday. Her exit comes as the division is reviewing Netflix’s proposed merger with Warner Bros., as well as Para…",
    "link": "http://deadline.com/2026/02/gail-slater-antitrust-trump-1236717301/",
    "timestamp": "2026-02-12T16:34:48Z"
  },
  {
    "title": "CAIR-MN Welcomes End of ICE Siege of Minneapolis as ‘Community Victory,’ Warns of Lasting Harm and Ongoing Risks",
    "description": "The Minnesota chapter of the Council on American-Islamic Relations (CAIR-MN) today welcomed the announced end of the ICE siege of Minneapolis\r\n as a “hard-fought community victory,” while warning that the impacts of the operation will continue to be felt by f…",
    "link": "https://www.commondreams.org/newswire/cair-mn-welcomes-end-of-ice-siege-of-minneapolis-as-community-victory-warns-of-lasting-harm-and-ongoing-risks",
    "timestamp": "2026-02-12T16:31:28Z"
  },
  {
    "title": "NATO launches Arctic security push as Trump eyes Greenland takeover",
    "description": "NATO launches Arctic Sentry effort amid pressure from President Donald Trump about security in the region, and his calls for U.S. acquisition of Greenland.",
    "link": "https://www.foxnews.com/politics/nato-launches-arctic-security-push-trump-eyes-greenland-takeover",
    "timestamp": "2026-02-12T16:31:19Z"
  },
  {
    "title": "US And Mexico Seize Massive Cocaine Payload In Rare Joint Drug Bust",
    "description": "U.S. and Mexican authorities carried out a rare joint operation in the Pacific Ocean, intercepting a vessel carrying several tons of cocaine, according to Mexican officials. The bust occurred near Clarion Island, roughly 680 miles from the Mexican port city o…",
    "link": "https://dailycaller.com/2026/02/12/us-and-mexico-seize-several-tons-of-cocaine-in-joint-pacific-drug-bust/",
    "timestamp": "2026-02-12T16:31:04Z"
  },
  {
    "title": "The miracle of Budapest: How Troy Parrott’s heroics may have dented Viktor Orban’s re-election hopes",
    "description": "Republic of Ireland striker’s late goal ended Hungary’s campaign, punctured a government myth and may dent Orban’s re-election hopes",
    "link": "https://www.irishtimes.com/world/europe/2026/02/12/the-miracle-of-budapest-how-irelands-late-winner-exposed-viktor-orbans-football-state/",
    "timestamp": "2026-02-12T16:30:00Z"
  },
  {
    "title": "Trump invited to Jerusalem to receive Israel Prize",
    "description": "President Donald Trump was invited to attend the Israel Prize Award Ceremony in Jerusalem, at which he will be awarded the Israel Prize for Lifetime Special Contribution to the State of Israel and the Jewish people.",
    "link": "https://nypost.com/2026/02/12/world-news/trump-invited-to-receive-israel-prize-in-jerusalem/",
    "timestamp": "2026-02-12T16:29:56Z"
  },
  {
    "title": "WATCH LIVE: Trump, Zeldin to announce end of scientific basis for U.S. action on climate change",
    "description": "The Trump administration on Thursday will revoke a scientific finding that long has been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change, the White House announced.",
    "link": "https://www.pbs.org/newshour/science/watch-live-trump-zeldin-to-announce-end-of-scientific-basis-for-u-s-action-on-climate-change",
    "timestamp": "2026-02-12T16:29:37Z"
  },
  {
    "title": "Tariff-linked U.S. Customs bond funding shortfall reaches record-breaking $3.5 billion in 2025",
    "description": "U.S. Customs identified close to $3.6 billion in surety bond insufficiencies in fiscal 2025, a financial guarantee trade experts say has soared due to tariffs.",
    "link": "https://www.cnbc.com/2026/02/12/trump-tariffs-us-customs-record-bond-funding-issues-flagged.html",
    "timestamp": "2026-02-12T16:26:03Z"
  },
  {
    "title": "Trump rages at 'wiseguy' Republican governor over dinner invite: 'The fewer the better!'",
    "description": "President Donald Trump lashed out a Republican governor Thursday — reviving an old beef and continuing a battle over an upcoming governors’ event at the White House. Trump spent Wednesday and Thursday lashing out at Oklahoma Republican Gov. Kevin Stitt after …",
    "link": "https://www.rawstory.com/donald-trump-2675263218/",
    "timestamp": "2026-02-12T16:24:33Z"
  },
  {
    "title": "Crypto Expert Explains How Bitcoin Exchange Gave Police Control Over Nancy Guthrie’s Kidnapper",
    "description": "A cryptocurrency expert believes Nancy Guthrie’s kidnapper may have sabotaged themselves by demanding ransom in Bitcoin.",
    "link": "https://www.boredpanda.com/how-bitcoin-exchange-gave-police-control-over-nancy-guthries-kidnapper/",
    "timestamp": "2026-02-12T16:24:06Z"
  },
  {
    "title": "Vietnam's top leader to travel to US for 'Board of Peace' meeting",
    "description": "Vietnam's top leader To Lam is set to visit Washington next week for talks on the US president's \"Board of Peace\", sources say.",
    "link": "https://www.channelnewsasia.com/world/vietnam-us-trump-lam-trade-board-peace-5927236",
    "timestamp": "2026-02-12T16:24:00Z"
  },
  {
    "title": "US tariff revenue up 300% under Trump as Supreme Court battle looms",
    "description": "Tariff revenue surges 300% under Trump administration, but Supreme Court battle could reshape trade policy. Federal coffers see $124 billion windfall.",
    "link": "https://www.foxnews.com/politics/us-tariff-revenue-up-300-under-trump-supreme-court-battle-looms",
    "timestamp": "2026-02-12T16:20:42Z"
  },
  {
    "title": "Donald Trump’s $10 Billion Lawsuit Against the BBC to Go to Trial Next Year",
    "description": "A Florida judge also denied the BBC’s request to halt the discovery phase of the case\nThe post Donald Trump’s $10 Billion Lawsuit Against the BBC to Go to Trial Next Year appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/journalism/judge-dates-trial-trump-bbc-lawsuit/",
    "timestamp": "2026-02-12T16:17:13Z"
  },
  {
    "title": "California capitulation: CHP finally enforcing English language proficiency roadside",
    "description": "From first flat-out refusing to act on an executive order from President Donald Trump to now threatening the CDLs of non-English speaking drivers, California's made a complete U-turn.",
    "link": "https://www.overdriveonline.com/regulations/article/15816962/california-finally-enforcing-english-language-proficiency-roadside",
    "timestamp": "2026-02-12T16:14:16Z"
  },
  {
    "title": "Immigration once fueled Trump’s 2024 win — now sagging approval tests GOP grip on Congress",
    "description": "President Donald Trump winds down Minnesota immigration operations amid protests and declining approval ratings, raising GOP midterm concerns.",
    "link": "https://www.foxnews.com/politics/immigration-once-fueled-trumps-2024-win-now-sagging-approval-tests-gop-grip-congress",
    "timestamp": "2026-02-12T16:13:41Z"
  },
  {
    "title": "DHS announces the end of its “surge operation” in Minneapolis, but not entirely",
    "description": "The government's siege of the Twin Cities is reportedly coming to an end. \"I have proposed, and President Trump has concurred, that this surge operation conclude,\" border czar Tom Homan announced Thursday. This isn't the first time Department of Homeland Secu…",
    "link": "https://www.theverge.com/policy/878017/dhs-ends-minneapolis-operation-metro-surge-tom-homan",
    "timestamp": "2026-02-12T16:11:31Z"
  },
  {
    "title": "Mika Brzezinski Shouts Into Camera For 4 Minutes Straight Over Tom Homan",
    "description": "\"Morning Joe\" host Mika Brzezinski shouted into the camera on Thursday after border czar Tom Homan announced an end to Operation Metro Surge in Minnesota.",
    "link": "https://dailycaller.com/2026/02/12/mika-brzezinski-rant-tom-homan-minnesota/",
    "timestamp": "2026-02-12T16:10:15Z"
  },
  {
    "title": "US attorney appointed by federal judges in New York abruptly fired by Trump administration",
    "description": "The appointment of a new U.S. attorney by federal judges in upstate New York this week ended abruptly after he was fired by the White House.",
    "link": "https://www.abajournal.com/news/article/us-attorney-appointed-by-federal-judges-in-new-york-abruptly-fired-by-trump-administration",
    "timestamp": "2026-02-12T16:10:00Z"
  },
  {
    "title": "France, Germany explore new ballistic missile, ArianeGroup says",
    "description": "By Cassell Bryan-LowFeb 12 (Reuters) - France and Germany are among European countries that have shown interest in a new land-based ballistic missile proposed by aerospac… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/france-germany-explore-new-ballistic-missile-arianegroup-says",
    "timestamp": "2026-02-12T16:06:19Z"
  },
  {
    "title": "‘You Disgust Me!’ Ron Johnson Absolutely Loses It on Keith Ellison Over Minnesota Dems’ ICE Rhetoric",
    "description": "Sen. Ron Johnson blew his top at Minnesota Attorney General Keith Ellison after the latter smirked as he fumed over rhetoric about ICE operations in the state.\nThe post ‘You Disgust Me!’ Ron Johnson Absolutely Loses It on Keith Ellison Over Minnesota Dems’ IC…",
    "link": "https://www.mediaite.com/media/news/you-disgust-me-ron-johnson-absolutely-loses-it-on-keith-ellison-over-minnesota-dems-ice-rhetoric/",
    "timestamp": "2026-02-12T16:04:16Z"
  }
]