[
  {
    "title": "Denver mayor faces questions over Signal use amid national rise in officials’ use of private messaging app",
    "description": "A group chat -- called \"Strike Force\" -- was created in the encrypted messaging app for the mayor and 14 of his advisers on Jan. 15, in the days before President Donald Trump took office.",
    "link": "https://www.denverpost.com/2025/03/28/denver-mike-johnston-signal-donald-trump-migrants-transparency/",
    "timestamp": "2025-03-28T20:56:38Z"
  },
  {
    "title": "New report reveals how Trump admin will eliminate paper straws: 'Not rocket science'",
    "description": "President Donald Trump’s Executive Order against paper straws that was signed in February is already beginning to “use all levers available\" to cut back on them.",
    "link": "https://www.foxnews.com/politics/new-report-reveals-how-trump-admin-will-eliminate-paper-straws-not-rocket-science",
    "timestamp": "2025-03-28T20:53:12Z"
  },
  {
    "title": "Hillary Clinton Discusses Trump Administration Signal Scandal",
    "description": "Hillary Clinton Discusses Trump Administration Signal Scandallittlethings.com",
    "link": "https://littlethings.com/entertainment/hillary-clinton-calls-trump-administration-signal-group-chat-scandal-dangerous-and-dumb",
    "timestamp": "2025-03-28T20:52:50Z"
  },
  {
    "title": "Elon Musk Accused of 'Blatant Felony' in Wisconsin With Voter Sweepstakes",
    "description": "Musk was accused of a \"blatant felony\" related to his effort to award money to people who vote in the Wisconsin Supreme Court election.",
    "link": "https://www.newsweek.com/elon-musk-wisconsin-supreme-court-2052250",
    "timestamp": "2025-03-28T20:52:37Z"
  },
  {
    "title": "Majority of Democratic Voters: Current Leaders Failing to Combat Trump, Defend Working Class",
    "description": "A large majority of registered Democrats and Independent voters who lean Democratic are frustrated with the party, see no clear leader of it, and want to see elected officials fight harder for working people and against Republican President Donald Trump, acco…",
    "link": "https://www.commondreams.org/news/democratic-party-2025",
    "timestamp": "2025-03-28T20:51:25Z"
  },
  {
    "title": "Federal judge blocks Trump from dismantling Consumer Financial Protection Bureau",
    "description": "The agency was targeted for mass firings before the court’s intervention.",
    "link": "https://www.bostonherald.com/2025/03/28/trump-consumer-agency/",
    "timestamp": "2025-03-28T20:51:17Z"
  },
  {
    "title": "Federal judge blocks Trump from dismantling Consumer Financial Protection Bureau",
    "description": "The agency was targeted for mass firings before the court’s intervention.",
    "link": "https://www.denverpost.com/2025/03/28/trump-consumer-agency/",
    "timestamp": "2025-03-28T20:51:17Z"
  },
  {
    "title": "Wall Street: Joe Biden's Mass Migration Helped Wireless Companies Score 1.6 Million Migrant Subscribers Last Year",
    "description": "President Joe Biden's mass migration policies helped drive 1.6 million new migrant subscribers to wireless companies, Wall Street analysts say in documents exclusively reviewed by Breitbart News.\nThe post Wall Street: Joe Biden’s Mass Migration Helped Wireles…",
    "link": "https://www.breitbart.com/immigration/2025/03/28/bidens-mass-immigration-helped-wireless-companies-score-1-6-million-migrant-subscribers-last-year/",
    "timestamp": "2025-03-28T20:51:16Z"
  },
  {
    "title": "\"Smart Man, Good Friend Of Mine\": Trump Praises PM Modi",
    "description": "US President Donald Trump on Friday (local time) expressed optimism about the ongoing India-US tariff talks and praised Prime Minister Narendra Modi&#039;s leadership, referring to him as a &quot;very smart man&quot; and a &quot;great friend.&quot;",
    "link": "https://www.ndtv.com/india-news/smart-man-good-friend-of-mine-donald-trump-praises-pm-modi-8036003",
    "timestamp": "2025-03-28T20:51:11Z"
  },
  {
    "title": "The News Roundup For March 28, 2025",
    "description": "This week the Atlantic published messages shared between national security officials on a Signal group chat laying out plans for U.S airstrikes in Yemen. It appears that National Security Advisor Mike Waltz added <em>The Atlantic </em>Editor-in-Chief Jeffrey …",
    "link": "https://www.npr.org/2025/03/28/1241388979/1a-nru-03-28-2025",
    "timestamp": "2025-03-28T20:50:23Z"
  },
  {
    "title": "What is the Smithsonian, and why is President Trump unhappy with it? (Associated Press)",
    "description": "Associated Press:\nWhat is the Smithsonian, and why is President Trump unhappy with it?  —  President Donald Trump's executive order titled “Restoring Truth and Sanity to American History” targets the Smithsonian Institution — which has, he contends, “come und…",
    "link": "https://www.memeorandum.com/250328/p107",
    "timestamp": "2025-03-28T20:50:01Z"
  },
  {
    "title": "Federal judge blocks Trump administration from fast-tracking deportations",
    "description": "U.S. District Judge Brian Murphy in Boston issued a nationwide temporary restraining order designed to protect migrants subject to final orders of removal.",
    "link": "https://www.nbcnews.com/news/us-news/federal-judge-blocks-trump-administration-fast-tracking-deportations-rcna198654",
    "timestamp": "2025-03-28T20:49:46Z"
  },
  {
    "title": "Social Security Changes to Impact Republican States the Most",
    "description": "The SSA said it would end phone identity verification services on March 31 but has postponed the change to April 14.",
    "link": "https://www.newsweek.com/social-security-changes-impact-republican-states-most-2052211",
    "timestamp": "2025-03-28T20:49:33Z"
  },
  {
    "title": "In Greenland, JD Vance tries to make the case for a U.S. takeover",
    "description": "Vice President JD Vance and second lady Usha Vance touched down Friday in Greenland for a daylong visit to the U.S. Space Force base in Pituffik.",
    "link": "https://www.msnbc.com/top-stories/latest/greenland-jd-vance-trip-usha-denmark-trump-rcna198599",
    "timestamp": "2025-03-28T20:49:22Z"
  },
  {
    "title": "German foreign minister calls for iPhone update tax",
    "description": "German Foreign Minister Annalena Baerbock has proposed a fee on iPhone software updates in response to new US tariffs Read Full Article at RT.com",
    "link": "https://www.rt.com/business/614924-germany-iphone-tax-us-tariffs/",
    "timestamp": "2025-03-28T20:49:01Z"
  },
  {
    "title": "Miyazaki Fans Sure Are Pissed About ChatGPT’s Studio Ghibli AI Slop",
    "description": "OpenAI's ChatGPT has an image generator that creates Studio Ghibli style memes, but fans of animator Hayao Miyazaki are protective of his work",
    "link": "http://www.rollingstone.com/culture/culture-news/miyazaki-chatgpt-ai-slop-1235305906/",
    "timestamp": "2025-03-28T20:47:12Z"
  },
  {
    "title": "Trump pardons Nikola founder convicted of fraud",
    "description": "Nikola founder Trevor Milton announced Thursday on social media that he had been fully pardoned by President Donald Trump. \"Today I was issued a full and unconditional pardon by @realdonaldtrump himself. He called me personally to tell me,\" Milton noted. The …",
    "link": "https://freerepublic.com/focus/f-chat/4307381/posts",
    "timestamp": "2025-03-28T20:46:39Z"
  },
  {
    "title": "Inside Trump's shock decision to pull the plug on Elise Stefanik's nomination",
    "description": "The move came amid growing anxiety about the House GOP’s narrow margins and a Florida special election that’s been more competitive than expected.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trumps-shock-decision-pull-plug-elise-stefaniks-nomination-rcna198632",
    "timestamp": "2025-03-28T20:45:22Z"
  },
  {
    "title": "Taxpayer-funded staffers for Ron DeSantis solicit lobbyist cash as his wife considers a 2026 run",
    "description": "TALLAHASSEE, Fla. — Taxpayer-funded staffers in Florida Gov.",
    "link": "https://www.nbcnews.com/politics/elections/ron-desantis-lobbyist-fundraising-wifes-governor-campaign-rcna198380",
    "timestamp": "2025-03-28T20:45:00Z"
  },
  {
    "title": "Pro-Life Groups Rally to Urge Republicans to Axe Funding for Abortion Industry Through Budget Reconciliation",
    "description": "Pro-life groups are urging Republicans to use their trifecta to defund the abortion industry, including Planned Parenthood, through budget reconciliation.\nThe post Pro-Life Groups Rally to Urge Republicans to Axe Funding for Abortion Industry Through Budget R…",
    "link": "https://www.breitbart.com/politics/2025/03/28/pro-life-groups-rally-to-urge-republicans-to-axe-funding-for-abortion-industry-through-budget-reconciliation/",
    "timestamp": "2025-03-28T20:44:48Z"
  },
  {
    "title": "Carney: Trump policies may boost US inflation",
    "description": "Canadian Prime Minister Carney on Friday said that US President Donald Trump \"respected Canada's sovereignty today, both in his private and public comments\" after a phone call with the American leader...",
    "link": "https://biztoc.com/x/cd16d8629ced4768",
    "timestamp": "2025-03-28T20:44:43Z"
  },
  {
    "title": "WATCH: Former Trump lawyer Alina Habba sworn in as interim U.S. attorney for New Jersey",
    "description": "President's Trump's former defense attorney has been sworn in as the new top federal prosecutor in New Jersey.",
    "link": "https://www.pbs.org/newshour/politics/watch-former-trump-lawyer-alina-habba-sworn-in-as-interim-u-s-attorney-for-new-jersey",
    "timestamp": "2025-03-28T20:43:01Z"
  },
  {
    "title": "Trump says US will help after Myanmar quake",
    "description": "WASHINGTON: President Donald Trump on Friday (Mar 28) vowed the United States would assist Myanmar after it was hit by a huge earthquake, following a rare plea for aid by the Southeast Asian nation's junta.",
    "link": "https://www.channelnewsasia.com/world/donald-trump-says-us-will-aid-myanmar-earthquak-5031521",
    "timestamp": "2025-03-28T20:42:03Z"
  },
  {
    "title": "Columbia Activist Mahmoud Khalil's Lawyers Urge Judge To Keep Case In New Jersey",
    "description": "Lawyers for the Trump administration want the case heard in the South, where appellate court judges lean heavily conservative.",
    "link": "https://www.huffpost.com/entry/ap-us-campus-protests-immigration_n_67e70735e4b0b1cf1ccbf2a3",
    "timestamp": "2025-03-28T20:41:58Z"
  },
  {
    "title": "B.C. Premier David Eby walks back emergency powers tariff bill after power grab complaints",
    "description": "Eby says the legislation known as Bill 7 needs appropriate \"safeguards\" after a wave of criticism about potential overreach.",
    "link": "https://www.nationalobserver.com/2025/03/28/news/bc-premier-eby-emergency-powers-tariff-bill-complaints",
    "timestamp": "2025-03-28T20:39:59Z"
  },
  {
    "title": "Trump is making us freer, good riddance to DEI statements and other commentary",
    "description": "“By now, two months into [Donald] Trump’s second term, I had expected to be embarrassed and outraged by our new president,” reports USA Today’s Nicole Russell.",
    "link": "https://nypost.com/2025/03/28/opinion/trump-is-making-us-freer-good-riddance-to-dei-statements-and-other-commentary/",
    "timestamp": "2025-03-28T20:38:39Z"
  },
  {
    "title": "Trump pardoned BitMEX co-founders, White House official says",
    "description": "U.S. President Donald Trump has pardoned the three co-founders of cryptocurrency exchange BitMEX, a White House official said on Friday.CNBC was the first to report earlier in the day that on Thursday, Trump granted pardons to Benjamin Delo, Arthur Hayes and …",
    "link": "https://www.channelnewsasia.com/business/trump-pardoned-bitmex-co-founders-white-house-official-says-5031536",
    "timestamp": "2025-03-28T20:38:35Z"
  },
  {
    "title": "Trump administration seeks Congress approval for USAID reorganisation",
    "description": "The US State Department has also announced staff cuts as it seeks to dismantle the aid agency and absorb its functions.",
    "link": "https://www.aljazeera.com/news/2025/3/28/trump-administration-seeks-congress-approval-for-usaid-reorganisation",
    "timestamp": "2025-03-28T20:38:25Z"
  },
  {
    "title": "Stock Market Ends Week On A Harsh Note As Donald Trump Tariffs, Weak Consumer Data Send Shares Tumbling",
    "description": "Wall Street ended the week with another sharp decline for major stock market indices as investors continued to register concern about Donald Trump’s tariffs and weak consumer sentiment. The Dow Jones Industrial Average, S&P 500 and Nasdaq all declined by betw…",
    "link": "http://deadline.com/2025/03/stock-market-falls-donald-trump-tariffs-weak-consumer-data-1236353569/",
    "timestamp": "2025-03-28T20:36:34Z"
  },
  {
    "title": "WGA East Slams Trump Executive Order To End Collective Bargaining For Many Federal Workers: “Assault On The Entire Labor Movement”",
    "description": "The Writers Guild of America East pulled no punches today in decrying Donald Trump’s executive order to strip many workers of their right to unionize, calling Thursday’s move an “illegal attack on roughly 700,000 federal workers and their unions is an assault…",
    "link": "http://deadline.com/2025/03/trump-executive-order-federal-workers-unions-wga-east-response-1236353621/",
    "timestamp": "2025-03-28T20:36:18Z"
  },
  {
    "title": "Trump's FCC Investigating Disney, ABC for Not Whitewashing Enough?",
    "description": "Continuing a move that screams \"Project 2025,\" POtuS Donald Trump's FCC head lackey Brendan Carr announced that he was following up last month's news that the FCC would be investigating NBCUniversal and Comcast for its diversity, equity, and inclusions polici…",
    "link": "https://bleedingcool.com/tv/trumps-fcc-investigating-disney-abc-for-not-whitewashing-enough/",
    "timestamp": "2025-03-28T20:36:08Z"
  },
  {
    "title": "Denmark in Trump's crosshairs as Vance makes ambitious appeal to Greenland",
    "description": "Vice President Vance looked to appeal to Greenland by urging it to side with the US, not Russia or China, after it seeks independence from Denmark.",
    "link": "https://www.foxnews.com/world/denmark-trumps-crosshairs-vance-makes-ambitious-appeal-greenland",
    "timestamp": "2025-03-28T20:35:01Z"
  },
  {
    "title": "The CDC Buried a Measles Forecast That Stressed the Need for Vaccinations",
    "description": "by Patricia Callahan \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nLeaders at the Centers for Disease Control and Prevention ordered staff th…",
    "link": "https://www.propublica.org/article/measles-vaccine-rfk-cdc-report",
    "timestamp": "2025-03-28T20:35:00Z"
  },
  {
    "title": "Tesla under attack— and Elon Musk says he knows who's behind it",
    "description": "Elon Musk blames political rhetoric for rising attacks on Tesla owners and businesses, targeting individuals spreading anti-Tesla narratives. He accuses Democratic leaders of fueling resentment due to criticism of his role at the department of government effi…",
    "link": "https://timesofindia.indiatimes.com/world/us/tesla-under-attack-and-elon-musk-says-he-knows-whos-behind-it/articleshow/119670501.cms",
    "timestamp": "2025-03-28T20:34:55Z"
  },
  {
    "title": "Trump Pardons Founder of Electric Vehicle Start-Up Nikola, Trevor Milton",
    "description": "Trevor Milton, the founder of electric vehicle start-up Nikola who was sentenced to prison last year, was pardoned by Donald Trump late on Thursday, the White House confirmed on Friday. The pardon of Milton, who was sentenced to four years in prison for exagg…",
    "link": "https://slashdot.org/submission/17334663/trump-pardons-founder-of-electric-vehicle-start-up-nikola-trevor-milton",
    "timestamp": "2025-03-28T20:34:28Z"
  },
  {
    "title": "'You have a great prime minister': Trump praises 'very smart man' PM Modi amidst trade tensions",
    "description": "President Trump praised Prime Minister Modi as a smart leader and great friend while criticizing India's high import tariffs. Trump emphasized progress in trade talks and India's commitment to lower tariffs, significant energy purchases, defense deals, and re…",
    "link": "https://timesofindia.indiatimes.com/world/us/you-have-a-great-prime-minister-trump-praises-very-smart-man-pm-modi-amidst-trade-tensions/articleshow/119671847.cms",
    "timestamp": "2025-03-28T20:34:21Z"
  },
  {
    "title": "Studio Ghibli has few legal options to stop OpenAI from ripping off its style",
    "description": "OpenAI lets ChatGPT users generate images in the style of Studio Ghibli. The anime company could have a tough time if it makes a copyright claim.",
    "link": "https://www.businessinsider.com/studio-ghibli-openai-chatgpt-image-feature-copyright-law-2025-3",
    "timestamp": "2025-03-28T20:33:49Z"
  },
  {
    "title": "Illegal Migrants Hit Exit As Trump Rolls Up Biden’s Welcome Mat",
    "description": "Faced with an administration focused on immigration enforcement and the possibility of being sent to a mega-prison, many illegal migrants are self-deporting.",
    "link": "https://dailycaller.com/2025/03/28/illegal-migrants-open-to-self-deportation/",
    "timestamp": "2025-03-28T20:33:24Z"
  },
  {
    "title": "WATCH: Vance speaks to U.S. troops during Greenland visit",
    "description": "U.S. Vice President JD Vance said Friday that Denmark has \"underinvested\" in Greenland’s security and demanded that Denmark change its approach as President Donald Trump continues to talk of taking over the Danish territory.",
    "link": "https://biztoc.com/x/a9da301400ef64aa",
    "timestamp": "2025-03-28T20:33:21Z"
  },
  {
    "title": "Elon Musk's Wisconsin Election Stunt Faces Legal Threat",
    "description": "The state's attorney general said he intends \"to take legal action today to seek a court order to stop this from happening.”",
    "link": "https://www.huffpost.com/entry/musk-wisconsin_n_67e6f7f6e4b0b1cf1ccbef91",
    "timestamp": "2025-03-28T20:33:14Z"
  },
  {
    "title": "Tiger Woods’ Ex Mistress Engaged Days After Vanessa Trump Hard Launch",
    "description": "Love is in the fairway.\nRachel Uchitel, who made headlines in 2009 as one of then-married Tiger Woods’ mistresses, recently announced her engagement to security businessman Dan Donovan.\nIn a March...",
    "link": "https://www.eonline.com/news/1415450/tiger-woods-former-mistress-rachel-uchitel-engaged",
    "timestamp": "2025-03-28T20:33:02Z"
  },
  {
    "title": "What is the Smithsonian, and why is President Trump unhappy with it?",
    "description": "President Donald Trump’s executive order titled “Restoring Truth and Sanity to American History” targets the Smithsonian Institution — which has, he contends, “come under the influence of a divisive, race-centered ideology.”",
    "link": "https://www.today.com/news/smithsonian-president-trump-targeting-rcna198640",
    "timestamp": "2025-03-28T20:32:27Z"
  },
  {
    "title": "JD Vance slams Denmark during visit to U.S. space base in Greenland",
    "description": "U.S. Vice-President JD Vance slammed Denmark during a visit to Greenland on Friday, saying it has not done a good job in keeping the semi-autonomous Danish territory and its people safe from incursions by China and Russia, while pledging respect for Greenland…",
    "link": "https://www.cbc.ca/news/world/vance-denmark-greenland-1.7496477",
    "timestamp": "2025-03-28T20:32:20Z"
  },
  {
    "title": "'Upended Supreme Court precedent': Appeals court judges slams colleagues' pro-Trump ruling",
    "description": "A Washington, D.C. federal appeals court has cleared the way for President Donald Trump to fire members of the National Labor Relations Board and Merit Systems Protection Board, Politico legal reporter Kyle Cheney said on social media Friday. The NLRB's prima…",
    "link": "https://www.rawstory.com/trump-firings-2671628583/",
    "timestamp": "2025-03-28T20:31:58Z"
  },
  {
    "title": "The Irish Times view on the Irish economy: preparing for the end of the boom",
    "description": "There will be budgetary consequences from Trump’s tariffs and tough decisions are on the way for the Government",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/03/28/the-irish-times-view-on-the-irish-economy-preparing-for-the-end-of-the-boom/",
    "timestamp": "2025-03-28T20:30:00Z"
  },
  {
    "title": "Billionaire media mogul Ric Elias sells Palm Beach mansion for $73M",
    "description": "Billionaire Red Ventures co-founder and CEO Ric Elias sold his oceanfront Palm Beach mansion for $73 million in an off-market deal. 530 South Ocean Boulevard LLC, the Florida entity managed by Elias’ wife Brenda Elias, sold the house at 530 South Ocean Boulev…",
    "link": "https://therealdeal.com/miami/2025/03/28/billionaire-ric-elias-sells-palm-beach-mansion-for-73m/",
    "timestamp": "2025-03-28T20:30:00Z"
  },
  {
    "title": "Greenland residents address 'concerning' JD Vance visit after Donald Trump vows to 'have' the country",
    "description": "It's not just the weather in Greenland that's 'cold as s**t' for Vance",
    "link": "https://www.ladbible.com/news/world-news/greenland-jd-vance-donald-trump-response-residents-676019-20250328",
    "timestamp": "2025-03-28T20:29:33Z"
  },
  {
    "title": "Elon Musk Promises ‘More Social Security’ In Dubious Charm Offensive",
    "description": "The Trump administration is making rapid changes to the agency's phone procedures to stamp out a relatively small amount of fraud.",
    "link": "https://www.huffpost.com/entry/elon-musk-doge-social-security-phone-service_n_67e6ef19e4b09b17a6b2ecb5",
    "timestamp": "2025-03-28T20:28:51Z"
  },
  {
    "title": "WATCH: Vance speaks to U.S. troops during Greenland visit",
    "description": "U.S. Vice President JD Vance said Friday that Denmark has \"underinvested\" in Greenland’s security and demanded that Denmark change its approach as President Donald Trump continues to talk of taking over the Danish territory.",
    "link": "https://www.pbs.org/newshour/politics/watch-vance-speaks-to-u-s-troops-during-greenland-visit",
    "timestamp": "2025-03-28T20:25:51Z"
  },
  {
    "title": "Tiger Woods’ ex Rachel Uchitel announces engagement days after golfer confirms Vanessa Trump romance",
    "description": "Woods and Vanessa Trump went public with their relationship on Sunday",
    "link": "https://www.the-independent.com/life-style/rachel-uchitel-engaged-tiger-woods-b2723571.html",
    "timestamp": "2025-03-28T20:25:41Z"
  },
  {
    "title": "MAGA fans swallow bitter pill: Federal employee regrets voting for Donald Trump after being fired by DOGE",
    "description": "A former Trump supporter who lost her job due to the Department of Government Efficiency's (DOGE) cuts regrets her vote. Despite positive reviews, Jennifer Piggott and other probationary employees were laid off, sparking widespread reconsideration among Trump…",
    "link": "https://economictimes.indiatimes.com/news/international/us/maga-fans-swallow-bitter-pill-federal-employee-regrets-voting-for-donald-trump-after-being-fired-by-doge/articleshow/119672720.cms",
    "timestamp": "2025-03-28T20:24:00Z"
  },
  {
    "title": "‘Huge Concern’: Top Youth Pollster Fears Dems Losing Grip On Key Generation Of Voters",
    "description": "Harvard Kennedy School's Institute of Politics Polling Director Jonathan Della Volpe expressed worry during a Friday podcast that Democrats may be losing ground with younger voters.",
    "link": "https://dailycaller.com/2025/03/28/huge-concern-top-youth-pollster-fears-dems-losing-grip-on-key-generation-of-voters/",
    "timestamp": "2025-03-28T20:23:12Z"
  },
  {
    "title": "Trump admin’s first oil and gas-lease sales nets nearly $40 million for U.S. coffers",
    "description": "Interior Secretary Doug Burgum lauded millions in federal windfall from sales of oil and gas leases in Trump's first three months.",
    "link": "https://www.foxnews.com/politics/trump-admins-first-oil-gas-lease-sales-nets-nearly-40-million-u-s-coffers",
    "timestamp": "2025-03-28T20:22:45Z"
  },
  {
    "title": "Trump pardons Nikola founder Trevor Milton, who defrauded investors",
    "description": "Trevor Milton, the founder of electric vehicle start-up Nikola who was sentenced to prison last year for fraud, was pardoned by President Donald Trump, the White House confirmed Friday.\nThe pardon of Milton, who was sentenced to four years in prison for exagg…",
    "link": "https://biztoc.com/x/989bb996b29aa652",
    "timestamp": "2025-03-28T20:22:07Z"
  },
  {
    "title": "FCC Chairman Orders DEI Investigation Into Disney, ABC",
    "description": "The head of the Federal Communications Commission ordered an investigation into Walt Disney Co. and its ABC network over their diversity, equity and inclusion practices, broadening his examination of media and telecom companies for perceived discriminatory bi…",
    "link": "https://www.livemint.com/companies/news/fcc-chairman-orders-dei-investigation-into-disney-abc-11743193311192.html",
    "timestamp": "2025-03-28T20:21:50Z"
  },
  {
    "title": "'Fiasco': Analyst says MAGA loyalist paid a steep price for 'Trump's mistakes'",
    "description": "MAGA Rep. Elise Stefanik (R-NY) learned a tough lesson this week about President Donald Trump's political fickleness after completely altering her career path to become his ambassador to the United Nations.According to a new opinion piece for MSNBC, \"Joining …",
    "link": "https://www.rawstory.com/team-player-elise-stefanik-pays-a-steep-price-for-trump-loyalty/",
    "timestamp": "2025-03-28T20:21:28Z"
  },
  {
    "title": "FCC is investigating Disney and ABC for DEI initiatives",
    "description": "The Federal Communications Commission has alerted the Walt Disney Company and its ABC unit that it will begin an investigation into the diversity, equity and inclusion efforts at the media giant.",
    "link": "https://www.nbcnews.com/business/business-news/fcc-investigating-disney-abc-dei-initiatives-rcna198647",
    "timestamp": "2025-03-28T20:21:28Z"
  },
  {
    "title": "Poilievre’s 1950s fantasy draws cheers in Surrey",
    "description": "Poilievre promises his supporters an instant fix, a walk back in time all the way to the fifties, a decade of prosperity when middle-class home ownership was a given, drugs were not killing so many and we could burn hydrocarbons with impunity, blissfully igno…",
    "link": "https://www.nationalobserver.com/2025/03/28/opinion/poilievre-carbon-tax-climate-pipelines",
    "timestamp": "2025-03-28T20:21:07Z"
  },
  {
    "title": "Trump was supposed to unlock IPO market, but CoreWeave debut reflects ongoing skepticism",
    "description": "After pricing its IPO below the expected range, CoreWeave's stock didn't do much in its debut on Friday, reflecting concerns about the macro environment.",
    "link": "https://www.cnbc.com/2025/03/28/trump-was-supposed-to-unlock-ipos-coreweave-debut-reflects-skepticism.html",
    "timestamp": "2025-03-28T20:19:42Z"
  },
  {
    "title": "Putin Suggests China and North Korea Join Ukraine Ceasefire Talks",
    "description": "Russian President Vladimir Putin says China and North Korea should be included in ceasefire negotiations for the war in Ukraine.\nThe post Putin Suggests China and North Korea Join Ukraine Ceasefire Talks appeared first on Breitbart.",
    "link": "https://www.breitbart.com/asia/2025/03/28/putin-suggests-china-north-korea-join-ukraine-ceasefire-talks/",
    "timestamp": "2025-03-28T20:19:17Z"
  },
  {
    "title": "Elon Musk’s DOGE role draws effort to force Tesla to close Missouri dealerships",
    "description": "Initiative petitions filed Friday would require Tesla to use independent franchises to market its cars or shutdown St. Louis and Kansas City showrooms.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_efb99765-dd66-42e7-8d93-83d0a23a1f7b.html",
    "timestamp": "2025-03-28T20:19:00Z"
  },
  {
    "title": "WATCH: Khalil’s lawyers speak as judge weighs whether to move jurisdiction for case",
    "description": "Lawyers for Mahmoud Khalil, the Columbia University graduate student facing deportation for his role in pro-Palestinian campus protests, urged a federal judge on Friday to move their client’s case out of Louisiana, describing his imprisonment there as a “Kafk…",
    "link": "https://www.pbs.org/newshour/politics/watch-khalils-lawyers-speak-as-judge-weighs-whether-to-move-jurisdiction-for-case",
    "timestamp": "2025-03-28T20:18:39Z"
  },
  {
    "title": "BREAKING: Judge Boasberg Sides with Criminal Gang Members, Extends His Block on Alien Enemies Act Deportations",
    "description": "Judge James Boasberg on Friday sided with criminal gang members and extended his temporary restraining order (TRO) in the Alien Enemies Act case until April 12. The TRO was set to expire on March 29. “On March 15, 2025, this Court issued two Temporary Restrai…",
    "link": "https://freerepublic.com/focus/f-news/4307377/posts",
    "timestamp": "2025-03-28T20:17:27Z"
  },
  {
    "title": "Trump Has Found A Way To Punish Blue States — And Kids Are In The Crosshairs",
    "description": "It's a move that fits into his agenda from multiple angles.",
    "link": "https://www.huffpost.com/entry/trump-education-punish-blue-states_n_67e6db87e4b043ff63a71782",
    "timestamp": "2025-03-28T20:17:00Z"
  },
  {
    "title": "Space travel gets a boost as Axiom secures investment, aims to send more passengers to orbit",
    "description": "Axiom Space, which flies both private and government missions, secured “hundreds of millions” in additional investment this week at a $2 billion valuation.",
    "link": "https://nypost.com/2025/03/28/business/axiom-space-to-send-more-passengers-to-orbit/",
    "timestamp": "2025-03-28T20:15:10Z"
  },
  {
    "title": "Biden-Era ‘Lawfare’ Target Says He’s Now Running ‘Most Important Agency’ You’ve ‘Never Heard Of’",
    "description": "A former target of the Biden administration's \"lawfare\" says he and President Donald Trump have already made profound changes to the federal bureaucracy.",
    "link": "https://dailycaller.com/2025/03/28/biden-era-lawfare-target-says-hes-now-running-most-important-agency-youve-never-heard-of/",
    "timestamp": "2025-03-28T20:13:32Z"
  },
  {
    "title": "Trump turns to Supreme Court as judges push back on the administration's view of presidential power",
    "description": "The Justice Department submitted multiple filings with the Supreme Court that accused federal judges of abusing their constitutional powers, while lower courts criticized the Trump administration’s expansive view of presidential power.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-supreme-court-appeals-judges-presidential-power-rcna198390",
    "timestamp": "2025-03-28T20:13:30Z"
  },
  {
    "title": "Trump officials may have texted classified info to group chat with journalist. Here's the complete breakdown",
    "description": "Here's what we know about whether officials shared classified intel in leaked group chat that included the editor-in-chief of The Atlantic.",
    "link": "https://www.snopes.com//news/2025/03/28/trump-group-chat-signal/",
    "timestamp": "2025-03-28T20:13:00Z"
  },
  {
    "title": "Pam Bondi Aims To Revive a Moribund Legal Process for Restoring Gun Rights",
    "description": "Although President Donald Trump has been entrusted with control of the nation's vast military might, including its nuclear weapons, he is not allowed to own a gun. He lost that right as a result of 34 state felony convictions involving falsification of busine…",
    "link": "https://biztoc.com/x/ff423e9230501d13",
    "timestamp": "2025-03-28T20:11:19Z"
  },
  {
    "title": "Canada warns Trump on tariffs: Retaliation is coming April 2 | CNN Business",
    "description": "Canadian Prime Minister Mark Carney told President Donald Trump Wednesday that his nation will retaliate against the United States with tariffs of its own if Trump presses forward with his promised levies – potentially escalating what is already developing in…",
    "link": "https://www.cnn.com/2025/03/28/business/canada-tariffs-carney-trump-retaliaton/index.html",
    "timestamp": "2025-03-28T20:11:06Z"
  },
  {
    "title": "Trump administration cancels clean energy grants as it prioritizes fossil fuels",
    "description": "President Donald Trump’s administration is terminating grants for two clean energy projects and roughly 300 others funded by the Department of Energy are in jeopardy as the president prioritizes fossil fuels. The DOE is canceling two awards to a nonprofit cli…",
    "link": "https://financialpost.com/pmn/trump-administration-cancels-clean-energy-grants-as-it-prioritizes-fossil-fuels",
    "timestamp": "2025-03-28T20:09:36Z"
  },
  {
    "title": "Dow Stumbles More Than 700 Points After High Inflation Report—As Tariffs Loom",
    "description": "The Dow is down more than 3,000 points from its December peak as economic anxiety pervades Wall Street.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/28/dow-stumbles-more-than-700-points-after-high-inflation-report-as-tariffs-loom/",
    "timestamp": "2025-03-28T20:08:30Z"
  },
  {
    "title": "US regulators FDIC and CFTC ease crypto restrictions for banks, derivatives",
    "description": "The Federal Deposit Insurance Corporation (FDIC) said in a March 28 letter that institutions under its oversight, including banks, can now engage in crypto-related activities without prior approval. The announcement comes as the Commodity Futures Trading Comm…",
    "link": "https://cointelegraph.com/news/us-regulators-fdic-cftc-ease-crypto-restrictions-banks-derivatives",
    "timestamp": "2025-03-28T20:08:11Z"
  },
  {
    "title": "Netflix’s Ted Sarandos Says Trump Didn’t Pitch Him on Melania Documentary, Continues to Defend Dave Chappelle",
    "description": "Ted Sarandos, co-CEO of Netflix, met with Donald Trump in December at the then-President-elect’s Mar-a-Lago compound in Florida. But according to Sarandos, the two didn’t “talk shop.” Sarandos, speaking Friday at the Paley Center for Media in New York City, s…",
    "link": "https://variety.com/2025/tv/news/netflix-sarandos-melania-trump-documentary-dave-chappelle-1236351028/",
    "timestamp": "2025-03-28T20:08:07Z"
  },
  {
    "title": "MAGA attorney floats extreme ‘deal’ to let immigrants vote from own 'third world hellhole'",
    "description": "A MAGA attorney with deep ties to President Donald Trump floated a compromise with Democrats who he claimed Friday have welcomed millions of immigrants and handed them ballots in hopes of bolstering voting numbersHe suggested their ballots can now be mailed t…",
    "link": "https://www.rawstory.com/mike-davis-2671628511/",
    "timestamp": "2025-03-28T20:06:54Z"
  },
  {
    "title": "Appeals court rules Trump can fire board members of independent labor agencies",
    "description": "An appeals court has ruled that President Donald Trump can fire two board members of independent labor agencies from their respective posts in the federal government",
    "link": "https://abcnews.go.com/US/wireStory/appeals-court-rules-trump-fire-board-members-independent-120275443",
    "timestamp": "2025-03-28T20:06:31Z"
  },
  {
    "title": "Vance Predicts Greenland ‘Ultimately Will Partner’ With U.S.—Without Military Intervention",
    "description": "Vance visited Greenland as President Donald Trump has repeatedly expressed a desire to take ownership of the territory.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/28/vance-predicts-greenland-ultimately-will-partner-with-us-without-military-intervention/",
    "timestamp": "2025-03-28T20:06:28Z"
  },
  {
    "title": "Critics Bring Receipts After Musk Claims They 'Can't Point To Any' Controversial DOGE Cuts",
    "description": "Elon Musk on Thursday decried pushback against his Department of Government Efficiency, prompting users on his own social media platform to enlighten him.",
    "link": "https://www.huffpost.com/entry/critics-bring-receipts-after-musk-claims-they-cant-point-to-any-controversial-doge-cuts_n_67e6d3e6e4b0f69ef1d3949f",
    "timestamp": "2025-03-28T20:06:14Z"
  },
  {
    "title": "Musk's AI Chatbot Defies its Maker, Declaring Million-Dollar Wisconsin Voter Giveaway 'Likely Violates Federal Law'",
    "description": "Grok, an AI chatbot launched by Elon Musk's xAI, has gone against the CEO by stating that his million-dollar giveaways in Wisconsin violate federal law.",
    "link": "https://www.ibtimes.com/musks-ai-chatbot-defies-its-maker-declaring-million-dollar-wisconsin-voter-giveaway-likely-3768044",
    "timestamp": "2025-03-28T20:05:28Z"
  },
  {
    "title": "Ted Sarandos Says POTUS Never Pitched Melania Trump Doc When They Met Over Dinner For First Time — We “Didn’t Talk Any Shop”",
    "description": "Netflix co-CEO Ted Sarandos said he met President Trump for the first time at “a nice long dinner together” at Mar-a-Lago late last year. “It was interesting,” he said. In a Q&A at a Paley Center event in NYC moderated by Semafor’s Ben Smith, the executive ad…",
    "link": "http://deadline.com/2025/03/netflix-ted-sarandos-donald-trump-melania-trump-documentary-1236353536/",
    "timestamp": "2025-03-28T20:04:34Z"
  },
  {
    "title": "President Trump Pardons Arthur Hayes, 2 Other BitMEX Co-Founders",
    "description": "Arthur Hayes, the former CEO of BitMEX, pleaded guilty to one count of violating the Bank Secrecy Act and was sentenced to two years probation.",
    "link": "https://www.coindesk.com/policy/2025/03/28/president-trump-pardons-arthur-hayes-2-other-bitmex-co-founders-cnbc",
    "timestamp": "2025-03-28T20:04:27Z"
  },
  {
    "title": "Trump cautions 'bad things' in store if Iran won't negotiate as Islamic Republic touts 'Missile City'",
    "description": "New video shows two Iranian military leaders touring an underground facility dubbed 'Missile City' and meant as a threat to the West after President Donald Trump imposed sanctions on Tehran.",
    "link": "https://www.foxnews.com/politics/trump-bad-things-iran-missile-city-bombs-us",
    "timestamp": "2025-03-28T20:01:57Z"
  },
  {
    "title": "Pay for Play: Al Sharpton Books Labor Bosses Who Pour Millions Into His Nonprofit on MSNBC Show",
    "description": "Rev. Al Sharpton’s National Action Network has received millions of dollars from prominent labor unions whose bosses frequently appear on the controversial activist’s MSNBC show, frequently without any disclosure about their lucrative financial ties.\nThe post…",
    "link": "https://freebeacon.com/democrats/pay-for-play-al-sharpton-books-labor-bosses-who-pour-millions-into-his-nonprofit-on-msnbc-show/",
    "timestamp": "2025-03-28T20:00:59Z"
  },
  {
    "title": "Imprisoned FTX Founder Sam Bankman-Fried Moved From New York To Transfer Facility in Oklahoma",
    "description": "Imprisoned FTX founder Sam Bankman-Fried has been on the move. The former crypto executive was previously incarcerated in Brooklyn’s Metropolitan Detention Center, but Federal Bureau of Prisons (FBOP) data indicates he now resides at FTC Oklahoma City, a tran…",
    "link": "https://dailyhodl.com/2025/03/28/imprisoned-ftx-founder-sam-bankman-fried-moved-from-new-york-to-transfer-facility-in-oklahoma/",
    "timestamp": "2025-03-28T20:00:24Z"
  },
  {
    "title": "As physicians, we are outraged by Trump’s policies. You should be too",
    "description": "President Donald Trump dismantling America's public health infrastructure and leaving people vulnerable to deadly diseases ought to make more people angry",
    "link": "https://biztoc.com/x/acee22c32ee05c5d",
    "timestamp": "2025-03-28T20:00:11Z"
  },
  {
    "title": "Senate Democrats to force vote next week on Trump's fentanyl tariffs on Canada",
    "description": "The Senate is expected to vote Tuesday on a Democratic resolution aimed at blocking President Donald Trump from using the International Emergency Economic Powers Act to impose a 25 percent tariff on Canada, Sens. Tim Kaine (D-Va.) and Amy Klobuchar (D-Minn.) …",
    "link": "https://biztoc.com/x/f27d51cb045ee537",
    "timestamp": "2025-03-28T20:00:09Z"
  },
  {
    "title": "Pam Bondi Aims To Revive a Moribund Legal Process for Restoring Gun Rights",
    "description": "Although President Donald Trump has been entrusted with control of the nation's vast military might, including its nuclear weapons, he is not allowed to",
    "link": "https://reason.com/2025/03/28/pam-bondi-aims-to-revive-a-moribund-legal-process-for-restoring-gun-rights/",
    "timestamp": "2025-03-28T20:00:03Z"
  },
  {
    "title": "Donald Trump Pardons BitMex Co-Founders Arthur Hayes, Benjamin Delo, Samuel Reed",
    "description": "President Donald Trump has pardoned the three co-founders of cryptocurrency exchange BitMEX, who previously pled guilty to federal charges related to money laundering and regulatory violations.\nWhat Happened: CNBC reported on Friday that Arthur Hayes, Benjami…",
    "link": "https://biztoc.com/x/0dc4e61e6e796c28",
    "timestamp": "2025-03-28T19:59:56Z"
  },
  {
    "title": "Oil Slips Despite Weekly Gain",
    "description": "Oil prices dipped on fears that new U.S. tariffs could weaken global energy demand.",
    "link": "https://www.rigzone.com/news/wire/oil_slips_despite_weekly_gain-28-mar-2025-180072-article/",
    "timestamp": "2025-03-28T19:58:23Z"
  },
  {
    "title": "Trump Defends Pardoning One of His Political Donors – Who Was Represented by Pam Bondi’s Brother",
    "description": "Milton and his wife donated more than $1.8 million to a pro-Trump reelection fund the month before November's election.\nThe post Trump Defends Pardoning One of His Political Donors – Who Was Represented by Pam Bondi’s Brother first appeared on Mediaite.",
    "link": "https://www.mediaite.com/crime/trump-defends-pardoning-one-of-his-political-donors-who-was-represented-by-pam-bondis-brother/",
    "timestamp": "2025-03-28T19:58:11Z"
  },
  {
    "title": "Somalia offers US exclusive control of air bases, ports",
    "description": "NAIROBI (Reuters) - Somalia is prepared to offer the United States exclusive control of strategic air bases and ports, its president said in a letter to President Donald Trump seen by Reuters on Friday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/29/somalia-offers-us-exclusive-control-of-air-bases-ports",
    "timestamp": "2025-03-28T19:58:00Z"
  },
  {
    "title": "Appeals court rules Trump can fire board members of independent labor agencies",
    "description": "A divided three-judge panel agreed to lift orders blocking the Trump administration.",
    "link": "https://www.bostonherald.com/2025/03/28/trump-board-members/",
    "timestamp": "2025-03-28T19:57:35Z"
  },
  {
    "title": "Vance Criticizes Denmark as Trump Restates Desire for Greenland (Bloomberg)",
    "description": "Bloomberg:\nVance Criticizes Denmark as Trump Restates Desire for Greenland  —  Vice President JD Vance said that Denmark “hasn't done a good job at keeping Greenland safe” as he toured a military facility in Greenland on Friday afternoon, as President Donald …",
    "link": "https://www.memeorandum.com/250328/p100",
    "timestamp": "2025-03-28T19:55:02Z"
  },
  {
    "title": "JD Vance slams Denmark, urges Greenland to embrace America for security, economy",
    "description": "\"Our argument is with the leadership of Denmark, which has under-invested in Greenland and under-invested in its security,\" Vance said.",
    "link": "https://nypost.com/2025/03/28/us-news/jd-vance-slams-denmark-urges-greenland-to-embrace-america-for-security-economy/",
    "timestamp": "2025-03-28T19:53:40Z"
  },
  {
    "title": "TikTok Ban: Senators Urge Trump to Give Company More Time",
    "description": "President Donald Trump is facing renewed pressure from Senate Democrats to work with Congress to legally extend a fast-approaching deadline that could determine the future of TikTok in the United States. Lawmakers argue that Trump's executive action delaying …",
    "link": "https://freerepublic.com/focus/f-news/4307370/posts",
    "timestamp": "2025-03-28T19:52:51Z"
  }
]