[
  {
    "title": "K-Defense Day: Pimping for the Arms Dealers. Prof. Binoy Kampmark",
    "description": "President Lee Jae-myung made it clear that he did not want South Korea’s own defence industry to miss out on all the fun. \nThe post K-Defense Day: Pimping for the Arms Dealers. Prof. Binoy Kampmark appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/k-defense-day-arms-dealers/5894978",
    "timestamp": "2025-07-14T11:31:56Z"
  },
  {
    "title": "Trump says US will send Patriot missiles to Ukraine, adds that Putin 'talks nice and then he bombs everybody'",
    "description": "President Trump reveals how Russian leader 'talks nice, then bombs everybody' as the U.S. prepares to send Ukraine Patriot missiles under a NATO agreement.",
    "link": "https://www.foxnews.com/politics/trump-says-us-send-patriot-missiles-ukraine-adds-putin-talks-nice-he-bombs-everybody",
    "timestamp": "2025-07-14T11:30:36Z"
  },
  {
    "title": "European trade ministers meet to forge strategy after Trump's surprise 30% tariffs",
    "description": "The EU is America's biggest business partner and the world's largest trading bloc. The U.S. decision will have repercussions for governments, companies and consumers on both sides of the Atlantic.",
    "link": "https://www.npr.org/2025/07/14/g-s1-77458/european-ministers-meet-trump-tariffs",
    "timestamp": "2025-07-14T11:29:52Z"
  },
  {
    "title": "A ‘100% American’ farm workforce? That's delusional",
    "description": "The US agricultural sector faces a workforce dilemma. Despite available jobs and rising wages, few Americans seek farm labor. Government data reveals a reliance on foreign workers, particularly through the H-2A visa program. Efforts to replace them with Ameri…",
    "link": "https://economictimes.indiatimes.com/nri/latest-updates/a-100-american-farm-workforce-thats-delusional/articleshow/122438264.cms",
    "timestamp": "2025-07-14T11:28:16Z"
  },
  {
    "title": "Trump Adviser Says This Is How The President Could 'Certainly' Fire Powell",
    "description": "The Trump administration appears to be laying the groundwork for the Fed chair's removal.",
    "link": "https://www.huffpost.com/entry/trump-adviser-says-trump-could-fire-powell-for-cause_n_6874ca45e4b00af0c5f243f2",
    "timestamp": "2025-07-14T11:28:10Z"
  },
  {
    "title": "From Bitcoin to XRP: Key cryptocurrency terms and what they mean",
    "description": "As Bitcoin's price goes up once again, here's a guide to some of the crypto market's trickiest terms.",
    "link": "https://www.bbc.com/news/articles/cy5w2k5k5ylo",
    "timestamp": "2025-07-14T11:27:58Z"
  },
  {
    "title": "Business Brief: Trump’s changing trade deadlines",
    "description": "Good morning. While the European Union delays retaliatory tariffs against the U.S. in hopes of further negotiations, President Donald Trump also further delayed negotiations with Canada. And maybe we should be prepared for another delay after that. Or just ta…",
    "link": "https://biztoc.com/x/de801f0ae91ab0e0",
    "timestamp": "2025-07-14T11:27:00Z"
  },
  {
    "title": "Every Day is A Roller Coaster",
    "description": "I feel so insanely sad, scared, and worried about our country. The greed for power, devoid of empathy and not too bright, as they strive to become what they believe wealth means, makes me wonder what it means to be an American.  Do I even want to be an Americ…",
    "link": "https://gothamgal.com/2025/07/every-day-is-a-roller-coaster/",
    "timestamp": "2025-07-14T11:26:32Z"
  },
  {
    "title": "Australia hosts largest-ever military exercise with 19 nations, likely to draw Chinese attention",
    "description": "Exercise Talisman Sabre, the largest war-fighting drills in Australia, has commenced, drawing participation from 19 nations. China's surveillance ships are anticipated to monitor the exercises, a recurring event since 2017. Amidst this, Australian Prime Minis…",
    "link": "https://economictimes.indiatimes.com/news/defence/australia-hosts-largest-ever-military-exercise-with-19-nations-likely-to-draw-chinese-attention/articleshow/122438188.cms",
    "timestamp": "2025-07-14T11:26:16Z"
  },
  {
    "title": "Bond: Princess Kate ‘will be there to massage’ Donald Trump’s ego at his state visit",
    "description": "There’s a good news/bad news situation right now for the Princess of Wales. The good news: she was allowed to go outside and wear a tiara for a state banquet, and she performed well during the Macrons’ state visit. There were no major screwups from Kate or th…",
    "link": "https://www.celebitchy.com/930753/bond_princess_kate_will_be_there_to_massage_donald_trumps_ego_at_his_state_visit/",
    "timestamp": "2025-07-14T11:22:31Z"
  },
  {
    "title": "US trade 'almost impossible' in case of Trump tariffs — EU",
    "description": "The European Union's trade chief, Maros Sefcovic, says the bloc hopes for a deal with the US in spite of President Trump's threat of 30% levies. But the clock is ticking as August 1 approaches.",
    "link": "https://www.dw.com/en/us-trade-almost-impossible-in-case-of-trump-tariffs-eu/a-73269677",
    "timestamp": "2025-07-14T11:21:00Z"
  },
  {
    "title": "The FBI edited & manipulated the ‘raw footage’ outside Jeffrey Epstein’s jail cell",
    "description": "The FBI recently decided that there was and is no “Jeffrey Epstein client list” and the long-running investigation into Epstein’s trafficking operation should be closed. Donald Trump is obviously all over the Epstein files and everyone knew that Trump is a se…",
    "link": "https://www.celebitchy.com/930749/the_fbi_edited_manipulated_the_raw_footage_outside_jeffrey_epsteins_jail_cell/",
    "timestamp": "2025-07-14T11:19:27Z"
  },
  {
    "title": "Memo to Iran: The Only Thing That Will Stop Bibi Is a Nuclear Bomb",
    "description": "The Iranians have proven beyond dispute that they are capable of delivering large-warhead hypersonic strikes with high accuracy. And while it remains to be seen how many of these top-shelf missiles they truly possess and what their rate of production …\nThe po…",
    "link": "https://www.globalresearch.ca/iran-stop-bibi-nuclear-bomb/5894957",
    "timestamp": "2025-07-14T11:18:05Z"
  },
  {
    "title": "Sesame Street says the posts its Elmo account made on X while hacked were 'disgusting'",
    "description": "The Elmo account usually posts wholesome content in character on X. The hacker posted profanity and racism.",
    "link": "https://www.businessinsider.com/elmo-hacked-posts-x-sesame-street-response-disgusting-2025-7",
    "timestamp": "2025-07-14T11:17:30Z"
  },
  {
    "title": "'Real panic': Analyst sees White House scrambling as MAGA 'anger' builds",
    "description": "The Jeffrey Epstein matter has prompted more backlash than just about any other scandal in Donald Trump's second presidency, and the White House isn't sure how to turn the page.The president directed his followers to stop discussing the notorious sex traffick…",
    "link": "https://www.rawstory.com/trump-epstein-list/",
    "timestamp": "2025-07-14T11:15:52Z"
  },
  {
    "title": "Rosie O’Donnell Claps Back at Trump’s Threat to Revoke Her Citizenship",
    "description": "Rosie O’Donnell has responded to President Donald Trump’s threat to deport her from the country. Over the weekend, Trump posted on his social media platform, Truth Social, that he was giving “serious consideration” to revoking O’Donnell’s citizenship, claimin…",
    "link": "https://mediatakeout.com/rosie-odonnell-claps-back-at-trumps-threat-to-revoke-her-citizenship/",
    "timestamp": "2025-07-14T11:15:41Z"
  },
  {
    "title": "Antisemitic posts appear on Elmo’s X account after hack | CNN Business",
    "description": "Elmo’s X account was hacked on Sunday, causing the beloved “Sesame Street” character to appear to post expletive-filled antisemitic rants and anti-Trump statements.",
    "link": "https://www.cnn.com/2025/07/14/tech/antisemitic-posts-elmo-x-hack-intl-scli",
    "timestamp": "2025-07-14T11:14:46Z"
  },
  {
    "title": "Trump envoy arrives in Kyiv as US pledges more Patriot missiles to Ukraine",
    "description": "President Donald Trump’s special envoy to Ukraine, retired Lt. Gen. Keith Kellogg, is in Kyiv for talks with Ukrainian officials.",
    "link": "https://www.bostonherald.com/2025/07/14/trump-envoy-ukraine-patriot-missiles/",
    "timestamp": "2025-07-14T11:14:32Z"
  },
  {
    "title": "TikTok CEO requests urgent meeting with Joly on Canadian shutdown order | Globalnews.ca",
    "description": "CEO Shou Chew said the company would soon have to fire more than 350 employees in Canada, stop its direct investment in Canada and cut support for Canadian creators and culture.",
    "link": "http://globalnews.ca/news/11287372/tiktok-ceo-meeting-request-melanie-joly-shutdown-order/",
    "timestamp": "2025-07-14T11:13:32Z"
  },
  {
    "title": "Morgan Stanley Says Tax Bill, Earnings to Boost US Mega Caps",
    "description": "(Bloomberg) -- US mega caps are attractive as they’re likely to be boosted by the fiscal spending bill as well as a robust earnings outlook, according to...",
    "link": "https://finance.yahoo.com/news/morgan-stanley-sees-stock-picking-095109561.html",
    "timestamp": "2025-07-14T11:13:28Z"
  },
  {
    "title": "Morning Bid: Euro shrugs at tariffs, but bonds balk",
    "description": "European markets have given something of a gallic shrug to Donald Trump's tariff threat against the region over the weekend, with investor concern instead...",
    "link": "https://finance.yahoo.com/news/morning-bid-euro-shrugs-tariffs-111304843.html",
    "timestamp": "2025-07-14T11:13:04Z"
  },
  {
    "title": "Australia Hosts Largest-Ever Military Exercise as China Watches",
    "description": "Largest-ever war-fighting drills in Australia, Exercise Talisman Sabre, are underway and expected to attract the attention of Chinese spies.\nThe post Australia Hosts Largest-Ever Military Exercise as China Watches appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/07/14/australia-hosts-largest-ever-military-exercise-as-china-watches/",
    "timestamp": "2025-07-14T11:12:45Z"
  },
  {
    "title": "Trump calls Rosie O’Donnell a ‘threat to humanity,’ threatens to revoke her citizenship",
    "description": "Embed from Getty Images I got stuck in crap traffic on Sunday after visiting with my mother, and it turned out to be all thanks to the president. Felon47 attended the Fifa Club World Cup final, where he was resoundingly booed along with cabinet members AG Pam…",
    "link": "https://www.celebitchy.com/930843/trump_calls_rosie_odonnell_a_threat_to_humanity_threatens_to_revoke_her_citizenship/",
    "timestamp": "2025-07-14T11:11:20Z"
  },
  {
    "title": "ICE detainees go hungry and nicotine poisoning soars in kids: Morning Rundown",
    "description": "As immigration arrests ramp up, detainees are raising concerns about food shortages in ICE facilities.",
    "link": "https://www.nbcnews.com/news/us-news/ice-detainees-hungry-nicotine-poisoning-kids-morning-rundown-rcna218594",
    "timestamp": "2025-07-14T11:09:29Z"
  },
  {
    "title": "In California strawberry fields, immigration raids sow fear",
    "description": "OXNARD, California (Reuters) -Flor, a Mexican migrant, picks strawberries in the agricultural town of Oxnard, but immigration roundups in recent weeks have...",
    "link": "https://ca.news.yahoo.com/california-strawberry-fields-immigration-raids-110605315.html",
    "timestamp": "2025-07-14T11:06:05Z"
  },
  {
    "title": "US allies join forces against Washington on trade",
    "description": "The White House’s renewed trade threats are driving American allies to join forces against Washington, weeks before US tariffs are set to ramp up.\nUS President Donald Trump threatened 30% tariffs against the European Union and Mexico over the weekend, upendin…",
    "link": "https://biztoc.com/x/2d2d86cf1a26ace2",
    "timestamp": "2025-07-14T11:04:56Z"
  },
  {
    "title": "Oil rises 1% with tariffs, Trump's Russia statement in focus",
    "description": "The prices of crude oil increased by more than 1% on Monday after United States President Donald Trump announced new 30% tariffs on goods from the European Union and Mexico, which European Commissione...",
    "link": "https://biztoc.com/x/4f899a42834516a8",
    "timestamp": "2025-07-14T11:04:50Z"
  },
  {
    "title": "Pam Bondi's DOJ to Make Ghislaine Maxwell Decision After Epstein Backlash",
    "description": "Ghislaine Maxwell filed a Supreme Court appeal arguing she should be covered by Jeffrey Epstein's controversial plea deal.",
    "link": "https://www.newsweek.com/pam-bondi-doj-ghislaine-maxwell-jeffrey-epstein-files-2098469",
    "timestamp": "2025-07-14T11:03:00Z"
  },
  {
    "title": "EU/US trade deal is still possible says Paschal Donohoe",
    "description": "Minister says tariffs at high level ‘would be bad for the economic growth of Ireland and would affect our job creation potential’",
    "link": "https://www.irishtimes.com/business/economy/2025/07/14/euus-trade-deal-is-still-possible-says-paschal-donohoe/",
    "timestamp": "2025-07-14T11:02:51Z"
  },
  {
    "title": "Centene faces dimmer future amid federal cuts to Medicaid, Obamacare",
    "description": "The Clayton-based health giant is likely to face increased challenges as federal government tightens Medicaid eligibility and trims subsidies for Obamacare plans.",
    "link": "https://www.stltoday.com/news/local/business/health-care/article_f79deaf3-89a1-44d1-9569-4ac90de24b56.html",
    "timestamp": "2025-07-14T11:02:00Z"
  },
  {
    "title": "Newsom just took a page from Trump. But there’s more to do to keep California a golden state",
    "description": "Governor Newsom reforms California's costly environmental regulations while facing challenges in waste management and housing that continue to drive population decline",
    "link": "https://www.foxnews.com/opinion/newsom-just-took-page-from-trump-theres-more-do-keep-california-golden-state",
    "timestamp": "2025-07-14T11:00:40Z"
  },
  {
    "title": "I’m A FEMA Responder. Here's What No One Is Telling You About The Tragic Texas Floods.",
    "description": "\"In church, I’ve heard people say 'God is in control' to dismiss the crisis – but my faith calls me to speak up, gently but firmly.\"",
    "link": "https://www.huffpost.com/entry/climate-change-trump-texas-flooding-camp-mystic_n_68725afae4b07a168b47affa",
    "timestamp": "2025-07-14T11:00:17Z"
  },
  {
    "title": "Former CNN commentator has 'gut feeling' Trump, Republicans cheated in 2024 and will rig 2026 midterm",
    "description": "Former CNN commentator Angela Rye was one of the latest liberal media figures who have recently suggested the 2024 election and 2026 midterms were rigged.",
    "link": "https://www.foxnews.com/media/former-cnn-commentator-has-gut-feeling-trump-republicans-cheated-2024-rig-2026-midterm",
    "timestamp": "2025-07-14T11:00:02Z"
  },
  {
    "title": "My Friend Was Murdered by Political Violence Too | Opinion",
    "description": "Beyond legislation, members of Congress and lawmakers all the way down to the local level should take care with their words that may make a policy disagreement personal.",
    "link": "https://www.newsweek.com/my-friend-was-murdered-political-violence-too-opinion-2097398",
    "timestamp": "2025-07-14T11:00:01Z"
  },
  {
    "title": "Sexting With Gemini",
    "description": "Why did Google’s supposedly teen-friendly chatbot say it wanted to tie me up?",
    "link": "https://www.theatlantic.com/magazine/archive/2025/08/google-gemini-ai-sexting/683248/",
    "timestamp": "2025-07-14T11:00:00Z"
  },
  {
    "title": "King Charles schedules Trump state visit for when UK parliament is in recess",
    "description": "The monarch, 76, extended an unprecedented invitation to the commander in chief and First Lady Melania Trump earlier this year.",
    "link": "https://nypost.com/2025/07/14/world-news/king-charles-schedules-trump-state-visit-for-when-uk-parliament-is-in-recess/",
    "timestamp": "2025-07-14T10:58:02Z"
  },
  {
    "title": "Obama Tells Democrats to ‘Toughen Up’",
    "description": "Former President Barack Obama issued a call to action for Democrats at a private fundraiser in New Jersey on Friday evening, urging those frustrated by the state of the country under President Donald Trump to",
    "link": "https://politicalwire.com/2025/07/14/obama-tells-democrats-to-toughen-up/",
    "timestamp": "2025-07-14T10:57:22Z"
  },
  {
    "title": "EU Threatens Donald Trump With $24.5 Billion Tariff List",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe European Union has readied a set of retaliatory tariffs totaling 21 billion euros ($24.5 billion) on U.S. goods, officials warned on Monday.\nItaly's Foreign Minister and Deputy Prime Minister Antonio Tajan…",
    "link": "https://biztoc.com/x/d1e36f6c29c41fae",
    "timestamp": "2025-07-14T10:54:01Z"
  },
  {
    "title": "Trump to announce plan to arm Ukraine: Report",
    "description": "US President Donald Trump will reportedly today unveil a plan to arm Ukraine, a sharp pivot after months of trying to draw Russia to the negotiating table.\nThe effort — described by a top Republican as “aggressive” — will include the transfer of offensive wea…",
    "link": "https://biztoc.com/x/c04d1f6f0a9169cf",
    "timestamp": "2025-07-14T10:53:19Z"
  },
  {
    "title": "'This Leads Back To Trump': Fox News Pundit Casts Blame For Epstein 'Cover-Up'",
    "description": "Fox News pundit Lucy Caldwell accused President Donald Trump's administration of \"a cover-up of a cover-up\" on Jeffrey Epstein.\n\n\nDuring a Sunday panel discussion, Caldwell explained why she thought Trump's Epstein scandal was a \"turning point\" for the MAGA m…",
    "link": "https://crooksandliars.com/2025/07/leads-back-trump-fox-news-pundit-casts",
    "timestamp": "2025-07-14T10:50:57Z"
  },
  {
    "title": "Bitcoin tops $120,000 for the first time | CNN Business",
    "description": "Bitcoin crossed the $120,000 level for the first time on Monday, marking a milestone for the world’s largest cryptocurrency as investors bet on long-sought policy wins for the industry this week.",
    "link": "https://www.cnn.com/2025/07/14/business/bitcoin-hits-120000-first-time-intl",
    "timestamp": "2025-07-14T10:50:42Z"
  },
  {
    "title": "Chelsea: Cubana Chiefpriest Celebrates Victory Over PSG After Risky Prediction, \"Cash Out na Water\"",
    "description": "Nightlife king, Cubana Chiefpriest, celebrates Chelsea's 3-0 victory over PSG in the Club World Cup final, sharing his excitement and gain on social media.",
    "link": "https://www.legit.ng/entertainment/celebrities/1664219-chelsea-cubana-chiefpriest-celebrates-victory-psg-risky-prediction-cash-na-water/",
    "timestamp": "2025-07-14T10:47:29Z"
  },
  {
    "title": "Trump Envoy Kellogg Arrives in Kyiv as Trump Says EU Funding More Patriot Missiles for Ukraine",
    "description": "Ukraine will receive more Patriot air-defence missiles from the U.S. but the bill is being picked up by Euro taxpayers instead, Trump said. \nThe post Trump Envoy Kellogg Arrives in Kyiv as Trump Says EU Funding More Patriot Missiles for Ukraine appeared first…",
    "link": "https://www.breitbart.com/europe/2025/07/14/trump-envoy-kellogg-arrives-in-kyiv-as-trump-says-eu-funding-more-patriot-missiles-for-ukraine/",
    "timestamp": "2025-07-14T10:45:51Z"
  },
  {
    "title": "Why Kristi Noem hates FEMA",
    "description": "No, Trump has not given up on the conspiracist mania to kill the popular agency",
    "link": "https://www.salon.com/2025/07/14/why-kristi-noem-hates-fema/",
    "timestamp": "2025-07-14T10:45:49Z"
  },
  {
    "title": "EU Threatens Donald Trump With $24.5 Billion Tariff List",
    "description": "Italy's foreign minister warned that, while he hopes for successful negotiations, the EU will respond resolutely to Trump's latest tariff threat.",
    "link": "https://www.newsweek.com/eu-threatens-donald-trump-24-5-billion-tariffs-2098507",
    "timestamp": "2025-07-14T10:45:18Z"
  },
  {
    "title": "Alarm as chasing bizarre theories becomes major White House time suck: report",
    "description": "Six months into his presidency, Donald Trump has turned the federal government into a conspiracy theory factory, deploying taxpayer resources to investigate debunked claims while his administration grinds to a halt chasing internet fantasies, the Washington P…",
    "link": "https://www.rawstory.com/trump-conspiracy-theories-2673151648/",
    "timestamp": "2025-07-14T10:44:50Z"
  },
  {
    "title": "Boys and Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "More than 20 states have sued President Donald Trump’s administration over billions of dollars in frozen funding for after-school care, summer programs and more.",
    "link": "https://www.clickondetroit.com/business/2025/07/14/boys-and-girls-club-programs-threatened-by-trump-grant-freeze-serve-thousands-of-families/",
    "timestamp": "2025-07-14T10:44:50Z"
  },
  {
    "title": "Fed’s Powell Faces New Line of White House Scrutiny",
    "description": "President Donald Trump and his allies are focusing on Jerome Powell's handling of an expensive renovation of the Federal ...",
    "link": "https://biztoc.com/x/931645cfc15baeac",
    "timestamp": "2025-07-14T10:44:34Z"
  },
  {
    "title": "Boys and Girls Club programs threatened by Trump grant freeze serve thousands of families",
    "description": "Programs that provide summer and after-school programming to more than 1 million students are at risk because of a Trump administration freeze on education grants.",
    "link": "https://www.local10.com/business/2025/07/14/boys-and-girls-club-programs-threatened-by-trump-grant-freeze-serve-thousands-of-families/",
    "timestamp": "2025-07-14T10:44:11Z"
  },
  {
    "title": "Linda Yaccarino’s exit from X is a warning shot for any executive eyeing the corner office",
    "description": "The former X CEO is a cautionary tale of why chasing prestige can destroy the reputation that got you there.",
    "link": "https://fortune.com/article/linda-yaccarino-exit-ceo-elon-musk-cautionary-reputation/",
    "timestamp": "2025-07-14T10:44:03Z"
  },
  {
    "title": "India's inflation cools to 2.1% in June, extending slide to more than 6-year lows",
    "description": null,
    "link": "https://www.cnbc.com/2025/07/14/india-cpi-june-offers-rbi-cut-rates.html",
    "timestamp": "2025-07-14T10:43:41Z"
  },
  {
    "title": "Iran and the Logic of Limited Wars",
    "description": "No one wants a long war, and doing nothing was no longer an option.",
    "link": "http://foreignpolicy.com/2025/07/14/iran-israel-us-trump-nuclear-weapons-attack-strike-war/",
    "timestamp": "2025-07-14T10:43:19Z"
  },
  {
    "title": "EU, South Korea seek U.S. trade deals to soften tariff blow",
    "description": "The European Union and South Korea said on Monday they were working on trade deals with U.S. President Donald Trump that would soften the blow from looming tariffs as Washington threatens to impose hefty duties from August 1.\nTrump stepped up his trade war on…",
    "link": "https://biztoc.com/x/c5a5b193d2411935",
    "timestamp": "2025-07-14T10:42:43Z"
  },
  {
    "title": "American manufacturing is in a 3-year rut despite Biden subsidies and Trump protection",
    "description": "Democrats and Republicans don’t agree on much, but they share a conviction that the government should help American manufacturers, one way or another.\nDemocratic President Joe Biden handed out subsidies to chipmakers and electric vehicle manufacturers. Republ…",
    "link": "https://biztoc.com/x/6641be2d95b7872b",
    "timestamp": "2025-07-14T10:42:26Z"
  },
  {
    "title": "US stock futures lower after Trump announces 30% tariff on Mexico, EU",
    "description": "In This Article:\nU.S. stock futures are lower after President Donald Trump further escalated trade tensions.\nOver the weekend, Trump announced a 30% tariff on goods from the European Union and Mexico, starting Aug. 1. Mexico and EU leaders said they would con…",
    "link": "https://biztoc.com/x/0c7593bfaf884f2c",
    "timestamp": "2025-07-14T10:42:24Z"
  },
  {
    "title": "Russia-US talks to continue despite efforts to derail them – Putin envoy",
    "description": "Dialogue based on mutual respect and economic cooperation are essential for global security and peace, Kirill Dmitriev has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621449-dmitriev-russia-us-dialogue/",
    "timestamp": "2025-07-14T10:42:21Z"
  },
  {
    "title": "FIFA President Tries — and Fails — to Usher Trump Off Stage as Chelsea Celebrates World Cup Win",
    "description": "The FIFA president's attempt to usher Trump off stage failed Sunday night for Chelsea's Club World Cup trophy lift.\nThe post FIFA President Tries — and Fails — to Usher Trump Off Stage as Chelsea Celebrates World Cup Win first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/fifa-president-tries-and-fails-to-usher-trump-off-stage-as-chelsea-celebrates-world-cup-win/",
    "timestamp": "2025-07-14T10:40:41Z"
  },
  {
    "title": "Kremlin says weapons and ammunition deliveries to Ukraine from U.S. are continuing",
    "description": "MOSCOW (Reuters) -The Kremlin said on Monday that the big picture of U.S. President Donald Trump remarks about supplying Patriot air defence missiles to Ukraine was that U.S. arms and ammunition deliveries to Kyiv have continued and are still continuing. Read…",
    "link": "https://www.thestar.com.my/news/world/2025/07/14/kremlin-says-weapons-and-ammunition-deliveries-to-ukraine-from-us-are-continuing",
    "timestamp": "2025-07-14T10:40:00Z"
  },
  {
    "title": "Rupee Ends Lower Against Dollar As Tariff Jitters Weigh",
    "description": "The Indian Rupee closed weaker against the US Dollar on Monday, ending the session at Rs 85.99—down 19 paise from Friday’s closing rate of Rs 85.80. The local currency faced early morning pressure and continued to struggle throughout the day amid a strengthen…",
    "link": "https://www.ndtvprofit.com/markets/rupee-ends-lower-against-dollar-as-tariff-jitters-weigh",
    "timestamp": "2025-07-14T10:38:37Z"
  },
  {
    "title": "American manufacturing is in a 3-year rut despite Biden subsidies and Trump protection",
    "description": "The Labor Department reports that American factories shed 7,000 jobs in June for the second month in a row. Manufacturing employment is on track to drop for the third straight year.",
    "link": "https://fortune.com/2025/07/14/american-manufacturing-3-year-rut-biden-subsidies-trump-protection/",
    "timestamp": "2025-07-14T10:38:00Z"
  },
  {
    "title": "Rupee falls 22 paise to settle at 86.02 against US dollar",
    "description": "At the interbank foreign exchange, the local unit opened at 85.96 and traded in a narrow range of 85.92-86.05 before settling at 86.02 (provisional), down 22 paise from its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-falls-22-paise-to-settle-at-8602-against-us-dollar/article69810459.ece",
    "timestamp": "2025-07-14T10:36:23Z"
  },
  {
    "title": "Trump envoy arrives in Kyiv as US pledges Patriot missiles to Ukraine",
    "description": "US president Donald Trump's special envoy to Ukraine and Russia has arrived in Kyiv, a senior Ukrainian official said, as anticipation grew over possible changes in the Trump administration's policies on the more than three-year war.",
    "link": "https://www.independent.ie/world-news/north-america/trump-envoy-arrives-in-kyiv-as-us-pledges-patriot-missiles-to-ukraine/a1011829767.html",
    "timestamp": "2025-07-14T10:34:10Z"
  },
  {
    "title": "‘One Big Beautiful Lawsuit’ Seeks To Eliminate Gun Control Law",
    "description": "By Fred Lucas, The Daily Signal | July 11, 2025\nSecond Amendment advocates hope what they dubbed the “One Big Beautiful Lawsuit” will strike a final blow to a near century-old gun control law.\nThe “One Big, Beautiful Bill” that President Donald Trump signed o…",
    "link": "https://biztoc.com/x/27c87ba4351fb0b0",
    "timestamp": "2025-07-14T10:31:51Z"
  },
  {
    "title": "Donald Trump to make historic second state visit to the U.K.",
    "description": "No U.S. president has been invited for a second state visit. President Trump's previous UK state visit was in 2019 when he was hosted by the late Queen Elizabeth II.",
    "link": "https://www.wbaltv.com/article/trump-second-state-visit-uk-windsor-castle/65396020",
    "timestamp": "2025-07-14T10:31:35Z"
  },
  {
    "title": "‘High Probability’ Trump Will Meet With China’s Xi This Year, Rubio Says",
    "description": "By Virginia Allen, The Daily Signal | July 11, 2025\nSecretary of State Marco Rubio says it’s “high probability” President Donald Trump will meet with Chinese leader Xi Jinping sometime this year. \nRubio’s comments came Friday, the same day the secretary of st…",
    "link": "https://biztoc.com/x/67eebc8e37ebb359",
    "timestamp": "2025-07-14T10:31:23Z"
  },
  {
    "title": "Dow futures drop 100 points after Trump slaps 30% tariff on Mexico and the EU: Live updates",
    "description": "U.S. equity futures slid early Monday as Wall Street contends with continued tariff risks and second-quarter earnings on deck.\nFutures for the Dow Jones Industrial Average fell 140 points, or 0.3%. S&P 500 futures and Nasdaq 100 futures also dropped 0.3% each…",
    "link": "https://biztoc.com/x/dcc0b1849be3bb33",
    "timestamp": "2025-07-14T10:31:22Z"
  },
  {
    "title": "10 Monday AM Reads",
    "description": "My morning train WFH reads: • How to invest your enormous inheritance: What do you stand to inherit? It still feels like a question from a different age, despite its growing importance today. In 2025 people across the rich world will inherit some $6trn, or ar…",
    "link": "https://ritholtz.com/2025/07/10-monday-am-reads-436/",
    "timestamp": "2025-07-14T10:30:47Z"
  },
  {
    "title": "“Cried every night”: ICE traumatizes a child with leukemia",
    "description": "The Trump administration is going after easy targets, including sick children, to meet its deportation quotas",
    "link": "https://www.salon.com/2025/07/14/cried-every-night-ice-traumatizes-a-child-with-leukemia/",
    "timestamp": "2025-07-14T10:30:26Z"
  },
  {
    "title": "Buffalo Newspaper Guild cancels event after cartoon depicting Trump supporters, Texas floods sparked backlash",
    "description": "The Buffalo Newspaper Guild canceled an event on Thursday after editorial cartoonist Adam Zyglis sparked backlash with a cartoon depicting a Trump supporter in the Texas floods.",
    "link": "https://www.foxnews.com/media/buffalo-newspaper-guild-cancels-event-after-cartoon-depicting-trump-supporters-texas-floods-sparked-backlash",
    "timestamp": "2025-07-14T10:30:12Z"
  },
  {
    "title": "Brics+ could get the globe to work out a better-balanced world order",
    "description": "It’s noisy, disparate and enlargjng. This group may lack geopolitical cohesion, but it can still serve a purpose that its member countries value. It serves India’s ends too. Whatever Trump makes of it, Brics+ is real and relevant.",
    "link": "https://www.livemint.com/opinion/online-views/brics-egypt-saudi-india-xi-jinping-brazil-putin-donald-trump-international-monetary-fund-imf-united-nations-world-bank-11752330114718.html",
    "timestamp": "2025-07-14T10:30:09Z"
  },
  {
    "title": "Kremlin says weapons and ammunition deliveries to Ukraine from U.S. are continuing",
    "description": "MOSCOW (Reuters) -The Kremlin said on Monday that the big picture of U.S. President Donald Trump remarks about supplying Patriot air defence missiles to...",
    "link": "https://www.yahoo.com/news/kremlin-says-weapons-ammunition-deliveries-102817414.html",
    "timestamp": "2025-07-14T10:28:17Z"
  },
  {
    "title": "Rupee falls to over two-week low on corporate dollar bids, outflows",
    "description": "The Indian rupee weakened past the 86 per U.S. dollar mark on Monday to its lowest level in more than two weeks, weighed by corporate dollar demand and equity-related outflows, traders said, amid uncertainty over U.S. trade policies.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-falls-to-over-two-week-low-on-corporate-dollar-bids-outflows/articleshow/122436628.cms",
    "timestamp": "2025-07-14T10:27:05Z"
  },
  {
    "title": "Epstein case fallout continues",
    "description": "A memo on the convicted sex offender has stirred MAGA backlash.",
    "link": "https://www.usatoday.com/story/news/2025/07/14/epstein-trump-fbi-kentucky-shooting-texas-flood-medicaid-chelsea-wimbledon-love-island-princess-kate/85189289007/",
    "timestamp": "2025-07-14T10:26:08Z"
  },
  {
    "title": "Germany Can’t Blame Trump for Slide in Exports, Bundesbank Finds",
    "description": "Germany’s global export position has deteriorated substantially in recent years, according to research by the Bundesbank, which blames structural issues rather than President Donald Trump’s tariff spree.",
    "link": "https://financialpost.com/pmn/business-pmn/germany-cant-blame-trump-for-slide-in-exports-bundesbank-finds",
    "timestamp": "2025-07-14T10:24:54Z"
  },
  {
    "title": "Iran: Tehran ‘will respond to possible reimposition of UN nuclear sanctions’",
    "description": "No date set for meeting with US special envoy, Iranians say\nThe post Iran: Tehran ‘will respond to possible reimposition of UN nuclear sanctions’ appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/07/14/iran-tehran-will-respond-to-possible-reimposition-of-un-nuclear-sanctions/",
    "timestamp": "2025-07-14T10:23:32Z"
  },
  {
    "title": "Sensex down 1,459 points in 4 days, Nifty slides 2%: What's driving the Indian stock market slump? Here are 4 key reasons",
    "description": "Indian stock markets faced a fourth consecutive day of losses. The Sensex fell by 247 points, closing at 82,253.46. Similarly, the Nifty 50 declined by 67.55 points, settling at 25,082.30. However, midcap and smallcap indices showed resilience amidst the broa…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-down-1459-points-in-4-days-nifty-slides-2-whats-driving-the-indian-stock-market-slump-here-are-4-key-reasons/articleshow/122436333.cms",
    "timestamp": "2025-07-14T10:21:52Z"
  },
  {
    "title": "Zelensky talks air defense in 'productive' meeting with US envoy",
    "description": "U.S. envoy Keith Kellogg arrived in Kiev on Monday for defense talks with senior leadership after U.S. President Donald Trump announced new Patriot air defense systems supplies to Ukraine.",
    "link": "https://www.hurriyetdailynews.com/us-envoy-kellogg-arrives-in-ukraine-for-defense-talks-211447",
    "timestamp": "2025-07-14T10:21:00Z"
  },
  {
    "title": "'It's a pigsty': GOP split as Trump threatens D.C. takeover",
    "description": "WASHINGTON — Some Republicans on Capitol Hill are all but daring President Donald Trump to take control of the local government that oversees Washington D.C. Others in the GOP are aghast at the idea, which Trump teased again last week. “We have tremendous pow…",
    "link": "https://www.rawstory.com/raw-investigates/2673092229/",
    "timestamp": "2025-07-14T10:20:48Z"
  },
  {
    "title": "Crypto bills set to advance this week take industry closer to mainstream",
    "description": "The crypto industry will take a step closer to going mainstream this week as a series of industry-friendly bills progress through Congress, paving the way for digital assets to potentially be further integrated into traditional finance. The House of Represent…",
    "link": "https://www.channelnewsasia.com/business/crypto-bills-set-advance-week-take-industry-closer-mainstream-5237246",
    "timestamp": "2025-07-14T10:20:42Z"
  },
  {
    "title": "Mother of slain soldier held by Hamas terrorists for 4K days makes plea to Trump",
    "description": "The family of an Israeli soldier killed by Hamas in 2014 urges President Donald Trump and Saudi leaders to ensure no deal proceeds without the return of all the hostages held in Gaza and her son's remains.",
    "link": "https://www.foxnews.com/world/mother-slain-soldier-held-by-hamas-terrorists-4000-days-makes-plea-trump",
    "timestamp": "2025-07-14T10:19:27Z"
  },
  {
    "title": "DNC Chair Ken Martin lies about lying (support for Mamdani and Global Intifada)",
    "description": "Ken Martin is the Chairman of the Democrat National Committee (DNC). He's the primary fundraiser and spokesman for America’s Democrats. Zohran Mamdani is the Democrat Party’s candidate to be the next Mayor of New York City. Mamdani has been caught cheerleadin…",
    "link": "https://freerepublic.com/focus/f-news/4328571/posts",
    "timestamp": "2025-07-14T10:18:27Z"
  },
  {
    "title": "Eric Trump to headline Bitcoin Asia 2025 conference in Hong Kong",
    "description": "The August event comes as the race for crypto supremacy has intensified, with both Hong Kong and the US moving to legalise stablecoins Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/14/eric-trump-to-headline-bitcoin-asia-2025-conference-in-hong-kong",
    "timestamp": "2025-07-14T10:18:00Z"
  },
  {
    "title": "Trump envoy arrives in Kyiv as president pledges Patriot missiles to Ukraine",
    "description": "U.S. President Donald Trump’s special envoy to Ukraine and Russia, retired Lt.",
    "link": "https://www.nbcnews.com/world/europe/trump-envoy-arrives-kyiv-president-pledges-patriot-missiles-ukraine-rcna218599",
    "timestamp": "2025-07-14T10:17:58Z"
  },
  {
    "title": "Trump admin live updates: Trump, NATO secretary-general to meet at White House",
    "description": "President Donald Trump is scheduled to welcome NATO Secretary-General Mark Rutte to the White House on Monday.",
    "link": "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=123730069",
    "timestamp": "2025-07-14T10:17:02Z"
  },
  {
    "title": "Wall St futures wobble on fresh tariff threats ahead of data, earnings deluge",
    "description": "Over the weekend, Trump announced plans to slap a 30% tariff on most imports from the EU and Mexico starting August 1, adding similar warnings to other...",
    "link": "https://finance.yahoo.com/news/wall-st-futures-wobble-fresh-101649549.html",
    "timestamp": "2025-07-14T10:16:49Z"
  },
  {
    "title": "Explainer-Why Trump's push for a 1% Fed policy rate could spell trouble for US economy",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump says the Federal Reserve should set its benchmark interest rate at 1% to lower government borrowing costs, ...",
    "link": "https://finance.yahoo.com/news/explainer-why-trumps-push-1-101505091.html",
    "timestamp": "2025-07-14T10:15:05Z"
  },
  {
    "title": "World shares are mixed as investors focus on tariffs and earnings",
    "description": "World shares are mixed as investors focus on tariffs and corporate earnings updates",
    "link": "https://abcnews.go.com/Business/wireStory/world-shares-mixed-investors-focus-tariffs-earnings-123729131",
    "timestamp": "2025-07-14T10:14:31Z"
  },
  {
    "title": "US manufacturers are stuck in a rut despite subsidies and protection from Trump",
    "description": "Democratic President Joe Biden handed out subsidies to chipmakers and electric vehicle manufacturers",
    "link": "https://abcnews.go.com/Business/wireStory/us-manufacturers-stuck-rut-despite-subsidies-biden-protection-123730354",
    "timestamp": "2025-07-14T10:14:29Z"
  },
  {
    "title": "New York creates tariff guide for local businesses",
    "description": "The guide will update business owners on programs available to help manage the impact of tariffs",
    "link": "https://www.mynbc5.com/article/state-makes-tariff-resource-guide-for-new-york-businesses/65395113",
    "timestamp": "2025-07-14T10:12:34Z"
  },
  {
    "title": "Trump administration leaves Congress in dark on spending decisions",
    "description": "Cleveland Heights faces after-school program cuts due to held-up federal funds. Superintendent Elizabeth Kirby expresses concern over the missing $860,000 grant. The Trump administration's spending transparency is under scrutiny. Republican Senator Susan Coll…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-leaves-congress-in-dark-on-spending-decisions/articleshow/122436267.cms",
    "timestamp": "2025-07-14T10:12:27Z"
  },
  {
    "title": "Why Trump's push for a 1% Fed policy rate could spell trouble for US economy",
    "description": "President Trump advocated for a 1% Federal Reserve interest rate to lower government borrowing costs, but experts warn this could backfire. Such a low rate, typically a crisis response, could reignite inflation and erode investor confidence, especially with a…",
    "link": "https://economictimes.indiatimes.com/news/international/business/why-trumps-push-for-a-1-fed-policy-rate-could-spell-trouble-for-us-economy/articleshow/122436266.cms",
    "timestamp": "2025-07-14T10:12:21Z"
  },
  {
    "title": "Unusual meeting: Knesset subcommittee to discuss sovereignty in Judea and Samaria",
    "description": "Representatives from key Israeli ministries to present practical implications of applying sovereignty in Judea and Samaria at special Knesset subcommittee meeting.",
    "link": "https://www.israelnationalnews.com/news/411636",
    "timestamp": "2025-07-14T10:10:52Z"
  },
  {
    "title": "Trade Chief Issues Trump Tariff Warning: 'Almost Impossible'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe European Union's (EU) trade chief Maros Sefcovic warned trading between the 27-member bloc and the U.S. would become \"almost impossible\" if President Donald Trump's 30 percent tariff takes effect on August…",
    "link": "https://biztoc.com/x/9f39a1e54ff8ac17",
    "timestamp": "2025-07-14T10:09:20Z"
  },
  {
    "title": "Trump Accepts King Charles' Invite For Rare Second State Visit To UK—Amid Political Backlash",
    "description": "President Donald Trump has accepted an invitation from King Charles III for a second state visit to the United Kingdom in mid-September.\nWhat Happened: The U.S. President and First Lady, Melania Trump, will be hosted by the British monarch from Sept. 17 to 19…",
    "link": "https://biztoc.com/x/92c917d01d019813",
    "timestamp": "2025-07-14T10:09:17Z"
  },
  {
    "title": "Trump said to contact senators about $9.4B spending cut",
    "description": "United States President Donald Trump is getting more involved with the recessions bill, which would entail a $9.4 billion spending cut in funding for foreign aid and public broadcasting, by talking di...",
    "link": "https://biztoc.com/x/ba08b368e6879765",
    "timestamp": "2025-07-14T10:09:14Z"
  }
]