[
  {
    "title": "US Homeland Security secretary calls for more travel bans",
    "description": "Kristi Noem says she will recommend a ban on entry for several countries that she says are \"flooding\" the US with criminal activity.",
    "link": "https://www.bbc.com/news/articles/c79x3rwxjryo",
    "timestamp": "2025-12-02T11:26:04Z"
  },
  {
    "title": "School Assembly News Headlines for 3rd December: Top national, international, sports & business news update",
    "description": "Top wrestlers' petitions challenging WFI elections were dismissed by the Delhi High Court. India and Russia are collaborating to boost New Delhi's exports, while the Indian economy shows strong growth prospects. International news includes China issuing rare …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/school-assembly-news-headlines-for-3rd-december-top-national-international-sports-business-news-update/articleshow/125717626.cms",
    "timestamp": "2025-12-02T11:22:14Z"
  },
  {
    "title": "Gavin Newsom Trolls Trump’s MRI Memo With His Own Merciless Mock Medical Report",
    "description": "And it had a fitting signature on the end.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-donald-trump-trolling-medical_n_692ec20fe4b02d38edefcc67",
    "timestamp": "2025-12-02T11:19:48Z"
  },
  {
    "title": "Regulators ramp up US stablecoin rules as GENIUS Act takes effect",
    "description": "A second FDIC rule on prudential requirements will follow early next year. The FDIC will supervise bank subsidiaries issuing payment stablecoins. Guidance on tokenised deposits is under development. US regulators are moving quickly to build the country’s new …",
    "link": "https://coinjournal.net/news/regulators-ramp-up-us-stablecoin-rules-as-genius-act-takes-effect/",
    "timestamp": "2025-12-02T11:18:48Z"
  },
  {
    "title": "Trump promised a San Francisco crime crackdown. His administration did the opposite",
    "description": "By Brad Heath SAN FRANCISCO, Dec 2 (Reuters) - U.S. President Donald Trump vowed this year to flood San Francisco with federal agents – and even soldiers...",
    "link": "https://www.yahoo.com/news/articles/trump-promised-san-francisco-crime-110242637.html",
    "timestamp": "2025-12-02T11:16:09Z"
  },
  {
    "title": "Kristi Noem Previews Sweeping Travel Ban on Countries Dumping 'Killers, Leeches, & Entitlement Junkies' in U.S.",
    "description": "A \"full travel ban\" from countries \"flooding our nation with killers, leeches, and entitlement junkies\" was flagged Monday by Homeland Security Secretary Kristi Noem during a meeting with President Donald Trump.\nThe post Kristi Noem Previews Sweeping Travel B…",
    "link": "https://www.breitbart.com/immigration/2025/12/02/noem-flags-sweeping-travel-ban-on-countries-dumping-killers-leeches-and-entitlement-junkies-on-u-s/",
    "timestamp": "2025-12-02T11:14:44Z"
  },
  {
    "title": "White House doctor says Trump's cardiovascular imaging 'perfectly normal' - BBC",
    "description": "White House doctor says Trump's cardiovascular imaging 'perfectly normal'BBC After Trump’s M.R.I. Claim, His Doctor’s Memo Offers Little ClarityThe New York Times Donald Trump MRI test results released: White House Doctor release result of Trump MRI testBBC W…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180257823",
    "timestamp": "2025-12-02T11:12:49Z"
  },
  {
    "title": "Batya Ungar-Sargon Gushes Over ‘Very Virile’ Trump on CNN",
    "description": "NewsNation host Batya Ungar-Sargon gushed over President Donald Trump on CNN, Monday, describing the 79-year-old as \"very virile.\"\nThe post Batya Ungar-Sargon Gushes Over ‘Very Virile’ Trump on CNN first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/batya-ungar-sargon-gushes-over-very-virile-trump-on-cnn/",
    "timestamp": "2025-12-02T11:09:48Z"
  },
  {
    "title": "Russia’s Justice Ministry Moves to Designate Pussy Riot ‘Extremist Organization’ During Founder’s Live Performance",
    "description": "The move came during the durational performance of Pussy Riot’s creator, Nadya Tolokonnikova, titled \"Police State\" at MCA Chicago.",
    "link": "https://www.artnews.com/art-news/news/russias-justice-ministry-moves-to-designate-pussy-riot-extremist-organization-during-founders-live-performance-1234764504/",
    "timestamp": "2025-12-02T11:09:02Z"
  },
  {
    "title": "Russia’s Justice Ministry Moves to Designate Pussy Riot ‘Extremist Organization’",
    "description": "A hearing is set for December 15 at Moscow’s Tverskoy Court after a lawsuit was filed against the group.",
    "link": "https://www.artnews.com/art-news/news/russia-pussy-riot-justice-ministry-extremist-organization-1234764504/",
    "timestamp": "2025-12-02T11:09:02Z"
  },
  {
    "title": "Uncommon Knowledge: What Europe Can Teach Trump about Immigration",
    "description": "In one of President Donald Trump's favorite countries, the most arresting migration number last week wasn’t how many people arrived—it was how many left. The U.K. reported that net migration fell two-thirds in a year to 204,000, after years of public concern.…",
    "link": "https://biztoc.com/x/feba99defa8e508b",
    "timestamp": "2025-12-02T11:06:06Z"
  },
  {
    "title": "Tennessee Special Election Could Be Kamala Harris' Revenge on Donald Trump",
    "description": "A Democratic victory in the special election for Tennessee’s Seventh Congressional District on Tuesday could be a \"boost\" to former Vice President Kamala Harris, more than a year after her loss to President Donald Trump.\nWhy It Matters\nVoters will head to the…",
    "link": "https://biztoc.com/x/22d1a2654f14562c",
    "timestamp": "2025-12-02T11:05:50Z"
  },
  {
    "title": "Trump is running out of personal lawyers to elevate to DOJ",
    "description": "It’s been a bad week for President Donald Trump’s attempts to transform the Justice Department into his personal retribution squad. Monday saw a federal appeals panel confirm that Alina Habba’s controversial appointment as the U.S. attorney for New Jersey was…",
    "link": "https://biztoc.com/x/7d4191dc384bb0bc",
    "timestamp": "2025-12-02T11:05:39Z"
  },
  {
    "title": "Trump highlights comments by 'Obama sycophant' Eric Holder, continues pressing Senate GOP to nix filibuster",
    "description": "President Trump, pointing to former Attorney General Eric Holder's comments about Democrats potentially expanding the Supreme Court, continued advocating for the Senate GOP to nix the filibuster",
    "link": "https://www.foxnews.com/politics/trump-highlights-comments-obama-sycophant-eric-holder-continues-pressing-senate-gop-nix-filibuster",
    "timestamp": "2025-12-02T11:03:05Z"
  },
  {
    "title": "I Found 30+ Laptop Deals Lingering After Cyber Monday From Lenovo, Apple, HP and More",
    "description": "I’ve been looking through hundreds of Cyber Monday deals to bring you the best last-minute deal prices on laptops from Apple, Dell, Lenovo and More.",
    "link": "https://www.cnet.com/deals/best-cyber-monday-laptop-deals-2025-12-02/",
    "timestamp": "2025-12-02T11:00:49Z"
  },
  {
    "title": "Hoekstra fought tariffs in Congress. He’s changed his tune as Trump’s Canadian ambassador",
    "description": "Pete Hoekstra railed against tariffs in Congress. He's reversed course in the Trump administration.",
    "link": "https://www.salon.com/2025/12/02/hoekstra-fought-tariffs-in-congress-hes-changed-his-tune-as-trumps-canadian-ambassador/",
    "timestamp": "2025-12-02T11:00:34Z"
  },
  {
    "title": "William Watson: We need a memorandum of understanding on cost vs. affordability",
    "description": "William Watson: Shifting who pays is how most governments address affordability, but that doesn’t actually solve the problem. Read more.",
    "link": "https://financialpost.com/opinion/william-watson-memorandum-understanding-cost-vs-affordability",
    "timestamp": "2025-12-02T11:00:20Z"
  },
  {
    "title": "Trump working up to 12-hour days, Oval Office logs show — refuting NY Times report on ‘fatigue’ limiting events",
    "description": "WASHINGTON — President Trump has been working up to 12-hour days this month, according to non-public official logs the White House provided to The Post after the New York Times claimed there were “signs of fatigue” in his less detailed public schedule. The pr…",
    "link": "https://nypost.com/2025/12/02/us-news/trump-working-up-to-12-hour-days-oval-office-logs-show-refuting-ny-times-report-on-fatigue-limiting-events/",
    "timestamp": "2025-12-02T11:00:09Z"
  },
  {
    "title": "Olivia Nuzzi’s Tell-Nothing Memoir",
    "description": "Can American Canto turn scandal into literature?",
    "link": "https://www.theatlantic.com/ideas/2025/12/olivia-nuzzi-memoir/685106/",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Entire Chain of Command Could Be Held Liable for Killing Boat Strike Survivors, Sources Say",
    "description": "Defense Secretary Pete Hegseth’s actions could spark investigations for war crimes or outright murder, sources told The Intercept.\nThe post Entire Chain of Command Could Be Held Liable for Killing Boat Strike Survivors, Sources Say appeared first on The Inter…",
    "link": "https://theintercept.com/2025/12/02/hegseth-boat-strikes-war-crime-venezuela/",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Mexico’s ‘Gen Z rebellion’ exposed as viral right-wing plot",
    "description": "Presented as a spontaneous youth-led uprising against corruption, violent protests that erupted across Mexico this month were backed by local oligarchs and an international right-wing network determined to topple the popular President Claudia Sheinbaum. Viole…",
    "link": "https://www.activistpost.com/mexicos-gen-z-rebellion-exposed-as-viral-right-wing-plot/",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Democrat Mandela Barnes launches bid for Wisconsin governor",
    "description": "Former Wisconsin Lt. Gov. Mandela Barnes announced Tuesday that he will run for governor, joining a crowded Democratic primary race for the open seat in the critical battleground state",
    "link": "https://www.nbcnews.com/politics/2026-election/democrat-mandela-barnes-launches-bid-wisconsin-governor-rcna246791",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Trump’s Federal Prosecutor Picks Keep Backfiring on Him",
    "description": "It’s been a rough week for a particular group of lawyers—specifically, those who served as President Donald Trump’s personal attorneys while he was out of office, only to be rewarded with legally dubious appointments to top jobs as federal prosecutors earlier…",
    "link": "https://newrepublic.com/article/203825/trump-federal-prosecutor-picks-backfiring",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Trump pick for NASA chief Jared Isaacman pledges to move space shuttle Discovery to Houston, lawmaker says",
    "description": "Jared Isaacman, President Trump's pick to lead NASA, is on board with moving the space shuttle Discovery to Houston, according to one of the senators behind the controversial plan.",
    "link": "https://www.space.com/space-exploration/trump-pick-for-nasa-chief-jared-isaacman-pledges-to-move-space-shuttle-discovery-to-houston-lawmaker-says",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Decision Day: Trump, Speaker Johnson, AOC blitz campaign trail in must-win special House election for GOP",
    "description": "Democrat Aftyn Behn seeks upset in Tennessee special election that could threaten fragile GOP House majority ahead of 2026 midterms in deep-red district.",
    "link": "https://www.foxnews.com/politics/decision-day-trump-speaker-johnson-aoc-blitz-campaign-trail-must-win-special-house-election-gop",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "How Sovereign Wealth Funds Grease Trump’s Kleptocracy",
    "description": "Donald Trump spoke during the 2024 campaign about the virtues of a sovereign wealth fund, and soon after taking office he issued an executive order about creating one. My own view, as I explained last year, is that the United States already has a sovereign we…",
    "link": "https://newrepublic.com/article/203829/sovereign-wealth-funds-grease-trump-kleptocracy",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Transcript: Trump’s Hold on the GOP Has Never Been Weaker",
    "description": "This is a lightly edited transcript of the December 1 edition of Right Now With Perry Bacon. You can watch the video here or by following this show on YouTube or Substack.Perry Bacon: I’m Perry Bacon. I’m the host of The New Republic show Right Now. Happy Tha…",
    "link": "https://newrepublic.com/article/203798/transcript-trump-hold-gop-never-weaker",
    "timestamp": "2025-12-02T11:00:00Z"
  },
  {
    "title": "Resilient in face of Trump tariffs, world economy is forecast to grow 3.2% this year, OECD says",
    "description": "The world economy has proven surprisingly durable in the face of President Donald Trump’s trade wars, the Organization for Economic Cooperation and Development said Tuesday, upgrading its outlook for global and U.S. economic growth this year",
    "link": "https://biztoc.com/x/0f716e3019be34ca",
    "timestamp": "2025-12-02T10:54:38Z"
  },
  {
    "title": "Group of European banks announce euro stablecoin company called qivalis",
    "description": "PARIS/MADRID, Dec 2 : A group of 10 European banks, including heavyweights ING, UniCredit and BNP Paribas, have formed a consortium to launch a euro-pegged stablecoin, in a move they hope will counter U.S. dominance in digital payments.The CEO of the Amsterda…",
    "link": "https://www.channelnewsasia.com/business/group-european-banks-announce-euro-stablecoin-company-called-qivalis-5527921",
    "timestamp": "2025-12-02T10:54:30Z"
  },
  {
    "title": "European banks led by BNP, ING push ahead on euro stablecoin plan",
    "description": "PARIS/MADRID, Dec 2 : A group of 10 European banks, including ING, UniCredit and BNP Paribas, have formed a company to launch a euro-pegged stablecoin in the second half of 2026, in a move they hope will counter U.S. dominance in digital payments.The CEO of t…",
    "link": "https://www.channelnewsasia.com/business/european-banks-led-bnp-ing-push-ahead-euro-stablecoin-plan-5527921",
    "timestamp": "2025-12-02T10:54:30Z"
  },
  {
    "title": "White House slammed for vile ICE deportation video set to Sabrina Carpenter’s ‘Juno’",
    "description": "The White House has been slammed for posting a vile Immigrations and Customs Enforcement (ICE) deportation video set to Sabrina Carpenter’s “Juno”.  The White House’s official TikTok is stirring controversy again. After using Wicked’s “Defying Gravity” to cel…",
    "link": "https://www.thepinknews.com/2025/12/02/white-house-slammed-for-vile-ice-deportation-video-set-to-sabrina-carpenters-juno/",
    "timestamp": "2025-12-02T10:49:45Z"
  },
  {
    "title": "Senate Democratic Leader Moves to Prevent Any US Military Action in Venezuela",
    "description": "MOSCOW (Sputnik) - US Senate Minority Leader Chuck Schumer threatened to prevent President Donald Trump from deploying US troops to Venezuela if he decides to do so.",
    "link": "https://sputnikglobe.com/20251202/senate-democratic-leader-moves-to-prevent-any-us-military-action-in-venezuela-1123211797.html",
    "timestamp": "2025-12-02T10:45:27Z"
  },
  {
    "title": "Donald Trump Just Single-Handedly Revived a ’90s Action-Movie Franchise, So I Rewatched the Old Ones. Yikes.",
    "description": "A 24-hour binge of all three movies explained a thing or two.",
    "link": "https://slate.com/culture/2025/12/donald-trump-rush-hour-4-movie-cast.html",
    "timestamp": "2025-12-02T10:45:00Z"
  },
  {
    "title": "Nigeria's defence minister quits as government faces rising violence",
    "description": "LAGOS, Dec 2 (Reuters) - Nigeria's defence minister has resigned, citing health reasons, President Bola Tinubu's office said, as the West African country faces a surge in mass kidnappings that have put a spotlight on the government's efforts to tackle rising …",
    "link": "https://www.thestar.com.my/news/world/2025/12/02/nigeria039s-defence-minister-quits-as-government-faces-rising-violence",
    "timestamp": "2025-12-02T10:44:00Z"
  },
  {
    "title": "Want to Know How the 2026 Midterms Will Go? Look at Tennessee Today.",
    "description": "On paper, Republicans should win this race in a blowout. On the ground, things look a lot more complicated.",
    "link": "https://slate.com/news-and-politics/2025/12/tennessee-special-election-matt-van-epps-aftyn-behn.html",
    "timestamp": "2025-12-02T10:40:00Z"
  },
  {
    "title": "Why smart CEOs are looking past the rosy ‘record Black Friday’ headlines",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/12/02/black-friday-cyber-monday-sales-numbers-adobe-salesforce-ceos/",
    "timestamp": "2025-12-02T10:36:28Z"
  },
  {
    "title": "James Carville Pinpoints What’s ‘Oozing Out’ Of Trump Right Now: ‘You Can Just Feel It’",
    "description": "The longtime Democratic strategist also offered a damning prediction for the president.",
    "link": "https://www.huffpost.com/entry/james-carville-donald-trump-power_n_692eb4b1e4b017c8f3fa20d8",
    "timestamp": "2025-12-02T10:35:56Z"
  },
  {
    "title": "Francis Fukuyama on Donald Trump and his impact on Europe",
    "description": "The second Trump administration in the United States has already fundamentally transformed the political reality in Europe and how the continent considers its defence and its place in the world.\nFrancis Fukuyama, famed scholar and author of ‘The end of histor…",
    "link": "https://biztoc.com/x/67647d7c216eacc5",
    "timestamp": "2025-12-02T10:32:30Z"
  },
  {
    "title": "Kristi Noem proposes ‘full travel ban’ on unnamed countries ‘flooding’ US with migrants; all you need to know about her estranged husband, divorce rumors and current boyfriend Corey Lewandowski",
    "description": "Homeland Security Secretary Kristi Noem proposed a \"full travel ban\" on countries deemed to be \"flooding\" the US with migrants, following President Trump's intention to \"permanently pause migration.\" This announcement came after an attack on National Guard me…",
    "link": "https://economictimes.indiatimes.com/news/international/us/kristi-noem-proposes-full-travel-ban-on-unnamed-countries-flooding-us-with-migrants-all-you-need-to-know-about-her-estranged-husband-divorce-rumors-and-current-boyfriend-corey-lewandowski/articleshow/125716529.cms",
    "timestamp": "2025-12-02T10:30:35Z"
  },
  {
    "title": "These sick insults make Trump's illness clear",
    "description": "On Thanksgiving Day, Donald Trump dispensed with gratitude.While most of us were trying to enjoy a holiday dinner, Trump spewed a torrent of hateful slurs and threats across Truth Social — blather that would have triggered 25th Amendment calls for any of his …",
    "link": "https://www.rawstory.com/raw-investigates/donald-trump-2674358111/",
    "timestamp": "2025-12-02T10:30:02Z"
  },
  {
    "title": "These sick insults make Trump's illness clear",
    "description": "On Thanksgiving Day, Donald Trump dispensed with gratitude.While most of us were trying to enjoy a holiday dinner, Trump spewed a torrent of hateful slurs and threats across Truth Social — blather that would have triggered 25th Amendment calls for any of his …",
    "link": "https://www.rawstory.com/donald-trump-2674358111/",
    "timestamp": "2025-12-02T10:30:02Z"
  },
  {
    "title": "Oregon Struggles to Land Federal Counterterrorism Money as Trump Orders Troops to Stop “Terrorists” Hindering ICE",
    "description": "A quiet battle has played out in court over money that “sanctuary” states say is needed to fight true extremist threats from both ends of the political spectrum.",
    "link": "http://www.propublica.org/article/portland-trump-dhs-terrorism-prevention-grant",
    "timestamp": "2025-12-02T10:30:00Z"
  },
  {
    "title": "Resilient in face of Trump tariffs, world economy is forecast to grow 3.2% this year, OECD says",
    "description": "The world economy has proven surprisingly durable in the face of President Donald Trump’s trade wars, the Organization for Economic Cooperation and Development said Tuesday, upgrading its outlook for global and U.S. economic growth this year",
    "link": "https://abcnews.go.com/Business/wireStory/resilient-face-trump-tariffs-world-economy-forecast-grow-128027463",
    "timestamp": "2025-12-02T10:29:51Z"
  },
  {
    "title": "Tinsel, tradition and messaging: The politics behind White House holiday decorations",
    "description": "Every year, the first lady — regardless of whether the president is a Republican or Democrat — enjoys the annual tradition of transforming the White House into a winter wonderland.",
    "link": "https://www.foxnews.com/politics/tinsel-tradition-messaging-politics-behind-white-house-holiday-decorations",
    "timestamp": "2025-12-02T10:23:52Z"
  },
  {
    "title": "Trump to attend 2026 World Cup group stage draw in Washington",
    "description": "United States President Donald Trump will attend the 2026 World Cup group stag draw in Washington on Friday, the White House said on Monday evening. \"On Friday, President Trump will attend the drawing at the Kennedy Center,\" press secretary Karoline Leavitt t…",
    "link": "https://dpa-international.com/sports/urn:newsml:dpa.com:20090101:251202-99-804725/",
    "timestamp": "2025-12-02T10:21:30Z"
  },
  {
    "title": "Battenfeld: Marty Walsh choice for VP under fire in children’s food scandal",
    "description": "Dozens of people have been charged by federal prosecutors with fraud in connection with the stolen funds, mostly from a food nutrition program for children overseen by Governor and former Democratic VP nominee Tim Walz.",
    "link": "https://www.bostonherald.com/2025/12/02/battenfeld-marty-walsh-choice-for-vp-under-fire-in-childrens-food-scandal/",
    "timestamp": "2025-12-02T10:18:21Z"
  },
  {
    "title": "Why China Did Not Do a ‘Kissinger’ to Split Europe From America",
    "description": "Europe would have given almost anything for peace, but Beijing had a different calculus.",
    "link": "http://foreignpolicy.com/2025/12/02/china-europe-russia-ukraine-war-peace-trump-us-geopolitics/",
    "timestamp": "2025-12-02T10:17:20Z"
  },
  {
    "title": "Francis Fukuyama on Donald Trump and his effects on Europe",
    "description": "Francis Fukuyama discusses the future of Europe in the times of Trump with the ERSTE Stiftung in Vienna, Austria",
    "link": "https://www.euractiv.com/video/francis-fukuyama-on-donald-trump-and-his-effects-on-europe/",
    "timestamp": "2025-12-02T10:15:12Z"
  },
  {
    "title": "Explaining Trump’s Contradictions",
    "description": "The simplest explanation for Trump’s behavior is often graft. But there are others.\nThe post Explaining Trump’s Contradictions appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/12/02/explaining-trumps-contradictions/",
    "timestamp": "2025-12-02T10:15:00Z"
  },
  {
    "title": "ICC president vows resistance to US sanctions amid Gaza genocide investigation",
    "description": "The president of the International Criminal Court (ICC), Tomoko Akane, has vowed the tribunal will not yield to US pressure after Washington imposed sanctions on senior court officials over investigations into Israeli war crimes in Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251201-presstv03.htm",
    "timestamp": "2025-12-02T10:13:48Z"
  },
  {
    "title": "Trump confirms phone conversation with Maduro as tensions escalate",
    "description": "US President Donald Trump has confirmed that he held a phone call last week with Venezuelan leader Nicolás Maduro, but declined to provide further details.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251201-presstv05.htm",
    "timestamp": "2025-12-02T10:13:15Z"
  },
  {
    "title": "Trump's remarks on Venezuelan airspace closure spark wide condemnation",
    "description": "U.S. President Donald Trump's remarks on the closure of Venezuelan airspace have sparked condemnation wide for endangering global air travel security, regional stability and peace.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/12/mil-251202-pdo01.htm",
    "timestamp": "2025-12-02T10:11:02Z"
  },
  {
    "title": "China Launches First Lot of Simpler Rare Earth Export Licences",
    "description": "China has issued an initial batch of new streamlined rare earth licences, which a source says should speed up exports to certain customers.\nThe move could fulfil a key outcome of the summit in late October between Presidents Donald Trump and Xi Jinping, the s…",
    "link": "https://biztoc.com/x/a3b9de73e8a35de3",
    "timestamp": "2025-12-02T10:09:51Z"
  },
  {
    "title": "World Cup 2026 draw: Trump, Infantino and a peace prize",
    "description": "The draw for the 2026 World Cup is on December 5, and Donald Trump will attend and pick up FIFA's new peace prize. Is FIFA president Gianni Infantino really a \"close friend\" of Trump, or just trying to stay onside?",
    "link": "https://www.dw.com/en/world-cup-2026-draw-trump-infantino-and-a-peace-prize/a-74973736",
    "timestamp": "2025-12-02T10:03:00Z"
  },
  {
    "title": "Resilient in face of Trump tariffs, world economy is forecast to grow 3.2% this year, OECD says",
    "description": "WASHINGTON (AP) — The world economy has proven surprisingly durable in the face of President Donald Trump’s trade wars, the Organization for Economic Cooperation and Development said Tuesday, upgrading its outlook for global and U.S. economic growth this year…",
    "link": "https://financialpost.com/pmn/resilient-in-face-of-trump-tariffs-world-economy-is-forecast-to-grow-3-2-this-year-oecd-says",
    "timestamp": "2025-12-02T10:01:31Z"
  },
  {
    "title": "LIZ PEEK: Massive Minnesota welfare heist proves Democrats can't police their own mess",
    "description": "Minnesota welfare fraud involving Somali refugees costs taxpayers over $1 billion, exposing significant failures in Tim Walz administration oversight.",
    "link": "https://www.foxnews.com/opinion/liz-peek-massive-minnesota-welfare-heist-proves-democrats-cant-police-own-mess",
    "timestamp": "2025-12-02T10:00:32Z"
  },
  {
    "title": "MORNING GLORY: Trump has the authority to strike the narco-states poisoning the US",
    "description": "Supreme Court precedents like Curtiss-Wright support President Donald Trump's vast presidential powers in foreign affairs against narco-states and cartels.",
    "link": "https://www.foxnews.com/opinion/morning-glory-trump-has-authority-strike-narco-states-poisoning-us",
    "timestamp": "2025-12-02T10:00:26Z"
  },
  {
    "title": "Affordability: How Trump Has Made It Worse",
    "description": "Solving the affordability crisis won’t be easy but reversing some key MAGA policies would be a start.\nThe post Affordability: How Trump Has Made It Worse appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/12/02/affordability-crisis-trump-maga-policies/",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "Republicans defend a deep-red House district in expensive Tennessee special election",
    "description": "General elections for former Rep. Mark Green's congressional seat in Middle Tennessee have been sleepy, safely Republican affairs. But Tuesday’s special election for the district west of Nashville has turned into a more contested campaign, even though Preside…",
    "link": "https://www.nbcnews.com/politics/elections/republicans-work-defend-deep-red-house-district-expensive-tennessee-sp-rcna245615",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "Jafar Panahi Will Not Be Stopped",
    "description": "Nick Hilden\n\n\n\nImprisoned and censored by his home country of Iran, the legendary director discusses his furtive filmmaking.\r\n\n\r\n\n\nThe post Jafar Panahi Will Not Be Stopped appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=578918",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "Luigi Pirandello’s Broken Men",
    "description": "Gus O’Connor\n\n\n\nThe Nobel Prize-winning writer was once seen as Italy’s great man of letters. Why was he forgotten? \r\n\n\r\n\n\nThe post Luigi Pirandello’s Broken Men appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=578032",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "Trump’s Murderous Hypocrisy on Drug Trafficking Is Bone-Chilling",
    "description": "A president killing boaters on specious claims of “narcoterrorism” while pardoning major drug traffickers should be a major scandal.  \nThe post Trump’s Murderous Hypocrisy on Drug Trafficking Is Bone-Chilling  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/12/02/trumps-hypocrisy-drug-trafficking/",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "The White House Press Tracker Is a Parody of Media Criticism",
    "description": "Chris Lehmann\n\n\n\nWith his approval number plummeting, Trump turns to a familiar strategy: launch a culture war against journalists.\r\n\n\r\n\n\nThe post The White House Press Tracker Is a Parody of Media Criticism appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=578979",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "I Still Feel a Tiny Bit Sorry for Olivia Nuzzi",
    "description": "Joan Walsh\n\n\n\nShe violated every journalism ethics code. But her childhood set her up to fall for a string of incompetent daddy-figures too lame to protect her.\r\n\n\r\n\n\nThe post I Still Feel a Tiny Bit Sorry for Olivia Nuzzi appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=578964",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "Wealthy Ranchers Profit From Public Lands. Taxpayers Pick Up the Tab.",
    "description": "A ProPublica and High Country News investigation found that government programs supporting grazing on public lands prop up a wealthy few while harming the environment. The Trump administration is supercharging the system.",
    "link": "http://www.propublica.org/article/grazing-ranchers-public-lands-trump",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "They Need a Ventilator To Stay Alive. Getting One Can Be a Nightmare.",
    "description": "Few nursing homes are set up to care for people needing help breathing with a ventilator because of ALS or other infirmities. Insurers often resist paying for ventilators at home, and innovative programs are now endangered by Medicaid cuts.",
    "link": "https://kffhealthnews.org/news/article/ventilators-nursing-homes-insurers-medicaid-als-lou-gehrigs-disease-missouri/",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "RFK Jr. Wants To Delay the Hepatitis B Vaccine. Here’s What Parents Need To Know.",
    "description": "A CDC panel is reconsidering the birth dose of the hepatitis B vaccine. Renewed doubt could lead to fewer kids getting vaccinated, leaving them vulnerable to an incurable, preventable virus that can be acquired by indirect contact with infected blood.",
    "link": "https://kffhealthnews.org/news/article/hepatitis-b-kennedy-rfk-vaccine-panel-children-cdc-acip/",
    "timestamp": "2025-12-02T10:00:00Z"
  },
  {
    "title": "Zelenskyy In Paris, Witkoff To Moscow, In 'Pivotal Week' For Ukraine Talks",
    "description": "Ukrainian President Volodymyr Zelenskyy was at the Elysee Palace in Paris on December 1 for talks with his French counterpart, Emmanuel Macron, kicking off another week of intense diplomacy aimed at ending nearly four years of fighting in Ukraine following Ru…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251201-rferl01.htm",
    "timestamp": "2025-12-02T09:58:30Z"
  },
  {
    "title": "US-Ukraine Negotiations Mainly Focused on Territorial Issue - Reports",
    "description": "The negotiations between the US and Ukrainian delegations in Florida were almost entirely focused on where the de facto border with Russia would be drawn under a peace deal, the Axios portal reported on Monday, citing two Ukrainian officials.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/12/ukraine-251201-sputnik03.htm",
    "timestamp": "2025-12-02T09:57:28Z"
  },
  {
    "title": "Embarrassing Setbacks For Trump, Oscars Race Begins: Read The Latest News",
    "description": "Follow along for the latest updates on the major headlines of the week.",
    "link": "https://www.huffpost.com/entry/trump-setbacks-oscars-race-begins_n_692eb669e4b02d38edefc8fb",
    "timestamp": "2025-12-02T09:55:52Z"
  },
  {
    "title": "Stephen Colbert Hits Trump With An Honest Medical 'Prescription'",
    "description": "The \"Late Show\" host had a little advice about a \"benefit\" for the president.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-medical-prescription_n_692e9756e4b02d38edef6ffb",
    "timestamp": "2025-12-02T09:55:23Z"
  },
  {
    "title": "Group of European banks announce euro stablecoin company called qivalis",
    "description": "A group of 10 European banks, including heavyweights ING, ​UniCredit and BNP Paribas, have formed a consortium to launch ‌a euro-pegged stablecoin, in a move ...",
    "link": "https://finance.yahoo.com/news/group-european-banks-announce-euro-095453982.html",
    "timestamp": "2025-12-02T09:54:53Z"
  },
  {
    "title": "'Hung by my wrists and beaten': Israeli-Russian woman says Iraqi militants tortured her in captivity",
    "description": "Elizabeth Tsurkov, who was freed in September, tells the BBC that her two years in captivity left her physically and mentally scarred.",
    "link": "https://www.bbc.com/news/articles/cj69588eewyo",
    "timestamp": "2025-12-02T09:53:16Z"
  },
  {
    "title": "Netanyahu appears in court after seeking pardon in corruption trial",
    "description": "The Israeli regime's prime minister, Benjamin Netanyahu, appeared in court for the first time since requesting a presidential pardon in his ongoing corruption trial.",
    "link": "https://www.globalsecurity.org/wmd/library/news/israel/2025/12/israel-251201-presstv01.htm",
    "timestamp": "2025-12-02T09:51:43Z"
  },
  {
    "title": "Gavin Newsom ridicules Trump MRI scan result with 'healthiest person alive' memo",
    "description": "California Governor Gavin Newsom has once more mocked Donald Trump, this time with a \"memorandum\" billing him as the \"healthiest person alive\". Newsom made the hilarious claim through an official statement which ripped apart the president's shorter working da…",
    "link": "https://www.rawstory.com/gavin-newsom-trump-2674360277/",
    "timestamp": "2025-12-02T09:49:17Z"
  },
  {
    "title": "Stony-faced Madonna lambasts 'ridiculous' Trump as he ends US commemoration of World Aids Day",
    "description": "Madonna issued a blistering rebuke of Donald Trump after he moved to end the United States' official acknowledgement of World AIDS Day, a global day of remembrance and awareness recognized every year since 1988. On Monday, the singer and prominent LGBTQ+ ally…",
    "link": "https://freerepublic.com/focus/f-chat/4355577/posts",
    "timestamp": "2025-12-02T09:41:42Z"
  },
  {
    "title": "Top ‘Manosphere’ Podcaster Shreds Trump Official’s Plea With Disturbingly Dark Riff",
    "description": "Tim Dillon fumed: \"Hey, f**k you, by the way. Shut the f**k up. How about you get the planes in the f**king sky, you scumbag, and shut the f**k up.\"",
    "link": "https://www.huffpost.com/entry/tim-dillon-sean-duffy-airplane_n_692ea480e4b017c8f3f9df1b",
    "timestamp": "2025-12-02T09:40:32Z"
  },
  {
    "title": "Elizabeth McCracken, Olga Tokarczuk, Olivia Nuzzi, and more: 22 new books out today!",
    "description": "December marks the winding down of the year’s releases, but there’s still a lot to be excited by. Elizabeth McCracken has released a craft memoir, a gift to anyone who isn’t lucky enough to be her student at Michener. Olga",
    "link": "https://lithub.com/elizabeth-mccracken-olga-tokarczuk-olivia-nuzzi-and-more-22-new-books-out-today/",
    "timestamp": "2025-12-02T09:33:45Z"
  },
  {
    "title": "Diddy vs Fiddy: A 25-year timeline of one of rap’s biggest feuds",
    "description": "50 Cent and on-trial rival once partnered but have warred over everything from artist contracts to vodka labels... and even Biggie’s murder",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/diddy-50-cent-sean-combs-curtis-jackson-feud-timeline-b2875797.html",
    "timestamp": "2025-12-02T09:30:54Z"
  },
  {
    "title": "ICE erupts after New York releases 7,000 criminal migrants without warning - including rapists and killers - and demands state surrender thousands more still behind bars",
    "description": "New York has released almost 7,000 criminal illegal migrants back onto the streets since Donald Trump returned to the White House, without notifying the Immigrations and Customs Enforcement office. The Department of Homeland Security on Monday revealed to the…",
    "link": "https://freerepublic.com/focus/f-chat/4355575/posts",
    "timestamp": "2025-12-02T09:25:44Z"
  },
  {
    "title": "Maduro dances to 'no war, yes peace' song amid US tensions",
    "description": "Nicolas Maduro has sworn “absolute loyalty” to the Venezuelan people amid simmering tensions with Donald Trump. ⁠⁠ Read ...",
    "link": "https://biztoc.com/x/dc575209bb29e125",
    "timestamp": "2025-12-02T09:22:43Z"
  },
  {
    "title": "U.S. envoy in Moscow for high-stakes Ukraine peace talks with Putin",
    "description": "President Donald Trump’s special envoy is meeting Russian President Vladimir Putin Tuesday fortalks that Washington hopes will convince the Kremlin to end his war in Ukraine.",
    "link": "https://www.nbcnews.com/world/russia/witkoff-moscow-putin-ukraine-peace-talks-trump-zelenskyy-rcna246928",
    "timestamp": "2025-12-02T09:19:23Z"
  },
  {
    "title": "Russia's Putin seeks to boost energy, defence exports with India visit",
    "description": "On his first visit in four years to the Indian capital for a summit with Prime Minister Narendra Modi, Putin will be accompanied by his defence minister, Andrei Belousov, and a wide-ranging delegation from business and industry",
    "link": "https://www.thehindubusinessline.com/news/russias-putin-seeks-to-boost-energy-defence-exports-with-india-visit/article70348634.ece",
    "timestamp": "2025-12-02T09:15:45Z"
  },
  {
    "title": "Putin-Witkoff Talks to Focus on US-Ukraine Settlement Ideas – Kremlin",
    "description": "Russian President Vladimir Putin and US President Donald Trump’s special envoy, Steve Witkoff, will discuss the understandings reached between Washington and Kiev on a potential settlement, Kremlin spokesman Dmitry Peskov said.",
    "link": "https://sputnikglobe.com/20251202/putinwitkoff-talks-to-focus-on-us-ukraine-settlement-ideas---kremlin-1123210010.html",
    "timestamp": "2025-12-02T09:13:15Z"
  },
  {
    "title": "Why is Olympian Chloe Covell deactivating her Instagram? Australia first in world to ban social media to Under-16s - Check which platforms are banned and who will enforce the ban; Will Trump defend US tech companies against the ban?",
    "description": "Australia enacts a world-first ban on social media for individuals under 16. This significant move aims to protect young people from online dangers. Platforms like Instagram, TikTok, and YouTube will be inaccessible to this age group. Social media companies f…",
    "link": "https://economictimes.indiatimes.com/news/international/australia/why-is-olympian-chloe-covell-deactivating-her-instagram-australia-first-in-world-to-ban-social-media-to-under-16s-check-which-platforms-are-banned-and-who-will-enforce-the-ban-will-trump-defend-us-tech-companies-against-the-ban/articleshow/125714772.cms",
    "timestamp": "2025-12-02T09:10:50Z"
  },
  {
    "title": "ABC defends journalist’s ‘outrageous’ attack on Senator Price",
    "description": "The Australian Broadcasting Corporation has been grilled in Senate Estimates over the public broadcaster's news coverage and editorial controls.",
    "link": "https://www.skynews.com.au/business/media/australian-broadcasting-corporation-faces-questions-in-senate-estimates-after-spate-of-recent-bungles/news-story/b9fea2b94eca8903757817c957198f59",
    "timestamp": "2025-12-02T09:03:57Z"
  },
  {
    "title": "Hegseth or Admiral Bradley: Who approved the second Venezuela boat strike?",
    "description": "The US defence secretary and White House have defended the second strike, but Trump said he would not have wanted it.",
    "link": "https://www.aljazeera.com/news/2025/12/2/hegseth-or-admiral-bradley-who-approved-the-second-venezuela-boat-strike",
    "timestamp": "2025-12-02T09:01:47Z"
  },
  {
    "title": "High-stakes US push for Ukraine peace meets hard limits in Moscow",
    "description": "Putin holds key to Ukraine peace as Trump envoy Steve Witkoff arrives in Moscow for crucial talks following weekend negotiations on 19-point proposal.",
    "link": "https://www.foxnews.com/politics/high-stakes-us-push-ukraine-peace-meets-hard-limits-moscow",
    "timestamp": "2025-12-02T09:00:06Z"
  },
  {
    "title": "Costco files federal lawsuit challenging Trump’s emergency tariff orders on imported goods",
    "description": "Retailer faces December 15 deadline that could prevent recovery of duties paid on imported goods.",
    "link": "https://www.foxbusiness.com/politics/costco-files-federal-lawsuit-challenging-trumps-emergency-tariff-orders-on-imported-goods",
    "timestamp": "2025-12-02T08:49:33Z"
  }
]