[
  {
    "title": "8 Love Letters From Hell, in Honor of Valentine’s Day",
    "description": "Kim Jong Un’s letters to Donald Trump. Jeff Bezos’s saucy texts to Lauren Sánchez. Muammar Gaddafi’s professions of love for Condoleezza Rice. Here are eight of the most diabolical love letters of the 21st century.",
    "link": "https://www.vanityfair.com/culture/story/trump-epstein-love-letters-from-hell",
    "timestamp": "2026-02-11T15:06:13Z"
  },
  {
    "title": "CBO: Federal deficits and debt to worsen over next decade",
    "description": "The Congressional Budget Office projects worsening federal deficits and rising debt over the next decade, driven by increased spending on Social Security, Medicare, and debt service payments. The report factors in major developments in the past year, includin…",
    "link": "https://apnews.com/article/trump-cbo-budget-outlook-deficits-inflation-debt-45a61cb88eb6083a6e18389d19320c8a",
    "timestamp": "2026-02-11T15:05:15Z"
  },
  {
    "title": "J.P. Cooney, ex-Trump prosecutor in Jack Smith's office, is running for Congress (Megan Lebowitz/NBC News)",
    "description": "Megan Lebowitz / NBC News:\nJ.P. Cooney, ex-Trump prosecutor in Jack Smith's office, is running for Congress  —  Cooney, who was fired with other prosecutors under former special counsel Jack Smith after President Donald Trump took office, is running for a pro…",
    "link": "https://www.memeorandum.com/260211/p35",
    "timestamp": "2026-02-11T15:05:01Z"
  },
  {
    "title": "What Motivates Trump?",
    "description": "Jamelle Bouie, a columnist for The NewYork Times, writes here about a question that has puzzled many observers: what motivates Trump? Some would say he ran the first time out of sheer egoism and the second time to stay out of jail. Or, he ran the first time b…",
    "link": "https://dianeravitch.net/2026/02/11/what-motivates-trump/",
    "timestamp": "2026-02-11T15:00:00Z"
  },
  {
    "title": "The Lutnick Deception: The Island Email That Won’t Go Away",
    "description": "Howard Lutnick is a man the world has been sold as a survivor, a Wall Street titan who rebuilt Cantor Fitzgerald investment bank from the ashes of September 11, a billionaire philanthropist, and, most recently, joined at the hip with President Donald Trump, a…",
    "link": "https://www.activistpost.com/the-lutnick-deception-the-island-email-that-wont-go-away/",
    "timestamp": "2026-02-11T15:00:00Z"
  },
  {
    "title": "Iran Signals Openness to Nuclear Inspections as U.S. Warships Mass in the Gulf",
    "description": "Iranian President Masud Pezeshkian has said his country is open to admitting international inspectors to prove its nuclear program is \"peaceful,\" in comments marking the 47th anniversary of the Islamic Revolution, as US naval forces stand poised in the region…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/Iran-Signals-Openness-to-Nuclear-Inspections-as-US-Warships-Mass-in-the-Gulf.html",
    "timestamp": "2026-02-11T15:00:00Z"
  },
  {
    "title": "Squeezed by U.S. tensions and public anger over crackdown, Iran commemorates 1979 revolution",
    "description": "President Masoud Pezeshkian got on stage at Azadi Square in Tehran and insisted that Iran is willing to negotiate over its nuclear program as fledgling nuclear talks talks with America hang in the balance.",
    "link": "https://www.pbs.org/newshour/world/squeezed-by-u-s-tensions-and-public-anger-over-crackdown-iran-commemorates-1979-revolution",
    "timestamp": "2026-02-11T14:59:59Z"
  },
  {
    "title": "Ilhan Omar Seems to Reference Trump as 'Pedophile Protection Party' Leader",
    "description": "President Donald Trump and his party might hate Somalia ... but, at least Somalia executes pedophiles there instead of electing them -- so says Rep. Ilhan Omar. The Democratic Congresswoman from Minnesota took to social media, apparently to express…",
    "link": "https://www.tmz.com/2026/02/11/ilhan-omar-tweet-pedophile-protection-party/",
    "timestamp": "2026-02-11T14:59:29Z"
  },
  {
    "title": "Greenland's Olympic siblings keen to help protect homeland",
    "description": "Sondre and Ukaleq Slettemark usually make up Greenland's biathlon team, despite a lack of facilities. But they are competing for Denmark at the Winter Olympics and, unlike Donald Trump, they want it to stay that way. Though he hasn't set foot in Italy, the sh…",
    "link": "https://www.dw.com/en/greenlands-olympic-siblings-keen-to-help-protect-homeland/a-75910620",
    "timestamp": "2026-02-11T14:56:00Z"
  },
  {
    "title": "Nightmarish labor market finally shows signs of letting up—and some ‘vindication’ for Jerome Powell",
    "description": "“Low-hire, low-fire” is so 2025-coded as January suggests companies may actually be hiring in 2026. This jobs report made Maria Bartiromo say \"wow.\"",
    "link": "https://fortune.com/2026/02/11/january-jobs-report-jerome-powell-federal-reserve-interest-rate-march-bond-yields-maria-bartiromo/",
    "timestamp": "2026-02-11T14:54:44Z"
  },
  {
    "title": "Minnesota Federal Prosecutor Joins Don Lemon’s Defense Weeks After Quitting",
    "description": "A former federal prosecutor who recently resigned from the Minnesota U.S. Attorney's office has joined Don Lemon's defense team, court records show.",
    "link": "https://dailycaller.com/2026/02/11/minnesota-federal-prosecutor-joins-don-lemons-defense-weeks-after-quitting/",
    "timestamp": "2026-02-11T14:51:20Z"
  },
  {
    "title": "Iran marks revolution anniversary under shadow of US threat",
    "description": "Protesters, meanwhile, renewed anti-government chants from the balconies of residential blocks, in defiance of an ongoing crackdown on opposition to the clerical system, which rights groups say has seen security forces shoot thousands dead.\n\nUS President Dona…",
    "link": "https://www.france24.com/en/live-news/20260211-iran-marks-revolution-anniversary-under-shadow-of-us-threat",
    "timestamp": "2026-02-11T14:49:12Z"
  },
  {
    "title": "More investors join legal challenge against South Korea over Coupang data leak handling",
    "description": "Feb 11 : Three more investors have joined Greenoaks and Altimeter in their legal challenge against the government of South Korea, alleging discriminatory treatment of e-commerce firm Coupang and other U.S. companies.Abrams Capital, Durable Capital Partners, a…",
    "link": "https://www.channelnewsasia.com/business/more-investors-join-legal-challenge-against-south-korea-over-coupang-data-leak-handling-5923781",
    "timestamp": "2026-02-11T14:47:59Z"
  },
  {
    "title": "Except Trump, nobody has stated India's refusal to buy Russian oil: Lavrov",
    "description": "Except US President Donald Trump, nobody else has declared that India will stop buying Russian oil, Foreign Minister Sergei Lavrov told the country's parliament Wednesday.\nLavrov's comments came two days after Russia accused the US of attempting to prevent In…",
    "link": "https://www.business-standard.com/world-news/except-trump-nobody-has-stated-india-s-refusal-to-buy-russian-oil-126021101261_1.html",
    "timestamp": "2026-02-11T14:46:41Z"
  },
  {
    "title": "Samyukt Kisan Morcha urges farmers to join February 12 general strike",
    "description": "Samyukt Kisan Morcha calls on farmers to back February 12 nationwide strike, supporting demands on labour codes, pension restoration and minimum wages",
    "link": "https://www.business-standard.com/india-news/farmers-urged-to-join-nationwide-general-strike-on-feb-12-126021101607_1.html",
    "timestamp": "2026-02-11T14:44:49Z"
  },
  {
    "title": "Is This the Real Reason Trump Threatened Bridge to Canada?",
    "description": "Donald Trump’s outrageous threat to close a new bridge between Michigan and Canada appears to have been at the behest of a billionaire who operates another bridge between the two countries. Just hours before Trump published a scattered tirade Monday night aga…",
    "link": "https://newrepublic.com/post/206454/donald-trump-threat-bridge-canada-billionaire",
    "timestamp": "2026-02-11T14:43:55Z"
  },
  {
    "title": "House Dem Reveals Truly Astonishing Number Of Trump Mentions In Unredacted Epstein Files",
    "description": "Rep. Jamie Raskin (D-Md.) has reviewed unredacted versions of Justice Department documents related to late sex offender Jeffrey Epstein.",
    "link": "https://www.huffpost.com/entry/jamie-raskin-donald-trump-unredacted-epstein-files-more-than-a-million-times_n_698c6526e4b080ae0a7f8575",
    "timestamp": "2026-02-11T14:43:25Z"
  },
  {
    "title": "NATO launches Arctic Sentry to strengthen its presence in the Arctic",
    "description": "The mission is being carried out under an agreement following tensions caused by Donald Trump’s desire to take control of Greenland\nThe post NATO launches Arctic Sentry to strengthen its presence in the Arctic appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2026/02/11/nato-launches-arctic-sentry-to-strengthen-its-presence-in-the-arctic/",
    "timestamp": "2026-02-11T14:42:05Z"
  },
  {
    "title": "'Wackos': GOP senators ridicule Dem demands for ICE reform as yet another shutdown looms",
    "description": "WASHINGTON — Another partial government shutdown seems all but certain, now Republican leaders on Capitol Hill have outsourced negotiations to fund the Department of Homeland Security and Immigration and Customs Enforcement (ICE) to President Donald Trump’s W…",
    "link": "https://www.rawstory.com/raw-investigates/ice-2675258882/",
    "timestamp": "2026-02-11T14:41:27Z"
  },
  {
    "title": "4 takeaways from Senate probe of ‘Arctic Frost’ data collection",
    "description": "'I'm determined to ensure that Jack Smith is held accountable'",
    "link": "https://www.wnd.com/2026/02/4-takeaways-senate-probe-arctic-frost-data-collection/",
    "timestamp": "2026-02-11T14:40:57Z"
  },
  {
    "title": "Trump privately weighs exiting the USMCA trade pact he negotiated",
    "description": "A White House official, asked about the discussions, described Trump as the ultimate decision-maker and someone always seeking a better deal for the American people",
    "link": "https://www.business-standard.com/world-news/trump-privately-weighs-quitting-usmca-trade-pact-he-negotiated-126021101193_1.html",
    "timestamp": "2026-02-11T14:40:32Z"
  },
  {
    "title": "What Is Kari Lake Trying to Achieve?",
    "description": "The Arizona politician has wasted millions of dollars while blocking U.S. efforts to bring reliable news to repressive countries.",
    "link": "https://www.theatlantic.com/ideas/2026/02/kari-lake-maga-future/685906/",
    "timestamp": "2026-02-11T14:40:00Z"
  },
  {
    "title": "NATO launches Arctic Sentry military effort as it seeks to move on from Greenland dispute",
    "description": "NATO has launched a new military effort called Arctic Sentry to boost security in the High North",
    "link": "https://abcnews.com/International/wireStory/nato-launches-arctic-sentry-military-effort-seeks-move-130059114",
    "timestamp": "2026-02-11T14:37:54Z"
  },
  {
    "title": "Jobs Up, Federal Workers Down",
    "description": "Plus: Shifting goalposts on immigration and jobs, Netanyahu visits D.C., everything is fine in El Paso after all, and more...",
    "link": "https://reason.com/2026/02/11/jobs-up-federal-workers-down/",
    "timestamp": "2026-02-11T14:37:34Z"
  },
  {
    "title": "Rand Paul Turns Tables On Katie Couric For Downplaying ICE’s Arrests Of Violent Criminals",
    "description": "Rand Paul clashed with Katie Couric as she minimized the reported percentage of Immigration and Customs Enforcement arrests of violent criminals.",
    "link": "https://dailycaller.com/2026/02/11/rand-paul-katie-couric-downplaying-ices-arrests-violent-criminals/",
    "timestamp": "2026-02-11T14:37:11Z"
  },
  {
    "title": "Far-right activist lays into MAGA's 'lying to themselves' fantasy about Kid Rock",
    "description": "Conservative activist and anti-DEI rabble rouser Christopher Rufo poured cold water on Donald Trump supporters who are insisting that aging rocker Kid Rock is winning the culture war based on his alternative Super Bowl halftime show on Sunday.Kid Rock's show,…",
    "link": "https://www.rawstory.com/kid-rock-bad-bunny/",
    "timestamp": "2026-02-11T14:35:27Z"
  },
  {
    "title": "Foreign-Born Member Of Congress Threatens Republicans With Prison When Democrats Regain Power",
    "description": "Foreign-born Rep. Shri Thanedar openly threatened to prosecute his political enemies this week — a reminder of what Democrats plan to do if they get power back. During a committee hearing Tuesday, Thanedar — struggling to speak English — threatened to prosecu…",
    "link": "https://freerepublic.com/focus/f-chat/4366414/posts",
    "timestamp": "2026-02-11T14:34:44Z"
  },
  {
    "title": "Why the US can destroy terrorist camps in Nigeria, but not terrorism – security scholar",
    "description": "Airstrikes may disrupt militants, but Nigeria’s insecurity is rooted in a governance collapse that military force alone cannot fix.",
    "link": "https://theconversation.com/why-the-us-can-destroy-terrorist-camps-in-nigeria-but-not-terrorism-security-scholar-274799",
    "timestamp": "2026-02-11T14:30:40Z"
  },
  {
    "title": "Attorney General Bondi will face questions from Congress on Epstein and investigation of lawmakers",
    "description": "Bondi is confronting a new wave of criticism stemming after the release of millions of additional Epstein disclosures.",
    "link": "https://www.bostonherald.com/2026/02/11/bondi-face-questions-congress-epstein/",
    "timestamp": "2026-02-11T14:29:23Z"
  },
  {
    "title": "Flights resume at El Paso airport as FAA lifts temporary closure order",
    "description": "Secretary of Transportation Sean Duffy said that Mexican cartel drones breached U.S. airspace over El Paso.",
    "link": "https://www.wpxi.com/news/trending/flights-resume-el-paso-airport-faa-lifts-temporary-closure-order/BQU3LX2I3NCVFKWHPMH35DS5NQ/",
    "timestamp": "2026-02-11T14:26:51Z"
  },
  {
    "title": "Trump's Venezuela oil sales deal raises questions about which government U.S. will recognize",
    "description": "The U.S. is cooperating with a regime in Venezuela it does not recognize, and it's unclear what role the opposition will play in the future.",
    "link": "https://www.cnbc.com/2026/02/11/trump-venezuela-oil-revenue-qatar.html",
    "timestamp": "2026-02-11T14:26:11Z"
  },
  {
    "title": "Flights resume at El Paso airport as FAA lifts temporary closure order",
    "description": "Secretary of Transportation Sean Duffy said that Mexican cartel drones breached U.S. airspace over El Paso.",
    "link": "https://www.wsoctv.com/news/trending/flights-resume-el-paso-airport-faa-lifts-temporary-closure-order/BQU3LX2I3NCVFKWHPMH35DS5NQ/",
    "timestamp": "2026-02-11T14:24:09Z"
  },
  {
    "title": "After GOP rebellion, House set for Wednesday vote on Trump's Canada tariffs",
    "description": "Republican House leaders tried, and failed, to pass a measure on Tuesday that would have blocked House disapproval votes on Trump tariffs through July.",
    "link": "https://www.cnbc.com/2026/02/11/gop-trump-tariffs-canada.html",
    "timestamp": "2026-02-11T14:23:44Z"
  },
  {
    "title": "Canada -- Top Source of Tourists to Cuba -- Suspends Flights to Island over Fuel Shortages",
    "description": "The largest airlines in Canada announced on Monday and Tuesday that they would be suspending flights to Cuba for the immediate future as a result of the Castro regime announcing it no longer had any jet fuel.\nThe post Canada — Top Source of Tourists to Cuba —…",
    "link": "https://www.breitbart.com/latin-america/2026/02/11/canada-top-source-of-tourists-to-cuba-suspends-flights-to-island-over-fuel-shortages/",
    "timestamp": "2026-02-11T14:23:11Z"
  },
  {
    "title": "US job growth accelerates in January, jobless rate falls",
    "description": "US job growth accelerated in January and the unemployment rate fell to 4.3%, signs of labour market stability that could give the Federal Reserve room to keep interest rates unchanged for some time while policymakers monitor inflation.",
    "link": "https://www.rte.ie/news/business/2026/0211/1557954-us-non-farm-payroll-figures/",
    "timestamp": "2026-02-11T14:23:08Z"
  },
  {
    "title": "US stocks: US job growth accelerates in January, unemployment rate falls to 4.3%",
    "description": "U.S. job growth accelerated in January and the unemployment rate fell to 4.3%, signs of ​labor market stability that could give the Federal Reserve room to keep interest rates unchanged for some time while policymakers monitor inflation.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-stocks-us-job-growth-accelerates-in-january-unemployment-rate-falls-to-4-3/articleshow/128211555.cms",
    "timestamp": "2026-02-11T14:20:53Z"
  },
  {
    "title": "Lucy Harrison Shooting Came After Argument With Dad About Donald Trump",
    "description": "Reading Time: 4 minutes23-year-old Lucy Harrison and her father argued about Donald Trump a short time before her allegedly accidental shooting in his home.\nLucy Harrison Shooting Came After Argument With Dad About Donald Trump was originally published on The…",
    "link": "http://www.thehollywoodgossip.com/2026/02/father-shot-daughter-donald-trump-argument/",
    "timestamp": "2026-02-11T14:19:38Z"
  },
  {
    "title": "What In The Holy F*ck Is The Trump Administration Doing In El Paso?",
    "description": "With Trump's goons invading Democratic cities, I've been thinking about the Jade Helm conspiracy theories in 2015, where conservative hysteria, also fueled by Texas Gov Greg Abbott, was through the roof. They were absolutely certain that our country's first B…",
    "link": "https://crooksandliars.com/2026/02/what-holy-fck-trump-administration-doing",
    "timestamp": "2026-02-11T14:18:00Z"
  },
  {
    "title": "‘Smoke & mirrors!’ 3 Republicans defy Trump, side with Democrats on president’s tariffs",
    "description": "'The law requires Congress to permit a vote on presidential emergencies within 15 days of being declared'",
    "link": "https://www.wnd.com/2026/02/smoke-mirrors-3-republicans-defy-trump-side-democrats/",
    "timestamp": "2026-02-11T14:17:39Z"
  },
  {
    "title": "House Votes to Restrict China’s Global Ties If Taiwan Threatened",
    "description": "The US House on Tuesday passed a bill that would seek to exclude China from global financial institutions if it were to threaten Taiwan and pose a danger to American interests. The legislation would establish US policy to block Chinese …",
    "link": "https://www.insurancejournal.com/news/national/2026/02/11/857724.htm",
    "timestamp": "2026-02-11T14:16:37Z"
  },
  {
    "title": "Democrats Furious Over Justice Department Attempt to Indict Them",
    "description": "The Department of Justice tried and failed to indict Democrats in Congress who made a video urging troops not to obey illegal orders. Now the legislators are triumphant, but also furious. A federal grand jury on Tuesday refused to indict the members of Congre…",
    "link": "https://newrepublic.com/post/206449/democrats-furious-justice-department-attempt-indict",
    "timestamp": "2026-02-11T14:10:50Z"
  },
  {
    "title": "Peter Navarro Blames Horrific Jobs Report On Undocumented Workers",
    "description": "On the heels of the terrible December retail sales report, coupled with a rise in inflation, White House economic advisor Peter Navarro egregiously claimed the January jobs report will be bad because of illegal immigration.\nWTF? \nMigrants and undocumented wor…",
    "link": "https://crooksandliars.com/2026/02/scumbag-peter-navarro-blames-horrific-jobs",
    "timestamp": "2026-02-11T14:08:44Z"
  },
  {
    "title": "Trump Falsely Claims ‘I’m Popular’ in Fox Interview — Says His Economy ‘Greatest Ever in History Actually’",
    "description": "President Donald Trump declared \"I'm popular\" and his economy the \"greatest ever in history\" on Fox — even as he polls in the 30's on both counts.\nThe post Trump Falsely Claims ‘I’m Popular’ in Fox Interview — Says His Economy ‘Greatest Ever in History Actual…",
    "link": "https://www.mediaite.com/media/tv/trump-falsely-claims-im-popular-in-fox-interview-says-his-economy-greatest-ever-in-history-actually/",
    "timestamp": "2026-02-11T14:07:24Z"
  },
  {
    "title": "Six months after explosion, Pennsylvania mill town sees hope but a history of disappointment",
    "description": "Six months ago, an explosion at the U.S. Steel Clairton Coke Works killed two people",
    "link": "https://abcnews.com/US/wireStory/months-after-explosion-pennsylvania-mill-town-sees-hope-130058130",
    "timestamp": "2026-02-11T14:05:57Z"
  },
  {
    "title": "J.P. Cooney, ex-Trump prosecutor in Jack Smith's office, is running for Congress",
    "description": "Jack Smith's former deputy J.P.",
    "link": "https://www.nbcnews.com/politics/2026-election/jp-cooney-trump-jack-smith-prosecutor-running-for-congress-virginia-rcna258505",
    "timestamp": "2026-02-11T14:05:23Z"
  },
  {
    "title": "U.S. House poised to vote against Trump's tariffs on Canada",
    "description": "The U.S. House of Representatives is poised to vote Wednesday on a resolution against President Donald Trump's tariffs on Canadian goods, and there's evidence that enough Republicans have grown tired of the trade war that the vote could pass.",
    "link": "https://www.cbc.ca/news/world/trump-tariffs-canada-house-representatives-vote-congress-9.7084213",
    "timestamp": "2026-02-11T14:03:29Z"
  },
  {
    "title": "Breaking down mentions of cannibalism, 'ritualistic sacrifice' in Epstein files[5:51 PM]",
    "description": "The U.S. Department of Justice's documents released in January 2026 pertaining to Jeffrey Epstein reference cannibalism and accuse Epstein, or his inner circle, of engaging in \"ritualistic sacrifice.\"",
    "link": "https://www.snopes.com//fact-check/epstein-files-cannibalism-sacrifices/",
    "timestamp": "2026-02-11T14:00:00Z"
  },
  {
    "title": "Stephen Dyer: GOP Sponsors a Bill That Will Screw Trump Voters",
    "description": "Stephen Dyer, former legislator and critic of school privatization in Ohio, explains here how a Republican-sponsored bill will hit Republican districts hardest. He writes on his blog Tenth Period: It’s no secret that over the last decade, Ohio has gone from a…",
    "link": "https://dianeravitch.net/2026/02/11/stephen-dyer-gop-sponsors-a-bill-that-will-screw-trump-voters/",
    "timestamp": "2026-02-11T14:00:00Z"
  },
  {
    "title": "How Democratic Socialists of America Has Developed Into a “Movement Party”",
    "description": "The rapid growth of DSA in recent decades is part of a global phenomenon of voters and activists from the Left and Right who distrust the political establishment and traditional parties, and have formed what scholar Fabian Holt calls “movement parties.”",
    "link": "https://inthesetimes.com/article/democratic-socialists-of-america-dsa-zohran-mamdani",
    "timestamp": "2026-02-11T14:00:00Z"
  },
  {
    "title": "Wednesday, February 11, 2026",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-february-11-2026/",
    "timestamp": "2026-02-11T13:59:37Z"
  },
  {
    "title": "US' curbs on Venezuela oil business unfairly target Russia: Lavrov",
    "description": "Kremlin spokesman Dmitry Peskov told reporters that Russia would clarify the situation with Washington",
    "link": "https://www.business-standard.com/world-news/us-curbs-on-venezuela-oil-business-unfairly-target-russia-lavrov-126021101508_1.html",
    "timestamp": "2026-02-11T13:59:06Z"
  },
  {
    "title": "Jon Stewart mocks MAGA ‘victimhood’ over Bad Bunny Super Bowl Halftime Show: ‘Pathetic’",
    "description": "Jon Stewart has confronted MAGA criticism of Bad Bunny‘s Super Bowl Halftime Show by asking one important question: “When did the right become such f****** p******?” The political commentator and comedian took to The Daily Show on Monday (9 February) to mock …",
    "link": "https://www.thepinknews.com/2026/02/11/jon-stewart-bad-bunny-super-bowl-halftime-show/",
    "timestamp": "2026-02-11T13:58:31Z"
  },
  {
    "title": "Jessica Alba breaks silence on Bad Bunny show where she stole the spotlight",
    "description": "Three days after the Super Bowl, the Halftime Show is still being talked about as much or more than the performance of Seattle&apos;s defense or the lack of reaction from the Patri",
    "link": "https://www.marca.com/en/nfl/super-bowl/2026/02/11/698c89c846163f87128b459a.html",
    "timestamp": "2026-02-11T13:58:20Z"
  },
  {
    "title": "Nancy Guthrie kidnapping: Masked suspect caught on camera; what happened after man detained",
    "description": "News outlets later interviewed a man who said he was questioned and released. Authorities have not confirmed that the person they picked up was released.",
    "link": "https://indianexpress.com/article/world/us-news/nancy-guthrie-kidnapping-updates-fbi-video-masked-man-tucson-suspect-detained-10527046/",
    "timestamp": "2026-02-11T13:56:42Z"
  },
  {
    "title": "Why Vietnam Just Does Not Trust the US Government: ‘The Second U.S. Invasion Plan’ and Regime Change in Hanoi?",
    "description": "It might sound crazy to think that Washington’s political establishment would once again authorize the US military to invade Vietnam, but to Vietnamese officials in Hanoi, it’s not.  \nAccording to the Associated Press (AP), \n“A year after Vietnam elevated …\nT…",
    "link": "https://www.globalresearch.ca/vietnam-not-trust-us-government/5915341",
    "timestamp": "2026-02-11T13:53:20Z"
  },
  {
    "title": "Russian border region targeted in ‘massive’ Ukrainian drone attack – governor",
    "description": "Ukrainian forces have targeted Russia’s Belgorod Region with a “massive drone attack,” Governor Vyacheslav Gladkov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632307-belgorod-ukraine-drone-attacks/",
    "timestamp": "2026-02-11T13:51:39Z"
  },
  {
    "title": "'Never ever in history': Expert reveals new details about El Paso airspace closure",
    "description": "CNN's Pete Muntean could not hide his shock at the Federal Aviation Administration's \"unprecedented\" overnight move to shut down a U.S. airport for more than a week.The FAA closed the airspace over El Paso, Texas, for 10 days without explanation, but Muntean …",
    "link": "https://www.rawstory.com/airspace-shutdown-never-in-history/",
    "timestamp": "2026-02-11T13:50:51Z"
  },
  {
    "title": "The “Politics of Hate”: “Weaponized Discord” Is the Deep State’s Most Effective Tool. “Love is Powerful”",
    "description": "What we are witnessing in America today is a deliberate effort to rebrand cruelty as strength, division as patriotism, and hatred as love of country.\nThe post The “Politics of Hate”: “Weaponized Discord” Is the Deep State’s Most Effective Tool. “Love is Power…",
    "link": "https://www.globalresearch.ca/politics-hate-weaponized-discord-deep-state-effective-tool/5915380",
    "timestamp": "2026-02-11T13:48:57Z"
  },
  {
    "title": "U.S. Olympian torches ICE, Trump in Italy: ‘What’s happening in Minnesota is wrong’",
    "description": "Another U.S. Olympian has come out against President Donald Trump's immigration policies.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_4ede67f2-a770-480b-aea8-0da9fcc8bcd3",
    "timestamp": "2026-02-11T13:47:58Z"
  },
  {
    "title": "US jobs see surprise growth in January after weak 2025",
    "description": "Employers added a greater than expected 130,000 jobs in January, according to the latest figures.",
    "link": "https://www.bbc.co.uk/news/articles/c5y5xjzpr52o",
    "timestamp": "2026-02-11T13:47:50Z"
  },
  {
    "title": "Trump said \"everyone has known\" about Epstein in call to police two decades ago, records show",
    "description": "Newly surfaced records show that 20 years ago, then-private citizen Donald Trump called police in Palm Beach, Florida, about Jeffrey Epstein. He told police, \"Thank goodness you're stopping him. Everyone has known he's been doing this.\" The call contradicts P…",
    "link": "https://www.cbsnews.com/video/trump-said-everyone-has-known-about-epstein-in-call-to-police-two-decades-ago-records-show/",
    "timestamp": "2026-02-11T13:46:00Z"
  },
  {
    "title": "Russia to fly its tourists out of Cuba and then suspend airline operations due to fuel crisis",
    "description": "MOSCOW, Feb ⁠11 (Reuters) - Two Russian airlines plan ⁠to fly Russian tourists ‌out of Cuba in the coming days and then suspend operations until a ​jet fuel shortage ⁠eases, aviation regulator ⁠Rosaviatsia said on Wednesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/11/russia-to-fly-its-tourists-out-of-cuba-and-then-suspend-airline-operations-due-to-fuel-crisis",
    "timestamp": "2026-02-11T13:45:00Z"
  },
  {
    "title": "The rise of ‘Merzoni’: How an alliance between Germany’s and Italy’s leaders is reshaping Europe",
    "description": "The center of gravity in Europe is increasingly aligning along a Rome-Berlin axis.",
    "link": "https://theconversation.com/the-rise-of-merzoni-how-an-alliance-between-germanys-and-italys-leaders-is-reshaping-europe-275387",
    "timestamp": "2026-02-11T13:43:05Z"
  },
  {
    "title": "Martha Washington’s enslaved maid Ona Judge made a daring escape to freedom – but the National Park Service has erased her story from Philadelphia exhibit",
    "description": "Ona Judge was one of 9 people George Washington owned when he lived in the President’s House in Philadelphia.",
    "link": "https://theconversation.com/martha-washingtons-enslaved-maid-ona-judge-made-a-daring-escape-to-freedom-but-the-national-park-service-has-erased-her-story-from-philadelphia-exhibit-274394",
    "timestamp": "2026-02-11T13:42:40Z"
  },
  {
    "title": "Russia to fly its tourists out of Cuba and then suspend airline operations due to fuel crisis",
    "description": "MOSCOW, Feb 11 (Reuters) - Two Russian airlines plan to fly Russian tourists out of Cuba in the coming days and then suspend operations until a jet fuel shortage eases, a… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/11/russia-to-fly-its-tourists-out-of-cuba-and-then-suspend-airline-operations-due-to-fuel-crisis",
    "timestamp": "2026-02-11T13:41:18Z"
  },
  {
    "title": "Take a look inside Greenland's only fully operational mine, where miners live half the year and brave Arctic conditions",
    "description": "Greenland is believed to hold significant deposits of rare-earth elements. Mining them, however, is another story.",
    "link": "https://www.businessinsider.com/greenland-mining-conditions-minerals-rare-earths-2026-2",
    "timestamp": "2026-02-11T13:41:01Z"
  },
  {
    "title": "U.S. payrolls rose by 130,000 in January, more than expected; unemployment rate at 4.3%",
    "description": "Nonfarm payrolls were expected to increase by 55,000 in January while the unemployment rate held at 4.4%, according to the Dow Jones consensus estimate.",
    "link": "https://www.cnbc.com/2026/02/11/jobs-report-january-2026-.html",
    "timestamp": "2026-02-11T13:39:55Z"
  },
  {
    "title": "Russia says it will stick to New START's nuclear arms limits as long as US does",
    "description": "The New START treaty expired Feb. 5, leaving no restrictions on the two largest atomic arsenals for the first time in more than a half-century and fueling fears of an unconstrained nuclear arms race.",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-says-it-will-stick-to-new-starts-nuclear-arms-limits-as-long-as-us-does/articleshow/128209707.cms",
    "timestamp": "2026-02-11T13:39:19Z"
  },
  {
    "title": "Grand jury refuses to indict six Democratic lawmakers Trump accused of ‘seditious behavior’",
    "description": "A federal grand jury refused to hand up an indictment Tuesday against six Democratic lawmakers accused by President Trump of “seditious behavior” this past fall. DC US Attorney Jeanine Pirro led the failed effort to indict Reps. Jason Crow (D-Colo.), Maggie G…",
    "link": "https://freerepublic.com/focus/f-news/4366402/posts",
    "timestamp": "2026-02-11T13:38:50Z"
  },
  {
    "title": "Trump can expect to 'watch the defeats roll in' after brutal Tuesday losses: report",
    "description": "Donald Trump's administration experienced two significant setbacks Tuesday, signaling challenges ahead for the White House.Commerce Secretary Howard Lutnick faced questioning about his relationship with convicted sex trafficker Jeffrey Epstein during one hear…",
    "link": "https://www.rawstory.com/trump-defeats-will-roll-in/",
    "timestamp": "2026-02-11T13:38:27Z"
  },
  {
    "title": "American Actions Regarding Greenland Damaged Trust in US - Swedish Prime Minister",
    "description": "MOSCOW (Sputnik) - US actions regarding Denmark and Greenland have damaged trust in the United States, Swedish Prime Minister Ulf Kristersson said in an interview published on Wednesday.",
    "link": "https://sputnikglobe.com/20260211/american-actions-regarding-greenland-damaged-trust-in-us---swedish-prime-minister-1123621304.html",
    "timestamp": "2026-02-11T13:36:57Z"
  },
  {
    "title": "Netanyahu to urge expanded Iran talks during White House meeting",
    "description": "President Donald Trump and Israeli Prime Minister Benjamin Netanyahu are expected to discuss new nuclear talks with Iran.",
    "link": "https://www.wcvb.com/article/trump-netanyahu-israel-iran-negotiations/70311386",
    "timestamp": "2026-02-11T13:35:26Z"
  },
  {
    "title": "WATCH LIVE: Pam Bondi appears at House Judiciary Committee hearing on Justice Department oversight",
    "description": "Bondi will face questions from lawmakers Wednesday over the Justice Department's handling of files related to Jeffrey Epstein that have exposed sensitive private information about victims despite redaction efforts.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-pam-bondi-appears-at-house-judiciary-committee-hearing-on-justice-department-oversight",
    "timestamp": "2026-02-11T13:35:10Z"
  },
  {
    "title": "Russia, US Discuss Differences Between New START, Potential New Agreement - Vance",
    "description": "WASHINGTON (Sputnik) - Russia and the United States are discussing differences between a potential new arms control agreement and the previous New Strategic Arms Reduction Treaty (New START), US Vice President JD Vance said on Wednesday.",
    "link": "https://sputnikglobe.com/20260211/russia-us-discuss-differences-between-new-start-potential-new-agreement---vance-1123621163.html",
    "timestamp": "2026-02-11T13:33:42Z"
  },
  {
    "title": "Provoke and Deny: The Obama Cartoon and Decades of Racialized Governance",
    "description": "On a February morning in 2026, the opening days of Black History Month, something unthinkable appeared on the official social media platform of the president of the United States: a video inserting the faces of Barack and Michelle Obama onto cartoon apes, set…",
    "link": "https://www.commondreams.org/opinion/trump-obama-cartoon",
    "timestamp": "2026-02-11T13:33:02Z"
  },
  {
    "title": "GOP congressman scurries as CNN panelists gang up on his excuses for Trump-Epstein scandal",
    "description": "CNN panelists ganged up on a Republican congressman after he attempted to downplay the revelations in the Jeffrey Epstein files.Rep. Mike Haridopolos (R-FL) appeared Wednesday on \"CNN This Morning,\" where he waved away concerns about the Trump administration'…",
    "link": "https://www.rawstory.com/trump-epstein-files-2675258370/",
    "timestamp": "2026-02-11T13:29:31Z"
  },
  {
    "title": "Iran rules out broader U.S. talks as Trump hints at sending 2nd carrier",
    "description": "Iran insisted Wednesday that it was willing to negotiate with the United States over its nuclear program, but ruled out broader talks at a pivotal moment in diplomacy between Washington and Tehran.",
    "link": "https://www.nbcnews.com/world/iran/iran-us-nuclear-talks-trump-carrier-netanyahu-meeting-israel-rcna258495",
    "timestamp": "2026-02-11T13:27:09Z"
  },
  {
    "title": "Outgoing US envoy Kagan meets with PM Anwar in Putrajaya",
    "description": "PETALING JAYA: Outgoing US Ambassador to Malaysia Edgard D. Kagan visited Prime Minister Datuk Seri Anwar Ibrahim in Putrajaya on Wednesday (Feb 11). Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/02/11/outgoing-us-envoy-kagan-meets-with-pm-anwar-in-putrajaya",
    "timestamp": "2026-02-11T13:27:00Z"
  },
  {
    "title": "The Art of the Steal — President Donald Trump seemingly cannot let the 2020 election go. (Vox)",
    "description": "Vox:\nThe Art of the Steal  —  President Donald Trump seemingly cannot let the 2020 election go.  Despite winning convincingly in 2024, including, for the first time in his political career, the popular vote, he remains fixated on the idea that he also won fou…",
    "link": "https://www.memeorandum.com/260211/p20",
    "timestamp": "2026-02-11T13:20:00Z"
  },
  {
    "title": "Trump official a 'warning of something far more sinister lurking' in admin: Nobel winner",
    "description": "The recent admission from Howard Lutnick that he visited Jeffrey Epstein's island is just part of the problem in Donald Trump's administration, a political analyst has claimed. The Secretary of Commerce confirmed he, his wife, and their four children had met …",
    "link": "https://www.rawstory.com/howard-lutnick-epstein-2675258423/",
    "timestamp": "2026-02-11T13:19:30Z"
  },
  {
    "title": "Six men named in US Congress: Why is so much redacted in the Epstein files?",
    "description": "US congressman names six men whose names were redacted in the Epstein files, including a US billionaire and Dubai CEO.",
    "link": "https://www.aljazeera.com/news/2026/2/11/six-men-named-in-us-congress-why-is-so-much-redacted-in-the-epstein-files",
    "timestamp": "2026-02-11T13:19:17Z"
  },
  {
    "title": "Daytime TV’s Big Problem: Video Podcasts Are Much Cheaper",
    "description": "Sky-high production costs and waning audiences are pushing hosts off the dial. Video podcasts may be the final blow to the format.",
    "link": "http://www.hollywoodreporter.com/business/business-news/talk-shows-daytime-tv-video-podcasts-1236502423/",
    "timestamp": "2026-02-11T13:18:29Z"
  },
  {
    "title": "Jury refuses to indict US lawmakers over call to ‘refuse illegal military orders’ – media",
    "description": "A grand jury in Washington has refused to indict Democratic lawmakers over a video urging the US military to “refuse illegal orders” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632296-us-trump-slotkin-kelly/",
    "timestamp": "2026-02-11T13:16:35Z"
  },
  {
    "title": "Except Trump, nobody has stated India's refusal to buy Russian oil: FM Lavrov",
    "description": "Russia's Foreign Minister Sergei Lavrov has stated that only US President Donald Trump claimed India would stop buying Russian oil. Lavrov mentioned that Indian leaders have not made such a declaration. He highlighted that energy security is a key focus for I…",
    "link": "https://economictimes.indiatimes.com/news/india/except-trump-nobody-has-stated-indias-refusal-to-buy-russian-oil-fm-lavrov/articleshow/128209165.cms",
    "timestamp": "2026-02-11T13:16:07Z"
  },
  {
    "title": "Russia says it will stick to New START’s nuclear arms limits as long as US does",
    "description": "Russia's Foreign Minister says Moscow will respect the treaty's limits if the U.S. observes them too.",
    "link": "https://www.bostonherald.com/2026/02/11/russia-start-nuclear-limits-usa/",
    "timestamp": "2026-02-11T13:13:17Z"
  },
  {
    "title": "American auto giant reports record losses",
    "description": "US automaker Ford posted an $8.2 billion net loss for 2025, citing electric vehicle struggles, tariffs, and supply-chain disruptions Read Full Article at RT.com",
    "link": "https://www.rt.com/business/632306-ford-record-losses/",
    "timestamp": "2026-02-11T13:10:22Z"
  },
  {
    "title": "Trump Weighs Second Aircraft Carrier to Gulf in Case Iran Talks Fail: Axios",
    "description": "The USS Abraham Lincoln and its strike group, equipped with fighter jets, Tomahawk missiles and several ships, are already in the region.\nThe post Trump Weighs Second Aircraft Carrier to Gulf in Case Iran Talks Fail: Axios first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-weighs-second-aircraft-carrier-to-gulf-in-case-iran-talks-fail-axios/",
    "timestamp": "2026-02-11T13:08:17Z"
  },
  {
    "title": "Vance warns Iran that 'another option on the table' if nuclear deal not reached",
    "description": "Vice President JD Vance warned Iran that there is \"another option on the table\" if nuclear deal talks fail, citing President Donald Trump's threats.",
    "link": "https://www.foxnews.com/politics/vance-warns-iran-another-option-table-nuclear-deal-not-reached",
    "timestamp": "2026-02-11T13:06:31Z"
  },
  {
    "title": "As Trump Turns His Back on Environmental Justice, States and Cities Must Step Up",
    "description": "One year ago, the Trump administration launched an agenda putting polluting corporations over our health, lives, and future. This week marks the anniversary of the first-ever environmental justice executive order, and yet we are left in the wake of dozens of …",
    "link": "https://www.commondreams.org/opinion/states-cities-environmental-justice",
    "timestamp": "2026-02-11T13:06:03Z"
  },
  {
    "title": "Trump weighs quitting CUSMA trade deal he negotiated",
    "description": "U.S. President Donald Trump is privately musing about exiting the CUSMA trade pact, people familiar with the matter said. Read more.",
    "link": "https://financialpost.com/news/economy/trump-quitting-usmca-trade-pact",
    "timestamp": "2026-02-11T13:05:36Z"
  }
]