[
  {
    "title": "WATCH: LA Protester Ran Over, Kicked by Police Horses as Riots Against ICE Continue",
    "description": "A video has gone viral after a protestor appeared to be stomped on and kicked by LAPD police horses during immigration protests in Los Angeles.",
    "link": "https://www.ibtimes.com/watch-la-protester-ran-over-kicked-police-horses-riots-against-ice-continue-3775281",
    "timestamp": "2025-06-09T14:46:11Z"
  },
  {
    "title": "Will Trump and Musk Bring the Whole MAGA Coalition Down With Them?",
    "description": "Laura Jedeed\n\n\nThe rift between the former first buddies goes well beyond both men, intensifying fractures that have long lurked beneath MAGA’s surface.\r\n\n\r\n\n\nThe post Will Trump and Musk Bring the Whole MAGA Coalition Down With Them? appeared first on The Na…",
    "link": "https://www.thenation.com/article/politics/maga-break-up-trump-musk/",
    "timestamp": "2025-06-09T14:45:49Z"
  },
  {
    "title": "Protests In Los Angeles Intensify After Trump Deploys National Guard",
    "description": "Tensions flared in Los Angeles on Sunday as protests over President Donald Trump’s immigration crackdown entered their third and most violent day. \nThousands rallied downtown after Trump deployed 300 National Guard troops without Gov. Gavin Newsom’s approval,…",
    "link": "https://biztoc.com/x/0a58e9726e3c58ae",
    "timestamp": "2025-06-09T14:44:01Z"
  },
  {
    "title": "Elon Musk backs up Trump amid LA protests",
    "description": "The supportive reposts from Musk came days after his feud with Trump reached a dramatic apex.",
    "link": "https://www.businessinsider.com/elon-musk-backs-up-trump-amid-la-protests-2025-6",
    "timestamp": "2025-06-09T14:41:06Z"
  },
  {
    "title": "Meet the criminal illegal aliens that Los Angeles is rioting about",
    "description": "Convictions include murder, willful cruelty to a child, sexual battery",
    "link": "https://www.wnd.com/2025/06/meet-the-criminal-illegal-aliens-that-los-angeles-is-rioting-about/",
    "timestamp": "2025-06-09T14:40:52Z"
  },
  {
    "title": "‘Arrest Me’: Newsom Dares Trump to Send National Guard to California",
    "description": "After President Donald Trump deployed the National Guard to the Los Angeles area in response to violent protests against Immigration and Customs Enforcement raids, Gov. Gavin... Read More\nThe post ‘Arrest Me’: Newsom Dares Trump to Send National Guard to Cali…",
    "link": "https://www.dailysignal.com/2025/06/09/arrest-me-newsom-dares-trump-to-send-national-guard-to-california/",
    "timestamp": "2025-06-09T14:40:09Z"
  },
  {
    "title": "‘Gold cards’: How Trump wants to eliminate national debt",
    "description": "'I expect there will be a website up called trumpcard.gov in about a week'",
    "link": "https://www.wnd.com/2025/06/gold-cards-how-trump-wants-to-eliminate-national-debt/",
    "timestamp": "2025-06-09T14:40:02Z"
  },
  {
    "title": "Donald Trump vs. California (and everywhere else) (Philip Bump/Washington Post)",
    "description": "Philip Bump / Washington Post:\nDonald Trump vs. California (and everywhere else)  —  What happened in California this weekend was another facet of the president's effort to quash critics.  —  What's important to remember about the fracture that emerged in Los…",
    "link": "https://www.memeorandum.com/250609/p47",
    "timestamp": "2025-06-09T14:40:00Z"
  },
  {
    "title": "'Don't Shoot!' Maxine Waters Begs National Guard Not To Use Guns At Protest",
    "description": "Rep. Maxine Waters (D-CA) pleaded with National Guard troops not to use their weapons against protesters.\n\n\nThe California lawmaker showed up at an anti-ICE demonstration near Los Angeles on Sunday after President Donald Trump ordered the National Guard to be…",
    "link": "https://crooksandliars.com/2025/06/dont-shoot-maxine-waters-begs-national",
    "timestamp": "2025-06-09T14:39:10Z"
  },
  {
    "title": "ABC's Terry Moran is suspended following his social media post calling Trump and Miller haters",
    "description": "ABC News has suspended veteran correspondent Terry Moran for a since-deleted social media post calling Trump administration deputy chief of staff Stephen Miller a “world class hater.”.",
    "link": "https://www.clickondetroit.com/entertainment/2025/06/09/abcs-terry-moran-is-suspended-following-his-social-media-post-calling-trump-and-miller-haters/",
    "timestamp": "2025-06-09T14:37:33Z"
  },
  {
    "title": "Tom Homan Accuses NBC News Of Publishing ‘Dishonest’ Report About Him Threatening To Arrest Gavin Newsom",
    "description": "Border czar Tom Homan accused NBC News on Monday of writing a \"dishonest\" report that he threatened to arrest Democrat California Gov. Gavin Newsom.",
    "link": "https://dailycaller.com/2025/06/09/tom-homan-nbc-news-gavin-newsom-morning-joe/",
    "timestamp": "2025-06-09T14:37:28Z"
  },
  {
    "title": "MTG attack gets furious rebuttal from targeted non-profit chiefs",
    "description": "President Donald Trump's attacks on nonprofit organizations are a massive threat to society and the world as a whole, wrote a pair of NGO directors in a dire analysis published in Newsweek on Monday.\"Representative Marjorie Taylor Greene (R-GA) hosted a congr…",
    "link": "https://www.rawstory.com/trump-ngos/",
    "timestamp": "2025-06-09T14:37:11Z"
  },
  {
    "title": "‘Love Island USA’ Disgraced Contestant Yulissa Escobar Offers Weak Apology For Her Use Of The N-Word",
    "description": "Escobar was removed from the villa just minutes into Season 7, Episode 2.",
    "link": "https://decider.com/2025/06/09/love-island-usa-yulissa-escobar-weak-apology/",
    "timestamp": "2025-06-09T14:37:00Z"
  },
  {
    "title": "Cathie Wood on what Trump and Elon Musk's feud reveals",
    "description": "Tesla's market volatility may be less about politics and more about how deeply embedded Musk's businesses are in the U.S. government",
    "link": "https://not-qz.com/cathie-wood-elon-musk-donald-trump-feud-tesla-spacex-1851784065",
    "timestamp": "2025-06-09T14:36:35Z"
  },
  {
    "title": "Waymo Suspends Service In L.A. After Protesters Started Ordering Cars Just To Light Them On Fire",
    "description": "Some wild scenes unfolded in Los Angeles over the weekend due to protests stemming from immigration raids in the city. A number of Waymo cars got caught in the crossfire, and the company ultimately opted to suspend services after realizing people were request…",
    "link": "https://brobible.com/culture/article/waymo-suspends-service-los-angeles-protest-fires/",
    "timestamp": "2025-06-09T14:35:47Z"
  },
  {
    "title": "Now That He’s Turned on Trump, Should Democrats Align With Elon Musk?",
    "description": "Jeet Heer\n\n\n\nNo! Hell no! Never! The enemy of your enemy is still a corrupt plutocrat who wants to destroy democracy.\r\n\n\r\n\n\nThe post Now That He’s Turned on Trump, Should Democrats Align With Elon Musk? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-musk-feud-democrats/",
    "timestamp": "2025-06-09T14:35:35Z"
  },
  {
    "title": "‘FFS!’ Musk Forced to Shut Down Wild Claim From His Own AI Bot About Affair With Stephen Miller’s Wife",
    "description": "Musk was forced to publicly shut down a claim by his own AI chatbot Grok after it falsely suggested he'd joked that he'd “taken” Stephen Miller's wife.\nThe post ‘FFS!’ Musk Forced to Shut Down Wild Claim From His Own AI Bot About Affair With Stephen Miller’s …",
    "link": "https://www.mediaite.com/media/news/ffs-musk-forced-to-shut-down-wild-claim-from-his-own-ai-bot-about-affair-with-stephen-millers-wife/",
    "timestamp": "2025-06-09T14:34:10Z"
  },
  {
    "title": "Ukraine’s Narrow Path to Victory Without Trump",
    "description": "How Kyiv and Europe can defeat Russia on their own.",
    "link": "http://foreignpolicy.com/2025/06/09/ukraine-victory-intelligence-diplomacy-europe-defense-trump/",
    "timestamp": "2025-06-09T14:33:22Z"
  },
  {
    "title": "Ukraine’s Narrow Path to Victory Without Trump",
    "description": "How Kyiv and Europe can defeat Russia on their own.",
    "link": "http://foreignpolicy.com/2025/06/09/ukraines-narrow-path-to-victory-without-trump/",
    "timestamp": "2025-06-09T14:33:22Z"
  },
  {
    "title": "Trump Continues Inflaming L.A. Protests: ‘BRING IN THE TROOPS!!!’",
    "description": "President Donald Trump called for the military to be deployed against anti-ICE protests in Los Angeles, California, in a Truth Social post.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-calls-military-crush-la-ice-protests-1235359118/",
    "timestamp": "2025-06-09T14:33:11Z"
  },
  {
    "title": "Cathie Wood on what Trump and Elon Musk's feud reveals",
    "description": "The clash between Elon Musk and President Donald Trump isn’t just political theater; it’s a look into how deeply Musk’s empire depends upon the U.S. government, according to a top investor. Ark Invest CEO Cathie Wood says investors are waking up to the extent…",
    "link": "https://qz.com/cathie-wood-elon-musk-donald-trump-feud-tesla-spacex-1851784065",
    "timestamp": "2025-06-09T14:31:24Z"
  },
  {
    "title": "US-China trade talks in London hang over markets",
    "description": "LONDON: United States-China trade talks in London held markets' attention on Monday (Jun 9), with Asian stocks rising, Wall Street mixed and Europe dipping. The London negotiations, following on",
    "link": "https://www.channelnewsasia.com/business/us-china-trade-talks-london-markets-shares-5171551",
    "timestamp": "2025-06-09T14:31:10Z"
  },
  {
    "title": "California to sue Trump administration for deploying National Guard to L.A.",
    "description": "California Gov. Gavin Newson posted on social media that \" Commandeering a state's National Guard without consulting the Governor of that state is illegal and immoral.\"",
    "link": "https://www.cbsnews.com/news/trump-national-guard-california-lawsuit-gavin-newsom/",
    "timestamp": "2025-06-09T14:30:41Z"
  },
  {
    "title": "Trump opened the door to the LGBTQ+ community. Now activists say he's their top threat",
    "description": "The threat from the White House contrasts with World Pride celebrations taking place this month in Washington.",
    "link": "https://richmond.com/news/nation-world/article_d08206a5-d0db-52cc-babb-6bc76a29bbc8.html",
    "timestamp": "2025-06-09T14:30:00Z"
  },
  {
    "title": "Trump opened the door to the LGBTQ+ community. Now activists say he's their top threat",
    "description": "The threat from the White House contrasts with World Pride celebrations taking place this month in Washington.",
    "link": "https://roanoke.com/news/nation-world/article_de7a3823-bebf-57fb-b994-9a79a7fd5c20.html",
    "timestamp": "2025-06-09T14:30:00Z"
  },
  {
    "title": "Trump Tariffs Crash European Business Travel to U.S.",
    "description": "Europeans are scaling back business trips to the United States amid the Trump administration’s intensifying hostilities toward trade partners and immigrant visitors. European business travel bookings to the U.S. in April dropped 26 percent compared to the sam…",
    "link": "https://www.hospitalitynet.org/external/4127583.html",
    "timestamp": "2025-06-09T14:29:29Z"
  },
  {
    "title": "Ken Moelis to depart as CEO of $4.6 billion investment bank",
    "description": "He will take on the role of executive chairman later this year and continue advising clients.",
    "link": "https://nypost.com/2025/06/09/business/ken-moelis-to-depart-as-ceo-of-4-6-billion-investment-bank/",
    "timestamp": "2025-06-09T14:29:10Z"
  },
  {
    "title": "California City Terminates “Divisive” ICE Contract Amid L.A. Protests",
    "description": "Glendale, California, which is located just minutes from Los Angeles where anti-ICE protests erupted this weekend, has decided to end a contract with Immigration and Customs Enforcement to hold detainees in its jail. \r\nIn a press release Sunday, city official…",
    "link": "https://newrepublic.com/post/196282/glendale-ends-ice-contract-la-california-protests",
    "timestamp": "2025-06-09T14:28:41Z"
  },
  {
    "title": "ABC’s Terry Moran is suspended following his social media post calling Trump and Miller haters",
    "description": "ABC News has suspended Terry Moran for a social media post calling Stephen Miller a “world class hater.”",
    "link": "https://www.bostonherald.com/2025/06/09/abc-terry-moran-stephen-miller/",
    "timestamp": "2025-06-09T14:27:51Z"
  },
  {
    "title": "LAFC Fans Protest ICE During Match, Unfurl Banners, Chant 'F*** ICE'",
    "description": "Protests over immigration raids spilled into an MLS stadium on Sunday ... with LAFC fans making their anti-ICE stances known loud and clear during the middle of the Los Angeles club's game against Kansas City. Multiple people hit BMO Stadium near…\n Permalink",
    "link": "https://www.tmz.com/2025/06/09/lafc-fans-protest-ice-during-match-unfurl-banners-chant/",
    "timestamp": "2025-06-09T14:25:51Z"
  },
  {
    "title": "The LA riots could destroy Donald Trump’s presidency",
    "description": "We’re only a few days into the anti-riot crackdowns in Los Angeles by various armed government enforcers and already there are lives at stake. No, not the lives of the hundreds of protesters out on the streets across America’s second-largest city, but the pol…",
    "link": "https://freerepublic.com/focus/f-chat/4321873/posts",
    "timestamp": "2025-06-09T14:24:40Z"
  },
  {
    "title": "Tennis legend Martina Navratilova puts politics aside in fight for fairness in women's sports",
    "description": "Tennis legend Martina Navratilova once again stood strong when faced with questions about her stance on transgender athletes in women's sports.",
    "link": "https://www.foxnews.com/sports/tennis-legend-martina-navratilova-puts-politics-aside-fight-fairness-womens-sports",
    "timestamp": "2025-06-09T14:23:54Z"
  },
  {
    "title": "Murphy: ‘This Is a Moment Where We Have to Be on the Streets All Over the Country’",
    "description": "Monday on MSNBC’s “Morning Joe,” while insisting to “keep it peaceful,” Sen. Chris Murphy (D-CT) called for more protests around the country as rioting is underway in Los Angeles tied to the Trump administration’s deportation effort. The Connecticut Democrat …",
    "link": "https://freerepublic.com/focus/f-news/4321872/posts",
    "timestamp": "2025-06-09T14:23:16Z"
  },
  {
    "title": "LA Protests: Kamala Harris Calls Trump ICE Raids ‘Cruel’, Defends ‘Overwhelmingly Peaceful’ Public Objections",
    "description": "Trump border czar Tom Homan threatens to arrest Mayor Karen Bass and Governor Gavin Newsom if they interfere in ICE deportation raids\nThe post LA Protests: Kamala Harris Calls Trump ICE Raids ‘Cruel’, Defends ‘Overwhelmingly Peaceful’ Public Objections appear…",
    "link": "http://bossip.com/3098529/trump-border-czar-threatens-to-arrest-mayor-bass-and-governor-newsom/",
    "timestamp": "2025-06-09T14:22:53Z"
  },
  {
    "title": "UN treaty aims to protect international waters and their inhabitants",
    "description": "UN Secretary-General Antonio Guterres on Monday is urging world leaders to ratify a treaty that would allow nations to establish protected marine areas in international waters, warning that human activity was destroying ocean ecosystems.",
    "link": "https://www.cbc.ca/news/science/oceans-treaty-1.7555981",
    "timestamp": "2025-06-09T14:22:52Z"
  },
  {
    "title": "US-China trade, inflation, Apple's big event: Here's what the stock market is watching this week",
    "description": "In addition to inflation and US-China trade, a key bond auction is on investors' radar. A $22 billion sale of 30-year bonds is scheduled for Thursday.",
    "link": "https://www.businessinsider.com/stock-market-this-week-us-china-inflation-apple-bond-yields-2025-6",
    "timestamp": "2025-06-09T14:22:35Z"
  },
  {
    "title": "Trump Warns Musk Not to Back Democrats",
    "description": "President Donald Trump said Elon Musk will pay “very serious consequences” if the billionaire tech mogul funds Democratic candidates that challenge lawmakers who backed Republicans’ tax-and-spending bill.\nTrump, in a phone interview with NBC News’ Kristen Wel…",
    "link": "https://biztoc.com/x/48d07e022f1332be",
    "timestamp": "2025-06-09T14:21:59Z"
  },
  {
    "title": "'Like a parasite': Cost-slashing backfires as workers paid $21M to do nothing",
    "description": "The U.S. Department of Education is paying millions to employees forced to go on leave by the Trump administration, according to a union analysis.The American Federation of Government Employees Local 252, which represents DOE workers, found the endangered age…",
    "link": "https://www.rawstory.com/trump-department-of-education-2672334810/",
    "timestamp": "2025-06-09T14:21:28Z"
  },
  {
    "title": "Trump Clears U.S. For Supersonic Flights Ending +50 Year Ban",
    "description": "President Trump has issued an executive order “leading the world in supersonic flight” which requires the FAA to remove supersonic flight restrictions in U.S. airspace.",
    "link": "https://www.forbes.com/sites/marisagarcia/2025/06/09/trump-clears-us-for-supersonic-flights-ending-50-year-ban/",
    "timestamp": "2025-06-09T14:17:41Z"
  },
  {
    "title": "YouTube Makes Adjustments to Its Moderation Guidelines",
    "description": "The changes allow controversial content to remain on YouTube as long as it is considered to be in the public’s interest.",
    "link": "https://www.adweek.com/media/youtube-makes-adjustments-to-its-moderation-guidelines/",
    "timestamp": "2025-06-09T14:16:42Z"
  },
  {
    "title": "Iran to present counterproposal for nuclear deal to US via Oman",
    "description": "Tehran indicates it will not accept the US proposal made during the fifth round of talks last month.",
    "link": "https://www.aljazeera.com/news/2025/6/9/iran-to-present-nuclear-counter-proposal-to-us-via-mediator-oman",
    "timestamp": "2025-06-09T14:16:17Z"
  },
  {
    "title": "Trump’s Diplomacy of the Absurd",
    "description": "South African President Cyril Ramaphosa’s visit to the White House last month was supposed to reset relations with America. Instead, Ramaphosa and his multiracial delegation were mere props in US President Donald Trump’s absurdist spectacle, which was designe…",
    "link": "https://www.project-syndicate.org/commentary/donald-trump-cyril-ramaphosa-oval-office-meeting-absurdist-theater-by-adekeye-adebajo-2025-06",
    "timestamp": "2025-06-09T14:16:15Z"
  },
  {
    "title": "John Oliver Brushes Off the Idea That Trump Being in the Epstein Files Is a ‘Bombshell’",
    "description": "The HBO host also explains why Bravo's Andy Cohen really should be allowed to host a reunion between the men\nThe post John Oliver Brushes Off the Idea That Trump Being in the Epstein Files Is a ‘Bombshell’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/elon-musk-trump-fighting-epstein-files-john-oliver-reaction/",
    "timestamp": "2025-06-09T14:16:10Z"
  },
  {
    "title": "As Musk exits, DOGE employees are being booted from offices; many fired staff now being rehired",
    "description": "Following Elon Musk's departure from the Trump administration, his Department of Government Efficiency (DOGE) is collapsing, leading to the removal of his allies and the reinstatement of previously fired government employees. This reversal is fueled by Musk- …",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-musk-exits-doge-employees-are-being-booted-from-offices-many-fired-staff-now-being-rehired/articleshow/121730883.cms",
    "timestamp": "2025-06-09T14:14:50Z"
  },
  {
    "title": "Newsom Confirms He’s Suing Trump: ‘Illegally Acted to Federalize the National Guard’",
    "description": "Newsom has never read the Insurrection Act.\nThe post Newsom Confirms He’s Suing Trump: ‘Illegally Acted to Federalize the National Guard’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/newsom-confirms-hes-suing-trump-illegally-acted-to-federalize-the-national-guard/",
    "timestamp": "2025-06-09T14:10:39Z"
  },
  {
    "title": "Trump directs a new threat at Elon Musk, with an eye toward the 2026 midterm elections (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nTrump directs a new threat at Elon Musk, with an eye toward the 2026 midterm elections  —  The president warned his top campaign donor he'll face “very serious consequences” if Musk dares to support candidates Trump doesn't like.  —  As D…",
    "link": "https://www.memeorandum.com/250609/p44",
    "timestamp": "2025-06-09T14:10:01Z"
  },
  {
    "title": "Japan and South Korea agree to deal with geopolitical crises under three-way cooperation with the US",
    "description": "South Korean President Lee Jae-myung and Japanese Prime Minister Shigeru Ishiba agreed to address geopolitical crises under the framework of trilateral cooperation with the United States. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/09/japan-and-south-korea-agree-to-deal-with-geopolitical-crises-under-three-way-cooperation-with-the-us",
    "timestamp": "2025-06-09T14:10:00Z"
  },
  {
    "title": "Billie Eilish’s brother Finneas tear-gassed at Los Angeles immigration protests, accuses National Guard of ‘inciting’ violence",
    "description": "Older brother of pop star was among thousands protesting against immigration raids",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/finneas-la-protests-ice-billie-eilish-b2766482.html",
    "timestamp": "2025-06-09T14:09:52Z"
  },
  {
    "title": "Shein seen boosting Indian manufacturing as U.S.-China trade war shakes up supply chains",
    "description": "Fast fashion giant Shein is reportedly set to begin boosting its manufacturing in India with a view to bolstering its international supply chains amid the ongoing U.S.-China trade war.",
    "link": "https://www.cnbc.com/2025/06/09/shein-seen-boosting-indian-manufacturing-amid-us-china-trade-war-.html",
    "timestamp": "2025-06-09T14:09:01Z"
  },
  {
    "title": "Trump border czar responds to Newsom's 'arrest me' challenge as California riots over ICE raids",
    "description": "Trump border czar Homan responds to Gov. Newsom's 'arrest me' challenge amid LA anti-ICE riots, clarifying comments about consequences for impeding immigration operations.",
    "link": "https://www.foxnews.com/media/trump-border-czar-responds-newsoms-arrest-me-challenge-california-riots-over-ice-raids",
    "timestamp": "2025-06-09T14:07:38Z"
  },
  {
    "title": "Newsom Says California Is Suing Trump After ‘Illegally’ Deploying National Guard",
    "description": "The golden state governor says President Trump \"flamed the fires\" amid attacks against law enforcement over the weekend in L.A.\nThe post Newsom Says California Is Suing Trump After ‘Illegally’ Deploying National Guard appeared first on TheWrap.",
    "link": "https://www.thewrap.com/newsom-california-suing-trump-illegally-calling-national-guard-la/",
    "timestamp": "2025-06-09T14:07:25Z"
  },
  {
    "title": "\"Very Serious Consequences\": Trump Issues New Threat to Elon Musk",
    "description": "All hell broke loose last week, when billionaire Elon Musk and president Donald Trump's once-flourishing bromance collapsed in dramatic fashion.",
    "link": "https://futurism.com/trump-issues-new-threat-elon-musk",
    "timestamp": "2025-06-09T14:07:06Z"
  },
  {
    "title": "Heavyweight Champ Has a Challenge for Trump",
    "description": "World heavyweight boxing champ Oleksandr Usyk has an unusual offer for Donald Trump: Come live at my place in Ukraine for a week—rockets overhead included. Usyk issued the challenge in separate interviews with CNN and the BBC . \"Only one week,\" he told the BB…",
    "link": "https://www.newser.com/story/369956/heavyweight-champ-has-a-challenge-for-trump.html",
    "timestamp": "2025-06-09T14:06:00Z"
  },
  {
    "title": "US stocks drift and Chinese markets rise as trade talks start between the world’s largest economies",
    "description": "U.S. stock indexes are nearly stuck in place as the world’s two largest economies begin talks on trade that could help avoid a recession.",
    "link": "https://www.bostonherald.com/2025/06/09/stock-market-us-china-talks/",
    "timestamp": "2025-06-09T14:03:15Z"
  },
  {
    "title": "LA Exploding in Protests and Raids, Does Disneyland Still Have a Bubble of Calm?",
    "description": "Los Angeles has been the center of escalating tensions following a controversial immigration crackdown and the unprecedented deployment of the National Guard by the federal government. Over the past several days, thousands of protesters have taken to the stre…",
    "link": "https://insidethemagic.net/2025/06/la-protest-raids-disneyland-calm-ad1/",
    "timestamp": "2025-06-09T14:02:48Z"
  },
  {
    "title": "Millions of student loan borrowers were promised an interest-free break. This woman's debt is still growing",
    "description": "The Education Department has promised student loan borrowers in the SAVE forbearance that interest accrual is paused. Why did this woman see her balance grow?",
    "link": "https://www.cnbc.com/2025/06/09/student-loan-borrower-in-save-forbearance-says-interest-growing.html",
    "timestamp": "2025-06-09T14:02:14Z"
  },
  {
    "title": "Republican rep indicates he's 'a no' on Trump-backed rescissions measure",
    "description": "Republican Rep. Don Bacon told the New York Times that he has has indicated he's \"a no\" on the rescissions measure Trump wants Congress to pass.",
    "link": "https://www.foxnews.com/politics/republican-rep-indicates-hes-a-no-trump-backed-rescissions-proposal",
    "timestamp": "2025-06-09T14:01:39Z"
  },
  {
    "title": "Republican rep indicates he will be 'a no' on Trump-backed rescissions measure if AIDS relief cut",
    "description": "Republican Rep. Don Bacon told the New York Times that he has has indicated he's \"a no\" on the rescissions measure Trump wants Congress to pass.",
    "link": "https://www.foxnews.com/politics/republican-rep-indicates-he-a-no-trump-backed-rescissions-measure-aids-relief-cut",
    "timestamp": "2025-06-09T14:01:39Z"
  },
  {
    "title": "Southern Baptists target porn, sports betting, same-sex marriage and 'willful childlessness'",
    "description": "Southern Baptists meeting this week in Dallas will be asked to approve resolutions calling for a legal ban on pornography and a reversal of the U.S. Supreme Court's approval of same-sex marriage.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/southern-baptists-target-porn-sports-betting-sex-marriage-willful-chil-rcna211799",
    "timestamp": "2025-06-09T14:01:06Z"
  },
  {
    "title": "NATO boss warns 'learn Russian' as he predicts war in Europe...",
    "description": "NATO Secretary-General Mark Rutte has warned that it could soon be time to 'get your Russian language course out'",
    "link": "https://www.the-express.com/news/world-news/174272/nato-boss-warns-learn-russian-he-predicts-war-europe-next-five-years",
    "timestamp": "2025-06-09T14:00:03Z"
  },
  {
    "title": "Golden Dome: An aerospace engineer explains the proposed US-wide missile defense system",
    "description": "In May 2025, President Donald Trump announced a plan to build a missile defense system, called the Golden Dome. How exactly does it work?",
    "link": "https://www.space.com/astronomy/earth/golden-dome-an-aerospace-engineer-explains-the-proposed-us-wide-missile-defense-system",
    "timestamp": "2025-06-09T14:00:00Z"
  },
  {
    "title": "U.S., China to resume trade talks as focus shifts to critical minerals",
    "description": "The U.S. and China are set to resume trade negotiations in London on Monday in a bid to further defuse tensions over rare-earth minerals and advanced technology following a phone call between leaders \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n and \n \n \n \n \n \n Xi Jinp…",
    "link": "https://biztoc.com/x/e90493319ab922c5",
    "timestamp": "2025-06-09T13:59:58Z"
  },
  {
    "title": "Outside the Box: AI’s Take on the Musk–Trump Showdown",
    "description": "US President Donald Trump and his former inseparable sidekick and BFF, Elon Musk, have been putting on a show that resembles two small kids (with rich parents) vying for supremacy in a sandbox, in which someone has scattered some flashy toys. The question of …",
    "link": "https://www.fairobserver.com/politics/outside-the-box-ais-take-on-the-musk-trump-showdown/",
    "timestamp": "2025-06-09T13:59:34Z"
  },
  {
    "title": "Elon Musk vs Donald Trump: Tesla CEO's father reveals reason behind public feud, predicts how it would end",
    "description": "Donald Trump versus Elon Musk feud has hogged all the limelight. The US President and Tesla chief have at loggerheads since the last week.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-vs-donald-trump-tesla-ceos-father-reveals-reason-behind-public-feud-predicts-how-it-would-end/articleshow/121731106.cms",
    "timestamp": "2025-06-09T13:59:10Z"
  },
  {
    "title": "Trump's ICE war spills onto streets: Where's the US headed?",
    "description": "Fueled by intensified immigration enforcement, Los Angeles is witnessing violent protests and a deployment of the National Guard. The situation highlights a deep ideological divide, with the Trump administration prioritizing national sovereignty and critics d…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-ice-war-spills-onto-streets-wheres-the-us-headed/articleshow/121731136.cms",
    "timestamp": "2025-06-09T13:59:08Z"
  },
  {
    "title": "Apple Goes Retro for Its Logos on New WWDC Merch and I'm Here for It",
    "description": "Apple wants you to look good and retro for WWDC 2025 and has limited edition hoodies, t-shirts and baby onesies with the company's original rainbow logo on it.",
    "link": "https://www.cnet.com/tech/mobile/apple-goes-retro-for-its-logos-on-new-wwdc-merch-and-im-here-for-it/",
    "timestamp": "2025-06-09T13:56:00Z"
  },
  {
    "title": "Elon Musk's Father Cautions Him on Feud With Trump: 'Sometimes You Have to Give'",
    "description": "Elon Musk's father is asking for calm in his son's feud with President Donald Trump, saying the two are \"very tired\" and that \"Elon made a mistake.\"",
    "link": "https://www.ibtimes.com/elon-musks-father-cautions-him-feud-trump-sometimes-you-have-give-3775278",
    "timestamp": "2025-06-09T13:55:13Z"
  },
  {
    "title": "Trump’s travel ban takes effect as tensions escalate over immigration enforcement",
    "description": "It applies to citizens of Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.",
    "link": "https://www.pbs.org/newshour/nation/trumps-travel-ban-takes-effect-as-tensions-escalate-over-immigration-enforcement",
    "timestamp": "2025-06-09T13:52:49Z"
  },
  {
    "title": "Murphy: 'This Is a Moment Where We Have to Be on the Streets All Over the Country'",
    "description": "Monday on MSNBC's \"Morning Joe,\" while insisting to \"keep it peaceful,\" Sen. Chris Murphy (D-CT) called for more protests around the country as rioting is underway in Los Angeles tied to the Trump administration's deportation effort.\nThe post Murphy: ‘This Is…",
    "link": "https://www.breitbart.com/clips/2025/06/09/murphy-this-is-a-moment-where-we-have-to-be-on-the-streets-all-over-the-country/",
    "timestamp": "2025-06-09T13:52:13Z"
  },
  {
    "title": "US Government Sued Over Jan. 6 Prosecutions",
    "description": "Five Proud Boys members, including boss Enrique Tarrio, are seeking $100 million in damages over the \"political prosecution\" they faced.",
    "link": "https://www.westernjournal.com/us-government-sued-jan-6-prosecutions/",
    "timestamp": "2025-06-09T13:52:03Z"
  },
  {
    "title": "Car companies are in 'full panic' as China blocks rare-earth magnets",
    "description": "There are signs that China is slowly easing up on restrictions that are crippling supply chains",
    "link": "https://not-qz.com/car-company-rare-earth-magnet-panic-china-us-trade-1851784057",
    "timestamp": "2025-06-09T13:51:24Z"
  },
  {
    "title": "Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops",
    "description": "Thousands of protesters took to the street in Los Angeles on Sunday in response to President Donald Trump's extraordinary deployment of the National Guard.",
    "link": "https://www.bostonherald.com/2025/06/09/los-angeles-trump-protests-intensify/",
    "timestamp": "2025-06-09T13:49:02Z"
  },
  {
    "title": "L.A. Burns",
    "description": "Riots in Los Angeles: President Donald Trump deployed the National Guard in Los Angeles following three days of clashes between protesters and police. The riots were set off when Immigration and Customs Enforcement agents raided workplaces in pursuit of immig…",
    "link": "https://biztoc.com/x/86354c99aead1ade",
    "timestamp": "2025-06-09T13:48:53Z"
  },
  {
    "title": "‘Keep an Eye on the Bigger Picture,’ Says Morgan Stanley About Tesla Stock",
    "description": "Tesla (NASDAQ:TSLA) stock took a sharp hit last week after Elon Musk and Donald Trump – once close buddies – turned on each other in a public social media spat that quickly became an online spectacle. While the internet grabbed its popcorn to watch the drama/…",
    "link": "https://biztoc.com/x/22db689c47d5826b",
    "timestamp": "2025-06-09T13:48:46Z"
  },
  {
    "title": "NATO chief to call for four-fold increase in Europe's air defense spending",
    "description": "Washington’s European allies must make a “quantum leap” in military spending to deter Russia, the head of NATO is expected to say Monday, calling for a 400% increase in the continent’s air and missile defense budget.",
    "link": "https://www.nbcnews.com/world/europe/nato-chief-urge-four-fold-boost-european-defense-spending-rcna211777",
    "timestamp": "2025-06-09T13:48:31Z"
  },
  {
    "title": "Massive' No King' protest planned in more than 1500 US cities to counter Trump's June 14 parade: 10 points",
    "description": "A massive 'No Kings' protest has been planned in US in more than 1500 cities and millions are expected to participate in the parade. The protest is being held to counter US President Donald Trump's June 14 parade. More than 100 pro-democracy advocacy groups a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/massive-no-king-protest-planned-in-more-than-1500-us-cities-to-counter-trumps-june-14-parade-10-points/articleshow/121730782.cms",
    "timestamp": "2025-06-09T13:46:45Z"
  },
  {
    "title": "Putin, Trump Have Working Relationship, Get Straight to Point in Talks – Lavrov",
    "description": "MOSCOW (Sputnik) - Russian President Vladimir Putin and US President Donald Trump maintain a working relationship and immediately address substantive matters during phone conversations, Russian Foreign Minister Sergey Lavrov said on Monday.",
    "link": "https://sputnikglobe.com/20250609/putin-trump-have-working-relationship-get-straight-to-point-in-talks--lavrov-1122219791.html",
    "timestamp": "2025-06-09T13:46:37Z"
  },
  {
    "title": "Apple heads into annual showcase reeling from AI missteps, tech upheaval and Trump's trade war",
    "description": "As Apple heads into this year's showcase, the company faces nagging questions about whether the nearly 50-year-old company has lost some of the mystique and innovative drive that turned it into a tech trendsetter. Instead of making a big splash as it did with…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/apple-heads-into-annual-showcase-reeling-from-ai-missteps-tech-upheaval-and-trumps-trade-war/articleshow/121730977.cms",
    "timestamp": "2025-06-09T13:46:10Z"
  },
  {
    "title": "Photos show Waymo vehicles on fire during L.A. protests as company cuts service",
    "description": "In one photo, at least five Waymo robotaxis can be seen engulfed in flames, with anti-Immigration and Customs Enforcement graffiti scrawled on the doors.",
    "link": "https://www.cnbc.com/2025/06/09/photos-waymo-fire-la-protests.html",
    "timestamp": "2025-06-09T13:45:46Z"
  },
  {
    "title": "Port of Los Angeles sees sharp drop in cargo ships, West Coast dockworkers sit idle",
    "description": "That drop isn’t just a temporary blip. It’s part of a larger slowdown linked to President Donald Trump’s trade war with China.",
    "link": "https://nypost.com/2025/06/09/business/port-of-los-angeles-seeing-sharp-drop-in-cargo-ships/",
    "timestamp": "2025-06-09T13:45:21Z"
  },
  {
    "title": "10 Key Works in “The First Homosexuals: The Birth of a New Identity, 1869-1939”",
    "description": "Forty countries are represented in the exhibition, which decenters Western conceptions of queerness",
    "link": "https://www.artnews.com/list/art-news/artists/the-first-homosexuals-exhibition-wrightwood-659-1234743711/",
    "timestamp": "2025-06-09T13:45:00Z"
  },
  {
    "title": "Bitcoin 2025: Record Crowds, Bold Visions And The Path To $1 Million",
    "description": "Bitcoin 2025 drew 35,000 attendees with major announcements. Insights from industry leaders highlight Bitcoin’s rise as a macro asset and portfolio diversifier.",
    "link": "https://www.forbes.com/sites/leeorshimron/2025/06/09/bitcoin-2025-record-crowds-bold-visions-and-the-path-to-1-million/",
    "timestamp": "2025-06-09T13:45:00Z"
  },
  {
    "title": "Pointing to protesters, but not ICE agents, Trump demands arrests of those in masks",
    "description": "Donald Trump wants protesters in masks to be taken into custody, but ICE agents in masks are apparently fine.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pointing-protesters-not-ice-agents-trump-demands-arrests-masks-rcna211787",
    "timestamp": "2025-06-09T13:44:43Z"
  },
  {
    "title": "U.S., China to resume trade talks as focus shifts to critical minerals",
    "description": "The U.S. and China are set to resume trade negotiations in London in a bid to defuse tensions over rare-earth minerals. Read more.",
    "link": "https://financialpost.com/commodities/mining/us-china-trade-talks-rare-earths",
    "timestamp": "2025-06-09T13:43:54Z"
  },
  {
    "title": "Stolen pride",
    "description": "Arlie Russell Hochschild does interesting ethnographic work in the heart of Trumpland, and I look forward to at some point reading her latest book. This extended essay (gift link) left me feeling somewhat exasperated, since it adds up to “a bunch of people wi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/stolen-pride",
    "timestamp": "2025-06-09T13:43:13Z"
  },
  {
    "title": "Car companies are in 'full panic' as China blocks rare-earth magnets",
    "description": "Auto companies are feeling the hit from recent Chinese export controls on rare earth magnets.Read more...",
    "link": "https://qz.com/car-company-rare-earth-magnet-panic-china-us-trade-1851784057",
    "timestamp": "2025-06-09T13:43:00Z"
  },
  {
    "title": "US-China trade talks: Is a thaw on the cards after Trump-Xi call?",
    "description": "A new round of talks aimed at resolving trade tensions between the US and China take place in London.",
    "link": "https://www.aljazeera.com/news/2025/6/9/us-china-trade-talks-is-a-thaw-on-the-cards-after-trump-xi-call",
    "timestamp": "2025-06-09T13:42:24Z"
  },
  {
    "title": "Addressing The Alarming Deficit",
    "description": "The feud between President Trump and Elon Musk shows a void that has further polarized our country: a lack of character and values at the highest levels of government.",
    "link": "https://www.forbes.com/sites/harrykraemer/2025/06/09/addressing-the-alarming-deficit/",
    "timestamp": "2025-06-09T13:42:08Z"
  },
  {
    "title": "Ontario Drops American Banks From US-Dollar Bond Sale in First Since 2011",
    "description": "Ontario left American banks out of a US-dollar bond sale for the first time in almost 14 years, choosing Barclays Plc as its foreign bank to help manage a $2 billion debt issue.",
    "link": "https://financialpost.com/pmn/business-pmn/ontario-drops-american-banks-from-us-dollar-bond-sale-in-first-since-2011",
    "timestamp": "2025-06-09T13:40:12Z"
  },
  {
    "title": "Ontario drops American banks from U.S.-dollar bond sale in first since 2011",
    "description": "Province expects to borrow nearly $60 billion in this fiscal year with 30% slated to come from foreign markets. Keep reading here.",
    "link": "https://financialpost.com/investing/ontario-drops-american-banks-from-us-dollar-bond-sale-in-first-since-2011",
    "timestamp": "2025-06-09T13:40:12Z"
  },
  {
    "title": "Musk’s Anger Toward Trump Appears To Cool",
    "description": "Musk also appeared to delete two of his most incendiary tweets about Trump.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/09/musks-anger-toward-trump-appears-to-cool/",
    "timestamp": "2025-06-09T13:40:06Z"
  },
  {
    "title": "Cathie Wood names the one stock she values above all others",
    "description": "While the stock market has certainly seen its share of ups and downs over the year, any investor will tell you that 2025 has been unique in terms of volatility.\nAfter all, it's not every year that a president introduces tariffs of such a sweeping nature as Pr…",
    "link": "https://biztoc.com/x/e8c6c40804f0bc95",
    "timestamp": "2025-06-09T13:37:24Z"
  },
  {
    "title": "Tesla hit with pair of downgrades amid fallout from Trump feud",
    "description": "Shares are down about 27 per cent in 2025, making it the weakest performer of the so-called Magnificent Seven stocks. Keep reading here.",
    "link": "https://financialpost.com/investing/tesla-hit-downgrades-trump-feud",
    "timestamp": "2025-06-09T13:37:12Z"
  },
  {
    "title": "Donald Trump's 'Big Beautiful Bill' Suffers Blow",
    "description": "A poll has suggested Americans do not believe Trump's spending bill will help the working and middle classes.",
    "link": "https://www.newsweek.com/donald-trump-big-beautiful-bill-poll-2082692",
    "timestamp": "2025-06-09T13:34:54Z"
  },
  {
    "title": "‘Worse and more violent’: LA riots escalate",
    "description": "'This thing has gotten out of control'",
    "link": "https://www.wnd.com/2025/06/worse-and-more-violent-la-riots-escalate/",
    "timestamp": "2025-06-09T13:34:03Z"
  }
]