[
  {
    "title": "Middle East latest: Israel threatens to restart war in Gaza if Hamas doesn't release hostages",
    "description": "Israeli PM Netanyahu has threatened to resume war against Hamas if hostages are not released by Saturday, while Hamas accuses Israel of violating the ceasefire by restricting aid. Meanwhile, President Trump pressures Jordan to take in Gaza refugees, proposing…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/middle-east-latest-israel-threatens-to-restart-war-in-gaza-if-hamas-doesnt-release-hostages/articleshow/118170003.cms",
    "timestamp": "2025-02-12T08:20:20Z"
  },
  {
    "title": "Elon Musk rails against 'unelected' bureaucrats as he holds court in the Oval Office",
    "description": "Dressed in a black ‘MAGA’ cap, black t-shirt and overcoat, the Tesla tycoon defended his actions in the White House.",
    "link": "https://www.thejournal.ie/musk-oval-office-6620541-Feb2025/",
    "timestamp": "2025-02-12T08:19:23Z"
  },
  {
    "title": "Mohamed El-Erian Says Trump's 'Uncooperative' Tariff Play Can Benefit America, But Could Lead To 'Welfare Losses' In Long-Term",
    "description": "Allianz Chief Economic Advisor Mohamed El-Erian warned that while President Donald Trump‘s evolving tariff strategy may deliver immediate gains, it risks longer-term economic damage through stagflation and eroded U.S. global influence.\nWhat Happened: El-Erian…",
    "link": "https://biztoc.com/x/14a5dd5f3bed3356",
    "timestamp": "2025-02-12T08:18:16Z"
  },
  {
    "title": "UPDATED: Trump’s Federal Government is Blocking Gender Marker Changes",
    "description": "Here's What You Can Change Right Now, and What You Can't\n \n by Vivian McCall\n \n \n \n Editor's Note: This story was updated on February 12th to reflect new information from the State Department about \"X\" gender markers for passports. The original story was publ…",
    "link": "https://www.thestranger.com/queer/2025/02/12/79897450/updated-trumps-federal-government-is-blocking-gender-marker-changes",
    "timestamp": "2025-02-12T08:16:00Z"
  },
  {
    "title": "Solana ETFs Inch Closer Toward Approval As SEC Acknowledges Filings From Multiple Asset Managers",
    "description": "On Tuesday, the U.S. Securities and Exchange Commission acknowledged several Solana-based exchange-traded fund applications.",
    "link": "https://zycrypto.com/solana-etfs-inch-closer-toward-approval-as-sec-acknowledges-filings-from-multiple-asset-managers/",
    "timestamp": "2025-02-12T08:15:58Z"
  },
  {
    "title": "Jordanian foreign minister rejects Trump’s Gaza displacement plan",
    "description": "Jordan's foreign minister told Al Jazeera his country rejects the US president’s plan to take over Gaza",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/2/12/jordanian-foreign-minister-rejects-trumps-gaza-displacement-plan",
    "timestamp": "2025-02-12T08:15:15Z"
  },
  {
    "title": "Canada appoints fentanyl czar, fulfilling Trump's request amid tariff threats",
    "description": "Canadian Prime Minister Justin Trudeau appointed former Mountie Kevin Brosseau to serve as the country's fentanyl czar on Tuesday following President Donald Trump's tariff threats.",
    "link": "https://www.foxnews.com/world/canada-appoints-fentanyl-czar-fulfilling-trumps-request-amid-tariff-threats",
    "timestamp": "2025-02-12T08:15:00Z"
  },
  {
    "title": "Musk defends war on US government ‘fraudsters’",
    "description": "<p>WASHINGTON &mdash; Billionaire Elon Musk, in an extraordinary Oval Office appearance on Tuesday, said he was providing maximum transparency in his US government cost-cutting initiative but offered no evidence for his sweeping claims that the federal bureau…",
    "link": "https://www.bangkokpost.com/world/2959660/musk-defends-war-on-us-government-fraudsters",
    "timestamp": "2025-02-12T08:13:00Z"
  },
  {
    "title": "Trump administration readies reciprocal US tariffs as trade war fears mount - Reuters.com",
    "description": "Trump administration readies reciprocal US tariffs as trade war fears mountReuters.com Trump May Dust off 1930 Trade Discrimination Law to Back Reciprocal US TariffsU.S. News & World Report Fact Sheet: President Donald J. Trump Restores Section 232 TariffsThe…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176191885",
    "timestamp": "2025-02-12T08:12:12Z"
  },
  {
    "title": "Analysis: Trump wants China to play a role in peace in Ukraine. Is Xi Jinping willing to help? | CNN",
    "description": "As the war in Ukraine grinds toward its fourth year, US President Donald Trump has made clear which world leader he thinks can help America end the conflict: Vladimir Putin’s ally Xi Jinping.",
    "link": "https://www.cnn.com/2025/02/12/china/china-trump-ukraine-war-putin-xi-jinping-intl-hnk/index.html",
    "timestamp": "2025-02-12T08:11:27Z"
  },
  {
    "title": "South Korean free trade pact could limit impact of reciprocal Trump tariffs, economists say",
    "description": "South Korea's free trade agreement with the United States could help mitigate its exposure to reciprocal tariffs threatened by U.S. President Donald Trump, economists at two major investment banks have said.",
    "link": "https://biztoc.com/x/c54528da554d822f",
    "timestamp": "2025-02-12T08:07:44Z"
  },
  {
    "title": "Ford's CEO says Trump's tariffs are causing chaos and could be devastating to the auto industry",
    "description": "\"So far, what we are seeing is a lot of cost and a lot of chaos,\" Jim Farley, the CEO of Ford, said of President Donald Trump's tariffs.\nBill Pugliano via Getty Images; Al Drago via Getty Images\nJim Farley, the CEO of Ford, said the Trump administration's tar…",
    "link": "https://biztoc.com/x/e363cad22483b16c",
    "timestamp": "2025-02-12T08:07:14Z"
  },
  {
    "title": "Zelenskyy offers Ukraine land swap with Russia in talks to end war",
    "description": "The Ukrainian president's comment come after Russia freed an American prisoner, which US president Donald Trump described as a gesture of goodwill in a bid to end the war.",
    "link": "https://www.abc.net.au/news/2025-02-12/volodymyr-zelenskyy-offers-ukraine-land-swap-with-russia/104929254",
    "timestamp": "2025-02-12T08:04:07Z"
  },
  {
    "title": "MK Halevi: IDF must change strategy to implement Trump's Gaza plan",
    "description": "Halevi argued that, given Hamas’s violation, Israel has no choice but to reassess its approach.",
    "link": "https://www.jpost.com/israel-news/article-841759",
    "timestamp": "2025-02-12T08:02:47Z"
  },
  {
    "title": "U.S. CISA adds Microsoft Windows, Zyxel device flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Windows, Zyxel device flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the following vulnerabilities to its Known Exp…",
    "link": "https://securityaffairs.com/174135/security/u-s-cisa-adds-microsoft-windows-zyxel-device-flaws-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-02-12T08:01:34Z"
  },
  {
    "title": "Elon Musk appears at White House defending DOGE’s work",
    "description": "The billionaire Trump ally pushes back at criticism over transparency, saying his department's work is 'common sense'.",
    "link": "https://www.aljazeera.com/news/2025/2/12/elon-musk-appears-at-white-house-defending-doges-work",
    "timestamp": "2025-02-12T08:00:29Z"
  },
  {
    "title": "Education Department Asks NCAA to Rescind Trans Women’s Awards",
    "description": "The Department of Education is “urging” the largest organizing bodies in high school and college sports to rescind all “records, titles, awards, and recognitions” given to trans women and girls, the department",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/02/12/education-department-asks-ncaa-rescind-trans-womens-awards",
    "timestamp": "2025-02-12T08:00:00Z"
  },
  {
    "title": "Endowment Returns Grow Amid Fiscal Uncertainty",
    "description": "Endowment Returns Grow Amid Fiscal Uncertainty\n\n \n\n\n \nJosh Moody\n\nWed, 02/12/2025 - 03:00 AM\n\nOne-year returns averaged more than 11 percent for fiscal 2024. But the future remains murky for the higher ed sector, which faces funding cuts and a potential endow…",
    "link": "https://www.insidehighered.com/news/business/financial-health/2025/02/12/endowment-returns-climb-amid-fiscal-uncertainty",
    "timestamp": "2025-02-12T08:00:00Z"
  },
  {
    "title": "Ahead of Confirmation Hearing, Senators Back McMahon",
    "description": "Ahead of Confirmation Hearing, Senators Back McMahon\n\n \n\n\n \njessica.blake@…\n\nWed, 02/12/2025 - 03:00 AM\n\nRecent executive actions related to education have colleges and Democrats worried, but key Republican lawmakers remain supportive of Trump’s pick to lead …",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/02/12/ahead-senate-hearing-republicans-back-mcmahon",
    "timestamp": "2025-02-12T08:00:00Z"
  },
  {
    "title": "$900 Million in Institute of Education Sciences Contracts Axed",
    "description": "$900 Million in Institute of Education Sciences Contracts Axed\n\n \n\n\n \nRyan Quinn\n\nWed, 02/12/2025 - 03:00 AM\n\nThe National Center for Education Statistics has been hit hard while researchers say grant review panels have been halted.\n \n Byline(s)\n \n Ryan Quinn…",
    "link": "https://www.insidehighered.com/news/faculty-issues/research/2025/02/12/900m-institute-education-sciences-contracts-axed",
    "timestamp": "2025-02-12T08:00:00Z"
  },
  {
    "title": "Zelenskyy offers land swaps as Russia heartens Trump with prisoner release",
    "description": "WASHINGTON: Ukrainian President Volodymyr Zelenskyy said he was ready to swap land in negotiations with Russia, which freed at least one American prisoner in what United States President Donald Trump described on Tuesday (Feb 11) as a goodwill gesture on endi…",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-ukraine-swap-land-russia-negotiations-guardian-4932931",
    "timestamp": "2025-02-12T07:59:55Z"
  },
  {
    "title": "Malaysia still committed towards zero disposable plastic products",
    "description": "SUBANG JAYA: Malaysia remains committed to zero single-use plastics despite the recent executive order signed by US President Donald Trump to once again normalise the use of plastic straws, says Nik Nazmi Nik Ahmad. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/02/12/malaysia-still-committed-towards-zero-disposable-plastic-products",
    "timestamp": "2025-02-12T07:59:00Z"
  },
  {
    "title": "After Google, Apple Maps Renamed “Gulf of Mexico” as “Gulf of America”",
    "description": "Apple is following Google's lead in renaming the Gulf of Mexico to the \"Gulf of America\" on Apple Maps. This change comes in response to a recent update in the U.S. Geographic Names Information System (GNIS) database, which both companies use as a reference f…",
    "link": "https://www.macobserver.com/news/after-google-apple-maps-renamed-gulf-of-mexico-as-gulf-of-america/",
    "timestamp": "2025-02-12T07:58:09Z"
  },
  {
    "title": "Houthis threaten to renew attacks on Israel if Gaza ceasefire collapses - analysis",
    "description": "Iranian state media said that the Houthis \"warned that Yemeni fighters are ready to 'attack Israel' if the occupying regime resumes its military offensive in Gaza in violation of a ceasefire.\"",
    "link": "https://www.jpost.com/middle-east/article-841760",
    "timestamp": "2025-02-12T07:55:55Z"
  },
  {
    "title": "Ford's CEO says Trump's tariffs are causing chaos and could be devastating to the auto industry",
    "description": "\"So far, what we are seeing is a lot of cost and a lot of chaos,\" Jim Farley said of Trump's tariffs.",
    "link": "https://www.businessinsider.com/ford-ceo-trump-tariffs-devastating-auto-industry-2025-2",
    "timestamp": "2025-02-12T07:55:32Z"
  },
  {
    "title": "What Are Reciprocal Tariffs And Who Might Be Affected?",
    "description": "Tariffs are taxes imposed on goods imported from another country. As for reciprocal tariffs -- during election campaigning, Donald Trump promised: &quot;An eye for an eye, a tariff for a tariff, same exact amount.&quot;",
    "link": "https://www.ndtv.com/world-news/what-are-reciprocal-tariffs-and-who-might-be-affected-7692353",
    "timestamp": "2025-02-12T07:55:07Z"
  },
  {
    "title": "Musk Ally \"Mistakenly\" Given Power To Alter US Treasury's Payment System",
    "description": "An Elon Musk aide was mistakenly given clearance to make changes to the US Treasury Department&#039;s highly sensitive payments system containing millions of Americans&#039; personal information, a department official said Tuesday.",
    "link": "https://www.ndtv.com/world-news/elon-musk-ally-was-mistakenly-given-power-to-alter-us-treasury-departments-payments-system-7692342",
    "timestamp": "2025-02-12T07:52:49Z"
  },
  {
    "title": "SBA Layoff Chaos: Agency Sends, Retracts, Then Confirms Termination Notices",
    "description": "The new emails informed the staff that their employment was being ended immediately, replacing the earlier draft termination letters, which had stated their departures would take effect on Feb. 21.",
    "link": "https://www.ibtimes.com/sba-layoff-chaos-agency-sends-retracts-then-confirms-termination-notices-3763357",
    "timestamp": "2025-02-12T07:49:32Z"
  },
  {
    "title": "Brazil \"Will Not Enter Into Any Trade War\" With US",
    "description": "Brazil&#039;s Finance Minister Fernando Haddad said unilateral tariffs like those imposed by US President Donald Trump are &quot;counterproductive for improving the global economy.&quot;",
    "link": "https://www.ndtv.com/world-news/brazil-will-not-enter-into-any-trade-war-with-us-7692278",
    "timestamp": "2025-02-12T07:47:20Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Gardaí question teen over speed camera damage, Egypt’s plan for reconstruction of Gaza and St Patrick’s Day trips for ministers.",
    "link": "https://www.thejournal.ie/8-at-8-wednesday-113-6620531-Feb2025/",
    "timestamp": "2025-02-12T07:45:50Z"
  },
  {
    "title": "Anderson Cooper Calls Republican a 'D***' Live-on-Air",
    "description": "The CNN host later apologized to former New Hampshire Governor Chris Sununu for the remark.",
    "link": "https://www.newsweek.com/anderson-cooper-chris-sununu-cnn-republica-elon-musk-doge-2029764",
    "timestamp": "2025-02-12T07:41:54Z"
  },
  {
    "title": "Siemens Energy Sees Electricity Boom Driving Growth",
    "description": "Siemens Energy AG expects rising electricity demand and the shift to renewable energy to drive growth this year after posting a record order backlog in the last quarter.",
    "link": "https://financialpost.com/pmn/business-pmn/siemens-energy-sees-electricity-boom-driving-growth",
    "timestamp": "2025-02-12T07:41:11Z"
  },
  {
    "title": "Inspired by 'Trump-tornado', Hungary vows NGO crackdown",
    "description": "Budapest (AFP) Feb 7, 2025\n\n\n Hungary is planning to outlaw NGOs that receive funds from the United States, Prime Minister Viktor Orban said Friday, taking inspiration from US President Donald Trump's crackdown on foreign aid. \n\nOrban, one of Trump's closest …",
    "link": "https://www.terradaily.com/reports/Inspired_by_Trump-tornado_Hungary_vows_NGO_crackdown_999.html",
    "timestamp": "2025-02-12T07:39:55Z"
  },
  {
    "title": "Kering's CEO says Gucci and other brands will absolutely not shift production to the US to counter Trump's tariffs",
    "description": "He said that it \"makes no sense\" to shift production out of Europe, as the group's culture and heritage is part of its \"promise\" to customers.",
    "link": "https://www.businessinsider.com/kering-ceo-gucci-wont-shift-production-us-to-counter-tariffs-2025-2",
    "timestamp": "2025-02-12T07:38:39Z"
  },
  {
    "title": "Disney ditching woke policies – media",
    "description": "Disney has amended its diversity policies amid US President Donald Trump’s campaign against DEI programs, media report, citing sources Read Full Article at RT.com",
    "link": "https://www.rt.com/pop-culture/612547-disney-ditching-woke-policies/",
    "timestamp": "2025-02-12T07:37:49Z"
  },
  {
    "title": "Why India needs more than the Modi-Jaishankar-Doval trinity to tackle Trump",
    "description": "By issuing numerous executive orders on immigration, trade, environmental regulations and more, Trump has forced other countries, including India, to respond reactively rather than proactively. Which is why the formidable trio isn't enough. What we need is a …",
    "link": "https://timesofindia.indiatimes.com/toi-plus/international/why-india-needs-more-than-the-modi-jaishankar-doval-trinity-to-tackle-trump/articleshow/118165104.cms",
    "timestamp": "2025-02-12T07:36:53Z"
  },
  {
    "title": "AP blocked from Oval Office event for not using ‘Gulf of America’ but Google makes the change",
    "description": "The journalist was barred because of the agency’s decision not to use the name Gulf of America.",
    "link": "https://www.thejournal.ie/trump-gulf-of-america-6620513-Feb2025/",
    "timestamp": "2025-02-12T07:32:45Z"
  },
  {
    "title": "Japan seeks exemption from U.S. steel, aluminum tariffs",
    "description": "Japan on Wednesday requested that its steel and aluminum products be exempt from 25 percent tariffs imposed by U.S. President Donald Trump, who vowed to put the penalties into effect next month, the government's top spokesman said. Chief Cabinet Secretary Yos…",
    "link": "https://japantoday.com/category/politics/update1-japan-seeks-exemption-from-u.s.-steel-aluminum-tariffs",
    "timestamp": "2025-02-12T07:32:32Z"
  },
  {
    "title": "Google and Apple officially change the name of the Gulf of Mexico, but there's a catch",
    "description": "Google has confirmed that it has officially changed the name of the Gulf of Mexico to the Gulf of America in compliance with President Trump's orders. Continue reading at TweakTown >",
    "link": "https://www.tweaktown.com/news/103196/google-and-apple-officially-change-the-name-of-gulf-mexico-but-theres-catch/index.html",
    "timestamp": "2025-02-12T07:32:03Z"
  },
  {
    "title": "CNBC Daily Open: Tesla wobbles as BYD gets ahead in self-driving and Elon Musk is everywhere",
    "description": "Investors seem to be growing worried that Elon Musk, for all his business acumen, is getting distracted, with his fingers in too many pies.",
    "link": "https://www.cnbc.com/2025/02/12/cnbc-daily-open-tesla-wobbles-as-byd-gets-ahead-in-self-driving.html",
    "timestamp": "2025-02-12T07:30:01Z"
  },
  {
    "title": "Musk aide given payment system access by mistake",
    "description": "President Donald Trump has tasked Musk with taking an axe to government spending as the leader of a new agency.\nThe post Musk aide given payment system access by mistake appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/musk-aide-given-payment-system-access-by-mistake/article",
    "timestamp": "2025-02-12T07:27:33Z"
  },
  {
    "title": "Microsoft Patch Tuesday security updates for February 2025 ficed 2 actively exploited bugs",
    "description": "Microsoft Patch Tuesday security updates for February 2025 addressed four zero-day flaws, two of which are actively exploited in the wild. Microsoft Patch Tuesday security updates for February 2025 addressed 57 vulnerabilities in Windows and Windows Component…",
    "link": "https://securityaffairs.com/174126/hacking/microsoft-patch-tuesday-security-updates-february-2025.html",
    "timestamp": "2025-02-12T07:27:22Z"
  },
  {
    "title": "Anderson Cooper Snaps At Trump-Defending Chris Sununu On Live TV: ‘Don’t Be A Dick’",
    "description": "The CNN anchor later apologized for the comment.",
    "link": "https://www.huffpost.com/entry/anderson-cooper-chris-sununu_n_67ac463ee4b09b0ed6cfe9cd",
    "timestamp": "2025-02-12T07:26:35Z"
  },
  {
    "title": "OpenAI's Board Said to Have Not Received Elon Musk's Takeover Bid",
    "description": "OpenAI's board of directors has not yet received a formal bid from Musk's group, a source familiar with the matter told Reuters on Tuesday, adding to the confusion over the unsolicited attempt to take control of the world's most prominent AI company.",
    "link": "https://www.gadgets360.com/ai/news/openai-board-not-received-elon-musk-takeover-bid-7692093",
    "timestamp": "2025-02-12T07:21:33Z"
  },
  {
    "title": "Zelenskyy prepared to offer Russia a territory swap in any future negotiations",
    "description": "The Ukrainian president said he was ready to trade land in Russia’s Kursk region – which Ukraine seized in a surprise offensive last year.",
    "link": "https://www.thejournal.ie/zelenskyy-prepared-offer-territory-swap-russia-6620512-Feb2025/",
    "timestamp": "2025-02-12T07:19:30Z"
  },
  {
    "title": "Trump determined to free every American held in Russia – Rubio",
    "description": "Donald Trump is committed to bringing home all Americans detained in Russia, Marco Rubio has said following Marc Fogel’s release Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612552-trump-free-every-american-russia/",
    "timestamp": "2025-02-12T07:19:24Z"
  },
  {
    "title": "U.S. warship sails through Taiwan Strait for first time since Trump inauguration",
    "description": "China's military said the move had \"sent the wrong signals\" and \"increased security risks” in the strategic waterway.",
    "link": "https://www.japantimes.co.jp/news/2025/02/12/asia-pacific/politics/us-taiwan-strait-trump-first-transit/",
    "timestamp": "2025-02-12T07:17:00Z"
  },
  {
    "title": "Jimmy Kimmel Spots Exact Moment Trump Threw Cold Water On JD Vance",
    "description": "The late night host said the president turned \"a pretty simple question\" into blunt message about his veep.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-vance_n_67ac3085e4b09017b18d206c",
    "timestamp": "2025-02-12T07:15:41Z"
  },
  {
    "title": "Quad and AUKUS face an uncertain future under Trump",
    "description": "While the initial signs from key Trump administration officials have been very positive, long-standing concerns about the two institutions’ durability and effectiveness have been reignited by the actions directed against long-standing US allies and partners.",
    "link": " https://en.setopati.com/International/164271 ",
    "timestamp": "2025-02-12T07:15:30Z"
  },
  {
    "title": "UK economy on course for 1.5% expansion, NIESR predicts",
    "description": "Thinktank cautions Trump tariffs could blow hole in forecast, with 63% of UK firms exporting to US expecting to be hit\nThe British economy is on course to expand by 1.5% this year after the budget gave a boost to public spending but could be blown off course …",
    "link": "https://biztoc.com/x/cde26a3d8049c19e",
    "timestamp": "2025-02-12T07:12:46Z"
  },
  {
    "title": "Yen underperforms major currencies on Trump tariff uncertainties",
    "description": "The yen is on track for its longest losing streak in more than a month amid heightened concerns Japan may be included in U.S. President Donald Trump’s tariff plan.\nJapan’s currency dropped as much as 0.8% to ¥153.73 against the dollar on Wednesday, its weakes…",
    "link": "https://biztoc.com/x/09a63e4c4a16175a",
    "timestamp": "2025-02-12T07:12:21Z"
  },
  {
    "title": "Temu, Shein See US Sales Drop After Trump Targets China Trade",
    "description": "(Bloomberg) -- Online shopping giants Temu and Shein have seen a sustained drop in sales in the week after US President Donald Trump scrapped a duty...",
    "link": "https://finance.yahoo.com/news/temu-shein-see-us-sales-071042764.html",
    "timestamp": "2025-02-12T07:10:42Z"
  },
  {
    "title": "After meeting with Trump, Jordan’s king says his country opposes displacing Palestinians in Gaza",
    "description": "Abdullah was asked repeatedly about Trump’s plan to clear out Gaza and overhaul it as a resort on the Mediterranean Sea. He didn’t make substantive comments on it and didn’t commit to the idea that his country could accept large numbers of Gazans.",
    "link": " https://en.setopati.com/International/164270 ",
    "timestamp": "2025-02-12T07:09:52Z"
  },
  {
    "title": "Rubio says American Marc Fogel freed from Russia due to 'strength' of Trump",
    "description": "Secretary of State Marco Rubio said Tuesday that Marc Fogel, an American who had been detained in Russia since 2021, was freed because the U.S. has a \"strong president.\"",
    "link": "https://www.foxnews.com/world/rubio-says-american-marc-fogel-freed-from-russia-due-strength-trump",
    "timestamp": "2025-02-12T07:09:34Z"
  },
  {
    "title": "Trump may dust off 1930 trade discrimination law to back reciprocal US tariffs",
    "description": "WASHINGTON: President Donald Trump is likely to dust off a 1930 trade law largely forgotten for decades to back his new reciprocal US tariffs that will match other countries' higher import taxes, trade and legal experts say. Trump has said the new US tariff r…",
    "link": "https://www.channelnewsasia.com/world/trump-may-dust-1930-trade-discrimination-law-back-reciprocal-us-tariffs-4932871",
    "timestamp": "2025-02-12T07:09:00Z"
  },
  {
    "title": "Yen underperforms major currencies on Trump tariff uncertainties",
    "description": "Japan’s currency has dropped to ¥153.73 against the dollar, its weakest level in a week and lagging all major peers.",
    "link": "https://www.japantimes.co.jp/business/2025/02/12/markets/yen-losing-streak/",
    "timestamp": "2025-02-12T07:09:00Z"
  },
  {
    "title": "Trump administration readies reciprocal US tariffs as trade war fears mount",
    "description": "Donald Trump's trade advisers were finalizing plans on Wednesday for the reciprocal tariffs the U.S. president has vowed to impose on every country that charges duties on U.S. imports, ratcheting up fears of a widening global trade war.\nTrump stunned markets …",
    "link": "https://biztoc.com/x/b801cd284b2387d9",
    "timestamp": "2025-02-12T07:01:22Z"
  },
  {
    "title": "Trump: the Meanness and Mendacity of Being",
    "description": "All presidents bring their own characteristics and governing styles to the White House.  Lyndon Johnson, who assumed the presidency in the most awful of circumstances, was infatuated with himself, taking a LBJ bust to the Vatican to present to the Pope.  Rona…",
    "link": "https://www.counterpunch.org/2025/02/12/trump-the-meanness-and-mendacity-of-being/",
    "timestamp": "2025-02-12T07:00:38Z"
  },
  {
    "title": "Bitcoin On The Fed’s Radar? Journalist Notes Growing Acceptance",
    "description": "Historically dubious of cryptocurrencies, the US Federal Reserve could be starting to show early signs of becoming more receptive to Bitcoin and digital assets. Recent remarks from key Fed officials point to a change in tone that would indicate a more open at…",
    "link": "https://bitcoinist.com/bitcoin-on-the-feds-radar-journalist-notes-growing-acceptance/",
    "timestamp": "2025-02-12T07:00:31Z"
  },
  {
    "title": "‘I love this for Pepsi’: Costco shopper heads to soda aisle. Then they notice something strange",
    "description": "Pepsi may be losing in the cola wars to rival Coca-Cola and another surprising entrant, but at one Southern California Costco, Pepsi appears to be reigning supreme.\n\n\nAt least, that's according to creator Melanie (@melanieedianaa). She posted a TikTok clip th…",
    "link": "https://www.dailydot.com/news/costco-coca-cola-boycott/",
    "timestamp": "2025-02-12T07:00:00Z"
  },
  {
    "title": "Freed American hostage Marc Fogel lands in US after years in Russian captivity",
    "description": "Marc Fogel, an American who had been detained in Russia since 2021, landed back in the U.S. on Tuesday. Fogel, a history teacher who was working at the Anglo-American School in Moscow, returned to the U.S. after his release from Russia following talks with th…",
    "link": "https://freerepublic.com/focus/f-chat/4296921/posts",
    "timestamp": "2025-02-12T06:56:49Z"
  },
  {
    "title": "Mkenya Marekani: US-Based Kenyan Explains How Trump's Policies Might Affect Fellow Kenyans",
    "description": "Gerriey Wainaina shared how Trump's policies impacted Kenyans, addressing deportation fears, birthright citizenship changes, and alternative US immigration pathways.",
    "link": "https://www.tuko.co.ke/world/us/578571-mkenya-marekani-based-kenyan-explains-how-trumps-policies-affect-fellow-kenyans/",
    "timestamp": "2025-02-12T06:56:44Z"
  },
  {
    "title": "Modi aiming to change Trump’s mind on tariffs – media",
    "description": "The Indian PM is expected to discuss trade tariffs with the US leader during his visit to Washington  Read Full Article at RT.com",
    "link": "https://www.rt.com/india/612548-modi-aiming-to-change-trump-tariffs/",
    "timestamp": "2025-02-12T06:56:04Z"
  },
  {
    "title": "What is Sin?",
    "description": "Writing in 2019, the National Catholic Reporter pointed out:  “… what we see with President Donald Trump and his cast of sycophants and co-conspirators — some of them beginning to flee the sinking ship on advice of counsel — is a rare thing: All seven deadly …",
    "link": "https://www.counterpunch.org/2025/02/12/what-is-sin/",
    "timestamp": "2025-02-12T06:55:43Z"
  },
  {
    "title": "US legal case into Digicel in limbo following Trump’s executive order",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2025/02/12/us-legal-case-into-digicel-in-limbo-following-trumps-executive-order/",
    "timestamp": "2025-02-12T06:55:03Z"
  },
  {
    "title": "X's Oval Office Takeover: Trump Amused By Elon Musk's Son, A 'High IQ Individual'",
    "description": "President Donald Trump appeared amused by Elon Musk's son, X, as the 4-year-old boy attended a press briefing at the Oval Office with his dad, wherein he was introduced to the media by the president himself as a \"high IQ individual.\"",
    "link": "https://www.ibtimes.com/xs-oval-office-takeover-trump-amused-elon-musks-son-high-iq-individual-3763354",
    "timestamp": "2025-02-12T06:54:39Z"
  },
  {
    "title": "Unelected Musk holds court in Trump’s Oval Office as he defends efficiency drive",
    "description": "Musk, accompanied by son X, seeks to present the work of Doge as good common sense as Trump stays largely silent",
    "link": "https://www.irishtimes.com/world/us/2025/02/12/unelected-musk-holds-court-in-trumps-oval-office-as-he-defends-efficiency-drive/",
    "timestamp": "2025-02-12T06:54:36Z"
  },
  {
    "title": "Apple Is Renaming Gulf Of Mexico To Gulf Of America On Maps App",
    "description": "The change comes after the US government updated its official map to reflect the new name &#039;Gulf of America&#039;.",
    "link": "https://www.ndtv.com/world-news/apple-is-renaming-gulf-of-mexico-to-gulf-of-america-on-maps-app-7691892",
    "timestamp": "2025-02-12T06:51:34Z"
  },
  {
    "title": "Egypt to present 'vision' for reconstruction of Gaza without displacing Palestinians",
    "description": "Egypt said it “hopes to cooperate” with Trump’s administration on the matter, with the goal of “reaching a fair settlement of the Palestinian cause”.",
    "link": "https://www.thejournal.ie/egypt-to-present-vision-reconstruction-gaza-6620500-Feb2025/",
    "timestamp": "2025-02-12T06:51:17Z"
  },
  {
    "title": "India’s earnings slowdown cyclical, expect recovery by mid-year: Jonathan Garner",
    "description": "​I​ think there is a minority opinion that this is a more structural slowdown in earnings for India. We do not agree with that. But there are certainly people who have that view.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/indias-earnings-slowdown-cyclical-expect-recovery-by-mid-year-jonathan-garner/articleshow/118166715.cms",
    "timestamp": "2025-02-12T06:48:25Z"
  },
  {
    "title": "SoftBank books surprise loss of $2.4 billion in third quarter",
    "description": "TOKYO :Japanese technology investor SoftBank Group booked a surprising net loss of 369.2 billion yen ($2.4 billion) in the October-December quarter as valuations at its Vision Fund investment arm fell.In particular, SoftBank was hit by unrealised valuation lo…",
    "link": "https://www.channelnewsasia.com/business/softbank-books-surprise-loss-24-billion-third-quarter-4932901",
    "timestamp": "2025-02-12T06:47:51Z"
  },
  {
    "title": "SoftBank posts third-quarter loss of $2.4 billion",
    "description": "TOKYO :Japanese technology investor SoftBank Group booked a net loss of 369.2 billion yen ($2.4 billion) in the October-December quarter as valuations at its Vision Fund investment arm fell.The loss will further raise questions about SoftBank's plans for one …",
    "link": "https://www.channelnewsasia.com/business/softbank-posts-third-quarter-loss-24-billion-4932901",
    "timestamp": "2025-02-12T06:47:51Z"
  },
  {
    "title": "Cabinet to sign off on St Patrick’s Day travel plans for ministers, with heavy focus on US relations",
    "description": "Tánaiste and Foreign Affairs Minister Simon Harris will bring the St Patrick's Day programme to cabinet, which will outline a proposal to send ministers to almost 40 locations across the world.",
    "link": "https://www.independent.ie/irish-news/cabinet-to-sign-off-on-st-patricks-day-travel-plans-for-ministers-with-heavy-focus-on-us-relations/a826998550.html",
    "timestamp": "2025-02-12T06:47:05Z"
  },
  {
    "title": "Cabinet to sign off on St Patrick’s Day travel plans for ministers, with heavy focus on US relations",
    "description": "Tánaiste and Foreign Affairs Minister Simon Harris will bring the St Patrick's Day programme to cabinet, which will outline a proposal to send ministers to almost 40 locations across the world.",
    "link": "https://www.independent.ie/irish-news/politics/cabinet-to-sign-off-on-st-patricks-day-travel-plans-for-ministers-with-heavy-focus-on-us-relations/a826998550.html",
    "timestamp": "2025-02-12T06:47:04Z"
  },
  {
    "title": "SoftBank books surprise loss of US$2.4 billion in third quarter",
    "description": "TOKYO: Japanese technology investor SoftBank Group booked a surprising net loss of ¥369.2 billion (US$2.4 billion) in the October-December quarter as valuations at its Vision Fund investment arm fell. In particular, SoftBank was hit by unrealised valuation lo…",
    "link": "https://www.channelnewsasia.com/business/softbanks-son-back-form-big-bets-and-quarterly-loss-4932901",
    "timestamp": "2025-02-12T06:47:00Z"
  },
  {
    "title": "SoftBank books surprise loss of US$2.4 billion in third quarter",
    "description": "TOKYO: Japanese technology investor SoftBank Group booked a surprising net loss of ¥369.2 billion (US$2.4 billion) in the October-December quarter as valuations at its Vision Fund investment arm fell. In particular, SoftBank was hit by unrealised valuation lo…",
    "link": "https://www.channelnewsasia.com/business/softbank-books-surprise-loss-us24-billion-third-quarter-4932901",
    "timestamp": "2025-02-12T06:47:00Z"
  },
  {
    "title": "Russian missile attack on Kyiv kills one, sparks fires, Ukraine says",
    "description": "US president Donald Trump says he has been in contact with Kyiv and Moscow about ending the war",
    "link": "https://www.irishtimes.com/world/europe/2025/02/12/russian-missile-attack-on-kyiv-kills-one-sparks-fires-ukraine-says/",
    "timestamp": "2025-02-12T06:44:31Z"
  },
  {
    "title": "Elon Musk says US could go 'bankrupt' without DOGE workforce cuts",
    "description": "During an appearance alongside the tech billionaire, US President Donald Trump said the department had uncovered 'shocking' evidence of wasteful spending within government.",
    "link": "https://www.abc.net.au/news/2025-02-12/elon-musk-defends-cuts-to-us-federal-workforce/104928648",
    "timestamp": "2025-02-12T06:43:18Z"
  },
  {
    "title": "Trump readies matching tariffs on trade partners, possibly setting up major economic showdown",
    "description": "President Donald Trump plans to sign an order requiring US tariffs on imports to match the tax rates charged by other countries. This move, aimed at achieving reciprocity, could substantially increase taxes on imported goods, potentially leading to inflation …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-readies-matching-tariffs-on-trade-partners-possibly-setting-up-major-economic-showdown/articleshow/118166565.cms",
    "timestamp": "2025-02-12T06:39:58Z"
  },
  {
    "title": "PM Modi hopes to rekindle Trump bromance",
    "description": "Indian Prime Minister Narendra Modi seeks to renew ties with US President Donald Trump by offering tariff concessions and cooperation on immigration issues. Modi is aiming to prevent negative trade actions and sanctions during his visit to Washington, while m…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/pm-modi-hopes-to-rekindle-trump-bromance/articleshow/118166551.cms",
    "timestamp": "2025-02-12T06:39:14Z"
  },
  {
    "title": "PM Modi hopes to rekindle Trump bromance",
    "description": "Indian Prime Minister Narendra Modi seeks to renew ties with US President Donald Trump by offering tariff concessions and cooperation on immigration issues. Modi is aiming to prevent negative trade actions and sanctions during his visit to Washington, while m…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/pm-modi-hopes-to-rekindle-trump-bromance/articleshow/118166724.cms",
    "timestamp": "2025-02-12T06:39:14Z"
  },
  {
    "title": "Coca-Cola says it may use more plastic due to Trump tariffs",
    "description": "Coca-Cola says it may use more plastic due to Trump tariffs\nCoca-Cola may have to sell more drinks in plastic bottles in the US if President Donald Trump's tariffs end up making aluminium cans more expensive, the company's chief executive, James Quincey, said…",
    "link": "https://biztoc.com/x/cd4d8c4036234953",
    "timestamp": "2025-02-12T06:39:10Z"
  },
  {
    "title": "Is Trump reviving a forgotten trade law to spark new tariff war?",
    "description": "President Donald Trump plans to use a 1930 trade law, Section 338, to impose new reciprocal US tariffs quickly. This law allows up to 50% duties on imports from countries discriminating against US commerce. Legal experts predict Trump will target countries wi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/1930-trade-law-is-trump-reviving-a-forgotten-trade-law-to-spark-new-tariff-war/articleshow/118166518.cms",
    "timestamp": "2025-02-12T06:38:01Z"
  },
  {
    "title": "Trump White House Boasts Apple's 'Gulf Of Mexico' Rename, But Pinch To Zoom And You Might Be Surprised",
    "description": "On Tuesday, Apple Inc. (NASDAQ:AAPL) renamed the Gulf of Mexico to Gulf of America on its Maps app, following an executive order signed by U.S. President Donald Trump on his first day in office.\nWhat Happened: The U.S. government officially updated its maps t…",
    "link": "https://biztoc.com/x/880cd18417b23b91",
    "timestamp": "2025-02-12T06:37:22Z"
  },
  {
    "title": "PM Modi returns to US with lost clout as stock, economic boom fades",
    "description": "Indian Prime Minister Narendra Modi faces a challenging task in attracting US investment during his visit to Washington. Since his last visit, Indian financial markets have faced significant declines, with foreign investors pulling out $21 billion from shares…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/pm-modi-returns-to-us-with-lost-clout-as-stock-economic-boom-fades/articleshow/118166231.cms",
    "timestamp": "2025-02-12T06:36:06Z"
  },
  {
    "title": "South Korea acting president calls for agreement on extra budget amid slowing economy",
    "description": "SEOUL: South Korea's acting President Choi Sang-mok on Wednesday (Feb 12) said he hoped for a swift agreement within the country's parliament on an extra budget to support an economy struggling with slowing domestic demand and heightened external uncertainty.…",
    "link": "https://www.channelnewsasia.com/east-asia/south-korea-acting-president-calls-agreement-extra-budget-amid-slowing-economy-4932471",
    "timestamp": "2025-02-12T06:33:43Z"
  },
  {
    "title": "What are reciprocal tariffs and who might be affected?",
    "description": "US President Donald Trump has threatened to open new fronts in his tariffs war by announcing reciprocal levies on other countries as soon as Tuesday, branding this \"the only fair way\" to trade.",
    "link": "https://www.enca.com/business/what-are-reciprocal-tariffs-and-who-might-be-affected",
    "timestamp": "2025-02-12T06:33:11Z"
  },
  {
    "title": "Everything you were afraid to ask about Germany’s election",
    "description": "In today's edition of the Capitals, read about why Spain urges EU to double budget, brace for Trump, Slovak PM's letter to Musk, and so much more.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-everything-you-were-afraid-to-ask-about-germanys-election/",
    "timestamp": "2025-02-12T06:30:10Z"
  },
  {
    "title": "What to Know About the History and Controversy Over Plastic and Paper Straws",
    "description": "Trump signed an Executive Order to end the use of paper straws. Here’s what to know about the history of plastic straws.",
    "link": "https://time.com/7221487/trump-executive-order-paper-straw-ban-government-plastic-environment-explainer/",
    "timestamp": "2025-02-12T06:30:00Z"
  },
  {
    "title": "India to Sign Multibillion-Dollar LNG Purchase Deals With Adnoc",
    "description": "Two of India’s biggest state-run oil companies will this week sign agreements to buy liquefied natural gas from Abu Dhabi National Oil Co., as the world’s most populous nation looks to secure long-term supplies to meet growing energy demand.",
    "link": "https://financialpost.com/pmn/business-pmn/india-to-sign-multibillion-dollar-lng-purchase-deals-with-adnoc",
    "timestamp": "2025-02-12T06:29:58Z"
  },
  {
    "title": "Iran denounces ‘reckless’ Trump remarks on nuclear deal",
    "description": "Iran's envoy to UN Amir Saeid Iravani warns the US that 'any act of aggression will have severe consequences'.",
    "link": "https://www.aljazeera.com/news/2025/2/12/iran-denounces-reckless-trump-remarks-on-nuclear-deal",
    "timestamp": "2025-02-12T06:29:00Z"
  },
  {
    "title": "Goldman Sachs Doubles Down on Bitcoin ETFs, Increases Holdings by 120% in Q4",
    "description": "Goldman Sachs has boosted its crypto ETF holdings to $2.05 billion, reflecting rising institutional demand amid shifting macro conditions.",
    "link": "https://decrypt.co/305522/goldman-sachs-doubles-down-on-bitcoin-etfs-increases-holdings-by-120-in-q4",
    "timestamp": "2025-02-12T06:24:18Z"
  },
  {
    "title": "Apple changes Gulf of Mexico to Gulf of America on maps",
    "description": "Apple renamed the Gulf of Mexico to the Gulf of America on its maps on Feb. 11 after an order by President Donald Trump was made official by the U.S. Geographic Names Information System.",
    "link": "https://www.hurriyetdailynews.com/apple-changes-gulf-of-mexico-to-gulf-of-america-on-maps-205720",
    "timestamp": "2025-02-12T06:23:34Z"
  },
  {
    "title": "Why Australian aluminium is in the White House’s sights",
    "description": "Few in the industry or working behind the scenes are willing to predict what will come next with US President Donald Trump's steel and aluminium tariffs.",
    "link": "https://www.abc.net.au/news/2025-02-12/why-australian-aluminium-is-in-the-white-house-sights/104928540",
    "timestamp": "2025-02-12T06:23:11Z"
  }
]