[
  {
    "title": "Trump says he'll replace loyalist Ed Martin as his nominee to be D.C.'s top prosecutor",
    "description": "President Donald Trump said Thursday that he would replace Ed Martin as his nominee for U.S. Attorney for the District of Columbia.",
    "link": "https://www.nbcnews.com/politics/justice-department/trump-replace-ed-martin-nominee-dc-top-prosecutor-rcna205617",
    "timestamp": "2025-05-08T16:13:53Z"
  },
  {
    "title": "Trump Says He's Dropping Controversial Nominee Ed Martin",
    "description": "“We have somebody else that will be great,” Trump said of his pick for D.C.’s top attorney, who faced bipartisan opposition over his defense of Jan. 6 rioters.",
    "link": "https://www.huffpost.com/entry/trump-ed-martin-us-attorney-republicans_n_681cd3d9e4b007ccedaf6691",
    "timestamp": "2025-05-08T16:13:48Z"
  },
  {
    "title": "Wall Street bonuses could drop as much as 20% because of Trump tariff turmoil",
    "description": "Johnson Associates, a compensation specialist, said deals have all but ground to a halt from growing uncertainty over Trump's tariffs.",
    "link": "https://nypost.com/2025/05/08/business/wall-street-bonuses-could-drop-as-much-as-20-because-of-trump-tariff-turmoil/",
    "timestamp": "2025-05-08T16:13:47Z"
  },
  {
    "title": "Tariff Tracker: We're Watching Prices for 11 Products You Might Need to Buy",
    "description": "Worried about tariffs? See how President Trump's new import taxes are affecting the prices of popular products like iPhones, video games and coffee.",
    "link": "https://www.cnet.com/tech/tariff-tracker-were-watching-prices-for-11-products-you-might-need-to-buy/",
    "timestamp": "2025-05-08T16:13:11Z"
  },
  {
    "title": "Trump calls US Fed chair ‘fool’ after pause in rate cuts",
    "description": "US President Donald Trump branded Fed Chair Jerome Powell a “fool” on Thursday after the central bank announced another pause in rate cuts and warned of higher risks to inflation and unemployment goals. “‘Too Late’ Jerome Powell is a FOOL, who doesn’t have a …",
    "link": "https://www.digitaljournal.com/world/trump-calls-us-fed-chair-fool-after-pause-in-rate-cuts/article",
    "timestamp": "2025-05-08T16:12:35Z"
  },
  {
    "title": "Trump announces upcoming talks with Zelensky",
    "description": "The Ukrainian parliament has ratified the bilateral minerals deal, the US president has confirmed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617047-ukraine-trump-deal-minerals/",
    "timestamp": "2025-05-08T16:12:24Z"
  },
  {
    "title": "‘Do You Like Tootsie Rolls?’: Inside Trump’s Hardcore Candy Addiction",
    "description": "As the president creates one constitutional crisis after another, he’s also been consuming “an insane amount of candy,” per a White House official",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-candy-addict-white-house-oval-office-1235334441/",
    "timestamp": "2025-05-08T16:11:57Z"
  },
  {
    "title": "Trump Announces Trade Framework With UK, Lowering Barriers",
    "description": "US President Donald Trump announced a trade framework with the UK, hailing it as a “breakthrough” that will bring down barriers and expand market access for American imports.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-announces-trade-framework-with-uk-lowering-barriers",
    "timestamp": "2025-05-08T16:11:47Z"
  },
  {
    "title": "‘The View’: Joe Biden Crosses Himself Before Giving Honest Review of Trump’s ‘Worst 100 Days’",
    "description": "The former president lambasts his successor for his handling of Putin and his cuts to the federal government \nThe post ‘The View’: Joe Biden Crosses Himself Before Giving Honest Review of Trump’s ‘Worst 100 Days’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-view-joe-biden-reviews-trump-worst-100-days/",
    "timestamp": "2025-05-08T16:10:47Z"
  },
  {
    "title": "Trump Pulls Ed Martin’s Nomination to Be U.S. Attorney",
    "description": "\"President Donald Trump said Thursday that he will replace interim U.S. attorney Ed Martin, his embattled nominee to serve as the top prosecutor for D.C., after 15 tumultuous weeks in office marked by his threats",
    "link": "https://politicalwire.com/2025/05/08/trump-pulls-ed-martins-nomination-to-be-u-s-attorney/",
    "timestamp": "2025-05-08T16:10:43Z"
  },
  {
    "title": "John Kennedy Asks Kash Patel Point-Blank If Jeffrey Epstein Killed Himself",
    "description": "Republican Sen. John Kennedy of Louisiana pressed FBI Director Kash Patel about the release of files pertaining to convicted sex offender Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/05/08/john-kennedy-asks-kash-patel-point-blank-if-jeffrey-epstein-killed-himself/",
    "timestamp": "2025-05-08T16:10:36Z"
  },
  {
    "title": "Denmark to grill US envoy on Greenland spying report",
    "description": "The Trump administration ramped up spying on Greenland, says reporting by The Wall Street Journal",
    "link": "https://theweek.com/politics/greenland-spying-us-intelligence-wall-street-journal",
    "timestamp": "2025-05-08T16:10:09Z"
  },
  {
    "title": "Could Spain’s Electricity Meltdown Be Coming to a State Near You?",
    "description": "Spain’s electricity supply went down last month due to cascading failures traced to faults in two solar plants in Spain’s southwest region, causing a blackout on the Iberian Peninsula. Americans should not be complacent because the North American Electric Rel…",
    "link": "https://freerepublic.com/focus/f-news/4315747/posts",
    "timestamp": "2025-05-08T16:10:03Z"
  },
  {
    "title": "Daniel Lurie’s San Francisco Playbook Could Be What Democrats Need",
    "description": "The mild-mannered mayor is well-liked and well-heeled, but some worry his inexperience bodes poorly for pulling the Golden City out of its political dysfunction. “Lurie genuinely did not understand the machine he was getting into,” says one local writer.",
    "link": "https://www.vanityfair.com/news/story/daniel-lurie-san-francisco-playbook-democrats",
    "timestamp": "2025-05-08T16:09:35Z"
  },
  {
    "title": "Trump’s suit against Colorado “sanctuary laws” starts with a lie and only gets worse (Editorial)",
    "description": "Trump and the DOJ are trying to tear down sanctuary policies so they can use local law enforcement to conduct mass deportations -- rounding up millions of residents whose only crime is immigration.",
    "link": "https://www.denverpost.com/2025/05/08/trump-sanctuary-city-lawsuit-denver-colorado/",
    "timestamp": "2025-05-08T16:09:31Z"
  },
  {
    "title": "Trump targets Iranian oil with sanctions, increasing pressure on Islamic Republic to make deal on nukes",
    "description": "Trump administration on Thursday targeted Iranian oil with a new sanctions – increasing pressure on Iran to make a deal with the U.S. to prevent nuclear proliferation, Fox News Digital has learned.",
    "link": "https://www.foxnews.com/politics/trump-targets-iranian-oil-sanctions-increasing-pressure-islamic-republic-make-deal-nukes",
    "timestamp": "2025-05-08T16:09:16Z"
  },
  {
    "title": "UK trade deal announcement brings hope to Wall Street",
    "description": "U.S. stocks are rising Thursday after President Donald Trump said he was set to announce an agreement on trade with the United Kingdom, the first of what Wall Street hopes will be enough to keep a recession from hitting the economy.",
    "link": "https://www.pbs.org/newshour/economy/uk-trade-deal-announcement-brings-hope-to-wall-street",
    "timestamp": "2025-05-08T16:08:38Z"
  },
  {
    "title": "President rolls out 1st of the trade agreements he’s been pursuing",
    "description": "'Full and comprehensive' deal that will 'cement' relationship for years",
    "link": "https://www.wnd.com/2025/05/president-rolls-out-1st-of-the-trade-agreements-hes-been-pursuing/",
    "timestamp": "2025-05-08T16:08:37Z"
  },
  {
    "title": "‘That Was The Dropping Of The Mic!’ View Hosts Crack Up At Biden Trump Slam",
    "description": "Former President Joe Biden drew laughs from the co-hosts of The View with a wisecrack that Whoopi Goldberg called \"The dropping of the mic!\"\nThe post ‘That Was The Dropping Of The Mic!’ View Hosts Crack Up At Biden Trump Slam first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/that-was-the-dropping-of-the-mic-view-hosts-crack-up-at-biden-trump-slam/",
    "timestamp": "2025-05-08T16:08:10Z"
  },
  {
    "title": "Daily Caller Fires Reporter Who Ilhan Omar Told to ‘F*ck Off’ in Viral Video",
    "description": "Daily Caller journalist Myles Morell was riding high last week after a viral video of Rep. Ilhan Omar (D-MN) telling him to “fuck off” briefly made him a hero in online MAGA circles. This week, he’s unemployed. The Daily Caller News Foundation reportedly fire…",
    "link": "https://www.mediaite.com/news/daily-caller-fires-reporter-who-ilhan-omar-told-to-fck-off-in-viral-video/",
    "timestamp": "2025-05-08T16:07:27Z"
  },
  {
    "title": "'He's not welcome': Trump freezes out well-connected MAGA lobbyist over social media post",
    "description": "A well-connected lobbyist found himself iced out of MAGA circles after angering president Donald Trump over a crypto scheme.An employee of the lobby shop run by Brian Ballard, who has ties to several Trump officials, personally pressed the president at a Mar-…",
    "link": "https://www.rawstory.com/trump-2671918956/",
    "timestamp": "2025-05-08T16:07:25Z"
  },
  {
    "title": "Bernie Sanders: Private Jets ‘Only Way’ to Travel to ‘Fight the Oligarchy’ Rallies",
    "description": "Sen. Bernie Sanders, I-Vt., said private jet travel is the “only way you can get around, no apologies,” in response to a question about spending... Read More\nThe post Bernie Sanders: Private Jets ‘Only Way’ to Travel to ‘Fight the Oligarchy’ Rallies appeared …",
    "link": "https://www.dailysignal.com/2025/05/08/bernie-sanders-private-jets-only-way-travel-fight-oligarchy-rallies/",
    "timestamp": "2025-05-08T16:06:22Z"
  },
  {
    "title": "The 5 at 5: Thursday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-thursday-170-6699479-May2025/",
    "timestamp": "2025-05-08T16:05:21Z"
  },
  {
    "title": "Trump announces trade pact with United Kingdom (Washington Post)",
    "description": "Washington Post:\nTrump announces trade pact with United Kingdom  —  It is the first of dozens of deals the administration wants to make with trade partners around the world.  —  President Donald Trump on Thursday announced a new trade pact with the United Kin…",
    "link": "https://www.memeorandum.com/250508/p59",
    "timestamp": "2025-05-08T16:05:00Z"
  },
  {
    "title": "Carney, Canada's premiers plan to meet in Saskatchewan next month",
    "description": "Canada's premiers and Prime Minister Mark Carney will meet in Saskatoon on June 2 to discuss ways to work together to make the country stronger.",
    "link": "https://www.nationalobserver.com/2025/05/08/news/carney-canadas-premiers-plan-meet-saskatchewan-next-month",
    "timestamp": "2025-05-08T16:04:21Z"
  },
  {
    "title": "Trump says he’ll pull the nomination of Ed Martin, former St. Louisan who defended Jan. 6 rioters",
    "description": "“We have somebody else that will be great,” Trump told reporters in the Oval Office when asked about the status of Martin’s confirmation.",
    "link": "https://www.stltoday.com/news/nation-world/article_78dfd00b-4451-43f8-bb2e-850f9eacfa36.html",
    "timestamp": "2025-05-08T16:04:00Z"
  },
  {
    "title": "National Park Service To Be Hit With 1,500 Additional Layoffs And Deep Budget Cuts, Reports Say",
    "description": "The Department of the Interior will lay off 1,500 more National Park Service staff and slash $26 million in grant funding, according to reports.",
    "link": "https://www.forbes.com/sites/suzannerowankelleher/2025/05/08/national-park-service-layoffs-budget-cuts/",
    "timestamp": "2025-05-08T16:03:44Z"
  },
  {
    "title": "Trump unveils new UK trade deal, calls it 'incredible day for America'",
    "description": "President Donald Trump announced a new trade deal with the U.K., calling Thursday \"an incredible day for America.\" \nTrump told reporters at the White House that \"today’s agreement with the U.K. is the first in a series of agreements on trade that my administr…",
    "link": "https://biztoc.com/x/8f02337cd1766a50",
    "timestamp": "2025-05-08T16:03:35Z"
  },
  {
    "title": "US rises after Trump urges to 'buy stocks now'",
    "description": "American stock markets surged on Thursday, with the Dow Jones advancing more than 550 points. The upward momentum came shortly after President Donald Trump advised investors to \"better go out and buy ...",
    "link": "https://biztoc.com/x/92ac2ce89da7d5ad",
    "timestamp": "2025-05-08T16:03:33Z"
  },
  {
    "title": "Trump says he's pulling nomination of Ed Martin for top D.C. federal prosecutor",
    "description": "Martin is the second Trump nominee in as many days to be pulled after it appeared they would not have the Senate votes to be confirmed.",
    "link": "https://www.cnbc.com/2025/05/08/trump-martin-prosecutor-doj-jan6.html",
    "timestamp": "2025-05-08T16:03:33Z"
  },
  {
    "title": "Reporter Straight Up Asks Trump if He’s ‘Overstating’ UK Trade Deal Because He ‘Needs’ a Win at ‘Difficult Time’",
    "description": "\"With respect, are you overstating the reach and significance of this deal because you're a president who needs a result at a difficult time?” Matthews asked.\nThe post Reporter Straight Up Asks Trump if He’s ‘Overstating’ UK Trade Deal Because He ‘Needs’ a Wi…",
    "link": "https://www.mediaite.com/tv/reporter-straight-up-asks-trump-if-hes-overstating-uk-trade-deal-because-he-needs-a-win-at-difficult-time/",
    "timestamp": "2025-05-08T16:03:21Z"
  },
  {
    "title": "Crocs yanks guidance, citing trade uncertainty",
    "description": "The company recently joined with other footwear brands to urge the Trump administration to exempt the category from tariffs.",
    "link": "https://www.retaildive.com/news/crocs-pulls-guidance-citing-tariff-trade-uncertainty-sales-flat/747518/",
    "timestamp": "2025-05-08T16:03:00Z"
  },
  {
    "title": "The Supreme Court’s birthright citizenship case isn’t really about birthright citizenship",
    "description": "On May 15, the Supreme Court will hear three cases — consolidated under the name Trump v. CASA — which concern his unconstitutional attempt to strip many Americans born in the United States of citizenship. The mere fact that this hearing is happening is signi…",
    "link": "https://www.vox.com/scotus/412035/supreme-court-birthright-citizenship-nationwide-injunctions-trump-casa",
    "timestamp": "2025-05-08T16:02:44Z"
  },
  {
    "title": "BREAKING: Trump Abandons Controversial DC Attorney Nominee After Opposition from GOP Senators",
    "description": "Ed Martin, President Donald Trump’s nominee and the current interim acting U.S. Attorney for the District of Columbia, will not get to claim the role permanently, after the president dropped his support for Martin after opposition from Republican Senators.\nTh…",
    "link": "https://www.mediaite.com/news/breaking-trump-abandons-controversial-dc-attorney-nominee-after-gop-opposition/",
    "timestamp": "2025-05-08T16:02:28Z"
  },
  {
    "title": "Trump says he’ll pull the nomination of Ed Martin, who defended Jan. 6 rioters, for DC US Attorney",
    "description": "A key Republican senator said he could not support Martin for the job.",
    "link": "https://www.bostonherald.com/2025/05/08/trump-prosecutor-martin/",
    "timestamp": "2025-05-08T16:02:02Z"
  },
  {
    "title": "Biden tells 'The View' he wasn't surprised Harris lost, blames sexism and racism",
    "description": "Former President Joe Biden sat for a friendly interview on \"The View\" on Thursday, telling the co-hosts he wasn't surprised former Vice President Kamala Harris lost the 2024 election.",
    "link": "https://www.foxnews.com/media/biden-tells-the-view-he-wasnt-surprised-harris-lost-blames-sexism-racism",
    "timestamp": "2025-05-08T16:01:49Z"
  },
  {
    "title": "Trump says he's dropping Ed Martin’s nomination amid bipartisan opposition",
    "description": "As a rule, Senate Republicans have rubber-stamped Donald Trump's worst nominees. As Ed Martin helped prove, there are rare exceptions.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-ed-martin-nomination-us-attorney-jan-6-rcna205197",
    "timestamp": "2025-05-08T16:01:23Z"
  },
  {
    "title": "House Republicans vote to codify Trump’s executive order on ‘Gulf of America’",
    "description": "Polls show a clear majority of Americans don't want to change the name of the Gulf of Mexico. House Republicans passed new legislation on this anyway.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/house-republicans-vote-codify-trumps-executive-order-gulf-america-rcna205605",
    "timestamp": "2025-05-08T16:01:06Z"
  },
  {
    "title": "Canada looks back to Europe as world marks 80 years since end of Second World War",
    "description": "After the Second World War came to a close, Canada pulled itself away from Great Britain and planted itself firmly within a North American political and economic compact that generated prosperity for much of the western world for decades.",
    "link": "https://www.nationalobserver.com/2025/05/08/news/canada-looks-back-europe-world-marks-80-years-end-second-world-war",
    "timestamp": "2025-05-08T16:00:42Z"
  },
  {
    "title": "Trump on the deal with Britain: Economic security is also national",
    "description": "In joint statements with the British Prime Minister, who was speaking on speakerphone, the US president extolled an agreement that had been pending for years\nThe post Trump on the deal with Britain: Economic security is also national appeared first on ProtoTh…",
    "link": "https://en.protothema.gr/2025/05/08/trump-on-the-deal-with-britain-economic-security-is-also-national/",
    "timestamp": "2025-05-08T16:00:42Z"
  },
  {
    "title": "BREAKING: Here Are the Details of the Trump Trade Deal With the UK",
    "description": "Speaking to reporters and the American people from the Oval Office Thursday morning, President Donald Trump detailed a new trade agreement between the United Kingdom and the United States just one month after Liberation Day. \"I think it's a great deal for bot…",
    "link": "https://freerepublic.com/focus/f-news/4315744/posts",
    "timestamp": "2025-05-08T16:00:12Z"
  },
  {
    "title": "Breaking News: Trump Administration Encouraging Other Nations to Sign Up For Musk’s Starlink Internet Service to Cut Tariffs",
    "description": "The Washington Post reported that the Trump administration is promoting Elon Musk’s Starlink Internet service while negotiating trade deals. Less than two weeks after President Donald Trump announced 50 percent tariffs on goods from the tiny African nation of…",
    "link": "https://dianeravitch.net/2025/05/08/breaking-news-trump-administration-emcouraging-other-nations-to-sign-up-for-musks-starlink-internet-service/",
    "timestamp": "2025-05-08T16:00:00Z"
  },
  {
    "title": "Kennedy Center’s Richard Grenell Slams “Vapid And Intolerant” ‘Les Miz’ Actors, Says “Shame” On ‘American Idol’ For Hiring Lin-Manuel Miranda",
    "description": "Richard Grenell, the Kennedy Center’s interim director appointed by President Donald Trump, is blasting what he calls politically intolerant entertainers who won’t perform at the Kennedy Center in Washington, D.C. due to Donald Trump’s newfound involvement wi…",
    "link": "http://deadline.com/2025/05/kennedy-center-les-miserables-american-idol-1236389966/",
    "timestamp": "2025-05-08T15:59:30Z"
  },
  {
    "title": "Alberta separation could send Canada into uncharted territory, say legal experts",
    "description": "As separatist discontent bubbles up anew in Alberta, experts say a vote to sever ties with Canada would pitch the country into unexplored territory on everything from money to First Nations and national parks.",
    "link": "https://www.nationalobserver.com/2025/05/08/news/alberta-separation-could-send-canada-uncharted-territory-say-legal-experts",
    "timestamp": "2025-05-08T15:59:06Z"
  },
  {
    "title": "EXCLUSIVE: Breastfeeding mom of US citizen sues Kristi Noem after being grabbed by ICE",
    "description": "A breastfeeding mother from Colombia living in Florida with a pending asylum application was detained by U.S. Immigration and Customs Enforcement (ICE) on Sunday and faces a potential transfer to Texas, according to a filing\r\n in the U.S. District Court, Midd…",
    "link": "https://www.rawstory.com/raw-investigates/mother-us-citizen-deported/",
    "timestamp": "2025-05-08T15:59:05Z"
  },
  {
    "title": "Shopify beats earnings forecast but warns of slower growth amid Trump tariffs and trade policy shifts",
    "description": "Shopify topped first-quarter earnings and revenue expectations but issued cautious guidance, citing uncertainty around Trump-era tariffs and changing trade policy. Despite macroeconomic pressures, the Canadian e-commerce firm remains confident, pointing to it…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/shopify-beats-earnings-forecast-but-warns-of-slower-growth-amid-trump-tariffs-and-trade-policy-shifts/articleshow/121004344.cms",
    "timestamp": "2025-05-08T15:58:31Z"
  },
  {
    "title": "Brexit Put Britain at the Front of the Queue, Defying Obama's Dire Warning",
    "description": "Obama tried to scare the people of the U.K. out of voting for Brexit by saying it would put them at the back of the queue for trade deals. Nine years later, the U.K. became the first country to cut a trade deal with the U.S. under President Trump.\nThe post Br…",
    "link": "https://www.breitbart.com/economy/2025/05/08/obamas-brexit-threat/",
    "timestamp": "2025-05-08T15:58:09Z"
  },
  {
    "title": "Biden Claims Harris Lost Because of Racism — and Insists He Would Have Beaten Trump",
    "description": "Joe Biden admitted to The View panelists that he wasn't surprised by Kamala Harris's defeat at the hands of Donald Trump.\nThe post Biden Claims Harris Lost Because of Racism — and Insists He Would Have Beaten Trump first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/biden-claims-harris-lost-because-of-racism-and-insists-he-would-have-beaten-trump/",
    "timestamp": "2025-05-08T15:57:37Z"
  },
  {
    "title": "Social Security, Medicare Cuts Face Massive Opposition in Deep Red State",
    "description": "A new poll found that fewer than one in 10 registered voters support cuts in a state that backed Trump by 30 points last year.",
    "link": "https://www.newsweek.com/social-security-medicare-cuts-tennessee-poll-2069699",
    "timestamp": "2025-05-08T15:55:51Z"
  },
  {
    "title": "John Roberts Sends Cowardly Message to Trump on Takeover of Courts",
    "description": "Chief Justice John Roberts offered a gentle rebuke of Donald Trump’s escalating attacks on the judiciary. \r\nDuring a fireside chat Wednesday night marking the twenty-fifth anniversary of the U.S. District Court for the Western District of New York in Buffalo,…",
    "link": "https://newrepublic.com/post/195008/supreme-court-john-roberts-message-donald-trump",
    "timestamp": "2025-05-08T15:55:06Z"
  },
  {
    "title": "Polls Show Enthusiasm Gap Now Working Against Trump",
    "description": "While partisan polarization controls most job approval numbers in the polls, those who dislike Trump’s performance in office are more adamant about it, just as in 2018. That could matter in 2025 and 2026.",
    "link": "http://nymag.com/intelligencer/article/polls-show-enthusiasm-gap-now-working-against-trump.html",
    "timestamp": "2025-05-08T15:54:36Z"
  },
  {
    "title": "New US bill offers extended stay to Canadian snowbirds amid strained Canada-US relations",
    "description": "A bipartisan US bill aims to extend the stay limit for Canadian snowbirds from 182 to 240 days, amidst growing Canada-US tensions. As Donald Trump's tariff threats and statehood comments rattle relations, lawmakers hope the Canadian Snowbird Visa Act will boo…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/new-us-bill-offers-extended-stay-to-canadian-snowbirds-amid-strained-canada-us-relations/articleshow/121004236.cms",
    "timestamp": "2025-05-08T15:54:04Z"
  },
  {
    "title": "Starmer and Trump strike trade deal to save UK car industry, but there's a catch…",
    "description": "The UK/US trade deal will be a relief for UK car makers exporting to the US but send too many cars and the tariffs will return",
    "link": "https://www.autoexpress.co.uk/news/366763/starmer-and-trump-strike-trade-deal-save-uk-car-industry-theres-catch",
    "timestamp": "2025-05-08T15:53:40Z"
  },
  {
    "title": "Cringey Pop Culture Moments That Haven’t Aged Well Over The Past 20 Years",
    "description": "We’d rather forget those dorky Team Jolie/Team Aniston shirts.",
    "link": "https://www.huffpost.com/entry/pop-culture-moments-from-20-years-ago-that-didnt-age-well_n_681436d6e4b0c3c651ebb082",
    "timestamp": "2025-05-08T15:53:13Z"
  },
  {
    "title": "Trump says 10% is floor for tariffs; 'Some will be much higher'",
    "description": null,
    "link": "https://www.cnbc.com/2025/05/08/trump-tariffs-trade-minimum.html",
    "timestamp": "2025-05-08T15:52:30Z"
  },
  {
    "title": "Why Eli Lilly is falling — plus, what new Costco sales say about the consumer",
    "description": "Every weekday the CNBC Investing Club with Jim Cramer holds a \"Morning Meeting\" livestream at 10:20 a.m. ET. Here's a recap of Thursday's key moments. 1. The stock market is slightly higher on Thursday as President Donald Trump unveiled a new trade deal betwe…",
    "link": "https://biztoc.com/x/c179eac260ce61c7",
    "timestamp": "2025-05-08T15:52:11Z"
  },
  {
    "title": "WestJet suspends nine U.S. routes due to lower demand",
    "description": "WestJet will suspend nine routes between the U.S. and Canada as demand dampens for travel between the two countries.",
    "link": "https://www.cbc.ca/news/business/westjet-suspends-nine-routes-1.7529746",
    "timestamp": "2025-05-08T15:51:05Z"
  },
  {
    "title": "Feds cut funding to IU13, CWS program offering free citizenship classes, legal services",
    "description": "The U.S. Department of Homeland Security has canceled a grant that for 15 years has funded free classes and legal representation for lawful permanent Lancaster County residents who want to become U.S. citizens.",
    "link": "https://lancasteronline.com/news/local/feds-cut-funding-to-iu13-cws-program-offering-free-citizenship-classes-legal-services/article_ca1dc7aa-418d-4ec3-bd9e-c257ddee0aae.html",
    "timestamp": "2025-05-08T15:51:00Z"
  },
  {
    "title": "Xi Jinping, Vladimir Putin Promise to 'Safeguard' Globalism from Trump",
    "description": "Genocidal Chinese dictator Xi Jinping held an extended private meeting and press event alongside Russian strongman Vladimir Putin in Moscow on Thursday in which he declared that China and Russia were ready to \"safeguard the global multilateral trading system,…",
    "link": "https://www.breitbart.com/asia/2025/05/08/xi-jinping-vladimir-putin-promise-to-safeguard-globalism-from-trump/",
    "timestamp": "2025-05-08T15:50:33Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
    "description": "Indian stock indices closed lower Thursday amid India-Pakistan tensions and weak global cues. Sensex fell 412 pts; Nifty dropped 141 pts on profit booking and geopolitical concerns.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/121004177.cms",
    "timestamp": "2025-05-08T15:50:27Z"
  },
  {
    "title": "Oil Jumps on Trade Deal Optimism",
    "description": "1m ago 11:09am CST US-UK Trade Deal Overview President Trump announced a landmark US-UK trade deal, calling it a \"breakthrough\" with one of America’s \"most cherished allies.\" The agreement is set to drive billions of dollars in export opportunities for both n…",
    "link": "https://oilprice.com/Energy/Oil-Prices/Oil-Jumps-on-Trade-Deal-Optimism.html",
    "timestamp": "2025-05-08T15:50:00Z"
  },
  {
    "title": "A Tale of Four Fighter Jets",
    "description": "The aircraft India and Pakistan use to strike each other tell a story of key geopolitical shifts.",
    "link": "http://foreignpolicy.com/2025/05/08/india-pakistan-rafale-strikes-us-russia-china/",
    "timestamp": "2025-05-08T15:49:15Z"
  },
  {
    "title": "EU sets out possible 95-billion-euro response to US tariffs",
    "description": "BRUSSELS (Reuters) -The European Commission on Thursday proposed countermeasures on up to 95 billion euros ($107.2 billion) of U.S. imports if negotiations with Washington fail to remove the series of tariffs applied by U.S. President Donald Trump. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/05/08/eu-sets-out-possible-95-billion-euro-response-to-us-tariffs",
    "timestamp": "2025-05-08T15:49:00Z"
  },
  {
    "title": "Bill Gates plans to give away most of his fortune by 2045",
    "description": "The Microsoft founder says he plans to accelerate his charitable giving - and accused Elon Musk and Doge of 'killing children'.",
    "link": "https://www.bbc.com/news/articles/cx2e87lzqkdo",
    "timestamp": "2025-05-08T15:48:08Z"
  },
  {
    "title": "Trump administration invokes state secrets privilege in Kilmar Abrego Garcia’s case",
    "description": "Trump has doubled down on claims that Abrego Garcia is a member of MS-13.",
    "link": "https://www.bostonherald.com/2025/05/08/abrego-garcia-state-secrets-privilege/",
    "timestamp": "2025-05-08T15:45:14Z"
  },
  {
    "title": "Joe Biden Tells ‘The View’ That He Wasn’t Surprised That Donald Trump Won 2024 Election, Blames Sexism And Covid On Kamala Harris’ Loss",
    "description": "In his first U.S. sitdown interview since leaving office, Joe Biden said that he was not surprised when Donald Trump defeated Kamala Harris and won the 2024 ...",
    "link": "https://deadline.com/2025/05/biden-trump-2024-election-the-view-1236389989/",
    "timestamp": "2025-05-08T15:44:45Z"
  },
  {
    "title": "Joe Biden Tells ‘The View’ That He Wasn’t Surprised That Donald Trump Won 2024 Election, Blames Sexism And Covid On Kamala Harris’ Loss",
    "description": "In his first U.S. sitdown interview since leaving office, Joe Biden said that he was not surprised when Donald Trump defeated Kamala Harris and won the 2024 election. “I was very disappointed, but I was not surprised,” Biden told the hosts of ABC’s The View. …",
    "link": "http://deadline.com/2025/05/biden-trump-2024-election-the-view-1236389989/",
    "timestamp": "2025-05-08T15:44:45Z"
  },
  {
    "title": "Trump signals China 'very much' interested in securing trade deal ahead of Switzerland negotiations",
    "description": "Treasury Secretary Scott Bessent is poised to launch trade negotiations with China in Switzerland on Saturday.",
    "link": "https://www.foxnews.com/politics/trump-signals-china-very-much-interested-securing-trade-deal-ahead-switzerland-negotiations",
    "timestamp": "2025-05-08T15:44:43Z"
  },
  {
    "title": "Bill Gates, philanthropy, donation commitment, global health, aid reduction",
    "description": "\"I know many things will be said about me when I pass away, but I am determined that 'died wealthy' will not be one of them,\" he stated\nThe post Bill Gates, philanthropy, donation commitment, global health, aid reduction appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/05/08/bill-gates-philanthropy-donation-commitment-global-health-aid-reduction/",
    "timestamp": "2025-05-08T15:43:27Z"
  },
  {
    "title": "NFL, White House announce 2027 draft will be held in Washington, D.C. not Buffalo",
    "description": "2027 NFL draft to be held in Washington, D.C. not Buffalo:",
    "link": "https://billswire.usatoday.com/story/sports/nfl/bills/2025/05/08/2027-nfl-draft-to-be-held-in-washington-d-c-not-buffalo/83512890007/",
    "timestamp": "2025-05-08T15:42:59Z"
  },
  {
    "title": "Co-President Lara Loomer Claims Another Scalp",
    "description": "It seems that Nesheiwat's pro-vaccine stance for COVID was too much for Loomer to bear, and after several tweets on Sunday, Trump relented and yanked her nomination immediately. They didn't make it public until Wednesday, however, one day before Nesheiwat's S…",
    "link": "https://crooksandliars.com/2025/05/president-lara-loomer-gets-another-scalp",
    "timestamp": "2025-05-08T15:42:22Z"
  },
  {
    "title": "Biden Defends Staying in 2024 Race on The View — Totally Botches How Much Time He Gave Kamala Harris to Campaign",
    "description": "Biden defended himself against critics who insisted he dropped out too late, hurting Kamala Harris's election chances. He got the timing all wrong. \nThe post Biden Defends Staying in 2024 Race on The View — Totally Botches How Much Time He Gave Kamala Harris …",
    "link": "https://www.mediaite.com/tv/biden-defends-staying-in-2024-race-on-the-view-totally-botches-how-much-time-he-gave-kamala-harris-to-campaign/",
    "timestamp": "2025-05-08T15:41:38Z"
  },
  {
    "title": "Stocks Are Rallying as Trump Discusses Trade Deals",
    "description": "6 min ago\nStocks Are Rallying as Trump Discusses Trade Deals\nThe stock market picked up steam as President Donald Trump discussed his trade deal with the U.K. and upcoming talks with China,\nThe S&P 500 was up 0.9%. The Nasdaq Composite was up 1.3%. The Dow wa…",
    "link": "https://biztoc.com/x/9e6b08771899bb9b",
    "timestamp": "2025-05-08T15:41:35Z"
  },
  {
    "title": "Trump signals deeper US role in Ukraine talks, caution on Iran",
    "description": "US President Donald Trump on Thursday hinted at a greater US role in ending the war in Ukraine and maintained a cautious stance on Iran, speaking after the announcement of a trade deal with the United...",
    "link": "https://biztoc.com/x/82a404fc4dc0bb63",
    "timestamp": "2025-05-08T15:41:12Z"
  },
  {
    "title": "Trump Admin Invokes State Secrets Privilege In Abrego Garcia's Case",
    "description": "Trump Admin Invokes State Secrets Privilege In Abrego Garcia's Case\n \nAuthored by Sam Dorman via The Epoch Times,\nPresident Donald Trump’s administration has invoked the state secrets privilege as a federal court probes for information surrounding Kilmar Abre…",
    "link": "https://biztoc.com/x/27898a152835a05e",
    "timestamp": "2025-05-08T15:41:02Z"
  },
  {
    "title": "Under Trump, Saudi civil nuclear talks delinked from Israel recognition, sources say",
    "description": "",
    "link": "https://www.jpost.com/israel-news/article-853252",
    "timestamp": "2025-05-08T15:40:56Z"
  },
  {
    "title": "'Corruption is staggering': Trump officials push tariffed nations to approve Musk business",
    "description": "Trump administration officials have reportedly been pressuring countries facing U.S. tariffs to approve satellite internet services offered by Elon Musk's Starlink to help grease trade negotiations, further underscoring the conflicts of interest stemming from…",
    "link": "https://www.rawstory.com/staggering-corruption-trump-musk-business/",
    "timestamp": "2025-05-08T15:40:23Z"
  },
  {
    "title": "Bitcoin Tops $100K for First Time in 3 Months; Are Upside Targets Too Low?",
    "description": "The price has jumped 33% in a few weeks after plunging to $75,000 in the days following President Trump's early April Liberation Day tariff announcement.",
    "link": "https://www.coindesk.com/markets/2025/05/02/bitcoin-tops-usd100k-for-first-time-in-3-months-are-upside-targets-too-low",
    "timestamp": "2025-05-08T15:38:56Z"
  },
  {
    "title": "‘Friends of steel’: Xi and Putin pledge to stand together against US",
    "description": "Kremlin seeks boost from visit of powerful ally as leaders cast themselves as defenders of world order",
    "link": "https://www.irishtimes.com/world/europe/2025/05/08/friends-of-steel-xi-and-putin-pledge-to-stand-together-against-us/",
    "timestamp": "2025-05-08T15:38:49Z"
  },
  {
    "title": "Xi stands with Putin against ‘international bullying’ amid Trump trade war",
    "description": "China and Russia pledged to deepen their relationship and oppose \"power politics\" amid tough negotiations with President Donald Trump on trade and war.",
    "link": "https://www.foxnews.com/world/xi-stands-putin-against-international-bullying-amid-trump-trade-war",
    "timestamp": "2025-05-08T15:38:34Z"
  },
  {
    "title": "Gold price falls as U.S-U.K announce trade deal; here's how much it fell and what experts are saying",
    "description": "Gold prices fall as U.S. President Donald Trump signals a major trade deal with Britain, easing market fears and reducing gold’s appeal as a safe-haven asset. With spot gold dropping 0.7% to $3,342.22 and U.S. gold futures down 1.3% to $3,347.90, investors sh…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-falls-as-u-s-u-k-announce-trade-deal-heres-how-much-it-fell-and-what-experts-are-saying/articleshow/121000097.cms",
    "timestamp": "2025-05-08T15:37:35Z"
  },
  {
    "title": "A Mar-a-Lago Accord Could Break the Dollar",
    "description": "The risk inherent in a \"Mar-a-Lago Accord\" to orchestrate a dollar depreciation is that the weaponization of trade and US security assurances will destroy confidence in the greenback. Whereas similar previous efforts merely failed, the Trump administration's …",
    "link": "https://www.project-syndicate.org/commentary/mar-a-lago-accord-could-break-the-dollar-by-harold-james-2025-05",
    "timestamp": "2025-05-08T15:37:15Z"
  },
  {
    "title": "Trump administration cut more than $1.8 billion in NIH grants",
    "description": "The Trump administration terminated $1.81 billion in National Institutes of Health grants in less than 40 days, including $544 million in as-yet-unspent funds.",
    "link": "https://www.nbcnews.com/health/health-news/trump-administration-cut-18-billion-nih-grants-rcna205568",
    "timestamp": "2025-05-08T15:36:40Z"
  },
  {
    "title": "Britain's digital tax on 'Big Tech' not impacted by trade deal",
    "description": "LONDON :Britain's digital services tax, imposed on U.S. companies like Amazon, Google and Meta, will not be changed under the terms of the trade deal agreed between the two countries on Thursday, the British government said. U.S. President Donald Trump has be…",
    "link": "https://www.channelnewsasia.com/business/britains-digital-tax-big-tech-not-impacted-trade-deal-5117911",
    "timestamp": "2025-05-08T15:36:16Z"
  },
  {
    "title": "US House Committees to Begin Debate on Trump Tax Cuts on Tuesday",
    "description": "The legislative push for President Donald Trump’s massive tax package will begin in earnest next week as key House committees consider the legislation despite lingering divisions among Republicans.",
    "link": "https://financialpost.com/pmn/business-pmn/us-house-committees-to-begin-debate-on-trump-tax-cuts-on-tuesday",
    "timestamp": "2025-05-08T15:36:04Z"
  },
  {
    "title": "House votes to rename Gulf of Mexico to ‘Gulf of America’",
    "description": "The Republican-led House passed a bill Thursday that would rename the Gulf of Mexico as the Gulf of America and direct federal agencies to update their documents and maps to incorporate the new name.",
    "link": "https://nypost.com/2025/05/08/world-news/house-votes-to-rename-gulf-of-mexico-to-gulf-of-america/",
    "timestamp": "2025-05-08T15:35:23Z"
  },
  {
    "title": "Trump Unveils UK Trade Agreement, Promises Export Growth and Tariff Gains",
    "description": "Trump Unveils UK Trade Agreement, Promises Export Growth and Tariff Gainstheepochtimes.com",
    "link": "https://www.theepochtimes.com/business/trump-unveils-uk-trade-agreement-promises-export-growth-and-tariff-gains-5854434",
    "timestamp": "2025-05-08T15:35:16Z"
  },
  {
    "title": "Trump says 'final details' still to come in U.K. trade agreement",
    "description": "The United States and Britain announced plans for a symbolically important trade deal on Thursday, likely lowering the financial burden from President Donald Trump's sweeping tariffs while creating greater access abroad for American goods.",
    "link": "https://www.cbc.ca/news/world/britain-trump-tariff-deal-1.7529670",
    "timestamp": "2025-05-08T15:34:22Z"
  },
  {
    "title": "The Brain Rot Cabinet",
    "description": "Last week, baffling many and delighting a few, HHS secretary Robert F. Kennedy Jr. declared during a Trump administration cabinet meeting that he’s engaged in a hunt for what he said were 300,000 missing children trafficked by the Biden administration. “We ha…",
    "link": "https://www.motherjones.com/politics/2025/05/trump-cabinet-conspiracies-missing-children-epstein/",
    "timestamp": "2025-05-08T15:34:01Z"
  },
  {
    "title": "FBI chief reverses course after saying White House budget proposal too low",
    "description": "WASHINGTON (Reuters) -FBI Director Kash Patel told a U.S. Senate panel on Thursday that he supports a White House proposal to cut the bureau's budget, a day after telling lawmakers he had wanted $1 billion more than the administration had requested. Read full…",
    "link": "https://www.thestar.com.my/news/world/2025/05/08/fbi-chief-reverses-course-after-saying-white-house-budget-proposal-too-low",
    "timestamp": "2025-05-08T15:34:00Z"
  },
  {
    "title": "AI Turns Tariff Chaos Into A Competitive Advantage",
    "description": "Amidst this tariff chaos, artificial intelligence emerges as a crucial tool for navigating trade compliance challenges.",
    "link": "https://www.forbes.com/sites/jessicamendoza1/2025/05/08/ai-turns-tariff-chaos-into-a-competitive-advantage/",
    "timestamp": "2025-05-08T15:33:33Z"
  },
  {
    "title": "Trump doesn't understand how the Constitution works",
    "description": "President Donald Trump's deportations, defiance of courts and freezing of congressionally approved spending show he doesn't understand how the Constitution works.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-deportations-courts-amendments-constitution-rcna205372",
    "timestamp": "2025-05-08T15:33:24Z"
  },
  {
    "title": "EU opts for bigger tariff stick as Trump turns up nose at carrots",
    "description": "Creeping sense inside European Commission that some US tariffs might be here to stay",
    "link": "https://www.irishtimes.com/business/2025/05/08/eu-opts-for-bigger-tariff-stick-as-trump-turns-up-nose-at-carrots/",
    "timestamp": "2025-05-08T15:33:02Z"
  },
  {
    "title": "Trump says U.S. reached breakthrough trade deal with Britain",
    "description": "WASHINGTON (Reuters) - U.S. President Donald Trump said on Thursday that the United States had reached a breakthrough trade deal with Britain. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/08/trump-says-us-reached-breakthrough-trade-deal-with-britain",
    "timestamp": "2025-05-08T15:33:00Z"
  },
  {
    "title": "Boeing now plans to deliver new Air Force One jets in 2027, before Trump leaves office | CNN Business",
    "description": "Long-delayed next Air Force One jets from Boeing might now be delivered by 2027 — in time for President Donald Trump to use them, according to a top Air Force official.",
    "link": "https://www.cnn.com/2025/05/08/business/boeing-trump-air-force-one",
    "timestamp": "2025-05-08T15:32:28Z"
  }
]