[
  {
    "title": "Eric Dickerson Says If Bad Bunny Dislikes U.S., 'Keep His Ass In Puerto Rico'",
    "description": "Eric Dickerson is urging Bad Bunny to pull out of the Super Bowl halftime show if he is, indeed, not a fan of the United States ... saying the \"Tití Me Preguntó\" crooner should straight up \"keep his ass where he's at\" if he truly feels some type of way about …",
    "link": "https://www.tmz.com/2025/10/07/eric-dickerson-bad-bunny/",
    "timestamp": "2025-10-07T22:30:03Z"
  },
  {
    "title": "Senate Republicans confirm more than 100 Trump nominees as government shutdown continues (Alex Miller/Fox News)",
    "description": "Alex Miller / Fox News:\nSenate Republicans confirm more than 100 Trump nominees as government shutdown continues  —  Mass confirmation includes ambassadors and senior officials as shutdown enters seventh day  —  Senate Republicans confirmed a staggering tranc…",
    "link": "https://www.memeorandum.com/251007/p115",
    "timestamp": "2025-10-07T22:30:02Z"
  },
  {
    "title": "Prince Andrew Met Pedophile Epstein YEARS Before Disgraced Royal Said He Did, Beauty Queen Claims in Damaging Interview",
    "description": "Prince Andrew can't seem to get his alleged lies in order, as a beauty queen's new claim has the the royal meeting Jeffrey Epstein years before he said he did.",
    "link": "https://radaronline.com/p/prince-andrew-met-epstein-years-before-royal-said-he-did-beatrice-keul/",
    "timestamp": "2025-10-07T22:30:00Z"
  },
  {
    "title": "Two Years After the October 7th Attacks",
    "description": "From the daily newsletter: our coverage of the Israel-Hamas war, and a glimpse of a ceasefire.",
    "link": "https://www.newyorker.com/newsletter/the-daily/israel-and-hamas-at-the-edge-of-peace",
    "timestamp": "2025-10-07T22:30:00Z"
  },
  {
    "title": "Trump wants to sell some student loans. What if yours is one of them?",
    "description": "Trump's considering selling US student loans to private investors. Can he do it? What happens if yours gets sold?",
    "link": "https://www.usatoday.com/story/money/personalfinance/2025/10/07/can-trump-sell-student-debt/86568020007/",
    "timestamp": "2025-10-07T22:25:16Z"
  },
  {
    "title": "Senate confirmation of Trump nominee cements his shake-up of top civil rights agency",
    "description": "The Senate confirmed President Donald Trump’s pick to fill a critical vacancy at the top agency for worker rights, restoring it to the full power needed to deepen his overhaul of civil rights enforcement. The confirmation of Brittany Panuccio as a commissione…",
    "link": "https://financialpost.com/pmn/senate-confirmation-of-trump-nominee-cements-his-shake-up-of-top-civil-rights-agency",
    "timestamp": "2025-10-07T22:24:29Z"
  },
  {
    "title": "Trump pulls a Mariah Carey move on Bad Bunny: “I don’t know who he is”",
    "description": "Despite claiming to not know who he is, Trump calls the choice for the 2026 Super Bowl halftime show “ridiculous.\"",
    "link": "https://www.salon.com/2025/10/07/trump-pulls-a-mariah-carey-move-on-bad-bunny-i-dont-know-who-he-is/",
    "timestamp": "2025-10-07T22:24:17Z"
  },
  {
    "title": "Are Democrats willing to take partial victory in health care fight to end gov't shutdown?",
    "description": "Are Democrats willing to take partial victory in health care fight to end gov't shutdown?foxbaltimore.com",
    "link": "https://foxbaltimore.com/news/nation-world/are-democrats-willing-to-take-partial-victory-in-health-care-fight-to-end-govt-shutdown",
    "timestamp": "2025-10-07T22:23:50Z"
  },
  {
    "title": "Families of Hostages Hopeful, ‘Sense a Shift’ on 2nd Anniversary of Oct. 7 Attack on Israel",
    "description": "It’s been two years since Hamas attacked Israel, killing Ronen Neutra’s son and taking his body captive. Since then, numerous hostage deals have fallen through,... Read More\nThe post Families of Hostages Hopeful, ‘Sense a Shift’ on 2nd Anniversary of Oct. 7 A…",
    "link": "https://www.dailysignal.com/2025/10/07/families-hostages-hopeful-sense-a-shift-2nd-anniversary-oct-7/",
    "timestamp": "2025-10-07T22:23:19Z"
  },
  {
    "title": "Senate confirmation of Trump nominee cements his shake-up of top civil rights agency",
    "description": "The Senate confirmed President Donald Trump's pick to fill a critical vacancy at the top agency for worker rights, restoring it to the full power needed to...",
    "link": "https://www.yahoo.com/news/articles/senate-confirmation-trump-nominee-cements-222312090.html",
    "timestamp": "2025-10-07T22:23:12Z"
  },
  {
    "title": "Argentina’s Milei rocks the vote with resistance songs amid party turmoil | CNN",
    "description": "Argentine President Javier Milei took to the stage Monday night in Buenos Aires for a book launch-turned-rock concert, a move that delighted his fans but drew criticism from opposition members who accused him of being out of touch with the country’s economic …",
    "link": "https://www.cnn.com/2025/10/07/americas/milei-concert-argentina-economy-intl-latam",
    "timestamp": "2025-10-07T22:22:26Z"
  },
  {
    "title": "Trump calls climate change a con; science braces for more",
    "description": "The Department of Energy is reportedly telling staff to avoid using language that runs counter to the president's views on climate science.",
    "link": "https://www.japantimes.co.jp/environment/2025/10/08/climate-change/trump-climate-change-con-science/",
    "timestamp": "2025-10-07T22:20:00Z"
  },
  {
    "title": "Trump’s vengeful, homoerotic dream of war is pure 80s Hollywood",
    "description": "The cultural assumptions that animate Trump's program can be traced back to a three-year stretch of the US president's favourite decade.\nThe post Trump’s vengeful, homoerotic dream of war is pure 80s Hollywood appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/10/08/donald-trumps-1980s-vietnam-culture-military/",
    "timestamp": "2025-10-07T22:19:56Z"
  },
  {
    "title": "Japanese Stocks Soar, Optimism Blooms as Conservative Takaichi Sanae Set to Become First Female Prime Minister",
    "description": "Japan’s Nikkei stock index rose 4.7 percent to a record high of 47,944.76 on Monday, driven by a remarkable surge of investor optimism over the election of conservative Takaichi Sanae as leader of the Liberal Democratic Party (LDP), and most likely the first …",
    "link": "https://www.breitbart.com/asia/2025/10/07/japanese-stocks-soar-optimism-blooms-as-conservative-takaichi-sanae-set-to-become-first-female-prime-minister/",
    "timestamp": "2025-10-07T22:19:13Z"
  },
  {
    "title": "Australian steel producers to be hit as European Union plans 50 per cent supersized tariff, imports slashed",
    "description": "In a huge blow to Australian steel producers, the European Union has announced plans to double tariffs and halve the amount of foreign steel it imports.",
    "link": "https://thenightly.com.au/business/australian-steel-producers-to-be-hit-as-european-union-plans-50-per-cent-tariff-hike-c-20275801",
    "timestamp": "2025-10-07T22:18:50Z"
  },
  {
    "title": "Human Rights Defenders Decry 'Unspeakable Suffering' in Gaza as Genocide Enters Third Year",
    "description": "As Israel's genocide in Gaza enters its third year, human rights defenders around the world on Tuesday condemned what one United Nations official called the \"unspeakable suffering\" of the Palestinian people and the complicity of the United States and other co…",
    "link": "https://www.commondreams.org/news/2-years-of-gaza-genocide",
    "timestamp": "2025-10-07T22:18:08Z"
  },
  {
    "title": "DOJ adds 2 out-of-state attorneys to Comey case ahead of his arraignment",
    "description": "The DOJ has added two assistant U.S. attorneys from out of state to work on the case against former FBI Director James Comey ahead of Comey's arraignment on Wednesday.",
    "link": "https://abcnews.go.com/US/doj-adds-2-state-attorneys-comey-case-ahead/story?id=126306467",
    "timestamp": "2025-10-07T22:17:58Z"
  },
  {
    "title": "LeBlanc says 'more detailed' trade talks with Trump are aimed at quick deals",
    "description": null,
    "link": "https://www.nationalobserver.com/2025/10/07/news/leblanc-says-more-detailed-trade-talks-trump-are-aimed-quick-deals",
    "timestamp": "2025-10-07T22:12:45Z"
  },
  {
    "title": "Republicans Used Pam Bondi's Contentious Senate Hearing to Launch a Ludicrous New Conspiracy Theory",
    "description": "At this rate, both the 2016 and 2020 elections are in danger of being tangled up in a web of unreality.",
    "link": "https://www.esquire.com/news-politics/politics/a68888512/pam-bondi-senate-hearing-new-conspiracy-theory/",
    "timestamp": "2025-10-07T22:12:00Z"
  },
  {
    "title": "Trump administration threatens no back pay for federal workers in shutdown (Lisa Mascaro/Associated Press)",
    "description": "Lisa Mascaro / Associated Press:\nTrump administration threatens no back pay for federal workers in shutdown  —  President Donald Trump's administration warned on Tuesday of no guaranteed back pay for federal workers during a government shutdown, reversing wha…",
    "link": "https://www.memeorandum.com/251007/p113",
    "timestamp": "2025-10-07T22:10:01Z"
  },
  {
    "title": "Bondi clashes with Senate Democrats in fiery hearing amid government shutdown (Heather Hunter/Washington Examiner)",
    "description": "Heather Hunter / Washington Examiner:\nBondi clashes with Senate Democrats in fiery hearing amid government shutdown  —  Attorney General Pam Bondi delivered a combative performance before the Senate Judiciary Committee on Tuesday, repeatedly sparring with Dem…",
    "link": "https://www.memeorandum.com/251007/p114",
    "timestamp": "2025-10-07T22:10:01Z"
  },
  {
    "title": "Both parties pack the ballot for US House special primary in Tennessee",
    "description": "The race to replace former U.S. Rep. Mark Green includes 11 Republicans and four Democrats.",
    "link": "https://www.bostonherald.com/2025/10/07/us-election-2025-tennessee-congress/",
    "timestamp": "2025-10-07T22:08:37Z"
  },
  {
    "title": "White House suggests some federal workers may not get back pay after shutdown",
    "description": "With the shutdown about to enter its second week, Trump says some furloughed workers \"don't deserve to be taken care of\".",
    "link": "https://www.bbc.com/news/articles/cwyld9qqgv8o",
    "timestamp": "2025-10-07T22:08:30Z"
  },
  {
    "title": "James Comer Warns Trump Against Pardoning Jeffrey Epstein Associate: ‘I Would Strongly Discourage’ It",
    "description": "Rep. James Comer warned President Donald Trump about pardoning convicted child sex trafficker Ghislaine Maxwell.\nThe post James Comer Warns Trump Against Pardoning Jeffrey Epstein Associate: ‘I Would Strongly Discourage’ It first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/james-comer-cautions-trump-against-pardoning-jeffrey-epstein-associate-i-would-strongly-discourage-it/",
    "timestamp": "2025-10-07T22:08:30Z"
  },
  {
    "title": "Fox News Politics Newsletter: Government crawls into crisis as shutdown continues",
    "description": "Welcome to the Fox News Politics newsletter, your source for the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-government-crawls-crisis-shutdown-continues",
    "timestamp": "2025-10-07T22:06:41Z"
  },
  {
    "title": "FINRA Sublets 78K-SF Office From Gannett in NoVA",
    "description": "The Financial Industry Regulatory Authority (FINRA) is expanding its presence in the DMV, even as fellow quasi-government agencies cut federal leases or are considered by President Donald Trump for privatization.  FINRA sublet 77,916 square feet from media gi…",
    "link": "http://commercialobserver.com/2025/10/finra-gannett-sublease-office-tysons-virginia/",
    "timestamp": "2025-10-07T22:05:05Z"
  },
  {
    "title": "Watch: Trump 'Sort Of Made A Decision' On Tomahawks To Ukraine",
    "description": "Watch: Trump 'Sort Of Made A Decision' On Tomahawks To Ukraine\n \nPresident Donald Trump told reporters in the Oval Office that he has \"sort of made a decision\" concerning the ultra-controversial question of selling and transferring long-range Tomahawk missile…",
    "link": "https://biztoc.com/x/dacbc3ea5ded4ae1",
    "timestamp": "2025-10-07T22:04:23Z"
  },
  {
    "title": "Are Trump’s voters turning against him?",
    "description": "Donald Trump participates in a roundtable discussion at the Latino Summit held at Trump National Doral Golf Club on October 22, 2024, in Doral, Florida. | Anna Moneymaker/Getty Images \nTariffs. United States Immigration and Customs Enforcement raids. National…",
    "link": "https://biztoc.com/x/a6f593597d1eeb66",
    "timestamp": "2025-10-07T22:03:51Z"
  },
  {
    "title": "Adam Carolla Slams Dave Chappelle, Bill Burr for Taking Saudi Money and Bashing America: ‘Don’t Be Preachy and Take the Cash’",
    "description": "Adam Carolla said his problem with comics Dave Chappelle and Bill Burr performing at the Riyadh Comedy Festival is they will bash the US but not Saudi Arabia\nThe post Adam Carolla Slams Dave Chappelle, Bill Burr for Taking Saudi Money and Bashing America: ‘Do…",
    "link": "https://www.mediaite.com/media/adam-carolla-slams-dave-chappelle-bill-burr-for-taking-saudi-money-and-bashing-america-dont-be-preachy-and-take-the-cash/",
    "timestamp": "2025-10-07T22:03:03Z"
  },
  {
    "title": "Conor McGregor accepts 18-month ban for UFC anti-doping violation",
    "description": "His suspension began on September 20 2024 and will conclude on March 20 2026.",
    "link": "https://www.the42.ie/conor-mcgregor-accepts-18-month-ban-for-ufc-anti-doping-violation-6838233-Oct2025/",
    "timestamp": "2025-10-07T22:02:57Z"
  },
  {
    "title": "Donald Trump defends Mark Sánchez after violent stabbing: 'He's a good guy'",
    "description": "President Donald Trump has publicly defended the former NFL quarterback Mark Sanchez, following his arrest in connection with a violent stabbing that left a delivery driver serious",
    "link": "https://www.marca.com/en/nfl/new-york-jets/2025/10/08/68e58d2622601d91508b4586.html",
    "timestamp": "2025-10-07T22:02:45Z"
  },
  {
    "title": "Bipartisan US governors' group faces division over Trump's deployment of troops to states",
    "description": "The Democratic governors of California and Illinois are threatening to leave the National Governors Association because of its silence on President Donald Trump's deployment of National Guard troops across state lines despite objections from the receiving sta…",
    "link": "https://www.kcra.com/article/california-illinois-donald-trump-national-guard-governors-association/68889781",
    "timestamp": "2025-10-07T22:02:11Z"
  },
  {
    "title": "After Tariffs, Trump Courts India With Energy and Defense Deals",
    "description": "U.S. President Donald Trump’s core financial strategy for ending Russia’s war in Ukraine is to starve it of oil and gas revenue. The initial focus of this from Washington’s perspective in the immediate aftermath of the 24 February 2022 invasion was to stop Eu…",
    "link": "https://oilprice.com/Energy/Energy-General/After-Tariffs-Trump-Courts-India-With-Energy-and-Defense-Deals.html",
    "timestamp": "2025-10-07T22:00:00Z"
  },
  {
    "title": "'Total disaster': How furloughed government workers plan to weather shutdown",
    "description": "Roughly 750,000 federal workers have been furloughed.",
    "link": "https://abcnews.go.com/Business/total-disaster-furloughed-workers-plan-hold-garage-sales/story?id=126308614",
    "timestamp": "2025-10-07T21:59:44Z"
  },
  {
    "title": "MAGA Loses Its Collective Mind Over New Country Song Bashing ICE",
    "description": "Trump Republicans aren’t too happy about the new Zach Bryan song coming for the airwaves.The Grammy award-winning country music singer released a snippet of an unreleased track, “Bad News”, on his Instagram over the weekend. From the minute-long preview, “Bad…",
    "link": "https://newrepublic.com/post/201457/maga-loses-mind-country-song-ice",
    "timestamp": "2025-10-07T21:57:55Z"
  },
  {
    "title": "Conor McGregor hit with 18-month ban for missing anti-doping tests — what it means for UFC White House card",
    "description": "CSAD said the Irish fighter missed three attempted biological sample collections during a 12-month period in 2024 and that constituted a violation of anti-doping policy.",
    "link": "https://nypost.com/2025/10/07/sports/conor-mcgregor-hit-with-18-month-ban-for-missing-anti-doping-tests/",
    "timestamp": "2025-10-07T21:57:53Z"
  },
  {
    "title": "Bondi Clashes With Illinois’ Durbin Over Sending National Guard Troops to Chicago",
    "description": "Attorney General Pam Bondi clashed with Sen. Dick Durbin, D-Ill., on law enforcement issues at a fiery Senate Judiciary Committee hearing on Tuesday. Durbin, the... Read More\nThe post Bondi Clashes With Illinois’ Durbin Over Sending National Guard Troops to C…",
    "link": "https://www.dailysignal.com/2025/10/07/bondi-dunks-durbin-discusses-law-enforcement/",
    "timestamp": "2025-10-07T21:55:29Z"
  },
  {
    "title": "How will Pakistan pay for AIM-120 AMRAAM US missiles? Explaining the new arms deal and its impact on Pakistan’s defence and economy",
    "description": "How will Pakistan pay for AIM-120 AMRAAM US missiles? The United States has listed Pakistan among several nations to receive advanced medium-range air-to-air missiles under a $2.5 billion arms deal. The agreement raises economic and strategic questions as Pak…",
    "link": "https://economictimes.indiatimes.com/news/international/us/how-will-pakistan-pay-for-aim-120-amraam-us-missiles-explaining-the-new-arms-deal-and-its-impact-on-pakistans-defence-and-economy-advanced-medium-range-air-to-air-missiles-2-5-billion-arms-deal-agreement-imf-assistance-for-financial-stability/articleshow/124371816.cms",
    "timestamp": "2025-10-07T21:54:55Z"
  },
  {
    "title": "Are Trump’s voters turning against him?",
    "description": "Tariffs. United States Immigration and Customs Enforcement raids. National Guard deployments. Epstein files. Strikes on Iran. Gaza and Ukraine. Sticky inflation. The first year of President Donald Trump’s time in office has been a firehose of unpopular polici…",
    "link": "https://www.vox.com/politics/464021/coalition-trump-voters-turning-against-him-2024-midterm-2026",
    "timestamp": "2025-10-07T21:54:37Z"
  },
  {
    "title": "Senate Republicans confirm more than 100 Trump nominees as government shutdown continues",
    "description": "Republicans confirmed 107 Trump nominees including Herschel Walker and Sergio Gor as ambassadors, marking the second use of new Senate confirmation rules.",
    "link": "https://www.foxnews.com/politics/senate-republicans-confirm-more-than-100-trump-nominees-government-shutdown-continues",
    "timestamp": "2025-10-07T21:52:56Z"
  },
  {
    "title": "Senate GOP Confirms Herschel Walker, 107 Others In Massive Single Vote After Backlog",
    "description": "'Nearly 300 civilian nominees confirmed'",
    "link": "https://dailycaller.com/2025/10/07/senate-gop-confirms-herschel-walker-107-others-in-massive-single-vote-after-backlog/",
    "timestamp": "2025-10-07T21:51:26Z"
  },
  {
    "title": "Gingrich, Kudlow: Dems ‘engaged in insurrection’ by resisting immigration enforcement",
    "description": "'Those state and local officials who try to block it … in that sense, I think they’re liable to very serious penalties'",
    "link": "https://www.wnd.com/2025/10/gingrich-kudlow-dems-engaged-insurrection-resisting-immigration-enforcement/",
    "timestamp": "2025-10-07T21:50:53Z"
  },
  {
    "title": "Modi Praises Putin, Starting Starmer Visit on Awkward Note",
    "description": "Indian Prime Minister Narendra Modi sent a warm birthday message to Russia’s Vladimir Putin just hours before Keir Starmer’s arrival, providing an awkward start to a visit meant to be focused on trade.",
    "link": "https://financialpost.com/pmn/business-pmn/modi-praises-putin-starting-starmer-visit-on-awkward-note",
    "timestamp": "2025-10-07T21:49:07Z"
  },
  {
    "title": "Trump Threatens to Invoke the Insurrection Act Against American Cities",
    "description": "President Donald Trump is escalating a threat to involve the U.S. military in American cities, using a law that hasn't been activated in more three decades. 47 brought up the idea of invoking the Insurrection Act while speaking to reporters at the…\n Permalink",
    "link": "https://www.tmz.com/2025/10/07/donald-trump-invoking-insurrection-act/",
    "timestamp": "2025-10-07T21:48:25Z"
  },
  {
    "title": "Two Louisiana natives confirmed for jobs in Trump administration: See who, what they'll do",
    "description": "WASHINGTON – The government may be shut down, but the U.S. Senate Tuesday confirmed a group of President Donald Trump’s nominations for offices in his administration, including three from Louisiana.",
    "link": "https://www.theadvocate.com/baton_rouge/news/david-lacerte-and-james-baehr-confirmed-for-jobs-with-trump/article_0dd7020c-d09d-5545-a531-7005b7b1dd88.html",
    "timestamp": "2025-10-07T21:48:00Z"
  },
  {
    "title": "Ex-Auburn coach Bruce Pearl issues grave warning 2 years after Oct 7 terror attacks",
    "description": "Former Auburn basketball coach Bruce Pearl issued a grave warning two years after the Oct. 7 attacks and commended President Donald Trump's resolve in efforting a peace deal.",
    "link": "https://www.foxnews.com/sports/ex-auburn-coach-bruce-pearl-issues-grave-warning-2-years-after-oct-7-terror-attacks",
    "timestamp": "2025-10-07T21:47:01Z"
  },
  {
    "title": "Pam Bondi Fiercely Attacks Democrat Asking About Alleged Trump, Epstein Photos With ‘Half-Naked Young Women’",
    "description": "In a scathing attack, Bondi implied that Sen. Sheldon Whitehouse (D-R.I.) should be more concerned about his own link to the late disgraced financier.",
    "link": "https://www.huffpost.com/entry/pam-bondi-half-naked-trump-epstein-photos_n_68e552abe4b05e212f21d7e0",
    "timestamp": "2025-10-07T21:46:51Z"
  },
  {
    "title": "Up to 200 Texas National Guard troops arrive in Illinois as Trump plans Chicago deployment",
    "description": "The Illinois attorney general has accused the president of using US troops “to punish his political enemies.”",
    "link": "https://www.thejournal.ie/chicago-national-guard-6838199-Oct2025/",
    "timestamp": "2025-10-07T21:45:28Z"
  },
  {
    "title": "Trump Bashes NFL Over Bad Bunny Super Bowl Halftime Show",
    "description": "“I don’t know who he is, I don’t know why they’re doing it. It’s, like, crazy. I think it’s absolutely ridiculous.”",
    "link": "https://littlethings.com/entertainment/trump-bashes-nfl-over-bad-bunny-super-bowl-halftime-show",
    "timestamp": "2025-10-07T21:44:42Z"
  },
  {
    "title": "Trump has 'embraced' the media more than his predecessors, CNN host admits",
    "description": "CNN anchor Kaitlan Collins remarked how accessible President Donald Trump is to the media compared to past presidents while speaking on a podcast.",
    "link": "https://www.foxnews.com/media/trump-has-embraced-media-more-than-his-predecessors-cnn-host-admits",
    "timestamp": "2025-10-07T21:44:17Z"
  },
  {
    "title": "Monica Crowley Praises Trump & Hegseth's 'Real Masculinity'",
    "description": "\"We are now totally over that destructive, stupid era of toxic masculinity and now we’re in an era of real masculinity thanks to the bold, muscular leadership of President Trump and our Secretary of War Pete Hegseth.\" ",
    "link": "https://littlethings.com/entertainment/monica-crowley-trump-hegseth-masculinity",
    "timestamp": "2025-10-07T21:43:53Z"
  },
  {
    "title": "Kristi Noem Tells National Guard In Oregon 'Get Ready'",
    "description": "Homeland Security Secretary Kristi Noem told members of the National Guard in Oregon to \"get ready,\" on Tuesday, despite a judge's order blocking President Donald Trump from deploying them in the state.",
    "link": "https://biztoc.com/x/3641f43cad9f00d7",
    "timestamp": "2025-10-07T21:41:52Z"
  },
  {
    "title": "Kavanaugh Would-Be Assassin’s Light Sentence Sends Message That Violent Left Faces Different Standard",
    "description": "It seems in the wake of increasing political violence, assassinations, and left-wing terrorism, you can count on left-leaning judges to go easy on perpetrators. That’s... Read More\nThe post Kavanaugh Would-Be Assassin’s Light Sentence Sends Message That Viole…",
    "link": "https://www.dailysignal.com/2025/10/07/kavanaugh-would-be-assassins-light-sentence-sends-message-that-violent-left-faces-different-standard/",
    "timestamp": "2025-10-07T21:39:53Z"
  },
  {
    "title": "The signs of a blue wave aren't there like they were in Trump's first term: From the Politics Desk",
    "description": "Welcome to the online version of From the Politics Desk, a newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail",
    "link": "https://www.nbcnews.com/politics/politics-news/signs-blue-wave-arent-trumps-first-term-politics-desk-rcna236231",
    "timestamp": "2025-10-07T21:37:59Z"
  },
  {
    "title": "After sectarian clashes in Aleppo, US, SDF, and Syrian government officials meet in Damascus",
    "description": "Syrian President Ahmed al Sharaa met with US Envoy Tom Barrack and the head of US Central Command, Admiral Brad Cooper, in Damascus on October 7. The meeting came in the wake of clashes between factions backed by the Syrian transitional government and Kurdish…",
    "link": "https://www.longwarjournal.org/archives/2025/10/after-sectarian-clashes-in-aleppo-us-sdf-and-syrian-government-officials-meet-in-damascus.php",
    "timestamp": "2025-10-07T21:35:08Z"
  },
  {
    "title": "Senate stalls on shutdown vote amid warning furloughed workers may lose pay",
    "description": "White House memo suggests 750,000 furloughed federal workers may not get back pay despite 2019 law, sparking bipartisan concern among lawmakers.",
    "link": "https://www.foxnews.com/politics/senate-stalls-shutdown-vote-amid-warning-furloughed-workers-may-lose-pa",
    "timestamp": "2025-10-07T21:35:00Z"
  },
  {
    "title": "'She blew it': Ex-GOP analyst shreds Pam Bondi over 'venomous' Senate hearing",
    "description": "A former Republican strategist and staunch critic of President Donald Trump shredded Attorney General Pam Bondi's \"venomous\" appearance before the Senate Judiciary Committee on Tuesday in a new essay. Rick Wilson, who co-founded The Lincoln Project, argued in…",
    "link": "https://www.rawstory.com/pam-bondi-2674163469/",
    "timestamp": "2025-10-07T21:32:33Z"
  },
  {
    "title": "Hamas seeks ‘guarantees’ that Israel will end Gaza war as talks continue",
    "description": "Senior Hamas official says group intends to release captives in stages linked to the withdrawal of Israel's military.",
    "link": "https://www.aljazeera.com/news/2025/10/7/hamas-lays-down-conditions-for-peace-deal-as-israel-continues-bombing-gaza",
    "timestamp": "2025-10-07T21:32:25Z"
  },
  {
    "title": "Texas AG launches undercover operations to infiltrate 'leftist terror cells' across the state",
    "description": "Texas AG Ken Paxton has launched investigations to infiltrate leftist groups, citing Charlie Kirk's murder and attacks on ICE facilities in Texas as political terrorism.",
    "link": "https://www.foxnews.com/politics/texas-ag-launches-undercover-operations-infiltrate-leftist-terror-cells-across-state",
    "timestamp": "2025-10-07T21:30:11Z"
  },
  {
    "title": "Jon Stewart Calls Chuck Schumer ‘A Human Flat Tire’ After Terrible Healthcare Joke",
    "description": "We’d tell Schumer, ‘Don't quit your day job,’ but that would actually solve a lot of our problems",
    "link": "https://www.cracked.com/article_48675_jon-stewart-calls-chuck-schumer-a-human-flat-tire-after-terrible-healthcare-joke.html",
    "timestamp": "2025-10-07T21:30:00Z"
  },
  {
    "title": "Jane Goodall said she'd like to put Trump, others 'on one of Musk's spaceships'",
    "description": "Jane Goodall, famed conservationist and chimpanzee researcher, said in a posthumously released interview that she’d like to put Elon Musk, Donald Trump, Vladimir Putin, Xi Jinping and Benjamin Netanyahu “on one of Musk's spaceships and send them all off to th…",
    "link": "https://www.snopes.com//fact-check/jane-goodall-trump-quote/",
    "timestamp": "2025-10-07T21:30:00Z"
  },
  {
    "title": "Gold futures rise above $4,000 per ounce for the first time",
    "description": "Gold futures soared above $4,000 per troy ounce for the first time Tuesday, as many investors seek a safe place to park their money during the continuing U.S. government shutdown. The going price for New York spot gold had previously closed at $3,960.60 per t…",
    "link": "https://japantoday.com/category/business/gold-futures-rise-above-4-000-per-ounce-for-the-first-time",
    "timestamp": "2025-10-07T21:29:33Z"
  },
  {
    "title": "Pam Bondi Has A Full On Meltdown Over Simple Questions About Trump",
    "description": "The chairman of the Senate Judiciary Committee let the attorney general run all over lawmakers.",
    "link": "https://www.huffpost.com/entry/pam-bondi-hearing-senate-judiciary-committee_n_68e56d1ae4b05e212f21fb5e",
    "timestamp": "2025-10-07T21:26:40Z"
  },
  {
    "title": "Democrats in governors races see political opportunity amid government shutdown",
    "description": "Democrats say fallout from the Trump administration’s aggressive tactics on the government shutdown could give them a welcome boost in the only two governors’ races on the ballot this year",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-governors-races-political-opportunity-amid-government-shutdown-126309435",
    "timestamp": "2025-10-07T21:25:49Z"
  },
  {
    "title": "LDP chief Takaichi may skip Yasukuni shrine visit for autumn rite: sources",
    "description": "Sanae Takaichi, leader of the ruling Liberal Democratic Party, may skip a visit to Yasukuni shrine during its autumn festival later this month, sources close to her said Tuesday, as she comes under pressure to soften her conservative stance on diplomacy. Taka…",
    "link": "https://japantoday.com/category/politics/update2-ldp-chief-takaichi-may-skip-yasukuni-shrine-visit-for-autumn-rite-sources",
    "timestamp": "2025-10-07T21:25:36Z"
  },
  {
    "title": "Donald Trump, 79, Reveals Bulging Cankles While Hosting Canadian Prime Minister Mark Carney",
    "description": "The president also added a shiny layer of makeup to cover the bruise on his hand ahead of the Oval Office meeting.",
    "link": "https://www.thedailybeast.com/donald-trump-79-reveals-bulging-cankles-while-hosting-canadian-prime-minister-mark-carney/",
    "timestamp": "2025-10-07T21:25:09Z"
  },
  {
    "title": "Unearthed ICE documents highlight Trump administration’s social media surveillance plans",
    "description": "Plus, a mysterious group targets Gov. Wes Moore with racist AI videos, Trump seeks gratitude over TikTok, and more — all in this week’s Tuesday Tech Drop.",
    "link": "https://www.msnbc.com/top-stories/latest/ice-social-media-surveillance-trump-tiktok-wes-moore-rcna236017",
    "timestamp": "2025-10-07T21:22:52Z"
  },
  {
    "title": "“Not going to discuss anything about that”: Bondi dodges Epstein questions in Senate hearing",
    "description": "The attorney general spent Tuesday dodging questions from senators about her tenure at the DOJ.",
    "link": "https://www.salon.com/2025/10/07/not-going-to-discuss-anything-about-that-bondi-dodges-epstein-questions-in-senate-hearing/",
    "timestamp": "2025-10-07T21:22:02Z"
  },
  {
    "title": "France's Macron pressed to end political 'mess'",
    "description": "France's President Emmanuel Macron faced growing pressure on Tuesday to resign or hold a snap parliamentary election to end political chaos that has forced the resignation of five prime ministers in less than two years. The 47-year-old centrist president has …",
    "link": "https://japantoday.com/category/world/france%27s-macron-pressed-to-end-political-%27mess%271",
    "timestamp": "2025-10-07T21:21:53Z"
  },
  {
    "title": "Bondi dodges questions as she clashes with Democrats over claims she's weaponized Justice Department",
    "description": "Attorney General Pam Bondi repeatedly deflected questions as she sought during a combative congressional hearing on Tuesday to defend herself against growing criticism that she's turning the law enforcement agency into a weapon to seek vengeance against Presi…",
    "link": "https://japantoday.com/category/world/attorney-general-bondi-will-face-senate-questions-over-political-pressure-on-justice-department",
    "timestamp": "2025-10-07T21:21:47Z"
  },
  {
    "title": "Italian PM Meloni says she has been reported to ICC for complicity in genocide",
    "description": "Italian Prime Minister Giorgia Meloni said on Tuesday that she and two of her ministers had been reported to the International Criminal Court for alleged complicity in genocide in connection with Israel's offensive in Gaza. Speaking in an interview with state…",
    "link": "https://japantoday.com/category/world/italy%27s-meloni-says-she-has-been-denounced-to-icc-for-complicity-in-genocide1",
    "timestamp": "2025-10-07T21:21:30Z"
  },
  {
    "title": "Trump's threat to invoke Insurrection Act escalates showdown with Democratic cities",
    "description": "Donald Trump's threat to invoke a federal anti-insurrection law to deploy troops to more U.S. cities has intensified his legal battle with Democratic leaders over the limits of presidential authority, as hundreds of National Guard soldiers from Texas prepared…",
    "link": "https://japantoday.com/category/world/trump%27s-threat-to-invoke-insurrection-act-escalates-showdown-with-democratic-cities2",
    "timestamp": "2025-10-07T21:21:23Z"
  },
  {
    "title": "Newt Gingrich, Larry Kudlow Say Democrats ‘Engaged In Insurrection’ By Resisting Trump Admin Immigration Enforcement",
    "description": "Former Speaker Newt Gingrich and Larry Kudlow accused Democrats of \"insurrection\" over their opposition to Donald Trump's administration's immigration enforcement.",
    "link": "https://dailycaller.com/2025/10/07/newt-gingrich-larry-kudlow-democrats-engaged-in-insurrection-resisting-trump-admin/",
    "timestamp": "2025-10-07T21:21:11Z"
  },
  {
    "title": "CBS Deal Smells Like a Gimmick",
    "description": "An aspiring mogul finds yet another way to appease Donald Trump.",
    "link": "https://biztoc.com/x/6869844b6efe6169",
    "timestamp": "2025-10-07T21:19:06Z"
  },
  {
    "title": "Republicans Are Selling “Ethical IVF.” It’s a Scam.",
    "description": "RRM strategies seem tailor-made to create common ground between conservatives who identify as pronatalist.",
    "link": "https://slate.com/news-and-politics/2025/10/republicans-selling-ethical-ivf-scam.html",
    "timestamp": "2025-10-07T21:18:29Z"
  },
  {
    "title": "AIM-120 AMRAAM missiles to be sold to Nato allies, Taiwan, Pakistan, Israel. Should Russia, China, India and Iran be worried? Here's if US move will affect regional security",
    "description": "AIM-120 AMRAAM missiles are being sold by United States to NATO allies, Taiwan, Pakistan and Israel. Should Russia, China, India and Iran be worried? The deal includes advanced medium-range air-to-air missiles compatible with multiple fighter jets. The sales …",
    "link": "https://economictimes.indiatimes.com/news/international/us/aim-120-amraam-missiles-to-be-sold-to-nato-allies-taiwan-pakistan-israel-should-russia-china-india-and-iran-be-worried-heres-if-us-move-will-affect-regional-security-new-arms-contract-strategic-questions-advanced-missile-technology-regional-air-power-balances-and-impact-military-strategies-across-asia-europe-and-the-middle-east/articleshow/124371706.cms",
    "timestamp": "2025-10-07T21:18:18Z"
  },
  {
    "title": "Charlie Kirk Murder Case Update: Tyler Robinson Didn't Act Not Alone? Feds Turn Focus to Second Shooter",
    "description": "The FBI probes a 'shadowy conspiracy' behind Charlie Kirk's murder. Was alleged killer Tyler Robinson part of a wider plot? New evidence suggests a second shooter.",
    "link": "https://www.ibtimes.com/charlie-kirk-murder-case-update-tyler-robinson-didnt-act-not-alone-feds-turn-focus-second-3786083",
    "timestamp": "2025-10-07T21:17:46Z"
  },
  {
    "title": "Trump keeps threatening to use the Insurrection Act. What is it?",
    "description": "President Donald Trump suggested numerous times this week that he could invoke the sweeping presidential powers granted by the Insurrection Act \"if necessary.\"\"It's been invoked before,\" Trump told reporters Tuesday, adding, \"We want safe cities.\"",
    "link": "https://www.nbcnews.com/politics/trump-administration/insurrection-act-what-know-national-guard-deployment-protests-courts-rcna236162",
    "timestamp": "2025-10-07T21:17:10Z"
  },
  {
    "title": "Stock market rally takes a pause as gold prices top US$4,000 per ounce",
    "description": "TORONTO — Canada’s main stock index finished in negative territory, while U.S. markets also fell as gold prices reached new highs. Kevin Burkett, portfolio manager at Victoria-based Burkett Asset Management, said Tuesday’s trading session marked a “quiet day.…",
    "link": "https://financialpost.com/pmn/stock-market-rally-takes-a-pause-as-gold-prices-top-us4000-per-ounce",
    "timestamp": "2025-10-07T21:16:43Z"
  },
  {
    "title": "Trump promises trade fairness for Canada, noncommittal on USMCA deal",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump on Tuesday promised to treat Canada fairly in talks over painful U.S. tariffs on Canadian goods, but was...",
    "link": "https://www.yahoo.com/news/articles/trump-promises-trade-fairness-canada-211618168.html",
    "timestamp": "2025-10-07T21:16:18Z"
  },
  {
    "title": "J.Lo defends Bad Bunny after Trump and allies slam Super Bowl choice: \"He's the top artist in the world\"",
    "description": "Music superstar Jennifer Lopez has weighed in on the fiery controversy surrounding the NFL&apos;s selection of Bad Bunny as the next Super Bowl headliner, offering a passionate def",
    "link": "https://www.marca.com/en/nfl/super-bowl/2025/10/07/68e5813e46163f1a588b45ec.html",
    "timestamp": "2025-10-07T21:16:13Z"
  },
  {
    "title": "'It is just illegal!' Trump's new threat to government workers shredded by senator",
    "description": "Sen. Chris Coons (D-DE) shredded President Donald Trump's latest threat to government workers during an appearance on CNN on Tuesday. Coons joined CNN's Kasie Hunt on \"The Arena\" to discuss Trump's threat to not pay furloughed government workers back pay once…",
    "link": "https://www.rawstory.com/chris-coons-2674163502/",
    "timestamp": "2025-10-07T21:16:03Z"
  },
  {
    "title": "House Democrats Criticize Trump And Rubio For 'Pushing For Regime Change In Venezuela: 'The American People Don't Want Another War'",
    "description": "Democrats in the House Foreign Affairs committee criticized President Donald Trump and Secretary of State Marco Rubio for \"pushing for regime change in Venezuela\"",
    "link": "https://www.ibtimes.com/house-democrats-criticize-trump-rubio-pushing-regime-change-venezuela-american-people-dont-3786088",
    "timestamp": "2025-10-07T21:15:41Z"
  },
  {
    "title": "Trump Says He’s Never Heard of Bad Bunny: 'Ridiculous'",
    "description": "Trump reacted to the selection of Puerto Rican artist Bad Bunny as the 2026 Super Bowl halftime performer, dismissing the choice.",
    "link": "https://www.breitbart.com/entertainment/2025/10/07/trump-says-hes-never-heard-of-bad-bunny-calls-super-bowl-halftime-choice-absolutely-ridiculous/",
    "timestamp": "2025-10-07T21:13:30Z"
  },
  {
    "title": "Trump thanks group representing families of hostages for Nobel Peace Prize appeal",
    "description": "President Donald Trump thanked the Hostages and Missing Families Forum for its appeal to the Nobel committee to award the president the Nobel Peace Prize.",
    "link": "https://www.foxnews.com/world/trump-thanks-group-representing-families-hostages-nobel-peace-prize-appeal",
    "timestamp": "2025-10-07T21:13:29Z"
  },
  {
    "title": "Democrats Warn Trump’s Goal for “Illegal” War With Venezuela Is Regime Change",
    "description": "“The American people don’t want another war,” said the Democrats of the House Foreign Affairs Committee.",
    "link": "https://truthout.org/articles/democrats-warn-trumps-goal-for-illegal-war-with-venezuela-is-regime-change/",
    "timestamp": "2025-10-07T21:12:23Z"
  },
  {
    "title": "Schumer-Linked Group Reportedly Tells Democrats To Gear Up For Long-Term Shutdown",
    "description": "A PAC aligned with Senator Schumer is reportedly urging Democrats to hold firm in the shutdown, arguing that the Democrats are winning the political battle.",
    "link": "https://dailycaller.com/2025/10/07/schumer-linked-group-reportedly-tells-democrats-to-gear-up-for-long-term-shutdown/",
    "timestamp": "2025-10-07T21:11:02Z"
  },
  {
    "title": "Oklahoma college student says he was scolded by faculty after wearing Trump hat during Charlie Kirk tribute",
    "description": "Oklahoma State University defended free expression after student leader Josh Wilson was told his Turning Point USA hat could \"trigger\" others during a Charlie Kirk tribute speech.",
    "link": "https://www.foxnews.com/media/oklahoma-college-student-scolded-faculty-wearing-trump-hat-during-charlie-kirk-tribute",
    "timestamp": "2025-10-07T21:10:15Z"
  },
  {
    "title": "Trump's Pentagon nominee flags possible 'commonsense' changes to AUKUS",
    "description": "The AUKUS submarine pact may need \"commonsense\" action from both Australia and the US to make it more \"sustainable\", according to Donald Trump's nominee to oversee US defence strategy in the Indo-Pacific.",
    "link": "https://www.abc.net.au/news/2025-10-08/trump-pentagon-nominee-john-noh-questioned-on-aukus/105864552",
    "timestamp": "2025-10-07T21:09:38Z"
  },
  {
    "title": "Republicans See an Upset in Violent Texts From Virginia Democrat",
    "description": "Democrats were cruising in Virginia’s off-year elections. Now the GOP is looking to take advantage of horrific 2022 texts from Democratic attorney-general nominee Jay Jones to divide and conquer with Abigail Spanberger as the real target.",
    "link": "http://nymag.com/intelligencer/article/gop-sees-an-upset-in-violent-texts-from-virginia-democrat.html",
    "timestamp": "2025-10-07T21:09:32Z"
  },
  {
    "title": "'I'm not a slave!' Marjorie Taylor Greene condemns White House 'pressure' over Epstein",
    "description": "Rep. Marjorie Taylor Greene (R-GA) complained about \"unbelievable blowback and pressure from the White House\" on releasing files about Jeffrey Epstein, despite her support for President Donald Trump on controversial topics, such as the Jan. 6 riots.\"I've alwa…",
    "link": "https://www.rawstory.com/marjorie-taylor-greene-white-house/",
    "timestamp": "2025-10-07T21:08:03Z"
  },
  {
    "title": "Trump Says He Wants to Be 'Great Man' Like Canada's Carney",
    "description": "resident Donald Trump hailed his Canadian counterpart, Prime Minister Mark Carney, as a \"world-class leader\" Tuesday and quipped trade talks with Canada lag because he wants to be \"great,\" too.\nThe president said of Carney: \"He's a great prime minister. I mea…",
    "link": "https://biztoc.com/x/fd211f9f24a19ef1",
    "timestamp": "2025-10-07T21:07:57Z"
  },
  {
    "title": "Dems, Don't Fund the Destruction of US Democracy",
    "description": "It seemed kind of crazy when the hit movie Civil War came out in spring 2024 and the main storyline hinged on a war against the rest of the United States waged by the combined forces of Texas and California, our two most unalike big states in real life. But i…",
    "link": "https://www.inquirer.com/columnists/attytood/trump-national-guard-deployment-cities-democrats-stand-20251007.html",
    "timestamp": "2025-10-07T21:03:40Z"
  },
  {
    "title": "FBI Says Jack Smith Monitored Private Calls of Nearly a Dozen GOP Senators During Jan. 6 Probe",
    "description": "DAILY CALLER NEWS FOUNDATION—Former special counsel Jack Smith allegedly monitored the phone calls and personal messages of multiple Republican members of Congress during his probe... Read More\nThe post FBI Says Jack Smith Monitored Private Calls of Nearly a …",
    "link": "https://www.dailysignal.com/2025/10/07/fbi-says-jack-smith-monitored-private-calls-of-nearly-a-dozen-gop-senators-during-jan-6-probe/",
    "timestamp": "2025-10-07T21:03:31Z"
  },
  {
    "title": "Pope Leo Refuses to Answer When Asked About Trump Sending Troops to His Hometown of Chicago",
    "description": "Pope Leo XIV declined to comment when asked about President Trump sending National Guard troops to Chicago, saying he wants to avoid American politics\nThe post Pope Leo Refuses to Answer When Asked About Trump Sending Troops to His Hometown of Chicago first a…",
    "link": "https://www.mediaite.com/media/pope-leo-refuses-to-answer-when-asked-about-trump-sending-troops-to-his-hometown-of-chicago/",
    "timestamp": "2025-10-07T21:03:14Z"
  },
  {
    "title": "‘Finish What You Started’: Freed Gaza Hostages, Relatives Have High Hopes For Trump’s Peace Plan",
    "description": "Civilians kidnapped by Hamas on Oct. 7 and relatives of those in captivity expressed optimism for Trump's efforts toward a peace deal at the Kennedy Center.",
    "link": "https://dailycaller.com/2025/10/07/freed-gaza-hostages-relatives-praise-trump-peace-plan/",
    "timestamp": "2025-10-07T21:02:55Z"
  }
]