[
  {
    "title": "U.S. CISA adds Fortinet FortiOS/FortiProxy and GitHub Action flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Fortinet FortiOS/FortiProxy and GitHub Action flaws to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added the following vulnerab…",
    "link": "https://securityaffairs.com/175583/security/u-s-cisa-adds-fortinet-fortios-fortiproxy-and-github-action-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-03-19T06:15:47Z"
  },
  {
    "title": "US suspends some efforts to counter Russian sabotage as Trump moves closer to Putin",
    "description": "Several key U.S. national security agencies have paused their coordinated efforts to counter Russian sabotage, disinformation, and cyberattacks, reducing the pressure on Moscow. This shift coincides with the Trump administration's push for an improved relatio…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-suspends-some-efforts-to-counter-russian-sabotage-as-trump-moves-closer-to-putin/articleshow/119195751.cms",
    "timestamp": "2025-03-19T06:13:53Z"
  },
  {
    "title": "Fed to announce policy rates today. Here’s what to expect from FOMC meeting",
    "description": "The US Federal Reserve is expected to maintain the federal fund rate at 4.25%-4.5% amid inflation concerns. The Fed will release its Summary of Economic Projections, providing insights into expectations for GDP growth, unemployment, and inflation. Key sectors…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-to-announce-policy-rates-today-heres-what-to-expect-from-fomc-meeting/articleshow/119195686.cms",
    "timestamp": "2025-03-19T06:12:46Z"
  },
  {
    "title": "Russia-Ukraine War Ceasefire Talks Set For Sunday In Saudi Arabia: US",
    "description": "Talks on a ceasefire in Russia&#039;s war with Ukraine will continue on Sunday in the Saudi Arabian city of Jeddah, US President Donald Trump&#039;s special envoy Steve Witkoff said Tuesday.",
    "link": "https://www.ndtv.com/world-news/russia-ukraine-war-ceasefire-talks-set-for-sunday-in-saudi-arabia-jeddah-us-7957655",
    "timestamp": "2025-03-19T06:12:22Z"
  },
  {
    "title": "Donald Trump and Elon Musk won’t be able to go on ignoring the damage to the bottom line",
    "description": "The state of the US stock market is the only metric that matters to Trump, while Musk has done real harm to the Tesla brand",
    "link": "https://www.irishtimes.com/opinion/2025/03/19/donald-trump-and-elon-musk-wont-be-able-to-go-on-ignoring-the-damage-to-the-bottom-line/",
    "timestamp": "2025-03-19T06:00:08Z"
  },
  {
    "title": "Fani Willis’ $54K penalty exposes culture of secrecy and corruption in Trump prosecution",
    "description": "Fulton County District Attorney Fani Willis was ordered to pay $54,264 in attorneys’ fees and litigation costs for intentionally violating Georgia’s open records laws. The ruling by Judge Rachel Krause highlights a pattern of secrecy and hostility in Willis’ …",
    "link": "https://www.naturalnews.com/2025-03-19-willis-penalty-exposes-secrecy-corruption-trump-prosecution.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Nato’s fragile future",
    "description": "Since Nato’s inception in 1949, the US has always formed a central part of the alliance and been the biggest contributor to its defensive strength.However, since his second term began, President Donald Trump has shifted the US’s allegiances towards Vladimir P…",
    "link": "https://shows.acast.com/newstatesman/episodes/natos-fragile-future",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Government to establish National Security Council",
    "description": "Taoiseach to chair group comprising Cabinet Ministers, Garda and Defence Forces chiefs and senior officials",
    "link": "https://www.irishtimes.com/politics/2025/03/19/government-to-establish-national-security-council/",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Trump’s tariffs: A necessary shield for U.S. industry, but at what cost to allies like Australia?",
    "description": "The Trump administration’s 25% tariffs on steel and aluminium imports, including those from Australia, aim to protect U.S. industries but have sparked debates over their effects on international alliances. Australian Treasurer Jim Chalmers criticized the tari…",
    "link": "https://www.naturalnews.com/2025-03-19-trump-tariffs-necessary-shield-for-us-industry.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Putin and Trump agree to PARTIAL CEASEFIRE in Ukraine, but path to lasting peace remains uncertain",
    "description": "Russian President Vladimir Putin and U.S. President Donald Trump agreed to a 30-day limited ceasefire targeting energy infrastructure during a two-and-a-half-hour phone call. This marks a rare diplomatic engagement between the two nations amid the ongoing Ukr…",
    "link": "https://www.naturalnews.com/2025-03-19-putin-trump-agree-partial-ceasefire-in-ukraine.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Biden-appointed judge blocks Trumpâ\u0080\u0099s transgender military ban",
    "description": "U.S. District Judge Ana Reyes temporarily blocked Trump’s ban on transgender individuals serving in the military, citing potential constitutional violations. The ruling challenges Trump’s executive order, which cited concerns over military readiness, medical …",
    "link": "https://www.naturalnews.com/2025-03-19-biden-judge-blocks-transgender-military-ban.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Trump Administration Vows Crackdown on Anti-Tesla Attacks",
    "description": "Attacks on property carrying the logo of Elon Musk’s electric-car company are cropping up across the U.S. and overseas.",
    "link": "https://time.com/7269362/tesla-attacks-musk-protests-trump-administration-crackdown/",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "SpaceX capsule rescues stranded astronauts at the International Space Station",
    "description": "The SpaceX Dragon capsule successfully docked at the International Space Station (ISS) on March 13, retrieving NASA astronauts Sunita Williams and Butch Wilmore after an unexpected nine-month stay in space. Williams and Wilmore’s prolonged mission began due t…",
    "link": "https://www.naturalnews.com/2025-03-19-spacex-capsule-rescues-stranded-astronauts-at-iss.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Trump administration DEFIES federal judge, proceeds with deporting gang members",
    "description": "The Trump administration deported over 250 Venezuelan Tren de Aragua (TdA) and 23 MS-13 members to El Salvador under the Alien Enemies Act, despite a federal judge’s emergency order to halt the expulsions. U.S. District Judge James Boasberg issued an emergenc…",
    "link": "https://www.naturalnews.com/2025-03-19-trump-admin-proceeds-with-deporting-gang-members.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Trump admin seeking to deport Israel critic as a ‘foreign policy threat,’ not lawbreaker",
    "description": "The Trump administration is seeking to deport “anti-Semitic” pro-Palestine activist Mahmoud Khalil not because he broke any law but instead because his political activism poses a “national security risk” that threatens US “foreign policy.” (Article by Chris M…",
    "link": "https://www.naturalnews.com/2025-03-19-trump-admin-seeking-to-deport-israel-critic.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "SpaceX brings stranded astronauts home after nearly 10 months in space",
    "description": "NASA astronauts Butch Wilmore and Suni Williams returned to Earth after a 10-month mission, initially planned for one week, due to Boeing Starliner malfunctions. SpaceX’s Crew Dragon capsule safely brought the astronauts home, ending a rescue mission delayed …",
    "link": "https://www.naturalnews.com/2025-03-19-spacex-brings-home-stranded-astronauts-10-months-space.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "UNREDACTED TRUTH: Trump delivers on promise to release 80,000 pages of JFK assassination files",
    "description": "President Donald Trump fulfilled a campaign promise by releasing 80,000 pages of previously classified documents related to the 1963 assassination of President John F. Kennedy. The files, published without redactions, are now publicly accessible via the Natio…",
    "link": "https://www.naturalnews.com/2025-03-19-unredacted-truth-trump-to-release-jfk-assassination-files.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "Trump admin being pushed to DEANNEX Puerto Rico",
    "description": "A draft EO proposes transitioning Puerto Rico to independence over 21 months, ending birthright citizenship post-2026 and providing a $36 billion annual fund for 20 years. The move could save the U.S. $617.8 billion over 50 years compared to $1.37 trillion in…",
    "link": "https://www.naturalnews.com/2025-03-19-trump-admin-being-pushed-deannex-puerto-rico.html",
    "timestamp": "2025-03-19T06:00:00Z"
  },
  {
    "title": "The Script of Anxiety: Poland’s Nuclear Weapons Fascination",
    "description": "With the Ukraine War and the retreat of the United States from what has routinely been called Europe’s security architecture, states are galloping to whatever point of presumed sanctuary is on offer.  The general presumption is that the galloping is done in t…",
    "link": "https://www.counterpunch.org/2025/03/19/the-script-of-anxiety-polands-nuclear-weapons-fascination/",
    "timestamp": "2025-03-19T05:55:45Z"
  },
  {
    "title": "The Meaning Of Privacy",
    "description": "Structures of surveillance have their roots within the infrastructure of our commercial sector and government. This is not new, but the government’s audacity has grown monstrous with the recent example of Mahmoud Khalil and the blatant disregard for the most …",
    "link": "https://www.counterpunch.org/2025/03/19/the-meaning-of-privacy/",
    "timestamp": "2025-03-19T05:55:32Z"
  },
  {
    "title": "Oh, Canada, You’re Not the Enemy…That’s Coming From Within",
    "description": "Perhaps if you grow up in penthouse on top of a gilded tower in the middle of the predatory capitalist shark tank known as “New York City,” your world view is eternally corrupted by your pitiful life experience. Perhaps you think every human and nation on the…",
    "link": "https://www.counterpunch.org/2025/03/19/oh-canada-youre-not-the-enemy-thats-coming-from-within/",
    "timestamp": "2025-03-19T05:55:17Z"
  },
  {
    "title": "Eduardo Bolsonaro Flees Brazil",
    "description": "Brazilian Liberal Party lawmaker Eduardo Bolsonaro, son of indicted former President Jair Bolsonaro and South American representative for CPAC, took a leave of absence from Congress today and announced he will remain in the United States to escape “political …",
    "link": "https://www.counterpunch.org/2025/03/19/eduardo-bolsonaro-flees-brazil/",
    "timestamp": "2025-03-19T05:54:36Z"
  },
  {
    "title": "Trump administration makes public thousands of files related to JFK assassination",
    "description": "Unredacted files related to the 1963 assassination of President John F. Kennedy have been released. Shortly after he was sworn into office, President Donald Trump ordered the release of the remaining classified files related to the assassination, which has sp…",
    "link": "https://apnews.com/article/kennedy-assassination-documents-release-trump-c56ed5075b38af809f36a6388797d4ca",
    "timestamp": "2025-03-19T05:53:38Z"
  },
  {
    "title": "I Resigned Over the Bush War on Iraq … And Wish I Had More Resignations to Give!",
    "description": "22 years ago, on March 19, 2003, I resigned from the US Department of State. I was the Deputy chief of mission at the US Embassy in UlaanBaatar, Mongolia and the third U.S. government employee to resign in opposition to the U.S. war on Iraq. I resigned on the…",
    "link": "https://www.counterpunch.org/2025/03/19/i-resigned-over-the-bush-war-on-iraq-and-wish-i-had-more-resignations-to-give/",
    "timestamp": "2025-03-19T05:51:28Z"
  },
  {
    "title": "Global Chaos or Global Community?",
    "description": "Although the nations of the world have pledged to respect a system of international law and global responsibility, the recent behavior of several countries provides a sharp challenge to this arrangement. For over three years, the Russian government has conduc…",
    "link": "https://www.counterpunch.org/2025/03/19/global-chaos-or-global-community/",
    "timestamp": "2025-03-19T05:50:16Z"
  },
  {
    "title": "Fishermen say Trump's DOGE budget cuts are preventing them from adopting climate-friendly technology",
    "description": "Commercial fishermen and seafood processors and distributors seeking to convert to new, lower-carbon emission systems say they are finding federal funding they were counting on for the work is frozen or unavailable in the wake of sweeping budget cuts touted b…",
    "link": "https://www.clickondetroit.com/news/national/2025/03/19/fishermen-say-trumps-doge-budget-cuts-are-preventing-them-from-adopting-climate-friendly-technology/",
    "timestamp": "2025-03-19T05:47:11Z"
  },
  {
    "title": "Vanity Fair’s Heyday",
    "description": "Lavish budgets, high-society gossip, and headline-making journalism— Vanity Fair under Graydon Carter was the last great magazine empire. Bryan Burrough…",
    "link": "https://yalereview.org/article/burrough-vanity-fair-graydon-carter",
    "timestamp": "2025-03-19T05:47:02Z"
  },
  {
    "title": "I Resigned 22 Years Ago from the US Government Over the Bush War on Iraq …And Wish I Had More Resignations to Give!",
    "description": "22 years ago, on March 19, 2003, I resigned from the US Department of State. I was the Deputy chief of mission at the US Embassy in UlaanBaatar, Mongolia and the third U.S. government employee to resign in opposition to …\nThe post I Resigned 22 Years Ago from…",
    "link": "https://www.globalresearch.ca/resigned-us-government-bush-war-iraq/5882273",
    "timestamp": "2025-03-19T05:46:57Z"
  },
  {
    "title": "Will Canada and Mexico Seize the Opportunity to Break Free From U.S. Domination?",
    "description": "President Donald Trump’s threats against Canada and Mexico are providing both countries with unprecedented opportunities to free themselves from U.S. influence. By threatening to annex Canada, send troops into Mexico, and impose sweeping tariffs on both count…",
    "link": "https://www.counterpunch.org/2025/03/19/will-canada-and-mexico-seize-the-opportunity-to-break-free-from-u-s-domination/",
    "timestamp": "2025-03-19T05:45:29Z"
  },
  {
    "title": "Russia and Ukraine carry out attacks after Putin-Trump call",
    "description": "The attacks came hours after Vladimir Putin said Russia would stop targeting Ukrainian energy sites.",
    "link": "https://www.bbc.com/news/articles/cvgezypn3nzo",
    "timestamp": "2025-03-19T05:44:58Z"
  },
  {
    "title": "Bitcoin is just seeing a ‘normal correction,’ cycle peak is yet to come: Analysts",
    "description": "Bitcoin’s correction from its January peak is a typical cycle pullback and is not out of the ordinary, with a price top still on the horizon, crypto analysts and executives tell Cointelegraph.“I don’t think the bull run is over; I think the peak of the cycle …",
    "link": "https://cointelegraph.com/news/bitcoin-price-normal-correction-bull-cycle-peak-coming-crypto-analysts",
    "timestamp": "2025-03-19T05:43:53Z"
  },
  {
    "title": "\"Capsule Full Of Grins\": Sunita Williams' Fellow Astronaut After Splashdown",
    "description": "Home at last: After an unexpected nine-month stay in space, a pair of NASA astronauts finally returned to Earth on Tuesday, concluding a mission that captured global attention and became a political flashpoint.",
    "link": "https://www.ndtv.com/world-news/sunita-williams-fellow-astronaut-nick-hague-butch-willmore-after-spacex-dragona-spacex-crew-dragon-spaceship-carrying-butch-wilmore-and-sunita-william-7957455",
    "timestamp": "2025-03-19T05:43:29Z"
  },
  {
    "title": "U.S. chief justice rebukes Trump's impeachment call on judges",
    "description": "WASHINGTON, March 18 (Xinhua) -- U.S. Chief Justice John Roberts on Tuesday criticized President Don",
    "link": "http://en.people.cn/n3/2025/0319/c90000-20291302.html",
    "timestamp": "2025-03-19T05:40:39Z"
  },
  {
    "title": "Fishermen say Trump’s DOGE budget cuts are preventing them from adopting climate-friendly technology",
    "description": "BREMEN, Maine (AP) — Commercial fishermen and seafood processors and distributors looking to switch to new, lower-carbon emission systems say the federal funding they relied on for this work is either frozen or unavailable due to significant budget cuts promo…",
    "link": "https://financialpost.com/pmn/fishermen-say-trumps-doge-budget-cuts-are-preventing-them-from-adopting-climate-friendly-technology",
    "timestamp": "2025-03-19T05:38:42Z"
  },
  {
    "title": "Morning Bid: Central banks take the limelight, briefly",
    "description": "Investors' attention looks set to switch, briefly, to monetary policy for the rest of the week, from its usual recent fixation with trade and politics.  The ...",
    "link": "https://finance.yahoo.com/news/morning-bid-central-banks-limelight-053702333.html",
    "timestamp": "2025-03-19T05:37:02Z"
  },
  {
    "title": "Vedanta's Anil Agarwal advocates Donald Trump's ‘Drill Baby Drill’ slogan for India: ‘Desh ki zarooraton ke liye’",
    "description": "Anil Agarwal, founder of Vedanta Ltd, supports Trump's 'Drill Baby Drill' slogan, emphasizing its global recognition. He believes energy self-reliance in India can create jobs and reduce poverty, advocating for increased fossil fuel production and mineral sec…",
    "link": "https://www.livemint.com/companies/vedantas-anil-agarwal-advocates-donald-trumps-drill-baby-drill-slogan-for-india-desh-ki-zarooraton-ke-liye-11742355768419.html",
    "timestamp": "2025-03-19T05:35:40Z"
  },
  {
    "title": "Russia-Ukraine Trade Charges Of Attacks Hours After Trump-Putin Call",
    "description": "Ukraine President Volodymyr Zelensky had agreed to the US proposed 30-day ceasefire before the Donald Trump-Vladimir call.",
    "link": "https://www.ndtv.com/world-news/russia-ukraine-war-moscow-kyiv-trade-charges-of-attacks-hours-after-donald-trump-vladimir-putin-call-7957387",
    "timestamp": "2025-03-19T05:32:48Z"
  },
  {
    "title": "The ‘Unhinged’ AI Chatbot: How Elon Musk’s Grok Is Shaking Up Social Media",
    "description": "If you’ve spent any time on X (formerly Twitter) lately, chances are you’ve been flooded with the “let’s ask Grok” trend.",
    "link": "https://www.forbes.com/sites/anishasircar/2025/03/19/the-unhinged-ai-chatbot-how-elon-musks-grok-is-shaking-up-social-media/",
    "timestamp": "2025-03-19T05:29:15Z"
  },
  {
    "title": "Mahmoud Khalil Calls Himself \"Political Prisoner\" After US Arrest",
    "description": "Mahmoud Khalil, the Columbia University Palestinian graduate student who the Trump administration is seeking to deport for his role in pro-Palestinian protests, called himself a political prisoner on Tuesday, in his first direct comments since his de",
    "link": "https://www.ndtv.com/world-news/mahmoud-khalil-calls-himself-political-prisoner-after-us-arrest-over-protests-7957341",
    "timestamp": "2025-03-19T05:28:45Z"
  },
  {
    "title": "Jimmy Kimmel Is Annoyed by How Long the JKF Assassination Files Are:  ‘Gonna Take Me Forever to Read This to My Kids’ | Video",
    "description": "\"There are 80,000 pages of files,\" the ABC host jokes, \"that’s almost 20 times longer than the entire Harry Potter book series\nThe post Jimmy Kimmel Is Annoyed by How Long the JKF Assassination Files Are:  ‘Gonna Take Me Forever to Read This to My Kids’ | Vid…",
    "link": "https://www.thewrap.com/jimmy-kimmel-jfk-assassination-files-too-long-monologue/",
    "timestamp": "2025-03-19T05:28:13Z"
  },
  {
    "title": "Relationship of PM Modi, President Putin \"may be helpful\" for talks, says Polish Deputy Foreign Minister",
    "description": "Poland's Deputy Foreign Minister indicates PM Modi's relationship with President Putin may aid in negotiating the Russia-Ukraine war's end. He emphasizes President Trump's significant influence on Putin. Bartoszewski also condemns Israel's airstrikes on Gaza,…",
    "link": "https://economictimes.indiatimes.com/news/india/relationship-of-pm-modi-president-putin-may-be-helpful-for-talks-says-polish-deputy-foreign-minister/articleshow/119192839.cms",
    "timestamp": "2025-03-19T05:24:43Z"
  },
  {
    "title": "JFK assassination files released, sending history buffs hunting for new clues",
    "description": "Unredacted documents related to the 1963 assassination of President John F. Kennedy have been released following an order by President Donald Trump shortly after he took office. The documents were posted on the website of the U.S. National Archives and…",
    "link": "https://apnews.com/article/jfk-assassination-files-release-trump-3e8f31e18468d96b53210572e0992c07",
    "timestamp": "2025-03-19T05:23:00Z"
  },
  {
    "title": "Badlands nightclub in Midtown Sacramento bans MAGA-related attire",
    "description": "\"I've never worn a red Trump hat to the gay bars before. I said, What the heck? Let's see what happens.\"",
    "link": "https://www.kcra.com/article/badlands-midtown-sacramento-bans-maga-attire/64225779",
    "timestamp": "2025-03-19T05:21:27Z"
  },
  {
    "title": "Rep. Mike Flood of Nebraska is the latest GOP member of Congress to face angry crowds back home",
    "description": "U.S. Rep. Mike Flood of Nebraska appeared at a town hall in eastern Nebraska on Tuesday to hear from constituents",
    "link": "https://abcnews.go.com/Politics/wireStory/rep-mike-flood-nebraska-latest-gop-member-congress-119936637",
    "timestamp": "2025-03-19T05:18:15Z"
  },
  {
    "title": "Dropkick Murphys frontman says band quit Elon Musk's X in 2022",
    "description": "Dropkick Murphys frontman Ken Casey says the band quit X in 2022, when Elon Musk 'was only half a Nazi.' Reports that the punk band was banned have been greatly exaggerated, he says.",
    "link": "https://ew.com/dropkick-murphys-frontman-says-band-quit-x-in-2022-11699557",
    "timestamp": "2025-03-19T05:16:05Z"
  },
  {
    "title": "CBS' '60 Minutes' is unflinching in its White House coverage in the shadow of Trump's $20B lawsuit",
    "description": "As CBS' parent company considers settlement of President Donald Trump's lawsuit against “60 Minutes,” America’s storied newsmagazine is pulling no punches in its coverage of the new administration",
    "link": "https://abcnews.go.com/Entertainment/wireStory/cbs-60-minutes-unflinching-white-house-coverage-shadow-119936448",
    "timestamp": "2025-03-19T05:10:24Z"
  },
  {
    "title": "Putin agrees to 30-day pause on energy facility strikes, but no full Ukraine ceasefire",
    "description": "The US and Russia have agreed to a ceasefire on Russia-Ukraine energy infrastructure, with further negotiations set to begin immediately, according to the White House, though Russia has not accepted the US-proposed 30-day truce despite Ukraine's willingness.",
    "link": "https://www.euractiv.com/section/politics/news/putin-agrees-to-30-day-pause-on-energy-facility-strikes-but-no-full-ukraine-ceasefire/",
    "timestamp": "2025-03-19T05:09:47Z"
  },
  {
    "title": "Cathie Wood says people are going to learn the hard way that meme coins are the worst",
    "description": "Ark Invest's Cathie Wood, who has been bullish about cryptocurrencies like bitcoin, said her private funds are not investing in meme coins.\nJoe Raedle via Getty Images\nCathie Wood said most meme coins \"are not going to be worth very much.\"\nPresident Donald Tr…",
    "link": "https://biztoc.com/x/2d0fd057aa628988",
    "timestamp": "2025-03-19T05:09:20Z"
  },
  {
    "title": "Vancouver International Auto Show removes Tesla, citing safety concerns at event",
    "description": "Tesla has been removed from participating in this week’s Vancouver International Auto Show over safety concerns, the event’s executive director said Tuesday.  Eric Nicholl said in a statement that the show asked the electric carmaker to withdraw because of a …",
    "link": "https://japantoday.com/category/world/vancouver-international-auto-show-removes-tesla-citing-safety-concerns-at-event",
    "timestamp": "2025-03-19T05:05:27Z"
  },
  {
    "title": "Cathie Wood says people are going to learn the hard way that meme coins are the worst",
    "description": "Wood, who has been bullish about cryptocurrencies like bitcoin, said her private funds are not investing in meme coins.",
    "link": "https://www.businessinsider.com/cathie-wood-people-buying-meme-coins-learn-a-hard-lesson-2025-3",
    "timestamp": "2025-03-19T05:04:25Z"
  },
  {
    "title": "Japan's exports surge in February, leaving a trade surplus",
    "description": "Japan has reported its exports grew at an 11% annual pace in February while imports declined slightly, leaving a surplus after two straight months of deficits as worries grow about President Donald Trump’s tariff hikes",
    "link": "https://abcnews.go.com/Business/wireStory/japans-exports-surge-february-leaving-trade-surplus-worries-119936641",
    "timestamp": "2025-03-19T05:03:24Z"
  },
  {
    "title": "Ubisoft faces make-or-break moment with 'Assassin's Creed Shadows'",
    "description": "Ubisoft is banking on the success of \"Assassin's Creed Shadows\" to fight its way out of financial troubles as the French videogame publisher grapples with falling revenue, a sinking stock price and takeover speculation.The title, which will be launched on Thu…",
    "link": "https://www.channelnewsasia.com/business/ubisoft-faces-make-or-break-moment-assassins-creed-shadows-5009991",
    "timestamp": "2025-03-19T05:03:03Z"
  },
  {
    "title": "The Art of the Bogus Peace Deal",
    "description": "Trump-Putin phone call creates confusion, not goodwill.",
    "link": "https://www.thebulwark.com/p/the-art-of-the-bogus-peace-deal-trump-putin-phone-call-ceasefire-ukraine-zelensky",
    "timestamp": "2025-03-19T05:00:00Z"
  },
  {
    "title": "'One of the nastiest countries to deal with': Donald Trump slams Canada amid tariff war",
    "description": "\"One of the nastiest countries to deal with is Canada. Now, this was Trudeau — good old Justin. I call him 'Governor Trudeau.' His people were nasty and they weren't telling the truth,\" the Republican leader told Fox News host Laura Ingraham during an intervi…",
    "link": "https://freerepublic.com/focus/f-news/4305234/posts",
    "timestamp": "2025-03-19T04:57:30Z"
  },
  {
    "title": "Majority control of Pennsylvania House hinges on special election in steel region near Pittsburgh",
    "description": "Voters in a western Pennsylvania state House district will be filling a vacancy next week and deciding which party will hold the speakership",
    "link": "https://abcnews.go.com/Politics/wireStory/majority-control-pennsylvania-house-hinges-special-election-steel-119936348",
    "timestamp": "2025-03-19T04:54:15Z"
  },
  {
    "title": "Here's what to know about the Kennedy files, past and present",
    "description": "<p>NEW YORK &mdash; United States President Donald Trump has long obsessed over the assassination of President John F. Kennedy and tried, during his first administration, to fully release all government documents related to his death in 1963 and subsequent in…",
    "link": "https://www.bangkokpost.com/world/2983200/heres-what-to-know-about-the-kennedy-files-past-and-present",
    "timestamp": "2025-03-19T04:54:00Z"
  },
  {
    "title": "Have markets bottomed out? Dipan Mehta weighs in on the road ahead",
    "description": "​In fact, investors can have 70-80% of their portfolio within these four sectors and that can, I would say, high degree of them outperforming the broader indices or some of the other benchmarks.",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/have-markets-bottomed-out-dipan-mehta-weighs-in-on-the-road-ahead/articleshow/119191765.cms",
    "timestamp": "2025-03-19T04:53:31Z"
  },
  {
    "title": "Google agrees to pay $28m over racial bias case",
    "description": "The settlement with thousands of people who have worked at the tech giant has received preliminary approval.",
    "link": "https://www.bbc.com/news/articles/c39v2ykwgdno?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-03-19T04:50:24Z"
  },
  {
    "title": "Google agrees to pay $28m over racial bias case",
    "description": "The settlement with thousands of people who have worked at the tech giant has received preliminary approval.",
    "link": "https://www.bbc.com/news/articles/c39v2ykwgdno",
    "timestamp": "2025-03-19T04:50:20Z"
  },
  {
    "title": "Trump to Approve LNG Exports From Venture Global’s CP2 Project",
    "description": "The Trump administration is prepared to give Venture Global LNG Inc. conditional approval to export natural gas from a planned facility in Louisiana that had stalled under former President Joe Biden.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-to-approve-lng-exports-from-venture-globals-cp2-project",
    "timestamp": "2025-03-19T04:50:05Z"
  },
  {
    "title": "Economists keep Singapore’s 2025 economic growth forecast steady at 2.6%: MAS survey",
    "description": "Geopolitical tensions, including from higher tariffs, seen as the biggest downside risk. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economists-keep-singapores-2025-economic-growth-forecast-steady-at-2-6-mas-survey",
    "timestamp": "2025-03-19T04:48:44Z"
  },
  {
    "title": "Crude oil futures fall as Russia, Ukraine temporarily halt attacks on energy infra",
    "description": "Crude oil futures drop as Russia agrees to halt attacks on Ukraine's energy infrastructure, impacting global market and prices.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-oil-futures-fall-as-russia-ukraine-temporarily-halt-attacks-on-energy-infra/article69347401.ece",
    "timestamp": "2025-03-19T04:47:44Z"
  },
  {
    "title": "Decision Day Guide: Powell’s remarks to be scrutinized as Fed set to hold rates steady",
    "description": "The Federal Reserve is expected to hold interest rates steady on Wednesday, assessing the impact of Trump’s trade policies on an economy facing inflationary pressures and growth concerns. New tariffs and retaliatory actions have dented consumer sentiment, inc…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/decision-day-guide-powells-remarks-to-be-scrutinized-as-fed-set-to-hold-rates-steady/articleshow/119191724.cms",
    "timestamp": "2025-03-19T04:47:30Z"
  },
  {
    "title": "Vancouver International Auto Show removes Tesla, citing safety concerns at event",
    "description": "Tesla has been removed from participating in this week’s Vancouver International Auto Show over safety concerns.",
    "link": "https://www.wsls.com/business/2025/03/19/vancouver-international-auto-show-removes-tesla-citing-safety-concerns-at-event/",
    "timestamp": "2025-03-19T04:46:09Z"
  },
  {
    "title": "Google's $32 billion deal for Israeli cybersecurity firm Wiz accelerated under Trump, sources say",
    "description": "Google sweetened its original offer for $23 billion in July to $32 billion, making it one of the largest tech deals ever",
    "link": "https://www.thehindubusinessline.com/info-tech/googles-32-billion-deal-for-israeli-cybersecurity-firm-wiz-accelerated-under-trump-sources-say/article69347381.ece",
    "timestamp": "2025-03-19T04:43:30Z"
  },
  {
    "title": "Jackie Robinson article on MLB legend's Army history removed from Department of Defense website",
    "description": "President Donald Trump announced last month that Jackie Robinson would be added to his planned National Garden of American Heroes.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c74270d9-5055-41da-b241-1ddb23b92e26",
    "timestamp": "2025-03-19T04:41:50Z"
  },
  {
    "title": "JFK assassination Photos, November 30, 1963–September 24, 1964 - Ruby shooting Oswald",
    "description": "This series consists of photographs. The photographs show scenes at the Texas School Book Depository building, in the Dallas Police Department building the night after the assassination of President John F. Kennedy, in the basement of the Police Department bu…",
    "link": "https://freerepublic.com/focus/f-news/4305233/posts",
    "timestamp": "2025-03-19T04:39:39Z"
  },
  {
    "title": "Trump, UAE national security advisor talk cooperation",
    "description": "United States President Donald Trump hosted United Arab Emirates (UAE) National Security Advisor Sheikh Tahnoon bin Zayed Al Nahyan (pictured right) at the White House to discuss security, economic gr...",
    "link": "https://biztoc.com/x/6ca95f3a2cd1224c",
    "timestamp": "2025-03-19T04:36:24Z"
  },
  {
    "title": "Our prayers have been answered: R Madhavan celebrates Sunita Williams' safe return to Earth after historic space mission",
    "description": "Actor R Madhavan expressed his excitement on Instagram after astronaut Sunita Williams safely returned to Earth following a 260-day space mission. Indian Defence Minister Rajnath Singh and the White House also praised the mission's success. Elon Musk thanked …",
    "link": "https://economictimes.indiatimes.com/news/india/our-prayers-have-been-answered-r-madhavan-celebrates-sunita-williams-safe-return-to-earth-after-historic-space-mission/articleshow/119191138.cms",
    "timestamp": "2025-03-19T04:33:04Z"
  },
  {
    "title": "Trump to Approve LNG Exports From Venture Global’s CP2 Project",
    "description": "(Bloomberg) -- The Trump administration is prepared to give Venture Global LNG Inc. conditional approval to export natural gas from a planned facility in...",
    "link": "https://finance.yahoo.com/news/trump-approve-lng-exports-venture-042943175.html",
    "timestamp": "2025-03-19T04:29:43Z"
  },
  {
    "title": "Violent attacks on Tesla dealerships spike as Musk takes prominent role in Trump White House",
    "description": "Attacks on property carrying the logo of Elon Musk’s electric-car company are cropping up from coast to coast and even overseas.",
    "link": "https://www.clickondetroit.com/news/politics/2025/03/19/violent-attacks-on-tesla-dealerships-spike-as-musk-takes-prominent-role-in-trump-white-house/",
    "timestamp": "2025-03-19T04:28:35Z"
  },
  {
    "title": "'My God': Jordan Klepper Calls Out Trump White House's 'Bulls**t' Deportation Claim",
    "description": "The \"Daily Show\" host clowned Trump for triggering a \"constitutional crisis\" by continuing to fly immigrants out of the U.S. despite a judge's order.",
    "link": "https://www.huffpost.com/entry/jordan-klepper-daily-show-trump-deportations-el-salvador_n_67da3695e4b0e39674879055",
    "timestamp": "2025-03-19T04:27:20Z"
  },
  {
    "title": "Trump releases thousands of files on JFK assassination",
    "description": "Unredacted files related to the 1963 assassination of former US President John F. Kennedy were released on Tuesday. Conspiracy theories still swirl around his death.",
    "link": "https://www.dw.com/en/trump-releases-thousands-of-files-on-jfk-assassination/a-71967737",
    "timestamp": "2025-03-19T04:24:00Z"
  },
  {
    "title": "Associated Press removes story wrongly claiming Tulsi Gabbard said Trump, Putin are ‘very good friends’",
    "description": "The outlet published an updated piece reflecting Gabbard saying that Modi and Trump were good friends, including an editor's note at the end acknowledging the AP deleted the original article that contained \"erroneous reporting.\"",
    "link": "https://nypost.com/2025/03/19/media/associated-press-removes-story-wrongly-claiming-tulsi-gabbard-said-trump-putin-are-very-good-friends/",
    "timestamp": "2025-03-19T04:23:34Z"
  },
  {
    "title": "Tariff Threats Spur TSMC’s Taiwan Peers to Seek US Expansion",
    "description": "In March, President Donald Trump and Taiwan Semiconductor Manufacturing Co.’s C. C. Wei walked into the Roosevelt Room to unveil one of the largest foreign investments in US history: a $100 billion bet that high-end chips can be made, once again, in the US. F…",
    "link": "https://financialpost.com/pmn/business-pmn/tariff-threats-spur-tsmcs-taiwan-peers-to-seek-us-expansion",
    "timestamp": "2025-03-19T04:19:34Z"
  },
  {
    "title": "Judge blocks Trump administration from terminating $14 billion in 'green bank' grants",
    "description": "A federal judge has blocked the Trump administration from terminating $14 billion in grants awarded to three climate groups by the Biden administration",
    "link": "https://abcnews.go.com/Business/wireStory/judge-blocks-trump-administration-terminating-14-billion-green-119933244",
    "timestamp": "2025-03-19T04:14:20Z"
  },
  {
    "title": "Violent attacks on Tesla dealerships spike as Musk takes prominent role in Trump White House",
    "description": "Attacks on property carrying the logo of Elon Musk’s electric-car company are cropping up from coast to coast and even overseas",
    "link": "https://abcnews.go.com/Business/wireStory/violent-attacks-tesla-dealerships-spike-musk-takes-prominent-119935893",
    "timestamp": "2025-03-19T04:14:19Z"
  },
  {
    "title": "Violent attacks on Tesla dealerships spike as Musk takes prominent role in Trump White House",
    "description": "Attacks on property carrying the logo of Elon Musk’s electric-car company are cropping up from coast to coast and even overseas",
    "link": "https://abcnews.go.com/Politics/wireStory/violent-attacks-tesla-dealerships-spike-musk-takes-prominent-119935892",
    "timestamp": "2025-03-19T04:14:18Z"
  },
  {
    "title": "Putin made Trump wait, then strung him along – it’s clear his war aims in Ukraine have not changed",
    "description": "Vladimir Putin and Donald Trump agreed on a very limited ceasefire in Ukraine, making clear the Russian leader has no real ambition to stop the fighting.",
    "link": "https://theconversation.com/putin-made-trump-wait-then-strung-him-along-its-clear-his-war-aims-in-ukraine-have-not-changed-252497",
    "timestamp": "2025-03-19T04:13:32Z"
  },
  {
    "title": "Zelenskyy accuses Russia of rejecting ceasefire as fresh strikes hit Ukraine",
    "description": "KYIV: Ukraine on Wednesday (Mar 19) accused Russia of effectively rejecting a United States-backed ceasefire proposal, reporting a barrage of strikes on civilian infrastructure hours after Moscow agreed only to",
    "link": "https://www.channelnewsasia.com/world/ukraine-zelenskyy-accuses-russia-reject-ceasefire-putin-trump-us-5009901",
    "timestamp": "2025-03-19T04:11:46Z"
  },
  {
    "title": "Trump administration releases thousands of files on JFK assassination",
    "description": "Scholars and historians are likely to spend months sifting through records for answers about US president's killing.",
    "link": "https://www.aljazeera.com/news/2025/3/19/trump-administration-releases-thousands-of-files-on-jfk-assassination",
    "timestamp": "2025-03-19T04:09:35Z"
  },
  {
    "title": "Oracle's role in TikTok's future gets Capitol Hill scrutiny",
    "description": "TikTok is facing yet another political scramble over its future. In January, President Donald Trump delayed enforcement of the law that would ban TikTok from the United States, which passed Congress with bipartisan support and was upheld unanimously by the Su…",
    "link": "https://economictimes.indiatimes.com/tech/technology/oracles-role-in-tiktoks-future-gets-capitol-hill-scrutiny/articleshow/119190141.cms",
    "timestamp": "2025-03-19T04:08:22Z"
  },
  {
    "title": "Japan auto lobby says US tariffs may lead to production adjustments among firms",
    "description": "TOKYO : The chief of Japan's auto lobby warned on Wednesday that the potential April 2 start of tariffs proposed by U.S. President Donald Trump could mean that automakers and suppliers may have to make significant adjustments to their production schedules.\"Fo…",
    "link": "https://www.channelnewsasia.com/business/japan-auto-lobby-says-us-tariffs-may-lead-production-adjustments-among-firms-5009916",
    "timestamp": "2025-03-19T04:07:29Z"
  },
  {
    "title": "Smiles, Thumbs Ups And A Safe Return For 'Stranded' NASA Astronauts",
    "description": "Ground teams erupted in cheers as the gumdrop-shaped spacecraft named Freedom, charred from withstanding scorching temperatures of 3,500 degrees Fahrenheit (2,000 degrees Celsius) during re-entry, bobbed steadily on the waves beneath a clear, sunny sky.",
    "link": "https://www.ibtimes.com/smiles-thumbs-ups-safe-return-stranded-nasa-astronauts-3766795",
    "timestamp": "2025-03-19T04:07:22Z"
  },
  {
    "title": "Megyn Kelly Says Judge Who ‘Thinks He’s President’ Is Pushing US Toward Constitutional Crisis",
    "description": "Megyn Kelly said Judge James E. Boasberg is bringing the country closer to a \"constitutional crisis\" over his battle to stop from deporting migrants.",
    "link": "https://dailycaller.com/2025/03/19/megyn-kelly-judge-boasberg-constitutional-crisis-deportations-donald-trump/",
    "timestamp": "2025-03-19T04:06:57Z"
  },
  {
    "title": "The New Age Militarists – And their Threat to our Common Future",
    "description": "( Tomdispatch.com ) - Alex Karp, the CEO of the controversial military tech firm Palantir, is the coauthor of a new book, The Technological Republic: Hard Power, Soft Belief, and the Future of the West. In it, he calls for a renewed sense of national purpose …",
    "link": "https://www.juancole.com/2025/03/militarists-threat-common.html",
    "timestamp": "2025-03-19T04:06:09Z"
  },
  {
    "title": "Trump’s Big Wagers",
    "description": "The president is moving with far more purpose than in his first term. Will it pay off?\nThe post Trump’s Big Wagers appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trumps-big-wagers/",
    "timestamp": "2025-03-19T04:05:00Z"
  },
  {
    "title": "Mahmoud Khalil, Viewed From the Right",
    "description": "MAGA should oppose the arrest and deportation of the pro-Palestinian activist.\nThe post Mahmoud Khalil, Viewed From the Right appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/mahmoud-khalil-viewed-from-the-right/",
    "timestamp": "2025-03-19T04:03:00Z"
  }
]