[
  {
    "title": "Pete Hegseth Is Playing Secretary",
    "description": "As Pete Hegseth sends Marines into L.A. and prepares for possible war with Iran, his Pentagon is beset by infighting over leaks, drugs, and socks. How long will Trump stand by his man?",
    "link": "http://nymag.com/intelligencer/article/defense-secretary-pete-hegseth-pentagon-leaks-signalgate-trump.html",
    "timestamp": "2025-06-13T12:55:41Z"
  },
  {
    "title": "Global calls to avoid escalation pour in after Israeli strikes on Iran",
    "description": "World powers respond to rising Middle East tensions as Israel strikes Iranian sites. The U.S. insists it was not involved in strikes, and the much of the globe urges restraint.",
    "link": "https://www.foxnews.com/world/global-calls-avoid-escalation-pour-after-israeli-strikes-iran",
    "timestamp": "2025-06-13T12:55:30Z"
  },
  {
    "title": "Trump Breaks Silence After Israel Bombs Iran",
    "description": "President Donald Trump broke his silence after Israel bombed Iran on Thursday night, talking to Fox News and then releasing several Truth Social statements.",
    "link": "https://dailycaller.com/2025/06/13/donald-trump-israel-strikes-bombs-iran-statement-nuclear-deal/",
    "timestamp": "2025-06-13T12:55:23Z"
  },
  {
    "title": "Trump urges Iran to ‘make a deal’ as Tehran vows response to Israel attacks",
    "description": "Iran’s Supreme Leader Ayatollah Ali Khamenei has warned Israel that it 'must expect severe punishment'.",
    "link": "https://www.aljazeera.com/news/2025/6/13/trump-urges-iran-to-make-a-deal-as-tehran-vows-response-to-israel-attacks",
    "timestamp": "2025-06-13T12:54:17Z"
  },
  {
    "title": "Why Donald Trump soured on some of his own judges",
    "description": "Leonard Leo speaks at the National Catholic Prayer Breakfast in Washington, DC, on April 23, 2019. | ﻿Michael Robinson Chavez/The Washington Post via Getty Images\nLate last month, approximately 1 billion news cycles ago, an obscure federal court made Presiden…",
    "link": "https://biztoc.com/x/d50e4260eed863a0",
    "timestamp": "2025-06-13T12:53:16Z"
  },
  {
    "title": "What drove the tech right’s — and Elon Musk’s — big, failed bet on Trump",
    "description": "I live and work in the San Francisco Bay Area, and I don’t know anyone who says they voted for Donald Trump in 2016 or 2020. I know, on the other hand, quite a few who voted for him in 2024, and quite a few more who — while they didn’t vote for Trump because …",
    "link": "https://www.vox.com/future-perfect/416642/elon-musk-donald-trump-tech-right-democrats",
    "timestamp": "2025-06-13T12:52:56Z"
  },
  {
    "title": "Why Donald Trump soured on some of his own judges",
    "description": "Late last month, approximately 1 billion news cycles ago, an obscure federal court made President Donald Trump very, very mad. The US Court of International Trade ruled unanimously on May 28 that the massive tariffs Trump imposed after taking office again are…",
    "link": "https://www.vox.com/today-explained-podcast/416461/donald-trump-tariffs-judges-federalist-society",
    "timestamp": "2025-06-13T12:52:03Z"
  },
  {
    "title": "Trump tells ABC Israel strikes on Iran 'excellent' and warns 'more to come'",
    "description": "Trump tells ABC Israel strikes on Iran 'excellent' and warns 'more to come'go.com",
    "link": "https://abcnews.go.com/Politics/trump-tells-abc-israel-strikes-iran-excellent-warns/story?id=122807155",
    "timestamp": "2025-06-13T12:52:00Z"
  },
  {
    "title": "Trump tells Iran to make a deal ‘before there is nothing left’",
    "description": "President responds to Israel's strikes on rogue regime's nuclear program",
    "link": "https://www.wnd.com/2025/06/trump-tells-iran-to-make-a-deal-before-there-is-nothing-left/",
    "timestamp": "2025-06-13T12:51:33Z"
  },
  {
    "title": "I gave Iran chance after chance – Trump",
    "description": "Despite the Israeli strikes, the US president has urged Tehran to comply with Washington’s demands “before it is too late” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619171-trump-gave-iran-chance-post-israeli-strikes/",
    "timestamp": "2025-06-13T12:49:27Z"
  },
  {
    "title": "Senate GOP Strips Provision From Tax Bill That Would Let Trump Rule As A King",
    "description": "They removed jarring language from the House GOP's \"big, beautiful bill\" that would have limited the ability of courts to enforce contempt orders.",
    "link": "https://www.huffpost.com/entry/senate-republicans-big-beautiful-bill-contempt-courts-trump_n_684b9b3be4b0c4fd78ff7f2e",
    "timestamp": "2025-06-13T12:47:51Z"
  },
  {
    "title": "Dem Rep. McIver: ‘Republicans Have Sold their Soul for Donald Trump’",
    "description": "Recently indicted Rep. LaMonica McIver (D-NJ) claimed Thursday on MSNBC’s “The Weeknight” that “Republicans have sold their soul for Donald Trump.” Discussing Sen. Alex Padilla (D-CA) being forcibly removed from a press conference, McIver said, “It was disgra…",
    "link": "https://freerepublic.com/focus/f-news/4322802/posts",
    "timestamp": "2025-06-13T12:46:56Z"
  },
  {
    "title": "Oil prices surge, stocks tumble in the wake of Israel's strikes on Iran",
    "description": "Oil prices surged and stocks tumbled Friday in the wake of Israel's strikes on Iran's top military officials and nuclear sites.U.S.",
    "link": "https://www.nbcnews.com/business/markets/oil-prices-surge-stocks-tumble-wake-israels-strikes-iran-rcna212805",
    "timestamp": "2025-06-13T12:46:35Z"
  },
  {
    "title": "Texas' Largest Newspaper Trashes Greg Abbott Protest Move: 'Expect Better'",
    "description": "Anti-Trump protests are expected across Texas on Saturday as part of the \"No Kings\" movement.",
    "link": "https://www.newsweek.com/texas-largest-newspaper-trashes-greg-abbott-protest-move-expect-better-2085043",
    "timestamp": "2025-06-13T12:44:17Z"
  },
  {
    "title": "Trump, Netanyahu likely to speak later today",
    "description": "United States President Donald Trump and Israeli Prime Minister Benjamin Netanyahu are scheduled to have a telephone conversation later today, CNN reported on Friday, citing an Israeli source.Their ca...",
    "link": "https://biztoc.com/x/d8fd988cfbd352e1",
    "timestamp": "2025-06-13T12:42:41Z"
  },
  {
    "title": "Hailing Israel's 'excellent' strikes on Iran, Trump says 'there's a lot more to come'.",
    "description": "U.S. President Donald Trump on Friday gave a fulsome endorsement of Israel's strikes against Iran's nuclear and military targets, saying that there was \"much more to come\" if Iran fails to give up its uranium enrichment program.",
    "link": "https://freerepublic.com/focus/f-news/4322800/posts",
    "timestamp": "2025-06-13T12:42:23Z"
  },
  {
    "title": "Judge Bars Trump's National Guard from Stopping LA Riots",
    "description": "A federal judge ruled on Thursday that President Donald Trump improperly deployed the National Guard to disperse the Los Angeles riots.",
    "link": "https://www.westernjournal.com/judge-bars-trumps-national-guard-stopping-la-riots/",
    "timestamp": "2025-06-13T12:41:46Z"
  },
  {
    "title": "Israel strikes Iran, killing 3 commanders; Trump urges Tehran to 'make a deal' (Washington Post)",
    "description": "Washington Post:\nIsrael strikes Iran, killing 3 commanders; Trump urges Tehran to ‘make a deal’  —  Israel strikes Iran; explosions rock Tehran  —  President Donald Trump urged Iran to “make a deal” with Israel “before it is too late,” after Israel launched w…",
    "link": "https://www.memeorandum.com/250613/p25",
    "timestamp": "2025-06-13T12:40:02Z"
  },
  {
    "title": "AB Hernandez: Trans teen athlete at centre of Trump’s row with California speaks out",
    "description": "Trans teen athlete AB Hernandez has spoken out about the national furore over her participation at her high school’s track and field events.  Hernandez, who has reportedly been on her high school’s track team for three years, has been the focus of several pro…",
    "link": "https://www.thepinknews.com/2025/06/13/ab-hernandez-trans-teen-athlete-at-centre-of-trumps-row-with-california-speaks-out/",
    "timestamp": "2025-06-13T12:39:50Z"
  },
  {
    "title": "Republican enthusiasm for Musk cools after his feud with Trump, new poll finds",
    "description": "A new poll finds Elon Musk lost some of his luster with Republicans since his public falling-out with President Trump.",
    "link": "https://www.bostonherald.com/2025/06/13/republican-enthusiasm-elon-musk/",
    "timestamp": "2025-06-13T12:39:23Z"
  },
  {
    "title": "Trump Eyes 'New Golden Age' for US Nuclear Umbrella on China's Doorstep",
    "description": "The U.S. has committed to deter and respond to nuclear and non-nuclear threats against Japan.",
    "link": "https://www.newsweek.com/us-japan-news-nuclear-umbrella-new-golden-age-china-2085045",
    "timestamp": "2025-06-13T12:34:28Z"
  },
  {
    "title": "Trump’s 50% steel tariffs are coming for your next fridge and dishwasher | CNN Business",
    "description": "The Trump administration will soon ensure that its 50% steel tariffs, which have threatened to make everything containing steel more expensive, will apply to your next fridge or dishwasher.",
    "link": "https://www.cnn.com/2025/06/13/business/steel-us-tariffs-appliances",
    "timestamp": "2025-06-13T12:34:26Z"
  },
  {
    "title": "Danish department determined to dump Microsoft",
    "description": "Jutes revolt against Redmond: Minister for Digital Affairs aims the longboats away from Vinland\nComment The boss of Denmark's Ministry for Digitalization says her department will move away from Microsoft – starting with LibreOffice.…",
    "link": "https://www.theregister.com/2025/06/13/danish_department_dump_microsoft/",
    "timestamp": "2025-06-13T12:32:13Z"
  },
  {
    "title": "Israeli Strike ‘Excellent,’ Says Trump, Urging Iran To Surrender",
    "description": "President Donald Trump on Friday praised Israel’s major strike on Iran as “excellent” and warned of further escalation unless Tehran agrees to a nuclear deal. “They got hit hard. There’s more to come. A lot more,” Trump told ABC News. \nWriting on Truth Social…",
    "link": "https://biztoc.com/x/e8105ae27c4949e0",
    "timestamp": "2025-06-13T12:31:40Z"
  },
  {
    "title": "How did we get here?: Iran's nuclear programme and Israel's attempts to destroy it",
    "description": "Israel has assassinated nuclear physicists, generals and Iranian allies over the last four decades or so.",
    "link": "https://www.thejournal.ie/irans-nuclear-programme-and-israels-attempts-to-destroy-it-6732123-Jun2025/",
    "timestamp": "2025-06-13T12:30:43Z"
  },
  {
    "title": "What to know about Israel's major attack on Iran",
    "description": "The attack pushed the region into a new and uncertain phase. Here's what to know about the strikes.",
    "link": "https://richmond.com/news/nation-world/article_b9c73b4b-8fd1-58f8-a9da-fc40009d65a6.html",
    "timestamp": "2025-06-13T12:30:00Z"
  },
  {
    "title": "What to know about Israel's major attack on Iran",
    "description": "The attack pushed the region into a new and uncertain phase. Here's what to know about the strikes.",
    "link": "https://roanoke.com/news/nation-world/article_4b06e7fd-3fca-5ecf-ad53-244372ae337c.html",
    "timestamp": "2025-06-13T12:30:00Z"
  },
  {
    "title": "Trump to Attend National Security Meeting",
    "description": "“President Donald Trump will attend a National Security Council meeting on Friday morning, the White House said late on Thursday after Israeli strikes on Iran that have put the Middle East on edge,” Reuters reports.",
    "link": "https://politicalwire.com/2025/06/13/trump-to-attend-national-security-meeting/",
    "timestamp": "2025-06-13T12:30:00Z"
  },
  {
    "title": "Supreme Court ignores precedent instead of overruling it in allowing president to fire officials whom Congress tried to make independent",
    "description": "Can the president fire leaders of more than 50 independent agencies overseen by Congress because he wants to? The Supreme Court may say yes, upending decades of constitutional law.",
    "link": "https://theconversation.com/supreme-court-ignores-precedent-instead-of-overruling-it-in-allowing-president-to-fire-officials-whom-congress-tried-to-make-independent-257784",
    "timestamp": "2025-06-13T12:29:55Z"
  },
  {
    "title": "Radio Free Europe still hopes for Congress funds after U.S. financing halt",
    "description": "PRAGUE (Reuters) -U.S.-funded Radio Free Europe/Radio Liberty is seeking to build bi-partisan support in Congress to keep operating when approved financing e...",
    "link": "https://www.aol.com/news/radio-free-europe-still-hopes-122928337.html",
    "timestamp": "2025-06-13T12:29:28Z"
  },
  {
    "title": "Data on sexual orientation and gender is critical to public health – without it, health crises continue unnoticed",
    "description": "The Trump administration’s CDC data purge means researchers can no longer effectively track and address health issues affecting LGBTQ+ people – and ultimately society as a whole.",
    "link": "https://theconversation.com/data-on-sexual-orientation-and-gender-is-critical-to-public-health-without-it-health-crises-continue-unnoticed-255380",
    "timestamp": "2025-06-13T12:29:22Z"
  },
  {
    "title": "Why Israel is attacking Iran now",
    "description": "A weakened Tehran and a distracted Donald Trump have led Benjamin Netanyahu to finally act against long-standing foe",
    "link": "https://theweek.com/world-news/why-israel-is-attacking-iran-now",
    "timestamp": "2025-06-13T12:23:15Z"
  },
  {
    "title": "Outrage after Elon Musk's 'Grok' used to make sexual images of women without their consent",
    "description": "People have been hitting back at Grok after Elon Musk's AI was used to make sexual images of women without consent.",
    "link": "https://www.ladbible.com/news/technology/grok-ai-used-images-without-consent-002568-20250613",
    "timestamp": "2025-06-13T12:20:43Z"
  },
  {
    "title": "Donald Trump Celebrates Court Decision on National Guard: 'We Saved L.A.'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has welcomed a decision made on Thursday by the 9th U.S. Circuit Court of Appeals, which allows him to maintain control of California National Guard troops he dispatched to Los Angeles f…",
    "link": "https://biztoc.com/x/8972e9979849eb73",
    "timestamp": "2025-06-13T12:20:28Z"
  },
  {
    "title": "House tax-and-spending bill and other Trump administration changes could make millions of people lose their health insurance coverage",
    "description": "All told, more than 16 million Americans could become uninsured, reversing major progress seen since the Affordable Care Act’s passage in 2010.",
    "link": "https://theconversation.com/house-tax-and-spending-bill-and-other-trump-administration-changes-could-make-millions-of-people-lose-their-health-insurance-coverage-257529",
    "timestamp": "2025-06-13T12:20:07Z"
  },
  {
    "title": "'Wow': Ex-policy official says Trump's latest comment reveals president's 'ruse'",
    "description": "A former foreign policy official under presidents Barack Obama and Joe Biden was surprised by Donald Trump's social media post upending his administration's narrative on Iran.Israel launched an unprecedented strike on Iran's nuclear program and military leade…",
    "link": "https://www.rawstory.com/trump-iran-nuclear-deal-questioning/",
    "timestamp": "2025-06-13T12:19:50Z"
  },
  {
    "title": "Alex Padilla removed and detained at Noem’s news conference, video goes viral — here’s all about the Senator",
    "description": "Senator Alex Padilla was removed and briefly detained during a DHS press conference in Los Angeles while attempting to question Secretary Kristi Noem. The incident, captured on video, sparked outrage and accusations of abuse of power. Democrats condemned the …",
    "link": "https://economictimes.indiatimes.com/news/international/us/alex-padilla-removed-and-detained-at-noems-news-conference-video-goes-viral-heres-all-about-the-senator/articleshow/121829540.cms",
    "timestamp": "2025-06-13T12:19:30Z"
  },
  {
    "title": "Finance GOP nears tax, health text",
    "description": "The Senate Finance Committee is likely to release its legislative text for the reconciliation bill in two parts. The first portion could come today.",
    "link": "https://punchbowl.news/article/finance/economy/finance-gop-tax-health-text/",
    "timestamp": "2025-06-13T12:19:07Z"
  },
  {
    "title": "US stock futures plunge as Israel strikes Iran, Dow falls 400 points, oil prices surge over 8% amid Middle East tensions",
    "description": "US stock futures plunge as Israel strikes Iran, Dow futures fall sharply after Israel strikes Iran, shaking global markets and pushing oil prices up by over 8%. The Dow Jones futures dropped 423 points, while S&P 500 and Nasdaq also fell. Israel’s airstrikes …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-futures-plunge-as-israel-strikes-iran-dow-falls-400-points-oil-prices-surge-over-8-amid-middle-east-tensions/articleshow/121828937.cms",
    "timestamp": "2025-06-13T12:18:17Z"
  },
  {
    "title": "Donald Trump Celebrates Court Decision on National Guard: 'We Saved L.A.'",
    "description": "Trump ordered California National Guard troops to Los Angeles in response to violent demonstrations against immigration enforcement.",
    "link": "https://www.newsweek.com/donald-trump-celebrates-court-decision-national-guard-we-saved-l-2085090",
    "timestamp": "2025-06-13T12:17:24Z"
  },
  {
    "title": "Israel strikes Iran: what we know",
    "description": "Israel on Friday carried out dozens of airstrikes in Iran, hitting nuclear and military sites and killing several commanders and nuclear scientists.  Iran immediately responded by launching drones against Israel, and called the Israeli attack “a declaration o…",
    "link": "https://www.digitaljournal.com/world/israel-strikes-iran-what-we-know/article",
    "timestamp": "2025-06-13T12:17:20Z"
  },
  {
    "title": "Forbes Daily: Israel Strikes Iran As Trump Pushes For A Nuclear Deal",
    "description": "Friday's Forbes Daily newsletter covers  Trump's Gold Card visa red flags, Chime's shining IPO, Larry Ellison becomes the No. 2 richest, Trump's crypto fortune & more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/06/13/forbes-daily-israel-strikes-iran-as-trump-pushes-for-a-nuclear-deal/",
    "timestamp": "2025-06-13T12:15:52Z"
  },
  {
    "title": "Coinbase Issues $130 Billion ‘Systemic’ Bitcoin Price Warning",
    "description": "The global head of research at Coinbase has warned the trend of companies buying bitcoin could pose a “systemic risk” to the crypto market...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/06/13/coinbase-issues-130-billion-systemic-bitcoin-price-warning/",
    "timestamp": "2025-06-13T12:15:05Z"
  },
  {
    "title": "Israel Attacks Iran, Killing Top Military Leaders, Scientists; Hits Nuke Sites in Expanding Conflict",
    "description": "Israel has launched a large-scale military attack on Iran, killing top military officials, nuclear scientists and civilians in the deadliest attack on the country in decades. Iran has launched drones at Israel in response. The unprovoked attack, which Israel …",
    "link": "https://www.democracynow.org/2025/6/13/israel_attack_on_iran_netanyahu_trump",
    "timestamp": "2025-06-13T12:13:39Z"
  },
  {
    "title": "UN summit celebrates ocean protections, but drops fossil fuels",
    "description": "A global oceans summit concludes Friday with nations taking major steps toward marine protection and vowing a showdown over deep-sea mining, but criticised for leaving fossil fuels off the agenda. Countries hoping for new financial pledges to assist with comb…",
    "link": "https://www.digitaljournal.com/world/un-summit-celebrates-ocean-protections-but-drops-fossil-fuels/article",
    "timestamp": "2025-06-13T12:12:20Z"
  },
  {
    "title": "Trump Fully Endorses Israel’s ‘Excellent’ Attack on Iran After Rubio Distanced US From Strike",
    "description": "The Trump administration's reaction to Israel's attack on Iran seems inconsistent, as President Trump and Secretary of State Rubio have different takes.\nThe post Trump Fully Endorses Israel’s ‘Excellent’ Attack on Iran After Rubio Distanced US From Strike fir…",
    "link": "https://www.mediaite.com/politics/trump/trump-fully-endorses-israels-excellent-attack-on-iran-after-rubio-distanced-us-from-strike/",
    "timestamp": "2025-06-13T12:10:04Z"
  },
  {
    "title": "Tennessee judge to hear arguments about releasing Kilmar Abrego Garcia from pretrial detention",
    "description": "A Tennessee judge is scheduled to hear arguments about whether Kilmar Abrego Garcia can be released from jail prior to his federal trial.",
    "link": "https://www.bostonherald.com/2025/06/13/abrego-garcia-pretrial-detention-hearing/",
    "timestamp": "2025-06-13T12:08:02Z"
  },
  {
    "title": "California candidate for governor blasts Newsom while walking through LA riot aftermath",
    "description": "California GOP Candidate Steve Hilton told Fox News Digital that \"Gavin Newsom is a total joke\" amid the ongoing anti-ICE riots across Los Angeles.",
    "link": "https://www.foxnews.com/politics/california-candidate-governor-blasts-newsom-while-walking-through-la-riot-aftermath",
    "timestamp": "2025-06-13T12:07:33Z"
  },
  {
    "title": "Appeals Court Quickly Shoots Down Activist Judge — Lets Trump Keep National Guard On Street",
    "description": "A federal appeals court quickly halted a lower court's order directing President Donald Trump to turn over control of the National Guard.",
    "link": "https://dailycaller.com/2025/06/13/appeals-court-quickly-shoots-down-activist-judge-lets-trump-keep-national-guard-on-street/",
    "timestamp": "2025-06-13T12:07:23Z"
  },
  {
    "title": "Ripple, SEC Ask US Court To Release $125 Million In Escrow As They Seek To Settle Years-Long Case",
    "description": "The courtroom brawl between Ripple and the U.S. Securities and Exchange Commission (SEC) has taken a key step.",
    "link": "https://zycrypto.com/ripple-sec-ask-us-court-to-release-125-million-in-escrow-as-they-seek-to-settle-years-long-case/",
    "timestamp": "2025-06-13T12:03:45Z"
  },
  {
    "title": "I Voted For Trump In 2016. When He Won, I Was Shocked By How Brutally My Life Changed Overnight.",
    "description": "“I immediately hated my choice, but I did not yet believe it to be wrong.”",
    "link": "https://www.huffpost.com/entry/trump-voter-regret-chinese-immigrants-white-evangelical-culture_n_682fa423e4b0e1fe96d65531",
    "timestamp": "2025-06-13T12:03:09Z"
  },
  {
    "title": "Who were 2 of the top Iranian generals killed in Israeli strikes?",
    "description": "Israel's targeted strikes killed two top Iranian military leaders: Gen. Hossein Salami, leader of Iran's paramilitary and Gen. Mohammad Bagheri, chief of staff of the Iranian armed forces.",
    "link": "https://www.foxnews.com/world/who-were-2-top-iranian-generals-killed-israeli-strikes",
    "timestamp": "2025-06-13T12:02:58Z"
  },
  {
    "title": "Trump calls Israel’s attack on Iran ‘excellent’ — and warns ‘a lot more’ to come",
    "description": "President Trump on Friday described Israel's attack on Iran as \"excellent\" -- and warned there's \"a lot more\" to come as he blamed Tehran for not taking a nuclear deal earlier.",
    "link": "https://nypost.com/2025/06/13/us-news/trump-calls-israels-attack-on-iran-excellent-warns-a-lot-more-to-come/",
    "timestamp": "2025-06-13T12:02:57Z"
  },
  {
    "title": "Border Patrol's Social Media Post Sparks Fear Ahead Of Soccer Club World Cup In U.S.",
    "description": "The curtain-raiser event for next year's FIFA World Cup kicks off in Miami on Saturday amidst anxiety from some fans in the United States.",
    "link": "https://www.huffpost.com/entry/club-world-cup-soccer-fears-border_n_684c0f89e4b070091d772bf9",
    "timestamp": "2025-06-13T12:02:46Z"
  },
  {
    "title": "Republican enthusiasm for Musk cools after his feud with Trump, a new poll finds",
    "description": "A new poll finds Elon Musk has lost some of his luster with Republicans since his public falling-out with President Donald Trump",
    "link": "https://abcnews.go.com/Technology/wireStory/republican-enthusiasm-musk-cools-after-feud-trump-new-122807132",
    "timestamp": "2025-06-13T12:02:03Z"
  },
  {
    "title": "ASRA NOMANI: The $2.1 billion machine behind 'spontaneous' anti-Trump protests",
    "description": "Investigation reveals the #NoKings protests are orchestrated by 198 Democratic-aligned groups with $2.1 billion in revenue, contradicting claims of grassroots activism",
    "link": "https://www.foxnews.com/opinion/asra-nomani-2-1-billion-machine-behind-spontaneous-anti-trump-protests",
    "timestamp": "2025-06-13T12:00:54Z"
  },
  {
    "title": "Democrats forge strange bedfellows as party flounders in Trump's 2nd term",
    "description": "Tensions are rising as Democrats seek to establish new political alliances during President Donald Trump's second term.",
    "link": "https://www.foxnews.com/politics/democrats-forge-strange-bedfellows-party-flounders-trumps-second-term",
    "timestamp": "2025-06-13T12:00:35Z"
  },
  {
    "title": "Trump blocks Colorado’s rules meant to put more electric vehicles on the road",
    "description": "The Colorado Air Quality Control Commission partially adopted California's rules in 2023, which was allowed under the Environmental Protection Agency's regulations.",
    "link": "https://www.denverpost.com/2025/06/13/trump-electric-vehicle-rules-colorado-california/",
    "timestamp": "2025-06-13T12:00:31Z"
  },
  {
    "title": "NY Times Lovingly Defends Rioters Flying Mexican Flags",
    "description": "But bashed Martha Alito’s Patriotic Displays\nThe post NY Times Lovingly Defends Rioters Flying Mexican Flags first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/ny-times-lovingly-defends-rioters-flying-mexican-flags/",
    "timestamp": "2025-06-13T12:00:26Z"
  },
  {
    "title": "Trump Humiliated as Israel Strikes Iran Right After Last-Ditch Plea...",
    "description": "Israel launched what it described as a “preemptive strike” on Iran on Thursday, just hours after President Donald Trump called for a “diplomatic resolution” ...",
    "link": "https://www.thedailybeast.com/rubio-disowns-israeli-strikes-on-iran-that-blow-up-trumps-middle-east-peace-bid/",
    "timestamp": "2025-06-13T12:00:03Z"
  },
  {
    "title": "How Hiking Apparel Startup Seniq Is Building A Million Dollar Business In The Midwest",
    "description": "An Under 30 apparel startup is on track for $1 million in revenue, and says Ohio gives them opportunities they couldn't get elsewhere. Plus, how popsicles are making founders $100 million.",
    "link": "https://www.forbes.com/sites/alexyork/2025/06/13/how-hiking-apparel-startup-seniq-is-building-a-million-dollar-business-in-the-midwest/",
    "timestamp": "2025-06-13T12:00:00Z"
  },
  {
    "title": "International Insider: Animated In Annecy; Warner Split; Sarandos In Spain",
    "description": "Good afternoon Insiders, welcome to another newsletter after a busy old week during which many of us have been on the road. Do scroll down. And sign up here. Animated In Annecy Power of the craft: There’s no better way to remind yourself of the power of anima…",
    "link": "http://deadline.com/2025/06/international-insider-annecy-animation-film-festival-1236431723/",
    "timestamp": "2025-06-13T12:00:00Z"
  },
  {
    "title": "David Barton’s Defense of ICE Actions in LA is as Wrong as His History Lessons",
    "description": "David Barton's propaganda on current events is every bit as believable as his Christian nationalist history.",
    "link": "https://www.peoplefor.org/rightwingwatch/david-bartons-defense-ice-actions-la-wrong-his-history-lessons",
    "timestamp": "2025-06-13T12:00:00Z"
  },
  {
    "title": "Trump LA troop deployment illegal, judge says",
    "description": "San Diego physicians and health care workers are asking Gov. Gavin Newsom to protect Medi-Cal benefits for immigrants without legal status. Then, hear about a new state program to help homeowners impacted by disasters. Also, Caltran’s is planning to spend abo…",
    "link": "https://www.kpbs.org/podcasts/san-diego-news-now/trump-la-troop-deployment-illegal-judge-says",
    "timestamp": "2025-06-13T12:00:00Z"
  },
  {
    "title": "Rand Paul in Bitter Dispute with Stephen Miller",
    "description": "“A bitter feud is escalating between Republican Sen. Rand Paul and Donald Trump’s top border official, injecting uncertainty into Congress’s attempt to pass the administration’s signature policy bill this month,” CNN reports. “Key Trump adviser",
    "link": "https://politicalwire.com/2025/06/13/rand-paul-in-bitter-dispute-with-stephen-miller/",
    "timestamp": "2025-06-13T12:00:00Z"
  },
  {
    "title": "Connor O’Keeffe: The Federal Judiciary’s War on Trump Is Not About Protecting Us from Government Overreach",
    "description": "Most of Trump’s campaign promises have been cancelled by the Federal courts. The reason is… They’re protecting from government overreach. At least, that’s what they say, or that’s how they see their role. And, in fact, that is the classical role of the legal …",
    "link": "https://www.activistpost.com/connor-okeeffe-the-federal-judiciarys-war-on-trump-is-not-about-protecting-us-from-government-overreach/",
    "timestamp": "2025-06-13T12:00:00Z"
  },
  {
    "title": "Trump: Iran has second chance to make deal",
    "description": "United States President Donald Trump commented on Truth Social on Friday that he gave Iran a 60-day ultimatum two months ago to reach a nuclear deal. \"Today is day 61. I told them what to do, but they...",
    "link": "https://biztoc.com/x/e5fdd82612c1ac33",
    "timestamp": "2025-06-13T11:58:22Z"
  },
  {
    "title": "Trump calls Israel’s strike on Iran 'excellent', says 'there’s more to come'",
    "description": "Israel launched a series of strikes on Iranian nuclear sites, resulting in the deaths of several security chiefs. Former US President Trump praised the attack, warning of further actions if Iran doesn't agree to a nuclear deal. While Trump denies US involveme…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-israels-strike-on-iran-excellent-says-theres-more-to-come/articleshow/121829286.cms",
    "timestamp": "2025-06-13T11:58:03Z"
  },
  {
    "title": "Those Who Would Be King",
    "description": "After implementing significant budget cuts across various federal programs, including eliminating some 83,000 jobs at the Department of Veterans Affairs, 20,000 of which were filled by veterans, President Donald J. Trump plans to spend an estimated $45-96 mil…",
    "link": "https://www.commondreams.org/opinion/donald-trump-the-would-be-king",
    "timestamp": "2025-06-13T11:53:05Z"
  },
  {
    "title": "Bitcoin Dips To $103K But Ethereum, Solana, And DOGE Fall Harder As Israel Launches Major Strike On Iran",
    "description": "Risk assets, including Bitcoin, got off to a poor start Thursday as US President Donald Trump threatened renewed tariff measures.",
    "link": "https://zycrypto.com/bitcoin-dips-to-103k-but-ethereum-solana-and-doge-fall-harder-as-israel-launches-major-strike-on-iran/",
    "timestamp": "2025-06-13T11:52:07Z"
  },
  {
    "title": "Fetterman calls for US to supply anything Israel needs for Iran attack: 'Military, intelligence, weaponry'",
    "description": "Democratic Sen. John Fetterman of Pennsylvania calls for the U.S. to give Israel anything it needs in support of its assault against Iran.",
    "link": "https://www.foxnews.com/politics/fetterman-calls-us-supply-anything-israel-needs-iran-attack-military-intelligence-weaponry",
    "timestamp": "2025-06-13T11:51:20Z"
  },
  {
    "title": "It’s Gianni’s world (cup)…",
    "description": "On the eve of the kick off of FIFA's newest major tournament, we wonder, who is the Club World Cup for?",
    "link": "https://africasacountry.com/2025/06/its-giannis-world-cup/",
    "timestamp": "2025-06-13T11:50:42Z"
  },
  {
    "title": "'Bit in contrast': Trump immediately blows up Rubio's statement on Israel attack",
    "description": "President Donald Trump acknowledged in a social media post that he gave Israel the go-ahead to attack Iran, going against claims from his own administration officials.Israel deployed 200 fighter jets to target Iran's nuclear programs and kill multiple top mil…",
    "link": "https://www.rawstory.com/trump-israel-iran-strike-contradicts/",
    "timestamp": "2025-06-13T11:49:34Z"
  },
  {
    "title": "Israel, Allies Intercept Iranian Drones; IDF Renews Attacks",
    "description": "Israel, its allies, and regional Arab countries together intercepted Iranian drones fired in retaliation for the massive Israeli airstrike launched early Friday, stopping them before they reached Israeli airspace.\nThe post Israel, Allies Intercept Iranian Dro…",
    "link": "https://www.breitbart.com/middle-east/2025/06/13/israel-allies-intercept-iranian-drones-idf-renews-attacks/",
    "timestamp": "2025-06-13T11:49:03Z"
  },
  {
    "title": "US court allows Trump's National Guard deployment in LA",
    "description": "A US court said that President Donald Trump could temporarily keep deploying troops in response to protests in California, after an earlier ruling barred him from doing so.\nNational Guard forces were deployed to Los Angeles days ago, against the state governo…",
    "link": "https://biztoc.com/x/9e6a83d86d9f612b",
    "timestamp": "2025-06-13T11:47:16Z"
  },
  {
    "title": "Fed Likely To Hold Interest Rates Steady In June Policy Meeting Despite Trump Slamming Jerome Powell, Saying 'We Can't Get This Guy To Do It'",
    "description": "The Federal Reserve is widely expected to maintain its benchmark interest rate in the 4.25%-4.50% range at next week’s policy meeting, as policymakers weigh recent soft inflation data against ongoing uncertainty from President Donald Trump‘s trade policies an…",
    "link": "https://biztoc.com/x/e4f1239f50df0e03",
    "timestamp": "2025-06-13T11:46:49Z"
  },
  {
    "title": "'No Kings' Rally Organizers Issue Video Update",
    "description": "There are over 1,500 protests against President Donald Trump planned across the country for June 14.",
    "link": "https://biztoc.com/x/7305a95c5b4f0d28",
    "timestamp": "2025-06-13T11:46:48Z"
  },
  {
    "title": "Everyone Is Watching Donald Trump: G-7 Leaders Guide",
    "description": "Mark Carney will welcome world leaders to the Canadian Rockies hoping to avoid a repeat of the blow up the last time his country played host",
    "link": "https://financialpost.com/pmn/business-pmn/everyone-is-watching-donald-trump-g-7-leaders-guide",
    "timestamp": "2025-06-13T11:46:28Z"
  },
  {
    "title": "Trump Urges Iran to Make a Nuclear Deal to Avoid More Attacks",
    "description": "US President Donald Trump urged Iran to accept a nuclear deal to avoid further attacks, hours after Israel bombed the Islamic Republic’s atomic facilities and killed some of its top commanders.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-urges-iran-to-make-a-nuclear-deal-to-avoid-more-attacks",
    "timestamp": "2025-06-13T11:46:13Z"
  },
  {
    "title": "Republican enthusiasm for Musk cools after his feud with Trump, a new AP-NORC poll finds",
    "description": "A new poll finds Elon Musk has lost some of his luster with Republicans since his public falling-out with President Donald Trump.",
    "link": "https://www.clickondetroit.com/business/2025/06/13/republican-enthusiasm-for-musk-cools-after-his-feud-with-trump-a-new-ap-norc-poll-finds/",
    "timestamp": "2025-06-13T11:45:26Z"
  },
  {
    "title": "Appeals court temporarily blocks judge's ruling to return control of National Guard to California",
    "description": "The order takes effect at noon Friday. It said the deployment violated the Tenth Amendment and exceeded Trump's statutory authority.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_0282a44d-810a-5e97-8b36-a27bca42a338.html",
    "timestamp": "2025-06-13T11:45:00Z"
  },
  {
    "title": "Trump Reacts To 'No Kings' Protests With A 'Hell'-ish Whine",
    "description": "The demonstrations are meant to counter his grand military parade scheduled for Saturday — his birthday.",
    "link": "https://www.huffpost.com/entry/trump-i-dont-feel-like-a-king_n_684bea26e4b0c4fd78ffb8f3",
    "timestamp": "2025-06-13T11:40:51Z"
  },
  {
    "title": "“I think it’s been excellent” – Trump Reacts To Israel Attack On Iran’s Nuclear Program",
    "description": "\"We gave them a chance and they didn't take it. They got hit hard, very hard. They got hit about as hard as you're going to get hit. And there's more to come. a lot more.\"\nThe post “I think it’s been excellent” – Trump Reacts To Israel Attack On Iran’s Nuclea…",
    "link": "https://legalinsurrection.com/2025/06/i-think-its-been-excellent-trump-reacts-to-israel-attack-on-irans-nuclear-program/",
    "timestamp": "2025-06-13T11:38:42Z"
  },
  {
    "title": "'No Kings' Rally Organizers Issue Video Update",
    "description": "There are over 1,500 protests against President Donald Trump planned across the country for June 14.",
    "link": "https://www.newsweek.com/no-kings-protest-donald-trump-update-2085000",
    "timestamp": "2025-06-13T11:38:30Z"
  },
  {
    "title": "Trump calls Israeli strike on Iran 'excellent,' warns of more",
    "description": "US President Donald Trump praised Israel's military offensive on Iran during an interview with ABC News on Friday, calling the strikes \"excellent\" and warning that further action is likely. \"I think i...",
    "link": "https://biztoc.com/x/a5685dc7d0f0e793",
    "timestamp": "2025-06-13T11:36:54Z"
  },
  {
    "title": "The old “religious right” is dead. The new one is stranger — and harder to fight",
    "description": "President Donald Trump hands out pens to faith leaders after signing an executive order on the establishment of the Religious Liberty Commission during a National Day of Prayer event in the Rose Garden of the White House on May 1, 2025. | Mandel Ngan/AFP via …",
    "link": "https://biztoc.com/x/e7fba6df94193570",
    "timestamp": "2025-06-13T11:36:00Z"
  },
  {
    "title": "Donald Trump Sounds Like a Democrat From the 1980s",
    "description": "One of the most entertaining recent social media love fests involved President Donald Trump and U.S. Sen. Elizabeth Warren (D–Mass.). \nWarren wrote that she and the president agree about scrapping the debt ceiling—a congressional limit on federal borrowing. I…",
    "link": "https://biztoc.com/x/8433ad50a01bb961",
    "timestamp": "2025-06-13T11:35:55Z"
  },
  {
    "title": "R. Kelly appeals to Donald Trump as he fears for life in prison",
    "description": "The disgraced rapper is serving a 30-year sentence for federal crimes including sex trafficking.",
    "link": "https://7news.com.au/news/r-kelly-appeals-to-donald-trump-as-he-fears-for-life-in-prison-c-19021953",
    "timestamp": "2025-06-13T11:35:19Z"
  },
  {
    "title": "Indonesia scraps plan to send delegation to US for tariff talks; Prabowo and Trump hold phone meeting",
    "description": "Indonesia will no longer send a delegation to the US for tariff negotiations as its proposal to Washington has already been deemed sufficient, according to the senior minister who's leading the talks. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/13/indonesia-scraps-plan-to-send-delegation-to-us-for-tariff-talks-prabowo-and-trump-hold-phone-meeting",
    "timestamp": "2025-06-13T11:34:00Z"
  },
  {
    "title": "Oil prices surge while global shares retreat after Israel’s strike on Iran",
    "description": "U.S. benchmark crude oil rose more than 7% and US stocks fell in futures trading ahead of the market open.",
    "link": "https://www.bostonherald.com/2025/06/13/stock-market-oil-prices-impact/",
    "timestamp": "2025-06-13T11:32:16Z"
  },
  {
    "title": "The U.S. government is one step closer to defunding NPR, PBS",
    "description": "Good morning. Wow, what a week in media. Journalists being targeted at the protests in Los Angeles. The ouster of longtime correspondent Terry Moran at ABC News, in part, because […]\nThe post The U.S. government is one step closer to defunding NPR, PBS appear…",
    "link": "https://www.poynter.org/commentary/2025/house-votes-defund-npr-pbs/",
    "timestamp": "2025-06-13T11:30:54Z"
  },
  {
    "title": "Trump’s Un-American Parade",
    "description": "What looks like an excess of strength may really be a deficit of liberty.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/trump-american-parade-military/683144/",
    "timestamp": "2025-06-13T11:30:00Z"
  },
  {
    "title": "On eve of US Army's 250th anniversary, veterans fear for benefits",
    "description": "Washington (AFP) June 13, 2025\n\n\n Scott Konopasek, a decorated US veteran, has gone from defending his country to protesting the government, angered by deep budget cuts hurting former members of the military. \n\nWearing a US Army cap, the former intelligence o…",
    "link": "https://www.spacewar.com/reports/On_eve_of_US_Armys_250th_anniversary_veterans_fear_for_benefits_999.html",
    "timestamp": "2025-06-13T11:29:59Z"
  },
  {
    "title": "China replaces key envoy dealing with Ukraine war",
    "description": "Beijing (AFP) June 12, 2025\n\n China on Thursday said it had replaced a key envoy charged with diplomacy to end the war in Ukraine. \n\nSun Linjiang, formerly China's ambassador to Poland, has been appointed special representative for Eurasian affairs, Beijing's…",
    "link": "https://www.spacewar.com/reports/China_replaces_key_envoy_dealing_with_Ukraine_war_999.html",
    "timestamp": "2025-06-13T11:29:59Z"
  },
  {
    "title": "Protests erupt nationwide over immigration enforcement raids",
    "description": "The Trump administration said immigration raids and deportations will continue. Here's a look at some recent protests and reactions across the U.S.",
    "link": "https://www.wyff4.com/article/protests-federal-immigration-enforcement/65056085",
    "timestamp": "2025-06-13T11:28:58Z"
  },
  {
    "title": "What's the big deal with rare earth elements?",
    "description": "What do EVs, fighter jets and digital cameras have in common? Rare earth elements that are wanted everywhere but only sourced in some places.",
    "link": "https://www.dw.com/en/what-happens-if-china-cuts-off-access-to-rare-earth-elements/a-72734530",
    "timestamp": "2025-06-13T11:26:00Z"
  }
]