[
  {
    "title": "Early turnout shatters record in Canada polls with 7.3m ballots cast",
    "description": "Elections Canada, the organisation which runs federal elections, reports a 25% jump when compared to early voting in 2021 polls.",
    "link": "https://www.bbc.com/news/articles/cp3129z5kyko",
    "timestamp": "2025-04-22T21:10:47Z"
  },
  {
    "title": "Bondi, Trump Cabinet convenes task force to root out 'anti-Christian bias' in federal agencies",
    "description": "Pam Bondi says Biden-era DOJ 'targeted peaceful Christians' as Trump Cabinet gathers for first meeting to fight anti-Christian discrimination in government.",
    "link": "https://www.foxnews.com/politics/bondi-trump-cabinet-convenes-task-force-root-out-anti-christian-bias-federal-agencies",
    "timestamp": "2025-04-22T21:10:19Z"
  },
  {
    "title": "Peirce signals SEC ‘reorientation’ under new chair Paul Atkins",
    "description": "US Securities and Exchange Commission member Hester Peirce, currently leading the agency’s crypto task force, offered a preview of what the industry could expect now that Paul Atkins has been sworn in as the regulatory body’s chairman.Speaking to Cointelegrap…",
    "link": "https://cointelegraph.com/news/sec-commissioner-hester-peirce-reorient-paul-atkins",
    "timestamp": "2025-04-22T21:09:16Z"
  },
  {
    "title": "RFK Jr.’s autism registry idea raises all kinds of red flags",
    "description": "Mark Zuckerberg makes power moves to help Meta avoid regulations, a popular prayer app has taken MAGA world by storm, and more — all in this week’s Tuesday Tech Drop.",
    "link": "https://www.msnbc.com/top-stories/latest/rfk-jr-autism-registry-trump-google-ice-hegseth-rcna202393",
    "timestamp": "2025-04-22T21:08:16Z"
  },
  {
    "title": "Millionaire Real Estate Investor Tells Everyone To Shut Up About Their 401Ks",
    "description": "Millionaire real estate investor Grant Cardone wants all of the peons out there to know what a super genius Donald Trump is and for all of them to quit bitching about what's happening to their retirement accounts.\nCardone made an appearance on Laura Ingraham'…",
    "link": "https://crooksandliars.com/2025/04/millionaire-real-estate-investor-tells",
    "timestamp": "2025-04-22T21:05:35Z"
  },
  {
    "title": "Yet another debate: Dutton improves performance but polls show continued decline for LNP",
    "description": "Are you sick of them yet? In the third debate of the 2025 campaign last night, Peter Dutton improved his performance. However, polling shows that Labor continues to increase its lead ahead of May 3.\nThe post Yet another debate: Dutton improves performance but…",
    "link": "http://www.crikey.com.au/2025/04/23/peter-dutton-leaders-debate-2025-election-polling/",
    "timestamp": "2025-04-22T21:05:24Z"
  },
  {
    "title": "\"Shocked and Disgusted.\" UA Democrats respond to news of President Trump at UA",
    "description": "News of President Donald Trump announcing he will be giving the commencement speech at the University of Alabama has sparked outrage from the University of Ala",
    "link": "https://abc3340.com/news/local/shocked-and-disgusted-ua-democrats-respond-to-news-of-president-trump-at-ua-national-news-politics",
    "timestamp": "2025-04-22T21:05:23Z"
  },
  {
    "title": "Big blow to Elon Musk as Tesla profits crash 71 per cent; Investors seek Donald Trump's adviser's resignation",
    "description": "Tesla reported profits of $409 million, down 71 per cent from the year-ago results, as per a report.",
    "link": "https://economictimes.indiatimes.com/news/international/us/big-blow-to-elon-musk-as-tesla-profits-crash-71-per-cent-investors-seek-donald-trumps-advisers-resignation/articleshow/120530265.cms",
    "timestamp": "2025-04-22T21:05:09Z"
  },
  {
    "title": "Bitcoin Jumps as US Treasury’s Bessent Hints at ‘Perceived Progress’ on Trade Negotiations",
    "description": "The White House has recently focused its trade war on China.",
    "link": "https://decrypt.co/315821/bitcoin-jumps-as-bessent-hints-at-progress-on-trade-negotiations",
    "timestamp": "2025-04-22T21:00:48Z"
  },
  {
    "title": "Trump Admin Axes Biden-Era Climate Office John Kerry Used To Assault Fossil Fuels",
    "description": "The State Department is formally removing the Office of the Special Presidential Envoy for Climate, the office former president Joe Biden created and appointed John Kerry to lead as part of his aggressive agenda to combat global warming, the Washington Free B…",
    "link": "https://freebeacon.com/energy/trump-admin-axes-biden-era-climate-office-john-kerry-used-to-assault-fossil-fuels/",
    "timestamp": "2025-04-22T21:00:15Z"
  },
  {
    "title": "Inside Harvard's lawsuit against the Trump administration",
    "description": "Harvard's lawsuit questions how freezing research funds will further the administration's goal of eliminating antisemitism on campus.",
    "link": "https://www.kpbs.org/news/education/2025/04/22/inside-harvards-lawsuit-against-the-trump-administration",
    "timestamp": "2025-04-22T21:00:12Z"
  },
  {
    "title": "Inside Harvard's lawsuit against the Trump administration",
    "description": "Harvard's lawsuit questions how freezing research funds will further the administration's goal of eliminating antisemitism on campus.",
    "link": "https://www.npr.org/2025/04/22/nx-s1-5372566/trump-harvard-lawsuit-antisemitism",
    "timestamp": "2025-04-22T21:00:12Z"
  },
  {
    "title": "'60 Minutes' producer quits after show targeted by Trump",
    "description": "The executive producer of \"60 Minutes\", the storied US primetime current affairs show, resigned Tuesday blaming attacks on his independence in recent months ...",
    "link": "https://www.yahoo.com/news/60-minutes-producer-quits-show-210010874.html",
    "timestamp": "2025-04-22T21:00:10Z"
  },
  {
    "title": "California Gov. Gavin Newsom Sues DOGE Over AmeriCorps Cuts",
    "description": "Americans want and end to waste, fraud, and abuse. AmeriCorps failed its 8th audit in 2024, and DOGE had recently placed most of its staff on administrative leave. Therefore, Newsom is giving the 'middle finger\" to Americans...many of whom live in California.…",
    "link": "https://legalinsurrection.com/2025/04/california-gov-gavin-newsom-sues-doge-over-americorps-cuts/",
    "timestamp": "2025-04-22T21:00:06Z"
  },
  {
    "title": "'Don't Boo!': MAGA Rep. Byron Donalds Town Hall Turns Chaotic",
    "description": "MAGA Florida Rep. Byron Donalds' town hall went down about the way you'd expect it to, with the increased disdain voters have for DOGE, Elon Musk, co-president Donald Trump, and the anti-DEI agenda. There were some supporters on his side, but half of the atte…",
    "link": "https://crooksandliars.com/2025/04/dont-boo-maga-rep-byron-donalds-town-hall",
    "timestamp": "2025-04-22T21:00:01Z"
  },
  {
    "title": "Should Trump Fire Pete Hegseth? Absolutely Not!",
    "description": "Any major personnel shift seemingly dictated by forces outside of Trump’s control diminishes him and gives fuel to those elements in the Capitol and the press who are arrayed against him.\nThe post Should Trump Fire Pete Hegseth? Absolutely Not! appeared first…",
    "link": "https://nationalinterest.org/blog/buzz/should-trump-fire-pete-hegseth-absolutely-not",
    "timestamp": "2025-04-22T21:00:00Z"
  },
  {
    "title": "Inside Economics: Donald Trump versus the US Fed? Can the President sack the chair?",
    "description": "OPINION: Liam Dann takes a deeper dive into the week's economic news.",
    "link": "https://www.nzherald.co.nz/business/economy/inside-economics-donald-trump-vs-the-us-fed-can-the-president-sack-the-chair/TEKVW7GU6NCBZHQMFJE2JFNCA4/",
    "timestamp": "2025-04-22T21:00:00Z"
  },
  {
    "title": "Shock message for Earth Day: Mother Earth loves Trump’s energy policies! – Earth admits: ‘Trump has improved the state of my health’",
    "description": "Mother Earth: I am smiling in 2025 because the Great Orange one, a.k.a. President Donald Trump, has improved the state of my health. Trump’s America First energy policy prioritizes readily accessible fossil fuels, which means less resource-intensive emphasis …",
    "link": "https://wattsupwiththat.com/2025/04/22/shock-message-for-earth-day-mother-earth-loves-trumps-energy-policies-earth-admits-trump-has-improved-the-state-of-my-health/",
    "timestamp": "2025-04-22T21:00:00Z"
  },
  {
    "title": "World economic order undergoing major ‘reset’ – IMF",
    "description": "The International Monetary Fund is projecting a significant global slowdown due to US tariff policy Read Full Article at RT.com",
    "link": "https://www.rt.com/business/616123-us-tariffs-global-economy/",
    "timestamp": "2025-04-22T20:59:55Z"
  },
  {
    "title": "IMF Report: Trump Trade War Will Hurt Both U.S. and Global Economies",
    "description": "Since his second term began, President Donald Trump has imposed double-digit tariffs on nearly every nation, sending markets into turmoil. Trump said it was necessary, posting in all caps on Truth Social, \"Will there be some pain? Yes, maybe (and maybe not!).…",
    "link": "https://biztoc.com/x/8dad691d0753c5df",
    "timestamp": "2025-04-22T20:59:04Z"
  },
  {
    "title": "‘60 Minutes’ Top Producer Resigns: Says He Lost Journalistic Independence Amid Trump Fight",
    "description": "CBS’ parent company, Paramount, needs the Trump administration’s approval to sell to Skydance.",
    "link": "https://www.forbes.com/sites/saradorn/2025/04/22/60-minutes-top-producer-resigns-says-he-lost-journalistic-independence-amid-trump-fight/",
    "timestamp": "2025-04-22T20:57:07Z"
  },
  {
    "title": "Yet Another Federal Judge Blocks Trump’s B.S. Deportations",
    "description": "Yet another federal judge has blocked the Trump administration's efforts to deport migrants without due process under the Alien Enemies Act.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-deportations-blocked-federal-judge-1235322826/",
    "timestamp": "2025-04-22T20:56:48Z"
  },
  {
    "title": "Tesla earnings plunge 71% as EV maker warns of tariff pain ahead",
    "description": "Tesla omitted an earlier prediction that sales would return to growth for the full year. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/tesla-says-profits-plunge-71-warns-of-changing-political-sentiment",
    "timestamp": "2025-04-22T20:56:29Z"
  },
  {
    "title": "Prime Minister Christopher Luxon to attend Pope Francis’ funeral",
    "description": "The Prime Minister is in Europe for ANZAC day.",
    "link": "https://www.nzherald.co.nz/nz/politics/christopher-luxon-to-attend-pope-francis-funeral/MZ772RJ3JRA2BIC5VT3RYZR37Y/",
    "timestamp": "2025-04-22T20:56:20Z"
  },
  {
    "title": "Tesla's Earnings Are Even More Brutal Than We Expected",
    "description": "Tesla has released its first-quarter earnings — and the numbers are even more brutal than we expected. The embattled carmaker missed analysts' expectations by a mile, reporting that net income had slid an astonishing 71 percent in the first quarter. The compa…",
    "link": "https://futurism.com/tesla-earnings-brutal-elon-musk",
    "timestamp": "2025-04-22T20:56:04Z"
  },
  {
    "title": "Could an American pope be waiting in the wings? Experts weigh in",
    "description": "With more than 61 million Catholics and the second-highest number of cardinals after Italy, a guessing game is emerging on whether an American could be elected pope.",
    "link": "https://abcnews.go.com/US/61-million-catholics-us-pope-american/story?id=121005932",
    "timestamp": "2025-04-22T20:54:29Z"
  },
  {
    "title": "Harvard University Should Emulate Hillsdale College and Cut Ties With the Government",
    "description": "Given the censorious conduct of colleges and universities in recent years, it takes a lot to get free speech advocates to treat them as aggrieved parties.",
    "link": "https://reason.com/2025/04/23/harvard-university-should-emulate-hillsdale-college-and-cut-ties-with-the-government/",
    "timestamp": "2025-04-22T20:53:58Z"
  },
  {
    "title": "Education Dept. plans to restart debt collections for defaulted student loan borrowers",
    "description": "The Trump administration is heaping more financial pain on millions of Americans, restarting debt collection for student loan borrowers who’d fallen into default.",
    "link": "https://www.msnbc.com/top-stories/latest/student-debt-collections-restart-department-education-rcna202445",
    "timestamp": "2025-04-22T20:52:37Z"
  },
  {
    "title": "Donald Trump Is Hell-Bent on Destroying the Economy",
    "description": "Sometime in the next year, the United States will almost certainly slide into a recession, if not something altogether worse. Last week, Federal Reserve Chair Jerome Powell warned that “there isn’t a modern experience of how to think about” the current econom…",
    "link": "https://newrepublic.com/article/194273/trump-jerome-powell-destroying-economy",
    "timestamp": "2025-04-22T20:50:50Z"
  },
  {
    "title": "Tesla profit slumps 39% as EV sales dry up and tariff worries loom",
    "description": "Weak product line-up and consumer backlash to Elon Musk’s increased involvement in US politics hit sales",
    "link": "https://www.irishtimes.com/business/2025/04/22/tesla-profit-slumps-39-as-ev-sales-dry-up-and-tariff-worries-loom/",
    "timestamp": "2025-04-22T20:49:02Z"
  },
  {
    "title": "Tesla earnings show plunging revenue as Elon Musk's EV maker warns of hits from Trump's tariffs",
    "description": "Tesla’s (TSLA) first-quarter earnings are out, and they’re not looking good for the automaker. The company’s net income sank 71%, and its earnings are a double miss in both earnings-per-share and revenue. Total auto revenue fell 20% year-over-year during the …",
    "link": "https://qz.com/tesla-1q-earnings-report-elon-musk-tariffs-1851777394",
    "timestamp": "2025-04-22T20:48:00Z"
  },
  {
    "title": "Going for the gold haven",
    "description": "NEW YORK — As economic uncertainty deepens worldwide, gold prices have notched more and more record highs.\nThat’s because gold sales can rise sharply when anxious investors seek “safe havens” for parking their money. Gold’s current rally arrives as U.S. Presi…",
    "link": "https://biztoc.com/x/f29b12d5b5cc1edc",
    "timestamp": "2025-04-22T20:47:45Z"
  },
  {
    "title": "America Isn’t Israel’s Bodyguard",
    "description": "In a recent piece in The Atlantic, Reuel Marc Gerecht, a senior fellow with the neoconservative Foundation for Defense of Democracies, urged the United States to confront Turkey. According to Gerecht, Turkey has emerged, under the presidency of Recep Tayyip E…",
    "link": "https://freerepublic.com/focus/f-news/4312634/posts",
    "timestamp": "2025-04-22T20:46:38Z"
  },
  {
    "title": "Business Experts Sound Alarm On DEI Initiatives In Corporate America",
    "description": "Some experts have warned that many of the DEI policies which have become prevalent throughout corporate America may have resulted in a variety of problems.",
    "link": "https://dailycaller.com/2025/04/22/business-experts-sound-alarm-on-dei-initiatives-in-corporate-america/",
    "timestamp": "2025-04-22T20:45:59Z"
  },
  {
    "title": "Going for the gold haven",
    "description": "As economic uncertainty deepens worldwide, gold prices have notched more and more record highs.",
    "link": "https://www.bostonherald.com/2025/04/22/going-for-the-gold-haven/",
    "timestamp": "2025-04-22T20:45:40Z"
  },
  {
    "title": "Qatar hires Bernard Kerik, former New York police chief as lobbyist",
    "description": "Bernard Kerik, a close ally of Rudy Guiliani, who was recently pardoned by U.S. President Donald Trump for tax crimes and has praised Qatar since Trump's electoral victory, is reportedly the first hire made by Qatar since the emergence of 'Qatargate'",
    "link": "https://www.haaretz.com/us-news/2025-04-22/ty-article/.premium/reports-qatar-hires-bernard-kerik-former-new-york-police-chief-as-lobbyist/00000196-5f0e-db89-a5d7-df1f703a0000",
    "timestamp": "2025-04-22T20:45:18Z"
  },
  {
    "title": "Vogue Is 'Scrambling to Stay Relevant' After Snubbing First Lady Melania Trump 'Because of Politics' — 'They Ignored One Of the Most Stylish Women in The World'",
    "description": "Sources said the decision to keep the first lady off the world's most stylish women issue has backfired as Melania gains influence in Trump's second term.",
    "link": "https://radaronline.com/p/melania-trump-vogue-anna-wintour-backlash-scrambling-relevancy/",
    "timestamp": "2025-04-22T20:45:00Z"
  },
  {
    "title": "Colorado Judge Uses Supreme Court Order to Block Trump Admin Deportations",
    "description": "A federal judge extended a temporary restraining order against the Trump administration until May 6.",
    "link": "https://www.newsweek.com/colorado-judge-uses-supreme-court-order-block-trump-admin-deportations-2062751",
    "timestamp": "2025-04-22T20:44:45Z"
  },
  {
    "title": "Congressional delegation visits Mahmoud Khalil and Rumeysa Ozturk in Louisiana detention centers | CNN",
    "description": "A delegation of congressional members traveled to Louisiana Tuesday to demand the release of Mahmoud Khalil and Rumeysa Ozturk and inspect conditions at the two Immigration and Customs Enforcement detention facilities where the two remain in custody.",
    "link": "https://www.cnn.com/2025/04/22/us/mahmoud-khalil-rumeysa-ozturk-louisiana/index.html",
    "timestamp": "2025-04-22T20:44:08Z"
  },
  {
    "title": "FBI Analyst Who Resigned Over Kash Patel Announces Congressional Run",
    "description": "A former FBI analyst who resigned over FBI Director Kash Patel and President Donald Trump announced he was running for Congress on Tuesday.",
    "link": "https://dailycaller.com/2025/04/22/john-sullivan-fbi-congress-kash-patel-donald-trump-elon-musk/",
    "timestamp": "2025-04-22T20:44:07Z"
  },
  {
    "title": "George Clooney is optimistic America has better days ahead. Patti LuPone is everyone else | CNN",
    "description": "George Clooney is optimistic America has better days ahead. Patti LuPone is everyone else | CNNcnn.com",
    "link": "https://www.cnn.com/2025/04/22/entertainment/george-clooney-patti-lupone/index.html",
    "timestamp": "2025-04-22T20:42:33Z"
  },
  {
    "title": "Read the full letter from universities opposing ‘government intrusion’",
    "description": "More than 200 college presidents and other officials signed a letter Tuesday protesting the “unprecedented government overreach and political interference” that higher education is facing under the Trump administration.",
    "link": "https://www.pbs.org/newshour/education/read-the-full-letter-from-universities-opposing-government-intrusion",
    "timestamp": "2025-04-22T20:42:11Z"
  },
  {
    "title": "Head Of Trump’s Alma Mater Adds Name To Criticism Of White House Attacks On Universities",
    "description": "Leaders from more than 200 colleges and universities signed a letter slamming \"unprecedented government overreach.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-education-university-of-pennsylvania_n_6807d4d2e4b09d8446f84f94",
    "timestamp": "2025-04-22T20:41:19Z"
  },
  {
    "title": "U.S. Treasury Secretary Says Trade War With China Is Not 'Sustainable'",
    "description": "“I do say China is going to be a slog in terms of the negotiations,” Bessent said according to a transcript obtained by The Associated Press.",
    "link": "https://www.huffpost.com/entry/united-states-treasury-secretary-says-trade-war-china-not-sustainable_n_6807fcf2e4b00081c708cc11",
    "timestamp": "2025-04-22T20:39:48Z"
  },
  {
    "title": "Who Will Attend Pope Francis’s Funeral?",
    "description": "On Saturday, dignitaries from around the world will gather at St. Peter’s Basilica to pay their respects to the pontiff, who died at age 88 on Monday.",
    "link": "https://www.vanityfair.com/news/story/who-will-attend-pope-francis-funeral",
    "timestamp": "2025-04-22T20:39:25Z"
  },
  {
    "title": "LOFTUS: Ivory Tower Lib Wants To Launch Ivory Tower Revolution From … You Guessed It, His Ivory Tower",
    "description": "David Brooks wants to launch an ivory tower counter-revolution from his perch in the ivory tower, i.e., The New York Times.",
    "link": "https://dailycaller.com/2025/04/22/david-brooks-new-york-times-civil-unrest-harvard-liberals-trump/",
    "timestamp": "2025-04-22T20:39:09Z"
  },
  {
    "title": "Intel results to spotlight new CEO Tan's strategy",
    "description": "Hopes to reverse years of missteps.",
    "link": "https://www.itnews.com.au/news/intel-results-to-spotlight-new-ceo-tans-strategy-616716?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2025-04-22T20:39:00Z"
  },
  {
    "title": "Intel results to spotlight new CEO Tan's strategy",
    "description": "Hopes to reverse years of missteps.",
    "link": "https://www.itnews.com.au/news/intel-results-to-spotlight-new-ceo-tans-strategy-616716?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Technology+feed",
    "timestamp": "2025-04-22T20:39:00Z"
  },
  {
    "title": "Intel results to spotlight new CEO Tan's strategy",
    "description": "Hopes to reverse years of missteps.",
    "link": "https://www.itnews.com.au/news/intel-results-to-spotlight-new-ceo-tans-strategy-616716?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+",
    "timestamp": "2025-04-22T20:39:00Z"
  },
  {
    "title": "‘Moving at Trump Speed’: White House Has 18 Trade Deal Proposals, Leavitt Says",
    "description": "The White House has “18 proposals on paper” from foreign countries for trade deals, press secretary Karoline Leavitt told reporters on Tuesday. “Again, these are... Read More\nThe post ‘Moving at Trump Speed’: White House Has 18 Trade Deal Proposals, Leavitt S…",
    "link": "https://www.dailysignal.com/2025/04/22/moving-trump-speed-white-house-has-18-trade-deal-proposals-leavitt-says/",
    "timestamp": "2025-04-22T20:38:29Z"
  },
  {
    "title": "US slaps sanctions on Iranian LPG tycoon amid renewed nuclear negotiations",
    "description": "US Treasury Department sanctions Seyed Asadoollah Emamjomeh and his network for orchestrating large-scale exports of Iranian LPG and crude oil, allegedly funding Iran’s nuclear ambitions and proxy groups.",
    "link": "https://www.israelnationalnews.com/news/407236",
    "timestamp": "2025-04-22T20:38:04Z"
  },
  {
    "title": "Millions of SK Telecom customers are potentially at risk following USIM data compromise",
    "description": "SK Telecom warned that threat actors accessed customer Universal Subscriber Identity Module (USIM) info through a malware attack. SK Telecom is South Korea’s largest wireless telecom company, a major player in the country’s mobile and tech landscape. It holds…",
    "link": "https://securityaffairs.com/176802/data-breach/sk-telecom-data-breach.html",
    "timestamp": "2025-04-22T20:37:47Z"
  },
  {
    "title": "‘JD Vance brings misfortune’: Terror attack in India latest calamity to befall Vance’s ‘cursed’ world tour",
    "description": "Global misfortune seems to be following Vice President JD Vance, as he and his family visit India following a trip to the Vatican. \n\n\nOn Sunday, Vance briefly met with Pope Francis, hours prior to the pontiff’s death on Easter Monday. \n\n\n“I just learned of th…",
    "link": "https://www.dailydot.com/debug/jd-vance-india-terror-attack/",
    "timestamp": "2025-04-22T20:37:44Z"
  },
  {
    "title": "IMF Report: Trump Trade War Will Hurt Both U.S. and Global Economies",
    "description": "Since his second term began, President Donald Trump has imposed double-digit tariffs on nearly every nation, sending markets into turmoil. Trump said it",
    "link": "https://reason.com/2025/04/22/imf-report-trump-trade-war-will-hurt-both-u-s-and-global-economies/",
    "timestamp": "2025-04-22T20:36:07Z"
  },
  {
    "title": "Pam Bondi didn't say, 'It's probably a crime to accuse the president of committing a crime after he breaks the law'",
    "description": "A screenshot authentically shows a \"Fox News Sunday\" chyron quoting U.S. Attorney General Pam Bondi as saying, \"It's probably a crime to accuse the president of committing a crime after he breaks the law.\"",
    "link": "https://www.snopes.com//fact-check/law-quote-crime-bondi/",
    "timestamp": "2025-04-22T20:34:00Z"
  },
  {
    "title": "How A Low-Profile Democrat Challenged Trump's Mass Deportations",
    "description": "Sen. Chris Van Hollen, normally more of a behind-the-scenes legislator, has taken center stage in the fight to return wrongly deported Kilmar Abrego Garcia.",
    "link": "https://www.huffpost.com/entry/kilmar-abrego-garcia-van-hollen_n_6807e424e4b00081c708c504",
    "timestamp": "2025-04-22T20:33:46Z"
  },
  {
    "title": "'The Office' star pushes back on MSNBC host blaming Trump, Musk for distrust in media",
    "description": "Actor Rainn Wilson pushed back on MSNBC's Stephanie Ruhle during a podcast discussion about distrust in media, as he called out hypocrisy at left-leaning outlets.",
    "link": "https://www.foxnews.com/media/the-office-star-pushes-back-msnbc-host-blaming-trump-musk-distrust-media",
    "timestamp": "2025-04-22T20:30:58Z"
  },
  {
    "title": "Trump-Linked Lobbyists Are Having a Hopping Good Time",
    "description": "Donald Trump doesn’t talk about “draining the swamp” nearly as much as he did in his first term, but his ultra-populist 2024 campaign was built, at least in part, on an anti-Washington message. Yet despite his attack on so many of Washington’s structures, ear…",
    "link": "https://www.motherjones.com/politics/2025/04/ballard-trump-lobbying-disclosures-wiles-bondi/",
    "timestamp": "2025-04-22T20:30:06Z"
  },
  {
    "title": "Which US sectors face profit misses?",
    "description": "In markets, expectations are everything. And it is safe to say that right now S&amp;P 500 earnings growth for 2025 has a very good chance of being lower than expected.",
    "link": "https://www.bangkokpost.com/opinion/opinion/3009132/which-us-sectors-face-profit-misses-",
    "timestamp": "2025-04-22T20:30:00Z"
  },
  {
    "title": "Trump-era elections in the Anglosphere",
    "description": "The dictionary defines a \"horse whisperer\" as \"someone who is skilled at training horses using gentle, non-violent methods based on understanding horse behaviour and psychology\". By that standard, the only \"Trump-whisperer\" in Europe is Vladimir Putin (althou…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3009202/trump-era-elections-in-the-anglosphere",
    "timestamp": "2025-04-22T20:30:00Z"
  },
  {
    "title": "White House confirms 100 countries want a trade deal with U.S.",
    "description": "Stocks surge on confirmation administration is 'setting the stage' for agreement with CHINA",
    "link": "https://www.wnd.com/2025/04/white-house-confirms-100-countries-want-a-trade-deal-with-u-s/",
    "timestamp": "2025-04-22T20:28:22Z"
  },
  {
    "title": "Democrat Yassamin Ansari Urges More Lawmakers to Travel to El Salvador, Falsely Claims Deportee Is a Teen",
    "description": "Rep. Yassamin Ansari (D-AZ), one of four left-wing House members currently in El Salvador to push for the return of suspected MS-13 gang member Kilmar Abrego Garcia, has called on other lawmakers to travel to the Latin American country to advocate for migrant…",
    "link": "https://www.breitbart.com/politics/2025/04/22/democrat-yassamin-ansari-urges-more-lawmakers-to-travel-to-el-salvador-falsely-claims-deportee-is-a-teen/",
    "timestamp": "2025-04-22T20:27:31Z"
  },
  {
    "title": "Trump House GOP ally on board with tax hike for ultrawealthy to fund 'big, beautiful bill'",
    "description": "Rep. Dan Meuser, R-Penn., is supporting the White House's proposed tax hike for people making more than $1 million.",
    "link": "https://www.foxnews.com/politics/trump-ally-gop-rep-floats-tax-hike",
    "timestamp": "2025-04-22T20:25:55Z"
  },
  {
    "title": "Can Trump Really Deport US Citizens to El Salvador?",
    "description": "President Donald Trump has been testing the boundaries of his authority over US immigration policy since he began his second term of office, but he hinted at taking things to a new level when he said he’d support deporting US citizens to a prison in El Salvad…",
    "link": "https://biztoc.com/x/4c29dc8b537394e4",
    "timestamp": "2025-04-22T20:25:44Z"
  },
  {
    "title": "Trump praises granddaughter’s golf skills, reveals when he thinks she’ll be able to beat him",
    "description": "President Donald Trump praised his granddaughter Kai’s golf skills in a new video she posted recapping her trip to UFC 314 on Monday.",
    "link": "https://nypost.com/2025/04/22/sports/trump-praises-granddaughters-golf-skills-says-she-may-be-able-to-beat-him-someday/",
    "timestamp": "2025-04-22T20:25:19Z"
  },
  {
    "title": "Ukraine presses for ceasefire as Russia reported to offer concession",
    "description": "KYIV (Reuters) - Ukrainian President Volodymyr Zelenskiy on Tuesday said he was prepared to negotiate with Russia \"in any format\" once a ceasefire takes hold while the Financial Times reported that Russian President Vladimir Putin has offered to halt Moscow's…",
    "link": "https://www.thestar.com.my/news/world/2025/04/23/ukraine-presses-for-ceasefire-as-russia-reported-to-offer-concession",
    "timestamp": "2025-04-22T20:25:00Z"
  },
  {
    "title": "'Totally unrealistic': Economics expert scoffs at Trump's trade promise",
    "description": "The Cato Institute's Scott Lincicome quickly poured cold water over the White House’s rosy picture of the international trade war President Donald Trump unleashed with his sweeping set of tariffs.White House Press Secretary Karoline Leavitt on Tuesday told re…",
    "link": "https://www.rawstory.com/trump-tariffs-2671824742/",
    "timestamp": "2025-04-22T20:23:57Z"
  },
  {
    "title": "FDA announces food dye ban",
    "description": "The FDA is phasing out the use of petroleum-based synthetic dyes in food and drinks.",
    "link": "https://www.cnbc.com/2025/04/22/fda-announces-food-dye-ban.html",
    "timestamp": "2025-04-22T20:22:17Z"
  },
  {
    "title": "Ukraine presses for ceasefire as Russia reported to offer concession",
    "description": "Ukrainian President Volodymyr Zelenskiy on Tuesday said he was prepared to negotiate with Russia \"in any format\" once a ceasefire takes hold while the...",
    "link": "https://www.yahoo.com/news/ukraine-presses-ceasefire-russia-reported-202212864.html",
    "timestamp": "2025-04-22T20:22:12Z"
  },
  {
    "title": "DEI rollbacks hit campus support systems for students of color",
    "description": "As U.S. colleges pull back on diversity, equity and inclusion practices, students of color say they are starting to lose all of these things and more.",
    "link": "https://www.nbcnews.com/news/nbcblk/dei-rollbacks-hit-campus-support-systems-students-color-rcna202472",
    "timestamp": "2025-04-22T20:21:47Z"
  },
  {
    "title": "Megyn Kelly Trashes Pope Francis One Day After His Death",
    "description": "Reading Time: 3 minutesMegyn Kelly has an unusual way of paying tribute to a legendary figure. As you may have heard, Pope Francis …\nMegyn Kelly Trashes Pope Francis One Day After His Death was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/04/megyn-kelly-trashes-pope-francis-one-day-after-his-death/",
    "timestamp": "2025-04-22T20:20:59Z"
  },
  {
    "title": "Donald Trump Wants Your Children To Get AI In School So He Looks Like Rambo To Them Too",
    "description": "We must close the Department of Education and get Big Tech subsidies into every school.",
    "link": "https://www.wonkette.com/p/donald-trump-wants-your-children",
    "timestamp": "2025-04-22T20:20:28Z"
  },
  {
    "title": "Laurence Tribe Plays Hitler Card On Trump Over Harvard Funding Pause",
    "description": "Laurence Tribe said that Donald Trump threatening Harvard University's federal funding mirrors Adolf Hitler and other autocrats.",
    "link": "https://dailycaller.com/2025/04/22/laurence-tribe-plays-hitler-card-trump-harvard-funding-pause/",
    "timestamp": "2025-04-22T20:20:23Z"
  },
  {
    "title": "Trump Just Set a Tariff on Solar Panels So High That Your Eyebrows May Raise Involuntarily",
    "description": "The Trump administration is slapping giant tariffs on Southeast Asian-made solar panels — and the figures are so high, you will straight up gasp. As CNN and other outlets report, the United States is seeking tariffs of up to 3,521 percent — yes, you read that…",
    "link": "https://futurism.com/the-byte/trump-tariffs-solar-panels",
    "timestamp": "2025-04-22T20:20:12Z"
  },
  {
    "title": "Tesla’s revenue and profits tank amid political chaos",
    "description": "Tesla released its first quarter financial earnings today, offering another peak into the crisis currently enveloping Elon Musk’s company.  Tesla said it earned $409 million in net income on $19.3 billion in revenue. That represents a 9.4 percent decrease yea…",
    "link": "https://www.theverge.com/news/653645/tesla-q1-earnings-2025-revenue-profit-elon-musk",
    "timestamp": "2025-04-22T20:18:26Z"
  },
  {
    "title": "Food dyes to be phased out by Trump administration in latest round of bans",
    "description": "HHS and FDA announced a ban of petroleum-based synthetic dyes in the nation’s food supply on Tuesday with Secretary Kennedy and Commissioner Makary leading the charge.",
    "link": "https://www.foxnews.com/food-drink/food-dyes-phased-out-trump-administration-latest-round-bans",
    "timestamp": "2025-04-22T20:18:25Z"
  },
  {
    "title": "What “America First” Could Cost Us",
    "description": "E. Tammy Kim on the Trump Administration’s attacks on the Bureau of International Labor Affairs, or ILAB, and what it could mean for workers at home and abroad.",
    "link": "https://www.newyorker.com/news/deep-state-diaries/what-america-first-could-cost-us",
    "timestamp": "2025-04-22T20:16:51Z"
  },
  {
    "title": "Trump Dials PM Modi After Kashmir Attack, Extends \"Full Support\" To India",
    "description": "US President Donald Trump strongly condemned the terror attack in Kashmir&#039;s Pahalgam in a phone call with Prime Minister Narendra Modi and expressed full support to India to bring to justice the perpetrators of this heinous attack.",
    "link": "https://www.ndtv.com/india-news/jammu-and-kashmir-terrorist-attack-donald-trump-calls-pm-modi-condemns-terrorist-attack-in-pahalgam-8230962",
    "timestamp": "2025-04-22T20:15:01Z"
  },
  {
    "title": "Kashmir Massacre: Trump, Putin, Iran, Israel Condemn Jihadist Attack on Hindu Tourists",
    "description": "A leisurely afternoon at the Baisaran meadows near Pahalgam—a pasture in Jammu and Kashmir—turned into carnage on April 22.",
    "link": "https://www.newsweek.com/kashmir-massacre-trump-putin-iran-israel-condemn-jihadist-attack-hindu-tourists-2062760",
    "timestamp": "2025-04-22T20:14:06Z"
  },
  {
    "title": "Tesla Earnings: Elon Musk’s Firm Reports Worst Quarterly Profit Since 2021",
    "description": "Tesla's $19.3 billion revenue was far below analyst forecasts of $21.3 billion.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/22/tesla-earnings-elon-musks-firm-reports-worst-quarterly-profit-since-2021/",
    "timestamp": "2025-04-22T20:13:03Z"
  },
  {
    "title": "Joy Behar worries Pope Francis will be replaced by 'conservative guy'",
    "description": "\"The View\" co-host Joy Behar worried on Tuesday that Pope Francis, who passed away on Monday, might be replaced as head of the Catholic Church by a \"conservative guy.\"",
    "link": "https://www.foxnews.com/media/joy-behar-worries-pope-francis-replaced-conservative-guy",
    "timestamp": "2025-04-22T20:12:39Z"
  },
  {
    "title": "Watch Live: RFK Jr. Announces Federal Ban on Food Dyes",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. announces a federal ban on food dyes on Tuesday, April 22.\nThe post Watch Live: RFK Jr. Announces Federal Ban on Food Dyes appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/22/watch-live-rfk-jr-announces-federal-ban-on-food-dyes/",
    "timestamp": "2025-04-22T20:12:29Z"
  },
  {
    "title": "'Now is our time': Despite tariffs, China's Silicon Valley is ready to make its mark on the world",
    "description": "The city of Hangzhou is one of the most historic and beautiful in China.",
    "link": "https://news.sky.com/story/now-is-our-time-despite-tariffs-chinas-silicon-valley-is-ready-to-make-its-mark-on-the-world-13353945",
    "timestamp": "2025-04-22T20:11:00Z"
  },
  {
    "title": "Bitcoin breaks downtrend with spike toward $92.6K, but who’s behind the price momentum?",
    "description": "Bitcoin (BTC) price surged over the Easter weekend, jumping 9% and crossing the $91,000 threshold on April 22. This strong performance diverged sharply from the stock market’s lukewarm rebound and mirrored gold’s bullish behavior, which briefly touched a new …",
    "link": "https://cointelegraph.com/news/bitcoin-breaks-downtrend-with-spike-toward-92-6k-but-who-s-behind-the-price-momentum",
    "timestamp": "2025-04-22T20:09:44Z"
  },
  {
    "title": "Cops in Brussels seize Palestinian activist on the city's streets",
    "description": "Arrest of Mohammed Khatib signals that repression is about to get worse.",
    "link": "https://electronicintifada.net/blogs/david-cronin/cops-brussels-seize-palestinian-activist-citys-streets",
    "timestamp": "2025-04-22T20:09:13Z"
  },
  {
    "title": "China tariff war worries and more: What to expect from Apple's Q2 2025 earnings",
    "description": "Even though the saga started after the fiscal quarter ended, Apple's Q2 financial results are going to be profoundly different thanks to the Trump tariffs. Here's what to expect from the results on May 1.Apple CEO Tim CookAs regular as clockwork, Apple will b…",
    "link": "https://appleinsider.com/articles/25/04/22/china-tariff-war-worries-and-more-what-to-expect-from-apples-q2-2025-earnings",
    "timestamp": "2025-04-22T20:08:59Z"
  },
  {
    "title": "Joe Exotic’s Husband: Meet Jorge Marquez & the Tiger King’s Ex-Husbands",
    "description": "Joe has married his new husband, Jorge, behind bars while serving his 21-year prison sentence. Learn all about their marriage and Joe's exes here.",
    "link": "https://hollywoodlife.com/feature/joe-exotic-husband-5382334/",
    "timestamp": "2025-04-22T20:08:36Z"
  },
  {
    "title": "Trump administration mulling $5,000 ‘baby bonus’ payments to encourage women to have more children",
    "description": "Trump administration mulling $5,000 ‘baby bonus’ payments to encourage women to have more childrenmlive.com",
    "link": "https://www.mlive.com/news/2025/04/trump-administration-mulling-5000-baby-bonus-payments-to-encourage-women-to-have-more-children.html",
    "timestamp": "2025-04-22T20:08:25Z"
  },
  {
    "title": "How the culture wars influenced Trump's first 100 days",
    "description": "On the campaign trail, candidate Donald Trump decried \"gender ideology,\" said the military was becoming too \"woke,\" and that DEI programs across the federal government should be ended. As president, his executive actions & policies have mirrored his campaign …",
    "link": "https://www.npr.org/2025/04/22/1246322309/podcast-trump-culture-war",
    "timestamp": "2025-04-22T20:08:24Z"
  },
  {
    "title": "Appeasing Donald Trump Won’t Work",
    "description": "Big Law is learning this lesson—Columbia too. Harvard, meanwhile, is putting on a master class in how powerful institutions can fight back.",
    "link": "https://www.vanityfair.com/news/story/donald-trump-harvard-resistance",
    "timestamp": "2025-04-22T20:07:00Z"
  },
  {
    "title": "'They will keep losing': Critics cheer as Trump told to reverse shutdown of news service",
    "description": "A federal judge ordered President Donald Trump to restart a critical public news service his administration shuttered, Politico's Kyle Cheney reported on Tuesday.In the lawsuit Widakuswara v. Lake, Texas-based U.S. District Judge Royce Lamberth, a jurist appo…",
    "link": "https://www.rawstory.com/trump-voice-of-america-2671823491/",
    "timestamp": "2025-04-22T20:05:36Z"
  },
  {
    "title": "Trump Admin to Overhaul Database Used to Track Noncitizens’ Status",
    "description": "The Trump administration announced Tuesday the overhaul of an online database used to verify the status of noncitizens in the U.S. The changes to the... Read More\nThe post Trump Admin to Overhaul Database Used to Track Noncitizens’ Status appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/04/22/trump-administration-will-overhaul-database-used-track-illegal-immigrants-status/",
    "timestamp": "2025-04-22T20:04:44Z"
  }
]