[
  {
    "title": "From asset to liability: The strategic price of Israel’s messianic turn",
    "description": "Israel's renewed war in Gaza is a diplomatic liability that reduces Israeli influence over US foreign policy.",
    "link": "https://www.jpost.com/opinion/article-854552",
    "timestamp": "2025-05-19T23:46:33Z"
  },
  {
    "title": "Trump blasts celebs that backed Harris",
    "description": "Despite his victory in the 2024 election and notwithstanding his reentry into the halls of power, President Donald Trump is nevertheless obviously still quite upset over former Vice President Kamala Harris' ability to attract star power.",
    "link": "https://www.bostonherald.com/2025/05/19/trump-calls-for-investigation-into-why-more-celebrities-liked-harris/",
    "timestamp": "2025-05-19T23:45:59Z"
  },
  {
    "title": "BREAKING — WHO Pandemic Agreement Approved by Member States, Ushering in a Dangerous New World Health Order",
    "description": "BREAKING — WHO Pandemic Agreement Approved by Member States, Ushering in a Dangerous New World Health Orderthefocalpoints.com",
    "link": "https://www.thefocalpoints.com/p/breaking-who-pandemic-agreement-approved",
    "timestamp": "2025-05-19T23:45:32Z"
  },
  {
    "title": "Urologist Tells Megyn Kelly How Alleged Early Prostate Treatments Could Have Impaired Biden’s Mental Health",
    "description": "Urologist Dr. David Samadi told Megyn Kelly alleged early prostate treatments could have impaired former President Joe Biden's mental fitness.",
    "link": "https://dailycaller.com/2025/05/19/urologist-dr-david-samadi-megyn-kelly-joe-biden-prostate-cancer-treatment/",
    "timestamp": "2025-05-19T23:41:35Z"
  },
  {
    "title": "DEVIL’S ISLAND 2.0: Macron’s France To Build New High-Security Prison in the Tropical Jungle of French Guiana, Near the Site of One of the World’s Most Infamous Hell-Holes",
    "description": "After unchecked French Organized Crime Gangs promoted nightly attacks against prisons, it appears that Paris will at long last start thinking seriously about tackling the problem – even if they go about it in a surprising way.\nThe post DEVIL’S ISLAND 2.0: Mac…",
    "link": "https://www.thegatewaypundit.com/2025/05/devils-island-2-0-macrons-france-build-new/",
    "timestamp": "2025-05-19T23:40:10Z"
  },
  {
    "title": "What We Know About The Trump Administration’s Reported Settlement With Ashli Babbitt’s Family",
    "description": "The family of Ashli Babbitt filed a lawsuit in early 2024 seeking $30 million in damages.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/05/19/what-we-know-about-the-trump-administrations-reported-settlement-with-ashli-babbitts-family/",
    "timestamp": "2025-05-19T23:37:14Z"
  },
  {
    "title": "DOGE's Social Security 'Fraud Hunt' Exposed As Sham That Delayed Payments",
    "description": "An internal Trump administration document reportedly shows that anti-fraud checks recently installed at the Social Security agency have found just two cases of potentially improper benefit claims out of more than 110,000—a rate of 0.0018%.\n\n\nThe documents, fi…",
    "link": "https://crooksandliars.com/2025/05/doges-social-security-fraud-hunt-exposed",
    "timestamp": "2025-05-19T23:35:11Z"
  },
  {
    "title": "Trump Signs Bill Cracking Down on Deepfake Revenge Porn (Bloomberg)",
    "description": "Bloomberg:\nTrump Signs Bill Cracking Down on Deepfake Revenge Porn  —  President Donald Trump signed a bill to force social media companies to remove non-consensual sharing of explicit sexual imagery online, calling it a “horribly wrong” situation.  —  “With …",
    "link": "https://www.memeorandum.com/250519/p133",
    "timestamp": "2025-05-19T23:35:00Z"
  },
  {
    "title": "Trump must make China pay for the death and misery its COVID virus unleashed",
    "description": "Punitive measures against the Chinese economy won’t bring back the victims of COVID — but they must not be forgotten: That's part of the moral imperative to constraining Beijing.",
    "link": "https://nypost.com/2025/05/19/opinion/trump-must-make-china-pay-for-the-death-and-misery-of-covid/",
    "timestamp": "2025-05-19T23:34:03Z"
  },
  {
    "title": "I’m a Trump-Loving Springsteen Fanatic, and the Cognitive Dissonance Is Finally Catching Up with Me",
    "description": "“Bruce Springsteen has spoken out against the White House again after President Donald Trump called him a ‘dried-out prune’ on social media. Speaking in Manchester, England, the musician criticized the government for the second time during his Land of Hopes a…",
    "link": "https://www.mcsweeneys.net/articles/im-a-trump-loving-springsteen-fanatic-and-the-cognitive-dissonance-is-finally-catching-up-with-me",
    "timestamp": "2025-05-19T23:30:00Z"
  },
  {
    "title": "‘Revenge porn’: Trump signs bill criminalizing online sexual exploitation",
    "description": "Imposes penalties for creating deepfake images using artificial intelligence",
    "link": "https://www.wnd.com/2025/05/revenge-porn-trump-signs-bill-criminalizing-online-sexual-exploitation/",
    "timestamp": "2025-05-19T23:27:37Z"
  },
  {
    "title": "Why Democrats shouldn’t get too excited about Trump’s lousy polls",
    "description": "Democrats have a lot to be excited about when they look at President Donald Trump’s polls. Scores of voters have soured on his job performance since he took office. And that group of unhappy voters includes some of Trump’s new 2024 converts — the young voters…",
    "link": "https://www.vox.com/politics/413563/trump-democrats-midterm-election-unpopular-young-black-latino-disapprove-polls",
    "timestamp": "2025-05-19T23:26:29Z"
  },
  {
    "title": "Subaru of America increases vehicle prices, citing market conditions",
    "description": "Subaru of America is hiking prices on several models, the company said on Monday, the latest automaker to pass along cost increases to consumers.",
    "link": "https://www.cnbc.com/2025/05/19/subaru-of-america-increases-vehicle-prices-citing-market-conditions.html",
    "timestamp": "2025-05-19T23:26:02Z"
  },
  {
    "title": "US to pay $5m to family of 6 January rioter Ashli Babbitt",
    "description": "It would settle a wrongful death suit brought by the family of Ashli Babbitt, who was fatally shot by police while breaching the US Capitol.",
    "link": "https://www.bbc.co.uk/news/articles/c4gr3kdxkr7o",
    "timestamp": "2025-05-19T23:25:05Z"
  },
  {
    "title": "US to pay $5m to family of 6 January rioter Ashli Babbitt",
    "description": "It would settle a wrongful death suit brought by the family of Ashli Babbitt, who was fatally shot by police while breaching the US Capitol.",
    "link": "https://www.bbc.com/news/articles/c4gr3kdxkr7o",
    "timestamp": "2025-05-19T23:25:05Z"
  },
  {
    "title": "Beware AI-generated audio claiming Qatari leader said he regrets inviting Trump to Middle East",
    "description": "A video authentically shows the emir of Qatar, Sheikh Tamim bin Hamad Al Thani, saying he regrets inviting U.S. President Donald Trump to the Middle East.",
    "link": "https://www.snopes.com//fact-check/ai-audio-trump-middle-east/",
    "timestamp": "2025-05-19T23:25:00Z"
  },
  {
    "title": "Watch Live: Donald Trump Hosts Kennedy Center Board Dinner",
    "description": "President Donald Trump hosts the board members of the Kennedy Center for a dinner at the White House on Monday, May 19.\nThe post Watch Live: Donald Trump Hosts Kennedy Center Board Dinner appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/05/19/watch-live-donald-trump-hosts-kennedy-center-board-dinner/",
    "timestamp": "2025-05-19T23:24:58Z"
  },
  {
    "title": "US Senate Democratic leader proposes ban on foreign Air Force One planes",
    "description": "WASHINGTON, May 19 (Reuters) - U.S. Senate Democratic leader Chuck Schumer on Monday introduced a bill that would prevent any foreign aircraft from being used as Air Force One, the aircraft that transports the U.S. president. Schumer introduced the \"President…",
    "link": "https://freerepublic.com/focus/f-news/4317975/posts",
    "timestamp": "2025-05-19T23:24:30Z"
  },
  {
    "title": "ROOKE: Trump Just Got Permission To Say ‘¡Adiós!’ To Biden’s Posse",
    "description": "It looks like some of the Venezuelans Biden let in during his term potentially just lost their protected status, opening the door for action from Trump.",
    "link": "https://dailycaller.com/2025/05/19/rooke-trump-scotus-venezuelan-noem-temporary-protected-status/",
    "timestamp": "2025-05-19T23:23:05Z"
  },
  {
    "title": "Trump and Melania Sign Take It Down Act",
    "description": "President Donald Trump signed a bill to force social media companies to remove non-consensual sharing of explicit sexual imagery online, calling it a “horribly wrong” situation.\n“With the rise of AI image generation, countless women have been harassed with de…",
    "link": "https://biztoc.com/x/0ace7418457274be",
    "timestamp": "2025-05-19T23:21:56Z"
  },
  {
    "title": "LA Port shipments fell 30% in early May after Trump tariffs",
    "description": "Inbound shipments to the Port of Los Angeles — the busiest container hub in the US — dropped as much as 30% in early May as President Donald Trump’s tariffs discourage trade.\n“Fewer containers mean less work on the waterfront, from the number of labor gangs t…",
    "link": "https://biztoc.com/x/74889a44e96fe6b9",
    "timestamp": "2025-05-19T23:21:45Z"
  },
  {
    "title": "Has Donald Trump abandoned Ukraine?",
    "description": "After a phone call with Putin, the US leader seems ready to ditch his vow to end Russia’s war on its neighbour",
    "link": "https://biztoc.com/x/675edc7697911945",
    "timestamp": "2025-05-19T23:21:39Z"
  },
  {
    "title": "Owners of luxe steakhouse opening in Trump-owned building used COVID funds for personal expenses: lawsuit",
    "description": "Maple Hospitality Group, the owners behind Maple & Ash, was accused of “fraudulently” tapping  $7.6 million in Small Business Paycheck Protection Program funds, according to the civil suit.…",
    "link": "https://nypost.com/2025/05/19/business/owners-of-luxe-steakhouse-opening-in-trump-owned-building-used-covid-funds-for-personal-expenses-lawsuit/",
    "timestamp": "2025-05-19T23:21:11Z"
  },
  {
    "title": "Bernie Sanders Backstabs the Democratic Party in Brutally Honest Interview",
    "description": "This story originally appeared on vigilantfox.com and was republished with permission.\nThe post Bernie Sanders Backstabs the Democratic Party in Brutally Honest Interview appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/bernie-sanders-backstabs-democratic-party-brutally-honest-interview/",
    "timestamp": "2025-05-19T23:20:23Z"
  },
  {
    "title": "President Trump confident Putin wants peace with Ukraine, thinks he's 'had enough' of war",
    "description": "Following years of outright conflict in Ukraine, President Donald Trump said that he believes Russian President Vladimir Putin wants peace between the two countries.",
    "link": "https://www.foxnews.com/politics/president-trump-confident-putin-wants-peace-ukraine-thinks-hes-had-enough-war",
    "timestamp": "2025-05-19T23:20:20Z"
  },
  {
    "title": "US top court allows Trump admin to revoke protected status for Venezuelans",
    "description": "Supreme Court lets Trump terminate Temporary Protected Status for hundreds of thousands of people from Venezuela.",
    "link": "https://www.aljazeera.com/news/2025/5/19/chk_us-top-court-allows-trumpadmintorevoke-protected-status-for-venezuelans",
    "timestamp": "2025-05-19T23:18:50Z"
  },
  {
    "title": "Report: Russian Economic Growth Plummets After Trump Takes Office",
    "description": "Russia’s state statistical agency, Rosstat, reported on Friday that first-quarter gross domestic product (GDP) growth was only 1.4 percent, a steep decline from 4.5 percent growth in the last quarter of 2024.\nThe post Report: Russian Economic Growth Plummets …",
    "link": "https://www.breitbart.com/economy/2025/05/19/report-russian-economic-growth-plummets-after-trump-takes-office/",
    "timestamp": "2025-05-19T23:17:28Z"
  },
  {
    "title": "Trump admin live updates: Melania Trump with president at 'Take it Down Act' signing",
    "description": "President Trump and first lady Melania Trump teamed up on Monday for the signing of the \"Take it Down Act.\"",
    "link": "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=121939393",
    "timestamp": "2025-05-19T23:17:05Z"
  },
  {
    "title": "Nicolle Wallace: Trump can't 'delude his base' anymore on tariffs",
    "description": "President Donald Trump lashed out at Walmart after the retailer said they will have to raise prices due to tariffs. @ Nicolle Wallace ...",
    "link": "https://biztoc.com/x/655fc9d2fbbbcb49",
    "timestamp": "2025-05-19T23:15:45Z"
  },
  {
    "title": "Ashli Babbitt’s family to get nearly $5M in government settlement: Reports",
    "description": "– The U.S. government has agreed to pay nearly $5 million to the family of Ashli Babbitt, the Jan. 6 rioter who was fatally shot by police during the 2021 attack on the Capitol, according to multiple reports on Monday. The Washington Post first reported the s…",
    "link": "https://freerepublic.com/focus/f-news/4317973/posts",
    "timestamp": "2025-05-19T23:12:52Z"
  },
  {
    "title": "'Nonprofit Killer' Pulled From GOP Tax Bill—For Now",
    "description": "While welcoming the removal of legislation in House Republicans' budget reconciliation package that would empower U.S. President Donald Trump's administration to revoke the tax-exempt status of any nonprofit it deems supportive of a terrorist organization, ri…",
    "link": "https://www.commondreams.org/news/nonprofit-killer-bill-removed",
    "timestamp": "2025-05-19T23:12:30Z"
  },
  {
    "title": "Donald Trump Jr. Mocks Jill Biden Over Joe Biden's Cancer Diagnosis",
    "description": "Donald Trump's eldest son is providing his take on Joe Biden's challenging health journey. \nAfter the former president shared that he was diagnosed with an advanced form of prostate cancer, Donald...",
    "link": "https://www.eonline.com/news/1417743/joe-biden-cancer-donald-trump-jr-mocks-jill-biden",
    "timestamp": "2025-05-19T23:09:53Z"
  },
  {
    "title": "Trump Allows Halted NY Offshore Wind Project to Resume Work",
    "description": "The Donald Trump administration has lifted an order that halted construction on a $5 billion wind energy project off the coast of New York.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-allows-halted-ny-offshore-wind-project-to-resume-work",
    "timestamp": "2025-05-19T23:09:03Z"
  },
  {
    "title": "Misri pins Trump claim on ceasefire decision",
    "description": "New Delhi, May 19: Foreign Secretary Vikram Misri told a parliamentary committee on Monday that the conflict between India and Pakistan was always in the conventional domain, and there was no nuclear signalling by the neighbouring country, sources said. The s…",
    "link": "https://thehillstimes.in/national/misri-pins-trump-claim-on-ceasefire-decision",
    "timestamp": "2025-05-19T23:05:00Z"
  },
  {
    "title": "Trump Calls for 'Major Investigations' Into Beyoncé and Oprah Over Kamala Harris Payment Claims",
    "description": "The president called the entertainers' support of Harris \"unlawful and corrupt\" on Truth Social.",
    "link": "https://www.complex.com/music/a/cmplxtara-mahadevan/donald-trump-beyonce-oprah-investigated-alleged-kamala-harris-payment",
    "timestamp": "2025-05-19T23:04:09Z"
  },
  {
    "title": "Why This Republican Lawmaker Is a ‘No’ for Now on ‘Big, Beautiful Bill’",
    "description": "Texas Republican Rep. Keith Self would vote against his party’s budget reconciliation bill as it currently stands. “I am a ‘no’ at the moment,” he... Read More\nThe post Why This Republican Lawmaker Is a ‘No’ for Now on ‘Big, Beautiful Bill’ appeared first on …",
    "link": "https://www.dailysignal.com/2025/05/19/why-this-republican-is-no-now-big-beautiful-bill/",
    "timestamp": "2025-05-19T23:03:47Z"
  },
  {
    "title": "Whoopi Claims: No Biden ‘Health Cover-Up,’ Trump Could Be Deported",
    "description": "Whoopi Claims: No Biden ‘Health Cover-Up,’ Trump Could Be Deportednewsbusters.org",
    "link": "https://newsbusters.org/blogs/nb/nicholas-fondacaro/2025/05/19/whoopi-claims-no-biden-health-cover-trump-could-be-deported",
    "timestamp": "2025-05-19T23:00:43Z"
  },
  {
    "title": "Trump appointee hunting for 'norm-busting fights' that could be 'transformational': report",
    "description": "President Donald Trump's chair of the Federal Communications Commission began going after the media deemed \"unfriendly\" to the president straight away. Now he's picking \"norm-busting fights with the mainstream media,\" according to Politico.In a Monday report …",
    "link": "https://www.rawstory.com/trump-fcc/",
    "timestamp": "2025-05-19T23:00:24Z"
  },
  {
    "title": "Ashli Babbitt's family settles wrongful death lawsuit for nearly $5 million",
    "description": "The family of Ashli Babbitt, the San Diego woman who was shot and killed during the Jan. 6, 2021, U.S. Capitol breach, has settled its wrongful death lawsuit with the federal government for nearly $5 million, it was reported Monday.",
    "link": "https://www.kpbs.org/news/politics/2025/05/19/ashli-babbitts-family-settles-wrongful-death-lawsuit-for-nearly-5-million",
    "timestamp": "2025-05-19T22:59:34Z"
  },
  {
    "title": "Trump admin ordered to ask for wrongly deported man's return",
    "description": "The United States 4th Circuit Court of Appeals ruled on Monday that President Donald Trump's administration must ask El Salvador to return Daniel Lozano-Camargo, a Venezuelan deported there in March.T...",
    "link": "https://biztoc.com/x/bfc6b69a353847a0",
    "timestamp": "2025-05-19T22:59:18Z"
  },
  {
    "title": "The Biden Cover-Up Scandal Just Got WORSE",
    "description": "LIVE on “The Tony Kinnett Cast” at 7 p.m. EDT: Former President Joe Biden’s announcement of his advanced prostate cancer one day after Axios’ release... Read More\nThe post The Biden Cover-Up Scandal Just Got WORSE appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/19/tony-kinnett-cast-biden-coverup-scandal/",
    "timestamp": "2025-05-19T22:58:14Z"
  },
  {
    "title": "Sources contradict Trump narrative about Qatar offering plane as ‘gift’ | CNN Politics",
    "description": "The Trump administration first approached Qatar to inquire about acquiring a Boeing 747 that could be used as Air Force One by President Donald Trump, four sources familiar with the discussions told CNN. That’s contrary to the narrative from the president tha…",
    "link": "https://www.cnn.com/2025/05/19/politics/trump-adminstration-approached-qatar-jet",
    "timestamp": "2025-05-19T22:57:47Z"
  },
  {
    "title": "Trump Honors Police – Four Months After Freeing Hundreds Of Felons Who Assaulted Them",
    "description": "Trump’s Day 1 pardons set free some 400 domestic terrorists who attacked police on Jan. 6, 2021, to help his attempted self-coup to remain in power.",
    "link": "https://www.huffpost.com/entry/trump-police-jan-6-pardons_n_682b9217e4b095274fad02e3",
    "timestamp": "2025-05-19T22:56:33Z"
  },
  {
    "title": "Judge Tosses BS Trespassing Charges From ‘Military Zones’ Hastily Erected At Southern Border",
    "description": "It’s not enough to simply go after anyone looking kinda Venezuelan these days. DHS components have an unquenchable thirst for arrest stats, especially now that Trump’s second Oval Office stay has removed any remaining discretion and restraint from border cont…",
    "link": "https://www.techdirt.com/2025/05/19/judge-tosses-bs-trespassing-charges-from-military-zones-hastily-erected-at-southern-border/",
    "timestamp": "2025-05-19T22:51:55Z"
  },
  {
    "title": "Judge orders Trump administration to allow attorneys access to Venezuelan man in Salvadoran prison",
    "description": "It’s the first such order in the mounting legal saga surrounding President Donald Trump’s use of the Alien Enemies Act to deport hundreds of men to a supermax prison in El Salvador.",
    "link": "https://www.nbcnews.com/news/us-news/venezuelan-man-admitted-us-refugee-sent-salvadoran-prison-rcna207642",
    "timestamp": "2025-05-19T22:49:45Z"
  },
  {
    "title": "I'm sorry Biden has cancer. But lies about his health make the timing suspicious. | Opinion - NewsBreak",
    "description": "Let me start by sending my sincere sympathy to former President Joe Biden and his family about his cancer diagnosis. I hope he’s able to receive effective",
    "link": "https://www.newsbreak.com/share/4014511358835-i-m-sorry-biden-has-cancer-but-lies-about-his-health-make-the-timing-suspicious-opinion?_f=app_share&amp;pd=06E48PGR&amp;lang=en_US&amp;send_time=1747694956&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.14.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_blend_exp_25q2-v6%2Cns_foryou_rank_exp_25q2-v3%2Cns_foryou_recall_exp_25q2-v8%2Cns_local_strategy_25q1_exp-v16&amp;s=i2",
    "timestamp": "2025-05-19T22:49:44Z"
  },
  {
    "title": "Trump Suggests Biden Diagnosis Could Be Part Of Bigger Conspiracy",
    "description": "President Donald Trump suggested on Monday that there may be a larger conspiracy at work following former President Joe Biden’s cancer diagnosis.",
    "link": "https://dailycaller.com/2025/05/19/donald-trump-joe-biden-cancer-diagnosis-conspiracy-cover-up/",
    "timestamp": "2025-05-19T22:49:43Z"
  },
  {
    "title": "The SAVE Act Could Threaten Voting Access for Many Women—And Repeat History",
    "description": "The 1907 Expatriation Act made it impossible for some women born in the U.S. to vote and set back the cause of full citizenship for women.",
    "link": "https://time.com/7280834/save-act-voting-access-history/",
    "timestamp": "2025-05-19T22:47:55Z"
  },
  {
    "title": "Obama-Appointed Judge Blocks Trump’s Bid to Revamp Institute of Peace",
    "description": "A federal district court judge has blocked President Donald Trump’s efforts to reform the U.S. Institute of Peace by firing personnel and changing the agency’s... Read More\nThe post Obama-Appointed Judge Blocks Trump’s Bid to Revamp Institute of Peace appeare…",
    "link": "https://www.dailysignal.com/2025/05/19/obama-appointed-judge-blocks-reform-government-agency/",
    "timestamp": "2025-05-19T22:45:00Z"
  },
  {
    "title": "Trump's call with Putin exposes shifting ground on Ukraine peace talks",
    "description": "Statements from both world leaders reveal two very different realities about ending the war in Ukraine.",
    "link": "https://www.bbc.com/news/articles/c4ge7jq0px2o",
    "timestamp": "2025-05-19T22:44:02Z"
  },
  {
    "title": "Joe Biden’s cancer cover-up echoes this past White House scandal",
    "description": "Democrats realize they're caught in a trap of their own making, so they want to \"move on\" toward the future. Republicans can't let that happen.",
    "link": "https://nypost.com/2025/05/19/opinion/joe-bidens-cancer-cover-up-echoes-past-white-house-scandal/",
    "timestamp": "2025-05-19T22:43:30Z"
  },
  {
    "title": "Trump allies shift from well-wishes to suggesting Biden hid his cancer diagnosis",
    "description": "An initial wave of bipartisan sympathy for Joe Biden’s cancer diagnosis has begun to ebb, giving way to suggestions from Trump allies of a cover-up.",
    "link": "https://www.nbcnews.com/politics/joe-biden/trump-allies-suggest-biden-hid-cancer-diagnosis-rcna207659",
    "timestamp": "2025-05-19T22:41:54Z"
  },
  {
    "title": "Trump Lets First Lady Melania Sign a Bill She Helped Champion Through Congress",
    "description": "President Donald Trump invited Melania Trump to sign the \"Take it Down Act,\" a bipartisan bill regarding online explicit materials.",
    "link": "https://www.westernjournal.com/trump-first-lady-melania-sign-bill-helped-champion-congress/",
    "timestamp": "2025-05-19T22:39:35Z"
  },
  {
    "title": "Pope Leo XIV: The right leader for a church in crisis",
    "description": "American Catholics didn't want an American pope.\n\nThe idea was off the table because everyone told them it was unrealistic. How could the world's cardinals go into the conclave and give the world a pope from the world's only superpower?\n\nAlthough the media ha…",
    "link": "https://www.theblaze.com/align/pope-leo-xiv-the-right-leader-for-a-church-in-crisis",
    "timestamp": "2025-05-19T22:37:28Z"
  },
  {
    "title": "Trump’s warm welcome for white refugees was a diplomatic shot across South Africa’s bow",
    "description": "The farmer issue was just the opening act: The real threat to US national security is how South Africa's government is cozying up to America's adversaries.",
    "link": "https://nypost.com/2025/05/19/opinion/trumps-welcome-for-white-refugees-a-south-africa-warning/",
    "timestamp": "2025-05-19T22:37:13Z"
  },
  {
    "title": "Bloomberg Journalist Among Anti-Israel Radicals Arrested for Storming Columbia Library",
    "description": "Bloomberg journalist Jason Kao was among those arrested at Columbia University during a violent takeover of the school's Butler Library earlier this month, the Washington Free Beacon has learned.\nThe post Bloomberg Journalist Among Anti-Israel Radicals Arrest…",
    "link": "https://freebeacon.com/campus/bloomberg-journalist-among-anti-israel-radicals-arrested-for-storming-columbia-library/",
    "timestamp": "2025-05-19T22:35:50Z"
  },
  {
    "title": "Trump calls for 'major investigation' into Kamala Harris' celebrity endorsements",
    "description": "President Trump has called for a \"major investigation\" into several celebrity endorsements Kamala Harris received during the 2024 presidential campaign.",
    "link": "https://abcnews.go.com/US/trump-calls-major-investigation-kamala-harris-celebrity-endorsements/story?id=121965462",
    "timestamp": "2025-05-19T22:34:42Z"
  },
  {
    "title": "Putin just showed Trump how little he needs him",
    "description": "“The root causes of the conflict.” These were startling words from a man purportedly on the path to peace.But it is the nub of Russian President Vladimir Putin’s position of what must be solved for peace, after two weeks, or three months, depending on how you…",
    "link": "https://freerepublic.com/focus/f-news/4317966/posts",
    "timestamp": "2025-05-19T22:34:21Z"
  },
  {
    "title": "Supreme Court attacks are a fool’s game for GOP — even when rulings don’t go Trump’s way",
    "description": "Some of the very Republicans who fought for decades to bring the court back in line with the Constitution seem to have forgotten what that long battle was all about.",
    "link": "https://nypost.com/2025/05/19/opinion/supreme-court-attacks-are-a-fools-game-for-gop-even-when-rulings-dont-go-trumps-way/",
    "timestamp": "2025-05-19T22:32:36Z"
  },
  {
    "title": "There’s No Love Like the Democrats’ Love of Illegal Alien Criminals",
    "description": "What is the greatest love of all? As Whitney Houston sang, it’s “Learning to love yourself.” To poet Eman Awad, the greatest love is “The... Read More\nThe post There’s No Love Like the Democrats’ Love of Illegal Alien Criminals appeared first on The Daily Sig…",
    "link": "https://www.dailysignal.com/2025/05/19/theres-no-love-like-the-democrats-love-of-illegal-alien-criminals/",
    "timestamp": "2025-05-19T22:31:24Z"
  },
  {
    "title": "3 sticky issues standing in the way of Trump's big bill — and how GOP leaders are trying to resolve them:",
    "description": "It’s a huge week for House Republicans as they seek to pass a massive bill for President Donald Trump’s agenda through their narrow majority along party lines.",
    "link": "https://www.nbcnews.com/politics/politics-news/3-sticky-issues-trump-bill-gop-leaders-resolve-politics-desk-rcna207825",
    "timestamp": "2025-05-19T22:30:44Z"
  },
  {
    "title": "Bernie Sanders agrees Democratic Party is 'threat to democracy,' removed process from its constituents",
    "description": "Sen. Bernie Sanders agreed with the \"Flagrant\" podcast hosts arguing that the Democratic Party was a threat to democracy during an interview on Monday.",
    "link": "https://www.foxnews.com/media/bernie-sanders-agrees-democratic-party-threat-democracy-removed-process-from-its-constituents",
    "timestamp": "2025-05-19T22:30:35Z"
  },
  {
    "title": "Trump says Russia and Ukraine to ‘immediately’ talk peace deal after call with Putin",
    "description": "Trump says Russia and Ukraine to ‘immediately’ talk peace deal after call with Putin7news.com.au",
    "link": "https://7news.com.au/news/trump-says-russia-and-ukraine-to-immediately-talk-peace-deal-after-two-hour-call-with-putin-c-18747589",
    "timestamp": "2025-05-19T22:30:30Z"
  },
  {
    "title": "Paying heavy price for hostages is a strength, not a weakness, Gantz says",
    "description": "While most Israelis did not want to govern the Palestinians, they were also not willing to risk national security, Gantz added.",
    "link": "https://www.jpost.com/israel-news/politics-and-diplomacy/article-854655",
    "timestamp": "2025-05-19T22:27:41Z"
  },
  {
    "title": "Poll: Majority Say 'Lowering the Cost of Living' Should Be Top Trump Priority",
    "description": "A majority of likely general election voters believe President Donald Trump's top priority should be \"lowering the cost of living,\" a recent Cygnal survey revealed.\nThe post Poll: Majority Say ‘Lowering the Cost of Living’ Should Be Top Trump Priority appeare…",
    "link": "https://www.breitbart.com/politics/2025/05/19/poll-majority-say-lowering-the-cost-of-living-should-be-top-trump-priority/",
    "timestamp": "2025-05-19T22:22:57Z"
  },
  {
    "title": "Trump calls Biden's cancer diagnosis 'very sad' while questioning timeline: 'Wasn't informed'",
    "description": "Trump expressed sympathy over Biden's prostate cancer diagnosis while raising concerns about the timing of its public announcement during a Monday press conference.",
    "link": "https://www.foxnews.com/politics/trump-calls-bidens-cancer-diagnosis-very-sad-questioning-timeline-wasnt-informed",
    "timestamp": "2025-05-19T22:22:09Z"
  },
  {
    "title": "Trump Administration Reaches Major Settlement with Ashli Babbitt's Family: Report",
    "description": "\"We love Ashli, and it was so horrible what happened to her. That man [who] shot Ashli is a disgrace and then he goes on television and...\"",
    "link": "https://www.westernjournal.com/trump-administration-reaches-major-settlement-ashli-babbitts-family-report/",
    "timestamp": "2025-05-19T22:19:59Z"
  },
  {
    "title": "Peace with the entire Middle East is on the table now",
    "description": "US President Donald Trump’s efforts in the Middle East may be creating the conditions Israel needs to achieve peace.",
    "link": "https://www.jpost.com/opinion/article-854570",
    "timestamp": "2025-05-19T22:19:51Z"
  },
  {
    "title": "\"Want To End War But Not Sure If Russia Is Ready\": Zelensky",
    "description": "Ukrainian President Volodymyr Zelenskyy on Monday (local time) voiced his uncertainty about Russia&#039;s readiness to commit to a ceasefire, citing a lack of trust in Moscow&#039;s intentions.",
    "link": "https://www.ndtv.com/world-news/want-to-end-war-but-not-sure-if-russia-is-ready-volodymyr-zelensky-8457349",
    "timestamp": "2025-05-19T22:19:32Z"
  },
  {
    "title": "Republican spins Biden cancer conspiracy theory: 'Good time to distract!'",
    "description": "Oklahoma Sen. Markwayne Mullin (R) said Monday afternoon he wasn't certain the timing of former President Joe Biden's cancer announcement was genuine. \"It's interesting — the timing of them releasing the cancer, right?\" Mullin said from Arlington, Virginia. \"…",
    "link": "https://www.rawstory.com/markwayne-mullin-2672135006/",
    "timestamp": "2025-05-19T22:17:20Z"
  },
  {
    "title": "Central bank body BIS flags potential for dollar scramble",
    "description": "LONDON (Reuters) -Central bank body the Bank for International Settlements has flagged a possible scramble for dollars could be triggered if whipsawed...",
    "link": "https://finance.yahoo.com/news/central-bank-body-bis-flags-221628464.html",
    "timestamp": "2025-05-19T22:16:28Z"
  },
  {
    "title": "TikTok's Sexy Affair With National Parks Isn't Clickbait. It's a Wake-Up Call",
    "description": "Social media thirst traps are spotlighting a funding crisis for public lands. And millions of people are paying attention.",
    "link": "https://www.cnet.com/news/social-media/tiktoks-sexy-affair-with-national-parks-isnt-clickbait-its-a-wake-up-call/",
    "timestamp": "2025-05-19T22:16:25Z"
  },
  {
    "title": "Legal expert Kenji Yoshino shares the red flags to look out for as Trump’s DEI deadline looms",
    "description": "With a Wednesday deadline looming, senior leaders should have a solid bead on whether they are exposed because of their DEI programs and how they can offer compelling rationales for their initiatives. \nIn January, President Donald Trump signed an executive or…",
    "link": "https://biztoc.com/x/8459d12be9ac0cd2",
    "timestamp": "2025-05-19T22:15:28Z"
  },
  {
    "title": "Donald Trump Speaks Out About Joe Biden's Cancer Diagnosis",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn Monday, President Donald Trump addressed former President Joe Biden's recent prostate cancer diagnosis during an Oval Office press briefing.\nTrump expressed concern over the late-stage discovery of Biden's …",
    "link": "https://biztoc.com/x/4f71c171ba756da2",
    "timestamp": "2025-05-19T22:15:21Z"
  },
  {
    "title": "Biden White House visitor logs reveal which Dems participated in cognitive decline ‘cover-up’",
    "description": "Top Democrats are taking heat for supporting former President Joe Biden's re-election campaign despite frequent visits that should have made them aware of his cognitive decline.",
    "link": "https://www.foxnews.com/politics/biden-white-house-visitor-logs-reveal-which-dems-participated-cognitive-decline-cover-up",
    "timestamp": "2025-05-19T22:14:50Z"
  },
  {
    "title": "Donald Trump Speaks Out About Joe Biden's Cancer Diagnosis",
    "description": "President Trump criticized Biden's former medical team, suggesting they withheld critical health information from the public.",
    "link": "https://www.newsweek.com/donald-trump-speaks-out-about-joe-bidens-cancer-diagnosis-2074388",
    "timestamp": "2025-05-19T22:13:49Z"
  },
  {
    "title": "'IDF movement on ground in Gaza aids US hostage efforts,' Adam Boehler says at 'Post' conference",
    "description": "\"If Hamas wants to come and make a legitimate offer, if they're willing to release hostages, we're always open to that,\" he said. \"Part of that stems from the movement of the IDF on the ground.\"",
    "link": "https://www.jpost.com/israel-news/article-854654",
    "timestamp": "2025-05-19T22:13:28Z"
  },
  {
    "title": "Trump signs a bill to make posting 'revenge porn' a federal crime. He had the first lady sign, too",
    "description": "Trump signs a bill to make posting 'revenge porn' a federal crime. He had the first lady sign, toowsls.com",
    "link": "https://www.wsls.com/business/2025/05/19/trump-alongside-the-first-lady-will-sign-a-bill-to-make-posting-revenge-porn-a-federal-crime/",
    "timestamp": "2025-05-19T22:12:42Z"
  },
  {
    "title": "Europeans to pressure Russia with sanctions, Germany says",
    "description": "BERLIN (Reuters) -European leaders agreed to increase pressure on Russia through sanctions after U.S. President Donald Trump briefed them on his call with...",
    "link": "https://www.yahoo.com/news/europeans-pressure-russia-sanctions-germany-221222532.html",
    "timestamp": "2025-05-19T22:12:22Z"
  },
  {
    "title": "Schumer ripped for placing blame on Trump, DOGE for deadly Mexican Navy crash in NYC: 'He is an idiot'",
    "description": "Senate Minority Leader Chuck Schumer was blasted on social media and by the Trump administration for placing blame on Trump for a deadly Mexican Navy ship crash in New York City.",
    "link": "https://www.foxnews.com/politics/schumer-ripped-placing-blame-trump-doge-for-deadly-mexican-navy-crash-in-nyc-idiot",
    "timestamp": "2025-05-19T22:12:09Z"
  },
  {
    "title": "Trump hands Putin a win with retreat from Ukraine peace talks",
    "description": "After months of failing to move Putin closer to peace, Europe fears Trump is pulling the plug on his efforts to end the war, leaving Ukraine and its allies on their own.",
    "link": "https://www.japantimes.co.jp/news/2025/05/20/world/politics/trump-putin-ukraine-peace-talks/",
    "timestamp": "2025-05-19T22:11:00Z"
  },
  {
    "title": "Trump is being 'played for a fool': conservative columnist",
    "description": "President Donald Trump is being \"played by a fool\" in negotiations over the Russian invasion of Ukraine, conservative columnist Max Boot warned in The Washington Post — and he has no idea how effortlessly he's being used.Trump has been tough to pin down on th…",
    "link": "https://www.rawstory.com/trump-ukraine-2672134891/",
    "timestamp": "2025-05-19T22:09:58Z"
  },
  {
    "title": "Kennedy Center To Include Non-Equity Theater Productions Following Donald Trump Complaints",
    "description": "Two non-Equity national theatrical tours – Mrs. Doubtfire and Chicago – are on the 2026 schedule of the John F. Kennedy Center for the Performing Arts in Washington, D.C., marking a major shift in Kennedy Center policy that comes just two months after Preside…",
    "link": "http://deadline.com/2025/05/kennedy-center-actors-equity-donald-trump-broadway-1236405063/",
    "timestamp": "2025-05-19T22:09:05Z"
  },
  {
    "title": "Bill Maher Says Those Who Share 1 Common Belief About Trump Supporters 'Don’t Know MAGA'",
    "description": "Bill Maher Says Those Who Share 1 Common Belief About Trump Supporters 'Don’t Know MAGA'huffpost.com",
    "link": "https://www.huffpost.com/entry/bill-maher-says-you-dont-know-maga-if-you-subscribe-to-1-common-belief-about-trump-supporters_n_682b7a66e4b0f527e57a9a18",
    "timestamp": "2025-05-19T22:08:20Z"
  },
  {
    "title": "Do Leftists Really Believe the Trump Family Wants Another Plane?",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Do Leftists Really Believe the Trump Family Wants Another Plane? appear…",
    "link": "https://www.dailysignal.com/2025/05/19/do-leftists-really-believe-the-trump-family-wants-another-plane/",
    "timestamp": "2025-05-19T22:07:46Z"
  },
  {
    "title": "Republicans vs. Reality",
    "description": "GOP House leaders still can’t find a way to make the math of Trump’s tax bill add up.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/05/trump-tax-bill-house-republicans/682850/",
    "timestamp": "2025-05-19T22:07:00Z"
  },
  {
    "title": "Trump Demands Investigation Into Kamala Harris' Alleged 'Illegal Election Scam' Involving Oprah, Bono, Beyonce",
    "description": "Trump Demands Investigation Into Kamala Harris' Alleged 'Illegal Election Scam' Involving Oprah, Bono, Beyoncewesternjournal.com",
    "link": "https://www.westernjournal.com/trump-demands-investigation-kamala-harris-alleged-illegal-election-scam-involving-oprah-bono-beyonce/",
    "timestamp": "2025-05-19T22:06:33Z"
  },
  {
    "title": "Pennsylvania, Texas lawmakers want insurers to cover detransition care",
    "description": "Lawmakers in some states are seeking to require Medicaid and private insurers to cover detransition procedures if they cover gender-affirming care for transgender people.",
    "link": "https://www.advocate.com/politics/insurance-coverage-detransitioning-texas-pennsylvania",
    "timestamp": "2025-05-19T22:05:58Z"
  },
  {
    "title": "Trump Suggests Biden’s Cancer Diagnosis Was Covered Up: ‘Somebody Is Not Telling the Facts’",
    "description": "President Donald Trump suggested his predecessor's prostate cancer diagnosis was covered up by the previous administration. \nThe post Trump Suggests Biden’s Cancer Diagnosis Was Covered Up: ‘Somebody Is Not Telling the Facts’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/trump-suggests-bidens-cancer-diagnosis-was-covered-up-somebody-is-not-telling-the-facts/",
    "timestamp": "2025-05-19T22:03:13Z"
  },
  {
    "title": "Trump Suggests Biden’s Cancer Diagnosis Was Covered Up: ‘Somebody Is Not Telling the Facts’",
    "description": "President Donald Trump suggested his predecessor's prostate cancer diagnosis was covered up by the previous administration. \nThe post Trump Suggests Biden’s Cancer Diagnosis Was Covered Up: ‘Somebody Is Not Telling the Facts’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-suggests-bidens-cancer-diagnosis-was-covered-up-somebody-is-not-telling-the-facts/",
    "timestamp": "2025-05-19T22:03:13Z"
  },
  {
    "title": "Fox News Politics Newsletter: Another High Court Win for Trump",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-another-high-court-win-trump",
    "timestamp": "2025-05-19T22:02:18Z"
  },
  {
    "title": "Appeals court won’t lift order requiring Trump to facilitate return of asylum seeker deported to El Salvador | CNN Politics",
    "description": "A divided federal appeals court on Monday rejected a request from the Trump administration to put on hold a judge’s order requiring the government to “facilitate” the return of a 20-year-old Venezuelan refugee who was deported earlier this year to El Salvador.",
    "link": "https://www.cnn.com/2025/05/19/politics/asylum-seeker-el-salvador-order",
    "timestamp": "2025-05-19T22:01:13Z"
  },
  {
    "title": "In states, some Dems back anti-trans bills...",
    "description": "Democrats in conservative districts are choosing to vote against LGBTQ equality groups, and the last Democratic president.",
    "link": "https://www.semafor.com/article/05/16/2025/in-states-some-democrats-back-anti-trans-bills",
    "timestamp": "2025-05-19T22:00:06Z"
  },
  {
    "title": "Putin's Still In Charge (Tom Nichols/The Atlantic)",
    "description": "Tom Nichols / The Atlantic:\nPutin's Still In Charge  —  Trump can't end the Ukraine war, and he knows it.  —  Today's phone call between Russian President Vladimir Putin and President Donald Trump was a painful reminder that Trump is the junior partner in the…",
    "link": "https://www.memeorandum.com/250519/p114",
    "timestamp": "2025-05-19T22:00:00Z"
  },
  {
    "title": "Michael Pollan on What Happens When Priests Get High",
    "description": "From the daily newsletter: a conversation about drugs, God, and science. Plus: the new official language of the U.S.; “Salome,” perverted.",
    "link": "https://www.newyorker.com/newsletter/the-daily/michael-pollan-on-what-happens-when-priests-get-high",
    "timestamp": "2025-05-19T22:00:00Z"
  },
  {
    "title": "Donald Trump Declares War On Mexico After Attack On Brooklyn Bridge",
    "description": "https://babylonbee.com/news/a-day-that-will-live-in-infamy-donald-trump-declares-war-on-mexico-after-attack-on-brooklyn-bridge",
    "link": "https://freerepublic.com/focus/f-chat/4317959/posts",
    "timestamp": "2025-05-19T21:57:19Z"
  }
]