[
  {
    "title": "2026 Outlook So Bad, Trump Trying To Rig Elections With Gerrymandering",
    "description": "A number of developments this week indicate that a blue wave may swell in the 2026 midterms.\nFrom Democrats landing top-tier recruits in critical races, to Republicans in competitive races retiring or forgoing bids, to the fact that President Donald Trump is …",
    "link": "https://crooksandliars.com/2025/07/2026-outlook-so-bad",
    "timestamp": "2025-07-15T02:00:02Z"
  },
  {
    "title": "Art Laffer Lists Good Reasons To Label Jerome Powell ‘A Political Hack Trying To Get Trump In Any Way He Can’",
    "description": "Art Laffer said Powell's refusal to lower interest rates makes him look like a \"political hack trying to get\" President Donald Trump \"in any way he can.\"",
    "link": "https://dailycaller.com/2025/07/14/art-laffer-jerome-powell-federal-reserve-donald-trump/",
    "timestamp": "2025-07-15T01:59:57Z"
  },
  {
    "title": "Marlow: Biden Personally Signing Hunter's Pardon--But Not Others--Is the Smoking Gun Bombshell",
    "description": "On Monday’s “Alex Marlow Show,” host and Breitbart Editor-in-Chief Alex Marlow talked about Joe Biden’s autopen use. Marlow said, “[H]e did personally sign the pardon for Hunter. So, he was capable of signing, but wouldn’t. … This is way worse\nThe post Marlow…",
    "link": "https://www.breitbart.com/clips/2025/07/14/marlow-biden-personally-signing-hunters-pardon-but-not-others-is-the-smoking-gun-bombshell/",
    "timestamp": "2025-07-15T01:58:15Z"
  },
  {
    "title": "Stephen Colbert Riffs On Paramount’s “Big Fat Bribe” To Settle Donald Trump’s CBS ’60 Minutes’ Lawsuit",
    "description": "Stephen Colbert riffed Paramount Global’s $16 million settlement of Donald Trump’s lawsuit, calling the payment a “big fat bribe” and joking about the prospects that new owner Skydance will try pressure him to back off from humor directed at the president. In…",
    "link": "http://deadline.com/2025/07/stephen-colbert-trump-60-minutes-settlement-paramount-1236457376/",
    "timestamp": "2025-07-15T01:55:43Z"
  },
  {
    "title": "Oil edges down as market contemplates potential sanctions, tariffs",
    "description": "Oil prices dipped as investors assessed Trump's ultimatum to Russia regarding the Ukraine war and potential sanctions on oil buyers. Concerns about Trump's proposed tariffs on EU and Mexican imports also weighed on the market, raising fears of slowed economic…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-edges-down-as-market-contemplates-potential-sanctions-tariffs/articleshow/122476718.cms",
    "timestamp": "2025-07-15T01:54:40Z"
  },
  {
    "title": "Dollar holds near three-week high before CPI data; Bitcoin hovers above $120,000",
    "description": "The dollar is near a three-week high as traders await U.S. inflation data, crucial for gauging the Federal Reserve's monetary policy path amid potential leadership changes. Elevated Treasury yields and Trump's criticism of Powell are also influencing the curr…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-holds-near-three-week-high-before-cpi-data-bitcoin-hovers-above-120000/articleshow/122476668.cms",
    "timestamp": "2025-07-15T01:53:09Z"
  },
  {
    "title": "Gold holds ground with spotlight on US inflation data",
    "description": "Gold prices edged up as investors awaited U.S. inflation data, crucial for gauging the Federal Reserve's next move on interest rates. Economists anticipate a rise in both headline and core inflation. Former U.S. President Donald Trump has called for lower int…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-holds-ground-with-spotlight-on-us-inflation-data/articleshow/122476574.cms",
    "timestamp": "2025-07-15T01:50:37Z"
  },
  {
    "title": "Wall Street ends with modest gains as investors await earnings, economic data",
    "description": "Wall Street witnessed a slight increase in stocks. Investors remained unfazed by Donald Trump's tariff threats. They are awaiting economic data and earnings season updates. Trump's proposed tariffs on EU and Mexico imports did not significantly impact the mar…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-with-modest-gains-as-investors-await-earnings-economic-data/articleshow/122476514.cms",
    "timestamp": "2025-07-15T01:48:52Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,237",
    "description": "Here are the key events on day 1,237 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/7/15/russia-ukraine-war-list-of-key-events-day-1237",
    "timestamp": "2025-07-15T01:46:46Z"
  },
  {
    "title": "Elmo’s hacked X account posts ‘disgusting’ messages",
    "description": "The beloved Sesame Street monster usually posts of encouragement and kindness.",
    "link": "https://7news.com.au/news/elmos-hacked-x-account-posts-racist-messages-c-19359083",
    "timestamp": "2025-07-15T01:44:29Z"
  },
  {
    "title": "Most GOP senators and congresspeople are in areas with relatively few immigrants - winning the White House is different",
    "description": "Opinion: The Republican most exposed to a protest against these policies is Donald Trump.",
    "link": "https://syndication.washingtonpost.com/nss/stories/5ARA245O7RERFDIUHSA23NCMEY",
    "timestamp": "2025-07-15T01:42:41Z"
  },
  {
    "title": "Mike Johnson Reveals More Trump Megabills Are Coming in Order to Fix Biden’s ‘Mess’",
    "description": "House Speaker Mike Johnson said Sunday on Fox Business that Republicans plan to bring more reconciliation bills and rescission packages to the floor within the coming year to help President Donald Trump achieve his “America First” agenda.\nThe post Mike Johnso…",
    "link": "https://www.thegatewaypundit.com/2025/07/mike-johnson-reveals-trump-megabills-coming-order-fix/",
    "timestamp": "2025-07-15T01:40:54Z"
  },
  {
    "title": "Pentagon Inks Contracts For Musk's XAI, Competitors",
    "description": "The Pentagon announced contracts on Monday with multiple leading US artificial intelligence firms including Elon Musk's xAI, which has faced intense scrutiny in recent days over anti-Semitic posts by its Grok chatbot.",
    "link": "https://www.ibtimes.com/pentagon-inks-contracts-musks-xai-competitors-3778475",
    "timestamp": "2025-07-15T01:36:23Z"
  },
  {
    "title": "German defense minister wants to arm Kiev ‘quickly and quietly’",
    "description": "The decision to transfer at least two Patriot batteries to Ukraine could be finalized “within days or weeks,” according to Boris Pistorius Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621493-germany-pistorius-patriots-ukraine/",
    "timestamp": "2025-07-15T01:35:43Z"
  },
  {
    "title": "Elon Musk's 'crazy' new gambit needs to be 'taken seriously': professor",
    "description": "by Jonathan Shorman, Kansas ReflectorJuly 14, 2025Elon Musk’s announcement that he plans to form a new political party came easily, with the billionaire simply posting his intentions on his social media platform, X. Now comes the hard part.If the world’s rich…",
    "link": "https://www.rawstory.com/elon-musk-2673205590/",
    "timestamp": "2025-07-15T01:33:22Z"
  },
  {
    "title": "Bondi Triggers DOJ Purge, Prominent Ethics Official Among Those Fired",
    "description": "Attorney General Pam Bondi fired the Department of Justice's ethics director as part of an ongoing purge at the agency.",
    "link": "https://www.westernjournal.com/bondi-triggers-doj-purge-prominent-ethics-official-among-fired/",
    "timestamp": "2025-07-15T01:31:30Z"
  },
  {
    "title": "Former Obama speechwriter admits shunning conservative in his family was a mistake",
    "description": "A speechwriter for former President Barack Obama suggested in a guest essay on Sunday that it might be time to stop shunning conservatives over a disagreement with their politics.",
    "link": "https://nypost.com/2025/07/14/us-news/former-obama-speechwriter-admits-shunning-conservative-is-wrong/",
    "timestamp": "2025-07-15T01:29:35Z"
  },
  {
    "title": "Oil Holds Decline as Traders Assess Outlook for Russian Supply",
    "description": "Oil held a drop — after slumping by 1.6% on Monday — as US President Donald Trump’s latest plan to pressure Russia refrained from immediate new measures aimed at hindering Moscow’s energy exports.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-decline-as-traders-assess-outlook-for-russian-supply",
    "timestamp": "2025-07-15T01:28:37Z"
  },
  {
    "title": "Trump official torches safety nets GOP just slashed: ‘We have to make a change’",
    "description": "U.S. Secretary of Agriculture Brooke Rollins claimed Medicaid is “bankrupting” the states, while suggesting that “healthy” foods could serve to help reduce health care costs. Yet both Medicaid and nutrition programs like SNAP were slashed under President Dona…",
    "link": "https://www.rawstory.com/brooke-rollins-2673205258/",
    "timestamp": "2025-07-15T01:28:01Z"
  },
  {
    "title": "Charlie Kirk Says He Is 'Done Talking' About Jeffrey Epstein for the Moment",
    "description": "The Epstein case has remained a lightning rod in American political discourse, fueling conspiracy theories and mistrust in governmental institutions.",
    "link": "https://www.newsweek.com/charlie-kirk-says-he-done-talking-about-jeffrey-epstein-moment-2098919",
    "timestamp": "2025-07-15T01:25:31Z"
  },
  {
    "title": "Stephen Colbert Denounces $16 Million Paramount-Trump Settlement as ‘Big Fat Bribe’ for Skydance Merger | Video",
    "description": "The CBS late night host breaks his silence on his parent company's deal that was announced during his vacation\nThe post Stephen Colbert Denounces $16 Million Paramount-Trump Settlement as ‘Big Fat Bribe’ for Skydance Merger | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/stephen-colbert-calls-paramount-trump-deal-big-fat-bribe-monologue/",
    "timestamp": "2025-07-15T01:24:27Z"
  },
  {
    "title": "Donald Trump stokes the flames of conspiracy — but the Epstein saga may burn him to the ground",
    "description": "Donald Trump's Justice Department has corroborated the official story of the death of Jeffrey Epstein. MAGA is pissed.\nThe post Donald Trump stokes the flames of conspiracy — but the Epstein saga may burn him to the ground appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/07/15/donald-trump-jeffrey-epstein-conspiracy-files/",
    "timestamp": "2025-07-15T01:23:33Z"
  },
  {
    "title": "Gold Holds Loss As Trump Signals Openness To More Trade Talks",
    "description": "Gold steadied following a modest drop on Monday after President Donald Trump said he was open to more tariff negotiations with major economies including the European Union.",
    "link": "https://www.ndtvprofit.com/markets/gold-holds-loss-as-trump-signals-openness-to-more-trade-talks",
    "timestamp": "2025-07-15T01:22:08Z"
  },
  {
    "title": "Mizuho CEO confident of meeting ¥1 trillion profit target",
    "description": "Japan’s third-largest lender forecast in May that net income will likely climb 6.1% to ¥940 billion in the fiscal year started in April.",
    "link": "https://www.japantimes.co.jp/business/2025/07/15/companies/mizuho-financial-group-ceo-interview/",
    "timestamp": "2025-07-15T01:22:00Z"
  },
  {
    "title": "Sesame Street puppet Elmo’s X account posts anti-Jewish rant after hacking",
    "description": "Makers of Sesame Street blame an unknown hacker for slew of offensive social media posts.",
    "link": "https://www.aljazeera.com/news/2025/7/15/sesame-street-puppet-elmos-x-account-posts-anti-jewish-rant-after-hacking",
    "timestamp": "2025-07-15T01:20:49Z"
  },
  {
    "title": "CNN Data Chief Says Americans Have 'Turned' Against Trump Over This Key Issue",
    "description": "Harry Enten flagged how the president is doing \"bad to downright terrible\" in the polls on this issue.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-immigration-approval-ratings_n_6875849fe4b02462fe7a5b2e",
    "timestamp": "2025-07-15T01:19:49Z"
  },
  {
    "title": "CNBC Daily Open: Trump brandishes tariffs for peace, not a trade war",
    "description": "Here's a tariff we can get behind. At a White House meeting on Monday with NATO's secretary general, Mark Rutte, U.S. President Donald Trump said he would introduce \"tariffs at about 100%\" on Russia's trade partners if the Kremlin doesn't reach a deal to end …",
    "link": "https://biztoc.com/x/d6a243cd051daa90",
    "timestamp": "2025-07-15T01:19:09Z"
  },
  {
    "title": "Trump’s ‘warrior’ myth crumbles — and MAGA faith is cracking with it: NYT column",
    "description": "President Donald Trump has always occupied an air of infallibility within the MAGA party, but that illusion appears to be quickly fading, according to New York Times columnist Michelle Goldberg. When Trump entered the political arena in 2015, he sought to pos…",
    "link": "https://www.rawstory.com/trump-gop-2673203747/",
    "timestamp": "2025-07-15T01:18:10Z"
  },
  {
    "title": "Raskin: 'Dangerous to Public Health and Safety' Not to Release Epstein Files",
    "description": "Representative Jamie Raskin (D-MD) said Monday on MSNBC's \"Deadline\" that it was \"dangerous to public health and safety\" that President Donald Trump is not releasing all the Jeffrey Epstein materials.\nThe post Raskin: ‘Dangerous to Public Health and Safety’ N…",
    "link": "https://www.breitbart.com/clips/2025/07/14/raskin-dangerous-to-public-health-and-safety-not-to-release-epstein-files/",
    "timestamp": "2025-07-15T01:17:04Z"
  },
  {
    "title": "50 days for peace deal or 100% tariffs: Trump arms Ukraine, threatens sanctions on countries that buy Russian oil",
    "description": "Donald Trump declared new arms for Ukraine. He warned of penalties on nations purchasing Russian exports. This is if Russia does not agree to a peace accord. The sanctions have a 50-day grace period. Investors in Russia welcomed this. Volodymyr Zelenskiy than…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/50-days-for-peace-deal-or-100-tariffs-trump-arms-ukraine-threatens-sanctions-on-countries-that-buy-russian-oil/articleshow/122475272.cms",
    "timestamp": "2025-07-15T01:15:58Z"
  },
  {
    "title": "Inside the $3 Billion Fight for the Future of 'South Park'",
    "description": "Paramount Global believed it had a framework for an agreement with series creators Trey Parker and Matt Stone. Skydance, the studio’s likely imminent new owner, balked at the terms. The 'South Park' creators have brought on bulldog negotiator Bryan Freedman t…",
    "link": "http://www.hollywoodreporter.com/business/business-news/south-park-skydance-paramount-fight-1236314541/",
    "timestamp": "2025-07-15T01:14:05Z"
  },
  {
    "title": "Inside the $3 Billion ‘South Park’ Fight That May Blow Up Its Future",
    "description": "Paramount Global believed it had a framework for an agreement with series creators Trey Parker and Matt Stone. Skydance, the studio’s likely imminent new...",
    "link": "https://www.hollywoodreporter.com/business/business-news/south-park-skydance-paramount-fight-1236314541/",
    "timestamp": "2025-07-15T01:13:37Z"
  },
  {
    "title": "CNBC Daily Open: Trump brandishes tariffs for peace, not a trade war",
    "description": "U.S. President Donald Trump said he would introduce \"tariffs at about 100%\" on Russia's trade partners if the Kremlin doesn't reach a peace deal with Ukraine.",
    "link": "https://www.cnbc.com/2025/07/15/cnbc-daily-open-trump-brandishes-tariffs-for-peace-not-a-trade-war.html",
    "timestamp": "2025-07-15T01:13:22Z"
  },
  {
    "title": "US agencies shrink layoff plans after mass staff exodus",
    "description": "The Trump administration is scaling back planned federal worker layoffs due to buyouts, early retirements, and natural attrition. Several agencies are rethinking staff cuts after offering financial incentives for employees to leave. This decision marks a shif…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-agencies-shrink-layoff-plans-after-mass-staff-exodus/articleshow/122475154.cms",
    "timestamp": "2025-07-15T01:12:55Z"
  },
  {
    "title": "Megyn Kelly and Ben Shapiro Spar Over Jeffrey Epstein Files",
    "description": "Megyn Kelly duked it out with Ben Shapiro over the Epstein investigation as MAGA continues revolting against top Trump officials.",
    "link": "https://www.newsweek.com/megyn-kelly-ben-shapiro-jeffrey-epstein-files-2098928",
    "timestamp": "2025-07-15T01:12:53Z"
  },
  {
    "title": "HHS carries out mass firings across health agencies after Supreme Court decision | CNN",
    "description": "Thousands of employees across US federal health agencies received an email Monday afternoon telling them they were out of a job as of the close of business.",
    "link": "https://www.cnn.com/2025/07/14/health/hhs-layoffs-supreme-court",
    "timestamp": "2025-07-15T01:12:01Z"
  },
  {
    "title": "Exclusive: Rep. Gary Palmer Introduces SAMS Act to End U.S. Dependence on China for Critical Minerals",
    "description": "Rep. Gary Palmer (R-AL), the newly appointed Chairman of the House Subcommittee on Environment, introduced the Securing America’s Mineral Supply (SAMS) Act to codify executive orders issued by President Donald Trump aimed at revitalizing U.S. critical mineral…",
    "link": "https://www.breitbart.com/politics/2025/07/14/exclusive-gary-palmer-introduces-sams-act-end-u-s-dependence-china-critical-minerals/",
    "timestamp": "2025-07-15T01:10:31Z"
  },
  {
    "title": "Share Market Highlights 15 July 2025: Sensex ended positive at 82,570.91, and Nifty 50 up 0.45% at 25,195.80; Auto and pharma led the rally on sectoral front",
    "description": "Sensex, Nifty, Share Prices Highlights: Stock markets snapped the four-day falling streak on Tuesday with the benchmark Sensex rebounding by 317 points on buying in auto and pharma shares amid a decline in retail inflation to a more than six-year low, nearing…",
    "link": "https://www.thehindubusinessline.com/markets/share-market-highlights-15-july-2025-sensex-ended-positive-at-8257091-and-nifty-50-up-045-at-2519580-auto-and-pharma-led-the-rally-on-sectoral-front/article69810901.ece",
    "timestamp": "2025-07-15T01:09:23Z"
  },
  {
    "title": "Oil Holds Decline As Traders Assess Outlook For Russian Supply",
    "description": "Oil held a drop — after slumping by more than 2% on Monday — as US President Donald Trump’s latest plan to pressure Russia refrained from immediate new measures aimed at hindering Moscow’s energy exports.",
    "link": "https://www.ndtvprofit.com/markets/oil-holds-decline-as-traders-assess-outlook-for-russian-supply",
    "timestamp": "2025-07-15T01:08:06Z"
  },
  {
    "title": "Asian shares edge up, Japanese bond yields rise",
    "description": "Asian stocks saw a rise, mirroring gains in the US market. Traders are not much worried about President Trump's tariff threats. They see them as negotiation tactics. Australian and Japanese shares increased. South Korean shares decreased. Bitcoin fell after h…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-edge-up-japanese-bond-yields-rise/articleshow/122474930.cms",
    "timestamp": "2025-07-15T01:07:43Z"
  },
  {
    "title": "Grok for government: xAI signs deal with US Department of Defense",
    "description": "Elon Musk’s xAI signs a deal to provide its Grok language model to the US Department of Defense, making it available to all federal agencies. The deal follows recent controversies where the chatbot generated extremist content.",
    "link": "https://www.israelnationalnews.com/news/411671",
    "timestamp": "2025-07-15T01:07:10Z"
  },
  {
    "title": "MAGA faithful are angry about the Epstein case. Here's what to know",
    "description": "The Epstein case is causing division among Donald Trump's supporters. The Justice Department said it will not release further files. This decision contradicts earlier claims by Attorney General Pam Bondi. Right-wing figures are criticizing the lack of transpa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/maga-faithful-are-angry-about-the-epstein-case-heres-what-to-know/articleshow/122474796.cms",
    "timestamp": "2025-07-15T01:05:21Z"
  },
  {
    "title": "US Supreme Court clears way for Trump to gut Education Department",
    "description": "The US Supreme Court allowed the Trump administration to proceed with dismantling the Education Department. This reverses a lower court order. The move enables the administration to transfer functions to other agencies. Critics fear this will harm the departm…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-clears-way-for-trump-to-gut-education-department/articleshow/122474683.cms",
    "timestamp": "2025-07-15T01:03:02Z"
  },
  {
    "title": "Jasmine Crockett claims GOP would rather ‘bury their constituents’ than fight climate change",
    "description": "Crockett called out the Trump administration and Secretary of Homeland Security Kristi Noem for what she claimed was a delayed response to the flash flooding that devastated parts of central Texas.",
    "link": "https://nypost.com/2025/07/14/us-news/jasmine-crockett-gop-would-rather-bury-their-constituents-than-fight-climate-change/",
    "timestamp": "2025-07-15T01:02:35Z"
  },
  {
    "title": "Asian Shares Edge Up, Japanese Bond Yields Rise: Markets Wrap",
    "description": "Asian equities followed the US in posting a modest gain as traders brushed off President Donald Trump’s latest tariff threats as bargaining tactics that are unlikely to derail global trade.",
    "link": "https://www.ndtvprofit.com/markets/global-stock-markets-asian-indices-hang-seng-nikkei-dax-ftse-nasdaq-s-and-p-dow-jones-news-today-15-july-2025",
    "timestamp": "2025-07-15T01:02:13Z"
  },
  {
    "title": "VDH: Trump Makes ‘Experts’ Eat Their Words with Record-Breaking Three Weeks",
    "description": "What President Donald Trump has achieved over the past three weeks, most presidents could only dream of for an entire term. Trump has revitalized military recruitment and turned the armed forced from “fat” to “fit,” reshaped America’s foreign alliances, and d…",
    "link": "https://freerepublic.com/focus/f-news/4328714/posts",
    "timestamp": "2025-07-15T01:02:07Z"
  },
  {
    "title": "'Unknown hacker' targets Elmo's X account, and posts antisemitic and racist messages",
    "description": "An X account for the Sesame Street character Elmo has been targeted by an unknown hacker who posted antisemitic and racist messages.",
    "link": "https://news.sky.com/story/unknown-hacker-targets-elmos-x-account-and-posts-antisemitic-and-racist-messages-13396787",
    "timestamp": "2025-07-15T01:02:00Z"
  },
  {
    "title": "Followers feel ‘abandoned’ as plus-size influencers embrace weight loss, blame Trump for cultural shift",
    "description": "Fans of body-positive influencers feel abandoned when content creators lose weight, with industry professionals linking the trend to cultural pressures and patriarchy.",
    "link": "https://www.foxnews.com/media/followers-feel-abandoned-plus-size-influencers-embrace-weight-loss-blame-trump-cultural-shift",
    "timestamp": "2025-07-15T01:00:07Z"
  },
  {
    "title": "'Carrot cake didn't give me cancer': Dr. Oz under fire after 'insulting' remark",
    "description": "U.S. Centers for Medicare and Medicaid Services Administrator Dr. Mehmet Oz appeared on Fox Business on Monday, where he presented a carrot cake to celebrate Medicaid's 60th birthday and brushed aside concerns about the millions of Americans likely to lose th…",
    "link": "https://www.rawstory.com/dr-oz-2673203945/",
    "timestamp": "2025-07-15T00:58:29Z"
  },
  {
    "title": "US imposes 17% tariff on Mexican tomatoes after withdrawing from agreement",
    "description": "The U.S. Commerce Department will impose duties on fresh tomatoes from Mexico after withdrawing from a 2019 deal. This decision follows complaints from U.S. growers about unfair pricing practices. Mexico's agriculture associations expressed commitment to find…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-imposes-17-tariff-on-mexican-tomatoes-after-withdrawing-from-agreement/articleshow/122474308.cms",
    "timestamp": "2025-07-15T00:55:06Z"
  },
  {
    "title": "‘Suddenly, Republicans’ Lead Is Gone’: GOP Pollster Describes How Elon Musk’s America Party Changes Midterms",
    "description": "Kristen Soltis Anderson warned on CNN Monday that the emergence of Elon Musk’s \"America Party\" could upend Republicans' slim advantage.",
    "link": "https://dailycaller.com/2025/07/14/kristen-soltis-anderson-gop-elon-musk-america-party/",
    "timestamp": "2025-07-15T00:51:05Z"
  },
  {
    "title": "Trump Wants You to Believe in Conspiracies. Just Not That One",
    "description": "Trump hyped the Epstein files, then backpedaled. Can Democrats expose his conspiracy game without playing it themselves?\nThe post Trump Wants You to Believe in Conspiracies. Just Not That One  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/07/14/trump-wants-you-to-believe-in-conspiracies-just-not-that-one/",
    "timestamp": "2025-07-15T00:47:04Z"
  },
  {
    "title": "Trump praises SCOTUS ruling on education cuts",
    "description": "United States President Donald Trump praised the US Supreme Court's decision allowing his administration to proceed with cutting nearly 1,400 Education Department jobs.\nIn a Truth Social post, Tr...",
    "link": "https://biztoc.com/x/74805d9ddcefb144",
    "timestamp": "2025-07-15T00:45:34Z"
  },
  {
    "title": "Despite tariffs, it's still America first for Asia's legacy automakers",
    "description": "SEOUL: Toyota and Hyundai Motor may have a beef with US protectionism, but they have one thing in common with President Donald Trump: when it comes to global car markets, it's America first for Asia's legacy automakers. Trump's",
    "link": "https://www.channelnewsasia.com/business/us-auto-tariffs-east-asian-car-manufacturers-toyota-hyundai-5238431",
    "timestamp": "2025-07-15T00:40:00Z"
  },
  {
    "title": "NATO chief praises Trump's weapons sales to allies as 'significant' move that could force Putin to negotiate",
    "description": "NATO Secretary General Mark Rutte discusses President Donald Trump's decision to sell weapons to NATO for Ukraine in an interview on 'Special Report.'",
    "link": "https://www.foxnews.com/media/nato-chief-praises-trumps-weapons-sale-allies-significant-move-could-force-putin-negotiate",
    "timestamp": "2025-07-15T00:39:34Z"
  },
  {
    "title": "Supreme Court Allows Trump To Resume Education Department Dismantling",
    "description": "A divided US Supreme Court gave President Donald Trump the green light on Monday to resume dismantling the Education Department.",
    "link": "https://www.ibtimes.com/supreme-court-allows-trump-resume-education-department-dismantling-3778467",
    "timestamp": "2025-07-15T00:33:14Z"
  },
  {
    "title": "Trump Sours On Putin, But Bromance May Not Be Over",
    "description": "Ever since his political rise a decade ago, Donald Trump has sung the praises of Vladimir Putin -- the Russian president was a \"strong leader\" who, perhaps more important, would often say \"very good things\" about him.",
    "link": "https://www.ibtimes.com/trump-sours-putin-bromance-may-not-over-3778464",
    "timestamp": "2025-07-15T00:33:13Z"
  },
  {
    "title": "Supreme Court allows Trump to lay off nearly 1,400 Education Department employees",
    "description": "The Supreme Court is allowing President Donald Trump to put his plan to dismantle the Education Department back on track — and to go through with laying off nearly 1,400 employees.",
    "link": "https://www.wpxi.com/news/local/supreme-court-allows-trump-lay-off-nearly-1400-education-department-employees/YIJHOHKUMFGQ7HLH2XOUY2AU7E/",
    "timestamp": "2025-07-15T00:31:33Z"
  },
  {
    "title": "Trump admin seeks to overturn federal restraining order limiting ICE operations in Los Angeles",
    "description": "Trump admin fighting back after federal judge bars ICE from conducting stops in California without reasonable suspicion.",
    "link": "https://www.foxnews.com/politics/trump-admin-seeks-overturn-federal-restraining-order-limiting-ice-operations-los-angeles",
    "timestamp": "2025-07-15T00:30:26Z"
  },
  {
    "title": "Rupee falls below 86 mark against dollar amid US trade policy uncertainty",
    "description": "The Indian rupee weakened, breaching the 86 mark against the dollar due to equity market weakness and US trade policy uncertainty. Intraday, it touched 86.0475, recovering slightly after likely RBI intervention to close at 85.9850. With tariff concerns linger…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-falls-below-86-mark-against-dollar-amid-us-trade-policy-uncertainty/articleshow/122473075.cms",
    "timestamp": "2025-07-15T00:30:18Z"
  },
  {
    "title": "Laura Ingraham Scolds ‘Conservative Influencers’ Over Epstein In-Fighting She Helped Stoke Last Week",
    "description": "Fox News host Laura Ingraham briefly addressed the kerfuffle roiling conservative media in recent days and spoke as though she had played no part in it.\nThe post Laura Ingraham Scolds ‘Conservative Influencers’ Over Epstein In-Fighting She Helped Stoke Last W…",
    "link": "https://www.mediaite.com/media/tv/laura-ingraham-scolds-conservative-influencers-over-epstein-in-fighting-she-helped-stoke-last-week/",
    "timestamp": "2025-07-15T00:29:24Z"
  },
  {
    "title": "With China and Trump, Japan defense report says world entering ‘new era of crisis’",
    "description": "The annual defense white paper says that U.S. actions under Trump will “significantly impact” the Indo-Pacific region and “will require continued attention.”",
    "link": "https://www.japantimes.co.jp/news/2025/07/15/japan/politics/japan-defense-white-paper-2025/",
    "timestamp": "2025-07-15T00:25:00Z"
  },
  {
    "title": "Federal Judge Medical Debt Rule Reversal: What Texas judge ruling means and how it will affect you",
    "description": "A federal judge in Texas has reversed a Biden-era rule that aimed to remove $50 billion in medical debt from credit reports. The decision affects 15 million Americans and challenges the authority of the Consumer Financial Protection Bureau under the Fair Cred…",
    "link": "https://economictimes.indiatimes.com/news/international/us/federal-judge-reverses-medical-debt-biden-administration-credit-reports-cfpb-consumer-financial-protection-bureau-sean-jordan-fair-credit-reporting-act-trump-kamala-harris-medicaid-cuts-score-rule/articleshow/122472585.cms",
    "timestamp": "2025-07-15T00:23:40Z"
  },
  {
    "title": "‘Thank you Supreme Court!’ Trump brags after major shadow docket ruling",
    "description": "President Donald Trump posted a triumphant manifesto on Truth Social on Monday night, after the Supreme Court handed him at least a temporary victory in one of his pet projects.\"The United States Supreme Court has handed a Major Victory to Parents and Student…",
    "link": "https://www.rawstory.com/trump-supreme-court-2673203721/",
    "timestamp": "2025-07-15T00:21:24Z"
  },
  {
    "title": "Monday, July 14. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,237.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/07/14/monday-july-14-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-07-15T00:21:10Z"
  },
  {
    "title": "Oil edges down as market contemplates potential sanctions, tariffs",
    "description": "Oil prices edged down on Tuesday as the market digested U.S. President Donald Trump's 50-day deadline for Russia to end the Ukraine war and avoid sanctions on buyers of its oil, while worries continued to linger over Trump's trade tariffs.Brent crude futures …",
    "link": "https://www.channelnewsasia.com/business/oil-edges-down-market-contemplates-potential-sanctions-tariffs-5238411",
    "timestamp": "2025-07-15T00:20:57Z"
  },
  {
    "title": "Top DOJ Ethics Adviser Says Pam Bondi Fired Him",
    "description": "Joseph Tirrell was tasked with advising the department's leaders on ethical matters.",
    "link": "https://www.huffpost.com/entry/doj-ethics-advisor-fired-pam-bondi_n_6875834de4b025efd81d2674",
    "timestamp": "2025-07-15T00:15:21Z"
  },
  {
    "title": "Trump’s stunning threat against Putin as patience fades",
    "description": "The deeply frustrated US president has taken his toughest stance yet against the Russian leader.",
    "link": "https://7news.com.au/news/trumps-stunning-threat-against-putin-as-patience-fades-c-19356780",
    "timestamp": "2025-07-15T00:12:35Z"
  },
  {
    "title": "Supreme Court Allows Trump To Fire Education Department Employees",
    "description": "Supreme Court Allows Trump To Fire Education Department Employees\n \nAuthored by Matthew Vadum via The Epoch Times,\nThe Supreme Court on July 14 allowed President Donald Trump to move forward with dismantling the Department of Education by firing almost 1,400 …",
    "link": "https://biztoc.com/x/4be48cc71a5f112a",
    "timestamp": "2025-07-15T00:12:21Z"
  },
  {
    "title": "Trump’s weapons deal for Ukraine plus new sanctions for Russia could be a game-changer",
    "description": "President Trump’s decision to send “billions of dollars” worth of weapons to Ukraine via NATO could prove a game-changer in Kyiv's 40-month-old war against Russian aggression. Especially coupled with his plan for 100% “secondary tariffs” targeting Moscow.",
    "link": "https://nypost.com/2025/07/14/opinion/trumps-weapons-deal-for-ukraine-plus-new-russian-sanctions-could-be-a-game-changer/",
    "timestamp": "2025-07-15T00:06:05Z"
  },
  {
    "title": "Dinesh D’Souza Tells Viewers It’s ‘Time to Move On’ From Epstein: ‘They Have Closed the Case’",
    "description": "Conservative commentator Dinesh D'Souza told his viewers it was \"time to move on\" from investigating documents related to the late sex offender Jeffrey Epstein.\nThe post Dinesh D’Souza Tells Viewers It’s ‘Time to Move On’ From Epstein: ‘They Have Closed the C…",
    "link": "https://www.mediaite.com/politics/dinesh-dsouza-tells-viewers-its-time-to-move-on-from-epstein-they-have-closed-the-case/",
    "timestamp": "2025-07-15T00:03:09Z"
  },
  {
    "title": "Donald Trump snubs Chelsea ceremony and keeps original FIFA Club World Cup 2025 trophy at White House",
    "description": "Apart from being part of the trophy lift, Donald Trump snubbed Chelsea by keeping the original FIFA Club World Cup 2025 trophy at the White House.\n Donald Trump made headlines during Chelsea’s FIFA Club World Cup 2025 triumph, after an unexpected and comical …",
    "link": "https://worldsoccertalk.com/news/donald-trump-snubs-chelsea-ceremony-and-keeps-original-fifa-club-world-cup-2025-trophy-at-white-house/",
    "timestamp": "2025-07-15T00:01:14Z"
  },
  {
    "title": "Dollar holds near three-week high before CPI data; Bitcoin hovers above $120,000",
    "description": "TOKYO (Reuters) -The dollar hovered near a three-week high versus major peers on Tuesday as traders awaited the release of U.S. inflation data later in the...",
    "link": "https://finance.yahoo.com/news/dollar-holds-near-three-week-000105319.html",
    "timestamp": "2025-07-15T00:01:05Z"
  },
  {
    "title": "How Firm Is Washington’s Commitment to Taiwan’s Security?",
    "description": "At first glance, Washington’s informal but very real commitment to defend Taiwan and preserve its de facto independence seems quite secure.  Over the past decade, Taipei’s security relationship with the United States grew steadily closer – with strong biparti…",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/07/14/how-firm-is-washingtons-commitment-to-taiwans-security/",
    "timestamp": "2025-07-15T00:00:50Z"
  },
  {
    "title": "Ethereum’s Goal? Cracking The Web2 Fortress, Not Fighting Bitcoin—CEO",
    "description": "Ethereum’s path is clear. US President Donald Trump isn’t part of this story, but developers and investors are. According to Bitwise CEO Hunter Horsley, Ethereum isn’t trying to outdo Bitcoin on money alone. Related Reading: Metaplanet Just Bought 800 Bitcoin…",
    "link": "https://bitcoinist.com/ethereums-goal-cracking-the-web2-fortress-not-fighting-bitcoin-ceo/",
    "timestamp": "2025-07-15T00:00:31Z"
  },
  {
    "title": "Jeffrey Epstein Hired Private Investigators to Intimidate FBI Agents: Officials",
    "description": "When the FBI investigated Jeffrey Epstein two decades ago, he “hired private PIs to investigate the investigators,” per one law enforcement official.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-jeffrey-epstein-fbi-private-investigators-1235385560/",
    "timestamp": "2025-07-15T00:00:00Z"
  },
  {
    "title": "“In some cases gals”: New Trump quote becomes a meme as the post itself gets ratio’d on Truth Social",
    "description": "Donald Trump's frustration over his boys and, in some cases, gals continuing to demand answers about the alleged Jeffrey Epstein client list has become an unexpected meme.\n\n\nEarlier this month, the Justice Department released a memo claiming that there's noth…",
    "link": "https://www.dailydot.com/memes/donald-trump-in-some-cases-gals-meme/",
    "timestamp": "2025-07-15T00:00:00Z"
  },
  {
    "title": "Huessy Seminar: Arms Control Is Not Dead Yet With Rose Gottemoeller",
    "description": "Hoover Institution fellow Rose Gottemoeller discusses the future of arms control, emphasizing the need for mutual predictability and limits with Russia and China. Gottemoeller advocated for a new treaty potentially led by Donald Trump, maintaining New START v…",
    "link": "https://www.hoover.org/research/huessy-seminar-arms-control-not-dead-yet-rose-gottemoeller",
    "timestamp": "2025-07-15T00:00:00Z"
  },
  {
    "title": "Analysis-Despite tariffs, it's still America first for Asia's legacy automakers",
    "description": "SEOUL/TOKYO (Reuters) -Toyota and Hyundai Motor may have a beef with U.S. protectionism, but they have one thing in common with President Donald Trump: when ...",
    "link": "https://finance.yahoo.com/news/analysis-despite-tariffs-still-america-235808635.html",
    "timestamp": "2025-07-14T23:58:08Z"
  },
  {
    "title": "Megyn Kelly And Ben Shapiro Clash Over What High-Ranking Sources Told Them About Epstein Case",
    "description": "Megyn Kelly and Ben Shapiro clashed, after Shapiro arged that Kelly's sources should come forward with the information they have regarding the \"Epstein Files.\"",
    "link": "https://dailycaller.com/2025/07/14/megyn-kelly-ben-shapiro-jeffrey-epstein-trump-administration-files/",
    "timestamp": "2025-07-14T23:55:05Z"
  },
  {
    "title": "1 Year After Butler, Lawmakers Decry Political Violence, but Questions Remain Unanswered",
    "description": "A year removed from the attempted assassination of President Donald Trump in Butler, Pennsylvania, on July 13, 2024, questions remain unanswered as to the motives... Read More\nThe post 1 Year After Butler, Lawmakers Decry Political Violence, but Questions Rem…",
    "link": "https://www.dailysignal.com/2025/07/14/1-year-after-butler-lawmakers-decry-political-violence-but-questions-remain-unanswered/",
    "timestamp": "2025-07-14T23:53:32Z"
  },
  {
    "title": "U.S. inflation may have worsened last month as Trump's tariffs start to bite",
    "description": "WASHINGTON (AP) — Inflation rose last month to its highest level since February as President Donald Trump's sweeping tariffs push up the cost of everything from groceries and clothes to furniture and appliances.",
    "link": "https://www.wral.com/story/u-s-inflation-may-have-worsened-last-month-as-trumps-tariffs-start-to-bite/22086268/",
    "timestamp": "2025-07-14T23:50:57Z"
  },
  {
    "title": "U.S. inflation may have worsened last month as Trump’s tariffs start to bite",
    "description": "Inflation rose last month to its highest level in four months as the cost of gas, food, and groceries rose, reversing several months of cooling price pressures.",
    "link": "https://www.click2houston.com/news/2025/07/15/us-inflation-may-have-worsened-last-month-as-trumps-tariffs-start-to-bite/",
    "timestamp": "2025-07-14T23:50:57Z"
  },
  {
    "title": "U.S. inflation may have worsened last month as Trump’s tariffs start to bite",
    "description": "Inflation rose last month to its highest level since February as President Donald Trump’s sweeping tariffs push up the cost of a range of goods, including furniture, clothing, and large appliances.",
    "link": "https://www.news4jax.com/news/2025/07/14/us-inflation-may-have-worsened-last-month-as-trumps-tariffs-start-to-bite/",
    "timestamp": "2025-07-14T23:50:57Z"
  },
  {
    "title": "EXCLUSIVE: Trump’s Energy Agenda Can Help US Beat China In Crucial Tech Race, Oil Industry Leader Says",
    "description": "The oil and gas industry is the gateway to meeting America's surging energy demand and beating China in the artificial intelligence race.",
    "link": "https://dailycaller.com/2025/07/14/exclusive-biden-trump-oil-gas-fuel-ai-race-china/",
    "timestamp": "2025-07-14T23:45:35Z"
  },
  {
    "title": "Light rare earths, no magnets, and a resolve to break free of China's iron grip",
    "description": "Sona Comstar has developed new motors using light rare earth elements like cerium, samarium and neodymium, while Ather Energy too is keen to move towards light rare earth magnets. Ola Electric says it has developed magnet-free motors",
    "link": "https://www.livemint.com/industry/china-rare-earth-restrictions-automotive-firms-sona-comstar-ather-light-rare-earths-ola-electric-magnet-free-motors-11752487947846.html",
    "timestamp": "2025-07-14T23:45:09Z"
  },
  {
    "title": "US nuclear regulator asks job seekers political questions",
    "description": "WASHINGTON (Reuters) -A job notice posted by the U.S. nuclear power regulator asks applicants political questions as the administration of President Donald...",
    "link": "https://www.yahoo.com/news/us-nuclear-regulator-asks-job-234502743.html",
    "timestamp": "2025-07-14T23:45:02Z"
  },
  {
    "title": "B-52s Escorted by Japanese and South Korean Fighters in Trilateral Exercise",
    "description": "U.S. Air Force B-52s deployed to Andersen AFB, Guam, linked with Japanese Mitsubishi F-2 and South Korean KF-16 Fighting Falcon fighter aircraft while operating in the Pacific region on Jul. 11, 2025. According to the U.S. Air Force, the escort mission marked…",
    "link": "https://theaviationist.com/2025/07/15/b52s-escorted-trilateral-exercise/",
    "timestamp": "2025-07-14T23:44:50Z"
  },
  {
    "title": "Hacker uses Elmo's X account to post antisemitic rant and demand release of Epstein files",
    "description": "The account has more than 650,000 followers and is a reliable stream of wholesome content on a platform where inflammatory rhetoric and abusive messages thrive.",
    "link": "https://www.abc.net.au/news/2025-07-15/elmo-x-account-hacked-twitter-sesame-street-/105532232",
    "timestamp": "2025-07-14T23:44:46Z"
  },
  {
    "title": "Japan's envoy backs possible Trump-Putin talks",
    "description": "Japanese Ambassador to Russia, Akira Muto (pictured left), expressed Tokyo's support for a possible meeting between United States President Donald Trump and Russian President Vladimir Putin.\nSpea...",
    "link": "https://biztoc.com/x/bf3eb0e77fb5fe62",
    "timestamp": "2025-07-14T23:39:16Z"
  },
  {
    "title": "Millions Kicked Off Medicaid? 'Don't Eat Carrot Cake,' Says Administrator Oz",
    "description": "U.S. Centers for Medicare and Medicaid Services Administrator Dr. Mehmet Oz appeared on Fox Business on Monday, where he presented a carrot cake to celebrate Medicaid's 60th birthday and brushed aside concerns about the millions of Americans likely to lose th…",
    "link": "https://www.commondreams.org/news/mehmet-oz-carrot-cake",
    "timestamp": "2025-07-14T23:36:31Z"
  },
  {
    "title": "Tyler Adams broke his silence and spoke about the USMNT following the Gold Cup.",
    "description": "It&apos;s not the best of times for the U.S. Men&apos;s National Team, following a disappointing loss to Mexico in the Gold Cup final. The defeat has sparked tension within the tea",
    "link": "https://www.marca.com/en/football/2025/07/15/68759423268e3ed91c8b45a3.html",
    "timestamp": "2025-07-14T23:35:33Z"
  },
  {
    "title": "Why Trump Suddenly Sounds Tougher on Russia (Jonathan Lemire/The Atlantic)",
    "description": "Jonathan Lemire / The Atlantic:\nWhy Trump Suddenly Sounds Tougher on Russia  —  The real reason the president suddenly sounds tougher on Russia  —  President Donald Trump is finally taking the fight to Vladimir Putin.  Sort of.  For now.  —  Trump's deference…",
    "link": "https://www.memeorandum.com/250714/p134",
    "timestamp": "2025-07-14T23:35:01Z"
  },
  {
    "title": "DeGeneres backs O’Donnell in Trump feud",
    "description": "Ellen DeGeneres put aside her history with Rosie O'Donnell in the midst of an ongoing feud with the president.",
    "link": "https://www.salon.com/2025/07/14/degeneres-backs-odonnell-in-trump-feud/",
    "timestamp": "2025-07-14T23:34:39Z"
  },
  {
    "title": "Trump sours on Putin, but bromance may not be over",
    "description": "With his announcement Monday of new arms for Ukraine via Europe and tariff threats on Russia, Trump's bromance with Putin has hit a new low — but it may not have run its course.",
    "link": "https://www.japantimes.co.jp/news/2025/07/15/world/politics/trump-putin-ukraine-bromance-focus/",
    "timestamp": "2025-07-14T23:34:00Z"
  },
  {
    "title": "Trump Held On To Flashy Gold FIFA Trophy... Leaving Soccer Champs With A Replica",
    "description": "The president recounted how the Club World Cup trophy ended up in the Oval Office during an interview at the tournament finals on Sunday.",
    "link": "https://www.huffpost.com/entry/trump-fifa-soccer-club-world-cup-trophy_n_68755c06e4b0b1c6f12569ae",
    "timestamp": "2025-07-14T23:33:51Z"
  },
  {
    "title": "Billionaire fund manager reveals two major red flags to avoid 90% of bad investments",
    "description": "Tim Draper says he has seen the SEC kill startups with regulations.",
    "link": "https://www.thestreet.com/crypto/markets/billionaire-fund-manager-reveals-2-red-flags-to-avoid-90-of-bad-investments",
    "timestamp": "2025-07-14T23:31:42Z"
  },
  {
    "title": "Trump once rejected crypto. But then he could make a dollar",
    "description": "The US president is making bank off multiple crypto ventures, all while having an unprecedented capacity to influence the markets.\nThe post Trump once rejected crypto. But then he could make a dollar appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/07/15/donald-trump-cryptocurrency-bitcoin-world-liberty/",
    "timestamp": "2025-07-14T23:30:18Z"
  }
]