[
  {
    "title": "Jaguar Land Rover Halts US Shipments Amid New Tariff Pressures",
    "description": "Jaguar Land Rover halts US shipments in response to new 25% tariffs, as the British auto industry faces growing challenges.",
    "link": "https://www.ibtimes.com/jaguar-land-rover-halts-us-shipments-amid-new-tariff-pressures-3769102",
    "timestamp": "2025-04-07T15:33:18Z"
  },
  {
    "title": "VivoPower Confirms Continuation of Proposed US$180 Million Takeover Process: US Tariffs Not Expected to Affect Tembo Business",
    "description": "VivoPower and Energi Holdings, which has made an all-cash offer at a premium to market to acquire the Company, are progressing to the next step—the exclusive due diligence period",
    "link": "https://www.globenewswire.com/news-release/2025/04/07/3056992/0/en/VivoPower-Confirms-Continuation-of-Proposed-US-180-Million-Takeover-Process-US-Tariffs-Not-Expected-to-Affect-Tembo-Business.html",
    "timestamp": "2025-04-07T15:33:00Z"
  },
  {
    "title": "Politico Reporter: 'Why Trump May Get Away With His Tariff Trauma'",
    "description": "As most of the media projected doom and gloom kvetching over their predicted negative aspects of President Donald Trump's tariffs, there was a rather contrarian view on this subject from a very surprising source: Nahal Toosi, Politico's senior foreign affairs…",
    "link": "https://freerepublic.com/focus/f-news/4309432/posts",
    "timestamp": "2025-04-07T15:32:46Z"
  },
  {
    "title": "Politico Reporter: 'Why Trump May Get Away With His Tariff Trauma'",
    "description": "As most of the media projected doom and gloom kvetching over their predicted negative aspects of President Donald Trump's tariffs, there was a rather contrarian view on this subject from a very surprising source: Nahal Toosi, Politico's senior foreign affairs…",
    "link": "https://freerepublic.com/focus/f-bloggers/4309432/posts",
    "timestamp": "2025-04-07T15:32:46Z"
  },
  {
    "title": "Trump threatens new 50% tariffs on China if Beijing doesn't remove retaliatory duties: Live updates",
    "description": "The White House says any suggestion that President Donald Trump is considering a 90-day pause in tariffs is \"fake news.\"...European Union President Ursula von der Leyen said the EU is willing to negotiate with the U.S. on tariffs but also said the bloc will p…",
    "link": "https://freerepublic.com/focus/f-news/4309431/posts",
    "timestamp": "2025-04-07T15:30:59Z"
  },
  {
    "title": "Richard Branson urges Trump to reverse 'collosal mistake' of tariffs, warns of 'dangerous direction' for economy",
    "description": "Richard Branson has urged President Trump to reconsider the recently implemented tariffs, cautioning that they pose a threat to the global economy. Drawing from his extensive business background, Branson highlighted the market's adverse reaction to the tariff…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/richard-branson-urges-trump-to-reverse-tariffs-warns-of-dangerous-direction-for-economy/articleshow/120069263.cms",
    "timestamp": "2025-04-07T15:30:50Z"
  },
  {
    "title": "Walmart CEO Net Worth as Boycott Over Profits Hit America",
    "description": "Doug McMillon has worked his way from a summer intern to being the company's fifth CEO.",
    "link": "https://www.newsweek.com/walmart-boycott-stocks-doug-mcmillon-grocery-2056327",
    "timestamp": "2025-04-07T15:30:46Z"
  },
  {
    "title": "BREAKING: Trump threatens additional 50 per cent tariff on China",
    "description": "The US president says China has until April 8, US time, to drop its 34 per cent tariff on US goods.",
    "link": "https://www.abc.net.au/news/2025-04-08/donald-trump-threatens-additional-50-per-cent-tariff-on-china/105149002",
    "timestamp": "2025-04-07T15:30:36Z"
  },
  {
    "title": "Tesla celebrates key milestone for 4680 battery cell production cost",
    "description": "Tesla produces in-house 4680 battery cells at its Gigafactory in Texas, along with getting them from outside suppliers.",
    "link": "https://www.teslarati.com/tesla-milestone-4680-battery-cell/",
    "timestamp": "2025-04-07T15:30:08Z"
  },
  {
    "title": "Why Trump hates the U.S. trade deficit and what that means for you",
    "description": "At the core of President Donald Trump’s decision to impose sweeping tariffs on U.S. trading partners is a fixation on closing, if not reversing, America’s trade deficit with nearly all of them.",
    "link": "https://www.nbcnews.com/business/economy/trade-deficit-what-does-it-mean-for-economy-trump-tariffs-rcna199999",
    "timestamp": "2025-04-07T15:30:05Z"
  },
  {
    "title": "Amid Trump Cuts, NOAA Halts Upkeep of Critical Weather Satellites",
    "description": "The decision by the Trump administration to defer maintenance of the Joint Polar Satellite System threatens to degrade the accuracy of weather forecasts",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/04/07/noaa-halts-upkeep-of-critical-weather-satellites-00271237",
    "timestamp": "2025-04-07T15:30:00Z"
  },
  {
    "title": "Trump threatens extra 50pc tariff on China as global markets in turmoil",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"67ea5efb9b66b38dded9cb29\"\n}",
    "link": "https://www.independent.ie/world-news/north-america/trump-threatens-extra-50pc-tariff-on-china-as-global-markets-in-turmoil/a698101359.html",
    "timestamp": "2025-04-07T15:30:00Z"
  },
  {
    "title": "Warren Buffet Reacts To Trump Post Alleging Investor Approved His Tariffs Before Announcement",
    "description": "Donald Trump recently shared a fan-made video claiming that he is deliberately crashing the US stock market to force the US Fed to trim interest rates, which was supposedly backed by Warren Buffett.",
    "link": "https://www.ibtimes.com/warren-buffet-reacts-trump-post-alleging-investor-approved-his-tariffs-before-announcement-3769096",
    "timestamp": "2025-04-07T15:28:55Z"
  },
  {
    "title": "Bob Iger Warns of Tariffs’ Impact on Disney’s $60 Billion Expansion Plans",
    "description": "After President Donald Trump announced expansive tariffs on the United States’ largest trading partners, CEO Bob Iger warned of the negative impact on the country and Disney’s businesses as a result. This covers what the CEO said, plus our preliminary thought…",
    "link": "https://www.disneytouristblog.com/bob-iger-warns-tariffs-disney-world-expansion-investment-cruise-line-disneyland/",
    "timestamp": "2025-04-07T15:28:47Z"
  },
  {
    "title": "'Shocking': Trump hits Lesotho, Levi's and Calvin Klein denim exporter, with 50% tariff",
    "description": "The government of Lesotho told its citizens not to panic after the U.S. announced a trade tariff that risks wiping out nearly half of its exports.",
    "link": "https://www.usatoday.com/story/news/world/2025/04/07/trump-lesotho-trade-tariffs/82971571007/",
    "timestamp": "2025-04-07T15:28:38Z"
  },
  {
    "title": "Trump is 'disconnected from reality' as economy crashes: MSNBC's Stephanie Ruhle",
    "description": "MSNBC host and former Wall Street executive Stephanie Ruhle jumped all over Donald Trump on Monday morning as the stock market spiraled downward once again due to economic uncertainty over his wide-ranging tariff plans.During an appearance on MSNBC's \"Morning…",
    "link": "https://www.rawstory.com/trump-disconnected-relaity/",
    "timestamp": "2025-04-07T15:28:06Z"
  },
  {
    "title": "Black Folks Reclaimed Our Time and Skipped the April 5 Trump Protests, But Social Media is Divided on if We Did the Right Thing",
    "description": "Millions of people sent a message to President Donald Trump and Elon Musk on April 5 as part of the Hands Off! Day of Action organized in opposition to the policies of the Trump administration, including sweeping tariffs and massive cuts to federal agencies. …",
    "link": "https://www.theroot.com/black-folks-reclaimed-our-time-and-skipped-the-april-5-1851775045",
    "timestamp": "2025-04-07T15:28:00Z"
  },
  {
    "title": "How tariffs work and why they are a key part of Trump's agenda",
    "description": "President Donald Trump announced sweeping new duties last week on all U.S. trade partners, including a new baseline 10% duty.",
    "link": "https://www.nbcnews.com/politics/economics/how-tariffs-work-why-trump-wants-them-who-pays-for-them-rcna200015",
    "timestamp": "2025-04-07T15:27:36Z"
  },
  {
    "title": "Bank of Canada outlook surveys show recession fears rising",
    "description": "Uncertainty over Trump's tariff war drove down sales expectations and investment sentiment during the first quarter",
    "link": "https://financialpost.com/news/bank-of-canada-outlook-surveys-recession-fears-rising",
    "timestamp": "2025-04-07T15:27:31Z"
  },
  {
    "title": "Transgenders Outraged that Google's YouTube May Embrace Free Speech on 'Gender Identity'",
    "description": "LGBT advocates are sounding the alarm after Google's YouTube discreetly removed language protecting \"gender identity and expression\" from its public hate speech policy this year. The change could be a sign that the video platform is moving towards free speech…",
    "link": "https://www.breitbart.com/tech/2025/04/07/transgenders-outraged-that-googles-youtube-may-embrace-free-speech-on-gender-identity/",
    "timestamp": "2025-04-07T15:27:03Z"
  },
  {
    "title": "Global Financial Shock As Trump Declares Tariff War, Dismissing Market Losses As 'Necessary Evil'",
    "description": "President Trump defends his tariff 'medicine' as global markets lose £1 trillion ($1.3 trillion) in a savage sell-off. Is this bold or bonkers?",
    "link": "https://www.ibtimes.com/global-financial-shock-trump-declares-tariff-war-dismissing-market-losses-necessary-evil-3769091",
    "timestamp": "2025-04-07T15:26:39Z"
  },
  {
    "title": "Republican Rep. Says 'Russia And China Are Laughing At Us' Over Firing Of NSA Heads Over Far Right Activist Recommendation",
    "description": "Republican Rep. Don Bacon said \"Russia and China are laughing\" at the U.S. over the firing of Gen. Timothy Haugh, NSA director and head of the U.S. Cyber Command",
    "link": "https://www.ibtimes.com/republican-rep-says-russia-china-are-laughing-us-over-firing-nsa-heads-over-far-right-3769090",
    "timestamp": "2025-04-07T15:26:10Z"
  },
  {
    "title": "Trump’s Tariff ‘Medicine’ Engulfs Markets, US Stocks in Spin After Talk of Pause",
    "description": "resident Donald Trump’s sweeping tariff plans battered global markets again on Monday after he said foreign governments would have to pay “a lot of money” to get the levies removed, while U.S. stocks got a brief lift on hints of …",
    "link": "https://www.insurancejournal.com/news/national/2025/04/07/818863.htm",
    "timestamp": "2025-04-07T15:25:49Z"
  },
  {
    "title": "Viral X Post Falsely Claiming Trump May Back Down on Tariffs Sends Markets on Wild Rollercoaster Ride",
    "description": "A fake news flash from a viral X account reporting that President Donald Trump was considering a 90-day pause in tariffs set off a violent market rally Monday morning — only for it all to unravel minutes later after the White House was denied the claim. The f…",
    "link": "https://www.mediaite.com/news/viral-x-post-falsely-claiming-trump-may-back-down-on-tariffs-sends-markets-on-wild-rollercoaster-ride/",
    "timestamp": "2025-04-07T15:25:45Z"
  },
  {
    "title": "Honda Rocked by Scandal: EVP Quits Over 'Inappropriate Behaviour' as CEO Punished With 20% Pay Cut",
    "description": "Honda's executive vice president has resigned over 'inappropriate behaviour' at a social event, prompting the CEO to take a 20% pay cut in response to the scandal.",
    "link": "https://www.ibtimes.com/honda-rocked-scandal-evp-quits-over-inappropriate-behaviour-ceo-punished-20-pay-cut-3769088",
    "timestamp": "2025-04-07T15:25:09Z"
  },
  {
    "title": "Japanese American National Museum Doubles Down on DEI Initiatives as its Federal Funding Hangs in the Balance",
    "description": "The Los Angeles museum is taking a stand against President Trump as $2 million of its federal funding hangs in the balance.",
    "link": "https://www.artnews.com/art-news/news/japanese-american-national-museum-dei-initiatives-1234737935/",
    "timestamp": "2025-04-07T15:24:54Z"
  },
  {
    "title": "US' Chances of Recession Inch Dangerously Close to 50 Percent As Trump Backs Sweeping Tariff Play",
    "description": "Goldman Sachs placed the chances of a recession at 45% as the impact of Trump's tariffs continue to roil markets",
    "link": "https://www.ibtimes.com/us-chances-recession-inch-dangerously-close-50-percent-trump-backs-sweeping-tariff-play-3769087",
    "timestamp": "2025-04-07T15:24:34Z"
  },
  {
    "title": "Gold loses 1%, drops below $3,000",
    "description": "Gold prices fell on Monday, continuing their downward trend for the third straight session, as the escalating trade tensions initiated by President Donald Trump triggered a significant market downturn...",
    "link": "https://biztoc.com/x/d7c877428b460160",
    "timestamp": "2025-04-07T15:24:25Z"
  },
  {
    "title": "Popular automaker takes drastic action to combat tariffs",
    "description": "It's hard to say that this trade war surprised anyone, as President Donald Trump telegraphed this punch during the campaign. \nSo some companies have already been planning for this eventuality. However, as the great pugilist Mike Tyson once said, everyone has …",
    "link": "https://biztoc.com/x/f84ab4bc45cddee6",
    "timestamp": "2025-04-07T15:24:12Z"
  },
  {
    "title": "Kazakhstan Makes Trump ‘Reciprocal’ Tariff List",
    "description": "Trade between the U.S. and Kazakhstan is limited and heavily skewed toward energy, which has been exempt from the new tariffs.",
    "link": "https://thediplomat.com/2025/04/kazakhstan-makes-trump-reciprocal-tariff-list/",
    "timestamp": "2025-04-07T15:24:00Z"
  },
  {
    "title": "US-China trade war escalates: Trump threatens further 50% tariff on the Dragon from April 9",
    "description": "U.S. President Donald Trump on Monday warned that if China does not roll back its recent 34% tariff hike by April 8, the United States will impose an additional 50% in tariffs on Chinese goods, effective April 9.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-trade-war-escalates-trump-threatens-further-50-tariff-on-the-dragon-from-april-9/articleshow/120069141.cms",
    "timestamp": "2025-04-07T15:23:56Z"
  },
  {
    "title": "Kremlin responds to Kiev’s claim of civilian casualties in Krivoy Rog strike",
    "description": "Moscow only hits military-related facilities in Ukraine, Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615347-ukraine-krivoy-rog-peskov/",
    "timestamp": "2025-04-07T15:23:54Z"
  },
  {
    "title": "Trump Tells People To Not Be 'Stupid' As Markets Continue To Crash As a Result Of Tariffs: 'Don't Be a PANICAN'",
    "description": "Donald Trump told Americans to not be \"weak\" and \"stupid\" as he continues to defend his tariffs despite a three-day-long market crash",
    "link": "https://www.ibtimes.com/trump-tells-people-not-stupid-markets-continue-crash-result-tariffs-dont-panican-3769086",
    "timestamp": "2025-04-07T15:23:50Z"
  },
  {
    "title": "Art of the Deal: EU Offers Trump 'Zero-for-Zero Tariffs' on Industrial Goods with United States",
    "description": "EU Commission President Ursula von der Leyen said on Monday that the bloc has offered a \"zero-for-zero tariff\" trade arrangement on industrial goods with the United States in a bid to avoid a full-on trade war.\nThe post Art of the Deal: EU Offers Trump ‘Zero-…",
    "link": "https://www.breitbart.com/europe/2025/04/07/eu-offers-trump-zero-for-zero-tariffs-on-industrial-goods-with-united-states/",
    "timestamp": "2025-04-07T15:23:45Z"
  },
  {
    "title": "Erdogan's VP: Trump Tariffs May Be 'Beneficial' for Turkey",
    "description": "Turkish officials, including Vice President Cevdet Yılmaz, remarked on Sunday and Monday the ten-percent tariff President Donald Trump imposed on goods originating in their country was \"relatively beneficial\" and Turkish markets would survive any volatility i…",
    "link": "https://www.breitbart.com/europe/2025/04/07/erdogans-vp-trump-tariffs-may-be-beneficial-for-turkey/",
    "timestamp": "2025-04-07T15:23:24Z"
  },
  {
    "title": "BlackRock CEO Issues Stark Warning as Bitcoin Charges Towards £1 Trillion Milestone",
    "description": "BlackRock CEO Larry Fink warns of a £1 trillion ($1.3 trillion) crisis as Bitcoin surges and Trump pushes crypto. A financial game-changer unfolds.",
    "link": "https://www.ibtimes.com/blackrock-ceo-issues-stark-warning-bitcoin-charges-towards-1-trillion-milestone-3769083",
    "timestamp": "2025-04-07T15:23:17Z"
  },
  {
    "title": "Markets Spike Over Quote About Trump Considering a Pause On Tariffs, Dip Again After Proven False",
    "description": "Markets suddenly spiked on Monday over a quote attributed to the director of the National Economic Council. They dipped again after it was proven false",
    "link": "https://www.ibtimes.com/markets-spike-over-quote-about-trump-considering-pause-tariffs-dip-again-after-proven-false-3769080",
    "timestamp": "2025-04-07T15:22:35Z"
  },
  {
    "title": "Tesla Is Getting Disemboweled by the Tariffs",
    "description": "Tesla's stock continues to tumble amidst the economic chaos wreaked by Trump's tariffs. In early trading Monday, shares of the Elon Musk-owned automaker fell by more than 10 percent to $214.80, Bloomberg reports. Shortly after trading opened, that number hard…",
    "link": "https://futurism.com/tesla-disemboweled-tariffs",
    "timestamp": "2025-04-07T15:22:23Z"
  },
  {
    "title": "Appeals court blocks Trump from firing two leaders on federal boards (Politico)",
    "description": "Politico:\nAppeals court blocks Trump from firing two leaders on federal boards  —  The decision almost certainly tees up another Supreme Court showdown over the power of the president to control every aspect of the executive branch.  —  Two key members of fed…",
    "link": "https://www.memeorandum.com/250407/p50",
    "timestamp": "2025-04-07T15:20:00Z"
  },
  {
    "title": "Trump and Netanyahu will meet on tariffs, the war in Gaza and more",
    "description": "Israeli Prime Minister Benjamin Netanyahu will meet President Donald Trump in Washington, becoming the first foreign leader to visit Trump since he unleashed tariffs on countries around the world.",
    "link": "https://www.clickondetroit.com/business/2025/04/07/trump-and-netanyahu-will-meet-on-tariffs-the-war-in-gaza-and-more/",
    "timestamp": "2025-04-07T15:19:05Z"
  },
  {
    "title": "Bitcoin and Stocks Pump, Then Dump on False Report of 90-Day Tariffs Pause",
    "description": "Markets surged, then plunged after news reports mischaracterized a White House advisor's interview—and X accounts spread it far and wide.",
    "link": "https://decrypt.co/313661/bitcoin-stocks-pump-dump-90-day-tariffs-pause",
    "timestamp": "2025-04-07T15:18:22Z"
  },
  {
    "title": "Hodlers on edge: Trump’s tariffs shake Bitcoin, but some are buying the dip",
    "description": "Bitcoin holders are facing renewed pressure following US President Donald Trump's trade tariff announcement, which sent shockwaves through global financial markets, including cryptocurrencies.However, with Bitcoin (BTC) hodlers now under pressure, some commun…",
    "link": "https://cointelegraph.com/news/hodlers-pressure-trump-tariffs-shake-bitcoin-hayes-buying",
    "timestamp": "2025-04-07T15:18:21Z"
  },
  {
    "title": "Colorado Artist Behind Portrait Trump Hates Defends Her Work",
    "description": "Sarah Boardman said she completed her Trump portrait \"accurately, without ‘purposeful distortion,’ political bias, or any attempt to caricature the subject, actual or implied.\"",
    "link": "https://www.huffpost.com/entry/ap-us-trump-portrait-colorado_n_67f3e9d5e4b0afc2a9d7be9b",
    "timestamp": "2025-04-07T15:18:09Z"
  },
  {
    "title": "Trump Issues Monday Update on Tariffs, Calls on Federal Reserve to Take Action",
    "description": "\"This is despite the fact that the biggest abuser of them all, China, whose markets are crashing, just raised its Tariffs ...\"",
    "link": "https://www.westernjournal.com/trump-issues-monday-update-tariffs-calls-federal-reserve-take-action/",
    "timestamp": "2025-04-07T15:17:00Z"
  },
  {
    "title": "Liberal Leader Carney pokes at Alberta Premier Smith at first Western campaign stop",
    "description": "Liberal Leader Mark Carney is starting off his first British Columbia campaign stops by drawing a contrast with Alberta Premier Danielle Smith.",
    "link": "https://www.cbc.ca/news/canada/calgary/carney-smith-campaign-stop-1.7503621",
    "timestamp": "2025-04-07T15:13:57Z"
  },
  {
    "title": "Stock Market Today: Dow Jones Dives Amid Trump Tariff 'Fake News;' S&P 500 Hits Bear Market Territory (Live Coverage)",
    "description": "The Dow Jones Industrial Average whipsawed Monday while the S&P 500 hit bear market territory as President Donald Trump's tariff fallout continued to roil the stock market. Billionaire hedge fund manager Bill Ackman issued a warning over the levies, but a few…",
    "link": "https://biztoc.com/x/3ca65e9fa38c4025",
    "timestamp": "2025-04-07T15:13:46Z"
  },
  {
    "title": "‘Well Done, Old Man!’ Russian State TV Revels in Trump Having ‘Destroyed Trust’ in the Economy — Calls for a Monument to Be Built in His Honor",
    "description": "Even as some of his most loyal defenders jump ship, there is at least on constituency President Donald Trump can count on for support — Russian state media.\nThe post ‘Well Done, Old Man!’ Russian State TV Revels in Trump Having ‘Destroyed Trust’ in the Econom…",
    "link": "https://www.mediaite.com/news/well-done-old-man-russian-state-tv-revels-in-trump-having-destroyed-trust-in-the-economy-calls-for-a-monument-to-be-built-in-his-honor/",
    "timestamp": "2025-04-07T15:13:36Z"
  },
  {
    "title": "Von der Leyen offers Trump 'zero-for-zero' tariffs deal on all industrial goods",
    "description": "\"Europe is always ready for a good deal,\" Ursula von der Leyen says as trade tensions with the United States reach all-time high.The European Commission has offered the United States a deal to remove tariffs on all industrial goods as part of the trade negoti…",
    "link": "https://freerepublic.com/focus/f-news/4309428/posts",
    "timestamp": "2025-04-07T15:13:16Z"
  },
  {
    "title": "Wall Street 'fear gauge' flashes red as stocks extend selloff",
    "description": "Wall Street's most watched gauge of investor anxiety jumped to a new eight-month high on Monday as U.S. stocks extended their selloff from last week on...",
    "link": "https://finance.yahoo.com/news/wall-street-fear-gauge-flashes-151247942.html",
    "timestamp": "2025-04-07T15:12:47Z"
  },
  {
    "title": "Appeals court blocks Trump from firing federal board members, tees up Supreme Court fight",
    "description": "The D.C. Circuit blocked Trump's firings of two federal officials, citing precedent and setting the stage for a high-stakes Supreme Court fight over executive authority.",
    "link": "https://www.foxnews.com/politics/federal-appeals-court-blocks-trump-firings-wilcox-harris-nlrb-mspb",
    "timestamp": "2025-04-07T15:12:45Z"
  },
  {
    "title": "Trump's Tariffs: It's Not Just the Stock Market That's In Trouble",
    "description": "The president is raising taxes, hiking prices, and creating supply chain chaos. Congress should act quickly to stop this.",
    "link": "https://reason.com/2025/04/07/trumps-tariffs-its-not-just-the-stock-market-thats-in-trouble/",
    "timestamp": "2025-04-07T15:12:42Z"
  },
  {
    "title": "Jena Griswold is running to be Colorado’s next attorney general",
    "description": "Griswold, a Democrat and Colorado’s current secretary of state, called herself the “most qualified person in this race” given her experience pushing back against Donald Trump Secretary of State Jena Griswold announced Monday morning that she is running to bec…",
    "link": "https://freerepublic.com/focus/f-news/4309427/posts",
    "timestamp": "2025-04-07T15:12:09Z"
  },
  {
    "title": "US stocks sink further as Trump urges US to be 'courageous and patient'",
    "description": "The losses are only worsening for financial markets worldwide as worries rise about whether US President Donald Trump's trade war will torpedo the global economy.",
    "link": "https://www.abc.net.au/news/2025-04-08/donald-trump-tariffs-trade-war-markets/105148802",
    "timestamp": "2025-04-07T15:11:47Z"
  },
  {
    "title": "‘Little suns in the classroom’: Ukrainian city mourns children killed by Russian missile",
    "description": "Anger and outrage are gripping the hometown of Ukrainian President Volodymyr Zelenskyy as it holds funerals for some of the 20 people, including nine children, killed by a Russian missile that tore through apartment buildings and blasted a playground",
    "link": "https://abcnews.go.com/International/wireStory/suns-classroom-ukrainian-city-mourns-children-killed-russian-120561317",
    "timestamp": "2025-04-07T15:11:39Z"
  },
  {
    "title": "Trump Admin to Ramp Up Death Penalty Cases",
    "description": "The Trump administration will be seeking the death penalty \"whenever possible,\" Attorney General Pam Bondi said.",
    "link": "https://www.newsweek.com/trump-admin-ramp-death-penalty-cases-2056330",
    "timestamp": "2025-04-07T15:11:07Z"
  },
  {
    "title": "Israel's hostages have only one man fighting for them in D.C. – and it's not Netanyahu",
    "description": "The hostage families who are in touch with Trump's special Mideast envoy Steve Witkoff see him as the only person capable of saving their loved ones",
    "link": "https://www.haaretz.com/israel-news/2025-04-07/ty-article/.premium/israels-hostages-have-only-one-man-fighting-for-them-in-d-c-and-its-not-netanyahu/00000196-108e-ddaf-a5f6-918ebaa20000",
    "timestamp": "2025-04-07T15:11:03Z"
  },
  {
    "title": "Stocks plunge again as Trump tariffs continue to reverberate through markets (NBC News)",
    "description": "NBC News:\nStocks plunge again as Trump tariffs continue to reverberate through markets  —  The S&P 500 is now in bear market territory, down 20% from its most recent high.  —  U.S. stocks sank Monday as the financial turmoil that began last week following Pre…",
    "link": "https://www.memeorandum.com/250407/p47",
    "timestamp": "2025-04-07T15:10:00Z"
  },
  {
    "title": "‘This is suicidal’: Tucker Carlson says now is worst possible time for U.S. military strike on Iran",
    "description": "'Thousands of Americans would die. We'd lose the war that follows. Nothing would be more destructive to our country'",
    "link": "https://www.wnd.com/2025/04/this-is-suicidal-tucker-carlson-says-now-is-worst-possible-time-for-u-s-military-strike-on-iran/",
    "timestamp": "2025-04-07T15:09:09Z"
  },
  {
    "title": "Firings at Federal Health Agencies Decimate Offices That Release Public Records",
    "description": "The Department of Health and Human Services’ mass firings included people who fulfill Freedom of Information Act requests for the Centers for Disease Control and Prevention, National Institutes of Health, and FDA, which result in the release of records about …",
    "link": "https://kffhealthnews.org/news/article/hhs-firings-federal-health-agencies-foia-requests-public-records/",
    "timestamp": "2025-04-07T15:08:58Z"
  },
  {
    "title": "Trump stands firm on tariffs, urges public to stay patient as markets slide",
    "description": "Trump asserts that the tariffs are essential for rebalancing trade and revitalizing domestic manufacturing, specifically targeting China for its trade practices",
    "link": "https://www.thehindubusinessline.com/news/world/trump-stands-firm-on-tariffs-urges-public-to-stay-patient-as-markets-slide/article69423971.ece",
    "timestamp": "2025-04-07T15:08:25Z"
  },
  {
    "title": "Trump asks Supreme Court to block order requiring US to bring back man mistakenly deported to El Salvador",
    "description": "President Donald Trump’s administration urged the Supreme Court on Monday to block a lower court order requiring officials to bring a man who was mistakenly deported to El Salvador back to Maryland.",
    "link": "https://www.cnn.com/2025/04/07/politics/supreme-court-el-salvador-abrego-garcia/index.html",
    "timestamp": "2025-04-07T15:07:56Z"
  },
  {
    "title": "Why was Ben Affleck sporting a wedding ring on Friday? Fans question the timing after Jennifer Lopez divorce",
    "description": "Ben Affleck is filming a new thriller. He was seen wearing a ring on set. This happened after his divorce from Jennifer Lopez. The ring has caused speculation. Is it for the role or something else? Affleck has spoken about the divorce. He called it calm. Lope…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-was-ben-affleck-sporting-a-wedding-ring-on-friday-fans-question-the-timing-after-jennifer-lopez-divorce/articleshow/120068855.cms",
    "timestamp": "2025-04-07T15:07:41Z"
  },
  {
    "title": "Stock markets are tanking: Here’s what experts say you should do with your 401(k)",
    "description": "Stock markets are tanking: Here’s what experts say you should do with your 401(k)syracuse.com",
    "link": "https://www.syracuse.com/business/2025/04/stock-markets-are-tanking-heres-what-experts-say-you-should-do-with-your-401k.html",
    "timestamp": "2025-04-07T15:07:34Z"
  },
  {
    "title": "Elon Musk keeps subtly dissing Trump's tariffs",
    "description": "Musk's Monday morning post on X of a video celebrating international trade is just the latest in a string of pointed comments.",
    "link": "https://www.businessinsider.com/elon-musk-diss-trump-tariffs-trade-war-2025-4",
    "timestamp": "2025-04-07T15:07:18Z"
  },
  {
    "title": "\"Extremely Turbulent\": Russian Oil Market Rattled By Trump Tariff Fallout",
    "description": "Russia, whose economy is heavily dependent on oil, energy, and mineral exports to the world, is staring at a crisis should oil prices continue to plummet the way they are currently.",
    "link": "https://www.ndtv.com/world-news/extremely-turbulent-russian-oil-market-rattled-by-trump-tariff-fallout-8109931",
    "timestamp": "2025-04-07T15:06:17Z"
  },
  {
    "title": "'Fake news': Stocks crash anew as Karoline Leavitt disavows rumor of tariff 'pause'",
    "description": "Stock market investments took a wild swing as the White House disavowed rumors that President Donald Trump was considering a 90-day pause on his trade war.The Dow fell over 1,000 points just minutes after Monday's opening but swung into positive territory for…",
    "link": "https://www.rawstory.com/tariff-pause-fake-news/",
    "timestamp": "2025-04-07T15:06:08Z"
  },
  {
    "title": "Iranian-Backed Militias Reportedly Thinking Twice About Going To War With Trump: ‘Want To Avoid Such A Bad Scenario’",
    "description": "Iran-backed militias are reportedly considering laying down their arms to avoid President Donald Trump's wrath, according to Reuters Monday.",
    "link": "https://dailycaller.com/2025/04/07/iranian-backed-militias-thinking-twice-war-donald-trump-report/",
    "timestamp": "2025-04-07T15:05:23Z"
  },
  {
    "title": "'Don't be stupid,' says Donald Trump as he 'shoots himself in foot' with tariffs global markets meltdown",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c6fa0a43-d190-475c-af0e-f6242e19c1f1",
    "timestamp": "2025-04-07T15:04:57Z"
  },
  {
    "title": "JPMorgan CEO Jamie Dimon says Trump tariffs will boost inflation, slow an already weakening U.S. economy - NewsBreak",
    "description": "JPMorgan Chase CEO Jamie Dimon said tariffs announced by President Donald Trump will likely boost prices on both domestic and imported goods, weighing down",
    "link": "https://www.newsbreak.com/share/3952112379221-jpmorgan-ceo-jamie-dimon-says-trump-tariffs-will-boost-inflation-slow-an-already-weakening-u-s-economy?_f=app_share&pd=06vkfAbG&lang=en_US&send_time=1744038099&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.14.0.43%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v2%2Cns_local_strategy_25q1_exp-v11%2Cns_foryou_recall_exp_25q2-v2%2Cns_push_exp_rt_bucketv12-v4&s=i2",
    "timestamp": "2025-04-07T15:04:50Z"
  },
  {
    "title": "As stock markets tank and the global economy heads toward recession following Donald Trump's tariffs, here's how the crisis could be resolved",
    "description": "Global markets face challenges due to escalating trade tensions initiated by US President Donald Trump's tariffs. Nations are now actively seeking negotiations with Trump. Israel and Vietnam are among the countries wanting to negotiate. Kevin Hassett indicate…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-stock-markets-tank-and-the-global-economy-heads-toward-recession-following-donald-trumps-tariffs-heres-how-the-crisis-could-be-resolved/articleshow/120068191.cms",
    "timestamp": "2025-04-07T15:03:36Z"
  },
  {
    "title": "Prince Harry unhappy with Meghan Markle using children to promote brand, claims Royal Editor",
    "description": "Prince Harry has been uneasy about Meghan Markle showing off their children, Archie and Lilibet, to launch her new lifestyle brand, As Ever. The couple are said to be in disagreement over whether the children should be seen online, with Harry preferring secre…",
    "link": "https://economictimes.indiatimes.com/news/international/uk/prince-harry-unhappy-with-meghan-markle-using-children-to-promote-brand-claims-royal-editor/articleshow/120068883.cms",
    "timestamp": "2025-04-07T15:03:04Z"
  },
  {
    "title": "Trump Agriculture Sec. Has Pathetic Defense for Tariffing Penguins",
    "description": "The Trump administration has basically no answer for why it imposed tariffs on a group of uninhabited islands off the coast of Australia.\r\nIn an interview with CNN’s Jake Tapper Sunday, Agriculture Secretary Brooke Rollins insisted that there was something ve…",
    "link": "https://newrepublic.com/post/193672/donald-trump-agriculture-secretary-defense-tariffs-penguins",
    "timestamp": "2025-04-07T15:02:43Z"
  },
  {
    "title": "Trump allegedly weighs global 90-day tariffs halt except China",
    "description": "United States National Economic Council Director Kevin Hassett was reported telling CNBC on Monday that President Donald Trump is considering pausing tariffs on all countries except China for a period...",
    "link": "https://biztoc.com/x/0e0d95792efcffa7",
    "timestamp": "2025-04-07T15:02:15Z"
  },
  {
    "title": "Trump is reportedly planning the military parade he has long wanted for his 79th birthday",
    "description": "A large-scale military parade is reportedly being planned in Washington, D.C. The parade is said to be planned on June 14: the 250th anniversary of the U.S. Army, and Donald Trump's 79th birthday. Trump has long wanted a showy parade of military units after s…",
    "link": "https://biztoc.com/x/f94f33a75b93f3ac",
    "timestamp": "2025-04-07T15:02:06Z"
  },
  {
    "title": "Which Trump-supporting billionaires have lost the most from his new tariffs?",
    "description": "Wealth of world’s richest tycoons shrinks as US president’s trade war spooks investors\nBusiness live – latest updates\nWith global stock markets reeling from Donald Trump’s announcement of sweeping border taxes, some of the US president’s business allies have …",
    "link": "https://biztoc.com/x/974d28366c993265",
    "timestamp": "2025-04-07T15:01:53Z"
  },
  {
    "title": "Gold Price Today: Latest Update as Trump Tariffs Rock Markets",
    "description": "Gold prices saw a minor revival on Monday following the immediate reaction to Trump's \"reciprocal\" tariff announcements.",
    "link": "https://www.newsweek.com/gold-price-today-latest-update-trump-tariffs-rock-markets-2056338",
    "timestamp": "2025-04-07T15:01:45Z"
  },
  {
    "title": "L.A. Dodgers Visit Donald Trump at White House for World Series Celebration",
    "description": "The L.A. Dodgers will take on the Nats in D.C. on Monday night, but before they hit the diamond at Nationals Park ... they'll be partying with Donald Trump!!! Shohei Ohtani, Mookie Betts and the rest of the Boys in Blue will visit the White House…\n Permalink",
    "link": "https://www.tmz.com/2025/04/07/l-a-dodgers-visit-donald-trump-white-house-world-series-celebration/",
    "timestamp": "2025-04-07T15:01:09Z"
  },
  {
    "title": "Trump and Netanyahu will meet on tariffs, the war in Gaza and more",
    "description": "Netanyahu is the first foreign leader to visit Trump since he unleashed tariffs on countries around the world.",
    "link": "https://www.bostonherald.com/2025/04/07/trump-netanyahu-white-house-meeting/",
    "timestamp": "2025-04-07T15:01:09Z"
  },
  {
    "title": "Trump tells Americans to be patient as global markets keep dropping over tariffs",
    "description": "“Be Strong, Courageous, and Patient, and GREATNESS will be the result!” he wrote on Truth Social, his social media platform. The Republican president has insisted his tariffs are necessary to rebalance global trade and rebuild domestic manufacturing.",
    "link": "https://www.pbs.org/newshour/politics/trump-tells-americans-to-be-patient-as-global-markets-keep-dropping-over-tariffs",
    "timestamp": "2025-04-07T15:01:01Z"
  },
  {
    "title": "EU Offering Trump ‘Zero-for-Zero Tariffs for Industrial Goods’",
    "description": "\"But we are also prepared to respond through countermeasures and defend our interests. And in addition, we will also protect ourselves against indirect effects through trade diversion.\"\nThe post EU Offering Trump ‘Zero-for-Zero Tariffs for Industrial Goods’ f…",
    "link": "https://legalinsurrection.com/2025/04/eu-offering-trump-zero-for-zero-tariffs-for-industrial-goods/",
    "timestamp": "2025-04-07T15:00:56Z"
  },
  {
    "title": "Apple stocked up on iPhones and more before Trump tariffs kicked in",
    "description": "Apple rushed iPhones and other inventory into the U.S. before Trump tariffs hit. This might mean price hikes won’t be necessary… for now.\n(via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "link": "https://www.cultofmac.com/news/trump-tariffs-apple-stockpiled-iphone",
    "timestamp": "2025-04-07T15:00:55Z"
  },
  {
    "title": "ACLU lawyer warns under Trump 'anybody can be picked up' and deported with no judicial oversight",
    "description": "ACLU attorney Lee Gelernt criticized the Trump administration on CBS’ “60 Minutes\" for using the Alien Enemies Act to deport dangerous illegal immigrants.",
    "link": "https://www.foxnews.com/media/aclu-lawyer-warns-under-trump-anybody-can-picked-up-deported-no-judicial-oversight",
    "timestamp": "2025-04-07T15:00:16Z"
  },
  {
    "title": "NEWSMAX Host Shocked by How Badly Personal Wealth Tanks...",
    "description": "“I looked at my 401(k) and gasped,” Jon Glasgow said.",
    "link": "https://www.thedailybeast.com/newsmax-host-jon-glasgow-shocked-at-how-badly-trump-tariffs-hit-their-personal-wealth/",
    "timestamp": "2025-04-07T15:00:03Z"
  },
  {
    "title": "A European View of Trump",
    "description": "Finian O’Toole is an opinion writer for The Irish Times. My friend Carol Burris shared this brilliant column with me. He writes: Sixty years ago, Bob Dylan chanted that “even the president of the United States/ Sometimes must have to stand naked”. But now the…",
    "link": "https://dianeravitch.net/2025/04/07/a-european-view-of-trump/",
    "timestamp": "2025-04-07T15:00:00Z"
  },
  {
    "title": "David W Higgins: Hello tariffs, goodbye full employment – why we should be more worried about the coming recession",
    "description": "About 5,000 students take up the study of economics in our secondary schools each year. It’s nothing compared to the 57,000 who study English, but which provides more drama?",
    "link": "https://www.independent.ie/opinion/comment/david-w-higgins-hello-tariffs-goodbye-full-employment-why-we-should-be-more-worried-about-the-coming-recession/a89277868.html",
    "timestamp": "2025-04-07T15:00:00Z"
  },
  {
    "title": "Congressional Republicans can derail Trump’s tariff plans, but will they?",
    "description": "Several congressional Republicans agree that it's time to intervene in response to Donald Trump's tariffs. The bipartisan bills, however, face an uphill climb.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/congressional-republicans-can-derail-trumps-tariff-plans-will-rcna199989",
    "timestamp": "2025-04-07T14:59:55Z"
  },
  {
    "title": "Masters Tournament 2025: Schedule, odds, expectations for all golfers and other details",
    "description": "The 89th edition of the Masters Tournament is scheduled to take place from April 10 to April 13 this year, with the annual Par 3 Tournament set for April 9. The event takes place at the Augusta National Golf Club in Georgia. Here's a look at the complete sche…",
    "link": "https://economictimes.indiatimes.com/news/international/us/masters-tournament-2025-schedule-odds-expectations-for-all-golfers-and-other-details/articleshow/120068758.cms",
    "timestamp": "2025-04-07T14:59:38Z"
  },
  {
    "title": "Russia Reacts to Hands Off! Protests: 'Deep State Applying Its Playbook'",
    "description": "On Saturday, tens of thousands of protesters angered by Donald Trump's leadership took to the streets in all 50 states.",
    "link": "https://www.newsweek.com/russia-hands-off-protests-trump-musk-2056339",
    "timestamp": "2025-04-07T14:59:26Z"
  },
  {
    "title": "White House shoots down rumors of 90-day tariff pause as Trump allies brush off recession fears, play up tax cut hopes",
    "description": "The White House wants to make one thing clear: The Trump administration is not backing down on implementing reciprocal tariffs April 9.",
    "link": "https://finance.yahoo.com/news/white-house-shoots-down-rumors-of-90-day-tariff-pause-as-trump-allies-brush-off-recession-fears-145918239.html",
    "timestamp": "2025-04-07T14:59:18Z"
  },
  {
    "title": "21世紀のラッド王",
    "description": "という論説（原題は「King Ludd in the 21st Century」）をDelhi School of EconomicsのParikshit GhoshがThe India Forumに書いている（H/T Mostly Economics）。 以下はMostly Economicsが引用した冒頭部の孫引き。 For Democrats, losing one election to Donald Trump may be regarded as misfortune; losing two look…",
    "link": "https://himaginary.hatenablog.com/entry/20250407/donald-trump-king-ludd-in-the-21st-century",
    "timestamp": "2025-04-07T14:59:00Z"
  },
  {
    "title": "China’s World – or Europe’s?",
    "description": "Now that the old geopolitical order has been canceled, China and Russia are ready to step into the vacuum and create a new one. Unless Europe launches an effort to adopt the alliance structure that the United States has now abandoned, it will find itself in a…",
    "link": "https://www.project-syndicate.org/commentary/europe-must-take-over-us-alliance-structure-by-orville-schell-2025-04",
    "timestamp": "2025-04-07T14:58:37Z"
  },
  {
    "title": "‘She’s Right Off the Movie Poltergeist!’ House Republican Calls Laura Loomer ‘Crazy’ After Trump Follows Her Orders",
    "description": "Rep. Don Bacon (R-NE) didn’t hold back when asked about President Donald Trump’s recent firings of top cyber and intelligence officials.\nThe post ‘She’s Right Off the Movie Poltergeist!’ House Republican Calls Laura Loomer ‘Crazy’ After Trump Follows Her Orde…",
    "link": "https://www.mediaite.com/podcasts/shes-right-off-the-movie-poltergeist-house-republican-calls-laura-loomer-crazy-after-trump-follows-her-orders/",
    "timestamp": "2025-04-07T14:58:27Z"
  },
  {
    "title": "Trade War Ignites Inflation Expectations, Bank of Canada Says",
    "description": "Bank of Canada surveys show firms believe upward price pressures from the trade conflict with the US will exceed the downward pull from weaker demand, threatening to undo progress on keeping inflation expectations well-anchored.",
    "link": "https://financialpost.com/pmn/business-pmn/trade-war-ignites-inflation-expectations-bank-of-canada-says",
    "timestamp": "2025-04-07T14:58:15Z"
  },
  {
    "title": "BREAKING: The S&P 500 gains $4 trillion following EU announcement of interest in zero for zero tariffs with United States.",
    "description": "Benny Johnson @bennyjohnson BREAKING: The S&P 500 gains $4 trillion following EU announcement of interest in zero for zero tariffs with United States. Last edited 9:43 AM · Apr 7, 2025",
    "link": "https://freerepublic.com/focus/f-news/4309416/posts",
    "timestamp": "2025-04-07T14:57:52Z"
  }
]