[
  {
    "title": "DHS to focus on arresting illegal immigrants with serious offenses amid negative polling on ICE raids: report",
    "description": "DHS is shifting immigration enforcement away from mass raids and focusing its efforts more on arresting convicted criminals amid negative polling concerns,",
    "link": "https://www.foxnews.com/politics/dhs-focus-arresting-illegal-immigrants-serious-offenses-amid-negative-polling-ice-raids-report",
    "timestamp": "2025-12-13T08:43:53Z"
  },
  {
    "title": "US envoy to meet Zelenskyy, Europe leaders in Berlin this weekend",
    "description": "KYIV: US President Donald Trump's special envoy will meet with Volodymyr Zelenskyy and other European leaders in Berlin this weekend, the White House said, as Washington presses for a plan to end Russia's war with Ukraine.Trump has been stepping up pressure o…",
    "link": "https://www.channelnewsasia.com/world/us-envoy-witkoff-meet-zelenskyy-europe-leaders-berlin-5580371",
    "timestamp": "2025-12-13T08:37:00Z"
  },
  {
    "title": "Colombia’s ELN rebels prepare for battle amid Trump ‘intervention’ threat",
    "description": "ELN conducts military drills, orders civilians indoors, as Trump warns drug-producing nations face potential attack.",
    "link": "https://www.aljazeera.com/news/2025/12/13/colombias-eln-rebels-prepare-for-battle-amid-trump-intervention-threat",
    "timestamp": "2025-12-13T08:31:22Z"
  },
  {
    "title": "What’s at Stake in Trump’s Executive Order Aiming to Curb State-Level AI Regulation",
    "description": "Fortunately, an executive order won't stop states from restricting AI. But expect the Administration to try other routes.",
    "link": "https://www.nakedcapitalism.com/2025/12/whats-at-stake-in-trumps-executive-order-aiming-to-curb-state-level-ai-regulation.html",
    "timestamp": "2025-12-13T08:30:02Z"
  },
  {
    "title": "Green stocks are big winners as tech boom drives energy demand",
    "description": "Instead, the sector is booming as artificial intelligence powers massive demand for all kinds of energy.  The S&P Global Clean Energy Transition Index has...",
    "link": "https://finance.yahoo.com/news/green-stocks-big-winners-tech-083000564.html",
    "timestamp": "2025-12-13T08:30:00Z"
  },
  {
    "title": "Late Night Open Thread: … ‘Power without Responsibility, the Prerogative of the Harlot… ‘",
    "description": "Yikes! \"Olivia Nuzzi’s ‘Canto’ Sells Just 1,200 Print Copies In First Week\" Mary Whitfill Roeloffs for @forbes.com [image or embed] — Zach Everson (@zacheverson.com) December 11, 2025 at 10:14 AM For the record (it’s usually abbreviated), the full quote was a…",
    "link": "https://balloon-juice.com/2025/12/13/late-night-open-thread-power-without-responsibility-the-prerogative-of-the-harlot/",
    "timestamp": "2025-12-13T08:22:45Z"
  },
  {
    "title": "US envoy to meet Zelensky and European leaders in Germany to discuss peace plan",
    "description": "Donald Trump has been stepping up pressure on Kyiv to reach an agreement.",
    "link": "https://www.thejournal.ie/us-envoy-meet-ukraine-6902699-Dec2025/",
    "timestamp": "2025-12-13T08:10:45Z"
  },
  {
    "title": "ICYMI: the week's 7 biggest tech stories from testing Android XR glasses to a revolutionary smart ring",
    "description": "The top tech news stories from Disney, Paramount, DC, Android, and more for December 12, 2025.",
    "link": "https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-stories-from-testing-android-xr-glasses-to-a-revolutionary-smart-ring",
    "timestamp": "2025-12-13T08:00:00Z"
  },
  {
    "title": "Thailand strikes Cambodia despite Trump truce claims",
    "description": "Thailand says it is continuing strikes on its neighbor even though the US president says both sides agreed a ceasefire. The violence comes amid a decades-old territorial conflict.",
    "link": "https://www.dw.com/en/thailand-strikes-cambodia-despite-trump-truce-claims/a-75140217",
    "timestamp": "2025-12-13T07:46:00Z"
  },
  {
    "title": "Cambodia shuts borders with Thailand as fighting continues",
    "description": "The ongoing violence between Thailand and Cambodia comes despite claims by the US president that the two sides had agreed a ceasefire.",
    "link": "https://www.dw.com/en/cambodia-shuts-borders-with-thailand-as-fighting-continues/a-75140217",
    "timestamp": "2025-12-13T07:46:00Z"
  },
  {
    "title": "Cambodia shuts borders with Thailand amid ongoing fighting",
    "description": "The violence between Thailand and Cambodia comes despite claims by US President Donald Trump that the two sides had agreed a ceasefire.",
    "link": "https://www.dw.com/en/cambodia-shuts-borders-with-thailand-amid-ongoing-fighting/a-75140217",
    "timestamp": "2025-12-13T07:46:00Z"
  },
  {
    "title": "Fighting rages on Thai-Cambodian border despite Trump's ceasefire claim",
    "description": "Fighting is continuing along the Thailand-Cambodia border despite U.S. President Donald Trump's claim of a ceasefire agreement",
    "link": "https://abcnews.go.com/International/wireStory/fighting-rages-thai-cambodian-border-despite-trumps-ceasefire-128367781",
    "timestamp": "2025-12-13T07:42:41Z"
  },
  {
    "title": "US envoy Witkoff to meet Zelenskiy and European leaders in Berlin for latest Ukraine talks",
    "description": "Witkoff has led negotiations ⁠with Ukraine and Russia regarding ⁠a US peace proposal",
    "link": "https://www.irishtimes.com/world/europe/2025/12/13/us-envoy-witkoff-to-meet-zelenskiy-and-european-leaders-in-berlin-for-latest-ukraine-talks/",
    "timestamp": "2025-12-13T07:41:45Z"
  },
  {
    "title": "Fighting rages on Thai-Cambodian border despite Trump's ceasefire claim",
    "description": "Fighting continued to rage Saturday morning along the border of Thailand and Cambodia, even after U.S. President Donald Trump, acting as a mediator, declared...",
    "link": "https://www.yahoo.com/news/articles/fighting-rages-thai-cambodian-border-073500006.html",
    "timestamp": "2025-12-13T07:35:00Z"
  },
  {
    "title": "Trump says he is leaning toward Warsh or Hassett to lead the Fed: Reports",
    "description": "Amidst ongoing discussions about fiscal policy, President Donald Trump has identified two potential candidates for the role of Federal Reserve chair. His stance is clear; he wants to be part of the conversation around interest rate decisions, having openly ch…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-says-he-is-leaning-toward-warsh-or-hassett-to-lead-the-fed-wsj-reports/articleshow/125946257.cms",
    "timestamp": "2025-12-13T07:24:26Z"
  },
  {
    "title": "House Democrats release Trump pics from Epstein estate",
    "description": "US News: WASHINGTON: House Democrats released a selection of photos from the estate of Jeffrey Epstein on Friday, including some of Donald Trump, Bill Clinton .",
    "link": "https://timesofindia.indiatimes.com/world/us/house-democrats-release-trump-pics-from-epstein-estate/articleshow/125946126.cms",
    "timestamp": "2025-12-13T07:20:39Z"
  },
  {
    "title": "Witkoff Will Meet With European Leaders, Zelensky in Berlin This Weekend - Reports",
    "description": "MOSCOW (Sputnik) - US special envoy Steve Witkoff will meet with Volodymyr Zelensky and European leaders in Berlin this weekend to discuss the Ukraine settlement, media reported, citing sources.",
    "link": "https://sputnikglobe.com/20251213/witkoff-will-meet-with-european-leaders-zelensky-in-berlin-this-weekend---reports-1123287859.html",
    "timestamp": "2025-12-13T07:13:39Z"
  },
  {
    "title": "Defence spending takes centre stage as weak links exposed",
    "description": "The Government's €1.7bn defence spending plan, announced this week, comes at a time when there is a widespread perception that Ireland lags far behind its neighbours when it comes to defence and security, writes Joe Mag Raollaigh.",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/1213/1548811-defence-spending-plan/",
    "timestamp": "2025-12-13T07:01:00Z"
  },
  {
    "title": "Schattenfroh: A Fable About Totalitarianism Written in Brain-Fluid",
    "description": "An interview with the book’s author Michael Lentz and its translator, Max Lawton, about the German cult novel Schattenfroh, a bizarre and troubling novel for our bizarre and troubling times, and its timely appearance in an English-language edition\nThere is a …",
    "link": "https://thequietus.com/culture/books/schattenfroh-a-fable-about-totalitarianism-written-in-brain-fluid/",
    "timestamp": "2025-12-13T07:00:00Z"
  },
  {
    "title": "Ukraine updates: US envoy heads to Berlin for peace talks",
    "description": "US Special Envoy Steve Witkoff is set to meet with Ukraine's Zelenskyy and other leaders as Washington steps up pressure on Kyiv to reach an agreement on a US-led peace proposal. DW has more. US special envoy Steve Witkoff, Kushner to meet Zelenskyy and senio…",
    "link": "https://www.dw.com/en/ukraine-updates-us-envoy-heads-to-berlin-for-peace-talks/live-75139974",
    "timestamp": "2025-12-13T06:57:00Z"
  },
  {
    "title": "Cambodia, Thai Clashes Continue After Trump's Ceasefire Claim",
    "description": "Thailand said it will continue military actions against Cambodia to eliminate “harm and threats,” stepping up rhetoric even after US President Donald Trump claimed to have brokered a new ceasefire. Fighting entered its seventh day across the two countries’ di…",
    "link": "https://www.ndtvprofit.com/world/cambodia-thai-clashes-continue-after-trumps-ceasefire-claim",
    "timestamp": "2025-12-13T06:56:42Z"
  },
  {
    "title": "US Tariff Revenue Falls For First Time Since Trump's Import Taxes In April— Massive $38 Trillion Debt Reduction Plan At Risk?",
    "description": "Tariff revenue declined month-over-month for the first time since President Donald Trump imposed import taxes in April, according to Treasury Department data released on Wednesday. \nThe government collected $30.75 billion in customs duties in November, down f…",
    "link": "https://biztoc.com/x/4987acf6b5ac76d4",
    "timestamp": "2025-12-13T06:33:08Z"
  },
  {
    "title": "US envoy to meet Zelensky, Europe leaders in Berlin this weekend",
    "description": "U.S. President Donald Trump's special envoy will meet with Volodymyr Zelensky and other European leaders in Berlin this weekend, the White House said, as Washington presses for a plan to end Russia's war with Ukraine.",
    "link": "https://www.hurriyetdailynews.com/us-envoy-to-meet-zelensky-europe-leaders-in-berlin-this-weekend-216761",
    "timestamp": "2025-12-13T06:32:58Z"
  },
  {
    "title": "US seized tanker near Venezuela just as warrant was set to expire, court document shows",
    "description": "WASHINGTON, Dec 12 (Reuters) - The U.S. government carried out its seizure of the M/T Skipper off the coast of Venezuela on Wednesday just as a judge-signed warrant was set to expire, according to the document which was unsealed on Friday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/13/us-seized-tanker-near-venezuela-just-as-warrant-was-set-to-expire-court-document-shows",
    "timestamp": "2025-12-13T06:22:00Z"
  },
  {
    "title": "Democrats release new Epstein photos showing Trump, Clinton, others",
    "description": "Democrats release new Epstein photos showing Donald Trump, Bill Clinton, and others, raising more questions about his ties to powerful figures.\n\nRead More: https://punchng.com/democrats-release-new-epstein-photos-showing-trump-clinton-others/",
    "link": "https://punchng.com/democrats-release-new-epstein-photos-showing-trump-clinton-others/",
    "timestamp": "2025-12-13T06:21:19Z"
  },
  {
    "title": "'This time feels different': One cannabis investment insider thinks the industry will keep rallying following the latest reports of regulatory changes",
    "description": "A big rally in cannabis stocks Friday on reports that the administration may revamp marijuana's Federal drug classification may herald the start of a new bull run, according to Tim Seymour, founder of Seymour Asset Management. A source told CNBC that Presiden…",
    "link": "https://biztoc.com/x/29960e73abb409a1",
    "timestamp": "2025-12-13T06:10:55Z"
  },
  {
    "title": "Kiefer Sutherland: ‘After 24, I thought opportunities would be staring me in the face – but they weren’t’",
    "description": "The actor who gave us Jack Bauer talks to Louis Chilton about his new Christmas comedy ‘Tinsel Town’, the ‘ironic’ state of modern television, and why his acting style is so starkly different from that of his father",
    "link": "https://www.the-independent.com/arts-entertainment/films/features/kiefer-sutherland-interview-24-tinsel-town-donald-b2879024.html",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "Why won’t Waterford council name US investor buying €2.3m of public land for just €50,000?",
    "description": "Council sees development as improving access to southeast and boosting local economy but secrecy is not sustainable",
    "link": "https://www.irishtimes.com/business/2025/12/13/waterford-council-wont-name-us-investor-buying-23m-of-public-land-for-just-50000/",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "Trump administration removes 9,500 truck drivers for failing English tests in safety crackdown",
    "description": "The Trump administration has removed over 9,500 commercial truck drivers from U.S. roads for failing English proficiency tests, citing concerns over road safety, emergency communication and compliance with traffic signs. Transportation Secretary Sean Duffy em…",
    "link": "https://www.naturalnews.com/2025-12-13-trump-removes-truck-drivers-for-failing-english-tests.html",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "Venezuela accuses the U.S. of international PIRACY following tanker seizure",
    "description": "Caracas condemned the seizure of a Venezuelan oil tanker (“The Skipper”) by U.S. forces as an illegal theft of national resources, framing it as part of Washington’s agenda to plunder Venezuela’s oil reserves. The Trump administration defended the operation, …",
    "link": "https://www.naturalnews.com/2025-12-13-venezuela-accuses-us-international-piracy-tanker-seizure.html",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "Trump administration poised to downgrade federal marijuana restrictions",
    "description": "President Trump is expected to order a federal reclassification of marijuana from Schedule I to Schedule III. The shift would ease research restrictions and reduce financial burdens on the legal cannabis industry. The move follows years of advocacy and a stal…",
    "link": "https://www.naturalnews.com/2025-12-13-trump-administration-to-downgrade-federal-marijuana-restrictions.html",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "NATO chief warns Europe must prepare for war against Russia",
    "description": "North Atlantic Treaty Organization (NATO) Secretary General Mark Rutte warned that Russia could attack NATO within five years, urging member states to urgently increase defense spending and weapons production to deter a potential conflict rivaling World War I…",
    "link": "https://www.naturalnews.com/2025-12-13-nato-chief-europe-prepare-war-against-russia.html",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "Megaphone Trumplomacy: One year on, Trump remains neither a peacemaker nor a friend of Europe",
    "description": "In the first year of his second term, Trump has claimed credit for ending the Gaza war, and failed to  curb Putin’s aggression",
    "link": "https://www.irishtimes.com/life-style/people/2025/12/13/megaphone-trumplomacy-one-year-on-trump-remains-neither-a-peacemaker-nor-a-friend-of-europe/",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "This Derby Is Ours: Sunderland Reborn And Ready",
    "description": "﻿So for the first time in the league for nearly a decade, sing your heart out for the Lads, trust in Le Bris, puff your chest out, and whatever the result stand on your principles and be unapologetically Sunderland ’til I die.",
    "link": "https://rokerreport.sbnation.com/opinion/117313/this-derby-is-ours-sunderland-reborn-and-ready",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "Hamas halts ceasefire progress citing Israeli violations",
    "description": "Hamas has halted all talks on the next phase of the Gaza ceasefire, accusing Israel of violating the initial agreement by not fully withdrawing the troops and by severely restricting human aid. A major point of conflict is Israel’s control over aid and border…",
    "link": "https://www.naturalnews.com/2025-12-13-hamas-halts-ceasefire-progress-citing-israeli-violations.html",
    "timestamp": "2025-12-13T06:00:00Z"
  },
  {
    "title": "Influential US lawmakers Introduce Resolution To End 50% Tariffs Imposed By Trump On India",
    "description": "Three influential US lawmakers have introduced a resolution in Congress aimed at ending the tariffs imposed by President Donald Trump on India, saying the “irresponsible tariff strategy” toward Delhi is a counterproductive approach that \"weakens a critical pa…",
    "link": "https://www.ndtvprofit.com/world/influential-us-lawmakers-introduce-resolution-to-end-50-tariffs-imposed-by-trump-on-india",
    "timestamp": "2025-12-13T05:52:42Z"
  },
  {
    "title": "Trump Announces Thailand, Cambodia Agree to ‘Cease All Shooting’",
    "description": "President Donald Trump announced on Friday that Thailand and Cambodia have agreed to “cease all shooting,” following a tense week of escalating clashes that threatened to destroy the ceasefire agreement he negotiated between the two countries in July.\nThe pos…",
    "link": "https://www.breitbart.com/asia/2025/12/12/trump-announces-thailand-cambodia-agree-cease-all-shooting/",
    "timestamp": "2025-12-13T05:52:28Z"
  },
  {
    "title": "MAGA Senator Ron Johnson Endorses Book Promoting Bleach-Like Chemical to Treat Cancer",
    "description": "Sen. Ron Johnson is cosigning a new theory from a doctor who lost his medical certification for spreading disinformation.",
    "link": "https://www.thedailybeast.com/maga-senator-ron-johnson-endorses-book-promoting-bleach-like-chemical-to-treat-cancer/",
    "timestamp": "2025-12-13T05:42:14Z"
  },
  {
    "title": "\"No big deal\": Trump plays down after his photos surface with Epstein",
    "description": "President Trump downplayed newly released photos showing him with convicted sex offender Jeffrey Epstein, stating he knew nothing about him and that \"everybody knew this man.\" The images, released by the House Oversight Committee, also feature Bill Clinton, B…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-big-deal-trump-plays-down-after-his-photos-surface-with-epstein/articleshow/125944954.cms",
    "timestamp": "2025-12-13T05:39:29Z"
  },
  {
    "title": "Border Tsar Homan Announces Investigation Into Rep. Ilhan Omar: A Case For Fraud Or Defamation?",
    "description": "This week, the lingering allegations over the marital history of Rep. Ilhan Omar (D., Minn.) took an ominous step when Border Tsar Tom Homan publicly acknowledged that the government is looking into the matter.Rep. Omar has long denied that she married her br…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357168/posts",
    "timestamp": "2025-12-13T05:39:20Z"
  },
  {
    "title": "White farmers are getting a taste of their own medicine",
    "description": "Trump’s tariffs and immigration raids are driving the latest farm crisis. White farmers have stood by him year after year—and still do. On Monday, Donald Trump announced that his administration will give farmers a $12 billion bailout—a tacit admission that hi…",
    "link": "https://freerepublic.com/focus/f-news/4357167/posts",
    "timestamp": "2025-12-13T05:39:16Z"
  },
  {
    "title": "Taoiseach warns that US airport security demand for access to five years of social media activity is ‘unworkable’",
    "description": "Taoiseach Micheál Martin hailed US president Donald Trump as “a sensible guy” as he warned a US demand for access to five years of social media activity as part of American visa screening was simply unworkable.",
    "link": "https://www.independent.ie/irish-news/taoiseach-warns-that-us-airport-security-demand-for-access-to-five-years-of-social-media-activity-is-unworkable/a9154317.html",
    "timestamp": "2025-12-13T05:30:00Z"
  },
  {
    "title": "Ukrainians retake part of town in boost to diplomatic efforts",
    "description": "Ukrainian forces said they had retaken parts of the north-eastern town of Kupiansk and had encircled Russian troops there as president Volodymyr Zelensky visited the area and praised the operation, saying it strengthened Ukraine diplomatically.",
    "link": "https://www.independent.ie/world-news/europe/ukrainians-retake-part-of-town-in-boost-to-diplomatic-efforts/a920134891.html",
    "timestamp": "2025-12-13T05:30:00Z"
  },
  {
    "title": "Your Blood Will Run Cold When You Hear How Many Afghans With Terror Ties Were Welcomed Into US by Biden",
    "description": "In a Friday morning appearance on Fox News' Fox & Friends, Director of National Intelligence (DNI) Tulsi Gabbard said the Biden administration had let more than 2,000 Afghan nationals with terrorism ties into the United States in the wake of the 2021 botched …",
    "link": "https://freerepublic.com/focus/f-news/4357163/posts",
    "timestamp": "2025-12-13T05:25:46Z"
  },
  {
    "title": "Border Patrol Chief Gives Update On When Feds Can Finally Deport Kilmar Abrego Garcia",
    "description": "Greg Bovino told Jesse Watters that adjudicated MS-13 member Kilmar Abrego Garcia would be removed from the United States as soon as “he becomes deportable.”",
    "link": "https://dailycaller.com/2025/12/13/border-patrol-chief-gives-update-on-when-feds-can-finally-deport-kilmar-abrego-garcia/",
    "timestamp": "2025-12-13T05:20:25Z"
  },
  {
    "title": "Jon Stewart Spills Why 'No Level Of A**-Kissing' Will Please Trump",
    "description": "The \"Daily Show\" host blasted the president for attacking the media over reports on his health.",
    "link": "https://www.huffpost.com/entry/jon-stewart-trump-media-reporting-health-weekly-show_n_693cd1f3e4b0d58462be51ca",
    "timestamp": "2025-12-13T05:11:55Z"
  },
  {
    "title": "Knives Out director Rian Johnson: ‘Daniel Craig never requires encouragement to go big’",
    "description": "Rian Johnson, director of Wake Up Dead Man: A Knives Out Mystery, on Agatha Christie, religion and Columbo",
    "link": "https://www.irishtimes.com/culture/film/2025/12/13/knives-out-director-rian-johnson-daniel-craig-never-requires-encouragement-to-go-big/",
    "timestamp": "2025-12-13T05:11:00Z"
  },
  {
    "title": "Trump's $100,000 H-1B visa fee draws legal challenge from US states",
    "description": "California and 19 states challenge Trump's $100,000 H-1B visa fee, arguing it violates federal law and burdens essential services.",
    "link": "https://www.thehindubusinessline.com/news/world/trumps-100000-h-1b-visa-fee-draws-legal-challenge-from-usstates/article70391544.ece",
    "timestamp": "2025-12-13T05:10:29Z"
  },
  {
    "title": "What to know about Kilmar Abrego Garcia's release from immigration custody",
    "description": "Kilmar Abrego Garcia, whose mistaken deportation helped galvanize opposition to President Donald Trump’s immigration policies, has been released from immigration detention, and a judge has temporarily blocked any further efforts to detain him",
    "link": "https://abcnews.go.com/US/wireStory/kilmar-abrego-garcias-release-immigration-custody-128367389",
    "timestamp": "2025-12-13T05:10:26Z"
  },
  {
    "title": "Historic rains and flooding trigger dramatic rescues in Washington state",
    "description": "Record floodwaters are slowly receding in Washington state after triggering evacuations, inundating communities and prompting dramatic rescues from rooftops and vehicles",
    "link": "https://abcnews.go.com/US/wireStory/historic-rains-flooding-trigger-dramatic-rescues-washington-state-128367386",
    "timestamp": "2025-12-13T05:10:13Z"
  },
  {
    "title": "Witkoff to meet Zelensky for latest Ukraine war talks",
    "description": "Donald Trump's envoy will meet the Ukrainian president and European leaders in Berlin to discuss the latest peace plan.",
    "link": "https://www.bbc.com/news/articles/c0l9954yr9ko",
    "timestamp": "2025-12-13T05:09:11Z"
  },
  {
    "title": "Historic rains and flooding trigger dramatic rescues in Washington state",
    "description": "When Eddie Wicks and his wife went to bed in their house next to the Snoqualmie River on a Washington state farm known for its sunflower mazes and Christmas ...",
    "link": "https://www.yahoo.com/news/articles/historic-rains-flooding-trigger-dramatic-050357641.html",
    "timestamp": "2025-12-13T05:03:57Z"
  },
  {
    "title": "Stephanie Ruhle Apologizes to Guest for Sexually Suggestive Comment Involving Trump: ‘That Sounded Gross’",
    "description": "Stephanie Ruhle immediately regretted what she called \"gross\" phrasing on her part during a discussion about President Donald Trump. \nThe post Stephanie Ruhle Apologizes to Guest for Sexually Suggestive Comment Involving Trump: ‘That Sounded Gross’ first appe…",
    "link": "https://www.mediaite.com/media/tv/stephanie-ruhle-apologizes-to-guest-for-sexually-suggestive-comment-involving-trump-that-sounded-gross/",
    "timestamp": "2025-12-13T05:02:00Z"
  },
  {
    "title": "The Washington Roundtable’s 2025 in Review",
    "description": "Taking stock of how American norms, ideals, and values have been transformed by Trump 2.0.",
    "link": "https://www.newyorker.com/podcast/political-scene/the-washington-roundtables-2025-in-review",
    "timestamp": "2025-12-13T04:59:00Z"
  },
  {
    "title": "Thailand's PM says attacks on Cambodia 'will continue'",
    "description": "Cambodia has said Thailand is continuing to drop bombs on its territory hours after US President Donald Trump said the two nations had agreed to stop fighting.",
    "link": "https://www.rte.ie/news/asia/2025/1213/1548836-cambodia-thailand/",
    "timestamp": "2025-12-13T04:58:46Z"
  },
  {
    "title": "X: Donald Trump is the only President in history that has had recess appointments blocked by his own party",
    "description": "Donald Trump is the only President in history that has had recess appointments blocked by his own party.Think about that.Traitors.They held 2 minute pro forma sessions every few days during vacation to block recess his appointments.Sickening.Video at link.",
    "link": "https://freerepublic.com/focus/f-news/4357159/posts",
    "timestamp": "2025-12-13T04:53:37Z"
  },
  {
    "title": "Nvidia may increase H200 AI chip output amid high demand from Chinese companies including Alibaba, ByteDance: Report",
    "description": "Nvidia is considering increasing production of its H200 AI chips for Chinese clients due to high demand. Major companies like Alibaba and ByteDance are interested in large orders.",
    "link": "https://www.livemint.com/companies/news/nvidia-may-increase-h200-ai-chip-output-amid-high-demand-from-chinese-companies-including-alibaba-bytedance-report-11765596731165.html",
    "timestamp": "2025-12-13T04:52:34Z"
  },
  {
    "title": "Exclusive – Marsha Blackburn Defends Seizure of Venezuelan Oil Tanker: 'We're Enforcing Sanctions'",
    "description": "Sen. Marsha Blackburn (R-TN) defended the seizure of a Venezuelan oil tanker, contending that President Donald Trump is totally within his right on this and that the United States is simply enforcing sanctions.\nThe post Exclusive – Marsha Blackburn Defends Se…",
    "link": "https://www.breitbart.com/radio/2025/12/12/exclusive-marsha-blackburn-defends-seizure-of-venezuelan-oil-tanker-were-enforcing-sanctions/",
    "timestamp": "2025-12-13T04:50:11Z"
  },
  {
    "title": "Trump eyes another high-profile takeover plan in the nation’s capital",
    "description": "President Donald Trump is setting his sights on Washington, D.C.’s public golf courses, with a particular focus on East Potomac Golf Links – situated on a prime stretch of riverfront real estate – according to an exclusive Wall Street Journal report.The push …",
    "link": "https://www.rawstory.com/trump-takeover/",
    "timestamp": "2025-12-13T04:32:09Z"
  },
  {
    "title": "War for Ukraine Day 1,387: Putin Does Not Recognize Anyone Else’s Sphere of Influence and Near Abroad",
    "description": "A quick housekeeping note: Thank you all for keeping it civil in the comments last night. It is much appreciated. As I wrote about and then we discussed in the comments over the weekend, the new National Security Strategy goes all in on the western hemisphere…",
    "link": "https://balloon-juice.com/2025/12/12/war-for-ukraine-day-1387-putin-does-not-recognize-anyone-elses-sphere-of-influence-and-near-abroad/",
    "timestamp": "2025-12-13T04:21:44Z"
  },
  {
    "title": "US envoy to meet Zelensky, European leaders in Germany",
    "description": "US President Donald Trump's special envoy will meet Ukrainian President Volodymyr Zelensky and other European leaders in Berlin this weekend, the White House has said, as Washington presses for a plan to end Russia's war in Ukraine.",
    "link": "https://www.rte.ie/news/ukraine/2025/1213/1548835-ukraine-russia/",
    "timestamp": "2025-12-13T04:21:35Z"
  },
  {
    "title": "Fox’s Maria Bartiromo Goes All-Out to Convince Viewers ‘This Affordability Issue Is a Hoax,’ Insists ‘The Economy Is Doing Well’",
    "description": "Fox Business host Maria Bartiromo insisted that all is well and good in the economy of President Donald Trump.\nThe post Fox’s Maria Bartiromo Goes All-Out to Convince Viewers ‘This Affordability Issue Is a Hoax,’ Insists ‘The Economy Is Doing Well’ first appe…",
    "link": "https://www.mediaite.com/media/tv/foxs-maria-bartiromo-goes-all-out-to-convince-viewers-this-affordability-issue-is-a-hoax-insists-the-economy-is-doing-well/",
    "timestamp": "2025-12-13T04:19:16Z"
  },
  {
    "title": "Trump’s 'illegal' tariffs on India challenged as US lawmakers move to end emergency duties",
    "description": "Trump India Tariffs: Democratic lawmakers have introduced a resolution to terminate the national emergency used by President Trump to impose steep tariffs on Indian imports. They argue these  illegal tariffs  abuse executive power, damage a key strategic part…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trumps-illegal-tariffs-on-india-challenged-as-us-lawmakers-move-to-end-emergency-duties/articleshow/125944034.cms",
    "timestamp": "2025-12-13T04:18:42Z"
  },
  {
    "title": "Democrats release photos of Trump from Epstein estate",
    "description": "Republicans accuse Democrats of playing politics with release of Epstein photos",
    "link": "https://www.bbc.co.uk/sounds/play/p0mnc4k5",
    "timestamp": "2025-12-13T04:15:00Z"
  },
  {
    "title": "North Korea acknowledges its troops cleared mines for Russia",
    "description": "North Korea sent troops to clear mines in Russia's Kursk region earlier this year, leader Kim Jong Un said in a speech carried on Saturday by state media, a rare acknowledgement by Pyongyang of the deadly tasks assigned to its deployed soldiers. North Korea h…",
    "link": "https://economictimes.indiatimes.com/news/defence/north-korea-acknowledges-its-troops-cleared-mines-for-russia/articleshow/125943950.cms",
    "timestamp": "2025-12-13T04:08:51Z"
  },
  {
    "title": "A wig, boat and jet: The secret mission to get Maria Machado out of Venezuela",
    "description": "Maria Corina Machado hid in fear for her life under Venezuela's Maduro regime. This is how her fight to restore democracy started more than 20 years ago.",
    "link": "https://www.abc.net.au/news/2025-12-13/who-is-maria-corina-machado-venezuela-opposition-leader/106119516",
    "timestamp": "2025-12-13T04:06:39Z"
  },
  {
    "title": "Kim acknowledges N Korean troops cleared mines for Russia",
    "description": "North Korea sent troops to clear mines in Russia's Kursk region earlier this year, the country's leader Kim Jong Un has said in a speech carried by state media, a rare acknowledgement by Pyongyang of the deadly tasks assigned to its soldiers in the region.",
    "link": "https://www.rte.ie/news/world/2025/1213/1548834-north-korea-russia/",
    "timestamp": "2025-12-13T04:03:28Z"
  },
  {
    "title": "Comer Says Clintons’ Tactics Avoiding Epstein Subpoenas Could Bring Contempt Charges",
    "description": "Republican Rep. James Comer of Kentucky threatened former President Bill Clinton and former Secretary of State Hillary Clinton with contempt charges.",
    "link": "https://dailycaller.com/2025/12/12/comer-says-clintons-tactics-avoiding-epstein-subpoenas-could-bring-contempt-charges/",
    "timestamp": "2025-12-13T04:02:51Z"
  },
  {
    "title": "Thai villagers stay behind to guard empty homes as border clashes force mass evacuations",
    "description": "Fighting along the Thai-Cambodian border has forced hundreds of thousands of Thai villagers to flee since Monday",
    "link": "https://abcnews.go.com/International/wireStory/thai-villagers-stay-guard-empty-homes-border-clashes-128366162",
    "timestamp": "2025-12-13T03:57:57Z"
  },
  {
    "title": "Trump fails in renewed bid to end Thai-Cambodian border clashes",
    "description": "PHNOM PENH/BANGKOK/WASHINGTON -- U.S. President Donald Trump failed to end the renewed fighting between Thailand and Cambodia despite his claims to the contrary, as cross-border clashes between the Southeast Asian neighbors continued on Saturday.\nAirstrikes c…",
    "link": "https://biztoc.com/x/fbb5a3be12990746",
    "timestamp": "2025-12-13T03:56:37Z"
  },
  {
    "title": "Trump Administration Reverses Sanctions On Brazilian Judge Overseeing Bolsonaro Coup Case As Diplomatic Ties Warm",
    "description": "The U.S. has lifted sanctions on a Brazilian Supreme Court justice previously targeted by President Donald Trump's administration. This development underscores a rapid diplomatic reset with Brazil as trade tensions ease and relations with President Luiz Inaci…",
    "link": "https://biztoc.com/x/3a69aa485ccdaaa9",
    "timestamp": "2025-12-13T03:56:27Z"
  },
  {
    "title": "Cambodia says Thailand still bombing hours after Trump truce call",
    "description": "Cambodia said Saturday that Thailand continued dropping bombs on its territory hours after U.S. President Donald Trump said the neighbors had agreed to stop fighting. The latest clashes between the Southeast Asian neighbors, which stem from a long-running dis…",
    "link": "https://japantoday.com/category/world/cambodia-says-thailand-still-bombing-hours-after-trump-truce-call",
    "timestamp": "2025-12-13T03:50:04Z"
  },
  {
    "title": "DOJ files suit to obtain 2020 election records in Fulton County, Georgia",
    "description": "The Justice Department sued Fulton County, Georgia, this week in an effort to obtain more than five-year-old ballots tied to the 2020 presidential election which President Donald Trump lost",
    "link": "https://www.nbcnews.com/politics/justice-department/doj-files-suit-obtain-2020-election-records-fulton-county-georgia-rcna248952",
    "timestamp": "2025-12-13T03:48:53Z"
  },
  {
    "title": "Record floods in Washington state trigger dramatic rescues and evacuations",
    "description": "Record floodwaters began slowly receding in Washington state after triggering evacuations, inundating communities and prompting dramatic rescues from rooftops and vehicles.",
    "link": "https://www.wpxi.com/news/local/record-floods-washington-state-trigger-dramatic-rescues-evacuations/V4GBTMTLTNEJBAFWMTW773G3UE/",
    "timestamp": "2025-12-13T03:44:09Z"
  },
  {
    "title": "North Korea acknowledges its troops cleared mines for Russia",
    "description": "North Korea sent troops to clear mines in Russia’s Kursk region earlier this year, leader Kim Jong Un said in a speech carried on Saturday by state media, a rare acknowledgement by Pyongyang of the deadly tasks assigned to its deployed soldiers. North Korea h…",
    "link": "https://www.digitaljournal.com/world/north-korea-acknowledges-its-troops-cleared-mines-for-russia/article",
    "timestamp": "2025-12-13T03:38:15Z"
  },
  {
    "title": "Kathy Griffin: Trump Is 'Disgusting to Look At,' 'I'm Just Waiting for Him to Die'",
    "description": "Controversial Hollywood comic Kathy Griffin is once again attacking President Donald Trump and hoping for his death.\nThe post Kathy Griffin: Trump Is ‘Disgusting to Look At,’ ‘I’m Just Waiting for Him to Die’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/12/12/kathy-griffin-trump-is-disgusting-to-look-at-im-just-waiting-for-him-to-die/",
    "timestamp": "2025-12-13T03:33:21Z"
  },
  {
    "title": "Top House Republicans cheer law firm tangled in bitter battle with Trump",
    "description": "Top Republicans and Democrats on Capitol Hill came together this week to praise a prominent law firm and government watchdog group – even as the firm remains locked in a bitter legal fight with President Donald Trump’s administration.According to a new report…",
    "link": "https://www.rawstory.com/jenner-and-block-trump/",
    "timestamp": "2025-12-13T03:32:17Z"
  },
  {
    "title": "Van Jones: Trump Ballroom Leading Us Down the Path to Being a Banana Republic",
    "description": "Friday on CNN's \"The Source,\" political commentator Van Jones said President Donald Trump knocking down a portion of the White House to build a ballroom without reviews was taking America down the path to \"being a banana republic.\"\nThe post Van Jones: Trump B…",
    "link": "https://www.breitbart.com/clips/2025/12/12/van-jones-trump-ballroom-leading-us-down-the-path-to-being-a-banana-republic/",
    "timestamp": "2025-12-13T03:31:23Z"
  },
  {
    "title": "House GOP unveils narrow health care package with key deadline looming",
    "description": "(CNN) — House Republicans unveiled a narrow health care package on Friday that does not extend soon-to-expire enhanced Affordable Care Act subsidies — the latest sign that Congress is unlikely",
    "link": "https://www.wkow.com/news/politics/house-gop-unveils-narrow-health-care-package-with-key-deadline-looming/article_3c293473-0c91-5ea3-b017-251400ed3dec.html",
    "timestamp": "2025-12-13T03:30:32Z"
  },
  {
    "title": "Thailand's prime minister vows continued military action against Cambodia",
    "description": "Thai Prime Minister Anutin Charnvirakul's remarks come despite earlier claims by US President Donald Trump that he had brokered a ceasefire between the two nations.",
    "link": "https://www.channelnewsasia.com/asia/thailand-cambodia-military-action-border-clashes-trump-5580191",
    "timestamp": "2025-12-13T03:25:00Z"
  },
  {
    "title": "Scott Jennings Slams Democrats for Trying To ‘Create a Narrative That Trump Had Something to Do With Epstein’",
    "description": "As has been well documented, Trump and Epstein were friends for years.\nThe post Scott Jennings Slams Democrats for Trying To ‘Create a Narrative That Trump Had Something to Do With Epstein’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/scott-jennings-slams-democrats-for-trying-to-create-a-narrative-that-trump-had-something-to-do-with-epstein/",
    "timestamp": "2025-12-13T03:24:23Z"
  },
  {
    "title": "James Carville Says Jasmine Crockett Is Violating The 'First Rule Of Politics'",
    "description": "The longtime Democratic strategist knocked Crockett just days after she launched her U.S. Senate bid.",
    "link": "https://www.huffpost.com/entry/james-carville-jasmine-crockett-senate-bid_n_693cba91e4b018dc36f29fba",
    "timestamp": "2025-12-13T03:15:22Z"
  },
  {
    "title": "Prospects for Resolving Ukrainian Conflict Will Soon Become Clear — Trump",
    "description": "US President Donald Trump said the prospects for resolving the Ukrainian conflict will soon become clear.",
    "link": "https://sputnikglobe.com/20251213/prospects-for-resolving-ukrainian-conflict-will-soon-become-clear--trump-1123287292.html",
    "timestamp": "2025-12-13T03:15:00Z"
  },
  {
    "title": "Republicans in populous state can't find candidates to run in midterms",
    "description": "The New York and New Jersey-based outlet Gothamist reports Democratic candidates in the Garden State are clamoring to run in what both parties see as competitive races in next year’s midterm elections. But the same cannot be said for the GOP. “In a cycle when…",
    "link": "https://www.rawstory.com/alternet-posts/trump-republican-party-midterms-2674396600/",
    "timestamp": "2025-12-13T03:10:55Z"
  },
  {
    "title": "States to Sue Over Donald Trump's $100,000 H-1B Application Fee",
    "description": "A group of states announced they are suing the Trump administration to block a $100,000 fee for any new applications for H-1B visas, which allow employers in the US to hire skilled foreign workers.",
    "link": "https://www.ndtvprofit.com/world/states-to-sue-over-donald-trumps-100000-h-1b-application-fee",
    "timestamp": "2025-12-13T03:10:28Z"
  },
  {
    "title": "Thailand and Cambodia have agreed to fresh truce: Trump",
    "description": "US News: WASHINGTON/BANGKOK: US President Donald Trump said on Friday he had spoken by telephone with the leaders of Thailand and Cambodia, who both agreed to .",
    "link": "https://timesofindia.indiatimes.com/world/us/thailand-and-cambodia-have-agreed-to-fresh-truce-trump/articleshow/125943289.cms",
    "timestamp": "2025-12-13T03:01:44Z"
  },
  {
    "title": "Binance’s USD1 Stablecoin Push Deepens Relationship With Trump’s Crypto Platform",
    "description": "Binance, the world’s largest crypto exchange, has broadened support for USD1, the stablecoin tied to World Liberty Financial and US President Donald Trump’s crypto ventures, reports disclosed. The exchange added new spot pairs including ETH/USD1, SOL/USD1 and…",
    "link": "http://www.newsbtc.com/altcoin/binances-usd1-stablecoin-push-deepens-relationship-with-trumps-crypto-platform/",
    "timestamp": "2025-12-13T03:00:24Z"
  },
  {
    "title": "World’s cartoonists on this week’s events",
    "description": "Drawing the top stories around the globe.",
    "link": "https://www.politico.eu/article/worlds-cartoonists-on-this-weeks-events-181/",
    "timestamp": "2025-12-13T03:00:00Z"
  },
  {
    "title": "Nvidia considers increasing H200 chip output due to robust China demand, sources say",
    "description": "Nvidia has told Chinese clients it is evaluating adding production capacity for its powerful H200 AI chips after orders exceeded its current output level. Major Chinese companies including Alibaba and ByteDance have already reached out to Nvidia this week abo…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-considers-increasing-h200-chip-output-due-to-robust-china-demand-sources-say/articleshow/125943406.cms",
    "timestamp": "2025-12-13T02:59:51Z"
  },
  {
    "title": "Trump Says 'Starting' Land Strikes Over Drugs In Latest Warning",
    "description": "President Donald Trump said the US would be “starting” land strikes on drug operations in Latin America, though again declined to provide details on when and where the escalation of his military campaign would actually begin, or if countries could still do an…",
    "link": "https://www.ndtvprofit.com/economy-finance/trump-says-starting-land-strikes-over-drugs-in-latest-warning",
    "timestamp": "2025-12-13T02:59:50Z"
  },
  {
    "title": "Washington state takes stock of flooding damage as another atmospheric river looms",
    "description": "BURLINGTON — Floodwaters began to recede on Friday after historic inundation in Washington state, but the areas hardest hit by flooding could face another wave of atmospheric river next week, and more inundation is looming.",
    "link": "https://www.nbcnews.com/news/us-news/washington-state-takes-stock-flooding-damage-another-atmospheric-river-rcna248916",
    "timestamp": "2025-12-13T02:59:33Z"
  },
  {
    "title": "Trump Names Warsh, Hassett As Top Fed Contenders, WSJ Says",
    "description": "President Donald Trump said that Kevin Hassett and Kevin Warsh are his top choices to lead the US Federal Reserve and that he expects the next chair of the central bank to consult with him on interest rates. Trump, in an interview with the Wall Street Journal…",
    "link": "https://www.ndtvprofit.com/global-economics/trump-names-warsh-hassett-as-top-fed-contenders-wsj-says",
    "timestamp": "2025-12-13T02:57:02Z"
  },
  {
    "title": "EXCLUSIVE: Inside Trump’s private schedule as media fixates on his health",
    "description": "Fox News obtained President Donald Trump's December schedule revealing back-to-back meetings and calls extending into evening hours throughout the month.",
    "link": "https://www.foxnews.com/politics/exclusive-inside-trumps-private-schedule-media-fixates-his-health",
    "timestamp": "2025-12-13T02:56:41Z"
  }
]