[
  {
    "title": "Trump Warns Against Trophy Wives During West Point Graduation",
    "description": "“I must tell you. A lot of trophy wives, it doesn’t work out,” the thrice-married president told the cadets.",
    "link": "https://www.vanityfair.com/news/story/trump-warns-against-trophy-wives-during-west-point-graduation",
    "timestamp": "2025-05-25T17:58:20Z"
  },
  {
    "title": "Jim Cramer sends blunt message after Trump's latest tariff surprise",
    "description": "While President Donald Trump may have envisioned his April 2 tariffs announcement as a \"Liberation Day,\" it's been more of a nightmare for most other people.\nThe tariff announcements placed a particularly high penalty on companies that manufactured in China, …",
    "link": "https://biztoc.com/x/f1e7ff0406a3d83c",
    "timestamp": "2025-05-25T17:46:54Z"
  },
  {
    "title": "Are $1,000 Trump Accounts A Good Idea?",
    "description": "The GOP bill passed by the House of Representatives includes a $1,000 Trump Account for every eligible baby born in the United States - is this a good idea?",
    "link": "https://www.forbes.com/sites/jimwang/2025/05/25/are-1000-trump-accounts-a-good-idea/",
    "timestamp": "2025-05-25T17:41:29Z"
  },
  {
    "title": "Why aren’t Democrats investigating Biden health officials for dishonesty on COVID-19 vaccine risks? - NewsBreak",
    "description": "Amid the COVID-19 pandemic, Democrats championed themselves as agents of truth. In a world of uncertainty, with information changing by the day, if not mor",
    "link": "https://www.newsbreak.com/share/4020933563389-why-aren-t-democrats-investigating-biden-health-officials-for-dishonesty-on-covid-19-vaccine-risks?s=a2&amp;share_destination_id=MTE4NzIzMjgtMTc0ODE5NDY2NzY5Ng%3D%3D&amp;pd=00noXARq&amp;hl=en_US&amp;send_time=1748194667&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.21.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-control%2Cns_foryou_recall_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v7%2Cns_foryou_rank_exp_25q2-v3",
    "timestamp": "2025-05-25T17:38:18Z"
  },
  {
    "title": "The class of 2025 is not finding jobs. Some blame AI",
    "description": "The class of 2025 is celebrating graduation season — but the reality of finding a job is particularly grim right now thanks to market uncertainty under President Donald Trump, the rise of artificial intelligence killing entry-level jobs and the unemployment r…",
    "link": "https://biztoc.com/x/3520a3e591811329",
    "timestamp": "2025-05-25T17:35:52Z"
  },
  {
    "title": "Bitcoin At Crossroads After Trump Tariff Shock: Breakdown Towards $106K Or New ATH?",
    "description": "Bitcoin is grappling with intensified volatility following a sharp selloff triggered by US President Donald Trump’s abrupt announcement of a sweeping 50% tariff on all EU imports starting June 1. The unexpected macroeconomic move sent shockwaves through asset…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-at-crossroads-after-trump-tariff-shock-breakdown-towards-106k-or-new-ath/",
    "timestamp": "2025-05-25T17:30:27Z"
  },
  {
    "title": "‘Walk Of Shame’: Rand Paul Says GOP Using ‘Same Playbook’ As Dems By Not Removing Debt Ceiling From Bill",
    "description": "Sen. Paul said GOP is using the \"same playbook\" as Dems in their efforts to not remove the debt ceiling from President Donald Trump's \"big, beautiful bill.\"",
    "link": "https://dailycaller.com/2025/05/25/rand-paul-gop-senate-big-beautiful-bill-donald-trump-debt-ceiling/",
    "timestamp": "2025-05-25T17:25:39Z"
  },
  {
    "title": "Crypto Bulls Lose $500M as Bitcoin Hovers Around $108K After Trump’s Tariff Threats",
    "description": "Crypto Bulls Lose $500M as Bitcoin Hovers Around $108K After Trump’s Tariff Threats\nU.S. President Donald Trump threatened a 50% tariff on all European Union imports and a 25% levy on imported Apple iPhones late Friday, sending markets tumbling.\nWhat to know:…",
    "link": "https://biztoc.com/x/25ee39131c8f39c9",
    "timestamp": "2025-05-25T17:24:50Z"
  },
  {
    "title": "Left-Wing TikTok Star Applauds Deadly D.C. Shooting: ‘He’s a Resistance Fighter’",
    "description": "A popular left-wing Gen-Z TikTok creator with millions of followers praised the deadly shooting of two Israeli diplomats in the U.S. capital, calling the gunman a “resistance fighter” — joining other far-left groups that have justified, excused, or openly cel…",
    "link": "https://www.breitbart.com/politics/2025/05/25/left-wingtiktok-star-applauds-deadly-d-c-shooting-hes-a-resistance-fighter/",
    "timestamp": "2025-05-25T17:23:54Z"
  },
  {
    "title": "EXCLUSIVE: GOP Rep Expresses Optimism That Senate Will Seek ‘Big, Beautiful’ Spending Cuts In Trump Bill",
    "description": "Republican Rep. Scott Perry of Pennsylvania is looking to the Senate to make steeper spending cuts in President Donald Trump's \"one big, beautiful bill.\"",
    "link": "https://dailycaller.com/2025/05/25/scott-perry-senate-spending-cuts-big-beautiful-bill/",
    "timestamp": "2025-05-25T17:13:35Z"
  },
  {
    "title": "Rival marches draw thousands before pivotal Polish presidential election",
    "description": "Rafal Trzaskowski and Karol Nawrocki are locked in a tight contest in next weekend's run-off.",
    "link": "https://www.aljazeera.com/news/2025/5/25/rival-marches-draw-thousands-before-pivotal-polish-presidential-election",
    "timestamp": "2025-05-25T17:13:29Z"
  },
  {
    "title": "Gavin Newsom Mingles With Rock Stars at BottleRock Music Fest",
    "description": "California’s podcasting Democrat governor, who has recently amplified the views of right-wing figures such as Charlie Kirk and Steve Bannon, announced that Trump opponents “can’t afford to be timid” while rocking out in Napa.",
    "link": "https://www.vanityfair.com/style/story/gavin-newsom-bottlerock-napa",
    "timestamp": "2025-05-25T17:07:46Z"
  },
  {
    "title": "5 Ways Wealthy Investors Are Positioning Themselves During 2025’s Market Turmoil",
    "description": "Discover 5 key strategies wealthy investors are using to protect and grow their portfolios during 2025’s market volatility and economic uncertainty.",
    "link": "https://finance.yahoo.com/news/5-ways-wealthy-investors-positioning-170205847.html",
    "timestamp": "2025-05-25T17:02:05Z"
  },
  {
    "title": "Letters: Greens and Labour need to say how they would fund programmes",
    "description": "OPINION: The Greens and Labour need to explain how they will pay for programmes.",
    "link": "https://www.nzherald.co.nz/nz/letters-greens-and-labour-need-to-say-how-they-would-fund-programmes/Q7OKAAZ4BBGPJF4NWRXWTXY45E/",
    "timestamp": "2025-05-25T17:00:00Z"
  },
  {
    "title": "Act leader David Seymour invited to Oxford Union debate about ‘stolen land’ and illegal immigration",
    "description": "Seymour follows ex-PM David Lange and Labour MP Willie Jackson as previous MPs invited.",
    "link": "https://www.nzherald.co.nz/nz/politics/act-leader-david-seymour-invited-to-oxford-union-debate-about-stolen-land-and-illegal-immigration/2GHQB6A54FDGLNJBKYKSMPIMZU/",
    "timestamp": "2025-05-25T17:00:00Z"
  },
  {
    "title": "Americans remember George Floyd on fifth anniversary of death",
    "description": "As the cities where Floyd grew up and died hold commemorations,  the US \"reckoning\" with racism seems to be fading.",
    "link": "https://www.bbc.com/news/articles/cgmjzyp0kwzo",
    "timestamp": "2025-05-25T16:57:02Z"
  },
  {
    "title": "Supreme Court called out for using 'slot machine justice' to spare Trump pain",
    "description": "The Supreme Court's increasing use of the so-called \"shadow docket\" to issue quickie rulings mostly in Donald Trump's favor was on the receiving end of a smack-down on MSNBC on Sunday morning.With legal expert Melissa Murray explaining the maneuver is normall…",
    "link": "https://www.rawstory.com/supreme-court-shadow-docket/",
    "timestamp": "2025-05-25T16:50:25Z"
  },
  {
    "title": "REINVIGORATING THE NUCLEAR INDUSTRIAL BASE [Executive Order]",
    "description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:Section 1. Purpose. The United States originally pioneered nuclear energy technology during a time of great peril. We now face a …",
    "link": "https://freerepublic.com/focus/f-news/4319025/posts",
    "timestamp": "2025-05-25T16:50:12Z"
  },
  {
    "title": "NYT’s Peter Baker Breaks Down ‘Breathtaking’ Ways Trump Has Profited From Presidency",
    "description": "Fresh off the dinner hosted by Trump for top investors of his meme coin, a NY Times reporter has published a breakdown of how Trump has monetized his office.\nThe post NYT’s Peter Baker Breaks Down ‘Breathtaking’ Ways Trump Has Profited From Presidency first a…",
    "link": "https://www.mediaite.com/media/news/nyts-peter-baker-breaks-down-breathtaking-ways-trump-has-profited-from-presidency/",
    "timestamp": "2025-05-25T16:48:25Z"
  },
  {
    "title": "Palestine, the Moral Issue of Our Time",
    "description": "Reprinted from Bracing Views with the author’s permission. So much of what we’ve been told about Israel and Zionism has been a lie, as this video reveals. My mother-in-law had a saying: “Have a heart if you’ve got a heart.” So many “leaders” in the U.S. and I…",
    "link": "https://www.antiwar.com/blog/2025/05/25/palestine-the-moral-issue-of-our-time/",
    "timestamp": "2025-05-25T16:47:29Z"
  },
  {
    "title": "George Floyd's Traumatized Girlfriend Admits She’s Gripped With Terror Donald Trump Will Grant Pardon to Cops Who Killed Him — On Fifth Anniversary of Murder that Sparked Black Lives Matter Protests",
    "description": "Donald Trump is being pressured by his conservative allies who consider Chauvin a 'political martyr' rather than a convicted murderer.",
    "link": "https://radaronline.com/p/george-floyds-girlfriend-terror-donald-trump-grant-pardon-cops-murder/",
    "timestamp": "2025-05-25T16:45:00Z"
  },
  {
    "title": "German finance minister joins call for US-EU talks after Trump tariff threat",
    "description": "Lars Klingbeil says Europe needs ‘serious negotiations not further provocations’\nGermany’s finance minister has joined a chorus of European politicians in calling for talks with the US after President Donald Trump threatened to impose 50% tariffs on imports f…",
    "link": "https://biztoc.com/x/374bc4f9768be509",
    "timestamp": "2025-05-25T16:40:24Z"
  },
  {
    "title": "Russia escalates air strikes on Ukraine",
    "description": "The News\nRussia launched a massive air attack on Ukraine, even as both countries exchanged hundreds of prisoners of war in a swap US President Donald Trump had suggested could spur negotiations between Moscow and Kyiv.\nRussia’s overnight onslaught was the lar…",
    "link": "https://biztoc.com/x/7fd245eb477f4581",
    "timestamp": "2025-05-25T16:40:17Z"
  },
  {
    "title": "Speaker Johnson clashes with Rand Paul over 'wimpy' spending cuts in Trump's bill",
    "description": "Debate over the \"big, beautiful bill\" intensifies as Speaker Mike Johnson and Sen. Rand Paul discuss spending cuts and debt ceiling on Sunday.",
    "link": "https://www.foxnews.com/politics/speaker-johnson-clashes-rand-paul-over-wimpy-spending-cuts-trumps-bill",
    "timestamp": "2025-05-25T16:39:34Z"
  },
  {
    "title": "Dem Sen. Michael Bennett ‘furious’ at his own party, says the brand doesn’t help ‘anywhere’",
    "description": "A retiring Democratic senator is \"furious\" at his own party and suggested that its brand isn't helpful almost anywhere in the country for candidates seeking national office.",
    "link": "https://nypost.com/2025/05/25/us-news/dem-sen-michael-bennett-furious-at-his-own-party-says-the-brand-doesnt-help-anywhere/",
    "timestamp": "2025-05-25T16:39:04Z"
  },
  {
    "title": "Nasser’s grandson warns of US-led neocolonialism",
    "description": "The US has replaced old colonial powers by using finance, sanctions, and media to dominate nations, Gamal Abdel Nasser Jr. has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/618119-us-neo-colonialism-africa/",
    "timestamp": "2025-05-25T16:35:24Z"
  },
  {
    "title": "French President Macron hopes for defence, energy and tech deals as he starts Asia trip",
    "description": "PARIS (Reuters) -French President Emmanuel Macron said on Sunday that he hoped to strike deals for France in areas such as defence, energy and tech...",
    "link": "https://uk.news.yahoo.com/french-president-macron-hopes-defence-163327810.html",
    "timestamp": "2025-05-25T16:33:27Z"
  },
  {
    "title": "Mike Johnson Says He 'Hasn't Even Heard About' Trump's Unethical Crypto Dinner",
    "description": "House Speaker Mike Johnson (R-LA) downplayed President Donald Trump's \"private\" dinner with investors who pumped $148 million into his crypto venture.\n\n\nDuring a Sunday interview, CNN's Jake Tapper asked Johnson about the president's controversial event.\n\n\n\"I…",
    "link": "https://crooksandliars.com/2025/05/mike-johnson-says-he-hasnt-even-heard",
    "timestamp": "2025-05-25T16:28:07Z"
  },
  {
    "title": "Meet The Alleged Pro-Hamas Campus Radicals Scooped Up By Trump Admin",
    "description": "President Donald Trump has detained an increasing number of foreign student protesters accused of harassing Jewish students and promoting an extremist agenda.",
    "link": "https://dailycaller.com/2025/05/25/meet-alleged-pro-hamas-radicals-scooped-trump-admin/",
    "timestamp": "2025-05-25T16:28:05Z"
  },
  {
    "title": "Trump Demands Names Of Harvard's International Students In Bonkers Rant",
    "description": "Prissydent Donald Trump took to Truth Social at nearly 1 a.m. Sunday to express his continued obsession with Harvard. In his rant, Trump demanded to know the \"names and countries\" of Harvard's international students. Nothing in Trump's rant is factual. \n\"Why …",
    "link": "https://crooksandliars.com/2025/05/trump-demands-names-harvards-international",
    "timestamp": "2025-05-25T16:27:54Z"
  },
  {
    "title": "Even a humble keyboard is now political in Taiwan",
    "description": "Chinese manufacturers are advertising how they dodge tariffs, and tech leaders know they’re in a new world\nComputex Every time I attend Taiwan's Computex exhibition I'm bewildered by the dozens of vendors selling unremarkable keyboards and mice.…",
    "link": "https://www.theregister.com/2025/05/25/computex_politics/",
    "timestamp": "2025-05-25T16:27:15Z"
  },
  {
    "title": "Ron Johnson Predicts GOP Senators Will Put Up Roadblock To ‘Stop The Process’ On Trump’s ‘Big, Beautiful Bill’",
    "description": "GOP Sen. Johnson said he believes there will be enough GOP members to halt President Donald Trump's \"big, beautiful bill\" until their concerns are addressed.",
    "link": "https://dailycaller.com/2025/05/25/ron-johnson-gop-senate-donald-trump-beautiful-bill/",
    "timestamp": "2025-05-25T16:23:39Z"
  },
  {
    "title": "Syria To Help Locate Missing Americans: US Envoy",
    "description": "Syria's new authorities have agreed to help the United States locate and return Americans who went missing in the war-ravaged country, a US envoy said on Sunday, in another sign of thawing bilateral ties.",
    "link": "https://www.ibtimes.com.au/syria-help-locate-missing-americans-us-envoy-1859056",
    "timestamp": "2025-05-25T16:15:20Z"
  },
  {
    "title": "Fact-checking Justice Sotomayor’s imaginary birthright citizenship cases",
    "description": "Supreme Court member known to sometimes have a 'slippery handle' on facts",
    "link": "https://www.wnd.com/2025/05/fact-checking-justice-sotomayors-imaginary-birthright-citizenship-cases/",
    "timestamp": "2025-05-25T16:13:58Z"
  },
  {
    "title": "Transcript: Rep. Jim Himes on Face the Nation with Margaret Brennan,\" May 25, 2025",
    "description": "The following is the transcript of an interview with Rep. Jim Himes, Democrat of Connecticut, that aired on \"Face the Nation with Margaret Brennan\" on May 25, 2025.",
    "link": "https://www.cbsnews.com/news/jim-himes-house-intelligence-committee-face-the-nation-transcript-05-25-2025/",
    "timestamp": "2025-05-25T16:12:56Z"
  },
  {
    "title": "Below the Line",
    "description": "Below the Line",
    "link": "https://www.thehindubusinessline.com/opinion/below-the-line/article69618488.ece",
    "timestamp": "2025-05-25T16:08:16Z"
  },
  {
    "title": "Discreet Exit? EU Officials Fear Trump Will Pull Plug on US Troop Presence",
    "description": "The European Union is quietly making plans for a possible US decision to cut its military deployment on the continent, Handelsblatt quoted senior European diplomats as saying.",
    "link": "https://sputnikglobe.com/20250525/discreet-exit-eu-officials-fear-trump-will-pull-plug-on-us-troop-presence-1122127950.html",
    "timestamp": "2025-05-25T16:06:38Z"
  },
  {
    "title": "The Centenary of Buckley and the Crisis of Free Speech",
    "description": "William F. Buckley Jr.’s centenary arrives as free speech falters and truth-telling grows perilous—a reminder that every generation must fight anew for civilization’s soul. William F. Buckley, Jr., who died in February 2008, would have been 100 years old in N…",
    "link": "https://freerepublic.com/focus/f-chat/4319016/posts",
    "timestamp": "2025-05-25T16:05:29Z"
  },
  {
    "title": "'The captors put my life in danger for fun': Omer Wenkert reveals more about captivity",
    "description": "Wenkert told audiences in Eilat that he was intentionally starved in captivity, and that there were weeks that he did not receive food.",
    "link": "https://www.jpost.com/israel-news/article-855380",
    "timestamp": "2025-05-25T16:00:57Z"
  },
  {
    "title": "Liberals hold first post-election meeting on the eve of new spring session",
    "description": "Liberals could decide to adopt the Reform Act rules that would give them the power to trigger a leadership review of their new leader.",
    "link": "https://nationalpost.com/news/politics/mark-carney-liberals-first-caucus-meeting",
    "timestamp": "2025-05-25T16:00:51Z"
  },
  {
    "title": "For Gavin Newsom, Talk Is Cheap",
    "description": "Hernandez will advance to the state championships—an honor now out of reach for the girls who spent years training for a chance at winning valuable and prestigious scholarships.\nThe post For Gavin Newsom, Talk Is Cheap first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/for-gavin-newsom-talk-is-cheap/",
    "timestamp": "2025-05-25T16:00:29Z"
  },
  {
    "title": "Trump’s Break with Israel: Genuine Shift or Political Theater?",
    "description": "When Donald Trump was re-elected president in November 2024, expectations were widespread that Israel’s assault on Gaza would intensify, and that the incoming administration would take a much more active role in neutralizing Tel Aviv’s regional adversaries. T…",
    "link": "https://www.activistpost.com/trumps-break-with-israel-genuine-shift-or-political-theater/",
    "timestamp": "2025-05-25T16:00:00Z"
  },
  {
    "title": "Luttig: Trump Actions 'Clearly Unlawful,' He's 'Waging War on the Federal Judiciary'",
    "description": "Former U.S. Appeals Court Judge J. Michael Luttig said Sunday on MSNBC's \"Velshi\" that President Donald Trump's actions were \"clearly unlawful.\"\nThe post Luttig: Trump Actions ‘Clearly Unlawful,’ He’s ‘Waging War on the Federal Judiciary’ appeared first on Br…",
    "link": "https://www.breitbart.com/clips/2025/05/25/luttig-trump-actions-clearly-unlawful-hes-waging-war-on-the-federal-judiciary/",
    "timestamp": "2025-05-25T15:59:48Z"
  },
  {
    "title": "“These are perilous times. We are staring down a dark channel that could lead to totalitarianism”: Even yacht rock icon Michael McDonald is criticising Donald Trump and the US government",
    "description": "Doobie Brothers’ Michael McDonald is worried about the state of America",
    "link": "https://www.loudersound.com/bands-artists/michael-mcdonald-singer-criticises-donald-trump",
    "timestamp": "2025-05-25T15:48:32Z"
  },
  {
    "title": "Trump threatens 25 percent tariff on iPhones manufactured overseas",
    "description": "President Donald Trump has escalated pressure on Apple to manufacture iPhones for the American market domestically. In a post on Truth Social Friday morning, the president explicitly warned that he would recommend a 25 percent tariff be applied to any iPhones…",
    "link": "https://www.madshrimps.be/news/trump-threatens-25-percent-tariff-on-iphones-manufactured-overseas/",
    "timestamp": "2025-05-25T15:47:47Z"
  },
  {
    "title": "DAVID MARCUS: Jake Tapper chose lying Biden sources over his own eyes",
    "description": "Criticism of Jake Tapper's book reveals flaws in journalism's dependence on insider info, questioning media's portrayal of Biden's administration.",
    "link": "https://www.foxnews.com/opinion/david-marcus-jake-tapper-chose-lying-biden-sources-over-his-own-eyes",
    "timestamp": "2025-05-25T15:45:07Z"
  },
  {
    "title": "'Original Sin' co-author exposes 'frantic efforts' to hide Biden's cognitive decline",
    "description": "Joe Biden's inner circle's portrayal of him as sharp is questioned in 'Original Sin,' revealing efforts to shield his decline before the 2024 election.",
    "link": "https://www.foxnews.com/media/author-exposes-frantic-efforts-hide-bidens-cognitive-decline",
    "timestamp": "2025-05-25T15:44:19Z"
  },
  {
    "title": "Trump: Taxpayers Footing the Bill For Foreign Students at Harvard",
    "description": "President Donald Trump evoked more political leverage Sunday in his effort to reign in alleged antisemitism and racial favoritism at Harvard by arguing U.S. taxpayers fund the education of its foreign students.\nThe post Trump: Taxpayers Footing the Bill For F…",
    "link": "https://www.breitbart.com/education/2025/05/25/trump-taxpayers-footing-the-bill-for-foreign-students-at-harvard/",
    "timestamp": "2025-05-25T15:43:56Z"
  },
  {
    "title": "Harvard Scientist Charged After Allegedly Trying to Smuggle Biological Material Into US",
    "description": "\"A law enforcement canine allegedly alerted its handler to the defendant’s checked duffel bag on the baggage carousel.\"",
    "link": "https://www.westernjournal.com/harvard-scientist-charged-allegedly-trying-smuggle-biological-material-us/",
    "timestamp": "2025-05-25T15:42:57Z"
  },
  {
    "title": "Trump FDA Commissioner Complains About 'Throwing Insulin\" To People With Diabetes",
    "description": "Food and Drug Administration (FDA) Commissioner Marty Makary argued that insulin should be withheld from people with diabetes and replaced with \"cooking classes.\"\n\n\nDuring a Sunday interview on Fox News, Makary promoted a report from President Donald Trump's …",
    "link": "https://crooksandliars.com/2025/05/trump-fda-commissioner-complains-about",
    "timestamp": "2025-05-25T15:39:53Z"
  },
  {
    "title": "Trump’s polling is better than the media think",
    "description": "'Establishment' focuses on 'divisiveness,' frenetic pace and tariffs, and misses 'complex picture'",
    "link": "https://www.wnd.com/2025/05/trumps-polling-is-better-than-the-media-think/",
    "timestamp": "2025-05-25T15:37:03Z"
  },
  {
    "title": "Fact-checking Trump’s claims about Medicaid cuts in GOP bill",
    "description": "House bill alters healthcare programme significantly despite Trump claiming cuts target only 'waste, fraud and abuse'.",
    "link": "https://www.aljazeera.com/news/2025/5/25/fact-checking-trumps-claims-about-medicaid-cuts-in-gop-bill",
    "timestamp": "2025-05-25T15:33:42Z"
  },
  {
    "title": "Republican Senators Rebuke 'Immoral' Trump Bill—'Emperor Has No Clothes'",
    "description": "GOP Senator Rand Paul said the current bill is \"just not conservative.\"",
    "link": "https://www.newsweek.com/ron-johnson-rand-paul-rebuke-immoral-trump-bill-2076866",
    "timestamp": "2025-05-25T15:31:16Z"
  },
  {
    "title": "Curious About iPhone 17 Rumors and Leaks Ahead of WWDC? Here's the Scoop",
    "description": "The big question is how much the next iPhone will actually cost. We have a pretty good guess.",
    "link": "https://www.cnet.com/tech/mobile/curious-about-iphone-17-rumors-and-leaks-ahead-of-wwdc-heres-the-scoop/",
    "timestamp": "2025-05-25T15:30:00Z"
  },
  {
    "title": "Mike Johnson Doesn’t Care About Trump’s Business Conflicts, Crypto Dinner Because They’re ‘Out In The Open’",
    "description": "The House speaker declined to comment on Trump’s dinner this week with the president’s top crypto supporters.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/05/25/mike-johnson-doesnt-care-about-trumps-business-conflicts-crypto-dinner-because-theyre-out-in-the-open/",
    "timestamp": "2025-05-25T15:28:58Z"
  },
  {
    "title": "What to Know About the Kids Online Safety Act and Where It Currently Stands",
    "description": "What to know about the bipartisan Kids Online Safety Act, which has been reintroduced and has a second chance in front of Congress.",
    "link": "https://time.com/7288539/kids-online-safety-act-status-what-to-know/",
    "timestamp": "2025-05-25T15:28:23Z"
  },
  {
    "title": "Wall Street on edge this week: Will Nvidia’s earnings revive markets or fuel chaos amid soaring U.S. Debt?",
    "description": "Wall Street braces for a critical week as Nvidia gears up to report earnings, with its results seen as a potential market mover amid AI hype. But as soaring U.S. debt and rising Treasury yields stoke investor anxiety, can this chipmaker steady the storm?",
    "link": "https://economictimes.indiatimes.com/news/international/us/wall-street-on-edge-this-week-will-nvidias-earnings-revive-markets-or-fuel-chaos-amid-soaring-u-s-debt/articleshow/121395855.cms",
    "timestamp": "2025-05-25T15:24:36Z"
  },
  {
    "title": "Jon Stewart: Trump Is a 'King' Accepting 'Tributes' From Billionaires",
    "description": "Jon Stewart recently expressed apprehension regarding President Donald Trump‘s actions amidst ongoing lawsuits and tributes from media companies and billionaires.\nWhat Happened: Stewart, on The Bill Simmons Podcast this week, depicted Trump as a “king” accept…",
    "link": "https://biztoc.com/x/9439f4e10d3585df",
    "timestamp": "2025-05-25T15:22:47Z"
  },
  {
    "title": "New Pentagon chief spox. has history of antisemitic, pro-replacement theory comments",
    "description": "Kingsley Wilson originally served as the Pentagon's deputy press secretary before her Friday promotion.",
    "link": "https://www.jpost.com/american-politics/article-855377",
    "timestamp": "2025-05-25T15:19:58Z"
  },
  {
    "title": "Trump FDA commissioner complains about 'throwing insulin\" to diabetics",
    "description": "Food and Drug Administration (FDA) Commissioner Marty Makary argued that insulin should be withheld from people with diabetes and replaced with \"cooking classes.\"\n\nDuring a Sunday interview on Fox News, Makary promoted a report from President Donald Trump's M…",
    "link": "https://www.rawstory.com/trump-throwing-insulin/",
    "timestamp": "2025-05-25T15:18:11Z"
  },
  {
    "title": "Watch: Trump Awards Historic Medals of Sacrifice at White House Ceremony",
    "description": "\"They deserve a nation that remembers, honors, and stands strong for those representing the Thin Blue Line.\"",
    "link": "https://www.westernjournal.com/watch-trump-awards-historic-medals-sacrifice-white-house-ceremony/",
    "timestamp": "2025-05-25T15:13:07Z"
  },
  {
    "title": "German minister urges 'serious talks' with US on tariffs - Economy - The Jakarta Post",
    "description": "German Finance Minister Lars Klingbeil on Sunday urged \"serious negotiations\" with the United States after President Donald Trump threatened to bring in 50-percent tariffs on imports from the European Union.",
    "link": "http://www.thejakartapost.com/business/2025/05/25/german-minister-urges-serious-talks-with-us-on-tariffs.html",
    "timestamp": "2025-05-25T15:12:13Z"
  },
  {
    "title": "Ray Dalio warns Americans the current chaos is much bigger than tariffs - 2 simple ways to protect yourself",
    "description": "Moneywise and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\nWaves of tariffs from President Donald Trump — despite a temporary pause on many — has unleashed chaos across global markets, reigniting trade tensions and r…",
    "link": "https://biztoc.com/x/1e7ae50d86b324b5",
    "timestamp": "2025-05-25T15:12:02Z"
  },
  {
    "title": "Donald Trump works at Walmart | May 25 editorial cartoons",
    "description": "(Image credit: John Deering / Copyright 2025 Creators Syndicate)\n(Image credit: Bill Bramhall / Copyright 2025 Tribune Content Agency)\n(Image credit: Dick Wright / Copyright 2025 Cagle Cartoons, Inc.)",
    "link": "https://biztoc.com/x/364d9d9be5bac01a",
    "timestamp": "2025-05-25T15:11:46Z"
  },
  {
    "title": "US de facto financing persecution of Christians in Ukraine – Tucker Carlson",
    "description": "America continues financial assistance to Kiev even though it oppresses Ukraine’s canonical Orthodox church, Tucker Carlson has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618106-us-pay-persecution-christians-ukraine/",
    "timestamp": "2025-05-25T15:08:58Z"
  },
  {
    "title": "US Homeland Security Sec. Kristi Noem to visit Israel following Israeli embassy staffers murder",
    "description": "Homeland Security Secretary Kristi Noem will visit Israel on Sunday following the murder of Israeli embassy em",
    "link": "https://www.jpost.com/breaking-news/article-855374",
    "timestamp": "2025-05-25T15:08:15Z"
  },
  {
    "title": "Following DC murders: US Homeland Security Secretary Kristi Noem to visit Israel",
    "description": "US Homeland Security Secretary Kristi Noem to visit Israel on President Trump’s directive following DC murders of embassy staff; will meet leaders, honor victims, and attend memorial ceremony.",
    "link": "https://www.israelnationalnews.com/news/408941",
    "timestamp": "2025-05-25T15:08:07Z"
  },
  {
    "title": "Tariff Uncertainties, Part 3: The Bond Markets",
    "description": "The Bond Market is behaving strangely – and tariffs have very little to do with it.",
    "link": "https://www.forbes.com/sites/georgecalhoun/2025/05/25/tariff-uncertainties-part-3-the-bond-markets/",
    "timestamp": "2025-05-25T15:06:38Z"
  },
  {
    "title": "Republicans Extend Olive Branch To (Certain) Canadians",
    "description": "There's no business like snowbird business.",
    "link": "https://www.wonkette.com/p/republicans-extend-olive-branch-to",
    "timestamp": "2025-05-25T15:02:14Z"
  },
  {
    "title": "Donald Trump works at Walmart | May 25 editorial cartoons",
    "description": "Sunday's political cartoons feature Donald Trump's tariffs, Big pharma, and cuts to Medicaid",
    "link": "https://theweek.com/cartoons/americans-cant-eat-the-tariffs-may-25-editorial-cartoons",
    "timestamp": "2025-05-25T15:01:00Z"
  },
  {
    "title": "Trump threatens Apple with 25% tariffs on iPhones not made in the US",
    "description": "U.S. President Donald Trump announced Friday that Apple could face a tariff of at least 25% if iPhones sold in the United States are not manufactured domestically. The announcement triggered a 3% drop in Apple shares during Wall Street trading. The Dow Jones …",
    "link": "https://biztoc.com/x/b478f120e8a9958a",
    "timestamp": "2025-05-25T15:00:49Z"
  },
  {
    "title": "Billy Joel: My Life",
    "description": "Bob Lefsetz: We tend to think life has an on/off switch. You’re either alive or your dead. But it rarely goes down that way. We thought our classic rock stars were forever. Until they weren’t. They were going to go on tour, maybe walking and playing a bit mor…",
    "link": "https://ritholtz.com/2025/05/billy-joel/",
    "timestamp": "2025-05-25T15:00:24Z"
  },
  {
    "title": "Trump’s Foreign Policy Shifts Reshape European Defense Strategy",
    "description": "Successive US administrations have long lobbied European allies to shoulder their fair burden for joint defense, but US President Donald Trump has taken a more bottom-line driven approach to NATO, publicly questioning why the United States should pay for the …",
    "link": "https://oilprice.com/Geopolitics/International/Trumps-Foreign-Policy-Shifts-Reshape-European-Defense-Strategy.html",
    "timestamp": "2025-05-25T15:00:00Z"
  },
  {
    "title": "Hostages not likely to come back? Things not going so well for Netanyahu, but all is not lost",
    "description": "'He is very good at getting out of difficult political situations, and we've seen him survive instances in the past when everyone said, Oh, it seems like this is it for him'",
    "link": "https://www.wnd.com/2025/05/hostages-not-likely-to-come-back-things-not-going-so-well-for-netanyahu-but-all-is-not-lost/",
    "timestamp": "2025-05-25T14:58:18Z"
  },
  {
    "title": "Fetterman Doesn't Want To Show Up For Work, Says His Mental Health Has Been 'Weaponized' - NewsBreak",
    "description": "Sen. John Fetterman (D-Pa.) told The New York Times he wants to spend time with his family instead of showing up for votes and hearings.",
    "link": "https://www.newsbreak.com/share/4022440817386-fetterman-doesn-t-want-to-show-up-for-work-says-his-mental-health-has-been-weaponized?s=a2&amp;share_destination_id=MzEyODQ3OTc4LTE3NDgxODQ5NzQ1OTI%3D&amp;pd=0LAg38b3&amp;hl=en_US&amp;send_time=1748184974&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_rank_exp_25q2-v3%2Cns_foryou_recall_exp_25q2-v9%2Cns_foryou_blend_exp_25q2-v4",
    "timestamp": "2025-05-25T14:58:01Z"
  },
  {
    "title": "US military shifts messaging in Africa, telling allies to prepare to stand on own",
    "description": "The U.S. military is backing off its usual talk of good governance and countering underlying causes of African insurgencies",
    "link": "https://abcnews.go.com/International/wireStory/us-military-shifts-messaging-africa-telling-allies-prepare-122176570",
    "timestamp": "2025-05-25T14:56:52Z"
  },
  {
    "title": "James Comey Warns GOP They Will Be ‘Deeply Sorry’ About Going After Political Enemies — Vows Dems Will ‘Someday’ Turn the Tables On Them",
    "description": "James Comey is warning the GOP that they will regret using the DOJ to target their political enemies because \"someday\" Democrats will turn the tables on them.\nThe post James Comey Warns GOP They Will Be ‘Deeply Sorry’ About Going After Political Enemies — Vow…",
    "link": "https://www.mediaite.com/media/news/james-comey-warns-gop-they-will-be-deeply-sorry-about-going-after-political-enemies-vows-dems-will-someday-turn-the-tables-on-them/",
    "timestamp": "2025-05-25T14:54:21Z"
  },
  {
    "title": "Trump threatens 25% tariff on Apple, warns Samsung and others could be next",
    "description": "President Donald Trump on Friday demanded Apple and other smartphone makers like Samsung make their phones in the United States or face a 25% tariff.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/Trump-threatens-25-tariff-on-Apple-warns-Samsung-and-others-could-be-next-1985302",
    "timestamp": "2025-05-25T14:54:14Z"
  },
  {
    "title": "US dollar falls to lowest since 2023 as investors eye trade risks",
    "description": "The US dollar slumped to its lowest level since 2023 as new tariff threats from President Donald Trump and the risk of a widening fiscal deficit drag on the currency’s appeal.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/US-dollar-falls-to-lowest-since-2023-as-investors-eye-trade-risks-1985301",
    "timestamp": "2025-05-25T14:52:03Z"
  },
  {
    "title": "House Speaker Johnson downplays deficit concerns over House budget bill",
    "description": "Speaker Mike Johnson rejected concerns that the \"big, beautiful bill\" will add to the federal deficit.",
    "link": "https://www.cnbc.com/2025/05/25/mike-johnson-budget-house-deficit-senate-republicans-trump.html",
    "timestamp": "2025-05-25T14:47:36Z"
  },
  {
    "title": "A 50% tariff on EU goods would halt trade between the bloc and US, says minister",
    "description": "Minister of State for European Affairs Thomas Byrne urged the EU to ‘stand firm’ in trade talks with the United States.",
    "link": "https://www.thejournal.ie/tariffs-eu-halt-trade-bloc-and-us-minister-6714303-May2025/",
    "timestamp": "2025-05-25T14:40:45Z"
  },
  {
    "title": "Democratic credibility tanks to ‘catastrophic’ level with Biden health cover-up - NewsBreak",
    "description": "Revelations about former President Joe Biden’s mental and physical decline in office have set off a credibility crisis in the Democratic Party that may tak",
    "link": "https://www.newsbreak.com/share/4020383660406-democratic-credibility-tanks-to-catastrophic-level-with-biden-health-cover-up?s=a2&amp;share_destination_id=Mjg0MjgwMDUxLTE3NDgxODM5MDI2NjA%3D&amp;pd=0JEoE7iu&amp;hl=en_US&amp;send_time=1748183902&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.39.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v5%2Cns_foryou_recall_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v4%2Cns_foryou_rank_exp_25q2-v8",
    "timestamp": "2025-05-25T14:39:25Z"
  },
  {
    "title": "US military shifts messaging in Africa, telling allies to prepare to stand more on their own",
    "description": "The U.S. military is backing off its usual talk of good governance and countering insurgencies' underlying causes, instead leaning into a message that its...",
    "link": "https://www.yahoo.com/news/us-military-shifts-messaging-africa-143841193.html",
    "timestamp": "2025-05-25T14:38:41Z"
  },
  {
    "title": "Bennet: Democratic Party Brand Does Not Help Anywhere",
    "description": "Senator Michael Bennet (D-CO) said Sunday on CNN's \"State of the Union\" that the Democratic Party's brand was not helpful for politicians to run under \"anywhere.\"\nThe post Bennet: Democratic Party Brand Does Not Help Anywhere appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/05/25/bennet-democratic-party-brand-does-not-help-anywhere/",
    "timestamp": "2025-05-25T14:36:19Z"
  },
  {
    "title": "Crazy Grandpa Rants At West Point Graduation To Hostage Audience",
    "description": "Sporting a \"Make America Great Again\" baseball hat thingie, Donald J. Trump offered a commencement speech at West Point for the graduates, and it was weird. At least we know that Donald is bilingual since he started talking in Potato about trophy wives and ya…",
    "link": "https://crooksandliars.com/2025/05/crazy-grandpa-rants-west-point-graduation",
    "timestamp": "2025-05-25T14:33:22Z"
  },
  {
    "title": "The MAGAfication of Israel: How America's Heritage Foundation plans to 'convert' the Jewish state",
    "description": "The right-wing organization that prepared the American blueprint for for dismantling liberal democracy in Trump's second term is 'making aliyah,' cozying up to Netanyahu's government through like-minded groups, such as the powerful Kohelet Policy  forum",
    "link": "https://www.haaretz.com/israel-news/2025-05-25/ty-article-magazine/.premium/how-americas-heritage-foundation-plans-to-convert-the-jewish-state/00000196-e37d-d5aa-abd7-ef7dfee00000",
    "timestamp": "2025-05-25T14:30:46Z"
  },
  {
    "title": "US Risks Losing ‘Reliable Investment’ Status, Allianz GI Manager Says",
    "description": "Inside one of Europe’s biggest asset managers, there’s growing concern that Republican efforts to gut legislation supporting key industries such as clean energy may result in the US losing its status as a destination for investor capital.",
    "link": "https://financialpost.com/pmn/business-pmn/us-risks-losing-reliable-investment-status-allianz-gi-manager-says",
    "timestamp": "2025-05-25T14:28:48Z"
  },
  {
    "title": "‘This Motherf*ker’: Kamala Harris Wasn’t Too Pleased With Anderson Cooper After Post-Debate Grilling, Book Claims",
    "description": "Harris reportedly called Cooper a \"motherfucker\" to her colleagues after being pressed about Biden’s mental decline, according to a \"Original Sin.\"",
    "link": "https://dailycaller.com/2025/05/25/kamala-harris-anderson-cooper-cnn-jake-tapper-alex-thompson-book-biden-mental/",
    "timestamp": "2025-05-25T14:28:27Z"
  },
  {
    "title": "How Musk's Political Spending Retreat Could Upset GOP",
    "description": "Elon Musk said he would significantly pull back from political spending, a likely blow to US President Donald Trump and Republicans ahead of the 2026 midterm elections.\n“I’m going to do a lot less in the future,” Musk said during a discussion at the Qatar Eco…",
    "link": "https://biztoc.com/x/91f09f84542286a9",
    "timestamp": "2025-05-25T14:27:40Z"
  },
  {
    "title": "An 'Orgy of Corruption' and 'Walmart Steak': Inside Donald Trump's disastrous crypto dinner party",
    "description": "Donald Trump's exclusive dinner for $TRUMP meme coin investors sparked disappointment and criticism. Guests who invested heavily, averaging $1.8 million each, complained about poor food and limited access to Trump, who delivered a brief speech. Senator Elizab…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/an-orgy-of-corruption-and-walmart-steak-inside-donald-trumps-disastrous-crypto-dinner-party/articleshow/121395036.cms",
    "timestamp": "2025-05-25T14:25:32Z"
  },
  {
    "title": "South Africa's Malema Repeats 'Kill the Farmer' as Ramaphosa Stays Quiet",
    "description": "South African opposition figure Julius Malema led his Economic Freedom Fighters (EFF) party on Sunday in chants of \"Kill the Boer,\" \"Shoot to kill,\" and \"Kill the farmer,\" while President Cyril Ramaphosa stayed quiet.\nThe post South Africa’s Malema Repeats ‘K…",
    "link": "https://www.breitbart.com/politics/2025/05/25/south-africas-malema-repeats-kill-the-farmer-as-ramaphosa-stays-quiet/",
    "timestamp": "2025-05-25T14:23:37Z"
  },
  {
    "title": "'The emperor has no clothes': Rand Paul rips into Trump's 'big, beautiful bill'",
    "description": "Sen. Rand Paul (R-KY) tore into President Donald Trump's \"big, beautiful\" budget bill for failing to make significant spending cuts.\n\n\nIn a Sunday interview on Fox News, host Shannon Bream noted that millions could lose access to health care and the Supplemen…",
    "link": "https://www.rawstory.com/rand-paul-big-beautiful-bill/",
    "timestamp": "2025-05-25T14:18:22Z"
  },
  {
    "title": "Consumer Tech News (May 19-May 23): Trump Warns Apple Of 25% Tariff if Manufactured Overseas, Disney Sues YouTube & More",
    "description": "President Donald Trump just fired a policy warning shot toward Apple Inc. (NASDAQ:AAPL), reiterating that he expects the company to manufacture iPhones sold in the U.S. domestically, not in India or anywhere else. If not, he warns, a 25% tariff could be slapp…",
    "link": "https://biztoc.com/x/ee7d1fe2f77e1c57",
    "timestamp": "2025-05-25T14:16:24Z"
  },
  {
    "title": "Donald Trump puts Harvard's historic prestige at risk of disappearing",
    "description": "For students around the world, an acceptance letter to Harvard University has long represented the pinnacle of success, offering a place among the elite on a campus that produces N",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/05/25/68332284ca4741db4b8b45d1.html",
    "timestamp": "2025-05-25T14:14:21Z"
  },
  {
    "title": "Harvard Professor Tells Top US Student 'Look Overseas'",
    "description": "Jeremy Faust, an assistant professor of emergency medicine, said he told a prospective graduate student to consider enrolling at a university abroad.",
    "link": "https://www.newsweek.com/harvard-professor-tells-student-look-overseas-2076838",
    "timestamp": "2025-05-25T14:13:32Z"
  }
]