[
  {
    "title": "XRP's RLUSD Stablecoin Has Only 0.7% Market Share: What Is Going On?",
    "description": "Recent shifts in U.S. regulatory policy under President Donald Trump have sparked optimism for a stablecoin boom, yet major players like PayPal's PYUSD (CRYPTO: PYUSD) and Ripple's RLUSD (CRYPTO: RLUSD) are struggling to capitalize on the favorable climate.\nD…",
    "link": "https://biztoc.com/x/def9c49dfd5eda9c",
    "timestamp": "2025-03-11T15:33:19Z"
  },
  {
    "title": "Trump Announces Flurry Of Additional Tariffs On Canada",
    "description": "President Donald Trump announced a flurry of new tariffs on Canada, sent to take effect on Wednesday, in a TruthSocial post.",
    "link": "https://dailycaller.com/2025/03/11/donald-trump-canada-tariffs-steel-aluminum-dairy-products-farmers-truth-social/",
    "timestamp": "2025-03-11T15:32:23Z"
  },
  {
    "title": "Monopolies, scalpers, and the future of online ticket sales",
    "description": "Two years after a Taylor Swift ticketing debacle riled up fans and policymakers across the country, Ticketmaster is still fighting a multipronged battle against efforts to break it up and change the rules of the industry in ways resellers are vying for â\u0080\u0094 in…",
    "link": "https://www.theverge.com/policy/627453/online-ticketing-future-live-nation-ticketmaster-stubhub-lobbying",
    "timestamp": "2025-03-11T15:31:33Z"
  },
  {
    "title": "New details make DHS’s pro-Trump ad even more controversial",
    "description": "Reporting suggests the Department of Homeland Security skipped a competitive bidding process to give two Republican-linked firms an ad contract.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-details-make-dhss-trump-ad-even-controversial-rcna195827",
    "timestamp": "2025-03-11T15:30:45Z"
  },
  {
    "title": "US has not imposed reciprocal tariffs on India as on date: Jitin Prasada",
    "description": "Both countries plan to negotiate a mutually beneficial, multi-sector bilateral trade agreement, says Minister",
    "link": "https://www.thehindubusinessline.com/economy/us-has-not-imposed-reciprocal-tariffs-on-india-as-on-date-jitin-prasada/article69318336.ece",
    "timestamp": "2025-03-11T15:30:22Z"
  },
  {
    "title": "Drawing huge crowds, Bernie Sanders steps into leadership of the anti-Trump resistance",
    "description": "At 83 years old, Bernie Sanders has emerged as an unlikely leader of the Democratic resistance to Donald Trump.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_54a451c8-4fc2-5277-a7b0-93b2c8f21cf3.html",
    "timestamp": "2025-03-11T15:30:00Z"
  },
  {
    "title": "Drawing huge crowds, Bernie Sanders steps into leadership of the anti-Trump resistance",
    "description": "At 83 years old, Bernie Sanders has emerged as an unlikely leader of the Democratic resistance to Donald Trump.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_784b036b-3438-5f7b-a092-6ea2f97e8bbe.html",
    "timestamp": "2025-03-11T15:30:00Z"
  },
  {
    "title": "US dollar hits one-week high against Canadian dollar on Trump tariffs",
    "description": "The U.S. dollar rose to a one-week high against the Canadian dollar on Tuesday after President Donald Trump hit Canada with more tariffs while the euro hit a new four-month peak against the U.S. currency on hopes a German defence spending deal.",
    "link": "https://economictimes.indiatimes.com/markets/forex/us-dollar-hits-one-week-high-against-canadian-dollar-on-trump-tariffs/articleshow/118897001.cms",
    "timestamp": "2025-03-11T15:29:40Z"
  },
  {
    "title": "X users aren’t buying Musk’s claim Ukraine was behind site’s massive outage",
    "description": "Users on X are having a hard time believing Elon Musk’s claim that Ukraine was behind the site's massive outage yesterday. \n\n\nFollowing lengthy outages on Monday that left thousands of users without access, Musk claimed the site experienced a “massive cyberat…",
    "link": "https://www.dailydot.com/debug/elon-musk-ukraine-ddos/",
    "timestamp": "2025-03-11T15:29:05Z"
  },
  {
    "title": "Trump to Buy New Tesla to Support Elon Musk, Fight ‘Radical Left Lunatics’",
    "description": "The president's purchase would come as Tesla's stock has dropped more than 40% since the start of the year amid DOGE protests\nThe post Trump to Buy New Tesla to Support Elon Musk, Fight ‘Radical Left Lunatics’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-buys-new-tesla-support-elon-musk/",
    "timestamp": "2025-03-11T15:28:45Z"
  },
  {
    "title": "Videos of Sam Seder Debating MAGA Supporters Viewed Millions of Times",
    "description": "Videos of left-wing activist and YouTuber Sam Seder debating 20 Trump supporters have gone viral on YouTube and X.",
    "link": "https://www.newsweek.com/sam-seder-jubilee-episode-trump-maga-videos-2042898",
    "timestamp": "2025-03-11T15:28:23Z"
  },
  {
    "title": "China, Iran, Russia hold joint naval drills in Mideast as tensions rise between Tehran, US",
    "description": "China, Iran, and Russia conducted joint naval drills in the Gulf of Oman. These exercises come amid regional concerns over Iran's nuclear program and renewed threats from Yemen's Houthi rebels. The drills involved Russia's Defence Ministry and China's Defence…",
    "link": "https://economictimes.indiatimes.com/news/defence/china-iran-russia-hold-joint-naval-drills-in-mideast-as-tensions-rise-between-tehran-us/articleshow/118896942.cms",
    "timestamp": "2025-03-11T15:27:06Z"
  },
  {
    "title": "In Defense of Jos. A. Bank: The Menswear Store Gets Shady Shoutout on ‘SNL’ but Their Latest Pieces Are Surprisingly Stylish",
    "description": "Donald Trump (James Austin Johnson) chastised Mike Myers' Elon Musk for his Jos. A. Bank suit on SNL but the store actually has stylish pieces to shop",
    "link": "http://www.rollingstone.com/product-recommendations/lifestyle/jos-a-bank-saturday-night-live-episode-mention-1235292698/",
    "timestamp": "2025-03-11T15:26:31Z"
  },
  {
    "title": "Man who said he planned to visit Trump arrested for alleged assault on flight to Washington | CNN",
    "description": "A man who told investigators he was flying to Washington, DC, to speak to President Donald Trump was arrested by the FBI after he allegedly attacked a passenger and threatened a flight attendant onboard an American Airlines flight.",
    "link": "https://www.cnn.com/2025/03/11/travel/man-arrested-american-airlines-washington/index.html",
    "timestamp": "2025-03-11T15:25:38Z"
  },
  {
    "title": "Keeping Government Open Isn't Worth Handing Trump All The Power",
    "description": "Dems need to stop that shit from passing.",
    "link": "https://www.wonkette.com/p/keeping-government-open-isnt-worth",
    "timestamp": "2025-03-11T15:25:28Z"
  },
  {
    "title": "Former ICE Agent Says Dreamers Deserve Legal Status",
    "description": "\"There are a percentage of people who deserve, at this point, to be legalized,\" said Scott Mechkowski, a retired ICE agent.",
    "link": "https://www.newsweek.com/ice-agent-dreamers-daca-legal-status-2042767",
    "timestamp": "2025-03-11T15:25:08Z"
  },
  {
    "title": "US, British commanders show unity after Trump uncertainties",
    "description": "FAIRFORD, England (Reuters) - U.S. and British commanders said on Tuesday joint military exercises were vital for providing Europe with a deterrent to Russia, a show of unity after President Donald Trump's overtures to Moscow raised doubt about Washington's c…",
    "link": "https://www.thestar.com.my/news/world/2025/03/11/us-british-commanders-show-unity-after-trump-uncertainties",
    "timestamp": "2025-03-11T15:25:00Z"
  },
  {
    "title": "March is off to a painful start for big-name hedge funds",
    "description": "Early monthly returns for large multistrategy firms Millennium, Point72, and Balyasny show industry-wide pain thanks to market volatility.",
    "link": "https://www.businessinsider.com/millennium-balyasny-point72-lose-money-to-start-march-2025-3",
    "timestamp": "2025-03-11T15:24:17Z"
  },
  {
    "title": "Businesses sound alarm as Trump tariffs prompt consumers to cut spending",
    "description": "LONDON/NEW YORK (Reuters) - Uncertainty brought by U.S. President Donald Trump's threats of tariffs and his shape-shifting trade policies are starting to have a chilling effect across many industries, businesses warn, as consumers pull back on everything from…",
    "link": "https://biztoc.com/x/27e83c4dac049751",
    "timestamp": "2025-03-11T15:23:03Z"
  },
  {
    "title": "Trump says he’ll buy a Tesla to show support for Musk as company faces financial trouble",
    "description": "With Elon Musk facing escalating political blowback and financial troubles, President Donald Trump said he would buy a Tesla TSLA-Q vehicle from his company, an unusual show of support from the president to his most powerful adviser.\nIt was the latest example…",
    "link": "https://biztoc.com/x/f1da5240b10b7eea",
    "timestamp": "2025-03-11T15:22:09Z"
  },
  {
    "title": "Stock market continues its slide after Trump ups the ante in his trade war",
    "description": "The drops extend a sell-off on Wall Street that has taken investors on a scary ride, fueled by worries about how much pain Trump will allow the economy to endure through tariffs and other policies he's pushing to remake the country and world.",
    "link": "https://www.pbs.org/newshour/economy/stock-market-continues-its-slide-after-trump-ups-the-ante-in-his-trade-war",
    "timestamp": "2025-03-11T15:22:06Z"
  },
  {
    "title": "First on Fox: Top conservative group aligns with Trump as it makes major endorsement in high-profile race",
    "description": "The Club for Growth, a top conservative group that is a major player in Republican primaries, aligns with President Trump as it endorses Byron Donalds in the race to succeed Florida Gov. Ron DeSantis.",
    "link": "https://www.foxnews.com/politics/first-fox-top-conservative-group-aligns-trump-makes-major-endorsement-high-profile-race",
    "timestamp": "2025-03-11T15:21:49Z"
  },
  {
    "title": "Forget tariffs, Trump may be targeting the Great Lakes and Canada’s freshwater next",
    "description": "With parts of the U.S. facing chronic drought, the president has reportedly threatened to tear up joint agreements regulating the natural wonders. Joe O'Connor looks at what is at stake",
    "link": "https://financialpost.com/feature/canada-water-next-front-battle-with-u-s",
    "timestamp": "2025-03-11T15:21:38Z"
  },
  {
    "title": "Govt working on sops to help exporters deal with US tariff woes",
    "description": "Government working on additional sops to help exporters amid US tariff threats, utilizing ₹2,250-crore export promotion mission.",
    "link": "https://www.thehindubusinessline.com/economy/govt-working-on-sops-to-help-exporters-deal-with-us-tariff-woes/article69318260.ece",
    "timestamp": "2025-03-11T15:21:19Z"
  },
  {
    "title": "MSNBC mocks Trump with supercut of clips of him bragging about stock market",
    "description": "President Donald Trump is downplaying his influence on the stock market after watching it plunge by more than 2,000 points Monday — with another 500-point tumble soon after opening Tuesday.But MSNBC showed a supercut of Trump's past speeches in which he boast…",
    "link": "https://www.rawstory.com/trump-stock-market-2671306211/",
    "timestamp": "2025-03-11T15:19:35Z"
  },
  {
    "title": "White House Press Secretary Karoline Leavitt lets loose on podcast, calls reporters with expletives in blunt takedown of the press",
    "description": "White House Press Secretary Karoline Leavitt criticized some reporters for citing politically biased experts on the Ruthless podcast. Her profanity-laced remarks and support for conservative media have sparked debate over the administration's approach to the …",
    "link": "https://economictimes.indiatimes.com/news/international/us/white-house-press-secretary-karoline-leavitt-lets-loose-on-podcast-calls-reporters-with-expletives-in-blunt-takedown-of-the-press/articleshow/118896675.cms",
    "timestamp": "2025-03-11T15:19:06Z"
  },
  {
    "title": "Denmark adds to EU split over troops in Ukraine",
    "description": "Copenhagen is prepared to join a European peacekeeping mission in Ukraine, according to Foreign Minister Lars Rasmussen Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614039-denmark-ukraine-troop-deployment/",
    "timestamp": "2025-03-11T15:18:29Z"
  },
  {
    "title": "‘They’re Crushing Us!’ CNBC’s Jim Cramer Flips Out on Trump Over Stock Market — Says He’s ‘Manufacturing’ a Recession",
    "description": "CNBC host Jim Cramer went off on President Donald Trump for fueling recession fears and cratering the stock market, noting competitor markets are \"crushing us.\"\nThe post ‘They’re Crushing Us!’ CNBC’s Jim Cramer Flips Out on Trump Over Stock Market — Says He’s…",
    "link": "https://www.mediaite.com/news/theyre-crushing-us-cnbcs-jim-cramer-flips-out-on-trump-over-stock-market-says-hes-manufacturing-a-recession/",
    "timestamp": "2025-03-11T15:17:57Z"
  },
  {
    "title": "Canadian Dollar Slumps as Trump Threatens to Double Steel Levies",
    "description": "The Canadian dollar slid to a weekly low and local bonds rallied after US President Donald Trump said he would raise steel and aluminum tariffs on Canada to 50%, doubling a planned levy set to take effect just after midnight.",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-dollar-slumps-as-trump-threatens-to-double-steel-levies",
    "timestamp": "2025-03-11T15:17:50Z"
  },
  {
    "title": "Trump energy chief declares climate change a 'global physical phenomenon' amid reversal of Biden-era policies",
    "description": "The top energy head declared that the Trump administration's approach to climate change is \"a side effect of building the modern world.\"",
    "link": "https://www.foxnews.com/politics/trump-energy-chief-declares-climate-change-global-physical-phenomenon-amid-reversal-biden-era-policies",
    "timestamp": "2025-03-11T15:17:31Z"
  },
  {
    "title": "Study Saying Texas Migrants Commit Less Crimes Disappears From DOJ Website",
    "description": "The data challenges the White House's repeated portrayal of these migrants as violent criminals.",
    "link": "https://www.newsweek.com/study-texas-migrants-committ-less-crimes-dissappears-doj-2042878",
    "timestamp": "2025-03-11T15:17:14Z"
  },
  {
    "title": "Will the U.S. collapse like the Soviet Union did?",
    "description": "America’s current retreat from world power recalls that of the Soviet Union after 1988. Is the U.S. poised to collapse like the Soviet Union did?",
    "link": "https://theconversation.com/will-the-u-s-collapse-like-the-soviet-union-did-250212",
    "timestamp": "2025-03-11T15:17:07Z"
  },
  {
    "title": "US multinationals in Ireland for ‘long haul’, says Taoiseach Micheál Martin ahead of Trump talks",
    "description": "Taoiseach Micheál Martin and a slew of ministers and diplomats have begun series of meetings and engagements in the US to coincide with St Patrick’s Day celebrations.",
    "link": "https://www.independent.ie/irish-news/us-multinationals-in-ireland-for-long-haul-says-taoiseach-micheal-martin-ahead-of-trump-talks/a438244273.html",
    "timestamp": "2025-03-11T15:16:50Z"
  },
  {
    "title": "Members of the Burke family on plane to Washington ahead of Taoiseach’s White House visit with Trump",
    "description": "Taoiseach Micheál Martin and a slew of ministers and diplomats have begun series of meetings and engagements in the US to coincide with St Patrick’s Day celebrations.",
    "link": "https://www.independent.ie/irish-news/members-of-the-burke-family-on-plane-to-washington-ahead-of-taoiseachs-white-house-visit-with-trump/a438244273.html",
    "timestamp": "2025-03-11T15:16:50Z"
  },
  {
    "title": "Taoiseach says Burke family ‘free to travel’ to Washington as family members travel to the capital ahead of White House visit with Trump",
    "description": "Taoiseach Micheál Martin and a slew of ministers and diplomats have begun series of meetings and engagements in the US to coincide with St Patrick’s Day celebrations.",
    "link": "https://www.independent.ie/irish-news/politics/taoiseach-says-burke-family-free-to-travel-to-washington-as-family-members-travel-to-the-capital-ahead-of-white-house-visit-with-trump/a438244273.html",
    "timestamp": "2025-03-11T15:16:50Z"
  },
  {
    "title": "US multinationals in Ireland for ‘long haul’, says Taoiseach Micheál Martin ahead of Trump talks",
    "description": "Taoiseach Micheál Martin and a slew of ministers and diplomats have begun series of meetings and engagements in the US to coincide with St Patrick’s Day celebrations.",
    "link": "https://www.independent.ie/irish-news/politics/us-multinationals-in-ireland-for-long-haul-says-taoiseach-micheal-martin-ahead-of-trump-talks/a438244273.html",
    "timestamp": "2025-03-11T15:16:50Z"
  },
  {
    "title": "Trade War: Trump Doubles Canadian Tariffs",
    "description": "President Donald Trump said he was increasing the steel and aluminum tariff on Canadian goods to 50% to retaliate against ...",
    "link": "https://biztoc.com/x/c881c6f29a0d44c0",
    "timestamp": "2025-03-11T15:16:21Z"
  },
  {
    "title": "US hasn't determined who was behind attack that caused outage on Musk's social site X",
    "description": "​Monday's outage was described as a cyber attack by the official, who was not authorised to comment publicly on the matter and spoke Tuesday on the condition of anonymity.",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-hasnt-determined-who-was-behind-attack-that-caused-outage-on-musks-social-site-x/articleshow/118896639.cms",
    "timestamp": "2025-03-11T15:15:46Z"
  },
  {
    "title": "The D Brief: Allies mull nukes; Syrian breakthrough?; Base-refineries proposal; Judge demands DOGE records; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/03/the-d-brief-march-11-2025/403644/",
    "timestamp": "2025-03-11T15:14:58Z"
  },
  {
    "title": "Trump increases tariffs on Canadian steel and aluminum to 50% and pressures again: Become the 51st State of the U.S.",
    "description": "Donald Trump has raised tariffs on steel and aluminum imports from Canada to 50% and is once again pushing for Canada to become the 51st U.S. state \nThe post Trump increases tariffs on Canadian steel and aluminum to 50% and pressures again: Become the 51st St…",
    "link": "https://en.protothema.gr/2025/03/11/trump-increases-tariffs-on-canadian-steel-and-aluminum-to-50-and-pressures-again-become-the-51st-state-of-the-u-s/",
    "timestamp": "2025-03-11T15:14:33Z"
  },
  {
    "title": "Ontario Premier Doug Ford Blames Trump for Escalating Trade War: ‘It’s Called President Trump’s Recession’",
    "description": "Ontario Premier Doug Ford hit back at President Donald Trump on Tuesday as the pair ramped up a growing trade war between Canada and the United States.\nThe post Ontario Premier Doug Ford Blames Trump for Escalating Trade War: ‘It’s Called President Trump’s Re…",
    "link": "https://www.mediaite.com/tv/ontario-premier-doug-ford-blames-trump-for-escalating-trade-war-its-called-president-trumps-recession/",
    "timestamp": "2025-03-11T15:14:17Z"
  },
  {
    "title": "Wall Street Journal Needles Donald Trump With 1 Tough Question In Biting Editorial - HuffPost",
    "description": "Wall Street Journal Needles Donald Trump With 1 Tough Question In Biting EditorialHuffPost How the US economy went from booming to a recession scare in only 20 daysCNN Is a recession coming? Here's what JPMorgan and other banks, analysts, and economists sayQu…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176674591",
    "timestamp": "2025-03-11T15:12:56Z"
  },
  {
    "title": "‘Getting scary’: US aid cuts undermine global fight against TB",
    "description": "The Trump administration’s sweeping foreign aid cuts will send tuberculosis cases and deaths soaring around the world, humanitarian workers have warned. One told AFP that people are already dying from a lack of treatment in the war-torn Democratic Republic of…",
    "link": "https://www.digitaljournal.com/world/getting-scary-us-aid-cuts-undermine-global-fight-against-tb/article",
    "timestamp": "2025-03-11T15:12:21Z"
  },
  {
    "title": "'Getting Scary': US Aid Cuts Undermine Global Fight Against TB",
    "description": "The Trump administration's sweeping foreign aid cuts will send tuberculosis cases and deaths soaring around the world, humanitarian workers have warned.",
    "link": "https://www.ibtimes.com.au/getting-scary-us-aid-cuts-undermine-global-fight-against-tb-1856787",
    "timestamp": "2025-03-11T15:12:20Z"
  },
  {
    "title": "'Getting Scary': US Aid Cuts Undermine Global Fight Against TB",
    "description": "The Trump administration's sweeping foreign aid cuts will send tuberculosis cases and deaths soaring around the world, humanitarian workers have warned.",
    "link": "https://www.ibtimes.com/getting-scary-us-aid-cuts-undermine-global-fight-against-tb-3765929",
    "timestamp": "2025-03-11T15:12:11Z"
  },
  {
    "title": "A Timeline Of Elon Musk’s Terrible 24 Hours—A Dark Day For X, Tesla And More",
    "description": "There’s a “black cloud over Tesla’s stock,” remarked one analyst as Musk’s primary company suffered its worst loss since 2020, while Musk’s X attack on Sen. Mark Kelly and a halting appearance on Fox Business did him no favors.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/11/a-timeline-of-elon-musks-terrible-24-hours-a-dark-day-for-x-tesla-and-more/",
    "timestamp": "2025-03-11T15:11:41Z"
  },
  {
    "title": "President Trump Says Boycotting Tesla Is Illegal",
    "description": "President Donald Trump took to social media to tell Americans they must buy Teslas as it is illegal to boycott the company.",
    "link": "https://www.jalopnik.com/1808688/president-trump-tesla-boycott-statement-elon-musk/",
    "timestamp": "2025-03-11T15:11:05Z"
  },
  {
    "title": "Ontario premier: We will not back down from trade war",
    "description": "Ontario Premier Doug Ford pointed out during an interview with MSNBC on Tuesday that Canada \"will not back down\" from the tariff war brewing after US President Donald Trump imposed doubled tariffs on ...",
    "link": "https://biztoc.com/x/4375d24e87f289b3",
    "timestamp": "2025-03-11T15:10:58Z"
  },
  {
    "title": "MORE STOCK LOSSES",
    "description": "MORE STOCK LOSSES\r\n\n \n \n \n (Main headline, 2nd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:MORE TARIFF CHAOS\r\nBOOM TO BUST IN 20 DAYS\r\n'DON'T PANIC'\r\nTESLA DOOM SPIRAL",
    "link": "https://www.cnbc.com/2025/03/10/stock-market-today-live-updates.html",
    "timestamp": "2025-03-11T15:10:36Z"
  },
  {
    "title": "HBO's John Oliver: 'There Are Positive Things You Can Say About Reagan, Like ... He's Dead’",
    "description": "HBO MAX funnyman John Oliver listed two positive things you could say about President Ronald Reagan: \"'He was our only president to make a movie with a chimp,’ or ‘He's dead.’\"\nThe post HBO’s John Oliver: ‘There Are Positive Things You Can Say About Reagan, L…",
    "link": "https://www.breitbart.com/entertainment/2025/03/11/hbos-john-oliver-there-are-positive-things-you-can-say-about-reagan-like-hes-dead/",
    "timestamp": "2025-03-11T15:08:32Z"
  },
  {
    "title": "'Heartless': Trump's $660 Million School Food Cut Is Latest GOP Attack on Nutrition Aid",
    "description": "The Trump administration is cutting over $600 million from a program designed to help schools and child care facilities buy healthy food from local farmers, the GOP’s latest attack on poor families. The administration is also cutting a similar program that he…",
    "link": "https://www.thenewcivilrightsmovement.com/2025/03/heartless-trumps-660-million-school-food-cut-is-latest-gop-attack-on-nutrition-aid/",
    "timestamp": "2025-03-11T15:07:52Z"
  },
  {
    "title": "Mortgage Predictions for Week of March 10-16: Slightly Lower Rates, but Not a Rosy Picture",
    "description": "Cheaper mortgages often signal bad economic news.",
    "link": "https://www.cnet.com/personal-finance/mortgage-predictions-for-week-of-march-10-16-slightly-lower-rates-but-not-a-rosy-picture/",
    "timestamp": "2025-03-11T15:06:35Z"
  },
  {
    "title": "Disney Scales Back ‘Snow White’ Hollywood Premiere Amid Rachel Zegler and Gal Gadot Controversies",
    "description": "Disney is hosting a Hollywood premiere of “Snow White” on March 15, but the studio won’t be rolling out a robust red carpet like it usually does. The afternoon festivities will include a pre-party and screening at the El Capitan Theatre with titular star Rach…",
    "link": "https://variety.com/2025/film/columns/disney-snow-white-premiere-zegler-gadot-controversies-1236333285/",
    "timestamp": "2025-03-11T15:06:00Z"
  },
  {
    "title": "Thomas: Past 'level of exhaustion' over LIV, PGA",
    "description": "Justin Thomas said Tuesday that both PGA Tour and LIV players are \"past the level of exhaustion\" when it comes to the ongoing reunification talks.",
    "link": "https://www.espn.com/golf/story/_/id/44205956/justin-thomas-lot-players-know-liv-pga-tour-talks",
    "timestamp": "2025-03-11T15:05:41Z"
  },
  {
    "title": "Trump raises Canadian steel, aluminum tariffs to 50% in retaliation for Ontario energy duties (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nTrump raises Canadian steel, aluminum tariffs to 50% in retaliation for Ontario energy duties … President Donald Trump said Tuesday he has ordered his administration to raise tariffs on Canadian steel and aluminum imports by an additi…",
    "link": "https://www.memeorandum.com/250311/p53",
    "timestamp": "2025-03-11T15:05:00Z"
  },
  {
    "title": "Trump Says He's Doubling Tariffs On Canadian Steel, Aluminum (Jordan Fabian/Bloomberg)",
    "description": "Jordan Fabian / Bloomberg:\nTrump Says He's Doubling Tariffs On Canadian Steel, Aluminum  —  President Donald Trump said he was increasing the steel and aluminum tariff on Canadian goods to 50% to retaliate against Ontario's move to place a levy on electricity…",
    "link": "https://www.memeorandum.com/250311/p54",
    "timestamp": "2025-03-11T15:05:00Z"
  },
  {
    "title": "Trump pledges to double tariffs on Canada's steel and aluminum to 50%",
    "description": "Trump’s statement came after the Canadian province of Ontario imposed an electricity surcharge on three US states.",
    "link": "https://www.thejournal.ie/trump-pledges-to-double-tariff-on-canadas-steel-and-aluminum-to-50-6645906-Mar2025/",
    "timestamp": "2025-03-11T15:04:58Z"
  },
  {
    "title": "Student Loan SAVE Plan Is ‘Not Coming Back In Any Way,’ Warns Official",
    "description": "More than eight million student loan borrowers appear increasingly likely to get kicked out of an affordable income-driven repayment plan in the coming months",
    "link": "https://www.forbes.com/sites/adamminsky/2025/03/11/student-loan-save-plan-is-not-coming-back-in-any-way-warns-official/",
    "timestamp": "2025-03-11T15:04:37Z"
  },
  {
    "title": "Romania's now-barred presidential frontrunner Călin Georgescu claims he is facing Trump-like charges",
    "description": "Romania’s right-wing presidential frontrunner Călin Georgescu claims he is being attacked by lawfare similar to President Donald Trump because he exposed the \"oligarch system.\"",
    "link": "https://www.foxnews.com/politics/romanias-now-barred-presidential-front-runner-calin-georgescu-claims-he-facing-trump-like-charges",
    "timestamp": "2025-03-11T15:04:20Z"
  },
  {
    "title": "Trump vows to double tariffs on steel and aluminum from Canada even as markets continue slide - NewsBreak",
    "description": "Donald Trump took just hours to backtrack on a threat to double down on tariffs on Canadian aluminum and steel imports and instead ordered previously anno",
    "link": "https://www.newsbreak.com/share/3850805013030-trump-vows-to-double-tariffs-on-steel-and-aluminum-from-canada-even-as-markets-continue-slide?s=a2&share_destination_id=MTc5OTM4NTAzLTE3NDE3MDQ5MjI5NTA%3D&pd=0CB0Dv47&hl=en_US&send_time=1741704922&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v3%2Cns_local_strategy_25q1_exp-v14%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_model_exp_25q1-v9",
    "timestamp": "2025-03-11T15:03:22Z"
  },
  {
    "title": "Are Donald Trump’s policies leading to a stock market slump? Here’s what experts say",
    "description": "The plummeting stock market is raising concerns about the financial ramifications of President Donald Trump's unpredictable agenda. His trade disputes, a series of policy changes and refusal to rule out another recession are troubling investors. While Trump's…",
    "link": "https://economictimes.indiatimes.com/news/international/us/are-donald-trumps-policies-leading-to-a-stock-market-slump-heres-what-experts-say/articleshow/118896148.cms",
    "timestamp": "2025-03-11T15:02:45Z"
  },
  {
    "title": "Trump doubles down on Canada trade war",
    "description": "US President Donald Trump announced massive new tariffs on Canadian steel and aluminum Tuesday, while threatening to “shut down” its auto industry and saying the best way to end the trade war was for Washington’s ally to be absorbed into the United States. Tr…",
    "link": "https://www.digitaljournal.com/world/trump-doubles-down-on-canada-trade-war/article",
    "timestamp": "2025-03-11T15:02:34Z"
  },
  {
    "title": "French right-wing media’s Russia tilt irks Elysee",
    "description": "French Sunday newspaper readers woke up this past weekend to starkly different visions of their country’s relationship with Russia. “The bidding war of fear,” said the headline of Journal du Dimanche (JDD), accusing President Emmanuel Macron of seeking to pan…",
    "link": "https://www.digitaljournal.com/world/french-right-wing-medias-russia-tilt-irks-elysee/article",
    "timestamp": "2025-03-11T15:02:34Z"
  },
  {
    "title": "The Dow drops 550 points as Trump shrugs off a market rout and says more tariffs are coming",
    "description": "Stocks fell Tuesday after President Donald Trump escalated his trade war with Canada by saying he would double tariffs on the country’s aluminum and steel to 50%. The move was in response to Ontario’s plan to place a levy on products sent to the U.S. Trump al…",
    "link": "https://qz.com/stocks-tumble-trump-tariffs-trade-war-1851769076",
    "timestamp": "2025-03-11T15:02:00Z"
  },
  {
    "title": "Trump doubles tariffs on Canada steel, aluminum to 50%",
    "description": "The US president said the planned increase will take effect from Wednesday. Meanwhile, Canadian lawmakers are calling for retaliatory measures, furthering a trade war",
    "link": "https://www.dw.com/en/trump-doubles-tariffs-on-canada-steel-aluminum-to-50/a-71891981",
    "timestamp": "2025-03-11T15:02:00Z"
  },
  {
    "title": "Trump Says He's Going to Buy a Tesla as Shares Slump",
    "description": "US President Donald Trump said he'll buy a new Tesla to support Elon Musk, after shares of the electric-car maker had their worst ...",
    "link": "https://biztoc.com/x/0a2f52bc0f34528d",
    "timestamp": "2025-03-11T15:01:44Z"
  },
  {
    "title": "Justice Dept. Official Says She Was Fired for Not Letting Mel Gibson Have a Gun",
    "description": "A Justice Department official is claiming that she was fired over her refusal to give Mel Gibson back his gun rights. The personal friend of Donald Trump got his rights stripped after being convicted of a domestic-battery misdemeanor.",
    "link": "http://www.vulture.com/article/mel-gibson-trump-gun-rights-firing.html",
    "timestamp": "2025-03-11T15:01:15Z"
  },
  {
    "title": "Trump is proposing a US$5 million ‘Gold Card’ citizenship program. Could a similar plan work for Canada?",
    "description": "As Trump looks to attract foreign investors by selling “Gold Cards” worth US$5 million, experts in Canada feel Ottawa is missing out.",
    "link": "https://financialpost.com/news/economy/trump-gold-card-citizenship-program-could-work-for-canada",
    "timestamp": "2025-03-11T15:01:15Z"
  },
  {
    "title": "Ethereum falls below $2k – Can ETH avoid a fourth straight month of losses?",
    "description": "Long-term investors are treating this as a cheaper entry point rather than a devastating loss.",
    "link": "https://ambcrypto.com/ethereum-falls-below-2k-can-eth-avoid-a-fourth-straight-month-of-losses/",
    "timestamp": "2025-03-11T15:00:50Z"
  },
  {
    "title": "Trump Doubles Down On Canada Trade War",
    "description": "US President Donald Trump announced massive new tariffs on Canadian steel and aluminum Tuesday, while threatening to \"shut down\" its auto industry and saying the best way to end the trade war was for Washington's ally to be absorbed into the United States.",
    "link": "https://www.ibtimes.com/trump-doubles-down-canada-trade-war-3765928",
    "timestamp": "2025-03-11T15:00:22Z"
  },
  {
    "title": "US job openings rose to 7.7 million in January, a sign the job market remains sturdy",
    "description": "U.S. job openings increased to 7.7 million in January, indicating a strong labor market as President Trump took office. Layoffs decreased and job resignations rose. Despite this, openings are down from previous peaks. Employers created fewer jobs in early 202…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-job-openings-rose-to-7-7-million-in-january-a-sign-the-job-market-remains-sturdy/articleshow/118896195.cms",
    "timestamp": "2025-03-11T15:00:11Z"
  },
  {
    "title": "Trump Plans to Spend Billions for Vouchers, Mostly for Religious Schools",
    "description": "The Trump administration plans to roll out a massive voucher program that will be available in every state. We know from the statistics of every voucher program that most vouchers will be claimed by students who never attended public schools. The voucher reci…",
    "link": "https://dianeravitch.net/2025/03/11/trump-plans-to-spend-billions-for-vouchers-mostly-for-religious-schools/",
    "timestamp": "2025-03-11T15:00:00Z"
  },
  {
    "title": "U.S.-Ukraine Officials Meet in High Stakes Talks In Saudi Arabia",
    "description": "Senior Ukrainian and US officials have begun a high-stakes meeting in Saudi Arabia, discussing how to end Russia's war against Ukraine amid recent tensions between Kyiv and Washington and intensifying fighting on the battlefield. Ukrainian delegation leader A…",
    "link": "https://oilprice.com/Geopolitics/International/US-Ukraine-Officials-Meet-in-High-Stakes-Talks-In-Saudi-Arabia.html",
    "timestamp": "2025-03-11T15:00:00Z"
  },
  {
    "title": "ABC News Daily: Is Trump dragging the US into recession?",
    "description": "Donald Trump will impose tariffs on Australian aluminium and steel imports this week, but in the lead up, the government was still hoping for an exemption. So, how should we be dealing with the US president? \n\nThe former prime minister Malcolm Turnbull, for o…",
    "link": "https://www.abc.net.au/listen/programs/abc-news-daily/is-trump-dragging-the-us-into-recession/104305570",
    "timestamp": "2025-03-11T15:00:00Z"
  },
  {
    "title": "Trump names Va. GOP chair Rich Anderson to Air Force post",
    "description": "Virginia Republican Party Chairman Rich Anderson is stepping down to become assistant secretary of the U.S. Air Force at the Pentagon, which he left 16 years ago to pursue local and state politics in Prince William County.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_810a54f8-fe7d-11ef-8bd2-571a6eb89638.html",
    "timestamp": "2025-03-11T15:00:00Z"
  },
  {
    "title": "Trump to double tariffs on Canadian steel and aluminum in response to electricity duties",
    "description": "President Donald Trump said Tuesday he will double the tariffs imposed on steel and aluminum imported from Canada, an escalation of the brewing economic feud between the U.S. and its largest trading partner.",
    "link": "https://biztoc.com/x/0a6afa0993ef7332",
    "timestamp": "2025-03-11T14:59:50Z"
  },
  {
    "title": "Trump raises Canadian steel, aluminum tariffs to 50% in retaliation for Ontario energy duties",
    "description": "President Donald Trump said Tuesday he has ordered his administration to raise tariffs on Canadian steel and aluminum imports by an additional 25%, bringing the total duties to 50%.\nThe new policy will go into effect Wednesday morning, Trump said in a Truth S…",
    "link": "https://biztoc.com/x/ef47e470dd6a45d4",
    "timestamp": "2025-03-11T14:59:49Z"
  },
  {
    "title": "Stock Market Today: Dow Jones, S&P 500 Continue To Slide As More Tariffs Imposed; Tesla, Nvidia Fall Again Live Coverage)",
    "description": "As President Donald Trump imposed more tariffs on Canada, major stock market indexes started to tumble again after Monday's selling bloodbath. But some Big Tech names, including Nvidia (NVDA), Tesla (TSLA) and Palantir Technologies (PLTR), were among those tr…",
    "link": "https://biztoc.com/x/ef59efbc96348c72",
    "timestamp": "2025-03-11T14:59:47Z"
  },
  {
    "title": "No Pain, No Gain? Trump Adopts New Zen-Like Approach to Stock Market Swings",
    "description": "In President Donald Trump's first term, he often defined his presidency by the stock market's performance, using it as a barometer of economic success. But as market volatility surges and investor concerns that the president's policies are careening the econo…",
    "link": "https://biztoc.com/x/488684c8c545d0e7",
    "timestamp": "2025-03-11T14:59:42Z"
  },
  {
    "title": "US job openings rose to 7.7 million in January, a sign Trump inherited a strong labor market",
    "description": "U.S. job openings rose at the start of the year, another sign the job market was solid when President Donald Trump returned to the White House",
    "link": "https://biztoc.com/x/c9282056cf70b457",
    "timestamp": "2025-03-11T14:59:29Z"
  },
  {
    "title": "Donald Trump's Approval Rating After 50 Days Compared To Joe Biden",
    "description": "Donald Trump's approval rating currently stands at 48 percent, lower than Joe Biden's at the same point in his presidency.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-50-days-compared-joe-biden-2042769",
    "timestamp": "2025-03-11T14:58:18Z"
  },
  {
    "title": "Trump says he will raise tariffs on Canada metals to 50%",
    "description": "WASHINGTON: President Donald Trump on Tuesday (Mar 11) doubled his planned tariff on all steel and aluminum products coming into the United States from Canada, bringing the total to 50 per cent, in response to the province of Ontario placing a 25 per cent tar…",
    "link": "https://www.channelnewsasia.com/world/trump-says-he-will-raise-tariffs-canada-metals-50-4993451",
    "timestamp": "2025-03-11T14:58:00Z"
  },
  {
    "title": "Bond yields just flashed the biggest recession warning since the election",
    "description": "A flight to safety amid extreme equity volatility has driven bond yields down, but investors are also eyeing lower yields as a recession comes into view.",
    "link": "https://www.businessinsider.com/recession-outlook-2025-bond-yields-trump-inflation-interest-rates-election-2025-3",
    "timestamp": "2025-03-11T14:56:46Z"
  },
  {
    "title": "‘If You’ll Let Me Answer’: Scott Jennings Spars With Panelists As He Defends Deporting ‘Radical’ College Activist",
    "description": "Scott Jennings sparred with his fellow panelists as he defended President Donald Trump's administration for revoking an anti-Israel activist's visa.",
    "link": "https://dailycaller.com/2025/03/11/cnn-scott-jennings-deportation-pro-palestine-columbia-university/",
    "timestamp": "2025-03-11T14:56:12Z"
  },
  {
    "title": "Trump Doubles Planned Tariffs On Canadian Steel And Aluminum To 50% As Trade War Intensifies",
    "description": "“The only thing that makes sense is for Canada to become our cherished Fifty First State,\" Trump posted on Tuesday.",
    "link": "https://www.huffpost.com/entry/trump-tariffs-canada-steel-aluminum_n_67d04d84e4b09796c9028bd6",
    "timestamp": "2025-03-11T14:55:24Z"
  },
  {
    "title": "Trump's lawsuit against Pulitzer Prize board members moves forward after judge denies temporary stay request",
    "description": "A judge ruled in favor of President Trump after the Pulitzer Prize board members requested a temporary stay in his defamation lawsuit against them, which was denied.",
    "link": "https://www.foxnews.com/media/trumps-lawsuit-against-pulitzer-prize-board-members-moves-forward-after-judge-denies-temporary-stay-request",
    "timestamp": "2025-03-11T14:55:04Z"
  },
  {
    "title": "US judge says Musk's DOGE must release records on operations run in 'secrecy' (Nate Raymond/Reuters)",
    "description": "Nate Raymond / Reuters:\nUS judge says Musk's DOGE must release records on operations run in ‘secrecy’  —  A federal judge on Monday ordered the government-downsizing team created by U.S. President Donald Trump and spearheaded by billionaire Elon Musk to make …",
    "link": "https://www.memeorandum.com/250311/p51",
    "timestamp": "2025-03-11T14:55:00Z"
  },
  {
    "title": "Costco CFO says 50 cent wage increase poses expense ‘headwind’",
    "description": "CFO Gary Millerchip said Thursday that Costco will continue looking for ways to offset the expected impact of its new employee agreement on SG&A.",
    "link": "https://www.cfodive.com/news/costco-raises-minimum-hourly-wage-20-compensation/742075/",
    "timestamp": "2025-03-11T14:55:00Z"
  },
  {
    "title": "US hasn't determined who was behind attack that caused outage on Trump adviser Musk's social site X",
    "description": "U.S. officials have not determined who was behind an apparent cyber attack on the social media site X that limited access to the platform for thousands of users",
    "link": "https://abcnews.go.com/US/wireStory/us-determined-attack-caused-outage-trump-adviser-musks-119672793",
    "timestamp": "2025-03-11T14:54:27Z"
  },
  {
    "title": "US job openings rose to 7.7 million in January, a sign Trump inherited a strong labor market",
    "description": "U.S. job openings rose at the start of the year, another sign the job market was solid when President Donald Trump returned to the White House",
    "link": "https://abcnews.go.com/Business/wireStory/us-job-openings-rose-77-million-january-sign-119670216",
    "timestamp": "2025-03-11T14:54:20Z"
  },
  {
    "title": "No Pain, No Gain? Trump Adopts New Zen-Like Approach to Stock Market Swings",
    "description": "Wall Street—long accustomed to Trump's market-friendly rhetoric—is being told by the president to embrace volatility as a long-term strategy.",
    "link": "https://www.newsweek.com/stock-market-volatility-recession-donald-trump-2042507",
    "timestamp": "2025-03-11T14:54:13Z"
  },
  {
    "title": "Donald Trump’s administration investigating 60 colleges, universities in US over antisemitism claims",
    "description": "The US Department of Education's Office for Civil Rights (OCR) on Monday sent letters to 60 educational institutions, including Stanford University, Harvard University and Columbia University, stating that they were being investigated for alleged violations r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-administration-investigating-60-colleges-universities-in-us-over-antisemitism-claims/articleshow/118895952.cms",
    "timestamp": "2025-03-11T14:54:05Z"
  },
  {
    "title": "Date set for Eagles' visit to White House to celebrate Super Bowl victory",
    "description": "The Eagles will visit the White House on April 28 to celebrate their Super Bowl win, the White House press secretary announced.",
    "link": "https://www.nbcsportsphiladelphia.com/nfl/philadelphia-eagles/visit-white-house-eagles-april-28-donald-trump/653835/?partner=yahoo",
    "timestamp": "2025-03-11T14:54:04Z"
  },
  {
    "title": "Trump escalates trade war with Canada by doubling tariffs on steel and aluminium",
    "description": "Donald Trump has said he will double his planned tariffs on Canadian steel and aluminium from 25% to 50%.",
    "link": "https://news.sky.com/story/donald-trump-escalates-trade-war-with-canada-by-doubling-tariffs-on-steel-and-aluminium-13326385",
    "timestamp": "2025-03-11T14:54:00Z"
  },
  {
    "title": "Trump climbs down from threat to double steel and aluminium tariffs on Canada",
    "description": "Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%.",
    "link": "https://news.sky.com/story/donald-trump-climbs-down-from-threat-to-escalate-trade-war-with-canada-by-doubling-tariffs-on-steel-and-aluminium-13326385",
    "timestamp": "2025-03-11T14:54:00Z"
  },
  {
    "title": "All is not well in White House? Elon Musk calls Senator Mark Kelly a 'traitor', ex-NASA astronaut hits back",
    "description": "Elon Musk has taken a jibe at Senator Mark Kelly over the latter's visit to Ukraine.",
    "link": "https://economictimes.indiatimes.com/news/international/us/all-is-not-well-in-white-house-elon-musk-calls-senator-mark-kelly-a-traitor-ex-nasa-astronaut-hits-back/articleshow/118895828.cms",
    "timestamp": "2025-03-11T14:53:06Z"
  },
  {
    "title": "Trump orders massive tariff hike and announces national emergency as Canada row escalates",
    "description": "President Donald Trump announced on Truth Social Tuesday that he is ordering an even greater escalation of tariffs against Canada, with a 25 to 50 percent tax on steel and aluminum imports from that country, effective Wednesday.This comes in retaliation to th…",
    "link": "https://www.rawstory.com/trump-canada-tariff-fight/",
    "timestamp": "2025-03-11T14:52:37Z"
  }
]