[
  {
    "title": "At least two children killed in shooting at a U.S. Catholic school",
    "description": "Washington, Aug 28: At least two children were killed in a shooting at a Catholic school in the United States […]\nThe post At least two children killed in shooting at a U.S. Catholic school appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/28/at-least-two-children-killed-in-shooting-at-a-u-s-catholic-school/",
    "timestamp": "2025-08-28T09:15:00Z"
  },
  {
    "title": "Minneapolis mayor condemns ‘hate’ being directed against trans community following school shooting",
    "description": "The mayor of Minneapolis has urged ‘humanity’ after two children were killed and 17 people injured in a shooting by a gunman, since identified as a possibly trans individual named Robin Westman, opened fire on a Catholic school. Robin Westman, 23, opened fire…",
    "link": "https://www.thepinknews.com/2025/08/28/robin-westman-trans-minneapolis-school-shooting/",
    "timestamp": "2025-08-28T09:14:18Z"
  },
  {
    "title": "‘Fraud, waste and abuse’: US healthcare caught in the crossfire of a political narrative",
    "description": "Cuts to Medicare and Medicaid may harm vulnerable populations that depend on government-funded care. Proponents of such cuts often frame them in a different way.",
    "link": "https://theconversation.com/fraud-waste-and-abuse-us-healthcare-caught-in-the-crossfire-of-a-political-narrative-263856",
    "timestamp": "2025-08-28T09:13:06Z"
  },
  {
    "title": "Battenfeld: Explicit sex survey outrages Burlington parent of 13-year-old",
    "description": "Battenfeld: Burlington parent Adrianne Simeone was surprised when her then 13-year-old middle school son told her he just answered a 45-minute survey about sex, drug use and alcohol use because she had opted out.",
    "link": "https://www.bostonherald.com/2025/08/28/battenfeld-explicit-sex-survey-outrages-burlington-parent-of-13-year-old/",
    "timestamp": "2025-08-28T09:12:25Z"
  },
  {
    "title": "A look at the travels of North Korea's Kim Jong Un, who visits China next week",
    "description": "North Korean leader Kim Jong Un will make his first visit to China in six years to attend a military parade next week",
    "link": "https://abcnews.go.com/International/wireStory/travels-north-koreas-kim-jong-visits-china-week-125050331",
    "timestamp": "2025-08-28T09:11:26Z"
  },
  {
    "title": "Japan's trade envoy postpones US trip as Tokyo wants faster action on tariffs deal",
    "description": "Japan’s top trade negotiator has abruptly canceled a trip to Washington aimed at issuing a joint statement on a tariffs deal with the Trump administration",
    "link": "https://abcnews.go.com/International/wireStory/japans-chief-trade-envoy-postpones-us-trip-tokyo-125050333",
    "timestamp": "2025-08-28T09:10:07Z"
  },
  {
    "title": "Trump Has A Wild 2 A.M. Freakout Over ‘Very Disrespectful’ Governor",
    "description": "The president launched a new attack on Maryland Gov. Wes Moore in the middle of the night.",
    "link": "https://www.huffpost.com/entry/trump-wes-moore-very-disrespectful_n_68b00c22e4b0d635adb403bb",
    "timestamp": "2025-08-28T09:06:41Z"
  },
  {
    "title": "Is Nuclear Disarmament on Cards For Russia, China, North Korea?",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said he had talked about denuclearization with Russian President Vladimir Putin, saying the Kremlin chief is \"willing to do it\" and suggested China could follow suit.\nIt's not the first …",
    "link": "https://biztoc.com/x/e9ab5d0f7f96fafd",
    "timestamp": "2025-08-28T09:03:40Z"
  },
  {
    "title": "Janet Yellen Warns Of 'Catastrophic' Consequences As Trump Fires Fed's Lisa Cook: 'Higher inflation, Volatile Growth...Weakened Currencies'",
    "description": "Janet Yellen, the former chair of the Federal Reserve, has issued a stark warning about the potential fallout from President Donald Trump’s recent attempt to dismiss Fed Governor Lisa Cook.\nYellen Warns Trump Move Threatens Fed Independence, Dollar\nIn a recen…",
    "link": "https://biztoc.com/x/2a96a2b86fff23dd",
    "timestamp": "2025-08-28T09:03:31Z"
  },
  {
    "title": "ICE has arrested over 300 people in Rhode Island. Here's the breakdown of who they are.",
    "description": "Since Trump’s inauguration through July 29, U.S. Immigration Customs Enforcement has arrested 343 undocumented immigrants in Rhode Island.",
    "link": "https://www.providencejournal.com/story/news/crime/2025/08/28/how-many-immigrants-has-ice-arrested-in-ri-with-criminal-convictions/85845507007/",
    "timestamp": "2025-08-28T09:00:55Z"
  },
  {
    "title": "Why Democrats’ desperate MAGA cosplay will flop",
    "description": "Gavin Newsom and Jasmine Crockett adopt Trump-style theatrics and profanity in failed attempt to mimic MAGA energy for 2028 presidential campaign.",
    "link": "https://www.foxnews.com/opinion/why-democrats-desperate-maga-cosplay-flop",
    "timestamp": "2025-08-28T09:00:43Z"
  },
  {
    "title": "MORNING GLORY: President Trump and the Posse Comitatus Act",
    "description": "The Posse Comitatus Act of 1878 restricts military use in civilian law enforcement, originating from Reconstruction era politics and rarely prosecuted since passage.",
    "link": "https://www.foxnews.com/opinion/morning-glory-president-trump-posse-comitatus-act",
    "timestamp": "2025-08-28T09:00:33Z"
  },
  {
    "title": "Trump At Bitcoin Asia 2025? Hong Kong Officials Say ‘No Thanks’",
    "description": "Hong Kong’s Bitcoin conference has become a test of politics and optics rather than just a meeting for crypto fans. Related Reading: UK Listing? Not For Bitpanda—Liquidity Concerns Derail Plans Officials Drop Out After Speaker Confirmation According to report…",
    "link": "https://bitcoinist.com/trump-at-bitcoin-asia-2025-hong-kong-officials-say-no-thanks/",
    "timestamp": "2025-08-28T09:00:19Z"
  },
  {
    "title": "Is Amtrak the End of the Line for US Public Transit?",
    "description": "Julian Epp\n\n\n\nThe railroad once represented the American dream of expansion—and exploitation. But is train travel becoming a thing of the past?\r\n\n\r\n\n\nThe post Is Amtrak the End of the Line for US Public Transit? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/amtrak-public-transit/",
    "timestamp": "2025-08-28T09:00:02Z"
  },
  {
    "title": "Is Nuclear Disarmament on Cards For Russia, China, North Korea?",
    "description": "\"We have to stop nuclear weapons,\" President Donald Trump said earlier this week.",
    "link": "https://www.newsweek.com/nuclear-disarmament-donald-trump-russia-north-korea-2119271",
    "timestamp": "2025-08-28T09:00:01Z"
  },
  {
    "title": "No, the White House Is Not Getting a 90,000-Foot Extension",
    "description": "Kate Wagner\n\n\n\nBut Trump’s doomed proposal does give us a revealing glimpse into his state of mind.\r\n\n\r\n\n\nThe post No, the White House Is Not Getting a 90,000-Foot Extension appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=568563",
    "timestamp": "2025-08-28T09:00:00Z"
  },
  {
    "title": "Zohran Mamdani Is Winning the Battle. Here’s How He Can Win the War.",
    "description": "Eric Blanc, Emily Lemmerman, Wen Zhuang\n\n\n\nWinning in November isn’t enough. A Mayor Mamdani will need a mass movement behind him to overcome an establishment that wants to crush him.\r\n\n\r\n\n\nThe post Zohran Mamdani Is Winning the Battle. Here’s How He Can Win …",
    "link": "https://www.thenation.com/?post_type=article&p=568553",
    "timestamp": "2025-08-28T09:00:00Z"
  },
  {
    "title": "Politicians keep using songs on social media. What if an artist doesn't like it?",
    "description": "Having a song go viral is usually good news for an artist. But as politicians become more social media savvy and jump in on viral trends, how can musicians respond if they don't like the way a party or administration uses their song?",
    "link": "https://www.npr.org/2025/08/28/nx-s1-5506215/politicians-using-music-memes-issues",
    "timestamp": "2025-08-28T09:00:00Z"
  },
  {
    "title": "Lisa Cook's path to Fed governor prepared her for a fight in the spotlight",
    "description": "Cook weathered racist attacks as a child and became a pioneer as a Black woman economist. Her latest fight is to keep her position on the Board of Governors at the Federal Reserve.",
    "link": "https://www.nbcnews.com/news/nbcblk/lisa-cook-bio-federal-reserve-governor-trump-mortgage-fraud-rcna227565",
    "timestamp": "2025-08-28T09:00:00Z"
  },
  {
    "title": "They Saw Israel Kill Their Colleagues. But They Refuse to Be Silenced.",
    "description": "Ali Skaik\n\n\n\nThe strike that killed Anas al-Sharif nearly claimed the lives of these other reporters—including al-Sharif’s cousin.\r\n\n\r\n\n\nThe post They Saw Israel Kill Their Colleagues. But They Refuse to Be Silenced. appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=568580",
    "timestamp": "2025-08-28T09:00:00Z"
  },
  {
    "title": "PM Modi's balancing act: Wooing Japan, resetting China ties, and navigating Trump's tariffs",
    "description": "Prime Minister Narendra Modi is embarking on a high-stakes Asia tour covering Japan, China, and Russia as India deals with the U.S. President Donald Trump’s steep tariffs. Japan will be the centrepiece, with new investments and tech partnerships in focus. Mod…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modis-balancing-act-wooing-japan-resetting-china-ties-and-navigating-trumps-tariffs/articleshow/123559830.cms",
    "timestamp": "2025-08-28T08:59:34Z"
  },
  {
    "title": "High Potential Season 2 in The Daily LITG, 28th of August 2025",
    "description": "High Potential Season 2 was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past six years. Founded sixteen years ago and steeped in a history of comic b…",
    "link": "https://bleedingcool.com/tv/high-potential-season-2-in-the-daily-litg-28th-of-august-2025/",
    "timestamp": "2025-08-28T08:58:04Z"
  },
  {
    "title": "Swiss Economy Set To Slow Due To US Tariffs",
    "description": "The Swiss economy will likely grow more slowly than previously expected next year due to the massive import tariffs imposed by US President Donald Trump, the economy ministry said Thursday.",
    "link": "https://www.ibtimes.com/swiss-economy-set-slow-due-us-tariffs-3781844",
    "timestamp": "2025-08-28T08:57:07Z"
  },
  {
    "title": "Amid Trump tariff turmoil, why's the Indian consumer upbeat?",
    "description": "Despite potential economic headwinds from increased US tariffs, India's consumer market is projected to remain strong through 2025 and 2026. Robust household spending is expected, driven by low inflation, rising incomes, and a resilient labor market. Improvin…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/amid-trump-tariff-turmoil-whys-the-indian-consumer-upbeat/articleshow/123558921.cms",
    "timestamp": "2025-08-28T08:55:34Z"
  },
  {
    "title": "Trump Admin Wants to Own Patents of New Inventions",
    "description": "Commerce Secretary Howard Lutnick has proposed doing a deal with universities that own patents in return for funding.",
    "link": "https://www.newsweek.com/trump-administration-patent-new-invention-2120206",
    "timestamp": "2025-08-28T08:55:08Z"
  },
  {
    "title": "The Greens will need more than Elizabeth May to survive",
    "description": "For all May’s personal successes, the Green Party failed to take off, even when climate change was top of mind for voters. The most MPs the party has managed to elected was three in 2019.",
    "link": "https://www.nationalobserver.com/2025/08/26/opinion/green-party-elizabeth-may-survival",
    "timestamp": "2025-08-28T08:55:03Z"
  },
  {
    "title": "US mines are literally throwing away critical minerals",
    "description": "There’s enough lithium in one year of US mine waste to power 10 million electric vehicles, according to a study published in the journal Science.",
    "link": "https://www.nationalobserver.com/2025/08/28/news/us-mines-waste-critical-minerals",
    "timestamp": "2025-08-28T08:55:02Z"
  },
  {
    "title": "Trump's challenge to Fed independence holds global risk",
    "description": "President Donald Trump's escalating attacks on the US Federal Reserve could have substantial and global knock-on effects on the financial markets and the real economy, ECB policymaker Olli Rehn said in a speech today.",
    "link": "https://www.rte.ie/news/business/2025/0828/1530577-trumps-challenge-to-fed-independence-holds-global-risk/",
    "timestamp": "2025-08-28T08:53:02Z"
  },
  {
    "title": "EU Exchanges Russian Gas for American & Norwegian Supplies",
    "description": "The European Union has signed a deal to import $750 billion worth of liquefied natural gas, oil and nuclear fuels from the United States by 2028. The agreement, announced on July 27 by U.S. President Donald Trump and EU Commission President Ursula von der Ley…",
    "link": "https://biztoc.com/x/6516f199b5766aba",
    "timestamp": "2025-08-28T08:52:21Z"
  },
  {
    "title": "Exclusive - Netanyahu: Western Leaders Have Not Shown Trump’s Strength Against Terror",
    "description": "Israeli Prime Minister Benjamin Netanyahu observed Wednesday in an exclusive interview with Breitbart News that western leaders had not shown President Donald Trump's strength against terror.\nThe post Exclusive – Netanyahu: Western Leaders Have Not Shown Trum…",
    "link": "https://www.breitbart.com/middle-east/2025/08/28/exclusive-netanyahu-western-leaders-have-not-shown-trumps-strength-against-terror/",
    "timestamp": "2025-08-28T08:50:13Z"
  },
  {
    "title": "Davey: I Prayed Over Boycotting Trump State Banquet",
    "description": "Ed Davey has declared he’s boycotting President Trump’s state banquet in mid-September, saying it’s the “only way to send a message to both Donald Trump and Keir Starmer that they cannot close their eyes and wish away the humanitarian crisis in Gaza.[…] Read …",
    "link": "https://order-order.com/2025/08/28/davey-i-prayed-over-boycotting-trump-state-banquet/",
    "timestamp": "2025-08-28T08:45:39Z"
  },
  {
    "title": "Dalal Street slumps as 50% tariff shock triggers broad-based selloff; Realty & IT stocks lead the decline",
    "description": "Among the Sensex firms, Hero Motocorp traded with over 1% gains, Asian Paints, Titan, Bajaj Finance and Adani Enterprises followed with marginal increase",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/top-gainers-losers-today-aug-28-sensex-nifty-50-drag-as-broad-based-selloff-hit-dalal-street-amid-50-tariff-shock-realty-it-stocks-drag-the-most/article69983875.ece",
    "timestamp": "2025-08-28T08:32:53Z"
  },
  {
    "title": "US reaffirms Greenland's right to self-determination amid political sway allegations",
    "description": "COPENHAGEN: The United States' top diplomat in Denmark has reaffirmed Greenland's right to determine its own future, following Danish intelligence reports alleging that private US citizens attempted to sway political sentiment in the Arctic territory. Chargé …",
    "link": "https://www.channelnewsasia.com/world/us-greenland-reaffirm-self-determination-right-denmark-5319491",
    "timestamp": "2025-08-28T08:31:11Z"
  },
  {
    "title": "Sudipto Mundle: The best way forward for India’s trade policy amid Trump’s tariffs",
    "description": "New Delhi mustn’t get provoked into knee-jerk responses and should retain its focus on strategic priorities that’ll outlast the US president. We have greater geopolitical space than many developed countries.",
    "link": "https://www.livemint.com/opinion/online-views/us-tariffs-india-exports-donald-trump-indo-us-relations-wto-rcep-cptpp-free-trade-agreements-brics-indo-pacific-strategy-11756345929624.html",
    "timestamp": "2025-08-28T08:30:03Z"
  },
  {
    "title": "'One Big Beautiful Bill': How cuts will affect healthcare in 5 areas",
    "description": "",
    "link": "https://www.medicalnewstoday.com/articles/how-will-older-adults-affected-trump-one-big-beautiful-bill-medicare-medicaid",
    "timestamp": "2025-08-28T08:28:00Z"
  },
  {
    "title": "Undermining Fed Independence Creates Big Risks, ECB’s Rehn Warns",
    "description": "The autonomy of the Federal Reserve is being tested for the first time in decades, leading to “significant” risks for markets and the economy, according to European Central Bank Governing Council member Olli Rehn.",
    "link": "https://financialpost.com/pmn/business-pmn/undermining-fed-independence-creates-big-risks-ecbs-rehn-warns",
    "timestamp": "2025-08-28T08:24:13Z"
  },
  {
    "title": "Japan’s chief trade envoy postpones US trip as Tokyo calls for faster action on its tariffs deal",
    "description": "TOKYO (AP) — Japan’s top trade negotiator abruptly canceled a trip to Washington aimed at issuing a joint statement on a tariffs deal with the Trump administration, as a top government spokesman urged the U.S. side to speed up implementation of the agreement.…",
    "link": "https://financialpost.com/pmn/japans-chief-trade-envoy-postpones-us-trip-as-tokyo-calls-for-faster-action-on-its-tariffs-deal",
    "timestamp": "2025-08-28T08:22:19Z"
  },
  {
    "title": "Minneapolis Shooting Suspect Pinned Jesus Picture on Target, Talked to 'Demon' in a Mirror",
    "description": "The alleged Minneapolis shooter displayed his hatred for Christianity in multiple ways, which included pinning a picture of Jesus on a body target.\nThe post Minneapolis Shooting Suspect Pinned Jesus Picture on Target, Talked to ‘Demon’ in a Mirror appeared fi…",
    "link": "https://www.breitbart.com/politics/2025/08/28/minneapolis-shooter-pinned-jesus-picture-on-target-talked-to-demon-in-a-mirror/",
    "timestamp": "2025-08-28T08:18:48Z"
  },
  {
    "title": "Cracker Barrel Brings Back Old Logo; Stock Moves Higher After Pushback Slump",
    "description": "Key Takeaways\n- Cracker Barrel Old Country Store went back to itsold logo after angry customer reaction, and shares bounced back in premarket trading.\n- The throwback restaurant chain tried a more modern design for its logo.\n- President Donald Trump was among…",
    "link": "https://biztoc.com/x/52face88d9ce38bd",
    "timestamp": "2025-08-28T08:18:33Z"
  },
  {
    "title": "Mass Russian drone and missile attack kills 12 in Ukraine",
    "description": "President Volodymyr Zelenskyy says the attack, which also killed three children, shows the world Russia's answer to diplomacy amid efforts by US President Donald Trump to end the war.",
    "link": "https://www.abc.net.au/news/2025-08-28/russia-missile-strike-ukraine/105709600",
    "timestamp": "2025-08-28T08:11:34Z"
  },
  {
    "title": "White House Tells Denmark to 'Calm Down' Over Greenland",
    "description": "The White House is said to have sent the response after a media report alleged American nationals are trying to run influencing operations",
    "link": "https://www.newsweek.com/donald-trump-greenland-denmark-white-house-2120621",
    "timestamp": "2025-08-28T08:10:09Z"
  },
  {
    "title": "Ukraine updates: EU office in Kyiv damaged in Russian attack",
    "description": "The EU condemned a \"deliberate\" Russian attack after the building of the EU delegation in Kyiv was hit. Ukraine said at least 10 people were killed in overnight Russiak strikes on the capital. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-eu-office-in-kyiv-damaged-in-russian-attack/live-73789764",
    "timestamp": "2025-08-28T08:10:00Z"
  },
  {
    "title": "Ukraine updates: EU delegation damaged in Russian attack",
    "description": "The building where EU Delegation to Ukraine staff work was also damaged in Russia's massive strike on Kyiv. President of the European Council Antonio Costa made it clear that the EU will not be intimidated. DW has more.",
    "link": "https://www.dw.com/en/ukraine-updates-eu-delegation-damaged-in-russian-attack/live-73789764",
    "timestamp": "2025-08-28T08:10:00Z"
  },
  {
    "title": "‘Like losing a job’: S’pore small business owners hit by axed US tariff exemption on low-value goods",
    "description": "With effect from Aug 29, all items with commercial value shipped to the US will be subject to duties and taxes. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/like-losing-a-job-small-business-owners-in-sg-hit-by-axed-us-tariff-exemption-on-low-value-goods",
    "timestamp": "2025-08-28T08:07:42Z"
  },
  {
    "title": "‘Massive’ Russian missile and drone attack on Kyiv kills at least 12 people",
    "description": "Zelenskiy says attacks show Russia has no intention of negotiating an end to war",
    "link": "https://www.irishtimes.com/world/europe/2025/08/28/russia-ukraine-war-latest/",
    "timestamp": "2025-08-28T08:05:08Z"
  },
  {
    "title": "US reaffirms Greenland's right to self-determination amid political sway allegations",
    "description": "COPENHAGEN (Reuters) -The United States' top diplomat in Denmark has reaffirmed Greenland's right to determine its own future, following Danish intelligence reports alleging that private U.S. citizens attempted to sway political sentiment in the Arctic territ…",
    "link": "https://www.thestar.com.my/news/world/2025/08/28/us-reaffirms-greenland039s-right-to-self-determination-amid-political-sway-allegations",
    "timestamp": "2025-08-28T08:05:00Z"
  },
  {
    "title": "Secret Xi Letter Revived India Ties After Trump Tariff Barrage",
    "description": "Back in March, when US President Donald Trump was ratcheting up his trade war with China, Beijing began a steady and quiet outreach to India. President Xi Jinping wrote a letter to Indian counterpart Droupadi Murmu — who is primarily a figurehead — to test th…",
    "link": "https://www.ndtvprofit.com/business/secret-xi-letter-revived-india-ties-after-trump-tariff-barrage",
    "timestamp": "2025-08-28T08:04:21Z"
  },
  {
    "title": "Thailand’s Ex-PM Endorses Push to Build Regional Crypto Hub",
    "description": "Thaksin met with global digital asset firms in Bangkok to discuss a sovereign reserve and Thailand’s role in regional crypto finance.",
    "link": "https://decrypt.co/337155/thailands-ex-pm-endorses-push-to-build-regional-crypto-hub",
    "timestamp": "2025-08-28T08:02:31Z"
  },
  {
    "title": "US reaffirms Greenland's right to self-determination amid political sway allegations",
    "description": "COPENHAGEN (Reuters) -The United States' top diplomat in Denmark has reaffirmed Greenland's right to determine its own future, following Danish intelligence ...",
    "link": "https://www.yahoo.com/news/articles/us-reaffirms-greenlands-self-determination-080122048.html",
    "timestamp": "2025-08-28T08:01:22Z"
  },
  {
    "title": "Urban Outfitters says Trump closing the de minimis loophole won't hurt it — but it'll hit competitors like Shein",
    "description": "Urban Outfitters' chiefs said the closure of the loophole would lower sales of competitors like Shein, which will \"only help\" their company.",
    "link": "https://www.businessinsider.com/urban-outfitters-de-minimis-closure-will-hurt-shein-not-it-2025-8",
    "timestamp": "2025-08-28T08:00:54Z"
  },
  {
    "title": "45 Canadian nonfiction books to read this fall",
    "description": "Check out these Canadian nonfiction titles coming out in fall 2025.",
    "link": "https://www.cbc.ca/books/45-canadian-nonfiction-books-to-read-this-fall-1.7579955",
    "timestamp": "2025-08-28T08:00:00Z"
  },
  {
    "title": "Gold Steady as Traders Take Stock Before Key US Inflation Report",
    "description": "Gold steadied after a two-day gain as investors waited for a US inflation report that’ll shed light on the path for interest rates, while assessing continued threats to the Federal Reserve’s independence.",
    "link": "https://financialpost.com/pmn/business-pmn/gold-steady-as-traders-take-stock-before-key-us-inflation-report",
    "timestamp": "2025-08-28T07:58:50Z"
  },
  {
    "title": "Lucas: Tompkins should have played the anti-Trump card",
    "description": "One of the \"mistakes” Tompkins may have made was not using Trump as a distraction, the way Wu,  Healey and Attorney General Andrea Campbell are doing.",
    "link": "https://www.bostonherald.com/2025/08/28/lucas-tompkins-should-have-played-the-anti-trump-card/",
    "timestamp": "2025-08-28T07:57:43Z"
  },
  {
    "title": "US Tariffs Against India: Who Really Holds the Cards?",
    "description": "Washington was sure it could sideline India with economic pressure, but experts and insiders say: India isn’t bending — it’s winning. Sputnik explains why.",
    "link": "https://sputnikglobe.com/20250828/us-tariffs-against-india-who-really-holds-the-cards-1122679955.html",
    "timestamp": "2025-08-28T07:57:24Z"
  },
  {
    "title": "Denmark summons US diplomat over reports of US conducting covert missions in Greenland",
    "description": "At least three US officials close to Trump have been noticed in Greenland’s capital Nuuk.",
    "link": "https://www.thejournal.ie/denmark-summons-us-diplomat-over-reports-of-us-conducting-covert-missions-in-greenland-6801268-Aug2025/",
    "timestamp": "2025-08-28T07:57:21Z"
  },
  {
    "title": "Trump Scores Big NATO Win",
    "description": "The NATO alliance just published fresh data.",
    "link": "https://www.newsweek.com/trump-nato-defense-spending-target-2120624",
    "timestamp": "2025-08-28T07:54:49Z"
  },
  {
    "title": "Pranksters Troll Trump Supporters By Exposing MAGA Hypocrisy Right To Their Faces",
    "description": "The Good Liars took a closer look at how Trump supporters have used the flag.",
    "link": "https://www.huffpost.com/entry/trump-pranksters-flag-burning_n_68afef83e4b0bbcc3f8e1adc",
    "timestamp": "2025-08-28T07:54:46Z"
  },
  {
    "title": "American Bitcoin aims to start trading in September",
    "description": "American Bitcoin, the bitcoin miner backed by US President Donald Trump's two sons, has locked in crypto and traditional investors to back an all-stock merger that will allow the firm to soon start trading on the Nasdaq, the company's largest investor said.",
    "link": "https://www.rte.ie/news/business/2025/0828/1530570-american-bitcoin-aims-to-start-trading-in-september/",
    "timestamp": "2025-08-28T07:46:35Z"
  },
  {
    "title": "Gold Steady as Traders Take Stock Before Key US Inflation Report",
    "description": "Bullion held just below $3,400 an ounce, with traders looking ahead to Friday’s US personal consumption report — the Fed’s preferred inflation gauge.  Swaps ...",
    "link": "https://finance.yahoo.com/news/gold-steady-traders-stock-key-074008719.html",
    "timestamp": "2025-08-28T07:40:08Z"
  },
  {
    "title": "Rheinmetall opens mega-plant in northern Germany as Europe rearms",
    "description": "German weapons-maker Rheinmetall opened Europe's largest munitions plant on Wednesday, a move hailed as boosting Western defences by NATO chief Mark Rutte.",
    "link": "https://www.thelocal.de/20250828/rheinmetall-opens-mega-plant-in-northern-germany-as-europe-rearms",
    "timestamp": "2025-08-28T07:36:36Z"
  },
  {
    "title": "Dwayne 'The Rock' Johnson Leads Kamala Harris as 2028 Democratic Presidential Hopeful on Polymarket",
    "description": "Traders on Polymarket see a 7% chance of Johnson winning the bid.",
    "link": "https://www.coindesk.com/markets/2025/08/28/dwayne-the-rock-johnson-leads-kamala-harris-as-2028-democratic-presidential-hopeful-on-polymarket",
    "timestamp": "2025-08-28T07:33:31Z"
  },
  {
    "title": "Two children among dead in Russian drone attack on Kyiv, dozens injured",
    "description": "A mass Russian drone and missile attack on Ukraine's capital, including a rare strike in the center of the city, early Thursday killed at least 10 people and wounded 48.",
    "link": "https://www.npr.org/2025/08/28/nx-s1-5520503/russian-drone-attack-kills-10-ukraine-kyiv",
    "timestamp": "2025-08-28T07:33:00Z"
  },
  {
    "title": "Four children among dead in Russian drone attack on Kyiv, dozens injured",
    "description": "Russia bombarded the Ukrainian capital with drones and missiles early Thursday, including a rare strike in the city center, killing at least 15 people and wounding 48, local authorities said.",
    "link": "https://www.npr.org/2025/08/28/nx-s1-5520503/russian-drone-attack-kills-ukraine-kyiv",
    "timestamp": "2025-08-28T07:33:00Z"
  },
  {
    "title": "Moneyball for Hotels, Penn Station’s Overhaul and Huge Labor Day Air Travel",
    "description": "Today's podcast looks at a different approach to managing hotels, a rebuild of the U.S. key rail center, and prospects of a record travel weekend.",
    "link": "http://skift.com/2025/08/28/moneyball-for-hotels-penn-stations-overhaul-and-huge-labor-day-air-travel/",
    "timestamp": "2025-08-28T07:32:55Z"
  },
  {
    "title": "If you thought China's Salt Typhoon was booted off critical networks, think again",
    "description": "13 governments sound the alarm about ongoing unpleasantness China's Salt Typhoon cyberspies continue their years-long hacking campaign targeting critical industries around the world, according to a joint security alert from cyber and law enforcement agencies …",
    "link": "https://www.theregister.com/2025/08/28/china_salt_typhoon_alert/",
    "timestamp": "2025-08-28T07:32:12Z"
  },
  {
    "title": "Will Trump’s India tariffs hurt American consumers?",
    "description": "Washington’s high levies could spiral into increased costs for consumers Read Full Article at RT.com",
    "link": "https://www.rt.com/india/623613-will-trumps-india-tariffs-hurt/",
    "timestamp": "2025-08-28T07:30:32Z"
  },
  {
    "title": "Trumpian Tariffs Rerun the Failed Strategy of Import Substitution Industrialization",
    "description": "Trump's use of broad-based tariffs to promote industrialization have repeatedly failed. There's no reason to expect different results now.",
    "link": "https://www.nakedcapitalism.com/2025/08/trumpian-tariffs-rerun-the-failed-strategy-of-import-substitution-industrialization.html",
    "timestamp": "2025-08-28T07:25:09Z"
  },
  {
    "title": "Russian Jet Intercepts US Plane Near Ukraine: Video",
    "description": "The U.S. Navy P-8A intercepted over the Black Sea is designed for anti-surface and anti-submarine warfare, as well as surveillance and reconnaissance.",
    "link": "https://www.newsweek.com/russian-jet-intercepts-us-plane-black-sea-ukraine-2120588",
    "timestamp": "2025-08-28T07:24:40Z"
  },
  {
    "title": "UN Security Council to vote on ending peacekeeping mission in Lebanon on Dec 31",
    "description": "UNIFIL was created to oversee the withdrawal of Israeli troops from southern Lebanon after Israel’s 1978 invasion.",
    "link": "https://indianexpress.com/article/world/unsc-vote-lebanon-peacekeeping-mission-end-dec-10215682/",
    "timestamp": "2025-08-28T07:21:34Z"
  },
  {
    "title": "Vance calls Oval Office blowup with Zelenskyy ‘useful’",
    "description": "The February dispute \"elucidated some of the real issues of disagreement,\" JD Vance argued — but now the Trump administration is \"pretty aligned with President Zelenskyy\" on working toward peace.",
    "link": "https://www.politico.eu/article/us-jd-vance-oval-office-blowup-volodymyr-zelenskyy-useful-ukraine-trump/",
    "timestamp": "2025-08-28T07:20:39Z"
  },
  {
    "title": "EU public skeptical of sending troops to Ukraine – WSJ",
    "description": "The sentiment stems from concerns that any deployment could put the military in harm’s way, the report says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623614-eu-public-skeptical-troops-ukraine/",
    "timestamp": "2025-08-28T07:19:26Z"
  },
  {
    "title": "Xi shows Trump who holds the cards by hosting Kim and Putin",
    "description": "The leaders of North Korea and Russia will attend China's military parade next week - a win for Xi.",
    "link": "https://www.bbc.com/news/articles/cx29z9g2kl2o",
    "timestamp": "2025-08-28T07:17:07Z"
  },
  {
    "title": "India should hit back at Trump with 100% tariff on America, says Arvind Kejriwal",
    "description": "Arvind Kejriwal criticized Prime Minister Narendra Modi's government for allegedly betraying Indian farmers by removing import duties on American cotton under pressure from the US. He argued that this decision would make American cotton cheaper, harming India…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/india-should-hit-back-at-trump-with-100-tariff-on-america-says-arvind-kejriwal/articleshow/123558611.cms",
    "timestamp": "2025-08-28T07:17:03Z"
  },
  {
    "title": "UK car sales to US rise following tariff deal",
    "description": "The increase comes after three months in a row of falling sales, according to industry data.",
    "link": "https://www.bbc.com/news/articles/cvgvyv0zzj4o",
    "timestamp": "2025-08-28T07:14:24Z"
  },
  {
    "title": "FBI investigates Minneapolis school shooting as anti-Catholic hate crime",
    "description": "Two children were killed and 17 people were injured at Annunciation Catholic School",
    "link": "https://www.irishtimes.com/world/us/2025/08/28/fbi-investigates-minneapolis-school-shooting-as-anti-catholic-hate-crime/",
    "timestamp": "2025-08-28T07:13:06Z"
  },
  {
    "title": "Tony Blair joins White House meeting on the future of Gaza",
    "description": "US special envoy Steve Witkoff said he believes that  before the end of this year”, there could be an end to Israel’s war on Gaza.",
    "link": "https://www.thejournal.ie/tony-blair-joins-white-house-meeting-on-the-future-of-gaza-6801239-Aug2025/",
    "timestamp": "2025-08-28T07:06:32Z"
  },
  {
    "title": "India-Pakistan missile race heats up, but China in crosshairs, too",
    "description": "South Asia's missile race is heating up. But India and Pakistan aren't only eyeing each other, say analysts.",
    "link": "https://www.aljazeera.com/news/2025/8/28/india-pakistan-missile-race-heats-up-but-china-in-crosshairs-too",
    "timestamp": "2025-08-28T06:59:51Z"
  },
  {
    "title": "Massive Russian attack kills at least 10 in Ukraine's capital as Trump's peace push stalls",
    "description": "Russia unleashed a massive overnight attack on the Ukrainian capital that killed at least 10 people and injured 38, local officials said early Thursday.",
    "link": "https://www.nbcnews.com/world/ukraine/russia-attacks-kyiv-ukraine-drones-missiles-trump-peace-putin-rcna227671",
    "timestamp": "2025-08-28T06:56:11Z"
  },
  {
    "title": "Robin Westman: Minneapolis school shooting suspect posted videos fixated on guns and violence",
    "description": "Suspect who killed two children appeared to know her target well and is believed to have attended school",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/live/2025/08/27/us/minneapolis-church-shooting/minneapolis-school-shooting-suspect-gunman",
    "timestamp": "2025-08-28T06:55:03Z"
  },
  {
    "title": "Trump's tariffs must be a wake-up call for India: Amitabh Kant",
    "description": "Former NITI Aayog CEO Amitabh Kant emphasizes India's need for strategic autonomy amidst global trade challenges and growth ambitions.",
    "link": "https://www.thehindubusinessline.com/news/trumps-tariffs-must-be-a-wake-up-call-for-india-amitabh-kant/article69983621.ece",
    "timestamp": "2025-08-28T06:53:36Z"
  },
  {
    "title": "China says Putin, Kim Jong Un to attend military parade",
    "description": "A military parade in Beijing to commemorate Japan's surrender in World War II will feature the attendance of Kim Jong Un of North Korea and Vladimir Putin of Russia, as confirmed by China. North Korean leader Kim Jong Un will travel to Beijing in early Septem…",
    "link": "https://www.dw.com/en/china-says-putin-kim-jong-un-to-attend-military-parade/a-73790593",
    "timestamp": "2025-08-28T06:51:00Z"
  },
  {
    "title": "Chief of US health agency fired, senior officials resign",
    "description": "US Centers for Disease Control and Prevention Director Susan Monarez has been fired, the White House said, less than a month after being sworn in, and four senior officials have resigned amid growing tensions over vaccine policies and public health directives.",
    "link": "https://www.rte.ie/news/us/2025/0828/1530554-us-cdc-susan-monarez/",
    "timestamp": "2025-08-28T06:48:18Z"
  },
  {
    "title": "How Trump-Modi friendship came undone, in five episodes",
    "description": "The much-touted friendship between Donald Trump and Narendra Modi reportedly soured over several missteps and misunderstandings. Key incidents included Trump's offer to mediate on Kashmir, a missed meeting during the 2024 US elections, and disagreements over …",
    "link": "https://economictimes.indiatimes.com/news/india/how-the-trump-modi-friendship-came-undone-in-five-episodes/articleshow/123558206.cms",
    "timestamp": "2025-08-28T06:48:00Z"
  },
  {
    "title": "The vilification of trans footballer Riley Dennis went international, she's now won in court",
    "description": "Transgender soccer player Rliey Dennis has won a court case over vilification against her that went international. Speaking exclusively to 7.30 she has detailed her trauma.",
    "link": "https://www.abc.net.au/news/2025-08-28/transgender-soccer-riley-dennis-versus-kirralie-smith-court/105694528",
    "timestamp": "2025-08-28T06:44:17Z"
  },
  {
    "title": "Trump holds Gaza meeting with Blair, Kushner",
    "description": "US President Donald Trump presided over a policy meeting on Israel's war in Gaza and post-war plans for the Palestinian territory, with input from former UK Prime Minister Tony Blair and Mr Trump's former Middle East envoy Jared Kushner, a senior White House …",
    "link": "https://www.rte.ie/news/2025/0828/1530549-trump-gaza-meeting/",
    "timestamp": "2025-08-28T06:40:08Z"
  },
  {
    "title": "Trump holds Gaza meeting with Blair, Kushner",
    "description": "US President Donald Trump presided over a policy meeting on Israel's war in Gaza and post-war plans for the territory, with input from Britain's former prime minister Tony Blair and Mr Trump's former Middle East envoy Jared Kushner, a White House official sai…",
    "link": "https://www.rte.ie/news/2025/0828/1530549-us-israel-gaza/",
    "timestamp": "2025-08-28T06:40:08Z"
  },
  {
    "title": "American Bitcoin, backed by Trump's sons, aims to start trading in September",
    "description": "HONG KONG (Reuters) -American Bitcoin, the bitcoin miner backed by U.S. President Donald Trump's two sons, has locked in crypto and traditional investors to ...",
    "link": "https://finance.yahoo.com/news/american-bitcoin-backed-trumps-sons-063405780.html",
    "timestamp": "2025-08-28T06:34:05Z"
  },
  {
    "title": "American Bitcoin, backed by Trump's sons, aims to start trading in September",
    "description": "HONG KONG :American Bitcoin, the bitcoin miner backed by U.S. President Donald Trump's two sons, has locked in crypto and traditional investors to back an all-stock merger that will allow the firm to soon start trading on the Nasdaq, the company's largest inv…",
    "link": "https://www.channelnewsasia.com/business/american-bitcoin-backed-trumps-sons-aims-start-trading-september-5319331",
    "timestamp": "2025-08-28T06:34:05Z"
  },
  {
    "title": "Suspected Minneapolis school shooter posted haunting video laughing and showing off guns before allegedly killing two students",
    "description": "Suspected shooter Robin Westman posted a video before allegedly killing two children and injuring 17 other people at a Catholic church",
    "link": "https://www.ladbible.com/news/us-news/robin-westman-minneapolis-church-shooting-suspect-302840-20250828",
    "timestamp": "2025-08-28T06:31:15Z"
  },
  {
    "title": "Trump moves to limit US stays of students, journalists",
    "description": "WASHINGTON: President Donald Trump's administration moved on Thursday (Aug 28) to impose stricter limits on how long foreign students and journalists can stay in the United States, the latest bid to tighten legal immigration in the country. Under a proposed c…",
    "link": "https://www.channelnewsasia.com/world/trump-moves-limit-us-stays-students-journalists-5319321",
    "timestamp": "2025-08-28T06:30:00Z"
  },
  {
    "title": "Trump seeks stricter limits on how long foreign students and journalists can stay in the US",
    "description": "The US has generally issued visas for the duration of a student’s educational programme or a journalist’s assignment, up to a max of 10 years.",
    "link": "https://www.thejournal.ie/trump-seeks-stricter-limits-on-how-long-foreign-students-and-journalists-can-stay-in-the-us-6801215-Aug2025/",
    "timestamp": "2025-08-28T06:28:04Z"
  }
]