[
  {
    "title": "Trump names Sergio Gor as new envoy to India",
    "description": "United States President Donald Trump announced on Friday that White House Director of Presidential Personnel Sergio Gor (pictured) will be the next US ambassador to India. In addition, Gor will also s...",
    "link": "https://biztoc.com/x/1f152b5c579c0b95",
    "timestamp": "2025-08-22T22:45:32Z"
  },
  {
    "title": "Analysis: SoftBank and Trump team up to boost Intel's foundry push, unlocking Arm chip manufacturing market",
    "description": "The Financial Times recently cited sources revealing that before Intel CEO Lip-Bu Tan visited the White House on August 11, 2025, to meet with President Donald Trump, a preliminary framework for SoftBank's equity investment in Intel had already been establish…",
    "link": "https://www.digitimes.com/news/a20250821PD232/intel-softbank-investment-arm-manufacturing.html",
    "timestamp": "2025-08-22T22:44:37Z"
  },
  {
    "title": "These Lawyers Are Trying To ‘Claw Back’ Civil Rights With This New Resource",
    "description": "Lawyers for Good Government launched a new resource hub on Tuesday tracking changes in state policies around access to gender-affirming care and constitutional protections in all 50 states and six territories.",
    "link": "https://www.huffpost.com/entry/pro-bono-attorneys-fight-trump-administration-attacks-on-transgender-rights-lgbtq_n_68a8db60e4b0371e6a9b1dcc",
    "timestamp": "2025-08-22T22:39:54Z"
  },
  {
    "title": "Trump Isn’t The Only Billionaire Winner From Ruling Wiping Out His $450 Million Fine",
    "description": "Los Angeles insurance billionaire Don Hankey came to Trump’s rescue last year, when he put up a $175 million bond for him. Now Hankey gets back his cash plus premiums.",
    "link": "https://www.forbes.com/sites/thomasgallagher/2025/08/22/trump-isnt-only-billionaire-don-hankey-winner-from-ruling-wiping-out-his-450-million-fine/",
    "timestamp": "2025-08-22T22:38:18Z"
  },
  {
    "title": "Trump’s death penalty push faces setbacks as judges block efforts to reverse prior decisions",
    "description": "Since taking office in February, U.S. Attorney General Pam Bondi has authorized prosecutors to seek the death penalty against 19 people, including nine defendants in cases in which the Biden administration had sought lesser sentences. But judges have blocked …",
    "link": "https://www.pbs.org/newshour/politics/trumps-death-penalty-push-faces-setbacks-as-judges-block-efforts-to-reverse-prior-decisions",
    "timestamp": "2025-08-22T22:36:17Z"
  },
  {
    "title": "Trump nominates Sergio Gor to be next US ambassador to India (Reuters)",
    "description": "Reuters:\nTrump nominates Sergio Gor to be next US ambassador to India  —  President Donald Trump said on Friday he would nominate Sergio Gor, one of his closest aides, to be the next U.S. ambassador to India, where he will oversee frosty relations that have w…",
    "link": "https://www.memeorandum.com/250822/p124",
    "timestamp": "2025-08-22T22:35:00Z"
  },
  {
    "title": "Trump says furniture tariffs are coming later this year",
    "description": "The Trump administration has launched an investigation into imported furniture, President Donald Trump said Friday, setting the stage for new tariffs on a wide range of products.\n\"Within the next 50 days, that Investigation will be completed, and Furniture co…",
    "link": "https://biztoc.com/x/4edd9db89b22f06c",
    "timestamp": "2025-08-22T22:34:27Z"
  },
  {
    "title": "How South Korea is navigating the ‘Trump risk’ at key summits in Japan and U.S",
    "description": "South Korea's President Lee Jae Myung faces a pivotal foreign policy test barely two months after taking office, with back-to-back summits in Tokyo and Washington that reflect the wider struggle of U.S. allies to navigate Donald Trump’s unilateral push to red…",
    "link": "https://biztoc.com/x/f6841e5d05bf90e9",
    "timestamp": "2025-08-22T22:34:01Z"
  },
  {
    "title": "Zohran Mamdani’s policies 'won't work' in New York, Andrew Cuomo argues",
    "description": "Former New York Gov. Andrew Cuomo criticizes his Democratic socialist opponent Zohran Mamdani's 'anti-business' positions on 'The Story.'",
    "link": "https://www.foxnews.com/media/zohran-mamdanis-policies-wont-work-new-york-andrew-cuomo-argues",
    "timestamp": "2025-08-22T22:33:53Z"
  },
  {
    "title": "Trump says he may send National Guard to Chicago, New York - Politico",
    "description": "Trump says he may send National Guard to Chicago, New YorkPolitico President Donald Trump says Chicago is likely next target of efforts to crack down on crime after sending National Guard to DCABC7 Chicago Trump Says Chicago and New York Are Next for Federal …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178831110",
    "timestamp": "2025-08-22T22:33:16Z"
  },
  {
    "title": "Trump visits a DC gift shop and the Kennedy Center during military crackdown",
    "description": "With National Guard troops in the streets and federal agents at the door of his former adviser, President Donald Trump spent a heavy dose of his Friday...",
    "link": "https://www.yahoo.com/news/articles/trump-visits-dc-gift-shop-223236055.html",
    "timestamp": "2025-08-22T22:32:36Z"
  },
  {
    "title": "Ghislaine Maxwell Recalls Seeing Late Harvard Provost In Bathrobe After ‘Massage’",
    "description": "Convicted sex trafficker and Jeffrey Epstein associate Ghislaine Maxwell told the DOJ that Harvard University's provost talked about getting a \"massage.\"",
    "link": "https://dailycaller.com/2025/08/22/ghislaine-maxwell-recalls-seeing-late-harvard-provost-in-bathrobe-after-massage/",
    "timestamp": "2025-08-22T22:31:14Z"
  },
  {
    "title": "Major furniture retailers see stocks plummet after Trump's social media warning",
    "description": "President Donald Trump's warning that imported furniture will soon face tariffs sent stocks reeling for major retailers, according to a report. On Friday, Trump said on his Truth Social platform that his administration was conducting a major tariff investigat…",
    "link": "https://www.rawstory.com/trump-tariffs-2673912372/",
    "timestamp": "2025-08-22T22:31:03Z"
  },
  {
    "title": "U.S. Government Now ‘Controls’ 10% of Intel, Trump Says",
    "description": "What do you mean by \"controls,\" Mr. President?",
    "link": "https://gizmodo.com/u-s-government-now-controls-10-of-intel-trump-says-2000647121",
    "timestamp": "2025-08-22T22:31:02Z"
  },
  {
    "title": "Trump Makes Wild Claim About 'African American Ladies' During Chicago Crackdown Ramble",
    "description": "Considering Kamala Harris beat the president in Cook County, Illinois, by about a 75% margin, there were a lot of social media skeptics.",
    "link": "https://www.huffpost.com/entry/trump-makes-wild-claim-about-african-american-ladies-in-chicago_n_68a8d741e4b0371e6a9b1cfd",
    "timestamp": "2025-08-22T22:30:29Z"
  },
  {
    "title": "Trump Names Close Political Aide As Ambassador To India",
    "description": "President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.",
    "link": "https://www.ibtimes.com/trump-names-close-political-aide-ambassador-india-3781496",
    "timestamp": "2025-08-22T22:30:16Z"
  },
  {
    "title": "The Unsurprising F.B.I. Investigation into John Bolton",
    "description": "From the daily newsletter: the retribution phase of Trump’s Presidency has begun.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-unsurprising-fbi-investigation-into-john-bolton",
    "timestamp": "2025-08-22T22:30:00Z"
  },
  {
    "title": "Trump trumpets deal giving US a 10% stake in downtrodden Intel",
    "description": "Trump trumpets deal giving US a 10% stake in downtrodden Intel",
    "link": "https://www.livemint.com/companies/news/trump-trumpets-deal-giving-us-a-10-stake-in-downtrodden-intel-11755901766091.html",
    "timestamp": "2025-08-22T22:29:25Z"
  },
  {
    "title": "How South Korea is navigating the ‘Trump risk’ at key summits in Japan and U.S.",
    "description": "South Korea's President Lee Jae Myung faces a pivotal foreign policy test barely two months after taking office, with back-to-back summits in Tokyo and Washington that reflect the wider struggle of U.S. allies to navigate Donald Trump’s unilateral push to red…",
    "link": "https://www.pbs.org/newshour/world/how-south-korea-is-navigating-the-trump-risk-at-key-summits-in-japan-and-u-s",
    "timestamp": "2025-08-22T22:27:14Z"
  },
  {
    "title": "Maxwell Reportedly Didn't See Trump Being 'Inappropriate'",
    "description": "Federal inmate Ghislaine Maxwell said she admires President Trump, according to transcripts released Friday, and never saw him receive a massage or act inappropriately. The comments were included in Justice Department transcripts of the two-day interview by D…",
    "link": "https://www.newser.com/story/373999/maxwell-reportedly-didnt-see-trump-being-inappropriate.html",
    "timestamp": "2025-08-22T22:24:07Z"
  },
  {
    "title": "Business owners’ economic worries reflected in Google searches",
    "description": "Business owners are getting increasingly worried about the economy — and it’s showing up in their Google search data.",
    "link": "https://finance.yahoo.com/news/business-owners-economic-worries-reflected-222158126.html",
    "timestamp": "2025-08-22T22:21:58Z"
  },
  {
    "title": "Some More Political Football: World Cup Draw Is Set For Kennedy Center",
    "description": "The 2026 World Cup draw will be held at the Kennedy Center, and not in Las Vegas. It opened up questions about more political football between Trump and Infantino.",
    "link": "https://www.forbes.com/sites/michaellewis/2025/08/22/some-more-political-football-world-cup-draw-is-set-for-kennedy-center/",
    "timestamp": "2025-08-22T22:21:29Z"
  },
  {
    "title": "Donald Trump claims he is a 'very good athlete' and jokes he could play at the 2026 FIFA World Cup",
    "description": "U.S. President Donald Trump drew attention on Friday with a lighthearted remark about potentially participating in the 2026 FIFA World Cup, which will be co-hosted by the United St",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/08/23/68a8e82622601ddf7e8b458c.html",
    "timestamp": "2025-08-22T22:20:41Z"
  },
  {
    "title": "Unions cry foul as HHS moves to strip thousands of federal health workers of bargaining rights",
    "description": "The U.S. Department of Health and Human Services plans to scrap thousands of federal health agency employees of their collective bargaining rights.",
    "link": "https://nypost.com/2025/08/22/us-news/unions-cry-foul-as-hhs-moves-to-strip-thousands-of-federal-health-workers-of-bargaining-rights/",
    "timestamp": "2025-08-22T22:18:24Z"
  },
  {
    "title": "U.S. Defense Chief fires general whose intel on Iran strikes angered Trump",
    "description": "Lt. Gen. Jeffrey Kruse, head of the Defense Intelligence Agency, was dismissed after a report found that U.S. strikes only modestly set back Iran's nuclear program – contradicting Trump and Netanyahu's claim it was 'completely and fully obliterated'",
    "link": "https://www.haaretz.com/us-news/2025-08-23/ty-article/u-s-defense-chief-fires-general-whose-intel-on-iran-strikes-angered-trump/00000198-d3ac-d402-a1fd-f3bde9680000",
    "timestamp": "2025-08-22T22:17:44Z"
  },
  {
    "title": "Trump threatens to send federal troops into Chicago and New York City",
    "description": "At a press conference in the Oval Office, Trump boasted about the National Guard presence he sent into Washington, D.C., last week, adding: “I think Chicago will be our next, and then we’ll help with New York.”",
    "link": "https://www.msnbc.com/top-stories/latest/trump-chicago-new-york-troops-national-guard-washington-dc-rcna226683",
    "timestamp": "2025-08-22T22:15:54Z"
  },
  {
    "title": "Ilhan Omar erupts at own party for reneging on socialist candidate's endorsement: 'Inexcusable'",
    "description": "A progressive House \"Squad\" member is attacking her own state party leadership for going back on its endorsement of a self-described democratic socialist to be mayor of Minneapolis. Rep. Ilhan Omar, D-Minn., called out the Democratic-Farmer-Labor Party (DFL),…",
    "link": "https://freerepublic.com/focus/f-chat/4336187/posts",
    "timestamp": "2025-08-22T22:09:37Z"
  },
  {
    "title": "California ‘Anti-Poverty Activist’ And Dem Mega-Donor Pleads Guilty To Massive Carbon-Credit Scam",
    "description": "Top Dem donor and Gavin Newsom backer raised $300 million by touting \"Corporate ESG Business\" based on fake revenue.Joe Sanberg, a top California Democrat activist who decried the corruption of big Wall Street banks and started a company marketed as the “clea…",
    "link": "https://freerepublic.com/focus/f-news/4336186/posts",
    "timestamp": "2025-08-22T22:08:56Z"
  },
  {
    "title": "Famine Confirmed in Gaza City, According to New Report",
    "description": "The leading global hunger monitor warns that conditions will only worsen if the war continues.",
    "link": "http://foreignpolicy.com/2025/08/22/famine-gaza-city-ipc-report-israel-hamas-war/",
    "timestamp": "2025-08-22T22:08:07Z"
  },
  {
    "title": "'Pretty creative': CNN hosts debunk Trump's Epstein claims in brutal fact-check",
    "description": "During a press conference in the Oval Office, President Donald Trump dismissed the new release of documents relating to convicted child predator Jeffrey Epstein as a \"hoax\" concocted by Democrats. His claims didn't pass muster after two CNN hosts conducted a …",
    "link": "https://www.rawstory.com/trump-epstein-2673912343/",
    "timestamp": "2025-08-22T22:05:32Z"
  },
  {
    "title": "Apple’s Tim Cook Makes An Unwanted South Park Appearance",
    "description": "Apple's Tim Cook just made an unwanted South Park appearance. Here are all the details on this.\nThe post Apple’s Tim Cook Makes An Unwanted South Park Appearance first appeared on Redmond Pie.",
    "link": "https://www.redmondpie.com/apples-tim-cook-makes-an-unwanted-south-park-appearance/",
    "timestamp": "2025-08-22T22:05:25Z"
  },
  {
    "title": "'We'll see what happens': Trump ends week of Ukraine-Russia talks on a more tentative note (NBC News)",
    "description": "NBC News:\n'We'll see what happens': Trump ends week of Ukraine-Russia talks on a more tentative note  —  The White House said President Donald Trump is still working toward a bilateral meeting.  “Nobody is ready to throw in the towel,” one national security o…",
    "link": "https://www.memeorandum.com/250822/p120",
    "timestamp": "2025-08-22T22:05:00Z"
  },
  {
    "title": "Disruption Is, Well … Disruptive–Why Washington Fears EJ Antoni",
    "description": "Washington is flailing. The establishment has gone into full meltdown over one man: Dr. EJ Antoni. Why? Because he’s telling the truth taxpayers already know–America’s... Read More\nThe post Disruption Is, Well … Disruptive–Why Washington Fears EJ Antoni appea…",
    "link": "https://www.dailysignal.com/2025/08/22/disruption-is-well-disruptive-why-washington-fears-ej-antoni/",
    "timestamp": "2025-08-22T22:04:13Z"
  },
  {
    "title": "‘I’m Just Not Buying This’: CNN Legal Analyst Says Something Is off About Maxwell Prison Interview",
    "description": "CNN Senior Legal Analyst Elie Honig is majorly skeptical of the interview that convicted child sex trafficker Ghislaine Maxwell gave to the Department of Justice.\nThe post ‘I’m Just Not Buying This’: CNN Legal Analyst Says Something Is off About Maxwell Priso…",
    "link": "https://www.mediaite.com/media/tv/im-just-not-buying-this-cnn-legal-analyst-says-something-is-off-about-maxwell-prison-interview/",
    "timestamp": "2025-08-22T22:03:43Z"
  },
  {
    "title": "Defund the Homeless Industrial Complex, Dems’ 9/11-like Jan. 6 Rights-Stomping, and other commentary",
    "description": "“Donald Trump is being cruel and heartless by deploying the National Guard to deal with the crisis of crime and homelessness,” observes Adam Hill at Chronicles.",
    "link": "https://nypost.com/2025/08/22/opinion/defund-the-homeless-industrial-complex-dems-9-11-like-jan-6-rights-stomping-and-other-commentary/",
    "timestamp": "2025-08-22T22:03:07Z"
  },
  {
    "title": "Trump names close political aide as ambassador to India",
    "description": "President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi. The 38-year-old Gor rose quickly in conservative politics to become one of the mo…",
    "link": "https://www.digitaljournal.com/world/trump-names-close-political-aide-as-ambassador-to-india/article",
    "timestamp": "2025-08-22T22:02:20Z"
  },
  {
    "title": "Trump frustrated after thinking he made headway on Russia-Ukraine talks only to see Putin balk",
    "description": "WASHINGTON (AP) — U.S. President Donald Trump started the week declaring a diplomatic breakthrough in his bid to prod Moscow and Kyiv closer to peace, announcing he had begun arranging for direct talks between Russia’s Vladimir Putin and Ukraine’s Volodymyr Z…",
    "link": "https://freerepublic.com/focus/f-news/4336183/posts",
    "timestamp": "2025-08-22T22:02:15Z"
  },
  {
    "title": "Ghostface Killah Frowns On Donald Trump's Proposed Section 8 Time Limit",
    "description": "Donald Trump wants his administration to shake up the country's Section 8 benefits to just 2 years of eligibility, yet Ghostface Killah thinks the proposed policy will just make things worse ... the Wu-Tang Clan legend knows it's not easy making project housi…",
    "link": "https://www.tmz.com/2025/08/22/ghostface-killah-donald-trump-section-8-housing/",
    "timestamp": "2025-08-22T22:01:45Z"
  },
  {
    "title": "White House fires back at ex-ABC journalist Terry Moran for saying DC crime crackdown all for show",
    "description": "Ex-ABC News host Terry Moran argued President Trump's 800 National Guard troops and federalization of D.C. police are performative, not addressing high-crime areas like Anacostia.",
    "link": "https://www.foxnews.com/media/white-house-fires-back-ex-abc-journalist-terry-moran-saying-dc-crime-crackdown-all-show",
    "timestamp": "2025-08-22T22:00:46Z"
  },
  {
    "title": "‘We Have Broken No Laws in the United States’: 4chan Refuses to Pay Fines to UK’s Media Regulator Ofcom, in Another Show of Resistance to Draconian ‘Online Safety Act’",
    "description": "Censorship-mad UK is going after US Tech companies.\nThe post ‘We Have Broken No Laws in the United States’: 4chan Refuses to Pay Fines to UK’s Media Regulator Ofcom, in Another Show of Resistance to Draconian ‘Online Safety Act’ appeared first on The Gateway …",
    "link": "https://www.thegatewaypundit.com/2025/08/we-have-broken-no-laws-united-states-4chan/",
    "timestamp": "2025-08-22T22:00:17Z"
  },
  {
    "title": "PRELUDE TO PARDON",
    "description": "The imprisoned sex trafficker lauded Trump, unprompted, for becoming the president and described the 34-time convicted felon as \"a perfect gentleman\"",
    "link": "https://www.themirror.com/news/us-news/sex-offender-maxwell-reveals-how-1345743",
    "timestamp": "2025-08-22T22:00:07Z"
  },
  {
    "title": "First House Candidate Emerges After Texas Redistricting",
    "description": "In a move that could send another strong conservative to Washington, Texas state Rep. Briscoe Cain is running for the newly redrawn 9th Congressional District... Read More\nThe post First House Candidate Emerges After Texas Redistricting appeared first on The …",
    "link": "https://www.dailysignal.com/2025/08/22/briscoe-cain-announces-run-congress/",
    "timestamp": "2025-08-22T22:00:00Z"
  },
  {
    "title": "Unfortunately, there may not be a hockey analogy for the challenge Canada faces",
    "description": "Inevitably, but torturously, this unique moment in the history of this country has come to be understood primarily in hockey terms.",
    "link": "https://www.cbc.ca/news/politics/carney-retaliatory-tariffs-analysis-1.7616050",
    "timestamp": "2025-08-22T21:58:01Z"
  },
  {
    "title": "'There is no list': Transcripts from Maxwell's interview with DOJ released",
    "description": "Maxwell said she never saw President Donald Trump or former President Bill Clinton receive massages or act inappropriately.The Department of Justice released transcripts and audio recordings from its interview with Jeffrey Epstein associate Ghislaine Maxwell,…",
    "link": "https://freerepublic.com/focus/f-news/4336181/posts",
    "timestamp": "2025-08-22T21:56:44Z"
  },
  {
    "title": "US Justice Department releases interviews with Ghislaine Maxwell",
    "description": "The transcripts with Ghislaine Maxwell are released as the Trump administration suffers a sustained backlash from its base over failing to deliver on expectations created through conspiracy theories and bold promises.",
    "link": "https://www.abc.net.au/news/2025-08-23/department-of-justice-releases-interviews-with-ghislaine-maxwell/105688698",
    "timestamp": "2025-08-22T21:55:25Z"
  },
  {
    "title": "Wrongly deported migrant Abrego released, but he may be detained again",
    "description": "Summary Abrego ordered released on bail after wrongful deportation Trump administration brought him back to face criminal charges Defense lawyers fear deportation to third country despite release Noem says U.S. will continue to seek his deportation Aug 22 (Re…",
    "link": "https://freerepublic.com/focus/f-news/4336180/posts",
    "timestamp": "2025-08-22T21:54:40Z"
  },
  {
    "title": "Justice Department Declines To Defend Grants For Hispanic-Serving Colleges, Calling Them Unconstitutional",
    "description": "More than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program.",
    "link": "https://www.huffpost.com/entry/justice-dept-declines-defend-grants-for-hispanic-serving-colleges-unconstitutional_n_68a8e1eae4b0768c801ed732",
    "timestamp": "2025-08-22T21:51:05Z"
  },
  {
    "title": "Mayor Johnson pushes back on Trump’s tough talk",
    "description": "Trump’s Threat to “Straighten Out” Chicago: A Political Power Play in Plain Sight On August 22, 2025, President Donald Trump escalated his rhetoric on urban crime, this time directing his fire at Chicago. Just days after taking control of the Metropolitan Pol…",
    "link": "https://rollingout.com/2025/08/22/johnson-pushes-back-on-trumps-tough-talk/",
    "timestamp": "2025-08-22T21:49:20Z"
  },
  {
    "title": "Struggling Intel could sink Trump’s chip-making scheme",
    "description": "Gus Carlson is a U.S.-based columnist for The Globe and Mail.\nThe White House’s interest in making Intel INTC-Q the star of its blockbuster domestic chip-making initiative has generated a new round of head-scratching about what U.S. President Donald Trump is …",
    "link": "https://biztoc.com/x/059507d33489cbd4",
    "timestamp": "2025-08-22T21:49:10Z"
  },
  {
    "title": "$500 Million To Paint the Border Wall? 5 of Trump's Strangest, Most Expensive Vanity Projects",
    "description": "It's been nearly two weeks since President Donald Trump declared a crime emergency in the nation's capital. But while the crime crackdown has yielded somewhat underwhelming results—\"nearly 2,000 officers made fewer than 400 arrests,\" reports Reason's Joe Lanc…",
    "link": "https://biztoc.com/x/7e55d8322fb7ea02",
    "timestamp": "2025-08-22T21:49:03Z"
  },
  {
    "title": "Intel Responds After Donald Trump Says US Is Getting a 10 Percent Stake",
    "description": "Intel's statement followed remarks from Trump that Washington would gain a direct stake in the chipmaker under a new agreement.",
    "link": "https://biztoc.com/x/8b53001ab18fa6b4",
    "timestamp": "2025-08-22T21:48:53Z"
  },
  {
    "title": "US bill proposes 21st-century privateers to take on cybercrime",
    "description": "The proposed bill included a list of targetable offenses, including the theft of cryptocurrencies, ransomware attacks, and pig butchering scams.",
    "link": "https://cointelegraph.com/news/us-bill-neo-privateers-answer-cybercrime",
    "timestamp": "2025-08-22T21:46:18Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump Accused of 'Weeping Under His Bed Covers' to Pal Jeffrey Epstein Over Bankruptcy Woes — After 'Repeatedly Begging Pedophile to Get him Top Model's Number'",
    "description": "Donald Trump cried out to Jeffrey Epstein over his money and women issues, according to insiders.",
    "link": "https://radaronline.com/p/donald-trump-crying-jeffrey-epstein-model-bankruptcy/",
    "timestamp": "2025-08-22T21:45:00Z"
  },
  {
    "title": "Trump names Sergio Gor as next US ambassador to India (Bhargav Acharya/Reuters)",
    "description": "Bhargav Acharya / Reuters:\nTrump names Sergio Gor as next US ambassador to India  —  President Donald Trump said on Friday that he had named Sergio Gor to be the next U.S. ambassador to India and special envoy for South and Central Asian affairs.  —  Gor, who…",
    "link": "https://www.memeorandum.com/250822/p118",
    "timestamp": "2025-08-22T21:45:00Z"
  },
  {
    "title": "Trump Says US Will Snag $10 Billion Ownership Stake In Intel",
    "description": "President Donald Trump said the U.S. will take a 10% equity stake in Intel under a deal the White House plans to announce later in the day.",
    "link": "https://dailycaller.com/2025/08/22/donald-trump-us-10-billion-ownership-stake-intel/",
    "timestamp": "2025-08-22T21:43:49Z"
  },
  {
    "title": "Ukraine Attacks Russian Oil Pipeline; Trump Angry",
    "description": "Ukraine has now attacked for the third time a Russian oil pipeline that supplies multiple European nations. The attacks angered President Donald Trump after he received a note from Hungarian Prime Minister Viktor Orbán.The Ukrainians hit the Druzhba (“Friends…",
    "link": "https://freerepublic.com/focus/f-news/4336179/posts",
    "timestamp": "2025-08-22T21:41:53Z"
  },
  {
    "title": "Trump says US government will take 10% stake in Intel",
    "description": "U.S. President Donald Trump today announced that the federal government will receive Intel Corp. shares in exchange for the CHIPS Act financing the company won last year. Trump detailed the deal, which confirms recent media reports, during a White House press…",
    "link": "https://siliconangle.com/2025/08/22/trump-says-us-government-will-take-10-stake-intel/",
    "timestamp": "2025-08-22T21:40:27Z"
  },
  {
    "title": "Trump Announces Furniture Imports Probe, Setting Up Tariffs",
    "description": "President Donald Trump said the US is conducting a “major Tariff Investigation  on Furniture coming into the United States,” setting the stage for industry-specific levies.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-announces-furniture-imports-probe-setting-up-tariffs",
    "timestamp": "2025-08-22T21:40:27Z"
  },
  {
    "title": "Trump Says Chicago Crime Crackdown Is Coming Next",
    "description": "President Donald Trump said Friday that his administration will be looking at cracking down on crime in Chicago after the success of the federal government's efforts to combat crime in Washington, DC. \nThe post Trump Says Chicago Crime Crackdown Is Coming Nex…",
    "link": "https://www.breitbart.com/politics/2025/08/22/trump-says-chicago-crime-crackdown-is-coming-next/",
    "timestamp": "2025-08-22T21:39:24Z"
  },
  {
    "title": "HHS moves to strip thousands of federal health workers of union rights",
    "description": "It's the latest move by the administration to end collective bargaining with federal employee unions.",
    "link": "https://www.bostonherald.com/2025/08/22/hhs-unions/",
    "timestamp": "2025-08-22T21:38:19Z"
  },
  {
    "title": "Two-thirds of Americans have strong feelings about Donald Trump — and most of them are negative",
    "description": "A far larger share of Democrats say they strongly disapprove of Trump than the share of Republicans who strongly approve of Trump (83% vs. 54%).",
    "link": "https://biztoc.com/x/5146ca529d302b86",
    "timestamp": "2025-08-22T21:37:43Z"
  },
  {
    "title": "Intel Responds After Donald Trump Says US Is Getting a 10 Percent Stake",
    "description": "Intel's statement followed remarks from Trump that Washington would gain a direct stake in the chipmaker under a new agreement.",
    "link": "https://www.newsweek.com/donald-trump-intel-lip-bu-tan-china-market-2118060",
    "timestamp": "2025-08-22T21:37:29Z"
  },
  {
    "title": "Ghislaine Maxwell praises Trump in transcripts released by government",
    "description": "Partner of Jeffrey Epstein insists Trump never engaged in inappropriate behavior amid scrutiny over past relationship.",
    "link": "https://www.aljazeera.com/news/2025/8/22/ghislaine-maxwell-praises-trump-in-transcripts-released-by-government",
    "timestamp": "2025-08-22T21:36:44Z"
  },
  {
    "title": "Media Stocks, Markets Soar As Fed Chief Signals September Rate Cut – “The Balance Of Risks Appears To Be Shifting”",
    "description": "It’s been a long wait but Federal Reserve chair Jerome Powell energized stocks today as he cracked open the door to a possible interest rate cut at the Central Bank’s September meeting. In his keynote address at the Fed’s annual economic symposium in Jackson …",
    "link": "http://deadline.com/2025/08/media-stocks-markets-soar-fed-september-interest-rate-cut-1236495606/",
    "timestamp": "2025-08-22T21:36:18Z"
  },
  {
    "title": "Johnson & Johnson to invest $2B in North Carolina plant as Trump’s 250% drug tariffs loom",
    "description": "It's a move to boost its domestic production as President Donald Trump threatens to slap devastating tariffs on pharmaceutical imports.",
    "link": "https://nypost.com/2025/08/22/business/johnson-amp-johnson-to-invest-2b-in-north-carolina-plant/",
    "timestamp": "2025-08-22T21:34:34Z"
  },
  {
    "title": "House Dems push bribery inquiry into Paramount-Skydance after Trump deal",
    "description": "House Democrats are pressing forward with an inquiry into potential bribery by Paramount-Skydance as it pursued a multibillion-dollar merger approved by Trump’s Federal Communications Commission last month",
    "link": "https://www.msnbc.com/top-stories/latest/paramount-skydance-trump-bribery-investigation-rcna226673",
    "timestamp": "2025-08-22T21:34:11Z"
  },
  {
    "title": "Ethereum Hits All-Time High Price After Nearly 4 Years",
    "description": "Ethereum set a new all-time high, breaking its previous 2021 record after Jerome Powell signaled the Fed would cut interest rates.",
    "link": "https://decrypt.co/334851/ethereum-hits-all-time-high-price-after-nearly-4-years",
    "timestamp": "2025-08-22T21:34:05Z"
  },
  {
    "title": "Tariffs Are Coming for Your Coffee (and Matcha)",
    "description": "Weekly roundup of NerdWallet news: Tariffs brew trouble for the coffee industry; matcha supply no match for demand; Americans and alcohol.",
    "link": "https://www.nerdwallet.com/article/finance/roundup-8-22-25#article",
    "timestamp": "2025-08-22T21:32:39Z"
  },
  {
    "title": "'We'll see what happens': Trump ends week of Ukraine-Russia talks on a more tentative note",
    "description": "Progress toward ending the Ukraine war appears to have slowed after Donald Trump's meeting with Vladimir Putin, with no planned meeting with Volodymyr Zelenskyy.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-russia-putin-zelenskyy-meeting-ukraine-war-tentative-rcna226522",
    "timestamp": "2025-08-22T21:30:44Z"
  },
  {
    "title": "Fox News Politics Newsletter: Maxwell denies Trump misconduct, DOJ docs reveal",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-maxwell-denies-trump-misconduct-doj-docs-reveal",
    "timestamp": "2025-08-22T21:29:36Z"
  },
  {
    "title": "$500 Million To Paint the Border Wall? 5 of Trump's Strangest, Most Expensive Vanity Projects",
    "description": "Donald Trump is no stranger to wasteful spending. But these examples are especially egregious.",
    "link": "https://reason.com/2025/08/22/500-million-to-paint-the-border-wall-5-of-trumps-strangest-most-expensive-vanity-projects/",
    "timestamp": "2025-08-22T21:28:50Z"
  },
  {
    "title": "US judge pauses changes to federal health insurance marketplace",
    "description": "A federal judge paused portions of the U.S. Department of Health and Human Services' planned regulatory changes to the Affordable Care Act's health insurance marketplace on Friday, just days before they were due to take effect.U.S. District Judge Brendan Hurs…",
    "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3UE0MI:0-us-judge-pauses-changes-to-federal-health-insurance-marketplace/",
    "timestamp": "2025-08-22T21:28:06Z"
  },
  {
    "title": "JD Vance's Brutal Public Booing Is Prompting Quite The Strong Reaction Online",
    "description": "Experts have thoughts about the videos of the vice president getting heckled — and reveal whether you're legally protected if you decide to join the ranks.",
    "link": "https://www.huffpost.com/entry/jd-vance-booed-public-online-expert_n_68a892d2e4b0768c801e7933",
    "timestamp": "2025-08-22T21:28:02Z"
  },
  {
    "title": "Trump says furniture tariffs are coming later this year",
    "description": "The Trump administration has launched an investigation into imported furniture, President Donald Trump said Friday, setting the stage for new tariffs on a wide range of products.\n\"Within the next 50 days, that Investigation will be completed, and Furniture co…",
    "link": "https://biztoc.com/x/5e3ee67a37b6b398",
    "timestamp": "2025-08-22T21:26:40Z"
  },
  {
    "title": "Trump: US Intel shares valued at about $11B",
    "description": "United States President Donald Trump announced on Friday that the US \"now fully owns and controls 10% of Intel,\" adding that the value of the shares acquired is \"approximately $11 billion.\" The presid...",
    "link": "https://biztoc.com/x/e2514e7d5171cde5",
    "timestamp": "2025-08-22T21:26:36Z"
  },
  {
    "title": "Wall Street soars on hopes for lower interest rates as the Dow surges 846 points to a record",
    "description": "Wall Street rallied to its best day in months after the head of the Federal Reserve hinted that cuts to interest rates may be on the way",
    "link": "https://www.daytondailynews.com/news/nation-world/wall-street-soars-on-hopes-for-lower-interest-rates-as-the-dow-surges-846-points-to-a-record/WDNF3SLACJKWPBHXMMQE4AI4FY/",
    "timestamp": "2025-08-22T21:25:43Z"
  },
  {
    "title": "Trump Announces Furniture Imports Probe, Setting Up Tariffs (Bloomberg)",
    "description": "Bloomberg:\nTrump Announces Furniture Imports Probe, Setting Up Tariffs  —  President Donald Trump said the US is conducting a “major Tariff Investigation on Furniture coming into the United States,” setting the stage for industry-specific levies.  —  “Within …",
    "link": "https://www.memeorandum.com/250822/p115",
    "timestamp": "2025-08-22T21:25:00Z"
  },
  {
    "title": "Larry Kudlow Slams Trump Admin Nationalizing Part of Intel: ‘Very, Very Uncomfortable With That Idea’",
    "description": "“I hate corporate welfare. That's privatization in reverse. We want the government to divest of assets, not buy assets. So terrible, one of the bad ideas that's come out of this White House\"\nThe post Larry Kudlow Slams Trump Admin Nationalizing Part of Intel:…",
    "link": "https://www.mediaite.com/media/news/larry-kudlow-slams-trump-admin-nationalizing-part-of-intel-very-very-uncomfortable-with-that-idea/",
    "timestamp": "2025-08-22T21:23:59Z"
  },
  {
    "title": "Trump says Intel agreed to give US a stake in its company",
    "description": "WASHINGTON: President Donald Trump said on Friday (Aug 22) the US would take a 10 per cent stake in Intel INTC.O under a deal with the struggling chipmaker and is planning",
    "link": "https://www.channelnewsasia.com/world/trump-says-intel-agreed-give-us-stake-its-company-5309921",
    "timestamp": "2025-08-22T21:22:44Z"
  },
  {
    "title": "Wisconsin judge rejects motions to dismiss charges against Trump aides",
    "description": "A Wisconsin judge Friday declined to dismiss felony charges against two attorneys and a former aide to President Donald Trump who advised Trump in 2020 as...",
    "link": "https://www.yahoo.com/news/articles/wisconsin-judge-rejects-motions-dismiss-212235676.html",
    "timestamp": "2025-08-22T21:22:35Z"
  },
  {
    "title": "Pew Research: Foreign-born population in U.S. declines for first time since the ’60s",
    "description": "Exploded under Joe Biden, but already has gone down 1.5 million under Trump",
    "link": "https://www.wnd.com/2025/08/pew-research-foreign-born-population-u-s-declines/",
    "timestamp": "2025-08-22T21:21:33Z"
  },
  {
    "title": "HHS moves to strip thousands of federal health workers of union rights",
    "description": "The U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights",
    "link": "https://abcnews.go.com/Health/wireStory/hhs-moves-strip-thousands-federal-health-workers-union-124902890",
    "timestamp": "2025-08-22T21:18:56Z"
  },
  {
    "title": "DOJ releases Ghislaine Maxwell transcript: Claims she never saw Trump in “any inappropriate setting”",
    "description": "The Justice Department released edited transcripts of her two-day interview with ex-Trump lawyer Todd Blanche.",
    "link": "https://www.salon.com/2025/08/22/doj-releases-ghislaine-maxwell-transcript-claims-she-never-saw-trump-in-any-inappropriate-setting/",
    "timestamp": "2025-08-22T21:18:45Z"
  },
  {
    "title": "US Justice department releases Ghislaine Maxwell interviews",
    "description": "Maxwell says she never saw Donald Trump in an inappropriate setting. The associate of Jeffrey Epstein also said she never saw an alleged \"client list\" belonging to the billionaire financier and child sex offender. Jeffrey Epstein's longtime girlfriend Ghislai…",
    "link": "https://www.dw.com/en/us-justice-department-releases-ghislaine-maxwell-interviews/a-73738403",
    "timestamp": "2025-08-22T21:18:00Z"
  },
  {
    "title": "Ghislaine Maxwell never saw Trump in 'inappropriate setting'",
    "description": "Ghislaine Maxwell also said she never saw an alleged \"client list\" belonging to billionaire financier and sex trafficker Jeffrey Epstein.",
    "link": "https://www.dw.com/en/ghislaine-maxwell-never-saw-trump-in-inappropriate-setting/a-73738403",
    "timestamp": "2025-08-22T21:18:00Z"
  },
  {
    "title": "Trump could rename Kennedy Center after himself ‘in a week or so’",
    "description": "Trump has repeatedly mentioned renaming the storied Washington, D.C. institution",
    "link": "https://www.the-independent.com/arts-entertainment/theatre-dance/news/donald-trump-kennedy-center-rename-b2812676.html",
    "timestamp": "2025-08-22T21:17:42Z"
  },
  {
    "title": "Trump says furniture tariffs are coming later this year",
    "description": "Stocks for some furniture and home goods companies, including Wayfair, RH and Williams-Sonoma, tumbled after the market close, following Trump's post.",
    "link": "https://www.cnbc.com/2025/08/22/trump-tariffs-furniture-trade.html",
    "timestamp": "2025-08-22T21:17:41Z"
  }
]