[
  {
    "title": "Hondurans vote to elect new president in a close race under shadow of Trump’s surprise intervention",
    "description": "Hondurans began casting ballots to elect a new president only days after U.S. President Donald Trump intervened in a close race with an endorsement of one candidate and announced he would pardon a former president",
    "link": "https://abcnews.go.com/Business/wireStory/hondurans-vote-elect-new-president-close-race-shadow-127977410",
    "timestamp": "2025-11-30T13:17:38Z"
  },
  {
    "title": "Netanyahu seeks pardon on corruption charges after getting Trump's backing",
    "description": "Israeli Prime Minister Benjamin Netanyahu has submitted a request for a formal pardon amid a yearslong corruption trial, just weeks after President Donald Trump said he should be pardoned.“Today my lawyers submitted a request for clemency to the President of …",
    "link": "https://www.nbcnews.com/world/israel/netanyahu-seeks-pardon-corruption-charges-israel-trump-backing-rcna246527",
    "timestamp": "2025-11-30T13:17:37Z"
  },
  {
    "title": "Hondurans vote to elect new president in a close race under shadow of Trump’s surprise intervention",
    "description": "TEGUCIGALPA, Honduras (AP) — Hondurans began casting ballots Sunday to elect a new president only days after U.S. President Donald Trump intervened in a close race with an endorsement of one candidate and announced that he would pardon a former president. At …",
    "link": "https://financialpost.com/pmn/hondurans-vote-to-elect-new-president-in-a-close-race-under-shadow-of-trumps-surprise-intervention",
    "timestamp": "2025-11-30T13:14:04Z"
  },
  {
    "title": "The Response Was Telling: Scott Jennings Presses Democrat to Name Illegal Order Trump Issued",
    "description": "Hinojosa complained on the panel with Jennings about the FBI arranging interviews with Slotkin and the others who appeared in the video.",
    "link": "https://www.westernjournal.com/response-telling-scott-jennings-presses-democrat-name-illegal-order-trump-issued/",
    "timestamp": "2025-11-30T13:11:59Z"
  },
  {
    "title": "The “Conservative Art” Trap: Reactionary Conservatism Misses The Values That Make Art Great",
    "description": "Earlier this year, a controversy erupted over a portrait of US President Donald Trump in the Colorado Capitol building. This incident is a recent example of the president’s interest in the arts. Despite his notoriously garish taste, he was correct to point ou…",
    "link": "https://www.fairobserver.com/world-news/us-news/the-conservative-art-trap-reactionary-conservatism-misses-the-values-that-make-art-great/",
    "timestamp": "2025-11-30T13:06:32Z"
  },
  {
    "title": "'Tech bros are out of control!' Trump's crypto czar is driving a wedge into MAGA",
    "description": "President Donald Trump’s crypto czar, South African venture capitalist David Sacks, has pushed the Trump administration to enact several policies that have enriched his Silicon Valley friends – and potentially himself\r\n – driving a wedge in MAGA and “alarming…",
    "link": "https://www.rawstory.com/crypto-2674356214/",
    "timestamp": "2025-11-30T13:04:57Z"
  },
  {
    "title": "US officials under fire for decision that could risk public health: 'That shows you where the priorities are' - NewsBreak",
    "description": "\"Operating at full force.\"  US officials under fire for decision that could risk public health: 'That shows you where the priorities are' first appeared on",
    "link": "https://www.newsbreak.com/share/4372653626278-us-officials-under-fire-for-decision-that-could-risk-public-health-that-shows-you-where-the-priorities-are?s=a2&amp;share_destination_id=MjI0MTEwNzc1LTE3NjQ1MDc2MzUwMzE%3D&amp;pd=0FALRvVD&amp;hl=en_US&amp;send_time=1764507635&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.47.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-30T13:04:38Z"
  },
  {
    "title": "Netanyahu Submits Request For A Pardon During His Ongoing Corruption Trial",
    "description": "Benjamin Netanyahu has asked Israel's president for a pardon during his ongoing corruption trial.",
    "link": "https://www.huffpost.com/entry/benjamin-netanyahu-pardon-request_n_692c3fbee4b067502045408f",
    "timestamp": "2025-11-30T13:03:42Z"
  },
  {
    "title": "Trump expands crackdown on legal immigration after National Guard shooting",
    "description": "President Donald Trump is ramping up his campaign to deport immigrants to the United States in the wake of the National Guard shooting in Washington, this time targeting the millions of legal immigrants already in the country.\nTrump unleashed the latest threa…",
    "link": "https://biztoc.com/x/fab187153af3f608",
    "timestamp": "2025-11-30T13:02:58Z"
  },
  {
    "title": "Netanyahu submits ‘extraordinary’ pardon request in Israel corruption cases",
    "description": "Netanyahu and his wife, Sara, are accused of accepting more than $260,000 worth of luxury goods in exchange for political favours",
    "link": "https://www.euractiv.com/news/netanyahu-submits-extraordinary-pardon-request-in-israel-corruption-cases/",
    "timestamp": "2025-11-30T12:52:28Z"
  },
  {
    "title": "Meet Jay Graber, the CEO of Bluesky, who is building a 'billionaire-proof' and decentralized social media platform",
    "description": "Graber spent her early years studying how technology interacts with society, and now leads Bluesky that is looking to be \"billionaire-proof.\"",
    "link": "https://www.businessinsider.com/meet-jay-graber-ceo-bluesky-who-wants-change-social-media",
    "timestamp": "2025-11-30T12:51:02Z"
  },
  {
    "title": "Trump's Social Security changes spark 4 major consequences: report",
    "description": "When President Franklin Delano Roosevelt signed into law the Social Security Act of 1935 and the U.S. Social Security Administration (SSA) was created, the program had its share of critics on the right. Some Republicans of the 1930s attacked Social Security a…",
    "link": "https://www.rawstory.com/alternet-posts/social-security-trump-nasdaq/",
    "timestamp": "2025-11-30T12:50:07Z"
  },
  {
    "title": "Trump says $2,000 tariff checks could come mid-2026. But one Republican senator says, ‘We can’t afford it’",
    "description": "The president has been talking about sending rebate checks since July.",
    "link": "https://finance.yahoo.com/news/trump-says-2-000-tariff-125000209.html",
    "timestamp": "2025-11-30T12:50:00Z"
  },
  {
    "title": "'Wow': Onlookers stunned by GOP congressman's '100% correct' Trump admin criticism",
    "description": "Political observers and experts pounced on Saturday as a Republican lawmaker offered a stinging rejection of reported conduct by Donald Trump's administration.The Wall Street Journal's piece ahead of the weekend, Make Money Not War: Trump’s Real Plan for Peac…",
    "link": "https://www.rawstory.com/trump-bacon-wow-criticism-russia/",
    "timestamp": "2025-11-30T12:48:23Z"
  },
  {
    "title": "New NIH Process To Choose Grant Awardees Will No Longer Use Paylines",
    "description": "The National Institutes of Health has just announced that it will no longer rely on paylines to determine who gets NIH grant funding. Here's what this change might do.",
    "link": "https://www.forbes.com/sites/brucelee/2025/11/30/new-nih-process-to-choose-grant-awardees-will-no-longer-use-paylines/",
    "timestamp": "2025-11-30T12:47:12Z"
  },
  {
    "title": "Rubio and Witkoff to Meet With Ukraine Negotiators in Florida Amid Push for Peace Deal",
    "description": "Top Trump administration officials are meeting Ukrainian negotiators in Florida this weekend, pushing to broker an end to Russia's war in Ukraine and setting the stage for key talks planned this week in Moscow with Russian leader Vladimir Putin.\nThe post Rubi…",
    "link": "https://www.breitbart.com/europe/2025/11/30/rubio-and-witkoff-to-meet-with-ukraine-negotiators-amid-push-for-peace-deal/",
    "timestamp": "2025-11-30T12:46:19Z"
  },
  {
    "title": "Jack Smith's Team Knew They Might Get Sued for Secretly Seeking Senators' Phone Records",
    "description": "Emails released by Chuck Grassley and Ron Johnson reveal prosecutors weighing which members of Congress to target.",
    "link": "https://www.westernjournal.com/jack-smiths-team-knew-might-get-sued-secretly-seeking-senators-phone-records/",
    "timestamp": "2025-11-30T12:41:40Z"
  },
  {
    "title": "Sunday Morning Open Thread: C.R.E.A.M.",
    "description": "Cash Rules Everything Around Me… Probably the single best example I can think of of business type weather vanes switching against Trump. [image or embed] — Schnorkles O'Bork (@schnorkles.bsky.social) November 29, 2025 at 4:45 PM The diehards are starting to d…",
    "link": "https://balloon-juice.com/2025/11/30/sunday-morning-open-thread-c-r-e-a-m/",
    "timestamp": "2025-11-30T12:37:11Z"
  },
  {
    "title": "Netanyahu submits request for pardon during his ongoing corruption trial...",
    "description": "Israeli Prime Minister Benjamin Netanyahu has asked Israel's president for a pardon during his ongoing corruption trial. On Sunday, Netanyahu's office confirmed the request was submitted to the president's legal department. The president's office called it an…",
    "link": "https://apnews.com/article/mideast-wars-netanyahu-pardon-5dbc2461b440c8edc8d82d31650cdbe8",
    "timestamp": "2025-11-30T12:31:37Z"
  },
  {
    "title": "White House tracker calls out 'media offenders'...",
    "description": "White House tracker calls out 'media offenders'...\r\n\n \n \n \n (Second column, 9th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:How big tech creating own friendly bubble to 'win narrative battle online'...\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become …",
    "link": "https://www.dw.com/en/white-house-launches-media-bias-tracker/a-74954883",
    "timestamp": "2025-11-30T12:31:37Z"
  },
  {
    "title": "Next big battleground test: Wisconsin race that has tortured Republicans...",
    "description": "Next big battleground test: Wisconsin race that has tortured Republicans...\r\n\n \n \n \n (First column, 9th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:'Rumors were true' as another GOPer quits Congress after Greene...",
    "link": "https://www.politico.com/news/2025/11/28/battleground-election-wisconsin-supreme-court-00669758",
    "timestamp": "2025-11-30T12:31:36Z"
  },
  {
    "title": "Netanyahu requests pardon from Israeli president, after Trump letter urging clemency",
    "description": "Netanyahu requests presidential pardon while facing corruption trial, citing need to heal national divisions in unprecedented move by sitting Israeli PM.",
    "link": "https://www.foxnews.com/world/netanyahu-requests-pardon-from-israeli-president-after-trump-letter-urging-clemency",
    "timestamp": "2025-11-30T12:28:10Z"
  },
  {
    "title": "Stocks drift back toward record highs as the final month of 2025 gets underway: What to watch this week",
    "description": "As the market moves into December, investors will be watching for Fed updates and a steadier performance environment than they got in November.",
    "link": "https://finance.yahoo.com/news/stocks-drift-back-toward-record-highs-as-the-final-month-of-2025-gets-underway-what-to-watch-this-week-122743521.html",
    "timestamp": "2025-11-30T12:27:43Z"
  },
  {
    "title": "Venezuelan leader Maduro may seem desperate. But his loyalty vs punishment strategy is hard to crack",
    "description": "Venezuelan President Nicolás Maduro was once critical of English",
    "link": "https://abcnews.go.com/US/wireStory/venezuelan-leader-maduro-desperate-loyalty-punishment-strategy-hard-127977212",
    "timestamp": "2025-11-30T12:21:46Z"
  },
  {
    "title": "How to fix the broken visa system for high-skill workers",
    "description": "President Donald Trump has been walking a fine line when it comes to H-1B visas — the visa that high-skill foreign professionals apply for to work in the US. These visas often go to physicians, software developers, engineers, university professors, and other …",
    "link": "https://biztoc.com/x/f5a4d2ac1500bfeb",
    "timestamp": "2025-11-30T12:06:30Z"
  },
  {
    "title": "Witkoff to Arrive in Russia Ahead of Putin's Visit to India - Kremlin",
    "description": "MOSCOW (Sputnik) - US special envoy Steven Witkoff will arrive in Russia in the beginning of the week, ahead of Russian President Vladimir Putin's state visit to India, Kremlin spokesman Dmitry Peskov said on Sunday.",
    "link": "https://sputnikglobe.com/20251130/witkoff-to-arrive-in-russia-ahead-of-putins-visit-to-india---kremlin-1123201990.html",
    "timestamp": "2025-11-30T12:03:47Z"
  },
  {
    "title": "Venezuelan leader Maduro may seem desperate. But his loyalty vs punishment strategy is hard to crack",
    "description": "English phrases once bothered Venezuelan President Nicolás Maduro so much that he urged his State of the Union address audience to phase out words like...",
    "link": "https://www.yahoo.com/news/articles/venezuelan-leader-maduro-may-seem-120245970.html",
    "timestamp": "2025-11-30T12:02:45Z"
  },
  {
    "title": "We Dug Up Stephen Miller's Dubious Dating Advice -- And Relationship Experts Say It's Telling",
    "description": "“These influencers are grasping for a set of rules to apply in a world they were not raised to understand. \"",
    "link": "https://www.huffpost.com/entry/alpha-male-dating-advice-goog_l_692782fce4b08a35c1aeb3ca",
    "timestamp": "2025-11-30T12:00:17Z"
  },
  {
    "title": "Ukraine Says It Hit Saratov Refinery",
    "description": "Ukrainian forces say they have once again attacked Rosneft PJSC's Saratov oil refinery in Russia's Volga region.",
    "link": "https://www.rigzone.com/news/wire/ukraine_says_it_hit_saratov_refinery-30-nov-2025-182412-article/",
    "timestamp": "2025-11-30T12:00:00Z"
  },
  {
    "title": "Netanyahu submits pardon request in Israel corruption cases",
    "description": "Israeli Prime Minister Benjamin Netanyahu, on trial facing corruption charges, announced Sunday he had submitted a pardon request, saying the long-running cases were tearing the country apart. US President Donald Trump wrote to Israeli President Isaac Herzog …",
    "link": "https://www.digitaljournal.com/world/netanyahu-submits-pardon-request-in-israel-corruption-cases/article",
    "timestamp": "2025-11-30T11:57:20Z"
  },
  {
    "title": "Fed rate-cut bets surge: Can Bitcoin finally break $91K to go higher?",
    "description": "Bitcoin price stayed stuck near $91,000 due to weak ETF flows and cautious derivatives as stocks and gold rallied on rising rate-cut bets.",
    "link": "https://cointelegraph.com/news/fed-rate-cut-bets-surge-can-bitcoin-finally-break-91k-dollars",
    "timestamp": "2025-11-30T11:57:06Z"
  },
  {
    "title": "Why It Matters That Mamdani Is an Immigrant Mayor",
    "description": "It matters that the newly elected Mayor of New York, Zohran Mamdani, is an immigrant.Not just for symbolic or sentimental reasons, although those are nice. It's fitting that the city of Ellis Island and the Statue of Liberty would put an immigrant in charge. …",
    "link": "https://www.commondreams.org/opinion/mamdani-immigrant-mayor",
    "timestamp": "2025-11-30T11:56:01Z"
  },
  {
    "title": "Netanyahu officially requests pardon over corruption charges",
    "description": "The Israeli prime minister insists he is innocent, arguing the cases against him are part of an orchestrated left-wing plot against a right-wing leader.",
    "link": "https://www.politico.eu/article/benjamin-netanyahu-officially-asks-for-pardon-from-corruption-charges/",
    "timestamp": "2025-11-30T11:51:40Z"
  },
  {
    "title": "Benjamin Netanyahu seeks pardon from Israel's president",
    "description": "\"An immediate end to the trial would greatly help lower the flames and promote broad reconciliation,\" Israel's PM says.",
    "link": "https://www.bbc.com/news/articles/c4gv76r5qpvo",
    "timestamp": "2025-11-30T11:49:50Z"
  },
  {
    "title": "Binyamin Netanyahu submits request to president for pardon in corruption trial",
    "description": "Netanyahu is the only sitting prime minister in Israeli history to stand trial",
    "link": "https://www.irishtimes.com/world/middle-east/2025/11/30/binyamin-netanyahu-submits-request-to-president-for-pardon-in-corruption-trial/",
    "timestamp": "2025-11-30T11:48:13Z"
  },
  {
    "title": "Netanyahu seeks pardon from Israel's president, says corruption trial is 'tearing us apart'",
    "description": "The prime minister’s office called it an “extraordinary request” with “significant implications”.",
    "link": "https://www.thejournal.ie/netanyahu-seeks-pardon-from-israels-president-says-corruption-trial-is-tearing-us-apart-6889604-Nov2025/",
    "timestamp": "2025-11-30T11:45:56Z"
  },
  {
    "title": "Benjamin Netanyahu submits request for pardon in corruption trial",
    "description": "Israeli Prime Minister Benjamin Netanyahu has asked the president to grant him a pardon during his long-running corruption trial which has bitterly divided the country.",
    "link": "https://www.independent.ie/world-news/middle-east/benjamin-netanyahu-submits-request-for-pardon-in-corruption-trial/a1655578115.html",
    "timestamp": "2025-11-30T11:37:10Z"
  },
  {
    "title": "Truly unprecedented situation - how can you pardon a prime minister who hasn't been convicted?",
    "description": "Israeli Prime Minister Benjamin Netanyahu is arguing his long-running corruption trial is such a distraction that it is damaging the national interest and affecting his ability to govern - but what sort of precedent would a pardon set?",
    "link": "https://news.sky.com/story/truly-unprecedented-situation-how-can-you-pardon-a-prime-minister-who-hasnt-been-convicted-13477414",
    "timestamp": "2025-11-30T11:31:00Z"
  },
  {
    "title": "This grift was exploited for years by Republicans — until Trump came along",
    "description": "Donald Trump and his allies are using the long-employed tactic of demonizing a targeted population to turn public opinion against them. In carrying out ICE deportation raids on undocumented immigrants, they are using dehumanizing rhetoric to portray their tar…",
    "link": "https://www.rawstory.com/raw-investigates/ice-arrests-2674353839/",
    "timestamp": "2025-11-30T11:30:01Z"
  },
  {
    "title": "Netanyahu submits request for a pardon during his ongoing corruption trial",
    "description": "Israeli Prime Minister Benjamin Netanyahu has asked Israel's president to grant him a pardon during his long-running corruption trial that's bitterly divided the country.",
    "link": "https://www.npr.org/2025/11/30/nx-s1-5625482/netanyahu-request-pardon-corruption-trial",
    "timestamp": "2025-11-30T11:27:50Z"
  },
  {
    "title": "Israeli PM Netanyahu requests pardon in ongoing corruption trial | CNN",
    "description": "Prime Minister Benjamin Netanyahu formally requested a pardon in his long-running corruption trial, arguing it was in the “public interest.”",
    "link": "https://www.cnn.com/2025/11/30/middleeast/netanyahu-pardon-israel-president-intl",
    "timestamp": "2025-11-30T11:24:54Z"
  },
  {
    "title": "Breaking: Israeli PM Benjamin Netanyahu formally asks to be pardoned from corruption charges",
    "description": "Israeli Prime Minister Benjamin Netanyahu has formally asked for a pardon from President Isaac Herzog relating to corruption charges against him.",
    "link": "https://www.abc.net.au/news/2025-11-30/israeli-pm-benjamin-netanyahu-asks-for-pardon/106084498",
    "timestamp": "2025-11-30T11:21:56Z"
  },
  {
    "title": "Netanyahu submits request to Israeli president for a pardon during his ongoing corruption trial",
    "description": "In a statement Sunday the prime minister’s office said that Netanyahu had submitted a request for a pardon to the legal department of the Office of the President.",
    "link": "https://nypost.com/2025/11/30/world-news/netanyahu-submits-request-for-a-pardon-to-israeli-president-herzog-amid-his-ongoing-corruption-trial/",
    "timestamp": "2025-11-30T11:15:39Z"
  },
  {
    "title": "GOP voters liked Trump as the ‘antiwar’ candidate. Now they’d support an attack on Venezuela",
    "description": "A narrow, brick-sided alley runs between the Republican Party headquarters in Lackawanna County, Pennsylvania, and its parking lot. The building also served as Donald Trump’s 2024 campaign headquarters in the city of Scranton, and the alley is where I came ac…",
    "link": "https://biztoc.com/x/aedc2d4fd8eaec88",
    "timestamp": "2025-11-30T11:10:24Z"
  },
  {
    "title": "Donald Trump Has Taken Prince Harry's Crown",
    "description": "President Donald Trump's flurry of lawsuits in 2025 has filled a vacuum left by Prince Harry and Meghan Markle who previously filed more than 10 between them in three years.\nThe Duke and Duchess of Sussex were once prolific litigants and between them have sue…",
    "link": "https://biztoc.com/x/3bbedf0b1d3928a4",
    "timestamp": "2025-11-30T11:10:17Z"
  },
  {
    "title": "US seeks 'bridge' role in Turkish-Greek ties, ambassador says",
    "description": "The White House intends to act as a \"bridge\" between Türkiye and Greece to improve the relations between the two neighboring countries, U.S. Ambassador to Ankara Tom Barrack has said.",
    "link": "https://www.hurriyetdailynews.com/us-seeks-bridge-role-in-turkish-greek-ties-ambassador-says-216285",
    "timestamp": "2025-11-30T11:05:41Z"
  },
  {
    "title": "Death toll from Israel's war on Gaza surpasses 70,000: Health ministry",
    "description": "Gaza's Health Ministry says the death toll in the besieged territory has surpassed 70,000 since the beginning of Israel's genocidal war more than two years ago.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251129-presstv02.htm",
    "timestamp": "2025-11-30T11:02:35Z"
  },
  {
    "title": "Trump tries to bribe Honduran electorate to restore narco-trafficking government to power",
    "description": "US President Donald Trump has endorsed the candidate of Honduras's right-wing National Party in the upcoming presidential election and pledged to pardon the party's former president, who is serving a federal prison sentence in the US for drug trafficking.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251129-presstv07.htm",
    "timestamp": "2025-11-30T11:02:05Z"
  },
  {
    "title": "Trump Calls on All Airlines to Consider Venezuelan Airspace Closed",
    "description": "US President Donald Trump on Saturday called on all air carriers to consider the airspace above and around Venezuela closed.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251129-sputnik02.htm",
    "timestamp": "2025-11-30T11:01:30Z"
  },
  {
    "title": "US Military Planes 'Almost Constantly' Patrolling Int'l Airspace Around Venezuela - Reports",
    "description": "US military aircraft have been patrolling international airspace around Venezuela \"almost constantly\" in recent days, The Washington Post reported on Saturday, citing an unnamed US official.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251129-sputnik01.htm",
    "timestamp": "2025-11-30T11:01:27Z"
  },
  {
    "title": "Trump says Venezuela airspace 'closed in its entirety' amid threats of military action",
    "description": "US President Donald Trump says the entire airspace above Venezuela should be considered closed, further escalating tensions between the United States and the South American nation.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251129-presstv03.htm",
    "timestamp": "2025-11-30T11:01:17Z"
  },
  {
    "title": "Trump's announcement of Venezuelan airspace closure 'reckless, arbitrary': Iran",
    "description": "Iran strongly condemns the United States claim of closing Venezuela's airspace, calling it a \"blatant breach\" of international law and the principles governing civil aviation.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251129-presstv01.htm",
    "timestamp": "2025-11-30T11:01:11Z"
  },
  {
    "title": "Trump’s most original idea? Redefining antisemitism",
    "description": "With help from the Heritage Foundation, Trump is building a fascist regime by attacking free speech",
    "link": "https://www.salon.com/2025/11/30/trumps-most-original-idea-redefining-antisemitism_partner/",
    "timestamp": "2025-11-30T11:00:59Z"
  },
  {
    "title": "Rubio and Witkoff are meeting with Ukraine's negotiators in Florida as Trump pushes to broker a deal",
    "description": "Top Trump administration officials are meeting Ukrainian negotiators in Florida this weekend, pushing to broker an end to Russia's war in Ukraine.",
    "link": "https://www.npr.org/2025/11/30/nx-s1-5625473/rubio-witkoff-ukraine-negotiators-florida-deal",
    "timestamp": "2025-11-30T11:00:48Z"
  },
  {
    "title": "MAGA Republicans Side With Progressives On Key Issue",
    "description": "Populist voices in the Republican Party are growing increasingly concerned about artificial intelligence and its impact on the job market in the coming years.",
    "link": "https://www.huffpost.com/entry/donald-trump-ai-jobs_n_692617bce4b0774c10d501dd",
    "timestamp": "2025-11-30T11:00:17Z"
  },
  {
    "title": "Legalizing Cocaine Is the Only Way to End the Drug War",
    "description": "The war on drugs has failed, and Trump’s deadly boat strikes are only doubling down on decades of failed policy.\nThe post Legalizing Cocaine Is the Only Way to End the Drug War appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/11/30/legalize-cocaine-trump-boat-strikes/",
    "timestamp": "2025-11-30T11:00:00Z"
  },
  {
    "title": "Why the Gulf Monarchs Shower Trump With Gifts",
    "description": "Until now, no president had yielded to royal temptations from abroad.",
    "link": "https://www.theatlantic.com/ideas/2025/11/saudi-arabia-trump-corruption/685074/",
    "timestamp": "2025-11-30T11:00:00Z"
  },
  {
    "title": "The Undermining of the C.D.C.",
    "description": "Dhruv Khullar on the agency’s decision to caveat established policy on vaccines and autism, and other bad decisions on public health, as flu season sets in.",
    "link": "https://www.newyorker.com/magazine/2025/12/08/the-undermining-of-the-cdc",
    "timestamp": "2025-11-30T11:00:00Z"
  },
  {
    "title": "Iran to boycott World Cup draw over visa issue",
    "description": "Iran say they plan to boycott the 2026 World Cup draw in the United States next week because of the limited number of visas for their delegation.",
    "link": "https://www.bbc.com/sport/football/articles/cjrjyl5exqno?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-11-30T10:56:45Z"
  },
  {
    "title": "South Africa warns Trump's G-20 ban sets dangerous precedent as diplomatic rift widens",
    "description": "South Africa's central bank governor has cautioned that US President Donald Trump's decision to exclude the country from next year's Group of 20 meeting puts the international gathering at risk.",
    "link": "https://www.globalsecurity.org/wmd/library/news/safrica/safrica-251129-presstv01.htm",
    "timestamp": "2025-11-30T10:54:12Z"
  },
  {
    "title": "US pauses visas for Afghan passport holders, citing national security concerns",
    "description": "The US Department of State has announced a pause on visa issuance for Afghan passport holders, while the US Citizenship and Immigration Services (USCIS) has halted all asylum decisions amid so-called national security concerns.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/11/sec-251129-presstv01.htm",
    "timestamp": "2025-11-30T10:53:58Z"
  },
  {
    "title": "Popular fashion brands that filed for bankruptcy in 2025",
    "description": "Major apparel brands like Forever 21 and SSENSE face bankruptcy in 2025 as fast fashion, tariffs, and economic shifts reshape retail.",
    "link": "https://www.businessinsider.com/fashion-brands-bankruptcy-2025",
    "timestamp": "2025-11-30T10:52:13Z"
  },
  {
    "title": "Zelenskyy Ramps Up Diplomatic Efforts Amid Russian Attacks, Corruption Scandal",
    "description": "Ukrainian President Volodymyr Zelenskyy is stepping up global efforts to thrash out a peace agreement, sending a negotiating team to the United States and planning a trip to Paris himself as his government battles a corruption scandal and intensified Russian …",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/11/ukraine-251130-rferl01.htm",
    "timestamp": "2025-11-30T10:51:36Z"
  },
  {
    "title": "Netanyahu requests a pardon to end his ongoing corruption trial in Israel",
    "description": "Israeli Prime Minister Benjamin Netanyahu on Sunday asked the country’s president to grant him a pardon from corruption charges, seeking to end a long-running trial that has bitterly divided the nation.",
    "link": "https://www.bostonherald.com/2025/11/30/netanyahu-requests-a-pardon-to-end-his-ongoing-corruption-trial-in-israel/",
    "timestamp": "2025-11-30T10:50:13Z"
  },
  {
    "title": "Netanyahu requests a pardon during the Israeli prime minister’s ongoing corruption trial",
    "description": "By SAM MEDNICK TEL AVIV (AP) — Israeli Prime Minister Benjamin Netanyahu on Sunday asked the country’s president to grant him a pardon from corruption charges, seeking to end a long-running trial that has bitterly divided the nation. Netanyahu, who has been a…",
    "link": "https://www.bostonherald.com/2025/11/30/netanyahu-requests-a-pardon-during-the-israeli-prime-ministers-ongoing-corruption-trial/",
    "timestamp": "2025-11-30T10:50:13Z"
  },
  {
    "title": "OPEC+ Meets to Assess Market With Output Plans Seen Unchanged",
    "description": "OPEC+ will gather to assess global oil markets on Sunday, with the producers still on track to pause supply increases in the first quarter amid growing signs of a surplus.",
    "link": "https://financialpost.com/pmn/business-pmn/opec-meets-to-assess-market-with-output-plans-seen-unchanged",
    "timestamp": "2025-11-30T10:49:56Z"
  },
  {
    "title": "Netanyahu Requests Pardon from Israeli President After Trump Push: Report",
    "description": "The reported request comes weeks after U.S. President Donald Trump also asked Israeli President Isaac Herzog to pardon Netanyahu.",
    "link": "https://biztoc.com/x/d2af5c70ab13fc1d",
    "timestamp": "2025-11-30T10:47:55Z"
  },
  {
    "title": "Gaza death toll surpasses 70,000 amid continued Israeli attacks",
    "description": "The Palestinian death toll has surpassed 70,000 since the Israel-Hamas war began, Gaza’s Health Ministry has said, while a hospital announced that Israeli fire killed two Palestinian children in the territory's south.",
    "link": "https://www.hurriyetdailynews.com/gaza-death-toll-surpasses-70-000-amid-continued-israeli-attacks-216275",
    "timestamp": "2025-11-30T10:45:54Z"
  },
  {
    "title": "Netanyahu writes to Israeli president requesting pardon in corruption cases",
    "description": "This is a breaking news story.",
    "link": "https://www.aljazeera.com/news/2025/11/30/netanyahu-writes-to-israeli-president-requesting-pardon-in-corruption-cases",
    "timestamp": "2025-11-30T10:32:29Z"
  },
  {
    "title": "Netanyahu submits request to Pres. Herzog for pardon",
    "description": "Prime Minister Benjamin Netanyahu submitted a request for a pardon to President Isaac Herzog.",
    "link": "https://www.israelnationalnews.com/news/418578",
    "timestamp": "2025-11-30T10:31:00Z"
  },
  {
    "title": "Netanyahu submits request to Israeli president to pardon him",
    "description": "Israeli Prime Minister Benjamin Netanyahu has submitted an official request to the country's president Isaac Herzog to pardon him.",
    "link": "https://news.sky.com/story/netanyahu-submits-request-to-israeli-president-to-pardon-him-13477405",
    "timestamp": "2025-11-30T10:24:00Z"
  },
  {
    "title": "AVENGERS: ENDGAME Star Josh Brolin Talks Thanos, James Bond, And Why He Isn't Scared Of Donald Trump",
    "description": "Avengers: Infinity War and Dune star Josh Brolin has reflected on playing Thanos in the MCU. He also weighs in on Denis Villeneuve's 007 plans and offers his take on former friend President Donald Trump.",
    "link": "https://comicbookmovie.com/avengers/avengers-endgame/avengers-endgame-star-josh-brolin-talks-thanos-james-bond-and-why-he-isnt-scared-of-donald-trump-a225222",
    "timestamp": "2025-11-30T10:22:00Z"
  },
  {
    "title": "Trump’s Legacy Is in the Supreme Court’s Shaky Hands",
    "description": "Trump’s legacy is in the Supreme Court’s shaky hands. The Court is poised to restrain Trump’s second-term power grabs or entrench them for years to come. And its rulings are increasingly unpredictable.",
    "link": "http://nymag.com/intelligencer/article/trumps-legacy-is-in-the-supreme-courts-shaky-hands.html",
    "timestamp": "2025-11-30T10:00:16Z"
  },
  {
    "title": "The Rare Earth Metal Driving Tensions Between the US and China",
    "description": "Yttrium plays a critical role in everything from aircraft engines to semiconductors. China controls the vast majority of the market—and that’s not changing any time soon.",
    "link": "https://www.wired.com/story/yttrium-rare-earth-metal-china-us/",
    "timestamp": "2025-11-30T10:00:00Z"
  },
  {
    "title": "White House Launches ‘Offender Of The Week’ Site Targeting ‘Biased’ Media",
    "description": "The White House debuted a new page on its website Friday aimed at lambasting media outlets over \"fake news\" coverage of Trump administration actions.",
    "link": "https://dailycaller.com/2025/11/30/white-house-launches-offender-week-site-targeting-biased-media-fake-news/",
    "timestamp": "2025-11-30T09:57:45Z"
  },
  {
    "title": "War in Sudan: Humanitarian, fighting, control developments, November 2025",
    "description": "Sudan's army and paramilitary Rapid Support Forces eye more territory as international stakeholders push for truce.",
    "link": "https://www.aljazeera.com/news/2025/11/30/war-in-sudan-humanitarian-fighting-control-developments-november-2025",
    "timestamp": "2025-11-30T09:45:20Z"
  },
  {
    "title": "Ukraine updates: Negotiators to meet Rubio, Witkoff in US",
    "description": "As the US pushes for an end to the war in Ukraine, Kyiv's diplomats are in Florida to meet with Steve Witkoff and Marco Rubio. President Volodymyr Zelenskyy will travel to France on Monday. DW has the latest. Top Ukrainian diplomats are in Florida for talks w…",
    "link": "https://www.dw.com/en/ukraine-updates-negotiators-to-meet-rubio-witkoff-in-us/live-74956304",
    "timestamp": "2025-11-30T09:43:00Z"
  },
  {
    "title": "Does the fate of the US economy now hinge on one company?",
    "description": "As the price of almost everything has increased, and American workers’ wages have all but stalled, politicians like President Donald Trump have tried to ease our minds by telling us that the economy is “doing great” and that the stock market is booming. “Reco…",
    "link": "https://biztoc.com/x/56da7389e89b5a84",
    "timestamp": "2025-11-30T09:40:37Z"
  },
  {
    "title": "Venezuela Hits Back After Donald Trump Announces Airspace Closure",
    "description": "The U.S. has for months built up its military presence around Venezuela as it carried out a strike campaign on alleged drug boats.",
    "link": "https://biztoc.com/x/ca7747551164731a",
    "timestamp": "2025-11-30T09:40:35Z"
  },
  {
    "title": "China's factory activity extends months-long slump",
    "description": "China's factory activity shrank for an eighth straight month in November, official data showed on Sunday, suggesting the world's second-largest economy remains subdued despite a trade truce with the U.S.",
    "link": "https://www.hurriyetdailynews.com/chinas-factory-activity-extends-months-long-slump-216274",
    "timestamp": "2025-11-30T09:01:58Z"
  },
  {
    "title": "Sitdown Sunday: A TikTok couple pulled off a murder plot. Their lawyer used stupidity as a defence",
    "description": "Settle down in a comfy chair with some of the week’s best longreads.",
    "link": "https://www.thejournal.ie/sitdown-sunday-longreads-longform-49-6885360-Nov2025/",
    "timestamp": "2025-11-30T09:00:55Z"
  },
  {
    "title": "Trump sent federal troops to 'save' Chicago. The 'Midway Blitz' raids forced the Windy City to defend itself",
    "description": "After the death of MAGA activist Charlie Kirk, U.S. President Donald Trump promised \"to save Chicago\" from crime and migrants. But in the wake of violent immigration raids, Chicagoans themselves are divided over who the criminals are — and who is ultimately r…",
    "link": "https://www.cbc.ca/news/world/chicago-sanctuary-city-war-zone-9.6996046",
    "timestamp": "2025-11-30T09:00:00Z"
  },
  {
    "title": "What this surgeon from Ukraine is learning in Hamilton about treating victims of war",
    "description": "Dr. Mariia Kuzeikiv, an Ukrainian surgeon, is learning skills that could help her save lives in the war while in Hamilton, Ont.",
    "link": "https://www.cbc.ca/news/canada/hamilton/ukrainian-surgeon-in-hamilton-9.6996324",
    "timestamp": "2025-11-30T09:00:00Z"
  },
  {
    "title": "December 2025 Monthly",
    "description": "This year marks an inflection point. The re-election of Donald Trump as the US president in 2024 in part reflects an ongoing reevaluation of America’s place in the world by Americans themselves. In an idiosyncratic way, and perhaps not fully\nSummary\n- The re-…",
    "link": "https://biztoc.com/x/eca07ac5b0356d1d",
    "timestamp": "2025-11-30T08:45:02Z"
  },
  {
    "title": "Schumer accuses Trump of pushing US toward ‘foreign war’ with Venezuela",
    "description": "Schumer warns Trump's Venezuela actions push U.S. toward war without congressional approval, citing constitutional concerns over military force and oversight.",
    "link": "https://www.foxnews.com/politics/schumer-accuses-trump-pushing-us-toward-foreign-war-venezuela",
    "timestamp": "2025-11-30T08:03:20Z"
  },
  {
    "title": "Venezuela to Introduce Special Travel Measures Amid US Threats",
    "description": "MOSCOW (Sputnik) - Venezuela will introduce special measures to organize the departure and return of citizens amid US President Donald Trump's remarks about closing the airspace over the country, Venezuelan Vice President Delcy Rodriguez said on Sunday.",
    "link": "https://sputnikglobe.com/20251130/venezuela-to-introduce-special-travel-measures-amid-us-threats--1123201173.html",
    "timestamp": "2025-11-30T07:55:53Z"
  },
  {
    "title": "The US-Saudi relationship: too big to fail?",
    "description": "“Donald Trump may have cleared the high bar of uttering the most appalling remark of his presidency,” said Fred Kaplan on Slate. “Things happen,” he declared last week in response to a question about the murder of the US-based journalist Jamal Khashoggi in 20…",
    "link": "https://biztoc.com/x/2f34fce1d4a754be",
    "timestamp": "2025-11-30T07:38:30Z"
  },
  {
    "title": "China factory activity edges up in November but remains in contraction for eighth month as fading holiday demand drags services",
    "description": "The National Bureau of Statistics said the manufacturing purchasing managers index rose to 49.2, up 0.2 points from October and in line with forecasts in a Reuters poll.",
    "link": "https://www.cnbc.com/2025/11/30/china-factory-activity-edges-up-in-november-but-remains-in-contraction.html",
    "timestamp": "2025-11-30T07:33:30Z"
  },
  {
    "title": "Geopolitics: Creative conservatism should guide India’s foreign policy in an era of US–China rivalry",
    "description": "As India’s ties with the US fray and calls grow to lean towards China or other power blocs, easy answers fall apart on closer scrutiny. We should retain neutrality but also use carefully crafted creative diplomacy to build meaningful leverage with overseas pa…",
    "link": "https://www.livemint.com/opinion/online-views/geopolitics-india-foreign-policy-us-china-rivalry-america-european-union-australia-plurilateral-11764469856064.html",
    "timestamp": "2025-11-30T07:30:12Z"
  },
  {
    "title": "The US-Saudi relationship: too big to fail?",
    "description": "With the Saudis investing $1 trillion into the US, and Trump granting them ‘major non-Nato ally’ status, for now the two countries need each other",
    "link": "https://theweek.com/politics/the-us-saudi-relationship-too-big-to-fail",
    "timestamp": "2025-11-30T07:30:00Z"
  },
  {
    "title": "Trump ramps up Venezuela threats, warns airspace 'closed'",
    "description": "U.S. President Donald Trump sharply escalated his threats against Venezuela on Saturday with an ominous warning that the country's airspace should be considered \"closed,\" raising fears of imminent military action.",
    "link": "https://www.hurriyetdailynews.com/trump-ramps-up-venezuela-threats-warns-airspace-closed-216269",
    "timestamp": "2025-11-30T07:13:20Z"
  },
  {
    "title": "'Detrimental to US interests': Donald Trump justifies 'third world' migration ban amid asylum appeals; ci - Times of India",
    "description": "'Detrimental to US interests': Donald Trump justifies 'third world' migration ban amid asylum appeals; ciTimes of India An emboldened Trump escalates his anti-immigration crackdown after National Guard shootingCNN US State Department stops processing visas fo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180241559",
    "timestamp": "2025-11-30T06:52:18Z"
  }
]