[
  {
    "title": "In Republic of NYC, another America",
    "description": "Zohran Mamdani, a Ugandan-Indian Muslim, has secured the Democratic nomination for New York City's mayoral election. This marks a significant shift, potentially making him the city's first millennial mayor and a symbol of inclusivity. His focus on affordabili…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/in-republic-of-nyc-another-america/articleshow/122075624.cms",
    "timestamp": "2025-06-25T17:51:31Z"
  },
  {
    "title": "Zelensky Reveals Details of Chat with Trump at NATO Summit",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nUkrainian President Volodymyr Zelensky said Wednesday on X, formerly Twitter, that he and President Donald Trump discussed potential defense cooperation during a chat at the NATO Summit, including the joint pr…",
    "link": "https://biztoc.com/x/463a6de30cc94fbb",
    "timestamp": "2025-06-25T17:50:58Z"
  },
  {
    "title": "Trump expresses interest in rolling back the clock and bring back the ‘Department of War’",
    "description": "President Donald Trump and Defense Secretary Pete Hegseth leave at the end of a press conference during the North Atlantic Treaty Organization (NATO) summit in The Hague on June 25, 2025.",
    "link": "https://biztoc.com/x/92d9d01450183a95",
    "timestamp": "2025-06-25T17:50:51Z"
  },
  {
    "title": "CDC nominee Susan Monarez sidesteps questions about disagreements with RFK in Senate hearing",
    "description": "CDC nominee Susan Monarez says she values vaccines and rigorous scientific evidence but has largely sidestepped questions about widespread cuts to the agency and whether she disagreed with any of Health Secretary Robert F",
    "link": "https://abcnews.go.com/Health/wireStory/cdc-nominee-susan-monarez-sidesteps-questions-disagreements-rfk-123203028",
    "timestamp": "2025-06-25T17:50:47Z"
  },
  {
    "title": "Trump to Ayatollah: ‘Sure’ I’ll Blow Up Your Nuclear Program Again—if You Manage To Rebuild It",
    "description": "President Donald Trump said Wednesday he is fully prepared to authorize further strikes on Iran’s nuclear program if the hardline regime attempts to reconstitute its heavily damaged atomic infrastructure, but signaled that outcome is unlikely after American a…",
    "link": "https://freebeacon.com/national-security/trump-to-ayatollah-sure-ill-blow-up-your-nuclear-program-if-you-manage-to-rebuild-it/",
    "timestamp": "2025-06-25T17:50:44Z"
  },
  {
    "title": "Zelensky Reveals Details of Chat with Trump at NATO Summit",
    "description": "President Trump spoke with Zelensky before he left The Hague after spending less than 24 hours there for the NATO summit.",
    "link": "https://www.newsweek.com/donald-trump-zelenskyy-ukraine-nato-drones-2090712",
    "timestamp": "2025-06-25T17:48:58Z"
  },
  {
    "title": "To Europe’s relief, Trump leaves the NATO summit feeling good vibes",
    "description": "The NATO summit close a 'historic' deal on defence spending. But the real accomplishment for the allies was avoiding trouble with Trump.",
    "link": "https://www.euractiv.com/section/defence/news/to-europes-relief-trump-leaves-the-nato-summit-feeling-good-vibes/",
    "timestamp": "2025-06-25T17:48:22Z"
  },
  {
    "title": "NATO boss calls Trump ‘daddy’",
    "description": "Mark Rutte was referring to the US president’s ‘F-bomb’ rant over alleged Israel-Iran ceasefire violations Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620539-nato-rutte-calls-trump-daddy/",
    "timestamp": "2025-06-25T17:48:00Z"
  },
  {
    "title": "'I’m depressed and sad': Wall Street melts down over NYC mayoral contest upset",
    "description": "A number of Wall Street bankers, executives and hedge fund managers expressed panic and disbelief Wednesday after the upset victory\r\n of Zohran Mamdani, a self-described democratic socialist, in the New York City mayoral Democratic primary election Tuesday ni…",
    "link": "https://www.rawstory.com/zohran-mamdani-wall-street-reax/",
    "timestamp": "2025-06-25T17:47:27Z"
  },
  {
    "title": "Corporate Deal Making Made Easy: Just Give Donald Trump Personal Power To Approve All Strategic Decisions",
    "description": "Here’s a fun corporate governance puzzle for you. Suppose you’re a foreign company trying to buy an American steel producer. The previous administration blocked your deal. The current president promised during his campaign to block it too, saying he’d stop it…",
    "link": "https://www.techdirt.com/2025/06/25/corporate-deal-making-made-easy-just-give-donald-trump-personal-power-to-approve-all-strategic-decisions/",
    "timestamp": "2025-06-25T17:47:00Z"
  },
  {
    "title": "Trump administration sues Maryland court system over deportation rulings",
    "description": "The Trump government has criticised Maryland's federal judges for 'judicial overreach' in their immigration orders.",
    "link": "https://www.aljazeera.com/news/2025/6/25/trump-administration-sues-maryland-court-system-over-deportation-rulings",
    "timestamp": "2025-06-25T17:44:58Z"
  },
  {
    "title": "NATO allies pledge 5% on defense to keep US on board",
    "description": "Most NATO allies promised to ramp up defense spending and reaffirmed their \"ironclad\" commitment to mutual defense. But there are lingering concerns over the scale and scope of US engagement.",
    "link": "https://www.dw.com/en/nato-allies-pledge-5-on-defense-to-keep-us-on-board/a-73041273",
    "timestamp": "2025-06-25T17:43:00Z"
  },
  {
    "title": "Most NATO member states agree to 5% defense spending, but doubts remain over Trump's commitment to the alliance",
    "description": "Most NATO allies promised to ramp up defense spending and reaffirmed their \"ironclad\" commitment to mutual defense. But there are lingering concerns over the scale and scope of US engagement. From the perspective of European NATO allies, it all went to plan: …",
    "link": "https://www.dw.com/en/most-nato-member-states-agree-to-5-defense-spending-but-doubts-remain-over-trumps-commitment-to-the-alliance/a-73041273",
    "timestamp": "2025-06-25T17:43:00Z"
  },
  {
    "title": "NATO members step up spending, but doubts about US remain",
    "description": "Most NATO allies promised to ramp up defense spending and reaffirmed their \"ironclad\" commitment to mutual defense. But there are lingering concerns over the scale and scope of US engagement. From the perspective of European NATO allies, it all went to plan: …",
    "link": "https://www.dw.com/en/nato-members-step-up-spending-but-doubts-about-us-remain/a-73041273",
    "timestamp": "2025-06-25T17:43:00Z"
  },
  {
    "title": "NATO allies pledge 5% on defense to keep US on board",
    "description": "Most NATO allies promised to ramp up defense spending and reaffirmed their \"ironclad\" commitment to mutual defense. But there are lingering concerns over the scale and scope of US engagement. From the perspective of European NATO allies, it all went to plan: …",
    "link": "https://www.dw.com/en/nato-allies-pledge-5-on-defense-to-keep-us-on-board/a-73041273",
    "timestamp": "2025-06-25T17:43:00Z"
  },
  {
    "title": "Diesel prices spike as global tensions rise | ELP out-of-service enforcement in effect",
    "description": "As crude oil prices climbed through June, so did diesel prices in the U.S., as prices went from a nearly four-year low at the beginning of the month to a 11-month high over 3 weeks. Plus: ELP OOS orders in effect, more news.",
    "link": "https://www.overdriveonline.com/business/article/15749337/diesel-jumps-20-cents-in-a-week-amid-middle-east-unrest",
    "timestamp": "2025-06-25T17:42:38Z"
  },
  {
    "title": "Change in US crypto laws may affect charges in Do Kwon’s criminal case",
    "description": "In a status conference for Terraform Labs’ Do Kwon in federal court, Judge Paul Engelmayer suggested that at least one crypto bill being considered in Congress could impact the case.",
    "link": "https://cointelegraph.com/news/us-crypto-laws-do-kwon-charges",
    "timestamp": "2025-06-25T17:41:11Z"
  },
  {
    "title": "Jeff Bezos Wedding Plans Disrupted After Protesters Threaten to Fill Venice Canals With Inflatable Crocodiles",
    "description": "Guests are rumored to include Elon Musk, Oprah Winfrey, and Ivanka Trump.",
    "link": "https://gizmodo.com/jeff-bezos-wedding-plans-disrupted-after-protesters-threaten-to-fill-venice-canals-with-inflatable-crocodiles-2000620215",
    "timestamp": "2025-06-25T17:40:59Z"
  },
  {
    "title": "S&P 500 Rally Hits a Wall Near Its All-Time Highs: Markets Wrap",
    "description": "Wall Street’s torrid rebound from April’s meltdown is showing some signs of exhaustion on speculation stocks have run too far amid economic and geopolitical risks. Longer-term Treasuries underperformed. Oil bounced from the biggest two-day decline since 2022.",
    "link": "https://financialpost.com/pmn/business-pmn/sp-500-rally-hits-a-wall-near-its-all-time-highs-markets-wrap",
    "timestamp": "2025-06-25T17:40:34Z"
  },
  {
    "title": "‘Big win’: Leftists abandon perverted trans demands at Christian camp for children",
    "description": "Apparently have learned from earlier court disasters that cost taxpayers millions, and state officials now quickly settle fight over their agenda to impose LGBT beliefs on faith groups serving kids, and everyone else",
    "link": "https://www.wnd.com/2025/06/big-win-leftists-abandon-perverted-trans-demands-christian/",
    "timestamp": "2025-06-25T17:40:19Z"
  },
  {
    "title": "Trump threatens tough trade deal for Spain after it refuses to meet NATO defense spending target",
    "description": "U.S. President Donald Trump on Wednesday said Spain's refusal to meet the NATO defense spending target of 5% of gross domestic product will mean a tougher trade deal for the southern European country. Speaking at a news conference at NATO's annual summit in t…",
    "link": "https://freerepublic.com/focus/f-news/4325246/posts",
    "timestamp": "2025-06-25T17:39:42Z"
  },
  {
    "title": "12-Day War Shows Trump Is Not a Warmonger",
    "description": "WASHINGTON—President Donald Trump does not want to be a wartime president. He wants to be the president who, as he did at Mar-a-Lago in 2017,... Read More\nThe post 12-Day War Shows Trump Is Not a Warmonger appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/25/12-day-war-shows-trump-is-not-a-warmonger/",
    "timestamp": "2025-06-25T17:39:22Z"
  },
  {
    "title": "The stock market is surging. Will it last?",
    "description": "The stock market is surging. Will it last?go.com",
    "link": "https://abcnews.go.com/Business/stock-market-surging/story?id=123188927",
    "timestamp": "2025-06-25T17:38:54Z"
  },
  {
    "title": "Trump Official Holds Up Trump's Picture After Being Questioned Over Hundreds of Job Cuts to Her Agency",
    "description": "A top Trump administration official held up the president's picture after being questioned about the recent mass job cuts to the agency she leads.",
    "link": "https://www.ibtimes.com/trump-official-holds-trumps-picture-after-being-questioned-over-hundreds-job-cuts-her-agency-3776809",
    "timestamp": "2025-06-25T17:37:14Z"
  },
  {
    "title": "New York Mayoral Vote Floors Democratic Establishment",
    "description": "Zohran Mamdani's victory in New York City's Democratic mayoral primary is a seismic wake-up call for a party establishment out of step with younger Americans and failing to counter Donald Trump, analysts say.",
    "link": "https://www.ibtimes.com/new-york-mayoral-vote-floors-democratic-establishment-3776806",
    "timestamp": "2025-06-25T17:36:20Z"
  },
  {
    "title": "Trump ally demands 'boycott of the Republican Party' because of American Muslims",
    "description": "MAGA influencer Laura Loomer, a close ally of President Donald Trump, called for a boycott of the Republican Party over Muslims in the United States.\"I am calling on all of my followers and every GOP mega donor to do a fundraising boycott of the Republican pa…",
    "link": "https://www.rawstory.com/laura-loomer-boycott-republicans/",
    "timestamp": "2025-06-25T17:36:02Z"
  },
  {
    "title": "Trump Judicial Nominee Torched for Refusing to Answer Basic Questions",
    "description": "Emil Bove struggled to answer simple questions about his work at the Department of Justice during a hearing before the Senate Wednesday. \r\nLast month, Donald Trump nominated Bove, his former attorney, for a lifetime appointment to the Third U.S. Circuit Court…",
    "link": "https://newrepublic.com/post/197242/donald-trump-judicial-nominee-emil-bove-refuse-answer",
    "timestamp": "2025-06-25T17:34:02Z"
  },
  {
    "title": "Trump Is Just Trying to Save Face",
    "description": "It is becoming harder than ever to imagine that Iran will abandon nuclear ambitions.",
    "link": "http://foreignpolicy.com/2025/06/25/us-iran-israel-conflict-trump-strike-nuclear-program/",
    "timestamp": "2025-06-25T17:32:38Z"
  },
  {
    "title": "Amazon founder Jeff Bezos and Lauren Sanchez' $10 million wedding venue changed in Venice? New location revealed",
    "description": "Jeff Bezos and fiancée Lauren Sánchez have reportedly shifted the venue of their much-hyped Venice wedding due to the fear of protests. Over 200 guests are expected to attend the high-profile and star studded wedding which has been facing major roadblocks due…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/amazon-founder-jeff-bezos-and-lauren-sanchez-10-million-wedding-venue-changed-in-venice-new-location-revealed/articleshow/122075287.cms",
    "timestamp": "2025-06-25T17:31:47Z"
  },
  {
    "title": "Lauren Boebert Praises 'Tiger King' Joe Exotic As He Seeks Pardon",
    "description": "The Colorado congresswoman said she has a \"heartened sentiment of Joe.\"",
    "link": "https://www.newsweek.com/lauren-boebert-joe-exotic-tiger-king-pardon-2090660",
    "timestamp": "2025-06-25T17:31:46Z"
  },
  {
    "title": "Trump says he's already considering '3 or 4 people' to replace Powell at Fed",
    "description": "President Donald Trump said he's already looking for a new Fed chair to replace Jerome Powell and has narrowed his search to '3 or 4 people'",
    "link": "https://www.usatoday.com/story/money/2025/06/25/trump-replace-powell-fed/84353474007/",
    "timestamp": "2025-06-25T17:30:48Z"
  },
  {
    "title": "When fake news is dead serious",
    "description": "Satirical news sites like The Onion are doing the work that legitimate publications won't by taking an actual stand",
    "link": "https://www.salon.com/2025/06/25/when-fake-news-is-dead-serious/",
    "timestamp": "2025-06-25T17:30:24Z"
  },
  {
    "title": "Israel and Iran Commit Ceasefire Violations",
    "description": "This didn't come as a big surprise to many, but shortly after officially agreeing to a ceasefire agreement, West Jerusalem accused Tehran of firing more missiles at Israeli territory and promised a harsh response. Iran has denied attacking Israel since it agr…",
    "link": "https://www.shtfplan.com/headline-news/israel-and-iran-commit-ceasefire-violations",
    "timestamp": "2025-06-25T17:30:23Z"
  },
  {
    "title": "President Trump Announces Appointments to the Homeland Security Advisory Council [Levin, Giuliani, Lewandowski included, among others]",
    "description": "President Donald J. Trump and Secretary Noem appointed new members to the Homeland Security Advisory Council (HSAC) and announced the date of the council’s first meeting. Formed on March 19, 2002, the HSAC leverages the experience, expertise, and national and…",
    "link": "https://freerepublic.com/focus/f-news/4325243/posts",
    "timestamp": "2025-06-25T17:29:11Z"
  },
  {
    "title": "Nolte: FBI Investigating 3 Children’s Hospitals for Child Mutilation",
    "description": "The FBI is investigating three children’s hospitals for allegedly performing illegal female genital mutilations.\nThe post Nolte: FBI Investigating 3 Children’s Hospitals for Child Mutilation appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/25/nolte-fbi-investigating-3-childrens-hospitals-child-mutilation/",
    "timestamp": "2025-06-25T17:29:10Z"
  },
  {
    "title": "‘They realize I’m serious’: Inside Ron Johnson’s megabill talks with the White House",
    "description": "Sen. Ron Johnson said Wednesday he’s not ready to support Donald Trump’s signature domestic policy bill. But the Wisconsin Republican said that the White House, including the president himself, is helping to move him closer to yes. \nJohnson shared details of …",
    "link": "https://biztoc.com/x/66a6f0333ffade42",
    "timestamp": "2025-06-25T17:28:52Z"
  },
  {
    "title": "Trump said to restrict classified info sharing",
    "description": "United States President Donald Trump is looking to limit the sharing of classified information with Congress, Axios reported on Wednesday, citing sources briefed on the matter.The move comes after Def...",
    "link": "https://biztoc.com/x/a0117b43ce32dd2d",
    "timestamp": "2025-06-25T17:28:46Z"
  },
  {
    "title": "Fed’s Powell repeats warning about tariffs as some GOP senators accuse him of bias",
    "description": "Powell said that consumers will likely have to shoulder some of the cost of the import taxes.",
    "link": "https://www.bostonherald.com/2025/06/25/fed-jerome-powell-tariffs/",
    "timestamp": "2025-06-25T17:28:34Z"
  },
  {
    "title": "Trump repeats claim that he stopped war between India and Pakistan",
    "description": "Donald Trump claims he prevented a war between India and Pakistan. He says he used the threat of halting trade deals to de-escalate tensions. Trump mentions phone calls with leaders from both nations. He also notes a meeting with Pakistan's Army Chief. India …",
    "link": "https://economictimes.indiatimes.com/news/india/trump-repeats-claim-that-he-stopped-war-between-india-and-pakistan/articleshow/122075278.cms",
    "timestamp": "2025-06-25T17:28:24Z"
  },
  {
    "title": "Why the US just can’t quit Middle East wars",
    "description": "In April 1980, President Jimmy Carter authorized Operation Eagle Claw, an ill-fated military operation to rescue the American hostages held at the US embassy in Iran. Since then, every US president has ordered at least one — usually more than one — military i…",
    "link": "https://www.vox.com/world-politics/417710/mideast-wars-trump-iran",
    "timestamp": "2025-06-25T17:27:50Z"
  },
  {
    "title": "Dozens of US Citizens Were Deported by ICE Before Trump Started His Second Term: Report",
    "description": "The Government Accountability Office, a watchdog group, found that U.S. citizens have been deported since at least 2015, and were detained as early as 2002.",
    "link": "https://www.ibtimes.com/dozens-us-citizens-were-deported-ice-before-trump-started-his-second-term-report-3776805",
    "timestamp": "2025-06-25T17:26:14Z"
  },
  {
    "title": "Trump says US would protect NATO allies, recognizing that 'they love their countries'",
    "description": "NATO's annual summit highlighted the significance of Article 5, the alliance's collective security guarantee. While President Trump previously questioned its automatic application, he now seems to affirm the U.S. commitment to defending allies. Article 5, inv…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-us-would-protect-nato-allies-recognizing-that-they-love-their-countries/articleshow/122075226.cms",
    "timestamp": "2025-06-25T17:24:17Z"
  },
  {
    "title": "OOPS? -- Los Angeles TV Station Updates Story that Falsely Accused Border Patrol of Abusing Landscaper",
    "description": "A Los Angeles CW network affiliate had to update a news story that falsely accused Border Patrol agents of abusing a man working as a landscaper in Santa Ana, California, on Saturday. The update followed Department of Homeland Security officials posting a vid…",
    "link": "https://www.breitbart.com/border/2025/06/25/oops-los-angeles-tv-station-updates-story-that-falsely-accused-border-patrol-of-abusing-landscaper/",
    "timestamp": "2025-06-25T17:24:09Z"
  },
  {
    "title": "Amid immigrant arrests, California bishop urges leaders: ‘Cease these tactics immediately’",
    "description": "Bishop Alberto Rojas of San Bernardino. / Credit: Diocese of San Bernardino/Screenshot\n\nCNA Staff, Jun 25, 2025 / 13:24 pm (CNA).\nBishop Alberto Rojas of San Bernardino, California, on Tuesday urged authorities to cease their aggressive arrests of immigrants …",
    "link": "https://www.catholicnewsagency.com/news/264997/amid-immigrant-arrests-california-bishop-urges-leaders-cease-these-tactics-immediately",
    "timestamp": "2025-06-25T17:24:00Z"
  },
  {
    "title": "Trump Cooks NATO Freeloaders Spain: If They Won’t Pay For Defence, They’ll Pay Double Tariffs",
    "description": "“Terrible” socialist Spain was the sole NATO member to refuse a major increase in defence spending this week, leaving President Donald Trump threatening tariffs in return. Spain will end up paying more, all told, for the dogged refusal of its government to ac…",
    "link": "https://freerepublic.com/focus/f-bloggers/4325242/posts",
    "timestamp": "2025-06-25T17:23:39Z"
  },
  {
    "title": "NJ Dem Rep. LaMonica McIver pleads not guilty to assault charges after chaotic visit to Newark immigration center",
    "description": "Rep. LaMonica McIver pleaded not guilty Wednesday to federal charges accusing her of assaulting and interfering with immigration officers outside a New Jersey detention center.",
    "link": "https://nypost.com/2025/06/25/us-news/nj-dem-rep-lamonica-mciver-pleads-not-guilty-to-assault-charges-after-chaotic-visit-to-newark-immigration-center/",
    "timestamp": "2025-06-25T17:23:23Z"
  },
  {
    "title": "MAGA Rages Over 'Anarchist-Socialist' Candidate Winning Democratic NYC Mayor Nominee: 'Truly Makes Me Sick'",
    "description": "Supporters of President Donald Trump are expressing anger and frustration at mayoral candidate Zohran Mamdani winning New York City's Democratic mayoral primary, securing his nomination as the Democratic candidate.",
    "link": "https://www.ibtimes.com/maga-rages-over-anarchist-socialist-candidate-winning-democratic-nyc-mayor-nominee-truly-makes-3776804",
    "timestamp": "2025-06-25T17:23:14Z"
  },
  {
    "title": "Ex-Biden aide Neera Tanden tells Oversight Committee she was authorized to use autopen",
    "description": "A top former aide to former President Joe Biden testified behind closed doors Tuesday for more than four hours as part of the House Oversight Committee’s investigation into his mental fitness to serve and his White House’s use of an autopen, confirming she wa…",
    "link": "https://freerepublic.com/focus/f-news/4325241/posts",
    "timestamp": "2025-06-25T17:22:15Z"
  },
  {
    "title": "Claims Biden unfroze $16 billion for Iran are missing context",
    "description": "Posts about the money resurfaced as the U.S. entered a conflict between Iran and Israel in June 2025.",
    "link": "https://www.snopes.com//fact-check/biden-unfreeze-16-billion-iran/",
    "timestamp": "2025-06-25T17:22:00Z"
  },
  {
    "title": "California found in violation of Title IX in clash over transgender athletes",
    "description": "It’s the latest escalation in the Republican administration’s effort to bar transgender athletes from women’s sports teams nationwide.",
    "link": "https://www.ocregister.com/2025/06/25/california-trump-transgender-athletes/",
    "timestamp": "2025-06-25T17:21:52Z"
  },
  {
    "title": "Why the IMF’s Loan to Argentina Is a Scandal",
    "description": "The Trump-Milei political alliance indicates the need for the International Monetary Fund’s reform.",
    "link": "http://foreignpolicy.com/2025/06/25/imf-argentina-us-milei-trump-loan-reform/",
    "timestamp": "2025-06-25T17:20:57Z"
  },
  {
    "title": "Trump’s Christian Faith Questioned As He Didn't Say ‘Fudge’",
    "description": "WASHINGTON, D.C. — Donald Trump's devout Christian faith is being called into question following an interaction with the press where he used a curse word instead of saying &#34;fudge.&#34;",
    "link": "https://babylonbee.com/news/trumps-christian-faith-questioned-as-he-didnt-say-fudge",
    "timestamp": "2025-06-25T17:18:17Z"
  },
  {
    "title": "Trump defends U.S. ‘devastating attack’ on Iran days after an intelligence assessment called it only a mild setback",
    "description": "President Donald Trump insisted Wednesday that U.S. strikes delivered a crushing blow to Iran’s nuclear program despite a preliminary American intelligence assessment suggesting that the assault inflicted only a marginal setback.\n“This was a devastating attac…",
    "link": "https://biztoc.com/x/5a498f0a10a3dcea",
    "timestamp": "2025-06-25T17:17:41Z"
  },
  {
    "title": "'Ridiculous!' CNN host defends rival network after Trump's brutal take down",
    "description": "CNN's Dana Bash defended a rival network on \"Inside Politics\" after President Donald Trump used his platform at Tuesday's NATO summit to admonish the news media for reporting on an initial intelligence assessment of his strikes on Iran.Bash recounted the earl…",
    "link": "https://www.rawstory.com/trump-iran-2672435158/",
    "timestamp": "2025-06-25T17:17:24Z"
  },
  {
    "title": "California found in violation of Title IX in clash with Trump officials over transgender athletes",
    "description": "It’s the latest escalation in the Republican administration’s effort to bar transgender athletes from women’s sports teams nationwide.",
    "link": "https://www.bostonherald.com/2025/06/25/california-trump-transgender-athletes/",
    "timestamp": "2025-06-25T17:16:46Z"
  },
  {
    "title": "‘BAD AND SICK PEOPLE’: Trump Goes OFF on CNN and The New York Times for ‘Cheating Again!’",
    "description": "President Donald Trump denounced the \"BAD AND SICK PEOPLE\" at CNN and The New York Times on Truth Social Wednesday afternoon.\nThe post ‘BAD AND SICK PEOPLE’: Trump Goes OFF on CNN and The New York Times for ‘Cheating Again!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/bad-and-sick-people-trump-goes-off-on-cnn-and-the-new-york-times-for-cheating-again/",
    "timestamp": "2025-06-25T17:15:28Z"
  },
  {
    "title": "Zohran Mamdani's People-Powered Win Is a Rebuke to Democrat Cowardice",
    "description": "Providing an alternative to establishment politics and an increasingly right-leaning party made all the difference for Mamdani, argues politics editor Lex McMenamin.",
    "link": "https://www.teenvogue.com/story/zohran-mamdanis-people-powered-win-is-a-rebuke-to-democrat-cowardice",
    "timestamp": "2025-06-25T17:14:54Z"
  },
  {
    "title": "Israel Orders Reopening of Biggest Gas Field After Ceasefire",
    "description": "Israel ordered the resumption of production at its biggest natural gas field following a truce with Iran, setting the stage for higher exports to Egypt.",
    "link": "https://financialpost.com/pmn/business-pmn/israel-orders-reopening-of-biggest-gas-field-after-ceasefire",
    "timestamp": "2025-06-25T17:14:39Z"
  },
  {
    "title": "Trump makes bizarre World War II comparison after controversial decision - NJ.com",
    "description": "Trump makes bizarre World War II comparison after controversial decisionNJ.com Trump: After Iran truce breach, 52 Israeli jets were en route before strike was abortedYnetnews President Trump’s Full Remarks at NATO Summit Press Conferencekurdistan24.net Trump …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178177288",
    "timestamp": "2025-06-25T17:14:37Z"
  },
  {
    "title": "Tucker Carlson: Murdoch urged me to run against Trump right after axing my show",
    "description": "Commentator revealed that just weeks after being unceremoniously fired from Fox News in April 2023, the Murdoch family approached him with a chilling proposition",
    "link": "https://www.wnd.com/2025/06/tucker-carlson-murdoch-urged-me-run-against-trump/",
    "timestamp": "2025-06-25T17:14:17Z"
  },
  {
    "title": "Ivanka Trump, Jared Kusher Make Splash Ahead of Jeff Bezos' Wedding",
    "description": "Ivanka Trump and Jared Kushner are ready to live la dolce vita.\nAfter all, the eldest daughter of President Donald Trump and her husband touched down in Italy for Jeff Bezos and Lauren Sánchez’s...",
    "link": "https://www.eonline.com/news/1419130/ivanka-trump-jared-kushner-in-italy-for-jeff-bezos-lauren-sanchez-wedding",
    "timestamp": "2025-06-25T17:13:33Z"
  },
  {
    "title": "Pam Bondi Fires Back At Jack Reed Who Says She’s ‘Not Doing Anything’ To Stop Mexican Gangs From Getting US Guns",
    "description": "Pam Bondi fired back at Jack Reed for saying she is not taking action to prevent Mexican gangs from acquiring American weaponry.",
    "link": "https://dailycaller.com/2025/06/25/pam-bondi-fires-back-dem-senator-not-doing-anything-stop-mexican-gangs-us-guns/",
    "timestamp": "2025-06-25T17:12:26Z"
  },
  {
    "title": "NATO commits to major defence spending hike sought by Trump",
    "description": "The bloc agrees to boost spending to 5% of GDP, but Spain, Belgium and Slovakia say they will struggle to meet target.",
    "link": "https://www.aljazeera.com/news/2025/6/25/nato-commits-to-major-defence-spending-hike-sought-by-trump",
    "timestamp": "2025-06-25T17:12:05Z"
  },
  {
    "title": "What Democrats Can Learn from Zohran Mamdani—and Andrew Cuomo",
    "description": "The young progressive triumphed over a deeply flawed establishment rival not only by running a more dynamic campaign, but by offering Democratic voters an ambitious vision to improve their lives.",
    "link": "https://www.vanityfair.com/news/story/what-democrats-can-learn-from-zohran-mamdani-and-andrew-cuomo",
    "timestamp": "2025-06-25T17:11:16Z"
  },
  {
    "title": "Trump Makes NATO Call Him ‘Daddy’",
    "description": "President Donald Trump said on Wednesday that Mark Rutte, the Secretary General of NATO, called him \"daddy\" as a way to show his affection.",
    "link": "https://dailycaller.com/2025/06/25/trump-nato-daddy-mark-rutte/",
    "timestamp": "2025-06-25T17:10:28Z"
  },
  {
    "title": "'He is cracking': Analyst claims evangelicals are pushing Trump over the edge",
    "description": "You can blame Donald Trump's decision to drop an f-bomb on live TV Tuesday morning on evangelical Christians who have him over a barrel because he needs their support for all of his policies.That is the opinion of Salon columnist Amanda Marcotte who wrote on …",
    "link": "https://www.rawstory.com/trump-end-times-salon-f/",
    "timestamp": "2025-06-25T17:10:15Z"
  },
  {
    "title": "Trump defends U.S. ‘devastating attack’ on Iran days after an intelligence assessment called it only a mild setback",
    "description": "“This was a devastating attack, and it knocked them for a loop,” Trump said, claiming Iran’s nuclear program was “completely and fully obliterated.”",
    "link": "https://fortune.com/article/donald-trump-iran-strike-devastating/",
    "timestamp": "2025-06-25T17:09:09Z"
  },
  {
    "title": "Trump Crashes Out Over Leaked Iran Strike Report: 'Scum... Scum... Scum... Scum'",
    "description": "Donald Trump, Marco Rubio and Pete Hegseth got defensive over a report that undermined the severity of the U.S airstrike on three Iranian nuclear facilities.",
    "link": "https://www.huffpost.com/entry/trump-iran-leak-scum_n_685c16f9e4b0c3bb7b656775",
    "timestamp": "2025-06-25T17:08:29Z"
  },
  {
    "title": "Trump signals easing of ‘maximum pressure’ on Iran",
    "description": "US President Donald Trump said Washington would hold fresh talks with Iran next week, though he doesn’t believe a nuclear deal is necessary after the weekend’s strikes on enrichment facilities.\nSpeaking at the NATO summit in the Netherlands on Wednesday, Trum…",
    "link": "https://biztoc.com/x/0cdecb28df531ebd",
    "timestamp": "2025-06-25T17:06:41Z"
  },
  {
    "title": "Trump DHS sues entire bench of federal judges in Maryland district court over automatic injunctions",
    "description": "The Trump administration files lawsuit against all 15 Maryland federal judges, challenging court policy that temporarily blocks deportations of immigrants filing habeas corpus petitions.",
    "link": "https://www.foxnews.com/politics/trump-dhs-sues-entire-bench-federal-judges-maryland-district-court-over-automatic-injunctions",
    "timestamp": "2025-06-25T17:05:24Z"
  },
  {
    "title": "WATCH: NATO chief calls Trump ‘Daddy.’ Hear the president’s response",
    "description": "The remark clearly cracked up his defense secretary and secretary of state who were both standing behind him",
    "link": "https://www.wnd.com/2025/06/watch-nato-chief-calls-trump-daddy-hear-presidents/",
    "timestamp": "2025-06-25T17:05:06Z"
  },
  {
    "title": "Trump Blasts CNN Report: Intelligence Shows Fordow Was 'Obliterated'",
    "description": "President Donald Trump said Wednesday that additional intelligence indicates the Iranian nuclear site, Fordow, is \"obliterated,\" contrary to a CNN report.\nThe post Trump Blasts CNN Report: Intelligence Shows Fordow Was ‘Obliterated’ appeared first on Breitbar…",
    "link": "https://www.breitbart.com/politics/2025/06/25/trump-blasts-cnn-report-intelligence-shows-fordow-was-obliterated/",
    "timestamp": "2025-06-25T17:03:59Z"
  },
  {
    "title": "US stocks mixed as Middle East tensions ease; Fed's Powell in focus",
    "description": "Wall Street experienced a mixed performance as investors monitored developments in the Middle East and analyzed Federal Reserve Chair Jerome Powell's testimony. While ceasefire optimism boosted risk sentiment, Powell's remarks on potential tariff-induced infl…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-mixed-as-middle-east-tensions-ease-feds-powell-in-focus/articleshow/122074983.cms",
    "timestamp": "2025-06-25T17:02:17Z"
  },
  {
    "title": "'Cheating again!' Trump lobs attacks at two 'bad and sick' media outlets",
    "description": "The New York Times and CNN are still catching President Donald Trump’s ire, as he raged at both news outlets on Truth Social. “We just caught the Failing New York Times, working with Fake News CNN, cheating again!” Trump erupted. “They tried to demean the gre…",
    "link": "https://www.rawstory.com/trump-2672435249/",
    "timestamp": "2025-06-25T17:01:49Z"
  },
  {
    "title": "6/25: CBS Mornings Plus",
    "description": "With tensions still high in the region, President Donald Trump joins NATO allies in Europe as uncertainty lingers over the Iran-Israel ceasefire. Also, how \"18 Months\" tells a story of love, fate and fatherhood.",
    "link": "https://www.cbsnews.com/video/062525-cbs-mornings-plus/",
    "timestamp": "2025-06-25T17:00:20Z"
  },
  {
    "title": "Media Insider podcast: Heather du Plessis-Allan on Jacinda Ardern, Christopher Luxon and her future broadcasting aspirations",
    "description": "And does the broadcaster of the year want to one day be Newstalk ZB breakfast host?",
    "link": "https://www.nzherald.co.nz/business/media-insider/media-insider-podcast-heather-du-plessis-allan-on-jacinda-ardern-christopher-luxon-and-her-future-broadcasting-aspirations/YWJB7VDZWNFUFOBGPJWP2LFLDA/",
    "timestamp": "2025-06-25T17:00:00Z"
  },
  {
    "title": "Department of Labor Suspends Protections for H-2A Guest Workers and Announces Plan to Bring in More",
    "description": "June 25, 2025 – The Department of Labor (DOL) will no longer enforce a 2024 rule that expanded protections for guest workers who come to the U.S. to work on farms through the H-2A program. At the same time, Labor Secretary Lori Chavez-DeRemer announced she’ll…",
    "link": "https://civileats.com/2025/06/25/department-of-labor-suspends-protections-for-h-2a-guest-workers-and-announces-plan-to-bring-in-more/",
    "timestamp": "2025-06-25T16:59:03Z"
  },
  {
    "title": "Will NY Dems Choose Disgraced Figures of the Past or a Zohran Mamdani Future?",
    "description": "The party has a choice between boosting a candidate who vows to freeze the rent and resurrecting the careers of Eric Adams or Andrew Cuomo.\nThe post Will NY Dems Choose Disgraced Figures of the Past or a Zohran Mamdani Future? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/25/zohran-mamdani-andrew-cuomo-eric-adams-nyc-mayor/",
    "timestamp": "2025-06-25T16:58:11Z"
  },
  {
    "title": "Trump expresses interest in rolling back the clock and bring back the ‘Department of War’",
    "description": "Would Donald Trump change the \"Department of Defense\" back to the \"Department of War\"? The Republican president sounds increasingly serious about the idea.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-expresses-interest-rolling-back-clock-bring-back-department-war-rcna215029",
    "timestamp": "2025-06-25T16:57:45Z"
  },
  {
    "title": "Sidelined Zelensky Still Gets Trump Face Time At NATO Summit",
    "description": "Ukraine's President Volodymyr Zelensky may have been left largely on the margins of NATO's summit in the Netherlands -- but he still managed to score a sit-down meeting with US President Donald Trump on Wednesday.",
    "link": "https://www.ibtimes.com/sidelined-zelensky-still-gets-trump-face-time-nato-summit-3776802",
    "timestamp": "2025-06-25T16:57:29Z"
  },
  {
    "title": "Trump considers more Patriots for Ukraine, says Putin \"has to end\" the war",
    "description": "THE HAGUE (Reuters) -U.S. President Donald Trump indicated on Wednesday he will consider providing more of the Patriot missiles that Ukraine needs to defend against mounting Russian strikes, adding that Russian President Vladimir Putin \"really has to end that…",
    "link": "https://www.thestar.com.my/news/world/2025/06/26/trump-considers-more-patriots-for-ukraine-says-putin-has-to-end-the-war",
    "timestamp": "2025-06-25T16:57:00Z"
  },
  {
    "title": "Iranian Immigrant Detained By ICE Is a Trump Supporter, Wife Says",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe heavily pregnant wife of an ex-Iranian army soldier detained by federal immigration agents has told Newsweek her husband supports President Donald Trump and that he never tried to hide is military service.…",
    "link": "https://biztoc.com/x/26155e2ba7c3078a",
    "timestamp": "2025-06-25T16:55:42Z"
  },
  {
    "title": "Donald Trump's Chances of Winning Nobel Peace Prize Skyrocket",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe odds on President Trump winning the 2025 Nobel Peace Prize have improved dramatically since his administration negotiated a ceasefire in the Israel-Iran conflict that went into effect on Tuesday, according…",
    "link": "https://biztoc.com/x/58025f9348abcf77",
    "timestamp": "2025-06-25T16:55:38Z"
  },
  {
    "title": "Is Donald Trump making Europe great again?",
    "description": "Time is running out for American and European trade negotiators working to cut a tariff deal before a July 9 deadline set by US President Donald Trump.\nSo far, it remains unclear whether or not Trump's threat of imposing a 50% levy on nearly all European Unio…",
    "link": "https://biztoc.com/x/8a7ef477a46237f5",
    "timestamp": "2025-06-25T16:55:31Z"
  },
  {
    "title": "Stephen Sondheim’s papers go to Library of Congress, offering a look into a Broadway genius",
    "description": "The collection includes about 5,000 items.",
    "link": "https://www.bostonherald.com/2025/06/25/stephen-sondheim-library-of-congress/",
    "timestamp": "2025-06-25T16:55:09Z"
  },
  {
    "title": "Joe Rogan: Nobody would have ‘signed up’ for Trump if they knew how he would use ICE",
    "description": "Podcast personality Joe Rogan broke with President Donald Trump again over a new issue. “Bro, these ICE raids are (expletive) nuts, man,” Rogan said to two guests Luis J. Gomez and Big Jay Oakerson in a recent episode of his podcast published June 18. “I don’…",
    "link": "https://freerepublic.com/focus/f-chat/4325238/posts",
    "timestamp": "2025-06-25T16:54:48Z"
  },
  {
    "title": "Fed's Powell repeats warning about tariffs as some GOP senators accuse him of bias",
    "description": "Federal Reserve Chair Jerome Powell said Wednesday that President Donald Trump’s sweeping tariffs will likely push up inflation in the coming months, even as some Republican senators suggested the chair was biased against the duties. On the second day of his …",
    "link": "https://www.seattlepi.com/business/article/fed-s-powell-repeats-warning-about-tariffs-as-20393677.php",
    "timestamp": "2025-06-25T16:54:13Z"
  },
  {
    "title": "Shubhanshu Shukla enroute ISS, India returns to human spaceflight after 41 years; “Kamaal ki ride thi”",
    "description": "NEW DELHI: Astronaut Shubhanshu Shukla was on Wednesday headed to the International Space Station (ISS) on a historic odyssey marking India’s return to human spaceflight after a gap of 41 years following a successful launch of the Axiom Space mission in the U…",
    "link": "https://statetimes.in/shubhanshu-shukla-enroute-iss-india-returns-to-human-spaceflight-after-41-years-kamaal-ki-ride-thi/",
    "timestamp": "2025-06-25T16:53:14Z"
  },
  {
    "title": "Trump Cooks NATO Freeloaders Spain: If They Won't Pay For Defence, They'll Pay Double Tariffs",
    "description": "\"Terrible\" socialist Spain was the sole NATO member to refuse a major increase in defence spending this week.\nThe post Trump Cooks NATO Freeloaders Spain: If They Won’t Pay For Defence, They’ll Pay Double Tariffs appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/06/25/trump-cooks-nato-freeloaders-spain-if-they-wont-pay-for-defence-theyll-pay-double-tariffs/",
    "timestamp": "2025-06-25T16:51:55Z"
  },
  {
    "title": "U.S. and Iranian officials will talk next week as ceasefire holds, Trump says",
    "description": "The ceasefire gives rise to cautious hope for longer-term peace even as Tehran insisted Wednesday it will not give up its nuclear program. Iran has not acknowledged any talks taking place next week, and an Iranian official questioned whether the United States…",
    "link": "https://www.pbs.org/newshour/world/u-s-and-iranian-officials-will-talk-next-week-as-ceasefire-holds-trump-says",
    "timestamp": "2025-06-25T16:51:31Z"
  },
  {
    "title": "Warren blasts Fed chair for ‘outrageous giveaway’ to banks amid market turmoil",
    "description": "Federal Reserve Chair Jerome Powell was grilled Wednesday by Sen. Elizabeth Warren (D-MA) for what she called an “outrageous giveaway” to banks amid rising costs and stagnant wages for working-class Americans.In 2018, the Federal Reserve imposed an asset cap …",
    "link": "https://www.rawstory.com/bank-2672435003/",
    "timestamp": "2025-06-25T16:51:30Z"
  },
  {
    "title": "Rubio cracks up at Trump's reaction to NATO leader calling president 'daddy'",
    "description": "Secretary of State Rubio laughed uncontrollably as President Donald Trump responded to NATO Secretary General Rutte calling him \"daddy.\"",
    "link": "https://www.foxnews.com/politics/rubio-cracks-up-trumps-reaction-nato-leader-calling-president-daddy",
    "timestamp": "2025-06-25T16:50:33Z"
  },
  {
    "title": "Donald Trump's Chances of Winning Nobel Peace Prize Skyrocket",
    "description": "President Trump recently said he wouldn't get a Nobel Peace Prize \"no matter what I do.\"",
    "link": "https://www.newsweek.com/donald-trumps-chances-winning-nobel-peace-prize-skyrocket-2090658",
    "timestamp": "2025-06-25T16:49:53Z"
  },
  {
    "title": "Iran Backs Nuke-Free Middle East — If Israel Disarms Too",
    "description": "TEHRAN (Sputnik) - Iran stands for the Middle East free of nuclear weapons and weapons of mass destruction, provided that Israel will not have them either, Iranian President Masoud Pezeshkian said on Wednesday.",
    "link": "https://sputnikglobe.com/20250625/iran-backs-nuke-free-middle-east--if-israel-disarms-too-1122336067.html",
    "timestamp": "2025-06-25T16:49:42Z"
  },
  {
    "title": "Iranian Immigrant Detained By ICE Is a Trump Supporter, Wife Says",
    "description": "\"My husband himself even being from Iran supported Trump,\" his wife Morgan Karimi told Newsweek in an exclusive statement.",
    "link": "https://www.newsweek.com/ribvar-karimi-iran-detained-ice-trump-supporter-sniper-2090634",
    "timestamp": "2025-06-25T16:49:37Z"
  }
]