[
  {
    "title": "Maggie Haberman Calls Out Trump’s Military Parade Amid DOGE Cuts: ‘A Messaging’ And ‘Reality Problem’",
    "description": "Maggie Haberman called President Donald Trump’s planned military parade both a \"messaging\" and \"reality problem\" after all the attention around DOGE cuts.\nThe post Maggie Haberman Calls Out Trump’s Military Parade Amid DOGE Cuts: ‘A Messaging’ And ‘Reality Pr…",
    "link": "https://www.mediaite.com/media/news/maggie-haberman-calls-out-trumps-military-parade-amid-doge-cuts-a-messaging-and-reality-problem/",
    "timestamp": "2025-05-21T19:21:57Z"
  },
  {
    "title": "Trump Administration Accepts Qatar’s Jet Gift",
    "description": "President Donald Trump has said the luxury airliner will be retrofitted to serve as Air Force One during his presidency.",
    "link": "https://time.com/7287595/trump-qatar-jet-gift-air-force-one/",
    "timestamp": "2025-05-21T19:21:53Z"
  },
  {
    "title": "Trump Says Comcast CEO Brian Roberts ‘Ought to Be Investigated’ as He Trashes NBC Reporter Over Qatari Jet Question",
    "description": "\"No more questions from you,\" the president hollers at White House news correspondent Peter Alexander\nThe post Trump Says Comcast CEO Brian Roberts ‘Ought to Be Investigated’ as He Trashes NBC Reporter Over Qatari Jet Question appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-nbc-brian-roberts-qatari/",
    "timestamp": "2025-05-21T19:21:34Z"
  },
  {
    "title": "These Law Firms Should Sue Trump for Racketeering From the Oval Office",
    "description": "Extortion is a crime. But who cares, right? Trump isn’t going to prosecute himself. The good news is that he doesn’t have to.",
    "link": "https://slate.com/news-and-politics/2025/05/sue-trump-oval-office-racketeering.html",
    "timestamp": "2025-05-21T19:21:25Z"
  },
  {
    "title": "Trump Says He Only Wants To Help Red States, But He's Not Doing That, Either",
    "description": "To be fair, they probably won't notice.",
    "link": "https://www.wonkette.com/p/trump-says-he-only-wants-to-help",
    "timestamp": "2025-05-21T19:21:06Z"
  },
  {
    "title": "Democrats’ Pro-Illegal Deception Campaign Has Hardly Made A Dent With Ordinary Americans",
    "description": "Americans have changed very little on their overall desire to see illegal migrants removed from the United States, according to a newly released survey.",
    "link": "https://dailycaller.com/2025/05/21/americans-favor-deporting-illegal-migrants/",
    "timestamp": "2025-05-21T19:19:44Z"
  },
  {
    "title": "What is the Golden Dome and does Canada want to be part of it like Trump says?",
    "description": "U.S. President Donald Trump is ready to proceed with his ambitious Golden Dome air defence system and says Canada wants to be part of it.",
    "link": "https://nationalpost.com/news/canada/golden-dome-canada-donald-trump",
    "timestamp": "2025-05-21T19:19:37Z"
  },
  {
    "title": "‘Shocking deception’: Venezuelan minor enrolled in U.S. high school is actually an illegal migrant adult father",
    "description": "'The driver's license had a birthdate of March 27, 2001'",
    "link": "https://www.wnd.com/2025/05/shocking-deception-venezuelan-minor-enrolled-in-u-s-high-school-is-actually-an-illegal-migrant-adult-father/",
    "timestamp": "2025-05-21T19:19:13Z"
  },
  {
    "title": "Here's what to expect at the Army's 250th anniversary parade on Trump's birthday",
    "description": "The Army has started loading up some of the tanks that will take to the streets of the nation’s capital during the 250th anniversary celebration of the service next month",
    "link": "https://abcnews.go.com/Politics/wireStory/expect-armys-250th-anniversary-parade-trumps-birthday-122046665",
    "timestamp": "2025-05-21T19:18:28Z"
  },
  {
    "title": "How China's Online Army Helped Beijing Fight US Tariff War",
    "description": "A social network analysis firm says it uncovered over 1,000 fake X accounts seeking to influence public opinion on Trump's tariffs.",
    "link": "https://www.newsweek.com/china-social-media-accounts-us-trade-tariff-war-2075261",
    "timestamp": "2025-05-21T19:17:52Z"
  },
  {
    "title": "South Africa's Julius Malema Responds to Trump's Claim of 'Genocide' by Doubling Down: 'Kill the Farmer!'",
    "description": "South African politician Julius Malema, the leader of the radical Economic Freedom Fighters (EFF) party, responded to President Donald Trump's claims about \"genocide\" Wednesday by reiterating calls to kill white farmers.\nThe post South Africa’s Julius Malema …",
    "link": "https://www.breitbart.com/africa/2025/05/21/genocide-south-africa-julius-malema-responds-to-trump-doubles-down-kill-the-farmer-doubling-down/",
    "timestamp": "2025-05-21T19:16:08Z"
  },
  {
    "title": "Trial ends in hung jury for Helena man accused of striking sheriff",
    "description": "Skylar Dexter Ittner's trial for allegedly punching Sheriff Leo Dutton in the face at the Lewis and Clark County Fairgrounds ended in a hung jury on May 20.",
    "link": "https://helenair.com/news/local/crime-courts/article_d02aeafa-74b9-45f4-bbfa-f5f2751851e0.html",
    "timestamp": "2025-05-21T19:15:00Z"
  },
  {
    "title": "Here’s what to expect at the Army’s 250th anniversary parade on Trump’s birthday",
    "description": "The Army’s anniversary celebration is set for June 14, which coincidentally is Trump’s birthday.",
    "link": "https://www.bostonherald.com/2025/05/21/trump-military-parade-what-to-expect/",
    "timestamp": "2025-05-21T19:14:54Z"
  },
  {
    "title": "Trump Rages At 'Terrible Reporter' As Qatari Jet Question Derails South Africa Meeting",
    "description": "Events turned even more bizarre when South Africa's president quipped: “I’m sorry, I don’t have a plane to give you.”",
    "link": "https://www.huffpost.com/entry/trump-qatar-jet-south-africa_n_682e11e4e4b0c2f07d8c7b0e",
    "timestamp": "2025-05-21T19:14:17Z"
  },
  {
    "title": "Defense Department Accepts Boeing 747 From Qatar For Trump's Use",
    "description": "The Pentagon says it will \"work to ensure proper security measures\" on the aircraft.",
    "link": "https://www.huffpost.com/entry/defense-department-accepts-boeing-747-from-qatar-for-trumps-use_n_682e2274e4b05544a320173c",
    "timestamp": "2025-05-21T19:13:45Z"
  },
  {
    "title": "The FTC's Probe Into 'Potentially Illegal' Content Moderation Is a Blatant Assault on the First Amendment",
    "description": "Today is the deadline for public comments regarding a \"public inquiry\" by the Federal Trade Commission (FTC) into the \"potentially illegal\" content",
    "link": "https://reason.com/2025/05/21/the-ftcs-probe-into-potentially-illegal-content-moderation-is-a-blatant-assault-on-the-first-amendment/",
    "timestamp": "2025-05-21T19:11:56Z"
  },
  {
    "title": "'Unfettered authority': Bush-appointee smacks down Trump's illegal firings",
    "description": "A federal judge found that President Donald Trump unlawfully ousted two Democratic members of a federal privacy oversight board, Politico reported \r\nWednesday. District Court Judge Reggie Walton, an appointee of former President George W. Bush, ruled that Tru…",
    "link": "https://www.rawstory.com/trump-firing-2672182003/",
    "timestamp": "2025-05-21T19:11:09Z"
  },
  {
    "title": "Trump Vs. Springsteen Feud Escalates: Trump Posts Video Depicting Him Hitting Singer With Golf Ball",
    "description": "Trump has attacked Springsteen numerous times since the musician slammed the president as “treasonous” on stage in Manchester last week.",
    "link": "https://www.forbes.com/sites/conormurray/2025/05/21/trump-vs-springsteen-feud-escalates-trump-posts-video-depicting-him-hitting-singer-with-golf-ball/",
    "timestamp": "2025-05-21T19:10:57Z"
  },
  {
    "title": "Here Are the Worst Things in Trump’s Big, Beautiful Bill",
    "description": "During his meeting with House Republicans on Wednesday, President Donald Trump shared a crucial message: Don’t “fuck around” with Medicaid. But despite their seemingly unwavering loyalty to the president, it seems increasingly likely that GOP representatives …",
    "link": "https://newrepublic.com/article/195577/gop-threaten-millions-poor-americans",
    "timestamp": "2025-05-21T19:10:19Z"
  },
  {
    "title": "Trump illegally fired surveillance watchdog agency's Democrats, judge rules (Alfred Ng/Politico)",
    "description": "Alfred Ng / Politico:\nTrump illegally fired surveillance watchdog agency's Democrats, judge rules  —  The case could have ramifications beyond the board, extending to the rest of the Trump administration's control of independent federal agencies.  —  Presiden…",
    "link": "https://www.memeorandum.com/250521/p104",
    "timestamp": "2025-05-21T19:10:01Z"
  },
  {
    "title": "Controversial office vacant for first time in nearly a decade, but emerging secrets haunt those involved",
    "description": "It’s the first time in nearly a decade that a special counsel is not investigating a sitting or former president, but revelations of past special counsel probes continue to make news.",
    "link": "https://www.foxnews.com/politics/controversial-office-sits-vacant-first-time-nearly-decade-emerging-secrets-haunt-those-involved",
    "timestamp": "2025-05-21T19:08:07Z"
  },
  {
    "title": "Bitcoin touches record high on optimism around U.S. regulations",
    "description": "Bitcoin briefly hit an all-time high after the advancement of stablecoin legislation in the U.S. stoked hopes of regulatory clarity. Read on",
    "link": "https://financialpost.com/fp-finance/cryptocurrency/bitcoin-touches-record-high-on-optimism-around-u-s-regulations",
    "timestamp": "2025-05-21T19:07:23Z"
  },
  {
    "title": "South African President Squirms as Trump Confronts Him with Damning Anti-White Footage",
    "description": "President Donald Trump made South African President Cyril Ramaphosa visibly uncomfortable during an Oval Office Wednesday.",
    "link": "https://www.westernjournal.com/south-african-president-squirms-trump-confronts-damning-anti-white-footage/",
    "timestamp": "2025-05-21T19:06:17Z"
  },
  {
    "title": "Cuomo makes light of recent DOJ probe in NYC mayoral race ad: ‘If Trump doesn’t want me as mayor, you do’",
    "description": "New York City mayoral hopeful Andrew Cuomo wasted no time dropping a campaign ad casting himself as a bulwark to President Trump after news broke that he’s facing a Department of Justice probe. The ad released Wednesday parades a long list of Trump’s politica…",
    "link": "https://nypost.com/2025/05/21/us-news/andrew-cuomo-makes-light-of-recent-doj-probe-in-nyc-mayoral-ad/",
    "timestamp": "2025-05-21T19:05:53Z"
  },
  {
    "title": "Trump says there’s a ‘genocide’ in South Africa, but white Afrikaner farmers reject that claim",
    "description": "Both white and Black farmers and even conservative white Afrikaner groups denied the Trump administration’s “genocide” and land seizure claims that led the U.S. to cut all financial aid to South Africa.",
    "link": "https://www.pbs.org/newshour/world/trump-says-theres-a-genocide-in-south-africa-but-white-afrikaner-farmers-reject-that-claim",
    "timestamp": "2025-05-21T19:05:30Z"
  },
  {
    "title": "Trump shares video of him hitting Bruce Springsteen: All you need to know about the escalating feud",
    "description": "Donald Trump escalated his feud with Bruce Springsteen. He reshared a video depicting him hitting Springsteen with a golf ball. This action follows Springsteen's criticism of Trump's administration. Springsteen called it corrupt and incompetent. Trump retalia…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/trump-shares-video-of-him-hitting-bruce-springsteen-all-you-need-to-know-about-the-escalating-feud/articleshow/121323874.cms",
    "timestamp": "2025-05-21T19:04:36Z"
  },
  {
    "title": "Donald Trump Jr. Asked If He’ll Run For President, And The Crowd’s Response Is Telling",
    "description": "The president's eldest son weighed in on whether he’d “consider picking up the reins.”",
    "link": "https://www.huffpost.com/entry/donald-trump-junior-president_n_682e0223e4b0c95f73365fcb",
    "timestamp": "2025-05-21T19:04:11Z"
  },
  {
    "title": "Americans Don’t Lack Empathy. We Are Being Drained of It.",
    "description": "There’s a reason this Trump term has felt so emotionally devastating.",
    "link": "https://slate.com/news-and-politics/2025/05/trump-term-2-american-empathy-emotionally-draining.html",
    "timestamp": "2025-05-21T19:02:49Z"
  },
  {
    "title": "Target Is Latest Chain to Warn of Price Hikes Amid Tariff Uncertainty",
    "description": "The discount chain attributed its recent sales slump partially to tariff uncertainty, but stressed that price hikes are only one option.",
    "link": "https://www.cnet.com/personal-finance/target-is-latest-chain-to-warn-of-price-hikes-amid-tariff-uncertainty/",
    "timestamp": "2025-05-21T19:02:48Z"
  },
  {
    "title": "Tariffs, inflation and leery customers are hitting retailers in different ways",
    "description": "Retailers are sorting out how to best operate in a trade war.",
    "link": "https://www.bostonherald.com/2025/05/21/retailers-earnings/",
    "timestamp": "2025-05-21T19:02:41Z"
  },
  {
    "title": "South African-born Musk evoked by Trump during meeting with nation's leader: 'Don't want to get Elon involved'",
    "description": "President Donald Trump evoked South Africa native Elon Musk unprompted during an Oval Office meeting with President Cyril Ramaphosa, but denied the DOGE chief would play a diplomatic role.",
    "link": "https://www.foxnews.com/politics/south-african-born-musk-evoked-trump-during-meeting-nations-leader-dont-want-get-elon-involved",
    "timestamp": "2025-05-21T19:01:18Z"
  },
  {
    "title": "Bruce Springsteen Releases Live Album that Includes His Viral Speeches Trashing Trump",
    "description": "Bruce Springsteen has released a live album that includes his viral speeches in which he attacked the administration of President Donald Trump.\nThe post Bruce Springsteen Releases Live Album that Includes His Viral Speeches Trashing Trump first appeared on Me…",
    "link": "https://www.mediaite.com/media/entertainment/bruce-springsteen-releases-live-album-that-includes-his-viral-speeches-trashing-trump/",
    "timestamp": "2025-05-21T19:01:00Z"
  },
  {
    "title": "'RuPaul's Drag Race' Star Pattie Gonia Celebrates Massive Trans Flag Display at Yosemite National Park: 'Act of Resistance'",
    "description": "MTV's \"RuPaul's Drag Race\" star Pattie Gonia celebrated a group of LGBTQ activist climbers unfurling a massive transgender flag on the famous El Capitan rock formation in Yosemite National Park on Tuesday.\nThe post ‘RuPaul’s Drag Race’ Star Pattie Gonia Celeb…",
    "link": "https://www.breitbart.com/entertainment/2025/05/21/rupauls-drag-race-star-pattie-gonia-celebrates-massive-trans-flag-display-at-yosemite-national-park-act-of-resistance/",
    "timestamp": "2025-05-21T19:00:58Z"
  },
  {
    "title": "Frogger Token Positioned to Lead the Next Memecoin Run!",
    "description": "London, UK, May 21, 2025 (GLOBE NEWSWIRE) -- Frogger enters a space that has already seen great successes from frog-themed meme coins such as Pepe ($PEPE) Apu Apustaja ($APU) FWOG ($FWOG) HOPPY ($HOPPY) and many more!",
    "link": "https://www.globenewswire.com/news-release/2025/05/21/3086114/0/en/Frogger-Token-Positioned-to-Lead-the-Next-Memecoin-Run.html",
    "timestamp": "2025-05-21T19:00:00Z"
  },
  {
    "title": "Trump Hits Bruce Springsteen With Golf Ball in Fake Video",
    "description": "Donald Trump hits Bruce Springsteen with a golf ball in a fake video shared by the president.",
    "link": "http://www.billboard.com/music/music-news/trump-bruce-springsteen-golf-ball-video-1235977871/",
    "timestamp": "2025-05-21T18:57:50Z"
  },
  {
    "title": "Pentagon accepts Qatari jet to use as Air Force One",
    "description": "The Air Force is preparing to award a contract to modify the luxury jet.",
    "link": "https://www.defenseone.com/policy/2025/05/pentagon-accepts-qatari-jet-use-air-force-one/405500/",
    "timestamp": "2025-05-21T18:57:33Z"
  },
  {
    "title": "Trump confronts South African president over white farmer claims",
    "description": "Trump accuses South Africa of land seizures and targeted killings of white farmers",
    "link": "https://www.wyff4.com/article/trump-ramaphosa-south-africa-white-farmer-claims/64841612",
    "timestamp": "2025-05-21T18:56:38Z"
  },
  {
    "title": "Deion Sanders sends cryptic message calling out 'false stories'",
    "description": "Deion Sanders called out false stories on X, amid intense media focus on his coaching and his son Shedeur's surprising NFL Draft journey.",
    "link": "https://www.foxnews.com/sports/deion-sanders-sends-cryptic-message-calling-out-false-stories",
    "timestamp": "2025-05-21T18:56:11Z"
  },
  {
    "title": "The revival of an old program delegates Trump immigration enforcement to local police",
    "description": "Those agreements vastly beef up the number of immigration enforcement staff available to ICE.",
    "link": "https://www.bostonherald.com/2025/05/21/immigration-arrests-explainer/",
    "timestamp": "2025-05-21T18:54:28Z"
  },
  {
    "title": "Promising reform, Noem tells US Coast Guard Academy graduates they will lead a 'brand new' service",
    "description": "The U.S. Coast Guard is facing its largest readiness crisis since World War II",
    "link": "https://abcnews.go.com/US/wireStory/promising-reform-noem-tells-us-coast-guard-academy-122045328",
    "timestamp": "2025-05-21T18:54:13Z"
  },
  {
    "title": "Trump confronts South African president over white farmer claims",
    "description": "Trump accuses South Africa of land seizures and targeted killings of white farmers",
    "link": "https://www.wmur.com/article/trump-ramaphosa-south-africa-white-farmer-claims/64841612",
    "timestamp": "2025-05-21T18:53:33Z"
  },
  {
    "title": "Trump calls his own foreign aid cuts at USAID 'devastating'",
    "description": "WASHINGTON (Reuters) -President Donald Trump said on Wednesday that his administration's cuts to the U.S. Agency for International Development and its aid programs worldwide have been \"devastating.\" Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/22/trump-calls-his-own-foreign-aid-cuts-at-usaid-039devastating039",
    "timestamp": "2025-05-21T18:52:00Z"
  },
  {
    "title": "With Its NYSE Listing Looming, Elizabeth Warren Has Questions For JBS",
    "description": "This week’s Fresh Take also covers extreme weather in the Midwest, Trump Admin action on water pollution laws as well as new decor at the USDA.",
    "link": "https://www.forbes.com/sites/chloesorvino/2025/05/21/with-its-nyse-listing-looming-elizabeth-warren-has-questions-for-jbs/",
    "timestamp": "2025-05-21T18:51:35Z"
  },
  {
    "title": "Fact-checking Trump’s claims of white farmer ‘genocide’ in South Africa",
    "description": "White farmers have been murdered in South Africa, but those murders account for such a small percentage of the country's total and do not amount to genocide, experts say.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-trumps-claims-of-white-farmer-genocide-in-south-africa",
    "timestamp": "2025-05-21T18:51:32Z"
  },
  {
    "title": "Hidden factor that may limit rate cuts — how US could force rates higher",
    "description": "We explain the reasons for RBA governor Michele Bullock's change in plans around interest rates — and where the US fits in.",
    "link": "https://www.abc.net.au/news/2025-05-22/rates-trump-michele-bullock-inflation/105319472",
    "timestamp": "2025-05-21T18:50:41Z"
  },
  {
    "title": "U.S. CFTC's Johnson Says She'll Also Exit, Leaving an Empty House for Incoming Chair",
    "description": "The last of the sitting commissioners for the U.S. regulator that may get top oversight duties over crypto is leaving along with all of her colleagues.",
    "link": "https://www.coindesk.com/policy/2025/05/21/u-s-cftc-s-johnson-says-she-ll-also-exit-leaving-an-empty-house-for-incoming-chair",
    "timestamp": "2025-05-21T18:50:18Z"
  },
  {
    "title": "Judge says Trump administration violated court order by deporting migrants to South Sudan",
    "description": "A federal judge says the Trump administration violated a court order on deportations to third countries with a flight linked to the African nation of South Sudan.",
    "link": "https://www.pbs.org/newshour/nation/judge-says-trump-administration-violated-court-order-by-deporting-migrants-to-south-sudan",
    "timestamp": "2025-05-21T18:47:55Z"
  },
  {
    "title": "Upcoming Cato Institute Virtual Event on \"Tariffs, Emergencies, and Presidential Power\"",
    "description": "On Wednesday, May 27, 12-1 PM, the Cato Institute will hold a virtual event on \"Tariffs, Emergencies, and Presidential Power.\" Registration is free and",
    "link": "https://reason.com/volokh/2025/05/21/upcoming-cato-institute-virtual-event-on-tariffs-emergencies-and-presidential-power/",
    "timestamp": "2025-05-21T18:46:54Z"
  },
  {
    "title": "Trump’s pick for IRS chief gives oddly evasive answers on presidential targeting",
    "description": "Trump’s pick to lead the IRS refused to state that the president personally ordering an audit of an individual or organization, or that an organization’s tax-exempt status be removed, would be illegal.",
    "link": "https://www.msnbc.com/top-stories/latest/billy-long-irs-elizabeth-warren-nonprofits-tax-exempt-trump-rcna208278",
    "timestamp": "2025-05-21T18:46:42Z"
  },
  {
    "title": "Alex Thompson: Biden’s Inner Circle ‘Chose Loyalty’ to Him over the Country",
    "description": "President Donald Trump used a White House meeting to confront South African President Cyril Ramaphosa, accusing his country of failing to address the killing of white farmers. \"People are fleeing South Africa for their own safety,\" said Trump, who at one poin…",
    "link": "https://freerepublic.com/focus/f-news/4318331/posts",
    "timestamp": "2025-05-21T18:46:30Z"
  },
  {
    "title": "Trump Confronts South African President Over Killing of White Farmers",
    "description": "President Donald Trump used a White House meeting to confront South African President Cyril Ramaphosa, accusing his country of failing to address the killing of white farmers. \"People are fleeing South Africa for their own safety,\" said Trump, who at one poin…",
    "link": "https://freerepublic.com/focus/f-news/4318330/posts",
    "timestamp": "2025-05-21T18:46:30Z"
  },
  {
    "title": "‘Monstrous and barbaric’: White House responds to judge’s threat to order return of murderers, kidnappers",
    "description": "Releases criminal records that include convictions of 'lascivious acts,' robbery, homicide",
    "link": "https://www.wnd.com/2025/05/monstrous-and-barbaric-white-house-responds-to-judges-threat-to-order-return-of-murderers-kidnappers/",
    "timestamp": "2025-05-21T18:45:00Z"
  },
  {
    "title": "No Tax on Tips Act: Senate passed bill unanimously, but it doesn’t apply to all workers. Here’s everything to know",
    "description": "The Senate unanimously passed the “No Tax on Tips Act” on Tuesday, a bill that would eliminate federal taxes on tips, and that President Donald Trump made a campaign promise when running for reelection. It now goes to the House for a vote. \nIf passed, the leg…",
    "link": "https://biztoc.com/x/fe8dba19c130528c",
    "timestamp": "2025-05-21T18:44:46Z"
  },
  {
    "title": "South African President Calls Out Trump: ‘I’m Sorry I Don’t Have a Plane to Give You’",
    "description": "President Donald Trump claimed white South Africans were being systematically murdered during a meeting with President Cyril Ramaphosa.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-ramaphosa-south-africa-white-farmer-genocide-1235345116/",
    "timestamp": "2025-05-21T18:43:43Z"
  },
  {
    "title": "Trump's Golden Dome plan risks turning space into 'war zone', China says",
    "description": "Beijing has doubled down on its criticism of the US president's aerial defence plans a day after a major announcement at the White House.",
    "link": "https://www.abc.net.au/news/2025-05-22/china-says-donald-trump-golden-dome-risks-weaponising-space/105321228",
    "timestamp": "2025-05-21T18:43:15Z"
  },
  {
    "title": "Former Kennedy Center president refutes Trump's critique of 'bad management'",
    "description": "\"I am deeply troubled by the false allegations regarding the management of the Kennedy Center,\" Deborah Rutter wrote in a statement.",
    "link": "https://www.npr.org/2025/05/21/nx-s1-5405565/kennedy-center-trump-deborah-rutter",
    "timestamp": "2025-05-21T18:43:07Z"
  },
  {
    "title": "Billionaire Justin Sun To Attend Crypto Dinner With President, Says He Is ‘Top Holder’ of Trump’s Memecoin",
    "description": "Billionaire Tron (TRX) founder Justin Sun is going to attend an exclusive crypto dinner with Donald Trump after claiming he’s the top holder of the President’s memecoin. In a new thread on the social media platform X, Sun says he’s excited to join Trump for t…",
    "link": "https://dailyhodl.com/2025/05/21/billionaire-justin-sun-to-attend-crypto-dinner-with-president-says-he-is-top-holder-of-trumps-memecoin/",
    "timestamp": "2025-05-21T18:41:55Z"
  },
  {
    "title": "Bitcoin rises to record $109,730 on optimism over US regulation",
    "description": "Bitcoin surged to a record high of $109,730, fueled by optimism surrounding stablecoin legislation in the US Senate and a perceived shift in regulatory approach under a potential Trump administration. The proposed bill, revised to include stricter anti-money …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/bitcoin-rises-to-record-109730-on-optimism-over-us-regulation/articleshow/121323648.cms",
    "timestamp": "2025-05-21T18:41:27Z"
  },
  {
    "title": "Putin Acknowledges Trump’s Leadership in a Key Conversation",
    "description": "In a world shaken by geopolitical uncertainty, global threats, and the weakening of Western leadership under previous administrations, a sign of respect and recognition has emerged from one of the most influential international actors: Russian President Vladi…",
    "link": "https://gatewayhispanic.com/video/putin-acknowledges-trumps-leadership-in-a-key-conversation/",
    "timestamp": "2025-05-21T18:40:26Z"
  },
  {
    "title": "Scott Jennings Is the Most Important Figure at CNN",
    "description": "As CNN deals with a downward spiral of ratings woes, there is one bright spot on the programming slate, and a surprising conservative voice that is its star.\nThe post Scott Jennings Is the Most Important Figure at CNN first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/scott-jennings-is-the-most-important-figure-at-cnn/",
    "timestamp": "2025-05-21T18:35:25Z"
  },
  {
    "title": "Watch moment Trump confronts South Africa's president with video",
    "description": "In an extraordinary Oval Office meeting, Trump pressed Cyril Ramaphosa on widely discredited claims of a white genocide in South Africa.",
    "link": "https://www.bbc.co.uk/news/videos/cdedd1kn3ewo",
    "timestamp": "2025-05-21T18:35:23Z"
  },
  {
    "title": "Donald Trump Jr. has 'ZERO interest' in a 2028 run, but isn't ruling out possibility of a political future",
    "description": "Donald Trump Jr. does not rule out the possibility of seeking office in the future, but notes he has no interest in running in 2028",
    "link": "https://www.foxnews.com/politics/donald-trump-jr-has-zero-interest-2028-run-isnt-ruling-out-possibility-political-future",
    "timestamp": "2025-05-21T18:34:53Z"
  },
  {
    "title": "Trump's attacks on Springsteen and Oprah aren't legally sound — but that's not the point",
    "description": "Nothing incites angry Truth Social posts from President Donald Trump like celebrity hate. Bruce Springsteen (and Eddie Vedder and Neil Young) have got his goat.",
    "link": "https://biztoc.com/x/f1823901bac860c5",
    "timestamp": "2025-05-21T18:34:13Z"
  },
  {
    "title": "Why China Is \"Seriously Concerned\" Over US Golden Dome Defence System",
    "description": "However, China has expressed serious concerns over the project, with Foreign Ministry spokesperson Mao Ning stating that it carries &quot;strong offensive implications&quot; and heightens the risks of militarisation of outer space and an arms race.",
    "link": "https://www.ndtv.com/world-news/why-china-is-seriously-concerned-over-us-golden-dome-defence-system-8474386",
    "timestamp": "2025-05-21T18:34:10Z"
  },
  {
    "title": "What is the dollar's future after Moody's downgrade?",
    "description": "Trump trade wars, growing debt have investors looking elsewhere",
    "link": "https://theweek.com/business/economy/dollar-future-moodys-downgrade",
    "timestamp": "2025-05-21T18:33:58Z"
  },
  {
    "title": "Elon Musk denies SpaceX is the frontrunner for Trump’s $500 billion ‘Golden Dome’ missile-defense project: ‘This is not true’",
    "description": "The Trump administration is reportedly turning to old friends as it looks to develop a “golden dome” missile-defense system proposed by President Donald Trump. Although plans may change, and Elon Musk has denied that SpaceX pitched itself for the job, the adm…",
    "link": "https://biztoc.com/x/c425581474deb8d0",
    "timestamp": "2025-05-21T18:33:48Z"
  },
  {
    "title": "US President Donald Trump's 79th birthday bash: Everything you need to know about the extravagant celebrations",
    "description": "President Trump is set to celebrate his 79th birthday alongside the U.S. Army's 250th anniversary on June 14 with a grand military parade in Washington, D.C. The event, spanning the first week of June, includes military demonstrations, a concert, and a massiv…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/us-president-donald-trumps-79th-birthday-bash-everything-you-need-to-know-about-the-extravagant-celebrations/articleshow/121323444.cms",
    "timestamp": "2025-05-21T18:33:32Z"
  },
  {
    "title": "SHOCK: Trump FORCES South African President To Watch White Genocide Video in Oval Office, Then... \n(VIDEO 16 MIN)",
    "description": "South African President Cyril Ramaphosa wasn't expecting this!",
    "link": "https://freerepublic.com/focus/f-news/4318325/posts",
    "timestamp": "2025-05-21T18:33:21Z"
  },
  {
    "title": "Angel Families Tell Congress: Give Us 'a Lifeline' by Passing Trump's 'One, Big, Beautiful Bill'",
    "description": "Angel Families, whose loved ones have been killed by illegal aliens, are urging Congress to pass Trump's reconciliation package.\nThe post Angel Families Tell Congress: Give Us ‘a Lifeline’ by Passing Trump’s ‘One, Big, Beautiful Bill’ appeared first on Breitb…",
    "link": "https://www.breitbart.com/politics/2025/05/21/angel-families-tell-congress-give-us-lifeline-passing-trumps-one-big-beautiful-bill/",
    "timestamp": "2025-05-21T18:32:29Z"
  },
  {
    "title": "Neil Young Warns Trump to Stop Responding to Geriatric Rockers' Trash Talk: '86/47? ... We Need a Real President'",
    "description": "Aging rocker Neil Young is once again on the attack against President Donald Trump and recently interjected himself in Trump's criticism of fellow fading rocker Bruce Springsteen. Young also repeated the phrase associated with assassinating Trump.\nThe post Ne…",
    "link": "https://www.breitbart.com/entertainment/2025/05/21/neil-young-warns-trump-to-stop-responding-to-geriatric-rockers-trash-talk-this-guy-is-out-of-control/",
    "timestamp": "2025-05-21T18:32:06Z"
  },
  {
    "title": "South African President Apologizes for Not Gifting Trump a Private Jet",
    "description": "Amidst one of Donald Trump’s most obvious corruption scandals, foreign leaders are now apologizing to the American president for not providing him with a multi-million dollar bribe.\r\n“I’m sorry I don’t have a plane to give you,” South African President Cyril …",
    "link": "https://newrepublic.com/post/195580/south-african-president-ramaphosa-apologizes-no-private-jet-gift-trump",
    "timestamp": "2025-05-21T18:32:04Z"
  },
  {
    "title": "‘A lot of Americans will lose health care coverage’ with Trump tax bill: Dr. Ami Bera - NewsBreak",
    "description": "Dr. Ami Bera, D-Calif., says he believes people will \"lose their health care” with Trump’s proposed “big, beautiful” tax bill.",
    "link": "https://www.newsbreak.com/share/4016841810266-a-lot-of-americans-will-lose-health-care-coverage-with-trump-tax-bill-dr-ami-bera?s=a2&share_destination_id=MjA4MDc3MzkyLTE3NDc4NTIyNTY1MDk%3D&pd=0E54Qy9C&hl=en_US&send_time=1747852256&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.18.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q2-v2%2Cns_local_strategy_25q1_exp-v6%2Cns_foryou_blend_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q2-v1",
    "timestamp": "2025-05-21T18:31:51Z"
  },
  {
    "title": "Samsung Reportedly Wants OLED Screens On Switch 2 Refresh",
    "description": "One of the major complaints about the Switch 2 might be addressed in the future.",
    "link": "https://www.cnet.com/tech/gaming/samsung-reportedly-wants-oled-screens-on-switch-2-refresh/",
    "timestamp": "2025-05-21T18:31:40Z"
  },
  {
    "title": "CNN Correspondent Debunks Trump’s Claims of White Genocide in South Africa: ‘A Good Day for White Nationalists’",
    "description": "Moments after President Donald Trump claimed there have been mass killings of White farmers in South Africa, a CNN international correspondent reporting from Africa delivered a thorough fact check. Reporting from Kenya Wednesday, CNN international corresponde…",
    "link": "https://www.mediaite.com/media/news/cnn-correspondent-debunks-trumps-claims-of-white-genocide-in-south-africa-a-good-day-for-white-nationalists/",
    "timestamp": "2025-05-21T18:31:14Z"
  },
  {
    "title": "Stephen Colbert mocks his Paramount bosses for considering 'shady' $50M Trump settlement",
    "description": "Stephen Colbert mocked Paramount's potential settlement with President Trump over his CBS News lawsuit on Tuesday, highlighting concerns from senators about bribery laws.",
    "link": "https://www.foxnews.com/media/stephen-colbert-mocks-his-paramount-bosses-considering-shady-50m-trump-settlement",
    "timestamp": "2025-05-21T18:30:48Z"
  },
  {
    "title": "Trump Ambushes S. African President Over 'Genocide' Accusation",
    "description": "President Donald Trump ambushed South African President Cyril Ramaphosa on Wednesday by playing him a video that he claimed proved genocide is being committed against white people, driving farmers to flee to the United States.",
    "link": "https://www.ibtimes.com.au/trump-ambushes-s-african-president-over-genocide-accusation-1859001",
    "timestamp": "2025-05-21T18:30:25Z"
  },
  {
    "title": "Furious judge mulls criminal contempt as Trump admin found to have blatantly ignored order",
    "description": "A federal judge found the Trump administration violated his order from last month blocking officials from deporting foreign nationals to countries that aren't their own without giving them a chance to challenge their removal.Boston-based federal judge Brian E…",
    "link": "https://www.rawstory.com/south-sudan-trump/",
    "timestamp": "2025-05-21T18:30:02Z"
  },
  {
    "title": "What is SALT and why does it threaten Trump's 'Big Beautiful Bill?'",
    "description": "The future of President Donald Trump's \"Big Beautiful\" federal spending bill could come down to SALT tax deductions.",
    "link": "https://abcnews.go.com/Politics/salt-threaten-trumps-big-beautiful-bill/story?id=122037760",
    "timestamp": "2025-05-21T18:29:35Z"
  },
  {
    "title": "Democrats Grill Trump’s IRS Nominee On His Role Promoting Suspect Tax Credits",
    "description": "Billy Long, President Donald Trump’s nominee to serve as IRS Commissioner, answered questions about his involvement promoting tax credits and other tax issues.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/05/21/democrats-grill-trumps-irs-nominee-on-his-role-promoting-suspect-tax-credits/",
    "timestamp": "2025-05-21T18:26:49Z"
  },
  {
    "title": "From promising to end the Russia-Ukraine war in 24 hours to walking away after 5 months, here are hidden details of Donald Trump's call with Putin that have angered European allies",
    "description": "Trump’s recent call with Putin upset European leaders, as he backed out of U.S. involvement in Ukraine peace talks, despite earlier promises to quickly end the war.",
    "link": "https://economictimes.indiatimes.com/news/international/us/from-promising-to-end-the-russia-ukraine-war-in-24-hours-to-walking-away-after-5-months-here-are-hidden-details-of-donald-trumps-call-with-putin-that-have-angered-european-allies/articleshow/121322239.cms",
    "timestamp": "2025-05-21T18:23:38Z"
  },
  {
    "title": "Trump ambushes South African president in Oval Office with claims of 'white persecution'",
    "description": "BBC'S SUMMARY In an extraordinary Oval Office meeting, Donald Trump confronts South Africa's leader with video over discredited claims of a white genocide in South Africa Trump says white farmers are \"fleeing South Africa\" and plays footage showing people cha…",
    "link": "https://freerepublic.com/focus/f-chat/4318320/posts",
    "timestamp": "2025-05-21T18:22:03Z"
  },
  {
    "title": "Trump unveils ‘Golden Dome’ missile shield, blindsides key senators",
    "description": "President Donald Trump announced Golden Dome can be done in three years for $125 billion, but other defense experts have predicted the cost figure to be much higher.",
    "link": "https://www.foxnews.com/politics/trump-unveils-golden-dome-missile-shield-blindsides-key-senators",
    "timestamp": "2025-05-21T18:20:31Z"
  },
  {
    "title": "Investors Bet Millions on Bitcoin Price Following Record High",
    "description": "Bettors flocked to Polymarket, Kalshi and Myriad Markets to wager on Bitcoin's price action on Wednesday, shortly after the token's price surpassed $109,000.",
    "link": "https://decrypt.co/321359/investors-bet-millions-bitcoin-price-following-record-high",
    "timestamp": "2025-05-21T18:19:29Z"
  },
  {
    "title": "Trump Wildly Claims White South African Farmers Are Being ‘Executed’ As Country’s President Shakes His Head ‘No’",
    "description": "“And those people, in many cases, are being executed,” Trump insisted as Ramaphosa quietly shook his head and said, “No.”\nThe post Trump Wildly Claims White South African Farmers Are Being ‘Executed’ As Country’s President Shakes His Head ‘No’ first appeared …",
    "link": "https://www.mediaite.com/politics/trump-wildly-claims-white-south-african-farmers-are-being-executed-as-countrys-president-shakes-his-head-no/",
    "timestamp": "2025-05-21T18:19:25Z"
  },
  {
    "title": "George Strait canceled show with Bruce Springsteen over Trump comments?",
    "description": "Country music icon George Strait canceled a show with rock and roll legend Bruce Springsteen, citing the latter's criticism of U.S. President Donald Trump.",
    "link": "https://www.snopes.com//fact-check/trump-springsteen-strait/",
    "timestamp": "2025-05-21T18:19:00Z"
  },
  {
    "title": "Trump's attacks on Springsteen and Oprah aren't legally sound — but that's not the point",
    "description": "Nothing incites angry Truth Social posts from President Donald Trump like celebrity hate. Bruce Springsteen (and Eddie Vedder and Neil Young) have got his goat.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-truth-social-springsteen-oprah-beyonce-campaign-fraud-rcna208260",
    "timestamp": "2025-05-21T18:18:00Z"
  },
  {
    "title": "Biden’s senility scandal leads top Republican to demand DOJ probe into ‘representations’ to public",
    "description": "Allegations of cover-ups regarding Biden's health prompt Sen. Cornyn to request a DOJ probe into possible misrepresentations and violations of federal law. Cornyn demands DOJ probe into Biden health disclosures after cancer revelation",
    "link": "https://www.foxnews.com/politics/bidens-senility-scandal-leads-top-republican-demand-doj-probe-representations-public",
    "timestamp": "2025-05-21T18:17:10Z"
  },
  {
    "title": "We are doing big deals with India, Pakistan: US President Donald Trump",
    "description": "Donald Trump stated he helped prevent a war between India and Pakistan. He mentioned ongoing 'big deals' with both nations. Trump praised leaders Narendra Modi and Imran Khan. India's Ministry of External Affairs previously rejected Trump's claims. They denie…",
    "link": "https://economictimes.indiatimes.com/news/india/we-are-doing-big-deals-with-india-pakistan-us-president-donald-trump/articleshow/121323184.cms",
    "timestamp": "2025-05-21T18:14:01Z"
  },
  {
    "title": "'Way to go!' MAGA world reacts with glee at Trump's Oval Office 'ambush' of guest",
    "description": "MAGA world is praising President Donald Trump after his Oval Office showdown with South Africa's President Cyril Ramaphosa Wednesday, saying he held his guest “accountable” for the alleged “white genocide” happening in the country. “TRUMP HOLDS SOUTH AFRICA P…",
    "link": "https://www.rawstory.com/trump-south-africa-2672181735/",
    "timestamp": "2025-05-21T18:13:42Z"
  },
  {
    "title": "Trump accuses South Africa of 'white genocide' in meeting with country’s president",
    "description": "During a meeting with President Cyril Ramaphosa in the Oval Office, President Donald Trump alleged that there was a genocide against white people in South Africa. Trump played a video purporting to show support for violence against Afrikaners. Ramaphosa said …",
    "link": "https://biztoc.com/x/c77853eb63494c77",
    "timestamp": "2025-05-21T18:13:40Z"
  },
  {
    "title": "Trump admin accepts jet from Qatar, ignoring legal restrictions and bipartisan pushback",
    "description": "Team Trump's decision to accept a luxury jet as a “gift” from Qatar doesn’t end the controversy; it starts the controversy.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-admin-accepts-jet-qatar-ignoring-legal-restrictions-bipartisan-p-rcna208306",
    "timestamp": "2025-05-21T18:12:52Z"
  },
  {
    "title": "The Trump Administration is Trying to Change the Historical Definition of Human Rights",
    "description": "Upending decades of precedence, the Trump Administration will exclude key information from the State Department's reports on human rights.",
    "link": "https://time.com/7280981/human-rights-country-reports/",
    "timestamp": "2025-05-21T18:12:51Z"
  }
]