[
  {
    "title": "Citing China 'activity', Trump administration bars Harvard from enrolling foreign students",
    "description": "US President Donald Trump's administration on Thursday said it had revoked Harvard University's right to enrol international students, citing its \"coordinated activity\" with China's Communist Party as a factor in the decision.",
    "link": "https://www.bangkokpost.com/world/3032692/citing-china-activity-trump-administration-bars-harvard-from-enrolling-foreign-students",
    "timestamp": "2025-05-23T04:43:00Z"
  },
  {
    "title": "Protests as Donald Trump hosts $TRUMP memecoin dinner for top investors",
    "description": "Trump hosted a private dinner for 220 memecoin investors at his golf club.",
    "link": "https://www.nzherald.co.nz/world/protests-as-donald-trump-hosts-trump-memecoin-dinner-for-top-investors/YAVAAHD6K5F6VNJXQLZXVY63EY/",
    "timestamp": "2025-05-23T04:40:38Z"
  },
  {
    "title": "Trump vowed to ease sanctions on Syria. How quickly that happens is up for debate",
    "description": "Since President Donald Trump announced his intent to end a half-century of sanctions on Syria, a debate has developed in his administration over how quickly and thoroughly that should happen",
    "link": "https://abcnews.go.com/US/wireStory/trump-vowed-ease-sanctions-syria-quickly-debate-122102168",
    "timestamp": "2025-05-23T04:38:27Z"
  },
  {
    "title": "Germany deploys permanent troops to Lithuania, a move not seen since World War II",
    "description": "Chancellor Friedrich Merz inaugurated a groundbreaking German brigade in Lithuania that is meant to help protect NATO’s eastern flank and declared Thursday that “the security of our Baltic allies is also our security” as worries about Russian aggression persi…",
    "link": "https://www.cnn.com/2025/05/23/europe/german-military-brigade-lithuania-intl-hnk-ml",
    "timestamp": "2025-05-23T04:38:07Z"
  },
  {
    "title": "Heartening that America's involvement made difference in stopping close to full-scale war between India, Pakistan: US",
    "description": "The US stated its involvement helped stop a potential war between India and Pakistan. A ceasefire occurred after tensions rose following an attack in Jammu and Kashmir. India launched Operation Sindoor, and Pakistan retaliated. Both countries agreed to end th…",
    "link": "https://economictimes.indiatimes.com/news/india/heartening-that-americas-involvement-made-difference-in-stopping-close-to-full-scale-war-between-india-pakistan-us/articleshow/121353676.cms",
    "timestamp": "2025-05-23T04:34:50Z"
  },
  {
    "title": "Protesters yell ‘Shame!’ at guests of Trump’s memecoin dinner",
    "description": "Top holders of Donald Trump's memecoin and other guests were greeted by protesters as they arrived for a dinner with the president at his golf club outside of Washington on May 22, a day which saw Bitcoin extend its record high amid optimism about US governme…",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/05/23/protesters-yell-shame-at-guests-of-trumps-memecoin-dinner",
    "timestamp": "2025-05-23T04:30:00Z"
  },
  {
    "title": "Black Lives Matter street murals stand as an enduring reminder of protests",
    "description": "In 2020, Black Lives Matter street murals appeared in cities across the U.S. following the police killings of George Floyd, Breonna Taylor and Ahmaud Arbery",
    "link": "https://abcnews.go.com/US/wireStory/black-lives-matter-street-murals-stand-enduring-reminder-122102442",
    "timestamp": "2025-05-23T04:29:29Z"
  },
  {
    "title": "Trump pushes EU to cut tariffs or face extra duties, FT reports",
    "description": "U.S. Trade Representative Jamieson Greer is preparing to tell European Trade Commissioner Maros Sefcovic on Friday that a recent \"explanatory note\" shared by...",
    "link": "https://www.yahoo.com/news/trump-pushes-eu-cut-tariffs-042809065.html",
    "timestamp": "2025-05-23T04:28:09Z"
  },
  {
    "title": "Japan's Ishiba talks tariffs, security, diplomacy with Trump",
    "description": "Japanese Prime Minister Ishiba Shigeru told reporters that he spoke over the phone with United States President Donald Trump to discuss diplomacy, security issues, as well as tariffs.Ishiba stated tha...",
    "link": "https://biztoc.com/x/487c85355dbbe75b",
    "timestamp": "2025-05-23T04:23:30Z"
  },
  {
    "title": "Trump relishes uttering the outlandish. Here's where some of his most showstopping comments stand",
    "description": "It may start as a casual aside, a wee-hours social media post or a much hyped announcement",
    "link": "https://abcnews.go.com/US/wireStory/trump-relishes-uttering-outlandish-showstopping-comments-stand-122102169",
    "timestamp": "2025-05-23T04:22:14Z"
  },
  {
    "title": "Trump relishes uttering the outlandish. Here's where some of his most showstopping comments stand",
    "description": "US President Trump has a penchant for floating attention-grabbing ideas, ranging from acquiring a new Air Force One from Qatar to annexing Greenland. While some proposals, like the Panama Canal deal, found a resolution, others, such as touring Fort Knox, have…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-relishes-uttering-the-outlandish-heres-where-some-of-his-most-showstopping-comments-stand/articleshow/121353419.cms",
    "timestamp": "2025-05-23T04:22:11Z"
  },
  {
    "title": "Trump pushes EU to cut tariffs or face extra duties",
    "description": "The FT added that the European Union has been pushing for a jointly agreed framework text for the talks, but the two sides remain too far apart.",
    "link": "https://www.jpost.com/breaking-news/article-855157",
    "timestamp": "2025-05-23T04:16:23Z"
  },
  {
    "title": "Trump pushes EU to cut tariffs or face extra duties, FT reports",
    "description": "U.S. President Donald Trump’s trade team is pressuring the European Union to unilaterally lower tariffs on American goods, warning that failure to make concessions could halt progress in negotiations aimed at preventing additional 20% \"reciprocal\" tariffs, ac…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-pushes-eu-to-cut-tariffs-or-face-extra-duties-ft-reports/articleshow/121353244.cms",
    "timestamp": "2025-05-23T04:15:34Z"
  },
  {
    "title": "First MAHA health report calls for reassessing medicines, processed foods, pesticides",
    "description": "An initial report from the Trump administration links poor diet, environmental toxins, unhealthy habits, and pharmaceuticals to rising chronic illnesses, urging a health overhaul in America.",
    "link": "https://www.wrex.com/news/health/first-maha-health-report-calls-for-reassessing-medicines-processed-foods-pesticides/article_bb383847-12d7-5642-99c0-600d77c80765.html",
    "timestamp": "2025-05-23T04:15:30Z"
  },
  {
    "title": "US Gov’t to Stop Minting One-Cent Coin - Reports",
    "description": "MOSCOW (Sputnik) - The US Treasury Department has decided to stop minting one-cent coins due to the high cost of their production, CNN reported, citing a statement from the department.",
    "link": "https://sputnikglobe.com/20250523/us-govt-to-stop-minting-one-cent-coin---reports-1122113686.html",
    "timestamp": "2025-05-23T04:15:27Z"
  },
  {
    "title": "U.S. panel submits view on Nippon Steel-U.S. Steel deal to Trump",
    "description": "A powerful U.S. national security panel on Wednesday submitted a recommendation to President Donald Trump on Nippon Steel's fraught $14.9 billion bid for U.S. Steel, a person familiar with the matter said, without providing further detail on its contents.\nThe…",
    "link": "https://biztoc.com/x/efbeff4967df96f2",
    "timestamp": "2025-05-23T04:12:13Z"
  },
  {
    "title": "Sorry, Donald Trump, But Ukraine Is Your War",
    "description": "",
    "link": "https://biztoc.com/x/6ee38ac4a5f85c55",
    "timestamp": "2025-05-23T04:12:12Z"
  },
  {
    "title": "Trump-ordered MAHA report urges stricter oversight of food safety and additives",
    "description": "The Make America Healthy Again (MAHA) Commission Report addresses food safety and its impact on chronic childhood illnesses in the United States.  Commissioned by President Donald Trump via executive order on Feb.13, the 14-member panel, chaired by Health and…",
    "link": "https://www.foodsafetynews.com/2025/05/trump-ordered-maha-report-urges-stricter-oversight-of-food-safety-and-additives/",
    "timestamp": "2025-05-23T04:06:00Z"
  },
  {
    "title": "500 Years of Inflicted Horrors, from the New World to Israel",
    "description": "( Tomdispatch.com ) - Leon Golub once related a story to a mutual friend. A Chicago artist famous for large canvases depicting crimson torture rooms in Central America, Golub had been asked what it meant to him to be a “Jewish political artist.” The painter’s…",
    "link": "https://www.juancole.com/2025/05/years-horrors-israel.html",
    "timestamp": "2025-05-23T04:04:15Z"
  },
  {
    "title": "G7 Finance Ministers Agree To Increase Pressure On Russia If There Is No Cease-Fire In Ukraine",
    "description": "Finance ministers and central bank governors from the Group of Seven democracies agreed during a meeting in western Canada that Russia could face further sanctions if it resists a push toward a cease-fire in its war in Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250523-rferl01.htm",
    "timestamp": "2025-05-23T04:03:38Z"
  },
  {
    "title": "Bruce Springsteen & E Street Band: Land of Hope & Dreams review – A roiling, righteous anti-Trump onslaught",
    "description": "Stay true to what we believe in, the great blue-collar bard urges on this live EP recorded in Manchester",
    "link": "https://www.irishtimes.com/culture/music/review/2025/05/23/bruce-springsteen-e-street-band-land-of-hope-dreams-review-a-roiling-righteous-anti-trump-onslaught/",
    "timestamp": "2025-05-23T04:03:00Z"
  },
  {
    "title": "India–Pakistan War: The Winners and the Losers",
    "description": "For all the alarming seriousness of two South Asian nuclear powers coming to the razor’s edge of a lethal exchange, the 2025 India–Pakistan war could not but contain elements of a Bollywood extravaganza. Frantic dancing indeed, which risked getting out of con…",
    "link": "https://www.lewrockwell.com/2025/05/no_author/india-pakistan-war-the-winners-and-the-losers/",
    "timestamp": "2025-05-23T04:01:00Z"
  },
  {
    "title": "From prison to Paris: Trump appoints new ambassador to France",
    "description": "Kushner's mission extends beyond diplomacy – and his past is nearly impossible to ignore.",
    "link": "https://www.euractiv.com/section/politics/news/from-prison-to-paris-trump-appoints-new-ambassador-to-france/",
    "timestamp": "2025-05-23T04:00:39Z"
  },
  {
    "title": "US Reinstates Funding to Propaganda Outlet NED",
    "description": "The brief freeze and rapid partial reinstatement of National Endowment for Democracy (NED) funding in early 2025 helped expose it as a US regime-change tool. Created to rebrand CIA covert operations as “democracy promotion,” the NED channels government funds …",
    "link": "https://original.antiwar.com/roger_harris/2025/05/22/us-reinstates-funding-to-propaganda-outlet-ned/",
    "timestamp": "2025-05-23T04:00:09Z"
  },
  {
    "title": "From Blackouts to Breakouts: Trump’s Energy Revolution Begins",
    "description": "When Donald J. Trump returned to the White House on January 20, 2025, he inherited a shattered energy policy—and a nation paying the price for four years of willful decline.\r\n\r\nThe American energy sector, which had once been the envy of the wor...",
    "link": "https://www.americanthinker.com/articles/2025/05/from_blackouts_to_breakouts_trump_s_energy_revolution_begins.html",
    "timestamp": "2025-05-23T04:00:00Z"
  },
  {
    "title": "Father of accused killer of Israeli diplomats is closely acquainted with Illinois Democrat",
    "description": "If you like American Thinker’s content, please consider subscribing here for an ad-free experience and access to an exclusive, weekly newsletter offering insight from the editorial staff.\r\n\r\nOnce again, we see that there aren’t ...",
    "link": "https://www.americanthinker.com/blog/2025/05/father_of_accused_killer_of_israeli_diplomats_is_closely_acquainted_with_illinois_democrat.html",
    "timestamp": "2025-05-23T04:00:00Z"
  },
  {
    "title": "FBI’s Disgraced Comey Peddles Ludicrous ‘8647’ Explanation",
    "description": "Disgraced former FBI Director, James Comey, mysteriously found seashells on his beach walk listing the numbers, “8647,” which to any half-aware person means, “Assassinate President Trump.”  Comey posted on Instagram, &ldq...",
    "link": "https://www.americanthinker.com/articles/2025/05/fbi_s_disgraced_comey_peddles_ludicrous_8647_explanation.html",
    "timestamp": "2025-05-23T04:00:00Z"
  },
  {
    "title": "Democrats’ double deception",
    "description": "We now know the Democrat party covered up its concern about Joe Biden’s mental state prior to the 2024 presidential election in hopes of maintaining political power. That should cause us to wonder—in light of the recent “surprise&rd...",
    "link": "https://www.americanthinker.com/blog/2025/05/democrats_double_deception.html",
    "timestamp": "2025-05-23T04:00:00Z"
  },
  {
    "title": "Supreme Court insulates FED as it backs Trump firing of agency leaders",
    "description": "The Supreme Court on Thursday strongly suggested that Federal Reserve board members would have special protection against being fired by a president in a ruling that, for now, allows President Donald Trump to fire two members of other federal agencies’ boards…",
    "link": "https://freerepublic.com/focus/f-news/4318638/posts",
    "timestamp": "2025-05-23T03:58:58Z"
  },
  {
    "title": "Supreme Court insulates FED as it backs Trump firing of agency leaders",
    "description": "The Supreme Court on Thursday strongly suggested that Federal Reserve board members would have special protection against being fired by a president in a ruling that, for now, allows President Donald Trump to fire two members of other federal agencies’ boards…",
    "link": "https://freerepublic.com/focus/f-chat/4318638/posts",
    "timestamp": "2025-05-23T03:58:58Z"
  },
  {
    "title": "Trump's big tax Bill has passed the House. Here's what's inside it",
    "description": "WASHINGTON: House Republicans early on Thursday (May 22) took a major step forward on President Donald Trump's agenda, approving a legislative package that combines tax breaks, spending cuts, border security funding and",
    "link": "https://www.channelnewsasia.com/world/trumps-big-tax-bill-has-passed-house-heres-whats-inside-it-5148741",
    "timestamp": "2025-05-23T03:57:48Z"
  },
  {
    "title": "Joe Biden age update",
    "description": "The Trump administration has stopped making transcripts of the president’s remarks available: The Trump White House, which touts itself as “the most transparent” administration in history, has removed a database of official transcripts documenting President D…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/joe-biden-age-update-10",
    "timestamp": "2025-05-23T03:56:50Z"
  },
  {
    "title": "US judge blocks Trump's plan to dismantle Education Department",
    "description": "Education Department spokesperson Madi Biedermann said in a statement that the Trump administration would immediately challenge the ruling",
    "link": "https://www.thehindubusinessline.com/news/world/us-judge-blocks-trumps-plan-to-dismantle-education-department/article69609034.ece",
    "timestamp": "2025-05-23T03:56:25Z"
  },
  {
    "title": "Top Romanian Court Rejects 'Unfounded' Election Challenge By Pro-Russia Candidate Simion",
    "description": "Romania's Constitutional Court has unanimously rejected a challenge to the results of last week's presidential election by the losing ultranationalist candidate George Simion, saying his request was \"unfounded.\"",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250522-rferl01.htm",
    "timestamp": "2025-05-23T03:54:07Z"
  },
  {
    "title": "Mahmoud Khalil Allowed To Hold Newborn Son For First Time Despite Trump Admin. Objections",
    "description": "The question of whether Khalil would be permitted to hold his child triggered claims by his attorneys that he's been subjected to political retaliation.",
    "link": "https://www.huffpost.com/entry/mahmoud-khalil-hold-newborn-son-first-time-trump-objections_n_682fedcce4b0e1fe96d668ad",
    "timestamp": "2025-05-23T03:51:54Z"
  },
  {
    "title": "News Summary-Intelligence Report 5/22/2025*Newsdump Thursday*Army Rangers Accused Of Firing Rounds On Public Beach*Supreme Court Splits Against Religious Charter School*Israeli Embassy Employees Killed In Washington DC*\"Serious Accident\" At North Korean*",
    "description": "18 US Army Rangers have been temporarily suspended as instructors over the alleged firing... A missile from Yemen fired at Israel early Friday... For the second night in a row extensive Ukrainian drone attacks on Russia... The US Supreme Court ruling to allow…",
    "link": "https://freerepublic.com/focus/f-bloggers/4318637/posts",
    "timestamp": "2025-05-23T03:50:59Z"
  },
  {
    "title": "The Bond Market Is Shaking Wall Street Again, This Time Because Of Worries About Tax Cuts",
    "description": "The bond market has a sleepy reputation, but it can pack a punch when alarmed.",
    "link": "https://www.huffpost.com/entry/us-bond-market-debt_n_682fedb4e4b0a3c83b176ea9",
    "timestamp": "2025-05-23T03:50:48Z"
  },
  {
    "title": "U.S. panel submits view on Nippon Steel-U.S. Steel deal to Trump",
    "description": "Trump will now have 15 days to decide the fate of the transaction, although the timeline could slip.",
    "link": "https://www.japantimes.co.jp/business/2025/05/23/companies/cfius-submission-nippon-steel/",
    "timestamp": "2025-05-23T03:47:00Z"
  },
  {
    "title": "Trump admin sows doubt over vaccines in 'Make America Healthy Again' report",
    "description": "WASHINGTON - A highly anticipated White House report outlining Health Secretary Robert F. Kennedy Jr.'s agenda devotes significant space to raising alarm over vaccines, while touching on environmental and nutrition concerns that remain at odds with broader ad…",
    "link": "https://www.bangkokpost.com/world/3032622/trump-admin-sows-doubt-over-vaccines-in-make-america-healthy-again-report",
    "timestamp": "2025-05-23T03:45:00Z"
  },
  {
    "title": "Anti-doping bodies condemn 'dangerous' drug-fuelled Enhanced Games",
    "description": "LOS ANGELES &mdash; Anti-doping bodies on Thursday condemned plans for the first edition of the Enhanced Games in Las Vegas, an Olympics-style event where athletes will be free to use performance-enhancing drugs.",
    "link": "https://www.bangkokpost.com/sports/3032617/anti-doping-bodies-condemn-dangerous-drug-fuelled-enhanced-games",
    "timestamp": "2025-05-23T03:45:00Z"
  },
  {
    "title": "Iran, US to hold new round of nuclear talks in Rome",
    "description": "TEHRAN - Iranian and US negotiators meet in Rome on Friday for a fifth round of nuclear talks, after a public disagreement over Tehran's uranium enrichment.",
    "link": "https://www.bangkokpost.com/world/3032607/iran-us-to-hold-new-round-of-nuclear-talks-in-rome",
    "timestamp": "2025-05-23T03:45:00Z"
  },
  {
    "title": "Kremlin Says Russia, Ukraine 'Yet To Agree' On More Peace Talks As 2 Killed In Strikes On Donetsk",
    "description": "Despite talk of renewed diplomacy, Russia and Ukraine have not scheduled further peace negotiations, a Kremlin spokesman said - even as fresh Russian strikes in the Donetsk region killed two civilians and left others wounded in one of the war's most violent h…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250522-rferl04.htm",
    "timestamp": "2025-05-23T03:43:27Z"
  },
  {
    "title": "OpenAI says it will build massive data centers in the UAE",
    "description": "Sam Altman, OpenAI's CEO, has spent more than a year evangelising for the global construction of huge data centers to help his company build powerful AI systems. The Emirati announcement is an indication that his wildly ambitious plan, called Stargate, may be…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openai-says-it-will-build-massive-data-centers-in-the-uae/articleshow/121352821.cms",
    "timestamp": "2025-05-23T03:43:12Z"
  },
  {
    "title": "Murder In Madrid: Who Was Andriy Portnov, The Ukrainian Presidential Adviser Gunned Down In Spain?",
    "description": "As he went to get into his Mercedes sedan after dropping his children at an international school near Madrid, a Ukrainian lawyer named Andriy Portnov was approached by gunmen who shot him five times, the last time in the head.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250522-rferl03.htm",
    "timestamp": "2025-05-23T03:39:16Z"
  },
  {
    "title": "Supreme Court lets Trump fire 2 Biden-appointed labor regulators - Politico",
    "description": "Supreme Court lets Trump fire 2 Biden-appointed labor regulatorsPolitico Supreme Court insulates Fed as it backs Trump firing of agency leadersCNBC Supreme Court upholds Trump's removal of Biden appointees from federal boardsFox News Supreme Court declines to…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177698529",
    "timestamp": "2025-05-23T03:34:32Z"
  },
  {
    "title": "Trump Admin Sows Doubt Over Vaccines In 'Make America Healthy Again' Report",
    "description": "A highly anticipated White House report outlining Health Secretary Robert F. Kennedy Jr.'s agenda devotes significant space to raising alarm over vaccines, while touching on environmental and nutrition concerns that remain at odds with broader administration …",
    "link": "https://www.ibtimes.com/trump-admin-sows-doubt-over-vaccines-make-america-healthy-again-report-3774310",
    "timestamp": "2025-05-23T03:33:18Z"
  },
  {
    "title": "Senate Votes to Overturn California’s Electric Vehicle Mandate in Major Blow to Climate Change Activists",
    "description": "The Senate has voted to overturn the electric vehicle mandate in the state of California. This is going to cause some major anger and anxiety among the climate change activist community. The EV mandate was one of the last things Joe Biden signed before leavin…",
    "link": "https://freerepublic.com/focus/f-news/4318636/posts",
    "timestamp": "2025-05-23T03:32:39Z"
  },
  {
    "title": "How Donald Trump's Crackdown On Harvard Will Affect Indian Students",
    "description": "US President Donald Trump&#039;s administration has revoked Harvard University&#039;s authority to enrol international students under a federal government scheme called the federal Student and Exchange Visitor Program (SEVP).",
    "link": "https://www.ndtv.com/world-news/harvard-university-indian-students-how-donald-trumps-crackdown-on-harvard-will-affect-indian-students-8485243",
    "timestamp": "2025-05-23T03:27:35Z"
  },
  {
    "title": "Trump's Harvard visa threat could wipe out several of the school's sports teams",
    "description": "Some of Harvard’s sports teams would be virtually wiped out by a Trump administration decision that would make the Ivy League school ineligible for international student visas",
    "link": "https://abcnews.go.com/US/wireStory/trumps-harvard-visa-threat-wipe-schools-sports-teams-122099051",
    "timestamp": "2025-05-23T03:18:16Z"
  },
  {
    "title": "Donald Trump’s ‘little problem’ with Tim Cook is a big one for Apple",
    "description": "Apple's stock performance has lagged behind other tech giants, partly due to President Trump's criticisms regarding its global manufacturing. Concerns about Apple's AI competitiveness and a potential slowdown in the China market further contribute to investor…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-little-problem-with-tim-cook-is-a-big-one-for-apple/articleshow/121351836.cms",
    "timestamp": "2025-05-23T03:15:38Z"
  },
  {
    "title": "'Stargate UAE' AI datacenter to begin operation in 2026",
    "description": "The first phase of that project will be the 1-gigawatt Stargate UAE project, built by state-backed UAE firm G42 in partnership with US firms OpenAI, Oracle, Nvidia and Cisco Systems, as well as Japan's SoftBank Group. The companies on Thursday said that the S…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/stargate-uae-ai-datacenter-to-begin-operation-in-2026/articleshow/121352421.cms",
    "timestamp": "2025-05-23T03:14:49Z"
  },
  {
    "title": "Trump's Social Security Commissioner Admits He Googled the Job: Report",
    "description": "Frank Bisignano also said at the time he was not looking for a job, in an audiotape obtained by ABC News.",
    "link": "https://www.newsweek.com/trumps-social-security-commissioner-admits-he-googled-job-report-2076161",
    "timestamp": "2025-05-23T03:12:18Z"
  },
  {
    "title": "House Passes Bill That Would Gut Climate Tax Credits for Americans",
    "description": "The bill would lead to a loss of hundreds of thousands of clean energy jobs and a rise in consumer energy bills",
    "link": "http://www.rollingstone.com/politics/politics-news/house-passes-bill-gut-biden-clean-energy-ira-1235346679/",
    "timestamp": "2025-05-23T03:03:59Z"
  },
  {
    "title": "Merz warns of Russia threat in visit to NATO's eastern flank",
    "description": "Vilnius (AFP) May 22, 2025\n\n\n Chancellor Friedrich Merz warned Thursday that Russia threatened security in Europe as he visited Lithuania to mark the official formation of Germany's first permanent overseas military unit since World War II, aimed at bolsterin…",
    "link": "https://www.spacewar.com/reports/Merz_warns_of_Russia_threat_in_visit_to_NATOs_eastern_flank_999.html",
    "timestamp": "2025-05-23T03:03:07Z"
  },
  {
    "title": "Finland says 'closely' monitoring Russian military build-up",
    "description": "Helsinki (AFP) May 22, 2025\n\n Finland is closely monitoring Russia's military activities near its eastern border after Finland's armed forces and international media reported a build-up, the defence minister told AFP on Thursday. \n\nFinland, which dropped deca…",
    "link": "https://www.spacewar.com/reports/Finland_says_closely_monitoring_Russian_military_build-up_999.html",
    "timestamp": "2025-05-23T03:03:07Z"
  },
  {
    "title": "Ahead of nuclear talks, Iran warns will hold US responsible for Israel attack",
    "description": "Tehran (AFP) May 22, 2025\n\n\n Iran warned it would hold the United States responsible if Israel attacks its nuclear facilities, but President Donald Trump's administration voiced optimism for a peaceful solution Thursday before new talks. \n\nTrump spoke about h…",
    "link": "https://www.spacewar.com/reports/Ahead_of_nuclear_talks_Iran_warns_will_hold_US_responsible_for_Israel_attack_999.html",
    "timestamp": "2025-05-23T03:03:07Z"
  },
  {
    "title": "Seoul says no talks with US on potential troop pullout",
    "description": "Seoul (AFP) May 23, 2025\n\n\n South Korea's defence ministry said Friday there have been no talks with Washington on pulling US troops from the South, after a Wall Street Journal report claimed Washington was considering a partial withdrawal. \n\nCiting US defenc…",
    "link": "https://www.spacewar.com/reports/Seoul_says_no_talks_with_US_on_potential_troop_pullout_999.html",
    "timestamp": "2025-05-23T03:03:07Z"
  },
  {
    "title": "South Korea says no talks held over potential U.S. troop withdrawal",
    "description": "The remarks came after The Wall Street Journal reported that the White House is considering pulling out roughly 4,500 troops and relocating them.",
    "link": "https://www.japantimes.co.jp/news/2025/05/23/asia-pacific/politics/us-military-south-korea/",
    "timestamp": "2025-05-23T03:01:00Z"
  },
  {
    "title": "MAGA CNN Guest Says Trump Can’t Be Bribed Because ‘He Took a Hatchet to the World Economy’",
    "description": "A guest on CNN NewsNight offered quite the reason for why President Donald Trump cannot be bribed.\nThe post MAGA CNN Guest Says Trump Can’t Be Bribed Because ‘He Took a Hatchet to the World Economy’  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/maga-cnn-guest-says-trump-cant-be-bribed-because-he-took-a-hatchet-to-the-world-economy/",
    "timestamp": "2025-05-23T02:57:17Z"
  },
  {
    "title": "Columbia University accused of violating federal civil rights law by Trump administration",
    "description": "The Trump administration alleged Thursday that Columbia University violated federal civil rights law by acting with “deliberate indifference” towards harassment of Jewish students on campus since October 2023.",
    "link": "https://www.cnn.com/2025/05/22/us/columbia-university-hhs-civil-rights-violation",
    "timestamp": "2025-05-23T02:56:37Z"
  },
  {
    "title": "Trump Hosts Top Crypto Investors As Some Fear He's Putting Personal Profits First",
    "description": "President Donald Trump has hosted top investors for one of his cryptocurrency projects at his luxury golf course in Northern Virginia.",
    "link": "https://www.huffpost.com/entry/us-trump-crypto-dinner_n_682fe177e4b0e1fe96d662fe",
    "timestamp": "2025-05-23T02:56:26Z"
  },
  {
    "title": "Editor's Notes: Palestinian clans look to join Abraham Accords after Oct. 7",
    "description": "After October 7, some Palestinian clans are considering entering the Abraham Accords and changing the face of the Middle East.",
    "link": "https://www.jpost.com/opinion/article-855139",
    "timestamp": "2025-05-23T02:56:15Z"
  },
  {
    "title": "Judge blocks Trump administration from revoking foreign student visas",
    "description": "WASHINGTON &mdash; A federal judge on Thursday blocked the Donald Trump administration's wide-reaching effort to detain and deport international students, barring the federal government from arresting those students or revoking their visas while the case play…",
    "link": "https://www.bangkokpost.com/world/3032580/judge-blocks-trump-administration-from-revoking-foreign-student-visas",
    "timestamp": "2025-05-23T02:50:00Z"
  },
  {
    "title": "Will the Capital Jewish Museum shooting lead Trump to crack down on anti-Israel activists",
    "description": "Will the murder of the two Israeli embassy employees — by a gunman who allegedly said he “did it for Gaza” — prompt the president to intensify his crackdown on anti Israel activists?",
    "link": "https://www.jpost.com/international/article-855155",
    "timestamp": "2025-05-23T02:49:18Z"
  },
  {
    "title": "Trump's second Oval Office ambush could make global heads think twice",
    "description": "US News: WASHINGTON: US President Donald Trump turned down the lights in the Oval Office on Wednesday and made South African President Cyril Ramaphosa the targ.",
    "link": "https://timesofindia.indiatimes.com/world/us/trumps-second-oval-office-ambush-could-make-global-heads-think-twice/articleshow/121351092.cms",
    "timestamp": "2025-05-23T02:44:08Z"
  },
  {
    "title": "Social Security Commissioner Says He Googled What His Job Is After Trump Picked Him",
    "description": "Frank Bisignano, a former Wall Street executive, told staff he hadn't been looking for a new job when he got the call.",
    "link": "https://www.huffpost.com/entry/frank-bisignano-social-security-googled-job_n_682fd496e4b097a9e0440b91",
    "timestamp": "2025-05-23T02:41:14Z"
  },
  {
    "title": "South Africa's Julius Malema Responds to Trump's Claim of 'Genocide' by Doubling Down: 'Kill the Farmer!'",
    "description": "South African politician Julius Malema, the leader of the radical Economic Freedom Fighters (EFF) party, responded to President Donald Trump’s claims about “genocide” Wednesday by reiterating calls to kill white farmers. Earlier that day, Trump had shown visi…",
    "link": "https://freerepublic.com/focus/f-news/4318627/posts",
    "timestamp": "2025-05-23T02:33:38Z"
  },
  {
    "title": "How a Freedom Caucus Revolt Ended in the White House - Politico",
    "description": "How a Freedom Caucus Revolt Ended in the White HousePolitico Congressman Details How Trump Strong-Arms Votes In House, And It Sounds Spot-OnYahoo Trump Singled Out One GOP Rebel in Profanity-Laced RantThe Daily Beast 'Don't be stupid': How Trump berated Repub…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177697993",
    "timestamp": "2025-05-23T02:32:26Z"
  },
  {
    "title": "Tariffs won't bring manufacturing jobs back to America, Wells Fargo analysts say",
    "description": "Despite some high-profile pledges to invest in domestic manufacturing, Wells Fargo doesn't see an increase in factory jobs in the foreseeable future.",
    "link": "https://www.businessinsider.com/tariffs-wont-bring-manufacturing-jobs-back-wells-fargo-analysts-say-2025-5",
    "timestamp": "2025-05-23T02:31:46Z"
  },
  {
    "title": "Outside Trump's meme coin dinner: Tuxedos, luxury SUVs and a protest",
    "description": "President Donald Trump held a private event Thursday night for 220 crypto investors who had bought into his meme coin, defying bipartisan concerns from lawmakers that he was selling access to accumulate personal wealth.",
    "link": "https://biztoc.com/x/d9e021af516bdefc",
    "timestamp": "2025-05-23T02:31:41Z"
  },
  {
    "title": "How the Trump administration's move will affect Harvard's international students",
    "description": "The move could significantly affect the university, which enrols nearly 6,800 international students, most of them in graduate programmes. Those students may now have to scramble to figure out their next steps",
    "link": "https://www.thehindubusinessline.com/news/world/how-the-trump-administrations-move-will-affect-harvards-international-students/article69608962.ece",
    "timestamp": "2025-05-23T02:31:23Z"
  },
  {
    "title": "Trump admin sows doubt over vaccines in 'Make America Healthy Again' report",
    "description": "by Issam AHMEDA highly anticipated White House report outlining Health Secretary Robert F. Kennedy Jr.'s agenda devotes significant space to raising alarm over vaccines, while touching on environmental and nutrition concerns that remain at odds with broader a…",
    "link": "https://www.rawstory.com/trump-vaccines-2672191108/",
    "timestamp": "2025-05-23T02:29:57Z"
  },
  {
    "title": "Jon Stewart Shreds Democrats With Idea For New 3-Word Slogan",
    "description": "But the \"Daily Show\" host said Democrats have \"sown the seeds for a real\" and \"interesting\" reinvention of the party.",
    "link": "https://www.huffpost.com/entry/jon-stewart-democrats-2028-joe-biden-cover-up_n_682fb8e4e4b0239ca9a6ecf8",
    "timestamp": "2025-05-23T02:28:27Z"
  },
  {
    "title": "Alleged US killer of Israel embassy staff charged with murder",
    "description": "by Ben Sheppard and Sarah TittertonThe suspect accused of gunning down two Israeli embassy staffers outside a Jewish museum in Washington was charged Thursday with murder, as international tensions over anti-Semitism erupted over the attack.Elias Rodriguez, 3…",
    "link": "https://www.rawstory.com/us-embassy-israel-2672191107/",
    "timestamp": "2025-05-23T02:28:12Z"
  },
  {
    "title": "The moral center",
    "description": "Finding a moral center seems a necessary endeavor for a civil society to grow and thrive.",
    "link": "https://www.ncspin.com/the-moral-center",
    "timestamp": "2025-05-23T02:26:27Z"
  },
  {
    "title": "FTC probes Media Matters over Elon Musk's X boycott claims, document shows",
    "description": "The demand seeks all documents Media Matters, a Washington, DC-based liberal advocacy group, has produced or received in the X lawsuit related to advertiser boycotts. FTC Chairman Andrew Ferguson, who was appointed by president Donald Trump to run the agency,…",
    "link": "https://economictimes.indiatimes.com/tech/technology/ftc-probes-media-matters-over-elon-musks-x-boycott-claims-document-shows/articleshow/121350762.cms",
    "timestamp": "2025-05-23T02:26:00Z"
  },
  {
    "title": "'Orgy of corruption': Investors descend on Trump's $148m meme coin dinner amid protests",
    "description": "Donald Trump hosted a dinner for investors in his meme coin on Thursday, as critics warned the US president was putting personal profit first.",
    "link": "https://news.sky.com/story/investors-descend-on-trumps-golf-club-for-148m-meme-coin-dinner-amid-protests-13373098",
    "timestamp": "2025-05-23T02:24:00Z"
  },
  {
    "title": "Food dyes, sick kids and a dip in contaminated water: RFK Jr. weighs in on his first 100 days",
    "description": "Health Secretary Robert F. Kennedy Jr. told NBC News that the Trump administration is simplifying the dietary guidelines meant to advise Americans on healthy eating.",
    "link": "https://www.nbcnews.com/health/health-news/rfk-jr-chemicals-sick-kids-swim-contaminated-water-rcna208576",
    "timestamp": "2025-05-23T02:23:27Z"
  },
  {
    "title": "How Trump's Decision Will Affect Harvard's International Students",
    "description": "President Donald Trump&#039;s administration escalated its standoff with Harvard University on Thursday, revoking the school&#039;s ability to enroll international students.",
    "link": "https://www.ndtv.com/world-news/how-trumps-decision-will-affect-harvards-international-students-8484994",
    "timestamp": "2025-05-23T02:23:18Z"
  },
  {
    "title": "President Trump Participates in a MAHA Event with HHS Secretary Robert F Kennedy Jr",
    "description": "Earlier today, President Donald Trump, HHS Secretary Robert F Kennedy Jr and various cabinet officials within the Make America Healthy Again administration, took part in a MAHA commission event at the White House. WATCH:",
    "link": "https://freerepublic.com/focus/f-bloggers/4318625/posts",
    "timestamp": "2025-05-23T02:20:56Z"
  },
  {
    "title": "Senate Votes to Overturn California’s Electric Vehicle Mandate in Major Blow to Climate Change Activists",
    "description": "The Senate has voted to overturn the electric vehicle mandate in the state of California.\nThe post Senate Votes to Overturn California’s Electric Vehicle Mandate in Major Blow to Climate Change Activists appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/senate-votes-overturn-californias-electric-vehicle-mandate-major/",
    "timestamp": "2025-05-23T02:20:07Z"
  },
  {
    "title": "What is Trump's deal with SALT? Here's how the new state and local tax deductions in US President's tax bill would impact you",
    "description": "A U.S. House bill proposes raising the federal deduction cap for state and local taxes (SALT) to $40,000, potentially benefiting affluent earners in high-tax states. This adjustment, phasing out for incomes over $500,000, aims to provide financial relief, esp…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-is-trumps-deal-with-salt-heres-how-the-new-state-and-local-tax-deductions-in-us-presidents-tax-bill-would-impact-you/articleshow/121350646.cms",
    "timestamp": "2025-05-23T02:19:41Z"
  },
  {
    "title": "Dollar set to snap 4-week winning streak on US fiscal health worries",
    "description": "The U.S. dollar is poised for its first weekly decline in five weeks against the euro and yen amid concerns over U.S. fiscal health, triggered by debt pile and Trump's tax bill. Investors are fleeing U.S. assets, mirroring a previous \"Sell America\" trend, as …",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-set-to-snap-4-week-winning-streak-on-us-fiscal-health-worries/articleshow/121350636.cms",
    "timestamp": "2025-05-23T02:18:53Z"
  },
  {
    "title": "Outside Trump's meme coin dinner: Tuxedos, luxury SUVs and a protest",
    "description": "President Donald Trump held a private event Thursday night for 220 crypto investors who had bought into his meme coin, defying bipartisan concerns from lawmakers that he was selling access to accumulate personal wealth.",
    "link": "https://www.nbcnews.com/tech/crypto/trumps-meme-coin-dinner-tuxedos-luxury-suvs-protesters-rcna208647",
    "timestamp": "2025-05-23T02:18:31Z"
  },
  {
    "title": "Piyush Goyal meets US Secretary Howard Lutnick for a mutually beneficial India-US trade agreement",
    "description": "Piyush Goyal and Howard Lutnick met to discuss a trade agreement. Both nations want stronger economic ties. India and the US may sign a Bilateral Trade Agreement soon. India seeks concessions on leather and textiles. They aim to increase exports. The US was I…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/piyush-goyal-meets-us-secretary-howard-lutnick-for-a-mutually-beneficial-india-us-trade-agreement/articleshow/121350624.cms",
    "timestamp": "2025-05-23T02:18:14Z"
  },
  {
    "title": "Election lies coming to a North Carolina school near you",
    "description": "An Oklahoma state school superintendent is mandating that all students there, K through 12, will study conspiracy theories about the 2020 presidential election",
    "link": "https://www.ncspin.com/election-lies-coming-to-a-north-carolina-school-near-you",
    "timestamp": "2025-05-23T02:18:05Z"
  },
  {
    "title": "Defense secretary announces pay raises for Army paratroopers: 'We have you and your families in mind'",
    "description": "Secretary of Defense Pete Hegseth pledges to restore military's 'warrior ethos' and announces pay raises for Army paratroopers in Fort Bragg speech.",
    "link": "https://www.foxnews.com/politics/defense-secretary-announces-pay-raises-army-paratroopers-you-your-families-in-mind",
    "timestamp": "2025-05-23T02:17:24Z"
  },
  {
    "title": "Trump's Harvard visa threat could wipe out several of the school's sports teams",
    "description": "Some of Harvard's sports teams would be virtually wiped out by a Trump administration decision announced on Thursday that would make the Ivy League school with the nation's largest athletic program ineligible for international student visas.",
    "link": "https://www.cbc.ca/sports/trump-harvard-sports-1.7541769",
    "timestamp": "2025-05-23T02:14:31Z"
  },
  {
    "title": "Explainer: What do we know about Qatar's Air Force One gift to Trump?",
    "description": "WASHINGTON, May 22 (Xinhua) -- The Pentagon announced Wednesday that the United States has accepted",
    "link": "http://en.people.cn/n3/2025/0523/c90000-20318736.html",
    "timestamp": "2025-05-23T02:11:01Z"
  },
  {
    "title": "Tucker Carlson Agrees — Trump Organization's Middle East Deals Seem 'Like Corruption'",
    "description": "Earlier this week, Tucker Carlson agreed with a guest on his show who questioned whether Donald Trump's foreign policy overlapped with his family's business ventures.\nWhat Happened: On an episode of The Tucker Carlson Show, which Carlson started on Elon Musk'…",
    "link": "https://biztoc.com/x/40dbde72d62f9406",
    "timestamp": "2025-05-23T02:09:27Z"
  },
  {
    "title": "Jensen Huang joins Trump in the Middle East—Nvidia's real AI agenda goes global",
    "description": "While reporters gathered at Taipei's Songshan Airport on May 12 hoping to spot Nvidia CEO Jensen Huang, he was already in the Middle East, accompanying US President Donald Trump on a high-profile state visit to Saudi Arabia and the United Arab Emirates (UAE).…",
    "link": "https://www.digitimes.com/news/a20250523PD207/nvidia-jensen-huang-middle-east-saudi-arabia-us-chip-restrictions.html",
    "timestamp": "2025-05-23T02:08:11Z"
  },
  {
    "title": "Markey: We Have to Fight 'Dictator' Trump — 'Authoritarianism on Steroids'",
    "description": "Thursday on MSNBC's \"All In,\" Sen. Ed Markey (D-MA) called President Donald Trump a \"dictator\" while discussing his actions against Harvard University.\nThe post Markey: We Have to Fight ‘Dictator’ Trump — ‘Authoritarianism on Steroids’ appeared first on Breit…",
    "link": "https://www.breitbart.com/clips/2025/05/22/markey-we-have-to-fight-dictator-trump-authoritarianism-on-steroids/",
    "timestamp": "2025-05-23T02:04:14Z"
  },
  {
    "title": "What Harvard Said On Trump Halting Its Ability To Enroll Foreign Students",
    "description": "There were over 6,000 international students enrolled at Harvard during the 2024-2025 academic year, representing 27.3 per cent of the student body.",
    "link": "https://www.ndtv.com/world-news/harvard-as-trump-bars-university-from-enrolling-foreign-students-unlawful-8484905",
    "timestamp": "2025-05-23T02:02:23Z"
  }
]