[
  {
    "title": "Trump’s Pharma Threats Take Tariffs Into Uncharted Territory",
    "description": "For more than three decades, the pharmaceutical sector has been protected from tariffs by a World Trade Organization agreement designed to improve access to life-saving drugs.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-pharma-threats-take-tariffs-into-uncharted-territory",
    "timestamp": "2025-04-01T11:34:56Z"
  },
  {
    "title": "China holds large-scale military drills around Taiwan",
    "description": "China on Tuesday sent its army, navy, air and rocket forces to surround Taiwan for large-scale drills Beijing said were aimed at practising for \"precision strikes\" and a blockade of the self-ruled island. - Potential flashpoint - China has carried out multipl…",
    "link": "https://economictimes.indiatimes.com/news/defence/china-holds-large-scale-military-drills-around-taiwan/articleshow/119865148.cms",
    "timestamp": "2025-04-01T11:34:40Z"
  },
  {
    "title": "Chinese military launches large-scale drills around Taiwan",
    "description": "The Chinese military has announced large-scale drills around Taiwan as it again warned the self-ruled island against seeking formal independence",
    "link": "https://abcnews.go.com/International/wireStory/chinese-military-launches-large-scale-drills-taiwan-120357387",
    "timestamp": "2025-04-01T11:34:25Z"
  },
  {
    "title": "Sen. Cory Booker has been making a marathon speech on the Senate floor",
    "description": "Senator Cory Booker is from New Jersey, and before he was elected to the US Senate, he was a popular mayor and considered the future of the New Jersey Democratic Party. He’s gotten a lot of national buzz as well, and in their time together in the Senate, he w…",
    "link": "https://www.celebitchy.com/916101/sen_cory_booker_has_been_making_a_marathon_speech_on_the_senate_floor/",
    "timestamp": "2025-04-01T11:33:52Z"
  },
  {
    "title": "Facing US tariffs, Canadians hunt for business in Europe",
    "description": "With his small steel mill facing hefty US tariffs, Canadian businessman Chris Wyatt is hunting for new European customers at the world’s biggest industrial technology fair in Germany. “There’s uncertainty in the markets so big projects are being shelved or th…",
    "link": "https://www.digitaljournal.com/world/facing-us-tariffs-canadians-hunt-for-business-in-europe/article",
    "timestamp": "2025-04-01T11:32:33Z"
  },
  {
    "title": "Trump signs executive order targeting ticket scalping",
    "description": "With American entertainer Kid Rock at his side, US President Donald Trump signed an executive order Monday clamping down on ticket scalping and live event pricing. The directive seeks to prevent “unscrupulous middlemen” from profiting off reselling tickets fo…",
    "link": "https://www.digitaljournal.com/world/trump-signs-executive-order-targeting-ticket-scalping/article",
    "timestamp": "2025-04-01T11:32:32Z"
  },
  {
    "title": "Trump signs executive order targeting ticket scalping",
    "description": "With American entertainer Kid Rock at his side, US President Donald Trump signed an executive order Monday clamping down on ticket scalping.\nThe post Trump signs executive order targeting ticket scalping appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/entertainment/trump-signs-executive-order-targeting-ticket-scalping/article",
    "timestamp": "2025-04-01T11:32:32Z"
  },
  {
    "title": "How States Can Help President Trump Make America Great Again",
    "description": "American greatness starts with refocusing our politics on families and expectations that citizens take responsibility for themselves.",
    "link": "https://thefederalist.com/2025/04/01/how-states-can-help-president-trump-make-america-great-again/",
    "timestamp": "2025-04-01T11:32:03Z"
  },
  {
    "title": "Is US exceptionalism dying? Economist El-Erian says it's under 'enormous pressure' — how you can invest",
    "description": "Experts say America is at risk of losing its edge under Trump.",
    "link": "https://finance.yahoo.com/news/us-exceptionalism-dying-economist-el-113200006.html",
    "timestamp": "2025-04-01T11:32:00Z"
  },
  {
    "title": "Timeline Of Iran's Long Rivalry With United States",
    "description": "Relations between Iran and the United States - once strong allies - have often been mistrustful and sometimes openly hostile since Iran&#039;s 1979 revolution.",
    "link": "https://www.ndtv.com/world-news/timeline-of-irans-long-rivalry-with-united-states-8061671",
    "timestamp": "2025-04-01T11:31:40Z"
  },
  {
    "title": "Trump Aides Draft Tariff Plans",
    "description": "“White House aides have drafted a proposal to impose tariffs of around 20 percent on most imports to the United States, as President Donald Trump pushes for the most aggressive overhaul of the global economic",
    "link": "https://politicalwire.com/2025/04/01/trump-aides-draft-tariff-plans/",
    "timestamp": "2025-04-01T11:31:35Z"
  },
  {
    "title": "France’s antitrust authority fines Apple €150M for issues related to its App Tracking Transparency",
    "description": "France fines Apple €150M for abusing its dominance in ATT consent practices on iOS and iPadOS from 2021 to 2023. France’s Autorité de la concurrence fined Apple €150M for abusing its dominance in App Tracking Transparency (ATT) consent practices on iOS and iP…",
    "link": "https://securityaffairs.com/176092/laws-and-regulations/frances-antitrust-authority-fines-apple-e150m.html",
    "timestamp": "2025-04-01T11:30:59Z"
  },
  {
    "title": "LGBTQ Activists Rally at Newsom’s Home, Demand Stronger Trans Rights Commitment",
    "description": "As part of International Transgender Day of Visibility, advocates called on state leaders to reaffirm their commitment to trans rights after attacks by Gov. Gavin Newsom and the Trump administration.",
    "link": "https://www.kqed.org/news/12033818/lgbtq-activists-rally-at-newsoms-home-demand-stronger-trans-rights-commitment",
    "timestamp": "2025-04-01T11:30:47Z"
  },
  {
    "title": "'Given me no reason...': NASA astronauts thank Trump, Elon Musk after 286-day space ordeal",
    "description": "Days after NASA astronauts Sunita Williams and Butch Wilmore returned to Earth, they spoke about their extended space mission at length. The duo thanked US President Donald Trump and SpaceX owner Elon Musk for their involvement in getting them back down. Trum…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-sunita-williams-butch-wilmore-given-me-no-reason-nasa-astronauts-thank-trump-elon-musk-after-286-day-space-ordeal/articleshow/119864766.cms",
    "timestamp": "2025-04-01T11:30:42Z"
  },
  {
    "title": "Sen. Chris Coons says Democrats lost more 'to the couch' than to Trump in 2024",
    "description": "Delaware Sen. Chris Coons argued that Democrats lost to President Donald Trump in the 2024 elections due to many Americans not voting rather than on policies.",
    "link": "https://www.foxnews.com/media/sen-chris-coons-says-democrats-lost-more-to-couch-than-trump-2024",
    "timestamp": "2025-04-01T11:30:36Z"
  },
  {
    "title": "Eurozone Inflation Eases In March As Tariff Threat Looms",
    "description": "Inflation in the eurozone slowed further in March, official data showed on Tuesday, indicating possible breathing room for policymakers despite the threat of turbulence from US trade tariffs.",
    "link": "https://www.ibtimes.com/eurozone-inflation-eases-march-tariff-threat-looms-3768413",
    "timestamp": "2025-04-01T11:30:22Z"
  },
  {
    "title": "Sen. Chuck Grassley Introduces ‘Judicial Relief Clarification Act’ to Rein in Activist Judges",
    "description": "Senate Judiciary Committee Chairman Chuck Grassley (R-Iowa) introduced a proposal Monday to rein in judicial injunctions like the ones currently hampering President Donald Trump’s popular MAGA agenda. The Judicial Relief Clarification Act of 2025 (JRCA) would…",
    "link": "https://freerepublic.com/focus/f-chat/4308091/posts",
    "timestamp": "2025-04-01T11:30:15Z"
  },
  {
    "title": "The latest White House-press corps kerfuffle is over who sits where — and a whole lot more",
    "description": "Take your seat. The question now is — where, exactly, is that seat? Those in the White House press corps might soon be asking that question. In Monday’s newsletter, I […]\nThe post The latest White House-press corps kerfuffle is over who sits where — and a who…",
    "link": "https://www.poynter.org/commentary/2025/white-house-correspondents-association-seating-chart/",
    "timestamp": "2025-04-01T11:30:12Z"
  },
  {
    "title": "Poilievre tells Fredericton rally he'll make Canada stronger as it stands up to Trump",
    "description": "With supporters from across New Brunswick packed into the Fredericton Exhibition Grounds, Pierre Poilievre gave a nearly-hour-long speech hitting on most of his campaign promises.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/fredericton-poilievre-rally-1.7498619",
    "timestamp": "2025-04-01T11:29:43Z"
  },
  {
    "title": "GOP senator’s effort to end decades-old voting law slammed by thousands in Oregon",
    "description": "Thousands of Oregonians submitted letters opposing a Republican senator’s long-shot attempt to ask voters whether to repeal the state’s decades-old mail voting law, swamping the Legislature’s website on Monday.\nThe outcry against Sen. David Brock Smith’s Sena…",
    "link": "https://www.rawstory.com/gop-senator-hit/",
    "timestamp": "2025-04-01T11:28:25Z"
  },
  {
    "title": "Fox’s Peter Doocy Roasts Kid Rock Over Bizarre Outfit in Oval Office Visit",
    "description": "Fox News White House correspondent Peter Doocy brutally roasted a patriotically-bedazzled Kid Rock during an eyebrow-raising Oval Office appearance with President Donald Trump on Monday.\nThe post Fox’s Peter Doocy Roasts Kid Rock Over Bizarre Outfit in Oval O…",
    "link": "https://www.mediaite.com/tv/foxs-peter-doocy-roasts-kid-rock-to-his-face-over-bizarre-outfit-in-oval-office-visit/",
    "timestamp": "2025-04-01T11:26:48Z"
  },
  {
    "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
    "description": "Employees across the massive U.S. Health and Human Services Department have begun receiving notices of dismissal in an overhaul ultimately expected to lay off up to 10,000 people.",
    "link": "https://www.clickondetroit.com/health/2025/04/01/layoffs-begin-at-the-nations-health-agencies/",
    "timestamp": "2025-04-01T11:26:18Z"
  },
  {
    "title": "View: Reciprocal tariffs? We’ve seen this movie before",
    "description": "President Trump announced plans for 'reciprocal tariffs,' where the US will match the tariffs and non-tariff barriers that American exporters face. This move could lead to extended international negotiations with multiple countries, potentially causing signif…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/reciprocal-tariffs-weve-seen-this-movie-before/articleshow/119863859.cms",
    "timestamp": "2025-04-01T11:26:10Z"
  },
  {
    "title": "Europe says that it holds a lot of trade cards on the eve of Trump’s tariff ‘Liberation Day’",
    "description": "The European Commission President issued a warning to President Donald Trump on the eve of his tariff \"Liberation Day.\"",
    "link": "https://www.bostonherald.com/2025/04/01/europe-trump-tariffs-warning/",
    "timestamp": "2025-04-01T11:24:50Z"
  },
  {
    "title": "Trump Says TikTok Deal to Come This Week",
    "description": "“President Donald Trump said a deal with TikTok's Chinese parent ByteDance to sell the short video app used by 170 million Americans would be struck before a deadline on Saturday,” Reuters reports.",
    "link": "https://politicalwire.com/2025/04/01/trump-says-tiktok-deal-to-come-this-week/",
    "timestamp": "2025-04-01T11:22:33Z"
  },
  {
    "title": "Satellites Find NATO Aircraft Carrier Near Red Sea Amid US Airstrikes",
    "description": "The French aircraft carrier, FS 'Charles de Gaulle', is currently on a five-month Indo-Pacific deployment.",
    "link": "https://www.newsweek.com/france-news-charles-de-gaulle-aircraft-carrier-djibouti-red-sea-2053480",
    "timestamp": "2025-04-01T11:22:10Z"
  },
  {
    "title": "Legal turmoil grips Israel as Netanyahu faces growing protests",
    "description": "Israeli Prime Minister Benjamin Netanyahu is currently ensnared in a deepening of political upheaval, exacerbated by a burgeoning corruption scandal entangling his close advisors and a contentious debate over the ousting of the intelligence agency’s chief.",
    "link": "https://www.hurriyetdailynews.com/legal-turmoil-grips-israel-as-netanyahu-faces-growing-protests-207563",
    "timestamp": "2025-04-01T11:20:49Z"
  },
  {
    "title": "GROK: Kenyans have been turning to the popular AI chatbot for political answers and the results are intriguing",
    "description": "Grok, the popular AI chatbot domiciled on Elon Musk's X platform, has gained widespread popularity with Kenyans on X after thousands of curious - or just cheeky - users turned to it for political, cultural and even personal answers.",
    "link": "https://www.citizen.digital/entertainment/grok-kenyans-have-been-turning-to-the-popular-ai-chatbot-for-political-answers-and-the-results-are-intriguing-n360228",
    "timestamp": "2025-04-01T11:20:02Z"
  },
  {
    "title": "Who ranks higher in junior golf: Kai Trump or Charlie Woods? Here’s what we know",
    "description": "Both Kai and Charlie recently rose in junior golf rankings. Here’s where they rank in junior golf and what we know about their budding golf careers.",
    "link": "https://www.palmbeachpost.com/story/news/2025/04/01/charlie-woods-kai-trump-ranking-junior-golf-ajga-high-school-nil-deals/82737101007/",
    "timestamp": "2025-04-01T11:19:46Z"
  },
  {
    "title": "The Democrats Have a Bold New Strategy To Win Back Their Base: Throwing Trans People Into Volcanos",
    "description": "When pressed on why the method of volcanos, Schumer explained that it was time to reclaim the color orange from the current president and \"everyone likes explosions.\"\nThe post The Democrats Have a Bold New Strategy To Win Back Their Base: Throwing Trans Peopl…",
    "link": "http://www.autostraddle.com/the-democrats-have-a-bold-new-strategy-to-win-back-their-base-throwing-trans-people-into-volcanos/",
    "timestamp": "2025-04-01T11:19:18Z"
  },
  {
    "title": "4 Mistakes the Upper Middle Class Are Making With Their Money in the Trump Economy",
    "description": "As President Donald Trump’s second term is now in full swing, many upper-middle-class Americans are making financial moves that feel smart now but could backfire later. From reactive investment decisions to unsustainable spending habits, these short-term deci…",
    "link": "https://biztoc.com/x/34acc908f4879f4e",
    "timestamp": "2025-04-01T11:18:33Z"
  },
  {
    "title": "Marine Le Pen brought the far right to France’s front door",
    "description": "For years, Marine Le Pen stood at the gates of power — poised, relentless and rising",
    "link": "https://abcnews.go.com/International/wireStory/marine-le-pen-brought-frances-front-door-120345852",
    "timestamp": "2025-04-01T11:18:26Z"
  },
  {
    "title": "Trump aides reportedly proposing tariffs of around 20% on most U.S. imports",
    "description": "White House aides are proposing tariffs of around 20 per cent on most U.S. imports, the Washington Post reported on Tuesday, as markets and consumers await details of U.S. President Donald Trump’s reciprocal tariff plan.\nTrump, who has promised to unveil his …",
    "link": "https://biztoc.com/x/17aa00a0e5d87ee5",
    "timestamp": "2025-04-01T11:18:22Z"
  },
  {
    "title": "Poll shows more than 50% of Ukrainians fear Trump's efforts may lead to unjust peace",
    "description": "(Reuters) - More than 50% of Ukrainians are critical of U.S. President Donald Trump's peace efforts, fearing they are likely to lead to a partly unjust or completely unfair end to Russia's war on their country, a Ukrainian pollster said on Tuesday. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/04/01/poll-shows-more-than-50-of-ukrainians-fear-trump039s-efforts-may-lead-to-unjust-peace",
    "timestamp": "2025-04-01T11:18:00Z"
  },
  {
    "title": "Trump set to unveil reciprocal tariffs in Wednesday announcement",
    "description": "President Donald Trump is expected to announce reciprocal tariffs on allies and adversaries worldwide, with the specifics under wraps until an announcement in the Rose Garden on Wednesday. The uncertainty is leaving businesses and buyers guessing at what the …",
    "link": "https://www.today.com/video/concerns-grow-over-upcoming-rollout-of-trump-s-reciprocal-tariffs-235947077640",
    "timestamp": "2025-04-01T11:15:58Z"
  },
  {
    "title": "D-Day for Musk: Democrats in Special Elections Target Trump's DOGE Chief (Jonathan Martin/Politico)",
    "description": "Jonathan Martin / Politico:\nD-Day for Musk: Democrats in Special Elections Target Trump's DOGE Chief  —  Special Elections Reveal Trump's Weak Spot: Elon Musk  —  DAYTONA BEACH, Fla. — Trumpeting new tariffs he hopes will return industry to America, President…",
    "link": "https://www.memeorandum.com/250401/p10",
    "timestamp": "2025-04-01T11:15:00Z"
  },
  {
    "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
    "description": "The notices come just days after President Donald Trump moved to strip workers of their collective bargaining rights at HHS and other agencies throughout the...",
    "link": "https://www.yahoo.com/news/layoffs-begin-nations-health-agencies-111439428.html",
    "timestamp": "2025-04-01T11:14:39Z"
  },
  {
    "title": "Ashley St. Clair sold her Tesla after Elon Musk reduced her child support",
    "description": "It’s been a minute since we checked in on Ashley St. Clair, the MAGA wingnut who successfully honey-trapped Elon Musk into putting a baby in her via IVF (??). A couple of months ago, Ashley announced that she gave birth to their son, Elon’s 13th child, late l…",
    "link": "https://www.celebitchy.com/915960/ashley_st_clair_sold_her_tesla_after_elon_musk_reduced_her_child_support/",
    "timestamp": "2025-04-01T11:12:57Z"
  },
  {
    "title": "Pro-marijuana group aims to sway Trump by airing ads around White House and Mar-a-Lago | CNN Politics",
    "description": "President Donald Trump as a candidate vowed to decriminalize marijuana. Now, commercials carrying reminders of Trump’s promises will air on televisions where the president spends most of his time.",
    "link": "https://www.cnn.com/2025/04/01/politics/trump-marijuana-ads/index.html",
    "timestamp": "2025-04-01T11:11:28Z"
  },
  {
    "title": "Tight ropewalk for India as Trump threatens secondary tariffs on Russian crude",
    "description": "US President Donald Trump’s threat of secondary tariffs on countries buying Russian crude oil has infused “uncertainty” with Indian government officials pointing to a “tight ropewalk”.",
    "link": "https://www.thehindubusinessline.com/economy/tight-ropewalk-for-india-as-trump-threatens-secondary-tariffs-on-russian-crude/article69399819.ece",
    "timestamp": "2025-04-01T11:10:36Z"
  },
  {
    "title": "Judge in long-running lawsuit declines to block the use of Georgia's voting system",
    "description": "A federal judge has declined to block the use of Georgia’s electronic voting system in a long-running lawsuit that alleged that the system is vulnerable to attack and has operational issues that could deprive voters of their constitutional rights. The judge f…",
    "link": "https://www.seattlepi.com/news/politics/article/judge-in-long-running-lawsuit-declines-to-block-20252272.php",
    "timestamp": "2025-04-01T11:10:03Z"
  },
  {
    "title": "China holds large-scale military drills around Taiwan",
    "description": "Taipei (AFP) April 1, 2025\n\n\n China on Tuesday sent its army, navy, air and rocket forces to surround Taiwan for large-scale drills Beijing said were aimed at practising for \"precision strikes\" and a blockade of the self-ruled island. \n\nTaiwan dispatched its …",
    "link": "https://www.sinodaily.com/reports/China_holds_large-scale_military_drills_around_Taiwan_999.html",
    "timestamp": "2025-04-01T11:09:11Z"
  },
  {
    "title": "Safely back on Earth, once-stranded US astronauts ready to fly again",
    "description": "Houston (AFP) Mar 31, 2025\n\n\n After spending more than nine months stranded in space, two American astronauts confirmed Monday that they're ready to blast off again aboard a Boeing Starliner, the very spacecraft that could not return them to Earth. \n\nIn their…",
    "link": "https://www.spacedaily.com/reports/Safely_back_on_Earth_once-stranded_US_astronauts_ready_to_fly_again_999.html",
    "timestamp": "2025-04-01T11:09:11Z"
  },
  {
    "title": "Trump’s week of tests",
    "description": "The News\nPresident Donald Trump is getting ready to unveil a broad swath of tariffs on Wednesday, posing a major test for the markets, the US economy, and his seemingly unshakable support within the Republican Party. \nTrump isn’t currently considering exempti…",
    "link": "https://biztoc.com/x/9b9e7a962deface2",
    "timestamp": "2025-04-01T11:07:30Z"
  },
  {
    "title": "Trump's War on the Press",
    "description": "A month before last November's presidential election, 60 Minutes aired an interview with Democratic nominee Kamala Harris that was edited to make her response to a question about Israel \"more succinct,\" as the show's producers put it. But Donald Trump, the Re…",
    "link": "https://biztoc.com/x/4e1b261fd4ddea4b",
    "timestamp": "2025-04-01T11:07:13Z"
  },
  {
    "title": "El Paso Mass Shooter Says He Was Acting At The Direction Of Trump",
    "description": "Patrick Crusius, the El Paso mass shooter, said he believed he was acting at the direction of Trump when he murdered 23 people and wounded 22 others at an El Paso Walmart in 2019, his defense lawyer told El Paso Matters. This wouldn't be the first attack that…",
    "link": "https://crooksandliars.com/2025/03/el-paso-mass-shooter-says-he-was-acting",
    "timestamp": "2025-04-01T11:06:59Z"
  },
  {
    "title": "Greenland PM Tells Trump To F*ck Off",
    "description": "The newly minted Greenland PM Jens-Frederik Nielsen told the Express his country will not belong to the US.\nTrump told NBC News that he'll use force if he has to, to take over Nielsen's country that is rich in minerals and the world's largest island.\nJens-Fre…",
    "link": "https://crooksandliars.com/2025/03/greenland-pm-tells-trump-fck",
    "timestamp": "2025-04-01T11:06:09Z"
  },
  {
    "title": "4 Mistakes the Upper Middle Class Are Making With Their Money in the Trump Economy",
    "description": "As President Donald Trump's second term is now in full swing, many upper-middle-class Americans are making financial moves that feel smart now but could...",
    "link": "https://finance.yahoo.com/news/4-mistakes-upper-middle-class-110512260.html",
    "timestamp": "2025-04-01T11:05:12Z"
  },
  {
    "title": "Two major elections and Karen Read murder case retrial: Morning Rundown",
    "description": "Today’s elections in Wisconsin and Florida will serve as a referendum on Donald Trump and Elon Musk.",
    "link": "https://www.nbcnews.com/news/us-news/wisconsin-florida-elections-karen-read-murder-retrial-morning-rundown-rcna199003",
    "timestamp": "2025-04-01T11:05:00Z"
  },
  {
    "title": "Trump Tariffs: Indian exporters prepare for potential turbulent times",
    "description": "Indian businesses are preparing for a challenging start to the financial year due to possible US reciprocal tariffs. Exporters in engineering goods, iron and steel, and aluminium are most affected, with $5 billion in shipments hit by new levies. Leather and a…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-tariffs-indian-exporters-prepare-for-potential-turbulent-times/articleshow/119863173.cms",
    "timestamp": "2025-04-01T11:04:57Z"
  },
  {
    "title": "Europe warns Trump: We have ‘a strong plan’ for retaliation against tariffs | CNN Business",
    "description": "Europe has “a strong plan” for striking back at the United States in response to Donald Trump’s tariff hikes “if necessary,” a top official said Tuesday on the eve of a long-anticipated announcement of massive import levies by the US president.",
    "link": "https://www.cnn.com/2025/04/01/business/europe-retaliation-plan-us-tariffs-intl/index.html",
    "timestamp": "2025-04-01T11:04:14Z"
  },
  {
    "title": "Trump Signs Executive Order To Combat Ticket Gouging, As Kid Rock And Industry Leaders Back Reform",
    "description": "The executive order directs key officials, including Treasury Secretary Scott Bessent and U.S. Attorney General Pam Bondi, to ensure full compliance with the tax laws and other regulations regarding ticket scalping.",
    "link": "https://www.ibtimes.com/trump-signs-executive-order-combat-ticket-gouging-kid-rock-industry-leaders-back-reform-3768404",
    "timestamp": "2025-04-01T11:04:01Z"
  },
  {
    "title": "African workers are taking on Meta and the world should pay attention",
    "description": "A landmark case could see Meta forced to take responsibility for workers’ rights abuses not just in Kenya but globally.",
    "link": "https://www.aljazeera.com/opinions/2025/4/1/african-workers-are-taking-on-meta-and-the-world-should-pay-attention",
    "timestamp": "2025-04-01T11:03:58Z"
  },
  {
    "title": "Vote, No April Foolin'! Tabs, Tues. Apr. 1, 2025",
    "description": "We will not bribe you a million dollars to vote. Sorry.",
    "link": "https://www.wonkette.com/p/vote-no-april-foolin-tabs-tues-apr",
    "timestamp": "2025-04-01T11:03:25Z"
  },
  {
    "title": "Elon Musk Tops Forbes’ 39th Annual Billionaires List",
    "description": "Forbes’ Definitive Ranking of the World’s Richest People Features More Billionaires Than Ever Before With A Record-Breaking 3,028",
    "link": "https://www.forbes.com/sites/forbespr/2025/04/01/elon-musk-tops-forbes-39th-annual-billionaires-list/",
    "timestamp": "2025-04-01T11:03:19Z"
  },
  {
    "title": "8 ways to look after your lungs this spring",
    "description": "Signs that pollen is aggravating a lung condition include shortness of breath, chest tightness, wheezing or coughing, says the experts.",
    "link": "https://www.the-independent.com/life-style/health-and-families/hay-fever-people-copd-asthma-pollen-b2725220.html",
    "timestamp": "2025-04-01T11:02:22Z"
  },
  {
    "title": "Cory Booker holds marathon speech on Senate floor: Watch live",
    "description": "U.S. Sen. Cory Booker is holding a marathon speech on the Senate floor criticizing the Trump administration. You can watch it live here.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/01/cory-booker-marathon-speech-senate-watch-live/82753124007/",
    "timestamp": "2025-04-01T11:00:58Z"
  },
  {
    "title": "First election test for Trump's term surprisingly close in FL, GOP looks to increase razor-thin House majority",
    "description": "Voters in two congressional districts in Florida head to the polls as Republicans aim to keep control of both solidly red seats and strengthen their fragile House majority, despite the Democrat candidates massive fundraising advantage.",
    "link": "https://www.foxnews.com/politics/first-election-test-trumps-term-surprisingly-close-fl-gop-looks-ncrease-thin-house-majority",
    "timestamp": "2025-04-01T11:00:06Z"
  },
  {
    "title": "Could Trump's Tariffs Lead to a Recession? What Experts Say",
    "description": "Economists have offered their views on whether Trump's \"Liberation Day\" will spell triumph or disaster for the U.S. economy.",
    "link": "https://www.newsweek.com/experts-trump-tariffs-recession-risks-2053407",
    "timestamp": "2025-04-01T11:00:02Z"
  },
  {
    "title": "A Grim Message for Iranians | Opinion",
    "description": "Politically, the Islamic Republic's very legitimacy is increasingly in doubt.",
    "link": "https://www.newsweek.com/grim-message-iranians-opinion-2051573",
    "timestamp": "2025-04-01T11:00:01Z"
  },
  {
    "title": "Don't fall for image of shirtless Musk with large gut holding leash at beach",
    "description": "An image authentically shows tech billionaire Elon Musk shirtless at a beach, displaying a very large gut and holding a leash.",
    "link": "https://www.snopes.com//fact-check/beach-image-musk-shirtless/",
    "timestamp": "2025-04-01T11:00:00Z"
  },
  {
    "title": "Tax Policy Uncertainty & Investment, A Look At Trump’s First Term",
    "description": "Recent academic research sheds light on the potential adverse effects of the uncertainty of the current tax policy that companies are facing.",
    "link": "https://www.forbes.com/sites/nathangoldman/2025/04/01/tax-policy-uncertainty--investment-a-look-at-trumps-first-term/",
    "timestamp": "2025-04-01T11:00:00Z"
  },
  {
    "title": "How to avoid the Signal mistakes the Trump administration made",
    "description": "Welcome to Your Password Sucks, the Daily Dot newsletter that answers all your internet security-related questions.\nToday, we’ll discuss how to use Signal’s group chat feature without exposing your private information like President Donald Trump’s advisors.\nI…",
    "link": "https://www.dailydot.com/debug/signal-trump-team-mistakes-avoid/",
    "timestamp": "2025-04-01T11:00:00Z"
  },
  {
    "title": "'Thinning patience' with Trump as deal-making promises crumble: report",
    "description": "President Donald Trump's vows to solve major geopolitical conflicts quickly during the 2024 presidential campaign have run headlong into reality, and Axios reports that there is \"thinning patience at home and abroad\" with his approach to deal making.The publi…",
    "link": "https://www.rawstory.com/trump-failures-2671649143/",
    "timestamp": "2025-04-01T10:58:31Z"
  },
  {
    "title": "John Bolton Hits Out at Steve Witkoff: 'Propaganda Vehicle for Putin'",
    "description": "Witkoff has been dealing with Russia in the negotiations to end its war on Ukraine.",
    "link": "https://www.newsweek.com/john-bolton-hits-out-steve-witkoff-propaganda-vehicle-putin-2053536",
    "timestamp": "2025-04-01T10:58:30Z"
  },
  {
    "title": "Senate Dem to block VA nominees to protest DOGE cuts",
    "description": "President Donald Trump's nominees at the Department of Veterans Affairs face a new roadblock to Senate confirmation in Sen. Ruben Gallego.",
    "link": "https://www.foxnews.com/politics/senate-dem-block-va-nominees-protest-doge-cuts",
    "timestamp": "2025-04-01T10:57:38Z"
  },
  {
    "title": "House Dem to block VA nominees to protest DOGE cuts",
    "description": "President Donald Trump's nominees at the Department of Veterans Affairs face a new roadblock to Senate confirmation in Sen. Ruben Gallego.",
    "link": "https://www.foxnews.com/politics/house-dem-block-va-nominees-protest-doge-cuts",
    "timestamp": "2025-04-01T10:57:38Z"
  },
  {
    "title": "Facing US Tariffs, Canadians Hunt For Business In Europe",
    "description": "With his small steel mill facing hefty US tariffs, Canadian businessman Chris Wyatt is hunting for new European customers at the world's biggest industrial technology fair in Germany.",
    "link": "https://www.ibtimes.com/facing-us-tariffs-canadians-hunt-business-europe-3768408",
    "timestamp": "2025-04-01T10:57:17Z"
  },
  {
    "title": "As Trump threatens secondary sanctions on Russia, Kremlin says it is continuing to talk to US",
    "description": "MOSCOW (Reuters) - The Kremlin said on Tuesday that Russia was continuing its dialogue with the United States amid threats by President Donald Trump to levy secondary sanctions on Russian oil if Moscow does not work to end the war in Ukraine. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/01/as-trump-threatens-secondary-sanctions-on-russia-kremlin-says-it-is-continuing-to-talk-to-us",
    "timestamp": "2025-04-01T10:57:00Z"
  },
  {
    "title": "Canadians Leaf USA Out Of Travel Plans To Protest Trump",
    "description": "Canadians Leaf USA Out Of Travel Plans To Protest Trump\n \nPissed off Canadians are skipping trips to the United States over President Donald Trump's trade policies and 'disrespect' - after Trump's repeated calls to annex the northern neighbor as America's 51s…",
    "link": "https://biztoc.com/x/5c334a668435e05d",
    "timestamp": "2025-04-01T10:56:14Z"
  },
  {
    "title": "President Trump wants action from the Fed, but one bank president says April 2 has only delayed their cuts",
    "description": "Despite appointing Jerome Powell as Fed Chair, Donald Trump and his allies continue to criticize the Federal Reserve for not cutting interest rates, especially as new tariffs and economic policies create uncertainty. The Fed remains cautious, with officials l…",
    "link": "https://biztoc.com/x/783b8543bc179fd4",
    "timestamp": "2025-04-01T10:56:12Z"
  },
  {
    "title": "Trump is lining up the Supreme Court's easiest decision ever",
    "description": "President Donald Trump may defy the 22nd amendment's two term limit in hopes the Supreme Court rules in his favor like it did on the 14th amendment in Colorado.",
    "link": "https://biztoc.com/x/092219e92ca30983",
    "timestamp": "2025-04-01T10:56:10Z"
  },
  {
    "title": "EU has ‘strong plan’ to hit back at U.S. tariffs if needed, EU chief says",
    "description": "The European Union has a “strong plan” to retaliate against tariffs imposed, and set to be imposed, by U.S. President Donald Trump, although it would prefer to negotiate a solution, EU executive chief Ursula von der Leyen said on Tuesday.\nThe Trump administra…",
    "link": "https://biztoc.com/x/d14d7a8205b97b51",
    "timestamp": "2025-04-01T10:56:09Z"
  },
  {
    "title": "How Trump’s tariffs will affect the economy and your wallet",
    "description": "President Donald Trump during a Cabinet meeting at the White House, on March 24, 2025. | Samuel Corum/Sipa/Bloomberg via Getty Images\nDonald Trump has said that “tariff” is the “most beautiful word in the dictionary.” And throughout his first months in office…",
    "link": "https://biztoc.com/x/b6e4e4624732b354",
    "timestamp": "2025-04-01T10:55:53Z"
  },
  {
    "title": "Market plunges on tariff fears as indices close sharply lower ahead of Trump’s “Liberation Day”",
    "description": "The BSE Sensex sank 1,390.41 points or 1.80% to close at 76,024.51, while the Nifty 50 plunged 353.65 points or 1.5% to 23,165.70",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/stock-markets-go-into-a-tailspin-ahead-of-us-liberation-day-sensex-tanks-1390-pts/article69399851.ece",
    "timestamp": "2025-04-01T10:55:24Z"
  },
  {
    "title": "Stock markets go into a tailspin ahead of US 'Liberation Day'; Sensex tanks 1,390 pts",
    "description": "Starting the new financial year on a losing note, the 30-share BSE Sensex tanked 1,390.41 points or 1.80 per cent to settle at 76,024.51 as 28 of its components ended lower and only two advanced",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets-go-into-a-tailspin-ahead-of-us-liberation-day-sensex-tanks-1390-pts/article69399851.ece",
    "timestamp": "2025-04-01T10:55:24Z"
  },
  {
    "title": "Links 4/1/2025",
    "description": "Our knobby daily links: animal play, Covid excess deaths, climate change = more severe rain, China poaching Taiwan engineers? Le Pen barred from 2027 run, Gaza first responder massacre, Trump Ukraine negotiations stalled, Social Security service cut, judge ba…",
    "link": "https://www.nakedcapitalism.com/2025/04/links-4-1-2025.html",
    "timestamp": "2025-04-01T10:55:13Z"
  },
  {
    "title": "Will Trump's tariff wars affect the 2026 World Cup or 2028 LA Olympics?",
    "description": "As the United States prepares to welcome the world for FIFA’s Club World Cup this June, golf’s Ryder Cup in September, the World Cup next year and the Los Angeles Olympics in 2028, the question becomes: Will the world want to come",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-tariff-wars-canada-mexico-affect-2026-world-120363380",
    "timestamp": "2025-04-01T10:55:09Z"
  },
  {
    "title": "Crypto ETP outflows, explained — What investors need to know",
    "description": "What are crypto ETP outflows? \r\nCrypto ETPs give exposure to digital assets via traditional financial instruments. When more money exits these products rather than entering them, it is known as an “outflow” rather than an “inflow” — i.e., more people are sell…",
    "link": "https://cointelegraph.com/explained/crypto-etp-outflows-explained-what-investors-need-to-know",
    "timestamp": "2025-04-01T10:55:00Z"
  },
  {
    "title": "US criticises excessive, non-existent, DMA fines ahead of tariffs",
    "description": "Donald Trump is expected to announce tariffs tomorrow, 2 April, at 21:00 CET.",
    "link": "https://www.euractiv.com/section/tech/news/us-criticises-excessive-non-existent-dma-fines-ahead-of-tariffs/",
    "timestamp": "2025-04-01T10:54:10Z"
  },
  {
    "title": "As Future of Panama Canal Hangs in Balance, Mexico Quietly Begins Testing Its Interoceanic Rail Corridor",
    "description": "South Korean car manufacturer Hyundai just became the first company to use the rail corridor, which is being touted as a possible plan B to the embattled canal.   Just a few weeks ago, the Trump Administration was celebrating what seemed to be an early strate…",
    "link": "https://www.nakedcapitalism.com/2025/04/as-future-of-panama-canal-hangs-in-balance-mexico-quietly-inaugurates-its-interoceanic-rail-corridor.html",
    "timestamp": "2025-04-01T10:53:15Z"
  },
  {
    "title": "Howard Lutnick May Be the Fall Guy If Tariffs Go Wrong",
    "description": "“President Donald Trump is struggling to message a scattered economic agenda, but his Commerce secretary, Howard Lutnick, is taking the blame,” Politico reports. “White House and administration officials, as well as Trump’s outside allies, are",
    "link": "https://politicalwire.com/2025/04/01/howard-lutnick-may-be-the-fall-guy-if-tariffs-go-wrong/",
    "timestamp": "2025-04-01T10:53:09Z"
  },
  {
    "title": "Tariffs can be reversed, but it might be too late to avoid a recession",
    "description": "The U.S. economy is heading towards a potential recession due to contractionary policies: reduced federal government size, broad tariffs, and deportations. These policies risk job losses, business shutdowns, and low wage growth. The situation is compounded by…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tariffs-can-be-reversed-but-it-might-be-too-late-to-avoid-a-recession/articleshow/119862084.cms",
    "timestamp": "2025-04-01T10:52:58Z"
  },
  {
    "title": "Trump-linked crypto ventures may complicate US stablecoin policy",
    "description": "A US dollar-pegged stablecoin launched by a cryptocurrency platform tied to US President Donald Trump’s family could complicate ongoing bipartisan efforts to pass stablecoin legislation in Congress, raising concerns about potential conflicts of interest.The T…",
    "link": "https://cointelegraph.com/news/trump-crypto-ventures-complicate-us-stablecoin-policy",
    "timestamp": "2025-04-01T10:52:38Z"
  },
  {
    "title": "Ukrainian drone strikes passenger bus – Donbass officials",
    "description": "A Ukrainian kamikaze drone targeted a passenger bus in the city of Gorlovka, according to Russian officials Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615082-gorlovka-drone-strike-bus/",
    "timestamp": "2025-04-01T10:50:23Z"
  },
  {
    "title": "Options Pros Are Missing a Key Risk from Trump Tariff Escalation",
    "description": "Options traders are underpricing risks in materials stocks, allowing bearish investors to cheaply protect against losses wrought by President Donald Trump’s tariff agenda, according to a Barclays Plc strategist.",
    "link": "https://financialpost.com/pmn/business-pmn/options-pros-are-missing-a-key-risk-from-trump-tariff-escalation",
    "timestamp": "2025-04-01T10:49:07Z"
  },
  {
    "title": "Pardon His French? Quebec's Crush on Carney",
    "description": "With 78 of the 343 seats in the House of Commons, Quebec isn’t just a battleground…it could decide the entire election. And this time, the usual Bloc-Liberal-NDP tug-of-war is taking some unexpected turns. We hit the streets of Montreal to find out what is on…",
    "link": "https://shows.acast.com/canadaland/episodes/67eb3ce77828ca699c7f4431",
    "timestamp": "2025-04-01T10:45:00Z"
  },
  {
    "title": "The U.S. Has a Long History of Tariffs. Here’s How Trump’s Compare",
    "description": "Since its founding, the U.S. has pursued protectionism to boost economic growth. But history shows that sometimes this approach backfires.",
    "link": "https://time.com/7268866/history-of-tariffs-trump/",
    "timestamp": "2025-04-01T10:45:00Z"
  },
  {
    "title": "Oil extends climb on supply fears; trade war concerns cap gains",
    "description": "Oil prices inched higher on Tuesday after threats by U.S. President Donald Trump to impose secondary tariffs on Russian crude and attack Iran, though worries about the impact of a trade war on global growth capped gains.\nBrent futures rose 21 cents, or 0.3 pe…",
    "link": "https://biztoc.com/x/b75c90a453c7f5d3",
    "timestamp": "2025-04-01T10:44:50Z"
  },
  {
    "title": "EU ‘holds a lot of cards’ in tariff dispute, von der Leyen says",
    "description": "Transatlantic trade war will create ‘bureaucratic monster’ of new custom checks, European Commission head warns",
    "link": "https://www.irishtimes.com/business/economy/2025/04/01/eu-holds-a-lot-of-cards-in-tariff-dispute-von-der-leyen-says/",
    "timestamp": "2025-04-01T10:44:45Z"
  },
  {
    "title": "The most aggressive tariff move yet by the most tariff-obsessed president | CNN Business",
    "description": "President Donald Trump has kept his promise on tariffs — so much so that it’s freaking out investors, economists, CEOs and a growing segment of the population who fear the import taxes will do more harm than good.",
    "link": "https://www.cnn.com/2025/04/01/business/trump-tariff-liberation-day/index.html",
    "timestamp": "2025-04-01T10:43:23Z"
  },
  {
    "title": "BlackRock CEO: Bitcoin Might Dethrone US Dollar as Global Reserve Currency",
    "description": "BlackRock's Outlook 2025 called Bitcoin \"a tactical hedge against specific risks, like gold.\" Larry Fink, the CEO of the world's largest asset manager, who had once labeled Bitcoin as an \"index of money laundering,\" experienced a notable change of heart last …",
    "link": "https://sputnikglobe.com/20250401/blackrock-ceo-bitcoin-might-dethrone-us-dollar-as-global-reserve-currency--1121724448.html",
    "timestamp": "2025-04-01T10:42:18Z"
  }
]