[
  {
    "title": "DC Restaurant Visited by Trump Hit by Flurry of Negative Reviews",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA Washington, D.C. restaurant in which President Donald Trump was accosted by protesters has been targeted with one-star reviews online.\nTrump was shouted at by protesters during a rare venture out for a cabin…",
    "link": "https://biztoc.com/x/1d3cb17de6e420c5",
    "timestamp": "2025-09-10T14:57:14Z"
  },
  {
    "title": "WTI Holds Gains Despite Biggest Crude+Product Build Since 2023",
    "description": "WTI Holds Gains Despite Biggest Crude+Product Build Since 2023\n \nOil climbed for a third session as investors weighed President Donald Trump’s latest tariff threats on Russian crude buyers, the fallout from Israel’s strike in Doha and the outlook for US inter…",
    "link": "https://biztoc.com/x/4bffa92632f0146d",
    "timestamp": "2025-09-10T14:57:03Z"
  },
  {
    "title": "Israel still assessing outcome of assassination attempt Hamas leaders, Trump voices dismay",
    "description": "Israeli defense officials have so far obtained no evidence that the assassinations of Hamas' top brass in Qatar were successful. Prime Minister Benjamin Netanyahu has spoken twice since then with U.S. President Donald Trump, who publicly said he was 'very unh…",
    "link": "https://www.haaretz.com/israel-news/2025-09-10/ty-article/.premium/israel-still-assessing-outcome-of-assassination-attempt-hamas-leaders-trump-voices-dismay/00000199-33cb-d704-a9d9-fbcfbb440000",
    "timestamp": "2025-09-10T14:56:30Z"
  },
  {
    "title": "Ivanka Trump and her mother are in Epstein's little black book: report",
    "description": "Fallout continues for President Donald Trump as the scandal surrounding convicted child sex abuser Jeffrey Epstein and the ongoing efforts to expose the files around the Justice Department investigation. Some of those are leading to shock as new names are pop…",
    "link": "https://www.rawstory.com/ivanka-trump-epstein-address-book/",
    "timestamp": "2025-09-10T14:55:54Z"
  },
  {
    "title": "Larry Ellison overtakes Elon Musk as the world's richest person on Oracle stock surge",
    "description": "Ellison takes the top spot on the global rich list for the first time ever following Oracle's 41% stock surge.",
    "link": "https://www.businessinsider.com/larry-ellison-net-worth-elon-musk-richest-person-oracle-stock-2025-9",
    "timestamp": "2025-09-10T14:55:19Z"
  },
  {
    "title": "Trump loves the spotlight that comes with sports. He especially loves when it's on him",
    "description": "President Donald Trump couldn't stand to cede the spotlight in 2020 as the Washington Nationals opened their pandemic-shortened season at home against the New York Yankees by having Dr. Anthony Fauci throw the first pitch. In September alone, Trump has at lea…",
    "link": "https://sports.yahoo.com/article/trump-loves-spotlight-comes-sports-145510132.html",
    "timestamp": "2025-09-10T14:55:10Z"
  },
  {
    "title": "Trump's Federal Reserve board nominee is approved by Senate committee",
    "description": "A Senate committee is approving the nomination of White House economic adviser Stephen Miran to the Fed’s board of governors, setting up a likely approval by the full Senate, which would make Miran the third Trump appointee to the seven-member board",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-federal-reserve-board-nominee-approved-senate-committee-125440738",
    "timestamp": "2025-09-10T14:54:18Z"
  },
  {
    "title": "US Senate panel advances nomination of Trump’s Fed governor pick",
    "description": "A US Senate committee on Wednesday advanced the nomination of President Donald Trump’s choice to join the Federal Reserve board, despite concerns that he might not resign from the White House even if confirmed. Stephen Miran, who chairs the White House Counci…",
    "link": "https://www.digitaljournal.com/world/us-senate-panel-advances-nomination-of-trumps-fed-governor-pick/article",
    "timestamp": "2025-09-10T14:52:32Z"
  },
  {
    "title": "Harris Says It Was ‘Reckless’ for Dems to Let Biden Make 2024 Decision",
    "description": "Kamala Harris writes in her new book that it was \"reckless\" of Democrats to let Joe Biden decide whether he wanted to run for reelection in 2024.",
    "link": "http://www.rollingstone.com/politics/politics-news/kamala-harris-reckless-biden-2024-decision-1235424533/",
    "timestamp": "2025-09-10T14:52:25Z"
  },
  {
    "title": "Israeli strikes shake quiet Qatar, strain US ties",
    "description": "Ahmed was in a university lecture when he heard the bangs: loud explosions from unprecedented Israeli air strikes targeting Hamas that shattered Qatar’s peace and put the wealthy Gulf region on edge. “Honestly no one expected it to be an explosion (from an at…",
    "link": "https://www.digitaljournal.com/world/israeli-strikes-shake-quiet-qatar-strain-us-ties/article",
    "timestamp": "2025-09-10T14:52:20Z"
  },
  {
    "title": "Treasury secretary Scott Bessent ‘threatened to punch Trump official’",
    "description": "US treasury secretary Scott Bessent is under fire for reportedly threatening to “punch” a colleague “in the f**king face” during a MAGA dinner. The 63-year-old Republican, who is gay, allegedly caused a scene during a 3 September dinner in Washington DC. Duri…",
    "link": "https://www.thepinknews.com/2025/09/10/scott-bessent-trump-official-confrontation/",
    "timestamp": "2025-09-10T14:50:36Z"
  },
  {
    "title": "DC Restaurant Visited by Trump Hit by Flurry of Negative Reviews",
    "description": "\"I prefer my seafood without the fascism,\" one read, while another said that the establishment \"caters to a fascist president and his regime.\"",
    "link": "https://www.newsweek.com/dc-restaurant-donald-trump-protest-bad-review-2127586",
    "timestamp": "2025-09-10T14:49:24Z"
  },
  {
    "title": "Harris admits silence on Biden's 2024 re-election bid was 'recklessness'",
    "description": "Former Vice President Kamala Harris admitted in her new book that she likely should have told President Joe Biden to reconsider running for president her new book.",
    "link": "https://www.foxnews.com/politics/harris-admits-silence-bidens-2024-re-election-bid-recklessness",
    "timestamp": "2025-09-10T14:48:58Z"
  },
  {
    "title": "Profiles in Judicial Abuse of Power: Indira Talwani",
    "description": "The criminals aren’t the problem. Every society has criminals. The problem is the liberal activists who have infested and subverted the justice system and misuse their position to unleash the criminals on the public. The judiciary is rotted through with moonb…",
    "link": "https://moonbattery.com/profiles-in-judicial-abuse-of-power-indira-talwani/",
    "timestamp": "2025-09-10T14:48:51Z"
  },
  {
    "title": "Trump administration wants to cancel Biden-era rule that elevated conservation on public land",
    "description": "The administration seeks to open more taxpayer-owned tracts to drilling, logging, mining and grazing.",
    "link": "https://www.bostonherald.com/2025/09/10/trump-public-lands-biden-rule/",
    "timestamp": "2025-09-10T14:48:49Z"
  },
  {
    "title": "Trump administration wants to cancel Biden-era rule that elevated conservation on public land",
    "description": "The administration seeks to open more taxpayer-owned tracts to drilling, logging, mining and grazing.",
    "link": "https://www.denverpost.com/2025/09/10/trump-public-lands-biden-rule/",
    "timestamp": "2025-09-10T14:48:49Z"
  },
  {
    "title": "Kamala Harris Says Joe Biden's Reelection Decision was Reckless",
    "description": "Kamala Harris cuts to the chase in her upcoming book \"107 Days\" ... calling the decision to let President Biden decide whether to run for reelection pure \"recklessness.\" She candidly discusses the decision-making process in her new memoir -- The…\n Permalink",
    "link": "https://www.tmz.com/2025/09/10/kamala-harris-joe-biden-reelection-decision/",
    "timestamp": "2025-09-10T14:48:30Z"
  },
  {
    "title": "Pressed on weak U.S. job growth, the White House line comes up far short",
    "description": "When should the public expect the job numbers to improve? White House press secretary Karoline Leavitt tried to answer. It didn't go well.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pressed-weak-us-job-growth-white-house-line-comes-far-short-rcna230325",
    "timestamp": "2025-09-10T14:48:11Z"
  },
  {
    "title": "Polish foreign minister says Putin 'laughs' at Trump's peace efforts",
    "description": "Polish Foreign Minister Radek Sikorski, during a news conference on Russia's drone incursion, said he hopes for a strong reaction from President Donald Trump.",
    "link": "https://abcnews.go.com/Politics/polish-foreign-minister-putin-laughs-trumps-peace-efforts/story?id=125440375",
    "timestamp": "2025-09-10T14:47:06Z"
  },
  {
    "title": "'No end to uncertainty': Supreme Court’s next case could hand Trump unprecedented power",
    "description": "An impending case before the Supreme Court could end up granting President Donald Trump “sweeping fiscal authority” that has historically been held exclusively by Congress, a precedent that, once set, could expand the power of the executive branch indefinitel…",
    "link": "https://www.rawstory.com/supreme-court-2673979738/",
    "timestamp": "2025-09-10T14:46:46Z"
  },
  {
    "title": "‘Boy, I’m Surprised!’: CNBC’s Rick Santelli Blown Away By ‘Progress’ In New Inflation Report Under Trump",
    "description": "CNBC editor Rick Santelli expressed shock on Wednesday about wholesale prices in the U.S. unexpectedly declining.",
    "link": "https://dailycaller.com/2025/09/10/cnbcs-rick-santelli-blown-away-progress-inflation-report-trump/",
    "timestamp": "2025-09-10T14:46:19Z"
  },
  {
    "title": "Jimmy Fallon Takes Brutal Digs At Trump Over ‘Gross’ New Epstein Bombshell",
    "description": "Jimmy Fallon took some uncharacteristically brutal shots at President Donald Trump over his denial he wrote the newly-released letter to Jeffrey Epstein.\nThe post Jimmy Fallon Takes Brutal Digs At Trump Over ‘Gross’ New Epstein Bombshell first appeared on Med…",
    "link": "https://www.mediaite.com/media/entertainment/jimmy-fallon-takes-brutal-digs-at-trump-over-gross-new-epstein-bombshell/",
    "timestamp": "2025-09-10T14:44:41Z"
  },
  {
    "title": "Trump's Doonbeg course to host 2026 Irish Open",
    "description": "A golf course in County Clare owned by US President Donald Trump is confirmed as the host venue for the 2026 Irish Open.",
    "link": "https://www.bbc.com/sport/golf/articles/cr4q66kq3zzo",
    "timestamp": "2025-09-10T14:44:33Z"
  },
  {
    "title": "Europe is in a ‘fight for our future’ after Russian drones fly into Poland, von der Leyen says",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"68c11529fab62dbb91618e9b\"\n}",
    "link": "https://www.independent.ie/world-news/europe/europe-is-in-a-fight-for-our-future-after-russian-drones-fly-into-poland-von-der-leyen-says/a1809806131.html",
    "timestamp": "2025-09-10T14:43:46Z"
  },
  {
    "title": "Trump's Fed Nominee Miran Advances Amid Concerns Over Central Bank Independence",
    "description": "Miran, currently serving as chairman of the White House Council of Economic Advisers, has pledged to take an unpaid leave of absence from his White House role if confirmed to the Fed, according to PBS NewsHour.",
    "link": "https://www.ibtimes.com/trumps-fed-nominee-miran-advances-amid-concerns-over-central-bank-independence-3783009",
    "timestamp": "2025-09-10T14:42:58Z"
  },
  {
    "title": "Outlawry in the Caribbean",
    "description": "Trump’s execution of drug strugglers by drone is barbaric even by 19th-century legal standards.",
    "link": "http://foreignpolicy.com/2025/09/10/trump-drone-strike-speedboat-venezuela-drug-cartel-tren-de-aragua-rule-of-law/",
    "timestamp": "2025-09-10T14:42:47Z"
  },
  {
    "title": "Trump Demands ‘DEATH PENALTY’ for Charlotte Killer",
    "description": "President Donald Trump demanded the death penalty Wednesday morning for the suspect arrested for the slaying of a Ukrainian woman in Charlotte, North Carolina. The... Read More\nThe post Trump Demands ‘DEATH PENALTY’ for Charlotte Killer appeared first on The …",
    "link": "https://www.dailysignal.com/2025/09/10/trump-demands-death-penalty-for-charlotte-killer/",
    "timestamp": "2025-09-10T14:42:29Z"
  },
  {
    "title": "Trump administration proposes canceling public lands rule",
    "description": "Interior Secretary Doug Burgum wants to cancel a public land management rule that sought to put conservation on equal footing with industry. Wednesday's announcement comes as President Donald Trump seeks to open more taxpayer-owned tracts to drilling, logging…",
    "link": "https://apnews.com/article/public-lands-conservation-drilling-burgum-5e08bfa715d692ad2ca5184504569748",
    "timestamp": "2025-09-10T14:41:17Z"
  },
  {
    "title": "Trump’s Federal Reserve board nominee is approved by Senate committee",
    "description": "The committee voted to approve Miran on partisan lines, 13-11, with all Democrats voting against confirmation.",
    "link": "https://www.bostonherald.com/2025/09/10/trump-fed-nominee-approved-committee/",
    "timestamp": "2025-09-10T14:41:16Z"
  },
  {
    "title": "Trump's Federal Reserve board nominee is approved by Senate committee",
    "description": "A Senate committee on Wednesday approved the nomination of White House economic adviser Stephen Miran to the Fed's board of governors, setting up a likely...",
    "link": "https://finance.yahoo.com/news/trumps-federal-board-nominee-approved-143933855.html",
    "timestamp": "2025-09-10T14:39:33Z"
  },
  {
    "title": "The 1600: American Tragedy",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-american-tragedy-2127692",
    "timestamp": "2025-09-10T14:38:52Z"
  },
  {
    "title": "US producer inflation unexpectedly falls in first drop since April",
    "description": "US producer prices unexpectedly fell in August, government data showed Wednesday, driven in part by a pullback in energy and trade — and prompting President Donald Trump to renew calls for lower interest rates. The producer price index (PPI) dipped 0.1 percen…",
    "link": "https://www.digitaljournal.com/world/us-producer-inflation-unexpectedly-falls-in-first-drop-since-april/article",
    "timestamp": "2025-09-10T14:37:32Z"
  },
  {
    "title": "Trump Demands Execution of ‘ANIMAL’ Charlotte Train Murderer: ‘There Can Be No Other Option!!!’",
    "description": "President Trump called for the \"animal\" career criminal who murdered Ukrainian refugee Iryna Zarutska aboard a North Carolina train to be executed on Tuesday.\nThe post Trump Demands Execution of ‘ANIMAL’ Charlotte Train Murderer: ‘There Can Be No Other Option…",
    "link": "https://www.mediaite.com/politics/trump-demands-execution-of-animal-charlotte-train-murderer-there-can-be-no-other-option/",
    "timestamp": "2025-09-10T14:36:40Z"
  },
  {
    "title": "Activists Protest Trump At DC Restaurant, Call Him 'Hitler Of Our Time' (Li Zhou/HuffPost)",
    "description": "Li Zhou / HuffPost:\nActivists Protest Trump At DC Restaurant, Call Him ‘Hitler Of Our Time’  —  It's the second time this week when he's been openly jeered in a public place.  —  A group of activists from CodePink, an anti-war group, protested President Donal…",
    "link": "https://www.memeorandum.com/250910/p48",
    "timestamp": "2025-09-10T14:35:00Z"
  },
  {
    "title": "CBS News’s New Ombudsman Is Going To Be Doing The Job Differently Than Usual",
    "description": "CBS News has appointed an ombudsman to investigate consumer complaints, although Kenneth Weinstein's background and duties are different from the way the job has traditionally been defined in journalism. Weinstein is a former think tank president who was appo…",
    "link": "https://apnews.com/article/paramount-trump-ombudsman-journalism-cbs-news-56e68f08389e30b49360d73c018f8e7c",
    "timestamp": "2025-09-10T14:34:00Z"
  },
  {
    "title": "Rosie O'Donnell calls Ellen DeGeneres friendship betrayal 'one of the most painful things' in her life",
    "description": "Rosie O'Donnell reveals the devastating end of her friendship with Ellen DeGeneres after DeGeneres denied knowing her on \"Larry King Live\" in 2004.",
    "link": "https://www.foxnews.com/entertainment/rosie-odonnell-calls-ellen-degeneres-friendship-betrayal-one-most-painful-things-her-life",
    "timestamp": "2025-09-10T14:33:47Z"
  },
  {
    "title": "Harris says Biden’s “ego” led him to run for reelection",
    "description": "\"As loyal as I am to President Biden, I am more loyal to my country,\" Harris wrote in her new book",
    "link": "https://www.salon.com/2025/09/10/harris-says-bidens-ego-led-him-to-run-for-reelection/",
    "timestamp": "2025-09-10T14:33:36Z"
  },
  {
    "title": "Seth Meyers Disputes Trump’s ‘Ridiculous’ Notion That Dems Support Epstein Survivors for Approval Ratings | Video",
    "description": "\"Democrats never do anything to help their approval rating,\" the \"Late Night\" host points out\nThe post Seth Meyers Disputes Trump’s ‘Ridiculous’ Notion That Dems Support Epstein Survivors for Approval Ratings | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-trump-epstein-survivors-democrat-approval-rating/",
    "timestamp": "2025-09-10T14:33:02Z"
  },
  {
    "title": "UK PM expresses ‘confidence’ in ambassador to US after Epstein letter",
    "description": "British Prime Minister Keir Starmer backed the UK ambassador to Washington Peter Mandelson Wednesday after details emerged of the diplomat’s friendship with disgraced sex offender Jeffrey Epstein. Mandelson called the late Epstein his “best pal” and an “intel…",
    "link": "https://www.digitaljournal.com/world/uk-pm-expresses-confidence-in-ambassador-to-us-after-epstein-letter/article",
    "timestamp": "2025-09-10T14:32:20Z"
  },
  {
    "title": "Top U.S. Banking Regulator Gould Says Crypto Debanking 'Is Real'",
    "description": "Jonathan Gould, chief of the Office of the Comptroller of the Currency, said his agency is trying to halt debanking while also writing stablecoin regulations.",
    "link": "https://www.coindesk.com/policy/2025/09/10/top-u-s-banking-regulator-gould-says-crypto-debanking-is-real",
    "timestamp": "2025-09-10T14:31:51Z"
  },
  {
    "title": "Qatar digs through the rubble of Israel’s attack on Hamas leaders",
    "description": "The strike on the territory of a U.S. ally drew widespread condemnation from countries in the Mideast and beyond. It also marked a dramatic escalation in the region and risked upending talks aimed at ending the war and freeing hostages still held by Hamas in …",
    "link": "https://www.pbs.org/newshour/world/qatar-digs-through-the-rubble-of-israels-attack-on-hamas-leaders",
    "timestamp": "2025-09-10T14:31:36Z"
  },
  {
    "title": "Tearing down the house that Thurgood built",
    "description": "Before Thurgood Marshall joined the Supreme Court, he secured many of the rights his successors are dismantling.",
    "link": "https://www.salon.com/2025/09/10/tearing-down-the-house-that-thurgood-built/",
    "timestamp": "2025-09-10T14:30:15Z"
  },
  {
    "title": "What If Biden Rewarded A Convicted Sex Offender For Info On Trump ?",
    "description": "If President Biden offered a deal to Ghislaine Maxwell to move her into a comfortable, minimum security prison for doing an interview with his DOJ, in which she says she witnessed Donald Trump participating with Jeffrey Epstein in sex with underage girls, wha…",
    "link": "https://crooksandliars.com/2025/09/can-you-imagine-if-pres-biden-rewarded",
    "timestamp": "2025-09-10T14:28:29Z"
  },
  {
    "title": "'It's A Dead Issue': Trump Gaslights His Base On Epstein",
    "description": "Donald J. Trump is in the middle of another scandal, this time involving notorious sex trafficking pedophile Jeffrey Epstein. The pussy grabber's signature and message on the pedo's birthday card, which emerged this week, is blowing up the Internet. MAGA is t…",
    "link": "https://crooksandliars.com/2025/09/its-dead-issue-trump-gaslights-his-base",
    "timestamp": "2025-09-10T14:28:14Z"
  },
  {
    "title": "Teachers sue over Trump’s immigration crackdown, saying students are staying home",
    "description": "The teacher lawsuit claims Trump's decision to allow immigration arrests at schools violates the law.",
    "link": "https://www.bostonherald.com/2025/09/10/teachers-sue-trump-immigration-crackdown/",
    "timestamp": "2025-09-10T14:28:07Z"
  },
  {
    "title": "Teachers sue over Trump’s immigration crackdown, saying students are staying home",
    "description": "The teacher lawsuit claims Trump's decision to allow immigration arrests at schools violates the law.",
    "link": "https://www.denverpost.com/2025/09/10/teachers-sue-trump-immigration-crackdown/",
    "timestamp": "2025-09-10T14:28:07Z"
  },
  {
    "title": "Charlotte train murder front and center in crucial 2026 Senate battle: 'Soft-on-crime policies'",
    "description": "Trump blames former North Carolina governor Roy Cooper for a Ukrainian refugee's train stabbing death as Cooper runs for Senate against Trump-backed Michael Whatley.",
    "link": "https://www.foxnews.com/politics/charlotte-train-murder-front-and-center-crucial-2026-senate-battle-soft-on-crime-policies",
    "timestamp": "2025-09-10T14:28:07Z"
  },
  {
    "title": "ANDREW LEWIS: The Violent Schools Democratic Governors Don’t Want You to Know About",
    "description": "Democratic governors have recently made headlines by downplaying the violence their constituents face daily.",
    "link": "https://dailycaller.com/2025/09/10/andrew-lewis-the-violent-schools-democratic-governors-dont-want-you-to-know-about/",
    "timestamp": "2025-09-10T14:27:50Z"
  },
  {
    "title": "Russia fires drones into Poland days after Trump meeting with NATO ally",
    "description": "Moscow denies responsibility for drones that entered Polish territory, claiming no evidence of Russian origin despite Ukrainian president's contradicting assessment.",
    "link": "https://www.foxnews.com/world/russia-fires-drones-poland-days-after-trump-meeting-nato-ally",
    "timestamp": "2025-09-10T14:24:25Z"
  },
  {
    "title": "Ireland is seventh most expensive country in euro area for new mortgages",
    "description": "Average rate at the end of July was unchanged from June at 3.6%, new data from the Central Bank shows",
    "link": "https://www.irishtimes.com/business/2025/09/10/ireland-is-seventh-most-expensive-country-in-euro-area-for-new-mortgages/",
    "timestamp": "2025-09-10T14:23:51Z"
  },
  {
    "title": "'Europe is in a fight for its own future': EU's von der Leyen",
    "description": "STORY: :: Europe is in a  'fight' for its future, says EU Commission chief Ursula von der Leyen:: Strasbourg, France:: September 10, 2025\"Europe is in a...",
    "link": "https://www.yahoo.com/news/videos/europe-fight-own-future-eus-142349070.html",
    "timestamp": "2025-09-10T14:23:49Z"
  },
  {
    "title": "Boston election results, date, candidates: Trump administration's target Michelle Wu vs New England Patriots owner's son Josh Kraft",
    "description": "Michelle Wu is a sitting Mayor of Boston. She is Boston's first Asian and female leader. Josh Kraft is the son of NFL football New England Patriots owner Robert Kraft.",
    "link": "https://economictimes.indiatimes.com/news/international/us/boston-election-results-date-candidates-trump-administrations-foe-michelle-wu-vs-new-england-patriots-owners-son-josh-kraft/articleshow/123811620.cms",
    "timestamp": "2025-09-10T14:23:03Z"
  },
  {
    "title": "UK ambassador to US faces questions over his links to Epstein",
    "description": "British Prime Minister Keir Starmer says he has “confidence” in the country’s ambassador to the United States following mounting criticism of his links to pedophile Jeffrey Epstein",
    "link": "https://abcnews.go.com/International/wireStory/uk-ambassador-us-faces-questions-links-epstein-125439368",
    "timestamp": "2025-09-10T14:22:22Z"
  },
  {
    "title": "International Outrage Mounts After Israel's Airstrike In Qatar",
    "description": "Qatar reacted furiously, describing the strike as \"state terrorism\" and a direct assault on its sovereignty. Qatari officials said they were given only minutes of warning, undermining U.S. claims that the country had been alerted in advance.",
    "link": "https://www.ibtimes.com/international-outrage-mounts-after-israels-airstrike-qatar-3782994",
    "timestamp": "2025-09-10T14:22:15Z"
  },
  {
    "title": "Por quién doblan las campanas en Ucrania",
    "description": "Project Syndicate - The World’s Opinion Page",
    "link": "https://www.project-syndicate.org/commentary/ukraine-running-out-of-soldiers-needs-foreign-volunteers-by-anna-husarska-2025-09/spanish",
    "timestamp": "2025-09-10T14:21:34Z"
  },
  {
    "title": "For Whom the Ukrainian Bell Tolls",
    "description": "With Vladimir Putin apparently willing to shrug off any number of losses, one must assume that Russia will be able to sustain a grinding war of attrition for as long as it takes to deplete Ukraine’s ranks. That is why supporting Ukraine now requires finding w…",
    "link": "https://www.project-syndicate.org/commentary/ukraine-running-out-of-soldiers-needs-foreign-volunteers-by-anna-husarska-2025-09",
    "timestamp": "2025-09-10T14:21:34Z"
  },
  {
    "title": "Dem In Trump Seat Didn’t Even Bother To Stick Around For Vote On Her Own Bill",
    "description": "It was one of the biggest votes of Democratic New Jersey Rep. Nellie Pou’s first eight months in Congress so far — and she missed it. Pou, one of 13 House Democrats representing a district that President Donald Trump carried in November, has taken a victory l…",
    "link": "https://dailycaller.com/2025/09/10/nellie-pou-misses-vote-own-bill/",
    "timestamp": "2025-09-10T14:20:37Z"
  },
  {
    "title": "South Korea sends plane to U.S. to bring back workers detained in immigration raid",
    "description": "A total of 475 workers, more than 300 of them South Koreans, were rounded up in the Sept. 4 raid at the battery factory under construction at Hyundai's sprawling auto plant west of Savannah.",
    "link": "https://www.pbs.org/newshour/nation/south-korea-sends-plane-to-u-s-to-bring-back-workers-detained-in-immigration-raid",
    "timestamp": "2025-09-10T14:19:28Z"
  },
  {
    "title": "California vs. MAGA memecoins: Why Gavin Newsom is fighting Trump",
    "description": "How TRUMP, DJT and WLFI clash with California’s crypto rules and why Newsom teased a “Trump Corruption Coin.”",
    "link": "https://cointelegraph.com/explained/california-vs-maga-memecoins-why-gavin-newsom-is-fighting-trump",
    "timestamp": "2025-09-10T14:19:00Z"
  },
  {
    "title": "Russia dismisses drone attack allegations in Poland as ‘myths’ as Trump to hold call with Polish President",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"68c11529fab62dbb91618e9b\"\n}",
    "link": "https://www.independent.ie/world-news/europe/russia-dismisses-drone-attack-allegations-in-poland-as-myths-as-trump-to-hold-call-with-polish-president/a1809806131.html",
    "timestamp": "2025-09-10T14:18:54Z"
  },
  {
    "title": "Inside the Hidden Conservative Network Bankrolling an “Ecosystem” of Right-Wing News",
    "description": "“Now more than ever, the world needs an honest newsroom.” With these words, the little-known Informing America Foundation was awarded the $250,000 Gregor G. Peterson Prize in “venture philanthropy” last December for its “high-quality journalism.” If few had h…",
    "link": "https://www.motherjones.com/politics/2025/09/inside-the-hidden-conservative-network-bankrolling-an-ecosystem-of-right-wing-news-informing-america-john-solomon-war-room/",
    "timestamp": "2025-09-10T14:18:18Z"
  },
  {
    "title": "Former ICE chief reveals what to expect from major Chicago immigration operation",
    "description": "'Operation Midway Blitz' begins in Chicago amid Supreme Court ruling on ICE operations and opposition from Illinois Democratic leaders to a federal law enforcement surge.",
    "link": "https://www.foxnews.com/politics/former-ice-chief-reveals-what-expect-from-major-chicago-immigration-operation",
    "timestamp": "2025-09-10T14:14:39Z"
  },
  {
    "title": "She was adopted into an abusive US home. Decades later, immigration policies sent her back to Brazil",
    "description": "When Maria Pires was adopted from Brazil as a child, she believed she was officially an American",
    "link": "https://abcnews.go.com/US/wireStory/adopted-abusive-us-home-decades-immigration-policies-back-125438604",
    "timestamp": "2025-09-10T14:14:32Z"
  },
  {
    "title": "Germany says it has overtaken US as Ukraine's biggest military backer",
    "description": "Germany has become Ukraine's biggest supplier of military aid and is now sending more weapons than the United States, Defence Minister Boris Pistorius said...",
    "link": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:250910-99-983806/",
    "timestamp": "2025-09-10T14:14:20Z"
  },
  {
    "title": "EU chief says Europe in ‘a fight for our future’",
    "description": "Ursula von der Leyen announced new measures to help Ukraine fight off Russia’s full-scale invasion.",
    "link": "https://uk.news.yahoo.com/eu-chief-says-europe-fight-141330498.html",
    "timestamp": "2025-09-10T14:13:30Z"
  },
  {
    "title": "Watch Live: House Debates Bills to Codify Trump's D.C. Crime Crackdown",
    "description": "The House Committee on Oversight and Government Reform marks up a number of bills designed to codify President Donald Trump's crime crackdown in Washington, DC, on Wednesday, September 10.\nThe post Watch Live: House Debates Bills to Codify Trump’s D.C. Crime …",
    "link": "https://www.breitbart.com/politics/2025/09/10/watch-live-house-debates-bills-to-codify-trumps-d-c-crime-crackdown/",
    "timestamp": "2025-09-10T14:12:38Z"
  },
  {
    "title": "Trump's Tariff Strategy Can Even the Playing Field on Drug Prices | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has reversed decades of failed U.S. trade policy and taken strong action to restore fairness and balance to our trade relationships with other countries.\nBy moving quickly and wielding t…",
    "link": "https://biztoc.com/x/d8538ae168290ff4",
    "timestamp": "2025-09-10T14:12:16Z"
  },
  {
    "title": "When hospitals and insurers fight, patients get caught in the middle",
    "description": "A growing number of Americans find themselves in health insurance limbo.",
    "link": "https://www.bostonherald.com/2025/09/10/when-hospitals-and-insurers-fight-patients-get-caught-in-the-middle/",
    "timestamp": "2025-09-10T14:10:54Z"
  },
  {
    "title": "US Economy Weaker Than Thought As Jobs Revised Down By 911,000",
    "description": "The benchmark revision slashed employment gains by nearly one million, suggesting that hiring had been far weaker than policymakers, investors and businesses previously believed.",
    "link": "https://www.ibtimes.com/us-economy-weaker-thought-jobs-revised-down-911000-3782992",
    "timestamp": "2025-09-10T14:09:28Z"
  },
  {
    "title": "Kamala Harris Opens Up About The Reckless Mistake She Made Ahead Of The 2024 Election",
    "description": "The former vice president also addressed concerns about the former president's age in a new excerpt in The Atlantic from her upcoming book.",
    "link": "https://www.huffpost.com/entry/kamala-harris-new-book-excerpt-biden_n_68c16f87e4b0f2df4e0530d6",
    "timestamp": "2025-09-10T14:08:38Z"
  },
  {
    "title": "September Poll: 64% of Republican and Independent Voters Want Ban for Mid-Decade Redistricting",
    "description": "Republican and Independent voters want Congress to step up and ban mid-decade redistricting in opposition to a White House desperate to hold onto power – including 60% of voters who supported Donald Trump in 2024. That’s the latest from a poll of registered v…",
    "link": "https://www.commondreams.org/newswire/september-poll-64-of-republican-and-independent-voters-want-ban-for-mid-decade-redistricting",
    "timestamp": "2025-09-10T14:07:46Z"
  },
  {
    "title": "Israel’s Strike Came After Qatar Hugely Expanded Its Military",
    "description": "Having faced its second attack in three months Qatar may now find itself questioning its procurement choices and deterrence strategy.",
    "link": "https://www.forbes.com/sites/pauliddon/2025/09/10/israels-strike-came-after-qatar-hugely-expanded-its-military/",
    "timestamp": "2025-09-10T14:07:46Z"
  },
  {
    "title": "Trump is ‘very unhappy’ about military attack in Qatar. What now for US-Israeli relations?",
    "description": "Netanyahu has once again tested his relationship with the White House in the form of bold military actions",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/10/trump-is-very-unhappy-about-military-attack-in-qatar-what-now-for-us-israeli-relations/",
    "timestamp": "2025-09-10T14:06:51Z"
  },
  {
    "title": "Teachers sue over Trump's immigration crackdown, saying students are staying home",
    "description": "Labor unions representing educators and school employees are suing President Donald Trump's administration over its immigration crackdown",
    "link": "https://abcnews.go.com/US/wireStory/teachers-sue-trumps-immigration-crackdown-students-staying-home-125438603",
    "timestamp": "2025-09-10T14:06:31Z"
  },
  {
    "title": "Trump's Tariff Strategy Can Even the Playing Field on Drug Prices | Opinion",
    "description": "President Donald Trump has reversed decades of failed trade policy and restored fairness to our trade relationships.",
    "link": "https://www.newsweek.com/trumps-tariff-strategy-can-even-playing-field-drug-prices-opinion-2126356",
    "timestamp": "2025-09-10T14:05:06Z"
  },
  {
    "title": "US Treasuries Gain as Wholesale Inflation Unexpectedly Declines",
    "description": "Treasuries rose, led by short-dated notes, after a reading on wholesale inflation came in weaker than expected, cementing bets that the Federal Reserve will start to cut interest rates next week.",
    "link": "https://financialpost.com/pmn/business-pmn/us-treasuries-gain-as-wholesale-inflation-unexpectedly-declines",
    "timestamp": "2025-09-10T14:04:56Z"
  },
  {
    "title": "Trump's extrajudicial killings point to something even more chilling",
    "description": "The Uniform Code of Military Justice\r\nprohibits military troops from committing unlawful killings, defined at 10 USC\r\net. seq\r\n.\r\n Troops can kill enemy combatants on sight, but only when engaged in armed conflict, or when there is an imminent threat. Even wh…",
    "link": "https://www.rawstory.com/raw-investigates/2673974972/",
    "timestamp": "2025-09-10T14:02:59Z"
  },
  {
    "title": "Detained South Korean nationals' return home has been delayed",
    "description": "A spokesperson for Hartsfield-Jackson Atlanta International Airport told NBC News that the charter flight for today had been canceled.",
    "link": "https://www.nbcnews.com/news/us-news/south-korea-nationals-return-delayed-immigration-raid-hyundai-rcna230149",
    "timestamp": "2025-09-10T14:02:30Z"
  },
  {
    "title": "Trump Doonbeg confirmed as host of Irish Open next year, as Taoiseach says Trump is ‘welcome’",
    "description": "The 2027 event will be played for the first time at Trump International Golf Links Ireland, Doonbeg.",
    "link": "https://www.thejournal.ie/trump-doonbeg-confirmed-as-host-of-irish-open-next-year-6812870-Sep2025/",
    "timestamp": "2025-09-10T14:02:08Z"
  },
  {
    "title": "US supply chain prices unexpectedly fell 0.1% in August",
    "description": "U.S. producer prices fell unexpectedly last month, dropping 0.1% from July. The Labor Department reported Wednesday that its producer price index — which captures inflation before it hits consumers — showed that wholesale inflation decelerated in August after…",
    "link": "https://apnews.com/article/producer-prices-index-inflation-consumer-trump-tariff-2ae00c79d925b20e8fdc603066ac575f",
    "timestamp": "2025-09-10T14:01:31Z"
  },
  {
    "title": "Fight or Fix? Mahan Gives Rare Rebuke of Newsom’s Combative Tactics",
    "description": "Newsom’s popularity has surged as he has battled with President Donald Trump. But San José Mayor says ‘trolling Trump’ won’t be key to success for Democrats.",
    "link": "https://www.kqed.org/news/12055284/fight-or-fix-mahan-gives-rare-rebuke-of-newsoms-combative-tactics",
    "timestamp": "2025-09-10T14:00:27Z"
  },
  {
    "title": "Trump’s Economy Is Finally Here—and It’s Even Worse Than You Imagined",
    "description": "Layoffs are spreading and unemployment is rising—and one kind of worker is being hit the hardest.",
    "link": "https://slate.com/business/2025/09/trump-unemployment-crisis-job-market-black-americans.html",
    "timestamp": "2025-09-10T14:00:00Z"
  },
  {
    "title": "Susan B. Glasser: Trump’s Losing Streak in Federal Courts Continues",
    "description": "It’s a common complaint that the news media is trying so hard to be neutral that they are failing to warn the public about Trump’s efforts to make himself a fascistic emperor. Trump has shattered norms and traditions by firing members of independent boards wh…",
    "link": "https://dianeravitch.net/2025/09/10/susan-b-glasser-trumps-losing-streak-in-federal-courts-continues/",
    "timestamp": "2025-09-10T14:00:00Z"
  },
  {
    "title": "The Unravelling Accelerates",
    "description": "If you missed today's edition of our Clubland Q&A live around the planet, click above to listen. Minutes before we went on air, Charlie Kirk, the founder of Turning Point USA, was shot on stage in Utah. A quarter-hour after the show ended, President",
    "link": "https://www.steynonline.com/15572/the-unravelling-accelerates",
    "timestamp": "2025-09-10T14:00:00Z"
  },
  {
    "title": "Decarlos Brown Jr. Reveals Reason for Stabbing of Iryna Zarutska",
    "description": "The Charlotte suspect blamed \"materials\" inside his body for causing him to allegedly attack and kill the Ukrainian refugee.",
    "link": "https://www.newsweek.com/decarlos-brown-update-audio-charlotte-stabbing-iryna-zarutska-2127631",
    "timestamp": "2025-09-10T13:59:39Z"
  },
  {
    "title": "Most Americans Don’t Believe God Played a Role in Recent Presidential Election Outcomes",
    "description": "Few Americans say God chooses presidential election winners because of their policies. Most U.S. Christians say that “good Christians” do not need to take a particular view on Trump.\nThe post Most Americans Don’t Believe God Played a Role in Recent Presidenti…",
    "link": "http://www.pewresearch.org/religion/2025/09/10/most-americans-dont-believe-god-played-a-role-in-recent-presidential-election-outcomes/",
    "timestamp": "2025-09-10T13:58:58Z"
  },
  {
    "title": "Mounting condemnation after Israeli jets bomb Hamas office in Qatar",
    "description": "President Donald Trump has added his voice to the chorus of condemnation over Israel's attack on Hamas's office in Doha.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/9/10/mounting-condemnation-after-israeli-jets-bomb-hamas-office-in-qatar",
    "timestamp": "2025-09-10T13:58:54Z"
  },
  {
    "title": "Diamonds begin to sparkle in India as buyers shift from soaring gold prices",
    "description": "Indian customers shifting to diamonds due to soaring gold prices, leading to 18-20% diamond sales growth predicted for 2024.",
    "link": "https://www.thehindubusinessline.com/markets/gold/diamonds-begin-to-sparkle-in-india-as-buyers-shift-from-soaring-gold-prices/article70034188.ece",
    "timestamp": "2025-09-10T13:58:37Z"
  },
  {
    "title": "'Where was Secret Service?' GOP lawmaker demands probe after Trump heckled at restaurant",
    "description": "An outraged Rep. Anna Paulina Luna (R-FL) demanded an investigation after diners heckled President Donald Trump at a restaurant in Washington, D.C.On Tuesday, Trump visited a restaurant in D.C., Joe's Seafood, for the first time in his second term. But he did…",
    "link": "https://www.rawstory.com/anna-paulina-luna-trump-heckled/",
    "timestamp": "2025-09-10T13:58:24Z"
  },
  {
    "title": "What we know about Israel’s attack on Hamas in Qatar",
    "description": "In a stunning development, Israel launched a surprise air raid targeting Hamas leaders in Qatar’s capital Doha Tuesday, killing six people including the son of the group’s lead negotiator in ceasefire talks. While Israel has not disclosed the results of the o…",
    "link": "https://www.digitaljournal.com/world/what-we-know-about-israels-attack-on-hamas-in-qatar/article",
    "timestamp": "2025-09-10T13:57:20Z"
  },
  {
    "title": "Trump DOJ Joins Fight Against Illinois 'Assault Weapons' Ban",
    "description": "The Trump administration's assistant attorney general for civil rights, Harmeet Dhillon, will make oral arguments against Illinois' \"assault weapons\" ban later this month. \nThe post Trump DOJ Joins Fight Against Illinois ‘Assault Weapons’ Ban appeared first o…",
    "link": "https://www.breitbart.com/2nd-amendment/2025/09/10/trump-doj-joins-fight-against-illinois-assault-weapons-ban/",
    "timestamp": "2025-09-10T13:57:13Z"
  },
  {
    "title": "Poland ‘closest to open conflict since World War Two’, says Tusk after drone incident",
    "description": "Moscow denies responsibility, with a senior diplomat saying the drones came from direction of Ukraine",
    "link": "https://www.irishtimes.com/world/europe/2025/09/10/poland-closest-to-open-conflict-since-world-war-two-says-tusk-after-drone-incident/",
    "timestamp": "2025-09-10T13:55:54Z"
  },
  {
    "title": "Olympic Silver Medalist Retires From Swimming So He Can Use Steroids To Compete In ‘Enhanced Games’",
    "description": "The Olympics have been marred by a number of doping scandals involving athletes who used performance-enhancing drugs to gain an edge on the rest of the competition. Now, a swimmer who won a silver medal in France is essentially retiring from the sport so he c…",
    "link": "https://brobible.com/sports/article/ben-proud-retires-from-swimming-enhanced-games-steroids/",
    "timestamp": "2025-09-10T13:55:53Z"
  }
]