[
  {
    "title": "'Earthquake': Expert claims New York mayor 'beholden' to Trump after bribery case dropped",
    "description": "The Justice Department directive to end the corruption case against New York City mayor has roiled the legal community — and sets up a situation where he's personally beholden to the president, an expert said Tuesday.Acting Deputy Attorney General Emil Bove, …",
    "link": "https://www.rawstory.com/eric-adams-trump-2671132296/",
    "timestamp": "2025-02-11T12:55:25Z"
  },
  {
    "title": "Exclusive-LVMH media unit refrains from lawsuit against Musk-owned X, sources say",
    "description": "PARIS -LVMH-owned newspaper group Les Echos-Le Parisien is not party to a lawsuit involving French media against Elon Musk's X that it previously said it would join, according to a court official, and four media industry sources said the LVMH papers no longer…",
    "link": "https://www.channelnewsasia.com/business/exclusive-lvmh-media-unit-refrains-lawsuit-against-musk-owned-x-sources-say-4930986",
    "timestamp": "2025-02-11T12:55:15Z"
  },
  {
    "title": "Is it made of metal? It could get more expensive under Trump's latest tariffs",
    "description": "President Trump reintroduced tariffs on imported steel and aluminum, affecting various industries like automotive, construction, and beverage bottling. Domestic manufacturers may face higher costs and limited availability of specific alloys, potentially leadi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-it-made-of-metal-it-could-get-more-expensive-under-trumps-latest-tariffs/articleshow/118148451.cms",
    "timestamp": "2025-02-11T12:52:10Z"
  },
  {
    "title": "PBS Caves to Trump: ‘We Have Closed Our DEI Office’",
    "description": "The PBS office solely dedicated to embracing the disputed ethos of diversity, equity and inclusion (DEI) - and its associated diversity officers - is no more.\nThe post PBS Caves to Trump: ‘We Have Closed Our DEI Office’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/02/11/pbs-caves-to-trump-we-have-closed-our-dei-office/",
    "timestamp": "2025-02-11T12:51:44Z"
  },
  {
    "title": "California maker of furniture used in Trump hotels on brink of bankruptcy",
    "description": "Royal Custom Designs, a Chino-based manufacturer of high-end furniture to the biggest hotel chains in the United States — including President Donald Trump’s privately held hotels — may shed its entire workforce and file for bankruptcy protection after an Indi…",
    "link": "https://biztoc.com/x/7918f4383f971ac9",
    "timestamp": "2025-02-11T12:50:15Z"
  },
  {
    "title": "Hamas Dismisses Trump Ultimatum, Calling Ceasefire Deal ‘Only Way’ To Guarantee Hostage Release",
    "description": "Hamas dismissed President Donald Trump’s ultimatum threatening “hell” if Israeli hostages held in Gaza are not released by noon on Saturday, stating that the agreed ceasefire deal was the “only way” to secure the captives’ freedom “The language of threats has…",
    "link": "https://www.mediaite.com/news/hamas-dismisses-trump-ultimatum-calling-ceasefire-deal-only-way-to-guarantee-hostage-release/",
    "timestamp": "2025-02-11T12:50:09Z"
  },
  {
    "title": "Trump once again slaps taxes on foreign steel, aluminum, a move that proved costly in his first term",
    "description": "By PAUL WISEMAN, Associated Press Economics Writer\nWASHINGTON (AP) — President Donald Trump is hitting foreign steel and aluminum with a 25% tax. If that sounds familiar, it’s because he did pretty much the same thing during his first term.\nTrump’s original m…",
    "link": "https://biztoc.com/x/f324ea59406a20c4",
    "timestamp": "2025-02-11T12:49:49Z"
  },
  {
    "title": "Will Trump Invite Philadelphia Eagles to the White House? What We Know",
    "description": "In 2018 Trump rescinded the White House's invitation to the Eagles. This year, will he send an invite at all?",
    "link": "https://www.newsweek.com/will-trump-invite-philadelphia-eagles-white-house-2029251",
    "timestamp": "2025-02-11T12:49:43Z"
  },
  {
    "title": "Trump's Tariff Tactics May Reshape Global Trade: Analysts",
    "description": "US President Donald Trump's use of tariffs as a blunt weapon to extract concessions on everything from commerce to immigration and drug trafficking could redraw global trading norms, analysts say.",
    "link": "https://www.ibtimes.com.au/trumps-tariff-tactics-may-reshape-global-trade-analysts-1856074",
    "timestamp": "2025-02-11T12:49:38Z"
  },
  {
    "title": "Will China Take Advantage of Future EU-US Rifts?",
    "description": "Beijing hopes to benefit from tensions created by the Trump administration, but China will have to change its own approach to capitalize.",
    "link": "https://thediplomat.com/2025/02/will-china-take-advantage-of-future-eu-us-rifts/",
    "timestamp": "2025-02-11T12:49:00Z"
  },
  {
    "title": "Why Trump and Google Are Paying Employees to Quit—And What It Means for Your Business",
    "description": "What unexpected thing do both President Donald Trump and Google have in common? They both offered “buyouts” to current employees for the same reasons—to cut\nThe post Why Trump and Google Are Paying Employees to Quit—And What It Means for Your Business appeare…",
    "link": "https://www.evilhrlady.org/2025/02/why-trump-and-google-are-paying-employees-to-quit-and-what-it-means-for-your-business.html",
    "timestamp": "2025-02-11T12:47:33Z"
  },
  {
    "title": "The Simpsons \"Drive A Car Like This\" Gag",
    "description": "The Simpsons \"Drive A Car Like This\" Gag or Black Guys Drive A Car Like This But White Guys Drive A Car Like This refers to a reaction image and image macro meme inspired by a scene from The Simpsons episode \"Homer and Apu\" in which a Black comedian does a st…",
    "link": "https://knowyourmeme.com/memes/the-simpsons-drive-a-car-like-this-gag",
    "timestamp": "2025-02-11T12:47:05Z"
  },
  {
    "title": "Trump's steel tariffs could trigger broader trade war as EU threatens 'proportionate countermeasures'",
    "description": "European Commission President Ursula von der Leyen said U.S. tariffs \"will not go unanswered.\"",
    "link": "https://www.cnbc.com/2025/02/11/trumps-steel-tariffs-could-trigger-broader-trade-war-as-eu-threatens-proportionate-countermeasures.html",
    "timestamp": "2025-02-11T12:45:43Z"
  },
  {
    "title": "Donald Trump left the Super Bowl early & probably got booed pretty hard",
    "description": "Embed from Getty Images I managed to time my Super Bowl viewership just right this year – I tuned in as the team walkouts were beginning, and I zoned out in the first two quarters, only really keeping my eye on the hilarious score as the Eagles went up 24-0 a…",
    "link": "https://www.celebitchy.com/908708/donald_trump_left_the_super_bowl_early_probably_got_booed_pretty_hard/",
    "timestamp": "2025-02-11T12:45:25Z"
  },
  {
    "title": "Fort Liberty Gets Renamed To Fort Bragg. Here's Why Its Controversial",
    "description": "The renaming of Fort Liberty to Fort Bragg is a complex issue that highlights the ongoing debate about how to address the legacy of the Confederacy in the United States.",
    "link": "https://www.ndtv.com/world-news/americas-largest-military-base-fort-liberty-gets-renamed-to-fort-bragg-heres-why-its-controversial-7686629",
    "timestamp": "2025-02-11T12:45:12Z"
  },
  {
    "title": "Trump has higher approval rating than at any point during first term: poll",
    "description": "A Pew Research Center survey found President Donald Trump has the highest approval rating less than a month back in office compared to any point in his first term.",
    "link": "https://www.foxnews.com/politics/trump-has-higher-approval-rating-than-any-point-during-first-term-poll",
    "timestamp": "2025-02-11T12:45:01Z"
  },
  {
    "title": "Ukraine: Zelenskyy plans to meet Trump officials in Germany",
    "description": "Key figures in US President Donald Trump's team are expected to meet Ukraine's Volodymyr Zelenskyy on the sidelines of the Munich Security Conference in Germany. Trump has said Ukraine \"may be Russian some day.\"",
    "link": "https://www.dw.com/en/ukraine-zelenskyy-plans-to-meet-trump-officials-in-germany/a-71573011",
    "timestamp": "2025-02-11T12:45:00Z"
  },
  {
    "title": "South Africans mock ‘ridiculous’ Trump proposals",
    "description": "<p>JOHANNESBURG - On the streets of Johannesburg&rsquo;s student district, US President Donald Trump&rsquo;s offer to accept white Afrikaners as refugees landed as both &ldquo;ridiculous&rdquo; and &ldquo;lame&rdquo;, among South Africans of all races.</p>",
    "link": "https://www.bangkokpost.com/world/2959003/south-africans-mock-ridiculous-trump-proposals",
    "timestamp": "2025-02-11T12:45:00Z"
  },
  {
    "title": "Google Removes Pride Month from Calendar: What to Know",
    "description": "Black History Month and Holocaust Remembrance Day have also been removed, as Google calls its calendar process \"unsustainable.\"",
    "link": "https://www.newsweek.com/google-removes-pride-month-calendar-black-history-holocaust-remembrance-2029257",
    "timestamp": "2025-02-11T12:41:30Z"
  },
  {
    "title": "‘Making deals that can be wins’ - Trump's business-oriented policies in the legacy of Reagan",
    "description": "Releasing the hostages, eradicating Hamas, rehabilitating and developing Gaza while winning support of Gazans - is it possible?",
    "link": "https://www.jpost.com/opinion/article-841664",
    "timestamp": "2025-02-11T12:41:27Z"
  },
  {
    "title": "Weekly Rupee View: Rupee may consolidate",
    "description": "Rupee recovers after hitting fresh low against dollar, but RBI intervention may only offer temporary relief.",
    "link": "https://www.thehindubusinessline.com/portfolio/technical-analysis/weekly-rupee-view-rupee-may-consolidate/article69206027.ece",
    "timestamp": "2025-02-11T12:41:20Z"
  },
  {
    "title": "Tech Maverick Musk Launches Takeover Bid For OpenAI",
    "description": "Tech industry maverick Elon Musk on Monday reportedly launched a unsolicited takeover bid for artificial intelligence leader OpenAI.",
    "link": "https://www.investors.com/news/technology/tech-maverick-musk-reportedly-launches-takeover-bid-for-openai/",
    "timestamp": "2025-02-11T12:40:19Z"
  },
  {
    "title": "The Federal Spending-Regulation Trap: Here’s An Escape Plan At Last",
    "description": "Congress's neglect of enumerated powers fuels the fusion of spending and regulation, enabling unchecked federal intervention and expanding bureaucratic control.",
    "link": "https://www.forbes.com/sites/waynecrews/2025/02/11/the-federal-spending-regulation-trap-heres-an-escape-plan-at-last/",
    "timestamp": "2025-02-11T12:39:49Z"
  },
  {
    "title": "Trump meets with the king and crown prince of Jordan",
    "description": "President Donald Trump speaks after a swearing-in ceremony for Pam Bondi, US attorney general, in the Oval Office of the White House in Washington, DC, US, on Wednesday, Feb. 5, 2025.",
    "link": "https://biztoc.com/x/f96ae4ec2dd97d4e",
    "timestamp": "2025-02-11T12:39:27Z"
  },
  {
    "title": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaints",
    "description": "President Donald Trump has ordered the U.S. to stop minting pennies",
    "link": "https://biztoc.com/x/7be679ff4ae1c04a",
    "timestamp": "2025-02-11T12:38:59Z"
  },
  {
    "title": "Modi to meet Trump with focus on trade, immigration and strategic ties",
    "description": "New Delhi — As Indian Prime Minister Narendra Modi heads to the United States for a two-day visit starting Wednesday, officials in New Delhi expressed optimism that the visit will herald a renewed and substantive partnership. However analysts said there will …",
    "link": "https://www.voanews.com/a/modi-to-meet-trump-with-focus-on-trade-immigration-and-strategic-ties-/7970558.html",
    "timestamp": "2025-02-11T12:38:24Z"
  },
  {
    "title": "Trump Taunts Bret Baier With ‘Rigged’ Election Claim: See If ‘Fox Lets You Put That In’",
    "description": "President Donald Trump peppered Fox News anchor Bret Baier with \"rigged election\" claims — then taunted \"let's see whether or not Fox lets you put that in.\"\nThe post Trump Taunts Bret Baier With ‘Rigged’ Election Claim: See If ‘Fox Lets You Put That In’ first…",
    "link": "https://www.mediaite.com/news/trump-taunts-bret-baier-with-rigged-election-claim-see-if-fox-lets-you-put-that-in/",
    "timestamp": "2025-02-11T12:37:39Z"
  },
  {
    "title": "Judge Denies CBS Motion to Dismiss Trump ’60 Minutes’ Lawsuit as He Demands $10 Billion More",
    "description": "A federal judge on Monday initiated a procedural move to deny a CBS motion seeking to dismiss President Donald Trump’s lawsuit over a 60 Minutes broadcast.\nThe post Judge Denies CBS Motion to Dismiss Trump ’60 Minutes’ Lawsuit as He Demands $10 Billion More a…",
    "link": "https://www.breitbart.com/entertainment/2025/02/11/judge-denies-cbs-motion-to-dismiss-trump-60-minutes-lawsuit-as-he-demands-10-billion-more/",
    "timestamp": "2025-02-11T12:35:11Z"
  },
  {
    "title": "Crooks use Google Tag Manager skimmer to steal credit card data from a Magento-based e-stores",
    "description": "Sucuri researchers observed threat actors leveraging Google Tag Manager (GTM) to install e-skimmer software on Magento-based e-stores. Sucuri researchers found threat actors using Google Tag Manager (GTM) to deploy e-skimmer malware on a Magento eCommerce sit…",
    "link": "https://securityaffairs.com/174085/cyber-crime/google-tag-manager-gtm-e-skimmer-software-in-magento.html",
    "timestamp": "2025-02-11T12:34:42Z"
  },
  {
    "title": "Trump Signs Orders For Steel, Aluminum Tariffs From March 12",
    "description": "US President Donald Trump signed executive orders to impose 25 percent tariffs on steel and aluminum imports from March 12, ramping up a long-promised trade war despite warnings from Europe and China.",
    "link": "https://www.ndtv.com/world-news/donald-trump-signs-orders-for-steel-aluminum-us-tariffs-from-march-12-7686535",
    "timestamp": "2025-02-11T12:32:07Z"
  },
  {
    "title": "In China's Silicon Valley, where the founder of DeepSeek keeps a low profile",
    "description": "The city of Hangzhou in southern China is one of the country's leading technology hubs, and home to the groundbreaking artificial intelligence (AI) company DeepSeek.",
    "link": "https://news.sky.com/story/in-chinas-silicon-valley-where-founder-of-deepseek-liang-wenfeng-keeps-a-low-profile-13307158",
    "timestamp": "2025-02-11T12:32:00Z"
  },
  {
    "title": "Vance rails against AI regulation in Paris as US faces off with EU, China",
    "description": "US vice president warns global leaders against striking AI deals with ‘authoritarian regimes’ in a veiled jab at China.",
    "link": "https://www.aljazeera.com/news/2025/2/11/vance-rails-against-ai-regulation-in-paris-as-us-faces-off-with-eu-china",
    "timestamp": "2025-02-11T12:31:18Z"
  },
  {
    "title": "Ukraine offers rare earth deal to Trump for more US military aid",
    "description": "U.S. companies have expressed interest to a deal, according to Ukrainian business officials.",
    "link": "https://www.bostonherald.com/2025/02/11/ukraine-rare-earth-deal-trump/",
    "timestamp": "2025-02-11T12:30:39Z"
  },
  {
    "title": "Trump to halt enforcement of law banning bribery of foreign officials",
    "description": "Donald Trump is halting the enforcement of a law that bars Americans from bribing foreign government officials to win business. Read more.",
    "link": "https://financialpost.com/financial-times/trump-enforcement-law-banning-bribery-foreign-officials",
    "timestamp": "2025-02-11T12:30:07Z"
  },
  {
    "title": "Don’t Scapegoat Arab Americans for Trump’s Win",
    "description": "There’s an insidious blame game occurring on social media. Whenever U.S. President Donald Trump takes one of his outrageous actions, Arab Americans are subjected to a flood of abusive messages. The “nicer” comments simply blame us for Mr. Trump’s victory, but…",
    "link": "https://www.commondreams.org/opinion/arab-americans-scapegoat-trump",
    "timestamp": "2025-02-11T12:30:04Z"
  },
  {
    "title": "Gerald Ford’s Unlikely Role in the Imperial Presidency",
    "description": "In a new book, Jeffrey Toobin makes a convincing case that Ford’s pardon of President Nixon set the stage for unchecked presidential power.",
    "link": "https://www.theatlantic.com/books/archive/2025/02/gerald-fords-nixon-pardon-paved-the-way-for-elon-musk/681637/",
    "timestamp": "2025-02-11T12:30:00Z"
  },
  {
    "title": "‘Gulf of America’ arrives on Google Maps",
    "description": "The body of water formerly known in the United States as the Gulf of Mexico is now listed for U.S.-based users of Google Maps as the Gulf of America.",
    "link": "https://roanoke.com/news/nation-world/gulf-of-mexico-name-change-trump-executive-order-mt-mckinley-denali/article_8b029527-9a88-5a17-bfb7-445e9b7ea051.html",
    "timestamp": "2025-02-11T12:30:00Z"
  },
  {
    "title": "EXCLUSIVE: Hollywood Pariah Mel Gibson 'Vowing to Drain the Swamp of Hollywood' After Being Appointed Showbiz's 'Special Envoy' by MAGA Pal Donald Trump – 'It's Revenge Time!'",
    "description": "Mel Gibson is said to be vowing to drain Hollywood's 'swamp' after Trump appointed him showbiz's special envoy.",
    "link": "https://radaronline.com/p/mel-gibson-vow-drain-hollywood-swamp-trump-special-envoy-hollywood/",
    "timestamp": "2025-02-11T12:30:00Z"
  },
  {
    "title": "Is it fair to ban trans women from female sport?",
    "description": "This week’s episode of The 42FM is brought to you by An Post Money. Last week, Donald Trump signed an Executive Order banning transgender women from female sport, beneath the title, “Keeping Men Out of Women’s Sport”.",
    "link": "https://www.the42.ie:443/podcasts/66991213e18d4682d7b64eae/67ab3e9cc6f97f89d8fdad6a/",
    "timestamp": "2025-02-11T12:29:28Z"
  },
  {
    "title": "What if Donald Trump calls the courts’ bluff?",
    "description": "The US judiciary poses the ultimate test of whether the president will break the system",
    "link": "https://biztoc.com/x/4737ee1838c1c9bd",
    "timestamp": "2025-02-11T12:28:16Z"
  },
  {
    "title": "Trump signs tariffs on steel and aluminum amid new legal hurdles",
    "description": "With the stroke of his pen, President Donald Trump raises tariffs on U.S. allies and adversaries alike, imposing new duties on steel and aluminum imports. The move would benefit American producers, but it could lead to higher prices. This comes as Trump faces…",
    "link": "https://biztoc.com/x/569d279d7edb91db",
    "timestamp": "2025-02-11T12:28:02Z"
  },
  {
    "title": "India view support for Iran port project despite US sanctions",
    "description": "Modi is expected to discuss the Chabahar port issue with Trump in their upcoming meeting Read Full Article at RT.com",
    "link": "https://www.rt.com/india/612514-india-iran-us-chabahar-port/",
    "timestamp": "2025-02-11T12:27:57Z"
  },
  {
    "title": "Trump signs executive order on plastic drinking straws",
    "description": "WASHINGTON: President Donald Trump on Monday (Feb 10) signed an executive order aimed at encouraging the US government and consumers to buy plastic drinking straws, pushing back efforts by his predecessor to phase out single-use plastics and tackle waste. \"We…",
    "link": "https://www.channelnewsasia.com/sustainability/trump-signs-executive-order-plastic-drinking-straws-4930891",
    "timestamp": "2025-02-11T12:25:32Z"
  },
  {
    "title": "Trump once again slaps taxes on foreign steel, aluminum, a move that proved costly in his first term",
    "description": "Trump did pretty much the same with steel and aluminum tariffs during his first term. But they took a toll last time,",
    "link": "https://www.denverpost.com/2025/02/11/trump-steel-aluminum-tariffs-explained/",
    "timestamp": "2025-02-11T12:25:25Z"
  },
  {
    "title": "Binance and SEC Move to Halt Case, Find an Early Resolution",
    "description": "The newly launched crypto task force could help \" facilitate the potential resolution of this case,\" the court filing said.",
    "link": "https://www.coindesk.com/policy/2025/02/11/binance-and-sec-move-to-halt-case-find-an-early-resolution",
    "timestamp": "2025-02-11T12:24:42Z"
  },
  {
    "title": "EU vows countermeasures to US tariffs; bourbon, jeans, peanut butter, motorcycles easy targets",
    "description": "European Union chief Ursula von der Leyen vowed that U.S. tariffs on steel and aluminum “will not go unanswered” and will trigger tough countermeasures from the 27-nation bloc",
    "link": "https://abcnews.go.com/Business/wireStory/eu-vows-countermeasures-us-tariffs-bourbon-jeans-peanut-118680453",
    "timestamp": "2025-02-11T12:22:18Z"
  },
  {
    "title": "So long, penny! Trump orders US to ditch 1-cent coin after decades of complaints",
    "description": "President Donald Trump has ordered the U.S. to stop minting pennies",
    "link": "https://abcnews.go.com/Business/wireStory/long-penny-trump-orders-us-ditch-1-cent-118663875",
    "timestamp": "2025-02-11T12:22:16Z"
  },
  {
    "title": "'Ridiculous and lame': South Africans mock Trump proposals",
    "description": "by Hillary ORINDE'On the streets of Johannesburg's student district, U.S. President Donald Trump's offer to accept white Afrikaners as refugees landed as both \"ridiculous\" and \"lame\", among South Africans of all races.On Friday, Trump cut off aid to South Afr…",
    "link": "https://www.rawstory.com/ridiculous-and-lame-south-africans-mock-trump-proposals/",
    "timestamp": "2025-02-11T12:21:29Z"
  },
  {
    "title": "Wheaton’s Cowardice In The Face Of Russ Vought Attacks Is Emblematic Of Its Leftward Lurch",
    "description": "It should not be controversial for Wheaton College to request prayer for alum Russ Vought as he takes a position in the Trump administration.",
    "link": "https://thefederalist.com/2025/02/11/wheatons-cowardice-in-the-face-of-russ-vought-attacks-is-emblematic-of-its-leftward-lurch/",
    "timestamp": "2025-02-11T12:21:26Z"
  },
  {
    "title": "Judge Chutkan Should Be Disqualified From Hearing Trump Cases After Defying His J6 Order",
    "description": "Chutkan's order refusing to dismiss the charges against John Banuelos is a mishmash of confusion, defiance, and intellectual incoherence.",
    "link": "https://thefederalist.com/2025/02/11/judge-chutkan-should-be-disqualified-from-hearing-trump-cases-after-defying-his-j6-order/",
    "timestamp": "2025-02-11T12:21:21Z"
  },
  {
    "title": "Trump rolls back standards for water-using appliances, light bulbs",
    "description": "WASHINGTON (Reuters) -President Donald Trump on Tuesday moved to revert to older standards for light bulbs as well as toilets, showers and other water-using ...",
    "link": "https://ca.finance.yahoo.com/news/trump-roll-back-appliance-light-122050090.html",
    "timestamp": "2025-02-11T12:20:50Z"
  },
  {
    "title": "'Be very careful': Trump insiders warn next moves could trigger MAGA turmoil",
    "description": "Donald Trump’s declared war on the federal government has so far met with less resistance than expected — and produced favorable poll numbers that has the president planning to forge ahead, Politico reported Tuesday.But his next moves could be devastating to …",
    "link": "https://www.rawstory.com/usaid-cuts-trump/",
    "timestamp": "2025-02-11T12:19:10Z"
  },
  {
    "title": "Trump Tariffs Live Updates: EU Warns Of Countermeasures Against 25% Steel And Aluminum Tariffs",
    "description": "Economists have broadly predicted Trump’s tariffs will raise prices and harm the economy.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/02/11/trump-tariffs-live-updates-eu-warns-of-countermeasures-against-25-steel-and-aluminum-tariffs/",
    "timestamp": "2025-02-11T12:17:20Z"
  },
  {
    "title": "The End Of The Fed?—Trump And Musk Attack As Gold And The Bitcoin Price Soar",
    "description": "Elon Musk has backed bitcoin hero Ron Paul for Fed chair—author of 2009 book End The Fed...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/02/11/the-end-of-the-fed-trump-and-musk-attack-as-gold-and-the-bitcoin-price-soar/",
    "timestamp": "2025-02-11T12:15:54Z"
  },
  {
    "title": "Daniel Gros on DeepSeek, Germany's malaise, EU competitiveness, and more",
    "description": "Daniel Gros hopes that a Chinese startup's apparent AI breakthrough will provide a much-needed boost to European competitiveness, advises the EU on how to deal with Donald Trump, urges Europe to improve conditions for bottom-up innovation, and more.",
    "link": "https://www.project-syndicate.org/onpoint/an-interview-with-daniel-gros-on-deepseek-germany-eu-competitiveness-trump-tariffs-2025-02",
    "timestamp": "2025-02-11T12:15:48Z"
  },
  {
    "title": "Binance, SEC request pause in legal battle as Trump's crypto policy takes shape",
    "description": "Binance and the U.S. Securities and Exchange Commission have jointly asked a court for a 60-day stay on the regulator's lawsuit against the crypto exchange, citing the potential impact of a newly launched task force.In a court filing dated Monday, the parties…",
    "link": "https://www.channelnewsasia.com/business/binance-sec-request-pause-legal-battle-trumps-crypto-policy-takes-shape-4930896",
    "timestamp": "2025-02-11T12:15:28Z"
  },
  {
    "title": "Alleged Alberta health scandal leaves Smith speechless",
    "description": "Alberta Premier Danielle Smith’s fortunes abruptly changed when a former CEO of Alberta Health Services accused her government of corruption.",
    "link": "https://www.thestar.com/opinion/contributors/health-scandal-leaves-alberta-premier-danielle-smith-suddenly-speechless/article_ee3c787a-e7c2-11ef-8b44-f7baeee3a76c.html",
    "timestamp": "2025-02-11T12:15:16Z"
  },
  {
    "title": "Trump signs tariffs on steel and aluminum amid new legal hurdles",
    "description": "With the stroke of his pen, President Donald Trump raises tariffs on U.S. allies and adversaries alike, imposing new duties on steel and aluminum imports. The move would benefit American producers, but it could lead to higher prices. This comes as Trump faces…",
    "link": "https://www.today.com/video/trump-imposes-25-tariffs-on-steel-and-aluminum-imported-into-us-231631429878",
    "timestamp": "2025-02-11T12:14:41Z"
  },
  {
    "title": "Hamas Responds to Donald Trump's Threat",
    "description": "Hamas spokesman Sami Abu Zuhri reiterated that hostages would only be freed if Israel abides by a ceasefire agreement.",
    "link": "https://www.newsweek.com/hamas-responds-donald-trump-hell-threat-israel-war-gaza-hostages-2029297",
    "timestamp": "2025-02-11T12:14:26Z"
  },
  {
    "title": "Thousands of investors in Trump’s memecoin lost $2 billion in just weeks while the family and its partners racked up $100 million in trading fees",
    "description": "Thousands of investors in Trump’s memecoin lost $2 billion in just weeks while the family and its partners racked up $100 million in trading feesnewsbreak.com",
    "link": "https://www.newsbreak.com/share/3801621114430-thousands-of-investors-in-trump-s-memecoin-lost-2-billion-in-just-weeks-while-the-family-and-its-partners-racked-up-100-million-in-trading-fees?_f=app_share&amp;pd=0Gf32SZl&amp;lang=en_US&amp;send_time=1739275945&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-control%2Cns_foryou_recall_exp_25q1-v4%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_model_exp_25q1-v8&amp;s=i2",
    "timestamp": "2025-02-11T12:13:02Z"
  },
  {
    "title": "Trump blasts NYC ‘lawfare’ as vows to ‘MAKE NEW YORK GREAT AGAIN’",
    "description": "\"New York is the most corrupt State in the Union. That is why so many businesses and people are fleeing,\" the president wrote.",
    "link": "https://nypost.com/2025/02/11/us-news/trump-blasts-nyc-lawfare-as-vows-to-make-new-york-great-again/",
    "timestamp": "2025-02-11T12:12:47Z"
  },
  {
    "title": "Trump tariffs ‘will not go unanswered’ – von der Leyen",
    "description": "The EU Commission chief has warned of “proportionate” countermeasures if the US president raises tariffs on imports of metals Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612505-eu-trump-metals-tariffs/",
    "timestamp": "2025-02-11T12:12:42Z"
  },
  {
    "title": "US lawmakers question Biden DoJ’s Adani indictment in letter to Attorney General",
    "description": "The lawmakers argued that the DoJ’s pursuit of a case involving allegations of bribery against Indian officials could jeopardise US-India relations and was not in America’s best interest",
    "link": "https://www.thehindubusinessline.com/news/world/us-lawmakers-question-biden-dojs-adani-indictment-in-letter-to-attorney-general/article69206662.ece",
    "timestamp": "2025-02-11T12:12:18Z"
  },
  {
    "title": "‘Let hell break out’: Trump demands Hamas release all hostages",
    "description": "President Donald Trump says he will cancel the carefully negotiated ceasefire deal between Israel and Hamas if Hamas doesn’t release all remaining hostages by Saturday. “All bets are off and let hell break out,” he says. NBC’s Keir Simmons reports for TODAY.",
    "link": "https://www.today.com/video/trump-gives-hamas-ultimatum-over-remaining-hostages-in-gaza-231633477550",
    "timestamp": "2025-02-11T12:12:16Z"
  },
  {
    "title": "Super Bowl LIX shatters viewership records as millions watched Eagles win",
    "description": "Super Bowl LIX shattered viewership numbers, FOX Sports said on Monday. The Philadelphia Eagles defeated the Kansas City Chiefs, 40-22.",
    "link": "https://www.foxnews.com/sports/super-bowl-lix-shatters-viewership-records-millions-watched-eagles-win",
    "timestamp": "2025-02-11T12:12:10Z"
  },
  {
    "title": "'Ridiculous And Lame': South Africans Mock Trump Proposals",
    "description": "On the streets of Johannesburg's student district, US President Donald Trump's offer to accept white Afrikaners as refugees landed as both \"ridiculous\" and \"lame\", among South Africans of all races.",
    "link": "https://www.ibtimes.com/ridiculous-lame-south-africans-mock-trump-proposals-3763239",
    "timestamp": "2025-02-11T12:12:08Z"
  },
  {
    "title": "Judge orders FBI to release some information in Trump documents case",
    "description": "Judge Beryl Howell issued a memorandum opinion on Monday.",
    "link": "https://abcnews.go.com/Politics/judge-orders-fbi-release-information-trump-documents-case/story?id=118682652",
    "timestamp": "2025-02-11T12:11:46Z"
  },
  {
    "title": "As Musk cuts federal spending, his own firms have received billions in contracts - NewsBreak",
    "description": "As Elon Musk has led an effort to slash government spending, his own companies have, over the last few years, received billions of dollars in government co",
    "link": "https://www.newsbreak.com/share/3801081533840-as-musk-cuts-federal-spending-his-own-firms-have-received-billions-in-contracts?_f=app_share&amp;pd=060itnLV&amp;lang=en_US&amp;send_time=1739275791&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v3%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v8&amp;s=i2",
    "timestamp": "2025-02-11T12:10:57Z"
  },
  {
    "title": "Who is Rod Blagojevich, why did Donald Trump pardon him, and what’s his connection to Barack Obama?",
    "description": "Former President Trump has granted a complete pardon to Rod Blagojevich, the former Illinois governor convicted for corruption in 2011, including attempting to sell Obama's Senate seat. Trump's decision has sparked mixed reactions, with some viewing it as exc…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/who-is-rod-blagojevich-why-did-donald-trump-pardon-him-and-whats-his-connection-to-barack-obama/articleshow/118146716.cms",
    "timestamp": "2025-02-11T12:09:49Z"
  },
  {
    "title": "Why are Ukraine's minerals key to keeping US military aid flowing?",
    "description": "Ukraine has offered to strike a deal with U.S. President Donald Trump for continued American military aid in exchange for developing Ukraine’s mineral industry.",
    "link": "https://www.news4jax.com/business/2025/02/11/why-are-ukraines-minerals-key-to-keeping-us-military-aid-flowing/",
    "timestamp": "2025-02-11T12:09:03Z"
  },
  {
    "title": "Canada Will Resist US Steel Tariffs \"Strongly And Firmly\": Justin Trudeau",
    "description": "Canadian Prime Minister Justin Trudeau said on Tuesday that his country will &quot;resist&quot; any US tariffs on steel, announced by President Donald Trump.",
    "link": "https://www.ndtv.com/world-news/canada-will-resist-us-steel-tariffs-strongly-and-firmly-justin-trudeau-7686283",
    "timestamp": "2025-02-11T12:08:11Z"
  },
  {
    "title": "Officials bristle at courts throttling Trump actions and Hamas postpones hostage exchange: Morning Rundown",
    "description": "Court rulings against parts of Donald Trump's agenda put White House officials on the defensive.",
    "link": "https://www.nbcnews.com/news/trump-admin-rulings-hamas-hostage-exchange-morning-rundown-rcna191618",
    "timestamp": "2025-02-11T12:07:10Z"
  },
  {
    "title": "Elon Musk, DOGE Team's Access To Sensitive Student Loan Data Raises Alarms: What's At Risk?",
    "description": "Democrats and student loan borrowers worry this access may violate federal privacy laws. However, even if the access was unlawful, borrowers were unlikely to see any relief.",
    "link": "https://www.ibtimes.com/elon-musk-doge-teams-access-sensitive-student-loan-data-raises-alarms-whats-risk-3763223",
    "timestamp": "2025-02-11T12:07:01Z"
  },
  {
    "title": "'The Trump Swamp Is Growing': President Fires Ethics Chief as DOJ Moves to Drop Eric Adams Charges",
    "description": "U.S. President Donald Trump on Monday fired the director of the Office of Government Ethics as his administration—packed with billionaires and riddled with conflicts of interest—abandons even the pretense of opposing corruption and lawlessness, a course under…",
    "link": "https://www.commondreams.org/news/trump-fires-ethics-director",
    "timestamp": "2025-02-11T12:06:39Z"
  },
  {
    "title": "White House halts enforcing of anti-bribery law by US companies",
    "description": "The News\nUS President Donald Trump ordered the Department of Justice to halt enforcement of a 48-year-old law barring American companies from bribing foreign governments.\nThe move will allow US businesses to compete with countries not bound by similar rules: …",
    "link": "https://biztoc.com/x/7d9e5cb34b8d8a5f",
    "timestamp": "2025-02-11T12:06:12Z"
  },
  {
    "title": "JD Vance tells Europe: Deregulate or the AI revolution will leave you behind",
    "description": "The US vice president warned Europe that red tape could \"strangle\" AI development.",
    "link": "https://www.businessinsider.com/vance-swipes-at-eu-in-ai-summit-speech-2025-2",
    "timestamp": "2025-02-11T12:06:04Z"
  },
  {
    "title": "Why Trump’s new tariffs are such a strange idea",
    "description": "An ironworker with pliers wraps wire around the rebar falsework for the helix structure during the construction of a new bridge on October 30, 2021, in Los Angeles. | Gary Leonard/Getty Images\nDonald Trump announced Monday that the US will impose a 25 percent…",
    "link": "https://biztoc.com/x/454473037d8e2da0",
    "timestamp": "2025-02-11T12:05:51Z"
  },
  {
    "title": "Watch: Rapper Cardi B Claims Her ‘Uncle Got Deported’ in Anti-Trump Rant",
    "description": "Rapper Cardi B has claimed her \"uncle got deported\" due to President Donald Trump's illegal immigration crackdown.\nThe post Watch: Rapper Cardi B Claims Her ‘Uncle Got Deported’ in Anti-Trump Rant appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/02/11/cardi-b-claims-her-uncle-got-deported-in-anti-trump-rant/",
    "timestamp": "2025-02-11T12:05:43Z"
  },
  {
    "title": "Thousands of investors in Trump’s memecoin lost $2 billion in just weeks while the family and its partners racked up $100 million in trading fees",
    "description": "Thousands of investors in Trump’s memecoin lost $2 billion in just weeks while the family and its partners racked up $100 million in trading feesnewsbreak.com",
    "link": "https://www.newsbreak.com/share/3801621114430-thousands-of-investors-in-trump-s-memecoin-lost-2-billion-in-just-weeks-while-the-family-and-its-partners-racked-up-100-million-in-trading-fees?s=a2&amp;share_destination_id=MjU4Mjk4MzU5LTE3MzkyNzU0MjEyMDg%3D&amp;pd=0HTnCZyB&amp;hl=en_US&amp;send_time=1739275421&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_push_exp_rt_bucketv12-v5%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_model_exp_25q1-v2%2Cns_foryou_blend_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v4",
    "timestamp": "2025-02-11T12:05:31Z"
  },
  {
    "title": "North Korea issues warning after U.S. sub docks in South Korea",
    "description": "The nuclear-powered USS Alexandria is a 360-foot fast-attack submarine equipped with Tomahawk missiles and MK48 torpedoes.",
    "link": "https://www.cbsnews.com/news/north-korea-us-submarine-south-korea-hostile-military-act/",
    "timestamp": "2025-02-11T12:05:10Z"
  },
  {
    "title": "Will Trump really defy the courts? (Andrew Prokop/Vox)",
    "description": "Andrew Prokop / Vox:\nWill Trump really defy the courts?  —  Is a constitutional crisis coming — or is it already here? … Donald Trump and Elon Musk's efforts to transform federal spending and the federal workforce is crashing up against judges who've temporar…",
    "link": "https://www.memeorandum.com/250211/p8",
    "timestamp": "2025-02-11T12:05:00Z"
  },
  {
    "title": "Donald Trump Is Not A Threat To Democracy — Those Shredding Article II Are",
    "description": "Blue states are partnering with federal judges to prohibit the normal functioning of the executive branch.",
    "link": "https://thefederalist.com/2025/02/11/donald-trump-is-not-a-threat-to-democracy-those-shredding-article-ii-are/",
    "timestamp": "2025-02-11T12:04:07Z"
  },
  {
    "title": "Elon Musk, Crypto Leaders Laud 'Unplugging' Of CFPB, Critics Push Back",
    "description": "Elon Musk and some crypto executives celebrated the Trump government's work on shutting down the CFPB, raising questions among other crypto users and X commenters about whether they actually cared about the financial welfare of Americans.",
    "link": "https://www.ibtimes.com/elon-musk-crypto-leaders-laud-unplugging-cfpb-critics-push-back-3763220",
    "timestamp": "2025-02-11T12:03:02Z"
  },
  {
    "title": "EU vows countermeasures to US tariffs; bourbon, jeans, peanut butter, motorcycles easy targets",
    "description": "European Union chief Ursula von der Leyen has promised firm countermeasures against U.S. tariffs on steel and aluminum. The EU aims to protect its economic interests by targeting iconic U.S. industries like bourbon and motorcycles. Officials stressed the impo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eu-vows-countermeasures-to-us-tariffs-bourbon-jeans-peanut-butter-motorcycles-easy-targets/articleshow/118147029.cms",
    "timestamp": "2025-02-11T12:02:26Z"
  },
  {
    "title": "Elon Musk heads group trying to buy control of OpenAI: report",
    "description": "Elon Musk is leading an investment group offering $97.4 billion for the nonprofit that controls OpenAI, marking a new front in his war with the ChatGPT-maker, the Wall Street Journal reported Monday.Musk attorney Marc Toberoff said he submitted the bid to Ope…",
    "link": "https://www.rawstory.com/elon-musk-heads-group-trying-to-buy-control-of-openai-report/",
    "timestamp": "2025-02-11T12:02:16Z"
  },
  {
    "title": "How Many Trump Officials Have Taken Money From Qatar?",
    "description": "Oversight laws about foreign influence were already limited. Now the Trump administration is shredding them.\nThe post How Many Trump Officials Have Taken Money From Qatar? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/02/11/trump-qatar-ethics-patel-zeldin-bondi/",
    "timestamp": "2025-02-11T12:02:00Z"
  },
  {
    "title": "Great Again! Tabs, Tues., Feb. 11, 2025",
    "description": "How great are tabs? Great again!",
    "link": "https://www.wonkette.com/p/great-again-tabs-tues-feb-11-2025",
    "timestamp": "2025-02-11T12:01:49Z"
  },
  {
    "title": "\"India Developing Own Large Language Model\": PM At AI Summit In France",
    "description": "India is developing its own large language model in a public-private partnership (PPP) mode, Prime Minister Narendra Modi said at the AI Action Summit in Paris.",
    "link": "https://www.ndtv.com/world-news/india-developing-own-large-language-model-says-pm-narendra-modi-at-ai-action-summit-in-france-7686237",
    "timestamp": "2025-02-11T12:00:54Z"
  },
  {
    "title": "Trump Rescinds Biden’s Banal Ban on Plastic Straws",
    "description": "\"Enjoy your next drink without a straw that disgustingly dissolves in your mouth!!!\"\nThe post Trump Rescinds Biden’s Banal Ban on Plastic Straws first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/trump-rescinds-bidens-banal-ban-on-plastic-straws/",
    "timestamp": "2025-02-11T12:00:19Z"
  },
  {
    "title": "Video of Trump signing executive order banning skinny jeans for men is fake",
    "description": "A Fox News broadcast authentically showed U.S. President Donald Trump signing an executive order to ban \"grown men\" from wearing skinny jeans.",
    "link": "https://www.snopes.com//fact-check/trump-video-skinny-jeans/",
    "timestamp": "2025-02-11T12:00:00Z"
  },
  {
    "title": "Virtue Signaling Is Out. Vice Signaling Is In.",
    "description": "Ye called himself a Nazi. That wasn’t the worst story on social media this weekend.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/02/kanye-vance-repubicans-vice-signaling/681641/",
    "timestamp": "2025-02-11T12:00:00Z"
  },
  {
    "title": "Crypto Daybook Americas: ADA Rallies, BTC Looks to Powell's Testimony on Capitol Hill",
    "description": "The day ahead in crypto: Feb. 11, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/02/11/crypto-daybook-americas-ada-rallies-btc-looks-to-powell-s-testimony-on-capitol-hill",
    "timestamp": "2025-02-11T12:00:00Z"
  },
  {
    "title": "Super Bowl Halftime Show Triggers a Racist and Antisemitic Meltdown From Stew Peters",
    "description": "Far-right broadcaster Stew Peters had a meltdown over the Super Bowl halftime show, claiming that it was orchestrated by \"subversive Jews\" to give a \"platform for degenerate blacks\" to put on an \"an anti-white shitshow.\"",
    "link": "https://www.peoplefor.org/rightwingwatch/super-bowl-halftime-show-triggers-racist-and-antisemitic-meltdown-stew-peters",
    "timestamp": "2025-02-11T12:00:00Z"
  },
  {
    "title": "Worse Than You Think",
    "description": "<ul>\n<li>Bannon Pleads Guilty</li>\n<li>Fishing For Musk Retweets</li>\n<li>I Hope You Had The Time Of Your Life</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/worse-you-think",
    "timestamp": "2025-02-11T12:00:00Z"
  },
  {
    "title": "OpenAI CEO touts Trump's hands-on approach with $500B Stargate project as a \"welcome breath of fresh air\" — Altman predicts a \"vibe shift\" in Silicon Valley",
    "description": "OpenAI CEO Sam Altman recently touted President Trump's approach to tech and AI as opposed to Biden's \"hostile\" takes.",
    "link": "https://www.windowscentral.com/software-apps/openai-ceo-touts-trumps-hands-on-approach-as-welcome-breath-of-fresh-air",
    "timestamp": "2025-02-11T12:00:00Z"
  }
]