[
  {
    "title": "Jensen Huang Hypes New Chips In Keynote",
    "description": "In a speech on Nvidia’s new offerings, Huang laid out some ideas about what data centers and tech stacks are soon going to look like. \n\nSECTION:",
    "link": "https://www.forbes.com/sites/johnwerner/2025/03/21/jensen-huang-hypes-new-chips-in-keynote/",
    "timestamp": "2025-03-21T14:58:17Z"
  },
  {
    "title": "Tim Walz Gloats About Tesla Stock Dip While Ignoring His State’s 1.6 Million Shares In Its Retirement Fund",
    "description": "During a Tuesday town hall in Wisconsin, Walz revealed that he checks the value of Tesla's stock when he needs \"a little boost.\"",
    "link": "https://dailycaller.com/2025/03/21/tim-walz-gloats-about-tesla-stock-dip-while-ignoring-his-states-1-6-million-shares-in-its-retirement-fund/",
    "timestamp": "2025-03-21T14:58:10Z"
  },
  {
    "title": "New poll shows rising alarm among Canadians over U.S. tariffs, Donald Trump’s policies, and economic aggression, with Quebecers feeling the most impact",
    "description": "Canadians are increasingly concerned about US tariffs, Trump’s policies and American economic aggression, with a significant rise in worries among Quebecers. The impact of these tariffs could soon affect the cost of living. Senior Canadians are more worried t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/new-poll-shows-rising-alarm-among-canadians-over-u-s-tariffs-donald-trumps-policies-and-economic-aggression-with-quebecers-feeling-the-most-impact/articleshow/119307137.cms",
    "timestamp": "2025-03-21T14:57:57Z"
  },
  {
    "title": "ReArm Europe? EU Re-thinks Name After Objections",
    "description": "The EU may be scrambling to boost its defences in the face of Russia and unpredictable US President Donald Trump -- but low-spending Spain and Italy insist Brussels avoids saying \"rearm\".",
    "link": "https://www.ibtimes.com/rearm-europe-eu-re-thinks-name-after-objections-3767217",
    "timestamp": "2025-03-21T14:57:08Z"
  },
  {
    "title": "Federal funding cuts at global news outlets lead to mass furloughs as they fight back with lawsuits and appeals",
    "description": "In the wake of steep funding cuts initiated by President Donald Trump, news organizations affiliated with the U.S. Agency for Global Media are asking Congress and the courts to intervene […]\nThe post Federal funding cuts at global news outlets lead to mass fu…",
    "link": "https://www.poynter.org/reporting-editing/2025/usagm-radio-free-asia-middle-east-broadcast-networks-trump-musk-doge-cuts/",
    "timestamp": "2025-03-21T14:56:52Z"
  },
  {
    "title": "Threats to federal judges increasing, US Marshals Service warns",
    "description": "Chief Justice John Roberts previously warned of threats to federal judges.",
    "link": "https://abcnews.go.com/Politics/threats-federal-judges-increasing-us-marshals-service-warns/story?id=120019609",
    "timestamp": "2025-03-21T14:56:45Z"
  },
  {
    "title": "It Is Now or It Is Never",
    "description": "There’s a letter at the end of this post that’s very much worth the read, but I have to explain some context first bec",
    "link": "https://kottke.org/25/03/it-is-now-or-it-is-never",
    "timestamp": "2025-03-21T14:56:22Z"
  },
  {
    "title": "Hungary secures Russian sanctions exemption from US",
    "description": "A waiver will allow Budapest to pay for Russian gas via Gazprombank, FM Peter Szijjarto has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614594-hungary-us-sanctions-gas-russia/",
    "timestamp": "2025-03-21T14:56:10Z"
  },
  {
    "title": "Putin 'wouldn't be worried' about NATO without the US, Trump claims",
    "description": "Donald Trump has said Russia is only fearful of NATO with the US as a member.",
    "link": "https://news.sky.com/story/russia-wouldnt-be-worried-about-nato-without-the-us-trump-claims-13333254",
    "timestamp": "2025-03-21T14:55:00Z"
  },
  {
    "title": "The 1600: The So-Called 'Land of the Free'",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics editor Carlo Versano.",
    "link": "https://www.newsweek.com/1600-so-called-land-free-2048610",
    "timestamp": "2025-03-21T14:54:27Z"
  },
  {
    "title": "Trump set to unveil multibillion-dollar fighter jet plan",
    "description": "United States President Donald Trump is expected to greenlight a high-tech aircraft the Air Force sees as crucial to countering China's military rise in the coming decades, The Wall Street Journal rep...",
    "link": "https://biztoc.com/x/48e873685c7b765e",
    "timestamp": "2025-03-21T14:54:03Z"
  },
  {
    "title": "WATCH LIVE: Trump, Hegseth deliver remarks from the White House",
    "description": "Hegseth is also scheduled to deliver remarks with President Donald Trump at the White House on Friday.",
    "link": "https://biztoc.com/x/bf4c89f1e8609892",
    "timestamp": "2025-03-21T14:53:26Z"
  },
  {
    "title": "Trump travel ban may hit MLB players from Cuba, Venezuela - Axios",
    "description": "Trump travel ban may hit MLB players from Cuba, VenezuelaAxios Trump travel ban 2.0 coming as soon as Friday. What countries it will affectUSA TODAY Draft List for New Travel Ban Proposes Trump Target 43 CountriesThe New York Times Full List of Countries That…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176784415",
    "timestamp": "2025-03-21T14:53:23Z"
  },
  {
    "title": "A Skadden lawyer has publicly resigned over her firm's response to Trump's attacks on Big Law",
    "description": "Trump has been targeting Big Law firms with executive orders.",
    "link": "https://www.businessinsider.com/skadden-lawyer-resigns-firms-response-to-trump-paul-weiss-2025-3",
    "timestamp": "2025-03-21T14:53:19Z"
  },
  {
    "title": "Family of slain U.S. DEA agent sues cartel and 3 suspected drug kingpins over 1985 murder",
    "description": "The family of U.S. federal agent Enrique “Kiki” Camarena has filed a lawsuit against the Sinaloa cartel in Mexico and three suspected drug kingpins over his brutal kidnap and murder in 1985.",
    "link": "https://www.nbcnews.com/news/us-news/family-slain-us-dea-agent-sues-cartel-3-suspected-drug-kingpins-1985-m-rcna197449",
    "timestamp": "2025-03-21T14:53:15Z"
  },
  {
    "title": "Donald Trump Wins $40M From D.C. Law Firm in Stunning Settlement",
    "description": "A major D.C. law firm has bent the knee to Donald Trump in shocking fashion ... essentially becoming a tool of the President. Trump signed an executive order last week, cutting all federal ties with the law firm of Paul, Weiss, Rifkind, Wharton…",
    "link": "https://www.tmz.com/2025/03/21/donald-trump-wins-paul-weiss-law-firm-executive-order-mark-pomerantz/",
    "timestamp": "2025-03-21T14:51:50Z"
  },
  {
    "title": "Head Quack At HHS, Robert F. Kennedy Jr., Floats Idea of Letting Bird Flu Spread, Experts Say That’s Incredibly Dumb",
    "description": "Robert F. Kennedy Jr. stupidly suggests that farmers should let bird flu spread among their flocks, experts sound the alarm.",
    "link": "https://hiphopwired.com/playlist/robert-f-kennedy-jr-let-bird-flu-spread-reactions/",
    "timestamp": "2025-03-21T14:51:26Z"
  },
  {
    "title": "Republicans’ case against the courts rests on one weird assumption",
    "description": "In 2023, the Republicans' case against prosecutors was based on ridiculous and faulty assumptions. In 2025, the party’s case against judges is eerily similar.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-case-courts-rests-one-weird-assumption-rcna197468",
    "timestamp": "2025-03-21T14:51:19Z"
  },
  {
    "title": "Zelensky Squares up to Trump Again, Forcefully Rejects Nuclear Power Plant Plan",
    "description": "Zelensky quick to rubbish Trump's suggestion to take tension over nuclear plant possession off the table by simply making them American.\nThe post Zelensky Squares up to Trump Again, Forcefully Rejects Nuclear Power Plant Plan appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/03/21/zelensky-squares-up-to-trump-again-forcefully-rejects-nuclear-power-plant-plan/",
    "timestamp": "2025-03-21T14:51:17Z"
  },
  {
    "title": "Former EPA Employees Warn of Polluted Skies Ahead Under Trump",
    "description": "The vast majority of voters want a strong EPA, but Trump is laying the agency to waste.",
    "link": "https://truthout.org/articles/former-epa-employees-warn-of-polluted-skies-ahead-under-trump/",
    "timestamp": "2025-03-21T14:51:06Z"
  },
  {
    "title": "Elon Musk's PAC Offers $100 To Wisconsin Voters Amid Heated Supreme Court Race",
    "description": "The billionaire has been accused of using his vast resources to bribe voters.",
    "link": "https://www.huffpost.com/entry/elon-musks-pac-offers-100-to-wisconsin-voters-amid-heated-supreme-court-race_n_67dd62d4e4b008723252f22f",
    "timestamp": "2025-03-21T14:50:13Z"
  },
  {
    "title": "WATCH LIVE: Trump, Hegseth deliver remarks from the White House",
    "description": "Hegseth is also scheduled to deliver remarks with President Donald Trump at the White House on Friday.",
    "link": "https://www.pbs.org/newshour/world/watch-live-trump-hegseth-deliver-remarks-from-the-white-house",
    "timestamp": "2025-03-21T14:49:40Z"
  },
  {
    "title": "Elon Musk meets defence officials in Pentagon visit",
    "description": "The White House denied media reports that he would receive a briefing on classified reports about China.",
    "link": "https://www.bbc.com/news/articles/c0mw7wr0gp9o",
    "timestamp": "2025-03-21T14:49:21Z"
  },
  {
    "title": "‘Extraordinary Moment!’ CNBC Reporter Stunned By Trump Mobilizing ‘Whole of Government Approach’ to Prop Up Tesla",
    "description": "Megan Casella called out the \"extraordinary moment\" in which President Donald Trump's administration rallied a \"whole-of-government approach to shore up Tesla.\"\nThe post ‘Extraordinary Moment!’ CNBC Reporter Stunned By Trump Mobilizing ‘Whole of Government Ap…",
    "link": "https://www.mediaite.com/news/extraordinary-moment-cnbc-reporter-stunned-by-trump-mobilizing-whole-of-government-approach-to-prop-up-tesla/",
    "timestamp": "2025-03-21T14:49:19Z"
  },
  {
    "title": "Marjorie Taylor Greene Calls to Pull FDA Approval of Coronavirus Vaccines 'ASAP'",
    "description": "Rep. Marjorie Taylor Greene (R-GA) is calling on the FDA to pull approval of the coronavirus vaccines and remove them from the childhood vaccine schedule, citing links to \"permanent harm and deaths.\"\nThe post Marjorie Taylor Greene Calls to Pull FDA Approval …",
    "link": "https://www.breitbart.com/politics/2025/03/21/marjorie-taylor-greene-calls-to-pull-fda-approval-of-coronavirus-vaccines-asap/",
    "timestamp": "2025-03-21T14:48:13Z"
  },
  {
    "title": "'That's the America we want?' Fury as violent threats hit Trump judge",
    "description": "Since U.S. President Donald Trump took office in January, the judicial branch has served as something of a firewall against some of his attempts to subvert congressional authority and undermine long-established constitutional law, with federal judges blocking…",
    "link": "https://www.rawstory.com/that-s-the-america-we-want-fury-as-violent-threats-hit-trump-judge/",
    "timestamp": "2025-03-21T14:46:43Z"
  },
  {
    "title": "Democrats raise millions for Florida special elections in Trump territory",
    "description": "The Democrats running in a pair of April 1 special elections for deeply Republican House districts in Florida have raised a whopping $15.7 million combined in two months, but they still face steep uphill climbs in the upcoming campaigns.",
    "link": "https://www.nbcnews.com/politics/elections/democrats-raise-millions-florida-special-elections-trump-territory-rcna197311",
    "timestamp": "2025-03-21T14:45:27Z"
  },
  {
    "title": "The Trump Administration is Threatening to Shut Down Social Security",
    "description": "The following is a statement from Nancy Altman, President of Social Security Works, on the news that Trump-appointed acting commissioner Leland Dudek is threatening to shut down Social Security rather than comply with a court order to stop Elon Musk’s DOGE fr…",
    "link": "https://www.commondreams.org/newswire/the-trump-administration-is-threatening-to-shut-down-social-security",
    "timestamp": "2025-03-21T14:45:03Z"
  },
  {
    "title": "Weekslong lockups of European tourists at US borders spark fears of traveling to America",
    "description": "Since Trump took office, there have been incidents of tourists being stopped at U.S. border crossings and held for weeks",
    "link": "https://www.denverpost.com/2025/03/21/immigration-crackdown-detaining-tourists/",
    "timestamp": "2025-03-21T14:44:48Z"
  },
  {
    "title": "Weekslong lockups of European tourists at US borders spark fears of traveling to America",
    "description": "Since Trump took office, there have been incidents of tourists being stopped at U.S. border crossings and held for weeks",
    "link": "https://www.bostonherald.com/2025/03/21/immigration-crackdown-detaining-tourists/",
    "timestamp": "2025-03-21T14:44:48Z"
  },
  {
    "title": "Detained Columbia University student activist Mahmoud Khalil appears in immigration case",
    "description": "Detained Columbia University student activist Mahmoud Khalil appeared briefly Friday in immigration court at a remote Louisiana detention center as his...",
    "link": "https://www.yahoo.com/news/detained-columbia-university-student-activist-144447985.html",
    "timestamp": "2025-03-21T14:44:47Z"
  },
  {
    "title": "Trump Official's 'Buy Tesla' Comment Raises Ethical Concerns: Experts",
    "description": "Commerce Secretary Howard Lutnick claimed that there will never be a better time to buy Tesla stock, in what legal scholars say could be a Hatch Act violation.",
    "link": "https://www.newsweek.com/president-donald-trump-elon-musk-tesla-shares-plunging-howard-lutnick-commerce-fox-news-2048497",
    "timestamp": "2025-03-21T14:43:05Z"
  },
  {
    "title": "Slog AM: Trump Tries to Kill Education Department, Heathrow Grounds Flights, Pirate's Booty Founder Flounders in Mayoral Bid",
    "description": "The Stranger's morning news roundup.\n \n by Nathalie Graham\n \n \n \n First things first: I'm writing this whole thing today without having watched the Severance finale so none of you better spoil shit. That goes for the entire internet, too. I'm out here dodging…",
    "link": "https://www.thestranger.com/slog-am/2025/03/21/79975878/slog-am-trump-tries-to-kill-education-department-heathrow-grounds-flights-pirates-booty-founder-flounders-in-mayoral-bid",
    "timestamp": "2025-03-21T14:43:00Z"
  },
  {
    "title": "Chuck Schumer Is the Weakest Link",
    "description": "The Senate minority leader wants to make sure everyone else is fighting for democracy—so he’s not at risk.",
    "link": "https://www.thenation.com/article/politics/chuck-schumer-weakest-link/",
    "timestamp": "2025-03-21T14:42:46Z"
  },
  {
    "title": "BREAKING: Federal judge will hear last-minute Trump admin request to undo block on trans military ban",
    "description": "A federal judge in Washington, D.C.\r\n, has scheduled an emergency hearing Friday after the Trump administration filed a last-minute request\r\n to dissolve an injunction blocking its transgender\r\n military\r\n ban. The hearing is set for 11:00 a.m.",
    "link": "https://www.advocate.com/news/transgender-military-ban-injunction-hearing",
    "timestamp": "2025-03-21T14:42:33Z"
  },
  {
    "title": "‘It’s A Mistake’: Megadonor Who Left Democrats Says Bernie Sanders And AOC’s Anti-Oligarchy Tour Will Backfire",
    "description": "John Morgan told Chris Cuomo that Bernie Sanders' anti-oligarchy tour featuring Alexandria Ocasio-Cortez is an error.",
    "link": "https://dailycaller.com/2025/03/21/its-a-mistake-megadonor-who-left-democrats-says-bernie-sanders-and-aocs-anti-oligarchy-tour-will-backfire/",
    "timestamp": "2025-03-21T14:42:30Z"
  },
  {
    "title": "Map Shows Ukraine's Nuclear Plants Eyed by Trump",
    "description": "A Newsweek map shows where Ukraine's four nuclear plants are located, some of which U.S. President Donald Trump has said he wants America to help run.\nThe Context\nTrump said he thinks the U.S. could \"very helpful\" in running Ukraine's electrical supply and nu…",
    "link": "https://biztoc.com/x/d11f8877250a916b",
    "timestamp": "2025-03-21T14:42:17Z"
  },
  {
    "title": "Trump Effect: J&J Plans $55 Billion US Investment To \"Accelerate American Innovation Engine\"",
    "description": "Trump Effect: J&J Plans $55 Billion US Investment To \"Accelerate American Innovation Engine\"\n \nThe latest development in the US onshoring trend—spurred by President Donald Trump—is Johnson & Johnson's announcement Friday morning of a massive $55 billion inves…",
    "link": "https://biztoc.com/x/926157c26ee88a17",
    "timestamp": "2025-03-21T14:42:14Z"
  },
  {
    "title": "US government blocks Canadian access to border-straddling library, Canadian town says",
    "description": "TORONTO (Reuters) - A Quebec town is calling out what it says is a unilateral decision by U.S. authorities to close Canadian access to a library that straddles the Canada-U.S. border. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/21/us-government-blocks-canadian-access-to-border-straddling-library-canadian-town-says",
    "timestamp": "2025-03-21T14:42:00Z"
  },
  {
    "title": "Tariffs are ‘simply inflationary,’ economist says: Here’s how they fuel higher prices",
    "description": "There was an oft-repeated message in Federal Reserve chair Jerome Powell’s press conference on Wednesday: Tariffs will raise consumer prices. The U.S. central bank raised its inflation forecast for 2025, as have many economists, due to the expected impact of …",
    "link": "https://freerepublic.com/focus/f-chat/4305834/posts",
    "timestamp": "2025-03-21T14:41:57Z"
  },
  {
    "title": "US blocking Canadian access to historical library on Quebec-Vermont border",
    "description": "Haskell Free Library denounces 'unilateral' US move amid tensions over Donald Trump's continued threats against Canada.",
    "link": "https://www.aljazeera.com/news/2025/3/21/us-blocking-canadian-access-to-historical-library-on-quebec-vermont-border",
    "timestamp": "2025-03-21T14:40:50Z"
  },
  {
    "title": "Public Health Experts Say Texas Is Poised to Make Measles a Nationwide Epidemic",
    "description": "The outbreak has reached 11 counties in the state and has been linked to cases in New Mexico and Oklahoma.",
    "link": "https://www.texastribune.org/2025/03/21/texas-measles-vaccine-new-mexico-oklahoma-us/",
    "timestamp": "2025-03-21T14:38:55Z"
  },
  {
    "title": "Conor McGregor Appeals Rape Case As He Begins Election Bid",
    "description": "Lawyers for Irish mixed martial arts star Conor McGregor's began an appeal Friday after a woman won a civil court damages claim over her allegation that he raped her.",
    "link": "https://www.ibtimes.com/conor-mcgregor-appeals-rape-case-he-begins-election-bid-3767215",
    "timestamp": "2025-03-21T14:36:19Z"
  },
  {
    "title": "Maine universities agree to keep transgender athletes out of women's sports after Trump admin pauses funding",
    "description": "Any false claim by the UMaine can, and will, result in onerous and even potentially criminal financial liability,' the USDA warned.. The U.S. Department of Agriculture announced Wednesday that the University of Maine System (UMS) has agreed to comply with Pre…",
    "link": "https://freerepublic.com/focus/f-news/4305832/posts",
    "timestamp": "2025-03-21T14:35:42Z"
  },
  {
    "title": "Elon Musk's Daughter Condemns Work With Trump: 'Cartoonishly Evil'",
    "description": "Vivian Jenna Wilson condemned her father's work with Trump, describing Elon Musk as \"delusional.\"",
    "link": "https://www.newsweek.com/elon-musk-daughter-vivian-wilson-donald-trump-evil-2048441",
    "timestamp": "2025-03-21T14:35:22Z"
  },
  {
    "title": "388 Indians deported from US since January 2025: Govt in LS",
    "description": "NEW DELHI: Around 388 Indian nationals have been deported from the US since January 2025, the government informed Parliament on Friday. Of these, 333 Indians were deported directly from the US to India on three separate flights in February. Separately, the US…",
    "link": "https://statetimes.in/388-indians-deported-from-us-since-january-2025-govt-in-ls/",
    "timestamp": "2025-03-21T14:34:37Z"
  },
  {
    "title": "Florida AG: Why So Mad At Musk Who Only Wants To Destroy Government?",
    "description": "Florida AG James Uthmeier told Fox News that he will give a raise and a promotion to any law enforcement official that arrests someone caught defacing a Tesla.\nUthmeier is clueless when it comes to the anger Americans face watching the richest man in the worl…",
    "link": "https://crooksandliars.com/2025/03/florida-ag-why-are-people-mad-musk-who",
    "timestamp": "2025-03-21T14:34:34Z"
  },
  {
    "title": "Map Shows Ukraine's Nuclear Plants Eyed by Trump",
    "description": "Trump said he thinks the United States could prove \"very helpful\" in running Ukraine's nuclear plants.",
    "link": "https://www.newsweek.com/map-ukraine-nuclear-plants-donald-trump-2048527",
    "timestamp": "2025-03-21T14:34:00Z"
  },
  {
    "title": "Trump v. Boasberg: If This Isn’t a Constitutional Crisis, What Is?",
    "description": "Think we’re not in a constitutional crisis yet? We’re not. We’re in several. One involves Elon Musk and DOGE, barging their way into the United States Institute for Peace, created by Congress under Ronald Reagan, with DOGE staffers apparently ripping the orga…",
    "link": "https://newrepublic.com/post/193018/trump-boasberg-bondi-constitutional-crisis",
    "timestamp": "2025-03-21T14:33:27Z"
  },
  {
    "title": "Pesky Judges",
    "description": "Courts stop DOGE from accessing Social Security Administration data and prevent Homeland Security from deporting Georgetown fellow Badar Khan Suri.",
    "link": "https://reason.com/2025/03/21/pesky-judges/",
    "timestamp": "2025-03-21T14:33:01Z"
  },
  {
    "title": "AOC and Bernie Slam Trump Admin’s ‘Disdain’ for Working People at Packed Rallies",
    "description": "Sen. Bernie Sanders and Rep. Alexandria Ocasio-Cortez bashed the Trump administration during packed rallies in Nevada and Arizona on Thursday.",
    "link": "http://www.rollingstone.com/politics/politics-news/aoc-bernie-sanders-slam-trump-disdain-working-people-1235300920/",
    "timestamp": "2025-03-21T14:32:48Z"
  },
  {
    "title": "Rosie O’Donnell feels ‘safer,’ has less ‘stress and anxiety’ after leaving ‘overwhelmingly depressing’ US over Trump election",
    "description": "\"It's not easy to move to another country and we really felt as a family this was the safest and best thing for us to do,\" the former talk show host said.",
    "link": "https://pagesix.com/2025/03/21/celebrity-news/rosie-odonnell-feels-safer-after-leaving-us-over-trump-election/",
    "timestamp": "2025-03-21T14:31:03Z"
  },
  {
    "title": "Trump Admin Arrests FBI Agent Who Went After Rudy Giuliani",
    "description": "A veteran FBI agent who blew the whistle on what he saw as political meddling in the bureau’s work was arrested this week by federal authorities while attempting to board an international flight at New York City’s JFK Airport. Jonathan Buma, who had worked fo…",
    "link": "https://freerepublic.com/focus/f-chat/4305830/posts",
    "timestamp": "2025-03-21T14:30:43Z"
  },
  {
    "title": "Senator Sanders targets Trump, Musk and Democrats in wide-ranging interview ahead of rally with AOC",
    "description": "In a Fox News Digital interview, Sen. Bernie Sanders of Vermont takes aim at Donald Trump, Elon Musk, Republicans, and Democrats.",
    "link": "https://www.foxnews.com/politics/bernie-sanders-targets-trump-musk-democrats-wide-ranging-interview-ahead-rally-aoc",
    "timestamp": "2025-03-21T14:30:18Z"
  },
  {
    "title": "The Magnificent 7's lousy year, by the numbers",
    "description": "It's been a painful year so far for megacap technology giants and 2025 is only getting started.",
    "link": "https://www.cnbc.com/2025/03/21/the-magnificent-7s-lousy-year-by-the-numbers-meta-tesla.html",
    "timestamp": "2025-03-21T14:30:16Z"
  },
  {
    "title": "New IOC President Says Meeting Olympians On Climate ‘A Priority’",
    "description": "400 Olympians urged the incoming IOC President to lead on climate action. Newly elected Kirsty Coventry confirmed that meeting with them would be a \"priority.\"",
    "link": "https://www.forbes.com/sites/clairepoolesp/2025/03/21/new-ioc-president-says-meeting-olympians-on-climate-a-priority/",
    "timestamp": "2025-03-21T14:28:10Z"
  },
  {
    "title": "Trump Calls on John Roberts to Block Injunctions",
    "description": "\"President Donald Trump demanded that Chief Justice John Roberts and the U.S. Supreme Court rein in federal judges who have issued injunctions around the country that have impeded an array of his policies,\" USA Today",
    "link": "https://politicalwire.com/2025/03/21/trump-calls-on-john-roberts-to-block-injunctions-to-his-policies/",
    "timestamp": "2025-03-21T14:27:47Z"
  },
  {
    "title": "Crucial mRNA vaccine research at risk in the US",
    "description": "Scientists in the US who do research on mRNA technology worry their funding may be cut under President Trump. mRNA technology is the basis for COVID- and other vaccines and could play a role in cancer treatment.",
    "link": "https://www.dw.com/en/crucial-mrna-vaccine-research-at-risk-in-the-us/a-71989604",
    "timestamp": "2025-03-21T14:27:00Z"
  },
  {
    "title": "Trump White House begins review of federal agency plans for second round of mass layoffs",
    "description": "White House officials are reviewing agency downsizing plans, a move expected to lead to firing thousands of federal workers within the coming weeks.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/21/trump-white-house-mass-layoffs-agency-review/82589632007/",
    "timestamp": "2025-03-21T14:25:44Z"
  },
  {
    "title": "Improving Education Outcomes by Empowering Parents, States, and Communities (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nImproving Education Outcomes by Empowering Parents, States, and Communities  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and to enable parents, te…",
    "link": "https://www.memeorandum.com/250321/p39",
    "timestamp": "2025-03-21T14:25:02Z"
  },
  {
    "title": "Canadians just don't like Elon Musk as Tesla vandalism spreads across the country amid backlash against Donald Trump administration",
    "description": "Tesla faces vandalism in Canada amid Elon Musk’s controversial remarks and trade tensions with the U.S., highlighting climate activism, government retaliation, and public backlash over political alliances.",
    "link": "https://economictimes.indiatimes.com/news/international/us/canadians-just-dont-like-elon-musk-as-tesla-vandalism-spreads-across-the-country-amid-backlash-against-donald-trump-administration/articleshow/119307758.cms",
    "timestamp": "2025-03-21T14:24:36Z"
  },
  {
    "title": "Russian drones strike Ukrainian city of Odesa, underlining challenges for even limited truce",
    "description": "The attack underlined Moscow’s intention to pursue aerial attacks even as it agreed to temporarily halt strikes on energy facilities.",
    "link": "https://www.bostonherald.com/2025/03/21/russia-drone-strikes-ukraine-odesa/",
    "timestamp": "2025-03-21T14:24:12Z"
  },
  {
    "title": "Tim Walz Claims Without Evidence That Segregation Will Return If Education Department Is Closed Down",
    "description": "Democratic Gov. Tim Walz of Minnesota claimed the Trump administration’s decision to shutter the Department of Education would allow segregation to resume.",
    "link": "https://dailycaller.com/2025/03/21/tim-walz-claims-without-evidence-that-segregation-will-return-if-education-department-is-closed-down/",
    "timestamp": "2025-03-21T14:24:06Z"
  },
  {
    "title": "Trump eyeing Crimea as ‘international resort’ – Hersh",
    "description": "The renowned American journalist has claimed that the US president wants to do business with Russian counterpart Vladimir Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614596-trump-crimea-resort-hersh/",
    "timestamp": "2025-03-21T14:23:17Z"
  },
  {
    "title": "What the $660 Million Greenpeace Verdict Means for US Activism",
    "description": "A North Dakota jury this week found Greenpeace liable for defamation, conspiracy and other claims over its participation in the Dakota Access pipeline protests that lasted from 2016 to 2017, awarding developer Energy Transfer LP $660 million in damages. Legal…",
    "link": "https://financialpost.com/pmn/business-pmn/what-the-660-million-greenpeace-verdict-means-for-us-activism",
    "timestamp": "2025-03-21T14:22:52Z"
  },
  {
    "title": "Maine Universities Agree to Keep Men Out of Women’s Sports After Trump Admin Funding Pause",
    "description": "The USDA announced that the University of Maine System (UMS) has agreed to keep transgender-identifying men out of women's sports.\nThe post Maine Universities Agree to Keep Men Out of Women’s Sports After Trump Admin Funding Pause appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/03/21/maine-universities-agree-to-keep-men-out-of-womens-sports-after-trump-admin-funding-pause/",
    "timestamp": "2025-03-21T14:22:27Z"
  },
  {
    "title": "Buy ‘em By The Case. With 200% Tariffs Looming Over Champagne, You Still Have Time To Purchase Those Bottles Already In U.S. Wine Stores",
    "description": "The U.S. has long been Champagne's major importer, now in doubt if 200% tariffs go into effect April 1.",
    "link": "https://www.forbes.com/sites/johnmariani/2025/03/21/buy-em-by-the-case-with-200-tariffs-looming-over-champagne-you-still-have-time-to-purchase-those-bottles-already-imported/",
    "timestamp": "2025-03-21T14:21:50Z"
  },
  {
    "title": "VF: A source close to Prince Harry said he was ‘properly admitted to the US’",
    "description": "Prince Harry’s immigration/residency status was once again in the news this week after a federal judge authorized a more thorough release of Harry’s visa records. Harry permanently moved to the United States in March 2020, during Donald Trump’s first term, bu…",
    "link": "https://www.celebitchy.com/914563/vf_a_source_close_to_prince_harry_said_he_was_properly_admitted_to_the_us/",
    "timestamp": "2025-03-21T14:20:44Z"
  },
  {
    "title": "Tether is in talks with 'Big Four' firm about reserve audit, CEO says",
    "description": "By Hannah Lang and Elizabeth Howcroft\n(Reuters) - Tether, the creator of the world's largest stablecoin, is \"engaging with a Big Four accounting firm\" as it pushes for a long-awaited audit of its reserves, an effort CEO Paolo Ardoino said will be easier under…",
    "link": "https://biztoc.com/x/bdbcb4f8785bf477",
    "timestamp": "2025-03-21T14:20:14Z"
  },
  {
    "title": "Why did Conor McGregor meet Donald Trump in the Oval office? McGregor says he will run to be Ireland’s President, fueling political ambitions and controversy",
    "description": "Conor McGregor’s Oval Office Meeting with Donald Trump has stirred global attention. On March 17, 2025, McGregor met Trump in the White House, discussing Ireland’s political landscape, focusing on immigration and transparency. While McGregor aims to influence…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-did-conor-mcgregor-meet-donald-trump-in-the-oval-office-mcgregor-says-he-will-run-to-be-irelands-president-fueling-political-ambitions-and-controversy/articleshow/119305536.cms",
    "timestamp": "2025-03-21T14:18:46Z"
  },
  {
    "title": "Crypto's Fairshake PAC Backs Republicans With Last-Minute Cash in Florida Races",
    "description": "The high-profile campaign operation is putting $1.5 million into Florida special elections that could have significant consequences for the House GOP majority.",
    "link": "https://www.coindesk.com/policy/2025/03/21/crypto-s-fairshake-pac-backs-republicans-with-last-minute-cash-in-florida-races",
    "timestamp": "2025-03-21T14:18:27Z"
  },
  {
    "title": "Soros Comes for Schumer - Dem Leader Faces End of His Career as Soros-Backed Org Marks Him for Elimination",
    "description": "Soros Comes for Schumer - Dem Leader Faces End of His Career as Soros-Backed Org Marks Him for Eliminationwesternjournal.com",
    "link": "https://www.westernjournal.com/soros-comes-schumer-dem-leader-faces-end-career-soros-backed-org-marks-elimination/",
    "timestamp": "2025-03-21T14:17:30Z"
  },
  {
    "title": "Trump proudly displays Declaration of Independence – but is it the original?",
    "description": "President Donald Trump gave Fox News host Laura Ingraham a special look at a framed display of the Declaration of Independence that he had moved into the Oval Office, which White House Press Secretary Karoline Leavitt said would be “carefully protected and pr…",
    "link": "https://nypost.com/video/trump-proudly-displays-declaration-of-independence-but-is-it-the-original/",
    "timestamp": "2025-03-21T14:16:43Z"
  },
  {
    "title": "Remember the Tea Party Movement? Why Democrats Need the Equivalent...and Right Now",
    "description": "Remember back when Barack Obama was first elected to the White House, and the Republicans lost so much of their collective damn mind at the idea of a brother in the Oval Office that they created the whole Tea Party movement? Black folks knew what time it was …",
    "link": "https://www.theroot.com/remember-the-tea-party-movement-why-democrats-need-the-1851771540",
    "timestamp": "2025-03-21T14:12:00Z"
  },
  {
    "title": "European nations reconsidering troop deployment in Ukraine – FT",
    "description": "Supporters of Kiev are shifting their strategy toward air and sea patrols, according to the newspaper Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614586-ukraine-peacekeepers-no-boots/",
    "timestamp": "2025-03-21T14:11:40Z"
  },
  {
    "title": "Trump crackdown on transgender athletes in girls' sports gets GOP backup in House bill",
    "description": "A new House GOP bill seeks to codify President Donald Trump's executive order on transgender athletes.",
    "link": "https://www.foxnews.com/politics/trump-crackdown-transgender-athletes-girls-sports-gets-gop-backup-house-bill",
    "timestamp": "2025-03-21T14:10:28Z"
  },
  {
    "title": "Regulators recall nearly all of Tesla’s Cybertrucks",
    "description": "It's the eighth recall of the Tesla vehicles since deliveries to customers began just over a year ago.",
    "link": "https://www.pennlive.com/business/2025/03/regulators-recall-nearly-all-of-teslas-cybertrucks.html",
    "timestamp": "2025-03-21T14:09:32Z"
  },
  {
    "title": "Department of Education Shutdown: Which 'Useful Functions' are Being Saved",
    "description": "President Trump stated that certain functions will be \"fully preserved\" and transferred to other agencies.",
    "link": "https://www.newsweek.com/which-department-education-functions-being-saved-2048414",
    "timestamp": "2025-03-21T14:08:53Z"
  },
  {
    "title": "Trump Criticizes Poor Education in US",
    "description": "President Donald Trump signed an executive order to largely dismantle the Education Department — an organization created by Congress and tasked with sweeping responsibilities that involve billions in funds that impact millions of American students.\nThe move i…",
    "link": "https://biztoc.com/x/f08eeabb41223766",
    "timestamp": "2025-03-21T14:07:56Z"
  },
  {
    "title": "Jackie Robinson web page purge due to human error in race to meet DEI deadline",
    "description": "Human error was the cause of the purging of the feature about Jackie Robinson's military service on the Department of Defense's website.",
    "link": "https://www.foxnews.com/sports/jackie-robinson-web-page-purge-due-human-error-race-meet-dei-deadline",
    "timestamp": "2025-03-21T14:07:07Z"
  },
  {
    "title": "New day, new problem: Tesla owners ditch EVs in record numbers as Elon Musk’s political ties with Donald Trump spark controversy",
    "description": "Tesla trade-ins hit record highs as Elon Musk’s Trump advisory role sparks backlash. Explore the surge in used EV depreciation, protests over political ties, and how brand loyalty shifts amid Tesla’s market saturation and vandalism incidents.",
    "link": "https://economictimes.indiatimes.com/news/international/us/new-day-new-problem-tesla-owners-ditch-evs-in-record-numbers-as-elon-musks-political-ties-with-donald-trump-spark-controversy/articleshow/119307209.cms",
    "timestamp": "2025-03-21T14:06:33Z"
  },
  {
    "title": "Gold Prices decline: Key factors behind the drop and crucial levels to watch next week",
    "description": "Gold surged to multiple record highs in 2025, reaching an all-time peak of $3,057.21 per ounce on Thursday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-prices-decline-key-factors-behind-the-drop-and-crucial-levels-to-watch-next-week/articleshow/119307046.cms",
    "timestamp": "2025-03-21T14:06:32Z"
  },
  {
    "title": "Trump's latest Elon Musk move shows 'just how weak' the President is: Dem lawmaker",
    "description": "Rep. Steve Horsford (D-NV) on Friday heaped scorn on President Donald Trump for reportedly allowing Elon Musk to receive a briefing on top-secret war plans.Appearing on CNN, Horsford addressed the rage being expressed by Democratic voters at town hall meeting…",
    "link": "https://www.rawstory.com/elon-musk-china-2671378083/",
    "timestamp": "2025-03-21T14:06:17Z"
  },
  {
    "title": "Anti-Tesla protestors to face unprecedented consequences? Trump's blunt warning sparks buzz",
    "description": "Amid a wave of attacks on Tesla's dealerships and vehicles, President Donald Trump has come out in support of his key ally and DOGE chief Elon Musk. Trump has issued a very strict warning for those who are found convicted in Tesla violence case. Several Tesla…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-tesla-attacks-trump-send-tesla-vandals-el-salvador-prison-anti-tesla-protestors-to-face-unprecedented-consequences-trumps-blunt-warning-sparks-buzz/articleshow/119307052.cms",
    "timestamp": "2025-03-21T14:04:49Z"
  },
  {
    "title": "Republican Behind 'Trump Derangement' Bill Quits After Sex Charge",
    "description": "The Minnesota state Senator is accused of soliciting prostitution from someone he believed to be a minor.",
    "link": "https://www.newsweek.com/republican-behind-trump-derangement-syndrome-bill-resigns-justin-eichorn-2048418",
    "timestamp": "2025-03-21T14:04:35Z"
  },
  {
    "title": "'Snow White' Called Out Over Vacant Seats Prior to Premiere",
    "description": "Disney's live-action remake of the 1937 film premieres Friday but some people are predicting it's going to bomb.",
    "link": "https://www.newsweek.com/snow-white-called-out-empty-theater-seats-2048365",
    "timestamp": "2025-03-21T14:04:11Z"
  },
  {
    "title": "Chinese anger at sale of Panama Canal ports to US investor highlights tensions between the two superpowers",
    "description": "Competition over the Panama Canal shows how US-Chinese rivalry is hotting up.",
    "link": "https://theconversation.com/chinese-anger-at-sale-of-panama-canal-ports-to-us-investor-highlights-tensions-between-the-two-superpowers-252418",
    "timestamp": "2025-03-21T14:03:39Z"
  },
  {
    "title": "Google, OpenAI target state laws in AI action plan",
    "description": "The federal government is developing plans for AI policy in the U.S. Stakeholders want a federal policy preempting state laws as a top strategic priority.",
    "link": "https://www.techtarget.com/searchenterpriseai/news/366621060/Google-OpenAI-target-state-laws-in-AI-action-plan",
    "timestamp": "2025-03-21T14:03:00Z"
  },
  {
    "title": "Dow falls 350 points, S&P 500 heads for fifth-straight losing week: Live updates",
    "description": "U.S. stocks fell Friday morning, putting the S&P 500 on pace to extend its monthlong rout caused by trade policy turmoil, recession fears and a rollover in megacap technology shares. The S&P 500 fell 0.8%, while the Nasdaq Composite pulled back 1%. The Dow Jo…",
    "link": "https://freerepublic.com/focus/f-news/4305825/posts",
    "timestamp": "2025-03-21T14:01:45Z"
  },
  {
    "title": "‘It’s not what he expected’: Rubio has competition for the role of America’s top diplomat | CNN Politics",
    "description": "When Marco Rubio signed on as Donald Trump’s Secretary of State, he went into the job “with eyes wide open,” according to a person familiar with his thinking. He knew it wouldn’t be easy working for Trump. He knew that Trump had a track record of firing top o…",
    "link": "https://www.cnn.com/2025/03/21/politics/rubio-competition-for-role-of-americas-top-diplomat/index.html",
    "timestamp": "2025-03-21T14:00:52Z"
  },
  {
    "title": "On Trump's Order, Education Dept Grabbed Off Street, Sold Into Salvadoran Supermax",
    "description": "Administration denies knowledge. You know, in general.",
    "link": "https://www.wonkette.com/p/on-trumps-order-education-dept-grabbed",
    "timestamp": "2025-03-21T14:00:40Z"
  },
  {
    "title": "Court order halting deportation flights ‘unconstitutionally impedes’ on executive branch, Trump allies argue",
    "description": "FIRST ON FOX: In a new amicus filing, America First Legal and GOP Rep. Brandon Gill argue in support of President Donald Trump’s authority to invoke a 1798 wartime law as part of his immigration agenda.",
    "link": "https://www.foxnews.com/politics/court-order-halting-deportation-flights-unconstitutionally-impedes-executive-branch-trump-allies-argue",
    "timestamp": "2025-03-21T14:00:27Z"
  },
  {
    "title": "Schools in Rochester, NY, Grapple With DEI Policies in the Age of Trump",
    "description": "\"support for the use of DEI statements in hiring recently has begun to wane as some of the nation’s top colleges and universities have dropped them\"\nThe post Schools in Rochester, NY, Grapple With DEI Policies in the Age of Trump first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/03/schools-in-rochester-ny-grapple-with-dei-policies-in-the-age-of-trump/",
    "timestamp": "2025-03-21T14:00:27Z"
  },
  {
    "title": "FBI scales back staffing, tracking of domestic terrorism probes, sources say",
    "description": "The FBI’s restructuring of resources could weaken its ability to track domestic extremist plots.",
    "link": "https://www.jpost.com/international/article-847050",
    "timestamp": "2025-03-21T14:00:17Z"
  },
  {
    "title": "While Trump Delivers Real ‘Hope and Change,’ Obama, Clinton Watch Democratic Party Become Clown Car",
    "description": "The Democratic Party is in free fall. Once a party of pragmatic leadership, strong borders, fiscal responsibility, and law and order, it has devolved into... Read More\nThe post While Trump Delivers Real ‘Hope and Change,’ Obama, Clinton Watch Democratic Party…",
    "link": "https://www.dailysignal.com/2025/03/21/democrats-lurch-left/",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "Trump won over many Arab Americans in November. How do they feel about him now?",
    "description": "In Detroit and its suburbs, where support shifted towards Trump during the election, anger is deep over Israeli airstrikes in Gaza",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/03/20/us/trump-arab-americans-gaza-israel.html",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "Trade with Canada: Montana farmers, home builders, drivers could be hit by Trump's tariffs",
    "description": "Montana's largest trading partner, by far, is Canada. Farmers, ranchers, home builders and gasoline prices could be impacted by tariffs.",
    "link": "https://missoulian.com/news/local/business/article_5a099e54-0422-11f0-98f8-4fd025b076e2.html",
    "timestamp": "2025-03-21T14:00:00Z"
  }
]